{
    "id": "24346537",
    "url": "https://archiveofourown.org/works/24346537?view_full_work=true",
    "author": [
        "cafecliche"
    ],
    "title": "grow",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen",
        "M/M"
    ],
    "fandoms": [
        "魔道祖师 - 墨香铜臭 | Módào Zǔshī - Mòxiāng Tóngxiù"
    ],
    "relationships": [
        "Lan Yuan | Lan Sizhui & Wei Ying | Wei Wuxian",
        "Lan Yuan | Lan Sizhui & Lan Zhan | Lan Wangji",
        "Lan Zhan | Lan Wangji/Wei Ying | Wei Wuxian"
    ],
    "characters": [
        "Lan Yuan | Lan Sizhui",
        "Wei Ying | Wei Wuxian",
        "Lan Zhan | Lan Wangji",
        "Lan Jingyi",
        "Jin Ling | Jin Rulan",
        "Ouyang Zizhen",
        "Lan Huan | Lan Xichen",
        "Wen Ning | Wen Qionglin",
        "Lan Qiren"
    ],
    "additional_tags": [
        "Age Regression/De-Aging",
        "Character Study",
        "in which I started off talking about Wei Wuxian's childhood",
        "and ended up talking about Sizhui's childhood too",
        "Post-Canon",
        "Podfic Available"
    ],
    "language": "English",
    "series": "",
    "published": "2020-05-24",
    "completed": null,
    "words": "14,444",
    "chapters": "1/1",
    "comments": "1,583",
    "kudos": "33,385",
    "bookmarks": "9,838",
    "hits": "246,238",
    "summary": "<p>“Okay,” Jingyi says, as Sizhui puzzles this out aloud. “Okay! So the demon has been turning its victims into children.”</p>\n<p>“I think so,” Sizhui says.</p>\n<p>“To make them easier prey,” Jingyi says.</p>\n<p>“Yes,” Sizhui says.</p>\n<p>“So—” Jingyi’s voice cracks here, “this kid is Senior Wei.”</p>\n<p>Wei Wuxian, still tangled in his own massive robes, blinks politely at them. </p>\n<p>(Or: Wei Wuxian is cursed on a night-hunt, and the junior quartet rapidly finds themselves in over their heads.)</p>",
    "notes": "<p>WHEW, WE MADE IT. Huge thank you to all of you who cheered this idea on when it was a 11pm crying thread on Twitter, and big thanks especially to the lovely people who have been reading all my draft snippets for the past several weeks, especially Aubrey for her always-insightful beta read and Lore for catching some punctuation shenanigans. (A few more spoilery shoutouts can be found at the bottom!)</p>\n<p>A few quick warnings on this one: this fic deals with both WWX and Sizhui's childhood, and obliquely discusses food security issues, as well as WWX's time living on the streets. </p>\n<p>Thank you so much for all your support, and I hope you enjoy it!!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Thank you so much to:<br>- Fey for suggesting the 'A-Ying knocks over a cup of tea' scene<br>- Carrie for suggesting 'Jingyi accidentally teaches A-Ying to say fuck'</p>\n<p>And if you'd like to find me on Twitter and yell about Wangxian, I'm at @bee_off_main!</p>",
    "text": "It doesn’t really matter which one of them steps into the array first. \n(It’s Jin Ling. But when Lan Sizhui remembers that later, he’ll keep it to himself.)\nBut truly, it’s beyond the point. Lan Jingyi is close behind him, and Ouyang Zizhen right on his heels. Sizhui is the first to see it. But in his hurry to move forward and herd all three of them out, his own foot lands on the inside edge.\nThis is when three things happen in quick succession. The ground glows bright and hot. Wei Wuxian calls his name. And two hands take Sizhui by the shoulders and pitch him sideways, almost off his feet.\nThe clearing flashes once, like lightning, and dissolves into white. \n***\nSizhui’s ears stop ringing first. \n“Jingyi-xiong?” Ouyang Zizhen gasps, somewhere to Sizhui’s left. “Are you—”\nA squawk of pain Sizhui would know anywhere – Jingyi’s. “Zizhen-xiong, those were my ribs—”\n“Who’s on me?” Jin Ling, completely fine judging by the volume of his voice. “Get off me!”\nSizhui feels his way around himself. He’s still on the ground. He should have guessed that. But between the light and the impact, bright spots are still obscuring his vision. The panic that follows sweeps away everything else.\n“Senior Wei?” he calls. And when no reply comes, it’s like falling all over again. “Did you see what happened to Senior Wei?”\n“Senior Wei? He was—” Jingyi cuts himself off, his voice sharp with fear. “Senior Wei! Can you hear us?”\n“Wei Wuxian!” Jin Ling barks. “Answer us!”\n“Sizhui-xiong,” Ouyang Zizhen says. “In the array…”\nSizhui scrambles to his feet, legs quivering under him. The afterimage of the spell has started to fade from his vision, and the clearing swims into view. No Wei Wuxian that he can see. Just a figure huddled in the array. \nStomach roiling, Sizhui lurches forward. “Senior Wei, are you—”\nThe figure flinches back.\nSizhui slows. And it’s then that he really looks. The person on the ground isn’t Wei Wuxian’s height, weight, build, or even age. He’s looking at a child, maybe four or five. His gray eyes are wide, trained on Sizhui. His dark hair is loose and tangled around his hunched shoulders. He’s swaddled in robes several magnitudes too large for him, and there’s a discarded red ribbon curled at his side. \nSizhui allows himself about ten seconds of disbelief. But he knows perfectly well who he’s looking at.\n“Senior—” Sizhui stops short. The boy blinks, hesitant but curious, and Sizhui pitches his voice lower. “Wei Ying?”\nThe child makes a tiny, questioning sound, tilting his head to one side. Then he whispers, “Yes?”\nFrom the other side of the clearing, Jingyi raises his hand. “I’m sorry,” he says. “What the fuck?” \n***\nThe first reports of the mountain demon surfaced about a week ago, a little down the river from Cloud Recesses.\nMountain demons are nothing unusual. And with only one leg, they’re not very hard to outrun. But this mountain demon, as Wei Wuxian put it, didn’t play fair. According to locals, the demon set cursed arrays through the woods, barely visible. Traps to leave its victims defenseless.\nThat was what they were looking for this morning. A mountain demon’s hunting hours are much later, well into the night. But Wei Wuxian had hoped to find and disable the arrays first, and if possible, figure out how they worked. There were no survivors to tell, after all. The only traces of the victims were their bones.\nSizhui had a few running theories. None of them, in the end, were even close.\n“Okay,” Jingyi says, as Sizhui puzzles this out aloud. “Okay! So the demon has been turning its victims into children.”\n“I think so,” Sizhui says.\n“To make them easier prey,” Jingyi says.\n“Yes,” Sizhui says.\n“So—” Jingyi’s voice cracks here, “this kid is Senior Wei.”\nWei Wuxian, still tangled in his own massive robes, blinks politely at them. \n“If I may repeat myself,” Jingyi says, “what the fuck.”\n“Jingyi,” Sizhui says, “not in front of Senior Wei.”\n“It’s Senior Wei!” Jingyi hisses back. “He already knows that word!”\n“Jingyi-xiong,” Ouyang Zizhen says, “calm down.”\n“I’m sorry,” Jingyi says, “is my justifiable terror bothering you?”\nOuyang Zizhen shoots him an uncharacteristic glare. “Kids are really sensitive to raised voices. How would you feel if you were that little, surrounded by yelling strangers?”\n“How do we know he doesn’t recognize us?” Jin Ling’s hands rise to his hips as he turns back to Wei Wuxian. “Hey, do you know who we are?”\nWei Wuxian doesn’t flinch, exactly, but he coils into himself. His expression is still neutral, if a little cautious, but Ouyang Zizhen is right. They’re scaring him.\n“Could you all move back?” Sizhui murmurs. “I’ll try talking to him.”\nSizhui folds to his knees until he’s nearly eye level with Wei Wuxian, who has migrated into a little ball in the center of the array. Sizhui’s stomach does a neat little twist. Wei Wuxian so rarely looks small.\nBut there’s also something soft and questioning in the crease of his brow, in the way he’s making eye contact with Sizhui even now. Almost like he looks at Sizhui as an adult, when he’s waiting for him to wrap his mind around a half-formed thought. He’s not so scared that he’s closed off. He’s watching to see what Sizhui does.\n“Wei—” Sizhui pauses. Allows himself a second to recognize how absolutely bizarre this is. And then softly calls, “A-Ying.”\nWei Wuxian tilts his head, just a little, to the side. And then slowly, he uncurls. “Gege knows me?”\n“Oh gods,” Jingyi says. “Oh no, he called you gege. Oh no.”\n“Don’t laugh at him, Jingyi-xiong,” Ouyang Zizhen says.\n“I’m not laughing,” Jingyi says. “It’s so cute I wanna die.”\nSizhui tunes them out, biting at this lip. If his math is right—well—Wei Wuxian was orphaned around this age. He needs to gain his trust somehow. But to tell him that they know his parents seems cruel. “You don’t remember this, but we came here with you, A-Ying. We’re very good friends of yours.”\n“Oh.” Wei Wuxian—A-Ying—is still frowning. But he doesn’t seem overtly suspicious of that. “I don’t remember?”\nSizhui falters. But Ouyang Zizhen jumps right in. “You’re under a curse, A-Ying,” he says. Which is good thinking. And technically true. “You must be pretty confused, huh?”\nA-Ying relaxes even further at that. “Yeah,” he says softly. Jingyi makes a tortured little sound in his throat. \n“I’ll bet you’re tired, too.” Ouyang Zizhen’s tone is low, soothing. “It must be hard to walk in those big robes. Why don’t you let that gege in white carry you? He’s very strong.”\nA-Ying locks eyes with Sizhui again. And a completely unwanted thought surfaces in Sizhui’s mind: that this is the second time in his life he’s looked at Wei Wuxian’s eyes in another body.\nWhether Jingyi catches his hesitation, or whether he just wants to pick up A-Ying, it’s hard to say. He moves forward regardless. “I’ll do it,” he says. “C’mere, A-Ying, I’ve got you.”\n“Just don’t drop him,” Jin Ling says.\n“Excuse you,” Jingyi says, “how many novices have you taken night-hunting lately? They’re like small dogs. They never want to walk by the end.” \n“Dog?” A-Ying, who’d been making his careful way to Jingyi in his massive robes, stops short. His face, already pale, loses the rest of its color. “There’s a dog?”\n“Ah—” Jingyi says. “No, I didn’t mean—”\nSensing Jingyi floundering, Sizhui shakes himself out of his own daze. He flashes a reassuring smile to Jingyi, who mouths an anguished What have I done?, and lays a careful hand on A-Ying’s shoulder. “There are no dogs here, A-Ying.” \n“None?” A-Ying looks up at Sizhui dubiously. His robes, a dark blue set commissioned by Hanguang-jun, are pooling well past his feet. If Jingyi tries to carry him like this, they’re both going to trip.\n“None,” Sizhui repeats. “A-Ying, is it okay if I tie up the end of those robes for you? Then you can go play with my friend Jingyi.”\nWith a thoughtful hum, A-Ying glances down at his legs, as if weighing his options. Sizhui’s not sure he’s ever seen a child so careful, even among the ever-obedient Lan novices. Seeing Wei Wuxian so tentative—it doesn’t sit right in his stomach. \nThen A-Ying smiles, a sunny grin that hardly fits his little round face. “Okay!”\nSomewhere behind Sizhui, Jingyi makes a high keening sound.\nSizhui leads A-Ying over to the shade of a nearby tree, which gives the other three a chance to inspect the array, and sets A-Ying down facing away from them. He’s not sure if A-Ying is anxious watching them inspect it, like Sizhui himself probably would have been at that age. But maybe Wei Wuxian would have been curious even back then.\nThere’s only so much that can be done with the robes. For all that Wei Wuxian is shorter in Mo Xuanyu’s body than in his own, he’s still relatively tall, and Sizhui suspects that A-Ying is small for his age. In the end, Sizhui ties the end of the robe in a careful knot and tucks the rest around A-Ying like a nest. There’s a tailor in Caiyi who makes the novices’ robes. He’s bound to have spares at the shop.\nThey do need to go to Caiyi, figure out what they’re going to do next. It’s not safe for A-Ying here, even with the four of them. But the thought of leaving the woods without Wei Wuxian—without the Wei Wuxian they know, at least—is more than Sizhui wants to think about.\nBut Hanguang-jun isn’t here. Wei Wuxian, for all intents and purposes, isn’t here either. Sizhui is the head disciple of Gusu Lan. And that means he has to think about it.\nBy the time Sizhui blinks himself back to the present, A-Ying is staring, his head tipped quizzically to one side. Even through the knot in his chest, Sizhui can’t help but laugh. A-Ying’s hair is falling into his face.\n“Well, we have to do something about that,” he says. “Hold still a minute longer, A-Ying.”\nSizhui scoops the red ribbon up from where it had fallen, neatly side-stepping Jingyi and Jin Ling’s whispered argument – one crisis at a time, Sizhui reminds himself. A-Ying sits obediently as Sizhui gathers it into a knot, secure enough that it’ll hold and loose enough that it won’t tug at his scalp.\nHe ties off the ribbon, pulling back to survey his handiwork. “Is that comfortable, A-Ying?”\n“Mm!” A-Ying’s brow crinkles as he reaches up, gently patting down his new hairstyle. His fingers are careful, almost, like he just wants to map out the shape.\n“You like it?” Sizhui says. “It’s how my gege used to tie up my hair when I was little.”\nThe attentive little sound A-Ying makes is so polite beyond his years, Sizhui laughs. He’s traveled with Wei Wuxian enough times to know how quickly people open up to him. Maybe that was true even when he was this young.\nHe swallows. A-Ying’s expression shifts, goes inquisitive. That look hasn’t changed, either.\n“I don’t suppose you could tell me what to do,” Sizhui says softly.\nA-Ying frowns again, and kicking himself, Sizhui quickly schools his own expression back into a smile. Whatever the reason, A-Ying is watching Sizhui’s mood intently. Which means Sizhui needs to hold it together. \n“Nothing,” Sizhui says. “Let’s go back to see our friends, okay?” And carefully, he hoists A-Ying up into his arms.\nBy the time he crosses the clearing, Jingyi and Jin Ling are still arguing, but no longer anywhere in the vicinity of whispering. Jin Ling crosses his arms with entirely more force than necessary. The jade lotus root pendant at his hip swings, jangling as it knocks his Yunmeng Jiang bell. A-Ying perks up in Sizhui’s arms.\n“I’m just saying—” Jin Ling cuts himself off as Sizhui approaches, but his gaze lands on A-Ying, traces his stare to the pendant. He falters, his lips tight, and then detaches it to lay in A-Ying’s hands. “Hanguang-jun will know how to fix this. I say we tell him.”\n“Do you?” Jingyi says. “Because you’re terrified of Hanguang-jun.”\n“Who says I am?” Jin Ling draws himself higher. “I’m a sect leader now. We’re practically equals.”\nSizhui shifts A-Ying in his hold, watches him trace the patterns of Jin Ling’s pendant with a very un-Wei Wuxian-like hesitance. Jin Ling is absolutely terrified of Hanguang-jun. Sizhui keeps that to himself.\n“Even if we did get his stupid husband cursed,” Jin Ling continues, “it’s not like he’s gonna hurt us or anything.”\n“Young Mistress,” Jingyi says gravely. “That isn’t the worst that could happen.”\n“Then what’s the worst?” Jin Ling says.\nJingyi’s face darkens. Ouyang Zizhen, over his shoulder, looks queasy. “He might stop trusting us with Senior Wei.”\nJin Ling throws his hands in the air. “He’s the teacher!” he screeches. “They should need to trust him with us!”\n“Jin Ling,” Sizhui says warningly when he feels A-Ying twitch. “Volume.”\nJin Ling rounds on him, flushed red down to his neck, his mouth already open. But he shuts his eyes and, as if it pains him, takes a loud, slow breath in. \n“Okay, Lan Sizhui,” he grits out. “What do you suggest we do?”\nSizhui falters. A-Ying shifts in his arms, still inspecting the pendant. Jin Ling once said it was his mother’s. Maybe even now, Wei Wuxian recognizes it.\n“Please, Sizhui,” Jingyi says. “I swear if we can’t figure it out, we’ll go to Hanguang-jun. But let’s try to solve it on our own first? I can’t look him in the eye and tell him I got Senior Wei cursed.”\nSizhui closes his eyes, shutting out the expectant faces clustered around him. Mistakes happen. Hanguang-jun has been telling Sizhui that since he can remember. Hanguang-jun would understand. He would.\nBut Jingyi didn’t get Wei Wuxian cursed. Or Jin Ling, or Ouyang Zizhen. Wei Wuxian was in that array to pull Sizhui out.\n“Just for a few hours,” Sizhui says. “Then we go to Hanguang-jun.”\nJingyi brightens. “A few hours,” he agrees. “Now bring him over here, it’s my turn. A-Ying, you want to spend some time with your Jingyi-gege, right?”\nSizhui hesitates. But A-Ying doesn’t seem worried at the prospect of being held by someone different. He looks up once, as if to check Sizhui’s reaction, and then smiles. “Okay!”\n“Why does Lan Jingyi get to hold him next?” Jin Ling says. “He’s my uncle.”\n“You have never once called him ‘uncle’ to his face,” Jingyi says placidly, transferring A-Ying’s weight from Sizhui’s arms to his own.\n“Of course not,” Jin Ling huffs. “He’d be insufferable.”\n“So what do we do, Sizhui-xiong?” Ouyang Zizhen says. “We checked the array, but it’s not one any of us have studied.” \nSizhui sinks. He was worried about as much. “We should get off the mountain first,” he says. “Jingyi and I will send a message ahead to Cloud Recesses, to some of our shidi with night-hunting experience. We can research the array while they track the demon.”\n“Why wait at all?” Jin Ling says. “It’ll be quicker if we track it ourselves. Most curses can be undone by killing the caster.”\n“Young Mistress Sect Leader,” Jingyi says, with the kind of faux patience he must know Jin Ling hates, “we’re not bringing a baby to fight a demon.”\n“He’s not a baby,” Jin Ling snaps.\n“I’m six,” A-Ying says helpfully.\n“My mistake. He’s six.” Jingyi bounces A-Ying higher on his hip. “Clearly he’s ready for his first night-hunt.”\n“Mountain demons are most active during hai hour,” Sizhui says with a glance at the late morning sun. “We have time. For now, we should go to Caiyi and get A-Ying some clothes.”\nA little growl punctuates Sizhui’s thought, and Jingyi shifts his grip on A-Ying to grin down at him. “And maybe some food, too. Because someone’s little belly is talking.”\nJin Ling’s brow crinkles. “You do remember that’s Wei Wuxian, don’t you?”\nJingyi blithely ignores him. “How about it, A-Ying? Are you hungry?”\n“Food?” A-Ying straightens in Jingyi’s arms. But his next words are deliberate, almost careful. “I can have some?”\nSizhui can tell by the way the group shifts that he’s not the only one who caught that phrasing.\nOuyang Zizhen recovers first, striding over to poke A-Ying’s cheek until he’s smiling again. “What do you mean ‘some?’” he says, his tone light. “We’re going to get everything you want, okay?”\n“Oh,” A-Ying says. And that’s another look Sizhui recognizes from Wei Wuxian. The one where he doesn’t quite believe you. “Okay!”\nJingyi lets out a long breath. “You’re really good with kids, Zizhen-xiong.”\n“I’m the oldest of three,” he says. But his smile sobers a little as he looks around the group. He must have realized, even before Sizhui did, that the rest of them are only children.\n“Let’s go,” Sizhui says gently. “A-Ying’s going to get cold.”\n“Zizhen-xiong,” Jingyi says, “wanna take him for a bit?”\n“Can I?” Ouyang Zizhen lights up.\nJingyi laughs, depositing him carefully into Ouyang Zizhen’s arms. “Yeah, he likes you. Don’t you, A-Ying?”\n“Yeah!” A-Ying chirps. Ouyang Zizhen makes a sound like a tea kettle\n“Again,” Jin Ling grumbles, “he’s my uncle.”\n“Don’t worry, Jin Ling,” Ouyang Zizhen says, “you can hold him when we get to Caiyi.”\nJingyi lets Jin Ling and Ouyang Zizhen go a little ahead, and falls into step with Sizhui. Pebbles tumble under their shoes as they make their way to where the ground slopes, back in the direction of Caiyi. \n“Hey,” he says, leaning in. “Are you okay?”\nSizhui uncoils a fraction. He didn’t think he’d been too obvious. But this is Jingyi. Jingyi can always tell.\n“I was careless,” he says softly.\n“You weren’t anything,” Jingyi says. “If you hadn’t pushed us out of the array, it’d be you, Senior Wei, and three toddlers. And that’d be a whole different brand of fun for you. I think you remember what six-year-old me was like.”\nSizhui knows his smile must look tired. But he can’t quite stop it, either. “At least then we’d have Senior Wei.”\n“We still have him, Sizhui.” Jingyi bumps his shoulder. “And by this time tomorrow, he’ll be back to his usual self. I promise you.”\nSizhui glances up to A-Ying, who’s peering backwards at them over Ouyang Zizhen’s shoulder.\n“Do you think he’s okay?”\n“A-Ying? Yeah, he seems like it,” Jingyi says with a shrug. “He’s so well-behaved, right? And quiet. I didn’t expect that from a little Senior Wei.”\nSizhui hums noncommittally and lets them lapse into silence. Every now and then lately, when he feels comfortable or he’s not paying attention to the words coming out of his mouth, Wei Wuxian drops a scrap of information about himself, and Sizhui quietly, unobtrusively collects it. Sizhui has a patchwork story of Wei Wuxian in his mind now, threaded together by guesses. And if they’re true, then that’s not his information to share.\nThat’s all they are, though: guesses. Wei Wuxian, like Hanguang-jun, tucks his own problems far out of Sizhui’s reach, like he’s three years old again and they don’t want him eating something toxic. That doesn’t stop Sizhui from looking, though. He knows Hanguang-jun holds his sadness at the core of himself. And he knows Wei Wuxian darts and sidesteps around it like a field of glass, all the while pretending it doesn’t exist.\nBut he tucks his unease to the back of his mind, and he keeps walking. There’s a time to get in your own head – and believe me, I love those times, Wei Wuxian would say, were he here. But most of the time, you need to put all that aside. And you just need to get to work.\nSo Sizhui gets to work.\n***\nSizhui has never been so grateful for the sterling, untouchable reputation of the Lan. If the tailor has any questions about why they’re bringing their so-called ‘new disciple’ to the shop on such short notice, swaddled in a set of robes several magnitudes too big for him, he doesn’t ask.\n“Yes, I believe I have sample robes in an adequate size,” is all he says. “Just a moment, Lan-gongzi.”\nSo they hand off A-Ying to be fitted. And then they sink, as a group, onto the bench at the front of the shop.\n“I’m exhausted,” Jingyi says. “My head hurts. How do I know if I’m having a qi deviation?”\n“I think you’d probably know,” Ouyang Zizhen says gently.\n“I’ll bet that’s what Nie Mingjue thought,” Jingyi says.\n“Jingyi,” Sizhui says. But he lacks the energy to chide any further than that.\n“Yeah, not funny,” Jingyi readily admits, leaning back against the wall. Sizhui keeps up his Proper Lan Posture, but barely. “At least he’s obedient. Senior Wei’s hard enough to keep track of when he’s full size.”\n“At least we didn’t have to convince him to come with us,” Ouyang Zizhen agrees.\nJingyi relaxes back, closes his eyes. But a minute later, he’s sitting straight up again. “Gods,” he says. “He just came with us.”\n“… yeah, we just said that,” Jin Ling says.\n“No, I mean…” Jingyi makes a series of vague, distressed gestures. “We just told him that we were his friends that he didn’t remember, and he believed us? Senior Wei!”\nSizhui swallows. Next to him, Jin Ling mutters a prayer of thanks to his maternal grandfather. \n“We can’t let him out of our sight,” Sizhui says.\n“Someone watches him at all times,” Jingyi agrees fervently. “Before someone else tries to adopt him.”\nAnother minute of weary silence passes before Jin Ling speaks up. “Do you think he’ll remember this once he’s changed back?”\n“I don’t know? Probably,” Jingyi says. And when he turns to look at Jin Ling’s face, he adds, suspiciously, “Why?”\n“I’m just saying.” Jin Ling fidgets. “Fairy’s really good with kids. If he had some better experiences—”\n“Young Mistress,” Jingyi says calmly, “if I see a dog within ten li of that baby, I am sending it to Qinghe.”\nJin Ling bristles. “It was just an idea.”\n“Forgive me for interrupting.” From the back of the shop, Sizhui hears a sweep of fabric before the tailor rounds the corner, leading A-Ying by the hand. “We’re all finished here. Would you like me to bill Gusu Lan directly, per usual?”\n“Ye—” Sizhui’s mouth snaps shut. Hanguang-jun reviews the Gusu Lan ledger at the end of every month. If he sees a payment for robes for a disciple that doesn’t exist…\nWhether Jin Ling picks up on this, or whether he just wants to end the silence the first way he knows how, he’s the first one to speak up. “Please bill Lanling Jin. In full.”\nThe tailor’s eyebrows rise so high, they threaten to become one with his hairline. “Then this humble one will do so,” he says. \nAs the tailor returns to the back, Sizhui finally turns his attention back to A-Ying, who looks much more relaxed to have clothes that fit him properly. It is, of course, another level of bizarre to see Wei Wuxian in a uniform that Sizhui himself wore at that age, but that’s another thing Sizhui can fully think about later.\n“There we go,” he says. “Is that more comfortable, A-Ying?”\nA-Ying lifts the hem of his robe to trace the cloud pattern with one careful finger. “What the fuck,” he says, reverently.\nThankfully for Sizhui, one single thing goes right today, and the tailor doesn’t hear.\n“Lan Jingyi,” Jin Ling hisses, “why did you teach him that?”\n“I didn’t mean to!” Jingyi says. “It was the heat of the moment!”\n“Just stay calm,” Ouyang Zizhen says. “Kids love getting a reaction. If they know they’re not supposed to say something, they’ll just want to say it more.”\n“Okay. Okay, I can do that,” Jingyi says. “Yeah, A-Ying. What the fuck, huh?”\n“Jingyi.” Sizhui lets his eyes flutter shut. “Too far in the other direction.”\n“It’s alright,” Ouyang Zizhen soothes. “He’ll probably forget it by dinner. A-Ying, let’s go eat lunch, huh? I’ll bet you’re hungry. Is it okay if this gege in gold carries you?”\n“Yeah!” A-Ying chirps.\n“Me?” Jin Ling says, at the same time.\n“You’ve been complaining all morning that you haven’t gotten to hold him,” Jingyi says.\n“That doesn’t make it less weird,” Jin Ling mumbles. But a little awkwardly, he drops to a crouch and holds out his arms. “Come on W—A-Ying. Let’s go.”\nSizhui holds the door open for Jin Ling, who still seems too self-conscious to hold onto A-Ying too tightly, and falls into step alongside them. “A-Ying, what do you want to eat?” \nA-Ying peers at him across Jin Ling’s shoulder. And Sizhui sees that odd hesitance behind his wide eyes again. “Want?” \nThe unease that’s been building since the morning shifts, grows roots. “Yes,” Sizhui says. “What’s your favorite thing?”\nEveryone’s attention has turned to A-Ying now, which doesn’t seem to be helping him put the words together. “I like watermelon rinds,” he manages. “Sometimes I have dumplings.”\nSizhui hasn’t seen Jin Ling blanch like this since that awful night at Guanyin Temple. “That’s—” Jin Ling cuts himself off, painstakingly softens his voice. “Is that all you eat?”\nA-Ying blinks, cranes his neck to look up at Jin Ling. “I eat other things,” he says patiently. “But that’s my favorite.”\nSizhui tries to communicate, with a look over A-Ying’s head, that they should be careful in how they react. Jingyi completely misses it. “Senior Wei…” His eyes go glassy. \n“Senior Wei,” Ouyang Zizhen says between sniffs, “you’ve suffered so much…”\nJin Ling’s looking steadily at Sizhui over A-Ying’s head. He tilts his chin up a little, like he does when he wants to look decisive. “Lan Sizhui,” he says, “I’ll pay for lunch, too.”\n“Jin Ling,” Sizhui says, “that’s not—”\n“Lanling Jin can afford one lunch,” Jin Ling says. It shouldn’t be possible for a person to fidget while they’re walking and holding a child at the same time. Somehow, Jin Ling manages it. “He should have something nice,” he adds, quietly.\nA-Ying’s looking away now, as if understanding this conversation isn’t for him. He’s watching the controlled chaos of the streetside stalls, bursting with color and the smell of frying oil and the clatter of money. Sizhui wonders if he can remember any of the stalls in Yiling, studded with toys out of his reach and food he could never eat. The stalls he wandered as a child, would later wander with Sizhui on his shoulders.\nSizhui had been a little younger than A-Ying is now. But he had Granny and Fourth Uncle, Wen Qing and Wen Ning. He had Wei Wuxian. And they rarely let him notice what he didn’t have.\n“I know a good place, Jin Ling,” Sizhui says.\nJin Ling straightens. “Fine,” he says. “Let’s go, then.”\n***\nIn the end, they take A-Ying to Wei Wuxian’s favorite place, the family-owned restaurant by the river. It’s not quite fancy enough for Jin Ling’s tastes, but even he doesn’t complain, not when A-Ying looks so quietly happy.\nSizhui orders a few of Wei Wuxian’s favorite dishes – at a mild heat. A-Ying may well have that same scorched earth palate even at this age, but Sizhui isn’t sure he can look Hanguang-jun in the eye later if he feeds that much chili oil to a six-year-old. \nA-Ying lights up when the food is placed on the table. But even now, with each of them reassuring him in turn that the whole plate is his, he eats in slow, careful bites, looking up every now and then to check their reactions. Even after being coaxed multiple times, he doesn’t finish.\nDespite his best efforts, Sizhui’s getting in his own head again. But it’s hard not to watch A-Ying and think. Wei Wuxian doesn’t need any encouragement to eat his fill now, of course. He would be the first to tell Sizhui that. But there’s something Sizhui noticed, not too long ago: that whether they’re a guest in someone else’s home or whether they’re eating in the Jingshi, Wei Wuxian can rattle off exactly how much of a meal he’s had, like he’s keeping track. \nSomewhere in the space of going into his head and coming out again, Sizhui’s unease has hardened into resolve.\n“We should get to the Library Pavilion, right?” Jingyi asks as Jin Ling pays the bill. “Should we take our swords?”\nSizhui glances out the window, checks the light outside. It’s early, still, a little less than half a day until the mountain demon’s most active hunting hours. They should start their research soon. But.\n“Let’s walk. At least to the base of the mountain.” At Jingyi’s raised eyebrow, Sizhui fidgets. “A-Ying seemed interested in the market.”\nSo they make their way back to the main road, and they take the long way through Caiyi.\nIt’s slow going. A-Ying wants to walk this time, and every few steps his attention darts like a dragonfly from one side of the street to the other. Sizhui lightly holds A-Ying’s hand in his own and drifts at the back of the group, letting A-Ying set the pace.\nAnd he finds that he’s stopped worrying that Hanguang-jun will look twice at the day’s expenses.\n“Sizhui,” Jingyi calls over his shoulder. “You know he’ll be an adult again by tomorrow, right?”\nSizhui, already setting the paper butterfly in A-Ying’s hand, shrugs happily. “We can give it to one of the novices.”\nOuyang Zizhen beams. “Did Senior Wei spoil you like this, Sizhui-xiong?”\n“The opposite.” Sizhui’s laugh bubbles out of him. “When we ran errands together, he used to point to toys and ask me if I liked them. When I’d say yes, he’d say ‘me too’ and keep walking.”\n“Senior Wei,” Jingyi winces. “Too cruel.”\n“He tried to be pragmatic with money,” Sizhui says. That had been Wen Ning’s word for it that night a few months ago, when he’d joined them for dinner in the Jingshi and they told stories of Yiling well past hai hour. \nHe knew he’d have to explain himself to Jiejie if he wasn’t, Wen Ning had said. He couldn’t smile widely, not anymore, but his voice was as warm and steady as the candlelight.\nYour Hanguang-jun was the one who spoiled you, Wei Wuxian had said mournfully. You only met him once back then, but you’d always ask me, where’s Rich-gege? When is Rich-gege coming back?\nHanguang-jun, for his part, had looked at the three of them, the line of his mouth soft. It is easy to spend money when you have it, he’d said. You gave Sizhui joy. That was more valuable. And then Wei Wuxian had hidden his face in his hands until Sizhui laughed and coaxed him to lower them.\nSizhui watches A-Ying balance the toy in his open palm: gentle, barely touching. As carefully as you’d handle a lotus seedling just sprouted from the earth.\n“Okay,” Jingyi sighs. “Yes.”\n“I didn’t say anything,” Sizhui says, still smiling.\n“You were thinking it very loudly,” Jingyi says. “Yes! I suppose A-Ying will need some toys to play with while we figure out how to turn him back into Senior Wei.”\n“You would have done it if Lan Sizhui hadn’t gotten there first,” Jin Ling says.\n“Shut up,” Jingyi says. “I’m a very strict parent.”\nA-Ying isn’t interested in more toys, in the end. He’s transfixed with the paper butterfly, carrying on a nearly inaudible one-sided conversation with his open palm. It’s easily the most he’s said all day. Sizhui tries not to eavesdrop, but every now and then he catches a word or two. “Are you tired?” A-Ying whispers, like a reassurance. “We’ll be home soon.”\nHe does, however, straighten when they pass a stall of potstickers, the skins golden-brown and gleaming in the midday sun. Sizhui feels A-Ying’s hand tug as he slows, nearly on his tiptoes to look at them. Sizhui idly wonders how much it’s possible to feel at the same time.\n“Are you still hungry?” Sizhui asks.\nBut A-Ying looks away from them then, faces forward and sinks back to the ground. “No,” he says quietly. It’s not the least bit convincing.\nSizhui opens his mouth. Jingyi gets there first, though. “Then we’ll buy some for later,” he says. “Miss, five pork and cabbage, please.”\nAs Jingyi collects the potstickers, Sizhui keeps watching A-Ying, who’s now looking at his feet. Based on the patchwork of information Sizhui has cobbled together over the past year, A-Ying had been surviving on the streets for some time at this point in his life. Food would not have been a consistent resource. Sizhui remembers enough of his own childhood to know how it felt, having a feast after days of famine.\nBut for the third time now, A-Ying seems hesitant to accept it.\nHe’s still turning it over in his head when he feels A-Ying stop walking.\nStartled, he looks down. A-Ying is as rigid as a prey animal, his eyes wide, his hand trembling violently in Sizhui’s. It doesn’t take long to find what he’s looking at.\n“Guys,” Sizhui calls, calmly as he’s able, “there’s a dog.”\nThe stray is in an alleyway a little ways up to the left, rooting through the garbage by one of the stalls. It’s little and wiry, not nearly big enough to do anything but bite. But as small as it is, A-Ying is smaller. And biting is more than enough.\nJin Ling straightens, visibly steeling himself. “Lan Jingyi,” he says. “Give me a potsticker. I’ll deal with it.”\nJin Ling is gentle with the dog, but undeniably efficient. He pauses only long enough to hold out his free hand to sniff, to give the dog a few soft scratches behind its ear once it accepts that he’s not a threat. Then he pulls the dumpling from behind his back, lets the dog see exactly what he’s holding. “Good boy,” Jin Ling croons. “Go get it.”\nHe tosses it in an underhanded swing, high and wide so that it lands behind them. Sizhui feels A-Ying inhale sharply as the dog sprints by. Even once it’s long gone, A-Ying is slow to let that breath out. \nJin Ling’s shoulders are slumped as he doubles back. “Wei Wuxian owes me,” he says halfheartedly. Ouyang Zizhen soothingly pats at his shoulder.\nSizhui drops to a crouch. A-Ying has shut his eyes now, his body painfully still. Just two weeks ago, when they’d hunted a pack of yaoguai with pointed, dog-like snouts, Wei Wuxian had wrapped himself around Sizhui and shivered, face buried in Sizhui’s neck, until he regained enough of himself to realize that he wasn’t clinging to Hanguang-jun. A-Ying doesn’t cling now. \n“A-Ying,” Sizhui asks softly. “Can I pick you up again?” \nA-Ying’s head dips once, barely a nod. Sizhui picks the paper butterfly out of his unresisting hand and tucks it into his qiankun bag with the rest of Wei Wuxian’s things, then lifts A-Ying back up into his arms. Even this close, A-Ying doesn’t grip him back.\n“It’s gone,” Sizhui says. A-Ying makes a soft, unhappy sound, but this time he nods for real.\n“Is he alright?” Ouyang Zizhen asks.\n“I’m okay,” A-Ying says quietly. When Sizhui moves to shift his weight, he notices how loosely A-Ying’s shoes fit around his feet. One stray step and he might’ve tripped.\n“Ah,” Sizhui says. “Those shoes are pretty big on you, huh? Those must have been hard to walk in.”\nA-Ying glances up at him. His eyes haven’t lost that wariness yet. “It’s fine,” he says carefully.\n“A-Ying, you have to say when you’re uncomfortable,” Jin Ling says. Jingyi opens his mouth, but Sizhui waves a hand to stop him – there’s no scolding in Jin Ling’s voice. “Otherwise we won’t know.” \nA-Ying’s fist finally curls around the collar of Sizhui’s outer robe. “That’s okay?”\nSizhui can feel the beginnings of something ice cold clicking into place. Some understanding that’s still beyond him but sits in reach, all of its pieces slowly assembling. “Why wouldn’t it be okay, A-Ying?”\nA-Ying just watches him for a moment, and Sizhui schools his face into something soft, neutral. He may not know exactly what to do. But he has watched Hanguang-jun all his life, has watched him with Wei Wuxian for a year now. He knows that when Wei Wuxian is dancing around what he wants to say, Hanguang-jun doesn’t try to pry it out. He waits for Wei Wuxian to come to him.\nSo Sizhui waits, too. \n“That’s whining,” A-Ying finally says. There’s something oddly stilted in his tone. “No one likes that.”\nThey’ve reached the end of the main street now, nearly to the outskirts of town. The raucous voices of the market have started to dim, leaving only their own indrawn breaths for company. “Who said that?” Sizhui asks.\n“Everyone,” A-Ying says.\nSizhui can feel Jingyi next to him, all but vibrating with the effort to stay silent. Sizhui’s glad he does. If they interrupt A-Ying now, he might never talk about this again. “What does everyone say exactly?” Sizhui asks.\nA-Ying hums, thoughtful. It seems as if he’s putting the words together more than trying to recall them. Because when he speaks, it’s clear that he remembers them perfectly. \n“Don’t ask for things,” he says. He uses that same stilted tone, and Sizhui remembers where he’s heard it now, listening to the novices recite the Gusu Lan precepts. The tone of a child repeating someone else’s words. “Don’t take too much when it’s given to you. Children look better when they smile. And, um—don’t cry. Crying never helped anyone.”\nSizhui thought he’d kept his face calm. He’d tried to, anyway. But when A-Ying looks up at him, he falters. “Is that wrong?” he asks. \n“No,” Sizhui says, too quickly. A-Ying flinches, and Sizhui has to breathe before he tries again. “It’s not wrong. Anything you want, or don’t want, is okay.” \n“But we want to know if you’re in pain,” Jin Ling says to his feet. “So—say so next time.”\n“Oh.” A-Ying’s head tilts, politely dubious. But at length, he says, “Okay.”\nThey’re quiet long past the borders of Caiyi. “Anyone feel up for a trip to Yiling?” Jingyi says, bright and brittle.\n“The people who said those things are probably gone,” Ouyang Zizhen says.\n“Yeah,” Jingyi says. “Doesn’t make me feel any better, though.” \n“It’s fine,” Jin Ling says. “He—well, it was a long time ago. Wei Wuxian obviously knows better now.”\nSizhui keeps his hold firm but relaxed, enough that A-Ying eventually lays his head on his shoulder. He’s not sure how to put what he’s feeling into words. Or even if it’s appropriate to. They have all, at least once, seen the way that Wei Wuxian smiles in the face of an insult, or an injury, or a reminder of the things he’s done, sharpened to a painful barb. To say it out loud seems like a violation of a secret. Even if it’s one, deep down, that they all know.\nHe doesn’t know better now are the words Sizhui eventually finds.\nHe keeps them to himself.\n***\nThey mount their swords the rest of the way. A-Ying’s clearly getting tired – by the time they’ve landed at the gates, he’s fast asleep, his head nestled against Sizhui’s shoulder. \nThe sentries greet them politely, though Sizhui doesn’t miss each of them scrutinizing A-Ying’s unfamiliar face in turn. But if they notice that Sizhui is carrying Wei Wuxian’s jade token with no Wei Wuxian in sight, neither of them say so.\nSo they enter Cloud Recesses, at least, without incident. A-Ying blinks himself awake halfway up the path. “There’s a bunny,” he says.\nSizhui follows his stare to a little black rabbit by one of the lanterns, frozen mid-nibble. He hefts A-Ying a bit higher to get a better look. “There’s a lot of bunnies,” he says. “You can play with them later, after you’ve slept.”\n“I’m not tired,” A-Ying mumbles. Then he turns his face into Sizhui’s robes and dozes the rest of the way up the steps.\nTheir biggest problem, Sizhui thinks, will be where to hide A-Ying while they’re researching. They could be noticed, bringing him into the Library Pavilion. But if they try to hide him in the disciples’ quarters, he could be swept up into classes with the novices, and then he’ll really be noticed. The Library Pavilion is their only option, really. Now he just has to figure out where they’re least likely to run into Master Lan.\nHe’s so deep in thought, he doesn’t notice why Jingyi is frantically tugging at his sleeve until Zewu-jun is right there. \n“Sizhui, Jingyi.” Zewu-jun’s smile is warm today, only a little frayed at the edges. Sizhui would be happy to see him so well if his heart wasn’t about to leap through his throat. “And Sect Leader Jin and Ouyang-gongzi, as well. I didn’t expect to see you all today.”\nWhether Jin Ling remembers that Sizhui and Jingyi can’t lie, or he just panics, it’s not clear. But when he blurts out “We finished early,” Sizhui resolves to let him do the talking.\n“Oh?” Zewu-jun says. “What happened with the mountain demon? No, wait, don’t tell me.” He holds up the flat of his hand. “I’ll be handling the night-hunt reports while Wangji and Wei-gongzi are in Lanling later this week. I want to be surprised.”\nSizhui diligently keeps a straight face at the mention of Wei Wuxian. Unfortunately, he can’t say the same for the others. Ouyang Zizhen fidgets. Jin Ling swallows. Jingyi makes a tiny, aborted sound that he turns into a loud throat-clearing.\n“Ah.” Zewu-jun surveys the four of them. “Speaking of Wei-gongzi. Was he not with you?”\n“Stayed in Caiyi,” Jin Ling manages.\n“He’s buying a present for Hanguang-jun,” Ouyang Zizhen adds. Sizhui doesn’t bite his lip, but it’s a near thing.\nZewu-jun brightens again. “Always a honeymoon for those two,” he says merrily. “I’ll keep the secret if Wangji asks. I'm sure he’ll come looking once he hears you’ve returned.”\n“Thank you, Zewu-jun,” Sizhui says evenly. At least he hopes it’s even. “We’ll take our leave now.”\n“Of course. Keep up the good work.” But just as Sizhui allows himself a brief, foolish moment of relief, Zewu-jun’s gaze alights on A-Ying. “Would you like me to bring this one back to the disciples’ quarters? He looks a bit tired out, doesn’t he?”\nSizhui could really use a lie right now. So of course Jin Ling and Ouyang Zizhen are determinedly looking anywhere but at Zewu-jun. Sizhui pauses, quick enough to sound natural but just long enough to choose his words very, very carefully.\n“We’ll keep him with us for now,” he says. “He’s new, so he’s a bit anxious.”\nZewu-jun looks over A-Ying again. Sizhui’s back is starting to hurt from holding it so straight. “I was wondering why I didn’t recognize him,” Zewu-jun laughs. “Hello there, little one. Did I wake you?”\nA-Ying turns his face out to look at Zewu-jun more fully, rubbing at his eyes. “Hi,” he says. “I wasn’t sleeping.” \nZewu-jun lights up. Distantly, Sizhui thinks of how patiently Wei Wuxian has worked to forge a relationship with his brother-in-law this past year. If Wei Wuxian had known that all he had to do was get cursed, he might have gone out and done so a lot sooner. So it’s probably good that he didn’t know.\n“Alright,” Zewu-jun says. “But if you get sleepy, let these geges know, won’t you? They’re very diligent. They might be working for a long while.”\n“Mmhmm,” A-Ying says. And then, after some consideration, he adds, “Your ribbon is pretty.”\n“Why thank you,” Zewu-jun says. He’s still smiling. He doesn’t seem to have noticed what Sizhui and Jingyi have just now simultaneously realized: that A-Ying’s own forehead is bare.\n“Anyway,” Jingyi says loudly, “we won’t take up any more of Zewu-jun’s time! These disciples will take their leave now!”\nSizhui barely finishes saluting before Jingyi hustles the three of them off toward the Library Pavilion. A-Ying cranes his neck in Sizhui’s arms. “We’re running?” he asks.\n“Running isn’t allowed in Cloud Recesses, A-Ying,” Jingyi chirps. “We are walking very fast. There’s a difference.”\n“Do you think he guessed something was wrong?” Ouyang Zizhen says.\n“Who wouldn’t guess, with you breathing so loudly that whole time?” Jin Ling grumbles. “You sounded like a winded boar.”\n“He—I don’t think he noticed that A-Ying didn’t have a forehead ribbon,” Sizhui says. “Right?”\n“Maybe he assumed A-Ying’s an outer disciple? Zewu-jun trusts us.” After a beat, Jingyi amends, “Trusts you. It’ll be fine.”\n“Let’s just get him inside,” Jin Ling says. “With our luck, it’ll be Lan Qiren next time.”\nSizhui and Jingyi leave Jin Ling and Ouyang Zizhen with A-Ying in a small, secluded wing of the library, and rejoin them a few minutes later with a stack of possible books. A-Ying has happily ensconced himself in the corner with his paper butterfly, carefully lining up a few stacks of books. \n“What’re you making, A-Ying?” Jingyi says.\nA-Ying blinks up at him. “We’re night-hunting,” he whispers. “But we have to be quiet in the library.”\nSizhui’s cheeks crinkle from his smile as he settles cross-legged on the floor, pulling a book into his lap. He must have known about night-hunting by the time he was A-Ying’s age, too. It was how Zewu-jun had explained why Hanguang-jun was gone so often. But A-Ying would have learned from his mother.\nHe allows himself one more moment of distraction, imagining them. He’s heard all about Cangse Sanren, of course, heard how Wei Wuxian inherited her quick wit and wildfire laugh. He knows less about Wei Changze. But Sizhui imagines that he must have been someone kind. Maybe quieter than his wife, but solid and steady as the earth. Like Hanguang-jun, maybe. Like Wei Wuxian is, and pretends not to be.\nIt must not have been very long ago that A-Ying lost them. Sizhui wonders if he even has a sense yet of what he’s lost. There are things that are too big to grasp. That get easier to understand, when you’re older, but will always be deeper and more vast than you can hold.\nWei Wuxian talks about his parents sometimes, but not often. He doesn’t remember much. And he is, at all times, keenly aware that he’s not the only one whose family is gone.\nSizhui opens his book and shifts on the floor. And he collides with a pair of legs.\nHe tilts his head back. And he looks straight into the impassive stare of Hanguang-jun.\n“Hanguang-jun,” Sizhui gasps. Jin Ling, from the sound of it, starts choking on air. “I didn’t know you were—”\nOver Hanguang-jun’s shoulder, Zewu-jun flashes an apologetic smile. “Forgive the intrusion, boys,” he says. “But it seemed as if something might be wrong.”\nSizhui concentrates, with all his power, on sinking into the floor. He’ll have to ask Wei Wuxian about a talisman for that if he survives the sheer force of his own shame.\n“Sizhui,” Hanguang-jun says evenly. But there’s a recognizable shift behind his eyes. He’s worried. He made Hanguang-jun worry about him. If it’s possible to feel worse, Sizhui feels it. “Did something happen?”\n“I…” Sizhui’s bone-dry throat constricts. He has to say it. There’s nothing for it now. “That is, I…”\nThe good news is, there’s a gentle thump to their right, drawing everyone’s attention off Sizhui.\nThe bad news is, it’s one of the books from A-Ying’s makeshift sculpture. \n“Oh.” A-Ying sets the fallen book back into place with a careful dusting. “Shh. We have to be quiet in the library.”\nHanguang-jun turns to look at A-Ying. And Sizhui takes a deep breath, braces for a long fall, and says, “Hanguang-jun—this is—”\n“Wei Ying?” Hanguang-jun says.\n There’s a beat. Then a flurry of words all at once: a Wangji? from Zewu-jun, a How did you know that from Jingyi, a Hanguang-jun, we— from Jin Ling, and a reverent Wow from Ouyang Zizhen. Sizhui is the only one silent, frozen. Maybe that’s why Hanguang-jun looks at him first.\n“Sizhui,” he says. His voice is utterly calm. “How did this happen?”\n“I—” Sizhui breathes again, past the block in his throat. He just needs to say it. Rule eighty-four, speak forthrightly. “It was my fault. There were arrays, to make villagers easy prey for the mountain demon. We didn’t see it. I didn’t move fast enough, I—” \nHe blinks. He’s the head disciple. He’s at fault. He’s not the one who’s cursed, whose husband is cursed. There are any number of reasons why he can’t cry here. So he doesn’t.\n“Jianhe and some of our shidi are tracking the demon now. They have instructions to send a message when they’re close. We’re—” He gestures uselessly to the books. “Researching the array now. We’ll go back and fix this.” He’s still not crying. He’s not. But he’d give anything to regain control of his voice. “Hanguang-jun, I’m so sorry. This disciple will accept any punishment you see fit.”\n“Hanguang-jun,” Jingyi says quickly, “Sizhui is blameless. It was the three of us who didn’t notice the array. Sizhui was the one who pushed us out. Please punish me instead of him.”\n“He’s right, Hanguang-jun!” Jin Ling blurts out. He looks like he’s about to shake apart, but somehow he manages to add, “It’s not Sizhui’s fault!”\n“Hanguang-jun!” Ouyang Zizhen says, dropping into a low bow. “The safety of your husband is paramount to this disciple! I sincerely apologize for letting you d—”\n“Sizhui,” Hanguang-jun says. His neutral expression hasn’t wavered. But all four mouths snap shut in an instant. Hanguang-jun never interrupts anyone. \nHe looks at them in turn, as if to be sure they’re listening. Then he says, “Suppression or elimination of the demon should neutralize the curse. Continue your research to be sure. Come to me once you have confirmed.”\n“Y… Yes,” Sizhui says. The adrenaline hasn’t quite left him yet; his hands tremble furiously at his sides. “But Hanguang-jun—”\nHanguang-jun’s hand rises, then presses against Sizhui’s shoulder. His touch is so gentle, it’s barely there. “It’s alright,” he says. And then he closes the distance between himself and A-Ying in two steps and drops into a crouch.\nA-Ying, for his part, has been watching the argument warily from the corner, the paper butterfly resting in his open palms. He straightens a little at Hanguang-jun’s approach, a gesture Sizhui now recognizes as fear.\nHanguang-jun seems to register this, too, because he doesn’t come closer. He simply says, “A-Ying.”\nWhether it’s his voice or the name, A-Ying visibly loosens. “Oh,” he says. “Are you my friend, too?”\nHanguang-jun laughs, brief but bright enough that Jin Ling elbows Jingyi and hisses something that sounds like He laughs? “Yes,” Hanguang-jun says. “What are you building?”\nA-Ying relaxes further. Jingyi was right. If they’d let him out of their sight, he would have been adopted by the first friendly face on the street. “These are mountains,” he says. “We’re night-hunting.”\n“Is that so,” Hanguang-jun says, so softly. \n“Mmhmm!” A-Ying chirps, holding up his butterfly. “He’s a cultivator. I’m his sword.”\n“And your sword?” Hanguang-jun says.\nA-Ying hums, jutting his lower lip out. “Don’t have one. But that’s okay.”\n“I see.” Hanguang-jun nods, as if considering it. “Would you like to ride mine?”\nA-Ying lights up. “Can I?”\n“Mm.” Sizhui can hear the smile in Hanguang-jun’s voice. “Let’s go outside.”\n“Wangji,” Zewu-jun says as Hanguang-jun sweeps A-Ying up into his arms. “Perhaps the curse should take precedence?”\nHanguang-jun looks over his shoulder impassively, A-Ying grinning in his arms. “Mountain demons are most active at hai hour,” he says. “So we will have to wait.”\nAnd with that, Hanguang-jun sweeps past the five of them and around the corner. In the distance, the library door opens, then shuts.\nSizhui breathes out, stirring the relief and guilt and tension into a fresh cyclone. He needs to sit down. Actually, he’s going to. When he sinks to the floor, Jingyi drops alongside him.\n“Are you all alright,” Zewu-jun says, barely a question. He’s still smiling.\n“That…” Jin Ling blinks, his eyes wide in his dead-white face. “What was that?”\n“Well,” Zewu-jun says. “If I may guess: I don’t think you’re being punished.”\n***\nHanguang-jun is right, as usual. The array is a simple one, for the amount of chaos it’s caused. Suppression or elimination of the mountain demon will reverse the curse in a matter of hours.\nSo they leave the library after an hour and a half, feeling dazed and heavy. \n“We should find Hanguang-jun.” Sizhui blinks hard into the sunlight, his eyes watering. Between the reading, the stress of the morning, and the knowledge that Hanguang-jun is, for some reason, not angry at him, he feels more like a liquid than a person.\nThe guilt hasn’t quite left him. Not yet. But he feels a little lighter than he did before.\n“Gods,” Jin Ling says hollowly. “I still can’t believe he didn’t kill me.”\n“He’s really not as bad as you think,” Jingyi says.\nJin Ling shoots him a baleful look. “First I stabbed his husband, then I helped get him cursed. Eventually his patience is going to run out.”\n“Ah, shixiong! Da-shixiong!” \nThey turn to find Lan Xingguo, one of their juniors, jogging toward them, just slow enough that you couldn’t call it a run. “Are you,” he pants, “looking for A-Yi—um, Senior Wei?”\n“Are they back yet?” Sizhui asks.\n“They have been for a while now.” Lan Xingguo beams. “Da-shixiong, it was so cute—a few of us played hide and seek with him by the woods, but then Senior Wei hid in a tree and couldn’t get down on his own? Hanguang-jun had to bring him down. And then when he was—”\n“Xingguo,” Jingyi says.\n“Ah, sorry, shixiong,” Lan Xingguo says. “I think they’re in the rabbit meadow now. Hanguang-jun said if we saw you, we should send you over right away.”\n“Thank you, Xingguo,” Sizhui says. The junior sees them off with a sloppy bow.\nOuyang Zizhen wilts as they step off the path and make their way across the grass. “We missed hide and seek with A-Ying.”\n“Zizhen,” Sizhui says gently. “If that was our only punishment, we were lucky.”\n“Still,” Ouyang Zizhen says mournfully. “Can you imagine him in that tree? He must’ve looked like a little acorn.”\nJin Ling falls into step with him as they walk. “Lan Sizhui,” he mutters. At Sizhui’s questioning hum, he adjusts his shoulders, his gaze darting across the tree line in the distance. Finally, he says, “You’ve been quiet today.”\nThere’s a little chill in the air today, a promise of autumn. But Sizhui feels impossibly warm. Jin Ling’s concern is rare, but it’s always deep, sincere, unashamed. Wei Wuxian always looks a little unmoored when it surfaces. Sizhui always knows who he must be thinking of.\n“I’m alright, Jin Ling,” Sizhui says. “Just thinking.”\n“Hmph,” Jin Ling says in agreement. “It’s—” He bites off the word, thinks about it a second longer. “Jiujiu is going to be furious that I didn’t send word.”\n“Thank the gods you didn’t,” Jingyi says. At Jin Ling’s glare, he holds up his hands. “I’m just saying. Remember that night-hunt last winter, when Senior Wei was injured and we were halfway between Cloud Recesses and Lotus Pier? It would have been that, but worse.”\nThere’s a collective, rueful hum across the group. Sizhui remembers that night well. Hanguang-jun had won that fight and brought them all back to Gusu, but it had been an ugly one. If they’d gotten the chance to compete over A-Ying today, they might have actually come to blows.\nThey find the small group in the rabbit meadow a few minutes later: A-Ying in the center, patiently feeding dandelion greens to the white and gray speckled bunny on his lap. Zewu-jun and Hanguang-jun to the side, a teapot and two cups sitting between them, their soft smiles twinned. Master Lan stands some distance to the side, his own expression pinched. And next to Hanguang-jun, raptly watching A-Ying, is Wen Ning.\n“Uncle Wen,” Sizhui says, beaming. Wen Ning’s presence in Cloud Recesses is rare, and it’s rarer still that he’s brave enough to sit in full sight of Master Lan like this. But he looks almost relaxed, sitting there in the grass. \n“A-Yuan.” Wen Ning’s pale face warms. “Lan-er-gongzi sent word of what happened. I—I thought I might like to see for myself.”\nSizhui looks to Master Lan next, vaguely aware that he’s waiting to be greeted. “Xiansheng,” he says, bowing. The others mutter their greetings in turn.\n“Sizhui, Jingyi. Sect Leader Jin. Ouyang-gongzi.” Somehow, even when Master Lan is speaking, his mouth stays just as thin. “I thought I’d come see how Wei Wuxian has brought this sect to a grinding halt this week.”\nJingyi flinches. Sizhui doesn’t. Sizhui and Hanguang-jun have never talked openly about Master Lan’s feelings toward Wei Wuxian. But Hanguang-jun always made sure Sizhui understood two things growing up. That Master Lan, and in fact any senior, could be wrong. And that you can respect someone and still see their flaws with clear eyes.\nSizhui keeps his arguments to a minimum, if only because Wei Wuxian requested as much. But he never promised not to argue at all.\n“Xiansheng,” Sizhui says, “the disruption is our doing, not Senior Wei’s. These disciples apologize.”\nMaster Lan’s gaze narrows. But at length, his shoulders sink with a sigh. “He’s well-behaved, at least,” he allows. “One wishes he had been this obedient as a student here.”\nIt is, by Master Lan’s standards, a compliment as far as Wei Wuxian goes. But A-Ying’s words in Caiyi come back to Sizhui. Don’t ask for anything. Don’t take too much. Children look better when they’re smiling.\nHe opens his mouth. Hanguang-jun gets there first.\n“Wei Ying is still cautious,” he says. “Understandably, given his circumstances.”\nHe lifts his gaze to meet Master Lan’s, and they have a long, silent conversation. Whatever the result, Sizhui can’t quite tell, but Master Lan breaks first.\n“Well,” he says at length. “You have this in hand, then, Wangji?”\nHanguang-jun inclines his head in agreement. “Sizhui will brief me now.”\n“Then I’ll leave you to it,” Master Lan says.\nThe white and gray rabbit pushes off from A-Ying’s lap and makes a break for it. A-Ying rolls to his feet and starts to give chase. “Bunny!” he yelps. “Wait!”\n“Wei Ying,” Master Lan says, already half turned around. “No—”\nA-Ying stops so fast, he nearly trips over his own feet. And when he locks eyes with Master Lan, something happens that Sizhui has never seen before: Master Lan stops mid-rule.\nA-Ying, at least, looks more confused than afraid. But he folds into a clumsy bow anyway. “Was that bad? I’m sorry.”\nWhatever argument is going on inside Master Lan, there are no easy victors. He grimaces, and then painstakingly, his expression folds into something tightly controlled. Considering that he’s looking at Wei Wuxian, it could pass for pleasant.\n“No need,” he manages, eventually. “Run if you wish.” And turning on his heel, he strides off.\n“I should get back, as well,” Zewu-jun says.\n“Xiongzhang,” Hanguang-jun says. “You don’t have to.”\n“One of us should appease Shufu,” Zewu-jun says lightly. The usual weariness has started to creep in behind his eyes. But his smile as he crouches in front of A-Ying is genuine. “A-Ying, thank you so much for letting me play with you today. It’s been a while since I got to spend so much time with my little brother.”\n“Oh,” A-Ying says, wilting. “Gege is leaving?”\n“For today, at least.” Zewu-jun pats his head once. “But don’t worry. You’ll see me tomorrow.” He straightens, nods to juniors, and crosses the meadow after his uncle.\nHanguang-jun watches until Zewu-jun’s back has retreated far into the distance. Then he shifts to face A-Ying, who’s still craning his neck looking for signs of the rabbits. “A-Ying,” he says. “Come sit. The rabbits will return if you’re still.”\nA-Ying goes obediently. Sizhui had thought, earlier in the day, that seeing A-Ying wear his old uniform was as strange as it was going to get. Listening to Hanguang-jun tell A-Ying the same thing he used to tell Sizhui at that age is several magnitudes stranger. \n“The rest of you should sit, as well.” Wen Ning needlessly shifts to make room for all of them as they sit in a circle. “Wei-gongzi, are you thirsty? There’s more tea.”\n“Senior Wen,” Jingyi laughs, “you don’t have to keep calling him ‘gongzi.’ He’s six years old.”\nWen Ning ducks his head. If he could blush, he’d be blushing. “Sorry, Lan-gongzi. Habits.”\nA-Ying’s full attention is on Wen Ning now, somewhere past his face. He’s quiet long enough that Sizhui almost asks what’s wrong. “You have sticks in your hair,” he finally says.\n“Ah, you do,” Ouyang Zizhen says. “Senior Wen, did you come up through the woods again?”\n“We told you that you don’t have to do that,” Jin Ling mutters to the grass. \n“Thank you, Sect Leader Jin,” Wen Ning says. “But it’s really no trouble. And that way I won’t scare people on the roads.”\nHis stiff fingers reach for his hair, ready to feel for the twigs. A-Ying, darting across the grass, beats him there.\n“I’ll get it,” he announces. And with his face furrowed in concentration, he bounces onto the balls of his feet to reach Wen Ning’s hair.\nWen Ning is very still as A-Ying’s tiny fingers work at the knots. Something unreadable flits hummingbird-quick behind his eyes. “Thank you, Wei-gongzi.”\n“Uh-huh!” A-Ying chirps. \nThe bunnies keep their distance, in the end. A-Ying is still worlds more reserved in his movements than Wei Wuxian, but he’s gained a confidence he didn’t have this morning, and with it comes an insatiable curiosity. He picks the grass off of Wen Ning’s robes. He inspects every inch of Bichen, and when Sizhui presents Chenqing from his qiankun bag, he spends another ten minutes experimentally testing a few notes. \n(According to Hanguang-jun, there’s nothing he can summon with his current level of spiritual power. Ouyang Zizhen clutches his knees the whole time anyway.)\nBut A-Ying is particularly taken with Hanguang-jun’s robes, a lace outer robe ghosting over a light blue second layer with an intricately-detailed cloud hem. A-Ying makes at least five complete loops around Hanguang-jun, who’s sitting neatly on the grass with his skirts spread in a perfect circle, to inspect it.\n“A-Ying,” Jin Ling says, “the bunnies won’t come back if you don’t sit still.”\n“Let him look.” Hanguang-jun’s face has gone unbearably soft. It’s an expression Sizhui used to see only once in a while. Now it seems as if he sees it every other day. “Do you like it, A-Ying?”\n“Mmm…” A-Ying runs his hand across the embroidery, his own expression no less wonderous than it was the first few laps around the hem. “What the fuck.”\nNext to Sizhui, Jingyi stops breathing. Hanguang-jun blinks once, then lifts his head to face them. “Jingyi,” he says. And he’s the barest hint of amused. “It’s alright. Wei Ying already knows that word.”\nJingyi nearly melts. “Yeah,” he laughs nervously. “This disciple will be more careful next time, Hanguang-jun.”\nA-Ying starts his inspection all over again, this time following the path of one particular thread. Hanguang-jun’s next words don’t come for a long while. “Thank you all,” he says. “You made him very happy today.”\n“There’s no need to thank us, Hanguang-jun.” Ouyang Zizhen, seemingly realizing how vehement he sounded, flushes and lowers his voice. “I mean, it’s Senior Wei. So of course.”\n“Mm.” A breeze pushes Hanguang-jun’s hair back from his shoulders, his headpiece glinting in the sun. He’s wearing the same private smile as those unadorned moments in the Jingshi, eating dinner with Sizhui and Wei Wuxian, listening to the way their voices mingle in the candlelight. “I thank you nonetheless.”\nThere’s a sudden clatter, then a stumble – A-Ying has tripped over one of the teacups, and he’s falling. Hanguang-jun easily reaches back to catch him. “A-Ying,” he says, without censure, “be careful.” Then suddenly, he stills. \nHis voice barely shifts. But Sizhui knows, immediately, that something is wrong.\nThe first thing he can see is that A-Ying has gone white, his body frozen in Hanguang-jun’s arms. His wide eyes are fixed on a spot at the hem of Hanguang-jun’s robes, but Sizhui doesn’t see why until he moves to stand. The cup A-Ying tripped on was full, and the tea has left a dark bloom on the fabric.\n“A-Ying,” Hanguang-jun says carefully. “It’s alright. It will wash out.”\nA-Ying’s head jerks, a quick, aborted shake. “Sorry,” he whispers. “I’m sorry, I’ll—”\n“It’s alright,” Hanguang-jun tries again. But A-Ying has already slipped through his loose grip to his knees, clenching a ball of fabric from his own robes in a little white fist. He dabs twice, hard, at the stain, before Hanguang-jun gently catches his fist. \n“I’ll fix it.” A-Ying looks up, and to Sizhui’s horror, there are tears rolling soundlessly down his cheeks. “I can fix it. I’ll be more careful. I—you don’t have to—”\nIn one fluid motion, Hanguang-jun gathers A-Ying in his arms and presses him to his shoulder. A-Ying buries his face under Hanguang-jun’s chin and tucks himself into a trembling ball, pushing in closer with every whimper that escapes him. Like his cries are a flame to be snuffed.\n“I’ll fix it,” A-Ying whispers. “I won’t do it again, I won’t—you don’t have to make me leave, I’ll—”\nHanguang-jun looks torn open. Sizhui’s sure that expression is mirrored on his own face. His friends are frozen on either side of him, and behind Hanguang-jun, Wen Ning twists his hands in his lap.\n“A-Ying,” Hanguang-jun murmurs. There’s a rare thread of unsteadiness in his voice. “This is your home.”\nIt takes a few more repetitions for A-Ying to hear him, even as quiet as he is. His shivering subsides a little with Hanguang-jun’s palm rubbing a slow, soothing circle on his back, and even his whimpers give way to silence.\n“I can fix it,” he whispers miserably.\nHanguang-jun kisses the side of his head. “You don’t have to.”\n“I ruined it.” A-Ying is almost inaudible now.\n“You did not,” Hanguang-jun says, firmer this time. “If you had, that would make no difference. This would be your home all the same.”\nA-Ying sniffles quietly into Hanguang-jun’s robes. And Sizhui thinks, again, of A-Ying’s rules. Don’t ask for things. Don’t take too much. Always smile. Never cry. All of them broken today. And Sizhui has a terrible feeling that A-Ying is thinking of that, too.\n“This is your home,” Hanguang-jun says again. But Sizhui wonders if A-Ying knows what that means.\nHanguang-jun looks so lost. It’s an expression Sizhui faintly remembers from his own childhood, the first few times he cried. Ah, Wei Wuxian had mused a few months ago, how did Hanguang-jun deal with a crying child, anyway?\nHanguang-jun had let out that soft huff of a laugh. By imagining what Wei Ying would do.\n“Hanguang-jun,” Sizhui blurts out, his mouth two steps ahead of his brain. “Can I try something?”\n“Please,” Hanguang-jun says quietly.\nCarefully, Sizhui takes A-Ying from Hanguang-jun’s arms, where he pushes himself into Sizhui’s neck in turn. There’s a fine tremble running through every inch of him. His cries, at least, have stopped. But even when Sizhui ducks his head, trying to make eye contact, A-Ying curls tighter, keeping his face hidden.\n“I’m sorry,” he mumbles again.\nSizhui breathes in, summons every bit of decisiveness a head disciple should possess, and says, “Can you all dig a hole in the ground? A small one.”\nThey don’t need to be told twice. Hanguang-jun uses Bichen. Wen Ning uses his bare hands, quickly followed by Ouyang Zizhen and Jingyi. Even Jin Ling joins in, and makes the most minimal show of hating it that Sizhui has ever seen. In short order, there’s a shallow hole in the dirt at Sizhui’s feet.\nNow the hard part.\n“A-Ying,” Sizhui murmurs. He doesn’t loosen his grip, but he shifts A-Ying away from his body just a little. “Could you look up at gege for a moment? You’re not in trouble. I just want to show you something.” \nA-Ying is still for a moment longer. Then finally, he uncoils just enough to look at Sizhui. His eyes are swollen, and his face creased from the folds of Hanguang-jun and Sizhui’s robes, but he’s listening.\n“Thank you so much for doing that,” Sizhui says. “Now, I’m going to put you down. Will you listen to what I have to say until the end?”\nA-Ying doesn’t hesitate before nodding this time. And as gently as he can, Sizhui sets A-Ying in the hole.\n“La—” Jin Ling starts. Jingyi flaps a hand at him until he’s quiet again.\n“Good,” Sizhui says. “Now, I want to show you something.” At A-Ying’s next nod, Sizhui indicates Hanguang-jun and the others. “These geges are going to fill this hole back in. Hold really still, okay? That’ll help it work.”\nJin Ling still looks highly dubious. But when Hanguang-jun picks up a handful of the discarded dirt and evenly distributes it across A-Ying’s lap, the others don’t need much prodding.\nWen Ning and Ouyang Zizhen pile in small, gentle handfuls; Jin Ling’s are heaping, overflowing from his palms. Jingyi pokes one of A-Ying’s cheeks, leaving a dirt-fingerprint dimple, and for the first time that day, A-Ying laughs. A tiny thing, just a seed of Wei Wuxian’s.\n“Okay,” Sizhui says, clapping his hands. “Now you’re planted.”\nA-Ying’s full attention is up on Sizhui now. The lines of his shoulders have stopped trembling. “I’m a plant?”\n“Mm,” Sizhui says. “Kind of. Plants and people actually have a lot of things in common. We all need sunlight, water—” Remembering the missing element, he reaches out to grab the remaining teacup, pouring it into the dirt far enough away from A-Ying that he won’t get wet. “—and attention. Did you know that plants grow better with people to care for them?”\nAt A-Ying’s little questioning sound, Sizhui adds, “The person who taught me that planted me once, too. He said that with lots of water and sunshine, I’d grow taller, and I’d have lots of friends to play with.”\nA-Ying narrows his eyes. “That worked?”\nThey may be back in Cloud Recesses. But Sizhui has never felt so comfortable bending the truth a little. “Of course,” he says. “I have so many friends now. And I’m much taller.”\nSizhui doesn’t dare to look at Hanguang-jun. But he can feel his stare warm at his side. So he keeps going.\n“Do you know what holds a plant into the ground, A-Ying?” he asks.\n“Yeah.” A-Ying perks up. “They’ve got little…” He splays his fingers to demonstrate.\n“Roots,” Sizhui says.\n“Yeah!” A-Ying says.\n“Exactly.” Sizhui kneels until he’s at eye level. “When a plant gets taller, it grows into the ground, too. And when their roots get strong, they get stronger, too. They can grow to the side, or up toward the sun. And their roots reach so, so deep, that no one can move them, no one can even touch them.”\nSizhui leans just far enough forward to wipe the dirt off his cheek with a thumb. “And when we say this is your home, that’s what we mean. We want you to grow here, however you want. And stay for as long as you want to stay.”\nIt’s quiet enough that the tree line ripples in the breeze. And suddenly, Sizhui’s the one who’s unsteady. He has to take another breath before he asks, “Does that sound good?”\nA-Ying watches him with that same cautious look. The one that warms to new people easily, that smiles at them readily, but never quite trusts the ground under his feet.\nBut then he asks, “Do I have to stay in the dirt?”\nSizhui’s own laugh takes him by surprise. “No,” he says. “No, people aren’t exactly like plants. Would you like me to take you out now?”\nA-Ying hums. His eyes are still red-rimmed. But the start of a brilliant smile is forming. “Hmm,” he hums. “I’ll grow a little longer.”\nHanguang-jun kneels next to Sizhui. That soft look is back on his face. “Then I’ll bring Plant-gongzi more tea to grow faster.”\nA-Ying giggles again, and swipes away the last of his tears. \nWhen Sizhui rises, Jin Ling is scrubbing at his own eyes. “We’ve probably ruined his robes,” he says thickly. \nSizhui watches Hanguang-jun carefully, needlessly feed the soil. The last of the heaviness in him clenches, once. And then it lets go. “We have more.”\n***\nThe sun is low and bright, angled into their eyes, by the time A-Ying’s energy starts to flag again. Hanguang-jun takes him to the Jingshi to clean him up. Wen Ning politely excuses himself back to Caiyi. And Jingyi, Jin Ling, and Ouyang Zizhen join the other disciples for dinner.\nSizhui piles two servings onto a tray. And he makes his way to the Jingshi.\nIt’s dim and quiet when Sizhui slides open the door. Wei Wuxian’s belongings have been removed from the qiankun bag: Chenqing and Suibian sit layered with care on top of his robes, waiting for their owner’s return. Sizhui swallows. It must have been hard, for Hanguang-jun to have his husband right there and yet not.\nSizhui shuts the door behind him, letting the cool early evening settle in. And then he catches the low thread of a hum.\nHanguang-jun kneels on the floor by the table, by the sole lit candle in the room, and he is humming the song that Sizhui has known all his life – the song that Sizhui has just recently begun to understand. A-Ying is curled in his arms in a pair of Sizhui’s old robes, completely asleep. He shifts once to press his head deeper into the crook on Hanguang-jun’s elbow, but otherwise, he doesn’t stir.\n“Hanguang-jun,” Sizhui whispers. “I brought dinner. Should we wake him?”\nHanguang-jun lifts his gaze and shakes his head. “He needs rest,” he says. “But you should eat.”\nSizhui hovers. “I haven’t heard from my juniors yet,” he says. “I was thinking I might go back to the mountain.”\n“Sizhui,” Hanguang-jun says. His voice is as soft as rustling fabric. “The mountain demon won’t vary its hunting grounds. I’ll go myself when the sun sets. I will need you to watch Wei Ying.”\n“Of course,” Sizhui says quickly.\n“Good.” Hanguang-jun’s lips turn up, just a little. “Then you should eat first. Wei Ying may have my share if he wakes.”\n“… then I’ll eat,” Sizhui says, settling the tray and then himself at the table. “Thank you, Hanguang-jun.”\nHanguang-jun observes him a moment. In his lap, A-Ying wriggles and sighs. “You did well today, Sizhui.”\nSizhui’s laugh is mostly an exhale. “Truthfully, Hanguang-jun, I was making it up as I went.”\n“Wei Ying said the same about raising you,” Hanguang-jun says, drawing a more genuine laugh out of Sizhui this time. But then he adds, “Neither of you give yourself enough credit.”\nSizhui drops his gaze, worrying his hands in his lap. He feels Hanguang-jun’s eyes on him all the while. \n“This was a long time ago, Sizhui,” Hanguang-jun says. \n“Some of the things he said to us…” Sizhui doesn’t know how to say it, at first. But Hanguang-jun has never rushed him to speak. So he takes his time. “I wonder if he still believes them. Maybe not the same way he used to, but…”\n“Mm.” Hanguang-jun runs a slow, grounding hand through A-Ying’s hair. “What you know as a child are stones within your foundation. Difficult to dismantle completely.”\nSizhui knows. Has known since the marketplace, when A-Ying said that children look better when they smile and Sizhui catalogued every smile of Wei Wuxian’s in his mind. Has been thinking about it all day, surrounded by the people who made him, those who survived and those who didn’t. The arms have been different, over the years, but Sizhui has always been held. \n“Sizhui,” Hanguang-jun says again, a gentle tug back into the present. “Wei Ying was not shown much kindness. It is not something he expects, even now.”\n“Yes, Hanguang-jun,” Sizhui says. He knows that, too.\n“But,” Hanguang-jun says. “He knows there are people who believe him worthy of it. People such as you.”\nSizhui snaps straight. “Hanguang-jun, I don’t—”\n“You showed him kindness before you knew him truly,” Hanguang-jun says. “You saw to the heart of him, as you do everyone. It is not an easy thing to give people the regard they deserve. I have always admired his determination to do so. And yours.”\nSizhui can feel the blood rushing to his face. And with nothing to do to stop it, he just bows his head. “And that’s enough?”\nA-Ying frowns a little in his sleep; Hanguang-jun runs light fingers through his scalp until it smooths out again. “I once told Wei Ying he gave you joy. You have done the same for him. Then and now. It has always been enough.”\nSizhui can feel his eyes filling. But there’s nothing he can do to stop that, either.\n“And Sizhui,” Hanguang-jun says, shifting his attention to A-Ying to give Sizhui time to wipe his eyes. “I know you worry. For me, and for him.” He pauses, lets the words settle into the floorboards like dust. “When Wei Ying returns to himself, he will tell you that it is our job to worry about you. I will agree with him in advance.”\nSizhui doesn’t dare to look up until his face is dry, and his breath is under control. Until he smiles, and it doesn’t shake. “I’ll try to remember that, Hanguang-jun,” he says.\nHanguang-jun regards him a long time. Like he, too, has spent the day seeing through fractured glass, the Sizhui of then and the Sizhui of now side by side. “Good,” he says. “Then eat.”\n***\nHanguang-jun leaves not long after that, once the sun has dipped below the horizon and he’s tucked A-Ying into the Jingshi’s bed. A-Ying is all but swallowed in the pillow, the massive quilt. He curls up in a ball, burrowing into what must be unfamiliar softness, and he doesn’t move again.\nSizhui moves the candle beside him and sits by the bed, a few essays from his juniors spread out in his lap.\nHe wakes in the dark, a pair of arms around his waist.\n“Ow,” whispers a voice he hasn’t heard all day. “Sorry, sorry. You’re taller than you used to be.”\nSizhui blinks, paws at the empty air as he’s deposited onto something soft. “Xian-gege?” \nThere’s a low laugh, and then the press of lips against his temple. “Go back to sleep, A-Yuan.”\nSo he does.\n***\nThe first thing Sizhui is aware of is sunlight.\nThis should have been his first warning sign. But awareness is still coming in slow, slow stages. So he tilts his face further into the pillow to snuff it out.\n“I’ve tried that, too,” chirps a voice to his left. “Never seems to work.”\nSizhui clambers upright so fast, it leaves him dizzy. But the room finally rights itself: the Jingshi, the bed under him, the empty space where he’d fallen asleep watching A-Ying last night. There are covered dishes on the low table, and the room smells like rice and steam and the tang of chili oil. A ways away, Hanguang-jun sits in a chair, comb in hand and a small smile on his face. And kneeling between his legs, tilting his head back to give his husband better access to his hair, is Wei Wuxian.\n“Good morning, Sizhui,” Wei Wuxian says.\nHanguang-jun gathers half of Wei Wuxian’s hair to tie up. “Yes,” he says. “Good morning.”\n“Senior Wei!” Sizhui nearly cracks his knee on the edge of the bedframe in his hurry to stand. “How are you feeling?”\n“Completely 100% normal,” Wei Wuxian says.\n“Still a bit weakened,” Hanguang-jun corrects.\nWei Wuxian lets out a performative huff, but his smile hasn’t dimmed. It’s so wide that his nose is a little crinkled with it. “I may or may not have the spiritual power of a six-year-old for a few more days.” He staunches a yawn behind his hand. “And the stamina of one, apparently. Lan Zhan, how is it that I’m tired already?”\n“Good,” Hanguang-jun says. “You should rest today.”\n“Aiyo, I’m tired of resting.” He laughs. “You boys barely let my feet touch the ground yesterday. I had perfectly good legs, you know.”\n“I don’t...” Sizhui says. He’s still dazed, his mind sprinting to catch-up. “You let me sleep?”\n“You needed it,” Hanguang-jun says simply.\n“We were about to wake you, though,” Wei Wuxian says. “Your friends will be here for breakfast in…” He glances out the window, as if there’s something he can divine from the position of the sun. “… very short order. You might want to change.”\nSizhui glances down just long enough to catch the state of yesterday’s robes, flecked with dirt, grass, and a little hot oil from the potstickers in Caiyi. Then he makes for the wardrobe in the back of the Jingshi just slow enough that it’s not technically a run.\n“Middle drawer,” Hanguang-jun says.\n“Thank you!” Sizhui says, diving behind the privacy screen.\nSizhui scrambles to put on the fresh robes, and scrubs at his face just enough times that he feels like he’s doing something. By the time he sets the privacy screen aside, Wei Wuxian is kneeling at the table, uncovering six bowls of delicately steaming congee. Hanguang-jun has moved across the Jingshi to the door, which he slides open.\n“Good morning,” he says. \nSizhui hears Jingyi, Jin Ling, and Ouyang Zizhen before he sees them, chorusing “Good morning, Hanguang-jun,” in response. Hanguang-jun steps aside, and the three politely file in. Then they see Wei Wuxian, and they cross the room in a few quick steps to gather around him at the table.\n“Senior Wei!” Jingyi says.\n“Senior Wei, how are you feeling?” Ouyang Zizhen says. “Are you in any pain? Were there any side-effects?”\nJin Ling inclines his head in apparent disinterest, as if he’s not currently all but plastered to Wei Wuxian’s side. “So you’re back to normal.”\n“Alright, alright,” Wei Wuxian laughs. “I’m okay. Just a little tired. No pain to speak of, considering that I’ve just had the world’s most dramatic growth spurt.”\n“Do you remember anything?” Jingyi says.\n“Hmm.” Wei Wuxian makes a show of thinking for long enough that Sizhui is immediately sure that he remembers everything. “I remember Jingyi taught me how to curse.”\nJingyi sputters loudly. “You already knew how to curse! Even Hanguang-jun said so!”\nWei Wuxian uncovers the last bowl. “You all did well,” he says. “Though obviously I would prefer that next time, if there is a next time, you don’t try to hide the issue from Hanguang-jun for so long. Yes, we want to teach you how to solve these problems yourselves. But as long as we’re here, you don’t have to. Say ‘yes, Senior Wei.’”\n“Yes, Senior Wei,” the juniors chorus.\n“Good.” Wei Wuxian beams. “Now sit down. Lan Zhan, Sizhui, come here.”\nSizhui obediently shuffles across the room and sinks to Wei Wuxian’s side. “What is…”\n“We thought we’d make you all breakfast.” Wei Wuxian positions a bowl in front of Sizhui. “To thank you for taking such good care of me yesterday. That is to say, your Hanguang-jun made it, and I watched.”\n“I thought so,” Ouyang Zizhen says. “If Senior Wei had made it, it would look a little more like—” He nods to the volcanic red of Wei Wuxian’s own bowl. “That.”\n“Children these days, no taste for the finer things,” Wei Wuxian says lightly, inspecting his congee. “Hmm, Lan Zhan, this looks almost perfect. I’m just going to get a little extra—”\n“I will get it,” Hanguang-jun says, rising again. “Stay there.” \n“Ai, Lan Zhan,” Wei Wuxian whines. “I was spoiled all day yesterday. You can’t spoil me today too.”\n“You were cursed yesterday,” Jin Ling shoots back. “Just do what you’re told, Da jiu.”\nWei Wuxian points with his chopsticks and starts, “I at least have the strength to walk across the—” \nAnd then Sizhui sees the exact moment Jin Ling’s words land. Wei Wuxian blinks once, twice. Then echoes, “Da jiu.”\nJin Ling shrugs aggressively. He’s gone as red as Wei Wuxian’s bowl. “Just eat your breakfast,” he mutters.\nWei Wuxian’s very still as Hanguang-jun leans over him, placing the chili oil next to his bowl. His smile is spun sugar, translucent and fragile. Then it spreads. “Okay, A-Ling.”\nThe scent of the chili oil meeting the rice and mushrooms wafts across the table, and now that Sizhui’s stomach has caught up with the rest of his body, he feels suddenly, ravenously hungry. But before he can take a bite, he feels the warmth of Wei Wuxian leaning against his shoulder. “Oh,” he says, “and Sizhui.”\nSo Sizhui looks up. And when he does, he finds Wei Wuxian trying very hard to look stern. But beneath it, there’s something uncertain, almost shy. “Don’t you know better than to take parenting tips from me?” \nSizhui takes a bite of the congee, lets the warmth of it spread through every inch of him. And then he grins. “Why wouldn’t I, Senior Wei?” he says. “I told you, it worked.”\nThey’ll spend at least an hour at that table: Sizhui and Hanguang-jun eating in silence, the others very much not. They’ll break the rule about making an uproar, and the rule about eating more than three bowls, and the rule about smiling foolishly. Hanguang-jun will pretend not to notice. Sizhui and Jingyi will promise to copy the rules later anyway. \nWei Wuxian will fall asleep on Hanguang-jun’s shoulder. And when the others have gone, when Hanguang-jun pulls a quilt over his husband and settles in to play him songs for a restful sleep, Sizhui will ask to join him. And Hanguang-jun will agree.\nAnd Sizhui will sit at his guqin – surrounded by the people who made him, the house that sheltered him, and the earth in which he grows – and he’ll stay."
}