{
    "id": "2447843",
    "url": "https://archiveofourown.org/works/2447843?view_full_work=true",
    "author": [
        "orphan_account"
    ],
    "title": "Hemingway Can Suck It",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Teen Wolf (TV)"
    ],
    "relationships": [
        "Derek Hale/Stiles Stilinski",
        "Background Allison Argent/Lydia Martin",
        "Background Scott McCall/Kira Yukimura"
    ],
    "characters": [
        "Stiles Stilinski",
        "Derek Hale",
        "Lydia Martin",
        "Kira Yukimura",
        "Laura Hale"
    ],
    "additional_tags": [
        "Alternate Universe - College/University",
        "Alternate Universe - No Werewolves",
        "Misunderstandings",
        "Miscommunication",
        "Teacher-Student Relationship",
        "(but not actually)",
        "(Derek's just unobservant and self-sabotaging)",
        "Alternate Universe - Professors"
    ],
    "language": "English",
    "series": "Part 1 of Academia AU",
    "published": "2014-10-13",
    "completed": null,
    "words": "10,054",
    "chapters": "1/1",
    "comments": "492",
    "kudos": "25,473",
    "bookmarks": "6,084",
    "hits": "338,517",
    "summary": "<p>“For those of you who just transferred into this class or simply decided that day one wasn’t important enough to attend, I’m Professor Hale. Welcome to English 346, The American Novel.”</p>\n<p>Stiles is pretty sure his mouth is hanging open right now and that his eyes are wide with shock, because holy <em>fuck</em>, he thinks he knows why his students transferred. Hell, if he was still an undergrad, he probably would have transferred, too.</p>\n<p>(Or: In which Stiles is a Biology professor and Derek thinks he's a student.)</p>\n<p>Note: French translation by the lovely enso-infinite now available (link inside)!</p>",
    "notes": "<p>This fic was partially inspired by the cherik fic <a href=\"https://archiveofourown.org/works/287077/chapters/458185\" rel=\"nofollow\">An Ideal Grace</a> which is a million times better, so if you like cherik you should read it. Also, I may or may not utterly despise Hemingway, so be warned.</p>\n<p>Trigger Warnings: Misunderstanding that implies a teacher-student relationship</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Also, I so wanted to use the line \"He said Hemingway was 'no homo' personified. I think I'm in love.\" but then I couldn't figure out to incorporate it properly because it's from Stiles' POV. Sigh. Anyway, come chat with me on tumblr if you like, too. I'm <a href=\"https://authorkurikuri.tumblr.com\" rel=\"nofollow\">authorkurikuri</a>.</p>\n<p>(Also, about the thing where Stiles mentions getting mistaken for a high school student by a colleague, that actually happened to my aunt who's a biochem professor.)</p>\n<p>Heeeey, so I made a gifset thingy too, <a href=\"https://authorkurikuri.tumblr.com/post/99946287250/hemingway-can-suck-it-teen-10k-for-those-of\" rel=\"nofollow\">here</a>.</p>\n<p>\n<em>I do not give permission to have any of my works put up on goodreads or any other such site.</em>\n</p>",
    "text": "“So I was having a pretty good morning,” Stiles says without preamble as he throws himself down in the chair across from Lydia, a scowl on his face. “In fact, I was having an excellent morning.”\n“But?” Lydia asks, her tone bored, not bothering to look up from the paper she’s grading, blood red pen in hand.\n“But then I found out that all but five of my Bio 424 students transferred out of the class last minute,” Stiles bitches, throwing his hands up in the air and slumping back in his chair. “All but five, Lydia. Five. I had to cancel it.”\n“They transferred out of your class?” Lydia questions, looking up, her interest piqued.\nStiles can’t help but preen at that a little bit, because he knows he’s a good teacher, okay? He’s young and enthusiastic and can remember names like a boss. Also, epigenetics is kickass, so really there’s absolutely no reason for any of his students to transfer out of his class, much less over eighty percent of them.\n“You said this was your Bio 424 course?” Lydia continues, a contemplative look on her face as she taps her pen against her perfectly painted lips. “Monday, Wednesday, and Friday at eight am?”\n“Yeah,” Stiles answers, eyeing Lydia suspiciously. She clearly knows something he doesn’t on the matter.\n“When was the last time you dropped by the English department?” she asks, a dangerous smile spreading over her face – the sort of which terrifies and arouses Stiles in equal measure.\n“I dunno. Why?” Stiles replies warily, frowning. It’s a fairly strange question, after all.\n“There’s a new addition to the staff who has a class at the same time as your Bio 424,” Lydia answers, as if that explanation should solve everything. If she’d been teaching a class at the same time as him, he could understand people transferring into her class, but all of his bio students transferring into an English course? Clearly Lydia hasn’t had quite enough coffee yet this morning.\n“How’s that relevant?” Stiles asks, his brow furrowing in confusion, nose wrinkling in distaste.\n“I think you’ll have to go see for yourself,” Lydia replies, that dangerous glint still shining in her eyes, an amused smirk curling her lips. “I believe the class is in room 240 in the SEC.”\n“How do you know that?” Stiles questions, because, really, this whole thing is just getting more and more confusing.\n“I may have sat in on the class this morning,” Lydia admits, although she sounds inordinately pleased instead of embarrassed or guilty. “Not exactly my type, but I can see why your students would transfer.”\n“The class wasn’t your type?” Stiles asks, still completely lost.\n“Just check it out,” Lydia sighs, doing that thing where she rolls her eyes at him without ever actually rolling her eyes. “You’ll thank me later.”\nStiles lets out an annoyed huff, but doesn’t try to wheedle any more information out of Lydia – it’s a useless endeavor if there ever was one. Their conversation devolves from there, Stiles nodding along understandingly as Lydia complains about particularly idiotic students. Somehow she’d gotten stuck teaching a section of Intro Bio, which Stiles really doesn’t envy. There are, what, two to three hundred students per section?\nHe doesn’t forget about the mysterious English class, though, which is why, instead of sleeping comfortably in his apartment, he finds himself wandering aimlessly around the Sheppard English Center at seven forty-five the next morning, trying to remember which room Lydia had said the class was in. It’s somewhere on the second floor, he knows, but –\n“You look lost,” a voice says, nearly startling Stiles out of his skin.\nHe whirls around, an answer on the tip of his tongue, but his mind goes blank as soon as he lays eyes on his savior. Because, hot damn, he needs to get lost more often if it means that this guy is going to help him out. Stiles licks his lower lip and tries to figure out what to say.\n“Forgot the classroom number,” is what he finally settles on, shooting the guy his most charming smile. God, he hopes the dude’s into nerdy-looking geneticists. Stiles doesn’t recognize him, but he looks too old to be a student. A new lecturer, maybe?\n“What class is it?” Hot Guy asks, sounding a little annoyed and less than charmed, much to Stiles’ disappointment.\n“Uh,” Stiles says, blushing as he realizes that he doesn’t actually know. “I’m not actually sure. I know it starts at eight and that it’s taught by a new prof.”\n“You don’t even know the course name?” the guy asks, making Stiles wince a little, because okay, maybe he should have looked it up in the course guide, but he was a little preoccupied with informing his remaining Bio 424 students that the class had been cancelled. He then had to figure out how to shift the course over to next semester and rework his entire research schedule to accommodate the time loss. His winter semester is going to be so hectic.\n“So I’ve been a little busy lately – sue me,” Stiles huffs, crossing his arms over his chest. “Now do you know what class I’m talking about, or should I just continue awkwardly checking every freaking room on this floor?”\n“Come with me,” the guy says, and, wow, Stiles thought that Lydia was the only one capable of doing that ‘rolling your eyes but not actually rolling your eyes’ thing. Maybe it’s just a thing all hot people are innately capable of. Or maybe they’ve developed it specifically to show their disdain of him.\nStiles, on the other hand, has no problem with actually rolling his eyes. He does follow, though, only because the class is going to start relatively soon and he knows how annoying it can be to have people barging into your class late when you’re trying to teach. The room Hot Guy leads him to is actually more of a classroom than a lecture hall, which, he supposes, shouldn’t be all that surprising, considering the type of class this is.\nWhat is surprising, though, is how packed it is. In fact, Stiles ends up having to stand awkwardly in the back of the room because all of the desks are taken. Really, what could be so amazing about –\n“For those of you who just transferred into this class or simply decided that day one wasn’t important enough to attend, I’m Professor Hale,” Hot Guy announces, moving to stand at the front of the room, surveying the class with a cool gaze. “Welcome to English 346, The American Novel.”\nOh, wow. Stiles is pretty sure his mouth is hanging open right now and that his eyes are wide with shock, because holy fuck, he thinks he knows why his students transferred. Hell, if he was still an undergrad, he probably would have transferred, too. Sure, the guy – Professor Hale – was hot in the hallway, but the tone of voice he’s using right now kind of makes Stiles want to drop to his knees immediately, and he’s pretty sure he’s not the only person in the classroom who feels that way.\n“Now, as you all know from the syllabus, our first text, which you should have already started reading, is Ernest Hemingway’s A Farewell to Arms,” Professor Hale continues, turning to write some basic information about Hemingway on the blackboard behind him. “Hemingway was one of the most influential, and arguably one of the greatest, American writers of – ”\nStiles can’t help but let out a snort at that. He just can’t – not when someone’s calling Hemingway “one of the greatest American writers.”\n“Do you have a comment to make, Mr. – ?” Hale asks, turning around to stare directly at Stiles. Seriously, how the fuck did he even hear that?\n“Stiles,” Stiles answers, smiling at Hale a little sharply. “But I mean, c’mon, Hemingway? Really?”\n“Do you have an issue with Hemingway?” Hale shoots back, quirking an eyebrow at him, obviously unimpressed with his answer.\n“What, you mean besides the fact that the dude was basically the phrase ‘no homo’ personified?” Stiles replies, and for a moment he almost thinks he sees Hale’s lips twitch up into an amused smile. “Seriously, American society could have done without his contributions to sexism and the ideal of hypermasculinity.”\n“That doesn’t change the fact that his writing style – ” Hale starts, only to be cut off by a sharp laugh from Stiles.\n“So the fact that his writing is pretty excuses the societal messages and consequences of his books?” Stiles retorts, unable to help himself from enjoying the way Hale scowls at his words. “The only worthwhile book is one that actually says something meaningful.”\n“Would you therefore like to discount more than seventy five percent of the world’s literature?” Hale asks, looking at Stiles intently. “Is the Harry Potter series not worth your while?”\n“Dude, Harry Potter is about the power of love and families of choice,” Stiles shoots back, narrowing his eyes, because no one insults Harry Potter on his watch, goddamn it. “Hemingway just writes about men drinking and women crying.”\n“Well then, Mr. Stiles, I’m sure you can tell me all about how much you hate Hemingway in our subsequent classes, when we really start delving into the book,” Hale replies, his smile all teeth.\nStiles just barely manages to prevent himself from saying, “Oh, it’s on,” and that’s only because he realizes that three of the students he had in his Bioethics course last semester are staring at him like he’s been replaced by a pod person.\nWhat can he say? It looks like Professor Hale brings out the best in him.\n---\nJust a little over twenty four hours pass before Stiles sees Professor Hale again. Even then, it’s not like it’s intentional. Really, it would be more accurate to say that a little more than twenty four hours pass before Stiles runs into Professor Hale again. Literally.\n“Shit!” Stiles squawks as he takes the hallway corner a little too quickly and comes face to face with Hale.\nUnfortunately, Hale looks just as startled as he probably does and before he can slow himself down sufficiently, they’re colliding. The folders that Hale was holding go crashing to the ground, and Stiles nearly follows – his slim form can’t possibly compete with I’m-a-wall-of-solid-muscle Hale’s. However, before he does a face plant, he feels an arm wrap around his waist, steadying him.\n“Hey,” he says awkwardly, shoving his skewed glasses back up his nose. Fuck, if he’d known he was going to run into Hale today, he would have worn his contacts instead. “Nice, uh, save there, Professor Hale.”\n“You should watch where you’re going, Mr. Stiles,” Hale says after a beat of silence, taking his hand off of Stiles’ waist as quickly as if he’d been burned.\n“Just Stiles,” Stiles blurts out, still staring at Hale, transfixed. “Stiles is my first name.”\n“Your parents named you ‘Stiles’?” Hale asks, his brow furrowing slightly and his frown deepening.\n“It’s a nickname,” Stiles explains, cheeks flushing, looking away from Hale and down at where the papers he was carrying are now scattered across the floor. He feels his cheeks heat even more at the mess he’s caused and quickly drops down onto his hands and knees in order to help pick them up.\n“What’s your actual name, then?” Hale replies, also kneeling in order to gather his papers.\n“A monstrosity that no one’s ears should ever have to bear the burden of hearing,” Stiles quips, pausing as he picks up one of the sheets of paper, pursing his lips as he reads it. “Wait, is this seriously your class booklist? Please tell me it isn’t.”\n“What’s wrong with it?” Hale asks, sounding distinctly annoyed again.\n“Do you seriously see nothing problematic about the fact that all of these texts were written by straight white men?” Stiles shoots back, looking back up at Hale, his expression unimpressed. “I mean, four out of the five are even dead.”\nHale fixes him with an intense, unreadable look, and Stiles is about to flounder for an excuse in order to escape Hale’s wrath, but just as he opens his mouth, Hale smiles.\n“What books would you choose?” Hale asks, but his tone isn’t at all combative or defensive, throwing Stiles off guard. “If you were to design the course.”\nStiles blinks at him, just looks at him for a moment, before averting his eyes and chewing on his bottom lip, considering the question. It’s a difficult one for sure, and Stiles hasn’t had any sort of English class since his sophomore year of college, so it takes a bit of digging for him to come up with an appropriate answer.\n“Something by Sherman Alexie,” Stiles starts, his lips forming the words slowly as he tries to organize his ideas. “Flight, maybe.”\n“Good choice,” Hale says, a note of approval in his voice that has Stiles suppressing a shiver. “What else?”\n“The Bluest Eye by Toni Morrison,” Stiles continues, gaining a bit of confidence, enough to look up at Hale again. “One Flew Over the Cuckoo’s Nest by Ken Kesey.” \n“Happy stories,” Hale snorts, but he he’s still smiling that small smile of his, eyes bright with interest.\n“Please, like Lolita and Cat’s Cradle are any better,” Stiles scoffs, but he can feel a smile tugging at the corners of his lips, too. “What about The Curious Incident of the Dog in the Night-Time, then? That has a semi-happy ending.”\n“Haddon’s British,” Hale replies, continuing to focus solely on Stiles in that unnerving way of his. “The course is The American Novel, remember?”\n“Damn,” Stiles says, biting his lip again. “Uh, well. Fahrenheit 451’s good. Either that or The Namesake by Jhumpa Lahiri.”\n“I’d go with The Namesake,” Hale replies, nodding. “It gives a little more variety, considering how you already have a dystopic novel with One Flew Over the Cuckoo’s Nest. And the last one?”\nStiles pauses, studying Hale carefully before deciding what to say.\n“Brokeback Mountain,” Stiles answers finally, smirking a little bit, his tone dipping just enough to be flirtatious.\n“That’s a short story,” Hale points out, but Stiles is gratified to notice that his cheeks have turned a little pink. “And just for the record, I didn’t choose the course texts.”\n“You didn’t?” Stiles asks, surprised.\n“I accepted the position fairly late and it was easier for me to just use the materials that the previous professor had left,” Hale answers, shrugging before moving to pick up the last two papers off the ground. “If I ever teach the course again, though, I’m certainly changing a good portion of the material.”\n“Good. I’d have lost all respect for you otherwise,” Stiles says, grinning at Professor Hale as he hands over his armful of papers and they both stand up again. Idly, Stiles wonders how long they were crouched there, discussing literature.\n“You respect me?” Hale snorts, although he sounds distinctly amused.\n“Just because I respect you a little doesn’t mean you’re not wrong,” Stiles shoots back, earning him a mild glare from Hale.\n“Brat,” Hale grumbles, shuffling his papers back into order. “Anyway, don’t you have somewhere to be? You seemed like you were in a hurry.”\n“Oh, shit,” Stiles says, grimacing as he glances at his watch, already slinging his bag over his shoulder. “Thanks for reminding me.”\n“I’ll see you in class on Friday, Mr. – ?” Hale calls out as Stiles starts rushing down the hall again.\n“Just call me Stiles!” he yells over his shoulder, sparing one backward glance.\nHe really does have to hurry, though. He’d texted Kira saying that he was coming around to chat for a bit at one twenty-five and it’s already one thirty-six. She has a section of Asian American Lit that she has to teach at two, also, so his timing actually does make a difference.\n“Hey Kira,” he greets her, trying to steady his breathing when he finally pokes his head into her office.\n“Stiles! I was just about to text you,” she replies, a bright smile on her face as she stands up from her desk to pull him into a hug.\n“So, how was Japan?” Stiles asks as squeezing her tightly.\n“Amazing, as always,” Kira answers, still beaming as they break apart. “I swear, even though I’ve been four times, each visit feels like something completely new.”\n“Damn, I wish I could go,” Stiles sighs, plopping himself down on the couch in Kira’s office, Kira taking a seat next to him.\n“Maybe there’ll be a conference you can go to someday,” Kira says, trying to reassure him. “You could get the university to pay the airfare then.”\n“Yeah, well, I’d probably only get to go to the American Society of Human Genetics’ main conference, and that’s always held either in the US or Canada,” Stiles replies, pouting a little bit.\n“Well, someday when you’re tenured and have enough money saved up, then you can go,” Kira says, leaning over and wrapping an arm around his shoulder, squeezing him a little. “Either that or I’ll, like, save up as many skymiles as possible and use them on you.”\n“Aw, thanks, Kira,” Stiles replies, smiling and snuggling up next to her. “Seriously, though, how was it? Did you finally get to Nara?”\n“Oh my god, Nara was amazing,” Kira gushes, cheeks flushing with excitement at the mere memory of the place. “I wish my Japanese was better, though – I wanted to write haikus to it.”\n“You’re such an English professor,” Stiles laughs, bumping his shoulder against Kira’s lightly.\n“And you’re such a scientist,” Kira shoots back, a wide grin on her face, a teasing spark in her eyes.\n“Hey, I’ll have you know that I attended an English lecture yesterday!” Stiles protests – not that he’s actually offended or anything.\n“Wait, really?” Kira asks, blinking at him in surprise. “Which class?”\n“English 346,” Stiles admits, wincing slightly as he begins to regret his impulsive outburst, hoping that Kira doesn’t push too much on the subject.\nShe looks at him for a moment and then smiles knowingly. No such luck, then.\n“Derek teaches that, doesn’t he?” she says, clearly amused at his expense.\n“Derek?” Stiles repeats, feigning innocence, trying not to think about how his heart rate speeds up a little at finding out Professor Hale’s first name. God, he’s like a student with a crush. He totally could have looked up Hale’s – Derek’s – name online, anyway.\n“Professor Hale,” Kira clarifies, unable to hide her grin anymore. “New, young, could probably quit academia to become a model, you know.”\n“He stole my students!” Stiles protests, giving up the pretense of not knowing who she’s talking about. “I had to cancel my Bio 424 class because it was at the same time as his stupid English 346 class and, like, eight percent of my students transferred at the last minute!”\n“Oh, I’m sorry, Stiles,” Kira replies, the smile slipping off her face, immediately making Stiles feel guilty. “Did you get it moved to next semester, at least?”\n“Yeah, but it’s going to make my life so much more hectic,” Stiles sighs, because he’s been trying not to think too hard about it (thankfully Derek’s been a fairly good distraction). “I mean, I’m going to be up for tenure soon, and I really hope this doesn’t affect that.”\n“It shouldn’t. It’s not like it was your fault,” Kira reassures him, her arm still around his shoulders. “In fact – ”\nA loud buzzing sound comes from Kira’s phone, cutting her off.\n“Shit. I’m sorry, Stiles, but I’ve got to – ” Kira says, checking her phone to find a notice from her calendar, saying that she has a class to teach in ten minutes.\n“It’s fine. We’ll catch up later,” Stiles replies, waving her off. “I have some stuff I need to finish up at the lab anyway. No biggie.”\n“Text me, okay?” Kira says, pressing a light kiss to his cheek before rushing out the door.\n“Will do!” Stiles calls after her.\n---\nStiles considers not going to Derek’s class the next morning. Really, there’s no logical reason for him to go. Instead he could sleep in, could get his PCR started early, could leisurely get coffee and text Scott. He could do anything.\nInstead, he finds himself, once again, in Derek Hale’s English 346 class. Where he’s currently arguing with Derek about Hemingway’s latent homosexuality (or lack thereof). What?\n“Okay, so I can agree with the whole frat-boy-like overcompensation thing, but what you’re saying about his portrayal of gender is bullshit,” Stiles protests, leaning against the back wall of the classroom like he did on the first day.\n“Well, in The Garden of Eden – ” Derek starts, but Stiles cuts him off with a loud groan, the sort of which would probably get him failed if he were actually a student. In fact, a few of the actual students in the class do look a little scandalized, except for those who’ve had him as teacher before.\n“Oh my god, you actually subjected yourself to that much Hemingway?” Stiles asks, trying not to make a childish gagging expression. “Do you not love yourself?”\n“Mr. – ” Derek snaps, cutting himself off with a frustrated look, like he’s sucking on a lemon. “Stiles.”\nStiles can’t help but grin cheekily at Derek’s use of his first name.\n“Look, I’m just saying. Just because he used the word ‘androgynous’ once and had a character cross-dress doesn’t technically support your latent homosexuality theory,” Stiles protests, shrugging. “And the whole lesbian relationship between Marita and Catherine really just seems like a male gaze thing. I mean, David’s the one who ends up with Marita anyway. So yeah, not really supporting Hemingway’s latent homosexuality.”\nStiles is pretty sure that he hears one of the students mutter, “There’s more than enough latent homosexuality in this room already.” Stiles has to bite his lip not to laugh. Really, there’s nothing “latent” about it. Also, he’s bisexual, thank you very much.\n“So you did read The Garden of Eden,” is apparently what Derek decides to reply with, making Stiles scowl and blush a little.\n“Only, like, half of it,” Stiles snorts, crossing his arms over his chest. “Eventually I gave up and just read an online summary.”\n“Um,” a tentative voice says, breaking into their conversation. Stiles feels a little sorry for the overwhelmed look that comes across the student’s face as both he and Derek turn their eyes on her. “So I’m kind of confused. Weren’t we reading A Farewell to Arms? I didn’t get the wrong book, did I?”\n“Yes, sorry,” Derek replies, clearing his throat, cheeks a little pink. “A Farewell to Arms.”\nAnd okay, so maybe Stiles is feeling a little guilty about taking away learning opportunities from students. Just a little, though. It’s way too much fun to argue with Derek.\n---\nToday has been going… well, it’s been going. It’s certainly not the worst day Stiles has ever had, but it’s certainly not the best either. He didn’t go to Derek’s class today and, honestly, he’s feeling a little bad about that. Of course, if he actually went he’d probably feel even worse. He’s taking up time which Derek should be spending on his students, and that’s really a dick move. His desire to get all up in that shouldn’t outweigh a student’s learning opportunity.\nSo, instead he’d gotten an early start in the lab. It’s nice, actually, working there first thing in the morning. The relative quiet before people really start trickling in is sort of comforting. It certainly helps him focus, at least.\nTherefore, as he’s walking out of the lab to go get coffee, he’s in a decent mood, despite having missed Derek’s class. It’s not necessarily a good mood, but he’s feeling pleasant enough.\nWhich is why he hasn’t left this stupid undergrad to fend for himself yet, because really? How many times does he need Stiles to repeat the directions to the chemistry building?\n“Okay, I think I’ve got it now,” the guy says, smiling at Stiles and looking at him in a way that makes his skin crawl just a little bit.\n“Trust me, it’s really not that hard to find,” Stiles replies, forcing a smile and taking a step back, trying to remember when the guy had gotten so close to him.\n“You know, I’m taking Bio 424 next semester,” the guy continues, gesturing to the course textbook that Stiles is carrying, and oh god, isn’t that just Stiles’ luck? “Maybe I’ll see you in class. We could, ah, form a study group. You could probably even tutor me. You look like you’re good at biology.”\nWait. What?\n“I’m pretty sure professors aren’t supposed to tutor individual students,” Stiles says pointedly, trying to tamp down on the flush threatening to cover his cheeks. “You can ask questions during my office hours, though.”\nThe student blinks at him for a moment, uncomprehending, before turning bright, bright red.\n“I’m willing to forget this encounter as long as you are,” Stiles continues, his words pointed, and the student nods a little hastily, at a loss for words. “I’ll see you in my class, then.”\nAs he’s walking away, he’s pretty sure he hears the guy mutter, “Holy shit, Rate My Professor was right.” Stiles is pretty sure he doesn’t want to know.\n(Okay, so maybe he does. Just a little bit. He’ll look it up when he gets home.)\nHe can’t help but let out a put upon sigh, though, his mood dampened. It’s not like this is the first time something like this has happened to him. Really, he should almost be used to it by now. He’s aware that he looks much younger than his twenty-nine years, still gangly and a little baby-faced. Still, it’s always awkward to get hit on by your students, especially if they don’t know that you’re their professor. At least today wasn’t like when he’d first started teaching and a colleague mistook him for a high school student.\nBy the time he arrives at the Starbucks nearest to the center of campus, though, he’s feeling at least a little bit better. Their mochas are his guilty pleasure, even though Lydia always gives him shit about it. Just because she can’t stand anything but that special, high end stuff that she orders from god knows what tropical island doesn’t mean that his palate is that uncultured.\nHe gets up to the counter and doesn’t even have to order, really – he comes in often enough that pretty much everyone who works there knows that he never fails to get a mocha. So there he is, standing near the drink pickup area and messing around on his phone, when he hears a very familiar voice say, “Stiles?”\nOh, shit. Shit, it’s Derek. He quickly runs a hand through his hair, trying to straighten it out so that it doesn’t look like he wandered out of his apartment this morning without brushing it (hint: he did). He’s wearing his glasses again, too, and because he just came from the lab he probably has fucking goggle lines framing his eyes. Fuck, he probably looks like the poster child for “awkward scientist.” He’s not even wearing a nice shirt today.\n“I didn’t see you in class today,” Derek says, breaking Stiles out of the mildly panicked trance he’s fallen into.\n“Huh?” Stiles replies intelligently, blinking at him. “Oh! Yeah, I had some lab work that I needed to get done this morning.”\n“You ditched class for lab work?” Derek asks, sounding surprised and a little disappointed.\n“Hey! I didn’t ditch,” Stiles protests, mildly offended by Derek’s word choice. “I can’t ditch a class I’m not actually taking.”\n“Oh. Well, I suppose that explains why I couldn’t find you on my class roster,” Derek teases. Or, well, he’s probably teasing. His tone isn’t quite right, but that has to be a joke, right? Him being on the class roster?\n“Yeah, well, obviously I had to see what all the commotion was about when, like, eighty percent of my Bio 424 class transferred at the last moment,” Stiles replies, shooting Derek a grin. “Not that I can really blame them, now that I know what all the fuss is about.”\n“I – ” Derek starts, blushing, but then he cuts himself off, pausing for a moment. “Class was quiet without you today.”\n“A lot of people would consider that a good thing,” Stiles snorts, shoving his hands in to his pockets and rocking back on his heels awkwardly, trying to resist the urge to mess with his hair again. “And anyway, I don’t want to take away learning opportunities from your actual students. They’ll start talking eventually.”\n“So you’re not coming back?” Derek asks, sounding strangely disappointed.\n“Are you really that desperate to continue our argument about Hemingway?” Stiles shoots back, quirking an eyebrow at Derek.\n“Continue? That implies that I didn’t already win,” Derek replies, the corners of his lips twitching up in what’s almost a smile.\n“Oh, there’s no way you won that,” Stiles says, a rush of something he can’t quite identify swelling in his chest. “Hemingway’s a dick and you agree – you just don’t want to admit it.”\n“That’s exactly what it is,” Derek snorts, sarcasm obvious. “Remind me, which one of us has a PhD in English?”\n“What, is liking Hemingway a PhD requirement?” Stiles shoots back, tying not to think too hard about how comfortable their bantering is and how much he’d prefer it if it was happening while they were in a more horizontal position.\n“No, but acknowledging his contributions to American literature and the art of writing as a whole is,” Derek replies, giving Stiles an unimpressed look.\n“Well, in my opinion, Hemingway can suck it,” Stiles says, sticking his tongue out at Derek. The barista, who he’s pretty sure was in one of his classes last year, openly stares at him. Ugh, sometimes he forgets that, as a university professor, he’s supposed to act like a mature adult.\n“I don’t know how your other professors survived having you in their classes,” Derek huffs, although there’s a note of amusement in his voice.\n“You seem to be holding up pretty well so far,” Stiles replies, his smile softening just a little.\nDerek opens his mouth to reply, but he’s cut off as the barista yells, “Grande mocha for Stiles!”\n“Chocolate this early in the morning? Really?” is what Derek ends up saying, his tone clearly judging.\n“Okay, first of all, it’s already ten, so it’s not that early,” Stiles retorts, leveling Derek with his own judging look. “Secondly, I’m not sure what sort of messed up life you’re living, but for your information, it’s always a good time for chocolate.”\nStiles thinks he might hear Derek mutter, “God, you’re so young,” under his breath. Which, you know, is kind of weird, because Derek can’t be more than a handful of years older than him. He’s about to say as much, when his phone buzzes with a text. He shoots Derek an apologetic look before checking it, cursing softly as he reads it.\n“Sorry, but it looks like I have to go,” Stiles says, shoving his phone back into his pocket and grabbing his mocha off the pickup counter. \"Incident in the lab.\"\n“I’ll see you on Wednesday?” Derek replies, but it’s phrased as a question. In fact, it almost sounds tentative, which isn’t exactly a word Stiles would have thought to associate with Derek Hale.\n“Maybe? I don’t know. It depends on my workload,” Stiles answers, his tone apologetic as he tries not to read too deeply into Derek’s carefully blank expression. “I could stop by during your office hours, though.”\n“I’m not sure that’s a good idea,” Derek mutters, which really only serves to confuse Stiles more, because why the hell would that not be a good idea?\n“Okaaaaay,” Stiles says, stretching out the word and giving Derek a confused look. “Well, I’ll see you when I can. Which, you know, might have to be during your office hours.”\nDerek lets out a little huff, but doesn’t argue.\n“Anyway, I’ll see you ‘round, Derek,” Stiles continues, shooting Derek a little smile before turning to leave.\n“That’s Professor Hale to you!” Derek calls after him, and Stiles just laughs.\n---\n“So, a little birdie told me that you’ve been hanging around Hale recently,” Lydia says as soon as Stiles walks into her office, nearly making him turn around and walk right back out the door.\n“Kira wouldn’t have betrayed me,” Stiles replies, narrowing his eyes at her.\n“No, but Allison saw you two getting cozy in his office a few days ago,” Lydia retorts, raising one perfectly sculpted eyebrow. “So spill.”\n“You’re making your girlfriend spy on me?” Stiles asks, trying (probably in vain) to distract her from the situation at hand.\n“She and Kira were going to lunch together. She just happened to see you,” Lydia replies, making Stiles deflate a little, because, really, Allison’s much sweeter and less devious than her girlfriend and he has a hard time actually believing that she’d intentionally spy on him. Also, getting lunch with Kira would explain why she, as a French Professor, would be in the English building.\n“You’re the one who insisted that I check out his class,” Stiles grumbles, plopping himself down in the chair across the desk from her, not bothering to try and deny it anymore. He should know by now that when it comes to Lydia Martin, resistance is futile.\n“Have you at least had sex yet?” she asks, making Stiles gape at her, his cheeks turning pink.\n“Lydia!” he squawks, sounding more than a little scandalized. “No!”\n“Please, he’s totally your type,” Lydia scoffs, unimpressed with his answer. “You should make a move already.”\n“Look, he just – like, there’s no way he’s in my league, okay?” Stiles sighs, sinking further into the plush chair. “I’ve already tried flirting and he doesn’t really reciprocate.”\nHe tries not to feel too disappointed as he admits to it. Really, it’s been nearly a month now, and although he can certainly make Derek blush, Derek’s always quick to shut down his flirting. The blushing probably just means that Derek’s embarrassed on his behalf. Honestly, Stiles should just stop trying if his flirting is so bad it’s giving Derek secondhand embarrassment.\nLydia studies him carefully, lips pressed in a thin line, clearly contemplating something.\n“Stiles, what you need is a confidence boost,” she announces, leaning forward and resting her elbows on her desk. “Therefore, you’re coming with Allison and me to the Jungle tonight.”\n“But I have plans already!” Stiles protests, although really he was just going to marathon The Walking Dead with Scott.\n“I’m sure that Kira will be able to find some other way to occupy Scott while we take you out,” Lydia replies, seeing through him easily.\n“I don’t want to have sex with anyone but Derek right now,” Stiles whines, trying another excuse, no matter how pathetic it makes him sound.\n“I’m not saying that you need to have sex with anyone,” Lydia says, giving him her ‘I thought you were smarter than this’ look. “What you’re going to do tonight is dance, get hot guys to buy you drinks, and maybe even do a little bit of making out, so that you’ll stop your self-deprecating ‘he’s so out of my league’ bullshit. Then, you’re going to continue flirting with Hale and maybe even ask him out.”\nStiles narrows his eyes at her and considers protesting, because, honestly, the only people who ever hit on him are undergrads (and sometimes grad students) who don’t realize that he’s a professor. Really, when he’d finally ventured onto the “Rate My Professors” website that that student who’d been hitting on him had mentioned, he’d been torn between being creeped out and mildly flattered that he’d warranted such a high “hotness” rating. In the end, he’d settled on being creeped out. Because apparently the audience he appeals to is seventeen to twenty-two year olds with a teacher/student kink. At this rate he’ll never go on another date.\nChrist, all of his friends are married, engaged, or in a long term relationship, and he’s still desperately single. He might as well go out and start buying cats now.\n“Are you gonna insist on picking out what I wear?” Stiles finally asks, deciding to go for the route of minimal conflict.\n“Yes,” she says simply, as if her answer should have been obvious. Which, really, it should have been.\n“Fine,” he sighs.\nLydia smirks.\n---\nOkay, so Stiles actually kind of likes going to the Jungle most of the time. By now he’s already had a couple of drinks (neither of them bought by him – hell yeah!) and is starting to loosen up a bit. Of course, the attractive guy grinding up against him is helping with that, too. \nOccasionally he catches a glimpse of bright red hair and dark brown curls from where Lydia and Allison are also dancing, bodies moving together in a way that would be downright distracting if Stiles wasn’t more interested individuals of the male persuasion tonight. (He and Lydia have a deal, okay? He gets to objectify her a little bit when they’re out clubbing as long as she gets to objectify him in return.)\nStiles tips his head back against his dance partner’s chest and lets out a little moan as the guy thrusts his hips forward. In fact, he has half a mind to just forget about Derek right now and let this guy take him home (or hell, even just to the bathroom) when his eyes land on a familiar figure sitting in one of the booths to the side of the dance floor.\nWell. Stiles isn’t entirely sure if this is a horrible coincidence or a god given opportunity.\nHe decides that it’s an opportunity.\n“Hey,” he says, twisting his head to look over at the guy behind him. “I think I’m gonna take a break now.”\n“Sure,” the guy replies, a mildly disappointed but understanding look on his face. “Any chance I might see you again later?”\n“Probably not,” Stiles answers, an apologetic smile on his face. “Sorry.”\n“Nah, it’s cool,” the guy says, carefully removing his hands from Stiles’ hips and taking a step back. “Go have fun with tall, dark, and broody.”\n“Thanks,” Stiles replies, leaning over to press a light kiss to the guy’s cheek before making his way through the crowd towards Derek.\nFor once, he feels comfortable in his own skin. A lot of that probably has to do with the buzz of alcohol flowing through his system, but, as much as he’s loath to admit it, it also has to do with the fact that Lydia always knows just how to dress him up. Of course, the pants she’s forced him into tonight would be way too impractical if he’d actually come out looking for sex (they take forever to get on and off), but they do wonders for his ass. In fact, he’d be tempted to do a little twirl in front of Derek if it wouldn’t come off as awkward and like he’s trying too hard.\n“Fancy seeing you here,” Stiles says as he slides into the booth across from Derek, making him startle and stare.\n“Stiles,” Derek replies, looking a little gobsmacked. “What are you doing here?”\n“What does anyone do at a club?” Stiles asks, an amused smirk on his face as Derek seems to flounder a little.\n“You shouldn’t – we shouldn’t be talking,” Derek says, his voice strangely strangled, his eyes fixed at some point behind Stiles, like he’s afraid to look anywhere else. Huh. Stiles had certainly never expected Derek to be shy.\n“Is that your way of asking me to dance?” Stiles asks, licking his lips, not missing the way Derek’s eyes are drawn to the movement for a split-second.\n“I can’t,” Derek replies, his tone a little pained, hands curled into tight fists. “I – no dancing.”\n“Then let me buy you a drink,” Stiles insists, leaning over the table a little in order to get closer to Derek.\n“I’m the designated driver,” Derek says quickly, much to Stiles’ disappointment.\n“I’ll buy you a coke, then. Something nonalcoholic,” Stiles replies, anxiety twisting in his gut at each rejection.\n“This is unprofessional,” Derek murmurs after a moment, his voice almost too soft for Stiles to hear over the pounding bass of the music vibrating through the club.\n“Please, like you’re the first person to do it,” Stiles says, rolling his eyes, making Derek look at him sharply, a shocked expression on his face. “I mean, look at Allison and Lydia. Danny from Comp Sci and I had a thing for a while, too.”\nAt that, Derek seems to look even more scandalized. Seriously? Stiles honestly hadn’t pegged him as someone who’d be that uptight about interdepartmental relationships.\n“Stiles,” Derek replies slowly, like he’s talking to an easily spooked animal. “I don’t know what this ‘Danny’ told you, but – ”\n“Derbear!” a voice yells, startling Stiles as a gorgeous woman suddenly slides into the booth next to Derek. “Who’s your friend here?”\n“Laura,” Derek growls, his tone chock full of warning that the woman – Laura, apparently – completely ignores.\n“Don’t worry about me. I’m just his sister,” she continues, the tension in Stiles’ shoulders immediately bleeding away at her words. Not that he seriously thought that they were together. The Jungle is a gay club, after all.\n“Stiles,” Stiles replies, putting on his most charming smile.\n“The Stiles?” Laura asks, throwing Stiles a little off guard. Her eyes hold a dangerously familiar spark, the sort of which Stiles is used to seeing in Lydia’s eyes. “I’ve been dying to meet you.” \n“You have?” Stiles asks, extremely confused now.\n“Of course,” Laura replies simply, a smirk curling her bright red lips. “You’re Der’s favorite, after all.”\n“Laura!” Derek snaps, louder now.\n“Aw, come on. He’s not even – ” Laura starts, but Derek cuts her off.\n“We’re leaving,” he announces, grabbing onto her upper arm and practically dragging her out of the booth.\n“Nice meeting you, Stiles!” Laura calls over her shoulder, giggling a little, probably drunk.\nDerek doesn’t say anything, though, leaving Stiles in his wake, dumfounded. He has half a mind to run after them – to demand an explanation – but they’ve disappeared by the time he comes back to his senses. What the fuck was that about?\nHe sighs, rubbing a hand through his slightly sweat-damp hair as he realizes that he’s struck out yet again. Maybe this is just the universe’s way of telling him to back off. Hell, maybe this is Derek’s way of telling him to back off. He stares down at the table morosely and wonders if it’s socially acceptable for him to drink the half-glass of water Derek left behind.\nHe downs it in three gulps before heading back out onto the dance floor and losing himself in the mass of writhing bodies.\nNo one comes home with him, but he can’t say he’s disappointed.\n---\nStiles still attends Derek’s classes, but he doesn’t talk as much. As he’d predicted, some of the other English 346 students have become bolder, offering up interpretations and even challenging some of Derek’s assertions. Of course, there are still plenty who just sit there and drool over Derek, eyes wandering shamelessly. Stiles wants to say he’s not one of them, but he kind of is.\nWhen he actually talks to Derek, though, is during his office hours. He spares as much time as he can for Derek then, although he sometimes can’t get around his other duties, particularly his research.\n“What are you working on, anyway?” Derek asks one day after Stiles stumbles into his office, flushed from his sprint across campus in order to make the last fifteen minutes of Derek’s office hours.\n“Genomic imprinting,” Stiles answers casually, sprawling himself out in the chair across from Derek, legs splayed purposefully wide. “It’s basically when one copy of a certain gene is turned off during fetal development. You know, because you get two copies of each gene – one from each parent – and you don’t necessarily need both.”\n“Sounds complicated,” Derek replies, and Stiles can’t help but flush a little bit at the implied compliment in his tone.\nHonestly, he’d been more than a bit worried about seeing Derek again after their encounter at the Jungle a little over a week ago. And, well, it had been awkward for a while. Somehow, though, they’ve managed to get back to something close to what they had before. Stiles suspects most of that has to do with his single-minded stubbornness. He grows on people like a mold, or so he’s been told.\n“It is complicated,” Stiles says after a moment, smiling over at Derek. “But I’m sure you could understand it if you put your mind to it.”\n“Sure,” Derek snorts, clearly not believing him. Trust Derek to be contradictory even when it comes to compliments.\n“Seriously, if you can understand Mrs Dalloway I’m pretty sure you can understand anything,” Stiles replies, pursing his lips. “I mean, what even was that? The POV shifts and shit?”\n“It’s not that difficult to interpret once you understand Woolf’s writing style,” Derek says, shrugging casually. “You just need to do more reading.” \n“Hey, I read!” Stiles protests, pouting at Derek, but he’s not seriously offended. Derek’s at least a little correct, after all. Since his last official English class in sophomore year, his reading material has consisted mostly of academic journals, blog posts, and students’ essays.\n“Really? What was the last thing you read, then?” Derek asks, quirking an eyebrow at him.\n“Uh,” Stiles says, chewing on his lower lip as he wracks his brain for the answer. “The last issue of – ”\n“Magazines don’t count,” Derek snorts, making Stiles scowl, because really? The New England Journal of Medicine is not a fucking magazine, thank you very much.\n“Fine,” Stiles replies, sighing overdramatically. “I suppose then it would have to be – ” Realization dawns on him and he smirks. “ – Bisexuality and the Dangers of Historical Erasure by Derek Hale.”\nDerek stares at him, eyes wide.\n“You read that?” he asks after a moment, his voice a little strangled, although nowhere near as much as it was that night in the club.\n“Of course I did,” Stiles scoffs, but he’s still smirking. “I had to do my research on you.”\n“You mean you internet stalked me,” Derek says, narrowing his eyes at Stiles, but the tips of his ears are a little bit red.\n“Oh, c’mon, Derek. You make me sound like a creeper when you phrase it like that,” Stiles protests, but his tone is teasing.\n“You are a creeper,” Derek snorts, crossing his arms over his chest. “And don’t call me that.”\n“It’s not like I’m actually your student, Professor Hale,” Stiles says, although the ‘Professor Hale’ bit comes out more like a purr than anything else, making Derek’s cheeks turn a little bit red. “C’mon Professor, don’t you think – ”\n“Um,” a voice says from the doorway, interrupting them, nearly startling Stiles enough to make him flail and fall out of his chair. “Am I interrupting something?”\n“Kira! Kira, old buddy, old pal, what are you doing here?” Stiles asks through clenched teeth, trying to recompose himself while simultaneously trying to get Kira to go away, because, goddamn it, he’s so close to getting Derek to crack! He can practically taste the office make-outs in his future.\nShe gives him an unimpressed look and strides on into the office, setting down a large stack of papers on Derek’s desk.\n“Two of the GSIs for English 120 got into a bar fight and are in the hospital,” she explains, turning to Derek. “Do you think you could spare some time to help me grade these papers?”\n“I’ll see what I can do,” Derek sighs, already picking up the first essay and scanning it, grimacing slightly.\n“Shit, I’m so glad I’m not an English professor,” Stiles says, wincing in sympathy. “I think I’d die if I had to read that many essays written by freshmen.”\n“You had to write a freshman essay once,” Kira points out, making Stiles grin at the memory.\n“Yeah, on the history of the male circumcision,” Stiles replies, pleased as he notes how Derek’s ears starting to turn a little red again. “I should get that thing framed someday day.”\nKira’s unable to keep herself from smiling just a little bit at that declaration.\n“You know, Professor Finstock is still bitter about that,” Kira says, amusement clear in her voice. “He uses it as an example of off topic writing.”\n“Please, that essay was a work of art and he knows it,” Stiles scoffs, because it was, okay?\n“I’ll let you convince him of that yourself,” Kira replies, openly grinning now. “Oh, and before I forget, Scott wants you to come over for dinner tomorrow because you missed Friday.”\n“Will do,” Stiles says with a lazy salute, Kira nodding at him before turning back to Derek.\n“Thanks again, Derek,” Kira says, sending Derek a bright smile.\n“Yeah, sure,” Derek replies, waving off her thanks.\nWith that, she leaves. It’s relatively quiet for a moment as Derek pulls his newly acquired stack of essays towards him and Stiles tries to figure out what to say, trying to remember where they’d left off before they’d been interrupted by Kira.\n“Are you on a first name basis with every professor at the university?” Derek asks before Stiles can say anything, though.\n“Not all of them,” Stiles answers, shrugging, a little confused about why Derek’s bringing this up. Is it really that strange that he knows professors from other departments? “Why?”\n“Stiles – ” Derek replies, the strangely concerned expression on his face throwing Stiles for a loop. “Forget it.”\n“Oh, c’mon, what is it?” Stiles presses, straightening out his posture and leaning over so that his forearms are resting on Derek’s desk. “Seriously, you can’t just leave me hanging, dude.”\n“You shouldn’t let people take advantage of you,” Derek says after a moment, confusing Stiles even more.\n“Sure, okay,” Stiles replies, giving him an odd look. “I’m, like, the least likely person to get taken advantage of, but thanks for looking out for my virtue, I guess.”\n“You think I’m a much better person than I am,” he answers, glaring down at his papers and refusing to meet Stiles’ eyes.\n“Nah, I know you’re an asshole, but at the same time you’re – I just – ” Stiles says, the words getting caught in his throat. He pauses for a moment. “Let me take you out to dinner.”\nDerek looks up sharply, clearly surprised.\n“Stiles – ” he replies, his voice strangled, a pained look on his face.\n“No, hear me out, okay?” Stiles interrupts, leaning in even closer. “I really like you. You’re smart and sarcastic and aren’t afraid to give as good as you get. And, you know, the fact that you’re hot as fuck is a plus. I’ve been trying to drop hints for months, and – ”\n“Stiles,” Derek repeats, his tone sharper this time, but Stiles is having none of it.\n“I know you’re attracted to me! Don’t try to deny it!” Stiles exclaims, staring at Derek intently, trying to maintain eye contact. “I’ve seen the way you look at me. So, please, go out to dinner with me?”\nDerek is silent for a long moment, so many different expression warring on his face that Stiles can’t even begin to interpret what he’s feeling.\nThen, he says, “No.”\n---\nStiles isn’t exactly proud to admit that he spends nearly the entirety of the subsequent week in the lab. He’s moping, okay? Which is a completely valid reaction, because he’s just gotten his heart torn into a million tiny pieces. He knows that he can be kind of dense sometimes, but he really thought he’d been reading the signs right this time. But apparently not.\nHe even stops by the cat shelter on Friday. He can’t quite bring himself to take one home, though. But really, he should just stop living in denial already.\nHe’s going to die alone with at least three cats. It’s inevitable.\n“Talk,” Lydia commands, practically throwing him down into a chair after dragging him into her office. She’s surprisingly strong for such a petite woman.\n“About what? Climate change? Intersectional feminism?” he shoots back, crossing his arms firmly over his chest as scowling at her stubbornly.\n“It’s Wednesday and you’ve been moping around since last Tuesday,” she says, clearly unamused with his attitude. “I’m done ignoring it. So spill.”\n“You know, I much prefer the philosophy of ignoring a problem until it just goes away,” Stiles retorts, his tone biting.\n“Well clearly it’s not going away,” Lydia replies, glaring at him, exasperated. “When was the last time you showered? In fact, when was the last time you even bothered brushing your hair?”\nStiles rolls his eyes at her, but doesn’t reply verbally.\n“You’re staying here until I get an answer, Stilinski,” Lydia threatens when it becomes clear that he has no intentions of saying anything. “I’ll sabotage your data, too.”\n“You wouldn’t,” Stiles says, narrowing his eyes at her, not entirely sure of that assertion.\nLydia smirks evilly.\n“Fine,” Stiles sighs, the fight finally draining out of him. “I asked Derek out and he said no, okay? End of story.”\n“He said no?” Lydia repeats, sounding genuinely surprised for once. “He explicitly said no?”\n“Yeah, he explicitly said no,” Stiles answers, running a hand through his already extremely messy hair. Lydia’s right – it has been a while since he combed it with anything other than his fingers. “Very clearly. To my face.”\n“I’m sorry, Stiles,” Lydia says after a moment, an uncommon look of pity on her face.\n“Yeah, well, I’d kind of like to just get back to drowning myself in my work to keep from drowning myself in the bottom of a bottle, so…” Stiles replies, flailing a hand vaguely in the direction of the office door.\n“Did he give you a reason why?” Lydia presses, apparently not content with his answer.\n“No. No, he didn’t,” Stiles snaps, jaw clenched tight. “That’s all I know, okay? He literally just said ‘no.’ That’s it.”\nLydia examines his expression for a long, long moment before pursing her lips and nodding. Stiles can’t get out of the room fast enough.\n---\nIt’s Friday before Stiles really leaves the lab for anything other than food or sleep, and that’s only because Boyd’s out with flu and someone needs to fill in for his Bio 130 lecture. Stiles, naturally, gets to be that lucky person. He’s half convinced that Lydia did it on purpose. Hell, maybe she even gave Boyd the flu. Who knows?\nSo to say that he’s less than happy to be giving a lecture to underclassmen at nine in the morning on a Friday is beyond an understatement. He still plasters a smile on his face and forces an upbeat attitude, though.\nReally, it’s not that difficult. It’s Bio 130, after all – he could probably teach this in his sleep. However, half an hour into the class, he falters.\nBecause loitering in the back of the lecture hall is Derek Hale, who’s staring at Stiles like he’s never seen him before.\nFuck, he’s going to kill Lydia.\n“As I was saying,” Stiles manages to continue, tearing his eyes away from Derek and clearing his throat awkwardly, “plasmids are extra-chromosomal genetic elements which carry non-essential genes.”\nSomehow he manages to get through the second half of the lecture. He really has no fucking clue how he does it, but somehow he does. It’s so hard not to let his eyes stray back to Derek at every opportunity, though – not when he standing right there.\nWhy’s Derek even here, though? Seriously, what’s the point? Fuck, hopefully he’s not just here to humiliate Stiles further, because – because –\nGod. Derek Hale needs to stop messing with his head.\nWhen the class is finally over, all Stiles wants to do is bolt out of the room and get as far away from Derek as possible. Of course, there’s no way that’s going to happen, partially because he needs to stick around to answer questions for a few students, but mainly because he’s at the point furthest away from the exits and there are about two hundred undergrads all trying to escape at once.\nFuck his life.\n“Professor Stilinski,” a student says, drawing Stiles back to the subject at hand, distracting him from Derek at least momentarily. “Um, so, should I just turn in my exam re-grade request to you or should I wait until Professor Boyd is back?”\n“I’ll take it,” Stiles replies, accepting the papers, quickly scanning the cover sheet before nodding, deeming it acceptable. “It might be a week or so before Professor Boyd gets back, in which case you’d be past the deadline.”\n“Thanks,” the student answers, adjusting their grip on their backpack a little awkwardly. “I’ll, uh, see you on Monday, then, Professor Stilinski.”\n“Yeah. See ya,” Stiles says absently, chewing on his bottom lip and pushing his glasses back up his nose as he flips through the exam.\n“So,” an all too familiar voice says, making Stiles jump and jerk his head up. “I think I owe you an apology, Professor Stilinski.”\n“Um,” Stiles replies, swallowing thickly and trying not to stare too obviously even though he’s been deprived of Derek for over a week. “Okay. Shoot.”\n“I, uh, never gave you a reason for why I rejected you,” Derek starts, looking strangely awkward and anxious for once. “I – ”\n“Dude, no,” Stiles interrupts, shaking his head. “You don’t have to explain. No means no, and I respect that. I don’t respect you any less because of it, but I will if you give me shitty excuses, so – ”\n“I thought you were a student!” Derek blurts out.\nWait. What?\n“You thought I was a student?” Stiles repeats, incredulous, his mouth hanging open in surprise.\n“Yes,” Derek replies gruffly, jaw clenched, breaking eye contact in order to stare at the lecture hall floor.\n“You thought I was a student,” Stiles says again, the declaration still sinking in. “You thought I was a student.”\n“Well if you’re just going to rub it in…” Derek grumbles, cheeks flushing bright pink. “Look, forget it. I get that I lost my chance.”\n“Hey, I didn’t say that!” Stiles exclaims, grabbing onto Derek’s wrist as he tries to turn away. “I just – I’m still processing it, okay? I mean, seriously, how did you not realize that I was a professor?”\n“You were in my class. What did you expect?” Derek retorts, although he sounds more embarrassed than defensive. “And you’re kind of – ” Derek grimaces. “ – young looking.”\n“Yes, I am aware that I’m a twink,” Stiles says, rolling his eyes, but he’s really kind of amused at the whole thing. Seriously, this would be hilarious if this stupid misunderstanding hadn’t been keeping Derek from fucking the living daylights out of him for the past few months. “You’re not even the first person this month to mistake me for an undergrad. I swear I’m twenty-nine, though. I can show you my license and everything.”\nDerek looks more than a little relieved at that.\n“Wait, is this why you were so weird about me being friends with Kira?” Stiles asks, eyes widening as realization dawns on him. “Holy shit, you really were trying to protect my virtue!”\n“If I agree to take you out to dinner tonight will you shut up about it?” Derek replies, still blushing bright, bright red.\n“Never,” Stiles answers, grinning at him cheekily. “I’ll telling this story to our grandchildren.”\n“I think you’re getting a little ahead of yourself there,” Derek grumbles, but it’s a pretty weak protest by his standards.\n“Please, I spent months attempting to woo you. I read Hemingway for you. Do you really think I’m going to let you go now?” Stiles asks, taking Derek’s hand in his and twining their fingers together.\n“Reading Hemingway is a pretty noble sacrifice,” Derek replies, lips twitching up into the barest hint of a smile.\n“Ha! I knew you secretly hated – ” Stiles starts.\nDerek cuts him off with a kiss."
}