{
    "id": "24521074",
    "url": "https://archiveofourown.org/works/24521074?view_full_work=true",
    "author": [
        "Scarlet_Nin"
    ],
    "title": "A Shot Of Espresso",
    "rating": "Not Rated",
    "archive_warnings": [
        "Major Character Death"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "The Umbrella Academy (TV)"
    ],
    "relationships": [
        "Number Five | The Boy & Klaus Hargreeves",
        "Ben Hargreeves & Klaus Hargreeves",
        "Klaus Hargreeves & The Hargreeves"
    ],
    "characters": [
        "Number Five | The Boy (Umbrella Academy)",
        "Ben Hargreeves",
        "Klaus Hargreeves",
        "Reginald Hargreeves",
        "Hargreeves Children (Umbrella Academy)"
    ],
    "additional_tags": [
        "Temporary Character Death",
        "Robbery",
        "Protective Number Five | The Boy",
        "Protective Ben Hargreeves",
        "Hurt Klaus Hargreeves",
        "Klaus Hargreeves Needs A Hug",
        "Going out for a coffee",
        "Adressing the issues of Klaus being unable to die like a normal person",
        "Angst and Hurt/Comfort",
        "Five cares but is shit at showing it",
        "Reginald Hargreeves' A+ Parenting"
    ],
    "language": "English",
    "series": "",
    "published": "2020-06-03",
    "completed": null,
    "words": "10,294",
    "chapters": "1/1",
    "comments": "161",
    "kudos": "6,595",
    "bookmarks": "1,472",
    "hits": "52,268",
    "summary": "<p>It seemed like a good idea. Taking Five out for coffee after both of them found themselves wide awake in the middle of the night. Some brotherly quality time to pass the hours until breakfast. It was just their luck that the café they sat in got robbed.</p>\n<p>Or, </p>\n<p>Klaus gets shot during a robbery and Five finds out his brother cannot die. It's a mess. An emergency family meeting is called and it all goes downhill from there until it gets better.</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a>.)</p>\n<p>The Hargreeves children: Bro, you died.</p>\n<p>Klaus, confused: Yeah, but it didn't stick!</p>\n<p>His siblings, realising they fucked up: ThAt'S NoT tHe PoInT!</p>\n<p>Ben, hugging Klaus protectively from behind, glaring: No shit Sherlock. Better clean up your mess before I'll go all poltergeist on your asses.</p>",
    "text": "“Here you go, old man.”\nKlaus puts the coffee on the table, watching Five snatch it and cradle it with both hands close to his chest. The cup is steaming hot, literally steaming from the heat, but Five either doesn’t care or doesn’t notice. Pulling out his own chair from the small round table Klaus plops down on his seat, one arm thrown of the back of his chair while he crosses one leg over the other.\n“I made sure to order it as black and bitter as your soul, so there’s probably enough caffeine in there to keep you awake for the rest of your teenage years.”\nFive ignores him in favor of taking a sip of the coffee. His throat makes a noise of pleasure at the taste and Klaus takes a drag of his blended strawberry lemonade to hide his grin at the sight of his grouch of a brother looking like a little kid for once.\n“Wipe that look of your face,” Five says, putting his cup back down.\nKlaus blinks innocently and mirrors the action. “What look?”\nFive looks unimpressed, raising an eyebrow. “Taking credit for something you didn’t do, typical of you.” He snorts.\n“Hey,” Klaus whines, resting his chin on his palm, elbow on the table.  “Don’t be a dick. A bit of gratitude wouldn’t hurt. I came out here in the middle of the night with you out of the kindness in my heart and you’re being a cranky little shit.”\n“You offered.” Five reminds him but his voice lacks the previous bite. “I didn’t ask you to.”\nTrue, Klaus did come up with the idea of going out, telling Five to get dressed when he found him sulking on the couch, grumbling to thin air about the lack of coffee in the house. An old habit from Dolores he still hadn’t managed to break out of. But hey, Klaus does the talking to “thin air” all the time, so he can’t judge. The more the merrier.\nThere was nothing to do anyway with the others asleep. Out of his siblings, Klaus found himself awake more often than not at the oddest hours with his shitty sleeping schedule. Sobriety had the downside of turning the volume of the ghosts up to a new level of loudness much like the shitty soap operas Allison liked to watch on the TV when they were kids. Without a remote to turn them down and the nightmares haunting him, sleep was a rarity, another drug he couldn’t get enough of. Literally.\nFive didn’t look like he would go back to sleep either. Taking him out for a coffee at the nearest Starbucks to get him into a better mood seemed like a nice idea. As long as Klaus didn’t have to pay, he wouldn’t mind ordering a coffee for him. Most employees shied away from giving in to the crazy eyes and the unhinged smile Five tried to pull to get his way. To stop his brother from snapping in a fit of violent temper Klaus would rather endure the dirty stares from the woman at the counter and the middle-aged man nursing his own drink and a book a few tables to their right for giving a kid caffeine.\nThere were worse things than coffee for a growing kid and Klaus has done most of them. A coffee was laughable in comparison. Allison would give him the stare of disapproval most Mothers have but what she didn’t know wouldn’t get him banned from her closet.\nKlaus wiggles his finger like a parent chiding their child.\n“Thank you, Klaus.” He pitches his voice higher. “You’re such a good brother! I’m sorry my ungrateful ass can’t appreciate you, please forgive me my rudeness.”\n“Fuck off.” Five deadpans, kicking him under the table. Klaus yelps, ignoring the looks from the three other people inside the café with the ease of years of practice. Lips quirking up, Five gives the onlookers a tight smile.\n“Christ, we’re getting you some anger management classes.”\nKlaus groans, shaking his head before taking another drag from his straw. The sweetness coating his throat soothes the burst of irritation at the new bruise on his knee.\n“All that rage in such a tiny body, it can’t be healthy. You need a better outlet than poor me. Maybe a pottery course or something. I’ll show you how to knit if I have to, it’s very relaxing.”\n“I’ll stab you with the knitting needles.” Five says pleasantly, taking a gulp of his coffee.\nKlaus throws out a hand. “See?” He slouches back into his seat, hooking his legs around the legs of his chair so Five can’t reach them with his foot. “You’re just proving my point, y’know.”\n“Don’t be ridiculous.” Five huffs, rolling his eyes. “I’m fully capable of controlling my temper.”\n“Right,” Klaus chokes on a mouthful of lemonade. He pats himself on the chest a few times. Five wrinkles his nose as he wipes at the corner of his mouth to stare him down.\n“Says the guy who threw a glass at Luther’s head for asking if he needs help getting something from the top shelf in the kitchen.”\n“That was deserved.” Five grumbles, fingers tightening around the handle of his cup.\n“You hide Allison’s notebook for three hours after she took away your margarita.” Klaus points out watching Five’s jaw strain under the force of gritting his teeth.\n“I’m not a child.” Five spits out, bitter like his coffee. “She keeps forgetting that. A reminder couldn’t hurt.”\nKlaus holds up his hands in a placating manner, his tattoos on display for Five to read.\n“Geez, pretty touchy today, aren’t we? Cool it, buddy, I was just trying to prove my point. But y’know the others take everything they see or cannot see at face value. Nearly broke poor Ben’s heart.”\nFive’s lips purse in thought, eyes straying around the room. “Is Ben here?”\n“Afraid not.”\nKlaus pauses, clasping his hands together with a giggle. Five didn’t seem disappointed at the lack of their ghost brother but it still felt a bit weird to be without Ben if he was honest. He’s sure some distance once in a while would do them some good, but Ben never left his side for too long. An hour, maybe one and a half then he would be back, popping out of nowhere and nagging at him for not wearing clothes appropriate for the weather.\n“I left him behind to watch some telly. Since it’s you I was going out with, he didn’t seem too worried about me getting in trouble and stayed behind to watch some movie he’d been pestering me about all week long. I can summon him if you want, but he might just knock your cup of coffee out of your hands like some poltergeist, because he’s petty like that.”\nAnd still a little angry over the fact nobody believed he’d been there, watching over him all this time, but he’s here to get Five to relax, not to guilt trip him.\n“It’s fine,” Five dismisses him. “You’re good for now.”\n“Thanks.” Klaus preens, grinning. “That’s gotta be the nicest thing you’ve said to me.”\n“Don’t get used to it.”\nKlaus gasps, laying a hand over his heart to be dramatic. “I would never.”\n“Uh huh.” Five sighs, but his shoulders relax, a faint smile tugging at his lips and Klaus grins.\nGod was it hard to be mad at the grumpy face glaring half-heartedly at him despite the jabs and the trouble he’d brought with him at his return. Almost made it seem worth it to get tortured by two freaks in masks on his behalf, just to see him smile like they were kids again. Trying his hardest to appear stern but failing and hiding his faint smile behind a cup of coffee.\nBlame his reactions on Five’s kid appearance but seeing him smile never failed to bring a matching grin onto Klaus’s lips. Sharp tongue or not, it was in moments like these that Klaus couldn’t doubt Five cared for them.\nHe hadn’t been sure at the beginning with the indifference to everything that wasn’t the apocalypse or related to it, the coldness and distance—the lack of care in regards to his disappearance and time-travel or Vanya’s whereabouts—but Five never worked well under stress. It shut off everything in his mind except for the need to survive and left no room for anything else.\nWith the apocalypse avoided there was no need to cut his losses, to shove the walls of cold rationally back up and hide himself away with the burden of the world resting on his shoulder.\nFive was still an asshole more often than not, cocky to the point of mean, but without the additional stress, his attitude got bearable.\nEmptying his lemonade, he noisily slurped on his straw until Five throws him a scowl and drowns the rest of his coffee like Klaus does his shots.\n“Get me another one.”\nKlaus tilts his head. “Weird. I didn’t hear a please in your order, Fivey.” He cups his ear and leans forward.\n“Not as weird as you still sitting here.” Five’s lips pull back into a tooth baring smile. “I hate repeating myself.”\n“Don’t I know it?”\nKlaus rises to his feet, smoothing down his jacket with flourish.\n“Mister “I’ll teleport you to the roof because you didn’t get the math equation right the second time around” hates an awful lot. The list of things you hate is longer than Santa’s gift list. I cannot believe Benny thought you’d make a good babysitter! The idea of leaving you alone with a child is giving me anxiety. Just look at what you did to innocent Kenny, rejecting him so harshly! I bet he’s talking about you in therapy.”\n“At least he gets the chance to go to therapy.”\nFive crosses his arms and scowls when a woman comes into the café and hurries to the counter to order. \n“Other people didn’t get that chance after meeting me.”\nRight. Because they died. Horribly. Klaus can see them actually. Cowering in the corner of the room, glaring daggers at Five and dripping blood over the floor but otherwise silent and unmoving. Figures ghosts would be scared of his little psycho brother even in death.\n“No talking about murder during meal times.” Klaus says putting his hands on his hips and tries to look stern. “You know the rules, old man. My appetite is delicate, so don’t ruin it.”\nFive is unimpressed. “You aren’t eating anything.” He says flatly.\n“Touché, mein Bruder. But drinking smoothies counts as a meal for me like coffee does for you. Equality for everyone and all that shit. Don’t make me get Ben to yell at you.”\n“Just get me my damned coffee already.”\nFive pinches the bridge of his nose and waves a hand to shoo him away.\nKlaus salutes. “So bossy! I’m not sure I dig that, but whatever floats your boat, brother dearest.” He winks, giggling at Five’s expression of disgust and skips towards the counter where the woman waits.\nShe gives him a look, the one of judgment over letting a kid, most likely his son in her eyes, hang out in a Starbucks at night that screams “Shame on your parenting skills”.\nJokes on her, though, because if age counts, he’s the little kid in this situation. There are worse things one could do to a child than expand their bed time. He’s got a list in his head filed away under the name “Dad” to prove it but he’s not in the mood to start a fight with some woman over trivial matters he couldn’t give a fuck about. Let her think he’s a shit father, his nonexistent child could cry over it or maybe write a book about his shitty parenting. Vanya would have a field-day giving out tips.\nLost in thought, he doesn’t hear the men storming into the café until the barista gasps and freezes with wide, fearful eyes.\n“Nobody moves!” One of them barks as he whirls around. “Or we’ll shot you!”\nOh shit.\nA fucking robbery at what, half past midnight? Really?\nKlaus grimaces at the three guys, each holding a gun, standing back to back with each other as they step forward, wearing cliché masks to hide their face like in the movies. They’re tall, as tall as him but double the size in muscles.\nThe woman behind him steadies herself on the counter.\n“Nobody has to get hurt.”\nThe tallest one says with a glower, gun aimed at the barista as Klaus and the woman inch to the side to get out of the crossfire line.\n“All we want is the money in the cash registers. You, woman, move your ass and put it in the bag and we’ll be going on our merrier way.”\nThe guy to his right throws the bag over the counter before he returns to his post of pointing a gun at Five.\nFive, who looks pissed.\nProbably because he can’t do anything rash with one of the gun’s switching between aiming at the barista and the woman who stands next to Klaus, crying silently and the other one pointing at the man sitting at his table, halfway through his book.\nTeleporting might give him an advantage for a moment, but they’d shot and even if the Academy is nothing but a painful reminder, they still have the instinct to protect innocent people from harm whenever they could.\nIf Five teleports, one of their targets would be gone but four would remain. He could knock off the aim of one but the other would fire and blood would spill. Even if Klaus were to shove the woman next to him over the counter and the other would duck, that’d leave him at a distance the shot couldn’t miss.\n“Faster!” One of them barks as the barista starts to whimper.\n“I’m sorry—” She cries, trembling and trying to get the cash register to open. “—it’s…it’s stuck!”\n“I’ll give you a minute.” The guy threatens. “One minute to get the job done before I shot you in your ugly face.”\n“I’m sorry! Please, I’m trying!” She shakes the cash register. Her mascara is running down her cheeks like her tears as she sobs.\n“Chill out, man.”\nKlaus blurts out, feeling Five’s eyes boring into the side of his head in warning to keep his mouth as the man turns to him. What can he say? He’s always been the lookout or the distraction, it’s what he’s best at after all.\nTime to buy her some time.\n“No need to be an asshole. She’s trying her best to help you rob her, screaming at her won’t get you what you want, so take a chill pill and let her do what you want her to do in peace. Look at the poor girl, she’s frightened like a rabbit. You don’t want her to die from fright, do you? That’s just—”\n“Shut up!”\nThe man shouts, pointing his gun at Klaus and the woman next to him shrinks back from him like he caught himself on fire.\n“I swear if you don’t shut your mouth, I’m gonna shut it for you.”\n“Oh, kinky.”\nHe laughs, the sound hysterical because it reminds him a bit too much of his time with Cha Cha and Hazel for his liking.\nThe man seems speechless for a moment, the guy on the right snorts and he hears Five hiss something underneath his breath before the man to the left takes a step closer with his gun to silence him.\nThe cash register slams open and the barista sighs in relief, wasting no time to put the money in the bag as fast as she can.\n\n“He’ll kill her.”\n\nThe voice of a woman has him blink and if he takes a closer look, he can see a girl hovering behind the group of robbers. She’s pretty aside from the bruise marks on her throat and the bruising of a night sky across her jaw.\n\n“Just like he killed me.”\n\nKlaus meets her dead gaze with his own to show he’s listening. She steps through the man, who shivers unconsciously, eyes growing wide when she notices he can see her and steps closer, her summer dress swaying with her hips.\n\n“She’s an ex-girlfriend. Just like me.”\n\nShe explains, eyes stuck onto the barista with a frown on her blue lips.\n\n“He killed me out of jealously. Choked me in my bedroom after breaking in and after he was done, he threw my corpse into a river. He’ll kill her too. For calling it quits, just like he did to me. As soon as she throws the bag over the counter, he’ll shot her and then, he’ll run like the coward he is.”\n\nHer voice fills with a malice so bitter Klaus feels goose bumps break out on his skin. Bloodshot eyes flashing with anger, her pretty face is twisted into a fierce glare. If she could, Klaus doesn’t doubt she’d kill the guy with her bare hands.\nToo bad he can’t make her corporal for that. Flashing blue light from his palms would draw attention to himself and get him shot faster than he could manifest her.\n“Don’t move, kid.”\nThe guy on the left warns when Five shifts on his feet, face blank.\n“I’m done.” The barista sniffles, whipping at her eyes with her hand and holding up the bag.\n“What…what should I do now?”\nHer voice trembles, lips quivering and she reminds him of Vanya. Long brown hair, tiny with eyes that put Bambi’s to shame. She looks younger, at the age most teenagers get a job to pay for their first apartment and she’s whiter than the paint on the walls. She tries to shrink into herself, eyes puffy and Klaus’s chest twists at the thought of her wandering around as a ghost like the young woman he distantly hears speaking to him.\n“Throw me the bag.” The guy says, gesturing for her to hurry up.\nThe ghost snarls, flipping him off. “Fuck you, you piece of shit—\"\nShe throws the bag and Klaus moves.\nHe doesn’t think, doesn’t hesitate.\nHe shoves the other woman to the ground, steps in front of the barista just as the man pulls the trigger.\nThe gun goes off, pain pierces his chest, and he stumbles backwards.\nThe sound of a scream rings in his ears—\nHis legs slide out underneath him. The back of his head cracks against a hard surface.\n—and everything goes black.\n\n“You again?”\n\n\nThe upside-down face of a girl greets him as soon as his eyes crack open. Her dark skin glows faintly, greyer than the trees, the grass or the flowers around them. The darkest part of her are her eyes, darker and deeper than the blackest ink or the bottom of the ocean. \n\n\nThey don’t seem happy to see him.\n\n\n“Hello to you too, sweetheart.” \n\n\nHe groans, sitting up and tugging at the ends of his vibrant blue crop top. \n\n\n“Glad to see you didn’t brush up the place with new colors. Still a fan of the sixty’s movie setting, huh?”\n\n\nShe scoffs, rocking back on her heels. “You don’t listen very well, do you?”\n\n\n“Nope!” He rises to his feet and stretches. “I always was a rule breaker, just ask dear old Dad. Speaking of him, I’m not gonna have another run in with him this time, right? I’d hate to see him so soon. The wounds are still fresh, y’know?”\n\n\n“I don’t want you here.” She says flatly and the resemblance to Five is uncanny. Same preteen body full of knowledge and power. She even got his savage looks down.\n\n\n“Hey, don’t look at me like that, it’s not like I asked to be shot, it…it just happened. Okay, so maybe, maybe I did move into the line of fire but it was for a good cause, I swear!”\n\n\nShe taps her foot. “Don’t care.”\n\n\nOuch. That stung.\n\n\n“You’re not a very good host, you know that?” He asks, rubbing at the back of his head.\n\n\n“Usually I don’t have to speak to the people that come here.” She huffs. “Also, you’re annoying.”\n\n\n“One of my many talents.” He agrees solemnly and looks around. \n\n\nThere’s no barber shop in the distance, just a long road. There’s a lake in the distance, the water milky white instead of dark grey or black.\n\n\n“Hey, is there any chance I can—”\n\n\n“No.” She cuts him off harshly, glaring up at him. “I don’t like you being here, the shorter, the better. You’re not supposed to be here and yet you show up here as if it’s your friend’s house.”\n\n\nShe looks second away from stomping her foot in frustration, glowering at him.\n\n\nHe blinks. “Gee, sorry for waltzing in unannounced. Should I knock next time, call out “I’m home, honey!”?”\n\n\n“Don’t show up.” She snaps back. “At all. Not before it’s time. Got that?”\n\n\n“Yes, ma’am.” Klaus coos, resisting the urge to pinch her cheeks at the fire sparking in her gaze. No need to antagonize God. He’d hoped for a chance to see Dave, but judging from the nothingness he sees and the bristling fury in front of him, the chances are so low they’re nonexistent. \n\n\nIt sucks but there’s nothing he can do. \n\n\nStill, it hurts and he squeezes his eyes shut at the throb of pain in his chest, breathing in deeply.\n\n\nWho would have thought people could breathe in the afterlife?\n\n\nBen didn’t need to breath and—oh fuck. Ben.\n\n\nHe’s so gonna get his ass kicked back here for disappearing once again. Last time was bad enough. Ben rounded on him, all teary concern and anger born out of fear. He’d promised not to vanish, or die, whatever and he’s broken it. Just like he’s broken nearly everything else he touched.\n\n\nBen didn’t deserve this. And neither did Five.\n\n\nThough, Five might just write off. He was effective like that. As long as Klaus would come back to life, wake up or didn’t die permanently he shouldn’t have a problem with his death. It might come in handy, he wouldn’t have to worry about another Hazel and Cha Cha incident, though he didn’t even worry the first time around. Nobody did.\n\n\nWhen he turns to look at the small girl, she’s gone. He breathes out a sigh and walks towards the lake, hands stuffed into his empty pockets. The grass turns into sand, pebbles scattered around and he crouches down to pick some up.\n\n\nTurning to the lake, he runs his fingers of the smooth stone in his hand before pulling his arm back.\n\n\nHis wrist snaps forward and the pebble skips across the surface trice before the water swallows it. He curses and tries again.\n\n\nDiego could throw them to the end of the lake. They’ve done this enough as kids. He’d rub it into Luther’s face, who would call him a cheater and a fight would break out. Leaving both of them with bruises and spit lips, refusing to speak to each other for the rest of the day.\n\n\nHe watches another stone skip over the lake, four times this time and scowls.\n\n\n“Try bending your wrist a little more.”\n\n\nHis blood runs cold.\n\n\n“Fuck off.” He groans, not turning around to face the owner of the voice, fingers tightening around the stone in his grasp until his knuckles become stark white.\n\n\nThe footsteps come closer. \n\n\n“You need to bend your wrist all the way back to get more power into the snap, otherwise it won’t slide out of your fingers and across the water, Number Four.”\n\n\nKlaus throws the stone and it hits the water with a splash, sinking straight through, causing ripples on the surface. He hears a heavy sigh behind him.\n\n\n“I’m only giving you advice and pointing out what you’re doing wrong. Must you always fight me on everything?”\n\n\n“Oh, I don’t know, Daddy dearest.”\n\n\nKlaus spits out, heat bubbling underneath his icy skin. \n\n\n“Ever considered the possibility that I don’t want your shitty advice? Of course, you haven’t. It’s you after all. But let me remind you, you’re awfully quick to point fingers at us, dear Papa, but how does it feel to know you were in the wrong all along?”\n\n\nReginald stays silent.\n\n\nKlaus swallows down the lump in his throat, feeling his skin flush only to cool, the nausea tying knots in his stomach. His heart is beating fast, the anger unfurling in his lungs like a wildfire.\n\n\nHe’s so upset, he’s choking on his fury, making himself dizzy. \n\n\nThere are so many things he wants to say, to scream and spit at Reginald, but they’re stuck in his throat. All the accusations, the misgivings and hurt get tangled into a knot he can’t unfurl, not until he has an answer.\n\n\nHe’s not so naïve to think he’ll—they’ll ever get an apology out of the man. \n\n\n“Well?” He sneers, eyes burning. “Aren’t you going to say anything? No, grand speech about the fact you were the fucking cause of the apocalypse? For ruining us? C’mon, you never wasted an opportunity to have the last word!”\n\n\nReginald had driven Five to the end of the world, Vanya to madness, Ben to death, Luther to isolation, Diego to a life full of loneliness and Allison to one of delusion. He’d driven Klaus to ruin himself with the mausoleum, to a point of numbness not even death could reach.\n\n\nHe’d ruined them like their powers ruined their lives.\n\n\nAnd he wasn’t regretful, not about them, but like he said last time, about his own choices.\n\n\nBut never about them.\n\n\n“I wasn’t wrong, Number Four, don’t be so pretentious to twist the truth.”\n\n\nKlaus can’t breathe past the flames blazing inside his chest. \n\n\n“What?”\n\n\nHe turns around to see Reginald pursing his lips, eyes glancing from his face to his shoes. Arms clasped behind his back, the self-righteous pride shining in his eyes is sickening. \n\n\nThe stone slips through Klaus’s fingers to sink into the sand.\n\n\n“You stopped the apocalypse or did you not?” \n\n\nReginald says in a voice Klaus heard a hundred times, cold and hard, the empty humor of speaking to a foolish child reflecting in his words. The same tune the man used upon locking him away from another three hours, mocking his fear of his powers.\n\n\nKlaus’s knees buckle and with a gasp he sinks to the ground on his knees, gripping at his shirt. A mirthless laugh bursting forth from his lips.\n\n\nHe laughs and laughs until he cries, curling up on the floor with Reginald standing over him.\n\n\n“Fuck you.” He sobs, breath catching in his throat. “Fuck you, seriously, fuck you!”\n\n\nHis heart is bleeding, his lungs squeezing out the air and he can’t breathe. Bitterness poisons his blood thicker than the drugs ever could, festering in his veins and bubbling to the surface like acid.\n\n\nHe can’t breathe. Can’t see through his blurry vision.\n\n\nHe’s having a heart attack. \n\n\nThe shoes in front of him come closer.\n\n\n“If it is any consolation—” \n\n\nReginald’s voice cuts through the fog inside his head, faint in his ears as black spots appear in front of his eyes. \n\n\n“—I never expected anything less from my children. Even you.” \n\nKlaus awakens with a gasp and jolts upright.\nHe nearly headbutts Five, who lunges backwards with a yelp and Klaus hisses at the sharp throb of pain shooting through his skull and chest. He curls forward with another breathless gasp, one hand pressing against his chest only for hands to catch him.\nHe squeezes his eyes shut, sucking in a breath and coughs when it gets stuck in his throat.\n“Shit—” The voice says, thumping him lightly on the back. “—it’s okay. Breathe, Klaus. Just breathe.”\n“Give me…give me a moment.”  \nKlaus blinks furiously to get his eyes to adjust to the dim-light of the coffee shop. His lungs are too small and his throat is too slippery for him to run his mouth, to get more words out and the hands on him grow bruising. He doesn’t notice, his limbs tingling unpleasantly.\n“I’ll give you a whole fucking timeline.”\nFive says, a little breathless next to his ear and the waver in his voice catches Klaus’s attention. Raising his head to sneak a glimpse of his brother after his breathing grows steadier, he doesn’t get the chance to get a good look at Five’s face.\nA weight slams into him, latching onto him to keep him from falling backwards. Klaus startles, muscles going painfully tense before he realizes what’s happening.\nOh. His mouth goes dry.\nFive is…hugging him. One arm wrapped around his neck, the other around his upper back, crushing him to his body with such force Klaus can feel his lungs protest at the rough treatment. A chokehold more than a tearful embrace but he can’t imagine Five giving hugs any other way.\nHis chest betrays him and he winces, a wheezing noise of pain passing through his lips.\nFive flings himself away like touching him burns.\nBut before the cold can sink back into his bones, there are small hands cradling his face, moving across his skin to check for injury and pulse and signs of life. Fingers press against his throat only to move down to his chest.\n“Where does it hurt?”\nFive demands, eyes wild and flickering from Klaus’s face to his shirt. There’s a urgency in his fumbling and hovering hands, an unspoken panic.\n“Is it your chest? Let me look.”\n“I’m fine.” Klaus says, a bit bewildered but that was the wrong thing to say because Five goes deadly still, pausing in his attempts to pry Klaus’s hands away from his chest and gives him a look.\n“You got shot in the fucking heart.”\nFive twitches, a full body flinch at the words like he got hit by lightning, hands trembling where they where laying over Klaus’s own, clammy with sweat and…and blood. There was so much blood drenching the front of his shirt and Five’s hands.\n“You were dead, Klaus.”\nThe voice cracks and Klaus finally gets a good look at Five’s face.\nAll the blood seems to have drained from his face, giving him an ashen pallor. Eyes bloodshot and red-rimmed, wide and glassy and furious as they remain on his chest with a focus Klaus has only seen him give the apocalypse. He’s missing his jacket, the sleeve of his shirt shoved up to his elbows. His lips are a thin, bloodless line and his hands squeeze Klaus’s, nails digging into his skin.\n“People don’t come back from death. They don’t. I checked, your pulse was gone, you…you weren’t breathing. For minutes. How did you come back?”\nKlaus stammers for an answer, reeling at the visible show of fear on his brother’s face.\nFive, a force of nature in the way he ruthlessly squashes his problems and deals with his enemies, who’s crowd of ghosts is bigger than anything he’s seen, is afraid.\nAnd it’s Klaus’s fault. For scaring him by dying in front of him.\n“God…God doesn’t like me very much.”\nHe says in a rush, anything to get that look from Five’s face.\n“It’s fine. Really, it’s no big deal. Sure, it sucks and all but I don’t stay dead. Not permanently, so you don’t have to worry. Seriously, I’m okay.”\n“No big deal?” Five repeats, head snapping up to glare at him. “You died—wait, hang on, how…how do you know that?”\nKlaus blinks. “Know what?” He asks uneasily.\n“That you don’t stay dead,”\nFive’s hands move to grip his chin when he tries to look away, jerking his head back as Five leans closer to stare into his eyes. Ready to pry the truth out with force if necessary.\n“How do you know? Have you died before? Did you die and keep it from us, from me?”\nVoice thick with anger, Five’s fingers dig into his jawbones. Dark eyes flashing with a ferocity suited for a predator, the grip is possessive, demanding and it shakes Klaus in a way his close call with death at the hands of Hazel and Cha Cha had.\nFive tightens his hold, squishing his cheeks. “Answer me.”\nThere’s no room for refusal, for disobedience in his tone and a shiver crawls up Klaus’s spine, the alarm bells roaring to life in his head, to get away from the danger in front of him lest he ends up back with the little God and his prick of a Dad.\nHe’s never felt afraid of his siblings despite their powers. Maybe it’s because he’s not afraid of death that he can laugh in the face of their wrath, of their strength and shrug it off with a poor joke. Giggle himself silly over annoying them to their breaking point.\nHe’s not afraid, not of Five, his brother, he’s certain Five won’t kill him but—\n“You’re hurting me.”\nFive snatches his hand back before he can finish his sentence.\n“I didn’t—” Five’s brows furrow, the concern casting a shadow over the anger. “It wasn’t my intention to…I didn’t mean—\"\n“I know,” Klaus reassures him, giving him a weak smile and rubbing at his jaw. “Like I said before, we’ll get you a hobby for your anger issues, okay?”\nIt’s meant to be a joke, a crappy one but he misses his mark by a mile. Five deflates, jaw straining as he gives a sharp nod, not sniping back like Klaus expects him to.\nFuck.\nTaking the opportunity to peel his shirt collar away to glance at the wound, he sees a sluggish bleeding spot on his chest, but no bullet wound. It’s a scrape, perhaps a small cut. Nothing to imply he’d been shot.\nMom could fix that. Hell, he could fix it himself. Nobody would need to know.\n“Look, Five, there’s barely a wound anymore.”\nHe pulls his crop top up to expose the wound, hearing Five suck in a breath before hands brush across the wound, careful and feather-light.\n“Amazing.”\nFloundering at the unexpected flattery, from Five of all people, Klaus hums in agreement and shoves down his shirt, leaning back on his hands and wincing at the tug in his chest that follows.\n“Can we go home now?”\nHe gestures to the empty café, ignoring the three corpses laying in a puddle of their own blood.\n“There’s nobody here to get us another drink and…and I’m tired. I’m dead beat, utterly exhausted and I’ll sleep like a baby once we’re home.”\nFive gives him a smoldering scowl for his little pun and Klaus shrinks into himself. Dead jokes were a No go then. Good to know.\n“Come here—” Five stands first, reaching out a hand to pull Klaus to his feet and steading him when he stumbles, knees shaking. He wraps an arm around his waist, letting him lean on his shoulders. “—I’ll teleport us to the gate.”\nWalking home while looking like a slaughter victim wouldn’t be a good idea. Still, there’s something that’s been nagging at him.\n“Where’s your jacket?”\nFive gives him an incredulous frown and inclines his head at behind them.\nCraning his neck to look over his shoulder, Klaus sees his brother’s uniform jacket folded into a make-shift pillow on the floor. It’s bloody but the sight of it makes something in his chest melt into a puddle of warmth.\n“Shouldn’t we take it with us?”\nThe police could use it to track them down and the last thing Diego needed was his former buddies at their doors, demanding answers about a suspicious child-sized jacket. Child service could be called and they’d get into a fuck ton of trouble. Allison was trying to get custody of Claire and that would give her a disadvantage in court.\n“Leave it,” Five says sharply. “I don’t give a fuck.”\nWell, he tried at least. With Five’s vice grip around his waist there’s nothing he could do.\n“Hold on tight.”\nKlaus nods, and Five hands glow blue and they’re standing in front of the Academy gate, leaning against each other for support.\n“Let’s get you inside.”\nFive guides him into the house to the living room couch and forces him to sit down. He vanishes from sight to return with a bowl of warm water, bandages, a towel and a new shirt and helps him out of his jacket and crop top.\n“My head hurts,”\nKlaus mumbles in confusion about the headache he’s sprouting as Five wipes away the blood from his chest and starts to clean the wound, dapping it softly in the cut, or small hole, really, to soak the towel and stop the bleeding.\nHe squints at Five. “Why does my head hurt?”\n“You hit the counter on your way down.”\n“Oh.” That makes sense. “What, no joke about me losing brain cells, brother dear?”\n“I’m not in the mood to crack jokes.” Five gives him a tight smile.\nIt’s not a nice smile. Klaus sinks deeper into the couch, wishing it would swallow him. A drink would be nice but something tells him if he asks Five to get him one, he’ll find himself strapped to the infirmary table on infinite bedrest for the next two weeks.\nSo, he wisely keeps his mouth shut for once, wishing the odd feeling in his chest would fade. It throbs in pain when Five works on his wound but once he pulls his shirt on and they clean their hands, it’s only an uncomfortable sensation of coldness making him ache.\nSmall hands pull his head down and cradle his head, running through his hair to feel for a bump and Klaus bites down on his tongue when Five presses down on a spot and his vision goes white.\n“Sorry.” It’s an unconscious apology Five mutters underneath his breath before he moves on, washing the blood out of his hair.\n“There’s no wound here.”\n“Yay,” Klaus claps his hands together. “We’re done now, right? I can go? To get my beauty sleep? I can hear my bed calling me and I would be a monster to ignore it, so I’ll go and—”\nFive’s hand grips his shoulder, keeping him from rising to his feet.\n“You aren’t going anywhere.” An order, not a request. “If I return and find you gone, Klaus, I’m going to break your legs.”\n“A little dramatic don’t you think?”\n“Stay here,” Five squeezes his shoulder in warning to stay put. “And do not move.”\nThe hand slips from his shoulder and in a flash of blue, Five vanishes, leaving Klaus sitting alone in the living room. Slumping into the couch, he leans sideway to throw his legs over the arm rest, throwing an arm over his eyes.\n\n“You promised.”\n\n“Not you too.”\nKlaus whimpers at the sound of Ben’s voice, not daring to look in fear of seeing the disappointed resignation on Ben’s face.\n“My night’s been an absolute nightmare so far and I’d appreciate it if you could save the lecture and scolding and yelling for a time where I don’t feel like my head’s gonna explode if someone raises their voice at me.”\nThere’s an odd moment of silence until Klaus’s feels the cold sink into his arm. Lowering it to sneak a glance, he sees Ben’s face hovering over him.\n\n“You okay?”\n\n“Peachy,” Klaus grins, giving a thumbs up. “Absolutely fantastic. Never felt better, mi hermano.”\n\n“What happened?”\n\nKlaus makes a face.\nBen gently swats him on the arm, or tries to. It’s not very successful without being corporal. Tough luck, Klaus doesn’t have the energy, so he’s stuck being an invisible little shit.\n\n“How?”\n\n“Does it matter?” Klaus sighs, closing his eyes. “I’m back, ta-da! No need to make such a fuss.”\nHe must look pathetic, downright horrible because Ben sighs but doesn’t push the issues. No prodding for more information or tongue lashing like he’s thirteen again and drinking himself through Daddy’s bar in the middle of the night.\n\n“I swear, I leave you alone for a few minutes and you get yourself into trouble. Five was supposed to keep an eye out for you.”\n\nBen grumbles half-heartedly, but the bitterness lurking underneath his light-hearted words screams protectiveness. Ben, after years of watching Klaus go down the rabbit hole and do stupid, reckless shit, takes his job as a lookout for danger more serious than Luther did his self-proclaimed missions.\nIt’s sweet and kind and just a tad bit annoying most of the times with Ben baring his teeth in a parody of the Horror at people who can’t see him when Klaus gets himself into trouble.\n“It wasn’t his fault.”\n\n“Yeah, it was mine. For leaving you alone.”\n\nChrist on a cracker, not this again. Twisting his body on the couch to pout at Ben’s sulking form standing guard next to him, he points at a spot on the floor and Ben sinks down to sit.\n“We’re not doing this again. Nu-uh. I forbid it. Must I remind you that I’m an adult? As much as I don’t act like it and hate to remember my age, I’m making my own choices even when most of them were shit. You’re supposed to make me feel guilty over them, not the other way around.”\n\n“But—\"\n\n“No.” Klaus put his hands over his ears. “Can’t hear you!”\nBen flips him off.\n“Klaus?” A voice calls out, hurrying into the living room.\n“Good morning, sis,” He waves as Vanya paddles into the room in her pajamas, bleary with sleep. “Couldn’t sleep? Want me to tell you a bedtime story or to sing you a lullaby?”\n“Five called a family meeting.” She says, shifting on her feet. “He said it was an emergency.”\nThat little snitch.\nForget trying to shield him from Ben’s pettiness for the next few days. That tattle-tale isn’t going to get a single drop of coffee for the next few weeks. He’ll give Ben free reign to knock shit over to be a pain.\nOh, the betrayal. From his own brother no less! Klaus thought they were over this.\nApparently not.\nVanya is still staring at him with these worried eyes, biting at her bottom lip. She opens her mouth to ask over matters Klaus won’t give her answers to, he’d rather bite the bucket again than to make her cry and there’s a very real possibility of her bringing down the house over such a trivial topic but she snaps it back shut when a shout echoes from the ceiling.\nA thud follows, then more shouting and Allison walks into the room, staring in amusement at the ceiling and settles into an armchair, legs drawn up and hair a fluffy mess.\n“Looks like one of them didn’t get up when Five asked them nicely to.”\nShe muses, voice quiet. It’s nothing more than a whisper, her throat straining with the effort to produce sounds. Yet, she’s never sounded more beautiful with her raspy voice after the whole fiasco of having her neck nearly shredded to pieces.\n“A shame really, because we all know Five doesn’t ask nicely a second time.”\n“Or ever.” Ben points out, eyebrows up to his hairline at the sound of a scream.\n“I’ll bet five dollars he kicked Diego out of his bed.” Klaus says with glee, not bothering to sit up from where he’s sprawled out across the couch.\n“Why would I bet against that?” Allison shakes her head, gesturing for Vanya to sit down, which she does albeit reluctantly. “It’s so obvious.”\n“Because you have money to spare for your favorite brother?” Klaus flutters his eyelashes at her, watching the smile tug at her lips.\n“I don’t think Ben needs money.”\n“Is he here right now?” Vanya’s eyes stray across the room, passing over Ben.\n“When isn’t he?” Klaus gestures to where Ben is sitting. “He sticks to me like gum to a shoe, not that I can blame him. I mean, have you looked at me?”\n“Yeah,” Diego grumbles, storming into the room. “You look like shit.”\n“Says the asshole who looks like he lost a fight to an alley cat.”\n“Fuck off.”\nAllison waves to get his attention as he plops onto the other armchair. “What happened?”\n“Little bastard kicked me out of my bed.” Diego crosses his arms, fighting back a yawn.\nKlaus pumps a fist into the air, grimacing at stinging sensation in his chest. “Called it!”\nLuther trudges into the room shirt dripping wet. They all pause to stare at him for a moment.\n“Five.” Is all he offers for an explanation and leans against the arm rest of Allison’s arm chair.\n“Anybody knows what’s gotten into him?” Diego asks, rubbing at his eyes.\n“No, no idea.” Klaus stretches like a cat. “Probably cranky because he missed his bedtime.”\nLuther grunts. “Hopefully it’s not another apocalypse.”\nAllison jabs her elbow into his ribs and it does nothing but make him look like a kicked puppy. She rolls her eyes, points at Vanya’s frown and he offers a quiet apology Vanya dismisses with a wave of her hand.\n\n“You know Five’s gonna rat you out. Better speak up now before he drops the bomb on them and they’ll start pointing fingers into your direction.”\n\nKlaus hisses at Ben to shut up. His siblings share a glance but don’t ask him to elaborate.\nAs if the call of his name summons him Five pops into the room, making everybody jump.\n“Is that…a blanket?” Diego asks, dumbfounded at what Five’s carrying in his arms.\n“Good, you’re still here.” Five ignores them, marching over to tower over Klaus. “Head up.”\nHe shoves the pillow under his head, pushing him back down before gently tucking the blanket around him. Putting a hand on his forehead, Five clicks his tongue and disappears only to reappear with a glass of water in his hand.\n\"Drink up.\"\nKlaus takes the glass of water, eyeing it warily. “Did you poison it?”\n“Drink it or I’ll pry your mouth open and pour it down your throat.”\nKlaus gulps down the water, setting the empty glass down on the floor. There’s no itch breaking out across his skin, no stomach cramps. Just plain old boring water. His throat feels less dry, the sickening taste of blood lingering on his tongue.\n“Holy shit.” Ben peers at Five like he’s never seen him before. “Dude, I think Five’s trying to play nurse for you. How the hell did you die for him to tuck you into a blanket?”\nThere’s not a speck of blood on him. Probably changed into a fresh set of clothes to not raise alarm with the others. The blanket around Klaus feels more like a straightjacket but he doesn’t dare comment on it.\n“Five?” Vanya’s hesitant voice breaks the stunned silence. “What’s going on?”\n“I’ve called this meeting since apparently, there are still some secrets that need to be brought to light. Because someone—” Five’s eyes dart to him and Klaus pulls up the blankets to his nose. “—didn’t find it necessary to tell us.”\n“Oh, c’mon!” Klaus whines and throws up his hands into the air, forcing Five to step back if he doesn’t want to get slapped. “How the fuck should that have come up in a conversation?”\n\n“You’ve got a point there.”\n\nFive disagrees, bristling like a cat someone sprayed with water.\n“You should have said something, anything but to keep silent. This isn’t something you can sweep under the rag.”\n“Oh, so, what?” Klaus pushes himself into a seating position. “I was supposed to tell you so you could call me a liar? Like you did when I told you about Dad? Right, that would have gone super well “Oh brother dear, you won’t guess what happened today!”. What? You don’t believe me? Oh darn, I have no proof, that’s too bad.”\nHe laughs, mean and harsh, curling into his blanket. “Just let it go.” He mumbles, feeling light-headed after his outburst.\n“I’m not letting it go.” Five snarls, hands curling into fists and looking seconds away from tearing his own hair out. “Christ, what the hell’s wrong with you?”\n“Hold on, what the fuck is going on?” Diego rises to his feet, glancing between them with furrowed brows. “What are you talking about?”\n“Go on,” Five sneers, lips curling into a sharp smile as he turns to face their siblings. “Tell them what happened or I’ll do it. I’ll give you one last chance to man up.”\nBen’s expression turns sour. “I don’t like that tone.”\n“Me neither.” Klaus feels his chest tighten, wanting nothing more than to hide under the blanket. It’s childish and wouldn’t solve anything. Five would just tear it away and he’d end up on the floor with a throbbing chest or give himself a concussion with his luck.\nHe doesn’t understand Five’s motive. What’s the point of this?\nCha Cha and Hazel didn’t get him this worked up, so why should it be different now? He’s in better condition than after the torture session or the time travel stunt. Sure, he hated not knowing things, got downright scathing when someone withheld information, but it’s not like Klaus did it for fun.\nIt just never came up and the first time it happened they wouldn’t believe him about Reginald’s suicide. The chances of them taking him seriously when he told them he died the previous night were laughably low. Them dismissing his death would have done him in for, so there was no reason to bring it up.\n“Five, calm down.” Luther steps forward, palms outstretched. “There’s no reason to shout. We can talk about this—\"\n“No reason?” Five echoes, voice low and tense like the strings of Vanya’s violin. “You don’t get to tell me to calm down, not after I thought I had to bury one of you again tonight!”\nLuther stagers back, bracing himself on the arm chair with wide eyes. “What?”\n“Remember how you told me you guys are all I have left?”\nFive starts pacing like an animal driven into a corner.\n“Fuck it, you were right. I came back for you all, to save you bunch of idiots from the apocalypse. I didn’t give a fuck about the world. Your survival was my priority.”\nVanya looks close to tears. “Five…”\n“But you—” Five rounds on Klaus. “—you got shot in the fucking heart in front of my eyes while I could do nothing but watch, you die and I have to pick out your blood from underneath my nails and then you have the audacity to tell me it’s no big deal!”\n“What!?”  Ben shouts, head whipping around to stare at Klaus like the rest of their siblings, their eyes growing wide with horror.\n“Because it isn’t!”\nKlaus shoves the blanket away, legs swinging over the couch to rise to his feet.\n“Last time I checked nobody noticed and…and it’s not like I stayed dead! See?” He pats himself up and down, voice rising as he laughs nervously. “Perfectly fine! What’s the point of telling you I died when it didn’t stick? Huh? It changes nothing.”\nFive’s face flushes. “Stop saying that.” He takes a threatening step forward. “That’s the dumbest thing I’ve heard you say.”\n“It’s the truth.”\nFor a moment he’s sure Five will strike him. His eyes flash with the urge to hurt, to maim, to kill and there’s a noise wrung from his chest similar to a growl. His right fist twitches, blood dripping down onto the floor from where his nails have pierced the skin and Klaus braces himself for the impact. For the flash of blue and the knuckles digging into his cheekbone.\nBut his fist doesn’t land on Klaus’s cheek, it slams into the wall instead.\nThe cracking noise of his fingers breaking rings out in the sudden silence and the floor they hadn’t noticed started shaking goes perfectly still.\nKlaus falls back into the couch, chest throbbing fiercely and he rubs at the spot to ease the pain, lowering his head and bracing his arms on his knees.\n“You…died?” Allison sounds sick voicing the thought.\nNot having the strength to answer, he nods.\n“Twice?” Vanya croaks out, eyes flickering between dark and lighter colors.\nSlowly, antagonizing slowly, he gives another nod. Not bothering to think about the overdoses he had. They didn’t count simply because God didn’t come to visit him then.\nThe glass on the floor shatters as she takes in a deep breath. The moment she lets it out the uproar starts.\n“How? How did you—”\n“When did you—”\n“What the fuck? Why didn’t you—”\nTheir loud voices mesh together, a warped sound of static in his ears much like the ghosts with their wailing. Blending into one noise hammering against his skull, again and again and again—\nHe puts a hand onto his forehead, clammy with cold sweat and moans.\n“Shut up,” Five’s hiss silences them at once. “You’re making his headache worse.”\nThe couch sinks besides him as a weight settles down.\n“You’re an idiot.”\n“I’m not the one who broke his hand in a fit of temper.” Klaus rubs a hand over his face. “That line is getting old pretty fast, too. Try to think of something a little more original.”\n“Ask Ben.”\nKlaus looks up to see Vanya’s tears sliding down her face. The smile on her lips is brittle but the eerie glow from her eyes is gone. Panic twists in his stomach at her distress but he feels oddly numb, so he can’t bother to cheer her up.\n“What?”\n“Ask Ben to explain why we’re upset.” She says gently, wiping at her eyes.\n“Okay.” He turns to face Ben still sitting on the floor. “Enlighten me, oh wise one.”\n\n“How did you feel when you saw me the first time like this?”\n\nHorrible. Guilty. Mad with grief after the denial had worn off. But Ben knew that already. He didn’t have to voice his answer.\n\n“Right. I died and came back as a ghost.” \n\nKlaus didn’t get it. Ben curses under his breath, looking towards the ceiling as if to prey for patience as he reached out to lay a hand on his knee, hovering above it to avoid sticking his hand through Klaus’s leg.\n\n“It still hurt, didn’t it? To see me like this, to know I’m here but not like before. You don’t like it when I disappear. I’m not permanently gone but the first few times I wandered off you cried like a baby, didn’t you?” \n\nHe did. Terror choked him at the thought of Ben leaving him alone, behind and forgotten. To never see him again, hear his voice and share his smile. Ben would come back. He always did but Klaus couldn’t help but fear that this time he would be gone for good—\nOh.\n“Fuck you, Benny, you don’t get to use logic on me. Or this reverse psychology bullshit.”\nShame prickles across his skin and Five nudges him in the side, letting Vanya fuss over his hand. Klaus tears his eyes away from Ben’s dry but patient frown to see Diego crouching in front of him.\nWordlessly, Diego reaches out to take his hand, fingers wrapping around his wrist to feel his pulse.\n“You don’t need to worry, Dee.” He tries to tug his wrist free. “God doesn’t like me very much so she won’t let me stay.”\n“God?” Luther repeats, sounding faint.\n“Good.” Diego rubs circles with his thumb on his inner wrist, eyes earnest. “Be sure to piss her off so she’ll throw your ass out and back to us.”\n“I don’t want to go back,” Klaus shakes his head, shoulders hunching forward. “Sure, it’s quiet and there’s a lack of ghosts but dear old Papa never fails to pay me a visit, the prick.”\n“…you said you conjured Dad.” Luther says, a little pale and swaying on his feet. “Conjured, not…not met him in the afterlife—\"\n“Well, you didn’t believe me then, big guy, strolling into the room to announce I met him in the afterlife sounded ridiculous even to me and that’s saying something.”\n“What did he say?”\nDiego looks ready to burst a blood vessel, glaring at the ceiling. His grip on Klaus’s wrist went firm, ready to pull him away and sweep him out of the room in a firearm carry should Reginald manage to magically pop up behind the couch and despite them being the same height, Diego would have no problem with carrying him.\nHe’s done it plenty of times.\n“You don’t want to hear it, trust me.”\nJust thinking about it set his blood boiling.\n“Give it a shot.” Diego squeezes his wrist encouragingly. “C’mon, you love gossip, bro.”\n“Maybe tomorrow.” Klaus leans his head against the back of the couch, staring up at the grey ceiling. “Coming back to life isn’t as easy as it looks.”\nFive clears his throat.\n“Yeah, right, sorry. No joking about my death, got it. Big no-no.”\nDiego’s lips tug into a fond smile. “Let’s get you back to bed.”\n“I’m not moving.”\n“Why not?”\n“One, I lost quite a bit of blood,” Klaus ticks of the list with his fingers. “Two, the couch’s ridiculously comfy and last but not least, my legs fell asleep and I don’t wanna fall down the stairs. Not again.”\nLuther walks over, shoving Diego to the side. “I’ll carry you.”\n“Careful, his chest isn’t fully healed.”\nFive warns as Luther scopes him up bridal-style like he weights nothing.\n“Reopen it and you’ll wake up to a bucket of acid instead of water in the morning.”\n“You’re so getting these anger management classes, you little psycho. I’ll even join a knitting group with you to get you to stay. Ohhh, it’s gonna be great. All these old grannies itching to pinch your cute cheeks, unaware you’re one of them.”\nLuther keeps moving, carrying him out and up the stairs, Klaus as limp as a ragdoll in his arms.\n“Just go to sleep, Klaus.”\n“Sleep does sound nice.” He yawns, eyes sliding shut.\nLuther tucks him into his bed, careful not to wake him and he lingers in the doorway, turning on the fairy lights hanging over his bed. The next morning Klaus wakes up to Grace fussing over his chest wound, checking him for a concussion and giving him a plate full of waffles.\nBen doesn’t leave his side, sticking to him like glue and he does knock over Five’s coffee once, much to his delight.\nWhat’s strange is the new shadow trailing him, popping in and out of sight, light blue flashing in the corner of his eyes as he walks through the street and he lets Five do his thing, the watching and stalking for two days before he puts a stop to it because it’s creepy and has too much of a serial killer vibe going for him to be okay with that.\nIt’s even worse when he catches Diego trailing him one evening, awkwardly insisting he was doing a patrol round around the block to look for criminals.\nHe makes Ben visible; his blood turning blue with power and lets Ben do the talking about being a good babysitter. He actually manages to implant the fear of God in Diego, looming in close in his ninja get up and telling him The Horror will gut the next person who tries to kill a family member, doing so without batting an eye.\nDiego, who remembers sweet, quiet and shy Ben is naturally terrified.\nFive and Ben just have a staring contest for a few minutes, neither looking away before they both blink and nod at each other.\nFive doesn’t attempt to follow him without asking permission to tag along first after that.\nBen looks surprisingly smug about the fact. Klaus lets him bask in his victory of…of dominance and he hadn’t thought anyone other than Diego and Luther would have a dick measuring contest but oh well. Ben’s happy and when Ben is happy, there’s no reason for Klaus to be sad, especially since he can pull the Ben card now, whenever Five is turning crazy serial killer on them.\nIt’s hilarious, to see them backtrack so fast they nearly give themselves whiplash whenever Ben so much as turns to frown at them disapprovingly. They’re not used to this side of Ben, his mood swings and jabs and the lack of hesitance on calling them all out on their bullshit.\nThey see Ben’s death hanging over him, a reminder of his tragic backstory and bite their tongues in favor of sparing his feelings. Five is starting to grasp Ben’s shameless use of exploiting his death to get his way, knowing he came to terms with his death years ago, but the sight of his brother is still too raw to escape the manipulations.\nThe best thing is Klaus doesn’t have to do anything. No signals or code words. Ben turns all mother-hen on his own, demanding to be made visible, so he can stare Luther into submission whenever he toes out of line and into the shape Reginald tried to mold him into.\nWith Ben around, nobody can push him around. His siblings worry but there’s still a distance, years that set them apart from Ben, who stuck around all this time, had taken his worst and saw the best in him.\nThey care but they’re still learning. All they need is time.\nThank God Klaus has plenty of that."
}