{
    "id": "24634954",
    "url": "https://archiveofourown.org/works/24634954?view_full_work=true",
    "author": [
        "onelittlebirdiesittingonthesill"
    ],
    "title": "Of Father Figures and Formal Wear",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Midoriya Inko & Midoriya Izuku",
        "Midoriya Izuku & Yagi Toshinori | All Might",
        "Midoriya Izuku & Todoroki Shouto",
        "i guess this can be read as pre-tododeku?",
        "if you wish - Relationship",
        "Bakugou Katsuki & Midoriya Izuku",
        "Bakugou Katsuki & Midoriya Izuku & Todoroki Shouto"
    ],
    "characters": [
        "Midoriya Hisashi",
        "Midoriya Inko",
        "Midoriya Izuku",
        "Yagi Toshinori | All Might",
        "Gran Torino (My Hero Academia)",
        "Todoroki Enji | Endeavor",
        "Iida Tensei | Ingenium",
        "Class 1-A (My Hero Academia)",
        "Class 1-B",
        "(mentioned)",
        "Shinsou Hitoshi",
        "Aizawa Shouta | Eraserhead",
        "Eri (My Hero Academia)",
        "Toogata Mirio",
        "Amajiki Tamaki",
        "Hadou Nejire",
        "Kurogiri (My Hero Academia)",
        "Shigaraki Tomura | Shimura Tenko"
    ],
    "additional_tags": [
        "BAMF Midoriya Izuku",
        "Midoriya Izuku is a Little Shit",
        "Midoriya Izuku is So Done",
        "Aizawa Shouta | Eraserhead Needs a Raise",
        "Parental Sensei | All For One",
        "(eheh)",
        "Sensei | All For One Being an Asshole",
        "midoriya izuku can't tie a tie",
        "can that please be a tag",
        "Bakugou Katsuki Being Less of an Asshole",
        "Midoriya Izuku Swears",
        "gran torino is gonna have a heart attack",
        "The Author Regrets Nothing",
        "Boku no Hero Academia | My Hero Academia Manga Spoilers",
        "Maybe - Freeform",
        "i ship izuku and trauma"
    ],
    "language": "English",
    "series": "",
    "published": "2020-06-28",
    "completed": null,
    "words": "5,102",
    "chapters": "1/1",
    "comments": "273",
    "kudos": "17,147",
    "bookmarks": "3,002",
    "hits": "111,613",
    "summary": "<p>Midoriya Izuku is terrible at tying his tie. He knows this. His mother knows this. All Might knows this. Honestly, the whole of Japan knows this. </p>\n<p>So really, they couldn't have made the connection sooner. </p>\n<p>It takes a headband, a black-tie Gala and a school dance to figure out why every villain is so damn intimidated by him in a suit.</p>",
    "notes": "<p>disclaimer: i don't know when in canon this is-- afo was captured, eri was rescued, and AM is retired, but machia hasn't made an appearance and kurogiri somehow isn't in jail anymore, and izuku has already interned with endeavor. it's just... in there somewhere. </p>\n<p>yes, i should be working on omniscience. oops.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>so, yeah! hope you enjoyed.</p>",
    "text": "\n~Well, Izuku certainly hadn’t expected this.~\n\n \n\nIn hindsight, they couldn’t really have known-- the child known as Midoriya Izuku mangled his tie every single day of the year, without fail, and no one had ever bothered to fix it for him before. \n\n \n\nWhen he’d gone to I-Island with friends, he’d worn a horrible pin-striped suit Uraraka would eventually, lovingly, tell him was the ugliest suit she’d ever seen before. It was no doubt he hadn’t put it together then. \n\n \n\nWell, you know what they say. Hindsight is 20/20. \n\n \n\nNow tensions were rising to a boiling point between Shigaraki Tomura and his League and the stricken students of 1-A, and Izuku knew they were preparing for an all-out war. \n\n \n\nHe had faith in himself and his school, but when the time came to fight he wasn’t sure if they’d come out on the winning side or not. \n\n \n\nHe and his classmates would try their damn best though, and that was for sure. \n\n \n\n~~~\n\n \n\nIt began when Izuku walked into his class for the millionth time, with his tie puffed up slightly more then usual, curls wild and flopping over his eyes. He’d been greeted as cheerfully as he always was, but some people had made jokes about his hair and his overall appearance. \n\n \n\nIzuku took it in stride-- he hadn’t had much time to get ready this morning-- the dorms had nearly been empty by the time he’d woken up, having missed his alarm completely. \n\n \n\nHe’d sat himself down, greeted Kacchan and everyone surrounding him cheerfully, and gotten ready for the day. \n\n \n\nSoon enough, lunch had rolled around, and he walked out with Tsu, Uraraka, Shouto, and Iida, chattering about something irrelevant, perhaps class assignments. All Izuku could focus on was the fact that Shouto seemed unusually open today, and that maybe if he tried hard enough he could get him to laugh. \n\n \n\nThat’s why he was caught completely unawares when Uraraka pushed his bangs out of his eyes with a headband, and Shouta reached over in the middle of eating his soba to untangle Izuku’s mess of a tie with ease. \n\n \n\nIzuku sputters as Uraraka fiddles with the headband and Shouto’s hand goes around his neck to make sure the tie is even, before seamlessly tying it and smoothing it down into a well-done knot. He looks down and meets Shouto’s eyes, and then blushes vermilion. \n\n \n\n“T-thank you,” he squeaks, and then turns back to the table and feels only two pieces of hair bounce against his forehead. \n\n \n\nHe blinks as Tsuyu grins, and Uraraka spittakes with glee. “What did you do?!” \n\n \n\nHis answer comes when All Might, lanky and tall in a way that still makes Izuku fear for him, taps him on the shoulder and asks to discuss recent developments of Izuku’s quirk and power output over lunch. \n\n \n\nIzuku obliges, because he loves spending time with his mentor and he is genuinely curious, but isn’t quite sure why All Might suddenly spits blood in surprise until he sees the two tufts of hair hanging out of the headband. Uraraka had pulled them out to look exactly like All Might’s hair when he was in his civilian-- his everyday hairstyle. \n\n \n\n“Looks great, my boy,” All Might says slyly as Izuku’s face goes pink again. “And it looks like you’ve even learnt to tie your tie!” \n\n \n\nIzuku is so embarrassed he doesn’t even bother to deign that with a response. \n\n \n\nThat’s how it starts. \n\n \n\n~~~\n\n \n\nShouto has begun tying Izuku’s tie every morning, without fail or even preamble. \n\n \n\nHe’ll be in the middle of a conversation with Aizawa-sensei, and then Shouto will tug his tie out of his neck and fix it from behind without batting an eye. \n\n \n\nAt first, Izuku had stuttered off and run away red-faced whenever that had happened, but now he was… daresay… used to it? \n\n \n\nHe’d tried to learn how to tie a basic knot on his own, but had failed miserably, and every time he tried to tell Shouto it was alright, the boy stared at him and raised one eyebrow. \n\n \n\n“But then you wouldn’t fix it either, Midoriya,” he says, and well, Izuku can’t dispute that, so he lets him. \n\n \n\nAnd then Aizawa-sensei tells them they’re going to be going to a gala hosted by Nedzu, and it’s a black-tie event. The girls blink, the boys make bets about who is going to look the best, and Izuku despairs, at least until Uraraka elbows him and tells him how many Heroes will most likely be there. \n\n \n\nThat brightens him up immediately. \n\n \n\nIt still sucks when he goes home for the weekend and has to spend his precious time telling his mother that he needs to get himself fitted for a black suit. \n\n \n\nShe, at least, takes it in excited stride, hustling them off to some quaint little tailor immediately. Honestly, Izuku didn’t even know they still had tailors who were, you know. In business. He also has no idea how they’re going to afford this place, but his mom merely ushers him inside and doesn’t seem worried at all. \n\n \n\nWhen Izuku meets her eyes in the middle of his measuring, obvious discomfort on his face and a question in his eyes, Midoriya Inko merely snickers. \n\n \n\nHe mouths ‘traitor’ at her, and her snickers turn to full-fledged laughter, and Izuku finds that he can enjoy the day a bit more after that. \n\n \n\nIt takes him forever to get measured, because his shoulders are that of a linebacker’s but he’d ridiculously short still, and yet when he’s done the suit fits him impeccably. \n\n \n\nIt’s not as ill-fitted as that pinstriped suit was, and he actually likes the fact that they got to choose colored undershirts-- Izuku’s is a soft mint green that’s a few shades lighter then his hair. \n\n \n\nThe tailor gives him the tie, fully expecting Izuku to be able to tie it, and he struggles with it for a whole three minutes before he looks up at his mom, utterly lost as to why it won’t smooth down. \n\n \n\nHe always followed Shouto’s instructions to the letter-- why did it turn out like this every time? \n\n \n\nHe’s surprised to see his mom silently shaking, giggling as quietly as she can, something purely content. \n\n \n\n“What?!” He squeaks, as the tailor stares at the tie with something like misery. Izuku’s managed to knot it but now it won’t come undone. \n\n \n\n“You just remind me of your father, dear,” his mom says, smiling softly. “He was as terrible with ties as you were,” she says with a chuckle, but she also has no idea how to tie a tie, and so it’s up to the tailor, huffing but very visibly amused, to tie it. \n\n \n\n“I know how to do it,” Izuku mutters hotly as they pay for the suit and Izuku changes in the dressing room. “It just never works!” \n\n \n\n“Sure, dear,” his mother’s amused voice says, passing over the top of the stall. \n\n \n\nIzuku grumbles to himself and she giggles some more. When they get out of the shop, Izuku throws a look back at it with visible distaste, and then turns to his mother, interested. \n\n \n\n“How did you know that store?” \n\n \n\n“Your father again, dear,” Midoriya Inko says with a bit of a dreamy smile on her face. “He was always in need of a new suit, and he would always singe his when he used his Quirk… goodness, he had a cold once and burned up an entire closet of suits! Like that!” She snaps her fingers and shakes her head, disbelieving. “I still don’t understand how he managed that with one sneeze.” \n\n \n\nThis being the first Izuku really hears of his father, he’s reasonably surprised. \n\n \n\n“Did he have to be in formalwear for his job?”\n\n \n\n“Not all the time, but yes, often enough that it was usual. I think it was just a habit to dress nicely, after a while… He must be drooling over all of the fancy suits over in America, not to mention the wristwatches…” She turns to him, eyes alight with fondness and remembrance, still half in her own world. \n\n \n\n“My word, Izuku, that man was \n\nobsessed\n\n with wristwatches! I could never figure out why, although I suppose he did always value punctuality. I think he just liked the way they looked on his wrist,” she says with another giggle. \n\n \n\nIzuku nods along, curiosity piqued, and then the headband falls out of his hair and he catches it. \n\n \n\n“What’s that, dear? I didn’t want to say anything, but we didn’t buy that…” He blushes vermilion, murmuring an ‘oh no’, because he’d spent the whole day wearing it and he hadn’t noticed. \n\n \n\n“I stole it from Uraraka by accident… or maybe she gave it to me? I don’t know, my hair is just so long now that the fringe gets into my eyes…” his mom looks up and turns and points. \n\n \n\nIzuku follows her finger, overcoming the weird urge to admonish her for pointing because it was rude since she had been the one to teach him that, and sees the sign for the barbershop. \n\n \n\n“Do you want a haircut, dear?” Izuku considers. \n\n \n\n“Yeah, that’d be nice. Thanks!” \n\n \n\nIn the end, Izuku ends up with a bit of a subtle undercut, his hair still mostly long on the top and just a bit shorter of the side, and when they get home his mom digs out an old photo album and a watch with a knowing smile. \n\n \n\nIzuku tries to refuse, wondering if One for All will break it, but she insists he wear it to the Gala, since it was his father’s and she wasn’t going to use it anytime soon. He does, however, take up the photo album without prompting, genuinely interested in the way his dad looks. \n\n \n\nHis father looks like him, startlingly enough-- Izuku always thought he’d been a carbon copy of his mom, but it does explain where the freckles and the curls in his hair have come from, as well as the unusual hardness of his jaw on an otherwise round face. \n\n \n\nHis mom spends a long afternoon telling Izuku everything about his father-- from how badly he handled sick days to how he always brought her back the strangest gifts from everywhere, and Izuku stares at the tall, black-haired and amber-eyed man in the pictures with enchantment, a stab of… something, spearing him in the gut. \n\n \n\nHe would have liked to meet him, rather then learning about him from across an ocean. \n\n \n\nHe wants to vocalize this to his mom, but she looks so content telling him stories that he can’t bring himself to say anything, in the end. \n\n \n\n~~~\n\n \n\nThe Gala rolls around the next day, and soon everyone is spamming the group chat, telling everyone they better look their best and to meet at the East Gate and if anyone needs some last-minute changes to just text Yaoyorozu and she’ll give it to you once they’re all at the gala, don’t worry about it! \n\n \n\nIzuku smiles down at his texts and then laments at the fact that he won’t be able to bring his notebook along to get signatures. \n\n \n\nAt least he’ll be able to talk to a bunch of high-profile Heroes-- he’s actually a bit terrified of that, as well, now that he thinks about it, because his notorious for his rambling fits, and this will be an event that isn’t open to civilians, so it might be televised or--\n\n \n\n“Izuku? Izuku! Dear, are you quite alright?” Inko’s gentle prodding snaps him out of his daze. He turns to her with an apology on his lips, but she merely laughs it off and helps him clip on his watch. He turns to her in his shined shoes and perfectly fitted suit and smiles as she goes wet-eyed. \n\n \n\n“Oh, I have to take a picture of you, goodness! You look so handsome, my little grown up baby…” \n\n \n\nIzuku tries his best not to twitch as she fusses over him for the next few minutes, until he happens to glance down at his watch and gasp. “Mom, I’m going to be late!” \n\n \n\n A sly smile plays at her lips as she looks past his head, out the window. “Are you sure?” \n\n \n\nThere’s a buzz from his phone, and he scrambles for it, looking frantically at the group chat. \n\n \n\n...Huh, Shouto texted him? Individually?\n\n \n\n\nIcyhot: Look outside.\n\n\n \n\nIzuku blinks and turns, peeking out the window to-- \n\n \n\n\n“\n\nOh my god,” He says fervently, staring at the sports car and the flames faintly visible through the tinted windows. He turns to his mom and stares, equal parts horrified and embarrassed. \n\n \n\n“Mom, Endeavor is at our house.” She misses a step and turns, gasping. \n\n \n\n“Oh dear… I thought that would be Toshinori-san, not Endeavor…” She giggles. “Well, you’ll certainly make an entrance if you go in that, right?” \n\n \n\n\nIcyhot: Bakugo is here, too. Please get in. They’re yelling.\n\n\n \n\nIzuku snorts, and a bit of the nervousness in his gut abates. He turns to his mom with a smile, lets her snap a last picture and exits the house, trying not to blush at the way his tie is mangled. He’d tried all day, but still… \n\n \n\nHe meets the Number One’s eyes with a nod and gets a jerk of a chin in response. After their internship there had been… less animosity, but Izuku still couldn’t quite bring himself to refer to Shouto by his family name. \n\n \n\nShouto takes the formality one step further by getting out of the car and opening the door for Izuku, which he blushes a scarlet at and waves away. \n\n \n\nHe notes with some excitement that Shouto’s dress shirt is a beautiful baby blue, dignified and good on him. \n\n \n\nThey take a second to regard each other, and for some odd reason it’s almost as if a spark flickers on the side of Shouto’s face before his expression quirks into a small smile and he moves forward. \n\n \n\n“You messed up your tie again,” Shouto says, and Izuku sighs the sigh of someone who has given up trying. \n\n \n\n“I tried over and over again,” he whines, as they get back into the car. Kacchan turns to him and scowls, without much heat in the look. \n\n \n\n“I think this is the first time I haven’t hated your fashion choice, and that’s because it was mandatory to dress like this,” he scoffs, and Izuku rolls his eyes. \n\n \n\n“Hello to you too, Kacchan,” he says, which gets a snort from Shouto, and then they’re off. \n\n \n\n~~~\n\n \n\nWhen they get out of the car, Izuku privately thinks to himself that they look like something out of a magazine cover, and also that he’s terrified and he never wants to get out of a car like that again, because Endeavor had scowled at all of the reporters so they’d focused on the three kids and there were so many flashing cameras. \n\n \n\nReally, he should be used to this, but he isn’t. \n\n \n\nThey meet the rest of their classmates at the East Gate, as planned. Everyone looks sharp and well-dressed, and Izuku is excited, ready to spend the time greeting different Heroes. They’ll never get another chance like this in their lives. \n\n \n\nHe didn’t expect so many people to comment on his hair and his suit-- classmates goggle at the sudden lack of curls and the neat black tie, while reporters tell him he’s great for supporting a classmate’s family business.\n\n \n\nIt takes him more then a few minutes to realize that he’s wearing a Yaoyorozu tailored suit, to which he blushes a scarlet at and privately wonders how on earth his mother afforded it. \n\n \n\nEveryone sits down and he’s shellshocked as Nedzu makes a speech, and he sees Toshinori arrive with Gran Torino, and the top heroes all say hi to everyone. He tries to wave at Toshinori but he catches Gran’s eye instead, and he could swear the man blanches at the sight of him. \n\n \n\nHe hopes he didn’t do \n\nthat\n\n badly in his internship, that Gran hates him! Thankfully, the man returns the wave after a hesitant moment, keeping Izuku from melting into an embarrassed puddle on the floor.\n\n \n\nHe still isn’t sure why he looked so freaked out, though. \n\n \n\nThen an emergency call-in occurs, and before any of the food can be served or mingling can happen the Heroes are all running out in a series of incidents across the city, even Ingenium in his bionic pants and Endeavor, who is Izuku’s ride. \n\n \n\nIt doesn’t bother Izuku much, though, because the food is really good and he hasn’t had a chance to hang out with every single one of his classmates in a long while. \n\n \n\nKaminari attempts to charm the bartender into giving him drinks, and then Ashido eventually drags them all onto the dance floor, where they all stand, unsure, until Ashido yells at them to just dance because she’d taught them multitudes of moves during the prep for the Culture Festival goshdarnit! \n\n \n\nThey’re laughing and having a generally good time when suddenly a familiar purple warp opens up in the middle of the dance floor. \n\n \n\nEveryone freezes and Izuku scarcely has time to shove everyone back before two faces he’d hoped he’d only see in hell appear, cool indifference on one and a cruel sneer on the other. \n\n \n\n“Hello there, golden eggs,” Kurogiri says with a chuckle that reverberates through the now-silent room. \n\n \n\nIzuku casts a look at the now-terrified staff and makes an aborted move for them to run away as he spies warp gates open around them with additional villains-- from the looks of it, a genuine part of the League, not just thugs. \n\n \n\n“Did you like the distraction? Now that you’re here, all by yourselves, we can kill off All Might’s legacy once and for all!” Shigaraki says with an eerie, wild look in his eyes. “All of \n\nyou,\n\n and then the world will be free!” \n\n \n\nMidoriya Izuku is angry, so he falls out of his battle-ready stance and stands up straight, shouldering through his classmates and staring down Shigaraki. \n\n \n\n“Do you really believe that?” He asks, and he’s so full of rage, that they won’t just leave his poor mentor alone, that he and his friends can’t even enjoy an outing together, that they have to be \n\nhunted\n\n like \n\nanimals,\n\n that his voice and tone darken a few shades, low and humming with power. \n\n \n\nOne for All courses in his veins like some wild animal, and in a snap Full Cowl flickers around him, making his eyes glow and the lightning flick comfortingly about. \n\n \n\n“Do you think that with us, even if you manage to kill everyone without a scratch, All Might’s legacy will die?” \n\n \n\nHe stands there, eyes glowing a toxic green, in a beautiful tailored suit in front of his terrified and resigned classmates, and raises his arms to them, meets Shigaraki’s eyes-- \n\n \n\n“We are the future, Shigaraki Tomura.” \n\n \n\n--And is met with utter \n\nfear.\n\n \n\n \n\nHe almost stumbles from the severity, how shocked they look-- Kurogiri has taken a step back and Shigaraki’s eyes are wide, sneer falling off his face. \n\n \n\nIzuku has half a mind to reach out and ask what’s wrong with them when he realizes that this is stalling them, and the longer he stalls, the longer Yaoyorozu’s distress signal will be out there for everyone to hear. \n\n \n\n“Kurogiri, why does he look...” \n\n \n\nIzuku looks at them, scared at his confident, \n\nangered\n\n air, and decides to do something stupid. \n\n \n\n“Do you think you can win?” He asks, quietly, so very very quietly. “Hmm?” \n\n \n\nHe lets a smirk that he’s copied from someone else that he can’t remember slide onto his face, self-assured and utterly genial, only making the storm of rage in his eyes more potent. \n\n \n\n“Come on, Shimura Tenko. Tell me,” he mocks, and the villain \n\ntakes a step back.\n\n \n\n \n\n“Kurogiri, why does he look like him…?” Shigaraki asks, his eyes blown wide and his voice unsteady. \n\n \n\nIzuku is about to pass out. \n\n \n\n“I don’t know, young master, but I suggest we go. He… must…” Kurogiri’s voice goes low, and Shigaraki \n\nblanches\n\n before jerking his head down in a short nod, and then they-- they \n\ndisappear.\n\n \n\n \n\nRight back into the warp gate they go, as do the villains around them. \n\n \n\nIzuku stares, unseeing, at the space on the dance floor the warp used to occupy, One for All still flitting through his veins, and then turns to his classmates, shocked. \n\n \n\n“What the hell was that, Midoriya…?” Sero voices in the space of complete silence, as pale-faced as the rest of them. Izuku shakes his head, feeling like he might faint. \n\n \n\nInstead, he turns and throws up all of the expensive seafood he’d eaten into the nearest trash can. \n\n \n\n~~~\n\n \n\n“Since you problem children can’t seem to go a day off campus without somehow getting attacked by villains, we’ll be holding what was supposed to be a field trip for you all here, at UA.” Aizawa-sensei says some days later, to the dismay of Class 1-A. \n\n \n\n“It’s a dance,” he says once everyone has shut up again, and then there’s another uproar, because UA was supposed to have a yearly dance already and everyone had gotten rather depressed about it being cancelled but now it was being held again, that was cool, but they’d been ready for the field trip too, so--\n\n \n\n“Calm down,” Aizawa-sensei barks, eyes flashing red, and they do. \n\n \n\nThey have three days before the school-wide dance, and Izuku is getting caught in the waves of excitement permeating from everywhere-- rumor is that one of the gyms have already been repurposed, and everyone knew how large those gyms were. \n\n \n\nIzuku forgets all about Shigaraki Tomura, which he did not think was an accomplishable feat, and decides to wear the same outfit nearly to the letter, affixing his father’s watch on his wrist with careful care. The only difference is his tie and his dress shirt. \n\n \n\nHe still can’t tie his damn tie, this one a deep green to contrast with his white dress shirt, and he wonders distractedly how his father had done it for his job so often if he had the same amount of trouble. \n\n \n\nEventually, he just foregos the tie and throws it over his shoulder, and then wanders the halls looking for Shouto to tie it for him. He runs into Aoyama, who swipes his hair to one side with gel, and with the undercut it actually doesn’t look awful, so he continues on. \n\n \n\nThe only remark he gets from Shouto is that he has freckles even on his forehead, and then he ties his tie for him as always. They head down to the gym together, and Izuku can’t help but be excited. \n\n \n\nIt’s hectic in the gym-- soon they’re all dancing themselves exhausted, and no one, to Izuku’s embarrassment, reused their outfit from the last Gala. \n\n \n\nWell, he doesn’t quite mind-- he’s not using the same tie or shirt, and this suit is somewhat sentimental to him, even if it’s one of only two he owns. No one particularly cares, and Uraraka does tell him he looks nice with an airy giggle and a pat to his curls. \n\n \n\nAt one point, he sees Shinsou and waves cheerily, hoping he’s enjoying himself in 1-B. \n\n \n\nMirio-senpai, Nejire-san and Amajiki-senpai are all there as well, and Eri-chan is here too, grinning even wider then she did in the Culture Festival from what seemed like ages ago. \n\n \n\nEventually, he’s sent to grab water bottles for everyone and walks over to the refreshments, glad his hair is out of his face-- at least one side. \n\n \n\nOf course, it’s then when he notices the dark silhouette in the corner by the changing rooms and feels the need to go investigate, and come upon a very restless Shigaraki Tomura. \n\n \n\nThe man straightens up when Izuku walks over to him, Quirk blazing, unafraid. If he’d wanted to kill everyone here, he’d have come with backup. \n\n \n\n“What do you need from us, Shigaraki Tomura? Come to try to kill All Might’s legacy again?” \n\n \n\nThe man mutters something, and Izuku raises an eyebrow. “Pardon?” \n\n \n\n“You aren’t All Might’s legacy,” Shigaraki snarls, and Izuku stares at him, perturbed. “You’re someone else’s.”\n\n \n\n“Oh?” Now he’s confused. \n\n \n\n“How do you know \n\nhim?\n\n” Shigaraki says, clearly disturbed, and Izuku figures that they aren’t talking about All Might anymore, unless Shigaraki really has gone off the deep end. \n\n \n\n“Who?” \n\n \n\nShigaraki’s eyes focus on the watch and his scowl deepens. Somehow, this is the most confused Izuku has ever seen the man. \n\n \n\n“Him!” He gestures at the watch. “Him! You look like him! You dress like him, and you talk like him!” He barks, and a hand goes to scratch at his neck angrily. “Damn, damn, damn it!” \n\n \n\n“\n\nWho?\n\n” Izuku demands, now genuinely concerned. He doesn’t have a stalker, does he? \n\n \n\nShigaraki meets his eyes and yanks him up by the collar viciously, studying his face. \n\n \n\n“\n\nSensei,\n\n” he hisses, and then abruptly releases Izuku, who stumbles back a step. \n\n \n\n—What. \n\n \n\n“Kurogiri,” Shigaraki mutters, and a warp opens in front of him. “Damn.” He turns and sneers at Izuku. “I may not be able to hurt you, but I will make your friends’ lives \n\nshort and miserable,\n\n” he hisses in anger, before stepping through the portal. \n\n \n\nIzuku stares after him, shell shocked. It was a coincidence, an utterly sick coincidence. \n\n \n\n\nHe looked like All For One? \n\n\n \n\nFor a moment, Izuku is unfathomably irritated that he’s just been compared to someone who resembles a baked potato until he remembers that he hadn’t always looked like that. \n\n \n\nSurely he didn’t have a similar \n\nface, \n\nright? The thought gave him goosebumps, because that was almost too much of a coincidence, what with All for One creating One for All. \n\n \n\nSeeing as Izuku can’t find any other villains around the perimeter, he decides to just enjoy himself for the rest of the evening and puts the thoughts out of his head. \n\n \n\nHe dances with everyone, eats himself sick and surreptitiously avoids the punch Kaminari had definitely put something in. \n\n \n\nWhen it’s time, he accompanies Aizawa-sensei to drop Eri-chan off, because she still doesn’t trust everyone else and she has a checkup in the morning. She talks to him excitedly all through the car ride, and Izuku catches Aizawa-sensei smiling more then once. \n\n \n\nAt one point, she leans over to him conspiratorially, beckons him to come down by her ear. \n\n \n\n“Want to hear a secret?” She asks, as if it’s the most important thing in the world, and Izuku smiles at her antics. It’s nice she’s finally getting to enjoy her childhood. \n\n \n\n“Sure, Eri-chan! I guess Aizawa-sensei can’t hear then, huh?”\n\n \n\nEri-chan shakes her head solemnly. “He’s a grown-up Hero. The man said I can only tell baby Heroes!” \n\n \n\nIzuku blinks, something uncomfortable settling in his gut. \n\n \n\n“...Eri-chan, what’s the secret?” \n\n \n\n“A man who looked like a melted crayon popped into my room one day! Like… pop!” Eri-chan whispers, her hands going out in a booming shape. \n\n \n\nIzuku feels cold. \n\n \n\n“And then he asked me to rewind him a loooong way back! It was so weird because I thought I would hurt him, but we just kept going back! And then he had silver hair after no hair at all! And then it was black!” Eri-chan says, and beams up at Izuku. “And there’s one more part of the secret, but I can't tell you that!” \n\n \n\n“What did he tell you, Eri-chan?” Izuku asks, no longer whispering, staring down at the little girl with horror. “You can tell me,” he says with a wobbly attempt at a grin. \n\n \n\n“He told me his name! But everyone else calls him something weird, like… sensei?” Eri-chan’s face screws up and Izuku looks up to Aizawa, who hasn’t heard a word. \n\n \n\n“There were only a few words but they were weird-sounding!” She continues to babble, and the ease vanishes from Aizawa-sensei’s face when he catches Izuku’s eyes in the rearview. \n\n \n\n“Um… Eri-chan…” Izuku raises his voice so that Aizawa-sensei can hear as well. “Was that man you met called All For One, by any chance?” \n\n \n\n“Mhm! That’s the one! How’d you know, Deku-kun?” Eri-chan asks, and Aizawa-sensei swerves the car to the side of the road, slamming on the brakes so violently they all jerk forward in their seats. \n\n \n\nWhen he turns around in his seat, however, his face is completely calm. \n\n \n\n“Sorry, Eri, but could you repeat that for me?” \n\n \n\n~~~\n\n \n\nThey end up spending a lot of extra time at the hospital, until Aizawa-sensei ushers Izuku out and someone drives him to the dorms. \n\n \n\nHe stumbles in and stares at the common room, where almost all of his class is watching a movie together. \n\n \n\nThey take in his haggard face and unchanged clothes and send him upstairs to change. \n\n \n\nOnce he has on his most comfortable clothing he comes back down the stairs, phone in hand, and they sit him in the middle, someone playing with his scarred hand. He deigns to keep the watch on, fiddling with it absentmindedly, knowing at some point his dad had worn it and taking some comfort in that. \n\n \n\nThere’s quiet chatter and exhausted blanket-snuggling, and Izuku lets out a quiet breath of relief, letting all of the strange occurrences fly away as he watches animation and sings along to every song half-consciously. \n\n \n\nAnd then his phone buzzes, and he makes the mistake of looking down at it. \n\n \n\n“Aizawa-sensei…” he says, and feels the people around him turn and look at him in confusion. \n\n \n\nHe’s already opening the text, and when he sees photos of grainy CCTV he drops the phone. \n\n \n\n“Deku-kun?” Uraraka asks, obviously concerned, as Izuku’s head fills with static. \n\n \n\nHe bends over and picks up the phone again, stares and zooms in on the video. All For One walks into Eri’s room, and a young man walks out. \n\n \n\nA young man with amber eyes, freckles and curling, black hair in an undercut, in a black Yaoyorozu suit with an impeccable black tie and a lilting, self-assured smirk walks out, the spitting image of Izuku… or perhaps the other way around. \n\n \n\nAs if he’s daring the cameras to do something, he turns and looks straight up, bringing his arms out to the side in a grand gesture, palms up. The watch face he’s wearing is visible for a split second, a carbon copy of the limited edition Rolex from over a hundred years ago that Izuku was wearing on his own wrist.\n\n \n\nIn walks All For One, out walks Midoriya Hisashi. \n\n \n\n“Oh dear,” Izuku whispers. \n\n \n\n\n...No wonder people gave me such strange looks in that suit. \n\n\n\n\n\n\nTHE END. \n"
}