{
    "id": "24941116",
    "url": "https://archiveofourown.org/works/24941116?view_full_work=true",
    "author": [
        "aloneintherain"
    ],
    "title": "if you see the boy i used to be",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Class 1-A & Midoriya Izuku",
        "Midoriya Izuku & Yagi Toshinori | All Might"
    ],
    "characters": [
        "Midoriya Izuku",
        "Aizawa Shouta | Eraserhead",
        "Yagi Toshinori | All Might"
    ],
    "additional_tags": [
        "third year class 1a",
        "Parental Yagi Toshinori | All Might",
        "Temporary Amnesia",
        "References to Past Bullying",
        "everyone drinks their loving midoriya izuku juice",
        "Fluff"
    ],
    "language": "English",
    "series": "",
    "published": "2020-06-27",
    "completed": null,
    "words": "5,158",
    "chapters": "1/1",
    "comments": "488",
    "kudos": "18,650",
    "bookmarks": "3,655",
    "hits": "102,064",
    "summary": "<p>“Where are we?” Izuku asks, throat tight. </p>\n<p>Aizawa glances at him. “UA.”</p>\n<p>Izuku stops. He looks back down at the forest-green suit and the cape fastened around his neck, and swallows, barely daring to believe it. “And I’m...”</p>\n<p>“You’re a third-year student here,” Aizawa says without inflection, like he’s not completely shattering Izuku’s world-view. “In the hero course.”</p>\n<p> </p>\n<p>Or: After a training accident, Izuku forgets everything that happened after his second year of middle school.</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>You can find me on tumblr at <a href=\"https://captainkirkk.tumblr.com/\" rel=\"nofollow\">captainkirkk</a>.</p>",
    "text": "Izuku wakes with a groan. The sun glares down directly overhead, and he has to shut his eyes tight to stop them from burning.\n“Midoriya,” a rough voice says, “are you alright?”\nIzuku grits his teeth and pushes up onto his elbows. Experience has taught him how dangerous it can be to stay down when he’s disorientated. The sooner he’s not at direct kicking level, the better.\nSeveral hands grab him. Izuku flinches back, raising his hands to cover his face, but they don’t hurt him or shove him back down. Instead, Izuku is gently helped to his feet. He blinks around in surprise.\nA pink-cheeked teenager peers up at him, clearly worried. Beside her is another girl with webbed gloves, and a boy with a lightning bolt through his fringe, and a younger teenager who looks on the verge of tears. An older man, greying at the temples, eyes blood-shot and exhausted, stares flatly at Izuku.\nHe doesn’t recognise any of them.\nThe younger teenager sniffs. “I’m so sorry, Midoriya-senpai. I saw you coming towards me and I just panicked. I shouldn’t have used that much power.”\nThere’s a pause, as if everyone is waiting for Izuku to say something. Midoriya-senpai. Is that him? He doesn’t know this teenager. The boy is dressed in white body armor. A costume.\nThey’re all wearing costumes, he realises. They must be hero students. But why would hero students bother talking to him?\nThe severe man steps forward, staring at him intently. “Midoriya. Talk to me.”\n“Um,” Izuku says, looking around. He’s in the city—or at least he thinks this the city. There aren’t any civilians or cars, and all the buildings seem abandoned and damaged.\nHis head throbs. He can’t make sense of this. He takes a step back, trying to orientate himself, only to trip. On a cape. The long white cape he’s currently wearing.\nHe looks down, and discovers that he’s wearing a dark green bodysuit, gloves, kevlar, and his trusty red shoes, transformed into steel-capped boots.\nA hero costume. He’s wearing a hero costume.\nIzuku picks at his cape. “Wh—What is this?”\n“Finally noticed it was hideous, did you?”\nIzuku looks up. That voice is too gruff, and the teenager is too tall and too broad, but Izuku would recognise Bakugou Katsuki anywhere.\n“Kacchan?”\n“Still with us, nerd?” Kacchan asks, arms crossed over his chest.\nHe’s wearing a mask and grenades are strapped to his wrists. It’s definitely him, but he looks far too old to be the Kacchan he remembers.\nIs this some kind of fever dream? It must be. Maybe Kacchan shoved him too hard and he toppled down the stairwell and cracked his head open.\n“What happened?” Izuku asks.\nThe severe man frowns. “What do you remember?”\n“I-I don’t know. I was in class and then… then I woke up here. Where are we?”\nThe younger teenager starts crying properly. “I’m so sorry, Midoriya-senpai.”\nIzuku tries to make sense of that. The only thing that manages to stick in his mind is: “Senpai?”\nThe boy is talking to him, isn’t he? He must be.\n“I’m sorry,” Izuku continues, “but do I know you?” He glances at the assembled crowd. They’re all watching him. It makes his skin crawl. “Any of you? Ah, aside from Kacchan, I suppose. But then … what happened to Kacchan?”\nKacchan scowls. “What’re you talking about?”\n“You’re so big. And the way you’re dressed… you look like a hero, Kacchan. A proper hero. When did that happen?”\nThere’s a moment of silence. Then the one adult among them sighs. If possible, he looks even more exhausted. “Why can’t we have one normal week? Just one. That’s all I want.”\n“This is fairly normal for us,” says the pink-cheeked girl.\n“Right.” The teacher rubs at his temples. “Midoriya, come with me.”\n \n \n \n \nThe student—his kohai, apparently—had hit him full-on with his quirk. A memory-erasing quirk. It would pass, they told him. His kohai didn’t even know he could erase such a large chunk of memories at once, until he saw Izuku coming at him and adrenaline had turned his quirk up to 110%.\nNo one has ever been scared of Izuku. It doesn’t feel real.\nNone of this feels real.\nThe adult that looks as though he hasn’t slept in days escorts him to the nurse’s office. He’s supposedly Izuku’s teacher, but he actually cares about the bruises blooming across Izuku’s skin, and helps him up when he stumbles, and doesn’t scold Izuku when he doesn’t know something. In Izuku’s experience, teachers aren’t like that. They aren’t this kind.\nThey pass several clusters of students on their way out of the training facilities. Each group calls out to him. Wishes him well. Waves him off.\nIzuku’s face feels red-hot at the attention. Their teacher, Aizawa, just reminds the students to behave and leaves a strict, blue-haired boy in charge.\nThey wind their way out of the replica city. Izuku takes in the facilities peppering the campus, the manicured lawns and hedges, the four-tiered building looming in the distance like a beacon.\n“Where are we?” Izuku asks, throat tight.\nAizawa glances at him. “UA.”\nIzuku stops. He looks back down at the forest-green suit and the cape fastened around his neck, and swallows, barely daring to believe it. “And I’m...”\n“You’re a third-year student here,” Aizawa says without inflection, like he’s not completely shattering Izuku’s world-view. “In the hero course.”\nThe words don’t sink in. How could they? How could any of this be real?\n“How?” he says. “I-I don’t… ”\nAizawa huffs a laugh. It almost sounds fond. “You managed to get your quirk under control, though it caused me a lot of trouble. I didn’t have many grey hairs before I met you, you know.”\n\nYour quirk.\n\nThis, Izuku thinks again, following Aizawa numbly across campus, can’t be real.\n \n \n \n \nAizawa leaves him at the nurse’s office. Izuku is delighted to see Recovery Girl, a famous healing hero. She doesn’t seem as excited to see him.\nShe heals his bruises with a wet kiss on the check. Then she eyes him up and down, as though trying to see if he’s hiding any injuries under his costume.\n“Come straight to me if any new symptoms appear,” she says. “Any, you hear me?” She sighs when Izuku just nods timidly. “I know this is a lot to take in, but you’ll adjust. You’re tough.”\nA hysterical laugh bubbles up his throat before he can stop it. The nurses at his elementary and middle school always called him oversensitive—for letting the pain get to him, for letting himself get hurt in the first place, for “blowing everything out of proportion.” He’s never been called tough in his life.\nRecovery Girl hands him a lollipop. It’s cherry-red. Izuku robotically takes it, unwraps it, and sticks it in his mouth.\n“You’ll be okay,” she says. “Now get out of here before your friends have to hunt you down.”\nIzuku leaves her office in a daze. Friends?\nHe thinks again that maybe Kacchan accidentally gave him brain damage. It makes more sense than anything else he’s seen today\n \n \n \n \nHe’s two floors down before he realises he has no idea where he’s supposed to be going.\nHe had woken up on the other side of campus. He has no idea how to get back there, or if he even should.\n“Ah, young Midoriya! There you are.”\nIzuku stops. A rail-thin man jogs down the hallway. He’s alarmingly gaunt and almost seven feet tall, dressed in a comfortable suit with tweed patches on the elbows. Another teacher?\nHe beams at Izuku. The knot in his chest loosens. He doesn’t know this man, but there’s something about his wide smile that makes him feel safe.\n“I heard you got into some trouble during Hero Training. Everything okay?”\n“Yes, sir,” Izuku says, pulling the lollipop out of his mouth. “Recovery Girl dismissed me, but I, uh. I don’t know where...”\nThe man stops. Frowns. Puts a broad hand on Izuku’s shoulder and turns him so he’s looking at him straight-on.\nHis voice softens to a murmur. “Izuku? Tell me what’s wrong.”\nIzuku stares hard at his boots. They’re bright red, like armoured versions of his sneakers. The only part of this strange world that he recognises.\n“I’m sorry,” Izuku says, shoulders hunched, “but I don’t remember you. Something happened and… I don’t remember anything.”\nThe hand tightens on his shoulders. “What? What do you mean?”\nIzuku shrugs, spinning the lollipop compulsively between his fingers. “I remember the first two years of middle school? But being at UA, being a hero student… I don’t remember any of this.”\nIzuku peaks up at the man from under his fringe. He’s gone pale, and looks like he’s going to kneel over. Blood beads at his lips.\n“S-sir?” Izuku waves his hands in the air, almost smacking himself in the face with the lollipop. “It’s okay, really! Recovery Girl says it’ll wear off by tomorrow night. Maybe you should sit down?”\nThe man coughs into his palm, and when he pulls his hand away, Izuku sees it’s slick with blood. That just makes him panic more.\n“Midoriya,” he says, smiling faintly. “Calm down. I’m just surprised. You really don’t remember me?”\nIzuku winces. “No. I’m sorry, sir.”\n“No need to apologise, my boy. It’s not your fault. Sounds like a simple training accident.” The man wipes his mouth and hands with a handkerchief. When the blood is gone and he looks less like he’s going to collapse, he smiles. That smile is just as blinding as the first time Izuku saw it.\n“I’m Yagi Toshinori,” he says. “I’m your teacher. We’ve known each other for—well, for a long time now, even if you don’t remember it.”\n“It’s nice to meet you, sir,” Izuku says, bowing. “Aizawa-sensei said I caused him a lot of trouble. I’m sorry if I’ve caused issues for you in the past.”\nYagi laughs, a belly-deep sound that startles Izuku. Such a thin man shouldn’t be able to produce that kind of noise.\n“You’ve definitely caused your share of problems,” Yagi says, “but what hero hasn’t gotten into trouble as a student? It’s how I knew you would be brilliant, my boy.”\nYagi tousles his hair, and Izuku smiles so wide he accidentally bites his lollipop clean in two.\n \n \n \n \nYagi escorts him to the dorms. They’re as impressive as the rest of campus. There are signs of life—shoes piled at the doors, homework left on the table, blankets twisted up on an armchair like someone has built themselves a nest.\nIt makes him feel like he’s intruding, but Yagi ushers him to the sofa before he can freeze up again.\n“Here,” he says, pulling out his phone. “Call your mother.”\nIzuku flushes, shaking his head. “It’s alright, Yagi-sensei. You don’t need to lend me your phone.”\nYagi presses the phone into Izuku’s hands. “Call her. I know it’ll make you feel better, and Inko always welcomes a call home.”\nIzuku takes the phone in shock. He wants to ask why Yagi is so familiar with Mum, but the words get stuck in his throat\nYagi disappears into the kitchen, leaving Izuku alone in the spacious living room. He takes a moment just to breathe, before he presses the home button on Yagi’s phone. The screen lights up. Izuku stares.\nHe’s the lockscreen. Well, not him as he knows himself. An older Izuku. There’s flashing police lights behind him, and a bloody gash on his temple, but he’s broad-shouldered and beaming, streaked with dirt and looking so self-assured that Izuku hardly believes that the hero in the photo is him.\nJust who is Yagi Toshinori? Izuku has never had a teacher that liked him, let alone one that smiled so fondly at him, who knew his mother’s first name and had photos of him saved on his phone…\nHe numbly dials his mum’s number.\n“Toshinori?” Izuku relaxes at Mum’s voice, tension leaching from his shoulders. “Is everything okay? We just talked yesterday.”\nThere’s a lump in his throat. He swallows and says, choked, “Mum.”\n“Izuku? Baby, what’s wrong? Are you okay?”\nHe tries to explain everything, but it’s all so twisted in his head. It’s hard to believe this is all real.\nMum understands him, anyway.\n“How much do you remember?” she asks.\n“Up until my second year of middle school, then everything is just blank. They said I’m a third-year hero student. Is that—is that true?”\n“Oh, Izuku,” she says, so gentle it makes Izuku tear up all over again. “Yes. It’s true.”\n“Nothing makes sense. I’m at UA. In the hero course.” He’s dreamt of this since before he could read. Even when everyone told him to be realistic, he never gave up, but now that he’s here, it feels too dangerous to believe this could be his life. “C-Could I really …?”\n“Izuku, listen to me, okay?” Mum says, speaking slowly and clearly so he understands her. “You can. You already have, baby. You’re well on your way to being one of the best heroes the world has ever seen.”\nHe claps a hand over his mouth. His vision has gone blurry, and he thinks he’s going to shake apart, right here in the middle of these unfamiliar dorms.\n“Young Midoriya?” Yagi returns, balancing two steaming mugs. He jumps when he sees Izuku’s face. “My boy, what’s wrong?”\n“Is that Toshinori?” Mum asks. “Can I speak to him for a moment?”\n“O-Okay.” Izuku sniffs, wiping his face with his gloves. “Thank you, Mum.”\n“Don’t thank me. I should have told you that a long time ago.”\nIzuku hands the phone over. Yagi talks quietly with his mum. Izuku sips his tea and tries to make sense of the one-sided conversation. It’s not easy. There’s a lot he doesn’t know.\nHe can tell that they care about him, though. And that they’re worried.\nBy the time Class 3-A returns to the dorms, Yagi has bid his mum goodbye and hung up. Izuku curls up against the armrest, staring at the stream of students from behind his mug of tea. It’s gone cold. But he clutches it against his chest anyway, a barrier between him and these almost-adult hero students.\n“Ah, I think that’s my cue to head out,” Yagi says, patting Izuku on the shoulder. “Your friends will take good care of you. But you can always come to me if you’re feeling overwhelmed, okay?”\nIzuku nods robotically. He’s already feeling overwhelmed. But he has no idea how to say that, and he doesn’t want to inconvenience Yagi further, especially since he seems to genuinely care about Izuku. He won’t jeopardise that just because he’s terrified of the students pouring into the living room.\nWarmth lingers in the place where Yagi touched his shoulder. He can hear the hero students greeting Yagi enthusiastically as he leaves, before the students make a beeline for him.\n“Deku!” The pink-cheeked girl from earlier leans over the couch. Izuku shrinks away from her, his face prickling with heat. “Are you alright? What did Recovery Girl say?”\nA blond and another shark-toothed boy crash onto the couch beside Izuku. He shuffles away from them, careful not to spill his tea.\n“Dude,” the shark-like boy says. “We heard what happened. Sorry you got hurt.”\nA tired girl with earphones dangling from her ears laughs. “Again.”\n“Hey, it’s been a little while since he got hurt.” The blond stops. Thinks about it for a minute. “No, wait. You took a bullet for Todoroki on our last day off.”\nIzuku squeaks. “A bullet?”\nThere’s a tall boy with twin-coloured hair and a gaze so intense it makes Izuku blush even darker. He nods. “Mm. It was pretty amazing. And stupid.”\nThe crowd around him laughs. There’s so many eyes on him. Izuku squirms, feeling pinned. It’s getting hard to breath with so many bodies surrounding him, but he doesn’t know how to say anything or escape so he just tries not to look like he’s about to burst into tears.\n“Oi!” Kacchan cuts in. He glowers at the students clustered around Izuku. “Can’t you see he’s overwhelmed? He got hit by that first-year’s quirk. He doesn’t remember us.”\nThe crowd blinks in surprise.\n“You really don’t know who we are?” asks the shark-toothed boy.\n“I’m sorry,” Izuku says.\nThey introduce themselves without Izuku having to ask. So many names, so many intense personalities. It’s dizzying. Thankfully, many of them wander off to shower or eat or join their own groups. But plenty of them stay, though they’re careful not to crowd too close after Kacchan told them off.\nThey don’t grow bored of him. They don’t mock his slight stutter. They seem interested in what he has to say.\nIt’s strange. It’s wonderful. It makes his head spin.\nHis social battery runs out quickly, though. This time, it’s Tsuyu that speaks up and reminds everyone how overwhelmed Izuku must be feeling, and before he can worry about offending them, he’s being escorted up to his room by his dorm neighbour, Tokoyami.\nThe walk takes three times as long as it should, because Izuku is too curious about his quirk and how it works. Dark Shadow laps up the attention. Once Tokoyami manages to excuse himself and slip into his own room, he is alone for the first time in what feels like forever.\nHe opens his room, steps inside, and then almost falls over laughing. It’s not funny, but the sheer relief of seeing his room plastered with hero posters makes him laugh deliriously anyway.\nThis perfect life might seem like it belongs to a stranger, but this room is clearly his. From the figurines in neat rows on the shelves, to the faded All Might plushie propped up on his pillows, to the hero journals arranged numerically—this room couldn’t belong to anyone other than but Midoriya Izuku.\nScattered throughout his belongings are new things, though. Intimidating weights by the balcony. Framed photos of people and places he doesn’t remember. What look to be case files on the desk, written in code.\nHe’s at UA, and his hands are roped with scars, and he’s still wearing a cape. His head spins. He grabs his All Might plushie, stuffs it under his chin, and hopes the familiar smell of it will keep him from spiralling.\n \n \n \n \nThe next morning, things seem less overwhelming.\nIzuku pulls on the uniform hanging in the closet. Even without the tie (which Izuku has no idea how to put on), wearing a UA uniform makes him jump around the room and scream into his hands with glee.\nWhen he’s managed to calm down, he heads downstairs. Everyone greets him just as warmly as they had last night. Iida even makes a beeline for him and briskly offers to do his tie for him. For some reason, the sight of Izuku in a well-tied tie makes everyone around him cheer.\nIzuku takes a seat at the table beside his classmates. He gets tired smiles and well-wishes and questions about his still-blank memory and it feels so nice that Izuku can’t stop smiling, no matter how nervous these amazing hero students make him feel.\nUraraka promises to escort him around campus so he doesn’t get lost, and Iida offers to take notes so Izuku can catch up when his memories return. When Izuku shyly admits that he hates the bitter taste of coffee but he feels exhausted since this almost-adult body is used to regular caffeine, Momo slides him an expensive-looking coffee that tastes like melted caramel.\nIida disappears into the crowd of tired students and reappears with a towering stack of toast. Uraraka snags two and immediately starts layering on jam. Iida gestures for Izuku to take some, and then takes a seat beside him.\n“Did All Might give you any specific instructions for today?” Iida asks.\nIzuku blinks, toast frozen half-way to his mouth. He’s sure he heard that wrong. “Pardon?”\n“Yesterday afternoon, when All Might was in the dorms,” Iida clarifies. “Did he tell you what he wanted you to—”\nIzuku drops his toast. It bounces off his plate and onto the floor. “A-All Might? All Might was HERE?”\n“Well, yeah,” Kirishima says. “He’s been teaching us since first year. Didn’t he tell you that?”\nUraraka’s eyes go wide. “You didn’t know?”\nNo, he didn’t know. Being a UA student is one thing. But being All Might’s student? He feels like he’s in a dream. He’s sure he’s seen reader-insert fanfiction that went exactly like this.\nA pale hand waves in front of his face. Izuku doesn’t even blink.\n“I think you broke him,” Todoroki says.\n“Give him a minute,” Uraraka says fondly. “His brain just needs a minute to reboot.”\nIida frowns. “Midoriya, surely you knew that All Might works here. You were drinking tea with him yesterday afternoon.”\nIzuku sucks in a breath that sounds like a death rattle. “You mean Yagi-sensei? Yagi-sensei isn’t… he’s not…”\n“He’s All Might,” Todoroki says.\n“He retired two years ago,” Tsuyu says blithely. “Now he teaches at UA full-time. You and him are very close”\nIzuku puts his face in his crumb-covered hands and screams.\n \n \n \n \nIzuku staggers to the staff room, sandwiched between classmates. There had been a brief argument about how many people were really needed to escort Izuku across campus, but he had been too out of it to pay them too much attention.\nIida raps on the staff room door. Present Mic answers. The pro hero Present Mic. Izuku has been so battered by revelations over the past 24 hours that he barely even jumps at the sight of the voice hero.\n“Hey, little listener,” Mic says. “Heard you had a run in with Miyazaki’s quirk yesterday.”\n“Gah,” Izuku says intelligently. Uraraka elbows him. He shakes his head, trying to pull his thoughts together, but all his brain spits out is: “Can I have your autograph?”\n“You already have it,” Mic says. “I gave it to you in your first year. Twice.”\nThere’s a chorus of laughter from his classmates. Izuku shrinks in on himself. “S-sorry.”\n“It’s okay, man,” Kirishima says. “Most UA students feel like that at first. The hero worship takes a while to wear off.”\n“I’m pretty sure I walked around in shock for months,” Uraraka agrees.\nTheir smiles make Izuku feel calmer. Like maybe they’re laughing with him, rather than at him.\n“Are you here for Aizawa?” Mic asks.\n“No,” Uraraka says. “All Might.”\n“Oh.” Mic glances at Izuku. “Oh.” He calls over his shoulder, “Yagi, your boy is here.”\nYagi appears at the door a moment later, thanking Mic and blinking at the gathered students. His gaze zeroes in on Izuku.\n“Is everything alright?” Yagi asks.\nIzuku opens and closes his mouth. It’s hard to rectify this friendly teacher who wears jackets with elbow-patches and makes tea and calls him “my boy” with All Might.\nAll Might has always been larger-than-life. A symbol. The beacon guiding Izuku through life.\n“He didn’t know you were All Might.” Todoroki says it like an accusation.\n“Ah. I see.” Yagi glances around. “And it took six third-years to deliver him across campus?”\nTodoroki shrugs. “We wanted to see his reaction.”\n“I’m surprised he hasn’t started crying yet,” Tsuyu remarks.\n“The day is still young,” Iida says.\n“Do you think he’ll be mad that we’re filming it?” Kirishima asks, phone held up to capture Izuku’s face.\n“Who cares?” Uraraka says.\nYagi peers at Izuku’s face. When they lock eyes, Yagi pulls on a bright smile. “Alright there, my boy?”\nThe more Izuku looks, the more he can see hints of All Might. Or, at least, hints that Yagi is more than he sees. It’s in those eyes. That smile. It’s the same warm feeling he gets in his stomach when he looks at All Might, like everything is going to be okay.\n“I must have your autograph,” Izuku blurts, then reddens.\nYagi laughs. “Oh, yes. Quite a few. And I have your autograph too.”\nIzuku blinks. “My what?”\n“Your autograph. I wasn’t the first person you gave it to unfortunately. That honour belongs to young Eri and Kouta. But I do have it framed in my kitchen.”\nIzuku feels like he’s short-circuiting. “Why?”\nYagi cocks his head to the side. His expression is so soft, so fond, and it makes Izuku feel like his insides are melting. “Because you’re a hero, my boy. And I’ll always be your biggest fan.”\n“You’ll have to fight Kouta for that title,” Kirishima says.\nUraraka raises her fists, like she’s going to fight their teacher here and now. “And me!”\nYagi laughs and says they can all share the title. Izuku just stares at him, trying to work out where the catch is.\nBut then Yagi locks eyes with Izuku and smiles, so wide and reassuring and All Might, and he realises that this is real.\nEveryone laughs when Izuku bursts into tears, but it doesn’t sound mean. Uraraka rubs his back. Tsuyu offers him a tissue. Kirishima kindly stops filming.\nWhen Izuku is more composed, Yagi tells everyone to get to class. Izuku gets to stay, though. He’s ushered into the staff room, towards the sofa. Yagi lays a glass of water and a packet of slightly stale biscuits onto the coffee table, before taking a seat across from him.\n“You’ve always such a cry baby,” Yagi says, as Izuku sniffles loudly.\nIzuku glares at him from under his wet lashes, which just makes Yagi laugh.\nSoon after, a school bell chimes. The other teachers file out of the staff room, leaving them alone.\nIt should be awkward, but it’s not. Izuku is alone with All Might and he doesn’t even feel like he’s going to throw up.\nHe wonders how many times they’ve done this before. Yagi smiles at him, and automatically Izuku smiles back and reaches for a biscuit.\nA lot, Izuku thinks, certain even without his memories. They’ve done this a lot.\n \n \n \n \nWhen homeroom is finished, Yagi brings him to the Training Grounds. Class 3-A is already there, dressed in their hero costumes, all warmed up and ready to train.\n“There you are,” Aizawa says, spotting them. “Going to steal any more of my students away, Yagi?”\nYagi clears his throat awkwardly. “I’ll leave you to it, young Midoriya.”\nAizawa doesn’t let Izuku join in with the training. From the way Aizawa stares suspiciously at him, Izuku thinks he was braced for some kind of argument, but Izuku is secretly glad. He’s not even able to do a proper push-up. Or, well, he doesn’t remember being able to do a push-up.\nAnd this way he gets to shadow Aizawa and see everyone in action. It’s amazing. They’re amazing. Momo takes mercy on him and makes him a notebook and pen, so he can jot down his rapid-fire thoughts.\nIzuku hungrily watches everyone train, and then glances at Aizawa. “Can—can I…?”\nAizawa sighs. “Fine, go ahead. Just be careful.”\n“I will, I promise!” And with that, Izuku sprints after a group of classmates, a dozen questions about their quirks flying through his head.\n \n \n \n \nThirty minutes later, Izuku has reduced several classmates to tears—entirely by accident.\nKirishima noisily blows his nose. “Midoriya, you’re really manly, you know that?”\nIzuku blinks. “W-What?”\n“I would die for you, Midoriya,” Tokoyami says solemnly. Over his shoulder, Dark Shadow is still crying.\n“Please don’t!”\n“Too bad,” Uraraka says, wiping at her eyes. “I’ll die for you whether you like it or not.”\nMomo hands her another box of tissues, which Uraraka takes gratefully.\nIzuku hides his flaming face behind his notebook. “I’m sorry. I didn’t mean to make you cry. I know I can be intense sometimes...”\n“Don’t you dare apologise,” Ashido demands. “My confidence is sky-high now. When we graduate, the world won’t know what hit ‘em!”\nUraraka nods, visor still misted up. Kirishima high-fives Ashido hard enough to make her wince.\n \n \n \n \nThere’s one person in the class that isn’t eager to receive Izuku’s input. But then again, Izuku has been avoiding him too, even if his hands twitch to record all the differences between this Kacchan and the one he knows.\nTowards the end of class, when everyone has had to go back to their individual training, Izuku has his head stuck in his notebook. He walks right below a tall outcropping of rocks, just as Satou punches clean through it.\nIzuku looks up. Shards of rock rain down above him. He has enough time to think, Sorry, Mum, before someone tackles him out of the way.\nThey land hard, rolling over the packed earth. A gloved hand is braced under his head, protecting his skull. No weight is put on him. When they roll to a stop, Izuku hardly feels bruised.\nHe blinks up to see Kacchan, a thin cut along one cheek, propped on his elbows, hollering at Satou for not watching his surroundings.\n“Kacchan,” Izuku says.\nKachan tenses. He rolls off Izuku without touching him and puts several feet of space between them. “You good?” he asks, not meeting Izuku’s eyes.\n“Kacchan,” he says again. “You saved me.”\nKacchan scrubs a hand through his hair. “Yeah, well. That’s my job.”\n“You’ve saved people before. I can tell. That was really smooth.”\n“If I end up hurting the person I’m supposed to be saving, then that defeats the whole purpose of being a hero.” Kacchan swallows hard, and finally meets Izuku’s gaze. “If you hurt people that haven’t done anything wrong, then that doesn’t make you a hero. It makes you a villain.”\nIzuku blinks hard. Kacchan grimaces. “Please don’t start crying. Your bodyguards will try and skin me if I make you cry when you’re like this.”\nIzuku laughs wetly. “I don’t have any bodyguards.”\n“You’ve clearly never seen what round-face, icy-hot and four-eyes are like when you land yourself in the hospital.”\nIzuku looks at this almost-adult Kacchan, just taking him in. He’s so tall and his shoulders are filled out. He’s lost his baby face, too. With that sharp jaw and sharper eyes, mouth pulled into an almost amused, almost fond smile—he looks like the hero Izuku always knew he could be.\nIzuku flips his notebook to a clean page and holds it out in front of him. “Kacchan,” he says, forcing the words out, “can I get your autograph?”\nKacchan takes the notebook with careful fingers and then just stares at it. For a moment, Izuku thinks he’s going to blow up all of his carefully collected notes.\nThen Kacchan says, “Fine. But only if I can get yours too. Deal?”\n“Deal.” Izuku is going to start crying again. Kacchan can probably tell, but he just rolls his eyes, that same little smile on his face, and Izuku hopes that, when he recovers his memories, he’s able to remember the past 24 hours.\n "
}