{
    "id": "24954214",
    "url": "https://archiveofourown.org/works/24954214?view_full_work=true",
    "author": [
        "justyouraverageloser"
    ],
    "title": "[message redacted]",
    "rating": "Not Rated",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Minecraft (Video Game)",
        "Video Blogging RPF"
    ],
    "relationships": [
        "Clay | Dream/GeorgeNotFound (Video Blogging RPF)",
        "Clay | Dream & GeorgeNotFound (Video Blogging RPF)"
    ],
    "characters": [
        "Clay | Dream (Video Blogging RPF)",
        "GeorgeNotFound (Video Blogging RPF)",
        "Sapnap (Video Blogging RPF)"
    ],
    "additional_tags": [
        "Texting",
        "Strangers to Friends to Lovers",
        "au where they never met",
        "Eventual Romance",
        "Slow Burn",
        "Other Additional Tags to Be Added",
        "george secretly enjoys texting dream",
        "it'll get better when they get to know each other",
        "dream likes pink drinks",
        "You can't change my mind",
        "Fluff",
        "Flirting",
        "Angst",
        "Pining",
        "jealous george :0",
        "and jealous dream",
        "Confessions",
        "Established Relationship",
        "sriracha is an overused joke",
        "but i don't regret it",
        "First Meetings",
        "First Kiss"
    ],
    "language": "English",
    "series": "",
    "published": "2020-06-28",
    "completed": "2021-02-18",
    "words": "20,002",
    "chapters": "21/21",
    "comments": "1,341",
    "kudos": "6,431",
    "bookmarks": "623",
    "hits": "73,791",
    "summary": "<p>Dream gets a girl's number and thinking he hit the jackpot, texts it as soon as he gets home. Who knew it wasn't hers, and who would've ever thought he'd get attached to this person he doesn't even know the name of?</p>",
    "notes": "<p>i haven't found any gream texting fics, and that devastated me, so i decided to make my own and hope it does some justice<br>i don't actually have much plot planned out<br>just a basic idea of like one thing that's going to happen, so hopefully, this doesn't flunk lol</p>\n<p>also the times are in florida time, so just remember george is 5 hours ahead :) (i think)</p>\n<p>like every other fic, this is a work of fiction, hence the name fanfiction, and it's for entertainment purposes.</p>\n<p>now that all of that is out of the way, i hope you enjoy!!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">more notes</a>.)\n</p>\n<p>i'd appreciate it if i could get some feedback on the way i formatted it! i tried to make it look somewhat aesthetic and nice, but i'm not sure if it turned out good enough;;</p>\n<p>just to clarify, the strikethrough means that they typed it out then deleted it, whether it be a whole message or just a few words</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>i have gotten a lot more love on this than i expected to get<br>and<br>i'm honestly in shock<br>thank you guys so much ;w;<br>i really appreciate it<br>and it gives me more motivation than i ever deemed possible<br>it's thanks to you wonderful people that i haven't already given up on this like i thought i would, so thank you so so so much &lt;3333</p>\n<p> </p>\n<p>also i came up with that pickup line on the spot, and i am honestly super proud of it</p>\n<p>so we're going to pretend the name alyssa was on purpose :))<br>just so that everyone knows, i have nothing against her, and i promise she's not even a bad character in this story<br>she also isn't even going to be mentioned again until the very end<br>so there's that</p>\n<p>sorry this chapter took so long to get out<br>for whatever reason it was kind of hard to write, and i kept getting distracted</p>\n<p>but anyways<br>i hope you all are having a good day, and enjoy the chapter :)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">more notes</a>.)\n</p>\n<p>OH ALSO WE HIT TRIPLE DIGITS FOR KUDOS, AND THAT'S SUPER CRAZY TO ME!!!!<br>THANK YOU ALL SO MUCH, YOU DON'T KNOW HOW MUCH I APPRECIATE EVERY SINGLE ONE OF YOU FOR READING THIS!!!! &lt;33333333<br>and we're so close to 1000 hits like i'm gonna die when that happens oml</p>\n<p>i completely forgot to mention this in the last chapter but<br>CONGRATS TO DREAM FOR 4 MIL AND GEORGE FOR 1 MIL!!!<br>i'm so proud of theM<br>they're all grown up :,)</p>\n<p>WE DID IT<br>1000 HITS<br>AND 200 KUDOS<br>THIS IS ABSOLUTELY CRAZY, THANK YOU ALL SO MUCH<br>MY MIND<br>IS BLOWN</p>\n<p>take this filler chapter that's two times longer than usual as my thanks for all the support &lt;33333<br>(i apologize if there's any formatting mistakes in this chapter, i'm really tired)</p>\n<p>i apologize that this chapter is kind of short! it's a really important chapter and turning point for one of them, so i wanted it to be by itself. i'm planning on the next chapter being the start of the main plot, but i'm not 100% sure yet, so we'll see :)</p>\n<p>it's finally here</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_8_endnotes\">more notes</a>.)\n</p>\n<p>the end :)</p>\n<p>AHHAAIHIAHIAHFIEWUHFWIUFEHWIUFH<br>in the words of our lord and savior dreamus christ YOU JUST GOT PRANKED I'M GONNA P E E MYSELF</p>\n<p>you guys made me laugh SO MUCH that i'm pretty sure my life span increased by 1000 years</p>\n<p>it was really fun</p>\n<p>but anyways<br>did you guys REALLY think i'd have the audacity to end it there?<br>i absolutely HATE sad endings, so i could never bring myself to write one<br>hurt/no comfort is cursed, get that shit away from me i don't want it D:&lt;<br>also, it would be stupid if it ended there<br>because that was only the beginning ;)</p>\n<p>i have no idea how much longer this fic is going to go on but it's probably going to be at least 3-4 more chapters, most likely more depending on how they turn out and any other ideas i may have so don't worry &lt;3<br>ALSO SOMEHOW WE ALREADY HIT 300 KUDOS AND 2000 HITS LIKE Y'ALL CRAZY<br>ew i just used y'all someone kill me<br>BUT TYSM YOU'RE ALL AMAZING AND DESERVE THE WORLD &lt;333333<br>if you're still pissed at me tho that's fair :( i deserve it lmao</p>\n<p>OKAY THIS IS THE LAST TIME I'M GOING TO SCREAM ABOUT ACHIEVEMENTS<br>i reached most kudos out of the dreamnotfound fics under the minecraft fandom!!<br>this is INSANE to me, and i wouldn't have been able to do it without you guys!!!!<br>like seriously, thank you &lt;3333<br>i probably won't stay up there for long, but i'm enjoying it while i can haha</p>\n<p>i didn't even realize that one of the days would fall on july 4th ieufhifeuh but it's fine, i used it to my benefit &gt;:P</p>\n<p>this is my favorite chapter by far ewufhfwie<br>grab a snack before you read this<br>it may be short, but there's a lot packed in this chapter, and it's kinda emotional</p>\n<p>everything going on rn is crazy;;</p>\n<p>also, stay tuned for chapter 14 :D it's already finished, so i'll post it sometime soon</p>\n<p>imagine if i did a chapter with sapnap</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_14_endnotes\">more notes</a>.)\n</p>\n<p>it physically hurt me to write such bad grammar :,(<br>also i genuinely don't like this chapter (which sucks because i've been planning to do this for a while, but it felt kind of unnatural, especially with the fact that i made it sound like clay already knows he has a super huge crush on george but like idk man)<br>if you guys don't like it, i'll delete it or rewrite it or have them talk about something else :)</p>\n<p>oops my finger slipped</p>\n<p>so since a few people asked/guessed wrong as to what the deleted message said, i will explain!<br>basically in the text, george was admitting that knowing that clay was giving his attention to sapnap rather than himself made him pretty jealous<br>if he had kept that and continued texting afterwards without realizing how weird that sounded, he would have most likely ended up letting it slip that he's kind of totally head over heels for clay<br>it could've been a confession chapter<br>but it wasn't 🙃</p>\n<p>besides that<br>uhh<br>i'm sorry for hurting everyone last chapter, so have this to make up for it :D</p>\n<p>i've been building up to this for 16 chapters<br>here we go-</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_18_endnotes\">notes</a>.)\n</p>\n<p>i know i said i wasn't going to do a chapter where george and sapnap talk since it doesn't fit the flow but i just HAD to;;</p>\n<p>HI OMG I HAVEN'T UPDATED THIS IN 4 DAYS I'M SO SORRY;;;</p>\n<p>just in case anyone gets confused, the time changes to the london time zone when dream lands so that the time isn't wack and confusing :)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_19_endnotes\">more notes</a>.)\n</p>\n<p>and since i can't exactly write the meetup without breaking the texting format i'm just gonna confirm that dream did in fact pick george up and spin him around when they hugged<br>and then<br>kissed him 😳</p>\n<p>HOW LONG HAS IT BEEN??<br>TWO <b>ENTIRE</b> MONTHS???</p>\n<p>i'm so sorry i'm such a bad person<br>i lost interest too fast in this fic<br>i recently got sick, however<br>and got hit with a batch of inspiration<br>so here we are<br>the final chapter of [message redacted] (plus an epilogue that'll come later)<br>enjoy ;)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_20_endnotes\">more notes</a>.)\n</p>\n<p>fin :)</p>\n<p>yo ✌️<br>i can finally sleep at night knowing that this is finished :,D</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_21_endnotes\">more notes</a>.)\n</p>\n<p>was about time for me to post the epilogue, yeah?<br>everyone's probably lost interest at this point, but i finally got it the way i wanted (and yet i'm still super unsure about it ughhh)<br>now that i've done this, i can officially say this is the first multi-chapter fic that i've finished</p>\n<p>it was really fun (whenever i actually worked on it haha), and it made me super happy to read all your comments and see that while i enjoyed making it, you enjoyed reading :)</p>\n<p>i hope the epilogue was worth the wait, and it feels so free to finally be <i>finished</i> (even though it's technically been finished...i don't know if the epilogue counts)<br>that being said, have a great day, and thank you for reading [message redacted]!!</p>",
    "text": "\n\njune 4th, thursday\n\n\n\n1:23 pm\n\n \nd: hey Alyssa!\nd: it’s Clay :)\n[read 1:42 pm]\n \n\n1:50 pm\n\n \ng: sorry you have the wrong number\nd: what?!\nd: I swear I put it in right D:\ng: well you didn’t\ng: i’m not alyssa\nd: hm..\n \n\n2:01 pm\n\n \nd: are you sure?\ng: last time i checked, my name wasn’t alyssa\ng: i doubt it is now\nd: okay, okay, sorry.\n \n\n2:09 pm\n\n \nd: do you maybe know an Alyssa?\ng: nope\n \n\n2:15 pm\n\n \ng: i looked up your area code\ng: what are you doing texting someone all the way across the ocean?\nd: she said she recently moved to Florida from out of the state and hasn’t gotten her area code changed yet :(\ng: sounds like she baited you lol\nd: do you think so?\nd: maybe she did…\nd: I don’t think she would, though!!\nd: she seemed nice\ng: you never know\ng: i hear people from florida are crazy\nd: I’m not crazy\ng: i’m gonna need more convincing of that\n \n\n2:26 pm\n\n \nd: where do you live?\ng: why would i tell you that?\ng: you’re probably a serial killer\nd: I didn’t mean it like that\nd: London, right?\ng: yup\nd: isn’t it cold there all the time?\ng: isn’t it hot there all the time?\nd: fair enough.\n \n\n2:43 pm\n\n \nd: what’s your name, then, if you aren’t Alyssa?\n[read 2:43 pm]\n \n\n3:04 pm\n\n \nd: if you aren’t going to tell me, I’ll just call you Alyssa\n[read 3:04 pm]\n \n\n3:12 pm\n\n \nd: Alyssaaa\ng: no wonder she baited you\ng: you’re really annoying\nd: That’s not very nice :(\nd: I’m so hurt\nd: I’m crying\ng: lol\nd: :,(\ng: :)\n \n\n3:20 pm\n\n \nd: seriously, what’s your name?\ng: why do you need to know?\nd: so I can change your contact from ‘not Alyssa’\nd: plus I don’t want to think about you as ‘not Alyssa’ for the rest of my life\ng: too bad\ng; i’m gonna think about you as ‘annoying alyssa obsessed clay’ for the rest of my life\ng: so deal with it\nd: aww, you’re going to think about me for the rest of your life?\nd: that’s sweet ^^\ng: ...\nd: haha, are you flustered?\ng: no\n \n\n3:32 pm\n\n \ng: you’re annoying\nd: if I’m so annoying, then why are you still texting me?\n[read 3:33 pm]\n \n\n3:45 pm\n\n \nd: wait I’m joking, come back\n[read 3:45 pm]\n \n\n3:59 pm\n\n \nd: not Alyssa :(\n[read 4:00 pm]\n \n\n5:06 pm\n\n \ng: hey what’re you doing rn\nd: I’m eating\nd: why?\ng: wait sorry wrong person\nd: …:(\n \n\n5:11 pm\n\n \nd: isn’t it late there?\ng: yup\ng: but it doesn’t matter\ng: my sleeping schedule is weird because of my job\nd: I see\nd: where do you work?\ng: that’s classified\nd: please don’t tell me you’re like an FBI agent or something\ng: i’m not\nd: good\ng: what would be so bad about me being an fbi agent?\ng: what are you, a criminal?\nd: maybe~\ng: interesting\ng: i’ll make sure to tell the other fbi agents to keep an eye on you\n \n\n5:45 pm\n\n \nd: are you a girl or a boy?\ng: that’s for me to know and you to find out\nd: that sounds…\nd: kind of sexual, not gonna lie haha\ng: aaand i’m out\nd: wait\nd: at least tell me how old you are\nd: I want to make sure I’m not talking to a 16 year old or something\ng: …\n \n\n5:52 pm\n\n \ng: i’m older than 20\ng: but younger than 30\nd: okay, good.\ng: what about yuo\ng: you*\nd: I’m 20\ng: lol young\nd: I bet you’re not that much older than me\ng: idk\ng: am i?\nd: now you’re the one being annoying\n[sent 5:53 pm]\n \n\n9:27 pm\n\n \ng: right\ng: that makes total sense\nd: where did you go for two and a half hours?\nd: I thought you fell asleep\ng: working\nd: at 2 AM?\ng: yup\nd: it’s late, go to bed\ng: why do you care when i go to bed?\ng: you literally don’t even know me\nd: but I could ;)\n[read 9:29 pm]\n \n\n9:55 pm\n\n \ng: you’re weird\nd: why, thank you~\n[read 9:55 pm]\n \n\n10:09 pm\n\n \ng: you know what\ng: i’ll go to bed just so i don’t have to listen to you being annoying\ng: gn\nd: goodnight :)\n[sent 10:10 pm]\n\n\njune 5th, friday\n\n\n\n10:48 am\n\n \nd: heyyyy~\ng: leave me alone\nd: aww, don’t be like that, not Alyssa!\ng: stop calling me that\nd: then what am I supposed to call you?\ng: you could just stop texting me\nd: you know you enjoy talking to me!\ng: nope\nd: you’re no fun :(\n \n\n12:31 pm\n\n \nd: what’re you up to, not Alyssa?\ng: now you’re just trying to annoy me\nd: I don’t know what you’re talking about :)\ng: k\n \n\n12:43 pm\n\n \nd: you never answered my question D:\ng: i’m making myself dinner\nd: oh, yeah, right\nd: I forgot it was dinner time there haha\ng: isn’t it around lunch there?\nd: yeah\ng: have you eaten yet?\nd: I knew it!!\ng: what?\nd: you do care!!!\ng: no, i don’t\ng: i was literally just asking a question\nd: to answer it, yes, I have eaten :)\nd: although it wasn’t very healthy\nd: since I was too busy to make anything\nd: I just went through the drive thru of a McDonald’s not very far from my apartment\ng: if you’re so busy, why are you talking to me?\nd: because it’s more fun than what I’m busy doing\ng: ..what exactly are you doing?\nd: well I guess it wouldn’t hurt to tell you\nd: I’m coding something\ng: like a game or..?\nd: actually, it’s a plugin for a game\ng: i see\n \n\n12:55 pm\n\n \ng: i do that too\ng: code plugins\nd: what a coincidence!\nd: for what game?\ng: it’s stupid\nd: I can guarantee it probably isn’t\n[read 12:56 pm]\n \n\n1:23 pm\n\n \ng: sorry, i’d rather not tell you\ng: i like this how it is\ng: barely knowing anything about each other\ng: it just feels more free, i guess\ng: you can’t judge me\ng: and i can’t judge you\nd: I understand how you feel\nd: you don’t have to tell me :)\ng: thanks :)\n \n\n5:20 pm\n\n \ng: hey\ng: i’ve decided\nd: decided what?\ng: since it’s obvious you’re not going to leave me alone anytime soon\ng: i’ve come up with something better you can call me rather than not alyssa\nd: oh?\nd: what is it?\nd: also, if you really do want me to stop texting you, I will, and we can go our separate ways\ng: no no i like talking to you it’s not that bad i guess\ng: it gives me something to do\ng: so\nd: see~\nd: I’m not that bad~\ng: shut up\nd: can’t do that, we’re texting\ng: i revoke what i said\ng: talking to you is the worst thing in the world\nd: ;)\nd: anyways, what is it you want me to call you?\nd: also for your information, not Alyssa is a great name\ng: no\ng: it really isn’t\nd: stop insulting me and my creativity and just tell me\ng: 404\nd: you want me to call you ‘404’?\ng: yes\nd: what exactly is the motivation behind this nickname?\ng: it’s like\ng: 404 not found\nd: oooh ok\nd: I must admit\nd: that’s pretty smart lol\nd: and cute ;)\n[read 5:26 pm]\n \n\n7:46 pm\n\n \nd: I was joking\n[sent 7:46 pm]\n \n\n8:23 pm\n\n \nd: 404 :(\n[sent 8:23 pm]\n \n\n\njune 6th, saturday\n\n\n\n3:10 am\n\n \nd: I know you’re probably asleep, but I just wanted to say that I’m sorry if I went too far and made you uncomfortable\nd: I promise it was just a joke\nd: and I’ll stop saying stuff like that if you want me to stop\nd: please...I don’t want to lose the only person I have to talk to\n[sent 3:11 am]\n \n\n5:06 am\n\n \ng: hi\ng: i was really tired last night and passed out earlier than usual\ng: sorry for making you worry that you did something wrong\ng: i do admit that i didn’t know how to respond at the time\ng: but it didn’t make me uncomfortable or anything\n \n\n9:24 am\n\n \nd: oh thank god\nd: I thought I scared you away or something\nd: that’s a relief to hear, though\nd: if I ever do go too far, please don’t hesitate to tell me\ng: i doubt you will\ng: you’re just annoying lol ;)\nd: haha, very funny\ng: morning btw\nd: good morning!\ng: how’d you sleep\nd: horribly. I couldn’t fall asleep because I was too busy thinking I fucked up good!! what about you?\ng: same. i slept like a rock lol\nd: that’s good to hear :)\n \n\n2:47 pm\n\n \ng: random and kind of awkward question\ng: but\ng: what exactly are we?\n \n\n2:52 pm\n\n \nd: what do you mean?\ng: like are we friends\ng: or\nd: ohhh\nd: we can be whatever you want\nd: friends\nd: acquaintances\nd: strangers\ng: hm\n \n\n3:00 pm\n\n \ng: what about people we can escape to?\ng: like\ng: share our problems with\ng: since we don’t know each other\ng: just a free place to talk\ng: without having to worry about it affecting our real lives\nd: so strangers with benefits?\ng: what the hell\ng: i hate it\ng: but it’s true\nd: ;)\ng: then i guess that’s what we are\ng: strangers with benefits\nd: it’s official\nd: you’re stuck with me :)\ng: not necessarily\ng: let’s make an agreement\nd: ..what kind of agreement?\ng: no attachments\ng: no ties\ng: if either one of us wants to stop this\ng: we’ll both delete the other’s number\ng: that way, it’ll make this feel safer\ng: i guess\ng: is that okay?\nd: sounds good\nd: I look forward to talking to you more\ng: you too, clay\ng: no matter how bothersome you may be\ng: :)\nd: ;P\n[read 3:06 pm]\n\n\njune 7th, sunday\n\n\n\n11:06 am\n\n \nd: hey\nd: I don’t know why I needed to tell you this, but I’m going to anyways\ng: what is it?\nd: so I’m on my way to a Starbucks right now that’s like a block away from my apartment\nd: and I was struck with a thought\ng: you aren’t driving, are you?\ng: texting while driving is illegal\nd: don’t worry, I’m walking\ng: good because i would’ve found a way to get your local police to know and give you a ticket\nd: how heartless :,(\nd: but anyways\nd: I actually met Alyssa at this same Starbucks\nd: so I was thinking\nd: what do I do if I run into her again?\ng: lol\ng: you could tell her thanks for the number\nd: it’s not like I’d be lying\nd: I really am thankful\nd: because if it wasn’t for her\nd: I wouldn’t have met you ;)\ng: i still don’t know how thankful i am\ng: the fact that she randomly picked out my number out of millions of others is kind of scary\ng: and plus, i don’t like my number being given out\ng: especially to guys who ask girls for their number when they don’t even know them\nd: now you’re just trying to inflict pain on my heart on purpose\nd: :,,,(\ng: but\ng: i guess i’m a little glad\nd: :,O\ng: if you weren’t so annoying, i’d probably be more glad\ng: but\ng: oh well\nd: I’ll try to be less annoying then\nd: just watch me\ng: we’ll see\n \n\n11:21 am\n\n \ng: are you at starbucks yet?\nd: yeah, I just walked in\ng: is alyssa there?\nd: no :(\n[read 11:21 am]\n \n\n11:32 am\n\n \ng: are you disappointed?\nd: if I’m being honest\nd: not really\nd: if she told me she was giving me her numbee\nd: then completely lied\nd: then why should I even try to pretend I like her anymore\ng: number*\nd: thanks XD\ng: that’s fair though\ng: she baited you so hard\ng: lmao\nd: I’m still wondering why she did it :(\ng: wait so\ng: how exactly did this happen\nd: me asking for Alyssa’s number?\ng: yeah\nd: well\nd: it was a Thursday afternoon\nd: but it was still around noon\nd: and I had just finished eating\nd: and I decided I wanted something to drink\nd: and Starbucks was right next door to where I got food\ng: and how does this relate to you asking for her number\nd: I’m getting there\ng: ughh\ng: k hurry up\nd: so as I was saying\nd: I get in line to order\nd: and she was in line in front of me\nd: and I was like\nd: “wow, she’s pretty”\nd: so then we both ordered\nd: and she got on her phone while she waited for her drink\nd: so I walked over\nd: and I asked “your name’s Alyssa, right?”\nd: and she said yeah\nd: so I asked her how she spelled it\nd: and she told me\nd: so I said “thanks, I’ll remember that when I fill out your contact info. Would you help me finish it by giving me your number?”\nd: and she laughed\nd: and typed the number in my phone when I offered it to her\nd: and then asked for my name, and I told her\nd: and I asked about the area code, but I already told you about that\nd: but anyways, she didn’t seem uncomfortable or anything\nd: so I don’t know why she typed in a random number :(\ng: what drink did you order\nd: a Pink Drink\nd: why?\ng: gay\ng: that’s probably why\ng: you also sounded like a creep\ng: when you knew her name\nd: oh my god\nd: Pink Drinks are good\nd: leave me alone\nd: also it wasn’t that creepy! I literally heard her tell the cashier her name!\ng: still creepy\ng: you should’ve asked for her name and then asked how to spell it\ng: and then done the pickup line\ng: which was actually really smooth btw\nd: it was in the spur of the moment\nd: I was nervous, ok?\ng: you?\ng: nervous?\ng: i don’t believe it\ng: from the texts i’ve gotten from you so far, you don’t seem like the nervous type\nd: well that’s different\nd: this is through text\nd: and that was in real life\nd: to a pretty girl\ng: are you saying i’m not a pretty girl? who you don’t know\ng: so you’re saying that you prefer looks over personality\nd: well\nd: no\ng: that’s basically what you just said\nd: she seemed nice, too\nd: and gave off some chill vibes\nd: so it was all of that combined that lead me to talk to her\nd: and get nervous\ng: mhm\ng: you believe what you want to believe then\nd: ok but like\nd: was I actually being creepy??\ng: maybe\ng: i don’t know\ng: don’t ask me\ng: i mean\ng: i probably wouldn’t have given you my number\ng: because i didn’t know you\ng: and you would have just kind of\ng: started hitting on me\nd: I guess it was a little sudden\nd: oh well\nd: it was a learning experience, I guess\nd: plus, I got your number out of it\ng: which is unfair to me\ng: since i never asked for this\ng: and got no say in the matter\nd: haha\nd: sucks to suck\n[read 11:49 am]\n \n\n11:57 am\n\n \ng: i meant to ask\ng: did you order a pink drink today too?\nd: yeah :)\nd: [photo sent]\ng: you drank that fast\ng: there’s barely anything left\nd: what can I say\nd: I like my Pink Drinks\nd: and before you say anything\nd: there’s nothing wrong with a guy liking Pink Drinks\nd: it’s literally just a drink\ng: fair enough\ng: i won’t say anything then\nd: thank you\n \n\n12:08 pm\n\n \nd: [photo sent]\nd: it’s gone :(\ng: oh no\ng: the world is ending\ng: what are we to do, clay?\nd: D:\ng: jk\nd: I feel attacked\nd: I can’t believe your lack of empathy towards my empty cup, 404\ng: lol\ng: you’re not gonna die\nd: are you sure about that?\nd: I feel my life slowly slipping awa\ng: k\n[sent 12:11 pm]\n \n\n1:54 pm\n\n \ng: hi\n[sent 1:54 pm]\n \n\n2:09 pm\n\n \ng: okay this isn’t funny\n[sent 2:09 pm]\n \n\n3:45 pm\n\n \ng: you’re trying to scare me, but it’s not working\ng: i mostly just feel ignored\n[sent 4:46 pm]\n \n\n4:40 pm\n\n \ng: k whatever\n[sent 4:40 pm]\n \n\n6:04 pm\n\n \n\ng: are you okay?\n\n \n\n10:02 pm\n\n \ng: goodnight\n[sent 10:02 pm]\n\n\njune 8th, monday\n\n\n\n10:24 am\n\n \ng: have you woken up yet?\n[sent 10:24 am]\n \n\n12:38 pm\n\n \ng: clay?\n[sent 12:38 am]\n \n\n1:41 pm\n\n \ng: are you seriously still pretending to be dead\n[sent 2:41 pm]\n \n\n2:02 pm\n\n \ng: at least read my messages\n[sent 3:02 pm]\n \n\n2:56 pm\n\n \ng: i’ll leave you alone, then\n[sent 3:56 pm]\n \n\n3:27 pm\n\n \nd: shit\nd: I’m sorry\nd: some stuff happened yesterday\nd: so I forgot to text you back\ng: what happened? are you alright? it’s ok\n \n\n3:35 pm\n\n \ng: do you want to like\ng: talk about it?\nd: if you don’t mind\ng: go for it\nd: okay so…\n \n\n3:43 pm\n\n \nd: yesterday while I was texting you, I was also working on a plugin that I’ve been trying to get right for the past few days. I put down my phone after the dying message for the joke, and I was planning on texting you again after I tested out the plugin, but when I tested it out, it turned out I had messed the coding up again, and that had been like the 10th time I’d failed, plus I haven’t been getting much sleep lately, so the stress of it finally got to me. I got upset and went to the kitchen to get a glass of water and calm down, but then I dropped the cup and it shattered and that was my breaking point. I didn’t get hurt, luckily or unluckily, but I couldn’t deal with the situation at the time, so I sat down on the floor and cried for a while, and when I finally got up and cleaned up the mess I made, I was exhausted, both mentally and physically. I went back to my room and passed out, completely forgetting about my phone\nd: I feel better now, though\nd: I just woke up\ng: i understand how you feel\ng: coding is tiring\ng: especially when you have to make videos about the plugins you’re making\ng: and keep up with everyone\nd: you make videos? what platform?\n\ng: no forget i said that\n[read 3:47 pm]\n\n \n\n3:54 pm\n\n \ng: yes\ng: youtube\ng: i sometimes stream on twitch\nd: oh hey, me too!\ng: neat\nd: we’re actually pretty similar, you know\nd: we should make a video together sometime\ng: that’s exactly the opposite of the agreement we made\nd: haha\n \n\n5:16 pm\n\n \nd: hey\nd: what’s up?\ng: the sky\nd: I just wanted someone to talk to and you do me like this\nd: that’s it\nd: we’re through\nd: I’m breaking up with you\ng: fine by me\ng: you’re always overreacting\ng: and don’t think i didn’t see you with jessica the other night\nd: JESSICA\nd: IS MY SISTER\nd: YOU KNOW THIS, 404\ng: do i?\ng: omg my stream is trying to find out who i’m texting\ng: they think i have a partner i haven’t told them about\ng: they’re going crazy\nd: why are they so sus?\nd: did I make you laugh ;)?\ng: no\ng: i gtg\ng: stream\ng: byr\nd: I totally made you at least crack a smile\nd: enjoy your stream :)\n \n\n8:29 pm\n\n \ng: hi\ng: i just ended my stream\nd: how did it go?\ng: good, but they never gave up the whole texting thing\nd: XDDD\nd: that’s priceless\ng: of course it would be to you\ng: you find everything funny\nd: not everything\ng: but a lot of things\nd: I guess I could agree with that\n \n\n8:35 pm\n\n \nd: what did you do during your stream?\ng: stuff\nd: c’monnn\nd: tell me, please?\ng: i wassss\ng: mostly just hanging out\ng: and speedrunning a game\nd: sounds fun :)\ng: yeah, it was\nd: are you going to sleep soon?\ng: probably\ng: you?\nd: it’s still pretty early for me\nd: and I slept in late today\nd: so no\ng: i’ll stay up for a bit then\nd: aw, for me?\ng: nvm i’m going to bed gn\nd: yeah right\ng: k\ng: what so you want to talk about then\ng: do*\nd: we could ask each other questions until you get sleepy\nd: but not like personal questions or anything\nd: just dumb questions\ng: works for me\ng: you can start\nd: ok\nd: do you have any pets?\ng: yes\ng: a cat\ng: you?\nd: same :)\ng: what’s your favorite colour?\nd: green I guess\nd: what’s yours?\ng: blue\nd: would you say you’re an extrovert or an introvert?\ng: half and half\nd: introvert\ng: no way\nd: it’s true, I swear!\ng: okay then\ng: favorite holiday?\nd: Halloween\ng: christmas\nd: typical\nd: what’s your favorite meal time?\ng: dinner\ng: because it’s the last meal of the day\nd: same\ng: a lot of people like breakfast, but i rarely have time to eat breakfast\ng: but on the rare occurrence i do eat breakfast, it’s good\ng: dinner wins tho\nd: I agree\ng: favorite social media besides youtube or twitch?\nd: Twitter\ng: twitter rocks\ng: although i don’t post as often as most\nd: I would ask cats or dogs\nd: but you have a cat\nd: so I think that question is answered\ng: yeah lol\nd: how tall are you?\ng: wtf\nd: kidding, kidding\nd: if you could have any other job than what you’re doing now, what would it be?\ng: are you looking these up?\nd: maybe\ng: lol\ng: maybe making games?\ng: something else to do with coding ig\nd: I kind of want to write a book\ng: that’s cool\ng: is writing a hobby of yours or smth?\nd: used to be\nd: I don’t have much time for it now :(\ng: you should try to get back into it\nd: you think so?\ng: yeah\ng: next time you take a break, spend it writing something\nd: maybe I will\nd: thanks, 404\ng: :)\ng: moving on\ng: do you wish you met me sooner? favorite drink?\ng: besides pink drinks lol\nd: aw :(\nd: does water count?\nd: it’s refreshing\nd: I also like hot chocolate\ng: interestinf\ng: g*\nd: what do you like?\ng: apple juice\ng: and coffee\nd: I see\nd: what’s your ideal date?\ng: why are you asking me that?\nd: because why not\ng: k\ng: netflix and chill\ng: maybe go out for mcdonald’s\ng: play some games\nd: so just hanging out?\ng: yeah\nd: that’s pretty much mine too\nd: except instead of going out\nd: I’d prefer Uber Eats\ng: that’s...fair\nd: I know I just went, but can I ask you one more question?\ng: sure\nd: how old are you?\nd: I’m sorry for asking again\nd: but I just really want to know\ng: guess\nd: 25?\ng: no\ng: but close\ng: i’m…\ng: 23\nd: I wasn’t expecting that\ng: is that a bad thing?\nd: no, no.\nd: I’m just a little surprised\nd: I thought you were older haha\ng: well now you know\nd: thanks for telling me\ng: it’s not like you can do much with that information\nd: true\ng: plus, i think you deserved to know\nd: awww~\ng: okay uh\ng: sorry to let you down, but i’m getting tired\nd: then go to sleep\nd: don’t let me keep you up\ng: i won’t lmao\nd: sleep well\ng: thanks\ng: you too whenever you go to bed\nd: goodnight ;)\ng: gn\n[read 9:09 pm]\n\n\njune 9th, tuesday\n\n\n\n12:17 pm\n\n \ng: CLAY\nd: what?\nd: is something wrong?\ng: my friend watched some of my stream from last night\ng: and now he’s also trying to find out who i was texting\ng: oh my god\ng: this sucks\nd: lollllllllllllllll\ng: it’s not funny!\ng: he’s even more annoying than you!!\nd: does he also think you have a bf or something?\ng: YES\ng: i hate him omg\nd: why can’t you just tell him that it’s a friend\ng: because he knows that he’s the only person i’d text during a stream\nd: what is he? your bf?\nd: then tell him about me\nd: it’s not that weird\ng: i mean i guess\ng: but it also kinda is\ng: who talks to someone that randomly texted them one day, claiming that they got the number from some girl at a starbucks\nd: you\ng: why do i even try\ng: okay but like\ng: you could be a serial killer\ng: and this is all your plan to make me trust you\ng: and then you murder me\nd: but I’m not\ng: that proves nothing\nd: :(\ng: anyways, what i’m trying to say is that my friend is probably going to make fun of me if i tell him about you\nd: then don’t tell him how you met me\nd: just say it’s a friend you made recently\nd: and if he asks\nd: say that you met me through\nd: I don’t know\nd: a Discord server\ng: i guess that’s a little better than how we actually met\nd: exactly\ng: but i feel bad lying to him\nd: then tell him the truth!\n[read 12:28 pm]\n \n\n12:42 pm\n\n \ng: okay i talked to him about it\ng: and now he wants to meet you\ng: but i told him no\nd: how did you say we met?\ng: the truth\ng: this wasn’t supposed to happen\ng: you were supposed to be a secret D:\nd: why? so you could keep me all to yourself ;)?\ng: you know why &gt;:(\nd: do I?\ng: because our friendship isn’t supposed to have any ties\ng: but now if people knew about you and something happens, and we stop talking\ng: i’d have to explain to other people that we aren’t friends anymore\nd: isn’t it that way with like\nd: any friendship?\ng: wait\n[read 12:48 pm]\n \n\n12:56 pm\n\n \ng: oh my god you’re right\ng: but i still like this not taking any toll on my personal life :(\ng: like i trust you\ng: but\nd: you trust me :0?\ng: no\ng: lol\ng: jk yeah, i guess i’m starting to :)\ng: but anyways\ng: i feel like it’s easier to talk to you than any of my other friends because you can’t sabotage my career or anything like that\ng: a lot of the views i get depend on my friend and i making videos together, so if i lost him, then i’d probably also lose a lot of supporters\nd: huh\nd: I’ve never thought about it like that\nd: I haven’t had to worry about things like that\nd: since all the videos I do are solo\nd: I’m missing out in all the fun of filming with someone else :,(\ng: it may be fun, but it can be really stressful sometimes too\nd: I can see why\nd: okay\nd: I’ll completely respect your decision for now\ng: thanks, clay\nd: np :)\nd: btw I forgot to ask\nd: how exactly did it go with your friend?\ng: well, he asked me a bunch of questions about you\ng: but i didn’t answer them\ng: except for how we met\ng: that’s all he knows\nd: so basically the same amount of info I have about you?\ng: omg\nd: XD\ng: that better have been a joke or i swear\nd: it was, don’t worry\nd: although I wish you’d just tell me more about you\ng: good\nd: so did he take it well, or?\ng: i’d say so\ng: he flipped out\ng: but not as badly as i thought he would\nd: I’d say that’s pretty good then haha\ng: same\ng: i’m going to have to stop texting you during streams though\ng: so a repeat of yesterday doesn’t happen\ng: i don’t need my fans getting any more sus than they already are\nd: speaking of which\nd: from what you’ve told me\nd: you sound pretty big\ng: do i?\ng: well i suppose i am\ng: i’m not famous or anything\ng: but i do have quite a few subs on yt\ng: and you?\nd: pretty much same\ng: what a coincidence\nd: right?\n \n\n2:02 pm\n\n \ng: he’s trying to make me answer questions again :(\nd: isn’t that like\nd: harassment?\nd: tell him to leave you alone\ng: i’ve trieddd\ng: but he’s like you\ng: he doesn’t give up\nd: I’ll take that as a compliment :)\ng: it can be a good thing\ng: but not when it’s used against me\nd: you should tell him how great I am\ng: sure sure\n \n\n2:14 pm\n\n \nd: did you tell him?\ng: yeah totally\ng: he’s super jealous\nd: are you messing with me :(?\ng: nnnnyes\nd: fooled again by the infamous 404\ng: hehe\nd: that was cute\ng: what\nd: what\ng: k\n \n\n2:35 pm\n\n \ng: he’s finally decided to drop it\ng: thank god\nd: that took awhile\ng: yeah\ng: you’re just making my life so much harder smh\nd: D:\ng: yeah yeah act all sad, expect me to pity you\nd: so it’s not working?\ng: yes but actually no\nd: I’ll try harder next time\ng: we’ll see\n \n\n6:56 pm\n\n \ng: i’m going to sleep early tonight\ng: my cat woke me up really early this morning, and i was never able to fall back asleep, so\nd: cats\nd: the most adorable yet unpredictable animals\ng: yeah basically\nd: lmao\nd: goodnight :))\nd: I send my prayers that you do not get woken up early once again\ng: thank you\ng: that’s much appreciated\ng: gn\n[read 6:59 pm]\n\nd: &lt;3\n\n\n\njune 10th, wednesday\n\n\n\n4:23 am\n\n \ng: good news\ng: my cat didn’t wake me up\n \n\n9:45 am\n\n \nd: that’s GREAT news\nd: I take it you slept well then?\ng: yeah i did\nd: good :)\n \n\n10:04 am\n\n \nd: [image sent]\ng: wtf\ng: did you seriously just send me a cat meme\ng: i’m not complaining but\nd: do you not like it :(?\ng: i don’t like it, but i don’t dislike it either\nd: then what about this?\nd: [image sent]\ng: aww\nd: that’s my cat\nd: I love her &lt;3\ng: she’s really cute\ng: but my cat is cuter\nd: bet\nd: send a pic\ng: i don’t know where he is rn\nd: then find him\n \n\n10:14 am\n\n \ng: [image sent]\ng: baby\nd: my cat\nd: is way more adorable\ng: okay wow\ng: if you’re just going to say that then i don’t think you deserved to see my cat\nd: I’m just speaking the truth\nd: my cat is superior over all other cats\ng: there are only lies being presented rn\ng: your cat is inferior to mine\nd: 404\ng: what?\nd: just face it\nd: my cat’s cuter\ng: no she’s not!\nd: yes she is :)\ng: i’m done\ng: you disrespected me and my cat\ng: i refuse to talk to you for the rest of the day\nd: suuurree\nd: like you can stop talking to me for a whole day\ng: watch me\nd: I will\n[read 10:20 am]\n \n\n11:00 am\n\n \nd: [image sent]\nd: best cat\n[read 11:00 am]\n \n\n12:02 pm\n\n \nd: [image sent]\nd: you know you’re jealous\n[read 12:02 pm]\n \n\n2:23 pm\n\n \nd: [image sent]\nd: look at herrr\nd: she’s sleeping\n[read 2:24 pm]\n \n\n3:15 pm\n\n \nd: [image sent]\nd: ;)\ng: DID YOU JUST FUCKING SEND ME A HORRIBLY PHOTOSHOPPED PICTURE OF MY CAT\ng: CLAU\ng: WTAF\nd: HAHA\nd: I KNEW THAT’D GET YOU\ng: TAKE IT BACK\ng: RIGHT NOW\ng: DELETE IT\nd: nope\ng: you’re dead to me\nd: :(\n[read 3:18 pm]\n \n\n7:53 pm\n\n \nd: am I still dead to you D:?\ng: yes\nd: I’m going to cry\ng: i hope you do\ng: i’m still mad at you\ng: and at myself for trusting you with a picture of my precious cat\nd: is it too late to apologize?\ng: yes\ng: you’ve already done the damage, you can never take back what you did\ng: and you’re never regaining my trust\nd: 404, please\nd: I’ll do anything :,(\ng: then say it\ng: say my cat is cuter\ng: and apologize for hurting his feelings\nd: I’m sorry\nd: for saying my cat\nd: was cuter\ng: thank you\nd: even though it was the truth\ng: HEY\nd: but I guess I’m forced to agree\nd: that your cat\nd: is better\nd: and\nd: cuter\nd: I guess\ng: that was a horrible apology\ng: but i guess i’m going to have to accept it\ng: i don’t have the energy to argue with you rn\ng: i’m going to go cuddle with the most adorable thing on the planet to cheer me up\nd: how are you going to cuddle with yourself my cat?\ng: CLAY\nd: HAAAAAH\ng: i’ve had enough\ng: bye\nd: NO\n[read 8:00 pm]\n \n\n8:36 pm\n\n \nd: fine\nd: prepare yourself for tomorrow\nd: you’re not going to know what hit you\n[sent 8:37 pm]\n \n\n\njune 11th, thursday\n\n\n\n5:24 am\n\n \nd: is a hot dog a sandwich?\ng: i JUST woke up, and it’s to this\ng: what the hell\ng: i don’t need to be thinking about this at 10 am\ng: AND IT’S 5 AM FOR YOU GO TO BED\nd: answer the damn question\ng: the answer is no\ng: it’s its own food\ng: now sleep\n \n\n10:45 am\n\n \nd: do penguins have knees?\ng: i don’t know???\ng: look it up yourself\ng: i’m not google\n \n\n10:52 am\n\n \ng: they do\nd: I thought you said you weren’t Google\ng: i’m not\ng: but i was actually kind of curious of the answer, so i looked it up\n \n\n11:53 am\n\n \nd: does a straw have two holes or one?\ng: none\ng: it’s just plastic wrapped around air\nd: I think you just blew my mind\ng: i’m beating you at your own game lol\n \n\n1:13 pm\n\n \nd: if you could bring three things with you to a deserted island, what would it be?\ng: my cat\ng: my phone\ng: and a private jet with a pilot\nd: oh\n \n\n1:18 pm\n\n \nd: I was going to ask why when people are asked that question, they never say a boat\nd: but\nd: I think private jets are the better option\ng: :)\n \n\n2:27 pm\n\n \nd: what color is a mirror?\ng: the colours that are reflected off of it\nd: ..fair enough\n \n\n2:56 pm\n\n \nd: why is it that rain drops but snow falls?\ng: because snow has a lower density\ng: and more of it usually comes down at once than with rain\nd: forget I asked because that makes no sense\n \n\n4:09 pm\n\n \nd: why isn’t there mouse-flavored cat food?\ng: thta’s a good question\ng: that’s*\ng: maybe because mouse isn’t as deluxe as fish\ng: what does mouse even taste like?\nd: like mouse\ng: ...\n \n\n4:48 pm\n\n \nd: why do you need a driver’s license to buy alcohol when you can’t drink and drive?\ng: you don’t need a driver’s license\ng: you just need an id\ng: something that can confirm your age\nd: really?\n \n\n4:53 pm\n\n \nd: oh yeah you’re right\nd: I mean I can’t buy alcohol either way\ng: you could in london\nd: guess I’m coming to London, then\ng: for alcohol?\nd: I could name other reasons\ng: like what?\nd: well I mean\nd: you live in London\ng: yes, and?\nd: stop acting dumb\nd: you know what I’m getting at\ng: hm\nd: if I ever came to London\nd: we could meet or something\ng: i’d probably only disappoint you\nd: no you wouldn’t :)\n[read 4:58 pm]\n \n\n7:13 pm\n\n \nd: have you gone to Hogwarts?\ng: ...you’re joking\nd: what?\ng: what kind of question is that?\nd: a great question\n[read 7:14 pm]\n \n\n7:26 pm\n\n \nd: c’mon answer it\n[read 7:26 pm]\n \n\n7:40 pm\n\n \nd: 4044444\ng: shut up\ng: i’m going to bed\ng: i’m done answering your weird questions\nd: I win\nd: :)\ng: this wasn’t even a challenge\nd: yes it was\nd: I just never specified it as one\ng: that’s not fair\nd: life isn’t fair\n[read 7:43 pm]\n \n\n7:49 pm\n\n \nd: goodnight ;)\ng: shut up\n[read 7:49 pm]\n \n\n\njune 12th, friday\n\n\n\n11:32 am\n\n \nd: hey, can I have something for winning?\ng: first of all, you didn’t win\ng: second, how can i even give you anything? we’re thousands of miles apart\nd: just trust me\nd: and yes, I totally did win\nd: you gave in to being annoyed by my questions before I got bored of asking them\ng: i didn’t give in\ng: i went to sleep\nd: you were very visibly irritated from the last one\ng: fine\ng: fine\ng: you win\ng: what do you want?\nd: I want you to tell me something about yourself that I don’t know yet\ng: okay ig\ng: let me think of something\n[read 11:38 am]\n \n\n11:51 am\n\n \ng: i’m colourblind\nd: no way\nd: really?\ng: yeah\nd: what type?\ng: protan\ng: it’s a type of red-green colourblindness\nd: is it really bad?\ng: yeah\nd: woah\nd: I would’ve never guessed!\ng: it’s not like it’s obvious\nd: yeah you’re right\nd: I see now why blue is your favorite color\ng: you remembered that?\nd: it’s not that hard to\ng: idk it’s kind of a dumb thing to remember\nd: not really\nd: it’s not dumb if it pertains to you :)\ng: if you say so\n \n\n3:23 pm\n\n \nd: this is probably weird but\nd: what’s your daily routine?\nd: since we do similar things, I thought I’d compare mine to yours\ng: hm\ng: i get up, take a shower, check my social medias, edit any videos that might need editing, eat lunch, code, record any videos that might need recording, eat dinner, chill for a bit, then go to bed\ng: and then talking to you is sprinkled in there throughout the day, and i stream whenever i have time which is usually around once a week\ng: but sometimes i just don’t have a routine\ng: i try to stick to that one, though\nd: oh hey\nd: mine’s pretty much the same\nd: except lately I’ve been coding basically all day\ng: how’s that going btw?\nd: I’m getting there\nd: ever since my breakdown, I’ve been taking a lot more breaks\ng: good, you’re following my advice\nd: it was good advice\nd: so thank you\ng: no problem\n[read 3:32 pm]\n \n\n5:44 pm\n\n \ng: just wanted to let you know i’m going to bed early again tonight\nd: okay :)\nd: any specific reason for that?\ng: i’m going to be up pretty late tomorrow\ng: so\nd: oh okay\nd: wanna be the least amount tired you can be?\ng: yeah, that’s about it\nd: then go ahead\nd: sleep well, 404\ng: thanks, i’ll try\n[5:46 pm]\n \n\n\njune 13th, saturday\n\n\n\n5:10 am\n\n \ng: good morning\ng: oh wait sorry it’s still early for you, isn’t it?\n \n\n10:36 am\n\n \nd: morning\nd: yeah, I was still fast asleep XD\nd: how did your sleep end up being?\ng: it was nice\ng: it was\ng: sleep\nd: as it should’ve been haha\nd: I’d be worried if it wasn’t\ng: me too lol\nd: what do you have planned for today?\ng: i think i’m gonna take a break today\ng: just hang out, you know?\nd: I think you deserve it\nd: I assume you’ve been busy lately, then?\ng: yeah\ng: i uploaded yesterday\ng: so now i’m going to sit back for a day or two before going back to coming up with new video ideas\nd: enjoy your day, then :)\ng: i will\ng: what’re you doing today?\nd: hopefully finishing this plugin then recording a video for it\ng: good luck!\ng: i believe in you\nd: thanks\nd: I should get it done with your encouragement :))\ng: lol\ng: i didn’t know my encouragement was that powerful\nd: it is\nd: trust me\ng: i’ll take your word for it, then\n \n\n2:12 pm\n\n \nd: 404\nd: I DID IT\ng: you got the plugin finished?\nd: YEAH\nd: I FINALLY GOT IT TO WORK THE WAY I WANTED IT TO\ng: that’s great!\nd: how’s your free day going?\ng: it’s honestly kind of boring\ng: but it’s nice not doing anything for once\nd: enjoy it while you can lmao\ng: don’t worry, i will\n \n\n4:47 pm\n\n \nd: I’ve gotten all the footage recorded\nd: but I’m going to save editing it for tomorrow\nd: and I’m going to chill instead\ng: yes, take a break and relax\nd: that’s exactly what I’m doing \ng: do you think all the hard work paid off?\nd: I think it will\nd: I’m pretty proud of how my footage turned out\nd: as well as the plugin\nd: but that’ll truly be determined when I finish the video and upload it\nd: see what others think about it and all that\ng: i don’t know what it is\ng: but i think they’ll love it\nd: I’ll take your word on it :)\ng: good\ng: oh, i hate to say this, but i gtg :(\nd: you’re good\nd: talk to you later\ng: you too :)\n[read 4:55 pm]\n\n\njune 14th, sunday\n\n\n\n1:24 pm\n\n \ng: hi\n \n\n2:45 pm\n\n \nd: hey :)\ng: how was your night of relaxation?\nd: it was really good, actually\nd: I ended up finding a cool streamer than I haven’t seen before when surfing through Twitch\nd: that*\nd: which it’s surprising that I haven’t found him sooner since he’s only a little bit smaller than me\nd: and when he finished his stream, I checked out his YouTube\ng: sounds like you had a good night\ng: what did he do during his stream?\nd: pretty much just speedrunning\nd: but he was good at keeping up with donos\nd: so he was pretty interactive and talkative\nd: grade A streamer in my opinion\ng: what’s his name? i might want to check him out\nd: you’d make fun of me for being interested in the game he was streaming\ng: i’m sure i wouldn’t\ng: unless it was like\ng: roblox\nd: I don’t even think it’s even possible to speedrun Roblox\nd: but no, I wouldn’t stoop down low enough to watch Roblox videos\ng: then it can’t be that bad\ng: just tell me\nd: alright\nd: his name on both Twitch and YouTube is GeorgeNotFound\nd: the not found part kind of reminds me of your nickname haha\nd: that’s probably another reason I enjoyed him so much\n[read 2:52 pm]\n \n\n3:01 pm\n\n \ng: he seems\ng: cool\ng: minecraft is cool\nd: oh, you looked him up?\ng: uh\ng: yes\ng: so you like him?\nd: I do\nd: I ended up following his Twitch and subscribing to his YouTube\nd: for whatever reason, he motivated me to work harder\nd: I finished editing and uploading my new video last night because of him\ng: he did?\nd: yeah\ng: can you think of why?\nd: if I had to choose a reason\nd: it’d probably be the competition\nd: he’s good at what he does\ng: do you play minecraft too?\nd: don’t laugh\ng: you do?\nd: yeah\ng: hm\ng: so this georgenotfound guy\ng: would you want to be friends with him?\nd: I mean\nd: I don’t see why not\nd: why?\nd: are you jealous ;)?\ng: no, i’m not\ng: i’m just curious is all\ng: and hearing all your compliments is making m\nd: sure, sure~\ng: i’m telling the truth\nd: you know\nd: he’s kinda cute haha\n[read 3:08 pm]\n \n\n3:16 pm\n\n \nd: NOW you’re jealous\ng: i’m not\ng: i just didn’t know what to say\ng: and why would i be jealous?\ng: it’s not like you know what i look like lol\nd: I guess you’re right\n \n\n3:39 pm\n\n \nd: so what did you do last night?\ng: stream played games with my friend\nd: the same one who spammed you about wanting to talk to me?\ng: yup\ng: that’s him\nd: did you two have fun?\ng: yeah, we did :)\nd: good! :))\n \n\n6:47 pm\n\n \ng: can i ask you a question?\nd: go ahead\ng: do you like talking to me?\nd: I do\nd: what makes you ask?\ng: i don’t know\ng: i’ve just been thinking about things\nd: what kind of things?\ng: i think i like you\ng: it’s hard to explain\ng: but i can never stop thinking about you\nd: have you been doubting how much our\nd: can I call it friendship?\nd: means to me?\ng: i don’t know\ng: and yeah...i’d say we’re friends.\nd: well\nd: if it makes you feel better, just know\nd: I really like talking to you :)\ng: okay\ng: thank you\ng: i like talking to you too, clay\nd: you know you can tell me when something’s up, right?\ng: yes\nd: well, I hope you’ll go through with that\nd: if you’re ever..doubting yourself\nd: or upset\nd: or something\ng: i know\nd: ok\nd: just making sure\ng: thanks\nd: when do you think you’re going to call it a night?\ng: most likely sometime soon\ng: i’m starting to get tired\nd: sleep\ng: demanding, aren’t you?\nd: yes\nd: I don’t want you to end up like me lmao\ng: fair enough\ng: night\nd: sweet dreams~\n[read 6:59 pm]\n\n\njune 15th, monday\n\n\n\n11:14 am\n\n \nd: morning\nd: except it’s not and it’s actually almost noon\ng: gm\ng: except i woke up a while ago and i’m actually eating dinner rn\nd: lmao\nd: what’d you dream about?\ng: lots of things\ng: including you stupidly enough\nd: were they sweet dreams?\ng: i wouldn’t necessarily call them that\ng: they were just\ng: dreams\nd: :(\ng: don’t feel bad\ng: it’s not like they were bad dreams\nd: true\nd: :)\ng: :D\n \n\n1:42 pm\n\n \nd: hello\ng: hi\nd: what’s up?\ng: nothing much, just planning out with my friend what we’re going to do for our next video\nd: sounds fun\nd: come up with any ideas yet?\ng: a few\ng: but we’re not sure if any of them are good enough\ng: it’s so hard to create original content nowadays\nd: I feel that\nd: you’ll think you have a good idea, but then it turns out it’s already been done\nd: you know, it’s not bad to sometimes take inspiration from other content creators\nd: you could take one of their ideas and expand on it\n[read 1:47 pm]\n \n\n1:55 pm\n\n \ng: i talked to him about it, and he agrees with you\ng: so that’s probably what we’ll do this time\nd: are you two in a call or texting?\ng: we’re in a call\ng: he’s jealous that i’m texting you while he’s talking to me lol\ng: he said he’s starting to feel like a third wheel since i barely text him anymore\nd: haha\nd: does that mean I’ve stolen your heart ;)?\ng: no way\ng: that’s weird :v\nd: I’m offended :(\ng: it’s not your fault\ng: we just\ng: don’t know each other well still\n[read 2:02 pm]\n \n\n2:26 pm\n\n \nd: [message redacted]\n[read 2:26 pm]\n \n\n3:28 pm\n\n \nd: oh god\nd: I’m soory\nd: I fucked up sayig that, didnt I?\nd: plaese talk t me\n[sent 3:28 pm]\n \n\n3:36 pm\n\n \nd: I deleted it\nd: pelase\nd: cna we prented that didnt hapepn\nd: I’ll do anytihng I’m so sorry\nd: I wne ttoo far I didn’t mean to\ng: really?\ng: you’re blaming me for not sharing all of my personal info with you just because i know a couple of things about you?\ng: i was starting to warm up to you\ng: i was even thinking that i could tell you some more things about me\ng: because it’s not only hard for you\ng: it’s hard for me too\ng: but if you can’t see that\ng: then that’s really selfish of you\nd: no no pelase\nd: I’m nto blaming you\ng: right\ng: you know\ng: i wouldn’t care that you’re starting to become “attached to me”\ng: because i can’t lie\ng: you’re growing on me too\ng: and i don’t know how to feel about it\ng: but because you’re using it against me\ng: fuck you\ng: okay, clay?\ng: did you read that clearly?\ng: fuck you.\nd: please don’t do thsi\ng: delete my contact\ng: i’m done\nd: I’ms orry\ng: i’m serious\ng: delete it.\nd: if that’s what you want hten I will I’m soryy\nd: I shoudlve’ respeceted your privacry\nd: but I’m a horrible firned\nd: I desvere this\nd: live your best\nd: for me\nd: okay?\n\n[contact ‘404 &lt;3’ deleted]\n\n\n\njuly 2nd, thursday\n\n\n\n12:27 am\n\n \ng: hi\ng: i understand if you don’t want to talk to me, but i just wanted to say that i’m sorry\nd: who is this?\ng: um\ng: i get i overreacted and hurt you...but do you really have to pretend you don’t know me?\nd: wait\nd: 404?\ng: no just forget it\nd: wait wait\nd: you kept my number this whole time?\ng: ..maybe?\nd: what the fuck\ng: i couldn’t bring myself to delete it\ng: sorry\nd: don’t be\nd: I’m the one in the wrong here\ng: can you just shut up for like a minute and let me apologize\nd: ok\ng: so i was already kind of in a bad mood because my friend was being kind of an ass too before you sent that message\ng: and at first, i was going to let it go because you apologized, but i just got so pissed off for some reason\ng: and i think i have the right to have gotten pissed off\ng: but i overreacted and wasn’t thinking about how you felt during the time\ng: and um\ng: during these few weeks we haven’t been talking\ng: i’ve been subconsciously checking my phone for texts from you\ng: it had become a habit that i hadn’t even realized i picked up until we weren’t talking anymore\ng: and it made me realize that\ng: i can’t live without you, clay\ng: so if you’ll let me, i’d like to be friends again\ng: and if you just give me a few days...i promise i’ll tell you my name and gender and anything else you might want to know about me\ng: i just need a bit more time\nd: ok wow uhm\nd: I just\nd: need a minute\nd: to procress this\nd: process*\nd: brb\n[read 12:36 am]\n \n\n12:49 am\n\n \nd: I think I’m good now\nd: will you let me apologize, too?\nd: actually I’m not even going to wait for a response\nd: I’m sorry for being such an asshole\nd: I was being impatient and selfish\nd: and honestly\nd: when I realized what I said and how much it affected you\nd: I felt like I couldn’t breathe\nd: because I knew right then and there\nd: that because of my carelessness\nd: I was going to lose you\nd: and I did\nd: and it hurt\nd: I’ve had no motivation to do anything these past few weeks\nd: I’ve barely coded anything, and I haven’t made any new videos or streamed anything\nd: I was so upset with myself for trying to push you to do something that made you uncomfortable and I knew you weren’t ready for yet\nd: so I’m sorry\nd: I’m really sorry\nd: we both had our outbursts\nd: and we both apologized for them\nd: and I would really like to be friends again\nd: and I swear to you\nd: that I won’t let that happen again\nd: I’ll respect your privacy\nd: and let you tell me things at your own pace\nd: I admit, I had been so excited to have someone to look forward to talking to every day that it clouded my mind and made me end up acting like an asshole\nd: so in conclusion\nd: I’m a dumbass\ng: yeah, you’re a real dumbass\nd: ok that doesn’t make me feel any better\ng: but i’m a dumbass too\ng: so it’s okay :)\nd: haha\nd: I nee danother mintue brb\ng: are you like\ng: okay?\nd: yes totlaly\ng: typos\nd: my ahdns are shaking what d oyou expect?\n \n\n1:10 am\n\n \nd: alright, I’ve calmed down\nd: I thimk\nd: anyways\nd: I just now noticed the time, so I have to ask\nd: why did you decide to do this at 6 AM?\ng: well you see uh\ng: i’ve kind of been up all night\nd: thinking about me?\ng: that sounds weird\ng: but yeah i guess you could say that\nd: would you believe me if I said the same?\nd: although obviously it’s still not too late for me\nd: but\nd: you get the idea lol\ng: i guess we both were affected negatively by what happened\nd: it was a learning experience\nd: let’s make an agreement\nd: forget what you said about deleting each other’s contacts\nd: because that was stupid\ng: i hate to say it, but i agree\nd: next time one of us acts out\nd: we’ll give each other space for a day\nd: and then talk about it after we’ve both calmed down\ng: okay\ng: that sounds like a good idea\nd: good\nd: now\nd: get some sleep, ok?\ng: you too\ng: god it’ll be nice to finally relax\ng: i actually haven’t been doing much either\ng: i’ve streamed once since then, but everyone was quick to notice that something was wrong\ng: so i didn’t stream again after that\nd: I wonder what would’ve happened if we had gone any longer like that\ng: i have no idea\ng: but my friend was getting really irritated at me for being so depressed all the time and not just getting over it and texting you\nd: so he knew you kept my number?\ng: yeah\nd: did you tell him about our argument?\ng: what else was i supposed to do?\ng: he would’ve pried it out of me eventually if i hadn’t immediately gone to him crying about it\nd: wait\nd: crying?\ng: nnoooo?\nd: you don’t have to be ashamed about it\nd: I cried too\ng: i don’t know whether to be surprised or not\ng: i’ll go with the former\nd: aha\nd: it was kind of surprising for me too\nd: anyways\nd: you really need to get some sleep now\nd: go\ng: okay okay sorry gn\nd: nighty night\n[read 1:29 am]\n \n\n3:25 pm\n\n \nd: hey\nd: I meant to tell you\nd: I’m really glad you kept my number\nd: and texted me\ng: me too\nd: I was worried I’d never get a person like you in my life again\ng: now you’re just getting mushy\ng: stop\nd: ok ok lmao\ng: oh, right\ng: i have a question\ng: did you really mean that you were getting attached to me?\ng: or was that just a spur of the moment thing\nd: I did\nd: I can’t help it\nd: you’re the first person I’ve had to talk to in a while\nd: even after these few weeks\nd: I still feel pulled to you\nd: I don’t know why\nd: but if it makes you uncomfortable to know that, I’m sorry\ng: it doesn’t\nd: good\n[read 3:34 pm]\n \n\n3:46 pm\n\n \ng: if it makes you feel better\ng: i understand how you feel\ng: i feel pulled to you, too\ng: that’s probably why it was so impossible for me to bring myself to delete your contact\nd: good to know I’m not alone\ng: i know i’m being a hypocrite by saying this because i told you to stop being mushy\ng: but i won’t let you be alone anymore\nd: thank you\nd: I trust you\ng: i hope i won’t let you down\nd: no matter what happens\nd: I’ll be here\ng: thank you\ng: really, clay\ng: thank you\ng: i’m really happy we’re friends\nd: so am I :)\n[read 3:53 pm]\n\n\njuly 3rd, friday\n\n\n\n5:22 am\n\n \ng: gm\n \n\n9:19 am\n\n \nd: morning!\ng: :D\nd: how are you?\ng: hungry\ng: i haven’t eaten lunch yet\ng: it’s not even lunchtime anymore\nd: EAT\ng: i don’t know what to eat\nd: then I’ll tell you what to eat\ng: you don’t even know what i have\nd: then tell me what you have!\ng: [image sent]\ng: [image sent]\nd: ok let’s see\nd: everything you have sucks\nd: you need to go to the store and buy better food\ng: omg i didn’t show you what i had in my fridge and cabinets for you to judge my choice of food\nd: XDDDD\nd: you should make that box of mac and cheese\nd: that’s probably the best thing you have to eat\ng: k\n \n\n9:48 am\n\n \ng: [image sent]\nd: that actually looks really good\nd: makes me hungry\nd: maybe I’ll give in and eat breakfast for once\ng: only if i can decide what you eat\nd: sure lol\nd: [image sent]\ng: fridge too\nd: oh, right\nd: [image sent]\nd: you better not make me eat some weird English breakfast\ng: i won’t, i won’t\ng: two eggs\ng: fried\ng: with sriracha\ng: and a piece of toast\nd: SRIRACHA?!\nd: WHY??\ng: if you don’t like sriracha why do you have it :v\nd: I do like Sriracha!\nd: but with EGGS?!\ng: do it\ng: do it\ng: do it\ng: do it\ng: do it\ng: wimp\nd: how would I be a wimp for not wanting to make my food gross?\ng: omg just do it\ng: it can’t be that bad\nd: fine\nd: go eat your fucking mac and cheese or whatever while I make it\ng: why are you so pissy all of a sudden?\nd: because I don’t want to ruin my breakfast with Sriracha :(\ng: calm down\ng: if you don’t want to do it, you don’t have to\nd: no, I have to do it now because you told me to\ng: k whatever\ng: don’t say i didn’t try to let you out of it\n[read 9:56 am]\n \n\n10:20 am\n\n \nd: [image sent]\nd: the monstrosity is done\ng: that was fast\nd: I can’t believe I’m about to eat Sriracha on eggs\nd: will eating this make me a bad person?\ng: uh\ng: no?\nd: ok\n \n\n10:26 am\n\n \ng: how is it?\nd: I don’t know\nd: it just tastes like spicy fried eggs\ng: is it...good?\nd: I’d rather not be eating something spicy in the morning\nd: so not really\ng: oh\ng: i’m sorry\nd: I’m taking note that you have bad ideas, so I can be better prepared in the future ;)\ng: it’s not like i thought it was going to be good\nd: were you trying to make me eat something bad on purpose?\ng: yes lol\ng: i was\nd: that’s not cool, 404 :(\ng: hey, at least the toast was good, right?\nd: about that\nd: I accidentally got Sriracha all over it\ng: you didn’t see me, but i just facepalmed\nd: XDD\nd: how was your mac and cheese?\ng: good ig\ng: i’m not hungry anymore, and that’s al that matters\ng: all*\nd: I’m still hungry\nd: because my breakfast was ruined\nd: I only got a few bites of egg :((\ng: oh my god\ng: and this is my fault isn’t it\ng: you shouldn’t have listened to me &gt;:(\nd: it’s not like I eat breakfast anyways\nd: we tried lol\ng: to make up for it, eat a good lunch\nd: I will\ng: you better\n[read 10:35 am]\n \n\n3:13 pm\n\n \nd: I’ve been really productive all day today\nd: it’s all thanks to you haha\ng: why thanks to me?\nd: well, obviously it’s because having you back gives me all the encouragement I need to be productive and do things well\ng: oh\ng: interesting\ng: that makes sense i guess\nd: what, have you not been productive?\ng: can’t say\ng: definitely more so than before\ng: but i wouldn’t say that i’ve been overly productive\nd: hm\nd: how about I give you some motivation?\ng: and how exactly are you going to do that?\nd: well, it depends\nd: what have you been working on?\ng: if anything, i guess i could say my speedrunning\ng: i’ve been trying to improve\nd: ok, great\nd: you can do it, 404!\nd: I know you’re good at the game, and I know you have room to get better\nd: and I know you will!\nd: because you work hard\nd: and you’re amazing :)\n[read 3:18 pm]\n \n\n3:24 pm\n\n \nd: did it work?\ng: yes\ng: it did\ng: thank you\ng: my skills have suddenly increased\ng: you’re magic\nd: are you being sarcastic :(?\ng: a little bit lol\nd: does my encouragement mean nothing to you :,(\ng: no, it means a lot\ng: and i wasn’t lying when i said it worked\ng: i do feel more motivated to get better now that you’re cheering me on\nd: you better get a world record time now\ng: i doubt it\ng: but i’ll try\ng: the problem is a lot of it depends on rng\ng: it doesn’t matter how good i am\ng: i won’t get a good time if i’m not lucky lol\nd: it’s the same with Minecraft\nd: it’s so disheartening :(\nd: you could get lucky with one aspect\nd: but then super unlucky with another\nd: and the whole run is ruined\nd: but you just have to keep going\nd: and never give up hope\ng: you’re right\ng: eventually, i’ll get a good time\ng: unless i stop trying\nd: good luck :)!\nd: think of me during your speedrun training\nd: it’ll boost your skill ;)\ng: lol we’ll see about that\n \n\n8:48 pm\n\n \ng: i got a sudden burst of confidence a few minutes ago\ng: maybe because it’s almost 2 am\ng: but there’s something i wanted to talk to you about\nd: I’m listening\ng: first\ng: answer me honestly\ng: what gender do you think i am?\nd: I’ve always seen you as a girl\nd: since Alyssa was a girl\nd: but truthfully, I’m not as sure about it as I used to be\ng: oh\ng: uhm\ng: i hope this doesn’t disappoint you, then, but…\ng: i’m a boy\n[read 8:53 pm]\n \n\n9:00 pm\n\n \ng: you’re disappointed, aren’t you?\nd: NO\nd: I’m not\nd: I’m just processing some things\nd: I’m sorry for spooking you\n[read 9:01 pm]\n \n\n9:12 pm\n\n \nd: ok\nd: ok\nd: I’m done processing this information\nd: thank you for telling me\ng: i didn’t change your opinion on myself, did i?\nd: never\nd: why would I change my opinion on you just because you’re a different gender than what I thought you were?\nd: you’re still you\nd: although it does shock me to realize that I am no longer as straight as I thought I was\ng: clay\ng: you’re\ng: wow\ng: i’m going to go to sleep now\nd: I mean it, you know\nd: but go ahead\nd: goodnight :)\n[read 9:15 pm]\n\n\njuly 4th, saturday\n\n\n\n10:28 am\n\n \nd: it’s July 4th\nd: which means fireworks going off all night\nd: I’m not looking forward to it :(\ng: ha\ng: sucks to live in america\nd: it doesn’t suck to live in America!\ng: right\nd: shut it\nd: Brit\nd: have you ever even been to America?\ng: no\ng: but i have stories\nd: still\nd: you haven’t experienced it here first hand\ng: i guess that’s true\nd: come to Florida!!\nd: we have\nd: the ocean\nd: and humidity\nd: and myself\ng: sounds awful\nd: hey! :(\ng: lol\ng: you also have hurricanes\ng: i’m not about to risk my life by going there\nd: then come in the winter ;)\ng: flights are expensive\ng: do you think i have that kind of money?\nd: what if I bought your ticket\nd: would you come?\ng: no\ng: because i refuse for you to spend your money on me\nd: ok I need to find a better way to word this\nd: if money wasn’t a problem, would you want to come to Florida?\ng: maybe in the future\ng: when we’re closer\nd: :D\ng: that’s still a maybe though\ng: plus i’d be buying my own ticket\ng: so i’d need to have money\nd: I’ll take it\nd: that’s better than a flat no\ng: how did we even get on this topic anyways\nd: because you’ve never experienced the Floridian life\ng: uh huh\ng: well enjoy your firework day\nd: thank you\nd: I wish you could enjoy it with me\n \n\n7:36 pm\n\n \nd: oh god, they’re already starting\nd: I’m going to get no sleep tonight :,(\n \n\n11:14 pm\n\n \ng: just wear headphones\ng: put on some music or something like that to block it out\nd: where were you this whole time?\ng: alseep\ng: asleep*\nd: why are you not still asleep?\ng: because\nd: because?\nd: did you have a nightmare?\ng: it sounds really childish when you put it that way\nd: so you did\ng: maybe\nd: I’m sorry :(\ng: it doesn’t really matter\ng: the worst part is i’m wide awake now\ng: but it’s fine because i get to talk to you a bit longer\nd: if you want\nd: I could help you fall asleep\ng: really?\ng: how do you plan on doing that?\nd: I could tell you a bedtime story!\ng: absolutely not\ng: besides\ng: how is that supposed to make me fall asleep?\nd: pleeeease\nd: just trust me\ng: fine\ng: just get it over with ig\nd: :D\nd: okay so\nd: there’s a lonely prince in a castle\nd: his parents never let him leave in fear of him getting hurt\nd: so in his desperation to talk to anyone besides his cat\nd: he sends out a letter to the neighboring kingdom\nd: he didn’t expect a reply, but when he got one, he was overjoyed\nd: so for weeks, he talks with the mysterious person, imagining them to be a princess\ng: this sounds awfully familiar\nd: haha\nd: he falls in love with them\nd: and deciding he can’t wait any longer\nd: he asks if they could meet\nd: so they plan everything out\nd: and when the night finally comes for their meeting\nd: the prince slips out of his window and goes to the edge of the kingdom\nd: and sitting there at the tree they discussed\nd: wasn’t the princess he had been expecting\nd: but instead it was a prince\nd: but his feelings didn’t go away\nd: so he approached the prince\nd: and their eyes met\nd: and they both knew\nd: they were destined to be together\nd: so despite the judgment that could bring them down if antone found out\nd: they met in secret over and over\nd: and every time\nd: they both only fell deeper in love\nd: finally\nd: filled with courage\nd: the prince reveals to his parents about how he had been sneaking out almost every night to meet with someone\nd: and when the parents ask who the lucky girl is\nd: the prince tells them it’s the prince of the kingdom next to them\nd: and instead of the disgusted reaction he expected\nd: they accepted him\nd: saying that this could be good and make for an alliance between the two kingdoms\nd: the prince returns to the tree that night, excited to tell his lover the good news\nd: and when he does\nd: the other prince admits he also told his parents\nd: and they reacted the same way\nd: and so\nd: they went public with their relationship\nd: and only received support and love from their people\nd: an alliance was then formed\nd: and the two princes\nd: no longer needing to see each other in secret\nd: lived happily ever after\nd: the end\nd: goodnight, 404 :)\n[read 11:42 pm]\n\n\njuly 5th, sunday\n\n\n\n10:12 am\n\n \ng: george\nd: what?\nd: wrong..person?\ng: that’s my name\ng: it’s george\nd: oh!\nd: George...\nd: like that one streamer haha\ng: clay\ng: i am that one streamer\nd: WHAT\nd: wait\nd: no way\nd: that was you\nd: that was\nd: you were\nd: I donated\nd: oh my god\ng: what are you talking about?\ng: you donated on one of my streams?\nd: yeah\nd: during the weeks we weren’t talking\nd: the one time you streamed\nd: I was watching it and you looked upset so I donated\nd: I guess now I know why you were upset\ng: that’s embarrassing\ng: which donor were you?\nd: I was um\nd: I donated $100 saying stuff about how down you looked and how I was going through a hard time too so you weren’t alone\ng: wait\ng: you’re dream?\nd: yeah\nd: I’m surprised you remembered it\ng: how could i not?\ng: i had actually found your channel a month or two before we met due to fans telling me about it\ng: but when you donated, i wasn’t sure whether it was the real dream or not\ng: so i tried to stay calm\ng: especially since it was a lot of money to me\ng: but in reality, you ended up making my day just a bit brighter\ng: so thank you for that\nd: give me a mintue\nd: I can’t stop laughing\nd: omg\ng: uh\ng: why are you laughing?\nd: this is just crazy\nd: we both knew about each other outside of this\nd: I feel like I know you so much better now\nd: George\nd: I know your name!\nd: George!!\ng: you’re really happy\ng: that..\ng: that makes me happy :)\nd: :)))\n[read 10:35 am]\n \n\n12:01 pm\n\n \nd: so this means\nd: you play Minecraft!\nd: we should collab!\ng: isn’t it a bit too soon for that?\ng: maybe we should wait\ng: if we suddenly do a collab, it might confuse people lol\nd: oh yeah you’re right\nd: :(\nd: oh!\nd: this also means\nd: the friend you would always talk about\nd: Sapnap\nd: right?\ng: yes\ng: it was sapnap\nd: thought so haha\nd: everything makes so much more sense now!\nd: I’m so glad you told me\nd: thank you, George\nd: for trusting me\nd: thank you\ng: no\ng: clay\ng: i’m sorry for taking so long\ng: it was because of me that our argument ended so badly\ng: i’m not very good at being honest with myself or others\ng: but i want to get better\ng: and it’s because you’ve been so open with me\ng: you’ve shown me that you care\ng: and i can never thank you enough for that\nd: you’ve helped me too, you know?\nd: I’ve discovered more about myself because of you\nd: and it’s thanks to you that I have someone to talk to every day\ng: clay\ng: do you\nd: do I what?\ng: do you ever wish that it was alyssa instead of me who answered your text?\nd: no\nd: the answer is no\nd: even if I did at first\nd: I have no regrets knowing it’s you\nd: George, I know that it was by chance that we met\nd: and that it was because of Alyssa\nd: but that doesn’t mean I like Alyssa more than you\nd: I’m thankful to her for this opportunity and\nd: I’m thankful it’s you\nd: I like you, George\nd: not her\nd: I could even go as far to say that you’re my best friend\nd: if that’s ok with you\ng: it is\ng: it’s more than okay with me\nd: thank you for opening up more to me\nd: Georgeee\ng: you really like my name, don’t you?\nd: I do!\nd: yes!\ng: alright then\ng: clayyy\nd: !!!\ng: lol\ng: i think i need some time to think over today\ng: it was a lot\ng: so i’ll talk to you tomorrow :)\nd: of course!\nd: have a good night\nd: George\nd: &lt;3\n[read 12:32 pm]\n\n\njuly 6th, monday\n\n\n\n10:43 am\n\n \ng: hi\nd: heyy\nd: what’s up? :)\ng: would you\ng: want to play minecraft?\ng: just for fun\nd: I thought you’d never ask\nd: let’s do it\nd: Hypixel?\nd: or SMP?\ng: both\nd: ok XDDD\nd: which one do you want to do first?\ng: uhh\ng: hypixel\nd: I’ll meet you on there, then\nd: let me know when you’re on, so I can friend you\n[read 10:48 am]\n \n\n10:52 am\n\n \ng: i’m on\nd: would you rather use the in-game party chat or text?\ng: let’s text\nd: works for me\ng: bedwars?\nd: on it\nd: don’t forget to /nick btw\ng: oh right my bad lol\nd: offensive or defensive?\ng: i usually go offensive\nd: same\nd: so we’ll make a good team\n \n\n10:58 am\n\n \nd: take this\nd: bridge to the diamond gen\nd: I’m going to rush red\ng: gl\nd: thx\n \n\n11:02 am\n\n \ng: good job\ng: i’ll get better bed defenses while you go to mid\nd: ok\n \n\n11:05 am\n\n \ng: CYAN\ng: COMUNG\nd: omw\ng: NOOOOO\ng: I DIED\ng: GO\nd: IM GLING\ng: go FASTER\ng: omg thank god you knocked him off\ng: respawn fasterrr\ng: okay i know we’re going offensive but let’s get heal pool\ng: and it’s a trap\nd: there’s diamonds in the chest\ng: thanks\n \n\n11:20 am\n\n \ng: how are we already the only team left with a bed\nd: we’re just that good ;)\ng: psssh no\ng: i’m just that good\ng: carrying your ass\nd: I won’t hesitate to throw a fireball at you\nd: I’m pretty sure I’m the one carrying us\nd: it’s not like I was the one who eliminated both red and blue\nd: and pink\ng: YELLOW\nd: I’m not helping you until you admit that I’ve been carrying you this whole game\ng: BEF\ng: HEJI\ng: HELP\nd: nope\ng: CKAYY PLEASE\nd: say it\ng: I DIED THEYRE GOING TO GET OUR BED\nd: I can’t hear you\ng: FINE\ng: YOU’RE BETTER THAN ME AT BEDWARS\n \n\n11:28 am\n\n \nd: you’re welcome for eliminating yellow\ng: thank you\ng: i guess\ng: &gt;:(\nd: :)\n \n\n11:35 am\n\n \nd: let’s storm cyan\nd: since they’re the only team left besides us\nd: and they don’t have a bed anyways\nd: they’re just camping\nd: probably waiting for bed elimination\ng: k\n \n\n11:41 am\n\n \ng: YES\ng: GG\nd: we did it!\ng: :D\nd: do you wanna play again?\ng: not unless you want to\nd: I feel satisfied with that one match\nd: SMP?\nd: or a different minigame?\ng: smp\ng: i just wanted to see how good you were\ng: plus bedwars is kind of hard without being in some sort of vc\nd: agreed\nd: I was thinking about asking you if you wanted to call but didn’t know if it was too soon for that\nd: I’ll make it\ng: okay\n \n\n11:46 am\n\n \nd: the ip is mc.dreamnotfound.me\ng: dreamnotfound?\nd: I thought it would be funny to combine our IGNs\ng: interesting\n \n\n11:57 am\n\n \nd: speedrun or just mess around?\ng: you can choose\nd: let’s speedrun\nd: I’ve never speedrun with somebody else before \ng: alright\n \n\n12:02 pm\n\n \ng: come here\ng: there’s a cave\nd: you want to get iron?\ng: yes\ng: it’s not like this is some legit speedrun\nd: true\n \n\n12:06 pm\n\n \ng: BEHDING YOU\ng: CREEPER\nd: aw man\ng: that joke is dead\ng: just like you\nd: get my stuff so it doesn’t despawn\ng: how did you even die?\nd: I was on like\nd: half a heart before then\nd: because I didn’t have any food\ng: there’s no way you were on half a heart\nd: ok so\nd: 5 hearts\ng: that’s\ng: half of your health\ng: not half a heart\ng: smh\nd: whatever\nd: same thing\ng: it’s really not\ng: but think whatever you want to think ig\ng: also i think it would be easier to use the in game chat for talking now that we’re not playing something competitive like bedwars\nd: ok sure\n \n\n1:53 pm\n\n \ng: i enjoyed playing with you\nd: you too! enjoy your dinner :)\ng: thank you, i will\n[read 1:54 pm]\n \n\n2:37 pm\n\n \nd: GEORGE\ng: what?\nd: hello\ng: hi\nd: did you give Sapnap my number?\ng: maybe\ng: i forgot to tell you about that\ng: sorry\ng: he just wouldn’t stop bugging me about it\ng: i should’ve asked you first before giving it to him, but i wasn’t thinking\nd: it’s ok\nd: I just wasn’t expecting it\nd: sorry for interrupting your dinner\ng: you’re good\ng: i finished not too long ago\ng: i was just watching youtube\nd: oh ok\ng: let me know if he’s bothering you\nd: I will :)\n[read 2:44 pm]\n \n\n3:07 pm\n\n \ng: are you two still texting\nd: yeah\ng: what are you even talking about\nd: you stuff\ng: stuff?\nd: I don’t know\nd: we’re just talking\ng: oh\ng: okay\ng: i guess you don’t want to talk to me then have fun lol\nd: thanks\n[read 3:11 pm]\n \n\n3:22 pm\n\n \nd: we finished talking\ng: cool\nd: he seems like an interesting friend to have\ng: yea\nd: how long have you two been friends?\ng: idk\nd: are you ok?\nd: you seem\nd: upset\ng: no i’m fine\nd: oh ok\nd: if you say so :)\n \n\n3:37 pm\n\n \ng: do you like sapnap more than me?\nd: what?\nd: no!\nd: what makes you think that?\nd: I’ve only known him for like an hour\nd: and I already can’t understand how you put up with him\ng: just wondering i guess\nd: is that why you seemed so off earlier?\ng: possibly\nd: you’re cute~\nd: I’m sorry for making you think that though :(\ng: don’t worry about it\nd: I’m going to stream in a bit if you want to watch\ng: sure\nd: oh, and George?\ng: yes?\nd: I really like you\nd: nevermind\nd: ttyl :)\ng: okay lol bye\n[read 3:44 pm]\n\n\njuly 6th, monday\n\n\n\n2:34 pm\n\n \ns: heyoooo\nd: hi?\ns: its nick\nd: Nick?\nd: I don’t know a Nick\ns: ohh wait sry\ns: its sapnap lol\n[read 2:36 pm]\n \n\n2:44 pm\n\n \nd: nice to meet you, Sapnap\nd: Nick\nd: whatever you want me to call you\ns: u can call me nick if u want\ns: and u to\n \n\n2:49 pm\n\n \ns: sooo clay\nd: ?\ns: i cant believe u stole my best friend\nd: so that’s what this is about?\nd: look, I didn’t mean to\nd: I’m sorry\ns: bro im just joking u\ns: its chill\ns: hes still my best friend tho\nd: ok ok\nd: don’t worry\nd: I will not be pulling any thievery\ns: we will see about that\n \n\n2:56 pm\n\n \ns: i have a question for u\nd: what is it?\ns: what do u think about george\nd: what do you mean by that?\ns: like\ns: whats ur opinion on him\ns: what do u like about him\nd: hm\nd: well\nd: I like how he’s opening up to me\nd: and he has a good sense of humor even though most of the time he’s just bullying me\nd: but at the same time I think that too is funny\nd: I like his name\nd: George\nd: and I like that we have similar interests\nd: he’s interesting to talk to\nd: I like that I never know what to expect from him\nd: he’s full of surprises haha\ns: woah woah ok wait\ns: it sounds to me like\ns: u like him?!?!?!\nd: of course I like him\nd: he’s my friend\ns: no u DUMBASS\ns: like ur CRUSHING on him\nd: oh\nd: uhm\nd: I’m not\ns: r u sure about that\ns: just tell meee\ns: i wont tell him\ns: if thats what ur worried about\nd: ok fine\nd: I might really really like him\nd: maybe\ns: u dont sound so sure\nd: bc this is new to me\nd: I’ve never\nd: liked a boy\ns: tell me more then\ns: i can determine whether or not u like him\nd: ok?\nd: if you’re sure?\ns: DO IT\ns: how do u feel when u talk to him\nd: I’m not sure\nd: happy?\nd: sometimes he’ll say something\nd: that’ll make me grin\nd: and then I can't stop grinning for a whole minute or longer\nd: or my heart will feel like it could burst out of my chest\nd: and when he mentions you\nd: I get kind of upset\nd: no offense or anything\ns: right\ns: u kno\ns: the other day george told me that u told him a story\ns: a pretty gay story\ns: i think thats proof enough in itself\nd: why did you even ask me then?\ns: idk\ns: just curious\nd: do you know what it feels like to like someone?\ns: as a matter of fact\ns: yes\ns: im totalyl head over heels for someone atm\nd: it’s not George, is it?\ns: lol r u jelly\ns: but dont worry its not georgie\ns: thats gross\ns: cuz hes a little freak\ns: did u kno\ns: that people actually ship george and i\ns: its called georgenap\ns: idk why they do\ns: all we do is argue\ns: and yell at each other\n[sent 3:09 pm]\n \n\n3:12 pm\n\n \ns: nowww ur jealous\nd: I’m not\nd: George was texting me\ns: suree\ns: lie all u want\ns: i can see right thru u\nd: ok so\nd: maybe I am a BIT jealous\nd: but I was telling the truth about George texting me\ns: what was he txting u about ;)\nd: he was asking what we were talking about\ns: did u tell him\nd: obviously not!\ns: well maybe u should go talk to him instead of me\ns: knowing him\ns: he might be getting jelly to\nd: why??\nd: because you’re takking to me instead of him?\nd: talking*\ns: no\ns: ur even denser then him wtf\ns: just go talk to him\ns: confess ur undying love or smth while ur at it\nd: I’m not doing that\ns: i probably shouldnt b telling u this\ns: but\ns: george gushes about u alot\nd: he does?\ns: he does\ns: so b nice to him\ns: if i find out u hurt him\ns: ur dead\nd: I would never hurt him on purpose\nd: you have my word\ns: good\ns: now go out\ns: get yo mans\nd: what?\ns: u BRICK\ns: just GO\nd: ok\nd: bye\n[read 3:22 pm]\n\n\njuly 7th, tuesday\n\n\n\n4:02 am\n\n \ng: there are some things that i’ve been wanting to get off my chest\ng: i don’t know what sapnap told you, but it’s been eating me alive\ng: and i know it’s probably selfish of me to feel this way\ng: especially since i know that until now i’ve been the only one you’ve had to talk to\ng: but\ng: [message redacted]\ng: that was stupid\ng: that was really stupid\ng: i just need to take a break and get a grip on my feelings\ng: i’ll talk to you later\n \n\n10:17 am\n\n \nd: what did you delete?\nd: I didn’t get to read it :(\nd: but I won’t bug you about it since I know you didn’t want me to read it\nd: so I hope it makes you feel better that I didn’t see it :)\nd: and I hope you’re ok\nd: oh and also\nd: he didn’t really tell me anything\nd: if anything, I told him things\nd: he did tell me this one thing\nd: but it wasn’t bad, so you don’t have to worry about it\nd: and from what I know about you\nd: you aren’t selfish\nd: and although I don’t know what you said\nd: I just want to tell you\nd: that I definitely prefer talking to you over Nick\nd: just to let you know :)\nd: text me when you’re feeling better!\n[sent 10:22 am]\n\n \n\n\n4:38 pm\n\n \nd: hey\nd: I hope I’m not bothering you\nd: but\nd: there’s something important I need to tell you when you see this\n[sent 4:39 pm]\n\n \n\n\n4:50 pm\n\n \nd: I just realized that sounded a bit threatening\nd: it’s not bad, I promise!\nd: at least\nd: I hope it won’t be bad for you haha\n[sent 4:50 pm]\n\n \n\n\n11:09 pm\n\n \nd: I might as well just get it over with\nd: and you can respond later\nd: uhh\nd: how do I say this?\nd: George\nd: I’ve been thinking and\nd: I think that you deserve to know that I\nd: kind of\nd: ..on second thought, maybe this isn’t a very good idea\nd: I’ll tell you when I know that you’re reading my texts\n[sent 11:11 pm]\n\n \n\n\n\njuly 8th, wednesday\n\n\n\n5:25 am\n\n \nd: good morning!\nd: are you feeling better today?\n[sent 5:25 am]\n \n\n8:32 am\n\n \nd: is it bad that I’m starting to get worried about you?\nd: I know it’s only been a day but\nd: I can’t help it\nd: I miss you D:\n[sent 8:33 am]\n\n \n\n\n9:48 am\n\n \nd: nothing bad happened to you, right?\nd: your phone is just on silent\nd: ..right?\n[sent 9:48 am]\n\n \n\n\n12:44 pm\n\n \nd: Nick told me that you haven’t been responding to him either\nd: it would’ve made me feel better if you were only ignoring me but knowing you’re not responding to either of us makes this situation worse\nd: are you ok?\n[sent 12:46 pm]\n\n \n\n\n1:29 pm\n\n\n \n\n\n[calling ‘George &lt;3’]\n\n\n[call lasted 3 seconds]\n\nd: you didn’t pick up...\nd: if something’s wrong, please tell me\nd: I don’t want this to end up like how it did last time :(\n[sent 1:31 pm]\n\n \n\n\n8:42 pm\n\n \nd: tomorrow will be a better day\n[sent 8:42 pm]\n\n\njuly 9th, thursday\n\n\n\n2:42 am\n\n \nd: I just got the notficiaifon thay you’re stremani g\nd: I don’t know wehther to be upset or relieved\nd: but I’ll watch it anywyas\n \n\n2:50 am\n\n \nd: OH\nd: oh\nd: George I know you’re not going to see this until later\nd: but thank you for telling me what happened through the stream\nd: I didn’t realize you damaged your phone\nd: that really sucks\nd: I hope it gets fixed soon :)\n[sent 2:52]\n\n \n\n\n3:08 am\n\n \nd: I would continue watching your stream, but I don’t know that I’d be able to stay awkake haha\nd: I’m really tired after worrying all day\nd: but don’t feel bda when you see this!\nd: I’m just glad you’re ok\n[sent 3:09 am]\n\n \n\n\n8:14 am\n\n \ng: hi\n \n\n8:22 am\n\n \ng: i know you said not to feel bad\ng: but i’m sorry for everything\ng: to tell the truth, on tuesday i had my phone on do not disturb because i was trying to sort some things out\ng: on wednesday though, i kind of forgot it was still on do not disturb\ng: and i just didn’t check my phone\ng: so then when you called me\ng: it went through and rang\ng: because i kind of have you in my favorites\ng: but besides that\ng: i went to grab my phone and saw it was you calling, and i panicked and dropped my phone\ng: i would’ve streamed earlier to try to tell you what happened\ng: but i thought that it wouldn’t take that long to repair, so i didn’t bother\ng: but it ended up taking forever\ng: that’s why i was streaming so early in the morning for me\ng: i actually just picked it up\ng: the first thing i did was text you\ng: i should probably text sapnap, but i can do that later\ng: i need to drive home lol\ng: sleep well\n[sent 8:30 am]\n\n \n\n\n9:10 am\n\n \nd: GEORGEEEE\nd: you’re back :D\ng: clay\ng: i’m back :)\nd: I shouldn’t have called you\nd: that was stupid\nd: all it did was make me have to wait longer to talk to you again\ng: it’s not your fault\ng: you didn’t know\nd: I guess\nd: I just couldn’t think straight at that point\nd: I had to do something to find out if you were ok\ng: well i’m okay now\ng: i promise\ng: so you don’t need to worry about me anymore\nd: I’m glad\nd: it wasn’t too expensive to fix your phone, right?\nd: because if it was I can give you some money to help since I was the cause of you dropping it\ng: it wasn’t an outrageous price\ng: besides, how many times do i have to tell you it’s not your fault?\ng: it’ll be fine, clay\nd: ok ok sorry\nd: I can’t help it\nd: I just\nd: I just really missed talking to you\nd: even though it was such a short amount of time\ng: i missed talking to you too\ng: even though i was the one who separated us\ng: but\ng: it did give me time to think some things through\ng: and now i feel a lot better\ng: in some ways at least\ng: so it wasn’t for nothing\ng: i guess\nd: that’s good to hear!\nd: that makes my suffering worth it haha\ng: lol\ng: i’ll try to make sure this doesn’t happen again\nd: I mean\nd: it wasn’t too bad\nd: both of us kind of overreacted anyways\nd: it wasn’t like it was a week or something like that\nd: it was only 2 days\ng: i don’t think you overreacted\ng: i would probably freak out too if you stopped texting for two whole days\nd: aw, you would?\ng: yeah\nd: :)\n \n\n2:33 pm\n\n \nd: hey, George?\nd: you know you can tell me anything, right?\nd: nothing you say will ever make me leave you or avoid you\nd: I promise\ng: thank you, clay\ng: i’ll keep that in mind\ng: and if there’s something i can’t tell you\ng: it’s not because i don’t trust you to react well\ng: it’s because i’m not ready for you to know\nd: you’re making it sound like you have some big secret you’re keeping from me\ng: maybe i am\ng: maybe i’m not\ng: i guess you’ll find out when i get the little push i need to tell you\ng: if i am hiding something that is ;)\nd: George~\nd: you’re just trying to make me curious, aren’t you?\ng: perhaps\nd: it’s fine\nd: I can live with it\nd: just for you, babe ;)\ng: god\ng: you’re so infuriating\nd: how?\nd: what did I do wrong :,(\ng: just\ng: don’t call me that\ng: you weirdo\nd: if anyone here’s a weirdo\nd: it’s you, Georgie poo~\ng: that’s even worse\ng: stop\nd: no can do :)\nd: I’m enjoying myself too much\ng: o.o\ng: i’m out\ng: later\nd: bye bye George &lt;3\n[read 2:46 pm]\n\n\njuly 10th, friday\n\n\n\n10:26 am\n\n \ng: hey gmg: are you awake yet?\nd: yeahd: I pretty much just woke up, actuallyd: why?\ng: well i was wonderingg: you mentioned you had something to tell me the other dayg: what is it?g: or do you not want to tell me anymore lol\nd: oh rightd: thatd: I’ll tell youd: I just need to build up my confidence again\ng: is it that big?\nd: welld: I’d say so\ng: ohg: now i’m kind of nervous\nd: you’re not the only one\ng: i guess justg: tell me when you’re ready\nd: alright\n \n\n12:09 pm\n\n \nd: I’m ready to tell you\ng: okay, go ahead\nd: Georged: we may have only known each other for a monthd: and for a lot of that time I didn’t even know your named: or your genderd: or all that much about youd: but what mattered was that you were thered: and you’re still hered: we’ve both learned that it’s hard to be apart from each otherd: we’ve both made mistakesd: and we’ve both grown a lot as peopled: or at leastd: I haved: and to me, I feel like you have tood: I don’t know what I would do if I had never met youd: but I do know thatd: I want to be more with youd: and I know confessions through text are the least romantic thing everd: but I just can’t keep it to myself anymored: I really really really like you, Georged: and although I’ve never been in a long distance relationship before, I’ve heard it can be hardd: but I think we could make it if you feel the samed: so George, will you be my boyfriend?[read 12:16 pm]\n\n \n\n\n12:21 pm\n\n \nd: I’m sorryd: that was too soon, wasn’t it?d: can we still be friends?d: please?[sent 12:22 pm]\n\n \n\n\n12:28 pm\n\n \nd: George?[sent 12:28 pm]\n\n \n\n\n12:35 pm\n\n \ng: i think i’m in love with youg: nog: i know i’m in love with you, clayg: and i want to be with youg: so yesg: i’ll be your boyfriend\nd: YESd: I meand: uhhhd: I wasn’t exsclty expecting that responsed: so I’m just really happy rnd: like really relaly happyd: I want to hug youd: and never let god: can I fly to youd: or fly you to me?d: I’ll payd: I want to see you so badly\n\n[calling ‘George &lt;3’]\n\n\n[call lasted 9 minutes 22 seconds]\n\n\n \n\n\n12:48 pm\n\n \nd: hearing you laugh because of me is probably the best feeling in the worldd: I can’t believe I finally got to experience itd: this is the best day everd: I don’t think I’ll be able to focus on anything else the rest of the dayd: and I already miss hearing your voiced: can we call again?\n\n[incoming call from ‘George &lt;3’][call accepted]\n\n\n[call lasted 2 hours 4 minutes 43 seconds]\n\n\n \n\n\n2:56 pm\n\n \nd: have a nice streamd: I’ll be watching ;)\ng: actually, i was thinkingg: would you like to join me in my stream?\nd: like...vc?\ng: and possibly playing togetherg: you can be my special guest lol\nd: yes!d: I would love to :)d: as “friends” right?\ng: yeahg: they don’t even know i talk to youg: so if i randomly brought you on stream and introduced you as my boyfriend, they’d go nuts\nd: are you going to tell Nick?\ng: it’s still so weird to me for you to call him nickg: i’m so used to sapnapg: but yes, i will after the stream\nd: then let’s get this startedd: what’s your Discord?\ng: georgenotfound#5789\nd: I’ll add you, then we can get in a call and discuss from there :)\ng: sounds good\n \n\n9:12 pm\n\n \nd: that was fun, thanks for letting me join\ng: of courseg: it went a lot better than i’d expectedg: we should do it more often :)\nd: I’d like that :)\ng: well i’m gonna go to sleep\nd: okd: goodnight~d: see you in 2 days &lt;3!!!\ng: nightg: &lt;3[read 9:14 pm]\n\n\njuly 10th, friday\n\n\n\n12:15 pm\n\n \ng: SAPg: SAPNAPg: NICK\ns: yoo chill outs: im heres: whats up\ng: CLAY’S CONFESSINGg: HE’S CONFESSINGg: HE JUST ASKED ME OUTg: SAPNAP WHAT DO I DO\ns: i thought u were dyings: just tell him u like hims: and say yess: its not that hard\ng: it IS that hardg: i can’t justg: i don’t know\ns: uve been simping over him for the past weeks: and now that hes telling u he returns ur feelinfss: ur shying away like a pussy\ng: i don’t think he feels the same as me though, sapg: i love himg: i don’t think he’s at that point yetg: he might never be at that pointg: and i don’t want to scare him away by telling him that\ns: then dont tell him\ng: i can’t do that either!!\ns: THEN JUST TELL HIM\ng: how?\ns: omgs: ur overthinking this so hard rns: tell him the truths: how u rly feel about hims: how did he phrase his confession?\ng: [image sent]\ns: tell him u rly rly rly like him to lol\ng: but that just doesn’t feel right\ns: listens: georges: im obv not helpings: so just take a minute for urselfs: and think about exactly how u feel about hims: then tell hims: and stop leaving him waitings: hes probably dying since i presume u arent responding\ng: yeah he’s texting me more because he’s worried he ruined our friendship\ns: U ABSOLTUE IDIOTs: RESPOND\ng: BUT I STILL DON’T KNOW WHAT TO SAY\ns: ur not listening to mes: set down ur phones: focus on ur feelingss: then release thems: to hims: dont think about what ur sayings: just spills: NOW GO[read 12:32 pm]\n\n \n\n\n12:45 pm\n\n \ns: howd it go[sent 12:45 pm]\n\n \n\n\n12:51 pm\n\n \ns: im guessing goods: have fun with ur new bfs: but dont forget about mes: im ur og[read 12:52 pm]\n\n \n\n\n8:10 pm\n\n \ng: we’re dating now\ns: i could tell by the way the 2 of u were talking during ur stream\ng: was it that obvious?\ns: not to people who dont know whats going ons: but i could tell u 2 seem rly happys: so im rly happy to :)s: for u 2\ng: thanks, sapg: i’d talk longer, but clay and i are still in a call\ns: its fines: as long as u promise to talk to me more tmrw\ng: i will\ns: now go have fun w ur bfs: keep it pg tho\ng: SAPNAPg: you’re disgusting\ns: look at urself\ng: i hate youg: bye\ns: love u to georgie poooo xx[read 8:19 pm]\n\n\njuly 11th, saturday\n\n\n\n11:24 am\n\n \nd: tomorrow can’t come soon enough :(\ng: what does that mean?\nd: it means that I want to see you now\nd: I don’t want to wait :((\ng: well that’s your fault for booking it tomorrow instead of today\nd: oh you’re right\nd: I should change it then!\nd: oh but I have some stuff to finish today\ng: then go finish your stuff, you idiot\nd: I’m your idiot ;)\ng: that’s the cheesiest thing you’ve ever said to me\nd: but it’s true\ng: have you packed yet?\nd: no\ng: omg you’re so\ng: frustrating\ng: go pack\ng: and finish your stuff\ng: and stop talking to me\nd: but I like talking to you D:\ng: i like talking to you too\ng: but we can talk tomorrow\ng: in person\nd: I guess you’re right :(\ng: ik i’m right\nd: well\nd: ttyl &lt;3\ng: bye\n \n\n6:12 pm\n\n \nd: I’m done with everything :)\ng: oh good job\ng: i’m proud of you\nd: :D\ng: what all did you have to do, anyway?\nd: obviously pack\nd: I recorded and somewhat edited two videos to have prepared to upload for when I’m there\nd: but I’ll have to finish editing completely when I’m there\nd: I dropped off Patches at a pet boarding place\nd: I think that’s about it\nd: I also picked up some food and ate dinner\ng: you’ve had a productive day\nd: yeah I have\nd: but now I get to relax and talk to you &lt;3\nd: OMG GEORGE\nd: I just realized!\ng: ??\nd: I know what you look and sound like!!\ng: oh\ng: right\nd: you know\nd: you look like a teenager haha\nd: are you sure you’re 23?\ng: yes i’m sure &gt;:(\nd: I’m joking\nd: I think you’re really cute &lt;3\nd: and your voice is cute too\nd: I can’t wait to see you in person\nd: you’ll be even cuter!\ng: omg clay stop\nd: am I flustering you ;)?\ng: stoppp\nd: ok ok I’ll stop haha\nd: how heavy are you?\ng: what kind of question is that???\nd: oh my god that sounded really weird\nd: I just wanted to see if I could pick you up when I hug you\nd: I’m sorry :,(\ng: oh\ng: uh\ng: i’m fairly light i guess\ng: it really depends on how strong you are\nd: it sounds to me like you want me to pick you up ;))\ng: isn’t your flight early tomorrow?\ng: maybe you should go to sleep early\nd: I see you changing the subject, George~\nd: I’ll make sure to pick you up and spin you around when I see you :)\ng: i’m not changing the subject\ng: i’m just saying\nd: you’re not going to be able to escape my love irl so easily Georgie &lt;33\ng: your flight is in like 10 hours\ng: please get some sleep\nd: fine\nd: anything for you :)\nd: goodnight &lt;3\ng: gn &lt;3\n \n\n\njuly 12th, sunday\n\n\n\n2:02 am\n\n \nd: I just got up\nd: time to get ready and drive to the airport :D\n \n\n2:49 am\n\n \nd: just got to the airport\nd: about to go through security\nd: it’s like a ghost town in here\nd: probably because it’s so early haha\n \n\n3:21 am\n\n \nd: ughh waiting is so boring\nd: I think we’re going to start boarding soon though\n \n\n3:53 am\n\n \nd: just got on the plane\nd: [image sent]\nd: there’s not many people on this flight it seems\nd: so I get a row to myself :D\nd: which means I can keep the window closed the whole time without worrying about other people wanting it open\nd: how could you even want to look out when you’re so high up in the air??\ng: i like it\nd: GEORGE\ng: hi\ng: are you scared of flying?\nd: don’t laugh but\nd: kind of\ng: it’s going to be okay\ng: you’ll be here in the uk before you know it :)\ng: it’s super unlikely for something to happen, so there’s no reason for you to be worried\ng: if you’re ever starting to get nervous, look at this\ng: [image sent]\nd: I already feel so much better\nd: thank you\nd: also that picture of you is adorable\nd: I’ll make sure to do that :)\ng: good\nd: oh, we’re about to leave, so I have to go\nd: I’ll text you when I land\ng: okay\ng: have a nice flight &lt;3\n \n\n10:34 pm\n\n \nd: I’ve landed\ng: finally oh my god\ng: luckily the airport isn’t too far from my house, so i’ll be there soon\nd: ok\nd: I’ll go get my suitcase then wait outside\nd: see you soon :)\n[read 10:36 pm]\n \n\n10:41 pm\n\n \nd: I’m outside\ng: i’m on my way\ng: btw i’m kind of coming in an uber\ng: since i can’t drive\nd: oh ok\nd: why have you never learned?\ng: well i’ve tried to get my license multiple times\ng: and failed each time\ng: also driving is scary\ng: i don’t trust myself at the wheel\nd: that’s fair\nd: still, you should keep trying\nd: not being able to drive can be really inconvenient at times\ng: i know :(\nd: I’ll just have to motivate you to try again\ng: okay lol\ng: thanks\nd: of course!\n \n\n10:56 pm\n\n \ng: i just got out of the car\ng: where are you?\nd: wait I see you\n[read 10:56 pm]\n\n\njuly 13th, monday\n\n\n\n\n4:13 am\n\n \nd: you aren’t awake yet so I’m just going to text youd: I didn’t think you could be even cuterd: yet here we ared: [image sent]d: I took another of just you and made it my lock screen &lt;333d: this is so surreal to med: we met a month ago due to a wrong number mishapd: and now I’m laying here by your side while you’re asleepd: I love thisd: I love being here with youd: Georged: I love youd: oh no, I think the light of my phone screen is starting to wake you up :(d: I’ll try to go back to sleepd: and if I can’t, then I’ll just enjoy being with you :)\n \n\n8:58 am\n\n \ng: i love you toog: it’s good you fell back asleep :) that’ll help with jetlagg: if you need me, i’ll be in the kitchen making breakfastg: and don’t worryg: i don’t have sriracha so i can’t do anything to your food lol\n \n\n\njuly 14th, tuesday\n\n\n\n11:45 am\n\n \nd: hey\ng: hi?g: i’m literally sitting right next to you\nd: I know butd: I want to ask you something\ng: why can’t you ask me irl\nd: becaused: I’m shy\ng: ummm okay?\nd: so remember what I did when I first saw you?\ng: yesg: how could i forget?\nd: well I was wonderingd: can I do that again?\ng: pick me up and spin me around?g: i mean sureg: it was kind of fun lol\nd: no I meand: kiss youd: are you ok?d: you made a weird noise\ng: yes i’m fineg: uhg: go ahead ig\nd: :D\n \n\n11:56 am\n\n \ng: could we do that again?[read 11:56 am]\n\n \n\n\n\njuly 15th, wednesday\n\n\n\n2:29 pm\n\n \nd: where are you :(d: I got lost while looking for something\ng: this is why you shouldn’t have told me to let you go by yourself\nd: I wanted to surprise you with it :((\ng: what were you even looking for?\nd: I can’t tell you\ng: whateverg: what aisle are you ong: i’ll come get you\nd: uhhhd: no idead: I’m on liked: the aisle next to the freezer aisle\ng: alright just hang tightg: i’m omw\nd: WAITd: I found itd: go wait at the exit, and I’ll go pay for it then meet you there\ng: okay but hurry up because i’m tired of carrying these bags\nd: I will don’t worry\n \n\n3:37 pm\n\n \ng: [image sent]g: why are you buying a bottle of sriracha\nd: I told you to wait :(d: it was supposed to be a surprise\ng: well i saw you walking with it to the cash register sog: answer my question\nd: I thought it’d be funny\ng: to sneak some into my food?\nd: yeah\ng: that’s so not coolg: i’m breaking up with you\nd: Georgie no :,(\ng: you calling me georgie is just making me think of sapnap so stop\nd: GEORGIEd: GEORGIE PELASE\ng: actually stop\nd: :( fine\ng: get your ass over hereg: i want to go home\nd: whatever mom\n \n\n\njuly 17th, friday\n\n\n\n1:23 am\n\n \nd: so, you’re streaming…\ng: i amg: why?\nd: well, I was thinking\ng: you want to join me?\nd: wow how’d you know haha\ng: i know you, clayg: i have my face cam on, thoughg: and you haven’t done a face reveal yet, right?\nd: no\ng: do you want me to turn it off, then?\nd: nod: they all want a face reveal, so let’s give them a face reveal\ng: are you sure?\nd: yeah, let’s do itd: might as well tell them we’re dating while we’re at itd: end Georgenapd: make the simps stop simping\ng: jealous, are you?\nd: maybed: I want you all to myself ;)\ng: rightg: wellg: chat is getting irritated that i’m continuing to text without telling them who it isg: so hurr yupg: okay bye\nd: I’ll be in there soon~\n \n\n2:55 am\n\n \ng: that was honestly embarrassing\nd: is that why you’re texting me? :(\ng: yesg: i can’t believe you did that\nd: whaaat\ng: you can’t just come in, go “geoooorge,” come up behind me, lay your chin on my head, then casually greet the streamg: that’s not allowed\nd: why not?d: it was funny\ng: for you, maybeg: but not for me!\nd: that’s because you were too busy being flustered to imagine the faces of the viewers at that momentd: I couldn’t even read the chat, it was going so fastd: c’mon George, just think about itd: it was perfect\ng: ...maybe it was a little funnyg: but that doesn’t mean i’m letting you get away with that\nd: what are you gonna do? make me sleep outside?d: wait, why’d you leave the roomd: Georged: what are you doing?\ng: [image sent]g: you can run, but you can’t hideg: &gt;:)\nd: SHITd: A NERF GUN?!\ng: that’s rightg: i can smell your fear, clay\nd: :,( please don’t hurt med: I didn’t do anything wrongg\ng: i hear your scuttling feetg: you’re not very good at hiding\nd: GOA WAYd: SOTP TAUNTING ME\ng: i see you[read 3:19 am]\n\n \n\n\n\njuly 18th, sunday\n\n\n\n7:43 am\n\n \nd: George?d: why’d you lock yourself in the bathroom?d: you sound like you’re cryingd: are you okay?\ng: i don;t want you to leave otdayg: i jus togt to meet youg: and you’re alreayd aobut to og\nd: George...d: we’ll have many more times in the future to see each otherd: and besides, we met through textingd: we can continue to manage long distanced: I know we can\ng: i gues syou’re rightg: i’m jsut worried\nd: everything will be ok, Georged: you have nothing to worry about :)d: and I can always fly out or fly you out if need be\ng: are you syre\nd: 100%d: also, we can FaceTime every day\ng: that sounds nice\nd: I agree :)d: and if you ever miss me too much, I won’t hesitate to buy a plane ticket\ng: do you promise?\nd: I promise\ng: you knowg: i was scared that once you met me, you’d realize that i was different than what you imagined when i was only someone you talked to through a screeng: especially since we met only around a month agog: and for a lot of that time, you didn’t even know my name or my genderg: but i was wrongg: so very wrongg: so thank you, clayg: so muchg: for proving me wrongg: and for being here\nd: I love you, Georged: and that will never changed: I don’t care how we metd: or how long we’ve known each otherd: because that doesn’t change my feelings for youd: and no matter the difficulties we go throughd: or the arguments we faced: through every deleted messaged: I’ll keep on loving you &lt;3[read 7:52 am]\n\n\njuly 18th, sunday\n\n\n\n6:14 pm\n\n \nd: just landed\nd: miss you already :,(\ng: wow, already?\ng: maybe we should just move in together if you can’t bear to be away from me\nd: good idea\nd: also I know you miss me too\ng: i was joking\ng: and yes\ng: i do miss you\nd: Georgie admitting to missing me?\nd: I must be the chosen one\ng: haha very funny clay\nd: what? it’s true &lt;3\ng: i guess it is\n \n\n\njuly 19th, monday\n\n\n\n9:12 am\n\n \nd: GEORGE\nd: YOU’LL NEVER GUESS WHAT JUST HAPPENED\ng: what\nd: I saw Alyssa\nd: she didn’t see me until I approached her but\nd: I told her about you\nd: and then I thanked her\ng: you thanked her?\nd: well if it wasn’t for her, I would have never met you\ng: what did she say?\nd: she found it funny\nd: she tried to apologize about not giving me her number, but I didn’t let her\nd: she did explain it, though\nd: she said that the flirting was cute and that I seemed like a nice guy, but she wasn’t interested in dating at the time\nd: so she didn’t know how to turn me down\nd: she just hoped she’d never see me again so it wouldn’t end up awkward\ng: aw\ng: well i guess that clears everything up\nd: yeah\nd: but guess what\ng: hm?\nd: she asked me for my number\ng: ???\nd: she wanted to stay in touch\nd: so I gave her the wrong number\ng: oh my god\nd: who knows, maybe she’ll find love like I did?\ng: clay\ng: you’re impossible\nd: but you love me anyways ;)\ng: but i love you anyways, you weirdo\nd: I just hope I never run into her for a third time and have to confront her about it\ng: well if she had the same thoughts and it ended up going well, what do you have to be scared of?\nd: my plan not working, and she doesn’t even make a friend out of it?\ng: i suppose that’s true\ng: but i doubt you two will see each other for a while if ever, so you have nothing to be worried about :)\nd: thanks Georgie~\nd: I appreciate your reassurance\ng: of course clay\n[read 6:29 pm]\n\n \n\n\n7:49 pm\n\n \nd: hey\nd: so I’ve been coding this new thing for Minecraft, and I need someone to experience it with\nd: so\nd: would you like to film a video with me later?\ng: [message redacted]\nd: oh :(\ng: i’m joking\ng: i’d love to\n\n[calling ‘George &lt;3’]\n\n\n[call lasted 2 seconds]\n\ng: did you really just call me to say you love me?\nd: maybe\ng: oh my god\ng: you’re ridiculous\n\n[calling ‘clay’]\n\n\n[call lasted 1 second]\n\nd: now who’s ridiculous?\ng: oh shut up\nd: &lt;3\n[read 7:54 pm]"
}