{
    "id": "25126840",
    "url": "https://archiveofourown.org/works/25126840?view_full_work=true",
    "author": [
        "renthegenderfluid"
    ],
    "title": "meeting the hatchling",
    "rating": "Mature",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "Gen",
        "Other"
    ],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Aizawa Shouta | Eraserhead & Midoriya Izuku",
        "Bakugou Katsuki & Midoriya Izuku"
    ],
    "characters": [
        "Midoriya Izuku",
        "Aizawa Shouta | Eraserhead",
        "Bakugou Katsuki",
        "Yagi Toshinori | All Might",
        "Class 1-A (My Hero Academia)"
    ],
    "additional_tags": [
        "Quirkless Midoriya Izuku",
        "Dead Midoriya Inko",
        "Dead Midoriya Hisashi",
        "Abusive Midoriya Hisashi",
        "Parental Aizawa Shouta | Eraserhead",
        "Aizawa Shouta | Eraserhead Adopts Midoriya Izuku",
        "Midoriya Izuku Does Not Have One for All Quirk",
        "Midoriya Izuku Does Not Go to U.A. High School",
        "Shiketsu High Student Midoriya Izuku",
        "BAMF Midoriya Izuku",
        "Quirk Discrimination (My Hero Academia)",
        "Midoriya izuku puts people in their places",
        "no beta we die like women",
        "Minor Character Death"
    ],
    "language": "English",
    "series": "Part 1 of Aizawa's little viper",
    "published": "2020-07-07",
    "completed": null,
    "words": "5,436",
    "chapters": "1/1",
    "comments": "134",
    "kudos": "11,318",
    "bookmarks": "1,360",
    "hits": "91,753",
    "summary": "<p>\n<i>“You think my lack of a quirk makes me weak.” It’s a statement, not a question. His eyes scan those of Class 1-A, at least the ones who hadn’t averted their eyes in guilt at his statement.</i>\n</p>\n<p> </p>\n<p> </p>\n<p> <i>“Well...no offense my dude, but being a Hero without a quirk could put you in a lot of danger,” Kaminari pipes in, voice shaking slightly, his words punctuated with nervous laughter.</i></p>\n<p> </p>\n<p> <i>“And being a Hero with that kind of prejudice <b><i>will get you killed</i></b>.” </i></p>\n<p> </p>\n<p>OR Aizawa takes his son to school and Izuku makes people eat their words.</p>",
    "notes": "<p>HI!!! so this is my first work in this fandom, and also the longest fic I've written to date. I accept constructive criticism so please feel free to comment just don't be mean, This may turn into a series, spanning the lives of Shouta and Izuku as father and son, and some romance may crop up later on. I love quirkless izuku so I hope i did him justice. please enjoy reading!!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>hope you guys enjoyed this story. please comment any ideas or if you would like more of this universe. and the move izuku used on bakugou is real and does work.</p>\n<p> <a href=\"https://www.youtube.com/watch?v=DcaOr1TBA1w\" rel=\"nofollow\">here</a> the video i used for reference. Thank you so much for reading and feel free to drop a comment. Bye~</p>",
    "text": "“If I let you come to school with me, what do I get in return, Problem Child?” Shouta said, looking dubiously at his son, whose first year class at Shiketsu High had been graciously awarded a rest day after a week of intensive training. His son, Aizawa Izuku, was also now desperately trying to get him to agree to let Izuku tag along with him to UA to sit in on his classes for the day. It was early morning, and Izuku had just finished making breakfast (like he did every morning after his dad’s night patrols even though the man insisted he didn’t have to. He had gotten a stern ‘Let someone take care of you sometimes Otō-san’ from Izuku who was surprisingly threatening, for a 14 year old in a Present Mic apron, when he wanted to be). \nShouta was sipping gingerly on a cup of freshly brewed coffee, when he asked what Izuku was doing on his day off. Izuku had then sprung the question of attending school with Shouta on him. The boy was now looking up at him with big, pleading green eyes that they both knew Shouta couldn’t say no to, and was awaiting an answer.\n“I’ll stop hiding those nasty pouch meals from you when you work graveyard shifts for a week.” he said innocently, trying his best to bargain. Dammit, Shouta thought Hizashi was the one who was hiding his pouches. Shouta sighed, knowing that Izuku would get his way one way or the other. He narrowed his eyes at the boy, who perked up under his gaze in knowing anticipation.\n“Fine, but be on your best behaviour.” \n“THANK YOU OTŌSAN!” Suddenly there was a surprisingly solid teenager wrapped around his midsection, rubbing his face into the fabric of Shouta’s sweater. Shouta chuckles softly at his boy’s antics and pats Izuku’s head of curls gently.\n“Maybe you can help me with my first years. Meeting you might be good for them, don’t think brat?” \n“Do I have permission to sass people?”\n“Would me giving you permission make a difference?” he levels Izuku with a look. The boy shrugs.\n“Maybe. For peace of mind.”\nShouta quirks an eyebrow at the teen still wrapped around him like a koala, levelling him with a flat look. “Mine or yours?” he asks.\nIzuku finally pulls away from his hug and straightening himself, he looks at Shouta with a mischievous grin. “Whichever makes you feel better, Otō-san.”\nIzuku then bolts out of the room, most likely already planning a list of questions for every person he is bound to meet at UA, or perhaps preparing a notebook for notes on Shouta’s first years. Shouta shakes his head fondly, his chest swelling with pride and happiness at Izuku’s enthusiasm, a testament to how far he’d come from the small, scared, orphaned boy Shouta found in the ashes of that apartment years ago. \nFor a split second, the cries of a small child amidst pillars of flame and smoke, the smell of burning flesh and the pained pleas for help all flash through Shouta’s mind. A domestic violence case, one that had spiralled wildly out of control resulting in the death of Izuku’s mother and father, had beckoned Shouta to the apartment complex in Mustafa. It was there in the midst of the destruction that he had found Izuku, beneath what may have been a table, curled tightly into himself, crying and scared. His chest tightens, even now, remembering the fear and guilt in those eyes, and Shouta thinks that perhaps that was the moment he vowed to keep that child, his child now, safe and sound. Though Izuku still harboured scars from the fire across his back and shoulders, and smaller, starburst-shaped scars along his neck and arms (that he still refused to tell Shouta how he got, though presumably from a former bully), through therapy and long, exhausting but necessary conversations with Shouta, his trauma did not hinder Izuku’s development in the slightest, even though traces of it remained.\nNow 8 years later, after adopting the 6 year old quirkless boy whom he refused to let into the atrocity that was Japan’s foster care system and raising Izuku as his own, Shouta had a devastatingly intelligent, deceptively strong and boundlessly kind son, who he loved with all his heart. The boy had been through more than any one person should ever have to deal with. From the quirk discrimaination and bullying (which were brought to Shouta’s attention shortly after Izuku began living with him), the abuse from his ungrateful bastard of a biological father (in Shouta’s humble opinion), the death of his mother, who was the little boy’s whole world, and the subsequent happenings of being thrust into the life of the son of a full-time teacher and Pro Hero. \nBut Izuku, ever resilient, had blossomed with Shouta, honing his skills for analysis, learning various forms of modern and traditional martial arts and fighting styles, and now the first quirkless child to attend Shiketsu High (top of his class and the year group) and aiming to be an Underground Hero (Like Otō-san! he had said when asked why, his dimpled and freckled cheeks stretched in a wide, proud smile that, Shouta was reluctant to admit, had made him shed a tear), all while still managing to be the kind, loving, selfless boy that his mother had raised him to be. \nShouta, finally pulling himself out of his reminiscing and finishing off his coffee, pushes himself off the counter, washes his cup and then heads to his room to get ready for the day. He just knows that Izuku combined with his troublesome first years, Class 1-A, was bound to be … interesting and very likely exhausting as well. Shouta sighs as he walks down the hall, dodging their Siamese, Latte, and their Russian blue, Charcoal, who were weaving in and out of his legs as he walked. Shouta let out another sigh, already feeling the exhaustion seeping into his bones, wondering just what fresh bout of chaos his son would bring down on the halls of UA.\n \n_________________________________________________________________________________________\nShouta stood outside the door to Class 1-A, checking his watch as he listened to the chatter behind the door. \n8:24:18\nShouta had already told Izuku to wait for them at Gym Gamma, and to wear his costume. Shouta wanted to test how well his student held up against Izuku. All Might was also supposed to be joining them.\n8:24:35\nHe was also anxious about how Izuku would be received. He was no stranger to quirk discrimination, and unfortunately had no doubt that these children would have been brought up to perpetuate those disgusting, ableist ideals. They were good children whose hearts were in the right places, but the kind of thinking that, sadly, the entirety of the Hero Industry and their society at large were built on, would get them seriously hurt. And he had no doubt that Izuku would have a ball making them see the errors of their way of thinking.\n8:24:55\nShouta cleared his head of those thoughts for the time being, listening to the sounds of 1-A quieting down, and grabbed the door handle and flung the door open.\n8:25:00\nEveryone was seated and looking at him with bright smiles. “GOOD MORNING AIZAWA-SENSEI!” they exclaimed loudly, though some (Iida and Mina) more loudly than others. He gave them a nod in response and walked to the front of the class to take attendance.\nWhen that was over and done with he addressed them directly.\n“Change into your P.E. uniforms and meet me at Gym Gamma. We are going to do a physical test today, and we have a guest today. Try not to make fools of yourselves.”\nHe exits the classroom with a dramatic slam of the door, one that Izuku surely would have made fun of him for if he had seen him.\nThe classroom erupts into curious chatter in his wake, all keen on knowing who their guest is as they make their way to the gym with their uniforms. \n“Do you think it’s someone we know? Or maybe a Pro Hero?” asks Uraraka.\n“I don’t know Ochaco-chan but it must be somebody important, if he doesn’t want us to make a fool of ourselves, kero~” pipes Tsuyu from beside her, as Iida vigorously nods his agreement and Todoroki and Shinsou only hum in response. \nKirishima and Kaminari are bouncing with excitement, while Bakugou only grumbles at their noisy and disruptive behaviour.\n“Do you have any idea of who it could be? I wonder what their quirk is,” Kirishimi says, grinning excitedly at Kaminari. \n“What if they're a cute girl, or a cute boy?” Kaminari retaliates jokingly, and in turn receives a resounding “thump!” on the back of the head from Bakugou.\n“Shut up Sparky! It doesn’t matter if they're fucking hot, I’m gonna beat ‘em anyway. So stay out of the way you damn extras!” Bakugou shouts, in his usual brash tone.\n \nMeanwhile, in Gym Gamma, Izuku was standing next to his father in his full gear, with the exception of his mouth guard and his xiphoids, which his Otō-san had deemed unnecessary. The dark browns and greys of his costume, along with his heavy black boots and weighted fingerless gloves, all tight on his well-toned body, along with his goggles, pushed up on his head, that made his viridian pupils key-holed, just like a snake’s, made him out to be surprisingly intimidating despite his unassuming stature. As Izuku rolls up the sleeves of his costume to reveal his scarred forearms, starbursts dancing across his skin, his Otō-san turns to him while inspecting his costume and asks, “You got your knives and staff?”\n“Yup! I got everything right here,” Izuku replies, patting the pockets that housed his knives, long and curved, just like the fangs of a gaboon viper, and the blades were laced with a mild anaesthetic, just enough to render an opponent unconscious for about a half an hour. “I wonder what your little heroes will think of me using knives? Scandalized maybe?”\nShoutout chuckles softly at his son’s question, already picturing Iida’s aghast expression and Yaoyorozu’s flustered apprehension. “Probably. Some of them will definitely enjoy it though,” hearing Kirishima and Kaminari’s enthusiastic yelling in his head.\n“You like them,” Izuku says after a minute of silence, giving Shouta a sly grin and a knowing arch of an eyebrow. “Look at you Otō-san, getting attached to children. I always knew you were a softie.”\n“Another word out of you and I’ll string you up from the ceiling, Problem Child,” Shouta says with no heat, his eyes smiling, as Izuku mimes zipping his mouth shut, mirth evident in his eyes.\nThe two sense someone entering the room, and their eyes travel to the doorway. Yagi is standing there in his muscular form, looking at them with a curious glint in his sunken blue eyes. He approaches them, and greets them both politely. \n“Good morning Aizawa-kun. Who may this young man be?” he asks, observing Izuku, not unkindly.\nShouta watches as Izuku inspects Yagi with a focused gaze. Shouta knows that Izuku already knows All Might’s true form, even before Shouta had told him, citing that the man was so careless, even he could figure it out from the numerous times he’d attended formal functions with his father. Shouta is convinced that Izuku doesn’t realize how scary his intuition is, or maybe he does.\n“Good morning Yagi-san. My name is Izuku. I’m here to assist with training,” Izuku says, smiling innocently, as if he didn’t just figure out the identity of the Number 1 Hero. Shouta almost lets out an unattractive snort at Yagi’s shocked face, and his subsequent shout of alarm. Izuku offers him a smile but nothing else.\n“No, I didn’t tell him. Figured it out himself. He’s just too smart for his own good. It gets him in trouble sometimes,” Shouta says, giving Izuku a slightly disappointed glance, and the boy just rubs the back of his neck sheepishly. “He’s my son, so he’s seen you at most of the functions that I’ve been forced to attend since I adopted him, both as All Might and as Yagi, and made the connection himself.”\nYagi looks at the boy next to Aizawa, and gives him an impressed smile. “Well it’s very nice to meet you, young man. I look forward to working with you.” He stretches out a thick hand to the boy, who smiles up at him and shakes his hand in return. “Don’t you have school today?”\n“Shiketsu doesn’t have school today, so he begged me to let him tag along, unfortunately,” Shouta pipes in.\n“You’re just mad because you can’t say no to me Otō-san,” Izuku quips, with a mischievous grin.\nShouta just sighs but doesn’t deny what they both know is true. Yagi watches both of them with a fond smile, this being the first time he’d seen Shouta not angry at the world. \n \nAt that moment, the students of Class 1-A start filing into the gym, everyone’s eyes immediately landing on the figure standing next to their home room teacher and All Might, who is surprisingly, their age. He had goggles resting on a head of wild, green curls, and was dressed in a costume of muted browns and grey, fitted and sleek, with many pockets and compartments that glinted like scales under the gym lights. He had scars running up the length of his neck and forearms and one creeping up the left side of his jaw, freckled cheeks and a wide smile, as he chatted with All Might.\n“He’s cute!” whispers Uraraka quietly to Tsuyu. She wonders who he is.\nShouta notices the class walk in, and straightens slightly. Izuku, picking up on his shift in behaviour, politely cuts short his conversation with All MIght about life at Shiketsu, to turn and face his father’s students. He smiles gently at the crowd of incoming students, observing them and noting some interesting ones, like the girl with the features of a frog, a boy with bi-coloured hair and another boy with purple hair that kind of reminded him of his Otō-san.\nAs Shouta prepares to address the students and introduce Izuku to them, a shout rings through the crowd.\n“DEKU!! WHAT THE FUCK ARE YOU DOING HERE??” Bakugou screeches, startling the students surrounding him. Immediately, there are sirens going off in Shouta’s head. He hadn’t heard the word ‘deku’ since Izuku was about 9 years old. Still suffering from nightmares, Shouta would try for hours to calm the boy as he cried and screamed, that he wasn’t a Deku, that he wasn't a burden, that he wasn’t useless. Finally, the sunbursts littered across Izuku's body made horrifying sense. It made him sick. It had never occurred to Shouta that one of his son’s tormentors would be his own students. Bakugou looks ready to pounce and before he can think Shouta can feel his hands moving to his capture weapon of their own accord. \nA scarred hand stretched out to slam against Shouta’s chest. He looks at Izuku, whose eyes are devoid of fear or worry, they are focused and calm. Shouta allows himself a moment to relax and think rationally and Izuku slowly removes his hand, turning to look at Bakugou. His eyes are unreadable and calculating as he gives the other boy a once over. \nEveryone in the class stands stock-still, watching as the strange boy looks at Bakugou calmly, not the usual way any person who isn’t used to him reacts to Bakugou. He finally makes eye contact with the blond, and to everyone’s surprise, smiles warmly at the blond.\n“Nice to see you again Katsuki. It’s been, what 9 years? You seem well,” the boy says. His eyes are staring intently at Bakugou’s face, as if challenging Bakugou. His calm kindness seems to tick Bakugou off even more.\n“What is this useless fuck doing here?” He addresses the question to Shouta, who uses every morsel of professionalism he possesses to prevent himself from answering with hostility. Izuku is clearly not immediately dissolving into hysterics and seems keen on continuing training as planned, and Shouta has no doubt that he would explain everything to him when they get home. He sighs audibly after studying Izuku and Bakugou for a second.\n“This is Izuku. He is a Hero student at a school in the West. He’s here to help with training. And Bakugou be respectful, because if I hear you or any of you,” he sweeps his eyes over the class, eyes glowing red and hair flaring as he activates his quirk, his tone as serious as 1-A has ever heard it, “calling him ‘deku’, you will be expelled.” For a few seconds they all seem appropriately threatened, and Shouta is ready to move onto training when Bakugou pipes in again.\n “TRAINING?! What can this quirkless nerd fucking help me with?”\n“Bakubro that’s not nice!” Kirishima interjects.\nImmediately, a soft murmur runs through the group of students, and even All Might looks mildly surprised. They all start looking at the boy, Izuku, whispering and speculating before another voice interjects. \n“Is that true? Are you actually quirkless?” It’s Shinsou who asks the question.\nIzuku turns to him, and examines him. He then gives him a small smile and an answer, “Yes, I am quirkless.”\nIida’s hand shoots into the air, and he booms out his question after Shouta properly grants him permission to speak. “Sensei, I think it is highly unsafe for a quirkless person to join us in our training, as they could be seriously hurt.” A hum of agreement goes through the group of students.\n“You’re Tensei-kun’s little brother right? I’m disappointed. I would have thought that he would have taught you better than that.” Izuku says, unbothered by the offended expression on Iida’s face and the shocked expressions on the faces of his classmates.\n“What is that supposed to mean?” Iida asks, bristling at the statement.\n“It means that the Tensei-kun that I know wouldn’t teach his brother to perpetuate bigoted, quirkist ideals. They are harmful, untrue and a blatant sign of ignorance to those who are actually quirkless.” Iida rears back as if slapped. A few gasps rise from the class.\nShouta holds back a smile. This is exactly what he knew would happen. Izuku was a fiery spirit, especially in the face of any injustice, and one so close to his heart would definitely spark a conversation that the students needed to hear if they intended to be Heroes. Shouta notices that Yagi seems like he wants to intervene. He stops him discreetly saying, “They need to hear this, and they need to hear it now. Izuku is the best person for them to learn this from.”\nYagi looks puzzled. “Learn what?”\nShouta merely nods toward Izuku, directing the attention back onto his son, who was no doubt about to put on a show.\nIida’s face contorts into a scowl, and Uraraka and a few other squawk indignantly, but Izuku’s voice cuts through their noise like a hot knife through butter.\n“You think my lack of a quirk makes me weak.” It’s a statement, not a question. His eyes scan those of Class 1-A, at least the ones who hadn’t averted their eyes in guilt at his statement.\n“Well...no offense my dude, but being a Hero without a quirk could put you in a lot of danger,” Kaminari pipes in, voice shaking slightly, his words punctuated with nervous laughter.\n“And being a Hero with that kind of prejudice will get you killed.” His words make a few children flinch back. His eyes land on Bakugou, unafraid and knowing as he says, “Villains aren’t just bad guys with strong quirks. Abusers, rapists, murderers, bigots and bullies don’t need quirks to do the things they do. Most people don’t have quirks that can stop a bullet to the brain, or a well placed knife to the throat. Villains don’t need quirks to hurt. People aren’t just heroes just by way of having a strong quirk. Heroes and Villains aren't defined by what quirk they have. They're defined by their actions. So thinking that your quirk will help you in any situation, just because you have one, could cost you your life.” \nIzuku gives them a moment, letting his words stew for a moment. He observes Bakugou, who looks definitely less confident but just as angry, and Iida who looks thoroughly reprimanded.\n\"Even still, someone without a quirk would be at a disadvantage against someone with one.\" Momo says, looking sheepish when Izuku's eyes land on her.\n\" As you all will be as well. Quirk compatibility greatly influences a Heroes success rate. That doesn't mean you can't win, just because their quirk is stronger. Training, intelligence, adaptability, situational awareness and social skills. These are the things that make you a hero not your quirk or, in my case, lack thereof. Any quirk that a hero has can be destructive in the wrong hands, as can any quirk that a villain has can be used for good. Quirks aren't inherently good or bad, they are not the be all and end all of being a hero. They are tools, and you all were fortunate to be born with yours, while I had to forge my own.\"\nThe class is quiet. Some look guilty, some look like they're about to cry, some look enlightened. A few still look sceptical. Shouta realizes, and with full confidence in his son, suggests something.\n\"Why doesn't one of you fight him? You still look like you don't believe him. So give him the chance to show you.\"\nEveryone looks hesitant, but one person jumps at the opportunity.\n\"Tch. I'll fight the fucking nerd! Like if some quirkless nobody can beat me. I'll blast his fucking head off!\" Bakugou exclaims, already pushing his way through his classmates.\nShouta looks at Izuku, who is smiling to himself, seemingly already equipped with a plan of action to take Bakugou down.\nThey take their places a few feet apart, facing each other, as the class and All Might look on. Shouta stands between them.\n\"Rules are simple. Use what you know to take the other person to the ground, and keep them there for 5 seconds.\"\nHe takes a few steps back, and grabs his capture weapon just in case things escalate too fast. \n\"Start whenever you're ready!\" He calls.\nImmediately Bakugou lunges forward, using his explosions to propel him, and starting, as usual, with a right hook. Izuku waits until the last moment to side-step him and grab his wrist and twist it, just enough to be painful. Using the moment of pain to his advantage, Izuku kicks the back of his knee, sending Bakugou to his knees.\nBakugou's left hand comes up and directs a blast to Izuku's face, and to everyone's surprise, he barely even flinches. In response, he grabs the blond's left hand and pushes both up between his shoulder blades, the other boy grimacing in pain. Bakugou struggles fiercely, managing to free his left hand, with which he directs another explosion towards his face. This time it stuns Izuku momentarily, giving Bakugou enough time to force Izuku backwards. \nInstead of letting the other boy pin him down with his weight, Izuku pushes himself further away by kicking off of Bakugou’s back, rolling backward and righting himself into a low crouch. From his low position, he sees Bakugou already blasting himself in his direction. Izuku pulls his knives out of their sheaths on his thighs, ones that had gone unnoticed by the other occupants of the gym until now. The 6-inch long, curved blades glint menacingly under the harsh gym lights, causing more than a few students to let out shouts of alarm, who all immediately turn to their homeroom teacher.\nShouta takes in their shocked and worried expressions in his periphery, and lets out a breath that 1-A assumes is a laugh. He looks at them and says, “It’s okay. Izuku knows what he’s doing. Just watch,” nodding in the direction of Bakugou and Izuku.\nIzuku has now taken a fighting stance, his feet shoulder width apart and his hands right under his jaw, guarding his face. His knives are facing downward, seeming to curve out of Izuku himself. He stands perfectly still. Not a twitch or flinch, his stance stable and his eyes focused and his body practically unmoving. \nStill and vigilant, like a snake in wait of its prey.\nBakugou, who had frozen when Izuku had pulled out his knives, now seems to grow impatient as Izuku remains unmoving. His face twists into a deep scowl as he rubs at his wrists gently, swearing colourfully as he propels himself forward with his explosions, full speed at Izuku.\n“What the fuck Deku!! Think just because you dodged a few hits you're hot shit, huh? You’re just a useless quirkless fucking nobody. DIEE!!” he screams, directing a roundhouse at Izuku’s head with his right leg, once he’s within range.\nIzuku, who had still been perfectly stationary until now, ducks under the incoming leg while touching just the tip of his blade to appendage in question. It would only result in a long thin scratch, but the knife tearing through the fabric of his uniform and the little droplets of blood now running down his leg were enough to distract Bakugou long enough for Izuku to step behind him. As Bakugou’s leg drops to the ground, Izuku, already positioned behind the blond, flips his knife in his hand, and rams the butt of the handle into a pressure point on the left of Bakugou’s neck.\nBakugou drops to the ground face-first, like a marionette cut free from its stings, his body making a dull ‘thump’ against the gym floor. Izuku gently places his foot onto Bakugou’s back.\n“1...2...3...4...5. Well, that’s done and over with, now....anybody else thinks that their quirk alone is enough for them to beat me?” Izuku says,turning to face Class 1-A. They all look at him with varying degrees of amazement, with a healthy dose of scepticism. A few seconds pass, and the gym is silent. The next second has questions pouring out of the students before Izuku can even properly listen to one. Quirks are firing off in the melee to know more about Izuku, Kaminari’s excitement making the hair of the people around him stand on end and Dark Shadow chattering excitedly among many other signs of the classes new found curiosity towards the peculiar teen before them.\nIzuku, while trying his best to decipher even some coherent Japanese in the noise (and failing), had picked up Bakugou’s body and was handing him off to All Might, who takes the unconscious blond to Recovery Girl. He shared a look with his Otō-san, who nodded and turned towards the class, who were still spewing questions at lightning speed.\nActivating his quirk, and speaking in his usual calm yet commanding tone he says, “Be quiet. If you have a question, raise your hand and wait until I call on you. If you don't have a question, pay attention and be courteous to those who do.”\nAs everyone quiets down and people begin to rain their hands, Izuku takes his place next to Shouta. He shoots Izuku a look, silently asking if he’s okay to continue. Izuku gives him a smile and a reassuring nod, as they both direct their attention to the class once more to answer some questions.\nKirishima is the first to be picked, and he asks his question, voice laced with concern, “Is Bakugou going to be alright?”\n“Yes, of course he will. He’s just passed out. He should be up in about 30 minutes.”\nShinsou is next, asking a simple “How did you do that?”\nIzuku smiles and explains, “Stimulation of the Vagus nerve sends a false signal to the brain, saying that the person has high blood pressure. Because of this the body tries to lower the blood pressure, but because his blood pressure isn’t actually high, and it’s lowered further by the Vagus nerve and that’s why he passed out. The point that I hit is referred to as sStomach 9 in acupuncture.”\nAfter that the questions keep coming and Izuku answers them in stride. \n“Why do you use knives?”\n“They’re versatile weapons that can be used for offense, defense, are easily concealable and also useful for things like picking locks or windows because of both the size and flexibility of the blades that I use.”\n“How long have you been training?”\n“About 6 years. I had to get a head start to even be able to contest people who are born quirked. But because of that now I’m at an advantage. I also don’t have the issue of being too reliant on my quirk, because… well I don’t have one.”\n“Who trained you?”\n“My Otō-san, mainly at first. Then I got teachers in different fighting styles, along with some other Pro Heroes.”\nEveryone seems to pause at that. “Your father is a Pro Hero?” Todoroki pipes in, asking what everyone now wants to know. Izuku realizes that beyond his name, he hasn’t been properly introduced.\n“How rude of me! I didn’t even introduce myself properly,” he bows deeply and continues,” My name is Aizawa Izuku. I am a first year Hero Student at Shiketsu High in the West of Japan. I am also an apprentice under Eraserhead, my Otō-san.”\nThe class gapes, shooting looks between one another, then between Shouta and Izuku, and finally between themselves and the pair in question. Izuku lets out a laugh at their surprise, one that floats through the gym. It’s loud and bright and it warms Shouta’s heart, so much that he smiles softly at Izuku, ruffling his hair. \n“Oh wow. He really is his son.” Kaminari’s voice cuts through their little moment. Everyone seems to aree, people humming in assent or pointing out similarities. They all fall quiet when Momo raises her hand to ask a question. Shouta nods in her direction and she continues.\n“Were you perhaps on the papers, your face is very familiar but they referred to you by another name.”\nShouta takes the chance to speak, already seeing the light flush on Izuku’s freckled cheeks. The boy was too humble for his own good.\n“He was. He is the first quirkless student to be admitted into a Hero school. He came first in both Shiketsu’s academic and physical tests and is still at the top of his year group. A small local paper did an interview with him to empower kids with unique quirks, or none at all. They called him by his Hero name. Viper.”\n“That’s so cool.”\nIzuku hums, continuing by saying, “I still have a long way to go. I’ve got to grow and mature and adapt. It’s not going to be easy, not by a long shot. There will always be people who see me as less than, but they aren’t going to stop me. Although I’m still a hatchling, one day I’ll be a Hero that saves people. Just like Otō-san.” Izuku smiles lovingly at Shouta, causing more than a few people to coo at the pair. Shouta only shakes his head, not willing to show any more affection as openly as he already had.\nHe dismisses the class, telling them that they will continue with something more theoretical. There’s an excited glint in Izuku’s eyes, ever as enthusiastic about theory as he is about fighting. As the students walk off, the father and son lag behind, Izuku posing a question to Shouta.\n“Bet you’re glad you let me tag along. Imagine how boring and predictable your day would be without me?”\nShouta rolls his eyes, but smiles nonetheless. “I am glad you tagged along. Imagine how long these kids would have been held back by their prejudice if not for your wake up call. You may still be a hatchling, but you’re already saving people. From their bigoted ideals, from a mindset that is sure to get them killed, from themselves.”\nIzuku hides his face in his hands, blushing furiously at the praise, the knife-wielding Hero in training reduced to a stuttering mess. “Otō-san!! You can’t just say things like that out of the blue!!! Give a kid some warning!! “\nShouta laughs as they continue to walk back to Class 1-A to rejoin his students, ever thankful for his little viper."
}