{
    "id": "25143577",
    "url": "https://archiveofourown.org/works/25143577?view_full_work=true",
    "author": [
        "SilvermistAnimeLover"
    ],
    "title": "Lifeline",
    "rating": "Not Rated",
    "archive_warnings": [
        "Graphic Depictions Of Violence"
    ],
    "categories": [],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Aizawa Shouta | Eraserhead/Yamada Hizashi | Present Mic"
    ],
    "characters": [
        "Midoriya Izuku",
        "Yamada Hizashi | Present Mic",
        "Aizawa Shouta | Eraserhead",
        "Tsukauchi Naomasa",
        "Sensei | All For One"
    ],
    "additional_tags": [
        "Izuku is kidnapped",
        "I'm terrible to Izuku",
        "Dadzawa",
        "Parental Aizawa Shouta | Eraserhead",
        "Parental Yamada Hizashi | Present Mic",
        "Protective Aizawa Shouta | Eraserhead",
        "Protective Yamada Hizashi | Present Mic",
        "Protective Tsukauchi Naomasa",
        "Torture",
        "I skim over it though",
        "Izuku needs love",
        "And support",
        "Inventor Midoriya Izuku",
        "Smart Midoriya Izuku",
        "Quirkless Midoriya Izuku",
        "Midoriya Izuku Does Not Have One for All Quirk",
        "Based on a dream I had",
        "I wrote this instead of working on Viridian",
        "or Swan Dive",
        "or Robin's Nest",
        "I'm Sorry",
        "I'm working on them",
        "I swear"
    ],
    "language": "English",
    "series": "",
    "published": "2020-07-08",
    "completed": null,
    "words": "11,122",
    "chapters": "1/1",
    "comments": "555",
    "kudos": "31,291",
    "bookmarks": "7,013",
    "hits": "229,525",
    "summary": "<p>Midoriya Izuku has always had a sharp mind. He aims to transfer to the U.A. Heroics course from the Support Course. He knows he’s smart enough to get in, and he’s always been gifted with making things. He just never thought his items would be of use to him before U.A. </p>\n<p>Tsukauchi Naomasa never expected a phone call from a twelve-year-old child who’d been kidnapped by villains. Who was still in the hands of villains. But he’d be damned if he let this kid die. </p>\n<p>A fic about Izuku being kidnapped by the LoV, but staying on the phone with Tsukauchi, Eraserhead, and Present Mic the whole time.</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
    "text": "\n\n\n\n\n\n\nA/N: All right, so first off, HAPPY BIRTHDAY PRESENT MIC!! :D Today, 7/7, is Yamada Hizashi's birthday. So in honor of that, I'm posting a oneshot (even if it's still about Izuku, at least Zashi's still in it. :) \n\n\n\n\nI've had this oneshot written for a bit, actually. It was based off a dream I had, and I thought, \"why not?\" A story that revolves around a PHONE conversation. It was definitely an interesting challenge, and I'm rather happy with how it's turned out. :) \n\n\n\n\nThat being said, I've created a Discord!! :D If you wanna join, this is the link: https://discord.gg/Dz5Er7W\n\n\n\n\nAlso, for my Viridian readers, there's a new animatic!! I'm SO HAPPY!!! Here's the link for that. :3 \n\n\n\nhttps://www.youtube.com/watch?v=f-8cKsy0dyw\n\n\n\n\nAs always, send any fanart to [email protected]. :)\n\n\n\n\nThat being said, please enjoy this oneshot~! And look forward to updates on my other stories. :)\n\n\nMidoriya Izuku was bent over his desk, hard at work on a project. It wasn’t anything overly important, just something to help make his daily life easier. He was a brilliant young boy, despite being Quirkless. Even now, at the tender age of twelve, he had successfully modified his cell phone and its backup battery charger to last more than twice that of the average phone.\nObviously, that meant he could now listen to music all day long without worrying about it dying on him. But wireless earbuds were noticeable, despite his curly hair. He didn’t want to give the teachers any more reason to hate him. Never mind the fact that he was the top of the class.\nHe wanted to be a hero, but he knew that Quirk Analysis skills wouldn’t get him there alone. However, if he could make himself support items to help cover his weaknesses, then it suddenly became a very achievable goal! Even if he had to get into U.A.’s Support Course and use the Sports Festival to transfer to the Hero Course (assuming he failed the Hero Course entrance exam, that is), he’d do it! He would become the world’s first Quirkless Hero!\nBut first, he was going to finish modifying these earbuds so they’d hook around the back of his ear, and use vibrations to bypass the eardrum altogether. That way, he could still hear the teacher if he was called upon, but he could also listen to music in class without looking like it. It was a win-win.\nHe smiled to himself as he hooked it around his ear. Time for a test. He hooked it up to his phone via Bluetooth, and selected a song. He startled badly, nearly falling out of his chair, when the song blasted at full volume. “AH!” He quickly scrambled to turn it down to a more manageable range. Cautiously, he turned the volume back up, and was delighted to hear his favorite music playing. He took it off, and heard nothing.\nIt was perfect! Now his teachers wouldn’t even hear his music playing when the classroom was silent! He put both cuffs on and happily bobbed his head to the music as he checked his reflection. With his curly hair, the dark green cuffs blended in seamlessly. Even Izuku couldn’t see them, plus they were rather comfortable.\nHe grinned as he took a look around his bedroom. In three years, he’d take the U.A. Entrance exams, and he wanted to be as ready as possible. His walls were littered with an odd mixture of hero posters and blueprint designs while his desk was a cluttered mess of different half-finished inventions and support items.\nHis mother had been overly relieved when he took an interest in support items, and happily bought him whatever supplies and tools he needed. He didn’t have the heart to tell her that he still wanted to become a hero.\nHe’d come up with a grand variety of things, too. Like the hoverboard (could only hover about a foot above the ground at most, though), his jetpack (which only had a twenty minute battery life with a maximum height of ten feet—he was working on it!) Night vision and infrared goggles (modeled after Eraserhead’s Goggles. Two hour battery life, and he was trying to add a few more features), and his favorite for daily use—his tablet.\nHis tablet looked like a small portable charger at first glance—like a thin palm-sized block of metal. But when it unfolded, it started up the holographic touch screen. He could do just about anything with it, plus it was keyed into his DNA signature. A prick on the finger for a drop of blood and a retina scan was the only thing that could unlock it (and a password, of course. Duh). Call him paranoid, but no inventor wanted their ideas stolen, and Izuku kept a copy of all his blueprints, designs, ideas, and notes on his tablet. It even had voice-activation, too!\nHe sighed and stretched out on his bed. He barely remembered to plug in his phone and new ear cuffs to charge. The cuffs should have a battery life of about 10 hours, while his phone’s battery life with music playing was about fifteen to twenty—plenty long enough for the school day. Plus he had two portable chargers (he kept the phone plugged into one, and it was programmed to activate upon the phone dropping to 20%.)\nIzuku smiled. Life sucked, but at least he had his inventions.\nThe next day dawned bright and crisp. Izuku glared at the cheerful sky with the kind of distaste that only a true night owl could muster.\n“Izuku! Come down for breakfast! Don’t tell me you pulled another all nighter working on your inventions again!” His mother called from the kitchen. Izuku hurriedly pulled on his school uniform, and only barely remembered to slip his phone into the inner pocket of his pants. It was better to keep his valuables hidden where bullies couldn’t get to it, after all.\nHe ate a quick breakfast before rushing out to head off to school. He slipped his ear cuffs on before heading out the door—he didn’t want someone to see them, after all.\nHe warily kept his backpack clutched tightly to his person. For the last few weeks, he’d had the oddest feeling that he was being watched… or followed. And now, he felt those eyes on him again.\nHe wasn’t sure what to do. It could’ve just been his imagination, or maybe one of his bullies, but somehow this felt… different. More malevolent somehow. A commotion up ahead had him picking up his pace. A villain fight had broken out, and was taking up the whole street. Onlookers stood idly by, watching the chaos unfold like it was some kind of show. Izuku sort of wanted to join in (because hero fights were cool, even if they were super dangerous), but a glance at the time told him he’d be late if he did. And his teachers had had enough of him being late.\nSo against his better judgment, Izuku took an alternate route to school—through the back alleyways. If he hurried, he could still make it to school before the bell rang.\nAgain, he felt the eyes on him. But… what if it was nothing? What if it was just his imagination? He picked up his pace, regardless. Better safe than sorry, especially in today’s world.\nHe caught sight of someone in the reflection of one of the abandoned apartment windows. Someone was peeking around the corner of the alleyway he’d just vacated. And they were watching him.\nHe picked up his pace again, and in the next window, he saw the man. He was closer this time.\nShit.\nHe took a deep calming breath. Maybe this guy didn’t mean any harm? No, wait. That was a crowbar in his hand. He was trouble.\nIzuku turned to go back to the main street, only to find the alleyway blocked off by old crates and the like. Izuku wasn’t the fastest climber—if this guy wanted to attack him, he’d be toast. He quickly altered his course again and—\n“Just hold tight, kid. I don’t wanna hurt you.” The man was right behind him.\n“I-I’m just trying to get to school. That’s all.” Izuku raised his hands in a placating manner. “I don’t have any money on me! I swear! If you want my packed lunch, though, you can have it.” Izuku held out his lunchbox.\n“I’m not after your goods, brat. I’m after you.”\nIzuku’s stomach dropped like a stone. Shit. He’s gonna kill me. Or kidnap me and sell me on the black market! Or— He violently cut off his train of thought.\n“Y-You want me? I-I don’t even know you! I’ve never seen you before!”\nThe man just grinned. “And you’ll never see me again.” He charged, and Izuku tried his best to run—he was very good at that—but the man had some kind of animalistic Quirk. He caught up to Izuku in no time.\nHe felt a sharp pain in the back of his head, and then his world went black.\nIzuku woke up confused and disorientated. He was in a small room. No windows, one door, and bars that kept him from reaching said door. The room looked like an old basement, but there were several cells built into the room—like they were keeping prisoners, and Izuku was one of them. Not only that, but it really stank down there. He gagged at the stench and tried his best to ignore it. There wasn’t enough light to see where it was coming from anyways.\nHe shifted, and his head started pounding. Or maybe he just couldn’t process the light well enough yet.\nHe abruptly recalled the man with the crowbar, and gently touched the back of his head. “Ow… concussion.” He winced at the blood that stuck to his hand. He idly wiped it on his pants, only to feel the familiar square of his phone.\nNo way. He froze. My luck’s not THAT good, is it?! He carefully brought a shaking hand up to his ear, and felt the cuff. A quick double-tap and he heard the familiar ding indicating voice recognition.\n“C-call the police.” He whispered quietly.\n“Calling.”\nNever before had Izuku been more grateful for his inventions.\n“Hello, Musutafu Police force, Sansa speaking.”\nIzuku wanted to cry from relief. “H-hi. U-um… My name is Midoriya Izuku, and I think I’ve just been kidnapped.” His voice sounded a hell of a lot calmer than he felt.\n“Kid, I swear if this is a prank…”\n“Please believe me, it’s not!” He winced as his voice echoed. He lowered his tone just incase someone was nearby. “I was walking to school when this guy attacked me and knocked me over the head with a… crowbar? And now I’m in some kind of underground holding area, and there’s a cell, and I’m scared.”\nHe heard movement on the other end of the line and some quiet voices before a new voice spoke.\n“Midoriya? My name is Detective Tsukauchi Naomasa. My Quirk is Lie Detection. Can you describe your situation to me?”\n“I’ve been kidnapped, and have no idea where I am.” He stated.\n“He’s telling the truth. Start tracing this call, we’ve got a kid in trouble!” He heard Tsukauchi order the other officers. “Stay on the phone with me, kid. How old are you?”\n“Twelve. I live in Musutafu, and I think I’ve got a concussion. My head really hurts.”\n“It’ll be all right. You’re lucky your phone wasn’t taken.”\n“I keep it in a hidden pocket on the inside of my pants. I’m an inventor, so I made earbuds that you can’t see. They hook ‘round the back of the ear. Bypass the eardrum, so there’s no noise.”\n“Any idea why you were kidnapped?”\n“None.”\n“Could it be for your Quirk?”\n“I don’t have one, sir. I’m Quirkless.” Izuku paused, cursing himself for revealing that. “Y-you… you’ll still come save me, right?”\n“Of course we will.” He sounded offended.\n“I-I mean, a lot of people don’t care about… people like me.”\n“Kid, listen; you’re in trouble, and it’s my job to help people in trouble, no matter who they are.” He paused a moment while people were talking in the background.\n“Sir, the call’s trace is being blocked—it’ll take some time to break through it.” He recognized the voice as the officer who initially answered the phone. What was his name again? Son… Saun… Sansa! That was right! Sansa.\n“I want every available man on this.” Izuku felt a few tears run down his face. They were working so hard… for him? Nobody’s ever done anything for him before.\n“Do you know when you were taken?” Tsukauchi asked.\n“Uh… I was heading to school… Monday morning. Er… probably around seven-forty-fiveish? I remember seeing a villain fight on my usual route, and when I checked the clock, it was around 7:45.” Izuku nodded with the information, which made his head hurt. “Ow…”\n“You okay?”\n“I nodded, which hurt my head.” He hissed as he touched the injury again. “I can’t tell if it’s still bleeding or not.”\n“You’re doing a good job of staying calm.” He noted. His voice sounded calm and it comforted Izuku quite a bit. “Why don’t you tell me about your family a bit?”\n“Well, it’s just my mom at home… I think she’s at work right now. I… I don’t want to stress her out with this, but I know you have to tell her anyways. Um… That’s really about it.”\n“Any friends?”\n“No. I’m bullied a lot at school. Even the teachers don’t like me. Do you have family?” His face heated up as he realized that it was a very personal question. The detective likely just wanted to keep him talking because falling asleep with a concussion was bad. “S-sorry, I understand if you don’t wanna talk about it.”\n“It’s fine.” He could hear the detective smile. “I’ve got a baby sister, actually. I live alone, though. Been thinking about getting a dog.”\nHe thought he heard Sansa hiss at that. Was he a cat person?\nIzuku startled when he heard footsteps approaching. “Someone’s coming.”\n“Just stay on the phone, okay? Don’t talk to me if it’s going to put you in danger.” The detective sounded stern.\n“Ah, good. You’re awake.” A new voice greeted. Izuku looked up to observe the newcomer. The man looked to be made of smoke, and wore a fancy suit, like a butler or a bartender.\n“Wh-who are you? Where am I?”\n“You may call me Kurogiri.” Izuku got the impression that the man was smiling. His voice was low and smooth, and it sent shivers down his spine.\nSo this was a real villain.\n“Don’t try anything, kid.” Another unfamiliar voice drew Izuku’s attention to a boy with stringy blue hair and really dry skin. His eyes were a piercing red, and there was something about this newcomer that kept Izuku’s mouth shut. “Kurogiri here has a Warp Quirk—he can just send you right back to your cell. The name’s Shigaraki.” He smiled, and picked up a nearby piece of rubble. He held it with four fingers, leading Izuku to believe he had some kind of touch-activated Quirk.\n“If you try anything…” He grinned and placed his fifth finger on the stone. Izuku watched in horror as it disintegrated. “That will be you.”\nHe nodded his head in understanding, eyes wide in fear. He could play along for now, and hopefully come out of this mess alive.\n“Kurogiri. Sensei’s meeting is taking more time than expected. He’ll evaluate the kid in a few hours.”\n“Of course, Shigaraki.”\nWith that, Kurogiri placed a plate of food and a glass of water down inside his cell before locking it back up and leaving the room.\nIzuku was alone again.\n“You all right, kid?” Tsukauchi’s voice startled him.\n“Y-yeah. Just… there’s something about them that terrifies me. These guys aren’t normal villains.” He felt a strong shudder. “Shigaraki… he can disintegrate things when all five fingers touch something. I really don’t wanna find out what that feels like.”\n“Just hang in there, Midoriya. We’re working as fast as we can.”\nIzuku hoped they’d work faster.\nDetective Tsukauchi Naomasa was having a rather normal day at work, until Sansa busted into his office asking him to authenticate a phone call. It wasn’t unheard of for some kid to prank call them, so they tended to use Naomasa as a way to verify calls.\nHe hadn’t expected it to be an actual call from a kidnapping victim. The fact that it was just a kid?!\nThe more he talked to the boy, the more he felt himself sympathizing with him. This kid was just unlucky, and seemed to have a good heart. He was thankfully calm, and the fact that the villains hadn’t noticed the earbuds (cuffs? Had the kid called them cuffs?) was a godsend.\nIt also was something Tsukauchi had never encountered before. He’d helped kidnapping victims after they’d been rescued—hell, he’d helped rescue them. But he’d never had the opportunity to help a kidnapping victim during a kidnapping. Not like this. It was something that was way out of his comfort zone.\nHe hoped the kid’s battery lasted until they rescued him.\n“How’s that battery life on your phone, kid?”\n“Pretty good.” The kid’s voice was calmer, now. That was good. He didn’t want him to focus on his current situation. “I rigged it to last about twenty hours while playing music, and I’ve also got it hooked up to a battery pack to recharge when it gets low. It’ll probably last a few days on a phone call. The earbuds share the phone’s battery, too.”\nOkay, that was really impressive. “Damn, kid. Mind fixing up my cell phone when you have the chance?”\nMidoriya chuckled, and the sound brought a small smile to his lips. “Of course. I’m sure the earbuds would be useful to the police, too.”\n“You wanna go into support items?” He asked. The phone was on speaker, so the other cops could hear too. Tsukauchi didn’t notice a dark-haired man enter his office.\n“Sort of. I really want to be a hero, but I’m Quirkless. So I figured that my best shot was to get into U.A.’s Support Course and then transfer to the Hero Course using the Sport’s Festival.”\n“Tsukauchi?” The detective startled and looked up to see Eraserhead. Maybe that was what they needed on this case? Midoriya had been on the phone with them for a while, now, and they’d hardly made any headway.\nThe kid’s mother had been notified, and was being guarded at home by several members of the police for her safety. Last thing they needed was a villain holding her life over her son’s head.\n“Eraserhead.” He greeted, and the kid gasped on the other line.\n“As in the Underground hero, Eraserhead?!” He could hear the grin in the kid’s voice, and the hero startled.\n“You a fan, then?” Tsukauchi teased.\n“Eraserhead’s my favorite hero! He’s the one who gave me the idea to use support items to become a hero!”\n“Is there a reason why there’s a kid on the phone?” The man did not look amused.\n“Eraser, I need your help.” He motioned for Sansa to take over talking with the kid while he pulled Eraserhead outside. “That kid’s been kidnapped by some nasty villains. Somehow, they missed his phone, and the first thing he did was call us.”\n“You’re shitting me.” The exhausted man blinked in shock.\n“Not at all. His name’s Midoriya Izuku. Age 12, Quirkless.”\n“If he’s Quirkless, then why was he taken?”\n“We don’t know. He’s encountered two villains so far, Shigaraki and Kurogiri. We’re running their names and the kid’s descriptions through our database while trying to trace the call. So far, no luck.”\n“All right, so what do you want me to do?”\n“I need to go out and ask a few people some questions—we may have some leads from villains we captured earlier today, but we can’t leave the kid alone.” He sighed.\n“You want me to sit and talk to a kidnapped child on the phone?” He gave the detective a disbelieving look.\n“Sansa needs to work on tracing the call, please? I’ll buy you coffee for a month.”\n“Make it a semester and add in vodka, and you’ve got a deal.”\n“Can’t believe I have to bribe you with coffee and alcohol.” Tsukauchi sighed. “Fine. Deal.”\n“Thank you.” Eraserhead grinned as he re-entered the room with the detective.\n“Midoriya, I’m going to run a few investigations, okay? I’m going to leave Eraserhead here with you.”\n“O-okay. Good luck, Tsukauchi!” The kid sounded unsure, but the detective didn’t have much of a choice.\n“Think of it this way.” He grinned. “You have your favorite hero all to yourself.” He happily ignored the middle finger Aizawa sent his way.\nAizawa Shouta was not in the mood to deal with children. But he supposed it was better over the phone. At least he could still drink his coffee. And if he was being honest, he was concerned for this kidnapped child. He may not like kids, but he also didn’t want them to be in the hands of villains, either.\nHe didn’t think he was the best at comforting children, though. Why did Tsukauchi do this to him?\n“Hey, how’re you hanging in there, kid?”\n“You’re not too good at dealing with children, are you, Eraserhead?”\n“Goddamnit.” He sighed. “Not really.”\n“It’s okay, I’m not too good at dealing with people. Guess we balance out, then, yeah?”\n“I suppose so.” He took a long sip of his coffee. “How do you know about me?”\n“I love heroes. I want to be one, so I do a lot of research. I specialize in Quirk Analysis and Support Item invention. Since I’m Quirkless, I figured these combined could help me close the gap.” Shouta nodded as the kid spoke. It was logical. “I’ve even done analysis on you.”\n“Oh?” He leaned forward, intrigued. “How good is this analysis of yours?”\n“Um… well… I think it’s fair.”\n“Humor me. What’ve you got on me?”\n“Erm… This is off memory, so forgive any mistakes… You can erase someone else’s Quirk so long as you can keep them in your sights. But when you blink, it deactivates. Oh! And you can’t erase mutant types. Emitter types are easiest for you to erase. Your eyes glow red, and your hair floats—likely a holdover from one of your parents’ Quirks.” Shouta blinked. Accurate. That was a little unnerving. “You can typically keep your Quirk activated for anywhere from one to three and a half minutes when your eyes are fresh, which is why you carry around eyedrops. The time gradually decreases at a specific rate that I can’t remember right now, but have the equation written down somewhere…”\nThe hero blinked. That was not something you could gather from simple analysis. How much time did this kid spend on this?! But he wasn’t done.\n“Um… Your fighting style is a mix of about six different kinds of martial arts, with a dash of street fighting mixed in, and you use your Capture Weapon as your primary means of attack. You’re an ambush hero, so you work at night and are really good at stealth—which is shown by how few videos there are of you. You hate the press, and you seem to conserve energy however you can. Uh… You like cats and seem to have a personal relationship with Present Mic, and you went to school with him, Midnight, Vlad King, and Ingenium. You’re currently a U.A. Teacher, and you hold the record for the most expulsions.”\nShouta stared at the phone in shock.\n“How the hell did you get all that information on me? How long did that take you to learn?!” He choked out.\n“U-um… about a month? S-sorry… I just started rambling… I… I really like heroes, and have a lot of free time on my hands.”\nShouta had never met anyone who could tell that much about him before even meeting him. Hell, even some of the people he’d known for years didn’t know as much about him as this kid did. That thought was actually terrifying. Thank god this kid wanted to be on their side. Nezu would love to meet him. “Kid, with observational and analytical skills like that, you’ve got a really strong chance of being a hero.”\nThe kid gasped in surprise. “Y-You really think so?!” He sounded way too excited. “You… do you really think I could be a hero?”\n“Let me guess—you’ve got a technique somewhere in the head of yours on how to take down every hero you’ve ever researched.”\n“Er… yes? Villains, too.”\n“Then yes. You can become a hero. That analysis is practically a Quirk in and of itself.” A thought suddenly occurred to him. “Do you think that’s why the Villains took you?”\n“No, I’ve never shown anyone my analysis. Even mom doesn’t know—she thinks I gave up on being a hero.” The kid sniffled.\n“Are… you crying?”\n“I’m just happy.” He sounded like he was smiling through his tears. “Nobody’s ever told me I could become a hero before.”\n“Kid whatever you do, don’t let them know about that ability. It’s far too valuable.”\n“Understood.”\n“Hmm… that analysis of yours… what can you deduce about the villains that’ve taken you?”\n“I know for a fact that there’s at least three. Kurogiri has a warp quirk, but I haven’t seen it in action. I can’t really deduce anything on that yet. Same with this mysterious ‘Sensei’ person that I’m supposed to meet soon. I’ve only briefly seen Shigaraki’s Quirk… it looks like some kind of disintegration Quirk. Needs all five fingers to activate. Drawbacks seem to include extremely dry skin, perhaps dehydration? He didn’t seem to struggle when using it on the rubble, but I’ve little doubt it could work on organic materials, too. Disintegration starts from the point of contact and moves outwards until the object is nothing but dust. He had this look in his eye… It makes me think of someone really unhinged.”\nShouta quickly got a very detailed mental picture of the villain. “Sorry to make you go back to that moment.” He abruptly remembered he was talking to a child, and not a pro.\n“It’s okay, really! If I’m going to be a hero, then I need to learn how to handle this sort of thing. Besides, I think my concussion’s getting better. It doesn’t hurt as badly.”\n“Be careful either way. Head injuries are painful and annoying.”\n“Right. I remember the medical textbooks I’ve read.”\n“You read medical textbooks?”\n“I have a lot of free time.”\n“Don’t most kids hang out with friends?”\n“I don’t have any friends. I work on inventions, training my body, and training my mind. Sir… if you don’t mind my asking… what’s U.A. like?”\n“It’s big, for one. You won’t really fully understand it until you get there, I think.” He chuckled a bit, remembering his own initial shock at the size of the school. “And all the teachers are pros. It’s a good place to learn, and we all do our absolute best to protect our students.”\n“Sounds amazing.” He could hear the smile from the kid. “Midnight and Present Mic teach there, right? They’re your good friends.”\nShouta snorted. “Midnight’s a good friend, but…” He smiled. “Present Mic is my husband.”\nThe kid briefly choked on his spit, and Shouta couldn’t keep the grin off his face. “I knew it! Goddamnit, Kacchan owes me two thousand yen!” He grumbled for a moment. “I used to call Mic’s show all the time when I was little. Back when the show was still new, and there weren’t many people listening. He called me Atlas, because I said it sounded cool.”\n“He’s talked about Atlas a few times.” Shouta recalled hearing him talking in the late hours of his radio show about the ‘Little Listener’ and hoping he was okay.\n“R-really?! He remembers me?!”\n“Yeah. Still asks after you, kid. Wonders if you’re doin’ okay. He wanted to know why you stopped calling.”\n“Honestly, I realized how many people listened in on the show, and my social anxiety kicked in. I couldn’t really pick up the phone after that. I just followed his radio show instead.”\nShouta’s phone vibrated in his pocket, and he fished it out. “Speak of the devil—he’s texting me right now.”\n“Tell him Atlas says ‘hi’.”\n“Sure thing.”\n\n\nCockatoo: Shouta! I thought you were just dropping some paperwork off at the station, but you’ve been gone forEVER! Are you coming home?!\n\n\n\n\nShouta: No, I got tied up with a new case at the station. Kidnapping. \n\n\n\n\nCockatoo: Oh… another kid? Those are tough. \n\n\n\n\nShouta: Actually, it’s… different. Twelve year old kid got taken this morning, but he still has his phone hidden on him. We’re talking to him right now. \n\n\n\n\nCockatoo: Y-you’re shitting me! So we know where he is?!\n\n\n\n\nShouta: Tracer’s being blocked. We’re doing what we can. Oh, remember Atlas, that caller you talk about from time to time? \n\n\n\n\nCockatoo: Yeah… \n\n\n\n\nShouta: It’s him. The kidnapped kid is Atlas. \n\n\n\n\nCockatoo: …. Hold on, I’m coming down.\n\n\n\n\nShouta: Wait, what?! I thought you had shit to do today!\n\n\n\n\nCockatoo: Grading papers can wait! My Little Listener’s in trouble!\n\n\n“Well, it looks like he’s still rather attached to you.” Shouta spoke aloud. “Told him you were in trouble, and now Mic’s on his way to the station.”\n“H-he really remembers?!” The kid sounded so surprised and awed that it made Shouta’s heart ache just a little. “I… is my mom okay?”\n“She’s just fine. We’ve got some heroes and police watching her for you. The villains won’t touch her.”\nHe heard the kid sigh in relief. A few minutes of idle conversation later, and Hizashi came into the room.\n“Little Listener?” He asked, looking at the phone. Shouta smiled and gave him a kiss on the cheek.\n“P-Present Mic!” Midoriya’s smile was audible.\n“Atlas! Long time no hear! I’ve missed you! I got so worried when you stopped calling!”\n“I… I’m sorry! I just got so nervous when I realized how many people would hear me talk, and I just… chickened out.”\n“It’s okay. You’ve got yourself in a real pickle, now, haven’t you?”\n“You can say that again.” The kid chuckled, and Shouta let out a sigh of relief. Hizashi was so much better at this sort of thing than he was.\n“Tell ya what? When we bust you outta there, how about you guest star on my radio show? You can come with me to the radio station and we can do it in person together!”\nThey heard a sharp intake of breath. “Y-You mean it?! Really?! I canactuallymeetyouinperson?!OhmygodthisisincredibleandthatwouldmeanthatIcanmeetEraserheadtoo,becauseyou’rebothmarriedandsoofcoursehe’dprobablybearoundsomewhere,andIcan’tbelievethis!Icanactuallymeettwoofmyalltimefavoriteheroes!”\n“I see you’ve still got an incredible lung capacity!” Hizashi laughed, and the kid shut his mouth with a snap.\n“Sorry.”\n“No! Don’t apologize! I love it!” Hizashi grinned.\n“It just means that your mind is sharper than your mental filter.” Shouta sighed, scratching his stubble. “Happens to plenty of people. Bit of meditation should help. I’ll show you some techniques later.”\n“You’ll teach me stuff?!”\nOh god, he could feel the stars in the kid’s eyes. Hizashi was laughing, too, damn him.\n“Yes, Problem Child, I’ll teach you a few things.”\n“I’d cheer happily right now, but I really don’t want to draw the Villains’ attention.” The kid squealed happily, though Shouta and Hizashi’s expressions fell. It was easy to forget that this kid might not live to see the next few hours, let alone live long enough to meet them.\nThe kid fell quiet on the line for a moment, and Shouta immediately grew concerned. “Kid?”\n“I think they’re coming back.”\n“Should we be quiet?” Hizashi asked.\n“No, the headphones won’t produce sound… they won’t hear anything. Only I will.”\nA voice trickled over the phone, and it wasn’t the kid’s.\n“All right, brat.” The voice was harsh but young. “Get up. Sensei wants to meet with you.”\nIzuku followed along obediently. The man didn’t restrain him—he didn’t have to. Izuku knew the consequences of acting out. The blue-haired man was frightening.\nKurogiri was waiting in the other room, which looked distinctly like a bar. He did his best to memorize every single detail—especially the view of the window. Anything that could help the police and heroes locate him.\n“Right this way.” Kurogiri opened a portal and followed Izuku inside. Shigaraki stayed behind.\nIzuku didn’t know where they were, now, and the more they walked, the more frightened they became. Finally, he opened the door to a room. It was spacious, and clean and smelled strongly of disinfectant—like a hospital.\nA man was laying in the bed, hooked up to a ton of machines. It should’ve made him look weak and frail, but for whatever reason, every atom of Izuku’s body screamed at him that this man was by far the most dangerous person he’d ever meet.\nHe froze, and immediately diverted his gaze.\n“So this is the boy. Come here… Midoriya, was it?”\nHe shuddered hard. He nodded, and came forward. He was petrified and the man hadn’t even done anything.\n“You’re smart to be afraid of me.” He smiled—or at least he sounded like he was smiling. “You may call me Sensei.” He paused, and reached out a hand. Izuku fought the urge to flinch as the cold fingers tilted his chin up so he had to look this… thing in the eye (not that this creature seemed to have them anymore). “Yes… you’ll do very well. You’ve got a strong will to survive, I can sense that. Maybe you’ll retain some of your sanity? Don’t worry, Midoriya. We’ll take good care of you.”\nIzuku wanted to ask. He tried, but no words fell from his lips. His jaw refused to unclench and he trembled.\n“I can see your question… speak, child.”\n“W-what do you want from me?” His voice was small, but it sounded a lot steadier than any part of him felt.\n“Let me tell you a little about myself. My Quirk allows me to take the Quirks of others, or force them upon other people.”\nIzuku’s stomach dropped as he listened. A Quirk like that in the hands of a villain?!\n“But you see… when I force too many Quirks on one person, they lose their mind. So I wondered if perhaps forcing those Quirks on a developing person—a child—would work better. And it did, but the results were still… subpar. So then I thought… what about a child without a Quirk? Perhaps they’d handle it better? Someone without a Quirk Factor should adapt much more readily to a foreign Quirk, and if I give them multiple at once…”\nIzuku felt cold and hot all over. This man was going to turn him into a living lab rat and there was nothing he could do.\n“Don’t worry so much. The mortality rate is only 75% for children.”\nHe didn’t feel much better about that.\n“Of course, we’ve got a lot of preparation to do. I can’t just give these Quirks to you… your body must be… prepared.” The man turned his gaze to Kurogiri. “He will do. Keep him in the holding cell until the Doctor is ready for him. I’ll expect you to take good care of our guest during his stay.”\n“Of course, Sensei.”\nIzuku had never been more grateful for a warp Quirk in his life.\n“Don’t worry, kid. We’re going to get you out of there before he can do any of that.” Present Mic sounded angry. And scared.\n“We’ll find you, Problem Child.” Eraserhead’s voice was deep and soothing, and Izuku clung to the two voices for all he was worth, because they were the only hope he had.\nHe didn’t fully remember the trip back to his cell, but once the villain left him alone, he sank to the floor and let out a quiet sob.\n“L-Little Listener?”\n“I’m scared.” He whispered. “I’ve never… that man… If there was a personification of evil, it’s that… monster. I can’t stop trembling and I feel hot and cold all over, and… It felt like he could see into my soul.”\n“God, Listener, if I could hug you right now, I would.” Present Mic said, and Izuku had never ached for a hug so much in his life.\n“I could use one, right now.” Izuku admitted.\n“I’ll give you the biggest hug when we rescue you. Promise.”\nHe startled when the door to the cellar opened and Shigaraki came down the steps.\n“So you finally met Sensei! Isn’t he amazing?” There was a near fanatical gleam in his eye, and Izuku couldn’t help but recognize a fanboy. It was almost comical that this guy seemed to idolize Sensei in the same way Izuku used to idolize All Might.\nSaying anything negative would be a bad idea. And saying anything positive would be too obvious of a lie.\n“I’ve never met a man with a more powerful presence in my life.” Izuku said in a hoarse whisper. This was apparently a good choice, because Shigaraki grinned.\n“I know! He’s incredible! Nobody is better than Sensei!”\nIzuku noted that a gaming device was sticking out of the guy’s pocket. “You play videogames?” He ventured, and the man’s face lit up like a child’s. Izuku relaxed a little. A safe topic.\n“Of course! Games are everything! In fact, life itself is just one big game, don’t you agree? All these NPCs just take up space, and they’re there for people like me—Player Characters—to do with as we please.”\nIzuku was quickly getting a very good feel for this guy’s mental-emotional state. He was a kid. A freaking kid. With no boundaries and no rules beyond whatever Sensei placed.\n“So here’s my question.” Shigaraki leaned in to look at Izuku. “Are you a Player Character? Or an NPC?”\nIzuku looked Shigaraki in the eye, but didn’t answer.\n“I guess we’ll just find out, now won’t we~?” He leaned back with a grin. “Ah~ How fun! I love new games.” With that, Shigaraki spun around on his heel and left Izuku alone.\n“Talk about a few screws loose.” Present Mic muttered under his breath, and Izuku snorted in amusement.\n“More like the wrong game card.”\nHe liked to think that the snort on the other end was Eraserhead this time. Izuku let out a yawn.\n“It’s late.” Eraserhead stated. “You should try to get some rest while you can.”\n“The call is half-way traced. We should have a location by tomorrow afternoon.” Tsukauchi’s voice sounded through the phone, and Izuku perked up.\n“So you’ll be coming soon?”\n“Yeah. Just hold out another day, can you do that?” Present Mic’s voice asked.\n“Yes.” Izuku nodded. He was going to say something else when something caught his eye. He fought the urge to gag.\n“Kid, you okay?” Eraserhead’s concerned voice sounded, and he realized he’d let out a small whimper.\n“There’s a dead body down here. That’s what I’ve been smelling.” He swallowed thickly, and could hear one of the men on the phone curse.\n“Don’t look.”\nIzuku couldn’t help but stare, though. Now that his eyes had adjusted to the darkness, it was more than obvious. There was something about the guy… His eyes widened when he caught sight of the jacket the man had worn. “Wait… I know this guy. H-he’s a pro! The Enduring Hero; Everlast. He’s a foreigner. I think he’s a hero from Mexico.” Izuku tilted his head for a moment. “His Quirk lets him regenerate lost limbs or recover from massive damage in minutes.”\n“So you study foreign Heroes, too?” He knew Eraserhead was trying to distract him, and he willingly allowed himself to latch onto the topic.\n“Yeah.” He smiled softly as he turned away from the half-rotted corpse. He tried not to think about the movement he’d caught around the body. The little white maggots squirming around the—nope. “I study heroes from all over the world. You never know when the information—particularly someone’s fighting style or strategy—will come in handy. Especially when it comes to taking out different kinds of Quirks.”\n“I wish half my first-years thought like you, kid.” Eraserhead’s words made Izuku beam. “I hope to see you in my class in a few years.”\nHe can’t have heard that right. “Y-you really want a Quirkless kid in your heroics class?! B-but you teach Class 1–A at UA!”\n“He knows you teach?” Present Mic gawked.\n“He figured it out on his own—same with our relationship.”\nPresent Mic let out a whistle. “Damn, Little Listener. You’ve got one hell of a talent, there.” Izuku flushed.\n“Try to get some rest, Problem Child. It’s two in the morning, and you’ve got to be exhausted. We’ll keep an ear out for you.”\nIzuku abruptly realized that he was exhausted. But the fear of an unknown and hostile environment had kept him from feeling it. “Thank you.” He curled up on the ratty futon that was laid out in the cell, and covered himself with the moth-eaten blanket. “Goodnight.” He whispered.\n“Sleep well, Problem Child, we’ll come for you as soon as we can.” Eraserhead’s voice was deep and calm. It made him feel a little safer.\n“Night Little Listener. We’ll be here if you need us.” Present Mic sounded gentle and warm, like a hug. It made him think of all the nights he’d fallen asleep listening to the man’s radio show.\n“Goodnight, Midoriya. Tomorrow’s gonna be a long day.” The detective’s voice was a little jarring, but it reminded him that people were searching for him. He’d be okay.\nHe had to believe that.\nShouta wasn’t the kind of guy to get attached to people. That was his husband’s job, not his. He saved people, handed them over to the medics, and left it at that. He usually never really thought about them again. But for some reason, this kid was different.\nHe felt attached to Midoriya Izuku. Goddamnit. A Problem Child I’m not even paid to deal with. And I’m willingly thinking about spending time with him when this is all over?\nMaybe he was sick.\n“So, you thinking of sponsoring him for U.A.?” Hizashi asked. They’d muted the phone so that they didn’t accidentally wake the kid. God knows he needed all the sleep he could get.\n“I don’t know what you’re talking about.” Shouta denied.\n“Don’t pull that with me. You know teachers can put in a recommendation to Nezu for anyone they think might be a good fit for a program at U.A.” He grinned. “And if you don’t then I will.”\n“I’m worried about that Sensei person.” Shouta changed the topic, and Hizashi’s grin fell.\n“A man who can steal Quirks and hand them out as he pleases…” He shuddered. “I had no idea someone like that even existed.”\n“It’s possible he has some kind of longevity Quirk he’s stolen—he could’ve been around for a while and nobody would know.”\n“We have to rescue Midoriya before they do anything. Like hell I’m letting him do that to a child.” His fists clenched in fury, and Shouta felt much the same.\nWhen Sensei had started talking about turning Midoriya into an experiment, he’d seen red. Logically, he knew their odds of finding Midoriya before they did something to him were slim, but they had to try. There was no way they could bring this Sensei person down right now, either.\nThey had no solid location for the man, and if they hadn’t heard of him before now then he was damn good at staying under the radar. No, right now their top priority was Midoriya. They could worry about the villains after the kid was safe.\n“We’ve hit 70% on the tracer.” Tsukauchi came into the room with three cups of coffee, which Shouta and Hizashi gratefully accepted. “We should have a precise enough location to move out within the next six hours.”\n“So by nine AM?” Hizashi questioned.\n“Yeah. Hopefully, we can do this before any of the villains do anything to the kid.” Tsukauchi sighed, taking a long drink from his coffee.\n“How’s his mother holding up?” Shouta asked.\n“As well as can be expected.” Tsukauchi sighed. “Sansa’s with her, now. She’s a worrier—had several anxiety attacks already. He’s good with people like that.”\n“The kid’s holding up really well.” Shouta noted. “Most people in his situation would be freaking out—especially with a corpse in the room.”\nTsukauchi choked on his coffee. “I’m sorry, a what?” They must’ve forgotten to inform the detective of that little detail. Come to think of it, did they mention Sensei to him? He went to ask when Hizashi spoke up.\n“Yeah, that missing hero, Everlast? From Mexico? He’s dead. Kid identified the body in the cell next to him.” Hizashi grimaced.\n“Hold on.” Tsukauchi typed something into his computer before the file came up. “Yep. Everlast, 28-years-old. Been a pro for five years, went missing about a month ago.”\n“Guess that’s one case we can close.” Shouta winced. He would’ve rather a kid not found the body, but it was done, now.\nShouta stretched and pulled out his phone. It was nearly four in the morning. He got up and stepped out of the room before dialing a number.\n“Aizawa? You’re calling awfully early.”\n“I’m not going to be able to make my classes today—Hero work.”\n“How unusual for you. You’re not normally one to get wrapped up in cases during the school year. Should I be concerned?”\n“Kidnapped civilian. Mic’s working with me on this one, so you should find someone to cover his class, too.” Shouta rubbed his eyes. “It’s expected to last at least through the morning, likely through the early afternoon as well.”\n“Very well. I’ll cover your class and have Midnight cover Mic’s.” He could hear Nezu grin.\n“Thank you.”\n“Do keep me informed.”\n“Of course.” He hesitated a moment. “And you might be interested in this kid, too.”\n“Oh?”\n“He’s got one hell of a head on his shoulders. His analysis skills are terrifying.”\n“Well, then, I’ll look forward to meeting him.”\nHizashi was a people person—he always had been, and he always would be. It was partially why his radio show did as well as it did. He also had a big soft spot for kids (so did Shouta, but he’d never admit it).\nAtlas had been a caller of his for almost three years straight. He’d call every night. He started when he was four, and kept calling until he was about seven. He’d been so adorable, and many people tuned in just for the half hour of conversation he’d have with the kid each night. Many of his current listeners were people who’d tuned in for Atlas, and simply stayed because of habit.\nBut now that same kid, who he now knew was Midoriya Izuku, was in serious trouble. And he felt so helpless when they couldn’t do anything but talk to him.\nHe wanted nothing more than to scoop the Little Listener up and shield him from all the villains that wanted to hurt him. And he would! As soon as they found him.\nHe scowled as he glanced at the clock. It was six in the morning. There was about three hours remaining until they had a precise enough location to move out. Every able hand at the station—cop or hero—was working tirelessly to try to find the kid as soon as they could.\nThey were exhausting their resources and themselves. Neither he nor his husband slept a wink last night, and he knew Shou had called Nezu to inform him that they were skipping classes—a rarity for either of them.\n“You still there?” A small voice asked over the phone, startling Hizashi, who was currently alone in the room. He quickly unmuted the phone.\n“Yeah, Little Listener; I’m here.”\n“Mic.” He could hear the relief in the kid’s voice.\n“Feel free to call me Yamada. It’s my civilian name.”\n“Y-you’d really trust me with that?”\n“Of course!”\n“Y-you can cal me Izuku, then.”\n“Hm… Tell me then, little Izuku, what kind of hero do you want to become?”\n“What kind of hero?” He paused for a moment to think. “Any kind works for me, so long as I help people. I doubt I’d be a good limelight hero right off the bat, so maybe a support hero or an underground hero? Since I’d be relying mostly on my support gear and inventions, it’d probably be a good idea to team up with someone who can fight well against people with Quirks that can nullify or otherwise control electronics. I can analyze, plan and fight where I can, while my partner deals the heavy blows. So I guess maybe someone like Nighteye or you? ‘Cause you started off as a support hero until you got a good feel for how things worked, and then you branched off on your own. You still typically team up with close-combat heroes so you can provide ranged support, so something like that’d probably be a good matchup for me.”\nDid the kid even take a breath?! “Wow, you’ve given this a lot of thought!” Hizashi grinned.\n“Of course. It’s my future, after all. I can’t just stop at getting into high school—I have to look at the bigger picture.”\nHe smiled as they made idle chat for about twenty minutes. Shouta eventually came back into the room.\n“Oh? You’re awake, Problem Child.”\n“Eraserhead!” The kid’s smile was audible, and Hizashi couldn’t wait to see it in person.\n“You can use my hero name when there are other people around, but when it’s just us and Hizashi, you can call me Aizawa.”\nHizashi swore he heard the kid squeal in excitement.\n“T-thank you, Aizawa!” Yep, that was definitely an excited squeal.\n“We should have enough of a location within the next two hours or so, and ready to head out soon after.” Shouta informed him, and Hizashi let out a silent breath. They’d shaved off another half hour—that was fantastic. He glanced at the clock. It was about six-thirty.\nThey heard the sound of metal screeching against metal, and the heroes stiffened. “Get up, brat.” Shigaraki spoke, and the two winced. “We’re going to have some fun today.”\nThey could hear scuffling as Izuku complied with the villain.\n“Where are we going?” He asked in a small voice.\n“We’re going to see the doctor, of course!”\nHizashi felt his blood turn to ice as he shared a horrified look with Shouta. He wasn’t sure he’d ever seen his husband so pale.\n“Oh, don’t look so scared!” Shigaraki continued. “It’s just a little torture. Nothing major. Just preparing you for your makeover in a few days.” There was the sound of another door opening, and some scuffling. “Wait here. Try anything, and I’ll start removing fingers.”\nThe door closed again. The kid let out a small heartbreaking whimper and Hizashi felt tears prick his eyes.\n“Hang in there, kid.” Shouta tried reassuring him.\n“It’ll be okay. We’ll be coming for you before you know it.” Hizashi tried.\n“I… I’ll be fine.” The kid sounded more like he was trying to convince himself. “I’m going to mute the mic on my end for a little bit.”\n“Wait, kid, don’t—” Hizashi tried, but the kid cut him off.\n“No, it’s… it’s okay. Really! I don’t want you to… have to listen to this.”\n“There’s no shame in it.” Shouta spoke up. “Pros scream, too. We’re all human. We also need the audio of this ‘doctor’ person so we can make a file on him.”\nThe kid hesitated. “O-okay.”\nShouta and Hizashi shared a look. This was not going to be easy to listen to. He had half a mind to let the kid mute himself, but they needed to be there with the kid. In any way they could be.\nThey heard the door open again. “Hello, Midoriya Izuku. I’m the Doctor. Good to see you again.”\nGaraki Kyudai, better known as Ujiko Daruma had been having a wonderful morning. He woke up at four, made himself breakfast, checked on his wonderful children (the Nomu), and enjoyed a nice hot cup of coffee with a splash of half-and-half and three sugars.\nToday, he had a new child to prep. This one was Quirkless, and would likely take to the Quirks a lot better than the others they’d played around with. Maybe he could get another masterpiece out of this one? He really hoped so.\nHe’d looked at the kid’s file, but hadn’t bothered to look at the photo. He’d see the kid soon enough, and he could evaluate his newest doll with his own critical eye.\nWhat he hadn’t expected when he walked into the room, was to see the same kid he’d pronounced Quirkless while he’d been practicing under the pseudonym of Tsubassa. Looked like the kid recognized him, too.\n“Hello, Midoriya Izuku. I’m the Doctor. Good to see you again.” He grinned as the boy startled.\n“D-Doctor Tsubassa?! W-wait! You work for…?!”\n“Yes. I do.” He grinned. He hadn’t expected this, but he was even more excited to start, now. “How’s your mother? I think I still have your address written down somewhere.”\nThe kid stiffened and there was a shine of fear in his eyes. Good. He didn’t really have the information written, but it’d be easy enough to get—they had his name, after all. There weren’t many Quirkless Midoriya Izukus running around Musutafu, after all.\n“Normally, I’d have you change into something more comfortable, but you should be fine in what you’ve got on. Though the shirt must come off.” He waited with a gleeful smile as the kid listened, and removed his shirt. The unblemished skin… Wait, that wasn’t unblemished. He frowned.\n“You’ve an impressive number of scars. Burns? And is that a stab scar?”\n“I get bullied a lot.” The kid answered grimly.\n“Well that won’t do. You’re one of my children, now. I simply won’t have anyone hurting what’s mine.”\nThe kid paled a bit. Was he being overly possessive again? It didn’t matter, the child would likely lose his mind in the next week or so anyways. Shame, because those eyes shone with intelligence. Perhaps he would make it through with enough will to speak?\nWell, it was no matter. He led the kid to the table and strapped him down. Now was the fun part.\n“I’m not like other people—I’ll explain what I’m doing as I go. It’s better for me to think out loud anyways, not that you’ll be able to process much once we really get started. Do try not to scream too loudly, though.” He grinned.\n“First, we’re going to make absolutely certain that you have no Quirk Factor.” He pulled out a syringe. “This little gem is something of a prototype I got from a friend. It destroys any Quirk Factor that may be there. Since you’re Quirkless, it really shouldn’t hurt much.” He injected the concoction into the boy, and watched as he shivered.\n“Good. As I thought, you really are Quirkless. Not a trace of the Quirk Factor. Lucky you.” He quickly set up the IV. “Now this is going to hurt.” He bounced on the heels of his feet in anticipation. “I’ve found that you can force a dormant Quirk Factor to activate—or in your case open the space for one—when specific conditions are met. When the body believes itself to be in mortal danger, and the pain sensors are on overload, it’ll do whatever it takes to survive. In Quirked individuals, it’ll heighten their Quirk and push that into overdrive. But for you, I’ll need to train your body to think that way. This’ll help keep you from dying once a Quirk is introduced.”\nHe opened the channel and put on a pair of gloves. He grabbed a scalpel and grinned.\n“Of course, that’s if you survive the procedure.”\nShouta was beyond angry. Listening to the monster describing what he was doing to this child made him want to vomit. He pushed his coffee away in distaste.\nThey’d heard a few whimpers from the kid, but he hadn’t screamed once. Hizashi was pale and shaking, and Shouta was pacing the room. He held onto his anger, knowing that the moment he let it go, he’d be in the same state as his husband.\nOh, when they found this Tsubassa person, he was a hundred different kinds of dead. And Shouta would make sure that there would be no body to be found. Not even this Sensei of a million Quirks would be able to stop Shouta once he got his hands on this—\n“Shou, you’re muttering again.” Hizashi spoke quietly.\nDamn, he thought he broke that habit in middle school.\n“You’re doing great, kid. Just hold on.” Hizashi winced as his voice cracked—something that Shouta had only heard from his husband once or twice. He said it hurt a lot, since his voice was essentially his Quirk. Hizashi rubbed his neck a bit and Shouta pushed a hot cup of water and honey into his hands.\nHe glanced at the clock. This had been going on for an hour, now. “We’re rootin’ for ya, Problem Child.” He was worried that the kid hadn’t screamed. From the descriptions, the kid should be in agony. Shouta, himself, would be screaming at half the shit this abomination was doing.\nTsukauchi was pale-faced at the doorframe, having walked in about ten minutes ago.\n“That should be enough for today. We’ll pick up where we left off tomorrow.” The doctor finally said, and the three men let out massive sighs of relief. Thankfully, nothing that he described should be permanent, aside from scarring.\nThere was shuffling and the sound of a door opening before his small hoarse voice spoke.\n“Didn’t kill me, bitches.”\nHizashi let out a small half-chuckle even as some tears ran down his face. “Listener, you’re one hell of a fighter.”\n“I don’t feel like it. I feel like I lost a fight with an electrified wood chipper.” He gave a dry cough and gasped briefly in pain. “Still good.”\n“You did better than most pros. Be proud of that, Problem Child.”\n“You really think so?”\nTsukauchi went to open his mouth when an officer dashed over to him. He whispered something and the detective grinned. “Suit up, boys. Kid, we’ve got your location.”\n“FINALLY!” Hizashi cheered and Shouta let a grin spread on his face.\n“Kid, hold tight—we’re on our way.”\nIzuku had never been more relieved nor anxious than when Eraserhead told him they were on their way. He was in pain, and his entire body hurt like nothing he’d ever felt, but it was starting to fade.\nHe hadn’t eaten in two days—because like hell he was going to eat what the villains gave him—and he honestly slept like shit last night. But they had his location. They were coming to get him—at last.\nThey’d left another officer on the phone with him—the same one that had initially answered his call. Had it really only been one day? It felt like forever ago.\n“I’m going to keep you posted on what’s going on with the heroes, nya.” Sansa said.\n“We’re still with ya, kid. We patched the signals together, so we can hear you, too.” Aizawa’s voice filtered through and Izuku felt himself relax a little. The man’s voice was really comforting. Yamada’s voice made him smile, Tsukauchi’s made him feel calm, but Aizawa’s made him feel safe. And that was really what he needed right now.\n“Thanks, Aizawa.” He smiled.\n“Hey, it’s Eraserhead on duty, Problem Child.”\n“Right. Sorry!” His smile grew wider. There wasn’t a drop of venom in the man’s voice, and it sounded almost teasing to his ears.\nHe was going to be out of here! They were coming to rescue him!\n“We’ll be there in less than ten minutes, Izuku! Hold tight.” Yamada said.\n“Destination is fast approaching on the left—looks like a bar of some kind.” Sansa said.\n“Got it. We’ll surround the building first and I’ll follow the heroes in with Team A.” Tsukauchi’s voice was stern and meant business. “We’re almost there, kid.”\n“Good, because—” He cut himself off when the door opened. Shit.\n“Ah, so it appears you are more durable than a normal NPC.” Shigaraki’s smile sent a shiver down his spine. “Maybe you are a Player Character after all. We’ll see.”\nHe took a moment to eye the untouched plate of food they’d given him. “You didn’t eat. That’s rather rude.” Izuku stiffened. “Here we are sharing our food with you, and you waste it.” He glared.\n“Three minutes.” Aizawa’s voice was tense, and he could hear them readying weapons.\n“Well?!” Shigaraki’s hand reached forward and grabbed Izuku’s shoulder, making him stiffen in fear. He felt four fingers. “Are you going to answer, boy? Because I doubt Doctor Ujiko would be too angry if I only took your arm.” Izuku didn’t doubt for a second that he’d do it, too.\n“I-I was feeling sick. I didn’t think I could stomach the food.” He answered hesitantly. He swore he could feel the finger inching closer.\n“A minute and a half, pick it up!” Yamada’s voice sounded, and Izuku was so fucking grateful that he made these earbuds bypass the eardrum; otherwise Shigaraki would’ve heard that for sure.\n“I-I’m sorry!” Izuku stuttered out, and the finger froze, touching only his shirt. He winced as he felt the fabric turn to dust under the man’s grip—he swore he felt the hairs on his shoulder turn to dust, too.\n“That’s better.” Shigaraki grinned and pulled away. Izuku let out a shaky sigh of relief. “I expect you to remember your manners.” He grinned and wrapped his hand around Izuku’s left forearm.\n“AH!” He cried out in surprise and pain as he felt the skin cracking and flaking off, revealing muscle.\n“Izuku!” Aizawa’s voice called out. “What’s going on?!”\nShigaraki pulled his hand back as Izuku’s arm started to sluggishly drip blood. “Remember that, brat. I’ll leave you with your arm this time.”\nHe clutched his arm like an injured puppy and watched as the blue-haired man left the room.\n“I’m okay. He just disintegrated part of my arm.” He wrapped the injury in his shirt.\n“Kid, you’re gonna give us a heart attack.” Tsukauchi muttered.\n“Though the disintegration felt different than I expected. And the way my skin flaked… I wonder if it isn’t closer to a hyper-dehydration than actual disintegration? Possibly Decay… Or perhaps a dual-quirk that’s so similar that nobody’s realized it? Dehydration for organic materials and disintegration for inorganic materials? Though it does burn a bit… perhaps it’s something else entirely? Though that could just be the filth in the area causing the burning sensation… Maybe it’s something happening on an atomic or cellular level?”\n“You mutter, too, huh? Eraser had the same habit.” Yamada sounded mildly amused, and Izuku quickly slapped a hand over his mouth.\nOh, god, was he muttering out loud?! In front of his heroes while being held captive by villains?! He was analyzing a Quirk that had been used on him. To hurt him. They must think he’s such a weirdo.\n“Nothing wrong with having a fast mind, Problem Child. Just try to curb the mutter.”\n“He’s impressed by your analysis, though.” Yamada added, and he could hear Eraserhead’s huff.\n“We’re here.” Tsukauchi announced, and Izuku felt jittery in anticipation.\nHe took a deep breath as he heard a commotion kick up on the radio. Sounds of doors being kicked down and yelling and fighting. Izuku heard the commotion upstairs, too.\nFor a moment, he feared that Kurogiri would come down and warp him away before the heroes could come and save him. That they’d burst through the door just as he was being carted back to Dr. Tsubassa’s lab of Hell, and he’d be turned into one of those monsters he’d glimpsed during his torture session that morning.\nHe heard the door open, and tensed.\n“Listener?!” He blinked up in shocked relief when he saw Present Mic and Eraserhead standing there with a man in a tan trench coat that could only be Tsukauchi.\n“I-I’m over here!” He called out, and the three ran over to the door.\n“Hey there, Problem Child.” Eraserhead grinned as he pulled out a bobby pin and picked the lock to his cell in record time.\nIzuku didn’t care, in that moment, how weak it could make him look. He ran right into the arms of the Erasure Hero. Aizawa scooped him up and held him securely as he clung to him like a lifeline.\n“We got him!” Yamada grinned as he spoke into the microphone.\n“Thank god.” Sansa said over the line. He could hear some cheering in the background on the other end of the line. Was the whole station involved in this?\n“Come on, Problem Child. Let’s get you patched up.” Aizawa’s grip tightened around him, and Izuku hid his face in the man’s Capture Weapon. He let the tears cascade down his face as he relaxed into the man’s protective embrace.\n“Thank you.” He whispered as they stepped out into the sunlight. There were tons of cops gathered around, weapons at the ready.\n“Sir!” A group of cops came back out of the building. “The villains escaped through a Warp Portal.”\n“Damnit.” Yamada cursed as Aizawa carried Izuku to the ambulance. He was loaded in, and the dark-haired hero climbed into the back of the ambulance with him, much to his relief.\n“We’ll meet you at the hospital.” Tsukauchi promised.\n“Thank you. Thank you.” Izuku couldn’t think of anything else to say. He was finally safe.\nAizawa gently petted his hair as the medics got to work. The only thing he could really feel was the man’s calloused fingers threading through his tangled locks. He smiled softly as he finally gave into his exhaustion, and drifted off to sleep.\n\nI’m safe.\n"
}