{
    "id": "25172014",
    "url": "https://archiveofourown.org/works/25172014?view_full_work=true",
    "author": [
        "iliacquer"
    ],
    "title": "tie a knife with a ribbon",
    "rating": "Explicit",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "魔道祖师 - 墨香铜臭 | Módào Zǔshī - Mòxiāng Tóngxiù",
        "陈情令 | The Untamed (TV)"
    ],
    "relationships": [
        "Lan Zhan | Lan Wangji/Wei Ying | Wei Wuxian"
    ],
    "characters": [
        "Lan Zhan | Lan Wangji",
        "Wei Ying | Wei Wuxian"
    ],
    "additional_tags": [
        "Dubious Consent",
        "Bottom!Lan Wangji",
        "top!wei wuxian",
        "Yiling Patriarch!WWX",
        "D/s",
        "Rimming",
        "Frottage",
        "Just so much smut",
        "a lot of smut",
        "a sprinkling of plot for flavour",
        "war prize LWJ"
    ],
    "language": "English",
    "series": "",
    "published": "2020-07-09",
    "completed": null,
    "words": "5,594",
    "chapters": "1/1",
    "comments": "366",
    "kudos": "13,536",
    "bookmarks": "2,379",
    "hits": "100,478",
    "summary": "<p>The Yiling Patriarch makes a bargain with the cultivation world. He'll give them the power to defeat Wen Ruohan. No more death. No more war. </p>\n<p>All he wants in return is Lan Wangji.</p>",
    "notes": "<p>pls de-anon!</p>\n<p> </p>\n<p> </p>\n<p> <strong>Prompt:</strong></p>\n<p> </p>\n<p>So I love war prize fics...</p>\n<p>Any canon/setting/or other genre included is fine. Any background pairings are fine.</p>\n<p>Wei Ying was not adopted by the Jiang Clan as a child; he grew up the yiling patriarch instead (reasoning is your choice). When the war happens, the 4 Clans ask him to help defeat the Wens. Maybe Lan Zahn goes to the Burial Mounds to request help, or Wei Ying sees Lan Zahn at a war meeting and says \"him! I choose that one.\" But Wei Ying gives a small gift (token/ribbon/something of your choice) to Lan Zahn that he <i>must</i> wear until the end of the war, promising that it will help against the Wen puppets.</p>\n<p>*On the condition* that Lan Zahn joins him of his free will in the Burial Mounds after the war is won. That can be forever, or can be for a specific length of time.</p>\n<p>Whatever the gift is, when they approach Nightless City, the puppets run in terror from Lan Zahn. It turns the tide of the war.</p>\n<p>Lan Zahn goes to him following the war. Do the other clans let them be? Do they now fear the yiling patriarch? Do they find a reason to attack the burial mounds under the flimsy excuse they must rescue Lan Zahn? </p>\n<p>Dub-con is fine, no non-con please. Would prefer that Lan Zahn falls in love with Wei YIng as well, and at some point, protects/defends him against the other 4 Clans. (Maybe they meet up a year after the war, Lan Zahn and Wei YIng going to some conference to meet with them. Maybe it's if/when they try to attack the Burial Mounds.) </p>\n<p>I would like LXC to get some peace over their union, in the end, so he doesn't worry endlessly for his brother.</p>",
    "text": "Lan Wangji sold himself for a good price, all told. As the leaders of all the great sects and all the finest cultivators in the land stood or sat stiff-backed and thin-lipped in the cramped war tent, the Yiling Patriarch sat in a loose sprawl, drinking liquor from the bottle, and promised them the defeat of the Wen sect. The destruction of Wen Ruohan’s puppets. Revenge.\n \nThe cultivators – lean from hunger, their sects decimated, the wolves of defeat biting at their heels – listened to his promises eagerly. Everyone knew what the Yiling Patriarch could do. Everyone hoped he would deign to do it for them.\n \nThe Yiling Patriarch touched his mouth to the bottle, thoughtful. Then he exhaled, and lowered it. The cultivators waited in silence.\n \n“All I want in return,” he said finally, pointing one elegant finger at Lan Wangji, “is him.”\n \nLan Wangji, seated at his brother’s side, stiffened. He had not expected to be noticed by anyone at this meeting. He was here to support his brother and no more. He looked at the Yiling Patriarch, who looked back with malice and mirth in his dark eyes, and did not understand why his heart thudded as if a fist had closed around it.  \n \n“Him?” One of the other cultivators spoke up, incredulous. “What do you want with Second Young Master Lan?”\n \nThe Yiling Patriarch smiled. He looked as young as people said, perhaps no older than Lan Wangji himself, but there was a cunning in the shape of his smile and the lazy, deliberate way he held himself, insulting the men around him without words.\n \n“He’s the prettiest of all of you,” the Yiling Patriarch said, rubbing a thumb back and forth over the lip of the liquor bottle as he gazed at Lan Wangji with heavy-lidded eyes. That look was deliberate too. A goad and a promise. “I’d like to see how he looks spread out under me.” A beat. “I want to fuck him, just to be clear.”\n \n“We understood, Yiling Patriarch,” Lan Xichen said tightly, even as Sect Leader Yao and Sect Leader Ouyang roared in outrage. “But I’m afraid my brother’s honour is not for sale.”\n \n“Then I’m afraid my help isn’t for sale either,” the Yiling Patriarch replied easily. “And really – you all act so offended. Would you complain so if I’d asked for one of your daughters or sisters in marriage? At least three of you have tried to ally with me before by flinging your girls at me, don’t pretend you haven’t.”\n \nHe gave one of the minor sects heads a significant look. The man spluttered in red-faced anger. Then he began shouting at the Yiling Patriarch, and a few more cultivators joined in, too enraged for sense.\n \nLan Wangji had been sitting in utter silence, all through this. Now, he thought of the day Cloud Recesses burned; of the ache in his leg, which had healed but not easily and not without scars that would never leave him. He breathed through the nameless panic twisting through him.\n \nHe smoothed his robes flat with his hands and looked back at the Yiling Patriarch.\n \n“You are not offering marriage,” Lan Wangji said. He did not shout. He was not inclined to shouting. But his voice was as clear as any Jiang clarity bell, and quelled the other cultivators into sudden silence. “Marriage provides long-term benefit. What you offer does not.”\n \n“I think seeing the Wen clan fall would provide you all a lot of long-term benefit,” the Yiling Patriarch said. “But never mind that. Do you want to marry me, Second Young Master Lan?” the Yiling Patriarch’s voice was mocking. “Do you want to wear red and be my bride? I don’t think you’d like a lifetime on the Burial Mounds.”\n \n“Explain your terms,” Lan Wangji said.\n \nHis brother lay a hand upon his arm. Said, “There is no need to explain your terms. With respect, Patriarch. My brother is not for sale.”\n \n“Ah, but does your brother agree with that?” The Yiling Patriarch cocked his head to the side. “Do you think a month in my bed is too high a price for the survival of Gusu Lan, Second Young Master Lan?”\n \nEven six months ago, Lan Wangji would have been furious at those words. No one had any right to speak so about him – about anyone. But the war had beaten the hard edges of his rage and his pride and left him remade. Dented. Less and more than he had once been.\n \n“No,” said Lan Wangji. “I do not.”\n \n-\n \nThere was more arguing. A great deal more arguing. Lan Xichen was adamant that Lan Wangji would not be sold. But the war had been so long already, and the sects were withering, and the Lan clan no longer had the clout it once possessed.\n \nIn the end, the deal was made. And the Yiling Patriarch smiled once more, and said, “Here. I’ll entrust this to you, Lan Wangji, and you alone.”\n \nLan Wangji’s name had been given to the Patriarch, in the course of the negotiations. Lan Wangji had not learned his in return.\n \nThe Yiling Patriarch stood. The Patriarch was lean, but there was the promise of future broadness in his shoulders, and the hand he held out to Lan Wangji was firm and strong, long-fingered.\n \nOn his palm lay a ribbon. Red as blood.\n \n“Wear it as a collar,” the Yiling Patriarch said softly. His eyes were fixed upon Lan Wangji. “And a weapon. Wear it to war, and you won’t fail. I vow it.”\n \nLan Wangji took the ribbon from him. He wound it around his own throat, and felt it slither into place, binding into a knot as if tied by an unseen hand. The Yiling Patriarch nodded approvingly.\n \n“I’ll see you in the Burial Mounds when this is over,” he murmured. He did not touch the ribbon, but his voice was a caress that travelled through it all the same – a strange, fiery thing that wound hot through the band of tight silk.\n \n-\n \nWhen Lan Wangji went to war – when the Wen puppets fell one by one before him, as if the power that fed them had been cut at the source – he remembered the heat of the Yiling Patriarch’s voice against his skin. The curve of his mocking mouth.\n \nLan Wangji did not like to be mocked, and yet. And yet.\n \nHis brother arranged for him to meet with one of the Lan healers, a woman who explained to Lan Wangji in excruciating detail what was involved in lying with a man. She gave him two vials: one full of healing salve, and the other with a slick substance, thicker than oil. To ease the way, she told him, and Lan Wangji barely resisted the urge to blush. His ears burned. He tamped down his own embarrassment and took the vials from her, with murmured thanks.\n \nThe war continued. He ignored the looks of pity from other cultivators. The way their eyes fixed on his neck – on the slash of red upon it, blood-bright. A claim and a wound.\n \nHe told himself that this was, in a way, no different from how the daughters of great cultivation sects were bartered for power. He had as much choice, if not more, as any woman told she must marry for her sect’s survival. If his reputation suffered from this, it would be of no true consequence to his future at Cloud Recesses. He would be able to return to his clan. His family would honour and love him. He would perhaps never marry, but he would have a home and purpose. He had no reason to be afraid.\n \nHe reminded himself of this, on the day when Wen Ruohan finally died and the cultivation world broke into celebration – as his brother stared at him with wet eyes, devastation and relief both written into the shape of his jaw, his mouth. My honour is a fair price for this.\n\n \n\n\nFor this, I would have given anything. \n\n \n-\n \n“Ah, Lan Wangji!” The Yiling Patriarch sounded delighted. “My gift worked then?”\n \nLan Wangji nodded. He lowered his small pack of belongings to the ground and bowed. Around him, the Burial Mounds were dark, even though beyond the barriers of the Patriarch’s domain, the sun shone. The Patriarch’s people – the cultivators and normal folk who had made bargains with him, and offered their eternal service in return for their heart’s desires – watched him from the doors of their small homes. Lan Wangji tried not to look at them as he bowed.\n \n“I am here,” Lan Wangji said. “As promised.”\n \n“Good boy,” the Yiling Patriarch said approvingly. He bounded across the ashy ground, as light on his feet as a boy. He looked into Lan Wangji’s face. “You look exactly how I remember.”\n \nDo I still please you, then? Lan Wangji thought of saying. But he did not. It was the kind of bravado he did not possess. His strength lay in silence.  The Yiling Patriarch looked him over leisurely, more calculating than lecherous, reading Lan Wangji’s body language, his clothes, his skin.\n \n“I took in some of the Wen sect survivors,” the Yiling Patriarch said casually. “So don’t try and attack any when you meet them, hm? They’re just farmers. Children. The odd healer.”\n \n“I will be respectful,” Lan Wangji said, hearing the stiffness of his own voice.\n \n“Good,” the Patriarch said again, soft. “That’s good. Now. Follow me.”\n \n-\n \nIt was quiet in the Yiling Patriarch’s own rooms. Lan Wangji followed him in without a word, adding nothing to the quiet. Waiting.\n \n“Are you still willing to fulfil your debt?” the Yiling Patriarch asked. He loosened his robes, though he did not remove them.\n \n“I am willing,” Lan Wangji said. His voice was already hoarse, simply from the sight of the Yiling Patriarch’s throat. The shape of his shoulder, partially bared.\n \n“The war is won,” the Yiling Patriarch said. “You could have refused to come here. You could still refuse me. What could I possibly do about that?”\n \n“A great deal,” Lan Wangji said. “I imagine.”\n \nThe Yiling Patriarch laughed. Then he threw himself back onto the bed, a sprawl of limbs and dark robes. The red ribbon was a splash of bright blood against his hair. He looked at Lan Wangji, eyes creasing as his mouth curled.\n \n“I won’t drag you into my bed,” the Yiling Patriarch murmured. “I won’t make you lie under me. But I think you’re an honourable man, Lan Wangji. And you made a vow.”\n \nLan Wangji bowed his head in acknowledgement.\n \n“What would you have me do?” he asked.\n \n“First,” the Patriarch said. “Come here.”\n \nLan Wangji crossed the room. Sat upon the edge of the bed. But the Patriarch crooked a finger at him, urging him closer, and Lan Wangji held his courage fast and crawled across the bed, until he was leaning over the Patriarch, framing the Patriarch’s body with his own.\n \nThe Patriarch was still smiling. But this smile was small. Almost a secret.\n \n“Now,” the Patriarch said softly. “Kiss me.”\n \nLan Wangji hesitated only momentarily. Then he lowered his head, brushing his mouth against the Yiling Patriarch’s own mouth. The man’s mouth was soft. The touch of his lips made Lan Wangji’s own mouth feel oddly alight, warm. Lan Wangji repeated the motion, lips brushing lips, then raised his head.  \n \n“Is that what you call a kiss, Lan Wangji?” the Yiling Patriarch asked. But the mocking edge to his voice was blunted, more curious than cruel.  His breath fluttered against Lan Wangji’s lips.\n \n“My apologies,” Lan Wangji said in return. He kept his eyes on the Patriarch’s own. “I have not kissed anyone before. You must teach me, Patriarch, how you best like to be kissed.”\n \n“Ah, so polite,” the Patriarch murmured. He raised his hand up. “Here,” he said. “Like this.”\n \nHe guided Lan Wangji’s mouth. Lips against lips. Firmer this time, then firmer still, as he coaxed Lan Wangji’s mouth open, flicking his tongue against Lan Wangji’s own, drawing him closer. Lan Wangji mirrored him. They kissed and kissed, the tension in Lan Wangji so taut that he could not stand it a moment longer.\n \nLan Wangji bit the Patriarch’s lower lip. Sucked it, softly, insistently, between his own teeth. Something, he thought. You must do something. \n \nThe change was sudden. The Yiling Patriarch groaned, gripping him by the jaw, by his hair. Lan Wangji’s forehead ribbon was knocked askew; his hair ornament was tugged free and flung away. It clattered against the floor. Their mouths parted, and then the Patriarch’s teeth were on his throat, sucking bruises around the red ribbon he’d given to Lan Wangji to seal their vows. The Patriarch shoved up Lan Wangji’s robes; unlaced his trousers, deft and impatient; shoved them down, away -\n \n“Wait,” Lan Wangji said sharply, and the Patriarch paused as Lan Wangji fumbled, dragging off his first layer of robes. His second. He drew out the vial of slick. Shoved it unceremoniously into the Yiling Patriarch’s hand, as he removed his trousers too, reduced to nothing but his inner robe.\n \nThe Yiling Patriarch raised his eyebrows.\n \n“How good of you to come prepared,” the Patriarch said. And then he was all movement again: shoving Lan Wangji flat beneath him. Drawing Lan Wangji closer, until Lan Wangji’s legs were spread around him, his inner robe nearly open, exposing a sliver of his chest, his thighs. He watched as the Patriarch poured slick over his fingers; as his clean hand pushed the robe open, leaving Lan Wangji’s cock, his parted legs, bare to the Patriarch’s eyes. His touch.\n \nThe Yiling Patriarch looked into his eyes as he pressed his hot palm to Lan Wangji’s cock. Lan Wangji’s breath shuddered out of him. He heard the Patriarch mirror his exhale. Saw those eyes darken.\n \nThe Patriarch’s fingers curled. Tightened around him. And then he was moving his hand up and down Lan Wangji’s hardness; pressing his thumb into the slick of his pre come, circling the head of his cock, sliding his thumb down the heat of him, using it to soften the friction of his skin against Lan Wangji’s skin.\n \nLan Wangji did not move his hips. Did not groan. He did everything in his power to keep his face blank, as the Yiling Patriarch watched him and touched him, gazing at him with a hunger that was fathomless.\n \n“If you will use me, Patriarch,” Lan Wangji said, dangerously close to begging for something he could barely allow himself to understand, “then use me.”\n \n“This is use,” said the Yiling Patriarch.\n \n“Your bargain was to…” Lan Wangji could not bring himself to say it, even now, with the Patriarch between his thighs. To fuck me. “Not – this.”\n \n“You really are innocent,” the Patriarch laughed. “But here. I’ll take pity on you. Never say I’m not merciful, Lan Wangji.”\n \nHe moved his fingers – those long, callused fingers – down beneath Lan Wangji’s cock. Against the furl of his body. Two of them, together, slid into him.\n \nLan Wangji’s breath hitched. His body tensed.\n \n“How does it feel, Lan Wangji?” The Yiling Patriarch’s voice was like silk; like the knot of red at Lan Wangji’s throat, stealing the air from his lungs. “Tell me how it feels.”\n \n“As if,” Lan Wangji forced out, “there are fingers inside me.”\n \nThe fingers inside him stilled for a moment. Then the Patriarch laughed, low delight, and began moving them again. “Were you making a joke, Lan Wangji?”\n \n“I am not known for my humour,” Lan Wangji managed to say.\n \n“What are you known for?”\n \n“Righteousness,” Lan Wangji said promptly. Another finger joined the two inside him. He forced himself to breathe as sensation welled through him. “Scholarship. Honour.”\n \n“Such boring things to be known for,” the Patriarch said. “I think maybe you’re known for the wrong things, Lan Wangji. I think you have more anger and joy in you than people know. Am I right?”\n \nYou do not know me. Lan Wangji almost bit out the words. Instead he looked at the Yiling Patriarch, unblinking even as he was spread open, prepared. He looked, and let the flint in his gaze speak for him.\n \nThe Yiling Patriarch nodded solemnly, as if Lan Wangji’s look had imparted some great knowledge. He curled his fingers, and Lan Wangji shuddered, pleasure like a knife rocking through him. His hips squirmed. His hands twisted into fists.\n \n“There you are,” the Patriarch said, satisfied. And did it again. And again.\n \nBy the time the Patriarch considered him ready, Lan Wangji was left in nothing but his forehead ribbon and the band of red cloth at his throat. He felt the Patriarch’s hand slide up his throat; felt one of those fingers hook gently beneath the red ribbon, drawing his head up. He was achingly hard. His whole body felt desperate, as if his skin were itching, burning with pleasure. He did not know what to do to alleviate the feel of it. He couldn’t touch himself, couldn’t bring himself to the swift ease of climax. All of this, he had promised this to the Yiling Patriarch.\n \nThe Patriarch kissed him. Lan Wangji made a small sound against his mouth. The Patriarch held him up for the kiss for a long moment, bruising his mouth sweetly. Then finally he released him.\n \n“Shh,” the Patriarch murmured. “I’ll ease it, Lan Wangji.” His hands stroked over Lan Wangji’s thighs. “I know what I’ve made you need. I’ll see this through.”\n \nLan Wangji was not a small man, but neither was the Patriarch. He lifted Lan Wangji’s hips, muscles in his arms corded. Lan Wangji was still open, slippery from the Patriarch’s fingers. He couldn’t have resisted the press of the Patriarch’s hips, the blunt pressure of his cock, even if he had wanted to.\n \nHe didn’t want to resist. He was overwhelmed, want radiating through him like spilling light through shadow. He was furious with the Patriarch in a way he couldn’t explain, angry and shamed and alight and more aware of his own flesh than he had been in a lifetime. He felt every inch of the Yiling Patriarch’s cock stretching him wide, spreading him open. It hurt but it was a good hurt, a claiming.\n \nLan Wangji reached for his cock, a noise breaking out of him – hungry, desperate – as the Yiling Patriarch pushed his hand aside and grasped Lan Wangji’s cock himself.\n \n“There you are, Lan Wangji,” he crooned. “You feel so tight around me. So good. Will you wrap your legs around me?”\n \nLan Wangji should have refused. Should have ignored him. Instead he lifted his legs, wrapping them around the Yiling Patriarch, ankles touching as the Yiling Patriarch fucked him deep and stroked his cock with steady, delicious pressure.\n \n“Good boy,” said the Patriarch. And Lan Wangji clenched his eyes shut. It was unbearable. It was shameful. It was -\n \n“You can come,” the Patriarch told him, and Lan Wangji did. Seizing, back arching, body alight.\n \nThe Yiling Patriarch fucked him through the aftershocks, a feral smile on his mouth.\n \n-\n \nThe Yiling Patriarch took him again that night. Rolled him onto his back and grasped his wrists and slid into him, fucking him roughly, teeth against the back of Lan Wangji’s neck. He felt even bigger like this, and Lan Wangji was sensitive, sensitised to the feel of the Patriarch’s cock.\n \nLan Wangji came untouched.\n \nIn the morning, Lan Wangji should have been too sore to be touched, but he was grateful when the Yiling Patriarch opened him gently, easing him into arousal with his plush mouth around Lan Wangji’s cock. When Lan Wangji was biting his own tongue to stop himself from begging, the Patriarch slid into him. Used him, face to face.\n \n“Don’t come yet,” the Yiling Patriarch crooned, rocking into Lan Wangji with excruciating slowness. “Not yet, Lan Wangji.” He touched a palm to the ribbon at Lan Wangji’s throat. “Not yet. Sweetheart.”\n \nLan Wangji was still furious with him. But he had spent his life parched, thirsty for touch, for praise, and the Yiling Patriarch was pressing it all to Lan Wangji’s lips.\n \nHe moaned, helplessly. Obeyed.   \n \n-\n \nThe Yiling Patriarch could not fuck him all the time, so Lan Wangji occupied his free time helping in the fields, or caring for the smaller children who lived in the Burial Mounds. A few remnants of the Wen sect had made their own pact with the Patriarch, and had survived the war under his care, as he’d warned Lan Wangji. But Lan Wangji held no ill toward them, and in turn, their wariness soon melted into kindness.\n \nOne of the Wen survivors was a small child, a chubby and cheerful little boy who liked to cling to Lan Wangji’s leg and babble stories at him. Lan Wangji grew fond of the boy quickly, and played with him often under the fond, watchful gaze of the boy’s grandmother.\n \nEvery day when he finished his work, he returned to the Patriarch’s room. And every night, the Patriarch came to him, and took him.\n \nOne night the Patriarch was late. Lan Wangji bathed leisurely – washed his properly for the first time in days, giving it the laborious attention it required, to see all the knots unravelled.\n \nAfter he’d bathed, when he drew on his inner robe, his damp hair loose against white cloth, the Patriarch found him and very swiftly crossed the room. There was no pause between his arrival and his hand gathering up the weight of Lan Wangji’s hair like a leash.\n \nThe Patriarch pressed him down onto the bed – pushed Lan Wangji’s face against the sheets with the gentle pressure of his fingers against Lan Wangji’s wet hair. Said, “Lan Wangji, let me, like this.” He sounded wrung out, desperate, even though Lan Wangji had done nothing, even though they had fucked only that morning, the Patriarch pinning Lan Wangji’s wrists to the bed as he used Lan Wangji’s thighs, slippery with oil, pressed tight together for his pleasure.\n \nLan Wangji let himself be held down. The Patriarch grasped him by the backs of his legs, drawing his lower body up, shoving his thighs wide. Lan Wangji was open to him, exposed. He felt the Patriarch’s hair brushing his thighs – felt the heat of his breath, where he was spread open – his mouth –\n \nLan Wangji was grateful that the sheets swallowed up the sound that escaped him then. His hands clenched to fists against the bed. It was so strange: the slick, coaxing warmth of the Patriarch’s tongue against him, the heat of his lips, the coldness of his saliva when the Patriarch breathed out a low, reverent moan against him. And yet it made fire radiate through him, pulse in him like a wave dragging his good sense under. Lan Wangji gasped out again, airless, and his body raised up to meet the Patriarch’s mouth without his say so. That made the Yiling Patriarch laugh, a fond and hungry sound against the furl of Lan Wangji’s body. New heat shot through him.\n \n“That’s it,” the Yiling Patriarch said tenderly, then kissed him open. Long, slow, languorous. “That’s it, you’re so sweet Lan Wangji. Do you want my fingers? My cock?” Another lick. The brush of a finger, tugging him open, making room for the Patriarch to kiss him deeper. “Or more of my mouth?”\n \n“Patriarch,” Lan Wangji gasped out.\n \nThere was a pause. Lan Wangji’s felt nothing but his breath.\n \n“My name is Wei Ying.” Another kiss. “Courtesy name, Wei Wuxian. But you, Lan Wangji – you should call me Wei Ying.”\n \n“Wei Ying,” Lan Wangji groaned, almost sobbing with need. He felt as if he could not control his body, his voice. But ah – he loved it. He didn’t know how he would give this up. How could he wants this so much, to be touched, used, loved? “Wei Ying, please. Anything.”\n \n“Perfect,” the Yiling Patriarch – Wei Wuxian – said reverently. “You’re perfect.”\n \nHe brought Lan Wangji to orgasm with his mouth and his tongue. And in return, Lan Wangji lay between his legs upon the bed and sucked his cock, hungry and artless, as Wei Wuxian stroked his hair tenderly, possessively, and called him good. So good.\n \n-\n \nWei Wuxian. Wei Ying.\n \nPerhaps it was that – the offer of the Yiling Patriarch’s name – that made Lan Wangji feel brave enough to speak openly. To ask questions he had kept stoppered.\n \n“Anything you demanded, the sects would have provided,” Lan Wangji said, feeling the chill of the rumpled sheets around him – the weight of the Yiling Patriarch’s gaze. “Why did you ask for me?”\n \n“Do you want the honest answer?” Wei Wuxian asked.\n \n“Yes.”\n \n“Fine.” Wei Wuxian lay back flat, staring up at the ceiling. “I was thrown into the Burial Mounds as a boy. My parents had died. I was hungry. I stole from a merchant. He caught me. He thought this was a suitable punishment.” His voice was flat. “I should have died. The Burial Mounds don’t allow anyone to leave. Living or dead. But as I curled up and cried the dead… spoke to me. They said, Wei Ying. Would you like revenge? Will you make a bargain with us? I said yes, of course. And they gave me power. And I gave them a piece of my humanity in return. It wasn’t a bad price.”\n \nSilence. Lan Wangji let them horror rise in him and dissipate. He knew the Yiling Patriarch was not entirely as other people were. He should not have felt any grief, to hear it confirmed.\n \nWhat would Wei Wuxian have been, with his soul and his heart whole and unhurt?\n \n“I asked the Burial Mounds once, why they spared my life,” Wei Wuxian said finally. “They told me, because we wanted your heart. It was that simple. Want.” He turned his head. Looking at Lan Wangji. “I wanted you,” he said, as if it were that straightforward. And perhaps for a child raised by the dead, moulded by darkness, it was. “So I took you. That’s all. Is that what you wanted to hear, Lan Wangji?”\n \nWhen Lan Wangji said nothing, Wei Wuxian’s mouth curled bitterly.\n \n“I thought so,” he said.\n \nBut Lan Wangji…\n \nHe was sifting through words, like a man sifting through sand for flecks of gold. Wei Wuxian had answered him. Wei Wuxian had told him – so much. More, perhaps, than he had intended.\n \nMy heart isn’t my own, Wei Wuxian had told him, in the spaces between his words. My heart belongs to the dead. \n \n\nBut I wanted you regardless. \n\n\n \n\n\nI wanted you.\n\n\n \n\n\nI want you.\n\n\n \n\n\nI want your heart.\n\n \n“Lan Zhan,” Lan Wangji said finally, and watched the bitterness of Wei Wuxian’s mouth freeze. Soften. “My courtesy name is Lan Wangji. But I am – Lan Zhan. To you. If you so wish.”\n \n“Lan Zhan,” Wei Wuxian repeated. He blinked at Lan Wangji, oddly vulnerable. “Yes. I do – wish. Thank you.”\n \nLan Wangji nodded. Took Wei Wuxian’s hand in his own, and kissed his wrist, letting the tenderness well up in him. Wei Ying. This was his Wei Ying.  \n \n-\n \nLan Wangji continued to make friends with the residents of the Burial Mounds. He taught A-Yuan the small moral tales taught by the Lan clan to child disciples.\n \nWei Wuxian joined them. Cajoled Lan Wangji into teaching him the Lan rules. “Three thousand?” he squawked. “Lan Zhan, how can you possibly remember three thousand rules?”\n \n“It is not difficult, Wei Ying,” Lan Wangji said serenely, even as A-Yuan grinned and covered his face with his hands, aware that Lan Wangji and Wei Wuxian were teasing one another. “But you must not despair. I am aware your memory is – lacklustre.”\n \n“Lacklustre,” Wei Wuxian repeated. He gasped in mock offense, sitting down on the ground beside A-Yuan, who giggled and leaned against him. “Teach us, Lan Zhan. We’ll see who has a lacklustre memory.”\n \nWei Wuxian did not learn even a hundred rules. But he did whisper the ones he’d remembered against Lan Wangji’s skin, when Lan Wangji rode his cock that evening. Lan Wangji insisted. One roll of his hips for every correct recitation.\n \n“I can’t remember,” Wei Wuxian said in the end, voice wrecked, his face flushed, as Lan Wangji refused to move, teasing Wei Wuxian with the clench of his body. “I can’t-”\n \n“Then I will teach you, Wei Ying,” Lan Wangji said, body hot, aching. He pressed his mouth to Wei Wuxian’s ear, reciting the sect rules in a steady rhythm that matched the movement of his hips. He reached twenty before Wei Wuxian groaned, and clutched his hips, coming inside him.\n \n“Lacklustre,” Lan Wangji said, touching his mouth to Wei Wuxian’s, and swallowed Wei Wuxian’s laughter as he came around Wei Wuxian, heart bright enough for both of them.\n \n-\n \n“A month has passed,” said Wei Wuxian.\n \nLan Wangji knew. When he’d woken in the morning there had been no sign of Wei Wuxian. So Lan Wangji had dressed. Packed his bag. Waited. And Wei Wuxian had returned, face impassive, almost cold, the faint bitterness of liquor shining on his mouth.\n \n“You’re free to go, Lan Wangji,” Wei Wuxian said, when Lan Wangji was silent. “Our bargain is done.” He held out his hand. “The ribbon,” he said.\n \nLan Wangji raised his hand. The red ribbon loosened from his throat as if it had been waiting for the touch of his hand. He removed it. Held it out to Wei Wuxian, who took it. Their fingers brushed.\n \n“Wei Ying,” he said. He cupped Wei Wuxian’s hand. “Wei Ying.”\n \n“Lan Zhan.” There was something in Wei Wuxian’s voice. Something vulnerable, and dark. “What is it?”\n \n“I wish to make a bargain,” said Lan Wangji.\n \nA beat of silence.\n \n“Speak,” said Wei Wuxian.\n \nLan Wangji released him. He reached up and removed his forehead ribbon.\n \n“You may have this,” Lan Wangji said, holding the blue-white ribbon in his palm. “The Lan forehead ribbon can only be touched by family. A child. A spouse.” He saw Wei Wuxian’s eyes widen. “With it, you will gain the Second Young Master Lan as your husband. He will remain with you in the Burial Mounds. He will have – heart. And soul. Enough for you, and for himself.” Lan Wangji’s voice splintered, a little, at the end. He had too much hope in him to keep it steady.\n \n“And what,” Wei Wuxian said shakily, “must I provide in return?”\n \n“Yourself,” Lan Wangji said simply. “All that the Burial Mounds has not claimed, you give to me.” His heart was pounding. “I promise what you give me, I will protect. With all that I am.”\n \nWei Wuxian stared at him. And stared.\n \n“Will you accept my bargain?” Lan Wangji asked.\n \nWei Wuxian swallowed.\n \n“Lan Zhan,” he said. “Yes.”\n \nAnd Wei Wuxian leaned forward, kissing Lan Wangji intently and fiercely, lovingly, as Lan Wangji tied the forehead ribbon around his pale throat.\n \n-\n \nEvery six months, Lan Wangji made his way to Cloud Recesses. He carried Wei Wuxian with him, in ribbons red and black bound to his wrists and ankles and his throat, and braided through his hair. The weight of them comforted him, as he entered his brother’s own chambers, and kneeled down.\n \nLan Xichen looked troubled. He did not offer Lan Wangji his usual beaming greeting, or tea, or any food.\n \n“The sects are planning to siege the Burial Mounds,” Lan Xichen said. His expression was firm, jaw tight. “Wangji, I am afraid the Yiling Patriarch will not be able to fight their combined might. I am afraid you will no longer be safe there. I have argued with them, but they will not be moved.”\n \nLan Wangji’s alarm faded.\n \n“They will not be able to harm my husband,” he said. “They will merely harm themselves.”\n\n\n“Wangji.”\n \n“A ribbon from his hands turned the tide of the war,” Lan Wangji reminded his brother.\n \n“That ribbon.” Lan Xichen’s mouth thinned. “If he hadn’t cultivated a reputation as a thief of virgins, we wouldn’t be in this position, Wangji.”\n \n“He will not be taking any more cultivators,” Lan Wangji said placidly. “I can promise that.”\n \n“The sects won’t be so easily convinced.”\n \n“That is no matter,” he said dismissively.\n \nHe was not afraid of the sects. He belonged to the Burial Mounds now, and knew there was power older, darker and greater than anything the great cultivation sects had ever known in that place. He held to the teachings of his youth, but Wei Wuxian did not.\n \nWei Wuxian would burn them all, in the dark fire, before he saw a single denizen of the Burial Mounds harmed.\n \n“The Yiling Patriarch will not be defeated by Sect Leader Jin or Nie or Ouyang. He has more than a ribbon now,” Lan Wangji said. “More than his dark cultivation. More than the power that lays within him.”\n \nLan Wangji thought of the bruises hidden beneath the collar of his robe. Thought of his husband’s smile as they lay in bed together at dawn, trading kisses. Wei Wuxian had been splintered, but Lan Wangji had made him whole. Every day, Wei Wuxian grew more human. Every day, in turn, Lan Wangji’s power stretched, the gold of cultivation seeping into darkness, as if dusk, deep and strong, lay within him. Together, they were more than they were alone.\n \nHe allowed himself the faintest smile, as he met his brother’s eyes, blazingly sure of his husband’s strength. Of his own.\n \n“He has me.”"
}