{
    "id": "25231696",
    "url": "https://archiveofourown.org/works/25231696?view_full_work=true",
    "author": [
        "RejectsCanon"
    ],
    "title": "Gossip Lord Zuko",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M",
        "Multi"
    ],
    "fandoms": [
        "Avatar: The Last Airbender"
    ],
    "relationships": [
        "Sokka/Zuko (Avatar)",
        "Zuko & The Fire Nation (Avatar)"
    ],
    "characters": [
        "Zuko (Avatar)",
        "Sokka (Avatar)",
        "Original Characters"
    ],
    "additional_tags": [
        "the original characters are fire nation staff/citizens",
        "Matchmaker!Zuko",
        "Fluff",
        "Mentioned sexual harassment",
        "nothing is outright described and it's over quickly but still",
        "Zuko will fuck harassers up",
        "you're making someone uncomfortable?",
        "get ready to throw hands with the Firelord",
        "Zuko is a sucker for pregnant women",
        "will offer them the world or at least his bank account",
        "the Fire Nation loves Zuko",
        "and Zuko loves the Fire Nation",
        "Zuko and Sokka are soft and gay for each other",
        "Post-Canon",
        "it's canon that Zuko got rid of homophobia in the Fire Nation and I love that for him",
        "am i creating a whole tiny universe revolving around zuko and the palace staff?",
        "perhaps",
        "me writing an academic paper: 1500 words is so much work",
        "me writing fanfic: writes nearly 10000 words easily",
        "zuko plays matchmaker but those relationships are minor",
        "Fire Lord Zuko",
        "Ambassador Sokka"
    ],
    "language": "English",
    "series": "Part 2 of Post-Canon Fire Lord Zuko (and his staff)",
    "published": "2020-07-12",
    "completed": null,
    "words": "9,788",
    "chapters": "1/1",
    "comments": "337",
    "kudos": "17,721",
    "bookmarks": "2,572",
    "hits": "130,381",
    "summary": "<p>Zuko was probably more involved in the gossip around the palace than he had any right to be. </p>\n<p>It’s not his fault, it’s really not. It’s just that sometimes he’s sitting in the kitchens (the best place to get the gossip) drinking tea and trying to relax for once, and some of the kitchen staff will start gossiping where he can still hear them. He doesn’t really try to listen in; it’s not his place and he won’t judge the staff based on whatever rumors are running around, but Spirits is it interesting. He tries not to listen too much, or get too invested in it though. Gossip is gossip after all, and rumors hardly ever turn out to be true. </p>\n<p>But Zuko absolutely needs to know if Maya from the laundry room broke up with her piece of shit boyfriend. </p>\n<p>Or, 5 times Zuko got invested in/meddled in palace gossip, and 1 time he was the subject of the gossip.</p>",
    "notes": "<p>I mentioned briefly in another fic that Zuko likes to sit in the kitchen and gossip with the staff, and so this fic was born. Could also be summarized as 'Zuko embracing his theater kid side and loving Mess.' Not beta read, so any mistakes are my own. Enjoy!</p>\n<p>Edit: Hi! As I'm making this edit, this fic has just passed 10,000 kudos. That is absolutely insane to me, I can't believe how much love and support this fic has gotten. It really means the world to me, thank you all so much. I hope this continues to be a fic that people read and enjoy. Thank you all so much &lt;3</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Links for the various crises happening in the world, and remember to wear a mask and vote!:<br>Black Lives Matter petitions, donations, and other resources <a href=\"https://t.co/ScNVY4VxD2?amp=1\" rel=\"nofollow\">here</a><br>: https://t.co/ScNVY4VxD2?amp=1<br>If you can't donate, <a href=\"https://www.youtube.com/playlist?list=PLlhfJSrlPNthnoD1XFDHzmdf6Mpt2pe-2&amp;feature=share\" rel=\"nofollow\">here's</a><br>a youtube playlist where all proceeds from the videos are being donated to various BLM charities: https://www.youtube.com/playlist?list=PLlhfJSrlPNthnoD1XFDHzmdf6Mpt2pe-2&amp;feature=share<br>Yemen Crisis links <a href=\"https://yemencrisis.carrd.co/\" rel=\"nofollow\">here</a><br>: https://yemencrisis.carrd.co/<br>COVID-19 and others (U.S. Specific) <a href=\"https://www.acf.hhs.gov/otip/news/covid-19-resources-services-support\" rel=\"nofollow\">here</a><br>: https://www.acf.hhs.gov/otip/news/covid-19-resources-services-support</p>\n<p><a href=\"https://rejectscanon.tumblr.com/\" rel=\"nofollow\">Here's</a> my Tumblr if you want to peruse and enjoy</p>",
    "text": "Zuko was probably more involved in the gossip around the palace than he had any right to be. \nIt’s not his fault, it’s really not. It’s just that sometimes he’s sitting in the kitchens (the best place to get the gossip) drinking tea and trying to relax for once, and some of the kitchen staff will start gossiping where he can still hear them. He doesn’t really try to listen in; it’s not his place and he won’t judge the staff based on whatever rumors are running around, but Spirits is it interesting. And no one ever really tries to keep their voice down when the gossiping starts, so Zuko doesn’t even need to try to eavesdrop, really. He tries not to listen too much, or get too invested in it though. Gossip is gossip after all, and rumors hardly ever turn out to be true. \nBut Zuko absolutely needs to know if Maya from the laundry room broke up with her piece of shit boyfriend. \n(She did. Zuko gives her a raise after he overhears her telling one of the other staff members about it and how happy she is now.)\nSo, Zuko starts to actively listen in on the gossip, though he keeps his commentary to himself. The men and women who come into the kitchens almost every night to drink and talk and gossip welcome Zuko into the meetings with open arms and wicked sharp smiles. Zuko worries for a little while that they only let him hang around and listen because he’s the Firelord, but they dispel that line of thought quickly. \n(“You know,” Zuko says after he’s ushered down into a chair at the small table in the kitchen. “You don’t have to let me sit and listen to you guys. If you’d be more comfortable without me here, there’s no consequence in asking me to leave.”\n“Don’t be ridiculous, Lord Zuko,” Shin says. “Gossiping with the Firelord is the most fun I’ve ever had. Don’t take this away from us.)\nUncle says they ask him to listen and talk with them because they trust him not to judge or get angry about the gossip, and they want to bond with and get closer to him. Sokka and Toph tease him for becoming an ‘old lady’ who sits and gossips all day (but they still ask him to keep them updated, the hypocrites). Zuko is still skeptical, but listening to his staff gossip like school children is maybe the most fun thing to come from being Firelord, so he ignores his caution and allows himself to continue. \nHe doesn’t even think of participating in or meddling in the gossip and rumors. Zuko may not have many boundaries with the palace staff because he actually likes to, you know,  treat them like people, but he draws the line at meddling in their personal lives unless they specifically ask him for help. \nThat is, until he hears that Hana and Li who work in the gardens have been pining after each other for months and are doing nothing about it. \n(“I swear, Li just straight up dropped the watering pail he was holding when he saw Hana come into the garden. The poor boy’s got it so bad.”\n“You think that’s bad? Hana could hardly string two words together a few days ago when Li complimented her haircut. Neither of them can function in front of the other.”)\nZuko doesn’t think much of it at first beyond,  oh boy this is gonna be good. He’d venture that he knows both Hana and Li pretty well. As well as the Firelord could for two of the palace staff, anyway. But, Hana and Li are both close to Zuko’s age, and they work in the gardens, where Zuko spends a lot of his spare time in. So, they overlap a bit. Hana is a sweet girl who started working in the palace after her uncle retired from his guard post, and Li is a soft-spoken boy who likes to work in the gardens because it appeals to his artistic side. Zuko is familiar enough with both of them to see where people got the idea that the two may have feelings for each other. \nZuko firmly tells himself that he won’t meddle unless he gets actual confirmation from both of them that they like each other. \nThe Spirits must decide to call his bluff, because one week after he hears the initial gossip, Zuko gets confirmation that they like each other. \nHe’s been spending an afternoon in one of the gardens, taking the opportunity to read through some of his paperwork in the nice weather. Sometime after he’d gotten there, Hana had entered the garden to do whatever her duties had consisted of that day and she and Zuko were idly chatting as they both worked. After Hana finishes watering the plants and Zuko has read as many painful documents as he can for the time being, Zuko walks with Hana back inside. On their way in, they run into Li, who was heading out to the garden. They say hello, and Zuko gets to witness the absolute disaster energy they radiate around each other. Just looking at Li, Hana blushes a bright pink and stumbles over her hello. Li, not to be outdone, takes one look at Hana and can’t even speak for a moment before he rushes out his greeting and explains that he was just coming to check out the new seeds he planted, all the while turning a brilliant shade of red as Hana nods along with his rambling. He trips over his feet as he walks away. \n“Wow,” Zuko says after Li has walked away. “And I thought  I was bad around people I liked. But that was something else.”\n“Not another word, Lord Zuko,” Hana says. “And don’t even think of meddling, I can see it in your eyes.” \nZuko holds his hands up in surrender and steadfastly does not promise not to meddle. \nThe next day, something similar happens, though this time Zuko is with Li. Li had come to find him and take him to one of the gardens, something about wanting to show off the new flowers he planted and how they were taking to the garden. \n“They make for really nice scenery,” Li is saying. “I can’t wait until they finish blooming, it’ll be a really nice spot to paint. The lighting is great there, the sun hits it just right.”\n“I’m sure it will be,” Zuko says. “You’ll have to show me the finished project once you do end up painting it.” But Zuko barely gets the words out before Li is gasping and harshly tugging Zuko into one of the shadowed doorways. Zuko’s guards immediately go on high alert and Zuko is stuck staring at Li in shock. “What the hell?”\n“Sorry!” Li whispers. “Nothings wrong!”\n“What the hell just happened then?” Zuko demands.\nLi blushes a bright red and shuffles on his feet. Zuko has a sinking feeling he knows what just happened. “Um,” Li hedges. Zuko raises his eyebrows. “I saw Hana in the garden and panicked,” Li mumbles out. \nZuko’s eyebrows raise further. One of his guards lets out a badly muffled laugh. \n“Wow,” Zuko deadpans. “Honestly, the absolute heterosexualness of this whole thing is too much for me. Just tell her you like her.”\n“I can’t just tell her I like her! What if she doesn’t like me? Then our whole friendship is ruined!” \nZuko really can’t handle this. He just keeps staring at Li with his eyebrows raised and his arms crossed. “Don't say or do anything, Lord Zuko! I can see it in your face that you’re thinking about it.” \n Does my face really give away that much? Zuko wonders, and sets that thought aside for later. He doesn’t respond, just hums and walks away, leaving Li still hiding in the shadows and his guards trailing behind him holding back laughter. \nZuko lets it simmer for about a week to see if anything changes between Li and Hana. When nothing does, Zuko decides it’s time to take matters into his own hands. \nZuko goes to the head groundskeeper, Rai, and asks him to schedule Li and Hana to do their duties together. It’s not uncommon, the gardeners and landscapers tend to work in pairs often to make the work go by faster and to be less taxing on their bodies, especially during the hot summer months. Zuko ignores that it’s currently spring. \n“You want me to schedule Hana and Li to do their chores together? Why? They’re both good workers and are more than capable of doing it themselves?” Rai looks nervous to be questioning an order from his Firelord, but his confusion trumps his need to just obey without questioning. \n“I’m going to be real with you, Rai,” Zuko says, completely straight-faced. “I’m trying to play matchmaker and it is painful watching them dance around each other like this. Don’t take this away from me.”\nRai blinks, closing his eyes as if to rethink his entire life (he definitely is, Zuko is wholeheartedly embracing his dramatic side for this one). Rai opens his eyes and Zuko is still standing there in front of him patiently waiting. \n“You want to play matchmaker with Hana and Li?”\n“Yes,” Zuko nods firmly. \nRai seems to think things over for a moment before he says, “Yeah, okay. I see it. But don’t you think this will be a little obvious?”\n“Oh, absolutely,” Zuko says and Rai gapes at him. “The best part is they both already suspect me of trying to meddle.” \n“Then why…”\n“Because  Hana knows that  I  know she likes Li.  Li  knows that  I know he likes Hana.”\n“But they don’t know they like each other,” Rai finishes. \n“Exactly.”\n“Spirits, this sounds like a bad Ember Island play.” Zuko raises his eyebrows at him. “Of course I’m in, let’s do it.” \nThree weeks after Hana and Li’s schedules have matched every day and Zuko avoids the gardens like the plague, Zuko finally hears that they’ve started dating. He spies them in a garden together one afternoon, heads bent together and giggling, and gets a beaming thumbs up from Li. Zuko makes his way to his next meeting with a smug grin on his face. \n \n \nZuko swears that’s the one and only time he’ll meddle in palace gossip. \nHe goes back to his gossip sessions with the kitchen crew and is met with knowing smiles and chuckles. Zuko ignores them and pretends he doesn’t know what they’re talking about when they call him out on interfering. \n(“Honestly, Firelord Zuko, we didn’t know you had it in you.”\n“I don’t know what you’re talking about.”\n“Mhm, sure.”)\nSo Zuko goes about his days as normal. Which is to say, he goes to meetings, deals with stubborn, harsh generals and advisors who still like to disagree with him about everything,  and works on instilling changes around the nation to help them heal from the war. Things are getting better, but it’s slow going, and it’s painful, and it drives Zuko crazy more often than not. He gets reassured often by his friends and the advisors that are on his side, but it doesn’t stop Zuko from being frustrated about it all. \nWhen Zuko has the time, he goes down to the kitchens to sit in on more gossip nights. It’s a calming way to spend the evenings and it works to take his mind off the stress of being Firelord. \nThis particular night, he hears a piece of gossip that piques his interest. \n“Have you guys heard?” Shin asks. “One of the servants is pregnant.”\n“That’s wonderful,” Lei says, taking over pouring them cups of tea. \n“It would be,” Shin says. “If her husband didn’t leave the second he found out she was pregnant.”\nThat is met with various exclaims of outrage, hurt, and indignation on behalf of the servant. “Which poor girl is it?” Lei asks. “I’ll go set her husband straight.”\n“Let him leave,” Xian mumbles. “If he was cowardly enough to leave in the first place, he has no business coming back.”\n“Her name is Ikki. I overheard her talking to one of the guards the other day.”\nZuko knows that there is in fact a servant by the name of Ikki, who recently let all of her supervisors know that she was pregnant, and so her work would have to be lighter for the time being. Things like that were usually run by Zuko first so he could decide whether or not to hire someone to help lighten the load and then approve maternity leave. He’d known, vaguely, that she was married, but didn’t know anything about her husband. \n“Does anyone know her husband’s name?” Zuko asks innocently. \n“Firelord Zuko, you cannot send the man to prison for being a shitty excuse for a person,” Lei warns him. \n“Don’t be ridiculous,” Zuko waves a hand. “But it’d be a shame if he was caught committing some kind of tax fraud or something as soon as Ikki’s name has been removed from anything connecting them.”\nShin bursts out laughing, “His name is Oroka.”\n“Hm, of course, I won’t do anything unless I can be certain. Don’t worry, Lei,” Zuko says. \nOf course, Zuko knows that he won’t cause any trouble unless he knows for sure that Ikki and her husband have split for good, and Ikki won’t be upset if Zuko does do anything. Zuko has no interest in making the woman any more upset than she probably already is. So, once again, he bides his time and tries not to make it too obvious that he’s fishing for information. Zuko reads Ikki’s file under the pretext of learning when her pregnancy is set to end and when he should send her out on maternity leave. While reading it, he sees that her husband’s name is in fact Oroka, and he owns one of the clothing shops near the docks. Zuko makes note of the fact that when he later looks up the man’s shop, Ikki’s name is already nowhere near the paperwork. The more Zuko reads up on the man, the less he likes him. \n Three counts of drunken assault and one complaint from a former employee about bad business practices,  Zuko thinks.  Maybe I won’t have to make up a charge if he already has this many.  \nSo Zuko is planned, prepared, and ready to send this man’s life into a tailspin, but he’s still worried about stepping out of bounds and upsetting Ikki. It’s been a few months now, and her belly has rounded out to show off her pregnancy. She’s still coming to work most days of the week, but she’s been making sure to not do anything too strenuous. For the most part, her job has consisted of patching up old clothes and doing some sewing, with the occasional light chore. Zuko thinks this may be a perfect opportunity to speak with her about her upcoming maternity leave and sort of ask for her permission to make things a lot more difficult for her husband.  Ex-husband?  Zuko thinks. I don’t actually know if they’re still together. Oh well, I guess I’ll find out soon.  \nHe finds Ikki in one of the servant rooms and asks her to come to his office so they can have a quick chat. (Zuko will never stop being pleased with how the staff no longer looks so afraid when he’s around. He’s put a lot of work into making sure they know he won’t hurt them, and he’s glad it’s paid off). She follows him to his office happily and they make small talk about how she’s been on the walk there. \n(At one point, Ikki stops in the hallway, placing a hand on her stomach and smiling widely. \n“Is everything alright?” Zuko asks.\n“Oh, yes,” she says. She takes one of Zuko’s hands and presses it gently to her stomach. “The baby’s just kicking.” Zuko’s eyes widen and he gasps when he feels a little bump against his hand. \n“...Does that hurt?” Zuko asks, mystified. \n“It doesn’t hurt,” Ikki laughs softly. \nZuko is absolutely going to ruin Oroka’s career.)\nThey sit down in Zuko’s office and he makes a point to discuss the actual things they need to discuss before he brings up the damned gossip that’s taken over way too much of his attention span. They decide that Ikki will start her maternity leave in a month’s time, putting her at the seven-month mark of her pregnancy. The maternity leave extends to five months past the date of birth, and even then, Zuko insists that she only came back to work part-time and will be able to leave again if she so wishes. Zuko refuses to lower her pay even a little, (“I won’t be working, Firelord Zuko, I can’t justify taking this much money.” “Ikki, you are about to have a newborn baby and I’m trying really hard to not offer you more pay, please accept you’re normal pay rates.”) Eventually, they come to an agreement that boils down to Zuko giving Ikki her regular pay and not adding any bonuses, but not for lack of trying on his part. Ikki makes to leave, but Zuko stops her with a;\n“Actually, just another moment, please. If you don’t mind me being less than professional for a moment.” Ikki stops, sitting back down and looking intrigued. \n“Um,” Zuko says awkwardly. “I’m sure you’re probably aware of the, uh, gossip? That’s been going around lately?”\n“Oh, that my husband found out I was pregnant and just up and left?” Ikki says blatantly. \nZuko winces, “Uh, yeah, that.” Ikki is silent for a moment while she thinks something over. \n“He did leave,” she says eventually. “Our divorce was finalized last month.”\n“I’m sorry to hear that. I can’t imagine this has been easy for you. And I can’t fathom why a husband would do such a thing,” Zuko says softly. \n“Is that why you’ve been so kind in this meeting?” Ikki asks. \n“Not really,” Zuko says. “I mean, the whole trying to give you at least one bonus thing was since there’s no longer two sources of income in your home. But everything else, the not lowering your payment and all the time off and leeway with that, I’ve done the same with all the other men and women who’ve gone on maternity leave.” \n“Good,” Ikki nods. “I was a little worried about that.”\n“I do have one more thing to ask you, though,” Zuko says. “What would you say if his clothing store suddenly came under investigation for bad business practices and employee mistreatment?”\nIkki laughs so hard that Zuko worries for a moment that she’ll fall over. \nTwo weeks later his storefront is shut down while the investigation takes place. Zuko goes to gossip night with his head held high and takes the ribbing and teasing without protest. \n \n \nZuko knows that he’s setting a precedent with how he involves himself in gossip, but he really couldn’t care less. Until it comes to bite him in the ass, he’s going to keep going to gossip nights and using his newfound information to help his staff out. \n(“Keep saying shit like that and the gossiping is gonna come bite you in the ass sooner rather than later,” Sokka tells him once. \n“So you don’t wanna know if Ikki gave birth to a boy or a girl, and how they’re doing?”\n“I take it back, tell me everything.”)\nUnfortunately, Zuko is still the Firelord, which means he has things to do other than attend gossip night. He’s been swamped in work lately, and his yearly meetings that take place in the other nations to discuss peace have snuck upon him. So, he’s now discussing last-minute travel details, confirming that the meetings are still on track to be held at all, preparing for said meetings, and still managing his regular duties. Zuko doesn’t mind the trips, he likes traveling to the other nations, and it gives him an excuse to see everyone again. Plus, the meetings have been getting easier to have; no one is nearly as hostile as they were during the first meeting and everyone finally agrees that peace is the way to go. At this point, the meetings are more for formality than they are for necessity. \nZuko’s leaving for his first trip in a week, and he hasn’t made it to gossip nights in about three, and damn it he just wants to relax a little before he has to leave. He’s been spending the night going over travel plans and at this point, nothing else is going to get finalized tonight, so he sets the paperwork aside, and heads to the kitchens. \nWhen he enters the kitchen, the group is deep into the middle of some kind of card game. They look up when he enters, calling out their greetings. “Deal you in, Firelord Zuko?” Shin asks. \n“No,” Zuko shakes his head, taking a seat. “What’s the topic tonight? I need distractions.”\n“We’re talking about Ling’s shitty supervisor and how creepy he is,” Xian says while laying a card down. \n“What do you mean creepy?” Zuko asks. \n“He keeps asking her out,” Lei explains. “Even though she’s easily twenty years younger than him. And she’s told him she’s not interested every time he brings it up.”\n“Did you hear that he asked her out again earlier today? She said no, of course, so he scheduled her to work the same hours as him tomorrow so he could ask again,” Xian says in disgust.\n“Creepy,” Shin says. “He’s been doing it since she got hired. And isn’t that like, the tenth time this month?” \n“At the very least,” Xian replies. “I heard that he grabbed her arm when she tried to walk away from him the other day, too.”\n“What.” Zuko deadpans. He can tell that his face has gone frosty and works to not look quite so angry. The people around the table shift uncomfortably. \n“One of the servant girls, Ling, keeps getting asked out by her supervisor, Mao. It started out benign. Easy to ignore. But it seems like it’s very quickly moving into harassment territory,” Lei explains. \nZuko takes a deep breath and turns to one of his guards. “Go find me his record. And if he’s still here send him to my office.” \n“Yes, Firelord Zuko,” the guard says, leaving immediately. Zuko wouldn’t be surprised if the man started running. Zuko rarely ever shows his temper around the staff, saving it for meetings with cruel generals, but he’s having a hard time keeping it in right now. \n“Um, Firelord Zuko?” Lei says carefully. \n“I’m going to read his file,” Zuko says. “And if there’s even one infraction on there, I’m going to fire him. I can’t believe something like that has been happening right under my nose.\"\n“No one has reported anything since you’ve been Firelord. You couldn’t have known,” Shin tries to assure. “And Ling has said more than once that she can handle things herself.”\nZuko just hums, as his guard reenters the kitchen, holding out a file to him. “Guard Rin is escorting the man to your office, sir. She caught him on his way out.”\n“Good, thank you.”\n The group is quiet around him as he opens the file and begins reading. The more Zuko reads the angrier he gets, and he knows the disgust shows on his face despite his best efforts.  Mistreatment of subordinates, inappropriate behavior, and oh would you look at that, multiple complaints of sexual harassment towards younger staff. All of the man’s infractions and complaints have either been dismissed or investigated to be false. Then, Zuko reads one line in his employment contract that makes everything make sense. \n Of course he was hired by my father,  Zuko thinks bitterly.  No wonder nothing ever happened to him. How the hell does someone like this slip through the cracks? \nZuko snaps the folder shut, takes a deep breath, and stands. “I have to leave for my diplomatic trips in a few days. I can’t give this situation the attention it deserves, right now. I’m going to fire him right now, and as soon as I get back, I’m doing a full investigation into anyone who has complaints like this on their files or anyone who was hired around the same time. It never should’ve happened in the first place, and I’m sorry it went on for as long as it did.”\nZuko leaves the kitchen without looking back.\nZuko makes his way to his office with his guards in silence. When he gets there, Mao is standing with Rin, one of his guards. Zuko tries not to be too satisfied with the fact that Rin is giving the man one of her best glares and Mao is cowering from it. \n“Inside. Now,” Zuko commands as he opens the door. Mao shuffles inside quickly, his head down. Zuko rounds his desk, standing beside his chair, not able to handle sitting at the moment. He opens up Mao’s file to the pages detailing his various reports and complaints, and slams it down on his desk. \n“You want to explain that to me?” Zuko makes eye contact with the man and allows the fire from the torches in the room to burn brighter. \nMao carefully picks up the papers, looking them over. “These are nothing, Firelord Zuko. All of these accusations are from years ago. They’ve all been investigated and dismissed.” His voice is wavering, and Zuko lets the flames go higher. \n“Really,” Zuko deadpans. “If I read that correctly, and I’m sure I did, only one of those instances was investigated, and it ended with the employee who reported you being fired. None of the others detailed an investigation, only being dismissed as false accusations. Are you saying there’s no substance to these claims?”\n“Of course, my Lord. These things are just lies.”\n“So you’re telling me that three young women who have worked with you in the last six years have reported you for sexual harassment and misconduct for what? For fun? For attention?”\n“Obviously those women were just trying to get ahead and ruin me,” Mao says angrily. \n“Really? Explain to me what’s been going on with one of your recent hires, Ling.”\n“That girl? She’s a flirt. She’s wanted me since the day she was hired. Has she been saying differently?”\nZuko makes his way around the desk, standing in front of the man. He picks up the file, flipping through the pages until he finds his employment contract. He holds it in his hands, reading it over again. As before, his eyes are drawn to his father’s signature. \nZuko looks Mao in the eyes and says, clearly and strongly, “I don’t believe you.” \nMao sputters, backing up and trying to defend himself. Zuko cuts him off. “Do you know what this paper is?” Mao looks at it for a moment. \n“My employment contract,” Mao grinds out between his clenched jaw.\n“Signed by you,” Zuko says moving to stand right in front of Mao. “and someone who is no longer in charge.”\nMao swallows. \n“You’re fired,” Zuko says. “For sexually harassing other employees, trying to hide it, and other misconduct towards your subordinates.”\n“You, you can’t do that!” Mao tries to say.\n“Oh I can’t, can I? Last I checked, I was the Firelord, and could do whatever I want,” Zuko says. Mao fumbles, trying to recover.  \n“How about this?” Zuko says pleasantly. He holds Mao’s old contract in one hand, and with the other, makes a small ball of fire. \nHe lights the contract on fire. \nThe paper burns, turning to ash in Zuko’s hand. He lets his other hands keep the fire for a moment longer, keeping eye contact with Mao. \n“You’re fired,” Zuko repeats. “If you’re smart, you will keep your mouth shut. You will leave the palace, and you will not set another foot near here again. Any belongings that you have here will be sent to your home tomorrow. And if you don’t do exactly that, I have no qualms with setting you on fire. And don’t think I won’t be keeping an eye on you. If you ever do something like this again, you are going straight to prison. I can excuse many things, but one thing I  will not  excuse is sexual harassment and assault.”\nZuko finishes speaking and finally lets the fire in his hand dissipate. As soon as he’s done, Mao practically runs for the door. \n“Make sure he actually leaves,” Zuko says to one of his guards. He gets a nod in return and the guard leaves. Zuko sighs heavily, sinking down into his desk chair and burying his head in his hands. Zuko spends the rest of the night in his office, going through as many personnel files as he can, and setting aside the ones that look suspicious. \n(Ling comes to find him the next day, and she thanks him for getting rid of Mao. \n“I was afraid if I reported him that no one would believe me,” she says quietly. “I talked to so many others who said that nothing happened when they reported him, so I didn’t even bother.”\n“I promise you,” Zuko says earnestly. “I would never ignore a report like that. I wish I had known sooner. And I swear to you, this will never happen again.”)\nZuko thinks he’s going to have a lot to fill the others in on when he starts his trips. \n \n \nThe next piece of gossip Zuko hears that he feels the need to involve himself in, happens about three months after his diplomatic trips. Zuko spent a lot of time after he returned going through every little thing he possibly could, and making it clear that behavior like Mao’s would not be tolerated. Zuko ends up firing five more men and one woman with similar reports and the testifications to back up the claims. Some of them try to deny or come up with excuses, some of them admit to it, and Zuko fires all of them. \n(“You threatened to set him on fire?” Sokka exclaims when Zuko fills him in on the drama that’s been happening around the palace while he’s in the South Pole. “That’s kinda badass, I wish I’d been there. Maybe you should’ve. Sounds like the guy deserves it.”\n“If he ever comes anywhere near the palace again, I’m gonna lose it,” Zuko mumbles. \n“So much has been happening since I’ve been gone. I can’t wait to get back. I wanna join gossip night,” Sokka pouts.) \nThis particular piece of gossip isn’t nearly as troubling as before, thank the Spirits. Zuko doesn’t know what he would do if he found out that more things like that had been happening right in front of him. Currently, Zuko is walking down one of the halls, on his way to a meeting, when he pauses in to rearrange the paper’s in his arms. There, he accidentally overhears two guards talking in the next hallway over.  \n“Hey, Kai, your wedding anniversary is coming up soon, right? Any plans?” One of the guards says.\n“No, but not for lack of wanting,” the other one replies. “Feng’s got me working the night shift that day. I asked to switch shifts with someone but it’s a no go.”\n“Seriously? That’s fucked man, maybe you can drop a hint to Ming. I know he’s only the head guard for Firelord Zuko’s personal guards, but maybe he’s got some influence.”\n“I’ll think about it, otherwise we’ll just celebrate a different day.”\nZuko looks over to Ming, who shrugs helplessly. Zuko hums, puts his thoughts of meddling aside for now, and continues walking to his meeting. \nLater in the afternoon, Ming comes into Zuko’s office with the guard schedule for the week and casually places it on Zuko’s desk. Zuko raises his eyebrows at him and Ming just gives him an innocent smile. \n“Just food for thought,” Ming says casually. Zuko waits until Ming goes back to his position outside the office door before picking up the schedule. Zuko looks over the schedule and notices that Kai, the guard from earlier, is scheduled to work the night shift four days in a row, with the day of his anniversary in the middle. \n“Hey, Ming,” Zuko calls out. Ming enters quickly and Zuko ignores the smug grin on his face. “I thought guards weren’t meant to work the night shift more than three days in a row?”\n“We’re not supposed to, no, sir,” Ming replies. Zuko nods and picks up an ink brush and crosses out Kai’s name for the night of his anniversary. \n“Have someone take this back to the supervisor,” Zuko says. “Tell him I was going over the schedules and found some issues, and if he has a problem with it, to come to me.”\nThe supervisor does not have a problem with it. Zuko doesn’t bother to hide his smirk. \nZuko goes to gossip night the next week and listens cheerfully as they gush about Kai telling them about his anniversary. \n“It sounded so sweet, the way he described it,” Lei sighs. “Cooking her a nice dinner and then taking it to go sit on one of the beaches.”\n“It did sound really cute,” Shin admits. “Finding a secluded part of the beach to just sit and spend time together.”\n“And then repeating their vows to each other. So romantic. Why don’t we do things like that anymore?” Lei says smacking Xian on the shoulder. \n“Ow! Jeez, no need to be violent. We do plenty of romantic things,” Xian says rubbing his shoulder. \nLei looks like she’s gearing up for a fight, so Shin speaks up to distract her. “I suppose it’s lucky that his schedule got cleared so suddenly for the night. The way he was talking, it sounded like he was going to have to work the whole week.”\n“It  is  lucky, isn’t it?” Lei jumps at the change of topic to Xian’s relief. “I wonder who cleared it for him.” She gives Zuko a  look.  \n“Hm, it must’ve been some pretty good luck indeed,” Zuko smiles into his teacup. \n“Oh, come off it,” Xian laughs. “We all know you’re the king of meddling.”\n“I don’t know what you’re talking about,” Zuko maintains. “I’ve never meddled a day in my life.”\nThat particular line is met with various reactions of laughter, indignation, and downright shock. Amongst the sudden cacophony, Zuko calmly sips his tea. \n \n \nThings in the Fire Nation and around the palace have been fairly peaceful recently. There haven’t been any major catastrophic events, Zuko’s managed to weed out some more generals that are still arguing against peace, he’s passed some new laws to make recovery easier, and he’s finally managed to update the school curriculum to be satisfactory instead of chock full of propaganda. No major dramatic scandals have happened around the palace, the only gossip going around isn’t centered around corrupt supervisors, but instead is little things like; “we caught the head chef feeding the stray cats around the palace again” or, “Hana and Li got caught making out in a garden. I know we all wanted them to get together, but come on.” \nSo, things have been really good recently. Zuko recently got a letter from Sokka confirming his next stay in the Fire Nation as Ambassador of the Southern Water Tribe instead of just a visitor. This means that this time Sokka will be staying for a few months at the latest, and Zuko is excited to have him back. All goes well, Sokka will be there by the end of the next month. Of course, Zuko still has plenty of work as the Firelord, and he’s sure this feeling of comfort won’t last for long. Soon enough things will go back to being hectic. Something or other will happen, and everything will go back to full swing. \nBut for now, it’s nice to just bask in it. \nZuko finds himself basking in it one night, sitting in the kitchen, once again sitting in on gossip night. The four of them are sitting at the table, playing a card game, and talking about whatever is coming to mind. Earlier, Xian had broken out the alcohol, and although Zuko had declined, he still watched in humor as the others got pleasantly tipsy. They had at first been talking about how Ikki had recently returned to the palace and all the cute stories she had shared about her newborn son, (“I heard that her garbage of an ex tried to come crawling back because business still hasn’t picked back up for him, and she laughed and shut the door in his face.”). The conversation progresses to kids from there, (“Ming was saying the other say that one of his daughters recently got accepted into a really nice school. It will be such a wonderful opportunity for her.”). And eventually tapers off into Shin mopping about being single, with Lei trying to be sympathetic and Xian not trying to hide his laughter. \n“I’m telling you,” Shin is saying placing another card down. “It’s weird how many couples there are in this place. Like, what’s in the water in the palace that makes people like each other? And why am I still single? Am I not drinking the right water?”\n“Don’t be so dramatic,” Xian says. “This is a place of serious business and respectability, not a dating ground.”\n“Easy for you to say, you and Lei have been happily married for twenty years! And you guys met here!”\n“The man has a point dear,” Lei says. “It seems that since Firelord Zuko has taken the throne, people are much more willing to show their love for each other.” Zuko feels his face heat a bit and Shin fake gags at the look of adoration on her face as she looks at Xian. \n“Right! Lord Zuko even set some of them up himself. We’ve got Hana and Li, and then Rin and her girlfriend,” Shin begins. “And then we’ve got already established couples like you two, the couple who runs the laundry room, those two guards Ai and Hachi--”\n“Ai and Hachi are dating?” Zuko interrupts. “I didn’t know that.” Shin slaps a hand to his mouth, and Lei smacks his shoulder, hissing his name. “What is it?”\nLei sighs. “Ai and Hachi have been nervous about coming out,” she explains. “For palace guards, they don't work around you much, so they weren’t sure how you would take it. Everyone knows how Azulon and Ozai were about those things. Especially two men together.” \n“Yeah tell me about it,” Zuko mumbles. It doesn’t seem like they really hear him.\n“You’ll just have to set them straight,” Lei decides.\n“He can’t really  set them straight, though, can he?” Xian snickers. \n“You know what I mean! Lord Zuko, you’ve been so accepting of who people decide to love, repealing those awful laws and everything. If you just have a chat with them, I’m sure they’ll relax.” \n“Uh,” Zuko says. “You guys do know that the reason I repealed those laws was because I’m gay, right? Like, not straight even the tiniest bit.” \nThey stare at him in shock. \n“No,” Shin says. “No, we did not know that.” \n“Huh,” Zuko says. “I thought it was pretty obvious.”\n“But, but weren’t you dating Mai?” Lei asks. \n“Ah, yes, the very safe, heterosexual relationship approved by my father? Yeah, we did date for a little bit, and then again when I became Firelord so no one started breathing down my neck about an arranged marriage. And, of course I love her, but not like that.”\n“So, the laws…?” Xian asks. \n“Yeah, that wasn’t just for being accepting and all that. I mean, of course, I am. But I’m trying to be husband material, not just secret boyfriend material.”\n“Boyfriend!?” They all exclaim. \n“Oh yeah,” Zuko says, having fun with this now. “We’ve been dating for a while now. We were really careful to hide it all in the beginning, but we thought we’ve been more obvious lately.” \n“What the fuck,” Shin starts whispering. Lei and Xian are still staring at him in shock.\n“Anyway,” Zuko says, standing up. “I think I’m gonna head to bed now. I’ll be sure to talk to Ai and Hachi soon.” \nZuko leaves them in the kitchen still mumbling to themselves and has to muffle his own laughter. The guards walking with him don’t even try to hide it. \nZuko does, in fact, find Ai and Hachi to speak with them. They’re outer perimeter guards, and so he doesn’t see them much. They’re stationed together, which makes this a bit easier. He begins by asking them about the perimeter, and how things have been. Not that long ago, an assassin disguised as a traveling merchant had tried to get catch them off guard and make his way into the palace. \nThey’d taken him down in seconds. Zuko didn’t even know it had happened until hours later. \nSo Zuko uses this excuse to find them and strike up a conversation. Now that he’s looking for it, he can see the tension coiled beneath their skin, muscles tight and expressions closed off. Zuko makes a point to keep his voice light and conversational, and not at all like he’s about to judge them. They only relax minutely after about ten minutes of talking and it’s clear Zuko’s not here to call their capabilities as guards into question or start spouting homophobic shit. \nAfter he’s drawn the conversation out for as long as he can, Zuko looks towards the docks, where the sun is just beginning to set and casting an orange light over everything. He gets an idea. \n“Have either of you ever been to the docks around this time?” he asks, aiming for casual innocence. “It really is beautiful with the sunset and everything.”\n“I can’t say I have ever have, my Lord,” Hachi says carefully. \n“You guys should try it. It makes for a really good date spot. My boyfriend and I have before,” Zuko says, casting a look over at them. They’re both staring at him in shock. \n“Really?” Ai is the first to break. He looks hopeful.\n“Mhm,” Zuko nods. “Pack a picnic, watch the sunset. And it’s always quiet over there, lots of privacy.” \n“Interesting,” Ai says. “We just may have to try it out.”\nZuko sends them both a smile, Ai still looks a bit shocked, and Hachi is a bit nervous, but neither of them looks afraid. “I hope you do,” Zuko says. “Anyway, thank you for indulging me in conversation. Have a wonderful night.”\n“You as well, Firelord Zuko,” Ai says.\n“And thank you for the conversation, the pleasure was all ours,” Hachi finishes. \nZuko walks back inside after sending them both one more smile. He hopes he’s managed to help the two become just a bit more comfortable. \n \n \nGossip night, as it’s now been dubbed, initially began during Ozai’s time. It started, not as a need for the staff to pass time with idle gossip, but out of self-preservation. At the end of every night, a group of staff members would converge in the servant’s quarters, hidden by dark and shadows. There, they would quietly and thoroughly go over all the things that had angered Firelord Ozai during the day. They would figure out his little ticks, what set him off, who he gave second chances, and who he sent straight to prison. They would take this information and spread it to every staff member in an effort to keep everyone safe. Back then, it had been about survival.\nNow that Firelord Zuko has taken the throne, that initial need is gone. \nOh, they had still met up at the beginning of his reign. At the dead of night and sneaking to the servant’s quarters to examine every move the new Firelord had made that day. Trying to figure out where they stood with him. \nAs time went by, they realized that Firelord Zuko was nothing like his father. Nothing a staff member did seemed to anger him, even on the occasions where they tried to push his buttons, just to see what a punishment would be. \nIt became evident that Firelord Zuko would not punish them for the same things his father would. \nFirelord Zuko still dolled out the occasional punishment, but only as he saw fit rather than on a whim. This tended to happen when staff members were still actively supporting Ozai, were plotting against him, or had done something the Firelord saw as immoral. And even then, the punishment was rarely more than being fired. Everyone remembered how Firelord Zuko had reacted towards the staff members that had been harassing others, and no one wanted a repeat of the burning anger that had been rolling of the Firelord. \nAs time went by, and the staff learned that the only reason they would be punished was if they were doing something illegal, they all started to let their guard down.\nAnd so gossip night turned into gossip night. A proper, school ground gossip session, complete with whispered conversations and all. \nThey eventually moved gossip night into the kitchens. Shin already worked there, so it wasn’t totally out of nowhere. (Plus there were snacks). After some time, they noticed that Firelord Zuko spent a lot of time in the kitchens, and often late at night. At first, they were a bit wary of how he would react to them gossiping, but that wariness was quickly dispelled. \n(One night, Firelord Zuko had entered the kitchen and had been sitting at the counter for some time now. He hadn’t been down there in a few weeks at least, so they let him be and went about their conversation as if nothing was out of the ordinary. Suddenly, they noticed Firelord Zuko coming to the table. \n“Hi,” he said quietly and with a small smile. “So, I haven’t been in here in a while. I’ve been pretty busy. But I’ve been listening in for a while and none of you have mentioned it, so did Maya ever break up with her shitty boyfriend? Or not yet? It’s been bothering me for weeks.” \n“Oh, Lord Zuko,” Shin had said, motioning for Firelord Zuko to take a seat. “You just listen to how she broke up with that garbage fire of a man.”\nAfter that, they had welcomed Firelord Zuko to gossip nights with open arms.)\nFor some time after that, a hot topic of gossip nights would be who the Firelord was dating, if he was dating at all, or who he may like. Ever since he and Mai had broken up, no one had seen the Firelord show interest in anyone. Of course, they never discussed this with him, keeping their speculations to nights that Firelord Zuko never showed. \nAt first, they thought it might have been Hana, from the gardens. The two spent quite a bit of time together and seemed comfortable around each other. They were worried that Firelord Zuko may end up getting his heart broken, since the girl so clearly had a crush on her coworker Li. \nThen, Firelord Zuko decided to meddle and get Hana and Li together. They were kind of out of options after that. There was speculation of some of his advisors maybe having crushes on the Firelord. But, nothing was concrete enough to suggest that Firelord Zuko might return any of their feelings. \nThen, he dropped the bombshell on them that he was gay. \nNot only that, but that he had a boyfriend. A steady boyfriend. Of a few years. \nThe gossip group was in shambles for days as they came to terms with this, and then started trying to figure out just who the mysterious boyfriend might be. \n(“You guys didn’t know?” Li asks them when they go to him for information one day. “He’s not exactly subtle about the fact that he’s not straight.”\n“Well, how did you know?” they retort. \n“Well, considering when he was plotting to get me and Hana together, he said the whole thing was ‘too much heterosexualness’ for him, I figured he wasn’t totally straight.”\n“Why didn’t you ever tell us this before?” Shin exclaims. “We could’ve been trying to figure this out for months!”\n“Because!” Li looks scandalized. “It’s not my place to go repeating our conversations to other people. Plus, it didn’t seem like the kind of thing I should go spreading around.”\n“Li, why do you have to be so kind and innocent?” Shin laments.\n“And I guess this means you won’t tell us if he’s been going to the gardens to spend time with a boy regularly, will you?” Xian asks.\n“Nope,” Li says cheerfully.)\nSo far, they had a few solid competitors. At the very beginning, they contemplated that Firelord Zuko may have had a crush on Li, but noticed that Li was very much straight, and so he set Li up with his crush. They dismissed the thought quickly. As much as they spend a significant amount of time around each other, Firelord Zuko never once acted lovesick around him. That, plus the fact that Firelord Zuko said he’d been with his boyfriend for a while, means Li is out of the running. \nNext on their list of possibilities was one of the Earth Kingdom Ambassadors. According to their inside source (one of the advisors who accompanied Firelord Zuko on his recent diplomatic trips), the two men spend an awful lot of time just looking at each other. \n“It could be him,” Shin says. “It would make sense to try and hide it, too. A relationship with a foreign dignitary? It’d be a political nightmare.”\n“Hm, but some of the guards say that they’re always at each other’s throats during meetings. That doesn’t seem very coupley,” Xian argues. \n“Maybe it’s a ruse,” Lei suggests. “To keep people off the idea that they may be together.” \nNone of them are entirely convinced, so it goes on the backburner for now. \nTheir next option is one of Firelord Zuko’s advisors, Fensui, who so obviously has a crush on the Firelord. The young man looks at Firelord Zuko like he hung the moon, the stars, and the sky, and always agrees with him during meetings. They chat occasionally outside of the meeting room, but no one is really sure what they discuss. And, they’re never seen together otherwise. \n“Maybe they’re really good at hiding it?” Lei hedges. “Fensui does spend a lot of time in the palace, he would know how to sneak around it.”\n“But why would they need to hide it?” Xian asks. “No one would oppose to Firelord Zuko having a relationship with a respected and knowledgeable Fire Nation advisor.”\n“Plus,” Shin says. “Firelord Zuko never looks anything other than professional around him. At least we had some solid proof with Li being able to make Firelord Zuko laugh, but with this guy, we’ve got nothing.”\nBack to square one then. \nThey try to wheedle information out of Firelord Zuko’s guards, but none of them break. They know that his guards know because each time one of them passes one of Firelord Zuko’s guards in a hallway, they get a teasing smirk. It’s not like they’re hiding the fact that they’re trying to figure it out, which makes it even more frustrating. \n“Come on,” Shin whines to Ming. “Just a little hint? Please?”\n“Nope, you’re all clever people. Figure it out yourselves.”\n“Rin, please, just one bit of information,” Lei almost begs one night. “We’re at an impasse.”\n“Tch, come on, what fun would it be if I just told you?”\n“Ai, Hachi, I know you’re not his personal guards but you have to know something,” Xian tries. “Seen someone coming and going from the palace regularly? Spotted Firelord Zuko with someone where it seemed like no one would see? Come on.”\n“Wouldn’t you like to know,” Ai smirks at him.\n“Tough luck, figure it out yourself,” Hachi says. \nThis may be harder than they thought. \n \n***\n \nZuko and Sokka lay next to each other on Zuko’s bed, still basking in each other's presence after so long away from each other. Today was the first day of Sokka being back in the Fire Nation for his three-month stay as Ambassador of the Southern Water Tribe. He and Sokka had had a rare lazy day, stayed locked inside Zuko's room where no one would bother them, ignored their other responsibilities, and spent the day catching up with each other, so wrapped up in one another they hardly moved an inch throughout the day. They were at a lull in conversation, content, for now, to just lay in silence and enjoy the cuddling.\n“So are the gossip crew still trying to figure out who it is that you’re dating after you so elegantly came out to them?” Sokka asks suddenly. \nZuko snorts, rolling over on top of him. “Yeah, last week they kept trying to weasel out of me if it was Advisor Fensui or not. Apparently he has a crush on me?” Zuko knows he sounds skeptical, and sees Sokka’s eyes begin to narrow. Zuko knows it’s not because Sokka’s jealous, but because he’s offended on Zuko’s behalf that he could ever think someone didn’t have a crush on him. Zuko’s not really in the mood for another one of Sokka’s ‘you’re perfect and everyone should love you’ speeches (they still make Zuko slightly uncomfortable, even though he loves Sokka and knows that Sokka loves him). So, Zuko decides that the best course of action is to distract him with a kiss. \nZuko leans up and presses a kiss to his lips. Sokka sighs into it, hands gripping at Zuko’s lower back and waist. When they pull back, gasping into each other’s mouths to catch their breath, Zuko is pleased to see that Sokka no longer looks on the verge of a dramatic (well-intentioned) speech. Zuko lets out a pleased hum, moving back down to cuddle into Sokka’s chest. \n“But seriously, how many is that now? There was the girl from the gardens before they realized you were gay, then the boy from the gardens, the Earth Kingdom Ambassador, and now the advisor? You sure you’re not just making your way through the staff while I’m gone?” Sokka jokes. \n“Stop that,” Zuko says, slapping at his chest softly. \n“I’m teasing, baby, you know that. I know you would never, and you know I would never.”\nZuko harrumphs, looking up at Sokka and pouting his lips. He’s not upset, but he’ll be damned if he doesn’t use this opportunity to get another kiss. True to form, Sokka coos at him (Zuko nearly pushes him away for that) and cradles Zuko’s face in his hands, peppering him with soft kisses. Zuko supposes he can be forgiven. \n“I may have an idea,” Sokka says, still pressing kisses to Zuko’s face.\n“What’s that?”\nSokka pulls back, looking Zuko in the eyes. He looks so suddenly serious that Zuko sits up on his elbows, focusing all his attention on Sokka. \n“I know we agreed to wait until things got more settled,” Sokka says quietly. “But our families know, and our friends know. About us, I mean. And we know your guards know, too. And I was thinking. Yeah, things are still hectic sometimes, but things are so much better than they were two years ago. Hell, things are better than they were two months ago. We’ve already stopped being so strict about what we do in public. And I just…” Sokka trails off.\n“Want to stop hiding it,” Zuko finishes softly. To be honest, he’s been thinking about it, too. The war is over for good, their nations no longer hate each other, and everyday steps are being taken to make sure nothing like that ever happens again. \n“I’ve been thinking about it, too. Things feel solid, now. It doesn’t feel like we’re constantly on the brink of disaster, having to watch our every step. And you’re right, we keep making progress, and it’s  good  progress.”\n“So what do you think?” Sokka asks softly. “About just… not hiding it anymore? I’m not saying we have to make an announcement or anything. I love you, and I’d love to just be able to hold your hand when we walk down the halls and not worry about anyone seeing us, and pissing someone off.”\nZuko leans in again, giving Sokka a soft kiss. “I’d like that. I love you, too. Though I wouldn’t mind making an official announcement.”\nSokka laughs and hugs him tight. They lay there for a while longer, just breathing in each other’s presence, occasionally pressing soft kisses to any skin they can reach. \nThat is, until Sokka sits up, pulling Zuko with him and wearing a shit-eating grin on his face. “You know,” he says casually. “I’m kind of hungry. Wanna go cause some chaos?”\n \n***\n \nThe kitchen is empty, save for Lei, Xian, and Shin, who have stayed behind to have their gossip session. Firelord Zuko didn’t join them tonight, so the crew took the opportunity to continue trying to figure out just who their Firelord is dating. They’re about to call it a night, when the door opens suddenly to reveal Firelord Zuko and the Ambassador of the Southern Water Tribe, Sokka. \nThe pair walks into the kitchen, so close they’re bumping into each other’s shoulders, and are laughing softly, heads bent together. Almost at once, all of their jaws drop as the realization hits them. The pair heads straight to one of the cabinets, pulling out a box of snacks. \n“Hey, guys,” Zuko says. “Sorry I missed gossip night, I was catching up with my boyfriend.”\n“I’m the boyfriend,” Sokka says. “Hey, can I join gossip night while I’m here? I get the rundown from Zuko anyway and it sounds like fun.” \nThey just nod, still in shock, and Zuko and Sokka leave with their boxes of snacks, hand in hand. \n“What the fuck,” Shin whispers. “So Firelord Zuko is dating the Ambassador of the Southern Water Tribe?”\n“How the hell did we not figure that out for ourselves?” Xian asks to no one in particular.\n“We’re shams, that’s how,” Lei says, burying her head in her hands. “It was right in front of us and we didn’t notice.” \nBy the next night, everyone in the palace who hadn’t already figured it out knows that the two are dating.\n \n "
}