{
    "id": "25402561",
    "url": "https://archiveofourown.org/works/25402561?view_full_work=true",
    "author": [
        "kindaopps"
    ],
    "title": "burn, pine, perish",
    "rating": "Not Rated",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Bakugou Katsuki/Midoriya Izuku"
    ],
    "characters": [
        "Kirishima Eijirou",
        "Kaminari Denki",
        "Bakugou Mitsuki",
        "Bakugou Masaru"
    ],
    "additional_tags": [
        "Alternate Universe - Royalty",
        "Alternate Universe - Dragons",
        "Unrequited Love",
        "but is it?",
        "Hanahaki Disease",
        "Angst",
        "Arranged Marriage"
    ],
    "language": "English",
    "series": "Part 4 of metamorphosis",
    "published": "2020-07-20",
    "completed": null,
    "words": "18,660",
    "chapters": "1/1",
    "comments": "241",
    "kudos": "6,828",
    "bookmarks": "1,759",
    "hits": "66,539",
    "summary": "<p>Three things dawned on Izuku, as he stared at the slick flower petals scattered over the black words of his book: he has fallen in love with his husband, his husband did not love him back, and he is going to die.</p>",
    "notes": "<p>title from lucentio in shakespeare's <i> the taming of the shrew </i>: \"I burn, I pine, I perish.\"</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>haven't been pleased with this but ;;;; one day i might find it in me to rewrite the whole thing hahaah</p>\n<p>hope everyone has been staying safe! thank you for reading ೭੧(❛▿❛✿)੭೨</p>\n<p>references:<br>titles from somewhere i’ve never travelled before,gladly beyond, e.e cummings<br>act 1.1, act 3.1 twelfth night, shakespeare<br>sonnet 116, shakespeare<br>scarborough fair (i favour the <a href=\"https://m.youtube.com/watch?v=LfLINJEMk-Q\" rel=\"nofollow\">tamaru yamada</a> version from worldend!)<br><a href=\"http://www.eastoftheweb.com/short-stories/UBooks/NigRos.shtml\" rel=\"nofollow\">the nightingale and the rose</a>, oscar wilde<br></p>",
    "text": "\ni.\n\n\n“somewhere i have never travelled,gladly beyond\n\n\nany experience,your eyes have their silence:\n\n\nin your most frail gesture are things which enclose me,\n\n\nor which i cannot touch because they are too near”\n\n \nIzuku sat still, unmoving as he was dressed in the finest silk and ornamented with exquisite and priceless gems and gold, over his neck and over his wrists, weighing like shackles, heavy, weighty and restraining. He had bell anklets as well, lightly and cheerily ringing with every step he took, but it sounded more like ominous death bells to him. \nRemember, do not fall in love, his mother had reminded him, in a soft, pained whisper as she kissed his forehead while he was permitted a short audience with her. Never love. There will never be love for royalty.\nIt was the only thing Izuku clung onto, as he watched her cold, placid face, standing dignified beside his father as his carriage left. It was an extravagant procession, 5 carriages behind him carrying his dowry.\nHe was to be wedded to a stranger he had never met, a stranger king rumoured to be cruel and violent, wedded for lands and gold and status, wedded for the prosperity and strength of his kingdom, wedded for a strong political alliance and dynastic power. \nNot for love. Never for love. He already knew that. It was drilled in him from a young age. He watched his cold, regal parents growing up, no more a couple than in name. He knew that the same kind of fate awaited him, the product of a loveless marriage and a member of royalty.\nFor Izuku, there was nothing to cry or to laugh about; old wine in new bottles. He merely changed a cage. And a caged bird never flies.\nThe King of Dragons was a tall, big man with piercing scarlet eyes and an arrogant face. Izuku caught only a glimpse, and then kept his eyes trained downwards, fixed on the flawless, marble floor. All he could see was the edge of a red, red cloak and leather boots.\n“Let it be done.”\nAnd he was wedded, alone in a strange land, in a strange, unfamiliar world. \n🥀🥀🥀🥀🥀\nHe was escorted to a room when the ceremony was over, asked to wait patiently with a veil over his face. \nHe waited in agonising anxiety. To calm himself down, he went and looked out of the sole window of the room. A sprawling garden met his eyes, dark under the moonlight. It was unfamiliar, different from the view from his old window. He thought it looked lonely, but he yearned to run out there, even in the dark.\nThere was the sound of the door opening. Anxiety seized his body again. The footsteps seemed thunderous.\nWithout preamble, he was taken by the wrist and shoved onto the bed, his veil askew from the force of the moment. \nThe King of Dragons — his husband now — had his hands wrapped around Izuku’s wrists like shackles. Izuku’s breath hitched, staring back at the sharply handsome face.\n“You are untouched.”\n“Yes, sir,” Izuku whispered, and he calmed his breath, trying to stop himself from shaking with fear as he clenched his hands into fists.\n“Truly?”\n“Truly.” \nHis veil was ripped away, fluttering to the floor, and the darkened red eyes paralysed him, like a snake hypnotising its prey. Izuku’s mouth was dry, as was his throat, and he swallowed hard. His heart thudded madly in his ears. \n“Look at you shaking like a leaf,” he snorted, strangely candid, vulgar. He let go of Izuku’s wrists and leaned back. “Are you scared of me?”\n“No,” Izuku said, and he took a deep breath. “I am — told, what to do.” He raised a shaky hand to undo the buttons in front of him. Bakugou Katsuki stayed still and let him fumble around before pinning his wrists down onto the bed again. \nMoonlight seeped into the room and washed Izuku’s skin moon-white.\n“You are exceedingly pale,” his husband said, tracing a finger down Izuku’s arm.\nIzuku blinked back at him. “I… am — I do not go outdoors. Much.”\n“Huh.” \nIzuku flinched backwards when he felt hands undoing his robes.\nThere was a finger pressed against his skin, just under his collarbone. “A tattoo?” \nIzuku looked down at where the finger was, circling his birthmark, a distinct shape of a flower, deep red,  more like a brand.\n“Birthmark.”\n“Huh.”\nIzuku looked back for a moment, at his newly wedded royal husband. He wondered if it was considered a lie — should he have said curse-mark, instead? — before closing his eyes.\nHis husband’s hands were scalding. Izuku fisted a hand on the silk sheets, terrified and trying not to bolt. He squeezed his eyes shut harder, evening out his breaths and relaxing his body.\n“It’ll be over soon,” Bakugou Katsuki said, his breath washing over Izuku’s ear. He jolted, but forced himself to stay still.\nAfter that, time passed in a flurry of panic, pain, and pleasure. Not only his hands, but his husband’s eyes burnt him.\nHe remembered little when he woke up, naked and throbbing all over. He was alone, the white curtains fluttering a little in the wind.\nThis is a new place, an unfamiliar place. He stayed in the warm, mussed bed, watching the light stream in from the open windows, unhindered by bars.\nA clatter of the doors opening has him startled. He pulls the covers over his bare body, watching wide-eyed at the attendant — bobbed-haired, wide eyes, friendly smile — that entered.\nShe curtsied. “Your Majesty. We are here to have you dressed.” Behind her, three other attendants stood, holding trays of clothing and accessories.\nIzuku clutched the sheets closer to himself. He tried not to flinch away from their gazes. “I can — I can do it myself.”\nShe bowed. “Would you like to have a bath first?”\n“Yes, please.”\n🥀🥀🥀🥀🥀\nThree days passed and he has seen no one except for his attendants. They insist on dressing him, on preparing his food, pulling out his chair, waiting on him hand and foot. He is unfamiliar and uncomfortable with such treatment, but he allows it. When in Rome, do as the Romans do.\nIzuku stood at open windows and looked out of it, wide-eyed and longing. He pressed his fingers against the ledge. The outdoors was so close and so far. The sun streamed through the low clouds, and there were birds chirping in the warm air.\nThe door opened. Izuku turned a little, and dropped into a curtsy.\n“Your Majesty,” he greeted. He smoothed his hands self-consciously down his robes. Remembering what transpired on their wedding night, he felt his face grow hot, heat staining his ears. He took an involuntary step back. He felt a bead of sweat roll down his neck.\n“Why have you been staying in your room?”\nIzuku blinked. He glanced at the windows, and back at Katsuki. “Am I… allowed to… go out?”\nFrowning, Katsuki said, “you’re my consort, why would you not be allowed?”\nIzuku’s eyes widened. A flush spread over his cheeks. His eyes brightened. In his sudden excitement, he’d forgotten about the visceral reaction of his body to his new husband. “Now? May I go out now?”\n“Of course.”\nIzuku’s mouth stretched into a wide smile that crinkled his eyes. “Oh!” He took impulsive steps to the door, remembered, and dropped into another curtsy. “Did you need something from me, Your Majesty?”\nKatsuki shook his head.\n“Please excuse me, Your Majesty. I’ll take my leave first.” Izuku threw the doors open, not bothering to change, and goes pattering down the corridors, his attendants chasing, calling after him.\nHe left Katsuki in the room, thoughtful.\n🥀🥀🥀🥀🥀\nHe’d thought it was merely another cage. Newer, certainly, but he didn’t think that he was allowed liberties he was denied back at home.\nNo one stopped him from venturing out and about the castle. No one stopped him from speaking with his maids, or anyone. No one stopped him from running around in the castle grounds, splashing in the pond, laying in the sun, appreciating the flowers that grew around the garden, making free use of his gift to make flowers bloom.\nFor the first time in all his life, Izuku felt free.\nHe tapped a closed bud with a light finger and watched it bloom, unfurling its petals towards the sun. He laughed to himself, running a finger over its purple petals. “Ochako, Ochako,” he beckoned the girl over, wriggling his bare toes in the soil. He beamed at her in delight, “call some people over. We can play a game? Um, isn’t it called… um, the one with the Kagome song? Ah, perhaps we can have a… picnic, after, as well?”\n“Yes, Izuku-sama,” she beamed at him, pattering off to gather participants and arrange for lunch. Izuku smiled, leaning back against the trunk of the tree. The sunlight was crisp and bright, and he lifted his hand in its path, soaking in the warmth.\n“This is nice,” he mumbled, feeling the fresh wind through his hair. The earthy smell of bark, soil and grass filled his nostrils, and he felt utterly contented.\n“What’s nice?”\nIzuku startled, shooting up onto his feet. Bakugou Katsuki stood in front of him, looking faintly amused.\nHe fussed with his grass-stained robes, feeling a flush rise up his cheeks. He shivered a little, a spark of embarrassed want igniting — a Pavlov response to his husband now — but curtsied, clumsy, and kept his eyes downcast.\n“Your Majesty,” he said. “Um, I was just, um, saying… that, it’s nice. Um, the day. Outdoors.”\n“I see.”\nThey stand in awkward silence, as Izuku floundered for words to say.\n“Ah — we’re going to play a game,” Izuku said, flustered, waving his hands in front of him, “it’s, um. Would you like to join us, Your Majesty?”\nHis husband only lifted an eyebrow, his mouth curling in an amused way.\n“Why are you playing that?”\n“I haven’t played it before,” Izuku said, smiling back tentatively, relieved that he’d got a reply. “It always seemed so fun, when I saw from my window.”\n“When you say you don’t go out much, you mean you don’t go out at all?”\nIzuku blinked. His circumstances at home are kept under wraps, for a peculiar reason. He sucked in a sharp breath, about to make up an excuse, when Ochako came running with other girls behind here.\nThey dropped into low curtsies when they saw the King with his consort. Katsuki merely waved a dismissive hand.\n“I’ll leave you to it, Izuku.”\n“Thank you, Your Majesty.”\n“Enough with that stuffy label.”\n“Then what should I call you?”\n“By my name.”\n“Oh… but…”\n“I don’t care for these ridiculous customs.” Katsuki wrinkled his nose, displeased.\nIzuku tucked his hair behind his ear. His mouth turned up shyly. A petal-pink flush crept over his cheeks and made his sun-begotten freckles more obvious. “Yes,” he hesitated for a moment, for these goes against what was drilled into him by his tutors, but since he was here to please this man, he said, “Katsuki-sama.”\n🥀🥀🥀🥀🥀\n“Katsuki-sama,” Izuku muttered softly, as he bowed. He came closer with the cup of chamomile tea he brewed himself and left it on the table where Katsuki was poring over some documents. “Please remember to rest.” \nKatsuki grabbed his hand as he retracted it. Izuku’s breath hitched. He snatched it away like he was being burnt, a quick movement that shocked both himself and Katsuki.\nAfter their first night together, and subsequently, when Katsuki touched him, his body reacted treacherously: he felt his body heat up, and his stomach clenched. He was probably sweating in an unsightly manner.\nIzuku had never felt this way before. His body was no longer his own. \nHis husband gave him a side-eye, contemplative. “I was going to ask what perfume you use.” \nIzuku coughed and stepped back. “Perfume?”\n“Yes,” Katsuki said, raising an eyebrow. “You have a very distinct smell.”\n“I do not use perfume, Your Majesty,” Izuku mumbled, and superstitiously sniffed himself. “I apologise if it offends you. Perhaps—”\n“It doesn't.” Katsuki waved a hand at him and refocused on his papers. Izuku understood the implicit dismissal. He bowed again and left, his heart pounding and pounding. \n🥀🥀🥀🥀🥀\nIzuku jolted around when the door closed with a thud behind him. \nKatsuki stepped towards him, his robes billowing imperiously around his ankles.\nIzuku bowed. “Katsuki-sama.” \n“Do I scare you?” Katsuki asked, when he is standing close to Izuku, looking down at him. \nIzuku took a step back, heat rushing through his body and making him a little giddy. So close, he could smell Katsuki’s scent, something masculine and musky. It went all the way to his groin, and made him panic. He's most definitely sick. That was what this is. \n“N-no, Katsuki-sama,” he stuttered. Katsuki took a step closer, and he took a step back until his back hit the wall. He looked up into dark red eyes, shadowy in the dim light of the room. \nKatsuki rubbed a piece of hair between his fingers, bearing down on him. He looked considering, his mouth slightly pursed. Their bodies were nearly pressed together, only leaving a minuscule gap. Izuku swallowed the saliva that pooled in his mouth. \nIzuku’s breath hitched tellingly as he felt Katsuki’s thick fingers stroke his cheek. He squeezed his eyes shut, and a beat of sweat rolled down his face. He tried not to squirm, and tried to remember to breathe. \n“Then why do you react this way?” Katsuki’s breath fanned out across Izuku’s ear. Izuku let out a soft gasp that he couldn't control. Katsuki’s fingers trailed over his neck, over a sensitive spot. Izuku couldn't help the high-pitched whine that escaped him. \nIt was so, so embarrassing. Izuku could feel his flush deepening. He tried to angle himself away, tilting his head down. \n“Izuku,” Katsuki demanded in a low, gravelly voice that did things to Izuku, letting out another gasp. His mouth was slowly turning up in a smirk. “Tell me.”\n“Katsuki-sama,” Izuku stuttered, and he could see the little puffs of air from his speech, and more sweat trickled down his face and back. “Please don't—” \n“Don't?”\n“When you touch me my body does strange things,” Izuku said in a rush, screwing his eyes shut, “I think I might be sick — Katsuki-sama shouldn't come so close to me, so I won't be sick.”\nKatsuki paused. Izuku cracked open an eye. At least the touching had stopped, even though Katsuki’s hand was resting on the side of his neck, surely feeling Izuku’s rabbit-quick pulse.\nHe started laughing, deep, loud laughter that rumbled like thunder.\nIzuku felt like he was being made fun of. But he stared at Katsuki’s laughing, amused face, a rare expression on his usually stern face, and felt his heart sing.\nKatsuki finally stopped chortling. Izuku found himself pouting, just a little.\n“Is something funny, Katsuki-sama?”\n“Yes, quite,” he was informed. Katsuki grabbed his hand and led him to the bed. “You are funny.”\n“I do not understand what you mean, Katsuki-sama.”\n“You're not sick,” Katsuki told him, as he pulled from giving Izuku a deep, filthy, fevered kiss, which fogged Izuku’s brain and left him in a daze. Izuku looked back at him with half-lidded eyes, mouth red and wet.\n“Then what is it?” Izuku whispered. Katsuki pulled away his robes with a familiar, hot hand. zuku arched up with a quiet gasp when Katsuki pressed his mouth against his throat and sucked.\n“Why don’t you figure it out yourself?” muttered Katsuki, grinning sharply and leading him to the bed.\n🥀🥀🥀🥀🥀\nHe was dressed up like a doll and made to attend a dance. In the ornate ballroom, its finery gilded in gold and pearl, the mass of people crowded around him took up all the air in the room. Izuku was slowly being suffocated by the heavy robe and accessories he has on, and the amount of people around him, touching him, talking to him, demanding his attention. \nHe backed away from the crowd, his vision tunnelling, his pulse racing. He let himself out of the ballroom and streaked down the darkened hallways, his anklets ringing with each step as he took.\nHe threw himself into his room, with the floor to ceiling window panes let in gentle, milky moonlight.\nHe rested his hand against his chest and coaxed himself into breathing normally, closing his eyes. The noise faded away. Izuku found himself on his knees, gazing up at the moonlight that soothed his frayed nerves.\nEver since he was young, looking at the white-sand moon brought him breath and ease.\nHis pulse spiked again as his door clicked opened.\nHe whirled around, met Katsuki’s eyes, and quickly got to his feet. He took a deep even breath.\n“It is improper to leave without excusing yourself, Consort.”\n“I’m sorry,” Izuku said, standing in front of the windows. The pale and cold colours of the moon washed over him, calming. He looked away and clenched the bottom of his shirt. “I am — unfamiliar — with these events. I was raised in isolation, you see, uh, and there were a lot of people, and I just—”\nHe cut himself off, realizing that he was rambling. \nHe couldn't make out Katsuki’s eyes in the dark. He took a deep breath. “I’m sorry,” he said again, “I will return.” \nKatsuki proffered his arm without a word. Izuku took it with a clammy hand, a tentative, little touch in the crook of Katsuki’s elbow.\n“Don't go too far,” Katsuki said, sotto voce, as they made their way back to the ballroom. His warm hand rested over Izuku’s. “Just stay beside me.”\nIzuku swallowed, his heart jolting in his chest. \n🥀🥀🥀🥀🥀\n“Izuku-sama, His Majesty says you’re to wear this set of clothes today.” \nIzuku frowned. But he took it from Ochako and dressed himself in what seemed like riding clothes, exactly tailored to his size, with a floral pattern on the left side of his chest.\nKatsuki came into his room with a clatter. “Come,” he said, offering his hand to Izuku, who took it. Katsuki dragged him through the castle and outside, to where the dragons are kept. \nIzuku hesitated in front of a dragon. The red dragon, which was easily as large as a small cottage swivelled a large red eye at him, and snorted at Katsuki, who rolled his eyes and patted its snout. \n“Shut up, Kiri,” Katsuki told the dragon, who made a purring sound like a laugh. Izuku ventured in closer, tentative. Katsuki grabbed his hand and pressed it against the scaly nose. \n“He’s not going to hurt you.” \n“Uh.” Izuku stroked his hand over the dragon’s skin, marvelling at the fascinating texture, and yelped a little when a gust of warm breath ruffled his hair. The dragon’s large eye blinked at him. “Kiri, was it? It’s nice to meet you. I’m Izuku, Katsuki’s-sama consort.”\n“Come on.”\n“Are we… riding?”\n“Yes.”\n“But I don’t know how to ride.” Izuku yelped as Katsuki hoisted him up, leaving Izuku wide-eyed and clinging onto the scaly ridges on the dragon’s back. \nKatsuki swung himself up behind Izuku and slid his arms around Izuku’s waist to hold onto the reigns. \n“You don’t have to, because I’m riding with you,” Katsuki said, and patted the dragon’s side. \nIzuku cried out as they took upwards with a powerful flap of wings, the wind rushing past him forcefully. He hunched, squeezing his eyes shut.\nKatsuki laughed, the sound loud and amused. When Izuku peeked at him, he saw Katsuki’s sharp, fierce grin of confidence and anticipation as he urged the dragon faster.\nIzuku’s hands clung onto what little purchase he could find on the dragon’s back, desperate not to fall. He couldn’t bear to look over the dragon’s body to see how far away they were from solid ground, so he kept his head down and closed his eyes.\n“Coward,” Katsuki sang at him, amusement thick in his tone, against his ear, and Izuku flinched backwards from the proximity and the feeling of his breath rushing against his ear. Katsuki laughed again. His front was solid and steady, and his arms were braced around Izuku’s waist, to keep him from falling.\n“I won’t let you fall,” he said. \nBa-thump. \nIzuku’s heart raced. The ride gave him vertigo. He was dazed by the sun and the wind rushing through his hair, and his husband, too close and dazzling.\n🥀🥀🥀🥀🥀\nIzuku looked up from his reading when he heard Katsuki’s raised voice, the thunderous footsteps, and a slammed door echoing down the corridor.\n“What happened?” Izuku asked Ochako, who went out to ascertain the situation.\n“An enemy state has captured two of our dragons, Izuku-sama. The King is very displeased.” She startled as Izuku stood. “It'll be wise not to… provoke him further.”\nIzuku hesitated. But he ventured into the room in which Katsuki held a dagger, angrily stabbing at the map spread in front of him. There were broken pieces of glass on the floor, and a few other maps that were ripped apart.\nKatsuki gave him a flat glare as he entered and ignored him.\n“Katsuki-sama,” Izuku greeted, gentling his voice. “Would you like some tea?” \n“Tea?” Katsuki said, the single-syllabi charged with bristling belligerence. He turned to glower at Izuku, levelling the dagger at him. “You want me to drink tea when my dragons have been stolen?!” \n“You need to calm down instead of stabbing the maps, Katsuki-sama. There is no use throwing a tantrum.” \n“Throwing a tantrum?” Katsuki growled, the air tensing with danger, “who do you think you are?”\n“You are strong, Your Majesty,” Izuku said, coming to a stop beside him. “You need not worry: you will be victorious and reclaim your dragons.” \nKatsuki stood. The chair scraped against the floor. He pressed the dagger against Izuku’s throat, his eyes darker than red today, churning like raging fire. Izuku didn’t even flinch, standing firm and unafraid.\nThe blade held to his throat was cold, warming to his body heat. Izuku didn’t move his calm stare from Katsuki’s face. Though Katsuki could slit his throat right now, no such fear gripped Izuku.\n“There is no question of that,” Katsuki said, short and curt, and pushed him to the bed, hiked Izuku’s robes around his waist and kissed him roughly, and fucked him without much fanfare or preparation. \nIzuku rested his hands lightly on Katsuki’s waist, eyes squeezed shut, and let him expend his anger and restlessness on his body. It was rough and it hurt but Izuku distracted himself with how the light was shining on Katsuki’s hair, the places where it glinted white. It was, after all, a duty of a consort to support his liege. Izuku’s thoughts drifted away, to something trivial or another, running his fingers absently against Katsuki’s silk-covered shoulder.\nKatsuki caught his breath against Izuku’s shoulder and rolled off him, adjusting his barely ruffled attire. \nIzuku sat up as well, wincing a little at the ache that ran down his lower-body. Katsuki shot him a look and a sharp dismissive hand. \n“No need,” he said, and left without a backwards glance. Izuku flopped back down onto the bed, curling into himself, and smelling the scent of their coupling in the sheets. Something tightened in his chest, and he stood from the bed, despite the ache. He yanked at the sheets, throwing them onto the ground before climbing up into the unsheeted bed.\n“Izuku-sama?” Ochako entered. Her eyes went to the sheets on the floor. “His Majesty said you needed a bath.”\n“Yes,” Izuku’s voice travelled from under the blanket, “I do.”\n🥀🥀🥀🥀🥀\nIzuku was asleep when something woke him up.\nHe peeled his eyes open, squinting in the dark.\nThe king is seated by his side, carefully rubbing ointment on his neck and his body wherever there were bruises and teeth marks.\n“What is it, Katsuki-sama?” whispered Izuku. He pushed himself up, but Katsuki pressed him back onto the bed. In the dim, his eyes were liquid shadows.\n“Go back to sleep.”\nIzuku hummed, snuggling closer into the pillow. He felt Katsuki’s fingers, hot, rubbing circles onto his skin. Warmth spread from the point of contact and coursed through his body. Even through his vague, half-asleep state, he felt a smile curl his lips.\n“Are you apologising?” He whispered, his mouth turning up, silting his eyes open to watch his king, awash in moonlight.\n“Shut up and go to sleep.”\n“Come have a picnic with me tomorrow,” Izuku slurred, barely awake as he is lulled by Katsuki’s soothing hands.\nHe doesn’t know if he is dreaming when he hears Katsuki say yes.\n🥀🥀🥀🥀🥀\nThe next day, with Ochako in tow, carrying a basket of food, Izuku found himself a nice spot in the garden, plopping himself down. He tilted his head and hummed a tune to himself. The air was fragrant and fresh.\n“As always, you look like you’re enjoying yourself.”\nIzuku stood, smiling from ear to ear. Katsuki’s blond hair glinted in the sunlight like spun gold, his eyes striking crimson. He is, Izuku thought privately to himself, very handsome, and very fit.\nHe curtsied, “Katsuki-sama. Have you come to join me for my picnic?”\n“You invited me.” Katsuki sat himself down on the picnic sheet, resting a hand on a raised knee.\n“Yes, I did,” Izuku sat himself beside Katsuki, beaming. He offered him a cup of lemonade. He was pleased with Katsuki’s presence, at the sunny, perfect day. A warm breeze rustled the leaves.\nThey ate sandwiches and drank tea and ate cheese with crackers. Izuku watched the flowers dancing in the wind, hyper-aware of his husband beside him.\nHe didn’t talk much, but he was here.\nIzuku slanted a gaze towards Katsuki. His mouth turned up involuntarily and he hid it in his cup.\n“You have magic, don’t you?”\nA sizable percentage of the world’s population wielded magic. It wasn’t a surprise that Katsuki would ask this of him, though Izuku thought that his father must have told him as they were discussing the marriage.\n“Yes,” Izuku replied, “I’m better… with the manipulation of plants. Does Katsuki-sama have magic?”\nKatsuki lifted his hand, facing upwards, and let sparks fly from his palm.\n“Oh,” Izuku wound his fingers around the Katsuki’s palm and peered. “Attack magic?”\n“Yeah. Fire, explosions.”\n“Oh, yes. I remember someone telling me that your mother, Mitsuki-sama is dragon-kind.”\n“This is the Dragons’ Kingdom,” Katsuki lifted a perfect blond arch of an eyebrow. “Surely you knew.”\nIzuku smiled, sheepish. “Well… I might not be as… informed as others.” Quickly, he followed his statement with, “but I plan on rectifying that.”\nKatsuki snorted, dismissive. “Show me your magic.”\n“What would you like to see?”\n“Anything.”\nIzuku plucked a garden daisy from the ground beside theirs and closed his palm around it. When he opened his hand again, it had turned blue and sprouted more petals.\n“Something like that,” Izuku said awkwardly, “trivial, really.”\n“Huh. What else?”\n“I haven’t explored my magic much,” Izuku bit his lip, “I’m told… that, like my mother, my gifts are… much like a flower nymph’s.”\n“You’re descendants of nymphs?”\nA flash of irrational anxiety shot through Izuku — perhaps, he had said too much. But upon examining Katsuki’s countenance, it simply appeared to be an innocent question. “I do not think so. If so, I was not made aware.”\nHis husband made a considering sound. His eyes dropped to the spot where his birthmark laid hidden, and Izuku stiffened in discomfort. He wondered if his husband had figured something that he wanted to keep secret. But Katsuki only placed the cup back on the mat. “I’m leaving,” he said.\n“Alright,” Izuku sent him a shy smile. After a brief moment of hesitation, he bent over and kissed Katsuki’s cheek. “I’ll see you later, Katsuki-sama.”\n“Hm,” said Katsuki. His eyes were dark, shuttered. Izuku froze in his seat, wondering if he had violated some unspoken rule, but when he opened his mouth to apologise, Katsuki reeled him in by a hand and kissed him full on the mouth. “You eat too messily,” he rubbed away the crumbs around his mouth. Izuku went bright red, and judging by Katsuki’s smirk, that was the desired effect.\n“Katsuki-sama—!”\nKatsuki chortled under his breath. His eyes went to their attending servants, as if assessing their reaction.\n“See you later, Izuku.”\nIzuku slouched, muttering under his breath, hiding his bright red face from his maids.\n🥀🥀🥀🥀🥀\nIzuku settled into his new life as the consort to the King of Dragons quicker than he thought he would.\nHe didn’t have many responsibilities, nothing to shackle him down, no mundane lessons to attend. He was, as far as he knew, free to do whatever he wished to.\nHe saw his husband once or twice a week, over a meal or in bed.\nKatsuki didn’t speak much, didn’t smile much, and wasn’t gentle at all when they made love, and left the bed before Izuku woke up. But he was kind, to Izuku, and warm.  \nKatsuki pressed his thumb on his birthmark, watching the vibrant red recede before rushing back again.\n“Katsuki-sama?”\n“It really looks like a flower.”\n“It is,” mumbled Izuku. He covered his hand over Katsuki’s wrist. The bed was soft and warm. He wriggled a little closer to his husband. “It’s a forget-me-not.”\n“Why do you have this mark? How do you know it’s a forget-me-not?”\nIzuku’s sleepiness evaporated in an instant. He raised his eyes to meet Katsuki’s. Clearing his throat, he lifted his lips in a faint smile. “I have had it for a long time, so I decided to find out what it is.”\n“And why is it so… distinct?”\nIzuku lifted his shoulders in what he hoped looked careless. “I do not know, Katsuki-sama.”\n“Is that true?”\nHis eyes were piercing, as if they would see through Izuku’s words. “Yes,” said Izuku. He snuggled into his pillow, letting his eyelids fall shut. He hoped he looked nonchalant. “Are you not going to sleep?”\nKatsuki rose from the bed and slipped on the loose bathrobe. “I have work to do.”\nIzuku dressed himself similarly, curtsying as Katsuki left the room.\nThe bed was still warm from their shared heat when Izuku tucked himself back into bed. Behind his closed lids, he could still remember the heat, Katsuki’s musky scent, his breath, his raspy voice, his hot, large hands. His heat, inside Izuku, surrounding him. A shudder when through him. He curled into himself, his legs to his chest, trying to tamper his arousal.\n“Katsuki… Katsuki-sama,” he whispered, hugging himself. His husband never stayed in bed after they did the deed. He’d never been held before, not in a simple, chaste way, for the sake of being held, for the sake of feeling their skin pressed together, for being together, for feeling their bodies slot together like they belong.\nNo one had touched him like Katsuki had before, and it was silly to want more than this. It would be enough to keep his place here, in this kingdom.\nHe remembered, perhaps a little too late, that they may be husband and consort, they married not for love, but for power and convenience. A voice that sounded like his mother whispered: do not fall in love, never love.\nThe thought filled his eyes with tears. He curled further into himself, holding them back by force. He had been foolish. He’d forgotten the most important thing of all. He pressed his fingers over his birthmark, a curse he’d carried since he was born. He cannot forget this.\nThat night, Izuku dreamt in snippets.\nHe woke up in tears, but he forgot the cruel dream.\n🥀🥀🥀🥀🥀\n“You already know this,” Katsuki said, watching Izuku pour him a cup of osmanthus wine. He’d accepted Izuku’s invitation to watch the moon. “But I don’t plan on being a lovey-dovey couple with you.”\nIzuku blinked at him. His eyebrows furrowed, his lower lip protruding. After a brief moment, within which he looked like he was processing what Katsuki said, he tilted his head.\n“Is this… perhaps… a bother to Katsuki-sama?” He asked, thrown-off by Katsuki’s words. He put down the decanter and bowed, his hands pressed in front of him. “I did not mean to be a bother. I just thought that it was a nice night, and Katsuki-sama would like a break from work…”\n“Huh,” the blond put his lips to his cup and sipped. “As long as you are clear.”\nClear of what, Izuku didn’t know. But he went away that night in lesser spirits, mulling over the words. All he knew was that his chest ached oddly, much like a heavy weight was pressed upon it.\n \n\n ii. \n\n\n“your slightest look easily will unclose me\n\n\nthough i have closed myself as fingers,\n\n\nyou open always petal by petal myself as Spring opens\n\n\n(touching skilfully,mysteriously)her first rose”\n\n \nIzuku was reading when there was a tickle in his throat. \nHe had been thinking of his husband. Izuku had woken up to Katsuki this morning. Katsuki looked exhausted from his increased duties — there had been incursions at the kingdom’s border again — and had fallen asleep in Izuku’s bed for the first time.\nIzuku couldn’t fall asleep, spending the night, instead, watching Katsuki’s face. He radiated body heat. When he was asleep, his husband lost that severe intensity he carried around, reverting back to the young man he actually is, shedding the burdens of the king. Izuku found himself thinking of silly things, like wanting to protect his man. But he indulged in the thought anyway, letting his fingers pass over the contours of his face, the slope of his aristocratic nose, and the translucent eyelids framed by dense blond lashes. He’d been allowed to dress Katsuki in the morning, and seeing his husband still half-asleep and grumpy made him want to giggle.\nHis heart no longer thudded in tattoos around Katsuki, but was instead replaced with fine, easy contentment that coursed through his veins like thick syrup, sometimes making him giddy. His thoughts, saturated with Katsuki, Katsuki, Katsuki, made his lips turn upwards without fail.\nIzuku cleared his throat absent-mindedly a few times to ease the tickle in his throat, but it stayed there, a permanent itch.\nHoney and lemon water did nothing. It stayed persistent.\nHe coughed again, rubbing his hand over his throat. A sudden, shocking wave of nausea. His stomach recoiled.\nThe splatter of red across the black-inked page frightened him. When the panic ebbed a little, dread fought for dominance, and won.\nIzuku had thrown up a single flower, half-destroyed. A carnation, white in the centre, dotted and fringed with bright scarlet. Innocuous enough, but Izuku knew they were a fatal mark for him.\nIzuku froze. \n\nDo not fall in love. Never love. \n\nIzuku had forgotten. A fool will always be a fool.\nDread. Terror. And pain.\nIzuku could feel his breath shortening as he stared at the flower. \nNo, no, no, no, no—  \nHis birthmark suddenly felt too hot, under the hand he’d pressed over his throat.\nThree things dawned on Izuku, as he stared at the slick flower petals scattered over the black words of his book: he has fallen in love with his husband, his husband did not love him back, and he is going to die.\n🥀🥀🥀🥀🥀\nMother, why can’t I go out?  \n\nBecause it isn’t safe outside.\n\nWhy? Is it because I’m cursed?  \nYou’re not cursed, my darling.  \n\nThen why can’t I go out?\n\nBecause it’s not safe for you. It’s for your protection.  \n\nWhy?\n\n\nJust trust me, darling. This is for your own good.\n\nHis mother had lied to him after all. He was cursed. He knew he would die before the third moon ends, with a certainty that sunk into his bones.\nIzuku, slipping away from his attendants, walked to the deserted, moonlit garden alone. Please, he thinks.\nHe lifts his head, looks at the cold, cold moon.\n“Please.” The moonlight is so bright it hurts his eyes, but Izuku doesn’t look away. Around him, the flowers sway and perfume the air. They are silent.\n“Please,” Izuku repeated, louder. “I don’t need him to love me. I don’t need him to love me, I just want to stay here, in this kingdom. By his side.”\nThe cold scene was unyielding. It desolated Izuku’s heart, crushed it with chilling desperation.\n“Please!” Izuku raised his voice. He stayed there longer, waiting to hear a reply, but the moon and the flowers remained silent. Izuku fell to his knees, clutching his heart, that was being crushed to pieces. “I’ve only started to live my life,” he whispered, “I’ve finally found a place where I can be happy, why must you take it all away? Why?”\nHe wept. He screamed. He implored. They — the gods, the fairies, whoever could be listening — remained cruel and unmoved.\nIzuku got onto his feet and wiped his eyes clean of tears. He ambled back to his chambers, pulling his hood up and keeping his head down.\n“Izuku-sama!” Uraraka came running to him, “Izuku-sama, where have you been? We were all worried for you.”\n“I— went to take a walk,” Izuku said, without removing his hood, without turning to face her, “I’m a little tired. Please help me get ready for bed.”\n“Yes, Izuku-sama.”\n🥀🥀🥀🥀🥀\nHow do you undo love?\nIn the castle’s massive library, Izuku pored through the books on legends and fairy tales, searching for a way, a clue. He found nothing, no way to undo the curse, only knowing that a death sentence has been handed to him, unless he found a way to undo his own traitorous heart.\nEven though Izuku tried to rend Katsuki from his heart, deep in his bones, he knew he couldn’t anymore. His husband had crept through his shoddy defences and wormed himself into his heart — though Izuku had no idea what, or how it happened. He thought of seducing his husband, but it made him embarrassed. As a consort, whose role was to support his king in any way possible, forcing Katsuki to love him back seemed to be shameless and burdensome for his king. Would Izuku be able to make Katsuki fall in love with him in the first place? It seemed unlikely. It was just a while ago when he started to interact with others normally, what would he know about seduction and the like? No, it was impossible for Izuku.\nHe tried to harden his heart and build his walls, telling himself: this is not love, this cannot be love; how could he have fallen in love with his husband?\nBut he’s never known how to keep people out by himself: the walls were built for him since he remembered. He never knew how to keep his guard up, since he was always protected, isolated in his own room, kept away from others. He had done the same thing this time with his attendants, ordering them not to enter his room so as to hide his condition from them. Other than their protests and confusion at his decision, they are none the wiser about his condition.\nHe soothed his fingers over the yellowed pages of the text. The Nightingale and the Rose was a story he loved when he was young, fascinated by the sacrifice and selflessness of an unknown nightingale for love not even her own, yet now, he was overwhelmed by the tragedy of it all, and of the innately superficial human nature.  \nWas that why he was cursed to be unable to love and be loved in return?\nA dove fluttered to a stop at the library’s window sill. Walking over, Izuku undid the note attached to its leg.\nHis mother had replied to his query and will be sending him the books he requested. She ended off the note with: darling, I trust you are safe and healthy. Remember what I told you.\nIzuku crushed the note in his hand. I’m sorry, Mother. He fisted a hand over his aching heart. Coughed out a stray, blood-red petal.\n🥀🥀🥀🥀🥀\nThere came a knock on his door. Izuku, falling into a light dose, was roused again by a hand shaking him awake.\n“Consort.”\nIzuku sat up, rubbing his eyes. “Katsuki… Katsuki-sama?”\n“Come.”\n“Hm?”\nKatsuki pulled Izuku out of bed. “I have something to show you.”\n“Oh, but I’m not dressed…”\nKatsuki draped a cloak over his shoulders, heavy and warm.\n“This will do.” He slid his arm around Izuku’s waist and tugged him close. Izuku yelped, his face pinking.\nHe hid his face in the warm fur collar, letting Katsuki pull him out into the cool night air. He led Izuku to the same dragon they’d rode on before.\nKatsuki helped him up, before sitting behind him, sliding his arms around Izuku’s waist. Izuku startled, but Katsuki merely tugged him closer.\n“Sit properly,” he said, his breath caressing the top of Izuku’s ear. “Kiri, go.”\nWith a great flap of wings, the dragon lifted them into the air.\nIzuku huddled in the cloak as cold air whipped his hair and stung his face. Katsuki’s warmth blanketed him, making his heart thump and blood course hotly through his veins.\nHe turned his head, looking up at Katsuki. He was grinning fiercely, his hair ruffling in the wind.\nIzuku’s heart squeezed tightly. His stomach clenched, and bile rose sour and painful in his throat. Pressing his hand to his mouth, he threw up a full flower and a few scattered petals, red as blood. He closed his palm and crushed the flower, letting it fall, carried away by the wind.\n“Are you okay?” Katsuki asked, as he lifted him down from the dragon. The dragon huffed, warm air ruffling Izuku’s hair. Katsuki tugged the cloak better around Izuku, taking his hand and leading him forward.\n“Look,” Katsuki pointed. Tearing his eyes away from Katsuki, Izuku is greeted with a wonderous, dreamy sight.\nHundreds of blooming white four-petalled flowers scattered the cliffside. Under the dark of the new moon, they were particularly bright, little lights dotting over the entire field.\nIzuku stepped forward, eyes widening. “Oh.”\n“They only bloom on new moon.”\n“New-moon flowers,” Izuku muttered, “I’ve heard of them before, but it’s the first time I’m seeing them.” How am I supposed to stop loving you, Izuku thought, as he looked at Katsuki in the dim, statuesque and unreachable, if you keep doing these things to me?\n“You haven’t been to the garden.”\nIzuku, who had bent to pick a blooming flower, straightened. He slanted his body, holding the precious white blossom against his chest.\n“No,” he agreed. He pulled the cloak closer to himself. “I got sunburnt, and I didn’t want to worsen it before it got better.”\n“I see. Then why have you not allowed your maids to serve you in your room?”\nIzuku inhaled the fragrant air deeply, and let it out as a sigh. He let the blossom fall from his fingers. The starry sky looked lonely without the moon. He found it easy to answer, a half-truth. “I… wanted to be alone.”\n“If you’re sure.”\n“I’m fine,” Izuku smiled, linking his hands at his back as he faced Katsuki. “There is nothing you have to worry about, Katsuki-sama.”\n“Huh.”\n“Katsuki-sama,” Izuku asked, as the wind rushed through the cliffside, their cloaks billowing. He can’t make out Katsuki’s eyes, and what they held in those red irises. “What do you think of me?”\nKatsuki frowned. Izuku was so pale he nearly glowed, suddenly unearthly, fae-like.\nThere was no answer to give, so Katsuki just went back to his dragon, patting its scaly warm back.\nWhat did he think of his consort? Izuku was quiet and dutiful and unassuming and so pale that love bites and bruises stood stark against his skin. His reactions when they were in bed together were delightful and provocative, and he was obliging. He always smelt sweet and floral, like summer and sunlight and jasmine and vanilla. He seemed to enjoy the outdoors, in an innocent way, like a baby fawn seeing the world for the first time, and spoke to himself at times. It was amusing. It was good that Izuku wasn’t a nuisance, nor demanded his attention like other consorts he’d heard of. He’d stopped, quite abruptly, with the invitations to spend time together, after Katsuki told him that he had no intention of being more than a king and his consort. It seemed a little surprising that Izuku grasped his subtle hint so well, but it was easier this way. No need to come out of his way to say something so cringey.\nSo what did he think of Izuku? Nothing much at all. A warm body that he could touch anytime he wanted. After all, Katsuki had sworn to himself never to fall in love. Love made him weak. Made him less than invincible. As the youngest king across all the seven kingdoms, he refused to let anyone see or grasp any weakness. Love is a weakness. Made people blind to more important things.\nHis own mother is a great example. Even though he’d decided that when he married, and wasn’t going to change his mind, nor his feelings, the strange, non-sequitur question discomfited him.\nEven when they went back to the castle on Kiri’s back, Izuku swaddled in the cloak, oddly tensed, Katsuki still found no answer.\n🥀🥀🥀🥀🥀\nBack at the castle, Izuku bid his husband a good night before throwing himself into the bathroom, expelling flowers into the basin. He crumpled to his knees, panting, the petals sticking inside his mouth. Belatedly, he realised why Katsuki had said, I have no intention of being a lovey-dovey couple with you. His husband had been more aware of the changes in Izuku —  how he lingered often in Katuki’s presence, how he invited him more often to spend time together, how he touched Katsuki when they were in bed together, the way his eyes followed Katsuki, looking for attention — more so than he himself. It had been a warning. It had been a way to tell Izuku that by no means he was to fall in love with him.\nThe now-familiar ache shivered through his chest and settled at the base of his throat. The taste of bile mixed with the sweetness of the flowers made him retch again, his stomach clenching, tears welling up in his eyes. Cold sweat beaded his forehead and slid down his face. He didn’t notice Ochako coming into the bathroom.\n“Izuku-sama! Izuku-sama—” She cut herself off with a gasp as she caught sight of the pool of red in the basin. She stood. “I’ll call for the doctor—”\nIzuku grasped her wrist. “Don’t,” he rasped, “it’s alright.”\nThe girl’s mouth was twisted in worry, her eyes darting over to the basin of scarlet. “But—”\n“It’s just— flowers,” he gasped.\n“Huh?”\n“I’ll explain everything,” said Izuku, exhausted, “help me up and bring me some tea please, Ochako.”\n“Yes, Izuku-sama.”\n🥀🥀🥀🥀🥀\nHe explained the situation to Ochako, simply saying that he inherited a disease, but he was going to be fine. She didn’t look convinced, but Izuku knew she would keep her promise to keep this a secret.\nThat night, he dreamt of a green, green meadow, petals whipped into a pink storm by the wind. When he woke, his chest ached with forgotten, phantom pain. He rolled over and held his legs to his chest. He remembered only flashes of a tsunamic, unrequited love, the pain, the resentment that was not his, all roiling in him like a storm. Flowers withered like fleeting dreams, but love — and hate — did not. What was it? Izuku searched his mind for the words just out of his reach. Yes — love is not love which alters it when alteration finds, or bends with the remover to remove.\nHis eyes fell on the pop-up book at his bedside that arrived soon after his mother’s note. It looked like a romantic pop-up book filled with all kinds of flowers, rendered in faded, muted colours, but inside held a story of despair and ever-lasting resentment, now collected in a festering curse inside Izuku’s body.\n“Izuku-sama?” Ochako came in with a breakfast tray, which she set on the table.\nIzuku let out a quiet sigh, pulling back the blanket. “I’m alright, Ochako.”\n“I brought you porridge and cut fruit,” she said, “as well as peppermint tea.”\n“Thank you,” he muttered, rubbing at his aching chest.\n“How do you feel? Do you want to ask for a doctor?”\n“No, Ochako,” he said, taking a spoonful of the porridge. “Thank you.”\n“But…”\n“Trust me,” he lifted his mouth into a smile, “it’ll all be fine.”\nWhen he dies, he’d wither away and be forgotten, too. Izuku found it surprising how easily he’d accepted his own death. As if his whole life had been set up for that one moment.\nMaybe he should leave something behind.\n🥀🥀🥀🥀🥀\nIzuku woke up from his nap and was filled to the brim with the desire to see his husband. He remembered Katsuki’s reticence to their meetings outside of the official capacity, often guarded and cautious around his own consort, but found that it no longer mattered anymore. He had been told, been warned, been reminded, and he had fallen anyway.\nSo he got dressed in his forest-green silk robe and found Katsuki in the study. At the sight of Katsuki seated at his desk, regal and dignified, framed by the dark wood of his bookshelves, Izuku’s heart shuddered. The rise of petals at the back of his throat was difficult to swallow down.\n“Katsuki-sama,” Izuku curtsied. “Would you like to come have a game of chess with me in the garden? I have a bottle of osmanthus wine that I brewed a month ago.”\nKatsuki set his work aside. He studied Izuku with intelligent, piercing eyes, and obliged. They sat at their usual spot — the wrought-iron gazebo at the garden — and had a quiet game. Izuku forced himself not to cough, even though his throat itched terribly.\nKatsuki put his black bishop down. “You’re distracted.”\n“I…” Izuku brought his hand to his mouth, coughing a single carnation blossom. He fisted his hand around the flower and hid his hand under the table. Katsuki watched him with narrow eyes. “I apologise,” Izuku lifted the corners of his lips, “I have a cough.”\n“You should rest.”\n“It’s okay,” Izuku smiled, despite the sickly floral sweetness in his mouth, “I would like to spend some time with you before your two-week inspection at the borders.”\nKatsuki rolled his eyes, but he pushed the chessboard away. He resettled beside Izuku, patting at his own shoulder. “You can nap or something.”\nHis bewilderment turned into scorching fondness. Pain seeped through his veins and coalesced in his chest, and he felt another round of petals rising in the back of his throat. Love is so painful. He swallowed hard, to force them down, and put his head down on Katsuki’s shoulder. He wanted to ask: if you don’t want to love me, why are you so kind to me?\nPerhaps this was only a farce. A performance, that which a king must do to create the illusion of a perfect relationship between his consort and himself. Izuku is aware of the servants, standing a respectable distance away from them, and their eyes. But he’s hopeless, so he chooses to believe.\n“Katsuki-sama is very kind.”\n“You’re imagining it.”\n“Katsuki-sama,” Izuku whispered, “please stay safe when you’re out.”\n“Yeah.”\nIzuku stayed like that for several long moments. The flowers inside him roiled like a choppy sea, wanting and rejecting the closeness to the object of his affection.\nEither way, he managed to keep everything down. He detached himself, finding Katsuki’s hand and pulling him to his feet. “Let’s take a walk, Katsuki-sama. It is quite a nice day.”\nKatsuki obliged him, yet again. He seemed a little mellower, after their trip to see the new-moon flowers, now more prone to studying Izuku like he was some strange, new specimen.  \nIndeed, Katsuki was observing his consort. Izuku was hiding something from him. His cough rattled in his chest and shook his shoulders. It looked worse than a normal cough, though his consort pretended nonchalance. He wondered if Izuku would come to him about what was plaguing him, if it got worse.\nBut for now, he let Izuku pull him out into the sun.\nThey walked to the pond. The expanse of short grass beside the pond rippled like waves in the breeze. Izuku ran forward.\nIzuku twirled in a round, the sun golden behind him. He laughed, stretching his arms out, letting the bittersweet contentment course through him. All these will be lost to me in two months, he thought. He let his eyelids fall shut, the sun painting the insides of his eyelids red.\n“Katsuki-sama,” he said, whirling around to face his husband. How Izuku looked burned into Katsuki’s retinas and kept him awake at night. “I’m glad that I married you and came to this kingdom.”\n🥀🥀🥀🥀🥀\nOn good days, there was a summer garden blooming inside him, a garden full of ripe fragrance, sweet, singing roses and carnations, sunshine, green grass, flowers that were white as moon, red as love, as wide as the ocean.\nOn bad days, he imagined toxic flowers taking root inside him, sinking into and poisoning his veins, crowding out his lungs: blue belladonnas, purple hydrangeas, red spider-lilies, pink oleander, uncoiling like serpents.\nIzuku coughed, and bent over his chair to throw up in the ever-ready basin. \nHis skin, which used to have a petal-pink flush of health, became etiolated, white-sand, unhealthily pale. He could now see the green-blue veins that criss-crossed under his skin. He pressed a finger to a vein and pressed down. Love, his mother had said, breeds worry and fear. She was right, of course, but more than worry and fear, all Izuku felt was exhaustion and resignation to his fate. There was nothing left in him to protest against loving his husband, his first, only, and final love.\nThe nausea rose again.\nThe first petals choked the back of his throat. He retched and threw up the crimson carnations again. A damp petal stuck to his cheek, and he closed his eyes and breathed through his nose. His throat burned.\nHe abandoned the draft he was writing for a new charity he wanted to set up for orphaned children and curled up in his sheets, his chest souring with pain, exhausted from the endless nausea and vomiting. His stomach ached from the contracting and his throat was sore. Exhaustion saturated through him: he couldn’t find it in himself to enjoy the things he’d enjoyed doing so much before. A festering wound had opened up inside him, a black, yawning maw of emptiness that was slowly eating him whole.\nOne small mercy was that Katsuki was still out, doing his rounds at the borders.\nThey said absence makes the heart fonder. Izuku had thought that not seeing Katsuki would ease his symptoms, but they refused to let up.\nHe found his thoughts wandering to Katsuki yet again, the way his mouth twisted up in a faint parody of a smile when he was amused, that night at the cliffside, the tiny, white, new-moon flowers waving in the wind, Katsuki’s cloak wrapped around him, his scent saturated through the fabric, spice and musk.\nThe ache in his chest expanded and stained the back of his throat with bitterness. In his eyeline, the wine-red wool-twill cloak that he was embroidering laid neatly folded. He wondered if he would be able to complete it in time.  \n🥀🥀🥀🥀🥀\nIzuku bent over the cloak in progress, the lamp illuminating a piece of fabric and the embroidery. His eyes are dry from straining, but the rearing dragon was taking shape, vivid and life-like, as if it was gliding across the sky.\n“Izuku-sama, you should rest now,” Ochako muttered, laying a hand on his elbow.\n“Just a while more,” Izuku muttered, leaning back and smiling at Ochako. He rubbed at his eyes, clearing his throat when it started to itch again, before he turned his head and coughed out the petals. They scattered on the ground. A morbidly romantic display.\n“Izuku-sama, I’m sorry, but I insist,” she said gently, taking the needle out of Izuku’s hand. “You must rest.”\nBut there’s no point in resting, Izuku wanted to say, it doesn’t matter if I rest or not. This disease will eat away at him until there is nothing left. Another person's pain was within him, stranger and foreign, stacked on top of his own blistering wound.\nHe sighed but indulged his maid. He worried her, he knew, and this was the least he could do.\n🥀🥀🥀🥀🥀\nIzuku grew tired more easily as the days went by. Time slipped by him. The world took on watercolour grey hue, a little unreal, distorted, utterly insubstantial. The only thing that seemed real to him was the colour red, that was the colour of the cloak he was making, and stained the carnations he vomited. He paused in the garden maze, fingers resting against the petals of a wilting rose.\n“Izuku-sama,” Ochaco muttered, from behind him. She lifted the basket in her hands. “It’s time for lunch.”\n“I’m not hungry.”\n“The chefs have prepared something easy to swallow.”\n“Thank you. Maybe I’ll eat later.”\n“Why are you skipping meals?”\nIzuku startled, spinning around, dropping into a quick curtsy. His husband was there, all too overwhelming. In his presence, his luminous eyes, something ripped apart the triviality and pain of Izuku’s days that had blurred into each other.\n“Katsuki-sama,” he said, keeping his eyes downcast. “You have returned.”\n“I asked you a question.”\nIzuku lifted his head, his heart fluttering like a desperate, caged bird at the sight of Katsuki. He choked on the petals filling his throat, pressing his fingers to his mouth and trying to force them back down.\n“Are you sick?” Katsuki asked, coming closer. He smelt like the earth and fire. Too much, this is too much. Izuku’s eyes stung with tears, fingers digging into his palm. “Izuku?”\nIzuku straightened, wiping his hand against his mouth. \n“I apologise,” Izuku rasped through the sourness in his throat. “I do not feel that well.”\nKatsuki rests a hand against his forehead, tilting his head up. Izuku startled, jerking back in surprise as a zing of heat rushed through him.\n“You are pale,” Katsuki said, still too close, though he’d noticed Izuku’s reaction and stepped back. “You should return to your chambers.”\nIzuku nodded. “I will, Katsuki-sama.”\nKatsuki stood in front of him, for another moment, blotting out the sunlight, seemingly uncertain if he should go. Izuku prayed he would leave quickly,  his fingers digging into crescents in his palm. His stomach churned.\nLuckily, for him, Katsuki, with a turn of his brown boot, left without another word.\nAs his husband disappeared from sight, Izuku’s legs buckled, falling on the bench. He expelled the contents of his stomach. His whole sight filled with the cruel red, which made him dizzy.\n“Izuku-sama—!”\n“I’m fine,” said Izuku, as he got his breath back.\n“You’re not fine,” the girl said, her eyes wet. “You’re not fine at all.”\nIzuku’s mouth quirked up. He ruffled her hair. “It’ll all be fine,” he said. His voice was hoarse from his abused throat. He closed his fingers over a fully-formed blossom.\n“You have to see a doctor. I will ask for one tomorrow.”\n“It’s no use,” said Izuku quietly. The flower tumbled out of his clenched hand like a broken bird.\n🥀🥀🥀🥀🥀\nThe last dregs of summer bled into autumn. On a particularly breezy day, Izuku got Ochako to bring the cloak with his materials out, going to the wrought-iron gazebo in the garden.\nHe was going on by his work, humming under his breath. It was a half-forgotten lullaby his mother used to sing to him. He thinks that he’d heard its nostalgic refrain in a recent dream; it had a dying fall.\n“Izuku-sama.”\nIzuku lifted his head. “Yes?”\n“What would you like for lunch?”\n“Ah. Anything is fine. Maybe—”\nOchako’s face turned horrified, and she quickly took out her handkerchief to press against Izuku’s nose.\n“I’ll get the doctor—”\n“It’s alright, Ochako,” Izuku said calmly, pressing the handkerchief to stem the blood flow. “I’m alright.”\n“But—”\n“Please,” he said simply.\nHis maid hovered around him until the bleeding stopped. \n“I’m sorry I dirtied your handkerchief, Ochako. Let me have it washed.”\nThe girl’s eyes were shiny with tears. Izuku set the blood-stained handkerchief down.\n“Ochako?”\n“Why won’t you tell His Majesty?”\nIzuku raised the handkerchief back to his nose and dabbed the blood away.\n“He would be able to find you the best doctors and find a way, I’m sure. If you just—”\n“It is an incurable disease, Ochako,” Izuku said, “there is no use for doctors.” He raised his hand and pressed it against her cheek. “I don’t want to make a fuss. I want to go quietly.” A tear slid down her cheek, hot and wet, against Izuku’s thumb. “You see,” he said, trying to smile, “it does not matter who stands in my place. Any consort is the same as the other. Even if I weren’t here anymore, nothing would change. You’ll still be able to serve a new consort, I’m sure.”\nShe sniffled, wiping her eyes with a careless hand. Izuku smiled. He thinks of her less as an attendant and more of a friend. He’d never thought he’d have someone like that in his life. How have things changed. He’d gotten so many precious things, so many more things to lose now. It hurt. But there was no use being lingering on such things now.\n“Don’t cry. Let’s fill our time together with smiles and laughter, okay?”\n🥀🥀🥀🥀🥀\nIzuku sat still and unmoving at the seat just right of Katsuki, one hand clawed in the silk-embroidered emerald handkerchief. It was poison ivy that crawled inside him, stinging his organs. Sweat lined along his spine.\nKatsuki noticed, judging by the piercing side-eye he gave him.\n“Are you alright?” He muttered.\n“Yes, Katsuki-sama” Izuku straightened his back. He had long pushed away the elaborate meal in front of him, for looking at food made him more nauseous than before. He motioned Ochako to clear his plate, raised his wide-mouthed goblet, and took a shaky sip. The water had a faint taste of blood. He pulled it back and looked into it. A faint spiral of red wisped through the liquid.\nIzuku set the cup down and pressed his handkerchief to his nose.\n“Izuku.”\nHis husband had noticed after all. His large hand pressed against the small of his back hand caused Izuku’s battered heart to shudder. He fought not to pull away. The chatter at the table had ceased, and all eyes had turned to them.\n“I’m sorry,” he said, even as blood dripped down his nose into his handkerchief, “I’m fine. It’s just a little nose-bleed. Please excuse me.”\nHe left the table. He felt betrayed by his own body, that was now more alien to him than ever. How could he have gotten a nose-bleed in front of all the important ministers of their kingdom? Whatever would they think, that Izuku was condescending and ungrateful for leaving a banquet so early?\nIzuku was brought back to his rooms, where Ochako fussed over him. Izuku sat in his chair, upset.\n“You have to tell His Majesty,” Ochako said, as she pressed the steadily darkening fabric to his nose. “He’ll find you doctors.”\n“Tell me what?” His husband came to his side in a few large strides, the door swinging shut behind him.\nIzuku pushed the girl’s hand away. “It’s nothing, Katsuki-sama. We should return to the banquet.”\n“Tell me what?”\n“His Majesty has been feeling unwell in recent days,” said Ochako, “but he has refused doctors.”\n“Why?”\n“It’s just a little flu,” Izuku blinked, “I’ve always been susceptible to the changing seasons.”\n“How long has he been like this?”\nOchako darted a glance at Izuku, and replied anyway. “About a month, Your Majesty.”\n“Call for a doctor immediately.”\n“I’m fine,” Izuku said, to deaf ears. Katsuki led him to the bed, sat him down.\n“I can tell when you are lying.”\n“Really,” smiled Izuku, “there’s nothing you need to worry about.”\n“That’s what you said the last time.”\nIzuku kept his mouth shut. Katsuki held a hand to his forehead, his eyebrows furrowed together. They awaited the doctor in silence.\nKatsuki noticed the open pop-up book by his nightstand and picked it up.\n“I haven’t seen this before.”\n“I was homesick. I got my mother to send me the books I read when I was young.”\n“Is this a fairy tale?”\n“Yes.”\n“What of?”\n“Unrequited love.”\n“Oh?”\n“A flower nymph fell in love with a man who did not love her back,” Izuku said, his eyes falling onto a powerfully rendered page, covered almost entirely in several kinds of ornate flowers, a fae with light, butterfly wings was on her knees, covering her face with her hands. “Love turned to hate. She cursed his descendants.”\n“Cursed?”\n“If, one day, his children fell in love with someone who did not love them back, they would feel the nymph’s pain, amplified. They would waste away… wither, die.”\nKatsuki’s eyes were searing, flaming camellias. “I see.”\n“Merely a child’s story.” Izuku smoothed his fingers over the sheets. He can’t meet Katsuki’s eyes.\n“Is that so?”\n“Certainly,” Izuku lifted his lips in a faint smile. “It is merely whim and fancy. Pay this story no heed at all, Katsuki-sama.”\nKatsuki raised his eyebrows. But he moved away from Izuku when the doctor came in, leaning on the wall opposite the four-poster bed as he watched the doctor do his work. Izuku gave a soft, quiet sigh, catching the doctor’s eyes.\n“Your Majesty,” she said, “could you please leave for a moment? I would like to speak with His Majesty privately.”\n“Whatever you’re saying, you can say in front of me.”\n“Patient confidentiality—”\n“Is nothing in front of your king,” Katsuki snapped. “Go on.”\nIzuku pleaded with his eyes, closing his thin, cool fingers around the doctor’s hand.\nShe got the message. She asked him generic questions that Izuku answered without hesitation.  As she concluded her check, she slipped a note into his hand that Izuku hid under his blanket.\nKatsuki narrowed his eyes at the doctor, but didn’t dispute her words. He ordered Izuku to stay in bed and not show his face for the next three days.\nAfter Katsuki left, Izuku sent another dove out into the dark night, addressed to his mother: Mother, I have fallen in love with my husband, it said, I shall not regret it. I am sorry. But do not mourn. I have been happy in these few months with him, happier than I have ever been.\n🥀🥀🥀🥀🥀\nA day later, Izuku was let into Katsuki’s study.\n“My King,” Izuku curtsied. Katsuki came to him and guided him to his chair, glowering at him with sharp, unhappy eyes.\n“Why are you out of bed? I gave you an order.”\n“I came to bring you a gift.” Izuku took two, careful steps forward.\n“Hm?”\nIzuku took the folded cloak over from the tray Ochako was holding.\n“To keep you warm and safe when you are out with the dragons,” he said, his voice pitched at a volume barely above a whisper, and soft as silk, “the fabric is fireproof, and the thread has been weaved with protection spells.”\nHe pulled the cloak over Katsuki’s shoulders and fastened the gold clasp over his collar, smoothening the fabric over his chest with light hands. He stepped back, letting his eyes sweep over his body. \nThe cloak draped perfectly over Katsuki, accentuating the lightness of his hair and the crimson of his eyes.\nIt was so unfair: he was so beautiful, so unattainable; he threw open the doors to another world, a brighter, wider world for Izuku, but as soon as Izuku stepped into that world, he was to die.\n“I’m glad it fits.”\n“You embroidered this yourself,” Katsuki slid his hands over the dragon and the floral motif rendered in gold thread on one side of the cloak.\n“Every stitch was hand-stitched by Izuku-sama, Your Majesty,” Ochako said, her head bowed.  \n“Oh? Thanks. It’s beautiful.”\nIzuku looked at his husband more, picking up the embroidered part of his cloak and inspecting the rearing dragon, his thick fingers stroking across each stitch. His chest squeezed. An all too familiar ache crawled up his throat and made his nose sour. Izuku bit the inside of his cheek, his throat working against the reflux rising up from his chest.\nIzuku curtsied, keeping his head low. “Katsuki-sama,” he rasped, unable to raise his voice, “you have received my gift. I will take my leave.”\n“Izuku—”\nIzuku pressed his hand against his mouth as the sudden need to cough assaulted him. He hacked his lungs out, and the iron tang of blood filled his mouth. Red splattered onto the marbled floor.\nHe didn’t hear Katsuki calling his name because he crumpled like a broken puppet onto the ground, his knees buckling. He barely even registered that he was being hoisted up into strong arms, hacking out more petals, dizzy, his vision tunnelling only to the red-spotted ground.\nKatsuki had swept his gaze over the contents of what he had expelled — variegated, scarlet petals strewn alongside spots of blood — and though horrified and confused, pulled himself together and turned to Izuku.\n“Let me have someone clean it up,” Izuku said hoarsely, as Katsuki’s face filled his vision. His mouth was stained with ruby red. “I apologise—” He dissolved again into noisy coughs, hiding his mouth into his pale-green sleeve and staining them stark red.\nKatsuki lifted him into his arms without a word and made for his bedroom chambers. Izuku wiped blindly at his mouth, only managing to smear the blood.\nKatsuki set him down on the bed. He cupped his head in his hands and made sure their eyes met.\n“Izuku,” he said, in a tone that brooked no argument, “tell me why you’re vomiting petals and blood.”\n“I’m only a bit unwell,” Izuku turned his head so he could cough again.\n“Don’t lie. What the hell is this! I’m not an idiot!” \nIzuku took in a deep breath. He sunk into his pillows. “I’m fine.”\n“Izuku.” \n“I don’t need a doctor,” Izuku continued, his eyes going to the doctor who entered the room, Ochako twisting her hands behind her. “I just need to rest.”\n“Tell me what’s wrong with him,” Katsuki ordered the doctor, “I want a full explanation. If you lie to me, I will have your head.”\nShe met Izuku’s eyes, who closed his eyes in defeat.\n“Go on, Doctor,” he muttered.\n“I cannot pinpoint the exact cause or caster — but it appears to be a curse.”\n“What kind?”\n“A wasting curse. It appears that there are parasitic flowers growing within him, crowding his lungs. The curse will run its course in around one month.”\n“He’ll be dead.”\nShe hesitated, darting a glance at Izuku, whose occupied gaze is affixed at the window. As if their conversation was of no concern of his. “I’m afraid so.”\n“Fix it. Fix him,” Katsuki commanded, glowering and all too intimidating. “Undo the curse. Or I will have your head.”\n“Don’t make it difficult for the doctor, Katsuki-sama,” Izuku monotoned. His fingers fluttered on the sheets. An uncertain butterfly. “It cannot be undone.”\n“You knew this?”\nIzuku pressed his lips together. Katsuki dismissed the doctor with a furious hand. He lifted Izuku’s head roughly, his eyes turbulent.\n“Answer me.”\n“Yes,” he whispered, “I knew.”\n“Why did you not inform me?”\n“No one can undo the curse.”\n“How do you know that?”\n“Katsuki-sama,” Izuku said quietly, “do you love?”\n“I cannot.”\n“Then you will not understand.”\n“What has love got to do with your illness?”\nIzuku’s lips turned up. “Everything, Katsuki-sama.”\n \n\n iii. \n\n\n“or if your wish be to close me,i and\n\n\nmy life will shut very beautifully,suddenly,\n\n\nas when the heart of this flower imagines\n\n\nthe snow carefully everywhere descending;”\n\n \nKatsuki stomped out of Izuku’s chambers. Rage burned inside him. He hated when people spoke in riddles, and that was exactly what Izuku was doing.\nIt would be terrible if he died. It hasn’t even been a year since they wed. What would Izuku’s parents think? What of the bond between their kingdoms bought by this marriage? What would their citizens even think, if Katsuki lost a consort like that, to a mysterious curse? A random curse that could triumph over him, his consort? Katsuki swore, thumping his fist against the wall.\nHe won’t let Izuku die. He was going to find who cast this curse on his consort — an attack on him, his authority and pride as king — and he was going to kill them.\nHe found Kirishima roughhousing with Denki in the piece of land set aside for his dragons, and called them both over.\n“Go,” he gritted through clenched teeth, swinging himself onto his dragon’s, “we need to find someone to kill.”\nThe bitterly harsh wind cleared his raging thoughts. He couldn’t possibly find the culprit, not in the dark, not without any more information that he was given. He turned back to the palace.\nBack at the castle, he stomped to Izuku’s room and threw the doors open. Ochako curtsied, came up to him, and said, “Your Majesty, Izuku-sama just fell asleep.”\nKatsuki brushed past her and settled by Izuku’s side. He gazed at Izuku’s face, his brow slightly furrowed, as if in pain.\nAs he rose from Izuku’s side, calmer now, certain that his consort won’t die on him in the next day or so, his eyes caught the closed pop-up book. Izuku was strangely guarded when he inquired of it, so he picked it up and flipped through its ornate pages.\nIt was as Izuku told him: a story of forlorn, unrequited love. What caught Katsuki’s attention was the description of the curse. What did Izuku say? Love had everything to do with his illness. If any of the man’s descendants fell in unrequited love, they would wither, waste away. Like the flower nymph, after she cursed her object of love. My gifts, like my mother’s, are much like a flower nymph’s.\nThe jigsaw pieces fell into their horrific places. Katsuki looked at the man, still fast asleep.\nSo who was it that his consort fell in love with?\nLooking back, it should have been obvious. Too obvious. He should’ve been able to tell just by looking at Izuku. A lonely person, no more than a child who hadn’t had the space to become an adult, meeting and marrying another man who probably treated him better, if not warmer than others around him in his home kingdom. Katsuki had heard rumours of the elusive Prince of the Valley before he’d married him — he who was locked up in an isolated tower since he turned 7, for reasons that were untold. Izuku’s reactions to being let out and free to do as he wished told Katsuki all he needed to know. All hollow things wanted to fill their emptiness. It was, then, no surprise that a mutated form of gratitude and infatuation had been mistaken to be love, true love, no less. Katsuki scoffed.\nHe’ll set the record straight. Love was useless to Katsuki, and made him weak. Seeing his mother abandon the throne to be with his unremarkable, ordinary father showed Katsuki how love ruined ambition and corrupted power. Wasn’t Izuku just the prime example of how foolish it was to love?\nHe’ll set the record straight with his consort. He’ll make it clear that Izuku should not hope for reprieve from Katsuki, and that he’ll not — he’ll never — return such feelings.\nIzuku will understand. He’ll apologise for the farce and things would go back to normal. If Izuku were to be pleading, all Katsuki had to do was to be cruel. That would disillusion him and dash any favourable feelings towards Katsuki.\nThat was the best Katsuki could think of. Being cruel was something Katsuki was good at.\nBut somehow, a voice told him that Izuku was not so easily swayed.\n🥀🥀🥀🥀🥀\nThe next morning, a servant came to inform him that Izuku had awoken and was being served breakfast.\nMaking a quick decision, he made his way to Izuku’s room.\nHis consort was drawing circles with his spoon rather than eating. Katsuki waved the servants away and sat himself at the chair beside the bed. Izuku bopped his head in place of his usual curtsy.\n“Finish your food.”\n“I’m not hungry.”\n“Finish it.”\nIzuku painfully, agonisingly, finished most of his oatmeal. He looked nauseous, but he kept it down.\n“Is Katsuki-sama here to see if I finish my food?”\n“Are you in love with me?” Katsuki asked, blunt. He wondered what the words sounded like, like daggers, knives, piercing through flesh?\nIzuku dropped the spoon. His dim eyes, variegated green with gold flakes, widened. As if he was amused, he dropped his gaze and smiled.\n“I suppose it is rather obvious.” He lifted his chin towards the now bereft nightstand. “Did you find out from the book?”\n“Retract your feelings for me.”\nThe man hummed. “How?”\nKatsuki’s brow furrowed. “Just. Retract it.”\n“I can’t,” said Izuku. His pale fingers smoothed over the top of the duvet. “Not anymore.”\nKatsuki tilted his chin up with a rough hand and glowered, “this is an order.”\n“Even so, I cannot.”\n“Shall I throw you in prison?” Katsuki pushed his shoulder down and hovered over him, “whip your attendants until they die? Humiliate you in front of the kingdom? I am cruel,” Katsuki said, eyes boring into him, “did you forget what I did to you that time you came to me about the dragons? Do not force my hand.”\nIzuku gazed back. His eyes were as green as fairy pools. “Even if you are cruel to me,” he muttered, “I will still love you anyway. Did you think I didn’t try to rend you from my heart? From the moment I knew, it was always a point of no return.”\n“Retract your feelings,” Katsuki ordered, putting every bit of command in his voice.\nIzuku tilted his head. His smile was small and mysterious. It told Katsuki nothing about what Izuku was thinking.\n“I do not love you,” Katsuki said, final, fatal, “I will not love you. Stop this right now.”\n“I already knew that,” remarked his consort, unmoved and unmovable, as if the words Katsuki intended to hurt was no more than thin air, though his fingers had clenched on the sheets briefly, “that is why I said nothing, and that is why I’m dying.”\n“Consort.”\n“Katsuki-sama,” Izuku returned, “this is fine.”\n“This is not fine,” snapped Katsuki, “couldn’t you have thought about the repercussions more? It’s not about you or me. Our marriage is and always will be about politics. We are king and consort. Not peasants. There is no love for royalty.”\n“I am sorry.”\n“You are a disappointment, Consort.”\nIzuku met his eyes. Something flickered in those wide eyes, and slid away from Katsuki. “I am sorry,” he repeated, quieter this time.\nHe left Izuku behind him. Watching Katsuki’s cloak billow behind him as he left, the door slamming shut, Izuku fisted his hand over his heart, sharp needles driving themselves into his chest, blood and petals welling up in his throat.\nHe bent over the bed and spat them out, heaving. He laid back on the sheets, pressing his fingers over his heart, where it thrashed like a wounded animal.\nI do not love you; I will not love you.\nIt sounded like an echo of what his mother had said, all those months ago.\n“I knew that,” Izuku said aloud, through the now familiar taste of sweetness and iron in his mouth. “I already knew that from the start.”\nIt doesn’t make it hurt less. The tears dampened the sheets.\n🥀🥀🥀🥀🥀\nAfter that frustrating conversation with his consort, Katsuki found his way to his mother and father, in a tiny cottage near the border of the kingdom.\nHe slammed the door open, Kirishima taking off to find somewhere to romp around.\nHis father was seated at the couch, a book in his hands, his spectacles low on his face.\nHe wasn’t startled at the noise, but was surprised to see his son rather than his wife.\n“Oh, Katsuki.”\nKatsuki scowled. “Father.”\n“I didn’t know you were coming to visit,” he said, rising to his feet. “Tea?”\n“Where’s the old hag?”\n“Mitsuki is out… hunting.”\nKatsuki clicked his tongue, but settled on the rickety kitchen chair.\n“Why are you here?”\nKatsuki shook his leg, tapping his fingers on the table. Masaru, serene, sat opposite him. There was no pressure to speak. Katsuki picked up the cup and drained it.\n“It’s the consort — my consort.”\n“Ah, yes. Izuku, wasn’t it? What is it?”\n“He’s — dying.”\nMasaru raised an eyebrow. “Dying? Why?”\n“Cursed.”\n“I’m sure the royal doctors would be able remove the curse.”\n“I don’t think so. A fae cursed his family line.”\n“Oh.”\n“He… he’s in love with me — that’s why.”\n“Ah. That’s… tough.”\n“Fuck,” Katsuki swore, the words bursting out of him, “this is fucking stupid. Why the fuck didn’t he think before — why didn’t he just —”\n“Not fall in love with you?” \nKatsuki flinched involuntarily. It sounded unreasonable when his father said it like that. “Yeah.”\nMasaru pushed his spectacles up, his mouth pressed together as if he was stifling a smile.\n“What?” Katsuki snapped.\n“Why are you so angry?”\n“Because—! He can’t die like that! What would the Kingdom of Valleys think! And the people!”\n“Well,” Masaru linked his fingers together, “what’s the worst that could happen?”\n“They’d think I mistreated him or something. The Valley royalty would be pissed and come attack us. The alliance between the kingdoms would fall. And there’d be other annoying, troublesome stuff.”\n“That’s all about the kingdom,” Masaru pointed out.\n“That’s the biggest problem!”\n“What about yourself?”\n“That’s not a problem. I don’t care about him at all.”\n“But you’re so angry.”\n“I am king,” snapped Katsuki, “I think about the kingdom before I act.”\nSilence hung in the room for a moment or two. Katsuki refused to feel guilty.\n“You still resent us?”\n“I was 21 when Mother decided it was a good idea to hand the kingdom off to me and fuck off to the middle of nowhere,” he snarled. His mother, glorious and strong, destined for great things, destined to better the lives of their people, to make their kingdom stronger, had decided that love was more important after all. He’d never forgiven her for that.\n“Katsuki,” his father said, with his trademark gentleness, “I am sorry.”\n“I don’t need you to apologise.”\n“You’ve done very well up till now,” Masaru continued, “we are always very proud of you.”\n“That’s not the point.”\n“You’ll be fine from now on, too.” His father patted his hand. “Don’t worry. Even though we may be far from you, you may come to us anytime you wish.”\n“I don’t need your help.”\n “Well.” Masaru’s mouth turned up, as if he was amused. “For your consort… Izuku.” Masaru stood and went to his wooden row of cabinets. He pressed a sprig of blue flowers on his hand. “I don’t know what happened between you two, but this might help you figure things out.”\n“What the hell is this?”\n“A dream flower. Put it over your heart when you’re going to sleep.”\n“Hah? What’s it supposed to do?”\n“He’s your consort, Katsuki,” his father said, “what happens to him — it is not as lofty as a problem of the kingdom — but a couple’s problem.” He ruffled Katsuki’s hair. “He came from another kingdom and married you. He’s your responsibility, Katsuki.” His father peered benignly over his glasses. “You might think love is a weakness,” he muttered, “given what… your mother chose, in the end. But making a decision like that requires strength, too. Your consort chose to love you in spite of death. Don’t you think that that’s very brave?”\nThe flower was as blue as the inky sky. Katsuki slipped the flower into his pocket and left for his castle before Mitsuki came home.\n🥀🥀🥀🥀🥀\nKatsuki took the blue sprig out of his pocket and looked at it at the palm of his hand. He didn’t know why his father had given him the flower, or what he thought that’d do.\nHe fell flat on his bed, holding the flower up. Whatever, he thought, and laid it over his heart, closing his eyes. His conversation with his father replayed in his mind as he drifted off into a doze. \n\nDarkened room. His new consort at the window, moonlight spilling over him. His eyes, blown-black with desire, moon-kissed porcelain skin, petal-pink flush. Izuku bringing him a cup of tea when he burned the midnight oil. Izuku opposite him, his pink mouth turning upwards in a pleased, delighted smile as they played chess. Him, running through the deserted halls. Can’t reach him. Katsuki-sama, let’s play hide-and-seek. Can’t find him. Had disappeared into thin air. Everything is transient. All is vanity. Don’t you think that is very brave? Cold. Day is long. Night is longer. The garden bloomed rapidly and died even quicker. Only a flat, barren, meaningless land. Are you going to Scarborough Fair?\n\n🥀🥀🥀🥀🥀\nWas this love? He didn’t know, but the dream left him with a bitter taste in his mouth and a leaden, unsettled feeling in him. It felt like he was on the cusp of losing something important, a loss of something that would be irretrievable, irreversible.\nHe walked into Izuku’s room, unsure, how Izuku would receive him, after what he’d said to him the last time.\nIzuku was writing something at his desk, one hand rubbing at his chest, in a movement that was absent. He cleared his throat.\nKatsuki hadn't noticed, but now, under the crisp light splintering into the room, the lustre of Izuku’s skin was lost. He looked bloodless, his bones protruding from his translucent skin.\nHe walked right up to his side before Izuku noticed him. He set his pen down and stood, but before he could curtsy, Katsuki stopped him with a hand to his elbow.\n“You shouldn’t be out of bed.”\n“Katsuki-sama,” said Izuku. His voice was hoarse and broken, “good morning.”\n“What are you doing?”\n“Oh, um.” Izuku’s mouth curled into an awkward smile. “Just some matters… for my successor.”\nKatsuki’s jaw clenched. “You’re not going to die. I won’t let you die.”\n“It’s alright, Katsuki-sama. This is all my fault. I am sorry,” he muttered. His eyes creased a little as he lifted his mouth into another false smile. “I’m sorry for falling in love with you.”\nIzuku’s eyes were an endless, empty grass field. Too used to getting hurt. Izuku loved him in such a quiet, unconditional, profound way that made Katsuki’s chest twinge, confused and entangled. Katsuki drew Izuku close and crushed him against his chest.\n“Katsuki-sama,” Izuku mumbled, pressed against his front. His bones are too breakable under his hands.\n“Why me?” Katsuki’s fingers dug his back, “why did you choose me?”\n“Love doesn’t listen to reason.”\n“I’m not a good person.”\n“Perhaps not to yourself, but to me, you are.”\nKatsuki pressed his lips against Izuku’s forehead. “It’s new moon tonight,” he said, resting his chin on the crown of Izuku’s head. “I’ll bring you to see the new-moon flowers.”\n“Katsuki-sama…” Izuku pulled back, tilting his head, “there’s… something, different about you.”\n“What?”\n“It’d be nice,” Izuku said, after a moment of studying his face, “to see the new-moon flowers.”\nHe didn’t say it aloud, but Katsuki heard it all the same: one last time.\n🥀🥀🥀🥀🥀\nKatsuki hung around Izuku the whole day, unable to tear himself away from Izuku. He was half-afraid that if he looked away, his consort might just disappear.\n“Katsuki-sama,” Izuku coughed, hiding his mouth, “do you… should you… I mean… do you not have… work, to do?”\n“No.”\n“Oh, but…”\n“You want me to leave?”\n“If you’re here…” Izuku’s hand clenched against the front of his robes.\n“Does it hurt?”\n“If you’re too kind to me, I’ll be sad… to leave.”\n“Come here.”\nIzuku went to Katsuki, who stroked his cheek. Izuku’s pale cheeks warmed a little, his eyes dipping downwards.\n“Why don’t you try seducing me?”\nIzuku’s expression faltered. He pushed Katsuki away. “Love sought is good, but given unsought is better,” he said, “I do not need you to pity me, Katsuki-sama.”\n“It’s not— pity.”\nIzuku blinked at him, his thin, bloodless lips downturned.\n“I just.” Katsuki’s eyebrows furrowed. He didn’t know how to explain the feelings inside him. “My father gave me a dream flower.”\n“Masaru-sama did?”\n“I had a dream about you.”\n“Me?”\n“Yeah.”\nIzuku looked incredibly confused. He shifted on his feet, mouth pursed. Like Katsuki, he didn’t know what these words meant.\n“Never mind.” Katsuki rubbed his fingers over his face. “Let’s take a walk outside.”\n“I have… I have things to complete.”\n“Do it later.”\n“I don’t have much strength. I—”\n“I’ll carry you if you’re tired.”\n“Katsuki-sama, I…”\n“This is an order.”\nIzuku let out a quiet, resigned sigh but he nodded. Katsuki got Ochako to dress him warmly before taking his hand.\nThey walked through the garden. The flowers were gone, and the trees were shedding their  leaves. Soon, winter would come. His consort coughed feebly into his handkerchief, his thin frame shaking.\n“Where does it hurt?”\n“It doesn’t hurt.”\nIzuku was tired out after walking around for 10 minutes, so they found Izuku’s favourite gazebo and sat there. Izuku sighed, slumping against the seat.\n“You can rest on me,” said Katsuki, pressing his head down against his shoulder.\n“Katsuki-sama…”\n“What is it?”\n“This is quite unlike you.”\n“I had a dream,” Katsuki said. He was repeating himself like an idiot, but he didn’t know what else to say.\n“What was it about?”\nA cool breeze blew and whipped their hair. “I don’t know.” Katsuki turned his face into Izuku’s curls. “I don’t know,” he muttered, “but I can’t… life without you would be… different.”\nIzuku pulled away. He lifted his eyes, those wide, doe eyes that seemed to see through Katsuki. “Is Katsuki-sama lonely?”\n“I don’t know.” Katsuki ran his thumb over his cheek.\n“I’ll spend all my time with you,” Izuku’s mouth turned up, his eyes crinkling. “Would that be nice?”\n“Yeah.”\n“We can have a picnic again. I buried the osmanthus wine under the big plum tree. It should be ready soon.”\n“Alright.”\nIzuku stifled a cough, leaning his head back on Katsuki’s shoulder. “You don’t have to force yourself,” Izuku muttered, “even if I weren’t here anymore… I’ll be the wind and the trees and the flowers to keep you company.” \n“How many times do you want me to say this? I won’t let you die.”\n“Okay,” whispered Izuku. His body is leaden, and his eyelids are heavy. The pain inside him subsided into a low simmer, resigned fondness taking its place. He found Katsuki’s warm, large hand and laced their fingers together. His own hand was ice-cold. “Don’t worry,” he mumbled, “take your time. I’m just going to nap.”\nIzuku never felt quite as faraway as he did then. Katsuki held onto his hand and watched the sun set behind the trees.\n🥀🥀🥀🥀🥀\nOn the night of the new moon, Izuku was picked up from his bed bridal style, a cloak wrapped firmly around him.\nWhen he woke again, Katsuki was carrying him down the dragon’s back, walking towards somewhere. The night air was cool and smelt richly sweet. He roused, shifting as he was set down, in Katsuki’s embrace.\n“You’re awake.”\nIzuku lifted his head up, taking in the breath-taking scene sprawling before him. He felt a sudden kinship to these flowers, that bloomed on the night of the new moon, in darkness, and wilted when the night ended. Which flower doesn’t yearn for light? “Even if the flowers yearn for the moon, they can never meet,” Izuku muttered.\n“Why are you thinking of such things?”\nIzuku smiled at his husband, resting his head on Katsuki’s shoulder. “Just whim and fancy, Katsuki-sama.”\n“If you’re tired, I can bring you back now.”\n“I would like to stay here for a while more,” said Izuku, “if that is alright with you?”\n“Mm.”\n In Katsuki’s eyes, only illuminated by faint starlight, Izuku’s complexion was as white as snow, his liquid eyes limpid as a fairy pool, as beguiling as a full moon. Perhaps, for the first time, he noticed that his consort was quite beautiful, in an understated, subtle way.\nThey sit in silence, watching the flowers. Izuku hummed the nostalgic song. “Are you going to Scarborough Fair,” he hummed, “parsley, sage, rosemary and thyme. Remember me to one who lives there…”\nHe’d heard that song before. Katsuki turned to Izuku. “What are you singing?”\n“Oh, my mother used to sing this for me.” He tilted his head at Katsuki, “do you want to hear the rest?”\n“Yeah, sure.”\n“He once was a true love of mine…”\nIzuku’s soft voice and the scene in front of him gave Katsuki a severe sense of deja vu. Like he’d seen this before. Abruptly, Katsuki wondered why he’d brought Izuku here the first time round. Was it because he’d thought Izuku was behaving oddly and wanted to ask him what was wrong? He thought that this sight would make Izuku lower his guard? Was it out of pure curiosity? Because he thought Izuku might like this? Katsuki frowned. He noticed that Izuku shivered in the slight cold and pulled him close, winding a hand around his waist and tucking him against his front. He didn’t know what he thought then, but it didn’t matter now. He leaned his chin on the top of Izuku’s head, surveying the expanse of flowers in front of him. He wondered how this place would look, if he came here alone. As the thought struck him, he despised it, rejecting it wholly. He slid his hand down and engulfed Izuku’s cool, small hand in his.\nIzuku trembled, coughing feebly. Katsuki adjusted the cloak around Izuku. “Let’s go back.”\n“Just a little while more, please, Katsuki-sama.”\n“We can’t,” Katsuki told him, pressing his lips on Izuku’s hairline. “I’ll bring you here during the next new moon.”\n“Another new moon… huh.” Izuku lifted himself and let his mouth linger on the corner of Katsuki’s lips. Where his mouth touched, it tingled. “That would be nice. Thank you for bringing me here. This is lovely.”\nKatsuki heard what he was saying implicitly. “I won’t let you die.”\nHis consort hummed. “Okay.”\n“We’ll bring your osmanthus wine the next time.”\n“Alright, Katsuki-sama.”\n🥀🥀🥀🥀🥀\n\nWisteria flowers. Dream-like purple. Fragrant. Waving in the wind. Izuku’s hand in his. Smaller than rain. His laughter, bright as a bell. Easy contentment. That strain again, it had a dying fall. Isn’t there more things to lose, now? Two thrones. Something nearing happiness. Green fields. A game of chess. Night flights. Morning breeze through an open window. Warm bodies entwined. Weight, curled like a cat, against him. In all my gardens there is no red rose. Then I shall make a rose garden for you.\n\n🥀🥀🥀🥀🥀\n“Izuku!”\n“It’s not Izuku, it’s Your Majesty!” \n“We’re not part of the court—” \n“Still! Don’t be rude!” \nIzuku blinked at the three people who burst into his room, dressed in linen clothing. He chanced a glance at Ochako, who shrugged at him. \n“Who are you?” Ochako asked.\nA red-haired boy with shark teeth grinned. “It’s me, Kiri, Kirishima!” \n“I’m Denki—”\n“And I’m Mina!” \nIzuku startled. “You are the dragons?”\n“Took you long enough!” Kiri said cheerfully, and plopped down beside him on the bed. “Katsuki said you’re sick! So we came to see you.” \n“You have human forms, too?”\n“Uh huh.”\n“Your Majesty!” Mina threw herself over the length of the bed. “Come ride with me! It’s not fair that Kiri had the chance—”\n“Because I’m the manliest—”\n“I’m not even a man!”\nIzuku laughed, and he gently touched Mina’s hand.\n“I’d love to ride with you,” Izuku muttered. “When I get better…”\n“Promise?”\nIzuku smiled. “I’ll try my best.” \niv. \n\n“nothing which we are to perceive in this world equals\n\n\nthe power of your intense fragility:whose texture\n\n\ncompels me with the colour of its countries,\n\n\nrendering death and forever with each breathing”\n\n \n“Katsuki-sama,” Izuku gasped. Katsuki stared at him, horror growing. Izuku looked a mess, blood soaking into the front of pale green nightgown, turning a matt burgundy, his nose and mouth bloodied. There were tear tracks on his face. “I’m scared.” He took another step forward, falling heavily to his knees, his thin body shaking with the force of his coughs. In a flash, Katsuki was there holding him close. \n“Call the doctor,” Katsuki shouted. Izuku took a shuddering breath and coughed. A splatter of blood stained his shirt. \n“Please,” Izuku begged, eyes falling shut, shuddering in pain as his face tightened, sobbing breathlessly. “I don’t want to be alone anymore — make it stop.”\nKatsuki swung him into his arms and carried him to his bed. The smell of blood pervaded the entire room, making Katsuki bristle in discomfort. \nHis valet stepped forward. “Your Majesty, you should leave the room—\"\nKatsuki silenced him with a withering glare and placed Izuku on the bed, who curled into himself, sobbing softly between hacking, painful coughs. \n“Where is the doctor?” Katsuki demanded, drawing back as he rounded on his attendants. Izuku cried out, his hands reaching out for him. Katsuki grasped it, frustratingly helpless as he watched Izuku cough blood, shuddering. He didn’t know what to do with his other hand, and settled for resting it in Izuku’s sweat-soaked hair.\n“Your Majesty, you must leave at once. It is dangerous, you might—” \nKatsuki silenced his valet with another furious glare. The quiet in the room is only interrupted by Izuku’s wheezing and crying. \nThe doctor came rushing in, and Katsuki stood back and let her work. \nIzuku calmed down, the bleeding stopping, but he still trembled, curled into himself. He couldn’t bear the doctor’s touch, arching away from her hands, but when Katsuki touched him, he settled down, breathing calmly, evenly. \n“Stay with me,” Izuku begged, in a voice that was as brittle as glass, though the grip on Katsuki’s hand was strong, “don’t let me be alone again.”\n“I’m here,” Katsuki replied, awkward. He’d never been gentle, never having to care for another so fragile like this, but he knew he had to be, for his consort.\nIzuku dozed off. His grip didn’t loosen. Katsuki noticed that his freckles had lightened and become faint. His eyelashes were long and clotted. Katsuki rubbed away the silvery tear tracks on his cheeks. From Izuku’s body came the very faint scent of blood, and a faded kind of floral sweetness.\nSomething shivered and ached in his chest. Izuku was slipping through his fingers like sand in an hourglass. The confused, terrified feeling swept through him. Since he became King, he’d never felt these feelings quite as acutely. Seeing Izuku like that, alongside his unsettling dreams, had done something to him.\n“Don’t go,” he whispered, pressing a kiss on Izuku’s forehead, “wait a while more.”\nHis mind was already there, but his feelings haven’t caught up.\n🥀🥀🥀🥀🥀\nIzuku was looking out of the window, propped up against multiple pillows. The tree with those vibrant red leaves that he could see from his windows was almost bare. Izuku’s fingers, curled over his lap, are thin and bloodless.\nHe turned Katsuki as he stepped in. Katsuki cups his face. “Are you hungry?\n“No,” he whispered back hoarsely, sparing a smile for him. “Thank you, Katsuki-sama.”\nKatsuki lifted him, rested him against his side. Izuku hummed, his gaze fixed outside. “Tell me what you’re thinking.”\nIzuku turned his head to smile briefly at Katsuki. The bags under his eyes were pronounced. His countenance screamed sick, dying. His gaze went back to the window. His voice was a dry, quiet rasp. “I just thought… how happy I would be, if you could remember me once in a while…”\nKatsuki’s fingers tightened around his shoulder. “Don’t talk like that.”\n“I’m sorry,” Izuku smiled faintly, “but it’s true.” \n“Stop it.”\nIzuku lifted a feeble hand and curled it around Katsuki’s cheek, pressing his forehead against Katsuki’s face. “I’m not afraid of dying. I just don’t want you to be lonely.”\n“So stay. Don’t die.”\n“I wish it were that easy, Katsuki-sama.” Izuku bumped his lips against Katsuki’s cheek. He started humming that song again absently, his gaze faraway, as if he was no longer here.\n“Izuku.”\n“Mm?”\n“Do you like being here?”\n“Of course,” Izuku’s mouth lifted, turning his face into Katsuki’s chest. “I like being with you. Stay with me to the end, Katsuki-sama.” Katsuki ran a thumb over Izuku’s cheekbone. He looked into Izuku’s dim eyes, tilting his face up. Their lips met. Katsuki snaked his hand around Izuku’s thin waist and held him, slipping his tongue into Izuku’s mouth. A soft whine escaped Izuku. When they separated, Izuku was panting, limp and sprawled over Katsuki. His jade eyes were half-lidded, dazed, his pale cheeks gaining a faint flush of pink. His features, Katsuki noted, were quite like a delicate work of art. Katsuki’s heart gave a little lurch. He thumbed at his cheek, dropping another kiss on the top of his cheek.\n“Hey,” he muttered, against Izuku’s hairline. “Lie down with me.”\n“That’s a good idea,” mumbled his consort. His eyes fluttered shut. Katsuki manoeuvred them so Izuku laid over his chest. Their bodies rising and falling evenly together lulled Katsuki into sleep.\n\nIzuku’s body laid out in front of him. Red seeping from the bottom of his white robe, staining his skin. Izuku’s dead, unseeing eyes. Flowers bursting out of Izuku’s chest, his mouth, a sick bouquet. Unsettling sense of fear. A flourishing kingdom, and a cold, single throne. Dead garden. Empty bed. Are you not desperately unhappy? No tea for the night. Crushed rose. Thorns in his palm. The moon had never been so desolate. \n\nKatsuki jolted awake. His heart was thundering in his chest, and he was panting. Cold sweat dripped down his face. He turned, searching for Izuku, but the bed was bereft.\nHe scrambled up. Panic spiked in him. His eyes darted around the darkened room. Izuku was at the window, gazing up. Moonlight splintered over him, fragments of broken glass. A scene right out of their first meeting, when Izuku first became his consort. Now, Katsuki found it unbearably, painfully beautiful. His heart shuddered.\nHis feet found him behind the man. He grabbed him, his two arms going around Izuku’s chest, crushing him against his chest, desperate to feel him warm and breathing.\n“Katsuki-sama?”\nKatsuki deliberately took in a deep, even breath. The night air was a balm to his aching insides. He swore under his breath, his fingers digging into Izuku’s waist.\nThey stayed like that until Katsuki felt his heart rate return to normal. Izuku was humming quietly, as if to soothe Katsuki. He looked down at the flattened curls in front of him and pressed his face into them.\nA small laugh came from Izuku. “Katsuki-sama, it’s rare that you’re so clingy.”\n“I just realised,” Katsuki said, muffled, “you never said that you love me.”\n“I didn’t?”\n“Yeah.”\n“Oh.” Izuku was quiet, and the words Katsuki wanted him to say tumbled out of his mouth without hesitation, “I love you.”\nIt was incredibly easy to reply. Too easy to admit. The fear and hesitation were gone and left him with clarity. Nothing left in him to protest. Kingdom? Power? Ambition? All those can come later. Perhaps all he had been waiting for was confirmation. His heart was full of strange, alien affection, but it made him feel invincible. Nothing would stand his way again. “I love you too.”\nIzuku turned slowly towards him. His eyes, framed with thick, dark lashes, were wide. He looked inevitable, inescapable, the only other person in the whole wide world.\n“Katsuki-sama.” He bit his lip, looking away, “thank you. The thing is… it’s um. Well. It makes me happy to hear it.”\nHe pinched and pulled Izuku’s cheek. Impatient for him to understand. “I do. Really.”\nIzuku blinked a few times, looking as if Katsuki had slapped him. “Um.” Katsuki ran a thumb over his cheek and smiled at his dumb face. Through what seemed to be a haze, Izuku whispered, his large eyes fixed on Katsuki. “Do you mean it?”\n“Yeah.”\nA single tear traced down his cheek. His eyes didn’t move away from Katsuki’s, and they were dark, swirling with hope. “I don’t believe you.”\n“I don’t lie.”\n“Katuki-sama,” Izuku said, “you can’t do this to me.”\n“That’s my line.”\n“I already prepared myself to die. And you just—”\n“Sorry,” Katsuki bent down and kissed away a tear. “It’s all fine now.”\nIzuku’s face crumpled. He threw his arms around his husband and wept. Katsuki smiled, one large hand sliding into Izuku’s curls, cupping his head, the other tightening around his supine waist.\n“Say that again.”\n“I said it already.”\n“Say it again so I’ll believe you.”\nKatsuki sighed, though his mouth was turning up. “I’m only going to say it one more time so you better listen up.”He pressed his lips against his temple. “I love you, Izuku.”\nIzuku wailed louder, his tears wetting the front of the shirt that Katsuki had on. Katsuki laughed. A weight lifted off him. He felt so light all of a sudden, warmth seeping through his veins. The world realigned itself to its proper coordinates. His heart sang. Who knew love could be so easy?\nIzuku’s crying tapered off. His body was limp against Katsuki, even though his hand was still fisted against his back. Katsuki ruffled his curls. Izuku sniffled, raising his head. His red-rimmed eyes, snotty nose, his flushed cheeks were an oddly endearing sight that made affection surge.\nKatsuki grinned at him, thumbing away the wetness from his eye. “All done?”\n“Katsuki-sama…” He tucked his face back against his chest.\n“Come on,” Katsuki lifted his insubstantial weight into his arms, “enough crying.”\nIzuku bopped his head, utterly comfortable in Katsuki’s arms. He was set on the bed, pulled against Katsuki’s side. He hooked his pinky with Katsuki’s, shuffling closer. His husband engulfed his hand in him, holding it over his own heart. It thumped steadily, certainly, under Izuku’s hand, now his for the taking. \n“Sleep,” he heard Katsuki say, as he slowly drifted off, “when you wake up, everything will be fine.”\nv. \n\n(i do not know what it is about you that closes\n\n\nand opens;only something in me understands\n\n\nthe voice of your eyes is deeper than all roses)\n\n\nnobody,not even the rain,has such small hands\n\n \nUpon waking, there was no pain in his chest, nothing tangling his insides into knots. His throat didn’t itch. The faint nausea was gone. He was light as air.\nWhen he snuggled into his warm, moving bed, completely content, he noticed something strange.\nA hand curled around his back, warmth bleeding through.\n“Awake?”\nIzuku flustered, sitting up. He found that his husband was propped up on one hand, gazing back at him with an amused quirk to his usually stern mouth. He lounged, languid, in Izuku’s bed.\n“Katsuki-sama…? Why are you…”\n“Did you forget about what happened last night?”\nIzuku thought back. “Oh.” He went pink. “Right.”\n“How are you feeling?”\n“Oh…” Izuku touched his throat. The festering illness and hovering discomfort had all but disappeared from his body. It was a strange feeling, since he was plagued with this illness for nearly three months. But Katsuki was in front of him, out of a dream. A herald of joy. “I’m fine. I mean… I feel better. Perfect.”\n“Uraraka, get food for him.” \n“Yes, Your Majesty.”\nIzuku’s cheeks were bright red, hiding his face behind his sleeve. Katsuki snorted and yanked him down, so he thumped against his chest. Everything was a little dream-like, surreal, and Izuku lifted his eyes to stare at his husband’s profile. \n“Come sleep a while more.”\n“Katsuki-sama—”\n“What?”\n“Mm-hm.” Smothered against Katsuki’s chest, he blinked a few times. A smile overtook his face. He squeezed his eyes shut and shuffled closer. “So… Katsuki-sama…”\n“Hm.”\n“Really loves me?”\n“Shut up. You’re fine now, isn’t it?”\nIzuku laughed, the sound tinkling like bells, tapering off to soft giggles. “Okay. Alright.”\n“You’re really so noisy.\"\n“I love you,” he mumbled.\n“Mm.” Katsuki rolled over and pinned him down, trapping him in his embrace. His weight was heavy, but Izuku could deal with it if only for the feeling of Katsuki’s closeness.\nIzuku wound his arms around Katsuki and closed his eyes. The curtains fluttered in the light breeze. Happiness came so quietly, so quickly, he didn’t know what to do with himself. It hasn’t sunk in yet, but Izuku thinks there’s time for that.\n🥀🥀🥀🥀🥀\nIzuku closed the book, fingers resting over the ornate cover of the book. He smoothed his finger over it, smiling faintly to himself.\nNot all stories have happy endings, but, between the curse and his wretched childhood, Izuku likes to think he’s achieved some semblance of that. The simple, free joy he was feeling right now was overwhelming, unbelievable. \nThe door slammed open and his husband strolled in, the cloak Izuku made for him billowing behind him.\nIzuku’s mouth stretched further, creasing up his eyes as he stood and curtsied. “Katsuki-sama.”\n“Reading that book again?” Katsuki took his hand and rubbed his thumb over his knuckles.\n“I’m putting it away,” Izuku said, stepping closer, “where are we going?”\n“Mm.” A kiss was pressed against his forehead, and a silk blindfold was tied around his eyes. Izuku startled.\n“Katsuki-sama?”\nHis husband’s hand curled around his comfortingly, tugging him out, “trust me.”\nIzuku relaxed, content to leave everything to Katsuki. He is led out, walking for about 10 minutes before they stopped. His skin tingled from Katsuki's closeness, standing behind him and undoing the blindfold.\nHe is greeted with a vibrant stretch of pale lilac-blue and deep purple wisteria flowers, waving in the wind. The low-hanging flowers formed a lovely tunnel, and there were wooden benches lining the sides. It was a picturesque, quaint view, its design thoughtful and exquisite.\n“Do you like it?”\nIzuku took in the scene, wide-eyed and dazzled, lifting his head and turning in a round. \n“Oh,” he said, finally meeting Katsuki’s impatient eyes, “did you… plant this for me?”\n“No shit,” Katsuki knocked his forehead with a knuckle. His bright eyes were striking, compelling. “It’s yours. All these wisterias.”\n“Oh.” Izuku was enthralled by the violet blossoms, the faint, musky, exquisite fragrance they exuded, which perfumed the fresh air. He turned to Katsuki, his grin lighting up his eyes. He was in front of Katsuki in a moment, biting his lip as he thought whether it was a loss of propriety if he hugged his king like that, but gave in, gingerly sliding his arms around Katsuki’s waist and squeezing. “Thank you, Katsuki-sama. I love it.”\nKatsuki was even less worried about propriety and the attendants’ presence when he lifted Izuku’s head and kissed him. “Good.”\nThey stayed entwined under the swaying wisterias, in perfect bliss. Indeed, Izuku thought to himself, as he nuzzled his nose against Katsuki’s chest, the all-too-easy, terrifying fondness and happiness trickling through his veins like heady wine, love does breed worry and fear, but if there is someone to love, what is there to worry and fear?"
}