{
    "id": "2547755",
    "url": "https://archiveofourown.org/works/2547755?view_full_work=true",
    "author": [
        "kittebasu"
    ],
    "title": "to be first, to be best",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Haikyuu!!"
    ],
    "relationships": [
        "Iwaizumi Hajime/Oikawa Tooru",
        "Sawamura Daichi/Sugawara Koushi"
    ],
    "characters": [],
    "additional_tags": [
        "UST",
        "Oikawa is the worst",
        "Future Fic",
        "on a scale of one to garbage oikawa is non-recyclable trash"
    ],
    "language": "English",
    "series": "",
    "published": "2014-11-01",
    "completed": null,
    "words": "26,404",
    "chapters": "1/1",
    "comments": "774",
    "kudos": "30,379",
    "bookmarks": "8,222",
    "hits": "501,028",
    "summary": "<p>Hajime is apparently something of a masochist, and as he stares down at the tie-dyed AREA51 T-shirt in his hands, he thinks <i>“I’m totally in love with this asshole, aren't I?”</i></p>",
    "notes": "<p><small></small><br>((dearest riots<br>i hope you have as much fun reading this fic<br>as i had writing it for you~<br>it was like<br>boom pow gwah waaaah!!!<br>etc.))</p>\n<p>edit:// i can't believe i have to say this. but please do not copy and paste this story in full onto other websites with your own name on it.</p>",
    "text": " \n★ ★ ★\n\"Explain it to me one more time,\" Hajime says, massaging his temples. The beginnings of what might prove to be a very serious Oikawa induced migraine thrum behind his eyes as he lies flat on the floor, looking up at his childhood friend who seems far too self-satisfied for the situation.\n\"But Iwa-chan~\" Oikawa replies, eyes all wide and guileless as he looks down, like he's not the actual spawn of satan, \"I've already explained it three times!\"\n\"I know,\" Hajime says, forcing himself to remain calm in the face of Oikawa's disgusting cheerfulness. \"But I'm going to need you to run this by me one more time.\" He sits up, so he's something closer to eye-level with Oikawa, and rests his weight on his hands. \"So let's have it.\"\n\"Fine, fine, fine.\" Leaning back onto Hajime's sofa, Oikawa smears the back cushion with even more melted chocolate. It's all over Oikawa's arms and face and clothes, streaked down his neck and disappearing under the collar of his favorite 'Close Encounters' hoodie, and it's never going to come out of the upholstery. Hajime shudders to think what his mom is going to say. \"I was trying to make Christmas candy for someone special, and I blew up my apartment.\"\nSo many things about that statement are wrong. There's the fact that Oikawa was trying to do something for someone else, first of all, and then secondly, that he hadn't been successful at whatever it was he was trying to do. Thirdly, and most importantly, maybe--\n\"You blew up your apartment,\" Hajime echoes, dully. Even after four repetitions, Hajime is still struggling to comprehend how Oikawa managed to cause so much property damage just making Christmas candy. He's got the sneaking suspicion that Oikawa'd done the damage on purpose, somehow, probably for some ridiculous, melodramatic reason that only makes sense in that twisted head of his. But that's a little far, even for Oikawa. \"You blew up your apartment.\"\n\"Well, just the kitchen, really,\" Oikawa amends, lifting his arms so he can cross them behind his head, looking carefree now, nothing like when he'd shown up all kicked-puppy at Hajime's doorstep. It's a welcome change, Hajime guesses, since Oikawa is an ugly crier and Hajime's not so great with Oikawa's tears or the impulsive violence that seems to come hand in hand along with them. \"But the fire-trucks showed up,\" he adds airily, like that's not scary as hell. \"It was big-time serious. The driver was really cute though, and after she was sure everyone was safe she kept smiling at me, which is only natural, of course, because I am charming and adorable.\"\n\"Please tell me you didn't pick up a girl from the fire-department looking like that, just after setting your kitchen aflame making Christmas Day candy for someone else,\" Hajime says. \"Lie to me, Trashkawa.\"\nOikawa winks at him and brandishes his arm, displaying a neat set of numbers that are clearly the firefighter's digits on a not-chocolate-y part of the inside of his forearm. \"What can I say? I'm irresistible.\"\n\"I loathe you,\" Hajime says. It's basically a ritual, after so many years. Oikawa says something arrogant and over-the-top, and Hajime retorts as he sees fit.\n\"No you don't,\" Oikawa says. \"You love me.\"\nHajime continues as if Oikawa hasn't said a thing. \"And you're paying to have my sofa cleaned.\"\n\"I think you mean our sofa,\" Oikawa croons, a Machiavellian glint in his eye, and Hajime recalls the rest of what Oikawa had come over to tell him. It drops heavy like a loss on the court in his stomach. \"Since—\"\n\"I refuse.\" Oikawa's scheming is all falling into place now, and like most of Oikawa's opponents, Hajime is pinned under that smug, all-seeing gaze. \"I absolutely refuse.\"\n\"Since my parents have decided I can't live alone, and I'm moving in with you.\" Oikawa's hair is sticky, clumping in weird places where chocolate has congealed. When he tilts his head to the side, still peering down at Hajime playfully, it streaks his forehead like it's a marker.\n\"See, Oikawa, that's the part that I'm having the most trouble with,\" Hajime says, swallowing harshly, wanting to clench his hands into fists. Instead, his fingers just push into the wooden floor. \"Because I don't remember inviting you to live with me.\" He tries to keep his voice calm and reasonable, but he can feel that vein in his temple that seems attuned to Oikawa's bullshit starting to bulge as he clenches his jaw. \"In fact, I am one-hundred and fifty per cent sure that I would never sentence myself to something like that.\"\n\"But Iwa-chan, don't you love me?\" Oikawa is batting his eyelashes at Hajime, like Hajime is one of his little groupies that hangs out cooing over him in the stands at a competition, and Hajime's hands twitch with the urge to strangle Oikawa. \"Besides, you didn't invite me, but your parents did.\" Hajime is pretty sure he isn't imagining the beginnings of a smirk.\n\"What.\" Hajime can envision it now, his hands wrapping around Oikawa's throat and Oikawa making that startled goshawk sound of capitulation that Hajime relishes--\n\"Well, my parents called your parents,\" says Oikawa, straightening up completely and getting chocolate all over the left armrest, \"and your mom told my mom that I should just move in here.\" He grins, and Hajime hates how cute Oikawa looks when he grins. Oikawa has always been cute, even when they were scabby-kneed little kids, and Hajime has been waiting for that grin to be less effective for years, to no avail. \"It's going to be so much fun, Iwa-chan~ Two best buds, sharing an apartment. It's like a college movie.\" He hums, off-tune, and Hajime keeps staring.\nOikawa starts laughing then, and Hajime wonders if it's the combination of horror and despair on his face, or the fumes Oikawa must have inhaled while burning down his own kitchen. \"I'm a good person,\" Hajime says weakly to himself, sitting up fully and curling forward, as Oikawa continues to cackle. \"I don't deserve this.\"\n\"I'm going to go use our shower!\" Oikawa stands with that casual grace that's always made Hajime a little jealous. There's a chocolate imprint of his body in the center of the sofa. \"Also I'm going to borrow your clothes without permission, because we're so close~\"\nHajime groans, burying his face in his hands as Oikawa starts rummaging through his drawers loudly.\n\"Iwa-chan, your top drawer is stuck— Oh, never mind, I got it!\"\nIt occurs to Hajime that the only thing he keeps in his top drawer is his underwear. \"You're not borrowing my underwear, Oikawa!\" He scrambles to his feet and moves quickly toward his bedroom\n\"Are these panties?\" Oikawa shrieks delightedly. \"Naughty, Iwa-chan!\"\n\"They're just briefs, you bag of dicks!\" Hajime roars, the migraine settling in completely as Oikawa continues to laugh.\nIt isn't until later that Hajime thinks to ask about the candy. They're lying in Hajime's bed, because it's really too deep into winter for Oikawa to sleep on the floor on the guest futon, and besides, Hajime'd rather deal with Oikawa's knees digging into his thighs than Oikawa whining about how mean he is all night.\nOikawa has already slithered in too close for comfort, one of his hands inside Hajime's shirt, hot along his cold side, and Hajime grumbles but after so many nights like this as little kids and then as small teenagers, it's not anything he's not already used to. Besides, Oikawa's always been warm, and Hajime likes to take advantage of that.\n\"Who were you making chocolates for?\" Hajime asks, as Oikawa clutches him tightly. \"Do you have a girlfriend or something?\" It feels like Oikawa always just has 'girls he's seeing' in the plural: never anyone permanent, never anyone he'd give chocolates to, or anything like that. Hajime would know if there was, right? He never asks, but...\n\"Just practicing,\" Oikawa replies, breaking that train of thought, lips tickling Hajime's collarbone. \"Don't worry, Iwa-chan, I'm not replacing you.\"\n\"You're lucky I'm too tired to smack you with a nice serve to the head,\" Hajime replies. \"Don't fuck up my kitchen, Oikawa, I swear.\"\n\"I think you mean our kitchen.\"\n\"Die.\"\n\"You'd miss me,\" Oikawa mumbles, wriggling and far too awake. \"After all, Iwa-chan, didn't you come with me to college?\" There's something there. It's that thread of insecurity that Hajime still picks up sometimes, like Oikawa's not exactly sure he believes what he's saying, even if he wants to believe it.\n\"Maybe,\" Hajime allows, because he hates it when Oikawa is unsure about anything, and then closes his eyes, determined to ignore Oikawa's quiet, satisfied laugh.\n \n★ ★ ★\nHajime and Oikawa have been friends as long as long as Hajime can look back into his memories and see things clearly.\nIt's the sort of friendship that had started thanks to proximity, houses on the same street, and continued because they'd developed their shared interests together, joining volleyball after Oikawa had watched a match on television that had gotten him all excited. Hajime'd only joined because he had been unsure about what he did want to do for a club, and it had made sense to him to follow his closest friend into his new obsession. That he'd fallen in love with it too was lucky, because it meant that he and Oikawa had been able to continue on to high school as best friends, and when it came time for college entrance exams, Hajime hadn't really thought twice about following Oikawa there too.\nBut really, Hajime and Oikawa have never been much alike. They'd been much closer to polar opposites, as kids: Hajime had always been the type to feel guilty for stepping on worms when they crawled out onto the sidewalks, murmuring apologies as he walked, and a fourth grade Oikawa could often be found during summer afternoons focusing sunlight through glass to burn pillbugs alive. (\"Bugs are gross,\" Oikawa had told Hajime firmly, and Hajime had replied, \"They look like tiny aliens to me.\" Oikawa had given him a long, contemplative look, then, and in fifth grade, Oikawa had started to keep them in jars instead.) Oikawa's all blustery bravado and intense insecurity wrapped up in a suave, collected shell, and Hajime is steady and constant underneath his impatience and temper.\nOikawa is a setter who longs for the spotlight, and Hajime is an ace who doesn't mind letting him take it.\nOikawa Tooru has always, always been strange to Hajime: complicated and difficult and kind of high maintenance. Hajime is unsure, half the time, if he's even scratching the surface of Oikawa's totally twisted thought-processes, or if it's impossible to figure out anything Oikawa's actually thinking through the mess of his doubts, and all the bullshit he conjures to hide it. Hajime would like to think he knows Oikawa better than almost anyone, though, and he can't really imagine what his life would have been like without Oikawa beside him, flirting outrageously with every girl he meets, worming his way into Hajime's personal space, and being insufferably devious all the time. He's a constant in Hajime's life, like gelling his hair every morning before he leaves for the day, or choosing his favorite juice from the vending machine he always uses at the train station.\nDespite all of that, inviting Oikawa to move into his apartment is not something Hajime had ever banked on happening to him, because he doesn't hate himself.\n\"How could you do this to me?\" Hajime hisses into the phone. Oikawa is singing in the shower, loud enough that his mom can probably hear it on the other end of the line, and she's just laughing.\n\"Oh, Hajime, you've always adored Tooru, and his mother feels so much more comfortable now that she knows you'll be looking out for him.\"\n\"What about my privacy?\" Hajime asks.\n\"Do you need privacy for some particular reason, Hajime?\" his mother asks archly, and Hajime grumbles in mild defeat.\n\"You know he's a grown man, right?\" Hajime says, deliberately not thinking about the chocolate he can't get out of his upholstery. He should have purchased something with washable fabric in preparation for Oikawa's inherent foolishness, because grown man or not, Oikawa is a menace. \"At least as grown up as I am. I know he set his kitchen on fire, but everyone makes mistakes. He's not a little kid.\"\n\"I know,\" his mother says, and then her voice gets a bit quieter. \"But Tooru gets lonely, I think. That's why I really agreed with his mother about you boys sharing an apartment, and you… you've always been good with him, son.\"\nOikawa sings a particularly high-pitched note, right after the water shuts off, and Hajime grimaces, but he can feel a laugh bubbling up in his chest, too. \"Yeah, okay,\" he says, as Oikawa walks into the bedroom, wearing a towel and nothing else.\n\"Get dressed,\" Hajime says, but Oikawa immediately moves toward Hajime instead, snagging his phone out of his hands and bringing it up to his red, freshly showered cheek.\n\"Mama Iwaizumi? Is that you?\" Water collects in his clavicles, and Hajime hadn't noticed Oikawa had gotten so thin. He wonders if the brat eats enough to make up for all the extra hours he puts in at the gym, when he's not busy going to nightclubs with his freshly legal ID or pestering Hajime. \"I'm great, and how are you?\"\n\"Stop flirting with my mom,\" Hajime says, on reflex, even as his eyes follow a trail of water down Oikawa's stomach until it dips into his navel. Then his gaze flicks back up, to see that Oikawa is watching him, with this complicated, unreadable look. Then he grins, unrepentant, and grips his towel a little tighter with his free hand.\n\"Iwa-chan's so grumpy lately though,\" Oikawa says, and Hajime can hear his mom's delighted chuckle. \"I think he's developed an addiction to coffee and it's making him moody.\"\n\"I'll show you grumpy,\" Hajime growls, cracking his knuckles in warning.\n\"Oh, looks like I have to go!\" Oikawa says, grabbing a pair of underwear from his still half-packed suitcase, spilling socks out onto the floor, and tossing Hajime's phone back to him with his other hand. Distantly, as he scrambles to catch his phone, Hajime is impressed with the coordinated athleticism Oikawa displays in that complicated escape.\n\"Mom?\" He brings the phone back up to his own ear. It's damp, and it smells kind of like Oikawa's fruity shampoo.\n\"Tooru's such a sweet boy,\" his mom says, adoringly, as Hajime scowls in the direction Oikawa had fled.\n\"If you say so,\" Hajime dubiously replies, picking up some of the socks and dropping them back into Oikawa's suitcase. \"He's making a wreck of the place. Nothing sweet about all his dirty clothes everywhere.\"\n\"You sound more lively.\"\n\"More lively, or more aggrieved?\" Hajime's scowl is fading, though, mostly because he's noticed that the socks he's just picked up are patterned like the galaxy. That's so Oikawa. His lips twitch. \"The jury might still be out.\"\n\"You get lonely, too,\" she says. \"Don't you remember in third grade when we went on vacation, and you cried because Tooru couldn't come?\"\n\"No,\" Hajime says. \"I don't remember that at all.\" He pauses, then, just to be safe: \"And Oikawa better not suddenly remember it either, Mom.\"\n\"All right, all right,\" she says. \"Take care, Hajime.\"\nOikawa is lounging in the kitchen in nothing but his underwear, his feet up on the kitchen table. He's always had really long legs, and they don't belong on the table.\n\"Feet,\" Hajime says, turning away from his mostly nude friend, his throat feeling oddly tight. \"Off.\"\n\"Are you my babysitter, Iwa-chan?\"\n\"No,\" Hajime says, \"but I'm going to feed you anyway.\" He looks over his shoulder to see Oikawa has folded himself forward, arms on the table now instead of legs. He's giving Hajime the softest of his smiles, the one he saves for when he thinks no one's looking. It's the one Hajime likes best, because Oikawa will smile for anyone, but he does not often mean it.\n\"Aw, Iwa-chan, you love taking care of me,\" Oikawa purrs, his eyes bright and happy. Hajime's chest goes tight, and he looks away quickly.\n\"You can sleep outside,\" he deadpans in reply.\nOikawa laughs really loud and horrible, and Hajime has to fight back a laugh of his own.\n \n★ ★ ★\nIt is a truth universally acknowledged that one day, Iwaizumi Hajime is going to snap and smother Oikawa Tooru in his sleep.\nIt's always been a real danger, Hajime thinks faintly, surveying the disaster that is his living room after two weeks living with Oikawa. ET plush toys have taken up residence on his couch and a pile of oddly weighted volleyballs is blocking the front entryway, and Hajime has bruises on both of his shins from tripping over them. Not to mention the way Oikawa stays up way too late, watching movies that leave Hajime petrified, and then falls asleep in the middle of Hajime's bed so that there's barely any room for him. At least that'll be solved soon— Oikawa's stuff is supposed to arrive this weekend. \"It's hard to get movers on short notice, Iwa-chan~\" Oikawa had told him, when Hajime had grumbled and threatened to kick him in the head if he didn't sleep on the floor. \"You wouldn't want my serve to suffer from back pain!\"\nAnd there's also the usual Oikawa stuff— the constant put-on smugness and the irregular eating hours and the way he comes home at four AM on Saturday nights smelling like cheap tequila. The last thing is sort of new, but Hajime has already filed it into the bulging folder in his head with Oikawa's name stamped on the outside of it: a seemingly endless collection of all of his best friend's idiosyncrasies.\nAlso, Oikawa seems to have a vendetta against Hajime doing anything productive, the fucking brat.\n\"Get off me,\" Hajime says, with no real fire, when Oikawa captures him one afternoon about thirty seconds after he walks in the door and drops his backpack and practice sneakers in the foyer. After all, it's not like Oikawa is going to listen. He never listens, not about anything that sounds like an order, ever, not even when Hajime is just trying to keep the team's setter from injuring himself overpracticing. Oikawa only hears what he wants to hear, most of the time. Still, Hajime puts up a token effort at protest. \"I'll stab you with this pencil, Oikawa.\"\n\"Iwa-chan, you didn't even sound angry,\" Oikawa says, his arms looping around Hajime's neck in a hug that's strangely similar to a chokehold. \"You're losing your touch.\" His chest presses against Hajime's back, and the sudden warmth has Hajime leaning back despite himself. He hates winter, and Oikawa's really big and warm behind him. \"Let's go to the movies.\"\n\"I'm doing my homework.\" Hajime grips his pencil tightly in defiance. He's not letting this happen again. Not today. \"You know, because I came to college to do more than just flirt with my female professors and play volleyball.\"\nOikawa's chin is digging into his shoulder. \"That's why you don't have a girlfriend,\" Oikawa says. \"All work and no fun make Iwa-chan a dull boy.\" His lips tickle Hajime's ear, and Hajime flinches. \"Play with me.\"\n\"You're a nuisance,\" says Hajime. \"Why don't you call Ushijima or something? You guys are BFFs now, right?\" He would never call Ushijima, personally, but Oikawa seems to thrive on the danger of it, chuckling evilly every time he can make Ushijima show an emotion besides superiority, even if that emotion is all-consuming rage. Hajime doesn't get the thrill, but Oikawa's always been weird as hell, and Hajime is at least used to that.\n\"Ushiwaka-chan is my rival,\" Oikawa whines childishly, right into Hajime's eardrum. Cringing, Hajime tries to lean away, but that just makes Oikawa grip him tighter. Hajime's spine presses into Oikawa's breastbone. \"I'll never be friends with him.\"\n\"I'm not sure Ushijima is friends with anyone, but I'm sure you are especially not in the running,\" says Hajime, and Oikawa's indignant huff almost makes him smile before he remembers he has work to do. \"I'm busy, Oikawa.\"\n\"Everyone's busy,\" Oikawa says. \"But it's no fun to watch sci-fi movies by myself. Half the fun is watching other people get scared.\"\n\"There's something wrong with you,\" Hajime mumbles. \"Ask out one of the hundred girls in your cell phone or something.\"\n\"I called the fluffy girl in my chemistry class—\" Hajime has no idea who that is, and he's not sure if he's supposed to or not \"—and she was too busy today, too.\"\n\"So I'm just your backup plan?\" Hajime sets down his pencil, a prelude to defeat in the face of Oikawa's gentle enthusiasm. \"Oikawa…\"\n\"No, you're not my backup plan,\" Oikawa says, loosening his hold on Hajime's neck. Hajime immediately misses the warmth, and Oikawa takes a startled breath when Hajime leans back a little further to reclaim it, as though he hadn't expected him to like the touch or invite it. \"I just thought you'd say no, so I asked someone who was more likely to say yes than you.\"\n\"Do I ever really tell you no?\" Hajime asks, giving up completely on his homework, and turning his head just enough to look at Oikawa out of the corner of his eye. \"Honestly, Oikawa.\"\nOikawa bites his lip.\n\"You don't,\" he says, taking a moment longer than Hajime expects to answer. \"But sometimes you want to.\" Hajime's eyebrows furrow at Oikawa's tone, because it's almost... Then Oikawa laughs, a light chuckle, and releases Hajime completely, only to plop down next to him on the floor where Hajime has his Econ homework spread around him like a casino card table. Papers fly up and out of order, and the muscle in Hajime's jaw twitches. \"I know Iwa-chan's favorite thing to do is spend time with me, though~\" His teasing grin returns, curling up the corners of his mouth, and his eyes sparkle, like Hajime has just read his toss and shot a game-winning spike through two blockers.\n\"On what planet?\" Hajime grumbles, fixing his papers aggressively as Oikawa chuckles.\n\"Maybe on Mars.\" Oikawa dips back into Hajime's personal space, his hand resting on Hajime's thigh as his lips twitch with amusement. \"Which is where that new sci-fi movie I want to watch takes place. What a funny coincidence that it's premiering tonight at Movix.\"\nAlien movie. Hajime sighs and knows he's already lost this battle. And probably the war. One always loses the war with Oikawa, on or off the court. \"If you let me finish this and my reading, we can go.\"\n\"Deal,\" Oikawa says, and Hajime expects to fight tooth and nail to get his worksheets done, but Oikawa wanders off, and doesn't come back until Hajime has packed up his notes and curled up on the sofa with his reading, which is really just a ten page PDF he'd printed at the school library about how to source foreign language texts.\nOikawa does bounce down on the couch, then, sliding until his head is on Hajime's lap and his feet stick out over the edge. \"Wake me when you're done,\" he mumbles, his face pressed into Hajime's belly, and Hajime sighs, shifting just enough that his lap will be more comfortable for Oikawa. He uses his free hand, the one not holding the stack of stapled papers, to card easily through the mess that is Oikawa's hair.\nHe contemplates, for a moment, how used to Oikawa's antics he is. How used to the violations of personal space and endless demands for attention and time he's become. Something about Oikawa has always screamed notice me, and somehow, Hajime doesn't really mind it, for all the fuss he puts up.\n\"More to the left, Iwa-chan,\" Oikawa says, mouth catching on Hajime's shirt and leaving a wet spot with spit. \"It itches there.\"\n\"What are you, a pet?\" Hajime says, but he moves his hand a little to the left. He dozes off like that, his hand buried in the warm brown mess of Oikawa's hair, and thinks maybe not all the parts of this whole 'living together' thing are bad.\nHajime doesn't realize until later that it's Valentine's Day.\n \n★ ★ ★\nHajime loves volleyball practice. It's his favorite part of every day, where he's finally allowed to let out all of his stress from daily life on poor, unsuspecting volleyballs and maybe a few equally unsuspecting and hapless third string receivers who haven't yet learned to fear the strength of his spikes.\nToday, though, not even volleyball is enough to distract him from his frustration. Mostly because his frustration can mostly be summed up in the one-hundred and eighty-five centimeters of asshole doing practice serves at the net closest to him.\n\"Someone looks five seconds from strangling Oikawa,\" Sawamura says, as Hajime pulls up his knee pads. \"Practice hasn't even started yet, Iwaizumi.\" The former Karasuno captain pulls up his own knee pads and offers Hajime a crooked smile. \"You look like Kageyama.\"\n\"Do you ever wonder,\" Hajime asks, \"what you might have done in a past life to deserve something terrible happening to you now?\"\nSawamura pauses, tilting his head sideways as he contemplates Hajime anew. There's something very piercing about Sawamura's gaze— it's not like that of Sugawara, Sawamura's frequent companion, whose gentle stare always leaves Hajime feeling like someone's perusing all of his thoughts at leisure (and then also maybe giving him a hug), but it's thoughtful enough that Hajime scowls in response to it. \"I know we haven't been on the same team long enough for me to really say this, but… What has Oikawa done now?\"\nHajime picks up a stray volleyball when it rolls to a stop at his toes. He looks down at it, and spins it, before he looks back up at Oikawa, who is laughing and patting one of their regulars on the back, a pleased expression on his face. His smile is genuine right now, his face flushed and sweaty, and Hajime can see all of his straight, white teeth. Oikawa's stupid-pretty, sometimes. Hajime knows that's eighty percent of why the girls love him. That and the fact that they don't know he's trash, like Hajime does.\nHajime looks back down at the ball in his hands again, and narrows his eyes.\n\"Um,\" Sawamura says, and Hajime turns back to him. \"Please don't throw that at him. The spring tournament is coming up and you look mad enough to give him a concussion.\"\nHajime squeezes the ball in his hands. \"I'm not going to throw it at him,\" he says. \"I'm going to pretend it's his head and squeeze it until it pops.\"\n\"Okay then,\" Sawamura says, leaning forward to check his shoelaces. He's so calm in the face of Hajime's pent up rage, and Hajime guesses captaining a team like Karasuno, with so many loud wild card members, will do that to a man. \"I'm going to venture a guess and ask if this is about Oikawa moving into your apartment?\"\n\"Did you know that Oikawa finally had a bed delivered three days ago?\"\n\"That must be a relief.\" Sawamura stands up to stretch. Out of habits formed from long years of team sports, Hajime immediately stands to join him, moving away from the pushed in bleachers. \"Gets him off the guest futon, right?\"\nHajime gives Sawamura a flat look. \"Out of my bed, you mean.\" Sawamura, with his hands linked together, palms up over his head, makes a sound of acknowledgement. \"While I'm also in my bed. Like we're ten.\"\n\"Well, it works in a pinch, right?\" Sawamura smiles at him, and leans left, then right, the first cadence in the traditional team warm up. That's something different from high school. Back at Seijou, everyone had come and left practice mostly together. Now they wander in at different times, warm up and do individual and partner work, and then start team practice at seven. \"Suga and I…\" He pauses, and then bends forward to stretch his hands to his toes. Hajime notes that the back of his neck is pink. \"Well, we can fit. In a pinch.\"\n\"Yeah,\" Hajime says. \"It was fine at first. But—\" He bends forward too, and when he straightens, Sawamura is smiling at him crookedly.\n\"But you're glad the bed came?\" Sawamura catches his left arm in the crook of his right elbow for his next stretch. His eyebrows are knitted together, like he doesn't know where this is going.\n\"I would be,\" Hajime says, \"if Oikawa would sleep in it.\" He squeezes his hands into fists. \"But he won't. Iwa-chan, it's cold, he says, like he doesn't have a million blankets. His grandmother personally quilted at least four of them.\"\n\"Ah,\" Sawamura says. \"I see.\"\n\"It's not just that,\" Hajime says. \"It's…\" He scowls. \"He's up to something.\"\n\"Up to something?\" Sawamura's expression has changed from perplexed to bemused. \"Isn't Oikawa always up to something, though?\"\n\"Up to something with me, specifically,\" Hajime replies. \"When we started college, we didn't see each other every day anymore. Not like high school, you know? Maybe only once or twice a week, and then on the weekends he'd come over to distract me from my work. Now though, since the whole kitchen-fire-moving-in-thing, he's been more…\" Touchy? Clingy? \"Omnipresent?\"\n\"Could that just be because you live in the same place?\"\n\"No,\" Hajime says. \"It's not. It's something else. It's not just at the apartment. It's other places, too.\" He rubs the outsides of his arms in frustration. \"He's acting… weird.\"\nSawamura looks sort of skeptical that Oikawa might possibly be able to get weirder, which Hajime would normally be on board with. But Sawamura hadn't woken up this morning with Oikawa staring straight at him, hands clutching the sheets and mouth tight with unhappiness.\nHajime is off-balance, and as usual, it's all Oikawa's fault.\n\"I mean, you could ask him about it?\" Sawamura shrugs when Hajime rolls his eyes. \"That's what I'd do.\"\n\"If Oikawa wants me to know something, he tells me. If he doesn't want me to know, he talks around it.\" Hajime cuts his gaze back to the setter and is surprised to find Oikawa is staring back at him. Oikawa sets one last toss for a blond second-string player (Kamasaki, Hajime reminds himself, from Dateko) but he keeps his eyes on Hajime. \"Oikawa's such a creep.\"\n\"You guys are so close,\" Sawamura replies, laughter in his voice, and Hajime rolls his eyes.\n\"As close as a normal person can be with a pit viper, I guess.\"\nSawamura laughs aloud, then, and Oikawa spins a volleyball in his hands as he walks over to join them. \"Are you just going to talk, or are you going to hit tosses today, Iwa-chan?\"\n\"I've only been here for ten minutes,\" Hajime replies. \"Which you should know, since you've been watching.\"\n\"I keep an eye on all my players. How else would I know you didn't warm up enough so I shouldn't give you any high tosses until I've made you run around first?\"\n\"You're not captain anymore,\" Hajime points out, feeling obstinate. Sawamura looks far too amused, bouncing from heel to toe to stretch out his hamstrings, his arms crossed in front of him.\n\"It's only a matter of time.\" Oikawa catches the ball and tucks it under one arm so he can casually buff his nails, the smug bastard. \"And where's Refreshing-kun today?\" he directs at Sawamura, who blinks twice in surprise.\n\"Ahh, Suga's off tutoring this afternoon,\" Sawamura says. \"Adopted a struggling second year.\"\n\"How unnecessarily altruistic and yet expected,\" Oikawa says, smiling. Then his expression gets more serious. \"Refreshing-kun should come to all the practices, though, otherwise it’s a waste of those good eyes.\"\nSugawara doesn't play for their team, but often comes to practice anyway, watching their moves and offering soft observations to some of the second string players. Sugawara's better than all the rest of their reserve setters, and Hajime's asked Sawamura more than once why Sugawara doesn't play. He'd thought it might still be the sting of playing second string to Kageyama in high school. When Hajime had asked Sugawara, though, Sugawara had grinned at Hajime and told him there were definitely still things Kageyama had to learn as a setter from his upperclassman, and Hajime had let that train of thought die. After all, it's not like everyone else is as childish as Oikawa, and it's probably for the best.\n\"I'll tell Suga about the great Oikawa's compliments.\" Sawamura's laughing outright now.\n\"Sugawara's not me, of course, but isn’t too bad.\" Oikawa's eyelashes flutter briefly, and Hajime refrains from elbowing him in the gut by the skin of his teeth.\n\"Suga's a lot less of a handful than you are,\" Sawamura agrees, and Oikawa's expression sharpens.\n\"Oh, I'm sure Sugawara's more than just a handful,\" says Oikawa, low-voiced and eyebrows lifting, and Sawamura's mouth drops open in surprise before his whole body blushes a dark red. Hajime doesn't get what Oikawa means, but Sawamura clearly does, and whatever it is, it's making him uncomfortable. Typical Oikawa.\n\"All right, let's go,\" Hajime says, catching Oikawa in a loose chokehold and dragging him off, nodding to Sawamura as he does.\nHe waits until after Oikawa has warmed him up with a few light tosses before he stops and puts his hands on his hips. \"Why were you picking at Sawamura?\"\n\"You get along with him really well,\" Oikawa says. It's off topic.\n\"Yeah, I guess,\" Hajime says. \"We both like volleyball. He's calm, too.\"\n\"Do you prefer calm people, Iwa-chan?\" Oikawa sends him a high toss, suddenly, and Hajime has to jump for it.\n\"Some warning next time, Oikawa!\" The ball hits the center of his palm nicely. Oikawa's tosses are beautiful, even the spiteful ones. The smack of the ball on the gym floor is as loud and certain as Hajime's spikes usually are.\n\"You don't need it,\" Oikawa replies. \"Warnings from me about tosses. You hit everything I give you. You're the only one who can do that.\" He quirks a grin, his face shiny with a thin layer of sweat, and his hair is wet-dark and sticking to his cheeks.\nHajime's gut clenches, and he licks his lips. \"Not just calm people,\" he says, feeling like he's missing something.\nOikawa tilts his head to the side. \"Hmm?\"\n\"Sometimes I like calm people,\" Hajime says. \"But sometimes I like selfish brats with bad personalities.\"\nHe looks away from Oikawa then, because he feels hot and anxious, and also because he knows that Oikawa is going to give him one of those arrogant, self-satisfied smiles that make his eyes glimmer. That expression on Oikawa's face always leaves Hajime with a strange tightness in his chest, and team practice is about to start.\n\"That's fine then,\" Oikawa says, and Hajime hears the sound of palm to ball even if he's not looking, and jumps exactly where he likes to hit. It's not one of those pinpoint tosses Karasuno uses so frequently on the court, but it's perfect anyway. He spikes it full strength, and grins when it lands exactly where he’d intended.\n\"What's fine, you weirdo?\" he says, as their coach blows a whistle, calling them to attention. Oikawa's lips are twitching. He's cute, the fucker. Hajime bumps Oikawa's arm with his shoulder. \"You don't ever need to be jealous about me,\" he mumbles behind one hand as their coach runs through today's group practice schedule, taking a stab in the dark.\n\"Iwa-chan, talking while the coach is talking? So irresponsible.\" Oikawa's eyes are averted, which means Hajime was probably right.\nHajime's about to reply when coach pins him like he's a corkboard note with his gimlet stare. \"Iwaizumi. Laps.\"\nOikawa titters and Hajime sighs, resigned. \"Yes, coach,\" he says, and pulls out to run, returning Sawamura's not-so-pitying grin as he begins.\nAfter practice, Oikawa picks a fight with a second year about his unibrow while Hajime helps the others return the volleyballs to their baskets. Sawamura helps, laughing as he does. \"You know, I haven't had to do this in years.\"\n\"Me either,\" Hajime says. \"I think I got kinda spoiled as an upperclassman.\" He looks over at Oikawa, who still hasn't picked up a single ball, and is now laughing at the second year he's agitated all the way to metaphorical steam coming out of his ears. \"Not as spoiled as that guy, though.\"\n\"Well, captains on Karasuno's team aren't picked by skill,\" Sawamura says. \"Ennoshita, Karasuno's captain, only became a starter this year. He's not the best player on the team or even the most admired. But he's got leadership skills.\" He picks up another ball. \"So maybe I don't have Oikawa's ego to worry about.\"\n\"He's not really…\" Hajime hesitates. \"It's not what you think, probably.\"\nSawamura is amused again. \"You've been friends with him a long time, Iwaizumi. I'm sure you wouldn't be friends with someone who wasn't a good person.\"\n\"Oikawa is trash,\" Hajime says, reflexively, and Sawamura blinks at him. \"But, I mean. Good trash. Probably.\"\n\"Lots of 'probably's.\"\n\"It's hard to know what Oikawa's thinking. He's very good at hiding things.\"\nOikawa comes over to help when there are only a few balls left to pick up, having finally riled up his second year to the point of being restrained by the team's vice captain, and Hajime glares at him. \"So kind of you to join us.\"\n\"You guys looked like you were having so much fun doing menial labor that I didn't want to intrude,\" says Oikawa. Hajime growls. \"Besides, that second year's girlfriend has a crush on me, and I had to rub it in.\"\n\"That's awful,\" Hajime says bluntly. \"You probably encourage that, too, because you're an asshole.\"\n\"He thinks I shouldn't be setter,\" Oikawa says, voice dropping into a lower tone. \"Because he was theoretically next in line to become starting setter, and that skill doesn't matter. And I think he should shut up.\"\nHajime puts his hand on the back of Oikawa's neck. \"So your solution is to seduce his girlfriend?\"\n\"I don't need to seduce her,\" Oikawa replies. \"She's a grown woman who can make her own decisions. I can only remind her that I am far more attractive and talented and better in every way, and that she should probably upgrade.\"\n\"Boyfriends are not phones,\" Sawamura says, eyebrows pushed together, perplexed.\n\"Also you probably don't want to date her,\" Hajime adds.\n\"She can still do better,\" Oikawa says. \"He has one eyebrow.\"\n\"Looks aren't everything.\"\nOikawa gives Hajime a soft smile. \"Someday someone will have a crush on you, Iwa-chan, don't worry.\"\n\"It's easier to kill you in your sleep now that we live together,\" Hajime tells him, squeezing his hand into a fist, releasing, and then squeezing again. \"As a reminder.\"\n\"Scary,\" Oikawa says, not sounding very afraid at all, meeting his eyes.\nTalking about sleep, though, reminds Hajime about the bed situation, and about everything else that had been bothering him before practice, and he looks away first.\n\"Ah, Sawamura, convey the message that I expect Refreshing-kun at practice tomorrow,\" Oikawa says sweetly, with much less of that focused intent that had colored his words earlier, and Sawamura blushes again, but he does smile. \"Sugawara should be my backup setter.\"\n\"I'll let Suga know,\" he says, and Hajime looks between them, still confused, but Sawamura doesn't look upset and neither does Oikawa, so it's nothing Hajime has to worry about.\nThey finish up quickly, and Hajime stays behind to apologize to the coach for talking during practice. The coach waves him off, not looking all that upset. \"Don't let Oikawa distract you, next time,\" he says, and Hajime stumbles over his reply of \"yes, coach,\" before he retreats toward the locker rooms.\nOikawa's waiting for him at the double doors of the gym. \"What?\"\n\"Making sure you weren't in any trouble.\"\n\"If I were, wouldn't it be your fault?\"\n\"I was cheering for you as you ran laps, Iwa-chan. Silently cheering.\"\nHajime offers him a flat look as they enter the locker rooms. Most of the team's already cleared out, since it's a Tuesday practice and everyone's guaranteed to have assignments to work on, Hajime included. He sighs and drops his bag, sinking down to a bench to take off his knee pads.\nOikawa sits next to him, much too close, and rests his head on Hajime's shoulder. His cheek is soft and warm. \"What's with all the scowling and sighing today?\"\nYou're acting weird and I don't even get why all of a sudden, Hajime thinks, but he says: \"I'm leaving practice, and yet that doesn't mean I'm free of you.\" He stands up, and lets Oikawa's head rest on nothing, overbalancing him. Oikawa's got great reflexes, though, and catches himself.\n\"You know, plenty of people vie for my attention, Iwa-chan.\"\n\"Then go hang out with one of them,\" he grumbles, and Oikawa laughs, knowing what he's said even if half of it has gotten lost as Hajime yanks off his shirt.\nHajime meets one of Oikawa's more troublesome grins when he throws his shirt toward his bag and starts to yank down his exercise shorts. \"But none of them are stripping,\" Oikawa's eyes gleam with mischief, and Hajime's cheeks start to burn as Oikawa purposefully lets his gaze slide down to Hajime's chest and then his stomach. \"Iwa-chan is so virginal, too, it makes a man feel special.\"\n\"You're so gross,\" Hajime says. \"Also who said anything about being a virgin? just because I didn't sleep with every girl who looked at me the first month of college like some people I could name--\"\n\"Only the ones that smelled like flowers,\" Oikawa corrects. \"It made me feel like Casanova.\"\nHajime resists the urge to bop his friend upside the head. \"Are you really gonna act this perverted around the team?\" he asks, but when he looks around, he realizes they're the last ones in the locker room. \"Who were you even putting on a show for, then?\"\n\"I'm not the one putting on a show,\" Oikawa lightly replies, his smile angelic. Hajime has never been fooled even once by that act.\n\"I'm going to take a shower.\"\n\"In your underwear?\" Oikawa pulls up the hem of his own shirt. \"Don't worry, I'm sure your mom wrote your name in them.\"\n\"It was one pair!\" Hajime does his best not to react to Oikawa's jibes, but it's basically reflex, he can't help it. \"And I was thirteen!\" He grimaces. \"Is that why you were going through my underwear drawer? To see if I still had my name on the inside?\" He wouldn't put it past Oikawa. \"Or…\" he narrows his eyes, \"were you planning to do the writing?\"\n\"For shame,\" says Oikawa. \"How could you accuse me of something like that, Iwa-chan? You should trust me like I trust you.\"\n\"I trust you as far as I can throw you.\"\n\"How far is that?\"\n\"You wanna find out?\" Hajime purses his lips.\n\"You shouldn't be mean to me, Iwa-chan. Don't you know I'm perfect?\" Oikawa flutters his eyelashes, and Hajime wonders if they're long enough for him to grab them and pull them out.\n\"You set a picture of Kageyama bowing to you as your phone wallpaper,\" Hajime replies, collecting his towel and body soap from his bag after kicking his sweaty practice clothes aside. \"Clearly you have no shame.\"\n\"Nothing gives me more joy than humbling Tobio-chan,\" Oikawa says, his smile going sharp. \"Except maybe humbling Ushiwaka-chan.\"\n\"I think we're still waiting on that one,\" is Hajime's dry answer, and Oikawa huffs, running a hand through his messy hair. \"Better stick with the victories you're able to get over Kageyama.\"\n\"I would definitely write Tobio-chan's name in his underwear.\"\n\"This is why everyone thinks your personality sucks,\" Hajime says. \"It's because it does.\"\n\"There's no space to write a name on yours now, since they're so small—\"\n\"They're just briefs, Oikawa!\" It echoes in the locker room, along with Oikawa's laughter.\n\"I like your flustered face best,\" Oikawa says, and Hajime grabs his towel and puts it around his neck to hide the inexplicable blush that's definitely heating up his neck. \"It's when Iwa-chan is the cutest. All the girls would like you if you always looked like that.\"\n\"Shut up, shut up!\"\nHajime pushes into the showers, taking off his underwear with his back to Oikawa and turning the water on full blast. Oikawa's feet slap loudly on the tile as he takes the showerhead next to Hajime, humming tunelessly.\n\"Hey,\" Oikawa says, and Hajime looks over in acknowledgement. Oikawa has his head tilted back, water running down his chest, his hair soft and wet. His eyes are closed.\n\"Yeah?\" Hajime asks.\nOikawa reaches over and pushes Hajime's hair out of his eyes, long fingers tangling in damp strands, and then his hand cups Hajime's cheek. The bottom drops out of Hajime's stomach. \"You really are cute when you're flustered,\" Oikawa says, with steady, serious eyes. His hand drags lower, along Hajime's neck, and stops at his shoulder. It tickles, maybe, or at least makes the goosebumps rise on Hajime's skin in its wake.\nHis hands are rough, Hajime, thinks, and warm even in comparison to the hot water that is hitting him. \"Oikawa?\" He chokes on his friend’s name, his gut all twisted up, and Oikawa is staring at him steadily, the strangest look in his eyes. When did he get so close? His thumb rubs circles against Hajime's collarbone, and Hajime can't seem to catch his breath as Oikawa's exhale blows against his wet forehead. \"What are you…\"\nOikawa's hand drops, and he looks away. \"Still not as cute as me, though,\" he says, returning to his own shower, and Hajime had almost forgotten they'd been talking, distracted by whatever reaction he's having to Oikawa right now. It's just Oikawa, Hajime tells himself.\n\"You've been acting wrong,\" he says, rinsing the soap from his body, and Oikawa blinks at him, surprised. The water's caught in his eyelashes, and it's one of those rare genuine emotions on his face, making him look actually sweet instead of just pretending.\n\"Wrong?\" Oikawa arches a brow, the surprise gone and replaced by something Hajime can't read at all. The steam is starting to fog up the shower, so he can't see Oikawa's face as clearly, anyway. \"Whatever could you mean?\"\n\"Never mind,\" Hajime says, not liking the tone of Oikawa's voice. \"I'm just…\" He turns off the water, his heart still beating fast, Oikawa's hand still a ghost on his shoulder. \"I'm done.\"\n\"Don't wait up for me, Iwa-chan~\" Oikawa says, and Hajime can feel Oikawa's eyes boring into his back. \"I'll be home late tonight.\"\n\"Right,\" Hajime says. \"Sure.\"\nHajime pointedly doesn't think about Oikawa's hand on his skin as he's getting dressed, or as he's walking home. He doesn't think about Oikawa's hot breath on his forehead as he's making rice, and he doesn't think about that unidentifiable intense look on Oikawa's face as he works on his homework. He definitely doesn't think about the way Oikawa had seemed so serious, voice so low and heavy, as he brushes his teeth.\n\"Fucking Oikawa,\" Hajime mutters to himself as he gets into bed around midnight. \"What's he even doing?\"\nOikawa doesn't come home until almost four in the morning, loudly shucking his shoes and bumping into everything as he works his way back toward the bedroom, waking Hajime up with the noise. He opens the door slowly, peeking in, and Hajime blearily watches Oikawa pull off his sweater and jeans, and then fumble with the clasp of his wristwatch.\nOikawa looks at his own bed for a moment, and Hajime briefly thinks he'll get in it, but then he's slowly coming over to Hajime's bed, and Hajime sighs, pulling back the covers for him without complaint.\nThe smell of liquor sticks to Oikawa as he crawls into Hajime's bed. Hajime's heart hiccups at the smooth brush of skin, Oikawa's arm sliding across his chest. His hair, wilder than usual, tickles at Hajime's lips and chin. He feels hot, and it's still winter, so Hajime doesn't protest when he snuggles in closer.\n\"Where've you even been, Oikawa?\" Hajime asks. \"It's a Tuesday.\"\nOikawa mashes his cheek to Hajime's. \"Iwa-chan, always pretending to be my mom.\"\n\"Cut that out,\" Hajime says. \"I'm allowed to worry about you, since you're a total flake. I don't know why I bother, since you were probably just out flirting with girls.\"\n\"Just one,\" Oikawa says. \"Firefighter.\"\nHajime rubs at his eyes. \"Her again?\"\n\"Yep,\" Oikawa says, intoxicated slur to his words. \"Her again.\"\n\"Oh,\" Hajime says, and for some reason, he finds it hard to get back to sleep.\n \n★ ★ ★\nThey win their next match. Oikawa is in top form, taking the other team's defense apart until their offense can't possibly close the gap.\n\"I thought it was super fun,\" Oikawa says, when Hajime mentions he didn't have to be that brutal, holding his hand out for their customary post-game high-five anyway. \"I haven’t had that much fun since I told Kunimi the storage closet was haunted.\" Hajime shrugs, because Oikawa's right, that had been fun.\nHajime's about to leave the gym and follow the rest of his team back out to the changing rooms when he hears someone call his name.\n\"Iwaizumi?\" Hajime turns around to see a woman waiting for him, her hands clasped in front of her. Her hair is in two ponytails on either side of a really cute face. She's staring at his neck instead of his face.\nHajime exhales. She has a confession letter, he notices, white with a pink stickered heart to seal it. She probably wants him to pass it on to Oikawa for her.\nShe bites her lower lip. \"I'm Kawasaki Mayumi,\" she says. \"We're in business class together.\" They are, Hajime realizes. The new semester has barely started, so Hajime's having a hard time keeping track of all the new people in his classes so far. \"I was wondering if you would…\"\n\"I can give that Oikawa for you, sure,\" Hajime interrupts, gesturing to the letter. She's not really Oikawa's type, which is too bad, because she's adorable. Hajime likes the pull of her lips, because she looks like she smiles a lot, and her hair is kind of wild, like Oikawa's, thick and soft.\nShe blushes a tomato red. \"It's…\" She swallows. \"It's not for Oikawa. It's for you.\"\nHajime gapes. \"For me?\"\n\"Yes,\" she says, still blushing, and she holds the letter forward. \"Please read it.\"\n\"Okay,\" he says, taking it numbly from her hands. She grins at him, lopsided and pretty, and then leaves. Hajime walks back to the changing room in a daze, the letter in his hand.\nOikawa looks up first, and then his eyes fall to the letter, his grin turning shark-like.\n\"Confession letter? Iwa-chan, so popular.\"\n\"Look who's talking,\" Hajime replies, running his thumb over the heart seal.\n\"Was she cute?\" Sawamura asks, and Hajime thinks about those two ponytails and that oddly familiar grin.\n\"Yeah,\" Hajime says. \"Really cute.\"\nWhen Hajime looks back up at them, Oikawa's grin has gone sharp. \"Going to read the letter?\"\n\"I should,\" Hajime says. \"We have a class together. it would be rude to ignore it.\"\n\"Baby is all grown up,\" Oikawa teases, as Sawamura chuckles into his hand. \"Even dinosaurs can get admirers. I'll teach you all about how to manage your social calendar, Iwa-chan, even if it'll never be as full as mine.\"\n\"His modesty is inspiring,\" Sawamura murmurs, as Hajime glares Oikawa down.\n\"I'll kill you, Oikawa,\" he says, thinking of all the letters Oikawa has gotten since they were thirteen. This one, though, is for him, and it's a rare enough thing that Oikawa teasing him about it isn't such a big deal, really.\nHajime waits until he's alone to read the letter. It's pretty standard stuff, about how she'd like to get to know him better and admires his play and stuff. At the bottom, she's written her contact number, in cute even print with her name kanji underneath.\nHajime can hear Oikawa banging around in the kitchen, hopefully not destroying anything, and the loud noise of a professional volleyball match on the television. If Oikawa's busy, it's probably safe to call.\nHe picks up his phone, and punches in Kawasaki Mayumi's cell phone number.\nLater, Oikawa watches him as they curl up on the sofa to watch one of Oikawa's terrible alien invasion movies. A trailer for something else comes on, during the commercial break, and Oikawa's eyes widen with excitement. \"I didn't know they were making a movie of this,\" he says. \"We have to go see it.\"\nHajime, still buoyed by his successful conversation with Kawasaki, just smiles fondly at Oikawa, and grabs one of his wiggling toes. \"Sure.\"\n\"On opening night,\" Oikawa says.\n\"Don't we always go on opening night?\" Hajime asks. \"Isn't that our thing.\"\n\"You're being awfully agreeable, Iwa-chan.\" Oikawa gives Hajime a questioning look. \"Why are you in such a good mood?\"\n\"I have a date,\" Hajime replies, absently running his thumb along Oikawa's shin. \"With confession letter girl.\"\n\"A date?\" Oikawa looks up at him suddenly, movie abandoned as he straightens on the sofa. Oikawa is so tall, when he sits up to his full height, and with his long legs draped over Hajime's, Hajime feels half his size.\n\"Don't sound so surprised,\" he grumbles.\n\"Don't schedule it this Thursday,\" Oikawa says. \"You promised to cook for me then.\" Oikawa is pouting at him, and Hajime, baffled, nods.\n\"I didn't,\" Hajime says. \"I remembered.\"\n\"Iwa-chan, if you get a girlfriend, I won't be your favorite person anymore. You'll disappear.\" Oikawa sounds genuinely upset about that, for all his attempts at a flippant tone, and Hajime wants to tell him that if he's still here, after all this time, after all of Oikawa's temper tantrums and weird demands and fragile-ego insults, there's no way a girlfriend is going to make him disappear.\nOikawa's always been possessive, though, and Hajime knows that. He knows Oikawa is often afraid that things are going to slip through his fingers: people, victories, status. He plots and schemes all these ways to keep them, and never seems to realize he doesn't have to be so afraid.\nBut it's Oikawa's softness, hidden underneath his sharp tongue and smirks, that's made Oikawa someone Hajime wants to protect.\n\"Who says you're my favorite person now?\" Hajime replies instead, flicking Oikawa in the forehead.\n\"Who else would it be?\" Oikawa says, with those damned fluttering lashes again, and Hajime socks him in the sternum.\n \n★ ★ ★\nHajime plays with the top button on his shirt, wondering if he should close it. He has to leave to meet Kawasaki in about five minutes, so he can't really afford to be this indecisive when he still has to round up his wallet and cell phone.\n\"Open,\" says a voice behind him, just as he settles on leaving it buttoned.\n\"What?\"\nOikawa comes up in front of him, and reaches up to undo the top button on Hajime's shirt. His fingers brush the skin of Hajime's throat, and Hajime's heart beat quickens at the closeness. \"You should leave it open. It looks like you're trying less hard.\"\nOikawa smells nice, like fresh cooked sushi rice, and Hajime blinks to clear the thought away. \"I'm not—\"\n\"Iwa-chan, you looked like you were going to meet your date's dad, not your actual date.\" Oikawa looks Hajime up and down critically, and smoothes the collar of Hajime's shirt. \"You look nice now, though.\"\n\"What's the catch?\" Hajime mumbles, resting his hands on Oikawa's hips as Oikawa pulls at the shoulders of his dress shirt. The muscles bunch under his hands, and when Hajime looks up in surprise, Oikawa is staring down at him with a pensive expression that morphs quickly into a grin when he notices Hajime is paying attention.\n\"The catch?\"\n\"You're never nice without reason,\" Hajime informs him. He can make out the pores on Oikawa's nose. They're small and clear, because Oikawa is unfair. He'd never had the struggles Hajime'd had with his skin when they'd started high school. \"So what's the catch?\"\n\"No catch,\" Oikawa says breezily, stepping back and pulling free of Hajime's hands. Hajime grasps at nothing, and he starts to reach for Oikawa again before he realizes that'd be sort of strange. \"I'm just being a good friend. You just need all the help you can get for some girl to settle for you~\"\nHajime growls at Oikawa, readying himself to chase him, when he notices the time on his bedside clock. \"I'm going to be late!\"\n\"No you won't,\" Oikawa says. He offers Hajime his phone and wallet, with an odd, tight smile. \"Have a nice date, Iwa-chan.\"\n\"Thanks,\" Hajime mumbles, taking them and rushing out the door with his shoes untied, still trying to figure out that smile.\n \n★ ★ ★\nHe has a great time with Kawasaki. She's funny and playful, and he likes her. She likes volleyball and plays for the softball team and really loves gummy bears.\nThey talk about their teams, and about their high schools, and Hajime can't figure out who she reminds him of but the way she sort of sparkles with mischief is really attractive to him.\n\"We should... do this again,\" he says, when it's nearing time to part ways, and she offers him a big smile.\n\"I've never confessed to a guy before,\" she admits. \"I didn't really think that kinda thing really worked.\"\nHajime shrugs. \"You're a cool person,\" he says. \"Probably too cool for me, but if you like me…\"\n\"I do,\" Kawasaki says. \"I do like you.\"\n\"Okay,\" Hajime says, still feeling bewildered by the whole thing. This is the kind of stuff that happens to Oikawa, not him. \"Then yeah, we could...\" He stumbles over it. \"We could... go out more. Or something.\"\nHe's surprised when she enthusiastically agrees.\nThey leave each other at the train station, because she lives with her parents still and Hajime lives closer to campus, and he walks her down to the turnstiles before walking back up to catch his bus back home.\nOikawa is gone when he gets home, and when Hajime wakes up the next morning, he's still gone. When he finally stumbles home, at around two in the afternoon, only an hour before they have to leave for practice, he smells like perfume and cigarettes, and Hajime just pushes him into the bathroom for a shower and closes the door without a word.\n\"How was your date?\" Oikawa asks, as they walk to practice. He has dark circles under his eyes, and the skin of his lips is dry. He looks tired, and to Hajime, a little sad.\n\"Great,\" Hajime says, and Oikawa gives him a half-lidded stare, his thick brown eyelashes casting shadows on his cheeks in the afternoon sun.\n\"Not that you have much to compare it to, right?\" Oikawa says, lips quirking. Hajime punches him in the arm, not too hard because Oikawa does look like he might fall over if Hajime hits him at full strength.\nSugawara's at practice, and Oikawa spends most of his time hitting back and forth with the other setter as they talk in low, hushed voices. Hajime finds that he misses Oikawa's snide comments during individual practice, and he keeps looking over at him, wondering at the tightness in his throat.\n\"You look like a man who went on vacation without his dog,\" Sawamura tells him, and Hajime sends him a spike too hard to receive as soon as they're on opposite sides of the net.\n \n★ ★ ★\nKawasaki Mayumi fits into Hajime's life so easily. She's only really free at night on weekends, and so Hajime doesn't feel guilty staying late at practice with Oikawa every evening as they gear up for the new season. Someone has to make sure Oikawa doesn't hurt himself trying to nail this new tweak to his serve, and as usual, that someone is Hajime.\nHe meets Mayumi for lunch two or three times a week, and on Wednesdays, she makes him lunch, cute little bento with octopus sausages and baby chick cut boiled eggs that make him feel like he's back in middle school, but in a way that leave him nostalgic instead of embarrassed.\n\"You're such a good cook,\" Hajime tells her, and she tilts her head and informs him that she's good at lots of things, which has him blinking at her, shocked, before he laughs.\n\"My mother tells me I should be more modest or no boy will like me,\" Mayumi confesses, and Hajime grins at her.\n\"Confidence is important,\" Hajime says, and Mayumi elbows him, making him almost drop his octopus sausage.\n\"You're probably just saying that because you live with Oikawa Tooru,\" she says. \"Maybe you're immune to excessive confidence now. I think half the girls in our year have a thing for him.\"\n\"I thought it was his face,\" Hajime replies, and Mayumi gives him a questioning look. \"He's so pretty, right?\" Oikawa has always had the kind of face that grabs your attention, and the sort of charisma that keeps it. Hajime knows him too well to be jealous, most of the time, but sometimes he looks at Oikawa and wonders how Oikawa can be so much at once. He blushes, feeling a little silly. \"I mean, good looking?\"\n\"I mean… maybe?\" Mayumi taps her lower lip with her index finger. \"But I think it's more because he's tall and holds his shoulders back. He looks so sure that he's the best.\" She wrinkles her nose. \"Not my type at all. I like guys who think I'm the best.\" She winks at him, and he laughs again.\n\"They don't know Oikawa very well then,\" Hajime replies. \"You're confident. Oikawa's different.\" Oikawa, Hajime thinks, isn't confident at all. He's just talking himself up because he's certain that everyone else is going to know, somehow, that he's not a genius, that he's no natural like Kageyama Tobio, the underclassman that scared him into perfecting his serve. \"Bravado and confidence aren't the same thing.\"\n\"You know him really well, huh?\" Mayumi asks, and Hajime nods.\n\"As well as anyone does,\" he replies, finally shoving the sausage octopus into his mouth. \"Delicious.\"\nOn Friday nights, while Oikawa is usually out doing whatever it is he does until five AM, Hajime and Mayumi go out to dinner, or go to movies. Mayumi has really eclectic taste, so sometimes they end up watching American movies with lots of explosions, and sometimes it's like tonight, a French film with subtitles that roll by too fast for Hajime to read. He tries to imagine Oikawa sitting through a movie like this, and he laughs, because Oikawa would be bored in five minutes and start to throw stuff at people at an angle that made it look like Hajime had done it.\n\"So no French films,\" Mayumi says, as they leave. \"I'll remember that.\" She tucks her hair behind her ear and smiles at him. He links his arm through hers as they exit the theater.\n\"It's not the French part,\" Hajime says hurriedly. \"It's more the… dialogue-heavy part.\"\n\"Don't like a little upper level thinking with your movies, Hajime?\"\n\"It's more that I'm not used to seeing movies that don't involve aliens, zombies, or some combination of the two—\"\n\"Iwaizumi!\" a cheerful voice calls, and Hajime pauses his response to Mayumi to see Sugawara, with a hand wrapped around Sawamura's wrist, walking toward them.\n\"Team members,\" Hajime says to Mayumi, who nods to him, putting her other hand on his upper arm.\n\"Sugawara, Sawamura,\" Hajime greets them. \"This is my girlfriend, Kawasaki.\"\n\"Girlfriend?\" Sugawara's voice rises at the end of the sentence, really shocked. Sugawara turns to look at Sawamura, who shrugs.\n\"Nice to meet you, Kawasaki,\" says Sawamura, bowing to her, and Sugawara hurriedly mimics the action, smiling at her before focusing back on Hajime.\nMayumi excuses herself to go to the restroom, and Hajime shoves his hands in his pockets, looking at Sugawara questioningly.\n\"I just… didn't expect you to have a girlfriend,\" says Sugawara, hesitantly. \"I just thought… Oikawa…\" Sawamura pulls on the edge of Sugawara's shirt, and Sugawara stops talking.\n\"What about Oikawa?\" Hajime asks, roughly. \"He'd better not be complaining about me not practicing enough or I'll—\"\n\"It's nothing,\" Sawamura says. \"Suga only meant that Oikawa hadn't mentioned it at practice.\"\n\"He doesn't really mention it to me, either,\" Hajime says. \"It's probably so low on his radar of things to worry about that it never came up.\"\n\"Doubt it,\" Sugawara says. \"Oikawa worries about everything, don't you think?\"\n\"Yeah,\" Hajime admits. \"But it's hard to figure out how he feels about things, sometimes.\" He shrugs. \"I haven't introduced them yet, either.\"\n\"Hmm,\" Sugawara says, and then the conversation is side-tracked when Mayumi returns, smiling, loose hairs around her face returned to their ponytails.\n\"We should go,\" Hajime says. \"I want to make sure Mayumi catches a train before it's too late.\" He looks over to smile at her, but then remembers he has to look down, not up. \"Right?\"\n\"It was nice to meet Hajime's teammates,\" Mayumi says, bowing again, before grinning up at them both. Sugawara's eyes widen at her gaze, and then flick between Mayumi and Hajime curiously.\n\"And you,\" Sawamura says, and this time he's the one to grab Suga's wrist. \"Our movie starts soon, too, so we also have to go.\"\nHajime and Mayumi walk in the night, the streetlamps casting interesting shadows on her face. Drunk company men move from restaurant to bar in clumps past them, and so Hajime pulls Mayumi closer to make sure no one bumps her.\n\"They seemed surprised that you have a girlfriend,\" Mayumi says, lightly, in the way Hajime's figured out means she really wants to know something but also wants it to seem unimportant. Hajime stares down at the crown of her head. Her hair is neat, with a zig-zag shaped part. Not like Oikawa's hair, when he's slumped into Hajime on the sofa. That's always a little purposefully messy. More of Oikawa's 'not trying too hard' theory, Hajime figures.\n\"They've known me and Oikawa since high school,\" Hajime says, scratching at the back of his neck. \"I don't really date.\"\n\"Why not?\" Mayumi asks.\nHajime shrugs. \"Lots of reasons. Girls mostly noticed Oikawa in high school, honestly. And I was so busy.\" For all the dating Oikawa did in high school, he somehow managed to take up a shocking amount of Hajime's free time, too. It's probably because Oikawa doesn't have to sleep, or at least thinks he doesn't, the idiot. Hajime reflexively cracks his knuckles as he imagines Oikawa asking if Hajime's his mom in that annoying--\n\"Hajime?\"\nBroken from his thoughts, Hajime looks down at Mayumi. \"Sorry, I was just thinking— thinking about high school.\"\n\"We're here,\" she says, amused, and they've already arrived at the train station. Hajime apologizes, stuttering and blushing, and Mayumi chuckles, getting up on her toes to brush her lips against his cheek. He brings his hand up to touch the spot, embarrassed but pleased.\nIt's not until he's halfway home that Hajime pauses to wonder if his cheeks are just less ticklish than his neck, because the feeling of Mayumi's mouth on his cheeks was like a milder form of the tingle Hajime gets when Oikawa's lips skate across the skin under his jaw.\n \n★ ★ ★\nWhen the season really starts to get back into swing, with spring tournament preliminaries and frequent matches, Oikawa starts to fall apart, spending too many hours in the gym. Hajime drags him out when he can, but he's got Mayumi and classwork and stuff to deal with, too, so he can't play personal police to Oikawa's practice schedule like he did when they were in high school and had practically the same schedule.\nHajime goes into the living room one morning to find Oikawa still in the same place he'd been when Hajime had gone to bed, his knees tucked up under his chin and his eyes still riveted to his laptop screen, watching the same game. \"What the hell?\"\n\"We're playing this team next week,\" Oikawa says. \"I have to memorize their weaknesses so I can exploit them, naturally.\"\n\"Naturally,\" Hajime replies, deadpan, taking in Oikawa's disheveled clothes and tired eyes. \"You could just watch the video a little every day instead of making yourself sick, you freak.\"\nHe picks up a volleyball that's rolled from the pile by the front door and soft-serves it at Oikawa's head. It bounces with a satisfying thump, and Oikawa gives an equally satisfying yelp of displeasure.\n\"Constant repetition helps me learn,\" Oikawa says, and Hajime is about to nod when Oikawa continues with, \"all the best ways to crush my opponents' will to play.\"\n\"Your personality is so bad,\" Hajime says, walking into the kitchen to get himself some breakfast, while Oikawa mumbles more at the laptop screen as serve shifts to the team they're playing against next week.\n\"Ah, Iwa-chan, you're wearing your nice sweater,\" Oikawa yells into the kitchen, and Hajime fingers the material briefly. He'd contemplated just pulling on one of his team T-shirts, but Mayumi sees him in those all the time, and he feels a little guilty that she always makes an effort to look nice when they meet, and he's always a mess from practice. \"Special occasion?\"\n\"Yeah,\" Hajime says. \"My girlfriend is coming over.\" He pops two pieces of white bread into the toaster before walking back over to the kitchen doorway. \"Feel free to leave so she doesn't ever meet you.\"\nOikawa looks up, then, from the laptop, all of his attention suddenly on Hajime. He's still rubbing absently at his head, where the ball impacted, and his eyes, with the dark circles under them, narrow slightly as he looks Hajime up and down. Hajime crosses his arms uncomfortably as Oikawa's gaze lingers on his legs before climbing up to rest on his face.\n\"You bought new jeans?\"\n\"Um,\" Hajime says. \"Yeah. Why? Do they look bad?\"\n\"No,\" Oikawa says, as Hajime shifts under his gaze, feeling kind of bared under Oikawa's piercing look. \"I mean, you don't look any worse than usual.\"\n\"Thanks,\" Hajime says dryly, tugging briefly at the neck of his sweater. \"For the glowing compliment.\"\nOikawa twinkles at him and goes back to watching the volleyball match on his laptop. Hajime stares at him for a couple of moments, wondering if he should pick the bigger man up and carry him to bed, but instead he leaves Oikawa there, retreating to the kitchen to get his toast.\n\"Anytime,\" Oikawa says sweetly.\n\"If you're going to stay,\" Haijime adds, spreading jam on his toast, \"you should sit on the couch and cover up the chocolate stain.\"\n\"I think it gives the hideous pattern a bit of panache,\" is Oikawa's flippant response, and Hajime snorts despite himself.\n\"You would,\" Hajime replies, smile playing at his lips as he lifts the toast to take a bite.\nHe's just finishing his small breakfast when there's a ring at the door. Mayumi is on the other side, smiling at Hajime happily with a box in her hand.\n\"Hey,\" Hajime says, and gestures for Mayumi to come in. She steps out of her shoes and into the hallway. \"My roommate's here, by the way.\"\n\"The infamous Oikawa Tooru,\" Mayumi says, exaggerating the adjective, and Hajime raises an eyebrow.\n\"Infamous?\"\n\"Yes,\" Mayumi says. \"You've made him sound a little like a wild animal you have living in your apartment.\"\n\"It's probably because the weird stories stick out more, that's all. Oikawa really is my best friend.\"\n\"That's why it's been so weird that we've been dating for a month, almost, and I haven't met him.\"\nHajime frowns. \"Yeah,\" he admits. \"It is weird.\" The truth is, Hajime and Oikawa both seem to have been avoiding this. Hajime has only ever had Mayumi over when he knows Oikawa will be out, and when Hajime had tentatively floated possible meetings, Oikawa had always magically had somewhere else to be, eyes dark and smile shallow. Hajime clenches his hands into fists just thinking about it, because he hates not understanding Oikawa, even if it happens more and more as they get older.\nWhen they enter the living room, Oikawa's still nestled in all of his blankets and pillows.\nOikawa stares between her and the box in her hands before his entire face is transformed by the bright, vapid smile he usually saves for people he hates as his eyes shift to calculating.\nHajime frowns. \"Mayumi, this is Oikawa. Oikawa, this is my girlfriend, Kawasaki Mayumi.\"\n\"Sorry for the mess,\" Oikawa says, after a long moment of study. \"It's tournament season, and I've been pulling all-nighters watching other teams' matches.\"\n\"I get it,\" Mayumi says. \"I play softball myself, so I know how it can get when a tournament is in full swing. Hajime already warned me that things were going to get hectic.\"\nOikawa mouths Hajime to himself in surprise, and then his gaze flickers over, meeting Hajime's eyes. \"Ah, that's so thoughtful of you, Iwa-chan~\"\n\"I can't stay too long, today, anyway,\" Mayumi says, turning to look at Hajime. \"These are for you, of course.\"\nShe offers Hajime the box and he opens it to find chocolates inside. They're beautiful, soft swirls of white chocolate on top of the dark chocolate forming flowers. \"Ah,\" Hajime says, embarrassed, \"we missed Valentine's Day, though, by just a little.\"\n\"I love to make chocolates,\" Mayumi admits. \"So it wasn't really a hardship.\" She looks up at him expectantly, and she's so small, Hajime thinks. So short and narrow, with thin wrists, even though he knows she's strong enough to pitch a full softball game. Whenever he reaches for her hand, he always expects it to be bigger.\n\"Thank you,\" he fumbles out. Oikawa is just watching them, and it's making Hajime uncomfortable. He takes one of the chocolates from the box and tastes it, biting off half of the chocolate and chewing it slowly. There's caramel inside. \"Wow.\"\n\"I told you I was good at a lot of things,\" Mayumi says, grinning all the same, and Hajime smiles back, licking the chocolate from his lips.\nOikawa stands up, then, and approaches them both. He's wearing his favorite AREA51 shirt, the tie-dyed one with the neck stretched all out of shape to reveal sharp collarbones, and a pair of sweatpants from high school that have seen better days. He still manages to look good, somehow, all tall and lean, and Hajime wonders if the flicker of heat in his stomach is jealousy.\n\"Let me taste,\" he says, in what Hajime refers to as his brat-voice, and he leans forward and sucks the other half of the chocolate into his mouth, tongue catching the melting chocolate from Hajime's index finger and thumb as Hajime wrinkles his nose. The heat in his belly gets worse, between the tickle of wet tongue and the way Oikawa stares at Mayumi as he steals Hajime's treat.\nOikawa is so annoying.\n\"Kawasaki, this is really good!\" Oikawa's too loud, but as he licks his lips, Hajime's chest clenches, and he knows this time, it's anger.\n\"You could have taken your own,\" Hajime grumbles, wiping his hand on his jeans and then slapping Oikawa's shoulder with it. Oikawa doesn't look away from Mayumi.\n\"A man could fall in love with you if he ate too many of these,\" Oikawa says, still intensely focused on Mayumi in a way that makes Hajime's throat tight, and Mayumi beams back at him.\n\"Well,\" she says, looking over at Hajime, and then returns her attention to Oikawa, \"then you should taste my cakes. They're even better.\"\n\"Mayumi does make great cakes.\" Hajime pulls at the hem of his sweater.\n\"You'll have to give me the recipe, later,\" Oikawa says.\n\"You absolutely must not,\" Hajime quickly intercedes. \"Oikawa burned out the kitchen in his own place trying to make chocolates, he won't be making them here.\"\n\"Iwa-chan thinks he's my mom,\" Oikawa says. Mayumi is staring back at Oikawa, and Hajime feels strangely left out of their silent communication. Finally Oikawa cuts his eyes to Hajime, and throws an arm around his shoulder. It's different than usual, though, like he's doing it for Mayumi, and not to piss Hajime off. \"I already have a mom, Iwa-chan.\"\n\"You need six moms,\" Hajime replies, pushing Oikawa's arm off. Oikawa's skin is hot, from being under the blanket maybe, but Hajime has the urge to check his temperature, to make sure he's not getting sick with all his not sleeping and practicing way too late. But Mayumi is here, and Hajime figures it probably won't make the best impression. \"An entire team of moms.\"\n\"Then Kawasaki will have to make chocolates for me sometime,\" Oikawa says suggestively, bowing slightly.\n\"Absolutely not,\" says Hajime immediately. Mayumi laughs, covering her mouth with her hand, and Hajime smiles at her broadly.\nOikawa's face is unhappy and clouded when Hajime breaks from sharing glances with Mayumi to look at him. He smiles as soon as he notices Hajime's attention, but Hajime again wants to check Oikawa's temperature, to make sure he's not sick.\n\"Ah, Iwa-chan, I'm going to take a nap,\" Oikawa says suddenly, and he smiles sweetly at Mayumi and doesn't look at Hajime at all as he moves to leave the room, heading back toward their bedroom. He smiles over his shoulder. \"I need to leave you two lovebirds alone~\" If Hajime didn't know Oikawa better, he'd believe that smile. \"Maybe my lady firefighter will make me chocolates,\" he adds brightly, and Hajime blinks.\n\"But you met her in December. You're still seeing her?\" he blurts out, and then he looks down at the ground.\n\"Do I have to report in on my social life, Mom?\" Oikawa laughs, and shoots Mayumi one last look. \"A pleasure, Kawasaki.\"\n\"Nice to meet you, too, Oikawa,\" Mayumi says, blushing under the full magnitude of what Sugawara calls Oikawa's lady-killer grin. The bedroom door shuts, and music starts to play afterwards.\n\"Did the infamous Oikawa live up to your expectations?\" Hajime asks, after he makes them both a cup of tea. Winter is fading into spring, but there's still cold in the air, and despite the heated floors, cold still sneaks in from outside. Oikawa shouldn't have been spending the night on the floor, even in a pile of blankets.\n\"He certainly is flirtatious,\" Mayumi says, and Hajime swallows. He… hadn't liked that. He can't think about it too much right now, because he's spending time with Mayumi and he doesn't want to waste it, but it had been unnecessary, the way that Oikawa had looked at Mayumi. Hajime hadn't expected him to act like that, really.\n\"He's like that,\" Hajime eventually replies. \"He has to be the center of attention.\"\n\"Has he always been like that?\" Mayumi asks. \"You've known each other since you were little, right? He calls you Iwa-chan.\"\n\"He does that to push my buttons,\" Hajime says. \"I told him to stop calling me that when we were thirteen. Clearly, he listened.\" He rolls his eyes. \"As for the attention thing… Well, Oikawa's not…\" He's not sure how to explain to Mayumi that Oikawa is never sure he'll get any attention that he doesn't forcibly take, or even if he should explain that. \"It's not a bad thing. I'm not the greatest conversationalist, sometimes, so… Sometimes…\" Hajime scratches with his left hand at the inside of his right wrist. \"It kinda works, for us.\"\nMayumi nods, and takes a sip of her tea. She has a strange look on her face, like the tea is too bitter.\n\"I'll tell him not to do it again,\" Hajime says, after a long silence. \"The flirting.\"\n\"Good,\" says Mayumi, and then she scoots her chair over closer to his. She puts a hand on his cheek, and pushes her lips to his, in a short, chaste kiss that has him gaping at her. \"Because you're mine.\"\nThe phrasing strikes Hajime as wrong, for some reason, as he rubs his thumb across his lower lip, but Mayumi is smiling at him and it doesn't really matter.\nShe only stays another thirty minutes, long enough for Hajime to eat another of his chocolates and for Mayumi to finish her tea. She kisses him again at the door, just to the left of his mouth, and Hajime smiles at her sillily as she leaves.\nHe sits down on the sofa, arms around one knee, and turns his thoughts to Oikawa.\nBut the more he thinks about how the meeting between his best friend and his girlfriend went, the more mad he gets. It had all felt wrong, Hajime thinks. Even Oikawa's usual behaviors, like his food theft and friendly touches, had felt calculated and showy, and Hajime doesn't even get why.\n\"Don't flirt with her,\" he says, when Oikawa returns to the living room, rumpled with sleep and shirt riding up his belly. \"I let you get away with the rest, but… Just don't do that to me.\"\nOikawa freezes, his eyes focusing on Hajime immediately.\n\"I wasn't flirting with her,\" Oikawa says, measuredly flippant. \"I was just being polite.\" His voice crackles, like it always does when he's just woken up. \"Just because you don't have any charm, Iwa-chan—\"\n\"Aren't we getting too old for names like that?\"\n\"Like you got too old to call me Tooru?\" Oikawa asks. He taps his chin playfully, despite the tenseness Hajime can see in his neck and jaw. \"Just relax, Iwa-chan.\" Oikawa smiles at him, then, big and fake, like it'll placate him the same way it placates other people.\n\"I'm not someone you need to manipulate to make me notice you,\" Hajime says, standing up from the sofa to set himself in front of Oikawa, far enough away that he doesn't have to tilt his head back to look him in the eyes. \"I'm here, okay? I'm here and I respect you and I pay attention to you, so don't ruin this just because you can.\"\n\"I wouldn't—\" Oikawa says, too loud and too rough, before he covers his face with both hands and rubs at it before dropping them. \"I wasn't flirting with her,\" he repeats, looking straight at Hajime. \"I wouldn't, okay?\" He's deadly serious, and his face is all crumpled up like he's caught between crying and yelling. It's the face he makes when he tries a new serve and he can't get it right after days of trying, or the face he makes every time he looks at Kageyama and sees a giant on the other side of the net.\nIt's Hajime's least favorite face to see on Oikawa. But he can't deal with it right now, not when his own thoughts are still so mixed up.\n\"Fine,\" he says. \"Fine.\" He turns away, planning to lock himself inside the bedroom for the rest of the evening, until he can look at Oikawa and not want to punch him.\n\"She's…\" Oikawa says, quietly, so quietly, \"she's good at making chocolates, isn't she?\"\nSurprised, Hajime turns around to look at Oikawa. He's regained control over his face, a fake lazy smile conflicting with how upset his eyes are to someone who has known him as long as Hajime has. \"Yeah,\" Hajime says. \"She is.\"\n\"Better than I am, I guess,\" Oikawa says. \"After all, hers are edible.\"\nHajime feels like he's missing something, still, that would make all of Oikawa's behavior make sense. But he doesn't know what it is, and he knows Oikawa won't tell him even if he asks. \"And possibly less combustible.\"\n\"I suppose it wouldn't be right if I were completely perfect,\" Oikawa says, and Hajime waits for the inevitable grin but instead... Instead, Oikawa is just staring at the ground. His lips are pink, like he'd done nothing but chew them while he was sleeping. The disappointed curve to Oikawa's spine right now…. that's real too, and Hajime wishes he could harden his heart to it but he can't. Oikawa is just so much a part of him that he can't even stay mad at the fool.\n\"Ugh,\" Hajime says. \"Come here.\" Oikawa doesn't come closer, so Hajime steps forward and wraps his arms around Oikawa's waist, just like he'd done after Seijou's first loss to Shiratorizawa with Oikawa as starting setter, holding him tightly enough that Oikawa will know it's all right to rest his head on Hajime's shoulder and stop contorting his face into dumb pretend expressions for a little while, because Hajime isn't going to judge him. \"So high-maintenance.\"\n\"Iwa-chan,\" Oikawa says, lips just behind Hajime's ear. Hajime shivers at the familiar touch that never seems to stop affecting him.\n\"What?\" Hajime says, lifting one hand to comb through Oikawa's tangled hair with his fingers.\n\"I'm sorry that I'm so much better looking than you that you have to worry about me stealing your girlfriend,\" he says, and Hajime can feel Oikawa's smug smile along his jaw.\nHajime rolls his eyes. \"Has anyone called you trash this week? Because you're trash, Oikawa.\"\n\"I'm your favorite trash.\" Oikawa's soft chuckle is hot and damp against the skin of his neck.\n\"I guess,\" Hajime says, feeling flush and warm holding Oikawa like this, and he doesn't even think about Mayumi's two gentle kisses again until much later, after Oikawa has fallen asleep taking up far too much of Hajime's bed, even though he has his own.\nIt had been Hajime's first kiss. He feels like it's supposed to be a bigger deal than this.\n \n★ ★ ★\nThe start of April has Hajime busier than he'd ever expected to be. Not because of his workload, or because of Mayumi, though. It's mostly because of Oikawa, who has found a way to spend the majority of every day with Hajime.\nHajime finds himself doing all sorts of things, like going to dinner on weeknights with Oikawa; adventures to strange foreigner-owned restaurants tucked away in odd parts of the city. (Oikawa has a talent for getting food on his face when he eats, especially when no one is there but Hajime, and Hajime laughs and wipes sauce away with his thumb from across the table.)\nSometimes they walk around campus in the warming spring weather, until Oikawa's ears and nose are red with cold. \"Why don't you ever remember to wear a hat?\" Hajime asks, somewhat rhetorically.\nOikawa smiles at him. \"Iwa-chan will take care of me if I get sick, right?\" He laughs, and Hajime purses his mouth at him. \"Besides, you always sit in one place too long reading, and you get headaches. A walk gives your eyes a break.\"\nHajime gives Oikawa a blank stare. \"So now you're my mom?\"\n\"Hmm,\" hums Oikawa. \"No, you're still mine.\" Then he crinkles his nose playfully. \"I'm just your wiser, taller, better looking friend, Iwa-chan.\"\n\"Revolting,\" Hajime says, dryly, and Oikawa presses their cheeks together for warmth.\nThen there are also the late nights spent in their shared living room, watching this new Korean show Oikawa'd fallen in love with, called 'Real UFOs'. Hajime tries to do his homework at the same time, but eventually, Oikawa's sarcastic comments drag him into watching it with him, the two of them tangled together on the sofa as Oikawa burrows his cold hands under Hajime's shirt for warmth.\n\"This stuff is so fake,\" Hajime tells Oikawa, staring at the blurry photos of 'alien bodies' that the narrator keeps showing. \"Honestly, Oikawa.\"\n\"How do you know?\" Oikawa shifts, pulling his hands free of Hajime's stomach in order to roll onto his back. He looks up at him with eyes that reflect the light from the television. It's because Hajime is sleepy that he even thinks about how pretty Oikawa's eyes are, even in the dark. \"The truth is out there.\" He pitches his voice to sound ominous, and Hajime laughs, smiling down at Oikawa.\n\"You're such a weirdo,\" says Hajime. \"You know that right?\"\n\"Beautiful and talented people are allowed their eccentricities,\" is Oikawa's reply, and Hajime scoffs when he follows it up with: \"So Iwa-chan had better practice being as normal as possible, right?\"\n\"Ass,\" Hajime says, winding a piece of Oikawa's unruly hair around his index finger.\nOikawa grins up at him winningly. \"Besides, Iwa-chan, even if aliens aren't real, isn't it fun to think they might exist?\"\n\"I guess,\" Hajime replies. \"As long as they're more like ET and less like Mars Attacks.\"\n\"Plus, aliens would explain how Tobio-chan's shortie jumps so high.\" Oikawa's grin twists into an unpleasant expression. \"They need to hurry up and come to the college level so I can crush them.\"\nHajime shoves him off the couch, and Oikawa's laugh echoes through the apartment, smothering the sound of alien transmissions coming from the television speakers.\nMayumi is the one who points it out to him, when he starts another story with Oikawa and I over lunch. \"When are you not with Oikawa?\"\n\"What do you mean?\" Hajime's chopsticks still over his bento. \"I'm here with you, right now?\"\n\"But if you're not with me, you're with Oikawa?\" She's set her own chopsticks down, resting her cheek in her hand. \"Isn't that… a lot?\"\n\"We're best friends,\" Hajime replies. \"And we live together. It's not a big deal.\"\n\"Okay,\" she says, and Hajime gets the impression she doesn't like that answer, for some reason. He shrugs, and then doesn't examine the conversation again until later, when Oikawa brings home takeout for dinner, entering the apartment with a cheerful \"Yoo hoo~\" that has Hajime smiling before he even looks up to see his friend.\n\"Did you miss me?\" Oikawa asks, as he unpacks the udon from the bag.\n\"How am I supposed to miss you when you're always around?\" Hajime answers, and then he thinks about that. Oikawa is always around, and Hajime… It had bothered Hajime, when Oikawa had first moved in, but now, he's not sure he remembers what it's like not to have Oikawa always underfoot.\nIt reminds him of what it was like when they were kids, before Oikawa had gotten tall enough to stand up for himself or charming enough that he didn't have to, and it had just been the two of them on the edge of the playground, putting those damn bugs in jars.\n\"Did I see you studying at the library earlier?\" Sawamura asks during practice one day.\n\"Yeah,\" Hajime says. \"I didn't see you, though?\"\n\"I didn't think it was actually you,\" Sawamura admits. \"Usually Oikawa's around, rearranging your books on the table and smirking.\"\n\"He has such good grades,\" Hajime growls. \"It's disgusting.\"\n\"Anyway, I was on the other side of the library, just picking up a book on interlibrary loan from the front desk, and I figured it was someone that looked a lot like you, or that it was you, and you were working on something really serious and Oikawa had taken pity on you. Either way, seemed to make sense not to bother you.\" Sawamura rolls his head in a circle to loosen his neck.\nHajime's first thought is: Oikawa would never take pity on me. But his second thought is what he voices. \"You know, I have no idea how Oikawa's managed to corner ninety percent of my time without my say-so,\" he tells Sawamura. \"Only that he has. He's always there, demanding me to do something with him or tagging along to do something with me.\" He scratches at his jaw. He'd nicked himself shaving this morning, after Oikawa had complained that Hajime's stubble was tickling him at night. Hajime had grumbled that Oikawa should just get out of his personal space, but he'd dutifully gone to shave, anyway.\n\"If you want to spend less time with him, you have to be clear about it,\" says Sawamura, blatantly amused.\n\"But I don't,\" says Hajime immediately. \"Want to spend less time with him, I mean.\"\n\"Then…\" Confused, Sawamura wrinkles his forehead in one of those ‘thoughtful-captain' faces that Sugawara is always chastising him about. I'm the thoughtful type of captain,  is what Oikawa says. He's the kind of captain who gives himself premature wrinkles. \"What's… the problem?\"\n\"It's not a problem,\" Hajime says, after a few moments of thought. \"I just don't get it.\" He huffs, tossing a ball up into the air and serving it cleanly over the net. \"I mean, we didn't hang out this much even when we were in high school. Isn't college supposed to make us more independent or something?\"\n\"Have you considered—\" Sawamura stops. \"Never mind.\"\n\"Have I considered what?\" Hajime shoots Sawamura a suspicious look, and Sawamura sighs.\n\"It's just that Kawasaki is your first girlfriend, right?\" Sawamura plucks at his wristbands. \"Might it be that Oikawa's not used to sharing your time?\"\n\"He isn't sharing it,\" Hajime says bluntly. \"He's making sure that I barely have any—\" He pauses. \"Oh.\"\n\"Yeah,\" Sawamura says. \"That's what Suga thinks, and sometimes, I think Suga's got magic powers, so... So if you want it to change, you need to say something to him about it, probably.\"\n\"Oh,\" Hajime says again, and Sawamura pats him on the shoulder before wandering across the gym to join Sugawara, who's practicing serves with a couple of upperclassmen.\nOn the way home, Hajime shoves his hands in his pockets to fight the evening chill, shivering, Oikawa warm and tall next to him. \"Say, Oikawa—\" he starts, but then he bites his lower lip. He wants to ask about what Sawamura said, but suddenly he doesn't know how. He shivers again at a strong gust of wind. Spring isn't supposed to feel like this.\nOikawa looks at him out of the corner of his eye, and Hajime looks away, flustered all of a sudden at the way he notices the curl of Oikawa's eyelashes.\n\"Iwa-chan, are you cold?\"\n\"No,\" Hajime says, but Oikawa sidles closer anyway, throwing an arm over Hajime's shoulder and pulling him into his side. Oikawa radiates heat, and Hajime moves into it even as he scowls, matching his steps to Oikawa's longer gait.\n\"Warmer?\" Oikawa asks lightly, looking straight ahead. A smile plays at the corners of his lips, and Hajime is struck by the way Oikawa's silhouette looks in the streetlights. Hajime's chest aches, and he puts a hand to his sternum to stop it.\n\"It's always warmer in Hell,\" Hajime mumbles, but Oikawa hears him, laughing and squeezing his arm. Oikawa smells like that flowery bar soap he likes. \"Your true home.\"\n\"Ah ah ah,\" Oikawa says. \"Nowhere can be my true home without you to nag me, Iwa-chan~\"\n\"Shut up,\" Hajime says, but he's smiling. There isn't anything weird about this. It's just them.\n \n★ ★ ★\n\"Iwa-chan, did you see the new trailer?\" Oikawa asks, as Hajime searches for his student ID. He'd left it on the table, right? But it's not there now, and he has class in fifteen minutes.\n\"What?\" he asks, lifting up the sofa cushions and finding three 100yen coins and no ID. \"What are you talking about?\"\n\"For 'Galactic Ace',\" Oikawa says. \"The new trailer came out last night. Did you see it?\"\n\"When would I have seen it?\" Hajime says, lifting up the papers on the living room floor he'd stacked last night. It's not there either. \"I've been in class or with you, right? When did you see it?\"\n\"This morning,\" Oikawa says. \"We're still going to see it this Thursday, right?\" He grabs the back of Hajime’s jacket and holds him still.\nHajime sighs. \"Of course,\" he says. \"It's our thing, right?\" He smiles over his shoulder at Oikawa, despite his distraction. \"You haven't talked about anything but that movie since we saw the first trailer months ago, Oikawa.\"\nOikawa grins back at him, and produces an ID with his free hand, holding it in front of Hajime's face. Hajime's eyes cross as he tries to read it. It's his. He snatches it out of Oikawa's hand. \"Where did I…?\"\n\"In the bathroom,\" Oikawa says. \"You're always misplacing your stuff, Iwa-chan. It's a good thing you've got me to find it for you, right?\"\n\"Yeah, yeah,\" Hajime says, panic subsiding now that he's got his ID. \"Thanks, I guess.\"\n\"Such manners, such pizazz,\" replies Oikawa. \"Iwa-chan, no wonder you're such a hit with the ladies.\"\n\"Which one of us has a girlfriend?\" Hajime says, and Oikawa's eyes flash, his smile shrinking slightly before it gets exponentially bigger.\n\"I'm too great a gift for just one woman.\" Oikawa gives him a peace sign.\nHajime laughs, reaching forward and pushing Oikawa's hair out of his face, holding on to a handful of it and pulling lightly. \"Thank you for finding my ID, oh great gift to women everywhere.\" Then he cups Oikawa's cheek.\nOikawa wraps his fingers around Hajime's wrist. \"Don't be late, Iwa-chan,\" he says, pulling Hajime's hand from his face. \"Ten minutes.\"\n\"Shit,\" Hajime says, and then he's out the door.\nHe has lunch with Mayumi. Today's bento looks like a volleyball court, with a floor of rice and demarcations done with salmon roe.\n\"Someone's hungry,\" she says. \"No time for breakfast?\"\n\"Couldn't find my ID,\" Hajime says. \"Oikawa found it for me, though, so I made it to class on time.\"\n\"That was nice of him,\" Mayumi says. \"It's good you weren't late.\"\n\"I wouldn't have been late if Oikawa hadn't made me watch six episodes of 'Real UFOs' last night,\" Hajime counters. \"He always forgets I'm not nocturnal like he is.\"\nMayumi frowns. \"You have to tell him 'no' if you don't want him to take advantage of you.\"\n\"He's not taking advantage of me,\" Hajime says. \"He gets excited about things. That's just how he is. He's totally self-centered about it, sometimes, but...\" He smiles to himself. It's kind of cute to him, when Oikawa is genuinely enthusiastic about things. \"Anyway, I like 'Real UFOs'. It's better than the last show he binge-watched, with the haunted houses.\"\n\"I'm sure,\" Mayumi says, quietly. She looks down at the table, tapping her nails in an aimless pattern, before she looks up again, suddenly bright. \"Oh, make sure you get a lot of sleep on Wednesday night, Hajime!\"\n\"Why?\" Hajime asks, wiping a piece of rice from his lower lip.\n\"I have a surprise for you,\" says Mayumi. \"Remember how I was telling you that the Hawks would be playing here in April? It's Thursday, against the Golden Eagles.\" Mayumi lights up the way she only does for baseball. \"I got us tickets!\"\n\"This Thursday?\" Hajime asks. \"As in three days from now?\"\n\"Yes,\" Mayumi says. \"I know it's not a ton of notice, Hajime, but I really didn't think my sister was going to pull through on the tickets.\"\n\"Ah,\" Hajime says. \"Actually, I'm not free on Thursday, Mayumi. It's opening night for 'Galactic Ace' or whatever, and Oikawa and I—\"\nMayumi narrows her eyes. \"These are tickets to a live game, Hajime, of my favorite baseball team. Can't you just go see the movie on Friday?\"\nMaybe a normal person could, but Oikawa is an obsessive freak, and he belongs to way too many online boards to see movies more than twenty-four hours after they open. Hajime can barely use the internet, but he's gotten used to Oikawa's idiosyncrasies about watching opening night. It's… Hajime closes his eyes and rubs at his temples. \"Well…\"\n\"You're dating me, not Oikawa,\" Mayumi says suddenly. \"You know that, right?\"\n\"Obviously?\" Hajime doesn't get it, but Mayumi is looking at him so seriously that he swallows and nods. \"Why would I be dating Oikawa? The game sounds great, Mayumi. I'll tell Oikawa we'll have to watch Friday.\"\nHajime puts it out of his mind until he sees Oikawa again in the early evening. Practice had been canceled today, and so Hajime had attended an extra study session for his economics class.\nOikawa's waiting with dinner when he gets home, his feet up on the kitchen table next to a big open container of gyoza. His fingers are sticky with soy sauce.\n\"It was my turn to get dinner,\" Hajime says, and Oikawa rubs his neck.\n\"I'm the best roommate in the world, to be honest,\" says Oikawa. Hajime can read between the lines. You seemed busy and I wanted to help, is what Oikawa means, but he can't just say that. Affection bubbles in Hajime's stomach when he realizes it's from his favorite place. It climbs up his throat and threatens to choke him.\nEven when he's being nice, Oikawa gives him indigestion.\n\"What's with that face?\" Oikawa says. \"More unpleasant than usual.\"\n\"So,\" Hajime says, sitting down across from Oikawa at the kitchen table, breaking his wooden chopsticks over yet another night of takeout and frowning when thin wood splinters fall into his radishes, \"it turns out I can't make Thursday.\" He takes the back of one of his chopsticks and pokes hard at Oikawa's foot, prompting him to move it off the table.\n\"What?\" Oikawa, who has just completed making a smiley face with his garnishes, sits up straighter. \"We have to go to opening night, though. We always…\" He drops his gaze, stemming the flow of words.\n\"Mayumi got tickets to a baseball game,\" Hajime says, helplessly. \"For Thursday. So I'm going to that.\"\n\"Oh,\" Oikawa stabs his smiley's left eye with his own unevenly broken wooden chopstick. He looks up at Hajime through his lashes, and Hajime waits for the icy remark, but Oikawa just drops his gaze again. \"I'm sure I'll find someone to go with me.\"\n\"We could just go on Friday,\" Hajime says. \"One day late won't make a big difference, right?\"\n\"All the spoilers will go up,\" Oikawa says, glaring at Hajime like he's just said something terrible, instead of the perfectly normal suggestion of waiting a day to watch a movie. \"You know that. Do you know how long I've been waiting to see this movie? I'm not letting it get spoiled for me.\"\nHajime licks at the corners of his mouth. Oikawa has been waiting a long time to watch it, Hajime thinks. He'd been mentioning it all the way back in early March, extorting a promise from Hajime to go with him on opening night. Hajime had easily agreed, then, and agreed again this morning, but...\n\"Mayumi can't really change the dates on the tickets for the game,\" Hajime says gruffly. \"Her favorite team is the visiting one. Sorry, Oikawa.\"\nOikawa waves a hand at him dismissively, looking everywhere but at Hajime. \"I don't have a lack of people to invite out to the movies, Iwa-chan,\" he says, sounding like he couldn't care less. But Hajime can see that Oikawa's shoulders are tense, and his lower jaw is thrust forward in a stubborn refusal to admit he's upset. \"Maybe Reiko-chan will go with me.\"\n\"Reiko?\" Hajime doesn't often get names, for Oikawa's companions, dates or otherwise. Usually it's just \"this adorable second year,\" or \"ahhhh, a graduate student I've wooed with my flawless face\" or \"my future protégé\" or whatever. Reiko, though, seems like someone whose name warrants mention, and Hajime picks at his donburi as he waits for an answer.\n\"Yes, my hero, Reiko-chan,\" Oikawa replies, taking a bite of his chicken before folding his arms behind his head. He's still not looking at Hajime.\n\"Hero...\" Hajime taps his chopstick on the edge of the Styrofoam container keeping his dinner warm. \"You don't mean the firefighter, do you?\"\n\"I do,\" Oikawa says. \"She's a great conversationalist,\" he adds. \"Unlike others I might mention.\"\n\"You've been hit in the head too many times if you think you're a great conversationalist. I don't trust your judgement.\"\n\"Either way,\" Oikawa says, \"it's fine if you… go to your baseball game or whatever. You don't have to see the movie with me at all, if you don't want to.\"\nThe end is petulant, and Hajime knows it. The thing is, he does want to see the movie with Oikawa. He loves the way Oikawa's face lights up during them, and the way he folds his long legs up into the seat like a child at the theater and spills popcorn everywhere when he's laughing at Hajime for being scared. Hajime always glares at him, but in the end Oikawa usually presses his thigh to Hajime's comfortingly, to remind him he doesn't have to be scared, and Hajime leans into Oikawa's space so that he can hide his own tiny screams under the higher volume of Oikawa's delighted shrieks.\n\"You know I like watching movies with you,\" Hajime say defensively. \"It's just once, Oikawa.\"\n\"No,\" Oikawa says, looking straight at Hajime. \"This is just the first time.\"\nHajime opens his mouth to protest, but then Oikawa is pasting a huge smile on his face. \"It's fine, Iwa-chan! Don't stress. You'll get wrinkles like Sawamura.\"\n\"Sawamura doesn't have wrinkles,\" Hajime replies, letting Oikawa change the subject. Discomfort is gnawing at his belly.\n\"He has pre-wrinkles,\" Oikawa amends. \"Probably from prolonged exposure to Tobio-chan and his subjects.\" He nods with faux sagacity.\n\"I've had even more prolonged exposure to you,\" Hajime replies. \"I probably have ulcers.\"\nOikawa's expression in response to that is beatific. \"My amazingness can be hard for some to handle,\" he says. \"It's a good thing you're made of sterner stuff, eh, Iwa-chan?\"\nHe doesn't mention the movie again for the rest of the week. It's almost like he's talking around it, and Hajime isn't sure if he should even bring it up again.\nOikawa has class first on Thursdays, and he leaves quietly, without even waking Hajime up. Hajime comes awake anyway, while Oikawa is in the shower, and hugs Oikawa's pillow, looking over at the bed on the other side of the room that's never been used.\nMayumi is wearing a Hawks jersey and a Hawks baseball cap when Hajime meets her at the train station. She hands him two inflatable boom sticks, and Hajime claps them together and smiles.\nHer excitement is palpable, and Hajime is struck again with how much she reminds him of someone. They laugh and tell jokes the entire ride to the stadium, Mayumi holding on to the strap of his bag as he grasps the train handle. She fits neatly against him, rambling off player stats as Hajime humors her. He'd do the same thing if it were volleyball.\nBut even though he's having fun, he keeps checking his phone.\nHajime had only ever skipped out on their alien movie opening night movie tradition once before. He'd been sick, so sick his mother had forbidden Oikawa to visit, and he'd been delirious with fever. His mom had had to call Oikawa to tell him Hajime was most certainly not going to a movie. Oikawa had sent him text updates, probably to the ire of everyone else in the theater, and Hajime had felt a little better knowing Oikawa was wishing he was there.\nHe doesn't know why he's expecting texts from Oikawa now, when Hajime isn't sick at all, and had just chosen to do something else, but he can't stop himself from checking.\n\"Was Oikawa mad at you for coming with me today?\" Mayumi asks, out of nowhere, halfway through the game, and Hajime looks up from his phone.\n\"Mad?\"\n\"Yes,\" Mayumi says. \"Did he get mad at you?\"\n\"No,\" Hajime says. \"He… wasn't happy, but he wasn't mad. He really wanted us to go see that movie.\" He scratches the side of his face. \"It's our thing.\"\n\"Doesn't he have other friends he could go with?\"\n\"He does,\" Hajime says. \"He went with one today, apparently, but… Well, he doesn't have a lot of good friends. Oikawa... had trouble making friends when we were younger. Even now he's still got a talent for holding people at arm's length. So he has other friends, but they don't know him like I do. They can't tell the difference between when he's posturing and when he means it.\" He frowns. \"Oikawa is very kind and very loyal, but he doesn't like people to know too much about him.\"\n\"Why not?\" Mayumi asks. \"He should make more friends. Then he wouldn't rely on you too much.\"\n\"He doesn't rely on me too much,\" Hajime snaps, and then smiles to soften it. \"There's nothing wrong with having a best friend.\"\n\"You keep looking at your phone,\" Mayumi says, staring out at the field. \"Like you'd rather be with him than me.\"\nHajime grips his knees. The truth is, maybe he would, and he feels terrible about that, honestly, but even though Mayumi is awesome, Oikawa at a movie opening is one of Hajime's favorite things.\nMayumi is his girlfriend, though, so Hajime puts his phone in his pocket. Then he picks up her hand, her very small hand, and holds it. With his other hand, he straightens her Softbank Hawks hat. \"We're only losing by two runs,\" he says. \"We can still make a comeback.\"\nMayumi's expression lightens, and Hajime smiles down at her.\nWhen he gets home, tired and wearing his own new Hawks cap, he expects to find Oikawa sprawled on the couch watching 'Real UFOs'. Instead the apartment is empty and dark. The movie should have been over hours ago, Hajime thinks, and he sits down on the couch, lost with what to do in the silence. He turns on the television and dozes to a drama, not waking up until he hears the front door opening.\nIt's Oikawa, of course, his arm around a pretty woman with bright pink lipstick and long dark hair. He's leaning on her heavily, and she's laughing at whatever he must have said before he opened the door.\n\"You're here,\" Oikawa says blankly, and Hajime scowls at him.\n\"I live here,\" he replies. \"You're totally wasted, aren't you?\"\n\"Aw, Iwa-chan, were you worried about me?\" Oikawa slurs, and he stumbles forward, overbalancing the woman. Hajime reaches for him instinctively, taking Oikawa's weight and wrapping arms around him to hold him up. He almost gags at the smell of liquor. \"Good.\"\n\"Good that I worried?\" Hajime asks. \"Brat.\" He runs a hand in soothing circles on Oikawa's back. \"You're going to be so hungover tomorrow, Trashkawa.\"\n\"Well, now that I've delivered you to your Iwa-chan, Tooru, I'm going home.\" The woman straightens her jacket and tosses her hair over her shoulder. She's stunning, Hajime thinks. Just the kind of older woman Oikawa would go for, with her perfectly manicured nails and confident smile.\n\"Thanks for going to the movie with me, Reiko,\" Oikawa mumbles, the words garbled by Hajime's shoulder, but the woman —Reiko— laughs and Hajime doesn't like how easily she pats his shoulder, like she's used to touching him. It's silly, but Oikawa like this doesn't know what he's doing, maybe, and Hajime is just… looking out for him. \"I'll call you next Friday, you can have this Friday off.\"\nHajime blinks as Reiko gives an affirmative noise. \"Sure thing, Tooru,\" she says, and then she lets herself out, closing the door behind her and leaving Hajime with an armful of drunk Oikawa in the middle of the hall, still wearing his shoes.\n\"What am I going to do with you?\" Hajime asks, more to himself than to Oikawa, but Oikawa uses both hands to grab Hajime's sweatshirt and holds on like Hajime's trying to pull away. Hajime isn't.\n\"Don't like anyone more than me,\" Oikawa says. Maybe it's what he says. It's hard for Hajime to make out, because Oikawa's tongue is tripping over the words and his face is tucked into the hollow between Hajime's neck and shoulder now. Every breath he takes is heavy and hot, sticky on Hajime's skin.\n\"You're such a dumbass,\" Hajime replies, voice catching.\nThey stand there until Oikawa starts to fall asleep standing up, and then Hajime guides him to bed, pushing him down before pulling off his shoes. With both of them still in their clothes, he tucks them under the covers, Oikawa reaching for him with his eyes closed. \"Come closer,\" he says to Hajime, lips pink and skin flush. \"You get cold and I'm always warm.\"\n\"Okay,\" Hajime says, and he's so tired that he falls asleep almost immediately, Oikawa's alcohol breath blowing at his eyelids and his knee sliding between both of Hajime's when he snuggles even closer.\n \n★ ★ ★\nThey always do their laundry on Saturday mornings. They have a washing machine under their sink, but no dryer, so they hang things up to dry along lines in the back of the living room, and now that it's warm enough, they can start using the tiny balcony barely big enough for one person to stand on to hang the heavier stuff to dry outside.\nThey've got it down to a routine, but of course, with Oikawa, things like that can always go awry. That's why Hajime is stripping out of his soap covered sweatpants and T-shirt and shoving them into the wash with everything else he's worn this week and Oikawa's doing the same.\n\"Now I know how you blew up your kitchen,\" Hajime says. \"I suppose I should have been expecting more accidents and I've just gotten lucky?\"\nOikawa is squatting down in front of the washing machine, and Hajime takes in the bruises on his back from a tough fall he'd taken in practice yesterday. His underwear is riding low on his hips, and the bruise dips all the way to his tailbone, probably. Hajime realizes where he's looking and glances away before Oikawa notices. It's not like he's never noticed that Oikawa's got a nice back before, anyway. He does, though, Hajime thinks. Broad and strong. Dependable. Not words many people think to associate with Oikawa, but Hajime knows better.\n\"It's just a little soap, Iwa-chan,\" Oikawa says, standing up after closing the door to the washing machine. \"How was I supposed to know that you hadn't put the cap on the laundry detergent tightly enough to survive a friendly game of catch?\"\nHajime looks around for a volleyball to whack the back of Oikawa's head with, but none are at hand, so he settles for a glare. \"One day, Oikawa.\"\n\"Promises, promises,\" Oikawa almost sings, and Hajime huffs. \"Doesn't this feel super domestic, Iwa-chan?\"\n\"What.\" Hajime scratches at his bare chest. He should probably go hop in the shower before he gets redressed. He can feel soap residue on his skin. Oikawa doesn't seem to be in a hurry to claim the shower from him, lounging against the counter, one hip cocked.\n\"Be my house-husband, Iwa-chan.\"\n\"No thanks,\" Hajime replies quickly. \"Anyway, do you remember what we were talking about before you served the laundry detergent from across the room?\"\n\"Spring Highs,\" Oikawa says sweetly. \"You're so tense, Iwa-chan.\"\n\"We're going, right?\"\n\"Why should I?\" Oikawa answers. \"Karasuno can fuck off and die, that's my Golden Week vacation.\" He taps his chin thoughtfully. \"Although I do wonder if we could poach Tanaka for our team next year.\"\n\"You're not the captain anymore,\" Hajime reminds him. \"Besides, I hear he's not going the college route.\"\n\"Too bad,\" Oikawa says. \"That means I have even less reason to go~\"\n\"It's Karasuno versus Seijou,\" Hajime says. \"I think it'd cheer the team up to see their former captain rooting for them. They might even beat Kageyama with that kind of support.\" Kindaichi would love to beat Kageyama again, Hajime is sure. He likes Kageyama's upset face almost as much as Oikawa does.\n\"Hmm,\" Oikawa says. \"That argument is compelling…\" He grins, devious, at Hajime. \"The things I do for you, Iwa-chan.\"\n\"Don't you mean the things you do to hammer down Kageyama?\"\n\"He's certainly a nail that sticks up,\" Oikawa says, eyes glinting. \"I want to watch the joy leave his eyes.\"\n\"Kageyama's not a bad kid,\" Hajime says, and Oikawa pouts at him.\n\"You're supposed to be with me on this,\" he says. \"I'm trying to help him grow.\"\n\"Sure, sure,\" Hajime says, smiling at Oikawa, who is smirking back. \"Whatever, Oikawa.\" He stretches his arms up, and Oikawa saunters closer to him, spinning him around and pulling out the back of his underwear.\n\"No name in these, either,\" he says, and Hajime growls, going immediately for the ticklish spot on Oikawa's neck as Oikawa shrieks with laughter.\nBut Oikawa's still bigger than Hajime, and faster. They're about equally strong, but Oikawa gets Hajime pinned pretty fast anyway, simply because Hajime always forgets he's twice as ticklish as Oikawa every time they start something like this.\nSkin slips against skin as Hajime struggles, but then Oikawa sits on his thighs, and Hajime gives it up as a bad job. He's about to ask Oikawa if he remembers the last time this happened, but when he opens his eyes, Oikawa is closer than he expects.\nThe first thing Hajime notices is Oikawa's mouth. His lips are parted, because Oikawa never remembers to breathe through his nose when he's excited. Then he notices the position they're in, and something that isn't exactly embarrassment rushes through him like a tidal wave, drowning him in whatever it is and making him hot from head to toe.\nOikawa looks down at Hajime, a hand on each of Hajime's wrists. His thighs are warm on either side of Hajime's hips, and Hajime's breath is coming quickly, quicker than it should be from such a short wrestling match.\nA red flush runs down Oikawa's muscular chest, across his pectorals and Hajime's eyes wander down, to the dip in his belly and the thin line of hair that disappears down under the band of his underwear. \"Oikawa?\"\nHis heart is hammering against his ribcage. Oikawa is so close, and Hajime is acutely aware of everywhere they touch.\n\"Iwa-chan,\" Oikawa says, low voiced and serious, and Hajime's eyes fly up to meet Oikawa's. \"Hajime. I want—\"\nHajime's phone rings. \"Um,\" he says. \"That's Mayumi.\"\n\"Right,\" Oikawa says. \"Kawasaki.\" He lets go of Hajime's wrists and straightens, graceful even like this, all of his muscles moving smoothly under his skin. He slides off Hajime, and Hajime shivers, suddenly cold. \"You should get that.\"\n\"Yeah,\" Hajime says, confused, his mouth dry as he watches Oikawa stand and walk over to the clothes they'd hung last week and never taken down, pulling off a shirt and shorts as Hajime picks his phone up off the kitchen table. He's missed the call. \"What are you doing?\"\n\"I just remembered I need to go run an errand,\" Oikawa says, not looking in Hajime's direction. \"I'll be back in a little while.\"\nThen he's gone, and there's nothing for Hajime to do but call Mayumi back.\n\"Hey,\" Mayumi says. \"Were you busy?\"\n\"Not really,\" Hajime replies. He's sitting in his underwear on the kitchen table. His body feels like it's on fire. He still feels a tingle everywhere his skin had touched Oikawa's, which is dumb, considering they sleep in the same bed and curl up on the couch and all these other things that don't make Hajime feel like he's going to burst into flames.\nMaybe, Hajime thinks, it had been the look in Oikawa's eyes that had made it different.\n\"Are you okay?\" Mayumi asks, when Hajime doesn't elaborate. Hajime presses a fist into his stomach, trying to stop the knotted up feeling there.\n\"I'm fine,\" Hajime replies, but he has his eyes on the door, through which Oikawa had left without looking back, and wonders what Oikawa had been going to say.\n \n★ ★ ★\nHe finds the apartment listings by accident.\nThey're on Oikawa's mostly unused side of the bedroom, in a notebook on the bed. Hajime's misplaced his ID again, and he thinks to himself, briefly, oh, maybe Oikawa found it and looks in the front cover of the notebook just to see if Oikawa had stashed it there to return later, and that's when he sees them.\nOne bedroom apartments available for lease in June.\nWhen Oikawa comes home, Hajime watches him. Oikawa's been spending less time at home, less time with Hajime, ever since Saturday, and Hajime had been trying not to worry about it but now...\n\"Is something going on?\" Hajime asks, when Oikawa has settled down on the living room floor with his laptop, wrapped from head to toe in blankets and preparing for one of his all-nighters.\n\"What do you mean, Iwa-chan?\"\n\"I mean,\" Hajime says, \"why are you looking at apartments?\"\nOikawa freezes, and then visibly forces himself to relax. \"I thought you wanted to live alone, Iwa-chan! I'm just trying to be a good friend.\" He wags a finger. \"The kind of friend who doesn't look through his friend's things.\"\nHajime does not point out that the first thing Oikawa did when he moved in without asking was look through Hajime's underwear drawer. \"I've already gotten used to having you around, so what's the point?\" He sits down next to Oikawa on the floor, pulling at the blanket over Oikawa's head until it falls to the floor between them. Now he can see Oikawa's face. \"Is something wrong with the way it is now?\"\n\"What if you want to bring your girlfriend home, Iwa-chan?\" Oikawa waggles his eyebrows, and Hajime blushes at the insinuation, but he's more interested in the tightening around Oikawa's eyes.\n\"I'd ask you if you were okay with it, first,\" Hajime says, lowly, refusing to look away from Oikawa's face, because he knows if he does, he'll miss something important.\n\"And what if…\" Oikawa clutches his blankets tighter around himself, \"I'm never going to be okay with it?\"\nHajime frowns. \"Why wouldn't you be?\"\n\"Because I'm jealous,\" Oikawa says, after a silence that stretches far longer than it should.\n\"Why?\" Hajime presses. \"You can have any girl you want, and don't you have your firefighter? Reiko, or something?\" He can still vividly remember her face, and her bright pink lipstick, and the way she'd touched Oikawa so casually.\n\"I'm not jealous that you have a girlfriend,\" Oikawa says, looking up at the ceiling. \"I'm jealous that your girlfriend has you.\"\n\"What?\" Hajime yanks on Oikawa's blankets when he tries to pull them up higher to compensate for the one Hajime'd already disposed of. \"What are you talking about?\"\n\"Reiko's just a friend, Iwa-chan.\" Oikawa laughs, letting the blankets go with one of Hajime's final tugs. He looks naked without them. \"She gave me her number when she found out I'd started that fire while I was making Christmas chocolates for my best friend who would probably never love me back, in case I ever needed someone to talk to.\"\n\"Is this a joke?\" Hajime asks, still holding the blankets. \"Have I not been paying enough attention to you, or—\"\n\"When you started dating Kawasaki, I thought I'd be able to give up,\" Oikawa continues. \"It turns out, though, that I'm still not very good at giving up. I'm too stubborn, and I have too much pride.\"\n\"What the fuck, Oikawa?\" Hajime is biting his lip so hard it's starting to bleed.\n\"It was all right if you didn't love me the same way when I was still most important, but…\" Oikawa runs a hand through his hair, the same way Hajime does, when Oikawa's lying in his lap demanding to be petted. Hajime can barely hear anything over the roar in his ears. \"Ah, now I'm not that, either.\"\n\"Stop messing around.\"\n\"I'm not.\" Oikawa pushes his laptop away. \"The thing is… I'm used to second place. Second best setter to a prodigy, even when I won the game and won the award. But I've never been second place with you, and... I wanted to win this time, I wanted to be the only person you looked at. Or the first, really. Just the first. But here I am again, so good but not good enough.\" He shakes his head. \"Because you love me, but the fact that it's not the way I love you is really…\" He licks his lips. \"I was going to tell you, on Saturday. I wanted to kiss you. But then Kawasaki called, and…\" Oikawa looks at him, eyes luminous and beautiful, even in the cheap overhead lighting of their apartment. \"I can't do this anymore. I want to keep you, but I have to change something.\"\nHajime stares at Oikawa, eyes so wide they're going dry, and Oikawa laughs bitterly at the look on his face, right before his own twists up. His whole body curls inward, toward his knees, torn between lashing out and crying. This is normally when Hajime tells Oikawa \"everything's fine\", that they'll \"definitely come out on top next time\", or that Oikawa's his \"favorite setter… or something like that\".\nThat's what Hajime would normally do, but he can't bring himself to move. He just keeps looking, and Oikawa is looking back, and all sorts of things slide into place during that stare. \"You really like boys?\" he asks, and then shakes his head, because that's not the important part. \"You're… you're really in love with me?\"\nAnd Oikawa's looked this way before, after that last loss second year to Shiratorizawa, when he'd stood in front of Ushijima, who smirked condescendingly at him from the other side of the net. Helpless, and kind of lost.\nHajime's going to be sick. \"How long…?\" He runs a hand through his hair. \"Oikawa, how long have you even—\"\n\"I don't know,\" Oikawa replies. \"High school? Middle school?\" He gives Hajime his biggest, falsest grin, but it's crumbling at the edges. Hajime's chest is so tight that it feels like his ribs are collapsing in on his lungs, making it impossible for him to take a breath. \"Maybe forever, Iwa-chan.\" Oikawa’s smile turns wobbly. \"None of the other kids noticed me at all. Only you.\"\n\"I…\" Hajime flounders, trying and failing to put it all together in his head.\nOikawa stands up, shedding the last of the blankets, and picks up his backpack. \"Anyway,\" he says, voice wavering even as he tries to sound cheerful, \"I've got places to be, and things to do.\"\n\"But—\" Oikawa's barely dressed to go out. Just a pair of athletic shorts and an old Seijou practice tee. He'll get sick, Hajime thinks faintly. He should stay here.\n\"I'll see you around, Iwa-chan,\" he interrupts, before Hajime can even figure out what he needs to say.\nThen Oikawa is gone, out the door of their apartment, and Hajime is left sitting alone in the living room, staring at the closed door and feeling like his whole world has crashed down around him.\n \n★ ★ ★\n\"I'm still your best fucking friend, Trashkawa,\" Hajime says to voicemail after the fifth unanswered call. \"So stop being stupid, if you can manage that for five minutes of your trash life.\" He regrets it briefly after he hangs up, but then he remembers that Oikawa had left the apartment three days ago without even giving Hajime a chance to process anything he said, and that he hadn't come back, so Hajime figures Oikawa deserves it.\nOn the fourth day, after two more unanswered calls, and three possibly unread texts that said some variation of ARE YOU DEAD?, Hajime feels like crawling out of his skin like a lizard in the summer. His homework is all done, caught up until after the holiday, and the silence in the apartment, without Oikawa's off-key humming, is starting to make him anxious.\nNot to mention the giant elephant that seems intent on following him around from room to room, trumpeting Oikawa's in love with you every time he doesn't have enough to do.\nEventually he caves and texts Sugawara to meet him at the gym if possible, and Sugawara sends back a few smiley faces in reply, which Hajime assumes is the affirmative.\n\"Is Oikawa sick?\" Sugawara asks, walking into the gym an hour later, and Hajime shakes his head.\n\"No,\" he replies. \"Well, I don't know. I don't think so.\"\nSugawara's arms cross, and one eyebrow lifts inquisitively. \"So why are you practicing with me, when your best friend is the setter you always play with?\" Sugawara's foot is tapping, in that way that tells Hajime Sugawara has an idea of the answer already. Sugawara's like that.\nHajime gulps. \"I called him a bunch of times this morning. He hasn't answered.\"\n\"Is that normal?\" Sugawara asks, running a hand through silvery hair. \"For him not to answer a call from you, I mean.\"\n\"I don't know,\" Hajime replies. \"I don't usually call him.\" He's usually already with me, Hajime thinks. Oikawa is always there, making noise and distracting him from more homework, or pestering him to go see a movie, or making him laugh with one of his cocky self-aggrandizing jokes, or… Hajime is just used to Oikawa being around, because it's always been that way.\nHajime had secretly thought it always would be, before Oikawa had shifted the world beneath him.\nFrustrating as always.\n\"So do you wanna play, or did you wanna talk about it before you mutilate that poor ball?\" Sugawara's gaze is inquisitive, and Hajime looks down at the ball in his hands. He'd been squeezing it too hard.\n\"Play,\" Hajime says. \"I really need to play, because otherwise I can't think. I don't know what to really say yet, anyway.\" He runs a hand down his face. \"Or what to think.\"\n\"That's fine,\" Sugawara says. \"I'll do a few soft serves to you, and Daichi will be here after he finishes his homework, so he can throw in for us.\"\nThey play for almost twenty minutes, just trying out receives to sets to spikes, before Sawamura shows up, along with Azumane, who Hajime hasn't seen in a long time— maybe since the Spring Highs, over a year ago.\nHe's still a shrinking violet hidden in a massive body, smiling softly in greeting and straightening his back only after Sugawara slaps him gently between the shoulders. \"I hope you don't mind me joining you,\" Azumane says. \"Haven't gotten the chance to play in a long time.\"\n\"Asahi studies physics,\" Sawamura says. \"I think he gave up on having a life,\" and Azumane laughs, one hand sheepishly running through his long hair.\nThey split into two on two, Azumane playing with Sugawara while Hajime plays with Sawamura. It allows Hajime, for the next forty minutes or so, to think about nothing but getting past Azumane's high blocks and matching with Sawamura's solid but slightly slow receives.\nAzumane excuses himself, then, claiming he's got to get home, and Hajime collapses onto the gym floor, muscles burning.\nSugawara offers to get them sports drinks from the vending machine, volunteering after Hajime and Sawamura try to rock-paper-scissors over it. \"You two are the starters,\" Sugawara says. \"Shouldn't this have worn me out more than you?\"\n\"You're the best,\" Sawamura says, sitting down next to Hajime on the floor, the net looming over them. Sugawara puts a hand on the back of Sawamura's sweaty neck, smiling when Sawamura leans into it.\nThey're close, Hajime thinks. Like Hajime and Oikawa are close, maybe.\nWere close? Oikawa hadn't answered any of Hajime's calls, and Hajime had let Oikawa leave after everything.\n\"I'm sure Suga offered to talk about it with you,\" Sawamura says, dragging Hajime out of his thoughts. He's picking at the tape coach put down last week for drills with one fingernail, and not looking at Hajime. \"But same for me, you know? We're teammates now. Oikawa too.\" Sawamura smiles. \"I don't know if I can help, but Suga has always told me I'm a pretty good listener.\"\nHajime watches as Sawamura continues to peel up pieces of the blue adhesive. \"Oikawa's in love with me,\" he says, finally, and Sawamura peers up at him, hand stilling.\n\"Yeah,\" he says. \"Suga and I couldn't decide if we should tell you.\"\n\"Is that why Sugawara asked about Oikawa, that time at the movies?\" Hajime asks dully. \"Because you knew?\"\nSawamura doesn't say anything, just starts in again on the tape. \"We both sort of thought you knew, until then. Maybe that you…\" He peels up a particularly long piece, then, and it sticks to his fingers. \"Suga's better at talking about this kind stuff than I am, but, well... You never really turned down his advances or anything, so we assumed…\" Sawamura flushes, then.\n\"You thought I felt the same,\" Hajime realizes, and Sawamura's eyes are fixed on the floor.\n\"Are we talking about Oikawa?\" Sugawara asks, and Hajime looks up to see a bottle of Kalpis thrust toward him. Sugawara is smiling down at him. Hajime blushes, and takes it from Sugawara, opening it immediately to wet his suddenly dry mouth.\n\"Did everyone know but me?\" Hajime takes another long drink, letting his eyes fall closed as Sugawara sits down on the floor next to Sawamura. \"How Oikawa felt?\"\n\"It's probably a little more obvious for Daichi and I,\" Sugawara says, and Hajime opens his eyes to look at Sugawara and ask why, but then he sees their hands, casually laced together, Sawamura's thumb running across Sugawara's knuckles.\nAll of Oikawa's digs and Sawamura's blushes make sense now, Hajime guesses. Everything that's been puzzling and frustrating him in the past five months makes sense now, in light of all the new things Hajime is learning about his friends.\nHajime isn't sure how he managed to miss it all.\n\"Oh,\" he says, and Sugawara laughs, while Sawamura smiles crookedly. \"I didn't… know, I guess.\" He chuckles. \"I guess I don't know anything. I didn't even think…\" Hajime scratches at the back of his head. \"My whole life, I always thought, yeah, Oikawa's my best friend, and some day I'll get married and he'll get married and…\" He exhales. \"I never thought about the fact that my wife wouldn't have a place to sleep, because Oikawa takes up the whole bed, or that she'd have to understand that I can only see her on the weekends because Oikawa's prone to working too hard on serves if left to his own devices.\" He drops both hands into his lap, and twists them together. \"I've never had to think about it.\"\n\"Now you do,\" Sugawara says. \"Not just for Oikawa's sake, but for your own. What do you want?\"\n\"I have a girlfriend,\" Hajime says. \"I really like her.\" His thoughts are racing. Sugawara and Sawamura are… He clutches the fabric of his shirt tight into a fist, just in front of his heart. Oikawa had known about them, and he'd looked at their relationship and wanted something like that… from Hajime…\nOr maybe, Hajime realizes, he just wanted more, and that's… He's finding it hard to breathe.\n\"And didn't she remind you of anyone?\" Sugawara asks, before clapping hand to mouth as Hajime stares.\nSawamura stretches his legs out in front of him, clearing his throat and jolting Hajime back into the now. \"I think I can run through another set of receiving drills, if you two will toss-spike.\"\n\"Yeah,\" Hajime says, needing to get his mind off it again. \"Please.\"\nSugawara gives him a hand up. \"You don't have to figure out how you feel all at once, Iwaizumi,\" Sugawara says, bouncing the ball back and forth from hand to hand. \"As long as you try to figure it out.\"\nBack at home, Hajime takes a long shower, letting the hot water wipe away the chill from the walk home as well as the knots up and down his spine. He doesn't feel much better when he emerges, clean and cold, wrapped in a towel. He goes into his room and grabs a clean pair of underwear, and almost drops them when he realizes his name has been written on the inside with black marker, in Oikawa's scribbly, childlike handwriting. Hajime laughs, and then he's mortified when his eyes start to sting, like he might cry or something horrible like that.\nOikawa's shit is all over the apartment, and everywhere Hajime looks he finds something Oikawa hadn't put back in its proper place. There are pieces of Oikawa everywhere that Hajime looks, and Hajime had wanted to clean up, to distract himself by doing all the tidying Oikawa always interrupts him doing, but instead all he can see are reminders of how his life is just like this apartment, littered with evidence that Oikawa has been there and moved things around.\nHe picks up Oikawa's favorite shirt just outside the bedroom door, the AREA51 shirt with its stretched out neck and garish colors. Oikawa had been wearing this shirt when he'd met Mayumi for the first time.\nHajime can remember hundreds of times, actually, that Oikawa had worn this shirt. (\"One day,\" Oikawa had said, when he'd bought it, \"you'll realize how great my taste really is.\" Hajime had snorted. \"Not if you wear that shirt around as a reminder of the truth.\")\nHajime crushes the shirt in his hands.\n\"It really is an awful shirt,\" he says aloud, like it'll summon Oikawa to its defense.\nIt doesn't.\nIf Hajime imagines his life going the way he'd hazily predicted before, with a faceless wife he hasn't met yet, in a clean and quiet house in a calm neighborhood— without the tackle-fights over the laundry, or Oikawa curled up against him on the sofa as they watch trashy alien movies, or falling asleep to Oikawa's even heartbeat in time with his own while curled up in Hajime's bed… If Hajime imagines that, seriously tries to picture it, it's all wrong.\n\"What do you want?\" Sugawara had asked him, and Hajime had thought he didn't know, but the truth is… maybe he does. Maybe what Hajime wants is what he's unknowingly had all along. His best friend, of whom he knows the very worst as well as all the very best, and who has always been there, through everything in Hajime's life. Maybe Hajime wants to spend his evenings carding his hand through Oikawa's hair and fending off Oikawa's jokes, and making sure that Oikawa knows that to Hajime, he'll never, ever, be second best.\nAnd fuck. Hajime is apparently something of a masochist, because as he stares down at the tie-dyed AREA51 T-shirt in his hands, he thinks \"I'm totally in love with this asshole, aren't I?\"\nHajime's thoughts circle around Mayumi, and about volleyball, and about the look in Oikawa's eyes, when he'd left Hajime sitting all alone in their living room, and in the end, he thinks he knows what he has to do.\n \n★ ★ ★\nHe second-guesses himself for two days.\nHis mother calls him at the end of the second day. \"Tooru is home for Golden Week,\" she says, when he answers the phone. \"Where are you?\"\n\"That slacker,\" Hajime mumbles. \"It's only Showa Day, and we had classes earlier this week.\" If Oikawa were there, on the other end of the line, he'd lecture him about only caring about girls and volleyball, but… He clutches his phone tighter.\n\"You should give him a break,\" his mother says. \"He doesn't seem like himself.\" She hums into the phone. \"It's not like him not to drag you back with him.\"\n\"I… have to talk to him about a few things,\" Hajime admits. He knows she'll read between the lines.\n\"I don't think I've ever seen you boys upset with each other before. You've always been very good about his moods, and he's always been equally good at pulling you out of yours.\"\n\"Yeah,\" says Hajime. \"Hey, Mom?\"\n\"What is it, Hajime?\"\n\"Do you think…\" Hajime hesitates. \"How do you know if you're in love with someone?\"\nHis mom makes a surprised sound into the receiver, and Hajime wishes he could take the question back. \"Is this about your girlfriend, Hajime? You've only been seeing her for a few months, right?\"\n\"It's not about Mayumi,\" Hajime says. \"It's… more complicated than that.\" He stares down at his toes, wiggling them in his holey socks. \"I mean, I think I'm in love with someone else. That I've known a long time.\"\n\"I see,\" his mother says, softly, knowingly, and Hajime takes a shuddering breath. \"You know I love you no matter what, right, Hajime?\"\n\"Yeah,\" Hajime says, wishing he felt steadier, less uncertain. He wishes that he could feel now like he does on the volleyball court, certain that Oikawa is behind him, and is going to give him a toss he can hit past the blockers with ease. \"I know that, Mom.\"\n\"Just making sure,\" she says.\nHajime stares at his cell phone long after she hangs up, before trying Oikawa again. Oikawa doesn't answer, and Hajime doesn't leave a voicemail.\n \n★ ★ ★\n\"What's up?\" Mayumi asks, curving forward to look at Hajime over her lemonade.\nHajime looks around the cafe. It's filled with couples— tall boys with short girls. Perfect looking couples, like he and Mayumi are, just the right size for him to hug Mayumi to his chest and rest his chin on the top of her head for a portrait at the park. It's everything Hajime had ever wanted out of a college relationship. It's normal and fun and low-maintenance, and Mayumi is interesting and smart and really likes a lot of the things he likes.\nHe remembers what Sawamura said to him, yesterday, after all that practice, as they'd sat on the gym floor with Sugawara, little pieces of pulled up floor tape sticking to Sawamura's thighs, shorts and kneepads. \"Sometimes it's easy to miss the thing that's right in front of you,\" he’d said, looking straight at Hajime with that confident grin that had made him Karasuno's captain. \"And sometimes we don't realize we're missing it until we're faced with not having it.\"\n\"I think…\" Hajime breathes out and closes his eyes. He opens them again when he's gathered his thoughts. \"I think we should break up.\"\nMayumi looks at him, and takes a sip from her lemonade. \"Why?\"\n\"Because I like you,\" Hajime says, \"and I think you're awesome, but…\" His tongue sticks to the roof of his mouth. \"But it's someone else I like more.\"\nBecause when Hajime wakes up in the morning, the first thing he thinks about, besides needing to piss, is whether or not Oikawa will be around for breakfast. And because when he is lonely, or sad, he doesn't want Mayumi, or even his parents - he wants Oikawa. And also because, when Hajime closes his eyes, all he can do is think about how warm Oikawa's lips are on his neck, and wonder what his tongue might feel like in his mouth.\nHe and Oikawa, despite being not much alike, have always done everything together. It shouldn't surprise Hajime that if Oikawa is in love with Hajime, that Hajime is in love with him right back.\n\"I thought there might be,\" Mayumi says. \"It's kind of… weird for me, you know, to lose you to a boy of all things.\"\n\"Did literally everyone know but me?\" Hajime isn't sure whether to laugh or cry.\n\"It was pretty obvious,\" Mayumi says, pulling on one of her pigtails. \"That he wanted you. It was probably even obvious that you wanted him, too, but I pretended not to notice that.\"\n\"I just didn't notice, period.\" Hajime drops his head to the table, and lets the impact send pain through his face. \"That guy…\" He swallows, and looks up, meeting Mayumi's gaze. \"That guy's a brat, but… I've known him so long I'm used to it.\"\n\"It's more than that,\" Mayumi says, confidently, and she offers him a crooked grin. It's… Hajime blinks. Her smile reminds him of Oikawa's smile, he realizes, and that's… Hajime might be officially an idiot. \"Should I wish you luck?\"\n\"You don't have to,\" Hajime says. \"You can hate me some, if you want.\"\n\"Can I hate you and wish you good luck?\" Mayumi asks. Her eyes are damp, and Hajime's guilty and sad but at the same time, he's oddly relieved. His hands are sweaty, so he wipes them on his jeans. \"Because trust me, you're going to need the luck.\"\n\"That sounds like a good deal to me,\" Hajime agrees, and he pays for her lemonade and his untouched coffee, and pretends not to notice her sniffling as he walks her to the train station, because he's pretty sure she's trying to hide it.\n\"I'm sorry,\" he says. \"I really had no idea.\"\n\"Well,\" Mayumi says, \"boys can be silly.\" Her voice is rough, and Hajime gives her a hug, giving her the option to reject it before he wraps his arms around her.\n\"Really sorry,\" he says.\n\"I know,\" she agrees. \"After all, who'd want to trade a great girl like me for a huge flirt like him?\"\n\"I already know it's ridiculous,\" Hajime agrees, his heart flipping in his chest. \"You don't have to remind me.\"\nShe laughs, and when she goes through the turnstile, she's still smiling.\nHajime goes home, to his empty apartment, and remembers that it had been just like this, before Oikawa had moved in at all. Clean, quiet, calm. Hajime could do his homework, if he wanted, or walk around the whole place naked. It's the privacy he'd told his mother he'd miss.\nInstead, he picks up one of Oikawa's ugly as fuck ET plushies and hugs it to his chest, leaning against chocolate stained couch cushions as he watches old episodes of 'Real UFOs' from one of Oikawa's bajillion VCDs, and tries not to miss the warmth of Oikawa at his side, enthusiastically yelling at every grainy photo of a spaceship on screen.\n \n★ ★ ★\nHajime's probably been to the Oikawa house nearly as often as he's been to his own. That's the way it is, when you grow up living on the same street as your best friend.\nBut even as many times as Hajime has been to Oikawa's house, it has never felt as scary as it does now, when Hajime has so much to say and still no idea how he's going to say it.\nOikawa's mom opens the door, smiling as soon as she sees it's Hajime. \"Oh, Hajime, I've been waiting for you to come by and drag Tooru out of his funk.\"\n\"I think I'm the reason he's sad in the first place,\" Hajime says, and Oikawa's mom gives him a long look.\n\"Exactly why you're the perfect person to fix it,\" she says, and Hajime wonders if she knows, too. She probably does. All this time, and Hajime's been the only one missing this giant thing right in front of him. \"Tooru is up in his room.\"\n\"Thanks,\" Hajime says, giving her the best he can manage in the way of a smile before making his way to Oikawa's room. He slides open the door, and Oikawa looks up in alarm.\n\"What are you doing here?\" Oikawa asks, and Hajime surveys the sheets in disarray and all of Oikawa's trophies and medals and awards lined up on the shelf. He can remember which ones had made Oikawa proud. He can also remember the ones Oikawa hadn't thought he deserved. Then he returns his gaze to Oikawa. His face is red and his eyes are puffy and swollen.\n\"You didn't answer my calls,\" Hajime says, kicking at a volleyball. Oikawa always has three or four lying around to practice tricks with. Just like back at the apartment Hajime will always think of as theirs now. \"You're the ugliest crier in the world, you know.\" He walks over to Oikawa's bed and sits down next to him, turning his torso so he can catch Oikawa's face in both of his hands. The skin is hot and wet with tears. Using his thumbs, he wipes the new tears from under Oikawa's eyes. \"That's a little better.\"\nSwallowing, Hajime looks directly into Oikawa's eyes. Now, knowing what he knows, Hajime lets himself just look at Oikawa. At the color of his eyes and the slope of his nose and the way the corner of his lips is always on the verge of a smirk. The way Hajime's heart clenches is almost painful as he drags his right hand back to trace the shell of Oikawa's ear.\n\"Iwa-chan…\"\nAnd suddenly, Hajime feels silly for having hesitated in this.\n\"Spring High finals are today,\" Hajime says, dropping his hands and leaving Oikawa gaping at him. \"Karasuno versus Seijou. We wanted to go.\" He looks around Oikawa's room and grabs the jacket on the back of Oikawa's desk chair. “Think about how disappointed Kunimi will be if his favorite captain doesn’t show up.” He tosses the jacket to him, and even after a crying jag, Oikawa's reflexes are so sharp that he snatches it right out of the air.\nOikawa's really amazing. Hajime smiles.\n\"Don't be so mean to me, Iwa-chan.\" Oikawa stands up, making no move to put the jacket on. \"Don't I paint a tragic enough picture already? You wanted to go. I don't want to watch Tobio-chan wipe the floor with my old team and be unable to teach him important life lessons.\" He clutches his jacket. \"Like losing when you want to win the most. Tobio-chan should definitely suffer through more things like that. Or suffer, in general.\"\n\"Your personality…\" Hajime considers his words carefully, and then pins Oikawa with his gaze, \"is the worst.\"\nOikawa looks so startled to hear that from Hajime right now that it's written all over his face in a way he doesn't usually allow. Hajime laughs, and it feels good to laugh. The tightness in his chest, that endless ache from not seeing Oikawa, in all his petty glory, is easing, and in its place is the warm comfort of Oikawa's presence.\n\"The worst, huh?\" Oikawa says. \"I guess it's a superlative.\" He grins, weak but real. He keeps looking Hajime up and down, like he thinks Hajime isn't really here. Hajime isn't sure how Oikawa could think that anything he said would keep Hajime from being his friend, would keep Hajime from showing up, especially after so many years, but there is time to fix that. Plenty of time. \"You know how much I like being number one.\"\n\"Just c'mon,\" Hajime says. \"We have about an hour before the first matches of the day start.\"\nOikawa's mother smiles as Hajime drags Oikawa out of the house. \"Have fun, boys,\" she calls after them. \"Don't get into any trouble!\"\n\"She has no idea what your Friday nights are like, does she?\" Hajime mumbles, and Oikawa gives him an anemic version of his usual mischievous grin.\n\"And she never will,\" Oikawa replies, falling into step beside Hajime. \"Iwa-chan… why are you really here?\"\n\"Because I wanted to watch the Spring Highs with you.\" He steps over a dip in the asphalt, and Oikawa mimics him.\n\"But—\"\n\"And I want to go to dinner with you, too. And watch movies at the theater on opening night. I want to kick you off the sofa during 'Real UFOs' and I want to smell your weird soap when I sleep and I want to practice spiking with you until I can't feel my palms.\" Hajime looks at Oikawa, then, and Oikawa has a disbelieving expression on his face that makes Hajime run his tongue over his teeth in frustration. \"Hell, Oikawa, I'll even catch bugs with you, like when we were little, because the important thing wasn't, isn't, what we're doing, it's that we're doing it together, right?\"\n\"Even now? After what I said?\" Oikawa exhales. \"You don't care, that I…\"\n\"Of course I care,\" Hajime interjects, roughly. \"How could I not care, Oikawa? It's you. Of course I care.\"\n\"Then…\" There's so much space between them. Hajime moves in closer, so that their shoulders brush with every step.\n\"Mayumi was jealous of you,\" Hajime says. \"I thought… I don't know what I thought. I guess I didn't think, really. It was too easy for things to stay the same.\" He studies his shoelaces. \"She told me, when I broke up with her, that she'd known you liked me.\" He looks up and glares at Oikawa. \"You're infuriating, you know that? Blindsiding me with something like being in love with me.\"\n\"You broke up with Kawasaki?\" Oikawa's eyes squint at him, his eyebrows gathered, and with the puffiness of his eyes, Hajime can't read his look. \"I thought you really liked her, Hajime.\" Oikawa licks his lips. \"I could tell. That you really liked her.\"\nHajime starts at the sound of his first name. Oikawa rarely uses it, and the seriousness of it helps Hajime gather his courage, because this is the important part. \"The truth is, I like you more,\" he replies. \"I like you the most. Even if you're noisy and weird and fixated and possessive, and you leave a mess everywhere you go.\" Oikawa snorts in protest, a wet sound that reminds Hajime that Oikawa's been crying, crying over Hajime, and that when he cries, his nose gets all full of snot and then runs like a toddler's. \"Also you apparently can't answer your phone when I call you, so actually, Oikawa, I don't know what's wrong with me that I'd choose you over anyone else.\"\n\"You're not making me sound like the catch everyone else thinks I am,\" Oikawa complains, and Hajime stops and grabs Oikawa's hand, lacing their fingers together. Oikawa's hand is big, and warm, and exactly the right weight in his own. \"Iwa-chan?\"\n\"I mean, honestly, when you think about it...\" Hajime says, looking forward. His ears are hot, and he knows his face is probably funny enough that Oikawa will laugh if he turns to look him in the eye. \"When you really think about it, we've been dating for a long time.\" He squeezes Oikawa's hand. \"Am I wrong?\"\nHe peeks over at Oikawa, who's staring at him, half a step out of sync as Hajime drags him along.\n\"Iwa-chan?\"\n\"What?\" Hajime says, embarrassment almost choking him and making his voice gruff. \"We're gonna be late.\"\nOikawa drops Hajime's hand and embraces him from behind. His chest is warm pressed to Hajime's back, and Hajime can feel Oikawa's every intake of breath. He can feel his heart, too, beating so fast. \"When we get home,\" Oikawa says, lips pressed to Hajime's ear as Hajime stops walking, right outside the train station, \"I'm going to kiss you, Iwa-chan.\"\nHajime swallows. \"Okay,\" he says, and Oikawa laughs, the sound sending a shiver right down Hajime's spine. \"Yeah... I...\" Oikawa's lips, so warm and soft. Anticipation curls up inside him, a coiled spring. \"That's... good.\"\n\"Just good?\" Oikawa asks. His voice is breezy, flirtatious, and Hajime lets it affect him because this, this, is what he's come to realize he's desired all along. \"Don't underestimate me, Hajime.\"\n\"I've never underestimated you,\" replies Hajime, seriously, and Oikawa sighs.\n\"I know,\" Oikawa says. \"That's why you're my...\" Oikawa doesn't finish, and Hajime finds himself wondering what he should say. He's not too great at this part.\n\"I wanted to tell you that… you know…\" He steels himself. \"You're not the only one who feels… the way you feel. It's mutual.\"\nOikawa's exhale is loud and shuddery, and when Hajime pulls out of his arms, and looks into his eyes, all he sees is real joy, even if the smug grin on Oikawa's lips tries to tell a different story. \"Hajime, are you confessing to me?\"\n\"I hate you,\" Hajime chokes out, through his anxiousness and happiness and relief.\n\"I knew you'd fall for my charms eventually,\" Oikawa begins, undaunted by Hajime's mortification.\n\"Shut up.\"\n\"Naturally you would,\" Oikawa says, reclaiming Hajime's hand, re-lacing their fingers, and walking slightly ahead so he can pull Hajime along, like he'd been leading this whole time. Maybe he has been, Hajime thinks, and it's fine that way. Oikawa's always been the kind of setter that likes to be the star player, and Hajime's always been the kind of ace that doesn't mind helping that happen. \"I am, after all, the best.\"\n\"Your ego will be the death of me, Oikawa,\" Hajime mumbles, embarrassed and pleased. They're too old to hold hands like this in public, but Hajime can't bring himself to care. Not now.\nOikawa looks over his shoulder and beams. \"You love it,\" he says, and he sounds confident and sure, not bravado but certainty. You love me.\n\"I do,\" Hajime agrees, winded even though he hasn't been running crosscourt to beat a full three-man block. His heart is so full it might burst. \"Somehow, I do.\"\n \n★ ★ ★\n \n\n[[ EXTRA\n\n\n\"Get out,\" Hajime says, when the bathroom door creaks open.\n\n\n\"But I missed you,\" Oikawa says, pushing the shower door aside and looking in at Hajime with his face all flushed and smiley. Hajime's heart skips a beat.\n\n\nBecause even though he's seen this smiling face for most of his life, and has memorized all the different ways those lips can quirk, it's totally new how he can slide wet fingers into Oikawa's hair and kiss him as the steam escapes into the hall. \"I missed you like a hole in the head,\" Hajime whispers against Oikawa's slick mouth.\n\n\n\"You totally love me,\" Oikawa replies, and yeah, Hajime totally does, even if he still has trouble saying it aloud. \"Which is why you'll forgive me for what I did to our kitchen making chocolates.\"\n\n\n\"Fucking hell, Trashkawa!\" Hajime yells, as Oikawa slips free of his arms and escapes the bathroom, laughing. When the door closes, leaving Hajime alone again in the bathroom, Hajime puts his fingers to his lips and smiles.\n\nIt'll always be an adventure, Hajime thinks, being with Oikawa, and that's fine by him.]]"
}