{
    "id": "25488349",
    "url": "https://archiveofourown.org/works/25488349?view_full_work=true",
    "author": [
        "surveycorpsjean"
    ],
    "title": "Surfaces",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Bakugou Katsuki/Midoriya Izuku"
    ],
    "characters": [
        "Bakugou Katsuki",
        "Midoriya Izuku",
        "OC - Character"
    ],
    "additional_tags": [
        "Jealousy",
        "Getting Together",
        "Romance",
        "Sexual Content",
        "Light Angst",
        "Mild Hurt/Comfort",
        "Fluff",
        "Alternate Universe - Pro Heroes (My Hero Academia)",
        "Future Fic",
        "NO cheating its not what u think",
        "Happy Ending",
        "Hard of Hearing Bakugou Katsuki",
        "Bottom Midoriya Izuku",
        "Top Bakugou Katsuki",
        "Recreational Drug Use"
    ],
    "language": "English",
    "series": "",
    "published": "2020-07-24",
    "completed": "2020-07-26",
    "words": "25,225",
    "chapters": "2/2",
    "comments": "331",
    "kudos": "12,383",
    "bookmarks": "2,809",
    "hits": "110,498",
    "summary": "<p>Katsuki has a new girlfriend, but something isn't right. </p>\n<p> </p>\n<p>As impossible as it is, Izuku can't help but wonder what it'd be like to be called <i> Katsuki's girl.</i></p>",
    "notes": "<p>yay bakudeku week. posting the first half on ground zero day, and the second half on day 2 for pro heroes :)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">more notes</a>.)\n</p>\n<p>the character development they've had in the manga has made me love them so much fhsdfajdfd </p>\n<p>thanks for reading :* </p>\n<p> <a href=\"https://zanimez.tumblr.com/\" rel=\"nofollow\">tumblr</a><br></p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>me over here like how do i make a compelling story about jealousy without degrading women LOL. yes i will write happy endings wataboutit </p>\n<p>thanks for sticking around! happy bkdk week</p>",
    "text": " \n \nIzuku didn’t even find out from Katsuki himself.\n \nIt’s one of those things you catch out of the corner of your eye. Izuku does a double, a triple take; he jumps right into his social media, going through the five stages of grief, and he might’ve invented a sixth along the way.\nIt’s plastered all over the news, and Katsuki comes strolling into Izuku’s apartment like nothing is wrong (because he stole the spare key two years ago and refuses to give it back).\nThe door is kicked open, and it hits the foam pad Izuku glued there specifically for that reason.\n“I brought soba for your smallass, ‘cause I know you skipped dinner at the firm,” Katsuki says, arms full and his face still faintly smudged black from the mask.\nIzuku rolls his eyes at the term small. Despite their height difference, they’re actually pretty close in weight.\n“Oh no no no,” Izuku sings. “Don’t think you’re going to win my favor with food, Kacchan.”\nKatsuki pauses in the kitchen. He gives the most scorching, evil glare, and he tips his head like a dog in question.\n“Hah?”\nIzuku points to the television, where it says TMZ NEWS: Hero Ground Zero Caught Smooching Blue Bombshell! \n“Two months?” Izuku waves at the scrolling text. “You’ve been dating a girl for two months?” \nKatsuki’s face falls back to his bored, neutral state, and he turns to unload the food on the counter.\n“And? Whata’bout it? A guy can’t get laid around here?”\nIzuku stands off the couch, kidding but kind of appalled. “You didn’t tell me! ME! I’ve known you since diapers and I’m offended. Best friend card is officially redacted.”\n“Stay pressed,” Katsuki snorts. “I don’t have to tell you shit about my life.”\nAnd while Izuku had been kind-of joking, that hits him real bad. It’s that kind of heavy — get the wind knocked out of you — feeling. Izuku sits back down on the couch and flips the channel.\n“Right.”\n“And I’m keeping the best friend card – scoot your ass, fucker,” Katsuki grunts, and climbs over the back of the couch. Izuku already has his hand ready to receive the takeout, and he catches it without looking. “You better eat all that, or you owe me my money back.”\nIzuku sticks out his tongue and snatches the chopsticks out of Katsuki’s hand before he can stab him with them.\n“Why don’t you go run off with your shiny new girlfriend?” \nKatsuki rolls his eyes dramatically, and gives a look that would kill a lesser man.\n“Do not start with that. Give me the damn remote.”\n \nIzuku eats quietly to keep the peace, and ignores the overwhelming feeling like his entire world is falling apart.\n \n \n \nBecause here’s the thing.\n \n \n \nIzuku doesn’t actually know how many people Katsuki has dated. To his own knowledge, Katsuki has been a hit it and quit it kind of guy – and Izuku was comfortable with that. Katsuki would tell him details if a pickup was particularly bad (or funny), but it helped Izuku’s peace of mind. Katsuki is emotionally unavailable. Katsuki doesn’t date.\n \nRight?\n \nApparently, it’s none of his business.\n \n\nBut why now? \n\n\n \n\nIt’s not like Katsuki is unattractive. It’s actually the opposite. Kaachan was at the tattoo parlor the very day he turned eighteen, and he caught a good whooping from his mom for coming home with half a sleeve.\nHe cuts his hair shorter, now. And he’s built and tall, god – it’s really unfair, Izuku still gets pissed about that growth spurt. But really, they’re the top two heroes in Japan; an ongoing score that changes by the day. If you ignore some personality flaws, Katsuki really is a catch.\nMaybe it’s their age. They turn twenty-five this year; but it’s not like Izuku has love knocking down his door. Uh, for a few reasons, actually.\nLove. The word makes him a bit sick.\n \nIzuku looks over, and Katsuki is sitting with a leg up on the couch, elbow braced on his knee as he scowls at the TV. Izuku’s heart churns and squeezes like it always does. That’s okay. Izuku is well seasoned at playing along by now.\n \n“Scho,” Izuku chews. “If you’re not going to tell me about your new partner, I guess I’ll just have to deduct it myself. Blue hair, black clothes – did you guys meet at a bar? Oh, maybe she’s in a band. Did you finally get the goth girlfriend of your dreams? Hmm, or maybe she has a water quirk –”\n“I am going to chuck my hearing aids across the room if you do not fucking shut up,” Katsuki barks like a dog, and the familiarity makes Izuku smile.\n“Your eye twitched. It was a band. What’s she play, drums? Guitar? Bass?” Twitch. “Ah, it was bass.”\nKaachan’s hearing aids hit the wall with a very loud clatter.\n \nYou’re paying for those, Izuku signs. Katsuki flips him off – and that, Izuku can read.\n \n \n \n \nThey call her Katsuki’s girl. \n \nIzuku has only met her twice in a month and a half. Katsuki seems determined to keep them as far away from each other as possible, and Izuku hasn’t figured out why.\n \nKacchan doesn’t really get embarrassed, but he can be kind of private about his personal life. Izuku had hoped maybe they were past that, given how deeply both their personal and work lives intertwine – but apparently not.\n \nKatsuki’s girl. She has a normal name – Chiyou, he thinks. Izuku can’t be jealous of something he will never have, but it’s a timeless pain that feels brand new. It’s as if he’s thirteen again, writing a name in the margin of his notes, over and over like if he repeats it enough, then maybe he can have the impossible.\nTo say Izuku grew out of his feelings – that would be a lie. It’s more like… reluctant acceptance. Like the scars down his arms.\n \nEverything is normal at work. They’ve owned the joint firm for running on what, five years now? Heroes come and go, but their old 1A classmates seem to stay. Izuku tells himself it’s a good thing, because it is.  \n“Where’s Ochaco?” Izuku asks, spinning his desk chair.\n“Called out,” Denki snaps his gum. “To replace our lovely Kacchan.” \n“He’d kill you if he heard you say that,” Eijirou laughs.\n“It’s not fair,” Denki sighs. “Only Izuku is allowed to call him cute pet names.”\n“A terrible privilege,” Izuku jokes. He then blinks, “Wait, where is Kacchan? He’d rather be skinned alive than miss work.”\n“The lady demanded a sacrifice,” Eijirou says in a medieval voice. “Leave thy work and pay for mine dinner, or suffer hence balls blue.”\nDenki takes a moment to process that, but he then slaps the table and cackles, “She cut him off! That is fucking hilarious!” \n“I know! Apparently, Baku-bro does have a weakness.”\nIzuku flips his pen around in his fingers, and frowns. The reports stare back at him.\n“Does…Kacchan bring Chiyou-san around you guys?”\nEijirou pauses, mid tying up his hair. It’s gotten long, so long that it can hardly stay in a single rubber band. Katsuki’s friends can be kind of dense, but they’re hard workers and great heroes, and Izuku can now call them his own friends, too.\n“Huh? You mean his girl? Nah.”\n“He’s embarrassed ‘cause he gets all romantic,” Denki makes a kissy face, and Eijirou slaps his face away lightly.\n“Gross! Dude, he’s probably just playing it safe so you don’t run her off with your dank BO.”\n“I don’t s— wait.” Denki sniffs under his arm, and Izuku smiles.\n“You do, sorry man.”\nSero appears over the divider, “Naughty naughty. Dirty boys are sentenced to the piss chamber.”\nIzuku rolls his eyes, “The communal showers are not that bad.”\n“They smell real musky, dude,” Eijirou admits.\nIzuku drowns out of the conversation when he gets a backup alert from Ochaco. He’s gone in a quick costume change, and he’s glad to have something else to think about.\n \n \nHe sees her in tabloids, sometimes. Katsuki’s girl.\nShe’s cute. A baby blue bob, tan skin, freckles with a dark, fashionable clothing style. Maybe Izuku is just petty – but it’s hard to imagine Katsuki getting along with anyone, let alone…what? Dating? As much as Izuku tries not to think about it, Katsuki is always haunting the back of his mind.\n \n\nDoes he hold her hand? Does he buy her nice things? Does he kiss her goodnight? \n\n\n \n\n\nDoes he love her? \n\n\n \n\n\n \n\nThe thought makes Izuku’s stomach cramp so hard, he becomes nauseous.\n \nAs impossible as it is, Izuku can’t help but wonder what it would be like to be called Katsuki’s girl. \n \n \n \n\n \n\nKatsuki doesn’t give up their hangout nights. How he manages to balance it all, Izuku does not know.\n \n“I’m surprised you showed up,” Izuku says, grabbing drinks and mixers out of the fridge.\nKatsuki narrows his eyes in suspicion, and hunts through Izuku’s cabinets for glasses.\n“Why?”\nIzuku whistles, “You tore me a new one today. I haven’t seen you that mad since, shit. UA?”\nKatsuki grinds his teeth and snatches the rum out of Izuku’s hand.\n“Do not remind me. I swear to Christ if you go all self-sacrificing martyr on me one more goddamn time, I’m going to shove my foot so far up your ass you’re gonna’ taste my boot.”\n“Kinky,” Izuku says. Katsuki tries to catch him in a headlock, and Izuku dips under his arm.\nIt’s an age-old battle; one gets hurt, the other gets pissed. Round and round in circles – at this point its tradition more than a real fight.\n“I’ve got the reports for that hybrid gang,” Izuku says.\nKatsuki pauses mid pour, and raises an eyebrow.\n“You wanna’ do work while you’re blasted?”\n“It wouldn’t be the first time, right?”\nKatsuki actually snorts, and uses a spare chopstick to mix the drink.\n“Hey Kacchan, let’s start our own firm, Kacchan, it’ll be a great idea, Kacchan –”\n“Oh shoot,” Izuku rubs his forehead. “I forgot about our taxes.”\n“I dropped them off because I know you’re a moron,” Katsuki says, and pushes a drink to Izuku’s chest. “Where’s the stupid reports?”\n“Desk.”\nKatsuki slides across his kitchen island instead of walking around it like a normal human being, and Izuku laughs, because he knows if he tried that at Katsuki’s apartment, he’d get torn a new asshole.\nHe watches Katsuki rummage through his desk like he knows where everything is (because he does), and even the distraction of liquor doesn’t help the burn in his stomach.\nIzuku leans up against the counter, and rests his cup at his bottom lip. Katsuki is broad, with a slim waist and firm, inked up arms. The tattoos don’t mean anything, and Katsuki gets pissed when he’s constantly asked about it. He doesn’t skip leg day, but you’d never know from all the baggy pants he wears.\n“Hey Kacchan,” Izuku calls.\n“Hm.”\n“Real talk, for a second?”\nKatsuki gives him a sideways look. They have their ups and downs, but they’ve slowly built a relationship out of respect, and they know when the other is being serious.\n“What’s up?”\n“Is this really okay?” Izuku asks. Katsuki hates unclear questions, and his eye twitches in forced patience, so Izuku quickly continues, “I mean – I don’t want Chiyou-san to feel abandoned just because we have a tradition. I really don’t mind if you want to spend more time with her.”\nKatsuki’s lid pops, for a second.\n“Eh? You sayin’ I’m a crap boyfriend? You don’t think I know how to balance my shit like a fucking adult? You want me gone, is that it?”\nIzuku frowns.\n“Kacchan.”\nIzuku watches him regain composure. Katsuki seethes angrily, and runs through his age old anger management of breathing in, counting to five, and rewording his question.\n“Why do you say that?”\nIzuku shrugs a shoulder, and picks at the old half-peeled barcode sticker at the bottom of his cup.\n“I don’t want you to force yourself.”\n“I never do shit I don’t wanna’ do,” Katsuki scowls, crossing his arms. “Is that all? Does that help your soft little feelings?”  \nIzuku rolls his eyes, but laughs, “You are such an asshole.”\n“Surprise, surprise. I found your shit, by the way. If you don’t organize this fucking cabinet I’m going to come in and do it for you.”\n“Nooo,” Izuku whines, “I have everything where I want it!”\n“This,” Katsuki lifts up a manila folder stuffed with papers, “Is not organized. This is how you lost our taxes last year.”\n“I already told you I was sorry about that. At least I didn’t blow up the evidence for the Muna case.”\n“That was not my fault and you know it.”\n \n \nIzuku hates tabloids. They always find his bad angles and size them up approximately three-hundred times too big. You learn to ignore the gossip in this line of work, but it’s still difficult to turn a blind eye to the electric billboards and the countless magazine stands.\n“Jeez,” Izuku grits, and tucks his hands in his kangaroo pocket. “I just wanted some fried rice. Is that too much to ask for?”\n“Apparently,” Shouto says, and he looks silly in his round sunglasses and his hoodie string pulled tight around his face. Unfortunately, his hair is way too recognizable to be walking into a street bodega at night, so.\nShouto is also a jerk because he took a hit off the same growth spurt Katsuki had. He’s transitioned from pretty-boy to a pretty-man, and he’s a hot commodity for the commercial world, but it sucks for them because Shouto couldn’t give less of a damn about anything other than hero work.\nShouto grabs one of the magazines for a closer look. Half of the spread is a photoshoot of Momo, and the other half is collaged paparazzi photos of Katsuki and Chiyou exiting a movie theater. Katsuki’s arm is loose around her waist, and suddenly Izuku isn’t hungry anymore. Jeez, Izuku is such an asshole, but it’s not like he can lie to himself.\n“This is just weird,” Shouto mumbles. “Almost…wrong. Like watching someone bite the top off a kit-kat bar.”\n“That was a dig,” Izuku points.\n“You’re a heathen,” Shouto replies. He sets down the mag, and looks back to Izuku. His eyes are hidden, but Izuku can see a red eyebrow rise above his lenses. “Are you really okay with all this?”\nShouto is the only one who knows about Izuku’s feelings, but that’s because Shouto found him sobbing hysterically in a bathroom on prom night, and he sat on his legs and twisted his arm until Izuku told him the truth.\n“It’s fine,” Izuku shrugs. “I mean, no. But it’s fine.”\nShouto stops walking, and Izuku internally groans, because he knows Shouto is about to press him.\n“No?”\n“It’s – I’m happy for him, really. But, he doesn’t talk about her. Doesn’t want us to meet. Doesn’t want me involved at all.”\n“That’s a good thing, isn’t it…?”\nIzuku steps up on the curb, so that they’re no longer standing in a vacant parking spot.\n“No. Well…you could look at it that way. But it hurts more knowing he doesn’t want me involved in that part of his life at all.” Izuku rubs his eyes on his forearm, “Like, shit. I don’t know what’s better. Maybe a meteor will take me off the planet and solve all my problems.”\n“I wouldn’t count on it,” Shouto says, and begins walking again. “But something smells wrong here.”\nIzuku eyes him.\n“What do you mean?”\nShouto shrugs, and holds open the shop door.\n“Bakugou Katsuki, your beloved Kacchan and personal shadow, doesn’t want you to get along with his romantic interest? It sounds suspicious. Maybe he’s afraid you won’t approve.” Izuku gives him a very skeptical look, and Shouto rolls his eyes. “Alright, have at me.”\nIzuku lists off his fingers.\n“A, he is not my shadow, I’m actually certain it’s the other way around and B, Kacchan? Afraid?? Of my opinion? Did you even process those words before you said them?”\n“A, it goes both ways and B yes I did.”\n“You are high,” Izuku says. He sucks air through his lips and motions by his lips, “Absolutely off your rocker.”\n“Not since yesterday.” Shouto nods towards the menu. “What do you want?”\n“Some fried rice please.”\nShouto pays for their food and they walk back towards the Todoroki hero firm, knowing they can sneak in the back without getting spotted by the night shift.\nIzuku was happy that Shouto decided to take over Endeavor’s firm when presented with the opportunity. It’s a much larger scale than what Katsuki and Izuku run back in the Shibuya district, but they work closely together for intel and resources, and Japan has taken to calling them The Big Three. \n“I could pull some strings,” Shouto suggests, sitting up on his desk as he eats. “You know, a little,” he makes a clicking sound and a whistle, and jabs over his shoulder. Izuku lifts his eyebrows, and Shouto explains, “Just a couple calls. Make sure Bakugou doesn’t date in this city ever again.”\n“I am appalled and disgusted that you would suggest that,” Izuku scoffs. He then jokingly winks, and Shouto cackles in the ugly way that only a few get to hear.\n“Just saying.”\n“I wish I could’ve fallen in love with you,” Izuku sighs, cracking his chopsticks. “My life would be easier.”\n“I’m too emotionally and physically unavailable,” Shouto says, tipping his head back to try and pool a very long noodle in his mouth, all manners gone this late at night. “I’d drive you crazy. But I’m still here whenever you decide to get platonically married.”\n“I’ll keep that in mind.”\n \n \nIzuku comes home to find all his lights on.\n \nHis defenses are raised, but they fall as soon as he sees Katsuki supine on his couch.\n“Honey I’m home,” Izuku jokes.\n“Where the fuck have you been?” Katsuki glares ferociously, shoving in his hearing aids. “Your phone better be at the bottom of the ocean.”\n“Uh, shoot,” Izuku pats his back pockets. “Sorry, I was – wait. Why are you in my apartment?”\n“I got stat leaks for the new UA interns,” Katsuki waves a packet around. “We have until tomorrow to make our picks before all the good ones are snatched up.”\nThe nasty look Katsuki is throwing him makes Izuku feel more like he’s the one dating Katsuki, and that train of thought is too painful to follow, so Izuku dumps his wallet and keys on the counter and makes his way across the living room.\n“Don’t talk about children that way, they’re all talented and we will be lucky to have any of them.”\n“This dude has a skunk quirk.”\n“…Okay, maybe not that one.”\n \nKatsuki spreads out photocards and stat papers, and Izuku can smell his aftershave from sitting this close on the couch – but all Izuku can think about is Katsuki’s arm wrapped around his girlfriend’s petite little waist.\nKatsuki has a nice profile. He’s saying stuff Izuku should be paying attention to, but it’s nearly one in the morning, and Izuku feels himself not-quite on planet earth.\n Someone else gets to kiss him. Someone else gets to sneak pictures of Katsuki sleeping while petting through short spikey hair. The more he thinks about it, the more Izuku’s heart feels like it’s being strangled to death, and he doesn’t realize he’s breathing heavy until Katsuki is up in his face.\n“Hey, Deku! Are you even listening to me you fucking – woah, hey.” Katsuki’s tone drops, and it’s like all the jagged edges buff out into smooth, calm sandstone, and Izuku feels like he could just wash away into dust. He’s brought back by a hand squeezing tight into his knee. “Deku. Are you with me?”\n“Yeah, I’m – yeah.” Izuku scrubs at his eyes. “Sorry, kinda’ tired. I’m impressed you’re up this late.”\n“Slept in for an afternoon shift,” Katsuki explains offhandedly. He frowns, and his eyebrows are always pushed together so tightly, Izuku yearns to smooth over them with his fingers. “Hey, where the fuck did you go tonight? You don’t look right.”\n“That’s not very nice, Kacchan,” Izuku teases lightly, but the look Katsuki gives him says that won’t fly, and Izuku knows it. “I was with Shouto. It’s really nothing.”\nKatsuki’s eyes shine pink sometimes, when the light hits them right. He looks into Izuku, through him, like he’s x-raying to check all his bones. Izuku used to think it was pure malice, but he now knows there’s concern etched in there. That’s almost worse.\n“Fine. We’ll make our picks and I’ll get out of your stupid hair.”\nIzuku hums sleepily and folds his head in his hand. “You can stay the night.”\nKatsuki lifts an eyebrow, and Izuku tries to figure out what he said wrong, until he stutters.\n“Oh! G-girlfriend! Right, my bad.” Izuku laughs a little to play it off. “I forget you’re not single like the rest of us losers.”\n“That has nothing to do with it,” Katsuki grunts, but leans over his knees to start shuffling papers around again. “Just switch into nerd mode, dumbass.”\nIzuku takes one last glance at the fuzzy, warm nape of Katsuki’s neck, before he leans over and starts to analyze the statistics.\n \n \nKatsuki leaves within the hour. Izuku has never thought to ask for the spare key back, but…maybe he should.\n \n \n \n \nHis life is a lot of work and no play, but that’s okay when you like what you do. Izuku is good at search and rescue, and Katsuki excels at villain takedown, but that doesn’t mean they can’t switch.\n \nIzuku likes to push his body as far as it can go. The world moves in slow motion as he kicks between buildings, jumping into the air and tackling a villain to the ground. Katsuki is always right where he needs him to be, grabbing up lost civilians and shouting (impatient) commands to clear the area.\nWhen electricity cuts through the alley, Izuku knows he doesn’t have to worry about the few that got away.\n“You stole my fuckin’ move,” Katsuki snaps, a teenage boy slung over his shoulder. He’s long abandoned the grenade gauntlets for smaller, more functional gloves, and only the tops of his tattoos are visible around his bicep.\n“Sorry,” Izuku laughs. “It’s the most efficient way to cut through buildings without breaking windows.”\n“Well shit, it’s not like our insurance can take another hit.”\n“Can you put me down already!?!” The kid wails, slapping Katsuki’s back.\n“No. You still need to be checked out by an EMT, so shut your hole.”   \nThe villain gurgles under Izuku’s grip, and Izuku slides off to cuff him, rolling the man to his side.\n“I’m all good here if you want to go check on 7th street,” Izuku offers.\n“Don’t tell me what to do. Also are you still down for dinner, or what?”\n \nIt’s a Friday night, Izuku thinks. What about your girlfriend? \n\n \n\n“So long as it’s okay with Chiyou-san,” Izuku says. Katsuki rolls his eyes.\n“Like I give a fuck what she thinks. Just meet us at the bar, Shitty-hair is coming too.”\nIzuku almost feels bad for her, but he doesn’t have the time to think too much on it. The road smells like burnt asphalt and sirens are buzzing two streets down.\n“Sounds good. I’ll check and see who’s off schedule.”\n“Can we wrap this up already?” The kid huffs. The villain snorts into the concrete.\n“Yeah, yer tyin’ the cuffs a lil’ too tight, sweetcheeks.”\n“Shut up,” Izuku and Katsuki say. And then an additional please from Izuku.\n \n \nThe owner of the bar knows them by now, so it’s not worth hiding their identities.\n“The half-safest bar in the east!” The owner claims, because a room full of heroes can go two different ways.\nSero and Mina are off chatting up waitresses, so they’re automatically counted out of the next round of darts. Katsuki throws one-twenty during his round, and Izuku shakes his head as he pulls the darts out of the board.\n“You’re putting me in a real hard spot, Kacchan.”\n“Fuck off, dipshit over here pushed my arm.”\nEijirou laughs, “It worked, didn’t it?”\n“Hell yeah, teamwork!” Denki high-fives him.\n“Don’t fuck up,” Katsuki calls.  \nIzuku throws a fifty, and then a nineteen.\n“Fuck!” Katsuki curses, and slams back his drink. “You two are on my shit list, fuckin’ cheaters, I hope you die tonight.”\n“Awww, that’s so sweet.”\nThe bar is busy and loud, and their laughter drowns in with the noise. Izuku doesn’t mind social gatherings, if it’s somewhere he’s familiar with. Anxiety always buzzes at the back of his mind these days, but less so with his friends.\nEijirou and Denki are fresh out of costume in sweats and t-shirts, but Katsuki always looks fashionable, even when he’s not trying to be. Baggy-jeans, soft hoodie and a baseball cap backwards on his head; he doesn’t look approachable by any means, but Izuku likes that about him.\nIzuku throws his last dart and laughs, “One-nineteen. So damn close.”\n“Drink up,” Eijirou offers a shot and grins, and Izuku cringes as he knocks it back.\n“Lord, that’s so bad.”\n“We’ve done six!” Denki fights, leaning up against the bar table. “You guys can spare to lose once.”\n“Sure, but you’re taking the interns on Monday,” Bakugou says, and Izuku starts to laugh.\n“No! No way! That’s so not fair.”\nEijirou elbows Denki, “That’s what we get for drinkin’ with our bosses.”\nIzuku pretends to gag at the word boss, and Katsuki digs his knuckles into the top of Eijirou’s head.\n“Watch your goddamn mouth, or you’re on kid duty all week.”\nEijirou giggles because he knows it’s an empty threat.\n“So mean! Shouldn’t you go home to your girl already?”\n“Shut up, don’t act like you know shit.”\nIzuku tries to fall out of the conversation, but Denki is quick to wrap an arm around his shoulders.\n“What about you, huh? Still going on blind dates?”\nKatsuki pauses, mid-dig into Eijirou’s skull.\n“Blind what?”\nIzuku ignores him; “Not anymore. I told Ochaco I was done after the uh…the last one.”\n“Ah, right.”\nKatsuki gets puffy and agitated, “Hey, you didn’t say shit about no date.”\nLike he has any room to talk, but Izuku is too tired to fight him on it.\nIzuku rubs the back of his head, “Well, that’s ‘cause um…it didn’t end very well. I kind of uh…spilled wine down his pants and accidentally flipped the table over when I stood up to help him.”\n“Poor guy ran off?” Eijirou asks.\n“Yeah.”\nKatsuki squints at him, but then rests back against the stair railing.\n“Hmph, coward. Anyone should know you come with a warning label.”\nIzuku can’t figure out if that was a compliment or not, but Denki jostles him and pokes his nose.\n“You just need to get back out there! Shit dude, you’re the Number One hero, you’ve got fanclubs out there just itchin’ to get in your pants. You’re built like a brick house and your ass is fuckin’ bomb, any guy would be lucky to slap that– no homo.”\nEijirou lifts his cup, “Amen!”\nIzuku isn’t sober enough to handle this. He feels his face getting hotter, and the mixture of alcohol and embarrassment makes his age-old stutter come back like he’s fifteen again.\n“W-well I… it’s not like – I mean –”\n“Eff off,” Katsuki grunts, kicking his foot into the back of Denki’s heel. “Quit actin’ like a stud, you fuckin’ virgin.”\n“Ow! Ex-cuuuse you, I’m saving myself for marriage.”  \n“Right. And Marriage is six-feet tall with purple hair –”\n\n“SHUT UP SHUT UP SHUT UP!” \n\n \n \nEijirou doesn’t mind kid duty all that much. You know, teaching the next gen and all that jazz – it’s cool, it’s cool. Eijirou got to pick his own shadows this year, so he’s got two baby UA first years that are so cute he could just eat them.\nEijirou likes picking kids that could use the confidence boost, anyways. \n“Just like that!” Eijirou claps, as miss self-named Arachnida sets down a boulder with all six arms. “Great job! Looks like we’re clear of civilians here.”\n“Thank you-che,” Arachnida bows.\nThe other intern, a green kid named Kale, bounces on his feet.\n“What now?”\n“Well, next we have to –”\nHe stops when he hears Katsuki yelling. He and Izuku are speaking with the chief of police, and their conversation is loud enough to carry across the cracked road. The two of them hold a strong presence when they’re on scene; a no-nonsense tone that makes all the other heroes want to work their hardest. \n“This is horseshit!” Katsuki huffs, crossing his arms high on his chest to show how Not Happy he is. “This guy causes a thirty-car pileup, and you don’t want us to chase him down?”\n“He’s just a kid, Kacchan,” Izuku frowns. “It’s best if we hand this over to the police.”\n“You’re a fuckin’ idiot if you think these meatheads have any sensitivity training.”\n“Thanks,” the chief frowns.\n“Kaccha-”\n“No, shut up, the sound of your voice is pissing me off.”\n“Oh my,” Arachnida pales, and shifts to stand behind Kale. “Ground Zero is much scarier in person-che.”\n“How does he get away with yellin’ at the Number One like that?” Kale huffs.\nEijirou laughs, and pats them both on the head.\n“Trust me. It might not look like it, but Deku has a very tight leash on that guy.”\n“Huh??”\n“There’s no way! Ground Zero is supposed to be like, totally crazy.”\n“Look,” Eijirou nods, and the kids watch as Katsuki continues to bark bark bark, until Izuku crosses his arms, squares his shoulders, and snaps.\n“Kacchan, I’ve had enough.”\nKatsuki looks like a steered bull. He huffs and puffs and turns his head, and Izuku confronts the police chief in a calm, quieter tone, and at the end of it he’s seen dragging Katsuki off by the strap on his chest.\n“Wow,” Arachnida marvels, her multiple eyes blinking in awe. “That’s incredible-che!”\n“Deku is one of the nicest guys I know!” Ejijrou says proudly. “But he also takes his job very seriously. That’s the only way you can become Number One! Remember that, kiddos!”\n“Right-che!”\n“Yes sir!”\n“Alright! Now let’s go learn how to file reports!”  \n“…woohoo.”\n“I can’t hear you!”\n“Woohoo-che!”\n“That’s the spirit!”  \n \n \nStuff just doesn’t add up. Izuku hasn’t had the time to figure it out, but he’s missing something, a piece of the puzzle that just isn’t right.\nNails gently scrape into his scalp, and Izuku’s eyes roll back as Ochaco passes behind him. She’s got these long acrylics that she somehow never breaks.\n“Hey buddy, you still here?”\n“Mm, yeah. Finishing these reports.”\nOchaco pulls back and cringes at the black grease on her fingers. “Didn’t you just work a shift?”\n“Yeah. Uh, sorry.” Izuku rubs his eyes, “Gotta’ run these by Kacchan and I’ll be going.”\nOchaco wipes her hand on her pants, and then squeezes into his shoulder, “It’s fine, but you should really take a break this weekend. You’ve been working doubles for a week now.”\n“Yes, but I don’t want to be napping if someone out there needs me.”\nOchaco frowns, her round features squinting, “I think we can handle it, don’t you?”\nIzuku startles upright, “Uh! Of course! I wasn’t trying to…”\n“I know,” she laughs sweetly, and pats him once. “Just messing with you, boss.”\n“Igh, stop that.”\n \nOchaco dims some of the lights as she exits the office, and Izuku sighs, wiping his eyes again. The night shift will be here soon, but Izuku can still see the light under Katsuki’s office door.\nHe’s able to power through his stack of papers, and triple checks his signatures before standing up and knocking on Katsuki’s door. There is no grunt or shout or acknowledgement at all, and when Izuku knocks again, he wonders if Katsuki fell asleep. It would definitely be a first; the guys would never let him live it down, for sure.\nIzuku creaks the door open – but no, Katsuki is still wide awake, tapping his pen against his desk and sitting like a chiropractor’s worst nightmare. Katsuki hates, hates paperwork, but he’s good at reports, and he always does them thoroughly, so he’s reliable that way.\n“Focused, huh?” Izuku starts, to break the silence. Katsuki doesn’t respond, and Izuku realizes that his hearing aids aren’t in. “Oh,” Izuku mumbles.\nIt took a long time for Katsuki to break down enough to get aids in the first place. Unfortunately, the strain of his quirk has damaged seventy percent of his hearing. The aids help to prevent further damage, and allow him to hear pretty well. Izuku already knew sign language from highschool – but Katsuki was reluctant to learn. Izuku-and-Friends have hammered small dents into his pride, and Katsuki is starting to see the benefit from SL (Izuku thinks).\nIzuku doesn’t want to startle him, so he slams the door a little harder than he normally would, and the vibration of the floor makes Katsuki’s head snap up.\n“Deku??” Katsuki’s voice is too loud, like he can’t quite hear himself. “Why the hell are you still here?”\n“Why are you?” Izuku asks, and half signs with one hand.\nKatsuki’s eyes glance between his lips and his hand, and he scoots back from his desk, inviting Izuku closer.\n“The stupid Hero Commission. They’ve been riding us up the ass lately.”\n“I know,” Izuku sighs. He sets the paperwork on a corner of Katsuki’s desk. “I’ve been nosing around – they say all the firms not meeting quota are getting hit with threats about shutting down.”\nKatsuki gives him a look, like he might’ve talked too fast, and Izuku quickly signs the last part again. Katsuki crosses his arms and scowls.\n“Damn bastards think we’ll just bow down and do their bidding. The fuckin’ flowers don’t always smell right. I trust my own team more than I trust a buncha’ suits who groom children for their double-agent bullshit.”\nIzuku offers a smile, and signs as he says, “We’ll play nice for now. Here are the rest of those files.” \n“Hm.”\n\n“Where are your hearing aids?” \n\n“Fuckin’ crushed to death. Didn’t feel like going home to grab my spare.”\n“Mei will be disappointed,” Izuku signs, dragging his finger up to his chin. “She really thought those were explode-proof.”\n“Pfft, yeah, they were. But it doesn’t do me much good when my head is cracked into the pavement.”\n“Oh my god,” Izuku blurts, forgetting to translate that. “Are you okay?!”\nKatsuki rolls his eyes, “Fine, a healer got to me. What the hell is in your hair?”\n“Uhhh…” Izuku feels up to his head, then fingerspells, “Motor oil?” \nKatsuki starts to laugh, and it’s not forced or wicked or loud; just genuine, as he shakes his head and looks up at Izuku with a tired expression.\n“We’re a mess. You need a haircut, too. Scraggly lookin’ ass, look at you.”\n\n“Then do it for me.” \n\n“I’m not a fucking charity.”\nIzuku pouts, “But nobody else cuts it the way I like it…”\nKatsuki rolls his eyes and spins his chair with his foot against his desk, “Ugh, it’s like I can see your stupid whining. Come over tomorrow.”\n“Yay!” Izuku cheers. He pauses. “Wait. But Chiyou-san…” \n“Ten a.m., come with your hair washed, fuck, and bring a damn towel.” Izuku salutes in acknowledgement, and Katsuki kicks him out of his office. “You disgust me. Take a shower, you rat.”  \n \n \n \nWhenever Izuku gets too comfortable, he’s always knocked down a peg.\n \nIzuku texts Katsuki five minutes before ten; I AM HERE! : ) and the door is yanked open via-foot.\n“Oh good,” Katsuki says, eyes dropping to Izuku’s hands. “You brought coffee. I’m now less liable to slit your throat.”\n“Well that’s a relief,” Izuku sings, like he doesn’t know Katsuki inside and out. He takes off his shoes in the entryway and pulls the towel off his shoulder. “Where do you want me?”\n“The tile. Your hair gets everywhere and it’s a pain in the ass to vacuum out of the carpet.”\nKatsuki isn’t so much of a neat freak, rather than someone who likes things a particular way. Izuku is aware of this – that’s why he immediately picks out the abnormalities in Katsuki’s apartment. Extra dishes in the sink, a pair of women’s sunglasses thrown into his key bowl, discarded movie cases by his television. Chiyou-san has been here; duh, of course.\nIzuku lays out a towel and grabs the barstool they usually use. Katsuki is off rummaging in his bathroom, and Izuku hears his voice echo.\n\n“Hey Deku, I’m giving you an undercut again.” \n\nIzuku sighs, “You know I’m really bad about keeping it up.”\n“Then don’t be a lazy sack of shit,” Katsuki says, returning with clippers and an additional hand towel. “I’m doing it anyways. It’s the only cut I hate the least on you.”\n“You make me feel so good inside.”\n“Glad to hear it,” Katsuki grins callously, and spins Izuku around on the backless barstool. Warm, knobby fingers roll the hand-towel into his shirt collar, and Izuku has to fight a full-body shiver when Katsuki reaches around by his throat. “Sit still or I’ll snap your neck.”\n“Yes, yes, I know.”\nIzuku can see Katsuki vaguely in the reflection of the fridge. He pushes up his shirt sleeves, revealing tattoos, and somehow the simple act of checking his watch is attractive. Katsuki takes a swig of his coffee, and re-dampens Izuku’s hair with a spray bottle.\nKatsuki has always cut his own hair out of pure stubbornness, but he learned how to cut others after their first year at UA. Everyone was always doing weird, experimental crap to their hair at three in the morning, and from Izuku’s point of view, it seemed like Katsuki got tired of watching everyone walk around with split ends.\nStill in his thoughts, Izuku mulls, “Remember when you gave Ojirou-kun a green buzzcut?”\n“He looked good and I fuckin’ stand by that,” Katsuki says. Izuku hums as Katsuki grabs pieces between his fingers and snips them even. He’s not exactly gentle, but Izuku can tell there is an effort being made to not pull Izuku’s hair by the root like he used to.\n“He really did. I saw Ojirou-kun the other day on a crash site. He still keeps it shaved, you know?”\n“Heh. Good. I’m never wrong.”\nIzuku closes his eyes when Katsuki’s blunt nails scrape through his scalp. He’s just doing it to shake out the strands, but it always makes Izuku go a little cross-eyed. Yeah yeah, sue him.\n“Not too short, please.”\n“Shut up, you’ll take what you get. You’re still not paying me.”\n“I brought coffee!”\n“One coffee for a fifty-dollar haircut ain’t shit, Deku.”\n“You’d charge fifty dollars? Hell no, I’ll just go to supercuts.”\n“You’d look like a goddamn thumb, and I’d have to be seen in public with you – fuck that, not on my watch,” Katsuki gripes, and snips his bangs. A chunk of hair falls into Izuku’s lap. Izuku can tell from Katsuki’s tone that he has something else to say, and when Izuku waits long enough, he adds, “I need you to walk on my back, anyways.”\n“Kacchan,” Izuku frowns up at him, cross-eyed from this angle. “You need to see a real doctor.”\n“A doctor won’t do crap, I just need you to pop my spine so I can sleep again. Dumbfuck villain threw me around like a ragdoll the other day and – do not smile,” Katsuki threatens, holding the scissors to Izuku’s eyelevel. “I will stab you.”\n“Yes, yes, fine, I’ll pop your back,” Izuku waves flippantly. “Please be careful next time, Kacchan.”\nKatsuki mumbles something angry and inaudible, and he disappears to grab the clippers. They buzz back to life, and Izuku stays very still as Katsuki starts at his nape and works upwards. Due to the loud buzzing, Izuku doesn’t hear a door open and shut. However, his years of battle experience and rigorous training does give Izuku the ability to sense when someone is behind him, and he nearly jerks out of his skin.\n“Jesus Christ!” Katsuki reels back, narrowly missing Izuku’s ear. “Are you fucking for real right now?!”\nIzuku stares at the woman paused amid the living room. Her hair is tied up messy, and she is wearing one of Katsuki’s shirts, and her neck looks like it’s been destroyed in hickies, and Izuku’s heart falls out of his ass.\nHe didn’t even know she was here.\n“I’m sorry,” Chiyou blinks. “Didn’t mean to scare you.”\n“Sorry! Sorry!” Izuku waves. “Kacch- I mean, um, Katsuki didn’t tell me you were here.”\nBoth Katsuki and Chiyou raise their eyebrows. Katsuki looks like he wants to argue, but he grips Izuku by the chin and turns him back around.\n“I don’t have to tell you nothin’. Now sit still, asshole. Unless you want a reverse mohawk.”\n“That sounds sexy,” Chiyou teases. She approaches the kitchen, her arms behind her back. “You’re good at that, baby.”\nChiyou is very beautiful, and her voice is pretty too. By all means, they should make a good match. Izuku should be very happy for him, and not at all having a crisis.\n“What do you want?” Katsuki grunts, but his voice has less of a bite to it.\n“Hungry,” Chiyou sighs. “Will you cook tonight?”\n“I’m not your goddamn slave.”\n“Pleeease?”\nKatsuki sighs, and dusts off the back of Izuku’s neck with his fingers. “Whatever. I’m busy.”\nChiyou makes a happy sound, and leans over to peck Katsuki’s cheek. Katsuki makes a ugh face, and Izuku has to chew into his inner cheek to keep himself from like, imploding or something.\n“Nice seeing you, Midoriya-san,” Chiyou waves. She disappears back into the bedroom with a bag of sunchips, and as much as Izuku fights it, he is horribly, disgustingly, unforgivably jealous. Izuku is so ashamed of himself he could cry, but Katsuki spins him around to clean up the front of his hair, so Izuku gets his shit together.\n“Ignore her,” Katsuki grumbles.\n“That’s rude.” Izuku traces the scars on his fingers, and pulls at the places that have long been numb. “She doesn’t have to stay cooped up in your room, just because I’m here.”\n“You’re done anyways,” Katsuki says. He blows a big hot breath of air into Izuku’s face – partly to brush off the small hairs, and also to be a dick. Izuku makes a chorus of gagging sounds, and waves his hand in the air.\n“Yuck, coffee and toothpaste.”\n“That’ll be fifty bucks,” Katsuki teases, but he looks a little proud of himself. Izuku pulls up his phone camera, and oohs and aahs at his reflection.\n“Wow. That looks good!”\nKatsuki leans over his shoulder and fluffs up the top of his hair. The curls are way shorter now, bits of deep green and black leading down into his buzzed undercut. Izuku forgot how fun it was to rub the fuzzies.\n“Damn right it does. Now crack my back.”\n \n \nIt almost feels wrong, knowing Chiyou is sitting one wall away. Katsuki is rolled onto his stomach, moaning obscenely into his arm; Izuku walks one foot in front of the other, and Katsuki’s spine gives.\n“Jesus,” Izuku curses.\n“That was it,” Katsuki groans. “Shit, motherfucking son of a bitch – harder asshole.”\nIzuku’s socked foot presses snug between his shoulder blades – Izuku can feel his bodyheat, just from this. Katsuki is supporting all of his weight, but he doesn’t seem to be upset about that.\n“Everyone says I need a vacation, but you’re just as bad,” Izuku says. He testily steps higher on Katsuki’s back, and it cracks again. “You sound like a box of cereal.”\n“Not all of us are blessed with metal implants, Deku,” Katsuki grits testily.\n“I only have implants because half my bones exploded.”\n“Yeah, and who’s fault is that? Yours. Now you gotta’ suffer through metal detectors for the rest of your life and – nnn,” Katsuki bites off, and his spine pops one last time. “Fuuuck yes Deku.”\nIzuku’s face reddens, and he steps off Katsuki’s back with a laugh.\n“All those noises, Kacchan. What will Chiyou-san think?”\n“Don’t give a fuck, I can finally sleep again,” Katsuki retorts, sitting up. He rolls his neck from one side to the other, popping little bones here and there, and what Izuku wouldn’t give to bury his face right in his throat. “Want me to do you?” Katsuki asks.\nThere is no way Izuku would survive that right now.\n \n“Uh. No thanks.”\n \n\n \n\nHis renewed haircut is the hot commodity for social media that week. It blows up even further when Izuku is approached in the street, and accidentally says that Katsuki cuts it for him.\nJust when Izuku is beginning to get sick of all the gossip, a new story takes over the papers. It’s Katsuki again, Japan’s beloved Number Two hero, once more caught kissing his girlfriend. Izuku can hardly look at the photo.\nMaybe it’s a good thing Katsuki doesn’t invite her everywhere. Maybe…maybe he knows about Izuku’s feelings. \nIzuku tries very, very hard not to cry. He succeeds a little bit, but only because he’s actively distracted by a merchandise photoshoot with his manager.\n“Come on, give us a big smile!” The photographer calls.\nIzuku does his best.\n \n \n \n \n“Wow,” Shouto says, peering into his solo cup. “It’s been a while since we’ve been to one of these.”\n“Do you think it’s a good idea to have so many heroes under one roof?” Izuku asks.\n“Oh, loosen up a little,” Ochaco pats his back. “Our kouhai can handle the streets for one night.”\n“I triple checked the schedules,” Iida pushes up his glasses. “Unless the planet decides to explode, we shouldn’t be called out.”\n“Let’s hope.”\nIt was nice of Iida to plan a class party. His house is big and fancy and can hold the people, and even the old 1B and 1C classes are here. A section of the house has been converted into a dancefloor, and Denki was taking his DJ duties very seriously, but his face has become occupied with Shinsou’s.\nOchaco sits on the edge of the couch cushion and lifts her legs to allow Juzo to drunkenly crawl towards the bathroom.\n“It’s a shame how much effort it takes to get together now,” she sighs, finishing off her drink. “We used to throw bangers every weekend.”\n“Unfortunately, it will only get worse from here,” Iida says. Shouto pulls the hairband off his wrist and shoots it at him.\n“Don’t be such a downer.”\n“I’m only being a realist!”\n“Yeah? Well drink more and be less of one.”\n“Play nice,” Izuku laughs. “It’s probably true. Did you hear about Shiozaki’s second baby?”\n“Yes,” Ochaco sighs. “I mean, good for her – but I could never. I’m too busy being young dumb and free.”\n“Amen,” Shouto says, and they clack their plastic cups together.\n“Well well well,” Iida says, smiling over his cup. “Look who decided to show up.”\nThey (none so subtly) follow Iida’s gaze, and Izuku nearly chokes.\n“Huh,” Shouto blinks. “He brought his girl out to play.”\nKatsuki and Chiyou are here. Chiyou’s hand is loose at Katsuki’s arm, and as expected, they’re ambushed by Sero and Eijirou. Chiyou seems to greet them politely, but Katsuki looks like he was forced to swallowed a lemon. Well, it’s not so different from his usual expression – but he doesn’t look thrilled to be here.   \n“Damn, she’s hot, isn’t she?” Ochaco pouts.\n“Yes, but still an odd couple, if you ask me,” Iida says.\n“Maybe she’s coming around?”\n“Who knows. But five months is a pretty long time in Bakugou years,” Shouto says.\n“You’re so mean when you drink,” Izuku laughs, pushing his shoulder.\n“Then finish this for me,” Shouto offers, and Izuku shoots back the liquor.\nMina appears out of nowhere, obviously on a mission to reach Katsuki as she jumps over a knocked-out Aoyama.\n“Hey! Hey Midoriya!”\n“Hm?”\n“Pop this?”\nIzuku already knows what she means, so he wordlessly takes the beer bottle and pops the cap off his bicep. He hands it back, and Mina blows a kiss before vaulting the couch and jumping onto Eijirou’s back.\n“I hope you know it’s hot when you do that,” Ochaco says.\nIzuku snorts, and takes the second cup Shouto passes him.\n“Stop that, it’s just convenient.”\n“Conveniently hot,” Shouto says.\n“They’re pouring shots,” Iida observes. “Another round?”  \n“Sure.”\n“Aww come on,” Izuku sighs. “It tastes so bad.”\n“The night’s still young, my friend!”\nIzuku looks towards the opposite end of the room, where Katsuki is sitting with Chiyou in his lap, chatting up friends. He spots Izuku staring, and Izuku whips his head around.\n“Fine.”\n \n \nIzuku hates being a nice person.\n \nOkay, that's not entirely true. But another hour passes, and Izuku can’t help but notice that Chiyou has been abandoned for a drinking game. Well – it’s likely that Katsuki was unwillingly dragged into it, but it’s obvious that Chiyou doesn’t know anyone here, because she’s sitting alone.\nThis is what he wanted, right? A chance to get along with Katsuki’s precious person?\nIzuku swallows back the sick feeling, and approaches with a bag of chips as a peace offering.\n“Snack?”\n“Oh – sure,” Chiyou accepts. Izuku sits at the stool adjacent to her, and watches Katsuki nail the ping-pong ball right in the middle cup.\n“I hope the whole evening hasn’t been like this,” Izuku gestures to the commotion in the backyard.\n“No, no,” Chiyou smiles. “Just the last few minutes. Katsuki is very attentive.”\n“Uh huh,” Izuku deadpans without thinking, and Chiyou laughs.\n“Really, he’s a good boyfriend. I asked to come tonight, even though he was strongly against it.”\n“I see.” Izuku twists his cup in his hands, and offers a smile. “Well, I’m glad you came.”\n“Mmm, I’m very lucky to have the number one hero keeping me company.”\nIzuku doesn’t know what to say.\n“Ah. Well…”\n“What? You thought I didn’t recognize you?” Chiyou giggles, and twists a blue curl around her finger. “Katsuki doesn’t talk about you much, but your face is everywhere. It’s really an honor, Deku-san.”\n\nHe doesn’t talk about me? \n\n“Just Midoriya is fine!” Izuku waves. “I’m happy to finally sit down and speak with you after so long.”\n“Agreed! How do you know Katsuki?”\nWhat does he say? How does he possibly unravel their long, complicated history? How does he not info-dump about how far Katsuki has come, and how much he’s grown? How does he respond without sounding completely and utterly in love with him?\n“Just friends,” Izuku settles. “But that’s not important. How did you two meet?”\n“Well,” Chiyou starts, and Izuku does his best to pay attention. He powers through the pain like any other battle, smiles big and nods along because it’s easier to hide that way.\nShe’s pretty and sweet, and she has a testy attitude to keep up with Katsuki, and she’s good with music and street-smart, and she’s the exact person Katsuki would pick up at a bar, so why can’t Izuku just like her already? Why does he have to feel like he’s drowning all the goddamn time?\nKatsuki comes back within the hour. When Izuku sees him stomping their way, Izuku waves his goodbye and dips into the crowded part of the house.\n“Shots,” Izuku demands, tapping the kitchen counter. “Give me something, anything.”\n“Good lord,” Jirou lifts her eyebrows. “You good bro?”\n“I’m fantastic,” Izuku says. “Please help me trick my metabolism for five minutes.” And because Jirou is a real one, she pours him a painkiller, lines up a row of shots and sends him on his way.\n \nAnd uh, that’s where stuff gets a little blurry. Izuku remembers something vaguely about lifting cars with Satou in the front yard and then something something kegstand, something something mario party – and Izuku spots candy-cane hair and goes oh, a safe space, and Shouto convinces him to dance, and then disappears like an asshole.\nThe makeshift dancefloor is hot and loud and crowded, and Izuku spends his time trying to dance without spilling his cup over – so he’s slow to react when a hand slides snug and hot around his waist. Izuku recognizes the fingers immediately. He’s been punched, strangled, picked up and cared for by these hands too many times. He’s held them, cried into them, nearly died for them.\n“Kacchan,” Izuku turns.\n“Dude.” Katsuki looks into his cup, and then back at him. “You’re wasted.”\n“Yeah, I’ve worked hard at it,” Izuku huffs. “I’ll sober up in ten minutes if I don’t keep going.”\n“That might be a good thing. You look like a deer on ice.” \nIzuku realizes that he wasn’t very successful at not spilling his cup. Izuku tries to step away, and Katsuki catches him before he falls.\n“Fuck you are too goddamn old for this,” Katsuki huffs. “Come on, shithead.”\n“Mmm.”\nIzuku is led through the house and out to the front lawn. His cup is taken from him, and Katsuki forces him to sit on the front step. He reappears with water, dumps half of it on Izuku’s head and makes him drink the rest.\n“Ack! That’s cold,” Izuku wines.\n“Good,” Katsuki says, sitting next to him. “You were bein’ a fuckin’ embarrassment.”\nIzuku frowns, and twists the bottle cap in his fingers.\n“So mean. I’m a great dancer.”\n“Two left feet since highschool,” Katsuki says, resting his elbows on his knees. “Ain’t gonna’ change.”\nIzuku hums. His sight becomes clearer with time, but he feels hot and sticky and the numb parts of his hands are tingling. Katsuki looks too good tonight – too kissable.\n“Where is Chiyou-san?”\n“Chattin’ up the girls.” Katsuki looks at him – and it’s his serious face. “Saw you two getting along earlier.”\n“We talked for a bit,” Izuku shrugged. “Seeing as you never let us hang.”\n“Ain’t no reason to.”\n“Meanie,” Izuku sighs, resting his eyes for a moment. “Be nice to her, Kacchan. She’s sweet.”\n“Ha,” Katsuki deadpans. “You don’t even know. She’s such a fake.”\n“Meaaan,” Izuku drawls. He pauses, and smiles, “But you’re soft to her. You must really care about her.” He gets no answer from Katsuki, and Izuku peels open his eyes. The music is dull and thumping from the house, and Izuku picks at the plastic label on the bottle. He decides to just ask. “Do you love her?”\nKatsuki gives him that look again. The one that feels like an x-ray. Like he’s reading Izuku’s body like a book, word for word. He’s deciding if Izuku will remember this or not. Katsuki appears to make up his mind.\n“I’ll probably…only love one person in my life,” Katsuki says, and rights Izuku by the shoulder when he starts to slump too far forward.\n“Awh,” Izuku smiles, and thunks his head against the stair post. “You’re a secret romantic.”\n“You’re in such deep shit tomorrow.”\n“Yeah yeah,” Izuku waves. “Let me not be in pain for five minutes.”\nIzuku misses the surprised look on Katsuki’s face. He’s too busy watching Denki chase Mina through the yard.\n \n \nIzuku doesn’t get hangovers, so he’s at the gym bright and early. He texts Shouto asking if he’d like to come, but he gets about a hundred middle finger emoji’s, so he takes that as a polite no thank you. \nHe spends a heavy amount of free time at this gym. The membership is hero exclusive, and it’s nice because Izuku doesn’t have to worry about autographs or cameras (not that he minds those things; just…not while he’s deadlifting six-hundred pounds).\nIzuku takes a break to re-wrap his hands, and he catches his reflection in the mirror. There is hardly any space left on his arms that isn’t covered in scars, or a horrendous amount of freckles – and while Izuku has succeeded in putting on muscle, he’s failed at preventing more injuries. Izuku is frequently called cute by his friends, but he’s not smooth or soft or pretty like the word entails.\nEven if the stars aligned; even if by some deity, Izuku stood a chance with Katsuki – it just wouldn’t be possible. Izuku is not cute.\nHis hair does look nice though. Izuku likes looking at it. The cut makes his face look masculine, which isn’t so bad when Izuku covers up his arms with compression sleeves. Maybe in a different reality…\nBut no, Izuku wouldn’t trade his job, or his scars, or his quirk – not for all the cute boys in the world. He’s at peace with that.\nIzuku throws a dry shirt on, rewraps his fingers and gets back to lifting.\n \n \nKatsuki has been acting stranger than usual. That’s definitely saying something, because Izuku will tolerate a lot of nonsense before he begins to think that Katsuki is acting weird.\nIt’s nothing he can put his finger on, really. But every once in a while, he’ll hesitate before leaving Izuku’s office. Or he’ll double check Izuku’s direction during a fight, when normally he’d just blast off and leave him to it. They’re all small ticks – miniscule and unnoticeable to anyone else, but the day Katsuki knocks on his apartment door, Izuku can’t ignore it anymore.\n“Are you okay?” Izuku asks, legs tucked up on the barstool. Katsuki pauses his eating, and narrows his eyes.\n“Eh?”\n“Just…” Izuku waves his hand around. “You can like…talk to me…?”\nKatsuki opens his mouth like he’s about to yell, and Izuku braces himself because he knows it’s coming – but then Katsuki doesn’t yell, and okay, that’s freaking weird.\nKatsuki closes his mouth, frowns, and squishes his eyebrows together. He clears his throat.\n“Are you okay?”\nThat’s definitely not the question Izuku was expecting.\n“Uh…” Izuku blinks. “Yes?”\nKatsuki squints.\n“Yes? You’re not lying to me, are you?”\n“Yeah? I’m fine?”\nA looong pause.\n“Okay,” Katsuki says, and continues eating. “Eat your crap before it gets cold, nerd.” And then that’s the end of it.\n \n \nKatsuki doesn’t stop being strange. He definitely never knocks again, but Izuku decides to write it off as Katsuki being Katsuki.\n \n \nShit blows up on Katsuki’s six-month anniversary. No, literally. Half a block explodes.\nIzuku is on call with shift C, and he takes charge of the situation to help evacuate civilians. Unfortunately, he gets into a fist fight with a doped up supervillain, and Izuku gets his ass whooped on TV. He still won, but Izuku really hates getting his ass whooped on TV. The news floods with nay-sayers and debate about rank and blah blah blah, it’s fine, a broken leg and a few stitches are nothing.\nThe leg is healed at the hospital, and Izuku is discharged within an hour. He decides not to check his phone until he is walking home, and he’s met with a few check-ins from his friends and family, as well as a very angry barrage of texts from Katsuki.\n \n\n&gt;&gt; watchin the fight, txt me when ur off   \n\n\n&gt;&gt; deku, u ok? \n\n\n&gt;&gt; DEKU I swear to FUCK you JUST healed that leg\n\n\n&gt;&gt; I am so goddamn pissed @ u, call me \n\n\n&gt;&gt; u better fuckin answer me \n\n\n&gt;&gt; i will drive my ass over there \n\n\n \n\nIzuku can almost hear the anger in his voice, and his concern makes Izuku smile. He texts back quickly so Katsuki won’t murder him.\n\n \n\n\nThey discharged me already, few stitches &amp; the leg is mostly healed. Headed home : ) &lt;&lt; \n\n\n \n\nHis phone pings almost immediately. Katsuki really was waiting for him.\n \n\n&gt;&gt; I’m coming over. \n\n\n \n\nOh. Izuku looks at his phone, then up at the street sign he’s passing. Technically, his car is back at the firm, and it’s really not worth paying a taxi, especially because Katsuki’s apartment is only two blocks away. Maybe if Katsuki is feeling generous, he’ll give him a ride home.\n \n\nI’m actually closer to your apartment. I’ll come stop by &lt;&lt; \n\n\n \n\nIzuku gets no response, so he takes that as an okay. He has to limp down the block, and he has that achy, post-fight soreness in his body, but it’s not a big deal. Yeah, he could use his quirk to jump half the block, but Katsuki would throw a bitch fit, and Izuku is very tired.\nHe is forced to see the fight replayed on several billboards and store televisions, and Izuku keeps his hoodie tight as he wobbles up Katsuki’s apartment stairs. Security lets him in, and Izuku makes his way through the hall. Mmm, something smells good – maybe Katsuki was cooking –\nHe alerts to shouting. Izuku tenses, and approaches the end of the hall on edge and ready to fight if needed. Not that a yelling Katsuki is a oddity, but not in his own apartment — not in his safe space.\nIzuku sees that Katsuki’s door is half open. The keys are still in, like someone had begun to leave.\n\n“-you can’t keep doing this!” \n\nThat’s Chiyou’s voice.\n“You’re pissin’ me off,” Katsuki growls, forcibly lowering his voice. “I don’t care who the fuck you think you are, you’re not the boss of me.”\nOh no, Izuku pales. Is this a lover’s spat? \nIzuku’s heart begins to race. Maybe he should just go... he’ll tell Katsuki he got held up at the grocery store or something.\n“You’re going to ruin everything! Months of my life down the drain!” Chiyou hisses.\nKatsuki’s growl sets Izuku’s hair on end. “I told you I haven’t done shit!”\n“If you really want this to work, you can’t keep running off to your precious Deku whenever he breaks a nail!”\n \nIzuku’s heart sinks past his feet, into the floor, and six miles under the ground.\n \n“You better shut the hell up while you’re ahead,” Katsuki growls, but Izuku can’t hear anything. Blood rushes past his ears, and his face heats so quick it makes his stomach sick.\n \n\nI’m the problem? This whole time, it’s been me? \n\n\n \n\nIzuku doesn’t realize the fighting has stopped. The door is yanked open the rest of the way, and Katsuki freezes full stop. His voice runs so quiet, it cracks.\n“Deku?”\n \n\nIt’s my fault. \n\n\n \n\n“Hey,” Katsuki frowns, gripping the doorway and leaning closer. “How much did you hear?”\nIzuku gives him the easy answer, which is to turn on his feet and run like hell. Fuck his leg hurts, but he jumps halfway down the stairs and activates his quirk to dash down the block. Sharp, precise explosions pop off behind him, and Izuku’s heartrate spikes because he knows Katsuki is chasing him.\n\n“DEKU!” \n\nNope nope nope. Izuku can’t deal with this, he can’t process this right now, he can’t –\nIts me, he thinks. His girlfriend hates me.\nIzuku’s bad leg gives out from too much too fast. He tucks and rolls via instinct, but he’s slow to get up, which is enough time for Katsuki to close the gap.\n“Stop, goddammit!”\nIzuku gets another short sprint down the street before he’s grabbed by the arm and yanked between two buildings. His back hits brick, and Izuku prepares for a fight, but Katsuki slams his forearm against his chest, and Izuku’s body chooses that moment to remind him of how tired he is.\n“Are you fucking crazy?!” Katsuki barks. “You’re hurt, you stupid son of a bitch!”\n“I can’t do this right now,” Izuku says, voice wobbling. “Kacchan I can’t, please –”\n“What did you hear?” Katsuki repeats, this time low and gritty and with zero tolerance for nonsense. Izuku wants to fight back, but his eyes are burning just like the rest of him. Right up to ash.\n“I’m the reason you don’t bring Chiyou-san around,” Izuku says, and it all comes spilling out at once. “I’m always taking up your time – always hanging out with you — I should’ve said no – I should’ve – ”\n“What the hell are you saying?”\n“I’m ruining your happiness,” Izuku cries, wiping his eyes. “The first person you date, and I’m causing more problems for you.”\n“Deku—“\n“Kacchan I’m sorry. You knew how I felt, didn’t you? You knew, and you were just being considerate –”\nIzuku stops, because he realizes that Katsuki is kissing him. It takes him several moments to process this – but yes, there is a hand at the back of his head and yes Katsuki is leaning down, nose tipped to the side and his mouth is warm and none of this is how Izuku dreamed it would be.\nKatsuki is pulling back as fast as he came, and he levels Izuku with a serious look.\n“Deku. It’s not –”\nAnd at that moment, Izuku’s brain catches up to the present. Then, oh then, he’s absolutely pissed.\n“How dare you!” Izuku shouts, and shoves at Katsuki’s chest with both hands. He’s strong, and Katsuki stumbles back several steps. “How fucking dare you! How could you do that to me? How could you do that to Chiyou-san?!” \nKatsuki grits his teeth and comes back swinging, gripping the front of Izuku’s shirt and pushing him back against the brick so hard he probably loses some skin.\n“Will you just shut up for five seconds?!”\n“Get off me! Scumbag! Cheater!” \nIzuku’s mouth is covered by Katsuki’s hand, and Katsuki leans down real, real close; his voice drops to a low and dangerous whisper.\n“Izuku.”\nHe pauses.\nKatsuki waits for Izuku to stop fighting, before he lowers his voice even further.\n“We. Aren’t. Dating.”\nIzuku rips his hand off his mouth.\n“Yeah right, nice ex –” Pause. “Wait, wh-what?”\nKatsuki pulls away and sighs. He looks tired all of a sudden. He runs a hand through the back of his hair and breathes heavily out of his nose, forcing himself to be calm.\n“I’ll tell you everything, okay? We need to go somewhere else.”\n“You’re…you’re not dating Chiyou-san?”\n“No.”\n“Then why would – why did you – ” Izuku’s heart runs circles, and he scrubs at his eyes. “Why would you do that to me? I thought you knew.”\n“Knew what Izuku?”\n“That I’m in love with you,” Izuku wobbles.\nKatsuki suddenly looks like he’s seen a ghost and oh, Izuku just made this a thousand times worse.\n“You…love me,” Katsuki repeats numbly.\nHere it comes, oh here it comes. Like a herd of wildebeests, like a big ole stampede, Izuku feels himself go under, and panic consumes him like a wave.\n“I’m freaking out,” Izuku blurts, “Kacchan I’m freaking out, I’m –”\nKatsuki catches on real fast. He grabs Izuku before his legs give out, and he pulls him under his arm.\n“Shit, okay – calm down. We’re going back to my place.”\n“But Chiyou-san –”\n“Oh my god, just shut up and breathe.”\n \n \nIzuku has the rest of his panic attack on Katsuki’s floor. He keeps his back to the couch, his forehead pressed to his knees as his entire world spins in manic circles. He hasn’t had one of these in years, and it’s been even longer since Katsuki has witnessed one, and it’s embarrassing, but Kastuki doesn’t say a word.\nIzuku keeps his head down, but he knows Katsuki is sitting next to him. He’s not saying anything, not moving or breathing heavy. His hand is solid around Izuku’s bare ankle, like he’s letting him know where he is, and it makes him feel better but also worse. Whenever Katsuki’s thumb rubs over bone, Izuku breaks out in full shivers all over again.\nApparently Katsuki told Chiyou to get lost for a few hours. It’s good, because Izuku isn’t sure if he could handle another person seeing him like this.\n“I’m sorry,” Izuku mumbles.\n“No,” Katsuki sighs, and slides until his head rests back against the couch cushion. “I’m sorry.”\nIzuku peeks open an eye at that. Apologies are far and few in between with Katsuki, and Izuku checks to make sure it’s him. Short spikey hair, a littered sleeve of tattoos, orange plugs, a mole at his neck and stupid weed socks. Yeah, it’s him.\n“Kacchan. What is going on?”\nKatsuki turns to stare at him. He looks Izuku up and down, and asks,\n“You okay?”\n“I’m not sure yet. But tell me the truth and I’ll let you know.”\nKatsuki draws a knee up, and breathes out forcibly.\n“Fine. But let me say it all at once, alright?”\n“Fine.”\n“Tch. Truth is, I was cornered by the Hero Commission six months ago. They told me they had an operative or some shit that needed a fake identity to work a long-term honeypot mission. Their hit was a dude in the yakuza that had a thing for taken women, sick bastard. Chiyou needed a fake boyfriend and safe housing during the day.” Katsuki frowns, and rubs his eyes tiredly. “I wasn’t given much of a fuckin’ choice. Do as they say or get wrecked by the Commission.”\n“Wait…” Izuku sits upright. “Chiyou-san is an undercover agent?”\n“I don’t even know her real name,” Katsuki admits.\n“B-But…” Izuku wracks his brain. “Th-the hickies and… and the photos and…”\n“We never fucked,” Katsuki says. “Fuckin’ never – I dunno’ what she got up to at night and I didn’t wanna’ know. And the photos were just to keep up appearances. The whole thing was a set up.”\nThat’s the piece Izuku was missing. That was the puzzle. \nIzuku slumps down and stares at the wall. His body doesn’t know what to do anymore.\n“I feel like an idiot,” Izuku whispers.\n“The assignment was annoying, but whatever,” Katsuki says honestly. “I just fuckin’ hated lying to you. Especially ‘cause I could tell it was upsetting you, but I couldn’t figure out why.” Katsuki’s voice goes softer, and his face gets lost in thought. “Well…now I do…”\nIzuku’s face burns fire hot.\n“Fuck me. Can we just…forget that I opened my stupid mouth?”\n“Two fucks in one hour,” Katsuki marvels. “You’re having a bad day.”\n“Katsuki, please.”\nHe freezes at his given name. Izuku still feels like he could cry at any moment. The ceiling fan spins, taunting him with its perfect circles and consistent hum.\nKatsuki breaks the silence.\n“Why do I have to forget?”\n“I don’t want to ruin this more than I already have,” Izuku admits. His voice cracks. “I can’t handle being teased about this. And I can’t handle losing you. I’m sorry.”\nIzuku is unable to tell what Katsuki is thinking, and it’s killing him. His face is a wall, drawn away and impossible to read, and Izuku feels shut out. Like he’s standing out in the cold.\n“I should go home –”\n“You can’t love me,” Katsuki says, and Izuku stops in his tracks. “You shouldn’t.”\nIzuku frowns defensively, and meets him head on.\n“Now why not?”\nKatsuki snorts, and picks at a thread on his knee.\n“Hmm, well. Because I’m a piece of shit? Cause I made half your life hell? Or because I lied to you for six months?”\n“That last one wasn’t your fault.”\nKatsuki smiles, “Glad to know I’m forgiven.”\nIzuku looks away. Katsuki’s apartment is very still; as if the world has stopped, and it’s waiting for them to sort this out and move on, so life can spin again.\n“There isn’t much I couldn’t forgive you for,” Izuku admits.\n“That’s bad, Deku,” Katsuki sighs. “You know that’s bad. We’re not healthy.”\nIzuku thinks of how often Katsuki has his back. How much he protects him in his own way. How much he worries, how he shows affection in haircuts and water bottles and the way he smiles when they’re alone.\n“No,” Izuku mumbles. “We’re healthy. You just don’t see it yet.” Katsuki goes quiet, and Izuku grabs the corner of his pant-leg and tugs to get his attention. When Katsuki looks at him again, Izuku asks, “Why did you kiss me?”\nKatsuki looks through him. Izuku just accepts it this time, and he doesn’t back down as Katsuki leans closer.\n“Why did I kiss you?”\n“Yes.”\n“I want you to think about it,” Katsuki says, planting a hand on the carpet so he can balance closer. “I want you to think real, real hard for me.”\nIzuku isn’t sure where to look. His eyes jump between his nose, his lips and his cheeks – then back to his eyes.\n“Don’t tease me.”\n“Come on, nerd,” Katsuki prods, not moving any closer, but his voice grows deeper. “You’re smart. Why’d I pick on you in middle school?”\nIzuku’s eyes widen.\n“Why…”\n“Why do I keep your house key?” Katsuki continues. “C’mon genius. Tell me. Why don’t I date?”\nIzuku can barely say it. His throat feels dry.\n“Because…you like me?”\n“I love you, moron,” Katsuki corrects, and Izuku breaks down crying. Katsuki grabs his cheeks like he’s trying to stop the tears, but it’s beyond either of their control. Katsuki’s fingers are smooth from his quirk, not as rough and torn up as Izuku’s, and they rub in circles. “Sorry I kissed you,” Katsuki mumbles. Izuku laughs wetly.\n“Don’t apologize for that.”\nKatsuki doesn’t answer, and he doesn’t move either. Izuku leans in to kiss him through his tears – just a soft, short press, and Katsuki doesn’t kiss as rough and fast as Izuku might have expected. He just waits for whatever Izuku is willing to give, and it yanks terribly at the strings in his heart, but it also heals a part of him too.\nIzuku pulls away and hiccups, and Katsuki sighs, wiping under his eyes.\n“Such a big baby.”\n“Sorry.”\nKatsuki stares, and the look in his eyes says that he’s very far away. Izuku hasn’t seen him drop so many walls in a long time. Katsuki is glaring at his freckled cheeks like he put the tears there.\n“I’ve always hurt you,” Katsuki frowns. “And I’m going to keep hurting you. Even though – fuck, I really try not to.”\n“A little hurt is okay,” Izuku sniffs. “I like rough.”\n“You’re an idiot.”\n“I’m the Number One, I can take it.”\n“Now you’re just pissing me off.”\nIzuku doesn’t care. His brain is repeating; Katsuki loves me, he loves me – over and over like he might forget it – and fuck it, you know? Fuck it. They’ve come this far.  \nIzuku ignores the discomfort in his knee in favor of swinging his thigh over Katsuki’s legs and sitting on his lap.\n“I want to be Katsuki’s girl,” Izuku says outright. Katsuki’s eyes slowly grow bigger, like Izuku’s words are sinking into that thick skull of his. Katsuki drops his hand to hold Izuku by the thigh. It sends tingles up his leg and into his spine.\n“Hey. You’re gonna’ fuck up your leg even more.”\n“I want to be,” Izuku repeats, grabbing Katsuki by the chin and squeezing, “Katsuki’s girl.”\nKatsuki feels like a wolf in his hands. Like he might turn his head and bite a chunk out of his arm. His eyes are narrowed and Izuku’s neck pricks like he’s in danger, but Katsuki doesn’t bite. However, his voice does growl.\n“I have another three weeks until Chiyou’s mission is finished.”\n“Okay.”\n“It could be longer.”\n“Alright.”\n“I’m not gonna’ let you take any of this back.”\n“I’m fine with that.”\nKatsuki huffs hot air through his nose, and Izuku cracks a smile, because he knows he’s won.\n“Here’s what we’re going to do,” Katsuki says, grabbing his wrist tight. “I’m going to drive you home and turn off all your alarms. You’re going to sleep this off, and then you’re going to go on a date with me.”\n“But you said Chiyou-”\n“I’m going to cook you dinner,” Katsuki tells, “And I’m going to bug the everliving shit out of you for the entire night, and then you can tell me what you want.”\nIzuku smiles, and it feels like a million pounds has been lifted off his shoulder.\n“I’m amendable to these terms.”\n“Shut the hell up, oh my god.”\n“We’ve done this all backwards, haven’t we?”\n“When the fuck have we ever done something the easy way?”\nAnd that’s true, isn’t it? \n \n \n \n \n \n \n \nKatsuki drops him off at his apartment, and Izuku feels like he’s had cement poured into his bones.\nHe’s slow moving as he opens the car door, like his brain can’t process everything fast enough.\n“Hey,” Katsuki snaps, and Izuku turns to look at him. “Calm down. It’s gonna’ be fine, I’ll see you at work.”\nThey’re small words as far as comfort goes, but they make Izuku feel infinitely better anyways. Izuku smiles back at him, and the concerned look on Katsuki’s face smooths out into exasperation.\nHe waits until Izuku is fully inside his apartment building before driving away.\n \nIzuku is slow to fall asleep. He spends too long tracing his mouth, trying to remember exactly what Katsuki tasted like – even if it was something so short lived.\n \n \n \nIzuku takes way too long to register the repetitive sound as knocking.\nNobody knocks on his door anymore; Shouto and Ochaco always send a text and Katsuki usually kicks down the door like the apartment is on fire and maybe it could be Iida, but he always calls formally to ask if he can visit and Izuku hasn’t checked his phone in a couple minutes but he’s pretty sure –\nThe quiet rapping repeats again, and Izuku swings his legs out of his recliner and hobbles to the door with one slipper on.\n“Coming!” Izuku calls. He unlocks the door and opens it to – “Chiyou,” Izuku gapes.\nHer blue hair is up in a ponytail, and she looks like she might’ve left the apartment in a rush.\n“Can I come in?” Chiyou asks politely.\n“Uhhhhh,” Izuku stares. “Sure? I um, it’s kind of a mess right now, sorry…”\nChiyou steps into his apartment; Izuku curiously shuts it behind her, and Chiyou bows at the waist.\n“Katsuki told me everything. I’m so sorry for causing you so much trouble, Midoriya-san.”\n“Oh!” Izuku gasps. “No – no, please. It wasn’t your fault, you were just doing your job and – wait.” Izuku pauses, his stomach rolling. “Katsuki…told you?”\n“Well…” Chiyou rubs her arm and laughs nervously. “I uh. My quirk forces people to tell the truth. He’s um, pretty mad at me for using it on him, haha – but I didn’t have a choice! He was acting so weird and – well, nevermind that. I’m kind of avoiding the apartment right now.”\n“Ahhh,” Izuku nods knowingly. “Please have a seat.”\n“Oh sorry – I can’t stay for long. But um, I really wanted to apologize for what you overheard the other day. It was nothing personal against you, I promise.” Chiyou plays with the rings on her fingers. “I just couldn’t afford any media scandals against our ‘relationship’, when I’d come so close to completing my mission.”\n“No offense taken, I completely understand,” Izuku waves. “Undercover heroes do very important work, I’m sorry to have gotten in the way.”\nChiyou smiles and adjusts her bag on her shoulder.\n“That’s a relief. I would’ve crawled in a hole and died if I found out the Number One hero hated my guts.”\n“I could never,” Izuku laughs. “I was just uh. Terribly jealous, I’m sorry.”\n“I have to go, but — please trust me when I say you have nothing to be jealous of. Katsuki is obsessed with you.”\nIzuku feels his face warm. “Oh.”\nChiyou giggles, “You’re so cute! Thank you for your understanding. Please tolerate these conditions for a few more weeks, and then I’ll be out of your hair.”\n“It’s not a problem,” Izuku nods. “Please stay safe.”\nChiyou waves on her way out the door, and Izuku feels full of good, giddy energy, so he turns around and decides to jog it off at the gym.\n \n \n \nThe hardest part about all this is going back to work on Monday like nothing ever happened. Izuku works with Shouto on some search and rescue, and when the job is done it takes every ounce of Izuku’s self-control to keep his mouth shut.\n“You have something to say,” Shouto observes, because he’s too smart for his own good.\nIzuku sighs, and sits on an upturned bus.\n“I can’t tell you yet.”\n“I’ll be here when you can,” Shouto says, and that does so much to calm Izuku’s nerves, that his eyes burn up. Shouto sighs and tosses him a canteen of water. Izuku catches it and grins. \n“Thank you, Shouto.”\n“Yeah, yeah.”  \n \n \nKatsuki isn’t scheduled today, so Izuku doesn’t see him in the office. It might be a positive thing; Izuku isn’t sure how to act right now.\n \nIzuku keeps thinking about that dramatic afternoon in Katsuki’s apartment; his brain replays Katsuki’s words over and over, picking them apart for meaning until they’re nothing but bare bones.\nKatsuki thinks Izuku is going to change his mind – as if the feelings he’s held for the past fifteen years mean absolutely nothing. Izuku’s mind isn’t going to change.\nBut with Katsuki…it just seems too good to be true. While Izuku is terribly relieved over the Chiyou situation – what is stopping Katsuki from finding someone better? Nothing, that’s what.\nIzuku sticks his key in his door to find it already unlocked.\n“You’re…in my apartment,” Izuku observes, dumping his backpack to the floor.\nKatsuki lifts his eyebrow.  \n“And?”\nHe’s wearing Izuku’s All Might apron, and…unfortunately, he appears to have found the Ground Zero spatula that Izuku bought in secret.\n“What are you doing?”\n“Making you dinner, stupid,” Katsuki says lightly, and stirs something that smells delicious. “Nice spatula.”\n“It had your face on it and I thought it was funny,” Izuku argues, but crosses into the kitchen to wash his hands. “Why are you cooking here?” \nKatsuki gives him an unimpressed look.\n“Did you forget already?”\nOh, shit. “Is this a date?!”\n“Ding ding ding, good job genius.”\n“Kacchan! I haven’t even showered yet! I’m just in –” Izuku pulls at his shirt, “—some random clothes I had in my locker.”\n“Doesn’t matter, sit down,” Katsuki points with his own spatula-face. “I told you I was going to annoy the shit out of you.”\n“Well you don’t have to actively try,” Izuku retorts, but does as he’s told. He only has two kitchen chairs, and he chooses the one that lets him watch Katsuki as he cooks. Izuku doesn’t know how to make the switch from best-friend to supposed love-interest, so Izuku tries to act casual and ask, “Is this what you did today?”\n“No, fuck off. My life doesn’t revolve around you.”\nThat’s not what Izuku meant, but. Ouch. \n“Right,” Izuku shrinks. Katsuki freezes, and his shoulders draw tight. \n“That...was a joke,” Katsuki points out stiffly. \n“I know that.”\nKatsuki sighs heavily, then turns down the stove so he can spin around and cross his arms. Izuku tenses even further.\n“You’re going to make this weird, aren’t you.”\n“You have to admit,” Izuku rubs his neck. “It’s a little weird. I’ve known you for twenty years and now you’re cooking me dinner. I don’t know how to… I mean, I don’t know what you want from me.”\nKatsuki takes a long moment to look him over, before snapping his gum and blinking once.\n“I don’t want to be with anyone other than Izuku right now.”\nIzuku’s eyes jerk up at his given name.\n“With…Izuku.”\n“Not the hero Deku – and definitely not whatever the fuck you’re doing right now,” Katsuki huffs, gesturing to how tense Izuku is. Izuku sinks down in his chair in an attempt to look casual, and Katsuki continues. “I just want the nerd who eats like a pig and can’t shut up about work and doesn’t tolerate my shit.”\nIzuku laughs, and the knot in his stomach unravels.\n“I can do that.”\nKatsuki relaxes a little, and he turns back around to stir his curry again.\n“You’re still my friend, you bastard.”\nBecause Katsuki’s back is turned, Izuku can get away with smothering a smile into his hand. Katsuki always says what he needs to hear, even if it’s vicious and in some long roundabout way.\n“I’m glad to hear it. Do you need any help?”\n“Tch, like I need any help from you,” Katsuki scowls, and it feels normal enough for Izuku to not freak out just yet.\n \n \n“This is so good I could cry,” Izuku whines.\n“That’s because you eat a diet of protein powder and rice,” Katsuki snaps. “Anything would be impressive to your pathetic palette.” \n\nThis part doesn’t feel any different than usual. They’ve shared so many meals together, Izuku couldn’t even begin to count.\nIzuku hums, “This is where you would say thank you, Izuku.”\nKatsuki mocks his tone, “Thank you, Izuku.”\n“I’m not feeling very romanced right now,” Izuku jokes.\nKatsuki actually pauses his eating, and huffs in frustration. He rubs his eyebrows and sighs, “I guess I’m not any good at this either.”\nSomehow, despite Katsuki’s prickly appearance, he can still manage to look like a kicked puppy.\nIzuku’s heart rolls up in a little paper ball, and he fights the urge to cross the table and squish his face in his hands. Cut his fingers on his cheekbones and his teeth and his sharp jaw.\n“I fell in love with this Katsuki,” Izuku explains, and Katsuki’s eyes jerk to look at him in surprise. “Like you said. I just want to be with you.”\nHe spins his chopsticks between his fingers and mulls, “Some would say that makes you a masochist.”\n“No,” Izuku laughs. “You’re just – brutally honest. It’s what I like about you. These days…it’s kind of refreshing.” Izuku pushes rice around his plate. “None of this feels real.”\nKatsuki takes one look at their (mostly) empty plates, and decides to scoot his chair backwards and stretch out an arm.\n“Come here.”\n“Are you serious?”\n“Do I look like I’m joking?”\nIzuku hesitates, before slowly rising out of his chair and walking around the edge of the table. Katsuki already ditched the All Might apron, so he’s cozy in a sweatshirt and joggers and warm black socks, and Izuku comes to stand by him, not really sure what Katsuki is after.\nKatsuki grabs his wrist and tugs, urging him to straddle his lap. Izuku doesn’t put up a fight, but, “We’re going to break this chair,” Izuku tells.\n“No we won’t.”\nIzuku balances by grabbing the back of the chair, and Katsuki pulls until he’s snug against him. Katsuki holds a lot of body-heat naturally, and the level look on his face makes Izuku heat up in return. Izuku tries not to squirm — and he laughs nervously, hoping Katsuki can’t hear his heart right now.\n“Kacchan, I worked ten hours in the sun. I smell so bad right now.”\n“I’ve known you for how long?” Katsuki drawls, fisting into the back of his shirt. “You think I don’t know what you fuckin’ smell like?”\n“Ah.”\nThat’s hot. Why is that hot? \nKatsuki always smells like burnt sugar and caramel and cologne sometimes, when he cares. He’s a naturally sweaty guy, but it’s never bothered Izuku.\n“So you ate my food,” Katsuki decides, hand warm on his lower back. “Is there a verdict?”\nEverything he wants is right in front of him, but Izuku is still hesitant to take it. The skeptical side of his brain can’t stop circling every liability, can’t give up all the reasons why this is probably a bad idea. Izuku doesn’t realize he’s mumbling until Katsuki snaps his fingers in his face.\n“Aye nerd! You know I can’t understand a damn thing when you do that.”\nIzuku steers himself back to the present, “Ah, sorry.” He decides to ask the question at the forefront of his mind, “Aren’t you worried about your reputation?”\n“Hah? You really think I give a shit about all that?”\n“The public is going to eat you up if they see you dating someone else so quickly after Chiyou-san.”\n“No one has to know right now,” Katsuki offers, and he’s somewhat gentle as he runs his hand up and down Izuku’s spine through his shirt. “I’m tired of people all up in my business. It could just be us, for a while.”\nIzuku swallows thickly; prominent butterflies spin around in his stomach.\n“I don’t know why that sounds so nice,” Izuku laughs.\n“Cause I know you’re fuckin’ tired of it too.”\n“What about our friends?”\nKatsuki rolls his eyes, “They’ll figure it out ‘cause they’re a herd of nosy bastards –” Katsuki stops mid-sentence, and Izuku jerks when he realizes he’s skimming Katsuki’s face with the backs of his knuckles.\n“Oops.”\n“S’fine,” Katsuki mumbles. He drags Izuku’s hand back to his face, and he leans in like a dog when Izuku pets up his cheekbone. Izuku bites his tongue to repress a smile, and he rolls his fingers to the side where they’re still sensitive, just so he can feel how soft Katsuki’s face is.\n“You’re very handsome, Kacchan.”\n“Yup,” Katsuki says, and Izuku sticks out his tongue. Katsuki keeps watching him through his eyelashes, like a predator lazily stalking its prey. “I like when you call me Katsuki.”\n“You do?”\n“Mm.”\n“I’ll think about it then,” Izuku teases, rubbing the tip of his thumb behind Katsuki’s ear, careful of his aids. “It’s a hard habit to break.”\nKatsuki rolls his eyes, but leans into Izuku’s hand again. It feels like nothing else exists, except this.\nIzuku ponders over Katsuki’s switch to using his first name, instead of Deku. He wonders if it’s a show of change. A chance to move on from the past. \nSuddenly, Izuku’s wrist is snatched, and Izuku assumes his time is up. Instead, Katsuki glares suspiciously and asks, “Why do you touch shit like that?”\nIzuku sputters, “What the hell is that supposed to mean?”\n“Like this.” Katsuki mimics the way Izuku rubbed along his fingers, and Izuku has an ah-hah moment.\n“Ohh,” Izuku blinks. “You don’t know?”\n“Obviously not, dammit.”\n“Bits of my hands are numb,” Izuku explains. He leans back a little to show Katsuki his palm. “Mostly here, where I broke my fingers the most in high-school.”\nKatsuki scowls.\n“Are you serious?”\n“Yeah, it’s no big deal. I can feel in my fingerpads. Uh, except the one that got chopped and sewn back on.”\n“Let’s not talk about that,” Katsuki mutters, and forces his thumb around the circular scar. He decides to thread their fingers together, and it’s surprisingly intimate. Izuku can’t take it. Katsuki has very long eyelashes, and they blink rapidly when Izuku leans in to press his lips to the corner of his mouth.\nKatsuki is watching him intently, but he doesn’t speak. Izuku realizes that he’s putting the ball in his court; Katsuki has been waiting for him – for how long, Izuku doesn’t know.\nIzuku tries again, this time squishing down the nerves in his stomach and just kissing him right on. Katsuki receives his kiss slow, only matching the pace Izuku is willing to set. His lips are soft and sticky and sweet, with an overhanging threat of something more dangerous. Izuku decides to turn his nose the other way — and Katsuki is waiting, squeezing their fingers squished between them, allowing Izuku to mentally adjust.\nIzuku runs his tongue against Katsuki’s cupid’s bow, and Katsuki’s free hand digs into the muscle in his thigh – but it’s not what Izuku was looking for, so he pulls back bravely and huffs, “Kiss me, dammit,” and Katsuki takes over. Suddenly his mouth is full of tongue and his teeth are being traced and Izuku moans from his core, letting go of Katsuki’s hand so he can hold onto the back of his hair.\n“S’ that do it for you?” Katsuki grins. Izuku doesn’t even have anything cute to say.\n“Mmf.”\nIzuku goes right back in, and Katsuki meets him open mouthed and very, very hot. Kissing Katsuki isn’t as world shattering as he thought it’d be. It’s his best friend, but it’s also the person he’s been in love with for half his life. The two are surprisingly connected, like an overlapping venn-diagram.\nFingers wiggle into his compression sleeve. It’s pulled off fully, the right then the left, and Katsuki drags his hands up and down the bare skin on his arms, making him break out in goosebumps. Their kisses become quicker, shorter – and finally, Katsuki reaches down to squeeze his ass in one large hand, and Izuku sighs happily out of his nose.\nKatsuki mumbles, “God you’re hot.”\nIzuku clears his throat, and tries to put his head back on straight.\n“Am I too heavy yet?”\n“You callin’ me weak?”\nThe chair chooses that moment to creak loudly, and Izuku breaks out laughing. Katsuki cracks a half smile. \n“How about this,” Izuku proposes, shifting his weight so the chair won’t die. “I’ll go shower, and then we can put on a movie.”\nKatsuki slides his fingers under Izuku’s shirt and pushes upwards, and Izuku’s arms roll out in goosebumps.\n“Can I come with?”\nFuck. Izuku’s face goes hot, and he ends up looking away, over Katsuki’s shoulder.\n“Um. Would you…want to?”\n“That’s a dumb question,” Katsuki deadpans, but pulls his fingers back to hook his thumbs safely in Izuku’s beltloops. “It’s whatever you want.”\nIzuku’s heart is rattling like a bull in a cage but he wants this, he wants this so bad. If he can chase villains in broad daylight and snap his own bones without breaking a sweat, then Izuku can definitely do this.\n“Don’t make fun of me for the freckles on my ass,” Izuku points, standing up off Katsuki’s lap. Katsuki looks momentarily baffled, before he catches on and follows.\n“I only teased you because I liked them, goddamn, you are naïve.”\n“Well you’re the one that flirts by pulling pigtails instead of just telling someone you like them like a normal person,” Izuku huffs. He feels a little guilty about the dirty dishes they’re leaving behind, but Katsuki is hot on his tail, and for some reason he feels the urge to run –\nKatsuki pins him to the inside wall of the bathroom, and Izuku giggles as he leans down to pretend-bite at his neck.\n“Too mouthy. Just shut up and drop your pants already.”\n“Fine, but you have to turn around.”\n“Fucking Christ Izuku, I’ve seen you naked a million times. I’ve probably seen you naked the same amount of times I’ve seen you not naked.”\nIzuku turns up his nose, “I don’t care. Don’t look.”\nKatsuki sighs hard and overdramatic, but he entertains him by stepping back, crossing his arms and turning around.\nIzuku strips quickly, and laughs as he jumps in the shower and shuts the curtain before Katsuki can see.\n“You are such a brat,” Katsuki huffs. The bathroom door shuts, and his voice sounds more echoey.\n“Maybe,” Izuku sings, and squeals when he turns the water on. “Ahh! Cold!”\n“You deserved that,” Katsuki snorts. Izuku bites his cheek at the sound of clothes hitting the floor. The water starts to get warm just as the curtain is ripped back, and Katsuki steps behind him and sets a hand at his side to let him know where he is.\nThe shower is big enough for two normal sized people to fit comfortably, but they’re both pretty big, and Izuku finds himself getting the giggles as Katsuki leans over to dunk his head under the water, and their skulls lightly bonk.\n“I’ll never understand you,” Katsuki says, but it’s fond. Izuku turns around and does a very bad job at not checking him out. He’s cut like stone – with that signature slim waist and a defined V in his hips that Izuku never had the genes for. (He’s also really hung, jeez, but Izuku has known that since his crisis in highschool).  \n“Hi,” Izuku says.\nKatsuki lifts a single eyebrow, before he grabs Izuku by the cheeks and forces his head under the water as well. Izuku sputters, and comes out looking like a wet dog, and Katsuki laughs in his face.\n“Yo.” Katsuki’s smile evens out into a thoughtful, blank look, and he stares Izuku up and down before rasping, “I’m looking at you. Goddamn.” \nIzuku’s chest knots, but he manages to say, “You can look now.”\nIzuku sees the kiss before it comes, but that doesn’t mean he’s prepared. The water splatters over them both, now hot and steamy as condensation builds on their bare skin. Their lips move together through the heat, and Izuku pushes his shoulders up against the tile so he won’t slip and eat shit.\nKatsuki speaks his name into his mouth, his hands skimming up the scars on his abs. Izuku flinches when he reaches a particularly large one. Katsuki breaks the kiss, and it’s sticky.\n“That hurt?”\n“N-no.”\nKatsuki scowls, “You stuttered.”\n“It doesn’t hurt, I promise,” Izuku nods. “It’s just uh, ugly.”\n“You embarrassed or somethin’?”\n“Well…no…”\n“Yeah, you look like a fuckin’ tiger,” Katsuki says frankly. “But it’s hot as fuck, so whatcha’ gonna’ do, apologize for being a hero?”\nIzuku sets his jaw, “No.”\n“That’s what I thought,” Katsuki mutters. He presses Izuku’s hand to his own side, where a pink gash is long faded and pink. “I got ‘em too, so.”\nIzuku is still learning that he’s allowed to touch. He runs his finger up Katsuki’s side, mentally naming all the individual muscles as he feels across tiny shrapnel scars and the occasional beauty mark. Katsuki makes an encouraging noise, and Izuku tweaks one of his nipples.\n“Hey,” Katsuki snaps.\nIzuku giggles, and then curls up and moans as Katsuki dives to kiss into his shoulder. The shower spray mists them both, and it’s warm in here, but Izuku shudders with a chill when Katsuki chases water droplets with his tongue; into his collarbones, up the side of his neck and over his mouth. Izuku knows he’s getting hard, but there isn’t much he can do about that. Izuku pulls Katsuki close by the hip, and when he bumps into his thigh Izuku knows he isn’t the only one turned on. It makes his stomach roll. \nHands drop to his butt and squeeze again.\n“You have,” Katsuki says, “the best ass I’ve ever seen. It used to piss me off so goddamn bad.”\nIzuku laughs, more steam building in the shower.\n“What? It made you angry?”\n“Spandex, Izuku.”\nIzuku digs his thumb into Katsuki’s thick bicep, right over a complex geometric tattoo.\n“You have no room to lecture me.”\n“I’m fuckin’ not, I’m just sayin’ I wanna’ eat you out.”\nIzuku swallows thickly, and when Katsuki’s heavy erection bumps his hip again, he gasps through his nose, eyes flicking down and up again.\n“Ah. I see.”\nKatsuki nips under his ear, and Izuku licks his lips as water droplets continue to build.\n“What, you got a problem with that?”\n“Er…no. I just –” Izuku shifts. His voice hitches as Katsuki’s hand scratches down his abs and wraps around his cock. “Ah. I was hoping you’d fuck me.”\nKatsuki makes an answering noise that’s so bassy and full of treble, it vibrates through him. Right to his bones.\n“I can multitask.”\nIzuku ends up hauling him to his mouth by the back of his hair, and Katsuki helps scrub them clean until their skin is red and pink.\n“Kacchan, your hearing aids,” Izuku gasps, bent over with his hands against the tile.\nKatsuki takes a big bite into his ass-cheek, and his fingers spread him apart so obscenely that Izuku has to gnaw on his hand. Just knowing Katsuki is kneeled behind him makes Izuku go hot all the way down to the soles of his feet.\n“Waterpoof. And I’m gonna’ fuckin’ hear this no matter what.” He eats Izuku out like it’s a competition, and Izuku’s voice bounces off the bathroom walls. He tries to keep his cock away from the cold tile, but Katsuki shoves him forwards and the contrasting sensation makes Izuku keen.\nBad waste of water, good everything else. \nKatsuki’s tongue flicks and rolls and his teeth are sharp, pulling back to tug at his thighs and nip at his tailbone and Izuku thinks he might astral project.\n“Fuck,” Katsuki curses, and he can’t keep the satisfied purr out of his voice. “Such a good ass. Used to jack my dick raw thinkin’ about this.”\n“About me?” Izuku gasps. The mental picture is overwhelming.\n“No shit.”\nKatsuki is rough with him, like he knows Izuku can take it – and he can. Izuku stays sturdy and holds up his weight, but moans through his teeth as Katsuki tugs on his balls and wiggles his tongue against his ass. It’s a slow torture – and Izuku drops his head to sneak a look at Katsuki kneeled behind him, and besides how obviously good he looks – he’s also still hard and pink and twitching and aghhhh. Izuku’s mouth waters. \n“Kacchan please,” Izuku begs. “Bedroom.”\n“I’ll fuck you as long as you want,” Katsuki huffs. “But this is for me, so shut the fuck up.” Katsuki continues to tease him, and Izuku has to power through the consistent heat and the clenching in his stomach. “Waited too damn long,” Katsuki mumbles.\n“You’ve waited?!” Izuku argues, and Katsuki is very much enjoying this, but Izuku gets no relief from rubbing off the wall, and he whines like a puppy.\n“That’s cute,” Katsuki notes, and bites hard into the back of his thigh. Izuku squeaks. “Fuck these legs. Wanna’ try choking me out?”\n“No,” Izuku cries. “I want you to fuck me.”\n“Oh, I’m loving this. Beg harder, Symbol of Peace.”\n“I hate you,” Izuku gasps, and his toes curl when Katsuki rubs a wet finger against his hole.\n“No lying,” Katsuki scolds, and he’s mindful of the lack of lube, but he does push his finger in a little and lick around it. “You’re the one that made me take anger management to learn patience. This is your fault.” Izuku just flat out groans as Katsuki’s finger slides to the second knuckle, and pulls back. “You’re kinda’ loose. You been fucked lately?”\nIzuku takes satisfaction from the possessiveness in his tone.\n“No. I – uh, nevermind,” Izuku bites off, and his nails dig into the tile grout. Izuku can feel Katsuki grin against his asscheek, and it makes his cock jump and drool.\n“So you’ve got toys. That is interesting.”\n“They’re better than you,” Izuku blurts, and braces himself because he knows what’s coming. Katsuki roughly slaps his ass, then stands, spins him around and bites into his mouth.\n“I guess we’ll see about that.”\n \n \nIzuku spends most of his concentration trying not to break the headboard, but his attention span is split between watching Katsuki move on top of him, and feeling like he’s chalked up full and about to die.\nEven though Izuku’s pain tolerance is ridiculously high, Katsuki is still gentle at first. Izuku can tell he’s experienced with this, but Izuku is resilient, and he digs his fingers into Katsuki’s shoulders and pulls until Katsuki gets with the memo. The only one who can break Izuku is himself.\nKatsuki’s hair is damp from the shower, hanging in his face and getting sticky all over again with sweat, and Izuku feels like he can’t memorize the picture fast enough. The red in Katsuki’s face is rare, and Izuku momentarily sacrifices the insane pace they’ve set just so he can kiss him. The reverent look Katsuki gives him makes Izuku feel like royalty. Until he opens his filthy mouth – and then it just spirals from there.\nKatsuki has stamina and Izuku has the determination to see how far he’ll go, so they roll through four different positions until Izuku’s finished twice and can hardly see straight. He still has the mind to beg Katsuki to come, like he needs it right this very second, and watching someone as prideful and headstrong as Katsuki just shiver apart in his arms – there’s no feeling like it.\nKatsuki is dead weight on his chest, like a firm, heavy blanket, and Izuku takes to petting between his sweaty shoulder blades because it’s one of the rare times that Katsuki has no tension in his body. Just limp and entirely quiet.\nThis will change everything. From the top of their daily routines, all the way down to their hero partnership. Their relationship has a million ways it could go wrong, but Katsuki smells good and fucks like a pro so Izuku is currently overlooking those things.\n“I lost an aid and I can still feel you muttering,” Katsuki mumbles angry and sleepy.\n“You lost your hearing aid?”\n“S’ here somewhere.”\nIzuku feels gently behind Katsuki’s ears, and yeah, the left one is gone.\n“How’d we manage that?”\n“Dunno’. Maybe it was when you grabbed the back of my head like a freakin’ dog.”\n“Ah,” Izuku flushes. “My bad?”\n“Mmm.” Katsuki lifts his head off his chest, and his hair is so wild that Izuku wants to laugh. Katsuki shifts a little more, and Izuku suddenly squeaks. \n“Don’t — ack! Ow ow my dick, Kacchan.” \nKatsuki actually laughs at him, but rolls to his side to spare him. \n“Sensitive?” \n“Yeah, give me like, ten minutes.” \n“Jesus you are insatiable,” Katsuki curses, but he sounds amused. “You know, I was gonna’ be good and just cook you dinner.”\n“You? Good?” Katsuki pinches him and Izuku laughs. “Well, I’m not apologizing.”\n“Me fuckin’ neither, but we gotta’ change your sheets ‘cause this is just gross.”\n“Katsuki.”\n“What?” \n“I love you,” Izuku says. Katsuki stops, and looks him in the eye. He chews through several different emotions, before he decides to squish Izuku’s cheeks in one large hand, giving him a fish face.\n“Love you too. Now where do you keep your spare sheets, dummy?”\n“Uh. Actually, I only have one pair.”\n“I. Hate you.”\n \n \nThe poor hearing aid is lost for thirty-two hours until Izuku finds it wedged behind his headboard. Mei gets after Katsuki about losing them, and makes him an additional three pairs, one of which Izuku nabs to keep at his apartment as a spare.\nIzuku and Katsuki are able to keep up their usual act at the office, but it’s not really much of an act. Nobody blinks when Katsuki launches rubber bands at Izuku’s head and it’s not unusual when Izuku catches them all and shoots them back and when the alarm rings out they’re all on their feet, brain switched into hero mode – and it’s a normal Thursday, as far as crime fighting goes.\nIzuku knows that Eijirou is suspicious. He hangs out with Katsuki the most (other than Izuku), but he’s not the first one to figure it out.\nShouto texts him at two in the morning about craving cookie dough ice cream and hot Cheetos, and Izuku meets him at a grocery store in pajama pants and a Ground Zero sweatshirt.\nThe checkout aisle is full of tabloids with Katsuki and Chiyou on the front, and Izuku doesn’t flinch as he unloads their basket. Shouto picks up one curiously, and looks between the magazine and Izuku.\n“You are…surprisingly okay with this these days. You good?”\n“Huh?” Izuku blinks, thumbing through the cards in his wallet. “Oh, yeah yeah. I’m real happy for him.”\nShouto squints. Izuku swipes his card and helps the clerk bag the rest of their items, and Izuku can feel Shouto glaring holes into the side of his neck –\n“Hold on,” Shouto snaps, reaching over to yank down Izuku’s hood. “Holy shit, you fucked him.”\n“Shouto!”\n“Have a nice day,” the clerk deadpans. Izuku drags Shouto by the sleeve, but he’s dug his heels in and is putting up a fight, and Izuku doesn’t want to be forced into hauling him over his shoulder, but he will.\n“What the hell did I miss?”\n“Can you keep your voice down? It – It could’ve been anyone!”\nShouto squirms his cold little demon fingers in Izuku’s neck, and shoves down his hoodie again. “This is not anybody. You’d go down swinging before you ever let someone give you a hickey.”\n“Alright, you’re going up,” Izuku huffs, and switches his grocery bag to the other hand so he can pick up Shouto in one arm and carry him outside. Shouto goes limp like a cat, and the few 2am shoppers don’t even blink, thank god.\n“How, why, what, where, when,” Shouto deadpans. He inhales through his nose as Izuku hauls him out towards the car. “Oh my god Izuku, you’re a homewrecker.”\n“Ahh! I’m not a homewrecker! Just – please sit down and let me explain.”\nShouto is still stubborn dead weight as Izuku flops him into the passenger seat, and he glares very mean holes into Izuku’s face.\n“Fine. You have until I finish this tub of ice cream.”\n“The whole tub?”\n“Five minutes, max.”\nI had to tell Shouto, Izuku texts the next day. Katsuki replies within a few minutes.\n\n&gt;&gt; u lasted a day longer than I expected \n\n\n \n\n\nOh screw you &lt;&lt; \n\n\n \n\n \n \n \nPartnering with Katsuki is different from anyone else.\nThey’re both hero tanks – meaning they hit heavy and hard, but have to work at minimalizing damage and prioritizing rescue if needed. What Izuku lacks Katsuki has, and he never has to think about what Katsuki’s going to do next – he always just…knows.\nPatrol is quiet today, and they’ve stopped for sandwiches up on an apartment rooftop.\n“Man,” Izuku chews. “Geraldi never does me wrong.”\n“Chew with your damn mouth closed.”\nIzuku swings his legs off the edge of the roof, and watches tiny cars drive below.\n“Are you free tonight?” Izuku asks, trying to be vague. He knows no one is around, but he doesn’t want to take any chances.\nKatsuki shoves his sandwich wrapper in his pocket, and squats next to Izuku on the ledge. The wind makes his hair go wild, making him look handsome and mysterious. \n“Nah. Have to take Chiyou out.”\nAh. Izuku tries not to feel disappointed. There are more important things at work, other than his feelings.\n“I see. Going anywhere fun?”\nKatsuki frowns at him through his mask.\n“No. Free tomorrow, though.”\n“I’ll bring some stuff by.”\nKatsuki doesn’t reply, and Izuku continues to swing his boots over the storm drain. Katsuki is a little stiff, but Izuku just assumes he’s edgy from a quiet day. Izuku can’t hear anything serious buzzing in the police scanners, but he looks up when he sees Katsuki reach to turn his own scanner down.\n“My biggest fear used to be seein’ you jump off the roof,” Katsuki says, so suddenly and out of nowhere, that it chills Izuku to the bone. “Now I watch you do it every day. Who fuckin’ knew.”\nIzuku automatically pulls his legs back from the edge. Falling wouldn’t even hurt him – it’d just break the concrete.\n “You apologized for that a long time ago,” Izuku reminds. Katsuki gets pissy.\n“You don’t think I know that?”\n“I know, I know – sorry.”\nKatsuki frowns, and clicks the tech in his gloves, back and forth and on and off. Izuku opens his mouth to say something else, but the police scanner goes off.\n\n“Ssst – units responding to a bank robbery on Koen and thirty-third. Building collateral is medium.” \n\n“That’s our cue.”\n“I’ve got it,” Katsuki says, standing.\nIzuku frowns, “Huh? Are you sure?”\nKatsuki pops off, palms exploding, “Oi, just ‘cause shits different right now don’t mean I fuckin’ need you to babysit me.”\nIzuku scoffs, “Hey, you know that’s not what I –”\n“I’m still coming for the number one spot,” Katsuki points. “So watch your back.”\nKatsuki takes a flying leap off the building, and Izuku sighs as he hops across the skyline. He shrugs the altercation off as a side effect of this weird mood Katsuki is in. Izuku didn’t expect their working relationship to change, but… nah, nevermind.\nIzuku listens in on the scanners just to make sure everything goes okay. Katsuki handles it, as expected.\n \n \nTruthfully, Izuku didn’t plan on spending the night at Katsuki’s apartment.\nHe came over to discuss work in a more alcohol-friendly environment, but Chiyou had already left for her super-secret night job, and Izuku might’ve accidentally ‘fallen’ on his knees for an hour, and then passed out in Katsuki’s bed.\nKatsuki keeps a tight ship in his room. Big bed, semi-organized closet, a neat work desk. Clothes on the floor are usually a no-go, but they were kinda’ careless last night, and the room smells like, well, them. \nKatsuki is like an entirely different person right now. Usually he sleeps with one eye open, thanks to some PTSD, and partial paranoia due to his hearing disability; but it’s well past eight in the morning, and Katsuki is completely conked out in his arms.\nA very teeny tiny part of Izuku’s ego hopes it’s because Katsuki feels safe right now.\nNormally Katsuki would stir at the slightest movement, but Izuku is able to shift a little closer, spooning him from behind. They technically don’t have to work today if they don’t want to, but both Katsuki and Izuku tend to come in on their off days. Izuku will have to ask what Katsuki wants to do.\nIt’s definitely been a while since Izuku has just lay in bed. Katsuki’s chest rises and falls with each slow, steady breath, and it might be a little creepy, but watching him makes Izuku feel at peace. He’s kinda’ jetpacking Katsuki right now, so he presses his nose under Katsuki’s armpit and breathes in, and that’s what wakes him up.\n“Can you stop being weird for five minutes?” Katsuki mutters sleepily.\nIzuku waits until Katsuki has rolled in his arms so he can read Izuku’s lips.\n“You smell good.” Musky, kinda’ sweaty, but sweet at the same time. Very many, as Eijirou would say. Mhmm.\nKatsuki rolls his eyes and seatbelts Izuku in with his own arm.\n“Perv.”\n “Hey, I was having a fun time as the big spoon.” Katsuki doesn’t respond. Izuku harumphs and pokes his shoulder. “Hey. Hey. I know you can hear me a little bit.”\n“I’m ignoring you,” Katsuki mumbles, and it already sounds like he’s going back to sleep.\n“Hm. Didn’t know two rounds would tire you out so bad, Kacchan.”\nKatsuki pinches his butt, so Izuku knows he heard at least part of that.\n“You goin’ in today?”\n“I was going to ask you that,” Izuku says. Katsuki leans back to look at him, and Izuku repeats himself and signs sloppily with one hand.\n“Haven’t decided yet.”\n\n“Me neither. You want coffee?”\n\n“Mmm, fuck yeah.”\nIzuku starts to untangle himself, and Katsuki reluctantly lets go, grabbing the pillow and flopping back over. Izuku tries to find his shirt from yesterday, but it disappeared out of thin air, and all he can find is Katsuki’s Led Zepplin shirt.\nIzuku throws it on over his boxers and fluffs out his hair as he steps out into the hall. To his own horror, the kitchen already smells like coffee.\n“Well this is ironic,” Chiyou laughs.\nKatsuki made it very clear that Chiyou had been living in what used to be the room of his home gym. He shoved most of the equipment into a storage unit when she moved in. It had completely slipped Izuku’s mind that she would be home by this time.\n“Uh. I’m sorry,” Izuku blinks.\nChiyou laughs, spinning in the barstool, “For what? He’s your man.” Izuku approaches the counter, and Chiyou points to the pot. “Coffee?”\n“Yes please.”\n“I’m very lucky that you’re such a sweet person,” Chiyou smiles. “I think anyone else would’ve murdered me by now.”\n“For what? Doing your job?”\n“Not anymore,” Chiyou sips. “Case is done. I’m moving out tonight.”\nIzuku stops pouring his cup, and spins around quickly.\n“Wait, really?”\n“Yep. Katsuki should get called in by the commission soon. They’ll debrief him and fudge some breakup story to the news.”\n“Oh wow,” Izuku stares. “That’s…congratulations. I hope it all went well?”\n“Took a little longer than I would’ve liked, but I got what I needed. I’ll be given a new identity and reassigned soon.”\n“That makes me kind of sad,” Izuku laughs, and rubs the back of his fuzzy hair. “You probably can’t stay in touch.”\n“Not really, no.”\n“Well. If you’re ever in trouble, give us a call.”\nChiyou’s eyes widen, and her snakelike smile actually smooths out into a real one.\n“Thanks. You’re a good person, Midoriya.”\n“But slow with the fuckin’ coffee,” Katsuki grunts, pushing in his other hearing aid and scratching at his bare chest.\n“Did you catch all that?”\n“Mm. Got the call, thank god.”\n“Learn some manners, or this nice man is going to leave your ass for someone better,” Chiyou points.\n“Can it, hag. I don’t need any relationship advice from you.”\n“And what the hell is that supposed to mean?”\nIzuku passes Katsuki a coffee cup and smiles, “Is this what the last six months have been like?”\nA combined, “Yes.”\n“Oh jeez.”\n \n \nThey try to lay low after the public breakup. Katsuki is rushed by reporters for a few days, but he’s very transparent about his distaste for paparazzi, and after a few instances in the past – they’ve learned not to shove mics in his face.\nDating in secret isn’t all that hard, because they’re frequently seen in public together anyways. Still, Izuku knows he has some bases to cover, just in case.\nTelling his mom is probably the hardest part – but Izuku knows if she finds out from some rando news station and not Izuku himself, he’ll never live it down. He might even be written out of his mom’s will. Disowned at the least, but definitely guilt tripped for the rest of his life.\nBut his mom likes Katsuki, because while Katsuki may be a major pain in the butt, he’s always treated Izuku’s mother with respect.\nHis mom’s place smells like home. Like whatever candles she burns and the mixture of cleaning products she uses; it’s very nostalgic, and Izuku squeezes his mom in a hug as soon as she opens the door.\n“This is such a nice surprise!” Inko smiles.\n“Hey auntie,” Katsuki greets, toeing off his shoes. “I brought the casserole you were buggin’ me about last time.”\nInko tuts around happily, taking the dish from his hands and giving him a hug.\n“You didn’t have to do that, sweetie! Oh my – it smells so good. I’ll go put it in the oven to keep it warm!”\n“Good idea,” Izuku whispers, untying his shoes. “Lessen the blow with food. I should’ve thought of that.”\n“Yeah, ‘cause I’m a fuckin’ genius,” Katsuki half-whispers back. “It’s my mom’s recipe.”\n“Sweet. We might just make it out of here without drowning.”\n“No, because you cry the second your mom starts cryin’.”\n“Oh shut up.” It’s true, and it happens exactly as Katsuki says, but still. The blessing from his mom is worth it.\n“What about your mom?” Izuku asks later, as he’s still wiping his eyes with the collar of his t-shirt. “We should stop by and see your parents soon.”\n“I don’t give a fuuuck what that hag has to say about any of this.”\n“You are such a terrible son. I’m going to call her.”\n“She won’t give a shit. I didn’t even tell her about Chiyou.”\n“Kacchan!”\n“What?! She watches the news!” \n                                                                    \n \nShouto has no plans this weekend, so he texts around to see who’s available. He’s not one for throwing big house parties, so it’s a chance to sit around and catch up with some friends.\nIzuku, Ochaco and Eijirou decided they wanted to make brownies, so they’re currently in the kitchen trying to drunkenly throw together something based on whatever Shouto has in his cabinets. Tsuyu and Tokoyami got caught up in the movie, and Shouto has been sharing a blunt with Katsuki for the past twenty minutes.\nHe really wasn’t expecting Katsuki to show up at his door – but he assumes Izuku had a little something to do with that.\nKatsuki holds out his hand and Shouto puffs one more time before passing it over.\nShouto has a strange love-hate relationship with Katsuki. They’ve been friends for going on ten years now (Katsuki will argue that number), and they’ve dragged each other out of hell and back, but will still argue over the weather.\nSomeone shouts, and Shouto registers a shattering sound in the kitchen. Eijirou is going shhh shhh!! and Izuku and Ochaco are giggling ridiculously.\n Katsuki raises an eyebrow at him, “You gonna’ go check that?”\n“I don’t really want to know,” Shouto says. Katsuki snorts. They’re down to the last of the blunt where it starts to burn, and when Katsuki passes it back, Shouto gets one last pull before he coughs and snubs out the bud.\nIzuku comes out of the kitchen and whistles as he crosses towards the hall closet.\n“And where are you going?” Katsuki asks.\n“Nowhere!” Izuku smiles, kicking open the closet, grabbing a broom and hiding it poorly behind his back. “Just uh, taking a stroll. I’mdonenowbye,” Izuku dips back around the hall, and more shushed laughter comes out of the kitchen.\nShouto doesn’t miss the way Katsuki’s eyes fondly track Izuku, before shrinking back into a scowl as he crosses one ankle over his knee.\n“Whataya’ think they broke?”\n“It was probably the flour jar. Wasn’t that expensive, it’s fine.”\nShouto looks to the two on the floor, who are so consumed in the movie that they’ve hardly budged. Hmm. This is probably the best opportunity Shouto is going to have, and he needs to get some stuff off his chest.\n“Katsuki.”\n“Hm.”\n“Can we talk?”\n“We’re talkin’ now.”\nShouto looks at him, and Katsuki stares back. He rolls his eyes as if to say fuckin’ really, and Shouto glares back a yes really, and Katsuki sighs as he stands.\nShouto leads him out to the balcony. He lives up in a high rise, and the noise of the condo shuts off completely as Shouto closes the sliding door.\n“The fucks your problem?” Katsuki asks, leaning up against the rail.\nShouto leans against the opposite side, and stares him down. It’s a habit of a hero to immediately analyze the wellbeing of everyone you meet. Are their hands shaking, have they gone into shock, are they eating well, do they look sick?\nKatsuki just looks annoyed – but less grouchy and more tired.\n“So, you’ve broken up with your beloved girlfriend.”\nNow, Katsuki gets grouchy.\n“Oi, don’t go bringin’ that up, Halfie. I know Izuku already told you what was going on.”\n“I’m definitely going to bring it up,” Shouto says, crossing his arms. “Are you going to tell people about your relationship?”\n“Well that’s none of your goddamn business, now isn’t it?”\n“That’s fine. Izuku will tell me.”\n“Then why the fuck am I out here?”\nOkay. Shouto will just say it, then.\n“Izuku has cared about you for a long time,” Shouto says, and it’s like he’s pulled a string on Katsuki’s spine, straightening him up by the shoulders. “Every time you hurt him, I’m the one who picks up the pieces.” God knows Izuku has done it enough for him in return, but that’s for another day. “I know you guys are going to fight. Izuku doesn’t need me to protect him. But as a friend, I just ask that you try to keep his heart in one piece.”\nKatsuki’s eyes widen. Once upon a time, Shouto would’ve braced himself for the storm of a lifetime. Shouting, death threats, a variety of explosions; the Bakugou kind. But Katsuki just grinds his teeth, looks off over the balcony, and replies in an even, raspy tone.\n“I ain’t gonna’. So you don’t have to shovel talk me.”\nA breeze cuts through the balcony, and Shouto’s hair ruffles up and around his face.\n“Do you know what happened at prom night?”\nKatsuki’s eyes snap back to him.\n“Eh?”\nThat’s a no. Understandable. Their third year feels like a lifetime ago.\n“Izuku told me he tried to confess to you three times,” Shouto explains. “He eventually found you making out with Eijirou in the parking lot.”\nKatsuki quickly looks away. He puffs his cheeks up with air, and blows it out between his lips in exasperation.\n“Well. Shit.”\n“Yeah.”\n“We were drunk,” Katsuki rubs the top of his hair. “I didn’t even know…fuck, fuck me.”\n“I don’t mean to bring up old shit,” Shouto says. “Izuku forgives and forgets like no one I’ve ever met. I know he dated other people, but I also know you’re his endgame. You’re it for him. So no pressure, but don’t screw this up.”\nKatsuki sighs, tightening and then loosening his grip on the rail.\n“He’s the only one I’ve ever –”\n“Kacchan!”\nThe sliding door opens and shuts, and Izuku bounces right into his arms.\n“There you are! Kacchan you have to come taste the batter because I know your brownie standards are high and –”\n“Woah woah woah,” Katsuki cuts off, and snatches Izuku by the chin. “What the fuck happened here?”\nShouto is only able to catch the corner of a forming black eye, but Izuku is wine bubbly and squirming too much to really see. Katsuki forces him still, yanking his head this way and that to study his eye.\n“Oh, well – we were trying to mix the batter and Eijirou’s hand slipped and his elbow – well, that’s not important. Come on, please!”\n“Not important my ass, I’m gonna’ kill him,” Katsuki decides.\n“No, wait! It was just an accident!”\nKatsuki throws open the sliding door and shouts, “Hey, fucker! Ei!” \nA door slams further in the condo.\n“Eep! Quick, hide me!”\n“Frog face, where did he go?!”\n“Eh, ribbit. Didn’t see.”\n“But Kacchan, the brownie batter!”\nIzuku quietly shuts the door behind him, and Shouto watches as all the noise cuts off with a single click. Shouto can see Katsuki stomp further into the house, and Shouto will be very unsurprised if their entire friend group knows about their relationship by tomorrow.\nThey’ll be fine.\n \n \nIzuku has become comfortable up here. \nHe can jump for miles with the use of his quirk, and Izuku sees everything as he flies between buildings.\n“Deku and Cellophane moving down thirteenth,” Izuku says into his earpiece. “Looks like we have about a dozen on this block.”\n\n“Rodger that!” \n\n\n“Team three checking in, we’ve got six villains on tenth and main, currently intercepting.” \n\n“Got it.”\nTape shoots past him, and Izuku tries to be cautious of where Sero is flying as he intercepts villains along the rooftops. Izuku can smell burnt rubber, which tells him there’s a fire somewhere. He knows it’s being handled from the chatter in his ear.\nKatsuki’s gravelly voice draws his attention.\n\n“Fuck! More keep pourin’ out of the fuckin’ woodworks.” \n\n\n“How many more?” \n\n“Seven. They’re freakin dopers.” Katsuki huffs louder into the coms. “Babe!” \n“What?” Izuku snaps, in an im kind of busy tone.\n\n“Don’t give me that attitude! Come meet me at the temple and help me block their path into downtown.” \n\nThat’s actually not a bad idea.\n“Fine,” Izuku says. “Two minutes ETA.”\nA deathly silence falls over the coms. It takes a moment too long for Izuku to realize what’s happened.\n\n“Babe?!! BABE??” \n\n\n“Holy shit are you serious?” \n\n\n“I KNEW IT!” \n\n\n“No way – since when??” \n\n\n“Wait -ssst- you guys didn’t know?” \n\n“YA’LL ARE SO FUCKING LOUD!” Katsuki shouts, and Izuku can hear explosions as he starts jumping south. The chatter in his ear is starting to give him a headache, and someone (that sounds very much like Denki) begins to sing a nursery rhyme about kissing in trees, and Izuku’s eye twitches.\n“Guys, focus up!”\nAn immediate response;\n\n“Yes sir!”\n\n \n \n \n \nThe sound of an electric razor has become a comforting sound. Mostly because Izuku knows he gets to sit between Katsuki’s knees and zone out to the feeling of fingers in his hair.\n“You’re like a dog,” Katsuki says. With Izuku’s undercut fully trimmed, he clicks off the razor and sets it on the bathroom countertop. Izuku hums from the floor, and his head lulls as Katsuki scratches his short nails against his scalp.\n“I think the same thing about you, sometimes.”\n“Eh??”\n“Uh, you know. Forget I said that.”\nKatsuki tugs on the top of his hair, urging Izuku to turn and look at him, so Izuku twists around and plops his cheek on his thigh.\n“You staying the night?” Katsuki asks.\n“Mmm, I can. But I’ll need to borrow your laptop to send a couple emails.”\n“Tch.” Katsuki pets across his forehead, and Izuku briefly closes his eyes. The tattoos on Katsuki’s left arm paint down over his hand and up to his knuckles, and his most recent meltdown was because a case of bad road rash messed up some of the art on that arm. “Wanna’ go out this weekend?”\nIzuku looks up at him and smiles, “Ooh, like on a date?”\n“No, to the fuckin’ moon. What do you think?”\n“Dinner wouldn’t be too suspicious, right?”\n“I don’t give a shit.”\n“I’m down. Do you think you’d be able to come with me to get my ears pierced?” \nKatsuki raises his eyebrows.\n“You want piercings?”\n“Just a couple.”\nThey’re usually a big no-no as a hero, because they’re prone to get ripped out so easily, but Katsuki has kept some small spikey plugs in his ears for about a year and a half, so Izuku thinks he could get away with a few rings.\n“Yeah, I’ll go. I need my artist to touch up this stupid arm, anyways.”\n“Yay.” Izuku noses into Katsuki’s inner thigh, and sighs. “Getting needles in your skin is so romantic.”\n“That’s what I’ve been sayin’.”\n Izuku is relieved that Katsuki is in a good mood tonight, so he gets away with dragging him to the bathroom floor, and eventually the bathtub.\n \n \nIt’s all over social media the next day.\n\nHero Deku Sprouts New Jewelry! \n\n“Don’t they have anything better to write about?” Izuku scoffs, using the magazine as a coaster for this coffee. Ochaco laughs at him.\n“Nope!”\nNot everyone is on shift today – but the firm is fuller than usual.  Katsuki’s office door opens and slams shut, and the commotion naturally dies down out of curiosity.\n“He lives!” Sero jokes.\nKatsuki crosses his arms and ignores him.\n“Deku. The commission is on hold.”\n“Ah, okay.”\nIzuku starts to stand, and Denki leans back in his chair and snickers.\n“Riiiight, the commission, sure. I bet they’re gonna’ turn on that little noise canceller.”\n“I’ve always wanted to try office sex.” \n “Do you want to die?” Katsuki asks calmly. Sero and Denki mime zipping their lips shut, and Katsuki makes a loud show of turning the noise canceller on, and their team’s laughter is shut out by the door slamming.\nKatsuki’s office is a little messier than usual, but that’s from the sudden influx of work lately. He’s already shut the privacy blinds, and the overhead lights feel especially headache-inducing right now.\n“Ah,” Izuku sees the phone off the receiver. “There really is a call.”\n“Those morons are infecting your brain,” Katsuki huffs. “You need to use your own damn office.”\n“I like it out there. It’s fun.”\n“Whatever.” Katsuki stomps around his desk and slams his finger on the hold button. “Pres, we’re both here. Be fast ‘cause we’ve got shit to do.”\nIzuku flinches, but greets humbly, “Hello President.”\n\n“Good evening, Deku. I’ve spoken with Ground Zero about these matters, but I wanted to let you know that I’ll be borrowing part of you team for an out of town assignment.” \n\n“Oh,” Izuku frowns, and sits in Katsuki’s chair. “For how long?”\n\n“Three days, at the most. The Mune headquarters were discovered, and the commission is planning a preemptive strike before they attack our city again.” \n\nHmmm. That’s very convenient. Izuku has a feeling that it has something to do with a certain blue-haired woman. He gives Katsuki a look, and it’s obvious that Katsuki has the same hunch too.\n“Alright,” Izuku says. “Who are you taking?”\n\n“Ground Zero will be leading the A team. We will be requesting Red Riot and Tsukuyomi for the B team.” \n\nIzuku’s heart wrings like a towel. Katsuki is going?\nHe’s leaning up against the wall, arms crossed with his work face on, and Izuku suddenly feels a swell of anxiety. This villain clan has been causing problems all year – there’s no telling what kind of war this might break out into.\n“I want to go,” Izuku says firmly. Katsuki’s eyes widen.\n“Are you serious?”\n“This is a major hit – it could be dangerous.”  \n“And you don’t think I can fuckin’ handle it? Just ‘cause you’re the big ole’ number one?!” Katsuki fumes, and that’s not at all what Izuku is trying to say, but –\nThe president cuts in.\n\n“That’s a negative. We need the Symbol of Peace to remain in the city if possible. To have both halves of the Wonder Duo gone would be asking for trouble. They might have forces in hiding.” \n\nIt’s a valid point, but Izuku can’t ignore the pit in his stomach.\n“President, please –”\n\n“Thank you for your understanding. We will invite you to the debrief afterwards.” \n\nIzuku doesn’t even get a chance to say goodbye. Katsuki slams the phone on the receiver and shouts.\n“What the fuck was that?!”\nIzuku stands his ground, “I don’t like this, Kacchan.”\n“I don’t give a shit. You’re not going, end of story.”\n“But –”\n“I’m not weak,” Katsuki pokes him in the chest. “So don’t worry about me like I’m beneath you.”\nIzuku fumes, growing angry with his anxiety. “You know I’m going to worry no matter what!”\n“Dating you doesn’t change who I am,” Katsuki grits. “So don’t get in my way.”\nIzuku can see how on edge Katsuki is – and he knows there’s something more going on here, but Izuku is upset, and his words aren’t coming out the way he wants them to.\n“I’m not in your way, I’m your partner! I should be there!”\n“You’re a hero, so sit your ass down and do what you need to do. I’m not your fuckin’ priority, this damn city is.”\nKatsuki obviously isn’t going to budge on this, so Izuku decides to cut his losses.\n“Fine,” he huffs. Izuku stands up, and Katsuki grabs him by the wrist.\n“Izuku.” The rough, gritty tone stops him cold, and Izuku turns to look him in the eye. Katsuki squeezes hard, like he’s trying to mold his fingers into Izuku’s skin. “Let me do this.”\nIzuku gets it, suddenly. He’s not happy about it, but he gets it. He folds his hand over Katsuki’s to let him know they’re okay.\n“Do what you have to,” Izuku says. “But relationship or not, I’ve never played games when it comes to you – and if something happens, I will be there, so you can just get over it.”\nKatsuki scowls, but lets Izuku go.\n \n \nPatrol is fine. Izuku keeps his nose out of Katsuki’s assignment, even if it’s killing him inside. He’d be the first to know if something happened to Katsuki, but that doesn’t make him feel better.\nAfter some self-reflecting, Izuku has decided that he needs to apologize. While Katsuki’s claims about coddling him weren’t true – they weren’t uh, a thousand percent wrong either.\nIzuku can’t help it. He wants to save people – and this new thing, this – whatever it is – between he and Katsuki. Izuku is so afraid to lose it that he’s beside himself.\nBut Katsuki was right. He’s one of the strongest – no. Probably the strongest person Izuku knows. It would be insulting to assume he can’t handle this (even if Izuku’s concerns mean well).\nIt’s the same old argument, round and round again. Izuku knows it’ll be him on the chopping block the next time he’s in the hospital. Nothing has changed.  \nBoth Katsuki and Izuku are wild and untamable. Maybe – that’s what makes them so good together, like two opposite ends of a magnet.\nIzuku tries to do normal things, like housework and laundry, without getting too deep into his head; but when he finds one of Katsuki’s shirts lodged in the back of his dryer, he presses it to his face and sighs.\n \n \n \n \n Most people don’t realize much time it takes to wind down off a long hero shift.\n You have to peel yourself out of the uniform, scrub off all the dirt and the dust and the blacktop caked in your skin, figure out what blood is yours and what isn’t, patch up anything that might get infected and then putting on clothes after that, while your skin is still all raw and sensitive; it kind of sucks.\nIt’s hard to just turn off all that adrenaline sometimes. It’ll keep you up all night, if you don’t know how to put it to good use.\n \nWhen Katsuki comes back, Izuku takes one look at him and already knows.\n \nHe didn’t ask to come over, didn’t give any heads up, no knock or anything. Izuku just heard the spare key, and was already making space on the couch.\n“You made it.”\n“What? You thought a couple of low-level assholes could kill me?!”  \nKatsuki looks tired. Bandages are slapped down the side of his neck, and he must have caught an injury on his elbow, because bandage tape is there too. All things considered, it looks like he made it out okay. Izuku has definitely seen this man in worse conditions (way, way worse).\nIt was only three days, but god, just seeing him makes Izuku’s heart jerk.\n“Come here,” Izuku holds up his arms.\nKatsuki grumbles something, before kicking off his boots roughly by the door, unloading his pockets at the counter and stomping his way over. Despite the tough-guy act, he flops right onto Izuku like a weighted blanket. Izuku grunts a little, and adjusts so Katsuki isn’t half off the couch.\n“There we go,” Izuku squeezes his arms tight around his middle. “I missed you.”\n“Don’t treat me like a baby,” Katsuki hisses, but hugs him back. Izuku is so relieved, he can’t even begin to express it – but he knows he needs to stay calm to keep the peace.\n“Everything go okay?”\n“Ain’t nothin’ we couldn’t handle.” Katsuki swallows, and rolls his forehead along Izuku’s shoulder. “Long fight. Lost a couple civilians.”\nIzuku knows it from the tension in Katsuki’s shoulders. Izuku presses into a knot in his back, and Katsuki grunts.\n“You’re not going into work tomorrow. I’m taking you off the call list.”\n“The fuck I’m not.”\n“Katsuki, I’m not going to argue on this.”\nKatsuki huffs, and switches their positions on the couch, and Izuku decides to allow this. He crawls up in his lap, and Katsuki hugs him back to his chest.  \n“Missed you too,” he mumbles, so slurred that Izuku almost misses it. He tucks Katsuki’s head under his chin, and pets over the bruises on his neck.\nIt’s hard to believe that they’ve been dating for a month. The time passed feels both short and long, but it also feels like they’ve accomplished something. Like they’ve made it this far, so maybe – they can make this work.\nIzuku realized that this is what they were missing. They had the friendship, the fighting, the history, the lifelong hero partnership down stat. Except now, Izuku can squeeze Katsuki like a momma cat, and their added intimacy has filled in all the cracks of his life.\nExcept, the tension in Katsuki’s shoulders won’t go away.\nIzuku kisses the top of his hair, and it smells like conditioner. He turns his head to catch Katsuki’s temple, then the tip of his ear.\n“Don’t,” Katsuki grumbles.\n“Don’t what?”\n“Be cute right now. I’m pissy and I’ll probably say something I don’t mean.”\nWell, fair warning then. Izuku nudges his face with his nose, and pecks his cheek, then down to his jaw. Katsuki sighs heavily like Izuku is twisting his arm, but he’s halfway there when Izuku moves to kiss him fully.\nThey make out for a long time – or, enough for the TV to go idle. He knows Katsuki isn’t down for a hard fuck – but that’s more than fine. Izuku just wants him to stop holding so much stress inside his body.\nKatsuki eventually breaks the kiss to nose and bite lightly into Izuku’s neck, and Izuku breathes out through his nose.\n“Are you okay?”\n“Fuckin’ peachy.”\n“I don’t think you are.”\n“Well aren’t you the next Doctor Phil,” Katsuki snaps, but his mouth is kind when he pulls aside Izuku’s shirt collar and sucks into his shoulder. Izuku hums, and fiddles lightly with the edge of Katsuki’s bandage. He waits long enough, and Katsuki eventually gives in, exhaling loud and dropping his hands to Izuku’s waist. “Fine. Fine. You were right, okay?”\nIzuku blinks owlishly.\n“Right about what? I mean, of course I was, but –”\n“Oh shut up. About the raid on that HQ. I fucking wanted you there.”\nAh. Izuku’s heart flutters around, and he smooths his hands over Katsuki’s wide shoulders.\n“You did?”\n“Of course I did,” Katsuki scowls. His hand raises to thumb over one of Izuku’s earrings, twisting the stud in the back. “We’re a team. I just felt like – with all the changes between us...”\n“You needed to do it alone,” Izuku finishes. “I know. I shouldn’t have fought you on it in the first place.”\n“Nah. You shoulda’ been there with me,” Katsuki swallows, and Izuku’s eyes naturally drop to the bob of his throat. “Then I don’t feel like I always gotta’ be watchin’ my own back.”\nThe certainty of that statement makes Izuku go warm all over. He can’t hide a smile anymore, so he presses it into Katsuki’s mouth, and lets him lick over the seam of his lips. He loves the intimacy of it. \n“I think we’re better together.”\nKatsuki doesn’t reply, but a hand grips at the outside of his thigh, and it makes the muscles in his leg twitch – and Izuku’s mind drifts as he gets lost in Katsuki’s mouth again. The way Katsuki holds him is enough to get Izuku going – especially when his hands get rough and needy.\nThe zippers on their jeans grind and click as Izuku shifts, and the rigid heat of Katsuki’s erection is sexy. Izuku pulls back and wets his top lip, his eyes jerking down.\n“Can I…”\nKatsuki inhales, and Izuku can hear the smirk in his voice.\n“You wanna’ suck my cock?”\nFuck.\n“Yeah,” Izuku croaks.\n“I ain’t gonna’ stop you.”\nIzuku is on his knees very quickly. Katsuki watches him lazily; he doesn’t help Izuku with his belt or his pants, probably because he knows Izuku is strong enough to wiggle an arm under him and yank his jeans down to his thighs.\nKatsuki’s erection is too heavy to stand completely upright, and the size of him is intimidating, but exciting like usual. Izuku has learned a lot about himself since they’ve started dating. Honestly, the oral fixation should not have been a surprise, but here we are.\nHow nice is it that Izuku buries his head between Katsuki’s thighs and just stays there, licking and sucking and wiggling his tongue around until his cock is wet and red. Izuku wants to get infinitely closer, wants to seal this bond in blood. It takes effort to get Katsuki to make noise, and Izuku’s stomach flips when he gets his first gritted sound.\n“Fuck yeah,” Katsuki rasps. “That’s good baby, that’s good. Look up at me – nngh.”\nIf Izuku had feathers, they would’ve ruffled up and stood on end. Instead Izuku shakes, like an earthquake vibrating out of his chest. The burn in his jaw is good, the salty taste is good, the weight of Katsuki’s gaze is good good good, it’s all so freaking good. \nKatsuki pets over his jaw, and his thumb rests where Izuku’s lips are stretched, slowly bobbing up and down.\n“Damn. C’mon gorgeous, you can take more – so fuckin’ pretty, slobbering all over cock, baby – slow down, it’s okay.”\nThe tip of Katsuki’s thumb slips into his mouth, and it hurts just long enough for Izuku to stutter and swallow, and Katsuki’s answering groan is like porn. His hand pulls away to pet at his bangs, and Izuku sacrifices a sore throat tomorrow for the satisfactory feeling of pressing his nose to Katsuki’s navel and breathing in. His happy trail scratches his nose and Katsuki chokes, and Izuku quickly pulls back to create a rhythm again.\n“Fuck Izuku, what the hell. You tryna’ make me bust already?”\nIzuku pulls back slickly to sigh, “Yeah,” and then sucks repeatedly at the head because he knows it drives Katsuki crazy. “Please, Katsuki.”\nKatsuki momentarily squeezes his eyes shut, like he’s testing his patience. He mumbles, “Too damn tired for this,” and his knees spread wider as Izuku keeps up the pace. “Babe.”\n“Mmm.”\nHe’s not sure how much time passes, but the sun is already starting to set outside. Light catches in his eyes through the window blinds, and Izuku has to blink repeatedly to see straight. Katsuki’s stare is wild and intense, and he follows the streaks of light across Izuku’s face with his thumb. Izuku is so positively hard, he’s starting to think he might pop the button on his jeans through sheer force.\n“You’re killin’ me,” Katsuki huffs. The need in his voice is hot. “Where do you want it?”\nIzuku moans, and it’s really not even cute, it’s just pathetic and kinda’ slutty (aaaah). He pulls back just enough so that he’s chalking the tight, round head against his tongue, and slurs, “Right here, baby.” \nKatsuki’s voice goes tight, and Izuku pumps him in his hand. His face fills with heat when Katsuki gets harder, his thighs tensing, his hand gripping hard into Izuku’s shoulder – and then his cock twitches and he spasms hot in his mouth, and Izuku keens contently. It catches his upper lip and part of his cheek, and Izuku closes his eyes on reflex, but doesn’t stop moving his hand, and Katsuki makes a punted, wheezy sound.\n“Fuck – oh my god.” \nKatsuki curses furiously under his breath, and when his head knocks back against the couch, Izuku sucks him down one more time to wipe him clean, before pulling off and swallowing. \n“Mmm. That was a lot, Kacchan.”\n“Fuck off,” Katsuki exhales. He looks down at Izuku again, and the sharp, aroused look on his face makes Izuku’s insides clench. “Wow, look at you. Good boy.”\nIzuku’s breath catches. Katsuki wipes the mess off Izuku’s cheek and forces it into his mouth, and Izuku licks circles around his fingers. The taste is tolerable, and Izuku keeps Katsuki’s fingers in his mouth because he’s still horny as hell.\n\n“Mmhn.” \n\n“Needed that,” Katsuki says. “Whataya’ want, baby? You’ve earned it.”\nKatsuki’s foot presses between his legs, and Izuku arches up into him, gasping outwardly – and Katsuki pets right into his mouth.\n“Mm, you’re a little perv, aren’t you?” Katsuki toes harder, Izuku squirms more, shudders harder, and Katsuki pets the inside of his cheek softly. “God I love you – I love you, Izuku. Puttin’ up with all my shit – I’ll burn down the world for you. What do you want? Tell me.”\nHe pulls his fingers out of his mouth, and Izuku sucks in air, his eyes burning.\n“Just you – please,” Izuku begs. “It’s all I’ve ever wanted – ”and Katsuki pulls him up, rolls him into the couch and licks into his mouth until Izuku is suffocating on his own spit.\n“Can you come like this?” Katsuki asks roughly, and he’s got his knee between Izuku’s legs, his pants pulled up but his zipper still open. “Izuku. Look at me. Can you ride my thigh?”\n“Shit. Yeah – yeah.” He can.\nKatsuki curses and praises and Izuku digs his fingers into Katsuki’s neck and forgets all about his bruises. He selfishly chases his orgasm and Katsuki helps him through it, and for a moment they’re normal. For a moment, they’re two lovers kissing on a couch, without the weight of the world on their shoulders.\nIzuku thinks, one day, when he’s walking off the edge of insanity, he knows Katsuki will be the one to bring him back. People that only see loud and mean just don’t get it – like when they see Izuku and think timid and shy. \n\n \n\n \nSurfaces. They’re only surfaces.\n \n \n“Do that one more time and you’re gonna’ lose a finger,” Katsuki warns. Izuku giggles from the passenger seat, and dares to steal another fry out of Katsuki’s bag.\n“Oops.”\n“Oh my fucking – you said you wanted no fries, so you got no fuckin’ fries. Don’t act all brand new.”\n“I just want a couple.”\n“Well I ain’t sharing.”\nIzuku steals another fry, because Katsuki is full of empty threats. He huffs and puffs but says nothing, folding his leg up in the car seat and pouting.\nThe parking lot is empty, and they let the car idle as they eat, because Izuku was hungry but not in the mood to get recognized. Katsuki steals a fat sip out of Izuku’s milkshake, so they’re even.\n“I’m going to break out because of this,” Katsuki scowls.\n“Junk food is good for you every once in a while. It hardens you up. Keeps your body on its toes.”\n“That’s the biggest load of horseshit I’ve ever heard.”\n“Yeah,” Izuku giggles. “But it sounded pretty legit, right?”\n“No.”\nIzuku hums along to the song playing on the radio, and bops his head back against the seat.\n“Will you hold my hand?”\n“Why are you so goddamn needy tonight?” Katsuki glares – but takes his hand anyways.\n“Because I want to be,” Izuku preens. Katsuki makes a skeptical sound. Izuku blinks his eyelashes at him, and Katsuki leans over the console to kiss him.\n“Stop bein’ pretty.”\nIzuku flushes, and happily kisses him back before saying, “I’ll try my best.”\n“You’re such a smartass. Nobody ever believes me.”\n\nClick! \n\nThey startle as the car lights up in a flash. Izuku takes a moment too long to process it as a camera.\n“Oh hell no!” Katsuki shouts, throwing open the car door. “Oi, perv! Get back here, asshole –”\n“Calm down,” Izuku calls, leaning across the center to pull at his wrist. “It’s not worth it.”\nKatsuki lets out an annoyed argh! and slaps the stirring wheel after slamming the door shut. \n“Fucking creep. I’ll kill ‘em.”\n“Well, that picture is going to be everywhere tomorrow,” Izuku sighs. “Sorry.”\n“Not your fault,” Katsuki mutters, slowly cooling down. “Dammit.”\nIzuku offers a pressed smile, and finds his hand again to squeeze it.\n“Your poor fangirls. They’re going to have a meltdown.”\n“Huh?? Why?”\n“Because the man of their dreams is now taken again,” Izuku teases. “How will they ever marry you now?”\nKatsuki deeply rolls his eyes, and threads his fingers between Izuku’s.\n“M’ only gonna marry one person.”\n“Oh…really? Who?”\n“You’re a moron.”\n \n \n \n \n \nThe internet explodes, but the world doesn’t end. How about that.\n \nUh, they do crash several social media platforms when they get engaged, but that’s for another time.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n "
}