{
    "id": "25824787",
    "url": "https://archiveofourown.org/works/25824787?view_full_work=true",
    "author": [
        "cloudydaisies"
    ],
    "title": "the distance to the stars",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "9-1-1 (TV)"
    ],
    "relationships": [
        "Evan \"Buck\" Buckley/Eddie Diaz (9-1-1 TV)"
    ],
    "characters": [
        "Eddie Diaz (9-1-1 TV)",
        "Evan \"Buck\" Buckley",
        "Henrietta \"Hen\" Wilson",
        "Howie \"Chimney\" Han",
        "Bobby Nash",
        "Maddie Buckley",
        "Christopher Diaz (9-1-1 TV)",
        "Minor Characters"
    ],
    "additional_tags": [
        "Fluff",
        "angst if you squint",
        "Getting Together",
        "Love Confessions",
        "First Kiss",
        "POV Eddie Diaz",
        "Domestic Fluff",
        "give buck and eddie the world you cowards!",
        "Accidental Relationship",
        "but not really?",
        "this is just fluff and miscommunication idk what else to say about it"
    ],
    "language": "English",
    "series": "",
    "published": "2020-08-10",
    "completed": null,
    "words": "27,258",
    "chapters": "1/1",
    "comments": "395",
    "kudos": "10,517",
    "bookmarks": "2,771",
    "hits": "110,318",
    "summary": "<p>“Didn’t know you were seeing someone.”</p>\n<p>Buck just laughs. Like, honest to god giggles. Eddie is stuck fighting off doubly massive waves of butterflies and confusion, all while Buck just gazes down at him.</p>\n<p>“That’s cute,” he hears Buck mumble, just before climbing into the truck, calling Eddie after him.</p>\n<p>-</p>\n<p>or, everyone knows eddie is dating buck except for eddie, literally.</p>",
    "notes": "<p>hello! i am so excited to finally be doing this!</p>\n<p>it's been over a year since i've written anything after a rough personal year but writing has gotten me through a lot, and this was pure joy. i'm thrilled to be back, but it's been a minute and i've got a whole new account (new year new me!) so this might be a little iffy, but i genuinely had such a good time with this and could write an embarrassingly long amount more on it too.</p>\n<p>this is also not proofread at all. apologies in advance</p>\n<p>it's way longer than i ever intended it to be but yolo. it is what it is. take the fluff and run with it.</p>\n<p>hope you are all staying safe! &lt;3</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>little 2024 update to wave my bisexual flag around because a lot of new people are checking this out and just want to say how truly thankful i am for the love y'all have shown this little story of mine over the years. i was completely overwhelmed then, still am now. i'll never ever have the words, hope you guys are doing well &lt;3</p>",
    "text": " \n \n \n \n \n \n \n \n \n \nEddie is sure there is a special spot reserved in hell for Monday mornings.\n \nHis abuela has a select choice of rapid-fire Spanish words for them.\n \nFirst misfire: he overslept, which happens often enough that he has enough sense to set his alarm earlier than necessary to account for it, but all the time in the world couldn’t seem to catch him today. Chris has no clean shirts to wear to school, all of them either in a pile in his room or inside the dryer Eddie never started after getting home from a late shift last night and instead passing out directly into his bed. He’s shaking the wrinkles out of a shirt he found crumpled under Chris’s bed as they rush out the door, eating cereal for breakfast without milk from a Ziploc bag, while simultaneously battling Eddie’s near and dear friend— LA morning commute traffic!\n \nAnd as if the universe decided it wasn’t enough nonsense to throw on a Monday morning at Eddie to warrant a few premature gray hairs, he was supposed to sign up for parent-teacher conferences today.\n \nThis is when abuela spits her few choice words. Or really, many.\n\n \n\nIn an effort to go paperless, Christopher’s school had set up some sort of online sign-up page for the parents to log into and choose a time slot to meet with their children’s teachers next month. But within minutes and every parent in the school trying to long in at once, the site inevitably crashed, leaving hundreds of people on hold with the unsuspecting school secretary now tasked with fielding calls and scheduling meetings their technology could not. Eddie feels for them, but at the same time, if they’d just sent Chris home with a half a sheet of paper, hell, a quarter sheet could suffice, for Eddie to sign up on, they’d have avoided this massively migraine-inducing start to their Monday morning, right?\n \nEddie noted some parents stayed behind after drop-off to schedule their conferences in person, but Eddie had to rush to work, so he’s got his abuela on the line with the school, and listens to her complain about their choice in call hold music for the entire twenty-minutes he’s at a stand-still on the highway.\n \nThe car barely rolls to a stop in its parking spot before Eddie’s got his bag over one shoulder and is all but running inside to change into uniform, head upstairs, wait and wait and wait some more for his latest parenting crisis and his most god-awful morning in a while to be behind him. He’s just going to hop up the stairs real quick and find a nice comfortable spot on the couch to to sulk in Monday morning blues (and maybe mute his abuela, its not personal he’s just on thin ice with patience today.)\n \nHe is immediately met with the sight of his teammates huddled around the kitchen counter by a basket of breakfast pastries that look like they could literally solve every problem in Eddie’s god-awful morning (Carbs! No magic quite like ‘em!) and is already feeling the slightest bit better at the sight. He’s just happy to see his friends, his family, all in what appear to be much better moods than his, of course. His sudden uptick in mood has absolutely nothing to do with the way a certain blonde-haired firefighter catches his eye almost immediately upon his arrival, before Eddie even makes landing on the last step. Absolutely not. Obviously.\n \nIts his friends. Plural.\n \nHe hopes his friends-plural miss how he almost trips over a chair when he sees that smile aimed directly at him, like its nothing and everything all at once, suppressing the urge to grin back.\n \nHe catches himself in a seat on the couch, phone in hand.\n \nHe’s content to leave his abuela to her own devices on hold with the school for a minute in favor of sinking into the warm feeling of being here, hoping a little good spirit can rub off on him. He looks on at the three of his teammates with a hint of a smile still playing on his lips and its evident almost immediately what’s happening. Not that it’s really a shock to Eddie in the slightest.\n \nEven from this far away and only half focused on their antics, the better half of his attentions still clinging to the hold music on abuela’s line, there’s no mistaking the criminally red tinge to Buck’s cheeks, the pressing laugher that hangs on the edges of Hen and Chim’s smiles—they’re teasing Buck.\n \nEddie isn’t sure what for, exactly, but whatever it is has got them wrapped up in their own little bubble, so it must be good, whatever Buck did to warrant it this time.  Hen is hunched over the counter, her fingers drumming excitedly and her laugh loud and oddly comforting to hear this morning. It’s having the complete opposite reaction on Buck though, Eddie notes, as the guy squints his eyes shut like he can physically shield himself from their banter, his blush spreading while Chim shakes him by the shoulders on Hen’s right, muttering something Eddie can’t make out.\n \nBuck looks like he’s one second away from throwing an everything bagel at Chim and he gets redder, saying something Eddie believes is along the lines of “not today” which Hen only counters with “you say that every day”.\n \n“Eddito? You still there?”\n \n“Yeah, yeah, sorry, just got to work,” Eddie shift his weight forward on the couch, pulls the phone up to his ear and shakes his head out of his thoughts, struggling to pull his eyes away from those absolutely ridiculous Buckley dimples he can see from all the way over here still—\n \n“I just got the secretary, she said I am now third in line.”\n \n“Great,” Eddie lets out an anxious breath, “Good, you know we need the—”\n \n“Seven pm slot on Tuesday night,” his abuela finishes seamlessly, “Contrary to whatever you may believe, I’m not crazy.”\n \n“Yet.”\n \nShe hums on the line and Eddie laughs, twisting the sole of his shoe on the floor nervously, “Okay, I’m not gonna keep you, I got it.”\n \n“Abuela—”\n \n“You’re at work, I know what I’m doing,” she argues in a tone Eddie is used to never fighting his way back from, “I’ll just text you when I get the time.”\n \n“Since when do you know how to text?” Eddie’s eyebrows furrow together.\n \n“Your friend Evan showed me how, at dinner last week,” she says, very matter-fo-fact, like it isn’t supposed to make Eddie’s heart somersault thinking about his best friend teaching his grandmother how to send emojis while he was at family dinner.\n \n“No one calls him Evan, abuela,” Eddie tucks his cheek to one shoulder before he sports a blush of his own, “That would make him sound like an actual adult, which is giving him too much credit.”\n \n“Well he was very helpful, unlike someone I know,” she sings, pointedly, “And very nice. And liked my food. So I’ll call him Evan.”\n \n“Whatever makes you happy abuela.”\n \n“So I’ll text you,” she says, “Relax, go eat some breakfast, you’re always grumpy without breakfast.”\n \n“I had breakfast.”\n \n“Two cheerios you stole from your son doesn’t count.”\n \n“I didn’t—”\n \n“Give Evan a kiss on the cheek for me.”\n \nHe’s lucky he’s already sitting, his voice rising uncharacteristically, “Abeula, I’m not gonna—”\n \n“Adios, Eddito,” she hangs up after the sound of her blowing a kiss, and leaves Eddie to collect himself from that whirlwind of a conversation, running the back of one hand down his face and dropping his phone to his side on the other.\n \nWith his senses mostly restored (because yeah abuela, that’s cool! Lemme just walk up to the kitchen counter and kiss Evan on the cheek! He’ll never figure out I’m harboring the world’s worst kept secret feelings for him then! Brilliant!), Eddie claps a hand on his knee, stands up and shakes out his nervous energy as he wanders slowly over to where his teammates seem to still be fully immersed in poking at whatever antics Buck has gotten himself into today.\n \n“Not with you here,” Eddie can make out Buck’s grumbling, with his back to him, “Making those eyes at me.”\n \n“But my eyes are so pretty, aren’t they Hen?” Chim comically bats his lashes and it makes Eddie really laugh for the first time today, as he jumps up from his seat and heads over.\n \n“Oh, sure they are Chim, but you know whose eyes are even prettier?” but Hen is looking directly at Buck when she says it.\n \n“Whose?” Eddie decides to jump into conversation when he arrives at the counter finally feeling a little better, (and it has nothing to with the way he’d been tracking Buck’s smile from the moment he’d arrived, and everything to do with his abuela helping fix his problems, obviously,) “Mine?” he plays along with a wink.\n \nHen’s answer catches him by surprise, because he was obviously kidding, but she just says, “Exactly yours, dreamy brown eyes. Look at em,” she pinches his cheeks adoringly.\n \n“Oh, I agree, don’t you, Buck?” Chim says, and Eddie’s so busy looking at Buck for a reaction to cling to that he doesn’t notice Chim’s face when he says it.\n \n“Yeah,” he breathes, after a long beat, barely a word at all in his huff, “You want a bagel, Eddie? Maddie brought us breakfast.”\n \n“Woah, hey, I brought them,” Chim objects earning him an elbow from Buck, “Technically Maddie bought them before work for us, and I brought them here.”\n \n“Well thank you Maddie and Chim but uh, I am having the Monday from hell so I am going to very responsibly take all my energy and go punch something downstairs,” Eddie says bouncing on his toes, “Just wanted to say good morning first,” and he’d be lying to you if he didn’t drop his gaze deliberately before starting to back up slowly towards the stairs.\n \n“Aw, but Chim’s face is right here,” Buck squares Chim towards the group and makes a faux pass at hitting him square in the nose.\n \nHen leans back on the counter behind her with a laugh at their antics, but adds a genuine, “Anything we can do, Eddie?”\n \n“Oh no, yeah it’s just, not my best morning,” he huffs, “Nothing going my way,” and he explains as much to his friends who listen attentively, cataloguing the ins and outs of the mile-long list of things gone wrong today before it’s even hit noon. Just letting it all out releases a bit of the tension, feels like half the battle.\n \nHen commiserates with him, which also helps, says she had the same problem with Denny’s school and conferences last month.\n \n“Karen ended up going without me after the whole mess, but you know Karen.”\n \n“Very thorough.”\n \n“I had a novel of notes to look through on my next 24-hour shift,” she smiles, “Though I gotta say, punching Chim’s face might have helped.”\n \n“I’ll take back the bagels.”\n \n“Do you want me to call the school?” Buck interjects with an urgent worry, “Or you know, all of us? Increase your odds? With four people on the line they gotta answer one of us at some point.”\n \nAnd Eddie is sure no other person should be able to do that, to care so much about you without wasting a single beat. He schools his features best he can and brushes off the gesture, “I got abuela on it, you know her and her charm. Second only to yours,” he says without thinking, and blinks down to his feet to avoid catching any reactions of any kind, “But I’m gonna go punch something anyway, not Chim.”\n \n“You were always my favorite, Eddie!”\n \n“Hey!”\n \n“Save me a muffin!” he yells, before turning to hop down the stairs to the small gym, maybe less so to punch out his frustration and more so to punch out his feelings. That dumb smile still echoing in his mind.\n \nHe catches the tail end of something Chim yells that sounds like “A bagel? You were supposed to ask—” but he misses the rest, already hitting the first floor.\n \n \n \n \n \n \n \n \n \n \nEddie’s not sure how much time has passed when he sits back on a small bench in the gym beside a punching bag, a thin bead of sweat rolling down his face. Couldn’t have been too long, but its enough, energy expended and his focus almost fully realigned. He’s still got his AirPods in, listening to some music that’s obnoxious and loud and adult and probably very out of character (Buck has made fun of his music choices before, but Eddie’s sure it’s really just an extreme to counter all the Disney tunes on loop in his home.)\n \nAbuela had said soon, and he’s checking his phone again and again waiting for that soon to be now.\n \nHe’s just about to call her when someone jumps into the room.\n \n“You come to tell me you ate the last bagel?”\n \n“If I did, you think I’d tell the truth, or just pin it on Chim?” Buck quirks, his eyes almost squinting shut, “You feeling better?”\n \n“Yes, actually,” Eddie sighs, dejectedly pushing the bag away from him with little enthusiasm, “Though, I’d be perfect if I got the seven pm conference slot.”\n \nWhen he looks back up, it seems like Buck is just finishing a sentence he missed. Between his distracted state and his loud music still playing in his ears, Eddie didn’t hear it, so he adds, “You say something?”\n \nBuck huffs something that sounds like no which Eddie knows means yes, he did say something.\n \nEddie doesn’t press it though, just picks up his phone and sees no notification present, then continues to say, “I’m honestly more stressed just thinking about abuela texting me the news, which, apparently, I have you to thank for, Evan,” he smirks, and assumes Buck must just still be blushing from whatever Chim and Hen has been on him about upstairs.\n \n“You can be jealous abuela likes me better than you, I can handle it,” Buck says, though it comes out softer than Eddie is expecting, which unexpectedly twists at his insides.\n \nEddie drops his phone in his lap but keeps the screen open, and pats the bench next to him, signaling his friend over.\n \nAnd at that Buck seems... confused? Conflicted? Eddie’s not sure what there is to struggle with, just to sit next to him in the station gym like they’ve done at least a dozen times before.\n \nHe bounces on his feet, Eddie can almost see his thoughts bubbling outside his head, but when Eddie laughs he releases a breath-like laugh too, and sits.\n \n“Are you okay?”\n \n“Yeah, yeah,” Buck shakes his head, a pause, and then, “You wanna get dinner?”\n \n“It’s 10 in the morning.”\n \n“Not now asshole, like later, as—”\n \nHis headphones suddenly sound with a loud bing that signals a text message, and when Eddie glances down quickly reads it he sighs loudly, unable to keep a smile off his face. Abeula to the rescue, as usual.\n \n“Finally,” he mumbles, and looks up to see Buck shooting him the most earth-shattering, time-stopping smile Eddie has ever seen.\n \n“Like, a good finally or—”\n \n“Yes, yes all good,” Eddie instinctively drops a hand to Buck’s knee and squeezes it lightly, overcome again with the warmth of knowing how much Buck cares, how Buck leans in close and cares about Eddie, about Eddie and Christopher and his family. Then convinces himself that’s a totally platonic thing to feel and not get to hopeful about it.\n \n“What time?” Buck asks, and Eddie swears he’ll invite Buck to the next conference with him if he keeps smiling like that.\n \nHe shakes the thought, and smiles a little more, leans into the infectious optimism.\n \n“7,” Eddie clicks his phone shut, pulls out the one headphone still in his right hear, the music ceasing and his distractions fully gone. He elbows Buck on his way to standing, “So, dinner?”\n \n“Or not, I mean it’s whatever you—”\n \n“You’re the only guy I know who could eat his body weight in breakfast and immediately think about dinner,” Eddie laughs, tries to keep the wist out of his voice, because its not the first time he’s made platonic dinner plans with Buck, so he should be used to it (he’s not) “But yeah, dinner sounds good, I—”\n \nJust when he’s about to finish that sentence with something embarrassing, the alarm saves him.\n \n“We can uh, make plans later?”\n \nEddie nods, smiling, then they’re both up and out, getting ready for a call.\n \nEddie’s shrugging on his gear, laughing at his abuela’s string of excited victory texts and is about to warn Buck of the monster he’s created, when he sees Hen pulling Buck into her side, squeezing an arm around his shoulder while Chim excitedly jogs backwards in front of them.\n \n“What did we say, Buckaroo?”\n \n“Can we not do the ‘I told you so’ right now?”\n \n“But we told you so!”\n \nEddie climbs into the truck behind them, their conversation over at his arrival, but their grins plastered wide and permanent.\n \n“So, Chim,” Eddie looks up at his teammate sitting across from him, “Heard you ate the last bagel, not cool man.”\n \nBuck drops his chin to his chest and taps his toes on top of Eddie’s boot.\n \n \n \n \n \n \n \n \n \n \nThe rest of the shift passes by in a blur of low-impact calls, a really delicious dinner from Cap that could have cured every one of Eddie’s Monday morning grievances alone, and some nice downtime up in the loft in between. It doesn’t feel like long before he’s throwing his things into his bag haphazardly and thanking Carla for staying late, letting her know he’s on his way home.\n \nHen is shutting her locker at the same time as him, with a loud sigh, “Day get any better?”\n \n“Oh god, yes,” Eddie swipes a hand down his face with an exhausted groan, “Thank you guys.”\n \n“Hey, don’t thank us, we didn’t do anything. Just really happy for you. You deserve it,” Hen winks, pats a hand onto his shoulder affectionately, “The conference thing work out?”\n \nEddie assumed that’s what she was already referring to, which confuses him for a beat, but he answers anyway, “Uh, yeah. Here’s hoping LA traffic cuts me some slack getting from here to the school as soon as my shift ends.”\n \n“That’s a good one,” She laughs, “I’ll pray for you.”\n \nHe echoes her laughter and adds, “I might need to ask Karen to be on standby. She’d probably get more out of that meeting than I ever could.”\n \n“Oh you know she would,” Hen says, “When I said a novel, I was not kidding.”\n \n“I didn’t think so,” he slings his bag over one shoulder and starts to head out the room, “Well, now I need to sleep for three days straight.”\n \nHen scoffs out a laugh, agreeing, “See you bright and early tomorrow, Eddie.”\n \n“Night, Hen.”\n \nHe walks out of the room down the long path to the entrance of the station, surprisingly light on his feet in a way he did not think possible at the start of his day. Its strange, how such small things flip his mood in here, in any direction, at any time.\n \nThough, some reactions are more routine than others.\n \n“Eddie! Hey,” Buck springs up from where he’d been leaning on the back of the ladder truck waiting to walk Eddie out to his car.\n \nYeah. That one never gets old.\n \n“Hey,” Eddie says back lamely.\n \n“So…”\n \n“So?” Eddie raises his eyebrows at his friend’s strange behavior.\n \n“Sorry its just, it’s been a while, you know?” Buck laughs nervously, playing with the strap of his bag on one shoulder, “But you’re good? We’re uh, we’re good?”\n \n“Yeah, why wouldn’t we be?” Eddie bumps his shoulder, “I know I was in a mood this morning but—”\n \n“No yeah, uh,” and it’s endearing to Eddie, for reasons he can’t name, to see Buck so uncharacteristically bashful for no reason, “I can cook.”\n \n“You can,” Eddie nods.\n \n“I mean for dinner, I can cook dinner for us, if that sounds like something you want,” Buck smiles down at him, and adds a perfunctory, “Or not. I could not.”\n \n“You don’t have to cook, Buck,” Eddie hums, “That’s a lot of work just for me.”\n \n“I want to,” Buck rushes to add, “I want to cook, just for you.”\n \n“Okay then,” Eddie leans into his shoulder yet again, “Is it my birthday or something that I’m missing?”\n \n“Funny,” Buck rolls his eyes, keeps their shoulder pressed together as they arrive at Eddie’s car. Eddie notices Buck’s is across the lot, tries not to read into it to much. “You’re off on Thursday, right?”\n \n“Yeah,” and again, not reading into that.\n \n“Seven on Thursday,” Buck points, and that smile comes back, the glowing, hazy, feelings-inducing one from this morning, and Eddie’s not sure he’s processing the motion of getting into his car.\n \n“Seven on Thursday,” he echoes softly, and narrowly misses the car horn when his head falls in front of him, emotions giddy and weighing him down.\n \nThis is fine. He’ll be fine.\n \n(Carla and his blushing cheeks seem to disagree.)\n \n \n \n \n \n \n \n \n \n \nIt isn’t until he’s leaving work on Wednesday night that Eddie realizes something is off. He hadn’t been able to pinpoint it since Monday, but Wednesday night, it all makes sense.\n \nThe entire 118 has just stopped teasing him.\n \nEddie knows he’s never gotten the worst of it in the station, so he’s never complained. He knows this because he’s usually helping Hen and Chim with Buck, which is arguably, the worst of it. But— he’s also not clueless.  And even if he was, they’ve never been shy about it before.\n \nThe knowing glances, the quirked eyebrows and coincidences they force, the outright comments and the whispers they think he can’t hear, or maybe they know he can hear and that’s only more infuriating the more he thinks about it.\n \nIt’s fine, it’s never really bothered him, really, only so much as to worry him that it’ll clue Buck into the fact that they’ve never exactly been wrong about it.\n \nNot once.\n \nBuck will get teased about anything, that sibling love from Hen and Chim (and even sometimes Bobby) that Eddie laughs at and joins in on. He knows.\n \nBut the poking and prodding they save for Eddie usually only ever comes in conjunction with the blonde and whatever feelings they’re trying to tease out of him (and at least from Eddie’s side, they’ve come really close.)\n \nSo it’s strange, Eddie thinks, when all of a sudden, it stops.\n \nHe can’t remember the last time Eddie mentioned getting dinner with Buck that Chim didn’t immediately oggle his eyes at. He doesn’t think he’s ever gotten away with showing Buck a picture of Chris without Hen practically cooing in his ear. It is a 118 staple for someone to ask about the wedding when Eddie sees Buck is on dishwashing duty so he just happens to be nearby and help him with drying.\n \nBut Wednesday shift, all three of those things happen, and he doesn’t get a single reaction out of anyone.\n \nHe’s not going to complain, sure, because the lack of attention should be nice for a change. But instead it’s just unsettling, and gnaws at this paranoia that maybe they know something Eddie doesn’t. That maybe Buck’s had enough of the teasing because it’s just so untrue, that he’d never actually want to marry Eddie and do the dishes with him every night in their home before they fall into their bed together (hypothetically speaking, obviously, Eddie hasn’t thought about this at all.)\n \nBut when Buck sits next to Eddie on the couch and reaches his arm up around the back, behind Eddie and practically around his shoulders, and no one says a word, Eddie’s so shaken he almost gets up and leaves the room. But he doesn’t because, Buck’s arm is practically around his shoulders. He’s convinced he’s either been imagining things all the years he’s worked here, or he’s imagining things now.\n \nHe considers asking Buck, because that would be the easiest way to figure out what kind of strange alternate universe he’s entered where his nosy friends have decided to give him space. Honestly, it’s concerning. In the nicest way possible. He knows his friends. He knows Hen, he knows Chim, of all people, would have never passed up this opportunity before, when Buck is literally a centimeter from holding his hand down the stairs.\n \nBut how do you ask your best friend about why your other friends have stopped teasing you about your feelings without making those feelings glaringly obvious? That conversation just could not end well. In any universe. For anyone.\n \nIt’s kind of a moot point though, Eddie realizes, because Buck either doesn’t notice or doesn’t care enough to notice. For every missed glance or forgotten comment that leaves Eddie knitting his brows together in confusion, Buck is completely unfazed. Eddie guesses maybe being the butt of enough jokes in the team you stop counting and cataloguing how many and what kind. It makes sense Eddie notes the change and maybe Buck just doesn’t. Maybe.\n \nBut it’s fine because he’s not going to complain about his friends staying out of his business. They smile and laugh and talk and it’s all normal in a completely un-normal way. It’s fine. He’s fine. Eddie’s not going to be the first person on earth to ask to get teased about his glaringly obvious feelings for his best friend the night before he has a very causal, common-place, completely normally platonic dinner at his best friend’s place that he cooks for them. At seven.\n \n(Maybe one day he’ll ask someone about it. Or ask Buck out. Whichever comes first. Either way it’s not happening anytime soon. Or without the world’s worst blush on his face while it happens.)\n \n \n \n \n \n \n \n \n \n \nThe week has decided to not cut Eddie any slack, it seems, when he arrives outside Buck’s door on Thursday night at 7:12 with beer and an eight-year-old.\n \n“Buck, I am so sorry—”\n \n“Christopher!” Buck’s eyes go wide just seconds before he’s almost tackled to the floor in his doorway, catching Eddie’s son in his arms, “Didn’t know I was getting my actual favorite Diaz tonight.”\n \n“I didn’t mean to—”\n \n“Daddy said six bad words in the car,” Christopher giggles suspiciously to Buck, or rather, onto Buck’s cheek, where their faces are almost pushed together in a tight hug.\n \n“No!”\n \n“Yeah!”\n \n“Dad,” Buck peeks up at Eddie from where he’s crouched next to Chris, still standing in the doorway, a faux authoritativeness lacing his teasing voice, “What did we say about bad words?”\n \n“Shut the fuck up.”\n \n“Oh my goodness!” Buck gasps, sending Chris into another fit of laughter before he hip checks the door to swing it shut, winks at Eddie, then throws a hysterical Chris over one shoulder and runs, tosses him with a laugh onto the couch.\n \nEddie’s like, three beats away from proposing. And he hasn’t even taken the guy on a first date.\n \nHe watches Buck toss the TV remote to Chris, who is adamant he knows how to change the channels himself, so Buck throws his hands up and backs away with a smile still steady.\n \n“Six bad words?”\n \n“Did I not just tell you to shut up?”\n \n“Right, seven bad words.”\n \n“I cannot catch a fucking break this week, Buck.”\n \n“Eight?!”\n \n“I swear—”\n \nBuck’s smile buckles under the weight of his laugh, his head dipping before grabbing a beer and tossing it to Eddie, “What happened?”\n \n“Nothing,” Eddie shakes his head, thanking Buck for the drink, “Literally, nothing bad is happening, which is rare for us, so I couldn’t complain, it’s just...”\n \n“A lot?”\n \n“Yeah,” Eddie tosses back a swig of his drink, “I really am sorry though. Carla is sick and abuela had him yesterday and you know she never slows down and she wouldn’t say no if I asked so I didn’t want to—”\n \n“Woah wait dude, that’s what you’re worried about?” Buck asks, leaning forward from where he stands, his palms flat on his sides on his countertop, “Christopher?”\n \n“You said dinner—”\n \n“Invitation always includes him, always,” Buck says so firmly, so wholly and genuinely, and Eddie lets out a breath he didn’t know he was holding in.\n \n“Thank you,” Eddie whispers shyly, and Buck nods once.\n \n“He appreciates my cooking more than you do anyway.”\n \n“That’s really not saying much, when he has my cooking to compare it to.”\n \n“Hey, you said it, not me,” he points, before picking up his own beer.\n \nEddie sinks back comfortably, an overwhelming sense of belonging hitting him here, surprising him every time it does. He looks up to check on Chris, who also apparently, feels at home here, lounging across Buck’s entire couch, flipping through TV channels. Before he turns back to Buck he notices a bouquet of flowers on the counter peeking out from behind where his best friend stands, “Who got you flowers?”\n \nThere’s a mischievous lilt to his tone to mask the jealously already bubbling up inside him.\n \n“Oh, no one—”\n \n“Someone had to buy them,” Eddie presses, “Unless you got a secret admirer I don’t know about?”\n \n“No, no, I bought them.”\n \n“Oh?”\n \n“Yeah, it was…” he shakes his head, as if he’s shaking out the rest of his train of thought with it, “I made pasta! New recipe Bobby taught me.”\n \n“Sounds great,” Eddie shrugs at the very sudden change in conversation, but chocks it up to lack of sleep maybe, coming off a 12-hour shift Eddie knows Buck had today that he didn’t. He suddenly feels bad for taking up some of Buck’s only free time with him and his kid, but Buck’s sporting a smile that steals Eddie’s entire train of thought, and his worry right with it. “Probably not much better than the boxed Mac and cheese I was gonna make tonight though.”\n \n“Thank god you’re here,” the words are meant to be joking, but they hang heavy in the air between them, Eddie just a step away from Buck.\n \n“Wouldn’t miss it.”\n \nBuck tucks a shy smile away before peeking up at Eddie under his long lashes, “I’m glad.”\n \nEddie’s heart free-falls. Over two words.\n \n“So,” Buck clears his throat, popping whatever bubble they’d been floating in, “You wanna go sit at the kids table, or think your culinary talents can handle helping me?”\n \n“Your faith in me is inspiring, truly,” Eddie takes another sip before putting his glass behind him and stepping up to Buck’s left side, “What can I do?”\n \n“Besides stand there and look pretty?”\n \n“Uh—”\n \n“Too strong?”\n \n“You mean, uh? The sauce?” Eddie balks, floundering inside his own head as he reaches around Buck to grab a spoon to taste the sauce, because, it’s too strong.\n \n“Yeah, sure,” Buck laughs and Eddie can feel the breath on his cheek, “The sauce.”\n \nEddie tips his head back and tastes the drop of sauce on his spoon, “No yeah, not uh, not too strong.”\n \n“Guess it was just me then,” Buck places a gentle hand on the small of Eddie’s back so he can pass behind him, grab something from a drawer on his right, “I’d worry about asking you to boil pasta but lucky for us,” Buck leans in close, like he’s about to let Eddie in on a secret, “I happen to be a firefighter.”\n \n“No way! Really?”\n \n“LA’s finest,” he brags, moving to grab three plates and finally Eddie can breathe, “I’m great with hot things.”\n \nEddie’s sure he can hear his heartbeat from three feet away, “So you can handle kitchen fires?”\n \n“Among other things.”\n \n \n \n \n \n \n \n \n \n \nEddie isn’t sure how he ended up here. Trapped physically between couch cushions while his best friend tip-toe around his living room picking up Legos and trying not to disturb his son’s sleeping form. Emotionally trapped under how that sentence sounds in his head.\n \n“I think they’re multiplying...” Buck whispers, crouched behind his coffee table, “I swear he had like, half of these when we started.”\n \n“The magic of Legos.”\n \n“I’m about two blocks away from giving up and buying him a new set so we can just leave these here,” Buck sighs, taking two very delicate steps towards the couch and, Eddie guesses, very literally, given up, “What’s your call here?”\n \n“You don’t have to buy my son new Legos.”\n \n“It’s just because I’m too lazy to clean them up,” Buck settles his weight next to Eddie, “It’s not spoiling him if it’s done out of purely selfish reasons.”\n \n“You’re a terrible influence, you know?” Eddie whispers, but his smile is so wide when he says it, inches away from Buck’s own that he’s sure no one would believe he means it.\n \n“I’m not hearing a no in there...”\n \n“If I said no, would it matter?”\n \n“No.”\n \n“See?”\n \n“Okay fine, I won’t,” Buck concedes, “Just because you’re a really good influence.”\n \n“You want me to help clean up the Legos, right?”\n \n“Can’t a guy give a compliment with no ulterior motives?”\n \n“Not my guy,” eases off Eddie’s tongue before he can realize he’s saying it, and almost trips when he moves from the couch.\n \n“I compliment you all the time,” Buck clears his throat and steps around the opposite side of the coffee table.\n \n“You spent 20 minutes before dinner talking about how bad my cooking was.”\n \n“It’s not personal, I just don’t think we should have to eat your raw chicken,” Buck’s voice drifting towards him barely above a whisper, the TV low and the lights dimmed, “I’m responsible and caring like that.”\n \n“Oh really?” Eddie gathers a few blocks of Legos, takes one steps forward that Buck mirrors opposite him.\n \n“You’re responsible and caring too,” Buck hums, “Just not with your food.”\n \n“Feels like half a compliment...”\n \n“You’re smart, really smart,” another step, another block, “Really good under pressure.”\n \nEddie blinks, and wonders again how he got here, two steps away from being nose to nose with his best friend and two breaths away from a love confession.\n \n“I think you’re funny, which you’ve probably never heard before, so, you’re welcome,” Buck continues, and Eddie’s not sure why, because he thought the compliment jokes died 3 minutes ago, but is making his insides bubble in warmth so. He rolls with it.\n \n“Thank you.”\n \nBuck hides a small laugh in his shoulder, “You’re a great dad, a great firefighter, a great friend, a great...”\n \nEddie aches fo finish that sentence.\n \n“You’re good at just about everything, and it would be infuriating if you weren’t so goddamn charming to go with it all,” Buck says as he studies the pattern of his rug, traces a swirl with a finger on his free hand, then picks up a couple more legos into his hand, slightly peeks up at Eddie, who’s almost closed the distance between them.\n \nThe air is unnaturally still, which it never is with Buck, Eddie thinks, always alive and thrumming and running towards the next thing.\n \n“You’ve got...” Buck starts up again in the quiet, so gently Eddie couldn’t blame himself if he just tipped forward and inch and landed a kiss on his nose. But then Buck blinks, and quirks his head to one side and scrunches his nose adorably, “You’ve got a lego in your hair?”\n \n“What?”\n \n“You have a lego,” Buck says, a giggle lining his every breath as he reaches up one gentle hand, brushed past Eddie’s ear and slowly back, “In your hair.”\n \n“How the hell—”\n \n“I have no idea,” Buck marvels at the small red block in his hand before dropping it into his pile, “Looked good on you though, not shocking in the slightest.”\n \nEddie’s sure his cheeks rival the red hue of the lego.\n \n“Daddy?”\n \n“Hey, buddy,” Eddie jumps up at the sound of Chris, stretched across the couch, groggily rubbing his eyes away, “Time to go home.”\n \n“Home?”\n \n“Yeah, we’re at Buck’s, remember?” he whispers gently, running and hand over, the boy’s shoulder, “And it’s bedtime, so we gotta go home.”\n \n“Buck’s bedtime?”\n \nHe’s about to refute his small statement, but Buck beats him to it, “Yeah, I am so sleepy. You wore me out, Superman.” He even tacks on a yawn for effect. This guy.\n \n“We could have a sleepover.”\n \n“No, Christopher, you have school tomorrow.”\n \n“I don’t want to go.”\n \n“Not an option—”\n \n“Another time,” Buck nods. He bends down to Chris’s eye level and continues very seriously, “You wanna pinky promise on it?”\n \n“Pinky promise?”\n \n“It’s the most serious promise in the world. My sister taught me how to do them when I was smaller than you.”\n \n“Smaller than me?”\n \n“Crazy concept, I know,” Buck laughs lightly, steadying himself with one hand on the end of the couch, peeking up at Chris, “But the special thing about pinky promises, is that you can never, ever break them.”\n \n“Ever?”\n \n“Never,” Buck shakes his head, “So I’ll pinky promise you, Christopher, that if you go home now, and do a good job in school tomorrow, that we can have a sleepover the next time you and your dad aren’t busy,” Buck smiles and holds out his hand, one pinky pointing towards Christopher, “We got a deal?”\n \nChris seems to consider it for only a minute before linking his pinky around Buck’s, beaming so brightly you’d never know it was the middle of the night.\n \n“Thank you,” Buck says, holding his and Chris’s hands together with his free hand and a gentle squeeze.\n \n“Thank you,” Eddie whispers, scooping Chris up off the couch and heading for the door.\n \nBuck trails behind, and Eddie can feel Chris giggling on his shoulder.\n \n“The sooner you go to sleep at home, the sooner you go to school, and the sooner we can have that sleepover,” Buck says, and adds in a show whisper, “Maybe we could get rid of your boring old dad too.”\n \n“Hey!”\n \nChris’s laughter shakes his shoulder, and Eddie clings to the little bits of joy.\n \n“Pinky promise?”\n \n“See what you’ve created here, Buck?”\n \nEddie can feel Buck ruffle his son’s curls adoringly before dropping to another whisper, but maybe this time, Eddie thinks, one he’s not supposed to hear, “Sorry kid, no can do on that one. Between me and you, and don’t ever tell him I said this, but I actually kinda like having your dad around.”\n \nHe’s glad he heard it anyway.\n \nWhen they reach the front door, Chris is slipping back into sleep, and Eddie turns to face Buck, speaking so carefully as to not disturb the peace they’ve created, and maybe have to pinky promise their way into more.\n \n“Thank you, Buck,” Eddie lets out in a quiet breath, “For everything.”\n \n“Yeah, it was,” Buck’s smile is quiet too, “It was perfect.”\n \nThe silence of the night washes over them once more and Eddie takes that as his cue to leave, but once step and he’s abruptly stopped—\n \n“The flowers were for you.”\n \nHe feels the confusion crowd his face.\n \n“The flowers, that you asked about before,” Buck clarifies, quickly sporting one of those lego red blushes too, “I bought them. For you.”\n \n“Oh.”\n \n“Yeah, it was, it was Hen’s idea, and you know, I trust her advice on just about anything in the world, so,” Buck says, but shakes his head after a beat like he’s got to get rid of the whole thing, “Sorry, if that’s weird, or anything, I just—”\n \n“No, no, it’s nice,” Eddie can barely make sense of his own words over how loud his heart thumps in his chest, “No one’s ever bought me flowers before.”\n \n“Well, they’re idiots then.”\n \nEddie bites his bottom lip, “It’s a good thing you’re just telling me now though, cause if Chris had seen ‘em, he might pinky promise you into buying them every day.”\n \n“I would,” Buck breathes out, “I would buy them every day.”\n \n \n \n \n \n \n \n \n \n \nIt would be a lie for Eddie to say the next time he thinks about Buck would be at his front door at 7:12 the next morning, but having the guy stand there holding a Spider-Man backpack and a bouquet of flowers sure does help.\n \n“Um, good morning?”\n \n“Forgot Chris’s backpack at my place last night,” Buck pants, like he’s just run here to deliver it personally (Eddie sees his car next to the driveway), “Damn, I didn’t think I’d make it in time.”\n \nEddie surveys the situation as Buck leans against his doorframe. Buck literally looks like he rolled out of bed and came straight here, his hair askew and his shirt wrinkled, the kids size backpack hanging funnily over his one shoulder.\n \nIt’s a sight. An alarmingly attractive one no one should be able to pull off at 7:12 in the morning.\n \nEddie focuses his breathing, “And the flowers?”\n \n“Well I guess forgetting runs in the family.”\n \nEddie laughs, watches the morning glow wash over Buck and thinks he’d really like to get used to this.\n \n(He doesn’t know how he’s gotten this deep, so far gone, for a guy who so clearly and obviously just wants to be friends. And he’s been pretty deep before, literally. Nothing compares to this.)\n \n“Well, thank you, for making the trip. You really didn’t have to,” Eddie smiles, because he really didn’t.\n \n“No, no, its fine, you know, I pinky promised with the contingency that he went to school today and you can’t do that without a backpack so—”\n \n“Yeah, but you could have texted me, cause—”\n \n“Buck!”\n \nEddie turns around at his son’s voice, appearing just behind him, dressed and ready for school, breakfast eaten, shoes tied, and... a backpack over his shoulders.\n \n“This is not his school backpack.”\n \n“It is not,” Eddie nods, biting his lips together to keep from laughing as the realization hits Buck head-first.\n \n“Awesome.”\n \n“Just a bag to put all our toys in for when we visit our friend Buck,” Eddie points, his laugh starting to escape, “I said you should have texted.”\n \nBuck ignores his teasing and leans into the arm he has propped on the doorframe, peeking over Eddie’s shoulder to wave, “Morning Christopher!”\n \n“Buck brought home the stuff you forgot at his house last night,” Eddie turns to face the boy too, “What do we say?”\n \n“Thank you!”\n \n“Suddenly, that hour less of sleep feels worth it.”\n \n“Buck’s gonna come with us to school, that sound good?”\n \n“Really?”\n \n“Really?” Buck quirks.\n \n“Really,” Eddie affirms, patting Christopher on the head as he pushes through the doorway and passes them, headed for the car, “Its closer to the station than you going all the way home and back. Plus I’ll get you coffee on the way.”\n \n“Well, aren’t you a catch!” Buck sputters leaning back so Eddie can shut and lock the door.\n \n“Says the guy who bought me flowers.”\n \n“Hey Chris, you want some flowers?” Buck yells, though he doesn’t tear his gaze from Eddie’s, grinning madly, “Your dad’s mean and ungrateful.”\n \n“That’s not nice, dad,” Eddie hears Chris say, somewhere not too far off, but he keeps his eyes locked on Buck’s.\n \n“Very not nice,” He mutters, then takes the bouquet from Buck’s hands, and starts towards the car with a wink.\n \nHe hears Buck call shotgun, like there was another option, but still, it makes Chris laugh so he’ll let it slide, then tucks his nose into the bouquet and sighs at the beautiful scent.\n \nIt really shouldn’t be allowed, to have to platonically accept flowers from a guy and pretend the gesture hasn’t been knotting up your insides since last night, and probably won’t lend itself to unknotting any time in the distant future.\n \nHe spends half the ride keeping Buck and Chris from making any more pinky promises (a puppy and a trip to Disney World come up in exchange for Eddie to stop cooking for a month) and the other half working up the nerves of steel to face the wrath he’s sure to have to endure from his friends when they walk into work.\n \nIt’s been uncharacteristically quiet for the past week, but Eddie is willing to bet, pinky promise on it, that he won’t be able to show up to the station with Buck and a bouquet and walk away from it unscathed.\n \nHe can practically hear Chim’s laugh, the gentle knowing shoulder bump from Hen, that look from Bobby.\n \nWhen Eddie parks the truck, he grabs the flowers from the back seat and jumps out, but Buck stays still in his seat, watching Eddie’s movements with an unreadable expression.\n \n“You joining us for work today, Firefighter Buckley?”\n \nBuck stays still, his eyes grazing Eddie’s stance, from head to bouquet, “You’re bringing the flowers?”\n \nEddie’s not really sure what to say, caught in between preserving his feelings and easing the crease in Buck’s brows. So he settles on a very matter-of-fact, “They’ll die if I leave them in here.”\n \nHe must like that answer a lot, and it’s not the weather that has Eddie feeling warmer suddenly.\n \nEddie’s trying to keep up with the new spring in Buck’s step, chasing him across the parking lot, but it’s a lost cause when he spots Hen slipping her boots on in the locker room and is running full sprint ahead, yelling something Eddie assumes has to do with his flowers. He laughs quietly to himself before he hears a car door shut beside him, finds Chim to be the owner, and braces for impact.\n \n“Look who’s showing up to work together!” is what Eddie trains his ears to hear and his embarrassment not to reflect.\n \n“Good morning, Eddie!” is all he gets.\n \nIn all honesty that takes him more time to recover from.\n \n“Uh, hey Chim,” he tightens his grip on his bag, swings the flowers behind his back in a very inconspicuous way. And nothing.\n \n“Did you guys get stuck in that traffic too? God, I think I heard that new One Direction song loop on the radio 3 times before I got out of a standstill.”\n \nEddie blinks slowly, you guys, so he knows.\n \n“No, we dropped Chris off at school first, so I think we avoided most of it,” Eddie feels his stomach swoop but that’s the only reaction he’s getting. And he just committed two of the highest offenses on the list of things to tease Buck and Eddie about. He adds to cover up his distress, “And One Direction broke up years ago, old man.”\n \n“Well, it was one of those guys,” Chim shakes his head, as if this was the thing most troubling to him this morning.\n \nAlright, maybe this was part of his plan, Eddie ponders, make him admit it himself. Game on, Han, “How was your night?”\n \n“Oh, it was good,” Chim nods, as they cross into the station, “Albert came over for dinner with Maddie.”\n \n“Ah, sounds nice,” Eddie hums, “Did you cook?”\n \n“Me? Very funny, Diaz,” Chim looks up at him.\n \n“Yeah, me either.”\n \n“Oh that’s right, you had your dinner last night, Maddie mentioned it,” Chim smiles, and how did Maddie know? “You have a nice night?”\n \n“Yeah,” Eddie nods, so quickly it gives his every emotion away, perfect bait, but Chim just smiles, “Buck’s a good cook, but I told him I’d give him a run for his money next time. You and Maddie should come.”\n \n“I’m sorry, I thought you said you had a nice night?”\n \n“I did,” Eddie’s eyebrows scrunch in confusion.\n \n“You’re gonna poison him and invite your old man and his big sister to the next one? After a nice night?”\n \n“Don’t think that’s how you use the phrase ‘your old man’.”\n \n“Take care of him, Diaz,” Chim holds a hand tenderly to his chest and then pats Eddie on the shoulder, before trotting off to the locker room.\n \nTake care of... the flowers? Maybe?\n \nBuck’s practically skipping over when Eddie walks in, still half hiding the flowers Chim really must want him to take care of and Buck’s pulled them out of seclusion to show Hen before Eddie can even put his bag down, telling anyone who will listen about his very chivalrous act of delivering them to Eddie’s doorstep personally, and how Chris had picked one himself to keep in his backpack for school. Chim’s quiet as he changes, and Hen’s gushing smile rests in her hands where she watches them, and no longer able to hide the flowers, Eddie hides his face that will give it all away behind his locker door.\n \nHe really wishes someone would call him out on it, which should have probably been the first red flag.\n \n \n \n \n \n \n \n \n \n \nThings... escalate after that first week, and quickly. Eddie’s stopped questioning it.\n \nOr, he tries.\n \n \n \n \n \n \n \n \n \n \n“You think they’re being weird?” Eddie slips the question in casually enough one day, on the loft couch during down time on a shift, Buck sprawled our next to him, legs dangling off the arm opposite him, scrolling mindlessly on his phone.\n \nBuck seems perturbed by Eddie’s interruption of his reading of facts on fulls moons he’s just researched, but other than that, nothing, “Who?”\n \n“Everyone.”\n \n“That’s what I’m trying to say, if you’d shut up for a minute and listen to me,” Buck drawls, “It’s a full moon tonight and I read—”\n \n“No, no, I mean, everyone,” Eddie traces his eyes around the room, stops on the three other members of his team sitting by the kitchen, watching Bobby cook dinner, “You don’t think they’re being weird?”\n \n“I think you’re being weird,” Buck says, drops a cheek onto Eddie’s thigh, “Along with 33% of the population tonight.”\n \n“Where are you getting these garbage statistics from? Gimme that,” Eddie scoffs and grabs for Buck’s phone, but he dodges him in one swift motion, ending up even closer together.\n \n“I read it on the internet, Edmundo, so it has to be true.”\n \n“Oh, you went for the full name, huh?”\n \n“Crazy people can’t have cute nicknames.”\n \n“I’m not crazy,” Eddie defends, but the way Buck looks up at him from where he lays, biting a smile between his lips, the guy might not be that far off, “Next you’re gonna tell me I’m a werewolf.”\n \n“You might be,” Buck shrugs, “Unibrow is one of the signs...”\n \nHe reaches a hand blindly for said unibrow, and Eddie squirms from his grasp.\n \n“You’re the worst, you know that?”\n \n“Keep it coming, Eddie, that won’t work on me anymore,” Buck laughs, settling a hand gently on his cheek when he gives up on his unibrow, “I know the truth now.”\n \n“Oh yeah?”\n \n“Yeah.”\n \nYou’re right, he almost spills, I am crazy.\n\n \n\n\nCrazy about you.\n\n\n \n\nHe clears his throat to suck back the words, “So you don’t think our friends are being weird?”\n \n“No,” Buck affirms, the shake of his head a gentle pressure where it has ended up resting in Eddie’s lap, “Point it out to me next time you think something’s up though.”\n \n“Sure,” Eddie breathes out quickly, suddenly very interested in distancing himself from Buck’s all-encompassing adoration for him even when he’s crazy paranoid. He makes a fast motion to stand, jostling Buck’s comfortable position, “I’m thirsty, you want anything?” But he’s steps away from the couch before he gets a proper answer.\n \nBuck just yells, “Sign you’re a werewolf number three: unquenchable thirst!”\n \n \n \n \n \n \n \n \n \n \n“That Italian place by your house you like.”\n \n“What about it?” Eddie slips out of uniform and into a t-shirt at the end of a shift.\n \n“Is there a dress code?”\n \nEddie’s looking around the door to his locker at Buck quizzically, slightly worried, “I don’t—”\n \n“Trick question!” Buck yells, and could probably wake the entire station up with his enthusiasm if it were a little later, “There isn’t, but I brought us nice clothes anyway!” He shoves a dress shirt at Eddie, seemingly appearing out of thin air.\n \nEddie stumbles back with the surprise force, but tentatively grabs the shirt, his shirt— how the hell—\n \n“I texted abuela and she dropped it off here before going to pick up Christopher from Carla,” because Buck can obviously, read minds, along with all the other super-human perfections he sports.\n \n“Of course you’ve texted abuela.”\n \n“She’s my best friend.”\n \n“And what does that make me?”\n \n“Not my best friend,” Buck smirks, like he knows something Eddie doesn’t. But Eddie tries not to dwell on it, because Buck wouldn’t still be smiling at him like that if their friendship were suddenly over. Buck pushes the shirt to his chest again, “And underdressed! Put a shirt on, Diaz!”\n \nHe runs out to get the car, and Eddie tries to focus on the buttons on his shirt, and not his rapidly beating heart that hides behind them.\n \n \n \n \n \n \n \n \n \n \nEddie’s caught the attention of a few people on the job, sure, but it’s never bothered him. He always had some excuse, kid, wife, work, or just enough politeness to take the slip of paper with the phone number with a smile and promptly toss it into the garbage once out of sight.\n \nSomeone who has always caught people’s attention on the job and never had a problem with it: Buck. Eddie’s seen it enough times in action to know how to handle just about any situation he couldn’t solve with one of his three handy excuses.\n \nBut today’s is new, and one Eddie and his very truthful I’ve got a kid and my work schedule is crazy right now has never had to use.\n \nBus accident in the middle of the day, minor injuries, most of the damage just some traffic piling up while they cleared the scene in the entire section. Paramedics from another house that was called to the scene have just jumped into an ambulance with the bus driver, who was looking at a broken bone or two, so Cap had the four of them stick around to do simple once-overs on some of the other passengers.\n \nEddie is making some very lovely small talk with an elderly woman with a small cut above her right eye when he hears it. 20-something redhead flirting with Buck on his right.\n \nIt’s not allowed to bother him. People flirting with him doesn’t bother him, so people flirting with Buck absolutely can’t.\n \nBut it can’t hurt to listen, right? To look out for his friend, obviously.\n \n“You were really brave out there,” Eddie hears redhead say, has the audacity to bat her lashes while she says it, “I saw you pull that little boy out of the broken window.”\n \n“Oh, yeah, just doing my job,” Buck hums politely.\n \n“A good job,” she sing-songs, “You like being a firefighter?”\n \nBuck smiles genuinely at that, while he clicks his pen light off and starts to put it back in his pocket, “More than you know.”\n \n“I’d like to.”\n \nBuck purses his lips, unsure.\n \n“Know,” she clarifies, “I’d like to know more about you.”\n \nAnd there it is. Not the best work Eddie’s witnessed, but for just coming out of bus crash, he’s giving her the benefit of the doubt.\n \nBuck seem slower on the uptake, blinking twice, as he pulls out some gauze for a small cut she has on her arm.\n \nAnd then, “Oh, sorry, uh, I’m—”\n \n“Not a hot single firefighter?”\n \n“No, I’m sorry,” he chuckles lightly, wrapping her injury, “I am really a firefighter though, I promise.”\n \nEddie’s never seen it happen before, seen Buck lie so easily. It’s the easiest excuse, to say you’re taken when in a situation like this, he’s used it enough before to know it works almost every time. But only when it’s true. And Eddie’s known Buck’s been single for well... he’s known more of single Buck than any other kind.\n \n“And hot,” the girl continues, a small red blush to match her hair, but she laughs good-naturedly with Buck enough for Eddie to know she’s not making any more advances (he’s seen Buck fend those off with effort too.)\n \n“Well, I don’t know about that,” Buck mumbles again with another laugh, and this asshole, lying again, because everyone knows Buck knows he’s hot.\n \n“Well someone knows, hot taken firefighter,” she teases, and Eddie sees Buck blush to match her hair. “You know, the best ones are always either taken or gay.”\n \n“Or both.”\n \nEddie almost chokes on the water bottle Hen had passed him.\n \nHe’s finished with his patient halfway through eavesdropping, so with airways cleared of water, he stalks back to the truck and waits by the door. Buck gently pats the redhead’s shoulder goodbye, waves as he walks away, and practically beams at Eddie when he’s just a few steps away.\n \nIt’s so endearing Eddie tries his best to keep his sudden jealousy out of the way. Keyword being tries. \n\n \n\n“All good, Buckley?”\n \n“Yup,” Buck pops the ‘p’ cheekily, grabs Eddie’s water from his hands and takes a long sip.\n \n“Didn’t know you were seeing someone,” and for all his efforts, it’s not as biting as he had thought it’d be, jealousy masking itself for the moment.\n \nHe’s afraid he misjudged though, when Buck doesn’t immediately answer, just pouts out his bottom lip (don’t look at it Eddie, don’t look) and caps Eddie’s water bottle.\n \nAnd then he laughs. Like, honest to god giggles.\n \nEddie is stuck in fighting off doubly massive waves of butterflies and confusion, all while Buck just gazes down at him, and laughs.\n\n \n\n“That’s cute,” he hears Buck mumble, just before climbing into the truck, calling Eddie after him.\n \nHe’s so flustered that Chim makes it back to the truck before he’s collected himself enough to join Buck and his giggling, so he stops him and asks urgently, confusion lacing his tone, “Did you know Buck was seeing someone?”\n \nAnd finally, someone who looks more confused than Eddie feels.\n \n“Was I not supposed to?”\n \n \n \n \n \n \n \n \n \n \n“Stop it!”\n \n“Why? Does it…” Eddie squirms under Buck’s touch, his fingers dancing over his pocket, “Tickle?”\n \n“Yeah, yeah, it does,” but it’s barely audible through his laughter, bouncing off the walls of the hallway.\n \n“Should have thought about that before you took my keys,” Buck tries to twist around Eddie’s frame again, but he’s got an elbow out to stop him before he can.\n \n“Someone had to be responsible tonight,” Eddie braces himself with one hand against the wall on his left, grabs the keys from his pocket with the right, and jingles them between their faces mischievously.\n \n“Oh and that had to be you? Big hero?” Buck makes a grabby motion for them, “I can do it!”\n \n“You’re gonna wake up the entire building.”\n \n“Go back to drunk Eddie, he’s more fun,” Buck pouts, tickling his fingers over Eddie’s waist again just to be a little shit and Eddie is so distracted he almost forgets how to unlock a door.\n \n“Still drunk, Buck,” he laughs, twisting the key, “Just want to get inside.”\n \nWith a sigh and a push, the door is swung open, and Eddie all but falls inside with Buck on his toes, very much still buzzed from their brief night out with the team to decompress post-shift.\n \nThey’d all had a long week and Christopher was spending the night with his aunt and if Eddie went home he’d have to do laundry or wash dishes or something entirely disgustingly adult that four-beers-deep Eddie never wanted to think about.\n \nBut Buck’s place? Basically adult-proof.\n \nSo it makes sense, when he’s calling an Uber to set the address to Buck’s apartment building, and it makes sense when Buck insists on paying him back that he silences him with a playful shove and a hand over his lips, and it makes sense that he kept Buck’s keys hostage all night, knowing he’d keep them safer and get to use them later.\n \nWhat makes no sense is how no one says anything when Buck drags Eddie out of the bar holding his hand and telling the group the Uber was taking them home, singular.\n \nBut Eddie’s four beers and some odd collection of other alcohol deep and all he can focus on is Buck’s fingers dancing up his sides.\n \n“Is this quiet enough for you?” Buck makes a show of whispering loudly while Eddie kicks his door shut, locks up.\n \n“Oh my god,” Eddie rolls his eyes, pads around the wall by the entrance in the dark, “Do you have a light switch?”\n \n“No.”\n \n“You don’t have lights in your apartment?”\n \n“No, I don’t, sorry.”\n \nThere’s a very serious pause between them, and there’s enough light from the city peeking through the kitchen window that Eddie can trace the lines on Buck’s face, the unmistakable scrunch that comes right before—\n \nBuck’s whole body is wracked with a bubble of laughter, his forehead falling onto Eddie’s before backing up down the dark entryway.\n \n“Okay fine,” Eddie tries to remain the responsible adult, but he is overcome with laughter too, “We’ll just sit here in the dark.”\n \n“At least buy me dinner first, Diaz!”\n \n“I’ve bought you dinner before,” which, Eddie reasons, is probably not the point, but he’s pining. Let him do it in peace.\n \n“No, I cooked dinner.”\n \n“You did.”\n \n“Did you like it?”\n \n“I did.”\n \n“Did Chris like it?”\n \n“I think that was obvious in the way I had to drag him out your door,” Eddie’s answers roll off his tongue quickly, don’t require as much emotional scrutiny when he’s a little tipsy and sated and fuzzy and warm.\n \n“Does Chris like me?”\n \nThe question is almost sobering. Almost. Maybe if he hadn’t had that last shot of tequila.\n \n“Buck—”\n \n“Because I’ve never done this before and I know it’s probably weird for him, and I don’t know how much you’ve told him but I really like Chris and I really liked having dinner with you but I won’t do it again if that’s not…” Buck flops into a puddle of long limbs on his couch, the apartment still dark, and a breathy laugh escapes, “I have no idea how I’m supposed to finish that sentence.”\n \nEddie’s always known drunk Buck was touchy-feely, even more so than an already affectionate all-the-time Buck. But the feely part of it, Eddie had never known, was so introspective.\n \nBut drunk Eddie is the opposite of cautious, no tact, no grace, so he blurts, “You just like having dinner with me?”\n \nIt seems to break Buck out of whatever pit of feelings he’s fallen into, “Shut up.”\n \n“I’m hurt, Evan!” He all but cackles, collapsing into the seat next to him, on a very large couch, “Right to the heart.”\n \n“To the heart?”\n \n“Yup,” Eddie leans into his space.\n \n“Right here?” Buck’s forgone the dramatically loud whisper, replaces it with something soft that feels less like it’s said and more like it just floats across the air between them, then places one of his hands on the right side of Eddie’s chest.\n \n“No,” Eddie giggles, wrapping a hand around Bucks and shifting them, together, to the left, “Here.”\n \n“Right.”\n \n“I’m gonna tell Hen you got that wrong.”\n \n“Please don’t, I’m already on thin-ice,” he giggles back, his fingers flexing over the cotton of Eddie’s shirt. And then suddenly, like the lights have gone on (its still dark), “Oh! We could do that!”\n \n“Do what?” Eddie prays to whoever he hears his abuela muttering to all the time that Buck’s gonna keep his hand here.\n \n“Ice-skating!” Buck grins, like Eddie should have known, “Something other than dinner.”\n \n“I’m terrible at ice-skating,” Eddie hums absently, running his thumb in circles over the back of Buck’s hand. He doesn’t move it.\n \n“I’ll teach you.”\n \n“You couldn’t even open your door tonight, and you think you could—” the words get caught in Eddies throat when Buck suddenly shifts his hands into his lap, so he can take one of Eddie’s very calloused palms and trace over every crease, play with it gently with both of his own.\n \nEddie isn’t sure howling he takes to take that in, to watch Buck be mesmerized by him, buzzed or not.\n \n“You like my hand?” Because drunk Eddie is bold.\n \n“Something like that.” Because drunk Buck makes just as good a case for Eddie to fall in love with him on the spot at regular Buck.\n \n“You can keep it.”\n \n“Even when we ice skate?”\n \n“Sure.”\n \n“And drive to work?”\n \nThey haven’t driven together to work since that morning Buck came over with Christopher’s backpack. But, “Sure.”\n \n“And in the locker room when no one’s looking?”\n \n“If you want.”\n \nEddie’s reteaching himself how to breathe.\n \n“But not when we’re cooking.”\n \n“Hey!”\n \n“You’re so bad at cooking, Eddie.”\n \n“Evan Buckley, you better—”\n \nHe doesn’t finish the sentence because Buck’s got his hand clutched under his chin, places a sloppy kiss to his knuckles, then drops it, holds out a pinky.\n \n“Promise?”\n \nEddie promises.\n \n \n \n \n \n \n \n \n \n \nSunlight filters through the windows and gently wakes Eddie up, something he’d taken for granted for years, then had rarely experienced again between having a son and a job in a firehouse.\n \nIt’s nice to be reminded of the calming lull of the morning, muffled sounds of the city and temptation to curl back under a fuzzy blanket, no obligations awaiting him.\n \nHe blinks his eyes open anyway, old habits, but gives into the comfort of the unfamiliar blanket he’s nestled into.\n \nHe spent the night on Buck’s couch, he gathers quickly, even though all he’s got to show for it is a mild headache and couch cushion creases indented on his cheeks.\n \nBuck, apparently, spent the night on his floor. Literally.\n \nEddie makes small movements to turn on his side, hand tucked under one cheek and propped up on an elbow, looking down to find his best friend, still in his clothes from the day before, sound asleep on the small floor space between his couch and coffee table. It couldn’t be comfortable in the slightest, Eddie argues, but from the looks of Buck you’d never know. Eddie’s blanket falls about halfway over one of Buck’s legs and a pillow fits perfectly in the narrow tunnel of space. Buck’s out cold, his hair disheveled and disarrayed across the pillow, his eyelashes fluttering so briefly Eddie only catches it because of proximity.\n \nSomethings he’s never been able to take for granted: waking up to this. He seizes the opportunity.\n \nThere is extra comfort in watching the steady rise and fall of Buck’s chest as he sleeps into the morning. Their lives are so frantic, so full, and so good that way, but he doesn’t remember the last time he saw Buck stop to catch his breath.\n \nHe doesn’t mean to wake him, but after a little while Eddie guesses he’s pushed his luck getting away with dreamy morning-breath sighs, as he feels Buck’s weight shift against the bottom of the couch.\n \n“Morning,” he grumbles, rubbing at his eyes.\n \n“Hey there,” Eddie sits up a little better, “Headache?”\n \nHe nods, “You?”\n \n“Yeah,” and Buck reaches up and runs a gentle hand across his forehead, like that’ll make it go away (and it might, Eddie thinks.)\n \n“See? And you were the responsible one.”\n \nEddie laughs lightly and watches Buck’s hand flop back onto his own chest, “So, you gonna tell me why you’re sleeping down there or am I supposed to magically know?”\n \n“You fell asleep on the couch,” Buck says, smile to match the fuzzy feeling of just waking up in the morning next to him Eddie has felt ache in his chest, “And I didn’t wanna wake you up and move you, but I also felt like a dick leaving you on my uncomfortable couch while I took that giant bed. Alone.”\n \nIt seems that’s all the explanation he’s going to give, like that simple fact makes it all make sense.\n \nIn a way, Eddie thinks, it does.\n \n“You’re an idiot.”\n \n“So I’ve been told,” but he’s still beaming, like he brought the morning with that smile itself, “But I’ve also heard I’m perfect just the way I am,” he sing-songs, “So who knows what I’m supposed to believe?”\n \n“One of them is definitely right.”\n \n“Yeah,” Buck sits up, his back against the coffee table, “You look comfy on my couch.”\n \n“I am comfy on your couch.”\n \n“I’d offer it up more but I think this floor thing was more of a one-off grand gesture.”\n \nEddie gives in to the weight of a morning made beautiful by the sunshine, that laugh.\n \n“I’m gonna go get us some Advil and coffee,” Buck leverages his balance with a hand on the table to stand, “You can take the shower first.”\n \n“Oh, I don’t—” Eddie shakes his head, “I can just shower at home.”\n \n“Why would you go home?” Buck scoffs, like the answer is the most obvious thing in the world. There’s a pause Eddie can’t figure out how to fill, and then, “Oh shit, did I forget?”\n \n“I think so,” Eddie supplies.\n \n“Oh well, you free this morning? Like 10 to 12?”\n \nEddie looks down at his wrinkled clothes, Buck’s blanket, Buck’s smile, “I’m already here.”\n \n“Great, cause I have brunch with Maddie.”\n \nEddie’s brows knit in confusion, “Sounds like a you problem.”\n \n“Which, by association, makes it a you problem too,” Buck shuffles around his kitchen, grabs two mugs, “You wanna come with me?”\n \n“Was I invited?” Eddie presses that small detail.\n \n“Basically,” Buck hums, sliding a mug across the counter and motioning for Eddie to take it, “I mean Chim said he was coming with her last night so, I assumed that meant I was supposed to bring you.”\n \nAnd that’s... too much for before coffee to register. Probably why he doesn’t say anything.\n \n“I don’t have to pick Chris up until 3 so,” Eddie carefully makes his way into the kitchen, his headache pounding and his heartbeat to match, “As long as it’s okay with Maddie.”\n \n“Course it is,” Buck squeezes Eddie’s arm as he rounds out the kitchen island and starts for his stairs, eager and far too awake for someone who only opened his eyes 10 minutes ago, “I’m gonna go get you some clothes to borrow. Although, fair warning, I don’t own flannel.”\n \nEddie flips him off and is told there’s Advil in the bathroom.\n \n \n \n \n \n \n \n \n \n \nMaybe, Eddie thinks, in some weird twisted way, he liked having all is friends in his business, teasing his feelings out of him. Because maybe, in some weird convoluted way, that investment and embarrassment was at least tangible proof Eddie wasn’t far off in his hope. That maybe they were right, and he was right, and his best friend was right for him.\n \nHe puts his arm around Buck on the couch one day just to see some of that proof.\n \nNothing.\n \nExcept for Buck snuggling in closer.\n \n(But that couldn’t mean anything, right? Surely a look from Hen was better proof than the feeling of Buck’s thigh lined up next to his.)\n \nHe sighs in defeat and commits the way Buck’s laugh feels in his ear to memory.\n \n \n \n \n \n \n \n \n \n \n“How many times do I have to tell you you’re an idiot before it sticks?”\n \n“Try again.”\n \n“You’re an idiot.”\n \n“Yeah no, didn’t work, sorry.”\n \nEddie has half the mind to punch him in the face. The longer he wears that smirk the more inviting it seems.\n \nBut that stupid (read: handsome) smirk is covered in soot and waiting to cough up a lung, so Eddie’s general care for the wellbeing of the guy wins out, as it always does.\n \n“Did Cap not tell us to get the hell out of there?”\n \n“He did,” Buck hums, tries to take the oxygen mask off his face to continue the conversation, but Eddie pushes it back on.\n \n“And did I not say, ‘Hey Buck, the exit’s right here, you behind me?’” Eddie grunts, “And did you not say ‘Yeah Eddie, on your back,’?”\n \n“I did.”\n \n“And did I not exit the 2-story condo complex that was about to burn through completely, turn around and find I did not, in fact, have an Evan Buckley on my back?”\n \n“I believe yeah, yeah that’s what happened,” another cough, Eddie is fuming.\n \n“So tell me again why you can’t get it through your thick skull that you, today, were an idiot!”\n \n“You said today,” Buck’s cheeky grin is unmistakable under the oxygen mask, “Which means I’m not always an idiot.”\n \n“Oh my god, I’d kill you but that would defeat the purpose of this conversation.”\n \n“I saved a dog, Eddie, I am a kid’s hero right now,” Buck swings his feet off the edge of the ambulance, kicking Eddie’s shins where he stands in front of him, scowling.\n \n“I’m not gonna win, am I?”\n \n“No,” Buck pulls the mask from his face again, and holds Eddie’s hand down to stop him from pushing it back on, “But I know I have to be careful. I always am now. I wouldn’t have done it if I wasn’t positive I could get out safely to you.”\n \nEddie hates how quickly the words worm their way into his heart, how he says it with such certainty he believes it.\n\n \n\nNot gonna let that smug look know it though.\n \n“Put your mask back on.”\n \n“Don’t need it,” Buck waves the small silicone piece past his face.\n \n“Rules of breathing don’t apply to you now?” Eddie nods down.\n \n“No, it’s just,” Buck looks up sweetly, under those long lashes, “I’m used to it. Because every time you walk into the room—”\n \n“Don’t finish that sentence, Buckley.”\n \n“But it’s true! You leave me breathless!” Buck tries to grab for Eddie’s waist, giggling, like he didn’t just give Eddie a premature heart attack 20 minutes ago.\n \nEddie manages to side-step him once before he gives in to his own laughter, lets Buck’s hand find his waist and teasingly pull him forwards. Cap had already lectured him, Buck came out scrape free, the oxygen mask mostly a precaution, and Eddie had seen that little boy reunite with his puppy with his own eyes—viral YouTube video worthy.\n \nSo he can’t really be too mad. (Even less so when he steps on Buck’s toes and earns another earful of sweet laughter.)\n \n“I’m sorry I had you worried,” Buck says softly.\n \n“You should be.”\n \n“Can I make it up to you?” the sweetness rolls off Buck’s tongue, convincing, like there was any chance Eddie would say no.\n \nHe raises his eyebrows to keep up the pretense anyway.\n \n“I’ll buy dinner.”\n \n“Sounds like you could make it up to me,” Eddie smiles, stepping back from Buck briefly when his phone buzzes with a text message. He looks down at it and his smile only grows, “Hey, someone saw you on the news. Wants to say hi.”\n \nBuck looks up at Eddie confused, as Eddie flips his phone around and crouches to Buck’s sitting eye-level.\n \n“Who— Christopher! Hey buddy!” Buck’s face is immediately overcome with a joy Eddie couldn’t contain if he tried. Carla had texted that Chris saw him and Buck on the news at the scene, and was especially concerned as to the whereabouts of Buck and that puppy he rescued. For all his frustration before, Buck really was fine, and the scene was pretty cleared up, so Eddie told Chris he could get a three-minute FaceTime. He was counting.\n \nBuck laughs at something he must have missed Chris saying, and Buck pulls the phone closer to his face, his fingers wrapping around Eddie’s.\n \n“Why were you looking at the news?” Buck questions, a glint in his eye, “Do I officially trump Sponge-Bob?”\n \nEddie bounces on his toes where he’s still crouched, bites his lip to keep from laughing when Christopher answers with a simple, “No.”\n \n“No? Oh man,” Buck dramatically falls out of the frame of the phone, “Tell me I’m still above dad.”\n \nEddie scoffs loudly at that, his mouth agape, and he swivels his head up and around to peek into the corner of the screen, “Watch how you answer that, Chris!”\n \nBuck leans in closer to the screen and says something just for Chris, but Eddie hears it, “Dad thinks I’m an idiot today so we gotta be nice. Show him your picture.”\n \nEddie hits Buck’s shoulder, mumbles something about being a terrible influence, then adjusts to see the phone better, his head now practically resting on the tip of Buck’s right shoulder. With all three of them in full view, Chris rushes to pick up an off-white piece of construction paper and hold it close to the screen, but Eddie can still make out the image.\n \nIt’s a drawing of a building, some red and orange scribbles Eddie assumes to be fire, and then five people dressed in big black suits and hats standing in the front. The one on the end is holding a puppy.\n \nEddie’s emotions are bouncing around his chest, but he manages, “What’s this for, buddy?”\n \n“We had to write about kindness this week at school, and I wrote about you at work,” Chris answers, head peeking out from the side of the picture he’s moved just a little, “So I drew you and all your friends.”\n \n“He added the puppy today,” Buck whispers, nudging Eddie.\n \n“That’s— that’s really awesome, Christopher,” Eddie nods, “Can you make me another one I can bring to work?”\n \n“I want one too!” Buck yells, and Chris pretends to sulk over the work of making two more drawings, but Eddie can tell the kid is over the moon for the firefighter seal of approval.\n \n“Turn the TV off and finish your homework,” Eddie urges, his three minutes edging on four or five.\n \n“And clean your room!” Buck adds, helpfully, and Eddie grins at him, “What? It sounded like the responsible thing to say.”\n \n“Love you, kid,” Eddie waves, and Chris echoes as Buck makes a show of blowing three big kisses right up to the screen, catching Christopher’s laughter up until the second Eddie hangs up.\n \nBuck leans back in his seat, oxygen mask long discarded, and smiles.\n \n“In case you ever needed reminding, you are always gonna be that kid’s hero,” Eddie implores, running and hand through Buck’s ashy hair, “You don’t need to run head first into fire and come out with a dog to prove it.”\n \n“Thanks,” he answers quietly.\n \nEddie just claps him on the shoulder and moves to stand up, head towards the truck to head back to the station.\n \n“I’m sorry to bother you guys, but I just had to say something before you left,” both Eddie and Buck turn at the new voice, and find it coming from a young man perched on the end of the ambulance next to them. He’s in good shape, probably just on the oxygen as a precaution like Buck. He smiles brightly, and continues, “You two have the most adorable family.”\n \nOh. So there’s that.\n \nBuck, for the first time since he literally walked through a burning building, suddenly seems like he’s having trouble breathing. His mouth works open and closed, like the words keep dying before they make sound.\n \n“Thank you,” Eddie supplies, politely, not seeing the need to correct a survivor of an apartment fire on his misunderstanding. He looked so genuinely in awe of them, and Eddie wonders how much he saw, what it looked like to someone so distant from the truth.\n \nThe hope tickles somewhere in his chest again.\n \nHe waves to the man and practically scoops Buck up with him, walks them back to the truck a few steps before saying, “I’m sorry if that made you uncomfortable, I just didn’t see the point in arguing—”\n \n“No, no, not at all,” Buck rushes to say on top of him, waving his hands objectively, “It’s not that, it’s just…”\n \nJust what?, Eddie’s mind screams for an answer, Just another word, family? Or did something about that feel so right to you too?\n\n \n\n“I didn’t mean to look like an idiot back there,” Buck says as they walk after a beat of silence, “I’m usually much better at that, I promise.”\n \nHold on— “That’s happened before?”\n \n“Oh yeah, couple of times,” Buck shrugs, “Remember that elf when we took Chris to meet Santa?”\n \n“She said something to you?”\n \n“Yeah, and I hope you don’t mind, I usually just play along. I did then, but now…” Buck’s hands swing at his sides, like they don’t know where they’re supposed to be, “I don’t know, things are different, so I didn’t wanna overstep or anything.”\n \nEddie thinks for a minute, and he does suppose things have changed a lot in the year since the Santa trip.\n \n“Not a problem at all,” Eddie shrugs, waving to Cap when they make it in sight of the truck, nodding that Buck’s okay, “I mean, if Chris and abuela had any say in it, you’d have been a legal Diaz for a while now.”\n \nHe doesn’t have the mental capacity to stop that before it comes out, hyped on adrenaline and compliments and hope.\n \nBuck kind of likes the answer though, smiling as saying, “And what about you?” Eddie can feel his face heating up, like second-degree scorch levels, “What if you had a say?”\n \nIn all his grace and eloquence and boyish blush, Eddie says, “Get in the truck, Buckley.”\n \n“I’m still buying you dinner,” Buck yells over once shoulder, climbing in before Eddie and chancing a glance back to soak up Eddie’s A-level embarrassing grin, “But a nice answer to that question and I’d be willing to throw in dessert!”\n \nAnd if anyone notices the giddy grin Eddie sports the entire drive back, they don’t mention it.\n \n \n \n \n \n \n \n \n \n \nEddie’s just coming up from cleaning duty, washing up the trucks and reorganizing one of the supply closets (doesn’t take a genius to guess who’d had the responsibility just before him.)\n \nIt’ll be dinner in a minute, and Eddie’s looking forward to the break. They’ve had an exhausting week, call after call, and today was one of their first slow days in a while. Bobby jumped at the first chance in days to get everyone to properly sit down and eat. No one really had to be asked twice.\n \nHe’s checked in with Carla and Chris, gotten pictures of his science fair project ranging from the delivery there to the mess deposited on their kitchen table after school, ignored in favor of a celebratory ice cream trip with Carla and abuela. And honestly, whenever his thoughts are on Christopher, the kid takes up about 99% of his concentration points. But he happens to catch a few words of a conversation in the kitchen on his way up the stairs.\n \n“You sure, Cap?”\n \n“You gave me more trouble with that ego of yours back when you first started,” a bundle of laughs, “I’m sure.”\n \nEddie’s not a serial eavesdropper, he promises, but they’re not being quiet and it’s not eavesdropping if he just happens to hear a casual conversation between friends when he’s walking to the couch.\n \nTheir backs are to him, Bobby and Buck, leaning against the kitchen counter, and Eddie can tell by the way Buck’s shoulders are tensed that he’s trying to knot his fingers together in front of him, a nervous tick Eddie’s become attuned to.\n \n“I don’t really know who knows, but it seems like the kind of thing I’d mess up, and I didn’t wanna put you or him or anyone else in a difficult situation if, you know,” Buck shrugs, “Something ever did come up.”\n \n“You know, surprisingly, this is one of the things that actually gets to be all about you,” Cap offers, a reassuring nudge to Buck’s shoulders, “Your feelings are what matter here, what you can handle and what you’re comfortable with.”\n \nBuck drops his chin, and Eddie almost catches a glimpse from a smile when his head turns to look at Cap, “Weird to hear you say that. Can you go back to mean, over-protective Bobby for a minute?”\n \n“This is still me being over-protective,” he affirms, though it sounds like he’s smiling too, “I’ve got your back on this, in here and out there, wherever you need me.”\n \n“Yeah, Hen told me I could tell you,” Buck sighs, “I wanted to, thought you probably knew, but she just...”\n \n“We love you, kid, all of us,” Bobby says warmly, “Some more than others, apparently.”\n \n“Oh gross, I regret it already,” Buck squirms away teasingly, and the look Bobby gives him, it guts Eddie, cuts straight through his heart, so open and trusting and loving.\n \n“You come out whenever you’re ready, no rush. And other than outdated HR relationship forms for when you do, nothing, and I mean nothing, Buck, has to change.”\n \nEddie feels his whole face catch fire, and he suddenly feels awful for his eavesdropping casually overhearing this specific and apparently, abundantly personal conversation. He’s been situated on the couch for a while but sinks back further into the cushion in his dread.\n \n“Thanks, Cap.”\n \nHe slaps Buck’s shoulders and nods, starting towards the stairs, “Table ain’t gonna set itself, kid.”\n \nAnd Eddie’s never seen Buck that happy about setting the table in all the years he’s known him.\n \nBobby has run down the stairs, for what Eddie isn’t sure, only that it leaves Buck free to turn around and catch—\n \n“Eddie?”\n \n“Hey,” and it’s Eddie’s turn to attempt to knot his fingers together.\n \n“You hear that?”\n \nEddie twists his lips, “What answer do you want to hear?”\n \nBuck chuckles softly, “I’m sorry, that was just... It was just for me to feel better. I’ve been talking to Hen and you know how often I mess up this job and for once I figured, I should get ahead of it while I can,” he huffs.\n \n“You don’t have to explain anything to me, Buck.”\n \n“I know, and I know it’s all still new and changing and I’m the only person in the world who probably panics over shit like this so I didn’t wanna bring you down with it,” Buck paces behind the kitchen counter, and Eddie wants, no needs, to fill that space. He stands and slots himself next to the blonde, offers a hand.\n \nHe offers a hand. Buck traces the lines on his palm with delicate fingers.\n \n“I’ve only officially come out to like three people before, and I feel like shit that one of them wasn’t you, because even though like, — thought I owed it to you anyway but— I don’t know. And this wasn’t how I wanted to do it either. Thought you had ten more minutes on tire shining.”\n \nEddie shakes his head, his palm curling under Buck’s gentle touch, “Buck, it’s okay.”\n \n“You’re not mad?”\n \n“I’m not mad, not even a little,” Eddie sighs, when it looks like Buck still doesn’t get it, “You want me to prove it? Like I do with Christopher when he thinks I’m mad at him?”\n \n“Mostly just because I’m intrigued by how you convince an eight-year-old that grumpy face of yours isn’t angry.”\n \nEddie scoffs, turns his shoulders a little bit towards Buck, who’s still shyly tracing the tiles on the floor with his eyes, “Tell me someplace close to here.”\n \n“What?”\n \n“Just do it,” Eddie nudges.\n \n“Okay,” Bucks eyes flit back and forth, like he’s really thinking about it, and a big heavy exhale, “The bunk room.”\n \n“Okay good, the bunk room,” Eddie hums, “Couple hundred steps to get us from there to here, right?”\n \n“Yeah,” Buck nods.\n \n“That’s how much I could ever be mad at you, a couple hundred steps,” Eddie says lightly, shoulder rising and falling nonchalantly, “And if I walked there, and came back to you, I probably wouldn’t even be so mad anymore.”\n \nBuck is quiet. He quirks up a brow, “Is that supposed to make me feel better?”\n \n“You gotta ask why.”\n \nHe rolls his eyes, but humors him, “Why?”\n \n“Because I’d miss you,” he says simply, “That whole way there and back, I’d wish I was right here.”\n \n“Am I supposed to ask why again?”\n \n“I do this with an eight-year-old Buck, asking why is like a primal reflex.”\n \n“Okay, why would you miss me?”\n \n“Name someplace really far away,” Eddie leans into Buck’s shoulder, “Farthest place you can think of.”\n \nBuck lets out a small laugh, his chin hanging, “Jupiter.”\n \n“Damn that’s a good one,” Eddie nods, “Christopher’s only ever gotten as far as the moon.”\n \nBuck laughs, genuinely, and the amount of stupidly obvious feelings he’s about to put on the line are all worth it for that moment alone. Buck doesn’t know the game he plays with Chris, he could get away easily, make something up. But maybe hope is gnawing at him a little too brightly today to not give in, just for the moment.\n \n“So imagine all the distance from we are right now, in this kitchen, and all the way to Jupiter,” he steadies himself with a breath, looks directly into Buck’s swimmingly blue eyes, “Can you imagine that?”\n \nA slow nod.\n \n“That’s how much I love you.”\n \nEddie is sure, if you ask him where he’d do it, it wouldn’t be leaning against the kitchen counter in the loft of the firehouse.\n \nBut damn if it isn’t magical.\n \nEddie can feel Buck’s sharp intake of breath, can feel the loss of air on his cheek, and the flooding of pink tinge that crowds his features there instead. His eyes don’t move, his hands don’t nervously knot, he just looks at Eddie, and Eddie looks at him, and he’s sure. He’s so sure.\n \nAll the space in the world couldn’t amount to how big this is, whatever this is between them.\n \n“When you love someone that much, being mad never wins, no matter what.”\n \n“Kinda actually wanna ask why for that one.”\n \nEddie breathes for the first time in a minute, in the form of a laugh, “I could walk to Jupiter and back and still be giving you reasons.”\n \nBuck’s first breath is shaky, and suddenly he’s got a hand wiping at the corner of his eye, “Shit, Eddie, I’ve got a table to set and you’re making me cry.”\n \n“Wasn’t the intention.”\n \n“Yeah well, that’s what happens when you’re sappy as fuck,” Buck bounces on his feet, and even though he’s teary, that usual energy that surrounds him and the space he takes up returns, and all feels right in the world.\n \nThe sky is blue. The moon is in the sky. Buck is happy. Eddie is in love with him.\n \n“If it helps, I’ll set the table?” Eddie offers to his bubbling, teary-faced and laughing best friend.\n \n“I was gonna make you do that anyway.”\n \n“You can look at really cute pictures Carla sent me of Chris at the science fair today while I do it?”\n \n“Yeah, that’ll do it, hand him over,” Buck turns, a smile on his wet and shiny cheeks, “You wanna bring him over tonight?”\n \n“Why don’t you come to ours,” Eddie smiles, already moving to grab plates, “I have a better couch.”\n \n“How’s your floor?”\n \nOh, to be young and stupidly in love. To Jupiter and back.\n \n \n \n \n \n \n \n \n \n \n“I told you that you didn’t have to come.”\n \n“And I told you,” Buck leans over from the passenger seat, “That I wanted to.”\n \n“I’m going grocery shopping, not to the movies,” Eddie turns out of the station parking lot after a shift one day, shopping list in hand and, a very optimistic Buck in tow, “I could still drop you off at home first.”\n \n“No, no, let’s go!” Buck waves him on, like the motion itself will get him to move the car towards their destination, “It’ll be fun.”\n \nEddie laughs at the thought, shopping being fun, while he turns on the radio, the car hitting the road.\n \n“So, I like spending time with my b— I like spending time with you, sue me!” Buck clears his throat, but the thought is still received, and makes Eddie’s stomach flip, “Don’t care where we have to do it.”\n \n“We spend all day together.”\n \n“Yeah, but you’re a lot nicer to me out here,” and Buck immediately goes to change the station.\n \n“Hey, don’t—” Eddie starts to object when Buck’s fingers hover, but decides to pick his battles, “Fine. You can pick the music.”\n \n“See?”\n \n“Just know if you put any sugar in my shopping cart, we won’t be eating it until you’re there to put Chris to bed after.”\n \n“Deal,” Buck nods, “Still owe the kid a sleepover anyway.”\n \n \n \n \n \n \n \n \n \n \n“Buck…”\n \n“I got you, I got you!”\n \n“I don’t think— shit!”\n \n“Language, Edmundo,” Buck inches his face just a breath away from Eddie’s, and whispers, “There are children here.”\n \n“Yeah, and I’m with the biggest one.”\n \n“Shut up and hold my hand, you big baby,” Buck swivels on his feet and reaches for Eddie’s hand again, that keeps slipping from his grasp every time they move so much as an inch. “Tell me how we repelled down from the side of a cliff today, but this is what does it for you.”\n \n“We all have our fears.”\n \n“Ice skating?”\n \n“Are you gonna hold my hand or what?”\n \n“Don’t have to ask me twice,” Buck slips his fingers between Eddie’s, only has to pry one hand away from its white-knuckled grasp on the wall.\n \nEddie considers maybe being afraid of ice-skating for the rest of his life. (Wouldn’t be too much of a stretch, this shit is actually terrifying.)\n \nYou’d never be able to tell from the expression on Buck’s face though, as he glides backwards in front of Eddie, hands locked between them, alternating between humming Christmas music and laughing.\n \n“You’re gonna get wrinkles man,” Buck laughs and presses a thumb to the crease between Eddie’s brows, like he could push the worry away, “You don’t believe I’ll catch you if I fall?”\n \n“I don’t want to fall in the first place.”\n \n“I won’t let it happ— woah!” Buck stumbles on his feet and Eddie is sure his life prematurely flashes in front of his eyes as they wobble on the outskirts of the rink, but then—\n \n“You asshole.”\n \nBuck is almost crying he’s laughing so hard, clearly enjoying the joys of messing with Eddie on this, as they skate perfectly again.\n \nYou might not even be able to guess Eddie hates this, at the rate he’s shooting heart eyes at the man in front of him.\n \n“That was mean.”\n \n“I’m sorry, I’m sorry,” Buck apologizes between laughs, pulls their interlocked hands up to his face and kisses the top of Eddie’s, “Think about the super cute hot chocolate we’re gonna drink when we get home.\n \nEddie rolls his eyes as Buck swings to the side and instead, links them, arm in arm and side by side, still clutching Eddie’s hand tight to his chest.\n \n“C’mon, with the itty-bitty marshmallows inside,” he practically squeals with delight recounting the purchase he made when he tagged along to go shopping the other day.\n \n“If we leave now, you can have all of my itty-bitty marshmallows,” Eddie involuntarily leans into Buck’s shoulder, but the other must take it as a sign of giving in, enjoying it.\n \n“One more lap?” He wagers.\n \nAnd like Eddie was every gonna say no.\n \n(He steals all his marshmallows anyway, leaning over the counter with heir mugs between them, their foreheads pressed together while Buck fishes around Eddie’s drink with a blue plastic spoon, giddy and warm and wonderful.)\n \n \n \n \n \n \n \n \n \n \nEddie has stopped counting all the times people have ignored him and Buck, because frankly it had been driving him insane, and the logic behind wanting to get teased for having a crush on your best friend who probably doesn’t reciprocate never really worked out in his head so. Here we were.\n \nTotally not caring that he just walked into work with Buck, wearing his LAFD t-shirt because he spent the night and didn’t wanna wake up early enough to go home to get his own, both holding coffee cups with the same sloppy Diaz order name on the side.\n \nNot caring one bit.\n \nReally, truly, Eddie could not care less. He barely even thinks about it. Doesn’t think about the fluttery feeling in his chest when he sees Buck holding a cup with his last name like its his own. Doesn’t think about how one smile from Hen would ripple the swarm of fluttering repercussions.\n \nBecause it’s not weird, not weird at all, that it feels like he’s getting closer to Buck and the ‘get a room’ comments have an exponentially opposite correlation.\n \n“Thanks for the coffee,” Buck presses his hand onto the small of Eddie’s back, tips the cup in a small salute as he passes behind him to the opposite side of the locker room.\n \n“Thanks for the shirt,” Eddie hums, because he’s thankful, obviously, and not at all to get a reaction.\n \n“Looks better on you.”\n \nIf there was a reaction, Eddie’s too busy with his own.\n \n \n \n \n \n \n \n \n \n \n“Tell me again, why we thought this was a good idea?”\n \n“You thought it was a good idea,” Eddie buckles under the weight of another laughing fit, hands covered in flour in his kitchen and absolutely no good explanation for how it happened (he wasn’t even sure there was flour in this recipe), “I said let’s go to the grocery store and buy mini cupcakes for Chris’s bake sale tomorrow.”\n \n“I didn’t think you could be this bad at cooking and baking!”\n \n“Am I really that bad?” Eddie looks at them, up and down, and Buck’s eyes follow, “You know what? Don’t answer that.”\n \n“I’d drive you to the store but…” Buck shakes something out of his shirt, sugar or baking powder or one of the other ingredients Eddie didn’t even know he had in his house until tonight.\n \n“…But we look terrible.”\n \n“I don’t know,” Buck shrugs, eyes dancing across Eddie’s face, “All that flour, you’re kind of rocking the gray hair look. Nice to know you’ll age spectacularly, shocking no one.”\n \n“So you’ll still love me when I’m old and gray?”\n \n“You know it, baby,” Buck runs a hand through aforementioned gray floury hair before bumping Eddie to the side to check their cupcakes in the oven, “It looks promising.”\n \n“Don’t lie.”\n \n“I’m not!”\n \nEddie crouches down level with Buck to peek into the cloudy glass front of his oven, and sees half the tray is about to burn over to a crisp and the other few are mysteriously… bubbling?\n \n“Okay maybe I lied a little bit,” Buck pinches two fingers together, “But they’ll be edible?”\n \nEddie corners him with a look.\n \n“I’ll buy some donuts on the way to work for you tomorrow?”\n \n“Better answer.”\n \nBuck laughs and falls back to sitting on the tile floor of the kitchen, arms slung over his knees, “I didn’t even know bake sales were a real thing. I’d give Chris the $20 for a science museum ticket myself to avoid this.”\n \n“Yeah well, not every fourth grader has a Buck to spoil them rotten,” Eddie counters, leveraging himself with a hand on the counter to stand up, scrape some cake batter off the handle of the oven.\n \n“Do you think anyone would prefer to put their money into baking supplies rather than just buy the ticket?”\n \n“Most parents know how to follow the instructions on a box of cupcake mix,” Eddie smirks, picking up the box and tossing it at Buck’s head.\n \n“It’s not my fault you’re so distracting!”\n \n“I’m distracting?”\n \n“That’s what I said,” Buck states, leaning forwards to tug on Eddie’s pant leg, pull him back down towards him.\n \n“You’re the one who kept trying to get cake batter on my nose.”\n \n“Wait until we break out the icing,” he grins mischievously, and Eddie feels like maybe he got accidentally placed in the oven too, his face feels so hot, “I think aqua blue funfetti is gonna be your color, Diaz.”\n \n“What are we gonna ice?” He ignores his sly compliments, tries not to think about the implications too much, “Nothing normal is coming out of that oven when it rings in five minutes.”\n \n“So pessimistic,” Buck knocks on the oven window, “I see one good one already.”\n \n“We need at least twelve.”\n \n“There’s only nine spots in the pan.”\n \nEddie hangs his head with a dejected sigh, before grabbing a handful of flour and tossing it at Buck on the flour.\n \nHe’s met with an exasperated gasp, “Eddie!”\n \n“I’m stressed,” he says, by way of explanation, “It’s a stress response for me to bother you.”\n \n“Are you stressed all the time?”\n \n“I bother you all the time?”\n \n“Just about, yeah,” Eddie turns to face Buck, and he doesn’t think you should be allowed to say something like that and smile like Eddie hung the moon for him while he does it.\n \nBuck grabs Eddie’s hand and pulls him back down.\n \n“Sometimes you don’t.”\n \n“Only sometimes?” Eddie catches himself, a hand on either side of Buck’s hips as he drops laughter into his shoulder.\n \n“Can think of a few instances,” Buck nudges him forward, so he can lean back and see all of him, both men still consumed by child-like glee, in a mess of baking ingredients on Eddie’s kitchen floor.\n \n“For instance?” It’s a dangerous game to play along to, his feelings bubbling so close to the surface, like they could spill out all over the place like poorly mixed cupcake batter any second. But he’s looking at him like that, and maybe bad decisions are a stress response too.\n \n“Suddenly, I’m coming up blank,” Buck teases, his eyes tracing all over Eddie’s face, he can feel it.\n \nEddie hmphs in disagreement, biting his bottom lip.\n \n“Oh, you got,” Buck nods, his voice so gentle in the inches between them, “You got flour on your nose.”\n \n“That doesn’t bother you?”\n \nEddie watches the corner of Buck’s mouth quirk up ever so slightly, then he picks up his hand from where it had been resting on Eddie’s leg, and swipes his thumb gently across Eddie’s nose.\n \n“Not anymore.”\n \nHe swears he can hear his heart beat, Buck’s too, the second Buck’s hand comes down and his eyes flit up to his eyes, down to his mouth. They’re so close, Eddie knows he hasn’t imagined it.\n \nThe silence in the kitchen is louder than it has ever been, thrumming in Eddie’s ears, clouding all rational thought and urging him, begging him, to give into it.\n \nHe feels his breath hitch, feels Buck’s fingers on his chin and it’s so quiet you could hear pain drop.\n \n“Would it bother you if I—”\n \nOr, you could hear the oven timer go off.\n \nBuck’s released breath is hot on his face, when they’re both startled out of their trance enough to jump back a foot, look at the cupcakes that are supposedly done.\n \nEddie’s glad Buck says something, because he’s lost his voice, “Does it smell like something’s burning?”\n \nEddie props himself up on his toes, carefully pulls open the oven door, and is hit with another gust of heat, this time in the form of smoke.\n \nThey both cough and sputter away from the door, jumping to their feet, and pushing the smoke in the way.\n \n“Now that’s familiar,” Buck laughs lightly, leaning up to open the window behind the sink.\n \n“I don’t think it’s normal that we’re more comfortable handling dangerous smoke than a box of cake mix,” Eddie surprises himself with his even tone, while Buck, for all his wit Eddie knows he has, seems to be trying to manually push the smoke out the window, “What are you doing?”\n \n“I am not letting the smoke detectors go off so we can have Bobby, or worse, Chim, coming down here to put out my cupcake fire,” Buck continues and with his back turned to him for a moment, Eddie runs a hand down his face.\n \nNo smoke detectors go off, no fire departments are called, and every last cupcake ends up in the garbage. But Eddie still feels like something is on fire. For a guy that literally puts out fires for a living, he sure is terrible at smothering whatever has his cheeks still burning up, ablaze under just the memory of Buck’s gentle touch.\n \nBuck eats a spoon of blue vanilla frosting and pinky promises Chris and Eddie that he’ll buy something for the bake sale tomorrow morning, dips his pinky in the tub of icing before he does, much to Christopher’s giggling delight.\n \n \n \n \n \n \n \n \n \n \nFor once, Eddie’s thankful for the ignoring.\n \n \n \n \n \n \n \n \n \n \n“Hi, I’m here for—”\n \n“Maddie and Howard?” The nurse smiles fondly at Eddie from her place behind the counter at the station.\n \n“Lot of visitors?” Eddie chuckles, tucking the pink blanket under his arm.\n \n“Rotating them through all day,” she passes a visitor sticker across to Eddie.\n \n“You must be sick of us.”\n \nShe shakes her head lightly, “Best part of my job, knowing that little girl is already so loved.”\n \n“You have no idea,” he takes the sticker and peels off the back, places it on the corner of his jacket.\n \n“Third room down on the left.”\n \n“Thank you,” he whispers, to keep the happy lull of the delivery floor in tact, before starting down the hallway. When he reaches the door it’s already open, but he knocks very gently twice anyway.\n \nA couple sets of eyes spot him immediately.\n \n“Look who’s here!” Maddie coos, her smile almost too big to fit on her face, “It’s your Uncle Eddie!”\n \nEddie’s got a grin to match at the name.\n \nHe waves and whispers a hello, and upon further inspection, sees that Maddie’s empty handed in the bed. He looks over at Chim, who immediately warms at Eddie’s entrance (though Eddie’s willing to bet he hasn’t dropped that giddy smile all day, he remembers the feeling).\n \nHe hugs his friend tight, “Welcome to team, Dad.”\n \n“Still so weird to hear,” a third voice sounds, “Chim’s a dad.”\n \nEddie finds Buck in a chair next to his sister’s bed, so close to her he could be in the bed with her, smiling down at a little bundle of pink in his arms, even as he teases Chim. Good to know some things never change, no matter what life throws.\n \n“Now I know why Buck wasn’t answering my texts on what room you guys were in.”\n \n“You found us alright,” Buck grins, looking up at Eddie, his knee bouncing lightly.\n \n“Yeah, no thanks to you,” Eddie huffs, but looks back at Chim, hands him the blanket, “For you.”\n \n“Little small for me, Diaz,” Chim jokes, and Maddie yells at him to be nice.\n \n“I know it’s boring but, its useful,” Eddie points, turning between Maddie and Chim, but adds in a knowing sigh, “Chris picked out a fun gift. Insists on delivering it to you personally, though.”\n \n“Oh, is he coming?”\n \n“He’s very very excited to come,” Eddie starts, “Which is exactly why I did not bring him day one. He’s got a lot of energy and I know from experience that’s the last thing you need today.”\n \n“Eddie, you’re my hero,” Maddie states, a hand clutched to her chest, “And it’s a beautiful blanket. You didn’t need to get us anything though, let alone two gifts.”\n\n \n\n“Course I did,” he shoves his now empty hands in his pockets, nudging Chim before stepping slowly over to where Buck sits, the newborn swaddled and perched precariously in his arms.\n \n“He’s just trying to beat me out for best uncle,” Buck whispers to his sister, before looking back down and smiling, “But we all know who’s gonna win!”\n \nChim’s phone rings and he dramatically stalks towards the room’s exit, waving his phone to them, “Albert’s here. And somehow ended up on the transplant floor.”\n \n“We’ll be waiting!” Maddie waves, as Chim steps out to find his lost brother, and Eddie can hear him already exasperated on the phone. He laughs lightly before crouching down in front of Buck’s chair.\n \n“Hello there,” Eddie hasn’t had practice with his newborn voice in years, but it comes surprisingly quickly, and fills him up with warmth, “Nice to meet you, pretty girl.”\n \n“Gets it from me,” Buck whispers and Eddie shoves him lightly, careful not to move the baby, before reaching a finger out, tickling her tiny feet.\n \n“She’s beautiful, Maddie,” Eddie says, “And so good. Christopher cried for the first three hours, I think.”\n \n“I hate to admit it, but she really likes her Uncle Evan,” she giggles.\n \n“Seriously?”\n \n“My child is not calling you Uncle Buck,” her voice laced with faux distress, and Eddie assumes they’ve been having this argument for a while. But there’s no bite to it, the siblings gently ribbing at one another while they pass smiles at this precious newborn Buck’s still holding. It makes Eddie’s heart swell\n \n“She can call me whatever she wants.”\n \n“Even if it’s Evan?”\n \n“Yeah, even that,” he coos, tucking his nose down a snuggling it over her tiny forehead. Eddie’s still got a finger smoothing out the wrinkles of her little blanket, and there’s not much that could tear his gaze away from her, but Buck is making a pretty strong case.\n \nFrom the moment Eddie had walked into the room, Buck was staring at his new niece with such a strong sense of awe and wonder, seemingly mesmerized by her tiny fingers and her little puffs of breath. He’s so attentive to her, even just a couple hours old, holding her gently, bouncing her softly on his knee and whispering to her every few minutes, like they’re in their own little world.\n \nThere isn’t a word strong enough for Eddie to describe the feeling, how endeared he is to the scene. It pulls at something Eddie hasn’t thought about in a while, melts him and pulls him up solid again all at once.\n \nIt should be illegal to ever see the person you’re hopelessly in love with holding a baby.\n \nIt’s like asking to go into cardiac arrest.\n \nBuck must catch Eddie staring at some point, knocks his toes into the tip of his with a soft, “What?”\n \n“Nothing, nothing,” Eddie waves, because that’ll really prove it’s nothing, when its really everything, “Just happy.”\n \n“Yeah?” It’s such a genuine question, Buck’s eyes pouring into his, Eddie has to bite the inside of his cheek to keep from blurting something stupid and blowing his cover, or worse, waking the baby.\n \n“Yeah,” Eddie nods, letting the little girl hold onto his finger, “Not surprising in the slightest that you’re just as good with kids eight hours old as you are with the eight-year-old ones.”\n \n“Lot easier when they’re both so cute,” Buck hums, and Eddie feels his gaze drift to where the newborn holds Eddie’s finger, “Looks pretty good on you too.”\n \n“Oh my god, I’m sick of these hormones,” Maddie laughs from the bed, wiping at a few tear tracks falling from her eyes.\n \n“Maddie, no,” Buck warns, “Because if you start, then I’ll start—”\n \n“I can’t, Evan, it’s just so,” she hiccups in her happy-tear laughter, “You’re perfect and she’s so perfect and I’m so happy!” She reaches forward and squeezes Eddie’s cheeks adoringly, like he’s her baby brother too.\n \nAnd Eddie thinks, he wouldn’t mind, to be a part of this little family, in any way. Would choose it, in a heartbeat.\n \n“I keep losing my phone…” she pats around her bed and blankets, head twisting as she searches.\n \n“What do you need your phone for?” Buck asks, and tacks on with signature Buckley wit, “Everyone important is here.”\n \n“Chim’s not here,” Eddie whispers.\n \n“Yeah, but we know where he is,” he counters.\n \n“I wanna take a picture,” she clarifies, lifting up her blanket, and then— “Oh, got it! The three of you,” she waves them together, like she’s orchestrating, “Smile!”\n \n“Can she smile yet?”\n \n“Of course she can smile,” Maddie scoffs, scrolls on her phone as she dismisses her brother, and Eddie tries to object.\n \n“Oh I don’t— It should just be—”\n \n“Sit down and get in the picture, Eddie,” Maddie says, “Or I could make you guys Uncles Evan and Edmundo.”\n \n“Oh, she went to the full name?”\n \n“She went to the full name,” Buck laughs as Eddie repositions himself, an arm around Buck’s chair and a finger still clutched in the girl’s grasp.\n \n \n \n \n \n \n \n \n \n \n“He has books in the bag that he’s supposed to be reading for school, but I made him finish all his other homework before we came. I put 20 bucks in the front pocket for pizza and washable markers, because he kept asking if he could draw pictures with you?” Eddie shakes his head furiously, a confused look etched on his face that translates to the fact that he just wasn’t gonna fight it anymore, “Oh and he’ll probably try to stay up all night to impress you, but he’s gonna pass out at like, 9, so, I put pajamas in there too.”\n \n“Aye, aye, captain,” Buck salutes, one arm perched on the doorframe, “Will that be all?”\n \n“Yes,” Eddie nods, turning to leave before he’s late, but then— “No, actually. Thank you.”\n \n“Not necessary, would do it even if you didn’t need me to,” Buck smiles, “You know I love hanging out with him.”\n \n“Still, thank you,” Eddie looks down at his watch, he’s got a half hour to get top Chris’s school on time for his parent-teacher conferences at 7 (the stress of scheduling that feeling like months ago.)\n \n“You clean up pretty nice for a school night, Diaz.”\n \n“Shut up.”\n \n“I mean it,” Buck reaches out, pulls at the collar of Eddie’s dress shirt, his fingers splayed across his shoulder, “You should get dressed up more often.”\n \n“Yeah, I’ll remember a tie next time we have pizza and beers on your couch.”\n \n“I wouldn’t object,” Buck winks, and he’s making it so hard to leave, that stupidly charming boyish smile, his hands still on him.\n \n“I have to go,” Eddie pouts, but makes no move to leave.\n \n“We’ll behave, I promise.”\n \n“Pinky?”\n \nBuck holds up a fist, his pinky out towards Eddie.\n \n“Okay, okay, I fucking hate conferences, man,” Eddie shakes his head, turns back towards Buck’s apartment floor hallway, “If they say anything bad about Chris, he’s your kid, fair warning.”\n \n“Sounds good to me,” and Eddie can hear the smile on Buck when he says it, lets it follow him all the way down the hall, until he hears the door shut and the elevator ding its arrival.\n \n \n \n \n \n \n \n \n \n \nIt’s pretty late by the time Eddie has finished seeing every teacher he had to meet with, fought his way out of several PTA pitches and uncomfortably awkward conversations with parents Eddie’s never seen before, so Buck’s texted him that he left a spare key at the front desk to pick up so he could let himself in whenever he got home.\n \nHome.\n \n“Evan’s partner?”\n \nEddie is startled by how quickly he’s recognized by the man working at the lobby desk, but nods anyway.\n \n“I’ve heard a lot about you, seen pictures too,” the older man smiles, slowly turning to unlock a large gray case on the wall behind him with the spare keys, then winks, “All good things.”\n \n“Oh, I’d hope so,” Eddie laughs lightly, nervously shoving his hands into his pockets, “Though I apologize, that you get stuck with him talking your ear off.”\n \n“Makes my day,” the man says, swinging the case door shut, “My husband is just like him. Never shuts up.”\n \nIt makes Eddie laugh again, as he takes the key from the counter, ignoring the way the parallel tugs at his heart.\n \n“You have a good night, Mr…”\n \n“Diaz, Eddie Diaz,” Eddie reaches a hand out to shake, and the old man takes it with such a bright smile.\n \n“Nice to finally meet you Eddie, you have a wonderful night.”\n \n“Thank you,” he waves, as he steps over to the elevator.\n \nIt’s a quick trip up, so he doesn’t have too much time to dwell on the conversation, the implications of it and how Evan’s partner probably didn’t mean work partner, or how Eddie didn’t bother to correct it.\n \nHope flickers again.\n \nBefore he realizes it, he’s unlocking Buck’s door stealthily, seeing the kitchen and living room lights are turned off, and the apartment is quiet. He locks up, tosses his keys on the counter, hangs his jacket on an open hook and kicks off his shoes. It’s so wonderfully domestic, Eddie’s embarrassed the pattern makes him smile so wide. He tries to cover it up with a shake, get it out of his system, before he tip-toes further into the apartment.\n \nHe’s about to go up the stairs, assuming with the lights out they were asleep, when he hears one very familiar giggle come from the living room, behind Buck’s couch.\n \nIf Buck and Chris know he’s home, they make no indication of it when he reaches the end of the room, arms crossed and leaning on a beam on the edge.\n \nThey’re both laying down on their backs, heads closest to where Eddie stands behind them and feet stretched towards the window. They’re whispering to each other, troublemakers they always are when they team up together.\n \nHis heart clenches at the sight just as he sees his son point up at the ceiling, Buck’s gaze seeming to follow it.\n \n“Got a name for that one, Buddy?”\n \n“That’s abuela’s star.”\n \n“Perfect choice,” Eddie hears Buck say, like he’s committing it to memory.\n \nEddie peeks up to get a look at whatever they’re looking at and he sees it, stars, all over Buck’s living room ceiling. There’re little green neon plastic stars stuck all over the place, lighting up in the dark of the apartment.\n \nEddie suddenly remembers a car ride one day, not too long ago, Chris in the back and Buck in the passenger seat on his right, when they were coming home from dinner. Chris had asked them why they couldn’t see the stars in the sky here, but they could in Texas. He remembers rattling off some answer, good enough, it satisfied Chris, but Buck had looked so heartbroken. Eddie teased him, said he could spoil his kid all he wanted, but he’d have to draw the line and literally putting the stars in the sky.\n \nBut hell if he didn’t do it. Hang the stars in the sky for him.\n \nHoly shit, this man.\n \nEddie’s choking back something grossly emotional while he lets them continue, gazes on in wonder and adoration.\n \n“Do we have the Big Dipper?”\n \n“Hmmm,” Buck pretends to ponder the thought loudly, “You know, our galaxy is a little different than the Milky Way.”\n \n“Oh, right.”\n \n“But you know what we do have?”\n \n“What?”\n \n“A Little Dipper!” And suddenly Buck curls on his side, and tickles his fingers all over Chris, who squirms in gleeful protest.\n \n“So, I’m the Little Dipper.”\n \n“You are, my man,” Buck hums, their laughter only slightly petering out while his tickle attack ceases, “Where’s your star gonna go?”\n \n“Right…” Chris points around for ammonite, then stops, “There.”\n \n“Right next to the TV, closest to the video games,” Buck smiles, “Smart kid.”\n \n“You want your star to be next to mine?”\n \nBuck gasps, like he’s literally just won the lottery, “Really?”\n \n“Yeah, really,” Chris beams at the prospect of making Buck that happy.\n \n“Well okay then, if you say so,” Buck points up happily, “That one?”\n \n“Yeah.”\n \n“You know,” Buck starts softly, “We gotta give your dad a star before he gets home. We can name it the Grumpy Dipper.”\n \nChristopher’s laugh floats and bounces off the walls.\n \n“Okay, okay fine,” Buck concedes, “Dad. Where we putting him?”\n \n“Next to you,” Christopher states simply, as if the answer were obvious.\n \n“Of course,” Buck agrees, like maybe it was.\n \n“So you’ll stay next to daddy forever.”\n \nIt wasn’t a question, but Eddie can see Buck roll his head to the side, and take a big deep breath, looking at Christopher, “Yeah kid, forever.”\n \n“Daddy says he loves me to the moon. I think I love you to the moon too.”\n \n“No way! That’s a lot,” Buck pretends to marvel at the distance, stretching his arms out wide like he can hold the space himself, making Chris giggle at his side, “Do you know how much I love you?”\n \n“How much?”\n \n“Stars and back.”\n \n“That’s a lot too.”\n \n“Sure is.”\n \n“How much do you love dad?” Christopher asks quietly.\n \n“How much do I love your dad...” he says it so gently Eddie almost misses it, stills his breathing, wants to lean in close and hug the moment to his chest but is so afraid to break the magic that he stays still.\n \nIt’s quiet for a moment, as Buck thinks, then says, “What’s the farthest place you can think of?”\n \n“That’s what dad asks me, Buck!”\n \n“Well, I’m borrowing it!” he laughs, ruffles a hand through Chris’s curls.\n \n“The moon, I think.”\n \n“Christopher, I’d love your dad even if I was stuck all the way on the moon.”\n \n“Really?”\n \n“Yeah, doesn’t matter how far I have to go,” Buck whispers, “I’d love him the whole way.”\n \n“I’m glad you’re not on the moon though.”\n \n“Yeah, me too,” Buck kisses the top of Chris’s head, “Kinda like it here.”\n \n \n \n \n \n \n \n \n \n \n“You’re unbelievable.”\n \n“They’re from the dollar store.”\n \n“You hung stars on your very expensive loft apartment ceiling so my kid could stargaze.”\n \n“They’re stickers, I could take them down tomorrow if I wanted.”\n \n“But you’re not going to.”\n \n“Don’t you wanna stargaze with us?”\n \n“In the morning?”\n \n“Sleep over again. I have it on good authority the floor’s pretty comfortable.”\n \n“My eight-year-old gets your king-sized bed and I’m on the floor?”\n \n“He loves me to the moon, Eddie!”\n \n“And I love you to Jupiter, your point?”\n \n \n \n \n \n \n \n \n \n \nIn hindsight, it should have happened a lot sooner. But Eddie’s grateful to whatever powers that may be that pushed it back at least 20 minutes.\n \nThey’re doing clean up on a call, no major injuries, just a down power line, a tree, and a car that’s seen better days. The call itself was generally stress-free, but it came at the end of a long week of long shifts, and everyone was reaching the end of their patience.\n \nEddie is working with Buck, Hen, and Chim to clean up some glass from the broken car windows on one side of the street when he sees an older woman approach Buck.\n \n“Excuse me, are you the medic?” she asks, brows knitted in worry.\n \nBuck looks around to check she’s actually talking to him, and shrugs, his jacket bouncing on his shoulders.\n \n“I was walking my dog by the tree that went down, I’m fine but one of the officers told me to find the medic to get checked over anyway,” the woman clarifies, “Tall young firefighter, I think she said? Brown hair?”\n \n“Oh, you’re looking for my partner, Eddie,” Buck sighs in understanding, and points over to Eddie. He waves, with a small smile. Buck leans over to the woman and pretends to hide his next comment behind his hand, a glint in his eyes, “But don’t let his good looks fool you, he’s actually an old man.”\n \n“Both plenty younger than me!” the woman laughs again.\n \n“Well, since you’re here and looking fantastic,” Buck slicks on the charm, kiss ass, “I can walk you over to the ambulance, check you out and get you cleared to go.”\n \n“Well, aren’t you a sweet thing,” she croons as Buck makes a show of extending his arm out to her for a proper escort, she turns back and smiles at Eddie sheepishly, “Sorry, I might steal him from you!”\n \n“You keep him!” Eddie waves, but from the look on Buck’s face when he says it, you’d think it sounded more like I love you.\n\n \n\nThey’re starting to walk away, leaving the three of them smiling, but Eddie happens to catch the tip of their conversation, “How long have you and your partner been together?”\n \nBuck grins at the conversation topic, practically skips across the street in answer, “Almost a month technically, but feels longer.”\n \n“That’s how you know he’s a keeper,” the woman pats a hand on Buck’s bicep, “I won’t actually steal him from you.”\n \nThe sight is sickeningly sweet to watch, Buck with the sweetest woman on his arm gushing about their love lives and the weather and rainbows probably, it’s that good.\n \nBut all Eddie hears is white noise.\n \n“Kid is stealing our jobs,” Chim laments, sweeping up another pile of glass.\n \n“He’s got moves, I’ll give him that,” Hen chuckles, and glances over at Eddie for his comment, and finds him frozen in place, “You good, Eddie?”\n \nHe chokes something out like, “Why’d Buck say we’ve been together a month?”\n \n“Damn, has it been a month already?” Chim whistles.\n \n“But we’ve been working together for 2 years.”\n \n“Don’t think that’s what she meant, Eddie,” Hen laughs lightly, but Eddie stays frozen. Slightly worried, she tacks on a half-serious, “How long you’ve been together. Dating.”\n \n“But me and Buck aren’t dating.”\n \n“Yeah, and I didn’t have a kid with Maddie,” Chim rolls his eyes, and Hen joins in with laughter, “Hen, are you not married to Karen either?”\n \nAnd it should feel nice. Eddie’s literally run through hour long tangents in his mind on why the world was worse off when his friends weren’t teasing him about his feelings for his partner.\n \nBut something about this time feels different.\n \nHen must catch on to it too.\n \n“Oh shit, you’re serious?” Hen sputters, then slaps at Chim’s shoulder, “Chim, I think he’s being serious.”\n \n“No way, we were all there when Buck asked you out!” Chim yelps, and Eddie could do a spit take, a really good one, like slo-mo and sound effects and all, “I mean, not there there, but, Hen and I practically pushed him down the stairs to do it.”\n \n“I don’t know what you’re talking about,” Eddie’s voice doesn’t even feel like his own, “Buck’s never asked me out.”\n \n“You guys went to dinner! Right?” Hen is trying to explain, and Chim is nodding furiously along with her, “You’re like, really being serious about this Eddie? Because if you are, Buck really thinks—”\n \n“Are you being serious?” Eddie balks at the concept, because there’s no way, it couldn’t be, he’s not—\n \nHe hasn’t been dating Buck for a month without knowing.\n \n“I swear,” Hen says, “Eddie, you know we like to make fun—”\n \n“Exactly! You guys are always going on about ‘when’s the wedding?’ or ‘get a room’ and making those eyes,” and Eddie can’t get his thoughts to just focus for a minute, “And then you just stopped!”\n\n \n\n“It’s not as fun when it’s true!”\n \n“It’s not true, though,” Eddie feels like he’s just run a marathon.\n \n“No wait, I don’t know what Chim’s reason was, but I stopped because I was being respectful of a very new relationship,” Hen warns with a glace sideways, “We were so happy for you two idiots!”\n \n\nHey, don’t thank us, we didn’t do anything. Just really happy for you. You deserve it.\n\n \n“I’m not dating Buck,” Eddie keeps his resolve, because in the catastrophic mess that is his life it’s one of the only things he knows, clings to the prospect of changing, “I want to be dating Buck, but I know I’m not. Because he doesn’t— it’s not—”\n \n“He asked you out!” Chim almost knocks over their bucket of collected glass, and Eddie is again grateful this conversation waited until the very end of a call, “Multiple times. You kept going on dates. Believe me, I’d know.”\n \n\nOh that’s right, you had your dinner last night, Maddie mentioned it. You have a nice night?\n\n\n \n\n“Don’t you think I’d know?”\n\n \n\n“The whole world knew! Of course we thought you knew.”\n \nEddie’s suddenly on his feet, pacing, trying to get into some sort of rhythm that makes the world feeling it’s spinning on its axis again.\n \n\nDid you know Buck was seeing someone?\n\n\n \n\n\nWas I not supposed to?\n\n \nThis has to be the most cosmically cruel joke the universe has ever played on someone. The world’s most elaborately played prank. A lifetime of karma. Something. Anything. That’s the only thing that could make sense.\n \n“Buck!” Eddie searches for a reprieve, some kind of normalcy, Buck is his best friend, this much he knows, “Buck, can you tell Hen and Chim that we aren’t dating? Please.”\n \nBuck stumbles back the last few steps, his energy dropping with his smile, as he sides up next to Chim. He looks blankly at Eddie, “Are you breaking up with me?”\n \nSomeone mutters a holy shit.\n \n“I can’t.”\n \n“Because we’re on a call?”\n \n“Because we’re not dating.”\n \nBuck sputters at the phrase, gestures wildly between Hen and Chim for help they cannot offer him. Eddie watches his chest rise and fall, rise and fall.\n \n“You’re not joking? Because you’ve joked about this before, so I just wanna—”\n \n“Why would I joke about this?” Eddie isn’t sure he can keep his voice level for much longer, a flurry of emotions Eddie can’t pinpoint raging inside him.\n \n“The girl after the bus crash, I said I was taken and you said—”\n \n\nDidn’t know you were seeing someone.\n\n\n \n\n“I said I’d cook you a fancy dinner and you were like—”\n \n\nIs it my birthday or something that I’m missing?\n\n\n \n\n“I brought you to couples brunch with Maddie and Chim, and you thought—”\n \n\nSounds like a you problem.\n\n\n \n\nHoly shit. Holy shit. He’d been friend-zoning his boyfriend.\n \nEddie lets out a shaky breath, because what the actual fuck, man, “You’ve never called me your boyfriend.”\n \n“I didn’t think you liked labels!” Buck defends, his emotions reading wildly across his features, his gestures, his pacing, unlike Eddie who has yet to move, “You haven’t really dated since I’ve known you and I didn’t wanna make you uncomfortable.”\n \n“How come I’ve never taken you on a date?”\n \n“You have!” Buck all but yells, and Eddie’s so thankful the scene is cleared, “You buy me dinner and drive me to work and I— I’ve stayed over at your house.”\n \n“On the couch, Buck!”\n \n“I was being respectful.”\n \nAnd goddammit Eddie never thought common courtesy could be so mindlessly infuriating.\n \n“We’ve been dating a month, right?” Eddie counters, searching for some reasoning here, “And we’ve never kissed?”\n \n(Didn’t need to know that, Chim whispers, somewhere.)\n \n“Was I supposed to spring it on you without your consent?” And Eddie sees it, the tensed shoulders, the fingers he’s knotting together, like stressed-out clockwork, and he wants to run over and hold his hands, let him trace the lines on his palms and breathe, “Eddie, I was doing everything in my power not to fuck this up. I’d wait a year to kiss you if I had to. I already waited two!”\n \nHold on—\n \n“I thought we were gonna kiss the other night, in your kitchen, but we didn’t and it was fine,” Buck shakes his head, “I didn’t even know you were interested until I went to ask you out that morning after you— shit.”\n \n“What?”\n \n“Buck, you okay?”\n \n“The gym, you were working out,” Eddie watches as Buck takes a few steps back, his voice low, his words calculated, “You were waiting for a text from abuela about parent-teacher conferences, and you said—”\n \n\nFinally.\n\n\n \n\nEddie doesn’t think there’s any air left in his lungs. His mind reels, the pieces fall into place, but Eddie’s chest is tight and unmoving.\n \n“Police got the rest of the scene covered, we’re good to go,” Bobby is the first once to break the trance the four of them have sunk into when he approaches, after what to Eddie feels like hours of silence, of knowing, of wanting. He must feel the tension immediately and offers a wary, “Everything okay here?”\n \n“Just fine, Cap,” Eddie is surprised that Buck is the first one to speak, bouncing on his toes and turning to run away quickly, “Mind if I ride in the ambulance?”\n \n“Buck—” Eddie takes his first step forward.\n \n“There’s a woman I was helping before,” Buck’s eyes are trained only on Bobby as he explains, “Just wanna make sure she’s okay.”\n \n“He can take my spot,” Hen offers up easily enough when Bobby doesn’t answer, obviously sensing there’s more to this than Buck just being a good person.\n \nChim follows along without missing a beat, swiftly clapping a strong and reassuring arm around Buck’s shoulders, “C’mon Buckaroo. I’ll let you press the sirens.” Eddie’s glad that earns them a weak smile from Buck.\n \nBobby still doesn’t seem satisfied, but nods Hen and Eddie along anyway, and they start towards the truck. Eddie doesn’t even feel like its his own body taking the steps, making the movements, climbing into the seat next to Hen, watching her shut the door.\n \nHe does hear something Buck says to Bobby just before he’s inside though.\n \n“Told you I’d mess it up.”\n \n \n \n \n \n \n \n \n \n \nSo here’s how it happened:\n \n“We’d been trying to get him to do it for months, I’m not really sure what about that specific day made him finally cave, but, Chim’s right. We practically pushed him down the stairs to do it.”\n \n“Months?” It’s all Eddie can stick to. Buck had said two years, two years he’d waited—wanted— to kiss him.\n \n“We only picked Buck to wingman instead of you because once Buck gets an idea in his head he goes all out with it. We knew he’d do it, and we knew you’d say yes to him,” Hen offers a supportive smile, “And you did, you just—”\n \n“Had no idea,” Eddie finishes.\n \n“Buck has that day practically memorized, you made him so happy,” Hen sighs, “I generally did more of the coaching, Chim was mostly a counteractive nagging big brother type of thing. But he recited the whole conversation word for word to us.”\n \n“I had headphones in,” Eddie explains, “I was listening to music, and I was waiting for abuela to text me, and I was so distracted. I mean, I heard him ask me to get dinner, but we do that all the time! I—”\n \n(He later finds out he missed half of the sentence, do you wanna get dinner, as like, a date, just the two of us.)\n\n \n\n“I thought he was asking me what time I got the conference.”\n \nThe Tuesday seven pm slot. Thursday at seven. Their date. That was their date, that was—\n \n“I brought my son to our first date.”\n \nThere’s a beat of silence in the truck, where Hen sits across from him, and then.\n \n“I’m sorry,” she’s sputtering, a hand covering her mouth to shield her laughter, “I’m sorry, it’s not funny.”\n \nBut eventually Eddie catches a case of the giggles too, throws his head back and laughs brightly, “It’s pretty funny.” It’s calming, in a way, to give into the lunacy of the whole thing just for a minute, alone in the ladder truck with a friend.\n \n“But he really liked it,” Hen says, when their laughter has mostly subsided, “You should have seen how he came barreling into me the next day, talking about his cooking and your movie night and Chris and his flowers.”\n \n“Heard that was your idea.”\n \n“Thought it would make it seem more like a date,” Hen shrugs, “He’s got good intentions but, he could’ve used the nudge in the right direction.”\n \n“I’m so stupid.”\n \nIt’s easier to backtrack now, his mind a little clearer, and catch all the things he missed. All the signs, the looks, the coincidences. The whole time he was looking for them from his friends, his coworkers, their teasing as proof that he had hope, when he should have been looking at Buck. Buck, bless his heart, had been giving him all the signs, the coincidences, the touches and the laughs and the looks. He’d given him everything. And Eddie had chocked it all up to hopeless romanticism.\n \n“No, no you’re not,” Hen places a reassuring hand on Eddie’s knee, “And besides, it shouldn’t matter now. We all heard you.”\n \nI want to be dating Buck.\n \n“Like he’s ever going to talk to me again,” Eddie huffs, “I’d never talk to me again.”\n \n“I’m not gonna lie, he might distance himself for a bit,” Hen says to Eddie’s downcast expression, “But it doesn’t matter how far he gets. That boy loves you. And when you love someone like that, you always come back.”\n \n\nDoesn’t matter how far I have to go, I’d love him the whole way.\n\n \nFor the first time in a while, Eddie clings to something other than unfounded hope.\n \n \n \n \n \n \n \n \n \n \nHen is right. Not that Eddie ever expected her to be wrong. In anything, but especially this.\n \nBuck returns in the ambulance with Chim about an hour after Eddie’s been in the station, sitting on the bench by the punching bag, waiting, a seat open, just in case.\n \nHe runs right past him and up to the loft, yelling some wild story Eddie would love to hear.\n \n \n \n \n \n \n \n \n \n \nEddie doesn’t get much time to dwell on it all, even though he knows he’d just work his mind over in circles, running laps of what ifs and why nots and how’d I miss this.\n \nHe goes home after that shift and is asleep almost instantly, can’t remember a single dream he had when he wakes up the next morning, rushing around at the last minute in his usual style. He gets Chris out the door with a bag of cereal and a wrinkled shirt and his body barely awake by the time he drops him off at school. It hits him suddenly, that he hasn’t been alone in his car in a while. Buck had been in the passenger seat more often than not, changing the radio, playing games with Chris, sneaking his hand across the center console to gently touch Eddie in all his glorious tactile affection Eddie had mistaken for really good friendship. (Hen had had another good laugh at that one in the truck yesterday.)\n \nWhen he gets to work, he tries to separate himself from it, because he knows the last thing he needs is for this to affect his work, his job. He’d overheard Buck having that conversation with Bobby in the kitchen, how as long as it didn’t, nothing had to change.\n \nHe climbs up the stars two at a time, eager for what, Eddie isn’t sure, but finds Chim and Hen leaning against the kitchen counter, light conversation flowing over their mugs of warm coffee.\n \nBobby tells Eddie that Buck called out sick.\n \nAnd it’s a lie for him, Eddie knows.\n \nHe apologizes to Bobby and he brushes him off, says he doesn’t know why he’s apologizing. But he squeezes his shoulder before leaving and Eddie knows that he knows.\n \nThe shift is not particularly bad, none of the calls even venture into the realm of it, but everything’s worse today. Just is. The 118 is gentle with him for it, and he doesn’t know why, since he’s clearly the bad guy here.\n \nHe jumps down the steps two at a time to leave.\n \n \n \n \n \n \n \n \n \n \n“Chris, Carla?” Eddie drops his bag off by the front door, barely mustering up the energy to kick his shoes off with it, “I’m home.”\n \nJudging by the time, he knows dinner must be over, Chris’s homework finished, kid might have even showered and got his pajamas on. On a normal day, he’d jump into the room and pick up wherever Carla let off, keeping a routine in place, but after the day he’s had, Eddie has no qualms about scooping his son up and hugging him tight for the whole five minutes he knows he’d let him (you’re tickling me, dad!) and huddling up on the couch, watching movies and eating ice cream and sleeping in late on Saturday morning.\n \nThe universe, in all its cruel jokes, has other plans.\n \n“Dad!” Eddie is immediately brightened by a small pair of arms wrapping around his legs, runs a hand through the curly hair nestles into his stomach.\n \n“Hey kid, you have a good day?” He feels the gentle pressure of a nod, “Where’s Carla?”\n \n“She had a stomach ache,” he answers, simply.\n \n“Oh,” Eddie nods, keeping the confusion out of his voice, “Is she—”\n \n“Chris, I cannot find your Superman blanket, we’re gonna have to use—” Eddie looks up, finds none other than Buck walking out of the bedroom hallway, holding a bright blue blanket to his chest.\n \n“Buck?”\n \n“Chris, why don’t you go get this set up on the couch,” Buck looks anywhere but Eddie, leans forward and tosses the blanket to Chris, “Pick a movie your dad would like.”\n \n“Buck…” Eddie starts again, not sure how he’d finish the thought.\n \nHis son saves him the trouble though, as he runs off, high-fiving Buck as he passes.\n \nBuck rubs a hand nervously at the back of his neck, and says softly once Christopher is safely far away and in the living room, “I’m sorry, I uh, I meant to text you, it just—”\n \n“It’s okay,” Eddie rushes to say, for him to know. It’s okay, all if it, every last thing.\n \n“Something came up, Carla had a doctor’s appointment, or something, and apparently,” Buck lets out a wheeze of a strained laugh, “I’m next in line on the school’s guardian roster.”\n \n“You didn’t have to—”\n \n“I’d do it in a heartbeat, Eddie, no questions asked, you know that,” Buck drops his arm, pushes his hands into his pockets instead, “Always liked Chris better than you anyway.”\n \nAnd Eddie laughs. Buck does too.\n \n“Are you feeling better?”\n \nBuck arches an eyebrow.\n \n“Bobby told me you were sick,” Eddie clarifies, “You feeling better?”\n \nThey both know that’s not what he’s really asking about, but Buck answers anyway.\n \n“Yeah, false alarm, I think,” he clears his throat, “But lucky, so I could be here.”\n \n“Thank you.”\n \n“Course,” Buck shrugs, “Do you think you could come up with some reason for why I had to leave?”\n \n“Buck—”\n \n“Because I’m fine, it’s just, I have to leave,” he crosses the space they’re standing, squeezes through the small opening next to Eddie to get to the front door, so careful not to touch him, like he could set the whole place on fire if he did, “And I don’t want Chris to think I’m leaving just, that— that I have to leave.”\n \nHe wants to fight it. He wants Buck to stand there and say he is leaving, he wants Buck to yell at him, and hate him for all the stupid signs he misread, how he humiliated them in front of their friends on a call, how this has ruined every bit of their friendship.\n \nEddie is searching for a reaction.\n \n“I can do that,” his voice is so low, and gravelly, like he could cry at any moment.\n \nBuck nods, swallows slowly, turns for the door again, and Eddie wants to stop him.\n \n“Did you really not know?”\n \nThe sudden question stuns Eddie into another bout of silence.\n \n“The whole time, everything I did, did you really not know?” Buck isn’t looking at Eddie yet, but he can tell his eyes are glassed over, and his fingers, twisting knots.\n \n“I’m so sorry, Buck. All the dates—”\n \n“No, not— not that there were dates,” Buck shakes his head, takes a steady breath, “Did you really not know how much I cared about you?”\n \nHe wants to scream no, he didn’t know, but he hoped, he hoped through every smile and gentle touch, every car ride and teasing flirt, every late night and early morning, he hoped that the intention behind them meant even half of what Eddie wanted them to.\n \nHe doesn’t say anything though. Because as much as he craves a reaction, he’s so scared. That he fucked the whole thing up. That they cannot come back from it, despite anyone’s reassurances otherwise.\n \n“Hey, Eddie,” is all Buck says, when the silence stretches too long, “Closest place you can think of?”\n \nEddie chokes out something between a laugh and a sob.\n \n“Front door.”\n \nBuck nods, his lips half pursed in a smile, “Night, Eddie.”\n \n \n \n \n \n \n \n \n \n \nChris, obviously, asks where Buck’s gone the minute Eddie throws himself on the couch. Eddie hadn’t come up with a single good answer.\n \n“You’re hogging the blanket,” is all Eddie grumbles, pulling Chris’s small blue blanket up over his knees, sinking into the couch cushions. Eddie hadn’t had many relationship ships in his life, few with proper ‘break-ups’. He assumes this is what one feels like. He wants ice cream.\n \n“What movie did you pick?”\n \n“Waited for you and Buck to come back,” Christopher tosses the remote into his father’s lap.\n \nAnd well shit, here goes nothing, “Buddy, Buck had to go home.”\n \n“Oh,” Chris exclaims, “Why?”\n \n“Because…” Eddie searches for answers in whatever cartoon in playing on the TV screen, his eyes not daring to look at the puppy dog pout he knows Chris will be wearing, “Because we had a little fight.”\n \n“Why?”\n \n“Grown up stuff,” he ruffles his son’s hair, “Don’t worry about it.”\n \n“It’s okay to be sad, Dad. You said so,” Chris offers, snuggling in closer to Eddie’s side, like he knows that’s what he needed, “But Buck didn’t seem sad today.”\n \n“Because he didn’t want you to be sad, kid.”\n \n“Why would I be sad?”\n \n“Because Buck knows how much you like hanging out with him. And we might not for a little while, that’s all.”\n \n“Why?”\n \nGood lord, with the whys, “Because Buck didn’t wanna be best friends anymore, and your dad didn’t know that,” he huffs, “Now do you wanna pick a movie?”\n \n“It’s okay if you’re not best friends, Dad, I already knew that.”\n \n“How’d you know that?” Eddie resists the sudden rise of panic in his voice.\n \n“Abuela told me.”\n \nAnd well, he takes a note from Chris on this one, “Why?”\n \n“You ask a lot of questions, Dad,” Chris giggles, pulling the blanket back to his side of the couch.\n \n“Well can you answer them for me?” Eddie reaches a hand over to where he knows Chris is most ticklish. He’s a man on a mission at this point, he’s not ashamed to go to extreme measures.\n \nWith an exasperated huff Chris says, “I was mad at you that you didn’t let me go to ice skating with Buck. Because we always do stuff together. Because we’re best friends. But abuela said ice skating wasn’t for best friends, and you and Buck weren’t best friends now so that’s why you didn’t take me. And then I wasn’t mad anymore.”\n \nAnd isn’t it wonderful to know the universe got his grandmother and his son in on the joke too.\n \nEveryone knew Eddie was dating Buck. Except for Eddie.\n \nChris hasn’t taken his eyes off the screen the entire time, much more interested in whatever category of Netflix he’s browsing than the fact that he just gave his father more insight on his relationship than he could figure out himself. Like it wasn’t a huge deal.\n \n“Don’t worry, Dad, I can still be Buck’s best friend.”\n \n“Course you can, kid,” Eddie wants to cry at the sweetness of the whole thing, kisses the top of Chris’s head. “You can come ice skating with us next time, if you want.”\n \n“Gross, no,” Christopher sticks out his tongue and crinkles his nose, making Eddie laugh, “Then Buck wouldn’t know it’s a date.”\n \n“Buck knows they’re dates, just not that your dad wants to keep having them.”\n \n“Forever?”\n \nEddie thinks about the sight of his son curled up on the floor of Buck’s apartment, measuring their love in distance to the stars on his ceiling.\n \n“Yeah kid, forever.”\n \n“Then you should tell him that.”\n \nMaybe, Eddie figures, at this point in the game he should be taking all romantic pointers from his infinitely wise beyond his years eight-year-old.\n \n“You think so?”\n \nChris nods, peeking up at Eddie quickly under his glasses, “Just pinky promise him for forever. You can’t break a pink promise.”\n \nHe says it like it’s that simple, and maybe it is.\n \nWith a big exhale, Eddie wraps an arm tighter around him and looks up the TV, “Let’s watch Toy Story, huh? Your dad has a lot to learn about friendship.”\n \n \n \n \n \n \n \n \n \n \nWhat finally does it is when he shows up to his abuela’s house the next night for family dinner.\n \nHis aunt opens the door, all warmth and smiles and kisses, pushes Chris inside, backpack already open and ready to spill his markers on the floor to color with them, but she stops suddenly after placing two sloppy kisses on Eddie’s cheeks.\n \n“Just you?”\n \n“Try to reel in your enthusiasm there,” Eddie drawls sarcastically, as he starts to step into the house.\n \n“Ay, be quiet Eddito,” she pushes him teasingly on the back of the head, “I just thought your boyfriend was coming. I made him my soup he likes, to take home, I know you don’t feed him well.”\n \n\nBoyfriend.\n\n\n \n\nHis mind is racing, he barely registers anyone still speaking, his aunt yelling to abuela in the other room, “Guess you could bring it home to him, oh, I’m so bad with names, what’d you say it was, Isabel? Evan?”\n \n“His name is Buck, tia,” Chris tilts his head, grinning from his seat at the table, “And daddy’s sad because he still thought they were best friends.”\n \n“Best friends?” his abuela chooses now to come into the room from the kitchen, a sly smile on her lips, flourishing her spoon around in the air for effect, “This one I gotta hear.”\n \nEddie isn’t sure how long it takes for all his thoughts to settle, for him to see only one answer, but he’s got three people smiling t him when he does.\n \n“Hey, Chris? You wanna sleep over abuela’s tonight?”\n \n \n \n \n \n \n \n \n \n \nHe arrives outside Buck’s door that night without beer or an eight-year-old, but with a pinky promise instead.\n \nAdrenaline got him here and nothing else. But now that he’s standing in front of it, he’s scared shitless.\n \nHe worked up a laundry list of things to air out, all the things he wanted to say, all the ways he loved him. Because there’s so much, so much he knows he could say, wants to say, has to say, and it still would never be enough. He spent the whole drive here backtracking the last month, hating himself for missing so much, for yearning for something he had and making himself believe he didn’t.\n \nBut when Buck opens the door, all that comes out is a whispered, “Yes.”\n \n“Eddie?”\n \n“Yes,” he tries, with more conviction this time, trying to steady his breathing.\n \n“I don’t—”\n \n“You asked me if I wanted to get dinner, just the two of us, like a date, so I’m saying yes.”\n \n“Eddie, you don’t have to—”\n \n“I have wanted you to ask me that question for longer than I remember, and I can’t believe I was too busy listening to heavy metal to hear it,” Eddie shakes his head, “Because the answer is yes.”\n \n“I know you feel bad about it, but I told you it’s fine, Eddie,” Buck’s entire demeanor is slouched, retreating, defeated, “I misread, and I made things weird. And I’m sorry I don’t have a better explanation for you right now but I thought I had until work on Monday to figure out what to say—”\n \n“I don’t want to wait until Monday,” Eddie huffs, “I know you said you’d wait forever for me but I’m done waiting.”\n \n“Eddie—”\n \n“Stop saying my name like I’m leaving,” Eddie says, open and raw and earnest, “I’m not leaving, I just got here. I know I’m late, I know it looks like it took me longer but I’m here.”\n \nBuck looks like he’s going to say something again, probably just another iteration of his name, but opens and closes his mouth, wraps a hand around the edge of the door.\n \n“I am really bad with feelings. I’m bad at understanding my own and understanding other’s and making sense of them, of sharing them the right way, of even feeling them at all I think,” Eddie feels like pacing, but stays locked on Buck’s blue eyes, “But dammit, Buck, I feel so much. I feel everything for you.”\n \nBuck’s lips part in a small gasp of air, “Everything?”\n \nEddie laughs, repeats like a vow, “Everything.”\n \nThat doesn’t feel like enough though, and now that he’s started, he doesn’t want to stop.\n \n“I feel happy when I see you, when you come running in through my front door, when you smile at me hanging upside down off my couch during movie night. I feel relieved when you run out of a scene unharmed, I feel anxious when you take too long. I feel tired when you keep me up all night, texting me facts about whatever shit you’re mindlessly researching that night but I feel special that you chose to text them to me, that I keep your nightmares away,” Eddie chokes back heavy emotion, dancing his eyes over Buck’s unreadable face.\n \nEddie continues, “I feel like you’re a pain in my ass, most of the time,” earning him a laugh, “But I feel like it’s worth it. I feel calm when you hold my hand in the car like it’s nothing, I feel like a seventh grader with a crush when you borrow my shirts, and I feel downright smitten when I think about you kissing me.”\n \nBuck opens his door a little wider.\n \n“I feel so many things I don’t have words for, things that emotions don’t exist to describe yet. When I see you with Chris, the way you talk to him and hold him and teach him, make him a part of your world and love him so unconditionally that I feel like we could never deserve it. When I see you in my kitchen in the morning making yourself coffee, asking what I want for breakfast, and feel like this is the life I’ve been missing out on. When I watched you put your niece to sleep in your arms, bounce her in your lap and dote on your sister and Chim like their happiness in that moment made the world spin and you were gonna keep it that way, how I felt like I’d have six more kids just to have them with you like that. How you find me in any room we’re in and make me feel like I made the room worth being in.”\n \nBuck bites his lips together, his eyes finding their way back to brightness, “Six kids?”\n \n“What, you want seven?”\n \nBuck laughs, swings the door out with the motion.\n \n“And mostly, for the last month I have felt hopeless,” Eddie starts again, seriously, “Like I was seeing things that weren’t there, like I was making up all these feelings in my head, like if I asked for everything I saw to be real, that I’d be asking for things you couldn’t give me. So I didn’t ask for anything at all. Because I’d rather have you at a distance, like, the moon, than not have you at all.”\n \n“I thought,” Eddie adds on, when Buck just continues to stare into him, “that everything was normal. I had no idea you had changed our relationship, and I thought it was all still a part of friendship. It drove me crazy, thinking if even this didn’t cross the line, I’d never get you without anything short of a waxing romantic confession. And even then, I wasn’t sure that would work. So I kept it all to myself. And I have no idea what to do next, other than to ask for you to ask me out again so I can say yes. Because I have never wanted something more than I want this with you. I want the first date and the second date and the bad dates and the early mornings and getting you a toothbrush for my bathroom and embarrassing Chris, hell I want the white picket fence and a dog with you, newspapers on our porch when we’re old and gray— I want everything with you, man.”\n \nSilence stretches between them, Eddie counting every beat of his heart while it does. It never slows down, even as time does. Eddie has never put his heart on the line before, has never felt to vulnerable, like he could rip at any moment, and he puts himself actively in the line of danger in work every day. This is infinitely scarier.\n \nIt’s felt like years since anyone’s said anything, and Eddie can hear Buck’s TV playing softly in the background.\n \nBuck looks down, then up, at Eddie’s lips and then his eyes, and says, “That has to be the most romantic thing anyone’s ever said, not just to me, but to anyone in the world,” Buck swallows, “And you ended it by calling me man.”\n \nEddie releases a breath he didn’t know he was holding.\n \n“Are you not a man?”\n \n“I am,” Buck giggles, honestly giggles and Eddie’s been a goner for a while but holy shit if he’s not falling hard and fast, “And it worked, in case you were wondering.”\n \n“What worked?”\n \n“The waxing romantic confession,” Buck winks, “You’ve got a future in rom-coms, if the firefighter thing doesn’t work out.”\n \n“Thanks.”\n \n“Anytime.”\n \n“This is some really nice banter we’ve got going on here, like really, A+ effort,” Eddie rolls sarcastically, “But I heard we’ve both been waiting two years for something...”\n \n“God, Edmundo, at least let me buy you dinner first,” Buck quips, reaching out to grab Eddie’s hand and pull him closer.\n \nEddie’s eyebrows jump up.\n \n“Can I please take you out to dinner?”\n \n“Just the two of us?”\n \n“Like a date,” Buck whispers, close enough that Eddie can feel it more than hear it.\n \n“Finally,” Eddie whispers back, before closing the gap.\n \nEddie isn’t sure how he ever thought kissing Buck would be (which, is a lie, he’s thought about it plenty) but nothing abstract could compare to the real thing.\n \nHis chapped lips fold into Eddie’s, the softest pressure when they meet exploding into something fervent and all-consuming suddenly. The floodgates open and so do Buck’s lips, coaxing Eddie’s into his, teeth biting bottom lip. Eddie seeks purchase in the hem of Buck’s shirt, his fingers wringing, wrapping around his waist as Buck’s fingers dance over his shoulders, wrap around his neck and twist circles into the nape. They don’t stop kissing through it all, the shuffle of feet, the laugh Buck leaves on Eddie’s lips when he tries to pull him closer, hip-check the door shut, the breath Eddie leaves in Buck’s ear as he works gentle kisses across his jaw, as Eddie feels pricks of energy at every point of contact he has with Buck’s body.\n \nHe kisses him again and again and again because he can and he’s so self-indulgent about it because he can be. Eddie licks Buck’s bottom lip and memorizes the hitch of breath, Eddie tracks his fingers into one of Buck’s back pockets and relishes in the gentle nudge on he gives him, Eddie traps Buck against the wall next to his now shut front door and breathes in his scent, kisses him again, their teeth clinking together because they both can’t stop smiling.\n \nIt sends him to the moon.\n \n“I love you,” Buck rushes into a breath before Eddie can capture his lips again, “I can start building the white picket fence tomorrow.”\n \n“You can’t be real,” Eddie shakes his head and the faintest movement nudges their noses together, an intimate gesture that makes Buck giggle, “Seriously, I don’t think men like you can exist.”\n \n“I’m case it’s wasn’t already very clear, I want everything with you too,” Buck ignored his rubbing and continues, breathily, not daring to move their faces more than an inch apart, “I’m sorry I had to woo you for a month to get you to realize it, but I’ll woo you for the rest of my life.”\n \n“Stop saying woo.”\n \n“I’ll woo you as much as I please, thank you very much, I happen to rather enjoy doing it,” Buck’s smile glints in the dim hallway lighting, “I’ve got a whole list of dates to take you on now that you’re in on it.”\n \n“I’m warning you, I’m terrible at dating.”\n \n“Are you kidding?” Buck huffs, “I’ve been dating you for a month, you’re fantastic at it.”\n \nEddie kisses him again. And again.\n \n“I love you.”\n \n“So I hear,” Buck teases, his eyebrows quirked and his fingers dancing on Eddie’s lower back, “Though I think eventually you should probably be the one to ask me to marry you, just to avoid any confusion. God forbid I try to pop the question while you’re booking a dentist appointment or something.”\n \n“Do you wanna marry me?”\n \nBuck seems stunned at the immediate question, but only for a moment, before settling into a smile.\n \nEddie asks it like it’s obvious, and judging by Buck’s grin, maybe it is.\n \n“Yeah,” he breathes our gently, before kissing Eddie affectionately all over his face, his cheeks, his nose, between his eyebrows, across his forehead down his jaw.\n \n“You promise?”\n \nBuck pushes Eddie back, one hand gently on his chest, before bringing his other hand up between their faces, his hand balled in a fist with his pinky out.\n \n“I promise.”\n \n“You can’t break that.”\n \n“I won’t.”\n \nEddie links his pinky, kisses Buck square on the lips.\n \n“So, how about that first date?”\n \nEddie tosses his head back in laughter, backing up a full step from Buck to take a breath, shake out his adrenaline and start towards the center of Buck’s apartment, “I promise I won’t bring Chris to this one.”\n \n“Are you kidding, I love Chris!” Buck yells, appalled that Eddie could ever imply differently, “He can come on any date. Promise.”\n \nBut Eddie just gives him a pointed look.\n \n“That’s a really nice gesture, but any date?”\n \n“Yeah, I’m good with animated movie nights and 9pm bedtime for the rest of my life,” Buck smiles.\n \n“Okay,” Eddie nods, “But in case it mattered at all, he’s sleeping at my abuela’s tonight.”\n \nBuck’s back on in with inhuman speed.\n \nAs Eddie’s laughing his way backwards, trying not to trip as Buck eagerly push/kisses him towards his stairs, stopping them for a minute against the kitchen counter, he notices what a mess Buck’s kitchen is. There’s an empty box of tissues, the garbage needs to be taken out, he thinks there’s cold pizza left next to the microwave and—\n \n“Were you eating ice cream before I got here?”\n \nBuck eyes Eddie up and down, before grabbing his hand and dragging him away.\n \nWhile they trip up the stairs laughing, Buck says, “Give me a break, my boyfriend just broke up with me.”\n \n“Oh, so you’re a hot single firefighter now?”\n \n“Taken, just pinky promised on it,” Buck winks as he pushes Eddie back onto his bed, “But if you were willing to confer with the hot part...”\n \nEddie will walk the distance to the stars loving him.\n \nHe pinky promises.\n \n \n \n \n \n \n \n \n \n "
}