{
    "id": "25866676",
    "url": "https://archiveofourown.org/works/25866676?view_full_work=true",
    "author": [
        "meridies"
    ],
    "title": "lovesick (the beat inside my head)",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Video Blogging RPF",
        "Minecraft (Video Game)"
    ],
    "relationships": [
        "Clay | Dream/GeorgeNotFound (Video Blogging RPF)",
        "GeorgeNotFound & Sapnap (Video Blogging RPF)"
    ],
    "characters": [
        "GeorgeNotFound (Video Blogging RPF)",
        "Clay | Dream (Video Blogging RPF)",
        "Sapnap (Video Blogging RPF)"
    ],
    "additional_tags": [
        "Alternate Universe - High School",
        "Friends to Lovers",
        "Online Friendship",
        "Mistaken Identity",
        "Slow Build"
    ],
    "language": "English",
    "series": "",
    "published": "2020-08-12",
    "completed": "2020-10-28",
    "words": "41,697",
    "chapters": "12/12",
    "comments": "2,194",
    "kudos": "23,253",
    "bookmarks": "3,196",
    "hits": "298,312",
    "summary": "<p>After moving to Florida, George relies on his online best friend, Dream, to help him adjust to his new school. But only a few weeks in, George falls head over heels for one of the most popular boys in school, Clay. With the help of his new wingman, Sapnap, and his best friend Dream, George tries to win Clay over.<br>Surely nothing about this will go wrong.</p>\n<p>Slowly but surely, George gets to know everyone at school.</p>\n<p>George likes all of his friends... but perhaps he likes one of them a little more.</p>\n<p>Against his better judgement, George asks Sapnap for help.</p>\n<p>George and Clay get to know each other a bit more. Sapnap is somehow the best and worst wingman at the same time.</p>\n<p>Halloween approaches! Featuring peanut butter cups, friendship, and anonymous candy grams.</p>\n<p>It's George's first Halloween in Florida, and his friends are determined to make it the best Halloween possible.</p>\n<p>George goes on his first study date.</p>\n<p>George takes a leap of faith.</p>\n<p>After a shocking realization, George struggles with how to move forward.</p>\n<p>George is ready to meet Dream, and Dream is ready to meet his online best friend— but will things actually work out in real life for them?</p>\n<p>Winter break arrives, and everything works out.</p>",
    "notes": "<p>if george/dream/sapnap ever say they're uncomfortable w fanfiction, i'll take this down!! </p>\n<p>as a general psa, please do not send this fic to any of the content creators that it's written about, i prefer for my content to remain within the ao3 community. thank you!!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>if you liked this, please leave a comment or kudos! i'll be updating this every wednesday &lt;3</p>\n<p>thank you soo much for all the wonderful comments on the first chapter, u guys really made me so happy &lt;3 enjoy the second one!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>not me making george shorter for the banter... anyway if you liked this, please leave kudos/comments, i love to hear your thoughts!</p>\n<p>sorry that this is a little shorter, ive been figuring out college/dorm stuff all week so i've been kinda busy. enjoy!!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>as always i love to hear your thoughts and reactions, they make my day! :)</p>\n<p>wow you guys really liked the last chapter! hope this one lives up to your expectations &lt;3</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">more notes</a>.)\n</p>\n<p>i saw a lot of ppl asking about updates/refreshing the page waiting for one, so im just letting u guys know that i update every wednesday!! no need to refresh, i promise ill be here weekly &lt;3 i am but a poor college student writing minecraft fanfic to avoid her latin homework. also yall are definitely gonna like the next chapter :)</p>\n<p>u guys keep clowning george for being dumb but dream is just as dumb if not dumber... anyway enjoy!!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">more notes</a>.)\n</p>\n<p>this is random but! if u wanted to know more abt me, my name is meri, i use she/they pronouns and im majoring in english/creative writing!! if u want to, tell me something interesting about urself in the comments!! i would also love to hear ur reactions and thoughts abt this chapter &lt;33</p>\n<p>excuse my terrible knowledge abt how the uk celebrates halloween, im just making it up as i go along.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">more notes</a>.)\n</p>\n<p>if you enjoyed, please leave a comment, i love to hear your thoughts!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">notes</a>.)\n</p>\n<p>as always i would love to hear your thoughts n comments on this chapter &lt;33</p>\n<p>im so glad you all liked the last chapter!! have another one &lt;3</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_8_endnotes\">more notes</a>.)\n</p>\n<p>i would love to hear your thoughts/comments on this chapter &lt;3</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_9_endnotes\">notes</a>.)\n</p>\n<p>as always, i would love to hear your comments n reactions &lt;3</p>\n<p>your reactions to the last chapter absolutely blew me away, oh my god thank u all so much!! i hope this one lives up to your expectations &lt;3</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_10_endnotes\">more notes</a>.)\n</p>\n<p>if you enjoyed please leave a comment &lt;3 very excited for these next two chapters!!</p>\n<p>it's time!! i hope you all enjoy &lt;3</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_11_endnotes\">more notes</a>.)\n</p>\n<p>as always, i would love to hear your comments n reactions &lt;3</p>\n<p>we're finally at the end!! hope you all enjoy this final chapter &lt;3</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_12_endnotes\">more notes</a>.)\n</p>\n<p>thank you all so much for reading, i'm truly so grateful for all of your support, it means the world to me. also, i'm letting u all know that i'm not going anywhere!! i have more fics planned out, so if you want to catch those, u can always subscribe to me on ao3 (shameless self promo). i also have some other fics you can read in the meantime! </p>\n<p>seriously, i never expected lovesick to get this much attention EVER and while it's been very stressful at points i'm super glad that i finished!! and it's been lovely reading along with you all. especially people who have been here since the first chapter (looking at you, ness), you're all so incredible and im very grateful. </p>\n<p>as a final reminder: please do not send this to any of the content creators it's written about in any way. do not compare this fic to others or use it to put other authors down. be respectful and kind!!</p>\n<p>that's it!! again, tysm. this was wonderful. &lt;3</p>",
    "text": "\ngeorgenotfound: im starting at my new high school today\n\n\nHe stared at his phone for a moment, before dropping his hand by the side. He didn’t expect his best friend to be awake yet; it was barely six thirty AM where he lived. George glanced at the alarm clock next to his bed, which read the same time. \n\n\nEven after three weeks in Florida, George’s jetlag hadn’t fully left. He kept falling asleep at odd times during the day, and thus sleeping far too late into the evening. Although it had mostly evened out, his increasingly tense anxiety had haunted him all week, making him wake up earlier than usual. \n\n\nHe checked his phone again, hoping for a reply, but the red dot next to his friend’s name signaled that he hadn’t been online in nearly eight hours. Definitely still asleep, then.\n\n\nSleepily, George dragged himself out of bed and to the bathroom. He glanced in the mirror and grimaced-- his hair was fluffed up in a tousled mess on one side, and stuck too flat to the other. Just what he wanted, a bad hair day to start off the school year. He tried to tug a comb through it and gave up halfway through-- he might just straighten it and be done with that.\n\n\nHis phone buzzed suddenly, left behind on his bed. George eagerly crossed the room to snatch it up. \n\n\nDream had replied.\n\n\ndreamwastaken: you nervous?\n\n\ngeorgenotfound: a little tbh. i don’t know anyone so :/\n\n\ndreamwastaken: im sure its going to go well!! someone there is bound to be your friend\n\n\ngeorgenotfound: i hope\n\n\ndreamwastaken: if i was there i would be your friend &lt;3\n\n\nGeorge stared down at the last emoticon and pressed his hand to his face to try and stop his silly blushing. It was just two little squares of text. It wasn’t that big of a deal. \n\n\nHe and Dream had been friends for nearly five years, ever since George had randomly joined a Discord chat with him in it. They had hit it off almost immediately, and soon began private messaging after that. Slowly, they both opened up to each other slightly; Dream was hesitant to share details of his private life, and so was George. But Dream had talked George through nearly every big event in his life: from awkward middle school crushes, to editing term papers due in half an hour, to his parents’ messy divorce halfway through secondary school. Now, he supposed, it was Dream’s turn to help him through starting at a new school. \n\n\nHe took a quick glance at the time; his school started in exactly forty-five minutes. Enough time to fix his bad hair and eat a quick breakfast. The school was about a ten minute drive with no traffic, and George hardly wanted to be late on his first day. He still needed to pick up his schedule from the administrator’s office and sort out textbooks and locate all his classrooms and…\n\n\nGeorge swallowed hard and left his room. His mother was already in the tiny kitchen; there was a kettle set to boil and a box of cereal out on the counter. She knew about George’s disappointment of moving to America; when he found out about the move due to her new job, he had been quite angry with her. \n\n\nGeorge was quick to go talk to Dream, but only briefly mentioned the details of the situation. He didn’t know where Dream lived, and Dream didn’t know where George lived. So George had only told him that he was being forced to move to a new school, and that he was feeling awfully about it. Dream had done his best to listen and support George as he talked, and slowly, most of George’s anger leached away. His mother was doing his best to make their new home positive, and George had grown to appreciate that endlessly. \n\n\n“First day!” His mother cheered. She ruffled George’s hair with one hand, and set down a milk jug with the other. “Are you excited?”\n\n\nGeorge fought down the same spike of anxiety that happened every time he thought about starting at a new school. Everything he knew about American schools was based off films and television, and they were all needlessly dramatic and over the top. He wasn’t sure what to expect. \n\n\nVaguely, he missed his friends back in Brighton. Back there, he had a niche group of people who were all interested in the same things as he was. Their group had formed as mostly a group of outcasts— as many groups did, at first— but eventually got to know each other.\n\n\nThey had promised to keep in touch with George as he left, but neither George nor them really understood the effort it took to keep up that many online friendships. They had worked better in person anyway, and slowly, they drew apart. For the last few weeks, the only person George had been actively talking to was Dream. \n\n\nIt tended to go like that quite often. \n\n\n“I’m excited,” he said. It wasn’t entirely true, but his mother took it as such. “You’ll drive me there?”\n\n\n“Whenever you’re ready.”\n\n\nGeorge gave her a thumbs-up. He checked his phone again under the table and sent a message back:\n\n\ngeorgenotfound: still nervous.\n\n\ndreamwastaken: don’t stress. it’ll go great. plus i’ll be here if you need to talk!\n\n\nHis mother looked over at him and tsked. “No phones at the table, please.”\n\n\nGeorge gave her his best innocent look and texted Dream again:\n\n\ngeorgenotfound: my mum keeps bugging me to put my phone away at the table\n\n\ndreamwastaken: breaking the rules.. wow \n\n\ngeorgenotfound: you know me :)\n\n\n“George,” his mother repeated, sounding a tad more irritated. “What did I just say?”\n\n\n“Sorry,” George said, not sorry at all, and shoveled a few more spoonfuls of cereal down. “We’ll leave in five minutes?” \n\n\nShe nodded. George went to go rinse out his cereal bowl and dropped it in the sink. His backpack had been sitting in his closet, primed and ready, for the last few days. It was the type of thing that made his nervousness a little easier, having things prepared. Now, he slung it onto his back and looked into the mirror.\n\n\nA tuft of his hair stood up, and George flattened it down. Within a few seconds, it sprung up again. George sighed and gave up on it. He resolved himself to an awkward rest of the day. \n\n\nHis mother dropped him off at the administrator’s office fifteen minutes later, and George stepped out into the Florida sun. Even though it was barely seven AM, the air was already thick and humid with heat. George felt as though he was breathing in steam. How did anyone deal with it? \n\n\nHe checked his phone again for the time and saw that he had about fifteen minutes before the first bell rang. Briefly, George cursed the fact that schools in America started so early. He could already tell that the early start was going to make his mornings hell. \n\n\nTentatively, George introduced himself to the secretary at the front desk as George (the new kid), and then patiently waited as she sorted through file cabinets to find his schedule and a school map. She laid both on the desk in front of herself and briefly pointed out the various wings. George was slightly shocked at how big it was; in Brighton, less than five hundred students went to his school. Here at Lakeside High School, right on the outskirts of Orlando, there were over a thousand students.  \n\n\n“You’ll start off in American History, in room C103, and then you’ll have physics in room A207,” the receptionist explained. “You can ask another student for help if you need it, I’m sure everyone at Lakeside will be happy to help you.”\n\n\n“Sure,” George echoed. He couldn’t imagine anyone being particularly thrilled to help out the dumb new kid. “Uh, where is the C Wing again?”\n\n\nShe pointed down the hall to the outdoors. “The buildings that are painted orange. That’s the history wing. You’ll find that the school is easy to get around.”\n\n\n“Sure,” George repeated. He was colorblind, but he helpfully didn’t mention that. Still, he took his schedule, folded it up, stuck it in his back pocket, and made his way towards the stretch of buildings that the receptionist had mentioned. \n\n\nAmerican History, of course, was when the real trouble started.\n\n\nThere was no seating chart scrawled up on the board, instead the words “sit anywhere you please!” George took advantage of this, being one of the first students to arrive, and placed himself firmly in the back of the room. His plan was to draw the least attention to himself, and the back right corner seemed like the best place to do that. \n\n\nUnfortunately, as the clock ticked closer to the start of the school day, the seats around him slowly filled with kids. George had awfully overestimated his ability to go unnoticed, because evidently everyone wanted a seat in the back. The newcomers were rowdy and loud, and they seemed to all know each other. George wanted to shrink into the corner and turn invisible. Of course, nothing ever went his way. \n\n\n“Hey, you’re new here, right?”\n\n\nSome of the talking stopped, and attention turned to him. George busied himself with taking out his notebooks and pretended not to hear.\n\n\n“Hey,” the guy said, bracing an arm on the back of his chair to turn and look at him. “Are you new here?”\n\n\n“Yeah,” George said, already feeling uncomfortable with the amount of attention on him. He wished they would just leave him alone. “I’m George.”\n\n\n“I love your accent,” someone else said. \n\n\n“Thanks,” George said, feeling more uncomfortable. He felt his face go hot and stared at his desk. There went his chances of making it through the day without having to interact with anyone. \n\n\n“Are you from Britain?” \n\n\n“Yes,” George said. He wished the bell would ring. “I just moved.”\n\n\n“Why did you move? Was it weird? How long was the flight? Are you—”\n\n\n“Oh, shut it, Skeppy,” someone else said, and neatly butted into their conversation. “Please ignore my friend, he’s an asshole. Nice to meet you, I’m Sapnap.”\n\n\nThe friend smacked Sapnap’s arm in mock annoyance. Sapnap pushed him back playfully before holding out his hand. George stared at it for a moment, before slowly reaching out and shaking it. \n\n\n“That’s a weird name,” George said. \n\n\nFor a second Sapnap stared at him, and George abruptly realized that you shouldn’t say that to strangers, but then Sapnap grinned toothily. \n\n\n“I know, right? It’s okay, though. At least it’s interesting.”\n\n\n“Sure,” George said. Sapnap didn’t seem too bothered by George’s comment. He was certainly interesting-- his level of energy for this early in the morning was astronomical. Thankfully, he had also seemingly caught onto George’s hesitation, and leaned back from him. The rest of Sapnap’s friends had mostly left George alone, and went back to talking among each other. \n\n\n“If you are new here, you’ll need a guide.” \n\n\nGeorge gave him a skeptical look, but nodded slowly. Sapnap, apparently, took that as an ‘enthusiastic yes” and began explaining the intricacies of Lakeside High School to George. He had gotten halfway through his elaborate description of the teachers George should and should not interact with (Mrs. Rovai, she teaches Honors Spanish 3, if you have her then good luck—) when the bell rang.\n\n\nTheir teacher entered; she had frizzy hair tied back, wore jeans and a chunky-knit sweater, and upon seeing Sapnap in the back corner, noticeably sighed. George’s eyes flickered between Sapnap and the teacher, and he realized that he had just unwittingly made friends with one of the school troublemakers.\n\n\nOf course that was his luck.\n\n\nThe rest of his classes ran quite smoothly. A few more people tried to introduce themselves to him, but George shied away uncomfortably. The guy Sapnap had pushed away from him— Skeppy— was in George’s physics class, and there were some other recognizable faces in English who had sat next to him in history. The only class he didn’t have with anyone he recognized was pre calculus, his last class before lunch. One teacher asked George to introduce himself, which sent panic spiking through George’s stomach as the entire class turned to look at him, but that feeling dissolved soon after.\n\n\nBefore he knew it, lunch arrived. George shouldered his backpack and realized that he didn’t know where to go-- he had no friends, he barely knew anyone’s names. Was it true that people ate lunch in the bathroom stalls? Did lunch tables actually split up into dramatically different cliques? What was he supposed to do if he couldn’t find a place to sit?\n\n\n“Hey!”\n\n\nGeorge turned, and Sapnap was there. He caught George’s elbow and steered him towards a table out in the open, by the grassy courtyard. \n\n\n“I figured you don’t know anyone yet, so you can sit with us,” Sapnap explained. “You looked a little lost, so I hope you don’t mind.”\n\n\n“I— okay,” George stammered. He didn’t really mind; he was grateful for Sapnap’s cautious friendship, and it was nice to hopefully have a familiar face around. \n\n\n“You’ll meet everyone in our group,” Sapnap continued, taking no note of George’s nervousness. “It’s me, Skeppy, Bad, Ponk, Alyssa, and I think Clay should be there any second— we all sit together at lunch, so now you’re welcome.”\n\n\nGeorge couldn’t stop himself from asking: “Just like that?” \n\n\n“Yeah,” Sapnap said, like it was obvious. “You’re new, and you seem nice, so why not be friends?”\n\n\n“Oh,” George said, and ducked his head. “Okay.”\n\n\nSapnap shoulder-checked him. “Come on, let’s go sit down.”\n\n\nOn their way, Sapnap explained that most people called the courtyard the Green, namely for the wide stretches of grass and overarching trees. The sun was high overhead, but most of the table Sapnap headed towards was nicely shaded. A girl shuffled aside to give George more room as he sat down. \n\n\n“You’re George, right?” \n\n\nGeorge didn’t recognize whoever said it but nodded nonetheless. \n\n\n“The whole school is talking about you,” someone else chimed in. \n\n\nGreat. Just what he wanted. George scratched his ear uncomfortably. \n\n\n“We should probably introduce ourselves,” someone else said, and there was a chorus of agreements. Name flickered by, and George attached them to people’s faces; Skeppy, the same guy from his physics class; Alyssa, who had moved aside to let him sit; Ponk, who gave him a friendly hello; Bad, eagerly sitting forward; and Sapnap, who George had already met. They all seemed very bright and shiny and freshly minted— and they all seemed to know each other quite well, as if they had been friends for years.   \n\n\nCuriously, he saw that no one had lunch, and no one was eating. He tentatively asked why.\n\n\n“The cafeteria food sucks,” Alyssa interjected, “So none of us ever eat there. Are you a junior?”\n\n\n“Yes,” George said. He hoped he was a junior, at least— he had been put into third year classes, and so he assumed that was the right year to be in.\n\n\n“Excellent,” someone cheered. “We can go off campus for lunches.”\n\n\nUpon noticing George’s confusion, Alyssa added, “Upperclassmen can leave campus at lunch. And Bad just got his license, so he can drive us all.”\n\n\n“I mean,” someone else said— George assumed that he was Bad, since Alyssa had just mentioned him— “I’m not technically supposed to drive people until I’m eighteen, so—”\n\n\n“No one listens to that,” Ponk said dryly. “You can drive us until I get my license next.”\n\n\n“Nuh uh,” Skeppy said indignantly. “I’ll be next. I’ve already got my permit.”\n\n\n“Whatever you say,” Alyssa said loftily. The table laughed. Skeppy rolled his eyes, but played along. \n\n\nA teacher passed their table, and quickly, Sapnap pulled the white bandana off his head. George had noticed it before, back in history class— just a simple white band tied around his head. It made him look a little childish but also a little badass. \n\n\n“Uniform violation, Sapnap,” the teacher said pointedly, and gave him a warning glance. Sapnap gave him a classic troublemaker smile, and as soon as the teacher was out of eyesight, tied the bandana back on. \n\n\n“Can’t believe Mr. Davis lets you get away with that,” Ponk grumbled. “You two must be best friends.”\n\n\n“We are,” Sapnap proclaimed. “I’ve never gotten detention yet. Mr. Davis is on my side.”\n\n\nGeorge felt a little bit lost. There was so much happening and so many people were talking, faces and names and voices he didn’t know. Vaguely, he wished that Dream was there-- Dream would likely be great in social situations, George just knew. And he would feel so much more comfortable if he had a best friend to talk with that he trusted. \n\n\n“Hey,” someone said, and the entire table rearranged so that the last person could sit. “Sorry I’m late.”\n\n\nGeorge was shuffled to the side and saw the last person drop down. Instantly he could tell that this person was the “leader” of the group— George had a lot of experience with handling uncomfortable social situations, and as a result he had gotten quite good at analysing group dynamics. It was clear that everyone really liked whoever this new person was. \n\n\nThe guy glanced around the table, and his gaze landed on George. He gave him a dismissive up and down. “Who are you?”\n\n\n“Hi,” George said, feeling like he was under scrutiny again. “I’m George.”\n\n\nThe guy’s eyes flicked over him again, and he said, “I’m Clay.” \n\n\nThere was an odd tension in the air for a moment. George wasn’t quite sure why. \n\n\n“You’re in my math class,” Clay said. “New kid, right?” \n\n\nGeorge nodded. It was weird; Clay gave him a sense of deja vu, like he had already met him. \n\n\nClay gave him another appraising look. “See you around.”\n\n\nWithout another word, he turned and promptly joined Ponk and Alyssa’s conversation, happening at the other end of the table. George stared curiously after him for a moment. \n\n\n“Don’t worry about him,” Bad said under his breath. “He’s not great with new people.”\n\n\n“That’s okay,” George said, “Me either.”\n\n\nSapnap laughed. “You’re doing great, then.”\n\n\nGeorge gave Sapnap a reluctantly pleased smile, and joined the conversation. They were talking about some teacher or another, and even if he couldn’t contribute anything, he still listened. The group made future plans about where they were going to eat next, and debated whether to go to Mexican place down the street or just get burgers and shakes, and graciously included George in their discussion. Before he knew it, the warning bell rang, signaling that they had five minutes to get to their next class. \n\n\n“What’s your next class?” Clay asked.\n\n\n“I have computer science,” George said. He didn’t know why he suddenly felt so flustered. Clay was just another person; George didn’t feel like this whenever he talked with Sapnap, or Skeppy, or anyone else in the group. \n\n\n“Hm.” Clay slung his backpack over his shoulder. “Have fun.” \n\n\nGeorge gave him a thumbs up and then instantly regretted it; that was such an awkward, clumsy thing to do. He turned to leave; he wasn’t sure how far the classroom was (it was in the D Wing, and George had no clue where that was). \n\n\nAlmost out of earshot, he heard Sapnap mutter to Clay: “Leave him alone, he’s new.” \n\n\nClay’s response was inaudible, but an odd feeling surfaced in George’s chest. He couldn’t place a name to the emotion, and decided to ignore it. He had two more hours in the school day, and then he could go home and relax. George was an introvert; he wasn’t built for this much social interaction.\n\n\nThe last two classes passed in a breeze; computer science trickled by, and George’s last class was Spanish (he had already taken two years of it in Brighton, but still had to take one more to graduate). Before he knew it, the day was over.\n\n\nExcept Sapnap cornered him after class, struck up a conversation, and before George knew it, nearly forty five minutes had passed. Even though George was still awkwardly quiet and still, Sapnap had no problem filling the silence and bouncing off of George’s short responses. Their conversation flowed so easily that George couldn’t believe he had only met him a few hours before. They listened to the same music and watched the same TV shows. They were even interested in the same content creators online, and Sapnap played Minecraft too. \n\n\nOn his walk home, George replayed the events of the day in his head. He felt quite proud of himself, if he was being honest— things had gone much better than he expected. He had made friends, and even if they were the apparent troublemakers of campus, they seemed to like him. \n\n\nGeorge pulled out his phone, and to his delight, saw that Dream had texted him almost an hour ago. Quickly, he scrolled through his texts: \n\n\ndreamwastaken: hello!!\n\n\ndreamwastaken: have you finished classes yet\n\n\ndreamwastaken: omg tell me how everything went\n\n\nGeorge grinned down at his phone fondly. It wasn’t often that Dream triple texted him, and it was usually whenever Dream was excited about something beyond measure. Already, he felt better about his day. \n\n\ngeorgenotfound: it honestly wasn’t that bad. i made friends with a few people\n\n\ndreamwastaken: yay i knew u would\n\n\ndreamwastaken: don’t replace me tho\n\n\ngeorgenotfound: of course not you’ll always be my best friend\n\n\ndreamwastaken: :)) &lt;3\n\n\ngeorgenotfound: &lt;33\n\n\ngeorgenotfound: anyway my classes aren't that interesting. i'm in pre calculus and i don't understand anything\n\n\ndreamwastaken: precalc sucks. i’m rooting for you \n\n\ngeorgenotfound: aren’t you some sort of math whiz? \n\n\ndreamwastaken: i’m only good at math though. put me in a history class and i’ll forget everything\n\n\ngeorgenotfound: mood, i’m in american history and i have no clue what’s going on\n\n\ndreamwastaken: all u really need to know is that america wins wars, there’s nothing else to it\n\n\nGeorge snorted. The lump behind his began to dissolve, dislodging all of the stress from earlier that day. Dream always made him feel like this: happy, relaxed, and content. No matter how things at school went, or how many friends he had tentatively made there, he would always have Dream. That was enough for him.\n\n\nFor the past four days, George had been slowly making friends with everyone who sat at the lunch table. It had gone spectacularly well, to the point where George was convinced that all the films and television shows were lying about the intensity of American high schools. Of course there were some obvious cliques— some were emo, some were jocks, and some more were preps— but overall, everyone had been very kind. There was no bullying and no social hierarchy. Classes hadn’t started picking up in pace yet (but George worried that the weekend would change things), and so far it was mostly icebreakers and introductory lectures. The first week had gone so well that, astonishingly, George had begun looking forward to school. \n\n\nThe one thing he didn’t look forward to was the weather.\n\n\nFlorida was bitterly humid, and rainstorms seemed to come out of nowhere. No one had umbrellas, and when George asked about it, the entire group laughed. Apparently umbrellas weren’t a thing in Florida— if anyone used one, they were relentlessly teased. Clay had laughed when George pulled his hood up to keep dry, and George flushed pink. \n\n\nIn response, George told them about how cold Brighton could get and how it snowed in the winter. Last year, it had snowed so much that George and his friends had had a mock snowball fight. Logically, it wasn’t much snow— the dustings were barely two inches, and usually melted within the week— but no one had experienced snow before, and they ate his stories up with wide eyes. \n\n\n“I don’t believe that winters are below freezing,” Bad argued, “I don’t think it’s ever been below fifty degrees here.” \n\n\nGeorge was quickly learning the difference between Celsius and Fahrenheit. He’d looked at his phone one morning, seen seventy degrees on the weather update, and nearly fainted. Seventy degrees in Celsius wasn’t even a fathomable temperature. Seventy degrees Fahrenheit, comparatively, was a cool summer day. \n\n\n “How have you guys never seen snow before?” George asked in disbelief.\n\n\n“How have you never seen a hurricane before?” challenged Clay. \n\n\n“That’s not fair,” George muttered, and Clay laughed.\n\n\nGeorge didn’t know why he liked making Clay laugh. It made a strange feeling of pride swell in his stomach. Which was odd, because making someone laugh wasn’t a competition. \n\n\n“You’re lucky hurricane season was light this year,” Ponk interjected. “Orlando doesn’t get hit that bad, but we still get plenty of storms.”\n\n\n“I hate your storms,” George said. “Rain shouldn’t be warm.”\n\n\n“Cold rain,” Bad said, shuddering. “Icky.”\n\n\nGeorge gave up on them; in Florida, stepping outside during a rainstorm felt the same as taking a lukewarm shower. It was just what they were used to.\n\n\nApart from their constant friendly bickering, George actually felt happy talking with everyone. He still wasn’t sure why they had accepted him so wholeheartedly into their group, with open arms. It was kind of them, and George appreciated it more than he could possibly say. When he had asked Sapnap about it on the first day, Sapnap had just waved it off. Still, George resolved to say thank you at some point. It had made the transition from Britain to Florida so much easier. \n\n\nFriday afternoon arrived in a flash. George headed to their usual lunch spot after precalculus— Clay was also in his fourth period math class— but Clay was the type of person to stay after class and talk with the teacher for a few minutes. More than once, George had heard a teacher compliment Clay on his “work ethic” and wonder why he hung out with such “rowdy” friends. \n\n\n“Hey, George,” Bad said, and beckoned him over. “We’re debating where to eat today. Pizza or Mexican?”\n\n\n“Pizza,” George said automatically. “It’s so much better.”\n\n\n“You and Clay are going to get along great,” Ponk said offhandedly. “He always chooses pizza.” \n\n\n“Speaking of Clay,” Sapnap said, looking around, “Where is he?”\n\n\n“He was talking to the teacher when I left,” George offered. “So any second?”\n\n\n“I’m here,” Clay said, neatly sliding in. “Where are we eating? Domino’s?”\n\n\n“As always,” Bad said, “George voted for pizza too, he’s your new best friend.”\n\n\n“Ha ha,” Clay said sarcastically. “It’ll take a lot more than that.”\n\n\nOuch. \n\n\nThat probably wasn’t meant to be rude, probably meant as a lighthearted jab at how new George was to Lakeside High, but it still stung slightly. George was already uncomfortable with how quickly they had accepted him in— he worried that if he messed up in any way, they would drop him just as easily. \n\n\nIn Brighton, most of his friends had been similar outcasts, and that was why they had bonded together. He had talked to Dream so much more then, because he was the one person who really, really cared about him. Here, it seemed like this friend group could have their pick of friends; everyone seemed to admire them. Yet they had somehow picked George, and taken him under their wing. \n\n\n“Are we ready to go?” Bad asked. George jolted himself out of his thoughts. No one seemed to take anything seriously. Clay probably meant no harm by saying that. Dream probably would have laughed at it, too.\n\n\nEveryone nodded in agreement, and they swarmed as one toward the student parking lot. It was open only to the upperclassmen— which made sense, as you had to be seventeen in order to get your license. Bad fumbled for his car keys and unlocked a dark minivan. It wasn’t his, but his father’s, and Bad made everyone promise to leave it without a single scratch. It was big enough to fit everyone, if three people squeezed in the backseat. Luckily Alyssa was a good sport about taking the middle seat, and most of the fast food places were less than a five minute drive from campus regardless. \n\n\nGeorge settled into the middle row, across from Skeppy and directly behind Bad. He leaned against the window and pulled out his phone. With a jolt of excitement he saw that Dream was online, and had just sent him a text.\n\n\ndreamwastaken: would u rather have time travel or telekinesis\n\n\ngeorgenotfound: both but telekinesis would be better. besides, time travel can go wrong in so many ways. i don’t want to accidentally change the entire world\n\n\ndreamwastaken: hm. fair\n\n\ngeorgenotfound: ok ok i have a good one\n\n\ngeorgenotfound: would you rather: read out loud everything u read or sing everything u say\n\n\ndreamwastaken: dumb question but easy. singing\n\n\ndreamwastaken: would u rather be a reverse mermaid or reverse centaur\n\n\ngeorgenotfound: what the hell \n\n\ndreamwastaken: answer the question!! \n\n\ngeorgenotfound: reverse centaur probably. i don’t think i could deal with being a fish\n\n\nGeorge smiled, and Sapnap peered over at his phone. “Who are you texting?”\n\n\nHeart jumping, George turned his phone off and turned it away from Sapnap’s prying eyes. “No one.”\n\n\nSapnap laughed. “You’re just like Clay. I swear, he probably has a hidden girlfriend we don’t know about.”\n\n\n“Even if I did,” Clay said amusedly, not looking up from his phone, “I’d never tell.”\n\n\nSkeppy rolled his eyes. “Yeah, yeah. We know.” He kicked the back of the front seat (Clay had immediately claimed shotgun) and Clay huffed a small laugh. \n\n\nGeorge glanced down at his phone again; Dream hadn’t responded in a few minutes, and he was probably in the middle of something then. He shut his phone off and turned to neatly slide into Sapnap and Ponk’s conversation. \n\n\nBad pulled into the Domino’s parking lot a few seconds later, and Sapnap checked the time. \n\n\n“Thirty five minutes,” he said. “Clay, you wanna order?”\n\n\nClay nodded and went up to the cashier. The girl behind the counter laughed, said something back, and twisted a strand of hair around her finger. Clay responded casually and leaned across the counter, the beginning of a careless smirk tugging at the edge of his lips. George glanced curiously at them before turning away. He wasn’t sure why his stomach felt weird.\n\n\n“It’ll be ready in ten minutes,” Clay said, upon returning to the table. “She gave me a twenty percent discount, how nice of her.”\n\n\nPonk coughed into his elbow. The cough sounded suspiciously like because you were flirting. \n\n\nClay rolled his eyes and pushed Ponk’s shoulder lightly. “I wasn’t, but okay.”\n\n\nPonk scoffed. “Sure.” \n\n\nConversation flowed easily after that, and Clay settled in by interjecting something that made everybody laugh. George laughed too, but if you had asked him what was so funny, he wouldn’t have been able to tell you. \n\n\nWhen the pizza arrived, everyone eagerly dug in. Skeppy stole half of the cinnamon twists, before pushing the rest at George and demanding that he try them (good, but too sweet and greasy for his taste). He reached for another slice of pizza instead, and laughed at Skeppy’s mock-hurt expression. \n\n\n“George,” Clay said conversationally, “Do you have Domino’s in Britain?”\n\n\n“Mhm,” George said, “But I’ve always been a Pizza Hut person.”\n\n\nClay grinned and punched the air. “Finally. Everyone here has terrible taste.”\n\n\n“It’s fast food,” Sapnap muttered, “It’s not supposed to be good.” \n\n\n“I have standards,” Clay declared, “And Pizza Hut lives up to them.”\n\n\n“I know you’re lying,” Ponk said. “It tastes like cardboard—”\n\n\n“No, it doesn’t—”\n\n\nGeorge took another sip of his drink and stayed quiet. As the days passed, George was getting better at reading the group dynamics. Clearly, everyone looked up to and respected Clay the most. It wasn’t hard to see why— he was easygoing and social, and got along well with almost everyone. The rest of the school admired him as well. So far he and George hadn’t talked much, but George secretly hoped that would change. \n\n\nHistorically, George hadn’t gotten along well with the “popular” kids at school; he was quiet, and often ignored, and the popular kids were often rowdy, loud, and conceited. So far Clay didn’t seem like that, though— he seemed genuinely down to earth. George appreciated that. \n\n\n“Guys,” Alyssa said, and checked her watch, “We have to go soon, we have less than ten minutes.”\n\n\n“Shotgun!” Ponk called quickly.\n\n\nClay rolled his eyes, but generously conceded the front seat to Ponk as they left the restaurant. George mentally prepared himself for his next two classes, easily the two most boring classes in his day, even though he liked learning computer science. It was always worse after lunch, too, when everyone in the class was loud and hyperactive right after a break. \n\n\n“Buckle your seatbelts!” Bad said, before he even started the car. \n\n\nAlyssa gave a thumbs up once everyone was firmly belted in place, and slowly Bad pulled out of the parking lot. They made it back to school with a few minutes to spare and then all split up their separate ways— Sapnap and Clay had science together, fifth period, but George had no one in his last two classes.\n\n\nComputer science passed in a daze, and so did Spanish. George stared at the clock— it dragged on slowly, and each minute seemed to take hours. The teacher was scribbling something on the board, something about verb tenses and vocabulary, but George’s thoughts couldn’t stay focused. He still took notes, but none of the information stuck in his head. He kept wanting to text Dream, but the very first day, his Spanish teacher had said, in no uncertain terms, that any phone use in her class would be an immediate detention. \n\n\nFinally, after an exhausting hour, the Friday bell rang. The classroom erupted into excited chatter. As soon as George left the room, he immediately checked his phone. Dream hadn’t sent him anything past their dumb little “would you rather” earlier, so George just sent a friendly hello and a brief complaint about how boring school was. \n\n\nHe made his way to his locker and took out his textbooks; teachers had just begun assigning homework for over the weekend. George would need to carry home his textbooks if he wanted to get any work done. \n\n\n“Hey,” Sapnap said, neatly interrupting George’s thoughts. “Do you want to come bowling with us?”\n\n\n“Bowling?”\n\n\n“Yeah,” he said, and waved a hand absentmindedly. “There’s a bowling alley a few blocks from here and we usually go on Friday afternoons. You in?” \n\n\nGeorge ducked his head and admitted sheepishly, “I’ve never been bowling.”\n\n\nSapnap blinked, and then his smile became broader. “We’ll teach you. Come on, it’s not that hard.”\n\n\n“If you’re sure,” George said, doubtful. He closed his locker and zipped up his backpack, mentally wincing at the weight of it. “I’m probably not very good—” \n\n\nSapnap didn’t give him a chance to overthink it, because he grabbed George’s hand and yanked him along. “It’s really easy,” he said. “You have a ball and you throw it.” \n\n\n“I know what bowling is,” George said petulantly. “I’ve just never done it.”\n\n\nNo matter what George said, Sapnap waved it off and continued describing what bowling was, as if George were a six year old who had never heard of it before. He certainly made it sound much more exciting than bowling actually was— wasn’t bowling just throwing a ball with three holes and trying to knock over pins? \n\n\nThe bowling alley was around the back of the mall parking lot, a wide stretch of concrete that bordered dozens of stores. Luckily for them, the mall was a fifteen minute walk from Lakeside High— a sweltering, sweaty walk if it was hot, but other than that, a manageable distance. \n\n\nAccording to Sapnap, “Bowling Fridays” were a thing for their friend group— a sort of tradition that George was now invited to join in on. They had started ever since Skeppy first scored the job at the bowling alley, and thus got them everything for free. \n\n\n“Just don’t tell his manager,” Sapnap said quickly, “The employee discounts on the nachos are great and I’m not paying full price for them.” \n\n\n“Okay,” George said, still confused, and then Sapnap tugged him inside. \n\n\nThe bowling alley was riotous and loud and full of brightly colored flashing lights, each lighting up different sections of the ceiling. At one end of the massive room was an arcade, full of ticket games and first person shooter games, and on the other end was a tiny restaurant area. In between cut ten lengthy bowling aisles, each one with its own seating section. At the farthest bowling alley, George could recognize a few faces, sitting on arranged sofas and chairs. Backpacks were piled to the side and subsequently ignored. Someone’s half-drunk slushie was in the middle of the table, accompanied by two enormous buckets of popcorn, and there was a plate of greasy looking nachos that made Sapnap’s eyes light up. \n\n\n“Come over here,” Sapnap beckoned, before they went to go meet his friends, “You need to get some bowling shoes.”\n\n\nDid people actually wear bowling shoes? “I thought those were a joke.” \n\n\n“Of course not,” Sapnap said, “So you don’t scratch up the floors, see?”\n\n\n“This makes no sense,” George muttered, but followed Sapnap to the front desk anyway. The poor employee had been forced into a red and white striped hat, and a shirt with the bowling alley’s name plastered across it. He handed Sapnap a pair of shoes without having to ask, and then found a pair when George told him his shoe size. Bowling shoes in hand, Sapnap pulled George onwards. \n\n\nThere was a chorus of hellos as they arrived, and George found himself plonked down on one of the sofas. Almost everyone was there— Alyssa and Clay were still missing, but Bad assured George that they would be there soon. \n\n\nBefore sitting down, Sapnap quickly entered his and George’s names into the bowling system, a tiny screen in the center of the table that showed everyone’s scores. The first thing Sapnap did was enter his name and George’s name into the bowling system, and the second, reach for a handful of nachos. \n\n\n“These are so fucking good,” Sapnap said, mouth full of cheese, jalapeños, and tortilla chips. “George, you have to try them.”\n\n\n“Language!” Bad said. “Let’s keep it PG-13 here, there are kids present.”\n\n\n“Who’s the kid?”\n\n\nBad jerked his thumb in George’s direction. “This one.”\n\n\nGeorge rolled his eyes. He was about to turn seventeen in two months— his birthday was the first of November— and he was hardly a child. \n\n\n“When’s the game starting?” \n\n\nAlyssa had just arrived, and slung her backpack off with a huff of displeasure. Apparently everyone was carrying home their textbooks that day, too— George’s back wasn’t the only one aching. \n\n\n“As soon as Clay gets here,” Bad said. “Any second now.”\n\n\n“Hey,” Clay said on cue, and dropped into the open seat next to George. “I’m not too late, am I?”\n\n\n“Right on time,” Sapnap said. “Whoever’s up first, go and show George how it’s done.”\n\n\nGeorge felt oddly nervous for a moment, and conspicuously aware of Clay next to him. Again, he wished that Dream were there; he would make George so much more comfortable. \n\n\nSkeppy went first, and picked a bowling ball at random from a rack of them. He managed to knock over most of the pins except for two, and then managed to hit both of those pins on his second throw. He pumped his fist in the air in excitement and his laughter was infectious— George found himself leaning forwards and watching each person as they took their turn. No one took the game seriously-- which was good, because George was surely horrible at it. \n\n\nTheir conversation started at school, and people mentioned the amount of homework they had over the weekend and how awful Mrs. Laeger was (she taught physics, apparently, and was a nightmare) and then somehow, less than fifteen minutes later, they were debating over whether Shrek was a good movie or whether the Bee Movie was better.\n\n\n“The Bee Movie,” Sapnap said indignantly. “You’re trying to tell me that some ogre has contributed more to society than Barry B. Benson?”\n\n\n“But Shrek has an objectively better plot,” Alyssa argued. “No way a human actually falls in love with a bee.” \n\n\n“Then how can a human fall in love with an ogre—”\n\n\n“Shh!” \n\n\nBad shushed them as Clay’s name flashed across the screen, beckoning him up for his turn. Everyone obligingly went quiet and watched as Clay hefted three different bowling balls. He compared their weights before settling on one the same shade as his hoodie, a dark yellow.\n\n\nEveryone waited with bated breath, and then that breath was let out simultaneously as all ten pins toppled over. There were muttered curses and praise from everyone as Clay turned around, without even seeing his score.\n\n\n“How?” Bad complained. “How on earth do you always do that?”\n\n\nClay grinned easily. “It’s all natural talent.”\n\n\nSapnap punched his arm as he sat down, and Clay propped the same arm up on him. “I’m convinced you cheat somehow.” To George he added, “He always gets a strike or a spare. That means all ten pins knocked over in your turn. None of us have any idea how he does it.”\n\n\n“Mhm.” George nodded, even though he didn’t entirely understand the rules of the game yet. To be fair, he didn’t even know that bowling had rules until an hour ago. \n\n\n“It’s that lucky bowling ball,” Sapnap mumbled. “I just need to get the same one as him.” He wriggled his way out from under Clay’s arm as his name popped up across the screen. Instead of dropping his arm, Clay just moved over and leaned against George.\n\n\n“Uh… what?”\n\n\nClay raised an eyebrow. “You’re part of our group, right?”\n\n\nGeorge ducked his head. “I guess.”\n\n\n“Plus you’re shorter than Sap, so this is easier.” \n\n\n“I’m not that short,” George muttered. “I’m five seven.”\n\n\nBad laughs. “That’s tiny. You’re so tiny, it’s adorable.”\n\n\n“I’m not tiny.”\n\n\nClay reached over with his other hand and ruffled George’s hair. “Okay, shortie.”\n\n\nGeorge put his face in his hands and mortifyingly, felt himself blush. He hated that this happened whenever he was mildly embarrassed. \n\n\nHe looked up and hoped that the flashing lights and colors were too chaotic for anyone to pay much attention to him. Fortunately, they were— everyone’s attention had moved on from how tall George was to Bad’s turn at bowling. Sapnap retook his seat as Bad stood up, hitting the button for bumpers.\n\n\n“You’re playing with bumpers?” Clay said disbelievingly. “That’s such a baby move.” \n\n\n“I like the bumpers,” Bad insisted. “They’re for learning.”\n\n\n“They’re for people who are bad at bowling,” Clay said. \n\n\n“They’re strategic,” argued Bad. “You can bounce the ball off them.”\n\n\nClay threw his hands into the air. “You’re terrible at this.” \n\n\n“Just because I’m learning—”\n\n\n“You won’t learn by using bumpers—”\n\n\nBad threw the ball recklessly, and true to his words, it ricocheted multiple times off the bumpers, before knocking over half the pins. Ponk gave him a mocking round of applause, and Bad took a gracious bow. \n\n\n“That’s how it’s done,” he proclaimed, and sat back down. Clay rolled his eyes and raised a hand to flip him off. Bad gaped, affronted, and exclaimed language!\n\n\nOnce Bad’s turn had ended, George’s name was the next to flash across the screen. Clay moved his arm so he could get up. \n\n\n“Go George!” Alyssa cheered. \n\n\n“You’ll do great,” Ponk said.\n\n\n“It’s okay if you fail,” Sapnap added. Bad swatted his arm. \n\n\n“No bumpers or else it’s cheating,” called Clay, and Sapnap playfully flipped him off. George picked up one of the bowling balls— it was much heavier than everyone made it seem— and carefully lined up his shot. He wasn’t really expecting anything of it, but the ball flew down the lane. It was nearly dead center, and knocked down nine of the pins. The last pin wobbled dangerously, before steadying to many groans of displeasure behind him.\n\n\n“That was so good!” Alyssa exclaimed. “You’re great at this.”\n\n\n“Beginner’s luck,” Clay said dismissively, and reached for another handful of popcorn. \n\n\n“Nice,” Bad said admiringly. “You’ve never bowled before?”\n\n\nGeorge shook his head. He felt vaguely proud of himself. “Is bowling a competitive thing?”\n\n\n“Not unless you’re Clay,” Sapnap said. “He’s a tryhard.”\n\n\n“Am not,” Clay said. “It’s not my fault I’m better than all of you.” \n\n\n“Fuck you,” Skeppy said cheerfully. \n\n\n“Language!”\n\n\nGeorge couldn’t help it; he laughed. He liked Sapnap’s infectious humor and Alyssa’s kind cheer. He liked Bad’s relentless enthusiasm, Skeppy’s hyperactive laugh, and Ponk’s dry sarcasm. He liked Clay’s nonchalant humor and his playful arrogance. \n\n\nIt was such a fun afternoon, and he was getting to know this friend group so well. It was only a week into his junior year at Lakeside High, and things were already looking up. \n\n\nHe was so content that, at the end of the night, he nearly forgot to check if Dream had sent him anything.\n\n\nOctober dawned hot and humid over Orlando, and upon waking up, George immediately decided that going outside that day would be hell. It was supposed to be autumn, for fucks sake, and it was nearly ninety degrees. Was it like this every day? How was anyone supposed to function?\n\n\nHe woke up at six forty five (as the semester continued, George’s morning alarm got progressively later and later) and immediately checked his phone. There were two new messages from Dream, and George’s heart always did a funny little flip whenever he saw that notification. \n\n\ndreamwastaken: good morning!!\n\n\n sent 4:12 AM \n\n\nGeorge yawned and scrubbed a hand over his face. He had gone to sleep at midnight last night, finishing the final questions on his physics homework, and he was exhausted nearly seven hours later. George couldn’t fathom waking up at four in the morning for something. \n\n\ngeorgenotfound: why were you awake at 4 am\n\n\ndreamwastaken: i couldn’t sleep\n\n\ngeorgenotfound: fair\n\n\ndreamwastaken: also i finished that plugin we were working on! whenever you’re free we should try it\n\n\nTwo weeks ago Dream had mentioned that he wanted to create a plugin for Minecraft— they both played, after all, and had played since they were kids— that allowed one player to have a compass that pointed to another player. It could be pretty interesting for hide and seek, or even a manhunt-style game. \n\n\nThey were both learning coding from the ground up— Dream had tentatively mentioned being interested in it, and George had readily agreed— meaning that their projects always messed up much more than worked. George had worked on the plug in whenever he was free from school, which was rarely, but apparently Dream had finished it. \n\n\ngeorgenotfound: that’s so exciting! i’m free after school today, 4pm ish\n\n\ndreamwastaken: works for me :) it’ll be fun\n\n\nGeorge put his phone away and rushed to get ready for class. He had been on good terms with his history teacher lately, and he wasn’t about to break that streak. He also desperately needed his coffee fix; Dream hated it, and always made fun of him whenever George mentioned needing caffeine. Still, George couldn’t live without it. \n\n\n“Drive me in five minutes?” he shouted, and his mum made a muffled note of acknowledgement through her closed bedroom door. George popped a toaster waffle into his mouth and packed up his backpack quickly. He looked at the time and winced; he really should be waking up earlier. He was going to be late if he kept this up. \n\n\n“Ready?” his mother said. She grabbed her car keys off the kitchen counter and beckoned to George, who slid into the car. He bolted out as soon as she pulled up to the curb, barely making it in time for the warning bell to ring. He dashed straight to American History— after a month, George practically knew the school like the back of his hand, even if the buildings were color coded. He slid into his seat right as the second bell rang and class started. Sapnap gave him a fist bump for being on time, and George heaved a breath as he took out his notebook.\n\n\nBy far, American History was his favorite class— not because of subject material, but because most of the friend group was in his class. They had great conversations in the back of the room, though Sapnap distracted him too much for George to get any work done. George was fairly sure that the teacher regretted allowing all of them to sit together. He was also fairly sure that the teacher now thought of him as one of the troublemakers, too.\n\n\nIt was true, though: somehow Sapnap had started dragging him into school pranks. The other day, Sapnap had begun his crusade to change every clock in the school to the wrong time. He had completed all of the ones in the science wing but needed George to help him with it, and reluctantly, George agreed. They were halfway through the entire school, at that point.\n\n\nSapnap’s pranks weren’t always that harmless— apparently last year Sapnap had set off illegal fireworks outside during a school-wide assembly, and had almost gotten suspended for it. It was still a legendary tale throughout Orlando High, and Sapnap still got congratulated for it almost six months later. \n\n\n“You don’t understand how cool it was,” Bad had said, even though his tone said he disapproved of all of Sapnap’s antics, “It was right as the seniors were about to get their academic awards, and then all of a sudden, boom.”\n\n\n“He would’ve gotten expelled for that at my old school,” George had said. \n\n\n“This is Florida,” Bad had said. “I don’t think the school knows how to expel people.” \n\n\nGeorge had rolled his eyes. The more he learned about Lakeside High, the more he liked it. Everyone was carefree and friendly— much different to the rigid rules of his private school in Brighton. They all seemed to not take things seriously, and to just have fun. Already, George felt like he was more like himself in America than he ever was in Britain. \n\n\nTheir teacher scrawled a lesson plan on the whiteboard. Sapnap continued whispering to George— something about switching the locks on people’s lockers— when their teacher turned to him.\n\n\n“Sapnap,” the history teacher said, unamusedly, “Quiet in the back row.”\n\n\nSapnap mimed zipping his lips and locking them, and then dramatically tossed the key away. “I’ll be quiet from now on, Mrs. Carter.”\n\n\n“What did I say about talking?” she shot back. She also gave George a warning look too, who sighed— he had barely spoken in her class ever. Still, he didn’t mind being lumped in with Sapnap. At least Sapnap was funny to be around, and a great friend. \n\n\nThe other thing with being “lumped in” with Sapnap is that George had somehow managed to gather a reputation at Lakeside High School for being \"cool\" and \"mysterious.\" It was quite the opposite of how George thought of himself (geeky and weird). Apparently, as Ponk informed him, people liked his accent, and they liked that he was from Britain. And, according to Alyssa, people found him attractive. \n\n\nGeorge could understand the accent, but attractive? That was incomprehensible. George didn’t even find himself attractive, so how could someone else? \n\n\nBut as the days climbed on, George did notice how other people acted around him: one blonde girl giggled nervously and tucked her hair behind her ears, another person said hi to him in the hallway in a bright, cheery voice, and another person tried to strike up a conversation before realizing George just… wasn’t interested. It made him feel all weird and jelly-like on the inside— not because he was interested in them, but because he couldn’t quite understand why they would try and talk to him when he didn’t even know their names. \n\n\n“It’s because you are attractive,” Alyssa explained after school, as best as she could. Her tone was matter-of-fact. “Also, the accent makes you so much more interesting.”\n\n\n“Thanks,” George said, somewhat sourly. Alyssa laughed and nudged him with her shoulder.\n\n\n“Not that you’re not interesting in the first place,” she corrected. “They just don’t know you at all, right?”\n\n\n“Yeah,” George said slowly, contemplating it. “I guess.”\n\n\n“Think of it this way,” Alyssa said. “You’ve found people interesting before, and wanted to be their friend, right?”\n\n\nGeorge’s thoughts strayed to Dream first, and then surprisingly, Clay after. He supposed it was true— he could understand the desire to befriend people who he found interesting. \n\n\n“It’s like that, except instead of wanting to be friends, they want to date you.”\n\n\n“Weird,” George said, frowning. What was the appeal of wanting to date someone you barely knew?\n\n\nAfter, George politely diverted their conversation to something that was more comfortable, and graciously, Alyssa allowed it. He actually really enjoyed talking to her; she was really nice and a great conversationalist. George hoped that he would get to know her better; he had a feeling that they could be really good friends. \n\n\nTheir conversation continued until George realized that it had been nearly an hour after the final bell, and he needed to get home. Alyssa waved goodbye, and they went their separate ways.\n\n\nThe next day at school, the choking humidity of Florida was nearly painful. It felt as if he were breathing in literal steam— it  was so much worse than the day before. The temperature, too, seemed to have only gone up. Even though George’s walk to school was mostly shaded, he still longed to be inside, where the cool air conditioning made everything better.\n\n\nHe grimaced, turned on his phone, and sent a quick text to Dream. \n\n\ngeorgenotfound: it’s so humid where i live right now oh my god \n\n\ndreamwastaken: its always like that for me lmao. it’s hell\n\n\ngeorgenotfound: my hair is such a mess\n\n\ndreamwastaken: don’t say thattt i’m sure u look cute\n\n\ngeorgenotfound: stop im blushing \n\n\ndreamwastaken: goal achieved :)\n\n\nGeorge rolled his eyes. Dream was such an idiot sometimes. He didn’t even know what George looked like, but he never failed to compliment him. \n\n\nGeorge pocketed his phone as the warning bell rang; the passing period between third and fourth period was five minutes longer, so people could grab a snack if they wanted in between classes. He still had a few minutes before he had to actually be at precalculus, but George didn’t want to be late. \n\n\nWith a sigh, he recalled that his homework from the night before had been practically incomprehensible. George had never been good at mathematics— even though computer science was one of his strong suits, math had always been awful for him. As the semester progressed, the topics they studied became more and more complex. George realized that he would only become more confused if he didn’t understand the basics now. \n\n\nClay was already in the classroom, scrolling through something on his phone. He had his feet kicked up on the chair in front of him, and his chair tilted back slightly. \n\n\n“Hey,” George said, and slid into his chair. Clay gave him a wry hello, but barely any other acknowledgement. For some reason, George felt disappointed at that little response.\n\n\nWhy was he disappointed?\n\n\nThirty minutes in, after their teacher had finished the lecture for the day, a worksheet was passed out for them to complete by the end of class. It didn’t seem that hard for Clay, who immediately pulled out his graphing calculator and began working on it. George looked down at the questions and tried to find a good place to start— they had started off easy in the semester, refreshing everyone who had just taken Algebra II. Still, he barely understood what was on the page.\n\n\nHe did his best and made it through about half of it, though he was fairly sure all of the answers were wrong. He felt more frustrated as time passed, and eventually muttered, “I don’t get this.”\n\n\n“Math isn’t that hard,” Clay said, and leaned over to look at George’s worksheet. “You’re just messing up somewhere. Let me see your work.”\n\n\nHe held out a hand and obligingly, George passed over his worksheet. Clay hummed absently as he flipped through it, and he traced his finger down the page as his eyes skimmed down it. He propped his chin up with one hand and moved onto the next page. The sunlight streamed through the back windows, illuminating Clay in golden light. It made him look graceful, ethereal. George quite liked looking at him, actually. \n\n\nHe didn’t realize he was staring until Clay looked over at him and raised an eyebrow questioningly. George flushed and ducked his head, quickly looking away.\n\n\nFinally, Clay turned to him. “You’re confusing irrational numbers with complex numbers,” he explained simply. “Complex ones have i in them, see…”\n\n\nHe turned George’s work over and scrawled a few numbers down, and then went through the steps for multiplying and solving them. Amazingly, George followed along, though he was a little bit distracted by how close Clay was to him. It was so much easier to understand when it was explained slowly and methodically; George couldn’t fathom why teachers didn’t teach like this.\n\n\n“Does that make more sense?”\n\n\n“Yeah,” George said. Why was he feeling so flustered? He coughed lightly and tried to clear his throat. “It does. Thanks, I really appreciate it.”\n\n\n“If you ever need more help, I’ll give it,” Clay said. \n\n\nFor a quick moment, George really admired his competency— it was attractive to be not just good, but confident with everything. He thought he quite liked Clay’s confidence. \n\n\nGeorge took his worksheet back and glanced quickly over the problems he would have to redo. It wouldn’t take that long, hopefully, and now that he had some concrete instructions it might be easier. Clay’s numbers were carelessly written across the back. His handwriting was really nice— not perfectly neat or anything, but the kind of handwriting that one wanted to look at. \n\n\n“Thank you,” George repeated. Clay gave him a small smile, more of an arrogant smirk than anything else, and suddenly George felt his heart drop into his stomach.\n\n\nMaybe there was a reason why he liked looking at Clay so much.\n\n\nWell, fuck. \n\n\nAs soon as school ended, George texted Dream in a panic. \n\n\ngeorgenotfound: code red help i need your advice\n\n\nDream’s response came almost instantly. \n\n\ndreamwastaken: what do u need?\n\n\nGeorge started typing, and then frowned and deleted it. He wasn’t quite sure how to put it into words. Eventually he just gritted his teeth and sent it.\n\n\ngeorgenotfound: i met this guy. and he’s cute. like REALLY cute. but he’s also super popular and i'm kind of intimidated by him?? \n\n\ngeorgenotfound: i get so nervous around him and i feel like you would have good advice on what to do \n\n\n dreamwastaken is typing… \n\n\n dreamwastaken is typing… \n\n\nThe three dots popped up, fell, and then appeared again. George stood up and paced in circles around his room. Dream had been typing for nearly two minutes, which felt like ages. Finally his response came. \n\n\ndreamwastaken: idk\n\n\nGeorge huffed.\n\n\ngeorgenotfound: thats not very helpful :(\n\n\ndreamwastaken: maybe just tell him everything u just told me. \n\n\ngeorgenotfound: im too shy thats terrifying\n\n\ndreamwastaken: idk what to tell u.\n\n\ngeorgenotfound: ugh maybe he’ll just realize im super cute and fall in love w me first\n\n\nDream’s reply took ages to come. George was starting to wonder if his phone or computer had died, or if his wifi had given out, when he responded.\n\n\ndreamwastaken: haha yeah\n\n\ndreamwastaken: i gtg\n\n\ngeorgenotfound: are you okay?\n\n\ndreamwastaken: yeah lmao. i just have chores\n\n\ngeorgenotfound: ok!! have fun with that \n\n\n dreamwastaken is offline. \n\n\nWell, that had been spectacularly unhelpful. George rolled over and smashed his face into his pillow. He had really been hoping that Dream’s advice would be helpful in tackling the problem.\n\n\nGeorge scrolled through their conversation again, frowned, and then again. The more he read it the more upset Dream seemed. There was no way he would be doing chores at eight PM on a Wednesday night. And he’d never mentioned being forced to do chores before. So why would Dream lie to him like that?\n\n\nWhat had he done to make Dream so upset?\n\n\nGeorge stared at his phone for another moment. A sick feeling of alarm swooped through his stomach, like vertigo at the edge of a cliff. \n\n\nDream knew that George wasn’t straight— they had a long conversation about it at two in the morning years ago, and George was incredibly relieved that his best friend was so accepting of him. Clearly Dream wasn’t upset about George liking a boy. So what was he upset about?\n\n\nHe knew that his thoughts were going in circles, that they were leading him nowhere, but he worried so much about Dream that it was ridiculous. He didn’t want to lose his best friend.\n\n\nHe started typing something out— he wasn’t sure what he even wanted to say. Maybe an apology? Maybe a question? \n\n\nHe deleted it just as quickly. It was probably just exhaustion or stress, and everything would go back to normal the next morning.\n\n\nHopefully.\n\n\nThe morning arrived. Things, stubbornly, did not go back to normal.\n\n\nWell, they did, but not in the regular sense. Dream and George sent each other good morning texts, and George felt some of his stress fade away. He didn’t seem upset or worried, and when George tentatively asked him about his texts last night, Dream just said that he was tired and not really thinking straight. It was perfectly explanatory. George felt somewhat foolish for having worried so much over it. \n\n\nGeorge shouldered his backpack on the way to school and shuddered at the weight of it. All of his homework plus two textbooks were shoved inside. At the beginning of the semester he had made a silent promise to himself to make sure that he never forgot an assignment (that had been a common occurrence for him back in Brighton) and so far, he was making good on that promise. It had stolen a few hours of sleep from him, and ten years off his spine, but his grades were high and stayed that way. \n\n\n“You look exhausted,” Sapnap said, as soon as George opened his locker. \n\n\n“Stress,” George muttered, and hoped that explained it. \n\n\n“You need to relax more,” Sapnap said. “We’re getting burgers at lunch, are you coming?”\n\n\n“Of course.”\n\n\nSapnap grinned. “Perfect.” They turned down the hallway together, but then Sapnap stopped abruptly.\n\n\n“By the way,” he said nonchalantly, “Do you have the American History homework done?”\n\n\nGeorge gave Sapnap a skeptical look. “Why?”\n\n\nSapnap grimaced. “I may have just realized that I didn’t finish it last night.”\n\n\n“I’m not letting you copy my homework.” \n\n\nSapnap frowned and pouted. “I’ll owe you one.” When George didn’t immediately cave, Sapnap gave him pure puppy-dog eyes. “Please?”  \n\n\nGeorge huffed, and unzipped his backpack to give Sapnap his answers. “Fine.”\n\n\nSapnap flashed him a smile. The two of them settled against the lockers as Sapnap furiously scribbled down as much as he could before the bell rang. George stared absentmindedly at the lockers down the hall and the rowdy students chatting with each other.\n\n\nWithout meaning to, George’s eyes strayed to Clay, down the hall. He was chatting easily with some girl that George didn’t recognize. He was leaning against his locker, an easy grin on his face, and reached up to a run a hand through his hair carelessly. \n\n\n“Thank you so much,” Sapnap gushed. “I owe you one, seriously.”\n\n\nGeorge didn’t respond for a moment, too caught up in looking at Clay, and Sapnap raised an eyebrow and followed his gaze.\n\n\n“Looking at Clay again?”\n\n\n “What?” George said, too loudly. “No. I’m not.”\n\n\n“Seems like you are.”\n\n\nGeorge’s ears turned pink. “No, I’m not.”\n\n\n“I don’t believe you,” Sapnap said, sing-song. \n\n\n“I’m not,” George insisted. \n\n\nSapnap shrugged, but a devious smile was still on his face. “Whatever you say.”\n\n\nGeorge scowled. Sure, Clay was attractive: tall, tanned, and freckled. Sure, he was stubbornly good at everything, and incredibly confident too. And sure, he was magnetic— drawing George closer every time. He may have felt comfortable telling Dream about his crush, but he didn't know if he wanted to tell Sapnap, too.\n\n\n“Come on,” Sapnap urged, oblivious to George's thoughts, “We’ll be late.” \n\n\nGeorge let himself be tugged down the hallway towards history, but he couldn’t stop replaying Sapnap’s words in his head. They took their seats in the back of the class and passed their worksheets up to the front; still, George heard his words on repeat.\n\n\nThe thing with George is that he rarely did things halfway. The last time he had a crush, it had pretty much consumed his entire thoughts until he abruptly got over it one day. He couldn’t help it. It was the type of thing that just happened, and he never understood why other people were able to fall in and out of attraction as easily as they did. For him, romance had always been a hundred percent or zero. There was nothing wrong with having a crush, George understood that was entirely normal, but it was a lot of energy expended on something that would never happen. \n\n\nThe only person who really understood was Dream, who shared the same thing. They had talked about it when Dream was dating his last girlfriend, and George realized that other people experienced the same thing as he did. It was relieving and wonderful to hear. \n\n\nMaybe that was why George was so hesitant to confess to Sapnap— because Sapnap might not understand what crushes were like for him.\n\n\nAmerican History passed in a daze, the English, then Physics, and before he knew it, pre calculus arrived. George took his usual seat, right in the back middle, and Clay sat next to him. He studiously kept his eyes on the seat in front of him, not looking at Clay. \n\n\n“Please pass your homework to the front,” the teacher called. George passed his homework up— he had done it much slower this time, actually taking the time to multiply everything correctly and show all his work, and he was fairly sure he had gotten most of the work correct. \n\n\n“Did you understand it more?”\n\n\n“Hm?”\n\n\n“The homework,” Clay gestured. “Did it make more sense?”\n\n\n“Oh,” George said. “Yeah. Yes. I got it.”\n\n\nThe smallest hint of a smile appeared at the corner of Clay’s mouth. “Good.”\n\n\nGeorge felt the tips of his ears go red. Why did that always happen when he was embarrassed? \n\n\n“I might need more help on this, too,” George blurted. “Polynomials.”\n\n\nWhat? Immediately, George wished he could take the words back. He understood polynomials. It was possibly the one thing in precalculus that he knew how to do. Why was he asking for help? \n\n\nClay shrugged. “I can help you when we split into partners.”\n\n\n“Sure,” George said. “Thanks.”\n\n\n“No problem.”\n\n\nGeorge wanted to facepalm. Why was he so bad at this? \n\n\n“So,” Clay said, as soon as the teacher allowed them to split up into pairs to work, “What’s your question?”\n\n\nGeorge had dug himself into a hole. He flustered for an answer, and then finally said, “I don’t understand how to multiply them.”\n\n\n“Oh,” Clay said, “Here, I can show you.” He moved his chair closer to George’s desk, and George mentally reminded himself to breathe. He watched Clay’s hand as he scrawled down variables and numbers, fingers long and slender. He looked at the pleased, self-assured smile that appeared when George got the right answer after Clay’s tutelage. He tried his best to ignore the distracting presence of Clay right next to him. \n\n\nAnd as much as George tried, he didn’t recall a single thing from class that afternoon. \n\n\nHe breathed a long, low sigh of relief as the bell rang, and class ended. Clay waved a slight goodbye as he headed down the hallway towards his locker. George pulled out his phone and texted Dream as he headed towards the student parking lot. \n\n\ngeorgenotfound: this crush is becoming a problem \n\n\ngeorgenotfound: u would like him too i bet\n\n\nAs soon as he sent it, George saw Dream’s profile picture turn green, a sign that he was online. The read text button appeared just under George’s latest messages. Then just as quickly, Dream went offline again. \n\n\nGeorge stared at it, brow furrowed, and his stomach twisted in an uncomfortable knot. What had just happened? \n\n\nMaybe, George reasoned, he was just in some place where he couldn’t text easily, like in the middle of class or talking with his friends. Dream would probably reply soon when he had time to actually send something back. \n\n\nHe approached Bad's car, and asked, “Where are we going today?”\n\n\n“Five Guys,” Skeppy said excitedly. “The best burger place in Florida.”\n\n\nSapnap smacked him. “Don’t disrespect Shake Shack like that.”\n\n\n“Shake Shack has better shakes,” Skeppy allowed, “But the burgers at Five Guys are better.”\n\n\nSapnap rolled his eyes, but conceded the point. George checked his phone again; he didn’t know what to make of it. Dream’s reaction was so unlike him that it made George slightly worried. He would probably check in later after school, and maybe they could do something together— just the two of them, like things used to be. Play Minecraft, go on a server, something that was relaxing. \n\n\nNow that George thought about it, the more he realized that he and Dream had talked much less this past month. George had been so busy with new friends, with new classes, with a new place, that he hadn’t spent as much time talking with him. Versus two months ago, before school started up, George spent nearly all of his time texting. \n\n\nIt made him sort of lonely, sort of wistful, and George resolved to talk to Dream more. It would be nice for them to have another deep talk, the sort that only happened at two in the morning. \n\n\n“Clay,” Ponk called, and startled George out of his thoughts. “Hurry up.” \n\n\nGeorge glanced up; Clay seemed distracted, and he looked at his phone, brow furrowed, before seemingly shaking himself out of it and hopping in the car. The drive to the burger place was quiet, interspersed with Bad’s and Skeppy’s conversation from the front seat. When they arrived, everyone placed their orders and then moved outside to a picnic table. \n\n\nPonk frowned at Clay. “Not getting anything?” he asked.\n\n\n“Nah,” Clay said, shrugging. “I’m just not that hungry. I'll steal someone’s fries, though, pass them over.” \n\n\nAlyssa slid over her fries agreeably, and Clay took a decent handful. Still, George caught Sapnap’s confused glance over at his friend. Apparently Clay’s downcast mood wasn’t usual.\n\n\nThey finished their burgers and fries, and Ponk gathered up their trash to toss away. George ate the last few cajun fries left in the basket, before following everyone as they left the restaurant. Bad was the last, and was probably using the restroom. \n\n\nAs George was waiting for Bad to come out of the building, he saw Sapnap catch Clay by his shirtsleeve and drag him around the corner. George knew he shouldn’t listen to their conversation, that it was probably wrong to do so, but their voices filtered through to him regardless. \n\n\n“What’s going on?” Sapnap said, voice muffled. He sounded concerned. George stared at the restaurant and willed Bad to come outside so they could leave. \n\n\n“I’m fine,” Clay said, sounding much more bitter than George had ever heard him act before. “It’s something personal.”\n\n\n“Parents again?”\n\n\n“No,” Clay said. Slightly dismissive. “I’ll figure it out on my own.”\n\n\n“I’m done!” Bad said, and closed the door behind him. “Is everyone ready to leave?”\n\n\nAlyssa gestured. “Clay and Sap are talking.”\n\n\n“Tell them to hurry up,” Ponk said. “We’ll be late to fifth period.”\n\n\n“Fine, fine,” Bad huffed, and rounded the corner. He reappeared two seconds later with both Clay and Sapnap in tow. George tried not to stare at Clay, but couldn’t help it— he looked tired, more so than usual, but not upset in any way. It was like he had pulled a mask back on over his actual feelings.\n\n\nQuickly everyone hopped into the car. This time, Sapnap stole the front seat before Clay could manage to call shotgun, and instead Clay sat in the middle row, to the left of George. \n\n\nGeorge tried not to stare, but for some reason, he couldn’t help but feel like Clay’s bad mood was caused by him. It was ridiculous— George had done nothing of the sort. But the thought still resided at the edge of his mind. \n\n\nAfter school, George zipped his backpack up and out of habit, checked his phone. To his delight, he saw that Dream had texted him back.\n\n\ndreamwastaken: lmao maybe\n\n\nHis response didn’t make any sense until George read what he had sent earlier: u would like him too i bet. George wasn’t sure how to respond, but before he could figure something out, Dream sent him another message.\n\n\ndreamwastaken: i’m tired. ignore me\n\n\ngeorgenotfound: sleep well :(\n\n\ndreamwastaken: sure\n\n\ndreamwastaken: &lt;3\n\n\nGeorge looked at the little emoticon and wondered why it had almost felt like an afterthought, as if Dream wasn’t planning to send that in the first place. \n\n\ngeorgenotfound: &lt;3\n\n\nHe sent one back cautiously, and Dream “liked” the message. It made George breathe easier; he hated whenever people were upset with him. It made him feel like he had done something wrong, even if he knew he hadn’t. \n\n\nGeorge pulled out his math homework, knowing that it was going to take the longest out of any of his assignments for the night. He looked through the three pages of questions that their teacher had assigned them (that much math should be made illegal, in George’s opinion) and slowly began working through the first one. \n\n\nHe kept thinking back to that class; how Clay looked, right in the back of the classroom, where the sun streamed in through the windows. It made his hair look dusty blonde instead of darker, and made his eyes glow when the sunlight struck them. \n\n\nGeorge gave himself a minute shake, and tried to focus. He needed to stop thinking about Clay. And yet, he couldn’t. \n\n\nThe next morning, George approached Sapnap’s locker and sighed.\n\n\n“Okay,” he admitted, against his better judgement. “I do have a crush.”\n\n\nSapnap wrapped an arm around George’s shoulders and gave him an affectionate squeeze. “You’re no longer in denial, finally.”\n\n\nGeorge rolled his eyes and ducked out from Sapnap’s arm. “Now what do I do?”\n\n\nSapnap pondered that for a moment. “Now you win him over!”\n\n\n“Yeah, yeah,” George said. “Because that’s so helpful.”\n\n\n“Luckily I can help you,” Sapnap said, “Because everyone’s had a crush on Clay at some point, so I have lots of experience. He’s pretty much everyone’s dream boy.” \n\n\n“Everyone?” George repeated, feeling a little pale.\n\n\n“Well,” Sapnap amended, “At least lots of people. He’s the most popular guy in school, you know? He’s never dated anyone though, always comes up with excuses and stuff.”\n\n\n“Great,” George said, dimming slightly. “Wonderful to know.” \n\n\nHis sarcasm wasn’t lost on Sapnap, who rolled his eyes. “If it makes you feel better, I think you have a decent chance. You’ve really caught his attention, you know?”\n\n\n“Really?”\n\n\n“Yeah.” Sapnap waited until George closed his locker, and then moved down the hallway towards his own. “He usually doesn’t get along well with people outside of our group, but he talks about you a lot.”\n\n\nGeorge stared at his friend. “He talks about me? Wait, wait, what does he say?”\n\n\n“I can’t tell,” Sapnap said, shrugging loftily. “Pinkie promise, you know?”\n\n\nGeorge couldn’t complain; his best friend was also very big on privacy, and George respected that no matter what. It was nice to hear that he possibly had a chance, though. \n\n\nThe thing was that Clay was popular— very popular. Popular enough that he could have had his choice of where to sit at lunch, or what friends to hang out with. Nearly everyone wanted to be his friend, but for some reason, he chose to sit with Sapnap and all their friends. George didn’t know how he could compete with everyone else. \n\n\nMaybe compete was the wrong word— stand out? Earn his trust? \n\n\n“Will you help me?” George found himself asking. Sapnap looked at him for a moment before breaking into a grin.\n\n\n“I’ll do everything I can,” Sapnap promised. “From now on, I’m your official wingman.”\n\n\nGeorge breathed a sigh of release. “You’re the best.”\n\n\n“Oh, I know.” Sapnap shut his locker with a slam and turned down the hallway. “First things first— can you hold these for me?”\n\n\nHe shoved a binder and a folder full of loose papers into George’s arms. Bewildered, George took them. He glanced down and then back at Sapnap. “What am I supposed to do with these?”\n\n\n“Come with me,” Sapnap said, strolling down the hallway. “I have a plan.”\n\n\n“Your plan sounds like it sucks,” George said, and rushed to catch up.\n\n\nClay was at his locker, staring at it with a tiny divot between his brows. He looked spaced out, but turned as Sapnap and George approached.\n\n\nJust then, Sapnap stuck his foot out, and tripped George. George barely caught himself, but he let go of all of Sapnap’s papers to do so. They went flying, and Clay’s mouth opened in surprise.\n\n\n“What the hell,” George hissed, and cursed under his breath. He began grabbing loose papers that had fluttered everywhere. “Why would you do that?”\n\n\n“Because Clay is helping you clean up,” Sapnap said quietly, but George could hear the smile in his voice. “Classic high school cliche.”\n\n\n“You are the worst,” George muttered, and quickly silenced himself as Clay approached with a handful of worksheets.\n\n\n“Sorry,” George said, going red, and fumbled for an excuse. “I’m— clumsy.”\n\n\nClay gave a nonchalant shrug. “Don’t worry about it.” He tapped the papers into a neat stack, and then handed them to George. “Happens to everyone.”\n\n\n“Thanks,” George said breathlessly. \n\n\nClay shrugged. Sapnap grinned. George sighed.\n\n\nIt was going to be a long week. \n\n\nThat night, George opened his computer, intending to begin his English essay, before looking down at his phone again in distraction. \n\n\nHe was debating asking Dream something, ever since he had realized how little they had been talking recently. They had discussed it once before, very briefly, when George mentioned that he was moving to a different school. Dream had asked where, and George said East Coast— in theory, the truth.  He knew it was likely close to where Dream lived; he had some sense of Dream’s timezone, from his good morning and goodnight texts, but he didn’t know exactly where. \n\n\nGeorge couldn’t control where his mum’s job took them— but George still felt like he had invaded Dream’s privacy in some way. Dream had gone radio dark for a few days after that. Hesitantly, George had checked in. Their conversation went something like this:\n\n\n georgenotfound: we don’t have to meet up \n\n\n dreamwastaken: i know. sorry for being overdramatic about it and ghosting you \n\n\n dreamwastaken: it just feels weird \n\n\n georgenotfound: i won’t bring it up again if it’s that big a deal to you \n\n\n dreamwastaken: its not that big a deal honestly it’s just.. i feel like i keep these parts of my lives so separate? i have you and then i have my irl friends. i like to keep it that way \n\n\n georgenotfound: i get that \n\n\n georgenotfound: so drop the meeting up topic? \n\n\n dreamwastaken: for now, yeah \n\n\nGeorge hadn’t pressed since then. It was true, what Dream said about keeping parts of his lives separated; his friends back in Brighton knew that he had an internet friend who he was pretty close to, but it felt odd to say that Dream was his best friend as opposed to someone in real life. He guessed that it was the same for Dream as well.\n\n\nStill, George had been living in Florida for nearly three and a half months already. He hadn’t asked since, but now that he had thought about it, it wouldn’t leave his mind. He gritted his teeth and willed himself to just say it— what was the worst that could happen? Dream would say no? That wasn’t so bad. Besides, they hadn't been talking as much recently. Maybe Dream would be more open to it this time. \n\n\ngeorgenotfound: this might come out of the blue\n\n\ngeorgenotfound: but would you ever rethink the meeting up thing?\n\n\ngeorgenotfound: it’s okay if not\n\n\nHe put his phone to the side and firmly directed his attention away from it. He felt shaky, and wasn’t entirely sure why— he had always assumed that he and Dream were going to meet up at some point in their lives, so why not now?\n\n\nGeorge finally resolved to start working on his essay, which desperately needed to be written. They had just started reading Fahrenheit 451 in class (which should have been called Celsius 232, in George’s opinion) and the teacher had assigned them to write an analysis of the first three chapters. It wasn’t the best book George had read, but it was certainly better than the lengthy Dickens novels that he had been forced to read back in Brighton. He had gotten a few sentences in when his phone buzzed.\n\n\nGeorge snatched it up in excitement, and then his heart fell. \n\n\ndreamwastaken: this probably isn’t what you want to hear but i’m not ready for that\n\n\ndreamwastaken: sorry\n\n\nIt was what George had been expecting, after all. He didn’t feel that disappointed about it. He had assumed what Dream’s answer would be.\n\n\ngeorgenotfound: that’s cool! don’t worry about it\n\n\ndreamwastaken: thanks\n\n\ndreamwastaken: sorry again\n\n\nDream was the kind of person who really valued his privacy. It had taken a while before they had even started private messaging each other, anyway, and it had taken another few months before Dream begrudgingly shared more details about his life. George never pushed— people were ready with different things at different times, of course— but at some point, he really would like to meet him. \n\n\ngeorgenotfound: its okay, i don’t mind\n\n\nGeorge looked back at his English essay and typed out another sentence, before giving up and closing his computer in frustration. He just wasn’t in the mood to write an essay just then, and he didn’t think he could bring himself to focus.\n\n\nInstead, George hopped on Minecraft, and loaded the survival multiplayer he and Dream had created a few days ago. Within a few minutes, he lost himself in the game— but he couldn’t forget Dream’s hesitancy, and he couldn’t bring himself to be any less upset.  \n\n\nIt had been one week and so far, Sapnap was the worst possible wingman in the world.\n\n\nGeorge secretly thought that Sapnap had watched one absurdly cliche, classic high school chick flick and then was basing all of his flirting knowledge off of that. So far, he had a. made George trip and fall, scattering papers all over, and now Clay probably thought of George as the biggest klutz of all time, and b. wrote an obviously fake love letter and demanded that George slip it through the slats of Clay’s locker. George promised he would do it, and then as soon as Sapnap’s back was turned, ran the letter through the paper shredder. He had standards, and writing anonymous love letters wasn’t the way to go. \n\n\nBut despite having Sapnap on his side, and slight hope that things might go well, George still found himself sinking lower. Dream had been in a mood all week, ever since George had mentioned that he had a crush. And George didn’t know what to do about it.\n\n\nThe day after talking to Sapnap confessing his crush, he had texted Dream again. This time, Dream was slightly more active, but George could tell that something was wrong. \n\n\ngeorgenotfound: i need dating advice\n\n\ngeorgenotfound: how do i get someone to like me back\n\n\nAgain, it had taken Dream forever to respond, even though George had seen that he was online. The same three dots popped up and vanished. George had been about to shut his phone off in frustration when he saw Dream’s message.\n\n\ndreamwastaken: just be yourself\n\n\ngeorgenotfound: that’s terrible advice\n\n\ndreamwastaken: then go ask someone else.\n\n\nHis message had been uncharacteristically snappy, and again, George found himself wondering what he had done wrong. There must have been something he said, or something he did wrong. \n\n\nBut also, George reasoned, it could just be stress from school, or a frustrating project that he was working on, or an argument with his parents. Dream tended to have family arguments come up often, and he was always in an odd mood after them. George was probably assuming the worst. He considered asking Dream about it, but if Dream wasn’t feeling up to sharing, George didn’t want to pressure him.\n\n\nHe looked back at their recent messages and decided to shut his phone off. Dream would come to him when he was ready; he always did. George needed to focus on other things, like his homework and social life, and everything would even itself out soon.\n\n\nUpon waking up for the next morning at school, George found himself added into a groupchat between Clay and Sapnap. The first message was from Sapnap, who mentioned a movie that he wanted to see that weekend, and asked if Clay and George would come with him. George looked at the text and facepalmed. Sapnap was as far from subtle as he could get.\n\n\nThe next message was from Clay, and it said sure. what time?\n\n\nSapnap and Clay had debated times back and forth for a bit and then eventually settled on that night, eight thirty. George sighed and realized that Sapnap was going to make George go through with this no matter what. \n\n\nSo he sent back, sounds great. that works for me :)\n\n\nThe next thing he did was check his messages with Dream, who hadn’t responded. George frowned and sent him a quick message.\n\n\ngeorgenotfound: good morning! just checking in to see if you’re ok &lt;3\n\n\nHe shut his phone off; Dream hadn’t been online for seven hours, and he was probably still sleeping. George didn’t know the exact time of Dream’s school schedule, but he figured it was pretty similar to his. After all, most public schools started around seven and ended around two, that was probably what Dream’s classes were like as well. \n\n\nLunchtime arrived, and to his great pleasure, George saw that Dream had sent him a message. On the drive to Chipotle (pizza had been vetoed by nearly everyone in the group except for him and Clay, which should be a crime against humanity) George read it.\n\n\ndreamwastaken: i’m good, there’s just been a lot going on recently\n\n\ndreamwastaken: thank you, i love u :(\n\n\nIt made George smile Dream always made him smile, regardless of where he was or what he was doing. And recently, Dream had been extra— well, George wasn’t sure what the word for it was, but Dream had been saying nice things recently. More of his texts recently had read i love u or had that little heart emoticon George loved seeing. It made George feel fluttery and warm on the inside, like he was a cat sprawled out in a patch of sunlight. \n\n\nGeorge ate his chips and guac and considered texting something back, but decided to leave it until after school. He wanted advice from Dream on what to do during a date (George was hopelessly awful at pretty much everything), and would probably ask later in the day. He didn’t want to add any additional stress onto whatever Dream was going through, but George still really valued his thoughts and opinions if Dream was open to sharing them. \n\n\nHe turned his phone off and set it to the side; he had just realized that the conversation topic had switched completely in the few seconds he was on his phone. Now they were talking about the pros and cons to watching Parks and Rec versus Brooklyn 99. George, who had seen both of them and had a clear favorite, staunchly supported Parks and Rec. \n\n\nBefore long, it was time for them to leave again. The rest of the school day passed quickly, with nothing of importance to note, but George’s stomach swarmed with anxiety about the upcoming movie that night. He didn’t know what Sapnap had planned as wingman, but George was going to lose it if it was something embarrassing.\n\n\nFortunately, George realized exactly what Sapnap had planned, ten minutes after school ended. Both Clay and Sapnap were talking by George’s locker when he arrived, and George slid his backpack off his shoulders with a thud. He spun his combination into the lock, swung it open, and then paused. \n\n\nSapnap dramatically checked his phone, and then looked back up at Clay and George.\n\n\n“Oh no,” he said, sounding not entirely upset at all. “I suddenly won’t be able to go to the movie tonight. I forgot I have a family dinner to be at.”\n\n\n“We can put it off another day,” Clay started, but Sapnap cut him off.\n\n\n“I bought the tickets online, they’re already paid for. You two should just go by yourself.”\n\n\nClay looked to George, who gave him a half shrug that he hoped didn’t come off as too eager or desperate. “If you’re sure.”\n\n\n“I’m fine,” George said. Just two friends going to see a movie together. That was totally cool. That was something normal American kids did, right?\n\n\n“Cool,” Clay said. “It’s within walking distance, so I’ll meet you there.”\n\n\n“Great,” George said. Sapnap gave him a thumbs up in the background. “Eight thirty?”\n\n\n“Eight thirty,” Clay confirmed. \n\n\nThe second Clay was out of earshot, George turned to Sapnap and accused, “You’re lying about the family dinner.”\n\n\n“Of course,” Sapnap said, with a bright smile. “But now you get to go see a movie all alone with your crush, so don’t you dare complain.”\n\n\nGeorge shoved him. “I hate you.”\n\n\n“I’m your favorite,” Sapnap said, unconcerned. “Okay. Now let’s go through every possible way for you to get with him tonight.” \n\n\n“That’s unnecessary,” George said, feeling his cheeks flame. “We don’t need to do that. It’ll just be a quiet, normal movie.”\n\n\n“Clay and George sitting in a tree, K-I-S-S-I—”\n\n\n“Shut up, Sapnap,” George said, and determinedly refused to think about it. \n\n\nGeorge stared in the mirror and tried not to feel nervous.\n\n\nWell, he wasn’t exactly nervous— nervousness for him came with a sinking feeling of anxiety, as if the day was going to be awful. The feeling writhing in his stomach was lighter, more friendly— George thought it was anticipation. He had a good feeling about this night. George thought that it was going to go well.\n\n\nStill, he didn’t want to get his expectations up, and then dash them when things didn’t go according to plan. He texted Dream with jittery fingers. \n\n\ngeorgenotfound: dream im so nervous i think i’m going on a date tonight\n\n\nDream’s response was much faster than usual.\n\n\ndreamwastaken: good luck!\n\n\ngeorgenotfound: what if we kiss\n\n\ndreamwastaken: then u kiss him back\n\n\ngeorgenotfound: wskjgjkwkjsghk\n\n\ngeorgenotfound: im so nervous. i hope it goes well\n\n\nAnother few minutes, and then:\n\n\ndreamwastaken: im sure it will :)\n\n\nReluctantly, George smiled and shut his phone off. It was bad taste to be on your phone during a date— even if Clay and him weren’t on a date. Just two boys going to the movies together. Just two boys going to the movies together as purely platonic friends. \n\n\nThe likelihood of Clay feeling the same towards him was slim to none. Still, George could hope. He reminded himself to set his expectations low— low expectations meant that anything exceeded them, and he would never be disappointed if things went badly. \n\n\nHe looked in the mirror again and took a deep, steadying breath. George was just wearing dark jeans and a plain shirt, since no one wore anything fancy to the movie theatre; thankfully, it was cooler than usual outside, in the high fifties (or fifteen degrees in Celsius, as George thought of it). \n\n\nHe made it to the theatre fifteen minutes early, even though that was almost too early for a movie, especially with trailers beforehand. To his surprise, though, Clay was already there. on a bench outside. He was texting someone when George first saw him, but slipped his phone away as soon as George greeted him. \n\n\n“Hey,” George said, as he approached. “You’re here early.”\n\n\n“So are you,” Clay said in response. “I hate being late to things.” \n\n\nGeorge nodded in agreement; he and Clay were pretty similar in a lot of ways, and wanting to be on time was one of them. It was funny, because both of them were horrible at being early to things. George couldn’t think of a single time where they had both been on time to something.\n\n\n“Let’s go inside,” Clay gestured, and George followed. The ticket attendant scanned them through, and they had a small, friendly discussion about what to get. George hesitantly brought up buying just one large tub of popcorn for “saving money purposes” and Clay readily agreed. Their conversation was nice, flowing easily from topic to topic, but it felt oddly surface level. It almost felt as if Clay was holding himself back in some way, like he wasn’t letting himself invest fully in the conversation. For some reason, it reminded George of Dream when they had first begun to talk. \n\n\nIt confused George; once George really got to know someone, he was really open about his interests and passions, and loud about how important they were to him. On the other hand, Clay was more restrained and quiet, and definitely seemed distracted. More than once, he looked at his phone, which made George’s heart sink slightly. No one checked their phone on a date unless they didn’t like their date.\n\n\nGeorge tried to stop himself from reading into everything. Maybe Clay had an important conversation with someone, maybe he had a parent to respond to— there were a dozen explanations that weren’t any of George’s business. Still, it made him feel worse. \n\n\nThe movie started after around ten trailers for movies, and George settled the popcorn bucket in between them. His heart pounded unreasonably fast. He did his best not to look over at Clay, and just act normal.\n\n\nSapnap had chosen some cheesy action movie, filled with expensive CGI and dramatic shots of car chases. George wasn’t following the plot at all, more distracted with Clay next to him. He felt incredibly hot and swallowed more popcorn to try and ignore the feeling. It didn’t quite work. \n\n\nTo his dismay, nothing really happened for the first thirty minutes. Their hands didn’t meet while reaching for popcorn at the same time. Clay didn’t yawn and stretch his arm to put around George. For all their polite, friendly conversation earlier, he was now distant and closed off. \n\n\nThen halfway through the movie, Clay turned to him and whispered, “This is such a bad movie. Why did Sapnap choose this?”\n\n\n“Who knows?” George whispered back. “Do you actually care about this?”\n\n\nClay laughed. “Hell no. I’m not even a movie person, to be honest.”\n\n\n“Let’s leave,” George said, feeling bold all of a sudden. “Go somewhere and just talk.”\n\n\nClay turned and appraised him for a moment. “Go where?”\n\n\n“The park?” George offered.\n\n\n“It’s fenced off after ten,” Clay said. \n\n\n“We can hop it,” George said. \n\n\nClay looked at him again, and then grinned. “You didn’t strike me as a rule breaker.”\n\n\n“Maybe you just don’t know me well enough,” George said. Clay raised an eyebrow, barely visible in the dark theatre, and George felt emboldened. “Let’s go.”\n\n\nClay stood up and offered George his hand, and when George took it, tugged him out of the theatre. They hit the hallway and blinked at the bright lights. Quickly, George realized he was still holding Clay’s hand, and dropped it. Clay pulled his phone out and typed out another text, then twisted his lips and put it away. \n\n\nThe walk to the park was silent, but not uncomfortably so. It was almost ten thirty, late enough that there were no cars on the street and no people on the sidewalks. One of the perks of living in the suburbs was that Friday nights were quiet, versus loud when you were living in a city. \n\n\nGeorge looked at the simple chain-link fence surrounding the park, then took a deep breath and began climbing. Clay stared at him for a moment.\n\n\n“This is a terrible idea,” he huffed, but clambered to reach the top of the fence with George. George offered him a hand, and Clay took it, warm and sturdy. He pulled Clay up to the top and they sat there for a moment, looking at the darkened park below them. \n\n\n“Sometimes bad ideas are the best,” George said. “Trust me, I’ve had many of them in my life.”\n\n\n“Yeah?” Clay said. “And how many of those have turned out good?”\n\n\n“Very few,” George laughed. “They’ve actually been pretty terrible.”\n\n\nGeorge looked down at the drop, as if calculating how far it was, and then let himself fall. He landed with a thud, and reached out for the fence to steady himself. “Your turn.”\n\n\nInstead of jumping, Clay clambered down a few feet and then let himself down slowly. The earth was soft beneath his feet, and George reached out with a hand to steady him slightly.  \n\n\nNow that they were in the park, George looked around blankly. Now what?\n\n\n“Let’s go to the playground,” Clay said. Clearly, he knew this park better than George did. He started off in the general direction of it, and George matched his pace. “I used to play there all the time as a kid.”\n\n\n“Have you lived in Florida your whole life?” George asked. Clay nodded.\n\n\n“I was born in Miami, but then I moved to Orlando when I was just a baby. I don’t think I’ve ever been out of the state.”\n\n\n“One day you should go to Brighton,” George offered. “I think you would like it.”\n\n\n“Yeah?” Clay said, looking amused. “With your snow and cold weather?”\n\n\n“It’s not that cold all the time,” George said. It was true; Brighton got quite hot in the summers as well. “You get used to it, especially if you’ve grown up there.”\n\n\nClay hummed, and didn’t say anything in response. The playground appeared in the background; it was lit up by a few yellow street lights, and slightly obscured by mist, but grew clearer as they approached. When they reached it, George reached the monkey bars and clambered up to the top. The metal was slick with condensation below his fingertips, and slightly slippery to hold onto. \n\n\n“Come on up,” George called. Clay made no move towards it, and George paused for an uncomfortable second. “You okay?”\n\n\n“I don’t like heights,” Clay admitted slowly, looking up at the monkey bars as if he were a little queasy. \n\n\nGeorge blinked. “Heights aren’t that bad.”\n\n\nClay shuddered. “It’s just… falling. What if you fall?”\n\n\n“You won’t fall,” George said. “Come up here and test it.”\n\n\n“Now I know you’re fucking with me,” Clay said. “I’m not coming up there.”\n\n\n“Please?”\n\n\nClay stared, then gritted his teeth and began to climb up to George. He faltered in his steps more than once, but swung his legs up until he was sitting on top of the monkey bars, a few feet away. He looked obviously uncomfortable, and George wanted to make him relax more.\n\n\n“You’re not going to fall,” George said, and then winced. He shouldn’t say that to someone who was scared of heights. “It’s easy to get up and get down. I do this all the time.”\n\n\n“All the time?” \n\n\n“When I was a kid,” George amended. “You don’t really have that much time for playing once you grow up.” \n\n\n“Tell me about it,” Clay said. George laughed. “Computer science is kicking my ass right now, I’m so far behind.”\n\n\n“You code?”\n\n\n“I’m learning,” Clay said. “Slowly, but still.”\n\n\n“Me too,” George surprised himself by saying. He usually didn’t tell people he liked coding, or that he wanted to be a programmer when he grew up. None of his friends wanted to do that, back in Brighton, so he had kept it mostly to himself. “I’m learning Java.”\n\n\nClay hummed and nodded. “Good program to learn.” \n\n\nGeorge agreed with him; it was easy, and the more he worked on it in his free time, the better he got at it. He shifted so his legs swung over the side; they were easily fifteen feet up, which wasn’t an impossible drop, but he could understand Clay’s hesitation. \n\n\n“I can’t believe Sapnap ditched us,” Clay said. It almost came out of the blue. “He’s such an asshole sometimes.”\n\n\nGeorge huffed a small laugh. “He probably would’ve made us watch the entire movie.”\n\n\nClay nodded in agreement, and then his mood dimmed somewhat. His voice was low when he admitted, “I was kind of looking forward to hanging out with him, though.”\n\n\nGeorge suddenly felt quite awkward. “Sorry that I’m here instead.”\n\n\n“No, no, you’re fine,” Clay waved a hand in dismissal. “It’s just… he’s one of my best friends. We’ve known each other since we were kids, you know? We met in first grade.”\n\n\n“What year is first grade?” George asked. He didn’t know the age of American grades versus British grades. \n\n\n“I was five,” Clay said, as if he had to recount the years. “I think.”\n\n\nGeorge made the connection in his head— first grade in America was the same as year two in the UK. “It must be nice to have a friend like him for so long.” He tried not to feel lonesome; George had never had a friendship last that long. The closest thing he had to that was Dream, who he had been talking to for four years.\n\n\nClay nodded. “He’s always been my best friend, so it’s a little weird to see the two of you catch on so quickly. I feel like I haven’t had time alone with him in so long.”\n\n\n“Sorry,” George said again, feeling a little sick. “I don’t want to overstep, it’s just… I’m an introvert, and he pretty much kidnapped me into being his friend. I don’t have control over it at this point.” \n\n\nClay laughed dryly. “I know. You’re not overstepping, honestly, it’s actually nice to have you in the group.” He gave George a smile— not one of the cocky, self-assured smiles he gave others, but a softer, realer one. “It’s nice to get to know you.”\n\n\nGeorge felt himself smiling in response. “Same for you. I’m glad we’re friends.”\n\n\n“Friends,” Clay muttered. George’s heart jumped; had he said something wrong? But Clay didn’t look upset, and instead just looked to the sky. This night, the stars were obscured by mist, and could barely be seen through the glare of the street lights. Still, George looked up with him; there was a blinking light crossing through the sky, probably from an airplane. It tracked across the sky, vanished through a cloud, and then reappeared once more. \n\n\n“So,” Clay said, breaking the silence, “What’s your favorite colour?”\n\n\n“Hm?”\n\n\n“You said we’re friends,” Clay said. “But how can we be friends if I don’t know your favorite colour?”\n\n\nGeorge laughed. “I’m colorblind.”\n\n\n“Wait, really?”\n\n\n“Yeah,” George said, “I pretty much only see yellow and blue, so those are my favorite colours.”\n\n\nClay glanced down at the hoodie he was wearing. “So you can’t see green?”\n\n\n“It just looks yellow,” George said, looking at the hoodie. “Honestly, it doesn’t bother me much. Everyone always makes this big deal out of it, but I can’t tell the difference.”\n\n\nClay rolled his eyes. “I guess that’s true.” \n\n\n“What’s your favorite colour?” George asked in return.\n\n\n“Green,” Clay answered instantly. “Always has been.”\n\n\nThere was a moment of silence, and then Clay broke it again. “What’s your favorite food?”\n\n\n“I don’t know,” George said thoughtfully. “Maybe mac and cheese, if it’s made well. My mum makes it sometimes, it’s great. You?”\n\n\n“Pizza,” Clay said, “Or banana pudding, probably.”\n\n\nGeorge smiled. Clay reminded him of Dream sometimes, especially now— Dream liked banana pudding too, George had teased him about it several times. \n\n\n“Alright,” Clay said, shifting on the monkey bars so he was sitting more firmly. George didn’t miss how his knuckles went white as he moved, gripping tightly so he didn’t fall. “You ask a question now.”\n\n\nGeorge hummed and tried to think of something. Finally, he asked, “Are you a cat or dog person?”\n\n\n“Easy answer,” Clay said. “Cats all the way. I have a cat named Patches.”\n\n\nGeorge nodded. “Me too. Not having a cat part, but I’ve always wanted one.” He looked down and sighed. “I was pretty close to convincing my mom to get one, but then we ended up moving, and it just wasn’t possible anymore.”\n\n\n“If you want,” Clay offered, almost hesitantly, “You could come over and meet Patches sometime. I think she would like you.”\n\n\nAgainst his will, George’s heart fluttered, and he tried not to smile. This night was going better than he could have possibly imagined, and now Clay had literally invited him over. He tried his best not to be awkward and said, “Someday, sure.” \n\n\nThere was comfortable, peaceful silence between them for a second, and then Clay checked his phone for the millionth time that night.\n\n\n“It’s midnight,” he said in surprise. \n\n\n“Huh,” George said. They’d been talking for over an hour. He hadn’t realized how quickly the time had passed. “Should we go?”\n\n\nClay grimaced. “Probably. My dad will worry if I’m not back soon.” \n\n\nGeorge tried not to feel disappointed about the sudden end to his night. It had already exceeded his incredibly low expectations, and he had something to look forward to. He was feeling much more positive about Clay potentially liking him back. He didn’t want to do anything rash to ruin the nice bubble of the night, like confessing stupidly, so instead he stayed quiet. Carefully, he measured the jump down from the monkey bars, and then jumped. \n\n\nIt sent jolts up through his legs, but he landed comfortably. He turned to look back up at Clay, who was still sitting there, frozen.\n\n\n“How do you get down?” Clay said, and tried to laugh to play off his obvious discomfort. “I can’t… I can’t jump.” \n\n\nGeorge looked at the monkey bars, and the way he had gotten up. “If you scoot to the end, you can land on the steps down.”\n\n\n“Sure,” Clay breathed, and slowly made his way over. \n\n\n“You’ve got this,” George said. “It’s not a long drop once you’re there, you can do it.”\n\n\nFinally, Clay lowered himself off, and then hopped the much shorter distance down the ground. He looked back up at the monkey bars and shuddered. \n\n\n“Pretend I’m not afraid of heights,” he said. “It ruins my whole “cool kid” aesthetic.”\n\n\nGeorge smiled reluctantly. “I think it makes you more real.”\n\n\n“Real?”\n\n\n“Yeah,” George said. “Sometimes I feel like you’re so good at everything that you can’t possibly be real.” \n\n\n“Good at everything?” Clay said, his tone almost teasing, like he was inviting George to continue. \n\n\n“Math, coding, making friends…” George said, though there were many more examples he wouldn’t dare say out loud. He felt his cheeks go hot and thanked God that it was too dark to see if he was blushing or not. “All of that.”\n\n\n“Yeah?” Clay said, and his tone was definitely teasing now, and if George didn’t know better, he would say it sounded flirty. “Making friends?”\n\n\n“Uh, sure,” George said, awkward and clumsy, and instantly, the mood changed. Clay retreated slightly, and George felt a sickening feeling as he realized that Clay had just gone back to the closed off, detached person he had been at the beginning of the night.  \n\n\n“We should go,” Clay said abruptly. “It’s late.”\n\n\n“Okay,” George stammered. George didn’t know what had changed, or what he had done to make Clay retreat like that. The sickening feeling in his stomach only grew. “Let’s head out.”\n\n\nThe fence was easier to hop this time around, and clinked in the darkness as they clambered over unsteadily. As they walked back, the suburban streets were quiet, enough that they ended up walking along the dotted white line in the center. The air was soft and misty, but not rainy, and streetlights cut through it in waves of yellow. Before long, Clay and George approached the turn off for George’s house. He was disheartened in more ways than one. It was peacefully quiet; he didn’t want to lose that. \n\n\n“See you tomorrow,” George said.\n\n\n“Bye,” Clay said. It almost sounded regretful— if George didn’t know better, he would say disappointed. “Tomorrow.”\n\n\nWithout another word, they continued their separate ways. George kept walking, and his mind replayed the events of the night over and over. Despite the lack of— well, anything romantic, except for that last conversation in the park— it had gone surprisingly well. Out of habit, George checked his phone, and realized he had a few missed texts from Dream.\n\n\ndreamwastaken: are you done with your date yet\n\n\n\nsent: over an hour ago\n\n\n\ndreamwastaken: george its been forever \n\n\n\nsent: seventeen minutes ago\n\n\n\ndreamwastaken: if u blow me off… i swear.. i am accepting new best friend applications\n\n\n\nsent: three minutes ago\n\n\n\nGeorge smiled down at his phone and tapped out a quick response. \n\n\ngeorgenotfound: you are so needy. the absolute worst\n\n\ndreamwastaken: i know you’re lying you love me\n\n\ngeorgenotfound: …. i can leave\n\n\ndreamwastaken: no come on im joking :(\n\n\ngeorgenotfound: i’m aware &lt;3\n\n\ndreamwastaken: doing anything rn\n\n\ndreamwastaken: besides ur date haha\n\n\ngeorgenotfound: i might get on minecraft tbh. do you wanna try that plugin from forever ago?\n\n\ndreamwastaken: yes of course i’ll get on in a few minutes\n\n\nGeorge unlocked the door to his house and immediately headed upstairs, ignoring his mum watching some soap opera in the background. He booted up Minecraft and could already hear his computer overheating— he really should begin investing in getting a new one. \n\n\nStill, as Dream entered the server and immediately started playing, George couldn’t help but think of Clay. For some reason he wished that Clay was playing Minecraft with him, though that felt weird to think. He really liked Clay, always wanted to be with him, and that made George’s stomach do uncomfortable turns in his gut.\n\n\nDream had always been enough for him. So why did George suddenly feel like he wasn’t?\n\n\n George, as it turned out, was not prepared for Halloween.\n\n\n Halloween in Britain was not a big thing. He had heard about it, of course, and the length some people went to, but it was always a back-of-the-mind thing. Rarely anyone went trick-or-treating where he lived, and no one dressed up in elaborate costumes. America, however, did not function like that. \n\n\nThe entire school, seemingly overnight, was decked out in what seemed to be orange and black decorations, even though it was just yellow for George. Streamers were draped over everyone’s lockers, and bulletin boards were filled with pumpkin stickers and bats. Festive autumn leaves were scattered throughout the hallways. Classroom doorways were plastered with signs that read “trick or treat” or “Happy Halloween”. Even fake candles were lit up and down the hallways, complete with fake cobwebs and plastic spiders dangling from them.\n\n\nThere were still a few days until the actual holiday, George thought, tearing strings of cobweb off his locker irritably so he could open it. Why was the entire school overreacting now?\n\n\n“Woah,” Bad said, approaching from behind him. “Why the bad mood?”\n\n\n“I’m not in a bad mood,” George said, “These stupid decorations are everywhere.”\n\n\nThat wasn’t entirely true— he was in somewhat of a bad mood. Even after that night talking with Clay, nothing more had happened between them. They hadn’t texted, hadn’t hung out together, and George was more and more confused by the day. He knew that immediately getting together was unrealistic, but a tiny part of him had secretly hoped that things would be that easy.\n\n\nAnd Dream had been oddly silent the past few weeks: interacting with George less, offline more and more, and although George didn’t want to admit it, he desperately missed him. He had always relied on Dream to talk through things, and seeing Dream draw away was painful.\n\n\n“You’re just not in the Halloween spirit,” Bad said, drawing him out of his thoughts. “You’re coming to our party, right?”\n\n\n“Party?”\n\n\nBad’s jaw dropped. “You don’t know about our Halloween party?”\n\n\n“No,” George said, and felt something sick rise in his stomach. He tried to push it down; it was understandable that there were things he had been excluded from. Everyone had closer friends and better people to be with. \n\n\n“It’s Saturday,” Bad said, completely oblivious to George’s inner workings. “It’ll be fun.”\n\n\n“I’m not much of a party person,” George said. \n\n\nBad beamed. “Good, because by party we actually mean go trick or treating for six hours, steal a ton of candy from children, and then eat it all while watching horror movies. And you’re definitely coming.”\n\n\nThe pit of anxiety in George’s stomach began to dissolve slightly. Carefully, he confessed, “I’ve never gone trick or treating,” and watched as Bad gaped. \n\n\n“Is Halloween not a thing in Britain?”\n\n\n“Not really,” George said, “I know all about it, of course, but I’ve never…” he gestured with a hand, “Done any of this.”\n\n\n“You’re missing out,” Bad declared. “Halloween is the most fun time of the year! It’s my favorite day, personally.” \n\n\n“Sure,” George said, and gestured. “Like this is fun.”\n\n\n“You’re such a downer,” Bad said, but his voice was tinged with amusement. “Have you decided on a costume?” \n\n\n“I don’t even know where I would go to get a costume,” George said, “So no.” \n\n\n“You and I are going costume shopping tomorrow, then,” Bad promised. “It’s going to be so fun.”\n\n\n“I doubt it,” George said, and Bad rolled his eyes and laughed. \n\n\nThe other thing about Halloween was that a booth by the leadership classroom had opened up, complete with paper cutouts of bats and owls and pumpkins. George walked by it every day on his way to Spanish, and after staring at it in confusion for a few days, finally caved and asked Ponk what it was for. \n\n\n“Candy grams,” Ponk said, like it was obvious. “Lakeside High does this at every holiday, Christmas, Valentine’s Day, Easter, you name it. It’s just a little message you can send to people.”\n\n\n“Seems dumb,” George said vaguely. \n\n\nPonk waved a hand. “Yeah. You can send them anonymously too, all of that, it’s just two dollars. It’s some fundraising thing.”\n\n\n“Does everyone send them?”\n\n\n“Bad sends them out to all of us,” Ponk said. “No one else in our group does, but practically the entire school sends them. You’ll see. It’s even worse at Christmas.”\n\n\nOh, God. If this was how the school reacted for Halloween, he could hardly wait to see how they acted around Christmastime. \n\n\nGeorge considered the booth for a moment and the miniature candy grams on it. Would it be worth it to write one?\n\n\n“Fuck it,” he muttered, and dug two dollars out of his pocket. What was the harm, anyway? You could send them anonymously, after all, and maybe he would get lucky and get one in return. \n\n\nHe sat there for a moment, trying to figure out what to say, before carefully writing it down in his nicest handwriting. It looked completely different from his usual messy scrawl, which was good, because George didn't want to be completely embarrassed. He handed the message back to the person manning the booth. She smiled and put it on the stack of candy grams, set to be delivered on the last school day before Halloween— the thirtieth of October. \n\n\nThe rest of the school day passed in absolute boredom. In math, Clay and George had paired again for in-class assignments. George was certainly much better at precalculus now that Clay was helping him with it. They didn’t mention that night in the park, and George didn’t bring it up. Instead, things had gone back to the way they were before— polite, cool, and somewhat distant. It scratched at the back of George’s mind uncomfortably. He wanted to change it, but he didn’t know what to do.\n\n\nLunch passed as usual, then computer science, and then Spanish, and then he was heading home, with tentative plans to go costume shopping with Bad the next day. Despite the negative start to the day, it was actually looking up. \n\n\nBefore he knew it, Friday morning was upon them. It was the thirtieth of October, one day before Halloween. For some reason Lakeside High School didn’t allow costumes unless it was actually the thirty-first (which George had heard both Clay and Sapnap complain at long about), but the hallways positively buzzed with excitement. \n\n\nGeorge actually felt somewhat excited as well. Most of his bad mood had melted away after talking with Dream until one AM the night before, and the incessant enthusiasm about Halloween had put him in more of a holiday mood. He went to his locker first, unlocking it to dump a textbook in, and then was promptly surrounded by the entire friend group.\n\n\nAlyssa rubbed her hands together. “It’s almost Halloween!”\n\n\n“And it’s on a Saturday,” Sapnap gloated. “The best day for Halloween.” \n\n\n“I still haven’t picked out my costume,” Skeppy mourned. “It all depends on this afternoon.”\n\n\n“Why?” George asked curiously.\n\n\n“Whoever gets a higher grade on our English test picks the costume for us,” Bad cut in. “I’ve got it in the bag. Skeppy, your costume is going to be incredible.”\n\n\n“I think Skeppy might have gotten a higher grade,” Ponk said amiably.\n\n\n“I studied all week for it,” Skeppy declared. “I know I’m winning.”\n\n\n“Well, you’ll find out right after lunch.”\n\n\n“Speaking of lunch—”\n\n\nA chorus of groans echoed from the group. “Candy grams.” \n\n\n“I’m so excited!” Bad exclaimed. “I bought one for all of you guys, it’ll be so fun.”\n\n\n“I hate candy grams,” Alyssa said despondently. “Stupid popularity contest.”\n\n\nGeorge frowned. “I thought they were just for fun.”\n\n\n“They are just for fun,” Ponk explained, “But they also get passed out right before lunch, and everyone who gets them brags about it. It’s exhausting.”\n\n\n“It can’t be that bad,” George said. “It’s just a piece of paper and a Halloween candy, right?”\n\n\nAlyssa exchanged wry glances with Ponk. “You’ll see.” \n\n\n“That’s very ominous,” George said dryly, and slammed his locker closed. \n\n\nBefore he knew it, fourth period rolled around: precalculus, with Clay. Clay flashed George a grin as he entered the classroom and took his seat. George returned it, and settled back in his seat. \n\n\nTwo minutes in, the candy grams struck. \n\n\nThe teacher sighed and allowed the teacher’s assistant in to deliver them. There were a few given to a girl in the front row, and two given to a boy in the back of the room, and then surprisingly, two for George. He didn’t look at them yet but put them in the mesh pocket of his backpack for later. \n\n\nTheir teacher resumed the lecture, got as far as ten minutes in, before they were interrupted again. By the end of the class, to George’s extreme surprise, he had actually gotten seven candy grams, which was six more than he expected. Most of them were cute notes scrawled in glittery gel pen from girls around the school, and, flustered, George put those away as soon as possible. The last one was clearly from Bad— George remembered Bad saying that he had given candy grams to all of his friends.\n\n\nClay, on the other hand, had been positively flooded with candy grams. It didn’t help that George was sitting right next to him, too— their precalculus class was constantly disrupted with different TA’s coming in to gift candy grams to Clay. Every time it happened, the poor deliverer had to squeeze all the way down the desk row to drop them on Clay’s desk. George wasn’t sure how anyone was supposed to get work done with the classroom constantly being interrupted.\n\n\n“If you get any more of those, I’m going to make you sit in the hallway,” their teacher had threatened. Clay gave an award-winning grin and held up both hands as if to say, can’t help it. \n\n\nGeorge tried to ignore the envious looks directed towards Clay from almost every other person in the room. Clay sighed audibly as he packed up his backpack, and then took another gaze at the mess of candy on his desk and scowled. \n\n\n“Hold these for me,” Clay said, and dumped about a dozen candy grams into George’s arms. “I hate these, I always get so many.” \n\n\n“Must suck,” George said. He didn’t even realize how sarcastic he sounded until Clay rolled his eyes and laughed. \n\n\n“It’s just all from people I don’t even talk to. It’s just annoying to get these and then have people expect something in return. Like—” he plucked a random one from George’s hands, and opened it, “I don’t even know who Lucy is. I couldn’t pick her out of a lineup. So why did she send me one?”\n\n\n“Because she likes you,” George said reasonably. “Obviously.”\n\n\nClay sighed, ripped the paper note off, and tossed it in the recycling. He reached for another candy gram and did the same. “Makes no sense, but sure.”\n\n\n“Not even going to read them?” George said. Clay paused. \n\n\n“What’s the point?” Clay said. “There’s too many.”\n\n\n“Huh,” George said, and watched forlornly as whatever candy gram he had sent to Clay in stupid, teenager hopefulness disappeared under a wave of similar, boring, unimportant messages. \n\n\n“Catch,” Clay said. George stuck his hand out, and somehow perfectly caught the piece of candy Clay had tossed him.\n\n\n“No thanks,” George said, wrinkling his nose. He flicked the candy back at him. “I hate Snickers.”\n\n\n“What’s your favorite, then?” Clay gestured to the mess of candy on his desk. “Take as many as you like, I can’t possibly eat them all.”\n\n\n“Reese’s,” George said, and unwrapped one from the pile. “Chocolate and peanut butter? Perfect.”\n\n\n“Snickers are chocolate and peanut,” Clay pointed out. \n\n\n“Yeah, but the texture is all off,” George argued. “Plus the caramel ruins it.” \n\n\nClay shrugged. “As long as you don’t like Almond Joys, we can still be friends.”\n\n\n“Good thing we’re still friends,” George said, and ignored how his heart twisted at the words. \n\n\n“Come on,” Clay said, and beckoned. “Everyone’s waiting for us.”\n\n\nGeorge nodded quickly, shouldered his backpack, and followed him. \n\n\nIt was true, what Alyssa had said about the candy grams being a popularity contest; everywhere he went, he saw people flicking through the messages people had written to them. People gathered in tiny clusters in the hallways, laughing and talking, and slowly, George began to leech off of them. He was excited— tomorrow was going to go well. He just knew it. \n\n\nGeorge and Clay slung their backpacks off at the lunch table, and Skeppy shuffled over to give them a place to sit. \n\n\n“Well?” Ponk said, looking at Clay. “How many did you get?”\n\n\n“Enough to share.” Clay tossed a chocolate bar at the back of Sapnap’s head, who winced and scowled in Clay’s direction. “Eat up, everyone.”\n\n\n“You’re the best,” Alyssa sighed, and swiped a Kit-Kat from the mess in the middle of their lunch table. As everyone divided up the spoils of war, Clay methodically tore off the messages attached to them until they were all balled up for the recycling. \n\n\n“Save all the peanut butter cups for George,” Clay said offhandedly, “They’re his favorite.”\n\n\nGeorge flushed and looked down. Sapnap kicked him under the table and George kicked back. \n\n\nEveryone seemed giddy and excited, talking over Halloween and their costumes and their plans for trick-or-treating and most of all, how much candy they were going to buy the next day when it was half-off. Before he knew it, the warning bell had rung. \n\n\n“I’m going to head to physics,” Clay said, and pushed himself up from the table. “I’ll see you guys all after school.”\n\n\nThere was a chorus of goodbyes, and then Clay vanished into the crowd of students. A few heads turned as he passed, but Clay took no note of them. George watched him walk away and then turned back to the table.\n\n\n“That didn’t seem too bad,” George said thoughtfully. “The whole candy grams thing. You really made it sound ominous.”\n\n\n“That’s just because Clay is the nicest person to walk the planet,” Bad said affectionately. “He would never brag about things like that.”\n\n\n“You sure about that?” Sapnap said dryly. \n\n\n“Yes,” Bad insisted. “At least, not while I’m around.”\n\n\n“You need to hang out with Clay more,” Sapnap laughed. “He’s such an asshole.”\n\n\n“I’ll tell him you said that,” Alyssa said, half seriously. \n\n\n“Do it,” Sapnap challenged. “He’ll just say it back.” \n\n\n“You guys are so dumb,” Ponk sighed. “And you’re all going to be late if you don’t hurry up.” \n\n\nGeorge looked at the time and blanched; the warning bell had rung nearly four minutes ago, and he was certainly going to be late to computer science, which was halfway across school. Hurriedly, he packed up his backpack and waved goodbye to everyone; he would see them all tomorrow night regardless. \n\n\nAfter school ended, George began his slow walk home. Sapnap joined him for the first few blocks as they left campus. They talked for a bit about Halloween; Sapnap still hadn’t decided on his costume, even though Halloween was tomorrow. George’s costume was a secret— he had picked it out with Bad a few days ago, flicking through the racks of costumes at Party City downtown.\n\n\n“That was nice,” he said offhandedly.\n\n\n“What?”\n\n\n“Clay at lunch,” Sapnap said, with a devilish grin. “You two seem to be getting along well.”\n\n\n“Oh, shut up.” \n\n\n“And you never told me about your movie date,” Sapnap said excitedly. “How did it go?”\n\n\n“Clay probably told you already,” George said. “And it wasn’t a date.”\n\n\n“He told me you guys ditched the movie,” Sapnap said, “Which first, rude, but second, what happened after?”\n\n\n“Nothing,” George said, “We went to the park. It was nice.”\n\n\n“That’s it?” Sapnap teased.\n\n\n“Believe me,” George said, “If something had happened, you would know about it.” \n\n\n“You sure?” Sapnap said skeptically.\n\n\n“Yes,” George insisted. “And nothing did happen. We sat and talked for a few hours and then went home.” \n\n\nSapnap nodded approvingly. “It’s a good start. Maybe I should trick you two into being alone together again.”\n\n\n“You’re so bad at this,” George mumbled. “You’re the worst wingman in the world.”\n\n\n“Don’t say that,” Sapnap said affectionately. “I’m helping you out here.”\n\n\n“Sure,” George said skeptically, and Sapnap laughed.\n\n\nThey reached the turn off for George’s street, and George waved a goodbye to Sapnap and turned down. Sapnap called after him:\n\n\n“You’re coming tomorrow, right?”\n\n\n“I am,” George called back.\n\n\n“You promise?” \n\n\n“I promise!”\n\n\nSapnap flashed him a bright smile, visible even from that distance. “Then we’ll see you tomorrow night.” He tapped two fingers to his temple in a sarcastic salute, and then vanished from eyesight. \n\n\nGeorge thought about Dream yet again. He wondered if Dream was doing anything for Halloween, or if he was planning to sit at home and pass candy out. He suddenly realized that he hadn’t talked much to Dream in the past week; he had spent so much time talking with Clay, Sapnap, and everyone else that he had barely texted Dream much at all. George felt guilty about it; he loved his friends at school, but far more than that, he loved Dream. In the spur of the moment, George texted him:\n\n\ngeorgenotfound: this is sappy but you’re my best friend and im glad you are\n\n\nGeorge worried that he would ignore it; Dream had been more distant lately, upset over something that he wouldn't talk about or hint at, and George didn’t know if he was in the mood to talk. But it only took a few seconds for Dream to reply. \n\n\ndreamwastaken: thanks, i really appreciate that\n\n\ndreamwastaken: its been a rough week lmao\n\n\ngeorgenotfound: hopefully i can make it better\n\n\ngeorgenotfound: minecraft?\n\n\ndreamwastaken: okay :) \n\n\nGeorge hurried his step and unlocked his front door; if Dream was already on their server, he didn’t want to miss a single minute of it. His phone buzzed again, and George read it:\n\n\ndreamwastaken: i’ve kinda missed this\n\n\ngeorgenotfound: me too\n\n\nHe saw Dream typing something, the three dots rising and falling, until he stopped typing altogether. George waited for the message to come through, but it never did. \n\n\nGeorge booted up Minecraft, closed his bedroom door, and settled into his desk chair. He would spend tonight with Dream, and tomorrow with Clay and the rest of his friends. \n\n\nIt was going to go great. George would make sure of it. \n\n\nThe next day, George awoke to two different messages. One was from Dream, and George read it quickly and responded:\n\n\ndreamwastaken: happy halloween best friend \n\n\ndreamwastaken: also good morning! hope u slept lots\n\n\ngeorgenotfound: i slept ten hours so i won’t be tired for next week, im getting all my sleep in now\n\n\ngeorgenotfound: and happy halloween too!! \n\n\nThe next message was a group text that he had just been added to a few hours earlier: Ponk was reminding them all that they were meeting in front of his house at seven, and they should bring some sort of bag for when they go trick-or-treating. Skeppy added that they should bring pillowcases; they were planning to go through the expensive area of the suburbs, where all the old, rich people gave out full candy bars by the handful. \n\n\nBad texted as well: and bring pajamas too, we’re having a sleepover! \n\n\nDid people still have sleepovers in high school? George had assumed they were just a childish thing, but apparently not. \n\n\nHe ended up walking to Ponk’s house as the night arrived. It wasn’t far, just a few blocks away, and there was still sunlight at seven PM. Enough of it shone through the scattered clouds to make the entire neighborhood golden. \n\n\nNearly all of the houses were decorated, too, speckled with yellowish ghosts or black giant spiders. One house had set up fake gravestones over their front lawn, complete with skeletal hands reaching up out of the ground. Another house had a massive black cauldron in front, filled with fog that poured down the sides.\n\n\nAlready, there were dozens of kids walking around too, clutching onto their parents’ hands excitedly. They were all dressed up as tiny pumpkins or bats or owls— there was one in a tiny princess costume, and another dressed as a mini elephant— each going up and knocking on doors, demanding candy. \n\n\nGeorge hurried his step; he was supposed to have been at Ponk’s five minutes ago, and he hated being late. He was sure he would be the latest; he had been staring at all the decorations on his way. When he arrived, though, he found that he wasn’t the last person there. Everyone was sitting on the stairs to Ponk’s porch, and George waved shyly as he approached.\n\n\n“George!” Alyssa exclaimed. “You’re here!”\n\n\n“Hi,” George said, and looked to Ponk. “I brought pajamas, right?”\n\n\n“Yeah, you can leave them inside—” Ponk gestured to the front porch— “We’ll come back here after we’re done.”\n\n\nQuickly, George opened the front door and looked inside— there was a wide sofa near the front that seemed to have everyone’s clothes laid out there. He dropped his stuff off and came back outside. Still, Clay and Sapnap hadn’t arrived yet, and they were the only two people missing. \n\n\nGeorge took in everyone’s costumes, caught sight of Bad, and laughed. Both Skeppy and Bad were in bright yellow duck onesies. He mimicked taking a picture of them, and Bad pulled the hood of his onesie down over his face and grumbled.\n\n\n“I was going to be a devil,” he said, downcast. “I was so close, too! I lost the bet by one point.”\n\n\n“I think you look great,” Skeppy said cheerfully. “We’re in matching costumes!”\n\n\nAlyssa, standing next to Ponk, smiled. She was dressed in black and yellow stripes, and had a headband with two dangly pom poms on it. On her back was a tiny pair of yellow wings. “I like the ducks. They’re cute.”\n\n\nPonk nodded along in agreement; he was in a cheap suit, with the shirt underneath halfway unbuttoned to show a Superman logo. His hair was slicked back and he had a pair of glasses on his nose— clearly, Clark Kent. \n\n\nGeorge wasn’t too sure about his costume, but after nearly an hour of flicking through costumes with Bad had convinced him. He was in a blue astronaut jumpsuit, with NASA printed in red and white across his chest. The belted part was silver and reflective, and Bad had convinced him to buy a pair of white “clout goggles” to go along with it. George thought they looked stupid, but Bad was so enthusiastic that he didn’t really mind. \n\n\n“We’re just waiting on Sapnap and Clay,” Ponk said, and sat down on the front porch. “They take forever, I bet they’re fighting over each other’s costumes.” \n\n\n“Nah, they probably just don’t have costumes and are trying to come up with something last minute,” Alyssa said. \n\n\n“Probably a mix of both,” George said, and everyone laughed. \n\n\nIt took another five minutes for Clay and Sapnap to arrive, and George could hear their bickering from all the way down the street. Neither of them seemed to be in a costume, and Alyssa shot a smug glance at Ponk, that seemed to say told you. \n\n\nGeorge frowned as Sapnap came closer. “What are you dressed up as?”\n\n\n“I’m an e-boy,” Sapnap said, and pointed to his shoes. “See? Checkered vans.”\n\n\nClay rolled his eyes. “It’s the dumbest costume I’ve ever seen.”\n\n\n“Oh, yeah?’ Sapnap countered. “Then what’s your costume?”\n\n\nClay pointed to the tiny halo on his head. “An angel.”\n\n\n“Ha ha,” Sapnap said, clearly not impressed. “How could I have gotten that wrong?”\n\n\n“Don’t know,” Clay said, acting supremely unaffected. “Must be how stupid you are.”\n\n\n“I am not stupid,” Sapnap said indignantly. “You’re the worst.”\n\n\n“Let’s get started,” Ponk butted in. “We’re going to Palm Hills, the richest neighborhood in Orlando. Everyone who lives there is ridiculously stacked and gives out the best candy.”\n\n\n“There’s this old rich couple who lives there,” Sapnap said, “They give out three full-size candy bars. To everyone.” \n\n\n“Ah,” George said, not having any basis on how much candy people gave out. “Cool.”\n\n\nAlyssa shoulder-checked him. “You’ll see when we go,” she assured. “This is going to be the best Halloween ever.” \n\n\nGeorge grinned; there were moments when he was incredibly grateful that he had made such amazing friends, and this was one of them. \n\n\nThe hike to Palm Hills was around twenty minutes long, but the time passed by like the wind. On the way, they stopped at every single house to ring the doorbell and demand trick-or-treat. The first house, George was almost too nervous to go up on his own, but by the tenth, George had no qualms about asking for candy from complete strangers. \n\n\nEverywhere they went, adults opened the doors and passed out dozens of candies. George’s pillowcase was nearly halfway full only an hour into trick-or-treating. He and Ponk made a game out of finding the worst possible costume (George was staunch on someone who had painted their body to look like the Kool-Aid man, while Ponk was insistent that an adult dressed as a sexy minion was worse). \n\n\nMore than one adult asked why there were a bunch of teenagers out trick-or-treating when it was supposed to be a kid’s holiday. Still, Clay assured him that all teenagers got judged for going trick-or-treating past age 13, and the important thing was to just not care about it. Halloween was supposed to be a fun holiday, and there was no age limit on having fun.\n\n\nBefore he knew it, the sun had dipped low in the sky, and the moon had risen until it was nearly directly overhead. The streets were almost empty by then, illuminated with spooky Halloween decorations. Their pillowcases were filled to the brim with candy, and on the walk back to Ponk’s house, everyone started trading their candies with one another. Voices rang out:\n\n\n“Does anyone want my Three Musketeers?”\n\n\n“Ooh, Skeppy, I’ll trade you for three peanut butter cups.”\n\n\n“No one wants your Almond Joys, Clay.”\n\n\n“I’ll give you two Snickers for one king size Kit-Kat.”\n\n\n“Deal,” Bad said, rummaging through his bag and passing it over. Tentatively, George joined in with the discussion. He wasn’t a sweets person in particular, but if people wanted something, George was happy to give it. \n\n\n“George,” Clay said, looking through his bag, “Do you have any M&amp;Ms?”\n\n\nWithout a second thought, George passed them over. Clay gave him a small smile. George felt his heart skip a beat in his chest. \n\n\n“Do you want anything in return?” Clay asked, and then as if answering his own question, dropped two peanut butter cups in George’s bag. \n\n\n“Thanks,” George mumbled. He thanked God that it was too dark for anyone to see him blush. \n\n\nBefore long they arrived back at Ponk’s house. At this point, most of the lights in houses were off, and the only people who were still out were teenagers, the same age as them. Most of the little kids had probably gone to sleep at that point. \n\n\n“Alright,” Skeppy said, clapping his hands together as soon as they went inside. “Everyone better have brought pajamas, because we’re pulling an all-nighter here.” \n\n\nThe group slowly broke up into chunks— Skeppy and Bad immediately headed down the hall with pillowcases full of candy, Alyssa disappeared into a side bathroom, and Ponk headed to what George assumed was the kitchen. \n\n\nQuickly, George asked where a bathroom was for him to change. Ponk gestured down the hall and George closed one of the doors behind him. Hastily, he changed into a comfortable pair of sweatpants and a sleep shirt. He quite liked his NASA jumpsuit, but it wasn’t comfortable enough to sit and watch a movie in; so he folded it up and dropped it back in the front where his pajamas had been. When he emerged back to the living room, everyone else had changed into pajamas too. Skeppy and Bad were still in their duck onesies (presumably incredibly comfortable), and Alyssa had her own Cookie Monster onesie that was bright blue. \n\n\nGeorge took one of the free spots on the sofa, which was only occupied by Sapnap. Everyone had made a big pile of candy in the center of the floor, and Ponk tossed George a Reese’s peanut butter cup. \n\n\n“Bets on who’s going to fall asleep first?” \n\n\n“George,” Clay said immediately. Before George even had a chance to respond, the entire room laughed, full of agreement.\n\n\n“Hey,” George protested. He had pulled several all-nighters before— he was an expert at them. “I’m going to stay awake.”\n\n\n“No you’re not,” Clay said teasingly. “You’re going to make it through the first movie and then crash.”\n\n\nGeorge huffed. “No I won’t. I’ll make it through at least two.”\n\n\nSapnap snorted. “Sure you will.”\n\n\n“Shut up,” George said, flushing. “I’ll stay awake the whole night, just you watch.”\n\n\n“Alright,” Alyssa said loudly, breaking up their ribbing. “We’re going to start picking a movie. No bloodshed please.” \n\n\nThe conversation obediently quieted down, though George still felt the heat in his face. In front of Alyssa were about a dozen different DVDs, sprawled over the floor, and she held up different horror movies and made people vote on how much they wanted to see them. Stereotypical horror movies were shot down quickly— no one wants to watch Hereditary, Clay— but some of the best ones still rose to the top. \n\n\n“Final votes,” Alyssa said, and held up two different DVDs. “Scream or The Conjuring. Vote now or forever hold your peace.”\n\n\n“Anyone who doesn’t vote for Scream is dead to me,” Clay called out, and tore open another Hershey's bar. \n\n\n“Vote for The Conjuring and I’ll pay you five bucks,” Skeppy said quickly. \n\n\nClay tossed an Almond Joy at the back of Skeppy’s duck onesie. “That’s not fair!”\n\n\n“Is too!”\n\n\n“Alright,” Alyssa called, “Break it up. Who’s voting for Scream?”\n\n\nFour hands went up. Alyssa glared at Sapnap. “You can only use one hand.”\n\n\nSapnap shrugged and kept both hands up. Alyssa rolled her eyes but asked who was voting for The Conjuring— again, three votes. George didn’t know what to vote for— he hadn’t seen either of them, and was just judging based off of the movie covers.\n\n\n“George?” Alyssa prompted. “You haven’t voted yet.” \n\n\n“Scream,” Clay said. \n\n\n“Conjuring,” Skeppy said, and added, “Five dollars!”\n\n\n“I don’t know,” George said, pretending to consider it, “Five dollars is a pretty tempting offer…”\n\n\n“Come on,” Clay said, drawing out the vowels. “Georgie, please vote Scream. Please.”\n\n\nGeorgie. His heart skipped a beat. \n\n\n“Fine,” George sighed, and tried not to show how flustered that nickname had made him. “Scream.”\n\n\nAlyssa groaned good-naturedly, but put the DVD in regardless. As the title screen flashed across the television, Sapnap leaned over and whispered in George’s ear, “You’re so whipped.”\n\n\n“Shut up,” George muttered, and sank lower into the sofa. \n\n\nGeorge wasn’t one for horror movies, especially not genuinely scary movies, but he found more fun in making fun of the plot holes and character decisions than in watching the movie itself. Everyone readily agreed with his criticisms, and even Clay laughed at one of George’s muttered comments despite how much he had wanted to watch the movie. \n\n\nThe movie ended, and as the credits rolled across the screen, Ponk flicked the lights on. George blinked the spots out of his eyes, and sympathized with everyone else’s groans of displeasure. \n\n\n“I’m getting water,” Clay said, and hoisted himself up off the floor. “Anyone want anything?”\n\n\nGeorge shook his head, and Clay nodded and left the room. Slowly, everyone untangled themselves— Sapnap had practically sunk into the sofa, underneath a fluffy blanket, and Skeppy and Bad were sitting right next to each other on the floor. Alyssa yawned and pushed herself up from one of the beanbags. George stretched out, fingers and toes tingling from being in the same position for so long. \n\n\n“Next movie?” Alyssa said. “Anyone have any ideas?” \n\n\n“Let’s watch a kid movie,” Sapnap suggested. “I vote Hocus Pocus.”\n\n\n“Nightmare Before Christmas,” Ponk said. \n\n\n“Monster’s Inc.,” Bad said.\n\n\n“That’s not a Halloween movie.”\n\n\n“Neither was Scream!”\n\n\nGeorge sat back and enjoyed the bickering. He grabbed another piece of candy from their massive pile in the middle of the floor and relished the sweet taste of chocolate in his mouth. \n\n\nIn the middle of the argument, Clay came back. “George,” he said, and gestured, “Move over.”\n\n\nGeorge blinked, and then abruptly scooted over so there was room for Clay to sit on the sofa, right next to where George had been sitting. It put George in between Clay and Sapnap, and he uncomfortably realized that he was too close to Clay for comfort. Every molecule in his body was buzzing, all frantic wiring, and he didn’t know what to do. \n\n\n“Alright everyone,” Alyssa called again, and held up two DVDs. “We’re voting between Nightmare Before Christmas or Hocus Pocus.”\n\n\nPeople called out their votes, and George busied himself with breaking off another piece of chocolate. He was achingly aware of the inch of space between him and Clay— close enough that George could just reach out and touch. So close.\n\n\n“George, what are you voting for?”\n\n\n“Whatever Clay votes,” George said without thinking. \n\n\nSapnap snorted, and then unsuccessfully tried to pass it off as choking on what he was eating. \n\n\n“Simp,” Ponk called. George scowled at him and tossed a pillow in his direction. He couldn’t believe he had said that out loud. Ponk laughed and threw the pillow back. \n\n\n“Fine,” Clay said, sounding unbothered, “I vote Nightmare Before Christmas.” \n\n\n“That’s five votes for Nightmare Before Christmas,” Alyssa said, and looked to Sapnap diplomatically. “We’ll watch Hocus Pocus next, okay?” \n\n\n“You’re all missing out,” Sapnap insisted. “You’ll see.”\n\n\n“So are we ready to start?” Alyssa said, neatly cutting off Sapnap’s complaints. \n\n\nAs soon as everyone agreed, Skeppy pushed himself up and flicked the lights off, and Ponk pressed play. Slowly, everyone returned back to the positions they had been in before, curled up against each other, laughing and talking. The opening credits rolled out, and George found himself caught between Clay and Sapnap, wanting to relax but not quite sure how when he was so on edge. \n\n\nSlowly, George let himself rest against the sofa, and then all of a sudden, he and Clay had somehow ended up pressed against each other. He didn’t know how it happened. It started with his head resting on Clay’s shoulder as the movie progressed, and then George pulled his legs up to the sofa for comfort, and then he just leaned against Clay further. So Clay relaxed into the corner of the sofa, accidentally pulling George closer, and then that was how they stayed. \n\n\nThe movie went on— George had seen Nightmare Before Christmas when he was a kid, and he already knew the plot and the songs. The time was getting closer and closer to one AM, the night was drifting away, and George was comfortable and quiet and relaxed, and his eyelids felt so heavy.\n\n\nHe didn’t even realize he had dozed off until something shifted next to him, and he was jolted into half awareness- that stage perfectly in between being blessedly asleep and awake. He didn’t want to open his eyes, but he could tell from the hushed voices around him that it must be late into the night. \n\n\n“Aw,” Bad whispered. “That’s so cute.” \n\n\nSomeone shifted, and George realized that he had fallen asleep on someone; he could feel their chest rising and falling as they breathed. There was an arm rested around his shoulders, comforting and warm, and their other hand was threading through George’s hair, smoothing it down and playing with it.\n\n\n“When are you going to say something?” Sapnap whispered. \n\n\n“I’m not.”\n\n\n“You should.”\n\n\n“Shut up,” someone else muttered. Vaguely, George recognized Clay’s voice.\n\n\nGeorge heard everything through a watery filter, half asleep. He was warm and tired, and whoever he was sleeping on was calming, and before he knew it, George was about to drift off again. \n\n\nHe heard Sapnap’s voice say something, words that were shapeless and didn’t quite make sense, and then Clay’s voice again. George made a sleepy, small stretch, and curled up. \n\n\nThe combination of sweet candy and comfortable pajamas and body heat was soothing and wonderful, and George fell asleep again to the sound of Clay’s muffled voice. \n\n\nThe next school day, there was a surprise.\n\n\nGeorge opened his locker and confetti fluttered out, falling to the floor in multicolored pieces and covering everything in glitter. He stepped back in shock and blinked down at the mess at his feet.\n\n\n“Surprise!” multiple voices cheered at the same time, and George jolted like he was given an electric shock.\n\n\n“You really thought we were going to forget your birthday?” Alyssa said cheerfully. “Today is George Day!”\n\n\nGeorge took a birthday cone from Ponk and stared at it for a moment. “My birthday was yesterday.”\n\n\nPonk rolled his eyes. “Yeah, and we said happy birthday then.”\n\n\n“But we couldn’t do a full on birthday party because there wasn’t enough time,” Bad said, “So we’re celebrating today!”\n\n\n“You have to put on a birthday cone,” Clay interjected. “Come on, we’re all wearing one.”\n\n\nGeorge rolled his eyes and did his best not to grin as he put the stupid little birthday cone on his head. He looked at everyone else and laughed; they all had equally dumb birthday cones on, in shades of glittery blue. George felt so happy that he thought he was going to burst. \n\n\n“And we have birthday cake for you at lunch,” Sapnap added. \n\n\n“You guys are ridiculous,” George said, laughing, and let himself get pulled along for the ride. \n\n\nGeorge assumed it would be awkward for him to have a birthday cone on, in the classes that none of his friends were in. To his surprise, however, half the school seemed to have been roped into wearing one. George knew that Skeppy had brought a ton of extra cones, but surely not this many. George wasn’t sure whether it was because they actually cared and wanted to celebrate his birthday, or because they had just seen everyone else do it and went along with it, but either way, it made him stand out less.\n\n\nThen right before precalculus, a girl cornered him outside the doorway. \n\n\n“Happy birthday, George!” she said brightly. \n\n\n“Thanks,” George said. He felt slightly uncomfortable. Clearly she knew who he was, but George didn’t evne know her name.\n\n\n“Are you doing anything for it?”\n\n\nWhy was she talking to him? “Maybe, with my friends.”\n\n\n“That’s cool,” she said. She was very peppy. “Would you want to get lunch sometime this week?”\n\n\n“Lunch?”\n\n\n“Mhm,” she said, still brightly, almost uncomfortably so, “It would be nice to get to know you.”\n\n\nGeorge felt rather strained; he wished that class would start so he could escape the conversation. It was clear that she was flirting with him, but George didn’t care, as rude as that sounded. He liked to be with his friends, with Clay, and with Dream, and he didn’t understand why he would be interested in someone he didn’t even know. \n\n\n“I don’t think so,” he started awkwardly, “Sorry, but I don’t even know you—” \n\n\nHe was abruptly cut off as Clay arrived, thankfully right on time. “Hey, George.” \n\n\n“Hey,” George said, almost sighing in relief. “How are you?”\n\n\n“Fine,” Clay said nonchalantly. “Should we go inside?”\n\n\nGeorge turned to go and abruptly realized that the girl he had been talking to had vanished somewhere. He felt uneasy about it, but he had wanted to escape from the conversation badly. \n\n\n“Wow,” Clay commented, almost as an afterthought. “That was a little harsh.”\n\n\n“Harsh?”\n\n\n“You just turned her down like that,” Clay said, and gestured to the outdoor hallway. \n\n\n“Oh,” George said, flushing. “I didn’t mean to be harsh.”\n\n\nClay shrugged. “I get it. It’s hard to let people down easy.”\n\n\n“Yeah,” George said sarcastically. “I bet you do it all the time.”\n\n\n“Jeez,” Clay raised an eyebrow. “No need to be rude.”\n\n\nAgain, George felt like he was missing part of the conversation there, and he suddenly felt uncomfortable for turning the tables on Clay. “Sorry,” he tried. “I don’t…”\n\n\nClay let his chair tilt back and waited for George to finish his sentence.\n\n\nFinally, George said, “I’ve just never had someone be interested in me like that before. At least not as bold.” \n\n\nClay hummed. “That’s surprising.”\n\n\n“Really?”\n\n\n“Yeah,” Clay continued. “You’ve never had a girlfriend before? Or boyfriend?”\n\n\nGeorge shook his head. He wasn’t sure why Clay was asking about that. \n\n\n“No one’s ever asked,” he responded.\n\n\nClay raised an eyebrow. “I don’t believe that. You’re the whole package, aren’t you?”\n\n\n“The whole package?” George repeated, confused.\n\n\n“Mhm,” Clay nodded. “The personality, the looks, the accent, the sense of humor… all of that.”\n\n\n“All of that?” George repeated. \n\n\nFor once, Clay looked slightly flustered, the same way George always felt on the inside. He opened his mouth to respond, and the bell rang in the same breath. Quickly, Clay turned and pulled out his notebook. George looked at him for a moment. For some reason, he felt like he had won some sort of contest— though what contest, George wasn’t sure.\n\n\nThe rest of his birthday was fairly unremarkable, except for the fact that almost the entire school body swarmed their lunch table hoping for a slice of the sheet cake Bad had ordered. It was chocolate with vanilla frosting and those delicious, fake piped flowers on top, and George was given the first celebratory slice for his birthday. The remainder of it was doled out among their friends. Everyone who sat at their table got an entire slice, and then Bad generously donated the rest of the cake to everyone around them who wanted a slice. George took a bite and tried to stop himself from smiling; it was such a great day. \n\n\n“What’s your birthday wish?” Alyssa prompted. “You get seventeen wishes, for being seventeen.”\n\n\n“I don’t think that’s how it works,” Ponk said, but Alyssa swatted his arm.\n\n\nGeorge raised his hands in a placating gesture. “I’m not supposed to say. They don’t come true if I say them out loud.” He also certainly didn’t want to tell his birthday wishes in front of everyone, knowing what he was wishing for. \n\n\nThere was a chorus of well-natured groans, and Skeppy said indignantly, “That’s cheating!”\n\n\n“It’s not cheating,” Clay said, “He’s right, it won’t come true if he says it out loud. You have to do it over birthday candles.” \n\n\n“I would have made you blow out candles,” Bad said despondently, “But we’re not allowed to light things on fire while on school campus.” He shot an accusatory glance at Sapnap. “I wonder why that rule was put in place.”\n\n\nSapnap had the grace to look guilty. “To be fair, I didn’t mean to get it outlawed for the entire student body.”\n\n\n“You set off fireworks on campus,” Clay said amusedly. “What did you expect?”\n\n\n“In my defense,” Sapnap said, holding up his hands, “It was hilarious.” \n\n\nThe entire table laughed. George took another bite of birthday cake as the conversation kept moving. \n\n\nSuddenly, Clay shifted so he was sitting next to George. “You have frosting here,” Clay said, and didn’t wait for George to get it himself. Instead, he swiped his finger across George’s cheek, and then stuck that finger in his mouth, sucking off the frosting. George watched the way his throat clicked as he swallowed and was fairly certain that he had just gone bright red. \n\n\n“Oh,” George said. Stammered, slightly. “Thanks.”\n\n\nClay hummed. “No problem.” \n\n\nGeorge ate another bite of cake and tried to swallow past the sudden dry feeling in his throat. He tried to remind himself how to breathe and sucked in a slow, steady breath. Now was not the time to fall head over heels in love, George. \n\n\nUnfortunately, as casual as George tried to be, Sapnap caught onto him fairly quickly. After school had ended, he cornered George by the Green as George was about to walk home.\n\n\n“What are you waiting for?” Sapnap urged. “Why haven’t you asked him out yet?” \n\n\n“I don’t know,” George said, glancing around quickly to make sure no one was going to overhear them. “I’m just waiting for the right moment.”\n\n\n“There’s never going to be a right moment if you keep waiting,” Sapnap said crossly.\n\n\nGeorge rolled his eyes. That much was true, but he still naively hoped there would be a moment where it was going to be obvious. Where the stars would align, and both he and Clay would know that it was a perfect moment for things to happen. Unfortunately, George highly doubted there was going to be a moment like that. \n\n\n“I know,” George sighed, “You’re right.”\n\n\nSapnap shrugged as if to say I always am. George rolled his eyes. Sapnap was such an idiot sometimes. \n\n\nWhen he got home that afternoon, his mother had his own birthday celebration all laid out for him, complete with two fancy cupcakes in the fridge and a tiny pile of presents on the kitchen table. She had taken the night off of work to celebrate his birthday with him, and she made George blow out one candle (seventeen candles on one cupcake were too much to hope for). \n\n\nHe went to sleep that night, with a brand new computer monitor and a new designer hoodie hung in the closet, and stared at the ceiling. It was such a difference to his last birthday, where his friends knew that he had just turned a year older, but didn’t put in the same amount of effort. Where the entire school didn’t come and say happy birthday, where the weather was dim and rainy instead of light and sunny. \n\n\nIt was such a good day that George didn’t even want to fall asleep, because then it would be over. He wanted to cling to this feeling forever.\n\n\nThe next day, their precalculus teacher passed back their unit tests from the week before Halloween. She placed them face-down on everyone’s desk, which was always a bad sign, and George turned his over hesitantly. He was sure that there were going to be countless red marks over his, signalling all he had done wrong. But to his extreme surprise, he had nearly gotten a ninety-five— his highest grade in the entire year so far.\n\n\n“Nice,” Clay said, looking over. “That’s really good.” \n\n\n“Thanks,” George said. “What did you get?”\n\n\nClay laughed. “Not my best, but it’s okay.” \n\n\n“You’ve spent so much time tutoring me in class that you’re not even focusing on the lectures anymore,” George laughed. \n\n\n“Maybe,” Clay said, half-seriously. “I guess I’ll just need to study more.”\n\n\n“We could study together,” George blurted suddenly.\n\n\n“Hm?”\n\n\n“We could work together on things,” George said. “Our own small study group.”\n\n\n“That’s not a bad idea,” Clay admitted. “Tonight?”\n\n\nWow, George thought. That had gone much better than expected.\n\n\n“Sure,” he said. “Where?”\n\n\n“My house,” Clay said, “You’ve been there before, right?”\n\n\n“I haven’t,” George admitted. \n\n\n“Oh.” Clay blinked. “I’ll send you my address. You can meet my cat, too, remember?”\n\n\nGeorge remembered that faint comment from the last time they had talked, perched on top of a kid’s playground. “That’d be nice.” \n\n\n“Alright,” Clay said, and smiled. “Tonight at seven.” \n\n\nThat night at six fifty five (George had been careful to time it, so he wasn’t absurdly late or awkwardly early) George knocked cautiously at Clay’s door. It was a wide, light blue building down one of the quiet strees in their neighborhood. With two stories and white balconies, it was nearly straight out of a movie set. \n\n\nThere was no answer, and George shuffled uncomfortably. He was certainly at the right house, unless Clay had given him the wrong address, and he tried to listen for faint sounds coming through the door. He was debating whether to text Clay or not when the door swung open.\n\n\n“Hey,” Clay said, and George echoed it back. “Come in?” \n\n\nHe closed the door behind George and immediately headed over to a staircase in the corner; slowly, George followed him upstairs. He could hear muted conversation coming from another room and the clink of silverware. \n\n\nOn the second floor, various family photos lined the hallway; pictures of school portraits, someone’s graduation, a piano recital. George pointed to a blond kid’s kindergarten portrait and asked amusedly, “Is that baby you?”\n\n\nClay turned around to see and then flushed. “Yes,” he said. “I was an ugly child.” \n\n\n“I think you were pretty cute,” George said. \n\n\n“Shut up,” Clay said, embarrassed. “At least I look better now.”\n\n\nYeah, George wanted to agree, with wavy blond hair, those bright eyes, a jawline sharp enough to cut glass, that easygoing smile— \n\n\nGeorge forcibly directed his thoughts away. He was here to study, not do much else. He wasn’t here to wax poetry about Clay’s looks. \n\n\nThere was a small seating area, right next to the stairs, with a circular table and two armchairs. George dropped his backpack to one of them; as soon as he did, he heard a faint meow coming from a different room. Paws pattered on the floor, and eventually a tiny, tawny head poked out from around a door. \n\n\n“That’s Patches,” Clay said, noticing George’s curious glance. Upon hearing her name, Patches approached and began twisting through Clay’s legs, winding around and around. “She’s a menace.”\n\n\nGeorge bent down and offered his hand to Patches, who eagerly rubbed against it and meowed sharply when George didn’t immediately pet her. George smiled and carefully scratched under her chin and behind her ears, and soon Patches was purring louder than a tractor.\n\n\n“She likes you,” Clay noted. “She’s usually not this friendly to new people.”\n\n\n“Well,” George said, straightening up, “You two must have a lot in common.”\n\n\nClay huffed a short breath and picked up Patches, who meowed in indignation. “What’s that supposed to mean?”\n\n\nGeorge felt somewhat uneasy. “Just that it takes you a while to open up.”\n\n\nClay raised an eyebrow. “Not that we both like you?”\n\n\nGeorge’s heart skipped a beat and he tried to act nonchalant. He could feel his face burning. “No?”\n\n\nHe wasn’t sure whether it was a question or a statement. Either way, there was silence between them for a moment. George shuffled awkwardly and achingly wished that he had just said nothing.\n\n\nFinally, Clay shrugged. Patches wriggled in his arms and meowed again, and Clay obediently turned and put her down. She immediately turned to George, twining around his feet, demanding to be pet.\n\n\n“Should we go study?” Clay offered. George nodded. The moment between them dissipated. George was absurdly thankful for that. \n\n\nClay disappeared into another room and came back with his precalculus textbook; George had made the right decision to not bring his own. “Where should we start?”\n\n\n“The homework for tomorrow,” George decided. “I still haven’t done mine.” \n\n\n“Alright,” Clay said, with obvious trepidation, “I hate derivatives. Should we start working on it?”\n\n\nGeorge grimaced. “No better time than now.” \n\n\nFor the first time, George saw Clay get frustrated over not understanding something. He had always been so competent and intelligent that George somehow assumed that he understood everything without trying. Now, studying with him, George saw a different side of him: someone who ruthlessly attempted, through trial and error, to perfect something, and wouldn’t quit until it was perfected. For some reason, it only made Clay more likable. Far more than George admired competence, he liked dedication. \n\n\nGeorge found himself staring at Clay as he scrawled down different answers and graphs, at the way he leaned back in his chair in satisfaction when he got a question right, at the way he bit his lip when he was in intense thought.\n\n\n“You know it’s okay to get a problem wrong, right?” George said, almost laughing. \n\n\n“Not according to my parents,” Clay muttered, and then stopped short, as if just realizing what he had said. He looked as if he wanted to take the words back, but they had already been spoken.\n\n\nUncomfortably, George asked, “Are they really strict about grades?”\n\n\n“You could say that.” \n\n\nHe looked down at his problem and then abruptly pushed it back over to George. “Check my work for me.”\n\n\nHe was back to being the distant, closed off version of Clay that George had gotten to know very well. Obediently, George glanced through it and checked Clay’s calculations against his own. \n\n\n“You know,” George said hesitantly, not looking up from Clay’s homework, “It’s not the end of the world to get bad grades. It’s all a learning experience.” \n\n\nClay didn’t look convinced, so George continued. “Especially back in the UK, my grades were absolute shit, and it never mattered much.” \n\n\n“That’s nice and all for you, but your parents probably didn’t ground you for a month for not getting perfect grades.”\n\n\nClay’s tone was matter of fact. George hesitated, awkwardly stuck between wanting to convince him otherwise or just let him speak. He felt like it would be worse to mention that he only lived with his mother, that his father had been out of the picture for a while, especially when Clay seemed to simmer with frustration.\n\n\nSlowly, he said, “Is it hard having those expectations?”\n\n\n“Sometimes,” Clay said. He laughed dryly. “We got into a huge argument last year, about my future, how I wasn’t living up to potential, all that. It got really bad one night and I ended up crashing on Sapnap’s couch for two weeks.”\n\n\n“Oh,” George said. He didn’t know what else to say. “That sucks.”\n\n\nClay shrugged. “It’s whatever.”\n\n\n“It still sucks though,” George said. Quietly: “Are things… better now?”\n\n\nClay looked down at their math homework, and his fingers tapped an unsteady beat on the table. “Kind of.”\n\n\nGeorge felt a little lost. He opened his mouth to say something— he wasn’t sure what— but Clay cut him off.\n\n\n“Sorry,” he said abruptly. “I don’t know why I’m even telling you this.”\n\n\n“It’s fine,” George said hastily. He knew what the need to vent felt like, and he knew that it was better to talk about things than to hold them in. “I don’t mind.” \n\n\n“I can’t keep my mouth shut around you,” Clay muttered, but it was lighthearted. \n\n\n“I guess I bring out the best in you,” George said lightly.\n\n\nClay huffed. “That, you do.” \n\n\n“I know we’re not… the closest,” George said, not sure where he was going with this, “But in all seriousness, I’ll listen to you whenever.” \n\n\nClay smiled wryly. “Thanks. I might take you up on that offer sometime.” \n\n\nSilence fell between them, broken only by the sound of Patches’ purring; she had taken occupancy on George’s lap and refused to move.\n\n\n“Let’s just get back to studying,” Clay offered. “Is my answer right?”\n\n\nGeorge glanced down at the papers; he had completely forgot about them. \n\n\n“One moment,” he said, slightly embarrassed, and checked the work again quickly. “Yeah, you’re good.”\n\n\n“Good.” \n\n\nClay smiled again, a mix of his arrogant, talented one and his softer, quieter one, and George felt his heart skip a beat.\n\n\n“Next question,” he said hurriedly, and flicked through the textbook. “Graph the tangent line of this equation…” \n\n\nThey completed one question, then the next, and before he knew it, they had both completed their homework and were a hundred percent sure every question was correct. The hours passed away, trickling down like sand in an hourglass, and the sun dipped below the horizon in shades of blue. \n\n\nAt some point, George yawned widely, mind fuzzy with variables and graphs and derivatives. Clay glanced over at him. \n\n\n“Are you tired?”\n\n\n“Not really,” George lied, and then yawned again. \n\n\n“It’s almost ten thirty,” Clay realized, looking at the time. “We have school tomorrow, we should probably pack up for tonight.”\n\n\nWith a start, George looked at the time; he hadn’t realized how late it had gotten. That tended to happen when he was with Clay. \n\n\nWith a regretful sigh, he began to pack his things up, and was forced to dislodge Patches, who had been sleeping on his lap in blessed peace. Clay glanced down at her and laughed; she was looking at George with hurt in her eyes, as expressive as cats could get. \n\n\n“We should do this again,” George said hopefully. “This was really helpful.”\n\n\nTo his surprise, Clay actually seemed open to it, and his eyes were light. “I’d like that.” \n\n\n“Me too,” George said stupidly, and then realized he was just repeating himself. \n\n\n“Next week?” Clay offered. “Same time?”\n\n\n“Sure,” George said. “I’ll come over then.” \n\n\nHe zipped his backpack shut and slung it onto his back, wincing at the weight. Clay opened the door for him, and the muggy, humid Floridian air drifted inside. He could hear crickets chirping in the dark, could see the way the yellow street lights illuminated the road. \n\n\n“Bye,” George said. He didn’t really want to leave.\n\n\nClay paused too. \n\n\nThen his eyes flickered down to George’s lips. \n\n\nGeorge paused.\n\n\nIt was so quiet.\n\n\nClay was so close.\n\n\nThen Patches, twining between both of their legs, meowed loudly. The moment shattered. Clay looked down at her and huffed. She meowed again, demanding and needy, and Clay let her jump into his arms, taking a practiced step backward.\n\n\n“See you tomorrow,” Clay said. \n\n\n“Okay,” George said, heart racing.\n\n\nTime felt syrupy, like it was made of molasses. The door closed behind him. George swatted away a buzzing mosquito from his ear and couldn’t stop the triumphant smile from spreading across his face. \n\n\nDream hadn’t been online in a few hours, but George texted him anyway. He felt so nervous that his hands were trembling— less nervousness, and more a rush of adrenaline. George was fairly positive that Clay liked him back. \n\n\ngeorgenotfound: i really think my crush likes me back \n\n\nWithin a few minutes, his phone buzzed.\n\n\ndreamwastaken: yay \n\n\ngeorgenotfound: he’s talking to me so much more its really nice!!\n\n\ndreamwastaken: good for you!\n\n\ngeorgenotfound: i could also be overestimating it but i really think its looking up for me\n\n\ndreamwastaken: thats great\n\n\ngeorgenotfound: i know :))\n\n\nDream didn’t respond for another few minutes, and George checked his phone; three dots rose and fell, rose and fell again, before Dream’s message came through.\n\n\ndreamwastaken: i really hope everything goes well for you\n\n\ndreamwastaken: i hope you’re happy \n\n\ngeorgenotfound: awww thats so sweet &lt;3\n\n\ndreamwastaken: seriously though. you’re my best friend and if you’re happy, im happy\n\n\nAn odd sort of fondness rose in his chest, light and flowing. George couldn’t place a name to it, but for half a second, it reminded him of how he felt around Clay. \n\n\ngeorgenotfound: i love u!!\n\n\ndreamwastaken: i love you :(\n\n\nGeorge stared at the little emoticon Dream had sent. It dimmed his excitement somewhat. It seemed almost… resigned.\n\n\nHe didn’t quite know what to make of it.\n\n\ndreamwastaken: ugh i feel so sick \n\n\nGeorge yawned, eyes bleary from sleep, and read Dream’s message again. \n\n\ngeorgenotfound: :(\n\n\ndreamwastaken: is it worth it going to school honestly\n\n\ngeorgenotfound: probably not, if you’re feeling really bad\n\n\ndreamwastaken: i think i might go honestly \n\n\ndreamwastaken: it can’t be that bad \n\n\ndreamwastaken: ok i’ll go \n\n\ngeorgenotfound: you sure??\n\n\ndreamwastaken: yeah its just like. seven hours or whatever right?\n\n\ndreamwastaken: ill just chug a bottle of dayquil and suffer through it\n\n\nGeorge raised an eyebrow cynically and turned his phone off; Dream was free to make all the worst life decisions he could, and George was rarely able to convince him out of things. \n\n\nGeorge himself wished that he didn’t have to go to school that morning; he had gone to sleep an hour too late, trying desperately to finish his physics homework before Friday morning arrived, and now was exhausted. His physics homework still wasn’t done— George would have to steal Skeppy’s answers before class started. \n\n\nHe yawned again, long and wide like a cat, and scrubbed the sleep from his eyes. He was going to chug two cups of coffee and then seize the day. He could do this. \n\n\n“You look exhausted,” Sapnap said, the second George stepped foot on campus. George yawned again and raised a middle finger. \n\n\n“I don’t suppose you have the physics homework done, do you?”\n\n\n“Nope,” Sapnap proclaimed. “Skeppy does, though.”\n\n\n“Perfect,” George sighed. “I’ll copy it all down in first period.”\n\n\n“If you can stay awake that long.”\n\n\n“I’m running on caffeine and sheer willpower at this point,” George said. “I can do anything.” \n\n\n“Good luck,” Sapnap said dryly, and they headed on their way to class\n\n\nThankfully, Skeppy glady donated his homework for George to frantically copy during their shared history class. He tried not to be too conspicious about it, changing word choices and changing the answers to certain problems so his cheating wasn’t obvious. He was sure that half of it was wrong, but it was better to get completion points than no points at all. \n\n\n“Thanks,” George said, flashing Skeppy a quick smile. “You’re the best.”\n\n\n“George,” Mrs. Carter called, “Quiet in the back row.”\n\n\nGeorge ducked his head and focused back on his notes. He could feel his eyelids drooping, but every time he was close to falling asleep, Sapnap kicked his chair and jolted him awake. Fortunately he hit his second wave around two hours later, and the faint fuzziness behind his temples faded. George was looking forward to an hour of talking to Clay in precalculus, but when he walked in, he saw that Clay’s seat was noticably empty. \n\n\nGeorge stared at it a second in confusion, before pushing it from his mind. He was able to focus on the lecture much more, now that he wasn’t constantly distracted with Clay’s presence. The class wasn’t nearly as enjoyable without Clay’s muttered comments and quick laughs, though. \n\n\n“Where’s Clay?” he asked at lunch, as everyone loaded into Bad’s minivan. “He wasn’t in math with me.”\n\n\n“He’s sick,” Sapnap said. “He texted me this morning.”\n\n\n“Aw,” Bad said, “That sucks. Is he okay?”\n\n\nSapnap waved a hand dismissively. “Yeah, he’s fine. I’ll go over after school and check in, just in case.” \n\n\nWith that, the conversation moved on. George joined in, interjecting comments every so often when he had something funny to say, but his mind was somewhere else. He had half a mind to text Clay and ask if he was okay. \n\n\nIt was a strange coincidence, he thought with a frown. Both Dream and Clay were sick on the same day. What were the odds of that?\n\n\nBefore he could change his mind, he sent a quick text to Clay.\n\n\ngeorge: hey, i heard you’re sick, hope you feel better soon\n\n\ngeorge: btw i took precalc notes for you if you want them\n\n\nClay didn’t respond immediately, but by the end of lunch, his phone buzzed in his back pocket.\n\n\nclay: thanks :) can you text them to me after school?\n\n\nGeorge sent back a quick yes. It was a dry conversation, but George was still glad he had checked in. He hoped that Clay’s parents weren’t too hard on him for missing school, but there wasn’t much you could do when you were sick. \n\n\nAfter suffering through an entire hour of Spanish, the final bell rang. It was a blessing; he had two days to catch up on sleep, and would probably take a six hour nap after going bowling with everyone.\n\n\nGeorge checked his phone. Dream had sent him a few messages about two hours ago, right after the bell had rang for fifth period:\n\n\ndreamwastaken: i had the craziest fucking day\n\n\ndreamwastaken: i got all ready to go to school and everything and then just crashed \n\n\ndreamwastaken: like legitimately i passed out in the bathroom\n\n\ngeorgenotfound: are you okay??? holy shit\n\n\ndreamwastaken: yes im fine\n\n\ndreamwastaken: parents are a bit upset though but what can you do \n\n\ngeorgenotfound: oh my god im so glad you’re okay thats scary\n\n\ngeorgenotfound: please dont chug any more dayquil\n\n\ndreamwastaken: i wont, i promise\n\n\ndreamwastaken: its so cute that you care abt me so much\n\n\ngeorgenotfound: oh shut up \n\n\ngeorgenotfound: i hate u\n\n\ndreamwastaken: aww i love you too\n\n\nGeorge rolled his eyes. Dream was so lovably dumb. Of course he would be the type to push himself to try and keep acting normal and then eventually collapse because of it. \n\n\ngeorgenotfound: take care of urself okay\n\n\ndreamwastaken: i will. \n\n\ngeorgenotfound: &lt;3\n\n\nAfter seeing Dream go offline again, George headed straight to the bowling alley. Ponk had texted the group chat, seeing as they hadn’t gone in a few weeks due to Skeppy’s work schedule, and everyone readily agreed that it was time to go again. \n\n\nThis was the sixth time George had gone bowling with everyone, and he was steadily getting better and better as time passed. He had learned to deeply appreciate the nachos there (Sapnap was absolutely right about how good they were). At this point, the bowling alley employees recognized him as part of the group, and didn’t even hesitate before giving him the correct pair of bowling shoes.\n\n\n“When are we starting?” George said when he arrived. His backpack went forgotten in the corner, piled among the other ones. He entered his name into the bowling system and then took a seat next to Bad, who affectionately ruffled his hair. \n\n\n“Whenever you’re all ready,” Alyssa said cheerfully. Without another minute of waiting, Sapnap stepped up to the alley and took his first swing.\n\n\nOver six weeks of bowling, George had actually gotten quite good at it. He wasn’t the most competitive person per se, but he did enjoy being talented at something. Thus, three rounds later, when George had knocked over his third spare in a row, an invigorated sense of pride swelled in his chest.\n\n\n“Nice!” Skeppy said appreciatively. “That was great, George.”\n\n\nGeorge went back to his seat and pulled the plate of nachos towards himself to an affronted gasp from Sapnap. Without Clay there, George was in the lead with points, racking them up turn after turn.\n\n\n“Damn,” Sapnap said, “You’re taking over Clay’s reign.”\n\n\n“Language!”\n\n\n“Don’t tell Clay that,” George said, “I want to revel in this as long as I can.”\n\n\nSapnap gave George a mocking bow. “Of course, your highness.” \n\n\nGeorge laughed. “Oh, shut up.” \n\n\nIt made him feel vaguely proud of himself. He wished that Clay were there to see it.\n\n \n \n\nBy the time Thanksgiving rolled around, George was truly and deeply tired of school.\n\n\nThere were no decorations in the hallway like there were for Halloween, no elaborate candy grams to pass out, but the entire school was excited. As soon as Friday hit, there would be an entire week-long break where they could just do nothing. \n\n\nGeorge personally didn’t have much to look forward to; Thanksgiving was an American holiday, and he had never celebrated. \n\n\n“They don’t have Thanksgiving in the UK?” Skeppy asked curiously, right after George said that. Ponk swatted his arm. \n\n\n“Of course they don’t,” he said, “It’s just for America.”\n\n\n“So you’re not doing anything for it?”\n\n\nGeorge shook his head. “Just relaxing.”\n\n\n“Damn,” Sapnap sighed, “That must be so nice. My parents always drag me to be with my grandparents and I have to dress up for it.”\n\n\n“That must be nice,” George said. “Don’t you have big dinners and such?”\n\n\n“Yeah,” Bad said dreamily. “Pumpkin pie.”\n\n\n“My aunt’s stuffing,” Sapnap fantasized.\n\n\n“Apple pie,” Alyssa chimed in. \n\n\nGeorge found himself nodding along; he had seen enough television to know about Thanksgiving and all of the classic American foods associated with it. He had just never experienced it himself.\n\n\n“We should do a Friendsgiving thing,” Ponk suggested. \n\n\n“Friendsgiving?”\n\n\n“Yeah, where all your friends get together and have dinner together,” Alyssa said. “We can get pie, and have fun— it’ll be George’s first Thanksgiving, after all!”\n\n\n“You’d come to Friendsgiving with us, right?” Clay asked, and nudged George’s side. \n\n\n“I mean,” George said uncertainly, but not able to say no to him, “If it’s not any trouble for you guys…” \n\n\n“Then it’s settled,” Clay said, without sparing another thought. “Who’s house are we going to? What day?”\n\n\nBefore he even knew it, they had made plans for “Friendsgiving.” George didn’t even know that was a thing ten minutes ago, but now he was accepted into their plans without hesitation. Everyone equally wanted to give George the classic “Thanksgiving” experience— and George didn’t know what that entailed— but that excitement dimmed slightly when Bad reminded them that no one knew how to cook. \n\n\n“It’s okay,” Sapnap assured them. “We can just order pie or something from a bakery. You’ll still get to eat pumpkin pie.”\n\n\n“It doesn’t matter that much,” George said, but his comments were swept away and ignored. \n\n\n“The Sunday after Thanksgiving,” Alyssa said. “That works for everyone?” \n\n\nThere was enthusiastic support for that, and then the conversation shifted. A quick breeze blew through the courtyard, and George reveled in the fresh breath of air. \n\n\nThe weather had changed over the last few weeks, although there wasn’t an obvious division between seasons like there was in Brighton. The rain had started picking up as winter approached, this time slightly cooler than the warm, summery rain. The temperature had dipped from the nineties to averaging around the mid seventies. It wasn’t nearly cold enough to wear a coat, but George brought a hoodie to school most days with the sleeves rolled up due to the air conditioning inside. \n\n\nThe first time he wore a Supreme hoodie, he got so much shit for it from Sapnap— apparently, George hadn’t been pegged as a “hypebeast.” Honestly, George didn’t care much about the designer brand or the label, he just thought it was an interesting design. For the next few days though, people complimented him on his apparent “incredible taste.” George rather thought he liked it. \n\n\nBefore he knew it, teachers were beginning to discuss finals, and what they had to study to pass them. In the beginning of American History, his teacher said that they were starting their final unit, and that if they wanted to get good grades, they should begin studying now. Sapnap rolled his eyes, but for the first time in the semester, began taking actual notes rather than doodling all day. \n\n\n“I hate finals,” George said despondently at lunch one day, the Friday before the start of their Thanksgiving break. “I wish teachers would stop talking about them.”\n\n\n“They’re in a few weeks,” Alyssa said, “There’s no need to worry about it.”\n\n\n“I know,” Ponk sighed. “They’re assigning us so much homework now, I barely have any free time.” \n\n\n“It’s ridiculous,” Sapnap said, “How are we supposed to get anything done if there’s homework every night?” \n\n\n“You never do your homework anyway,” George pointed out. “You always copy mine.”\n\n\nSapnap shushed him as a teacher walked by; again, Sapnap pulled off his white headband quickly they walked by, and stuffed it back on the second the teacher was out of eyesight. George laughed. It was such a familiar sight at this point that he barely blinked.\n\n\n“Anyway,” Sapnap said falsely, “What were you saying about me being a model student again?”\n\n\n“Oh, shut up,” Skeppy said, and flicked a balled-up straw wrapper at Sapnap’s forehead. The entire table dissolved into laughter, and George glanced around, feeling oddly and happily at home. \n\n\n“And we have a week long vacation after this!” Bad said cheerfully. “Chin up, George.”\n\n\n“Yeah,” George said faintly— he was looking forward to a break from school. Still, the biggest stress on his mind wasn’t finals. \n\n\nHe was planning to ask out Clay today. \n\n\nIt was shaping up to be a good day, with startlingly good weather, with no rain on the horizon for miles. He and Clay had been getting along well, recently, enough that George was fairly confident that Clay was interested in him back. Sapnap had been eagerly encouraging him recently, feeding George different words of confidence. At this point, George almost wanted to get it over with if only so Sapnap would stop bothering him. \n\n\nThe idea stayed in his mind throughout the entire day, slowly getting louder and louder, until George felt anxious just from thinking about the end of the school day. The minutes flew by faster than light, ticking one after the other, and before he knew it, the final bell had rung. George quickly deposited the contents of his locker into his backpack, ready to not look at them for the next week, and headed to their usual lunch table. \n\n\nOnly Sapnap was there so far, and George and him chatted easily for a few moments. Sapnap complained loudly and at length about their history teacher (apparently his latest report card had been not-so-pleasing). Clay joined them a few minutes after school had ended, an easy smile on his face and the sleeves of his hoodie rolled up. \n\n\nSapnap shot George a significant look, and George kicked him under the table. Sapnap winced, but then played it off easily. \n\n\nFinally, there was a lull in the conversation, and George seized the chance. “Clay,” he said quickly, and tugged on the arm of his hoodie, “Could I talk to you for a second?” \n\n\nClay glanced at Sapnap, and then appraised George for a moment. “Sure.” \n\n\nHe followed George as he led him behind one of the school buildings. Most everyone was gone, deserting school the second the break had begun; it was only them. George’s heart fluttered in a panicky, anxious pace, and he tried forcefully to calm it down. \n\n\n“So,” Clay said, and leaned against the wall. “What did you want to talk to me about?”\n\n\nCome on, George. Come on. His heart was pounding through his ears, making it the only sound he could hear. \n\n\n Finally, he said, “I really like you.” He rushed the words out like they burned him. “Like like you.”\n\n\nHe didn’t look at Clay’s reaction and continued, “So I was wondering, if you wanted, we could go out sometime? If you’re okay with that?”\n\n\nGeorge’s stomach felt like jelly, and he was ready to bet that his cheeks were hot enough to fry eggs on. He risked a glance up at Clay, who was staring at him, lips slightly parted. He didn’t say anything for a long moment. \n\n\nThen, awfully, Clay took a step back.\n\n\n“Thanks,” he said politely, tactfully, “But I can’t.”\n\n\nGeorge’s heart skipped twenty beats at once. \n\n\n“Oh,” he said. He took a step back. “Okay.”\n\n\nClay’s glance flickered down to the ground, and he didn’t say anything. George felt like everything had just spiraled out of control. \n\n\n“We can just ignore this,” George tried, “Pretend it never happened.”\n\n\n“You’re fine, it’s just,” Clay fumbled for the right words, and said, “I’m interested in someone else.”\n\n\nOh. \n\n\n\nOh. \n\n\n\n“Okay,” George said, impressed with the evenness of his voice. “Okay, cool.”\n\n\n“Sorry,” Clay said. \n\n\n“No, it’s cool,” George said, grasping for something to say, anything. “It’s good. Great. Good luck. With them. Great. Cool.”\n\n\n“I’m sorry,” Clay said again, and he truly did look sorry. George stared at the ground and furiously blinked the tears in his eyes away. He wouldn’t cry in front of him. He wouldn’t cry at all. Shit, shit, fuck, fuck, fuck.\n\n\n“Wait—” Clay said, and reached out. “Wait, George, please—”\n\n\nGeorge left. \n\n\nHe turned on his heel and left. The very act felt cowardly. He was just running away from everything again, wasn’t he? George ignored that feeling, and all the other feelings, and balled them up deep down where he couldn’t reach them. His face was hot and wet and he knew that he was crying, which made it all the more pitiful and embarrassing. \n\n\nHow could things have gone so badly? So awfully wrong? Had George just misinterpreted everything that had happened between them, everything that was said? \n\n\nHe made it back home in a daze, and ignored his mother’s worried question about what had happened. George went to the bathroom and splashed cold water on his face until the puffiness faded from his eyes, and until the redness in his skin vanished. He looked at himself in the mirror briefly and then turned away. He didn’t want to see himself right then. He didn’t want to do anything. \n\n\nHe just wanted to redo the day, hit rewind, and change it. He could have avoided all of the humiliation and embarrassment if he just hadn’t said anything. If he had just stayed silent. Why couldn’t he stay silent? Why had he bothered to test his luck? \n\n\nHe returned to his bedroom and closed the door behind him. For a moment he stared at his computer across the room and considered booting up Minecraft, but he didn’t have the energy to do that.\n\n\nWhat he really wanted was—\n\n\nHe wanted to talk to Dream. \n\n\nHe really, desperately, wanted his best friend. He wished that he could meet Dream in person. He wished he could just give Dream a hug or see him or get to know who he was behind the screen. He wanted to have Dream tell him that everything would be okay, and that it would all work out. \n\n\nFumbling for his phone, George texted him.\n\n\ngeorgenotfound: this is the worst day\n\n\nDream’s response was almost instant, and George read it. \n\n\ndreamwastaken: tell me about it :/\n\n\ndreamwastaken: i wish i could just go to sleep and wake up and find out today was just an awful dream\n\n\ngeorgenotfound: me too\n\n\ngeorgenotfound: want to talk about it?\n\n\nDream didn’t respond for a long time, but George saw that he was still online. The green dot by Dream’s name never wavered, and with a sigh, George put his phone down by his side. He still felt like crying, but shoved that feeling down. \n\n\nHis phone buzzed. \n\n\ndreamwastaken: i turned someone down today and it made them cry. \n\n\ndreamwastaken: i felt so awful about it and i didn’t know what to do in the moment because i hate making people unhappy but the guy is so nice and sweet to literally everyone. i wish i could’ve just said yes but i don’t want to lead him on\n\n\ndreamwastaken: and it sucks because i tried, i tried so hard to like him, i did everything right and flirted and we had fun conversations, i guess, but it just wasn’t the same\n\n\nGeorge froze.\n\n\nEverything in his body paused as his brain ran through the odds of everything, tying together loose connections and running through every last possibility. Slowly, everything pointed toward the same conclusion. There was no way all of this was a lucky coincidence… but there was no way it was real.\n\n\nIt couldn’t be true. It couldn’t.\n\n\nAbruptly, he realized Dream had sent him another message, and picked his phone up to read it.\n\n\ndreamwastaken: i also told him i was interested in someone else. which is like. the worst possible thing to say. i don’t know why i said it. \n\n\nWith shaking fingers, and suddenly incredibly nervous, George typed out:\n\n\ngeorgenotfound: are you interested in someone else?\n\n\ndreamwastaken: yeah. \n\n\ndreamwastaken: it’s complicated. \n\n\ndreamwastaken: idk if i want to talk more about it.\n\n\nGeorge felt his heart drop from his throat to his gut. More things began lining up in his mind, funny coincidences and things that George had dismissed as impossible scenarios, purely out of luck. The time Dream was sick at the same time as Clay, the same sleepless nights, the same classes… even their schedules matched up perfectly, down to even the smallest passing period… \n\n\nHe had been staring at his phone for too long. \n\n\nHe needed to say something back. Dream wanted an answer. He wanted George to respond. George tried typing out something, and then deleted it. He tried again and then stopped. \n\n\nWhat were the odds he would move to the exact same place as his online best friend? \n\n\ngeorgenotfound: that’s okay\n\n\nGeorge waited with bated breath for Dream to respond.\n\n\ndreamwastaken: i love you :( &lt;3\n\n\ndreamwastaken: did u want to talk about your day?\n\n\nThe restless anxiety and rejection churned in George’s stomach, before being replaced by a heavy pit of dread. He felt as if his limbs were made of lead. He barely wanted to move, let alone talk about his day. \n\n\ngeorgenotfound: not ready yet\n\n\ndreamwastaken: whenever you are, i’m here &lt;3\n\n\nGeorge stared at the little emoticon and tried to muster up the same energy he usually felt— fluttering cheer, fondness, anything. But all he felt was that sick pit of dread, sinking lower in his gut.\n\n\nGeorge turned his phone off, laid down on his bed, and cried.\n\n\nHe cried for a long time.\n\n\n“Dude,” Sapnap shouted, loud enough that George winced through the line, “Where are you?”\n\n\n“I’ll be there soon,” George said. “We’re at a red light and my mum is driving me.”\n\n\n“Hurry up,” Sapnap urged. “Skeppy’s yelling at me for my music taste and I need you here to defend me.”\n\n\nGeorge laughed. “Give me five minutes, okay?”\n\n\nIn response, Sapnap hung up. George looked at the call log, and in the next instant his happy mood instantly slid away. Truth be told, he was not five minutes away. He was pretty much there, just around the corner, and he could see Alyssa’s house from where he was standing. He was still deciding whether he wanted to go or not.\n\n\nIt was the Sunday after Thanksgiving and the next day they were all going to be forced to go back to school. George’s terrible, horrible, no good very bad day had happened a week and a half ago— the Friday afternoon before Thanksgiving break. He hadn’t seen Clay since— hadn’t seen anyone from the friend group since. \n\n\nHe wasn’t purposely avoiding them. He still texted in their group chat and dealt with Sapnap’s various rantings, but he had debated long and hard about whether he should come to their planned Friendsgiving event. \n\n\nHe had spent the last week trying to come to terms with everything that had happened, and trying to find various ways to deny it. But the harder he fought, the less viable it seemed. There was no way of getting around it.\n\n\nClay was Dream. Dream was Clay. \n\n\nThe odds of him moving to the exact same place as his online best friend were astronomically low. It should have been impossible— a wild shot in the dark. Yet somehow it had happened anyway.\n\n\nGeorge didn’t know if Clay knew about it, or even how Clay would react to having George there. George’s mind spun in terrible circles-- did Clay know? Did he know who George was? Did he know that George knew? \n\n\nHe couldn’t know. If he knew, and had rejected George— if he knew—\n\n\nGeorge couldn’t bear the thought of ruining two of his best friendships in the same day. \n\n\nEven worse, he couldn’t bear thinking about the reactions of his other friends. He didn’t know whether they knew about it. Truth be told, he didn’t want to find out. Even though they had been wonderful and accepting, regardless of how new George was, he worried that they were going to choose Clay over him.\n\n\nAnd who wouldn’t, honestly? The more George thought about it, the more sick he felt. Clay’s— Dream’s— personality was undeniably more sociable and funny. He was more popular and interesting than George could ever hope to be. He was certainly smarter, too— he understood almost everything without even having to try much. George, by comparison, wasn’t really worth anything. \n\n\nClay had been a part of their friend group for years and years. He had been Sapnap’s best friend since they were five, for fuck’s sake. And as much as Sapnap tried to help him, George knew that if it came down to it, everyone would choose Clay over him. \n\n\nGeorge stared at Alyssa’s house and tried to build up the resolve to walk inside. His fingers tapped against his side, and furiously, George tried to still them. He was already there. He had agreed to come a week ago. Everyone was waiting on him. Everyone was waiting inside. They all wanted him to be there. So why couldn’t he move? Why couldn’t he just get up and go?\n\n\nHe glared determinedly at the ground, and finally forced himself to move, only a few minutes after Sapnap had called him. He had been in plenty of awkward situations before; what was one more? All he had to do was act normal. Breathe. He could do this. \n\n\nHe knocked on the door, and it swung open. \n\n\n“George!”\n\n\nEveryone’s hellos blended into a mishmash of voices, and Bad affectionately pulled him closer and ruffled his hair. George shoved him back and Bad put a hand to his heart, mock offended. They were all congregated in Alyssa's kitchen, a sleek, marble covered place. Various appetizers were displayed on the counter, and Sapnap’s music (he really did have terrible taste) was playing in the background. He could hear Skeppy and Sapnap arguing from the other room over who deserved to have the aux cord. \n\n\n“Sorry I’m late,” George said, wincing slightly. “My mum is a slow driver.”\n\n\nThankfully, everyone easily accepted his lie. George took a seat at Alyssa’s counter, right next to Ponk, and kept his stare on the ground. He was achingly aware of Clay, sitting barely ten feet away. George didn’t want to look at him, but he couldn’t stop himself. He was magnetic. He was pulling George in, no matter how much George tried to resist it. He was fighting a losing battle. \n\n\nGeorge couldn’t stop staring at him. \n\n\nHe was mentally assigning a face to the name of the guy he’d been texting for years, his best friend, everything feeling so recognizable at once— blond hair, green eyes, a smattering of freckles. The shape of his nose and his jawline. Even his voice lined up, and matched perfectly with what George had always assumed Dream would sound like. It all made so, so much sense. \n\n\nClay— Dream— caught him staring, twenty painful minutes in, and raised an eyebrow. “George?”\n\n\n“Nothing,” George muttered. He looked down and listened to everyone’s conversations. Clay hummed and turned away. George didn’t know how he could act so unbothered, so incredibly nonchalant, when the entire situation was eating George up on the inside like acid. He didn't know how Clay could try and pretend like everything was normal.\n\n\nSo when Clay wasn’t looking, George continued to take in the furrowed brow of concentration on Clay’s face, the lazy, floppy hoodie he always wore, and abruptly realized there was no air in his lungs and felt like he was drowning. He coughed and turned away, trying to regain some semblance of normalcy.\n\n\n“Sapnap,” Skeppy announced, “We need to talk about your music taste. This is an intervention.” \n\n\n“What?” Sapnap said indignantly. “There’s nothing wrong with it.”\n\n\n“It’s absolute shit,” Ponk said. \n\n\n“Language!”\n\n\n“No, it’s terrible,” Clay laughed. “Everyone knows it.”\n\n\nSapnap huffed and crossed his arms. “Well, that’s just rude.”\n\n\nPonk and Alyssa shared a skeptical glance. “Are we wrong?” \n\n\n“Even George agrees with me,” Clay said, and gestured to him, “Right?”\n\n\n\nWhat was he playing at?  \n\n\n\n“Sure,” George said uncertainly. \n\n\n“I thought you were on my side,” Sapnap whined dramatically. “I just want your support.”\n\n\nGeorge felt as if he were caught between a rock and a hard place. He glanced quickly from Clay to Sapnap and didn’t quite know what to say. \n\n\n“Sorry,” he tried, hoping that was enough to put them at ease. “I’m doing my best here.”\n\n\n“Come on,” Clay implored, turning those awful, smirking puppy-dog eyes on him, “Georgie, please—”\n\n\n“Don’t call me that,” George snapped. \n\n\nThe room quieted. \n\n\nGeorge’s stomach turned. The silence was awful and tense. The only sound was Sapnap’s shitty music playing through the speakers, and George couldn’t handle it anymore. \n\n\n“I’m gonna go to the bathroom,” he said quickly, and tried to escape the suffocating awkwardness. His heart was pounding through his ears. Wordlessly, he went down the hall and locked the door behind him. He ran the water, hoping the white noise would help to clear his mind. \n\n\nFor a moment, he felt awfully, bitterly angry. Why the fuck was Clay— Dream— like this? He had seemed so obviously interested in George, had checked off every box, had practically flirted with him, and then suddenly turned him down after leading him on for so long. Now he was back to acting like his old, arrogant self— back to acting like nothing mattered— what was wrong with him?\n\nThere was a tentative knock on the door, and then Sapnap’s voice filtered through.\n\n“George?” Sapnap asked quietly. “Come help me pick out the next playlist.” \n\n\nGeorge blinked hard, feeling his eyes stinging, and then sucked in a deep breath and opened the door. “What?”\n\n\nSapnap caught the back of George’s shirt and tugged. “I want to talk. Come on.”\n\n\nObediently, George followed Sapnap down the hallway, leaving the rest of the group behind. Sapnap stopped once they were distant enough and then fixed George with a firm look. \n\n\n“What happened?” he asked bluntly. “What’s going on?”\n\n\n“Nothing,” George said mulishly. “Why, did Clay tell you anything?”\n\n\n“No,” Sapnap said, “He hasn’t. But clearly something has, and you’re not telling me what.”\n\n\nGeorge crossed his arms and pushed down the bitterness. Sapnap was his friend, and he deserved to know. \n\n\n“Fine,” he said. “I asked him out, and he rejected me.” \n\n\nAlso, George wanted to add, Clay has actually been my best friend since I was twelve, and he has no idea. \n\n\nSapnap’s gaze turned from questioning to shocked, and George quickly looked away. He didn’t want any pity. He just wanted everything to straighten out, to go back to normal.\n\n\n“Really?” Sapnap said, as if he didn’t believe it himself. “He turned you down?”\n\n\n“Yes,” George snapped. Wasn’t that what he just said?\n\n\n“Whoa,” Sapnap said, and held his hands out. “Sorry for pushing. I’m just… really?” Sapnap looked a little bit lost. “I was sure he was going to say yes.” \n\n\nGeorge glared. “Well, he didn’t.” \n\n\nAs soon as he said it, all of the irritation and frustration leached out of him, and was replaced with the same awful, heavy dread he had felt a few days earlier. Sapnap didn’t deserve his bad mood, and shouldn’t have to put up with how awful he was feeling. All Sapnap had done was do his best to help George along and work things out with him. \n\n\n“Sorry,” George said faintly, into the silence. “I don’t mean to be upset.” \n\n\nSapnap gave George a small, apologetic smile. “It sucks. It’s okay.” \n\n\nYou don’t know the half of it, George wanted to say. He almost wanted to laugh. It was stupidly, incredibly obvious. It had been obvious for so long. \n\n\nThe same questions resurfaced. Did Dream know? Did he know that he and George were friends in real life? Had Dream kept the secret from him, or was he just as clueless as George had been? \n\n\nGeorge felt sick. The Dream he knew online was secretive and cared deeply about his privacy, and now it felt as if George had just ripped that to shreds. It felt as if George had just ripped down all the walls and trampled over Dream’s boundaries. \n\n\n“Do you want to take a walk?” Sapnap said, lending an escape. “There’s not a lot of fresh air in here.”\n\n\nGeorge laughed, wet and choked. “Sure.”\n\n\nSapnap nodded, and gestured with his hand. “Let me just go tell everyone else we’ll be off, one moment.”\n\n\nSapnap raced around the corner where everyone else was, and his voice echoed faintly. George pressed his palms to his cheeks and blinked furiously; he hadn’t realized he’d been crying. Quickly, he wiped away his tears and tried to clear his mind. \n\n\n“Alright,” Sapnap said, returning. “Let’s go get a drink somewhere.”\n\n\n“Not an actual drink,” George said. \n\n\n“Of course not,” Sapnap said, and dragged him out into the afternoon daylight. \n\n\nSapnap pushed him into the closest Starbucks they found and promised to pay for his drink. George rolled his eyes but obligingly sat down at one of the booths. Before long, Sapnap settled in front of him with an iced latte for George and a chocolate frappuccino for himself. \n\n\n“So,” Sapnap said, and sucked the whipped cream off the top of his drink, “Tell me everything.”\n\n\nGeorge sighed, opened his mouth to try and find the right words, and ended up spilling everything to Sapnap.\n\n\nHe carefully didn’t mention Dream, and didn’t mention how he had actually known Clay for years. He kept that to himself, knowing that Dream wouldn’t want his privacy to be exposed like that. Still, he told Sapnap everything— exactly what he had said to ask Clay out, what Clay had said, how the entire situation had ended, how awful everything felt, the way he had tried to avoid him after but couldn’t.\n\n\n“Wow,” Sapnap said quietly, eyes wide, after George had practically talked himself hoarse. “So there’s a third person?”\n\n\n“Yeah,” George said. “And I have no idea who.”\n\n\n“Wow,” Sapnap repeated. He looked down at the table in confusion. “I… I can’t think of anyone else.”\n\n\nGeorge twisted his lips. It wasn’t what he really wanted to hear, but it was what he expected. “It’s okay.”\n\n\n“It’s just,” Sapnap gestured expressively. “Clay’s never mentioned another person. Ever. He usually doesn’t even talk with people outside of our group. The only person he’s talked about recently is you.”\n\n\n“Thanks,” George muttered. Hearing that stung more, somehow. \n\n\nHe also resonated with what Sapnap was saying. If Clay was interested in another person, surely Dream would talk to George about it if he felt like he couldn’t talk to his best friend in person? Surely he trusted \"georgenotfound\" enough to confide in him? \n\n\n“Was there any hope that he might change his mind?” Sapnap asked.\n\n\n“I doubt it,” George said. “He was nice about it. But it was a pretty obvious no.” \n\n\nGeorge felt his eyes growing prickly again and blinked furiously; he was in public. He hated crying. He wasn’t going to cry again. \n\n\n“I guess I’ll just start moving on,” George sighed. “It sucks.”\n\n\nSapnap looked a little lost at what to do for comfort, but gingerly patted George’s arm. For some reason that made George laugh slightly. Sapnap gave him a small smile, and George glanced back down to the table and tried to breathe through the awful rejection dwelling in his chest.  \n\n\n“Should we head back?” Sapnap asked after a few moments of silence. Both of their drinks were empty at that point, and George chased the last bits of coffee with his straw before answering.\n\n\n“Probably,” George sighed. “I feel better. A little bit.”\n\n\n“That’s good,” Sapnap said. \n\n\nHe gave George a smile, and suddenly George blurted out, “I’m glad you’re my friend.”\n\n\nSapnap laughed. “I’m so glad I forced you to join our group.”\n\n\n“Yeah,” George agreed, eyes stinging, “I never would’ve had a year as great as this without you.” \n\n\nSapnap wrapped an arm around George and squeezed him tight, and George laughed and allowed himself to get pulled into the hug. “Me either.” \n\n\nGeorge blinked the wetness out of his eyes and gestured to the sidewalk. “Alright,” he said, releasing a slow breath. “Let’s go.” \n\n\nWhen they got back, Sapnap marched inside without knocking— Alyssa had left the door unlocked for them to return. Everyone was seated at the dining table (Alyssa had insisted on it being unnecessarily formal, complete with fancy plates and silverware, though nearly everyone was in jeans or sweatpants). The conversation quieted as they walked in and took the last remaining seats open— noticeably, on the opposite side of the table from Clay. George wasn’t sure whether that was intentional or not. \n\n\n“We were waiting for you guys, you took forever.”\n\n\n“Sorry,” Sapnap said, with an elaborate shrug. “Sometimes you just have to go get a Starbucks drink, and you can’t help it.”\n\n\n“And you didn’t get me anything?” Bad teased. \n\n\nGeorge was extremely grateful for both Sapnap’s lying skills, as well as everyone else’s tactfulness. He risked a glance at the other side of the table, where Clay was sitting. Clay was turned slightly away from the table, typing something on his phone, tongue in cheek, and he seemed to type and retype it multiple times before finally hitting send. As if on cue, George felt his phone vibrate in his pocket.\n\n\nThat basically confirmed it, then, ripping away the last shreds of doubt from George’s hands. George slowly evened his breathing; there was no point in panicking if Dream didn’t know, and so far, he had given no signs of knowing. Clay— Dream— wouldn’t have texted him so obviously unless he had no idea who George really was.\n\n\nGeorge resisted the urge to take his phone out of his pocket and read what Clay had just sent him. His phone buzzed four more times, which made George even more curious. \n\n\nClay turned his phone off and put it in his pocket. His fingers tapped on the table in an unsteady beat, and he made no obvious effort to join in on their conversation. He laughed along with their jokes, but halfheartedly, and he seemed distanced, much more so than usual. More than once, George caught Sapnap sending Clay a confused, worried look, but said nothing. \n\n\nFinally Clay said, “I’m going to go. My dad wants me back.” \n\n\n“But we’re just getting started,” Bad complained. \n\n\nClay gave one of his trademark, easygoing smiles, and shrugged lightly. It didn’t quite hide his odd mood. “Can’t help it.”\n\n\n“Is everything good at home?”\n\n\n“Yeah,” Clay said, and waved a hand. “Everything’s fine. It’s just getting late.”\n\n\n“It’s only five—”\n\n\n“He just wants me back,” Clay repeated, voice flinty. There was an awkward silence for a moment. George didn’t dare look up from the tablecloth. \n\n\n“You’re sure?” Alyssa asked, concerned.\n\n\n“I’m sure.” Clay got up and checked his phone again. “Have fun, guys.” \n\n\nAfter he left, Skeppy frowned. “That’s weird,” he commented. Bad hummed in agreement. George said nothing. \n\n\nHe knew Clay was lying.\n\n\nSapnap also said nothing, though George noticed the furtive look sent his way. George swallowed hard, felt the hard outline of his phone in his pocket, and reminded himself that patience was a virtue. \n\n\nGeorge spent the rest of the night in a quiet daze. He took note of everyone’s comments, took note of their inside jokes and laughs, but found it difficult to join in himself. Through the whole night, Sapnap sat at his side and did his best to try and bring George out of his shell. \n\n\nIt took another hour before everyone mutually agreed to disband and see each other at school the next day. George took the shortest route home that he could, cutting through parks and backyards. The second he shut his front door behind him, he practically ripped his phone out of his pocket and fumbled to unlock it. He opened up the messenger app, and stopped dead in his tracks the second he read Dream's messages.\n\n\ndreamwastaken: hey\n\n\ndreamwastaken: i’ve been thinking about this for a while and it’s probably unexpected for you\n\n\ndreamwastaken: but i want to meet you. in person\n\n\ndreamwastaken: i have wanted to, for a while now, but i wasn’t ready\n\n\ndreamwastaken: but i think i’m ready now. \n\n\nGeorge stared at his phone. His heart leapt into his throat, and he felt the same fluttering, panicky feeling rise in his chest. Dream wanted to meet him, in person. Dream wanted to know who he was, and more importantly, he trusted George enough to finally meet him. \n\n\nGeorge pressed a hand to his mouth, not sure whether he was smiling or frowning. He didn’t know whether he was happy or upset, but anything he was feeling right then was tinged with some sort of contentment. \n\n\nMaybe it was time to actually set the records straight, once and for all. Finally have everything work out, and put everything to rest. \n\n\nHesitantly, he typed out:\n\n\ngeorgenotfound: when are you free?\n\n\ngeorgenotfound: when are you free?\n\n\nGeorge looked at his recent texts again with Dream and tried to quell the frantic pace of his heart. Dream had responded within a few minutes to his text, and eventually the two of them had landed on a perfect time to meet in person for the first time. \n\n\nIt was late in the day on Friday, nearly five in the afternoon, and Dream had picked out a quiet cafe down the block from the movie theater they had been to together. It was nestled between the community park and one of the main boulevards. At this time, the coffee shop would be nearly deserted. It might just be the two of them.\n\n\nGeorge was only a few blocks away from the cafe, and his hands were shaking from where he scrolled through his recent texts with Dream obsessively. He was so anxious that he wasn’t sure how he would handle this. For the entirety of the week before, George had been replaying scenarios in his head, trying to figure out how Clay would respond to him. What would he say when they first met? Would he be disappointed? Would he be excited? \n\n\nGeorge didn’t know.\n\n\nHe was almost thirty minutes early to their designated meeting time, which only made things more awkward. Would it be bad if he showed up that early? Would Clay take one look at him and turn around to leave? \n\n\nGeorge kept walking, put his phone in his pocket, and stared at the pavement passing beneath his feet. Vaguely, he wanted to order a coffee just to have something to do with his hands when he got to the cafe, but he abruptly realized that caffeine would only make him more jittery. He slowed his step briefly and tried to calm his nerves. \n\n\nFor the last week, George had been watching Clay as cautiously as he knew how, to see if there was any flash of recognition in his eyes, or if he had no idea. All their interactions had been polite and distanced ever since Friendsgiving. They barely exchanged glances anymore in precalculus, and they certainly didn’t go and study together. Both he and Clay seemed to have mutually decided to forget that anything had ever happened. It was sad and distant. \n\n\nGeorge didn’t know whether everyone in their friend group knew what had happened— if they had picked up on George’s and Clay’s sudden reluctance to be together, or if they were oblivious to the tension. If they did notice, they hadn’t commented on it. \n\n\nEven though he had been upset and angry the week before, over the week’s time, all of George’s unhappiness had slowly faded away. Unfortunately, it had been replaced with increasing levels of anticipation, racking up day after day. Last night, George had been unable to sleep, staring up at the ceiling, reading back through his and Dream’s texts over and over. He was counting down the hours, but whether in anxiety or excitement, he couldn’t tell. \n\n\nThere was one block until the cafe. George checked his phone again. Dream was online, but he hadn’t said anything. Was he on his way right now? Was he obsessively reading through his texts the same way George had been doing? Was he sitting there, waiting for someone else to walk in, nervously anticipating who it was? George didn’t know.\n\n\nHe nervously wiped his hands on his jeans and swung the cafe door open. His eyes scanned the room, and realized— \n\n\nClay was already there. \n\n\nHe was sitting in one of the back booths, fingers tapping rapidly on the table, knee bouncing up and down. He kept looking down at his phone and then up at the windows in nervous anticipation. \n\n\nAll of a sudden, it seemed so very real. Was he actually going to do this?\n\n\nGeorge start to walk over, but he didn’t know what he was going to say, or what he was going to do, but then he steeled himself, and Clay glanced up at him in clear confusion, head tilted to the side, and then—\n\n\n“Hi,” George said. Shyly: “Dream, right?”\n\n\nDream stared at him for a long, long moment before saying quietly, almost voiceless, “George?”\n\n\n“Hi,” George said again, and a flustered smile spread across his face. He slid into the opposite side of the booth and tried to hide how shaky his hands were. Dream’s eyes flicked over his face, and George knew that he was probably doing the same thing George had done when he first figured it out: putting together a face to the name online, matching together every piece of information. \n\n\nFinally, Dream looked away.\n\n\n“George,” he said slowly, hesitantly, as if confirming it, and George nodded once. “It’s you?”\n\n\nGeorge nodded again, and Dream looked at him again, mouth parted, and finally said, “It’s you. Of course it’s you.”\n\n\n“It’s me,” George said, and his cheeks hurt from smiling.\n\n\nDream shook his head. “I’m such an idiot. I’m literally—”\n\n\nGeorge resisted the urge to laugh. “You’re not an idiot.” \n\n\n“No, I absolutely am.” Dream’s glance flickered over him, again and again, and he smiled— not Clay’s usual cocky grin, but Dream’s honest and hopeful one. It made George’s heart do a happy little flip in his chest. “I can’t believe— did you— how long have you known?”\n\n\n“It took me so long to figure out,” George mumbled, feeling his cheeks go red. “I’ve only known for a few weeks. I didn’t want to say anything until you were ready…” \n\n\n“Weeks?” Dream echoed, looking flustered. \n\n\n“Since you turned me down,” George admitted. Dream had the grace to look slightly sheepish. \n\n\n“If it makes you feel better,” he said, “I turned you down for you.” \n\n\nThat gave George pause. “What?”\n\n\nDream opened his mouth, closed it again, like he was trying to find the right words to say. Eventually, he seemed to bite the bullet and rushed out, “I’ve had a crush on you. Georgenotfound. For so long.”\n\n\n“Me?” George said. He felt a jolt in his stomach, like he had missed a step going down the stairs. “Really?”\n\n\nDream nodded and ducked his head. “I just didn’t know what to say.”\n\n\n“Oh God,” George said, and put his hands over his face, as if that would stop how red his face was going. “So the whole time I’ve been asking you for relationship advice…”\n\n\n“You were asking me about me,” Dream realized, completing George’s sentence. “And the whole time I was jealous. Of myself!”\n\n\nThey shared a glance for a moment, eager, earnest, and hopeful, and then broke into laughter. The whole situation was so unrealistic and so incredible. It had gone better than George could have ever imagined. \n\n\n“Should we— should we order something?” Dream said after a moment. He appeared just as ruffled as George felt. “A drink or something?”\n\n\n“You don’t like coffee,” George blurted out. He didn’t know why he said it, but it made Dream’s cheeks turn pink. George didn’t think that was from the air conditioning. “I can get something for you. Hot chocolate?”\n\n\n“Peppermint,” Dream said. “The only good hot chocolate flavour.”\n\n\n“Cinnamon is better, you’re so wrong,” George argued back, and all of a sudden, it was that easy. Their bickering turned into a friendly debate over the merits of tea versus coffee, and then it merged into a conversation about their latest game in Minecraft and ways to improve. George sketched out a plugin they could code where one person could control the mobs in the game, and the other person had to survive. Dream laughed and started naming all of the ways he would easily win and George rolled his eyes, countering every one of his escape ideas with some of his own. \n\n\nThey left the cafe at one point, once they had thoroughly exhausted themselves of sitting still, and started walking down towards the same park they had been in before. This time there was no need to hop the fence. The sun was gentle overhead, about to dip below the horizon, and the sky was clear. Dream and George walked around the length of the park, still talking the entire time, and eventually arrived back at the same playground they were at before.\n\n\n“Want to climb it again?” George said playfully. Dream laughed.\n\n\n“Only if you’re here to catch me,” he said, teasing. George’s heart jumped. \n\n\n“Come on, then,” George said, beckoning him up. “Let’s go.” \n\n\nDream stared at the monkey bars for a second, before apparently steeling himself and climbing up after George. George offered him a hand and Dream gripped it tightly, pulling himself up to sit next to George. He was tense for a moment, white knuckled, and then relaxed as soon as it became apparent that he wasn’t going to fall. \n\n\nThey looked out over the park for a moment; yellow sunlight cut through trees in dappled patches, and sparrows chirped songs from the trees. An elderly couple walked together down one of the paths, another young woman jogged through with a dog running next to her. George realized suddenly that Dream had never let go of his hand, and had instead just linked his fingers through George’s. It made him feel fluttery and radiant in the best way. \n\n\nHe turned and saw that Dream was looking at him again, eyes still wide with amazement. \n\n\n“What?”\n\n\n“Sorry,” Dream said quickly, and looked away George caught him staring. “I’m just still trying to believe it.”\n\n\n“That’s okay,” George said. “Me too, in a way.”\n\n\nDream opened his mouth, seemed to fumble for words, and then said, “How did I not figure it out? It makes so much sense now.”\n\n\n“Hindsight is twenty twenty,” George said agreeably. Dream rolled his eyes and shoulder-checked him lightly. \n\n\n“You know what I mean.”\n\n\n“Yeah,” George said. “I do.” \n\n\nSilence fell over them again, comfortable and calming. Dream’s thumb circled the back of George’s hands almost unconsciously, while George was hyper aware of every movement he made. It sent tingly, electric shocks spiking across George’s nerves.\n\n\n“Sorry about everything at Friendsgiving,” Dream blurted suddenly. George cocked his head at him curiously. \n\n\n“I just—” Dream held up a hand, as if looking for an answer. “I just thought that if I acted like normal, everything would go back to normal.” He smiled wryly. “I guess that didn’t work.”\n\n\n“It’s okay,” George said, feeling a bit lost. He did remember what Dream had said then, and how awkwardly George had reacted. “I didn’t know what to do, and I didn’t know if you knew, and I was so on edge.”\n\n\n“Regardless,” Dream said, “I’m sorry for pushing your boundaries like that.” \n\n\n“It’s okay,” George said again, and at Dream’s skeptical glance, squeezed his hand tighter and repeated it. “Everything worked out, didn’t it?”\n\n\n“Yeah,” Dream said softly, and looked at him again. “I guess it did.” \n\n\n“You are such a sap,” George said, rolling his eyes. \n\n\n“Shut up,” Dream said, slightly embarrassed. He shifted on the monkey bars and froze for a quick second as his hand slipped.\n\n\n“You’re okay,” George said, and reached a hand out to steady him. “You’re not going to fall.”\n\n\nDream huffed. “You sure?”\n\n\n“Well, stop leaning over the edge,” George laughed. “It’s scarier if you look over.”\n\n\n“I don’t know,” Dream said thoughtfully. “Maybe it’s better to confront your fears.”\n\n\n“I’m not very good at doing that,” George said.\n\n\n“I think you are,” Dream said. \n\n\n“Mhm?”\n\n\n“Mhm.” \n\n\nThere was a heavy, weighted silence between them. George looked down at the park again and relished the feel of Dream’s hand in his. \n\n\n“So,” George said slowly, “What happens now?”\n\n\nDream’s brow furrowed slightly. “What do you mean?”\n\n\nGeorge felt timid, almost scared saying it, but he gestured between the two of them with his free hand. “What happens with us?”\n\n\n“Oh,” Dream said in recognition. Quietly, he continued, “I’m not sure.”\n\n\n“Okay,” George breathed. There was a stirring in his stomach, something that set all of his hairs on edge. \n\n\n“I mean,” Dream fumbled, and gestured with his free hand, “If you wanted to—” \n\n\n“If I wanted to?” George prompted. He knew it was probably teasing, but he kind of enjoyed making Dream speechless. Dream had done it to him so many times, and it was fun to have the tables turned. \n\n\n“If you wanted to date,” Dream said quickly. “Us. Together.” \n\n\n“Are you asking me out?” George teased. Dream huffed impatiently and rolled his eyes, but George caught the flush of color high on his cheekbones.\n\n\n“Yes,” he said, more firmly. “I am.”\n\n\n“Then yes,” George said, trying not to smile again and failing miserably, “Let’s do that.” \n\n\nThe sun was starting to dip, sinking lower and lower in the sky. The horizon was beginning to bleach, fading into a softer, gentler blue. George could see the fiery yellow of the sun casting long shadows over the park. It made Dream’s hair lighter, and silhouetted him from the back. George couldn’t stop looking at him, couldn’t stop thinking, Dream, Dream, Dream.\n\n\n“A date,” Dream said.\n\n\n“An actual one,” George agreed.\n\n\nThere was another comfortable moment of silence. George swung his legs off the edge of the monkey bars, feet dangling down, and slowly, Dream moved so that he was doing the same, even though it likely made his heart race. George felt a fierce jolt of pride and happiness in his stomach. He squeezed Dream’s hand again and Dream squeezed back. \n\n\n“So,” George said, “About this date.”\n\n\n“What about it?”\n\n\n“Where should we go?”\n\n\n“We could see a movie again.”\n\n\nGeorge grinned. “A good one this time.” \n\n\n“And definitely without Sapnap there,” Dream added.  \n\n\n“We could go to an arcade,” George said. “You can win me one of those giant stuffed animals.” \n\n\n“Or another cafe,” Dream said, “And you can buy my drink for me.” \n\n\n“Or we could just do this,” George said softly. “Anything works.”\n\n\n“You know, they say anywhere is a date if you’re with the right person.”\n\n\n“Oh?” George said lightly. “And am I that right person?”\n\n\n“Of course you are,” Dream said. \n\n\n“Good,” George said, “Because you’re the right person too.”\n\n\nDream glanced over at him, still holding George’s hand, electricity radiating from every place they touched, and impulsively, George leaned in and kissed him.\n\n\nIt wasn’t the best kiss in the entire world— it wasn’t kissing dramatically in the rain, or any other life changing event— but it was wonderful. Slowly, tentatively, as if they were both figuring it out together, Dream’s free hand came up and cupped his cheek gently. When they finally separated, sharing the same breath, George couldn’t stop himself from smiling.\n\n\nGeorge was learning many things about himself that day; surprisingly, how forward and direct he could be, and how different that was from just a year before. A year ago he couldn’t have possibly considered flirting with his crush, and being bold enough to ask him out, and he couldn’t have possibly imagined having everything work out so perfectly. \n\n\nDream brought out all the best parts of him, it seemed. \n\n\nDream leaned in and kissed him again, and George didn’t miss how Dream’s grip on his hand tightened slightly as he swayed, ten feet above the ground. George wanted to keep kissing him, but he kept smiling, and Dream kept smiling too, and George still couldn’t believe how wonderfully everything had gone. \n\n\nAfter a minute, or ten, or an hour, or an eternity later, George dropped down from the playground. The turf underneath his feet gave slightly under his weight, and George reached out to steady himself. He looked back up at Dream and was hit with a major sense of deja vu.  \n\n\n“You’re going to have to help me down again,” Dream said, yet again. “I’m not jumping.”\n\n\n“I would catch you,” George said seriously.\n\n\nDream laughed. “You’re five and a half feet tall, no you wouldn’t.”\n\n\n“I’m five seven,” George corrected automatically, and then glared at Dream, though he was still smiling. “And it’s not my fault that you’re stupidly tall.”\n\n\nStill, he watched and waited as Dream clambered down awkwardly, finally looking so much more comfortable on the ground. Wordlessly, George reached out, and Dream linked their fingers together again. \n\n\nSlowly, they walked back towards George’s house. It was much closer than Dream’s, only a few blocks away, and their conversation flowed from one thing to the next, faster than George could keep track, but somehow they were always on the same wavelength. Before long, George reached the front porch of his house, and he unlocked the door with trepidation. The lights were on in the background, a sign that his mother was home, but she was nowhere in sight.  \n\n\n“I’ll see you tomorrow,” Dream said. He said it slowly, because it was an unspoken truth that saying those words would mean an end to the night. \n\n\n“Tomorrow,” George agreed. He didn’t want to close the door just yet. He didn’t want the night to end. Dream seemed equally reluctant, right on the edge of George’s porch. Night had fallen, at that point, and George could hear the crickets chirping quietly in the background. Everything seemed fuzzy and hazy, tinted rose-gold at the edges. \n\n\nDream broke the silence. “Goodnight,” he said, and gave George another honest, genuine smile. George echoed it back, and finally closed the door behind him.\n\n\nHe couldn’t wait to see him again.\n\n\n“You’re fucking with me,” Sapnap said indignantly. “You’re joking.”\n\n\n“Nope,” George said, and didn’t even bother to hide his smile.  \n\n\n“No,” Sapnap said, and his mouth fell open. He stared at George with wide eyes. “Really? Really?”\n\n\n“Yeah,” George said smugly. “I’ve known him for years.”\n\n\n“Years?” Sapnap squeaked.\n\n\n“Four of them,” George declared.\n\n\nSapnap sat down with a thud. “I’m losing my mind.”\n\n\n“Believe me,” George said, “I’m losing my mind too.”\n\n\n“So you’re together now?” Sapnap demanded. “Everything worked out?” \n\n\n“Yeah,” George sighed, and found some satisfaction in the way Sapnap’s eyes went as wide as dinner plates. “We’re dating.” \n\n\nSapnap took only a moment to register it before pumping his fist in the air in excitement. “I’m literally the greatest!”\n\n\n“I doubt that.”\n\n\n“I orchestrated this whole thing,” Sapnap declared. “I was your wingman! I made this happen!”\n\n\n“You really didn’t,” George muttered, but allowed himself to get swept up in Sapnap’s enthusiasm. George was certainly happy about it, but his excitement had dimmed from the giddy, jittery exhilaration to a quiet, soothing certainty over the last few days.\n\n\n“You can say whatever you want,” Sapnap said cheerfully, “But just know this is an absolute win for me.”  \n\n\nGeorge tried not to laugh at Sapnap’s antics. After a moment, Sapnap quieted down a bit. “Seriously, though,” he said. “I’m happy for you guys.”\n\n\n“Thanks,” George said. \n\n\n“Really,” he insisted, “Both of you were so miserable when he turned you down, and you both seem so happy now. So clearly something worked out, because I haven’t seen Clay look this happy in months.”\n\n\nThat sentence made George’s heart do giddy, twirling jumps in his chest. It was an odd badge of pride he wore, to make someone happy, and George liked making Dream happy. He liked seeing the slight dimples that formed when he smiled, the way his face lit up when he and George talked. His eyes crinkled at the corners in the most beautiful way. \n\n\nAlso,” Sapnap added mischievously, “The entire friend group is going to lose their shit as soon as you announce it.”\n\n\n“Really?” George said curiously. “I don’t think so.”\n\n\nSapnap raised an eyebrow. “Are you kidding?”\n\n\n“Yeah,” George said. “I feel like we’ve been pretty low key about it, right?” \n\n\nSapnap stared at him for a moment in obvious disbelief, before shaking his head in dismissal. George thought he heard Sapnap mutter idiot under his breath, and George laughed and turned away. \n\n\nGeorge wasn’t sure how everyone would react when Dream and George actually broke the news to them. He supposed he would find out the next morning, at lunch— he hadn’t seen anyone bar Sapnap over the weekend. Both he and Dream had planned to tell them on Monday during lunch, and they would drop the ball on them then. \n\n\nAnd the next morning, the lunch table reacted exactly as Sapnap had predicted they would— explosively. \n\n\nWhen he and Dream approached from precalculus (holding hands, George would add) the first person to notice had been Alyssa, who shouted incoherently and pointed to them. Her voice was excited and drew people’s attention, and then everyone at the entire table broke into broad smiles.\n\n\n“Yes!” Ponk shouted. “Finally!”\n\n\nSkeppy groaned and turned to Bad. “How much money do I owe you?”\n\n\n“One hundred dollars,” Bad proclaimed gleefully. “Pay up!”\n\n\n“You guys bet on us?” George asked. He and Dream took a seat next to each other, and Ponk scooted over so that they could both fit. \n\n\n“Yes,” Skeppy said mournfully. “And if you two had waited one week, I would be the one with a hundred dollars.”\n\n\n“My condolences,” Dream said sarcastically. “Next time I’ll make sure to check in with you guys before I get into a relationship.”\n\n\n“So it’s true?” Alyssa asked, leaning forward in excitement. “You guys are dating?”\n\n\nGeorge rolled his eyes but felt himself go pink. “Yeah. We are.”\n\n\nThe table dissolved into raucous cheering, and then quickly turned into good-natured ribbing on how long it took and how they could tell that George had been crushing on him—\n\n\n“Since the first few weeks,” Alyssa declared proudly, and nudged George. “I’m an expert on crushes.”\n\n\n“Wh— how?” George spluttered. “I didn’t even know then. How can you—”\n\n\nAlyssa grinned slyly and turned away. “Like I said. I’m an expert.”\n\n\n“I knew as soon as Halloween happened,” Ponk said. “When you fell asleep on each other.”\n\n\n“I did not fall asleep on him,” Dream said instantly, “He fell asleep on me. It was gross and not at all cute.”\n\n\n“It was adorable,” Bad sighed. “You two are so cute.” \n\n\n“Anyway,” Sapnap said, cutting all their talking off, “I was the one who knew the entire time, so I’m winning here.”\n\n\n“No you didn’t,” Skeppy said dubiously. “I doubt that.”\n\n\n“No,” George sighed regretfully, and confirmed, “He actually did know.”\n\n\n“I was George’s wingman,” Sapnap said gleefully. The entire table groaned at once.\n\n\n“Seriously?” Alyssa said in disbelief. “He’s the worst wingman in the entire world.”\n\n\n“That’s exactly what I said!” Dream agreed. \n\n\nSapnap rolled his eyes. “You guys just don’t understand my genius.”\n\n\n“What genius?” George asked, and the entire table laughed. George looked to Dream, who squeezed his hand tightly. Dream grinned and for a second, it was just the two of them, in their own little world.\n\n\n“Alright, break it up,” Sapnap called, flapping his hands at them. “Let’s keep it PG-13, here.”\n\n\n“We’re not even doing anything,” Dream muttered. His face flushed pink, the most uncomposed George had ever seen him in front of the entire group. “We’re just holding hands.” \n\n\n“Uh, yeah,” Sapnap said, like it was obvious, “And we all know where that leads, so…”\n\n\nDream laughed and reached over George to hit Sapnap’s shoulder. “Oh, shut up.”\n\n\n“Yeah, Sapnap, shut up,” Skeppy called. “Let them have their fun.”\n\n\nGeorge laughed at their antics, and resolved himself to another half hour of it. It really was wonderful to see how happy everyone was for him and Dream. And clearly, Dream was happy about it too. He was joking along with everyone else and untroubled; not for the first time, George felt like he was living his best life. \n\n\nTheir first “date” came a few days later, right before finals struck. Dream had chosen the location, and George didn’t know where he was taking him. Surprisingly, George had actually called Alyssa in a panic for what to do. Instead of laughing at him, she demanded that he put her on FaceTime and then methodically go through his entire closet. He supposed it was a little stereotypical of him to ask her, but Alyssa genuinely seemed excited to help him with it. \n\n\nEventually he settled on a pair of black jeans and slightly nicer shoes than his everyday ones. Dream had told him that they weren’t going to a restaurant, which seemed too stiff for both of them, so Alyssa assured George that a plain shirt and a “nice” jacket would be enough.\n\n\n“Just be calm about it,” she soothed him. “Everything is going to go great, and you know it.”\n\n\n“Sure,” George said faintly. “Whatever you say.”\n\n\n“And if you panic you can always text me,” Alyssa promised. “I’m here for you!”\n\n\nGeorge smiled reluctantly and checked the time; he still had fifteen minutes before Dream was due to arrive. He waved goodbye and hung up. He went into the kitchen, where his mother was waiting. \n\n\n“You look great,” she said, and then reached a hand up to flatten down his hair. George immediately protested— he had spent so long in front of the mirror trying to style it so it was “artfully messy,” as Alyssa had put it. His mum was ruining all of his hard work. \n\n\nThe doorbell rang suddenly, and George’s heart jumped. He checked the time; Dream was a few minutes early, which was probably a good sign. This was the first time Dream and his mum were meeting, and George desperately hoped that they would make a good impression.\n\n\nGeorge unlocked the door. Dream was waiting outside, looking slightly nervous, but broke into the cool, confident version of himself as soon as George’s mum came into view. \n\n\n“Hi,” Dream said, and held out a hand, “I’m Clay. It’s nice to meet you.”\n\n\n“It’s nice to meet you too,” George’s mother said politely, and shook his hand. George slowly released a tense breath through his teeth. So far, it looked like things were going well. Quickly, George ducked into his bedroom and grabbed his wallet, phone, and keys. As soon as Dream and his mum were done talking, George wanted to leave as soon as possible. \n\n\nWhen he emerged, Dream was still chatting easily, and if he was nervous, he didn’t show it at all. \n\n\nGeorge checked the time, anxious to escape. “Mum, it’s almost six, we should be going.”\n\n\n“Alright, alright, I’ll let you go.” She reached a hand out and smoothed down his hair one last time. “You go have fun.”\n\n\n“I will,” George said, and protectively touched his hair again, hoping she hadn’t messed it up.\n\n\nThen his mum pointed a warning finger at Dream, and said, “You’ll treat him nicely, won’t you?” \n\n\nIt was less of a question and more of a demand, and Dream quickly said, “Yes, ma’am. I always do.”\n\n\nGeorge rolled his eyes and tried to duck out as hastily as possible. He was sure that his face was bright red. His mother waved them both goodbye and closed the door behind them. \n\n\n“Sorry about my mum,” George muttered, halfway down the sidewalk. “She’s so…”\n\n\nDream shrugged. “I like her.” \n\n\n“Of course you do,” George said, “You have to say that.”\n\n\n“She really cares about you,” Dream said, “It’s nice.”\n\n\nGeorge shook his head fondly, and reached out to link his fingers through Dream’s. “So where are we going?”\n\n\n“You’ll see,” Dream said mysteriously. He reached his car— he had just gotten his license a few weeks ago, and was driving his father’s grey Sedan— and unlocked it. George hopped in the passenger seat and relinked their hands over the console. Dream opened the GPS and set course for somewhere, and he mentioned that it would take around half an hour to get there. George scrolled through his own phone and picked a playlist for them to listen to. \n\n\nWhen Dream pulled into the parking lot, George read the plaque on the outside of the building. \n\n\n“The Orlando Science Observatory?” George said curiously.\n\n\n“It’s a planetarium,” Dream said. His voice was confident and nonchalant, but George heard the slight edge of uncertainty beneath it. “I thought it would be nice for us to go.” \n\n\nThey walked up to the entrance and passed through the wide double doors; the interior of the lobby was incredible, large and domed, and in the centre of the room was a massive pendulum, swinging back and forth. Different hallways branched off, each with an obvious theme; there was a deep blue one, with the phases of the moon patterned over the archway. Another gave way to the various planets in the solar system, with miniature models of each hung up in a row; the third was cheery yellow and gold, clearly with an exhibit on the sun. \n\n\n“Woah,” George said breathlessly, looking up at the ceiling, almost unable to form words. He hadn’t been to a museum in so long, and he had never been to a planetarium before, least of all one like this. “This is amazing.”\n\n\nIf he had looked to the right, he would have seen Dream positively glow with pleasure. “You think so?”\n\n\n“Yeah,” George said, “I’ve never been to a planetarium before, how did you know?”\n\n\n“You told me,” Dream said tentatively. “A while ago, actually.” \n\n\n“Really?” George tried to remember it and came up with a small, one-off text that he had sent, so many months ago. He couldn’t believe that Dream had remembered it after almost a year. “That was so long ago.” \n\n\n“I’ve always wanted to take you here,” Dream said. \n\n\n“Since I said that?”\n\n\n“Well…”\n\n\n“Wait.” The puzzle pieces finally clicked together in George’s head, and he turned to Dream. “You had a crush on me for that long?” \n\n\nColor flushed Dream’s cheekbones, and he ducked his head. “Absolutely not.”\n\n\n“I think you did,” George teased. “You like me.”\n\n\nDream shook his head. “I think you have the wrong person.”\n\n\n“Nope,” George said triumphantly, “You like me. You love m—” \n\n\n“Come on,” Dream said, and tugged George along, neatly silencing him and ending the conversation. “We’ll be late to the film.” \n\n\nThey ended up making it to the actual planetarium with a few minutes to spare, even though it was in the opposite wing of the museum. They settled into their seats, which were tilted back slightly so they could see the entirety of the domed ceiling. Eventually the theatre darkened, and the ceiling began to be speckled with stars, wide galaxies in all shades of blue, and George squeezed Dream’s hand tight next to him. He leaned back further, let his eyes glaze over with indoor stars, and let the movie sweep him away.\n\n\nDream dropped him off at the door to his house a few hours later. George’s mother must have been waiting for him to return, because the front lights flicked on, and she opened it as soon as George reached the front door. \n\n\n“Thank you for bringing him back in one piece,” she said kindly to Dream, who was standing politely at the front porch. \n\n\n“It’s the least I can do,” Dream said diplomatically. George’s mum raised an eyebrow, but overall seemed mostly pleased. George ducked his head and wanted to escape inside to avoid the eventual shovel talk his mother would have to give Dream. \n\n\n“So?” George asked hesitantly, as soon as the door closed behind him. “Do you approve?”\n\n\n“George, honey,” his mother said, and wrapped him up in a hug so tight George could barely breathe. “You look so happy lately. He makes you happy, and that’s enough for me.”\n\n\nGeorge’s eyes suddenly felt wet, and he blinked away tears. He loved his mother to death, and even though her new job had been busy and demanding recently, he always cared about what she had to say. Even though it didn’t particularly matter whether she liked Dream, at least not to George, it was still wonderful to hear.\n\n\n“Alright,” she said, and smoothed down George’s “artfully messy” hair. “Go get some sleep, kid.”\n\n\n“I’m not a kid,” George grumbled, as he turned away towards his room. “I’m an adult.” \n\n\n“I’ll believe you next year,” she called affectionately. \n\n\nGeorge brushed his teeth, changed into a comfortable pair of pajamas, and flicked the lights off. He clambered into bed and then checked his phone. Dream was online, and George sent him a quick text.\n\n\ngeorgenotfound: im gonna go to sleep soon\n\n\ndreamwastaken: well i am going to stay up\n\n\nGeorge smiled foolishly and typed out a response. \n\n\ngeorgenotfound: we have finals in like 2 days you need your beauty rest\n\n\ndreamwastaken: what if i told you i’m studying\n\n\ngeorgenotfound: … i might actually believe you\n\n\ngeorgenotfound: but u should go to sleep, i’m sleeping too \n\n\ndreamwastaken: i will \n\n\ndreamwastaken: goodnight!! &lt;3\n\n\ngeorgenotfound: &lt;33\n\n\nGeorge shut his phone off and stared at the ceiling in the darkness. Soft nighttime light filtered through the curtains on his window. He couldn’t quite place a name to the light, hopeful feeling inside of him, but he liked it. He wanted to keep the memory of this night close to him, clutched to his heart. \n\n\n-\n\n\nGeorge marched out of his final class, fairly certain that he had scored above an eighty percent on his Spanish exam, and thrilled that the first semester of his junior year was over. The hallways were filled with students who had all completed their last final, and everyone was raucous and enthusiastic about the start of winter break. George went to his locker and thankfully, dumped all of his textbooks in there— he wouldn’t need any of them until January. For now, he had three weeks to do absolutely nothing except relax. \n\n\nGeorge found Dream waiting outside of his sixth period class. \n\n\n“Finished?” he called, and Dream turned. Every time he saw George, Dream always gave him this little smile— probably unnoticeable to anyone else, but George relished the look of it. \n\n\n“Finally done,” Dream said, relieved. “I probably screwed up my essay, but at least it’s over. How was your Spanish final?”\n\n\n“I forgot so much vocabulary,” George groaned. “I’m sure I got at least a B, though. I guess we’ll find out.” \n\n\n“So,” Dream said conversationally, “Any plans for winter break?”\n\n\nGeorge pretended to think. “I’m not sure. Maybe hanging out with my boyfriend and playing Minecraft all day.” \n\n\nDream huffed a small laugh, and grabbed George’s hand. “Come on then, let’s get going.”\n\n\nThe lunch table by the courtyard was nearly filled; everyone was there except for Dream and George. Sapnap was saying something wildly, gesturing with his hands, and George caught snatches of his words as he arrived at the table. \n\n\n“Spring semester is where I shine,” Sapnap was saying, rubbing his hands together. “You thought I was bad now? Oh, I can’t wait for my senior prank.”\n\n\n“You’re a junior,” Ponk said dryly. \n\n\nSapnap grinned roguishly. “I know.”\n\n\n“Please don’t get suspended,” Bad said anxiously. \n\n\n“Nah,” Sapnap said confidently. “I’m too good for that. Remember that time I stole the entire school supply of—”  \n\n\nGeorge stopped listening to their conversation so he could have plausible deniability, and instead turned to Dream. “Are we doing anything tonight?”\n\n\n“I think everyone wants to have a movie night,” Dream said vaguely. \n\n\n“At Ponk’s house,” Alyssa jumped in. “We’re celebrating the end of the semester.”\n\n\n“Celebrating us failing all our finals?” George said dryly. \n\n\nAlyssa waved his comment off. “You two have to come, it’s mandatory.” \n\n\n“Only if we’re watching a good movie,” Dream said.\n\n\nAlyssa’s smile was positively devilish. “Of course we’ll be watching a good movie,” she said.\n\n\n“Why do I not believe that,” George sighed.\n\n\n“We’ll be watching all the sappiest rom-coms,” Alyssa continued.  \n\n\n“Hmm,” George mused, and turned to Dream, “Maybe we have something else to do, don’t we?”\n\n\nDream pretended to ponder with him. “Yeah, didn’t we have plans?”\n\n\nAlyssa laughed, and shook her head fondly. “You guys are such idiots. We’ll watch a good movie, and we’ll count your vote as one.” \n\n\n“Not fair,” Dream said, “We deserve separate votes.” \n\n\nAlyssa scoffed. “When you end up voting separately, we’ll consider it.” \n\n\nLater that night, George and Dream arrived at Ponk’s house together. They claimed one of the beanbag chairs in the corner and curled up together; George ended up resting his head on Dream’s chest, while one of Dream’s hands threaded gently through his hair. The other one of his hands was holding onto George’s, right over his stomach. Bad mimed taking a picture of them and George turned away, holding a hand out and hiding his face in mock embarrassment. \n\n\n“We’re watching High School Musical,” Skeppy announced, “And no one’s allowed to argue.” \n\n\n“No one was planning on arguing anyway,” Ponk said. Alyssa sat up excitedly and rubbed her hands together; apparently, this was one of her favorite movies. Skeppy inserted the DVD and reached for the remote to press play. \n\n\nGeorge looked around and took in everyone’s faces, bright and shiny and happy. Alyssa was singing along dramatically to the music onscreen, knowing the lyrics perfectly and acting along, while Sapnap laughed hysterically at her from the corner. Ponk was sitting on one end of the sofa, a bowl of popcorn in between his legs, and Skeppy was methodically throwing M&amp;Ms into the air and trying to catch them in his mouth. At one point, he gave up and started tossing them towards Bad, who was somehow even worse at catching them. Dream chuckled quietly at them, and George laughed too. It was such a wonderful night.\n\n\nHe had Dream, and he had Clay, who had ended up being one and the same. He had Sapnap and Bad and Ponk and Alyssa and Skeppy, some of the best friends he’d had in his entire life. He had one winter break ahead of him, to be shared with his friends. He had an entire spring semester, and one prom. He had so much to look forward to, and so much behind him.\n\n\nYeah, George thought privately. It was going to be a good year.\n\n \n "
}