{
    "id": "2592557",
    "url": "https://archiveofourown.org/works/2592557?view_full_work=true",
    "author": [
        "UmbrellaMartialGod"
    ],
    "title": "Press '1' to Get a Call From Your Drunk Best Friend",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Haikyuu!!"
    ],
    "relationships": [
        "Iwaizumi Hajime/Oikawa Tooru"
    ],
    "characters": [
        "Iwaizumi Hajime",
        "Oikawa Tooru"
    ],
    "additional_tags": [
        "there's like one original character but don't worry about it",
        "Underage Drinking"
    ],
    "language": "English",
    "series": "",
    "published": "2014-11-09",
    "completed": null,
    "words": "5,400",
    "chapters": "1/1",
    "comments": "188",
    "kudos": "18,716",
    "bookmarks": "2,855",
    "hits": "143,188",
    "summary": "<p>Press '2' to hear him talk about you for thirty minutes, press '3' for him to compliment your ass, and press '4' for more options.</p>",
    "notes": "<p>I wrote this instead of working on an essay that is due tomorrow because I don't have my priorities straight lmaooo. But yeah, it's based on a conversation I had with Dacas and I was like okay I'm so doing this so I guess this is for you Dacas. B)</p>\n<p>I hope you guys like it!</p>",
    "text": "Iwaizumi never called first.\nOikawa could hardly get the grumpy vice captain to text back, let alone call him. Getting a call from Iwaizumi Hajime was an extremely unlikely, essentially unthinkable event that rivaled Oikawa’s chances of seeing a UFO (which Oikawa still secretly hopes will happen one day). It was something that Oikawa could only dream about and, even then, the Iwaizumi in his dream would have probably dialed the wrong number anyway. Basically, it was near impossible—fantastical even.\nSo when Oikawa was awoken by the sound of the annoying ringtone (that he had specifically picked out because Iwaizumi hated it) at 2AM to see his best friend’s name flashing on his phone screen, Oikawa couldn’t help but wonder if he was hallucinating. His heart even skipped a beat like a schoolgirl with a crush (which, honestly, isn’t that far off of a description) as he stared at Iwaizumi’s name, complete with a candid photo of Seijou’s ace. After the fourth ring, Oikawa lifted his phone tentatively from its place next to his pillow and cleared his throat before answering.\n“Iwa-chan,” Oikawa began, still a bit drowsy, “I know you plan to live with a plain face forever, but some of us need our beauty sleep,” he teased.\nThere was no response from Iwaizumi’s side for a while and after his state of sleepiness had faded away, Oikawa could recognize the sound of people and raucous music in the background. He heard cheering in the background and glass shattering before he heard a familiar cough at the receiver. Oikawa suddenly found himself torn between being sort of weirded out that Iwaizumi was at an actual party and being offended that he didn’t invite Oikawa.\n“Iwa-chan?” Oikawa said, lifting himself on his elbows and gathering his pillow to rest his chin. “If you’re not there I’m gonna hang—”\n“Hello?” the familiar tone of Iwaizumi’s voice came through the phone. “Who’s…? Whaddya want from me?” Iwaizumi asked, his words slurred together in a mess of a sentence that Oikawa could hardly make out.\n“Iwaizumi Hajime,” Oikawa said slowly, a smile stretching on his lips, “are you drunk?”\n“Who me? Hell no… I’m sober super… Super sober…” Iwaizumi trailed off before letting out a loud burp that made Oikawa wrinkle his nose instinctively. Iwaizumi let out a small chuckle that makes Oikawa’s heart throb. “Okay, maybe I’m kinda bzzt… buzzed… like a bee or something.”\n“L-like a bee?” Oikawa managed to repeat, trying to stifle his laughter unsuccessfully.\n“Yeah, like a—hey, who d’ya think your laughing at?” Iwaizumi growled through the phone. “Who the fuck are you anyway? Why’re you callin’ me? Do you know what fuckin’ time it is? It’s… it’s time for me to get another beer—that’s what time it is.”\nOikawa rolled onto his back, his hand over his mouth as he laughed—there was no way he was going to let Iwaizumi live this one down. He only wished he was actually there to experience the miraculously inebriated Iwa-chan in person. And, goodness, Iwaizumi chuckled. It was adorable—Iwaizumi was going to kill Oikawa as soon as the setter so much as mentions this tomorrow, but it was adorable and definitely 100% worth it.\nThere was a rustling on the other end as Oikawa heard Iwaizumi turn from the phone. “Hey, Megumi! Get me ‘nother!”\nOikawa frowned. Oh, Megumi—the Iwaizumi cousin he didn’t like. He supposed he could understand why Iwaizumi didn’t tell him about, the party now, but he still couldn’t help but feel a bit miffed that he wasn’t at least offered an invitation.\n“Well, you called me first,” Oikawa said as he heard the sound of a bottle cap pop from Iwaizumi’s end and a sloshing noise as Iwaizumi took a long swig of beer. Oikawa never really understood how Iwaizumi could do that—he had always thought beer itself was kind of gross. At the end of it, Iwaizumi let out another loud belch. “Goodness, no wonder you’re still single.”\n“Piss off,” Iwaizumi said into the phone with no actual malice. “My singleness isn’t your business… whoever you are.”\nOikawa blinked in confusion. “’Whoever you—‘ Iwa-chan, do you know who I—“\n“Actually,” Iwaizumi interrupted him, his speaking beginning to turn into slurred mumbling, “since you’re already here, I’ve got—I’ve… I need some advice.”\nFor a moment, Oikawa wondered if he should tell Iwaizumi who he was before the poor boy humiliated himself further. However, as he clutched a pillow against his chest with a wide grin on his face, he decided going along with it was way funnier. “Alright, Hajime-kun,” Oikawa replied in a sing-song voice. “What wise knowledge should I bestow upon you on this drunken night?”\n“Alright, so…” Iwaizumi began, “there’s this… this person…”\nOikawa felt the smile tugging at his lips disappear in less than a second and a pang in his chest. “A person?” Oikawa repeated, forcing himself to sound as cheery as he did before.\n“Yeah, and they’re—they’re like…” Iwaizumi trails off for a second and Oikawa can hear him sighing into the phone. There’s a pause before Iwaizumi continued. “They’re turning me into a fuckin’ mess, dude.”\n“Wow, she must be pretty special if you’re swooning,” Oikawa said with a laugh that he can hardly manage. He rolled onto his side and brought his knees closer to him.\nIwaizumi scoffed over the phone. “’She’? Nah, I’m talking about more of a ‘he.’”\nOikawa’s eyes widened and he sat up, his phone pressed firmly to his ear. “’He’?” Oikawa parroted back. He hadn’t even known Iwaizumi was into boys. Faces popped into Oikawa’s mind as he tried to think of every boy he had ever seen Iwaizumi interact with, only to reject them as possible candidates to Iwaizumi’s affections. Sure, Iwaizumi didn’t tell him everything, but Oikawa wasn’t dense enough to miss anyone who could possibly turn Iwaizumi into a swooning mess. “Is he on the Seijou volleyball team?” Oikawa asked.\n“Yeah, and he’s like so good, lemme just tell ya,” Iwaizumi replied, stopping to take another sip of his beer.\nOikawa pouted, bring his knees up to his chest. Well that gave him absolutely nothing—everyone in Aoba Jousai was good at volleyball, he knew that personally. “Tell me more,” Oikawa urged, his curiosity getting the best of him.\n“Well, first of all, let’s get something clear,” Iwaizumi began, his voice sounding gravely serious, “because like this is—this is very important, got it?” Oikawa found himself nodding in the dark at no one. Iwaizumi sighed again, more out of exhaustion this time than fondness. “He is the biggest pain in the ass I have ever had the misfortune of dealing with.”\n“Oh,” Oikawa answered simply, a bit confused at first before realization hit him like a ton of bricks. The setter’s mouth fell open and his eyes grew wide. “Oh,” he said again, mostly to himself. A grin spreads on the setter’s face, stretching from ear to ear as his heart seemed to soar.\nYou see, Oikawa Tooru may not be a genius, but he certainly wasn’t that dense.\n“Is that so, Hajime-kun?” Oikawa purred into the phone.\n“Yeah, like h-holy shit, I’ve had to pull this guy’s ass out of trouble at least ten—ten thousand times. Probably,” Iwaizumi said with a groan. “He keeps overworking himself all the fucking time—you know? And he doesn’t even believe how good he is and it makes me just—I just want him to know how good he is, you know? Like, he’s the best player I know, holy shit, he’s amazing.”\n“You really think so?” Oikawa asked.\n“Yeah, he is. He really, really is,” Iwaizumi insisted. He takes another deep breath and there’s a pause. “But I feel so fuckin’ bad every time he hurts himself or something you know? Or you know when he feels like he’s inade-inade—“ Iwaizumi stumbled over his words, “when he doesn’t feel like he’s enough—and I kind of just wanna tell him he’s more than enough—like, he’s perfect.”\nOikawa bit his lip, and his heart pounded in his chest. He could feel himself tearing up just the slightest bit, and for now he was going to chalk it up to the fact that it was really early in the morning, but Iwaizumi’s words made Oikawa feel warm.\n“The fucking asshole—he probably doesn’t even know how much I worry about him all the time. God, it’s so embarrassing,” Iwaizumi continued with another exasperated sigh.\n“I’m sure he does,” Oikawa said, his voice soft and fond.\n“And holy shit you know what, he’s so fucking pretty?” Iwaizumi said in a way that was more of a question than a statement. “Oh man, he’s so pretty, it’s probably illegal. No one should be born that fuckin’ gorgeous, alright—it’s unfair.”\nOikawa pressed a hand to his mouth as the setter laughed. “Is he really?” Oikawa hummed. “Tell me, Hajime-kun, how gorgeous is he?”\nIwaizumi let out a laugh and whistled. “Oh boy, where do I even begin with this guy,” he said. “Like, he’s got the nicest fucking hair I’ve ever seen on a person. It is so brown and so soft-looking and he makes me want to run my hands through it. It’s so nice. Y’know you’d think he styles it or something with, like, curlers or some weird shit, but no—it’s fucking natural. I’ve hung out with this kid for my whole fucking life and his hair only gets nicer with age. What the fuck is with that?\nAnd his eyes… Don’t even get me fucking started on his eyes. They’re this really… really nice shade of brown and I could look at them all day, y’know? And when he is proud of himself or he’s really happy they just like, light up like a fucking Christmas tree and they’re so big and it’s kind of cute, honestly. But he’s always talkin’ about getting color contacts or something ‘cause he doesn’t like them or something, but they’re soooo pretty.”\nOikawa buried his face in his knees, not really sure if he could take anymore of this. Part of him wanted to just listen to Iwaizumi compliment him forever and the other part of him was attempting to resist the urge to throw open the window and cheer without any regard to the fact that he’d probably wake the neighborhood because Iwaizumi Hajime had just said, with no hint of irony whatsoever, that he was pretty.\n“Oh yeah,” Iwaizumi continued. “Plus he’s got the nicest ass I have ever seen on a guy.”\nThat one just made Oikawa laugh, his face red and his smile wide as ever. “Oh my,” Oikawa managed to say through his chuckling fit.\n“Yeah, let me tell you, standing behind him in his volleyball shorts is like Christmas, okay—his ass is that nice,” Iwaizumi said before sighing again. “It’s so nice.”\n“Goodness, Iwa-chan, I didn’t know you could be so daring,” Oikawa teased, not even caring to change up his signature nickname for Iwaizumi this time.\n“Oh, aaand,” Iwaizumi began again, his voice growing a bit softer, “and he’s got these really nice lips. They always look so soft and he’s always putting on chapstick or something and I dunno, I think he catches me staring at them sometimes and it’s embarrassing as shit, but they’re so… They’re really...” Iwaizumi trailed off and Oikawa found himself holding his breath, clinging to Iwaizumi’s words and a sigh that sounded almost too sad for him to bear. It’s familiar, not just because Oikawa knew Iwaizumi so well, but because the setter himself had let that same sigh fall from his lips one too many times in the past.\n“I want to kiss him,” Iwaizumi said so softly that Oikawa almost didn’t catch it. “I really want to kiss him just once in my life, then I’ll be okay. Oh man, how do you tell your best friend that you want to kiss him?”\nOikawa’s heart throbbed and his smile softened. “Well, Iwa-chan, I don’t know,” he hummed. “Maybe you should just tell him how you feel?”\n“Hell no,” Iwaizumi answered so quickly. “Hell fucking no—he’d laugh so fucking hard it’d be humiliating.”\nOikawa frowned at this, kind of miffed that Iwaizumi would think that Oikawa would so easily make fun of him like that. Okay, well maybe he would laugh just a little, but it wouldn’t be that bad.\n“Well, then maybe you should start by being nice to him,” Oikawa said with a slight pout on his lips. “He’ll probably like you more if you’re nice to him.”\nThere’s a scoff at the other end of the line, but Iwaizumi doesn’t really object to the notion. “You think so?” he said instead.\n“Mhmm,” Oikawa hummed. “And you know what, while you’re at it, you should take him to that restaurant he’s always talking about—the expensive one in town with the lobster.”\n“Yeah,” Iwaizumi said. “Yeah, maybe.”\n“Oh, or you could take him to see that movie about the aliens that you said was stupid because you wanted to watch Godzilla,” Oikawa continued, playfully. “He’d like that for sure.”\n“You know what,” Iwaizumi replied, “yeah—I think I’ll do that.”\n“Good,” Oikawa said with a satisfied grin.\n“Yeah, thanks man, you’re a great listener,” Iwaizumi said, his words became clearer as he began to sober up. “Thanks a lot.”\n“No problem,” Oikawa sung into the phone.\n“Who is this anyway?” Iwaizumi finally asked.\nOikawa’s proud grin grew mischievous as he crossed his legs under his blanket. “Oikawa Tooru,” he replied, making sure his voice was clear and simple.\nThere is a long pause and Oikawa can practically hear the gears moving in Iwaizumi’s head as the pieces finally began to connect.\n“Shit,” Iwaizumi finally said. There was a click and suddenly the sounds of the party and the music disappeared and Oikawa was just met with a dead phone tone. Oikawa dissolved in laughter, dropping his phone on the bed as he falls back on his bed, totally elated. You know, this was a really good night for him—Iwaizumi should call first more often.\nHowever, after laughing himself breathless, Oikawa found himself staring blankly at his ceiling, still enveloped in darkness. Iwaizumi’s words playing in his mind over and over like a record. His chest felt tight and his mind raced, wondering how he was going to confront Iwaizumi about it tomorrow. Should he just play it cool and drop hints? Should he kiss him? Should he suggest that they make it official? Would Iwaizumi even remember, after all he was drunk enough not to know he was calling Oikawa the entire time.\nAfter a while, Oikawa began to realize that he was very much awake.\nHe sat back up, checking his phone again to see that it was now 3AM. He wondered if Iwaizumi had gone home yet—knowing his cousin, she’d probably just leave Iwaizumi to pass out on the couch and wake up in the morning hung-over and in pain.\nMaybe he should pick him up.\nOikawa threw the blankets off of himself and grabbed his Aoba Jousai jacket off of his chair. He crept down the stairs quietly, careful not to wake his parents, and grabbing his car keys from the kitchen counter as he walked out the door.\nThe drive from Oikawa’s house to Iwaizumi’s cousin’s was a short one. It was just a few neighborhoods down, actually, and Oikawa knew the road like the back of his hand from spending so much time with Iwaizumi as a child and, by extension, Iwaizumi’s annoying cousin. Oikawa didn’t think much of her other than the fact that she was generally irresponsible and selfish and sometimes reminded Oikawa of what he might be, and that didn’t sit well with him.\nSure enough, when Oikawa pulled into the neighborhood, he could still hear music blaring even this late at night and the road was littered with cars. Oikawa was lucky enough to find a spot relatively close to the house. As Oikawa shuffled towards the door, he noticed that there are drunk college students all over the place, littered on the lawn and whooping for no reason. It was a wonder how no one had called the cops yet, but Oikawa pushed the thought out of his head—he’d hate for Iwaizumi to actually be involved in this mess.\nHe reached out to ring the bell, but the door swung open before he so much as touched it and he jumped back at the sight of a girl leaning against the door, a bottle of vodka in one hand. She was laughing drunkenly and her dark hair swished back and forth as she tried to stand up straight. Her face was furiously flushed and, when she looked up at Oikawa, it took her a moment before she recognized him.\n“Oh my gosh, is this little Tooru?” she said, giggling. “I haven’t seen you in, like, centuries or whatever.”\nOikawa forced a smile and gave her a wave. “Hi, Megumi, I’m just here to pick up Iwa-chan.”\n“You mean, me ‘Iwa-chan’ or Hajime ‘Iwa-chan’?” she teased and Oikawa winced at her obvious attempt at flirting with him. He wondered if it would be an appropriate time to mention that he was much more interested in several ways in her younger cousin right now, but decided against it for the sake of timeliness.\n“I definitely mean Hajime,” Oikawa insisted, looking behind her to try to see if he could find him.\n“Yeah, I figured, Hajime’s been talkin’ about you all night, y’know?” Megumi said with a laugh. She shot him a mischievous glance. “You guys aren’t like, datin’ or somethin’, are ya?”\n“Who knows,” Oikawa answered, squeezing past her quickly, “Pardon the intrusion.”\nOikawa power walks through the house, stepping over passed out party goers and cups scattered on the floor. He is lucky enough to spot Iwaizumi quickly enough on the couch, cans of beer at his feet and his face flushed as he downed another one. He doesn’t even notice Oikawa until the setter is right in front of him.\nIwaizumi looked up at him slowly and gives him the sternest glare that Oikawa had ever seen on his face (which was really saying something). “If you’re here to laugh at me, I’ll punch you in the nose,” Iwaizumi said with no real intent of action behind his words as usual.\nOikawa offers him a hand. “C’mon, Iwa-chan, I’m taking you home.”\n“I don’t wanna go home with you, asshole,” Iwaizumi said stubbornly.\n“Too bad, let’s go,” Oikawa reached out for Iwaizumi’s arm and, despite his deep frown, Iwaizumi ends up taking his hand anyway. He’s unsteady on his feet and almost immediately falls over as he stands, so Oikawa puts his hand around Iwaizumi’s waist to keep him steady and lets the ace put his arm around his shoulder.\nThe walk out of the house and to the car was eerily silent. Iwaizumi didn’t even look at Oikawa and his fists were clenched into tight fists. Oikawa immediately felt guilty for messing with Iwaizumi on the phone, but he figured it probably wasn’t that mean, right? He was at least thankful that the car ride back to Iwaizumi’s place was relatively short. As he pulled into the driveway, he turned to Iwaizumi, who was leaning back in his seat, massaging his forehead, feeling thankful that he doesn’t look like he was going to throw up in Oikawa’s car anytime soon.\n“Do you have your keys?” Oikawa asked.\nIwaizumi groaned as he moved to reach into his pockets. After a few feeble attempts at feeling around for them, Iwaizumi slumped back in his seat. “Fuck, I left it at Megumi’s,” he said.\nOikawa gave a thoughtful hum, drumming his fingers against the steering wheel. “Are your parents home?” he finally asked after a while.\nIwaizumi laughed weakly. “Yeah, ‘cause I’d be drinking at Megumi’s place if my parents were in town.”\n“Alright, Mr. Sarcastic, hold on,” Oikawa said, exiting his car and walking over to the passenger side to help Iwaizumi. Although his feet were now a bit firmer on the ground, Oikawa could still feel Iwaizumi’s unsteadiness leaning into him as they walked around the house to the backdoor, which Oikawa knows just how to jostle to get it open after years of sneaking into Iwaizumi’s house in the dead of the night. Sure enough, after a few shakes, Oikawa managed to get it open with one hand. “Wow, Iwa-chan, you should really get that fixed—we wouldn’t want someone to break into your house or something,” Oikawa quipped, shooting Iwaizumi a smile, poking the other boy’s side with the hand that was on his waist.\nIwaizumi didn’t look back at him and just gave him a simple “hm” in reply and Oikawa pouted. He closed the back door before hauling Iwaizumi up the stairs to the bedroom, not bothering to turn on the lights to navigate a hallway he knew like the back of his hand. When they got to Iwaizumi’s room, Oikawa finally felt the need to speak up again.\n“Iwa-chan,” the setter began as he set Iwaizumi down on his bed, taking a seat next to him. He leaned forward to rest his elbows on his knees and his head in his hands as he peaked at Iwaizumi, who was looking away from him. “Iwa-chan, are you mad at me?”\nIwaizumi fell onto his side, grabbing a pillow and covering his face with it. “Fuck off, Asskawa,” came his muffled reply.\n“Aw, Iwa-chan,” Oikawa whined, leaning over where Iwaizumi’s face is supposed to be. “I’m sorry I pretended not to be me,” he said with a pout, poking the pillow persistently, “but you were just so cute—“\n“I told you to fuck off,” Iwaizumi said, swatting Oikawa’s hand away.\n“Iwa-chan, don’t be mad at me, pleeease,” Oikawa pleaded. He positioned himself to lay down next to Iwaizumi, leaning in close. “Will you forgive me if I let you kiss me?”\nOikawa is met with a face full of pillow that makes him splutter and the bed shifts next to him. Suddenly, the mattress sank around his head. When he lifted the pillow off of his face, he looked up to see Iwaizumi’s face hovering over him. The flush in his cheeks from the alcohol spread all over his face and ears Oikawa could even discern it in the tanned skin of Iwaizumi’s arms next to him. Iwaizumi’s eyebrows were furrowed and his mouth was open, as if he was trying to look for the right words to say. He could smell the alcohol in Iwaizumi’s breath and the heat radiating from his skin.\n“What the hell is wrong with you?’ Iwaizumi finally said after a while, his voice cracking the slightest bit.\n“Well, according to you I’m ‘a pain in the ass’,” Oikawa replied with a shrug.\n“Stop joking around—you know what I mean.”\n“’Fraid not, Iwa-chan—you’re going to have to be a bit more—“\n“Why the hell would you mess with me like that,” Iwaizumi interrupted him. “Holy shit, do you know how long I’ve been keeping all of that in? Shit, you were never supposed to know any of that—“\n“Iwa-chan,” Oikawa said softly, guilt beginning to gnaw at him.\n“—And I know you seem to lack human decency sometimes,” Iwaizumi continued bitterly, “but you don’t fucking make fun of someone after they just spilled all of their embarrassing fucking feelings for you all over the goddamn place—“\n“Iwa-chan,” Oikawa repeated, a little more clearly this time.\n“—You are such a fucking asshole, I fucking hate you, but I don’t actually hate you and that makes me really hate you—“\n“Iwa-chan!”\n“What?” Iwaizumi finally answered.\nOikawa reached up to curl his fingers into Iwaizumi’s shirt and pulls him closer. Their lips smashed together sloppily and their teeth clink against each other. Oikawa realized that their first kiss probably could have gone better—maybe less nose smashing and less of that beer taste that lingered in Iwaizumi’s mouth, but as they pulled apart and Oikawa saw Iwaizumi looking more confused than frustrated and his forehead pressed against Oikawa’s, he also figured that this was probably fine as well.\nThere’s a moment of silence and Oikawa crossed his fingers, hoping that he got the message across, before Iwaizumi sneered at him.\n“What the fuck,” he said, his voice raspy. “Why the hell would you do that? You’re an asshole.”\n“Oh my god, Iwa-chan,” Oikawa closed his eyes and sighed in exasperation, his fingers still curled in Iwaizumi’s shirt. “You’re so dense, I can’t believe this.”\n“I don’t—“\n“Hajime,” Oikawa lowered his voice and his eyes fluttered open to meet Iwaizumi’s gaze. His heart hammered in his chest and he bit his lip. His throat felt dry and his voice is almost lost, but Oikawa went on anyway, determined to get this into Iwaizumi’s thick skull once and for all.\n“I love you.”\nIwaizumi woke up to the biggest headache he had ever felt in his life and a light to bright creeping through the open doorway of his bedroom. He groaned and rolled over onto his side to see that his blanket had been disturbed as if someone had just woken up and gotten out of them. Iwaizumi stared at them blankly for a moment, not really registering his situation, until the events of last night hit him like a brick.\nIwaizumi felt his face burn as he remembered bits and pieces that fit together like some horrible puzzle that he never wanted to finish. The phone call, copious amounts of alcohol, and Oikawa Tooru—that was the worst fucking combination he had ever thought about in his life.\n\n“Hajime, I love you.”\n\nThat was the last piece that he remembered before he had woken up and he instantly wanted to curl up and burn rather than face whatever the hell had happened last night. How was he going to talk to Oikawa? Where was the bastard anyway? How far did they go because, as much as Iwaizumi had fantasized about banging his best friend, he’d rather remember it, thank you very much.\nIwaizumi heard footsteps from down the hall and he threw the blanket over his head as they stopped in the doorway.\n“Morning, Iwa-chan,” Oikawa’s voice, bright and cheery, rung through the room much too loudly for Iwaizumi’s hung-over liking. “I thought you might be awake, so I brought you some water and aspirin for that meanie hangover you’ve got there.”\n“Oh my god, if you’re going to run your mouth, please at least do it quietly,” Iwaizumi said, peeking out of his blanket just a bit to glare at Oikawa, who approached him with the aforementioned hangover chasers.\n“So grumpy, Iwa-chan,” Oikawa pouted as he leaned over the side of Iwaizumi’s bed, holding out the glass of water and painkillers for him. “Here, Iwa-chan, you’ll feel better if you take this.”\nIwaizumi grumbled as he forced himself to sit up, but he took the water and aspirin with a small thanks. Right after he drank his water, Oikawa leaned over to brush his lips gently against Iwaizumi’s forehead. Iwaizumi felt his face heat up immediately as Oikawa laughed at his expression, sitting on the floor and resting his head on the edge of Iwaizumi’s bed.\n“The aspirin’s working already, Iwa-chan—you were so pale before and now you’re red as a tomato,” Oikawa teased.\n“Shut up,” Iwaizumi said, chugging the rest of his water, feeling instant relief at the coolness in his throat.\nThey sit in silence as the two both tried to think of what to say—or maybe it was just Iwaizumi trying to think of what to say and Oikawa was just looking up at him expectantly. He’s not really sure because Iwaizumi avoided Oikawa’s eyes for a second as billions of questions ran through his mind.\nHowever, after what seemed like forever, Iwaizumi finally cleared his throat. “So,” he began. “What, er—what happened last night?”\nOikawa’s lips curled into a frown as he looked up at Iwaizumi. “You don’t remember?” he asked.\nIwaizumi ran a hand through his hair and let it rest at the back of his neck. “I remember bits and pieces.”\nOikawa hummed thoughtfully. “Do you remember the phone call?”\nIwaizumi felt humiliation wash over him like a wave and he buried his face in his hands. “Ugh, yeah, I remember that.”\n“Do you remember me picking you up?”\n“Yeah.”\n“Do you remember yelling at me?”\n“A little.”\nThere was a pause and Iwaizumi almost didn’t hear Oikawa when he spoke. “Do you remember me telling you that I love you?” Oikawa asked.\nIwaizumi peeked through his fingers to see Oikawa leaning his head on his arms, tilting it slightly to the side in a way that was too cute for it to be legal. “Y-yeah,” Iwaizumi mumbled. Oikawa’s face lit up at Iwaizumi’s reply. “I don’t remember anything after that, though.”\n“Oh, well, that’s understandable,” Oikawa said, “because you passed out right after my confession.”\n“What?”\n“Yeah,” Oikawa put a hand over his heart dramatically. “You must really like me a lot. Iwa-chan, to swoon as soon as I said the l-word.”\n“Shut up, alright? I was drunk.”\n“Iwa-chan, be honest with yourself,” Oikawa said, poking Iwaizumi’s leg with his finger. “You just love me that much.”\n“Oh my god, please stop.”\n“I’m just updating you on the events of last night like you asked, Iwa-chan,” Oikawa said innocently. “You even proposed to me, you know.”\n“Okay, I know I didn’t do that, I wasn’t that drunk.”\n“Nope, you definitely proposed to me,” Oikawa insisted with a laugh. “It was so romantic—you got down on one knee and everything.”\n“Nope, no I didn’t,” Iwaizumi said, swatting Oikawa’s hand away. “Why the hell would I do that?”\nOikawa’s eyes glinted with something mischievous and Iwaizumi immediately felt regret for asking as Oikawa opened his mouth to reply.\n“Because,” he began with a sly smile, “you think I’m pretty.”\n“Oh my god.”\n“And because you think my hair is really soft and you like my eyes,” Oikawa continued.\n“Please stop.”\n“And goodness, Iwa-chan, the things you said about my ass,” Oikawa smirked, but fanned himself mockingly. “How forward of you.”\n“We aren’t doing this right now.”\n“Oh oh, and do you know what you said about my lips?” Oikawa persisted, moving up so that he was now sitting next to Iwaizumi on his bed.\n“Did I say they looked better closed and on the other side of the room,” Iwaizumi quipped. Oikawa pouted and gave him a light jab in the side.\n“No,” Oikawa said. “You said you wanted to kiss me at least once in your life.”\nIwaizumi couldn’t even find anything to counter that so he just looked away, his cheeks burning. “Well, I wasn’t lying,” he muttered.\nOikawa’s hands found their way to Iwaizumi’s cheek and he pulled Iwaizumi’s face up to meet his. Iwaizumi gulped as he stared into Oikawa’s eyes, calculating and warm, and he found his throat running dry.\n“Just once, though?” Oikawa asked. “Wouldn’t you like to do it again?”\nIwaizumi swore his heart almost burst out of his chest at that moment. He couldn’t even find the words to reply and just nodded, melting as Oikawa gave him a look probably had the power to destroy. Oikawa presses his lips against Iwaizumi’s and it takes Iwaizumi a second before he kisses back, letting their lips glide together and—\n“Ouch,” Oikawa pulled back with an incredulous look on his face. “Iwa-chan did you just bite my tongue?”\n“S-sorry,” he stammered in his embarrassment.\n“Hm, yeah we’ve got to work on that,” Oikawa said, scratching his chin thoughtfully. He then smiled and cupped Iwaizumi’s face in his hands. Iwaizumi was rendered motionless as Oikawa pressed his lips to Iwaizumi’s forehead and then moved back down to press their foreheads together. He looked into Iwaizumi’s eyes with such genuineness and fondness that Iwaizumi began to wonder if he was dreaming, but Iwaizumi let a small smile curl on his lips as Oikawa gives him a quick peck.\n“Iwa-chan,” Oikawa said.\n“Hm?”\n“You should call me when you’re drunk more often.”\n“Please leave.”"
}