{
    "id": "26120500",
    "url": "https://archiveofourown.org/works/26120500?view_full_work=true",
    "author": [
        "Ideasofmarch"
    ],
    "title": "Relativity.",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "F/M",
        "M/M"
    ],
    "fandoms": [
        "Harry Potter - J. K. Rowling"
    ],
    "relationships": [
        "Harry Potter/Tom Riddle",
        "Orion Black/Walburga Black",
        "Abraxas Malfoy/Original Character(s)"
    ],
    "characters": [
        "Harry Potter",
        "Tom Riddle | Voldemort",
        "Tom Riddle",
        "Fleamont Potter",
        "Walburga Black",
        "Orion Black",
        "Cygnus Black",
        "Lucretia Black Prewett",
        "Abraxas Malfoy",
        "Pomona Sprout",
        "Albus Dumbledore",
        "various other hogwarts students",
        "Original Female Character(s)",
        "Original Male Character(s)"
    ],
    "additional_tags": [
        "Time Travel",
        "Alternate Universe - Canon Divergence",
        "Time Travel Fix-It",
        "But when i say fix it i mean fixing EVERYTHING",
        "Mysterious third party organisation",
        "Harry Potter is Bad at Feelings",
        "Harry is a Little Shit",
        "Harry is a peverell",
        "my boy is going back in time and fucking up the time line",
        "im so proud",
        "Harry Potter was Raised by Other(s)",
        "kind of",
        "is fifteen a little late to be raised",
        "idk - Freeform",
        "i gave him adoptive parents because i want harry to have nice things",
        "BAMF Harry Potter",
        "Morally Grey Harry Potter",
        "Kinda",
        "its not super showcased but you can kind of tell he's not as pure hearted as he once was",
        "seeing multiple people die before you even turn eighteen will do that to ya",
        "no beta we die like men",
        "Some Humor",
        "it's - Freeform",
        "Teen Romance",
        "Slytherin Harry Potter",
        "1940s",
        "Hogwarts Fifth Year",
        "The Noble and Most Ancient House of Black"
    ],
    "language": "English",
    "series": "",
    "published": "2020-08-26",
    "completed": null,
    "words": "18,178",
    "chapters": "1/1",
    "comments": "512",
    "kudos": "13,238",
    "bookmarks": "3,201",
    "hits": "97,699",
    "summary": "<p>\"We would like to give you a chance.”</p>\n<p>“A chance?”</p>\n<p>“That’s right.”</p>\n<p>“A chance at what?”</p>\n<p>“Why, at living, Mr Potter.”</p>\n<p>-</p>\n<p>When Harry Potter is approached by a mysterious third party organisation that offers him the chance of a lifetime, he finds himself flung five decades into the past with a new name, new parents, and one hell of a mission.</p>",
    "notes": "<p>Hi ya'll,</p>\n<p>So, this one took forever to bang out and i had to do like a helluva lotta magical homework for some of the school scenes. hope ya'll enjoy it!!</p>\n<p>Love,<br>IdeasOfMarch</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Annnd that's a wrap folks. </p>\n<p>So, how'd you like it? leave any questions down in the towel section and lmk if y'all would be interested in a epilogue of sorts.</p>",
    "text": "\nrelativity\n\n\n/rɛləˈtɪvɪti/\n\n\n\nnoun\n\n\n\n\nthe absence of standards of absolute and universal application.\n\n\n\n\n\n \n\nFate - the entity or the concept, Harry didn’t much care which - had been screwing him over for as long as he could remember. In fact, even longer than that - it was probably giving him grief even in the womb.\n\n\nHe was accustomed, by now, to bad fortune. Good things very rarely happened to him, and when they did, it was always preceded with something equally, if not more, terrible. He’d thought, rather naively, he’ll admit, that Cedric was as bad as it would get.\n\n\nWatching an innocent, a \n\ngood\n\n man that he’d actually started to really like, die in front of him. To watch him be killed for absolutely no reason at all. It had been hard - almost devastating. \n\n\nBut Harry had pulled through. He’d survived the Dursley’s, he’d survived Quirrell, and a basilisk, and Voldemort himself. He could survive this, if only to kill the deranged bastard who’d ended Cedric’s life.\n\n\nAnd then fifth year came and went - he’d been subjected to humiliation, a smear campaign, and mild torture - with his godfathers death as a morbid grand finale.\n\n\nHarry snorted to himself, and it was a harsh sound, not even a hint of a genuine laugh.\n\n\nHe didn’t laugh much these days.\n\n\nDead parents, a brain dead godmother and a \n\ndead\n\n dead godfather. He was cursed.\n\n\nSomeone ought to warn Remus away, lest it decide to spread to honorary uncles too.\n\n\nHe’d experienced all of that, and the worst part - truly - was the way he’d been shipped back off to his relatives when it was all over. He should have known, after fourth year, but he’d just \n\nexpected\n\n the people he almost died for to give a damn after he’d witnessed his godfather's death.\n\n\nInstead he’d been shunned, for lack of a better word. Out of sight, and clearly out of mind. Like a toy soldier who’d served his purpose, packed away until he could be used once more.\n\n\nMost of the time Harry just felt hollow. \n\n\nEverything - Petunia’s shrieks, Dudley's gibes, his grief and sorrow and fury, his \n\nlife\n\n - it just flowed through him like wind in tattered sails; enough to disturb him, but he was too damaged for it to have any great effect. Whenever it got too bad he’d come here, to the rackety old swing set in the park, gently swaying until his thoughts stopped slipping through his fingers.\n\n\nIt was effective. The firm metal under his finger and the continuous motion serving as a way to anchor him. He could almost pretend to be content.\n\n\nThen the air changed.\n\n\nHarry had his wand in his hand before he could take his next breath. He got to his feet slowly, carefully, making sure his base of support was stable and balanced. The swing set was built in an open clearing, no places to hide beside the line of tall shrubs; after checking behind him Harry allowed himself to slowly examine the shrubs.\n\n\nAll the while, the air pressure dropped, ever so slightly, and the wind picked up.\n\n\nThere.\n\n\nDirectly in front of him, the plants shimmered. No, it wasn’t the plants, but the shadows. Moving and twisting like they were somehow folding inwards despite being two dimensional. \n\n\nA man stepped out from behind the shadows.\n\n\nHarry raised his wand, aiming at the man's chest, “I \n\nwill\n\n curse you.”\n\n\n“Peace, Mr Potter.” The man raised his hands in a placing gesture, “I mean you no harm.”\n\n\nHarry didn’t move his wand, but his eyes tracked up and down the man’s body. He was clad in a grey suit, an inky black tie, and a matching hat. He stepped no closer to Harry.\n\n\n“I haven’t lived this long by trusting strangers.”\n\n\nThe man laughed, Harry’s eyes flicked up to his face and found himself utterly unable to rest his eyes on any of his features. His face slipped and shifted, one moment a proud roman nose and the next he sported one that made him look rather similar to Snape. His eyes cycled from blue to green to black to brown, even his jawline shifted.\n\n\n“Au contraire,” The Man's voice startled him, and Harry resolved to stare at his tie instead of his face, “I believe you’ve trusted many a stranger. A half giant, perhaps?”\n\n\nDamn, the man had him there.\n\n\n“Hagrid hasn’t tried to kill me, I have no reason to believe you wouldn’t.”\n\n\n“Not on purpose he hasn’t, but you must admit he has put you and yours in situations from which you might have lost your lives.”\n\n\nHarry almost growled, “Irrelevant.”\n\n\n“I suppose.”\n\n\n“Who are you and what do you want?”\n\n\n“I am an agent, Mr Potter. And i am here to deliver a message.”\n\n\n“An agent of Voldemort?” Harry doubted it - no pureblood would be caught dead in a muggle suit.\n\n\n“No,” The man said with a breezy laugh, “I represent a third party. And we would like to give you a chance.”\n\n\n“A chance?”\n\n\n“That’s right.”\n\n\n“A chance at \n\nwhat\n\n?”\n\n\n“Why, at \n\nliving\n\n, Mr Potter.”\n\n\nHarry looked around incredulously, “What the hell do you think i’m doing now?”\n\n\n“Come now, Mr Potter. This is not living. Your every action and choice has been controlled and manipulated since you were an infant. You cannot tell me it isn’t starting to grate.”\n\n\nHarry’s silence was answer enough.\n\n\nThe man hummed low in his throat, “What has been done to you is despicable, we want to help.”\n\n\n“Why?” It came out hoarse, “Why do you care?” \n\nno one else does\n\n.\n\n\n“This war has harmed more than just you, Mr Potter. Should events play out as they will... we fear that the magical world might be nearing its end. The culture, traditions, all of it - it’s disappearing day by day - moment by moment.”\n\n\n“How?” Harry asked, “\n\nwhy\n\n?” \n\n\n“The dark lord has brought death and destruction, Mr Potter. But it is the light lord that has doomed us all. Magic exists in balance. Light, grey, dark. In the last few decades the light has all but purged the dark, pushing the gray to the brink of extinction as well. But light magic cannot exist without the ambient energy that dark magic leaves behind.”\n\n\n“We’re running out of ambient energy.”\n\n\n“You were.” The man corrects, softly, “The dark lord’s return sparked an uptick in the energy, but with the dark lord comes -”\n\n\n“Death and destruction.” Harry finished.\n\n\n“Precisely.” \n\n\nHarry sighed, lowering his wand, “So, we’re screwed either way.”\n\n\n“Not exactly,” The man stepped forward slowly, brandishing a globe no larger than a golf ball from his suit jacket, “It’s far too late to stop the crusade against dark magic. Too much prejudice and too many bad memories. We acted too late to save this future, but there is still hope.”\n\n\n“How?” \n\n\nHe held out the globe, which pulsated softly with a pale white light, “We can send you back five decades, give or take a few years. An identity, an entire life, is ready for you.”\n\n\n“And how would that save the world?” Harry asked.\n\n\n“You do not have to save the world, Mr Potter. Simply, Tom Riddle.”\n\n\n“\n\nWhat\n\n?!”\n\n\n“He is, was, and will be, an extraordinary wizard. As are you. You do not have to save him, I suppose. You could just as well kill him before he starts his war. But remember, Mr Potter, he is not what destroys the wizarding world.”\n\n\n“Dumbledore is.”\n\n\nThe man bowed his head in acknowledgement, “Indeed. Tom Riddle was a visionary, once. You have the chance to make sure he stays that way. It would be the best way to achieve your goal - that kind of charisma is hard to replicate, though I’m sure you could do just as well.”\n\n\nHarry sighed, “Suppose I go. How, exactly, did you set up a \n\nlife\n\n for me?”\n\n\n“We simply sent a couple of agents back ahead of you.”\n\n\n“And they couldn’t complete this mission because?”\n\n\nThe man smiled, Harry couldn’t exactly see it, but he knew all the same, “Some things, Mr Potter, we must find out ourselves, rather than be told.”\n\n\n“Of course.”\n\n\nThe man dutifully ignored his eye roll, “I assume you accept the offer?”\n\n\n“Sure.” Harry said after a moment of deliberation, “It’s not like I have much left to lose anyway.” \n\n\n“That’s the spirit.” The man said, before tossing the globe in the air and stepping back into the shadows.\n\n\nHarry darted forward and grabbed the sphere out of the air, his seeker reflexes taking over.\n\n\nThe light brightened once, twice - and then it began to spread, leaking into his fingers and flowing up his arms following the line of his veins. Harry closed his eyes to stave off the brightness. \n\n\nSuddenly, he could no longer feel the ground under his feet or the wind blowing past him. Everything felt warm, and safe. The sensation was akin to a mouthful of slightly melted vanilla ice cream on a burning summer day.\n\n\nAnd then it changed and his feet, soon followed by his entire body, was hitting the cold hard ground.\n\n \n\n“Should we wake him?”\n\n\n“Absolutely not, let the poor boy rest.”\n\n\n“Yes, dear.”\n\n\n“Oh, go put on a pot of tea, Vincent.”\n\n \n\n“It’s been a day.”\n\n\n“It took \n\nyou\n\n a week to recover.”\n\n\n“You only took a few hours.”\n\n\n“I’m special like that.”\n\n \n\n“Oh look, Ronnie dear, i think he moved.”\n\n\n“He’ll be up soon, then. Best get everything prepared.”\n\n \n\nHarry groaned.\n\n\nEverything - and he quite literally meant \n\neverything\n\n - hurt. It felt like every cell in his body had been put through the wringer, even fluttering his eyes opened caused a burst of pain to flare up in his forehead. \n\n\nA warm hand pressed on his cheek. Harry couldn’t even muster up the energy to flinch away.\n\n\n“Don’t open your eyes yet, dear.” Someone said, “I doubt he warned you, but the journey back will have you feeling a little under the weather for a few days.”\n\n\nHarry managed a garbled reply.\n\n\n“Hush.” They said and Harry had just enough coherent thought to note the southern drawl, “Save your strength. Vincent is busy making chicken soup, doesn’t that sound good?”\n\n\nThat did sound good. Harry was sure he’d made an appropriately agreeable sound, because the person laughed softly before moving away.\n\n\nIt was a nice laugh.\n\n \n\nThe next time Harry regained consciousness, everything hurt marginally less. Enough so that he could successfully open his eyes without giving himself brain damage. He tried to sit up, rather unsuccessfully, only managing to shove himself up slightly on his pillow.\n\n\nHe’d been tucked snuggly into a bed, with three extra blankets and about a dozen pillows. Harry looked to the left, spotting his wand and a bowl of soup on the bedside table.\n\n\n“Oh!” came from the doorway.\n\n\nHarry snapped his head to the sound, causing his neck to protest at the sudden movement.\n\n\n“You’re awake.” The man said, smiling gently, “Ronnie! He’s awake!”\n\n\nHarry winced at the noise.\n\n\n“Oh dear.” The man said quickly, “Sorry about that, we’ll keep it down.”\n\n\n“Who’r you?”\n\n\n“My name’s Vincent, kiddo.” The man sat down beside him, grabbing the bowl from the bedside table and offering him a spoonful, “It’s not poisoned, promise.”\n\n\nHarry, against his better judgement, opened his mouth. He’d been unconscious for who knows how long in these peoples care. If they wanted to kill him, they’d have done it by now. \n\n\nThe soup was still warm, and delightfully filling.\n\n\n“It’s good, right?” Vincent smiled, “My mama’s secret recipe.”\n\n\n“It’s d’ichious.” He mumbled.\n\n\n“Welcome back, dear.” A woman walked into the room.\n\n\n“Where, um, am I?” \n\n\n“East London,” The woman sat down beside Vincent, “In nineteen forty-two.”\n\n\nHarry choked on his soup. He wasn’t really sure why, he \n\nhad\n\n agreed to this, but suddenly everything was hitting him. Everything he knew was \n\ngone\n\n - granted, most of that was shit, but still.\n\n\nFuck. What was that saying, again? The past is like a different country? He hadn't done \n\nany\n\n studying for this (and now he was starting to sound like Hermione, Merlin help him). \n\n\nVincent patted him gently on the back. “It’s a bit of a shock to the system, we know.”\n\n\n“I’m not prepared for this \n\nat all\n\n.”\n\n\n“Don’t worry.” Vincent said, “Me and Ronnie've got you covered.”\n\n\n“What Vince \n\nmeans\n\n,” Ronnie said, smacking Vincent on the shoulder, “Is that we have information packets, appropriate clothes, \n\nand\n\n forged transcripts. We have all summer to get you prepared for hogwarts.”\n\n\n“Okay,” Harry said, “Okay, so, who am I? Exactly?”\n\n\n“Hadrian Peverell.” Ronnie handed him a paper file, “The only son of Rhonda and Vincent Peverell.”\n\n\nHarry blinked, “You’re my…?”\n\n\n“Your Parents, yes.” She smiled slightly, “At least, in the official capacity.”\n\n\nVincent added, “Though, we \n\nare\n\n responsible for taking care of you from now on.”\n\n\nHarry opened the file and read through the pages. Whoever this third party was, they were thorough as hell. The files contained everything from his birth certificate to primary school detention transcriptions. Apparently his magical education thus far had been a combination of homeschooling and tutors, but his parents had decided to put him into a proper schooling environment for his O.W.L years - wait.\n\n\n“Um, I’ve already done my fifth year.”\n\n\nRonnie snorted, “You’ll be redoing them, dear. I believe you can do much better without several of your teachers deliberately sabotaging your education.”\n\n\n“Okay, then.” Harry said. What she had said made sense, so he wouldn’t bother arguing it.\n\n\n“We’ll let you rest.” Vincent said, standing up, “Training will start on Monday.”\n\n\n“It’s saturday.” Ronnie filled in before he could ask.\n\n\n“Training?” he squeaked instead.\n\n\nVincent smiled, “Manners, etiquette, politics. Not to mention some extra tutoring in your academics. You are a scion of the Peverell house now, this will be expected of you.”\n\n\nHarry sighed, he should have known.\n\n\nRonnie patted him on the shoulder before standing up as well, “It’ll be alright, Hadrian. We’ll teach you everything you need to know. And a little extra too.” She added with a wink.\n\n\nVincent and Ronnie left the room, taking the empty soup bowl but leaving the files for Harry to go through in more detail. He sighed again. The rest of his life, if it went anything like this, was going to be a fucking headache and a half.\n\n \n\nHarry hated being right.\n\n\nThey’d just started in on their twelve point study programme and he already had a headache. The magical world was just… so complex - way more than he’d ever realised. Add that to the fact that he’d been thrown five decades into the past. Well, Harry might as well have been raised on Mars with how little he knew about \n\nanything\n\n.\n\n\nRonnie and Vince - they’d both told him to call them whatever he felt comfortable with inside the house, though he’d have to use Mother and Father in public to keep up appearances - were doing their best to ease him into things. \n\n\nThe first topic of discussion was social etiquette. Something that hadn’t, apparently, fallen out of fashion even back - or forward? - in the nineties. He’d just been too dense to realise that near everyone else was following a code of conduct. In his defence though, most people seemed to forget the term ‘personal space’ when it came to interacting with him, let alone deferring to etiquette rules.\n\n\n“So,” Ronnie was explaining the different types of greeting, oblivious to Harry’s internal freak out, “You are heir Perverell. Meaning you are on parr with Most ancient and Most noble houses like the Gryffindor or the Blacks. You would greet other heirs of these houses by gripping their wrists as an indication of equal status.”\n\n\n“Uh huh.” he said, scribbling it down in his notebook - thankfully Vince wasn’t bothered with using parchment and quills, so he’d nabbed a few pens and bullet journals at the store for Harry to use.\n\n\n“Lords and ladies of ancient and noble houses, like the Malfoys, would also be seen as having equal status to the heirs of Most ancient and Most noble houses, so you would also greet them like that. The heirs to ancient and noble houses would bow, no lower than about a quarter of the way down, to you.”\n\n\nRonnie raised an eyebrow at him. Harry nodded in response. Vince ate another scone.\n\n\n“Alright then.” She continued, “So folks with no status at all, this includes houses like the Weasleys and the Bones, as well as no-maj’s, you’d shake their hands. \n\nThey\n\n would bow to ancient and noble houses.”\n\n\n“Okay,” Harry said slowly, “So You clasp wrists with people of equal status, bow to one level of status about, and shake hands with two levels up.”\n\n\nRonnie nodded with a pleased smile.\n\n\n“So I would bow to the lords and Ladys of Most ancient and Most noble houses?”\n\n\n“Yes!” She cheered slightly, “That’s exactly right, dear.”\n\n\nHarry smiled, “So how do I know who’s who?”\n\n\nVince smirked, pulling out a thick tome from the pile in front of them. “You’re memorizing everyone of note.”\n\n\nHarry looked at the book with dawning horror, “Everyone?”\n\n\n“Everyone.” They confirmed.\n\n\nHarry couldn’t contain his groan. “Remind me again why this is necessary?”\n\n\nRonnie leveled him with an impressive unimpressed look, “You wouldn’t want to accidentally start a blood feud, now would you?”\n\n\nHe gulped, “No.”\n\n\nRonnie hummed at his reply before shoving the book of names and titles under his nose. “Read up. We’ll be testing you on it next monday.”\n\n \n\nSoon enough a schedule slipped into place.\n\n\nOn Monday’s they went over societal niceties - Ronnie scowled whenever Vince and Harry called it that, it was \n\n‘etiquette’\n\n, nothing more, nothing less - Greetings, what counted as polite conversation and what fell into dinner talk territory, that kind of thing.\n\n\nThen Tuesdays and Wednesdays were taken over by heir training, the sort that Harry should have been having since he was eight. The Potters were not as important as the Peverells, but they were still an Ancient and Noble family. Harry needed to be trained in estate management, politics, not to mention his own family history. \n\n\nMerlin knows why none of this had been mentioned to him beforehand, but he had his money on it being another manipulation via his ex-headmaster. Keeping him ignorant of his place in the world and all that.\n\n\nThursdays spelt what Harry took to calling finishing school. Ronnie was on his back about his posture and the way he sat, hell, she even had an opinion on the way he drank his tea. Vincent liked to laugh at him, but that always led to Ronnie turning her attention onto him - giving Harry a lovely break while she snapped at Vince to “sit up straight, for heaven's sake.”\n\n\nFridays were his least favorite by far, where they went over everything he needed to know about surviving in the past. Most of which he was planning to disregard, honestly. There were just some things he wouldn’t abide by - but he had to know the rules in order to best break them. \n\n\nRonnie was not best pleased to hear it, though she grudgingly accepted it after hours of arguing.\n\n\nHarry also joined Vince and Ronnie for a morning run and a workout in the afternoon, since Vincent insisted that they all keep fit. In the evening, Harry, Vince, and Ronnie gathered around the dinner table and talked.\n\n\nHarry found himself surprised by how enjoyable his dinners were with his new ‘parents’. \n\n\nVince and Ronnie, had been married for ten years and had been a part of The Organisation - for which there was no other name or explanation - for fifteen and seventeen years respectively. They’d both been born and raised in Dallas, and though they had vaguely heard of the boy-who-lived, neither had particularly kept up with his life.\n\n\nWhich - in hindsight - was probably why they’d been chosen for this assignment. Neither had any living family excluding each other and they weren’t Harry Potter superfans. The organisation seemed to understand well enough that he’d not respond well to people who treated him like the next coming of Merlin.\n\n\nRonnie and Vince were nothing like that. \n\n\nThey actually... parented him. Which was an \n\nexperience\n\n, to say the least. He’d never actually had that before, so he was naturally a bit resistant to it, at first. But after one argument too many Vincent had sat them all down to hash out some concrete rules.\n\n\nThat had helped.\n\n\nHarry had very soon gotten comfortable with Ronnie and Vincent. Enough so that he didn’t mind needling them about just what ‘The Organisation’ was. \n\n\nThey never gave him much information, and at this point he was fairly certain they didn’t quite know what was going on either, but he’d managed to suss out enough to know that they’d both been approached straight out of Ilvermorny and neither had been able to resist the high pay or the benefits. \n\n\nIt seemed to Harry that The Organisation kept its employees on a need to know basis, they seemed to be assassins of some nature, even though most of their jobs revolved more around saving and maneuvering people rather than killing them. Rarely did they get to interact with other employees. The jobs were often sporadic and required a certain… moral ambiguity.\n\n\nBut, again, the pay was extraordinary. \n\n\nHarry didn’t judge.\n\n \n\n“Is this really necessary?” Harry asked with a dubious look at Ronnie.\n\n\n“Absolutely.” She said, adding another book to the pile stacked atop his head, “Now, walk back and forth ten times.\n\n\nHarry grumbled, but complied. He made three trips before wobbling, and another two before tipping over completely.\n\n\nRonnie smiled nevertheless, “You’ve improved.”\n\n\n“Just barely.” He sighed.\n\n\n“Improvement is improvement, young man.” She helped him gather the fallen books before setting him back up. She met his eyes and held his gaze for a moment, “Again.”\n\n \n\n“Explain what you’ve learnt about the way magic functions.” Vincent said, closing Harry’s notebook and nodding at him.\n\n\n“Okay so there’s Light magic, Grey magic, Dark magic, and Black magic.” Harry started, biting his lip as he tried to recall all he’d learnt in the past few weeks, “Light magic is very cut and dry. If you say the spell right and do the wand movement perfectly, you’ll get results. This is the easiest form of spell casting because the spells absorb the latent energy surrounding us and use it to do what we want it to do.”\n\n\n Vincent nodded, taking a sip of his tea, “And examples are?”\n\n\n“Most transfiguration spells, like Evanesco.” Harry hesitated, biting his lip, “I’m still confused though.”\n\n\n“On what?”\n\n\n“I thought light spells don’t rely on intent? But Evanesco is classified as a light spell and is wholly reliant on intent.”\n\n\n“Ah,” Vincent hummed, placing his cup back down. “Common misconception, kiddo. \n\nAll\n\n magic requires intent. You want something, you direct your magic, it happens. The difference between light and dark is that dark magic can be \n\naltered\n\n by feeling.”\n\n\n“What’s the difference?”\n\n\n“Okay, so let’s take the knockback jinx. It’s a dark spell, and hence requires both intent \n\nand\n\n feeling. If I \n\nwant\n\n to knock you back and I \n\nfeel\n\n anger towards you, that would blast you right off your feet - but let’s say I felt fondness towards you in that moment…”\n\n\n“It would be more like a light shove?”\n\n\n“Precisely.” Vincent clapped him on the shoulder, “Light magic is clinical. It does what you tell it to do. But Dark magic doesn’t rely on excess energy, you use the strength \n\nyou\n\n have in your own magical core - and your magic is nothing if not a reflection of your inner desires.”\n\n\n“Alright.” Harry nodded, “So Dark magic is more varied, then? Because each spell’s intensity would differ depending on what you’re feeling.”\n\n\n“Yes. And Dark magic is more than just jinxes, hexes, and curses. All rituals and magical ceremonies are either Dark or Grey.”\n\n\nHarry blinked, drawing the connection, “So \n\nthat’s\n\n why magic was getting weaker! All the dark rituals had been banned by the ministry.”\n\n\nVincent hummed sadly, “The energy left by dark spells would not have been enough to sustain us for another twenty years. The rituals used to - still do, I suppose - feed latent energy into the very earth annually. Voldemort boosted the latent energy… but it would never have been enough to save us, not for long anyway. And the ministry is already starting to crack down on us here.”\n\n\n“How the hell am I supposed to stop that?” Harry asked helplessly.\n\n\nVincent covered Harry’s palm with his own, “You just gotta get your generation onside. Convince your fellow students that Dark magic ain’t all bad. And hey, don’t sweat - Ronnie and I are doing everything we can to ease your path at the ministry. You’ve got \n\ntime\n\n, kid. We know you can do this, The Organisation wouldn’ta sent you back if you didn’t have a good shot at succeeding.”\n\n\nVince squeezed Harry's hand, and Harry squeezed his back, “Thanks vince.”\n\n\n“Anytime, kid.” He smiled, “Now, Grey magic?”\n\n\n“A combination of light and Dark. Requires more conscious thought than the typical light spell but still feeds off the latent energy surrounding us.”\n\n\n“Good. Examples?”\n\n\n“The Patronus charm, commonly believed to be the ultimate light charm.”\n\n\nVince snorted, “People do tend to get carried away with their symbolism, don’t they? Last one, Harry: Black magic.”\n\n\n“Necromancy and horcruxes. The kind of magic that takes too much.”\n\n\n“Stay far away from Black magic.” Vince cautioned, “It’s like a drug, you become dependent on it even as it drains the life from you.”\n\n\n“I know, Vince.”\n\n\n“It never hurts to be cautious, kid.”\n\n\n“Yeah,” Harry said, “I know.”\n\n \n\n“You’ve got to \n\nwhat\n\n?”\n\n\nHarry blinked, absolutely bewildered, as Ronnie and Vince sat calmly at the breakfast table. They were both holding a vial of their blood and Vince was drawing out a small runic circle on a slab of wood.\n\n\nRonnie rolled her eyes, “It’s just a little ritual. We don’t even need \n\nyour\n\n blood.”\n\n\n“Yeah,” Harry said, “But why?”\n\n\n“All our records have us placed in Dallas Texas for the last fifteen years, how the hell do you wanna explain your accent?”\n\n\nHarry pouted, “I could fake one.”\n\n\nRonnie snorted, “Go ahead, let’s hear it.”\n\n\n“Uh… nevermind.”\n\n\n“That’s what I thought.” Ronnie smiled, “All you’ve gotta do is drink the potion.”\n\n\n“Right,” Harry mumbled, “Drink the potion, get a southern accent. Easy as pie.”\n\n\nRonnie beamed, “Look at that, Vince! He’s already picking up our expressions.”\n\n\n“You're getting more than our accents, Kiddo.” Vince looked up slightly from the circle he was drawing, “You’ll also get a few of our features.”\n\n\n“Huh?”\n\n\n“Harry.” Ronnie said after a brief pause, “You understand what kind of ritual this is, don’t you?”\n\n\nHarry shook his head slowly, “I thought you were just giving me an accent.”\n\n\n“It’s a blood adoption ritual.” Vince said, “With a little something extra to allow for the accent to transfer. It won’t change you too much, you’re too grown for that, but you’ll look related to us.”\n\n\nRationally speaking, Harry knew that this ritual was more than necessary. While Vincent did sort of look like him, with their similar brown skin and messy hair - Harry didn’t really share any facial features with Ronnie or him. Plus, having a British accent would give the game away to any suspicious parties right off the bat - which would be bad, to say the least.\n\n\nBut he couldn’t force himself to say anything else, even as Ronnie and Vince looked at him with concern.\n\n\n“Hey,” Ronnie said softly, “You know we do care about you. Vince and I, we’ve never had kids, but over these past few months…”\n\n\n“We’ve started to think of you as our own, Harry.” Vincent finished for her, “And we’re not leaving you. It’s kind of our job.” He added a wink to the last bit.\n\n\nHarry laughed a little in spite of himself and Ronnie reached forwards to grasp his hand.\n\n\n“Dear,” She said, “You know we love you.”\n\n\nHe couldn’t help the slight rasp in his voice, “You do?”\n\n\n“How could we not?” Vince smiled, “You’re a great kid, and you’re going to do great things.”\n\n\nHarry sniffled, “No - no one’s ever said that to me before.”\n\n\n“Oh honey.” Ronnie gathered him in a hug, “We don’t have to do this if you’re not ready. We can -”\n\n\n“No.” Harry said, “I’m ready. I want to do this. I - I love you guys too.”\n\n\nWith that Ronnie pulled him into another tight hug before pulling back and holding his cheeks in the palms of her hand. “My sweet boy.”\n\n\nVincent reached over to grip his shoulder. “Let’s do this then.”\n\n\nVince finished the last rune before placing a bronze goblet in the centre of the circle and pouring both vails of their blood into it. The runes lit up, from the base of the goblet to the outer ring of the circle, the air surrounding the circle seemed to almost sizzle with heat. Then the glowing stopped and Vince grabbed the goblet.\n\n\nHarry raised an eyebrow, “That’s it.”\n\n\n“Everyone always thinks Dark magic is complicated,” Vince said with an eye roll, “The hardest bit was not smudging the bloody runes. Now, drink up.”\n\n\nHarry took the goblet, looked at it for a moment, and downed it. \n\n\nHe grimaced when the coppery tang hit his tongue. For some reason, he hadn’t quite expected it to taste like blood, but it was highly similar to what he imagined melted blood pops would taste like, just more… intense.\n\n\n“Bleh.” He said, smacking his lips. “Is something supposed to happen?”\n\n\nVince snorted. “Give it a second.”\n\n\n“Alrigh-” Harry stopped short when his skin literally \n\nrippled\n\n. \n\n\nHe hadn’t sat down before taking the potion, which was very clearly a mistake, seeing as the pain spiking behind his eyes made him pitch forwards. The table and Ronnie's quick reaction were the only things stopping him from tumbling onto the floor.\n\n\nThe potion made his mouth feel like it did when he’d just woken up and his scalp itched, even his fingers and toes tingled.\n\n\nIt passed slowly in a series of waves. The first was the most intense, almost knocking him straight off his feet, followed by three more waves of pain, each a little less painful, until he was left breathing heavily panting.\n\n\n“You okay there?” Vince had stood up, helping to support his weight by throwing his arm under Harry's shoulder.\n\n\n“All good.” Harry wheezed, “How do I look?” He almost jumped in surprise at the sound of his own voice, which now had a distinct southern twang.\n\n\nRonnie laughed slightly at the face he made, checked to make sure he was securely held by Vince before letting him go and summoning the nearest mirror, “See for yourself.”\n\n\nHarry straightened his glasses and gaped at his reflection.\n\n\nHuh.\n\n\nHe still looked very much like himself - anybody from the future would have probably mistaken him for his own brother. His green eyes were still present, but they looked more similar to Ronnie’s turquoise than the striking emerald it had once been. His hair was as messy as ever but the colour had lightened slightly. Both his jawline and his cheekbones had sharpened to match Vincents, while his nose and lips had remained the same.\n\n\nAside from that, nothing much had changed besides perhaps two inches added to his height.\n\n\n“I look…”\n\n\n“Like our son.” Ronnie said softly. Staring at his reflection just as intently as he was.\n\n\n“Sounds like it too.” Vince couldn’t seem to stop beaming.\n\n\nHarry touched his jaw, feeling a smile stretch across his new face. He threw his arms around them both and whispered into Ronnie’s shoulder, “Does this mean I can say ‘y'all’ now?”\n\n \n\n“Good luck, kid.”\n\n\nVincent was holding onto both of his shoulders, smiling broadly.\n\n\nRonnie handed him his shrunk down trunk, ruffling his hair, “Don’t get in too much trouble”\n\n\n“I can’t promise you that.” Harry grinned even when Ronnie glared.\n\n\n“Oh go on then” Vince let his shoulders go, giving him a small shove, “we don’t want you to miss your train.”\n\n\nHarry laughed, stepping away, “Love you guys.”\n\n\n“Love you too, kid!” Vince shouted after him.\n\n\n“Don’t forget to write!” Ronnie added.\n\n\n“I won’t” \n\n\nAnd with that Harry stepped onto the Hogwarts express.\n\n\nIt looked exactly like it did fifty years from now, but the people were almost alien. Sure, he’d been out and about during the summer - Ronnie insisted on it so that he could stop gaping at the fashion. But still. People were just \n\ndifferent\n\n - it was almost scary how much could change in five decades - they were more contained, almost, or wild and crazy in different ways.\n\n\nHe meandered the train carriages, looking for an empty compartment. Heads turned every now and then, mostly from kids his age who found they couldn’t recognise him, but nobody approached him. Eventually he found a compartment, slipping inside and wandlessly enlarging his trunk before shoving it in the holder.\n\n\nTwo months ago, he’d barely been able to drag his trunk onto the train, let alone lifting it to put it away. He was suddenly very thankful for the strict workout routine that Vince had insisted upon. He’d gone from a scrawny wisp of a boy to a well defined, just about average height, young man - and it only took three separate potion regimes and one extremely well paid physiotherapist.\n\n\nThe wandless magic was something Ronnie taught him. She was ahead of him in leaps and bounds, but she’d managed to teach him enough to summon and banish, shrink and enlarge - he’d gain more mastery over it in time, but for now that was his entire wandless arsenal.   \n\n\nWith that aforementioned skill he summoned a runic book from his bag with a flick of his wrist.\n\n\nHe’d discovered a shocking love for runes during the summer. Vince, who was something of a rune master himself, had told him he was very advanced for only having two months of practice - with a lot of extra studying, he’d probably score well on his O.W.L’s. \n\n\nHarry had elected to drop divination, taking up Runes instead, but other than that his schedule would be much the same.\n\n\nThe book, one that wouldn’t be published for another seventeen years, was interesting. It was chock full of information about layering runes, switching between informative instructions and amusing anecdotes of the consequences of layered runes gone wrong.\n\n\nHe didn’t even notice how much time had passed until the train started to slow down. With a quiet yelp he hurried to swap out the high waisted dress pants and striped shirt for his plain hogwarts robes.\n\n\nNobody stared at his robes, which was as blank as all the other first years, but that was only because he was quite possibly the last person all but sprinting off the train.\n\n\nThe first years, thankfully, were still gathered around a man - he was tall, not quite Hagrid’s height, and wearing a thick black coat - who lit up when he saw Harry’s confused expression.\n\n\n“Oi!” he called, “you Peverell?”\n\n\nHarry snapped his head towards the man, smiling broadly in relief and walking briskly to join the crowd of eleven year olds. People were looking now. Harry studiously ignored the whispers easily - he had \n\nway\n\n too much practice at doing just that - and briefly nodded to what must have been the gameskeeper.\n\n\nThe lack of Hagrid sent a pang of sadness through Harry. He shoved the feeling down, just as he’d done when he realised that neither Ron nor Hermione would be joining him in his compartment. \n\n\nLater.\n\n\nHe’d have his inevitable breakdown later.\n\n\nPreferably in the comfort of his own bed, behind at least seven different privacy charms.\n\n\n“Right!” The gameskeeper said, “Follow me, firsties.”\n\n\nThe first years gawked at him, all of them clearly confused as to what he was doing going with them, and Harry did his best to smile politely at all of them. \n\n\nWhen he got in a boat, only two others joined him.\n\n\nA boy with inky black hair and grey eyes turned slightly to face Harry. “My name is Cygnus Black, scion of the Most ancient and Most noble house of Black, merry meet.”\n\n\n“Merry meet, Black.” Harry replied, consciously stymying the urge to offer his hand, “I am Hadrien Peverell, Heir to the Most ancient and Most noble house of Peverell.”\n\n\nHarry watched, mildly amused, as the other boy’s eyes widened for a fraction of a second before he dipped into a slightly awkward bow, seeing as how they were sat on a boat.\n\n\nThe other boy on the boat turned as well, introducing himself as, “Floxel Lestrange, Scion of the ancient and noble house of Lestrange, Merry meet.”\n\n\nHe offered his hand and Harry shook it firmly.\n\n\n“Merry meet,” he echoed.\n\n\nConversation paused briefly as they caught their first glimpse of the castle. Hogwarts sat proudly against the sky, looking just as beautiful as she did in fifty years. Harry’s heart stuttered in his chest.\n\n\nHe was home.\n\n\nNobody said a word until the gameskeeper left them in the hands of Dumbledore, who was now the transfiguration professor. Harry had almost tripped right then and there at the sight of his old - now young - headmaster, doubly so when those blue eyes met his.\n\n\n“Mr Peverell,” He said, “A word.”\n\n\nHarry quickly made his way over to Dumbledore, “Merry meet, professor.”\n\n\nHarry did not offer his arm.\n\n\n“Indeed, Mr Peverell.” Dumbledore said softly, “I want to be the first to welcome you to Hogwarts, you’ve made a good decision to transfer in.”\n\n\n“Thank you, sir.”\n\n\n“The first years will be sorted before you, so do not be concerned if we do not call your name.”\n\n\nHarry nodded, “I understand, professor.”\n\n\n“Alright then,” he nodded back, then louder, he said to the rest of the students, “I'll be back soon. Do try to behave yourselves until then.” \n\n\nWith a swish of his brightly coloured robes, the professor was off.\n\n\nCygnus Black had made his way closer to Harry sometime during Dumbledore’s little chat because as soon as Harry turned, the boy was standing right infront of him.\n\n\n“Peverell,” He said, “Are you transferring from another wizarding school?”\n\n\n“No, I’ve been homeschooled most of my life.” Harry answered, gesturing slightly with his hands, “My Ma thought it would be better to do my O.W.Ls in a proper school.”\n\n\nHarry no longer winced at using the southern slang, as he’d done the first few days after the ritual. It was almost natural, now, though he was still working on the expressions.\n\n\n“Ah,” The younger boy paused, hesitating before asking, “And you’re from the colonies?”\n\n\nHarry laughed lightly at the boys barely concealed frown, “I was raised there. We only came back home about a year ago.”\n\n\nCygnus opened his mouth to ask more when the doors opened, revealing Professor Dumbledore.\n\n\n“Come along, children.”\n\n\nThey followed along, Harry lagging behind with Cygnus sticking close by. The boy looked a little lost and a lot terrified, and when they reached the great hall, he angled his body slightly towards Harry. If Harry didn’t know any better, he’d think he’d just accidentally adopted a first year puppy.\n\n\nPeople were staring at him. He kept his back straight and his shoulders loose, allowing his eyes to scan the tables, not once settling on any one person - even when his eyes met a familiar dark brown stare, he’d forced him to keep going. He presented a calm, slightly bored demeanor.\n\n\nRonnie would be proud.\n\n\nDumbledore unfurled the list after the sorting hat finished its song - something or another about the light at the end of the tunnel and having bravery in the face of adversity - and began calling up names.\n\n\nHe paid just enough attention to note when Cygnus was sorted into Slytherin.\n\n\nHe clapped for the kid.\n\n\nBefore he knew it Dumbledore had gone through the entire scroll.\n\n\n“All right then, Students.” He said, “Please welcome our newest transfer student, Hadrian Peverell.”\n\n\nHarry walked up to the stool, which looked almost comically small when he sat down on it, and sighed as the hat was placed on his head.\n\n\n\nWelcome back Mr Potter,\n\n the hat said in his head. \n\nIt’s so rare I get a time traveller.\n\n\n\n\nIt’s Peverell now\n\n, Harry thought back to it. \n\nAnd you’ve seen other time travellers?\n\n\n\n\nOf course, that organisation has sent maybe… three others over the centuries\n\n the hat hummed,\n\n Now, let’s see, let’s see. You’re just as brave as you were - or, should i say will be? - but I fear the lion’s would not be able to survive the new you.\n\n\n\nHarry shrugged, \n\nI figured.\n\n\n\n\nYour Loyalty is a strong trait, but it must be earned. The badgers prefer to give it easily. Ravenclaw or Slytherin, hmm, either would serve you well. But you already know where you must go, don’t you?\n\n\n\nHe sighed. He did, \n\nI do.\n\n\n\n\nThen\n\n, said the hat, \n\nbetter be\n\n… “Slytherin!”\n\n\nThe hall broke into polite applause. Harry stood, placing the hat back on the stool and smiling slightly at Dumbledore before making his way to the Slytherin table. Cygnus, sitting near people who must have been his cousins, motioned Harry over.\n\n\n“Merry meet, Peverell.” One of the boys offered his arm after he’d taken his seat beside Cygnus “I am Orion Black, Heir to the Most ancient and Most noble house of Black.”\n\n\nHarry gripped his wrist, “Merry meet.” \n\n\n“May I introduce my sister, Lucretia Black and my cousin, Walburga Black.” Both girls dipped their heads, the approximation of a seated curtsy. “And let’s not forget Cousin Alphard. I believe you already know Cygnus?”\n\n\nHarry nodded, laughing lightly at the pained expression on Orion’s face when he mentioned Alphard, “Merry meet, everyone.” \n\n\n“Please, Peverell.” Lucretia smiled across the table, “Call us by our given names, it’s far too confusing otherwise.\n\n\nHarry smiled at her, allowing a relieved chuckle to escape, “Thank you, I was wondering how longer I could get away without having to specify between you all. You all may call me Hadrian, aswell.”\n\n\nWalburga and Lucretia laughed, even Orion cracked a smile at Harry’s wiry expression.\n\n\n“So, Hadrian.” Orion said, “Cygnus told me you were raised in the colonies?”\n\n\nHarry raised an eyebrow at Cygnus, who blushed. “News travels fast around here. But yes, my pops got a job in Dallas when I was a kid. We only moved back home a year ago, and ma decided that tutors weren’t good enough for my O.W.L year, so here I am.”\n\n\n“You’re in fifth year?” Orion asked, smiling when Harry nodded, “Same as me, then. Lucretia and Walburga are both sixth years. Alphard’s in his seventh year.”\n\n\n“What subjects are you all taking?” Harry asked.\n\n\nSoon enough the entire group was exchanging subjects, Harry even got to regale the Black family with a watered down story of that time he’d ridden a thestral. Over the course of the meal Harry was introduced to Rudolph Lestrange, Abraxas Malfoy, and Herbert Avery - all boys in his year group.\n\n\nNone of them were anything like their future selves. Harry had never even \n\nheard\n\n of Lucretia Black before. He looked for a trace of madness, an inkling of the monsters they, and their future children, would become - and he found nothing.\n\n\nHe supposed that fifty years changed a lot.\n\n\nThankfully, he’d been seated far enough down the table that he’d not yet interacted with one Tom Marvolo Riddle. Though he knew they’d be sharing a room later, the delayed introduction was much appreciated.\n\n\nDinner came to a close, after Harry had finished off a healthy serving of treacle tart, and Harry followed the Blacks down to the Slytherin common room, making sure to stay a step behind them the whole time - so as to not give away that he knew where they were going.\n\n\nLucretia said the password, “Viper”, and Harry committed it to memory.\n\n\n“Follow me, Hadrian,” Orion motioned at him, “I’ll show you to our dorm room.”\n\n\nHarry smiled gratefully at him, and followed Orion until he swung open a heavy wooden door.\n\n\nThe Slytherin rooms were bigger than Gryffindor rooms, significantly so. It was a large rectangular room, rather than the circular structure up in the towers, each canopy bed was accompanied by a desk and a wardrobe, as well as a bedside table. \n\n\nBack in Gryffindor they’d had to keep all their clothes in their trunks, and studying had to be done in the common room or the library. Harry found himself grateful for the change.\n\n\nLestrange, Malfoy, and Avery had all beat Orion and him to the room, likely because the Black brood had taken to pointing out routes and significant places to Harry on the way down from the great hall. \n\n\nHarry smiled at them. And that’s when he noticed Riddle.\n\n\nThe other boy had been sitting on his bed - right next to the one with Harry’s trunk sitting in front of it, lovely - but he’d stood up when they entered the room. \n\n\nRiddle walked forwards, stopping in front of them. “Merry meet, Orion.” He turned to Harry, “Merry meet, Peverell. I am Tom Riddle.”\n\n\n“Merry meet, Riddle.”\n\n\nRiddle offered his arm. Harry shook his hand, expertly hiding how pleased it made him when the action sparked a flare of anger in Riddle's eyes. \n\n\nFor a moment, neither of them let go.\n\n\nThen Harry blinked, and the moment passed. \n\n\nTom went back to his bed and Orion smiled at Harry before moving towards his own.\n\n\nHarry mentally shook off the weirdness of that whole interaction, took a deep breath, and set off towards his corner of the room, which was right beside a large window that had a beautiful view of the lake - it was also beside Riddle’s, which he was trying not to think about.\n\n\nAs Harry unpacked his clothes into the wardrobe, he listened to the other boy's conversation. They mostly chatted about what they’d gotten up to over the summer, homework and annoying little siblings, trivial things. Abraxas even gushed about his betrothed, Medusa - who it seemed he was very much taken by.\n\n\nIt was nothing like what he’d expected of the future Dark Lord and his most trusted cronies.\n\n\nThey even included Harry in the conversation, asking him about his childhood and homelife. Rudolph mentioned quidditch, which automatically caused Tom to roll his eyes so hard Harry thought they’d fall out, and Harry grinned. The two enthusiastically departed techniques for the better part of half an hour, until Tom loudly declared that he’d murder them both if they said one more word on the topic.\n\n\nRudolph and Harry both laughed - Harry, mostly, laughed because the statement had been said as a joke.\n\n\nImagine that, a dark lord, \n\njoking\n\n. \n\n\nOne by one the boys went to bed, mumbling their goodnights before shutting their curtains, until it was just Tom and Harry left awake.\n\n\n“Welcome to Slytherin, Peverell.” Tom said suddenly, Harry eyed him wearily, “I doubt you stuck around for the first year speech, so I’ll inform you now. We are not trusted or liked, professors will be biased against us, and we protect our own.”\n\n\n“I see.” Harry said.\n\n\n“There is a certain hierarchy around here, Peverell.” Harry met those blazing eyes again, “Do not attempt to rise above your station, not so soon anyway.”\n\n\nHarry’s eyes narrowed. Anger coiled deep in his belly and he was well aware that his eyes were probably doing that thing that \n\nmade\n\n people listen to him. He was meant to befriend Tom Riddle. He was meant to save him from himself - the prat didn’t have to make it so damn difficult, though.\n\n\nA mantra of: \n\nsave him, save him, save him \n\nran through his skull.\n\n\n“Is that so, Riddle?” \n\ndammit\n\n. \n\n\n“It is.”\n\n\n“What happens if I decide to mess with your little hierarchy system?”\n\n\nRiddle took a step closer. Harry, still sitting crossed leg on his bed, stared up at him with an unimpressed frown.\n\n\n“I don’t know, Peverell. Nobody’s ever been foolish enough to find out.”\n\n\n“Well then,” Harry said, his cold tone sounded even more menacing with the accent, “I guess we’ll both be learning something new.”\n\n\nHarry shut the curtain, spelling it so that nobody would be able to hear him or open it during the night.\n\n\nThe \n\nnerve\n\n of that boy.\n\n\nGods above, Harry had never dealt with someone who could rile him up in so few words - except well, maybe Snape. The spells on his curtains were one way, so he could hear Tom out there huffing to himself as he too climbed into bed.\n\n\nWith the darkness surrounding him, the anger drained and all the bittersweet sorrow of the day rushed in to take its place. A sob wracked it’s way through his throat and he drew his knees up to his chest in order to hide his face in his legs.\n\n\nHe’d done this more than a few times back at Peverell manor, when the guilt and sorrow were just too much. Sometimes he’d see a book that Hermione would love, or hear a joke that would have sent Ron into a fit of laughter, and it would take all his strength not to fall apart.\n\n\nIt was always worse when he’d had a nightmare beforehand. He’d see his parents, or Cedric, or Sirius die - or he’d relieve the crutios or his possession - and wake up in a cold sweat, screaming himself hoarse. \n\n\nRonnie and Vince had developed a schedule of checking up on him by the second week at the manor, he’d lost count of the amount of times he’d cried himself to sleep in one of their arms.\n\n\nThey weren’t sleeping down the hall anymore. Harry was alone again.\n\n\nHe hugged his knees even tighter.\n\n\nBeing in Hogwarts was like a balm to his wounded soul, but it was also a stark reminder of all the things he’d given up - his friends, his house, his \n\nname\n\n, all of it. It \n\nbroke\n\n something in him.\n\n\nHarry couldn’t recall falling asleep that night, but when he woke up his face was still sticky.\n\n \n\nHarry had never been able to sleep in later than six a.m - a consequence of being woken up by Petunia for the first eleven years of his life. It was just ingrained in his body, something that would likely never change. \n\n\nSo, on his first day of Hogwarts in the forties, Harry slid his curtain open at five fifty three in the morning. Toeing his way to his wardrobe, he pulled out a pair of workout shorts, a simple t-shirt, and his running shoes before making his way to the fifth year bathroom.\n\n\nHe quickly brushed his teeth and splashed his face with water, slipping into his workout clothes and leaving his pyjamas in one of the lockers near the showers. \n\n\nNobody, not even the portraits were up, so Harry didn’t have to pretend to be lost. He quickly made his way out to the great lake. \n\n\nAfter stretching thoroughly, he set off at a strong pace following the curve of the lake. Vince would be proud to know that he’d be keeping up with his exercise, but it was mostly because the strenuous work was a great way to work off his stress and tension.\n\n\nHe did five laps around the lake and he was red and sweaty by the end of it. A quick tempus showed it was only six thirty, meaning his roommates would probably be up soon. \n\n\nHe didn’t hurry on his way down to the common room, giving himself a chance to catch his breath and maybe reduce the redness in his cheeks before seeing anyone. Unfortunately, the universe was not so kind, and he ran into three gryffindor boys before he even got off the ground floor of the castle.\n\n\n“Oi! Ain’t you that transfer student.” One of them said.\n\n\n“Merry meet,” Harry said slightly breathlessly.\n\n\n“Oh, he’s a \n\nposh\n\n one.” Another boy commented.\n\n\nHarry smiled at them, “Not if I don’t have to be, but I’d rather not accidentally mortally offend anyone. My ma would have my head.”\n\n\n“I know exactly what you mean, mate.” the third boy said, “I’m Fleamont Potter. This is Timothy Prewett and Arnold Davidson.”\n\n\nAll three of them tensed slightly when Fleamont said Arnold’s last name, watching him closely for any adverse reaction. Harry just nodded with a smile.\n\n\n“Nice to meet ya’ll.”\n\n\n“Wow,” Davidson said, “You’re \n\nsouthern\n\n southern.”\n\n\nHarry laughed, he did love using that term, “suppose so. Say, what are ya’ll doing up so early?”\n\n\n“We were just heading to the kitchens,” Fleamont said, “It’s the only way to get a cup of coffee as a student. You were running?”\n\n\n“Yeah. I used to do it every day back home, don't think my old man would be too pleased if I fell off the wagon at boarding school.” Harry rolled his eyes, and the three boys laughed, “Would you mind showing me to the kitchen sometime, I’ve got to go shower now, but I \n\nneed\n\n some coffee if I’m going to survive out here.”\n\n\n“Sure.” Fleamont agreed easily, “After class today?”\n\n\n“That’d be great, thank you.”\n\n\n“Not a problem. See you later, Peverell.”\n\n\nHarry echoed the sentiment and turned back towards the dungeons, thankfully not running into any other students beside a ravenclaw girl - who squeeked, blushed, and all but sprinted away when she spotted \nhim. He made it back to the dorm room just in time to watch Orion douse Abraxas in water via an \nAguamenti charm\n.\n\n\nHarry burst into laughter at the spluttering Malfoy heir. Startling both boys, as well as the half asleep Rudolph and Herbert.\n\n\n“Hadiran!” Orion said, “I checked to wake you up and…”\n\n\nHarry smiled mischievously, “I assume I would have received similar treatment?”\n\n\nOrion shrugged sheepishly and Harry snorted.\n\n\n“I went for a run.” He said, grabbing a fresh set of robes before making his way to the showers, with Rudolph close behind him.\n\n\nOnce inside the shower room, Harry pulled his shirt over his head, using it to wipe some of the sweat off his face before tossing it in the hamper. Rudolph pretended not to notice as he quietly fist pumped as the shirt landed inside the hamper.\n\n\nThis moment, precisely, is the moment Tom-fucking-riddle decided to walk out of the shower, clad in nothing but a low riding towel with his wet hair and pale skin on full display.\n\n\nHarry didn’t gape. He didn’t do more than blink once, twice, before smiling slightly at Tom - who’s eyes were caught at his midriff and distinctly \n\nnot\n\n his face.\n\n\n“Good \n\nMorning\n\n, Riddle.” Harry smirked as Tom’s eyes snapped up to his face.\n\n\n“Yes.” He cleared his throat, “Good morning, Peverell, Rudolph.”\n\n\nHarry swung his towel over his shoulder, whistling a tune he knew would tick Tom off as he toed out of his shoes and socks. He stepped behind the curtain of one shower cubicle, hung his shorts over the rail and rinsed off the sweat and dirt.\n\n\nBy the time he finished, Tom was gone and Rudolph was putting on his shoes. Abraxas, Orion, and Herbert were still in the showers.\n\n\nHarry made quick work of putting his uniform on, using the mirror to straighten his tie and towel his hair dry. About halfway through this, Orion exited the shower. Harry waved to him as he left the room.\n\n\nAfter making a quick stop by the dorms to grab his bag, Harry hurried to the common room and managed to catch Lucretia and Walburga on their way out.\n\n\n“Lucretia, Walburga!” He called, holding out his arms like Ronnie had taught him, “Would you mind showing me the way to the great hall?”\n\n\nBoth girls took an arm each, Walburga smiled, “Off course, Hadrian.”\n\n\nThe girls were happy to involve him in their conversation - a heated debate on the pro’s and con’s of using charmed equipment in potion making - and it seemed no time at all before they were seated at the Slytherin table and serving themselves breakfast.\n\n\nUnlike the feast, Harry was sat directly across from Riddle, one of the other only people to be awake so early.\n\n\n“So, Peverell.” Riddle started, “Where were you this morning?”\n\n\nHarry swallowed the bite of egg he’d just taken, “I’m an early riser, decided I might as well make use of the grounds and do a bit of running.”\n\n\n“The lake is just beautiful, isn’t it?” Lucretia sighed.\n\n\nHarry nodded in agreement, “Even more so from below.”\n\n\n“I know what you mean,” Riddle said, “The windows are my favourite part of our dorms.”\n\n\nHarry hummed in agreement and conversation faded out as they all ate in comfortable silence.\n\n \n\nHogwarts in the forties was equally challenging and a breeze. \n\n\nHarry, thanks to some rigorous training by Vince and Ronnie, was well ahead of most of his classmates in terms of theory, he was on par, if slightly behind, Riddle in that department. But what he lacked in theoretical knowledge he made up for in sheer power.\n\n\nVince said it was because he’d been forced to stretch and use far more of his magic than anyone his age should have. As such, his magic had grown like a muscle, equal in strength to what a fully grown auror’s would look like - and it would only grow until he reached his majority.\n\n\nThe one subject he struggled in was runes - mostly because he only had about two months of study to back it up while everyone else had two years - but it was also the class he enjoyed the most, so he hardly minded having to stay back and study it in the library.\n\n\nIn the first few weeks of school, it became abruptly clear to everyone in Hogwarts that Tom Riddle finally had a rival.\n\n\nIt all started on the first Defence lesson of the term.\n\n\nProfessor Merrythought, who’d been at Hogwarts for the past ten years, was already sat at her desk when Harry walked in.\n\n\n“You’re new.” She’d said.\n\n\n“Yes ma’am.” He’d offered her a toothy grin, “Just transferred.”\n\n\n“Texas?”\n\n\nHarry nodded, “Dallas.”\n\n\n“Hmm.”\n\n\nHarry had hurried to take his seat, seeing as how they’d filled up while he was chatting with the professor. Eventually he settled for one in the second row and to the left. Riddle was up front and centre - pretentious prick.\n\n\nOnce everyone had settled, the professor clapped her hands together and stood up.\n\n\n“Alright class, welcome back. I trust you’ve had a nice break.” She didn’t wait for them to give more than a general sound of agreement before plowing ahead, “We’ve got a lot to cover before you sit for your O.W.Ls, you’ll be able to pick up a full copy of the syllabus from my desk at the end of the class, but can anyone tell me why, exactly, this class is so important.”\n\n\nRiddle raised his hand, “We live in a dangerous world, we must be able to protect ourselves.”\n\n\n“Very close, Mr Riddle. But I’m looking for something a little bit more specific… yes, Mr Peverell.”\n\n\n“Every witch and Wizard carries around a wand.” Harry said slowly, when the professor nodded, he continued more confidently, “So each of us has the ability to cause a ridiculous amount of damage. Aurors can’t always get to the scene in time, so it’s up to all of us to help keep each other in check.”\n\n\n“Excellent, Mr Peverell. Five points for Slytherin.” She turned to the rest of the class, “Now, I can have you memorise and practice these spells to your heart's content. But what use is that if you can’t use them in a dueling situation. Up you get.”\n\n\nWith a flick of her wand, Merrythought sent their tables flying neatly to the sides of the room.\n\n\n“Right, everyone pair up with someone from the opposite house - and make it quick or I’ll do the pairings myself. We’re doing shielding charms today.”\n\n\nEveryone hurried to grab a partner. Harry was guessing their professor had a history of pairing rivals together. He blew a sigh of relief when a blushing ravenclaw girl made her way over and asked if he’d partner with her. He ignored the way most of his housemates scowled, must be a muggleborn then.\n\n\nOnce all students had settled in their pairs, Merrythought leaned back against her desk and asked, “Alright, who knows the most common shield charm? Mr Riddle?”\n\n\n“The Protego charm, Professor.”\n\n\n“Correct, take five points.” Professor Merrythought pushed off her desk and began pacing slowly, “The protego charm is one of the most useful spells you’ll ever learn. There are five variations of it, which are…?”\n\n\nHis ravenclaw partener stuck her hand in the air, “Um, Protego duo, which protects you from both physical and magical attacks. Protego Horribilis, which uh, it’s the most powerful variation and protects against anything except the killing curse. Protego maxima, that one shields an area, It’s what’s around Hogwarts, I think. And Protego totalum protects an area from magic for an extended period of time. I’m - uh - not so sure about the last variation.”\n\n\n“Very good Miss Andrews, Ten points to ravenclaw. Mr Peverell can you help your partner with the last variation?”\n\n\nHarry nodded, “Protego Diabolica, Professor. It creates a ring of black fire around an area, which allows your allies to pass through while burning your enemies to ash. Nasty bit of dark magic, that.”\n\n\nThe Professor nodded, “Five points. Now, if you ever encounter a Protego Diabolica, you’d best hope you count as an ally to the caster - we will \n\nnot\n\n be teaching this variation at school, but i find it best to make sure you’re all informed. We’ll work on a basic Protego first. Slytherins, you’re up first. Ravenclaws, cast \n\nonly\n\n an expelliarmus at your partners.”\n\n\nThe ravenclaw smiled at him, “I’m Mandy, by the way.”\n\n\nHarry didn’t bother with the political speech, instead offering her a grin in return, “Lovely to meet you, Mandy. I’m Hadrian. Let’s get started shall we?”\n\n\nMandy responded with a bolt of red light. Harry laughed, flicking his wand, and her spell spread out into a faint red splotch before fizzling into nothing when it made contact with his shield.”\n\n\n“Very good Mr Peverell, Mr Riddle. Take ten points each for being the first to successfully cast the spell.”\n\n\nHarry looked around, noticing that every other Slytherin besides him and Tom had been relieved of their wands. Mandy was beaming at him, but Tom’s partner looked incredibly frustrated. Harry winked at Tom, who somehow managed to look even more annoyed than his partner - poor boy mustn't be used to competition.\n\n\n“Five more minutes,” The professor warned, “Then we’re swapping roles.”\n\n\nMandy attempted to disarm him seven more times, each was easily blocked. By the fifth try Harry was attempting to push the magic straight out of his core, rather than funneling it through his wand. \n\n\nIt was highly draining, and it showed in the way Mandy’s spells seemed to push his shield closer to his body instead of just dying on contact.\n\n\nBy the time it was their turn to switch Harry was panting and sweating. Mandy eyed him critically.\n\n\n“What were you trying to do?” \n\n\n“Nothing.” Harry said slowly.\n\n\n“Uh huh,” Mandy deadpanned, “And that’s why you randomly started sweating after the sixth round.”\n\n\nHarry scowled at her, she was perceptive, he’ll give her that, “Alright fine. I was trying to do it wandlessly.”\n\n\n“Are you insane?”\n\n\n“Maybe a little.”\n\n\n“Oh for pete’s sake.” She rolled her eyes, “Maybe you’ll be so worn out you won’t be able to disarm me.”\n\n\nHarry tilted his head, “Unlikely.”\n\n\n“You wanna bet?”\n\n\nHarry shot a silent Expelliarmus at her, plucking her wand out of the air with ease, “No. It’d be hopelessly unfair to take your money so easily.”\n\n\nMandy laughed, “You didn’t \n\nwarn\n\n me!”\n\n\n“You’ll never be warned in an actual duel,” Harry winked, “Consider this practice. Now put your wand up and cast the shield.”\n\n\n“Yes sir.” Mandy lifted her wand, “Protego!”\n\n\nHarry’s Expelliarmus shattered her shield on impact.\n\n\n“Oh, come on.” Mandy frowned, “And how’d you get yours to absorb mine, aren’t they supposed to ricochet?”\n\n\n“Well, you can modify the protego to take in the external spell to feed itself.” Harry explained stepping forward so he could raise her wand arm gently, “What you’ve got to do is aim higher, so the flick has a slight downward stroke. The tough part is the timing, because you’ve technically got to cast the spell twice. You’ll actually be creating a double layer of shields, with the first one allowing spells in but not out, and the second being impermeable.”\n\n\n“So it trapped my expelliarmus in the middle?”\n\n\n“Exactly,” Harry nodded, “It contained it long enough for your control over the magic to dissipate, at which point my shields could absorb the pure energy. It’s far more effective than the other version, since it allows you to stop placing your own magic into the shields and doesn’t cause the spell to fly around and hit bystanders.”\n\n\nA hand clapped on his shoulder and Harry jumped in surprise.\n\n\n“Where’d you learn all that, Mr Peverell?” Merrythought asked with one eyebrow raised, “You’re correct, of course - but only aurors learn the absorption technique.”\n\n\nHarry shrugged, noticing that every eye in the room was pointed at him. Riddle’s gaze almost burned and his jaw was clenched in a way that looked painful. He didn’t look away when Harry met his stare.\n\n\n“My pops taught me, he worked for the ministry back in America.”\n\n\n“Hmm.” She said, “Twenty points to Slytherin. Everyone else, back to work. And \n\nplease\n\n, do not attempt the absorption method unless you have the first way down to pat.”\n\n\nMandy lifted her wand, “You wouldn’t mind doing some tutoring, would you?”\n\n\nHarry sighed, a few pairs down Tom Riddle's brows furrowed in annoyance, “I suppose I’m going to be hounded after today.”\n\n\nShe grinned toothily in response, “You bet.”\n\n\n“Oh shut up.”\n\n \n\nHarry was just as charming as Riddle was, if not more. This was a fact that most of the Hogwarts population could attest to but, while Tom still pulled ahead of Harry on the academic scale, it was no question who was more well liked by the general student populace. \n\n\nIn less than a month he’d managed to strike up a close friendship with Fleamont Potter - who he refused to think of as his own grandfather for fear of giving himself a headache - thus giving him an in with the lions. The other gryffindors were weary at first, the famed rivalry rearing its ugly head, but with three of their own on his side and Harry’s generally cheerful demeanor, it wasn’t long before the rest of the house accepted him.\n\n\nThis had, obviously, caused \n\nwaves\n\n with the Slytherins. Tom had made good on his word of giving Harry hell for messing with the status quo and he got to see first hand just how much control the future dark lord already had over Slytherin house.\n\n\nFor a full week Harry couldn’t go an hour without having to face off against his fellow snakes. The Blacks, as well as his roommates, refrained - but everyone else thought him fair game for his ‘betrayal’.\n\n\nTom, the bastard, looked all too smug about this. Thinking he’d finally cowed Harry into submission.\n\n\nBut Harry had watched Tom, at first. He’d seen how people almost gravitated towards him, how he presented a polite, helpful but ultimately aloof persona. Nobody could call Tom rude, in fact most thought of him rather fondly. \n\n\nBut Harry could do better than that.\n\n\nDespite only being in Hogwarts (as far as they knew, anyway) for a month, Harry made sure to engage as many people as possible in conversation. He didn’t discriminate between houses or blood status - after all, you trap more flies with honey and all that.\n\n\nHarry, using his new occlumency skills, stored information about people meticulously in his head. Making sure to ask after a younger sibling or an ailing parent every now and then - it was a sure fire way to build bonds.\n\n\nThe hufflepuffs, especially, adored him. \n\n\nHarry had made an arrangement to tutor some of the first years after one boy had seen him messing around with his patronus and begged him for help. Things had just spiraled from there and now Thursday evenings had become ‘designated puff time’.\n\n\nSlytherins Isolation and attack tactic was, hence, highly ineffective. Seeing as he had two whole houses full of friendly faces, not to mention the Blacks - who’d surprisingly stuck by him and refused to bow to the rest of the houses wishes.\n\n\nOrion always rolled his eyes in exasperation when Pomana - his future herbology professor, who was now his herbology study buddy - came to drag him from the Slytherin table to the Hufflepuffs. He’d almost had a heart attack the first time Cygnus had followed Harry.\n\n\nAs it turned out, Harry had been right in his initial assessment of the situation. It seemed Cygnus had imprinted on Harry like a duckling. Not that Harry minded, the kid was a little spitfire and actually presented a lot of intelligent conversation for an eleven year old.\n\n\nHe’d won over the majority of the upper year Slytherin girls by, firstly, treating them like actual people. Harry was well aware that Hermione would find some way to travel back and hex his bits off if he even tried following the more sexist norms of the forties, and even more than that he just \n\ncouldn’t\n\n treat them the way most of his roommates did.\n\n\nHarry chatted and laughed with them, asked after their opinions on things, sometimes he’d even sit and embroider with them. He’d learned how when he was seven, when Petunia had started dumping Vernons ripped pants in his lap and told him to fix it. The girls seemed largely delighted to have a boy taking such an active interest in one of their hobbies, and didn’t mind going slightly more slowly and teaching him more complicated stitches.\n\n\nWhat few witches remained apprehensive off him, he’d swayed them with his treatment of Cygnus. Most wizards his age would have been annoyed and short with a little firstie being constantly underfoot, but Harry had taken the boy under his wing like a little brother.\n\n\nOrion had thanked him for it, once. They’d been studying at the library with the rest of their roommates when Orion had knocked their shoulders together.\n\n\n“Hey.” Orion had said.\n\n\nHarry looked at him in inquiry.\n\n\n“Thanks for looking out for Cyg.” He chewed slightly on his inner cheek, “He was very nervous for Hogwarts.”\n\n\n“Of course.” Harry smiled, “I enjoy having him around.”\n\n\n“He adores you.”\n\n\nHarry laughed, “And I’m sure he’d kill you for telling me that.”\n\n\nAbraxas coughed, “If you ladies are done having your little heart-to-heart, can someone help me with this calming draught worksheet?”\n\n\nOrion had blushed and Harry sighed before pulling Abraxas’s homework closer to him and checking through it.\n\n\nRavenclaw, surprisingly, remained the house he was yet to befriend. \n\n\nThe claws were rather closed off in their ranks, it was almost like an entire house of Tom Riddles - aloof little geniuses who didn’t take kindly to outsiders. Harry remained a fond acquaintance to the majority of the house despite several endeavours to offer friendship. \n\n\nAfter two months of trying Harry chalked it up for a loss. He supposed he’d have to settle for three quarters of the houses, the only consolation was that Riddle had little to no support with the Ravenclaws either.\n\n\nThe Slytherin boys, after a month of continuously antagonising Harry, found out exactly why that was a terrible idea. He’d, admittedly, lost his cool. It was just one jinx too many, one comment that went too far. \n\n\nHis friendly smile had slipped off his face and he’d hexed them - nine seventh year boys, to be precise - six ways to sunday. None of them were able to leave the hospital wing for a week, and after their release, they didn’t even dare look Harry in the eye.\n\n\nSince then, the snakes felt content that Harry had \n\nearned\n\n his place. He’d passed some unspoken test that ensured he could do as he pleased with the support of his house. Harry didn’t question it, these vipers were weird.\n\n\nLately, Tom had been finding any excuse to sit near Harry. Snagging the seat next to him in the great hall or the library, asking him to be his partner before anyone else could even open their mouths. It was getting to the point where even the most obtuse Gryffindor was starting to notice.\n\n\nHarry endured it with an exasperated air. \n\n\nIn the original timeline, this would have been the year Tom Riddle opened the chamber of secrets and killed Myrtle Warren. It would have been the beginning of the end, the moment Tom killed Myrtle he would have stepped over a line, using her accidental death to split his soul. \n\n\nKeeping the boy occupied with his newest ‘obsession’ was certainly one way to prevent that series of events.\n\n \n\n\nDear Hadrian,\n\n\n\n\nHow is the castle, dear? The Manor is awfully lonely without you. Vincent is sitting beside me, reading over my shoulder, and he wants me to tell you that morning runs aren’t the same without you. Apparently I’m too slow to present a real challenge.\n\n\n\n\nWe’ve sent along a scarf, please ignore the quality of the stitches. Vincent is learning to crochet, he says it’s good for his finger dexterity, but he’d have to have a modicum of skill with yarn for that to be the case. Nevertheless, the material is delightful and sure to keep you warm.\n\n\n\n\nWe were pleased to hear you’d ended up in Slytherin, you are certainly ambitious enough - but I like to imagine that I had a hand in nurturing your cunning. Tell us more about your roommates and your other friends. Are there any girls that have caught your eyes? Boys? \n\n\n\n\nDon’t forget to study, Hadrian.\n\n\n\n\nLove,\n\n\n\n\nYour mother.\n\n\n\n“What in Merlin’s name is \n\nthat\n\n?” Abraxas gauffed as Harry dubiously held up what he assumed to be the scarf Vince had made. Though it more resembled a very long tangle of yarn, it \n\nwas\n\n as soft as Ronnie promised.\n\n\n“A scarf, I think.” Harry folded the letter and placed it in his satchel, “Apparently my pops has taken up crochet. He is… not good at it.”\n\n\nOrion lifted a corner of the ‘scarf’, “I’ll say. It looks like my mother’s kneazles yarn ball.”\n\n\nCygnus reached over to touch it, “Very soft, though.”\n\n\n“It’s the thought that counts, I suppose.” Harry said, wrapping the monstrosity securely around his neck.\n\n\n“You’re not actually going to wear that.” Rudolph sounded aghast.\n\n\n“Of course I am,” Harry sniffed good naturedly at him, “I think it’s rather sweet of him.”\n\n\n“I agree.” Melani Greengrass added from beside him, “It’s so nice of him to think of you.”\n\n\n“\n\nThank\n\n you, Melani.” Harry smiled, ignoring Rudolph’s offended scoff.\n\n\nHarry was, honestly, very touched by the gift. \n\n\nThe longer he spent in the past, the more he came to think of Vince and Ronnie as his parents. They cared for him, taught him, and inquired after his wellbeing. And now they were sending him gifts - little things to remind him they cared. It was all he could do to not burst into tears.\n\n\nHe’d pen out a letter to send home later. \n\n\nRonnie had been overjoyed to hear he’d been placed in the snake den - Harry suspected this was due to a bet they thought he didn’t know about, Ronnie had bet Slytherin and Vince had put his money of Gryffindor - and wanted to know all about his experience so far. Vince had mostly just asked if he was keeping up with his exercise and if he’d been having any trouble.\n\n\nHe’d been happy to report a yes and no respectively to Vince’s questions, as well as filling Ronnie in on as much Hogwarts gossip as he could.\n\n\nWhich was a lot. Apparently sewing time was also designated gossip time, who knew?\n\n\n“Hadrian!” \n\n\nHarry perked up at the sound of Fleamonts voice. Said boy was standing by the entrance to the great hall, quidditch gear in hand.\n\n\n“We’re going to play a friendly game, you want in?” He shouted across the hall.\n\n\nHarry shot him a thumbs up in response, shouting back would be far too undignified for a Slytherin, even one like him.\n\n\n“Well, see y'all later then.” He said to his housemates, receiving a chorus of goodbye’s and eyerolls.\n\n\n“I don’t know why you’d want to play that game with the lions, of all people.” Riddle piped up from where he’d been sitting in front of Harry.\n\n\nHarry shrugged, “Stuff it, Riddle.”\n\n\n“I do have to agree with Tom,” Orion frowned, “\n\nMust\n\n you associate with \n\nthem\n\n?”\n\n\n“You know,” He said, swinging his satchel over his shoulder and standing up, “They say the exact same thing about y’all. They’re just people, and they’re fun. I like them.”\n\n\nLucretia sighed and shook her head, “How you didn’t end up in Hufflepuff is the world's greatest mystery.”\n\n \n\n“Peverell.”\n\n\nHarry spun on his feet, whipping his wand out and placing it against Riddle's throat before he even fully registered who had followed him. He’d heard the footsteps, of course, but he hadn’t the faintest clue as to who was stalking him through the library.\n\n\nHe should have known.\n\n\n“Riddle,” Harry greeted, he didn’t remove his wand, “Why are you following me?”\n\n\n“I misjudged you -”\n\n\n“I’ll say.”\n\n\nRiddle narrowed his eyes, “I \n\nmisjudged\n\n you. You are clearly more powerful than I gave you credit for, and you have my apologies for that.”\n\n\n“Hmm.”\n\n\nTom made a sound in the back of his throat that was a cross between a groan and a growl.\n\n\n“Don’t you have \n\nanything\n\n to say?”\n\n\n“What do you \n\nwant\n\n me to say, Riddle?” Harry cursed the fact that Riddle was tall enough to practically tower over him, even with the height he’d gained from the blood adoption. He had to tilt his head backwards just to meet Tom’s eyes.\n\n\n“I \n\nwant\n\n you to join me.”\n\n\n“\n\nExcuse\n\n me?”\n\n\n“Join me, Peverell. Join the Knights of Walpurgis and help us cleanse the wizarding world.”\n\n\n“Riddle, dear.” Harry said slowly, “Do I \n\nlook\n\n like a blood supremist to you?”\n\n\n“They are ruining our world.”\n\n\n“That’s not their fault,” his voice turned softer, gentler, and he lowered his wand, “It’s not like there’s any classes for them to learn our traditions and culture, and all y’all sneer and hex them when they try and ask you for help. How are they supposed to learn?”\n\n\nTom scowled, “\n\nI\n\n learned.”\n\n\nHarry laughed right in his face, “You, Riddle, are an incredibly terrifying being of superior intellect. You cannot seriously hold the average muggleborn to the same standard?”\n\n\n“I - well.” He huffed.\n\n\nHarry sighed, “I agree that way of life needs to be preserved, Riddle. Just… I don’t think I can get behind what you’re planning to do to achieve that goal.”\n\n\nHarry could practically see the thoughts churning in Tom’s head. He’d taken a risk, just now, revealing his thoughts and feelings on the topic. Despite his rather open friendships with many muggleborn students, he’d never formally declared his beliefs.\n\n\nAnd that was what he’d just done: a declaration of intent.\n\n\nTom could turn from him totally. He could give up on Harry so easily - and Harry hated how horrible that thought made him feel.\n\n\nFinally, Riddle said, “Tom.”\n\n\nWhat.\n\n\n“What?”\n\n\n“Call me Tom.” He said, “I will consider what you have said.”\n\n\n“Alright then, Tom,” This was going better than he’d ever considered, “You may call me Hadrian.”\n\n\nTom took a step back, and Harry really hadn’t noticed that they’d practically been standing chest to chest until Tom suddenly wasn’t there anymore.\n\n\n“I’ll see you at Dinner?” Tom said.\n\n\nHarry agreed, breathless “Yes, I suppose you will.”\n\n \n\n“So,” Pomona said, leaning against him in a way that would make most Slytherins blush, “I hear you’re finally calling Riddle by his first name.”\n\n\n“Aw, not you too, Mona.” Harry groaned, tossing his quill onto his unfinished Charms assignment, “The girls didn’t let up for a moment on Saturday.” \n\n\nShe shrugged, “It’s been a slow year, this is the biggest gossip since Polly got knocked up.”\n\n\n“Polly from Gryffindor?”\n\n\n“Yeah.” She sighed, “Poor girl, her parents forced her to marry the guy.”\n\n\nHarry scoffed, “That’s ridiculous.”\n\n\n“You’re preaching to the choir, mate.” Pomona visibly shook herself out of that train of thought, “Anyway, what happened with you? I thought you hated Riddle.”\n\n\nHarry nodded at her, “I did.”\n\n\n“What changed?”\n\n\n“He listened to me, I suppose.” Harry tilted his head, “I argued on behalf of muggleborns and he listened - even \n\nOrion\n\n still gets into hissy fits whenever I even mention my muggleborn friends.”\n\n\nPomona narrowed her eyes at him, then smiled wide “Ohh.”\n\n\n“What?” Harry inquired sharply, he did \n\nnot\n\n like that look in her eyes. “What is it?”\n\n\n“You like him!” Pomona said victoriously, “Jackie owes me a galleon!”\n\n\nHarry didn’t feel bad at all when he shoved her out of her chair.\n\n \n\nHarry wasn’t quite sure whether Hogwarts had faced a sharp decline in the local snake population over the next five decades, or if the scaly buggers were drawn in by the heir of Slytherins presence, but he could scarcely walk for ten minutes before spotting a nest or two.\n\n\nHe’d lasted all of four months, right up until a week before the Christmas hols, before news got out that he could talk to snakes.\n\n\nCygnus and him had been running early on a Saturday morning. The boy had taken to joining him on the weekends, so Harry took it as an opportunity to do a more relaxed routine so as to not overwhelm Cygnus.\n\n\nThey’d just finished their last set when Cygnus had tripped right over an adder snake. He’d yelped, jumping backwards so violently he’d landed himself on his ass. The snake, for her part, had cursed Cygnus out so beautifully and vibrantly that Harry couldn’t help but laugh.\n\n\n“\n\nThat was amazing\n\n,” Harry said, “\n\nTruly inspired.”\n\n\n\nThe adder bobbed her head, making a sound that Harry associated with an offended sniff, “\n\nSee that your hatchling learns not to stomp all over the place.”\n\n\n\n\n“He’s not my hatchling, more like a nestmate.”\n\n\n\nThe adder was not impressed,\n\n “If he does that again, I will bite him.”\n\n\n\nHarry sobered up slightly, “\n\nI will see to it that he doesn’t.”\n\n\n\nThe adder nodded and slithered away.\n\n\n“You - you just…” Cygnus stuttered, pointing back and forth between Harry and the snake. Eventually a strangled noise left his throat.\n\n\n“Yes, Cygnus.” Harry sighed, “I am a parselmouth.”\n\n\nCygnus frowned, and Harry caught a glimmer of hurt in his eyes, “But why didn’t you \n\ntell\n\n me?”\n\n\n“Because it’s not that big of a deal outside of Britain.” Harry sighed.\n\n\nCygnus blinked, “What?”\n\n\n“Parselmouths are a dime a dozen in India, even America has a few hundred of us.”\n\n\n“But I thought…”\n\n\n“That it was a Slytherin line specific skill and only Salazar’s descendant could possess the trait?”\n\n\n“I - yes.”\n\n\n“Which is exactly \n\nwhy\n\n I didn’t tell anyone, I didn’t want to set tongues wagging.” Harry reached out to help him up, grinning when Cygnus didn’t even hesitate to grab it, “You’ve got to start looking outside your little bubble of the world, kid. There’s more out there then what your parents have told ya.”\n\n\nCygnus still looked fairly shell shocked, but nodded slowly, like he was actually thinking about what Harry had said.\n\n\nOf course, by the end of the week everyone and their mother knew he was a parselmouth. \n\n\nNo matter how much Cygnus looked up to Harry, there was no way the boy would be able to keep that juicy bit of gossip from his cousins, and then they’d tell their friends and everything would spiral from there.\n\n\nUnlike his second year, people looked at him with interest and slight awe, rather than fear and disgust. He’d lost count of the times he’d had to deny any relation to the Slytherin bloodline in the days before the Hogwarts train left for London. By the time Riddle approached him he’d had it up to here with the questions.\n\n\n“Look,” Harry said shortly, before the other boy even opened his mouth, “\n\nYes\n\n, I am a Parslemouth. \n\nNo\n\n, I am not related to Salazar Slytherin. \n\nYes\n\n, that is possible. Do you have any other damn questions?”\n\n\nRiddle looked more amused by his outburst than offended, which somehow only served to irritate Harry further.\n\n\n\n“It’s good to meet another parselmouth.” \n\nhe said and Harry blinked.\n\n\nHe’d known, of course, that Tom Riddle was a parselmouth. He’d just never expected the boy to so easily divulge that information.\n\n\nHarry smiled slowly, “\n\nyes. Yes it is.”\n\n\n \n\nHis arrival back to London was met with a cheerful group hug from both Ronnie and Vince. They’d practically ambushed him the moment he’d stepped out of the train, all but tackling him to the floor with laughs and forehead kisses.\n\n\n“Oh we \n\nmissed\n\n you,” Ronnie pulled him in for a second hug, “sweet boy.”\n\n\nHarry was grinning so brightly that his cheeks hurt, “I missed you guys too.”\n\n\n“Hadrian!”\n\n\nHarry turned his head at the sound of his name, seeing Orion and Lucretia leading two people he assumed were their parents. Orion bowed to Vince and Ronnie while Lucretia offered her hand for a light shake.\n\n\nHarry bowed to both Lord and Lady Black, “Merry meet.” He said.\n\n\n“Merry meet, heir Peverell.” Lord Black inclined his head, offering his hand to Vincent, “Lord Peverell, Lady Peverell.”\n\n\nBoth Vince and Ronnie gripped his offered wrist, repeating the gesture with Lady Black.\n\n\n“Merry meet,” Vincent said, “Both of you.”\n\n\n“My family and I wish to extend an invitation to our annual yule ball.” Lord Black said after a moment.\n\n\nVincent smiled kindly at him, “We accept your invitation.”\n\n\nLord Black passed him a slip of card, “This will act as a portkey to our manor. We will see you then.”\n\n\n“Good bye!” Lady Black offered before the entire family apparated away.\n\n\nThe three Peverells blinked in surprise at the abrupt exit.\n\n\n“Well,” Harry said after a beat, “That was interesting.”\n\n \n\n“Stronger Harry!” Vincent shouted from the sidelines, “Ronnie is barely putting half her power into those spells!”\n\n\nHarry grunted as Ronnie shot spell after spell at his rapidly dwindling shields. Bloody fucking hell. He’d forgotten just how impressive both his guardians were on the dueling ground, a couple of months of dealing with fifteen year olds and he’d fallen behind on his training.\n\n\nRonnie shot a purple spell which he knew to be painful as hell and Harry dodged. Twisting away rather than relying on his shield to protect him. Ronnie was entirely on the offensive at this point. They’d been at it for fifteen minutes, and she’d gained the upper hand after five.\n\n\nHe was honestly surprised he lasted as long as he had.\n\n\nRonnie whispered a spell and Harry knew it was over for him.\n\n\nIf either of his guardians had to actually say a spell out loud, then that spell was more than likely to be far too powerful for him to block.\n\n\n“Fuck.”\n\n\nA brilliant white light poured out from Ronnie’s wand, forming a whip of pure magic that she easily flicked. It shattered his shields on impact and wrapped itself around his leg, yanking him forwards and up until he was hanging upside down with his wand lying on the floor where he’d dropped it.\n\n\nRonnie wasn’t even sweating.\n\n\nHarry sighed, not even surprised. “I’m \n\nnever\n\n going to beat you.”\n\n\n“Nonsense,” Ronnie said, releasing the spell and watching as he dropped to the floor, “I have nearly twenty years of dueling experience. You have two. It’ll just take time, that’s all.”\n\n\n“Time I don’t have!”\n\n\n“Oh that’s hogwash,” She said, “You are well ahead of anyone in your age group, hell I’d wager you’re more advanced than the entire auror department.”\n\n\n“She’s right kid,” Vince came forward and helped him to his feet, “You can’t judge your progress against us. We were specialised hit wizards, you are a student - albeit a rather extraordinary one. Were it not for your fame and the whole time travel thing, I’m sure the organisation would have approached you as well.”\n\n\n“As is, you’re learning from some of the best in the business.” Ronnie finished, “You’ll get there.”\n\n\nHarry puffed out his cheeks and blew the air out, “Alright, fine. Give me ten minutes and we can go again.”\n\n\nRonnie smiled, “five.”\n\n\n“Fine.”\n\n \n\n“Hello Hadrian.”\n\n\nHarry inclined his head, “Riddle.”\n\n\nThe boy in question stood in front of him wearing midnight blue dress robes that made him look entirely too handsome. \n\n\nAround them, the Black yule ball was in full swing. Crystalline snowflakes and little magical flurries decorated the entirety of the ball room, creating an utterly gorgeous scene. Couples were spinning and swaying on the dance floor, and Harry couldn’t look away from Tom.\n\n\n“Have you thought about what I’ve said?” Tom said, holding out his hand to Harry, palm up - an offer to dance.\n\n\nHarry placed his hand in Tom’s and allowed him to lead him to the dancefloor.\n\n\n“Have you thought about what \n\nI’ve\n\n said?” Harry echoed, placing one hand on Tom’s shoulder and distinctly \n\nnot\n\n shivering when Tom put a hand lightly on his hip.\n\n\nTom was leading the dance, Harry easily followed, “I have.”\n\n\n“And.”\n\n\n“I suppose you are… correct.” The admission seemed almost painful, causing Harry to laugh lightly.\n\n\n“That wasn’t so difficult to get out, now was it?”\n\n\nRiddle snorted, “I asked around. Asked the purebloods exactly what their problem was with mud-muggleborns.”\n\n\n“And they said exactly what I said?”\n\n\n“They said exactly what you said.” Tom confirmed, “I will admit I had never considered the motivation behind their hatred.”\n\n\n“I could tell,” Harry said, “And how has this information affected your plans.”\n\n\n“We need to educate them.”\n\n\n“Obviously. Have you put any thought into \n\nhow\n\n?”\n\n\n“I don’t need to,” Tom said, twirling Harry out before pulling him back to his chest, “Because \n\nyou\n\n already have.”\n\n\nDamn him. \n\n\nHe was right, of course. Harry had been subtly teaching the more open-minded of the muggleborns both wizarding culture and traditions, and he had plans for a magical primary school that his parents were currently working on introducing to the Wizengamot.\n\n\n“I never said I’d join you.”\n\n\n“You never said you wouldn’t.”\n\n\nThe song came to a close and they bowed to each other.\n\n\n“I will not be your servant.” Harry said seriously as they made their way off the dancefloor.\n\n\n“You do not have to be a follower to join me.”\n\n\nHarry must have misheard, “Pardon?”\n\n\nTom smiled, “You could lead. \n\nWith\n\n me.”\n\n\n“I -” Harry must have been gaping because Tom’s smile grew gentler. The future dark lord lightly tapped the bottom of his chin, closing his mouth for him.\n\n\n“Think about it.”\n\n\nAnd with that he disappeared into the crowd, leaving Harry to recover in peace.\n\n\nA peace that was interrupted less than twenty seconds later.\n\n\n“Sweet Circe!” Lucretia said next to his ear, “I have \n\nnever\n\n seen such an intense foxtrot.”\n\n\n“I’m not exactly sure what just happened.” Harry mumbled. \n\n\n“Well \n\nI\n\n am,” Walburga suddenly appeared on his other side. “I’m sure Riddle is looking for your father to secure a betrothal contract right this second.”\n\n\n“What!?” Harry yelped.\n\n\n“Oh don’t act like that, Hadrian,” Lucretia swatted his shoulder, “He’s hardly the first.”\n\n\n“\n\nWhat\n\n?!”\n\n\nLucretia hummed, “I’ve heard that cousin Pollux offered your parents quite the sum for your hand.”\n\n\nHarry blinked, shellshocked, “\n\nWhy\n\n is this the first I’m hearing of this?”\n\n\n“Oh they refused, don’t worry.” Lucretia patted his hand, “They said something or another about you choosing your own spouse, you lucky bastard.\n\n\nHarry blew out a breath of relief, “Oh thank god.”\n\n\nWalburga scowled, “I’m set to marry Orion, can you believe it?”\n\n\n“But he’s your \n\ncousin\n\n!” Harry said. He’d known, of course, that this was coming. But perhaps his influence would be enough to spare both his friends the pain of marrying each other. “Do you even know what effect that would have on your children?”\n\n\nWalburga turned a sharp eye to him, “What do you mean?”\n\n\nBingo.\n\n\nHarry fought down a smirk. If nothing else, the wizarding world cared about their children.\n\n\n“You know that you acquire traits from both your parents, right?” Harry continued when both girls nodded, “So when two people who are closely related, such as \n\ncousins\n\n, have children together there is a decreased amount of genetic diversity in the child.”\n\n\n“Genetic diversity?”\n\n\n“It’s a muggle term,” Harry rolled his eyes at their identical scowls, “Grow up, both of you. They have done far more research into this than we have. They have proven over and over that inbreeding causes an uptick in genetic disorders, infant mortality and a decrease in fertility. Most muggle governments actually have \n\nlaws\n\n against marrying family”\n\n\n“What?” Walburga muttered hollowly. \n\n\n“Why do you think most pureblood families struggle to have more than two children per generation, while families like the Weasleys, who often take in new blood, are known to be hyper fertile.”\n\n\nWalburga dragged a hand through her carefully done up hair, “Oh, Merlin. Hadrian you said there was research done?”\n\n\nHe nodded, “Lots of it.”\n\n\n“Could you owl some of it to me?” \n\n\n“Me as well, please.” Lucretia said, “Perhaps my parents won’t be so eager to sell my hand after all.”\n\n\n“Of course, I’ll have it for you by tomorrow evening.”\n\nWalburga reached forwards and gripped his hand, “Thank you, Hadrian.”\n\n“Anytime, Walburga.”\n\n \n\nThe rest of the ball was rather uneventful.\n\n\nThree more wizards and at least fifteen witches managed to corral him onto the dance floor. Now that Walburga had cottoned him onto the fact that he was considered one of the most eligible bachelors in Britain, the thinly veiled flirtations of his partners no longer went over his head, leaving him feeling rather awkward for the majority of the evening.\n\n\nThroughout the night Harry could practically feel Tom’s eyes burning into him whenever he was dragged into a dance and he almost wept for relief when Vincent found him and informed him that it was time to head home.\n\n\nThe Peverells bid the Black family farewell and used the floo network to get back home.\n\n\n“I cannot believe you guys didn’t tell me that people want to \n\nmarry\n\n me!” Harry said as soon as they closed the floo connection.\n\n\nRonnie laughed, right in his face, “Honey, have you \n\nlooked\n\n in the mirror? You’re the handsome, powerful, heir to one of the most powerful families in Britain. Of \n\ncourse\n\n people want to marry you.”\n\n\n“I still feel I should have been informed.” He pouted.\n\n\n“Why does it matter?” Vince said, “We’ve told everyone the same thing: you’ll be choosing your own spouse.”\n\n\n“Thank you. For that.” Harry muttered.\n\n\nRonnie ruffled his hair and grinned mischievously, “Though, we did get a rather interesting request this evening.”\n\n\nHarry groaned, already knowing where this was going. \n\n\nVincent smirked at his wife, “Yes, from a young gentleman: a mister Tom Riddle. I was almost tempted to say yes after seeing the two of you dance together.”\n\n\n“Dad!” Harry cried, swatting him with the nearest available pillow.\n\n\nThey all laughed before freezing as one.\n\n\n“You called me…” Vince said.\n\n\nHarry swallowed the lump in his throat. He’d thought of them both as parental figures for months now, but that was the first time he’d said it out loud without an audience.\n\n\n“Is that - I \n\ndo\n\n think of you, both of you, as my parents.” Harry stuttered through, “Would - do you mind if I…?\n\n\n“Oh Harry,” Vince said, throwing his arms around his son and pulling him in for a hug, “Of course you can call me ‘dad’. It would be an honor to be your father.”\n\n\nRonnie joined the hug, circling her arms around both of them.\n\n\nHarry felt loved.\n\n \n\n“Hadrian!”\n\n\n“Walburga, Lucretia!” Harry smiled in response, “Merry meet, the both of you. How was the rest of your break?”\n\n\n“Merry meet,” The girls said in sync.\n\n\n“It was lovely.” Orion said as he and Cygnus came up behind Harry, and the five of them clambered into a carriage together, the boys greeted Harry as they got in. “Walburga and I are no longer engaged!”\n\n\nHarry's grin momentarily faltered - had he just meddled his godfather out of existence? - but looking at Orion and Walburga cheerfully celebrating the dissolution of their betrothal, he couldn’t bring himself to regret it.\n\n\nHe’d been in the past for months now, almost certainly making it so that certain people who’d never have crossed paths in the original timeline had now met and fallen in love, possibly causing the birth of hundreds of children who should never have existed. He’d probably erased just as many from history.\n\n\nSirius had been a good man, he’d loved Harry.\n\n\nBut Walburga and Orion didn’t deserve to suffer through an unwanted marriage just so he could exist.\n\n\n“Congratulations, you two.” Harry smiled at them both.\n\n\n“From what I hear,” Orion said, “You are the main reason for it. I cannot thank you enough.”\n\n\n“Oi!” Walburga gently smacked his shoulder, “You make it sound like I’m a horrible beast!”\n\n\n“Oh come off it, Burga. You wanted to marry me even less than I wanted to marry you.”\n\n\nShe sniffed, “I suppose.”\n\n\nThe entire carriage burst into laughter.\n\n\n“You’ll be happy to know, Hadrian,” Lucretia pulled his attention, “that our parents have elected to share that research around. I think we’re in for a wave of broken betrothals.”\n\n\n“Happy to help.”\n\n \n\n“Welcome back, Students!” Professor Merrythought said as soon as everyone was present, “Don’t bother sitting down, it’s a practical lesson today.”\n\n\nHarry grinned, Merrythought was honestly his all time favorite Hogwarts Professor - mostly because the ratio between practical and theory classes were 5:1.\n\n\n“Alright, kiddies.” She said with a grin, “Who can tell me what the patronus charm is?”\n\n\nA ravenclaw from the back got called on. “It’s a light charm, Professor. Used to protect against dark creatures such as lethifolds and dementors, if performed correctly you’d produce a partially tangible energy force, taking the shape of an animal that represents you.”\n\n\nHarry stuck his hand in the air, speaking only when the professor nodded at him, “Actually, the Patronus charm would be classified under Grey magic. As it is highly dependent on your emotions even though it still feeds off latent magic. And your patronus may also change to reflect someone you love.”\n\n\n“That is correct Mr Peverell. Five points to both ravenclaw and slytherin.” Professor Merrythought swirled her wand and shouted, “Expecto Patronum!”\n\n\nA large black bear burst forward from her wand, taking a lap around the room before returning to the professors side.\n\n\n“Right, \n\nthat\n\n is how you perform the spell, is anyone confident that they can produce a corporeal patronus?”\n\n\nWhen nobody answered, Harry hesitantly raised his hand up.\n\n\n“Mr Peverell! Come forward and show us then.”\n\n\nThe crowd of students parted to allow him to walk forwards. He kept his stride steady, not portraying any of the sudden nerves he was feeling on his face.\n\n\n“Whenever you’re ready, Peverell.” The Professor said.\n\n\nHarry took a deep breath, recalling the first time Ronnie and Vince had told him they loved him, and said firmly, “Expecto Patronum!”\n\n\nThe familiar form of Prongs burst through his wand. The stag proudly reared his antlers, taking a gallop around the room before coming to nuzzle Harry. \n\n\n“Hello there.” Harry said.\n\n\n“Ten points to Slytherin! Well \n\ndone\n\n, Mr Peverell.”\n\n\n“Thanks Professor!” \n\n\nHarry let go of his hold on the magic and Prongs dissipated with a snort.\n\n\n“Everyone else, practice the charm. You’ll need to recall your fondest memory, something that fills you with joy, then cast the spell. Mr Peverell, help your peers.”\n\n\nHarry wandered around, nudging a couple of his classmates in the correct direction, before he made his way to Tom, who couldn’t seem to produce more than a smokey wisp.\n\n\n“You seem to be having trouble, Tom.”\n\n\nThe other boy growled, muttering something under his breath.\n\n\n“What was that?”\n\n\n“I said,” And it was barely higher than a whisper, “I haven’t got any happy enough memories.”\n\n\n“Look,” Harry said, “It doesn’t have to be something grand. One of my friends back in America, her happy memory was the first time her parents gave her muggle candy.”\n\n\nTom looked incredulous, “And \n\nthat\n\n was happy enough?”\n\n\n“It’s not the memory itself, Tom. It’s what it meant to \n\nyou\n\n.”\n\n\n“Hmm,” The other boy said, turning back to his task with a determined set to his frown. “Expecto Patronum!”\n\n\nHarry gasped as what was definitely a basilisk flew out of Tom’s wand. Gasps of shock echoed around the room as everyone paused to watch the snake make it’s round before dissipating.\n\n\n“You did it!” Harry grinned.\n\n\n“Five points, Mr Riddle!” Merrythought said cheerfully, “That’s all the time we have today, class. Keep practicing, I expect to see some improvement next week.”\n\n\nHarry walked out the door beside Tom, “What memory did you use, if you don’t mind me asking?”\n\n\nTom looked at him for a moment and his lips quirked in the slightest of smiles.\n\n\n“I thought of our dance.”\n\n\nHarry blinked, “You -”\n\n\n“Yes.” \n\n\nThey’d stopped dead in the hall, other students flowing around them until there was no one else besides them.Tom had his head dipped so that he could meet Harry’s eyes without him having to tilt his chin back.\n\n\nHarry swallowed, watching as Tom tracked the movement of his throat like a predator who’d finally cornered its prey.\n\n\nEverything felt intune to Tom. Like he was experiencing his own skin in relation to how close it was to Tom’s, like a static electricity had formed between their two bodies, pulling them closer.\n\n\nSuddenly, Tom smiled, full and wide and \n\nreal\n\n.\n\n\nIt took Harry’s breath away.\n\n\n“You’ve not made a decision yet, have you?”\n\n\nHarry didn’t trust his voice, if he even opened his mouth he’d probably swear himself into Tom’s eternal service, so he shook his head slowly instead.\n\n\n“That’s alright,” Tom said, he didn’t need to talk above a whisper, they were that close, “I’m not patient, Hadrian Peverell. But for you… I will wait.”\n\n\nHe swept off without another word. The bastard didn’t even look back to see Harry stumble backwards into the wall and sink to the floor.\n\n\n“Fuck.” he mumbled to nothing.\n\n\nThe agent was fucking right. That kind of charisma should be a crime, Harry couldn’t \n\nthink\n\n straight when they were alone together, especially not when Tom did that \n\nthing\n\n with his mouth. And God, Tom phrased it like it was only a matter of time before Harry accepted his offer - like it was bloody inevitable.\n\n\nWhat’s worse is that he was probably \n\nright\n\n.\n\n\nTom Riddle was changing. Little by little he was becoming less of a monster carefully concealed behind a porcelain mask and more of an actual person. Harry knew it, hell, most of the school knew it. Their roommates' hands were shaking decidedly less since the start of the school year, likely from a lack of crucios cast in their directions, and the once unapproachable boy could actually be seen \n\nlaughing\n\n. In \n\npublic\n\n.\n\n\nThe purebloods, tightly under his control, had started talking to muggleborns. Harry had honestly fallen flat on his face the first time he saw Rudolph laughing with Noreen, a hufflepuff muggleborn. With this development, house rivalry all but faded back to healthy levels of friendly competition.\n\n\nHarry almost couldn’t believe it.\n\n\nDumbledore's ever present scowl whenever he saw purebloods and muggleborns mixing was incredibly amusing, though. Most people, students and teachers alike, were confused by the transfiguration professors odd response to the end of hostilities between houses. Harry knew though, that he was mourning the loss of an easy following.\n\n\nWith the purebloods now being more receptive to any muggleborns who wanted to learn their ways, Dumbledore would never be able to act as their champion. As such, he’d lost hundreds of fanatic followers - a number that was exponentially more if one considered all the future muggleborns.\n\n\nAll of Harry's initial concerns about the future death eaters were currently null and void - hell, half his concerns by way of Dumbledore had been taken care of already thanks to Tom - and Riddle had offered partnership. Not a place at his feet or behind him, a \n\npartnership\n\n. \n\n\nWhat the hell was holding him back?\n\n \n\n\nDear mother and father,\n\n\n\n\nI don’t know what is wrong with me. \n\n\n\n\nBefore we broke for holidays Tom Riddle - yes, that Tom Riddle - asked me to join his little gang. I said no, of course, I have no desire to be a follower. And then he asked if I would be his \n\npartner\n\n, if you can believe it. He just told me to think about it. So I did.\n\n\n\n\nI explained how unfair it is that purebloods just hate muggleborns whilst making it impossible for them to learn our way.\n\n\n\n\nAnd he \n\nlistened\n\n.\n\n\n\n\nI swear guys, he took my advice and now the purebloods are actually talking to muggleborns. I can barely believe this is happening. And then yesterday Tom asked me again and I almost said yes. I don’t even know what I should be doing, I mean, he \n\nhas\n\n changed.\n\n\n\n\nWhat do you guys think I should do?\n\n\n\n\nLove,\n\n\n\n\nHadrian.\n\n\n \n\n\nDear Hadrian, \n\n\n\n\nHoney, of course he’s changed. \n\n\n\n\nYou are possibly the only person in the world who could knock Tom Riddle off his axis and turn him into a real boy. And you’ve been laying the seeds for change for months, you really shouldn’t be so surprised to see the fruits of your labour. \n\n\n\n\nAccept his offer, dear. \n\n\n\n\nLove, \n\n\n\n\nYour parents.\n\n\n \n\nThe O.W.Ls this time around were \n\nso\n\n much easier. \n\n\nHarry breezed through all of the practicals, easily finished most of the theory sections - with the obvious exception of runes, which still insisted on being a pain in his fucking ass - and was done with it all without a sweat.\n\n\nHis roommates, baring Tom, who was equally unflappable in the face of the second most important examinations they’d ever take, could hardly stand to be in the same room as him in the week preceding the exams.\n\n\nIt honestly seemed no time at all before school was coming to a close. \n\n\n“Tom.” \n\n\nHarry looked up from his book at the sound of Orion's voice to see Tom standing in the doorway of their compartment.\n\n\n“Hello everyone.” Tom said, glancing quickly around the compartment and catching his eyes, “Hadrian, could I steal you for a moment?”\n\n\n“Yeah,” Harry answered before he could think, “yeah, sure.”\n\n\nTom nodded, holding the door open for Harry as he placed the book on the couch and walked out after him. Tom led him to an empty compartment, not saying a word until the door was shut behind them.\n\n\n“Hadrian,” He said, stepping into his now familiar position of far too close to Harry for comfort. “I said I could wait, and I have, but I \n\nneed\n\n an answer, one way or another.”\n\n\n“Yes.”\n\n\nTom gaped, “yes?”\n\n\n“I will be your \n\npartner\n\n, Tom.” Hadrian clarified, “Nothing less.”\n\n\n“That’s perfect.” Tom was smiling so wide Harry would call it a grin if he wasn’t referring to a would-be dark lord. He stepped closer and closer to Harry, backing him up until he was pressed against the compartment door. \n\n\n“Tom,” Harry all but whispered.\n\n\n“You said you wanted to be my partner?”\n\n\n“I did.” \n\n\nTom hesitated, “In all meanings of the word?” \n\n\nHarry gasped as Tom reached a slow hand up to gently cup his cheek.\n\n\n“I -” Harry fumbled for the words, huffing at his own inability to form thoughts when Tom was this close and settled for grabbing the back of his neck, yanking him down so he could plant a firm kiss on his lips.\n\n\nTom “hmffd’ in surprise but kissed back instinctively. Harry wrapped his arms around Tom's neck while Tom gripped his hips so tightly it should have been painful. An intimate echo of the positions they had both taken in their dance at the Black ball.\n\n\nIf he was having trouble thinking clearly when Tom was talking to him before, his head was now entirely empty. He couldn’t even tell you how long they’d been kissing before they were eventually forced to separate for air. Tom rested his forehead against Harry’s, the both of them breathing practically into each other's mouths. \n\n\n“I’ll take that as a yes then.” Tom mumbled.\n\n\nHarry laughed lightly, “yes, you idiot. \n\nYes\n\n. I don’t know how you could possibly misinterpret th-”\n\n\nTom kissed him again to shut him up.\n\n \n\ncome say hi on tumblr\n"
}