{
    "id": "26736988",
    "url": "https://archiveofourown.org/works/26736988?view_full_work=true",
    "author": [
        "alltimecharlo"
    ],
    "title": "got a thing about you (and it won’t go away)",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Video Blogging RPF"
    ],
    "relationships": [
        "Clay | Dream/GeorgeNotFound (Video Blogging RPF)"
    ],
    "characters": [
        "Clay | Dream (Video Blogging RPF)",
        "GeorgeNotFound (Video Blogging RPF)"
    ],
    "additional_tags": [
        "Hoodies",
        "Height Differences",
        "Fluff",
        "Cute",
        "Pining",
        "Blushing",
        "Low-key Oblivious George",
        "They have crushes on each other tho♡",
        "Pet Names",
        "Flirting",
        "Tooth-Rotting Fluff"
    ],
    "language": "English",
    "series": "Part 1 of got a thing about you",
    "published": "2020-09-30",
    "completed": "2020-10-16",
    "words": "24,275",
    "chapters": "6/6",
    "comments": "895",
    "kudos": "14,097",
    "bookmarks": "1,786",
    "hits": "219,236",
    "summary": "<p>George is joking when he tells Dream to send him one of his hoodies. </p>\n<p>This doesn’t mean he regrets it when he actually does.</p>\n<p>George forgets he’s wearing Dream’s hoodie on stream.</p>\n<p>Dream and George make a bet. The outcome is better than George could’ve ever wished for.</p>\n<p>The day has finally come for Dream and George to meet in person. Cuteness ensues.</p>\n<p>Dream and George’s first day out in London together leads to some unexpected, but certainly not unwelcome, developments.</p>\n<p>As their time in London together draws to a close, Dream surprises George with a date.</p>",
    "notes": "<p>-title from ‘real love song’ by nothing but thieves</p>\n<p>hello :) it’s my first time writing for these two so pls be nice but i’ve just completely fallen in love with them! </p>\n<p>obviously no disrespect is meant to dream or george and their irl relationship through this fic &lt;3</p>\n<p>hope you enjoy!</p>\n<p>[Now with <a href=\"https://twitter.com/asian_trash/status/1311741388271218688?s=21\" rel=\"nofollow\"> adorable art</a> by @aSIaN_trash on Twitter!]</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>hello!</p>\n<p>i’m so happy and amazed that there was such a positive reaction to chapter one!!</p>\n<p>many of you asked for me to add to this fic, so i have! i’ll probably be adding more instalments in the future too if all goes well :)</p>\n<p>hope you enjoy ♡</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>again, let me know if you want more! i’m always open to suggestions of ideas and things you may want to see too ♡</p>\n<p>kudos and comments are always appreciated, thank you for reading :)</p>\n<p>hellooo</p>\n<p>i’m back with another chapter! thank you so much for everyone’s lovely comments &lt;3</p>\n<p>don’t worry because there’s definitely more on the way with this fic!</p>\n<p>hopefully you enjoy :)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>I’M SO EXCITED TO WRITE THE NEXT PART ♡ </p>\n<p>i’m sure you guys will love it ;) be sure to let me know if there’s anything in particular you want to see and i might manage to weave it in for you, hehe</p>\n<p>hellooo</p>\n<p>i’m sorry this took a little longer than the every two days updates i was trying to stick to, but this chapter is about twice the size of the others so i hope that makes up for it!!</p>\n<p>enjoy &lt;3</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">more notes</a>.)\n</p>\n<p>thank you so much for all the amazing support on this fic!! i love you all so much ♡ </p>\n<p>i think this will end up being about six chapters in total. as always, if you have any ideas or anything you want to see in particular in this fic don’t be shy to share!</p>\n<p>heyyy</p>\n<p>another long update for you all! thank you for the support as always &lt;3 </p>\n<p>enjoy!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">more notes</a>.)\n</p>\n<p>i’ve been thinking about adding a companion fic to this series of some moments from dream’s pov and maybe a little extra carrying on from this fic?</p>\n<p>let me know what you think/if you’d be interested in reading! ♡</p>\n<p>hellooo everyone</p>\n<p>sorry this chapter took a little longer but it’s the last one so i wanted to ensure it was perfect ♡ </p>\n<p>hope you enjoy!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">more notes</a>.)\n</p>\n<p>the journey has come to an end for now, but don’t fret as there will be more on the way in the future in the form of a dream pov companion fic! </p>\n<p>i’m so extremely grateful for all the amazing support i’ve been given over the course of writing this fic and all your lovely comments that fuelled me :)</p>\n<p>see you again soon &lt;3</p>\n<p>thank you so much for reading ♡ </p>\n<p>kudos and comments are always appreciated!!</p>\n<p>i’m <a href=\"https://mobile.twitter.com/dreamingogy\" rel=\"nofollow\"> @dreamingogy</a> on twitter if you want writing updates or just to say hi!</p>",
    "text": "“Dreeeeeam,” George protests for the umpteenth time tonight, “Stop.”\nDream continues anyway, hitting George playfully in game as he attempts to collect food.\n“Nope. Not until you admit it.” The man in question drawls out happily, still prancing around and not leaving George to his task.\n“What?”\n“That I’m soooo much taller than you.”\nGeorge retaliates, hitting Dream as he snorts.\n“You’re not soooo much taller than me,” He points out, mimicking Dream’s tone, “Only by, like, a couple inches.”\n“More like a couple feet.”\n“Shut up.” George whines, turning to his monitor currently displaying TeamSpeak as if he’ll be able to stare down it to glare at Dream’s real face.\nHow they’d got onto this topic, he doesn’t even know. George just knows that Dream really likes that fact that he’s taller than him, and for the unspoken record, maybe George secretly does too. \nDream breaks him out of his trail of thought by asking, “I wonder how much bigger one of my hoodies would be on you.”\nHe says it nonchalantly. As if George is able to respond to that in a normal person way. \nIn the end, he settles on joking, “Send me one then.” As he powers on with his game.\n“Okay.” Is all Dream says in return.\n \n~\n \n“DREAM,” George exclaims, admittedly rather loudly, down their now connected Discord call, “I was joking.”\nHe hears a small, stifled laugh down the mic before Dream answers him.\n“Well, I wasn’t.”\nGeorge can only sigh again as he glances back down to the half-opened package in his hands. The label indicating that it had come from America had highly stimulated George’s curiosity as to what it contained. \nHe’d briefly considered that maybe it was a part for his PC he’d ordered that he’d forgot about, but upon carrying it back home from the post office, he’d soon found out that it was definitely too soft for that. \nWhen he’d got home and split the edge of the package open carefully, as soon as George had seen the soft fabric and hood of a jumper he’d just known what had happened. Dream had happened.\n“I had to go all the way to the post office to collect this, as well,” George continues complaining, mainly to himself, as he pulls the rest of the hoodie out of its packaging, “How long did it take to arrive? Like, two weeks?”\nDream wheezes out of the speakers of George’s setup.\n“I’ve been waiting for ages for it to arrive. I even paid for express delivery.” The other man sounds strangely proud of himself for doing so.\nGeorge finally untangles it all and chucks the packaging to the side for now. Holding the pale blue jumper up in the view of the camera he’d now turned on for Dream to see, George suddenly realises how big it actually is.\nHiding his expression of surprise behind the jumper from the camera, George mentally admits to himself that maybe Dream is so much taller than him.\n“You’ve got to be kidding.” \nGeorge laughs out, laying the soft fabric across his lap. It’s not until he brings it away from his face, that George realises the hoodie has a particular smell. His brain that quickly follows this with the realisation that this is probably what Dream smells like. \nHe desperately resists the strong urge to lift the material back up to his nose; missing the warm scent of ambrosial sandalwood that had ambushed him beforehand.\n“Not kidding,”\nDream sing-songs back to him playfully, tone excited.\n“That’s one of my favourites, George. Be careful with it.”\nFeeling pressure suddenly hanging over him, George’s voice jumps higher as he exclaims, “Why would you send me one of your favourites?”\n“Because.”\nDream helpfully answers, remaining silent after until George glances down at the jumper again before looking directly down the camera lens, giving him a death stare. The other man lets out a free laugh.\n“C’mon then,” He urges, “Put it on.”\nGeorge makes a face when he brings the jumper up to his nose to dramatically sniff and teases him, “Did you even wash this, Dream?”\nThis time, it’s Dream’s turn to whine out a protest of ‘shut up’. George forces himself to maintain a mildly disgusted face for the camera when, in reality, the scent from Dream’s hoodie is perhaps one of the most inviting and safest he has ever encountered.\n“Of course I did. Now c’mon.”\nDream’s tone is still whiny, dragging out the last syllable until George interrupts with an exclamation of, “Okay, okay!”\nPractically able to hear the large grin in Dream’s chuckles as he moves to take his own hoodie off, George can’t stop himself from smiling widely at the sound in return. Somehow he manages to get his arms all twisted up and stuck in the material as he attempts to pull it off. \nDream teases him, as always, “Delaying the inevitable result are we?”\nGeorge just tuts at this man’s ridiculous determination to prove the extent of his height and it’s difference to his own; he has gone to great lengths to demonstrate his point, though, he must admit.\nFinally, George manages to let his head pop free, taking an exaggerated breath of fresh cool air that makes Dream laugh and forget his question.\nPerhaps a little too belatedly, however, he realises that during his vigorous struggle with his his own hoodie, his white, cotton t-shirt underneath has managed to ride up so high that it’s definitely visible on camera to Dream, exposing a considerable expanse of George’s pale skin.\nIf the other man notices, he luckily doesn’t comment. George sheepishly pulls the fabric back down, covering the full length of his torso, and knows he blushes a deep red.\n“Go on, George.”\nDream encourages him, but this time it’s softer and more supportive; it’s not doing anything to alleviate the stark colour of George’s cheeks.\nHe moves further back from his desk to give himself more room this time and to open up the camera angle a little more. \n“Fine. I’m doing it.” George answers, sounding rather begrudging, but actually secretly feeling quite excited to wear something of Dream’s.\nSliding the loose material over his head, George suddenly realises that they’re now technically closer than they have ever been to each other. Slipping his arms into the definitely too-long sleeves feels like a warm embrace, saving him from the winter chill of his room despite the heating of his apartment being cranked up to ‘high’.\nA large amount of the soft fabric of the baby-blue hoodie bunches at George’s slender waist. Getting out of his chair to feel the full effect of the length, he almost forgets about Dream’s presence altogether until he hears a soft gasp emitted from his speakers.\nSuddenly intrigued, George squints at the display of him in his room on his screen, pushing his chair further to the side and away from him in the process. His eyes widen slightly in surprise at what he sees.\nThe pale-blue material of the jumper seems to drape lavishly over him, rolling in waves of somber sea and drowning him in its sheer length. Blue sleeves cascade long past the position of George’s actual hands; bunching them up a little to emerge his skin, he quickly finds that he doesn’t want to, discovering comfort in the warm, fluffy interior. Instead, he reveals only his fingertips to the cool air and wraps them around the ends of the sleeves creating sweater paws.\nFalling around his mid thigh, the hem of Dream’s hoodie nearly stretches far enough to conceal the fact that he’s even wearing shorts altogether; his pale thighs on show to the camera and complimentary to the pastel hue of the warm fabric.\nGeorge studies himself for a few seconds more before an involuntary, shy smile blooms across his face, fingers still playing with the hems of the sleeves and shifting side-to-side on his feet, rather nervously. \n“George, you look...”\nDream’s voice is finally heard again, crackling through the speakers this time, still breathless and hushed. George waits for the inevitably tame insult though, because that’s their thing that’s what they do.\nStupid, maybe. Silly? Or maybe even a simple and straight to the point, small.\nNone of these words fly out of Dream’s mouth however. Instead, “You look cute.”\nGeorge is pretty sure he loses his breath; he’s known Dream for years and his tone is honest and serious. He’s not teasing, or even being affectionate in a way that close, close friends do. Consequently, he flushes bright and prominent red, much to his embarrassment.\n“Dreeeam,” He persists, attempting to cover his blush in his hands, “You-don’t.”\n‘Don’t say things you don’t mean.’ George wants to say, but his words aren’t cooperating right now.\n“I’m being honest!” \nDream maintains, voice now higher at the accusation than the previous, almost intimate tone. It soon returns.\n“George-,” His breathlessness is back too, “I can’t- You look adorable in my hoodie.”\nGeorge is still blushing furiously, and has to resort to looking at the floor, begging the warmth in his cheeks to go away. He feels like he should say something, so he does.\n“Thank you?”\nHe tries to reply in a timid voice, not sure of the correct reaction to receiving a compliment of such nature.\nDream chuckles lightly before going quiet for a more few seconds, seemingly considering something before reaching a decision.\n“Is it comfy, baby?”\nIt’s George’s turn to gasp audibly because Oh. My. God.\nSure, they’ve all used such nicknames in a joking way with each other before, but not in this capacity and context. It’s so much different and it definitely does something to George... he even thinks he likes it.\nCurrently presenting himself to Dream over call, standing in nothing really more than the other man’s hoodie that absolutely engulfs his smaller and slender frame, coupled with the addition of a freaking pet name, George feels, as he so often does with Dream, vulnerable yet safe and completely and utterly cared for in every way. And he loves it.\nIn order to attempt to get this point across, George makes sure to maintain eye-contact with his camera fully whilst he speaks, “Very comfy,”\nHe snuggles his face into the front of the hoodie to demonstrate, “Thank you, Dream.”\nSaid man laughs happily in reply before he still manages to point out that his jumper is big on George.\n“Admit it. I’m taller than you by far.”\nGeorge’s face morphs into a pout because now with hard evidence produced, he can’t really counter this fact.\n“Fine,” He reluctantly admits, shoving his hands into the pocket of Dream’s hoodie, “But only by, like, a little bit.”\nDream chuckles again lowly, “Whatever you say, baby,”\nGeorge’s face begins to heat up at the fondness in the other’s words, imagining Dream’s smile.\n“Whatever you say.”\nIt’s been an admittedly strange couple of days for George since Dream had sent him his hoodie.\nSince the two had reluctantly ended their Discord call, stretching it well into the early hours of the night, nothing much more about what was said, or occurred, has cropped up.\nIt’s not like either of them were particularly avoiding the topic or anything, just that they, or George at least, rather wouldn’t closely examine this unspoken component of their friendship. \nSo for now, naturally, it slides by.\nGeorge has found himself frustratingly tied up in real-life things for the past few days and so is incredibly excited to be going live on stream with Dream this evening. \nThey’d texted and called briefly the nights in-between, but when George was battling to stay awake, desperately trying to stifle his yawns down the phone to Dream, the other man had quietly told him just to go to sleep already and that he doesn’t have to call him if he’s tired. To which George usually replied with a defiant ‘no’, before promptly falling asleep on the call.\nIn the end, however, he’d slept quite well last night, so he thinks this counts as a win. George is just sitting down at his desk when his monitor notifies him of an incoming TeamSpeak call with Dream.\nHis heart does a weird skippy thing, pounding against his chest in a way that makes him feel warm and unstoppable. Sliding on his headphones and pointedly clearing his throat, George connects the call.\n“Hey.” He says, but it comes out quieter than he’d expected, “You’re late.”\n“Hellooo.”\nDream answers, dragging out the syllables as he loads up the game on their screens. George giggles at his antics because honestly anything Dream does in his Dream-like way, he would probably find adorable... and sometimes, hot.\n“You ready soon?”\nDream asks, pulling George back from his racing thoughts. Hastily, he checks the setup of his desk and is about to give the all-clear when he realises his camera’s still not propped up correctly.\n“Ah, no, sorry, wait a sec.”\nHe requests, soon apologising again when he feels like he’s taking too long to clip his tripod together. Dream just chuckles and assures him that it’s fine. \nThere’s a few more seconds before Dream asks meekly, “You’re doing facecam today?”\nAlready flustered as he is, rapidly attempting to settle his camera position, George somehow feels himself flush an impossibly darker red, and he doesn’t even know why.\nThere’s questions flying around his busy mind. Why would Dream ask that? Does he want to see George’s face?\n“Yeah.”\nHis heart-rate increases momentarily before he rationalises his own thoughts. Dream is just asking because he’s curious. Not because of him in particular.\n“Got it.” He exclaims happily with an exhausted sigh as he flops back in his chair after successfully positioning the camera before him. \nDream laughs as George starts connecting the feed of the camera to the stream, ready to go live.\n“That sounded like it took some effort.”\nGeorge rolls his eyes even though he knows Dream can’t see his face yet. He also finds himself checking his appearance in the reflection of his computer screen, running a hand through his hair, trying to tame the fluffiness, before he suddenly stops himself, questioning why he cares so much. \nMaybe because it’s different this time, he thinks before quickly shaking the thought off and finally responding to Dream’s dumb comment with a short whine.\n“Shut up.”\nThe fact that George wants to hear Dream say certain words to him again tickles like a feather in the back of his mind, but he pushes it away by focusing on the task at hand. \nA few more quick clicks and George finds himself fully set up and ready to go. He tells Dream this, who helpfully belatedly informs him that he’d already started his own stream about a minute ago.\n“I hate you.” George says light-heartedly, because he’s physically incapable of saying it in any other way.\n“No, you don’t.”\nDream chimes back, and George can just imagine the large grin pulling across his face. Of course he doesn’t.\n“Okay, anyway,” He says decisively, turning around the current topic of conversation, “Firstly, hi to Dream’s stream,”\nGeorge hears a light chuckle from Dream in his ears as he watches him open their latest shared survival.\n“Secondly, I’m starting my stream now.”\n“Okayyy.” Dream drawls out, playfully running in circles around George in game.\nHe clicks a few more buttons before it all works.\n“Hey guys,” He greets cheerfully, shouting out some people in chat in the process, “I could’ve been here a lot earlier if a certain someone hadn’t called me so late.”\nDream stops what he’s doing and runs over to Geroge before he responds, beginning with a pointed and unimpressed, yet playful silence.\nGeorge turns to stare him dead in the eyes down the camera lens to hold his ground, but he soon realises that the little red light isn’t flashing, even after all that palaver. \nWith another small sigh he stretches his arm to click it on, it makes a satisfying ‘Beep!’ and George can finally sit back and relax as he watches it load up on his screen, connecting to the stream. \n“Uh, I’ll have you all know that I was the one who called George, so if anyone wasn’t on time it was him,”\nGeorge allows himself to laugh at Dream’s claim, still eagerly watching the video feed of his face load into the left corner. Damn, this camera’s on its last legs, he thinks as he waits, listening to Dream still continuing to ramble on with a list of reasons why he was not late and making a mental note to start putting money aside to be able to buy a new one.\n“-anyway, I’m literally never late to anything. In fact, I prefer to be-...”\nGeorge only fully tunes back in to Dream’s small rant at this point, but he quirks an eyebrow up in question to his TeamSpeak chat displayed beside him when his usually loud and out-spoken friend trails off in the middle of his sentence.\n“You alright?”\nGeorge asks with a slight chuckle as he finally starts moving in game. Now, however, Dream is perfectly still.\n“Hm?”\n“I asked if you’re okay.”\n“Oh... uh, yeah,” If George didn’t know any better, he might even say that Dream currently sounds flustered. But that’s literally impossible, because Dream is the most cool and collected person he’s ever met. He doesn’t get flustered.\n“I’m fine. Don’t worry.”\nDream clears his throat rather loudly after this, arousing George’s suspicions that the very opposite was in fact true. But he leaves it for now, because he knows Dream; he only says what he wants, when he wants. It’s practically impossible to squeeze a forced word out of him, and believe him, he’s tried.\nGeorge is about to resume like nothing had happened, when the screen mirroring his stream catches his eye and he suddenly realises. \nHe’s currently wearing it... Dream’s hoodie, live on stream. \nAnd now he’s completely sure Dream will think he’s absolutely shameless.\nTruth be told, George honestly hadn’t realised he was still wearing the pale-blue jumper when he’d initially sat down to stream. This was probably due to the fact that George has practically lived in Dream’s hoodie at home ever since it arrived the other day.\nThe temperature in England at the moment was dipping well beyond freezing daily, and with his apartment’s crappy heating, it was a basic necessity to wear more than one layer of clothing when he is home.\nThis is not the point, however. The point is that George actually has a large and impressive collection of hoodies at his disposal, as one tends to accumulate when living in a primarily cold region, and Dream is fully aware of this. Yet, despite his abnormally vast range of hoodies, George has still chosen to wear Dream’s.\nGeorge can’t help but clear his throat a little too loudly before he just decides to try and gloss over it, like he never noticed why Dream got so choked up.\n“Let’s go.” He announces, which also thankfully seems to pull Dream’s attention back to their virtual world in some capacity at least.\nSpending a majority of the stream now hyper-aware of his outfit, George shifts in his seat and pulls the collar of the jumper upwards to try and quell the cold bite of air that still berates his skin after a couple hours of sitting still.\nHis body must also let out an involuntary shiver because Dream asks, “You cold?”\nGeorge looks over at his TeamSpeak chat before remembering Dream can’t actually see the questioning look on his face if he does so.\n“Mmm.” \nHe admits half-heartedly, worried about what would fly out of his mouth if he actually opened it because Dream had sounded so concerned when he’d spoken.\nThen Dream comments, in an oh-so-casual tone, “At least you’ve got a hoodie on.”\nGeorge really doesn’t believe he’s heard that right.\n“What?”\n“At least you’ve got a hoodie,” Nope, he was right, unfortunately, “It looks quite warm and soft too.”\nGeorge thinks his heart might just beat its way out of his chest like a butterfly beats its wings. He takes a deep breath before he even attempts to answer; flashbacks of a couple of nights ago and what Dream had said coming rushing back to him.\n“It is.”\nGeorge is pretty sure his cheeks are blushing bright red. To make it worse, judging by Dream’s tone, he’s pretty confident that the other man can tell.\nHe’s not lying though. Dream’s hoodie had an inviting and fluffy interior that greatly helps to regulate his own body temperature in this winter chill. It makes him feel warm as soon as he pulls it on, and George tries to tell himself that that definitely does not have anything to do with who’s it is.\nBut that never works, because when George is huddled up in the soft, baby-blue fabric, working on some project for either his channel or everyday life, he can’t help but feel as if Dream is there with him. \nEven though, logically, he knows the other man is thousands of miles away across the Atlantic, George can feel his comforting warmth beside him.\nAnd if they do actually ever get to meet in real life at some point, George only hopes he can receive some of that warmth in the form of a hug too (or, if he dares to dream, more.)\nDream speaks again; this time, lowly, sending pleasant shivers up George’s spine that beat the cold by a mile.\n“Where’d you get it?”\nGeorge is going to kill him.\nJust when he thought his face was returning to a more natural shade as well. He doesn’t give the camera a death stare, as they’re still streaming (for thousands to see, oh god), but he’d VERY much like to. \nHis hands don’t seem to be working, so that’s great; his brain feels like it’s short-circuiting too. \nDream is teasing him. Dream’s teasing him because he knows George will flush alarmingly red like he always does when he messes with him (and he’s starting to think Dream likes doing that a lot).\nRight now somehow it’s even worse because they’re both sitting right in front of a few thousand people, some of whom are their friends, and if George were to try and play the power move and reply with a short and assertive, ‘From you.’ He’d never hear the end of it. From both the fandom and especially his friends.\nHe quite likes to imagine, however, that such an answer would catch Dream off-guard. The other is so level-headed all the time that it’s rare to fluster him; George only wishes he held such power.\nGeorge lets out a small sigh before he gives the only answer he thinks he’s capable of giving. His light tone is tinged with nervous laughter, “You’re an idiot.”\n“What?” Comes Dream’s near-perfectly faked and nonchalant voice. However, he can practically hear the large grin displayed on his face at his flustered state. \n“Someone else,” He finally manages to begin with a curt clearing of his throat, eyes subconsciously flicking over to his TeamSpeak again, “Gave it to me.”\nHe’s perfectly aware he’s being ambiguous and perhaps dancing on the edge of revealing the truth, but somehow it feels wrong to lie about the true owner of the pale-blue hoodie. Just like how it feels wrong to share it’s true origins too; this hoodie is no longer Dream’s to George, it’s theirs. \nDream makes an interested humming sound, that in a very different context would have perhaps invoked a very different reaction in George.\n“Oh, really?”\nGeorge’s brain and limbs finally seem to start working again so he resumes his game before he responds to Dream with a a short, yet soft, “Shut up.”\nThere’s a pleasantly warm feeling bubbling up through his bones, filling each and every inch of his body with content at Dream’s familiar antics. This only increases tenfold at the charming timbre of Dream’s wheezy and mischievous laugh.\nOnce again, George does his best not to peruse the origins of his emotions too curiously, afraid he’ll find something he could never have.\n \n~\n \nThe rest of the stream continues rather successfully and without any further hitch. That is until it’s about four in the morning in London and George can literally feel his body calling out for sleep.\n“Bye guys!”\nHe chirps as happily as he can in his fatigued state. As soon as the stream’s off, however, he realises that he may be able to convince his viewers, but he’d never be able to kid Dream.\n“You should go to bed.” The other man tells him, voice so soft and pillowy that George feels like he could just fall right into it (or, preferably, him).\n“Mmm,” He half-heartedly admits with the little energy he still has, “Maybe.”\n“Pfft, maybe?”\nDream’s voice is still lulling him to sleep, perhaps that’s why he nearly physically jumps when he hears him finish speaking.\n“C’mon, baby, you’ll be tired tomorrow.”\nOh, God. Thank the lord his face cam is no longer on.\nHe pauses in middle of tidying his desk, as he usually tries to do before going to bed, but now his hands are stuck in mid-air. His fingers find the hem of his sleeves, gripping and fiddling with them as he remains perfectly breathless.\n“George?”\nGod. He’s forgotten how to speak.\n“Yeah?” \nIt’s so quiet and light that George doesn’t even think Dream will be able to hear him.\n“You’re going out tomorrow, aren’t you?”\nDream continues speaking as he’s in the process of reuniting his body and soul. He makes a small hum of the affirmative, hoping the other will just put it down to his tiredness.\n“So you should go to bed,” Dream finishes finally, “You’ll be exhausted.”\nEvery word Dream says to him is correct. But George doesn’t want to go to bed, because bed means no Dream. \nAt least, not until the morning.\nHowever, in his lucid state he must let this slip in some form because, before he knows it, Dream is asking in his warm and comforting voice, “We could stay on the call if you want?”\nThis time George gives him a short silence before answering, biting his lip, “I-... okay.”\nHe doesn’t want to trouble Dream; he knows he has things to do, plans he’s made for later today, people to see.\nBut Dream must foresee his protests because he tells him quietly and calmly, “It’s fine, don’t worry.”\nGeorge nods, forgetting momentarily that Dream can’t actually see him for a few seconds as he climbs into his bed with its inviting and warmth quilted sheets, hoodie still on and pulled close to him.\nHe feels himself drifting off into the unconscious lands when he manages to catch Dream’s last few words to him.\n“Just go to sleep, baby.” \nMaking an unintelligible noise of acknowledgment, George nuzzles his face further into his pillow and drifts off with warm thoughts and a blissful smile.\nThey’re practicing their parkour for the next MC championships the next weekend and, safe to say, it’s not going too well for George.\nHe does his best to withhold his screech as he falls off the same obstacle for the seventeenth time. Briefly, George had considered streaming their practice again, but now that he’s frustrated out of his mind at this stupid jump, he’s very glad he decided against it at the last minute.\nThey’ve been at it for about an hour. Sapnap was here previously for a little while but soon became so frustrated he had to quit. Bad followed him soon after, explaining that Sapnap had insisted on dragging him away to play something else.\nThe creators keep making everything harder and George, much like many of the other attendees, can never keep up. But George knows of one man who surely can; Dream’s the reason they have to keep changing the levels, for Pete’s sake. \n“UGH.” \nGeorge can’t contain his anger as he fails the same jump again. He’s beginning to worry that he might just send his hand through the wood of his desk at this point.\n“I can’t do it.” He whines, stopping attempting the jump altogether for a moment to catch his breath and rejuvenate his focus.\nDream lets out a chuckle as George lets out another shout as he falls again.\n“Stop it.” George complains, dragging out the last word.\n“Stop what?”\n“Stop laughing at me.”\n“Nope,” Dream sings cheerfully, and can’t help but laugh again at George’s whine, which has him joining in too after a while. “I like it.”\nThere’s about a minute that follows before Dream speaks again, this time his voice is softer and quieter; smooth silk to George’s ears.\n“You’re cute when you’re angry.” \nAs expected, George is blushing uncontrollable shades of ruby and scarlet, face scrunching up as he feels a warm wave of emotion hitting his chest and travelling sensationally up his spine to his brain. \nHe is so glad Dream’s comment requires no answer, as the other seems to have already moved past the moment, complaining about his next jump. George is positive he would’ve blurted out something completely stupid.\nBlatantly changing the subject, begging for an opportunity to let his pounding heart quell, he groans loudly, “Dream, I give up.”\nHis words have the other man teleporting right back next to him, even though he was nearing the end of a perfect run.\n“Why?”\n“Because I am this far from completely loosing my mind.”\nGeorge holds his fingers up to the camera, a millimetre apart, for Dream to see.\n“No, no,” Dream says in his ever-soothing tone, “Just calm down and tell me what you’re doing wrong.”\nHolding his silence for a second, George soon motions to the end of the stage.\n“That last stupid trapdoor,” He admits quietly, knowing Dream always breezes past this section in one quick run and feeling a strange sense of inadequacy, “I can’t do it.”\n“Okay,” Dream starts the stage and reaches the jump, “Come here and I’ll teach you.”\nGeorge can’t help his little smile. They’re not even on the same team this time and Dream is helping him at the expense of his own practice time. It makes his chest feel warm.\nIt takes him a good ten minutes, watching and listening to Dream talk him through the same jump about twenty times, but George eventually starts to be able to make it.\n“There you go!” Dream exclaims, as he makes the jump for the third time in a row, “See, I told you you’d get it.”\nThe other man sounds just as excited as George feels at finally being able to get over the largest obstacle stuck in his way. He’s also very glad he didn’t just waste Dream’s precious practice time for nothing.\nLaughing happily, George thanks him and completes the jump yet again.\n“Ha,” Dream interjects, “You’ll be giving me a run for my money soon.”\n“Pfft, I highly doubt that.”\nGeorge shakes his head.\n“Why not?” Dream sounds genuinely curious, and George can’t decide if he’s just fishing for compliments or playing dumb, but he gives in either way. Not before tutting at him disapprovingly, of course.\n“Because,” George starts shakily, vaguely gesturing with his hands in real life for some reason too before he puts them back on the desk, “You’re... you. You know?”\nDream leaves a silence like he’s waiting for George to elaborate more.\n“Don’t make me say it.” George says between nervous laughs, whining slightly.\nThen it’s Dream’s turn to laugh questioningly, “What?”\n“You know,” He reluctantly resumes after a short pause, cheeks flushing slightly pink for some unknown reason at dishing out praise for Dream, “You’re like... good at EVERYTHING.”\nDream seems to process his comment for moment, judging by the emptiness that follows. George is just about to give in to his anxiety and backtrack himself massively when Dream’s cheerful laughter chimes in his ears.\n“Awww, George,” Dream’s tone is sweet and flattered, but overly-so, teasing, “I didn’t know you looked up to me so much.”\nGeorge lets himself chuckle, “Shut up, you idiot.”\nBut can’t help but think, of course he does. Almost everyone does. \nSuddenly he wonders if Dream even realises this sometimes or if he’s just too busy being immersed in his competitive nature to notice.\n“C’mon,” Dream chirps, jumping around him excitedly, “Let’s race each other.”\nHe lets out a short laugh.\n“Why would I do that? You’ll just win.”\nDream whines in protest and George finds himself surprised, not expecting it to mean so much to the other.\n“Okay,” George snorts when he doesn’t even try to dent the fact that he’ll probably win, “Just the first three stages then.”\nUpon considering this, George finds this proposal to certainly be slightly more fair; he’s pretty good at the first three now having gotten past the stupid trapdoor jump.\nBut then he remembers he’s up against Dream, parkour extraordinaire, and rethinks his entire answer.\n“I don’t-“\nHe doesn’t finish his sentence because Dream cuts him off, probably very much aware of what he’s about to say.\n“C’mon, c’mon. Please?” The other urges, and George can start to feel his weak heart crumbling at his pleads (God, he’s in way too deep), “It’ll be fun.”\nMaking a face that suggests the entire opposite, George gives a death stare at his TeamSpeak chat.\n“I don’t know...” He provides, trailing off. \nIt doesn’t matter because Dream soon fills the silence, apparently VERY excited by his idea judging by his loud and bouncy tone of voice.\n“Okay, wait, wait, wait,” Dream tells him, jumping up and down next to him as George stands still to listen, “How about an incentive?”\nAdmittedly, George is now very intrigued.\n“What kind?”\nHe hears Dream chuckle, pleased at having tempted him.\n“Like,” Dream begins, speaking quickly, almost as if he had planned this from the very beginning, “If the other wins, we have to do something they ask.”\nGeorge’s mind is racing, racing, racing. This can’t be good.\n“Okay.”\nThere’s a beat of silence before George realises Dream is waiting for him to speak first.\n“I- um. I don’t know.” He stutters, still not acclimatised to his body’s heightened state that appears whenever Dream opens his stupid mouth, adrenaline pumps through his pulsing veins.\n“Oh, c’mon,” Dream drawls, quietening his tone slightly in the process, “Just think. What’s one thing you want from me?”\n\nGod forbid, if he actually answered that question truthfully.\n\nUpon much more careful and constrained consideration and even more ‘um’s and ‘ah’s, he finally comes up with something.\nGeorge speaks in a contained voice and puts forth his suggestion to Dream.\n“Okay, well,” He begins, Dream just waits expectantly. George clears his throat quietly again, “Maybe we could FaceTime?”\nHe plays with his fingers and picks at his nails as he waits for Dream’s response.\n“Like properly, this time.”\nHe doesn’t add the part that contains the fact that this is because George really, really, wants to see Dream’s face again. It feels so long since the last time that in his imagination it comes together as a slight blur; George feels himself strangely angry at himself for forgetting the face of someone who means so much to him, even if it is in the slightest way.\nSo, yeah. George definitely wants to FaceTime Dream and take in his handsome features once again. That’s another thing, his best friend is annoyingly and undeniably hot. Ugh. \nEventually, the silence stretches on for so long that George starts shuffling in his seat and eventually speaks up, voice tinged with defensiveness.\n“What?”\nDream just hums in reply, like he’s mulling George’s request over in his magnificent brain. George’s anxiety hits peak levels, so he asks again.\n“Don’t you want to dream bigger?” The other asks eventually.\n“That’s such a bad pun.” George tells him, giggling anyway.\n“What? Oh, I didn’t even mean to- never mind.” Dream laughs his way through his words cheerfully.\n“I just meant,” Dream starts again, this time, carefully, “You can ask for anything, literally anything from me, George, and it’s yours... don’t you want more?”\nOf course George wants more. Of course he does. But he can’t bring himself to ask, even when Dream seems to be offering it out to him so freely.\nInstead, “Well, what do you want if you win then?”\nDream dramatically pauses like he’s thinking, but the clarity and assuredness of his answer makes George question if it’s even very impromptu at all.\n“If I win,” The other starts, giving himself his own dramatic pause. George shakes his head at his antics as he waits, “You have to wear my hoodie on stream for the MCC.”\nGeorge pauses. They hadn’t mentioned it since the incident, and he hadn’t tried to even bring it up thinking they had reached some sort of unspoken agreement not to speak of such things. \nApparently not.\nNot even having to check his face in the reflection of his mirror, George can tell he’s currently a lately too-familiar bright red.\nGeorge can hear Dream’s small mischievous laughs down the call, the butterflies in George’s stomach that have been there for weeks have started fluttering delicately again. Their wings taking them high into the sky.\n“If-,” He tries his best to reply without tripping up on his words, but he doesn’t even make it through one. He clears his throat again, “Sure, if... that’s what you want...”\nGeorge can’t stop his words from sounding unsure. He smiles when Dream softly replies with a reassuring affirmative, feeling almost as if his blush has creeped across his heart too. \nHe also doesn’t mention the fact that he’s still wearing Dream’s hoodie right now, probably because he knows the other man will say something that gets his poor face lighting up flushed scarlet again and he doesn’t think he can take much more.\nMaybe it’s this that supplies him with sudden confidence, or maybe it’s his frustration at Dream’s uncanny ability to make him blush deep, dark shades of red, but George has a sudden urge to do something, or say something to catch his ridiculously laid-back friend off-guard for once in his life.\n“I’ve decided what I want if I win.” He tells Dream, surprising himself with the ease and lack of wavering in his voice. Not that it particularly helps, but he finds himself sitting up straighter in his chair, determined, “Anything, right?”\n“Good, yes,” Dream says, and George loves that he has no idea what’s coming, “What is it?”\nHe takes a breath before he dives in.\n“I want you to come and visit me.”\nGeorge waits a moment, and then another, and then there it is: unflappable Dream struck speechless for once. \nHe can’t help but feel quite proud, but on the other hand, his anxiety has kicked right back in where his levels of adrenaline have ran out. His heart’s now thumping loudly in his chest, banging against his rib cage and oh, god, why did he do this to himself?\nDream probably thinks he’s too eager, that he’s weird or something. All these stupid thoughts that he’d never have believed to be true fly through his mind at this one moment. \nThen Dream takes a shaky breath before he answers after a long pause.\n“Okay.”\nGeorge has to hold back a gasp of his own because his voice is so tender and soft, like cotton-warmed linen on a summer’s day.\n“W-what?”\nHe’s an idiot for thinking he could play this off nonchalantly.\n“If you win,” Dream’s speaking slowly, like he’s trying to confirm that this is actually what George said and wants, “I’ll come and see you next week.”\nThere’s a resurgence of adrenaline and endorphins in George’s veins shortly, before he remembers he’s got to win this stupid bet before that even happens. But the prospect of it is closer than they’ve ever got to meeting up before, and it’s making George’s heart ache.\n“Yes.” George only finds himself able to say, worried that if he lets his mouth run he’d say those words he’d never be able to take back.\nThey finally line up at the start of the parkour trail and George is currently questioning his current life choices all over again. He’s attempting to concentrate when Dream interjects (which really should be considered as cheating, he thinks).\n“I would’ve come anyway,” Dream tells him quietly, apparently still surprisingly tongue-tied, “If you’d asked, I mean. You didn’t have to bet it.”\nInstead of reading too much into the other’s words, Geroge simply says, “It’s what I want.” and hopes that his point gets across.\nDream tuts as he sets their countdown for the race, “Your’s is so good though,” He seems to say almost absentmindedly.\nThen more eagerly and loudly, “Can I change mine? Please?”\nGeorge feels an involuntary smile pull up at his dusted cheeks. \n“That’s against the rules.”\nHe grins further at Dream’s spluttering protests, claiming they never even set the rules in the first place.\n“You can’t change!” George insists, holding true to his argument despite imagining Dream’s incredibly cute and handsome pout that would be on display about now, “That defeats the point of the bet.”\nDream huffs loudly, George is half glad and half sad he’s so quick to return to his loudly-spoken usual self. \n“Nooo. No,” George vaguely thinks that he sounds like a whiny child unable to get his way, “Let me, please? I want you to come to the US, I’ve changed my mind.”\nGeorge’s heart must shoot absolute fireworks as he feels his entire body electrify at Dream’s off-handed yet so sincere comment.\nHe can’t help breathing out, “You want... to see me?”\n“Of course I want to see you,” Dream says expressly, stressing each word like it’s an undisputed fact. His tone turns softer at then end, “Of course I do.”\nOnce again, Dream’s managed to turn his own teasing back onto himself, a never-ending, yet endearing side effect of being friends with the eccentric twenty-one-year-old.\n“Please?”\nDream asks again in a small voice. George can feel his stubborn walls breaking, but before the large cracks can give way entirely, George forces himself to stay true to his word.\n“Rules are rules.” He enjoys sing-songing at Dream, happy grin on his face at having the upper hand in their situation, which doesn’t happen very often at all.\n“Ugh, fineee.” He hears Dream sigh out before he announces the countdown’s ready.\nGeorge had almost forgot about the stupid bet altogether. His heart starts fluttering again.\nDream counts them down abruptly, and they’re neck and neck on the first two stages, mere milliseconds apart, if anything. \nThen they reach George’s arch-nemesis, the dreaded trapdoors. George is holding his breath as he focuses with a hundred and ten percent of his brain, fingers dancing quickly and precisely over his mouse and keyboard.\nThey’re both at the last jump and George makes a small grunting noise of effort as he prays to god that he’ll make it and he DOES.\nHe daren’t even check or think about where Dream is until he leaps onto the island at the end and gets the achievement announcing he’s completed the third stage. \nHe flicks his mouse around to check quickly, “Wait, did I win?”\nJust then he sees Dream respawn on the island opposite him, backwards in progress, on level two.\nGeorge is pretty sure he makes some strange strangulated noise, a mix, perhaps, of a shriek of glee and a gasp. He can just about hear Dream’s light chuckling.\n“I won right?” He checks again, voice high in pitch and tone with his excitement.\n“I missed the last jump,” Dream explains, finally leaping onto the same island as George beside him, “So yeah, you did.”\nA large and insatiable grin flies across George’s face, toothy and ridiculously happy. The butterflies that were relentlessly glittering and twisting inside his stomach disappear as if being set free; he did it.\nHe makes a loud and unintelligible noise of surprise and cheer, which only causes Dream to emit his loud and wheezy laugh even harder. The sound only increases George’s excitement, amping him up. \nAlthough, George is briefly suspicious, having seen the other man make that jump in his sleep many a time before, and considers that Dream sounds amazingly happy for someone who’d just lost a bet to him, but he really doesn’t care right now.\nDream’s coming to visit him next week. Finally, after years of knowing each other and only brief and obscure glances at the other’s face, George is finally going to match the melodic voice behind a screen to a face he could analyse from every angle, etch into his memory and never let himself forget.\nHe’s going to meet Dream, his imagination runs away with him, imagining endless scenarios and interactions between them both. \nThen suddenly, the reality of the situation hits him a little harder and his anxiety spikes his heart rate again.\n \nDream.\nVisiting him.\nNext week.\nOh, God.\n“Where the hell is Dream?”\nSapnap asks him down their Discord call. True, Dream would normally be online with them right about now, and far into the early morning and beyond. But the man hasn’t touched his Discord all day and Sapnap seems very pressed in finding out why.\nGeorge knows exactly why.\nDream is currently on a trans-Atlantic flight to London. To see him.\nThe thought still gives him tingling butterflies and shivers up his spine even though he’s had almost a full week to process the whole situation now. \nIt doesn’t matter though, because George is well aware of the fact that his nervousness probably won’t even die down until he clamps his eyes on the other, and most likely not even then. George is learning to live with the constant buzzing excitement building in his body, mind forever preoccupied with thoughts about what Dream’s face, eyes, hair, height, everything will look like.\nGeorge has no idea about exactly how clued up on the whole situation Sapnap currently is, but from the sound of it, not very much at all. \nPerhaps Dream wants to tell him when he’s already here. He considers, shutting out all the stupid thoughts like Dream doesn’t want anyone to know they’re meeting, or is ashamed of him.\nHe has to shake his head in real life to retract that awful train of thought that is entirely and most definitely NOT true. George’s very thoughts are reinforced by what Dream had sent him just before he got on his flight; it was early morning for George, so he was fast asleep, meaning he couldn’t really talk to him beforehand.\n\n4:49am dream:\n about 10 mins until my flight! i can’t wait to see you\n\nGeorge’s face had undeniably gleamed when he woke up to his message this morning. \n\n4:51am dream:\n this is what i’m wearing, btw. so you know it’s me &lt;3 \n\nAttached is a photo of Dream’s outfit, as stated previously; no face yet though, taken from just above the neck and down. George desperately attempts to tell himself that Dream’s grey joggers and not-so-loose white t-shirt have absolutely no effect on him at all.\nThe little heart emoticon tagged onto the end of his message definitely doesn’t help his case either; he’d rolled back over in his bed and smiled a stupid grin into his pillow.\nGeorge is pretty sure he could have picked Dream out from the crowd at the airport anyway, without an outfit to match it to. Number one, because he’s ridiculously and incredibly tall (at least compared to him), but two, because George has a feeling he will just know. Their eyes would meet and he’d know.\nHowever, George is now massively regretting not just pushing through his fatigue and talking with the other non-stop before he got on his flight. A flight that means a Dream-less eight hours that George is currently biblically cursing.\nCan you even miss someone for just eight hours? Well, George certainly can, he’s pretty sure he’s stared at the photo Dream had sent him about four times in the past hour alone.\n“Hmm?” George supplies Sapnap, after realising he never replied, “Oh, I don’t know.”\n“Elusive bastard.” The other only says, fondly.\nGeorge is trying his best not to nervously chuckle but this is honestly a prime time. He distracts himself with the game, at least they weren’t currently streaming.\nThere’s about another hour of them idly chatting about random things until Sapnap brings it up.\n“Oh, dude,” He starts, punching George in game, “What’s the deal with your hoodie? It was literally all over my Twitter feed the other day.”\nThis stops George suddenly in his tracks, heart rate skyrocketing and making him feel a little dizzy. To be honest, he’d kind of figured that Dream would’ve shared such information with his one of his best friends, but it makes George feel so much warmer for some reason to find out that he hasn’t. This thing is theirs.\n(And, well, a small proportion of fans on Twitter who are throwing theories out left right and centre about who’s hoodie George was wearing. Most of them have got it right.)\n“Haha, I didn’t really see.” He tells his friend, voice suddenly flat and monotone as it tends to go when he’s lying horribly out of his teeth.\nHe refuses to let his eyes trace over to Sapnap’s video call because he’d probably give way to the truth immediately.\nApparently, however, his friend knows him all too well.\n“George?” He asks, tone already becoming more playful and teasing, “Georgeeee?”\nGeorge takes a large gulp of air before he responds, “Hmm?” without looking away from his screen, attempting to focus and blinker his attention with his heart’s content.\n“Something’s up,” Sapnap starts curiously, yet declaratively, as if he’s sure of it, “C’mon, what is it?”\nSighing through his teeth, with the knowledge that his face is tinkering on the edge of flushing bright red, George decides he can’t maintain his silence much longer. Besides, he hates keeping too much from his close friends too. \nHowever, when he tries to start talking, George finds it harder than he thought he would. It’s like there’s sweet honey stuck in his mouth, clamping it shut and he has to take another huge breath.\n“Well, uh, you see this hoodie,” George motions to his body where he’s currently donning the soft, pale-blue garment, simultaneously thinking about how the fact that he’s currently wearing it right now is not going to help his case at all, “I, um...”\nHe trails off but Sapnap waits patiently; looking over to his video call once again, George can see he’s got one eyebrow raised. He has to look away though, too shy to admit it directly face-to-face. George clears his throat.\n“Dream... gave it to me.”\nGeorge dares to flick his gaze over to his friend’s face once again, but soon twists right back to his game when Sapnap starts speaking.\n“Like as a present?”\n“No, uh, it’s-,” God, George is going to disintegrate on the spot, “it’s his...”\nSapnap is quiet for an abnormally long time; George is still staring at the pause screen on his game, watching for movement out of the corner of his eye. There’s none and his heart skips a beat, pounding against his chest.\nStarting to get worried, George begins to consider backtracking on himself, or even turning to the other to see his reaction face-to-face. These thoughts spiral around in his mind, casting him down, down, down until a heaven-splitting voice is cast out of his poor speakers.\n“WHAT.”\nSapnap yells at the top of his voice, literally causing George to jump in his seat a little, setting his heart to race even faster that it already is. \nHe can’t help but turn back to face his friend’s face now, and isn’t it an amusing sight to see; George has never seen Sapnap display such an expression of surprise, shock and underlying glee before. It’s so funny to him that he almost forgets about his current situation when he can’t help but laugh a little at Sapnap’s face.\nThen comes the unintelligible, but just as loud, spluttering, “You- Dream gave you- Oh my God.”\nGeorge lets himself laugh harder now, if he’s going to be interrogated, he may as well have some fun beforehand.\nOnce the initial surprise wears off, Sapnap’s facial expression slowly morphs back to some sort of normal. His eyes are still wide and highly interested, apparently, drinking in each word of the story entirely as Geroge finds it best just to recount what had happened to him.\n“So, he literally just mailed it to you?” \nSapnap’s question is asked through incredulous chuckles at his best friend’s antics, although, somehow George gets the impression that he’s not actually that surprised Dream would do such a thing.\n“Yup.” He confirms, now feeling slightly less on edge than he did before; his hands have stopped shaking enough for him to resume his game.\n“And then you wore it for him?” Sapnap asks.\n“Well,” George can feel his face blushing ruby red and his palms begin to slide off the mouse slightly due to his increase in sweat. His words are a mismatch of stutters, “Not- not exactly for him. I, uh, put it on, yeah.”\nHe hears a light tut from Sapnap and glances a brief rolling of eyes before he continues, though the other man quickly resumes talking before he can question it at all.\n“Then you wore it again on stream,” Sapnap clarifies in a questioning tone, George closes his eyes but nods slowly, “And you keep wearing it whenever I see you.”\nHe’s watching Sapnap’s face again out of one eye. His friend is currently close to the camera, eyes wide and both eyebrows raised this time, as he repeats George’s story he’d just told him extremely briefly, as if he’s expecting George to continue.\nWell, George thinks, thoughts bouncing around his brain, When you put it like that, it sounds...\nSuddenly, he decides he’s in dire need of a topic change. He’s raking his rushing mind for ideas when Sapnap suddenly stops moving on the screen in front of George, hand paused mid-air as George watches his features open up into an expression of shock and realisation.\n“Oh. My. God.” \nIs all Sapnap says, voice astounded. George is hooked on every word, gaze drawn directly back to their video call from sheer curiosity. \nUnfortunately, that means Sapnap gets to look him directly in the eyes as he finishes, asking.\n“Dream’s flying to England, isn’t he?”\nGeorge’s jaw drops wide open before he can even try to protest in the slightest way. He can only watch, defeatedly, as Sapnap’s whole face lights up with a toothy and mischievous grin.\n“I KNEW IT.” \nSapnap’s shout is happy and triumphant, to what exactly his is currently referring in particular, George doesn’t know. He listens to Sapnap muttering under his breath to himself, probably something about Dream not telling him about this in the first place.\nStill watching with wide eyes and frozen in place in his chair at this unexpected revelation of the younger man’s, George does his best to let his beating heart recover to its fullest.\n“I can’t believe this.”\nGeorge can’t stop himself from guffawing and adding, “Neither can I.”\nHe immediately regrets it though, because he seems to draw all of his friend’s attention from Dream’s omission of his travels back onto himself. \nOh no. Good job, George. \nSapnap’s smile glints at him down the call and George can practically see the millions of questions he’s about to launch on him in the cheeky glimmer in his eyes. \nWanting to leave with some kind of victory after his continuous losses to Sapnap’s apparent uncanny skills of deduction, George lets his inner mischief fuel him as he laughs loudly before saying, “Bye, Sapnap.” \nHe moves to disconnect the call and Sapnap even says a ‘goodbye’ back to him out of deep-ridden habit until he fully processes what’s happening.\n“Wait, George!” George does not, continuing to shut down his computer.\n“No, sorry. I have to meet Dream at the airport soon.” He enjoys playing with a teasing tone and watching Sapnap’s mouth drop even more at his confirmative words.\n“No, no, no wait! C’mon, at least tell me-“\nSapnap’s protesting and whiny tone is cut out when George finally hits ‘disconnect call’, and he finds himself congratulating himself, even if this was only a slight, slight victory.\nHe’d very much rather explain everything later to Sapnap, when Dream has arrived and must feel his wrath too (luckily, probably more so than George). \n \n~\n \nAirports are one of George’s least favourite places. \nThe clangorous hustle and bustle of holiday-goers mixed with the stress and frustration of businessmen and women alike is just absolutely enough to drive him barking mad.\nRight now though, there’s no place he’d rather be. Because Dream is going to be here, any minute, standing physically in front of him. No longer mere stolen glances of pixels, no longer a smooth and silky voice received through crackly headphones and speakers. Real.\n George bounces on the balls of his feet, half from his attempts to calm down and half from the bitter bite of cold that still manages to seep into the airport terminal. \nWinters in England are harsh and unforgiving and this year it’s no different. This is the excuse George uses to justify him wearing the hoodie to meet up with Dream to himself.\nPulling the baggy, pale-blue material closer around him and checking his phone again, George quickly mentally assesses his outfit once more. Like he hadn’t spent roughly an hour deciding on what to wear before driving here.\nHe’d ended up in his favourite black jeans and a soft, yet plain, grey t-shirt. Yes, he knows his outfit doesn’t sound like it should have taken as much contemplation as it did but, admittedly, a large proportion of that time was spent by him taking the hoodie on and off, wondering whether to bring it at all.\nGeorge is very glad he did, though, because he’s been standing around at the gate exit for about twenty minutes now. Bloody airports are never on time. He thinks, rubbing both his hands together in the jumper pocket.\nDream had apparently touched down on the runway about ten minutes ago. George had presumed he’d receive some form of communication to inform him that he’d landed safely or something, but there’s been nothing so far. It’s not helping his state of anxious excitement.\nHe finds he can no longer think about the situation too closely now that the time had actually arrived, or it begins to feel like his brain will actually explode. George dreads to think of what he’ll do when the other man actually appears in front of him. \n\nSomething stupid probably.\n\nChecking his phone for the time and any texts again, George almost drops it when he jumps at the sound of a familiar voice coming from behind him.\n“George?”\nHis feet twist his body around for him, drawn to the source of the melodic voice like a moth to a flame. Casting his eyes up from his phone, George finally unites the voice to a face.\nGolden hair and tanned cheeks dotted with a light dusting of pale freckles stand nearly a foot above him. The difference between their heights is noticeable, as George cranes his neck slightly further upwards to make sure he maps the entirety of his features.\nHis eyes are green and even though George knows they must be even brighter in reality than they are to him, he still thinks they’re beautiful, gleaming under the harsh lights of the terminal.\nA tentative and careful pearly white smile is currently stretching out across those tanned cheeks, accompanied by a breathtaking scrunching up of the man’s glittering eyes. \n\nDream.\n\nLonger rather than shorter blond hair is shaken out of his eyeline, mesmerising George until he dares to follow the other’s gaze across his own body and suddenly he’s heating up rapidly in his hoodie.\nOh.\n\nThe hoodie.\n\nGeorge finally takes a breath and lets the tsunami of red blush rush over his face, accepting his fate as inevitable anyway. He takes a few steps forward, surprisingly easily, he likes to think, but his brain almost short-circuits when Dream speaks again.\n“It’s you.”\nBreathless in tone and dazzled by his perfect smile, the words do something funny to George’s poor heart. \n“It’s me.”\nIs all he can get himself to say back, half frozen, half physically buzzing from excitement.\nHe watches as Dream slowly places his bag on top of his suitcase, not breaking their eye contact as if they’d lose each other forever if they looked away. \n“I-... You-,” Dream tries to start, visibly frustrated with himself when he stutters. George withholds his chuckles, heart palpitating rapidly, although he’s pretty sure that Dream notices anyway. He quirks his mouth upwards in what he hopes is a reassuring smile. \nIn the end, Dream takes a couple more seconds and few breaths before he gives in and asks, eyes searching his own, “Baby, can I hug you?”\nGeorge’s heart is going to burst out of his chest in the middle of Heathrow airport. Despite this, he feels his own expression soften and watches Dream’s brighten impossibly more as he nods and tells him breathlessly and barely audibly, “Yes.”\nIt takes no longer than a few seconds for him to find himself engulfed in the taller’s strong and grounding arms. Once his heart gets over the initial shock and starts beating again, George lets his hands grip tightly onto the soft cotton of Dream’s shirt; arms naturally weaving over his shoulders as Dream had wrapped his arms tightly around George’s middle.\nHe thanks the heavens that it’s winter and he’s got at least two layers of clothes on, because George worries a misplaced touch of skin-on-skin would’ve sent him fainting to the floor. \nSettling a little and moving his hands to press flat against Dream’s back, George suddenly realises that Dream‘s form is slightly muscular.\nIt’s largely unidentifiable without the accompaniment of touch, him being a tall and rather slender individual, but it’s definitely there. Because George can feel it under the thin material of his t-shirt and he can’t help but think that with his height and strength Dream could probably easily pick him up.\nThe angle has him slightly on tip-toes, leaning in towards Dream’s body. Their heads are side by side, resting on the other’s shoulder. George situates his cheek on the other man and inhales; he’s immediately greeted by the warm sandalwood scent that had clung the baby-blue hoodie when he had first received it. \nIt does something that calms the pace of his rapidly beating heart, like sinking into a warm but deep sea, and George is glad for it. Not to mention that he’s even more glad now that he’s in the presence of the very source.\nStarting to slip into a state of relaxation rather than anxiousness for the first time in about a week, George can’t help himself from emitting a contented sigh. \nHis body is electrified again, however, when against the flushed skin of his cheek, George swears he feels Dream’s mouth pull upwards into a giddy smile. The strong arms around his waist tighten too, as if unwilling to let go, but eventually he does, because they have to. Because they’re still in the middle of the airport.\nWhen they both retract from the embrace, Dream’s hands linger at either side of his waist causing a severe flood of red to rush to the surface of George’s skin. The taller man’s emerald eyes still eagerly roam every square inch of his face, as if etching it into his mind. George has already done the same to Dream.\nThey’re looking at each other, still slightly dazed and in a state of disbelief that this was actually happening, like, right now. George forces himself to speak before his stupid mouth can supply something else.\n“Do you have all your bags?”\nGeorge asks, proud when his question is spoken without heinous spluttering, as he had expected. Dream looks down, checking quickly, and gives him the affirmative with a (cute) little nod.\n“Let’s get in the car then.” George had to actively stop himself from saying, ’Let’s go home then.’ and exposing the fact that he associates Dream with being home.\n“Okay.” Dream drawls out, tugging his suitcase in line behind him. The two of them fall into step easily, making it to the sliding doors just before the car park. \nIt’s already dark outside because of the early-setting sun in English winters, the harsh bite of cold has not relented either. George is snuggling Dream’s hoodie closer to his body, thankful for its warmth, when he turns to look at the other.\nOh, right. \nGeorge had forgot that Dream is a through and through Floridian, with not much experience of foreign countries at all, let alone cold ones. He’s currently still only wearing his white t-shirt and grey joggers, meaning George is very easily able to see him shivering and shaking when the doors slide open and the merciless wind slaps cold air into their faces.\n“Cold?” He asks, even though it’s obvious.\nHis face breaks into a smile when Dream gives him a scrunched-up face that screams, No shit, Sherlock, before he breaks into the light laughter that George has heard so many times before; it still gives him a warm feeling inside to have enticed such a reaction.\n“You didn’t bring a jumper?” George starts, tone teasing, “To England? In the middle of winter?”\n“Shut up.”\n“You’re so dumb.” George throughly enjoys sing-songing back at him.\n“Of course I did,” Dream tells him in an undoubtedly defensive tone, forever drawn in to arguments with those who question his intelligence, “It’s at the bottom of my suitcase, though.”\nConsidering their options, George suddenly comes up with a suggestion. He starts moving and implementing it before he even asks, pulling up the hem of his jumper and making sure that his undershirt stays in place as Dream stares across at him both curiously and confused.\n“I swear to God, you’ll freeze to death,” George insists, “Here, take mine instead...”\nDream’s giving him a questioning raised eyebrow and George continues, “It’s- it’s yours anyway, so... it’ll fit.”\nHe’s watching Dream’s face and for a good few seconds he receives a absent and misty look that he can’t quite place. \nIt soon rapidly turns once George has the pale-blue material of the hoodie bunched up under his armpits, ready to bring it over his head. He never gets to this part, however, as two large hands reach out and clutch onto his own to stop him.\nTheir eyes lock together for a couple of seconds before they both seem to fully appraise the situation. George can’t help but glance down at where Dream’s hand is entirely engulfing his own. \nDespite the situation currently, they’re amazingly warm, so George is a little disappointed when Dream’s bright eyes widen in recognition of his actions and he slowly retracts them from George. \nHowever, neither appear to be able to drag their gazes away just yet. George thinks he might see some colour returning to Dream’s cold skin when a dusting of light pink appears on his cheeks.\n“No, no, no,” The taller man protests, the removal of his hands being replaced with him stepping closer to George anyway, “Uh, keep it on,” \nEither Dream is so cold his teeth are physically chattering, or he’s tripping up over his words again.\n“It suits you, baby,” George is going to PASS OUT, “I’ll be fine.”\nWhen Dream realises he’s about to protest, he continues.\n“I don’t want you to be cold.”\nHe has to finally break the increasingly intense eye contact at this point because George can literally feel himself melting away.\n“O-okay,” He manages, twisting his body around to face the exit again, he clears his throat and asks, desperate to change the topic and save his poor restless heart, “My car’s this way.”\nDream nods down and across at him. There’s a quirk pulling upwards at one side of his lips and George can’t decide if such a smile is fond or teasing. He supposes he’s fine with both. \n“Let’s go then.” Dream announces, dragging his suitcase back behind him as they brave the winter air. \nIf you ask George why he keeps so close to Dream that they practically rub shoulders as they cross the car park, he’ll tell you some rubbish about body heat, or not wanting to get lost. But really, George wants to keep reminding himself that this is real.\nThis is all real. Him and Dream. Together, finally. This is real, and he’s so, so happy his heart could burst.\n \n~\n \nAn hour later and they’re already entering George’s apartment. He feels weirdly subconscious about showing Dream the whole thing, knowing the other lived in his rather luxurious family home, but Dream is excitedly and animatedly bounding around from room to room, even despite his (as deemed by Dream himself) ‘long-ass flight’.\n“Ah,” Dream says triumphantly after finally opening the door to George’s office, “The famous set up.”\nGeorge giggles at his ridiculous over-the-topness and these only intensify seeing Dream place himself down excitedly in his chair, shooting him a gleaming, white grin.\n“You hungry?” George asks, because he certainly is and he’s not the one who’s been on a plane journey today.\n“Ooo, yes please,” Dream replies, standing up from where he was seated, his tallness hitting George again by surprise, now seeing it in comparison to his own apartment, “The plane food was so bad.”\nGeorge laughs, agreeing with him because he can definitely imagine. \n“Pizza?” He asks once Dream reaches him at the door.\n“Pizza.” The other agrees with a large, slanted smile on his face. \n \nLuckily, it only takes about twenty minutes for their food to arrive, the pizza place being situated only down the road from George’s apartment.\nWhilst unstacking the boxes on the kitchen table, he announces, “We’ve definitely bought too much.”\nDream shakes his head at him, grinning, “I think you’re underestimating me.”\nRolling his eyes, George picks up as many boxes as he can and carries them to the coffee table in front of his couch. Dream follows with the rest in his arms.\nThey start unboxing it all and a delicious aroma floods the air making George’s hungry mouth water. The two of them look up at each other from across the couch and catch eyes, both widened in glee from the tempting scent and they can’t help but to fall into laughter.\n“You bought a margarita?!” \nDream exclaims, sounding almost offended, handing George’s box over when he opens it. George accepts it graciously, mouth watering, but is still able to defend himself.\n“Yes I did-,“ George starts, speaking quickly because he knows Dream will try and butt in (and he does, George just speaks louder), “It’s good, okay? The extra toppings just get in the way.”\nBy this, he’s referring to Dream’s pizza which is currently loaded with various types of meat from beef to chicken and beyond. He doesn’t care for such creations; George prefers the classics.\nDream takes a large bite of his slice of pizza before he protests, tutting loudly, “But it’s so plaaaain.”\nTheir debate continues for around sixty percent of their dinner, before George suggests they turn on a film.\n“What do you wanna watch?” George asks as he watches Dream devour the last piece of garlic bread, reaching for potato wedge from the portion they’d decided to share and dipping it in to the sauce at the same time.\n“I don’t know,” Dream says helpfully through a muffled mouthful of food, “An action film, maybe?”\nGeorge screws his face up in disgust, “Ew, you like shitty action films?”\nThe taller man lets out a hearty laugh before he replies as he closes another empty pizza box, with a glint in his eye, “I like making fun of shitty action films, there’s a difference.”\nSo, George agrees, chuckling along with him too as he clicks on the first action movie that comes up when he opens Netflix. \nAbout ten minutes in, George can only think about just how freaking bad this film is, but also only about Dream’s silly little laugh at his own jokes and comments as they go along. Admittedly, he may spend more time looking anywhere other than the screen in front of them. \nApproximately halfway through, they take a break, as requested by Dream (surprisingly), to put all their discarded boxes in the bin. He was right, George did underestimate his eating abilities.\nThey settle back on George’s comfy and plush couch, one at either end but essentially side-by-side due to the small amount of room.\nSuddenly left without anything to do, George’s hands fiddle with the hems of his hoodie’s sleeves as he guffaws at something stupid Dream says again. He lets his head fall back onto the cushions of the sofa and, soon, George can feel the heavy temptation of sleep; his eyelids shutting hanging over him.\nHe does for a brief second, even though he’s determined to push through at least until the end of the film because Dream is here and he can’t waste any precious second, but he ends up jolting himself awake again as his head falls forward abruptly.\nThis must have caught Dream’s eye because the next thing he knows there’s a short and odd silence, so out of place that George feels the need to say something, but then he feels a light and tentative tap on the side of his arm from Dream’s direction.\nUpon looking over, George finds that Dream has sunk down against the back of the couch to enable his long and lanky body to lie sideways, still able to look at the TV screen. This is not it, however, as the arm Dream is not currently leaning on as a head-rest is opened widely and George immediately knows exactly what it is: an invitation.\nBordering on the edge of consciousness, it doesn’t take much for George to give in, shoving all thoughts to the back of his mind for the morning to deal with. \nHe watches Dream’s face carefully as he begins to lower himself down in front of him, worried he may have misinterpreted somehow. Dream’s features don’t change from their relaxed and expectant expression, so George takes that as a good sign. \nThe other’s slanted grin directed his way quickens his heart even further as he lowers himself in front of Dream, facing towards the television and pressing his back to Dream’s broad chest. \nWarmth, is the reaction he processes in his fatigued state before he finally shuts his eyes to bask in it.\nHis breathing evens out, and soon, he can literally feel himself drifting into a deep and much-needed sleep. \nOne of the last things he feels before succumbing to his exhausted body’s needs is Dream’s free arm curling over his waist and hooking George’s body even closer to his, palm splayed across his hoodie-covered chest.\nGeorge can’t work out whether Dream still knows he’s partially awake, or if he thinks he’s already fallen fast asleep. \nPerfectly aligned on the couch to just about both fit on, the close proximity also allows Dream to bury his face in George’s dark hair, breathing in his scent before releasing his own contented hum.\nSnuggling and pushing back closer to the warm and solid body behind him, George responds with one of his own, letting the stress of the previous week melt away as he finally drifts into the welcome darkness completely.\nGeorge sleeps better than he has in a long while. He wakes up warm, with a pleasant feeling encircling his chest, and his face buried into the cushions of the couch... wait, couch? \nOh.\nHis eyes fly open a little too quickly for the morning, leaving him a bit dizzy when he tries to focus on the settings around him, when suddenly there’s movement from behind him of someone shuffling on the couch. \nThen George remembers.\nTrying his best to remain perfectly still, as not to wake the other, George listens to Dream emit intelligible mumbles before tightening the arm he still has slung over George’s waist. \nGeorge lets himself get pulled closer to the other man’s firm chest and shows a small smile when he can feel his soft breaths coming from behind him and tickling his hair.\nHe can’t believe they slept the whole night like this, especially Dream; he can feel where the other’s legs have had to bunch up massively because the length of his couch wasn’t made for six foot three giants to fall asleep on. Dream’s legs have become entangled with his throughout the night, locking George even more securely against him.\nGeorge closes his eyes, perfectly happy to fall back asleep in Dream’s warm and comforting embrace, but he lets out a small sigh because he knows he should get up. He really should. He doesn’t want to make it weird later on in the morning if Dream were to wake up first and not like the fact that George has remained the entire night snuggled up against him.\nHe moves slowly and carefully, not wanting to stir the other man, knowing that not only has he suffered an eight hour plane journey to get here, but his sleeping schedule is normally non-existent anyway. Dream needs a good rest and George is determined to let him have it.\nHis first attempt to extradite himself involves sliding out from under Dream’s sleep-heavy arm, but when he initiates his plan it is immediately furrowed by Dream pulling him in closer again.\nSoon, George realises that perhaps a faster movement would be better, like ripping off a plaster, so he quickly rolls himself off of the side of his couch onto his, luckily, carpeted floor. Dream’s hand successfully slips off him and George misses the warmth straight away, but his second attempt appears entirely successful apart from an admittedly cute and grumpy mumble that comes from Dream.\nThe man looks so calm and peaceful sleeping soundly on George’s sofa, a stark difference to the loud and energetic persona he consistently portrays on screen. With a fond smile, George turns to the kitchen to see what he can supply for breakfast.\n \nDream walks into the kitchen no less than thirty minutes later, still, George is happy he allowed the man some much needed sleep.\nGeorge is currently not-so-successfully attempting to make pancakes, thinking it would make a nice surprise, but now he’s cursing his decision. The mix keeps either over-sticking to the pan or remaining too runny and George can almost feel steam coming out of his ears from the frustration.\nWhen he’s attempting to scrape his failed third attempt out of the pan and into the bin, Dream unfortunately walks in. It takes a moment for George to feel a bit embarrassed at his lack of cooking skills, however, because he’s too busy looking at the taller’s groggy appearance.\nDream’s golden-blond hair is sticking out in all directions, leaning slightly towards one side where the other had been pressed to the arm of the couch all night. He squints his eyes under the harsh white-lights of George’s kitchen and brings a slow hand to rub at them half-heartedly.\n“Hey,”\nSparks shoot down his spine at Dream’s morning voice, tone lower and more gravelly. \n“Having trouble?” He asks, mouth forming a lazy grin as he crosses the threshold.\nSighing, George nods defeatedly, he does need help after all, otherwise all they’ll have to eat will be a partly inedible concoction of flour and eggs. He’s kind of sad though, he wanted to do something nice for the other man after he’d come all this way to see him.\nGeorge laughs a little, then sighs, “I really don’t know what I’m doing wrong.”\n“Here, let me try.”\nDream walks up next to him, taking control of the blazing hob and George happily lets him. Their shoulders bump idly, side-to-side, as George watches intently from beside him, studying Dream’s skilful (and definitely not attractive) hands as he easily distributes the mixture in the pan evenly.\nLaughter bubbles out of the taller’s mouth when he turns to see George’s involuntary face of amazement.\nOf course Dream would be good at making pancakes, He thinks, trying to withhold his eye-roll of annoyance, He’s good at everything.\n“I cook them sometimes for my siblings,” Dream explains, holding the pan at a particular (and probably, knowing him, well calculated) angle for the pancake to heat up evenly.\n“Should I flip it?”\nGeorge had not even considered doing such a thing, planning to go at it with a spatula in hand, but he certainly trusts Dream more with flipping the pancake than himself.\n“Sure, if you want.”\nOver-dramatically, Dream prepares himself, taking in a deep breath and causing George to laugh. He takes the pan away from the hob and throws it up into the air, George hopes it all stays intact for the sake of his kitchen floor. \nOf course, Dream catches the pancake perfectly and precisely and, of course, he makes a large, silly grin at George as he does so, causing George’s heart to race.\n“See?” The taller says through happy bursts of laughter, maintaining eye-contact with George as he replaces the pan on the hob, “That’s how it’s done.”\nGeorge rolls his eyes at his behaviour, but not without an uncontrollable smile, and seats himself at the breakfast bar, across from where Dream is standing. He rests his chin in his hands and quickly feels himself reddening as Dream continues to stare at him.\n“What?”\nGeorge asks, desperate to break the silence before he overheats. He watches Dream’s smile stretch even wider than before, slightly shaking his head before answering.\n“Nothing,” George gives him a raised eyebrow like he doesn’t quite believe him. Dream’s eyes are cutely scrunching up into the grin now too, “I’m just... really, really happy.”\nHeart pounding against his chest at a million miles an hour, George luckily manages to reply in a somewhat sturdy, audible voice and with a soft smile.\n“Me too.” \nThen he repeats the words again and again in his mind because he truly means it. \nMe too.\n \n~\n \nThey decide to spend Dream’s first day in London sightseeing, because how can you not when visiting a city with such a notorious history. \nGeorge enjoys the first half of the morning, visiting famous landmarks such as Big Ben and Saint Paul’s Cathedral with plenty of beautiful architecture and views to ogle at. He doesn’t, however, enjoy the second half quite so much, as Dream had dragged him to the London Dungeons, although Dream is currently claiming it to be the best part of their day so far.\nGeorge suspects it might have something to do with the fact that he kept emitting loud screams at each actor they encountered that tried to jump scare them. \nHe didn’t mind so much in the end, however, as Dream had eventually offered him his hand in support to allow them to make it through to the end. George had clutched on tightly, refusing to let go until they saw the light of day again. His heart had fluttered when Dream had just let him do so, even using his thumb to rub the back of George’s hand soothingly after he jumps out of his skin.\nThe loss of the warmth of Dream’s hand as they reach the surface again is disappointing, but in this moment George is just thankful to be out of that wretched place.\n“That was great.”\nDream says as they walk back out into the streets of London, he’s still chuckling and wheezing from the fact that George had literally clutched so tightly onto his arm and hid behind him at the last (and particularly scary, in George’s defence) jump scare.\n“That was scary.” George protests, purposely hitting his shoulder into Dream’s and displaying his best pout.\nDream laughs again, “Oh, come on. It wasn’t that bad.”\nGiving him a reproachful look, George replies, tone defensive, “It was!-”\nHe’s about to carry on when he’s stopped dead in his tracks by Dream slipping his arm over his shoulders easily and tugging George back towards him, so close that their sides touch as they walk.\n“Yeah,” Dream begins, looking down at George, pleased smirk on full show, “But you had me to protect you.”\nGeorge knows that Dream is teasing, but he can’t help but admit that it had felt that way to him; Dream means safe, Dream means protection. He can’t help but associate the two.\n“You’re an idiot.” He just sighs, leaning his head slightly backwards onto Dream’s arm just because he can and it’s comfortable. \nA small laugh from the taller man follows as he seems to recognise George’s admitted defeat. They walk together for about a minute more before Dream pipes up again.\n“Where are we going?” He asks, arm still around George, so their faces end up very close when George turns to look at him, “Do you know where we’re going? I hope you do, because I certainly don’t.”\nGiggling at him, George tells him that of course he does and that it’s a surprise.\n“Oh?” Dream questions, curiosity obviously peaked, “Is it food? I’m really hungry, I hope it’s food.”\nGeorge lets out a laugh again.\n“God, you’re non-stop when you’ve had a sufficient amount of sleep, aren’t you?”\nHe watches Dream’s eyes scrunch up in the cute way that George has recently come to love and feels a warm and pleasant flood throughout his body.\n“Yes,” Dream agrees happily, but bounding a few paces ahead of George in his excitement, meaning they finally become detached, “You love it, though.”\nGeorge rolls his eyes, but can’t refrain from thinking, Yes I do, unfortunately.\nThey reach their destination soon after, rounding the corner of the long street they were walking down to find fairy lights neatly situated overhead in the next street.\nGeorge watches the taller man as he glances up in amazement, the warm hue of the lights shadowing his handsome face in pleasing ways and the angle perfectly highlighting the sharpness of his jaw.\nDream even emits a soft, little, “Woah.” and it completely warms George’s heart for him to know that Dream had had the very same reaction that he had when he first stumbled across this smaller and less busy street of the capital.\nToothy grin on show, the taller man turns back to George to ask him where they’re going again. This time, George is able to simply point at the restaurant across the street from them.\nIt’s a small and very aesthetically pleasing building hid away in the corner of the street, it’s quite hard to find but is amazingly popular among locals and regulars. George has only been here once before, let in to this little secret of London by some of his school friends, but it was such a lovely experience with lovely food that he knew he just had to share his second visit with someone who means a lot to him, and now he finally gets to.\n“Oh wow,” Dream comments as they’re stepping inside, taking in the warm and luxurious interior. Soon, he realises what George has been waiting for him to realise, “OH! This is a sushi place?”\nA blinding and pleased smile works its way across George’s face at Dream’s visible excitement, turning to face him as he asks, allowing George to see the awed glint in his eyes.\n“Yes, it is.” George confirms, unable to suppress his happy grin as a waiter offers to take their coats. Dream seems surprised at the level of service, letting the man take his coat yet the the interaction leaving him in a bit of a daze.\n“Is this place, like... fancy?”\nGeorge laughs at his careful choice of words before reassuring him, “Not really, just a bit upmarket with their service and food and stuff.”\nHe doesn’t want Dream to think they’re underdressed or anything, standing in the restaurant currently in their jeans and hoodies. George had purposely picked such a place; not so fancy that it feels like it’s some sort of date or something (it’s not, he reminds himself, even if it’s felt that way the whole day to him), but fancy enough to show that George feels this is a special occasion.\nThey’re eventually seated at George’s favourite table, despite only having been there once, beside the window and tucked into the corner away from other diners. The menus are handed to them promptly and George takes a quick look, even though he already knows what he wants, before exchanging this in return for the view of Dream intently studying the list before him.\nHis green eyes flick up and down the menu and his tongue makes an appearance every now and then, wetting his lips; George is slightly mesmerised.\n“George.”\nThe call of his name has him crashing back down to earth.\n“Mm?”\n“I literally do not know what any of these meals are,” George chuckles at his serious tone and Dream’s voice immediately lightens up, protesting, “I told you! I’ve only ever had crappy Walmart sushi! This is proper,”\nHe gestures to the menu, looking back down briefly and up again before promptly returning back to the menu with wide eyes, doing a double-take.\n“And EXPENSIVE. Is this okay?”\nGeorge is smiling widely again, charmed by the man before him under the soft and gentle lights of the room.\n“Of course it is,” He tells him, voice level and sure as their eyes reconnect, “I’m paying.”\nGeorge thinks Dream malfunctions, seeing his facial features falter for a second or two. He finds it incredibly funny.\n“Wait, no-“ Dream begins protesting, just as George had expected.\n“You literally spent hundreds on a flight to come see me,” He tells him, speaking loudly as to drown Dream’s objections out, “The least I can do is buy you a nice dinner.”\nSeemingly considering this for a second, Dream maintains their eye contact whilst narrowing his own a little. It makes George’s heart beat faster, but it soon slows again when Dream seems to make up his mind, nodding slowly.\n“Okay, fine.” He relents, still not sounding too entirely happy about not contributing, but George will take it as a win.\nThere’s a short silence as George takes the opportunity to beam happily at him and his victory, then Dream breaks it again with a chuckled and sheepish, “I still don’t know what to order.”\n“Just get the same as me?” George proposes, kicking his foot lightly under the table, “It’s good, I promise.”\nDream grins back at him and taps his leg back as he agrees.\n \nLater that night, he informs him that it was, in fact, very delicious indeed as they bundle through the entrance of George’s apartment rather ungracefully, running high on adrenaline from their big trip to the city.\nThey’ve had a long day and George feels not only physically tired, but his cheeks hurt from smiling and laughing all day too. He’s locking up the door when Dream tells him he’s going to get changed.\n“I smell of,” He takes an exaggerated sniff of his coat as he places it back on the rack and George screws up his nose from experience, “Wait, do I even want to know?”\nGeorge giggles, chucking his keys onto the side, “Probably not. That’s London for you.”\n“Lovely.”\nFollowing the taller man down the hallway, George intends to do the same, eager to remove the weird mix of sweat and pollution that’s always picked up on the Underground however hard you try to avoid it.\nDream veers off to the left, into George’s spare room (that he hasn’t, ironically, spent a night in yet) and he continues further on into his own room.\nHe can’t stop smiling. George is starting to think maybe this will turn into a problem soon, but he’s so, so happy that he refuses to analyse it on a deeper level yet.\nOpening his drawers, he selects his comfiest and favourite pair of pyjama bottoms and shrugs on a random t-shirt with it, fully intending to slip Dream’s hoodie on too. \nHe daren’t wear it outside today due to the fact that it would’ve probably got contaminated too by the murky London air and it is definitely too precious for him to risk that happening.\nIdly, he scrolls through his phone for a minute before an influx of texts start coming through from Sapnap (or ‘Snapmap’ as George has so gracefully named him in his contacts) about both his and Dream’s lack of communication with anyone for the past couple of days.\nOne literally says he’s going to ‘die from the suspense’ of awaiting their answers, but a yawn flies out of George’s mouth and he reasons that his friend can at least hold out till the morning. He’s putting his phone on charge and to the side when he hears a call from the other room.\n“George? Could you-” He’s already up on his feet and at the doorway of the spare room before the latter half is spoken. Dream laughs at his haste.\n“What is it?” George asks with a quirked smile, suddenly feeling sheepish and folding his arms under his armpits.\n“Well, um,” George‘s smile soon falters because he’s not a fan of Dream’s more serious tone at all. It doesn’t help that he can’t even see the taller’s face at the moment as he’s turned back to his spread-out suitcase on the bed and is currently digging through it.\n“I was wondering if you’d give me my hoodie back?”\nGeorge can feel his whole face pale, his heart rate has slowed to the absolute minimum as he desperately tries to chase the meaning of Dream’s words round and round in his head. \nHis arms fall from where they are tucked up under his sides and rest motionless beside him before he starts picking at the hem of said hoodie, bunching the material hard in his fist. Suddenly, it doesn’t feel so warm anymore, as if a cold gust had swept him up and carried him away.\nHe feels his lips quiver, but he bites them just a bit too hard to make them stop, reminding himself that the hoodie doesn’t mean to Dream what it does for him. It’s just fabric, interwoven cloth that serves a functional purpose, not theirs, his.\nDream doesn’t like him, at least, not in the way a minuscule piece of George’s brain had slowly started to hope and think from all the... God. He’s such an idiot.\nEyes stinging with the beginnings of tears he’s desperate not to let slip, George takes a large gulp of air before he attempts to speak. It’s not enough, he still feels like he can’t breathe.\n“Oh-” The simple agreement catches in his throat, he clears it abruptly and scrunches up his eyes as he feels tears threaten again, “O-okay.”\nThe corners of his mouth have dropped for the first time in what feels like a week, George immediately misses the giddy emotion he’d been riding high on ever since that first day. He yearns for it.\nWhen he finally glances up again, after a series of rapid blinks at the carpeted floor, George watches as Dream finally turns to him and sees his green eyes become wide as they meet his.\nConcern and confusion flash over Dream’s face as he immediately begins to hurry over to George before he suddenly stops in his tracks, realisation dawning on his features. \nHis jaw drops minutely lower and his worried eyes fly wider open as he hurriedly begins to backtrack himself.\n“Oh,” His voice is heavy and apologetic as he speaks. Dream moves forwards a bit more and gestures with his hands as he speaks, “Oh no, no, baby, that’s not what I meant.”\nFor a second, George thinks the taller is going to grab his hands before he seemingly changes his mind, turning on his heel back to the suitcase, rummaging through it more rapidly. \nGeorge can’t help but let out a pathetic sniffle as he watches helplessly from behind, pale-blue material still clutched between his fingers. He’s so confused and he doesn’t know where to look, what to do or even what to think. \nHis gaze does not waver from Dream’s broad shoulders, however, and the other seems to stop for second in his movements as he seems to stumble across what he was looking for.\nGeorge’s body moves of its own accord, drawing him forward and closer towards Dream, away from the doorframe he’d been using to steady himself this whole time. \nWhat feels like hours to George in this moment is really only a few seconds; Dream turns back to face him and is looking at him with with an uncharacteristically unsure smile that pulls higher into his left cheek than the right.\n“I, um,” Dream is scratching the back of his head and is holding a something neatly folded in his tightly clutched hands before him. George still has no idea what’s going on, “I thought you might... might want a new one, you know. That, uh, smells more like me?”\nImmediately, George’s failing body bursts back into colourful action. He drops his handfuls of his hoodie as he holds contact with Dream’s wavering eyes and can feel the return of his pounding heart close against his chest. \nHe watches, dazed, as Dream displays what he’s holding in his hands: another hoodie, just as soft, large and probably as comforting as the one of Dream’s he’s had for weeks now, only this time it’s a charming and familiar chartreuse green.\nA relieving warmth spreads its way soothingly across his entire body, wrapping its way across every square inch of his skin and his mind screeches to an unexpected and stupefying halt.\n\nOh.\n\nGeorge looks more closely up into Dream’s green and glittering eyes, searching for something, anything, that should stop him from carrying out his next move in this moment, but he finds none.\nHe makes two quick steps forwards and then he’s right there, in front of Dream, flinging his arms around the taller’s shoulders and pulling him in by the neck to meet George’s lips in a crushing and passionate kiss.\nInstantly, George feels as if fireworks are ignited within him, sending sparks of heat from the core of his body to the length of all his extremities. His fingers finally feel just how soft the ends of Dream’s dirty-blond hair are and the smoothness of the other’s skin against his own.\nThere’s a couple of awful seconds when George starts to think he’s made a terrible mistake, that Dream is going to push him off and glare at him with disgust and confusion in his eyes. But then it happens. \nDream emits a light gasp of surprise against George’s pink lips, reaching his hands out to grab at either sides of his waist to make sure that this is real. That this is actually happening. \nGrabbing on tightly to George’s sides and pulling him closer towards him, he parts his mouth widely against George’s and administers a deeper, sweet and lingering kiss. Their mouths to slide together in a delectable way that has George hum delightedly against Dream’s mouth as his hands dig deeper into the flesh of the taller’s back and weave upwards into his messy blond hair.\nThe taller’s lips are soft and warm against his own, sending pleasant shivers up and down his spine making him feel continuously tingly. And just when George thinks he manages to get used to that, Dream pulls back a little before diving back in with his tongue, lavishly tasting his own and erupting another pleased sound out of George.\nDream’s hands wander idly down his sides, electrifying every inch of his body when they meet the slither of skin exposed between his hoodie and bottoms. The taller takes the opportunity when George parts his lips to emit a small gasp to deepen the kiss even further \nGeorge slides his hands from where they were carding through Dream’s soft hair to land on either sides of the taller’s face, cupping his sharp jaw and flushed cheeks fondly as he shyly and tentatively pushes back against Dream’s mouth, allowing himself to become fully immersed in this moment, intent on remembering it all perfectly, as it should be.\nThey part for breath and George slowly lets his eyes open, afraid that if he does it too quickly he’ll just wake up to find this whole day has been a dream. \nWhen he does, however, he finds the most beautiful and handsome sight; Dream is looking down at him, affection and awe clearly glimmering in his eyes, he also has the widest and most giddy smile George has ever seen stretched across his face, as if it’s uncontrollable.\nEyes fully open now, George stares intently up at Dream, words failing him as he maps the breathtaking image into his mind. Dream still rubbing light and distracting circles into the exposed expanse of his skin certainly isn’t helping, but he’s sure he’s grinning just as stupidly and wide back right now. \nTheir bodies are so close together George almost feels as if they are intertwined, sharing body heat and breathing air. Dream speaks first, sounding just as out of breath as George feels, thankfully.\n“George, I-“\nFeeling bold, he pushes up on his tiptoes again and interrupts Dream with another kiss. It’s entirely worth it, he decides, when he pulls back to find Dream’s face flushing a dark red again.\n“Oh my God,” Dream tries again with a sigh, flexing his grip around George’s waist again and glancing down into his faux-innocent eyes, “Let me just-“\nGeorge giggles again as he butts in again but this time with a longer and more lasting kiss. He feels Dream hum in protest against his lips, but his body is soon pulled even more taut against the taller’s broad and firm chest as he eagerly licks back into George’s open mouth.\n“George!” He calls again, muffled by the other’s lips, softly but still an exclamation as he slides his own hands up to hook behind George’s head, playing with the hair at the nape of his neck softly. His eyes are filled with glee and exhilaration as he speaks, “Stop it and let me tell you that I like you, godammit.”\nHeart somehow managing to flutter, pound and burst suddenly at the same time, an involuntary and ecstatic grin flies onto George’s face as he hears the words finally said. \nHe kind of forgets how to function for a few seconds before he eventually jerks back to action, running a thumb across the skin of Dream’s flushed and tanned cheek as he tells him in a teasing tone, “Yeah, I kind of got that.”\nGeorge lets a cheeky lopsided grin bloom on his face and Dream emits a burst of laughter before he tells him in a low and fond tone, “You’re an idiot.” before he’s leaning back down again to capture George’s lips in a lingering and luscious kiss that quickly stifles the other’s bubbling laughter. \n \nAbout an hour later, they find themselves snuggled deep within the comfy sheets of the bed in the spare room. George is not only warm from the quilted sheets, but also from the soft hands tracing up and down his body as Dream lazily kisses him, faces tucked against the pillows.\nGeorge’s hands, seeking warmth after having been cupping the other’s cheek, now move to Dream’s chest, splaying flat against the firm expanse. Immediately, he can feel a rush of blood back to his fingers (as well as the taller’s defined lines of muscle under his hoodie) and George lets out a happy and contented hum into their kiss.\nThe sensation is almost familiar to him now, having been making out with Dream practically non-stop since he had made a gracious leap of faith. It’s like they can’t keep their hands off each other and George feels like a lovesick teen all over again, only this time it’s a hundred times better.\nWhen they pull back slightly and George takes the opportunity to study Dream’s face, his mind races at the picture he makes. Lips red and partly swollen from the heat of their kisses, golden-blond hair truly mussed, falling prettily across his face, and that stupid pleased grin stretched across his cheeks; George knows what that grin means now.\nHe watches patiently as Dream’s gleaming eyes roam over his features too. George is sure he looks not too different in appearance, as he catches the look of fond admiration in Dream’s gaze, and takes the opportunity to slide his hands down to the hem of the other’s jumper, placing his cold hands there purposely to make him jolt against him. \n“Ah!” Dream exclaims in surprise as his body jerks upwards and away from George’s icy hand, reacting on innate instinct. He soon supplies him with an over-dramatised glare and a drawn out whine of, “Owww,”\nGeorge’s grin maintains, pleased and beaming, “Please don’t do that again.”\n“Ow?” George teases, rolling his eyes as he slips his hand over the side of Dream’s body to pull them closer together, “I thought you were meant to be tough.”\nDream splutters a little before raising his chin upwards to move his head away to think, mouth forming a small and cute pout.\n“You caught me off-guard, though,” He insists, shifting against George and turning his body so that they fit even more perfectly together, yin and yang, “So it doesn’t count.”\nGeorge just tuts as he nuzzles his face into Dream’s neck before he feels mischievous and begins to leave little, gentle kisses there.\nHe can feel the entirety of the taller’s body tense against him and he presses a stretched smile against his skin. Dream’s hands on his waist clutch more tightly and there’s a sharp intake of breath from above him.\n“Baby,” Dream breathes out lightly, a hand reaching up to slide through George’s hair as his mouth continues to suck gently on his exposed skin, “Baby,” he then emits, more as a moan than anything, and George can feel a smirk pulling at his lips.\n“If you keep doing that...” \nDream finally says after George moves his head slightly away from the proximity of his red and flushing skin, trailing off and saying the rest with his sharp eyes. George feels heat pulling at his stomach and excitement bubbling through him, but he decides he has to take the moment and opportunity to ask.\n“Why do you do that?”\nAt the change of topics, Dream looks confused, eyebrows furrowing downwards as he responds, “What?”\n“Why do you call me ‘baby’?” \nGeorge finds it hard to look him in the eye as he says the word back to him, so he buries his head against the taller’s chest this time. This means he can feel the moment Dream’s breathing halts at the question too.\n“I, um...” \nDream’s words quickly fall into silence so George tilts his head up in such a way that enables him to give the other man a questioning raised brow. His cheeks are a pretty shade of crimson, contrasting the bright white of the bedsheets beautifully; George can’t stop smiling.\n“Well,” He starts again with an abrupt clearing of his throat, “Uh, the first time, it just, I don’t know, kind of... happened.”\nFiddling with the drawstring of his new hoodie, George shoots him a patient look, encouraging him to go on. \n“And then I saw how you reacted, blushing and going all shy and everything, and it just made me want to say it again and again,” Dream’s glancing down at him now, a soft grin stretching across his face.\nDammit. George thinks; his attempts of teasing the other have backfired. Again.\nHis own features are lighting up a baby pink right now, for sure, and he’s helpless in trying to avoid it. Dream’s grinning even more widely down at him as he speaks.\n“Have I told you that I love it when you wear my hoodies?”\nHe lands a light kiss into George’s dark hair and tightens his grip around his middle with his strong hand.\nGeorge can’t withhold his smile as he looks up at Dream under his lashes and answers him softly, “Not nearly enough times.”\n“We have to tell him.” George says, but not wholeheartedly like he’s fully intending to. \nHe glances up at Dream’s face from where his back is leaning against his warm chest on the sofa. Somehow, they’d ended up snuggled on the couch together on a particularly chilly winter’s morning, even though they had only been intertwined in the spare bed mere hours before.\nGeorge had cooked Dream breakfast this time (and very successfully, may he add), serving a sizzling and delicious English breakfast consisting of sunny-side up eggs and perfectly browned toast among many other things.\nDream had, unhelpfully, sat at the breakfast bar whilst George was focused on his cooking, staring at him intently and giving him soft smiles that made him blush when their eyes caught. But, George is just glad that he finally got to cook something nice for his... boyfriend?\nGeorge suddenly realises they never really got to that part last night, distracted by... other things. He sits up and brings his head to align with the blond’s, who turns to him with a questioning gaze.\nTaking a deep breath, George decides quickly that it’s just better to ask and know, than to suffer in his mental strife alone.\n“Hey Dream, are we- um,” His confidence suddenly diminishes at the crucial moment under his green-eyed gaze, “I was just wondering if-“\nThe other man, who appears to have been watching him carefully, but with an amused smile and bright eyes, finishes for him.\n“If we’re together?”\nGeorge nods, unable to do anything else, playing with his hands in his lap and avoiding Dream’s gaze. The way he says the word has his head running dizzy and heart skipping in too many ways.\n“Of course,” Dream answers in a sure tone, like it was an undeniable fact. His face soon falls and his pitch lowers as he seems to realise something mid-sentence, “That’s, uh, if you want to be... of course.”\nGeorge has to bite his lip to process the adorableness of the other falling over his words in front of him. Something only he can make this unstoppable and loud-mouthed man to do.\n“I really do.” \nHe says sincerely, not letting a falter creep into his tone as he reaches for Dream’s hand to grasp. He always forgets how damn big they are and how his own hands feel seemingly delicate when he holds them.\nA beaming smile sweeps back onto Dream’s face and he wastes no time in grasping one side of George’s face to pull him in for a sweet kiss. George sighs contentedly against him lips and inclines his head further towards him.\n“Okay,” Dream says, substantiating it with another kiss, “Boyfriend.”\nGeorge is still grinning at his silliness and flushing red when he finally recalls their earlier conversation that had got swept away.\n“We have to tell Sapnap soon,” Dream gives him a few chuckles and a lazy grin at his words as he pulls them both back down to lie on the couch again, “I’m serious! He’s literally sent me six death threats this past week.”\nDream lets out his familiar wheeze at George’s slight over-exaggeration.\n“It’s not funny,” George continues, pouting as he stares pointedly up at the sharp lines of Dream’s face, “I’m starting to think he might just actually get on a plane to London at this rate.”\nHe doesn’t know what to read into it when his words cause Dream’s arm around him to tighten and pull him closer into his chest, but he hazards a guess when he catches the taller’s eyes and sends him a narrowed gaze that says, ‘Protective much?’, and Dream’s face rapidly blushes shades of pink.\nSuddenly, and quite conveniently, Dream decides to answer, “Well, how do you want to tell him?”\nMulling it over in his busy brain, George rules out FaceTime straight away because his poor heart could not survive doing it face-to-face. He then further eliminates TeamSpeak, Discord, good old-fashioned phone calls and all things of the sort because then it somehow feels even worse if George can’t see his facial expression, so you can see his clear dilemma.\nHe voices this all to Dream who humours his ranting massively, looking upon his boyfriend with a soft and fond smile as he runs a hand lazily through his short, dark hair.\n“Text?” He suggests half-heartedly. George considers it.\n“Isn’t that a little too underwhelming and impersonal?” George asks, voice becoming higher and higher in pitch as his options narrow. Dream just lets out another hearty laugh, George scowls at him and whines, “I don’t know what to dooo.”\nHe lies still, head on Dream’s chest and full of rambling chaos; the only thing keeping him sane right now is probably the calming fingers carding lightly through his hair.\n“George,” Dream says after a moment, breaking the settled, comfortable, silence, “Could you pass me my phone?”\nComplying, he grabs it from the coffee table that’s just about in his reach and hands it up behind him to Dream. \nHe hears the other fiddle with it for a bit after thanking him and is about to drift into a tranquil state of not thinking, when he’s interrupted by Dream gently tapping the top of his head. \nGeorge glances up quickly and is immediately met with a soft, yet brief, kiss to his cheek. His traitorous flesh flushes an all-too-familiar red, small laughs are incited from his chest and he’s about to ask Dream what that was for when he realises.\nGlancing up at the phone Dream holds in his hand, now tapping away eagerly, George can see the photo has already been sent as a message to someone... three guesses who.\n“Dream!“\nGeorge exclaims, making a feeble attempt to grab the phone out of his hands, like he could possibly reverse the taller’s action anyway. When the device is promptly held out of his reach by long arms, he settles for an unimpressed death stare instead. \n“What?” Dream asks, laughter bubbling out of him like he’s having the time of his life, “You said you wanted him to know,”\nGeorge keeps staring at him.\n“So, now he does.” Dream concludes in a content tone with a grin and a wave of his phone in the air, like all their problems have been solved. George shakes his head but can’t get rid of his fond gaze.\n“He’s gonna kill both of us even more.”\nSpeaking of the devil, Dream’s phone soon lights up with a call from the contact, ‘Simpnap’. George darts his gaze back to catch Dream’s and finds a similarly surprised look.\n“Oh, great,” George says, giving up and leaning back down to rest against Dream’s chest again, “You’ve gone and done it now.”\nPlayfully putting a finger to George’s lips to shush his muttering, the other answers the call, transferring it straight to speakerphone. \nAt first, nothing is said directly down the line, only the hustle and bustle of some busy place audible in the background. Then comes Sapnap’s heaven-splitting voice in a near yell.\n“I swear to God, DREAM,” \nGeorge and said man share an expression of both amusement and grimace as they stare at the phone waiting for the younger to continue.\n“I’m at school right now,” Sapnap is shouting slightly less, but it’s hard to tell if it’s out of exasperation or due to the level of noise, “You can’t just drop that kind of news on me by text, dude, oh my God.”\nDream finally lets out the loud and long wheeze he’d apparently been attempting to hold back, George’s giggles work their way out too, half nervous and half relieved to have it over and done with.\n“Sorry?” \nDream supplies as a question, leaning towards the phone, even though he sounds nothing of the sort. Sapnap must easily pick up on this fact as he curses at him again, causing George’s eyebrows to fly up as he looks over to Dream, who still appears to be throughly enjoying himself.\n“You guys are soooo dumb.”\nHe laughs after a couple more minutes of George explaining themselves down the phone. Both Dream and George roll their eyes at Sapnap’s cocky replies but remain silent as they can’t really argue to the contrary.\n“Shut up,” Dream tells him, but his voice reflects the grin he has plastered across his face, “As if you knew.”\nGeorge can’t help but laugh at Sapnap spluttering to defend himself down the phone.\n“I did! I did,” He sounds slightly out of breath from the fast-pace of his words, “God, I’m not blind. George wore your fricken’ hoodie for you and you flew out to London for him! Like, c’mon.”\nBlush rising quickly to his cheeks, George scrambles for the phone from Dream’s hand, keen to cut Sapnap off before he can say anything more damming.\n“Fine! Fine, whatever, you knew about it first, you win. We’re dumb.”\nDream gives him a small poke of protest to the ribs; it soon turns to him tickling George’s sides and the latter can’t help but emit a loud, gleeful yelp.\n“What are you-,” Sapnap starts before abruptly cutting himself off with a louder and plainer tone, “NEVERMIND. I really don’t want to know. Ew.”\nDismissively, Dream tells him to shut up again through laughs and intermittent kisses to George’s rosy cheeks, only this time with stronger and more expletive language.\n“Congratulations, you absolute idiots” Sapnap says, sounding rather conclusive and pleased with himself, just as a shrill bell sounds in the background, “But I do really have to go now.”\nThey chime a ‘goodbye’ in sync and Sapnap quietly tells them he loves them both before cutting off the call; George loves his friends so much, he decides as he displays a fond smile, but he loves one, in particular, more than the rest.\n \n~\n \n“Seriously, Dream,” George mumbles into the hand covering his eyes and not doing a very good job of it, landing somehow over his mouth too, “Where are we going?”\nHe hears a small chuckle he incited from the other man behind him as he’s marched along the street. George has tried to keep track of his left and right turns, figuring he might be able to work it out from that, but he had lost count when Dream had given him a lingering kiss on the lips to ‘warm him up.’\nIt’s night now, about seven or eight in the evening. They had spent most of the day playing video games on the TV against each other, and George was delighted to find that although Dream could outwit him in Minecraft almost every time, George can absolutely destroy him at Mario Kart. \nAs it can be imagined, Dream is a sore loser, exclaiming loud profanities and blaming poor item drops for his loss, but George maintains it’s all down to his pure skill. The taller man was huffy with him for about the next ten minutes (he didn’t mind too much as he thought that his pout was incredibly cute), but it didn’t last long at all, Dream caving in quickly and apologising to George for shouting with sweet, sweet kisses all over his face.\nDream had insisted on making dinner for them too, which was not too weird considering that they had soon established that he was definitely the better cook between them. But what was strange to George, however, was the fact that the other man seemed to almost rush him in eating his rather delicious spaghetti bolognese.\nHe had been even more startled when Dream had piled him into his coat and out of the door as soon as possible afterwards too. Now leading him here, standing in the middle of the pavement of a busy London street with his dumb boyfriend’s hands clamped over his eyes for a ‘surprise’. George dreads to even think.\n“Just a little longer.”\nThe taller promises, George’s back coming flush with his chest as they slow down. They make another left, swerve to dodge a few people (who George is sure are looking at them very strangely, but right now he’s frankly too intrigued to care) and the noise of mechanical traffic soon becomes drowned out by something else, something... louder.\n“We’re here!”\nDream announces happily abruptly parking George on an apparently acceptable piece of pathway. He has to squint his eyes at the bright and flashing lights he opens them up to, but soon enough, George is able to make out the sign.\n“Oh my God,” He laughs, turning to Dream with a sloppy grin on his face as the other comes to stand beside him, grabbing one of his hands softly, “Are you taking me on a date?”\nDream’s grin widens at his words before he admits slowly, “Maybeee.”\n‘Winter Wonderland’, the bright flashing sign above them reads: London’s biggest amusement park, only available in the Winter season and a hot spot for couples to frequent in the months leading up to Christmas. George had never been before, mainly because he’s never really had anyone to go with. Now he has, he supposes with a smile.\nThere’s faint screams of adrenaline and delight that dance along the thin winter’s air from the colourful rides. The sickeningly-sweet scent of fairground candy floss tickles the back of George’s throat and the pings and pops of various games in the hundreds of booths flood his ears. \n“Do you like it?”\nDream asks him, studying his expression carefully as he rearranges their grip to be more firm. George has to bite his lip to tone down his blinding smile, but he reassures Dream with an enthusiastic nod, to which the other beams wider in relief.\nGeorge swings their connected hands between them as he tugs Dream to follow him into the entrance. Obliging with a giddy laugh, Dream stumbles after him and immediately volunteers to pay for their tickets. \n“Do you want ride tokens too?” The cashier asks, dolling out change to Dream as said man stares at it intensely, probably trying to figure out the Sterling currency, George finally realises before cursing himself for letting the American take charge. All he can do is roll his eyes, though, because Dream is stubborn when it comes to getting things right.\n“Uhh,” Dream begins, reading the prices from beside him, “Just enough for one ride each, please.”\nGeorge frowns because he knows they’ve both expressed a dislike for rollercoasters and the like before to each other, Dream catches his questioning look but just waves him off with a mouthed, ‘Later’.\n“Here you go.”\nThe cashier hands over their tokens to Dream, who pockets them safely in the zip of his coat, before they thank her as they move beyond the barrier.\nGeorge is about to ask when his attention is immediately grabbed by the bright lights around him; everything is glittering like jewels and even though George can’t see the full spectrum of colours, he can tell that it’s absolutely beautiful. Another question suddenly hits him.\n“How did you even know about this place?” He asks curiously, dark brown eyes flicking up to meet Dream’s. He can’t imagine London’s ‘Winter Wonderland’ is the talk of the town in Florida, the home of about three of the nation’s most famous theme parks alone.\nDream’s face blushes, or maybe it’s the cast of the red light over his features from above, and George continues looking at him to urge him on.\n“Okay, well,” He starts with a cough and a little sheepish smile, “Don’t laugh.”\nAlready feeling the temptation of the corners of his mouth pulling upwards, George forces them back down quite unsuccessfully but nods his head diligently all the same.\n“When I knew I was coming over here,” Dream pauses a second and sighs like he doesn’t want to admit it, “Uh, I did some research, on like, cute places to go,”\nGeorge is so going to break his promise not to laugh, he loves seeing Dream flustered for once.\n“So I could...” Dream breaks off into little laughs again, “So I could ask you out.” he says finally, twisting his head away from George’s gaze.\nFace physically scrunching up from the warmth and affection he feels from the other man’s attempted action, George lifts his free hand to pull Dream’s (handsome) face back towards him. \nHe’s biting his lip again and letting out small giggles as he teases, “Awww, that’s so cuteee,”\nHe laughs even more as Dream dips his head again, almost in physical avoidance. He finishes softly, a little in disbelief at the realisation, “You were going to ask me out.”\nDream huffs out a laugh before leaning his cheek against George’s hand which is still lingering.\n“Shut up,” The other man half-mumbles, before springing into his usual, more defensive tone of protest, “We are literally going out, you can’t tease me about this.”\nGeorge just coos at him again, insisting that he’s adorable, when he realises, “Oh God, so when I ki-,” He shifts his eyes from Dream’s face as it morphs into a smirk, “Did...that... ruin your plans?”\nHis tone actually becomes melancholy at his epiphany, sad that he messed up something nice that Dream was trying to do for him.\nDream cheers him up by tugging him by the hand to walk beside him, bumping their shoulders together and laughing.\n“Kind of,” Dream says speculatively, with a different kind of grin, before he returns back to his low (and very suggestive in the right context, may George add) voice, “I’d say it all worked out perfectly well, though. Wouldn’t you?”\nGeorge smiles up at him, cheeks stretched to the absolute brim, as he answers, “I would. I really, really would.” \nThe taller leans into his personal space as he smiles blindingly at him and clutches on more tightly to George’s hand.\n“You’re so dumb.” George tells him fondly because he can’t help himself; it only earns a larger grin from the other man.\n“What do you want to do first?” Dream asks, bringing them both to a halt in an area surrounded by dazzling and bustling booths, ranging from foods, souvenirs and beyond.\nHe’s scanning the area intensely when something soon catches his eye. However, his mind quickly supplies that the idea is stupid, so he tries to force his gaze onwards and away.\n“Which one are you looking at?” \nGeorge sighs at Dream’s masterful observation skills, especially applied when it comes to him, it seems, and gives him a raised eyebrow as he glances over to see the other’s expectant expression. \nTelling half-truths of what had caught his eye, George supplies, “We could have a go at some games first?”\nDream nods in agreement and they walk further into the noisy crowd and mouthy market-sellers. As they disappear further in, George finds it hard not to stare at what had caught his eye before: a substantially-sized teddy bear is displayed at the forefront of one of the most busy-looking stalls in the little square they’re currently in. \nIt had caught George’s attention because it’s a lovely shade of light blue and its soft and fluffy coat looks inviting and warm in the midst of harsh winter air. It takes George a little while to catch on as to why the bear interests him so much, he lets himself stare for another ten seconds and then it hits him.\nThe bear is the exact same pale and sky-blue that pigments the soft material of Dream’s hoodie. A colour he now, undoubtedly, associates with the other man; warmth, protection and home.\nThe teddy-bear’s blue fur glistens under the flashing lights of the stall. George is still staring. He can’t stop thinking about how it would be the perfect physical representation of their precious time they’ve had in London together, in real life. Something for him to have and to hold when a certain someone has to fly back, thousands of miles away.\nHe snaps back to himself and looks up beside him to find Dream pondering something whilst regarding his face with great intrigue. \nTheir eyes meet, Dream’s dance hues of blue-green under the lights that George is very excited to find he is able to see. He can feel his own smile widening across his cheeks and can also see the exact moment that Dream makes up his mind about whatever he was considering, as his face morphs into an expression of stern and poised competitiveness.\n“I’m going to win it for you.”\nDream’s words are a statement of fact, not a careful question asked or even a conditional or an attempt. George’s heart races at the taller’s explicit confidence and assertiveness; something that has always made him feel a certain type of way.\nJust because he likes to be difficult and see Dream’s intelligent mind at work, George questions, in a teasing and defiant tone, “How do you even know that I want it?”\nDream laughs like you’d be an idiot not to, “Oh, come on.” \nHis challenging eyes glisten with the stall’s Christmas lights slowly twinkling above them. George thinks he’s quite beautiful, almost like a handsome and charming prince that’s wandered straight out of a fairytale.\nA slight raise of the taller’s eyebrow is all it takes for George to relent and follow Dream, a little nervously, as he marches up to the stall to play the game after paying.\nIt’s one of those well-loved basketball shooting games, where the hoop is situated a good few feet away from where you’re told to stand, and all you have to do is get it in. Easy, right? \nNope. George knows for a fact that the basketball hoop rings are such a size that one must be perfectly and near-impossibly accurate in order to actually win the game. He should know, he’d worked at his town’s local funfair for the summer once when he was still a teenager.\nDream just gives him a playful wink as the stall-owner hands over three balls to him, because of course he would. This is Dream; an ex-American football quarterback with the killer confidence of a king.\nSaid man’s face morphs into a smirked expression of focus as he lines up his first shoot. George rolls his eyes at his over-dramatising boyfriend and just fondly tells him to shoot already.\nAs expected, Dream’s first shoot does not go in, bouncing off the rim and tugging at George’s heartstrings. Dream lets out a disappointed laugh but soon picks up the next basketball to try.\nFive minutes on, George still finds himself huddled in his coat and jumper, watching Dream’s face become increasingly more frustrated and determined as his final ball sweeps out of the net again. \nGeorge would say he’s had a least three or four rounds of attempts by this point, and has been desperately trying to insist to the other that it really doesn’t matter that much and he’s entirely flattered by him trying so hard. But Dream is having none of it, his competitive, patient and driven edge shining clear when he tells George to let him just have ‘one more go’ the next three times.\nRaising his eyebrows in question and wondering if the taller man would finally let them leave, George turns to the other man to find only a dissatisfied frown.\n“One more,” Dream says, voice low, resolute and steadfast. George tuts audibly and gives him a look that conveys disbelief, “I promise!”\nRelenting, George watches as his boyfriend hands over yet another ridiculous amount of money for one try at this stupid game. Doing some quick maths too, he soon realises that Dream has definitely contributed more money to playing the game to win the light-blue bear for him than it probably would’ve cost for him just to buy one outright.\nHe knows that doesn’t matter to Dream though; it’s the principle that counts. He’s got it in his head that he’s going to win something for George and that’s exactly what he’s going to do.\nGeorge holds his breath as Dream lines up his first of three shots again, freezing air catching in his throat uncomfortably, and he lets out an almost shout of relief as it swooshes cleanly through the hoop, bouncing back towards them. \nHe’s laughing as he processes that they can finally leave this stall that’s taken waaay too much of their money and who’s repeated fairground music is starting to do his head in. George looks up to his side and catches Dream’s beaming face and incredulous laugh, like he almost didn’t believe it would finally go in too.\nDream looks incredibly proud of himself, grinning ear-to-ear, and George can’t help thinking about how damn cute he is. He’s about to give him a ‘congratulations’ or a ‘thank you’ or something along those lines, when suddenly he feels himself being swept upwards and off of his feet.\nThe sensation is rather alarming and he lets out a small yelp of surprise. Slowly, George eventually catches up to processing what is happening; Dream has slipped his sturdy arms around George’s waist, pulled him close towards him and easily lifted him up briefly in celebration.\n“Oh my God.” He barely manages to laugh out beside the other’s ear as Dream twirls them both round in an effortless circle before placing him back down.\nDream’s cackley and wheezy laughter is beautiful as he smiles down at George, refusing to remove one of his arms from where it’s now positioned around his body. George’s heart beats a bit faster (if that is even possible right now), when Dream’s tongue pokes out and he bites down on it in an attempt to stifle his laughs.\nGeorge takes the light and fluffy teddy-bear from the stall-owner when he realises he was patiently waiting to had it to them. He accepts with a ‘thank you’ and what he knows is a horribly bright blush on his face, a consequence of several concurrent situations.\nThey move through the crowds and into an open space near a fountain so they can hear each other talk more clearly before continuing.\n“I told you I’d win it.” Dream says, smug expression donning his face with an attractive glint in his green eyes as he taps the bear in George’s arms on the head.\nGeorge laughs, pulling the soft animal closer to him, burying his fingers in the warm and silky pale fur as he retaliates, “I don’t think that counts,” Dream raises his eyebrows at him challengingly, “It took you like seven tries!”\n“Shut up, it totally counts,” The taller insists defiantly. He brings one of his gentle hands up to meet George’s round the bear, “Do you like it, though?”\nDream’s tone is so soft and considerate that George finds he can do nothing else but lean upwards on his tippy-toes and capture his boyfriend’s lips in a kiss. \nWhen he falls flat on his feet again, George looks up into the other’s eyes to find a look of amazement and sheer adoration, so strong that he has to shift his own gaze away and change the subject.\n“I’m- I’m kind of hungry,” He starts, because he really, really is, despite his heart nearly jumping out of his chest right now, “Should we grab something?”\nDream’s mouth quirks into a grin and George knows that he’s perfectly aware that he’s purposefully changing the topic, but is very grateful that he allows it anyway. \n“I saw a churro stand up ahead, we could get some?”\n“Okay. I’ve never had one before.”\nDream’s mouth falls open, a little comedically, before he verbalises his disbelief, “Wait, churros? You’ve never had a churro?”\n“No,” George simply says before he realises Dream is waiting for a longer explanation, “You don’t really see them all that often in the UK.”\nShaking his head and grabbing onto George’s free hand, Dream announces, “Well that decides it then, we're buying them.” as he directs him towards the stall. George laughs along beside him.\nHe lets Dream order for him, securing a table for them under the canopy of thousands of white lights just outside the churro stand. Although it’s still ridiculously cold, the fairy lights provide a pleasant illusion of warmth.\nGeorge seats his teddy-bear next to him on the bench, it being large enough to sit on its own, and retreats his paling hands into the sleeves of his coat and hoodie as he watches Dream’s tall figure wait in line.\nHis golden hair sits like a crown upon his head and George can’t ignore the tug of emotion that pulls at his heart. Dream returns before he can delve into it further, waving their food in his hands.\n“Here,” The taller says as he hands the pastry over, heat immediately rushing back into his hands, “They’ve got chocolate in the middle.”\nGeorge thanks him and only has to take one small sugary bite to let out a moan of satisfaction. \n“Yeah?” Dream asks, pleased grin blooming on his face.\n“Oh God, yeah,” George replies, perhaps aware of the double entendre his moans provide, “That’s delicious.”\nWith a proud ‘I told you so’, Dream tucks into his own, neatly wiping the chocolate that marks the corner of his lips with his finger as he quickly finishes; George savours each and every bite of his.\nHe observes the other fair-goers happily, trying to pick out the couples on first dates and those who had years of history behind them as he takes his last few bites. George finds himself glancing up at the lights of the rides nearby too as they flash a bright shade of blue, attracting his attention, and a content grin of warmth and happiness pulls onto his face.\nA sharp ‘click’ of a camera shutter snaps his gaze back to the man in front of him, however, as his eyes become aligned with the shiny back of Dream’s phone. \n“What-“ Geroge starts, slightly dazed for a second, “Wait, don’t-“\nDream is laughing his hearty, wheezy chuckle and George hits him lightly on the chest after his sole attempt to grab the phone misses.\n“Dreeeam.” \nHe whines, giving his boyfriend his best puppy eyes. It doesn’t work, clearly, because Dream’s laugh only strengthens and his face scrunches up, amused.\n“Let me see.” \nHe tries instead, which only earns him a shake of the head and a cute little ‘no’ as the other pulls his phone closer towards his chest as he rapidly types.\n“Are you done now?”\nGeorge sighs after about thirty seconds of weakly tugging at the other man’s sleeves to no avail.\n“Yes.” \nDream tells him with a pleased smile as he places his phone back on the table again. George eyes him suspiciously, but before he can insist on knowing what he just did, he feels his phone vibrate against his thigh in his trouser pocket along with a familiar small ‘chirp’ sound.\nHe freezes for a second. \nThere’s only one person he has Twitter notifications on for, and it’s the idiot sitting in front of him.\nWhen he glances up to meet Dream’s face, the other only gives him an amused grin and a very unhelpful shrug. George moves quickly to dig his phone out and slides open the tweet before even reading it.\nAttached is a photo of George (the photo, in fact, that Dream had just taken), with the short and simple caption, It’s my hoodie.\nGeorge’s breath catches him his throat as he stares down at the photo and notices that you can see Dream’s pale-blue hoodie easily, where it’s worn under his thick winter coat. In the photo, his face also looks warm, illuminated brilliantly by the twinkling lights overhead.\nHe can already see the replies under the post going absolutely crazy, flying in and updating rapidly second after second. George lets out a soft puff of air as he shakes his head, looking back up at Dream.\nHis boyfriend’s got this silly, lopsided grin on his face, and George quickly makes up his mind about his next move. \nBringing his phone quickly back up to hold in both hands, he types out a reply under Dream’s tweet.\nYou’re an idiot.\nHe can see Dream snicker when he sees it come up on his own phone and George waits impatiently as the man’s fingers begin moving again. \nDream’s reply reads, YOUR idiot &lt;3, to which George emits an even more pronounced shake of his head until he leans over the bench table to pull him into a kiss again.\nHe can feel Dream’s broad smile against his increasingly warm lips and he almost breaks apart to voice the emotion pulling tenderly at his heartstrings, but then Dream’s large hand cups his cheek and all memory flows out of his brain.\n(#DreamsHoodie hits the top of the Twitter trending page in less than ten minutes.)\n \n“This one.” \nDream explains as they weave their way through the currents of people flooding the louder side of the park that’s filled to the brim with rides and rollercoasters, as they had decided to resume their night. Dream had waved the two tokens George had long forgotten about at him and led him away eagerly with an anticipatory smirk at the other’s confusion.\n“This one?” George repeats, staring upwards at the tall and brightly lit Ferris wheel that stands front and centre at Winter Wonderland, “...what about the height?”\nDream glances over to him questioningly, George blushes as he continues. \n“I thought you didn’t like them.”\nHis boyfriend gives him a sweet smile before grabbing his hand again and explaining that he’d read about the height of the wheel beforehand and that it ‘should be fine’. \nGeorge tells him that doesn’t sound amazingly encouraging, but thinks about how of course Dream has it all calculated before they even arrived. Perfect to a T.\n“So,” Dream starts again with a hopeful smile, “Do you want to go on?”\nGeorge agrees with a firm nod and a squeeze of his hand before they move to join the line. It’s nearing the closing time for the park now, they’ve been here already for a good two hours, mucking about on game stalls and the like in between, so the queue isn’t too long a wait.\nHe can’t help but find it cute as Dream’s hand slips around his waist and clutches on firmly when they take their seat in the Ferris wheel car. His tight grip maintains as the motion of the ride brings them up to the top backwards at first, halting when they reach the very peak. \nGeorge allows himself to giggle a little before he whispers reassuring words to Dream, distracting him with playful taps of his feet and pushing their thighs close together.\nHe studies his boyfriend’s handsome and flushed face, no doubt unreasonably embarrassed at his fear. George follows his sharply cut jawline up to his rosy cheeks and soft, yet bright eyes. Dream’s dirty-blond hair ruffles soundlessly in the wind that catches around them.\nGeorge feels wholeheartedly content as he lets his gaze drift over the city. From this height he can see the busy streets bustling below him, usually deafeningly loud but now seeming like a silent film. He focuses on the blinking lights of business blocks in the distance and likens them to the clear and moon-lit sky above, endlessly far and stretching away.\nEuphoria and serenity rush through his body and his mind is quickly made up.\n“Dream,” He says softly, a spoken whisper caught on the wind that the other manages to hear all the same, glittering eyes turning to George with full attention, “I love you.”\nHis heart pounds against his chest, bursting smilingly as he watches Dream’s expression light up beautifully and brilliantly at the words he’d always desired to hear. Only this time the context adds another heavy and profound layer of meaning.\nHe feels himself pulled impossibly closer against Dream’s warm body as the taller leans his forehead slowly towards him until it rests gently against George’s. His eyelids flutter closed as he tries to ingrain this moment into his mind forever.\n“I love you too,” Dream takes a short breath before he continues, taking his time as he speaks his words thoroughly and sincerely, “So, so much.”\nTheir warm breath intermingles in the air, hands weaving together under the safety bar and gripping on tightly, as if not to ever let the other go.\nAnd they never will."
}