{
    "id": "26760037",
    "url": "https://archiveofourown.org/works/26760037?view_full_work=true",
    "author": [
        "thunderwear"
    ],
    "title": "Righteous at a Cost",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "魔道祖师 - 墨香铜臭 | Módào Zǔshī - Mòxiāng Tóngxiù",
        "陈情令 | The Untamed (TV)"
    ],
    "relationships": [
        "Lan Zhan | Lan Wangji/Wei Ying | Wei Wuxian",
        "Lan Qiren & Wei Ying | Wei Wuxian"
    ],
    "characters": [
        "Lan Qiren",
        "Wei Ying | Wei Wuxian",
        "Lan Zhan | Lan Wangji",
        "Wen Qing (Modao Zushi)",
        "Lan Yuan | Lan Sizhui",
        "Jiang Cheng | Jiang Wanyin"
    ],
    "additional_tags": [
        "Alternate Universe - Canon Divergence",
        "Fix-It",
        "no one dies",
        "Lqr finds out about wwx's core",
        "wwx and lqr are friends??",
        "In My Fic?",
        "its more likely than you think",
        "started off as crack but now its not",
        "lwj in the bg like whats happening?",
        "Fluff",
        "WWX goes to Gusu",
        "little bit of",
        "Mutual Pining",
        "Golden Core Reveal (Modao Zushi)"
    ],
    "language": "English",
    "series": "Part 1 of Good Guy Lan Qiren",
    "published": "2020-10-01",
    "completed": null,
    "words": "21,219",
    "chapters": "1/1",
    "comments": "403",
    "kudos": "15,077",
    "bookmarks": "3,872",
    "hits": "147,672",
    "summary": "<p>Lan Qiren sighed something weary and resigned and said, “Wei Wuxian, come back to Gusu.”</p>\n<p>After his nephew returns from Yiling, lovelorn and dejected, Lan Qiren decides to take matters into his own hands.</p>",
    "notes": "<p>Thanks to those who pointed out the unfinished sentences I had! I went through and did some edits so it should be better now!</p>\n<p>Spanish translation on Wattpad <a href=\"https://www.wattpad.com/1034320555?utm_source=android&amp;utm_medium=link&amp;utm_content=share_published&amp;wp_page=create_on_publish&amp;wp_uname=ZhanYing12&amp;wp_originator=NRmtcVbd9K7UIw466f9WYCmZiU3eQ3%2Fx%2FAWsIkCYBnQTmKwSopgU9QQOyob%2F9D1kjwJdCVFeMBhgI9GvGFQkgb9M5aZsHGCWOBOh3m%2FMooTbhnaYTTRFckeXCLfsSK%2Fo\" rel=\"nofollow\">here</a></p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>this has been sitting in my drafts for ages so here you go!</p>\n<p>Lxc spent most of his free time helping the wens build their place and he was basically immediately adopted as their grandson and spoiled which he loves</p>",
    "text": "The last place Lan Qiren wanted to be was standing in the noisy, bustling, crowded streets of Yiling, and yet that was exactly where he’d found himself. He had no legitimate reason to be there, avoiding those who stepped too close, trying not to cringe at each shout of the vendors that lined the street, hoping the stench of the place wouldn’t cling onto his robes. Had anyone had the nerve to ask why he was there, not even pretending to browse along the market stalls, he wouldn’t have had a ready answer, least of all one he was willing to share. \nHow could he say that he came here to confront the Yiling Patriarch himself, not for the forbidden cultivation he practiced or war prisoners he protected, but for the damage he had done to Lan Qiren’s own nephew’s heart? \nWangji had been quiet when he came back from his night hunt. Wangji was always quiet, but Lan Qiren was well enough acquainted with his nephew’s tacit emotions to interpret most of his silences. Wangji had returned and spoken of his visit to Yiling in few words as was his nature, but those few words had revealed more than many might have had they been spoken by anyone else. His quiet recount simmered with something that made Lan Qiren hate his late brother for no other reason than that he’d left clueless Lan Qiren to guide his sons through life and love. \nHe’d never quite realized until that moment that he’d never expected Wangji to fall in love. Xichen, yes. Xichen was overflowing with love, finding friends in even the most unlikely of places and lovers just as easily. Xichen was the one he found at sixteen in the library tangled in an intimate embrace with one of the visiting disciples. Xichen was the one who had almost caused an incident with a minor sect by flirting with the Sect Leader’s freshly-betrothed child. Xichen was the one who sometimes had to be summoned back to Cloud Recesses when his stays in Qinghe lingered too long. \nWangji was different. When they had visiting disciples, he hadn’t so much as spared a glance at any of his peers other than to remind them of the rules or to silence any impertinences. Wangji didn’t have the face or temperament to flirt in any circumstances, and he’d never desired anyone enough to pursue them. Foolishly, Lan Qiren thought that meant Wangji would remain unattached like he himself had. \nXichen was the one who Lan Qiren expected to get his heart broken first, but it seemed that he’d gotten all the luck and Wangji all the folly. \nLan Qiren was not so surprised to find that the object of Wangji’s affection was the Yiling Patriarch himself. If his stoic nephew would fall for anyone, it would be that rascal. Perhaps he should have been shocked, but he’d had a bad feeling about Wei Wuxian since the moment he’d recognized his grin as Cangse Sanren’s, especially when he’d caught Wangji on more than one occasion stare at the boy’s back with something akin to longing. \nLan Qiren was displeased over who his nephew had fallen for, but not enough to be unwilling to defend his heart. Since his return from Yiling, Wangji wandered Cloud Recesses in a mood better suited for a lovelorn maiden waiting for her intended to return from war, so Lan Qiren found himself in Yiling against his better judgement, ready for a confrontation. \nHe didn’t know if he actually expected to see Wei Wuxian there, away from the sanctuary of his Burial Mounds, and he didn’t know what he planned to say if he met him, but here he was, loitering, trying not to glare at anyone who was too forceful in trying to ply him with their carved figures and cheap cloth. \nLan Qiren wasn’t quite surprised when he caught sight of Wei Wuxian, mostly because it took him a moment to recognize him. \nThe boy was thin. He was so thin it was jarring, and so pale that he nearly looked like a corpse himself. His eyes were still bright, but rimmed red, aching with something between weary and manic, haunted and haunting. No longer did he walk with that exaggerated swagger that had driven Lan Qiren to madness at Cloud Recesses simply for the fact that his mother had strutted the same arrogant walk. What he did now wasn’t quite a stumble and it wasn’t yet a limp, but it seemed that every step pained him. Or at least, if not pained, then labored. It was like his feet fell on broken shards or his legs weren’t strong enough to support himself. The only thing about him that was unchanged was the smile on his lips. \nThere was something to the slump of his shoulders that aged him, that made Lan Qiren feel like a youth and this young man an elder. \nHad Wangji returned to Cloud Recesses pained because his heart had been broken or because this careless boy was waning? Perhaps his heart had been broken by Wei Wuxian’s pitiful state. Had Lan Qiren been even a touch less callous, his heart might have been broken at the wretched wraith that Wei Wuxian had become. As it was, Lan Qiren couldn’t help the guilty pang of vindication that Wei Wuxian’s dark cultivation was doing to him exactly what he had warned him of back when he was an arrogant student. \nAs Lan Qiren watched, Wei Wuxian ambled down the path, seemingly without purpose. The townspeople ignored him for the most part, and feared him for the somepart. There were those who turned away when his gaze wandered to close, and there were those who sneered behind his back. Between the two were those who seemed to not know who he was, whose eyes slid over him and away without lingering on the flute slung through his belt. \nIt was one of those unawares who stepped a little too close to Wei Wuxian in effort to avoid a murky puddle in the path, a man who didn’t look twice when his shoulder stuck Wei Wuxian’s own. \nLan Qiren’s hand dropped to his sword before the contact was even made, prepared for a vicious backlash from Wei Wuxian towards the man at the slight. He’d seen how unhinged Wei Wuxian had become since the end of the Sunshot Campaign, and he didn’t doubt that this would be met with arrogant outrage. He was completely taken aback, however, when, instead of sending the clueless man sprawling for the mistake, Wei Wuxian himself was cast to the ground. It happened so fast that, for a moment, Lan Qiren thought perhaps Wei Wuxian had simply vanished in some new dark trick, but then he caught sight of dark robes sprawled on the ground, Wei Wuxian braced on his elbows as he stirred dust with the air pushed out of his chest. \nLan Qiren was as stunned as he was confused. The passing man hadn't been a cultivator as far as he could say, and not large by anyone’s standards. He shouldn’t have been able to sway any cultivator’s step, let alone knock one from their feet. \nHad Wei Wuxian’s damned cultivation damaged his spiritual energy?\nLan Qiren was helping Wei Wuxian up off the ground before he’d even realized that he’d moved. \n“Aha, don’t mind me,” Wei Wuxian said casually, looking down at his hands as he scrubbed loose gravel from where it had lodged into his palms. “This one should take care to watch his step.”\nHe didn’t look up until Lan Qiren’s hand tightened on his arm. There was a moment where Wei Wuxian seemed not to recognize him before realization colored his pale face, and he jerked back with a look of unobscured terror. \nThat look vexed Lan Qiren as well. What use did the Yiling Patriarch have fearing a cultivator who was more scholar than warrior?\n“Ah, Master Lan,” Wei Wuxian said, putting on that grin of his that set off every single one of Lan Qiren’s nerves. “You needn’t worry about this clumsy one. I’ll be on my way.”\nHe moved to take a step back, but Lan Qiren just stepped with him. \n“Wei Wuxian,” he said. “What’s happened to you?”\nWei Wuxian was unsubtle about the way he tried to pull his arm from Lan Qiren’s grip, but he didn’t give it half the effort a man wanting for escape would, so Lan Qiren held fast.\n“Didn’t you see? Someone very inconsiderate knocked me over. He didn’t even stop to see if I was okay.”\n“A non-cultivator,” Lan Qiren said. “I’ve seen cultivators with a stronger core than most fail to knock you off your feet. How is it that this man was able to do so simply by stepping into your path?”\nWei Wuxian set his jaw in defiance, eyes flashing. \n“He caught me unaware.”\nLan Qiren wasn’t one for games, and he’d had enough of letting Wei Wuxian try to squirm his way out of admitting to his faults.\n“I warned you that dark energy was dangerous, harmful to the mind, body, and spirit. I warned you when you were a student at Cloud Recesses, and yet here you are. I always knew you were arrogant, but this is new heights. Corrupting your core to keep this dark power is too far even for you.” \nHe regretted the words as soon as they were out of his mouth, but it seemed his regret wasn’t enough to keep Wei Wuxian from flinching back like he’d been struck. It was astounding how young he looked now that Lan Qiren had knocked the cocky grin off his lips. Astounding and heartbreaking almost, in a distant way as Wei Wuxian blinked to dispel the tears that gathered on his lashes, too weak to pull his wrist from Lan Qiren’s grasp.\nHe seemed stunned beyond words which normally would thrill Lan Qiren, but at the moment made him feel an uncomfortable pulling in his chest that felt a little too much like compassion for his liking. \n“It’s my core, I can do with it what I will.”\nHis voice wavered, and Lan Qiren grew more agitated. \n“Wei Wuxian, how could you be so flippant? Cultivating a golden core is a privilege. One that shouldn’t be taken lightly.”\nAs he spoke, Lan Qiren adjusted his grip to Wei Wuxian’s wrist so that he could examine the damage that had been done to his core. If betting were not forbidden, he might wager that he would find Wei Wuxian’s core swimming with the corrupted energy that he cultivated with, tarnishing the gold into something reproachful.\n“No, don’t—” Wei Wuxian tried to protest, but Lan Qiren’s grip still held against the way he tried to squirm his way out of the tight cage of his fingers. \nHe didn’t try to reach for his flute whether because Lan Qiren held his arm or because he didn’t have any corpses close enough to help. \nWhen Wei Wuxian had been his student, Lan Qiren had been impressed with his core, however much it irked him to find good in the boy. At such a young age, he had been very advanced, enough to rival even Lan Qiren’s own nephews who were diligent and powerful. His spiritual energy should have been strong and pulsing throughout his whole body, straining against the confines of his skin, bright with power. Even with a suppressed or corrupted core, Lan Qiren should have felt something at the surface, even just a faint whisper. \nInstead, there was nothing. \n“What?” He breathed, though he hadn’t meant to speak. \nWei Wuxian shook his head again, a smile stretching over his face, brittle and strained. Did he really think he could fool Lan Qiren with the way his eyes were now swimming with tears?\n“Please,” he whispered with another weak tug to free his wrist. \nLan Qiren was too distracted by the gaping absence under his fingertips to pay that much mind. He probed deeper, pressing hard enough to bruise, and yet still, there was nothing. He was still in enough control over himself not to slam his hand over where Wei Wuxian’s lower meridian lay, but only barely. \n“When?” He started. “How did—”\nLeaving one’s sentences unfinished wasn’t against the rules, but it was rude. Lan Qiren didn’t have it in him to care in the face of this earth-shattering revelation. How long had this boy’s core been gone? By Wangji’s report, Wen Zhuliu had died at the end of the three months Wei Wuxian had been missing. He remembered the pitiful state that Wen Chao had been left in and he wondered if it wasn’t revenge for his core. \nWei Wuxian opened his mouth to protest again, but it seemed that he was out of energy, drained by his dark magic or seeing someone he hadn’t expected to see or perhaps some other reason that lay on his mountain of corpses. His knees gave out from underneath him, and he would have collapsed back into the dirt had Lan Qiren not caught him. \nWei Wuxian was startlingly light as Lan Qiren supported him by the elbows. He ushered them away from the crowd, over to the corner of a building that was mostly unoccupied. \nAs much as he wanted to hate Wei Wuxian, as much as he’d hated him in the past, all he could see in that moment was his own nephews. If they were in such a pitiful state that they swayed on their own feet and were so thin their bones looked like they could cut through their own skin, how could he stand by and let them suffer, regardless of whatever evils they seemed to have brought upon the world?\nWei Wuxian, like the rest of them, had been through a war, and though Lan Qiren had fought, who had fought more than Wei Wuxian? Though Lan Qiren had lost much, who had lost more than Wei Wuxian? Though Lan Qiren was still haunted by those evils, who could claim to be more haunted than Wei Wuxian? \nHe was yet so young. \nLan Qiren made a decision then, one that might not have been his to make, but he couldn’t stand for this to go on. Besides, if nothing else, perhaps it would make his nephew happy. \n“How could I, as your elder and former teacher, leave you in such a state. You need help and I can provide it. I will place you under my protection in Cloud Recesses until we work out a solution.”\nWei Wuxian’s laugh was bitter as he stumbled back, finally able to put distance between them now that Lan Qiren no longer held his wrist in a death grip.\n“Did Lan Zhan send you?” he asked, voice brittle and sharp now that he was truly confronted. “He’s already commanded me to go with him to Cloud Recesses for punishment. What makes you think I’d go with you if I already refused him?”\nIf it wasn’t against his very nature, Lan Qiren might have rolled his eyes. If this continued, he might just do so. \n“I am more than certain that my nephew holds no desire to see you punished. He wants to help you. He had made it very clear that he would do almost anything to protect you if you would allow him.”\nWangji hadn’t said as much out loud, but it was obvious. Lan Qiren had caught sight of Wangji moving extra blankets into his Jingshi, and Xichen said that he’d request spare robes in grey and blue rather than his usual white. He hadn’t gone as far as to ask for an extra bed, but Lan Qiren had seen him eyeing their storeroom, likely so that he would be able to find a bed as quickly as needed. It was easy to see that Wangji was preparing for a guest, however impossible it was for him to keep, and it softened Lan Qiren’s heart as much as it hardened it. His nephew had never been so intent on something like this and it would be amusing if it hadn’t been for the Yiling Patriarch. \nLan Qiren’s words brought Wei Wuxian to pause. He cocked his head at Lan Qiren, eyes distant like he was running over conversations in his head, reliving Wangji’s words.\n“He didn’t say.”\nLan Qiren had alway thought that of the two, Wangji was the most oblivious to people’s intentions, but it seemed that Wei Wuxian had him beat on this. \n“He probably did, but I doubt you were listening.”\nWei Wuxian let out an indignant squawk that was so loud and sudden that it nearly startled Lan Qiren. \n“I’ll have you know that I listen to every word Lan Zhan says,” he exclaimed, crossing his arms over his chest.\nLan Qiren leveled him with a look. That look had made many a student cower over the years but not Wei Wuxian. In fact, it earned him a dark look in return. \nLan Qiren spoke before Wei Wuxian could open his mouth again. \n“My nephew speaks with much more than just words.”\nWei Wuxian scrunched his face as he turned Lan Qiren’s words over in his head before he sighed. \n“Even if I believed you, and I’m not saying I do, I can’t go,” he said. “The Wen need my protection.They need me.”\nLan Qiren had heard so much of these Wen prisoners that he was sick of it. \n“What use are you to errant cultivators without no core in your chest? Let them fight their own battles.”\n“They aren’t cultivators, though.”\nThis boy’s disrespect wasn’t amusing when he was Lan Qiren’s student and it seemed his impertinence had only gotten worse as he’d grown older. \n“I’ve had enough of your lies,” he spat. “I’ve read the reports from Jin Guangshan himself. We know that you harbor fugitive Wen cultivators who aided him in his fight against us.” \n“I’m telling you, they aren’t cultivators. Just a handful of sick, tired, old people and a doctor. No one there is a threat to anyone.”\nAs much as Lan Qiren didn’t want to walk into the Burial Mounds, it was probably better than standing in the street with everyone yelling about something. Besides, what better way than to catch Wei Wuxian in a lie. \n“Take me, then. I’ll see for myself.” \nHe almost expected Wei Wuxian to refuse, but he simply straightened his shoulders and gestured for Lan Qiren to follow him. \n“I’m going to trust you not to hurt anyone,” he said. “If you try anything, I will not hesitate to protect them. Hopefully Lan Zhan could forgive me for that much.”\nWei Wuxian insisted on walking himself back up the path through the gnarled trees, though Lan Qiren kept an eye out lest he falter again. Wangji would likely never forgive him if he let Wei Wuxian be injured. \nLan Qiren was surprised to find that the settlement, if the barren landscape littered with makeshift lodging and pitiful little tools and tables could be called that, occupied mainly by elderly folk. They appeared, whether by a true telling of their age or illness and malnourishment, to be older than he was, some old enough to be his parents. Lan Qiren knew what farmers looked like and he knew what warriors looked like. These appeared to be neither. How could they wield a sword with their hands curled and spotted by the sun? How could they till the ground with their shoulders frail and hunched with age? \n“And where have you hidden your cultivators?” He demanded, turning to face Wei Wuxian. “This cannot be all.”\nWei Wuxian gestured broadly. \n“Go ahead and look. The only cultivators here you’ll find are you and me.”\nLan Qiren wanted to call him on a bluff, but how could they have known that he was coming to prepare? Lan Qiren had been with Wei Wuxian the whole time and, unless he’d invented some new trick that was unable to be seen by the eye, he hadn’t sent a message ahead. Besides, there was nowhere to hide someone unless they were huddled in the trees. \nLan Qiren’s hand tightened into a fist where it rested behind his back. He didn’t appreciate being lied to, especially by a Sect Leader like Jin Guangshan, and he would be speaking with him. He was sure that the other Sect Leaders, particularly Sect Leader Nie, would be very interested in knowing that they’d been told a lie. He burned with something between anger at being misled and shame at thinking the Jin Sect righteous in their condemnation of these people. \nLuckily, he was spared from having to speak through the tightness in his chest when a small figure barreled into Wei Wuixan’s legs, nearly knocking him off balance. Lan Qiren’s eyes nearly fell from his head when he realized that the figure tugging on the skirts of Wei Wuxian’s robes with grubby hands was a child. A child had certainly not been in Jin Guangshan’s account.\n“Xian-gege,” the boy said, bouncing in excitement where he stood, still gripping onto Wei Wuixan’s robes. “Toys?” \nWei Wuxian answered with a laugh as he ruffled the boy’s hair. \n“A-Yuan,” he exclaimed. “How rude you’ve become! I’ll have to tell Rich-gege not to come back if this is what it does to you.”\nThe boy’s eyes grew wide at his words, and his lip stuck out, wobbling with a ferocity that Lan Qiren recognized as the beginning of a meltdown. He wondered if the boy’s mother would perhaps collect him before he could disturb them any farther. Wei Wuxian seemed to not share his concerns, laughing again and catching the boy’s jutted lip between his fingers. \n“None of that. I’m kidding of course,” he said. “Now straighten up. We have to be on our best behavior in front of our guest.”\nThe boy dropped his pout and batted Wei Wuxian’s hand away from his lip before his eyes darted on Lan Qiren. Realizing he was being watched, the little boy ducked behind Wei Wuxian out of view, peeking around his leg to stare up at Lan Qiren. His behavior was very undisciplined, but Lan Qiren felt it could be excused on account of his living situation and Wei Wuxian’s influence. \n“This is Rich-gege’s Uncle,” Wei Wuxian said, steering the child by his shoulders out from behind him and in front of Lan Qiren. “Greet him properly. I know you know how.”\nThe boy turned wide eyes over to him, calculating for a second. Lan Qiren waited for a bow. One of his favorite things was passing the youngest disciples and being greeted with their clumsy little bows. It was very adorable, though he wouldn’t admit to anyone that he found it cute. He had a reputation. \nA-Yuan, however, didn’t bow. \n“Toys?” He asked with an expectant smile, stunning Lan Qiren into remaining silent.\n“A-Yuan!” Wei Wuxian barked.\nHe looked to Lan Qiren and explained, “Lan Zhan bought him a few toys when he visited and now A-Yuan thinks he’s owed something when I come back from town.” To the boy, he crouched down, pulled an errant finger from his mouth, and said, “A-Yuan, it’s very rude to ask if someone brought you a toy, especially if that someone is a stranger.” \nThe child nodded seriously before turning back to Lan Qiren. \nNo one had said anything about there being a child among the numbers of the Wen Remnants. Lan Qiren would almost believe that the child was Wei Wuxian’s own son if it hadn’t been that his nephew hadn’t been quite that dejected when he’d returned to Cloud Recesses. He was probably a Wen, and, judging by the ages of the folk around, an orphaned one at that, unless he was Maiden Wen’s child, but that struck him as unlikely judging by the boy’s age. \nLan Qiren expected a polite apology or perhaps a greeting, but what he got instead was an expectant hand extended and another question. “Candy?”\nWei Wuxian let out an exasperated noise. \n“A-Yuan, come here,” he said, tugging Wen Yuan back over to himself. \nLan Qiren wasn’t surprised that instead of scolding Wen Yuan, Wei Wuxian simply rolled his eyes and pulled a small wrapped package from the breast of his robe, unwrapping it to reveal several pieces of candy. A child was spoiled like that, but Lan Qiren could remember instances of spoiling his own nephews from time to time, so he couldn’t say anything without being hypocritical. \n“I shouldn't even give this to you,” Wei Wuxian said, holding the parcel out to Wen Yuan. “You’re being too rude.”\nWen Yuan’s eyes grew rounder in desperation as he reached out, jumping when Wei Wuxian held the treat out of his reach. Lan Qiren thought about interrupting them, but he didn’t want to have to deal with a child plus Wei Wuxian. \n“How about we save it until we eat supper,” Wei Wuxian said. “Then we can share with everyone.”\nThe boy jumped once more before settling and nodding. Wei Wuxian handed him the package and the boy held it tightly in his hands like he was scared to let it go. Most children wouldn’t have so much self-restraint when handed a package full of sweets, even in the face of a promise to eat it later, but, however undisciplined this little Wen was, he seemed to be willing to wait and share. \n“Sorry,” Wei Wuxian said, standing back up with the child’s hand clasped in his. “He’s always excited when I come back from town, I should have prepared you.”\nThis boy had a finger back in his mouth, and Lan Qiren couldn’t help but think of Wangji at that age who had sucked his thumb, much to Lan Qiren’s exasperation. He hadn’t dropped the habit until he’d been old enough to start his lessons. Even then, Lan Qiren had known he still hadn’t stopped, he just got better at hiding it. Lan Qiren had caught him sometimes at night, when he came to check on his nephews before he went to bed. He'd asked Xichen’s help in trying to break Wangji of his habit, but Xichen was soft. He’d been especially weak to chubby-cheeked, serious little A-Zhan who meticulously washed his hands so no one could tell him that putting his thumb in his mouth was unsanitary.\nIt was then that a young woman approached whom Lan Qiren recognized as the Young Maiden Wen. So far, she seemed to be the only person who had actually been accounted for correctly in Jin Guangshan’s report. \n“Grandmaster Lan,” she said with a low, venerable bow. \nIf she hadn’t been wearing the red of the Wen Sect. Lan Qiren might suggest that Wei Wuxian take his manners from her. Or at the very least, that she be in charge of teaching Wen Yuan manners instead of Wei Wuxian. \n“Like I said, we do have a doctor,” Wei Wuxian said, lifting the child onto his hip in an easy practiced motion. “This is Wen Qing.”\n“I would offer you tea,” she said, “but I’m afraid we don’t have anything that extravagant.”\nNever in his life had Lan Qiren considered tea to be extravagant. It was simply a staple of daily life like water and an evening meal. Though, looking around, both of those things might be considered extravagant here as well. \nThere was something sharp to Wen Qing’s expression, and Lan Qiren could see tension in her shoulders and her clenched fist. He wouldn’t be surprised if she had a weapon hidden in the folds of her robes, ready to protect her people from him if needs be. He wondered if Wangji was treated with such suspicion or if the devotion he carried for Wei Wuxian in his heart and written in his eyes was enough to convince them that he was no harm. \n“We can’t afford anything like that,” Wei Wuxian said with a laugh that probably wasn’t meant to sound as bitter as it had. “We’re dirt poor, don’t you know.” \nWen Yuan parroted, “Dirt poor!” \nThe Wen standing around regarded Lan Qiren with wary eyes, though they didn’t move any closer. There weren’t as many as he expected, and for a moment he considered that perhaps Wei Wuxian had hidden some cultivators from him to jump out when the opportunity struck. \n“How many are there here?” He asked.\nWei Wuxian glanced around at the settlement, brushing his nose with a finger as Wen Yuan copied his motion, still clutching his little parcel of candy to his chest. \n“Counting me, thirty-six,” he said. \n“Thirty six,” Wen Yuan said with a nod, earning him a hair ruffle from Wei Wuxian. \nLan Qiren had heard reports of there being more than fifty people who escaped from the Jin labor camp. He wondered if that had been another lie to make the Wen remnants seem more dangerous or if some had passed between their liberation and now. It wouldn’t be surprising. The journey here from Qiongqi was harsh, and settling the Burial Mounds would have certainly taken a toll. It would have been more of a marvel if all had survived, it was a marvel that any of them had. \n“Perhaps we should talk. If what you’ve said is true, that there are no other cultivators, I may be willing to offer my protection for all of you in Gusu.”\nWei Wuxian’s eyes grew wide as well as Wen Qing’s as they made eye contact, both surprised, both suspicious. \n“What’s Gusu?” Wen Yuan asked. \n“That’s Rich-gege’s home,” Wei Wuxian said, breaking his silent communication with Wen Qing. \nShe instead turned her gaze to Lan Qiren, still suspicious as they tried to determine if he was really offering what he’d said. Lan Qiren was insulted that they would think he would lie, but he also understood their caution. \n“Are there toys there?” Wen Yuan asked Wei Wuxian. \nA laugh as Lan Qiren and Wen Qing continued their staring match. Lan Qiren looked away first, not because he was intimidated but because he was uncomfortable under her scrutiny. \n“Of course, you silly radish,” Wei Wuxian said, poking Wen Yuan's little round nose. \nLan Qiren couldn’t help but think that Wen Yuan looked a little like Wangji had at that age, though he smiled much more. It made his chest hurt a little to think about how little Wangji had smiled as a child so he pushed such thoughts to the back of his mind. \n“We can go,” Wen Yuan said with a nod. “But only if granny comes too.”\nWei Wuxian looked around the settlement before his eyes landed back on Lan Qiren. \n“We have to talk about it first.”\nThey talked long into the night. \nBefore they began negotiations, Wei Wuxian gave Lan Qiren a long look before he said, “There is one more thing you should know before you make any real offers.”\nIt was then that a figure stepped out from the shadows, head bowed respectfully, showing the creeping dark mark up its neck to mark it as a corpse. Lan Qiren couldn’t help the way his hand readied to draw his sword. \n“What is this?” He hissed, darting his eyes to Wei Wuxian. \nBut Wei Wuxian wasn’t looking at Lan Qiren, he was instead, moving to stand between him and the corpse, his eyes sending a sharp look to Wen Qing, keeping her from stepping forward Lan Qiren realized. \n“This is Wen Ning,” he said. “I need you to let me explain before you do anything.”\nThe corpse’s head was still bowed respectfully, and Wei Wuxian hadn’t played his flute, but Lan Qiren still wasn’t sure this wasn’t a trap.\n“He isn’t like other corpses. He is fully conscious and has no desire to hurt anyone,” Wei Wuxian said. “He’s like this because he was abused under the hands of the Jin keeping him in the camp, beaten and used as bait until they left him in a pit with a summoning flag pierced through his chest. I decided to bring him back to give him another chance, so if anyone is at fault, it’s me and not him. \nThe corpse gave a stiff, formal bow and then looked to Wei Wuxian to know what to do next. \n“We will refuse your offer unless it includes Wen Ning,” Wei Wuxian said finally. \nLan Qiren didn’t pace even though it might have benefitted him in releasing the sudden tension in his body. He did turn and stalk from the cave so that he could think away from the press of the rest of them. \nHe’d heard about the corpses Wei Wuxian had used to free the Wen prisoners from captivity, but he hadn’t known that he’d still kept them and paraded them about like \nBut could he stand by and let these people starve to death on the Burial Mounds’ cursed ground? If he hadn’t seen the rest of the Wen remnants, he would have. Lan Qiren wasn’t sure if his mind was made up more out of compassion or spite at being lied to by Jin Guangshan, but he decided to give Wei Wuxian the benefit of the doubt. \nHe rejoined the rest of them, keeping a wary eye on the corpse who sat in the corner and entertained Wen Yuan while they spoke. His mind kept drifting to them both because he wanted to make sure the corpse wasn’t going to hurt the boy and because it was a curious sight. \nLan Qiren wondered if hunger wasn’t a driving force of the way most of them seemed open to his offer. Or perhaps it was comfort, or to not be afraid anymore. For Lan Qiren, it would have been the proximity of corpses, but seeing as they’d come here with the grandmaster of Demonic cultivation himself, they probably weren’t as put off by that sort of thing as Lan Qiren was. \nHalfway through the night, with most of the elders latching onto the idea of Wei Wuxian accepting Lan Qiren’s offer and Wei Wuxian still not quite believing that was their best choice, Lan Qiren was asked to leave so that they could have a private discussion. Lan Qiren was too glad for a break in tense conversation with mostly strangers that he was neither offended nor suspicious. He had a long moment to himself, trying to meditate, but succeeding only in forming arguments to make to the elders istead. He was halfway through formulating exactly where he would suggest building a settlement when he was interrupted by someone approaching. \nWen Qing had never looked intimidating to him before, but, being a teacher, he didn’t find many young people intimidated. He knew youth too well. Even Sect Leader Nie himself, though he was long from youth, had never intimidated Lan Qiren. Perhaps it was foolish of him, but it was a folly that he wasn’t quick to give up. Now though, Wen Qing looked like she could rattle the leaves from every tree in the forest, had the trees in the Burial Mounds had something so vivacious as leaves. He knew that she wasn’t a great cultivator, but he also assumed that, if she felt the need, she would find a way to hurt him, maybe even kill him. Most women were like that, and Lan Qiren couldn’t help but be both impressed at their mettle and glad he’d never married.\n“Most of them just want Wei Wuxian to not have to run himself into the ground trying to keep us safe anymore,” she said, setting down a plate next to him with a more generous portion than Lan Qiren had seen on anyone else’s plate. “He’s more than willing to die for us, and that scares them. They don’t want him to have to sacrifice any more than he already has for us. Bearing that kind of debt isn’t easy.” \nShe didn’t sit and it made Lan Qiren feel like he should stand, but he found he didn’t want to. She didn’t mention it so he assumed she didn’t mind.\n“They’re old.” She didn’t sound melancholy, just resigned. “All they want is to make sure that my brother, A-Yuan and I live well and that Wei Wuxian can stop ruining himself for them. They want us to be safe and happy, and then they want a peaceful place to live and die. Could Cloud Recesses be that place or would we still struggle for peace there as well?”\n“I think so,” he responded.\nHe picked up the plate and began to eat even though he wasn’t hungry because he felt it would be rude to decline this offer of hospitality. \n“Unless you can guarantee that it won’t be worse there than we have it here, I will go in there and tell everyone to ignore you, and they’ll listen to me,” Wen Qing said. \n“I can’t promise much, but I promise that you’ll have my protection and I’m sure that of my nephew as well. The elders will be unhappy, but I have enough sway with them that they won’t dismiss me or you. You will have shelter in Gusu and a home. Probably not in Cloud Recesses itself, but down the mountain, near the town. It wouldn’t be a bad life.”\nShe nodded. There was a serious look in her eye as she turned his words over in her head. \n“You have sway with your Elders, I have sway with mine,” she said, turning to enter the cave once again. “This will be a relief to them.” She paused and then said, “Wei Wuxian will be the hardest to convince, but if everyone else agrees, he’ll allow it.” \nIt was several hours after then that Wei Wuxian emerged from the cave and approached Lan Qiren. His eyes were dark and there was a resigned slump to his shoulders. \n“We’ll go with you,” he said. “If you’re serious about offering protection, we’ll go.”\nLan Qiren didn’t quite know what to say so he simply nodded. \n“We can be prepared to leave in the morning unless that would be too early. \n“The sooner the better,” Lan Qiren replied. \nNot only because he was eager to leave the Burial Mounds, but because he feared what any more time in this corpse-ridden air would do to the people there. \nIt didn't take long for them to pack, likely because there were so few possessions between them. They left the border of the Burial Mounds before the sun reached it’s midpoint in the sky, and Lan Qiren couldn’t help but breathe deeply the fresh air once they’d passed the last crooked, sickly tree.\nThe journey back to Cloud Recesses was long and annoying. They went on foot seeing as Lan Qiren was the only one who could fly. Most of the Wen were elderly and therefore weren’t as able, so there were frequent stops and the pace was agonizingly slow. Lan Qiren tried his best not to become too irritated, even when Wen Yuan left little dirty fingerprints all over the skirt of his outer robe and Wei Wuxian chatted incessantly. He found an unexpected kinship with Wen Qing who sighed every time Lan Qiren felt the urge and rolled her eyes each time Lan Qiren refrained from doing so himself. \n“My nephew knows about your core,” Lan Qiren said to Wei Wuxian as they walked side by side. \nIt wasn’t a question. Wangji must know based on how fiercely protective he wanted to protect Wei Wuxian. \nLan qiren caught Wen Qing’’s head snap in their direction out of the corner of his eye, and assumed that meant she knew of his core as well. \n“No, he doesn’t.”\nIt was Lan Qiren’s turn to be shocked. \n“Are you sure?”\nWei Wuxian let out a bitter laugh that sounded all the more bitter coming from him of all people. \n“If Lan Zhan knew I didn’t have a core, he’d have probably thrown me over his shoulder and flown me to Cloud Recesses kicking and screaming already. \nLan Qiren turned to look at Wei Wuxian, the tired slump of his shoulder, the signs of hunger that still clung to his gaunt cheeks, the way he guarded the Wen with wary eyes still, even though Lan Qiren had given npr reason for him to distrust him. \n“If I know nothing else about my nephew, I know that he would never even consider keeping you or anyone else in Cloud Recesses prisoner.”\n“Why?”\nHe hesitated. \n“You’ll have to ask Wangji that. It’s not my story to tell.”\nIt still made his chest hurt to think of his brother. They hadn’t been close since they’d been young, since before his brother had met the woman who would be his wife. Lan Qiren could remember the exact moment where he and his brother began to drift. It was the night he tried to stop his brother from marrying.\nThere was much Lan Qiren regretted, but not being able to stop his brother from marrying her and locking her away was one of his biggest regrets.\nHe shook his head to rid himself of thoughts of his late brother and changed the subject.\n“When did Wen Zhuliu take your core?” He asked. \nLan Qiren only realized that the question was too personal once he’d already asked it, but Wei Wuxian answered before he could take it back. \n“Like I would have given Wen Chao’s dog the opportunity to lay a single finger on me,” Wei Wuxian growled with all the venom of the Yiling Patriarch. \n“Then how?”\nWei Wuxian paused for long enough that Lan Qiren thought he wouldn't answer. He fiddled with his flute in his belt and looked out into the distance as Lan Qiren waited. He wasn’t really expecting an answer, so he was surprised when he took a deep breath and spoke. \n“I gave it away,” he said, and then continued despite Lan Qiren’s sharp gasp. “I offered it in exchange for my brother’s life.”\nDuring the war probably, but if not Wen Zhuliu, then what had happened. Who could broker such an exchange? \n“To whom?”\nWei Wuxian refused to look over, keeping his gaze trained on the horizon. \n“The gods? Fate? My brother himself?” He asked each name with increasing spite. “What does it matter? It's gone and that’s that.”\nLan Qiren felt uneasy about asking after such a personal and serious hurt in the first place, so he was quick to let the subject drop. \n“Indeed.”\nThey both fell silent then, distracted by little Wen Yuan running up and showing them a handful of weeds he’d picked from the side of the road. \n“What kind of radishes are these?” He asked. \n“Those aren’t radishes, silly” Wei Wuxian said with a laugh, hauling Wen Yuan up onto his hip. “They’re flowers.”\n“They’re flowers,” the boy repeated with a nod before he turned back to holler over Wei Wuxian’s shoulders. “Look, Qing-jie! Flowers!”\nLan Qiren turned his face away from Wei Wuxian so he wouldn’t be able to see his smile.\nWangji was gone on another night hunt when they returned. No doubt Xichen had sent him to get his mind off his forlorn moping. Wei Wuxian pouted when Xichen told them, and Lan Qiren wanted to scold him for his posture at the way he slumped. \n“I’ll send for him. Tell him what’s happened.”\nLan Qiren shook his head.\n“You said he’s set to return tomorrow? I’ll tell him when he returns. Right now we need to talk with the Elders.” \nThe Elders trusted his judgement about bringing Wei Wuxian and the Wen Remnants to Cloud Recesses. They had been more reluctant before Lan Qiren had revealed that they had been deceived by Jin Guangshan regarding the threat the occupants of the Burial Mounds posed. Their decision may have been rushed by the fact that they were anxious to get the ragged, elderly Wen loitering at the gates out of the public eye. Of course there were conditions, but they were accepted readily. \nThe first was that the Stygian Tiger Seal was to be handed over to Lan Qiren. Wei Wuxian had hesitated at first before taking into consideration his Wen Remnants. He seemed to consider the giving away of his seal payment for their protection. Lan Qiren hadn’t revealed Wei Wuxian’s missing golden core, but he had implied that the boy’s spiritual energy was damaged which further helped to assuage the Elders’ fears, especially once his seal and flute were out of his hands. Wei Wuxian seemed nervous to let them go, and before he released them completely, he looked Lan Qiren deep in the eye, expression sharp and serious. \n“If I find that this is a trick,” he said with all the seriousness Lan Qiren had ever heard from him. “I will not show mercy to the Lan Sect, not even for Lan Zhan’s sake. You will all burn, and I will feel no remorse.”\nLan Qiren would never lead such a trick, but he didn’t begrudge Wei Wuxian this lingering threat. He was putting himself and his people into unfamiliar hands.\n“Meet me in the library tomorrow after midday,” Lan Qiren said as Xichen led the Wen remnants to where they would be staying until they figured out what to do with them. \nWei Wuxian stopped walking and looked to Lan Qiren with a wary expression. \n“What for?” He asked before narrowing his eyes. “Punishment?”\nLan Qiren held in his exasperated sigh. He was tired and ready to clean the dust of the road off of him and go to bed, and he didn’t need Wei Wuxian keeping him up any later with annoying assumptions of library punishments. \n“So we can start looking for a way to fix your core,” he explained. He’d thought that much was pretty obvious. Didn’t Wei Wuxian know that he was brought here not just to help the Wen but to help himself. Lan Qiren was sure he’d made that clear in the marketplace when he’d first discovered Wei Wuxian’s missing core, but perhaps he hadn’t. \nWei Wuxian just blinked at him in shock, like he wasn’t quite comprehending Lan Qiren’s words, so Lan Qiren continued, brushing longing thoughts of a warm bath out of his mind for the time being. \n“When a core is melted, it damages the spiritual pathways. You said that yours was given away, so perhaps there’s a way to build it back,” he explained. “You’re too old to form a core the traditional way, but I have a few ideas.” \nWei Wuxian was still blinking at him, slack-jawed and astonished, but Lan Qiren had long since realized that he should never expect anything like propriety from him. \n“Really?” Wei Wuxian asked once he’d shook himself from his shock. “You really think I could get it back?”\nXichen and the rest of the Wes were out of sight by now, and the sun was beginning to set. Lan Qiren savored the renewed quiet as Wei Wuxian waited on his answer. \n“I make no promises, but what can it hurt to try?”\nFor a moment, it looked like Wei Wuxian might cry, so Lan Qiren made his excuses to retire for the evening.\nThe next morning they took to the library to gather texts at Lan Qiren’s direction before he led Wei Wuxian to the private garden he kept behind his home. He wouldn’t admit it to anyone, but Wei Wuxian looked like he could use sunlight. Actually, he looked like he could use rest and food and perhaps a healer, but this was what Lan Qiren could provide, so he gave it willingly. \n“How are your Wen settling in?” He asked, not because he really wanted to make small talk but because he was genuinely curious. \n“I told them to rest today while the elders agree on where to let them stay,” he glanced up. “I hope that’s okay?”\nWei Wuxian needed rest as well, but Lan Qiren figured that he would deny it if he brought it up. Besides, who was he to coddle him? He certainly wasn’t a child, and, malnourished and tired as he was, he was responsible for himself.\nThe first step was to research everything they could about cores. Lan Qiren had already read all of the texts he’d gathered, but never with the eye of someone trying to restore a core. It wouldn’t hurt. Besides, there were fresh eyes with him. He’d pried only once more into what had happened to Wei Wuxian’s core, but he just claimed that he’d given it away and that was all Lan Qiren needed to know. \nThey kept at their work for what seemed like ages\nBack when Wangji’s generation of students were studying at Cloud Recesses, Lan Qiren had once observed Wei Wuxian in the library under his punishment. Wangji had sat with perfect posture, silently reading or copying, whatever his task called for, while Wei Wuxian fidgeted and doodled and made errant noises meant to distract Wangji. Lan Qiren was more than proud of his nephew for keeping his composure when Wei Wuxian let loose what seemed to be a never ending string of his name repeated in different variations and tones until Wangji had silenced him. Even then, Wei Wuxian hadn’t sat still or concentrated, still wiggling and doodling and humming through his sealed lips. Lan Qiren knew his nephew well enough to have caught the twitch in his eyebrow that spoke of severe annoyance, though he was sure Wei Wuxian had missed it. \nThe Wei Wuxian that sat with him now was wholly different than that restless boy who had irked Wangji so. He was intense, concentrated. He didn’t fidget or hum, he didn't even take breaks, so concentrated he was on his work. Lan Qiren wondered if it was maturity or the subject matter that drew his attention. \nHe sat still for so long that even Lan Qiren grew tired, so after just a little too long of being witness to how unnerving stillness, he sent Wei Wuxian after a few more texts, just to make him get up and stretch his legs. \nWei Wuxian was long enough for Lan Qiren to fetch their lunch, and just as Lan Qiren sat back down, Wangji appeared on the path, walking steadily towards him, still steeped in that melancholy energy he’d had since he’d come back from Yiling. \n“I was told to find you,” he said, approaching the table but refraining from sitting down. \nLan Qiren nodded, placing the food on the table as he tried to figure out where to start.\nThe chance was taken from him when Wangji looked towards the path. Lan Qiren watched as Wangji’s face paled and then flushed as the most expression Lan Qiren had seen since Wangji had been too young to control his reactions crossed over his face. \n“Wei Ying?” He breathed, and then again, louder, almost too loud, “Wei Ying!”\nLan Qiren looked to where Wangji had caught sight of Wei Wuxian who was returning with his armful of texts. It seemed like he hadn’t noticed Wangji before he shouted. \n“Lan Zhan!” Wei Wuxian called, catching sight of Wangji who still looked as if he was trying to determine whether or not he was dreaming. “You’re back!”\nWhen he raised his hand to wave, the texts tumbled from his arms onto the ground, and Lan Qiren had to resist the urge to bury his face in his hand. This was the Yiling Patriarch? \nThe falling of the texts startled Wangji into action. He moved in an instant, stepping between Lan Qiren and Wei Wuxian with a resolved set to his mouth. Lan Qiren saw his hand tighten on his sword, but, thankfully, he didn’t draw it as he looked torn between turning to face Wei Wuxian and making sure Lan Qiren wasn't going to attack him. Lan Qiren would find it sweet if he wasn’t the villain in the scenario. \n“Wangji,” he barked out, startling Wei Wuxian, and causing Wangji’s eyes to harden. “Wei Wuxian and I have work to do, and I suggest you leave us to it. You have your own duties.” \nWangji stared at him in disbelief as Wei Wuxian gathered the texts that had fallen back into his arms again and bounded around his protective stance to join Lan Qiren at the table. \nDespite Lan Wangji lingering awkwardly by the table, Wei Wuxian sat and started sorting through the texts he’d gathered like nothing was out of the ordinary. Wangji turned his stare to Lan Qiren, expecting an answer. \nWei Wuxian also looked to him, giving a complicated series of facial expressions and hand motions that Lan Qiren realized, with no small measure of resignation, he could interpret perfectly. Wei Wuxian didn’t want Wangji to know what they were doing. \n“Wangji, the work we are doing must be kept under utmost secrecy,” Lan Qiren said, narrowing his eyes at Wei Wuxian for making him dismiss his nephew who obviously wanted nothing more than to bundle Wei Wuxian up and keep him close. \nIt wasn’t a lie, technically. They didn’t want any of this getting out, not that Wei Wuxian didn’t have a core and certainly not that they were trying to find a way for him to form a new one. He didn’t understand why Wei Wuxian didn’t want Wangji to know, but that wasn’t his decision to make. \n“I will not tell,” Wangji said with a nod, moving to help Wei Wuxian sort the texts that were on the table in front of him. \nAt Wei Wuxian’s expression of increasing frantic insistence, Lan Qiren sighed with another glare.\n“You misunderstand, Wangji,” he said. “I am asking you to leave.”\nLan Qiren really didn’t want to be the cause of any friction between him and his nephew, but he also didn’t want to just override Wei Wuxian’s wishes, especially on something that was so personal.\n“Yeah, Lan Zhan, don’t worry about us,” Wei Wuxian said, patting Wangji’s arm. “How about I come find you this evening and we talk then?”\nHe then picked up the text in front of him in a deliberate motion to show Wangji he was actually working. \n“Go on,” he said, shooing Wangji in the direction of the pathway with his hand. \nWei Wuxian batted his eyelashes and smiled up at Wangji, and Lan Qiren, regrettably, had to bear witness to the way his nephew melted before his eyes. \nAt Wangji’s nod, Lan Qiren said, “Find your brother. He will tell you everything.”\nWangji glanced at Lan Qiren who stared back resolutely, before he nodded again and then left, though not without one last look over his shoulder at Wei Wuxian, expression tinged with both confusion and worry. \nOnce Wangji had left, Lan Qiren went back to his work, ignoring the concerned glances Wei Wuxian continued shooting towards the space Wawangji had just vacated. \n“If only my nephew wasn’t infatuated with you,” Lan Qiren muttered, mostly to himself. “He was the perfect disciple before you interrupted his education.”\nWithout warning, Wei Wuxian jumped to his feet, tripping over the hem of his robe in the process and promptly tumbling over the table in front of him, bringing down both a stack of texts and the food Lan Qiren had placed on the table with him. He thankfully hadn’t landed on Lan Qiren, though he hadn’t escaped getting splashed with soup. Lan Qiren surely had changed much since Wei Wuxian’s time as his student because, instead of turning red and punishing him, he merely ignored Wei Wuxian’s disruption as best he could, though he did scowl down at the lines he was carefully copying into his notes, lines that were now smeared on the crumpled paper and covered in splashes of both ink and soup. \n“Infatuated?” Wei Wuxian demanded as he scrambled to right the tray even though its entire contents had already coated the front of his robe. “Your nephew isn’t infatuated with me! Lan Zhan hates me! Or tolerates me, but nothing like that.”\nLan Qiren barked out a laugh and then clamped his mouth shut because he hadn’t meant to do so.\n“Wei Wuxian, you certainly are a fool,” he said, lifting his eyes to scowl at the mess instead of his notes. “My nephew would move the heavens and earth for you. He would capture moonbeams in a kettle and brew them as tea if you asked him to just to see you smile. I daresay my nephew is smitten, and if you are unaware, then you are blind as well as foolish.”\nWith every word, Wei Wuxian’s breath came a little quicker and his cheeks grew a little pinker. Lan Qiren wondered if he would accuse him of lying, but even if Lan Qiren wasn’t an honest person by nature and by rules, he had no reason to trick Wei Wuxian this way. \n“I have to go,” Wei Wuxian whispered.\nIt was only then that Lan Qiren realized what he’d just revealed to Wei Wuxian. No doubt Wangji would be mortified, but if the dazed smile on Wei Wuxian’s flushed face was any indicator, his feelings were, if not wholeheartedly returned, at least welcome.\n“You can go later,” he grumbled. “We’re in the middle of things. Surely you won’t forget this in the time between now and when you meet Wangji.”\nHe really wanted to erase this conversation from Wei Wuxian’s mind, but that was impossible, so he did the next best thing which was ignoring him. \nWei Wuxian threw himself backwards with a wail. \n“But how am I meant to concentrate on anything else?” He bawled. “You just told me that Lan Zhan doesn’t hate me! That he might even like me and now I’m supposed to just sit here and read in silence?”\n“Yes.”\nAfter another wail and a full minute of undignified squirming where he lay on the ground being ignored by Lan Qiren, Wei Wuxian finally pulled himself together. Lan Qiren was almost certain that Wei Wuxian stuck his tongue out at him, but he was still ignoring him, so he didn’t mention it. There were a few moments of beautiful, blissful silence while Wei Wuxian righted himself at the table and Lan Qiren continued scowling down at the text in his hand. \n“Hypothetically,” Wei Wuxian said, which was never a good sign. “Would you say that Lan Zhan is infatuated with me enough that he would kiss me while I was blindfolded?” \nLan Qiren had never experienced qi deviation before, but the feeling rushing through him now must have been comparable. His brush fell from his fingers, and he spluttered, trying to form a response from a mind that was shattered in those few words. There were rules, Choose your words wisely and speak clearly, but if Wei Wuxian mentioned either of them, Lan Qiren would throw his brush at him. \n“How dare you?” He asked when his mind finally cleared enough for words. “Wangji would never. Wangji is—he’s.” Wangji was a Lan. Too much like a Lan, embarrassingly so. “Wangji…” He trailed off as he realized that what Wei Wuxian had absolutely described was something that his quiet, repressed, infatuated, nephew would do.\nLan Qiren buried his face in his hands and let out a weary sigh. \n“Perhaps,” he said, though he could have said, probably, or even, almost positively. Wei Wuxian didn’t need any more reasons to go chasing after his nephew right then. “How could I have raised such a child?” He lamented. \nWei Wuxian let out an astonished, breathless laugh, and Lan Qiren looked up to find him with a hand pressed to his lips and a blush burning his face a bright red. \n“I’m sure it’s not all your influence,” Wei Wuxian said, still staring off where Wangji had left earlier. “I was raised by Madame Yu and look at me.”\nLan Qiren wasn’t tempted to smile, but he bit the inside of his cheek anyway in case one slipped out anyway. \n“Indeed.”\nHe found himself with an almost fond look to his face before he remembered himself and returned to scowling. \n“Clean your mess up!”\nThe next morning Wei Wuxian showed up looking well rested, well fed, and happier than Lan Qiren could remember seeing him since he was causing mischief in his classroom. He refused to examine why Wei Wuxian looked so much better, especially since he’d heard report from Xichen that Wei Wuxian was never seen leaving Wangji’s home the night before. He was wearing the pale blue robes that Wangji had requested weeks ago and Lan Qiren decided that he just wouldn’t look at him for the rest of the day lest he accidentally divine something about his nephew that he would prefer to remain in the dark about.\nWei Wuxian was as diligent in his study as he’d been the day before, but he was more willing to take breaks. On one such break, as they had a cup of tea, Wei Wuxian looked at him with a guarded expression. It took him a moment to speak, but Lan Qiren was no stranger to patience, so he just waited for Wei Wuxian to gather his words. \n“Can you tell me about my mother?” He asked eventually. \nLan Qiren hadn’t expected such a question, so he didn’t answer immediately, but Wei Wuxian seemed to mistake his surprise as unwillingness to answer. \n“It’s only, Sect Leader Jiang didn’t talk about her much because of Madame Yu and I don’t know very many people who knew her and you compared me to her once so you must have known her.”\nIt all came out in a rush, and Lan Qiren held up a hand to stop him from rambling any farther. \n“Your mother came to Cloud Recesses to study when I was younger,” he said, thinking back to those days when he was young and his brother and he were still close and students teased him instead of cowered in fear. “She caused me no end of grief. She was much like you and I was much like my nephew, and she bothered me ceaselessly.”\nWei Wuxian curled his lip. \n“Oh gross, were you and my mom…” He trailed off with a suggestive look to Lan Qiren.\nLan Qiren almost choked on his mouthful of tea. \n“Of course not!” He barked, hoping he wasn’t flushing from embarrassment. \nHe was too old to be embarrassed over such things. If Lan Qiren had had a little crush on her when he was young, then that was no one’s business but his own. Besides, it hadn’t been more than a little bit of childish infatuation towards the first person Lan Qiren had ever seen question authority out loud and in their face. Wei Wuxian certainly didn’t need to know any of that. \n“Hmm,” Wei Wuxian said, which wasn’t promising, before he fell silent. \nLan Qiren had spent enough time around Wei Wuxian to know that if the conversation ended abruptly to a long silence, Wei Wuxian was thinking up a question that would ignite either rage or embarrassment in him, usually both. \n“If things had gone differently, would you have been my dad?”\nRegrettably, as Lan Qiren sputtered, Wen Qing rounded the bend with little Wen Yuan clinging to her back, chattering away. \n“I see you two are having fun,” she said, sitting down beside them and placing Wen Yuan on Wei Wuxian’s lap who cooed and cuddled him close. \n“On the contrary,” Lan Qiren muttered. \nWen Qing just raised her eyebrow, which somehow felt like commiseration and judgement in one. \n“Wei Wuxian told me that you’re trying to find a way to restore his core,” she said, tugging Wei Wuxian’s notes in front of her to glance over them. “You should know that I’ve done much research to try and help Wen Zhuliu’s victims, and I’ve never come close short of—”\n“Something!” Wei Wuxian interrupted loudly, startling Wen Yuan in his arms to scramble up and cling to his neck. He turned to stare at Wen Qing with eyes that were trying to communicate something to her. “Something that is a secret,” he hissed at a much more acceptable volume.\nBefore any of them could say anything else, Wen Yuan slapped his little hands over Wei Wuxian’s mouth. \n“Xian-gege,” Wen Yuan said urgently. “We’re not allowed to be loud here, Lan-shushu said. It’s against the rules”\nLan Qiren felt like they should put that boy into classes as soon as he was old enough since he seemed like he would make a fine disciple. Despite being raised by Wei Wuxian, he still seemed so receptive of rules. \nThen he remembered what else the boy had said.\n“Lan-shushu?” Lan Qiren asked. \n“Zewu-jun,” Wen Qing clarified. “He seemed ecstatic to be called that and told us not to scold A-Yuan for it.”\nLan Qiren resisted the urge to sigh. Xichen had always had a soft spot for little children, and Lan Qiren couldn’t blame him. \nWei Wuxian gathered Wen Yuan up, then, so that they were eye to eye. \n“A-Yuan, please don’t tell me you like your Lan-shushu the best,” he said seriously. “That would make me cry.”\nWen Yuan patted his cheeks and said, “Nope,” but before Wei Wuxian’s blinding smile could fully form, he continued, “I like Rich-gege the best!”\nWen Qing and Lan Qiren shared a longsuffering look as Wei Wuxian let out a wail and buried his face in Wen Yuan’s shoulder to let out fake heaving sobs until Wen Yuan told him that he was his favorite, too. \n“Rich-gege and Xian-gege are both my favorites,” he petting Wei Wuxian’s hair with his chubby little hand in comfort. \nWei Wuxian finally ended his sobs and pulled his face from Wen Yuan’s shoulder only to tickle the boy’s tummy until he let out a peal of sweet giggles and say, “And don’t you forget it.” He looked up to find both Lan Qiren and Wen Qing staring, but he didn’t seem embarrassed, he just grinned and said, “He likes me best.”\n“I believe you’re tied for best,” Wen Qing said with one delicately raised eyebrow. “And only because of your emotional blackmail.”\nWei Wuxian pouted. \n“It still counts. A-Yuan, tell her it still counts.”\n“It still counts, Qing-jie,” Wen Yuan said, before becoming distracted with all the papers on the table, examining them seriously even though Lan Qiren was fairly certain he was too young to be able to read. \n“Why are you here?” Wei Wuxian asked Wen Qing. \n“I want to help.”\nWen Qing was focused and serious. She already had a great well of knowledge about cores, though that was to be expected, and her medical knowledge was handy. With Wen Yuan there, Wei Wuxian was more prone to moving around and making noise, but Wen Qing was a quiet and respectful research partner. \nWangji was the one who brought them their lunch, which meant that no one could warn him before he found Wen Qing helping them. He didn’t quite pout when he realized she was there, but his shoulders slumped just a little when he caught sight of her helping them. \n“I thought it was secret,” he said. \nWei Wuxian shot a panicked look at Lan Qiren before turning to Wangi with a regretful smile. \n“Wen Qing already knew,” he said. \nWangji’s shoulders drooped just the slightest bit more. \n“And A-Yuan?”\n“I already know!” He chirped, reaching up for Wangji to pick him up. \nLan Qiren was pretty certain he didn’t actually know and was just repeating what Wei Wuxian and said, but Wangji seemed to take it as confirmation that he was the only one who was being kept in the dark. \nHe gave a stiff nod as he picked Wen Yuan up and settled him on his hip. Wen Yuan yawned once and then snuggled closer to Wangji, tucking his head into the crook of Wangji’s neck.\n“I know!” Wei Wuxian said. “How about you take A-Yuan for his nap!” \nWei Wuxian caught Wangji’s hand and brought it to his mouth to press a kiss to his knuckles which wasn’t a vulgar display, but still one that Lan Qiren didn’t particularly need to see. Wangji’s face softened just a hair before he glanced at Wen Qing again and that soft expression turned sour. Even another kiss to his knuckles didn’t keep his face from hardening. \n“Not tired,” Wen Yuan muttered, though his eyes had already slipped shut. \nWangji let out a little, resigned sigh before pulling his hand from Wei Wuxian’s and excusing himself to leave the way he came, feet dragging as much as he ever let his feet drag. \n“I bet he feels like an underappreciated wife,” Wen Qing muttered once he was out of earshot, causing Wei Wuxian to gasp and Lan Qiren to hide a smile behind his teacup.\nThe Wen Remnants hadn't been in Cloud Recesses for a full week yet when Sect Leader Jiang stomped up to the gates and ordered to be allowed entrance.\n“Where is Wei Wuxian?” Jiang Wanyin demanded once he was in front of Lan Qiren, sounding every bit as fierce as his mother in her prime. “He’s here, isn’t he? He is a disciple of YunmengJiang and if you have taken it upon yourselves to discipline him in our stead.”\nLan Qiren sighed. He’d had a headache all morning and all the intense study he’d done hadn’t helped. Now he had to deal with this, and it made him want to go to bed early, but, regrettably, he hadn't had the chance yet. \n“Wei Wuxian isn’t being punished,” he said. “He and the Wen are under our protection.”\nJiang Wanyin took a step back, obviously shocked. \n“Why?”\n“Upon observation of the settlement in the Burial Mounds, we came to the conclusion that Jin Guangshan lied about the particulars concerning his treatment of the Wen prisoners in his custody.”\nLan Qiren glanced at the door as Wei Wuxian and Wangji entered in a rush, most likely drawn by Jiang Wanyin’s raised voice. They were at Jiang Wanyin’s back, so he hadn’t seen them yet, and Lan Qiren didn’t know whether he should let him know they were there, or signal to them that they should make themselves scarce until Jiang Wanyin calmed down. \n“I thought everyone knew they’d lied?” Jiang Wanyin said, crossing his arms over his chest. “It’s what Jin do.”\nIf anyone from the Jin Sect were in attendance, that would be an unforgivable slight, but Lan Qiren was willing to let it slide.\n“You knew and you did nothing?” Lan Qiren asked. \nJiang Wanyin’s scoff was disrespectful, but seeing as he was a sect leader and not Lan Qiren’s student, there was little he could do about that . \n“What could I do? The Jiang Sect barely has anything, how could we stand against Jin Guangshan?”\nWei Wuxian barked out a laugh from where he stood, startling Jiagn Wanyin to spin around and face him. \n“He had a conflict of interest,” Wei Wuxian said, walking farther into the room. “Who would believe a man standing up for his brother. You might have just called him naive and dismissed his claims. What good would that have done him?”\nLan Qiren’s head was pounding, and he really wished that this could wait. \n“You both make fair points,” he said. \nJiang Wanyin turned back to Lan Qiren with narrowed, suspicious eyes. \n“If Wei Wuxian isn’t being punished, then why wasn’t he sent to Lotus Pier?” He asked. \nLan Qiren couldn’t help but raise a dubious eyebrow. \n“I thought he wasn’t a part of your sect anymore.”\nFrom what he’d heard, there was a duel that left both of them wounded and Wei Wuxian kicked from the Jiang Sect. He remembered Wangji pointedly saying nothing about it to accentuate the way he silently seethed at the news. \nJiang Wanyin pulled his upper lip back to bare his teeth, Zidan crackling on his fist. \n“He should be in Lotus Pier. You can’t just keep him here if he doesn’t want to be.”\nIt was then that Wei Wuxian walked between Jiang Wanyin and Lan Qiren, Wangji close at his side with a hand on Bichen, not taking his eyes from Jiang Wanyin like he was afraid he would hurt Wei Wuxian. From what Lan Qiren had heard, his fear wasn’t completely unfounded. \n“Jiang Cheng, they aren’t keeping me here against my will,” he said. \nJiang Wanyin hesitated for a moment and then scoffed, like he thought Wei Wuxian was joking. \n“What, are you staying here to try and get out of helping us rebuild?” He asked in his harsh tone. \nThere was something vulnerable in his eyes, and Lan Qiren remembered something he’d realized about Jiang Wanyin when he’d been his student. Where Wei Wuxian covered his emotions up with a smile, Jiang Wanyin covered his with anger and pretending not to care.\n“I want to stay here,” Wei Wuxian said simply. \nHurt flashed over Jiang Wanyin’s face but it was quickly replaced by anger. \n“Fine. If that’s what you want,” he spit out, making to turn and leave, only stopped by Wei Wuxian’s hand on his arm. \n“No, Jiang Cheng, that’s not it.”\n“Then what is it?” He demanded. “What else could make you stay here instead of at home where you belong? If you were still hiding in your cursed Burial Mounds, I could understand, but here?”\nThe words rang in the room, not quite an echo, but lingering in the air. Wei Wuxian seemed so small, even though he was slightly taller than Jiang Wanyin. The hand not clutching Jiang Wanyin’s sleeve was curled close to his chest and he was heaving quick breaths. If Lan Qiren could see his face, he felt like his eyes might be shining with tears. \n“Jiang Cheng,” Wei Wuxian whispered, and then again, stepping closer, “Jiang Cheng.”\n“What?” Jiang Wanyin barked. \n“It’s not that I don’t want to come home, Jiang Cheng,” Wei Wuxian said, quietly, carefully.\n“Then come home.”\nWei Wuxian let go of Jiang Wanyin’s sleeve to take a step back.\n“I need to be here,” he said firmly. \nJiang Wanyin followed his step. \n“Why?”\n“Jiang Cheng—“\n“Tell me why? Is it because of Lan Wangji?” He took another step closer, crowding Wei Wuxian into taking another step back. “Did you decide that he was more important to you than me? That he can protect you better that I can?”\n“No, Jiang Cheng, I—”\n“Oh, is it that you have a new family now?” Jiang Wanyin continued. “Are your Wen better than your actual family? You think I wouldn’t help if I could?”\nAnother step forward, another step back. Wangji’s grip tightened on his sword but he didn’t interfere either trusting Wei Wuxian to be able to hold his own if anything happened or trusting his own ability to fly across the room and intervene before any damage could be done. \n“Jiang Cheng, of course—”\nJiang Wanyin flexed the hand where Zidan was still sparking across his fingers, and Lan Qiren readied himself to intervene if it came to anything more than shouting. \n“Then why won’t you just come home?” He demanded. \n“I don’t—”\n“Tell me why!”\n“I don’t have a core!” Wei Wuxian shouted, forcing Jiang Wanyin back with his own step forward. \nThe Wangji and Jiang Wanyin took the same shocked inhale, but Wei Wuxian continued.\n“Master Lan is trying to find a way to help me restore it,’ he said in a lower tone that was still loud in the quiet room.\nJiang Wanyin stared at Wei Wuxian with a crazed look that Lan Qiren didn’t know how to interpret. His eyes were wide with an indecipherable mix of emotions that eventually settled on questioning.\n“Why didn’t you tell me?” He asked in a small, hurt voice before anger overtook his features. “We could have helped you if you’d only—” A pause as his face flickered back to questioning. “Why didn’t you go to Baoshan Sanren?”\nBaoshan Sanren?\nWei Wuxian glanced at Lan Qiren out of the corner of his eye briefly, but Lan Qiren caught it and put to mind to gather answers from the boy later. \nIt was painfully obvious that Wei Wuxian’s responding laugh was forced.\n“Could I climb a mountain for the second time and request yet another core?” He asked. He didn’t look back to Lan Qiren, but Wangji did. He had a question in his eyes that Lan Qiren didn’t have the answer to, though he was beginning to piece something together. “She’d think me careless and send me away, wouldn’t she?”\nWei Wuxian had lost his core before? He’d had it restored before? \nWei Wuxian ducked his head so he didn’t see the guilt that flashed over Jiang Wanyin’s face, but Lan Qiren caught it. \n“So I stole your only chance?” Jiang Wanyin asked in a broken voice. \nLan Qiren remembered, then, Wei Wuxian words from their journey to Cloud Recesses: I gave it away. I offered my core in exchange for my brother’s life.\nAnother piece slotted into place. Wei Wuxian hadn’t been the one to get his core restored by Baoshan Sanren, but Jiang Wanyin. It must have been. Wei Wuxian must have offered up his own core as payment for Baoshan Sanren restoring Jiang Wanyin’s. \nWhat a terrible sacrifice. \n“Don’t blame yourself,” Wei Wuxian said. “I wouldn’t change anything that happened, so you shouldn’t get stuck in any regrets. I won’t allow it.”\nLan Qiren recognized Madame Yu in the dark look on Jiang Wanyin’s face before he turned on his heel and stalked from the room. \nWangji rushed forward and gathered Wei Wuxian close as soon as Jiang Wanyin stalked off, closing him in his arms before his legs grew too weak to hold himself up. Lan Qiren was startled to see tears on Wangji’s cheeks. \n“Wei Ying,” he whispered. \nWei Wuxian turned to bury his face in Lan Wangji’s neck. \nHe mumbled something that Lan Qiren could not hear, but Wangji nodded and led him out of the room. \nOnce they were gone, Lan Qiren let out a breath and decided that they would be done for the day. Wei Wuxian likely wasn’t coming back, Wen Qing was at the site of the new settlement with Xichen trying to plan out where they were going to build, and Lan Qiren still had a headache.\nThe next day Wei Wuxian showed up at Lan Qiren’s garden almost as soon as the morning chime sounded. His eyes were bloodshot and red-rimmed, and Wangji was at his side. \nNo one said anything as they sat down and began to work. Lan Qiren almost wanted to ask if Wei Wuxian had talked to Jiang Wanyin or ask questions about Wei Wuxian’s missing core, but he was afraid Wei Wuxian might cry and he didn’t want that. \nAn hour or so later, Wen Qing showed up with a sleeping Wen Yuan in her arms. \n“He cried until I told him he could visit his Xian-gege,” she said as she passed him into Wei Wuxian’s arms. \nThat seemed to perk Wei Wuxian up a little, but he still seemed lost in his own head. \nThey worked in silence for the most part. When Wen Yuan woke up, he busied himself with painting a picture from where he sat in Wei Wuxian’s lap. He’d promised very seriously not to get any ink on the books, but they were all keeping them out of reach just in case. \nAfter a while, Wei Wuxian broke the silence. \n“I gave my core to Jiang Cheng,” he admitted. \nLan Qiren jerked his head from the characters he was examining to look at Wei Wuxian. Neither Wangji nor Wen Qing looked surprised, so Lan Qiren figured they’d already been told. \n“Sharing is good,” Wen Yuan said from his perch in Wei Wuxian’s lap, not even looking up. \nWei Wuxian, careful of the ink on Wen Yuan’s brush, squeezed the boy close to his chest. \n“Wen Zhuliu melted Jiang Cheng’s core and Wen Qing removed mine to give to Jiang Cheng.”\nLan Qiren shot his gaze to Wen Qing who didn’t hide under his scrutiny. She tilted her chin up and met his eyes.\n“So this is what you meant when you said you had previous experience,” he said. \nShe nodded. \n“There was a very high chance of failure, but Wei Wuxian wouldn’t take no for an answer when I told him that there was even the slightest chance of success.”\nLan Qiren turned to Wei Wuxian who was staring down at A-Yuan’s little hand gripping the too-big brush as he painted some indecipherable smear of shapes across the paper before him. \n“Why?” He asked. \nWei Wuxian looked up to meet his eyes, his mouth a harsh line on his face, slipping up into a rueful smile. \n“He’s my brother. There’s nothing I wouldn’t do to keep him safe.”\nLan Qiren’s heart stuttered in his chest and he clenched his jaw shut against the wave of emotion that threatened to fill him up. He’d known that kind of sibling bond before, but it had been so long. Wangji and Xichen’s closeness had never struck him this hard, but something about Wei Wuxian’s own casual willingness to give everything up for his brother made him remember every time he plead with his own brother to come out of seclusion, every time he begged on behalf of their sect, of his nephews, of himself drowning under the weight of the responsibility he’d never expected to have. \n“What of Baoshan Sanren?” He asked to clear his throat. “How did she help?”\nWei Wuxian let out a weak laugh and rubbed the tip of his nose with the back of his knuckle. \n“Well, she didn’t actually help, we just told Jiang Cheng she was the one to restore his core so that there wasn’t any way he could guess what had actually happened. We needed an excuse and what’s more convenient than an immortal who I have a personal connection to that never comes down from her mountain to refute our story?” \n“And he couldn’t sense that the core was yours?” He asked, intrigued. “Surely you were at least passingly familiar with one anothers’ cores to sense something like that.”\nWen Qing was the one to answer.\n“I theorized that since they were raised in the same sect with exactly the same cultivation styles, that the difference between his own core and Wei Wuxian’s would hardly be noticeable. Any differences in core strength or signature he probably either assumed it was because he hadn’t had a core in a while or was so relieved to have a core again that he didn’t care to notice anything odd about it.”\nLan Qiren wondered if Jiang Wanyin, sequestered away in his provided guest quarters, wasn’t meditating hard on his core, trying to pick out the pieces of his core that still thrummed with his brother’s energy. Would it frustrate him more if the energy he felt was all his own or if he caught a hint that he’d overlooked before.\n“Have you told Jiang Wanyin?” He asked. \nWei Wuxian ducked his head the way guilty students did when Lan Qiren came across them smuggling contraband into their dorms. \n“Not yet,” Wangji spoke for him, though that was obvious. \nWei Wuxian turned wide pleading eyes on Wangji. \n“Lan Zhan, don’t bully me,” he whined, leaning over to cling to Wangji’s arm. “I told you I’m going to tell him.”\n“Hm,” Wangji said, not looking up from the notes in his hand, though he did lean into Wei Wuxian’s grip on his arm. \n“I will, Lan Zhan,” Wei Wuxian exclaimed. “I promise. When do I ever break my promises?”\nWangji continued to keep his careful, blank expression, though he did cut a look at Wei Wuxian from the corner of his eye. \nWei Wuxian made an offended noise. \n“Fine!” He said, plopping Wen Yuan into Wangji’s lap and shooting to his feet. “I’ll go and tell him now!”\nWangji just made another doubting hum, which made Wei Wuxian stalk off down the path, muttering to himself. It was only when he’d gotten almost out of sight that he seemed to realize just what he’d promised to do because he turned on his heel and started heading back to them. \nHe let out a weak laugh and said, “Ah, but what if Jiang Cheng is asleep or what if he doesn’t want company. It wouldn’t do to bother him. I’ll just tell him later.”\nJust as he went to sit down, Wangji said, “Wei Ying,” in a low, warning voice which made Wei Wuxian huff before taking off down the path again. \nOnce he was nearly out of sight, he yelled back, “If he kills me, it’s Lan Zhan’s fault!”\n“No shouting in Cloud Recesses,” Lan Qiren called after him. \nWei Wuxian turned to call back, “Yeah, no shouting in Cloud Recesses, Master!” \n“No shouting in Cloud Recesses,” Wen Yuan repeated, but at a whisper, glancing up at Wangji. \n“Very good,” Wangji said, barely concealing a smile as he avoided Lan Qiren’s gaze. \nWen Wen Qing very carefully didn’t look at any of them, but she was shaking her head, and Lan Qiren almost felt chastised just that she behaved herself better than he did. \nThey worked long enough for Wen Yuan to nap in Wangji’s lap and then wake up groggy and whiny. Lan Qiren had been tasked with holding him while Wangji retrieved him a snack and Wen Qing excused herself at Xichen’s request to help with the plans for the Wen settlement near the base of the mountain. Wen Yuan was a perfectly agreeable boy normally, but abandoned just to Lan Qiren who he’d only known for a little while, he couldn’t keep himself from tears. It was probably a mixture of waking up with only Lan Qiren there and being in a new place and Wei Wuxian having left earlier that made him fussy, but he just wouldn’t stop crying. Lan Qiren was contemplating getting up to find Wangji when he was interrupted. \n“Aya, what are you doing to my poor little radish?” Wei Wuxian called out suddenly, approaching the table with Jiang Wanyin at his side. “Only a brute would make him cry like that!”\nWen Yuan jerked his head up immediately at his voice, letting out a loud wail as he reached for Wei Wuxian. Lan Qiren would almost feel offended if he wasn’t so relieved that the boy was going to stop crying soon. \n As they approached, Jiang Wanyin elbowed Wei Wuxian in the side and hissed, “Don’t speak to your elders that way!”\nWei Wuxian ignored him in favor of swooping in and collecting Wen Yuan into his arms, cuddling him close to his chest and soothing a hand over his back. Lan Qiren was sure there was a wet patch on his own shoulder where Wen Yuan had spent the last several minutes inconsolable, but he elected to ignore it. It wasn’t the first time a child had cried on his shoulder and it probably wouldn’t be the last. Not that children made a habit of crying when he held them, he was simply often put in charge of children who were either already crying or easy to be swayed to tears. Xichen had cried often. Wangji preferred to pout, but little Xichen would cry at nearly anything, happy or sad. On one memorable occasion, Wangji, barely two and still unsteady on his feet, had tripped over the hem of his own robe, and the tumble he took made Xichen cry so hard that he’d cried himself to sleep, while Wangji just stood back up and kept toddling. \n“His hair tickled my ear,” Wen Yuan said, taking a deep, sobbing breath after each word ashe buried his snotty nose in Wei Wuxian’s shoulder, who didn’t even flinch, perhaps used to that. \n“Ah, how terrible,” Wei Wuxian said. “What should we do to punish him?” \nHe winked at Lan Qiren which was not appreciated. Lan Qiren pointedly didn’t look to where Jiang Wanyin was hovering uncomfortably by Wei Wuxian’s shoulder because he feared that awkward eye contact might occur. \nWen Yuan just shook his head against Wei Wuxian’s shoulder as his sobs subsided. \n“I don’t want to take a nap,” he whined. \nWei Wuxian patted his back in consolation. \n“Have you already had a nap today?” He asked. \nThat kickstarted another round of tears as Wen Yuan sobbed out, “I didn’t.”\n“He did,” Wangji said, rounding the corner, eyeing Jiang Wanyin warily. \nWen Yuan looked up from Wei Wuxian’s shoulder to lunge for Wangji, though to be held by him or to get hs snack, Lan Qiren didn’t know. \n“A-Yuan,” Wei Wuxian scolded, leaning over Wangi’s shoulder to tweak the boy’s nose. “You don’t have to nap if you already took one.”\n“But I didn’t,” Wen Yuan said with a pout, turning his head away from Wei Wuxian. \n“Lying is forbidden,” Lan Qiren found himself saying.\nWen Yuan sat up suddenly with wide eyes as his face crumpled and he let out another loud wail. He didn’t bury his face back in Wangji’s shoulder, apparently too overcome to do anything but bring his chubby fists up to his eyes as he sobbed in Wangji’s arms. \n“I don’t want to leave,” he cried between sobs. “I’ll be good. I promise. I’ll follow the rules.”\nWei Wuxian crowded close to wrap his arms around Wen Yuan and Wangji both while Wangji rubbed his hand over Wen Yuan’s back and drew him close to his chest. \n“No one’s going to make you leave, A-Yuan,” Wei Wuxian said. \nHe didn’t even spare a glance towards Lan Qiren, not even to glare as he brushed Wen Yuan’s hair back from his forehead and the tears from his chubby cheeks. \n“A-Yuan, it doesn’t matter how many rules you break, no one is going to kick you out,” he continued, barely able to speak over Wen Yuan’s cries. “Right, Lan Zhan?”\nWhen Wangji had been little, he’d somehow gotten it into his head that someone was keeping track of every rule he’d ever broken, and that some day, the number was going to get so high that they would lock him away and not let him see anyone. Lan Qiren found out later that one of the older disciples told Wangji that was what happened to his parents. When Lan Qiren discovered Wangji, hiding in his room, trying to hold in the sobs that slipped out anyway, he’d felt such a surge of protectiveness that it scared him. \n“Of course, you have to follow the rules,” he’d told little A-Zhan as he tucked him into bed, still crying and still trying to hide it lest he exhibit excessive emotion and that be added to his tally. “But you won’t be locked away.”\nThat had seemed to assure Wangji who wiped his cheeks with his sleeves and finally turned to face him. \n“What happens when someone breaks too many rules?”\nLan Qiren, relieved that Wangji was no longer crying, had answered without thinking. \n“They go in front of the Elders, and if they are found unwilling to keep with the Lan standards, they have to turn in their headbands and leave Cloud Recesses.”\nLittle Wangji had clutched at his own ribbon with a white-knuckled grip and sobbed until he’d cried himself to sleep. Nothing Lan Qiren or Xichen had been able do had been enough to stop him then, and, in that moment, Lan Qiren had felt helpless. \n“No one will kick you out,” Wangji agreed, tone serious and consoling as he soothed his hand over Wen Yuan’s back. “I will not let them.”\nLan Qiren wondered if Wangji was remembering the same thing he was, and he suddenly felt ashamed. He’d had how many years of raising Wangji and Xichen before him? Wangji hadn’t known Wen Yuan for very long, yet he knew exactly what to say to get the boy to calm down. \nOnce Wen Yuan finished his final sniffles, nestled into Wangji’s collar bone, he was easily placated with the snack that Wangji had brought for him. \nJiang Wanyin, still hovering awkwardly at the edge of the garden cleared his throat, and Wangji and Wei Wuxian, caught in their own world, turned to him finally. Wangji didn’t say anything, he just narrowed his eyes, but Wei Wuxian jumped into action. \n“We’ve talked it out!” He exclaimed, tugging Jiagn Wanyin by the elbow, forcing his arms uncrossed as he pulled him to the table. “Jiang Cheng cried a little bit but we’re better now and he wants to help.”\n“I did not!” Jiang Wanyin growled, face dark red as he let Wei Wuxian lead him to their table. \nWangji very deliberately spread out Wen Yuan’s, Wei Wuxian’s, and his supplies so that Jiang Wanyin wouldn’t be able to fit on their side of the table, so Jiang Wanyin took Wen Qing’s spot next to Lan Qiren. \nIf Lan Qiren had been under the impression that doing research alone with Wei Wuxian would be awkward and annoying, it was nothing to having Jiang Wanyin sitting beside him with Wangji and Wei Wuxian on their own side of the table in their own little world. He was quiet and he didn't fidget, but his stillness was almost too stiff, like he was just as uncomfortable as Lan Qiren. \nAfter a bit, after granny Wen came to collect Wen Yuan for the afternoon, Wangji stood from the table to fetch a book from the library, and Wei Wuxian had jumped up and volunteered to go with him so that his “Er-gege won’t get lonely.” Lan Qiren almost offered to go with them as well when faced with the idea of sitting next to Jiagn Wanyin who hadn’t said a single word since he’d sat at tha table. Lan Qiren normally wouldn’t mind the silence, but he’d gotten so used to both Wei Wuxian and A-Yuan constantly fidgeting, that silence almost felt unnatural. Also, it was strange that his former student was now a sect leader after so few years after leaving Cloud Recesses, and he didn’t know how to combat the strange atmosphere. \n He silently fumed as Wangji and Wei Wuxian failed to return as the minutes rolled by, but then he realized he could use fetching them as an excuse to put some distance between himself and the tense atmosphere that he may or may not have imagined. He grumbled as he got up from the table to go fetch them. They had probably gotten distracted along the way and needed a reminder of the task, which wasn’t like Wangji, but with Wei Wuxian at his side, Lan Qiren didn’t trust him. \nThe library seemed empty when Lan Qiren entered, and he took a deep calming breath in the familiar stillness around him. He quickly realized that he was mistaken, though, when he took a step farther in and only to catch sight of two figures kneeling on the floor, wrapped around each other. He quickly shut his eyes and spun around, but nothing could erase the image of his nephew straddling Wei Wuxian’s lap as they traded desperate kisses, both of their robes half undone and slipping from their shoulders. \nThey apparently hadn’t even heard him come in because Lan Qiren could still hear wet smacking noises from behind him. \n“Wei Wuxian! Wangji!,” he shouted, beyond any other words. \nThere was a crash and then a loud thump followed by a sharp exhale that might have been Wangji hitting the floor, but Lan Qiren refused to turn around. \nWei Wuxian started laughing so suddenly that it startled Lan Qiren. \n“Wei Ying,” Wangji said, reprimanding, but any authority was lost in the breathlessness of his voice. \nFor some reason this was worse than the time Lan Qiren had found Xichen in the library, mainly because neither of these two had the excuse of being fifteen to explain their lack of critical thinking. Plus, Lan Qiren hadn’t known the disciple who Xichen had been tangled with, and they had both been fully clothed. This was beyond anything Lan Qiren had ever expected from this particular nephew, and he put it in mind to pray when they were done for the day. Pray for strength and patience and for that horrible image to be scrubbed from behind his eyelids. \n“Get dressed!” he demanded. “And learn how to control yourselves! This is a public building!”\nWei Wuxian had the audacity to laugh. \n“You’re right, Master Lan,” he said. “We’ll keep this stuff to the jingshi.” Another laugh. “Though maybe we can’t call it that anymore if this goes any further. Lan Zhan gets loud sometimes.”\n“Wei Ying!” Wangji said, scandalized. \nBefore anything else could be said, Lan Qiren left with a cry of outrage and burning cheeks, hoping that at least Wangji was as embarrassed as he was if Wei Wuxian refused to feel shame. \nWhen Lan Qiren told Xichen what happened, he laughed so hard that he cried, and Lan Qiren left in a huff for not receiving the kind of sympathy he craved. He was almost tempted to go back to his garden to tell Jiang Wanyin just to have someone to commiserate with him, but he felt like it was probably better to try and forget what he’d seen rather than continue talking about it. \nThe next time he saw Wei Wuxian, he didn’t even look chastised. Instead, there was just a glow about him. Lan Qiren didn’t speak to him for a full day, but Wei Wuxian didn’t even mention it, content with humming some soft tune under his breath and smiling so hard that it made Lan Qiren want to throw something at him to make him stop.\n“What exactly happens when someone transfers spiritual energy to you?” Lan Qiren asked one afternoon. “Where does the energy go? How does it flow through your body?” \nWei Wuxian looked up from what he was writing, startled. \n“I’m pretty sure it just slips out,” he said after a moment of thought. “I don’t have any spiritual energy for someone’s else’s energy to pour into.”\n“May I?” Lan Qiren asked, holding out a hand for Wei Wuxian’s arm. \nLan Qiren gripped his arm gently and siphoned energy into Wei Wuxian’s wrist, keeping a close monitor on where it went. It traveled along the normal pathways, sliding through Wei Wuxian towards where his core had been and then, after finding no purchase, away to slip back to Lan Qiren’s arm holding his wrist, settling into his own core instead. \n“You need something for the spiritual energy to attach to,” he muttered. \nWei Wuxian snatched his arm back. \n“Yeah, like a core,” he said bitterly. \nLan Qiren nodded, “Exactly.”\nThe next morning, Lan Qiren went into seclusion to meditate on his own core. Wei Wuxian had been upset that he was going to be absent at first, thinking that Lan Qiren was giving up on him without explanation, but he was easily comforted by both Wangji and himself that they weren’t going to stop looking. The Lan valued righteousness, but what came most naturally to them was stubbornness. \n“It might be easier for me to help your core if I understand my own better.”\nIt took two weeks of solitude for Lan Qiren to find something like a solution. \nWei Wuxian couldn’t build a new core from scratch. A person couldn’t form something like that from nothing. All children were born with that innate ability to cultivate a core, a well of energy that waned as a person grew older until it was too weak to form a core. Wei Wuxian’s core had been removed, and his potential to cultivate a new one with it. They couldn’t use a transferral of spiritual energy to grow his core either because the energy needed something to grasp once inside the body. Spiritual energy was always in motion, and a golden core helped regulate the energy and keep it moving while providing an anchor. \nLan Qiren had an idea as to what that anchor could be. \nIt took another week and a half for him to figure out that he could draw bits of his own core out of his body. The process was exhausting, but once he found a way to collect that core essence, he called Wei Wuxian to his home to test his theory. \nWei Wuxian was practically vibrating with energy as he and Wangji walked in. There was something almost feral in his eyes, like he wanted to bolt, but was afraid to. He also looked fuller-cheeked and stronger than when Lan Qiren had gone into seclusion, and Lan Qiren had a feeling that his nephew had a hand in making sure Wei Wuxian was taking care of himself. \nThat wild look never left Wei Wuxian’s eyes as Lan Qiren explained his theory and his process. He’d already meditated that morning to gather a few drops of his core essence, so all there was left to do was to pass the energy into him. \nThe few drops traveled along Wei Wuxian’s spiritual pathways. The sensation caused Wei Wuxian to shiver, but he kept his concentration, observing even more intently than Lan Qiren. It took the energy a long time to make it all the way to his core, long enough that Lan Qiren was sure their tea had grown cold, but when it reached that empty space that had housed Wei Wuxian’s core, it hesitated. Lan Qiren could feel Wei Wuxian’s pulse pick up underneath his fingertips, but he didn’t mention it. Instead of slipping out like water from the palm of a hand, the energy spread itself thin over the emptiness from his core and settled softly in place. It remained long enough for Wei Wuxian to choke out a sob before the resentful energy that was still soaked all throughout his body devoured it. \nThe next noise out of Wei Wuxian’s mouth was one of frustration, but as he leapt to his feet to pace, Wangji hovering at his side, Lan Qiren’s mind was already coming up with solutions. The base was there, the essence of his core had clung to the emptiness in Wei Wuxian’s body just like Lan Qirne had theorized, they just needed to make sure there was nothing there that would destroy the fragile energy. They also needed to make sure thay collected enough energy for it to survive the transfer to Wei Wuxian’s body for long enough for him to build it up. \n“Have you let Wangji play his compositions for you?” Lan Qiren asked. \nWei Wuxian paused in his pacing and blushed a dark red before glancing to Wangji and letting out a nervous huff.\n“How do you know about that?” he muttered. “Lan Zhan said that song was only for me.”\nLan Qiren closed his eyes briefly to take a deep breath before continuing. \n“I mean the compositions he wrote to help purge the resentful energy from you.” he clarified. He’s been working at it for months, trying to find something that would help.”\nThe way Wangji stared at Wei Wuxian and how Wei Wuxian scuffed the toe of his boot on the ground was answer enough. \n“Wangji, play for him until every bit of resentful energy is gone,” Lan Qiren said. “We need to get the resentful energy out before we can keep spiritual energy in.”\nWangji nodded before turning and leaving Lan Qiren’s home without another word, likely to retrieve his scores and his instrument. \n \n“So you think this will work?” Wei Wuxian asked, making to follow Wangji but pausing at the door. “Really?”\nLan Qiren wasn’t known for being a person who would coddle someone. He was a strict teacher, an honest man, a harsh critic. He would never give someone false hope with little chance of success. It was fortunate, then, that he was nearly sure this hope wasn’t unfounded. Nothing in his research or this test told him that this wouldn’t work in the right conditions. \n“Yes.”\nHe prepared a little jar, small enough to be held in the cup of two palms, squat and bulbous, made from soft green jade. Lan Qiren had spent a whole day and night infusing it with spells and spiritual energy so that nothing could leak out. He tested it once, meditating until he could draw out a small piece of the essence of his core. Only a couple of drops could be eeked out at a time, any more, he found, would render him unconscious. The process of extracting it was long, and only Lan Qiren’s years of meditating had prepared him for it. It took so much meditation, a deep concentration on his own core, drawing to the surface a drop of his core’s essence, meticulously cradling it the whole way. If his concentration slipped for even the slightest moment, the energy would surge back to his core and the process would have to be started over again. \nThe energy would pool in the palms that rested on his knees as he meditated and then carefully dripped into the jade jar. \nIt took enormous amounts of energy and several days for the core to be fully restored. Even with an exceptionally strong core, tearing its essence away was no small matter. Any amount shaved away had to be regained. \nWangji volunteered his energy up as soon as Lan Qiren explained the process. \nXichen had offered to help as well, but Lan Qiren wasn’t comfortable without at least one of the three of Wangji, Xichen, or himself uncompromised in case of any emergencies that would arise. Jiang Wanyin had wanted to help, but he didn’t seem to be able to gather his energy to dispel it like the others whether because he was so unused to that intense meditation or because the core he housed wasn’t his own. \n“Don’t feel bad, Jiang Cheng,” Wei Wuxian had comforted with limited success. “Who would I be to give a gift and then try to take part of it back? My core wouldn’t allow that.” He’d laughed, jostling Jiang Wanyin to get him to smile as well with no success. He continued anyway. “Who would think my core would know courtesy so well?”\nLan Qiren knew that Wei Wuxian hated watching them do this for no other reason than that they were going through all this strife for him and that he couldn’t help even a little bit because even the slightest interference might disturb them. Lan Qiren knew exactly how Wei Wuxian felt because he had complained loudly and dramatically while draped over Wangji’s lap during their evening meal. \nWangji hadn’t even made him get up, which irked Lan Qiren almost as much as Wei Wuxian’s embarrassing display. Wangji had gone as far as to pat Wei Wuxian on the head in comfort, though, at least he refrained from speaking seeing as they were in the middle of a meal. Lan Qiren looked to Xichen for support, but he had just been smiling fondly at the pair of them. It seemed it was up to Lan Qiren to be the only one with any propriety left. \n“Wei Wuxian, sit up. You’re behaving like a child,” he scolded. “Stop your whining and continue eating without speaking. Wen Yuan behaves better than you do.”\nWei Wuxian went more boneless than before as he whined, but after a moment and a couple more pats on the head from Wangji, he sat up. Wangji looked at Lan Qiren across the table with a blank expression, but he knew him well enough to be able to feel the glare that Wangji no doubt wanted in its place. He’d scold him as well, but he felt like ignoring Wangji’s displeasure might irk him more than being reprimanded. \n“No talking while eating,” Wei Wuxian said to Lan Qiren then, once he was upright.\nHe took a large bite to hide his grin, but Lan Qiren saw it anyway, though he refrained from speaking again, despite the twitch in his eye. \nThat was neither the first nor the last time Wei Wuxian had complained about not being able to help them, but all of them had learned how to ignore his whining. All of them but Wangji who seemed to enjoy the way Wei Wuxian sprawled over him to mope. He also seemed to shine under being able to comfort Wei Wuxian, adn Lan Qiren felt like Wei Wuxian might complain more than necessary since he seemed to enjoy Wangji’s doting as much as Wangji seemed to enjoy doting.\nOf course, Wangji’s attention couldn’t be all on Wei Wuxian all the time, especially once he started contributing from his own core. The first time Wangji had pooled his energy, they had all watched on in astonishment as he broke his meditation with not a few drops of golden energy, but enough to nearly fill the cup of his palm. At least, they were astonished until Wangji carefully poured the energy into the jar before he tipped to the side in an unconscious state, only saved from hitting the ground by Wei Wuxian at his side. \nIt took him nearly a week to regain consciousness, and Lan Qiren forbade him from gathering that much of his core’s energy again, Wei Wuxian on his side loudly supporting him which was a first. Wangji had looked like he wanted to protest, or at least stay silent and do it anyway, but Lan Qiren had had enough years teaching mischievous teenagers to interpret such things. \n“If this happens again, I will forbid you from helping completely,” he said. \nWhen Wangji had been young, too young for classes, almost too young for a forehead ribbon, he’d pouted often. He wasn’t a discontent child, but he liked things to happen a certain way, and if he didn’t get that, he would stick out his lower lip and puff his cheeks and let his eyes shine just enough that anyone would fall for it. Lan Qiren certainly had in his younger years. Once Wangji had started classes, he’d stopped pouting in his quest for maturity, so Lan Qiren hadn’t seen it in a while. \nHis pout now wasn’t as puffy cheeked or as bright eyed, but it still had some effect. Lan Qiren was astounded that Wei Wuxian had the will to stand up to it. \n“He’s right, Lan Zhan,'' Wei Wuxian said with finality. “Being cute won’t help you.”\nLan Qiren glanced up to Wei Wuxian to find that the reason he could resist the pout was because he wasn’t looking at Wangji, instead, looking stubbornly away. \nThe more energy they pooled in the jar, the more jittery they all seemed, and the more questions seemed to be posed. \n“What if it gets stuck in your intestines instead of the place it should be?” Jiang Wanyin asked one afternoon as they figured the logistics of how to transfer the energy into Wei Wuxian in the best way. \n“Then I guess I’ll have golden guts,” Wei Wuxian said with a nervous laugh. “Maybe I’ll have golden poop, and we can sell it and be rich.”\nJiang Wanyin punched Wei Wuxian hard enough in the arm to knock him into Wangji who glared at him even as he said, “Wei Ying,” in a warning tone.\n“I know, I know, don’t be vulgar,” Wei Wuxian said, laying his head on Wangji’s shoulder and blinking sweetly up at him. “Won’t you forgive this careless one’s naughty tongue?”\nWangji’s ears turned red as he said, “Forgiven.”\nLan Qiren wished he could forget the entire conversation, and his only reason for not regretting being there was that Wen Qing looked at him like she was thinking the exact same thing. \n“What Sect Leader Jiang said, while impossible, is part of the reason that we need to talk about this,” Wen Qing said, gathering everyone’s attention. “We certainly do not want to take any risks, and while the energy will likely follow Wei Wuixan’s pathways to where his core should be, we aren’t quite sure how this type of energy exactly will behave. Master Lan told me that last time, the energy took a long while to reach his core, and with this much of it, there is danger of it coagulating in the wrong place which could cause problems.”\nWei Wuxian let out a low moan and buried his face in his hands. \n“Oh no,” he whined. “Please tell me you aren’t going to have to cut me open.”\nWen Qing raised an eyebrow at him and remained silent causing Wei Wuxian to let out another groan. \n“Can I be asleep for this one?” He asked. “Last time wasn’t fun.”\nLan Qiren shot his gaze to Wei Wuxian as did Wangji and Jiang Cheng. \nLan Qiren imagined being awake and feeling his core being tugged from his chest. He didn’t know if he’d be able to live with the pain, but it seemed like another thing that Wei Wuxian was willing to joke away.\n“What do you mean?” Jiang Cheng demanded. “I was asleep last time.”\nWei Wuxian averted his gaze, so Wen Qing answered. \n“Sect Leader Jiang was receiving a fully formed adult core that was stronger than most. This is a collection of energy, so I’m not sure what will happen if you aren’t awake for it.”\nWei Wuxian slumped into Wangji’s arms with a wail. \n“Lan Zhan, Wen Qing’s being mean to me on purpose!” He cried. \nWangji patted him on the back consolingly, but rolled his eyes where Wei Wuxian couldn’t see. \nLan Qiren didn’t say anything about their embarrassing display, mainly because he felt like maybe right now Wei Wuxian deserved the comfort. \n“I’m sorry,” Wangji said which caused Wei Wuxian to pull back and smack a kiss on his cheek. \n“You always know what to say to make me feel better!” He announced. \nJiang Wanyin scoffed and shoved at Wei Wuxian’s shoulder. \n“You’re an embarrassment.”\n“Lan Zhan, defend me!” He cried. \nLan Qiren watched in a distant sort of astonishment as Wangu reached out and shoved Jiang Wanyin back. \nWei Wuxian laughed so hard that Wen Qing threatened to stick him with a needle if he wouldn’t calm down. \nWhen the day of the procedure finally came, Wei Wuxian looked like he was equal parts ready to jump around from the amount of energy in his chest and ready to vomit what little was in his stomach. \n“Lan Zhan, tell me this isn’t a dream,” he said as Wen Qing gathered her supplies and Lan Qiren carefully sat the jar of their cores’ essence on her worktable. \nHe felt protective over it. He knew it was because nearly half of the jar was his own energy, but he almost didn’t want to let it out of his sight. He wondered how Wangji felt about it, seeing as the other half of the energy was his. \n“You aren’t dreaming, idiot,” Jiang Wanyin said from the other side of Wei Wuxian, arms crossed over his chest in a way that he probably thought was casual, that made him look like he was vastly uncomfortable. \nWangji glared at him, but didn’t speak. \n“Jiang Cheng!” Wei Wuxian squawked. “It’s my birthday, you can’t be mean to me.”\nLan Qiren caught Wen Qing’s eyeroll as she readied her supplies. \n“It isn’t your birthday,” Jiang Wanyin groused. “You don’t even know when that is.”\nWei Wuxian pouted, but LAn Qwiren figured it was because he wanted Wangji to wrap his arm around him like he did. \n“Well, that means I get to decide when it is, and I say it’s today so stop being mean to me.” \nJiang Wanyin huffed and didn’t say anything else. \nWhen Wen Qing finished preparing, she had Wei Wuxian remove his outer layers and lay back on the table. As he did so, he shivered, though the air was warm around them. Wangji took his hand in a tight grip, but Wei Wuxian still trembled, most likely from a combination of nervousness and excitement. \n“Ah, this is the part I’m not looking forward to,” he said as Wen Qing wiped a patch of his lower stomach. \nSitting low on Wei Wuxian’s stomach, there was already a scar. Lan Qiren realized that this must be from the first procedure. It was simple, a small vertical line, straight and shining a silver against his skin in the light. He could see Jiang Wanyin staring as well, but instead of professional curiosity, he found regret on his face. \nWei Wuxian didn’t look at any of them, too busy staring at the little vial on the table, like he couldn't tear his eyes away for anything. \nIn order for the energy to properly connect with his body and flow along his spiritual lines, he had to remain awake and lucid as Wen Qing dripped the contents of the jade vial into his chest and the rest of them fed him spiritual energy to light up his spiritual pathways, making ture the energy behaved the way they wanted it to do. \nThe process took less than an hour, but it felt like days with Wei Wuxian breathing heavily as he tried to resist crying out, biting his lips until they bled as he tried not to scream. \nAs soon as the jar was emptied completely, Wen Qing closed the wound and checked his spiritual energy until she determined that it was safe for Wei Wuxian to be given medicine to knock him out so that he could heal. THe silence was a relief, but it was also startling. \n“We’ll have to wait and see,” she said when they all looked at her for answers, “But for the moment being the energy is behaving how it should.”\nLan Qiren felt for himself and let out a laugh that he hadn’t meant to when he felt that fragile, new energy molding itself into place, cradled in the spiritual energy they had funneled through him, that Wangji and Jiagn Wanyin were still funneling into him. \nWei Wuxian slept for three days while the rest took turns feeding him spiritual energy to heal where he’d been cut open and stabilize the new core. They all checked his core excessively, terrified that it was going to dissipate. Wangji in particular seemed obsessed with making sure the core stayed where it should be, and Lan Qiren couldn’t blame him. It would be devastating for all of them if Wei Wuxian woke to find that the procedure had been unsuccessful. \nWhen Wei Wuxian did wake up, groggy and disoriented at first, he sat up, let Wangji coax him into drinking some water. It took a few moments for him to remember why he was in the infirmary, and when he did, his hand dropped to hover over where his new core lay. He trembled as he felt out his new energy, and Lan Qiren turned to give him privacy when tears started dripping down his cheeks. \n“I thought I’d never feel this again.”\nThree weeks after a successful procedure, Wei Wuxian was getting used to his new core with the help of daily spiritual energy transferrals and training that he grumbled about even though it was obvious that he was excited to be back at it. \nHe had joined in with a class of younger junior disciples, half teaching and half training along with them. He practiced long hours to the point of exhaustion, only stopping when Wangji made him. When Lan Qiren had asked, Wei Wuxian had told him that he was training so hard so he could ride his own sword to his nephew’s one month celebration. \nLan Qiren was happy to get back to work, though he would admit that sometimes he had trouble concentrating without the familiar noise of Wei Wuxian fidgeting across from him, though, of course he’d never let Wei Wuxian know that. \nLately, Xichen had been in correspondence with Sect Leader Nie regarding the untruths that Jin Guangshan had told. The Lan Sect, along with the Nie and the Jiang, were preparing to confront him on his deception and other of the man’s plots that had come to light. Jin Guangyao, either out of loyalty to Xichen or, more likely, sensing the shift in power from his father to the other Sects, had revealed the plots Jin Guangshan had to gain control of Wei Wuxian’s seal. This, of course, hadn't set well with any of them, and they were all in agreement about the fact that they could no longer stand by and let Jin Guangshan become another Wen Ruohan. \nThe Wen settlement at the base of the mountain was almost completely built, the hard working Wen, along with Xichen and Wangji and Wei Wuxian when he could be pulled from training, had worked until the settlement looked less like a camp and more like a home. They’d even started planting things to take to Caiyi and sell. \nWei Wuxian split his time between the Wen settlement and the Jingshi where Lan Qiren refused to step foot in lest he catch sight of something he would prefer not to. His one glimpse in the library had been enough for a full lifetime. \nWei Wuxian had been antsy for a few days. He was often antsy, but this particular brand of unsettled came with many blushing cheeks and unsubtle, nervous glances to Lan Qiren. It was obvious that Wei Wuxian was gearing up to get Lan Qiren’s approval to marry Wangji, but it seemed that he had yet to find the bravery for it. \nOf course, his courage was gathered at the least expected moment. \nLan Qiren’s morning meditation was interrupted by the sudden, horrifying sound of his guqin being knocked to the floor. \n“Sorry,” Wei Wuxian called out, startling him almost as badly as the twang of his instrument hitting the ground. \nLan Qiren kept his eyes closed for he feared that, should he open them and see the damage Wei Wuxian had done, he might suffer a deviation not only of his qi but also of his sanity. How could he ever face Wangji again if he cut Wei Wuxian down for disturbing him before the cock had even crowed? \n“Master?” Wei Wuxian said after the sounds of him righting all that he’d disturbed finished. “I have a question.”\nOnly then did Lan Qiren open his eyes to find Wei Wuxian sitting across the table from him in the most put-together state he’d ever seen him. His Lan robes were crisp and unwrinkled, unstained with either ink or the bright red Wei Wuxian insisted sneaking into every bite he took. His face and hands were clean, and his hair, instead of its usual haphazard fray, was pulled back in a manner not unlike Wangji’s, tied back neatly with his red ribbon, not a single strand out of place. \nLan Qiren felt resignation and satisfaction in equal measure when he realized that there was only one reason that Wei Wuxian would approach him so early in such a state. He could tell that Wei Wuxian saw the realization in his eyes because the boy straightened his posture past the point where it was likely comfortable and pleaded with his eyes so desperately that Lan Qiren could almost hear his exhortations as clearly as if he’d spoken them. \n“What will you do if I say no?” He asked before Wei Wuxian could speak, moving to set him a cup at the table. \nHe poured tea that he knew the boy despised, wanting to see if he’d drink it just to placate him. Wei Wuxian didn’t even make his normal twisted overexaggerated face of disgust when he took a sip, which, admittedly, did earn him some favor. Not enough for Lan Qiren to grant his request without at least a little bit of strain, but enough that he wouldn’t dismiss him out of hand. \n“I’d ask again,” Wei Wuxian said firmly. \n“And if I say no then?”\nLan Qiren thought suddenly of Cangse Sanren. He didn’t miss her, they hadn’t been close enough for that, but in this moment, he was grieved that she hadn’t lived to see her son like this, happy, in love, petitioning to court Lan Qiren’s own nephew. He wondered if she’d be amused that her son was planning on being a disturbance in the Lan Sect for the rest of his life or horrified that he’d picked a fuddy-duddy Lan to be his cultivation partner.\n“Pardon my impertinence, master,” Wei Wuxian said before bowing reverently. Lan Qiren suspected that the formality was more to hide his grin than any deference towards him. “But I am afraid that I don’t quite have the strength to resist Lan Zhan if he suggests we elope to escape any permission that isn’t given.”\nLan Qiren didn’t doubt that his stubborn nephew would steal Wei Wuxian away the moment his permission was withheld. As much as he’d always hoped Wangji would be as level headed as everyone seemed to think he was, Wangji was unpredictable in the most predictable way. \nWhen Wei Wuxian looked up there was indeed a grin staining his face. \n“Also, I’m certain that I love your nephew far more than you dislike me, so I’m sure my persistence would overcome any stubbornness on your part.”\nBefore Lan Qiren could even narrow his eyes, Wei Wuxian amended himself. \n“Forgive me, not stubbornness. Being unreasonably obstinate is against rule 127.” His grin was still as frustrating as it was when he was a student, so when had it become endearing? “My persistence would withstand any misgivings you had about my worth as a suitor for your precious younger nephew.” \nLan Qiren couldn’t even protest without perjuring himself. He didn’t often curse the rules, but Wei Wuxian knew how to use them exactly to his advantage. Lan Qiren didn’t know whether to feel proud or exasperated. \n“Well, seeing as my options are allow you to court Wangji or explain to the Elders that you have eloped, I suppose that I must, under duress,” he stressed, though he was fighting a smile, “allow this.”\nSurprisingly, Wei Wuxian didn’t cheer, but he did bow respectfully, his lowered head not hiding the bright smile on his lips. \n“Thank you master,” he said before he let out a little giggle, unable to contain himself. \nLan Qiren took a sip of his own tea.\n“Of course, you know this means that you two must separate until you’re married. It’s improper.”\nWei Wuxian laughed. \n“Don’t worry about it Uncle,” he said, with that grin that made Lan Qiren wish he was in secluded meditation. “I’ve already deflowered Lan Zhan, so there’s no more virtue to protect.”\nWei Wuxian dodged the first teacup thrown his way, but not the second. \n“Get out of here you scoundrel!” \nWith him scrambling out the door with a giddy laugh, Lan Qiren allowed himself a smile."
}