{
    "id": "27105805",
    "url": "https://archiveofourown.org/works/27105805?view_full_work=true",
    "author": [
        "mahadevi"
    ],
    "title": "Straight From The Horse's Dumb Fucking Mouth",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "F/F",
        "M/M"
    ],
    "fandoms": [
        "呪術廻戦 | Jujutsu Kaisen (Manga)",
        "呪術廻戦 | Jujutsu Kaisen (Anime)"
    ],
    "relationships": [
        "Kugisaki Nobara/Zenin Maki",
        "Fushiguro Megumi/Itadori Yuuji",
        "Fushiguro Megumi & Itadori Yuuji & Kugisaki Nobara"
    ],
    "characters": [
        "Kugisaki Nobara",
        "Fushiguro Megumi",
        "Itadori Yuuji",
        "Zenin Maki",
        "Panda (Jujutsu Kaisen)",
        "Ieiri Shoko",
        "Inumaki Toge",
        "Todo Aoi",
        "Zenin Mai",
        "Gojo Satoru"
    ],
    "additional_tags": [
        "Miscommunication",
        "Misunderstandings",
        "Idiot Kids In Idiot Love",
        "Humour",
        "Fluff and Crack",
        "Gojou Ruins Everything"
    ],
    "language": "English",
    "series": "",
    "published": "2020-10-19",
    "completed": null,
    "words": "5,062",
    "chapters": "1/1",
    "comments": "162",
    "kudos": "12,048",
    "bookmarks": "1,747",
    "hits": "84,036",
    "summary": "<p>Nobara and Yuuji are dating. Nobara was not informed of this.</p>",
    "notes": "<p>there's no significant plot spoilers but this is set after the events of the goodwill arc aka abt where the 1st season of the anime will most likely end!!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>please save nobara she deals with so much</p>\n<p>this was so much fun to write!! i really wanted to write more of the characters and well, here we are !!</p>\n<p> </p>\n<p> <a href=\"https://twitter.com/KAMONORITOSHI\" rel=\"nofollow\">my twitter </a>and <a href=\"https://mahoragas.tumblr.com/\" rel=\"nofollow\">tumblr</a></p>",
    "text": "“Congrats, by the way.” Megumi says offhandedly over breakfast one morning, not quite making eye contact as he pokes at his eggs with an uncharacteristic level of stiffness. It makes Nobara freeze in place, cup of coffee pressed against her lips, eyes narrowing over the rim to stare him down suspiciously.\n“For what.” She says, with no small amount of trepidation. Megumi clears his throat, resolutely not looking up.\n“Y’know.” He coughs. “You and Itadori.”\n“Right.” Nobara nods, returning to her coffee, only really processing Megumi’s words when she’s got a sizeable mouthful. She chokes on a wheeze and spews it everywhere, gagging around her every breath, batting away the fistful of napkins Megumi offers her, choosing instead to conserve her energy to shriek, at the top of her lungs, “What?”\nMegumi grabs her wrist and stuffs the napkin into her grip, grabbing his own handful to start mopping at the puddle on the table. “I don’t know why you’re so surprised.” He says, matter of fact, that strange bit of strain still grating every word that leaves his mouth. Nobara would probably take note of that if she wasn’t trying to fight off death’s cold coffee-scented embrace. “Someone was bound to notice with everything he’s been doing for your two month anniversary.”\n“Hrghf?” She says intelligently. Megumi keeps slapping the napkin in the pool of coffee, even though it’s soaked through and just making a bigger mess.\n“Everyone knows.” His voice is quiet and firm, and for a moment he stands there, staring into the stagnating pool of coffee. “Everyone.”\nHe puts the napkin on the table and picks up his half-finished meal and storms off to the kitchen looking like he’s going to use a plate of runny eggs to commit a murder. Nobara finally gets some air back in her lungs and wheezes out, desperate and confused and concerned, “who the fuck told you this?”\n“Panda-senpai.” Megumi replies, more clipped and curt than he normally is. He disappears into the kitchen. There’s the sound of plastic rustling, the sink running, and then he’s storming back out, right back to his room, saying, “I’m going now.”\n“Have fun.” Nobara replies faintly. The only response she gets is the firm slam of the door. And there she sits, alone in the dining room, soaked in now-cold coffee, left to ponder whether or not she’s slipped into an alternate reality where her standards dipped so low to the point where she’d date Itadori fucking Yuuji. Maybe this is just some horrible nightmare that happens to be incredibly realistic. Maybe the sensation of being covered in coffee is just a sign that she pissed the bed.\nShe pinches herself. Ow. Cool, not a dream or a nightmare. No bed wetting yet. She’s still holding out for the parallel dimension thing, because at least if she somehow ended up in a bad timeline, it wouldn’t be her mess to deal with.\nShe’s often found that life isn’t so kind. Nobara lets out a deep and soulful groan, dropping her head to the table and forgetting that it’s covered in coffee. Great. Just her fucking luck.\n¿?\nPanda’s in the sparring room, sitting in what Nobara assumes to be his version of criss-cross applesauce, his hands(paws?) folded neatly in his lap. His eyes are closed, his breathing deep and purposeful, the literal image of zen, if zen just so happened to be a panda. Nobara frowns, shifting in place. She really doesn’t want to disturb him, partly because she doesn’t want to be a dick but mostly because Panda can be pretty scary at times and she’s not in the mood to get flung across the room.\nHowever. This is a crisis of the highest degree. Fear has no place in a mission as important as this one.\n“Panda-senpai?” She asks hesitantly, edging a little ways into the room. He doesn’t even twitch, resolutely remaining in place. She raises her voice, trying again. “Excuse me, Panda-senpai?”\nNot so much as even a stutter in his breath. Nobara blinks. Damn, he must be really into it. The guilt grows, just a little, but desperate times call for desperate measures. She takes a deep breath, squares her shoulders and says, loud and clear, “Panda-senpai!”\nPanda shifts. Nobara freezes in place, feeling the very distinct and horrible feeling of fucking up in an incredible way. She waits with baited breath as a moment passes, and then another, and then—\nSNNNNZZZRRRK. It’s a noise so loud it seems to rattle the very foundation of the building, deafening in its volume and ferocious in its intensity. Nobara flinches, clapping her hands over her ears, and it’s only when the high-pitched ringing in her ears has subsided that Nobara realizes that the noise wasn’t the sound of a portal to hell opening beneath the school building, but instead Panda’s snoring.\nNobara’s jaw drops. “Are you fucking kidding me?” She shrieks in dismay before charging forwards and round housing kicking Panda in the side. He jolts awake with a yelp, head swivelling wildly, quickly identifying his assailant mostly thanks to the fact that she kicks him again.\n“Ow, hey, what the fuck Nobara-chan!?” He shouts, tucking his knees in and doing his adorable little panda roll away from her. Most of the time she stops and coos over him whenever he does that. This time she pulls out her nails and hammer and lifts them threateningly. Panda immediately lifts his paws(hands?) in surrender. “Okay, okay! I’m sorry!”\n“You better be!” She snaps, drawing herself up to her full one hundred and sixty centimetres, looming over his cowering form on the floor. “Why the fuck did you tell Fushiguro that I’m dating Itadori?”\nHe pauses, brightening for a moment. “Oh yeah, congrats about that by the way!” He says brightly. Nobara lifts her hammer again. He returns to his cowering. “I’m also sorry! For spreading the news!”\n“For spreading fake news.” Nobara corrects him darkly.\nPanda blinks. “Oh. Really?”\n“Yeah.”\n“Y’know, that checks out.” He muses thoughtfully. “I never thought you guys were into each other and I was kinda weirded out when Shoko-sensei told me but then I was like y’know, I gotta support the homies—“\n“Wait.” Nobara’s jaw drops. \"Shoko-sensei told you that we’re dating?”\n“Yeah.”\n“Like, big mama MILF Shoko-sensei?”\n“Big what?”\n“Never mind!” Nobara squeaks. There is. So much happening. She starts backing out of the room, mind racing a mile a minute. “Just. Don’t tell anyone else. At all. I have to go.”\nPanda lifts one of his hand-paw-things and waves. “Okay!” He says, much too put together for just having been held hostage. “See you later!”\n“Watch your fucking back Panda-senpai!” Nobara shouts back, because she’s got a reputation to maintain god damn it.\n¿?\n“Oh, Nobara.” Shoko says pleasantly, elbow deep in what looks like a human body. Maybe. It’s quite mangled, so Nobara’s not quite sure. Shoko’s smile is serene, one hand emerging from the body with a squelch to wave at Nobara. She’s holding a very large knife.\n“Hi sensei.” Nobara waves back, albeit a little faintly. Listen. She’s a sorcerer. Dealt with curses her whole life. Lives with two stinky boys. She’s not some weak little bitch. But there is an absurd amount of blood on the table and on Shoko’s jacket and on… everything. Really.\n“If you need anything I’m a little occupied at the moment.” Shoko says, gesturing at the body like Nobara might have happened to miss it, somehow. “But there’s Tylenol and cough drops in the top drawer.”\n“No I’ll be—“ Nobara starts, stopping when she realizes that there is, in fact the beginnings of a headache behind her eyes. She’s got the shitty feeling that it’s not going away any time soon. “Y’know what, thanks sensei.”\n“Anytime.” Shoko turns back to the body. What’s left of it, anyways. Nobara shuffles over to the cabinet, tugging open the top drawer. There’s lemon cough drops, a half open bottle of TUMS, what appears to be a human hand floating in a light green liquid, and a vape pen. No Tylenol. Nobara sighs and closes the drawer.\n“Uh, sensei?” She starts, tentatively. Shoko hums her reply. “Um. So, Panda-senpai told me something kinda weird…”\n“It was perfectly legal at the time.” Shoko replies tersely. There’s a sickening squelch from the body.\nNobara blinks. “What? What was legal?”\nShoko turns and blinks back. “Oh, so it wasn’t about the Yokohama thing?” She asks, tilting her head.\nNobara feels distinctly like she’s having a fucking stroke. “What? What Yokohama thing? No I’m talking about him thinking that Itadori and I were dating.”\n“Oh.” Shoko says, and then whispers what sounds suspiciously like “thank fucking God.”\n“So uh.” Nobara wets her lips. “We’re not? Dating?”\n“Yes, I figured.” Shoko laughs, shaking her head. “It wasn’t like I told Panda that you were dating, I told him that I heard you two were dating.”\nNobara sighs. Finally, she’s getting somewhere. “Who’d you hear it from?” She asks, as innocently as possible.\nShoko smiles at her, all too knowing. “Inumaki-kun.” She says sweetly.\nNobara blinks. “No way.”\n“I did.”\n“Sensei, please.”\nShoko shrugs. “I’ve given you all the information I can offer.” She turns back to the body on the table. “Now, if that’s all you needed from me—“ She shoves her hand back in. The body starts fucking screaming.\nNobara stumbles away. “Yes that’ll be all thank you!” She shrieks, running out the door at a full tilt, leaving the fucking horror movie behind her.\n¿?\nIt takes Nobara the better part of an hour to track down Inumaki, mostly because he was sitting on the roof the entire time. She can’t really be mad at him for it cause. Well, it’s Inumaki. Just the sight of him, cross legged with a box of pocky and a juice box on the ground in front of him, pensively staring out at the horizon as he methodically unwraps his snack— it's enough to make her pause, enough to quell her frantic frenzy just the slightest. \nNobara clears her throat. “Inumaki-senpai?” She calls. His gaze snaps to her, eyes brightening with recognition.\n“Salmon!” He replies brightly, waving her over and patting the spot on the ground next to him. Nobara can’t help but grin back, dusting off the spot he clears and folding her legs beneath her to sit next to him. He tilts his head, offering one pocky to her. “Salmon?”\n“No thanks Senpai?” She replies. He shrugs, popping it into his mouth. They sit in silence for a moment, staring out at the treetops together.\n“Leaf mustard?” He asks, nudging her slightly.\n“Yeah, I’m good.” She replies. He blinks at her, pocky still hanging between his lips, before bringing both hands up to make a heart. He traces little curves in the space just under his eyes, pointing at her again. “Are you asking if me and Itadori are dating?”\n“Salmon.”\nNobara sighs. “We’re not.” She grumbles. She can’t yell at Inumaki cause it’s morally equivalent to punching a kitten. Inumaki hums, crunching on the pocky a little more. “Inumaki-senpai, where’d you hear that we were dating?”\nInuamki blinks at her. He holds up two fingers. “Hold on, are we doing charades right now?” Nobara asks, mostly joking.\n“Salmon.” Inumaki replies, looking deadly serious.\nNobara is frankly floored. “All right. So, two syllables?” She guesses. Inumaki gives a thumbs up. He puts one hand behind his head in a fist, twisting his face into a scowl. “Are you pretending to be them?”\n“Salmon.”\n“Uh, okay, um…” Nobara frowns, and then, very hesitantly says, “is it… Maki-senpai?”\nInumaki bends over and shakes with silent laughter for two whole minutes, ignoring Nobara’s desperate pleas for him to never tell Maki-senpai she said that please Inumaki-senpai spare her for the love of God.\nEventually he calms down, wiping away tears from his eyes with the palm of his hand. He points to his left eye, drawing a triangle over it, one edge running along the path of his hairline and one point ending somewhere in the middle of his cheek. He traces its path again.\nNobara squints. “Is that a scar?” She asks, cheering when Inumaki gives her a double thumbs up. The joy quickly dissipates when the realization sets in. “Wait, you’re telling me fucking Todo told you that me and Itadori were dating?”\n“Salmon.” Inumaki nods, miming the act of texting. Nobara stares at him.\n“Why do you have Aoi Todo’s phone number?”\n“Tuna mayo.”\n“What does that mean!?”\n¿?\nHey Todo. &lt;&lt;\nSenpai. &lt;&lt;\nMan I really don’t wanna call you senpai &lt;&lt;\n \n&gt;&gt; WHO IS THIS\n&gt;&gt; WHO DID YOU GET MY INFORMATION\njesus fucking christ &lt;&lt;\nit’s kugisaki. from tokyo. &lt;&lt;\n \n&gt;&gt; AH KUGISAKI MY FRIEND\ndelete my number after this conversation I swear to fucking god &lt;&lt;\nalso can you quit it with the all caps &lt;&lt;\n \n&gt;&gt; I CANNOT FIGURE OUT HOW\nof course &lt;&lt;\n&gt;&gt; WHAT CAN I DO FOR YOU KUGISAKI?\nokay im gonna cut to the chase &lt;&lt;\ndid you tell inumaki-senpai that me and itadori were dating?? &lt;&lt;\n \n&gt;&gt; I DID\n&gt;&gt; I WANTED TO CELEBRATE YOUR UNION\nokay well we’re not so thanks for that &lt;&lt;\nalso why would you say it like that &lt;&lt;\n \n&gt;&gt; MY BROTHER IS A MAN OF HONOUR!\nthat doesn’t make any sense &lt;&lt;\n&gt;&gt; LOVE VERY OFTEN DOES\nWE’RE NOT IN LOVE FFS &lt;&lt;\nWHO EVEN TOLD YOU THAT WE’RE DATING &lt;&lt;\n&gt;&gt; THERE’S NO NEED TO BE SHY KUGISAKI\n&gt;&gt; LOVE IS SOMETHING BEAUTIFUL\n&gt;&gt; AND WHILE YOU MAY NOT FIT MY BROTHER’S IDEAL TYPE\n&gt;&gt; IT MUST BE CELEBRATED!!\nwe’re not dating &lt;&lt;\nwait &lt;&lt;\nwhat is itadori’s ideal type &lt;&lt;\n \n&gt;&gt; HE LIKES TALL AND VOLUPTUOUS WOMEN, WHO HAVE BEEN GIFTED WITH A ROUND DERRIERE\nitadori’s an ass man??? &lt;&lt;\nhuh &lt;&lt;\nwait didn’t you just say that i’m short and that I have a flat ass?? &lt;&lt;\n \n&gt;&gt; I MEANT NO OFFENSE\nI’m going to fucking kill you todo &lt;&lt;\ngod you’re distracting me!! &lt;&lt;\nwhere’d you even hear this shit from &lt;&lt;\n&gt;&gt; WHY I HEASDRFSDKJFBFGFK\nhello?? &lt;&lt;\ntodo ???? &lt;&lt;\ndid you fucking die &lt;&lt;\n&gt;&gt; unfortunately he’s still alive\nwho is this?? &lt;&lt;\n&gt;&gt; it’s mai zenin\noh &lt;&lt;\nwhat the fuck &lt;&lt;\nwhy are you here &lt;&lt;\n \n&gt;&gt; mostly cause todo was being annoying\n&gt;&gt; and I need him to shut the fuck up\n&gt;&gt; but then I saw that he was texting the bitch who broke my sister’s heart\nwhat &lt;&lt;\nwait WHAT &lt;&lt;\n&gt;&gt; yeah, she texted me crying cause the girl she liked so much ended up dating the shitty little cursed twerp and I off-handedly mentioned that I was going to kill for it and this fucking oaf decided to go spreading the news\nyou told todo? &lt;&lt;\nmaki-san told you?? &lt;&lt;\nMAKI-SAN LIKES ME??? &lt;&lt;\n&gt;&gt; that’s what I just said\nholy shit I have to go &lt;&lt;\n&gt;&gt; you better fix this or I’ll rip your teeth out\nfuck you too Mai &lt;&lt;\nthank you though &lt;&lt;\n&gt;&gt; tch\nyou seriously did not just &lt;&lt;\n‘tch’ &lt;&lt;\nme over text &lt;&lt;\n&gt;&gt; MY APOLOGIES KUGISAKI\n&gt;&gt; I WAS SUDDENLY ACCOSTED\ndude. &lt;&lt;\n¿?\nThe path to Maki’s room is one Nobara’s walked a thousand times. Dragging Panda to her door to rat him out for being weird, begging for help with the impossible math homework Gojou likes to inflict on them, simply heading over for movies and popcorn and conversations. She’s familiar with it, but this time, for some reason, every step she takes is laden with dread. Her heart sits high in her throat. Her hands are slick with sweat.\nShe knocks on the door, three times, neat and sharp. She waits, her mouth dry, her hands shaking.\nMaki opens the door. She looks awful. Deep bags beneath her eyes, skin pale and hair tangled. She’s wearing a too big black sweater that she seems to be trying to melt into. She looks at Nobara and something awful twists her face. “Ah.” She says, sounding absolutely exhausted. “Nobara.”\n“I’m not dating Itadori.” Nobara blurts. She feels her face heat. “Maki-san—“\nMaki offers her a smile, weary and worn. “It’s okay Nobara.” She says, all too gently. “You don’t have to lie.”\n“I’m not lying!” Nobara is going to burn this fucking building to the ground, and then kill Itadori with her own two hands this time. “Maki-san, I don’t even have a crush on him, we’re not dating we never were dating, I’d rather eat my own shit than date him—“\n“I’m happy for you.” Maki-san lies, like a lying liar. Nobara feels like she’s going fucking crazy. “Really Nobara, you deserve—“\nThankfully, Maki stops talking then, but mostly because Nobara grabs the front of her hoodie and pulls her down into a kiss. Her eyes screwed shut, her knuckles white around the fabric, her heart beating in her ears, Nobara tries to push every single bit of reason that Maki refuses to hear through her lips. Tries to make her understand.\nNobara pulls away. God, she probably looks like a fucking tomato. Maki looks stunning, red flush high on her cheeks, lips parted and shiny. She brings one hand up, touching them, looking somewhat dazed. “You…” She starts, trailing off, someone blushing harder.\n“Maki-san.” Nobara says fiercely. “I like you so fucking much. I have big dumb sapphic feelings for you. Itadori is stinky and stupid and he fucking eats fingers. No way in hell am I putting my lips anywhere his mouth.”\nMaki stares at her dumbly for a moment, and then another. The air between them is thick and still. Nobara’s heart pounds somewhere in her throat. Her ears somehow grow even warmer. She adds, just to be careful, “sorry I did that without your permission by the way.”\nMaki’s eyes crinkle in the corners and she leans her head against the doorframe and closes her eyes and laughs. Bright and high and happy, like windchimes and dewdrops and the smell of fresh crepes and macaroons. “Good lord.” She gasps. She pulls Nobara in, nestling her cheek on the crown of Nobara’s head. Nobara closes her eyes, breathing in the scent of Maki all around her. “What a mess this all is.”\nNobara whines, weakly hitting her shoulder. “I did nothing wrong!” She protests, giggling through her words, feeling almost giddy when she hears Maki’s laughter start again. “If there wasn’t a stupid rumour mill going round that my standards were low enough to date Itadori then we wouldn’t be in this mess! I still need to know who told you this shit!”\n“Oh I’ll tell you.” Maki says. Delight rings clear in every syllable. She steps back, bringing one hand down to Nobara’s waist, smile brightening at the sound of Nobara’s squeak of surprise. “But first I wanna just…”\nShe pulls Nobara through the door. It clicks shut behind them.\nIt doesn’t open again for a very long time.\n¿?\nNobara’s pretty close to blowing a fucking gasket upon hearing the identity of Maki’s informant, and is pretty sure the only reason she doesn’t completely lose her shit is because Maki’s hand is really soft and running gently through her hair and it feels. Really nice. She’s not even that mad when she has to leave, getting a few goodbye kisses at the door, practically skipping down the halls of the building. Her good mood quickly evaporates at the sight of her culprit, lounging on the sofa with an obscenely large latte like he’s king of the fucking castle. Which he kind of is. Doesn’t stop it from being annoying though.\n“Gojou-sensei.” Nobara says with the utmost severity. She strides into the room, arms crossed, chin high. “I need to talk to you.”\n“Ah, the other half of the happy couple!” He greets cheerfully. She’s certain his bright blue eyes are sparkling under that stupid blindfold of his. “What can I do for you, Kugisaki?”\n“I’m not dating Itadori.” Nobara grinds out through gritted teeth. “And I want to know where you heard something as stupid as that.”\n“You’re not?” Gojou asks with a tilt of his head. It’s just shy of genuine shock, which means that bastard knew and still told Maki, the fucking prick. “Well that’s a surprise. My source was quite reliable, after all.”\n“And who is said source.” Nobara slams her hand on the arm of the sofa. It’s not that effective, considering it’s fabric and doesn’t make a lot of noise.\nGojou smiles at her serenely. “Why, I heard it straight from the horse’s mouth!”\nNobara stares at him. “What.”\n“I caught him shopping for your anniversary present.” His smile goes sharp in the corners. “Really sweet of him, he’s definitely a keeper.”\n\n”WHAT.”\n\n¿?\n“ITADORI FUCKING YUUJI.” Nobara shouts, kicking down the door to his room. The culprit in question shouts, falling off his bed, looking up at her from the floor. His eyes grow wide.\n“Oh shit.” He mutters, scrambling to his feet.\n“Yeah, no fucking kidding, I’m gonna fucking kill you.” Nobara seethes, storming forwards, slamming a fist down on the top of his head.\n“I didn’t mean to!” He cries, ducking out of the way of her next swing. “Honest, it just slipped out, it was a mistake!”\n“How do you accidentally tell Gojou-sensei that I’m your girlfriend!” She roars, lunging for him. He yelps and dives out of the way. “What the fuck is wrong with you?”\n“I needed to tell him something!” Yuuji shouts back. “He started asking questions about what I bought, and I just panicked—“\n“And said that we’re dating?” Nobara stares at him incredulously. “How does that explain anything? What the fuck were you even buying?”\nYuuji blanches, avoids her gaze, ducks his head to the floor. He mumbles something, low and quick and quiet. Nobara frowns. “What was that?”\nHe mumbles again. Nobara groans, massaging the bridge of her nose. “Seriously, Itadori, I can’t fucking hear you—“\n“It was a skirt!” He snaps. He lifts his head. His eyes are bright, his face is burning. By his sides, his hands are clenched into fists, so tight Nobara wouldn’t be surprised if he opened them to show off his bleeding palms. He takes a deep breath, shaky and uncertain. “I wanted to buy a skirt.” He repeats, quieter this time.\nNobara feels like she’s been slapped in the face. “Itadori—“\n“They just, look so pretty.” He’s saying, quiet and miserable Nobara didn’t even know he could ever look this uncertain, look this scared. “And there was one in this store that I couldn’t stop looking at, but I couldn’t try it on there were so many people so I just bought one and I was going to wear it at home but that was when Gojou-sensei was looking for me to get us back on the train and he saw me buy it and I had to say something—“\nThe bone-crushing hug she yanks him into is less of a conscious thought and more of a primal impulse, an instinctual reaction to the sight of the fat tears leaking out from the corners of Yuuji’s eyes. Yuuji reacts to her touch with a full body shudder before his hands latch onto her shoulders and he curls over her frame, trembling like she’s the only tether to earth that he has. “it’s okay.” Nobara says, her own voice thick and shaking. She can’t really reach his hair so she runs her hand along his back in soothing motions, letting him press sobs into her shoulder. “I understand now, it’s okay.”\n“I shouldn’t have used you either.” He sniffles. “I didn’t have to say it was you, I could’ve made up a name, or said it was secret.”\n“No, Itadori—” Nobara starts, and then stops, and then sighs. “Yeah, you probably should’ve done that instead.” Yuuji chokes out a little laugh. She gets on her tip-toes, reaching up to noogie him as best as she can, evidently successful based on his offended little squawk. “You could’ve also told Gojou-sensei the truth, and let me kick his ass if he made fun of you.”\n“He’s the strongest sorcerer in the world.”\n“Doesn’t mean he’s immune to an ass kicking.” Nobara mutters. Yuuji laughs, stepping back. His eyes are red and his smile is bright and wobbly. She pats his arm, the motion just as clumsy as her words when she says, “You good?”\nYuuji wrinkles his nose, sniffling, “Stop being nice to me, it’s weirding me out.”\n“All right, go fuck yourself.” Nobara fires back immediately. He laughs, gently and affectionately punching her arm. She smacks him back with all the force she can muster. Still affectionately though, even if Yuuji doesn’t seem to appreciate it. “I’m always this kind.”\n“Sure.” Yuuji says dubiously, laughing again and dodging her next swing. He rolls onto his bed, shifting over to let Nobara take a seat on the edge. They sit in silence for a moment, Nobara looking at the posters on the wall, Yuuji staring up at his ceiling. The silence is broken by the mattress creaking beneath him as he sits up and shuffles next to her. “By the way, how’d you even find out about this?”\nNobara sighs, rolling her eyes, elbowing him in the ribs.  Lightly, of course, because she’s being nice. “Itadori. Everyone thinks we’re dating.”\nHe stares at her dumbly. “Okay?”\nShe turns with a growl, grabbing his stupid face with both her hands and smacking his forehead with her own. She pinches his cheek when he blinks, forcing him to stare right into her unwavering glare. When I say everyone, I meaneveryone.” She hisses, low and purposeful. Yuuji blinks back at her.\nSomething hits the floor. The two of them spring into action, Yuuji jumping to his feet and shifting his weight, bending low, ready to pounce. Nobara lets her hammer slide out from her sleeve, bringing up two nails between her fingers. They turn to face the noise and are greeted with the sight of Megumi, grocery bags tipped over by his feet, contents spilling across the floor, his hands slack by his side. His dark eyes are blown wide, a deep pink high on his face. There’s something incredibly open there, but open in the way of shattered glass.\nNobara straightens, hands coming up. “Fushiguro—“\n“Sorry. I got— I’ll just—“ He stammers, stumbling back and out the door, not looking at either of them, not picking up the bags on the floor, seemingly not aware of the tears that well in his eyes and carve lines through the open heartbreak on his face. The door slams shut behind him, its finality echoing through every inch of the room.\nYuuji turns to look at her, eyes wide, something akin to horror spread across his face. “Everyone?” He asks, high and panicked.\nNobara buries her face in her palms and wonder when her life of sorcery and curses devolved into a B-List romcom. “Yes you fucking moron.” She sighs, more exhausted than she ever thought she could be.\n“Oh my god. Fushiguro thinks we’re dating. Oh my fucking God everyone thinks we’re dating.” Yuuji babbles, voice pitching higher and higher as the reality of this miserable miscommunication hits him harder and harder. “Oh my fucking god.”\n“Yeah you dipshit, your crush thinks you’re dating someone else.” Nobara groans into her palms. “So how are we going to fix this.\nShe feels him freeze next to her. “How’d you know I have a crush on him?” He asks, bewildered.\n“Itadori, I swear to God.”\n“Right! Sorry, focusing.”\n¿?\nMegumi comes to breakfast the next morning looking downright miserable. There are deep bags beneath his red eyes, his normally messy hair looks downright disastrous. There’s a bone deep exhaustion radiating from every single part of him. He avoids eye-contact with Nobara, not even grunting out a greeting, stumbling to the kitchen like a dead man walking.\nNobara watches him, quietly sipping her coffee.\nShe waits until he’s returned with his plate, collapsing into the chair across from her and half heartedly picking at his food. “Good morning, Fushiguro.” She says sweetly. Megumi grunts. “You know, if you had waited just a little longer yesterday—“\n“Please don’t Kugisaki.” Megumi says. His voice is rough with emotion. “Please. I’ll… I’ll get over this, okay? Please just. Don’t.”\nNobara blinks, shrugging. “Okay.” She says, and pulls out her phone.\nThey sit in silence, Megumi mechanically working his way through his plate, Nobara tapping away at her phone. He’s wound tight with tension. Nobara rolls her neck and lets it crack into the air.\nMegumi winces at the sound, freezing then sighing. He puts down his chopsticks. “Kugisaki—“\n“Oh hey guys!” Maki brightly says, sweeping into the first year kitchens with a broad smile on her face. She nods at Megumi, and then bends down, pressing a kiss to Nobara’s lips. “Hey babe, ready for our date today?”\nNobara grins up at her. Out of the corner of her eye, she can see Megumi’s dumbstruck expression in its full, stunned, stupid glory. “You bet!” She smiles back, leaning up and kissing Maki again. She turns as she stands, waving at Megumi. “See you later Fushiguro!”\nShe’s halfway out the door when she hears Yuuji’s voice, somehow uncertain and nervous but still bright and firm. He calls out Megumi’s name, the each syllable quieter than the last. She rolls her eyes. She told him to be confident about it, to assert himself and stride forwards with confidence. Then again, it was hard enough to get him to agree to this plan at all. She already had to concede to letting him pick out the rest of his outfit.\nShe wonders how the scene looks, behind her. Fushiguro hasn’t gotten up yet, there was no sound of chair scraping against the floor or his distinct heavy footsteps. Is he staring at her back or has he turned to face Yuuji? Are his hands slack by his sides or have them been brought up to run through his hair like he always does when he’s nervous? She saw the skirt Yuuji bought, a hideous pleated hot pink and lime green checkered monstrosity that falls right to the centre of his thighs. God, she hopes that he didn’t pair it with his yellow hoodie. She’s almost certain that she did.\nA few feet ahead of her, Maki turns around, meeting Nobara’s gaze with eyes that are warm and sparkling. “Everything good?” She asks, a smile playing at her lips.\nNobara beams back. “Oh yeah.” She replies, grabbing the handle of the door on her way out and closing it quietly behind her."
}