{
    "id": "27292294",
    "url": "https://archiveofourown.org/works/27292294?view_full_work=true",
    "author": [
        "mahadevi"
    ],
    "title": "(apparently, dramatically, convincingly) You Could Kiss Me",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "呪術廻戦 | Jujutsu Kaisen (Manga)",
        "呪術廻戦 | Jujutsu Kaisen (Anime)"
    ],
    "relationships": [
        "Fushiguro Megumi/Itadori Yuuji",
        "Fushiguro Megumi & Itadori Yuuji & Kugisaki Nobara",
        "Fushiguro Megumi & Kugisaki Nobara",
        "Itadori Yuuji & Kugisaki Nobara"
    ],
    "characters": [
        "Fushiguro Megumi",
        "Itadori Yuuji",
        "Kugisaki Nobara"
    ],
    "additional_tags": [
        "Alternate Universe - College/University",
        "Alternate Universe - Roommates/Housemates",
        "Background NobaMaki",
        "Maki appears briefly",
        "Domestic Fluff",
        "Domestic Bliss",
        "Idiots in Love",
        "Fluff",
        "Humor",
        "Sickfic",
        "Non-Sexual Intimacy",
        "and they were roommates...",
        "Alternate Universe - No Powers"
    ],
    "language": "English",
    "series": "",
    "published": "2020-10-31",
    "completed": null,
    "words": "5,764",
    "chapters": "1/1",
    "comments": "134",
    "kudos": "9,632",
    "bookmarks": "1,723",
    "hits": "58,322",
    "summary": "<p>So now they’ve got this running bit, the three of them, where they pretend that Yuuji and Megumi are Nobara’s gay dads. Well, it’s more Yuuji’s running bit. Nobara finds it absolutely disgusting and cites it as her inevitable motive for their inevitable murder. Megumi would probably find it funnier if it wasn’t the catalyst for his current romantic crisis.</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a>.)</p>\n<p>title is from <a href=\"https://www.youtube.com/watch?v=yx97eKvZjaE\" rel=\"nofollow\">mates by mccafferty </a></p>\n<p>the dumbest fic idea became the most tender thing I've ever written why am I like this. shout out to chel for proof reading this instead of watching her lectures I love her so much please go check out her <a href=\"https://archiveofourown.org/users/chelfairy/pseuds/chelfairy/works?fandom_id=28410929\" rel=\"nofollow\">jujutsu kaisen fic</a> if you like things that make the hoes Ache and Yearn</p>",
    "text": "Megumi gets as far as kicking off his shoes and hanging up his jacket and calling out “I’m ho—“ before he’s immediately accosted in his own home. His greeting is cut off by a neatly manicured hand grabbing his face, dragging his gaze down a good couple of inches until he’s brushing noses with Nobara. She’s got a wild sort of panic in her eyes, a fire burning in them that sets off every single primal survival instinct in Megumi’s head, all of them screaming danger, danger!\n “How does my makeup look.” She growls, digging her nails into his cheek. Megumi blinks, squinting. He knows approximately fuck-all about makeup, but no matter how many times he tells Nobara that he’s useless at this, she still insists that he’s better than Yuuji at least in terms of attention to detail. He tries his best, noting the dark wings and the light pink shimmer and the powdered blush spotting her cheeks.\n “Um. Maybe a little more?” He suggests. Nobara grumbles, releasing him from her deadly clutches and storming back to her bedroom. Megumi feels the acute sense of relief that comes from surviving a bear attack, making an immediate beeline to the kitchen.\n “I told you already, you look gre— oh hey Megumi!” Yuuji grins from the stove. He catches sight of the look on Megumi’s face and bursts into laughter, doubling over the pan he continues to steadily stir through his wheezes.\n “Is she going to war or something?” Megumi asks, bafflement clear in his voice. It makes Yuuji laugh harder. His ears are flushed, his eyes crinkled in the corners. “Seriously, what’s up with her.”\n “She got a date with Maki-senpai.”\n “Oh shit.”\n “But not like, a date-date? Maki-senpai asked if she wanted to go try out a new cafe and when Nobara said yes Maki replied with ‘it’s a date!’ and nothing else. So.”\n “Oh shit.”\n “Yeah.” Yuuji says with another laugh, turning to face Megumi. He’s got a spoon in one hand, rice piled on top, his other hand cupped beneath it to catch any stray grains. “Open.” \n Megumi rolls his eyes but obliges. Yuuji pops the mouthful between his lips, watching his face intently. “It’s good.” Megumi says as he chews, moderately surprised. “What is it?”\n “Shrimp fried rice.” Yuuji licks his palm, dropping the spoon in the sink and turning around just in time to catch Megumi with a spoon of his own. “No. No you god damn animal, wait it’ll be done soon.”\n “But I’m hungry.” Megumi grumbles, inching towards the pan. He freezes when Yuuji picks up the towel on the counter, lifting it threateningly. “Just one bite, c’mon Yuuji.”\n “You won’t starve you big baby—“ Yuuji cuts himself off with a yelp, darting forwards and snapping the towel against Megumi’s arms as Megumi quickly snatches a spoonful of rice and stuffs it into his mouth. “God damn it Megumi!”\n “Sorry.” Megumi says around the rice.\n “No you’re not.” Yuuji sighs.\n “I’m not.” Megumi agrees. Yuuji elbows him. Megumi elbows him back. It’s like he can’t stop the smile from creeping up his face, not as bright as the grin that pokes dimples into the corners of Yuuji’s cheeks, but one just as fond and just as real. It’s a side effect of the apartment, of the roommates he just so happened to have, he thinks.\n A loud and prolonged groan startles them both, they jolt in tandem and inadvertently knock their heads together. Blinking through the pain, Megumi turns and meets Nobara’s eyes. She somehow looks entirely unimpressed and ready to fucking explode at the exact same time. “Homosexuals.” She says with the disdain of a Victorian noblewoman ready to punt an orphan across the road for touching her dress with grubby hands.\n “I’m bi!” Yuuji chirrups with the enthusiasm of a grubby little Victorian orphan grabbing a noblewoman’s dress to try and steal her purse.\n Nobara ignores him, which is something she’s gotten down to a science at this point. She gives a twirl. “Rate the fit.” Her tone is stand-offish and sour, but she’s worrying her lip between her teeth and digging her nails into her own arm.\n “You look nice.” Megumi says sincerely, because, well, she does. A white blouse tucked into a pink skirt with little black heels matching a black-knit cardigan. She’s got her hair in buns like she’s Sailor Moon. The words come out kinda flat and mean because he’s really, really bad at this sort of thing, but Nobara’s clearly lived with him long enough to get what he’s going for, because she gives him a thankful grin instead of a swift kick in the nuts. He’s rather glad, mostly because she really doesn’t hold back when doling out punishment and those heels of hers look like they could do some serious damage.\n “You look great!” Yuuji gives her two thumbs up and a big smile. “Seriously, Maki-senpai won’t know what hit her.”\n Nobara sags with relief, stumbling over to their breakfast bar and hopping up onto one of the stools. “It took me forever to pick a skirt.” She groans, resting her head on the counter. She’s there for barely a moment before her head snaps up, shimmery eyes blown wide with horror. “What if I’m overdressed.” She whispers.\n “Compared to Maki? You probably will be.” Megumi offers. Yuuji glares at him and unsubtly tries to smack him on the back of the head. “Ow, let me explain damn it. As far as I can remember Maki has trashed every skirt someone has tried to make her wear. She only owns joggers and jeans and maybe a nice pair of slacks. Emphasis on maybe.” Megumi trails off, coughing, looking away. “So. Yeah. Don’t worry about it.”\n “You’re so awkward it physically hurts me.” Nobara sighs, but there’s something in her tone that makes Megumi look back. Confidence and comfort fills the arches and lines of her face, settling into their familiar grooves. She straightens, slapping herself lightly on the cheek, clambering off of the stool. “Okay! I’ve got this.”\n Megumi feels the familiar weight of Yuuji’s arm settling along his shoulders, a warmth that pulls him flush against Yuuji’s side. What makes him freeze in place is the distinctly, unfamiliar sensation of his arm sliding down from his shoulder to fit in the dip of Megumi’s waist. It makes him flinch. Yuuji barely seems to notice, too busy making a deep and exaggerated sniffle. “They grow up so fast, don’t they?”\n It’s a lifetime of survival instinct and his inherent gift from compartmentalization that keeps Megumi from collapsing into the ground in a little puddle of man, despite every single cell in his body seemingly screaming at him to do so the moment the Yuuji’s fingers settle in their place. Across from them, Nobara looks like she’s about to throw up all over both of them. “No.” She says with no small amount of venom. “No. Absolutely not. Stop this right now. Fuck off, both of you, right to hell, immediately.”\n Yuuji’s hand doesn’t move from its place, but Megumi feels the shivers of his swallowed laughter rumbling through his frame. Still somewhat shell-shocked, running purely on auto-pilot, he mirrors Yuuji’s motion, putting his hand on the curve of Yuuji’s hip, tucking his thumb in his belt-loops, flatly saying, “watch your tone young lady.” \n Yuuji jerks beneath his touch like he’s been struck by lightning. Nobara looks ready to set fire to their apartment. “I’m disowning myself.” She replies, positively murderous. “And then I’m drowning myself, because seriously. What the fuck.”\n Yuuji’s laughter breaks through his lips. “Don’t talk to your father that way!” He shouts with absolutely no anger, voice trembling with laughter around every word. Nobara’s eyes flood with rage. Megumi bites back a smile of his own.\n “I’m leaving. I hope I come back to find you both dead.” She spits, turning on her heel and storming out of the kitchen.\n “Your curfew is at ten!” Megumi feels compelled to reply. The only reply he gets is the front door firmly slamming shut. “Kids these days.” He grumbles, and Yuuji dissolves into hysterics, throwing both arms around Megumi’s chest and burying his face into Megumi’s shoulder and nearly sending them both tumbling to the floor. \n “D-did you see—“\n “Yuuji I’m going to fall—!”\n “Her face!” He wheezes, almost in tears. He leans in a little closer, sending them both stumbling to the side. Megumi shoves at his head and tries to pry him off, steadfastly ignoring the way his heart skips a beat when Yuuji’s breath brushes against his skin.\n “She’s going to slaughter you.” Megumi says, finally forcing Yuuji to stand mostly on his own. He can’t quite push him off entirely, Yuuji seemingly determined to maintain at least three points of contact with Megumi at all times.\n “What do you mean me, you went along with it too!”\n “I got infected by your stupidity.” Megumi deadpans, unable to dodge out of the way of Yuuji’s elbow which sends him stumbling back towards the pan, elbow catching the handle and sending its contents to the floor. \n Yuuji’s scream is sharp and high pitched and brimming with despair and it makes Megumi sit there on the kitchen floor and put his head on his knees and laugh, hard enough that the swirling knot in his chest loosens and falls away, leaving nothing but his full bodied laughter and Yuuji’s mournful gaze looking forlornly down at him like some kind of kicked puppy. He’s too focused on getting air back into his lungs to even remember it happened.\n They sit together on the floor, scooping handfuls of rice into the trash, bickering and bantering the whole way, and by the time the emergency takeout they ordered arrives, Megumi’s forgotten about it entirely.\n+\n It takes a good few rounds but Megumi finally takes his victory, throwing out rock and demolishing both Nobara and Yuuji in one fell swoop with their matching scissors. He doesn’t whoop or cheer like Yuuji does, nor does he incessantly gloat the way Nobara would, but he can’t help but turn his chin up and smirk when they collapse back onto the couch with groans.\n “Yeah, yeah, you won, fair and square.” Nobara grumbles, rolling onto her side, still completely wrapped up in her giant, fuzzy, purple blanket. “But I’m telling you, if you pick another documentary on the opioid crisis in America I will shit in your bed.”\n “Please don’t shit in my bed.\"\n “How many documentaries on the American opioid crisis do you think are out there?” Yuuji fires back from his place on the floor, looking up at her and frowning.\n “I don’t know but I’m sure he’s gonna watch all of them!”\n “It’s very concerning that you haven’t promised not to shit in my bed yet.” Megumi sighs, nudging Nobara off the couch with his foot in small increments until she inevitably hits the floor with a yelp. “You’re on popcorn duty this week, go get it.”\n “Get me a coke while you’re there!” Yuuji shuffles up onto the couch next to Megumi, kicking his legs onto Megumi’s lap. Megumi pushes them off. Yuuji kicks them back up, pulling out his phone and ignoring Megumi’s attempts to push his legs off again.\n Nobara scoffs, struggling to her feet. Her blanket burrito doesn’t slip. Megumi’s almost impressed. “Ugh. Fine. Megumi?”\n He shakes his head. “I’m good.”\n “Get him a soda too, he’ll start stealing mine eventually.” Yuuji adds, not looking up from his phone, yelping when Megumi smacks his leg. “What, you always do!”\n “I did it once cause I was choking on popcorn and I didn’t wanna die.”\n “What about last movie night, huh?”\n “I was high, you can’t hold that against me.”\n “Shut the fuck up!” Nobara shouts from the kitchen. “I’ll bring you both soda, just stop fucking shouting!”\n Yuuji winces, flashing a guilty glance Megumi’s way. “Jeez.” He mutters. “What’s got her so pissy?”\n “Shitty group project. She pulled an all-nighter over it.” Megumi makes sure to keep his voice low, leaning into Yuuji’s side for the other boy to hear. Yuuji jerks back, eyes wide, turning his concerned gaze towards the kitchen. “Almost cried over breakfast too.”\n “Did I miss it?” Yuuji’s leg starts to bounce, his forehead twisted with worry.\n “You were on your run.” Megumi says. Yuuji only hums in response, still staring at the kitchen. He rolls his eyes, reaching over, flicking him in the forehead. “She’ll be fine, she just needs a break tonight and she’ll be good. I’ll pick one of her dumb action movies, okay?”\n Yuuji blinks, tilting his head, still rubbing the spot Megumi flicked. “Weren’t you really excited to watch that penguin documentary that just came out?” He gestures to the TV. He’s already pulled it up, selected the Japanese subtitles and the English audio, started and paused it so the trailer wouldn’t be looping forever in the way that Megumi hates.\n Megumi’s heart stutters in his chest. “You remembered that?” He says, feeling oddly touched. He only mentioned it off-handedly, in passing conversation, months ago when they were still awkward and unfamiliar.\n Yuuji looks at him like he’s stupid. “Of course I did.” He says matter of fact. Megumi’s heart stumbles in his chest again. Yuuji smiles, the smallest thing, fond and warm and honey-sweet.\n “Here.” Nobara’s voice cuts through the air, as abrupt and unceremonious as the cans she dumps in their laps. Megumi winces, watching one smack right into Yuuji’s shin, quickly reaching out to stop it from falling as Yuuji clutches his leg and yells.\n “What the hell Nobara!” He cries, pained scowl disappearing as soon as he turns it on her. Curious, Megumi follows his gaze, seeing her curled up in the armchair, face glowing from the light of her phone. She taps at it, stares, and then huffs out the tiniest of giggles. He doesn’t need to turn back to know what kind of face Yuuji’s making. “Hey Nobara, who ya’ textin’?”\n She fumbles her phone, face bright red, eyes wide and panicked. “No one! Fuck off!” She blurts almost reflexively.\n “We both literally helped you get ready for your date with Maki last week.” Megumi replies. Yuuji snickers. Nobara only grows redder.\n “And? So what, you a cop or something?”\n “What?”\n “Ah, young love.” Yuuji sighs, swooning forwards, somehow, draping himself over Megumi’s back and mushing his cheek against Megumi’s face. “Isn’t it so sweet?”\n Nobara blinks, confused, before understanding dawns on her face, swiftly followed by anger. “Don’t you fucking dare—“\n “I remember when I first fell for your father.” Yuuji grabs Megumi cheeks in a crushing one handed grip, smushing his face and smothering Megumi’s protests. “Our eyes met from across the room, don’t you remember darling?”\n Megumi feels the acute sensation of being struck by lightning. “Buh?” He replies intelligently, still being squished into oblivion.\n “Die.” Nobara seethes. Her hand drifts threateningly to the full bowl of popcorn by her side. Megumi manages to wrestle Yuuji off and grab the remote and start the movie just in time, saving the sofa and his sanity in one swift move.\n+\n Megumi stumbles through the door, half-asleep and half-dead, yawning through his greeting and shuffling into the kitchen. Nobara looks up from her notes, pausing at the sight of him.\n “Woah, you look dead.” She says, giving a disbelieving once over. “Did you sleep at all?”\n “A lil.” Megumi mumbles. He dumps his bags on the couch, rubbing his eyes. “One of the dogs was scared, she needed someone to sit with her.”\n “And you sat with her all night? In her kennel?” Nobara laughs, shaking her head. “God, you’re something else Fushiguro.”\n “She was crying!” Megumi protests, all bite lost in the exhaustion of his voice. He blinks, looking around unsteadily. “Yuuji left for his practice?”\n “Yeah. He left before I woke up.” Nobara replies, turning back to her homework for barely a moment before she’s turning back again. “Wait, how’d you know about that?” \n “He texted me on my way here.” Megumi holds out his phone, letting her see the screen. “Also has a message for us.”\n Nobara takes his phone gingerly, tapping on the unopened snapchat with no small amount of apprehension. “Oh boy.” She mutters as it loads. Megumi snorts and shuffles behind her to watch.\n It opens on Yuuji, in their apartment, a thin sheen of sweat covering his head and his track shirt sticking to his chest. “Sorry I had to leave so early.” He starts in what Megumi has come to know as his shit-starting voice, his very first syllable making Nobara stiffen in place. “Megumi your breakfast is in the fridge, make sure you eat it and get some rest. Nobara, I hope you have a wonderful day at school, hugs and kisses for you both!”\n He blows a big fat wet kiss at the screen. The video closes. Nobara thrusts the phone back at Megumi, disgust filling every inch of her face. “I’m going to go throw up.” She announces with disdain, sliding off the stool and storming off. “And then I’m going to shit in Yuuji’s bed.”\n “Please stop threatening to do that.” Megumi admonishes faintly, his ears hot and his heart pounding. He stumbles over to the fridge like a man possessed, yanking the door open and staring desperately at the contents inside.\n Right there in the centre, a saran-wrapped plate of omurice, ketchup messily drawn in the shape of a smiley-face. There’s a sticky note on top, one of the little teddy-bear ones Nobara keeps forgetting to bring back to her room. Megumi reaches out, peels it off the saran-wrap, bringing it up to his face to read it.\n You worked really hard today!! I’m super proud of you and I’m sure those dogs are too!!! Make sure you get lots of rest dear husband of mine!!!! The kanji is messy and cluttered, barely enough room left for the tiny little dog drawn at the bottom. It’s not a very good dog either. It’s more like a compressed moose, if anything.\n He traces the picture with his thumb. A spike of affection runs through his chest, hot and bright and unmistakable. “Oh shit.” Megumi says out loud, getting the very distinct sensation of the start of a major crisis. “Oh shit.”\n Atop the omurice, the smiley-face stares at him, almost accusingly. Yeah, it’s unblinking eyes seem to say. it’s about time you noticed you fucking moron. Megumi’s too busy panicking to feel offended.\n+\n So now they’ve got this running bit, the three of them, where they pretend that Yuuji and Megumi are Nobara’s gay dads. Well, it’s more Yuuji’s running bit. Nobara finds it absolutely disgusting and cites it as her inevitable motive for their inevitable murder. Megumi would probably find it funnier if it wasn’t the catalyst for his current romantic crisis.\n The thing about Yuuji Itadori is that he’s got a penchant for running a joke into the ground. He’ll beat it to death, and then just keep fucking beating it until the people forced to put up with him drag him away from the joke’s bleeding and broken frame, begging him to show it a little mercy. It’s annoying, but Megumi’s always found it oddly charming. Now he’s certain it’s going to be his cause of death.\n Nobara comes from home from class and Yuuji asks her if she wants an after-school snack, hand pushed into Megumi’s back pocket. Nobara drops a mug with a curse and Yuuji tells her to watch her language, his fingers running through Megumi’s hair. Nobara mentions how good Maki looked that day and Yuuji rambles about love at first sight, turning to direct his blinding smile at Megumi and calling him honey, sugar, sweetheart, doll, his voice saccharine sweet and his thumb rubbing circles into the back of Megumi’s hand.\n It’s infuriating and frustrating and fucking addictive as all hell. Yuuji had always been a tactile person, had been clinging to Megumi like a leech for months now. The cuddling on the couch and the gentle hand on the small of his back as he squeezed past behind him and their legs intertwined under Megumi’s covers after a particularly bad nightmare, they’ve always been a thing. Hell, Nobara does it just as much as Yuuji does, but for some reasons the back of her palm against Megumi’s head doesn’t make him dissolve into a little mushy puddle of man.\n It’s probably a good thing, he reasons, leaning into the softness of her touch. He already feels mostly liquid, his limbs weak and shaky, barely able to hold himself up. “I mean, your fever finally broke, but man, you’re fucked up.” She says, most likely worrying her lip under her mask.\n “M’fine.” He rasps, trying to push himself upright. He’s sweating through his sheets and it feels gross against his skin but Nobara pushes him right back into it. He whines. “Noooooo—“\n “He’s still sick!” She shouts over her shoulder. “He’s also being a little bitch!”\n “I wanna shower, I feel disgusting.” He groans, trying to find a not gross spot. “And I need to get out of these sheets—“\n “You’re going to pass out if you get in the shower. Your spindly little twig legs are going to collapse under your own weight and you’re going to crack your head on the tile and get blood everywhere and I’m gonna have to clean it up. Like hell I’m letting you shower.”\n “You haven’t cleaned a goddamn thing in this house since you moved in and you know it.”\n “It’s called feminism.”\n “I’m going to get you evicted.”\n “Nobara, it’s eleven.” Yuuji laughs, pushing open the door to Megumi’s room with his shoulder, glass of water in one hand and medicine in the other. He passes them to Megumi, quickly running the back of his hand along Megumi’s forehead. The touch makes Megumi’s heart skip a beat, which is, at this point, predictable and annoying more than it is terrifying, which is nice.\n Nobara curses, loudly. “Argh, this material is important for the final too.” She groans, straightening up, pressing her hands together apologetically at Megumi. “Sorry Megumi, I really can’t fail this class…” \n Megumi swallows, waving her off. “I’m not dying.” He grumbles. “Just go, with you gone I’ll be able to shower.”\n “You little shit—“\n “Nobara, if I help Megumi shower would you be okay with that?” Yuuji interjects loudly. The fact that the very concept doesn’t make Megumi immediately freeze in terror is a testament to how gross Megumi feels. He turns his gaze on Nobara, trying his best to beg with his eyes. He’s past the point of dignity. He just wants to be clean.\n Nobara gags. “Ew, fine, don’t look at me like that, Jesus.” She shoves at his face, walking backwards out of the room. “I’ll be going in the next five minutes, okay?”\n “Stay safe!” Yuuji shouts back. He turns to Megumi, eyes sparkling with a smile that’s hidden behind his mask. “Ready?”\n “You have no idea.” Megumi grumbles, wincing as Yuuji helps him to his feet. “Sorry you were stuck taking care of me this past week.”\n “Nah, it’s fine. You’re low maintenance and I got my flu shot so it was really no problem.” Yuuji is less supporting his weight and more so carrying him, guiding him through the hall and into the bathroom. Megumi would be more embarrassed if he wasn’t so grateful. “You better remember to get your shot next season.”\n “Yeah, I know.” Megumi sighs, collapsing on top of the toilet seat when Yuuji lets him down. He groans, the cool tile beneath his bare feet a blessing. “I can get into the tub just fine.”\n Yuuji nods. “Kay. Strip and get in and turn on the shower if you can. I’ll grab you some clothes.” Megumi hums his reply, already peeling off his shirt. He strips down, clambering into the tub on unsteady feet, barely able to reach the knobs in time. He manages, somehow, getting the water warm before he’s forced to lean against the wall, blinking spots from his vision. He groans, dropping his head to his chin, closing his eyes.\n “Megumi?” Yuuji calls. Megumi grunts. “You dead?” Megumi grunts again. Yuuji’s laugh is soft but still bright, echoing off the tile in time with the sound of the water hitting the floor. His hand braces the back of Megumi’s neck, helping him shift up so he’s haphazardly braced against the tile.“You want me to help?”\n Megumi shakes his head. “Just be here in case I die.” He rasps out.\n “Of course, I’ll hose down the blood before it has the chance to dry.” Yuuji replies, voice dancing with humour. Megumi can’t help but laugh, tilting his face up into the shower’s hot spray. He blindly grabs for the soap, lathering himself quickly and sloppily. He already feels better with just the shower’s hot spray alone, but he still tries to get behind his ears and scrub at his skin.\n Outside the shower, silhouette visible through the sheer of the curtain, Yuuji sits on the counter. His form is too blurry to make out specifics, but Megumi can tell that he’s got one foot tucked underneath him, scrolling through his phone with one hand, idly drumming against his leg with the other.\n “Feet off the counter.” He chides, hoarse but gentle. He watches the shadowy mass shift in posture.\n “Sorry.” Yuuji calls back, not sounding particularly sorry at all. Megumi hums in reply. “Want me to wash your hair?” \n Megumi blinks, considering. “Are you gonna get shampoo in my eye?”\n “Hey!” Yuuji scoffs. His shadow hops off the counter. “I’m pretty careful, I’ll let you know.”\n “My apologies.” Megumi’s words are dry, but he can’t stop his voice from softening as says, “I’d like that.”\n Yuuji doesn’t reply, simply pulling open the shower curtain and stepping into the shower. His shirt is gone but he’s still wearing his basketball shorts. He catches sight of Megumi’s raised eyebrow, blushing, saying, “What, I didn’t want to make it weird!”\n “We’ve been to public baths before.” Megumi pointedly replies, letting Yuuji guide him to the floor, hearing the scraping of the stool behind them. “We’ve seen each other naked. Hell, we’ve seen Nobara naked.\"\n “That’s different.” Yuuji grumbles. Megumi glances back, laughing when he sees Yuuji’s blush grow darker. He pushes Megumi’s head back. “Close your eyes.”\n Megumi obliges. Yuuji’s fingers press into his scalp, massaging in small circles, lathering his hair in shampoo. He sighs, leaning into the touch. “Did you catch Nobara before she left?”\n “Yeah, why?”\n “No reason, just wondering.” Megumi lets Yuuji’s gentle fingers guide him, tilting his head to the side. “Felt bad, I know she cancelled on Maki to take care of me that one night you had class.”\n “I can’t believe you remember that.” Yuuji laughs, breathy and disbelieving. “You were fucking gone for like two days straight.”\n “I remember bits and pieces.”\n “Yeah?”\n “Mm.”\n “Like what?” Yuuji’s hands card through Megumi’s hair, rinsing out the suds.\n “That dumb fucking song you had on repeat.” Megumi replies dryly. He feels Yuuji shake with laughter behind him. “You played it for like a full day straight, at some point I was going to be conscious enough to be aware of it!”\n “Okay, okay, I get it I have bad taste in music—“\n “Your taste in music is fine, it’s just, why do you play it on loop don’t you have anything else—“\n “It’s catchy!”\n “It’s insufferable!” Megumi snaps, smile pulling at the corners of his mouth. Yuuji’s hands have stopped moving, instead braced against his shoulders as he doubles over and laughs and laughs and laughs. Megumi throws back an elbow. “Hey, hurry up, we’re gonna prune over completely if we’re here any longer.”\n “Sorry, sorry!” Yuuji’s hands resume their motions. He’s using conditioner now. Megumi tries to ignore the shivers that run down his spine in response. “Anything else?”\n “Huh?”\n “Anything else you remember?”\n “Oh, that soup you made.”\n “The vegetable one?”\n “Yeah, it was nice.”\n “Do you wanna have it for dinner tonight?”\n “Sure.” Megumi sighs. Yuuji starts rinsing out the last of the conditioner, soft snickers echoing into the air. “What’s so funny now?”\n “Sorry, just—“ Yuuji starts, and then stops, dissolving into laughter again. “I just kept waiting for Nobara to cut us off by calling us gross or whatever, I forgot she wasn’t here.”\n “Be kinda weird if she was. The three of us, in the bath together?”\n Yuuji flick his neck. “Not like that.” He huffs. His voice is tight, weirdly so, strangled in a way Yuuji hardly ever seems to be. “Just…” He trails off.\n “Just what?” He prompts gently. Yuuji stays silent, standing up, turning the shower off, helping Megumi to his feet. He hands over a towel, not meeting Megumi’s eyes. Megumi frowns, but takes it without a word. They continue in silence, drying off, changing clothes — Yuuji luckily having the foresight to bring himself another set so he’s not tracking water all over the house. He helps Megumi with his, guiding him into his pants and helping the shirt over his head. It’d be embarrassing if it were anyone else, but it’s Yuuji, so his touch is gentle and his hands are warm. Megumi lets himself be led out of the bathroom and into the hall and into Yuuji’s bedroom.\n “You cleaned up.” He says, surprised.\n “You don’t have to sound so shocked.” Yuuji grumbles. His ears are red. He guides Megumi to his bed, helping him lay down and settling next to him.\n “Mask?”\n “Don’t need one.” His words are distant and distracted. Megumi frowns, rolling over with some difficulty, batting away Yuuji’s hands when they move to help him. “Megumi—“\n “Just what, Yuuji.” He asks. His voice is hoarse and rough, scraping its way out of his throat. Yuuji stiffens, then softens, turning towards him. They lie side by side, face to face. Megumi can feel the warmth of Yuuji’s skin against his own.\n “I never realized how much we acted like a married couple even before we started this dumb joke.” He says, soft and sincere, hushed like it’s a confession. In the still silence of the room, they ring loud and clear. \n Megumi blinks at him, stunned. “Did you seriously have to drag it out for that long?” He asks, disbelieving. “You couldn’t just say it while we were in the bathroom?”\n Yuuji’s cheeks flush pink, pretty and high on his cheeks. “You were naked!” He snaps defensively. \n “What’s so bad about me being naked?”\n “There’s nothing bad, it just didn’t feel right!”\n “That literally makes no se—“ Megumi starts, and then stops, closing his eyes and bringing his hand up to cup Yuuji’s jaw when he’s interrupted by the feeling of soft lips against his own. It’s warm, so warm, like the smell of breakfast in the morning, like the feeling of legs stacked on top of his own, like the feeling of stepping through the front door and kicking off his shoes and calling out a greeting and being met with the sound of home.\n Yuuji pulls away. The pink has spread to the tips of his ears. “Hey.” He says, softly, giggling as he does.\n “You better not get sick after this.” Megumi warns him. He runs his thumb along the edge of Yuuji’s jaw.\n “I won’t.”\n “I’m serious.”\n “I got my flu shot, I’ll be fine.”\n “If you get sick I’m not taking care of you.”\n “How mean Megumi! To be so cruel to your own husband—“\n “Can you at least take me out to dinner before you start that up again?”\n “I’ll make you that soup and we can watch National Geographic on your laptop?”\n “…fine.” Megumi sighs. Yuuji beams and leans in to kiss him again.\n+\n Yuuji comes into the living room just as Megumi’s done with the socks, putting the last of them in their pile in the corner of the armchair. He grabs Megumi’s wrist, pulling him close to his chest, pressing a kiss to Megumi’s cheek, the highest he can reach. Megumi scoffs, pushing at his chest. “Let me finish the laundry first.” He protests, trying to wriggle out of his arms. “Nobara’s bringing Maki over apparently.”\n “You grew up with Maki, you don’t have to make a good impression.” Yuuji laughs. He starts to sway to the song playing from the radio, an old ballad from the classics station. “Oh, I love this song!”\n “You’re such an old man.” Megumi rolls his eyes, but sways with him, bringing his hands up to rest on Yuuji’s hips.\n “My grandpa hated this song.” Yuuji confesses. “He said it was overplayed in his youth, so I used to piss him off by blaring it through the house.”\n “What a loving grandchild you were.” Megumi replies dryly. Yuuji’s laughter rattles through his chest. “You’re helping me with the laundry when the song’s over.”\n “Kay.” Yuuji replies. Megumi can feel his eyes close, long eyelashes brushing against his collarbones. The room glows gold in the sunset that filters through the blinds, pinks and purples painted across Yuuji’s skin. The song is slow and sweet, like a well-worn memory fondly held in familiar hands. Megumi feels the warmth of Yuuji’s breath ghost along his skin, and hopes that they are no different.\n “Oh my god.” Megumi lifts his head, meeting Nobara’s open look of disgust and horror, like she isn’t holding her girlfriend’s hand in her own. “Maki-san, I’m so sorry, I told you they’re the worst.”\n “I can see what you mean.” Maki replies drily, mouth pressed into a thin line, corners barely twitching with bemusement. There’s the pink shimmer of lip gloss smudged against the corner of her mouth. Megumi pointedly does not mention it, nor the oversized leather jacket draped over Nobara’s shoulders.\n Yuuji lifts his head. “Hey Nobara!” He says brightly, voice full of mirth and mischief. Megumi hides his own smile in the tufts of his hair. “How was your date?”\n “I’m leaving!” Nobara announces pointedly, dragging Maki behind her as she escapes to her room.\n “Make sure you leave the door open.” Megumi calls after them calmly, and Yuuji tilts his head back and laughs, voice as rich as the setting sun. It rings through the air, and Megumi chases it with a kiss, committing it to memory, alongside all the other things that he can call home."
}