{
    "id": "27383050",
    "url": "https://archiveofourown.org/works/27383050?view_full_work=true",
    "author": [
        "FallingNarwhals"
    ],
    "title": "in the shade of a sunflower",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Bakugou Katsuki & Midoriya Izuku",
        "Midoriya Izuku & Melissa Shield",
        "Midoriya Izuku & Uraraka Ochako"
    ],
    "characters": [
        "Midoriya Izuku",
        "Bakugou Katsuki",
        "Uraraka Ochako",
        "Melissa Shield",
        "Iida Tenya",
        "Asui Tsuyu",
        "Aizawa Shouta | Eraserhead",
        "Class 1-A (My Hero Academia)"
    ],
    "additional_tags": [
        "quirk science",
        "Quirk Shenanigans (My Hero Academia)",
        "Quirkless Biology",
        "Class 1-A Shenanigans (My Hero Academia)",
        "Carolina Reapers (Ghost Peppers)",
        "Colorblind Characters",
        "Appendicitis",
        "Wisdom Teeth",
        "Midoriya Inko is a Ray of Sunshine",
        "5+1 Things",
        "POV Uraraka Ochako",
        "Midoriya Izuku & Uraraka Ochako Friendship",
        "Colorblind Midoriya Izuku",
        "bakugou has taken it upon himself to single handily safeguard ofa but is a Bitch About It",
        "deku is a small object",
        "what do you MEAN you dont know the scientific name for the funny bone?",
        "Izuku's body isn't as evolved as everyone else's",
        "the pinky joint isn't the only extra useless thing in his body",
        "slight vomiting",
        "its just a little tho no worries",
        "crack treated seriously ???????? maybe??",
        "Humor",
        "Quirkless People with Extra Toe Joints Wear Custom Sneakers | Red Shoe Theory (My Hero Academia)"
    ],
    "language": "English",
    "series": "",
    "published": "2020-11-04",
    "completed": null,
    "words": "5,510",
    "chapters": "1/1",
    "comments": "340",
    "kudos": "11,747",
    "bookmarks": "2,417",
    "hits": "83,857",
    "summary": "<p>A waft of spice hit Ochako’s nostrils and she reeled back in shock. She has faced down countless villains since coming to UA. She has been in battle and in hand to hand combat possibly a hundred times. She faced Overhaul’s minions with support from her peers, but otherwise without outside help. But no villain with a terrifying quirk has ever struck her with more fear than quirkless Melissa shoveling curry made of peppers so deadly it killed an unprepared Pro Hero famous for his spice tolerance on live TV. Deku was still guzzling water directly from the sink, Tokoyami’s quirk was crying in pain as he casually shoveled more into his mouth, and Melissa was handling the spice like a pro.</p>\n<p>Being biologically quirkless came more with an extra pinkie joint in the toes and a stunning lack of vestiges mutations. It came with smaller things, like extra teeth that did virtually nothing, exploding organs, and weird exposed nerves that weren't designed to feel pain.</p>\n<p>Or,</p>\n<p>Five time's Midoriya Izuku struggled with being biologically quirkless and one time it was a gift</p>",
    "notes": "<p>special thanks to BelleAmant and Ashynarr for bouncing ideas off of me</p>\n<p>Chapter Three of A Legacy In Crimson has also come out! please go read that when you have the chance!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>some minor explanations that i wasn't able to fit in<br>1. recovery girl recognized appendicitis for what it was because all might had it when he was in high school as well<br>2. melissa and deku consider themselves cousins because their dads dated briefly in college and they like to make fun of them<br>3. midoriya is minorly red/green colorblind because colorblindness is male patterned on the quirkless traits. no one bats an eye though because people can still have vestige mutations on biologically quirkless bodies or bodies without a quirk factor. its not as well known that people who are colorblind cannot have emitter type quirks though and its not anything well researched either since colorblindness is pretty obscure.<br>4. deku physically cant lie which is why bakugou has to come to his rescue all the time<br>5. deku WAS actually born a preemie which is why hes so fuckin little. baby boy. baby.<br>6. i like to think this fic takes place in the same universe <a href=\"https://archiveofourown.org/works/34878979%22\" rel=\"nofollow\">as the fic where todoroki gets a makeover</a><br><a href=\"https://discord.gg/yr2D2DM\" rel=\"nofollow\">join my discord!</a></p>",
    "text": "\nThere was no way to look at it and come to the same conclusion that Ochako did. Deku was Weird with a capital W. Grade A weirdness. Absolutely feral little man. \n\n\nShe didn’t mind of course. The delightful little bundle of energy kept her on her toes and was more than sweet enough to make up for his little oddities. But sometimes there was just something that Ochako couldn’t chalk up or dismiss as her best friend’s ecstatic personality. He was nervous as a tick on a dog but born with such an amazing quirk. With a quirk that powerful, no one should have ever even thought twice about bullying him if they wanted to end up halfway across town and accountable for seven broken bones. (Not necessarily their own, but that isn't something they had to know.) And yet in the few times he brought up his middle school years outside of the hell training he forced himself though, he always mentioned bullies.\n\n\nHe was jumpy in the most odd places. It took weeks of surprise hugs for him to stop jumping out from under her touch, and weeks more for him to stop stiffening. He still flinches when she yells just a bit too loud, stiffens under unexpected touch from Iida or Kirishima. Ochako would have written it off to a slightly rough childhood home but his mom was a soft spoken saint and his father was nowhere to be found. \n\n\nSo, her friend was weird. And she adored him for that. \n\n\nBut this was the next level.\n\n\n“How do they fit inside of your shoes?”\n\n\n\n\nDeku shrugged, peeling a sweaty sock off and chunking it at her face that she ducked with a bark of laughter before stuffing the offending foot into a slipper. Deku rolled his eyes, but the smile did not disappear from his face. “I wear high tops.” \n\n\nHis toes were long. Weirdly long. Green hair, long toes, jumpy demeanor. What else was he hiding? Organs that could explode along with his bones?\n\n\n“Don’t your toes get crowded?” She laughed.\n\n\n“I actually do have concerns about possible athlete’s foot if your footwear is inadequate-” Iida interrupted, then gasped because he accidentally cut Ochako off. Ochako waved off his apologetic bow. \n\n\n\n\n“We do work out a lot, and athlete’s foot is a valid concern I haven’t thought of.” Deku admitted. “But I’ve never had a problem with it before. The only time I ever got it was when me and Kacchan accidentally swapped shoes in middle-”\n\n\n\n\n“Hey! Shut your mouth before I shut it for you!” Bakugou exploded from the couch. His threat was neutralized because Aizawa’s cat, Fork, was asleep on his lap. Everyone knows the laws of the universe. One could not get up if a cat fell asleep in your lap until the nap was properly completed.  Even Bakugou must follow these rules.\n\n\n“That is good to hear!” Iida pushed himself to his feet and then grabbed Ochako and Deku by the back of their shirt collars with a yelp from both of them. “Now, we must go study for tomorrow's test! I expect zero distractions from the two of you, queries about feet be damned!” \n\n\n“Don’t step on Deku’s weird ass toes on the way up!” Bakugou called cheerfully from under Fork’s hold. Deku flipped him the bird.\n\n\nIn her heart, Ochako was glad that Deku was able to reach such a comfortable relationship with his classmates. He didn’t jump under Iida’s unintentionally rough handling and took Bakugou’s light teasing in a stride.\n\n\nBut that was in her heart. For now she was out for murder. Crimes must be paid in full.\n\n\n\n\nShe picked Fork up from Bakugou’s lap.  Fork yowled with indentation, Bakugou exploded in mourning for his lost space heater and her, Iida, and Deku ran up the stairs at top speed, Bakugou cursing them a thousand deaths behind them as Kirishima tried to pspsps Fork onto his lap.\n\n\n“You’re colorblind?” Kirishima gasped. \n\n\n“Just red green colorblind!” Deku raised his hands in reassurance, which did nothing to calm the entirety of the class and only made the class buzz louder. “It’s just hard to tell some things apart. Like apples.” \n\n\n“What about my hair?” Kamimari tugged on his own locks, practically shoving his hair into Deku’s face. “What color is my hair to you?”\n\n\n“I can see colors, including yellow.” Deku said. The barest hint of crossness seeped into his voice. “It just looks dimmer, apparently. It’s really not that big of a deal, guys.”\n\n\n“Okay Midoryia, what color am I?” Mina spun around in front of Midoryia’s desk, her skirt flowing out in her spinning. Deku smiled politely, if a bit forced.\n\n\n“I know you’re pink, Mina. Your hero name is literally Pinky.” Deku rolled his eyes, and his smile appeared much more forced. “I can see pink too. It's just not as vivid as you might see pink.” \n\n\n“That is true, ribbit.” Tsuyu chimed in. “Plus, if Midoriya has been colorblind his whole life, to him colors are normal. They just may be harder to tell apart. He has no point of reference to know what some colors are supposed to look like. It's not that he doesn’t know what colors are, some just look more similar. Ribbit.”\n\n\nDeku’s face relaxed. “Thank you, Asui. That’s exactly how it is for me. I know the concept of green, it just looks similar to red. Sometimes red things are green!” \n\n\n“Call me Tsuyu, ribbit.” Tsuyu croaked happily. “It just bothers me when people use people's differences to entertain themselves.”\n\n\nOchako nodded. She had listened when Tsuyu told her stories of her kindergarten, of how kids would pester her endlessly to do things with her quirk. Swallowing and spitting back up objects, sticking to walls.\n\n\n“It was all in good faith of course,” She had croaked. In her lap was a small crocheted plushie of a frog, courtesy of her younger sister. “But it still hurt to be treated like an entertainer when I did not wish to be.” \n\n\nTsuyu sent a pointed glare at Mina, who gasped and raised her hands. “Ah, sorry Midoryia! I totally didn’t think of that!”\n\n\nDeku smiled, a much more relaxed and genuine smile then before. “It’s alright, I get it. It is different then what you’re used to.” \n\n\n“You know, this is why traffic lights are situated so the colors align on all intersections,” Momo pointed out. “Colorblindness used to be very common among quirkless individuals. It is just one of society’s leftovers from simpler times.”\n\n\nDeku’s smile tightened. His shoulders shrunk into themselves. Bakugou stiffed, but continued to ignore the conversation. \n\n\n“Haha, thats funny. Me. Quirkless.” He said nervousness. “I uh. I’m just colorblind. Not quirkless. Not at all!” \n\n\nBakugou’s head hit the desk with a loud smack.\n\n\nIida frowned. “Nobody implied that you are quirkless, Midoryia. In the society of quirks, everyone everywhere has quirks that can both act as abilities or disabilities. Yours just so happens to be colorblindness as a drawback to, if I may be frank, crazy supernatural strength.” \n\n\n“Don’t forget his precious cracker bones!”\n\n\nMomo nodded. “I just thought it was interesting. I didn’t mean any offense!”\n\n\n“None taken!” Deku’s voice reached high pitches that even Present Mic might have difficulty reaching. Bakugou whirled around and shoved a small explosion into Deku’s desk, which luckily had been cleared of any important papers. \n\n\n“God! Do you ever shut up!”\n\n\n“Are you alright, Midoriya?” Kirishima asked the next day over breakfast. “You’ve been rubbing your jaw all morning.”\n\n\nMidoryia’s plate was piled high with untouched white rice, and nothing else. \n\n\n“My wisdom teeth are coming in,” he sighed. “I’m supposed to get them pulled next week but for now they’re just really sore.”\n\n\n\nHis what?\n\n\n\nHe offered no further context and Kirishima seemed too shocked to ask about the removal of \n\nteeth\n\n from Midoriya's \n\nmouth.\n\n\n\nThe following Monday Deku was gone from class, having been picked up by his mother early that morning. By the time class ended and Ochako had used up her allotted after school time training, she just walked into the dorms as Inko was dragging her son with her quirk, twenty feet in the air, with ice packs tied to his face with purple medical tape.\n\n\n“Ms Uraraka! Oh, can you get the door for me sweetie?” Inko smiled in lieu of a greeting. “I’m afraid I need my hands empty to keep him afloat.”\n\n\nOchako nodded, and let Inko into the dorms. Deku murmured something about clouds.\n\n\n“I thought your quirk was making small objects float?” Ochako asked, weakly. Small objects like paper clips and All Might figurines, according to Deku. Not full teenage boys with strong ropey muscles, extra bones, and a thick skull.\n\n\n\n\n“I am a small object.” Deku said from the ceiling. His voice was slurred and muffled from the two ice packs strapped to his face. Apparently he was lucid enough to understand Ochako. He giggled. “I am verrrry little.” \n\n\n\n\n“Ah, funny story!” Inko laughed. “I started using my quirk on him when he was a baby, and as he grew my quirk got stronger. It’s amazing what exercising your quirk can do! Carrying a two kilogram newborn used to be my full strength.” \n\n\nTwo kilograms? That’s way too small! Ochako looked at the thick teenager who was now picking at the ice packs on his mouth while mumbling something about a good dentist stealing his teeth. Ochako had seen Deku destroy buildings, had seen his quirk tear apart his very limbs because of the raw power flowing in his veins. In her mind, Deku has always been this powerful engingma of a kid who has always given his all. She cannot imagine Deku being a tiny two kilogram baby. Was he born premature? Would that explain all of his weird little minor health issues? No, prematureness doesn’t give you extra bones or weird long toes. Being born premature doesn’t give you crazy strong super strength that was powerful enough to punch a skyscraper tall robot into oblivion. \n\n\nInko turned to Iida. “Class President, can you guide me to Izuku’s room? Once he takes a good nap he will be back to normal, so I’ll just drop him off there for now.”\n\n\nIida pushed his glasses to the bridge of his nose. “Of course, Ms Midoriya!”\n\n\n“Wonderful!” Inko smiled a familiar smile. Ochako had seen that slightly bashful grin several times on her best friend. Seeing it on his mother's face was delightful! \n\n\nInko made several pulling motions with her hands and Deku slowly made his way down from the ceiling. His arms wrapped around his mother’s neck. \n\n\n“Hi mom!” \n\n\n“Hello, sweetie!” Inko laughed as she guided a still floating Deku to the stairs. “Are you ready to take a nap?”\n\n\n“FUCK YEAH!” Deku whooped. Sero fell off of the armchair with his shout. Iida jumped so high he hit his head on the doorframe. Inko let out a laugh deep from her belly that Ochako distantly thought sounded like bells. \n\n\n“Mom, there’s something in my mouth,” Deku stuck one scarred finger in his mouth, before Inko pulled his hand away with a flick of her finger. “Mom. Mom. Mom there’s something in my mouth.”\n\n\n“It’s just gauze, sweetie.” Inko laughed as Iida pressed the button for Deku’s floor. \n\n\n“God’s in my mouth?” Deku’s eyes widened with the telltale sign of tears before exploding into a waterfall. “Mom! Tell god to stay out of my mouth!”\n\n\nInko soon left after approximately fifteen minutes of reassurance from Aizawa and the rest of class 1A would look after Deku after he woke up. Inko had to go to work and was reluctant to do so, but Mina finally charmed her into leaving when she promised she would hand deliver any pudding to Deku himself. In the meantime, Ochako’s phone was spammed with text messages of random emojis from Deku, most of them miscellaneous heart emojis. \n\n\nThe chaos finally died down a few hours after Inko left and the elevator opened to reveal Iida, with a very out of it Deku clinging to his side.\n\n\n“Oh, Deku’s awake.” \n\n\nDeku waved as he leaned heavily into Iida, who stopped every once in a while to straighten Deku back up. After a long trek from the elevator to the sofa, Deku finally was plopped into place between Ochako and Tsuyu. Iida smiled apologetically.\n\n\n“He wanted to watch the news but his phone was left unplugged. It died.”\n\n\n‘’Uck yeah.”\n\n\n“Oh, I got your messages.” Ochako held up her phone, which was just a wall of random emojis and the occasional “I LOBE USO FUKCIN MUCH” text message. Deku sent her a thumbs up before careening into the side of the sofa. Iida picked him up by the shirt collar and threw him onto the couch. “I was the last person he texted before he went under, so I was at the top of his recents list and therefore subject to his innermost thoughts and feelings.”\n\n\n“I’ll go get Inko’s pudding!” Mina sang as she skipped into the kitchen. \n\n\n“Does that sound good, Midoriya? Your mom made pudding. Ribbit.”\n\n\nDeku nodded once, before falling into Tsuyu’s lap. She pushed him back up again as Mina handed him a bowl of chocolate pudding.\n\n\n“How are you feeling, nerd?” Bakugou asked, almost softly if it wasn’t for the disgusted look on his face. “Are the holes in your mouth fixed yet?”\n\n\nDeku opened his mouth in a face splitting grin. A mouthful of blood dripped down his chin and onto his shirt. “You will die in seven days, Bakugou Katsuki.”\n\n\n“WHAT THE HELL?”\n\n\n“MIDORIYA, I MUST ASK YOU TO REFRAIN-“\n\n\n“HOLY FUCK GUYS HE’S BLEEDING!”\n\n\n“Is that much blood really okay-“\n\n\n“All Might’s secret lovechild-“\n\n\n“Nooo, the pudding! Midoriya, you’re getting blood in the pudding!”\n\n\n“Who cares about the pudding! Get the shirt off of him and into the sink before it stains!”\n\n\nSero ripped Deku’s shirt off and ran as fast as he could to the laundry room. Deku’s shirt was immediately replaced by a thick blanket from the back of the couch.\n\n\n“Alright, change of plans,” Iida rubbed his forefinger and thumb between the bridge of his nose. “Todoroki,” He handed Todoroki two thick ice packs that Ochako recognized as the ones that were strapped to Deku’s face a few hours before. “Refreeze these, but not to a block of ice. About negative three degrees celsius, please!”\n\n\n\n\n“Okay,” Todoroki took the ice packs into his right hand and concentrated. A small curl of frost condensated on the back of his hand. He was probably going slow so he wouldn’t freeze the packs into a block of ice. Last time he tried to cool something too quickly he ended up leaving the hard boiled eggs in an unmeltable block of ice for a week.\n\n\n\n\n“Asido, you were in charge of the pudding distribution, correct?” Mina nodded. “Then please go fetch another bowl. Yaoyorozu? If it is no trouble, please make Midoriya another shirt. Bakugou? Leave.”\n\n\n\n\n“I ain’t going anywhere!” \n\n\n“Leave before Midoriya tries to-”\n\n\n\n\n“SEVEN DAYS!” a new waterfall of blood erupted from Deku’s mouth, dripping from his chin.\n\n\n\n\n“Shit! That’s Jirou’s blanket!” Sero groaned, before ripping the blanket out of Deku’s hands to add it to the laundry. The blanket was dark enough, in Ochako’s opinion, that any bloodstains wouldn’t show anyway, but she supposed washing it was the nicest thing to do in this situation.\n\n\n“They’re done,” Todoroki calmly said in the face of chaos, holding up the ice packs like the head of medusa. “Do you have medical tape to put them on Midoriya’s face again?”\n\n\n\n\nThey turned to Momo. She looked exhausted. She had used a lot of her lipids to make no less than three cannons in training earlier that morning, and was clearly still recovering from it. A simple tee shirt was the last of her strength. \n\n\n“Mina? Get another bowl of pudding for Yaomomo, please!” Ochako called into the kitchen. Mina gave a thumbs up. Momo sent a look of exhausted thanks from her spot on the sofa.\n\n\n“Wha’ bout Sero?” Deku mumbled. “Tape guy.”\n\n\nIida and Ochako stared at each other over Deku’s head. Tsuyu petted Deku’s hair like a cat when he fell into her lap again. \n\n\n“How did we not think of that?”\n\n\n\n\n“We are idiots.”\n\n\n\n\nBakugou stood up from the couch and slammed the door to the laundry room behind him. A girly scream sounded out, and a moment later Bakugou kicked the sliding door open with a handful of tape in his hands. He grabbed the ice packs from Todoroki’s delicate hands and slammed them to both sides of Deku’s face. He looked like an idiot sandwich. Ochako reached out to keep them in place as Bakugou tied the tape around Deku’s face.\n\n\n“Can I reschedule my death now?” Bakugou let go of Deku’s face. He hit Tsuyu’s shoulder on the way down, and she croaked out a startled “Ribbit!”\n\n\n“Maybe eight days.” Deku mumbled.\n\n\n\n\n“Better.” Bakugou rolled his eyes, grinning.\n\n\n“Are you like, okay?” Ochako spoke over a mouthful of rice. She gestured with her chopsticks to Deku’s entire body. He sent a weak glare in her direction, which did nothing to counteract how pale he looked or how hard he was sweating.\n\n\n“I just have a stomach ache.”\n\n\n“It looks like more than a stomach ache,” Iida shot back. “You’ve gone completely flushed and you hunched over the last lesson.”\n\n\n\n\n“It’s a really bad stomach ache,” He argued. “It’s like a jabbing pain instead of like, waves?” He gestures to the side of his torso, trying to hide his gritted teeth behind a pained smile. \n\n\nOchako put a hand to Deku’s face, and felt the blood drain out of her face. He was burning up. \n\n\n\n\n“You are like, on fire,” she so eloquently and dumbfoundly said instead. Iida and Tsuyu both put their hands on Deku’s face as well. \n\n\n“I would like to take a nap on your forehead please?”\n\n\n\n\n“This is a concern. Perhaps we should take you to Recovery Girl after all?”\n\n\n\n\n“Guys,” Deku waved off Iida’s hands and tried to unstick Tsuyu’s from his face and proceeded to accidentally rip away part of his eyebrow in the process. “Stop touching me. Tsuyu give me back my eyebrow. If I still feel bad after lunch I’ll go, okay?” \n\n\n“Fineeeee,” Ochako whined. Iida force fed Deku some curry broth with only meek protests from Deku.\n\n\nTurns out they didn’t have to wait until lunch was over.\n\n\nDeku reached across the table to grab his water bottle just as Kanimari and Kirishima were in the middle of an impromptu wrestling match over the last piece of chocolate Mina had brought from home. Kanimari threw Kirishima into their table by accident, knocking Deku and Ochako off their seats.\n\n\nEverything moved much more quickly after that.\n\n\nKirishima let out a sheepish apology right as he elbowed Deku in the stomach and Deku \n\nscreamed.\n\n It was cut off by a gurgle as Deku vomited all over himself and Ochako. Kirihima let out a yelp. \nWithout a second of hesitation, working together like so many times before, Ochako activated her quirk on Deku as Iida leapt over the table, sending a few dishes flying to the floor, scooping Deku up into his arms and racing out of the room at top speed, with Ochako, Kirishima, and Tsuyu close on his heels.\n\n\nRecovery Girl took one look at a vomit-covered Deku and shooed them all out of the room, saying something about appendicitis and surgery. \n\n\nAnd then they were alone, outside of the nurses office. Waiting. Aizawa would probably come looking for them when they didn’t show for afternoon training. Ochako left at one point to go clean her vomit covered shirt with Tsuyu and came back to Iida and Kirishima shouting.\n\n\n“Kirishima, it isn’t your fault at all. In fact, if you didn’t hit Midoriya we might not even noticed the severity of the situation.” Iida pushed his glasses further up on his nose. \n\n\n\n\n“But still!” Kirishima protested. “I hurt him! He was already in a lot of pain and I made it worse!”\n\n\n\n\n“We were going to take him to Recovery Girl afterwards anyway,” Ochako cut in. “He was like, really sick. Honestly you did us a favor, since we didn’t know it was this bad.”\n\n\nKirishima lowered his head. “That doesn’t stop me from feeling bad though.”\n\n\n\n\nAizawa eventually found them and dragged them back to class, but didn’t say a word against them.\n\n\nWhen Midoriya was brought back to the dorms later that day, a little pale but with a shaky bright smile upon his face, the air seemed to let out whatever breath it was holding.\n\n\n“OUCH!” \n\n\n\n\nIt happened in an instant. Deku and Satou were doing basic sparing exercises. Satou had tackled Deku, tossed him over his shoulder like a fireman’s carry, and had slammed him into the ground. Ochako was keeping half an eye on him in case another appendix incident happened but also so she could practice the hand to hand combat moves later. Satou had been extremely careful to make sure Deku hit the mat back first, not the head. He was also carefully avoiding Deku’s lower right torso where the appendix was removed. But now Deku was clutching his elbow and rubbing his forearm vigorously. She stopped in shock. Sero crashed into her and they tumbled to the ground.\n\n\n“What gives?” He groaned, before helping her untangle tape from her hair.\n\n\n“Something’s wrong with Deku.”\n\n\n“Aw fuck,” Sero sighed. He still had not forgiven Deku for making him fall off his armchair. They quickly shuffled to Deku and Satou’s mat, fully prepared for any emergency involving exploding organs and/or the removal of teeth.\n\n\n“Sorry, sorry, you hit my funny bone on the way down. It just takes a minute to stop hurting!” Deku reassured Satou’s growing concern.\n\n\nThis only made Satou’s expression twist into something more worrisome. “Funny bone?”\n\n\n\n\nDeku blinked. “Yeah. You know, a funny bone? The ulnar nerve?”\n\n\nOchako had \n\nno \n\nidea what he was talking about. Satou shuffled his hands nervously. It was an interesting expression on such a big guy that almost reminded her of Gunhead. “Um. maybe we should just take you to Recovery Girl. This sounds serious. I don’t want you to have nerve damage or something.”\n\n\n\n\n“It’s not serious at all!” Deku waved him off. The aforementioned hand was now being shaken vigorously in an almost stim-like movement. Ochako looked around wildly for Bakugou, hoping that he had some sort of childhood friend explanation for this new strange phenomenon. “It just happens sometimes. Actually, hold on,”\n\n\n\n\nDeku pulled his phone out of his pocket and began to type with one hand. Aizawa had finally noticed the small gathering of students and their concerned expressions and meangered forward.\n\n\n“Problem child, no phones in class.” He chided with a glare. Bakugou finally noticed what was going on and, to Ochako’s horror, just began laughing as Deku rubbed his arm against his thigh.\n\n\n“Just a second, sir! I’m trying to reassure Satou that I’m fine!” \n\n\n\n\nAizawa’s glare narrowed. “What happened.”\n\n\nNot even phrased like a question. Harsh.\n\n\n\n\nDeku laughed awkwardly. “I feel like my hand is being burned, frozen and electrocuted at the same time?”\n\n\n\n\nBakugou was now laughing so hard that tears were streaming down his face.\n\n\nIida whirled around at Kamimari and Todoroki, who were paired up for the exercise. “Stop using your quirks on Midoriya this instant! It is unbecoming to do low tricks like this, and seeing that you two were not even paired up with him-”\n\n\n\n\n“It’s not their fault!”\n\n\n\n\n“We aren’t doing anything!” Kamimari screeched. \n\n\nTodoroki blinked like a cat. “I am just sitting here.”\n\n\nThis only caused Bakugou to fall to the floor, chest shaking as he struggled to catch his breath. A small puddle of tears formed on the cement. His laughter was horrible. It sounded like a dog choking on a bone. Somewhere in the back of her mind, Ochako realized that this was the first time she had ever seen Bakugou laugh. She prayed she would never have to hear it again.\n\n\nAizawa rubbed his forehead with his pointer finger and thumb. Deku shoved his phone into his hands and Aizawa carefully began to read the page he pulled up.\n\n\n\n\n“Midoriya, this nerve shouldn’t be exposed.” Aizawa pointed out. “It also shouldn’t even feel pain. It’s just supposed to make two fingers on your hand move.” \n\n\n\n\nDeku vibrated with nervous energy. If he vibrated any faster, he would move faster than the speed of light and be able to walk through walls. “Hahahahahahaha. \n\nHa\n\n. Uh, funny story-”\n\n\nBakugou finally regained some composure and forced himself up. Small explosions sparked from his hands as he let out the occasional giggle. “He fucked up his arms so much that he- \n\nha- \n\nhe has it exposed now. IT’S BEEN- \n\nholy Shit-\n\n It’s been fucked up since we were kids.” Bakugou barely sputtered out before continuing his horrifying laugh.\n\n\nOchako couldn’t take it anymore. She jumped across the mat, releasing her quirk at the last possible second to tackle Deku in a bear hug that almost knocked him over.\n\n\n“Why does your body hate you?!” She sobbed into his shoulder.\n\n\n“I DON’T KNOW!”\n\n\n“Stop crying, you two.” Aizawa looked like he would rather be anywhere but here. “Midoriya, you say it’ll wear off in a few minutes? Go sit down until the pain is \n\ncompletely\n\n gone. Bakugou, stop laughing, you’re scaring Kamimari.”\n\n\n“Melissa!” Deku jumped to his feet, knocking his pile of books off of the table as he did so and crashed into his friend with a bone crushing hug. “Oh god, it’s been forever!”\n\n\n“Izuku! It’s so good to see you!” Melissa grinned. Her american accent was just as thick as Ochako remembered, and was delightful to hear. “I brought a new batch, just like you requested.”\n\n\n“Really?” Deku fist pumped so wildly he almost elbowed Hagakure in the face. “Oh thank goodness. I haven’t been able to buy any since-“\n\n\n“Since the Pro Hero SpiceBomb Incident.” Melissa and Deku said at the same time, before laughing. To anybody listening closely, their laughter would sound just on the wrong end of maninical. To anyone casually onlooking, it just sounded like two friends reunited. Until Melissa whipped out a sealed biohazard bag with a tub of what looked to be ordinary curry. \n\n\n“Do you have a spare microwave for this? I don’t want to accidentally contaminate anybody else’s food like last time.”\n\n\n“What happened last time?” Ochako followed the pair to the kitchen, curiously. Nervously. Anxiously. Melissa, Deku’s cousin, was a strange oddity that she had only met a few times outside of I-Island and any moment with her was entertaining. She reminded Ochako of a much more rational minded Mei Hatsume, and mentally noted to never put the two of them in the same room. The biohazard bag stared at her ominously. \n\n\n“I accidentally caused three quirked kids to get rashes on their faces when they cooked their instant ramen after I heated up my curry without a proper lid.” Melissa answered with her thick american accent and the casual swoop of a hand. \n\n\nThat’s right! Melissa was quirkless. But that still didn’t explain the biohazard bag. Ochako looked around desperately for an explanation, and got only a shrug from Deku.\n\n\n“I’m immune.”\n\n\n“Immune to what?” Tokoyami asked from on top of the fridge, causing them all to jump. His eyes widened.\n\n\n“Do not tell me… Is that the curry of the fruit of the Forbidden? The one said to bring pain to one's eyes just by glancing at it?”\n\n\n“If you mean Carolina Reapers, then yes?” Melissa answered with a bright smile. \n\n\nTokoyami awkwardly situated himself off of the fridge, before bowing deeply. “Ms Shield, I would be forever in your debt if you allow me a taste. I have not had so much a flake of flavor since the-“\n\n\n“The Pro Hero SpiceBomb Incident?” They all three said at once. Tokoyami nodded sadly. \n\n\n“Wait, you’ve had ghost peppers before?” Deku asked. “How? They kill anyone who isn't genetically-”\n\n\n“I am bird.”\n\n\n“Oh yeah.”\n\n\n“Does capsaicin not affect you? But that implies that not only does your bird biology affect your taste buds, but also that your body is equipped to deal with the-”\n\n\n“What are Carolina Reapers?” Ochako carefully inquired. She felt like she was imposing on some sort of sacred ritual. Maybe if she left now, she could keep whatever shred of dignity and preservation she had left. She carefully took a side step away from the biohazard bag.\n\n\n“NO!” Bakugou finally seemed to hear what they were talking about and finally exploded into the kitchen, knocking the table into the ceiling with a stray firecracker palm. “WE AGREED! ITS CHEATING!”\n\n\nDeku crossed his arms. “You said it was cheating. I never agreed to nothin’.” \n\n\n“Again, I have to ask, what are Carolina Reapers?” She asked Tokoyami, since Melissa was vibrating with excitement watching the curry circle in the microwave and Deku was currently being thrown into the kitchen cabinets. \n\n\nTokoyami took her hands into his own while Deku and Bakugou exploded. “Beware, Ms Uraraka. Fruit of the Forbidden Spice is not one for the casual. For the fated ghost peppers can kill a man if eaten unprepared.”\n\n\n“Are you telling me that THIS curry-“ Ochako pointed to the bag. Bakugou body slammed Deku into the table and accidentally broke three plates while doing so. “Is made out of peppers so hot it has killed people?”\n\n\n“It killed pro Hero SpiceBomb on live TV because he was foolishly unprepared.” Tokoyami nodded.\n\n\nShe shook her head, horrified. Deku threw Bakugou into the refrigerator. “Why on earth would you even eat that?”\n\n\n“Because me and Izuku are immune!” Melissa sang happily as she unwrapped the fated biohazard bag and stuck the inconspicuous tubberware into the microwave. She didn’t pop the lid. “And Tokoyami is a bird, so he shall receive a portion as well!”\n\n\n“I shall forever be in your debt, Dear Melissa.” \n\n\n“Yasee-“ Deku began, before Bakugou released another string of explosions in his face. “You see, ol’ Kacchan here-“\n\n\n“Do NOT ‘Kacchan’ me you dirty piece of shit cheater-“\n\n\n“CANNOT beat me in a spice off for this very reason.” Deku said proudly. “Because MY stomach is actually equipped to handle-“\n\n\n“SHUT UP SHUT UP SHUT UP-“\n\n\n“THE HOTTEST PEPPERS IN THE WORLD!” Deku used Bakugou as a battering ram against the kitchen door. Drywall fell to the floor as Bakugou released another string of explosions with an undignified yell, and Ochako made a mental note to leave an anonymous tip for Cementos to fix later.  \n\n\n“MICROWAVE COMPLETE!”\n\n\nTokoyami, Deku, and Melissa ascended on the tubberware like vultures to a carcass. Tokoyami didn’t even use a spoon, and just dug his face in like a bird pecking at the ground. Ochako could only look on, horrified. Bakugou glared at them from the ground.\n\n\n“Oh my god,” Deku cried.\n\n\n“Ahhhhhhhhhhhhh.” Melissa fanned her face. “God, I am dying.”\n\n\n“No wonder this is a banned substance in 34 countries.” Deku sobbed. “This is truly the worst experience of my life. What else is in this?”\n\n\n“Star Anise,” Melissa coughed. “Fellow quirkless friend said it helped bring out the spice more because after a few seconds-“\n\n\n“Oh noooooo,” Deku fell to the floor. “Oh I taste it now. It is somehow worse than before.”\n\n\n“It requires hot sauce.” Tokoyami remarked. A single tear fell from his eyes. From under his shirt, Dark Shadow screamed in agony. \n\n\n“Dirty cheater.” Bakugou scoffed. “That’s what you get for cheating.”\n\n\n“Kacchan, eating spicy food is supposed to be a pleasant experience,” Deku wailed. “I would only wish this fate upon Overhaul himself.”\n\n\n“Pleasant?” Ochako whispered to herself. Her spice tolerance was average. She would never consider spicy food pleasant, even if she ate nothing but. \n\n\n“And yet you eat it happily without even preparing a cup of water beforehand,” Bakugou spat. Deku was now twisting his body so he could pour water from the sink directly into his open mouth, and at least had the dignity to look guilty. \n\n\nA waft of spice hit Ochako’s nostrils and she reeled back in shock. She has faced down countless villains since coming to UA. She has been in battle and in hand to hand combat possibly a hundred times. She faced Overhaul’s minions with support from her peers and classmates, but otherwise without outside help. But no villain with a terrifying quirk has ever struck her with more fear than quirkless Melissa shoveling curry made of peppers so deadly it killed an unprepared Pro Hero famous for his spice tolerance on live TV. Deku was still guzzling water directly from the sink, Tokoyami’s quirk was crying in pain as he casually shoveled more into his mouth, and Melissa was handling the spice like a pro.\n\n\n“How on earth is this pleasant?”\n"
}