{
    "id": "27448672",
    "url": "https://archiveofourown.org/works/27448672?view_full_work=true",
    "author": [
        "sarahyyy"
    ],
    "title": "a rose by any other name",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "人渣反派自救系统 - 墨香铜臭 | The Scum Villain's Self-Saving System - Mòxiāng Tóngxiù"
    ],
    "relationships": [
        "Mobei-jun/Shang Qinghua"
    ],
    "characters": [
        "Shang Qinghua",
        "Mobei-jun"
    ],
    "additional_tags": [
        "Post-Canon",
        "Courtship",
        "Jealousy",
        "Getting Together",
        "Love Confessions"
    ],
    "language": "English",
    "series": "",
    "published": "2020-11-08",
    "completed": null,
    "words": "6,795",
    "chapters": "1/1",
    "comments": "376",
    "kudos": "12,780",
    "bookmarks": "2,925",
    "hits": "77,320",
    "summary": "<p>In the best of circumstances, Shang Qinghua wouldn’t have to be cursing all the choices that Luo Binghe makes, except Luo Binghe’s every move as the venerated ruler of the realm is so carefully observed and <i>emulated</i> by all the other demons.</p>\n<p>Luo Binghe takes a male consort? The demons watch and learn. </p>\n<p>Luo Binghe’s consort is a human cultivator? The demons are taking notes.</p>\n<p>Luo Binghe’s human consort is a Cang Qiong Peak Lord? The demons are frantically making checklists that would determine one’s suitability to be a consort, and <i>guess who ticks all the boxes</i>. </p>\n<p>(Or, the one where Shang Qinghua suddenly becomes Prime Demon Marriage Material™.)</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a>.)</p>\n<p>\n<b>bonus 1</b>\n</p>\n<p>MBJ, the next morning, striding into his throne room very smugly, with a very marked-up and very embarrased SQH in his arms: this lord has an announcement to make</p>\n<p>-</p>\n<p>\n<b>bonus 2</b>\n</p>\n<p>LBH: so.......lady baiyan and her entire spring court just met with harm suddenly and nobody knows what happened<br>MBJ: ah, yes, how tragic</p>\n<p>-</p>\n<p>\n<b>bonus 3</b>\n</p>\n<p>all the other demons, after mbj announces he will take sqh as his consort: well.......i guess there's still liu qingge?</p>\n<p>-</p>\n<p>\n<b>bonus 4</b>\n</p>\n<p>SQQ, the first time SQH tells him his name, cackling madly: <a href=\"https://sarah-yyy.tumblr.com/post/634245418042163200/hi-i-just-read-your-moshang-fic-and-i-loved-it-so\" rel=\"nofollow\">you're telling me your actual name is BEIDA</a>?!?!?! </p>\n<p>--</p>\n<p>As usual, I am <a href=\"https://sarah-yyy.tumblr.com/post/634198844933029888/a-rose-by-any-other-name-sarahyyy-%E4%BA%BA%E6%B8%A3%E5%8F%8D%E6%B4%BE%E8%87%AA%E6%95%91%E7%B3%BB%E7%BB%9F\" rel=\"nofollow\">here on tumblr</a>, come scream about Moshang! Moshang prompts tentatively open, but on a low-commitment, selective-ish basis!</p>",
    "text": "Half-human though Luo Binghe may be, there is little to no dispute over the superiority of his Heavenly Demon blood, when compared to the other demon lords of the realm. His ascension as the ruler of the demon realm is widely accepted by most. Of course, there will be some who will doubt his rule over the demon realm, but faced with dismally low probability of being able to defeat Luo Binghe in combat, Luo Binghe’s rule is essentially ironclad. \nShang Qinghua is okay with that, given that Mobei Jun has taken no issue with Luo Binghe’s rule. He is more than okay with that! He will never say so out loud for fear of his life being in jeopardy, he thinks of Luo Binghe as his son. Although this version of Luo Binghe is somewhat less badass than the original Luo Binghe he wrote, Shang Qinghua is still happy that Luo Binghe is getting the recognition that he deserves in the demon realm. \nPlus, it cracks him up inside every single time when low-ranking demons throw themselves at Shen Qingqiu’s feet to greet him as the Saintly Ruler’s Honourable Consort. It is always very entertaining to watch the vein that pulses at Shen Qingqiu’s temple whenever that happens.\nAnyway! The point is, demon realm politics has no real bearing on Shang Qinghua’s life, given that he is safe and well-protected by Mobei Jun (and low-key by association to the Saintly Ruler’s Honourable Consort), and, in the best of circumstances, he wouldn’t have to be cursing all the choices that Luo Binghe makes, except Luo Binghe’s every move as the venerated ruler of the realm is so carefully observed and emulated by all the other demons.\nLuo Binghe takes a male consort? The demons watch and learn. \nLuo Binghe’s consort is a human cultivator? The demons are taking notes.\nLuo Binghe’s human consort is a Cang Qiong Peak Lord? The demons are frantically making checklists that would determine one’s suitability to be a consort, and guess who ticks all the boxes. \nShang Qinghua! Shang Qinghua who has never been considered a catch in both his lives is now suddenly Prime Demon Marriage Material™ thanks to Luo Binghe and the standards that he has apparently set for a spouse! \nDemons want to court him! Many demons! \nThe braver demons have skipped past the courting stage, and have delivered proposals directly to him! He’s getting marriage proposals! Again, from many demons! \nHe almost tripped on a step one day, and fifteen demons came rushing to his aid! He rubbed at his temples one day when Mobei Jun was holding court, and that same night, a visiting dignitary presented him with the cure-all heart of a demonfire hawk (one of the scant four that were living in the North, what the fuck) that was traditionally used by healers for critical healing, like, you know, regenerating limbs! He’s pretty sure that if he were to sneeze, at least half of Mobei Jun’s court would undress immediately to offer their clothes to keep him warm! \nShang Qinghua doesn’t want this! He’s supposed to be cannon fodder! Post-epilogue, he’s supposed to be able to live a chill as fuck life! Yeah, perhaps he still has duties at An Ding Peak, and sure he has to run Mobei Jun’s palace for him, but it’s a comparatively chill life! He’s doing the things that he’s good at doing, and he does them timely and well enough that nobody bothers him! \nAnd most importantly! He’s supposed to be safe! There is supposed to be no trouble targeted at him! Isn’t that the whole point of being a side character, of being this side character in particular?\nInstead, because of Luo Binghe’s undying love and affection for Shen Qingqiu, Shang Qinghua is left to fend off proposals left, right and centre!\nIn the few weeks since the demon realm has collectively decided that Shang Qinghua is the most desirable husband to-be in the realm, Shang Qinghua’s already had to deal with: one terrible accusation of him trying to seduce the Saintly Ruler’s Honourable Consort that Luo Binghe had (thankfully) only seemed entertained by, two terrible “if I can’t have you, nobody else will”-induced attempts on his life that he had thwarted thanks to his godlike knowledge of all commonly used poisons in this universe, upwards of thirteen different (also terrible) plots to frame him for a thing he did not do so that he will lose favour with Mobei Jun that his king had graciously ignored, and more challenges to a physical combat to win his hand in marriage than he knows what to deal with! \nAnd that’s not even the worst thing! The worst thing is that ever since this whole thing started, Mobei Jun has started scowling excessively! Which is absolutely a terrible sign, considering how much he likes to keep emotions inside, instead of visually displaying them for all to see and interpret! \nShang Qinghua doesn’t blame him for his ire. After all, his literal job is reconnaissance. His one skill is information-gathering, and his one advantage is that no-one really pays attention to him while he eavesdrops (sometimes very obviously) in the background. \nBut now! \nHe’s the center of attention no matter where he is! He can’t linger by to listen in on anyone’s conversation, because as soon as anyone even senses that he’s close by, they’ll want to talk to Shang Qinghua, to compliment him on inane things like his eyelashes and the colour of his robes, and ask if he would like to take a walk somewhere more private so that they can show off their skill sets in areas that Shang Qinghua really does not want to be privy to!\nAnd!\nThere are repercussions to rejecting a proposal! \nShang Qinghua is intrinsically associated with Mobei Jun. If he rejects a marriage proposal from one of Mobei Jun’s trade partners, they may retaliate to force Mobei Jun to demand that Shang Qinghua accept their proposal, or stop trading with the North altogether. Faced with those choices, Shang Qinghua cannot imagine that Mobei Jun will not want to just boot him out of the Northern Palace, and marry him to some demon lord, but it’s not like Mobei Jun can pick one of the demon lords over another! That would cause a riot! \nOf course Mobei Jun is upset! Shang Qinghua’s predicament is causing Mobei Jun much unnecessary trouble. It’s probably a matter of time before Mobei Jun decides to either 1) cut all ties with Shang Qinghua by kicking Shang Qinghua out of his very nice temperature-controlled guest room that he has gotten too used to sleeping in because it feels exactly like sleeping with the AC on, or 2) kill Shang Qinghua to stop all the fighting over him. \nIf Shang Qinghua must make a choice between the two, he will be a very firm proponent of the former. Not that he ever hopes that he will have to make such a choice! Because his king is a good and gracious king!\nHe keeps telling himself that as he watches two of Mobei Jun’s most trusted cousins fighting over Shang Qinghua. At the rate they’re going, they’ll soon come to blows, and Shang Qinghua knows that after the whole Linguang Jun saga, Mobei Jun hates infighting the most. \n“Generals,” Shang Qinghua tries, “this lowly servant does not deserve-”\nNeither of them are listening to him, too busy trying to one-up the other by listing out their achievements.\nShang Qinghua sighs. This is mostly Shen Qingqiu’s fault! If he hadn’t seduced Luo Binghe with his inherent goodness or whatever it is that they’re calling it, then Shang Qinghua wouldn’t be in this position! How can demons be fighting over him?! Have they seen him? He’s mediocre at everything at best! All he knows how to do is to hug Mobei Jun’s thighs! Sure, he’s alright looking, but is that really enough to compensate for his personality? Shang Qinghua thinks not! \nHe’s so engrossed in his thoughts that he only snaps out of it when one of Mobei Jun’s cousins touches his shoulder. It’s the taller, leaner one that Shang Qinghua recognises as the newly appointed head of the branch of the Mobei clan that resides east of the Frost Forrest. Xianwu Jun, titled after his martial prowess that had received even Mobei Jun’s nod of approval.\n“Peak Lord Shang,” Xianwu Jun says. “Fret not, for I shall return victorious.”\nShang Qinghua blinks. “What?” \nThe other cousin, Zheyi Jun of the same branch of the clan, albeit less decorated compared to Xianwu Jun, elbows Xianwu Jun out of the way. “Peak Lord Shang,” he says, fierce in his conviction, “I will snap Xianwu Jun’s neck clean off his head in our duel, and present it to you to cement our engagement.”\n\nWhat?!\n\nThe both of them storm off in the direction of the southern courtyard before Shang Qinghua is even able to make an objection. \nFuck. \nThis is a situation that calls for intervention. \n--\nShang Qinghua finds Mobei Jun in the armoury, where one of the lower-level demons has brought him to inspect some new weapons that had been presented to Shang Qinghua as courting gifts, and had been regifted to Mobei Jun by Shang Qinghua instead, because what the fuck was he supposed to do with a golden axe twice his weight that he cannot lift?\n“My king!” Shang Qinghua cries out. “My king, you need to go to the southern courtyard! Xianwu Jun and Zheyi Jun are duelling!” \nMobei Jun doesn’t look away from where he’s inspecting the golden axe in his hands. “Let them,” he says easily. “If Zheyi Jun can defeat Xianwu Jun, he deserves Xianwu Jun’s position.” \n“That’s not what they’re duelling over!” Shang Qinghua says hurriedly. “They’re duelling over me! Zheyi Jun wants to present Xianwu Jun’s head to cement our engagement! My king! This is madness!” \nMobei Jun finally looks at him. “Did you say you would marry Zheyi Jun?” he asks, eyes narrowed.\n“No!” Shang Qinghua yells. “Why would I want to marry Zheyi Jun?”\n“And Xianwu Jun?” Mobei Jun asks.\n“Not him either!” Shang Qinghua tells Mobei Jun. “My king, I don’t want to marry any of your cousins. Can we please have this conversation after you stop Xianwu Jun and Zheyi Jun from unnecessarily killing each other over me?” \nIf one of them really does end up killing the other over Shang Qinghua, to preserve the peace in the clan, Mobei Jun will probably have to order Shang Qinghua to marry the victor. \nMobei Jun tosses the golden axe aside carelessly, and makes his way to Shang Qinghua. He holds out his arm, and Shang Qinghua clutches at it quickly, before closing his eyes tightly. Teleporting with Mobei Jun always makes him mildly dizzy, but they have to get to the duelling generals quickly, and beggars really can’t be choosers. \nXianwu Jun and Zheyi Jun are in the middle of their duel when Mobei Jun and Shang Qinghua materialise in the courtyard. Already, Zheyi Jun is bleeding, but Xianwu Jun’s weapon of choice seems to have taken some serious damage, so it’s really still all up in the air as to who might win the fight if it continues. \nShang Qinghua tugs at Mobei Jun’s sleeve when Mobei Jun doesn’t make a move to break the fight. “My king?” \nMobei Jun drops the temperature in the courtyard so suddenly that both generals stop fighting almost immediately. \n“Mobei Jun,” the both of them greet, bowing their heads in deference to Mobei Jun’s authority. \n“There will be no duelling over Shang Qinghua,” Mobei Jun declares. “He has already chosen.” \nShang Qinghua, who was in the middle of nodding along to Mobei Jun’s words, freezes. He’s already what now?\nXianwu Jun straightens up, and glances at Zheyi Jun, smug. “No doubt Peak Lord Shang has chosen wisely.” \n“He has,” Mobei Jun says. “He has chosen this Mobei Jun.” \nThe silence that ensues is deafening. \nShang Qinghua stares at Mobei Jun.\nMobei Jun looks on at Xianwu Jun and Zheyi Jun. “This lord is willing to duel to assert his claim. Which one of you wishes to fight me?” \nZheyi Jun is the first to break the silence. “We have caused much offence, Mobei Jun,” he says. “There was no announcement-”\n“I will make an announcement when the timing suits me,” Mobei Jun says. “Is there a problem with that?” \nBoth generals shake their heads. \n“Good.” Mobei Jun wraps an arm around Shang Qinghua’s waist. “I do not wish to hear a word of this outside this courtyard.” \n“Yes, Mobei Jun,” both generals say in unison. \n“Close your eyes,” Mobei Jun tells Shang Qinghua, and then takes them back to the study. \n“That was…” Shang Qinghua wobbles a little on his feet, and Mobei Jun helps to steady him. “That was genius, my king!”\nMobei Jun really just sorted the whole issue out like that! No fighting! No Shang Qinghua stammering over how he isn’t worthy of anyone’s affections! Shang Qinghua would never have been able to deal with this problem so elegantly himself, mostly because he would never dare to suggest that Mobei Jun had laid prior claim on him. \nShang Qinghua gives himself a mental pat on the back. He really did so well designing Mobei Jun. Brains! Brawn! And looks!\nMobei Jun nods. “Next time, deal with it yourself.”\n“The same way?” Shang Qinghua asks hopefully. He can’t just go around telling everyone that he’s chosen to be with Mobei Jun without Mobei Jun’s permission, right? \nMobei Jun elects not to respond, turning to leave the study. \n“My king?” Shang Qinghua calls out after him. “Can I deal with it the same way next time? My king? My king!” \nMobei Jun doesn’t reply.\n--\nTo be fair, Shang Qinghua deals with most of the other courtship/marriage proposals that are less likely to cause political dissonance in Mobei Jun’s court himself pretty well. \nLower-ranking members of the demon realm are easier let down by claiming that his sect has strict requirements in the kind of spouse that he chooses, and that he’s afraid that they do not meet those standards yet. More than one of the younger demons had been disappointed but strangely motivated by Shang Qinghua’s rejection, and had vowed to try again in a few years if Shang Qinghua was still single then. It was...sweet to watch, and it wasn’t like Shang Qinghua could discourage them from training harder, right? \nFor mid-to-high ranking demons, Shang Qinghua enjoys setting impossible tasks. \n“Bring me the poisonous claw of a le-matya,” he says to one demon lord or another’s most favoured son when he had presented himself at Mobei Jun’s court after travelling for days to get to the North. “There is only one such beast in the whole of this universe. You will only be able to incapacitate the beast with a move called the Vulcan nerve-pinch. Alas, even I do not know where this beast resides, or how this nerve-pinch is carried out! But if you bring to me the claw of a le-matya, it will prove to me that not only are we intellectually compatible, but that you are also capable of protecting me. I will surely marry you, in that case!” \nMobei Jun gives him a long look when he catches Shang Qinghua’s eye, and Shang Qinghua flashes him a sheepish smile, so sure that Mobei Jun could smell his lie from a mile away. \nMobei Jun disappears for close to a month after that, likely because it was prime time to take a vacation. After all, there is nothing much that Mobei Jun has to do, since most who presented themselves in his court these days were only there to ask for Shang Qinghua’s hand. It’s annoying! Of course, Mobei Jun would want a holiday, given the circumstances. \n(Mobei Jun returns in worse spirits than when he left, but Shang Qinghua is too busy responding to written courtship proposals that he doesn’t even realise that Mobei Jun had returned until his mood shifts back to something more neutral.)\nThe point is, Shang Qinghua actually takes care of matters quite well, and everything actually goes pretty smoothly for a couple of months, until Mobei Jun is invited to the West. \n--\nThe flower demons rule the West. \nThis was not always so. Lady Baiyan, first of her rule, had ruthlessly seduced (and murdered!) her way into this position, and has kept a stronghold in the West for several years now. In the original novel, Luo Binghe papapas his way into Lady Baiyan’s heart, easily taking rule of the West for himself. \nLady Baiyan was not someone who could be appeased by several (incredible) sessions in bed, however, and had tried to retake control over the West from Luo Binghe. The ensuing fight was one of the scenes that he personally enjoyed writing the most, even if they had both been naked during the fight (it’s what the paying audience wants to read!), and Shang Qinghua had to spend a significant part of his total word count for that chapter describing her bosoms as they bounced during the fight. \nLady Baiyan is one of the feistier characters of Luo Binghe’s harem in the original novel, and Shang Qinghua had always thought that she deserved better than the ending that he wrote for her wherein Luo Binghe papapa-ed her one last time before sending her to her death. \n(Again, he would like to repeat that he has to write what the paying audience wants to read!) \nAnyway! The point is that Shang Qinghua all but begs for Mobei Jun to take him along for the trip, and Mobei Jun eventually relents, probably because Shang Qinghua was starting to get on his nerves with all the unsubtle hints that he was directing at Mobei Jun’s way that he really, really, really wanted to go with Mobei Jun.\nThis will turn out to be Shang Qinghua’s first biggest mistake, because Lady Baiyan takes one look at him, and flowers visibly start blooming in her hair. \nMobei Jun pulls Shang Qinghua closer to his side. “She’s posturing,” Mobei Jun hisses. “She likes you.” \nShang Qinghua gulps, and shifts closer to Mobei Jun. \nIn the original novel, Lady Baiyan had fallen for Luo Binghe’s beguilingly innocent looks! Shang Qinghua should have expected something like this would happen, considering that he’s operating off the worst luck known to humankind recently. \nShe is objectively speaking, a very attractive demon! Shang Qinghua had written her to be petite but curvaceous in a manner that Cucumber Bro had once described as “against the fucking laws of physics, you hack of a writer”, with delicate features that belied her skills in combat. What was it that Lady Baiyan had done when Luo Binghe refuted her advances when he found his next wife? She’d tried to kill him by ripping his heart out with vines that shoot out from her wrists (Spiderman was airing in the cinemas when he was writing this chapter, sue him). \nLuo Binghe was too OP for that move to even hurt him, but Shang Qinghua? Lady Baiyan could definitely crush his heart with her vines if she wanted to.\n“My king,” he whispers, tugging at Mobei Jun’s cloak, as they advance towards Lady Baiyan, “help?” \n“You were the one who wanted to come,” Mobei Jun says. And then, quietly, “Stay by my side. Don’t go anywhere without me.”\nShang Qinghua clutches tighter at Mobei Jun’s cloak. “Yes, my king!” \n“Mobei Jun,” Lady Baiyan greets when they stand before her, “welcome to the Spring Court.”\n“Lady Baiyan,” Mobei Jun returns.\nLady Baiyan’s gaze turns to Shang Qinghua, and her smile grows. “And how lovely of you to bring Peak Lord Shang with you to my court,” Lady Baiyan purrs. \nShe reaches out to touch Shang Qinghua, and Shang Qinghua tugs at Mobei Jun’s cloak in a clear cry for help. He’s her creator! He knows better than to let her touch him, knowing that she can eject toxins into his skin that can only be neutralised by copious papapa with her! \n“Of course,” Mobei Jun says easily, stepping in between Lady Baiyan and Shang Qinghua. He waits for her to drop her outstretched hand before he continues, “It is not often that this lord is comfortable travelling without his Shang Qinghua.”\nLady Baiyan’s frown does not go unnoticed, given that it is also paired with the fact that the flowers in her hair turn a dangerous shade of red. “Everyone knows Peak Lord Shang is unmated,” she says, almost petulant. “Just yesterday he issued challenges for his suitors.” \n“This lord is courting,” Mobei Jun concedes.\nLady Baiyan smiles again, at that. “Well, then, all is fair in courtship, is it not, Mobei Jun?” she asks. “I have been told that I am very good with my words, something I hear is important to Peak Lord Shang?” \nMobei Jun is silent for a long moment. \nShang Qinghua watches the smile on Lady Baiyan’s face grow and grow, and wonders what expression Mobei Jun is sporting. Surely his king will have the good sense to at least not look like he’s about to throw up just from the thought of fake-dating Shang Qinghua! \n“Perhaps,” he says bravely, and steps out from where he’s hiding behind Mobei Jun, “it would be best to talk business first? We have come with gifts from the North as a show of goodwill.” He gestures for the retinue of demons behind them to bring forth the items. \nLady Baiyan turns to regard Shang Qinghua. “Beautiful and useful,” she comments, not even glancing at the items offered to her. She looks almost like she wants to reach out to touch Shang Qinghua again, but restrains herself. “Just how I like my gifts.”\nShang Qinghua barely suppresses a shiver at the temperature drop in the room, but all Lady Baiyan does is to laugh.\n--\nShang Qinghua gets assigned a room at the far end of the guest quarters, as far as he can be allocated away from Mobei Jun. \nTo counter Lady Baiyan’s move, Mobei Jun moves Shang Qinghua into his own room. \n“Do not go anywhere without me,” Mobei Jun says again to Shang Qinghua, as he undresses for bed. “Junshang wants the West and the North to retain good relations. If Lady Baiyan’s interest in you gets in the way of that, you’ll have to take care of it yourself.”\nThere is little irritation in Mobei Jun’s voice, so Shang Qinghua knows he’s not too annoyed by the whole thing. He probably enjoyed going head-to-head against Lady Baiyan earlier today. \nHmm… Perhaps he should try to matchmake Mobei Jun and Lady Baiyan? In the original novel, she only had her eye on Luo Binghe, because Luo Binghe was well, Luo Binghe. But now that Luo Binghe is definitely out of the question, perhaps Lady Baiyan would consider Mobei Jun? It would do well for the relations between the West and the North, and also work to solve this problem of Shang Qinghua’s. If Lady Baiyan turns her gaze onto Mobei Jun instead, Shang Qinghua will be free! \nHe casually turns to Mobei Jun. “My king?” \nMobei Jun glances at him. \n“What do you think of Lady Baiyan?” Shang Qinghua asks. “She is quite beautiful, is she not?”\nMobei Jun’s brows furrow, just slightly. “Do you return her interest?” he demands. \n“What? No!” Shang Qinghua says quickly. “I was thinking she might make a good consort for you?” \nMobei Jun is quiet for a beat. Two. Three. \n“Foolish,” he ends up saying, but there’s no heat in his tone. He holds out a silver comb to Shang Qinghua. “If you have time to think about foolish things, you have time to attend to your king.” \n“Yes, my king,” Shang Qinghua says, and works on combing Mobei Jun’s hair out. “My king is not interested in Lady Baiyan?”\n“No,” Mobei Jun says. \nAlright, then! If Mobei Jun doesn’t like Lady Baiyan, Shang Qinghua is definitely not going to push the both of them together just so he can escape Lady Baiyan’s clutches. He’s more or less sure that he’s safe by Mobei Jun’s side anyway, so it’s just the matter of steering clear away from Lady Baiyan for the five days they’re meant to be here! \nHis heart lightens at that thought, inexplicably. \n“Shang Qinghua,” Mobei Jun says, a long moment later. He seems to have relaxed into the soothing motions of Shang Qinghua combing his hair. “Do you want to marry any of these suitors of yours?” \nShang Qinghua makes a face. “Of course not, my king.”\n“But you do not refuse them,” Mobei Jun says. “You set tasks for them to accomplish. It appears to this lord that you are waiting for someone capable enough to win you over.”\nShang Qinghua lets out a soft snort at that. “My king,” he says, setting the comb down, “surely you’ll have picked up by now that none of those tasks can be accomplished. They’re not real tasks. Some of the objects or creatures I’ve asked for don’t even exist.” \nMobei Jun turns to look at him. “The le-matya?” \n“Fictional,” Shang Qinghua says, thinking back about his Star Trek phase. He did so very much have a thing for Spock, back then.\n“Fictional,” Mobei Jun echoes. \nShang Qinghua nods. “I thought you, out of everyone else, would know,” he says. “If all the things I asked for were truly as useful or as important to me as I made them out to be, would I have not asked for them from you, my king?” \nMobei Jun’s demon mark glows a faint blue. “Shang Qinghua,” he says, “what are you looking for in a spouse, if not someone capable?” \nShang Qinghua blinks, surprised at the question. “I, uh,” he says, cheeks heating. “I always fancied that I would marry for love, my king.” \nMobei Jun’s gaze sharpens. “For love?” \nShang Qinghua swallows. “Is that a very foolish notion, my king?” \nIt must be, considering how surprised Mobei Jun looks. Shang Qinghua is well, Shang Qinghua. He’s mediocre in everything, and comes with a surprising amount of emotional baggage. Who could be capable of loving him? \nHe’s just about to try to laugh the whole thing off when Mobei Jun says, “No.”\n“No?” \n“No,” Mobei Jun repeats, voice soft. “It’s not a foolish notion.” \n--\nLater in the night, despite Shang Qinghua’s best protests that he is fine sleeping on the floor, Mobei Jun stares him down until he climbs into bed with Mobei Jun. Which is fine! Probably! It’s a large bed, and reasonably speaking, they can each have one side of the bed, and still have enough to fit a couple of-\nNope, okay, Mobei Jun is tugging Shang Qinghua into his arms, pressing himself snug against Shang Qinghua’s back, so nope, it doesn’t look like they’re splitting the bed down the middle.\n“My king?” Shang Qinghua asks shakily. \n“Lady Baiyan will not force you, because she thinks I’m also courting you,” Mobei Jun says. “If she were to find out that I made you sleep on the floor, you’ll be spending a night in her bed instead tomorrow.” \nShang Qinghua lets out a squeak at the thought. \n“Stay by my side,” Mobei Jun says again, draping one chilly arm around Shang Qinghua’s waist. “Do not go anywhere without me.”\nShang Qinghua nods. “I’ll stick to you like glue,” he promises.\n“Glue?” \nShang Qinghua wracks his head for a comparison. “You know the nine-headed snakes you slayed for me some weeks ago?” \n“The xiangliu,” Mobei Jun says.\n“Yes,” Shang Qinghua agrees. “You know how we needed their saliva because of how solid it became when it turned dry, and it really helped with construction of your eastern wing?” He feels Mobei Jun nod against him. “That’s what glue is like. I’ll stick to you like the saliva of a xiangliu. You won’t be able to shake me off.”\n“Good,” Mobei Jun decides. “Go to sleep, Shang Qinghua.” \nShang Qinghua does. \n--\n“Peak Lord Shang,” Lady Baiyan says one night, during the customary dinner banquet, “may I call you by your name from now?” \n“You may not,” Mobei Jun says, before Shang Qinghua can even start sweating over how to say no. His king really is too good to have by his side! “Shang Qinghua will be addressed in a manner befitting of his position.” \nLady Baiyan pouts. “Mobei Jun calls you by your name,” she says. \n“My king need not show me deference,” Shang Qinghua’s mouth says before his brain has had a chance to parse his words through. “He is my king.”\nLady Baiyan’s eyes flash with something that seems distinctively unfriendly and dangerous. \nShang Qinghua considers his words, and almost winces. “Not that I meant that Lady Baiyan would need to show me deference!” he hurries to say. “I just meant… I served my king long before I became a peak lord, and there’s no need for him to trouble himself with addressing me by anything other than my name, when we’re both so used to him calling me Shang Qinghua.”\nLady Baiyan hums. “It is no trouble to me to change the way I address you,” she says. “I would like the liberty of calling you by your name, now that I am courting you.” \nShang Qinghua turns to look at Mobei Jun for help. He’s talked himself into a corner where he cannot say no without offending Lady Baiyan. He also doesn’t want to say yes, and risk Lady Baiyan thinking that he’s agreeable to her advances. \n“Liberties are earned, Lady Baiyan, when it comes to Shang Qinghua,” Mobei Jun says. “You are aware he likes issuing challenges?” \nLady Baiyan leans back in her seat. “I do like a challenge,” she concedes. “Tell me what I can do to earn the right to call you mine, Peak Lord Shang.” \nRight. An impossible challenge. Shang Qinghua can do that. \n“I have been known by many names,” Shang Qinghua starts gingerly, trying to process his thoughts as he goes. Lady Baiyan doesn’t look like someone who will give in easily, and she is definitely one of those demons who will go apeshit if she realises that Shang Qinghua has duped her into accepting an impossible challenge. This one must be something that she cannot achieve, but not an impossible task on its own. “But there is one I hold dear to my heart. A name I gave up a long time ago. Call it, and I am yours.”\n--\n“Is this also an impossible task?” Mobei Jun asks in the quiet of the night. He has chosen not to hold Shang Qinghua today. Instead they lay side by side, close enough that their arms brush. “Something made up?”\nShang Qinghua’s lips lift, just a little. “Not quite,” he admits. “Although, there are only two people in this world who know it. One of them is fiercely guarded by Luo Binghe, and I am fiercely guarded by you. An impossible task for Lady Baiyan, essentially.” \nMobei Jun is quiet for a long while. “It is something that can be done,” he says. “A valid challenge.”\n“She’d rip me apart if I’d just made something up, and she found out that it couldn’t ever be done,” Shang Qinghua says. “And you were the one who told me to keep the relations between the West and the North in mind.”\n“Your challenges before,” Mobei Jun says, “they were open to all who were within hearing distance. Is this the same for this one?” \nShang Qinghua recalls that particular rule. He’d only really come up with it to avoid him having to come up with individual challenges for each suitor who came to Mobei Jun’s court for his hand in marriage. He’s only one measly author! There are limits to what he can come up with within a day! \nBut why does it matter now? The challenge is, in essence, for Lady Baiyan. None of her courtiers would dare to try to sneak one over her, knowing that their ladyship has her eyes on Shang Qinghua. It’s like how once Mobei Jun called dibs on Shang Qinghua with his cousins, none in the Mobei clan ever tried to pull the same stunt! \n“Shang Qinghua,” Mobei Jun says insistently. “Is it the same for this one?” \n“Sure,” Shang Qinghua says. \n--\nMobei Jun is not in bed when Shang Qinghua wakes up the next morning. A quick check-in with the elk demon standing guard outside their room tells him that Mobei Jun has asked for an emergency audience with Luo Binghe. \nShang Qinghua frowns. “Do you know what the matter is about?”\nThe elk demon shakes her head. “Mobei Jun did not say, but it seemed important to him.”\n“What is on the itinerary today?” he asks. \n“The tour to the fox demons’ sanctuary. That is scheduled for late morning, probably so that you may take your afternoon meal with the head of the fox demons,” the elk demon reports. “There is nothing after the tour, just the dinner banquet, as usual.” \nShang Qinghua nods. Nothing that would specifically require Mobei Jun’s presence, though the fox demons may take offence that Mobei Jun had chosen not to visit. Shang Qinghua will have to be extra accommodating to ensure they do not feel slighted. \nDespite Mobei Jun’s absence, the day passes by quite pleasantly. \nThe patriarch of the fox demon tribe seems to be a nice, jovial man, and the pride in his eyes as he shows off the sanctuary that they’ve built under Lady Baiyan’s rule is evident. The patriarch waves Shang Qinghua off when he attempts to apologise for Mobei Jun’s absence. \n“We are honoured that he has sent you in his place,” the patriarch says. \nAs the elk demon projects, Shang Qinghua is invited to share a private meal with the patriarch and his immediate family before the end of his visit. Shang Qinghua accepts the invitation easily, charmed by the easygoing nature of the patriarch, and the fox demon tribe in general. \nHe leaves his guards outside the room. This is his second biggest mistake. \nHe is two sips into the plum blossom wine that he has been offered, when he starts to feel a strange burning in his gut. He drops the wine cup quickly, and turns to stare at the patriarch. “You-”\nThe patriarch, to his credit, looks apologetic. “Lady Baiyan has my daughter,” he confesses. “She has asked for a trade. Your name, the one you hide, for my daughter. Tell me what it is.”\nLike hell he is going to tell him anything!\nThe burning sensation spreads from his gut up his airways. Shang Qinghua chokes. “What have you done to me?” he demands. \n“It’s just a truth serum. It will stop hurting if you give me the answer I’m looking for,” the patriarch tells him. “I don’t want to hurt you, Peak Lord Shang. I just want my daughter back.” He grabs Shang Qinghua’s hand in his. “Tell me your name,” he says again.\nShang Qinghua forces his mouth shut, despite the tightening of his throat, and the burn he can feel. \nFox demon. Truth serum. When had he written this before, and how long does the serum remain in effect for? Can Shang Qinghua wait it out? He is exceptionally good at withstanding pain! Perhaps he will be able to just work through it! Or can he expel the serum with his qi? Why the hell did he write about so many goddamn fox demons? How is he supposed to remember important details in his stupid novel under pressure this way? \n“Peak Lord Shang,” the patriarch pleads, “please don’t fight it. It hurts when you do.”\n“I’d rather die,” Shang Qinghua grits out, “than to tell you.”\nThe patriarch closes his eyes. “I gave you a choice,” he says quietly, and oh no, that doesn’t sound good, that sounds like he’s planning to do something a lot worse than whatever he’s already doing. \nBefore the patriarch can say anything, Shang Qinghua channels as much spiritual energy as he can manage into himself, and yells, “MY KING!” \nHe keeps count in his head. His king has never let him wait too long. \nOne. \nTwo.\nThree.\nFour.\nFive.\nAnd Mobei Jun has materialised into the hut, face darkening when he sees Shang Qinghua bowled over from pain. He strides towards the trembling patriarch, and says, “You have three seconds before I destroy everything in this village.”\nRather anti-climatically, the patriarch hands the antidote to Mobei Jun, before scurrying out of the hut with his wife and sons. \nMobei Jun hurries to Shang Qinghua the moment the patriarch is gone, and feeds the antidote to him. \nThe pain subsides. Oh, good! A fast-acting antidote! \n“I told you not to go anywhere without me,” Mobei Jun growls. He looks furious. At Shang Qinghua! The victim! \n“You were the one who left without saying anything to me!” Shang Qinghua wheezes. “This visit was pre-planned! What was I supposed to do? Not come? How could I do that without your permission?” The more he thinks about it, the more unfair he thinks it is that Mobei Jun is directing his anger at Shang Qinghua. He doesn’t even realise that he’s started tearing up until the tears that have welled up in his eyes overflow. “Where even were you? How could I not go anywhere without you, if you won’t take me with you when you go away?” \nMobei Jun’s lips part in surprise at Shang Qinghua’s tirade. \nShang Qinghua takes one look at him, and then starts crying properly. He’s not even really sure why he’s crying. He just feels…terrible. He doesn’t want to be the victim of weird assassination plots, or the apparent dream husband of every single demon in the realm. He just wants to go back home to the Northern Palace, and he wants his peace and quiet back. \nMobei Jun reaches out with gentle hands to tug Shang Qinghua into his arms. “This Mobei Jun apologises,” he says quietly. “I should not have left you alone. I was supposed to guard you. Fiercely. That was what you were counting on.”\n“It was!” Shang Qinghua sobs. \nMobei Jun strokes a hand down his back. “I went to see Peak Lord Shen,” he confesses. “I...wished to know your name. The one you gave up. The one you hold dear.”\nShang Qinghua pulls away from Mobei Jun, just far enough to peer up at him. “What?” \nIt sounds a lot like… \nBut surely it can’t be…\n“I tried all the challenges before, too,” Mobei Jun says quietly. “The hunt for the le-matya. The search for the yinhufu. I didn’t even know what the Forcesaber looked like, but I searched for that, too.” He draws in a deep breath. “I wanted to complete a challenge you set, any challenge you set.” \nShang Qinghua swallows. His heart is beating so quickly in his chest, he’s almost sure he’s about to have a heart attack. “Why?” \n“This Mobei Jun wishes to marry you,” Mobei Jun says, and Shang Qinghua swears his heart stops beating. “I know you wanted to marry for love, but you set a valid challenge this time, and I had to try.” His voice is very soft and very vulnerable when he says, “I also wish to marry for love.” \n“Did he tell you?” Shang Qinghua asks, after a long pause wherein he tries to convince himself that he hasn’t transmigrated (again) into a weird(er) universe. When Mobei Jun looks at him in confusion, he clarifies, “Did Shen Qingqiu tell you my name?”\nMobei Jun’s gaze drops. \nAh, Cucumber Bro is truly ride-or-die for him, huh? Shang Qinghua is going to forcibly subject him to at least one hug, the next time they meet. \n“Why did you go to Shen Qingqiu?” Shang Qinghua asks. “There are two people who know.”\nMobei Jun’s gaze snaps back up to him. There is something soft in his gaze, something that makes Shang Qinghua’s breath catch. Mobei Jun wants to marry for love. He wants to marry Shang Qinghua. Mobei Jun loves him. He loves him. \n“Are you suggesting that you would tell me if I asked?” Mobei Jun asks. \nShang Qinghua smiles. Ah, he’s always had a soft-spot for his Mobei Jun. “Let’s go home, my king?” he murmurs, suddenly glad he’s not a flower demon. No doubt flowers would be blooming everywhere, if he were, in light of recent events. “You can ask me back at home.”"
}