{
    "id": "27468511",
    "url": "https://archiveofourown.org/works/27468511?view_full_work=true",
    "author": [
        "OHai_Here"
    ],
    "title": "How To Finish Your Bucket List Before You Die- A Guide From Kaeya Alberich",
    "rating": "Mature",
    "archive_warnings": [
        "Graphic Depictions Of Violence",
        "Major Character Death"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "原神 | Genshin Impact (Video Game)"
    ],
    "relationships": [
        "Kaeya & Klee (Genshin Impact)",
        "Diluc & Kaeya (Genshin Impact)"
    ],
    "characters": [
        "Kaeya (Genshin Impact)",
        "Khaenri'ah (Genshin Impact) - Character",
        "Kaeya's Mother (Genshin Immpact)",
        "Kaeya's Father (Genshin Impact)",
        "Klee (Genshin Impact)",
        "Razor (Genshin Impact)",
        "Diluc (Genshin Impact)",
        "Jean (Genshin Impact)",
        "Yanwang Dijun | Rex Lapis",
        "Venti (Genshin Impact)"
    ],
    "additional_tags": [
        "Alternate Universe - Canon Divergence",
        "Suicide",
        "Graphic Description",
        "Mental Health Issues",
        "wait is it suicide if he's already dead.....",
        "Major Character Injury",
        "Aftermath",
        "Resurrection",
        "kind of",
        "Assisted Suicide",
        "Khaenri'ah lore and headcanons",
        "Angst",
        "Not enough angst in the tag",
        "throws some in and stirs the pot"
    ],
    "language": "English",
    "series": "",
    "published": "2020-11-09",
    "completed": "2023-02-12",
    "words": "9,999",
    "chapters": "5/5",
    "comments": "1,161",
    "kudos": "18,644",
    "bookmarks": "3,640",
    "hits": "278,810",
    "summary": "<p>Kaeya makes a mistake during a battle and has to pay for it. The earth drinks the sacrifice and produces a contract written and signed in blood.</p>\n<p>Kaeya has seven days to set all his worldly affairs in order.</p>\n<p>OR: Kaeya ups and dies, receives another chance to think things through and make things easier for the people around him after he passes.</p>",
    "notes": "<p>Please read the tags and if you're not comfortable with reading this kind of a story, or if you think that it might be potentially triggering for you, please just... back out. I triggered myself while writing this and it was Not Fun and I don't want it to happen to any readers.</p>\n<p>Thank you</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>So this was hella late but there was supposed to be a part with an Abyss Mage due to their theoretical connection between the Abyss Order and Khaenri'ah, and the more I wrote about it the more I hated it. I sat on this chapter for like, a week, before I came to the decision that I hated it waayyyy too much so I simply scrapped it. lmao rip.</p>\n<p>Anyway hope you enjoyed it.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>Did it fuck you up? This chapter fucked me up :) </p>\n<p>Sorry I haven't proofread it or anything cos I'll probably start fucking sobbing again, but I'm glad y'all read until the end. Kaeya is king and I want to see him obliterated by angst and anything else. </p>\n<p>Just know, I was crying as I was typing and it's really hard to try and think when you're leaking liquid from your eyes, while trying to not get tears onto your keyboard and trying to not alert your family that your crying. wheezes. </p>\n<p>Anyway, comments and kudos' are nice and they're really encouraging. I might write something a bit more lighthearted soon, but not right now. I still need some recovering time lmao. </p>\n<p>I'll also probably be making a Kaeya animatic at some point, whenever I dig out my motivation from whichever hole it's buried itself in, but I currently have a Liyue Chili one on my Youtube channel: https://www.youtube.com/watch?v=AP9Ervtp3wM (shameless plug lol)</p>\n<p>To celebrate 1000 comments I decided to release the Abyss Mage part - or the part which I wrote before deciding to trash it for being both out-pf-place as well as unsatisfactory :') So no funeral scene - only the conversation that was set after the the day before the final night :)</p>\n<p> </p>\n<p>Did you know?<br>This fic is actually called \"Untitled document\" in my google drive - I had to go hunting through all my Untitled documents to find this one so I might release a bunch of the unfinished ones for funsies in a collection of fics kinda thing idk.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">more notes</a>.)\n</p>\n<p>I still read through all the comments posted on all my fics when I'm in need of that sweet sweet serotonin, so I just wanna know I love every single one of you who've commented on all of my fics &lt;3</p>\n<p>Screaming Crying Dying</p>",
    "text": "It all starts, and ends, with a mistake. Kaeya, usually so lithe on his feet, pushes himself just a little, tiny bit too hard, his legs far too tired to dash that extra moment and when he sees the last Mitachurl’s heavy axe, glowing red with heat, swing down he knows he’s finished.\nIt burns his flesh, searing pain bursts his nerves as Kaeya feels the blade tear through his shoulder, hears the cracking of his collarbone, the rip of sinew, his sternum being sliced through and he collapses. It hurts so much, it hurts to breathe, his body so heavy and he gasps for breath, trying to reach for his dropped sword with a barely twitching hand.\nThe Mitachurl, satisfied with it’s kill, turns away from Kaeya and slings the axe over its shoulder. It lumbers away as Kaeya slowly fades, staring at the night sky and the single moon.\nA corpse.\n \n \n \n“Kaeya,” his mother says as she cradles him in her lap, “the three moons, Aria, Sonnet and Canon, how they grieved when they turned on each other. They loved and loved until their love became war, and now all that is left is that corpse up there, watching over us, cold and weeping.”\n“I wonder, Kaeya, can she see beyond the borders of our forsaken lands? Does she weep for the blessed souls too?” His mother is thin, everyone in Khaenri’ah is, with how ravaged the lands are, the soil is barren and crops barely ever take. Kaeya looks up at the white moon, the pale light that seems to tint ever so slightly red from the constant smoke and fires, “Mama, do the gods really exist?”\nShe strokes his hair gently, “not for us now, not for us that have been left behind, not for those who were born here and managed to leave, never for us, not anymore.”\nA land eternally trapped, forsaken by the old gods, far from the sights of the new ones, stuck in a single moment in time, starving, burning, in ruins. Unable to die, unable to live, unable to dream. Kaeya, for one moment, wonders what Khaenri’ah could be called.\nLater, he learns the word.\n\nHell.\n\n \n \nHis parents bring him to what once was a large hall, a crumbling altar before a stone throne. From an age when we were blessed, his mother once told him with a faraway look, when we would worship and celebrate and prosper. \nKaeya looks at the man seated on the throne, “Uncle Dainsleif,” he says. Kaeya doesn’t believe that he’s his uncle, his hair is too light, but that is what he calls him.\n“Kaeya,” Dainsleif replies, “we will be sending you away.”\nIce crawls up Kaeya’s stomach, he doesn’t want to, being sent away means leaving everyone behind. Khaenri’ah is a suffering to survive in, but his family, everyone, is here, and this suffering is all he knows. His mother’s slips her hand into his, she looks relieved, “Kaeya, isn’t that great?”\nHe doesn’t feel great.\n“You can escape,” she says, her smile makes her look like she’s crying, “you don’t need to be trapped here anymore. You can live a better, happier life.”\n“What about you?” Kaeya feels his fingers going numb, “what about Papa? And Uncle Dainsleif? And everybody else?”\nDainsleif rises from his seat and moves to stand towering over Kaeya. He places a heavy hand on his head, “Kaeya, when you were born, everyone celebrated. The first life was created in this cursed world. You are our hope, when you dream, we dream.”\n“Please Kaeya,” his mother’s grip tightens on his palm, her fingers bony, “this is for the best. For you.”\nKaeya swallows, and his throat is sandpaper and smoke as usual. I don’t want to go, but instead he says, “how do I leave?”\nHis mother cries, deep, chesty wails when he is to leave, she clings to him and caresses his cheeks and sobs out, “stay safe, please, be safe.” His father lays a hand on his shoulders and says, “you know what you need to do. You know what is to happen. I can only take you so far. As a sinner, I can only remain out there for so long before I get smited by the gods.”\nDainsleif ruffles his hair and says, “dream well, Kaeya Alberich.”\nHe wants to stay.\n \n \nShe shines bright, white and pale, her corpse looks down over the blessed souls, Kaeya learns, but the moon no longer weeps. She hangs, heavy and swollen and longing, but no longer weeping. The clouds are fluffy and soft and high in the sky, nothing like the oppressive smog that crept over Khaenri’ah like a miasma and the rain that comes pouring down is wet and cold and absolutely nothing like the ash flakes that stung at his eyes when they fluttered into his face.\nKaeya wants to slow down, wants to feel the green, green grass between his toes and crouch down to look at the little worms that crawled from the damp soil, but his father’s hand on his shoulder is tense and heavy.\nThey stop at the side of a dirt road and Kaeya’s father ducks down to his height, looks him in the eyes with a tired, relieved smile.\n“Kaeya,” he says and wraps his arms around his son. Kaeya knows that his time is up.\nHis father was never overly affectionate, his mother was the one who would hug him, kiss his face, pet his hair. Kaeya stands there, frozen, as his father tightens the hug.\n“Kaeya,” his father breathes in, out, and then says, “my boy.” \n \nHe’s never going to see him again.\n \n \n \nHis father lets go, gives Kaeya one last look and then walks away. Kaeya stares after him as his tall figure melts into the darkness of the woods and then.\n\nBoom. \n\nLightning.\nTrees burn and burn and then the fire fizzles out in the downpour. Thunder reverberates in Kaeya’s ears as he screams, Papa. \nHe doesn’t want this, never wanted this. The rain is cold and stings his skin, the grass pokes at the soles of his feet and his soaked clothes stick to him like a second, heavy skin. There, at the side of the dirt-packed road he stands, in the dark, in the cold, alone. He stands there until his legs ache, stick-still, waiting for the moment the gods realise he, too, is a sinner that’s escaped his prison, deserving to be smited as well, his feet hurt, bare toes going slowly numb, but he stands. Suffering is all he knows, after all.\n \nAnd then a carriage rumbles by, it stops, and a man with red, red fire hair steps out.\n“Hello, boy,” the man says, “What are you doing out here in such a storm? Where are your parents?”\nKaeya knows what he needs to do. He opens his mouth and lets lies spill from his lips like poison seeping from teeth. He says, “I’m waiting. My dad will be back soon. He said he’d come back.”\n“Come with me, boy,” the fire man says, warm and soft, “just until the storm lets up. After, we can look for your father.”\nMy father is dead, he wants to say. Kaeya can feel arms around him, the very first and last hug from his father.\n\nMy boy. \n\n \n \nFace pressed to the soil, Kaeya’s last breaths are pain wheezes as he thinks to himself, ah, I still haven’t finished that report on the attempted Hilichurl invasion, and, I said I’d help Klee teach her wild, wolf friend how to read and write, and then finally, Mama, Papa, Uncle Dansleif… Were my dreams enough? \nThere’s a voice, booming and drawled, it says, the you who has yet to conclude your worldly affairs, Kaeya Alberich, the you who’s grown up in a war-torn, godless land, the you who’s entire life has been a battle, do you wish to make a contract? \n“Kaeya,” His mother once said, pressing a kiss to his forehead, “our people once danced before the sacrificial altar, we once were able to hear revelations from Celestia, is it not a pity we will never again hear the voice of divinity?”\nThe earth itself, slow and patient and ever present, rumbles and shifts.\nKaeya Alberich walks through the front gates of Mondstadt, gives a tired, jovial greeting to the guards manning the walls, “You’re back late, Captain Kaeya.” Lawrence says. Kaeya grins, “It can’t be helped, the main character is always fashionably late.” And they laugh.\n \n \nIt all ends in seven days.\nKaeya’s acting odd, Diluc notes, he looks odd with his shirt all the way closed on his chest, he's never done that before. He’d just about finished with patrolling the streets of Mondstadt when there’s a jauntily annoying voice calling out.\n“Mr. Darknight Hero~” In a falsetto, Kaeya waggles his hand at him, “Truly a stunning silhouette! I’ll see you you-know-where~”\nDiluc knows where. Kaeya’s waiting outside the Angel’s Share, the tavern already shut and locked. Diluc sneers, “Surely the great Captain Kaeya has better things to do than wait outside a closed tavern.”\n“Ah, you wound me,” Kaeya says and gestures with his left hand, “right here, in the heart. Young Master Diluc will definitely let his cute brother have a drink. After chasing away a camp of Hilichurls, a knight is deserving of some reward, no?”\nDiluc scoffs and unlocks the door to the tavern, “drinking when there’s reports to fill the next day? How conscientious. And, we’re not brothers.”\nKaeya shrugs and saunters into the building, slouching onto the barstool. He tips his head, “One Death After Noon,” and Diluc pours him a drink and slides it over the counter and watches the liquid slosh as Kaeya stops it with his left hand.\n“This is grape juice,” Kaeya blandly says, but still takes a sip. Diluc’s eyes narrow, “The Hilichurl camp?”\nKaeya puts the glass down and waves the topic away, “dealt with. You would think after the whole Stormterror incident, they’d back off a little.”\nDiluc hums and snatches up Kaeya’s right arm from over the bar, there’s a sound like grinding, cracking, and Kaeya jerks from the movement, a short, aborted yelp escaping his lips.\n“Fuck,” Kaeya breathes out and Diluc notices that his arm is trembling, “and I thought I hid it so well.”\n“You’re right handed,” Diluc states, “and yet you only used your left to pick up and gesture with.” Kaeya gives a one-shouldered shrug and Diluc lets go of the man’s arm, “I would’ve thought a Captain of the Knights at your skill would be able to clear out a Hilichurl Camp without injury.”\nKaeya chuckles, “is that a compliment I hear?” and Diluc pretends to turn around to take stock of his spirits lining the wall.\n“Don’t be too much a bother to the Deaconess, Barbatos knows that she has to deal with enough from having to heal all those incompetents in the Knights of Favonius.” There’s a short silence before Diluc hears Kaeya swallow the rest of his grape juice and put down the glass with a clink and the scrape of the wooden stool against the floor.\n“I’m having to go on a bit of a journey in a week’s time, I’ll be dropping by everyday until then,” Kaeya says, there’s the rustle of cloth and the thud of boots and the door to the tavern swings open, “my dear brother will definitely make time to work a simple week at this delightful tavern, right? I’ll even restrain from going to the Cat’s Tail for you, my devotion is truly astounding.”\nDiluc turns sharply on his heel, “we’re not bro-!”\nThe door to Angel’s Share closes.\n \n \nKlee is as adorable as ever, eyes wide and red and reminding of kinder times, she pulls the wolf boy along as she bounces towards Kaeya, “Mr Kaeya! You said you’d teach Razor how to read!”\nKaeya laughs and pats her head, “indeed I did. Shall we go to the library to get some books. The day is nice so why don’t we go outside to learn? I’m sure Razor would hate to be cooped up in a musty old library for the entire day.”\nKlee agrees and when Kaeya sends her to rampage through the shelves with a quick, “don’t burn any of the books or Lisa will be mad, pick what you like but not something too hard, maybe something with pictures?” and then after Klee returns with an armful of picture books, they’re well on their way to sit at the feet of Barbatos’ statue.\nRazor is a quick learner, he doesn’t quite understand the need for extra filler words, but at least he’s trying. When Klee’s stomach lets out a tremendous growl, Kaeya sends her down to the Good Hunter with a bag of Mora to choose whatever she wants for lunch. He figures he might as well spoil her just a little bit more.\nKaeya turns to Razor and says, “there’s something I need you to do for me, in a little while.”\nRazor hears him out.\nKlee returns with a small baggy full of Mondsdadt Hash Browns and Fisherman’s Toast and a container with six skewers. “I got everyone’s favourites!” and plops down next to them. As she munches down on her toast she looks up at Kaeya with painfully wide, innocent eyes and says, “Mr Kaeya, did you hurt your hand?”\nKaeya grimaces and shoves a Fruity Skewer into his mouth, “just a little. Nothing to worry your head about.” Klee nods and accepts the answer at face value and Kaeya’s heart aches, “make sure you go and visit Miss Barbara then, she always makes hurts go away!”\nKaeya pats her head and when they’re done with their food, Kaeya pulls a handkerchief from his jacket and wipes at her mouth to brush off crumbs and then they go back to trying to teach Razor to read.\nThe sun begins to set and paints the sky a brilliant orange and soft lavender and Kaeya decides it’s time to go back. He watches fondly as Klee cheerfully walks in front of him and decides to speak up.\n“Klee,” he says, and she turns on her heel and beams at him, “in six days I’ll be going on a journey. Really, really far away, for a long time.”\nIn a quick movement he sweeps Klee off her feet and rests her small, fragile body in the crook of his left arm. His chest hurts, was I this small when Papa hugge- and he bonks their foreheads together, “that’s my girl.”\nKlee giggles quietly and reaches up to pat Kaeya’s head, “remember to go and see Miss Barbara before you go. Miss Lisa always says that you need to be in tip-top health when you go on an adventure!”\nKaeya closes his eyes and smiles in agreement and feels like he needs to vomit.\nRazor stays silent.\n \n \nThe next few days Kaeya spends working on his paperwork. He fills in his backlog of reports, he assigns a successor to his position of Captain, and he completes his resignation form.\nIt only sinks in how final it all is when he signs his name with shaky penmanship.\nHis right arm still trembles, there’s barely any strength left in the limb, his nerves had gotten severed and the temporary replacement doesn’t have the delicacy for his usual smooth gestures. Straightening out his arm, he pushes himself to his feet and wanders through the Headquarters’ hallways and into Jean’s office.\nShe looks tired, and so is Kaeya, but Kaeya still declares with as much energy he can muster, “Our dearest Acting-Grandmaster must be delighted to hear that I’ve finished writing all my reports and paperpushing, you can send someone to grab it from my desk whenever you’re ready. I am a free man.”\n“Kaeya,” she says and yikes, that sure is a flat tone, “get out of my office.”\nKaeya gets out.\n \n \nTwo days left.\nThe Angel’s Share Tavern is rowdy and loud, some of the men there already halfway to blackout drunk, and behind the bar, Diluc stands. To Kaeya’s pleasure, he’s been present every single night, they snipe and sneer at each other, the poison they spit at each other so comfortable it begins to taste sweet on their tongues and then the night ends and Diluc goes on his patrols and Kaeya returns to the Knights’ dormitories.\nHe stands in his bathroom, fresh out of a shower and just.\n \nStares.\nTan skin split from right shoulder diagonally down, down, through his chest, ending near his left hip. Almost completely sliced through, he thinks hysterically, I’m a hair from being bisected. Amber glows bright and ethereal from underneath his flesh, filling the gap the Mitachurl’s axe had torn through him like he was clay. He closes his eyes.\nThe child who lives and breathes and writhes beneath the pressure of war, the voice whispers as molten rock pours into his body, glowing orange geo floods him and crystallises the cryo sitting in his veins, it glows and burns and then the amber solidifies around his organs and holds his every cell in suspension, with the blood fed to earth, the contract is sealed. Seven days and seven nights to put all worldly affairs in order before the Son of Sinners, Kaeya Alberich will, with grace, perish on his own terms. \nHe rests his head on the mirror and the amber pulses with light, in time with his stolen heartbeat. There’s no reason for him to see Barbara, she can’t bring the dead back to life and he’s already a dead man walking.\nTwo days left and he thinks about all the people of Mondstadt he’s going to be leaving behind and he doesn’t want to go. \nThe amber patchwork crumbles and grinds into fine dust as he shifts his arm. It’s not his choice.\nThe second last day Kaeya spends packing up. He’s folding his clothes and putting them into bags to make it easier for whoever has to clean up after he’s gone, he separates small trinkets and things he’s collected over the years while living in Mondstadt and marks the cardboard boxes with names regarding what goes to who.\n \nTo Jean, dried cecilias and his favourite fountain pen, it’s an old thing that Master Crepus had given Kaeya, back when Kaeya was still trying to learn how to read the common language rather than the ancient runic language that was scrawled over the ruined buildings of Khaenri’ah and the old stone tablets that told tales of Celestia and gods and happier times for his people.\nTo Lisa, a simple notebook, filled to the brim with the old language, telling the many myths and tales his mother had told to him as they sat in a forsaken land, staring at the corpse hanging high in the sky. Kaeya’s sure that she’d enjoy the challenge of trying to understand the ‘dead’ language, but just in case, he’d included a key at the very back of the notebook, translating the alphabet.\nTo Barbara, he gives materials he’d heard had medicinal properties to mitigate heads and relieve fatigue, for both her and Jean.\nTo Amber, he gives souvenirs he’d bought while travelling through other Archon’s lands on Knightly duties, small things like a charm or a scented candle. Things that would allow Amber to travel as freely as the wind without ever leaving the safety of Mondstadt.\nTo Klee, he gives almost everything, his eyepatch, his Mora, everything. He thinks of Master Crepus who looks at a too-skinny too-dark boy with midnight hair and says, come with me. He thinks of his mother, clinging to Kaeya like the last lifeline she has as she sobs so hard her throat gives out, but through her tears, lets her only son leave for a better life, thinks of his father who sacrificed his life to walk his son through a land which rejects him, who gives his final smile and hug and says, my boy. \nAnd then he thinks about Klee and her innocent smile and understands why they all did what they did and then he thinks, my girl. \nAnd then finally, to Diluc, he gifts his vision and his sword.\nLook, he wants to say, payment for when I held onto your vision. Payment for when I took your role as Captain. \n\nDid you really keep that vase? \n\n \n \nThe final day comes, time slipping through him like a ghost. Kaeya just spends the hours just… walking. He walks through Mondstadt, through the back alleys and the open paths, he spends as much time tracing out his steps, trying to carve the memory of the city into his mind.\nHe says his hellos and goodbyes to every person he comes across, no matter how busy they seem, he tries to savour every last moment he has with everyone. His feet ache but he keeps walking, one foot in front of the other. With every step he wanders closer to the end of it all and he doesn’t want to go.\nThe sky turns from blue to purple and then Kaeya goes to the Angel’s Share for the final time. Diluc is there, wiping away at a glass as usual.\nThe weird little green bard, Venti, is there as well, singing a jovial tune as he strums the strings of his lyre. His eyes meet Kaeya’s and, for the briefest of seconds, there’s surprise on his face. After he finishes the current song, Venti prances over to Kaeya as he’s seating himself, footsteps light and airy.\n“Sir Kaeya,” he says as Kaeya raises a hand to order a Death After Noon, “you’re quite the lucky man, I’d say that rockhead must be a fan.”\nKaeya sighs and says, “no rhyming, less talking, more singing and drinking. I’ll even treat you a glass.” And Venti lets out a whoop, “No rhyming indeed! No need to pay for more than a drink, I’d feel dreadful for this to be our last memory together.”\nAnd then he turns towards the rest of the rowdy bar and calls out, voice ringing through the ambient chatter like a wind blade slicing through butter, “Tonight! It will be the night of nights! Let us all make merry in honour of Sir Kaeya!”\nA cheer rises like a wave from the patrons and Venti brings his fingers to his lyre and plays out a chord which instantly catches Kaeya’s, and the rest of the tavern’s attention. Venti sings of a land where ice covers, which melts away with a burst of flame, then the flame is extinguished by a spray of water and when the water dries, thunder comes and then the people of the land, with their ears pulled towards the sky to hear the words of the divine, they dance and pray to their sacrificial altars and then-\nVenti stops and brings his gaze up to meet Kaeya. He says, “I don’t know the rest of the song.”\nKaeya sips at his glass, “a war comes,” it feels like the tavern goes silent, “the good people escape the gods’ wrath, or they die. All that are left are the sinners. The sinners are trapped, in a perpetually war-torn land, unable to die, unable to live, unable to dream. And then finally, finally, a pregnant woman gives birth to a boy and the sinners rejoice. An eternity spent in a hell-like world and perhaps someone may be able to escape from the godless land and live a proper life. So they send him far, far away. The mother of the boy cries until she vomits, she clings to him so hard his bones feel like they’re breaking, the father of the boy chooses to sacrifice himself to the gods’ wrath to ensure the boy makes it to the blessed land safely.”\n“The boy leaves everything he knows and it’s the first time he’s seen clouds that are fluffy, rather than smog and smoke from burning ruins, it’s the first time he’s seen water drop from the sky, rather than ashfall, it’s the first time he’s ever seen grass and vegetation and animals, rather than desolate ruins,” Kaeya leans back to stretch his back, “and that’s how the rest of the song goes.”\nVenti tilts his head, like a bird seeing something curious, “that doesn’t sound like a song.”\nKaeya grimaces and tips back the rest of his glass. The alcohol leaves a burning trail down his throat and the heat sits somewhere in his chest, “no, it doesn’t. Does it?”\nAnd then Kaeya calls out, “tonight is the night of nights! This round of drinks is on me!” The atmosphere lifts, becomes lighter as the air seems to return as if nothing had happened.\n \nDiluc purses his lips as a weird feeling crawls into his chest.\nAn hour later, just as Kaeya stands to leave, he puts a small bag of Mora on the bar, far too much to pay for the entire bar’s drinks for the whole night, let alone only the one round.\n“Diluc,” Kaeya says, “I’m leaving now.”\nHe leans over the counter and ruffles the red hair with his left hand, “goodbye, stay out of trouble. Stay safe, my cutest brother.”\nI’m not your brother, Diluc wants to say, but then he remembers, ah Kaeya’s going on a journey tomorrow, and instead says, “you’re being weird.” and Kaeya just laughs, somehow pained, “Aren’t I always?”\nKaeya leaves.\n \n \nHe walks through the darkened streets of Mondstadt and breathes in the cool night’s air. He walks and walks until he reaches the training courtyard behind the Knights’ Headquarters.\nRazor stands, waiting.\nKaeya sighs. Geo is weak to claymores. He’d wanted it to be Diluc who did it, the one to send him off, but when Diluc had turned his back on him on the first night, had gruffly, in his own words, said “you need to get yourself healed”, with his ears flushing red and his back looking so small and delicate.\nKaeya had thought to himself, I can’t do this to you, I can’t make you do it, to force you to be alone again, I can’t put this on your shoulders which already carry the entire burden of Mondstadt. \n \n \nSo, like a coward, he turns to Razor, still only a boy, and decides to make him a murderer. Kaeya sends Klee away and says to the youth, “In six days, I need you to kill me.”\nRazor tips his head and asks, “why?” So Kaeya opens his shirt and shows him the amber that fills in all of the cracks that his body has. Razor squints down at the glowing amber and then nods, “You are… Dead, already. Not kill, I only put you back.”\n“Right,” Kaeya says through a forced smile, “behind the building we came from, when the moon is highest, let’s meet and you will put me back.”\n“Okay,” Razor says, “I will make sure to break it well. Anything more?”\n \nKaeya stands before Razor, arms stretched wide, he doesn’t want to go, but he’s done it before- abandoned his family once already, what’s a second time? Razor tightens his grip on his claymore and the air sizzles with electro and purple light dances.\n“I will put you back to nature,” Razor says and a growl bubbles up from his lips as his muscles tense and the heavy sword comes slashing towards Kaeya.\n \n \nIn the Angel’s Share, still entertaining the rowdy, drunken crowd, Venti pauses mid-song. He lifts his head towards the door and sighs. Quietly, like a whispering wind, he mournfully murmurs with a solemn strum of his lyre, “Ah, it truly is the night of nights.”\nRazor imbues his sword with electricity, he knows that like this, he can break the hardiest of magic crystals, amber that is already crumbling within a human body would never stand a chance.\nKaeya is not the first human he’s killed, but is certainly the most unique. Razor thinks he’s never felt a human’s flesh give like Kaeya’s had, with a pained wheezing breath, the muscle fibers had loosened and his blood shattered as if he was simply a rotting piece of flesh half imbued with geo.\nKaeya’s torso crumbles from the force of Razor’s strike, and he catches the top half of Kaeya before he hits the ground, his legs tumbling to the floor and shattering at the knees.\n“I’m more geo than human, right now,” Kaeya had said when Razor asked anything more?, “I’d like to have the geo parts of me crushed to dust and the flesh part burnt to ashes. If it’s possible, please scatter the geo powder of my body off the edge of Starsnatch Cliff. I can only pray that they’re durable enough to fly to my homeland. The ashes I’d like to be buried by a bed of mist flowers.” They always were his favourite.\nRazor can easily crush the geo, but his electro isn’t good enough to reduce flesh and bones to ash. Oh, the other red-burny girl, she has a pyro Vision. Razor knows she lives somewhere in the Knights’ dormitories, so he seeks her out.\nWhen she opens the door to her room for him, she’s rubbing sleep out of her eyes as she asks, “Razor? What do you want so late at night?”\nHe takes her by the hand and says, “help.” and he leads her to Kaeya’s remains. When they’re out in the courtyard, the geo fragments glint off the moonlight and Amber turns stiff in his grasp.\nRazor knows he hasn’t done anything wrong, Kaeya was already dead and needed to return to being dead, so he was doing what was natural but… the scream of anguish that rips from Amber’s throat as she collapses to her knees makes Razor’s heart shake.\n \n \nThere’s something not right.\n \nThere’s been something sitting heavy in the air, it’s been pushing on Diluc’s throat from the moment Kaeya was waiting outside the Angel’s Share, seven nights ago. The song Venti sang, the story Kaeya told, it’s probably the most information Diluc’s ever gotten from Kaeya about his past and it makes him feel sick.\nThe unease settles in his chest and crawls into the rest of his body when, in the midst of his festivities, Barbatos pauses and with a sad smile says, “it truly is the night of nights.”\nDiluc swallows as the atmosphere turns oppressive but no one, not one single person in the tavern, seems to feel it. Something is wrong, wrong, wrong, why can’t anyone else see it? The wind is whistling in all the wrong directions and it’s so loud Diluc wants to drop to his knees and cover his ears.\n“Bar-d, what’s going on?” Diluc asks, “do you know anything?”\nBarbatos strums a chord and says, melancholy and grief in his voice, “I know many things, like how the wind wails and the earth whispers longevity and the completion of contracts. What I didn’t know until now was how the moon weeps and with it’s pale light, a corpse.”\n \nDiluc can’t breathe.\n“I need to go,” he says and tries not to throw up. The bad feeling swirls and swells within his chest like something too big to fit in his skin and he gestures to Charles, who’s wiping a table, to man the bar. He throws himself out of the tavern, Kaeya said he’d be gone by tomorrow, surely, surely, he’s still in Mondstadt, sleeping peaceful before a long journey.\nDiluc makes it to the central fountain before there’s a wailing shriek coming from the Knights’ Headquarters and every single bit of unease that’s been building within him morphs into horror and he feels it drop like a pit in his stomach. He scales the wall, uncaring of who could see him, the regular path simply would take too long and there’s knights already flooding out of the dormitories, most in half-asleep states, wearing a mismatch of armour and pyjamas and weapons for an emergency.\nThe crowd is streamlining towards the training court behind the building and Diluc bolts for it, adrenaline coursing through his veins and as he turns the corner he just… stops.\nAmber, the Outrider knight, sits on the ground, utterly frozen, with the wild wolf boy, Razor standing next to her, his hand clutching hers.\nAnd in front, what they’re both staring at is-\n \n \n \n\nNo.\n\n \n\nPlease no.\n\nDiluc staggers, brushing past the two youths and collapses, heavy on his knees in front of Kaeya. Moonlight glints off deep blue as Diluc’s trembling hands drag Kaeya so his head rests on his lap, he ignores how light Kaeya feels, how all that’s left are his head, torso and his left arm.\n“Kaeya,” Diluc says, and his voice shakes, “Kaeya.”\nHis gloves hands caress the tan cheek, flesh already cold and still. Why are you lying still? Diluc wants to ask, even in his sleep, Diluc remembers Kaeya rolling from side to side, shifting like his skin never fit correctly. Kaeya was supposed to be eternal, never hurt, never still, always grinning and lying and shifting his weight from foot to foot.\n“Kaeya,” Diluc knows he sounds like a lost child, cradling Kaeya to his body and rocking ever so slightly, the word is a prayer to whatever gods would hear, “I’ll get you to a healer, the Deaconess will be able to fix you up. She can heal you back to full health and then we can-” He feels a hand lay gently on his shoulder and peers up to see Jean, the lines on her face speak of disbelief and grief and pity.\n“Diluc,” she says and her tone is so filled with her condolences that Diluc wants to vomit, right there and then, “he’s gone. Please, let go.”\nAnger boils beneath his skin, like magma and pyro essence bubbling up from his stomach as he hugs Kaeya’s body closer, “no, no, Kaeya wouldn’t-”\n“Look at him,” Jean says, “look at what’s left of him. We’ll arrange a funeral and check his will when the sun comes up and we’ll need to investigate how he died, if there was any foul play-”\n“The Knights of Favonius are incompetent,” Diluc snaps and Jean’s hand flinches from his shoulder but he can’t bring himself to care, “that’s twice that I’ve been wronged by them. How could you let this happen to your Captain? Useless, useless, I’ll be the one to find his killer and avenge him.”\nDiluc wracks his brain, there’s geo fragments all around Kaeya’s body. The only two geo Visions Diluc knows of both belong to the Knights, Albedo and Noelle. Neither of which he knows well, both known more through reputation and Kaeya’s tales he told while at Angel’s Share. Perhaps there could’ve been someone with a geo Vision travelling through Mondstadt, maybe even a member of the Fatui delegation, who else, who else could’ve done this?\n“I did it.”\nAmber stops her sobbing to let out a scandalised, “Razor!” and the wolf boy tilts his head, “I just did what Mr. Kaeya asked.”\nDiluc feels heat swirl, flames licking at his hair and rage simmering in his Vision. “You,” he snarls, “You did this?”\nHis claymore’s summoned and in his palms before he even knows what’s happening, his mind a one-track line of how dare you how dare you how DARE YOU?! Pyro burns, the flames crawl over Diluc’s skin as he gently lays Kaeya to the ground and pulls himself to his feet. Fire covers the blade as Diluc readies his weapon. And soft, seething and dangerous, he says, “you will pay for it.”\nRazor looks unsure, his stance widening as he too summons his claymore. He looks young, Diluc thinks, and then, he killed Kaeya. \nLifting the tip of the heavy blade from the stone floor and shattered geo crystals and strips of flesh and Diluc charges at the wolf boy, rage seething, roiling under his skin like magma pushing it’s way up a volcano and he’s going to burnburnburn everythi-\nThe ground leaves his feet and he’s sent hurtling into the air, feet scrambling, trying to find purchase to keep pushing forward to get to Kaeya’s murderer but there’s nothing to find, no floor beneath him as all his forward momentum halts and Diluc flutters gently to the ground.\n“Bard,” Diluc snarls, all respect towards Mondstadt’s once-god hidden away, behind a veil of grief and rage in his mind, fuck the consequences, let me be smited, he wants to say as he lands on the ground and his knees give. All Barbatos does is look gently down at him as he saunters over to Kaeya’s side.\n“Acting Grandmaster,” Barbatos says, “you can dismiss the rest of the Knights. Master Diluc and I need to speak about some things.”\nJean looks tired, she looks weary, and mourning and so, so exhausted. But she lifts her hand and tells the watchful Knights, “Sleep now. I’ll debrief all of you in the morn. Put this incident out of your minds and we can deal with it tomorrow.”\nThey look doubtful, some even look distressed, but they all reluctantly trickle back into the dormitories with quiet mutterings.\nDiluc sneers at them as they go, but still can’t quite find any way to bring strength to his legs and Barbatos leans down to pick up Kaeya. He strokes Kaeya’s head like a parent soothing their child and addresses Diluc, “Please refrain from hurting Razor, he was simply doing what he was meant to.”\nDiluc bares his teeth, “You’re not rhyming.” and Barbatos waves it off, “Sir Kaeya’s last wish for me, no rhymes for tonight.”\nHe places Kaeya in Diluc’s lap, let’s him see what’s left of him in the bright moonlight. There’s nothing but half a torso, one arm and his head and he looks… peaceful.\n“Sir Kaeya who was killed, seven days ago. The wind cried out so long and loud for him, but the earth rose up and held him together long enough to set his affairs in order. A rockhead he may be, but I believe even he has grown to understand grief and longing…” Barbatos murmurs, “Aren’t you glad, Master Diluc? With his last seven days on this land, he did not once let his thoughts stray from Mondstadt. And you, Sir Ragnvindr, were both the first, and last person he greeted with his borrowed time. What an honour.”\n“What an injustice,” Diluc says and runs his hand through midnight blue locks of hair and brings Kaeya up to press their foreheads together.\n\nKaeya.\n\n \n \n“Do you love your father?” Diluc asks, peering down at Kaeya with big eyes. They’ve been waiting for hours at the spot where Crepus first met the outlander, both young boys settled on a picnic mat under a fruiting sunsietta tree, their watchful maids sitting far enough in the undergrowth to not hear the words of their conversation.\n“I do!” Kaeya insists. His eyes turn not to the road, but the forests where the maids sit. He looks… Guilty, and scared, and somehow sad, “He said he’d go and get grape juice.”\nDiluc thinks about it, “but he hasn’t come back yet.” and Kaeya gets angry so suddenly that it almost scares Diluc, “He loves me! He hugged me! If Mister Crepus never came back for you, would you love him still?!”\n“Of course I would!” Diluc yells back and opens his mouth to yell some more before he realises how stupid his words were that he feels his teeth snap closed and a bright red flush cross his face. He settles back down onto the picnic mat with hot tears springing to the corner of his eyes as he says, “sorry, I was dumb. He probably came back and couldn’t find you. He’ll come back soon.”\nKaeya lowers his gaze to the grass and tears out a handful, squeezes it between his fingers before dropping it into Diluc’s lap. He sniffs and says, “yeah, you are pretty dumb.”\nThey both don’t mention the tears streaking down Kaeya’s face.\n\nKaeya.\n\n \nWhen Diluc returns to Mondstadt, Kaeya’s changed so much he can barely tell they were the same person. He walks with such a confident and open gait, nothing like the shrinking scrawny boy who showed up behind Crepus, soaked to the bone like a wet dog.\nHe’s grown bigger, broader, all long legs and long hair and long lashes and a chest he shows off to the world, as if the shirts he wears can’t contain it all. Diluc only comes up to his eyes and years later, he’d war between feeling relieved that he’s grown so well, and indignant that his position as the taller one of the two had been usurped. But at that time all Diluc can see is Kaeya’s stupid face, the scent of rain and freshly turned dirt and the sound of Khaenri’ahn spy, so there’s nothing he feels but bitterness and betrayal as he brushes past Kaeya and ignores his greetings.\nIn the Angel’s Share, he’ll sometimes lament while rubbing stains and marks off of glass while he hears lies and deceit drips from Kaeya’s lips like a well-refined poison.\nAh, where did that little boy go? The one who, on the first night when Crepus had laid a hand on a blue head of hair, both dripping on the front doormat, looked at Diluc’s pale skin and red, red, red with something like wonder in his eyes.\nThe one who stared in awe at the feast of a dinner Crepus had the servants produce, you’re too skinny, boy, and with shaking hands and doubtful eyes taken that first bite of steaming meat and almost choked from the flavour. He’d ate and ate until he threw up onto his own lap, almost cried from the humiliation, and after the maids had cleaned up the sick, ate some more. Diluc looks at his bony arms and thinks to himself, good. \nThe one who had been so, so reluctant to leave, when the first snowfall of the winter had come. Diluc almost had to drag him out and when the first snowflake landed on his nose, he’d flinched so hard he ripped his hands from Diluc’s before he paused, and said with quiet awe, it doesn’t hurt? \n\nHurt? \n\n\nAshfall usually burns the eyes and nose.\n\n\nIt’s not ash! It’s snow, made from cold water.\n\nOh, right.\nThat boy had managed to wither away and die while Diluc wasn’t looking, or he’d been tucked away into a box and shoved so far back that he’d never see light or snow ever again, or he’d been cut apart, all the innocent and happy parts sliced from bitter bones to be salted and stored as long-lasting fragments of memory-jerky.\n\nPoor, poor Kaeya.\n\n \n \nDiluc wakes up.\nHe’s seated upon a stone stool, before a stone table. A bowl of steaming soup and a warm cup of tea sit innocuously in front of him. To his right, a small wind spirit sat upon the table, cheerfully pouring himself a cup of Dandelion Wine, across from him Kaeya, next to him, gold and brown and majestic, a damn dragon. \n“Uh,” Diluc says stupidly. A leaf flutters down and lands in his soup, a gingko leaf. Maidenhair tree. This must be Liyue.\n“Fancy seeing you here,” Kaeya says, the grin he stretches across his face makes him look like he’s about to cry. The wind spirit lifts the cup, which is almost half his size, and drinks the alcohol, “about time too, without my Gnosis it really did put a strain on me to bring you here.”\nThe dragon, coiled three times around and yet still spilling off it’s stool, lets out a rumble that seems to shake the earth itself like tectonic plates grinding together, “the final night is not yet over. Until the sun rises, the contract of settling all worldly affairs is unsettled.”\n“Don’t mind us,” the wind spirit says, “Morax and I have much to catch up on, it’s been hundreds of years, after all.”\nThere’s an awkward silence as the wind spirit and the dragon turn to the side and begin conversing quietly, the words they speak seem to slip from Diluc’s mind like grains of sand between fingers so he stops trying to eavesdrop. Kaeya stares at him, fond and sad.\n“Can I touch your hair?” he asks.\n \nCan I touch your hair? Thin, tiny fingers card through crimson locks gentle, careful, combing out any tangles they come across through the curls, it looks so much like fire, but it doesn’t burn at all! \nFrom that single question, the conversation between the two pulls from between their teeth like water through a net. Flowing easily and quickly, they reminisce, they laugh, they chitter and chatter and at some point they both begin sobbing, loud, heaving wails that rip from their lungs.\n \n“It’s time,” the dragon says, and the wind spirit sighs, “it is indeed.”\nKaeya pushes himself to his feet, sleeves soaked with tears and he manages out, “Take care of Klee for me, will you? Sometimes Albedo goes out on long expeditions and Klee is my girl, okay?”\n“Okay,” Diluc whimpers as he chokes on tears and mucus and the wind spirit flutters over to sit on his shoulder, giving his cheek a light pat.\n \n \nThis is the fourth time.\nFourth time that Diluc’s lost Kaeya.\nThe first was in the rain, betrayal running through his veins as Kaeya looks at him with lies on his lips, the second, alone, bleeding out, staring at the back of a Mitachurl as it wanders away to find a new tribe of churls, the third, beneath a weeping moon, geo sparkling and flesh stagnant, and the fourth, resigned, walking away between two gods.\nDiluc sobs as he reaches out a hand, what a disgrace, his mind whispers, you lost him a long, long time ago, why are you still clinging? \n \nDiluc wakes up.\nHe’s in his bed in the room above Angel’s Share. He’s a mess, his pillow stained wet with tears and his throat burning raw and eyes swollen and red. There’s a summon for him to come to the Knights of Favonious’ headquarters.\nHe goes.\n \nOutside of a room, in the hallway, there’s a little girl in red lying on the floor. She’s drawing something on paper with a blue crayon.\n“Mister Diluc,” she says unsurely as she peer up at him as he approaches, “are you here for Mister Kaeya’s things too?”\n“Too?” He asks,\n“Yup!” She says and kicks her feet, “Mister Kaeya’s gone on a journey, but Miss Barbara said that it’s a different kind of adventure that my mum went on! Mister Kaeya isn’t going to be back for a suuuuper long, long time!”\nTake care of Klee for me, will you? Diluc pats her on the head and tries to make his voice even out, “that’s right. I think I’m here to collect some things for Kaeya. \"Oh? What are you drawing?”\nKlee raises her paper to show off her drawing proudly, “It’s Mister Kaeya! And it’s me! It’s Mister Kaeya telling Klee all of Klee’s Survival Rules. I’m going to draw one picture of him every day until he comes back, because he said he really likes my drawings. Did you know he keeps every single one that I give him?”\nHe gives the drawing a severe look, and then nods, “it is a very good drawing.”\nKlee beams at Diluc and he can’t help but remember the fond, faraway look Kaeya had on his face when he’d said, Klee is my girl. \n \nAh.\n \nDiluc understands now.\n \n \nJean looks tired, she looks like she’s been crying for hours on end, just like Diluc has, as she hands over a sheathed sword and small, heavy box.\nDiluc opens it and its a Vision, Kaeya’s Vision. The gemstone in the middle dulled and grey and nowhere near as frosted cold as it should’ve been. Somehow, seeing it with his own eyes let’s Diluc feel how truly final everything is.\nKaeya should’ve been eternal, but now he’s not. And he’s gone. And all Diluc can do is send every prayer, every ounce of faith left in him, to beg every Archon and god to allow Kaeya to rest peacefully.\n \n \n\nI pray, in your next life, the world is kinder to you, kinder for every injustice it’s served you, and I pray we can meet once again. \n\n\nStay safe, my cutest brother. \n\nSo there’s a few things I want to chit-chat about.\nI got a question about the between two gods line and I included it because I loved the idea that Kaeya, being from Khaenri’ah - the land where the gods’ gaze does not fall, managed to live such a life where despite being born to no god, he’s able to gracefully walk to his death whilst being escorted by Barbatos and Morax.\n \nDiluc: subconsciously, he knew something was off. But he’s like any other person who ignores that tiny niggling feeling of unease and tries to either justify why everything is off, or deny that anything terrible is happening, at least until the truth is before his eyes and he can no longer deny it, hehe.\nJean: I wonder how she felt, with her last words being so harsh~ Kaeya specifically did all of his paperwork to make it easier on her when he passes, he even wrote out a will and set all the official business in order, even assigning a successor to the Cavalry Captain title.\nRazor: I really liked the idea that as someone who had lived wild and dipped so far in nature would be able to take a single look at Kaeya and realise, ah yes, something unnatural which must be returned back to the normal order. \nKaeya: seems like the type of character to show love through actions rather than words. He tried words once, and look how that ended for him, Diluc bitter and betrayed and raging. Understandable, have a nice day.\nKlee: “Mister Diluc is so grumpy, he should smile more. When Mister Kaeya comes back, I’m sure he’ll be happy again.”\n \n \nKlee, only a few years older now, knocks on the door of the Angel’s Share. The usual patrons are familiar with the little girl and make space for her to peep over the counter of the bar. Diluc stares down at her, “What do you want, Klee?”\n“I want the blue crayon,” Klee says, “and a red one, too.”\nThe blue crayon is a dark navy, Klee tends to use it only when she draws Kaeya, it’s barely a stump nowadays, but she stubbornly tries and tries to use it, even when she struggles and has to drag it across the paper with her forefinger. Klee and Diluc get the red crayon, Lisa is purple, Jean and Barbara a light blue, Noel and Albedo are orange.\nDiluc pulls open the cupboard that used to hold the spirits, but is instead filled with slowly aging papers, and hands over the requested colours.\n“What are you going to draw today?” He asks and Klee pushes an adventurer from his stool to take his seat. Kicking her legs, “I’m going to draw Mister Kaeya, and Klee, and Mister Diluc. I drew Miss Lisa with us yesterday, so today is your turn.”\n“I see,” Diluc says and returns his attention to wiping away any water stains from a wine glass.\n“Mister Diluc,” Klee pipes up, “You’re going to save this one in your cupboard too, right? For when Mister Kaeya comes back home, right?”\nDiluc wets his lips, “of course I will, your room is too full now and that cupboard never held anything too important.”\nKlee hums and turns back to her drawing, she’s gotten better at drawing lately, Diluc notes. Suddenly, she stops and stares, looking at her forefinger stained blue and the crayon she was using gone, nothing but a little dark fragment against her skin. She hunches in on herself, gaze drifting to the half finished Kaeya on the page, he looks a bit like an egg with a dark top and an eyepatch and she says, “Mister Diluc, I think I need a new crayon.”\nHe sighs and reaches back into the Klee cupboard, handing her a fresh navy blue and she grips it tightly with both hands.\n“Mister Diluc,” She says and when she brings her gaze to meet his, red and red, tears brim and overflow, “for some reason, I can’t remember what Mister Kaeya looked like.”\n \n \n“He’s not coming back, is he?”\n \n \nEhe ;)\nKlee: Mister Kaeya will definitely be back before I finish using up this crayon!\n \n \nWhile I am really proud of this work and the suffering I had to go through to write it, there’s one part that I really wanted to share and I just…. I really wanted to write it into the fic but I couldn’t fit it anywhere and it wouldn’t flow well enough so I scrapped it.\nIt was supposed to be me dipping my little nasty fingers into the concept of family, where Kaeya, in those few last days, goes searching for an Abyss Mage to have a last conversation with someone with the fellow experience of Khaenri’ah. The idea was meant to be that in their shared suffering of the land, all the citizens of Khaenri’ah had become closer than family, thus why Kaeya referred to Dainsleif as ‘Uncle’.\nThere was supposed to be a funeral for Kaeya, which three Abyss Mages would crash, representing the role of ‘father’ and ‘mother’ and the rest of the ‘family’, give their prayers and passing gifts on behalf of Kaeya’s family who couldn’t make it.\nBut I couldn’t fit it into the main story because I really wanted the story to Mondstadt focused and I felt that bring up Khaenri’ah too much would cause the characters to call Kaeya’s loyalties into question and that it’s cause the story to be stuck far too much into the past.\n \n \nSCREAMS @frozendxwn on twitter did an amazing comic hhhh my heart exploded when i saw it!!! \nhttps://twitter.com/frozendxwn/status/1359014055269330944\n \nTHERE'S AN ANIMATIC!!! ITS SO CUTE AAAUUGHGHHH\nhttps://www.youtube.com/watch?v=RkN9SEzsk90\n \nGO LOOK AT IT AND GIVE THEM LOVE\nKaeya seeks out the Abyss Mage by the Thousand Winds Temple. Reports had been flooding in that it had been lingering by one of the ruins, particularly by Doolan and Patchi who have a tendency to linger by the temple.\nEven if the Knights did send in someone to eliminate it, it’s not like it’d be a permanent solution. As far as Kaeya knows, it doesn’t cause too much trouble so long as nobody ventures too near, it lingers, people stay away.\nWhen Kaeya approaches it, he calls out to it as he draws closer. He raises his hands and tries to ignore the way the movement pulls at the cor lapis crusting his chest, “I mean no harm, I just want to speak.”\nThe mage turns to him, staff raised and white-blue, “drop your sword,” it demands, nasal and wary.\n \nKaeya does.\nHe drops it onto the grass and kicks it in the opposite direction of the mage, “I just want to talk.”\nIt looks him up and down, scoffs, and slowly floats over to him, a trail of ice covering the thin water, “Poor child. So young and already dead, huh? What a waste.” The mage only comes up to Kaeya’s waist but it pulls at his belt, “you’re a stick. Did those humans not feed you?”\nKaeya flops down, sitting in the water and ignoring the soaked-through feeling of clothes stuck to skin. He can barely feel the cold as the mage sits down beside him, the ice encases his feet and it feels like home, “It’s better. Here, I mean.”\nThe mage stays silent. “Back then, we couldn’t eat. The land wouldn’t take, no matter what we did to till the fields, there were no animals left. Only us. Did you know,” He says quietly, “One time Aunty disappeared for a night? We ate well then - it was the first time I tasted meat, and when she came back she was different.”\n“I don’t know,” The mage says, “It was a long time ago.”\n \nKaeya puts his head into his hands and it all finally hits him, “I died. I died and I didn’t do anything to help Khaenri’ah, I just ran and lived, I’ve wasted my life and all the hope of everyone.”\n“My family,” He feels like that child again, standing with numbed legs and tears in his eyes with cold and unforgiving rain battering him down, “Mama, Papa, I want to go home.”\n“And where,” The mage asks, “Is your home?”\n \n“Is it here, where the lands are green and food is in abundance? Or is it there, the five hundred years spent in that place where every breath is smoke and ash?”\nKaeya pulls at his hair, “I don’t… I don’t know. Is it there or here? I want to go home, I don’t want to die! I’m, I still have so much to do and I haven’t done a single thing at all. My home, family? It should be where my family is, right? That’s what people always say?”\nIt feels like a betrayal, the words he’s speaking. Does he really, truly wish to go back to Khaenri’ah? The suffering, it used to be all he knew, but now… He thinks about Klee, the way she smiles at him like he can do no wrong - like he knows everything in the world and here he is, sitting in the ice water and doubting, Diluc would think him ridiculous. Red, bright and clear Diluc, even when he was eighteen, when he’d thrown away everything in Mondstadt and Kaeya too, he’d still been a straight shot - firing directly in his own direction, never stopping, never wavering.\n \nNot even for Kaeya.\nKaeya’d heard about the rumours, the mysterious person tearing through the ranks of the Fatui, and tried not to think that should be us, together. In the end, Diluc came back and that’s all that matters, even if he came back different, like Aunty, unrecognizable with the pieces bitten out of him. The Diluc Kaeya knew gone, the innocence and kindness ripped out, but that’s not exactly right, right?\nDiluc is still kind, there’s simply not enough kindness left for Kaeya - he’d hit that limit a long time ago and tried to keep taking. Of course Diluc would hate him.\n“I want to go home,” Kaeya sobs out, his chest crackles with each gasping breath, “I want to go back to when I could be greedy and take and people would give, I want to go home! I don’t know, I don’t know, my family, who is it?”\nThe mage offers no consolation, it just sits, quiet. Kaeya cries, deep and chesty and ugly, “it hurts, it hurts, it hurts. What do I do? I want my family, I want Mama and Papa and Klee and Diluc and Mondstadt. I hate being here, I don’t want to go back there!” \n“Child,” the mage says, “Do you know why I linger here?”\n \nThe abrupt question shoots through Kaeya with startling clarity, “It’s because this old ruin, it reminds me of home.” It slowly floats away from him, settling back into the middle of the ruin, “you can have more than one family.”\n“I’m a failure,” Kaeya breathes, it feels like ice crystals forming in his lungs, tearing through soft tissue, “I couldn’t do anything.”\n“Your father would be proud,” it says, not disputing Kaeya’s words, “your mother loves you.”\n \n \n“Now get out of my sight, you still have family to say goodbye to.”"
}