{
    "id": "27651287",
    "url": "https://archiveofourown.org/works/27651287?view_full_work=true",
    "author": [
        "Lomonaaeren"
    ],
    "title": "Genius by the Numbers",
    "rating": "Mature",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "F/M",
        "M/M"
    ],
    "fandoms": [
        "Harry Potter - J. K. Rowling"
    ],
    "relationships": [
        "Harry Potter/Tom Riddle",
        "Sirius Black/Remus Lupin",
        "James Potter/Lily Evans Potter",
        "Tom Riddle/Original Female Character(s)"
    ],
    "characters": [
        "Harry Potter",
        "Diary Tom Riddle",
        "Original Characters",
        "Lily Evans Potter",
        "Sirius Black",
        "James Potter",
        "Remus Lupin",
        "Neville Longbottom"
    ],
    "additional_tags": [
        "Alternate Universe - Canon Divergence",
        "James Potter & Lily Evans Potter Live",
        "Arithmancy (Harry Potter)",
        "Harry Potter is Not the Boy-Who-Lived",
        "Horcruxes",
        "Magically Powerful Harry Potter",
        "Dubious Consent",
        "Angst",
        "Drama",
        "Romance",
        "Family Drama",
        "Dysfunctional Family",
        "Infidelity"
    ],
    "language": "English",
    "series": "Part 6 of From Samhain to the Solstice 2020Part 1 of Genius by the Numbers",
    "published": "2020-11-21",
    "completed": "2020-11-27",
    "words": "44,975",
    "chapters": "7/7",
    "comments": "770",
    "kudos": "9,214",
    "bookmarks": "2,112",
    "hits": "115,753",
    "summary": "<p>Harry Potter, as the eldest brother of the Girl-Who-Lived, has always felt like the average person in his family of geniuses. He has a plan that might change that, but meanwhile, he has to contend with his partially estranged family as he attends his sister’s wedding. And contend, too, with his sister’s fiancé, Tom Riddle.</p>",
    "notes": "<p>This is one of my “From Samhain to the Solstice” fics for this year, and should have three parts, to be posted over the next three days.</p>\n<p>I'm sure you'll be heartbroken to know that this fic is now going to be five or six parts, entirely because of what Tom pulls in this chapter.</p>\n<p>Thank you for all the reviews! This just grew another goddamn chapter.</p>\n<p>Thank you again for all the reviews! This is the last part of the story. Thanks, too, for all the support. I had a lot of fun writing this.</p>",
    "text": "“Hello, Harry. What are you doing?”\nHarry blinked, snapped away from his study trance by the voice, and glanced over his shoulder. Riddle was standing in the doorway of the formal dining room, his face locked in the small, smooth smile that seemed to charm everyone else.\nHarry shrugged and said, “Hello, Riddle. Arithmancy.”\nHe made sure his voice was discouraging, but Riddle still paced across the blue carpet to stand and look over Harry’s shoulder at the parchments Harry had spread out on the sleek ebony table. Harry’s shoulders cramped with the effort of not turning around or standing up. He hated having someone like Riddle at his back.\nWhich was ridiculous, of course. Riddle was the victim of an unfortunate ritual backfiring when he was sixteen, a ritual backfiring that had left him trapped in a diary for fifty years. Then a Slytherin sixth-year had found the diary and decided to reverse the ritual, but she hadn’t been careful enough to guard her own magic in the process. The ritual had restored Riddle to life, but drained her to death, and left Harry’s sister, the Girl-Who-Lived, Diana Potter, exposed to a giant basilisk.\nThat Riddle had helped Diana kill the basilisk and won her heart was—not something Harry approved of, but it wasn’t his heart. Or his life.\nRiddle put a hand on Harry’s shoulder as he leaned. Harry did shift and move away then, unable to help himself. It was the greasy feeling Riddle carried around him at all times, as if he had been rubbing Essence of Murtlap all over his fingers.\nRiddle laughed quietly, but a second later, switched to a tone of disgust. “Heller’s Theorem. Really?”\n“Really.” Harry turned the chair so he could see Riddle and pulled the parchments back towards him.\n“You’re too old to be taken in by that man’s nonsense.”\n“I never said I was good at Arithmancy.”\nNo, that was for his youngest sister, Violet, going into her sixth year at Hogwarts in a few months, and a genius at numbers for all that she had trouble with the real world and reading the emotions of people around her. Just like Diana was a genius at Defense, for all her powerful and uncontrollable magic, and Mum was a genius at Charms, and Dad was a genius at Transfiguration.\nHarry was a genius on a broom, he supposed, but that didn’t count. And the only subject he’d taken an Outstanding NEWT in was Care of Magical Creatures.\nNot for much longer, though, not if the Arithmancy worked out the way it was supposed to.\n“Why in the world are you wasting your time on Heller’s Theorem?” Riddle drew out the chair across the table from Harry and sat in it.\n“Because I want to. Like I said, I’m not good at Arithmancy.”\nThere was silence for a few minutes, long enough for Harry to get drawn into writing numbers and correspondence notes on the parchment in front of him and suppose that Riddle had left. Then Riddle said, “But even a toddler should know that there’s no point in wasting time on Arithmancy that won’t work.”\nHarry shot him a narrow smile. “If you listened to Diana, you would know that I’m sometimes not much smarter than a toddler.”\nDiana—didn’t mean it, Harry knew. She was dealing with the triple burden of being the Girl-Who-Lived who had rid the world of the Dark Lord Voldemort forever on Halloween night, 1985; having uncontrollable magic that she had to work incredibly hard to restrain because that defeat had propelled her into adult magical strength long before she was ready; and being seventeen years old. She said things she didn’t mean all the time, and apologized for them.\nThe thing was, Harry knew that he wasn’t as smart as the rest of his family. He just had to change things, and then he would be.\n“Show me.”\n“Show you what?” Harry murmured, not bothering to look up this time. “What could I possibly show Tom Riddle, Jr., fiancé of the Girl-Who-Lived and one of the most powerful wizards in the world?”\n“Show me why Heller’s Theorem works.”\nHarry looked up and studied him for a second. Riddle was leaning forwards in that way he had, his eyes focused and intent as a lens being held up to sunlight.\nHarry shrugged. He supposed it couldn’t hurt. It wasn’t like Riddle would be able to guess his ultimate plan from seeing a small demonstration.\nEven if he did, why would he care? Harry wasn’t of any value to Riddle’s ambitious plans the way Diana and the rest of the Potter family were.\nHarry turned one of his parchments over, and showed Riddle the blank side. Then he spent a moment looking down at it, letting the right numbers and associations slide into his mind, concentrating so hard that his vision blurred.\nWhen the balance of associations and numbers in his mind felt right, Harry rapidly wrote down 4 + 11.\nThe air around them tightened and shook as if they were inside one of those globes with fake snow that Harry had seen a few Muggleborns buy around Christmas. The invisible magic rose and then settled back down.\nThe stretch of the table between Harry and Riddle turned to a sleek strip of gleaming human skin, a little darker than Harry’s own.\nRiddle swore aloud, his eyes wide, his face going so rapidly pale that Harry thought he was going to faint for a second. It was the first time Harry had ever seen him so discomposed, and he had to grin.\nThen the strip of human skin snapped back into ebony, and the tight bonds around them parted and faded. Riddle stared at the table as though expecting it to come to life, then glanced at Harry.\n“How did you do that?”\n“Heller’s Theorem,” Harry said, and considered smiling mysteriously, the way Riddle would undoubtedly do if he’d accomplished something like that, and then leaving the room. But the attention was unusual, and gratifying, enough, that he went on. “Heller said that if someone could link numbers strongly enough with particular associations in their mind, they could cause changes in the world itself. I envisioned the 4 as the table, because a table has four legs. The 11 reads as a human to me, because—”\n“It looks like two legs,” Riddle finished. His voice was oddly hollow. Is he upset that he didn’t think of this himself? Harry wondered. But Riddle had got it quickly enough, without Harry even having to explain the significance of the 11. “I—but people have been trying this for decades, since Heller first proposed it, and it never worked.”\nHarry shrugged. “I think there are two reasons for that.” He did pause and eye Riddle. before continuing. It wasn’t as though he and his future brother-in-law particularly liked each other, or Riddle had ever paid him this much attention before.\n“Do go on. I’m fascinated.”\nRiddle’s hollowness sounded like hunger, this time. Harry looked aside, cleared his throat, and went on. “First, most of the people who tested it worked with completed equations, not just individual numbers. Leaving the equation open allows for the temporary effects. If I wanted a permanent effect, I could complete the equation.” But that’s not something I want to do. Yet.\n“That does make sense. Arithmancy relies so much on fantastically complicated equations that we forget the power of the numbers by themselves…” Riddle trailed off. “And the second reason?”\n“People kept trying to assign permanent significations to the numbers. So, in that mindset, a four can only and ever represent the legs of a table. It doesn’t matter what equation you put it in, it’s always a table. I don’t think like that. I can make four represent a table, or a four-legged animal, or a square, or—”\n“Why did I never think of that?” Riddle whispered.\nHarry didn’t bother answering. He couldn’t fault Riddle’s intelligence, or skill at Arithmancy; he didn’t have Violet’s instinctive artistry for it, but he could keep up with her in discussions, which was close enough. And Riddle wasn’t exactly hidebound or traditional, despite his stupid obsession with blood purity.\n“How did you come to think of it?”\nHarry smiled grimly. There was the disdain and contempt he was more familiar with. “I realized that numbers having one permanent significance was silly, when you think about how many different things the same numbers represent in different cultures, or even in ours. Seven is the most powerful magical number, but it’s also the number of days in a week, and that can be as ordinary as you let it. Or not, if you think about using the number seven to shape the time that you live through.”\nRiddle let out an abrupt hiss. Harry kept his hands flat on the table and managed not to jump. Riddle was a Parselmouth, like Diana, and it seemed that he was prone to hissing when excited.\n“I did not think of that,” Riddle whispered in English, finally. “How could I not have thought of that?”\nHarry shrugged a little, and gathered up the parchment that he’d written the incomplete equation on. As he was tapping them together to get them back into a neat pile, Riddle’s hand abruptly caught his wrist.\nHarry snapped around, startled. How did Riddle do there? Harry would have sworn that a second ago, he had been on the other side of the table, and he certainly hadn’t heard the git crossing the distance between them. But here he was now, cradling Harry’s wrist as if it was something precious and staring at him with widened eyes.\n“I need to know more,” Riddle whispered.\nHarry blinked, because that was a very odd reaction to have to wanting to know more about Arithmancy, but sure, he could do that. He tapped his wand against the sheaf of bound parchment that held his notes and duplicated it. He held it out. “Here you are.”\nRiddle didn’t take it. “I want to know more,” Riddle repeated, and then tilted his head a little to the side.\nHarry might not have realized what he was doing, but he’d gone through seven years at Hogwarts with an arsehole of a professor who tried to read his mind at every opportunity. He surged up, smashing the top of his head into Riddle’s nose and driving him backwards.\nThe hold on his wrist broke. Harry cast a few Repelling Charms around his hands and shoulders and stared at Riddle, who was now cradling his nose the way he had Harry’s wrist. His gaze remained as demanding as before.\n\nThat’s odd. I’ve never seen him not get furious with someone who hurt him or stood up to him.\n\nBut Harry laid the idea aside. So what? Riddle wasn’t someone who mattered greatly in his life. Harry had several choices among the equations he could finish to better fit into the family, and either he would become a person who was fine with Riddle as Diana’s spouse, or he would become someone who no longer cared.\n“Tom—oh, no, Tom, what happened?”\nHarry sighed as Diana came running into the dining room. She was a vision in her betrothal robes, white with golden trim, which lately she had taken to wearing everywhere. She was fair-skinned and red-haired like their mum, and her hazel eyes shone gold or green or blue depending on the light. She was beautiful.\nAnd her magic whirled around her like ribbons flung by Muggle dancers, tangling and catching at everything in sight.\n“Harry, what did you do to Tom?”\nHarry would have made a crack about how quick she was to blame him, but in this case, she did happen to be right. He opened his mouth to say “Stood up and slammed him in the face with my head,” and take the blame, but Riddle intervened, clasping Diana’s hand and turning her back towards him.\n“Nothing, my dear. I was clumsy, and Harry caught me before I could fall backwards.”\nHarry stared with his mouth open. Riddle was definitely not the kind of person who took the blame for anything. Ever. Even with Diana, he was always prodding away at her, quietly condescending and asking her to “think” about things. It was one of the many reasons Harry distrusted him.\nBut Diana evidently couldn’t fathom that “Tom” would lie to her. She stared up at him with shining, melting eyes, and then leaned her head on her chest with a little sigh. “It’s all right, Tom. It’s just the nerves from the wedding making you act like this. Everything will be all right, you’ll see.”\nHarry reckoned that was his cue to slip out of the room, given how things were going. He did, but felt a sharp burning sensation between his shoulder blades.\nHe glanced over, wondering if one of them had decided to curse him after all. But it only took a moment of meeting Riddle’s gaze to make him realize what he was feeling.\nUgh, Harry thought as he walked away. Get obsessed with someone else, you crazy fucker.\n*\n“I hate this wedding.”\nHarry smiled a little as he glanced over at Violet, who had flung herself down into the grass beside him. Harry had been lying with his hands tucked behind his head for the past half-hour, in the deep grass that surrounded the Potter gardens and was enchanted to keep the forest beyond it from spreading any further.\nHis sister stared back at him. She was as pale-skinned as Diana, as dark-haired as he was, and had got those grey eyes from their grandmother, probably. She maintained the stare for a moment longer than was comfortable, then rolled on her back and stared up at the clouds, too.\n“I can’t say that to anyone else.”\nHarry blinked, but it would make Violet uncomfortable herself if he commented, so he just peered up into the sky that was a hot, glorious, rare blue. He was surprised, though. Violet didn’t normally display that much awareness.\nViolet apparently had a condition that Muggles called “autism,” according to their mum, or something like it. Mum and Dad hadn’t stopped arguing since Violet was a few years old if autism was something witches could inherit or not.\nHarry didn’t have an opinion in that particular conflict. He knew that Violet seemed oblivious half the time, that she didn’t like social occasions, that she was blunt to the point of not having many friends, that she was great with numbers, that she preferred to be by herself much of the time. He tried to let her do as she wanted, and if she wanted to seek out his company, great.\n“What does Diana see in that arsehole?”\nIt was also rare that Violet asked his opinion, so Harry gave it the consideration it deserved. Violet wasn’t about to get upset if he took too long.\n“I think it’s that he can help ground her magic,” he answered finally. “We haven’t met anyone else who can do that. And he did save her from the basilisk in the Chamber of Secrets.”\n“So it’s just hero worship? You can’t marry someone based on hero worship.”\nHarry had to laugh. “I think a lot of marriages are based on it, at least if you go by novels.”\nViolet made a rude noise to express what she thought of fiction. “I thought Diana was smarter than that. You would be smarter than that.”\nHarry sighed to himself, but nodded and didn’t say anything else. As Diana would tell them, she had made her choices and they had to accept them. And Mum and Dad seemed as head over heels around Riddle as Diana was.\n\nWell, he saved their baby girl. Their precious one.\n\nHarry closed his eyes and retreated into himself for a moment, repeating all the old assurances in his head. It helped that he could hear them in Sirius and Remus’s voices, they had said them so often. And, well, Sirius and Remus had largely raised him from the time he was six years old.\n\nYour parents are only trying to protect you. You know they couldn’t have you around Diana’s magic when it’s acting up like that. She could hurt you.\n\n\nYou know they need some time with Violet. She has—some things she needs help on. \n\nThat much was true. Violet hadn’t spoken until she was four years old. She might not have, ever, if Mum and Dad hadn’t spent so many hours working with her, Harry knew, and taking her to see Healers. They didn’t need the distraction of a loud, impatient boy with his own accidental magic outbursts running around, not when they also had to take Diana to Healers and try to find a way to calm her magic down enough that she could be around other people and attend Hogwarts.\nIt was all true. They couldn’t have dealt with Harry when they were dealing with Diana and Violet, and it wasn’t like they had shuffled him off to some orphanage where they never saw him. They had seen him regularly, every week.\nSirius and Remus had loved him, Harry knew that, and they still loved him. It hadn’t been exile.\nHe was twenty-two bloody years old now. He should be over this.\nIt still hurt.\nWell, Harry thought, staring for a moment at a cloud that looked like half a ritual pentagram, a few more weeks, a few more months, and it won’t hurt anymore.\n*\nHarry sat on the balcony in the back of the house and stared down at his mother’s Potions garden. The soft blue light from flickering charms cast on the wards reflected off the little rills running through the garden, and the stone railings of the balcony, and the house’s windows, and probably Harry’s glasses.\nHarry wished the lights were warmer. Maybe they would melt some of the chill inside him.\nHe had tried. Really, he had. He had gone to the pre-wedding dinner with a quiet smile on his face, and greeted the Weasleys and the Longbottoms and the Abbotts and the Macmillans and everyone else invited. He hadn’t drunk more than a single glass of champagne, and minded his manners when he was eating. He had kept to the background and let Diana and Riddle be the stars of the evening, the way they so clearly were.\nHe knew how these things went.\nAnd he had tried with the gift, a brand-new Defense book that had been published in France the year before but only translated to English this month. Diana’s face had frozen in a grave, polite smile when she’d opened the box.\n“Oh.” She said that, only that, and glanced in Harry’s direction.\nHarry stared back at her. He wanted to say nothing, to let the moment lie awkwardly there and then fly past.\nBut he was always losing control of his mouth, and he’d done it again, despite the smarter voice in the back of his head screaming that it wouldn’t do any good. “It’s brand-new. Only translated this month.”\n“Harry.” Diana had laid the book down and shoved it aside, only a little, but enough to make it feel as though she’d punched him in the chest. “It’s a Defense book. I already know Defense. There’s nothing published in here that I won’t already know.”\nAn awkward chuckle ran around the room, the sound of people who didn’t know for sure whether they were supposed to laugh. Then Diana had sighed and added, “And really, getting me a book on Defense? It’s like you’re one of those adoring fans who doesn’t really know me as a person, and has to make a guess at what I’d like.”\nThat had been the only thing she’d said, and then Riddle had taken up the book and tucked it away somewhere, and Diana went back to opening gifts. Harry had slipped quietly to the back of the room, aiming for the exit.\nHis mother had caught up with him, the familiar mixture of guilt and defensiveness on her face. “Harry—”\n“Don’t. Just don’t.”\nHarry had whispered the words, harsh as they were, but his mother had still cast a nervous glance over her shoulder, as if Diana might hear and have her special moment disrupted, before swallowing and turning back to him. “I know that you didn’t take as many OWL’s and NEWT’s as either Diana or Violet, but you ought to have known—”\n“Yeah, I’m not a bloody genius, I get it, Mum!”\nMum shushed him quickly and glanced over her shoulder again. Diana was laughing about something Riddle had said and wouldn’t notice anything.\n“She’s stressed right now. The wedding—we had to hold a big one, it’s what’s expected of the Girl-Who-Lived, but she didn’t want one. Just give her a few weeks and apologize, and then I’m sure things will be all right.”\nHarry turned without answering and pushed his way out of the room, and into the corridor, and then around corners until he had come to the garden. No matter what he tried to say to his mother at that point, he knew it wouldn’t go well.\nHe leaned his head on the balcony railings and closed his eyes. He never should have agreed to “try” one more time with his family and come to the fucking wedding. He felt tired, worn-out, hollow, the way Sirius had looked on that day all those years ago when they had lowered Albus Dumbledore into the ground, a few years before Diana went to Hogwarts.\n\nCan I go home right now? \n\nBut if he did, or if he was working at the Magical Menagerie on the day that his famous sister got married, he would never hear the end of it. Neither would Aleria Madstrom, his boss. He would stick it out.\nHe was stressed enough, though, that he knew he would make something explode if he went back into the house right now. The only thing he could do that would calm him down was bleed off some of the magic.\nHarry extended his hands in front of him and stared at his empty palms. The magic surged up in his veins as he fixed his mind on the number six.\nSix, for the number of points of a snowflake. Melting, soft, fluid number, like water surging back and forth, coiled in a stream that flowed around a blank, empty pool in the middle…\nHarry breathed out, and light blossomed in his palms, glimmering gently. Six six-pointed golden snowflakes made of light, growing and shrinking, dimming and brightening, danced there, and Harry smiled a little.\nThe ferocity of his fixation on the number six was keeping them here and driving other thoughts he could have had out of his mind. Harry spun his hands, and the light spun with them, the snowflakes rotating around each other.\nSix, Harry thought, and then, Four.\nThe light changed at once, growing solid and heavy, as Harry fixed his mind on a square’s four rectangular sides. But Harry imprinted the slipperiness of six under the solidity of four, and the panes of four-sided crystal retained their lightness, and their golden glow, hovering soundlessly over his hands. Two of them faded out, since four were easier to control when Harry was thinking the number so strongly.\nThis was something he could do. He wasn’t a genius at anything. It had taken him forever to learn to cast a powerful spell like the Patronus Charm. He had got an Outstanding in Care of Magical Creatures more because he really liked animals than because he was instinctively good at it. It had even taken him months to work out Heller’s Theorem and how Arithmancy could help him.\nBut it didn’t matter. As the magic spun around him, consumed and called up by the complexity of what he was doing, he sank more and more towards peace.\nSomeone made a choking noise behind him.\nOne, Harry thought, and surged to his feet, spinning around, as the crystal squares winked out. Between him and the person who had intruded on him, an invisible whip fell from an enormous height, cracking into the ground between them and leaving a long lash mark that looked like the figure 1 seen from a certain distance.\nThe noise was just meant to startle someone and give Harry enough time to compose himself, so he could get out of the situation. But it hadn’t made Riddle—because of course it was bloody Tom Riddle—take even a step back.\nRiddle was staring at him with so much desire in his eyes that Harry curled his lip without meaning to. “Does Diana know that you look at men like that?” he snapped.\nRiddle gave a short, breathless laugh. “Do you know what you just did?”\n“Yeah, nearly hit you with my magic. I’m glad I didn’t. Diana would be upset to have to look at a scar on your cheek for as long as she lives.”\n“I am not talking about that.” Riddle was prowling around to the side as if he thought that he could circle in on Harry that way and take him by surprise. This balcony isn’t that big, wanker, Harry thought, and kept turning to face him, hand resting on his wand now. “I’m talking about the way you conjured light and changed it to crystal.”\n“You were spying on me that long, Riddle? You creepy—”\n“That is not possible.”\n“Ah, yes. Because I’m known for my genius,” Harry drawled. It didn’t hurt coming from Riddle the way it would from his family. Riddle had been “awake” in the world again for five years, after all, and had had plenty of time to see that Harry wasn’t smart, but he wasn’t blood kin.\n“You do not know what I am saying.”\n“No, I don’t. Hurry it up, Riddle. I’ve got a constipated happy expression to practice in the mirror.”\nRiddle halted and stared at him. He didn’t show any evidence of anger, Harry noted, a little uneasy. Riddle always had, before. The fact that it took so little to anger him was one reason Harry had never thought Riddle should marry his sister.\n“You cannot transform light into a solid substance,” Riddle said quietly. “No wizard alive could take a Lumos Charm and turn it into anything—not ice, not water, not crystal as you did. They could conjure ice or water or crystal. But not transform it. Transfiguration only works on solid objects.”\n“That wasn’t a Lumos Charm, and it wasn’t Transfiguration.”\n“I know that.” Riddle kept whispering in a sepulchral voice, as if he was trying to impress a child by telling a ghost story. “It was Arithmancy. You were thinking through numbers in your head again, weren’t you?”\nHarry gave a sarcastic clap. “This is a surprise to you after what I told you this afternoon?”\nRiddle didn’t move, and the way he was eating up Harry with his eyes was becoming steadily more unnerving. Harry jerked his chin up a little. Well, fine, the arsehole could be unnerving. That didn’t mean Harry was going to roll over and bare his belly in front of him.\n“Arithmancy can predict the future,” Riddle said. “It can indicate auspicious days for brewing a potion, or breaking a curse. It can model the likely success of a curse-breaking venture.” His hands were shaking, Harry noticed, until he clasped them behind his back and prowled a step closer. “It cannot affect the physical world, beyond the actual scratches of the quill on the parchment. It cannot transform objects.”\n“And yet, it can.”\n“You have invented a whole new branch of magic.” Riddle sounded drunk, something dark in his voice that made tension skitter up Harry’s spine as he identified it, finally. The dark thing was joy. “You have broken the laws of magic, and invented something new.”\n“Uh.” Harry raised his eyebrows. “How much champagne did you have, Riddle? Better lay off tomorrow. You want to make sure that you’re of some use to Diana on your wedding night.”\nHe spun the words while the sinking sensation in his belly increased. He knew very well that Riddle wasn’t really drunk. And he also knew that Riddle being this fixated on him could not be a good thing.\n“You are unique.”\nRiddle said that as if he was announcing that Harry was made of gold with sapphires for eyes. Harry controlled the impulse to stab his wand through one of those burning dark eyes and controlled the impulse to flee, too.\nThis was insane. Riddle was getting married to Diana tomorrow.\n\nHave you ever seen him look at Diana that way? \n\nHarry breathed through the panic, which he forced back down. No, he hadn’t. But on the other hand, he hadn’t been around Riddle and Diana that much after he left Hogwarts. Riddle had “arrived” at sixteen, which he said would have been his fifth year at Hogwarts; had passed his OWL’s, with flying colors; and had attended as Harry’s yearmate for his sixth and seventh years, while Diana was in her third and fourth. Then Harry and Riddle had graduated, and Riddle had creepily endeared himself to Harry’s parents and Diana and acquired some fuck-off political job in the Ministry, while Harry went on to work at the Magical Menagerie. Diana and Riddle had become engaged at the end of her fifth year.\nHe probably looks at her that way all the time when I’m not around, Harry thought, and wished he could believe it himself.\nBut he forced the notion brutally aside. He could believe it. His brother-in-law was not getting sexually obsessed with him. Or magically. Or whatever the hell he was feeling at the moment.\n“Uh-huh, Riddle.” Harry kept his voice deliberately light. “I’m not the kind of person who invents whole new branches of magic overnight. You know that. And you know that anyone could do what I just did. Heller’s Theorem was only waiting for someone to come along and prove it. Now anyone can use it. Look at the notes I gave you this afternoon. They’ll tell you.”\nRiddle hadn’t blinked yet. Harry didn’t think it was his imagination that a slight red glow had entered his eyes. “But you are the one who did it.”\nHarry shrugged. “First isn’t necessarily best. Good night.”\nHe stepped neatly past Riddle, heading for the entrance into the house. Sweet Merlin, he was tired. And he was going to go home, to his little flat above the Menagerie, and sleep. Maybe things would feel less like they were ruined when he woke u—\nRiddle grabbed his wrist and spun Harry to his side. Harry opened his mouth to protest, and found Riddle bending him backwards over the railing of the balcony.\nUtterly certain that Riddle was going to arrange to drop him somehow, Harry reached out and sank his curled fingers into Riddle’s shoulders. But Riddle stared at him for a moment, still holding him prisoner against the stone railing.\nThen he kissed him.\nHarry opened his mouth to shout a protest, and Riddle’s tongue sank into his mouth. Harry bit it, promptly and hard, but Riddle didn’t back off even though he made a noise of pain. He kept kissing Harry as if he thought that would allow him to drain off Harry’s Arithmancy magic for himself.\nHarry focused his mind on a number he normally didn’t spend much time with and called his magic. Eight.\nA tracery of violent purple light formed around Riddle’s feet in the shape of an infinity symbol and then snapped inwards, wrapping around his legs. Riddle went flying backwards from Harry and to the floor of the balcony, and then, enraged, Harry refocused his mind and lifted the bastard into the air.\nThe next second, Riddle was dangling upside-down from the side of the balcony, connected to the stone only by the rope of Harry’s magic, the loops of the figure eight he was caught in. Harry wiped his mouth and spat onto the top of Riddle’s head, not caring much about the enemy he might be making for life.\n“What the fuck, Riddle?” He wished a second later that he’d waited to speak. His voice was shaking.\nRiddle swung back and forth, and Harry hoped viciously that he would at least regret the stupid kiss with all the blood rushing to his head.\nInstead, Riddle began, quietly, to laugh.\nHarry glanced towards the house and remembered abruptly that Riddle surely couldn’t be gone from the party for long before someone would come looking for him, and Diana would see him dangling Riddle, and—\nHe wouldn’t have a family anymore after that.\nHarry focused his mind on a different manifestation of eight, and the rope swung Riddle back up and over the balcony. He landed in a crumpled heap for a moment, but drew himself up immediately, his eyes shining as he fixed them on Harry.\n“I want you.”\n“Yeah, good luck even seeing me after tomorrow,” Harry said. If he knew Diana, the “insult” of giving her the wrong gift would mean she wouldn’t want to talk to him for weeks, and after that, Harry could come up with a way to avoid his family until his equations were ready.\nShit. He would have to build something into the equations to keep himself from being disturbed by Riddle, which meant he was going to have more work.\n“I always get what I want. Harry.”\nThe way Riddle purred his name made Harry regret that he was bisexual. But he folded his arms and stared back and made one last reach for sanity. “Why in the world would you want me? You have what you want. Diana is beautiful and smart and powerful and performed some kind of magic no one else could do when she vanquished Voldemort.” Riddle’s eyes took on a red glow for a second, but he seemed to be listening, and Harry pushed forwards, heartened by that. “And I told you, anyone can do what I do, they just have to determine their own meaning for the numbers and perfect concentrating on them.”\n“But no one else could have figured it out.”\nHarry shook his head, disgusted and baffled, and walked back into the house. He caught Sirius’s eye as he crossed the entrance hall, and Sirius chased him to the front door and embraced him, briefly.\n“Come over and talk to me and Remus tomorrow?” Sirius murmured.\n“Yeah,” Harry said. He did need to talk to his godfather, to both his foster fathers. “Right now, I want to leave before someone else catches up with me.”\nSirius hugged him again, his eyes sad as he let Harry go. He didn’t say the words that he always had before. She didn’t mean it. It’s hard for your parents. They didn’t mean to abandon you. \nHarry no longer thought the first of those three things was true, and right now, he didn’t care about the other two.\nHe walked out the front door and away from the house, moving at a steady trot until he was beyond the anti-Apparition wards. As he spun on his heel, he caught a glimpse of a dark figure standing and watching him from the front door. The burning sensation in the middle of his chest told him well enough who it was.\nRiddle, you are fucking strange, Harry thought, and Apparated.\n“Is that you, Harry? Come in!”\nHarry smiled as he shook the soot off his cloak and hung it on a peg next to the fireplace. “Technically I already did, Padfoot.” The smells of sausage and eggs drifting from the kitchen were making his mouth water. Sirius had never had a house-elf after he moved out of Grimmauld Place when Harry was still a little kid, but that didn’t matter, not when he was such a good cook himself.\n“Welcome, Harry, welcome,” Remus said, coming forwards with his hand out. He looked so much less tense and stressed now than he had when Harry was young, and Remus was working frantically to keep the secret of his lycanthropy from everyone. After he’d saved the Malfoys’ son, Draco, from a vampire at the risk of his own life, Lucius Malfoy had worked tirelessly in turn to ram laws through the Wizengamot that would give werewolves more rights.\nHarry had gone to school with Draco, and he thought the Malfoys were pompous pricks, but at least they paid their debts. Remus could hold a job now, and he worked in an archive at the Ministry restoring old tomes and scrolls. He could be openly married to Sirius, he could get Wolfsbane for free from St. Mungo’s, and he could trust himself around his best friends’ children.\nHarry thought he always could have, of course. But if the new laws convinced Remus, he would take it.\n“How are you holding up, with the wedding?” Remus asked in a lower voice as he and Harry walked towards the kitchen. Remus had been the one to listen to Harry’s complaints about Diana and his parents, without judgment, while Sirius had always been the one to try and effect a reconciliation.\nHarry shrugged a little. “What she said last night was rude. But what hurt more was having Mum say that I had to be the one to apologize.”\nRemus growled lightly as they took seats on either side of the small table that Sirius delighted in crowding people around. “I wish she knew what saying like things like that does.”\n“Who says what things does?” Sirius grinned as he placed a huge dish of scrambled eggs in front of them, followed by one of sausages, and a platter of toast.\n“You aren’t as clever as you think you are, Padfoot.”\nBut Remus’s voice was soft with affection as he said it, and the glancing hand he let fall across Sirius’s wrist only made Sirius’s grin widen. Harry held his own smile and sipped from the cup of tea Sirius had already floated to sit in front of him.\nHe wished he could find someone like they had found each other, someone who would love him as fiercely and devotedly. But he wasn’t that kind of person. Maybe after he had changed his personality and his intelligence with the Arithmancy equations, then he would be.\n\nAt least I’ll have a happier marriage than Diana will.\n\nHarry grimaced, which he wanted to hide, but Sirius was in the middle of turning around and caught him. “What are you doing?” he scolded lightly as he floated Harry’s plate and fork and spoon in front of him. “No long faces at breakfast!”\nThat was an old rule, that everyone would eat first and complain later. Harry relaxed and reached for the spoon that stuck out of the scrambled eggs.\nSirius snatched it away first, laughing childishly.\nThree, Harry thought reflexively, bringing down the full force of his concentration without effort. The spoon rose from Sirius’s hand, snatched by a small curving breeze that would have formed the upper and lower loops of a three if anyone could have seen it, and then soared over to Harry’s hand.\n“No wands at breakfast, either!”\nHarry was grateful for the table that kept them from seeing that he hadn’t drawn his wand. He smiled temperately and shrugged, making a motion as if he was storing it in his holster again. “Sorry, Sirius.”\n“You don’t have to be serious! Jokes are allowed, just no wands.”\n“Sirius,” Remus sighed, looking as if he wanted to put a hand over his eyes.\nHarry chuckled and returned to eating, glad, too, that he wore the heavy green robes he’d wear to the wedding. They were uncomfortable, but they would account for the flush that was rising to his face.\n\nStupid. Idiot. I can’t believe that I just used that Arithmancy without even thinking about it! That’s not the way it’s supposed to work!\n\nThat was part of the problem with Heller’s Theorem, Harry supposed. It said that it would be easy for someone to use Arithmantic magic for anything if they could control their sense of the numbers. And that meant, in turn, that Harry kept using it for anything.\nNo more Arithmancy until after the wedding, he decided, and finished up his eggs and sausage, and the toast with thick orange marmalade, which was as good as everything else Sirius ever made.\nWhen they were done and leaning back in their chairs, Sirius sighed, sipped the tea, and looked directly into Harry’s eyes. “So what’s going to happen after the wedding?”\nHarry shrugged and glanced down. “I thought I could use the wedding as a chance to talk to my parents and Diana and heal some old wounds,” he murmured. “But it isn’t working. I don’t think Diana has forgiven me for telling her that she shouldn’t marry Riddle. And Mum and Dad are inclined to prioritize Diana over everything else.”\n“Her control over her magic hasn’t got better,” Remus said. “That disturbs me. Did you notice, Padfoot? Yes, it was calm last night, but only because Riddle was sitting beside her the entire time. She ought to be able to control it on her own by now.”\nSirius frowned. “I know. But that’s one reason I think she has to marry Riddle, because we haven’t found anyone else or any spell or potion that can help her control it.”\nHarry nodded and let it slide. His opinion was that something had fundamentally broken in Diana’s magic when she had to confront Voldemort at too young an age, and she would never have control of it again. But that wasn’t something even Sirius and Remus wanted to hear, willing to admit Diana’s faults though they were.\n“I worry about her happiness with him,” he said, with a slight shrug. “Riddle was a pompous prick the two years I knew him in Hogwarts.”\n“He treats her like a princess, though,” Remus said, in a peacekeeping tone of voice.\nIt’s not going to work with them, either, Harry decided, and changed the subject. “So I’m going to try staying away for a while after the wedding. Maybe visit with Violet on Hogsmeade weekends after she goes back to school.”\n“I hate to see you exiled from your family,” Sirius said, waving his teacup around hard enough to make a little liquid slosh over the side. “It’s stupid and senseless.”\n“It’s not really exile,” Harry said, and for a second, he thought about telling them what he planned to do with his Artithmancy equations. Then he dismissed it. They would probably be horrified and tell him that he was good enough the way he was, and that he didn’t need to change to fit in with the rest of the Potters.\nHe did, though. He wasn’t a genius, he wasn’t the kind of person they could accept, and he wasn’t the kind of person who could accept Riddle, who presumably would be married to Diana for the foreseeable future. If he wanted his parents and sisters back—and he did—he had to become one or all of those things.\n“I noticed that Riddle left the room a short time after you did,” Remus said quietly. “Were you arguing with him?”\n“Sort of,” Harry said, because an argument was only a real one when one of the parties wasn’t insane. “At least he didn’t toss the Defense book I gave Diana.”\n“She was rude,” Remus said, with a decisive little nod of his head. “She could have said thank you easily enough in front of the other guests.”\nHarry smiled at him while a rush of warmth went through him. “Thanks, Remus.”\nSirius started to add something, but then paused and turned his head. “Just a minute. The Floo is whooshing like someone’s trying to come through.” He put down his teacup and walked out of the room.\n“I hope you don’t think you need to change yourself to gain Diana’s approval, or your parents’.” Remus patted Harry’s shoulder. “You’re already more than enough of a good person, and they’re under a lot of stress with the wedding. When it’s over, I think they’ll be ready to talk reasonably about things.”\nHarry kept the smile, even though he agreed with none of what Remus had said, and just nodded.\n“Look what the Slytherin brought in.”\nHarry jerked his head around, because that wasn’t the sort of normal thing Sirius said. And walking behind Sirius was anything but a normal sight. Tom Riddle settled his cloak around himself—of course he hadn’t got any soot on it coming through the Floo—and gave them a calm nod and smile.\nWell, maybe Remus thought it was calm. The eyes he locked on Harry burned. \n“Mr. Lupin. Harry. May I join you for the remains of breakfast?”\n*\nThis is insane, Harry thought, sitting back in his chair and trying to be unnoticed while Remus and Riddle politely discussed the latest round of anti-vampire laws that Malfoy was trying to push through.\nAt least he wasn’t being forced to participate in the conversation verbally. But he couldn’t ignore Riddle, either. Riddle had taken the seat next to Harry without asking, just with his natural smoothness that made it seem as if it was the expected action, and hadn’t glanced at him much after he began eating.\nBut beneath the table, his hand rested lightly on Harry’s left thigh, massaging gently back and forth.\nHarry had already tried to move away, and the hand had tightened to the point that it had made Harry hiss. Remus had given him a concerned glance. Harry had shrugged, and Remus had nodded a little and gone back to the conversation with Riddle, probably deciding that the hiss was an expression of displeasure at having to sit next to the future brother-in-law he despised.\nHarry was actually contemplating standing up and ripping away from Riddle, consequences be damned. He might be blamed for Diana’s future husband being obsessed with him—even though he hadn’t done anything—but that would be better than the sharp tingles he could feel racing towards his groin.\nEven if the robes were also heavy enough to hide his erection.\n“I do agree,” Riddle was saying to Remus. “Basing the laws that one is willing to pass or fight for on personal vengeance is short-sighted.” He shrugged and sat back, a move that slid his hand in a long caress up Harry’s leg. Harry tried to jigger himself free, but Riddle merely readjusted his grip without losing a moment. “But I’m afraid that’s the way a lot of purebloods are.”\nMaybe I can irritate him into letting go. “And you’re not?” Harry asked sweetly. “I remember you telling Diana that you think purebloods should be the masters of the wizarding world because you hated the Muggle side of your family.”\nRiddle spun towards him at once, his delighted grin so wide that Harry knew immediately he’d played right into the bastard’s hands.\n\nPun not intended.\n\n“It’s true that I’ve thought that for a long time,” Riddle said, staring at Harry as if no one in the universe had ever deserved to be the center of his attention more. “But lately, I’ve had cause to think otherwise. After all, my future spouse is a half-blood. I’m one myself. Why would purebloods be better?”\nHarry frowned at him, but Sirius was the one who answered. “Damn decent of you, Riddle,” he said, voice thick enough in sarcasm to make Remus frown at him. “It only took you, what? Five years to think about that?”\n“Well.” Riddle tilted his head a little in what could vaguely be called Sirius’s direction without taking his eyes from Harry. “Something happened recently that made me realize how shallow my former stance was. Last night, in fact.”\nHarry couldn’t help the tightening of his shoulders. Remus saw, but apparently mistook the cause. “It’s all right, Harry,” he said. “I’m sure that Tom doesn’t think your gift of a book to Diana was rude.”\n“Of course not.” Riddle’s voice was low, coiling around Harry like a tentacle. “In fact, one should never disdain new knowledge, or assume that one person has the sum total of it.” He sighed and finally turned away from Harry to regard Remus, although of course he didn’t take his hand off Harry, the fucking git. “I apologize for Diana. Her gesture had its value, though, in that it did get me thinking.”\n“Anyone would be lucky to marry Diana,” Sirius said, a warning in his voice.\n“Anyone would be lucky to marry any Potter,” said Riddle earnestly, and his fingers slid softly and teasingly down the inside of Harry’s thigh this time. “Some of them have some awkward traits, that’s true, but those can be corrected in time.”\nHe almost pinched Harry, and Harry had had enough, his earlier promise to himself or not. He brought his magic to bear, in the same quick way that he’d done it with the spoon, so it was likely that Sirius and Remus wouldn’t sense it, and thought, Five.\nRiddle’s fingers bent forcefully back and away from him, all five loosening their grip whether or not Riddle wanted to. Riddle lifted his hand and held it for a moment, out of sight under the table, still talking, as if he thought it might be a natural occurrence.\n\nMaybe I should hope for that. \n\nBut Riddle turned his head a second later, as Remus said something to Sirius across the table, and gave Harry a wink with the eye they couldn’t see. His face shone with excitement.\nAnd Harry didn’t think it was excitement about his upcoming wedding.\n*\n“I think I’d rather Apparate.”\n“You know your mum will kill you if you’re late for the wedding,” said Remus firmly, adjusting the hang of his own red robes in the mirror that Sirius kept in the sitting room, because he was a vain wanker like that. “ And she’ll kill certain other people if they’re late,” he added, raising his voice.\nThere was a bump and a yelp from the direction of the bedroom. “Not my fault Riddle’s theories were interesting enough to keep us talking!” Sirius yelled.\nHarry leaned his back against the fireplace and put his hands in his robe pockets, ignoring the fact that soot would probably get on the back of the cloth, ignoring his own gladness that his erection had subsided after Riddle hadn’t tried to touch him again, ignoring the way that Riddle was bloody staring at him. Although to Remus, it probably looked like Riddle was staring ahead with an abstracted, half-lidded gaze, and Harry just happened to be in the way.\nThey were all going through the Floo together, because it would be faster. And because Riddle had insisted.\nHarry just wanted to bang his head against something solid, Riddle’s skull for preference. What in the world did he think he was doing? He was getting married in two hours.\n“Sirius, honestly!”\n“This Muggle zipper you made me get is stuck!”\n“Excuse me for a moment,” Remus sighed, looking as though he might regret his own marriage, and strode off in the direction of his hapless husband.\nRiddle barely waited until Remus was out of the room. “Harry,” he said, rolling the word around his mouth like a sweet. “Shall I tell you how glorious you look in those robes? Although not as glorious as you did last night, with your magic glowing around your hands.”\nHarry stared at him for a second, and then looked away. He wouldn’t respond, not with words and not with magic. Let Riddle run up against a brick wall, and he would probably give up.\nAlthough Harry would have chuckled if he could have responded any way he wanted without Riddle doing something strange. He thought complimenting the way Harry looked was going to get him Harry’s attention?\nHarry knew exactly what he looked like, and it wasn’t like his sisters, who had had people pining over them for years (although Violet typically never noticed).\n“Harry. Look at me.”\nHarry continued to stare aside. At least something was working. He thought about whistling a jaunty tune, but that probably wouldn’t fall into the category of truly ignoring Riddle.\nRiddle crossed the room to him in a near-silent stalk. Harry stared at him. And what was he going to do now, when Sirius and Remus would probably be coming back into the room at any second?\n(Probably. From the muffled voices that came to Harry, Sirius’s argument with the zipper was ongoing).\nUp close, Riddle looked like a hungry wolf. Harry wanted to shake his head. Was Diana just blind? Or did he truly never wear this expression around her?\nA disquieting idea occurred to Harry then, and he asked it before he could think better of it, the same way he had tried to defend himself at the party last night against his better judgment. “So are you faking that you want me, or are you faking that you want Diana?”\nA wave of light seemed to roll over Riddle, rising up from inside his chest and swamping his face and eyes. “Which do you think is more likely?’\nOh, well, if we’re playing guessing games. “Me,” Harry said, both because he wanted it to be true and because it most likely was. Riddle had attached himself to Diana from his first days out of the diary. Even if that was because she was the Girl-Who-Lived more than because he loved her—like he was capable of love—why abandon the plans of five years because Harry had displayed some odd magic?\nFrom the way Riddle talked, he wanted to go into politics, and Diana did offer him some political power as her husband, especially if he could poke and prod her into doing things herself. Harry, on the other hand, could offer…\nWhat? The ability to be an expert on how much food people typically purchased for their Kneazles in a given day?\nHarry snorted, and Riddle paused. “I amuse you?”\nHis voice had sunk into a low, rattling hiss. Harry stared back at him, unafraid. “Well, yeah. I know that you’re probably not attracted purely to a person’s looks, but to how much power they have. And that makes Diana your best choice. Marrying a war heroine who can garner political goodwill at the crook of a finger—”\n“I am attracted to power. There is more than one kind.”\nRiddle had come close enough now to rest a hand on the stone of the fireplace above Harry’s head. Harry didn’t back down or back away. Riddle was bizarre, but Harry was sure of his read on the git. Riddle had spent the last five years maneuvering for political power, securing it by making himself the hero of Diana’s personal fairy tale and then the probable husband of the Girl-Who-Lived. The connections he could make among the people who had been at the pre-wedding party last night alone would outweigh in value anything Harry could give him.\nThere had been a point when Harry even thought Diana might listen to him if he told her that. Well, he was less naïve than that now.\n“You are incredible,” Riddle said, his voice a growl. “You could change the world.”\nHarry laughed at him, and moved away from him as he heard Remus and Sirius returning. “I have no such ambitions.”\n“I have.”\n“So take the bloody notes I made you and work the Arithmantic magic to your own advantage,” Harry snapped, lowering his voice. Remus and Sirius were right outside the sitting room door, although by the sound of it they were arguing about something else and might not hear him. “You can do it. Anyone can do it, now that they know how! If anything, you ought to do it better than me. You’re more powerful than I am, more intelligent.”\nRiddle stared at him with a blank face. But this didn’t look like the blank face he used to fool Diana and the others that he had their best interests at heart. It seemed to be the sort worn to conceal shock.\n\nWhy?\n\nBut the door swung open, and Remus and Sirius entered, and Harry dismissed the thought. Fuck the idea of reconciling with his family. He would leave as soon as possible after the ceremony and spend months away. He didn’t have to spend time around them to perfect his equations. Twenty-two years of memories were more than enough.\n“Ready to go, boys?”\nThat was Remus, sounding, as his eyes flickered back and forth between Harry and Riddle, as if he understood that tension existed, but not what had caused it. Sirius was too busy sulking about the zipper on his robes to care.\nHarry gave him a bright smile. “Of course,” he said, and made sure to be the first through the Floo.\n*\nThe Potter gardens had been utterly transformed in anticipation of Diana’s wedding.\nShe had chosen an airy theme, and so everything floated. The arch of intertwined white flowers, most of them lilies, that framed the entrance to the closest seating area didn’t touch the ground. The tables revolved slowly through the air beyond the arch, the chairs dancing in perfect harmony with them, and dangled inviting ladders down to the ground. The air itself sparkled and glowed with arches of power like rainbows visible only edge-on, wards that protected the wedding party from incoming curses. Diana had got threats from both former Death Eaters and people who wanted to marry either her or Tom Riddle themselves. Everyone took her safety seriously.\nThe trees around the gardens had been charmed to shine blue, like the lights on the wards around the Potions garden last night. Harry walked along the shining stones of the path that had been charmed the same way, and watched water rising and pouring back into its pools, and the sway of flowers charmed blue and white, and thought, An hour. Just one more hour.\nViolet was walking ahead of him in rich red robes she had chosen herself and which no one had been able to talk her out of. She carried a large ivory bow that the Witches’ Wonderful Wedding Shop had made for Diana in honor of her namesake, the hunter goddess. Violet was supposed to fire an arrow into the air when the happy couple kissed.\nHarry, meanwhile, just had words to speak. He was more relieved than he could express.\n“Harry.”\nHe glanced up to see that Violet had turned around and was walking backwards, holding the bow and staring at him. People had to dodge out of her way to avoid her, not that she would care about that.\n“Yes?”\n“I worked a predictive equation this morning. I was trying to see how happy Diana and Riddle would be in the marriage.”\nHarry held his tongue over the immediate thought that Arithmantic equations couldn’t predict things like that. Perhaps for Violet, for whom the numbers danced, they did. And he should be the last one to speak about what was and wasn’t possible with Arithmancy. “Yes?” he repeated encouragingly.\n“I got no answer. The equation dissolved into gibberish, and the numbers changed as I was watching them.” Violet stopped in place, and shivered. “What do you think that means?”\nIt was so rare that she expressed this level of emotion, pain stamped into the lines of her face, that Harry moved forwards and put a cautious hand on her shoulder. She actually turned towards him, and nestled into his side. Harry transferred the hand on her shoulder to a whole arm around her.\nGranted, the pain was probably more about the idea that she had somehow lost her gift for Arithmancy than the idea that Diana and Riddle might not have a happy marriage. But Harry still ran a gentle hand up and down her back until she sighed and relaxed against him.\n“I don’t know,” Harry said. “It might be that their emotions are complex enough that it wasn’t a good question, though.”\n“The question.” Violet lifted her head, staring at Harry as if he was the genius around here. “I never thought of that. If I asked the wrong question, and then focused my mind on predicting the outcome for the right one, of course the equations would dissolve.”\nHarry looked at her thoughtfully. So Violet also knew about the importance of fixing her mind on numbers? It had never occurred to him that he could share his Arithmantic magic with anyone in the family before, but maybe he could.\n“I think that’s much more likely than you suddenly not being able to use the magic you’re best at.”\nViolet nodded, and then stepped hard away from him. Harry let her go, and she went back to parading along the path with the bow, her back straight and her head uplifted.\n\nWell, at least I can be a comfort to one of my sisters.\n\n*\nThe nearest seating area was full of people, crowded around the little floating tables, sometimes sitting two to a chair or in a Transfigured seat that Harry sincerely hoped wouldn’t break apart in midair. The last thing they wanted to disrupt Diana’s wedding was a guest becoming a huge smear of blood across the ground.\nHarry’s idly wandering gaze caught that of Draco Malfoy. The Malfoys were no friends of the Potters, but of course it wouldn’t do to have them miss this momentous occasion. Draco lifted his glass of sparkling white wine to Harry, his gaze cold.\nHarry snorted and looked away. Draco had also mocked Harry’s intelligence during their Hogwarts days, saying at one point, “Well, we can tell that the famous Potter hesitation between Gryffindor and Ravenclaw didn’t happen for him.”\nNo, it hadn’t. The Hat had hesitated for him—and for everyone else, although Violet had gone into Ravenclaw instead of sharing the lions’ House with him and Diana—but not between Gryffindor and Ravenclaw.\nHarry watched with bored eyes as more and more guests continued to file in, including the press, Ministry officials, celebrities like Celestina Warbeck, the Minister for Magic, Hogwarts professors, some people from Durmstrang and Beauxbatons, assorted Weasleys, assorted members of the Wizengamot, a few shopkeepers from Diagon Alley, and anyone else who had been able to cadge an invitation.\nHarry had privately rolled his eyes over some of the people that Diana had apparently bumped into the street and invited. Mum and Dad had cooed about what a giving nature it showed. But all Harry could think was that if she didn’t want to have a big wedding, she shouldn’t have had one.\nAt last, at long last, the chorus of invisible trumpets sounded, and Diana and Riddle paraded into the gardens, beneath the floating tables, to the disc of enchanted crystal that would loft them to the floating officiant in his golden robes and benevolent smile. Harry sat up and laid his feet on his own disk of crystal, floating nearly invisible beside the chair. But he didn’t fly over yet.\nHe had to ignore the temptation to use his Arithmantic magic to do it, too.\nDiana and Riddle’s disc rose sparkling from the ground, spinning slightly, as if to give everyone the chance to view the perfect bride and groom. Diana was smiling, her face so open that Harry felt a pang in his heart. God, he hoped Riddle was good to her.\nRiddle himself bowed his head and gave that smile that apparently, according to the Daily Prophet, made him look mysterious and sexy. Harry knew it wasn’t sincere. He hated it.\nAnd he hated the way that it became sincere for a second as Riddle’s eyes swept across him.\n\nI should just hate everything about him, and save some time.\n\nAnother reason to take a holiday from family matters after this. Riddle and Diana were about to start a new life together, and Diana had made it clear that she wouldn’t listen to any criticism of her “lifemate.” It was best for everyone if Harry was far away.\nThe crystal disc rotated around, and came to a stop in front of the officiant. Then it thinned away, out of sight, although Harry knew that was only the color bleeding from it. It would remain thick and steady, holding Riddle and Diana up.\n\nTime to go.\n\nMum and Dad were already riding a disc of their own up from the opposite side of the gardens, where they had burned a small offering to the powers of happiness. This was a very traditional wedding, Harry thought, as he kicked off on his own disc and sped away from the table towards the happy couple.\nOf course, it could be even more traditional if Riddle had actually loved Diana.\nBut Harry dismissed that idea. It wasn’t his place, really. Diana had made her choice. Harry had to live with his own, not anybody else’s.\nRiddle’s eyes fixed on him unwaveringly as Harry’s disc came to rest on the right side of the officiant, while Mum and Dad took the left. Violet was back and away, near her own table, where she would fire the arrow when the actual wedding ceremony was complete.\nLucky, Harry thought, and turned away from Riddle’s eyes to listen to the officiant speak. He was blathering on about the happiness of a lasting union, and how the joining magic would render both Riddle and Diana faithful and completely bound to one another.\nHarry held in a snort. Maybe, once, that would have been true. Now, couples didn’t want to be trapped in an unhappy union for life, so the words were said for form and less constricting vows were actually made with magic.\nNot that Diana looked as if she would ever wish to disentangle her life and magic from Riddle’s. She was staring up at him in absolute bedazzlement, her hand stroking back and forth on his arm.\nRiddle had his head bent, a half-smile on his lips that was only aimed at her by courtesy. Harry knew exactly where his eyes were focused, exactly who the smile was for.\nHe ignored it.\nHe would be one of the official witnesses for the kiss, and then he would speak the words that said, “This man and woman are tied together.” Simple enough. Mum hadn’t even made him practice them more than once.\nThe officiant finished his speech and moved to asking the traditional questions. “Who comes forwards to claim this man?”\n“I do,” Diana said, her voice soaring with confidence.\n“Who comes forwards to claim this—”\n“I do,” Riddle said, and smiled again. The main effect was to curve his smile a little further up his face.\nHarry rolled his eyes, and didn’t care who saw him. Well, the only one looking was Riddle, anyway, and Riddle only gave one slow blink, as if to say that he acknowledged Harry’s objection without truly caring about it.\n“Who will tangle her life with her spouse’s, share the magic and the joy and the happiness of being?”\n“I will.” Diana spoke the words in a lyrical, soaring voice that made Harry think he had never seen the difference between them more. His determination to use the equations that would change him into a better person hardened. Whether it was to become someone who wouldn’t mind how average he was in comparison to every other Potter or someone who could match them, something needed to change.\n“Who will tangle his life with his spouse’s, share the magic and the joy and the happiness of being?”\n“I will.” Riddle sounded quietly confident now, which seemed like a change in mood, but Harry wasn’t going to satisfy the bastard with even too direct a glance.\n“Who will be sword and shield for her spouse, who will rise to the challenges of life that beset the two of you?”\n“I will.” Diana still shone, her hands clasped in front of her. Out of the corner of his vision, Harry could see Mum whipping out a handkerchief to wipe her eyes.\n“Who will be sword and shield for his spouse, who will rise to the challenges of life that beset the two of you?”\n“I will.” Riddle’s voice was definitely louder than it had been a moment ago, and he turned his head to catch Harry fully in his gaze.\nHarry blinked. A faint alarm began to ring in the back of his mind. But he didn’t understand what it would be for. There was only one more vow left, and the kiss, and his witnessing, and Violet shooting the arrow. That was all.\nSurely even that prat Riddle couldn’t manage to mess up that much with so little time to go.\n“Who will remain faithful and loyal to her spouse, bound by a magic that joins unto death?”\n“I will.”\nHarry snapped his head around. That was the ancient vow, the one that made it almost impossible to divorce, the one that Riddle and Diana had said specifically they weren’t going to use. Was Diana mad? Or had Riddle persuaded her to do this so that he would always have a hold on her?\nDiana wasn’t looking at Harry, and didn’t seem to notice the confused murmur, or the coos of those who thought it was romantic, rising from the throats of those who could only hear the vows via the wide-ranging Sonorus Charm. She had lifted adoring eyes to Riddle’s face, and he reached out and ran a finger down the side of her lips.\n“Who will remain faithful and loyal to his spouse, bound by a magic that joins unto death?”\n“I will,” Riddle said, and then gave a half-bow that wrenched his hand out of Diana’s. “But I claim the prerogative that comes with the ancient form of wedding, to bind myself to the spouse whose magic most closely matches me in potential.”\nThat made more than one person gasp, but from the complacent smile on Diana’s face, she had been expecting this. She nodded and said, “That is more than acceptable,” before closing her eyes.\nHer wild magic rose around her, shining blue-green ribbons visible to everyone this time, and there were gasps of fear, but also wild clapping. Most people knew that being so close to Riddle calmed her power down, so they leaned forwards and watched avidly to see what would happen next.\nEven at floating tables that she can knock down, easily, Harry thought.\nRiddle’s magic unfurled around him, shining, deep, dark, a maelstrom of incredible blue with glints of red and green. It turned and turned, reaching out and tugging—tugging—\nShit!\nHarry’s magic burst out of him in response. It was ragged and green-gold, tumbling around itself in intense swirls that were somewhere between Diana’s ribbons and Riddle’s maelstrom. Harry had never seen it before. He wasn’t powerful enough to have this happen.\nEven as he shielded his eyes from the shine of it, he saw the form twist more and more towards a whirlpool, or a tornado, centered on him. And he saw the moment when the edges of the green-gold blended with the waters of darkness around Riddle.\nMore, he felt it.\nHarry shuddered as the edges touched and ran together like wet watercolors. The crystal disc he stood on whirled forwards and crashed into the suddenly separate one occupied by Riddle. Harry had thought he and Diana were sharing the same disk, but apparently it was two overlapping ones.\nOr had been. Now they were separate, and Riddle laid his hands over Harry’s and said clearly, “By the ancient form of wedding, I bind myself to Harry James Potter in fidelity and loyalty, as his sword and shield before the challenges of life, with my magic tangled with his and to share his magic and joy and happiness of being. Let none say that he is bound to me, but me to him.”\nRiddle gave Harry a smile as poisonous as a gargoyle’s, and added, “I come forwards to claim this man.”\nThrough the shattering of his own inner peace, the fierce haze of his anger, and the scandalized shrieks of the guests, Harry most clearly heard, for some reason, the twang of Violet shooting the arrow.\n“Fuck off,” Harry hissed, knocking Riddle’s hand away as the wanker once again tried to rest it on Harry’s shoulder.\nHe’d yelled the same thing at full volume when they were in front of the crowd, which, thanks to the Sonorus Charm, had traveled all the way around the gardens. At that point, his mum had canceled the Sonorus and hustled Harry and Riddle and Diana towards the house. Sirius and Remus had followed them, while Dad stayed behind to placate the crowd and presumably collect Violet. At least, Violet had been with him when they’d come into the formal dining room where the rest of them had gathered in tense silence.\nViolet was the only person in the room who was smiling, besides Riddle, and Harry didn’t think insane smirks should count as smiles. Violet walked over to hug Harry. “Now I know why my Arithmantic magic was wrong. I should have been asking a question about your marriage.”\n“You knew about this?” Diana asked, surging up from her seat, where Sirius and Mum had been keeping her seated. “And you conspired with Harry to betray me, Violet?”\nViolet stared at her, eyes wide. “Riddle did that of his own free will, Diana. How are you this stupid? I knew that you were lazy because you didn’t try to contain your magic, but I thought you were lazy, not stupid.”\n“Violet, that’s enough!” Dad thundered. He had walked over to stand with his own hands on Diana’s shoulders, and Harry didn’t think it was to push her back into her chair and keep her from attacking someone. “Your sister has just been jilted and betrayed and humiliated in front of thousands of people. Have some sympathy for her.”\n“She didn’t have to invite the thousands of people, though. It was her own fault.”\n“Violet, enough,” said Mum, and turned to stare at Harry. “Is that why you didn’t want your sister to marry Tom? Because you were in love with him yourself?”\nRiddle opened his mouth as if he wanted to be the one to answer, but Harry beat him to it. “No, I’m not. He’s a worthless berk who was going to try and score political points using Diana. That’s the reason I warned him away. And then he made a fucking stupid decision, and bound himself to me.”\n“Yes, one-way only,” Riddle said, in the same eerily calm voice he’d used to say that he’d bound himself to Harry. “I wanted to emphasize that. I am bound to be faithful to Harry and act as his sword and shield, but he is not bound the same way.”\n“Wait, though.” Violet sounded interested. “Does that mean that Diana is also tied to you, but you aren’t tied to her?”\n“No,” Riddle said, while trying to move his chair closer to Harry. Harry thought, Four minus one, and watched in satisfaction as Riddle’s chair wobbled due to the disappearance of one of its legs. Riddle, the prat, only took advantage of it by standing up and moving behind Harry’s chair, resting both hands on Harry’s shoulders to mirror the way Dad was standing with Diana.\nOr trying, anyway. Harry shrugged angrily, and then used the same concentration on five that he’d used this morning to bend Riddle’s fingers away from him. Riddle clasped his hands behind his back in return and smiled down at Harry.\nThere was the hunger in his eyes, anyway.\nHarry tried to stand up and storm off, but Riddle moved just a little to block him without seeming to, and said, “To complete the ancient form of the wedding rite, all the vows need to be recited in reverse order at the end, as I did with Harry. I am bound to Harry, but Diana is not bound to me. She can find someone else.”\n“What about Harry?” Violet asked, propping her chin in her hand. She sounded fascinated.\n“Oh, he could find someone else. But I cannot.”\n“That is the fucking maddest thing about this,” Harry cut in. “Listen, Diana, this is all Riddle’s fault. I never wanted him. I don’t want him. I’m sorry about your wedding. I never would have attended if I’d had any idea that he would do this.”\nOf course, the more Harry thought about it, the more he thought he should have known. After all, Riddle had cut off the officiant before he could ask Riddle about claiming a woman, and he had sat right there in Remus and Sirius’s house this morning and talked about a “spouse” who would be a half-blood.\n“You betrayed me,” Diana whispered. The tears were creeping down her cheeks—she wept as beautifully as she did everything else—and ribbons of blue and gold spiraled up and began to tug at the walls, the chandelier above them, the table, and everyone’s robes.\n“You are perfectly capable of controlling your magic,” Riddle said, sounding as bored as Violet. “Do it, Diana.”\n“You betrayed me.”\nStill Diana was only focused on Harry, and Harry felt a moment’s savage despair. Yes, he had known that would happen. Diana was still too much in love with Riddle to accept that he had chosen Harry over her.\n\nBecause he’s an idiot.\n\nAnd from the looks of it, Mum and Dad were tending the same way. Mum shook her head, her expression weary. “Is that why you were so against apologizing, Harry? Because you knew that this greater betrayal was waiting in the wings, and you thought you were in the right enough to steal Diana’s fiancé from her?”\n“I don’t want him!”\n“I want him, however,” Riddle said, his voice absurdly polished and polite. “I am sorry that Diana is unhappy right now. I do hope she finds someone else.”\nAnd he can sound that cold, that detached, Harry thought in numb wonder, when he spent the last five years pretending to love her and courting her and becoming engaged to her…\n“That only shows how stupid you are, Harry,” Diana said, her hands trembling as she laced them together in front of her. “Anyone would want Tom.”\n“Oh, fuck off with calling me stupid when you were so dumb that you thought he was actually in love with you,” Harry snarled.\nMum and Dad both gasped, and more tears poured down Diana’s cheeks. Remus cleared his throat and jumped in. “Listen, if this is—this isn’t permanent, because they aren’t really married. Just halfway. We should be able to undo the bindings, even, since they don’t tie both Harry and Riddle to each other.”\nHarry wasn’t looking at Riddle, but he still knew the fucker had widened his eyes just from the tone in his voice. “Oh, I’m sorry. Did I not mention that? Or perhaps you didn’t know as much about the ancient vows as you think. My magic is bound for the rest of my life. Committed by a vow I took of my own free choice.”\nThat stung Harry hard enough to make him whirl around. “But not mine!”\nRiddle bent towards him, smirking, his eyes taking on the slight red glow that Harry had seen a few times already. “But that does not matter.”\nAll the pain, all the anger, all the frustration and anguish and the sense of losing his family that Harry had feared would happen just because he wouldn’t be able to reconcile with them, crested in him, and he clenched his hand and jerked it sharply at Riddle. In his mind, he thought fiercely of an eleven, and it coalesced as firmly as planks. Then he thought of a four, and twisted the two numbers viciously together.\nRiddle had a moment to look surprised before his face began to bulge outwards. His head did the same thing at the top, and his arms extended down in front of him, and grey fur sprouted to sheathe his limbs, and a few seconds later, a large and still surprised-looking donkey stood behind Harry’s chair.\nThere, Harry thought, even as he fell back exhausted in his chair from the effort of doing Arithmantic magic without his wand and, for the first time, altering another human being’s body. Chew on that. You berk.\nThe silence that settled over the room lasted a longer time than the moment or so of silence that had followed Riddle’s ridiculous binding of himself to Harry. Then it was broken as Riddle shifted a hoof and his long ears, and turned as if he wanted to stare along his spine at his new tail.\nTwo sounds followed that, intermingled. Violet laughing harder than Harry had ever heard her laugh, and Diana wailing.\n“He hurt Tom! Turn him back, Harry!”\nHer ribbons of wild magic were shaking the walls again. They had calmed down for a few minutes after her initial accusation of betrayal, Harry noted quietly to himself. So she could control it when she wanted to. Or be distracted from it.\nThat made a new thought come to him, for the first time, while his parents and Remus and Sirius seemed to be trying to find words. Harry stared at his sister and called up the number zero as a shining hollow ring in his mind, although he didn’t know if he would be able to do much with it, after the effort it had taken him to transform Riddle.\nBut he squeezed the invisible ring tight around Diana, and her magic spiraled back in towards her body. Diana’s face went slack with surprise. The ribbons that had been pulling at the table and walls vanished.\nI can do it if I have to, Harry thought, and swallowed a lump of grief. If he had discovered the potential of Heller’s Theorem when he was younger, then he might have been able to calm Diana and spend years at home with his family. She might never have been so attracted to Tom Riddle if she hadn’t relied on him to calm her magic.\n\nSo many years lost. So many mistakes that I can never undo.\n\n“This is ridiculous,” Remus said faintly, over the muffled chokes of Violet’s laughter.\nRiddle probably meant to agree, or make some smooth speech, but instead, he brayed. Harry glanced sideways at him and found those dark eyes—donkey’s eyes—staring at him accusingly, and had to look away hastily.\nThe problem was, then he just caught Violet’s gaze, and both of them started laughing at the same moment.\n“Enough!” Dad thundered, probably the one person who could have shut them both up at the moment, rapping his fist down hard on the table. “Harry, this is an untenable situation. You must turn Tom back at once and release him from the binding. Then you will properly apologize to your sister and leave until we can figure out an appropriate punishment.”\n“He said he didn’t want Tom, Dad,” Violet pointed out. “Why do you want to punish Harry?”\n“I think that’s a little extreme, James,” Remus murmured at the same moment. “We can figure something else out.”\n“Well, we have to do something to dissolve this pseudo-marriage,” Mum said. She hadn’t looked directly at Harry since they came into the house, Harry realized abruptly. She was looking at Diana instead, her hand smoothing down Diana’s hair almost compulsively. “It is a ridiculous situation, and untenable, as James said. Regardless of whether Harry wanted to be married to Tom, he is married to him, and he should be the one to dissolve the marriage.”\n“So it doesn’t matter that I didn’t want to marry him?” Harry snapped. “That I didn’t want to see Diana humiliated in front of that huge crowd of guests?” His mother had hustled him out of sight so quickly that he didn’t even know what had been done with the guests, but he was going to ignore the question right now, when he had more important things on his mind. “You think that it’s all my fault?”\n“I said that you’re the one in the situation, so you’re the one who should fix the situation.”\n“What about bloody Riddle? Why doesn’t he have to fix it?”\nMum looked at him over Diana’s head, her eyes full of weariness and fear, and mouthed, Don’t upset your sister. \nDisappointment and regret cascaded over Harry. So that was it. Mum, and probably Dad, were still so afraid of what Diana’s accidental magic might do that they wanted Riddle to bind himself to her. Harry had overheard a conversation between his parents a year or so ago when they had mentioned how nice it would be to free themselves from the constant burden of tiptoeing around Diana, never knowing what would upset her and make her lash out, and then having to ride the storm of magic until they could calm her down again.\nOnce again, he was a sacrifice to his sister’s well-being.\n“Let me fix this, then,” Harry said, given strength by rage when he wouldn’t have been by anything else, and turned in his chair to face Riddle.\nRiddle’s eyes fixed on him immediately. He hadn’t ceased to look surprised, as far as Harry could read emotions on a donkey face. He tilted his ears at Harry, but didn’t move.\nArithmantic magic had been good for everything else, Harry thought. It should be more than good enough for this.\nHarry closed his eyes, envisioning the figure of a seven in his mind. The most powerful magical number, and probably the only one that could help him now. He piled the belief into the figure, and then followed it with his magic. The seven spun and danced in his mind, and Harry hurled it edge-over-edge, like a boomerang, in Riddle’s direction.\nIt should cut through the tangling of their magic and undo it. Then the binding would be undone, and Riddle would be free to marry Diana if she was still moronic enough to want that, and Harry would be free to dance off on his merry way.\nInstead, the hurled figure meant no resistance, and the only visible result, when Harry opened his eyes, was that Riddle had staggered back several steps. He huffed out his nostrils at Harry, and then let out a deafening bray.\n“What did you do?” Diana demanded.\n“How are you doing this?” Remus asked.\nHarry not-answered both questions, staring at Riddle the while. How could that have failed? Was it just because he was so weak right now, that he hadn’t been able to give the figure the proper charge, or was Riddle being a donkey instead of a human somehow making the difference? “I thought I could disentangle my magic from his. It should have been simple. The binding was entirely unwilling on my side, and—”\n“I know the answer to that.” Sirius sounded grim. “It was willing on Riddle’s side, Harry. Your magic has nothing to do with it. You can cast any spells you like and not affect him, you can go off and marry someone else, you can travel to the other side of the world and it wouldn’t hurt you. But he can’t marry someone else. He swore his magic to the defense of you. He’s bound, but you’re not.”\n“So the only way is to make him violate the vow?”\n“The ancient vows can’t be undone.” Remus’s voice was low. “You know that, Harry. You know that was one reason that people discontinued the use of them in their weddings.”\nDespair replaced the rage entirely. Harry closed his eyes and rubbed his forehead. So that meant he was bound, because Riddle had made sure that he was going to a be constant presence in Harry’s life no matter what.\n“You bastard,” he whispered.\nRiddle moved towards him and lowered his head as if he would nuzzle Harry. Harry stood up from his chair and moved away. His emotions were too strong to let him stay sitting down, or accept a touch from the git.\n“Mum, Dad, make him let Tom go.” Diana was shaking her head. “It must be a mistake. We know that Tom didn’t mean to marry him. He was going to marry me. This is a trick.”\n“Oh, shut up, you arse,” muttered Harry.\n“Don’t call your sister names.” Dad’s voice was stern.\nHarry shook his head and walked out of the room. A clatter of hooves behind him announced that Riddle was following. Harry gritted his teeth and didn’t look over his shoulder. He didn’t know when he would have the power to change Riddle back to human form, and he didn’t know when he would have the moral strength to go back and face his family.\nHis belly burned and coiled with so many emotions that he didn’t know if he could separate them. The Arithmantic equations that would change his personality into one that wouldn’t give a shit what his family thought were looking more and more inviting.\n“Harry! Harry, wait, damn it!”\nThat was Sirius. Harry turned around and leaned against the wall with his arms folded, resolved to walk away if his godfather spoke one word of blame.\nBut instead, Sirius wrapped his arms around Harry and held him tight for a single moment. Riddle snorted. Sirius ignored him as easily as he would have ignored any real animal, drawing back to stare into Harry’s eyes.\n“I know you had nothing to do with this. It was so easy to tell, watching the way you interacted with Riddle at breakfast this morning.”\nHarry exhaled and closed his eyes. All right. So at least Sirius wasn’t blaming him. He didn’t know what to do about Mum and Dad and Diana, though. Any chance of reconciling with them was probably gone forever.\n“We’ll do—something—to help you out of this.” Sirius glanced at the donkey then, his eyes narrow. “And Riddle, too. We can’t end the binding, but we can try to make sure that he doesn’t hurt you.”\nRiddle tried to bite Sirius. Sirius gained a nasty smile, waved his wand, and conjured something smooth and black that Harry didn’t understand at first, at least not until Sirius looped it around Riddle’s nose and drew it tight.\n\nA halter. \n\nRiddle tried obviously to spin in place and kick Sirius with a hind hoof, but Sirius dodged it, chortling. Then he tugged on the halter and said mockingly, “Come on, be a good boy, let’s go home and you can have a nice meal in the stables.”\nRiddle tried another kick, but this time, Remus, who had come up behind him unnoticed by either Harry or Riddle, cast some kind of spell that tied what looked like muffling bags secured with string around Riddle’s hooves. Riddle staggered and barely got his fourth leg back to the floor in time to keep from falling over. He laid his ears back and snapped his teeth threateningly behind the muzzle.\nHe was looking at Sirius, though, and not at Harry, even though it was Harry who had done this to him. Harry swallowed. He was beginning to fear that it wouldn’t be as easy to discard Riddle’s obsession as he had thought it might be.\n*\nSirius actually did have a stable, even though he’d got rid of the last of his Granians years ago. He freed Riddle of the halter and hoof-muffling bags, and then winked at Harry. “Keep him company for just a little while and make sure that he doesn’t destroy the stable. I’m going to go buy some hay. There’s a bucket of water if you want to ease his thirst.” Sirius walked down the aisle of the stables and away, whistling.\nRemus stayed behind, maybe to make sure that Harry didn’t destroy Riddle. He was studying Harry with a complex expression on his face, but said nothing. Harry snatched up the bucket and went to fill it with water.\nRemus followed him outside and stood there watching, saying nothing. He only spoke when Harry had filled the bucket full from the ancient pump and was trying to find the most comfortable way to carry something full and dripping over his arm. “How did you turn Riddle into a donkey and try to disentangle your magic from his?”\nAt least he doesn’t seem to have caught me soothing down Diana’s magic. Harry sighed and nodded at the bucket. “Can you Levitate this for me? I’m too magically exhausted to do it.”\nRemus nodded and drew his wand to perform the charm without taking his eyes from Harry. “And you’ll explain to me what you did?”\n“Yes, but let’s wait for Sirius to get back first. I only want to explain it once.”\nThey made their way back into the stable, and Harry dumped the water into the trough. He was braced to move out of the way if Riddle tried to bite him with those big teeth—maybe he should have transformed him into a tiny dog instead or something—but Riddle rested his chin on Harry’s shoulder instead, his eyes wide and considering.\nThen he plunged his nose into the trough and drank.\nHarry sighed and leaned on the wall. Remus continued to watch him, but after a few minutes, his eyes softened and he murmured, “What a mess.”\nHarry nodded harshly. He wished things could change. He wished Diana had never met Tom Riddle. He wished Riddle had never learned about his Arithmantic magic, since that was apparently the reason he had decided to fuck up his life, and Harry’s, and Diana’s, and their parents’.\n\nWhat is it about me? I seem to drive my parents and Diana mad simply by existing, and I drove Riddle mad the minute he learned something I was keeping secret. Maybe that exile would be a good idea after all, just as an exile from everyone.\n\nSirius returned with the hay about twenty minutes later, and some other things that one of the pet shops in Diagon Alley had apparently recommended for donkeys. He dumped it all into the manger, and some straw on the floor, and he then wrapped his arm around Harry’s shoulders.\n“You’re not going to have enough power to turn him back until at least tomorrow, right?”\n“That’s right,” Harry said, which was both true and because he wanted an evening free of Riddle’s annoying presence, and glanced over his shoulder to see how Riddle was taking that.\nSomewhat to his disappointment, Riddle simply chewed and swallowed the plants in front of him without taking his eyes off Harry. Harry’s ability to read his emotions on a donkey face had faded. If he was feeling surprised or put out, Harry could no longer tell.\nJust that Riddle was staring at him with the same kind of fixation as always.\nHarry turned away with a shudder, and Remus added, “Harry said he would explain how he managed to wandlessly and wordlessly turn Tom into a donkey in the first place.”\n“Yes, I am curious about that,” Sirius said, and they went towards the house while Riddle’s stare burned silently into the middle of Harry’s back.\n*\n“I figured out Heller’s Theorem.”\nThey had finished dinner, but Sirius was still drinking tea, and he sprayed it all over the table at Harry’s pronouncement.\nThe reaction actually reassured Harry a little. At least that meant Sirius was familiar enough with Arithmancy to know what Heller’s Theorem was, and Harry wouldn’t have to start from the very beginning in explaining it.\n“You what?” Sirius was wiping tea off his face and staring at him.\nHarry had to grin a little. This hadn’t been the exact audience he’d envisioned sharing his Arithmancy with; he’d hoped that would be his family, and that their reactions would be just as shocked and impressed. But he nodded, and added, for Remus’s sake, “That means that I figured out how to cast magic by focusing on the symbolic significance of numbers in my head.”\n“Heller’s Theorem dealt with equations, I thought.” Remus was frowning. “Or at least that’s what I remember. Arithmancy was a long time ago.”\nHarry shook his head. “He theorized both equations and single numbers, but not many people paid attention to the numbers part. They all concentrated on equations, because, after all, that’s what you use to predict the future and such in Arithmancy. But that’s not the only function numbers can have. And apparently people also believed that it wouldn’t be much use even if you did crack the theorem, because they thought numbers could only have one symbolic function each, limiting the kind of spells you could cast. But that’s not true. You can assign them different symbolic functions if you just keep your mind open enough.”\n“Can you show us a demonstration?”\n“As much as I can with my magic weakened.”\n“Of course.” Remus held up his hand. “I don’t want you to think that we don’t believe you, Harry. I always knew that you could do anything you set your mind to. This is just—incredible, and I want to see it in action.”\nHarry raised an eyebrow at him. “Do you have a quill and parchment?” he asked, and Sirius, who was apparently still stupefied by his revelation, waved his wand and Summoned them. “And that’s a new tune. I thought you joined in the general chorus about how I wasn’t as smart as my sisters because I didn’t excel in a single subject like them.”\n“Is that what you think Lily and James think?” Sirius interrupted, as the quill and parchment settled on the table next to Harry.\n“You know it is.” Harry glanced as him as he took up the quill. “They’re always saying that I’m not a genius like Diana and Violet are and that I need to stop being jealous of them and attributing my actions to wanting to cause pain to them. Well, Diana mostly.” He had the feeling that Violet baffled their parents as much as she did most other people.\n“I’m sorry,” Sirius said, sounding wounded. “I never—I never knew they said that to that extent. I thought it was jokes.”\n“I knew it wasn’t,” Remus murmured, his eyes locked on Harry. “But I never realized that you were bothered by it.”\n“What good would it do to bring it up when you wanted to heave peace in the Potter family?” Harry asked, and let his bitterness color his voice. After the blow-up this afternoon, probably nothing would ever bring him back into the bosom of his family again. He might as well air his frustrations to Sirius and Remus. “You kept telling me they were stressed and I had to understand.”\n“I’m sorry.”\nSirius and Remus said that at the same time. Harry shook his head, already regretting having said it. What could they do? Nothing. The only thing telling them would get him was pity. “Never mind.”\nHe stared down at the parchment, thinking of the simplest demonstration he could make. It couldn’t be an equation. He was too tired for that. But…\nYes. The spell he had cast when he first discovered that he had cracked Heller’s Theorem and could use his Arithmancy to do (almost) anything he wanted.\nHe drew a 2 on the parchment, which was easier than holding the symbol all by itself in his mind, and sat back as he watched the air above it turn soft and bright green. He smiled as he watched two stems sprout from the curve and the bottom of the number and grow upwards, entwining as they sped into full growth.\nPurple flowers sprang from them, and bloomed, and died. The stems crumbled back into dirt.\n“Holy fuck.”\nHarry glanced over at Sirius with a grin. He knew more about Arithmancy than Remus, and from his wide eyes, he knew exactly why he should be impressed. Harry basked a little in the look of respect aimed at him. It was only a shadow of what he had hoped for and would never have, but it was something.\n“No one I ever met could do that,” Sirius breathed. “Not even my brother, and I thought he was an Arithmancy genius to rival Violet.” He blinked and then grinned back. “Hey, Harry. Your sister can’t do that.”\n“She probably wouldn’t want to, she’s so focused on equations,” Harry said, but he did admit to taking a bit of comfort in the statement. So he wouldn’t be the only Potter genius even if he ever achieved the title. At least he would be one of them.\n“Can you explain what happened?” Remus was craning his neck as if he could see what remained of the flowers after they had crumbled to ash.\n“Sure. I thought of the number two as representing coexistence, codependency. It can represent other things to me, but that’s the one that I first got to work. So I imagined two plants growing, and then flourishing and dying together. Side-by-side, entwined, two of them. That draws on the symbolic significance of the number two as it is in that moment for me and forces it into reality.”\nRemus’s eyes were very wide. “And when you changed Riddle into a donkey this afternoon?”\n“Eleven, and four.” Harry shrugged when Remus frowned at him. “I could have used two, sure, but eleven is something I’ve focused on as meaning a human most of the time, since it doesn’t carry a lot of other symbolic values and the two lines that you use to draw it look like two legs. But the four was for the four legs that he was going to have as a donkey, yeah.”\n“And why a donkey?”\n“Because I wanted an animal that would humiliate him the way he humiliated me. And Diana,” Harry added, as an afterthought. It wasn’t exactly true that he’d been thinking of her at the time, but it would make him sound better to Remus and Sirius.\nThere was a reason that the Hat had hesitated between Gryffindor and Slytherin for him.\n“I wonder,” Remus said, “is this…” He let the words trail off, but he had already come to the conclusion, as Harry knew before he continued speaking. “This is the reason that Riddle wanted to marry you.”\n“Yeah. He found out and got all hot and bothered.”\nHarry kept his tone light, inviting them to laugh, but Sirius frowned at him and shook his head a little. “Harry, don’t put yourself down like that. I think he really did want to marry you.”\n“Yes, but I don’t want him!” All the rage that had been missing for the past few hours flashed through Harry like white fire, and he almost screamed the last words. He closed his eyes and drew in a deep breath. “I don’t like him. I don’t trust him. He was trying to kiss me last night and feel me up this morning. He’s an impulsive idiot who follows the least hint of power. If he was capable of cultivating Diana for the last five years, humiliating her like that in public, and making an ancient vow, why do you think he’ll stay interested in me?”\n“With the ancient vow, he won’t have a choice,” Remus said. “Sirius told me. We all heard him speak. He’s sworn to your happiness now.”\n“Yeah?” Harry said blankly. “So?”\n“The vow will make sure that he keeps it. His magic will make sure that he keeps it.” Remus shook his head. “And he’s pretty damn powerful. His magic is going to maneuver him into the position of making you happy.”\nHarry sighed. “But that’s the point. It’ll only be what he thinks makes me happy, and he has some pretty bloody strange ideas.”\n“No,” Sirius said, and he looked as though hope was dawning somewhere inside him, although he still couldn’t think this was a good idea, not when Riddle had been going to marry Diana just this morning. “Remus is right. It has to be what will really make you happy, you yourself, personally, or the ancient vow would punish him. That’s why they were used so often to bind couples who were unwilling. In time, they’d become willing. The vows made them act for each other’s good.”\nHarry stared at Sirius. “But that can’t be true.”\n“Why not? I grew up in a family that had used them in the past. Trust me, I know what I’m talking about.”\n“No, just—if that’s the case, and Riddle knows it, then him swearing them to me makes even less sense! He’s an evil bastard who wants to get ahead in politics! Why would my happiness be worth anything to him?”\n“I think that he made an impulsive decision, and then made sure that he couldn’t back out of it.” Remus tilted his head. “And that he was clever enough to leave the binding open so that he could have the chance to prove to you that your happiness matters to him.”\n“Prove it, and then what? So what? What does he think is going to happen after that?”\nRemus spread his hands. “That you’ll go along with him because you know you can trust him? That you’ll teach him your Arithmantic magic? Even the speculations I’ve offered so far are only my guesses, Harry. The only person who can answer you for sure is a donkey in the stables right now.”\nHarry rolled his eyes. “Then I suppose I’ll transform him back and ask him.”\n“But not until tomorrow, right?” Sirius asked hopefully.\nHarry had to grin. “No. Not until then.”\n*\nThe next morning, Harry stepped into the stables and found Riddle awake and waiting for him. He wondered if donkeys slept the way humans did, and then dismissed the thought. For all he knew, Riddle had been awake all night thinking evil thoughts instead of sleeping. Who knew why he did anything?\n\nBut now, I have to ask him.\n\nHarry stared at Riddle and focused on the figures of eleven and four in his mind, making sure they “felt” like the same figures that he had used to turn Riddle into a donkey in the first place. Then he carefully parted and disentangled them, pulling them apart until Riddle’s body began to shimmer.\nHarry had to admit he was relieved when Riddle turned back into himself, with all his limbs intact. Not that he really wanted to see the bastard, but he didn’t want to maim someone for life in a fit of temper, either.\n\nWhen I maim him, he’s going to know I mean it.\n\nRiddle spent a long moment patting down his arms and his chest, which kept his head conveniently bowed so that he wasn’t meeting Harry’s eyes. Then he looked up, and Harry hissed out sharply.\nThe longing, the desire, was still the same.\n“Didn’t me turning you into a donkey affect you at all?” Harry snapped.\n“Yes,” Riddle said without shame. “It confirms for me that I made the right decision.”\nHarry folded his arms. “Explain it to me, now.”\nRiddle gave him one of those smiles that probably used to devastate the ranks of teenage girls at Hogwarts and moved out of the stall. “Because my first love, before politics and immortality, was magic.”\n“It got you trapped in a diary for fifty years when you mishandled it. I’d think you wouldn’t risk misusing any more powerful magic.”\nRiddle laughed. “I trust your compassion and good heart, Harry. You would transform me in a fit of rage, but you wouldn’t hate or hurt me. Not really.”\n“Look,” Harry said. “I tried to teach some of the Arithmantic magic to Sirius and Remus last night. Neither of them could grasp it. And they really tried. It might be that it just takes longer to work your mind into that symbolic way of thinking, but it’s also possible that someone else just can’t learn it the way I can. That means that you might not gain access to it by marrying me.”\n“I rather hope that is true.”\nHarry pulled himself up on the edge of saying something else. “What the fuck, Riddle?” he finally managed to get out. “Isn’t the whole reason you married me so that you could keep my magic close and wield it for yourself?”\n“No.” Riddle was smiling at him like he was a promising pupil who had done his homework correctly. “I married you because I have met no one else who has expanded the boundaries of magic and realized the pure power of it the way you have done. I told you, magic is what I care for most. I was doing a ritual that very few people in history have performed when I became trapped in the diary. I had no one else who shared my interest in pure magic when I was alive fifty years ago. I have met no one who could redefine the laws of magic the way you did.”\n“So…”\n“So my first and most important task is to keep you close, and to keep you happy. I do not know what you will do next, Harry Potter. I believe it will be remarkable. I want to share that journey with you.”\nHarry managed to close his mouth, and whisper, “And humiliating Diana the way you did? Estranging me from my family?”\n“Diana is a scared little girl who clung to me as the prince of her fairy tale.” Riddle sounded utterly indifferent. “She would have made a useful prop, but I would have dropped her sooner or later. I would never have suggested using the ancient vows if not for the chance of gaining you.”\n“My family?” Harry was fighting back the urge to shout at Riddle. “And has it occurred to you that I might not ever redefine the laws of magic again?”\n“I think you will.” Riddle tipped his head, and his eyes flashed crimson. “And your family will learn to appreciate you the way they should by the time I’m done.”\nHarry drew breath to shout for real this time, but an owl came flying into the stable, and landed on the side of the stall Riddle had occupied, hooting urgently at Harry. Harry resisted the urge to cover his eyes. It was Glacier, his mother’s snowy owl, and the message attached wasn’t a Howler, but he still didn’t want to open it.\nHe tore it open anyway, ignoring the hungry way Riddle stared at him. It was a summons home, as he had expected.\nHarry closed his eyes for a moment. He felt Riddle taking the letter from him, probably reading it, but he didn’t care. Riddle wouldn’t get that much from it.\n\nTime to face the music.\n\nHe walked out of the stable, not surprised but disappointed when Riddle followed him. “Fuck off,” he said, voice numb.\n“Did I not promise to be your sword and shield?” Riddle smiled. “Of course I am coming with you.”\n“I don’t want you to.”\n“I’m afraid that that matters little next to the strength of my vow. I am here to protect you, darling.”\n\nGod, do I hate Tom Riddle. \n\n“Hello, traitor.”\nHonestly, that sally from Diana was so pathetic that Harry just ignored it, and kept walking towards the long blue couch across the room from her. It seemed that they wouldn’t gather in the dining room this time. Mum and Dad were sitting on the silvery couch that was usually kept for guests, with Diana between them. Violet lounged on a chair that was half a circle away from them, looking bored.\nMum and Dad did both turn their heads when Riddle pranced through the door after Harry. Their stuffy expressions almost made the wanker’s presence worth it.\n“This is a meeting for family only,” Mum said.\n“Well, technically he’s family,” Harry said. “Technically your son-in-law.” Their stuffy expressions became more stuffed-up, and he flopped onto the blue couch, resisting the urge to cackle.\nRiddle sat down a cushion away from him, studying Harry’s parents as if he had never met them before. Harry gave in to the urge to sigh. Just once, he would like it if someone listened to him and did what he wanted. He didn’t want Riddle to cause trouble. He was already in enough.\nOn the other hand, if there was that much trouble, what exactly could Riddle add?\nHarry was still contemplating that when Diana spoke up, her voice soft. “Tom, when are you going to disassociate yourself from Harry and come back to me?”\n“The ancient vows are for life. You knew that when I told you I wanted one.”\nHarry gave Riddle a disgusted look. It was so obvious now how easily Riddle had manipulated Diana when he’d told her that he wanted an ancient vow, all the time intending to catch Harry in the trap instead. Harry got back an oblique dark-eyed look in return, and turned sharply away from him.\n“There must be some way we can reverse this.” Dad sounded weary. “Some way that we can bring peace to the family again.”\n“But I told you how, Dad.” Violet had that particular catch she got in her voice when someone didn’t listen to her. “Just accept Harry and Tom as part of the family. And accept that Harry is more powerful than you thought he was.”\n“Powerful enough to bind Tom Riddle to him?” Mum sounded as if she didn’t know whether to accept that or not. On the one hand, Harry thought, exhausted beyond measure, she probably thought that would exempt Riddle from any blame, and they could still get him to take care of Diana somehow. On the other hand, that would mean admitting that they’d misjudged Harry’s power and intelligence.\n“How can I have a future without Tom at my side?” Diana whispered.\n“He can still be in the same room as you at family gatherings. It’s simple.”\n“I don’t think your contributions to the conversation are doing much at this point, Violet.” Mum’s voice was exhausted, the way that Harry felt, and her eyes continually flickered back and forth between him and Tom as if she would notice some way to separate them if she just stared long enough. “Diana is right that she can’t have a future without Tom.”\n“Why would you assume that I’d be interested in babysitting your spoiled daughter?” Riddle’s voice was light. “Although I suppose it isn’t her fault that you’re such terrible parents. You’ve managed to raise a spoiled, lazy daughter and emotionally scar your son.”\n“Leave me out of this,” Harry said fervently.\n“But how can I, Harry? They deserve to hear it. They deserve to hear that when you discovered incredible magic, your first thought was to hide it from them, and doubt your capacities because they’ve told you and over how stupid you are.”\n“What?” Lily puffed up like a quail. “We have never said that to him.”\n“Well.” Riddle considered her. “I did think you smart enough to understand that you have implied it, but maybe I was wrong.”\n“Stop it, Riddle,” Harry hissed out of the corner of his mouth.\n“But why should I? Your mother is being fascinatingly obtuse. It’s about time that she was confronted with the results of her neglect, darling.”\n“You call him darling?”\nRiddle cast Diana a glance. “Yes. I needed a word that hadn’t been tainted by association with you, love. I’m sure that you understand. You are, after all, a genius.”\nViolet laughed, which was the opposite of helping. Harry elbowed Riddle hard in the ribs and turned to his family. “Remus and Sirius both said that the ancient vows can’t be undone. I don’t want this git, but I’m stuck with him. I don’t have to live with him, though, and I’m sure he wouldn’t mind sticking around to suppress Diana’s magic.”\n“You’re sure?” Riddle murmured, voice low and dangerous. “When you haven’t even asked me?”\n“Oh, but it would make me happy.”\nHarry made sure that his voice went up in a cheerful little chirp at the end, while Riddle stared at him with narrowed eyes. Then Riddle said, “You need not think that you are the only one who gets a say in this marriage.”\nAnd Harry lost it.\nHe could feel himself losing it, as though someone had broken a strap in him that had been holding back some of the flood. He spun to face Riddle, and heard Mum gasp. He didn’t know if that was because of the look on his face or if his magic was getting out of control.\nHe didn’t care.\n“You didn’t ask if I wanted this marriage, you arsehole!” he yelled. “You didn’t ask if I wanted to be humiliated in front of all those people! You didn’t ask if I wanted someone bound to me from the rest of my life, someone I always have to think about even when I don’t want him kissing and touching me—”\n“Riddle kissed you before the wedding?”\n“Oh, shut up, you wanker!” Harry snapped at his father without taking his eyes from a stunned Riddle, and James Potter did, maybe just in sheer surprise. “You’re someone who doesn’t give a shit about anyone else, Riddle, and somehow you think that makes you charming? Someone anyone would want? Someone I want to spend time around when he offers me nothing but continual disrespect and belittlement?”\nRiddle had gone pale, but he hadn’t moved or taken his eyes off Harry. “And yet, you are willing to put up with treatment like that from your family.”\n“That was my choice,” Harry said, even as his parents made faint protesting noises. “You weren’t! None of this is my fault, all of it’s yours! None of this is something I wanted.”\nHe closed his eyes on the end of the last sentence, his anger draining away. What did it matter? Riddle wasn’t going to listen to him, and his parents weren’t, either. He was still going to be the disobedient son who had betrayed his sister, and she was still going to be the broken little girl who couldn’t keep her magic under control.\nMaybe more broken than ever, after this. Harry couldn’t imagine that being betrayed in front of the officiant would do anything good for her state of mind.\n“We do not disrespect and belittle Harry.”\nRiddle shifted next to him, and Harry opened his eyes. If he was about to get up and storm out of the room, then that could be a hopeful sign. Maybe it meant that he was reconsidering the marriage and would get as far away from Harry as the vow would allow him.\nBut Riddle was looking at his parents with a contemplative, deadly expression. Because, of course, dealing with the other Potters was probably easier for him than coming up with an answer to the question Harry had handed him, Harry thought.\n“Yes, you do,” Riddle said. “Almost the first thing Diana told me was that her brother wasn’t as smart as she was. It’s so intelligent to go down into the Chamber of Secrets, chasing an older student with more knowledge of Dark Arts than you have, and with no backup.”\n“I was trying to save Georgina!” Diana snaped.\nGeorgina, Harry remembered dimly. Georgina Fawcett, yes. That had been the name of the sixth-year Slytherin who had died when she opened the Chamber and tried to reverse the ritual that had trapped Riddle in the diary.\n“How did you know you could? What made you think that there was anything worth doing down there, or that you could face Fawcett?” Riddle shook his head. “What took you down into the darkness was your obsessive need to play heroine, Diana. Nothing more.\n“Then again, that’s hardly surprising considering that your parents have filled your head with nonsense from the time you were a baby. Thinking of themselves as geniuses. Teaching you that you were. Insisting that being a genius was the only worthwhile thing to be.”\n“And why would you argue against that?” Mum’s eyes were wide, as if she was trying to spy some way through this mess and out the other side. “You’re a genius yourself. You don’t want someone to talk down to you, to—”\n“No,” Riddle said, a dark smile playing along the sides of his mouth while his eyes shone crimson. “But neither do I feel the need to assert my uniqueness, as though intelligence made me better than someone else.”\nHe probably just thinks all his insults to those people within the privacy of his head, Harry decided.\n“Why talk her brother down to me? It wasn’t as though I knew Harry at that point, or that he was in fact an unregarded genius.” Riddle flashed Harry a warm glance that made him wish for the crimson-tinted one Riddle was giving his family instead. “It led to an unfavorable first impression. But I was also an unknown, someone who had been trapped in a diary for fifty years and didn’t have any allies, so I let her prattle on.”\n“Why describe it as prattling when you wanted to marry me less than a day ago?” Diana demanded in a choked voice.\n“Because I never wanted to marry you,” Riddle said. “I thought it would be a good political move, but as for love and all that rot…” He shook his head. “You appealed to me as someone famous and powerful whom I could manipulate. Perhaps I might have tried molding your intelligence once you outgrew the teenage moodiness. But I never saw anyone I wanted to marry until I found out the truth about Harry.”\n“You keep referring to the truth and that he’s an unregarded genius,” Violet said. “But Harry’s not good at one subject like the rest of us. What are you talking about?”\nRiddle turned to Harry. “Well, darling? Do you want to tell them? It will probably be your only chance to get the respect from them that you’ve been chasing.”\nYes, Harry had wanted to tell them, but not like this. He stared at Riddle, but Riddle only sat there.\n“It’s not real,” Diana said, with a little toss of her head that might have been meant to distract attention from her tear-bright eyes. “Harry drew him in and trapped him the way he made us think he’s a good person.”\nHarry reached a breaking point again, and stood up. “Did you wonder why her magic suddenly calmed down again yesterday?” he asked his parents.\n“I thought Tom had done something,” his mother said, hesitantly.\n“I knew he hadn’t,” Violet said. “I thought she just decided to exert her will because she wasn’t getting what she wanted by behaving like a petulant child.”\n“Violet.”\n“You say my name whenever you don’t want me to be honest, Dad.” Violet shrugged. “I’m only trying to live up to the higher principles that you insisted I had to learn.”\n“I did something,” Harry said. “I imagined the figure of a zero closing in around Diana and herding her magic back inside her body. That was what kept her from shaking the dining room apart. You might think me, Mum, Dad.”\n“I might if what you had said made the least amount of sense.” Dad squinted at him. “What the hell are you talking about? You can’t do anything by imagining a number.”\n“When you’ve cracked Heller’s Theorem,” Harry said, “you can.”\n“But that’s a bit of childish nonsense that Heller came up with in his dying years.” Suddenly Violet was paying a lot more attention to the conversation than she had so far. “There’s nothing there to crack.”\nHarry turned to look at her, glad for the interest in her face compared with the absolute disbelief in their parents’. “That’s what you might think. But I discovered that numbers can have multiple symbolic significances, and if your mind is flexible enough to manipulate them, then you can cause physical effects in the world.”\n“But if numbers have different significances, then that means that you’ll get a different result each time.”\n“Exactly. That’s why you need to focus hard on what you want to happen, not just on letting something random result.”\nViolet looked distressed. “Equations don’t have different results each time.”\nHarry started to answer, but Dad broke in, with a sound of doubt running through his words that Harry hated. “Harry, this is ridiculous. If you are going to make the claim to be a genius, stop teasing your sister and show us some real magic.”\nHarry saw Riddle make an aborted motion out of the corner of his eye, but he turned his head and glared at him hard enough that Riddle froze. Riddle had got him into this; now the least he could do was hold off and let Harry answer the challenge in his own way.\nHarry cupped his hands in front of him and thought, Nine.\nThe figure of a nine blazed in his mind, and Harry fed magic into it, lighting it up until it shone. Then he let his fingers fall, and water welled out between them, dripping to the floor. Everyone stared as it coiled into a long stream like the tail of a nine and then back on itself, flowing and continually interchanging, but leaving a small blank pool in the middle.\n“There,” Harry said, and lifted his eyes to his parents’. “You can conjure water with Aguamenti, but you can’t get it to behave like that.”\nDiana had no expression on her face, one of the few times that Harry had ever seen that particular thing happen. Dad was blinking hard, and Mum had her hand over her eyes.\n\nAre they sorry that they mistreated me?\n\nThen his mother dropped her hand and said, “This must be some trick.”\nHarry felt the words like a blow in the center of his stomach, and stared at her numbly. Did she think he was out to steal Diana’s glory the way she thought Harry had stolen Diana’s husband?\n“Water doesn’t behave that way,” Mum stated with calm confidence. “That means that there must be an illusion here.” She drew her wand and pointed it at the figure 9 made of water on the floor before Harry could say anything. “Finite Incantatem!”\nThe charm hit the water, and it vanished after one last flow around the figure. Mum squinted at where it had been as if expecting the illusion to break.\n“It disappeared,” said Diana. “So it couldn’t be caused by Arithmancy, could it? Arithmantic equations don’t disappear when you aim your wand at them.”\n“Because they’re only ink on paper,” said Riddle. “But this is magic, which can be ended with Finite Incatatem the same way most other simple spells can be. You fool.”\nHarry was looking at his parents, though. Dad was shaking his head rapidly back and forth. Mum was the one who said, “Arithmancy can’t do that.”\n“It’s no Arithmancy I understand,” Violet whispered from her chair. She still sounded like her world was breaking apart, and Harry would have said something to comfort her, if Mum hadn’t interrupted.\n“Exactly. Harry, stop trying to trick your sisters and accept that just because you’re not as smart or talented—”\nZero, Harry thought desperately, caging his own power as it tried to rage out of him. Riddle’s hand touched his shoulder. Harry shrugged out from underneath it.\nThe Arithmancy magic wasn’t going to impress them. The strongest reaction it appeared to have caused was Violet’s distress. The equations that Harry had planned, that he’d studied and tailored so carefully so that when he completed them his personality would change to become more acceptable to his family, were going to be useless.\nThat left only one set of them. And Harry hadn’t wanted to pursue them, hadn’t wanted to accept that no matter what he did, he wouldn’t be good enough for his family.\nHe turned away and marched out of the room. He could hear Violet asking questions that were probably about Arithmancy, and Diana whining about something, and his parents giving weary answers.\nThe kind of patient weariness that they always had around his sisters. Around him, the patience was extinguished.\nWhy had he ever thought he would fit in?\nHarry began to run. No one tried to stop him, although his parents had probably hoped for some sort of decisive confrontation out of today. The door was right in front of him soon enough, and Harry bolted out onto the grass and straight towards the Apparition point.\n“Harry!”\nThat was Riddle. Harry ignored him; he was just one more complication that Harry couldn’t deal with right now. He spun on his heel and let the magic of Apparition pull him, flying, through space.\n*\nHe ended up in his ritual circle, set up in a dim, shaded place deep in the Forest of Dean. This was the one place he could come to whenever he felt jangled and out of sorts, the way he felt now.\nAlthough it had never been this bad before.\nHarry sat down in the middle of the circle, his legs propped up so that his chin rested easily on them and his arms wrapped around his legs. He probably looked like a child, and he certainly felt like one, but he felt he’d earned a bit of childishness.\nHe’d wanted to make things better. He’d made them worse.\nHe’d wanted to be a genius like the rest of his family. He’d only proven that they’d never consider him one.\nHe’d wanted his parents to regret abandoning him with Sirius and Remus, to be proud of him. That was never going to happen.\nHe’d wanted some sort of close bond with his sisters, or the indifference to turn his back on them. Instead, he’d stolen what Diana held most dear, and confused and puzzled Violet. If she ever asked him questions about his new Arithmancy, he thought it would just be in an effort to steady and stabilize the kind of Arithmancy she already understood.\nAnd in the middle of it all, he was stuck in a bloody unwanted marriage.\nHarry felt his anger narrow and pinpoint that bloody marriage vow like a dragon breathing a steady stream of fire. He rose to his feet, shaking, his hands clasped together and wrenching until he hurt his wrists.\nThere was no way to break an ancient vow, was there? He couldn’t do anything because it was Riddle’s magic and not his that was bound?\nFuck that. He had done the impossible once before.\nHe could do it again.\nHarry snatched up his wand and Transfigured a stick that was lying within the boundaries of the circle to have a sharp, pointed tip. The boundaries were only loosely-piled stones, which he rearranged in symbolic patterns when he wanted to activate it, and he could easily have reached outside it. But for the equations he had in mind, only a stick from within the circle would do.\n“Harry?”\n\nRiddle.\n\nHarry turned and floated the rocks into stacks of stones piled flat on top of each other, a single stone on each level. He surrounded himself with a silent, protective set of ones, joined to the one person in the circle, and when Riddle strode up to the edge of the circle and tried to reach through it, his hand was thrown back with a flash and a roar.\nRiddle cradled his visibly burned hand and stared at him. “Harry? Please. They’re not worth it, in any case. We don’t need them.”\n“No, I needed them, and you made sure I couldn’t have them,” Harry snapped. “Fuck off, Riddle.”\n“The roots of your alienation from them were set long before I entered the picture, and you know it.”\nHarry suspected that might be true, but he blinked furious tears away and ignored Riddle. Instead, he scratched the first equation in the dirt.\n11+2= 13.\nAs he drew the last figure, a steady hum rose from the ground in front of him. Harry grinned savagely. He hadn’t known that would happen, but he couldn’t say he minded, any more than he minded the light that had tossed Riddle away from the boundaries of the ritual circle. If he made his point with thunder and lightning, then Riddle might get the message.\n“Harry? What are you doing?”\nHarry directed a slashing look at Riddle that actually made him recoil of his own will. Harry then drew the second equation, the growling rumble growing louder as he completed it and drew a line to connect the two equations.\n4+9= 13.\nA human figure and a joined pair in the first equation. A symbol of foundations and stability, as four legs would hold up a table better than two and four legs made an animal sturdier than a human, and a flowing, connected figure, like the one he had placed the water in earlier, in the second equation.\nAnd both adding up to the number that Harry nurtured only one association for: destruction, bad luck, chaos.\n“Harry, tell me what’s going on.”\nHe took the time to glance at Riddle again and smiled fiercely to see an iridescent shell of magic bubbling around him. So. Riddle was feeling the effects of the equations already, although he probably didn’t know what they were.\nHarry crouched down and added the third equation at an angle to the other two.\n12+1= 13.\nTwelve was a number he’d landed on as a figure of good luck and balance. He’d been twelve when he’d managed to join the Gryffindor Quidditch team. Twelve when he’d made a firm friend in his own House, Neville Longbottom. Twelve when he’d heard that a Mind-Healer had helped Violet speak full and regular sentences.\nTwelve, plus the singular one who had come to unbalance him.\nThe growling of the equations was louder than thunder now, more like a waterfall. Harry looked at Riddle and found him pacing back and forth outside the boundary, staring at Harry as if his stare would make Harry melt on the spot and spontaneously cancel the ritual.\n“I can be so good to you,” Riddle breathed. “All you have to do is give me a chance, Harry.”\nHarry shook his head. “You’ve already shown that you don’t care what I think.” He raised his voice to be heard above the magic. “It’s time for me to show you that I don’t care about people who take my freedom from me.”\nGlaring at Riddle, not looking down at the lines he was drawing in the dirt because he knew the exact position of the numbers so well, he completed the triangle that linked the equations.\nThe roar that arose nearly unbalanced him in return. Harry did have to turn back to the figures, to the three equations and the triangle rising from beneath them, floating them into the air on a slab of dirt and making the numbers glow with rich, buttery light.\nHarry extended his hands, fighting to hold his balance. He could have used other equations that would add up to the number thirteen, but he had chosen exclusively ones that used one number that was much bigger than the other because he’d wanted this lack of balance. And the triangle beneath them added to it, a shape with an odd number of sides.\nBut also a powerful magical number. Number of a trinity, of morning and afternoon and evening, of two parents and a child—\nPain struck him and blew through him, as insubstantial as fire. Harry ground the pain out in himself in what felt like flickering sparks.\nHarry slammed his hands together and roared out a wordless noise of pain and anger and denial. The emotions burned around him, spectral blue flames that arose and turned red and raced down the equations to their destined end.\nHarry focused all of the magic on the ancient vow that bound Riddle’s magic to his.\n\nMay it take all the bad luck that thirteen can draw upon it, threefold!\n\nRiddle screamed. Harry glanced over just enough to see that he had staggered to his knees, his arms wrapped around his head.\nHarry smiled, and then the equations blew up.\nThe figures of 13 dissolved in sparks, and the sparks piled around Riddle and formed what looked like a miniature of the stone wall Harry had constructed around the edges of his circle. These stones, though, were made of more flames, and they bent inwards and eagerly began to consume the iridescent shell that had surrounded Riddle for several minutes.\nHarry felt the moment that the ancient vow tying them together parted. So much bad luck and destruction drawn on it broke the bonds.\nHarry laughed, at the same moment as the magic backlash destroyed the sparkling walls around Riddle and traveled towards him.\nHe’d planned for this, though. Harry lazily lifted a hand, and the triangle of dirt bearing the three equations that now were blank on the far side of their equals signs turned and spun to meet the backlash.\nThe magic chewed through the equals signs and then into the numbers nearest them. Harry watched, viciously satisfied, as the 2 disappeared, burned up, and left him uncoupled and free, a singular human being standing on his own two feet, on the other side of it.\nThe second wave hit the 9 in the second equation, and whirled around and around, drawn into its whirlpool and repeating curve, and then dissolved it. Harry rocked a little, but the 4 remained, and stabilized the foundation underneath him, a table with four legs, strong, unbroken.\nIt was a weak third wave that hit the third equation, but it was enough to eat the 1, and leave Harry, without the addition of Riddle, balanced and whole, afloat on his lucky number 12. He tilted his head back and laughed. He felt the bad luck that might have been his wisp away like smoke, consumed and overpowered.\nHe was free.\nHarry patted the triangle gently and erased the lines that connected the remaining numbers, leaving the dirt to crumble back into the ground. Then Harry opened one of the stacks of stones and strode over to Riddle.\nRiddle stared at him from the ground, dazed. He licked his lips and murmured, “Have you wished bad luck upon me for the rest of my life?”\nHarry snorted. He heard the softest of whizzing noises behind him as the drawn figures of the 11, the 4, and the 12 left the ground and rotated around his head, blazing. Harry stretched out his hands and gathered their magic into himself.\nHe felt—centered. Drained. Whole in a way that he hadn’t felt in years, not since he had begun to realize that he would never be a genius like his sisters.\nAt the moment, he was that, and more than that.\nHarry raised his eyebrows at Riddle. “No. I broke the ancient vow, and if you try to reintroduce any sort of magical claim over me again without my permission, then the backlash will probably render you a Squib. But it’s dormant bad luck, unless you provoke it.”\n“Without your permission, you said. You might welcome me without that?”\nRiddle’s voice was low and charged with passion. Harry shook his head. “You are certifiably insane, you know that?”\n“Drawn to your magic. Drawn to you.”\nHarry lifted a dubious eyebrow. “Uh-huh. Well, if that’s true, then you’ll have to meet me on equal ground, Riddle. No more sneaking about and kissing me against my will. I’m in control here, not you.”\nRiddle’s eyes were as wide as full moons. He looked down and nodded.\nHarry turned away with a snap and strode towards a place far enough away from the circle’s residual magic that he could safely Apparate, his heart singing inside him.\nHe was free. And he had the magic to guard and defend himself in case Riddle decided to pull some shit like this again.\nHe had the magic to guard and defend his heart against his family, even.\nBut Harry was no longer sure that he had to try to change his personality or grow his intelligence with equations. Look at what he had been able to accomplish by himself.\n\nI should be enough for anyone.\n\nHarry knocked firmly on the shiny door in the middle of what looked like a mile of walls, and waited. He hadn’t really dared come here before because, well, they’d been at the wedding, and they would have seen his humiliation and presumably hated Diana’s. But the quiet throb of power and confidence that had started in the middle of his chest after he had broken the ancient vow said that his first true friend wouldn’t hate him.\nHe waited a moment, then knocked again.\nA second later, the door swung open. Neville grinned at him and motioned him in. “Sorry, I had to be sure that I wasn’t hearing things,” he said. “When I get involved in the greenhouse, it can get hard to tell the difference between what I’m hoping is happening and what’s happening in front of me.”\n“I know.”\nNeville was another genius, although his field was Herbology, but Harry had never felt as awkward around him as he did around his family. Neville could be interested in other things, too, and he knew what it was like to deal with family mockery. His parents had been driven insane by a Death Eater attack when he was only a baby, and his grandmother had tried to bend Neville to her will and mold him in his father’s image. She hadn’t been impressed that Neville was succeeding in Herbology instead of something more oriented to battle magic.\nThat was, until Neville had collaborated with Professor Sprout to design a new kind of lily that could cover war-devastated areas and cleanse the magic in them, restoring the earth and the air to health. The accomplishment had earned Neville and Professor Sprout so many international accolades that Augusta Longbottom had had to take notice.\nAt the time, Harry had envied Neville even as he congratulated him, and carefully buried that envy deep. But now…\nHe didn’t have to envy anyone, did he? Not when he had cracked Heller’s Theorem, and had a whole new future waiting for him if he decided he wanted it.\nNeville led Harry around the immense grounds to the greenhouses, where he captured two coiling nests of Devil’s Snare and repotted them. Harry snorted a little as he watched. “You’re mad, sometimes.”\n“Look who’s talking.”\nNeville was watching him with a careful eye, Harry realized, waiting to see how he was going to react to the teasing. Harry shrugged a little. “That was Riddle’s idea, not mine. I had no idea he was going to do that. But it doesn’t matter anymore.”\n“Really?” Neville paused in the middle of sticking the seedling in a pot, and casually freed his wrist from the way the tendril tried to grab him. “Why is that?”\n“When you’re done, let’s have a cup of tea, and I’ll tell you all about it.”\nNeville nodded and went a little faster with the potting. Harry watched him for a few moments, then looked off into the distance, at the looming walls of Longbottom House. At least it no longer looked as gloomy as it had a few years ago, when Harry first visited. It had turned out that Neville’s magic-eating lilies had cleansed some of the atmosphere of Dark magic lingering from the attack on his parents, too.\n\nWhy did I never tell him about my Arithmancy before this? He would have accepted it.\n\nBut Harry had too ready an answer for that, and he sighed softly to himself. He had never done it because he had wanted his family to be the first to hear about it. He had wanted his family to accept him. He had wanted his family to make much of him.\nHe knew now that he would never have that.\nAnd although it saddened him, at least he knew that his place as an equal to Diana and Violet in his own mind didn’t depend on their acceptance.\n“Done.” Neville walked up to him, dusting potting soil from his hands, and then glanced up and seemed to look properly into Harry’s face. He froze.\n“What?” Harry frowned at him. “Neville, are you okay?”\n“Yeah, I just—I can see the magic around you.” Neville’s voice was low, his eyes focused on something that seemed to be above Harry’s head, or maybe his shoulders. “You did something big. What was it? A ritual?”\n“Of sorts.” Harry smiled at him. “Come on, I’ll tell you all about it when we’ve had a chance to sit down.”\n*\n“You cracked Heller’s Theorem.”\nHarry had only told Neville about shattering the ancient vow with equations, and Neville got it immediately. Harry smiled.\n\nI wish I had known that I could have had his companionship on this road all along.\n\nBut he put aside the self-pitying moment that tried to come from that, and just said, “Yeah, I did. The fact that numbers can have different significations is something that I suspect other people thought of, but they just didn’t put enough work into it.”\n“Bollocks.”\nHarry blinked. “Huh?”\n“I don’t think anyone has ever thought of this before. Arithmancers generally don’t, you know. Numbers and equations have to be the same from formula to formula, or you would never be able to predict the future. You have to have something stable to stand on when you’re dealing with something as fluid and unstable as the future.”\nHarry nodded slowly. “You might be right.”\n“Of course I am. Add to that that you’d have to keep assigning significations to larger and larger numbers because the smaller ones would only have one each, and…well, most of us have no association with a number like thirty thousand. It’s just too large, and we don’t use it often enough.” Neville paused and eyed Harry. “But I bet you do.”\nHarry felt his ears flush. “I don’t work with larger numbers most of the time either, Neville.”\n“That’s not a no.”\n“Yes, yes, all right.” Harry reached out and arranged a few of the bigger crumbs from the scones they’d eaten into the figure of 30,000. The magic stirred softly in his fingers at once. Funny how breaking the ancient vow hadn’t exhausted him like turning Riddle into a donkey had yesterday.\nOr not funny. It was always easier to work with the written numbers than work them entirely in his head, and they had also defended Harry from the magical backlash that had devastated Riddle.\n“What’s your association with the number?” Neville asked. He was staring in fascination, craning his neck.\n“I thought once that it might be the amount of breaths I would need to take to really sink into mediation,” Harry said. He had never been good at meditation, which was one reason why mastering Occlumency would probably be forever beyond his grasp. “And after that, the association stuck with me. So…”\nHe spread out his fingers over the crumbs and focused on the number they made, more in outline than fact; he hadn’t enough crumbs to draw lines, only suggest the loops of the 3 and the curves of the 0’s. But it was enough. The figure lit, and a contained bubble of shimmering air rose above the table.\n“Enough air to give someone thirty thousand breaths,” Harry said.\n“Wow.”\nNeville looked genuinely awed. Harry felt himself flush harder, but, well, this kind of attention was something he had wanted. Something he would probably need to get used to, if he did publish the kind of work on Arithmancy that would be necessary to make Heller’s Theorem known to other people.\nHarry flicked his wand at the crumbs and blew them off the table, which made the bubble dissipate. “And that’s how I broke the ancient vow.”\n“Gran said that you probably wanted to marry Riddle, but of course you didn’t,” Neville said, his eyes intent on Harry. “I would have known if you had a crush on him. Wouldn’t I?”\n“Yes,” Harry said quietly. “I never shared this with you because I wanted to impress my family, Nev, that’s all. But I really did dislike Riddle and feel that he shouldn’t marry Diana, that he would just try to use her.”\n“Did you impress them?”\nAn echo of the anger that had driven Harry to the ritual circle came back to him, and he shook his head grimly. “No, they just said that it must have been a trick when I used Arithmancy in front of them and then my mother made it disappear with a Finite. They said it was an illusion.”\n“Wow,” Neville said, staring at him. “I mean, I always thought it was strange that they insisted up and down that you weren’t a genius and that being a genius was the most important thing, but I had no idea it was like that.”\nHarry sighed and leaned back against the couch, finally admitting it aloud. “Neither did I. I thought…if I could impress them, they would admire me and make me feel like part of the family.” He reached for a biscuit still sitting on the tray and shrugged. “But maybe they’re protecting themselves against the realization of what they did wrong and would have to feel if they admitted they were wrong. Maybe. I don’t care enough to make sure.”\n“And Riddle? Why did he marry you?”\n“Because he’s a possessive, power-hungry madman.” Harry rolled his eyes when Neville blinked. “No, I do mean that. He found out about my Arithmancy the day before the wedding, and it was like that drove him over the edge. He kissed me in the garden that night, and he suggested to Diana that they make an ancient vow just to—I don’t know, catch me in the trap. He claimed he wanted to protect me and ensure my happiness, but I don’t believe him.”\n“He probably thought it would be for life. He couldn’t have had any idea that you would break the vow.”\nHarry frowned. “Don’t tell me you’re defending him, mate.”\n“No, of course not. I’m just saying that I don’t think he could have anticipated you having the power to break an ancient vow. No one ever has before. So he must have tied himself to you sincerely thinking that that would be it for the rest of his life.” Neville drank the last of his tea and put the cup down with a ringing sound. “So think about it. What would tempt him enough to do that?”\n“Power,” Harry murmured. “And magic. He said himself that he cared more about magic than power, and that he found me breaking the laws of magic fascinating.”\n“And he was planning to marry Diana for power, of course.” Neville made a face. “Ugh. I don’t think you should accept him back, mate—”\n“I definitely wasn’t planning on it.”\n“But you should still try to understand why he did it. Why abandon five years of planning, at least, and a woman who was sincerely in love with him, for a one-sided bond with a man who wasn’t and whom he’d just learned the value of the day before?”\n“I might ask him, if I think I’d get a sincere answer.”\n“You don’t think he’d give you one?”\n“No. He’d just keep on playing games and saying whatever he thought was most advantageous for him at the moment, not the truth.”\n“Can you make him think the truth is the most advantageous?”\nHarry leaned back in his chair. “Come on, Nev, tell me what you’re thinking. That I should forgive him? Give in and do whatever he wants?”\nNeville snorted. “Of course not. But it is interesting that he gave up the position of power he could so easily have had. I know she’s your sister, Harry, but he could have talked circles around Diana. He did talk circles around her. So why give that up for someone who was going to be suspicious of his every move?”\nHarry shrugged. “If he ever dares come back, then maybe I’ll ask him.”\n*\n“No surprises from you today, Potter?”\nMadam Madstrom was watching him with a suspicious eye as Harry came down the stairs that led up to his flat above the Magical Menagerie. Harry shook his head. “No, madam.”\n“Good. I don’t want you getting married to someone else with a bloody ancient vow in the middle of the shop, scaring my customers.”\nHarry bit his tongue to avoid saying what he wanted to say about that, and just nodded, turning to begin his morning chore of cleaning out the snake tanks. He wasn’t a Parselmouth like Riddle and Diana, but he could move slowly enough to do it without danger, and he didn’t fear the snakes, which was an advantage over the last two assistants Madam Madstrom had tried to hire before him, apparently.\nMadam Madstrom sat behind the counter, meanwhile, glaring at the door. She had bulging blue eyes and grey hair that she never bothered to comb, but she understood animals, and she could put a sweet face on for children. It was the main reason they sold so many Kneazle kittens and Crup puppies.\nHarry hummed under his breath as he transferred a king cobra to a temporary holding cage and began sweeping his wand back and forth inside the tank, cleaning and straightening. If he wanted to use Arithmancy to make himself a Parselmouth, could he do that? He didn’t understand the snake language from the inside, but then again, he had never transformed himself into a donkey, either, and he’d managed that on Riddle well enough.\nIf he wanted to do it, how would he do it?\nHe would probably have to start with an eight, since the graceful loops could be seen as a snake coiling back on itself. Or maybe seven? That might be better. He had had a book when he was younger that pictured the number seven as a serpent.\nSuch happy imaginings kept him going through cleaning most of the snake tanks, tossing those due to be fed their mice and rats, cleaning up beneath the few owl perches the Magical Menagerie had, and ducking the absent-minded efforts of a white pigeon named Lulu to make a nest in his hair. He mostly ignored the customers coming in and out. Madam Madstrom never had Harry deal with them unless she was spectacularly busy with a queue.\nBut he looked up when Madam Madstrom said sharply, “Here, you, I saw what you did.”\nRiddle was standing in the doorway of the shop, because of course he was. Harry swung towards him, feeling a slow, bubbling anger rising in the middle of his stomach. Riddle might have taken away his family and some of his independence for a few days, but he wouldn’t let the maniac take his job.\n“Yes, Tom Riddle, at your service,” said Riddle, and gave Madam Madstrom a credible bow, although his eyes were on Harry.\n“Is this your—husband, Harry?” Madam Madstrom asked it stiffly.\n“No,” Harry said. “I actually found a way to make sure that he wasn’t.”\nMadam Madstrom nodded. “Then you have no reason to be here during working hours,” she told Riddle sharply, and rose up from behind the counter, her hand going to the gnarled old walking stick that she only used on particularly cold days, or when an unwelcome customer entered the shop. “Leave, now.”\n“I was only hoping to beg a few minutes of Harry’s time.” Riddle smiled at her, although it didn’t soften Madam Madstrom’s cold gaze. “And take him for lunch.”\n“It’s lunchtime?” Harry blinked and glanced at the ornate cuckoo clock Madam Madstrom kept on the wall above the door. He was surprised to note that it was after noon. The time usually passed more slowly on days when he didn’t have puppies to play with, but he supposed his Arithmancy speculations had kept him occupied.\n“You mean that you wouldn’t have got lunch, Harry?”\nRiddle’s voice was sinking into cold territory that Harry already knew was dangerous. He wasn’t going to let it intimidate him, though, or the possible threat to his boss force him into spending time with Riddle. He stared straight back and said, “I can go any time after eleven. I got caught up in working, that’s all.”\n“You should go, Harry.” Madam Madstrom was swinging her gaze back and forth from him to Riddle in the way that said she knew she hadn’t got the whole story, but wanted it. “Wherever you want.”\n“I just fancy a cold sandwich in my flat this time.”\n“Then go get it. Be back at work after one.”\nHarry nodded and swung out of the shop, ignoring the way that Riddle immediately followed him. They didn’t speak as they walked down the middle of Diagon Alley, although the few shoppers around at the moment paused and stared at them, presumably recognizing their faces from the paper.\nSo what if they do? Harry stuck his hands in his robe pockets and stared coldly back at some of the most intrepid gawkers, who turned their faces away when dosed with their own potion. Sooner or later I’m going to be famous for my Arithmancy. I’ll learn to tolerate the staring.\nThat thought cheered him up enough to ignore Riddle entirely as he ordered a cheese sandwich from a shop that would make any combination. Riddle asked for something Harry didn’t bother listening to. He stood off to the side as the sandwiches were made, and Riddle’s eyes burned into him.\nSo what? Harry had the feeling that he’d probably have to have a conversation with Riddle in his flat, but that didn’t matter. The really important thing was that Riddle couldn’t intimidate him anymore, and had no hold over him.\nAs they were walking back up the middle of the alley, Riddle said under his breath, “You were meant for better things than shop assistant.”\n“Oh? Like the better things that led to you getting trapped in a diary for fifty years, or saw Diana humiliated in front of an enormous crowd?”\nRiddle actually shut up, which Harry didn’t understand. But he had something else to occupy his attention by the time they got back to the Magical Menagerie. Draco Malfoy was standing outside it and looking around as if waiting for someone.\nRiddle? That would make sense. The Malfoys were the sort who made their niche as sycophantic followers, and Harry thought Riddle had had that kind of following in Slytherin. Harry had never bothered to pay that much attention.\nBut when they approached, Malfoy’s eyes focused on Harry, which made no sense. He inclined his head a little and asked, “Could I speak with you, Mr. Potter?”\n“No,” Harry said instantly. This was a trap, it had to be. Malfoy had never been that courteous to him even when they weren’t meeting as rivals on the Quidditch field.\nMalfoy blinked. “Oh.” Harry didn’t think it was his imagination that his gaze strayed in Riddle’s direction, looking for guidance.\n“Five minutes, Draco,” was all Riddle said. If that was an indication of how long he was going to stay, Harry was thrilled.\nBut instead, Riddle veered off in the direction of the apothecary across the way, and Malfoy turned to Harry with the air of someone working against a small time limit. “I want you to know that if you need anything, anything at all, you can come to me,” he said in a rush.\nHarry stared at him. “I can’t imagine what you would be able to give me.”\n“Oh.” Malfoy blinked at him again. “I—I wanted you to know that since you’re married to Tom now, his allies are your allies.”\n“We’re not married,” Harry said, and reveled in the utterly dumbfounded look that came over Malfoy’s face at the news.\n“But we all saw you—”\n“I broke through the ancient vow with Arithmancy magic of my own. Ask Tom to tell you all about it, I’m sure he’ll be thrilled.”\nMalfoy looked as though he was choking to death on air. “I—I have to go,” he said, and then turned and almost ran up the street. Harry snorted. No doubt he was disgusted that he had wasted even that much time on someone who no longer mattered in former-Slytherin politics. Or maybe he just wanted to be the first to tell everyone the news.\nHarry turned around, and jumped when he saw Riddle right behind him. “What do you want?”\n“I came to ask if there was anything I could do to make myself acceptable to you.” Riddle looked him straight in the eye and didn’t waver even when Harry scoffed, which Harry knew at one point would have made him scream with rage. “I know you don’t care for power, or money. But I would like to do what you want, Harry.”\n“Since when do you care about that?”\n“Since you made it clear that the ancient vow and someone antagonizing your family is not what you want.”\n“Wait, you thought I would want that? In the name of Merlin, why?”\n“Once I saw that you had achieved great things with your Arithmancy but were keeping it quiet, I decided that you probably wanted to impress your family. And that meant having someone at your side who would be at your side, whom you could absolutely trust—”\nHarry started laughing so hard that he almost dropped his sandwich. “I can’t trust you, Riddle. You acted against my interests. You ensured that everyone was humiliated at that wedding, including me. You don’t care about me, only about my magic.”\n“How could I not care about you when you are the one who contains that magic?”\n“But I’m more than that, and those were the interests you ignored when you made your stupid ancient vow.”\n“And now I am trying to understand them.” Riddle stepped insistently closer. “Tell me what you want, what you need. And I’ll fulfill it.”\nHarry eyed him. Riddle appeared sincere, but he had projected that apparent sincerity for years around Diana, too, and look where it had got her, and everyone else who had thought Riddle really wanted to marry her.\nAll right. He would call Riddle’s bluff.\n“I would need complete honesty and vulnerability from you,” Harry said. “You’ve seen me at my weakest now, in front of my family, and almost breaking down in fucking tears. You’d have to show me the same. Who you really are, what you really feel behind all those fronts you put up. And I know you can’t do it, Riddle. You’re too good at lying. You’d never tell me the truth.”\nRiddle froze in a way that reminded Harry of the king cobra in the Magical Menagerie when it saw a fat mouse. “And this would be all you would require from me?” he breathed.\n“It’s a pretty big all, and one that I know you can’t deliver on.”\n“Why would you believe I can’t deliver on it?”\n“Because of everything you said about wanting power and magic. You had no hesitation hurting Diana when she hadn’t done anything to hurt you—only bored you, if anything—and latching onto me even though I’d indicated I didn’t want you.” Harry folded his arms, nearly squashing his sandwich, while Riddle just continued not to blink and to look creepy as hell. “You lie like you breathe, Riddle. You can’t make yourself honest any more than you could have left me alone once you saw my Arithmancy.”\n“If I came to you and told the truth, would you accept me?”\n“As a husband? No. It would take more than that.”\n“How much more?”\nHarry rolled his eyes. “So now you want me to set a limit so you can try to surpass it? No. I told you, Riddle. You can’t fulfill the terms I set you anyway, so talking about any kind of future we could have together is impossible.”\nHe turned away and walked into the Magical Menagerie. He could still feel Riddle staring after him, but so what? He would probably have to get used to the feeling of burning eyes on his back for a while. That didn’t mean he was interested in yielding to them.\n“Your young man isn’t coming in with you?” Madam Madstrom asked.\n“He’s not mine,” Harry said, and resolutely climbed the stairs to go eat his lunch.\n*\nMadam Madstorm received a Floo call a few minutes before they closed, saying her sister was in hospital, and tasked Harry with making sure all the animals on display were back in their tanks or cages before she vanished in a swirl of green flames. Harry went through the tasks with the same quiet satisfaction he’d drifted in all day.\nThe difference right now was that he was fairly sure he knew how to give himself Parseltongue.\nIt would have to be an equation, of course, to make the effects permanent, and the higher the number, the better. He didn’t have associations with every single large number like he did with the thirty thousand he’d shown Neville, but that was all right. If could see a number as a repeating pattern of digits associated with serpents, building on each other, instead of a discrete entity, then he ought to be able to get what he wanted.\nHe didn’t think he would get it right the first time. Only the significances he wanted to assign individual numbers came instinctively to him now. Or, he supposed, equations like the ones he had used in the forest last night where he had sought a way out of an intolerable situation, and one had opened around him like sunrise.\nHarry placed the last Kneazle kitten in its large resting area with the others, turned off the lights, and went up the stairs. The flat that he owned here was small, but secure and comfortable. It had once belonged to Madam Madstrom, who wouldn’t have tolerated it otherwise.\nHarry made himself spaghetti for dinner, and then sat down and began to sketch out a repeating pattern of sevens and eights. The magic stirred slowly around him, but dimmed when he went past a certain point. Harry studied it. Yes, he had more than fourteen digits there, and he had never tried an equation with a number so large. He erased the last few numbers, and the soft humming stir of power came back.\nNow, of course, the question arose of what he should add to it. He could be simple and add a 1, but on the other hand, that would mean the last digit in the new number wouldn’t be an 8. Harry had no idea, at the moment, whether that would actually bestow Parseltongue on him.\nHe rapped his fingers on the table. Could he think of the 9 that would result as a number associated with a serpent? Possibly. It had that tail. It could coil like a snake would. He simply hadn’t ever thought of it like that before, and he was wary about empowering the equation until he had solved the problem.\nSo he sat back, closed his eyes, and meditated on the number nine, filling his mind with the thoughts of snakes, how they could lie in any shape, how the darting tail on the nine might be a tongue as well as a tail, how he could imagine eyes on it without disrupting the overall shape.\nAnd, well, if he could make water flow in such a shape as to leave a blank pool in the center, surely he could imagine a lazily napping snake having that same shape? Sprawled careless on the ground in the sunlight, leaving that gap because it had no reason not to?\nThe longer Harry thought about it, the more clearly the image of the serpent that would make up his imaginary nine came to him: golden, a large constrictor rather than a venomous snake, dozing after a full meal, complacent and ready to swallow him up as part of the people who could speak to its kind.\nWhen he felt he was ready, he opened his eyes, smiled, and began to add on the 1 to the end of the equation.\nBefore he could even finish the equals sign, someone knocked heavily on the door of the flat—the one that was at the top of a small flight of rickety stairs leading down into Diagon Alley, not the one that led down into the locked shop.\nHarry flicked his wand into his hand. Yes, it was probably Riddle, but that didn’t make the plan to face him armed any less sound.\n“Who’s there?” he called, as he stepped towards the door.\n“Your ex-husband.”\nHarry rolled his eyes as he lowered the wand so it wouldn’t be immediately visible when he opened the door, and cracked it. Riddle stood on the top step, staring at him quietly. Harry studied him. There was something off about him, enough that it made him wonder if this was actually Malfoy under Polyjuice or something. For one, there was an oddly greasy feeling in the air around him, as if a lightning strike was about to impale him.\nFor another, that pale, solemn expression was one Harry had never imagined on Riddle’s face.\nRiddle lowered his head a little, as if he was trying to deflect criticism or a curse. “May I come in?”\nHarry shrugged and stood aside, although he kept an equation for disarming Riddle if he should try to draw his wand at the forefront of his mind. It wouldn’t do much about wandless magic, but Harry thought Riddle was still likely to go for his wand first, especially given what he knew about Harry’s Arithmancy.\nRiddle stepped into the flat and looked around. Harry expected the curled lip, but then the sneer slid back into the quietness of Riddle’s face again. It was creepy, in all honesty.\nThen again, Harry had a hard time imagining when he had found something Riddle had done not creepy.\nRiddle turned to face him. “This is where you live?”\n“I know it’s not a palace.”\n“I did not mean it that way. Simply that you could have a larger space if you let other people know about your Arithmancy, and it is nothing like the house that your parents purchased for Diana and me.”\n“I wouldn’t have wanted the sense of obligation to them anyway, not after the way they treated me.”\nRiddle nodded as if he could understand that, and took a seat on the opposite side of the small table in front of the fireplace. He glanced at Harry’s equation, apparently reading the numbers upside-down. “What does this equation do?”\n“I’m getting ready to see if I can make myself into a Parselmouth.”\nRiddle inhaled sharply. His eyes were wide with something that might have been wonder, or well-feigned if it wasn’t, and his hand trembled as he reached out to caress the paper. “It would give me joy to share that with you.”\nHarry raised his eyebrows. “What, no railing about how that would destroy your uniqueness?”\n“At the moment, the only other Parselmouth I know is Diana. Yes, I would prefer to share that with someone who isn’t her.”\nHarry gave a short, sharp chuckle, and sat down across from Riddle. “I’m not trying to be like her or you. I wanted to see if I could do it, and I thought it would be useful to speak to the snakes in the shop.”\n“I never thought you were doing it to be like me.” Riddle eyed him for a second, and then leaned forwards. Suddenly the flat felt too small to contain both of them.\nHarry narrowed his eyes. It’s going to be even smaller in a second, when I turn him into a donkey again.\nBut Riddle only said, in a soft, urgent tone, “Is the offer of listening to me if I could bare my soul still open?”\n“Yes, but I still don’t believe you’ll do it.”\n“I am going to tell you my greatest secret,” Riddle said. “The one I have kept for years, and certainly never revealed to anyone named Potter before.”\nHarry folded his arms. “That phrasing suggests you’ve revealed it to other people, though.”\n“All of them were eager to benefit from the power it could give them. You, though, would probably try to use it to destroy me.”\n“Okay,” Harry said slowly. He had no idea what this could be. Everything he could think of was either too small to prove much of a test of honesty, or the kind of thing Riddle probably would have revealed to Diana, like his Parseltongue, to get her to trust him.\nRiddle reached into his pocket and drew out a silken bag that bulged with odd shapes. The greasy feeling like a lightning strike about to launch suddenly increased around him. Harry narrowed his eyes, and the equation to give Riddle hooves and a tail flexed again in his mind.\nBut Riddle only laid the silken bag on the table and unwrapped it. Harry stared without understanding at the three objects on the table. An ornate locket with a serpentine-shaped S on the front, a glittering golden double-handled cup, a silver diadem with an oval-shaped stone on the front. Harry thought the stone might be a genuine sapphire, not that he’d seen a lot of them up close outside a few pieces of jewelry that his mother wore.\n“What are these?” Harry asked. He found that he didn’t want to touch the objects, beautiful though they were. The greasy feeling had intensified into something that felt like a smothering smoke.\n“My Horcruxes.”\nHarry jerked, his eyes snapping up to Riddle’s face. He remembered that word only from one Defense lesson at Hogwarts in their sixth year, when their professor, Alastor Moody, had described them with grim relish as objects that—\n“Contain a part of your soul,” Harry whispered.\nRiddle nodded, dark eyes still fastened on him and outshining the objects on the table. “Yes.”\n“What the hell, Riddle?” Harry’s voice was thick. He wanted to push himself away from the table, but he had the feeling that he wouldn’t be able to move fast or far, that he would choke on the darkness the Horcruxes were emitting. “What is this? When did you even split your soul?” Another thing Moody had said was that Horcruxes caused immediately noticeable changes in the person who made them, and Riddle had looked and acted the same for all the years that Harry had known him.\n“It was not precisely I who made them,” Riddle answered quietly. “But a version of myself. There were once five of them—perhaps I should say six.”\n“The diary that you came from,” Harry said, both sick and caught up in the realization, wondering now how he had come to accept the story of Riddle simply being “trapped” in the diary so easily. There weren’t common rituals that would cause that which a lot of sixteen-year-olds could use, and certainly not many they could find in the library at Hogwarts. “You killed Georgina Fawcett.”\n“Drained her. Yes.”\nHarry bolted up from his chair and pressed his spine against the far wall.\nRiddle looked at him with a trace of amusement in his eerily glinting eyes. “You are still more powerful, Harry. You can change me into an animal at any point you want. I’m sure you could come up with equations to destroy these.” He nodded at the Horcruxes, and his hands twitched, but he didn’t reach for them. “And in my very slight defense, Fawcett realized what I was right away, having been educated in the Dark Arts by her father. She planned to drain me and absorb my magic into hers. I simply killed her before she had the chance.”\n“At least you admit it’s murder.” Harry’s voice croaked.\nRiddle’s shoulders rose and fell. “Self-defense.”\n“You—you said there were six.” Harry’s head was spinning. This was insane. But at the same time, any protection he might have against Riddle relied on numbers. Having an accurate count of the Horcruxes was important.\n“Yes. These three.” Riddle stroked the side of the diadem, and it seemed to vibrate and pure like one of the Kneazle kittens Harry had put to bed before coming up to his flat. “The diary was the fourth. There was a ring, but Dumbledore destroyed it, and died in the doing of it. It was cursed, and from what I can tell, he supposedly died of a Flesh-Devouring Curse.”\nHarry swallowed. Yes, there had been rumors that Dumbledore’s right hand had been blackened by something that had also caused his death. Apparently, the body was so gruesome-looking that people who looked at it vomited. Harry hadn’t been allowed to attend the funeral, so he didn’t know for sure.\n“The sixth?”\nRiddle glanced at him. “The scar on your sister’s forehead.”\nHarry wanted to scream, to rip, to tear something. “You put it there after you seduced her, you bastard? How could you think telling me this would make me want to be with you?”\n“No. I told you that I did not do it, did I not?” Riddle drew his wand. Harry’s snapped up, but Riddle turned away from him and began sketching in the air, red letters that spun and tumbled into place.\n\nTOM MARVOLO RIDDLE.\n\nHarry stared at them with dazed eyes. Had he ever known Riddle’s middle name? He felt that he had, but he hadn’t paid much attention to it.\nRiddle gave his wand a practiced flick, and the letters rearranged themselves.\n\nI AM LORD VOLDEMORT.\n\nIt was very loud in the little room, with the sound of Harry’s breathing and his pulse hammering in his ears.\n“It was a version of me who put that scar there, and was destroyed by your sister’s magic.” Riddle put his wand away and turned to face Harry. “I like to think that I know better than my older self. I was moving slowly, and I had chosen the political route rather than the terrorist’s to change our world. I was able to verify that my elder self’s spirit was vanquished utterly, and I vowed to never become him. I did not count on becoming captivated by you.”\nRiddle tossed his wand across the flat to Harry, spread his hands and bowed his head. “You know all the anchors of my immortality now, Harry, and as I said, I believe you could come up with a way to destroy them. Including the scar in your sister, if you wish. I have placed my life, my existence, in your hands. There is nothing that I fear more than death, but if that is what you wish to deal me, I would accept it. Do with me as you will.”\nHe fell silent and sat there, hands and throat bared.\nHarry stared at him, and couldn’t think of a single fucking thing to say.\nAfter a few minutes had passed while Riddle sat there staring quietly at the table, Harry did think of things to say.\n“Are you mad?” It seemed to be the only question that would come to Harry immediately, the winner of the contest among the ones crowding his throat. “I just—are you mad?”\n“Arguably, I used to be.” Riddle lifted his eyes, and Harry caught a glimpse of the red tint touching them. He almost thought he was mad himself now, for never connecting that to the red eyes Voldemort had supposedly had. “As far as I can tell, my older self had almost nothing left. I suppose that is what creating multiple Horcruxes does to you.”\n“No! I meant—offering me these.” Harry waved his hand over the Horcruxes, careful not to come anywhere near to touching them. “And offering me your wand. I could kill you right now.”\n“Do you want to?”\nHarry drew his own wand, and the equations burned on his tongue, ones that would poison Riddle, drown him in his own blood, or turn him into a creature that Harry could kill. “I should. For what you did to Diana and me and the whole world, I should.”\nRiddle only sat there and watched him. Harry lifted his wand over his head, and Riddle didn’t move, didn’t blink or breathe.\nHarry cursed bitterly and tucked his wand away. “I can’t kill you as you just sit there. Unlike you, I’m not a murderer.”\nRiddle smiled a little. “I didn’t think you were.”\n“But I could still destroy these.” Harry flung his hand out in another gesture at the Horcruxes without taking his gaze from Riddle.\n“Yes. That is why I brought them to you.”\n“You want them destroyed.”\n“Not particularly.”\n“Fuck you, Riddle, will you say something that has a lick of sense behind it?”\nRiddle finally leaned back in his chair, and Harry thought his limbs fell a little looser with relief, although he couldn’t say for sure. “I trust that you will do something about the Horcruxes,” Riddle said, still never looking away from Harry, drinking him in as though he was the answer to a prayer. Not that Riddle seemed the type to pray, Harry had to acknowledge. “But not kill me. I didn’t think you were a murderer, and I am pleased to see that my intuition was correct. I am placing myself entirely in your hands, Harry. I am surrendering. What happens to me next is up to you.”\nHarry covered his face with his hands. “I don’t want that much responsibility for anyone’s fate,” he whispered. “You’re pressuring me into a corner that I don’t want again, Riddle.”\n“No.” Riddle’s voice was calm. “You can throw me and the Horcruxes out, and warn Diana and your family if you want. Then I would have my political plans, the ones that depended on marrying your sister, destroyed, and I would also lose my chances of spending my life with someone who has such powerful, universe-bending magic, the only person I want to spend the rest of my life with.”\nHarry dropped his hands from his face. “You can’t be in love with me.”\n“I don’t know for sure if I’m capable of that emotion.” Riddle shrugged. “I was conceived under a love potion that my mother used on my father, and it’s true that I never felt it before I went into the diary or for your sister. I do know that when you explained your Arithmancy to me, it was like a sun rising inside me. That’s all I know.”\n“Just because you want power, and just because you want to have it, doesn’t mean you will. Sirius and Remus couldn’t do that Arithmancy when I showed them.”\n“I don’t think it’s likely that I’ll ever able to share your power. Not your exact power. I suspect you cracked Heller’s Theorem in a way that’s unique to you.”\nHarry narrowed his eyes. That sounded like something Riddle would say to praise and flatter him and convince Harry to fall in love with him in return, but it didn’t work when Harry had no idea what it meant. “Talk sense, I said.”\n“Heller’s Theorem says that you should be able to work different spells, and even affect the physical world, based on the symbolic significance of equations and numbers.” Riddle still hadn’t looked away from him. It was—bizarre. “But it also talks about resonance. Did you ignore that part?”\nHarry shrugged. “It didn’t make sense, so I left it out.”\nRiddle’s lips parted a little. Then he gave a laugh that fell on Harry’s ears like feathers. “Oh, Harry. You cracked it without even paying attention to the whole of the theorem? You are a wonder. No one else will ever be able to do what you do.”\nHarry tensed. “You’re looking at me as if you want to worship me. I don’t like it. Stop it.”\n“I’m a Legilimens—”\n“I knew that.”\nRiddle didn’t indicate that he’d heard Harry except by a slight tilt of his head. “And that means that I’m more easily able to sense deception, as I can tell the difference between surface thoughts and those underneath even when I’m not actively inside someone else’s mind. I cannot distinguish between objective truth and something someone merely believes to be true, but neither can Veritaserum.” He leaned in a little. “And I can tell that part of you likes the thought of being worshipped very much.”\nHarry felt the blush to end all blushes creeping up his face. It was true that he’d fantasized, so many times he had no idea how much of his life he’d spent at it, his family and other people staring at him in awe when he finally did something impressive enough to earn their regard. Those who had disregarded him at Hogwarts, like Malfoy. People he trusted who still didn’t seem to see him fully, like Sirius and Remus. Someone who would eventually fall in love and want to marry him, the person he really was, not the Potter family’s reject.\n“Yes, I thought so,” Riddle said, his voice low and throbbing with satisfaction. “And you deserve admiration and love. Perhaps many people do,” he added, which Harry supposed was his version of a generous moral concession. “But you are instinctively brilliant. I do not know why it did not reveal itself before, and I do not care. Not now that I can offer you that admiration and love.”\n“You just said that you didn’t know if you were capable of love!”\n“If I can offer it to anyone, it would be you.”\nHarry turned around and paced to the far corner of the kitchen, leaning his head against his icebox. The Cooling Charms on it didn’t do much, unfortunately, beyond quelling a tiny bit of his headache. “What does the resonance part of Heller’s Theorem do?” he asked finally, because that was an answer he thought he could deal with right now.\n“It means that certain minds will resonate in certain ways with certain numbers. So everyone’s way of solving Heller’s Theorem will be different.” Riddle shrugged a little. “Or at least fall into different narrow categories. I suspect your mind might have resonated in the same way with numbers as Heller’s did. It would explain why what feels intuitive and easy to you does not feel so to other people, and why no one else cracked it. No one whose mind resonated in the same way studied it for long enough.”\nHarry sighed and turned back. “Then you shouldn’t care about me or want me. I’m not a genius, in that case. Just someone who studied it for long enough.”\n“What you do with your Arithmancy, and the way that you invented a way to destroy an ancient vow on the fly, is still beautiful,” Riddle said, as if the words were a law of the universe not even Harry could break. “Patience and endurance might have been the foundation of how you cracked it, but they are not the whole thing.”\nHarry disliked the warmth seeping down into his chest, but it was true that he wanted to be admired for what he’d done. That ambition had been one of the reasons the Hat had wanted to put him in Slytherin.\nBut why did it have to be Riddle?\n“I don’t understand why you see me as so different from the rest of my family, though,” he said, walking back to the table and moving his chair so he could sit not exactly opposite from Riddle, and as far away from the Horcruxes as he could get. “They have the patience and endurance to get good at spells in their special areas, too.”\n“They have dogged persistence, and they call that genius,” Riddle said scornfully. “Diana thinking that she knows all about Defense, and rejecting your gift because of that.” His eyes burned again. “I, on the other hand, recognize good taste as well as intelligence.”\n“You kept the book.”\n“Of course I did. It came from your hands, and that means it must be useful.”\nHarry closed his eyes and rubbed the bridge of his nose. I can’t believe I’m sitting here feeling flattered because of something bloody Lord Voldemort said. He took a deep breath and opened his eyes. Along with his need to matter to his family, he should have been able to shed his desperate craving for praise.\nMaybe it was harder because he just wasn’t used to it.\nStriving to get away from that silly dilemma and back to the impossible one in front of him, Harry asked, “But why does that make me so bloody special to you? If you knew all this, I’m surprised that you aren’t over there kneeling at Diana’s feet. She’s your Horcrux. She has to be special, doesn’t she?”\nRiddle rolled his eyes. “The other Horcruxes I, or rather my older self, made deliberately. The shard inside your sister is an accidental piece so small that it can’t even influence her—”\n“It made her fall in love with you, surely.”\nRiddle actually had the bollocks to look offended. “I did that.”\n“Okay, fine,” Harry said, and fought back his bubbling laughter. “So it’s too small to be of any use to you? It wouldn’t keep you alive?” He held his breath a little, waiting for the answer to that. Riddle would have to start lying any time now.\nRiddle shrugged. “It didn’t keep my elder self’s spirit alive, although I think what happened in that case is that he was so small a piece of soul himself that he self-destructed with the combination of a piece being ripped away from him and implanted in your sister, and the backlash of your sister’s magic. She does have impressive magic,” Riddle added in a musing tone. “But it wasn’t visible when she was a baby, only afterwards, so I think your theory about her magic becoming essentially broken in a desperate attempt to shield her is correct. And my older self was mad to attack an infant in any case, all because of a prophecy—”\n“What?”\nRiddle paused for a long moment. He stared at Harry. Harry stared at him. He could hear the wild, angry thump of his heart.\n“They didn’t tell you.” Riddle’s voice was soft with something that might be glee or shock or disbelief.\n“That Diana was the subject of a prophecy? No, they sure as hell didn’t.” Harry clenched his hands on the table. His mind raced. It seemed strange to him now that he had never questioned the specifics of why Voldemort had gone after Diana, but—\nWell, his parents had been Voldemort’s enemies, among the most prominent of them when Dumbledore’s Order of the Phoenix was still active. Sirius and Remus had certainly told him their share of death-defying stunts, and always mentioned that Lily and James were in the forefront of the battles. Harry had assumed that the strike was more aimed at them than at Diana, and if Voldemort had come further into the house they had at the time than the little front room where Diana’s cot was, he would have killed Mum and Dad, and Harry, who had been asleep upstairs.\nBut a prophecy did make more sense.\nHarry closed his eyes and desperately tried to hold back his rage. It shouldn’t matter to him anymore what his family did, should it? He had discovered his own worth, and he should be able to stand out of their shadow.\nBut this betrayal went deeper than that. Mum and Dad had never shared with him that there was a prophecy, sure. But neither had Sirius and Remus.\nIt came back down to bloody Tom Riddle to do all these things that his own family should have done.\nHarry twisted to his feet. Riddle followed him immediately, casting a spell that rushed the Horcruxes back into their silken bag.\n“Where are you going?”\n“To speak with Sirius and Remus. They should have told me the truth. I don’t know why they didn’t.”\n“Allow me to come with you.”\nHarry paused, even in the middle of the emotional maelstrom overwhelming him, and glanced back at Riddle. He’d dipped his head a little and didn’t look like someone asking for permission, but hey, at least he’d asked it instead of just making some pronouncement about the way that it was going to be.\n“Why should I?” Harry asked instead. “You’re going to sit there and insult Sirius and Remus, and I don’t want to listen to you do it.”\n“I will keep the insults to myself. But I wish to be with you right now.”\n“Why?”\n“You are still the only person I might ever come close to loving.”\nHarry made a wordless gesture of frustration, and Riddle fell in behind him with a small smile. It wasn’t a gloating one, though, or Harry would have turned him into a donkey and left him there, Horcruxes and all. It looked like might have been a grateful one.\nHarry just shook his head. He had no time to deal with all of Riddle’s revelations right now. The one that mattered most to him was how far he could trust even the godfather and foster father he had thought of as still on his side.\n*\n“Harry?” Sirius opened the door, yawning. “It’s almost eleven. What is it?”\nFrom the looks of his mussed hair, he had fallen asleep in the drawing room again, the way he always used to when Harry was younger and Sirius would try to finish one last bit of Healer paperwork before going to bed. Harry felt his heart seize, but didn’t let that change his expression.\n“I need to talk to you and Remus,” he said, and brushed past Sirius with Riddle right behind him. He had the feeling that Sirius might have tried to shut the door at least in Riddle’s face, but he was baffled enough to go along with it right now. “There’s something I found out that you never told me, and I want to hear what your excuses are.”\n“Remus is in bed.” Sirius shut the door and turned around, leaning against it, blinking. “What are you talking about? What happened with your family yesterday? We expected you to owl us. Why didn’t you?”\nHarry folded his arms and stared at Sirius. “I want to know why you never told me about the prophecy.”\nClouds of confusion drifted across Sirius’s face, and Harry didn’t think all of them came from just being tugged out of sleep. He watched closely for any sign that some of them might come from trying to conceal something.\nThen Sirius said, “That thing? The one that said Diana was destined to defeat Voldemort? I never put any stock in it. I haven’t thought of it in years.” He blinked and said a little more energetically, “Why should we have told you about it?”\n“You don’t think I deserved to know that it existed?”\n“Sirius, what’s going on?” Remus shambled out of the master bedroom, also yawning. His eyes snapped alert when he saw Riddle, or maybe when he saw Harry. The kind of emotions Harry was feeling right now were probably sparking a wildfire to his werewolf senses.\n“Harry wants to know why we never told him about the prophecy.”\n“Prophecy?”\nRemus’s voice was blank enough that Harry closed his eyes. His emotions gave a high, vibrating twang inside him, and then settled down. It really did sound like they had just never told him about it because they hadn’t considered it important, not because they were keeping it a secret like his family.\nRiddle’s hand brushed his elbow. Harry hated how he could tell it was him without even opening his eyes.\nOr maybe it was just because there was no way that either Remus or Sirius would have touched him like this—lingering, caressing, possessive.\nHarry pulled his arm away and opened his eyes to study Sirius and Remus again. They were looking hard at him now. Sirius was the one who said, “I doubt James and Lily would have said anything. Who did?”\nHarry raised an eyebrow, and both of them swung around to stare at Riddle at the same moment. Riddle only huffed a little sigh and examined his nails. “It was one of the first things Diana told me, that she was destined to defeat this Dark Lord who attacked her when she was a baby. She knew about the prophecy. She bragged about it. Imagine never mentioning it to Harry, despite the fact that he’s her brother.”\n“We didn’t know that you didn’t know,” Remus said. “And truthfully, Harry, it’s just faded from our minds so much in the last decade or so. It’s clear that You-Know-Who is dead.” Harry didn’t dare look at Riddle right then. “I didn’t see why it mattered. If it ever mattered, it’s been fulfilled.”\n“Yeah, I always thought Divination was a load of dragon dung,” Sirius said, shrugging. “You-Know-Who put some stock in it, though, so Dumbledore did as well. It was either fulfilled or it didn’t make a lot of sense in the first place. Why would an infant have the ability to defeat a Dark Lord?”\n“Diana’s very powerful,” Harry said, a little weakly. The rush of adrenaline was leaving him, and now he felt ashamed and irritated that he’d stormed over here solely on Riddle’s word. He ought to have known he could trust the word of the men who had taken care of him.\nHe was just so tired of being ignored and left out of family business.\n“Yes, but she didn’t show that kind of magic as a baby.” Remus finally reached out and put a hand on Harry’s shoulder, patting a little, as if he thought Harry probably wouldn’t explode this time. “Would you like me to make us some tea?”\n“I think Harry could use something stronger.”\n“Fuck off, Riddle. I broke the ancient vow and I can break more than that.”\nRiddle only looked delighted, while Remus sucked in his breath sharply and Sirius looked as if he would faint. “What? Harry, what in the world are you talking about?”\n“Oh.” Harry blinked. He’d forgotten that no one except him, Malfoy, Riddle, and Neville knew about that—and maybe Madam Madstrom, if she had got the gist of it from his comments—and he certainly hadn’t told Sirius and Remus. “Uh, yeah, maybe we should sit down and exchange news.”\nRemus went over to the cabinet where Harry knew they kept the brandy, and Sirius herded Harry and Riddle into the sitting room. Harry went, moving almost in a dream.\nBeing about to hear the truth was such an unexpected situation that he had no idea what would come next.\nRiddle contrived to sit on the couch next to him, because of course he did. Harry ignored him as best he could. There was the fact, though, that this was the first independent confirmation he’d received of something Riddle had told him. He really hadn’t been lying about the prophecy that had led Voldemort to target Diana.\nWhich meant the rest of what he was saying might be true, as well, and he might actually have crossed the barrier of honesty Harry hadn’t thought he could cross.\nBut Harry didn’t want to think about that right now, and he turned his attention to Sirius and Remus as Remus splashed some brandy into a few different cups and floated two over to him and Riddle. Harry took his and sipped without comment. He resolutely didn’t look over to see what Riddle did with his cup.\n“First of all, yes, there was a prophecy,” Sirius said, and settled back against the chair he’d probably fallen asleep in, absently smoothing down his hair. “But like I said, no one’s thought of it in years. Except Diana, I suppose,” he added, with a darting glance at Riddle. “The Order of the Phoenix mainly latched onto it because at that point we were losing the war against You-Know-Who, and it offered a bit of hope.”\n“It was vague,” Remus said, shaking his head. “We didn’t get to know the exact wording, it was considered too dangerous for that, but from what Albus told us, it was only reporting that a child born at the end of a certain month would have the power to defeat a Dark Lord. Not even that it was You-Know-Who, or that it would happen for certain. Just the power.”\nHarry blinked. “Then that makes me wonder why Voldemort chose her at all.”\n“Lily and James had defied him to his face three times,” Sirius said. “He was always trying to recruit them, and they refused, of course. And they had also killed several of his Death Eaters and interfered in some of his attempts to kidnap or torture people. He took that really personally.”\n“My older self was an idiot,” Riddle muttered under his breath, or something that sounded like it. Harry ignored him.\n“He believed in the prophecy,” Remus said, with a shrug. “So did Albus, because he did, although he thought You-Know-Who would be the one to bring about its fulfillment himself. And I suppose Lily and James did, or do. They certainly told Diana about it. We thought they had told all of you.”\nHarry swallowed. “No. I never knew about it until Riddle mentioned it.”\n“All right, so I do want to hear about your supposed breaking of the ancient vow,” Sirius said, giving Riddle a dubious glance, “but there’s something else I want to ask about. Harry, kiddo, what the hell is going on in your family? First it turns out that Lily and James really did disparage your intelligence a lot more than we thought, and now they’re keeping secrets? What is it?”\n“The same thing that’s been happening for fifteen years at least,” Riddle said coolly. “That was how long ago Harry was sent to live with you, wasn’t it? His parents ignore him and shunt him aside, and you’re surprised that they undervalue him?”\n“We were happy to take Harry in,” Sirius said fiercely. “That had nothing to do with ignoring him.”\n“Yes, but you permitted his parents to do so.” Riddle was leaning forwards now, body coiled like a leopard’s about to spring. “I don’t think Harry counts you among the ones who shuffled him off, but I do. When you treated all their comments as jokes, when you assumed that parents who visited him once a week were the same as those who loved him—”\nHarry reached out and gripped Riddle’s shoulder. Riddle shut his mouth as if someone had closed a door on it. Harry sighed and said, “Not right now,” and then turned to Sirius. Remus was watching with anxious eyes from across the room.\nHarry glanced at both of them, and then said, “Yeah, Diana spent a lot of time at school telling her friends that I wasn’t a genius. Not like her and Mum and Dad and Violet. I’ve been told over and over again that I must be jealous of them because I’m not as academically accomplished, or because Diana is the Girl-Who-Lived. When I went over there yesterday, they accused me of seducing Riddle, and then of my Arithmantic magic being a trick or an illusion. Everything came back to how they were right, I was wrong, and I shouldn’t have contradicted them or done anything that ruined their mediocre image of me.\n“So that’s why I thought that you had kept the prophecy from me on purpose, because they did. And now that I think about it, Violet’s said a few strange things that could refer back to it. So they thought a girl who was still at Hogwarts needed to know about it, but not me? What do you think that says about them?”\nRemus closed his eyes, looking stricken. Sirius reached out, although his chair was too far from Harry’s couch for him to actually take Harry’s hand.\n“I’m so sorry,” he whispered. “I knew they valued intelligence and they were proud of Diana’s scores in Defense and Violet’s proficiency with Arithmancy, but—I had no idea this was what it was like, Harry.”\n“That’s why you kept your Arithmancy from them, of course,” Remus said, his voice thick with sadness and understanding. “Because you were hoping it would finally make them see you as an equal, and then it turned out it didn’t.”\nHarry laughed bitterly. “That was also the reason I was considering using some equations to change my intelligence or my personality. So I could either become what they wanted or become someone who didn’t care about what they wanted.”\n“What?”\nRiddle said it first, with Sirius and Remus only a beat behind him. Harry shrugged and started to answer, but Riddle grabbed his arm and wrenched him around. Harry dragged his arm back and glared at him.\n“You were considering—sacrificing everything that makes you brilliant, strong, unique, to fit in better with them?” Riddle’s voice was a low, violent hiss.\nHarry put a hand in the middle of his chest and shoved, hard. Riddle went rebounding back against the couch, and if Harry had cheated a bit by adding magical strength to his hand, well, Riddle wasn’t about to announce it.\n“Yes, I was,” Harry said. “Because they’re my family, and I still wanted to belong. Or else I wanted to change myself into someone who wouldn’t care if I didn’t belong.”\n“Wait,” Sirius blurted. “You can do that, Harry? You could cause permanent changes in yourself with the equations?”\n“I never tested it. I would have practiced with something less extreme first. But yeah, I think so.”\n“Or permanent changes in someone else?” Riddle asked in an odd tone.\nHarry shot him a glance, wondering what in the world he was thinking now. Riddle’s face remained shadowed, however. He was simply watching Harry with the kind of intensity that demanded an answer.\nHarry shrugged. “I think so. I already did it to you, didn’t I, when I broke the ancient vow?”\n“Yes, I want to hear about that,” Sirius said firmly. “How in the world did you manage to do that? Why did you want to?”\n“Because Riddle had bound me without giving a fuck about what I wanted,” Harry said, and ignored the way that Remus sighed about his language. “I didn’t want someone following me around everywhere and telling me how grateful I should be for his protection. Not to mention the problems it caused with my parents and Diana.”\n“Your family doesn’t deserve you,” Riddle whispered.\n“But I might have reconciled with them if not for you—”\nHarry was all ready to argue, but Remus interrupted this time. “No, Harry, I don’t think that’s true. Not given what you’ve told us about them, what we managed not to see all these years.” His eyes were bright and sad as he studied Harry. “Not from the moment that Tom bound himself to you and they saw you as interfering in Diana’s rightful destiny.”\nHarry sighed. “Maybe you’re right. But I didn’t ask for it. I went to my ritual circle in the Forest of Dean—”\n“Since when do you have a ritual circle?”\n“Since I made one to contain my Arithmantic magic,” Harry said, and went on with the story. “I decided that I couldn’t do much about Mum and Dad and Diana, but I could damn well do something about the ancient vow. I constructed three equations that all added up to thirteen, and had various symbolic numbers in them that represented what I wanted to keep and what I wanted to get rid of. Then Riddle found me, probably because of the bond.” He glanced at Riddle, who simply nodded. “I drew a triangle under the equations and raised them as a floating pattern of dirt, then brought down the all the chaos and bad luck of thirteen threefold on the ancient vow. It shattered.”\n“The backlash must have been horrific!” Sirius looked as if he was standing in the forest and watching. “Did you pass out?”\nHarry laughed. “No. The equals signs of the equations and the numbers that represented what I didn’t want absorbed the backlash for me.” He glanced smugly at Riddle. “I’m a little surprised he could walk, though.”\n“So am I, though perhaps not for the same reason.”\nHarry blinked at Riddle, but although he had a half-smile, he spoke to Sirius next, not Harry. “And he doesn’t realize how extraordinary he is.”\n“No,” Sirius croaked. “There should have been no way of breaking an ancient vow. No way…” He trailed off, and then gave a rather nasty-sounding chuckle that Harry had mostly heard when he told stories of playing pranks as a Marauder. “Jamesie is going to be so upset about losing you if he ever figures it out, Harry.”\n“I don’t think so. Not after what he thinks I did to Diana.”\n“That’s why I said if. James wanted extraordinary children. He has three of them, not two.” Sirius pointed a finger at him. “And I want to be in the room the next time you try to explain your Arithmancy to him.”\n“I don’t know that I will again. I’m done seeking their approval. Unless they want to apologize, they can fuck off.”\n“You don’t want to be with your family, Harry?” Remus looked saddened.\n“They don’t want me. Why should I?”\nRemus nodded slowly. “I’m sorry that we never saw what was going on and put a stop to this before it got to this point.”\nHarry shook his head. “It wasn’t your fault, and what’s done is done. If things hadn’t got to this point, then I probably wouldn’t have my Arithmancy. And I would give up so much just for that, you have no idea.”\nRiddle made a soft sound beside him. This time, Harry didn’t give him the satisfaction of looking around. He probably wanted to say that Harry wouldn’t have him, either, if he had remained safe in the bosom of the Potter family, but Harry didn’t want him.\nAnd he didn’t know what to do with the fucking revelations Riddle had laid in his lap, either. Charging off to find out what Remus and Sirius knew about the prophecy was, in part, a way to avoid dealing with them. But he knew that he couldn’t put that off much longer.\n“Do you want to stay the night, Harry?” Sirius asked. “Your room is ready for you as always. And for you, Riddle, there’s the stable, if you want.” He sniggered.\nRiddle laughed, but he didn’t sound amused. And Harry didn’t think that Riddle’s tolerance would extend to his godfather. He glanced sideways, and Riddle’s face confirmed that it wouldn’t.\n“No, thanks, Sirius.” Harry put down his drained drink. “I need to get back to the flat. Madam Madstrom will expect me in the shop tomorrow morning.”\nSirius got up and came over to hug him. “You’re just fine the way you are,” he breathed fiercely into Harry’s ear. “You’re amazing. And I’m not surprised that a handsome, talented bloke wanted to marry you more than he wanted to marry Diana, if you want my opinion.”\nIf only you knew, Harry thought, but this wasn’t Sirius’s problem to worry about, and Harry didn’t know that it ever would be. He hugged Sirius back, and held onto him, and then Remus, for an extra-long moment.\nThen he and Riddle were outside Sirius’s house, and standing on the Apparition point. Harry took several deep breaths and turned to face Riddle.\nHe was going to ask how they could get the Horcrux out of Diana, but Riddle took him completely by surprise for the third or fourth time that evening. “You believe that you could safely make changes to someone else with Arithmantic equations.”\n“Yes,” Harry said. “I did it to you, didn’t I? And that vow was deeply rooted in your magic, which you still have.”\nRiddle smiled, but there was a desperation of sorts beneath the expression that made Harry cautious. “And the changes you would have made to your personality…could you safely make those to someone else, as well?”\nHarry stared at him. “What the fuck are you saying, Riddle?”\n“That if you could come up with equations that destroyed my Horcruxes, at the same time you might come up with some that would alter me into someone you would find more lovable,” Riddle said, as if it was the most natural thing in the world.\nHarry fell back a step, instinctively. Riddle didn’t move towards him, but stood watching him with eyes that glittered a little.\n“No,” Harry whispered. “That’s sick, Riddle.”\n“Obviously you didn’t always feel that way, or you wouldn’t have come up with the option of doing it to yourself,” Riddle answered instantly. “I want your acceptance enough to have a chance with you, Harry. I made mistakes, and I have attempted to rectify them. I met your challenge of honesty, I believe, and have placed my fate in your hands. Why should that fate not be to become a different person, to never have a chance again of slipping back into my former identity?”\nHarry shook his head, his heart boiling with a formless sort of horror. “No. I won’t do that. You shouldn’t be changed.”\n“Again, you wished the same fate for yourself.” Riddle was making the argument quietly, but not smiling, his eyes shining with that same blinding intensity that he’d had during the wedding, and the aftermath in the Forest of Dean, and earlier tonight when he had laid his soul on the table in front of Harry. “I am also choosing this of my own free will. Why wouldn’t you grant the favor to me? You can sculpt me to become whatever you want—”\n“I don’t want to do that!”\n“Then what do you want?”\nHarry shook his head, wordless, as he looked at Riddle. He’d never thought beyond the honesty requirement and the baring of the soul requirement, honestly. He’d been so sure that Riddle could never pass those tests, why bother thinking beyond them to something that was clearly impossible?\nBut the man standing in front of him now was capable of that kind of honesty. And the kind of evil that made him able to create Horcruxes. And a weird devotion to magic, if not to Harry himself. And draining a girl to death.\n“I think I want you to go away,” Harry said, inaudibly.\nRiddle tilted his head downwards. “If you wish for me to do that, and place the problem of the Horcruxes in someone else’s lap, then I will.”\n“No, I—I wish I didn’t have to deal with this at all.” Harry tore a hand through his hair. “Why did you choose me to deal with it?”\nRiddle’s lips quirked in a faint, unhappy smile that was the only real one Harry thought he had ever seen from him. “Because you are capable of doing so.”\nThat straightened Harry’s spine, which was absurd, but it was a vote of confidence. And, well, he’d thought yesterday that he would be tied to this bastard in a vow for life, and he hadn’t been.\nHe had thought he would be able to convince his family to accept him, and he hadn’t. But he had found a path out of that situation.\nHe could find a path out of this.\nHe met Riddle’s eyes. “Give me until tomorrow evening,” he said. “Come to my flat at six. We’ll discuss it then.”\nRiddle bowed. “As you wish,” he murmured, and then turned and Apparated away without looking over his shoulder at Harry.\nHarry blinked at the empty space. He left. Because I asked him to.\nThat was a test he hadn’t even thought to set.\nBut perhaps, Harry admitted as he Apparated himself, the one that most mattered.\n“I need to speak with Diana.”\n“Haven’t you done enough harm?”\nMum leaned on the door, looking exhausted. Harry raised his eyebrows. If they were so tired of dealing with Diana’s magic all the time, they should have gone back to the one Healer who had helped Diana control her magic. It had worked until she met Riddle, and then somehow he had become necessary to her control.\n“Whatever you think I did, it’s still less harm than shuffling me off on Sirius and Remus, indulging Diana in her little-girl dramatics, and deciding that everyone else in the family could know about things like the prophecy but leaving me out of it,” Harry said coolly. “Didn’t you used to enjoy that Muggle saying about reaping what you sowed?”\nUnlike Remus and Sirius, Mum had obviously kept the prophecy at the forefront of her mind. She stared at him with her face going rapidly pale and her hand closing on the door as if she needed it to stand. “Who told you about that?”\n“Riddle. He said that Diana told him about it. Bragged about it,” Harry added, before his mother could make some ridiculous accusation about him bullying the secret out of Diana or Violet. “One of the first things she told him.”\nMum closed her eyes. “You were never supposed to know.”\n“Why? When I think you told Violet?”\nHarry pushed on the door, and although she seemed as if she didn’t want to do it, his mother moved aside to let him into the house. “We didn’t know if the prophecy had been fulfilled or not,” she murmured, her gaze flitting up the stairs. Harry knew why. He could feel the tantrum that Diana’s magic was having from here. “There was always the chance that the war would start again, if You-Know-Who returned. We needed to restrict the knowledge to those who could be useful in the war.”\nHarry stared at her, wondering how in the world two schoolgirls could be useful in the war, and then the Knut finally dropped. “Oh. So you decided that I couldn’t because I wasn’t the genius child you wanted.”\n“There’s nothing wrong with not being a genius,” said Mum quickly.\n“Really? You acted like there was a fucking lot wrong with it.”\n“It was just—we needed to give our time to Violet and Diana. They both need so much help…”\nHarry stepped past her, not wanting to hear the excuses, but apparently the sound of their voices had been enough to draw Diana’s attention. She was standing at the head of the huge marble staircase, her magic flaring out around her like the uncombed curls of her red hair. “You,” she said with loathing.\nOddly enough, the tone didn’t hit Harry as hard as it would have even a week ago. All he could think about was how much more passion Riddle could put into a single word than she could.\nWell…of course. The clouds cleared from Harry’s eyes as he stared at Diana. She was just a teenager. An overindulged, spoiled teenage girl. She wasn’t the devil incarnate and she wasn’t a heroine. Of course she wouldn’t be a match for someone who had created Horcruxes when he was at least sixteen and made everyone in the Potter family dance to his tune for years.\nHarry could be gentler with her than he’d thought he could.\n“I need to talk to you, Diana.”\n“What about? You already married the man I wanted for my husband, what more do we have to say to each other?”\n“The ancient vow is gone,” Harry said. “I broke it with my Arithmancy.” He had to admit he was a little curious as to what their reactions would be.\nMum put a hand to her mouth. Diana’s face cleared, and she beamed with a force that would have made a power all on its own, and could have let someone fall in love with her with nothing of the Girl-Who-Lived nonsense in place, Harry thought, feeling sorry for her. “Of course that happened! When is Tom coming back to me?”\nSo they believe in my Arithmancy when it benefits them. It wasn’t a disappointment, though. It was about what Harry had expected.\n“That’s what I need to talk to you about. He told me some things…” Harry let his voice trail off suggestively, and Diana immediately pounced on it.\n“Of course! Come into the sitting room, Harry.” Diana ran down the stairs and towards the room where they’d held the pre-wedding party a few nights ago.\n“Diana, I’m not sure—”\n“Tom sent him, Mum! Why he would he do that unless he was going to marry me? It’s strange he didn’t come himself, but maybe he knew how angry I was with him.” Diana marched into the sitting room, and Harry met their mother’s eyes evenly for a few moment before he trailed after her.\nMum didn’t follow.\nThey really do just let her ride roughshod over everyone, Harry marveled to himself as he sat down across from Diana. This conversation couldn’t be long. He had promised Madam Madstrom that he would stay an extra hour that evening if she let him have an extra hour off in the afternoon, but then again, it didn’t need to be long. He had some brutal things to say, and brutal things that Diana needed to hear.\nDiana arranged her robes around herself on the couch in front of the fireplace, and stared at him impatiently. “Why didn’t Tom come himself?’\n“He didn’t think he could put it politely.” Harry leaned forwards. “He told me about the prophecy that said a child born at the end of a certain month was destined to defeat Voldemort. And he told me that you have a piece of Voldemort’s soul behind your scar.”\nDiana’s mouth fell open. Her face had gone more pale than Mum’s at the door, and more rapidly. She didn’t burst out weeping or screaming, but Harry thought it was a near thing.\nHer magic struck hard enough to knock a vase from the mantel and grind the shards on the floor into powder.\n“Calm down.” Harry didn’t raise his voice. He’d had plenty of time to think last night, and he was sure that part of the reason Diana’s rages lasted as long as they did was that her magic fed on the rage in other people. It agitated her, made her stronger. And everyone running everywhere and screaming and acting as though it was the end of the world when she was upset only made it worse.\n“You calm down! If someone—if someone had told you that you had a piece of your greatest enemy’s soul in yours—”\nHarry looked into her eyes and thought, Zero, as hard as he could. The invisible ring snapped tight around Diana at once, and the furniture stopped shaking. Diana opened her mouth and kept it open.\n“What happened?” she finally whispered.\n“I thought of a zero, and it formed a ring that contained your magic. But more than that, I know you can control it, Diana. You just let it loose because it’s a way of getting what you want, and you’re used to getting what you want. But you can control it any time you like.” Harry kept his voice brisk, trying not to lean too hard on either his contempt or his sympathy. “You were controlling it just fine from the time you were seven until you were twelve. What happened?”\n“It just went wild that year.”\nDiana wasn’t looking at him. Harry made an educated guess, because he was pretty sure he knew what had happened. “You let it loose to impress Tom Riddle, didn’t you? And then it became tempting to use it to get what you wanted, like when you came home that summer and told Mum and Dad that you wanted to be betrothed to him as soon as you turned fifteen. And then it became harder to control because you weren’t trying to control it anymore.”\n“It hurts to control it!”\n“Then find a different way,” Harry said. “Did it hurt when I forced it back into your body just now?”\n“No.”\nDiana’s voice was barely audible. Harry nodded without feeling any particular sense of triumph. “You could use meditation or visualization, probably. But yes, you do have a piece of Voldemort’s soul behind your scar. Riddle was quite certain of it.”\n“Is that the reason he didn’t want to marry me?”\nHarry almost said yes, because it would be the perfect lie, but changed his mind. After all, he wanted to remove that shard of soul, and the last thing he wanted was Diana then immediately going off to Riddle and telling him she was “clean” and they could marry. She’d had her heart broken enough by the bastard.\n\nOh, really? Is that the only reason?\n\nHarry leaned forwards and said, “No. He changed his mind because he decided that he liked the power he saw in me better than the power he saw in you. But since I destroyed the ancient vow, he’s having to behave himself and act like a decent person. Among other things, that means that he told me about the piece of the monster’s soul so I could remove it from you.”\n“You could remove it?”\n“You didn’t distrust that I broke the ancient vow. You felt it a minute ago when I forced your magic back into your body. And now you’re going to doubt this?”\nDiana bowed her head, but she whispered, “Why did he have to fall in love with you, and not me? What’s so bad about me?”\nHarry felt an uncomfortable twinge of pity. He pushed that away just like he had the question he’d asked himself a minute before. Now wasn’t the time for either of them.\n“I don’t think he’s in love with me. He told me himself that he was conceived under a love potion and he thinks that he’s incapable of feeling it. But he respects my power more than he respects yours. Partially,” Harry added as he saw her mouth opening again, “because I can control it, and I can do marvelous things with it. You break vases.” He nodded to the few shards still left on the floor.\nDiana stared down into her lap, at her entwined hands, and finally whispered, “All right.”\n“All right, what?”\n“Remove the soul-shard.” She faced him and pushed her loose fringe back from her forehead to reveal the lightning bolt scar. “If you can.”\nHarry nodded and drew the parchment he’d prepared ahead of time out of his pocket, ignoring the temptation to respond to her taunt. He smoothed the parchment out on his knees. On it, it bore the equation 7 – 1.\nThe power that he had almost grown used to feeling from it surged as he stared at the scar on Diana’s head, and then compared it to the figure of the 7 he had drawn. He spent a few minutes erasing parts of the original number and adding a jagged line here and there that would make it look more like the scar while still recognizable as itself. And he focused his mind, too, on the fact that this was the most powerful magical number, while the parchment warmed in his hand.\nThen he lashed down the equals sign. The sheet leaped eagerly in his hands, while Diana blinked and stared at him.\nOn the opposite side of the equals sign, Harry wrote down, carefully, 0 + 6.\nThe air twisted and hissed near him, golden figures of the numbers lighting it up. Harry gestured with his hand at Diana’s forehead, and the magic turned, pointing to—\nSomething that screamed and began to engage in a frantic struggle.\nHarry gritted his teeth and tugged harder with the equations, laying his hand over the numbers when they began to smoke and burn. He hadn’t thought it would be this difficult. The shard had probably been dormant inside Diana, but it appeared that he’d awakened it with his equations.\n\nWell, then. I still have to pull it out of her if I’m going to do what I decided I would with Riddle’s Horcruxes. \n\nThe shard continued fighting him, but Harry focused on the shapes of the numbers in his mind, and slowly, with a wail, it floated out of Diana. She gasped and covered her bleeding scar with one hand. Then she began to cry.\nReckoning that would bring their parents soon enough, Harry focused on the zero in the joined equations. The 7 represented Diana’s scar, the missing 1 represented the Horcrux he had taken from it, the 6 represented the total number that had once existed, and the 0—\nRepresented the trap he was going to tuck the Horcrux in. He forced it down and down, smaller and smaller, into a ring that projected from his body and encircled him the way he had forced Diana’s magic to rotate around her. It took much more effort than he’d planned on, and the wailing in his ears sounded louder and more aggressively, but the shard finally faded into the trap-ring. Harry gasped and opened his eyes.\nHe would have to concentrate on the zero the rest of the way back to his flat, he knew, or it might well escape from him. He had no idea what effect a free-floating soul-shard would have on the world, and no desire to find out.\nHis parents were standing in the door of the sitting room, as he’d expected. But it seemed they’d had enough sense not to interrupt what Harry was doing while he was still doing it. Now, though, his mum gave him a dirty look and bustled over to hug Diana gently, while Dad turned and stood between them and Harry.\n“What were you doing to Diana?”\n“Removing the Horcrux that was trapped in her scar,” Harry said, and rolled his shoulders. He didn’t know if he had actually hunched them in defense while he trapped the shard, or if it was just a physical representation of the magical effort he had exerted. He supposed it didn’t really matter.\nDad paled dramatically the way everyone seemed to be doing today. “There wasn’t a Horcrux trapped in her scar.”\n“According to Riddle, there was.” Harry nodded to the trap-ring surrounding him before he remembered that no one else would be able to see it. Harry could, clearly watching the dark zigzag of the soul-shard tumbling around him in a never-ending circle, but Dad was glancing right past it.\n“And you trusted him?”\nHarry shrugged and stood up. “You were going to trust him to marry Diana.”\n“You married him yourself. His actions the other day suggest there’s something fundamentally untrustworthy about him.”\nHarry gnawed his lip to keep from laughing. If only he knew. “I broke the ancient vow with my Arithmancy. He could come back now and marry Diana, but that’s not what he has in mind.”\n“And you? What do you have in mind?”\nDad asked it challengingly, as if he assumed that whatever it was, he would automatically disapprove of it. Maybe he would, at that. Harry shrugged again. “Dispose of this Horcrux and go on living my life the way I want. Develop my Arithmancy and get some of it published. See what people can tell me about it.”\nDad glanced over his shoulder at Mum and Diana—Diana was mumbling something like “a headache that I never knew I had”—and motioned to Harry with his head. Harry followed him out of the room, ready to listen to what he had to say, although he doubted he would be impressed by it.\n“Don’t you think this pretense about your Arithmancy has gone far enough?” Dad asked when he had the sitting room door closed behind them. “You can’t do what you’re saying you could.”\n“Yes, I can.”\n“There wasn’t a Horcrux. You didn’t take it out. You didn’t crack Heller’s Theorem or come up with some new form of Arithmancy. You couldn’t do something like that.”\nHarry looked steadily into his father’s eyes, looking for some kind of understanding, and found—\nFear. Stark, unyielding fear, the kind that Harry hadn’t felt for years. Even his anger that he’d felt a few days ago had been, well, anger. The prospect of being rejected by his family had made him angry, had saddened him, but this wasn’t the kind of terror he was used to experiencing. He hadn’t when he had thought the ancient vow might have bound Riddle to him forever, either.\nHis mum and dad had staked everything on being right about the intelligence of their children, the celebrity of their children, the conditions of their children, and their own decisions. Facing up to the truth Harry was telling them would have been harder than continuing to live with the consequences of those decisions.\nHarry felt an odd satisfaction. It wasn’t a positive understanding, but now he understood them.\n“If that’s what you need to tell yourself,” he said, “that’s what you should tell yourself. But I advise you to start working with Diana on meditation and Occlumency again. She was doing all right with those kinds of techniques before she met Riddle. And he’s sure as hell never coming back to her again.’\nHe turned away before Dad could respond and crossed the entrance hall to the front door, his step oddly light. At least he didn’t have the chains of fear weighing him dow.\n“Harry?”\nHarry glanced up and gave Violet a reserved smile where she stood on the stairs. “Hullo.”\n“Can you talk to me more about Arithmancy and what you did?” Violet’s eyes were fixed on something that seemed to be Harry’s stomach, until he realized that she did act as if she could see the Horcrux-shard rotating around him. “I was studying Heller’s Theorem again today, and I realized that if you had cracked it and thought about the resonances, your theory would work.”\n“Sure,” Harry said, grateful that it didn’t seem if he’d have to sacrifice his relationship with his youngest sister. “But not right now, okay? I have to go talk to Riddle about what we’re going to do next, now that I’ve broken the ancient vow.”\n“Then you can do things like that with it. These shifting equations are good for something after all.” Violet gave him a determined nod and trotted up the stairs again, probably to go back to her equations and work out how that could be done.\nHarry laughed quietly, and exited the house.\n*\n“Thank you for letting me come to you.”\nHarry took a long moment to watch Riddle, who once again was sitting on the other side of the table in his flat above the Magical Menagerie. Riddle was toying with something in his pocket that was probably the Horcruxes. His head was bowed, and he hadn’t met Harry’s eye during the entire five minutes he’d been there.\nIt bothered Harry, made something deep inside him clatter and jangle like a chain.\nHe didn’t want to see Riddle like this. It was ridiculous, given what he had done, who he had been, but Harry didn’t want to see Riddle humbled and broken.\nNeither did he want to change him in the way Riddle had asked for, to mold him like a clay sculpture—\nHarry shuddered, and the Horcrux still circling around him in its trap-ring oriented on him and tried to wriggle into his soul. Harry repelled it with a little more concentration on the figure of the zero, more irritated than anything. Just because it had spent the past sixteen years surviving in Diana’s soul didn’t make him prey for it.\nHarry swallowed and said, “You were right.”\nRiddle looked up slowly, his dark eyes guarded and hollow. “About what?”\n“About how using the equations to change myself into a person that my family could have respected would have been wrong.” Harry swallowed again. “And using equations to change you would be the same thing.”\nRiddle watched him closely. “So this means that you will tell me to leave?”\nHe sounded dead, and Harry winced away from it. Even when he had most hated Riddle, he would never have wanted to see him like this. Passionless, voice filled with ashes.\n“No. I have an alternate plan, if you’ll accept it.” Harry condensed and shifted the trap-ring, and laid the soul-shard that had occupied Diana’s scar on the table between them. Riddle stared at it in silence. “I plan to combine all the Horcruxes back together as one, pulling them out of their objects the way I did this one. And then I plan to stitch your soul back together.”\nRiddle shuddered. He was silent, and Harry couldn’t read the expression on his face, except that the living intensity was back in his eyes.\n“Do you approve of that?” Harry added.\nRiddle looked him right in the eye. “And what would happen to the person I am now?” he asked. “What would happen if I no longer loved you, once I had my whole soul back?”\n“You don’t even know if it’s love now.”\n“I have had time to think about it. This combination of awe and admiration and desire to be close to you and to do something that will benefit someone else more than myself, for the first time in my life…I do not see what else it could be.”\nHarry touched Riddle’s hand, a quick, fleeting touch, and ignored the way that Riddle’s fingers turned upwards as if to close around his. “I think that you’ll be a better person with a whole soul, not a mutilated one.”\n“If you are wrong?”\n“Then I’ll either let you go or do everything I can to stop you, depending on what kind of person you turn out to be.”\n“Genius or madman,” Riddle whispered. He closed his eyes. “And you cannot promise to love me.”\n“I can say that I would be more likely to love someone with a whole soul, even if he’s different, than I am someone who has Horcruxes,” Harry said. “And it would show me that you have changed, that you really don’t plan to go back to the murderous tyrant that Voldemort was trying to become.”\n“You can forgive my sins that easily?”\n“They’re not mine to forgive. I was a kid during the war. I didn’t even get personally hurt—”\n“My older self attacked your sister, and ensured years of abuse and neglect.”\nHarry shook his head a little. “That was my parents’ anxiety about having a celebrity child and then a child like Violet to manage. They spoiled Diana. They could have done something else. But I’ve washed my hands of them so thoroughly that I just feel a little sorry for them.”\nRiddle looked as if he didn’t know whether to smile or be infuriated. “You would. You are that kind of person.”\n“Yes, I am.” Harry studied him. “Will you let me heal you?”\nRiddle spent long moments thinking about it. Harry didn’t rush him. It had to be his decision, in the end. And what Harry was asking him to do was not a mutilation, but still a profound change.\n“I would no longer be immortal.”\nHarry nodded. “I would combine all the Horcruxes back into you. And if you ever tried to create another one, I would have nothing to do with you ever again.”\nHe’d thought earlier this afternoon that that would probably make an effective threat, but then he had scoffed at himself. Riddle wanted immortality more than anything. What was going to keep him from promising right now, and then breaking his promise later, when his fear of death grew strong again?\nBut Harry would at least offer him the chance. Indirectly, Riddle had been the means of freeing him from the fear that consumed his parents, and his stupid desire to please them. He deserved the chance.\nRiddle met his gaze, his eyes like leaping flames. “You are worth it.”\nHarry found himself having to grip the edge of the table so that he didn’t fall. Riddle blinked and stared at him in return, his eyebrows rising a little. “Are you well?”\nHarry licked his lips and didn’t answer, while winds of surprise and other emotions tore through his soul.\nRiddle had chosen him over immortality, when the thing he feared the most was death. Holy shit. Holy shit.\nHarry closed his eyes and calmed himself with the reminder, again, that Riddle could always break the promise he’d made later. But he had to know that Harry was serious about walking away from him if he made another Horcrux. Maybe…maybe it would be enough for him if Harry remained his friend, or gave Riddle the chance to impress him.\nHe opened his eyes, and Riddle had a small smile on his face, as if he knew what Harry had been thinking. He said nothing, however.\n“Do you want to wait?” Harry asked. “Or do you want to do this tonight?”\nRiddle sat up at that. “I had assumed that you would require more time to design the ritual that would restore the Horcruxes to my soul.”\nHarry snorted. “The design’s not that hard part. I just had to come up with seven equations, one to represent you and the others to represent all the Horcruxes that you’d ever made, and means to combine the six equations with the one that represents you for a good outcome…what?” he added defensively, because Riddle was laughing without making a sound.\n“No one else in the world would be able to say that the design is not the hard part when they are talking about a ritual to stitch Horcruxes back into someone’s soul.” Riddle gazed at him with eyes that had gone gentle. “But you, my dear, my darling Harry, have grown so used to breaking the laws of magic that for you it truly is not difficult.”\nHarry flushed at the praise, and met Riddle’s eyes for only a moment before turning his head away. “The hard part is going to be the doing,” he said, and because he fought to hold it in that register, his voice sounded relatively normal. “I thought we’d do it at the ritual circle in the Forest of Dean. If you have no objection?”\n“Why would I? You are obviously comfortable with that circle, and it will make the resulting ritual more powerful.”\n“Yes, but it’s the place where I broke the ancient vow. I thought you might associate it with pain. Bad memories,” Harry added, because Riddle’s face was so blank that he truly didn’t seem to understand what Harry was talking about.\n“How could I ever associate the touch of your magic with something I did not want to feel?”\nHarry rolled his eyes and stood up. “Okay. Bring the Horcruxes. And damn, Riddle. You have it bad.”\n“I think I do. Having never been in love before, I wouldn’t know.”\nHarry flushed again, traitor that his skin was, and Riddle laughed aloud and glided away from him, the silken bag rustling in his pocket. “Shall we Apparate?”\n*\nHarry stood in the middle of his ritual circle, this time with the boundaries built with stones set in stacks of two, and a Lumos Charm beaming from the end of his wand, which he had set upright in the dirt near the boundary. He wouldn’t be using his wand for this. He held the same sharpened stick that had scratched the numbers in the dirt the day he had broken the ancient vow.\nIt was more powerful this way, more symbolic, to achieve the impossible with the tools he had already used to achieve one kind of impossibility.\nRiddle’s quiet, waiting presence near him was almost a distraction, but Harry wouldn’t let it actually become one. That would hurt more than himself, and Harry did actually care about not harming Riddle, now that he had placed his life—his soul—in Harry’s hands.\nWhen Harry was as grounded and centered as he would ever be, he opened his eyes. Riddle stood in the center of the circle, his attention fixed on Harry the way it had been ever since they left the flat.\nThe sensation didn’t disturb Harry now, though. He had passed into full acceptance of Riddle’s devotion. It was the only thing that would allow this ritual to work in the first place, after all, given what he had admitted.\n“Hold still,” Harry whispered, and used the sharpened stick to scratch the first equation into the dirt around Riddle, moving in a small circle, the perfect, enclosed shape, a trap and container of its own, like the still invisible and rotating ring that held the Horcrux shard he had captured from Diana.\nRiddle began to frown after he had scratched the first two numbers, and Harry thought he knew why. He hadn’t drawn plus signs between them, and the two numbers were also the same ones. 7 and 7 and 7, all the way around Riddle’s feet.\nSeven of them, in fact.\nHarry stopped when the sevens were drawn and stood contemplating them a moment. They weren’t perfectly identical, but as much as he could make them given that his drawing tool was a stick and his parchment the dirt. He nodded and placed an equals sign in the gap between each one of the pairs, where they would have had plus signs if this was a regular equation.\nThe resulting hum of power this time was more like a deep, loud gong that rang through the earth. Riddle stared at him in fascination.\nHarry nodded to him. “Give me the bag with the Horcruxes.”\nRiddle handed it over without any hesitation, which Harry barely refrained from swearing at him for. But he turned away from Riddle and dumped the Horcruxes on the ground, and then he had to deal with the reek of the magic rising out of them.\nThe diadem was spinning in place, in fact, and the handles of the cup squirming. The serpentine shape on the front of the locket twisted back and forth. Perhaps they knew that they were only a few minutes away from destruction.\nHarry called upon another zero to create a trap-ring which grabbed the cup under one of its handles and floated it towards the far left corner of the ritual circle, almost to the boundary. Then he crouched beside it and began to draw fours all around it, for the four legs of the badger pictured on it, and the strength and stable foundation of the newborn soul that he would make for Riddle.\nHe drew twelve 4’s, again as nearly as identical as he could make them, and this time, he put the plus signs between them. By the time he got almost to the end of the circle, the power was rearing and snarling around him. Harry thought he could hear more than a trace of a badger’s growl in it.\nHarry sealed the circle with a single 1, pointing like an arrow at the circle of sevens around Riddle. The cup immediately rolled towards the numbers as if to smudge them.\nHarry laughed, and the cup rebounded from the shimmering power of the circle of thirteen.\nGrinning, Harry turned and trapped the locket to send it to its destination next.\nThe locket took its position in the far right side of the circle, “opposite” from the cup as much as it could be, and the serpentine shape made of emeralds began to actually slither off it. Harry shrank the trap-ring around it until the whole thing was rattling futilely in the cage of a zero, and began to draw in the dirt around it again, sevens and the lazy, snaky nines he had meditated on the night before.\nThree of the seven, three of the nine, and the one to seal the circle. This time, the power hissed and danced around him and opposite him, sometimes seeming to answer the call of the locket, and sometimes Harry’s own call.\nIt didn’t matter. Harry was master here, and he was sure of it.\nHe turned to the diadem.\nIt had apparently decided that it wasn’t going to wait to be imprisoned like its brethren. The silver shape of its twisted back on itself, and a shadowy eagle burst out of it, swooping towards Harry with talons extended and a loud shriek tearing from its throat.\nTwo minus one equals one, Harry thought smugly, and one of the eagle’s wings vanished. It careened towards the ground, limited by the shape it had chosen, and Harry ring-trapped the diadem and sent it to the lower right corner of the circle. Then he stalked over to it and began drawing the long, patient circle of twos and threes around it that he needed. Two, for the wings. Three, for wings and the sapphire in the middle of it, and as the second most powerful magical number after seven. Nine threes and nine twos, and then, twined around each other so much they probably looked like a knot, four ones. Separately, they were weak, but together, they could balance each other with the stability that Harry had always thought of four as having.\nThe diadem raged at him from within its circle, but Harry ignored it, and turned to the still-rotating Horcrux he had taken out of Diana.\nHe caught Riddle’s eye on the way, and blushed again at the fascination, the reverence, there. But he wouldn’t deny the spring was back in his step as he moved over to confront the smallest Horcrux.\nIt struck at him the moment he came within range. Harry felt the hooks of it trying to sink into his soul, and laughed himself breathless.\n“Oh no you fucking don’t,” he said, and lofted the trap-circle over to the lower left corner of the circle, opposite the diadem and beneath the cup. The hooks had given him a perfect idea, and he hummed as he crouched and began to braid the strongest circle he could think of around the soul-shard to contain it.\nSeven had to be part of it, because that was the shape he had used to remove the shard from Diana’s scar in the first place, but that didn’t mean he could replicate the circle around Riddle. Otherwise, they would exchange places, and he shuddered to think of what Riddle would be like with this Horcrux in control of his body.\nInstead, Harry chose 17, a number that bore no particular magical significance in most traditions but consisted of the 7 shape he needed and an extra 1 as insurance, and braided the first circle of them around the shard, leaving large gaps between them and putting a plus sign in front of each one. Then he went back and added in a -10 after each one, a shape that took away the 1 but combined it with another 0, another representation of the shard’s trap-ring.\nThis way, when he finished, he didn’t even have to add a separate 1 to it the way he had the first two, which would have a left a weakness in the circle that the shard could have exploited. He stood back when he was done, a circle of seven complete equations, and panted a little, feeling good, nearly drunk on the magic, the blended song that was rising from five circles within the circle.\n“Magnificent,” Riddle said, his voice thick.\n“It’s about to get more so,” Harry said, and winked at him. He walked over to the right side of the circle again, this time midway between the locket and the diadem, and crouched to scratch another equation.\n0+7, he wrote, his mind humming with it, again and again.\nAs he wrote, as he reached out, a ghostly shadow began to shine inside the circle. It solidified and darkened as Harry went on scratching, and by the time Harry had written seven of the equations, the way he needed to, it was so bright, or so dark, that it looked as if it was real. A gold ring, topped with a jagged black stone.\n“Harry…”\nHarry glanced over his shoulder at Riddle, and smiled. “What? Didn’t think I could do it? It was kind of stupid of you to agree, then.”\n“I did not tell you what the ring looked like.” Riddle stared at it as if it was a dream, his right hand wringing silently open and closed at his side. Harry assumed his left hand was probably doing the same thing, but he couldn’t see it from this angle. “How did you…”\n“A zero, the circular shape, for the ring,” Harry said, gentling his voice because Riddle looked utterly overwhelmed. “The sevens to call it here. Once I had the right equations, it couldn’t not respond.”\n“I thought that piece of my soul entirely destroyed when Dumbledore obliterated the ring.” Riddle was still whispering.\n“I promised you a whole soul.” Harry stood up and looked directly at Riddle. “Unlike some people who are currently standing here within a circle of equations, I keep my promises.”\nRiddle’s eyes looked as if they held only darkness, only devotion. “I swear to you that I shall.”\nHarry nodded, and paced over to the left side of the circle, between the cup and Diana’s soul-shard, and knelt to begin inscribing the last circle.\n“Wait,” Riddle said suddenly.\nHarry glanced over his shoulder, and saw Riddle leaning as far forwards as he could without leaving the joined ring of sevens. “What?”\n“You said you needed six circles for the six Horcruxes, and I thought you meant to call the diary. But I am the spirit of the diary Horcrux. What are you going to call when you draw that circle?”\n“Not what,” Harry said quietly, tilting his head while holding Riddle’s gaze, “who. And I think you know.”\nRiddle closed his eyes. Harry nodded, and turned back to lay out the equations in the circle. This was a tiny circle, tightly-woven. It needed to be. Harry would require larger numbers to contain this one.\n24, he wrote, + 24. Twice the number of twelve, his personal number of good luck and stability—twelve doubled, and twice the good luck.\nA cold wind howled past him, and a sound like a maniacal shriek.\nHarry wrote the 1 in the center of the circle this time, pointed inward, not outwards to the circle where Riddle stood. And as he wrote the last equals sign, his hand froze for a moment, pinioned and held in place by a cold, skeletal set of fingers.\nHarry tore his grip away, and the hand crashed to the ground, and an arm formed behind it, and a looming figure formed, white-skinned and black-cloaked and red-eyed.\n“Hello, Voldemort,” Harry said, rising to his feet.\nThe thing in the circle hissed and raged at him, but it was in Parseltongue. At the moment, Harry was glad that he hadn’t given himself the gift to understand it. It would only be a distraction.\nHe walked back over to Riddle’s circle, and saw that Riddle was swaying back and forth. Harry held out a steadying hand that he made sure didn’t cross the boundary of the equations.\n“Are you all right?” he asked quietly.\n“He is dead,” Riddle said. His voice was nearly inaudible; Harry was only sure of what he said because he was close enough to see Riddle’s lips move. “He was obliterated. I know he was. What—how did you draw him back?” He stared at Harry with what looked like true helplessness.\n“I promised you a whole soul,” Harry said, not flinching, although Riddle helpless was more disturbing than Riddle almost prostrate with awe. “And this is my way of providing it.”\n“But how?”\nHarry grinned. “I’m using equations. When you want an equation to add up to something, there’s only one right answer depending on the other numbers you choose. I put down the equations, I chose my numbers, I called what I needed.”\n“You are insane,” Riddle rasped.\n“The irony,” Harry said, and turned his back on Riddle to study the whole of the circle. Yes, everything was ready, and although Voldemort was raging and the three Horcruxes Riddle had brought were rattling in their enclosures and Diana’s shard radiated cold black hatred at him, none of them could escape. Only the ring was still, and Harry thought it was probably raging in its own way, a way he couldn’t sense. It was the least vital thing in the circle. Voldemort had been human—sort of—and he was still a remnant of a living soul, while the ring was, in a way, the soul of an inanimate object.\nHarry bowed his head and spread his hands. The ringing power, the blended, howling songs, abruptly focused on him. Harry nodded, and then folded the last three fingers on his right hand in towards his palm, quickly.\nWith seven fingers, he gestured towards the cup Horcrux, and then tucked his fingers on his left hand down so only four pointed, and then followed by tucking them all away except his extended thumb.\nThe cup Horcrux exploded. Harry felt the soul-shard rising from it, and felt the struggle begin the way it had with the one he had torn from Diana’s scar earlier this afternoon.\nBut this time, he had the ruthless logic of the equations on his side, and he only needed to open his lips, although against tremendous pressure from the magic-charged air, and snarl, “Forty-nine, you fucker.”\nThe circle of fours and the single one he had drawn around the cup ignited, the number 49 appearing in the dirt after the equals sign as if a giant’s hand had drawn them, and a thick dark line of soul streaked across the air towards Riddle.\nHarry turned and saw Riddle flinch, but remain standing, firm in his acceptance of any fate that might come to him.\n\nHe is amazing. \n\nThe black line landed before it could strike Riddle, of course—Harry had had that much faith in his equations—and crossed one of the equals signs Harry had laid between the sevens, obliterating one line and changing it into a plus.\nRiddle gasped, and sagged to his knees. When he looked up, there was a glittering gold tint to his gaze, as if he had swallowed the cup, but a second later, it was gone, He nodded, dazed.\nHarry didn’t ask him what it was like to suddenly have a piece of soul attached to his first one again, because he was curious but they were probably running on a time limit here, and he could always ask later. He spun to face the locket.\nThe locket exploded before he could even point at it. The green snake that rose in the confines of the circle, hissing, was larger and more dangerous than any serpent had ever seen.\nNot that it mattered. Harry had chosen the sevens and nines that surrounded it for a reason. He opened his mouth and sang them, his voice blending with the clattering gongs and howling winds of the circle, chanting the digits.\nHe reached the one at the end, and a circle of green and black adders surged up from the dirt, surrounding the locket-snake and binding it to their will. It fought them, with a fury, but by the time Harry called out “Forty-nine!”, they had won, and another line of black streaked across the circle and made an equals sign into a plus sign.\nThis time, Riddle dropped down in what looked like a dead faint. Harry inspected him narrowly, after making sure that one green snake and one black snake, left behind, had arranged themselves into the shape of a 49 on the ground.\nRiddle struggled slowly back to his knees, and nodded dazedly at Harry. This time, there was a hint of green in his eyes.\nHarry waited until it faded, and then faced the diadem.\nIt fought back with a shimmering nightmare shape as Harry thought of a three and then a two in his mind, and lit them with blazing mental flames that made the shapes all the way around it catch fire, too. Harry found that he couldn’t look directly at it. But that didn’t matter, not when the flames of his making surged up and lit the nightmare shape up with forty-five small and separate small blades of vengeance.\nAnd now, the four ones.\nHarry stomped his foot on the ground, quickly, four times. A 49 blossomed on the earth in front of the diadem’s circle.\nThe diadem screamed like a living eagle, and then reluctantly transformed and bent, a winged line that whipped another equals sign into a plus, and dropped Riddle like a stone.\nThis time, he lay there for long enough that Harry was afraid he had fainted and they might have to start the whole ritual all over again. But then Riddle slowly pushed his hands against the earth and raised himself up, and Harry saw the shining blue shifting in his eyes, the last remnants of the diadem’s sapphire.\n“Harry,” Riddle whispered, his voice thick and dreaming.\nHarry had already spun to face the soul-shard taken from Diana, though. It flickered sullenly at him, but did nothing as Harry muttered of seventeens and tens under his breath. It probably thought it would cross the circle of equations and then attack Harry, or Riddle, when it got close enough.\nSure enough, it swam into the air, a deceptively docile black line, leaving a sharp clear 49 on the dirt behind it, and crossed the distance to Riddle much more slowly than the other Horcruxes had. But Harry was watching for the little hook that it extended towards him, still trying to latch on to his soul.\nHarry laughed.\nThe hook recoiled from him, chased by his laughter, which Harry knew would have been anathema to Riddle as he had once been and was anathema to Diana, who hated to be laughed at. The power of the circle of sevens around Riddle sucked it in, and it became part of the equation.\nThis time, Riddle only swayed on his feet, maybe because the shard had been smaller than the rest. Or maybe because he had been in contact with it before this, when it was occupying Diana and he had been romancing her. Who knew? The red tint in his eyes might have been the shade of Diana’s hair, but maybe not.\nHarry smiled widely as he turned to face the ghost of the ring, and crouched on the ground with his hands raised in front of him, fingers touching, forming an empty circle.\nHe alternated that quietly with flickering seven fingers, and when he reached 49, the ring rolled across the line of the equations, and the 49 occupied the circle behind it, and the ring went on rolling until it reached the circle around Riddle and added itself to an equals sign. Harry shivered at the violent cold it dragged behind it, and turned to see what the effect was on Riddle.\nHis eyes had darkened to black, the color of the stone on the ring, but he was coping better than Harry would have expected, only feeling at the air for a moment as if he was trapped inside a cage. Then he nodded, and Harry knew he was ready.\nThey were both ready, for their toughest challenge.\nHarry faced Voldemort, and ignored the sight of that open mouth cursing him in a language that he couldn’t understand. He closed his eyes and began to draw forth memories instead.\nHimself, on a broom, diving after the Snitch. Violet learning how to walk. Neville laughing over a bubotuber that had sprayed both of them with its pus. Remus ruffling Sirius’s hair…\nHarry drew them forth, and drew them forth, until he had thought of forty-eight memories of joy and love and amusement and cheer, and when he looked, they surrounded Voldemort’s circle in a shining wall. Harry could barely see him behind those seething red and golden bricks of light.\nNow came the part of the challenge that would be toughest for him.\nHarry turned to face Riddle. Riddle had been looking at the bricks of memories with a dazed expression, but he focused on Harry at once.\nAnd Harry looked into his eyes, the eyes that had been smug when he made the ancient vow and dazed when Harry broke it and reverent so many times this evening, and thought, If this works, it might be that I could love him.\nThe positive memories of Riddle himself sketched a 49 in the air as dark fire. It settled like a dome on top of the brick wall, and then the memories whirled inwards and collapsed and tightened.\nThe sound of Voldemort’s voice fell silent at last. And then he surged into the air, a dark spirit, a wrathful one, but as much a part of the equations as all the rest, and swept past Harry and added himself to the last equals sign, making it a plus.\nRiddle’s eyes turned white, the color of Voldemort’s skin, and then rolled back in his head as he fell.\nHarry stepped lightly and quickly over to stand outside the circle of sevens, and used his foot to rub the last equals sign in the dirt, adding all the sevens and pointing to him, the source of the equations’ power.\nIn the middle of that humming, singing exuberance, Harry extended his hands and said gently, “Forty-nine.”\nThe words fell on the circle, and white light lifted silently into being around Harry.\nIt seemed to him that he was broken, drifting apart, in forty-nine pieces of his own, and every part of him fractured and split further and further, seven and seven and seven and seven and seven and seven and seven, ranging and bound, joyous and tragic, accepting and resisting, in love and in hate, soaring and grounded, Gryffindor and Slytherin, Harry and—\nRiddle.\nHarry opened his eyes, at last, and saw Riddle rising to his feet in the middle of what now looked like a little ridged circle of dirt. That was all right. The equation was drained, its power consumed, and what it had been put there for was done.\nTom Riddle stood there, and his eyes were his own. But his face was more lit with radiance than Harry had ever seen it before. Now he looked like a man who could be honest, and keep his promises.\nAnd, maybe, feel love.\n“Harry,” Tom whispered.\nHarry held out his hand.\nTom crossed the circle to him, with jagged strides, and clasped him and kissed him. Harry returned the kiss with curiosity, interest, wariness, joy, amusement, gentleness, and smugness.\nTom drew back at last, his eyes darting over Harry’s face. “You will accept me?”\n“You have a chance,” Harry corrected him, his breath fanning out gently over Tom’s lips. “I can’t promise that I’ll accept you at the end, or stay with you forever if you do something I don’t like. But you have the chance.”\n“It’s more than I had before.” Tom bowed his head a little. “Thank you.”\nHarry smiled and said, “Tom,” and watched Tom’s head jerk up and his eyes fill with wild joy.\n“Thank you.”\nTom held his hands, and said nothing. He probably knew what Harry was saying thank you for, or thought he knew. For freeing him from his obsession with gaining his family’s approval, or giving him the chance to exercise his power.\nBut, in truth, it was also for the praise and the possible love that Harry could have from Tom, and teaching him that doing the impossible was something he could take pride in.\nHarry glanced at his still-lit wand, and thought, Two becomes one, and watched the stones piled two deep fall, breaking the boundary of the circle and framing their way out of it.\nAnd, perhaps, their path to the future, which could be predicted by no equation.\nThe End."
}