{
    "id": "27665101",
    "url": "https://archiveofourown.org/works/27665101?view_full_work=true",
    "author": [
        "jihnari"
    ],
    "title": "Q. A. B.",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Haimawari Kouichi & Midoriya Izuku",
        "Midoriya Izuku & Takami Keigo | Hawks",
        "Kaminari Denki & Todoroki Shouto",
        "Dabi & Takami Keigo | Hawks",
        "Kaminari Denki/Toga Himiko",
        "Haimawari Kouichi & Haneyama Kazuho | Pop Step"
    ],
    "characters": [
        "Midoriya Izuku",
        "Haimawari Kouichi",
        "Takami Keigo | Hawks",
        "Dabi (My Hero Academia)",
        "Kaminari Denki",
        "Todoroki Shouto"
    ],
    "additional_tags": [
        "Large Cast",
        "media fic",
        "Social Media",
        "Twitter",
        "Chatting & Messaging",
        "Quirkless Midoriya Izuku",
        "Midoriya Izuku Does Not Go to U.A. High School",
        "Vigilante Midoriya Izuku",
        "Cult Leader Midoriya Izuku",
        "this is all (mostly) accidental",
        "Crack",
        "Crack Taken Seriously",
        "Like",
        "extremely seriously",
        "Stalking",
        "Social Reform",
        "Minor Character Death(s)",
        "Quirk Discrimination (My Hero Academia)",
        "HTML Tryhard"
    ],
    "language": "English",
    "series": "Part 1 of how to (accidentally) start a cult",
    "published": "2020-11-22",
    "completed": "2021-03-08",
    "words": "21,050",
    "chapters": "10/10",
    "comments": "1,952",
    "kudos": "22,883",
    "bookmarks": "4,809",
    "hits": "268,071",
    "summary": "<p>One month after @hawks_unofficial's initial viral post, the blog titled \"Quirk Analysis Blog for the Future\", otherwise known as \"Q. A. B.\", has gone from an average of 10 views per post to an average of 20,000 views per post.</p>\n<p>Midoriya Izuku does not know how to view the impressions analysis for his suddenly popular blog, and only notices that sometimes, people actually comment on his posts now. He does not google himself or his moniker and thus does not see the rise in online articles and speculation.</p>\n<p>He is unaware that the \"kyuu-ei-bee\" he begins to hear about in passing refers to his own blog. He does not have a Twitter account.</p>\n<p>At the time, Midoriya Izuku is 15 years old.<br></p>\n<p>Izuku (accidentally) starts a cult.</p>",
    "notes": "<p><strong>this fic uses custom skins.</strong> you may need to click the <strong>Show Creator's Style</strong> button at the top of the web page to view it as intended. ngl it looks hella ugly if you don't.</p>\n<p>this work formatted to look nice specifically on a largish android phone (ie, my phone), using the default ao3 settings (ie, white bg). it should be okay-ish on other platforms but like. ios does some <em>weird stuff</em>, and on desktop i just think some of the effect will be spoiled; but ymmv.</p>\n<p>have fun &lt;3</p>\n<p>(EDIT: im leaving the original author's notes as a testament to how i, too, was once human.)<br>(EDIT2: [11/9/23] re-coded the entire fic with the QAB2 skin. probably because im insane. also fixed some typos and added some new sections. probably introducing more typos. let me know if you see any!)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>name of the file this fic lives in is \"THIS IS NOT A CULT, GO HOME, midoriya screams into the abyss, convincing no one\", just thought u should know<br>i am... incredibly sorry for the incoming wall of text.<br> <br><b>technical notes/taken liberties: </b><br>- the intelligent members of the fandom commonly agree that bnha does NOT take place in the year 20XX, and mathematically, likely takes place in 22XX or 23XX. HOWEVER; the anime makes several references to 20XX, so uh that's what i went with. also the anime makes references to \"yahoo news\" (and no way yahoo is gonna be around that long) so i feel justified in just saying bnha is set in a parallel modern day universe. therein also lies my justification of the abuse of modern day social media sites.<br>- the reason i used 20X4 is bc bnha released in 2014 and im afraid i may need to increase the year counter at some point. (the first draft just used 20XX, but that was before things got ~out of hand~.)<br>- \"shuttai\" is an alternate reading of the kanji used for \"izuku\" (well... sort of. don't think about it too hard)<br>- ive decided to include japanese honorifics for. reasons? (i think i had a real reason at one point but i cant remember now so im just going to trust past!me on this one.)<br>- - i have spent several hours watching random bnha clips youtube and hulu in the original japanese to figure out what everyone uses for honorifics bc they sure do localize bnha, dont they :/ i had to guess on a few.<br>- in japanese, when you're talking to (or about) someone on the internet, you generally use '-san'. im going to be taking a looot of liberties here and mixing and matching the way engish speakers and japanese speakers talk to each other online, partially for convenience, partially for flow. (you probably wont notice, but ive lost sleep over it.)<br>- we're using military time bc thats the staple in japan.<br>- after mirio comes to terms with midoriya's blog post, he changes his online handle(s) to \"pacman\". i have yet to smuggle this in anywhere and am incredibly sad.</p>\n<p><b>warnings:</b><br>- i have NOT figured out the theoretical days of the week for this theoretical year bc my brand of crazy only takes me so far.<br>- im pulling from the bnha:illegals crew. just know they exist i guess? (koichi, kazuho, and iwao.)<br>- i have several ideas for how this fic will go, but rn im only promising you \"part 1\". part 1 will be standalone. part 1 is complete sans editing and sans a metric buttload of html.<br>- i do not know html. i've spent the last two weekends learning (/suffering) and being forced to create my own workskins bc ao3 hates spaces.<br>- i played around with a lot of different types of formatting before settling on what i hope comes across as \"minimalistic but still recognizable and nice to look at\". if i did not succeed, i only want to know if it's a small, fixable thing; otherwise, i prefer to live in semi-satisfied ignorance. thank you for your understanding and cooperation.<br>- i am still not happy with the spacing between lines during texting rants but i am also very, very tired. i might circle back.<br>- i am still not happy with how i've got sort-of-but-not-really right-aligned text working, but this is likely NOT changing bc ive spent the last 8h just getting it to this point.<br>- i have not quite decided how to handle transitions and am liable to change it. suggestions welcome, i guess?</p>\n<p><b>final notes:</b><br>- if you notice any weird errors (particularly in the html) please, please let me know!<br>- google now thinks im a robot and i have to keep clicking the 'im not a robot' captcha. apparently googling html terms is suspicious??<br>- ive never had to make such a detailed timeline in my life and i dont care for it at all and now that we're live im just praying i dont have to go back and change the timeline and all the date/timestamps AGAIN<br>- ao3, why u no support flexbox :(</p>\n<p> </p>\n<p>(<b>update:</b> <a href=\"https://archiveofourown.org/users/PoppinBoppin\" rel=\"nofollow\">PoppinBoppin</a> made a <a href=\"https://sites.google.com/view/quirkanalysisblog/\" rel=\"nofollow\">website</a> like a total madlad, just thought y'all should know (does contain spoilers tho! if you're new to the series and care about that.))</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p><strong>tl;dr authors notes: </strong><br>- uh, dont worry about the stuff kouichi did? its legit and makes midoriya much harder to find/track<br>- fun fact, yap!news is bnha canon<br>- haha yeah so how about that stain guy<br><strong>gratuitously unnecessary authors notes: </strong><br>- blockquotes are so cute?? like omg time to update all my summaries bc ~ b l o c k q u o t e s ~<br>- layering blockquotes is :( not allowed :(<br>- thusly, (multiple) vertical lines are hell<br>- i invented a college for kouichi. i thought about it long and hard and felt very clever. i thought it was important that u know i suffered over a fake email address that shows up exactly once and may never be used again. am i stupid.<br>- i forged a whois report. i forged. an entire whois report. why did i do that. why am i like this.<br>- i need you to believe me the whois report is incredibly accurate.<br>- i also need you to know that it's actually like three times as long and was in the original draft and on some readthrough a while back i was all, \"wait, w. why did you include this entire thing.\" and the answer was \"because i doctored the entire thing and it was hard\" but that wasnt enough reason to make the final cut.<br>- so one time i ordered this sketchy thing from a kickstarter and it never showed up. no tracking number, no emails. i emailed the help email but a week went by with no response. i called the listed help number but it was an automated voice with no actual help to offer. so i ran whois against the website for the inventor guy and snagged his phone number and called him up, all \"hey uh, sorry to bother you but can you help me get my thing, i dont think it shipped\" and he was all *\"who is this, how did you get this number\"*. it was his personal cell. he did help me out tho.<br>- moral of this story is *BE CAREFUL WHEN YOU SET UP A WEBSITE*.<br>- yap!news is used in actual bnha but i cant find it on the wiki/reddit/anywhere? i promise its a thing, i was watching the anime and remember laughing at it and writing it down. it's obviously a play on yahoo!news, which i might not have realized except that it's the End All Be All news source for like. japan. i dont make the rules and am just as confused as you are.<br>- at one point during the html testing process, i angered the html gods and had to take a very long break: https://imgur.com/a/cFonEc3<br>- i think im almost done with examples for every kind of media i include in season 1. this is very exciting bc i can maybe stop dying in html every weekend and get back to actual writing.<br>- on the other hand, im not sure if ao3 will let me put three vertical lines next to each other, and idk how nesting divs works? so im currently living in the happy world of not knowing and thinking, logically, it'll be fine. but having spent so much time with ao3 trying to \"help me out\" and html being the worst thing ever invented, i think im going to be spending a lot of time crying in the near future.<br>- (sorry html i didnt mean it i love u)<br>- but like at that point do i alter the actual text/story vs letting the formatting suffer? how am i suppose to make that choice because i KNOW i'll choose the formatting and i also know that's very much not what i should do.<br>- re: vertical lines are HELL<br>- ch3 is a lil more exciting, but ch 4 is where it's AT (as in, where hawks is at bc he shows up again briefly and i just love him okay)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p><b>so anyway:</b><br>- first and foremost, you CAN nest vertical lines, it just makes you want to tear your hair and eyeballs out<br>- but DID YOU SEE? NESTED VERTICAL LINES. BOOYAH.<br>- chapter count has been upped bc i split a chapter in half.<br>- it'll likely go up again bc 1, im bad at math and 2, 10 is a better number than 9.<br>- 'suiran' is a reference to 'arashi', a (Very) popular jpop boys band. they use the same kanji, bc i like to make dumb obscure kanji jokes. (翠嵐 - suiran; 嵐 - arashi)<br>- i dont think ive ever heard an arashi song so idk if they're any good?<br>- kouichi doesnt know what/who suiran is, but he knows it would make Kazuho mad if she found out. im hoping to smuggle that in at some point, but if i dont manage it, at least now you know.<br>- thanks to Mayhap_Mishap for the libel/slander fix<br>- i had to rewrite the timeline again and it ate my whole weekend :( but i shouldnt have to do it again for arc1. (im trying not to think about arc2.)<br>- i made some formatting edits to previous chapters and will likely do so again but im tired rn<br>- \"no one will notice\" i say out loud; \"you cannot unknow your own sins\" my brain whispers<br>- i have come to the realization that this is the most ambitious writing project ive ever attempted and have started to sweat.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p><b>ch4 notes:</b><br>- semi-major, not at all important, retroactively updated formatting in previous chapters. i keep figuring out how to do things i'd given up on.<br>- (updates are mostly ch1 and a little of ch3. i was too tired for ch2, maybe later.)<br>- i was split between \"chi-chan\" and \"hime-chan\" (chi being blood and hime being princess) so lemme know if you've got a preference. they're both dumb enough to be funny to me<br>- i turned on discord light to check how things were formatted against a white background and i still feel unsettled from looking at it<br>- have i finally gone too far with the colored background squares?? i thought about not putting them in but. they're so pretty.<br>- i was gonna have some people use actual text/sms in this chapter, but i couldnt in good faith do it. no one uses sms in japan, it's all line all the time. (and some messenger, but ugh no thanks)<br>- \"ku\" means. uh. ward? it's like an area of a prefecture.<br>- (you can skip this next part if you dont care about physical location details)<br>- japan's split up weird, but lets talk about tokyo.<br>-- tokyo is a prefecture. tokyo is split into 23 \"wards\".<br>-- in japanese, 'ward' is 'ku'. so harajuku is in 'shinjuku-ku'. i am physically incapable of using the word ward, it confuses me. when i was hearing kamino spoilers through the grapevine and everyone kept saying 'kamino ward' i was 100% sure the kamino arc took place in a hospital.<br>-- basically, if you see \"-ku\", it's an area in tokyo.<br>- osaka is way south west of tokyo<br>- UA (and midoriya) are in shizuoka (south of Tokyo) but i feel like the majority of crimes would happen in tokyo. (lots of hero agencies seem to be in tokyo, including best jeanist and all might's agencies.) so uh. QAB messes around in tokyo a lot, dont worry about it<br>- this fic is starting to feel like 'today i learned html could do X, and then tried to make it do my bidding. come, listen to the agonized screaming of my soul' but if y'all r still here, then ¯\\_(ツ)_/¯</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p><b>n o t e s :</b><br>- i didnt mean to write an interlude, it just happened. i was looking at ~1k of consecutive, todoroki-centric content, and screamed at myself \"WHAT THE HELL IS THIS.\" my brain screamed back, \"AN INTERLUDE, IDK, JUST RUN WITH IT\"<br>- increased ch count to 10 just like i threatened. im actually p pleased bc 10 is such a good number.<br>- next chapter: get ready for a useless info dump on japanese ssns and the borderline irresponsible mixing of japanese and american ssn history/lore, id be more excited if i hadnt made it so much work for myself, why did i do this</p>\n<p><b>c o m p l a i n t s : </b><br>- i crafted a whole second discord layout bc i figured kouichi would be using the desktop version of discord during this chapter, but i couldn't get it to look okay on both desktop and mobile versions of ao3 so a scrapped it and i am just super sad okay, i really wanted to use that format<br>- there's a known issue wherein on some devices (ie, only one device that i know of and it isn't mine), right aligned text appears inexplicably smaller than all other text. im hoping this is an extremely isolated incident bc i dont think there's anything i can do about it, i tried really hard, i promise :(<br>- (this has been a known issue from the start but i only recently took a serious stab at trying to fix it so idr if i mentioned it before or not.)</p>\n<p><b>from this point on im just going to complain about html gratuitously, u can leave if u want. this is the abbreviated version, can u believe: </b><br>- i didnt want to bore you with too many of the details but BOY OH BOY WAS THERE SUFFERING IN THIS HOUSE<br>- the problem is, its not even anything that matters. ive just been trying for the last two weeks (not like, straight, but there were a few all-nighters) to get things to like, fade out? bc i. i needed it. i learned it existed and was all \"yeah we need that right now immediately\"<br>- lowkey i think my brain just wants to make ch1 the most beautiful mock-up known to man, who knows<br>- btw uh. i updated the formatting on ch1 again.<br>- so anyway i did it after much blood and tears and screaming and y'all are lucky my computer was out of commission this week (y'all being the operative term for \"you unfortunate saps on apple devices\"). this is because if it hadn't been, i never would have in a thousand years touched safari and found out transparent doesnt work the same<br>- whys this you ask? BECAUSE APPLE HATES CONFORMING AND LIKES TO MAKE UP DUMB ARBITRARY RULES TO MAKE THE REST OF US SUFFER is all i can come up with<br>- had to hit up my art degree sister and be all \"what is rgba\" and she was all \"what do u mean u dont know what rgba is, how is this possible, have u never used an art program\" and im still a little iffy on the 'a'<br>- anyway imma add a fade out thing to the next chapter (that was the whole point of this madness) and probably add it in to previous chapters where it makes sense to do so (ie. basically everywhere i can shove it bc i spent literal days of my life figuring out how to 1, do the thing, 2, do the thing on apple products)<br>- screw you, apple. &gt;:(</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">notes</a>.)\n</p>\n<p>[1] <a name=\"note1\" rel=\"nofollow\" id=\"note1\"></a>\"My Number\" is japan's version of citizen identification. (so like SSN for america or SIN in canada.) it is also known as \"Kojin Bangou\", which is what i've used here bc \"my number\" is <s>a terrible name</s> confusing to english speakers. (<a href=\"#return1\" title=\"return to reddit post\" rel=\"nofollow\">click to go back</a>)</p>\n<p>[2]<a name=\"note2\" rel=\"nofollow\" id=\"note2\"></a> 110 and 119 are japans emergency services numbers, like america's 911; that was not a typo. (110 is for police/crime, 119 is for other emergencies (as i understand it)) (<a href=\"#return2\" title=\"return to discord chat\" rel=\"nofollow\">click to go back</a>)</p>\n<p> </p>\n<p><b>retroactive updates/formatting blah:</b><br>- YEAH HI GUESS WHAT SOMEONE ONLY JUST NOW TOLD ME IVE BEEN GETTING KOICHI'S HERO/SCREEN NAME WRONG HALF THE TIME<br>- idk why but my brain thinks his name is charger when it is <em>absolutely crawler</em> and has been this whole time<br>- so @the person who finally told me, thanks!! but <em>how could i have let this happen</em><br>-- previous chapters have been fixed, future chapters not so much. i will do my best.<br>- i was messing w the spacing between dms, now that i finally figued out how to do it, but ao3 just. refuses. i use the exact same code in two places and the space. is different. i dont feel like screaming any more tonight, so im just gonna. come back later.<br>- added minute changes to previous chapters not worth specifing but i feel like there were lots and i just stopped paying attention<br>- the reddit 'see more' button was a step too far, i keep trying to click on it and <em>i wrote it</em></p>\n<p><b>that reddit post: </b><br>- HOO BOY HOW ABOUT THAT NONSENSE I JUST SPOUTED ABOUT KOUJIN BANGOU AND QUIRKLESS POLITICS, HUH.<br>- (i am mixing the way the american SSN and japanese \"My Number\"/Koujin Bangou functions bc this is the ~future~ and japan seems to take a lot of cues on how to do things based on western society.)<br>- the irl issue im drawing from is american SSNs and the fact that, when banks check to see if they can give you a loan but your birthday is past a certian date, they just dont even validate your identity bc it would cost them money.<br>- get this: SSNs are insecure. gov makes them more complicated/secure, and in doing so, harder to access. (which is the whole point.) but this means that it takes longer to get results and it's a more complicated process and requires more overhead (ie, they have to pay more people to handle this process.) banks/loan officers/etc say, wait, its gonna take how long? you're gonna *charge us*? ...nah, we don't need it, it's fine. #yolo<br>- this is a REAL THING that i am likely misremembering details of and couldnt find references for; dont worry about it (i tell myself, while worrying about it). this is fiction, yo.</p>\n<p><b>misc:</b><br>- people are legit referring to me as 'format god' for some reason and i think this is hilarous and am half convinced i should put it on a business card<br>- HEY I REMEMBERED WHY I GAVE KOICHI A WHOLE EMAIL ADDRESS it's bc i reused his fake university in this chapter. (when did i do that?? good job, past me)<br>- i couldn't tell you why but this is my favorite chapter<br>-- okay i lied, i know why, it's hawks</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">notes</a>.)\n</p>\n<p>my rough draft notes had \"[ending chapter here would build TENSION]\" and who was i to disagree</p>\n<p><b>pre-finished chapter7:</b><br>- me, posting chapter 1: i think its pretty good! i think i did a good job! i will give this level of effort and i will go no further and i will be satisfied<br>- me, 7 rewrites of ch1 later: maybe i should just do it, maybe i should just make text boxes for twitter and signal and sms and line and they will all be different and you will have to rewrite every single chapter but maybe it's worth it</p>\n<p><b>post-finished chapter7:</b><br>- yeah<br>- yeah that<br>- sure was some stuff i learned how to do this week<br>- remember when i was worried if i was taking things too far? this is it. this is what too far looks like. we've arrived.<br>- still retroactive fixing of chapters going on, ch2 is lookin pretty swanky<br>- i have not fixed ch1 to look like this chapter, i am tired, let me rest<br>- i found out today that a majority of my html problems are self-inflicted and im a little mad about it. like, its not surprising, we started this journey with 10k of chat-fic, a poorly thought out plan, and our best friend google; but im still mad<br>- sib called me sexy over the html coding of this chapter ;) which i think is grossly inaccurate and a misuse of the phrase, but ;)</p>\n<p>this is NOT a chapter announcing a hiatus of this series. W H O O P S.<br>named this chapter literally months ago and didn't even think about it, sorry for the heart attacks</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_8_endnotes\">more notes</a>.)\n</p>\n<p><b>wow ch8:</b><br>- i wanted to get this one out (bc cliffhanger) but i need to rewrite ch9 again so it might be a few weeks before you see me again.<br>- i stole from r/anxiety and do i regret it? no.<br>- i. gave cccredit? does it count as credit if i just stole their usernames too<br>- i rewrote that entire first section bc i realized we never learn the name of hawks' agency and i didnt wanna make one up. that is a real thing that i did.<br>- if html were a class, this chapter would be my final<br>- it has... all the things. i can showcase everything ive learned using this one chapter. its. a little ridiculous.<br>- but look at how pretty! :D<br>- reddit remains my least favorite thing to format, but that's ao3s fault for the way it handles newlines. i dont want to talk about it. just know ao3 has done me wrong *yet again*.<br>- and on that note ao3, why? would you accept a display: grid?? and then??? not display: grid???? for real tho, what is WRONG with you, i honestly want to know. i spent hours formatting that box thing at the top of the chapter, got it just right, and then ao3 said, 'lol, oh u thought?'<br>- so yes. i took a picture of it. and threw it in there as an image. yes i did.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_9_endnotes\">notes</a>.)\n</p>\n<p><b>and now, notes: </b><br>- this chapter was really tricky to write but i think i pulled it off? i think i like the end result.<br>- boy i hope the phone/homescreen/time sections don't look terrible on y'all's devices, boy would that suck after all that work<br>- html floats are LEGITIMENTLY black magic and i do not understand whats going on there or what secret properties they hold only that sometimes, if u throw a float on a thing, it breaks, and OTHER times, you throw a float on it, and it FIXES the thing, and there is no logic in this world.<br>- \"when in doubt, clear the buffer\" is my new mantra<br>- tbh it was always my mantra but i. forgot about it. there was a lot of suffering today bc i forgot my own mantra.<br>- i thought itd be fun to check how big my workskin file is, and the answer is: <strike>1540</strike> 1674 words.<br>- (i had to write ~100 lines of css to fix some weird issues this chapter)<br>- the spacing between centered boxes is still tragic and i dont like thinking about it. maybe next time.<br>- just in case anyone is unaware, the html basically doubles the word count on every chapter and this chapter is fRICKIN LONG<br>- i canNOT get timestamps to align to the bottom of the line message bubbles. i thought of one potential way but it would require rewriting a buuuunch of css code not to mention the html of almost every chapter, and thats assuming it even works like i want it to. so. i'll keep thinking about it, i guess.<br>- haha tried it, failed it, then remembered even if i managed it, ao3 doesnt respect tables, so. guess they get to be top aligned.<br>- dabi's new name in hawks' phone is a fnaf reference, my beta tells me it's funny<br>- i use the term 'beta' lightly as my beta refused to read this chapter because, and i quote, \"but i want to be surprised :( i want to Experience it Organically\"<br>- 😒</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_10_endnotes\">notes</a>.)\n</p>\n<p><strong>update:</strong><br>thanks so much for all your comments and encouragement!! i was trying to get around to answering every comment for a while and then got behind and then got overwhelmed, but i do read and appreciate all of them!! &lt;333<br>(every so often i go back and add more working links, if anyone cares to play through the shortest ARG in the world. )</p>\n<p> </p>\n<p><strong>FINAL NOTES :'( </strong><br>- the reception to QAB has been amazing, thanks so much for reading/commenting/encouraging/commiserating and coming on this crazy ride with me!!<br>- idk rn if i'll write a sequel. i have some stuff plotted out, but even if i had time to work on it, it'd be several months before i'd be able to post the first chapter<br>- and i dont have time, bc hawks brainrot is real. warn your friends. its already too late for me.<br>- microwave and egg convo based loosely on real life where i told this guy i kept thinking about breaking into this empty condo to turn off the light someone had left on. he said \"that's... nice of you?\" but then i followed up with, \"and it think about in equal measure breaking in to microwave an egg, just to watch it happen irl and not have to clean it up.\"<br>- today i found out you can style a blockquote?? you can STYLE a BLOCKQUOTE<br>- i have had my workskins in an open tab since literally the beginning of QAB and i'll... finally be able to close it?? w i l d<br>- denki and himiko are ABSOLUTELY DATING(or about to) and i never had the chance to do it justice :(( they haven't met in person yet, they just chat on discord and line and send each other a lot of memes, this relationship is not a joke to me (...even if that's how it started out. pls, they'd be so cute together)<br>- if you have any thoughts/conjectures/predictions for a potential act 2, i'd love to hear them!! <strike>and steal them</strike> (if i do write a sequel i dont want to forget anything.)</p>\n<p> </p>\n<p>thanks so much, everybody ♡</p>",
    "text": "\n\n\n \n \n \n \n\nTweety Bird @hawks_unofficial\n\n@SirNightEye lolol get a load of this guy quirkanalysisblog.com/posts/versatil···\n\nis he wrong tho\n\n07:21 · 3 June · Twitter for iPhone\n\n509k Retweets and comments 1.1M Likes\n\n \n \n \n \n \n \n \n \n \n \nVersatility VS Strength\n by Shuttai on June 2, 20X4 - 3 Comments \n\nWas anyone else watching the late-night interview with the interns from Nighteye's agency because can you even BELIEVE that Lemillion guy??\n\n\"My quirk isn't strong, I am!\", bull S#!T.\n\nYou think you'd get as far as you have if you had a mutation quirk that changed the color of your fingernails?? NO. YOU FREAKING WOULDN'T HAVE. GOD. I hope no impressionable children were watching your interview, because that sort of mindset is contagious and DAMAGING AF.\n\nAs you can likely already tell, this post will be a departure from my usual format. We will be discussing the difference between \"versatility\" and \"strength\" and why they're the SAME FREAKING THING.\n\n(IF I EVER SEE YOU IRL: LEMILLION, I WILL PUNCH YOU IN YOUR GOSH DARNED PERFECT PACMAN FACE.)\n\n[...]\n\n \n \n \n \nSir Nighteye  \n\n\nHawks, I must ask to speak with you concerning the blog post you shared publicly this afternoon. Please call my office at your earliest convenience.\n\n\nYesterday, 20:08\n\n\nAlternatively, if you could be bothered to answer your phone, that would serve my purposes just as well. Thank you.\n\n\nYesterday, 22:09\n\n\n2 unread messages\n\nidk who u thnk i am but this isnt hawks\n\n\n2:43\n ✓ \nHawks, please. You and I both know that it is.\n\n\n2:48\n\nwho is ths \"hawks\" person nvr heard of them\n\nalso y nt jst rply publicly dude do u nt kno how the internt works\n\n2:50\n ✓ \nI am painfully aware of how data transfer and storage works on services owned by third-parties, so while I would very much appreciate you answering your phone, if I have no other choice then at least I do not wish to have this conversation in a public setting.\n\n2:51\n\ndont get out much do u\n\nuuuggghhh how r u STILL typng i dont wanna read ur essay\n\n2:53\n ✓ \nI don't think you understand the potential gravity of this kind of publicly facing information. The blog post in question publicly disclosed concerningly viable ways of bypassing the quirk belonging to my intern, Lemillion, to accomplish the goal of \"punching him in the face\". It was phased lightly as if a joke, but the methods are quite possibly sound. I will require more investigation to know for sure.\n\nThough the content contained on this blog would appear to the untrained eye to be harmless speculation, in the hands someone who would wish harm upon a given hero, these speculations could be weaponized.\n\nIt is possible the author of these posts realizes the potential ramifications of his actions. However, without further proof as to the author's intent, I have no grounds with which to pursue his identity or to enforce that he remove the article on Lemillion. So I ask again;\n\n2:57\n\nwhat makes u thnk i kno anythg i just thought it was funny\n\n2:58\n ✓ \nYou tweeted a direct link to the post not three hours after it was posted. From the average fan base of the site BEFORE 24 hours ago, you were one among the tens of people following this person's blog before you caused them to \"go viral\", as they say.\n\n2:58\n\nas who say \"the kids\"?? \"as the kids say\"??\n\n2:58\n ✓ \nHawks, please.\n\n2:59\n\nno nighteye YOU please. pls i need ths im dyng\n\n2:59\n ✓ \nAre you willing and able to assist me in tracking down the owner of this blog? It would appear that there were several posts of a more personal nature that were available to the public previous to this incident. I have only been able to retrieve but a handful.\n\n3:00\n\nno &amp;no\n\n3:00\n ✓ \nVery well, then. I'll be taking this up with the hero commission.\n\n3:03\n\n\nwhat\n\n\ny wud u do that\n\n\nwhat wud that do\n\n\ni mean haha whos that\n\n\ny wud i care\n\n3:04\n ✓ \n\nThe hero commission should be alerted about any hero obstructing a case for their own benefit.\n\n3:04\n\n\ngood thing im nt a hero then?\n\n3:06\n ✓ \n\nWell then. It sounds as though you have made your decision and I have no choice on the matter.\n\n3:06\n\nbro y u do me liek ths\n\nim nt evn hawks\n\nthis is y no 1 wants to partnr w ur agncy bro\n\n3:10\n ✓ \n\n \n \n \n \n\ncrawler @TheRealCrawler\n\ni like how the first quirkanalysisblog.com post is unironically done on all might. all might fanboys unite!!\n\n15:22 · 4 June · Twitter for PC\n\n3 Retweets and comments 15 Likes\n\nThe Idol Hero @PoppingStarStep  · 1d \nReplying to @TheRealCrawler\nLol. Nerd.\n\n\n\ncrawler @TheRealCrawler  · 1d \nyou can't be a nerd for liking all might, it's a fundamental trait that all humans share\n\n\n\n \n \n \n \n # troll-debate\n\n100+ new message since June 5, 20X4 \nHawks simping 101 Today at 12:24\nI agree with evie\n\ndylusional Today at 12:24\nyep yep\n\nhawks' #1 wife Today at 12:24\nHave either of you read any of the posts? sure the one he linked to with his twitter account was a pretty fun read, but the older stuff is BOOOORING\n\nNata Today at 12:24\nnot to mention scattered, you'd think the guy had never written a technical paper in his life lol\n\nAhhhh! Raptor! Today at 12:24\n🤣\n\nhawksXmirko4life &lt;3 Today at 12:25\nNo way Hawks actually likes it, he's just trolling\n\ndylusional Today at 12:24\nbut then like why would he even link it? it didn't seem like a joke\n\nNata Today at 12:24\nhis ongoing public fued with Sir Nighteye is more than enough motivation\n\nRed Today at 12:24\nTime's up! Vote with your emojis! 🤡 for \"troll\" and 💘 for \"sincere\"!\n🤡 54 💘 12 🤷 32\n\n \n \n \n \nQuirk consultation #1: Bubble blowing emitter quirk\n by Shuttai on June 08, 20X4 - 316 Comments \n Thanks \"fishduplex\" for your submission! Let's get right down to it: have you analyzed the chemical make-up of your exhales? Because assuming they contain [...]\nRead More\nAmateur quirk consultation?\n by Shuttai on June 07, 20X4 - 540 Comments \n Not to make anyone mad, but some of you complaining about how lame your quirks are, are just misinformed! My passion is quirk analysis, and I'd like to [...]\nRead More\nSeeing as I have your attention,\n by Shuttai on June 05, 20X4 - 221 Comments \n I think a lot of new readers are discouraged by their quirks. And that's okay! You don't have to have a perfect hero quirk to be a hero to someone else. If [...]\nRead More\nUhhh...\n by Shuttai on June 04, 20X4 - 4003 Comments \n Wow, okay I didn't expect that to blow-up. Also PRO HERO HAWKS WAS READING MY QUIRK BLOG? WHAT?? I'm SO EMBARRASSED, please tell me he's not still [...]\nRead More\n \n \n \n \n\n The Tres Amigos (3)\n\nTue, Jun 6, 20X4\n\n\n\nNejire\n\nHey hey Mirio, didja see that article about you?? :o\n \n05:30\n\n\nMirio\n\nI did indeed! Sir Nighteye was kind enough to forward it along.\n \n05:41\n\n\nNejire\n\nand?? what did you think!! are you mad? do you know him? do you think he has a personal vendetta!? is this the beginning of the rivalry to end all rivalries??\n \n05:43\n\n\nMirio\n\nIt was clearly a very well thought out rebuke of my actions!\n \n05:48\n\n\nNejire\n\nit was kind of a lot, right? he said so much!\n \n05:50\n\n\nNejire\n\nI read it but I didn't really get it!! XD\n \n05:50\n\n\nNejire\n\nare you scared? do you think he's gonna come and punch you in the face? have you ever been punched in the face before?\n \n05:50\n\n\nMirio\n\nSir Nighteye did have some concerns but I think it's fine! I'm taking it for what it is. A thoughtful criticism of the current way I use my quirk, and a warning to be more careful with my words.\n \n05:58\n\n\nNejire\n\naren't you mad?\n \n05:59\n\n\nMirio\n\nI'm a little disappointed in myself, honestly. I never realized that my words could cause much upset for another individual. I do think my words were taken out of context but that's also something I should have considered, as heroes are so public facing. But I plan to work on it and be more careful in the future, and I'm glad I found this out now rather than later\n \n06:05\n\n\n\n\nscrew that dude\nRead 206:08\n\nMirio\n\nWow, this is really early for you, Tamaki! I hope we didn't wake you\n \n06:10\n\n\nNejire\n\n:ooo sleeping beauty's awake!!\n \n06:10\n\n\n\n\noh um don't worry about it i just wanted to say that that blog guy is wrong and he doesnt know anything and that i know how hard you've worked to get here and yea thats all hope you're not feeling bad about it anyway i'm going back to sleep now good night\nRead 206:15\n\nMirio\n\nThank you very much Tamaki!\n \n06:16\n\n\nnp...\n\nRead 2 \n06:16\n\n\nNejire\n\nlolol goodnight Amajiki-kun!!\n \n06:16\n\n\n \n \n \n \n\n\n\n \n \n\nA fan of your blog, and a concerned citizen    Inbox  \n\nHello, Shuttai-san,\n\nI feel kind of awkward sending this email, but I just thought you should know that the whois for your blog domain has this gmail account. It also seems to have your real name, possibly? I didn't look you up or anything so pelase don't worry about that, I just thought you might like to know. Also, you might to remove that information before you get any more popular and more people start looking at that sort of stuff.\n\nMy deepest apologies for kind of accidentally stalking you,\n\nHaimawari Koichi \n\n \n\nWhat is a whois?? how did you get this email?? Are you saying other people can get this email and my real name??\n\n \n \n\nYes, that is unfortunately what I'm saying. Do you remember setting up the domain for your blog? When you register a domain, you also have to provide contact information for that domain. It's very common for people to use their real information for this contact information, but it is accessible to anyone who knows where to look.\n\nThis is probably going to sound really creepy, but is XXX-XXX-XXX still your number? That's also included on the whois for your domain.\n\n \n \n\nI'm sorry I really don't mean to be rude I'm just freaking out because why do you have my mom's cellphone number\n\n \n \n\nThis might not make you feel better but I promise I'm just a normal college student. I do computers as a hobby, and follow Hawks' Twitter. I swear I didn't look you up, but if you're underage that makes this all the more important.\n\nIf you call me, I can help you take this information offline.\n\nMy number:\n+81 XXX-XXX-XXX\n\n \n \n \n \n \n \n \nIncoming call\n \n Midoriya Izuku\n[SMART] +81 XXX-XXX-XXX\n\n\nSend Message\n \n \n \n \n \n\ncrwlr@ubuntu3:/home/crwlr\n\n\ncrwlr@ubuntu3:~$ whois quirkanalysisblog.com \n% IANA WHOIS server\n% for more information on IANA, visit http://www.iana.org\n% This query returned 1 object\n\n[...]\n\n# whois.verisign-grs.com\n\n Domain Name: QUIRKANALYSISBLOG.COM\n Registry Domain ID: 1666802697_DOMAIN_COM-VRSN\n Registrar WHOIS Server: whois.discount-domain.com\n Registrar URL: http://gmo.jp\n Updated Date: 20X4-06-07T05:53:46Z\n Creation Date: 20X0-01-14T00:31:03Z\n Registry Expiry Date: 20X5-01-14T00:31:03Z\n Registrar: GMO Internet, Inc. d/b/a Onamae.com\n Registrar IANA ID: 49\n Registrar Abuse Contact Email: [email protected]\n Registrar Abuse Contact Phone: +81.337709199\n Domain Status: clientTransferProhibited https://icann.org/epp#clientTransferProhibited\n Name Server: NS-1036.AWSDNS-01.ORG\n Name Server: NS-1875.AWSDNS-42.CO.UK\n Name Server: NS-188.AWSDNS-23.COM\n Name Server: NS-728.AWSDNS-27.NET\n DNSSEC: unsigned\n URL of the ICANN Whois Inaccuracy Complaint Form:\nComplaint Form: https://www.icann.org/wicf/\n&gt;&gt;&gt; Last update of whois database: 20X4-06-07T18:35:57Z &lt;&lt;&lt;\n\n# whois.namecheap.com\n\nDomain name: QUIRKANALYSISBLOG.COM\nRegistry Domain ID: 1666802697_DOMAIN_COM-VRSN\nRegistrar WHOIS Server: whois.discount-domain.com\nRegistrar URL: http://www.onamae.com\nUpdated Date: 20X4-06-07T05:53:46.94Z\nCreation Date: 20X1-07-14T00:31:03.00Z\nRegistrar Registration Expiration Date: 20X5-01-14T00:31:03.00Z\nRegistrar: GMO INTERNET, INC.\nRegistrar IANA ID: 49\nRegistrar Abuse Contact Email: [email protected]\nRegistrar Abuse Contact Phone: +81.337709199\nDomain Status: clientTransferProhibited https://icann.org/epp#clientTransferProhibited\nRegistry Registrant ID:\nRegistrant Name: REDACTED FOR PRIVACY\nRegistrant Organization: REDACTED FOR PRIVACY\nRegistrant Street: REDACTED FOR PRIVACY\nRegistrant City: REDACTED FOR PRIVACY\nRegistrant State/Province: Panama\nRegistrant Postal Code: REDACTED FOR PRIVACY\nRegistrant Country: Panama\nRegistrant Phone: REDACTED FOR PRIVACY\nRegistrant Phone Ext:\nRegistrant Fax:\nRegistrant Fax Ext:\nRegistrant Email: [email protected]\nRegistry Admin ID:\nAdmin Name: REDACTED FOR PRIVACY\nAdmin Organization: REDACTED FOR PRIVACY\nAdmin Street: REDACTED FOR PRIVACY\nAdmin City: REDACTED FOR PRIVACY\nAdmin State/Province: REDACTED FOR PRIVACY\nAdmin Postal Code: REDACTED FOR PRIVACY\nAdmin Country: REDACTED FOR PRIVACY\nAdmin Phone: REDACTED FOR PRIVACY\nAdmin Phone Ext:\nAdmin Fax:\nAdmin Fax Ext:\nAdmin Email: [email protected]\nRegistry Tech ID:\nTech Name: REDACTED FOR PRIVACY\nTech Organization: REDACTED FOR PRIVACY\nTech Street: REDACTED FOR PRIVACY\nTech City: REDACTED FOR PRIVACY\nTech State/Province: REDACTED FOR PRIVACY\nTech Postal Code: REDACTED FOR PRIVACY\nTech Country: REDACTED FOR PRIVACY\nTech Phone: REDACTED FOR PRIVACY\nTech Phone Ext:\nTech Fax:\nTech Fax Ext:\nTech Email: [email protected]\nName Server: ns1507.websitewelcome.com\nName Server: ns1508.websitewelcome.com\nDNSSEC: unsigned\nURL of the ICANN WHOIS Data Problem Reporting System:\nhttp://wdprs.internic.net/\n&gt;&gt;&gt; Last update of WHOIS database: 20X4-06-07T18:35:57Z &lt;&lt;&lt;\n\n\n \n \n \n \n \n \n \n \n \n \n\nUnlikely Team Up: More Surprises to Come?  3 days ago · Daily via Yap News \n\n\nLast week a save came from the most unlikely of duos: Pro Heros Gunhead and The Fly. The pair were seen taking out several villains together in downtown Kanagawa, and seemed upset when questioned about it during an interview with ...\n\n\n\nStain Still At Large! Are The Pros Really Doing All They Can?  2 days ago · Post Seven via Yap News\n\n\nHero Killer Stain has been keeping a lower profile since the Ingenium incident in Hosu, but authorities say he's a suspect for random attacks occurring all over Tokyo. With his rising popularity among the disillusioned youth, ...\n\n\n\n Recall on Fish Wontons Due to Undeclared Allergen  1 day ago · Daily via Yap News \n\n\nSakama Foods is recalling roughly 500 kilos of pre-cooked fish wontons due to misbranding and an undeclared allergen. MAFF claims the product may contain fish that are not declared on the product label. ...\n\n \n \n \n \nr/chemistry\nnuclearjack · 4d ago \nCan someone tell me if these numbers make sense\n\nIs this guy just talking out his ass or is he onto something? Sort of wishing I'd paid attention during college chem class, now.\n\nPhoto\n\n m.imgur.com/XXXXXXX\n\n\n 2.4k    115\n\n115 Comments sorted by Best \nLogin or sign up to leave a comment\n\n aminocow  3d  \nHe's not accounting for the kilojoules lost during the exothermic part of the reaction, but the idea is solid. I'd assume he over-simplified it for his readers, seems legit to me.\n\n\n soho2025 3d \n\nSeconding this\n\n\nnuclearjack 3d  \nMy respect for this guy just keeps going up.\n\n\n\n Gonnslack  3d  \nLooks right to me but who would even think of this? It's insane\n\n\n nuclearjack 3d \n\nThat's what I'm saying. If this is true, what does this guy even do for a living?\n\n zfled 3d  \nIt's not as impressive as you might be thinking, the math itself isn't that complicated. Students in my organic chemistry class could do it, but that's only if they were given the problem in a text book. I think the impressive part is that whoever wrote this even thought to consider this angle.\n\n1 more reply\n\n\nVIEW ALL 115 COMMENTS\n \n \n \n \n \n \n \n \n\n\n\n\nMount Lady @mtlady_official\n\nCan someone tell me who or what QAB is? I keep getting DMs asking me if \"the third post was about me\". I don't know what this means!\n\n13:19 · 19 June · Twitter for iPhone\n\n1.5k Retweets and comments 101k Likes\n\n \n \n \n \nPlease, calm down\n by Shuttai on June 21, 20X4 - 872 Comments \nWhy would you think I was joking about the quirk jesus thing?? You guys... please... [...]\nRead More\nLate night curry?\n by Shuttai on June 20, 20X4 - 210 Comments \n This feels like an abuse of power, but could someone tell me if anywhere near Tsukuba that still serves curry at this hour? I got caught up visiting a friend at their college and I'm [...]\nRead More\nLegal Disclaimer\n by Shuttai on June 18, 20X4 - 433 Comments\n I am not a professional quirk consultant. I am not a professional anything. Please stop calling me \"quirk jesus\". [...]\nRead More\nQuirk consultation #15: Hair spikes\n by Shuttai on June 15, 20X4 - 540 Comments\nThanks IceStormHorse, for your submission! Yes folks, you read that right: hair spikes. IceStormHorse can harden their hair, detach it at will, and stab people with it. I don't [...]\nRead More\n \n \n \n \n\n Koichi\n \n \n \n \nr/OutOfTheLoop\nLanky_Bob · 15h ago \nWhat is QAB and why is everyone suddenly obsessed with it?\n! Answered\n\nI remember that one blog post circulating about a month ago, but people have started talking about it like it's more than that. Did I miss something? Am I mistaking the blog for a new cult with the same acronym?\n\n\n 2.9k     672\n\n672 Comments sorted by Best \nLogin or sign up to leave a comment\n 📌 AutoModerator  12h ... \nFriendly reminder that all top level comments must:\n\n\n bumps-in-space  1.2k points · 10h \nquestion: Do you think that by talking about this, we're lending more power to a force that seems to be in opposition to the government? Not trying to troll, just curious from a sociological point of view.\n\n\n ajisai497 8h \n\nThis is my thought as well. I've been telling everyone to stay away, the founder of QAB is basically a Stain clone.\n\n\ninfinitetails 6h  \nBut quirk jesus is love; quirk jesus is life?\n\n martian-sim 6h  \nONE OF US, ONE OF US\n\n\nnuclearjack 6h \n\nONE OF US, ONE OF US\n\n\najisai497 6h  \nThis is what I'm talking about. This meme-ish fandom mind-set is blinding people to the harm QAB is doing to hero society.\n\nSee replies\n\n\n\n 5w4nn  10h  \nAnswer: (tl;dr: QAB posted an article that Endeavor took offence to and issued a lawsuit. The internet (i.e., Twitter) has proceeded to take sides/flip its s#!t.)\n\nQAB is short for \"Quirk Analysis Blog for the Future\", the long-winded title of a personal blog hosted by it's sole author, \"Shuttai\".\n\nQAB has been around for a few years but only started seeing popularity when few verified hero accounts on Twitter started publicly debating the content. Around the same time, QAB started to change the way it presented content; it's now publishing current event articles and has also started up a \"quirk consultation\" series. This seems to have done two things: made QAB controversial, and cemented a die hard fanbase. (As an aside, the quirk consultations are incredibly well done and worth a read, especially for anyone interested in pursuing a career in quirk analysis. Readers vote on a list of submitted quirks and then the writer of QAB posts detailed dissertations on the most popular ones. He's an amateur (amateur as in not classically trained/no accreditation, and he's not shy about admitting that), but the series has been garnering a lot of attention.)\n\nEarlier this week QAB posted a more political piece about media coverage in heroics. The post talks about how heroics is turning into a \"popularity contest\", and turning some heros into \"dangerously unstable megalomaniacs [...] like Endeavor.\" Endeavor's agency very quickly tried to sue on the basis of defamation or libel, but 1, suing an anonymous internet user is no joke, 2, the post isn't against the terms of service for the service provider he uses, and 3, as far as anyone can tell, Endeavor wasn't actually defamed. (Not by any legal definitions, anyway.)\n\nThere's rumors that a SECOND lawsuit was filed against QAB for how the fanbase reacted to the first lawsuit, but I haven't seen any solid proof of that.\n\nCurrently, it's a full-blown Twitter war. Even some of my IRL coworkers have strong opinions about what is ultimately one anonymous guy on the internet publicly publishing his political views... just like everyone on Twitter is doing already. Someone with more of a sociology background might be able to tell you why the article has been so polarizing.\n\nedit: a word\n\n\n 1shadow1 4h \n\nI am once again glad I don't have a twitter\n\nMayhap_Mishap 4h  \n&gt; \"sue on the basis of defamation or slander\" \nQAB is being sued for libel, not slander. Slander is oral, libel is written. (But otherwise, 10/10)\n\n HVCmelody 3h \n\nTIL. Thanks!\n\n\n3 more replies\n ANMBR  3h  \nEndeavor's people have been really aggressive about getting in front of any potential bad press ever since he failed to bring down Stain back in May. I think that's part of the reason things got so out of control.\n\n\n noburo 2h \n\nI think people got worked up because ANN keeps running stories about how similar Stain and Shuttai (founder of QAB) are. They do seem to have some similar thoughts on the current state of hero society, but Stain is out on the streets stabbing people and Shuttai is giving away free quirk consultations.\n\n fullofsinewaves 4h  \nhawks_unofficial also made a series of tweets that seem to be in direct response to this.\n\n ItsudemoDoutei 4h \n\nHawks is the embodiment of a troll tho\n\n\n5w4nn 4h  \nHawks response was really enlightening, from the perspective of someone outside of the heroics industry. He seemed to sort of (respectfully) disagree with Shuttai? Considering how much he helped push QAB to where it is today, I would have expected Hawks to either back Shuttai or disavow him entirely.\n\n\nSee replies\n\n\nVIEW ALL 672 COMMENTS\n \n \n \n \nConcerning the Lawsuit\n by Shuttai on July 05, 20X4 \n\nHey everyone! I apologize that this isn't the quirk analysis you were expecting. Instead, I wanted to address the recent rumors and set the record straight before things can get even more ridiculous.\n\nDid Endeavor sue you?\nEndeavor's publicity team tried to threaten me with a lawsuit. This was done in an effort to intimidate me into removing an article I posted early last week. They believed the article did not frame Endeavor in \"an accurate or publicly respectable manner\", which I think was their way of accusing me of defamation. (You've probably read the offending post already, given that you're reading this. But in case you missed it, here it is.)\n\nIt is my suspicion that Endeavor's publicity team did not, in fact, read the article they tried to sue me over, as the lines they took issue with were taken out of context. The lawsuit (or rather, the empty threat of a lawsuit) has subsequently been dropped.\n\nDo you have a personal grudge against Endeavor?\nEndeavor has done a lot for Japan, and many grateful people owe him their lives. Again, if you've read the original post, I think you'll see that my criticisms are against the current structure of the hero industry, NOT directly against Endeavor.\n\nRegarding Hawks\nHawks and I are not fighting, and we don't hate each other. I don't know why people keep asking about this. I don't even know Hawks! To be honest, I'd be too embarrassed to try to talk to him, even over the internet. He's so famous?? He's?? So cool?? I'm pretty sure the one time he allegedly read my blog was just a fluke. I'm sure someone like him is much too busy for the ramblings of an amateur quirk enthusiast.\n\nIn the off chance his recent tweet wasn't just a mistake or a joke, then I am honored he read my post and I respect his opinion! He's given me a lot to think about. My personal perspective is one from the outside looking in. I, like many of you, live in a world where every decision the Hero Public Safety Commission makes can affect my daily life and well-being, and as such I have opinions about how they operate. But I am in no way a professional in the hero industry.\n\nAnd on the topic of other's opinions, please keep in mind that everyone is entitled to their own! We are all walking through life using a different lens of upbringing and experience. We all have different opinions and ideas on what we think is the right way to change the world. In the end, I believe the melding of those ideas is what will give us the power to shape our collective future for the better.\n\n \n \n \n \n\nShoe Size Revealed?! Mt. Lady Fans in an Uproar!  July 10 · Human via Yap News \n\n\nIn a late-night interview on All Night Tall, its host, Yanagi Shigeru, finally popped the question... how big are Mt. Lady's feet?! The young heroine has always been on the shy side when it comes to questions about size, and feet have been no exception ...\n\n\n\n3 Month Anniversary of Hero Thirteen's Death  July 10 · Hero★NEWS via Yap News\n\n\nJapan is still shaken at the loss of one of the most iconic rescue heroes of her time. In 20X1 I had the chance to interview Space Hero: Thirteen. That article was her last major interview before she retired from active duty and turned to a career in teaching young hero hopefuls at ...\n\n\n\nMighty Bank Preparing for Grand-Reopening  July 11 · Japan Digital via Yap News \n\n\nFollowing the February attack on several Kanagawa branch offices, Mighty Bank was forced to close it's doors. However, thanks to the significant efforts of Bigshot Agency, Kanagawa residents will once again be able to ...\n\n \n \n \n \n \n\n\n\n \n \n \n \n\nThis Tweet has been deleted by the Tweet author. Learn more\n\nTatami @turtleneckturtleheart  · Jul 7 \nReplying to @endeavor_official\nw o w. Not a good look for Endeavor\n\n\n\nNinjaSpirit @nkmrkei  · Jul 7 \nReplying to @endeavor_official\nIs this about the QAB lawsuit or Kamui Woods one?\n\n\n\n \n \n \n \n \n \n\n Midoriya\n\nToday\n\n\n\nhave you considered starting a discord? qab is getting pretty big\nRead02:30\n\n\nGood morning, Koichi-san! You were up pretty late. I hope everything's okay?\n06:49\n\n\n\n\nlol, yeah, im good, you know me, practically nocturnal\nRead 07:01\n\ndiscord?\nRead 07:01\n\n\nUm, I mean, I haven't really thought about it, I guess. I don't know if I'd really have time for it? I've been pretty busy between my double enrollment and writing all these extra blog posts.\n07:05\n\n\nnah it's cool, dont sweat it\nRead 07:06\n\nare you OPPOSED to the idea of a discord server? i think it'd be a lot of fun. i could set it up, and i know a couple of people who would be willing to help mod it\nRead 07:06\n\n\nWow!! are you sure?? That would be amazing, but I don't want you to go to have to go to all that trouble...\n07:15\n\n\nliterally zero trouble, i make discord servers all the time, i have a template and everything\nit'd be up before you know it\nRead 07:15\n\nyou dont even have to be involved, but i dont want to make it if it'd make you uncomfortable\nRead 07:27\n\n\nno no not at all! I think it would be really fun!!\n07:42\n\n\nkk give me five minutes\nRead 07:43\n\n\nFive MINUTES?\n07:43\n\n\n \n \n \n \n\nAs of July 8th, Midoriya Izuku still believes that the discord server will comprise of himself, his new friend Koichi, and a handful of the regular commenters on his blog. Upon its inception, the channels on the Quirk Analysis Blog Discord server (Q.A.B.D.) are as follows:\n\n \n \nABOUT \n# announcements \n# rules \n# gate \n# faq \n# introductions\n\nGENERAL \n# freechat \n# ideals-chat \n# post-discussion \n# memes \n# polls\n\nHELP \n# curry \n# ask-a-mod\n\nADMIN \n# mod-chat \n# SHUTTAI-READ-THIS\n\n \n \n \n \n\nSparky Sparky Boom Man @chargebolt\n\nI think QAB#12 is about a dude in my class?? If so he'd be one of the earliest non-professional hero quirk analysis posts that we know of\n\n19:23 · 11 July · Twitter for Android\n\n5 Retweets and comments 35 Likes\n\nThe Amazing Mei @inventorextrodinaire  · 2d \nReplying to @chargebolt\nThat exploding kid, right? I was thinking the same thing.\n\n\n\n \n \n \n \n \n \nBirdbrain\n\n\nThat weirdo you're obsessed with made a discord server.\n02:10 ✓✓\n\n\nhe did wHAT\n\n\nWHERE\n\n\nY WAS I NOT INVITED\n02:11\n\n\nWhat do you think I'm doing right now?? asshole\n\n\n\nhttps://discord.gg/wda7JfHtpu\n02:11 ✓✓\n\n\nOMG UR THE BEST ILY\n02:11\n\n\nWhat\n02:11 ✓✓\n\n\nuuhhhhhh\n\n\nu kno like \"ily dad\" no nvm thts wors\n\n\n\nhonstly it ws a typo n i was gonna try 2 own it bt i feel liek im ju\n\n\n\nomg hes online omg\n02:15\n\n\n????\n02:16 ✓\n\n\nWhich one of us needs a therapist again\n02:28 ✓\n\n\n \n \n \n \n\n The Crawler\n\nToday\n\n\n\nhey\n14:22\n\ni know i havent seen you in a while, i hope you're doing well after, you know\n14:22\n\n\nand i know this isn't why you gave me your contact info\n14:22\n\nbut how do you feel about QAB?\n14:22\n\n\nCrawler-kun! It's good to hear from you. Staying out of trouble, I hope?\nRead 16:09\n\nAs for QAB, I must admit, it's been a guilty pleasure of mine to pass the time while I've been stuck in the hospital.\nRead 16:09\n\n\noh okay, cool! i mean, not cool that you're in the hospital but cool that you know what QAB is and um\n16:21\n\nsorry im really bad at this\n16:21\n\n\nNonsense! You're doing great. What is it you wanted to ask me about QAB?\nRead 16:23\n\n\ndo you have a discord account, and would you be interested in helping mod a QAB server?\n16:28\n\nhawks is here and i am losing my mind, please help me\n16:29\n\n\n \n \n \n \nQuirk Analysis #22: Cosmetic Quirks\n by Shuttai on July 20, 20X4 - 319 Comments \nRead More\nWho DOESN'T like All Might?\n by Shuttai on July 17, 20X4 - 420 Comments \n\nI wish this were a rhetorical question, because: ALL MIGHT. However, there are a number of reasons (personal, professional, or otherwise) why an individual may not, in fact, like All Might. These people range from indifference, to proactive anger towards at All Might for perceived failures in the way the Hero Association [...]\n\nRead More\nAddressing Stain: Part 2; An Open Letter to Stain\n by Shuttai on July 13, 20X4 - 626 Comments \n\nYou all seem to think I have a lot of influence... On the off chance that's true: Dear Stain, PLEASE STOP MURDERING PEOPLE. MURDER IS BAD. HOW ABOUT YOU DON'T MURDER PEOPLE [...]\n\nRead More\nDiscord Server\n by Shuttai on July 12, 20X4 - 311 Comments \n\nI've gotten a lot of comments asking me if \"QABD\" is a legitimate server, if I created it, and if I enforce it. Yes, No, Yes. Crawler-san owns the server, and set it up on my behalf. I don't currently have time to run a server, but I do plan to be in the server from [...]\n\nRead More\nQuirk Analysis #21: Lizard Eyes\n by Shuttai on July 11, 20X4 - 281 Comments \n\nThanks Lizabeth, for your submission! Lizabeth has double eyelids. Think of the potential for areas with high wind and sand! You could also ride a motorbike at high speeds without goggles (which I wouldn't recommend) but [...]\n\nRead More\nAddressing Stain\n by Shuttai on July 8, 20X4 - 467 Comments \n\nA handful of you seem to think I have a direct relation to Stain, or that I know him personally. This is really weird and baseless rumor. I do not know Stain and I do not agree with his methods. I would like to [...]\n\nRead More\n \n \n \n \nr/unpopularopinion\nkvacr · 9h ago \nQAB is overrated\n\nThe blog posts are rambling and most of them don't even have a point. There's barely any coherency, and the writer just posts whatever he wants to, there's no consistancy.\n\nNot to mention the \"quirk analysis\" posts, a grade schooler could give that advice.\n\n\n 32    17\n\n17 Comments sorted by Best \nLogin or sign up to leave a comment\n live-the-past  9h... \nI like some of the posts but I do agree it's overhyped.\n\n\n Triago4  8h... \nNo one's forcing you to read it.\n\n\n CarlWithAK  9h... \nI don't know what you're expecting out of a personal blog? Of course Shuttai posts whatever he wants. I think it's great, if he just posted the same thing all the time I think I would have gotten bored by now. You don't have to like it of course, but it seems like you've never seen a blog before and are just mad about it being the thing that it is.\n\n\n tom88  7h... \nSo we're saying a \"grade schooler\" can write proficiently about high-level quirk sciences now? I think the content probably just went over your head.\n\n\n Waste-Tomatoes9765  9h... \nA lot of the posts on this sub aren’t unpopular opinions, they're just people complaining about things they personally don’t like.\n\n\n\n MooseOnABridge  8h  \nIt's so fucking overhyped. There are so many better analyses out there, why is QAB the one to catch on? Just because Hawks tweeted about it the one time? Pathetic.\n\n\n dollarydoos 7h \n\nAgreed, it's just the Hawks fans. They'll get bored and move on in a few weeks. Especially after the author fired shots at All Might.\n\n 5w4nn 7h  \nI'm sure Hawks' influence didn't hurt, but I got recced QAB by a friend who doesn't even like Hawks. I think you're really underestimating the inherent charm of the QAB's style. And sure the posts might not be the most technical sometimes, but they're very easy to understand without feeling like the author is talking down to you.\n\nAlso there were literally no shots fired at All Might, did you even read the post?\n\n\n9 more replies\n\n\n \n \n \n \n # curry\n\n100+ new message since July 20, 20X4 \nbluenoise Today at 14:01\nThat sounds about right\n\nXCFV Today at 14:02\nkk\n\n✧༺✦✮✦༻∞ Blood Love ∞༺✦✮✦༻✧ Today at 14:23\nheyo!! 👋 \ni need help and someone said i should ask here? 🤔 🤔\n\n雷人(Rai) Today at 14:23\nHime-chan!!\n\n✧༺✦✮✦༻∞ Blood Love ∞༺✦✮✦༻✧ Today at 14:23\nRai-kun!!!! 🥰 🥰\n\n雷人(Rai) Today at 14:23\n💖 💞 💖 \nWhy do you need help?? Did something happen???\n\nEngineMan Today at 14:24\n@✧༺✦✮✦༻∞ Blood Love ∞༺✦✮✦༻✧ You're at the right place! If it is within our ability to help you, we will do so (within reason, of course.)\n\n雷人(Rai) Today at 14:24\nI've been here since the beginning and I still don't know why it's called curry\n\nEngineMan Today at 14:24\nCommon requests are for food recommendations, or if any other members are near a particular establishment and can check for lost items. We've also helped get a cat down from a tree, retrieved a child's balloon, and turned a groper into the police!\n\nbluenoise Today at 14:24\ncurry is a reference to that one QAB post https://quirkanalysisblog.com/posts/late-night-curry\n\n雷人(Rai) Today at 14:25\nOH RIGHT, LOOOOL\nNo but seriously tho @✧༺✦✮✦༻∞ Blood Love ∞༺✦✮✦༻✧, are you OK?\n\n✧༺✦✮✦༻∞ Blood Love ∞༺✦✮✦༻✧ Today at 14:25\n@雷人(Rai) I'm OK!!! I just lost something 😔 😔 \ni was at a cafe with some friends but when we left i think i forgot my bag 💦 😅 \ni'm headed back there now, but i'm still an hour away 🥲 \n\nbluenoise Today at 14:26\ndid you call the cafe?\n\n✧༺✦✮✦༻∞ Blood Love ∞༺✦✮✦༻✧ Today at 14:26\nyeah but i got sent to voicemail 😭 😭\n\nEngineMan Today at 14:27\nWhat area is the cafe in?\n\n✧༺✦✮✦༻∞ Blood Love ∞༺✦✮✦༻✧ Today at 14:27\nHarajuku 💮\n\nEngineMan Today at 14:28\n@shibuya-ku is anyone near Harajuku?\n\nLia Today at 14:29\n✋ Me \nI have a break coming up \n@✧༺✦✮✦༻∞ Blood Love ∞༺✦✮✦༻✧ If you DM me the cafe name and a description of the bag, I can swing by and check\n\n✧༺✦✮✦༻∞ Blood Love ∞༺✦✮✦༻✧ Today at 14:30\nok i will, thank you so much!! 💞 ⭐ 💫 ❣️\n\n \n \n \n \n\nSine Waves Fractal @sineful\n\nAll Might is a teacher at UA but he doesn't have a twitter... this is a longshot, but @PresentMic, do you think you could ask him what he thinks about QAB??\n\n17:53 · Jul 19, 20X4 · Twitter Web App\n\n3.1 Retweets and comments 4.5k Likes\n\nBlue Noise @BLUENO1SE  · Jul 19 \nReplying to @sineful\nomg this is brilliant, please, I need to know\n\n\n\nPresent Mic  @PresentMic  · Jul 20 \nReplying to @sineful\nI doubt he knows what QAB is yet, he's not on the internet much. but I can introduce him!!\n\n\n\nSine Waves Fractal @sineful  · Jul 20 \nthat would be AMAZING, thank you so much!! PLUS ULTRA!\n\n\n\n \n \n \n \n\nPopular Comedian: Moonlighting as a Con Artist  July 14 · Daily via Yap News \n\n\nBack in May, the well known comedian, Kuse Keiji, sued Sakama Foods for mislabeling their fish wontons ingredients list. The comedian claimed the failure to list fish as one of the ingredients nearly cost him his life. The catch? He's not allergic to fish.\n\n\n\nStain on the Move: Sightings in Osaka  July 14 · DCC via Yap News\n\n\nThe violent villain Stain, notoriously popular for his polarizing political views, has been spotted in Osaka prefecture taking swipes at the BMI Hero: Fat Gum. Osaka is a far cry south from Stain's usual haunt of Tokyo, and experts theorize ...\n\n\n\n'We Aren't Dating' Pro Hero Midnight Says  July 14 · Human via Yap News \n\n\nIn a street interview with Flourish, the Pro Hero, 31, was seen with a potential new beau. Interviewers were unable to identify this man, and when questioned about the whereabouts of her current known paramour, the ...\n\n \n \n \n \nhochikisu\nJuly 15 20X4, 18:49\nNot really related to the post but the link to the circuit diagram maker is going to literally save my life. It won't stop my ceng class from kicking my ass but at least now I won't have to draw diagrams by hand.\n\n\nShuttai\nJuly 17 20X4, 05:58\nGlad it was helpful!\n\n\nAo\nJuly 15 20X4, 19:02\nhi\n\n\nMike\nJuly 16 20X4, 15:15\nsup\n\n\nSwann\nJuly 15 20X4, 19:08\nThe post was great as always. I have a friend with an electricity based quirk and we used to do a lot of experimenting with it when we were kids. I really thought we'd tried it all. Now, I'm thinking about calling him up and seeing if he wants to see if he can make clouds. Then again, you have a scarily good point about cloud seeding and the dangers thereof.\n\nIt also makes sense that any quirk dealing with electricity would rely on the user's bio-electricity for conversion, but since people are bio-matter I wonder if there would be merit in testing a given user's electrolyte levels and seeing what effects that has on quirk output, etc.\n\n\n0u812\nJuly 15 20X4, 22:17\nwould you say the post was... SHOCKING? ok sorry ill see myself out\n\n\nShuttai\nJuly 17 20X4, 06:04\nI've been thinking about electrolyte levels as well! I would have liked to include something about that in this post but I didn't have the time to do proper research into it. I did pull together a bunch of white papers that seem promising. Hopefully I can work that into a future write-up!\n\n\nSwann\nJuly 17 20X4, 06:11\nI look forward to it.\n\n\nkira\nJuly 15 20X4, 19:21\n&lt;3\n\n\nShuttai\nJuly 17 20X4, 06:05\n&lt;3!\n\n\nx\nJuly 15 20X4, 19:25\nno on can understand u Liek i do And if you see you be great revolution\n\ni think of u every day and ur butifl mind want to be Part of you're Legasy wont you Tell me were you Are you biutiful boy\n\n\nShuttai\nJuly 17 20X4, 06:11\nI'm not quite sure I understand what you mean, but thanks I think?\n\nAlso sorry, I'm not comfortable sharing my location. But thank you for your comment!\n\n\nCarly M\nJuly 15 20X4, 19:53\nzamn really good article!\n\n\nShuttai\nJuly 17 20X4, 06:12\nThanks!\n\n\n \n \n \n \n\n\n\n \n \n\n Mina 🚀\n\n\nHey Kiri-chan\n\n19:02\n\n\nhey mina!\n\nRead \n19:05\n\n\nThis is kind of left field but could I get you to talk to Denki for me?\n\n19:07\n\n\nwhat about?\n\nRead 19:08\n\n\nSo like, I'm friends with Tooru and Tooru's friends with Jirou and Jirou hangs out with Tsuyuu and Tsuyuu and Uraraka are BFFs and Uraraka and Iida are tight\n\n19:15\n\nyou know?\n\n19:15\n\n\nuhh\n\nRead 19:16\n\n\nsure?\n\nRead 19:16\n\n\nso I'm not exactly suppose to know this, but\n\n19:18\n\nIida did his internship in Hosu\n\n19:18\n\nand like\n\n19:18\n\nokay\n\n19:18\n\nI need you to swear to secrecy because I am NOT suppose to know this, like, at ALL\n\n19:18\n\n\nif you aren't supposed to know then should you even be telling me??\n\nRead 19:18\n\n\nI think I have to so you understand how important it is\n\n19:18\n\n\n \nDo you swear you won't tell?\n\n19:18\n\n\n\n\nokay I swear\n\nRead 19:18\n\n\nSo Iida was there when Native died\n\n19:19\n\n\noh SHIT\n\nRead 19:21\n\n\nseriously?? oh my god why didn't anyone say anything??\n\nRead 19:21\n\n\noh my god I feel so BAD, I mean I knew he was acting off but I never even AKSED him, is he okay??\n\nRead 19:21\n\n\nI mean I know Native was months ago but I still have nightmares about USJ\n\nRead 19:21\n\n\nKiri-chan CALM DOWN\n\n19:22\n\nI don't know all the details, there were a lot of other factors and things were super weird back in May\n\n19:22\n\nWe were all... you know\n\n19:22\n\nAnyway don't go blaming yourself\n\n19:22\n\nBut back to Native, you know how the cause of death was never publicly released?\n\n19:22\n\n\nhe \"died in the line of duty\" right? I figured a robbery with a minor villain or something went bad\n\nRead 19:23\n\n\nYou're right about the went bad and the villain part, but Uraraka is like 99% sure it was Stain\n\n19:23\n\nLike, never gotten Iida to outright admit it, but pretty damn sure\n\n19:23\n\n\noh my god stain was involved??\n\nRead 19:23\n\n\nYes so LISTEN\n\n19:23\n\nI need you to talk to Denki and get him to NOT talk about Stain, possibly at all, but DEFINITELY not while Iida is in the room and you CAN'T tell him why\n\n19:23\n\n\nwhy tell me if you can't tell him?? that doesn't seem fair\n\nRead 19:24\n\n\nI know it isn't fair but I need you to think this through\n\n19:24\n\nI love Denki but that boy can't keep a secret to save his life\n\n19:24\n\n\n...okay. fair.\n\nRead 19:25\n\nI don't like it but I see where you're coming from\n\nRead 19:25\n\nI'll do what I can\n\nRead 19:25\n\n\nI knew I could count on you\n\n19:25\n\nYou're the best Kiri-chan &lt;3\n\n19:25\n\n\n&lt;3\n\nRead 19:25\n\n\n \n \n \n \n \n \n \n \n  +81XXXXXXXXX\nThis message is from an unsaved number. Beware of smishing and phishing. \nBlock number \nToday • 16:02\n\n\nYou're a Stain sympathizer, right?\n\n\nWho's saying that, who told you that\n\nAre you going to turn me into the HPSC?? being able to see things from another point of view isn't a CRIME\n\nPlease dont arrest me I'm too young to go to prison\n\n\nThat is correct. Given your age, if arrested you would not go to prison. You would likely go to a juvenile detention center.\n\n\nWhat can you tell me about QAB?\n\n\nWait what??\n\n\nNow you're sending me to JUVIE??\n\n\nPlease tell me about \"QAB\" and \"shuttai\".\n\n\nWho IS this??\n\n\nTodoroki Shouto.\n\nWe're classmates.\n\nI sit in the back row.\n\n\n??? Todoroki??? Why do you have my number?????\n\n\nI asked for help on yesterday's math homework and while Aizawa-sensei was distracted I took pictures of the student records in his desk.\n\n\nOmg\n\nOmg what\n\n\nI asked for help on yesterday's math homework and while Aizawa-sensei was distracted I took pictures of the student records in his desk.\n\n\nYeah okay. This could literally not be anyone else, hi Todoroki\n\n\n\"Todoroki 😒\" added to contacts\n \n \n \n \n @ Shouto\n\nShouto\nThis is the beginning of your direct message history with Shouto.\n \nJul 23, 20X4\n \nShouto Today at 15:27\nI have been told to contact you to prove I am \"not a hater\" and receive an invite to the \"discord\"\n\ncrawler Today at 15:46\nwhy are you talking like that, gtl?\n\nShouto Today at 15:55\nI don't understand. \nHow else would I talk? \nAnd what's gtlds? \ngtl\n\ncrawler Today at 15:59\n...ookkaaayyy \nyes im the guy to talk to, we've been getting some real weirdos and after taking all that time to weed them out we're not just gonna let them crawl back in \nlike, we've got IP based blocking but some of these crazies are using VPNs like who does that, this is japan \ns been a flippin madhouse my dude \nq1, have you been part of qabd in the past?\n\nShouto Today at 16:01\nI don't understand the question.\n\ncrawler Today at 16:02\noh jeez uhh okay \nYou are trying to gain access to the QAB Discord server?\n\nShouto Today at 16:02\nI believe that is correct.\n\ncrawler Today at 16:03\nOkay. \nHave you used Discord before?\n\nShouto Today at 16:03\nNo.\n\ncrawler Today at 16:03\nHow did you find out about QAB?\n\nShouto Today at 16:04\nThe recent defamation of Endeavor.\n\ncrawler Today at 16:04\nlol not an endhead, huh\n\nShouto Today at 16:04\nWhat?\n\ncrawler Today at 16:04\nFinal question: \nWhere did you get my Discord username?\n\nShouto Today at 16:04\nA classmate.\n\ncrawler Today at 16:04\nAre they a member of the Discord group already? \nDo you have a Discord user ID you could send? That way I can verify their identity.\n\nShouto Today at 16:04\nI'll ask.\n\ncrawler Today at 16:05\nk\n\nShouto Today at 15:27\n\"K\"?\n\n \n \n \n \n @ 雷人\n\n \nJul 23, 20X4\n \ncrawler Today at 16:15\nwait, it's YOU\n\n雷人  Today at 16:16\n?? It's ME\n\ncrawler Today at 16:15\nYOU'RE the reason i have this weirdo in my dms?\n\n雷人  Today at 16:16\nI wish I could say I don't know what you're talking about, but unfortunately. yes.\n\ncrawler Today at 16:16\nwhere the hell did you even find this guy, are you sure he's human \nis he even japanese\n\n雷人  Today at 16:17\nI know him irl, we're in the same class, I'm p sure he's cool but not sure he's not a robot \nLmao yes he's japanese\n\ncrawler Today at 16:17\nhe SOUNDS like a robot \nhave you tried giving him a captcha\n\n雷人  Today at 16:17\nLmao \nWe use to think he was \"too cool to talk to us plebs\" but now I think he just doesn't get out much\n\ncrawler Today at 16:18\nl o l \nchecks out \nill let him into the server\n\n雷人  Today at 16:18\nThanks!! Also, could you kinda watch out for him? He's. Well. I'm sure you noticed\n\ncrawler Today at 16:19\nugh, why me\n\n雷人  Today at 16:20\nYOU'RE the mod not me\n\ncrawler Today at 16:20\nugh okay, fine, ill be your rude robot friends fairy godmother\n\n雷人  Today at 16:20\n:D thanks bro you're the best!!\n\ncrawler Today at 16:20\nim going to regret this\n\n雷人  Today at 16:21\nYeah. Probably \nBetter you than me :)))\n\ncrawler Today at 16:22\n🖕\n\n \n \n \n \n \n\n\n\nJuzo News\nAltruism on the Rise?\nBY Tokuda Taneo\nUpdated July 18, 2X04\n\nThursday evening, a group of Naruhata University students helped reunite lost 5 year old child with her mother. One of the students possessed a locating quirk and used it to help the little girl find her mother. Some public concerns were raised over the illegal quirk usage, and when we reached out to the Ikebukuro city police station, the police chief issued the following statement:\n\n\"The students [...] did use their quirks but the quirk usage was not publicly visible nor did the illegal usage lead to additional crimes. There are no charges being pressed at this time. However, we did call their parents.\"\n\nRead Full Story\n \n \n \n \nScarface\n\n\ncoudl u do me a solid n tlk stain out of murdering me\n13:21 ✓✓\n\n\nWhat did you do\n14:56\n\n\neXIST??\n\nhow th hell shld i kw\n\ns nt like he's hard to lose but he jst KEEPS COMING\n\nits been days dabi i nede to slp\n\ni thoght u tld him abt me??\n15:25 ✓✓\n\n\nWell like\n\nNot your NAME\n15:37\n\n\ndabi\n\nfor the love of all might\n\ncall off your goddamn boss\n15:42 ✓✓\n\n\nYou could try sucking less\n15:59\n\n\n????\n16:01 ✓✓\n\n\nProve to stain you're a real hero worthy of your position as #3 and he'll leave you alone\n16:03\n\n\n???????\n\nr u HIGH\n\ndabi PLEASE\n\ndabi ths insane man is tryn 2 KILL ME\n\ni take a 5min break 4 lunch n he pops out of th bushes all \"a real hero wouldnt walk away from th job\"\n\ni fall aslp on a park bench n suddnly there he is screamng \"a real hero NEVER SLEEPS\"\n\nHE CANNOT BE REASOND WITH\n\nIF I DIE I WILL HAUNT YOU\n16:10 ✓✓\n\n\nDABI\n16:21 ✓✓\n\n\nOkay okay, Jesus, I'll see what I can do you big baby\n16:24\n\n\n&gt;:(\n16:25 ✓✓\n\n\n \n \n \n \n\nThis Tweet is no longer available because it violated the Twitter Rules. Learn more\n\n3PointsStraightLine @magi123321  · 1d \nReplying to @flapjacks4\nI'm not saying he deserves it but I can't say I'm mad\n\n\n\nFruit Juice(tm) @banananaanananana  · 1d \nReplying to @flapjacks4\nis this what i think it is? because if it is, it's fucking illegal\n\n\n\nnavy gravy @scanthenavyin  · 1d \nBoo fucking hoo it's just a phone number. Grow up.\n\n\nShow replies\n\nT F @bolo__bolo  · 1d \nReplying to @flapjacks4\nholy shit is this real\n\n\n\nFernopilis @heartFern  · 1d \nReplying to @flapjacks4\nLMAO NICE\n\n\n\n \n \n \n \n \n \n\n Koichi\n\nToday\n\n\n\nsome guy is sending nudes to shuttai's blog's email\n02:01\n\n\nHold up. You're in SHUTTAI'S EMAIL?\nRead 02:33\n\nLiterally how. That is a level of skill I did not think you were capable of\nRead 02:33\n\nHey why are you using your newfound powers of evil to look at another dude's junk\nRead 02:33\n\n\nno like, can you help me nuke him from orbit\n02:42\n\n\n\nthey're unsolicited\n02:42\n\n\n\nalso i didn't hack shuttai he gave me the account credentials a while back and i um\n02:42\n\n\n\nchanged the password when the creepy pictures started coming in so he didn't see them, and i havent told him bc i dont want him to freak out but i assume he hasn't tried to log-in otherwise he'd be asking me whats up\n02:42\n\n\nWait wait woah back up WHAT\nRead 02:45\n\nWHAT?\nRead 02:45\n\nHOW\nRead 02:45\n\n\nokay so this might be a good time to tell you that im sort of friends with shuttai i guess?\n02:46\n\n\nSINCE WHEN.\nRead 02:46\n\n\nsince shortly after he got popular\n02:47\n\nwe got to talking when i helped him anonymize the whois for qab but apparently someone somewhere had the results cached or something idk i can't figure out how else they would have gotten his info. maybe he had it up somewhere else, or someone bruteforced the admin login? but i think he'd have gotten an email about it\n02:47\n\nwell, unless they got into his email too and deleted that but i dont think they're in here or more shit would have gone wrong. but also i did change the password immediately, so who knows\n02:48\n\nactually the version of wordpress it's running might be outdated i never checked on it because running wpscan feels like it would be illegal maybe but hm i could just check the version manually and then\n02:48\n\nyou know what it doesn't matter, i helped him out with a thing, he let me set up his discord server, it is a symbiotic relationship between two dudes who have never met irl, dont worry about it\n02:49\n\nalso dont tell anyone\n02:49\n\n\nLITERALLY, WHO WOULD I TELL\nRead 02:50\n\nWHY WOULDN'T YOU TELL ME? GOD YOU'RE SUCH A DOUCHE KOICHI\n\nThe ONE TIME something interesting happens in your boring ass life and you DON'T EVEN TELL ME\nRead 02:50\n\n\nwould u pls calm down and help me destroy this pedo\n02:50\n\nwell pedoS, i think\n02:50\n\n\nI'm sorry WHAT\nRead 02:51\n\n\nyeah i only briefly glanced at them but there are at least two distinctly different dongs, so\n02:51\n\n\nTHE OTHER THING, KOICHI\nRead 02:52\n\n\nwhat other thing?\n02:52\n\n\nHHNNNGGGGG\nRead 02:53\n\n\nOH\n02:53\n\nuh, yeah\n02:53\n\npls dont tell anyone i told you this, but\n02:53\n\nshuttai is a minor\n02:54\n\n\nKOICHI\nRead 02:54\n\n\n \n \n \n \nTominaga Sora\nJuly 20, 20X4, 18:51\nThis didn't go where I was expecting. I sort of thought the hero commission was only there as a limiting agent, an authoritative checks and balances for professional heros. I never considered how much say they have in the overall structure of the entire heroics industry.\n\n\nShuttai\nJuly 20 20X4, 06:05\nSince I'm not part of the industry I'm sure I'm missing a lot of nuance, but even if I'm wrong about the \"why\", problems are being perpetuated because that's the way everyone's always done them. Why change it if it's not broken, right? Hopefully this can help people see where change might not be a bad thing.\n\n\nAmahiro\nJuly 19, 20X4, 17:44\nI hate it when people think they could do better than All Might. If you think so highly of yourself then go on, you become the top ranked hero in japan.\n\n\nkira\nJuly 19 20X4, 20:25\n&lt;3!\n\n\nShuttai\nJuly 20 20X4, 06:05\n&lt;3!!\n\n\nMax\nJuly 20, 20X4, 18:51\nDidn't like this one\n\n\nYagi123\nJuly 22, 20X4, 13:25\nThis article certainly has garnered a lot of attention! And, it seems, plenty of controversy. But I think all any of us can do is to give it our all and to stay honest to ourselves, and you've certianly done that here. This entire article is very well articulated, not to mention beautifully written, and I know All Might himself would shed a tear at the way you portray him. It's always astounding, the amount of impact people can have on each other.\n\nGiven how many comments there are already I'm unsure if you'll see this. But in the case that you do, I wanted to let you know that I found this to be an incredibly thoughtful take on hero society as a whole. You've given me a lot to consider. As a veteran of the industry, it gives me hope that there are young people like you ready to take the reigns.\n\n\nShuttai\nJuly 23, 20X4, 16:12\nOh my gosh, thank you so much!! I only a little ashamed to admit that I cried reading this. I've been really trying not to take the negative comments too personally but it's hard sometimes.\n\nNot to mention, I'm always so worried that since I'm an outsider in heroics I'll end up misunderstanding or misrepresenting things, so it really means a lot to be positively recieved by someone in the industry.\n\nThank you for your service, and I'm so glad you took the time to reach out!\n\n\n \n \n \n \n # freechat\n\n亀 (キン) Today at 16:55\nhello everyone!! i'm new and SUPER EXCITED TO BE HER!!!\n👋 25\n\n亀 (キン) Today at 16:56\n*here 🤦\n\n雷人(Rai) Today at 16:56\nHello and welcome!\n\nbluenoise Today at 16:56\nglad you could join us~ \nwow this server is getting big FAST!\n\n亀 (キン) Today at 16:57\nTHANKS! so okay, I have had a super urgent burning question for EVER! how are we pronouncing the fandom name?\n\ncrawler Today at 16:57\nlol, its a fandom now. this is great, wait until shuttai finds out\n\nbluenoise Today at 16:57\nohhh that is a good question\n\nEngineMan Today at 16:57\nI have wondered this myself! How is everyone else pronouncing QAB? I've been saying each individual letter.\n\ncrawler Today at 16:58\nhonestly, ive never said it out loud\n\nSoho2 Today at 16:58\nMy friend pronounces it like a 2yo who can't pronounce the R in crab\n🤔 3\n\ncrawler Today at 16:58\nthat sounds super dumb, i like it\n\nbluenoise Today at 16:58\n🤣 🤣\n\n雷人(Rai) Today at 16:59\nNo one else is just saying Cab?? \nyou know, like beep beep, here comes the cab??\n\nbluenoise Today at 16:59\n👀\n\nSoho2 Today at 16:59\n&gt; beep beep \nHAHAHAHAHAHAHA\n\nEngineMan Today at 16:59\n........\n\ncrawler Today at 16:55\nLOL \nRAIJIN \nARE YOU HIGH RIGHT NOW\n\n雷人(Rai) Today at 16:59\nNo???\n\ncrawler Today at 17:00\nthen thats EVEN WORSE, I CAN'T BREATHE\n\n \n \n \n \n\ncrawler @TheRealCrawler\n\nofficial announcement: QAB is pronounced cab.\n\n\n\n22:22 · Yesterday · Twitter for PC\n\n12k Retweets and comments 33k Likes\n\nSparky Sparky Boom Man @chargebolt  · 4h \nReplying to @TheRealCrawler\nWhy would you share my shame to the world\n\n\n\n \n \n \n \n \n \nr/QAB\nu/HumanRose · 13h ago \nQuirkless treatment in society?\n\nI'd never thought about it before this week's article, but do quirkless people have it worse than people with useless cosmetic quirks? Functionally they're about the same, so I've always thought society also treated them the same.\n\n\n 819    82\n\n82 Comments sorted by Best \nLogin or sign up to leave a comment\n\n ghosting-517  12h  \nI would kill for an eye color changing quirk or maybe one that made my breath smell like roses. At least then I could find a job.\n\n\n  noburo  10h \n\nI didn't wake up this morning expecting to get sucker punched...\n\nSeriously though, ouch. I feel your pain. Have you tried Hello Work? It sucks that none of it is permanent, but I make enough to pay rent.\n\n ghosting-517 10h  \nI have, but they keep telling me I don't have \"an applicable skill set\". Do you have any tips for getting accepted, or maybe a recommendation for a certification I could get?\n\n5 more replies\n\n\n\n SaffronLief  4h  \nThe treatment not the same at all, but not for the reasons you might think. The problem isn't quirkless discrimination; it's quirk discrimination.\n\nIt use to be leagues more difficult to get a job with a \"villainous\" quirk than with no quirk at all. Up until (relatively) recently, that was still very much the case. And then, about 30 years back, the government changed the way Kojin Bangou[1] were assigned to counter rampant identity fraud.\n\nIn the last 5-10 years as the people with the fraud-proof Kojin Bangou started to enter the workforce, the unfortunate trend of \"quirk fronting\" emerged. In direct response to this, an overwhelming number of individuals with \"villainous\" quirks started identifying as quirkless. Under the old Kojin Bangou system, (or even before the Medical Privacy act,) quirkless status was easy to verify. Under the new governance, verification can take up to three months. And that's not even taking into account the new fees and restrictions with Kojin Bangou related requests.\n\nWhat it boils down to is that employers don't want to hire someone with a \"villainous\" quirk, and if you say you're quirkless they assume you're lying. There's a much higher population of people with \"villainous\" quirks than people who are \"quirkless\", and to this day there's still a lot of quirk fraud happening.\n\nedit: For those of you looking for more info, look up the Sugihara vs Softbank case. The ruling on that case has made it near impossible to hold employers accountable for quirk/quirkless discrimination.\n\n\n  soho2025  2h \n\nYou can inversely lie about having a quirk/fake a different quirk but that's grounds for immediate termination and a fine. Sometimes it's worth it though (speaking from personal experience)\n\n CloudedThoughts 2h  \nI don't know where you're located, but not in Tokyo it's not. If you're caught, you get entered into an internal database all major companies in Japan (and the majority of companies in Tokyo/Osaka) pull from. On the other hand, if you're working for a small, privately owned business, it's real easy to get away with saying you have something that's harder to verify, like an analysis quirk. Wonder how long it'll take them to catch on to that trend and the analytical quirked people are pulled down to our level...\n\n 5w4nn  2h \n\nThere's no way an employer can legally force you to show your quirk during an interview, but I lost a job opportunity because I wasn't willing to show off my quirk and the guy after me was. The system is wack.\n\n\nSee replies\n\n\n\n infinitetails  3h  \nI have a cousin with a \"villainous quirk\" and now I'm wondering if I shouldn't ask her if she wants to get an apartment together for college. If you guys are right, she's going to have a hell of a time getting a landlord to let her sign a lease.\n\n\n Kouseikoukousei 3h \n\nIf that's an option, absolutely do it. I ended up couch surfing for a year after high school for this very reason.\n\n\n\nSee replies\n\nVIEW ALL 82 COMMENTS\n \n \n \n \n # curry\n\nsaffron Today at 20:52\nI'm in Ueno and there's a guy getting mugged, what do I do \nI think he just pulled a knife\n\nbluenoise Today at 20:52\nno heroes around?? \nhave you tried calling the police??\n\nShuttai Today at 20:52\nAgreed, call police first \nWe can see if we have any helpers in the area, but we shouldn't forget about official channels\n\nsaffron Today at 20:52\nNo heroes, calling 110[2] now\n\nSoho2 Today at 20:52\nPolice response time on average is 20min in that area, and police don't have weapons\n\nShuttai Today at 20:52\nAssembling passive taskforce @helpers @taito-ku @ueno @okachimachi @toudai @yushima \nWe can't just ignore someone in front of us who needs help. If we can get someone over there now, we can help \n@saffron get us a pin of your location\n\nbluenoise Today at 20:52\num should we really be doing this?\n\nSoho2 Today at 20:52\nY'all got caught last week because you used quirks.\n\nShuttai Today at 20:52\nSoho-san is right. \nWe don't need to fight or use quirks or do anything illegal, we just need to make a show of force large enough that the perpetrators rethink what they're doing\n\nZ-e-D Today at 20:52\nI'm at Karaoke-kan, got about 10 people and we're headed downstairs now\n👍 20\n\n♥Shurui♥ Today at 20:52\nJust leaving the museum in Ueno park, where is this happening? We can run over too.\n👍 21\n\nsaffron Today at 20:52\n\n    Screenshot_20x40726-205214_GoogleMaps.jpg - 731 kB\nRia Today at 20:52\nI'm at the station mall a few blocks from there, dragging my friends now\n👍 21\n\nShuttai Today at 20:52\nActivated helpers, don't wait for each other, but do wait until you have a group of at least three. Don't get too close, just let the mugger know he's being watched.\n🫡 7 🍀 106\n\nSoho2 Today at 20:52\nHeckle from afar\n\nShuttai Today at 20:52\n^ That.\n\n \n \n \n \n\n\n\n \n \nSir Nighteye  \n\n\n\nVigilante Flash Mob in\n\nDown Town Tokyo\n\nyap.news \n\n\nWas this Q.A.B.'s doing?\n\n\nYesterday, 13:14\n\n\n1 unread messages\n\n\nwhat?\n\ny wud i kno that??\n\n\n1:03\n ✓ \n\nPlease just answer the question, Hawks.\n\n\n5:42\n\n\n1\n\nim not hawks\n\n2\n\nif i WERE ydu thnk id hav time 2 read news artcls\n\n3\n\n7:47\n ✓\n\nHawks, stop being obtuse.\n\n\n7:47\n\n\nhbu do ur job URSELF\n\n 7:47\n ✓\n\nAs there was no confirmed quirk usage involved there are no legal grounds for my agency to get involved.\n\nHowever. If we were to receive outside information, such as a tip, from a reliable source, such as a Pro Hero...\n\nI think you see where I'm going with this.\n\n\n7:49\n\n\nur legt th most annoyng persn i kno n thts incldng th stalkr who tried 2 murdr me all week\n\nconsidr gettng a life\n\n\n7:55\n ✓ \n\nIf you think acting ignorant will save you or that it can somehow ease the culpability you bear, you are sorely mistaken.\n\n\n8:21\n\n\n \n \n \n \nI don't know who you think this is, but I don't appreciate receiving these pictures. Please stop sending them.\n\n \n \n \n \n # curry\n\nNotJesus Today at 22:14\nHey everyone not to bother you but I think I'm being followed?\n\n雷人(Rai) Today at 22:14\nOMG YOU'RE REAL. IN THE ENTIRE MONTH IVE BEEN HERE I'VE NEVER BEEN ONLINE AT THE SAME TIME AS YOU\n\ncrawler Today at 22:15\n\"followed\", can't be followed if you don't have a twitter\n\nNotJesus Today at 22:15\nNo I mean like, right now? In person? There's this guy\n\ncrawler Today at 22:15\nare you being serious right now? where are you \nwait don't answer that, shit you could um\n\nbluenoise Today at 22:16\nCall the police??\n\nNotJesus Today at 22:17\nThat's the thing, he hasn't really done anything yet? And I don't want to make him uncomfortable just because I think he's acting, like. A little creepy.\n\nNotHawks Today at 22:17\ncreepy how? \nwld u be comfy dming me r crawler ur loc? crawlers rite, dt say anythn 2 revealng n publc cht\n\ncrawler Today at 22:15\ni can't take this right now i am so sorry, im dealing with a bit of a situation myself \nhawks, you got this?\n\nNotHawks Today at 22:18\n👍\n@NotJesus u stil there?\n\nNotJesus Today at 22:20\nYeah I'm still here, I'm just \nEmbarrassed I guess, I feel like I'm over-reacting.\n\nNotHawks Today at 22:20\ndt evn wry abt it can i dm u?\n\nNotJesus Today at 22:20\nOf course, I'll friend you?\n\n \n \n \n \n @ Shuttai\n\nShuttai\nThis is the beginning of your direct message history with Shuttai.\n \nJul 31, 20X4\n \nhawks_unofficial Today at 22:21\nhi shuttai \nare you safe right now?\n\nShuttai Today at 22:23\nYeah, I'm fine, really, you don't need to worry about me. I don't even see him anymore, I feel really silly. I'm sorry for wasting your time!\n\nhawks_unofficial Today at 22:23\nits not a waste at all pls dont wry about it. its pretty late right now are you in a public place?\n\nShuttai Today at 22:23\nnot really, I guess? I'm walking to the station, the street is pretty empty.\n\nhawks_unofficial Today at 22:24\nis there a 24h conbini nearby? \nmaybe a net cafe? anything u could duck into to be seen by other people\n\nShuttai Today at 22:27\nI don't see one, but I don't want to miss the last train. \nI was probably just freaking out over nothing.\n\nhawks_unofficial Today at 22:27\nwhen our instincts tell us we're unsafe theres a REASON we feel unsafe \ndont feel bad about your brain telling you theres something wrong \nid rather you miss the last train and be safe than... not that \ni can come pick you up or pay 4 a cab or smth if thats a pblm\n\nShuttai Today at 22:30\nI mean, yeah, I just \nI worry a lot anyway? It's kind of a problem. I have meds. I'm sure it was nothing?\n\nhawks_unofficial Today at 22:30\nis there even a tiny percentage of you that still feels like youre in danger?\n\nShuttai Today at 22:30\nSort of. I guess. But I don't want to cause anyone any trouble.\n\nhawks_unofficial Today at 22:30\ncan you use your phones gps to find the closest conbini?\n\nShuttai Today at 22:30\nYeah, I'll \nYeah okay\n\nhawks_unofficial Today at 22:31\nkeep walking as you look. doesnt matter where just make yourself look busy\n\nShuttai Today at 22:33\nOkay \nThere's a 24/7 7-11 a few blocks from here \nI can sta \nSomeone's behind me\n\nhawks_unofficial Today at 22:34\ndid they notice u? \ndont look at them if they didnt \ncalm down breathe try not to act any differently \ni need you 2 send me your location \nif it sounds like theyre getting any closer i need you to run \ncan you do that for me? \nshuttai? \nare u still there? \ni cant help you if i dont know where you are \nplease respond \n\nShuttai Today at 22:40\n\n     Screenshot_20X40731-21101_Maps.jpg - 894 kB\n \n \n \n \n  +81XXXXXXXXX\nThis message is from an unsaved number. Beware of smishing and phishing. \nBlock number\nToday · 22:35\n\nhi this is a friend of dabis and i need a favor\n\nits urgent\n\npls be awake\n\ni'll owe you one\n\n\nWould you happen to be a friend of the avian variety?\n\n22:46 · SMS\n\nuh\n\n\nwell yes\n\n\nwait does he tlk abt me\n\n\n\"Dabi's Bird Friend\" added to contacts\n \n \n \n \n \n \n \n\n22:54\nTuesday, July 31\n\nPHONE now\n\n\nMom\nMissed call\n\n\nMESSAGES 6m ago\n\n\nMom\nWhere are you? Please call me back.\n\n\nMESSAGES 10m ago\n\n\nMom\nMissed call\n\n\nPHONE 30m ago\n\n\nMom\nMissed call\n\n\nMESSAGES 1h ago\n\n\nMom\nDo you want me to pick up some gyoza?\n\n \nSwipe up to open \n \n \n \n \n \n \n \n \n \n \n\n\n\n \n \nFUKUOKA DEPARTMENT OF PUBLIC SAFETY\nTRANSCRIPT \n\n \n \n \n \ntextbook daddy issues\n\n\ndabi hes a baby im cryng\n 01:03\n✓✓\n\n\nWho's a baby\n\nWhy do you have a baby\n01:05\n\n\n\nhes so small my heart cnt take it\n01:05\n✓✓\n\n\nWhy would anyone let you have a baby where are you\n01:05\n\n\n\nchiba\n01:05\n✓✓\n\n\nWhy are you in Chiba??\n01:05\n\n\n\nbaby had a stalkr i thought id swoop in n imprss my new celebrty crush but my new celebrty crush is a b ABY dabi i cant\n\nhes so soft\n01:07\n✓✓\n\n\nIs this about shuttai again\n01:07\n\n\n\nyes\n01:07\n✓✓\n\n\nI'm muting you\n01:07\n\n\n\n \n \n \n \n\n Koichi\n\nToday\n\n\n\nNOTHAWKS IS HAWKS\nRead 2:31\n\n\nizuku i am so sorry i was tied up, are you okay? what happened\n2:35\n\n\noh, yes, I'm fine, it's just I can'\nRead 2:35\n\ni va\nRead 2:35\n\nI can't\nRead 2:35\n\nHAWKS\nRead 2:35\n\n\nyes? did you not\n2:35\n\ndid you not know?\n2:36\n\nwhy else would you think i'd let him go after you??\n2:36\n\n\nHAWKS\nRead 2:36\n\nADFLKJSDAJLDSF\nRead 2:36\n\n\n \n \n \n \n # bird-watching\n\n25+ new message since August 1, 20X4 \nAhhhh! Raptor! Yesterday at 05:45\nHawks is in Yokohama??\n\nRed Yesterday at 05:45\n👀\n\nzzzz Yesterday at 05:45\nPics?\n\nNata Yesterday at 05:46\npics or it didn't happen\n\ndylusional Yesterday at 05:47\n@Ahhhh! Raptor! why are you up this early??\n\nNata Yesterday at 05:47\nwhy are any of us up this early\n👆 4 😂 4\n\nAhhhh! Raptor! Yesterday at 05:49\nI have a job interview and stopped by a Lawson to get a coffee and Hawks is just right there\n\nNata Yesterday at 05:49\nhe can't be there, he's in fukuoka \nit's probably just a blond lookalike\n\nAhhhh! Raptor! Yesterday at 05:49\nHe has a hat on but didn't do anything about his wings, it's definitely him\n\nzzzz Yesterday at 05:49\nPics!!!\n\ndylusional Yesterday at 05:50\nlmao it's so cute how he thinks he's sneaky\n\nAhhhh! Raptor! Yesterday at 05:53\nOh shit he's gone \nI was gonna ask him to sign my bag \nHe turned into an alley and just poof\n\nNata Yesterday at 05:53\nprobably flew away rip\n\nAhhhh! Raptor! Yesterday at 05:54\nYeah :(\n\n \nAug 02, 20X4\n \nHawksalicious Today at 10:12\nWait Hawks was in Yokohama?? \nWhy didn't anyone tell me 😭😭😭\n\ndylusional Today at 10:14\n😔 \nyou'll get him next time!\n\n \n \n \n \n\nThe Amazing Mei @inventorextrodinaire\n\nI haven't seen QAB update all week. Anyone know what's up with that?\n\n23:10 · 5 Aug · Twitter for PC\n\n68 Retweets and comments 77 Likes\n\n \n \n \n \n \n \nr/QAB\ngotscratchedbybearpaws13 · 1 day ago \n Where's the weekly quirk analysis?\n\n\n 4    6\n\n6 Comments sorted by Best \nLogin or sign up to leave a comment\n RevEngineManRev  18h... \nThis has already been answered on the weekly sticky, here.\n\n\n CloudedThoughts  20h... \nDuplicate post\n\n\n[deleted]  20h... \n[removed] \n \n\n2 more replies\n\n\n \n \n \n \n @ crawler\n\n \nAug 5, 20X4\n \nNEW MESSAGES \n \ncrawler Today at 20:24\ni looked into that guy like you asked \ni dont think hes the only one, and i dont think he was the ring leader\n\nhawks_unofficial Today at 20:51\n:///\n\ncrawler Today at 21:15\ni DO think i just managed to get an accurate geolocation data based on their IP and uh some other stuff\n\nhawks_unofficial Today at 20:51\noh??\n\ncrawler Today at 21:17\nid rather not get into it\n\nhawks_unofficial Today at 21:19\nlol no idc abt that i want names \nn if u cant get me names i want locations\n\ncrawler Today at 21:25\nthat i can do \ngive me an hour\n\nhawks_unofficial Today at 21:26\n👍\n\ncrawler Today at 22:13\n\n     chiba-case.zip - 2.4MB\nhawks_unofficial Today at 22:27\nhey do u want a job\n\ncrawler Today at 22:30\nuhh?? \nill take it under consideration after ive graduated? \nif you're being serious \nand the offer still stands\n\nhawks_unofficial Today at 22:34\n👍👍\n\n \n \n \n \n \n \n \n \nr/anxiety\nthrowaway20X40803 · 2 days ago \n Looking for tips to deal with elevated anxiety\n\n\nI had a close call with a villain just over a week ago. In the end it was fine, nothing really happened. The hero even escorted me home. I was fine the first day, but ever since then I can't stop thinking about \"what if\". I should have known it was coming, I should have reacted faster, been less stupid, but I wasn't and it turned out fine anyway. But what if it hadn't? What if that hero hadn't been there? I've always been a kind of anxious person, but never like this. I can't eat, I can't sleep, My chest hurts, and I feel like I'm constantly on the verge of a panic attack. Is there anything I can do to stop feeling like this? None of my normal coping techniques are working.\n\n\n 25    17\n\n17 Comments sorted by Best \nLogin or sign up to leave a comment\n\n __Maroon__  2d  \nIf you don't mind me asking, it might help to get some more context on the incident?\n\nDon't at all feel like you have to answer this, though. Villains do bad things all the time, and you can't blame yourself for what you can't control.\n\n\n throwaway20X40803 2d \n\nI maybe should have put more info in my original post, but I didn't know how to put it into words and not feel pathetic. I have a bit of an (anonymous) online presence, but I guess I wasn't so careful after all because the guy who came after me figured out who I was in real life and he had been following me around for at least a few days. I kept seeing him hanging out in front of my school, but I didn't think anything of it even when he gave me the creeps.\n\n Mousegirl27 2d  \nHey, sorry to hijack, but I went through something very similar a few years back. I was stalked for almost 6 months and spend most of that time telling myself it was all in my head. Some really bad things happened because of it, and I spent a long time thinking that if only I had noticed or behaved differently or talked to someone sooner, I could have prevented it. I felt like it was it was my fault. It wasn't. This isn't your fault.\n\nThe best thing I could do for myself was accept that it happened, that it sucked, try to learn from the experience, and to move on. Don't feel bad if you can't move on right away, it took me over a year to get past the worst of it.\n\n1 more reply\n\n\n\n remyschnitzel  2d  \nHey, sorry you're going through this. I find “box breathing” to be particularly helpful when nothing else seems to calm me down.\n\nSlowly inhale on a count to four (I find through the nose most effective but breathing through the mouth will do you no harm - just keep it slow).\nHold the breath for a count to 4\nExhale for a count to 4\nHold the empty lungs for a count to 4.\n\nRepeat until your anxiety eases or your breathing resumes a normal rhythm.\n\n\n MoMoDragon 2d  \nIt takes a few minutes, but this helps me as well.\n\n1 more reply\n\n Towel_Dowel  2d... \nIf it's an option, I really suggest looking into getting a therapist. Don't be embarrassed about getting help.\n\n\nVIEW ALL 17 COMMENTS\n \n \n \n \n Hero★NEWS\n \nStain Still at Large! Public Faith in the Hero Commission on the Decline?!  \nBY HARA MARI\n\nLast Sunday, the feared Hero Killer: Stain attacked a top ranking hero in broad daylight. Witnesses say it was a harrowing experience, but we talked to the hero in question in an EXCLUSIVE interview. The Wing Hero: Hawks, famous for his unbeatable speeds and his spotless rescue record, says the encounter wasn't \"[...] that big of a deal.\"\n\n\"I wouldn't really say I was afaid for my life,\" Hawks told us after the murder attempt. \"But man! That Stain fellow is a slippery guy, huh?\"\n\nWhile we're glad Hawks seems to be doing well following this harrowing experience, the same cannot be said for Onemu Shinya, who lost an arm in her recent encounter with Stain. Public outcry demanding Stain be taken into custody has reached an all-time peak, and\n\nRead More\n \n \n \n \n \n \n  🔥 Dabi 🔥\nToday · 14:13\n\nAre you really okay with this?\n\ni'll get to see ochako-chan again, so yeah!! 🥰🥰😍💘💝💞\n\nThis isn't the sort of thing Stain would want us to be doing\n\nbut what about what shigaraki said, about \"stopping the problem at the source\"?\n\nMost heroes are bad but not all\nWith all might teaching these brats might there be a better chance for them to turn out righteous? Shouldn't we give them the chance to succeed or fail by their own merit on their own time?\n\ni can't really follow you when you get all philosophical sorry :/\nmaybe talk to Spinner?? 🤔🤔\n\nUgh\nOk\n\nyou both like stain so much i don't understand why you don't get along better!! 😤🙄😩\n\nu\ng\nh\n\n\n \n \n \n \n\n\n\n \n \n  Kaminari Denki\nFriday, Jul 16 • 18:21\n\n\nTodoroki\n\nYou passed\n\nFinals, right\n\n?\n\n\nYes.\n\n?\n\n\nI humbly request that you assist me in my studies for the remedial exam. 🙏 🙏\n\n\nNo.\n\n\nPLEASE.\n\n\n \nSaturday, Jul 17 • 9:45\n \nSunday, Jul 18 • 12:29\n\n\nPLEASE 🙏 🙏 🙏\n\n\n \nMonday, Jul 19 • 7:02\n\n\nNo\n\n\n \nTuesday, Jul 20 • 15:40\n\n\nplease\n\n😭\n\n\n \nWednesday, Jul 21 • 7:12\n\n\nDoes this Saturday work\n\n\n:DDDDD\n\n\n \nSaturday, Jul 24 • 12:00\n\n\nWhere are you.\n\n\nJumped on a curry case on the way over, should wrap up soon\n\n\nOkay.\n\n\n \nWednesday, Jul 28 • 18:55\n \nSunday, Aug 7 • 8:14\n\n\nDo you know what's going on with the QAB hiatus?\n\n\nYeah, Crawler told me Shuttai is in the middle of moving and is busy with irl stuff\n\nWAIT OH CRAP\n\nI WASN'T SUPPOSE TO TELL ANYONE THAT\n\nOh god how do I delete messages\n\n\nI won't tell anyone else, but you should be more careful with other people's secrets.\n\nNone the less, thank you for informing me. I was becoming worried for Shuttai-san's health.\n\n\nOkay whew, crisis averted, texts deleted\n\n\nYou do know that deleting a text message doesn't delete it from my phone, right.\n\n\nAre you lying to me right now??\n\n\n \nMonday, Aug 8 • 10:20\n\n\nIs Aizawa-sensei making you bring your text book on the trip??\n\n\nNo.\n\n\n???? This is SO UNFAIR\n\n\nYou're the one who failed finals.\n\n\nSHUT UP\n\n\n \n \n \n \n\n Aizawa S.\n\nMon, Aug 9, 20X4\n\n\nyou sure you don't need me to come with you and Sekijiro-kun? I told you, I can rearrange my schedule\n\nRead\n8:03\n\nThat's unnecessary.\n\n10:24\nWe've taken care to hide the location, and the Pussycats will be there.\n\n10:24\nHow much trouble can they get into.\n\n10:24\n\n\n \n \n \n \n \n \n \n \nDabi\nTue, Aug 10, 20X4\n\n\nKeep an eye on that Musculature asshole\n\n\nI don't trust him\nTue 16:15\n\n\naye aye, squad leader sir\nTue 16:31 ✓✓\n\n\nI can and WILL whoop your ass, lizard boy\nTue 16:38\n\n\n(◔_◔)\nTue 16:40 ✓\n\n\n \n \n \n \n \n \n  Inko\nWednesday · 17:54\n\n\nIzuku and I made too much for dinner. We'll be stopping by to drop some off, if you're hungry.\n\nIf not, we're always happy to just sit with you.\n\n\nI appreciate the thought, however, I'm not sure I'm the best company right now.\n\n\nThat doesn't matter\n\nYou're my friend and Izuku and I are both worried sick and at least we can all worry together\n\n\nOkay\n\nGive me 20 minutes to clean myself up\n\n\n \n \n \n \n\n ☙Ochako❧\n \n \n \n \n # curry\n\nShouto Today at 21:00\nHello all. I apologize if this is a misuse of this chatroom but I have problem I thought I'd ask about.\n\nSaffron Today at 21:00\nno problem is too big or too small for the curry chat! lay it on us.\n\nShouto Today at 21:00\nMy classmate has been kidnapped by villains\n\nSaffron Today at 21:01\nassuming you're not trolling us, that DEFINITELY sounds like a job for pro heroes.\n\nShouto Today at 21:01\nI believe they have discovered his location, but they're waiting because they don't have a warrant. \nI was under the impression this channel was focused on helping people without relying on heroes?\n\ngho5ting Today at 21:03\ntroll??\n\n \n \n \n \n @ 雷人\n\n \nAug 12, 20X4\n \ncrawler Today at 21:02\nhey, is shouto serious, did your classmate for real get kidnapped\n\n雷人 Today at 21:05\nYeah \nIt's pretty crazy rn none of us are handling it very well \nWhy are you talking to shouto about it?\n\ncrawler Today at 21:05\nhe brought it up in the curry chat\n\n雷人 Today at 21:07\n???\nWhat the ACTUAL hell\nDudes a cryptid I swear\n\n \n \n \n \n # curry\n\nShouto Today at 21:01\nI believe they have discovered his location, but they're waiting because they don't have a warrant. \nI was under the impression this channel was focused on helping people without relying on heroes?\n\ngho5ting Today at 21:03\ntroll??\n\ncrawler Today at 21:05\nnah this dude wouldn't know a joke if it dressed up like a pinata \n@Shouto ive confirmed the kidnapping. would you be able to give us the location?\n\nShouto Today at 21:05\nI'll ask.\n\ngho5ting Today at 21:06\nare you telling me this is seriously legit??\n\nShouto Today at 21:12\n\n     9922314562.pdf  - 2.4MB\n雷人(Rai) Today at 21:12\nWhere did you GET THAT\n\ncrawler Today at 21:12\nokay that looks like it's in kamino ward. \n@kamino-ku @helpers is there anyone near kamino ward, or anyone who knows the area well? we've got a kidnapping\n@Shouto do you know the perps?\n\nShouto Today at 21:13\n@雷人(Rai) that police officer left his computer unlocked. \n@crawler Yes, it's the League of Villains. The same group that launched an attack against UA students in April.\n\ngho5ting Today at 21:13\nthis is INSANE this is way out of our league\n\nSoho2 Today at 21:13\nLol. League.\n\ngho5ting Today at 21:13\ni'm being serious. we can't handle this\n\nSaffron Today at 21:13\nthe whole point of curry is that we TRY to handle this. we're building the safety net that society is blind to bc heroes exist.\n\nstereoSimple Today at 21:14\nI know the place. I deliver pizza there a few times a week. Creepy flaky dude, needs chapstick stat?\n\nShouto Today at 21:14\nYes. That sounds like Shigaraki Tomura.\n\nstereoSimple Today at 21:14\nI can let you know if they call for a pizza, but otherwise idk how much good I can do\n\nShuttai Today at 21:14\nNo that's perfect! It means you know the area.\n\ncrawler Today at 21:14\noh thank god you're here\n\n雷人(Rai) Today at 21:14\nYou are 100% GOING TO MAKE ME RELIGIOUS, DUDE\n\nSaffron Today at 21:14\nQUIRK JESUS, thank christ\n\ngho5ting Today at 21:14\nthank the actual lord!!\n\nShuttai Today at 21:15\nDoesn't @5w4nn have a permeability quirk? \n(Seriously guys, cut out the Jesus stuff!!)\n\ncrawler Today at 21:15\nill see if i can get them\n\nShuttai Today at 21:15\nWhat about @coTTon? With that transmutable invisibility quirk\n\ncoTTon Today at 21:16\nhello someone pinged me?\nOMG THATS ME \nHELLO QUIRK JESUS COTTON REPORTING FOR DUTY 🫡\n\nShuttai Today at 21:16\n🫡\n\ncrawler Today at 21:17\ni know a \"hero\" in the area with a good quirk for quick getaways\n\nShuttai Today at 21:17\nBy \"hero\" do you mean illegal vigilante\n\ncrawler Today at 21:17\ni will neither confirm nor deny your baseless accusations\n\nShuttai Today at 21:19\nOkay that's 4, I think one more would be enough. \nSomeone with a quirk that's good for reconnaissance, like seeing through walls, or some sort of foresight... \nDo we have anyone like that?\n\nShouto Today at 21:20\nI have a classmate with increased hearing ability, I can see if she's willing to help\n\nShuttai Today at 21:20\nDo that, we'll keep searching on this end.\n\ncrawler Today at 21:20\nmeanwhile let's move this discussion off main\n🫡 5 🍀 34\n\n \n \n \n \n\nRE: Fwd: Operation: Extract explosive high school boy from villain hideout    Inbox  \n\nI THOUGHT YOU WERE JOKING\n\nTodoroki. I say this with love and respect. This is insane.\n\n \n \n\nPerhaps. Will you help us? Shuttai-san says our chances of success are 85% with you and 70% without.\n\n \n \n \n \n \n \n\n Midoriya\n \n \n \n \n  Kaminari Denki\nToday · 21:23\n\n\nI want in. I can short out the power to the building in case you guys need a distraction.\n\n\nShuttai-san says that raises our chances of success to 95%.\n\nWelcome to the extraction team.\n\n\n \n \n \n \n \n \n  Todoroki-kun\nToday · 21:41\n\n\nCould I get you to make me a few canisters of sleeping gas? Just in case.\n\n\nWhat???\n\n\nJust in case of what????\n\n\n \n \n \n \n \n \n \n\n22:02\nThursday, August 12\n \n \n \n \n \n \n \n \n \n \n \nSwipe up to open \n \n \n \n \n \n \n  Birdbrain\n \n \n \n \n \n\n22:48\nThursday, August 12\n \n \n \n \n \n \n \n \n \n \n \nSwipe up to open \n \n \n \n \n \n \n \n\n23:15\nThursday, August 12\n\nMESSAGES 5m ago\n\n\nMom\nIzuku, I can hear you still up. Go to bed.\n\n \n \n \n \n \n \n \nSwipe up to open \n \n \n \n \n \n \n \n\n23:34\nThursday, August 12\n \n \n \n \n \n \n \n \n \n \n \nSwipe up to open \n \n \n \n \n \n \n # curry\n\nShuttai Today at 23:37\nDoes ANYONE have eyes or ears on the extraction team? they've gone dark for me\n\nbluenoise Today at 23:37\n@coTTon isn't answering her phone either \ndo you want me to DM you if we hear anything? you could mute the server and get some air\n\nShuttai Today at 23:37\nThank you but I'm fine. I need to be here.\n\nbluenoise Today at 23:37\nfair\n\nSoho2 Today at 23:39\n@Shuttai Kamino right?\n\nShuttai Today at 23:39\n@Soho2 yeah\n\nSoho2 Today at 23:40\nI'm in the area I can swing by and check it out \nI'm sure they're fine the LOV are weakass pushovers\n\n \n \n \n \n\n Group (4)\n\nToday\n\n\n23:35\nt shouto invited you to a group.\n\n\n23:40\nDiscountPikachu joined the group\n\n\nt shouto\n@DiscountPikachu Is that Stain?  23:40\n\n\nWHAT THE HELL ARE YOU DOING, TEXTING ME RIGHT NOW\n\nRead 3  23:40\n\nt shouto\n\nWanted to know if that guy was Stain\n 23:42\n\nYaoyorozu M.\n\nthis is highly dangerous, please be quiet!!\n 23:43\n\nJJJirou\n\nDENKI, ISTG IS THAT STAIN OR NOT\n 23:43\n\n\nSTOP YELLING AT ME, YES ITS STAIN\n\nRead 3  23:44\n\nPROBABLY\n\nRead 3  23:44\n\nYaoyorozu M.\n\n\"probably\"???\n 23:45\nYaoyorozu M.\n\nDenki-kun, that is not very reassuring\n 23:45\n\n\nIM TOO SCARED TO LOOK DIRECTLY AT HIM OKAY\n\nRead 1  23:47\n\n\n \n \n \n \n\n Koichi\n \n \n \n \n\n \"PROBABLY\" HE SAYS (4)\n\nJJJirou\n\nDENKI WHO THE HELL IS THAT\n 23:56\n\nDiscountPikachu\n\nHOW THE HELL AM I SUPPOSE TO KNOW??\n 23:58\n\n\nStains father?\n\nRead 3  23:59\n\nYaoyorozu M.\n\nUm, that's very unlikely\n 23:59\n\n\n \n\nToday\n\n\n\nEstranged lover?\n\nRead 3  0:00\n\nDiscountPikachu\n\nDEFINITELY not. Todoroki, what??\n 0:02\nDiscountPikachu\n\n\"it's thanks to you that I found my path\", what is he talking about??\n 0:05\n\nJJJirou\n\nwhat is happening\n 0:07\n\n\nStain's martial arts instructor?\n\nRead 2  0:07\n\nYaoyorozu M.\n\nStop moving!! He's looking in your direction!!!\n 0:09\n\n\n \n \n \n \nthe man behind the slaughter?? 🤔\n\n\nWho tf is knuckle duster\n0:12\n\n\n??\n\nuh\n\nidk\n0:15 ✓✓\n\n\nThen what good are you\n0:15\n\n\no u c h\n\ni cn look him up??\n0:15 ✓✓\n\n\nNah I'll figure it out\n0:15\n\n\nok gl ig\n0:15 ✓\n\n\n \n \n \n \n # curry\n\nShuttai Today at 0:15\nANYthing???\n\nbluenoise Today at 0:15\nnothing, sorry\n\nShuttai Today at 0:16\n@Soho2 I know I told you not to go but did you find anything out??\n\nSaffron Today at 0:19\nHope he's not dead\n\ngho5ting Today at 0:21\ndoes anyone even know him that well? could he just be faking for the attention?\n👎 31\n\n \n \n \n \n \n \n\n \"PROBABLY\" HE SAYS (4)\n\nJJJirou\n\noh god is that the fire dude from the training camp\n 0:16\nJJJirou\n\nthe one who took bakugou\n 0:16\n\n\nWe're DEAD\n\nRead 3  0:16\n\nwe're ALL DEAD\n\nRead 3  0:16\n\n\n\n0:16DiscountPikachu changed the group's name to \"RIP except no pieces\".\n\n\n\nt shouto\nI think I can take him.\n 0:18\n\nYaoyorozu M.\nTodoroki NO\n 0:20\n\n\n \n \n \n \n\n Koichi\n\nToday\n\n \n \n \n \n\n RIP except no pieces (4)\n\nJJJirou\n\nthe hell is that noise\n 0:25\n\nYaoyorozu M.\n\nBakugou's waking up!!\n 0:25\n\nDiscountPikachu\n\nWell UNwake him up!!\n 0:25\n\n\nJust let him go after Stain. If he manages it, we win\n\nRead 2  0:25\n\nIf he doesn't and Stain paralyzes him, we still win\n\nRead 2  0:25\n\nYaoyorozu M.\n\nTODOROKI. NO.\n 0:25\n\n\n \n \n \n \n \n \n \n\n0:31\nFriday, August 13\n\nMESSAGES 1m ago\n\n\n88888\nPublicAlerts: Police activity near north Kamino ward. Stay indoors. To report anything unusual call 110. Reply with YES to confirm receipt.\n\n \n \n \n \n \n \nSwipe up to open \n \n \n \n \n \n \n  Yaoyorozu Momo\nToday · 0:52\n\n\nNEVER invite me to anything ever again.\n\n\nYou invited yourself.\n\n\nYou talk like I don't have your sister's number\n\n\nPlease don't tell my sister.\n\n🙏\n\n\nWho even ARE you\n\n\n \n \n \n \n \n \n\n DiscountPikachu\n\nthat was fun, we should do it again sometime\n\nRead\n0:55\n\nHaha\n\n0:56\nYeah\n\n0:56\n\n\n \n \n \n \n \n \n  Todoroki 🙏\nToday · 0:56\n\n\n\n\nAre all women INSANE\n\n\nThat was the conclusion I drew as well.\n\n\n \n \n \n \n \n \n\n Koichi\n\nToday\n\n\nKOICHI WHAT IS GOING ON\n\nRead\n0:35\nEXPLOSION IN KAMINO?? THAT'S GOT TO BE YOU GUYS. WHAT IS HAPPENING\n\nRead\n0:36\nI'm sorry I yelled, please be okay.\n\nRead\n0:45\n\nso im very sorry but\n\n1:20\nstain knows who you are now\n\n1:20\nnot like KNOWS YOU knows you, your life isnt in danger probably but uh. yeah. sorry\n\n1:20\n\n\n\nKoichi you're my friend and I'm super glad you're not dead.\n\nRead\n1:22\nBut that is not what you LEAD WITH when I've been spending the last TWO HOURS convinced you and Shouto and all of those other people from the server and my childhood friend/bully/nemesis are DEAD\n\nRead\n1:22\nHOW is Stain involved and is Katsuki okay\n\nRead\n1:22\n\n\nAnd is everyone else okay?? are you okay????\n\nRead\n1:22\n\nslightly related, im going to need you to autograph something in exchange for my life debt\n\n1:22\n\n\nim fine, everyone's fine\n\n1:22\n\nyour childhood nemesis/best friend is also fine\n\n1:22\nwell, unconscious. we had to knock him out\n\n1:22\ntwice\n\n1:22\nbut fine\n\n1:23\n\n\n\n...\nRead1:25\n\n\nYeah. That figures.\n\nRead\n1:25\n\nSuper glad everyone is alright though you have no idea\n\nRead\n1:25\n\nOkay back to the other thing. What's was that about Stain??\n\nRead\n1:25\n\n\n \n \n \n \n\n\n\n \n \nfrankenstein, but hot\n\n\non a scale frm 1 to ff24 has been delayed agn how mad was he\n07:02 ✓✓\n\n\nIt was like an egg in a microwave\n\nFucking amazing\n11:21\n\n\nsmtms ur history concrns me\n\nwho the hell actly puts an egg in a microwav\n11:40 ✓✓\n\n\nWho doesn't is a much better question\n\nIt's a right of passage\n\nThis is why you're so boring\n11:42\n\n\n??? u gotta CLEAN IT UP aftrwrd no thx u psycho\n11:42 ✓✓\n\n\nWho said anything about cleaning\n\nYou don't use your own microwave\n11:42\n\n\n???????\n\nu disgust me\n\nths is y ur a wantd crimnial\n\nu literal heathen\n\nwhtev ddi u get pics or not u kno thts the onyl reasn im in ur dms\n11:43 ✓✓\n\n\nWho do you think I am? Your boring ass hero coworkers?\n11:43\n\n\n\n \n \n \n \nJuzo News\nHeroes keeping secrets!? UA Boy Returned! \nBY TOKUDA TANEO\n\nUA has issued a public statement that the first year student harrowingly kidnapped by villains last week has been returned, unharmed, to his family. Principal Nedzu refused to answer any questions about the extraction, nor as to the current status of the kidnappers.\n\nHe did however, state \"The student in question has returned to us [...] energetic and unharmed. He will, of course, be put through a two month mandatory counseling for this traumatic experience.\"\n\nThe mouse principal of UA has been media shy ever since May, when\n\nRead Full Story\n \n \n \n \n\nGarter Song @gartersong133\n\nAnyone know if that pizza place in Kamino plans to rebuild? Place was never great, but it wasn't an actual hazard to life and it was the only place open when I got out of classes :/\n\n15:16 · 17 Aug · Twitter for iPhone\n\n10 Retweets and comments 25 Likes\n\n \n \n \n \n \n \n \n \n \n \n \n \n\nHave you seen this?     Inbox  \n\nquirkanalysisblog.com/articles/how-the-ua-sports-festival-led-to-the-kidnapping-of\n\n\n-- \nNedzu :) \nUA High Principal \n+81 08-XXXX-XXXX | https://ua-yuuei.jp/learn-more\n\n\n\n \n\nWell that's suspicious. The timing alone would be cause for concern.\n\n\n-- \nAizawa Shouta \nUA High, 1st Year Specialist \ndon't call me | https://ua-yuuei.jp/learn-more\n\n\n \n \n\nMy thoughts exactly.\n\n\n--\nNedzu :) \nUA High Principal \n+81 08-XXXX-XXXX | https://ua-yuuei.jp/learn-more\n\n\n \n \n \n \n \n \nUA Student Housing Proposal Denied\n by Kuwahara Chieko - August 18, 2X04 \n\nVoters in the UA Community School District rejected a ballot proposal for on-campus student housing in a special election held on Wednesday. Votes for measure approval fell 20.5 percent short of the simple majority needed.\n\nThe failure of this measure to pass is largely attributed to UAs overall failure to secure their own campus and assure the safety of their students and staff during off-campus activities. A second vote will be taken in December. If approved, students currently attending UA would be required to use the new boarding system in order to remain enrolled.\n\nAccording to various third party reports, the Principal of UA High is still pursuing construction companies for quotes on a large scale addition to the school campus, but declined to comment. Though there is speculation that UA plans to continue pushing for dormitory housing, these construction inquiries could also be related to the USJ building, which has been operating at 50% capacity since the League of Villains attack in April of this year.\n\n \n \n \n \n  Kaminari Denki\nThurs, Aug 19 • 20:10\n\n\nDo you want to train together this weekend?\n\n\nSorry, I can't!!\n\nDo you know Blood? From QABD\n\n\nI think I've seen the username in ideals-chat before.\n\nThey're very...\n\nEnthusiastic.\n\n\nI'm doing an offline meet-up with her on Sunday!!!!\n\n\nOkay.\n\nDoesn't that mean you'll be free Saturday\n\n\nNo, I'll be too busy picking out an outfit and scoping out the venue\n\n\nYou know this is the reason you failed finals, right\n\n\nRude!! This is important, I've gotta make a good impression!!!\n\n\nYou're already starting to talk more like her, are you sure prolonged exposure is a good idea\n\n\nJust for that, you're now uninvited\n\n\nGood.\n\nBecause I'll be preparing for the licensing exam.\n\nSo I don't fail it like you're going to.\n\n\nsmh\n\nSomeday you'll learn that some things are more important than grades\n\n\nLike prohero licensing exams?\n\n\nStop trying to MAKE ME FEEL GUILTY\n\n\nI'm sorry. I was unaware you possessed the minimum amount self awareness required to feel guilt.\n\n\nI never should have introduced you to the internet\n\n\n \n \n \n \nr/QAB\nredshirt_blueshirt · 3h ago \nThoughts on Prelude?\n\nI've been looking for other blogs like QAB and ran into Prelude. Does this sub have an opinion?\n\nHis content looks super promising, especially the quirk studies stuff. But one of my big hang ups is that I prefer text articles so I can read on the train and on breaks at work, and he seems to be most active on youtube.\n\n\n 200    22\n\n22 Comments sorted by Best \nLogin or sign up to leave a comment\n\n 5w4nn  3h  \nThere's a lot of QAB clones out there, but in my opinion Prelude is next level. His takes are unique and his analyses are solid. I hear you on the video vs written content though.\n\n\n soho2025 2h \n\nIf by unique you mean psychotic, then yes\n \n1 more reply\n\n\n Sar8rah  1h... \nThis post in particular is the best of both worlds: insanity and God tier level analysis.\n\n\n\n january-i-do  1h  \nI think the general consensus is that nothing will ever be as good as QAB.\n\n\n MoonDropsTomorrow 1h \n\nThis.\n\n\n\nVIEW ALL 22 COMMENTS\n \n \n \n \nThe Idol Hero \n\n\n3 unread messages\n \n \n \n \n @ Shouto\n\nShouto\nThis is the beginning of your direct message history with Shouto.\n \nAug 20, 20X4\n \nShouto Today at 12:30\nThank you for accepting my friend request.\n👍 1\n\nShouto Today at 12:38\nI apologize for contacting you directly, but I wanted to thank you personally for your part in helping my classmate. Though he may not appreciate or acknowledge it, we may very well have saved his life. Because of the community you fostered, because you taught people to help out where they can and stand up for themselves, because you stepped up and took charge of the mission itself, we were able to remove someone from a dangerous situation. We absolutely couldn't have done it without you. \nAnd because the student in question would be too prideful to say it, I'll say it for him. \nThank you.\n\nShuttai Today at 12:50\nI like to think it all would have worked out somehow but I'm incredibly glad I could help! \nI couldn't just ignore someone in need if there was a chance we could do something. I'm so glad it worked out and that your classmate is back home safe.\n\nShouto Today at 12:57\nNone the less \nThank you again, Shuttai-san. You're a true hero.\n\n \n \n \n \n @ Shuttai\n\nShuttai Today at 13:02\nShouto-san just called me a hero and I'm going to CRY\n\ncrawler Today at 13:13\nbut you are a hero?\n\nShuttai Today at 13:17\nWhat??? \nKoichi STOP \nYOU'LL MAKE ME CRY\n\ncrawler Today at 13:17\nyou help people every single week, and this week you literally saved a teenager from the literal clutches of literal villains\n\nShuttai Today at 13:17\nThat wasn't ME \nThat was all of YOU\n\ncrawler Today at 13:18\nwho do you think made that all possible?? do you think i could have what, waltzed in there by myself and taken on all those villains?? \nnot to mention i wouldn't have even known it was happening because they didnt come to me. they came to YOU\n\nShuttai Today at 13:22\nStop \nI still have class \nI am NOT going to cry in chemistry again, Koichi\n\ncrawler Today at 13:23\nokay. we'll talk later\n\n \n \n \n \n @ crawler\n\nShuttai Today at 13:17\nThat wasn't ME \nThat was all of YOU\n\ncrawler Today at 13:18\nwho do you think made that all possible?? do you think i could have what, waltzed in there by myself and taken on all those villains?? \nnot to mention i wouldn't have even known it was happening because they didnt come to me. they came to YOU\n\nShuttai Today at 13:22\nStop \nI still have class \nI am NOT going to cry in chemistry again, Koichi\n\ncrawler Today at 13:23\nokay. we'll talk later\n\nNEW MESSAGES \ncrawler Today at 16:45\nhey, izuku \nyou're a hero :)\n\n \n \n \n "
}