{
    "id": "27972395",
    "url": "https://archiveofourown.org/works/27972395?view_full_work=true",
    "author": [
        "Red_127"
    ],
    "title": "Saved Myself",
    "rating": "Not Rated",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "Gen",
        "M/M"
    ],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Midoriya Izuku/Shinsou Hitoshi",
        "Aizawa Shouta | Eraserhead/Yamada Hizashi | Present Mic",
        "Midoriya Izuku & Yamada Hizashi | Present Mic",
        "Aizawa Shouta | Eraserhead & Midoriya Izuku",
        "Eri & Midoriya Izuku",
        "Aizawa Shouta | Eraserhead & Eri & Shinsou Hitoshi & Yamada Hizashi | Present Mic"
    ],
    "characters": [
        "Midoriya Izuku",
        "Shinsou Hitoshi",
        "Eri (My Hero Academia)",
        "Aizawa Shouta | Eraserhead",
        "Yamada Hizashi | Present Mic"
    ],
    "additional_tags": [
        "Midoriya Izuku Has One for All Quirk",
        "Scarred Midoriya Izuku",
        "Implied/Referenced Child Abuse",
        "Mentioned Bakugou Katsuki",
        "Mentioned Midoriya Inko",
        "Dead Midoriya Inko",
        "Mentioned Yagi Toshinori | All Might",
        "Mentioned Midoriya Hisashi",
        "Emotional Hurt/Comfort",
        "Shinsou Hitoshi is So Done",
        "Not Beta Read",
        "DO NOT REPOST TO WATTPAD"
    ],
    "language": "English",
    "series": "Part 1 of Saved Myself",
    "published": "2020-12-09",
    "completed": null,
    "words": "11,294",
    "chapters": "1/1",
    "comments": "114",
    "kudos": "5,896",
    "bookmarks": "940",
    "hits": "67,918",
    "summary": "<p>After seeing Midoriya out late at night and acting very out of character, Shōta confronts both of his children about the Problem Child only to learn that there are many things he and all of the other teachers have missed over the years.<br>Or<br>Hitoshi finally breaks and lets his father know all the ways that he failed one of his students.</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a>.)</p>\n<p>Greetings!<br>I hope you enjoyed the story! I'll be posting a Part 2 to this story that will be more in Hizashi's POV.<br>Also, I don't know why I head cannon that Izuku is abused so much, but it's a constant for all my FF of him, lol :D<br>Thanks for reading!</p>",
    "text": "Shota Aizawa, being a teacher for 6 years, was used to seeing his students out in the real world occasionally. Mostly, they’d exchange a wave or depending on their level of fear of him, run in the opposite direction. Sometimes, a student would come up to him and chat. None of these encounters were ever shocking or surprising to him. That is, until 2 a.m at a 24-hour grocery store, during summer break. Of course, if anyone was to give him a surprising encounter, he knew it would be from his 3-A class. The class who over the last three years had forged bonds due to shared trauma, villain attacks, and a general lack of personal boundaries. If he had to take a guess, he would have thought at 2 a.m he would have run into Tokoyami, his son Hitoshi, or even a member of the self-proclaimed Bakasquad who would probably be getting snacks. So, seeing his Number One Problem Child out so late was already a little unsettling. Then he looked at him and he realized, this could NOT have been his problem child. The person was lost in their own world, listening to music while dancing down the aisle, stopping occasionally to put something in their cart. This in itself was a little strange, as his Problem Child, otherwise known as Izuku Midoriya, was a rather shy and guarded person.\nOver the last three years, he’d physically changed, growing about an inch taller than Shota himself, and losing his previous scrawny frame. He resembled a pro hero more than a student, something Shota thought many in his 3-A class deserved after their hard work, even if he hadn’t said that out loud. Even with all his physical changes, he still stayed shy with others. So, seeing him so open was surprising, yet it was the least surprising thing about the scene in front of him.\nMidoriya was wearing black rimmed glasses, which Shota was unaware that he needed. He was in a black shirt that had its sleeves cut practically all the way to the bottom of the shirt, showing his arms and the multitude of scars that ran down them. There were scars that Shota recognized as being cause by his own quirk, but there were also scars he’d never seen before. Shota was too far away to see them clearly, but anytime Midoriya moved his arms, his ribs were exposed and it looked like more scarring was on his torso. The scars, from what he could make out, looked old and healed over. Shota wracked his brain trying to think of a time when Midoriya could have gotten those scars before, yet he couldn’t come up with anything. The other shocking thing, was that scars weren’t the only thing that was on Midoriya’s skin. There were multiple tattoos as well. He couldn’t make out exact words or details, but he could see black and color running down one arm making up a half sleeve, stopping just above his elbow. There was also color that seemed to be on his torso, near the scars on his ribs. Shota himself had two small tattoos, so he was not opposed to seeing them on another person, but he was concerned on how different the person in front of him was to his student. At this point, he was beginning to think that Midoriya had a brother, whom he just didn’t talk about.\nHe seemed to come out of his shock and thoughts as Midoriya turned the corner and left the aisle, not once looking at him or acknowledging his gawking. The Midoriya he knew had much better situational awareness, so maybe it WAS a brother. Forgetting about his own shopping, he left his cart and followed after his could-be-student. He next found him, headphones now slung over his shoulder, talking animatedly to the cashier, who was scanning his items. Unfortunately, Shota was too far away to hear their conversation. Instead, he listened to the hum of the refrigeration cooler next to him.\nThe could-be-student left after a few moments, taking his two bags with him, with Shota still following behind him. No longer in the well-lit store, it was easier for the underground hero to stalk after him. Shota didn’t remember Midoriya’s address, but he had a vague remembrance of the place from the home visit they did to tell the parents about the dorm construction. He didn’t remember the apartment being on the sketchier part of town, but alas, they walked farther away from the nice parts of town, and more towards the area that he patrolled at night.\nHe heard a phone start ringing, and quickly reached for his own, but the person in front of him did the same. Shuffling the bags into one hand.\n“Hello?” A concerned tone took to what Shota recognized as Midoriya’s voice. Shota listened attentively, wishing he could hear the other side of the conversation. “Hey, it’s okay Pumpkin, you aren’t bothering me. Tell me what’s wrong, did something happen? Are you okay?” The voice was gentle, comforting, calming. For a few minutes, all he heard was the person’s occasional sound of acknowledgment, probably so the other person would know he was still listening. “You’re okay now, it was just a dream. I’m okay. You don’t have to worry. If it would make you feel better, do you want to go get ice cream tomorrow? I’m sure Toshi wouldn’t mind bringing you, we can bribe him with going to the cat café too. Then, you’ll be able to see that I’m perfectly fine. Does that make you feel better? Okay good, I’m glad. Is there something else?” The figure started moving again towards a slightly rundown apartment building. Shota had a sinking feeling that he knew who this person was talking to. He was confident that it was his own daughter, Eri. He was now even more curious because from the conversation he’d been hearing. It didn’t sound like this is the first time his daughter had called his student in the middle of the night. He was even more concerned that neither his 9 year old nor his student had talked to him about these late night calls before. “I know it looked bad, but I’m okay. Your dad is too. I’m sure he’s done with his patrol by now, you can give him a call you know. Or if you don’t want to do that, why don’t you go get in bed with Toshi, he’ll protect you from all the bad dreams. If not, I’ll beat him up for you.” He took on a teasing tone, and Shota was now 100% sure that it was Eri on the phone. He was beginning to feel guilty for taking time stalking his now confirmed student instead of getting home. “I’m sorry Pumpkin, I don’t think your dads would like that-”\nThe conversation was immediately cut off from Shota’s ears by the apartment complex door shutting behind Midoriya. Shota was now very concerned, confused, and curious as to what Midoriya was telling his 9-year-old daughter he wouldn’t like.\nPart of him wondered if it was Midoriya that told Eri not to talk to anyone about these late night conversations. He tried to push the growing concern out of his mind, because he knew that to Eri, Midoriya was her hero. She thought the sun rose and set over the boy, and he knew that Midoriya loved Eri like a little sister, similarly to Mirio. Both boys had watched Eri and taken her out multiple times. She had even stayed with Mirio and Tamaki while Shota, Hizashi, and the students went on overnight trips. There weren’t many things that Shota thought Eri could ask them for that he wouldn’t like.\nHe turned away from the apartment complex and started making his way to his own home. There were too many things that weren’t adding up for him. Too many of his world views had been altered in such a short period of time for him to think clearly. The first thing he was going to solve was what Eri asked Midoriya. Then he would worry about the 180-degree difference in the Midoriya that he just seen and the one at school.\nOnce he was finally at home, he immediately went to Eri’s room, seeing that she was still in her bed, her cell phone still next to her, and she was clutching a stuffed unicorn that Midoriya had given her.\n“Eri?” He kept his voice low as to not alarm the rest of the house. “I know you’re not sleeping.”\n“How did you know?” A small voice asked out from the darkness.\n“You were just talking to Midoriya, weren’t you?” He made his way into the room, turning on the small lamp next to Eri’s bed and took a seat next to her while he asked. He saw the shock sweep over her face and she glanced to her phone.\n“Did he tell you?” There was a tone of betrayal in her voice that Shota hadn’t heard before.\n“No, he didn’t. I saw him while I was finishing up patrol and overheard him talking to you. He didn’t know I was there at all. He didn’t tell me you called him.” He saw her visibly relax at his words. It seemed that it wasn’t Midoriya that wanted to keep these calls secret after all. “Did you have a nightmare?” She looked down and nodded slowly. “Do you want to talk about it?” She hesitated before clutching the unicorn again.\n“It’s okay. ‘Zuku helped. I know it wasn’t real. He’s still okay, I know that now.” Her voice was small, but there was a definite tone about it. Like she was still trying to convince herself of that fact.\n“You know, you can talk to me about your nightmares too.” Shota reached out and pet her head, comforting her. She nodded, but didn’t respond. “You asked Midoriya for something and he said I wouldn’t like that, what did you ask for?” The question that burned on the tip of his tongue finally came out.\n“I wanted Toshi and I to have a movie night and spend the night at ‘Zuku’s like I do with Mirio, but he always says you wouldn’t like if I stayed over.” Sadness laced her voice as she spoke. Shota sat back, confused. Why hasn’t Midoriya ever asked him about this? Of course, he would question it now, seeing as he apparently didn’t know Midoriya at all, but before tonight, he couldn’t think of a reason why he would have been against it.\nEspecially with Hitoshi joining them. He remembered Mrs. Midoriya being a very kind woman, he couldn’t see her being opposed to it either.\n“How about I talk to him about it? Maybe we can work something out while we’re on break, and maybe you and Hitoshi can do that. That’s not a yes, but we can talk about it, okay?” He tried not to get her hopes up all the way, but he saw a sparkle hit her eyes and she launched herself at him.\n“You mean it!?” She squealed happily and he was sure everyone in the house was woken up by it.\n“We’ll talk about it, no promises. If anything, maybe we’ll just have Midoriya stay the night here and have a movie night. That could work too, right?” She answered with an eager nod to her head. “Now, one last question before you’re going back to sleep. How often are you calling Midoriya this late at night?” Suddenly she pulled back into herself and looked away.\n“I call whenever I have a nightmare.” She finally answered. Shota knew about the nightmares. She was in therapy, and after all that she went through, it was to be expected, but her calling every time she had one, was not expected. “He said he doesn’t mind. Sometimes it’s so I can make sure that he’s still here. Especially after I see fights where he gets hurt, I dream that he doesn’t get back up. Or, I dream about when he rescued me and in the dream I use my quirk too much and he disappears. Other times it's because I know that he understands what it’s like to be hurt.” She finished her justification looking down at the scars on her arms caused by Overhaul. It only brought more questions to Shota’s head.\n\n'I know that he understands what it’s like to be hurt.'\n\nHe wanted to think that the scars he’d earned were due to his quirk, but he now knew that there were other scars on Midoriya’s body. He once again felt like he didn’t know his student at all.\nAs much as he wanted to press these issues, he knew he needed to keep his word to Eri.\n“Okay, we’ll talk more about this in the morning, for now, you need to go back to sleep. If you have another nightmare, you can come get me, okay?” She nodded and began to get more comfortable, still clutching the stuffed unicorn.\n“You promise to talk to ‘Zuku about the movie night?” She asked once she was settled in. Shota nodded his head.\n“I will. Sweet dreams.” He flipped the light and made his way out of the room. A small, ‘you too’ followed after him.\nHe stood in the hall, unsure of what his next move was. It wasn’t much later than when Eri called him. Should HE call Midoriya? How inappropriate was it to call a student at –Shota looked down at his phone- 3:14 a.m? He sighed loudly.\n“You good over there?” A tired voice came from behind him, and Shota instantly knew his next move.\n“Hitoshi, why are you awake?” Shota asked the purple haired insomniac that stood like a zombie behind him.\n“I could hear you talking to Eri.” He said simply, walking away from the hallway connecting everyone’s room and toward the kitchen. Shota followed after him.\n“So, you know I have questions.” He sat at the breakfast bar and watched Hitoshi fiddle with the coffee maker.\n“I’m sure you’re also aware that I can’t answer most of them.” Hitoshi was far too similar in personality to himself. Both were blunt, always had a generally bored demeanor, but both fiercely protective of the ones that they loved. Shota knew that Midoriya and Hitoshi had a close friendship, with Midoriya being the first friend that Hitoshi made when he’d been transferred to 1-A.\n“Why does he think I wouldn’t let you and Eri spend the night?” He asked first, watching Hitoshi grab two coffee cups from the cabinet.\n“Can’t answer that.” He said simply.\n“Why has he never told me about the late night phone calls?”\n“Eri asked him not to, but her therapist knows. Of course, her therapist can’t tell you anything. But, ‘Zu has never been bothered by them before, and from what I know, they are becoming less frequent.” Shota felt slightly better knowing that at least some adult knew.\n“You knew about the calls?” He questioned. Hitoshi hummed and began pouring coffee into each cup.\n“I’m the one that gave her his number.” He told him honestly. Not offering an explanation as to why he also kept the secret. Though, Shota figured it was also because Eri had asked him not to tell.\n“When I saw Midoriya tonight, he seemed VERY different. Any comments on that?” He accepted the coffee that was handed to him and took a small drink.\n“Nope.” Hitoshi made a move to sit next to him.\n“I thought at first it was maybe his brother.” Shota mused. Hitoshi snorted and smiled.\n“He’s gonna die when he hears that. Not sure if it’s gonna be from embarrassment or from laughter though.” Shota rolled his eyes. Knowing the school version of Midoriya, his guess was embarrassment. “Now I have a few questions for you.” Hitoshi moved to look Shota in the eye more, and Shota saw a slight hint of distrust pointed at him. “Did he see you?”\n“No, I saw it at the store, and followed him” Shota felt no need to be dishonest.\n“Why did you follow him?”\n“He was too different. It’s very concerning to see someone you know be that different to his regular self.” The slight distrust in Hitoshi’s eyes grew and Shota felt like there was a lot that he didn’t know. Why was his son being like this to him?\n“And seeing him like however you did, what does that make you think about him now?” He quickly noticed that Hitoshi didn’t directly say specific changes, it made Shota think that maybe, there were even more changes that he didn’t see.\n“It makes me think I need to have a long talk with him. Especially, if my children are going to be around him. I’m not going to say that he’s lying, but it seems that there are things that he isn’t being honest about. I’m not sure why you’re showing such distrust right now, but however you’re feeling is how I’m feeling towards him. He was a completely different person. Plus, why was he out this late? Why was he going into a shady apartment and not his own? Honestly, I didn’t even know he wore glasses. A lot of things aren’t adding up, you have to understand that Hitoshi.” He recognized that his voice was becoming slightly angry as he talked, but he felt justified in it. Especially, with the hostility coming off his son.\n“It’s in his medical file.” Hitoshi’s hands were both around the cup of coffee, holding it tightly. His voice was short and quiet. “He’s far sighted. Last year, when his costume changed to include his goggles, it wasn’t because his walls create so much dust that he needed to shield his eyes. They are prescription. It’s because he’s far sighted. It’s not super bad, but the more tired he gets, the more he has to wear them. It’s in his medical file. It’s also on his support item list. It says, prescription goggles.” There was a low tone to Hitoshi’s voice. It was almost accusatory. Shota sat back for a moment, trying to think about when Midoriya’s hero suit had changed, or when he signed the change request. He honestly couldn’t remember, but even that seemed like a small answer to a much larger problem.\n“Okay. That doesn’t justify everything else. What about the tattoos? Any of those in his medical file too? What about the change in personality? The late night calls with Eri? Telling her that I wouldn’t like if she asked me if you guys could go over? How am I supposed to put trust in someone who not only do I not know, but also who is putting words into my mouth and thoughts into my daughters head?” He was being snappy, he knew. He couldn’t make himself care. Hitoshi’s eyes snapped to his and he saw anger. It was the kind of anger he hadn’t seen directed at him before. It was the kind of anger he’d only seen directed at villains. Shota couldn’t stop the hurt feeling that washed over him. Hitoshi’s gaze slightly lessened. He turned away and quickly drank the rest of his coffee.\n“Dad. I love you. You will forever be the person who gave me a home, a family, love, kindness, who taught me to be a hero. I will never not love or be appreciative to you. But you’re wrong. You’re wrong about Izuku, whatever you’re thinking. You have saved so many people, but you failed him. At first, I thought maybe you didn’t see all the signs, but then you picked them up with everyone else. You made your way through the A class and helped everyone you found. I waited for you to help him. I waited so freaking long. I thought, ‘Of course he will, he has to see it.’ But, you never did. So, I waited for All Might, because they are apparently so close, yeah right! So, instead, I started dropping hints, even when ‘Zu asked me not to. Then I left a message to the counselor. Then I just straight up told All Might that he wasn’t okay, because I know if it had to be an adult, that All Might was the closest person he’d trust at the time. Still, NOTHING. The whole time, HE consoled ME about it, said how it was okay. How people should be focusing on REAL problems. So, the first time Eri called him crying about her nightmare, he came over, so she could see that he was okay, and wasn’t hurt. He did it because he couldn’t stand the thought that she would feel like him. She asked him not to tell you, but he immediately told her therapist. Then he called back after the next session and made sure that the therapist knew again. Then he asked Eri if they’d talked about it. Because he MADE SURE that no one would do to her like they did to him. You are so good with everyone EXCEPT HIM and I DON’T get it. You call him Problem Child anytime you talk to him, but you don’t do that with anyone else. All Might would rather let him kill himself than step in. Of course, you’ve never seen his tattoos, our uniforms all cover it, and it’s not like he’s walking around shirtless everywhere. He put them there because he’s professional. You’ve never asked about his background. You never asked him about his life. Did you expect him to tell you every time he stubbed his toe when all adults around him ever do when he comes to them is ask what he did wrong?” Hitoshi’s long, angry loud rant finally petered out and Shota sat shocked, confused, guilty, and a slew of other emotions he wasn’t quite able to distinguish. He didn’t have a response to give Hitoshi, and maybe that was part of the problem. He couldn’t even justify his previous actions, because he couldn’t remember seeing any signs that warranted Midoriya needing help. But, the angry tears now streaming down Hitoshi’s face pushed him off his chair to embrace his son. Hitoshi cried and brought his fist clenched hands to his own face as Shota embraced him. He peaked in the hallways and saw a confused Hizashi with a teary eyed Eri gripping the bottom of his shirt.\n“I’ll make it better.” Shota told him. He wasn’t sure exactly what that would entail, but his son was hurting and he had to try. Hitoshi shook his head.\n“Sometimes, there is too much damage for something to be mended. Sometimes the heroes don’t save everyone.” He backed away and glanced to Eri, opening his arms to her. She ran into his arms and hugged him. Shota stood helpless and shocked. Eri did her best to wipe away Hitoshi’s tears.\n“Tomorrow, ‘Zuku said we’re gonna go for ice cream and that we were gonna bribe you by going to the cat café. So, don’t be sad. If you call, I know he’ll tell you that he loves you and not to cry.” She hugged him tightly, her feet still off the ground while clutched in his arms. He nodded to her. Shota made eye contact with Hizashi who was looking more and more distressed by the minute. Both of their eyes widened when they heard the word, ‘love’. Was there even more that they hadn’t noticed?\nEri moved one of her hands down to her pocket and pulled out her small phone. Pressing it to her ear while Hitoshi still cradled her.\n“Hi again ‘Zuku.” She said calmly. Hitoshi looked up at her, finally noticing her actions and seemed to have a small glint of hope in his eyes. Both children clearly forgetting Shota and Hizashi still standing there. Hizashi made his way over to Shota, moving around the kids. Shota grabbed his hand like a life line. “No, not another nightmare. Yeah, Dad is home now. Hitoshi is upset and I think he needs ‘Zuku magic.” Hitoshi sniffed his nose trying to clear the tears and set Eri down, taking the phone from her.\n“I feel like I should be offended that you answer my sister’s calls in the middle of the night but I’ve gone to voicemail In the middle of the day before.” Shota knew he was trying to be joking and lighten his own mood, but the tears that still escaped made it difficult.\nHizashi looked from the kids to Shota.\n“What happened?” He asked him. This seemed to break the spell that the kids were under and they both looked at their parents.\n“Sorry, no, I’m okay. It’s a long story. I think-“ He paused and looked at each of his parents before sighing. “-I think you should come over.” Hizashi looked at Shota who nodded. He didn’t think anyone was going to be able to sleep any longer tonight anyway. Hitoshi moved the phone from his face and suddenly Midoriya’s voice filled the room.\n“Right now? What’s happening over there? Eri said Aizawa was home now. Is he okay? Is he hurt? Do you need me to bring anything? Where is Mic? Is he okay? You and Eri said that you were okay, but are you sure? Toshi, what is HAPPENING over there? I’m freaking out right now.” His worried and stressed voice made Shota feel worse than he did before. From what he gathered from Hitoshi earlier, Shota and all the other teachers had somehow failed Midoriya in some way and yet he was still fretting over their well-being.\n“We’re fine, Midoriya.” Shota answered for Hitoshi. Silence filled the other line.\n“Sensei?” The voice resembled more of the small reserved voice that he was used to.\n“Yes. You’re on speaker. We’re all here, all safe. If you want to come over and your mother allows it, then you may.” Shota realized that he must have said something wrong when both Eri and Hitoshi looked at him quickly with panic. The other side of the line was met was silent for a moment.\n“Please come over ‘Zuku, I want to go to the kitty café for breakfast!” Eri told him, her voice was reassuring. Hitoshi looked upset again. Shota looked at Hizashi, once again lost. Hizashi seemed to be in the same and equally confused state. \n“Do you need me to bring anything?” Midoriya answered after a few moments longer of silence. Both Eri and Hitoshi seemed to breathe a little easier.\n“Bring your, ‘It’s been an emotional day’ kit.” Hitoshi told him, sparing a single glance at his parents again. There was nervous laughter that spilled out of the phone. Eri was slightly nodding.\n“Is it for you… or will I need it?” They could all hear sounds indicating that Midoriya was moving around.\n“You, me, Eri, I think Dad and Pops too.” Hitoshi moved to sit on the couch, Eri following behind him. He leaned his head on the back of the couch and closed his eyes. “We’re gonna talk about you. I spilled the beans that every adult you’ve ever met has failed you. Dad saw you at the store tonight and followed you home. Eri spilled the beans about you understand being hurt and about her late night calls. I spilled about your previous late night visits. Oh, I’m also pretty sure Eri also outted us, and pop’s is just, along for the ride at this point.” A large sigh was heard, followed by more silence. Eri seemed to take a second to process and then her face morphed into terror.\n“I’M SO SORRY!” She shrieked into the phone. Hitoshi, the closest to her, winced.\n“Shota? What’s all this about? You followed Midoriya home?” Hizashi whispered to him, concerned.\n“For 3:30 in the morning, you guys seemed to have accomplished a lot of things.” Midoriya finally answered. The sarcasm in his voice held a slightly light tone. “It’s okay. I should have had better situational awareness, I honestly wasn’t paying attention. Eri, it’s okay. The calls, the visits, the outing, it’s all okay. You don’t have to worry about that stuff. You don’t have to keep those things a secret either. Just like Mindy says, even the strongest heroes get nightmares and need help. Letting people know about this isn’t going to change their opinion of you. Hitoshi, is that what has you upset? You know you don’t have to worry about that, especially not this late at night. Everything is okay now. I’m okay, you’re okay, we’re okay. I’m on my way now though. I’ll be there in 15 minutes. Okay?” His tone was light and kind and Shota could see both of his children visibly relax at the voice and reassurance.\n“Should we be concerned that Midoriya is on a first name bases with Eri’s therapist?” Hizashi whispered again and Shota gave a sort of shrug indicating that he had no idea anymore.\n“Okay, we’ll be here. Wait, did you get the good stuff?” Hitoshi smiled a wicked smile.\n“Psh, duh. I thought Aizawa would like some too and figured Mic and Eri would have the hot chocolate.” Midoriya’s small laugh made Hitoshi smile at Shota with a mimic of his own devious smile, while Eri clapped and ran to the kitchen pulling out 5 cups. “Alright, I’m leaving now. I’ll see you in a few.” With that, the phone line clicked.\n“What’s, ‘the good stuff’?” Hizashi asked, feeling like that was the only question that was safe at the moment.\n“Coffee.” Hitoshi answered simply, making his way into the kitchen, to dump and clean the current pot that was there.\n“Oh. Why didn’t he think I’d want coffee too?” Hizashi pondered, slightly to himself.\n“It’s called, ‘Devil Mountain’. It has more caffeine than any other cup in the world. It’s technically considered deadly.” Hitoshi answered his pondering while he scrubbed the coffee pot in the sink. Shota was immediately intrigued.\n“Oh, yeah, I’ll just do the hot chocolate then.” Hizashi confirmed laughing lightly.\nEri opened the fridge and then turned to look curiously at Shota.\n“Did you get milk at the store?” She asked. Shota’s shoulders dropped and he suddenly remembered the forgotten cart at the store.\nHitoshi looked up and pulled out his own phone, pressing it to his ear.\n“Yeah, sorry, can you grab milk from the convenience store on the way here?” He looked up to Hizashi and Shota. “Do you guys need anything else?” Both of them shook their head. Shota felt a slight bit of embarrassment burn in his chest. “No, that’s all. Okay, thanks, bye.” He hung up the phone, turning to Eri. “He’ll grab it.” Then went back to rinsing the coffee pot. Eri gave a nod and sat at the breakfast bar in the seat Shota had previously occupied.\nAn awkward silence fell over the group.\n“So, you and Midoriya, huh?” Hizashi asked, trying to break the silence. Hitoshi, now finished with the pot, nodded.\n“Yeah, since end of first year.” He answered, shocking his parents that he’d been in a relationship for a year and a half and they didn’t know.\n“It was romantic! ‘Zuku gave him flowers and chocolates.” Eri told them happily. Smiling brightly. Hitoshi’s cheeks pinked.\n“Quiet. The chocolates were mostly for you, and you don’t know what romance is, you're nine.” Hitoshi teased and Eri stuck out her tongue at him. Shota suddenly realized that his children also had a life that he didn’t know anything about. He fought hard against the feeling of wanting to cry.\n“Was Eri there, when he asked you out?” Hizashi, seemed reserved but happily interested in the story.\n“Yeah, I chaperoned! Plus, ‘Zuku said that he needed my blessing to ask out Toshi.” Her smile seemed to lift the tension in Hitoshi and Hizashi, and only furthered it in Shota. “It was during one of the times we went to the cat cafe we’re going to tomorrow! We got there first and the worker directed us to this table that already had drinks and muffins waiting for us. Then ‘Zuku got there and his arms were behind his back hiding the flowers and chocolate, but he said a bunch of nice things to Toshi and then right when he said, “Will you go out with me?” He gave and showed him the flowers and chocolates! Toshi was so shocked! All he could do was nod.” Eri began laughing at the memory and Hitoshi’s face became even more embarrassed, but a sappy smile filled his face.\n“Idiot didn’t even mumble during it.” He said fondly. Hizashi looked ecstatic.\n“THAT’S SO CUTE!” He yelled and on reflex everyone covered their ears. “Oh, sorry! That’s so cute!” He said again, this time quieter.\n“He’s a dork. He could have just asked, he didn’t need a big show.” Shota could see how happy Hitoshi was in that moment and he wondered how many things that he had apparently been blind to see.\n“What about other dates? What did you do for them?” Hizashi asked him.\nThe next several minutes went by where Hitoshi and Eri told funny scenes or dates that they’d gone on. Eri being a frequent companion. Shota recognized some of the trips and places that Hitoshi had asked if he could go to with Midoriya. The Zoo, the aquarium, dinners, skating rinks. He now realized that when Hitoshi asked, he never said it was with anyone other than Midoriya.\n\n'Can I go out with Midoriya to the Zoo Friday?'\n\n\n'Can I go with Midoriya to dinner Saturday?'\n\n\n'Can I stay at Midoriya's this weekend?'\n\nThough he wasn’t explicitly saying they were dates, he also wasn’t hiding it. The guilt and grief only continued to grow.\nFinally, a knock at the door brought the stories to a close. Eri ran to go open it.\n“’Zuku!” She exclaimed from the door. A few seconds later, Midoriya walked into the kitchen, a duffel on one side, with a plastic bag from the convenience store, and carrying Eri in the other arm.\n“Uh, hey.” He raised the bag with the milk in it and a type of awkward greeting that Shota wasn’t used to. He was wearing his glasses still and the same grey sweat pants, but a hoodie was over top what Shota assumed was the same black cut off shirt. He set the duffel down on the chair and the plastic bag on the counter. With Eri still in his arms he walked over to Hitoshi, who was back to looking upset.\n“I’m sorry.” Hitoshi said simply and Midoriya shook his head.\n“It’s fine. Come here.” Midoriya’s smile was bright and loving and a similar smile to what Shota was used to seeing in class. He tugged Hitoshi to his other side, Eri continuing to sit on his forearm and grip around his neck. Hitoshi leaned in and Shota was instantly reminded of how he himself would curl into Hizashi after a bad day. Making his body as small as possible, and being cuddled into the hug.\nHizashi started loudly making awing noises and the pair broke their hug, Midoriya even setting Eri down.\n“Aizawa Sensei, Mic Sensei.” Midoriya greeted them both with an awkward head nod.\n“You can leave off the Sensei, Midoriya.” Shota told him. Midoriya just nodded in understanding. An awkward moment of silence filled the room again.\n“I brought the coffee.” Midoriya said breaking the silence. He moved to his duffel, opening and pulling out a black bag that indeed was titled, ‘Devil Mountain’. Hitoshi smiled, taking the bag.\nThe next several minutes were spent in silence. Eri and Hizashi made hot chocolate while Hitoshi made coffee. Midoriya and Shota both stood behind the breakfast bar.\nMidoriya seemed to be rolling around a small square in his hand. Shota recognized it as a fidget cube. He wondered if that was the cause of the lack of nervous mumbles in his class. Suddenly, Midoriya stopped and started to pull off his hoodie.\n“Sorry, it’s kind of hot with this on.” He announced to Shota’s questioning eyes. Once off, Shota indeed recognized the black shirt as the one he’d been previously wearing. His tattoos and scars now once again on display. He didn’t seem to mind and neither Eri nor Hitoshi seemed shocked at the sight of them. Hizashi however gave a similar reaction to Shota’s first look, his mouth hanging slightly open.\n“You have tattoos!” He announced, like none of them had eyes. Midoriya took a second and then went slightly pink.\n“I didn’t know you’d never seem them, sorry for shocking you!” It made Shota once again question if Midoriya had actually ever hid them, or if Hitoshi was right, and he’d just never paid attention.\n“This one is my favorite!” Eri said before pulling the back of his shirt and turning Deku around so that his shoulder was exposed. It showed a black and grey explosion with ‘SMASH’ written over it, done in an old comic book style. With the shirt pulled back, Shota could see more of the scars he’d seen at the store. Said tattoo seemed to be covering a scar. From the looks of them, they looked like they’d been caused by fire. Once again, neither Eri nor Hitoshi seemed to blink twice at them.\n\n'I know that he understands what it’s like to be hurt'\n\nSuddenly, Shota felt very nauseous. Hizashi gave a short gasp before covering it.\n“That’s really cool.” He finally said, but Shota could tell he was forcing the enthusiasm into his voice.\n“A memorial to all the One for All users!” Eri announced happily. Before quickly covering her mouth. Midoriya and Hitoshi both looked at her with wide eyes.\n“The One for All users?” Hizashi asked, feeling confused at the reaction of the three kids.\n“I’m so sorry.” Eri whispered out, her eyes filling with tears.\n“It’s okay, no harm done. You didn’t do anything. You’re totally okay. It’s okay.” Midoriya calmed her down, but something still wasn’t adding up. Hitoshi went back to filling three mugs up with coffee, seemingly trying to ignore the situation all together.\n“Is One for All like All for One?” Shota asked, feeling that Hizashi wasn’t going to be answered. Midoriya looked up from Eri, who still seemed down.\n“Nope. Totally different.” He smiled and went back to telling Eri quietly that she was okay. Shota realized that he wasn’t going to get a further explanation at this time.\n“Coffee and hot chocolate is ready” Hitoshi handed a mug to each person. Silence once again filled the room as they walked to the living room and sat around the coffee table.\nHizashi and Shota sat on the couch while Eri and the both boys sat on the floor around the coffee table, ignoring the third seat on the couch and other two chairs completely.\n“So, you two are dating. Eri and Hitoshi were telling us all about your dates before you got here.” Hizashi finally broke the silence again. Shota couldn’t be more glad for him in this moment. He didn’t know how to start this conversation.\n“Yeah, we are.” Midoriya said, taking a drink of his coffee. He offered no other explanation as he tucked himself into Hitoshi’s side.\n“Why didn’t you tell us?” Shota asked. Midoriya met his eyes for a moment before looking away, exactly like in class. Shota was starting to think that the open person dancing down the store aisle was made up.\n“I didn’t think we had to.” Midoriya answered simply. Shota and Hizashi both exchanged a glance at each other.\n“But we’re his parents.” Shota said, thinking that was a good enough reason for him to know.\n“So?” Midoriya looked at both of them slightly tilting his head to the side, genuinely confused. “It doesn’t have anything to do with either of you.” Hizashi’s mouth fell open once again. Shota tried to tell himself that Midoriya wasn’t trying to have an attitude, but it was fairly difficult to not be upset.\n“But you told Eri! And got her permission!” Hizashi tried again with what both of them believed to be good reasoning.\n“She was there when it happened. She comes with us to some of our dates, so of course I got her permission, I didn’t want to do something that would make her uncomfortable. Plus, me going out with Toshi alone would take time away that he could be with her. Their relationship was still fairly new. I wanted her to know that she had control and say over the things that were happening in her life. Toshi doesn’t miss family events because of our dates, nor would we ever do anything at school, so we couldn’t make either of you uncomfortable. So, I didn’t think it had anything to do with you.” While Midoriya explained his reasoning, Hizashi started to sink back down into his seat. Midoriya looked to Hitoshi for conformation.\n“Normal people tell others about that stuff.” Hitoshi told him, patting his knee. Eri giggled beside them, obviously in on the joke. Midoriya nodded, seemingly collecting this new information.\n“Oh. I see, my mistake then. I apologize. I am dating your son, I hope that’s okay.” Midoriya smiled at both of them. Shota began to realize why Iida and Midoriya got along so well.\n“Uh, yeah Little Listener, that’s okay.” Hizashi rubbed the back of his neck. Clearly confused on the whole situation.\nThey lapsed into another uncomfortable silence.\n“The coffee is good.” Shota said motioning to his cup.\n“Yeah, I have to special order it. It’s the strongest in the world.” Midoriya said, unknowingly confirming Hitoshi’s previous statement.\n“Why not just drink regular coffee?” Hizashi asked him.\n“Oh, my metabolism is a lot faster than other peoples. When I activate my quirk, it speeds up even more. This has equates to about 6 cups of regular coffee. If I were to run from back to my apartment, I would burn the whole thing off.” Midoriya explained to them both. “Plus, Toshi seems to like it.” With that, Hitoshi raised his cup agreeing silently.\n“To insomniacs around the world.”\n“Here Here!” Midoriya giggled beside him, clinking their glasses together. Hitoshi smiled and Eri laughed.\n“Are you an insomniac too, Midoriya?” Shota asked him, breaking their happy bubble. Shota couldn’t remember ever seeing him tired during class or up around the common area after curfew while they were at the dorms.\n“Yeah.” Midoriya simply replied, once again giving no further explanation.\n“Can we go back to your metabolism? How much do you have to eat in a day?” Hizashi ask leaning forward, clearly fascinated.\n“Right now since we’re on break, I’m not doing my usual training schedule, so around 5000 calories. But during school and when I’m training, usually around 15000-20000 calories.” Hizashi’s eyes got wide. Shota tried to wrack his brain to remember a time when Midoriya was eating aside from meals he ate with his classmates, which definitely didn’t equal 20000 calories.\nHe was starting to see what Hitoshi meant when he said he was missing everything.\n“That’s so much! How do you do it!?” Hizashi’s voice was beginning to get louder and Midoriya instantly leaned back away from the sound.\n“I eat a similar nutrition bar to Fatgum and Momo. I eat one in between each class and after every meal. Usually, around 2000 calories come from food and then each bar is around 1500 calories.” Shota was also starting to see that Midoriya was an honest person. Any question that needed an explanation, he gave one but if some didn’t need one he never seemed to offer up extra information,. He was also starting to feel bad about having basically called him a liar to Hitoshi earlier.\n“How did you figure all this out?” Shota question, hoping he’d find out that it wasn’t something he should have known.\n“When I did my internship with Grand Torino. He was concerned how weak and faint I felt and how I was break my bones anytime I used my quirk.” Shota knew had come back from a three day internship and suddenly he wasn’t breaking his bones before, but he hadn’t questioned it. Just figuring that he’d gotten control.\n“You broke your bones, because you weren’t eating enough?” This was something he should have known.\n“Yeah! It was one of the main reasons. The quirk is also really powerful, so there definitely still could have been damage done, but since my metabolism is so fast anytime I use my quirk, my vitamins rapidly deplete, including my calcium. Basically, without getting enough nutrients, it’s like hitting someone with osteoporosis with a truck. The bars I have are different than Momo and Fatgum because while they need the calories, they thrive more from an increase in lipids, while I mostly need carbs and vitamins.” Midoriya seemed happy to talk about it, not seeing anything wrong with the fact that their negligence as teachers when he first came caused him so much pain.\n“Does Recovery Girl know?” Shota questioned again. Midoriya nodded.\n“Yeah, after my internship, we ran a bunch of tests to figure out exactly how everything depleted.” He confirmed another thing being in a file that the teachers could have seen.\n“Hey, are those new glasses?” Hitoshi suddenly questioned. Staring at Midoriya face with confusion.\n“Oh! Yeah. I just got them yesterday. I had to call Mei to make to adjustment when we come back next term. Apparently, they got a little worse. Seems like they’ll be a permanent feature on my face now.” Midoriya took them off and showed them to Hitoshi, explaining everything.\n“You just got new glasses a few months ago, should they have changed that fast?” Hitoshi sounded like a worried boyfriend, and if it were another situation, Shota would have thought that was cute.\n“For me, yeah. Apparently, the eyes are hard to recover from malnutrition, but also slow to show problems. The doctor thinking they are closer to what they’ll be in the long run. He said they looked mostly healthy again. Years from now, I might have to have corrective surgery so that I don’t lose permanent vision, but for now, we’re okay.” Midoriya brightly at Hitoshi and bumped his shoulder, showing him he was okay. Hitoshi nodded again.\n“Wait, you lost vision because you were using your quirk without eating enough?” Hizashi sounded devastated. They should have picked up on it faster. In fact, they didn’t pick up on it at all.\n“Yeah. I’m sure I would have needed them when I was older anyway. My parents both had reading glasses.\" Midoriya’s words didn’t make Shota or Hizashi feel better.Shota glanced at Hitoshi whose face gave a clear, ‘This is what I was talking about.’ Nausea instantly came back and acid began to burn his throat.\n“You said, ‘had’ reading glasses, as in past tense.” Shota said slowly. Fighting the urge to throw up and remembering the pointed looks he’d gotten when mentioning Midoriya’s mother.\n“Yeah, they both did.” Midoriya seemed confused when answering.\n“He doesn’t know your mom died.” Hitoshi said gently, putting his hand over Midoriya’s.\n“Oh.” Was all Midoriya responded with. Eri looked down as well, obviously the news wasn’t news to her.\nShota looked at Hizashi, panicked, confused, upset, and Hizashi returned each emotion. Throwing another devastated look on top of it.\n“When?” Shota finally managed after a few seconds.\n“Near the end of first year.” Midoriya said quietly. He closed in on himself even more. Eri got up and ran back to the kitchen grabbing Midoriya’s duffel. She opened it and handing a white tiger stuffed animal to Midoriya, a large hoodie to Hitoshi, a pink blanket for herself, and handing over a larger green blanket to Hizashi and Shota. Hizashi took it, clearly confused. Hitoshi quickly pulled on the hoodie, putting his nose to it and inhaling. Midoriya latched onto the stuffed animal. Eri wrapped herself into blanket.\n“It’s the, ‘It’s been an emotional day” kit. Usually we have movies and pizza too.” Eri explained. Both adults nodded and draped the blanket over themselves. Shota did have to admit, it was a very comforting blanket. It seemed to be weighted, but still breathed. He was going to have to ask where Midoriya got this. If he wasn’t completely awake from the coffee and emotionally charged talk, he’s sure he would have been out.\n“Who do you live with? Why didn’t you tell us? How?” Hizashi’s mind seemed to be reeling.\n“I live by myself. I told All Might, I thought he’d told the staff. It’s why I was late coming back by three days from break. After that, I didn’t really want to talk about it. I figured no one wanted to upset me. It was a car accident on her way to work.” Midoriya leaned farther into Hitoshi.\n“It’s late, but I’m sorry for your lose.” Shota’s voice was small. “We weren’t made aware of the situation. Have you been living by yourself since then?”\n“Yeah, I got emancipated when I was 16. Thank you for your condolences; I have a lot of mixed emotions about the whole thing.”\n“Who did you live with until you got emancipated?” Shota questioned again. Knowing that Midoriya didn’t turn 16 until the middle of second year.\n“Myself.” His answer made both adults look down, upset with themselves, the staff, the world.\n“How did you get an apartment before you were emancipated without a guardian signature? How did you get money?” It’s like every answer just raised more questions for Shota.\n“I didn’t. To either. My mom had a life insurance policy, so when I got emancipated I was able to access it. Which is how I have money now. Plus, I do odd jobs here and there. For the 6 months before that, anytime we’d have a break from the dorms, I’d either sneak back into the dorms, stay the night with a friend, or stay in the park or beach.” Midoriya seemed to be uncomfortable, but still answered. He hugged the tiger tighter.\nShota had missed the signs. One of his first years was going through a great lose and was homeless, and he hadn’t noticed.\nHitoshi was right. He’d failed his student.\n“Did All Might know?” Hizashi asked softly. It was almost a whisper, something Shota hadn’t heard him speak that quietly for years.\n“I don’t think so. He never asked where I was going to live.” Midoriya seemed to untangle from Hitoshi and started to stand up. “Can I take a break?” He asked them. They both nodded. “Can I use the balcony?” He asked again. Once again, they both nodded. Midoriya reached into the duffel and pulled out a small black case and quietly went out to the balcony. All four people inside watched him take out a cigarette and grip the railing as he smoked. Once again, neither of his kids seemed surprised.\n“I didn’t know he smoked.” Hizashi said quietly.\n“Yeah, he’s tried to quit a few times. But it never sticks.” Hitoshi told them, watching as Midoriya seemed to be trying to relax. Hizashi looked at Shota, before untangling himself from under the blanket. Shota watched him walk to the small oyster table near the door and reach into one of the decorative urns, pulling out a packet of cigarettes before walking out. Midoriya turned out to look at him, but Hizashi just pulled a cigarette out and walked to the railing, not speaking. The action seemed to calm Midoriya down and they both stood, smoking in silence.\n“I didn’t know pops smoked.” Hitoshi said, staring out at the two of them.\n“Yeah, he’s tried to quit a few times, but it never sticks.” Shota said, echoing Hitoshi’s answers. The other nodded silently, seeming to understand. Eri looked back from the window to Shota.\n“Is that why ‘Zuku smells like home?” She asked innocently, but her question seemed to throw Shota for a loop. It made Shota feel like he had forgotten about one of his children, but he guessed in a way, he had. Midoriya seemed to be a part of his family, even without his knowledge.\n“I don’t know.” He told her honestly. She yawned just as both men were walking back in. Midoriya sat back down and Eri crawled over putting her head in his lap. He immediately began combing his fingers through her hair, making her close her eyes instantly. It was another moment Shota wished he could see when there wasn’t so much tension in the air.\n“You seem to have quite a number of scars, Midoriya.” Shota tried to keep his tone empathetic. “Eri said, you also knew what it was like to be hurt.” Midoriya’s hand still in Eri’s hair for a moment.\n“Yeah. Eri and I clearly have different situations, but yeah, when I was younger, I got hurt a lot.” He spoke slowly, and seeming guarded.\n“How did you get hurt?” Shota asked directly, hoping he wouldn’t find a way to dodge the question. Midoriya looked to Hitoshi who nodded at him. Almost as if he was giving him permission or maybe to reassure him it was okay, at this point Shota didn’t know anything.\n“I got bullied a lot when I was younger. My dad didn’t really like me that much and sometimes my mom would get mad. I apparently look a lot like my father.” Again, his answer was soft and slow.\nAfter knowing Todoroki’s story, he knew exactly how much a mother could do when a father’s look alike was around.\n“When did the bullying stop?” Hizashi asked, speaking for the first time since coming back into the apartment.\n“Beginning of first year.”\n“Do you mind, showing us the scars?” Shota wasn’t sure why he asked, he honestly wasn’t sure he wanted to know. Midoriya thought for a few moments before nodding that he would show them. Eri sat up, eyes filled with concern. Both parents were aware how much she hated her own scars, they weren’t sure how she’d react to seeing her heroes.\nThough, Shota figured that she’d already seen them at least once. Midoriya stood up and pulled off the black cut off. His the half sleeve stopped at his shoulder where a scar stared. It was a straight line two inches long, thin, and raised. Shota took off the blanket, walking slowly to Midoriya. He seemed nervous to be standing eye to eye with his teacher, but Shota tried to focus on the scars instead.\nHis ribs were tattooed with a quote about heroics, Shota didn’t stop to read it, instead focusing on the on the red healed burn marks on his side and the small hand prints the look as though they were burned into the tops of this chest. Three lined scars, like the one on the top of his shoulder, were placed randomly on his torso. Shota turned his gently. His back was worse by far. Two long gashes, stretched him shoulder to hip. More line scars. A burn scar was on his lower back, opposite hip to gash marks. Another slightly larger hand print was on the back of his ribs. A multitude of thin ovals burn scar were on the back of both biceps, only barely noticeable through the tattoo covering one of the biceps. Shota knew they were probably finger prints.\n“Is this all of them?” Shota ask quietly. Midoriya still turned away from him, shook his head. “Can you show me the rest?” Midoriya turned to look at Eri. She seemed to understand and she got up.\n“Call me back in when you’re done, okay?” She gripped his hand and he nodded to her. Shota saw her walk towards the hallway. Once she was out of sight, Midoriya slowly step out of his grey sweatpants. Leaving him only in a pair of briefs. He turned back around, folding his arms over his chest. Clearly uncomfortable with being almost naked. Shota saw more lined scars on his thighs. One thigh had another tattoo, covering a scar that Shota couldn’t make out, though he realized it was probably the point of the tattooes. Once again Shota turned him back around slowly. Seeing two more hand prints around his ankles, the hands were small, but he thought they looked smaller than the rest. Several more gash scars went over the back of his thighs.\n“You can put your pants back on.” Shota told him. The room the deathly quiet. Midoriya put his pants back on quickly. “Eri, you can come back.” Eri quickly walked back out and hugged Midoriya. Her hand tracing one of the lined scars on his torso. He pet her head before stepping back, reaching for his shirt that Hitoshi had.\n“How did you get those?” Shota asked him, sitting back on the couch, putting the green blanket back over himself, needed all the comfort he could get. Midoriya sat back down, hugging the tiger, while both Eri and Hitoshi seemingly leaned into him.\n“The larger burns are from my dad, the long scars are from my mom and dad, the smaller line scars are from my mom or kids at school, and the hand prints are from a kid at school.” Hitoshi was scowling at the table, clearly upset for Midoriya. Eri closed her eyes and rest her head against Midoriya, he wrapped a protective arm around her and pulled her closed.\n“Where is your father now?” Shota could tell Hizashi was angry and trying to hide it.\n“Pretty sure he’s in jail in America. He walked out when I was 5 and went to America for, ‘work’. Turns out work was robbing banks and burning security guards.” Shota and Hizashi both let a shocked sigh. This kid. He’d been through so much. Too much.\n“What about the bullies? They were punished, right?” Hizashi almost sounded hopefully, like he was asking whatever God was above to let this kid get something.\n“No. No one really cared. I was just the quirkless kid. People could do whatever they wanted.” There was a brokenness to his voice that Shota hadn’t heard before.\n“What do you mean, quirkless?” Shota leaned forward, confused. He knew the kid had a quirk. He’d seen it many times. Once again, Midoriya seemed to look to Hitoshi, who again nodded. He then looked to Eri who gave him a smile.\n“I didn’t get my quirk until during the UA entrance exam when I was 14.” Shota thought his mind was going to explode. Hizashi opened his mouth, but only an undistinguishable sound came out. Midoriya took that as a sign to continue. “It’s called One for All. That’s the actual name of my quirk. It’s passed down from person to person. I’m the 9th holder. I told you before that it wasn’t like All for One, and while that’s true, it’s not the whole story. All for One had a quirkless brother who he gave a stock piling strength enhancing quirk to. His brother did actually have a quirk it turns out, the quirk was the ability to pass down a quirk to someone else. That’s how One for All was born. It remembers quirk of the users who had it before. Technically, I have 7 quirks that fall under the umbrella into one, I’ve just only unlocked three.” Both adults sat on the couch stunned. Hizashi seemed to recover faster.\n“Why only 7, I thought you were the 9th?” He asked. Midoriya nodded his head.\n“The previous user and I were both quirkless.”\nShota thought back to the tattoo that Eri said was a tribute. It said, ‘Smash’. Just like-\n“All Might gave it to you.” Shota didn’t question. He knew. Hizashi looked from Midoriya to Shota and back again. Midoriya only nodded.\n“It’s a secret. Please don’t tell anyone.” Midoriya’s voice was soft, but there was an urgency underneath it.\n“That’s why the League always targets you.” Shota’s voice was nothing more than a whisper now. It’s like all the pieces were making sense. They all fit together to form a much different picture of Midoriya than what Shota previously had.\nHe’d missed all the signs. If only he’d asked questions. Reached out. Anything. Of course, Midoriya was shy in front of adults, no adult seemed to have cared before. He was reserved with his peers, previously he’d been bullied. He started trying to think about all his interactions with Midoriya since meeting him.\nHe remembered his first, when he told Midoriya that he didn’t think he had it in him to be a hero because he had no control, when really, he’d never had time to learn. He thought about Bakagou’s violent reaction to him having a quirk. His brain stilled. Midoriya had hand prints, which looked like a child made them.\nHitoshi hated Bakagou.\nEri wouldn’t stay in the same room as him.\nThey came from the same school.\nIn training simulations, Bakagou always went after him with such extreme force.\nFor what seemed him the millionth time, Shota felt nauseous. He’d made them partners on so many occasions. He’d ignored when Midoriya seemed like he didn’t want to work with him. When Bakagou would go after him instead of their real target. When Bakagou broke Midoriya’s nose during the first final first year.\nHe ignored all the signs.\nShota looked to Hitoshi again, catching his eyes. Hitoshi looked away, almost ashamed. Shota felt like he was breaking.\n“He was your bully. You aren’t rivals at all.” Shota spoke and his voice cracked. The tears that he’d tried to hold back earlier filled his eyes. Midoriya seemed to understand his jump in his train of thought.\n“It’s okay, he’s better now. At least, he’s better with other people, and he can work with me without trying to kill me anymore. He knows, about One for All. For a long time, he was the only one that knew. He knew I didn’t have a quirk, and then after we fought at Ground Beta, All Might thought it was best to let him in on the secret.” Midoriya told him. Hitoshi clenched his fists and Hizashi looked a little confused before sitting up straighter.\n“Bakagou? Bakagou is the one that made those hand prints?” He was angry again. Shota wish that he wasn’t devastated enough that he could feel angry again too.\n“Really, it’s okay. I’ve made peace with it. My therapist and I have talked at nausea about Katsuki and our relationship.” Shota didn’t know when Midoriya had stopped calling Bakagou by the nickname he had for him.\n“You see a therapist?” Hizashi questioned. Midoriya nodded. Eri perked up.\n“He sees Mindy!” She said smiling before laying her head back down in Midoriya’s lap. Hizashi nodded his head, now understand why he was on a first name bases with the woman.\n“I mean, do you blame me? I’m a little messed up in the head.” Midoriya laughed a little and Hitoshi bumped his shoulder and laughed a little too.\n“No no, I think it’s a good thing. Not because I think you’re messed up either. I just think it’s good to talk about things with someone. You’ve been though-“ Hizashi seemed to paused for a moment “-a lot” he finished. Midoriya laughed again.\n“Yeah, life has been hard. But it’s really okay.”\n“It’s not okay. None of it is okay. You shouldn’t have been seeing a therapist now. You shouldn’t have had to wait months for figure out your quirk. Teachers, adults, students, they should have picked up on the distress that was constantly around you. They should have helped. Someone should have acknowledged your moms passing, you shouldn’t have had to share a giant secret with a person who left permanent marks all over you. I hate when you say it’s okay. It’s NOT okay. They should have noticed.” Hitoshi leaned away from Midoriya, he glared at the table, and his tone filled with anger.\n“He’s right. We should have noticed.” Shota’s eyes went from Hitoshi to Midoriya. “We should have noticed and we didn’t. I’m sorry for failing you.” Midoriya smiled softly and looked into his lap at Eri’s head and the white tiger.\n“Yeah. Someone should have noticed and they didn’t. I learned the first time I met All Might that heroes weren’t what I thought they were and that they sometimes do the wrong thing. The first thing he ever did was save me, then tell me that someone whose quirkless couldn’t be a hero, which is something else after you learn that he’s quirkless too. Then I tried to save my bully and suddenly I was worthy to be a hero. So many bad things happened to me at UA. I’ve fought too many people. I’ve given it my all and mostly all I hear is that I didn’t do it right, I gave too much, or I didn’t give enough. Mindy has made me realize a lot of things about my life and the people in it. Even about All Might, who is an amazing hero and mentor, and someone I care deeply about, but he’s also self-centered, emotionally manipulative, and boarding on emotionally abusive. Someone should have saved me, especially since I go to school with literal heroes, but no one did. So, I saved myself. I’m 17, I’m about to graduate and have my hero license, I already have offers from agencies to be a sidekick, legally, I’m an adult, and I have my own place. Yeah, it’s in a crappy neighborhood, but I knew it was okay, because it’s in Eraserhead’s patrol area and I know that you’re a good hero. You both are. I know you’re good with your kids and with all the other students. I have a great boyfriend and Eri who is little a little sister to me. I have friends. I’m not always in a great mood and some days are really hard. I don’t sleep a ton because of nightmares or stress, but I’m getting better. I’m living life. So, it’s okay. People slip through the cracks sometimes. The system isn’t perfect.” Midoriya help a small smile the whole time he spoke. His tone was never callas or malicious. He spoke in facts and didn’t hold anything back. Shota wasn’t sure when he started crying or when Hizashi started crying either. “I think we all need another break.” Eri picked herself off of Midoriya’s lap slowly. Her eyes were on the ground, lost in thought. Hitoshi still glared at the table. Midoriya leaned over and kissed the side of Hitoshi’s head before standing and walking outside lighting another cigarette.\n“Dad, Papa, can I ask you a question?” Eri’s voice was small and she didn’t look up from the spot on the ground or wait for either of them answer before continuing. “Why didn’t anyone notice?” Her question was innocent. She was both too young to understand the world and yet she’d already had too many things happen to her, making her understand far too much of it. Shota leaned forward and cried into his hands, unable to answer. Hizashi stood up and again walked outside with Midoriya. Again, neither saying a word. Glancing up, Shota could see how Hizashi cried and how his hands shook while he smoked.\n“Sometimes heroes don’t save everyone.” Hitoshi answered for Shota. Eri wrapped herself in the pink blanket more. The room was silent other than the muffled cries of Shota and the soft breathing of both his kids."
}