{
    "id": "28235568",
    "url": "https://archiveofourown.org/works/28235568?view_full_work=true",
    "author": [
        "favspacetwink",
        "moonlumie"
    ],
    "title": "sleeping dogs lie",
    "rating": "Explicit",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Haikyuu!!"
    ],
    "relationships": [
        "Miya Atsumu/Sakusa Kiyoomi"
    ],
    "characters": [
        "Miya Atsumu",
        "Sakusa Kiyoomi",
        "Miya Osamu",
        "Komori Motoya"
    ],
    "additional_tags": [
        "Prostate Milking",
        "Handcuffs",
        "Masturbation",
        "Angst",
        "Crying",
        "Subdrop",
        "Self-Doubt",
        "Supportive Miya Osamu",
        "self-deprecating thoughts",
        "Gleefully Helpful Komori Motoya",
        "First Dates",
        "vanilla sex"
    ],
    "language": "English",
    "series": "Part 8 of Terminal Curiosity",
    "published": "2020-12-22",
    "completed": "2021-01-25",
    "words": "27,665",
    "chapters": "2/2",
    "comments": "1,030",
    "kudos": "19,039",
    "bookmarks": "954",
    "hits": "347,940",
    "summary": "<p>After his shower, Atsumu walks into the bedroom to find Sakusa laying a drop cloth over what looks like some kind of plastic sheet. The faint crinkle of plastic reminds Atsumu of the way Sakusa set things up the time they played with temperature; it made sense then, because between all the water, ice, and the hot wax, things got really messy.</p>\n<p>Exactly how messy are things going to get today?</p>\n<p>“Hey, Kiyoomi,” a familiar voice answers after only a few rings. “What’s up?”</p>\n<p>“Motoya,” Kiyoomi greets in turn. He watches a seagull land on someone’s balcony across the street. “Where would you take someone for a first date if you’ve already known them for years?”</p>\n<p>“Hmm, well, if you’re already friends—wait, what?! Oh, holy shit—Kiyoomi, are you going on a date?!”</p>\n<p>Kiyoomi narrows his eyes, “Why would I be asking if I wasn’t? It’s this Friday, so I can’t pick anywhere with an extended reservation list, either.”</p>\n<p>“No, wait, stop,” Motoya says, and Kiyoomi sighs as he hears the sparking mirth in his cousin’s voice. “Who are you going on a date with?!”</p>",
    "notes": "<p>This chapter contains slightly less healthy practices of BDSM than usual. If you need to know more before reading, check out the spoiler tags below.</p>\n<p> </p>\n<p>SPOILER TAGS:<br>Abuse (?) of the color system:<br>Atsumu says green but doesn't quite mean it.<br>SPOILER TAGS</p>\n<p> </p>\n<p>Buckle up everyone... this is gonna be a wild ride but I think you'll like where we end up!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>stay tuned for part 2 :')</p>\n<p>&amp; please let us know what you thought!<br>&amp; if we should add any other tags! this chapter is quite heavier than the others</p>\n<p>Sorry for the wait. Thank you to all readers for sticking with us. It means more to us than we can say.</p>\n<p>Hope the wait was worth it, and please enjoy!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>Please leave a comment if you enjoyed! Thank you so much for reading.</p>",
    "text": "Atsumu has hit a new low.\nHe would have thought his low point fell somewhere right around when he hit ‘post’ on a Grindr bio about liking it rough. \nIf not then, then surely the moment where he stood on a freezing street corner, wearing the most hideous yellow and lime green hoodie in existence, to avoid the man he’s fallen for—the man who just reiterated point blank that he doesn’t care who Atsumu fucks,  after being fucked by him—also had to be up there.\nOr... down there? Atsumu doesn’t know. \nHowever, in spite of all that, Atsumu manages to top both of those easily the very next morning, naked from the waist down, fisting his own cock with his nose buried in that very same highlighter-yellow sweater. The irony is that the hoodie, frustratingly, barely smells like the object of his affections at all. No, it smells like the extra strength detergent Sakusa uses to double-wash his clothes on the industrial setting or whatever the hell he does to purge his garments of even the faintest whiff of his own scent. \nBecause even if the detergent is familiar, it always takes on a completely different smell once Sakusa puts his clothes on. Atsumu knows that it’s not just the fabric, but the scent of Sakusa’s hair, his  sweat —\nAnd it doesn’t smell like  this,  Atsumu thinks angrily. His fingers curl into the collar and yank it downwards, away from his face. \nHe throws his head back and strokes himself faster, deciding to concentrate on something else instead of the scent of the hoodie. He moans and brings his free hand up to find the bruise Sakusa sucked into his throat yesterday. It was already dark against his skin before he went to bed last night; this morning it’s been throbbing gently with his pulse, sore even before Atsumu reaches up to press on it and turn it into a deeper sting that makes him squirm.\n “Ah…”  \nFuck, he can’t get enough. Atsumu circles his fingers over the bruised skin, hissing as the pain shifts with his touch, dick jumping in his hand.\nAs he gets close, Atsumu bites his lip, a perverse need to ask permission stuck at the tip of his tongue. It’s just… it’s always so much more satisfying to come after Sakusa  tells him he can. He turns his head into the pillow and tries desperately not to think about how Sakusa would react if Atsumu texted him right now and asked. Sakusa could… fuck, he could tell Atsumu to edge himself a couple times before going over. Sakusa could make him beg for it. \nOr Sakusa could  call him  . Atsumu moans again when he thinks about what he might say, voice a low purr as he instructs Atsumu how to touch himself, or teases him for how needy he is, or calls him a good boy for asking permission to come and tells him to  go ahead, Atsumu, you earned it —\n “Shit,”  Atsumu gasps, shooting his free hand down just in time to catch his release in his cupped palm.\nWhen he starts to come down, Atsumu reaches robotically for a tissue to clean his hands as reality crashes back over him. Fuck, he feels gross. And a little guilty. It’s more than likely Sakusa would just reply that he doesn’t care what Atsumu does, or worse, that he never consented to any kind of sexual play outside their scenes and to please not ask him that again. \nShit.\nAtsumu yanks the lemon-lime monstrosity off and chucks it in the general direction of his laundry hamper as he stalks towards the bathroom to clean up. \nThe restless feeling only worsens when Atsumu is faced with the prospect of climbing into Sakusa’s car only an hour later. His own car is still over at his apartment from the night before. They had a prearranged plan for Sakusa to pick Atsumu up for practice, so it’s not like he can avoid him. \n“Good morning,” Sakusa greets him as Atsumu settles into the leather seat. \n“Mornin’.” \nAtsumu takes a deep breath and resists the urge to yell in frustration when his head is filled with the exact, unique scent that he’d failed to find on the club hoodie he’d embarrassed himself with that morning. \n“Are you feeling alright?” Sakusa asks as they roll onto the street. “Chest okay?”\nAtsumu can’t restrain his smart mouth as he leans against the car door, “No lasting damage from yer nip-obliterating clamps, no. I looked those up last night, by the way. Ya sure didn’t hold back, didja?”\nSakusa snorts. \n“Someone with your affection for pain would have found clamps for beginners to be nothing more than temporary nipple jewelry,” he chuckles. “That’s boring.”\nAtsumu chuckles in spite of himself. “You really are an asshole, ya know that, Omi-kun?”\nSakusa continues to grin, self-satisfied, under his mask.\n“Might have heard that, once or twice,” he murmurs. \n Gosh,  Atsumu likes him. He likes  this  , what they have. It’s in casual moments like this that he realizes what was once played-up but genuine animosity between them has turned into a real friendship. It’s not that he used to  dislike  being around Sakusa, but most of the enjoyment he previously drew from it was a direct result of them butting heads. At the absolute most he would have called them frenemies. \nNow… while they still talk a lot of shit, it’s  different.  It shouldn’t be shocking. They’ve spent a lot of time together; of course they’d get more comfortable with one another. He just didn’t expect to like what he found behind Sakusa’s prickly exterior so much. \nIt’s not like he’s even this sweet or different dude once you get to know him. Behind his hard jerk walls there’s really just a soft jerk center—but the soft part makes Atsumu’s gut twist and flutter. The times when Sakusa smiles or laughs, a quiet and understated thing, Atsumu finds himself cherishing those moments. While he’s not very observant and doesn’t care that much about inconveniencing people he finds annoying, when push comes to shove Sakusa is actually fairly considerate and even... thoughtful.\nHe complains about Komori bothering him and sending him dumb texts, but made time to take him all over Osaka when he visited. He gets grouchy when Bokuto and Hinata watch him stretch his freakish wrists, but he’ll stay for hours after practice to help Hinata with his cut shot. Sakusa will insult Atsumu eight ways from Sunday but… well, there are too many things he’s quietly done for Atsumu, while domming or otherwise, to even list. \nThe rest of the drive passes in comfortable silence. The drizzle, just on the edge of snow, collects on the windows before running down in streams. Atsumu rests his chin on his palm and watches streetlights diffusing through water. \nHe knows he’ll have to deal with things one way or another, at some point—that this isn’t sustainable—but for now he just lets himself relax into the familiar scents and calm companionship inside the protective walls of the car. \n \nAtsumu is in his bathroom around three hours before game-start, a handful of products scattered across the counter. After the absolutely brilliant move of going into practice with a neck full of bruises, Atsumu realized he needed a real bruise covering strategy. He was only a couple of months late, he supposed. He had the weird color-correcting palette that Sakusa gave him ages ago, but never bothered to pick up the powder to go over it. After trying some drugstore powder and immediately sweating it off the day after the altercation in the stairwell, Atsumu eventually sought out a make-up specific store. It wasn’t difficult to find one in the shopping mall by the practice facility. \nHe entered with some amount of confidence which was immediately shattered upon taking in the vast and overwhelming boutique. After wandering the first aisle looking like a fish out of water, an employee found him and took pity.\n“Hello, sir. Can I help you find something?”\n“Um… I need the stuff that’s supposed to go over color correction makeup. To, uh, cover… some, um, marks on my skin,” Atsumu said, face flaming. “Something that won’t come off easily. I, um, sweat a lot at my job.”\nThe employee, a young woman with bangs and the sharpest eyeliner wings that Atsumu had ever seen, looked very quickly down at Atsumu’s neck. Her eyes darted away immediately after and she smiled pleasantly. \n“Right this way,” she said, leading him down the aisles, matching a foundation powder to his skin and eventually pressing a small spray can into his hands. “This is  setting spray.  You put this over your makeup and it’s not going anywhere. I mean it’s not going  anywhere. ”\nThank the heavens above for professional, smart, and helpful sales associates.\nStill, now that the choking bruises are completely faded, Atsumu hesitates with the setting powder in his hand. He knows he needs to cover up the hickey before being on TV. He  knows that. The bruise Sakusa left after they last played is no small thing. Still, he twirls the setting spray in his fingers. \nHe reaches up with the back of his palm and rubs at his perfect makeup job. He doesn’t rub it all out, but removes just enough makeup that a shadow of the bruise can be seen. Before it can really sink in how ridiculous he’s being, Atsumu applies the setting spray and heads out of the bathroom.\nHe pulls his shoes on and grabs his phone. There’s one message.\nFrom:  Omi-Omi\n&gt;&gt; I saw something in my dom group that I want to try\n&gt;&gt; *link attached*\n&gt;&gt; I don’t think it’s on any of the lists because it’s kind of specific, so let me know if it doesn’t look interesting to you. Regardless, do you want to meet up this Sunday?\nAtsumu clicks the link, brow furrowing as he reads. Based on it not being on the lists, he expected something crazy or hardcore, but it’s just a little… weird. He shrugs. If Sakusa’s into it, he’ll try anything once as long as it’s fairly benign. \nTo:  Omi-Omi\n&gt;&gt; Weird. Sure.\n&gt;&gt; Yeah I’m free. We can talk specifics after the game. \nFrom:  Omi-Omi\n&gt;&gt; Don’t kinkshame.\nAtsumu can’t help but snort at Sakusa’s dry joke. He hefts his bag onto his shoulder and glances at himself in the small mirror hanging on the wall in the genkan. He fixes his hair and ignores the purposefully exposed mark on his neck as he heads out the door. \n \nAs Atsumu drives into the garage under Sakusa’s apartment complex that Sunday, he wonders what it says about him that he can already feel his dick starting to stir. Even pulling into the guest parking area is like a Pavlovian trigger at this point.\nHe just… he can’t help it. He’s  excited. Not just for the scene, but for everything else that comes with it: the careful attention Sakusa pays him during the aftercare, the smile that plays at his lips once everything’s cleaned up and they’re both settled on the couch, the ease of their interactions when it’s just the two of them. \nDuring a scene, It’s always been easy for Atsumu to forget that anything else exists beyond Sakusa—to feel totally and thoroughly owned, like Atsumu is  Omi’s, plain and simple. But the moments before and after are starting to feel sacred as well; when the two of them are holed up together, hiding away from the outside world, it’s dangerously easy for Atsumu to pretend that Omi is his, too.\nAtsumu blinks, staring at the concrete wall of the garage as his car idles.\nFuck. He’s got it so bad, he thinks as he yanks his key out of the ignition . \nHis heart races on the elevator ride up to Sakusa’s apartment. The self-doubt and insecurity that have been plaguing him since their last scene are melting away by the second, replaced by an intractable giddiness that’s making his toes curl in his shoes. Atsumu did some extra research the other night after Sakusa sent him the link on prostate milking. The first article implied it was easiest if the person receiving stimulation was soft, which had Atsumu a bit worried. Luckily, most posts he read seemed to agree that it  can work even if the sub is hard, which—thank god, because he’s more than halfway there already just thinking about it. \nAtsumu bounces in place and bites his lip when the elevator reaches Sakusa’s floor. He takes a deep breath in and out, then lets himself in after a cursory knock on Sakusa’s door, locking it behind him. After taking off his coat and shoes, he finds the other man sitting at the kitchen table, squinting at something on his laptop.\nSakusa looks up and gives him a once-over, making Atsumu blush. \n“Hey.” \n“H-hey.”  Smooth. “M’just gonna—um, I should—”\n“Do you want a cup of tea first?” Sakusa asks. “Don’t take this the wrong way, but you seem a bit frazzled.”\nAtsumu runs a hand through his hair, conscious of the half-chub he’s sporting and praying his jeans are hiding it. He probably does need to slow it down a little, especially considering what they’re about to do. \n“I’m never anything but completely put together,” Atsumu replies, and then nearly trips over a rug. Sakusa chuckles lowly, and Atsumu lets the joke go, chest warm with his goal achieved. “Sure. Thanks, Omi-kun.”\n“Of course.” Sakusa stands up and stretches, his thin cashmere sweater riding up and exposing a sliver of skin at his waist. Atsumu’s mouth goes dry. “Motoya always says there are very few things a hot cup of tea can’t fix.”\nAs Atsumu slinks over to the table and Sakusa busies himself preparing the tea, a small wave of melancholy laps at his feet as Atsumu wonders if he’s found one of those things.\n“Which… is objectively ridiculous,” Sakusa adds, and Atsumu thinks  there it is. \nAtsumu snorts, “And here I was thinking you finally developed an optimistic streak.”\nSakusa shoots him a disapproving glare over his shoulder. \nThe momentary feeling of sadness disappears as quickly as it came, driven off by fond amusement and the anticipation of the scene. For now, Atsumu lets himself enjoy the quiet calm of sitting at Sakusa’s kitchen table, staring at his broad back as the other man makes him a cup of tea.\n \nAfter his shower, Atsumu walks into the bedroom to find Sakusa laying a drop cloth over what looks like some kind of plastic sheet. The faint crinkle of plastic reminds Atsumu of the way Sakusa set things up the time they played with temperature; it made sense then, because between all the water, ice, and the hot wax, things got really messy.\nExactly how messy are things going to get today? Atsumu shivers and grips the hem of the towel wrapped around his waist.\n“Ready?” Sakusa asks, turning to look at him.\nAtsumu nods, throat bobbing.\n“Good.”\nSakusa grabs the collar from the bedside table and beckons Atsumu over to him, one corner of his mouth tugging up in a devastating smirk. As Atsumu closes his eyes and feels the soft, padded leather wrap around his throat, he doesn’t know how to describe the feeling that washes over him as anything other than calm excitement. It sounds like a contradiction, but…\n“Open your eyes, Atsumu.”\n...but Atsumu knows Sakusa will take care of him.\nHe lets his eyes flutter open, hyperconscious of the weight of the leather encircling his neck. Sakusa’s hands linger on Atsumu’s shoulders after buckling the collar in place; his gaze is heavy, nearly suffocating as his eyes slide down the length of Atsumu’s body and settle between his legs. His hands follow, wrapping around Atsumu’s wrists and loosening his grip on the towel bit by bit.\n“Mm.” The towel falls to the floor and Atsumu’s cheeks flame as his dick bobs free. “You sure you’re going to be able to do this for me, Atsumu? It won’t be easy when you’re this hard.”\nAtsumu swallows, the gentle humiliation making his cock twitch as they both watch. \n“I c’n do it, Omi.”\nGod, he hopes he can.\nSakusa’s smirk grows into a small smile, “Good. Get on the bed and face the headboard.”\nHe reaches around and gives Atsumu’s ass a little pat for emphasis, making Atsumu duck his head and scramble onto the bed, sitting on his heels and trying to hide the way his blush is spreading down to his chest. The fur-lined handcuffs are already attached to the headboard by a pair of long chains, sending a thrill all the way down to Atsumu’s fingertips as he clutches at his own thighs in anticipation. He feels the bed dip, feels Sakusa slide up behind him, his clean, crisp clothes pressing against Atsumu’s bare skin.\nAtsumu sucks in a shaky breath when Sakusa reaches in front of him to take hold of his wrists, wrapping him up in a perverse imitation of a hug. His chest is warm through the expensive fabric of his button-down; Atsumu finds himself tilting his head to the side, baring his throat like it’s instinct.\n“Oh, look at you,” Sakusa murmurs, lips brushing the shell of Atsumu’s ear.\nRight before Atsumu went under for the very first time, he remembers having a moment of startling clarity. He wondered how on earth he’d gotten to that specific point, letting Sakusa Kiyoomi tie him up so tightly he couldn’t move an inch, then hit him with a riding crop and fingerfuck him until he cried.\nNow, the way Atsumu just angled his neck without thinking about it, hoping— praying— that Sakusa will kiss him there, give him more bruises, do whatever he wants with Atsumu’s body… well, Atsumu can’t think of anything more submissive than that.\nOh, god. What has Sakusa done to him?\nHis self-awareness ebbs away when Sakusa starts to kiss down the line of his jaw, each press of lips hot and calculated, trailing down the soft skin of his throat as Atsumu moans and arches his back. A deep ache blooms when Sakusa sets his teeth into the very spot he marked up the last time they played; Atsumu squeezes his eyes shut and chokes back a whimper, breathing hard as Sakusa worries the little patch of skin until it’s throbbing.\nHe feels Sakusa guide one wrist into the restraints, then the other, anchoring his arms a comfortable distance in front of him. Atsumu isn’t totally restricted—he subtly moves each arm side to side, confirming that the cuffs only keep him from pulling his hands back to touch himself or interfere with whatever Sakusa chooses to do.\nSakusa’s tongue flicks out to press against the sore skin he’s been sucking.\n\n “Fuck…” \n\nSakusa unlatches from his throat with a slick sound that goes straight to Atsumu’s dick. \n“Color?”\n“Green,” Atsumu breathes, widening his stance where he’s perched on his knees. \nSakusa lays one more kiss over that bruised spot before he pulls away, cold air hitting Atsumu’s back. “Mmn. Get on all fours, then. You might have to scoot up a little.”\nAtsumu exhales slowly and does as he’s told, maneuvering onto his elbows and knees and shifting until he’s comfortable and there isn’t any strain on his muscles. His cock hangs between his legs, embarrassingly stiff, proof of how desperate he is for this. \n“Good, just like that,” Sakusa purrs. Atsumu hears the  snap of a glove, the familiar pump of the lube bottle. “I know you’re a little worked up, but you’ll need to stay away from the edge for this. If you feel like you’re getting too close, just tell me, okay?”\n“Okay,” Atsumu chokes out.\nHe shifts a little and hears the crinkle of plastic underneath the dropcloth.\nThe first touch of warm, slick fingers at his hole makes Atsumu jump. Sakusa makes a quiet noise and strokes his bare hand over Atsumu’s hip, drawing slow, lazy circles at his entrance with the gloved one. Atsumu groans and drops his head, letting it hang in between his shoulders as Sakusa applies just the tiniest bit of pressure, not enough to push inside but enough for Atsumu to crave it.\nAtsumu has no fucking clue how he’s going to stay away from the edge. Every other time he’s been in this position, either with a partner or by himself, the end goal has always been to come. How is he just supposed to ignore years of experience?\nThen Sakusa slips two long fingers inside him and Atsumu forgets to be worried.\n\n “Hmnngh…” \n\nSakusa makes a quiet nose and curls his fingers, pulling them out slightly so that they’re comfortably nestled against Atsumu’s prostate. Atsumu whines at the feeling, cock dripping. It’s sooner than he’d normally be touched there, and more direct. It does strange things to Atsumu’s belly, the way it feels almost  clinical , the way Sakusa has isolated his touch to his sweet spot. \n“There you go, Atsumu.” Sakusa begins to circle his fingertips gently, pulling another whine from Atsumu’s chest. “Don’t let it build into anything. Just focus on the feeling of your whole body.”\nHe moves his fingers in a little circle again, and again, varying the pressure as he moves them until he finds an obscene rhythm that seems to satisfy him. It’s not something that Atsumu’s ever experienced before. \n“Ugghhh,” Atsumu groans, rolling his hips unconsciously.\n“Shh, stay still,” Sakusa whispers, tightening his grip on Atsumu’s flank. “Make sure you’re breathing… and, I know it’s difficult, but try to relax, hm?”\nAtsumu attempts to at least push the tension upward, away from where Sakusa’s touching him; he makes a conscious effort to relax his pelvis at the same time as he flexes his fingers, curling his hands into fists and tugging on the cuffs. Sakusa has shifted to half-circles, focusing on one side of his prostate and then the other, back and forth, back and forth, the sensation deep and visceral.\nInescapable.\nAtsumu bites his lip and fails to hold back a whimper, his dick drooling precome onto the dropcloth. “Fuck—oh,  fuck…” \nHis own breathing is loud in his ears, panting in the echo chamber of Sakusa’s room, even louder than the squelch of Sakusa’s fingers inside him. Sakusa rubs his thumb over his hip and Atsumu scrabbles to grip onto the flimsy cloth covering the bed, desperate for something to hold onto.\nThe focused stimulation is quickly doing what it normally does: pushing Atsumu toward orgasm. He cracks one eye open and peers underneath his body, watching his cock sway and jump as Sakusa massages his prostate. His fingers aren’t even that deep but it feels like he’s touching Atsumu’s very core, probing and pushing as he works Atsumu higher and higher.\n“Omiii,” Atsumu whines, eyes fluttering closed again as he tries to keep his pelvis relaxed. “Ugh, it’s—oh god—”\nHe feels himself clench involuntarily at the measured patterns Sakusa is drawing with his fingers. It’s as if Atsumu’s body is slowly slipping out of his control, muscles jumping at random as Sakusa pets firmly over the little gland. He’s never had prostate stimulation this  focused before; it’s getting hard to tell if he needs to pee or if he just really, really needs to come.\n“Don’t clench up,” Sakusa reminds him, voice low.\nAtsumu groans, rocking forward to try to get away from the relentless pressure inside him. If he relaxes, he’s worried he’ll—he’ll—\n\n Smack! \n\nAtsumu jolts at the sudden hit, a panicked noise escaping him as Sakusa curls his fingers then spanks him again.\n“What did I say about staying still—”\n“Stop-stop- stop , gonna come,” Atsumu gasps, back bending and squeezing his eyes shut tight. His hands try to flash back, to grab the base of his dick to hold back or touch himself, he’s not sure. They don’t go far though, chains catching and sending Atsumu awkwardly chest first into the bed. He feels Sakusa’s fingers go still and concentrates with all his might on holding back. “S-sorry.”\n“It’s alright,” Sakusa murmurs. His hand returns to Atsumu’s hip, soothing; something loosens in Atsumu’s chest. “Thank you for telling me. You did what I asked you to, so don’t apologize.”\nAtsumu grins stupidly against the dropcloth, still trembling. Sakusa’s fingers feel heavy inside him, sitting right up against where he’s most sensitive.\n“Plus, that was partially my fault. No matter how many times I see it, it always surprises me just how much of a masochist you are.”\nIt’s followed by a quick pinch to Atsumu’s inner thigh that sends him gasping. \n Shit. Atsumu’s dick twitches and he squeezes around Sakusa’s fingers as his blush returns full-force. Sakusa’s quiet chuckle seems to invade all his senses. It’s embarrassing how fuzzy his head gets whenever Sakusa talks to him like this, when he treats him like this. \n“You have to try to stay still, though,” Sakusa continues, petting the small of Atsumu’s back soothingly as he starts to rub careful fingertips over Atsumu’s prostate once more. “The more you move around, the more mixed signals you’re sending your body.”\nAtsumu sighs, trying to gather whatever small scraps of his resolve haven’t already crumbled. He can do this. He can be good. He surrenders completely to Sakusa’s relentless fingers as he lets his body go limp, a groan leaking out of his throat.\n\n “Omi…” \n\nThe pressure is all encompassing, but softer when Atsumu stops fighting it. Without his muscles tensed, Atsumu finally stops feeling like he’s swimming against the tide of his own pleasure. It feels somewhere between embarrassingly detached and uncomplicatedly good for a while. He feels himself getting more and more hazy. \nAfter a few more moments, Atsumu feels his abs start to twitch, then his thighs. It’s involuntary this time, and unrelated to the usual feeling of his lower half tightening in preparation to go over, or to resist it. These are just spasms, almost like the ones he occasionally feels right before he falls asleep, completely unconscious. Atsumu curls his fingers tighter in the drop cloth as Sakusa shifts a little closer, plastic crinkling under his knees. \nThe sounds Atsumu is making are truly shameful but it doesn’t  matter —the only thing that matters is not coming. He can’t let the feeling swell, can’t let it take root. Atsumu’s doing it, but he’s starting to feel strange and almost unfamiliar sensations blossoming between his hips. Sakusa keeps going, too, one steadying hand on his tailbone as he insistently palpates Atsumu’s sweet spot. \n“Pl-please…”\nSakusa makes an amused noise. “Please what?”\nAtsumu doesn’t know. Pressure is building right behind the base of his dick, a familiar heaviness that’s always brought intense pleasure once Atsumu’s been good enough. He’s babbling now, begging just for the sake of it because something in him is that desperate. He just needs to be good.\nThe pressure has become overwhelming. It doesn’t feel exactly like an orgasm, or an edge, but even though it’s unfamiliar, Atsumu suddenly realizes he’s not going to be able to hold it back. He lets out a sound like a sob at the realization, his body slipping away from him. \n“Ugghh— fuck—” \nDon’t come. Don’t come. Don’t come don’t come don’t come—\n\n Drip, drip, drip. \n\nAtsumu knows he’s not coming. He feels close, he feels  really close, but they’ve played with edging so often that he’s gotten used to that feeling, learned to separate it completely from the sensation of actually going over. There was no flash of pleasure, no moment where he felt like he snapped under the mounting pressure. \nSo why does he feel like he’s… \n“Oh, there you go,” Sakusa purrs. “Look at that. What a good boy, getting it on your first try.”\nDistantly, like his ears are stuffed with cotton, Atsumu hears the sound of more liquid hitting the dropcloth. He’s trembling, paralyzed by the foreign sensation of ejaculating without any of the pleasure or intensity that normally comes with it. \nIt almost feels like he’s  peeing. The thought is like a bucket of cold water over his head and he peeks hurriedly between his legs, skin crawling as he imagines the disgust Sakusa would feel if he couldn’t control himself like that—what good is Atsumu if he can’t control himself—\nLooking down the length of his body upside-down, Atsumu sees that it’s definitely  come dripping from the slit of his cock, not anything else. It should be a relief, but as he watches the slow, steady flow dribble onto the cloth below, Atsumu irrationally starts to panic. He realizes he’s watching his release slip away.\nSakusa’s fingers press a little more firmly and Atsumu whimpers again. “How does it feel, Atsumu?”\nAtsumu can’t speak. His body is still waiting for the feeling between his legs to crest, suspended in devastating frustration as his lips shape around words that won’t come.\n “Haah… ”\n“That’s what I thought.” Sakusa sounds smug. \nIt makes a wave of heat roll down Atsumu’s body, stopping abruptly at the base of his dick as the sluggish drip of come continues. He’s let Sakusa force his body to do so many things, but he’s never felt so completely controlled by another as he does now. \nAtsumu has no idea how long Sakusa keeps him like that, draining him with every cruel circle of his fingers. He can’t stop groaning, shivering as a feeling he can’t name consumes him; his eyes roll back at some point, then flutter closed. He can’t look at himself anymore. \n\n Drip, drip, drip. \n\nFinally, “You gave me so much. Were you backed up? Poor thing.” Atsumu lets out an inhuman noise, which makes sense since he feels like— “I think you’re all done.”\nSakusa draws a few more agonizing strokes of Atsumu’s prostate, as if he wants to be sure.\n Done? Atsumu starts to panic all over again at the word, feeling empty in more ways than one. The scene can’t be over so soon. It feels like they’ve barely started—does Sakusa not want to—\nAtsumu groans in relief when Sakusa squeezes a third finger inside and starts to stretch him, finally laying off his most sensitive spot. Sakusa’s not  done done with him, just with the… milking. \nA strange feeling has settled in Atsumu’s bones. No longer is he consumed by the desperate arousal he’s gotten used to during scenes; instead, every sensation is muted, like he’s gone numb. Atsumu squirms, wondering if Sakusa will admonish him for moving, but Sakusa just tightens his grip on Atsumu’s hip and fucks him harder with his fingers. \n“Omi…”\n“What’s your color?” \nAtsumu freezes for a moment. What  is  his color? He feels like a stranger in his own skin. He feels off balance  . But… he can still be good. He can still make Sakusa feel good.\nAnd  god, does he want to make Sakusa feel good.\nHe swallows hard, “Green.”\nSakusa makes a low noise and pulls his fingers out; Atsumu squirms and gasps in response, heart fluttering as he wonders what Sakusa sees in him right now.\n“Shhh… I’m here, Atsumu. You’re doing so well for me,” he hears Sakusa murmur.\nThe praise is like a balm for his frayed nerves, keeping Atsumu calm even in the absence of Sakusa’s touch. Sure enough, seconds later he hears the sound of a foil wrapper being ripped open. He feels…  relieved.  \nAtsumu shifts, automatically moving to wipe the drool from his face before he remembers that his arms are restrained. He whines and pulls at the cuffs, shoulders aching as Sakusa smears more lube over his hole before pulling the glove off with a snap.\nHe needs this.  He needs this.  \n“Oh fuck,” Atsumu chokes out, deepening the arch of his back as Sakusa starts to press inside.\nHe clenches involuntarily and hears Sakusa hiss. The overwhelming sensitivity that usually accompanies Sakusa’s first thrust is absent, doused by the strange numbness left between Atsumu’s thighs after the milking. Atsumu groans and rocks back, desperate to feel that spark, that  twist  deep in his gut  , but all he gets is a sharp spank that makes him jump and clench again as Sakusa bottoms out with a quiet groan. \nThen Sakusa stretches out over him, pressing his clothed chest to Atsumu’s back, and threads one hand firmly through Atsumu’s hair before giving it a sharp  tug . Atsumu gasps and grabs fistfuls of the sheets as his throat is bared once more. Sakusa rolls his hips, grinding his cock impossibly deeper even though he’s already buried to the hilt. \n“Ha- aah—” \n“ Fuck , you feel good,” Sakusa whispers. \nAtsumu shivers happily, preening as Sakusa’s lips ghost over the sore, bruised spot on his neck. He feels in danger of floating away. Sakusa’s weight on top of him is the only thing keeping him anchored to the bed. \nAs Sakusa kisses just above his collar and rolls his hips again, Atsumu realizes it doesn’t matter that his body has been so thoroughly worked over that he’s gone soft between his legs even with Sakusa’s cock stroking against his oversensitive prostate with every thrust. Sakusa’s groans in Atsumu’s ear are drowning everything else out. Maybe his body doesn’t need to climax. It’s doing exactly what it should, giving Sakusa pleasure.\n This is what he wants. This is what matters. \nAtsumu drools onto the dropcloth as he’s rocked forward again and again, trying to keep his back in its deep arch, and  glows.  \n \nKiyoomi shudders as he mouths at Atsumu’s neck. Between the unique, obscene control that prostate milking gives him and the way that Atsumu’s body is twitching around him, this could be over in less than a minute if he’s not careful. \nAtsumu is just so…  good. Kiyoomi’s stomach feels warm thinking about it.\nHe grunts and lets go of Atsumu’s hair in favor of shoving three fingers between Atsumu’s slack lips. Atsumu moans and sucks on them immediately, like it’s fucking involuntary. Kiyoomi is covering him with his body, filling him from both ends,  scaring  himself with how completely he wants to possess the man underneath him.\n “O-mi-i-i,”  Atsumu mumbles around his fingers, mindless  — his thick tongue weaves loosely around Kiyoomi’s digits.\n“What is it, Atsumu?” Kiyoomi breathes.\nHe doesn’t answer right away, just moans brokenly with his mouth full as Kiyoomi’s hips slap against his ass. He’s hot and pliant inside, squeezing around Kiyoomi’s cock and clinging to him every time he bottoms out like he doesn’t want him to leave. \nKiyoomi doesn’t want to leave, either. Atsumu lets his fingers fall from his mouth. Kiyoomi rubs them over his lips.  \n“Wanna… come…” Atsumu gasps.\n“Oh?” Kiyoomi pulls away from his mouth and reaches underneath him to feel for his dick. \nHis belly swoops when he realizes Atsumu is completely soft. It’s an entirely new level of orgasm control—not just telling Atsumu he can’t come, but physically making it so he can’t. Atsumu isn’t begging for permission, he’s begging for something his body isn’t able to give him right now. Fuck.\n\n Fuck. \n\n“Oh,  Atsumu,” Kiyoomi whispers.\nHe cups Atsumu’s soft cock in his hand and kisses the nape of his sub’s neck, holding him as Kiyoomi drives into him faster, relishing every quiet groan that falls from Atsumu’s lips. After a few more hard thrusts, Atsumu gasps and turns his face toward Kiyoomi’s, eyes halfway closed and lips parted; Kiyoomi growls and shifts over to kiss him, hungry for it. It’s a sloppy press of tongues and lips more than anything else, and Kiyoomi eats up Atsumu’s little whimpers like he can’t get enough. \nKiyoomi rolls Atsumu in his palm, teasing him with his fingers even though it won’t have any long-term effect. The chains make a faint metallic noise as Atsumu pulls on them, shoulder blades straining against Kiyoomi’s chest. \n“Keep your hips up,” Kiyoomi breathes into his mouth, his own jumping faster and faster as he nears the edge. Atsumu groans and shoves back against him, shaking. “Good boy.”\nAtsumu wails against his lips. Kiyoomi lets go of Atsumu’s cock and braces both elbows on the bed, wanting as much leverage as possible.\n“Omi—Omi,  fuck—” \n“Gonna make me come,” Kiyoomi gasps. \nThe headboard is creaking. \nAtsumu makes another desperate sound and rocks back, squeezing so tightly around him Kiyoomi can barely breathe. \n“ Please… ”\nKiyoomi smiles wickedly and bites at his lower lip as Atsumu pants, gasping. “Yeah, you want it? Feel so—fucking—good—”\nHe abandons speech a moment later, panting against Atsumu’s cheek as he takes his pleasure from Atsumu’s eager body. One, two thrusts later Kiyoomi is tumbling over the edge, burying his face in Atsumu’s neck and clinging to him as his orgasm rolls over him in harsh waves.\nKiyoomi stays like that for longer than strictly necessary, pressed flush to Atsumu’s naked body as he comes down from his high listening to the shaky sounds of Atsumu’s breathing. He can feel Atsumu’s pulse underneath his lips. After indulging in the moment for a few more seconds, Kiyoomi sighs happily and reaches up to unclip Atsumu’s cuffed wrists from the chains binding him to the headboard.\nIt’s time to take care of his sub.\n \nFirst, Atsumu is warm. He’s not sure when it changes, but the heat leaches away quickly and before long Atsumu is so… cold. \nHe can hear the sound of the tap running in the bathroom as he lies on his side, resurfacing slowly. Over his body is a familiar fleece blanket; beneath is a scratchier canvas sheet. Atsumu shifts, hearing the strange crinkle of plastic below him as he slits his eyes open.\nOn the other side of the bed is a wet spot, so much larger than Atsumu imagined. His gut swoops; he can still feel the remnants of it on his knees. \nAtusmu shivers, temperature plummeting for reasons he can’t understand. They didn’t even do any pain play, but suddenly it’s like there’s a crater scooped out of his middle, the space left in its wake filled with cold air. His lower half feels strange as well: he’s soft but feels completely unsatisfied, and the pang in his backside which would usually ring with satisfaction is hollow. \nWhile he felt good during the scene, and was able to push down his insecurities, now, suddenly, he feels…  used  , he realizes. He blinks in shock. So many times the thought of Sakusa  using  him has been an absolute fantasy, a source of guilty, delightful pleasure. \nThere’s no pleasure now.\nHe feels empty and, even though he can hear Sakusa cleaning himself up in the bathroom, he feels alone. \nHe hugs his arms tighter around himself, desperately trying and failing to fight off the black cloud rolling in above him. He’d be lying if he hadn’t saw it on the horizon, but he thought… he thought if they just kept going…\nThe sheets crinkle again—soiled, disposable—and Atsumu feels nauseous.\nIt’s  embarrassing . \nAtsumu is suddenly choked with fear at the idea that Sakusa will soon re-enter the room to clean him up. It’s bad enough that Sakusa saw him like this during the scene, a wretched mess without an ounce of control over his own body. The arousal was probably the only thing holding back Sakusa’s disgust. Now that it’s over, Atsumu doesn’t want to be seen this way: a pathetic, desperate, used-up thing. \nIt’s that thought that, before he even realizes it’s happening, drives Atsumu to his feet. \nHe stumbles towards the door, all of a sudden thrown into fight-or-flight mode. He makes it down the hallway and into the spare bathroom where he left his things after his shower. Atsumu yanks on the comfortable clothes he usually wears after a scene with frantic movements. Unlike he’d hoped, the feelings don’t fade once his skin is covered; the fear of being seen and judged persists. \nAnd now that he’s already selected the option of flight, the idea of being captured and questioned by Sakusa is terrifying. How can he even explain this deviation in behavior? How can he explain that he doesn’t want to to be touched or cleaned up by him, that the idea of sitting on the couch on display for the man that just took him apart at the seams could only mean exposing the sick, selfish core of himself—the part of him that could ruin everything with just a few words—to the one person he doesn’t want seeing it.\nNo, he has to get out of here. \nBy the time that Sakusa realizes Atsumu isn’t in the bedroom, he’s got his coat on, bag slung over his shoulder, and is jamming his feet into his boots.\n“Atsumu?” he hears. \nHis throat tightens to the width of a straw. He hears footsteps in the hallway as he stands up in the genkan. His heart races so fast that Atsumu is afraid he might faint.\n“Atsumu, where are—”\nHe closes his hand over the doorknob. He yanks it open and sees freedom. All he needs to do now is make sure that Sakusa doesn’t follow him. His mind whirs, survival instincts bringing a lie to his lips. \n“‘Samu called, there’s a little emergency. Everyone’s okay, but it’s urgent. Sorry!” \nIt’s a small miracle his voice doesn’t shake. The  sorry  slips out unbidden, just a bit discordant with the rest of the message, but then the door falls shut and Atsumu’s moving down the hallway, refusing to look back.\nHe doesn’t wait for the elevator, instead immediately going to the stairs. There are tears running down his face before his foot even hits the first step. A sob slips out of this throat as he realizes how colossally stupid he’s being, how much he probably just fucked everything up.\nHe reaches up to scrub the heel of his hand over one eye, which is when he realizes that he’s still wearing cuffs. Around his neck still sits the thick, black collar. He gasps and begins to claw at them, desperate to get them off and hidden away in his bag.\n“Fuck,” he curses, shouldering his way into the parking garage.  “Fuck!”  \nThe drive home is a blur. It’s probably—no,  definitely  not safe. Atsumu is still reeling from the scene, not drunk but close to it, vision misty from the tears he has to constantly wipe away in order to see any part of the road. He just wants to be  home, in his own bed, tucked under his covers where no one can see him.\n \nBeing home doesn’t help as much as Atsumu thought it would, past the initial relief of walking over the threshold. Now that he doesn’t have a goal in mind, there’s nothing to protect him from the nasty vortex of his own thoughts assaulting him from all sides as he stumbles out of clothes and into the shower, turning the water up as hot as it will go in a useless attempt to stop the shivering.\nHe needs to clean up. Thank god he left before Sakusa could do it for him—he’s  disgusting. \nAtsumu feels a little better after his shower, but it’s short-lived, especially when he opens the bathroom door and the cooler air from the main studio rushes in to lick at his damp skin. He finishes toweling off in a hurry and pulls on a clean pair of sweatpants and a sweatshirt, digging around in his drawers to find the thickest pair of socks he owns.\nJust showering took a ton of energy out of him. It’s actually shocking the way he nearly trips three times between stepping out of the bathroom and his bed. His limbs just feel so heavy. Atsumu stumbles around to gather a few more things—a glass of ice water, some kleenex—before retreating gratefully to his bed, still sniffling and wiping tears away as he pulls the bedding up over his shoulders.\n Fuck.  He thought… he thought if he was good enough, if he did everything Sakusa wanted and took everything he had to give, that maybe Sakusa would…\nBut why would Sakusa want to be with someone like him after what he’s seen Atsumu do? Disgusting.  Disgusting. Atsumu’s skin crawls thinking about what Sakusa’s seen, how shameless Atsumu’s been in front of him. He curls up tighter and pulls the covers over his head. He’s not sure he wants anyone to look at him ever again.\n \nWhen Atsumu next opens his eyes, it’s dark in his apartment. He gets a few seconds of peace in that fuzzy, liminal space between asleep and awake; then, when he reaches for his phone to check the time, awareness comes crashing down on him, flooding him with horrible memories.\nIt’s four in the morning. They have afternoon practice today, but Atsumu can’t picture a scenario where he’s able to leave his apartment and have anyone  see him, especially Sakusa. He has a few new texts but doesn’t bother reading them; he just closes his eyes and prays for unconsciousness to take him again. \n \nIt’s light outside when Atsumu wakes up next. This time he has to get out of bed to pee, but he crawls right back in bed after refilling his water glass and closing his curtains tightly. He’s starving, but he doesn’t want to make anything, and none of the food in his apartment sounds good right now. He fights back tears at the predicament.\nMaybe he’ll order something from one of his takeout apps. He grabs his phone and finally sees the messages. \nFrom:  Omi-Omi\n&gt;&gt; Hope everything is ok. Let me know if there’s anything I can do to help. \n&gt;&gt; Is Osamu-san okay?\n&gt;&gt; Please let me know if you got home alright. \nThey’re all time stamped a few hours apart. Atsumu really sucks. Here Sakusa is trying to be a good dom and Atsumu can’t even text him back after recklessly driving home mid-freak out. The least he can do is respond.\nHe types out a simple message, numb as his fingers move over the screen. He opens another to Coach Foster and spins a similar lie. By the time he’s done with that, there’s another message from Sakusa.\nFrom: Omi-Omi\n&gt;&gt; Understood. Good to know. Again, let me know if there’s anything you need help with.\nAtsumu’s face starts leaking again. It hurts, wanting to take the words at face value and knowing they come from a place of responsibility and politeness. He forces himself to type two words and hit send.\nFrom:  Miya Atsumu\n&gt;&gt; Thanks, Omi. \nBy the time he’s done, Atsumu feels sick and not even the slightest bit hungry any more. Before he can work through that and force himself to get up, Atsumu falls into a fitful sleep again.\n \nIt’s after noon on Monday before Atsumu is awake enough and builds the motivation to get up and throw together something vaguely edible. He doesn’t even remember what he ate by the time he gets back to bed, absolutely exhausted. He strips down to his underwear and slides between the sheets. \nHe tries to sleep, but the light coming in the side of his blinds cuts through his eyelids and he stays painfully conscious.\nAtsumu is caught in between and the thoughts that have been attacking him over and over return once more, in full force.\nPractice will begin soon. Guilt swirls in Atsumu’s chest at missing it, but he can’t imagine Sakusa will want to see him either, not after he finds out that Atsumu lied. There’s no way he’ll want to stick around and keep doing what they’re doing. Atsumu’s always known deep down that’s kind of a baseline fact about himself. His life is pretty much defined by the times he can allow himself to forget before the reality comes crashing back down: people don’t want to stay with Miya Atsumu.\nHis dad left before he even gave Atsumu a chance. What must he have seen in Atsumu to be with their Ma for years and then up and leave when the twins came along? Did he already sense something horrible and twisted in Atsumu? Did he know?\nHe wouldn’t be the last. Atsumu’s teammates and schoolmates hated him until he became useful to them, after all. Even in middle school Atsumu knew that. It didn’t matter then. He had Osamu. \nBut even Osamu didn’t stay with him. Osamu left, too. \nHe vaguely remembers words from a sports therapist he saw in his final year of high school, when everything was getting too much. Osamu was quitting and the mounting pressure of scouts approaching him, of making decisions about his future, made him feel like he was cracking. He knows it was helpful at the time. That she said a lot of things that helped Atsumu make peace with Osamu’s decision and made him feel prepared for what was coming.\nThat seems really far away right now. \nAtsumu flips the pillow over to the dry side, and digs his fingernails into his arms. \nIs it really a shock that Sakusa wants to leave him, too? No, he made it clear this wasn’t a long term thing. Once again, Atsumu is tolerated as long as he’s useful.\n“Why?” Atsumu mumbles, for once, into the dark. “Why don’t you want me? Why don’t any of you want me?”\nHis brain provides far too many answers. \n \nOsamu goes to Atsumu’s on Tuesday morning. It’s the only day of the week he has someone else open the store, and Atsumu rarely has practice or a game until the afternoon or evening. It’s become their standard weekly meet-up day.\nNot completely out of character, this week he forgot to text Atsumu the previous night to nail down specifics, so he’s not exactly surprised when he doesn’t receive any response after firing off a message over his coffee. The lazy bastard without a day job is probably still asleep. So, as he’s wont to do, Osamu swings by Onigiri Miya to make sure everything is running okay and grabs a half dozen onigiri to-go. \nHe uses the memorized codes to enter Atsumu’s building as well as the electric door lock on his apartment. \nOsamu takes off his shoes and hangs up his coat in the genkan, juggling the plastic Onigira Miya bag. He’s only a little surprised to see the lights are still off in the studio as he comes out of the dark hallway into the main room.\n“Get outta bed, you oaf,” Osamu says as he heads into the kitchen. “I even brought ya food. An athlete takin’ advantage of the hospitality of a poor restaurant owner. Ma would—”\nIt’s in that moment, as Osamu finally finds the lightswitch and illuminates the room, that he realizes something is wrong. \nFirst, the kitchen is a mess. They’ve both known how to clean up after themselves from a young age, but Osamu will admit to pulling the  I cooked you clean  move on more than one occasion. Osamu doesn’t let anything get  dirty,  but he has a decent tolerance for clutter; Atsumu, on the other hand, has always been rather...  fastidious.  \nA significant portion of their fights as teenagers started because Osamu left socks on the floor or magazines on Atsumu’s bed, triggering a huffy tantrum from his twin. So seeing remnants of quick-made meals, dishes, and cooking utensils, not just left in the sink but on the counter as well, is weird. \nHe looks over to the newly moving lump on Atsumu’s bed, a tuft of blonde hair poking out from beneath the covers. Osamu thinks he hears something that sounds like  oh fuck it’s Tuesday coming from that direction. \n“Yep. It’s Tuesday,” Osamu says as Atsumu rises. “Did’ya have a party or somethin’ last night?”\nA horrible thought occurs to Osamu as Atsumu sits up, revealing his bare chest and an absolute monster of a fading hickey on the side of his neck.\n“Aw, hell, please tell me yer alone over there.”\nThe last thing Osamu wants is for another head to pop up out of that bed. He closed the shop last night. He’s too tired for this. \nThe last thing he  expects , though, is for Atsumu to flinch like he’s been hit and then for his face to crumple. His mouth curls, eyes filling up with tears as his brow furrows deeply. \n“I’m always alone, Samu!” he shouts, whipping something fluffy and yellow across the room at him. Osamu catches it before it hits him in the face. “You’d fuckin’ know that, wouldn’t ya?” \n“The fuck is that supposed ta mean?” Osamu spits out before he can even process what the hell is going on, the energy in the room going from zero to sixty. \nHe looks down at his hands to see a stuffed, dog shaped tissue holder. Their ma bought a pair for them when they both got a terrible cold in their first year of high school. Osamu’s had been grey, though he’s not sure where it is now. Trust Atsumu to be sentimental enough to keep his. \nOsamu is half-way through concluding that Atsumu got dumped by someone Osamu doesn’t even really know about, which would be out of character, when Atsumu absently reaches up to rub at his eyes. When he touches the tears leaking out of the corners, he yanks his palm back like it’s been burned and stares down at his own hand, seemingly baffled. \n“What the fuck? Why can’t I stop—”\nAtsumu gets up and nearly pitches himself over his nightstand, sending his lamp clattering sideways. He curses before righting himself. He reaches down to grab a sweater off the ground and almost seems to fall over again. When he looks up, his expression seems more composed but there are even  more  tears streaming down his cheeks. Osamu feels his jaw has dropped a little. \n“What is  wrong  with you?”\nAtsumu levels a venomous glare at him as he stalks towards the bathroom, “M’just not feelin’ well, okay!”\n“Tsumu—”\nOsamu tries to intercept him but Atsumu petulantly dodges around him and slams the bathroom door. He does get a look at Atsumu’s face though, leaking, red-rimmed eyes with dark bags beneath them. \nWhat the fuck. Is he sick?\nWith the door shut in his face, Osamu returns to the kitchen to dig a thermometer out of the cabinet. He’s ready as soon as Atsumu opens the bathroom door. He’s not crying anymore but it looks like he could start again at any moment by the wobble at the corner of his lips. Osamu grabs his twin by the nose and shoves the thermometer under his tongue when Atsumu opens his mouth to protest.\nOnce it’s placed, Atsumu seems to give in a little. They just glare at each other in silence in the bathroom doorway for the moment it takes for the thermometer to take its reading. A few more tears leak out of Atsumu’s eyes and he scrubs at them angrily. Then the thermometer beeps and Osamu pulls it from Atsumu’s mouth and lets his twin pass, hearing him stomp down the short hallway.\nHe vaguely hears the sound of the onigiri bag crinkling as he looks down at the temperature reading, gut sinking.\nIt reads 36.8 C. Not even a hint of a fever. \nHe takes a grim breath as a new theory settles in his head. He has to stay calm, approach this right. \nOsamu heads back into the main room of the studio to find Atsumu has already returned to bed. He’s laying on his side with an onigiri in each hand, staring into space. The tissue-dog is stuffed under his arm. Osamu doesn’t hold back the disgusted expression that rises to his face even as his concern grows. He grabs a cup of water and fills it to bring to Atsumu’s bedside. \nIt’s on the way over that something in the room catches his eye. Normally, what with its blaring coloration, it would have stuck out immediately. As it is, Osamu thinks it’s understandable that he’d been too distracted to notice it earlier. \nBut now Osamu’s steps falter for just a second as he processes the bright yellow and green garment tossed over the side of Atsumu’s laundry hamper. He doesn’t even need to see the pair of characters peeking out of a fold that read  kusa  to know to whom it belongs. \nWell, that answers one question, though Osamu isn’t sure if it’s related to the current predicament. By Osamu’s own estimates, Atsumu has been secretly seeing someone on the team since the beginning of the season, or at least close to it. Sakusa was at the very bottom of Osamu’s list of suspects, but Osamu will be the first one to admit he barely knows the other man at all. Though, this presents an opportunity.\nIt only makes sense that one of Atsumu’s secrets might know about his others. \nA plan, at least for the imminent future, forms in Osamu’s head. He needs more information before confronting Atsumu. \nHe reaches the bed and sets the water down on the bedside table. \n“If yer sick, ya better stay hydrated,” Osamu says, and then grabs the corner of Atsumu’s duvet. He yanks it up and over his head, onigiri and all. He ignores the immediate squawking and flailing. “That’s what ya get for chuckin’ things at people.”\nThen, in the brief moment when Atsumu’s head is covered, Osamu swipes his twin’s phone from the nightstand and slips it into his pocket. \nHe doesn’t wait for Atsumu to even fully untangle himself before turning and heading towards the door. \n“An employee jus’ texted me. I gotta give ‘em a call,'' Osamu lies.\nHe hears Atsumu mumble something but doesn’t look back as he heads out into the hallway. He walks down the way a bit, towards the fire escape and away from most of the apartment doors. He fishes Atsumu’s phone out of his pocket and holds it up to his face.\nOne perk of being an identical twin is that he’s an elite hacker for exactly one phone on earth. It registers his face and unlocks.\nOsamu ignores the messages. He’s not worried enough to invade that much of Atsumu’s privacy—separate from his general fear at what kind of brain bleach-requiring nonsense he’d find there. No, Osamu simply taps over to Atsumu’s contacts, scrolls until he finds the name and number he wants, and then resolutely hits send. \n \nKiyoomi texts Atsumu a couple of times over the twelve hours following his hasty exit after their scene. In spite of the anxious concern that nips at him while he cleans up the bedroom and gets ready for bed, it’s easy to rationalize the lack of replies due to the fact that Atsumu  had  said that it was kind of an emergency.\nHe’d prefer a response, obviously, but he understands the lack of contact if Atsumu is helping Osamu deal with something like the basement of Onigiri Miya flooding. Kiyoomi frowns more deeply as he pulls on his sleep shirt. He certainly  hopes it’s not anything like that. What if there was a fire or something?\nKiyoomi tries to stop himself coming up with solutions or ways to help with situations that may or may not exist. It would be a lot nicer if Atsumu would at least message him back to tell him what happened. \nTo:  Miya Atsumu\n&gt;&gt; Hope everything is ok. Let me know if there’s anything I can do to help. \nTo:  Miya Atsumu\n&gt;&gt; Is Osamu-san okay?\nAfter hours of laying in bed, staring up at the ceiling, Kiyoomi gets a new spike of anxiety running through his chest. They’d just played, and Atsumu certainly wasn’t all the way back to a normal headspace when he left; when Kiyoomi went down to the garage to check, Atsumu’s car had been gone. He gets that when circumstances are tight, he wouldn’t want to leave it behind, but…\nHe turns over and grabs his nightstand off the side table. \nTo:  Miya Atsumu\n&gt;&gt; Please let me know if you got home alright. \nIt’s a little past two in the morning. It’s totally possible that even if the emergency was dealt with, Atsumu passed out at Osamu’s, or home, or wherever the problem was. He sighs heavily and opens YouTube. He taps his thumb in the search bar and slowly, deliberately types  cake decorating.  \nThe next morning, Monday, Kiyoomi gets up and starts getting ready for practice. He’s still twitchy and feels like he has nowhere to put his anxious energy. Should he call Atsumu? He’s literally never called Atsumu before, though. The only phone conversations they’ve had have been when Atsumu rings him up, usually on his way over and wanting some input about grabbing take out or dinner from the konbini. \nBefore Kiyoomi can make a decision, his phone dings. He snatches it up quicker than he’d like to admit, way too much relief flooding him when he sees Atsumu’s name on the screen. \nFrom:  Miya Atsumu\n&gt;&gt; Yeah Osamu is good. Still dealing with a few things so I may not be at practice later today.\nEven without details, just knowing that Atsumu hadn’t crashed into a ditch somewhere last night loosens the knots that had been tightening in Kiyoomi’s stomach. He’s still concerned, but Atsumu and his brother are okay so that’s enough to give him the privacy he clearly wants. \nTo: Miya Atsumu\n&gt;&gt; Understood. Good to know. Again, let me know if there’s anything you need help with.\nThere’s another buzz as Kiyoomi’s tying his shoes. \nFrom:  Miya Atsumu\n&gt;&gt; Thanks, Omi. \nHis fingers squeeze lightly around the device, unsure how to categorize the simultaneous relief and yet continued concern clouding his head. He takes one more steadying breath and vows to lay it to rest for the day, to give Atsumu the space he needs. \nIt’s a good plan in theory, and gets Kiyoomi through Monday, but when their practice-free Tuesday rolls around, he finds himself getting antsy all over again. He works out in the morning, bundling up to go on a run through the slushy park near his apartment in Osaka. It’s still snow season, but they’ve had unseasonably mild weather the past week and it’s opened up the paths enough that Kiyoomi can run until the cold air is burning his lungs. \nHe showers when he gets back to his apartment. He’s in a pair of shorts and still towelling off his hair when he hears his phone ringing in the bedroom. \nKiyoomi makes a bee-line for it, honestly expecting Komori, his mother, or maybe one of the trainers who he’s been trying to set up an extra physio session with this week. He thinks his left knee is tweaked a little. In spite of everything, his eyes still widen when he sees Atsumu’s name on the screen.\nHe smacks the accept button with his thumb and raises it up to his ear lightning quick. \n“Atsumu, is everything okay?”\nThere’s a pause that feels much longer than it is, and then a voice speaks. It’s familiar, but it’s definitely not Atsumu.\n“Naw, not ‘Tsumu actually. Sorry.”\n“Osamu-san?” Kiyoomi asks, immediately identifying the speaker. “Why are you calling? Is Atsumu okay?”\nHe makes sure to keep his voice level in the face of his confusion. \n“I dunno. I mean, he’s not in the hospital or nothin’. That’s kinda why I’m callin’,” Osamu says, sounding weirdly reluctant. His ambiguous answer makes Kiyoomi’s chest tighten. What is going on? “Got a question for ya.”\n“What?”\nThere’s another pause and Kiyoomi strains to hear any sounds through the line. His own heartbeat is loud in his ears as he tries to think. \n“A question… thought you might know the answer,” Kiyoomi hears a sigh, like Osamu is bracing himself. “Is my brother doin’ drugs?”\nWhatever Kiyoomi expected to hear, it certainly wasn’t  that . His brow furrows and his fingers curl into the towel around his neck. His eyes drill into the bedspread.\n“Why would you ask me that?”\n“Well, yer high school hoodie’s in his laundry hamper, which was the last piece of the puzzle f’r who he’s been sneakin’ around with all season,” Osamu says, blindsiding him again. Kiyoomi isn’t sure how to feel about the fact that Osamu knows that he and Atsumu have been meeting up... and, notably, that he didn’t know before. He’s still confused, only getting more so. “Thought if anyone might know what he gets up to in his free time, it might be the person he’s… well, y’know.”\nKiyoomi rubs his fingers over his forehead, pushing aside processing what it means that Osamu knows about him and Atsumu for later. He’s still missing something. Kiyoomi sits down on the side of the bed. \n“I don’t… I won’t deny that Atsumu and I see each other outside of volleyball, but I don’t understand what’s happening currently,” Kiyoomi says, frustrated, and then pauses, deliberating, before he decides to go on. He normally wouldn’t offer information but this is Osamu. Kiyoomi’s sure his intentions, when it comes to Atsumu at least, aren’t bad. “Atsumu was at my apartment on Sunday night. He left suddenly. He said you contacted him and that there was some kind of family emergency. I texted him after, but he implied that it was still ongoing. I don’t—”\n“What the  fuck , Tsumu,” Osamu interjects and Kiyoomi refocuses.\n“Did something happen? Something has to have triggered this call. Did Atsumu lie about you calling him?”\n“Yeah, the bastard lied, though I’ve got as much idea  why as you seem ta,” Osamu murmurs and Kiyoomi hears him take a deep breath. After a pause it seems he makes up his own mind about Kiyoomi’s intentions as well. He continues, “I showed up at his place this morning, and he’s a fuckin’ mess. It was almost noon and he was still sleepin’ in a dark apartment… I basically said hello and he started crying. His place looked like he’d done nothin’ but sleep and eat for at least a day or two. I’ve never seen ‘im like that before. I checked if he had a fever, but he didn’t… so, dunno what else I’m ‘sposed to think besides drugs. Cocaine? Ecstasy? I’m not exactly well-versed but if that’s not strung out I dunno—”\nIt clicks for Kiyoomi so hard that he doesn’t even hear how Osamu finishes his thoughts. He still doesn’t understand everything, doesn’t know why Atsumu left on Sunday night, but he knows exactly what this is. \n“He’s… he’s not on drugs,” Kiyoomi says, unsure if Osamu has actually finished talking, but the words come out on their own. \n“What?” Osamu says. “Like you’ve never seen him do ‘em?”\n“No. I haven’t, but also I meant I think I know what this is and it’s not a hangover or a comedown or withdrawal,” Kiyoomi says, though he supposes it’s close. \nIt wasn’t caused by drugs, though, so he’s got a pretty clean slate as he prepares a series of lies. \nHe wants to assuage Osamu’s fears, but it’s  definitely  not his place to tell Atsumu’s  twin  what he’s been getting up to this season. He’ll have to tell a couple lies to calm Osamu down and then Atsumu can choose to tell the truth or not later.\n“What is it then?” Osamu presses. \n“It’s a kind of virus or something. Not every illness produces a fever and I got something similar the other week—the fatigue can really make you emotional. One of the trainers had it too,” Kiyoomi says, keeping the lie vague. \n“Huh,” Osamu replies. “Really?”\n“Yes,” Kiyoomi says with his most unreadably neutral voice. \nThe silence stretches out again.\n“Well, I feel kinda stupid about all this now,” Osamu admits. “M’sorry for botherin’ you, Sakusa-san.”\n“It’s no problem. You were just worried about Atsumu.”\n“He c’n be a real idiot, but I guess I should’ve given him a little more credit. He cares way too much about volleyball to mess it up for somethin’ as dumb as drugs,” Osamu continues to muse. “Anyway, I’ll let ya go if—”\n“I can pick up some medicine for him and drop it off later,” Kiyoomi cuts in. He needs to get over there. “I can bring food and things too if you need to leave to go to the onigiri shop.”\nKiyoomi prays for Osamu’s busy schedule to work with him here. It’d be really hard to help Atsumu with his brother hovering, making it impossible to explain what’s going on. \n“Are ya sure? I didn’t realize it would be like that with you two,” Osamu says, then hums. Kiyoomi doesn’t interrupt to ask what he means by that. There are more important things to focus on. “I was supposed ta go in... an’ if you’re sure he’s just got a weird bug…” \n“It’s no problem at all,” Kiyoomi assures him.\n“Alright,” Osamu says. “D’ya have his door codes? I’ll send ya his guest code in case he falls asleep again. He didn’t seem like he’d be up long.” \n“Thank you.”\n“Naw, thank you,” Osamu says. “Y’know, yer pretty different than I expected.”\nOnce again, Kiyoomi has no idea what to say to that. He’s already pulling clothes out of his dresser to get ready to go. \n“I’ll let you know if it’s not what I think it is,” Kiyoomi says. “But I’m sure he’ll be fine before you know it.”\nHe will, if Kiyoomi can do anything about it at all. \n \nAtsumu wakes up to the sound of a knock on the door. He’s not sure when he fell asleep but the apartment is dark except for the glow of his bedside lamp. He glances around blearily. He’s got a couple message alerts flashing on his phone but what catches his eye is a piece of paper that looks like it’s from the notebook he uses to write grocery lists sitting on his side table. \nHe reaches out to grab it and immediately recognizes Osamu’s scrawl. \n\n ‘Had to head into work. Called your not-boyfriend or whatever and he said you’re sick and he’d bring by some medicine. I’ll check in after close.’ \n\nAtsumu blinks. There’s another light knock on the door. His brain feels just as sloppy and slow as it has been since he got home on Sunday night and the words aren’t making sense. \nBefore it clicks, there’s the telltale beep of his electric lock opening, which doesn’t make sense because the only ones who have the code are Osamu and his Ma, but she rarely visits and Osamu never knocks. \n“Atsumu?”\n\n Oh.  \n\nWell, not-boyfriend is more right than Osamu knows. \nAtsumu’s first instinct is to pull the blanket over his head and straight up hide. His second instinct, as has been typical of the past few days, is to start full on crying. \nIn the end, he doesn’t do anything at all, just lays on his side in shock with his back to the hallway as he hears footsteps approach. \n“Atsumu…?” Sakusa murmurs again, much closer this time. \nHe feels a gentle hand on his shoulder and he can’t resist the urge to flinch away, curling in on himself. Well, there goes pretending to be asleep. Or dead. Or whatever would save him from having to deal with this right now. \n“Why are ya here?” Atsumu asks, voice quiet in the dim room.\nBy the bright outline of his curtains it’s still midday, but he shut them tight yesterday morning when it felt like all he could do was sleep. \n“Osamu called,” Sakusa says, thankfully refraining from touching Atsumu again. “He saw my hoodie here and thought I might know why you were acting unwell. I think you’re in a bad sub-drop, Atsumu.”\nAgain without fanfare, Atsumu’s eyes start leaking again. He feels a bit of wetness spread between his face and the pillow. He hugs the tissue-dog he apparently fell asleep with more tightly, curling his fingers into the sweater he put on earlier. \n“No shit.”\n“Why didn’t you—”\n“Why are you here?” Atsumu interrupts. \nThere’s a long pause and Atsumu feels a short-lived flash of vindication at catching Sakusa off guard. Then he just feels worse, because it’s not like Sakusa has done anything  wrong . It’s Atsumu who fucked everything up. \n“I’m here to help. Osamu said there wasn’t an emergency… though I know you must have had your reasons for leaving so suddenly,” Sakusa says, clearly trying his best not to sound accusatory, even if it’s not natural for him. Even now he’s trying to be a good dominant. “But having no aftercare after a scene like that probably triggered—”\n“No…” Atsumu cuts him off, feeling like his blanket weighs 100 pounds. It’s going to squeeze the truth out of him. “‘Spose that probably didn’t help. But… this was probably coming no matter what.”\nThick tears slide sideways over Atsumu’s otherwise impassive face. His brain has clearly made peace with what he has to do, but his body is still rebelling. Sub drop is so weird. \n“Atsumu? What are you…”\nAtsumu turns over onto his back and drapes an arm across his eyes. He shouldn’t do this with his back turned, but he can’t make himself look either. If he does, his resolve might crumble. Not that Sakusa will likely want much to do with him after this and what happened on Sunday. At least it’ll be under Atsumu’s own power.\nHe bites his lip, grits his teeth, and then goes limp. \n“I can’t do this anymore.”\n \n I can’t do this anymore. The words echo, clear and unmistakable, over and over in Kiyoomi’s head. His brow furrows and his mouth opens and then closes again. \n“What?”\nMaybe he misunderstood what Atsumu is talking about. The words themselves are simple but what they’re referencing can’t be…\n“I can’t sub for you anymore,” Atsumu says, his arm still across his face.\nKiyoomi swallows, leaning back on his heels a little where he’s kneeling by the bedside. Unrecognizable emotions are beginning to leach into Kiyoomi’s body. He’s not  processing  this correctly. \n“Why?” he says, admittedly sounding like a child. Atsumu has a right to stop for whatever reason, Kiyoomi  knows  that, but he thinks he has a right to know why, at least. “Is it something that I did?”\nHis brain is whirring, trying to think back through all their recent scenes at once. Had he messed up somewhere? Atsumu seemed to be enjoying what they’d been doing. Anything Kiyoomi threw at him just seemed to be another sign of their compatibility. Had he crossed any boundaries? They’d been spending more time together before and after scenes, but Kiyoomi thought that had been welcome. It wasn’t his  usual  relationship with subs, but they weren’t just sub and dom. They were teammates, too. He hadn’t thought it was that weird to—\n“No. Omi, ya didn’t do anything wrong. I can smell yer brain smoking, calm down,” Atsumu says, voice so much more flat than usual. \n“Then… why?”\nAtsumu sighs again, “I just can’t  only sub for ya. It hurts too much, messes with my head when… when I like ya.” \nKiyoomi rocks backwards a little.  Oh.  \nIt’s... difficult to reconcile. For some reason he just didn’t expect this. People develop feelings for each other after participating in intimate activities all the time. It’s not strange, and yet… he never expected Atsumu to go down that path, or be worried about it in the middle of his athletic prime. Plus...\n“I don’t… but you’ve been seeing other people,” Kiyoomi says, probably totally unhelpfully. \nIt’s the biggest thing that’s catching in Kiyoomi’s head, though. Just a few weeks ago Atsumu came into practice with bruises on his neck from someone else. \n“God, Omi-kun, watch a movie once or twice,” Atsumu says. “I was tryin’ ta get ya out of my head. I told ya, it was just the one guy. I realized I had it bad and thought if I could just… remind myself what it was like bein’ with someone else... thought maybe I was just too caught up in subbing, ya’know?”\nKiyoomi doesn’t know what to say. He feels stupid; after all, it’s not like he hadn’t done something similar around the time that he and Atsumu started seeing one another. After a moment of Kiyoomi’s silence, Atsumu continues.\n“Anyway, that was a royal fuck-up and it didn’t work anyway. Just made me want ya more,” Atsumu says, voice completely raw, hand balling up into a fist. With his other hand he gestures vaguely towards himself, in his bedridden state. “And with this? It’s too hard now to separate play and how I feel about ya. It just makes it so clear what I want but can’t have—dates, kissin’ just because, holidays, bringin’ ya back to Hyogo… all that romantic shit. I already missed a practice ‘cause of this… I j-just…”\nHis other arm has come up now too, heels of his palms pressed into his eyes. He looks torn-up and it makes Kiyoomi’s chest hurt. Seeing Atsumu like this and being told there’s nothing he can do is distracting, even as he tries to fully understand his words.\n“You can’t sub for me and not have a romantic relationship,” he makes himself say, knowing there’s no room for misunderstanding right now. “That’s what’s missing for you.”\nAtsumu nods. \nIt wasn’t some type of play, or any of Kiyoomi’s performances as a dom. When he sensed Atsumu was looking for more, he’d been right, but just looked in all the wrong places. He’s been so stupid. \nAnd because of his lack of ability to connect the dots, here they are. The words are finally starting to sink in: Atsumu wants to stop seeing him.\nKiyoomi… doesn’t like that, at  all . He chews on the idea of going back to how they were before, just seeing Atsumu at volleyball—no more calm tea breaks in his dining room, no more quiet hours on his couch, Atsumu wrapped a blanket, the silence only broken to observe a game they both love. No more Atsumu letting Kiyoomi break him down to the rawest version of himself, where all he seems to know is pain, pleasure, and Kiyoomi’s name.\nHis fingers curl into the fabric of his pants. \nHe doesn’t  want  that. He doesn’t want this to end. \nThe solution is simple, then. Kiyoomi speaks again before he bothers to think much more about it. \n“Well, let’s date, then.”\nSilence hangs as Atsumu seems to stop breathing. Then he pulls his arm away from his face, watery golden eyes finally visible. They’re wide, still wet and running, but currently filled with shock. \n“What?”\n“If you don’t want to keep doing what we’ve been doing without dating, we can do that. Date,” Kiyoomi reiterates, unsure which part is confusing to Atsumu; he tries to keep his irritation down. \nAtsumu’s brow furrows now to match Kiyoomi’s. \n“I’m not some vending machine you put dates into until shibari falls out, Omi. I want the whole thing. The chance to wake up next to ya, the possibility of havin’ a future with ya. I want a real relationship. You don’t  do  those. You’ve said, a bunch of times.”\n“I said I wasn’t  looking  for that. I didn’t understand why people in our position were searching for them so badly, but circumstances change all the time, things develop organically, and I know that people have different needs and desires. If this is what you need, I’m okay with that,” Kiyoomi presses, feeling desperate. \nAtsumu sniffs, shaking his head back and forth. It looks like a new wave of tears are spilling over even though the last never really stopped.\n“That’s not—I don’t… if it’s not somethin’ you wanted before, how can I be with ya knowing that?” Atsumu says, running a hand through his hair. “No… this alone sucked enough already, ’s messy enough as it is. Yer right about focusin’ on volleyball for now…”\nHuh, Kiyoomi’s throat is stinging. It feels like things are sliding down a slope and he can’t catch up to stop them. His heart beats faster in his chest. Atsumu looks away from him; Kiyoomi desperately wants to hold his eyes, but he doesn’t have that power. Atsumu continues.\n“I’m flattered that the dick was good enough for you to be willin’ to go on a date with me,” Atsumu says with a humorless, breathless huff of laughter. His eyes slide shut and then open up again. Kiyoomi is so wrapped up in being offended at that concept that he almost misses what Atsumu says next, reaching out to open his side table drawer. “Oh. I should give these back to ya. I was freakin’ out so much I walked out with ‘em. I’m sure they were stupid expensive…”\nWhen he pulls his hand from the drawer, his long fingers are curled around a familiar pair of cuffs and a collar. Sakusa had been so wrapped up in concern while cleaning up he hadn’t even noticed they were missing after their last scene. \nKiyoomi blinks; he doesn’t reach out for them. Atsumu seems sobered by the sight of them as well. Any trace of laughter is gone from his face. His eyelashes are clumped together and Kiyoomi catches the sight of another heavy tear falling to the bedspread. \nOnce again confused, Kiyoomi is irked, both at Atsumu’s failure to understand him and at his own powerlessness. He hasn’t felt so young in a while. Besides…\n“They aren’t even mine,” Kiyoomi murmurs. “If you gave them back they’d be useless to me.”\nAtsumu’s head tilts.\n“What do you mean?”\n“These are  yours , Atsumu. They were never going to be used by another sub,” Kiyoomi says, sour and sad. “The cuffs are fur. I got them when you mentioned cuffs bruising… they couldn’t be sanitized anyway. The collar… I custom ordered it for you specifically. It’s black and gold. I thought you knew. They’re yours.”\nKiyoomi mostly responds out of petulance now, trying to work himself up to accepting the fact that Atsumu is about to ask him to leave. He’s surprised then, when, after everything else he’s said, that’s what makes Atsumu’s face go blank. His wide eyes stare down at the items in his hands. \n“What?”\n \n They’re yours.  Atsumu sets the cuffs down to look at the collar, at its sleek black exterior and rich golden lining. It’s… it shouldn’t be that big of a deal. As far as Atsumu knows, Sakusa is loaded. He could probably purchase a custom collar every day if he wanted. Still… he picked this one out for Atsumu.\nHe picked it out for Atsumu and apparently doesn’t want anyone else to wear it. \n“Is it like… a BDSM subculture thing not ta share collars or somethin’?” Atsumu finds himself asking.\nSakusa scoffs, “No. I mean, they can be a kind of symbol for people, especially in 24 hour play but—that’s not the point. I just ordered  that  one for you specifically and it would be wrong to put it on anyone else.”\n“Oh,” Atsumu says. \nIt’s not about the money or the fact that Sakusa got something for Atsumu specifically. He already kind of knew he did that with the cuffs, though he never thought of them as  his own . No, the collar feels different. It’s knowing that Sakusa sat down, thought about Atsumu, and had something made specifically with him in mind. Especially after Atsumu teased him about his all-black aesthetic. \nThe width, the colors, the fastenings…  This will be good for Atsumu , he must have thought. \nAtsumu’s fingers curl around the leather.  Okay . \nSakusa seems to sense the shift in him, and Atsumu feels eyes searching his tearstained face. \n“Just because I haven’t previously looked for longer-term companionship, or find it necessary to lead a fulfilled life, doesn’t mean I don’t form connections, or...” Sakusa says, speaking slower than usual, for once seeming to think about his words. “...well, like you, Atsumu.”\nThe collar is lowered to the bed as Atsumu finally looks up into Sakusa’s eyes. What he sees there makes his throat feel thick. He’s not tearing up or begging. It’s understated, not quite glaring—he’s still Sakusa—but his gaze is sincere in the low light. \n“You… like me?”\nHis mouth opens and closes and Atsumu almost laughs as he can  see him call back some kind of sarcastic comment. He looks away. That’s how Atsumu knows he’s serious when he goes on. \n“Yes,” Sakusa says, so quiet. His face smooths and he looks back at Atsumu. His hand comes up, and then pauses, perhaps recalling the way Atsumu flinched earlier. He blinks, mouth seeming to freeze around his words before he goes on. “And… I don’t… I don’t want to lose you.”\nAtsumu tips his head forward before he can think better of it, a silent invitation or plea. Long fingers slide though Atsumu’s bangs, gently carding them off his forehead. The touch is familiar and so different at the same time. It sends shudders wracking through Atsumu’s body.\n“So… please, Atsumu. Let me stay,” Sakusa murmurs. “Let me start by taking care of you and then… we can try this your way. Please.”\nHe sounds scared, genuinely fearful that Atsumu will say no, and that alone breaks down the final resistance to which Atsumu’s been clinging. He lets his eyes fall shut, presses into Sakusa’s touch. A wet, shaking exhale is followed by another rush of tears. He’s still fragile, but for the first time in a long time these tears don’t feel pointless. They feel like the hurt beginning to drain away. \nAtsumu inhales, trying and failing to stop his voice from cracking, “Okay. Okay, Omi….  okay.” \n“Okay. Okay, Omi….  okay .”\nWhen Atsumu looks back later, the whole memory will feel half like a dream. Sakusa is kneeling beside him, fingers in his hair, telling Atsumu he wants to stay, letting out a nearly shocked huff of relief at Atsumu’s response. \n“Oh. Okay. Good,” Sakusa says. “Good.”\nThere are things that make Atsumu realize that this is reality, help him pin it to the earth. There is a pile of dirty tissues on his nightstand. His skin feels tacky with nearly two days of sleep-sweat and his face feels downright grimy. Sakusa is sporting a progressively more pinched expression as the silence stretches out and transitions from comforting to awkward. \nNo, this is real.\nSakusa shifts uncomfortably where he’s  kneeling  by Atsumu’s bed. How mortifying. Atsumu pushes himself up on one arm, to at least give himself the dignity of sitting upright.\n“Um… what now?” he asks.\nSakusa’s brow furrows, “I take it… you don’t want to go on a date right now…”\nAtsumu sputters. “No, Omi-kun, I don’t wanna go out in the middle of a fuckin’ drop!”\nHis eyes well up as if to make his point extra clear. \nThat seems to reorient Sakusa at least. He pushes himself up to his feet and brushes the nonexistent dust off his knees.\n“Right. My suggestion would be to focus on that,” he says, holding out a hand to help Atsumu up. “I thought, since missing aftercare probably was a big factor in kicking off the drop, going through a version of our usual routine might help.”\nAtsumu hums, a little wobbly as he gets to his feet, “Uh, okay… if you think it’ll help. I’m not keepin’ ya from anything, right?”\nIt makes one of those familiar lashes of shame lick up his insides. He sure is… imposing. In, like, every way. His face burns.\n“Atsumu. It’s our day off. I was going to read the new book on load management that Coach has been pushing, which I can just as easily do on the bus on Thursday.”\nAtsumu relaxes a little. The clarity is... appreciated. \nSakusa continues, “If you want, you could start with a shower. The hot water and the steam might be refreshing after crying.”\nAtsumu rolls his eyes as he furtively gathers up his dirty tissues to throw them away. He tries not to get distracted by the other clutter.\n“You can say I’m gross, Omi-Omi,” Atsumu says, going for a tease and getting closer. “You being too nice is just weird.”\nSakusa is picking up his duffle from the floor, rifling through the pockets to recover what Atsumu now notices is a box of jasmine tea, the kind he’d developed a habit of drinking at Sakusa’s.\n“That was a genuine suggestion. Your current state doesn’t bother me,” he says and then shoots Atsumu a sly glance. “I’ve seen you much messier than this before.”\nHe’s also  said  much dirtier things than that to Atsumu, but in his current, vulnerable state, it easily sends a flush right up to his hairline.\n“I’m going to shower now,” he says and quickly heads towards the bathroom. \nUnsurprisingly, Sakusa is correct that the shower feels good. Atsumu isn’t sure exactly how long he lets the hot water pour over his head, across his tender, cry-sore eyelids. He loses count of the number of tired but contented sighs that leave his steam-filled lungs. By the time Atsumu steps out onto the bathmat, he even feels vaguely human again—still close to tears, but in less of a desolate and more of a ‘watch your favorite movie and cry a bit’ way. \nSome of that good feeling evaporates when Atsumu heads out into the main living area, dressed in a pair of clean sweats and a new sweater, to find Sakusa wearing a pair of rubber gloves and scrubbing his way through Atsumu’s dirty dishes. His kettle is heating up on the stove and all his pots and pans are aligned neatly in the drying rack. Sakusa looks up and Atsumu flushes with embarrassment. \n“My  god , Omi-kun, ya didn’t have to do that,” Atsumu says. “I was gonna get to it—”\nSakusa tilts his head.\n“I assure you it was no trouble,” he says slowly and clearly. “I was getting ready to make tea and realized it would only take a couple minutes to clear the counter. I hope you don’t mind that I borrowed your gloves.”\nHe holds up his hands, clad in the bright blue rubber gloves that Atsumu bought when he first moved into the apartment and then never really used. His hands weren’t sensitive to heat, so he always did the washing bare-handed. Now, though, with the gloves that extend halfway up Sakusa’s forearms and the stern expression on his face, Atsumu can’t help but be reminded of Kita in his clean-up regalia. It incites a sense of comfort that is just enough to prevent Atsumu careening off into another shame spiral. \n“Well, if yer sure,” Atsumu says, wandering further into the kitchen, his bare feet still half tucked into his sweats. “Just… y’know, I’m not usually a slob like this.”\n“I’m aware, Atsumu,” Sakusa says, rinsing the last of the plates. “And this isn’t even really slobby… I grew up around athletes, you know. In comparison…”\nAtsumu almost laughs at the way he shudders. \n“Alright, well lemme dry then,” Atsumu insists, padding around to Sakusa’s other side.\nThe two of them make short work of the dishes together, side by side as Sakusa passes each one to Atsumu. They don’t talk, but it’s not uncomfortable. Sakusa is never one to speak frivolously, Atsumu has noticed, which contrasts sharply with his own tendency to nervously babble. Right now, though, he’s so exhausted that his brain is actually quiet, meaning his mouth is too.\nFor all that Atsumu bristled uncomfortably at the concept of Sakusa cleaning up after him, it feels really nice to clear the sink and counters with minimal effort on his part. He hadn’t realized how much the clutter had been weighing on him until the heaviness was lifted.\nSakusa bullies Atsumu over to the couch while the water finishes boiling, pulling the familiar fleece blanket out of the bag he’d retrieved from his apartment and tucking it around Atsumu’s sides. It’s so endearing that Atsumu waits to rearrange himself until Sakusa turns toward the television, reaching for the remote and turning it to one of yesterday’s VLeague games.\nIt’s the Hornets versus the Warriors, the latter of whom the Jackals are playing on Thursday. Atsumu would have needed to watch this anyway since he very obviously missed out on it—and everything else going on in the world—yesterday. He snuggles deeper into the couch and sighs, glancing over his shoulder to watch Sakusa prepare the tea.\nThe smell of jasmine calms Atsumu down even more as Sakusa carries two cups over to the couch. \n“Thanks, Omi.”\nAtsumu takes a deep breath as Sakusa settles next to him. They’ve sat side by side after every scene they’ve done, but today he finds himself wishing they were sitting closer. He wonders if it has something to do with the delayed aftercare. Either that, or the fact that his feelings are out in the open now. And Sakusa… probably… returns them?\nThe short distance between them is palpable. \nFuck. This is high school shit. Only a step above pretending to yawn then wrapping your arm around the other person. Atsumu scrubs a hand over his face and takes a sip of his tea, trying to ignore the urge to scoot closer. \nHe’s barely even been awake for an hour, but it’s been such an emotionally exhausting time that Atsumu’s eyelids start to droop after only a few minutes. He doesn’t realize he’s actually nodding off until he feels Sakusa take the teacup out of his hands and place it on the coffee table. \n“Hey, I wasn’t done!”\n“You were about to spill it on your lap,” Sakusa says, sounding amused. “You can take a nap, you know. I won’t be offended.”\nAtsumu huffs and draws his knees up onto the couch, tucking them so his feet are under the blanket. “M’just restin’ my eyes...”\nSakusa snorts. “Well, you can  rest your eyes, then.”\nAtsumu tries his best to pay attention to the match, but the pull of sleep is so strong that he eventually gives in, leaning back against the couch and drifting.\n \nKiyoomi doesn’t realize he’s fallen asleep until he jerks awake to the sound of the electric keypad beeping. He has a few moments to take stock of everything—Atsumu slumped against his side, the muted TV still throwing shadows across the dimly lit room, the cramp in his neck—before the door opens and the lights are flung on. Still reeling from the day’s events, Kiyoomi’s sleep-addled brain is having a bit of trouble processing things. Atsumu lives by himself, so unless his apartment is being broken into, it’s likely—\n“Tsumu!” he hears Osamu call from down the hallway.\nKiyoomi doesn’t answer just yet. If he yelled, that would disturb Atsumu, who hasn’t yet woken and whose unexpected weight against his side is proving to be very comfortable. He cranes his neck awkwardly around to look at the doorway and waits.\nWhen Osamu comes into view, he’s wearing a surgical mask and carrying two bags of food, both of which he nearly drops when he does a double take at the sight of Kiyoomi. It takes everything in Kiyoomi’s power not to laugh.\n“Hello, Osamu-san,” he says quietly.\n“Fuckin’ hell, ya scared me,” Osamu says, matching his volume. “Didn’t realize ya’d still be here. Tsumu asleep?”\nKiyoomi nods, trying not to move too much, and points to his side. Osamu sets the food down on the newly-cleared counter and comes to peer over the back of the couch. Kiyoomi’s eyes slide over to Atsumu as well, taking in the peaceful expression on his face.\n“Huh.”\n“He’s feeling better,” Kiyoomi murmurs.\nOsamu blows out a breath. “Thank god. It really freaked me out seein’ him like that.”\nKiyoomi’s sure it did. Guilt itches underneath his skin, both from the part he unknowingly played in the subdrop and from lying, but Kiyoomi is firm in his belief that Atsumu should be the one to tell the truth—only when he’s ready, if ever.\n“I think knowing he has people looking after him helped a lot, even if he won’t admit it,” Kiyoomi says, meeting Osamu’s eyes again. He’s not very good at saying comforting things, but this feels neutral and vague enough that it doesn’t seem out of place.\nOsamu snorts and perks up. “Oh, he’s never gonna admit it. I hope y’aren’t expectin’ a thank-you card.”\nKiyoomi closes his eyes and bites down the laugh that’s threatening to bubble up from his chest. “Understood.”\n“Alright, I’m gonna put this stuff in the fridge.”\nOnce Osamu starts rummaging around in the bags he brought, Kiyoomi cracks his eyes open and glances down at Atsumu again. A feeling is making itself at home in his chest, at once foreign and familiar. He reaches over with the arm that Atsumu isn’t currently leaning on and tugs the blanket a little more tightly over Atsumu’s curled-up form.\nAs the noise from the kitchen gets a little louder, Atsumu’s face twitches; so does his hand, which is clutching the blanket. His eyelids flutter, but stay closed. His breathing gets a bit faster.\nKiyoomi smirks. \n“Alright, that’s the last of it,” Osamu says, wandering back over. “Hey, sorry for bargin' in on ya. I told’im I was gonna come back later, but he probably forgot. He was sleepin’ like the dead when I left.”\n“It’s no problem,” Kiyoomi says. “He’s awake now, although I don’t think he wants us to know that yet.”\nAtsumu’s brows knit together and he turns his face into Kiyoomi’s shoulder. “No’m not…”\nOsamu barks out a laugh. “Stop lyin’, ya bum.”\n“Go ‘way, Samu,” Atsumu mumbles. He cracks one eye open to glare behind the couch, then sits up a little, blinking slowly. “Why’re ya wearin’ a mask? Ya sick or somethin’?”\n“What? Yer the one that’s sick, I’m just wearin’ one so I don’t take yer germs back to the shop!”\nKiyoomi swallows. Oh. Right. He never got the chance to tell Atsumu that, as far as Osamu knows, he has some kind of virus. \nHe doesn’t make a point of lying very often—he’s usually brutally honest even when the situation calls for some truth-glossing—so he’s not used to the feeling of being caught in a lie. It’s an odd and uncomfortable sensation, the hollow weight that twists in the pit of Kiyoomi’s stomach when both twins look at each other in confusion then turn toward him at the same time. \nHe tries to make meaningful eye contact with Atsumu, but doesn’t hold out much hope that Atsumu will read between the lines.\n“I told him about the virus that’s been going around, Atsumu. The one you have that’s been making you feel so bad the last several days...”\nHe and Atsumu stare at each other for several seconds. Atsumu blinks. \n“Actually, now that Osamu-san is here... I feel better about leaving to get that tapioca tea you wanted,” Kiyoomi says slowly. He wants to give Atsumu an opportunity to talk with Osamu alone about what really happened, but only if he’s ready. “Do you still want one? I can go pick up one for each of us.”\nBlessedly, understanding seems to dawn on Atsumu’s face a few seconds later; he takes a deep breath and stretches his arms over his head, then nods as he sits up fully. “Yeah, if yer offerin’, Omi-kun. Thanks.”\n“I obviously am,” Kiyoomi says, getting up off the couch. “Taro with brown sugar pearls, right?”\nIt’s a horribly sweet drink that he’s unfortunately seen Atsumu order on more than one occasion. Atsumu’s eyes light up and he nods again.\n“How about you, Osamu-san? Can I get you anything?”\nOsamu’s eyes are slitted; he’s looking at Kiyoomi suspiciously. Kiyoomi looks right back at him, keeping a mild expression on his face, until Osamu eventually mutters, “The same.”\nKiyoomi grabs his keys from where he’d left them on the counter. “Okay. I’m going to a place close to my apartment that lets you customize the amount of added sugar. I might stop by my place to grab a few things as well. I’ll probably be gone for about thirty minutes.”\nAtsumu inclines his head in understanding as Osamu looks back and forth between both of them, squinting. As Kiyoomi gathers his coat and pulls on his shoes, he wonders how Atsumu’s going to go about explaining this, and how much detail he’s going to go into. From what he’s seen of the twins interacting, they seem to be much more open than Kiyoomi and his siblings. Kiyoomi is pretty sure Kinsuke and Masumi would rather die than talk about sex with him.\nIn any case, he’ll likely be able to tell how the conversation went by the look on Osamu’s face when he returns. \n \nWhen the door closes in Sakusa’s wake, Osamu raises his eyebrows and saunters over to the couch.\n“So, it was ‘Omi-kun’ all along, huh?”\n“Shaddup,” Atsumu gripes, blushing.\n“He knows your tea order and everything,” Osamu needles, making himself comfortable on the couch. “I gotta say, Tsumu, I had a mental list of all the teammates you mighta been screwin’ around with and Sakusa-san was at the very bottom.”\nAtsumu covers his face with his hands. He’d thought it would be easy to tell Osamu what’s been going on, but if he’s getting this easily embarrassed it’s going to be more difficult than he expected. It’s probably because of the emotional whiplash he’s gone through today. Sakusa came to see him. Sakusa stayed with him.  Sakusa likes him.  \n“And I know he has a thing with germs, so I’m surprised he stayed to nurse ya back to health,” Osamu continues. “I guess if he already had whatever’s goin’ around, it makes more sense, but—”\n“Agh,” Atsumu groans into his hands, cutting him off. He takes a deep breath and looks up. “Samu, m’not sick.”\nOsamu rips off his mask and holds it above his head like a trophy, eyes gleaming,  “Ha! I knew it. You both’ve been actin’ weird since I got here.”\n“Congratulations,” Atsumu deadpans.\nHe yelps when Osamu shoves him. The mask flutters to the ground as both of them shift on the couch, some of the tension dissipating. Not all of it, though; the hard part comes next. \n“So, if yer not sick, then what’s been goin’ on?” Osamu asks before Atsumu can collect himself. “Ya scared the shit outta me this morning so bad I called Sakusa and asked if you were on drugs.”\nThe day’s emotional whiplash continues as guilt, shame, and outrage race through Atsumu’s gut one after the other. “Ya did  what?” \n“Well, what the fuck was I supposed to think, asshole? The place was a wreck and you were all zoned out, stumblin’ around and cryin’ all over the place.” Osamu runs a hand through his hair and Atsumu’s eyes drop to the ground, his face burning. “Actually… wait, Tsumu…”\nAtsumu glances up again and is startled to find Osamu’s dark eyes filled with concern.\n“He isn’t… hurtin’ ya, is he?”\nAtsumu’s eyes bulge. First drugs, now abuse? Osamu is really assuming the worst here.  “No, oh my god. No, he’s not.”\nThen again, Sakusa  does hurt him sometimes… but not in any way Atsumu doesn’t want. He takes a deep breath and sighs heavily; this is probably the best opportunity he’s going to get to bring this up semi-naturally, actually. \n“Although… have ya heard of S&amp;M?”\n“Like, the song?”\n“No, the actual  thing,  ya know…” Atsumu swallows. Four months later and he’s still embarrassed to talk about it. He doesn’t know how Sakusa does it. “  BDSM…  Bondage, m-masochism—all that kinky stuff.”\n“Maso…” Osamu trails off and then his expression turns stormy. “So he  is hurtin’ ya? If he is—Tsumu, I’ll—”\n“ Samu  , he hurts me  in bed  because I  ask  him to,” Atsumu blurts out, not liking where the conversation’s headed. Wait, shit. He knows he tends to overshare, but he never meant to say  that. He blushes to the roots of his hair when Osamu’s eyes widen. “Wait, hear me out. This actually has to do with what happened this mornin’.”\nShocked silent, Osamu freezes for a few long seconds. Eventually, he settles back against the couch and runs a hand through his hair, waving the other in a  go on motion.\n“So—here, I’ll start from the beginnin’. I was over at his place with some other teammates, right, and Shoyo-kun was in the toilet but I had to go too, so I snuck into Omi’s room to use his ensuite.” He pointedly ignores the look on Osamu’s face. “But his bathroom was full of leather stuff that he left out to dry—handcuffs, things like that. I didn’t mean to ask him about it but I couldn’t help myself, and he basically confirmed it was for… uh, bondage. I was curious about it, so he sent me an article on BDSM 101.”\n“Oh my god,” Osamu mutters, putting his head in his hands.\n“Stop it! Look, I know how it sounds. If ya keep interruptin’ me every time I talk about a bad decision I made, we’re never gonna finish this story,” Atsumu snaps. Osamu laughs. “So the link he sent had more links, and  those links had more links, and I ended up goin’ down this rabbit hole, right? I’d never even thought about any of that stuff before, but a lot of what I read about sounded cool, and I wanted to try it.”\n“So you tried it with Sakusa,” Osamu says into his hands.\nAtsumu shrugs. “Basically, yeah. He didn’t think I was takin’ it seriously at first, but once he realized I  was, he invited me over and…”\nHe trails off, remembering the way he felt when Sakusa cuffed him to the headboard for the very first time and made him come three times in a row. The heat in his eyes… the low purr of his voice, a tone Atsumu had never heard from him before…\nOsamu raises his head to glare balefully at him. “Alright, I get it. Ya got stars in yer eyes.”\n“What? It was  really  good!” Atsumu defends himself. Osamu’s lip curls in disgust. “Originally I wasn’t sure if I’d like it that much, ‘cause… uh, d’ya know what doms and subs are?”\n“Kinda, I think,” Osamu says. “Like tops and bottoms, right?”\nAtsumu blushes, thinking of the time Sakusa put clamps on his nipples and rode him until he cried. “Uh… not exactly. That part of it is kinda about… control, I guess. Doms are the ones who have the control, and subs are the ones who… give it up.”\nHe and Osamu look at each other for a second. Atsumu is pretty sure his entire face is red. \n“No way. Yer the biggest control freak I know,” Osamu says. “Don’t tell me—”\n“That’s why I didn’t think I would like it!”\nOsamu narrows his eyes. “Okay, so now that ya put  that mental image in my head, what does that have t’do with this mornin’?”\n“I’m getting there!” Atsumu splutters. Whatever shade his face was before, it’s darker now. “So it was good enough that we met up a second time, then… well, a bunch more times.” No need to go into  too many specifics, he thinks. “Like, once a week since the beginning of the season, no strings attached. So one of the other… uh, parts to all this… ya can dom and sub without any pain involved, right? S&amp;M and control are separate. But Omi and I… we, uh…”\n“Oh my  god.”  Now Osamu’s blushing too. Atsumu wants to die. “So ya really did ask him to hurt ya?”\nAtsumu nods. “I can’t really explain why I like it. I know most people aren’t wired like that. But Omi likes to dish it out, and—”\n“Okay,  okay,” Osamu cuts him off, waving his hands around his head as if he can physically stop Atsumu’s words from reaching his ears. “Again, what does this have t’do with this mornin’? I’m beggin’ ya here, Tsumu—”\n“And I’m sayin’ there’s a point t’all of it,” Atsumu snaps. “Just shut it for a second.”\nOsamu flips him off but stays silent. \n“So there’s this, like, fight-or-flight evolution thing that happens when ya get hurt,” Atsumu says slowly, thinking back on all the readings he did on subspace and aftercare. “Yer brain releases a bunch of endorphins and adrenaline to kinda, like, numb the pain and give ya energy to escape from whatever wild animal’s hurtin’ ya.”\n“Did you just call Sakusa a wild animal?”\n“Samu, I  swear to god.  Anyway, so a bunch of chemicals get dumped into yer system all at once as a response to the pain, and it’s a  rush.  Especially when Om—uh, the dom, um, keeps doin’ whatever’s causin’ it. I’ve never done drugs, despite what  some people  might think, but it’s gotta be similar.” Atsumu swallows. Osamu isn’t running away or calling him disgusting, so that’s a good sign, at least. “So it’s like a high, right? Which means there can be a crash after if y’aren’t careful.”\nFinally, he sees Osamu’s eyes light up in understanding. “That’s what was happenin’ earlier.”\nAtsumu looks down at his lap. “Yeah.”\n“So does it happen every time you two… do it?”\n“Nah,” Atsumu shakes his head. “This was actually th’first time for me. The idea is that afterward yer supposed t’do, like… self-care stuff, basically, with the dom. Yer not supposed to leave right after, and neither is the dom. Ya gotta do stuff that makes ya feel happy and taken care of.”\n“What, like bubble baths?” Osamu teases. He’s obviously joking, but...\n“Yeah, exactly.”\nOsamu gives him a flat look. “Sakusa Kiyoomi. Gave you bubble baths.”\n“Ya don’t have’ta make that face!”\n“Look, ya realize how wild that sounds, right? I still haven’t ruled out that this whole day’s just been one crazy dream,” Osamu says. “Or a prank… holy shit, Tsumu, is this a prank—”\n“I thought I told ya to stop interruptin’ me! It’s not a damn prank!  Anyway, the whole point of the aftercare is to have yer body make some more happy chemicals so the comedown’s, uh, gradual instead of a crash. Omi was always really good about it, even though we weren’t, like, together or anything. I’m the one that fucked it up two nights ago and left right after we hooked up.”\n“Wait, isn’t that what you just said yer  not  supposed t’do?”\nAtsumu wishes he could sink right through the couch cushions. “Yeah, but… I panicked, okay? I panicked ‘cause I caught feelings and started carin’ more about what he thought of me—” he ignores the way Osamu’s eyebrows rise up practically into his hairline— “and then suddenly after that last time, the thought of him seein’ me like that… I felt so  gross. I thought he was never gonna like me back if he saw me like that. So… I ran.”\nHe wipes the back of his arm across his eyes, which have started to tear up again. It’s a good reminder that, although things are better now, the whole incident is still pretty fresh.\n“Tsumu…” There’s pity in Osamu’s voice, which makes Atsumu’s eyes sting as more tears spill over. \nHe scrubs his arm over his eyes once more.\n“But I crashed, obviously,” Atsumu mumbles, trying to keep his voice steady. “And stayed like that ‘til ya found me this mornin’. I’m… m’glad ya called Omi.”\n“Really?”\nAtsumu feels the corner of his mouth quirk up, “Yeah. But probably only ‘cause it turns out he likes me back, maybe? I’d be pissed at ya otherwise.”\nHe glances over just in time to watch Osamu’s face split into a goofy grin. “No shit?”\n“At least, that’s what he said,” Atsumu says, finally letting his smile widen a little as he shrugs, feeling vulnerable. \nThere’s still an underlying thread of insecurity there at what it took to make Sakusa admit any kind of feelings for him, but Atsumu knows Sakusa isn’t the type to do anything out of pity. Plus, he might be a jerk, but he’s not the kind of person that would  lie about something like that just to keep a hookup arrangement going. Atsumu is at least confident in that.\n “Tsumu.  Geez, I never thought he’d be the type’a guy to like anybody,” Osamu says, punching him in the arm. “So—what, are you guys datin’ now?”\n“I… don’t know,” Atsumu says. “We haven’t gotten the chance to have, like, a real talk about it yet. My head’s still in a kinda weird place. Should be all better by tomorrow, I hope at least.”\n“Well, fingers crossed, then. Suna’s gonna throw a fit, ya know. He was sure it was yer captain.”\n “What?”  Atsumu screeches. “I specifically said it  wasn’t him!”\nOsamu laughs. “Yeah, but he said you’ve had a thing for authority figures since Kita-san.”\nAtsumu goes scarlet thinking of the time—and the  place—  Sakusa suggested the exact same thing. Then, to make matters worse, Osamu smirks in a way Atsumu knows from experience means  ‘I’m about to torture my brother.’ \n“Although, I guess he wasn’t  all  wrong, was he?”\nAtsumu makes a strangled noise and moves to slap him. \nOsamu blocks his open palm, expecting it, and they tussle for a few seconds until Atsumu finally lands a weak hit on Osamu’s shoulder. Osamu’s still smirking, though, so Atsumu doesn’t feel particularly victorious.\n“C’mon, I brought all yer favorites,” Osamu says, standing up from the couch and stretching. “I thought you were gonna die of a virus or somethin’ so I went all out.”\nAtsumu follows him over to the kitchen, an odd sensation clawing at his stomach. He feels… grateful, and horribly young. Full yet hollow at the same time. There isn’t any other way to describe it. It’s followed by a feeling he  can name: hunger. He’s barely had anything to eat all day, and his stomach growls at the sight of the fatty tuna Osamu pulls out of the fridge.\n \nWhen Kiyoomi returns, cardboard takeout tray of three drinks in hand, the twins are gathered at Atsumu’s kitchen counter, sampling several of the dishes Osamu brought. \n“I’m back,” he calls, slipping off his shoes.\nOsamu tenses slightly. Though he’s standing with his back turned, Kiyoomi can see the tips of his ears turn bright red, which gives him a solid idea that Atsumu came clean to his brother. Atsumu’s cheeks color a little too as he glances at Osamu then dashes over to retrieve his tea.\n“You know I was about to bring them over,” Kiyoomi drawls, amused. \nAtsumu takes a sip of his drink and makes a happy noise. “Couldn’t wait! Thanks, Omi-Omi!”\nHe seems to be feeling even better, then. Kiyoomi walks over to the kitchen counter with the other two drinks still wedged in the cardboard tray and pulls out the purple one. \n“Here you go, Osamu-san.”\nAfter Osamu almost drops the tea when Kiyoomi hands it to him, Kiyoomi looks up at his face and finds it flushed a deep shade of scarlet. He’s not sure he’s ever seen that color on a human being before. \n“Thanks… I, uhhh—” Osamu scratches his neck— “M’actually gonna take this to go, ‘cause I gotta, uhm… get back to the shop for close.”\n“Yer n’t g’na stay f’r d’ner?” Atsumu mumbles around what sounds like a mouthful of little tapioca balls.\nOsamu scoffs. “I already had it, ya scrub. You guys are the ones that slept through dinnertime.”\nHis eyes flick to meet Kiyoomi’s for less than a second before they dart away again. Osamu’s gaze isn’t hostile or suspicious, Kiyoomi notes, it’s just… flustered. Atsumu must have been… detailed in his honesty. Osamu runs a hand through his hair and bolts around the pair of them to get his shoes.\n“Thank you again for the tea, Sakusa-san!” he calls over his shoulder.\n“It was no trouble,” Kiyoomi says, trying not to laugh. He suspects Atsumu’s twin is in for a night of embarrassed googling.\nOnce Osamu has taken his leave, Kiyoomi turns to Atsumu, who’s somehow already halfway done with his drink.\n“How much did you tell him?”\nAtsumu grins, impish, and sets his tea down. “Probably more than he wanted t’know. It’s not my fault, though! This shit’s hard to explain to someone else without, like… some background, ya know?”\n“Yes, I’m aware,” Kiyoomi deadpans. He smirks when Atsumu flips him off. “How did you guys leave it, then? Everything go okay?”\n“Yeah, I think so,” Atsumu says, pulling out two plates. \nHe hands one to Kiyoomi and they each begin filling their plates from the different trays Osamu brought. It’s a companionable silence until Atsumu speaks again, sounding hesitant.\n“I… I told him I’ll probably have more ta tell him once m’feeling better. Left it kinda open ended, since we, like… well, everything just happened.”\nKiyoomi glances over at him. Atsumu is staring intently down at the takeout container of kushikatsu, twirling one of the skewers between his fingers. Kiyoomi isn’t sure how to decipher exactly what Atsumu means by that. It’s not a false statement by any means, but there’s something fragile in Atsumu’s voice that drives Kiyoomi to eye him curiously, but ultimately decide not to press him.\n“Understandable,” Kiyoomi says. He plucks the skewer from Atsumu’s grip and places it on his plate, then gives him another one for good measure. “We can discuss details later. Probably not tonight, though. We have to get you feeling better first.”\nAtsumu hums as he finishes plating his food. Kiyoomi follows suit. \nAtsumu has a small dining table—for when his mother comes to visit, is what he told Kiyoomi—but generally prefers to eat on the couch. Kiyoomi normally finds this… distasteful, but is willing to make an exception today. Once Atsumu’s settled in, Kiyoomi puts his own plate on the coffee table and doubles back to the fridge to grab two bottles of peach green tea, part of a six-pack that Osamu had brought. \nHe’s personally still working on his own iced oolong tea with passionfruit jelly, but Atsumu is already done with the drink Kiyoomi brought him.\n“Do you have anything you want to watch while we eat?” Kiyoomi asks, taking a seat on the couch.\nAtsumu holds up a finger while he finishes a steamed bun, cheeks bulging. Once he’s done, he picks up the remote and navigates to an animated movie Kiyoomi’s never heard of.\n“This was the movie Samu and I always watched as kids whenever we got sick and stayed home from school,” he explains. \nHe watches Atsumu fiddle with the label on the bottle of iced tea. Atsumu hadn’t been receptive to touch when he first got here, but Kiyoomi had woken up with Atsumu leaning against his side and now finds himself struck by the urge to put his arm around Atsumu’s shoulders. Some amount of contact has been beneficial for Atsumu’s aftercare in the past, yes, but this… feels like more than that. Seeing Atsumu so upset and then nearly having him walk out of Kiyoomi’s life, metaphorically, left him shaken.\nIn the aftermath, Kiyoomi wants him close.\nHe’s never been one to beat around the bush, so once they finish their food, about fifteen minutes into the movie, he says, “If you want to lean against me, you can.”\nAtsumu looks over at him, eyes crinkled at the corners. “Wow, what a warm invitation, Omi-Omi! I’m honored.”\n“Shut up,” Kiyoomi scowls. “If you don’t want to, you d—”\n“Never said I didn’t wanna!” Atsumu adds quickly, tucking his knees up and scooting over.\nKiyoomi lifts his arm up and lets Atsumu press close and lean his head against him. He settles his own arm over Atsumu’s shoulders, but quickly finds that the angle is uncomfortable, maybe because they’re roughly the same height. Instead, he bends his elbow and rests his hand on Atsumu’s head instead. When Atsumu doesn’t protest, Kiyoomi lightly curls his fingers into his hair for purchase.\nThe movie plays on like Kiyoomi’s heart isn’t about to beat out of his chest.\nSeveral minutes later, after Kiyoomi has progressed to gently playing with Atsumu’s hair, he feels Atsumu start to shake. He glances down and is startled to see tears running down Atsumu’s cheeks.\nKiyoomi immediately stills his hand. “Atsumu?”\n“S-sorry,” Atsumu gets out, wiping his cheeks furiously with his sleeve.\n“Do you want me to stop?” Atsumu shakes his head. “Can I do anything?” Another shake of the head. “Okay.”\nKiyoomi removes a travel packet of tissues from his pocket and hands it to Atsumu, who immediately wipes his eyes and blows his nose.\n“Dunno why m’cryin’...”\nKiyoomi hums and starts running his hand through Atsumu’s hair once more. “That’s fine… that’s okay.”\n \nBy the end of the movie, Atsumu’s tears have long since dried and he’s laughing along at the silly parts. Afterward, Kiyoomi has to get up and go to the bathroom thanks to all the tea he drank. It breaks the spell of intimacy that had settled around them; however, when he comes back out, Atsumu is smiling as he scrolls through something on his phone, and the smile stays on his face when he looks up at Kiyoomi.\n“So…” Kiyoomi starts, “it’s getting late. If you want, I brought stuff to stay over on the couch. Do you think that would help?”\nAtsumu bites his lip and looks at him consideringly.\n“I promise I won’t be offended either way,” Kiyoomi adds.\n“Uhm… I think... it might actually be good to have some time to myself now that I’m feelin’ better. You know, compared to the disaster I was the last couple days,” Atsumu says. “But you c’n stay if it’s too late to drive…”\nKiyoomi waves him off. “No, it’s fine. That’s why I wanted to ask.”\nHe wasn’t lying; he really isn’t offended. As long as Atsumu is feeling okay, Kiyoomi would absolutely prefer sleeping in his own bed rather than on someone else’s couch. Vehemently.\nAfter they’ve cleaned up from dinner and Kiyoomi is pulling his shoes on, he looks over at Atsumu consideringly. “Atsumu.”\n“Hm?”\n“We have practice tomorrow and a game on Thursday.”\nAtsumu frowns. “I know, Omi-kun. I should be all better after a good night’a sleep.”\n“No, that’s not—I  mean, we have Friday off. If you want, we could try… going out. To a restaurant,” Kiyoomi says slowly.\n“You mean…”\n“A date,” Kiyoomi finally spits out. “We could go on a date. Unless that’s too soon.”\nAtsumu grins. “Naw, Friday should be good, but I’ll let ya know if m’not feelin’ up to it. Wow, Omi-Omi, askin’ me on a date! Don’t waste any time, do ya?”\nKiyoomi scowls at him and shoves his hands in the pockets of his coat. He hates that Atsumu’s ability to not make everything a mockery is somewhat endearing.\n“Do you have a… preferred place you like to go to?” Kiyoomi elects to ignore him. “Since you have more… experience with this.”\nAtsumu’s smile widens. Kiyoomi’s scowl deepens.\n“Doesn’t matter to me!” Atsumu says cheerfully. “Pick any place ya like.”\nHe seems to be done teasing Kiyoomi… for now. Kiyoomi nods and hefts his bag over his shoulder, then turns toward the door.\n“Oh, and Omi…” \nKiyoomi turns around and his heart leaps up into his throat when he sees how close Atsumu is. They’ve been this close— closer— many times before, but now, after everything, it feels different. \nHis heart crashes back into his chest and beats furiously against his ribs when Atsumu leans forward and kisses his cheek, then steps back before Kiyoomi even has a chance to process it. He scratches the back of his neck, a little sheepish.\n“...thanks. For everythin’.”\nKiyoomi blinks and feels his face heat. “You’re welcome… it was the least I could do.”\nAtsumu shoves his hands in the pockets of his sweatpants and grins. “No it wasn’t. G’night, Omi-kun.”\nWalking down the hallway of Atsumu’s apartment complex after he’s said goodnight, Kiyoomi reaches up to touch his cheek and smiles, a small thing, hidden by a mask, but maybe visible in his eyes. After two inexplicably excruciating days, Kiyoomi can finally breathe again.\n \n\n Pick any place you like.  \n\nOriginally, Kiyoomi didn’t take any issue with Atsumu’s request. It shouldn’t be difficult to select a restaurant. Even though he’s never been on a  date  before, Kiyoomi isn’t helpless and knows how to use google.\nHowever, once he got through reading a blog or two on good first date spots in Osaka, he started to second guess himself. Sure it’s his and Atsumu’s first real ‘date’, but it’s not like it’ll be the first time they’ve eaten together. It’s not the first time they’ve gone to a restaurant or cafe one on one. All the blogs seem to assume this is a stranger you’re trying to impress. Not that Kiyoomi  isn’t  trying to impress Atsumu, in a way. In fact, he’d really like to make sure it goes well, considering what’s at stake. \nYet, what if Kiyoomi picks something too casual or way too fancy? What is the appropriate amount of upscale for ‘ involved sexually for months and now going out to test the waters romantically’ ?\nIt’s… too complicated for Kiyoomi’s experience level. So he does what he’s always done when he’s trying to learn something new and the internet has failed him. He calls upon someone more experienced. \nKiyoomi takes a seat in the chair nearest his window and holds his phone to his ear as he hits ‘call’.\n“Hey, Kiyoomi,” a familiar voice answers after only a few rings. “What’s up?”\n“Motoya,” Kiyoomi greets in turn. He watches a seagull land on someone’s balcony across the street. “Where would you take someone for a first date if you’ve already known them for years?”\n“Hmm, well, if you’re already friends—wait,  what?!  Oh, holy shit—Kiyoomi, are you going on a date?!”\nKiyoomi narrows his eyes, “Why would I be asking if I wasn’t? It’s this Friday, so I can’t pick anywhere with an extended reservation list, either.”\n“No, wait, stop,” Motoya says, and Kiyoomi sighs as he hears the sparking mirth in his cousin’s voice.  “  Who are  you  going on a  date  with?!”\n“Motoya,” Kiyoomi says reprovingly in response to Motoya’s climbing excitement and volume. \n“No, no, no, I promise I’ll help. I promise, but first you at  least  have to tell me who,” Motoya says and Kiyoomi can almost see the way he must be bouncing with excitement.\n“I don’t know why this is so fascinating to you,” Kiyoomi says, suddenly feeling his cheeks heat a little as he realizes what he’s going to have to say  out loud .\n“Oh,  come on , yes you do.”\nKiyoomi presses his lips together and silence stretches out.\n“Kiyoomi—”\n“Miya Atsumu,” Kiyoomi spits it out, cutting Komori off. \nThere are three full seconds that are so quiet Kiyoomi thinks the phone died. He pulls it away from his ear to check and suddenly hears, clearly, because it was shouted,  “Miya Atsumu!?” \nKiyoomi blinks and brings the phone back up to his ear, a few inches away in case Motoya decides to yell again.\n“Yes,” Kiyoomi confirms.\n“No—wait— Miya? Miya Atsumu?!  Your setter, Miya Atsumu?” Motoya says in a rush, sounding like he’s never been happier in his whole life. It’s pretty rude, and that’s coming from Kiyoomi. “I can’t believe this. Holy shit. You finally date someone and it’s  Miya Atsumu!  Kiyoomi!  ” \nIt’s not even a question now, just howling glee. \n“Wait, how did this even happen?!” Motoya pivots, and Kiyoomi sighs.\n“We began a sexual relationship at the beginning of the season. That type of relationship by itself was no longer working, so we’re… testing the waters,” Kiyoomi says. \n“I—that’s not what I meant, oh my  god— ”\n“Motoya.”\n“Alright, alright. I won’t ask any more right now, but I swear I’m getting the entire story when we come out to play the Jackals next week.”\n Unlikely,  Kiyoomi thinks to himself. \n“So?” he prompts.\n“Right, okay. Date spots…” Motoya begins, finally,  finally  getting to the part where he actually helps.\nKiyoomi leans back in his chair and picks up his pen to take a few notes. \n \nIn the end, Kiyoomi ends up calling in to two separate restaurants. After a long twenty minutes of sitting on the phone while Komori googled restaurants and texted friends, his cousin had assured him that Yonemasu would be an absolute showstopper of a pick.\n“It’s a kaiseki place that’s getting crazy buzz right now. Like it might end up with a Michelin star soon, at least that’s what this blog says,” Motoya recited as Kiyoomi jotted down the name. “Ah, shit. It also says it’s super hard to get a reservation, though. Sucks. Miya totally seems like the type to be into that sort of thing.”\nThey ended up finding a highly recommended sushi restaurant thanks to one Suna Rintaro. \n“Don’t worry. The nosy bastard asked why I was asking—I told him you were looking for recommendations, but said I didn’t know who you were taking out,” Motoya preemptively assured. “Since it’s Miya and your first date and all.  God,  Miya! So hilarious—sorry—”\n“Appreciate it,” Kiyoomi said, ignoring the resurging outburst. \nThe thing was, he had the feeling Motoya was right about Atsumu being into a trendy restaurant that’s spiking in popularity. So after calling the first restaurant, Kiyoomi channels all the affluent confidence instilled in him from childhood and calls Yonemasu on a whim and asks to be notified should any seats or tables open up for Friday evening.\nTo his surprise and vindication, Kiyoomi gets a call on Friday morning.\n\n “Sakusa-sama? I saw that you called on Tuesday looking for any availability at Yonemasu this evening…” \n\nKiyoomi texts Atsumu about the change in plans. \nFrom:  Miya Atsumu\n&gt;&gt; I just looked it up and it looks really cool! Do you want to meet downtown or drive together?\nKiyoomi feels a mild wave of satisfaction roll over him at Atsumu’s obvious interest in the new spot. \nTo:  Miya Atsumu\n&gt;&gt; I can pick you up.\nHe assumes that’s not exactly first-date traditional, but it’s right on Kiyoomi’s way and it’s not like they’ve never given each other rides before. Kiyoomi flicks over to a pair of unread messages he received from Komori while he was making breakfast. \nFrom:  Komori Motoya\n&gt;&gt; Baby Kiyoomi’s first date day!!!!\n&gt;&gt; Send me a picture of your outfit!\nTo:  Komori Motoya\n&gt;&gt; I’m less than six months younger than you. \nFrom:  Komori Motoya\n&gt;&gt; You know that’s not the point!\nKiyoomi doesn’t respond as he goes about his day, working out, cleaning his apartment, and eventually getting ready for the evening. At that point he does quietly take a photo of himself in the full length mirror in the bathroom, then sends it without commentary to Motoya. He’s pretty confident in his ability to dress himself, with his upbringing, but he’s sure Motoya will tell him if he got it wrong.\nHe readjusts the white button up, mostly covered by a navy sweater. He paired it with a set of charcoal slacks and a shiny pair of dark brown oxfords. It’s not a three-piece suit or anything, but from what he read, that would be overdoing it a little. His phone buzzes. The first message is just about eight thumbs up emojis. Another one quickly follows.\nFrom:  Komori Motoya\n&gt;&gt; Oh! Wear the watch Okaasama got you for graduation! \nKiyoomi hums and goes over to his closet, pulling out the flat drawer that holds his ties and a trio of watches that he almost never wears. He picks up the Grand Seiko, an opulent gift from his mother for Kiyoomi’s college graduation. It’s a simple, classic silver design with a cobalt face. He buckles the weighty band around his wrist and glances at himself one last time in the mirror. \nWith that, he pulls on a scarf and peacoat and heads out the door.\n \nAtsumu is quieter than usual on the way to the restaurant, Kiyoomi notices.\n“Are you alright?” Kiyoomi asks. “If you were still feeling off, we could have rescheduled or done something lower key.” \nAtsumu seemed much better by practice on Wednesday, chirping Bokuto and Inunaki at every opportunity, and he’d been absolutely on point during the game last night. Though, Kiyoomi supposes the adrenaline of preparing for a game could have just been a temporary stopgap with another comedown afterwards. \nIn the passenger seat, Atsumu sits up straighter and starts waving Kiyoomi off. \n“No, no! I’m not still dropped or anything,” Atsumu assures him. “Just in my own head a bit. It’s an adjustment, you know? I really am excited to try this place out. The reviews are amazing. Have you been there before?”\nThe conversation about the restaurant and Osaka hot spots takes them all the way to the parking garage and up to the doors of Yonemasu. \n“Welcome to Yonemasu. Do you have a reservation?” the hostess greets them.\nKiyoomi gives his name and the hostess offers to take their coats. Atsumu removes his high collared jacket so Sakusa can get the first look at his chosen date attire. He’s wearing a blue button up and a dark pair of windowpane-check pants. It’s accented by a pair of tan leather boots and matching belt. Kiyoomi internally releases a sigh of relief that his own outfit seems to be in a similar ballpark of formality. He doubts Atsumu had to text anyone to get help, though. \n“Omi-kun?” \nKiyoomi’s head snaps up and he realizes he was in his own head a bit, apparently staring at the narrow cut of Atsumu’s pants. The man’s face is dusted with pink and Kiyoomi feels the tip of his ears heat a little bit. \nThe hostess is waiting to take them to their table, which they do manage to reach without further embarrassment. \nQuickly, a waitress brings out a starter course and takes their drink orders. Kiyoomi just asks for lemon water and Atsumu asks for seltzer with lime.\n“I only got water because I’m driving. Feel free to order something alcoholic if you want,” Kiyoomi says. \n“Nah,” Atsumu says, beginning to investigate the small dish in front of him. He takes a small bite and hums with pleasure before taking another bite. He looks up when he’s finished chewing. “I don’t usually drink much this time of year. I like to clear out my system and start eating a lot of clean carbs and protein going into tournament season.”\n“That makes sense,” Kiyoomi says, trying the dish himself—it’s pickled with some kind of sweet accent, enjoyable and refreshing.\n“Once the Emperor’s Cup starts, it can get a little hard to remember to eat well and stuff,” Atsumu continues, making an aside to thank the waitress who has brought out their beverages. “Especially if you’re doin’ any international tournaments or exhibition games. I usually can keep weight on okay during the regular season, but the past three years in a row I’ve dropped at least 5 kilos by the end of tournament season. Anyway, not drinkin’ much is just part of the whole buckling-down regimen. Plus, you’re on flights a lot and alcohol suppresses the immune system, ya know.”\nHe says the last with a wink in Kiyoomi’s direction. \nNormally Kiyoomi might add something to that, but he’s distracted by the reminder that he and Atsumu have taken different paths professionally. Kiyoomi is still technically a rookie, even if his presence in Japan and Hinata’s complete anonymity and certain youthful charm has made that fact little more than a footnote. He takes it as a compliment that he appears professional and stable enough that he’s not been subjected to many of the usual inquiries about ‘settling in’ and ‘getting his feet under him’ faced by most other rookies. \nStill, the collegiate schedule is much lighter than Div1’s and he’s yet to go directly into a long stretch of international travel after a dense season. It’s a bit strange to think that Atsumu already has four years of professional volleyball under his belt. \nKiyoomi fights off the natural instinct to narrow his eyes in mild contempt. Atsumu must misattribute the expression to his last teasing comment, because he chuckles and continues.\n“Anyway, I’m sure you’ve been tabbed for some international play. I can’t believe we haven’t talked about this yet. You already locked in for any camps or national team stuff, yet?”\nThe discussion of the post-season and various prep routines carries them through most of the meal, when the conversation dies down. Silence stretches out for a few minutes as the desert course comes out. Unused to wearing a watch, Kiyoomi fiddles with the heavy metal again. He glances down and is surprised to see that they’ve already been at the restaurant for two hours. \nWhen he glances back up, Atsumu seems to be staring intently at the candle in the center of the table. He finally realizes Kiyoomi is looking at him and almost jumps. He takes a bite of the finely decorated chocolate roll cake on his plate. \nHe’s been getting more and more fidgety since the fifth small plate or so, alternating between talking too fast and complete silence. Now Atsumu’s shoulders are hunched in and he is refusing to hold eye contact. He mostly stares at his cake, hazarding quick glances up at Kiyoomi before taking a bite with his gaze averted. Kiyoomi’s frown gets deeper and deeper. \nHe might not know dates, but he knows pretty well when Atsumu is uncomfortable at this point. \n“Out with it,” Kiyoomi finally says. \n“What?” Atsumu says, sitting up straighter. He still doesn’t meet Kiyoomi’s eyes though. \n“You seemed to be enjoying yourself earlier and now you’re clearly not,” Kiyoomi says bluntly. \n“No, Omi-kun, this place is really amazing,” Atsumu assures him, taking another bite of cake.\nKiyoomi glares and huffs a little. Well, that answer is easy enough to parse.\n“Then it has to do with me,” Kiyoomi says. “I didn’t think a date would be super complicated, but if I’ve messed something up, please tell me.”\nAtsumu sets his fork down and runs a hand through his hair.\n“That’s just it, Omi! I just can’t get it outta my head that this whole date thing is somethin’ that  I  wanted but not something  you  wanted at all,” Atsumu says. “I’ve been thinkin’ about it all week and I just can’t wrap my head around how I’m s’posed to be okay with you dating me basically against yer will.”\n“It’s not against my will,” Kiyoomi snaps.\nAtsumu sighs heavily, “No, I know I didn’t, like… force ya, or blackmail ya. But part of datin’ is knowing that someone wanted to see and spend time with you, ya know? And sure, maybe this is okay because it’s not so different than what we normally do, but what about in a month or two when my Ma comes out to the city and wants to meet the guy I’ve been seein’, when she starts immediately badgerin’ ya about yer family, and yer plans, and all that? It’ll always be in the back of my mind that you  said  ya didn’t want any of that.”\nAtsumu looks frustrated and a little sad, and Kiyoomi feels a bubbling exasperation in his chest. He doesn’t know how to make Atsumu understand, doesn’t know why it’s so hard for people to wrap their head around this.\n“I said I didn’t  need  any of it,” Kiyoomi begins petulantly. \nHe looks around, desperately wracking his brain for a way to explain something so apparently complicated when words have never been his strong suit. \n“What’s the difference?” Atsumu says, sounding aggravated. \nKiyoomi scowls, eyes dropping to his nearly untouched piece of chocolate cake. \n“It’s… like chocolate cake,” Kiyoomi begins. \n“Chocolate cake?”\n“Just… let me try to explain,” Kiyoomi says, speaking slower than normal, trying to sort it all out in his head. “Let’s pretend I don’t eat cake. I find the average cake sponge… well, average, and frosting is way too sugary. Eating cake would require me to change my meal plan and that’s just not really worth it, since I’m not that passionate about cake.”\n“Okay…” Atsumu says, brow furrowed. \n“Independently, let’s say I really,  really  liked chocolate—chocolate bars were one of my favorite foods and not being able to eat them would negatively impact me,” Kiyoomi says. “Now, let’s pretend, suddenly, there was no way to eat pure chocolate bars, or for whatever reason I couldn’t eat them anymore.”\nAtsumu’s eyes are narrowed into slits but for once he keeps his mouth shut so Kiyoomi pushes on, finally catching his groove a little. \n“From that point onward the  only  way I could have chocolate, hypothetically, was in the form of cake,” Kiyoomi says. “So at the minor expense of slightly adjusting my meal plan, I could have chocolate again. What would you do, if it were you?”\nAtsumu still seems confused as hell but he does slowly answer, “I’d eat the cake.”\nKiyoomi nods, fiddling with the watch under the table again. \n“An obvious choice. An easy one. I wouldn’t have changed my meal plan for strawberry or lemon cake, because even if I couldn’t eat those things by themselves anymore, I don’t like them enough to seek out and  adjust  my life to eat cake  just  to have those foods. But for chocolate, my hypothetical favorite food, I would,” Kiyoomi says and then fights down a blush as he realizes the implication of those words. He pushes on. “In this metaphor the cake itself is dating, and the frosting is all the things that go along with it that I’d rather avoid, like having to include someone else in your career decisions or the potential pain of a break-up. I never had an issue with the  dating  part itself—the dinners, or meeting family, or whatever. It just wasn’t something I felt I  needed  to make my life whole, so it seemed stupid to  search it out  when it had the potential for drawbacks that I was trying to avoid.\nBut, like I said, if the only way to have chocolate is in cake form, and the type of cake I’m having is chocolate every time, then why wouldn’t I enjoy it?”\nAtsumu blinks and a light flush has risen to his cheeks.\n“I’m… chocolate?” he murmurs. \nWell, when he says it like  that , it sounds embarrassing. \nThe metaphor isn’t perfect, but Kiyoomi refuses to go into too many more details and risk any further mortifying implications. He looks away, feeling his own face heat.\n“Yes, in this metaphor you’re chocolate,” Kiyoomi confirms. “The hassles and adjustments are minor in comparison, and I don’t find dating objectionable, so that’s why the decision was easy when the other option was only seeing you platonically, or worse, just professionally.”\n“Oh,” Atsumu says, fully blushing now. Kiyoomi scoops up a piece of his cake, just for something to do other than have to make eye contact. He hears a chuckle. “You look like you wanna die.”\n“Liking you is mortifying.”\nAtsumu splutters, “Rude! Ya better be careful or I’ll change my mind about invitin’ ya back to my place after dinner.”\nKiyoomi pauses in his chewing for a moment, considering that. He swallows, and deliberately and quietly takes another bite of his cake. He sits up straighter, the last of the flames on his face dying out.\n“So, what do you think of the cake?”\n \nAtsumu thinks he finally gets it. It’s not certain, but he’s starting to think he at least understands enough to go with the flow when Sakusa follows him up to his apartment, a familiar weekender slung over his shoulder. \n“Kinda presumptuous,” Atsumu teases him as they head towards the elevator.\nSakusa scowls. “I’ve kept an overnight bag in my car since we started meeting up regularly. I didn’t bring it specifically for today.”\n“Ah, always ready for all of this?” Atsumu says, tossing Sakusa a sleazy glance over his shoulder and gesturing to himself as he unlocks the door.\n“Is this how you usually flirt with dates? If so, I can’t imagine you’ve had much more success dating than I have,” Sakusa says, deadpan. \nAtsumu makes a weird sound somewhere between an offended gasp and a laugh. He throws his scarf at Sakusa’s head. He shuts the door and takes two smooth steps towards the other man as Sakusa pulls the scarf away from his face. Atsumu’s hands come up to slide the mask off his face and he successfully gets a finger under the elastic as he leans in for a kiss. \nIt’s then that he’s met with a palm over his entire face.\n“I’m showering before,” Sakusa says, Atsumu’s lips still half puckered. \n“Oh, okay, yeah, sure,” Atsumu says, and notices the way Sakusa is hunched in on himself a little, his ears just a bit pink. “I’ll shower after?”\nApparently, Sakusa still isn’t onboard to hop right into spontaneous hook-ups, which isn’t surprising once Atsumu gives himself a second to think about it. Sakusa’s sharp nod leads Atsumu to believe he’s read the situation right by committing to showering as well. \nLuckily, Sakusa doesn’t take long, so Atsumu only has time to have one minor freak-out and two bouts of overwhelming disbelief. He’s about to hook up with Sakusa Kiyoomi. For all that they’ve done together, what they’re about to do now is completely different. Atsumu’s palms itch when he thinks about the potential freedom to touch. \nAtsumu jumps when the bathroom door opens, startled out of the staredown he was having with the wall. He swallows thickly when he sees Sakusa, stomach suddenly so full of butterflies that he feels nauseous. \nHe’s dressed in a simple white t-shirt and a pair of boxer briefs, wavy curls still damp from the shower. Atsumu has never seen him so dressed down outside of a locker room shower, and the lack of a bunch of other beefy athletes really changes the effect. Sakusa looks… vulnerable. A blush ripples across Atsumu’s cheeks and he finds himself unexpectedly tongue-tied. \n“Shower’s yours,” Sakusa says.\nAtsumu nods, heading quickly down the hall. He has to dodge around Sakusa and almost shudders as the smell of freshly washed skin hits his nose. Atsumu knew he was gone for Sakusa, but the reality of it is so much stronger now that what he’s been longing for is in his grasp. \nAtsumu gives himself several pep talks in the shower, brushes his teeth for good measure, then heads back outside quickly, dressed to match Sakusa, before he can psych himself out. Atsumu loses another degree of sanity when he finds Sakusa sitting cross legged on his bed, illuminated by the bedside table lamp and the light coming in from the street. He seems to be gazing out the window, or maybe into space. He doesn’t look over until Atsumu clicks off the hall light, slowly crossing the main studio towards the bed. \nThis isn’t how it usually goes when Atsumu hooks up with someone for the first time. Usually it’s a lot more chaotic and less personal. He wonders if Sakusa knows he’s inadvertently made this a lot more intimate than an early hook-up would be. Though, who’s to say if that’s because of Sakusa’s habits or simply because seeing him exposed, in Atsumu’s bed, makes his heart threaten to pound right through his chest. \nAtsumu pauses at the edge of the bed.\n“Can I?” he asks.\nSakusa blinks up at him. He looks so  soft.  “It’s your bed.”\n“You’re such an asshole,” Atsumu chuckles, nerves breaking for long enough that he can put a knee down on the bed and reach out to tentatively cup Sakusa’s neck. \nHe pauses for the extra second to allow Sakusa to tilt his head back invitingly, and finally their lips meet. \nAtsumu makes a soft noise at the gentle slide of Sakusa’s lips against his own. He brushes his thumb over Sakusa’s jawline and climbs fully onto the bed to brace himself over him, then shivers when Sakusa reaches up and tangles a hand into his hair, damp and unstyled. \nHe feels Sakusa’s other hand settle in the small of his back. Atsumu opens his mouth a little more and gently sucks on Sakusa’s bottom lip, then hums when Sakusa’s tongue brushes against the seam of his mouth. Atsumu pushes back with his own, deepening the kiss little by little until Sakusa is licking into his mouth, sucking on his tongue, tightening his hands on Atsumu’s body and making the arm Atsumu’s using to hold himself up feel weak.\nIt’s lazy, unhurried—Atsumu wants to take his time, just because he can, but independently of that, he doesn’t want to push it too fast. He’s been in this position multiple times before, sure, but never with the man underneath him. He’s not  used to taking the lead with Sakusa.\nSo he kisses him until his lips are sore, swollen, until Sakusa’s fingers are digging into the small of his back and clenched tightly in his hair, until they’re both hard and pressing against each other through two layers of thin cotton. Atsumu grinds down gently, moaning softly into Sakusa’s mouth as he waits for his hands to creep lower, to slip under the hem of his shirt.\nExcept Sakusa’s hands don’t move. He readjusts his grip every few minutes, but he doesn’t make any move to pull Atsumu’s shirt up, or his boxers down. Atsumu huffs in frustration and grinds down again, trying to respect Sakusa’s boundaries and not take things any further than he’s comfortable with. He breaks the kiss for a brief moment to pepper kisses along Sakusa’s jawline, then a little lower on the sensitive skin of his throat. Sakusa moans and tugs on his hair, wriggling underneath him.\n“Atsumu,” Sakusa gasps.  Fuck, his name sounds good on Sakusa’s lips like that. “Atsumu, don’t tease…”\nAtsumu pulls off from where he’d been sucking a bruise into Sakusa’s pale skin. “M’not teasin’!”\nSakusa frowns. “Yes you are.”\n“If I’m teasin’, then you are too,” Atsumu says, rolling his hips to bring attention to how hard they both are. “Why are both of us still wearin’ clothes?”\n“Because you haven’t taken them off.”\nAtsumu huffs. “What’s that s’posed’ta mean?”\nTo his surprise, Sakusa’s already-flushed cheeks darken. “Look, I… I haven’t really…. I haven’t really had that much vanilla sex, okay? I figured you’d want something different than the usual arrangement… as in, I thought you would take the lead.”\nOh, no… he’s so  cute when he’s flustered. \n“Omi-Omi,” Atsumu coos, pecking a kiss onto his bitten-red lips, “Dont’cha think it would’ve been nice’a you to tell me that beforehand? I’ve been stressin’ out tryin’ not to overstep since we got in bed.” \nSakusa glares at the ceiling. He’s nearly  pouting. Atsumu is delighted.\n“But we’ve done much more than this before. And I, and everyone else you’ve ever been alone with for more than five minutes, know you hook up because you love to talk about it,” Sakusa says eventually. “So why are you stressed out?”\nAh, now it’s Atsumu’s turn to feel flustered. He leans down to bury his head in Sakusa’s shoulder, giving himself a little time to think while he savors the warmth of Sakusa’s body pressed tightly to his own, and shivers when he feels Sakusa’s lips move along the column of his throat. \n“First of all, m’not that easy, Omi. It takes at least ten minutes.” Atsumu starts with a half hearted joke, but then lets the humor fall away completely. He mumbles, “M’just… not used to bein’ anywhere close to  in charge  with you. Anything I do feels like overstepping, or like I’m breakin’ the rules.”\n“Atsumu,” Sakusa snaps. He tugs on Atsumu’s hair until Atsumu stops hiding against the crook of his neck. “You  know  me. Do you trust me to tell you if I don’t like something you’re doing?”\nAtsumu wonders what it says about him that Sakusa’s semi-pissed-off expression is turning him on even more. “...Yes.”\n“Then there’s not a problem,” Sakusa says firmly, then adds, “At least not on my end.”\nHe slides his other hand down to cup Atsumu’s ass, then gives it a little pat. Atsumu makes an indignant noise and lunges for his lips again, emboldened after their short talk. Once he reaches down to grasp the hem of Sakusa’s shirt, though, Atsumu breaks the kiss again.\n“Omi?”\n“Hmm?”\n“I’ll… take the lead, but… can you, uh, encourage me a little?” Atsumu asks, barely getting the words out through his embarrassment. \nGod, he sounds so  tentative. How can four months of kinky sex have changed him this much? He hopes vanilla sex will be like riding a bike, once he actually gets on the damn bike. \nTo make matters worse, Sakusa  grins.  \n“I should’ve known,” he murmurs, squeezing Atsumu’s ass through his boxers and pulling his hips down in a slow grind. “Praise is very motivating for you.”\n“Shut  up, ” Atsumu snaps, but he doesn’t deny it, face burning as he sits up indignantly and pulls his own shirt off in one fluid motion. He straightens his spine for a second, posturing just a little. He tugs at the hem of Sakusa’s shirt next. “Off, off.”\nSakusa’s grin only deepens as he draws the shirt up his torso. Atsumu helps him get it over his head, then flings it to the side as he leans down to kiss him again. The broad expanse of Sakusa’s chest and abdomen is now Atsumu’s to explore and he does so enthusiastically, running his hands all over the sharp planes and savoring the soft sigh Sakusa makes when Atsumu’s thumb brushes over one of his nipples.\nAtsumu pinches gently, a thrill running through him when Sakusa arches up against him and sighs again. “Yeah, just like that…”\nOh, fuck. Atsumu ducks down to mouth over his neck and finds his other nipple too, gently circling them and making Sakusa whine. He slides his tongue over warm, clean skin, licking across a collarbone before nuzzling the hollow of his throat. Sakusa’s hands both drop to his ass, squeezing again before playing with the waistband of his boxers, and Atsumu moans and sits up again to shuck them off.\n“Atsumu,” Sakusa whispers. “Touch me.”\nAtsumu nearly trips over himself trying to get Sakusa’s underwear off, exposing him fully. He swallows harshly, reaching out; Sakusa has such a nice dick and it’s a rush to be able to touch it freely. Atsumu thumbs over the wet head and shifts forward, Sakusa’s thighs spreading effortlessly apart to accommodate his hips.\nAfter only a few slow strokes, Atsumu realizes he needs to get the lube. As he leans over to his bedside table, Sakusa says, “Grab some condoms, too. I want you to fuck me.”\nGoosebumps break out down Atsumu’s back and he nods, an embarrassingly breathy  yeah  escaping him as he retrieves both. How can Sakusa say that so casually? Atsumu said he wanted encouragement, sure, but he was thinking more along the lines of  “yeah, like that,”  or  “more, more,” not multiple full sentences.\nAs he squeezes some lube out onto his fingers, Atsumu realizes that what he really wants is for Sakusa to be a little less coherent. \nSakusa sighs when Atsumu wraps his hand back around him, now warm and slick as he strokes up and down, making dirty wet noises every time he slides his grip over the head. He bites two of his knuckles to muffle a quiet groan when Atsumu circles his thumb around the slit and speeds up, cupping his balls and rolling them in his other hand.\n“Don’t be like that, Omi,” Atsumu murmurs, watching him greedily. “I wanna hear ya.”\nSakusa glares at him but moves his hand away from his mouth, fisting it in one of Atsumu’s pillows instead. Atsumu flashes his signature grin and switches to using both hands to jerk him off, twisting his wrists and biting his lip as Sakusa squirms under his touch. \nHe grins at Sakusa’s first actual moan, a breathy little thing that comes when Atsumu leans in and rubs their cocks together, his wet hands slipping over both of them. Sakusa reaches down and takes hold of Atsumu’s wrist—not to stop him, but to encourage his movements.\n“Yeah, ya like that?” Atsumu asks, thrusting his hips forward. Sakusa just moans again.\nAtsumu bites his lip, gut twisting as Sakusa’s dick slides against his own. That’s more like it.\nOnce the lube has gotten tacky, Atsumu reaches for it again; this time, he generously coats the fingers of his right hand and tosses the bottle onto the sheets, then backs up a bit and spreads Sakusa’s cheeks with his other hand, grinning at the little hole he finds clenched up tight. Is this really going to be his first time fingering Sakusa? Atsumu needs to make up for lost time.\nWhen Sakusa seems to realize what Atsumu’s about to do, he holds up a hand to stop him. “Wait, Atsumu—condom—”\nHe’s definitely less coherent, which was Atsumu’s goal. But what does he…  oh. \nAtsumu remembers when Sakusa came over on New Year’s Day and used a condom to cover his fingers while he opened him up. After that, Atsumu had gone out to the store and bought a small package of gloves, just in case. Now, it seems that Sakusa’s desire for some sort of barrier extends to Atsumu’s fingers as well. \nAtsumu can work with that. He grins.\n“I’ll do ya one better.”\nHe smears the lube on Sakusa’s abs for safekeeping, ignoring the affronted noise he gets in response, and reaches for the bedside table once more to pull out the packet of gloves. Sakusa’s eyes widen and Atsumu’s chest puffs out a little as he extracts a single glove from the pack and dons it. Then he coats it in the lube and gets back into position, rubbing a single slick finger over Sakusa’s hole.\n “Nnnh,  fuck,” Sakusa gasps, spreading his legs wider as Atsumu draws little circles. \nAtsumu bites his lip and presses inside.\nHe opens up like a dream, relaxing quicker than Atsumu expected under his careful touch. There’s a strange, extra thrill running through him as he watches his gloved fingers slide in and out of where Sakusa is so sensitive. He assumes stopping in the middle of sex to pull on a latex glove would be kind of a boner killer to some people, but to Atsumu it’s sending him on some sort of weird power trip. They don’t use gloves all the time for every scene, these days, but they’re still such a  symbol  in Atsumu’s head.\n“Hurry up,” Sakusa snaps breathily, making Atsumu realize that he’d been in a sort of daze. \n“Patience, Omi,” Atsumu says, trying to play it off like deliberate foreplay instead of giving away how bewitched he feels. \nHe pulls his fingers out and peels the glove off, with a conflushing flash of regret he decides to put aside to examine later. \nSakusa throws a condom in his direction in response to Atsumu’s request. He catches it with only a mild fumble, then rips it open and slides it down his length. Atsumu drags in a rough breath and takes in the image of Sakusa below him, feet planted on the bed, held up on his elbows, staring Atsumu down. \n“Atsumu.  Fuck me ,” Sakusa reiterates.\nAtsumu nods, deciding in that moment that he’s  going to deliver. He lines up and shifts his hips gently but unrelentingly forward. Sakusa grits his teeth and drops his head back. Atsumu doesn’t give him a chance to complain again, letting him adjust with a few shallow thrusts before sliding an arm around Sakusa’s lower back and thrusting slowly all the way to the hilt.\nHe watches with heat-fogged eyes as Sakusa collapses backwards, fingers twisting in the sheets as he’s filled, as  Atsumu fills him up. \nAtsumu hooks an arm under Sakusa’s knee to change the angle and sets a relentless pace—a steady one, rolling in and out with a dirty grind at its apex, only made possible by a career that demands peak physical condition.\nSakusa gasps as the first thrust drives home. Atsumu feels dizzy, drunk and over-indulged; he leans down and buries his face in Sakusa’s neck. His forehead against the bed helps him balance enough to use a free hand to explore Sakusa’s skin, which is getting rapidly slicker with sweat. Thorough strokes over ripcord pectorals and abdominals elicit low moans from both of their mouths. \nThe room went from quiet and intimate to a desperate inferno much quicker than Atsumu had planned. He’d wanted to take his time, but the way their bodies fit and move together is making it difficult to resist anything but his most base instincts. \nHe reaches down to give Sakusa’s cock a couple twisting pulls. Atsumu then drops his hand flat against Sakusa’s skin so he can slide his thumb under Sakusa’s sack to press upward. Atsumu grins into his neck as he hears Sakusa gasp and swear, his prostate caught between the intermittent press of Atsumu’s dick and thumb. Atsumu silently sends a prayer of thanks to the pre-med student that taught him that move. \n“Fuck, don’t stop, don’t stop,” Sakusa moans.\nLike Atsumu would ever dream of that.\nHe whines when Sakusa digs his nails into his back, pinpoint sources of pain that make his gut twist. Atsumu pants into the sheets and drives in harder, biting his lip and trying to last through the crushing heat that’s squeezing his cock with every thrust. Sakusa’s gasping into his ear, little choked-off noises that have Atsumu biting his lip, then turning his head to the side to bite Sakusa’s neck.\n “Shit  —  Atsumu —”\nAtsumu has a good angle, so he abandons pressing behind Sakusa’s balls in favor of drawing his hand up and circling shaking fingers around his dick.\n“Omi,” Atsumu breathes, his own voice loud in his ears as all of the sensations in his body start to condense, “please tell me yer close—”\nSakusa nods, something like a sob sticking in his throat. His pulse is racing under Atsumu’s lips. Atsumu mumbles something like  thank fuck and starts to stroke him, trying his best to match up with the rhythm of his hips. Thank god he has a lot of practice holding back his own orgasm, because he wants Sakusa to come first.\n“C’mon,” Atsumu coaxes him, “c’mon, that’s it—wanna feel ya come around me—please, Omi— please —”\nHe gasps as Sakusa tightens sharply around him. Then there’s wetness spilling over Atsumu’s fingers and Sakusa is clinging to him even tighter as a moan tears from his chest, arching into Atsumu’s body as he comes. It’s so hot that Atsumu’s orgasm slams into him without giving him a choice, pleasure sweeping over him as he comes into the condom and groans into Sakusa’s shoulder.\nFor a little while, all Atsumu can do is breathe, blinking in awe as he comes down. Sakusa’s grip on his back loosens, then vanishes completely as his arm flops down to the bed.\n“Holy shit,” Sakusa mumbles.\nHuh. Guess it was like riding a bike.\n \n“Wait, Omi…” Atsumu says into the dark.\n“What is it?”\n“...Was this yer first time havin’ vanilla sex? Oh my god, did I take your vanilla virginity?”\nSakusa jabs an elbow back and Atsumu wheezes when it connects with his stomach. “What? No!”\n “Geez, yer elbows are bony,” Atsumu laughs. “Alright, alright.”\nHe chuckles and cuddles up against him again, burying his face in the nape of his neck. This means he hears Sakusa’s voice rumble in his throat when he says, “If you must know, this was my second time.”\nAtsumu perks up. “Oho? When was the first time, then? Are ya gonna share with the class?”\n“I’m still deciding,” Sakusa deadpans.\n “Omiiii, c’mon!”\nSakusa huffs. “Fine. The first time was when I lost my  actual  virginity.”\nAtsumu waits for him to elaborate, but he doesn’t. “Omi, yer killin’ me. Who was it? Do I know them?” He hears Sakusa sigh, then feels a little bad. “Ah, ya don’t have to tell me if ya don’t wanna. This is kinda weird pillow talk anyway—”\n“Iizuna Tsukasa,” Sakusa says.\nAtsumu pauses while the name runs through his head. “Iizuna… the Hornets’ setter?”\nThe name rings a bell for a different reason, but Atsumu can’t quite remember why. \n“Yes, he’s the setter for the Hornets now, but he was—”\n“Yer captain,” Atsumu makes the connection before Sakusa can say it. “In high school, right?”\n“Yes,” Sakusa says.\nAtsumu blinks. There are a few seconds of silence. Then:\n“Are you  kiddin’  me? You fucked yer high school captain? You gave me shit for  wantin’  to fuck  my  captain when you actually went ahead and  did it?”\nSakusa laughs quietly. “I don’t see how that’s relevant. You definitely weren’t complaining about me ‘giving you shit’ at the time.”\n“Oh my  god.” Atsumu tries to keep acting affronted, but he can’t keep the laughter out of his voice. “You’re such a dick.”\n“So are you,” Sakusa says evenly. “I think it balances out.”\nAtsumu snorts and hides a smile against the nape of Sakusa’s neck. He’s not wrong. He’s definitely not wrong. "
}