{
    "id": "28243833",
    "url": "https://archiveofourown.org/works/28243833?view_full_work=true",
    "author": [
        "outromri"
    ],
    "title": "The Essay Writing Competition",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Aizawa Shouta | Eraserhead/Yamada Hizashi | Present Mic",
        "Aizawa Shouta | Eraserhead & Midoriya Izuku",
        "Midoriya Izuku & Yagi Toshinori | All Might",
        "Class 1-A & Midoriya Izuku"
    ],
    "characters": [
        "Midoriya Izuku",
        "Aizawa Shouta | Eraserhead",
        "Yagi Toshinori | All Might",
        "Nedzu (My Hero Academia)",
        "Iida Tenya",
        "Yaoyorozu Momo",
        "Yamada Hizashi | Present Mic",
        "Ishiyama Ken | Cementoss",
        "Snipe (My Hero Academia)",
        "Kayama Nemuri | Midnight",
        "Ashido Mina",
        "Kaminari Denki",
        "Class 1-A (My Hero Academia)"
    ],
    "additional_tags": [
        "Parental Aizawa Shouta | Eraserhead",
        "Married Aizawa Shouta | Eraserhead/Yamada Hizashi | Present Mic",
        "Protective Aizawa Shouta | Eraserhead",
        "Mentor Aizawa Shouta | Eraserhead",
        "Midoriya Izuku is a Dork",
        "Midoriya Izuku is a Ray of Sunshine",
        "no beta we die like men",
        "Essays",
        "Quirk Analysis (My Hero Academia)",
        "Character Analysis",
        "Dadzawa",
        "Dadzawa & Izuku"
    ],
    "language": "English",
    "series": "",
    "published": "2020-12-22",
    "completed": null,
    "words": "5,077",
    "chapters": "1/1",
    "comments": "376",
    "kudos": "11,210",
    "bookmarks": "2,314",
    "hits": "67,540",
    "summary": "<p> </p>\n<p> <i>“I have a single condition that your participant list must meet.”</i><br> </p>\n<p> </p>\n<p> <i>Shouta simply arches an eyebrow.</i><br> </p>\n<p> </p>\n<p> <i>“Midoriya Izuku will have to participate, regardless of whether he volunteers or not.”</i><br> </p>\n<p>\n<b>It starts with a seemingly innocent essay competition, but Aizawa Shouta can never be too careful when his problem child and Nedzu are involved in the same plan.</b>\n</p>",
    "notes": "<p>So I'm back with another dadzawa and Izuku fic and I know Midoriya doesn't have to call Aizawa dad in every one of them, but it kind of just happened okay. I had so much fun writing this (especially Midoriya's essay, I had to get a little creative there), so I hope you guys enjoy the story as much as I did.</p>\n<p>I have another scenario with the same essay idea, so maybe one day (soon), I'll add another chapter to this story!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>2|2|21 - This story has now crossed 4k reads and that's actually insane because I didn't think this many people would read or enjoy it. Thank you so much for your support and love! I'm super grateful :)</p>\n<p>24|2|21 - This story has officially crossed 5k reads. Barely under a month, it's gartered an extra thousand reads and I'm super grateful. I'm so glad that you guys love this fic because I poured my heart and soul into it!</p>\n<p>8|7|21 - I honestly forgot about this story for a while, but people are still reading this and commenting about how much they love it and it makes me so happy and warm. Thank you so much for your love and support, I cannot believe it has more than 13 K reads! Thank you for reading &lt;3</p>",
    "text": " \nShouta sighs, pinching the bridge of his nose as he stands before his class.\n \nThey look at him, waiting expectantly for him to start talking, but all he can think about is sleep. He glances briefly at his sleeping bag and then he squares his shoulders and turns back to the class.  Let’s get this over with then .\n \n“There’s going to be an essay writing competition.” he announces to his students. For a few seconds there is only silence and then the chaos begins. Shouta sighs (again), sneaking another longing glance at his sleeping bag.\n \n“Sensei, that’s not a very hero activity or competition.” Kaminari frowns.\n \n“We’re not in middle school sensei! Why are we doing this?” Ashido whines immediately after.\n \nShouta gauges the reaction of the rest of the class. Bakugou sits slouched, eyes drawn to the window, he’s hardly bothered. Behind him, Midoriya is muttering under his breath. Todoroki remains impassive as ever while both Yaoyorozu and Iida seem to be silently contemplating something. The rest of the students have already started engaging in conversations amongst themselves.  This is exactly what he had expected.  \n \nShouta closes his eyes for a bare second and then reopens them, glaring at the class, flashing red “Quiet.” The class falls silent immediately and Shouta prides himself on still having a firm hold on his students.\n \n“Nedzu thought it would be a fun competition for you kids, a break from normal hero activities.” Shouta explains, looking pointedly at Kaminari and Ashido.\n \nBefore any of them can interrupt him again, he continues gruffly “It’s not mandatory for everyone to participate.”\n \nA collective sigh of relief is heard and then Iida raises his hand. Shouta stops himself from rolling his eyes “Yes Iida?”\n \n“Is this competition only for the hero course students sensei?”\n \n“No.” Shouta shakes his head “Students from all courses are allowed to participate, but the topic for each course will be different. Hence, each course will have a separate judging criteria and a winner.”\n \n“Thank you sensei.” Iida bows and then takes a seat.\n \n“The topic will be on spot, no preparation time whatsoever. Put your hand up if you want to participate.” Shouta waits with a tired expression, but internally he hopes that the student he needs will put his hand up voluntarily, otherwise this will be embarrassing for the both of them. He watches as Iida’s and Yaoyorozu’s hand goes up, the other students look around to see who’s participating and Shouta waits for a few more minutes. \n \nWhen no new hands raise up, he nods once and then jots their names onto the sheet of paper he’d been given “Iida, Yaoyorozu, I’ve written your names down.” he pauses, lets silence settle in the air for a moment and then he says “Midoriya I’m writing down your name too.”\n \nMidoriya’s eyes widen as big as saucers and then he begins to wave his hands around “ What? Sensei - I didn’t - why - ”\n \nShouta cuts him off immediately, “Nedzu said so.”\n \nIf Shouta thought Midoriya’s eyes couldn’t widen more, he’s proved wrong as the green haired boy stares at him, dumbstruck with his jaw hanging open “Huh?” he says intelligently, blinking at Shouta.\n \nShouta sees Bakugou throw Midoriya an irritated glare, but he doesn’t do or say anything else. The rest of the class glances between him and Midoriya.\n \n“You tell me problem child.” Shouta responds dryly, raising an eyebrow. But Midoriya looks as clueless as Shouta had felt in Nedzu’s office. So this is one of the principal’s  damn  schemes after all.  Why does it always have to be his problem child? \n \nShouta sighs, rubbing his face as he recalls the conversation with Nedzu from earlier\n \n\n “Is this competition really necessary?” Shouta asks plainly. \n\n \n\n “Aizawa-kun, they won’t miss classes and it’s not mandatory participation anyway. Why are you against it?” The principal watches him with an amused expression. \n\n \n\n “It’s a useless competition and takes time out of their weekend.” Aizawa replies, his coffee untouched. \n\n \n\n “You’ve gone soft.” Nedzu’s smile grows wider. \n\n \n\n “I have not.” Aizawa snaps immediately “There’s no logic to hosting this competition.” \n\n \n\n “Yes, there is.” Nedzu hums. \n\n \n\n “Well do enlighten me then.” Shouta folds his arms, staring at the principal. \n\n \n\n Nedzu grins and Shouta immediately stiffens. He knows that look, the mouse was scheming something again. \n\n \n\n “Nedzu,” he says in a warning tone. \n\n \n\n “All in due time Aizawa-kun.” Nedzu waves him off, taking another sip of the tea. \n\n \n\n “Fine, have it your way then. Only two students will participate from my class anyway.” Shouta takes a sip of his coffee. \n\n \n\n “Iida Tenya and Yaoyorozu Momo, correct?” Nedzu asks, a glint in his eyes. \n\n \n\n “Yes.” Shouta grits his teeth as he answers. \n\n \n\n “I have a single condition that your participant list must meet.” \n\n \n\n Shouta simply arches an eyebrow. \n\n \n\n “Midoriya Izuku will have to participate, regardless of whether he volunteers or not.” \n\n \n\n “Problem child?” Shouta frowns “Why?” \n\n \n\n “All in due time Aizawa-kun, all in due time.” Nedzu repeats simply. \n\n \nThe bell rings, shaking Shouta out of his thoughts and he exits the classroom grumbling about how he never managed to sneak in a nap. Hizashi passes by him, and gives him a comforting pat on the shoulder as he walks into the class for English. When Shouta’s around the corner, a good distance away from the class, the corridor quiet with only him, he turns to the nearest security camera glaring as he hisses “If anything happens to problem child because of you, I will murder you.” The red light of the camera blinks twice in acknowledgement and Shouta walks away, his mood not having improved in the slightest.\n \nShouta drops the topic after that and in between grading papers, managing the hell class and hero work, he very nearly forgets about the competition itself. Until the day of the competition.\n \nIt lasts for an hour, with a minimum word count of three hundred and fifty words and then his three students are back in the dorms. He catches only Iida who explains that Yayorozu met up with Jiro directly after the competition while Midoriya had already gone back upstairs to his room. Shouta frowns at the mention of Midoriya, but doesn’t comment. Instead he focuses on the student present in front of him.\n \n“What was the topic?” he asks, mostly out of curiosity.\n \n“We had to write about our favourite hero.” Iida beams.\n \nShouta nods in understanding, his lips twitching in amusement as he buries his face underneath his captured weapon. Iida would have written about Ingenium no doubt.\n \n“I chose Ingenium.” Iida says and then scratches the back of his neck awkwardly \n \n“I’m glad you had fun writing the essay.” Shouta responds, and then he dismisses him after that.\n \nNow it definitely makes sense as to why Nedzu would want Midoriya to participate. No doubt, the kid would have written about All Might and he was armed with a lifetime of knowledge for the topic anyway. Shouta had very briefly glimpsed at Midoriya’s analysis notebooks and he had been impressed,  very impressed . The grin Nedzu had given him after going through a few pages of one of the notebooks, had Shouta’s blood run cold. Whatever Nedzu was planning, these two events were definitely connected.\n \nThe weekend passes by without any major incidents (to Shouta’s relief) and when Monday comes, uneasiness settles heavily in Shouta’s gut. Over the years, Shouta has learnt to trust his instincts, they were usually right. So when he gets to UA and his stomach practically recoils, he sends a silent prayer hoping it has nothing to do with any of his students.\n \nThey have a morning assembly that day and Nedzu announces the winners for the essay competition.\n \n“For the hero course, the winner is Midoriya Izuku.” \n \nShouta rolls his eyes and then watches as the class shoves Midoriya to the podium with loud cheers. He lets them enjoy the victory, and he smirks with satisfaction at Vlad’s miserable expression. The kid is wearing an expression of disbelief and shock, but it morphs into a huge smile once he gets onto the stage and a warm feeling of pride spreads through Shouta’s chest, making Shouta stand just a little bit taller. \n \nNedzu presents Midoriya with a trophy and he watches as the principal says something, making Midoriya’s face heat up immediately. Green hues find Shouta’s own dark ones and he watches as Midoriya’s eyes widen at having been caught and he ducks his head embarrassedly. Shouta frowns slightly and wonders what the exchange was about. Instead of mulling over it, he turns to face his students as their yelling gets out of hand.\n \nDuring homeroom he addresses the class briefly, having nothing much to say and then distributes their assignment papers. When he passes by Midoriya he says a quiet ‘ Congratulations .’ Midoriya stiffens ever so slightly, but doesn’t look up at him as he says “Thank you sensei.” \n \nShouta frowns once more under his capture weapon, alarm bells going off in the back of his head. Something wasn’t adding up. While it was Midoriya’s nature to struggle in accepting compliments, especially from teachers, Shouta sensed equal parts of guilt and embarrassment from Midoriya.  Why? What was the true relationship of Midoriya and All Might, that the kid was behaving this way? \n \nShouta asks Iida and Yaoyorozu to take care of the class as he heads back to the staff room, thinking of his sleeping bag. However when he walks in, Nedzu is seated at the center, humming and all the other teachers surround him, excitedly chatting. They all turn to face him with varying expressions from smugness to amusement and Nemuri grins at him like Christmas had come early. \n \n Oh no, nope, not happening . Shouta doesn’t even hesitate as he does a complete 180 and walks back out of the door. He feels someone grab his arm and drag him back in.\n \n“Hizashi let me go.” he huffs, trying to get out of his husband’s grip.\n \n“Shoutaaa don’t lie, you’re curious.” Hizashi smiles at him, it’s soft, making Shouta falter. He mutters a weak “No, the only thing I am right now is cautious.”\n \nHizashi pushes him into a chair and kneels down “You’re going to love this Sho.” he whispers, expression tender and Shouta wonders what has Hizashi wearing that expression because whatever it is, Shouta’s already a goner and he tries glaring at Nedzu with a  ‘this is all your fault and I don’t even know what it’s about yet’  look\n \nNedzu chuckles in amusement, stepping in front of him as Hizashi steps back. “Aren’t you curious as to how Midoriya won the competition Aizawa-kun?”\n \nShouta stares at him tiredly and opens his mouth to say ‘No, not really. I don’t want to read a fanboy essay on All Might. Can I go to sleep already?’ But the words die in his throat as he considers all of the events that have occurred and his eyes narrow in suspicion at Nedzu “You knew Midoriya would win?”\nNedzu smiles in satisfaction, correcting Shouta “I hoped he would.”\n \n“Why?” Shouta asks, continuing to stare at him.  What game was the rat even playing? \n \n“I wanted to test out a theory.” Nedzu says, his eyes gleaming and Shouta represses a groan. He had a feeling that this theory had a lot to do with him.\n \n“Just get it over with.” Shouta mutters, burying his face into his hands.\n \n“I had a theory that Midoriya Izuku’s favourite hero changed after he enrolled into UA.”\n \n That catches Shouta’s attention as his head snaps up to look at Nedzu who smirks at him. \n \nShouta frowns “That doesn’t -  Why? ”\n \n“Because he’s gotten to know me personally.” Shouta is surprised to hear Yagi be the one to respond.\n \n“What do you mean?” Shouta sighs, he can feel the oncoming of a great headache.\n \n“Things changed when he saw my civilian persona. I became more human, more of a parental figure I suppose.” Yagi shrugs, giving him a sheepish look.\n \n“Well, you’re not the only one who’s a parental figure to him.” Nemuri grins slyly at Shouta.\n \nBefore Shouta can ask about that, Nedzu places a sheet of paper in front of him with Midoriya’s handwriting. “Read it.” Nedzu says gently and they all move back to him some space, but their gazes remain on him regardless.\n \n“Fine.” Shouta grunts, resigned as he picks up the paper.\n \n“  Heroes aren’t people who don’t get scared, they’re the ones who move despite their fear.  ”\n \nShouta pauses after the very first line because he recalls saying something similar, if not the very same thing after his debut fight when the press was swarming around him. It was perhaps the first and last time Shouta ever faced the camera’s as Eraserhead. He continues to read, even as he feels his heart beating slightly faster.\n \n\n That was one of the sayings that the hero Eraserhead left the world with on the night of his debut fight. As an underground hero, Eraserhead works during the night and avoids making any public appearances. Despite gaining credit (from the police) for the villains he captures, the public never realizes what he does for them. This is just one of the reasons why Eraserhead is my favourite hero. Rather than gaining fame for his work, he chooses the most efficient route to save and protect people with his quirk. \n\n \n\n This was some sort of a joke. He was Midoriya’s favourite hero? \n\n \nHe looks up, eyes narrowing at Nedzu “This isn’t funny, give me Midoriya’s real essay.”\n \n“What do I achieve by lying to you about an essay Aizawa-kun?” Nedzu asks innocently, head tilted to one side “Besides, I’m sure you recognize Midoriya’s style of work.”\n \nWhile Shouta did recognize Midoriya’s writing style, the voice in his head wouldn’t allow him to believe it fully. All Might was the kid’s favourite hero, it was a fact etched in stone and facts don’t change. He meets Hizashi’s gaze and Hizashi gives him a firm nod. He breathes in sharply, he needs a drink, maybe more than one. He looks back at the paper, Midoriya’s handwriting swimming in front of him.\n \n His quirk is Erasure, as the name suggests, it erases the quirk of anyone he’s looking at .\n \nShouta’s lip twitches as he tries to disguise a smile. Midoriya had gone off on a tangent for three paragraphs after that, about his quirk - how it worked, it’s advantages and disadvantages, even about his capture weapon and Shouta recognizes the exact point when Midoriya had realized his off topic ramble and had tried to get back on track.  This kid, honestly.  \n \n\n As a late bloomer myself, it was Eraserhead who gave me hope for my future. \n\n \nShouta’s breath hitches as he recalls a conversation he had accidentally eavesdropped on between Midoriya and Todoroki early morning on a weekend.\n \n\n “I’ve always admired All Might, all of us do.” Midoriya says quietly “Even though I looked up to him, I’ve always known I could never be like him. I hoped, but deep down, I’ve always known I couldn’t be like him.” \n\n \n\n “So you looked up to another hero who made you believe in yourself.” Todoroki says, something akin to understanding. \n\n \n\n “Yes.” Midoriya whispers. “While All Might may be primarily associated with hope, and I mean all heroes generally are right? But this hero...he gave me hope in different ways - to persevere, to endure, to live. For the first time I didn’t do it because ‘that’s what’s expected of a hero’ or ‘that’s what All Might would do’. I did it all because he gave me hope that it would be okay one day.” \n\n \nShouta wonders if that had been him too and for the first time in many years, he questions his reasoning.  That couldn’t have been him right?  \n \n But logically,  a voice at the back of his head whispers,  if it wasn’t All Might that he looked up to, then logically the hero from the conversation is the one Midoriya would write about.  \n \nMaybe he was overthinking this. Yeah, he definitely was. He ignores the voice in his head and goes back to the essay.\n \n\n Eraserhead essentially fights quirkless. His quirk is not a flashy combat quirk but rather evens the playing field against his opponent. And for this reason, his fighting skills are perhaps his greatest asset, combined with his ability to analyse the situation and account for the villain’s own skills, Eraserhead is a hero that villains who’ve come in contact with fear as much as All Might himself. \n\n \nShouta is torn between snorting at Midoriya’s exaggeration and trying to hide away in embarrassment for receiving such high praise. He scans the next few lines and he rolls his eyes as another three paragraph rant about his fighting style comes up. It was impressive to say the least, accounting for the fact that Midoriya had witnessed only a handful of fights for observation. He looks up at Nedzu who’s wearing his unsettling grin and Shouta has to resist the urge to immediately ship the problem child off to another continent.\n \n“Shouldn’t you have deducted points for his off topic rambling?” he questions Nedzu.\n \n“Oh we did.” Cementoss replies instead.\n \n“But all the other kids went off topic too.” Snipe continues “Plus, his analysis was quite impressive as compared to what we saw in other papers.”\n \nShouta only huffs as he feels another fuzzy feeling of pride pass through him and he goes back to reading the essay again.\n \n\n Heroes keep their hero persona and civilian persona as separate as possible and as difficult as it is, sometimes the line between their civilian and hero self blur. Aizawa sensei is Eraserhead as much as Eraserhead is Aizawa sensei.  \n\n \nShouta raises an eyebrow at that, but continues reading.\n \n\n I used sensei in specific here because in most dangerous situations concerning villain attacks related to UA, when Eraserhead jumps into the fray, his brain actually operates as Aizawa Shouta. For someone who is considered as a logical and rational hero, when students are involved in the equation, Eraserhead becomes reckless in the way he throws himself against the villain. The odds of making it out alive don’t matter if the students are safe - this is Aizawa sensei’s train of thought while Eraserhead would argue that “Recklessness is not an appealing and definitely not a good quality of a hero.” In fact, more often than not, if a hero is reckless, then it may cause panic among civilians and even other heroes on the scene to watch a hero bring danger to themselves, ‘self destruction’ Eraserhead would say. \n\n \nGoddamnit problem child. Shouta was torn between being pissed off at himself and at Midoriya. Because the entire damn paragraph was accurate to the dot. It annoyed him to no end because Midoriya had perfectly quoted him from lessons, thrown Shouta’s own words back at him and the brat had the cheek to sound smug while writing it.\n \n“Quite the hypocrite aren’t you Aizawa.” Nedzu grins at him cheerfully.\n \n“Shut up.” Shouta mutters, cheeks heating up ever so lightly.\n \n\n Eraserhead knows that heroes aren’t invincible, Aizawa sensei doesn’t care if he isn’t. So somewhere along the line, Eraserhead and Aizawa sensei morphed into a mesh of a singular entity and while he talks to the students as Aizawa sensei, he stands on guard for them as Eraserhead.  \n\n \nShouta reads the paragraph again and then once more. The kid wasn’t wrong but the fact that Midoriya was able to eloquently put his incredible observation in words made his lips tug up in fondness. He really had grown up from the stuttering first year with a severe lack of self-confidence and esteem.\n \n\n Perhaps this would be diverging from the original topic of the paper, but I strongly believe that I cannot appreciate Eraserhead without appreciating Aizawa Shouta as well. While he uses his teaching role as an excuse to stay up late into the night grading papers in the common room, he eases a student’s fears and pain away as a pro-hero who expects the side effects of having mental scars from battles too young for a fifteen-year-old. Both sides are blunt and honest in speech, but one may be a bit more of a parental figure than the other. \n\n \nShouta pauses, finger’s gently tracing the word ‘parental figure’ and he doesn’t realize he’s been mouthing it until Hizashi’s quiet chuckle shakes him out of his reverie. \n \n“It only gets better after that.” Hizashi nudges him to continue reading the essay.\n \nWhile it was in the persona of Eraserhead that he placed a fist over my heart and nicknamed me ‘problem child’, it was in the fondness and trust as my teacher that he told me that he’d watch over me, and believed in me. During training, when we spar and hone our abilities with Aizawa sensei, he instructs us as Eraserhead who’s fought and experienced the outside world. Eraserhead, Aizawa Shouta - two sides of the same coin. I’m grateful to him, more than I will ever be able to admit out loud. He is the hero who constantly inspires me, has made me who I am today and he is the one who saved a quirkless teen from giving up on life. He is the first teacher who treated me as he would treat any other student, the one who encouraged me, guided me, helped me correct my mistakes and most importantly has unwavering faith in me, in all his students and gives plus ultra as both a hero and teacher.\n \nShouta clamps down on his jaw, the clogging sensation in his throat getting stronger as he grips the bunch of papers harder.  How long was this essay going to be? \n \nI see both Eraserhead in skill and observation and Aizawa sensei in loyalty and love. At USJ as the Nomu slammed his face against the floor but he still used erasure to protect us, the day after the mall incident when Shigaraki had cornered me and sensei said “I’m sorry I wasn’t there to protect you.”, at the training camp as he gave us permission to fight and decided to deal with the consequences later on, after the Kamino incident as he looked at us with worry which gave way to anger - ‘they could have died on my watch’, during the Shie Hassaikai Raid as he refused to blink so that I wouldn’t get hurt, as he threw me over his shoulder so we wouldn’t get separated, as he apologized for not being there when it counted even though he’d done everything he could. I look at him and see not just a protective teacher, an alert hero but also a worried father and even though I will never tell him, I am grateful that I will always have a fatherly figure who has my back.\n \nShouta hears the voice in his head whisper about how Midoriya’s file lists a name but no contact information for his biological father, of how Yagi is his emergency contact after Midoriya Inko and of how he’s so much as never even heard of Midoriya Hisashi.\n \n\n I hope that I can make him proud one day, so that I can give back everything he’s given me and tell the world that I am here because of pro hero Eraserhead, of teacher and father Aizawa Shouta. \n\n \nHe blinks up, dazed as he feels someone’s fingers against his cheeks and realizes that Hizashi is kneeling in front of, the tender expression on his face is back and Shouta realizes he’s been crying. He’s crying . His fingers are shaking and he leans into Hizashi, burying his head into his husband’s shoulder.\n \n“He thinks of me as a dad Hizashi,  his dad .” he croaks out as Hizashi rubs his back soothingly.\n \n“And what do you think?” Hizashi asks him gently.\n \nWhat does he think? He wants to find Midoriya and hug him, wants to tear down all the kids who had so much as even glared at him because his kid was the strongest, bravest, most empathetic and kindest child he’d ever seen, no bad intentions, only a drive and determination to save people, to help people, to - wait, had he said his kid?\n \n“Fuck.” Shouta mutters and Hizashi snorts “I thought so.”\n \n“He is my problem child.” Shouta weakly tries to defend himself, mumbling against the other man’s shoulder.\n \n“Whatever you say Shoutaaa.” Hizashi sings trying not to laugh.\n \nShouta leans back and hands the papers to Nedzu “I still hate you.” he grumbles.\n \n“Your welcome Aizawa-kun.” Nedzu laughs.\n \nShouta wipes his face, takes the glass of water that Yagi holds out to him and looks at all the teachers, they’re all wearing soft smiles now and he sighs “I need to talk to him, don’t I?”\n \n“No one is making you do anything.” Nedzu shrugs casually, but the glint in his eyes says otherwise.\n \n“Right, I’ll be borrowing Midoriya for a few minutes then.” and turns to look at Yagi pointedly “You can take the class to ground Beta and by the time they finish changing, I’ll be down.”\n \nYagi shoots him a thumbs up “Take all the time you need, I’ve got this.” and when Yagi glances once at Nedzu and mouths ‘planned ahead ’, Shouta resists the urge to throttle the mouse as Nedzu grins at him smugly.\n \nAs Shouta walks towards his class with Yagi, he asks “Did Midoriya ever tell you?”\n \n“About the dad thing?” Yagi looks up, blue orbs flickering with amusement.\n \n“Yes.” Shouta replies bluntly.\n \nYagi lifts a shoulder and drops it casually “He mentioned it, told me - begged me not to tell you.” and then he watches Yagi’s eyes become distant as if watching the scene play from memory, smile softening. “He didn’t want to disappoint you and he never believed you’d ever play favourites anyway. I’d say he was also scared of losing whatever he had with you, of losing you in general perhaps.”\n \nSilence engulfs them and it’s a while before Shouta speaks “I don’t play favourites, but sometimes people can surprise themselves I guess.  Who knew? ”\n \nYagi chuckles and then they walk into the class. Yagi instructs them to come down to ground Beta and as Midoriya gets up, Shouta calls out to him “Except you Midoriya.”\n \nMidoriya freezes like a deer caught between headlights and Shouta simply raises an eyebrow in amusement. It’s been a while since he’d seen that expression from Midoriya and he wonders what he should be worried about. A few of his classmates snicker, calling out “Oh Mido, what did you do this time?” and a few of them pat him on the back or shoulder, wishing him good luck. \n \nWhen the class is empty and the door closes behind them, Shouta walks towards a nervous Midoriya and pulls out Bakugo’s chair, placing it next to Midoriya’s.\n \n“What’s this about sensei?” Midoriya asks, wringing his hands together.\n \nIn typical Shouta fashion, he cuts to the chase. “You did real good, kid.” he smiles at Midoriya softly.\n \nMidoriya stares at him, confusion evident on his face and then things seem to click in place as his eyes widen and he opens his mouth to explain, to say something but nothing comes out.\n \n“I’m already proud of you.” Shouta says, seizing the moment. “But I do look forward to the hero you’ll become. You have a long way to go, but I know you’ll get there.”\n \nHe watches as Midoriya’s lips tremble and his eyes glass over “Sensei, you can’t just -  that’s not fair .”\n \n“Your essay wasn’t fair.” Shouta retorts and then he waits patiently for Midoriya to collect his thoughts.\n \n“So you’re not mad?” Midoriya asks in a small voice.\n \n“I’m so mad that I told you I’m proud of you.” Shouta replies wryly.\n \nMidoriya’s lips twitch at that, but he doesn’t smile “But you read the entire thing?” he winces and then repeats “The entire thing? ”\n \n“The entire thing.” Shouta confirms and watches as horror etches on Midoriya’s face and his eyes dart between the door and window.\n \n“I’ll use my capture weapon either way.” Shouta points out and Midoriya looks away sheepishly, cheeks colouring red.\n \nShouta places a hand on Midoriya’s head, ruffling his hair “Thank you problem child.” he says quietly.\n \nMidoriya chokes a little and then looks up at him “I should be the one thanking you.”\n \nShouta shakes his head “You do, you show it to me in everything you do.”\n \n“You -  you noticed? ” Midoriya splutters.\n \n“Always.” Shouta whispers as Midoriya barrels into him, making him chuckle.\n \n“I can’t believe you had the audacity to smugly call me out in the middle of it though.” Aizawa says wrapping his arm around the green haired boy.\n \n“It’s the truth though, and you know it sensei.” Midoriya responds and Shouta can hear his grin as Shouta huffs in annoyance.\n \n“What?” Midoriya blinks up at him innocently “Going to expel me?”\n \n“I still can, you cheeky brat.” Shouta bites back.\n \n“But you won’t.” Midoriya laughs and it echoes beautifully in the empty classroom.\n \n“We’ll see.” Shouta hums, but they both know it’s a lie.\n \n“So how much do you think I can get away with right now, on a scale of one to ten?” Midoriya asks nonchalantly.\n \nShouta groans “What have you done now problem child?”\n \n“I haven’t done anything!” Midoriya pouts and then he tilts his head to one side innocently and adds “Yet.” \n \nShouta groans again. He looks tiredly at Midoriya “One being what and ten being what?”\n \nMidoriya looks away, eyes intently tracing the walls like they’ve become the most interesting thing in the world. “One being I got Kacchan angry again and tenbeingIaccidentallycallyoudad.”\n \nAizawa feels laughter bubbling within him as the last part of the sentence sinks in and he hardly contains it as he speaks “You can get away with the ten anytime actually.”\n \nMidoriya’s head whips around to face him, eyes wide in disbelief. Shouta nods once, eyes softening and watches as the watery smile on Midoriya’s face blossoms into a grin- like Shouta had given him the entire world and Shouta’s breath hitches at the purity of it and he thinks 'fuck, he's a goner' because he would give anything to his kid if it made Midoriya smile like that.\n \n“Thanks, dad.” Midoriya hugs him tightly.\n \n“Anytime Izuku.” Shouta murmurs.\n \nAnd if during training Shouta couldn’t stop smiling, his chest filled with warmth, then that was no one’s business but his."
}