{
    "id": "28310466",
    "url": "https://archiveofourown.org/works/28310466?view_full_work=true",
    "author": [
        "birdsofpassage"
    ],
    "title": "and they were roommates (oh my god, they were roommates)",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "原神 | Genshin Impact (Video Game)"
    ],
    "relationships": [
        "Tartaglia | Childe/Zhongli (Genshin Impact)",
        "Keqing/Mona (Genshin Impact)",
        "Beidou/Ningguang (Genshin Impact)"
    ],
    "characters": [
        "Zhongli (Genshin Impact)",
        "Tartaglia | Childe (Genshin Impact)",
        "Guizhong (Genshin Impact)",
        "Havria (Genshin Impact)",
        "a lot of other cameos that im too lazy to tag lol"
    ],
    "additional_tags": [
        "Alternate Universe - Roommates/Housemates",
        "Alternate Universe - Modern Setting",
        "Fluff and Humor",
        "Oral Sex",
        "Emotional Constipation",
        "Pining",
        "lots of texting",
        "and swearing",
        "Drunk Sex",
        "sometimes a family is 2 barely functional students a cat and a roomba"
    ],
    "language": "English",
    "series": "",
    "published": "2020-12-25",
    "completed": "2021-01-05",
    "words": "23,378",
    "chapters": "5/5",
    "comments": "650",
    "kudos": "10,956",
    "bookmarks": "2,085",
    "hits": "137,369",
    "summary": "<p>Looking for a roommate for an apartment in Liyue Harbour who is neat, friendly, able to cook and clean. Must be handsome, must not be allergic to cats, and must have enough common sense for two people.</p>\n<p>Contact Guizhong at <i>XXX-XXX-XXX</i> if interested.</p>",
    "notes": "<p><b>27/11/2022 preface:</b> hello!! as of november 2022, this fic is almost two years old, and with that i want to thank everyone for the continued support and comments! i’ve reread this fic myself countless times mostly for the sake of editing, i’ve laughed and cringed at my own stupid jokes, and most of all i’m happy that this fic has a special place in many hearts.</p>\n<p>one character that i <i>really</i> wish i could introduce retroactively into the fic is azhdaha, but unfortunately this story was written in patch 1.2, and our favourite old frog came… later than that. :’)</p>\n<p>nevertheless, whether you’re a new reader or rereading (like many comments have told me) i hope you enjoy the fic!</p>\n<p>title is taken from <a href=\"https://m.youtube.com/watch?v=y-P0m0M_8pc\" rel=\"nofollow\">this legendary vine</a></p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>I REALLY HOPE THIS CHAPTER DOESN'T READ TOO CHUNKILY..... i wrote most of it in the unspeakable hours of the night so my brain is just. pacing? flow? nope. goodbye.</p>\n<p>this chapter is m-rated ٩( ᐛ )و</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p>j'ai besoin de nouveaux amis: i need new friends. </p>\n<p> </p>\n<p>my biggest thanks to everyone that's stuck with this wild ride over the past 1.5 weeks!! this au is now my baby, and im hoping that i brought some good laughs to everyone who has read up to this point. thank you for reading &lt;3</p>\n<p>come watch me lose all my brain cells for these two on twitter: <a href=\"https://twitter.com/birdsofpasssage?s=21\" rel=\"nofollow\">@birdsofpasssage</a></p>\n<p>edit: welcome to the fanart corner! to everyone who has contributed, thank you all so much (tears of joy):</p>\n<p>1. <a href=\"https://twitter.com/ruvioly/status/1343382156001771521?s=21\" rel=\"nofollow\">childe's moment of awakening ft hamtaro + mona</a></p>\n<p>2. <a href=\"https://twitter.com/ruoyangs/status/1345208569365471238?s=21\" rel=\"nofollow\">zhongli in glasses + childe and his adidas jacket (tm)</a></p>\n<p>3. <a href=\"https://twitter.com/ko_yuue/status/1346281508647051264?s=20\" rel=\"nofollow\">the cat slippers and monaqing's matching pfps.......</a></p>\n<p>4. <a href=\"https://twitter.com/mrk1pk/status/1346234046964256769?s=20\" rel=\"nofollow\"> genuinely in tears they are so handsome T__T</a></p>\n<p>5. <a href=\"https://twitter.com/a_wolfkat/status/1346378519299952641?s=21\" rel=\"nofollow\">the duo!!! and roomba</a></p>\n<p>6. <a href=\"https://twitter.com/xxfizzy_0322x/status/1347181786359451648?s=21\" rel=\"nofollow\">family of four instagram post :'D</a></p>\n<p>7. <a href=\"https://twitter.com/23ppp000/status/1346783474519166976?s=21\" rel=\"nofollow\">cuddly bfs + morax</a></p>\n<p>8. <a href=\"https://www.instagram.com/p/CKWKt1ws1Oi/?igshid=723481fz9opw\" rel=\"nofollow\">MURDERCLOWN XIAO</a></p>",
    "text": "When Childe first arrives at Liyue Airport, he does not gawk at the picturesque mountainscapes in the distance, nor does he marvel at the crystalline clear blue sky, free from the gloomy clouds that hung over Snezhnaya all year long. \nInstead, he is busy shedding his thick parka whilst scanning the crowd huddled around the  arrivals section of the airport, all waiting and holding up signs with the names of people they are picking up. To be completely honest, he feels wildly out of place with his winter clothes, bright hair, and giant worn suitcase that has Teucer’s action figure stickers plastered all over it in the most disorderly manner possible. \nDragging his suitcase behind him—and almost running over the toes of multiple people who fix him with unrestrained glares—Childe fumbles around his pockets for his phone. Once found, he unlocks it, sitting down on a nearby bench and opening up his messaging app. He scrolls through his chats to locate his conversation with 'Guizhong', his apparent new roommate, and taps on her profile picture to get a better look at her face.\nChilde furrows his brows and looks around him. There wasn’t anyone that matched her features from his quick look through the crowd.\n“God,” he mutters under his breath, sending a quick  i’m here, where are u  into the chat and momentarily regretting the fact that they didn’t organise a specific meeting place because,  wow,  he thinks with another quick turn of his head, this place is  huge. Childe’s afraid that if he moves away any further from where he is, he’ll end up in an entirely different pocket dimension altogether.\nFifteen minutes, two outgoing missed calls, and a scroll through the entirety of his Twitter timeline later (Viktor taking selfies during church, Ekaterina complaining about her recent blind date, the usual), and Guizhong still hasn’t replied, her dainty portrait smiling merrily from next to her previous messages. \nChilde groans and locks his phone, throwing his head back to stare at the high ceiling. There’s a baby screeching somewhere to his right, and the sound grates incessantly at his ears. \n Maybe Guizhong’s late,  he reasons,  or maybe her phone broke on the way here and— \nSuddenly, a mess of inky black hair pops into his vision.\nChilde yelps, his surprise causing him to suddenly sit up and bash his head against the stranger’s. “Ow!”\n“Ah!” The stranger recoils as quickly as he appeared, holding a hand to his forehead. “I’m terribly sorry. It was not my intention to startle you.”\nChilde mirrors his motion, immediately scrambling to plaster a smile across his face because this guy is… handsome, to say the very least. High cheekbones, golden irises, a messy bun of dark hair, and an alluring touch of rouge eyeliner beneath his eyes.\nOh. Huh. The airport suddenly feels very, very warm. \n“It’s okay,” Childe reassures the stranger hastily, trying to push down the flush rising on his cheeks, “It’s my fault for reacting the way I did.”\n“I apologise,” the Liyuen man says again with a bow of his head and Childe is now holding his hands up and stuttering as he tries to compute the fact that maybe he’s? Getting hit on? Within thirty minutes of arriving in this country? “Not just for inducing accidental bodily harm, but for being less than punctual as well.”\n“Huh?” Childe drops his hands. “What do you mean?”\n“I am here to pick you up,” the stranger clarifies, his face strangely and comedically solemn for the current situation, “My name is Zhongli.”\n“You mean ‘pick me up’ as in take me on a—?”\n“No,” the other man deadpans, “as part of my obligation as your new roommate.”\nChilde’s brain short-circuits a bit. “Huh? Sorry, but I’m waiting for a ‘Guizhong’... you must have the wrong person.”\nZhongli frowns, and Childe’s brain instantly snapshots the sight and pastes it directly into his mental dictionary next to the word ‘cute’. “Then I suppose I am the ‘Guizhong’ you are looking for, in this case.”\nChilde reaches for his phone. “Wait, wait, wait, but Guizhong is a woman,” he says, showing Zhongli the woman in question’s profile picture. “And you’re…” a man. A very stunning, ‘I-would-instantly-empty-my-wallet-for-you’ type of man, but a man nonetheless, “...not exactly that.”\n“I—”\nZhongli’s phone rings right at that moment, a strange little tune that Childe swears he has heard before but can’t exactly pinpoint from when. Zhongli reaches into the pocket of his fashionable trench coat, pulls out a Nokia flip phone (what the fuck) and brings it to his ear. \n“I found him,” he says without even glancing at the name on the screen. “Yes… no. No. He thinks— please stop yelling, I do not understand what you’re talking about.”\nChilde stands there awkwardly, not quite able to comprehend how a man with a Burberry coat and Gucci loafers is still carrying around brick for a telecommunication device in this day and age. Reality is truly stranger than fiction.\n“...Okay.” Zhongli says almost petulantly, before he hands his phone to Childe. “Here. Guizhong would like to talk with you.”\nBy now, Childe has begun piecing together the fact the Zhongli and Guizhong are most probably, definitely, two separate people, and that some strange miscommunication has likely occurred somewhere during the process of him just wanting to avoid being tragically homeless his new country of residence.\n“Hello?” he asks into the phone. “Guizhong, right?”\n “Yep!”  Guizhong chirps, her voice a bit fuzzy and staticy through the outdated device.  “Sorry about all the confusion! I wanted you to get acquainted with Zhongli without me being there in person, but I guess I forgot to tell you that I’m not actually, well, him, haha!” \n“Er… haha,” Childe says, not sure how to respond, “it’s alright. Everything’s sorted out now, yeah?”\n “I guess so. Well, cool beans,”  Guizhong laughs,  “I’ll meet you two at Zhongli’s apartment to help you guys set up. See you in an hour!” \n“Huh? Oh, okay, b—,” the call disconnects, “—ye.”\nChilde stares at Zhongli’s Nokia, feeling a little disoriented. Zhongli shoots him a look of tired solidarity. \n“For the record, I have no idea why she insisted on finding my roommate for me. I thought I was capable of doing so myself,” Zhongli explains flatly. “So you are as much of a surprise to me as I am to you.”\nChilde huffs out a laugh. He can’t say he’s displeased. “A pretty good surprise then.”\nZhongli blinks in confusion, and Childe feels his heart squeeze a little. He scratches his cheek and turns his head away. “Um. Nothing, let’s go!”\n \n \n \n“I do not have any mora on me,” Zhongli says quietly when they’re in front of Zhongli’s apartment, trying to pay the taxi driver the fare for the trip. \nChilde gawks, his face twisting with bewilderment. “How did you get to the airport, then?”\n“The driver let me off the hook in exchange for my phone number,” Zhongli says, as if that wasn’t the sketchiest thing in the world. Childe makes a face.\n“It’s alright,” he says while reaching for his wallet, “I’ll pay.”\n \n \n \nGuizhong is standing in front of the elevators as they enter the foyer, dressed in a flowing white sundress and sandal heels. Her smile is warm and youthful like the afternoon sunshine. She looks almost ethereal. If Childe were a little more heterosexual, he would definitely be trying to arrange a dinner date by this point.\n“Hey!” She waves, and Childe waves back, eased by her easygoing attitude, “welcome to Zhongli-xiansheng’s humble abode!” \nShe gestures around the foyer—which is evidently  not  Zhongli’s abode, but it’s close enough. \n“Zhongli… what?” Childe asks, the local Liyuen honorific lost on him. Teyvatian may be the universal language of the world, but every nation still has its nuances. He makes himself a reminder to pick up a book on Liyuen language and customs to brush up on later.\n“Please do not worry about it,” Zhongli tells him as they huddle into the elevator and he swipes his keycard for the fifth floor, “It is an honorific of respect towards one’s elder, but when Guizhong uses it, it simply serves as a way of teasing me.”\n“Not my fault you walk and talk like an old man all the time,” Guizhong points out.\nAs Zhongli is unlocking the door to his apartment, a strange sound of scratching comes from behind the door. Before Childe can open his mouth and ask about it, the door opens and Childe is promptly greeted with a face full of brown fur.\n“Morax!” Zhongli exclaims, and Childe would be swooning over how smoothly his voice flows with a bit of emotion in it if he wasn’t already busy sputtering and spitting out bits of fur from his mouth. \nZhongli pulls the big furry lump away from his face, dangles it—a  cat—by its nape and looks disapprovingly at it. “That is  not  how we treat guests.”\nThe cat… Morax, meows in response, its tail flicking side to side. It is the furriest thing Childe has ever seen in his life, and Childe is someone who has seen Viktor’s unshaved legs.\n“Told you that you needed to train some manners into your fur son,” Guizhong says, helping Childe move his luggage into the apartment. “You spoil him too much.”\nChilde picks the last bit of hair from his tongue before he turns towards Zhongli in disbelief. He looks at the man, looks at the cat, then looks back at the man. “‘Morax’?”\n“That’s right.” Zhongli replies, bending down to let the little furry devil trot off into the apartment.\nChilde watches the animal retreat around the corner before he turns back towards Zhongli. “You adopt what is possibly the fluffiest maine coon in all of Teyvat… and you decide to name it after a  demon. The ruler of hell.”\nZhongli raises his eyebrows. “I do not see a problem with that.”\nChilde opens his mouth to protest, before he remembers the ferocity that Morax had exhibited in launching itself onto Childe as if his face were nothing more than a shiny new squeaky toy. “...I guess so.”\n \n \n \nZhongli’s apartment is… unorthodox, for the lack of a better term. It’s very much an organised chaos more than anything—somehow managing to simultaneously tread the thin line between orderly and disorderly, between uncluttered and utterly disastrous. \nEverything is where it’s supposed to be—the television is snug against the wall, the table is placed towards the kitchen peninsula so that one is able to access the rooms in a direct route from the couch area. But everywhere Childe lands his eyes, he can spot at least ten different things in his field of vision—clusters of strange, multicoloured ores on the shelves, multiple ancient Liyuen-style calligraphy artworks hung on the walls, an ornate room divider in the corner that seems to serve no purpose other than to look pretty, frog statues made of jade sitting next to a bamboo pot plant next to a marble vase almost as tall as Childe, the list goes on…\n“Where do I put my stuff?” Childe asks, still looking around the room and playing a spontaneous game of  Where’s Waldo  with himself, except instead of a stripey little man, he’s searching for something that would actually see practical use in everyday life.\n“Over here,” Zhongli says whilst shrugging off his coat, and, wow, his waist is  tiny, “in your room.”\nChilde follows his new roommate into the bedroom, not exactly sure what to expect. He breathes a shallow sigh of relief when Zhongli flicks the lights on and presents him with a rather neat, albeit bare space.\n“This room used to belong to Guizhong, but she had to move to the other side of the city for work,” Zhongli explains, “Now it is yours. Please feel free to customise it as you see fit.”\n“You two used to live together?” Childe asks. “There’s already enough stuff in this apartment with you alone in it.”\nZhongli chuckles, the sound soft and soothing. “Guizhong had taken up much more space than me. She even converted the balcony into her mini workshop for her industrial design projects. Though I admit.. since she moved out, I may have taken up a habit of buying more than I need—”\n“You started  hoarding,  that’s what you started doing!” Guizhong yells from the kitchen. “Me moving out was  so  shocking that you had to turn to material objects to fill that newly formed Guizhong-shaped hole in your heart!”\nZhongli whips his head around. “It’s not like tha—”\n“I’m hurt, Zhongli-xiansheng! ”  Guizhong whines with her head in the fridge as she fumbles around for something. “So now you’re saying I meant nothing to you? Not after I spent five years rooming with you? Not after I wasted my entire childhood trying to bail you out of trouble after you kept beating the snot out of the kids on our street?”\nChilde can’t help but burst out laughing. Zhongli brings his hand up to rub at his temples. “I did not senselessly ‘beat the snot out’ of them. I only did so to defend you and Havria from their harassment.”\nGuizhong pops her head out from behind the fridge door. “Yeah, and  that  was enough to get you cemented as our local thug—a tiny elementary school kid absolutely pummelling a bunch of middle schoolers.” She turns towards Childe and shoots him a wink. “If you ever run into trouble, you know who to call for backup, yeah?”\n“Actually, I’m pretty good in a brawl myself,” Childe inputs, “I’d love to see if I can match hand-to-hand with  xiansheng here.”\nZhongli sighs. “Not you too.”\nChilde walks over to the kitchen, taking in the ingredients Guizhong paid out on the kitchen bench. “What’re these for?”\nThere’s a dangerous glint in Guizhong’s eyes. “A trial.”\n“A trial?”\nGuizhong closes the fridge. There are little souvenir magnets and sticky notes all over the door. She puts her hand on her hips and gestures towards the ingredients; tofu, rice, multiple types of proteins, and an assortment of vegetables.\nGuizhong grins. “As you may or may not know,” Childe does not know, “Zhongli here is incapable of cooking.”\n“I won our high school culinary competitions.” Zhongli protests under his breath, but Guizhong catches it anyway.\n“Correction:” she says, “Zhongli here is incapable of cooking  for himself.” \nChilde snorts. “So that’s why you told me you were specifically looking for someone with ‘world class cooking skills’ on flatmate dot com?”\nGuizhong claps her hands together. “Exactly! I’ve seen how well you cook already from your social media, so just think of this as an induction of sorts. If you make something that can live up to Zhongli’s picky tastes, I’ll discount your rent.”\n“I thought  I  was the landlord here.” Zhongli walks over to them, and Guizhong shushes him with a hand over his mouth. The man crosses his arms, but makes no move to swat Guizhong away.\nChilde is already rolling up his sleeves at this point, a playful smirk dancing across his lips. He is so ready for this. “No worries. Watch me wow this guy off his feet.”\nZhongli smiles from behind Guizhong’s hand, his eyes shimmering under the warm kitchen lights. “Surprise me.”\n \n \n \n“Mmh! This is  amazing!” Guizhong exclaims between mouthfuls of stir fry—one of the few Liyuen dishes that Childe knows how to cook—before piling more food into her bowl. “It’s even better than the stuff made by locals.”\n“Thanks, that’s some pretty high praise.” Childe grins, stabbing his plastic fork into a piece of chicken. \n(Unfortunately, the trio realised too late that Childe is physically incapable of using chopsticks until dinner was almost served, which prompted Zhongli into making a dash for the nearby 7-Eleven to buy a twenty pack of plastic forks, which would hopefully last them until either Childe learns how to wield the fiddly eating utensils, or they go out to buy more environmentally friendly metal forks.)\n“What’s the verdict?” Guizhong turns towards Zhongli, who is chewing slowly on a piece of  xianggu and nodding approvingly.\n“Good,” he says. Childe beams.\nGuizhong claps her hands. “It’s settled, then! Welcome to the team!”\n“What team?” Childe asks.\nZhongli looks awkwardly away from the table. Guizhong leans forward. “The ‘Helping Zhongli Be A Functional Member Of Society’ team’, of course!”\nMorax takes that opportunity from the lapse in the conversation to lift his head from the cat bowl and meow in agreement.\n \n \n \nChilde is in the kitchen at ass-o’-clock later that night, heating up leftovers in the microwave when he feels a presence behind him, and a warm breath ghosting across his nape. \n“Munchies?”\nChilde almost springs out of his skin. “Son of a— fuck!” \nZhongli jumps back, his eyes widening. “I apologise—I didn’t intend to frighten you.”\nChilde drops his combat stance. The microwave beeps. “Sorry, my fault. I overreacted.”\nHe takes the food out of the microwave, wincing a little when his fingers make contact with the hot pyrex container. Zhongli follows behind him to the dinner table with a question in his eyes. His hair is tied into a low, side ponytail and his face is softer from a lack of makeup. He has cat slippers on his feet. \nAn entirely different sight from when Childe first saw him—tall, stoic, almost regal.\n“Jet lag.” Childe answers Zhongli’s unasked query tiredly. \n“I see.”\nHe deflects the question back. “Why are  you still up?”\nZhongli blinks slowly, looking not fully awake. “I… often wake at random hours of the night.” He replies. Childe frowns.\n“That can’t be normal.”\n“It has been the norm for me for years,” Zhongli says with a slight smile. “Please don’t worry about it.”\nHe takes a seat at the table opposite to Childe, seemingly watching his roommate eat, but Childe can already tell that he’s simply zoning out. They (read: Childe) eat in silence for a while as the clock’s hour hand slowly inches towards two in the morning. It’s a bit awkward in all honesty, mostly attributed to the fact that Zhongli has gone as still as a rock, and Childe doesn’t have much material to create a meaningful conversation from, given that he’s only really known the other man for half a day.\nMorax slinks out from behind Zhongli’s bedroom door, evidently woken up by Childe’s cussing and the aroma of food. He meows and hops onto Zhongli’s lap with the grace of a dolphin despite his bulky stature, and that seems to startle his owner out of his half-asleep state.\n“Oh.” He blinks. “Hungry?”\nMorax rubs his head against Zhongli’s chest. Childe wishes he had his phone with him to take a picture.\nAfter giving Morax his midnight snack and letting Childe finish his, the three of them sprawl out on the couch, letting the soft light of the television wash over them as Childe flicks through the channels and Zhongli cards his hands through his cat’s fur. \nThey fall asleep just like that—National Geographic: Liyue Edition running on the screen and Morax’s cat snores drowning out those of his humans, as morning light bleeds from the tips of the mountains and into the night.\n \n \n \nOver the next few days, Childe discovers a lot of things about his new roommate.\nThe first thing is that Zhongli is  terrible  at housework. The severity of this incompetence is further amplified by Morax’s unhelpful tendency to shed hair everywhere and barf up hairballs in the most  obscure places. One of them being, somehow, behind the fridge. \nIt’s not that Zhongli avoids his chores—in fact, he’s eager to help Childe in any way he can—but more so the fact that he simply does everything wrong: he folds the laundry, but the method is completely inefficient. He vacuums, but for some reason all the dirt on the floor flees to the sides of the nozzle rather than into it. He has no idea how to use the washing machine, or the dishwasher (currently being used as a second pantry), or a hairdryer. \n \n(“How do you not know how to use one of  these?” Childe almost yells, waving the cordless hairdryer around with his hands and in general making himself a blatant safety hazard within the confines of their shared bathroom.\n“The last time I tried to use it… was not a pleasant experience.” Zhongli says stiffly. Childe takes Zhongli’s hand and resolutely places the gadget onto it.\n“Show me how you used it.” \nZhongli nods. He brings the dryer up and points the end of it like a gun so that it touches Childe’s forehead—and before Childe can realise that something is fundamentally wrong with this setup, Zhongli flicks the switch for full blast and sends Childe’s head flying back into the mirror, completely K.O.ed.\nNeedless to say, Childe considers himself lucky that his front bangs haven’t been fried to a gingery crisp.)\n \n \nThe second thing Childe finds out is that Zhongli is currently doing his masters at the same university that Childe got his transfer scholarship at… which really shouldn’t have been a surprise given that they live ten minutes from said university, because why else would Zhongli be living here? \n \n(“We could get lunch together between classes,” Childe grins, perhaps a little too enthusiastically. Zhongli doesn’t seem bothered by it, judging from the smaller but no less happy smile on his face.\n“Yes,” he agrees, leaning his chin on his hand, “We can.”)\n \nThen Zhongli casually drops the fact that he’s actually the head of the student council, and Childe subsequently waves their lunch dates goodbye in the face of countless board meetings and leadership obligations.\n \n \n(The last thing Childe finds out is that Zhongli, despite his technological incompetence and unrealistically picky tastes, is seemingly  perfect  in every other way.\nIt’s not that Childe intentionally stares at his flatmate whenever Zhongli goes off on a tangent about the industrial compounds of their toilet cleaner or fusses over the mud on Morax’s paws or sips his daily cup of green tea with the zen of a thousand monks—his eyes just. Linger.\nBut, well, Zhongli is objectively very attractive, and Childe is objectively very not straight, so of course it’s natural to feel some decidedly very un-roommate-y feelings in this situation, right?)\n \n(…Right?)\n \n \n“Childe,” Zhongli taps him on the shoulder, “I think we need to go shopping soon.”\nChilde looks up from where he’s texting Tonia about sending her some of Liyue’s local beauty products. “Sure. You need me to come along, right?”\nZhongli smiles in affirmation, and Childe’s heart flips like a pancake in a teflon pan. “It would be preferable. And I’d like to use it as an opportunity to show you around the city, given that you have only recently arrived.”\nChilde sits up, leaving Tonia on read. He’ll get back to her later. “When?”\nZhongli looks up at the clock, before he turns back around. “How about in fifteen minutes?”\nChilde makes a face as he pulls himself up from the couch. “I think we need to work on your definition of ‘soon’.”\n \nThey meet a kindly elderly woman in the foyer on their way out, donning gardening gloves, a giant hat, and about three layers of sunscreen on her face.\n“Childe,” Zhongli begins, picking Morax up from the floor so the little bugger won’t run around and tangle his legs together with his cat leash  (because Morax needs walks, otherwise he will become fat,  is what Zhongli had said, and Childe, out of the kindness of his heart, decided not to tell him that Morax  already  looks fat with all that fur), “This is Granny Ping, our resident gardener.”\nHe turns towards Granny Ping. “Granny, this is Childe, our resident… just resident.”\nChilde laughs at that, taking the elderly woman’s hand and giving her a warm handshake. “Nice to meet you, I’m Zhongli’s new roommate.”\nGranny Ping laughs with him, the lines of her face belying the youthful sparkle in her eyes. “What a capable young man. You are in good hands, Zhongli.”\nDespite feeling like  he  should be the one in  Zhongli’s hands—being in a new country and all—Childe raises his eyebrows and asks cheekily, “how can you tell I’m capable?”\nGranny Ping takes his hand into both of her hands and runs her fingers over his knuckles. “For one, you are living with dear Zhongli here.”\nZhongli coughs.\nThe old woman continues. “And two, the callouses on these hands tell no lies—you are an able, hardworking young man.”\nChilde stares down at his hand, his grin waning a little. There are multiple laceration scars crisscrossing up and down his fingers, the result of picking up cooking knives too young and too clumsily. The pads of his fingers are rough from the way he holds the brooms, and there’s a faint burn mark dappled across the meat of his thumb from an ironing mishap a few years back. \n“I’ve always disliked my hands,” he says, perhaps unnecessarily. \nGranny Ping looks him in the eyes and smiles back. “One day you will feel proud of them.”\n \n \n“Oh,” Zhongli says at the checkout whilst peering into his very evidently empty wallet. “I forgot to bring mora.”\nChilde brings his hands up to his head. “First the taxi, then the takeout yesterday, and now this.” He mutters. Thank the heavens they’re at a self-service checkout. “I’m beginning to see a concerning pattern here.”\nZhongli simply looks at him with his unmoving gaze, slim fingers still holding the wallet open, and Childe groans as he reaches into his own pocket to pull out his own wallet and fish his own card out of it. “Fine.” \nAfter that, they make their way outside… and find Morax engaged in a battle royale showdown with a doberman twice his size, still leashed to a pole. Zhongli promptly drops his three bags of groceries to snatch his hairy son off the ground. Morax hisses and yowls, his claws unsheathed and swiping through the air and very narrowly missing Zhongli’s bare arms.\nThe doberman snarls, restrained by its own leash to a separate pole. Zhongli quickly tries to untie Morax’s knotted leash before a female voice rings through the air, sharp like lightning. \n\n “Down!” \n\nThe dog instantly cowers, and Childe looks up to see a short woman with purple dyed hair stalking angrily in their direction.\n“Did Beidou not train  any  manners into you?” She mutters as she frees the whimpering animal from the pole. Then she looks up. “I’m sorry—oh.”\nZhongli looks back at her, half his face obscured by angry brown fluff. \n“Hello, Keqing,” he says, muffled.\n“Zhongli,” Keqing stands up. “Fancy meeting you here, I haven’t seen you at all during the break. You look well.”\nZhongli smiles, his eyes thinning. “Likewise.”\nKeqing looks away and coughs, tugging her dog’s leash and sliding a strand of hair behind her ears. “I’ll see you once classes start again. Remember to email Ningguang your timetable so that we can organise a slot for our weekly meetings.”\n“Of course,” Zhongli replies, walking back over to lift all three of his grocery bags with one arm before giving Keqing an awkward half-wave-not-wave. It’s tough to make big hand gestures when he’s got a cat draped over his upper arm. “Take care.”\n“You too,” she says. Childe can’t help but think that this entire exchange feels very stiff.\n“Who was that?” Childe asks once they’re out of earshot, but not out of sight—the woman’s gaze burns the back of his neck, following his and Zhongli’s every movement.\n“A vice of the student council,” Zhongli hums, trailing his eyes over the window displays as they walk by, “We’re not particularly close, but she and I are on good terms, at the very least.”\nChilde looks behind him. Keqing is still staring at them. He looks forward. “Er, yeah. I guess—huh? W-woah! Hey!” \nSomeone pushes between them with such force that Childe almost topples over and drops his bags.\nThe stranger grunts when Childe shouts at him, before the latter looks over to Zhongli to make sure he’s alright. The older man looks back at him, slightly ruffled but fine for the most part, except for the heavy frown between his eyebrows.\n”Are you okay?” he asks.\nZhongli shifts Morax from one arm to the other, presumably to ease the strain. He pauses. He pats his pocket.\n“Childe,” he says slowly. “Just now, that man, he seems to have… taken my wallet—”\nChilde sputters. “He  what?!”  \n“He reached into my pocket and took my—”\n“Oh my god! Fuck, okay,” Childe lets out a few more choice Snezhnayan expletives, immediately dropping his bags to the ground. “Wait here, I’ll get it back right now—”\n“Make way!  Make way—!!!”” \n“Huh?” Childe barely gets a word out of his mouth before a flash of purple hair shoves him to the side for the second time within five minutes. “Hey! What the  hell  is going on!”\n“Keqing?!” Zhongli exclaims, staring towards where the woman is running with her dog in the direction the thief had fled in.\nChilde gawks for two seconds before he shakes his head and breaks into a sprint as well, leaving Zhongli, Morax and about five different grocery bags scattered in his wake. \nHe trails after the rapid click-clack of Keqing’s heels weaving nimbly through crowds, across roads, and then finally into a fishy back alleyway. In front of him, Keqing seems to have slowed her relentless pursuit while her doberman barks irately, its tail swaying low and cautiously. \n“Keqing!” Childe calls out, letting out a surprised ‘woah’ when the woman snaps her head backwards. “Sorry uh, that’s your name right…?”\nKeqing shoots him a sharp look and holds a finger up to her lips.  He’s around here, she mouths, motioning around the dim alleyway and Childe nods in understanding. Both of them strain to listen for any noises out of the ordinary, but for a few minutes there is only the whistling of wind and the hum of cars out in the street. \nChilde slowly adjusts his posture.  You sure he didn’t run away already? He gestures towards the exit. \nKeqing points towards the darkness, holds up one finger, and shakes her head.  Dead end. I know this city’s layout like the back of my hand.  \nGiven how big the city is, Childe has some doubts, but he knows better than to doubt her after seeing how fierce she can be. \nA rustle. A tap. \nSuddenly, Keqing’s doberman lets out a sharp bark. \nSomething glints from the corner of Childe’s vision and instantly he turns on his heels—catching  warm skin gaunt hands, narrowly dodging the cold light of a pocket knife stopped inches away from his face. \nThe scrawny thief lets out a noise of surprise before his forearm is twisted, toppling his centre of gravity as Childe sends a bruising undercut right into his torso. \n\n“Hurgh—!”\n\n“I’m taking that, thank you very much.” Childe wrenches away the knife and tosses it to the side. He slides to the side, nimbly dodges another weak punch, counters it with a blow of his own—across the cheekbone, enough to bruise but not enough to seriously injure. “Hey! Don’t you know it’s wrong to steal?”\n“Fuck off! None of your business—ow!” In one swift movement, Childe sweeps his leg low and buckles his opponent’s legs, causing them both to fall to the cold concrete ground. \nFinally, with a rough twist of his hand, he wrenches the wallet away from the thief’s grip.\n“Sorry to disappoint you, buddy, but—” he casually flips it open, “you won’t find any cash in here, unfortunately.”\nThe thief looks up, stunned. Childe almost laughs despite the utterly sad state of Zhongli’s financial inventory, even if the wallet itself is clearly manufactured from high quality foreign leather. \nAfter Keqing calls the police and they both explain the situation to the officers, Childe watches as the police car shrinks in the distance. He turns around, and says, “that was… unexpected. I think I should get going now, you know, since Zhongli is probably still waiting somewhere.”\n“Yes, you should,” Keqing says, before adding quickly, “thank you.”\n“Huh? Oh. No biggie,” Childe grins. “I’ve caught more than one petty thief in Snezhnaya before. And since Zhongli  really  seemed to like this,” he shows her the wallet, “I couldn’t just let him run away with it.”\nKeqing gives him one last solemn nod before she leaves. Childe still can’t read her through that serious aura, but something tells Childe that he may have just won her approval. For what, he still doesn’t exactly know yet.\nWhen he manages to find his way back to Zhongli, he’s surprised to see the older man surrounded by what seems to be a  legion  of young children, all crowded around him and running their hands through Morax’s long fur—much to the grumpy feline’s resigned annoyance.\nZhongli’s eyes light up like jewels as soon as he spots his companion, but then a girl  yanks  on Morax’s tail, and Childe bursts into laughter as he watches chaos unfold before his eyes.\n \n \nOne day before classes start, Childe declares, “We’re getting you a new phone.”\nZhongli is making his way through some kind of report when Childe slams a hand down onto his desk. He looks up, eyebrows slightly furrowed behind his reading glasses. “Pardon?”\n“We are. Getting you. A new phone.” Childe enunciates. “Or probably more accurately,  I am getting you a new phone.”\n“Why?”\n“Your current phone,” Childe points at Zhongli’s Nokia sitting innocuously at the end of the desk, “is a prehistoric fossil.”\n“But it is still adequately serviceable.”\nChilde breathes in. He breathes out.\n“I don’t care,” he says childishly, providing no more of a compelling argument beyond that. “We’re buying you a phone.”\n…Because there’s no way he’s telling Zhongli that he tried calling the latter to tell him about his glorious wallet-winning victory in the alley the other day only for the calls to go straight to an outdated voicemail preset. Fifteen times.\nZhongli stares at him for a few seconds, before he puts his pen down and nods. “Alright, if that makes you happy.”\n \n \n \nWhich is why Zhongli walks out of the nearest Apple store with a shiny new phone in his hands three hours later, looking utterly despaired at the lack of number pads on contemporary technology.\nChilde reassures that it’s okay when the older man then insists on paying him back in the future; he’s used to treating the people around him with expensive or outlandish gifts (case in point: Teucer’s 1:1 scale figure of Mr Cyclops sitting in the backyard of their home, almost as tall as their entire house), and given that it’s  Zhongli of all people, Childe is (far too) willing to crack open his bank account here and there for him. And plus, it’s not like he’s strapped for money. His parents are big shots in the Snezhnayan finance market after all.\n \n \n \n“Oh, hold on,” Childe tugs at Zhongli’s coat on their way back home, “I know that person.” He points towards a short man with a choppy haircut and a hat that’s way too big to be practical whatsoever. “We graduated together.”\n“Were you friends?” Zhongli asks, but from the flat tone of his voice Childe already knows that Zhongli knows the answer. \nHe humours the question anyways. “Nope.”\nZhongli exhales through his nose. “Go greet him. It is but a common courtesy. I will take a look around the shops here in the meantime.”\nChilde shoots him a toothy grin before he strides off, stuffing his hands in his pockets as he weaves between other pedestrians to get closer. The shorter figure, however, notices him before Childe gets a chance to scare him. His eyes narrow menacingly, but the taller man simply scoffs and bends down at the knees, fully aware of how insulting the action for the vertically challenged.\n“What’re you doing here, scared moose?”\n“My name is  Scaramouche,  you godless heathen,” the other hisses back and stomps on the ginger’s foot. “Why the fuck are  you here?”\nChilde bites back a yowl of pain. “I transferred to the local uni here, that’s what—” the tiny purple gremlin twists his foot, “Ow ow ow  son of a  bitch!” \nScaramouche finally takes his foot off Childe’s and shoots him a thunderous glare. “Liyue National University?”\nChilde gingerly flexes his toes inside his shoes. “That’s the one.”\n“Fuck,” Scaramouche cusses. “Me too. Now I have to see your ugly face on campus.”\n“My face is beautiful,” Childe shoots back. A quick glance back tells him that Zhongli is currently being ushered into a high end luxury trinket shop by a very enthusiastic sales rep, and Childe freezes on the spot. Scaramouche’s insults go in one ear, and out the other.\n“Oi! Listen to me when I’m talking to you!”\n“Sorry moose, duty calls,” he yells, revving into a jog towards Zhongli’s direction, deaf to the other’s protests. “See you around!”\n“Hey!”\nUpon entering the shop, he’s quickly faced with the sight of Zhongli holding a… \nA statue. Or, to be more precise, a golden Hamtaro statue. \n“Childe,” he says with the barest hint of a whine to his voice, amber eyes wide, “I want this.”\n“The fuck?” he blurts eloquently, wincing at the way that the statue flashes under the lights like an ungodly disco ball. “We are  not getting that.”\n“This is twenty-four karat gold...”\n“Okay listen to me, Zhongli—”\nEvery single protest dies in his throat when Zhongli shoves the statue in his direction, looks down at his feet and says softly, “...and it reminded me of you.”\n“...”\nThe salesperson looks nervously between them. Childe is about to have a mental breakdown.\nA twenty-four karat golden Hamtaro statue. \nZhongli thinks Childe looks like fucking  Hamtaro. \nAjax ‘Childe’ Tartaglia, who has only ever cried once in his life upon birth, almost bursts into tears. He pays for it anyways.\n \n \n\nToe Knee Ah, Ajax Spray-n-Wipe\n\n \n\n5:55pm\n\n\n tonia \n\n\n  should i dye my hair? \n\n\n how do you feel about green \n\n\n like maybe the hatsune miku kinda green \n\n \n\n5:57pm\n\n\n huh??? \n\n\n what happened to your carrot pride? \n\n\n and hatsune miku is BLUE \n\n\n shame on you &gt;:( \n\n \n\n5:57pm\n\n\n no shame on YOU for forcing me to send you like a million silk flower face masks which i know youre never gonna use \n\n\n Im kidding ily &lt;3 \n\n \n\n5:58pm\n\n\n i love you too brother &lt;3 \n\n\n but i wont love you anymore if you actually dye your hair green. \n\n\n also teucer hates green \n\n \n\n5:58pm\n\n\n ouch \n\n \n\n5:59pm\n\n\n whats the occasion? dont tell me you wanted to dye your hair because you felt like it \n\n \n\n5:59pm\n\n\n i just felt a bit insecure \n\n\n hey honest question do you think i look like a hamster \n\n \n\nToe Knee Ah is typing...\n\n\nToe Knee Ah is typing...\n\nToe Knee Ah is still fucking typing...\n yeah is what Tonia ends up sending him, and Childe throws his phone to the other side of the room. He glares at the Hamtaro statue of doom sitting proudly on his bookshelf, and snatches it off the shelf. \nIt’s  so goddamn ugly.\nChilde briefly considers shot-putting it straight out of the window—five hundred thousand mora be  damned—before Zhongli’s pouty face pops into mind, and he drops his hand in defeat. He collapses back onto his chair, still holding the statue in his hands. Not even a whole month into this whole flatmates business and he’s already developed an... infatuation.\nIs that it?\nNot a crush. Definitely not a crush. Is it? Perhaps he’s just confusing himself at this point. Because, despite everything, Childe hasn’t really  actually  thought about doing anything like  that  with his roommate, because  yes,  Zhongli has a nice ass,  yes, he has nice thighs, but— \n...But.\nOkay. Nevermind, he shouldn’t have let his mind wander there, because  now  he’s thinking about it—pressing Zhongli into the bed, or getting pressed into the bed by him—and, oh, wow,  fantastic, is this a fucking boner he’s springing? Shit. \nWhile Childe is undergoing a small quarter-life crisis, unbeknownst to him, the door creaks open, and Zhongli strides in with his new phone and the user’s manual in his hand. “Childe, do you have time to... ah.”\nHis gaze falls onto the golden Hamtaro, then to Childe’s crotch, then he coughs once, twice, before gingerly closing the door. \nChilde jumps up and pries back open the door indignantly, screeching. “It’s not what it looks like!” \n \n \nThe first friend Childe makes at his new university (Scaramouche does not count) is thanks to him forgetting a pen like a dumbass, and having to borrow one from the girl sitting next to him. She introduces herself as Mona Megistus, Astrologist Extraordinaire.\n“So. You have feelings for your roomie.” Mona recaps, because, well, Childe had to let out his romantic-turned-existential crisis to someone within complaining vicinity, otherwise he would probably explode like one of those hydrothermal vents they had just learnt about today had he held it in for any longer.\nThe entire day, he’s been thinking non-stop about Zhongli; his voice, his eyes, his waist, his fucking  illegal ass—two months of suppressed horny thoughts rushing out end in sight because he’s been so busy tying up loose ends and saying his goodbyes to all his acquaintences in Snezhnaya that up until now, he hasn’t even gotten a quiet moment to let all his steam out.\n“I’m fucked,” Childe admonishes towards himself. Mona rolls her eyes as she sips on her Chatime lychee tea (bought for her by Childe, because Childe seems to be a magnet for people in financial desperation, for whatever reason). “I’m actually fucked.”\nMona scoffs. “Stop acting like a big baby. Who knows, maybe it’s just, I don’t know, a temporary thing. Passing attraction.”\nChilde groans. “It’s not that simple.”\n“How do you know?”\n“I,” he pauses, staring at his hands, “wanna hold his hand. Watch the sunset with him. Maybe grow old and retire together?”\nMona stares at him, unimpressed. “I guess you’re fucked.”\n“Thanks.” He leans his head into his palms.\nSilence.\n“…When’s your birthday?” The self-proclaimed astrologist pitches her now-empty drink cup at the nearest bin. It misses, but neither of them make a move to pick it up. Childe lifts his head barely enough to rest his chin on his fingers. \n“July twentieth,” he mumbles. “You gonna use it to read my horoscope, or something?”\n“More or less,” Mona replies as stands up, whipping out a strange disk object from her bag.\nChilde watches with wide eyes as Mona proceeds to conduct a ritual known as an 'astrology chart reading', her hands nimble and practiced as she turns the disk, everything coming out of her mouth flying directly over the orange antennae on his head; something something ascendents, something something houses, something something rising moon and planetary motions…\n“So in summary,” Mona clarifies, “you’re getting that ass.”\n“I’m getting that ass.” Childe repeats numbly, astral projecting a little bit. \nMona whips away her astrology device thing just as quickly as she brought it out. “And as your new best friend and close confidant, I am now legally obligated to help you two get together.”\n“I’ve only known him for a month,” Childe protests, “what if it really  is just a—”\n“Nonsense!” Mona wags a finger at her friend, a mischievous gleam twinkling in her eyes, “The stars’ decree is absolute, and they have already set the wheels of your budding romance into action!”\nChilde feels his eyebags manifesting. “‘Budding romance’ my foot. That guy thinks giving out his number is an acceptable way to pay for a taxi ride. No way is he gonna understand the concept of romance. Romance is dead.”\n“So he’s one of those types, huh?” Mona nods wisely. “Very well, I’ll see what I can do.”\n“...No, you don’t really need to get yourself involved.”\nShe snaps her fingers. “And  that’s where you’re wrong, Childe Tortilla—”\n“It’s pronounced  Tartaglia—” \n“—for I was already involved from the very moment you plucked that dying gel pen straight out of my hands! It’s  destined  that I enter your life as your guide to all things romance,” she smirks. “And think of this as an equivalent exchange; you buy me milk teas, I get you a boyfriend. Fair, right?”\n \n \nQueen MonAss  ❤, Ajax Spray-n-Wipe\n \n\n3:13pm\n\n\n First things first \n\n\n If there is ANY sort of development between you two i will be the FIRST to know. \n\n\n Capeesh? \n\n \n\n3:14pm\n\n\n ok \n\n \n\n3:14pm\n\n\n Okay good \n\n\n Youre supposed to respond back with capeesh \n\n\n Nevermind. Here’s the plan \n\n\n Youre gonna start by buying him a gift. Something he’ll be using ALL the time \n\n \n\n3:16pm\n\n\n wait \n\n\n i literally bought him a phone like \n\n\n yesterday \n\n\n and a golde \n\n\n … \n\n\n nvm \n\n \n\n3:16pm\n\n\n Doesnt matter. That was before i came into the equation \n\n \n\n3:16pm\n\n\n okay so. smth he’ll use a lot \n\n\n eg?? \n\n \n\n3:17pm\n\n\n Dumbass. Why are you asking ME \n\n\n Youre the one that lives with him \n\n\n Get him like, idk, something that will see use around the house or something \n\n\n Like this \n\n\n [Link Attachment] \n\n \n\n3:19pm\n\n\n u have got to be kiddinf m \n\n\n i am not ggetting us a \n\n \n\n3:19pm\n\n\n Well? Do you have a better idea??? \n\n \n\n3:19pm\n\n\n yeah i could get him a \n\n\n a \n\n\n a  \n\n \n\n3:20pm\n\n\n fuck \n\n \n\n3:20pm\n\n\n Exactly. get moving, loverboy \n\n \n \nDespite Childe thinking this is the dumbest idea to ever grace the solar system and beyond—he still calls bullshit on the rising moons and housing stars, or whatever that was—the following weekend, he comes home from a nearby electronics store with a wrapped box in his hands and proceeds to reevaluate his life choices.\n“Can’t believe I’m doing this,” he grumbles, pushing open the door. “I’m home! Zhongli?”\nSaid man pops his head out from his room, his glasses perched on his head, long hair in a bun and a flustered expression on his face—or as flustered as a man with the emotional spectrum of a cactus can be. “Childe. Just in time. Would you mind helping me look for my—”\n“On your head.”\nZhongli brings a hand up to pat his glasses resting atop his hair. “Ah. Thank you.”\n“No worries,” he pulls his lips upwards, but there’s a strange feeling of nervousness stirring inside his gut, “actually, can you come here for a moment? I bought something for you.”\nZhongli raises an eyebrow, walking over to the doorway where Childe has placed the box on the ground before grabbing a pair of scissors from the kitchen to cut open the wrapping. “I do not see how there have been any recent occasions that warrant a gift, Childe.”\n“Oh no, I just,” Childe fumbles, slicing through the layers of gift wrapping (why are stores still using Santa patterned gift wraps?), “just felt like getting you something.”\n“Oh.” Zhongli’s mouth opens in mild surprise, gutwrenchingly cute. “That’s very sweet of you to do so.”\nChilde coughs harshly, feeling his heart dancing at 2.25x speed in his chest before he rips open the cardboard packaging with much, much more force than necessary. Zhongli waits until the other man’s done, before he peers into the box and carefully lifts out its contents, gingerly holding it in his hands.\n“This is…” he trails off in wonder.\nChilde feels his face grow warm as he laughs nervously, scratching at his cheek. “Sorry. I’ve only been here for a month but I’m already introducing a new occupant into our tiny place—”\n“I love it.” Zhongli declares calmly. Childe gawks. “We should bestow it with a name.”\n \n \n \nTwo hours and a countless number of rejected names later, ‘Roomba’ is appropriately named and welcomed as the first Zhongli-friendly vacuum cleaner to ever grace the household.\n\n\n\n \n You two sure clicked together, huh?”  Guizhong says, the crinkling of her Dorito bag almost drowning out her words as she pops another chip into her mouth.  “Heard you guys are attached at the hip now.” \nChilde laughs and takes Zhongli’s phone off his hands, holding it at an angle so that half of both his and Zhongli’s faces are caught by the camera. “That sounds like an exaggeration. We’re just good buds, right, old man?”\nZhongli digs his elbow into Childe’s side, earning him a yelp. “I am not yet getriatric enough to warrant that title.”\n“Gee, then can you tell me why we’re calling Guizhong on  Skype? No one uses Skype anymore.”\n “Boys,”  Guizhong cuts in, talking as if she wasn’t the same age as the getriatric old man next to Childe,  “I’m a busy woman, as much as I’d love to join Childe with the teasing, I don’t have time to listen to your old married couple bickering. Now tell me why you called me, Zhongli.” \nZhongli flushes a little, the tips of his ears and nose dusting red, and Childe almost coos at the sight. Almost. “I simply… missed you. It’s been a while since I saw you.”\nGuizhong cackles through the screen, completely unhelpful.  “You just miss being my little spoon.” \nZhongli flushes harder at that, and Childe splutters. \n “Well?”  Guizhong wriggles her eyebrows,  “I don’t hear any denials there. If you wanted to cuddle so bad, you know you could just ask Childe.” \n“I could not possibly do that,” Zhongli protests a little too quickly. “I’m afraid that troubling him with such a request is out of the ques—”\n“Actually,” Childe interjects before he knows what he’s doing, “I’m okay with cuddles.”\nSilence.\nMorax scratches at the door. Zhongli uses this as an excuse to extract himself from the conversation, mumbling about forgetting to walk the cat as he stumbles towards the doorway and almost bangs his shin against their shoe rack. \n“Remember to buy eggs!” Childe calls out, but three seconds after the door closes he realises that he may as well have not said anything at all, because Zhongli never carries enough spare change on his body to pay for said eggs anyways.\n “That’s cute. He got embarrassed.”  Guizhong says between another mouthful of Doritos.  “I can’t remember the last time he blushed like that.” \nChilde opens his mouth. Closes it. Opens it again. “Guizhong, can I ask you something?”\n\n “Shoot.” \n\n“Were you and Zhongli ever,” he makes a strange jazz-handy motion, “a thing?”\nGuizhong blinks. The video call lags, so her eyes remain closed for two seconds longer than they should have.\n “Yeah we dated for a bit in high school,”  she tells him, and Childe holds his breath,  “but really, it was more of an excuse to get all the girls—and the occasional guy—off Zhongli’s back so he could focus on his studies, you know?” \n“So it wasn’t anything serious?” Childe asks, his heart thumping in his chest.\nGuizhong shrugs.  “Nope… well, I guess there were  some  feelings in there, but it was just teenage hormones to be honest. We’re past that now. He’s more like a brother to me than anything.” \n“Oh,” Childe swallows, “I’m glad.”\nGuizhong raises her eyebrows at that, and the sound of cracking Doritos echoes through the speaker.\n \n \n(Contrary to both Zhongli and Childe’s expectations and completely in line with Guizhong’s, cuddle nights become a thing.)\nChilde wakes to the feeling of something nudging his shoulder. He groans and flops over onto his back, cracking his eyes open with a soft snort, blinking away the sleep fog.\n“...? Huh?”\n“...Childe,” Zhongli murmurs, standing awkwardly at the bedside, “can I join you?”\n“Wuh? ‘Kay...” The younger man groans, only a quarter awake, before flopping over and squashing his nose into the pillow and diving straight back into the bliss of sleep.\nZhongli quietly pulls back the covers and settles himself next to the other man, resting his head gently into the junction between nape and shoulder, slowing his breathing to match Childe’s, and drifting off into one of the more restful sleeps he’s had in a long time. \n \nIn the morning, Childe wakes up with a smushed nose and soft breaths against the shell of his ear. It takes half an hour of confused yelling, misunderstandings, and a whole pot of green tea before Childe pulls his mind out of the gutter.\nCan’t blame him, really—snuggling in front of the TV in close proximity is one thing, but waking up next to each other in the morning with entangled legs is a whole other can of worms altogether. \n“Platonic cuddling,” Childe insists, downing another cup of tea in one go.\nZhongli nurses his own tea in his hands, confused as to why Childe sees the need to use such a particular term for it, but goes along with it nonetheless.\n“Okay. ‘Platonic’,” he says with the most clueless face ever. Childe is going to pirouette off a skyscraper.\n \n \nQueen MonAss  ❤ , Ajax Spray-n-Wipe, Keqing., ❀ Guizhong Ballista ❀, Guest User #57386, Ningguang (Do not contact me outside of work hours)\n \n Queen MonAss    ❤   has renamed the chat to ‘Operation Spice Girls’ \n \n\nAjax Spray-n-Wipe\n\n\n what is this???\n\n \nQueen MonAss ❤\n\n Ive gathered some people to help with your little problem  \n\n\n Since it’s been 3 months…. and nothing has changed at ALL between you and your equally useless roommate  \n\n\n Except for these ‘platonic cuddles’ you told me about \n\n\n But since they’re APPARENTLY ‘platonic’ they dont count. \n\n\n So i thought getting some outside opinions would help move things along a little, yknow \n\n\n Dont worry, you can thank me later :* \n\n \n\nAjax Spray-n-Wipe\n\n\n wait  \n\n\n HANG ON \n\n\n NO \n\n\n MONA YOU #%$!’*\n\n \n\n❀ Guizhong Ballista ❀\n\n\n Don’t worry dear, we’ve got your back!! ;D \n\n \n\nAjax Spray-n-Wipe\n\n\n GUIZHONG?!?! \n\n\n YOU’RE IN ON THIS?? \n\n\n mona how did you get guizhong’s contact \n\n\n and why are two members of the student council in here as well??? \n\n \nQueen MonAss ❤\n\n Lets just say… i have connections. \n\n \n\nKeqing.\n\n\n Mona and I are dating. \n\n \nQueen MonAss ❤\n\n KEQING FUCK \n\n\n I WANTED TO LOOK COOL \n\n\n 💔💔💔 \n\n \n\nNingguang (Do not contact me outside of work hours)\n\n\n Keqing.  \n\n\n Did you drag me into this pointless chat just so I could generate clout for you? \n\n \n\nKeqing.\n\n\n … \n\n \n\nNingguang (Do not contact me outside of work hours)\n\n\n … \n\n \n\n❀ Guizhong Ballista ❀\n\n\n [Image Attachment] \n\n \n\nNingguang (Do not contact me outside of work hours)\n\n\n It’s fine. I will stay.  \n\n\n I’m interested to see how this turns out.  \n\n \n\nAjax Spray-n-Wipe\n\n\n okay but can i leave please \n\n \nQueen MonAss ❤\n\n No \n\n \n\nAjax Spray-n-Wipe\n\n\n worth a shot \n\n \nQueen MonAss ❤\n\n Okay now that everythings sorted and intros have been made, im handing the wheel to keqing \n\n \n\nKeqing. \n\n\n Thanks. I’ve already prepared a Google Doc detailing the potential courses of action Childe can take from this point. \n\n\n I’d appreciate it if everyone could take a look. \n\n\n [Link Attachment] \n\n\n WAIT SHIT \n\n\n WRONG LINK \n\n \n\nAjax Spray-n-Wipe\n\n\n too late \n\n\n um \n\n\n …….is this a fanfic \n\n\n of me and zhongli \n\n \n\n❀ Guizhong Ballista ❀\n\n\n Ooh I like that metaphor in the second paragraph \n\n \n\nGuest User #57386\n\n\n👍\n\n \n Keqing.    has left the chat. \n \nQueen MonAss ❤\n\n Err, ill reinvite her back later \n\n\n Heres the actual link since keqing shared it with me earlier \n\n\n [Link Attachment] \n\n \n\n❀ Guizhong Ballista ❀\n\n\n Last option seems like the best imo! \n\n \n\nNingguang (Do not contact me outside of work hours)\n\n\n I agree. \n\n \nQueen MonAss ❤\n\n But thats the most boring one \n\n \n\nNingguang (Do not contact me outside of work hours)\n\n\n Sometimes the simple solutions are the most effective. \n\n \n\nAjax Spray-n-Wipe\n\n\n I AM NOT DOING ANY OF THESE. \n\n\n i will actually get Evicted \n\n\n especially that sexy jazz idea. who proposed that \n\n \n\n❀ Guizhong Ballista ❀\n\n\n  I did!  \n\n \n\nAjax Spray-n-Wipe\n\n\n oh my god \n\n\n okay usually i am all for batshit dumb ideas but \n\n\n this just aint it \n\n\n why r you all acting as if zhongli isnt going to plain reject me on the spot \n\n \n\nGuest User #57386\n\n\n I'm sure he reciprocates your feelings, my dear. :-) \n\n \n\nAjax Spray-n-Wipe\n\n\n oh uh thanks i guess \n\n\n sorry but who r u \n\n \n\n❀ Guizhong Ballista ❀\n\n\n That’s Granny Ping! \n\n \n\nAjax Spray-n-Wipe\n\n\n what the fucm \n\n \nAjax Spray-n-Wipe has left the chat.\n \n \nChilde wakes up the next morning and warily eyes at his notifications—forty nine from Mona and Guizhong, plus another two hundred and fifty three from the Spice Girls after he got added back in (against his best wishes)—before flinging his phone to the other end of the bed. \nOut of sight, out of mind. He yawns, runs a hand through his messy hair, and peels himself out of bed.\nZhongli, as predicted, is already up and fully functional despite running only on mere dregs of sleep most nights. His grey dress shirt, reading glasses, and tied back hair all contribute to a professional air that’s much more suitable for a university professor rather than a student.\n“I had the strangest dream last night.” Childe rubs at his eyes as he walks out of his room with a white shirt in hand, wincing at the bright rays piercing into the apartment.\n“Pray tell.” Zhongli says while flicking through the morning newspaper like every other grandpa in the country. Childe grumbles and halfheartedly throws on the shirt, getting his head caught in the wrong hole in the process. The brunette flicks his eyes over onto his roommate’s abdomen before hiding the motion with a sip of tea.\n“It was like,” Childe scrunches up his face while he tries to glue together fragments of the dream, “Some fantasy world. We were in Liyue. But it wasn’t  Liyue Liyue, you know?”\nZhongli looks up from the paper, gaze hovering. “I… do not know.”\nChilde ignores him. “So I was some kind of assassin or agent or whatever from some foreign country, and you were, like. You ran funerals.”\n“I ran funerals.” Zhongli echoes, amusement lining his voice.\n“But you didn’t just run funerals and stuff,” Childe blabbers as he switches on the toaster and muffles a yawn. “You were actually the god of money. Which is ironic as fuck because the dream-you-but-god was  still  broke like hell and kept using  my money like the bourgeois parasite you are but you know I didn’t really mind because I love you and then I found out that for some reason Granny Ping was like a low level god and something happened and I got super angry so I summoned a giant sea monster and after it got defeated somehow you managed to send the entire world into deep economic recession.”\n“Wait.” Zhongli slowly closes the newspaper. “What did you say in the middle?”\nChilde looks up as he’s putting the bread into the toaster. “What? That Granny Ping was a god?”\n“No… before that.”\nChilde scrunches his face up again, the tendrils of sleep still holding his brain in a chokehold. “Don’t remember. Don’t you have, like, a photographic memory? Why are you asking me?”\n“The more appropriate term you are looking for is ‘eidetic memory’,” Zhongli tells him, “And you were speaking too fast, I didn’t catch what you said in the first place.”\n“Well, if you don’t remember and I don’t remember, then it’s clearly not that important,” Childe shrugs and gingerly takes the bread out of the appliance. Zhongli furrows his brows and lets out a little sigh, before he flips to the back of the newspaper to start his daily crossword puzzle.\n \n \nThe first real test of Childe’s dedication to the cause comes in the form of Zhongli, one afternoon, on the floor of the living room, clutching Roomba to his chest and staring back at him with eyes as wide as saucers.\n“Childe,” his voice wobbles, “I think Roomba is ill.”\nChilde stands rigid, one hand on the doorframe, the other between his heel and shoe, and blanks out. \nHis first thought:  oh my god, I need to call a vet.  \nHis second thought:  do vets accept roombas? \nHis third thought:  wait a fucking minute. \nThe circular machine in Zhongli’s arms sputters, whirs, and dies in a small puff of smoke. Zhongli looks like he’s two seconds away from shutting down in solidarity. Morax looks on smugly from the top of the fridge.\nChilde brings a hand to pinch his nose, ignoring the fact that it had just been in his shoe a second prior. “Zhongli.”\n“...Yes?”\n“Have you been feeding it human food… again?”\nZhongli blinks. “I thought it would be hungry after sweeping the floors. So I fed it fried chicken.”\nChilde snaps his head towards the box of Timmie Fried Chicken sitting on the counter. \n“Zhongli,” he says, secretly proud of how steady he’s managing to keep his voice. “Roombas ‘eat’ dust. They’re not supposed to eat TFC.”\nZhongli furrows his brows and hugs the vacuum cleaner closer to his chest. “The owner’s manual did not specify any dietary guidelines or requirements, so I thought—”\n“Sometimes you think wrong,” Childe groans, slumping his shoulders as he moves away from the doorway and slides his feet into a pair of slippers with practiced ease.\nZhongli frowns harder when Childe takes the dead Roomba out of his arms. “But last time when I fed it sunflower seeds, it seemed perfectly fine.”\nChilde cracks loose the dustbin, winces at the pungent smell of deep fried avians, and sighs. “I don’t know,” he replies, even though he knows perfectly why.\nZhongli stands up and peers over his shoulder, wrinkling his nose. “Will everything be okay?”\n“It’ll be fine. It just needs some… deep cleaning. I think we gotta go buy some extra strength dish detergent first.”\n“If I feed it a fried egg—”\n“Teyvat Fried Eggs are  not ‘good enough to revive the dead’. Zhongli, that cookbook lied to you.”\n \n \n“I will be out tonight.”\nChilde looks up from where he was immersed in his essay on the evolutionary history of sea cucumbers and its associated taxonomic complications. “Where to?”\n“A party. At a club,” Zhongli replies. Childe takes a moment to register what he just heard.\n“A party?” He rolls his wheely chair to the door of his room and pokes his head out to look at Zhongli. “You?”\nZhongli looks back at him with a slightly miffed expression. “Is that so out of the ordinary?”\n“Yes.”\n“...Okay. I will admit it is a little out of the ordinary—”\n“Zhongli,” Childe says seriously. “You are a literal social hermit. This is  way out of the ordinary. If it was a formal party, okay, but since you mentioned that it’s at a club, I feel nothing but worry. Do you even know what a shot is?”\n“Another term for vaccination.” Zhongli immediately replies, and Childe smacks his own forehead.\n“No! Well, I mean, yeah, but in this context it’s a small glass of alcohol.” Childe ruffles his hair as he stands up. “Anyways, you can’t go out clubbing looking like  that,” he says, pointing at Zhongli’s bespoke suit.\nThe older man looks down at himself, genuinely confused. “Why not?”\n“You just can’t.” Childe replies, already used to Zhongli’s lack of awareness of conventional societal codes after three months of exposure therapy. “Come here, I’ll give you something more appropriate.”\n \nTwenty minutes and two changes of clothes later, the intercom rings.\n“That would be Venti,” says Zhongli as Childe helps him paint on the last stroke of vermillion liquid eyeliner.\n“Hold still,” he mumbles, “‘Venti’ can wait for two more seconds… and… wait, and done.”\n“Thank you, Childe, I appreciate it,” Zhongli tells him warmly, bringing his hand up to hold the other man’s wrist. They lock eyes for a few seconds, noses almost touching from the proximity. “But I would have been fine with applying makeup on my own—”\nThe intercom rings again.\n \n“Wow,” whistles Venti at the doorway. “Contrary to my expectations, you actually don’t look like a grandpa this time.”\nZhongli crosses his arms, the cute frown crease between his eyebrows making another welcome appearance. “I assume I should be taking offense to that.”\n“Yeah. No offense and all but your taste in fashion is, like, the super middle-aged balding businessman type of fashion. The kind of style you see being worn in an issue of  Teyvat Property Investment Times.” Venti jests, squatting down to poke at the holes in Zhongli’s ripped jeans.\nChilde decides to jump in at that moment to save his roommate from any more humiliation from this little green gremlin. “Hey there kid, Venti, right? I’m Zhongli’s roommate.” \nHe hears Zhongli breathe a little sigh of relief, and mentally pats himself on the back.\nVenti shakes his hand with the force of a whirlwind. His laugh is bright and airy, like wind through a field in summer. “If I were a little less nice I would have smacked you for calling me a kid. Perhaps not unlike this gentleman next to you, whose temper he often has to keep under a lid!”\nChilde raises an eyebrow, “Zhongli? Angry? I don’t think it’s possible.”\nVenti shoots him a shit-eating grin. “Oh you don’t know? Once, I crashed over at his place drunk and puked over his new rug, then he proceeded to whoop my ass all the way back to—” he says, before getting wacked upside the head by the aforementioned asswhopper of local green drunkards.\nZhongli scowls. “That is  enough. I still cannot fathom why I associate myself with the likes of you when you have the gall to behave like this towards me.”\n“Because you love me!” Venti chirps, rubbing his head. “Plus, I’m your only other real friend besides Guizhong and Havria, and I guess also your boyfriend here—”\n “Boyfriend?” Childe splutters, “I’m not his boyfriend!”\n“Huh?” Venti squints at him. “You’re not? But you guys hang around each other on campus so much that everyone thought—” Zhongli smacks him again,  “—ow!” \n“We are leaving.”\n“Hey, hey wait! Gramps, you know my legs aren’t as long as yours—  oi!  Don’t close the elevator doors on me! Zhongli! You buffoon! Zhongliiiiii!!!” \nChilde slowly retreats back into the apartment, locks the door, and sighs.\nA quick glance at the clock tells him that it’s currently five in the afternoon. Oh. He didn’t ask Zhongli when he’d be back.\nWhat if it gets cold in the evening? Zhongli wasn’t wearing that much when he left—hell, what if he gets arthritis in the kneecaps from the ripped jeans? Can you even get arthritis from the cold? What if Zhongli catches a cold? He won’t be able to do his thesis that’s due, like, next week—\n“Fuck!” Childe yells, running his hands furiously through his hair. He has got to stop fretting over his  completely  capable,  very  adult, only  occasionally  vacant-brained roommate.\nSaid roommate can recite the entire Oxford Handbook of Clinical Medicine to the tune of Twinkle Twinkle Little Star from back to front even though he majors in  rocks, and here’s Childe, fussing over him like a big, orange mother hen.\nHis siblings’ cheeky grins flash through his mind. He sighs. Old habits sure do die hard.\n...\nHe turns around.\nThe apartment seems uncomfortably empty now. It’s a foreign feeling to him, who has lived pretty much his entire life around other people in the household, but now—\nSomething scratches at his leg.  “Meow.”  \n“...Hi, Morax.” He mumbles as he picks the cat off the floor, unexplainable emotions churning in his gut like a storm. “For some reason I really wanna punch something right now.”\nMorax replies with a wide-eyed stare.\nChilde sniffs as he walks both of them to the couch, flopping down onto it and holding the animal high into the air like Rafiki holding Simba. “Not you. I wouldn't dare to think about punching you. That’s a surefire way to get Zhongli to throw me into the core of the earth.”\nSea cucumbers be damned, Childe’s definitely not in the mood to finish his essay now. Instead, he turns on the TV and flicks through the channels, stopping on a rerun of an old episode of the Teletubbies because he’s in the mood for self-flagellation. But Morax seems to enjoy it well enough, so he throws the remote somewhere off to the side and resigns himself to being Morax’s sentient fur comb for the next few hours, the afternoon sun pouring its dying rays through the balcony door.\n...Zhongli’s got enough common sense to keep himself safe at a party and not drink or eat anything suspicious or weird, right?\n \n \n \nIn Childe’s defense, sea cucumbers were a very cumbersome, very soul-draining topic to research. Which is why he’s not exactly surprised to find himself waking up many hours later in the dead of the night, neck bent uncomfortably over the back of the couch.\nWhat he  is  surprised to find out is that there is, apparently, something—  someone shifting around near their kitchen, and Childe immediately recognises the silhouette as too large and hulking to be anywhere near Zhongli’s lithe figure. He quietly lifts Morax off his lap, careful not to wake him up.\nA thief?  Shit,  did he not lock the door? He swears he locked the door. He one hundred percent locked that fucking door. He remembers, because he had an existential crisis  right after doing so. \nChilde cringes every time his bare feet make a sound against the floor as he sneaks towards the light switch. God, why couldn’t he be more like Zhongli and wear his socks to sleep? This is gonna  kill him; the intruder is gonna hear his squeaky feet and turn around and they’re gonna have a gun and shoot him in the face and he’s gonna die of blood loss before he gets the chance to confess his undying love to the prettiest man on earth—\n “Aha!” Childe screams when he flicks the lights. The intruder freezes, about three centimetres away from banging their hip on the kitchen island.\nThey turn around. Childe registers a head of bright red hair, about fifteen belts wrapped around various parts of the body, the most intense scowl he’s ever seen, and… what looks like a dead body draped over his shoulder.\n“You live with him?” The redhead gruffs, gesturing at his inanimate human-shaped luggage and—oh, thank heavens, it’s just Zhongli, still alive (thankfully), dozed off and drooling all over this tall stranger’s fur trim coat.\n“Uh.” Childe’s brain stutters. “Yeah.” He gestures at his narwhal-patterned pajama bottoms. “I do.”\n“I’m Diluc,” the man introduces himself, his baby face somehow not at all detracting from his acute resting bitch face, “Venti’s friend and designated driver.”\n“Oh. I’m Childe. Uh, thanks for getting Zhongli home safely.” Childe says, relieved to hear that this wasn’t just some random citizen that found Zhongli passed out in the middle of the road and felt kind enough to bring him home using the details of Zhongli’s driver’s license, or something.\nChilde glances at the front door, then at the balcony, then back at Diluc. “How did you get in?”\n“I used to pick locks for a living.” Diluc replies ominously. Childe isn’t sure he wants to get too involved with a guy who looks like he shops at Hot Topic and probably commits felonies for fun, so he doesn’t ask any further. It’s not like he himself didn’t do stupid and arguably illegal things in his teen years, but he’s eager to leave that all behind him now.\n“...Okay.” He coughs. “Well, uh, you can put Zhongli down in his room. The door to your left.”\n“Thanks.” Diluc says, before fading into the darkness. Childe shuffles in after him, groping against the wall before flicking the lights on.\nHe stares. Now that he thinks about it, he’s never actually been in Zhongli’s room, even if Zhongli has invaded Childe’s room countless times simply because the mortal concept of personal privacy is completely lost on the older man. As Diluc deposits Zhongli’s sleeping form onto the bed, Childe takes the opportunity to look around. \nThere’s a giant bookshelf standing against the side wall with all kinds of dictionaries, encyclopedias, textbooks, and a few sci-fi novels arranged neatly along it’s shelves. The desk is tidy and ergonomic; stationary arranged into metal organisers, and loose sheets of paper filed into desktop drawers. A small dragon paperweight sits in the corner, its eyes carved from amber. The walls are free from posters, save for a giant world map stuck right above the desk. He’s not sure what he was expecting, given that he’s never really thought about it, but the space is definitely a lot neater than he thought it would be. \nIt’s very… Childe doesn’t know how to describe it, other than the fact that it’s very  Zhongli. Very meticulously laid out, very efficient, but also looking more fit for a late-forties office worker than a mid-twenties university student. \n“You know what to do when he wakes up, right?” Diluc asks him in that flat voice of his, raising his hand to list off; “a bucket to puke in, glass of water, painkillers, a cold shower—”\n“Okay, okay, I get it!” Childe exclaims, since he’s admittedly gotten hung over enough times in high school to know how to treat the same ailment in someone else. “How much did he even drink?”\nDiluc’s face is absolutely unimpressed. “A lot,” he says, somehow both helpful and unhelpful at the same time. “Definitely not an amount that a president of the student council should be drinking.”\nChilde winces a bit, rubs his head, and escorts Diluc back out to the living room. “I see. Anyways, thanks again for dropping him off, I owe you one.”\n“No,  Venti owes me one.” Diluc bristles, before he pauses and stares in the direction of the couch, pointing at a snoring brown lump. “Is that your cat?”\n“Morax? Yeah, he is.”\n“No way,” Diluc whips his black phone out from his black coat pocket with hands encased in black gloves. This guy sure has an exciting wardrobe. “Is this also your cat?”\nChilde squints at the bright screen. It’s an Instagram account… a cat account, to be more precise. Featuring a brown cat that looks  extremely  familiar. The username  ‘moraxgodofwar’ is sprawled across the top of the screen.\n“No way,” Childe echoes distantly, “is that our cat?”\n“Your cat’s famous. Look, one million followers.”\nChilde’s jaw promptly drops to the ground. He can’t believe that Zhongli made an instagram account for  Morax  before he made one for  himself. \n \n \n \nAfter swapping contacts with Diluc and agreeing to send him occasional cat pics as payment for Zhongli’s ride home, Childe closes the door, triple checking the locks before quietly making his way back into Zhongli’s room.\nZhongli is awake now, but barely. His eyes are glazed over, cheeks are still flushed, and he almost knocks his glasses from the bedside table when he tries to prop himself up.\n“Childe…” Zhongli slurs, and  Childe is the one that almost trips and faceplants onto the floor despite being the more sober of the two.\n“H-hey,” he takes the older man’s hand. It’s warm and pale and smooth and he cuts that train of thought before it can go any further, “I’m here. Are you feeling okay?”\n“Mmh…” Zhongli closes his eyes, drunken flush still visible under the dim light pouring in from the kitchen, “Come... closer.”\n“Wh—” is all Childe manages to get out before he’s dragged onto the bed, mouth open in shock as Zhongli flips them with an very undrunkern amount of strength so that Childe is lying with his back against the sheets and Zhongli has his head between Childe’s legs—\nHoly shit.\nZhongli’s head is between Childe’s legs. And Childe is going to pass directly the fuck away.\n“I want,” Zhongli mumbles, leaning his head against the inside of the other man’s thigh as he drags Childe’s pants down, “you.”\nOh, gods.\n“Zhongli... hold on, hold on, you’re drunk—” Childe shrieks, half kicking Zhongli when the latter nuzzles his lips against his (unfortunately) rapidly hardening length, breath hot and wet and seeping through Childe’s boxers. \nZhongli pauses, looks up at him with wide eyes. His voice is rough, low. “...Do you not want this?”\nChilde stops kicking. He stares back, his brain running on pure adrenaline and his heart battering against his chest. It’s the sexiest thing he’s ever seen.\n“I do.” He says weakly, plastering a smile on his face that probably looks more like a grimace instead. “But not like— ah!  Hey, wait a minute—”\nZhongli clumsily tugs Childe’s boxers all the way down, eyes slitted and hungry and misty as he laps at Childe’s dick with unbelievable desperation, soft breaths dripping from his lips and sending electrifying jolts through Childe’s body.\nChilde’s elbows give up from under him as he sinks into the sheets, his dick harder than it’s probably ever been in his life. He lets out a few choice Snezhnayan cusses from under his breath, sees Mona’s smug face flash through his mind, flips off the stars above, and prepares to dive headfirst into the feeling of plush lips, slick saliva, and scorchingly raw gazes.\n \n \nChilde wakes to the smell of cooking.\nHe groans. Rolls over, flattening his face into the blankets. His head is pounding a little, and his mouth feels like it’s cultivating an entirely new species. \nNormally, he would be up as soon as he’s awake… but today, he really, really feels like sleeping in until…\n...\nHang on. \nChilde’s eyes snap wide open. He pushes himself up from the bed. \nShit.\nZhongli’s bed. He’s still in Zhongli’s bed. His pants are nowhere to be seen, but at least his boxers are back on. Memories of the night prior burst into his head with the intensity of bulldozer on crack.\nHe barely stops himself from punching a hole in the wall when he thinks about how much it would cost to get it fixed. \nChilde proceeds to stumble to the door, greeted by the sight of Zhongli in the kitchen, wearing what at this point is basically Childe’s apron, using Childe’s ladle, cooking with Childe’s pot, and just in general taking over Childe’s domain of the house—because Zhongli is the type of person to write an essay for a whole two days and completely forget to eat until he hits the fifty-thousand word mark where he would then proceed to pass out from nutritional deficiency, so of course Childe immediately had to assume ownership of the kitchen so that he can enforce some semblance of order into his roommate’s disastrous lifestyle.\n“Um.” Childe says eloquently. “Morning.”\nThe brunette turns around, his face clean from yesterday’s makeup and his hair tied up high behind his head. His bangs are clipped back to show his forehead. “Good morning, Childe.”\nHe’s so handsome. It’s not fair. \nChilde is going to explode like a Polycarpa mytiligera any second now and vanish into the depths of the Mariana Trench like a single-use plastic bag. He has the faintest urge to defenestrate himself directly from their fifth floor balcony, but Granny Ping probably wouldn’t appreciate having to scrape his mangled body out of her flowerbeds, so instead, he asks, “what time is it?”\nZhongli turns back around to stir whatever he’s cooking, barely maintaining a semblance of order in the atmosphere. “You slept past noon.”\nChilde’s five seconds away from freaking out over missing his classes before Zhongli adds on, “today is Saturday.”\n“...Oh, thank god.”\nThe older man gestures to him to sit down at the table before he serves lunch for the both of them—the first time this has happened ever since Childe came to Liyue. \n“Looks good,” Childe points out, already succumbing to the hunger pangs in his stomach and stabbing his fork into the biggest piece of meat in the bowl as he rests his chin on his palm, the issue of what happened last night temporarily forgotten, “what’s it called?”\n“Bamboo shoot soup,” Zhongli tells him, settling into his own seat at the table, still wearing Childe’s Doraemon apron. “It is rather simple to make; four slices of the highest quality butt ham, first boiled to remove the surface blood, then stewed together with Qingce canned bamboo shoots, soy sauce, sesame oil, two eggs…”\nChilde zones out as he eats, his eyes drifting down to settle on Zhongli’s bright eyes, focused as he recites each cooking step in immaculate detail, then down his straight, thin nose, then his red, red lips, before a vision of those same lips wrapping around his dick like a vice flashes in front of his eyes and his chin suddenly slides off his palm. “Ah!”\n“Childe?” \n“Zhongli,” Childe says, feeling a raging blush creep up his neck as he slams his hands onto the table. “We need to talk.”\n“About?”\n“Last night.”\nZhongli’s chopsticks pause midair, a piece of cloud ear fungus dangling precariously from its tips. \nHe stares at Childe. \nChilde stares back. \nNeither of them say anything. The piece of fungus drops into the soup below. \nChilde’s beginning to think that Zhongli’s doing this on purpose for maximum psychological fuckery. The older man is usually quite expressive with his feelings despite his rock-steady stoicness—either outright vocalising his thoughts or using small bits of body language to convey hidden emotions, but when Zhongli’s making himself intentionally hard to read, it’s like trying to extract meaning from a grassy hill.\nThe other man finally opens his mouth right when Childe hits the brink of insanity. \n“...What happened last night?”\nChilde proceeds to dunk his entire head into his bowl of soup.\n \n \n“I can’t do this anymore,” Childe sobs, falling onto his knees while clawing at Guizhong’s blouse sleeve. He had taken the fastest train to Guili District he could find after lunch (and a shower to wash out the bits of pork from his hair), after mumbling a half-assed excuse and then slamming the door so hard that Morax let out an unholy yowl.  “Please Guizhong. Please evict me.”\nGuizhong puts her hands on her hips, completely oblivious to the way passersby are staring at them and wondering why this woman has a grown man bawling on his knees at her feet. “I am  not evicting you. I don't even own the place anymore!”\n“Please!” Childe tries again, hysterical, before Guizhong grabs him by the collar and hauls him up as easily as if he were a kitten.\n“I have no idea what happened between you two,” she tells him, dragging him along by the arm to the station exit, “But we are going to talk this out, and you and Zhongli are going to make it up to each other,” she says firmly, before grumbling, “And hopefully make out with each other while you’re at it.”\n \n \n \n“...So you two finally got some action going on,” Guizhong summarises, and Childe nods, sinking deeper into Guizhong’s plush leather sofa, “And now you’re  unhappy about that?”\n“Yes.” He grumbles, wondering how far he needs to shrink into himself until he can become one with the furniture.\nGuizhong squints at him. “Why?”\nChilde takes a deep breath. “Well, Zhongli got invited to this party by a little green gremlin and he doesn’t know jack shit about dressing for parties so I lent him a pair of my jeans that makes his ass look really hot and resigned myself to being the resident cat dad for the evening but later this dude picked the lock to our place to drop a really drunk Zhongli off and aforementioned drunk Zhongli then proceeded to pull down my pants and suck my dick but I don’t just want him to suck my dick I want him to hold my hands but Zhongli would probably rather hold hands with his thesis on the Daedalia Planum lava flows on Mars than me so I guess my only remaining option is to commit sudoku.”\nGuizhong stares.\n“You mean ‘seppuku’?”\n“...I said what I said.\"\n“Okay.” She says slowly. “But before you commit death by sudoku, have you asked  Zhongli what he thinks about the situation yet?”\n“I tried,” Childe buries his head in his hands, “But he doesn’t even remember what happened.”\nHe can’t even see anything other than the black behind his eyelids, but he can  feel the way the Guizhong winces.\n“Childe,” she starts, “I’m sorry.”\nChilde groans. “Don’t be. It’s not even your fault—if anything, it’s mine. I should have stopped it.\" He flops backwards, staring at the ceiling.\n“He may have forgotten,” Guizhong says, looking unusually solemn, “But that doesn’t mean he doesn’t return your feelings.”\nIf Childe stares hard enough, maybe he could burn a hole in the ceiling. “How can you sound so sure?”\nGuizhong’s lips pull upwards as she grasps Childe’s hands. The man flinches, before he settles into reciprocating the hold. “Call it a woman’s intuition.”\n“Intuition?”\nGuizhong laughs softly, “That, and the fact that Zhongli talks about you in every second text that he sends me must mean  something.” \nChilde blinks owlishly. “What does he say?”\nA sly grin. “Where’s the fun in that if I tell you? Come on now,” she says, “I think it’s about time we push Zhongli outside his comfort zone a bit.”\n“Dicksucking doesn’t count?”\n“Dicksucking doesn’t count.”\n \n \n\nOperation Spice Girls\n\n \n\n❀ Guizhong Ballista ❀\n\n\n And apparently that’s what happened! \n\n \n\nKeqing. \n\n\n What the fuck. \n\n \nQueen MonAss ❤\n\n I agree, what the fuck \n\n \n\nNingguang (Do not contact me outside of work hours)\n\n\n Lmao. \n\n \n\nAjax Spray-n-Wipe\n\n\n guys its not funny \n\n\n [Image Attachment] \n\n\n [Image Attachment] \n\n\n [Image Attachment] \n\n \nQueen MonAss ❤\n\n Okay we get it ure sad that ure blueballing yourself over him \n\n\nBut spamming gordon ramsay reaction images isn't going to make it better\n\n \n\nKeqing. \n\n\n How… did it feel? \n\n \nQueen MonAss ❤\n\n Keq ily but pls stop trying to take notes for ur fanfic \n\n \n\nKeqing. \n\n\n I’M ONLY ASKING FOR  \n\n\n SCIENTIFIC RESEARCH. \n\n \n\nNingguang (Do not contact me outside of work hours)\n\n\n So I take it we need a new plan. \n\n \n\nAjax Spray-n-Wipe\n\n\n we never had a plan to begin with \n\n \nQueen MonAss ❤\n\n Any ideas? \n\n \n\nNingguang (Do not contact me outside of work hours)\n\n\n I may have one. \n\n\n Give me some time. \n\n\n\n\n\n \nOne week later finds Childe in the uni gym beating the shit out of the poor punching bags. So far, he’s already snapped two bags from the hinge and punched apart the seams of another, but he’ll just pay for them later. You know, no big deal. Haha.\n“Hey,” someone calls to him off towards the side, and Childe only pauses momentarily from his vicious onslaught of violence towards insentient bags of sand to take in the tall stranger’s one eye, black hair and slight smirk before he resumes throwing hands.\n“Who’re you?” he grunts, a trickle of sweat dripping down his temples.\nIn all honesty, he’s not in the mood to talk. Even after Guizhong’s little pep talk, he nevertheless ended up walking on eggshells for the past week, his internal turmoil and embarrassment compounded by Zhongli giving him his best sad puppy eyes (which, really, was just a more intense stare than usual),  Venti  of all people somehow finding out about the ordeal and proceeding to pester Diluc to pester Childe for details, and Childe waking up with a boner and fleeting memories of  red lips red eyeliner golden eyes every. Single. Morning. \nSo it’s understandable that he’d be pissed, especially since he’d also handed in his essay a day late thanks to spending excessive amounts of time stewing in his own emotional ineptness. But that’s mostly a fault on his own part.\n“Name’s Beidou,” the tall woman replies, unfazed by Childe’s hardheadedness. “You’re friends with Ningguang, right?”\n That gets Childe’s attention, albeit he still doesn’t stop punching. “Dunno if ‘friends’ is accurate here, we’re more like acquaintances by circumstance.”\nBeidou laughs, deep and jolly. “Fancy words, I like it. Anyways, I’m Ningguang’s girlfriend.”\nA groan. “I’m assuming she told you about my trainwreck of a love life.”\nBeidou rolls her one eye affectionately. “Oh, she yaps about it nonstop. Thinks it’s the next best thing after the ending to Game of Thrones.”\nChilde finally stops punching, confused. “But the Game of Thrones ending was shit.”\n“She liked seeing the Twitter dumpster fire that came along with it.”\n“Ningguang is weird,” he declares with finality, ripping the velcro of his gloves to free his hands and wiping the sweat off his forehead. \nBeidou shrugs. “Well, she’s  my weird girlfriend.” \nAfter watching Childe take off his other glove, she asks, “Hey, wanna arm wrestle?”\nChilde looks at her, adrenaline still pumping through his veins. “Sure.”\n \nEight losses and a sprained wrist later, Childe is seriously reevaluating his manhood.\n \n \n\nBAEdou, Ajax Spray-n-Wipe\n\n \n\n11:36pm\n\n\n so you're really not gonna tell me what ningguang is plotting?? \n\n \n\n11:42pm\n\n\n Nope \n\n\n Swearing secrecy to her nefarious plans was part of the small print when i got together w/ her ;)\n\n \n\n11:45pm\n\n\n gee, real helpful\n\n\n anyways when r u gonna be at the gym next? i still want a rematch \n\n \n\n11:48pm\n\n\n Hahahaha get that wrist sorted out first! \n\n\n Dont wanna give u a disability for life ;D \n\n \n\n11:49pm\n\n\n i have 2 hands! \n\n \n\n11:51pm\n\n\n Unless ya plan on using your foot, i suggest you keep one to hold your roomie’s hand lol \n\n \n \nThe next day, in which Zhongli is at the university running a supplementary tutoring class and Childe is at home procrastinating his presentation on the mating habits of sperm whales, the intercom rings unexpectedly.\nWhen Childe goes to pick it up, the mysterious visitor introduces herself shyly as Havria, and he instantly recognises her as the last missing piece to the Guizhong-Zhongli-Havria disaster childhood trio. He lets her up the elevator after she tells him she’s here to drop off some things for Zhongli.\n \n“So, Childe, tell me about yourself,” Havria smiles, her features round and innocent, and Childe vaguely feels like he’s acquainting himself with a future in-law. “Do you work?”\nHe pauses. He actually doesn’t—his parents are covering all his expenses, admittedly. But that indistinct in-law-interaction feeling is still there, and Childe doesn’t want to lose face… even if he’s pretty sure that Havria’s not going to think any less of him if he just told her at face-value.\n“I’m…” Childe pauses, his eyes landing on a blob of brown fur in the corner of the room, “a cat walker.”\nHavria claps her hands together, completely missing the point. “I  knew you looked like a model from the moment I saw you!”\nChilde gives her a lopsided grin, neither affirming nor denying Havria’s conclusion. He takes in Havria’s delighted laugh, the soft contours of her face, the… oh. \nHe can’t help but notice—\n“Are you curious about my eye?” She smiles at him, her voice dulcet and rippling, like calm ocean waves. Her glass eye looks natural enough from afar, and it does nothing to detract from her gentle, ethereal aura.\n“A bit,” Childe admits, scratching at his cheek. \nHe thinks about Beidou, in all of her bulging biceps, fierce grin kind of glory, and then he thinks about Kaeya—the captain of the fencing club he sometimes attends—with his sly smirk and flawless coin flips, and wonders if Havria could also pull off the same sexy pirate look that seems to go so well with the lack of depth perception. Probably not. \nHe helps Havria place her numerous shopping bags onto the counter of their kitchen island, and while Havria unpacks the contents, she explains ruefully, “It’s a reminder of all my past mistakes. I’m lucky to have only lost an eye from it.”\nChilde bites his lip, almost opens his mouth to tell her that he won’t pry for details, that it’s okay to not tell him. But Havria continues on, taking out a bundle of fresh Jueyun chilis and placing it in the fruit bowl. “A long time ago, I got involved in… an incident, of sorts, and my frivolous life was placed in danger by people I thought I could trust,” she smiles, her voice wispy and far away. \nChilde doesn’t say anything, simply standing there after most of the groceries have been located to their rightful places. \n“But Zhongli was the one to pull me out, to convince me that self-destruction and sacrifice for those people wasn’t worth it,” a small grin, “He and Guizhong even beat a few of them black and blue…. this eye,” she pauses, “is a remnant of our darkest days.”\nChilde stills, somehow feeling as if he is suddenly intruding on something very private between Guizhong, Zhongli, and Havria. Something that shouldn’t be so easily unearthed—especially not for an outsider like him. \nHavria looks fixedly at him for a few seconds before her gaze drops down. She points at the bag of salt he holds in his hands. “Uniodized sea salt from the salt plains of Guyun. Zhongli’s favourite.”\nChilde blinks. He didn’t think it was possible for someone to have a favourite  salt,  but his roommate is already unconventional enough that nothing really phases him anymore. Then, the realisation that Childe doesn’t actually  know anything about Zhongli at all, apart from having an inclination towards the traditional and intricate, hits him almost like a punch in the gut.\nHe swallows the lump in his throat. “You came all the way from…”\n“Sal Terrae.”\n“...Sal Terrae, just to bring him groceries, and a bag of salt?”\n“It’s the least I can do,” Havria laughs softly, “Zhongli used to always forget to buy groceries, and Guizhong was so busy with her internship that she often slept in her office. I couldn’t sit around and watch that man starve himself, so it became a habit to shop for him as well.”\nChilde suppresses a snort, trying his best to ignore the sinking feeling in his gut (because how is  he supposed to slot himself into Zhongli’s life when everyone else around him has already been able to find their place long ago?), “I understand. He’s definitely a handful sometimes.”\nThey end up moving to talk on the couch, joined by Morax purring contentedly in Havria’s lap while the pale-haired woman gently runs her fingers through long, brown fur. \n“I heard you like Zhongli.” Havria says suddenly.\nChilde chokes. \n“Guizhong told you, didn’t she?” he grumbles halfheartedly, making a mental note to berate the Spice Girls chat later— especially  Ningguang and Guizhong—for saying  too much.  Havria smiles at him, and that’s all the confirmation he needs.\n“Guizhong is wise beyond her years, but keeping secrets was never her forte,” she continues. “Rest assured, I know she respects you enough to not tell anyone else about it.”\nChilde stares at Morax, not wanting to meet Havria’s gentle, yet seemingly omniscient gaze. “Is trying to play matchmaker also a sign of her respect?”\n“It—” Havria starts, but the sound of the front door opening causes them to both turn their heads to see Zhongli toeing off his shoes at the entrance.\n“I’m home…” he looks up, golden eyes widening at the sight of their guest. “Havria?”\nHavria’s face blossoms into a brilliant smile, one that could rival Liyue’s nighttime cityscape. “Zhongli,” she greets, standing up.\nChilde watches, stiff, as the two embrace. He stares at the way all the tension drains from Zhongli’s shoulders, the way his eyes light up with joy. He looks so  happy, and Childe sourly wonders if he’ll ever be able to see this kind of radiance directed at him instead. But he’s not mad at Zhongli. He’s not even mad at Havria. He knows that what he’s feeling is nothing but a result of his own selfishness.\n“I have not heard from you in months.” Zhongli mumbles into the shorter woman’s shoulder. “I’ve been so worried.”\n“I’m moving back to Fontaine.” Havria says suddenly. Zhongli pulls himself back, and his face falls like a meteorite impacting upon the earth. “This is the last time I’ll see you in a while.”\n“Fontaine?” The older man’s voice wavers.\nShe nods. “My mother is ill. I’m going back to look after her.”\n“...Oh.” The taller man somehow manages to look absolutely heartbroken with the bare minimum amount of facial expression.\n“Don’t be upset,” the younger woman laughs reassuringly, “I’ll fly back to see you and Guizhong whenever I can.” \n“I am not upset.” Zhongli deadpans, evidently upset. “I simply worry that you may disappear again, just as you did… back then.”\nHavria gently takes his hands, her touch soft like the cresting waves of a low tide. “That was all in the past—I have grown wiser now, and you have as well. It’s time to let go. Let some new people into your life.” She glances at Childe. “You know that Guizhong and I won’t be around to coddle you forever.”\nZhongli looks down sadly at their intertwined fingers, “I know.”\n \n \n \nThey say their goodbyes after that, with Zhongli promising to see Havria off the airport on the day of her departure. After she leaves, Childe ushers a listless Zhongli to the kitchen and shoves a tub of discounted Ben and Jerry’s ice cream and a spoon into his hands, the awkwardness of the last week completely dissipated in the face of Zhongli’s quiet melancholy.\n“Childe,” Zhongli says softly, albeit suddenly, standing next to the kitchen island with his eyes downcast, “can I tell you something?”\nThe younger man squeezes Zhongli’s shoulder reassuringly. “You can tell me anything you want. Always. But maybe we shouldn’t have this heart-to-heart in the kitchen of all places.”\nAfter refilling Morax’s food bowl and relocating to the couch, Zhongli speaks up again. “Has Guizhong told you much about our childhood?”\n“Guizhong? No, not really,” Childe replies while flicking through the channels, trying to act casual about the topic but probably failing quite badly on that front. Not that Zhongli notices. “All I know is that you were a kickass little fighter in your prime years,” he grins.\nZhongli chuckles, holding a hand up to his mouth. “Maybe. Perhaps I’ve gotten rusty over the years, now that I think about it.”\nA good-natured laugh. “I’m always up for a spar if you want. My bones haven’t gotten quite as old as yours just yet.”\n“I’ll have to turn down your offer, regrettably,” Zhongli smiles, tearing the seal off the top of his ice cream tub. “Let’s watch this one,” he says.\n“It’s always NatGeo,” Childe groans while setting down the remote. “Anything for you though.”\nHe settles back into a comfortable position, willing to wait until Zhongli gathers his thoughts enough to share them—or not share them, either is fine.\nIt only hits him now that this might have been what he wanted all along; the warmth of the body next to his, the waking city lights, the waning evening glow. In the midst of all the hustling days that flow right past his eyes, it’s moments like this that seem to stretch out forever. \n“Guizhong and I met Havria when we were eight years old,’ Zhongli begins. “Can you imagine being two little children with just the clothes on their backs, holding slingshots, and accidentally hitting the only daughter of a respected politician?” He laughs. “Quite amusing to think about, in retrospect.”\nThat takes Childe by surprise. “You mean, she was—?”\n“Quite different from us, really.” Zhongli says. “But the three of us became friends soon regardless, and she would always visit us in the Plains and bring us gifts, while we could only offer our hospitality.”\n \n(“Havria,” Zhongli poked the other girl and stared at her with innocent, questioning eyes, “Are you  really sure  that you want to be friends with us? I know that you’re from the city, and that the people there don’t exactly—ouch!”\n“Hey!” Guizhong yelled as she pinched her best friend’s ear, earning a few yelps of pain. “That’s not something you just say to your friends, you know! What if it hurts her feelings! Doofus!”\n“Guizhong, don’t do that—ow, ow… that hurts!”\nHavria laughed at the scene in front of her, her frilly white frock a stark contrast from the dry landscape of the Plains. A sudden breeze caused dust to be caught in her neat, long hair, and yet she didn’t seem to mind at all.\nEven with Havria’s bodyguards waiting just around the corner and the brutal rays of a midday sun bearing down on them, her smile seemed so naturally radiant that Zhongli looked away in fear of blinding himself. \n“I’ve… always had trouble making friends because of my dad’s status,” Havria confessed shyly, her cheeks flushed with happiness. “So I’m very happy to have met you two.”\n“We don’t care about your fancy parents or fame!” Guizhong jumped away from Zhongli to grab the shorter girl’s hands. “We like you because you’re  you!” \nZhongli rubbed his ear and nodded as well. The flat expression on his face belied the sincerity in his eyes. “Yeah. If you ever need anything, we’ll always be here for you.”\n“Promise?”\n“Promise.”\n“Promise!”)\n \n“It was only a few months after that when her father was assassinated,” Zhongli says plainly, and Childe winces from the whiplash. “Allegedly, he made a lot of enemies through acts of corruption. Havria and her mother sought refuge in the Plains for years, before Havria moved with us to Liyue Harbour, and her mother flew back to Fontaine.”\n“That,” Childe pauses, picking carefully at his words. “That’s pretty wild. I wasn’t expecting that.”\n“I don’t think any of us did.” Zhongli says wistfully, a faint smile tugging at his lips. “But even though the three of us went through our fair share of hardships, sometimes I can’t help but feel nostalgic about the past. Everyone seems so eager to move on into the next chapter of their life, and yet some nights I still dream of when we all laughed together under that harsh, rural sun. Is that… is that wrong?”\n“No,” Childe replies immediately, his eyes glued to the television showing a chimpanzee trying to fit a whole grapefruit in its mouth. “I don’t think it’s wrong, but…”\n“But?”\nChilde turns his head. Zhongli looks back at him with half his face illuminated by harsh, artificial light, mouth set into a thin line. Under the rigid lines of his face lies a storm of uncertainty—and in the middle of it all, is just a boy who has yet to find a purpose beyond simply protecting the ones he holds dear.\n“Well. Are you happy now?” he asks softly. \n“Yes.” Zhongli whispers back. The worry across his face breaks apart like sheets of ice welcoming new cracks, and it’s mesmerising in a way Childe never thought could be. “I wouldn’t trade the happiness I have now for anything in the world.”\nSomething glints in his eyes, bright in a way that makes Childe think there’s more to those words than he thinks. “You’re right. I should be grateful. Guizhong and Havria live better lives now, times are peaceful now, but more importantly… you are here too.”\nFeeling a strange heat bloom across his cheeks, Childe quickly looks away, suddenly feeling very hot under the collar. \n“Okay,” he says. “Let’s… let’s stop there. Uh, hm, you know what always helps in times like this?” he says, pulling his phone out hastily.\nZhongli stares at him. “What?”\n“…Some good ol’ retail therapy!” Childe grins, heart swelling at the sight of his roommate perking up with interest.\nThey spend the rest of the evening on the couch browsing Amazon for new cat slippers (to replace the pair Zhongli had worn a hole into), stupid little antiques to add to their ever-growing collection around the house (Childe adds a tiny acrylic Waldo figurine into the cart when the other isn’t looking), and miniature Christmas hats they could put on Roomba and Morax (even though Christmas is still more than six months away). \nWhen Zhongli dozes off leaning against Childe’s shoulder with a dragon-patterned blanket wrapped around his shoulders, Childe gently pulls the spoon from his mouth, the molten ice cream from his hands, snuggles in next to him with a blanket of his own, breath caressing the dark-haired man’s cheeks, and thinks that just maybe, the two of them, simply staying like this... \n(This is okay, too.)\n \n \n“Why’d you leave the group chat  again?” Mona interrogates him in the library a few days later, catching him in a merciless headlock that contradicts her delicate stature.\n “Hrrgk,  Mona—” he wheezes, clawing at her rock-solid grip, “I’m  choking—”\nMona releases her steely hold with a  harrumph, and Childe wheezes overdramatically before flopping onto the table face down like a beached whale, fake-gasping for air.\n“Talk.” She instructs, crossing her arms and furrowing her brows.\nChilde winces as he pushes himself up and rubs at his neck. “I don’t think this whole thing is gonna work out.”\nMona looks at him as if he had just declared that the earth is flat and the entire night sky is just an elaborate hoax. “The hell? Of course it’s gonna work out. We just need to—”\n“No,” he interrupts her, uncharacteristically twiddling his thumbs, “I… I just don’t know what I’ll do if this all fails in the end.”\nMona goes silent, before she slides into the seat opposite of him, digging her elbows into the table. Her eyes are softer now, silver upon baby blue hues wide open with concern. “What’s going on? This isn’t like you.”\nChilde laughs. The sound comes out a little scratchy, like an old record. “What do you mean, this isn’t like me?”\n“You’re not the type of guy to back down from a challenge.” Mona points out. “So what gives this time? Why are you scared?”\nChilde stares at his thumbs, eyes tracing a faint scar zigzagging from his second knuckle to the wrist. “I dunno, Mona. I’ve had flings and stuff in the past but… I’ve never really felt anything like this before. I don’t want to fuck this up—this, whatever we have right now. I’m happy with it.”\n(Because it’s not that he doesn’t know what  love  feels like—sure, Childe has had plenty of tastes of the enticing possibilities that a significant other can bring… but Zhongli is different. Zhongli is opaque,  unconventional in comparison to all the other partners Childe has known, to the point where it makes Childe feels like he wears his heart on his sleeve, simply because it always feels like Zhongli can see right through Childe, even if Childe can’t read him back.\nAnd it’s so easy for Childe to simultaneously love him like family—like the unconditional love he gives towards his own siblings—whilst still yearn for something a little  more. But it’s hard to tell if Zhongli feels anything in return, and of the few things that Childe likes to play it safe with in his life, love is, surprisingly, one of them.)\nThe hobbyist astrologist wrinkles her nose. “Who says they can’t? Not with  that attitude.”\n“Have you been reading too many of Keqing’s fanfics?” he teases, and rightfully gets whacked on the head for it with a thick book. \"Ow!\"\n“‘Ow’ is  right, you lonely, pining nerd,” Mona huffs. “This is just sad. Seeing you and him practically being an old married couple in all but name. You cook for him, clean for him, study with him, raise a cat with him—”\n“But  what else  am I meant to  do?”  Childe runs a hand through his messy hair and resists the urge to shriek, “I’m literally his roommate by contract! It’s in big black bold print on a big white piece of dead tree skin! And he’s kind of a disaster sometimes too you know, like, I can’t  not sit by the side and just… watch his life fall apart. Hence the cooking and cleaning and drying and—”\nMona slaps her hand on the table, her eyes alight in a way that Childe has never seen before. “So you’re letting your feelings be dictated by a few lines of text? Huh? What kind of excuse is this? Just because we know that the night sky is nothing more than a few billion balls of gas sitting in a dead vacuum of nothingness, does that stop us from giving each star a name? A story? A happy ending that we all hope to see reflected in ourselves?”\nChilde shrinks down into his seat, his eyes looking over to the students who are walking by and shooting them curious glances.\nMona lets out a suffering sigh that deflates her like a balloon, and slides back to her side of the table. She flips open the book that she used to murder a few of Childe’s brain cells with five minutes ago, and beckons the other to shuffle closer. “Let me show you something… See this?”\nChilde peers over to look at the page. It’s an astrology compendium, full of neat diagrams and visuals and thus perfect for an ignorant cretin like him. He frowns. “See what?”\n“This,” Mona traces a neatly manicured finger along the lines of one particular diagram of a constellation and smiles, as if she were gazing at an old friend, “is the Monoceros Caeli, a faint constellation only visible on certain nights.” \nChilde skims his eyes across the page, skipping from its discovery to a list of its major stars, to a very blurry, very dubious picture of what is labelled as the ‘fox fur nebula’. The photograph of the Monoceros Caeli itself is clear; a methodically labelled diagram of a set of bright stars, arranged in a curving triangular shape, reminiscent of a graceful creature of the seas.\n“And this,” Mona flips a few pages forward, navigating through the text almost as easily as if it were the back of her hand, “is the Lapis Dei, a more rigid celestial arrangement that carries auspicious fortune in Liyuen culture due to the fact that it can be visibly seen once a year.” This time, she draws his attention to a distinctly diamond-shaped constellation, unyielding and faultless.\n“Uh-huh.”\n“And here’s the interesting thing;” she explains. “Once every six thousand years or so, thanks to the rotation of the Milky Way aligning with the axial tilt and orbital position of the earth, the Monoceros Caeli and Lapis Dei will align in the sky to create an entirely different constellation that has only ever been observed once in the Bronze Age.”\n“Okay,” Childe nods slowly, mildly interested. “But why are you telling me this?”\n“Well,” Mona continues, circling her finger in the air, “Back during the Fontainian Renaissance, there arose a belief that the astrological configurations you were born under would determine your fate. It was through this emerging belief that astrology made its way into the mainstream arts like theatre, as more and more people began exploring the connection of the human psyche with the celestial realm.”\nChilde gives her a blank look.\n“What I’m trying to tell you,” she taps him on the forehead, “is that whenever you find yourself lost, remember that the stars in the sky will always have a place for you. The universe is the foundation for existence, and that we are all composed from its very essence. To accept whatever that may come in our lives—that is the will of the stars.”\n“...I still don’t get it,” Childe tells her truthfully. \nMona smiles back at him with an enigmatic pull of the lips, and the glittering of galaxies within her eyes. “You’ll see.”\n \n \n“Childe.”\n“Howy  fhuck!” The ginger-haired male jumps, his screech muffled by his mouthful of egg rolls. Seeing that it’s just Zhongli, he calms down and swallows his food properly. “You scared me.”\nZhongli sniffs. “Is there something about one o’clock in the morning that always makes me seem more frightening than usual?”\n“It’s not a very humane hour to be awake at.” Childe points out, shoving another egg roll in his mouth.\n“But you are awake as well.” \n“Munchies.”\n“...Of course.”\nChilde beckons his roommate over to the couch, and grins lopsidedly. “If you can’t sleep, then join me?”\nZhongli smiles at that, relieved that Childe isn’t acting so awkwardly around him anymore, especially after he used the other man as his impromptu counsellor the other night. “Okay.”\nThey end up huddling together to flick through the channels again, with Morax soon slinking out of Zhongli’s room after sensing his owner’s absence. Seeing Morax curl himself contentedly around Childe’s neck like a fat fur scarf, Zhongli quietly gets up and returns with a familiar black circle in his arms.\nChilde squints at him against the harsh light of the television.\n“...We are not bringing Roomba into our TV cuddling sessions.”\nThe brunette looks downwards. “But wouldn’t it get lonely?”\n“Zhongli, that’s a robot.” Childe points out fruitlessly.\n“And?”\n“And… robots are not... um… okay. Fine. He can join us. Stop giving me those eyes.”\nAnd if acknowledging a circular vacuum robot (that gets fed dubious things into its dustbin every so often) as sentient is all it takes to make Zhongli beam at him like he’s the entire world, then, well, maybe it’s worth it. Sometimes.\n \n \nChilde sees Ningguang in the flesh for the first time when he and Zhongli are getting a rare lunch together between classes. \n“You two. Saturday. Meet at the entrance of Draffland at ten, and don’t be tardy.” She slaps a hand down onto their table of the cafe, her bright golden nails refracting the sunlight directly into Childe’s eyes.\nChilde flinches away and looks upwards, instantly recognising her from Beidou’s social media posts, the two of them practically glued together in every single picture.\nNingguang is the epitome of an independent woman; her entire aura asserting ambition and influence with her thin pencil skirt, twelve centimeter heels and bright carmine lipstick. No wonder Beidou is so head over heels for her.\n“Ningguang,” Zhongli says calmly, as if he were already used to the spontaneous demands of his second-in-command. “What is the meaning of this?”\nNingguang only replies with a knowing little smirk, her gleaming ruby eyes thinning with mirth as she waves two colourful tickets in front of their faces and sets them on the table. “If you come, you’ll see.”\n \n \n“What… is this?” Childe asks on Saturday at ten o’clock in the morning in front of Draffland Theme Park.\nToday, the weather is fine, the crowds are fine, Zhongli’s voluminous ass in those tight black pants are fine… everything is fine, he tries to tell himself, but Ningguang's subtle smirk does nothing to alleviate the apprehension stewing in his gut.\n“A double date!” Beidou supplies excitedly, a pair of fluffy ears already sitting on top of her head. Next to her, Ningguang is sporting a similar headband albeit with a big red bow in the middle. They’re wearing matching coloured blouses, although Ningguang has hers neatly tucked into the edges of her skirt whilst Beidou’s is ripped open at the top to show a distracting amount of cleavage.\nThe ginger-haired man splutters. Everything is suddenly not fine. “A  double date?” \n“Correct,” Ningguang uses Childe’s temporarily petrified state to plant a set of fluffy ears on top of his head, “it’s a good opportunity for us to relax a little before our workloads pick up the pace again.”\n“Um. I thought you just needed us here to, like, take photos for your date or something. Like an amusement park photoshoot,” Childe turns around towards Zhongli, a nervous smile on his face. “Right?”\n“I actually agree with Ningguang,” Zhongli rubs at his chin thoughtfully, “it does seem like an optimal time to unwind from the irrational stress stemming from the institutionalised pressure of our unnecessarily convoluted education system. Why not take the opportunity?”\n“But—”\n“I also want to ride the teacups,” Zhongli adds with a glint in his eyes.\nChilde turns around and sighs, completely and utterly defeated. Beidou flashes a winning grin and fistbumps her girlfriend. “Okay. I guess it’s a date, then.”\n \n \n \n“Can we… go back to the teacups…” Childe mutters petulantly as he tugs at the sleeve of Zhongli’s woollen coat (which is practically riddled with brown cat fur because Morax loves using it as his personal blanket, but that doesn’t stop Zhongli wearing it out all the time and smelling like cat), “the teacups were great…”\n“You almost vomited after we rode the teacups,” Zhongli says gently, rubbing at Childe's shoulders, “I think it’s best if we have a change of pace from the high velocity attractions.”\n“If we go in there,” Childe points shakily at the huge haunted house that Zhongli is steering the group towards, “I think  my heart will be the one going at high velocity instead.”\n“It will be a fun experience,” Zhongli catches Childe’s clammy hands into his and squeezes reassuringly, “trust me.”\n“Fun for you who loves to dissect the workings of every single ride here,” he grumbles, acutely and devastatingly aware of how sweaty his palms are whilst in Zhongli’s firm grasp. “Still dunno how you managed to keep talking about gravitational potential or whatever while we were literally going  full speed on the rollercoaster.”\n“A mouthful of insects ain’t gonna stop this guy’s ramblings,” Beidou belly-laughs next to them before she devours half of Ningguang’s fairy floss in one swift bite. “Surely you knew that after living with him for, how long?”\n“I told you we should’ve bought two.” Ningguang sighs before surrendering the rest of her fairy floss to Beidou’s Kirby-esque appetite. Beidou plucks the confectionery out of the platinum-blonde woman’s hands and finishes the entire thing off in the blink of an eye.\n“Nah,” the taller woman grins from ear to ear, mouth full of sugar, “tastes better when you give it to me,” she says, before leaning down to kiss the other on the lips.\n“Gross.” Childe mutters as he yanks Zhongli’s arm and pulls him towards the haunted house, jumping a little when a jack-in-the-box suddenly springs up next to them. “Come on. Let’s go and get this over with.”\n \n \n \n“Where’s all that manliness you had when you kept challenging me to arm wrestling?”\n“Sh-shut up, Beidou!”\n“Beidou, watch your head.”\n “Ack! …Spiderwebs? Wow, this place sure ain’t tall-people friendly.”\n“It’s just your lack of depth perception. Zhongli and Childe are doing just fine.”\n“To think that they would employ the use of such advanced animatronics for the mere purpose of entertainment, fascinating.”\n“Zhongli, this isn’t some Five Nights At Freddy’s—oh my fucking lord almighty. Zhongli, come back, don’t walk towards the zombie ZHONGLI  STOP TOUCHING THE ZOMBIE.”\n“Ning, are we gonna have to reimburse the place if we break one of their attractions?”\nA laugh. “Don’t worry, I’ll cover it.”\nAs the four make their way deeper into the haunted house, Childe begins to feel more and more lightheaded with every jumpscare and dismembered limb that he sees. He ends up clutching onto Zhongli’s sleeve and sweats into the fabric as Zhongli unabashedly goes up to each little moving contraption and prop to examine and explain them in his typical factual manner.\nMeanwhile, Beidou has moved from holding Ningguang around the waist and laughing off her nerves, to clenching her one eye shut and letting the other woman carefully guide them both through the darkness. \n…So it’s to be expected with Ningguang trying to speedrun the experience for the sake of Beidou’s pride, and Zhongli striking up a long one-sided conversation with a headless clown, that they, inevitably, get split up.\n“Um, Zhongli.” Childe tries to pretend his voice didn’t crack at the last syllable, to little avail. “…I think we lost Ningguang and Beidou.”\nZhongli turns around amidst the tacky stage smoke and cotton cobwebs, face ghostly and eerie under the foggy green lighting. Regardless, his amber eyes still manage to pierce through the dimness like a beacon at a harbour, and it would be a beautiful sight to behold if the atmosphere wasn’t so terrifying.\n“Did we?”\nSomething behind Zhongli moves, creaks, and all of a sudden Childe feels faint, all the blood in his body furiously running 1.8 meter sprint laps between his brain and toes. “Y... yeah. Can we go now? Please?”\n“Hold on a moment,” something catches the man’s bright eyes, and he moves towards a much more intact looking clown looming ominously in the corner.  This clown is caked in blood and gore and what looks like bits of internal organs hanging out of his afro, his beady golden eyes latching onto their every move like a leech. But Zhongli doesn’t seem to pay all that any mind and continues to move towards it without a single fibre of self-preservation in his body. \nAnd then. And then he does the unspeakable. \nHe grabs the clown’s bright red nose. \n “Ow!”  the clown shrieks, jerking backwards and Zhongli reels back in mild surprise as, instead,  Childe  who is standing three meters away and nowhere near homicide-by-clown vicinity manages to get out one final garbled noise of distress before he faints for real this time.\n \n \nWhen Childe comes back to consciousness, he finds himself lying face up against what feels like a very uncomfortable bed, and gingerly cracks his eyes open to thankfully see a white ceiling instead of the musty, damp inside of the haunted house.\nWonderful.\n“Ugh.” He winces. The back of his head throbs in pain from where it must’ve banged against the floor, sending an uncomfortable ringing through his ears. Luckily, it doesn’t seem to be serious enough to be a concu—\nZhongli’s worried face suddenly pops into his field of view, his bangs hanging down like a dark curtain, and this time Childe has enough experience to not reflexively headbutt the other man.\nThey stay like that for a few moments, both sides suspended in what feels like disbelief, before Zhongli curves his lips upwards.\n“You’re awake,” he murmurs softly, cautious, almost as if he’s expecting the man under him to faint again at any moment.\nChilde grins upwards, breathless with awe. “Of course I am. Takes more than a clown to put me out of commission.” A lie, but Zhongli isn’t the type to call other people out on petty things like that.\n“Oh, good,” Zhongli exhales, his lips parting with relief, still beautiful even upside down. “I was so worried.”\nChilde sits up, reluctantly looking away from the other man to take in his surroundings. They’re in a medical bay of sorts, surprisingly with no one else around, not even nurses. Strange. Zhongli takes a seat in one of the chairs next to the bed. \n“You were worried about me?”\n“Of course,” Zhongli replies solemnly, “You are an important person to me.”\n“...Huh.” He blinks, replaying the words in his head like a broken record. “Am I.”  An important person. \n“Listen, Childe,” Zhongli starts, refusing to make eye contact. It’s weird, Childe realises, because Zhongli has never  not made eye contact while speaking, but he doesn’t get the chance to dwell on what that could possibly mean before the other man continues, “I have been thinking, ever since Havria bid her farewells, that maybe it is indeed time for me to step outside my comfort zone.”\n“...Zhongli?” Childe can’t help but frown a little, confused as to why the other man is suddenly bringing up this particular topic while in the middle of a deserted first aid bay with the stupid-looking Draffland headbands still sitting on their heads. But there's something about the terseness in the older man's shoulders and the way he fidgets with his fingers that convinces Childe that yes, they are indeed having their second official heart-to-heart in the middle of a medical bay in a kids' theme park.\n“And I must confess,” the other man rambles on without stopping, still opting to stare at an unnaturally green plastic pot plant in the corner of the room rather than Childe’s face, “At first I was only following Guizhong’s lead—that if she decided it was necessary for me to have a companion in her absence, then I told myself I would accept her decision. And it was silly of me, in retrospect, to continue to yearn for her presence when you were with me. Because after what happened with Havria, I was reluctant to truly accept anyone else into my life in fear that maybe... maybe something like that would happen again. That it’ll be too easy to lose someone I care for.”\nHe bites his lip, then looks up at Childe with a wobbly smile. Childe’s never seen this kind of expression on him, and it almost feels unreal to see such uncertainty seep through Zhongli’s face like a splintering crack in the earth. “I apologise. I seem to have lost my composure a little.”\nChilde slowly angles his body towards the brunette, hesitant, and Zhongli continues on with quiet determination.\n“I realise now, after almost losing you, that I have been nothing but selfish,” he murmurs. “That you are perhaps no less important to me. Or perhaps even more.”\n“Zhongli,” Childe can’t help the goofy grin that shimmies its way onto his lips upon hearing those words, giddiness swelling up in his chest like a balloon, “It’s just a mild concussion.”\nThe other man finally shifts his eyes over to meet Childe’s deep blue hues, bright topaz shimmering with steely resolve. Childe, on the other hand, is still grinning like a madman (maybe there  was a little bit of a concussion), and not quite processing the last few seconds. \nThen, his mouth drops open.\n “Now kiss,”  a voice hisses from behind the door, but before Childe can turn to question it, Zhongli is already descending upon him, pressing his soft, red lips onto Childe’s own. Childe stutters out a yelp of surprise, his body frozen as his mind revs into overdrive, and  suddenly, as Zhongli runs his tongue against chapped lips, nothing else in the world matters anymore—not the throbbing pain in his head, not hideous ugly headless clowns casually standing around in haunted houses, and certainly not the fact that Childe’s cat ear headband has just slipped down and is now digging very uncomfortably into the junction between his ear and nape.\nZhongli’s mouth is open, warm, chaste, the little puffs of air between them tickling the sides of his mouth. It’s brazen yet bashful, and Zhongli himself tastes like  years of barely veiled loneliness, resigned acceptance, social reclusivity, and a hint of the caramel ice cream they had gotten for lunch, all in one handsome, bright-eyed package.\n“I actually…” the older man pants when they break apart for oxygen, “have not forgotten that night. After the party. In fact, I hold my alcohol better than Diluc thinks I do.” \nChilde looks at him with wild eyes, oxygen heavy in his lungs. “So… it was on purpose? You… coming onto me?”\nZhongli closes his eyes serenely as he brushes his forehead against Childe’s, disarmingly tender. “Yes, it was. Just an excuse.”\nThen he meets Childe’s mouth again, closing his eyes and making small, wanton sounds against wet teeth and skin, all while Childe sits frozen on the spot, silently screaming  what!!!!! as his brain unhelpfully proceeds to loop Careless Whisper on endless repeat to emphasise the fact that his entire life is basically just one big Kermit meme.\nAnd then, the unmistakable sound of a zip being pulled down. Childe’s zip. Childe’s  pant zip.\n“What the fuck,” he can’t help but murmur into the kiss, and yet still goes to tilt his head to slot their lips together much more easily. “You actually want me.”\nZhongli is the one that breaks them apart, shifting his weight so that he drapes across Childe’s lower half, pawing at his crotch. \n“I do,” he affirms, and bends downwards. When Childe dumbly tells him that they are in the medical bay of a childrens’ theme park, Zhongli simply gives him a confused look, and Childe gives up.\n“Okay. Hold on,” he mutters, face beet red and hand pushing against Zhongli’s forehead as the latter presses his face towards Childe’s still-clothed dick, “I need to get something straight. Is this, now, like, a roommates with benefits kind of thing, or are we actually—”\n“Childe.” Zhongli says lowly—molten, lucid eyes peering out from under the ginger’s palm. “I like you.”\n Oh my god, is what runs through Childe’s head. But what comes out of his mouth is, instead, “And you confess to me… through sucking my dick…. again?”\n“...Yes.”\n“Why?”\n“I feel as if I owe you a… less inebriated experience.”\n“...”\n“...”\n“...God, I just don’t know how someone can have the soul of an old man and the stamina of a horny teen all in one body,” Childe protests fruitlessly, letting his hand be moved off to the side. “If we get arrested for public indecency, it’s on you.”\nZhongli shoots him a look. “You can be so rude sometimes,” he mutters petulantly before he tucks a strand of hair behind his ear and dips his head down.\nBut there’s a brief moment where Childe catches a flash of purple behind the opaque window of the med bay door and Zhongli is sliding his lips against his thin boxers and then there’s a shuffle outside the room and—\nthe door flings open—\nand in tumbles Keqing then Mona then Beidou then a clown (?!) all yelling and falling and congesting into one big, groaning pile onto the cold, hard tiles barely three meters away from where Zhongli currently has one foot on the ground and Childe’s undone fly in his face.\nNingguang coolly steps into the room and locks the door behind her. She turns around, critically eyes Childe and Zhongli who are frozen on the bed, and smirks. “Congratulations.”\n \n \nThe clown, as Childe finds out, is rabid.\nHe also finds out that said clown has a name, and he is called ‘Xiao.’\n“He is an old friend of mine,” Zhongli explains to Childe with good cheer glowing all over his face. “A very dear friend, who just so happens to work odd jobs every now and then. He was the one that carried you from the haunted house all the way to the medical bay.”\n“I… I see.”\n“So, you‘re Zhongli’s new boyfriend?” Xiao crosses his arms, the smudged, gruesome makeup on his face doing nothing to mask his fearsome glare. The red that coats his nose is marred and uneven, and if Childe cranes his head a bit, he can spy a little of the same red powder sticking to Zhongli’s fingers.\n“Yeah,” he replies stiffly. Xiao leans into his space, his clownish presence towering over Childe even though Childe’s pretty sure that he would be a whole head taller than Xiao if it weren’t for the stilts.\nZhongli is still smiling complacently and cluelessly off to the side as Xiao continues leaning in even further—his afro wig brushing against Childe’s forehead, his eyes wide like a gaping maw that devours the souls of unworthy men.\n“You break his heart,” the clown breathes, lips barely moving, “And  I break you.” \nThis time, rather than passing out, Childe thinks that he might as well pass away instead.\n \n \n\nToe Knee Ah, Ajax Spray-n-Wipe\n\n \n\n12:45pm\n\n\n my boyfriend agrees that hatsune miku is green \n\n \n\n12:47pm\n\n\n ure both colourblind \n\n\n the whole family agrees that shes blue and \n\n\n12:48pm\n\n\n wait  \n\n\n BOYFRIEND???? \n\n\n AJAX??????? \n\n\n HELLO \n\n\n HELLO \n\n\n WHAT \n\n\n SINCE WHEN DID U GRT A BOYFRIWND \n\n\nHEY DONT LEAVE ME ON READ \n\n\n IM TELLING OUR PARENTS \n\n\n AJAX \n\n\n CHILDE \n\n\n BIG BRO \n\n\n12:50pm\n\n\n HAMTARO KNOCKOFF \n\n \n\n12:50pm\n\n\n CALL ME THAT ONE MORE TIME AND I WILL BLOCK YOU \n\n \n \n“Were you ever going to tell me that apparently our cat is internet famous?” Childe grumbles, dragging a brush through Morax’s wet fur and easing out all the knots as gently as he can, lest he becomes the subject of a ruthless feline wrath.\nZhongli doesn’t even bat an eyelash as he clips the cat’s nails with surgical precision. “Is he?” \nThe ginger huffs. “One million followers is a lot of people. I have, like, two hundred.”\n“You have half a million on your ‘Tweeter’ account.” Zhongli points out.\n“That’s different. That’s my old Tsaritsa stan account.”\nZhongli looks up to give Childe a flat look. “Yet you never told me about it, so I saw no reason to inform you of Morax’s SNS either. It’s an equivalent exchange.”\n “‘Equivalent exchange…’’' Childe  mutters under his breath, reaching for the hairdryer (the same one that blasted him into the mirror a few months ago) to dry out Morax’s fur and make him the infamous fluffball that he’s internationally known for. Because right now his fur simply hangs from his body like bits of soggy seaweed, lending Morax an exquisite look that’s more akin to a deep sea horror rather than a mostly harmless, slightly obese brown-coloured blob, “...my ass. I’m still buying Mona bubble teas to this day.”\n“What are you talking about?”  Clip. Clip. Clip.  Childe can’t even cut his  own nails as fast as Zhongli clips their cat’s.\n“Nothing.” He replies, watching the way coffee fur ripples under waves of heat as all the moisture is slowly vaporised from within. There’s no way in hell he’s telling Zhongli that this relationship is technically worth fifty-two (and counting) milk and fruit teas of varying and sometimes dubious flavours.\n \n \n \n“Here you go, your royal highness,” Childe grins as he fixes a shiny plastic crown on top of Morax’s head, earning a swat of annoyance from the cat. “How does it feel to get officially coronated as the king of the household?”\nMorax shoots him a look that can be roughly translated as ‘fuck off’. Childe simply laughs in response.\n“Maybe we should do something different, since having only Morax as the subject of every picture would become repetitive given enough time,” Zhongli muses as he scratches the cat’s chin. “A family photo, perhaps?”\nChilde raises his eyebrows to his hairline, before he lets out a huff of laughter. “Okay. Sure, me, you, Morax—”\n“And Roomba,” Zhongli says seriously, plucking the vacuum off from the floor where it was in the middle of just trying to do its one job in the house. “A family of four,\" he declares solemnly.\nChilde can only laugh resignedly at that before he holds Zhongli’s phone against the light of the balcony to snap a candid photo with Morax batting at the crown on his head, Zhongli doing his best to keep said crown on Morax’s head, and Roomba struggling in Zhongli’s grasp with its wheels whirring against the air. \nChilde hums as he slaps some flattering filters onto the photo before pressing his finger onto the ‘post’ icon without a single moment’s hesitation, chuckling at the way Morax flicks his tail and ends up getting it caught in Roomba's wheels, screeching in pain while batting a confused Zhongli right in the face.\n \nThe next morning, Zhongli wakes up to two million followers.\n \n \n\nOperation Spice Girls\n\n \n\n❀ Guizhong Ballista ❀\n\n\n Ningguang you’re a genius \n\n\n I can’t believe that whole double date thing actually worked \n\n \n\nNingguang (Do not contact me outside of work hours)\n\n\n It’s also thanks to Zhongli suggesting that we visit the haunted house. \n\n\n You know what they say: when two people are placed in a perilous situation together, they will automatically feel a special connection. \n\n\n Although in retrospect, Zhongli did not seem to be in peril at all. \n\n\n And the connection didn’t occur in the attraction itself, but rather the medical bay. \n\n\n But at the end of the day it doesn’t matter as long as the goal is achieved. \n\n \n\nKeqing.\n\n\n If we had just stayed quiet behind the door maybe it would have gone a lot smoother. \n\n \nQueen MonAss ❤\n\n WHO WAS THE ONE WHISPERING NOW KISS AND ACCIDENTALLY PUSHED THE DOOR OPEN\n\n \n\nKeqing. \n\n\n WHO WAS THE ONE WHO KEPT TUGGING MY HAIR HARD ENOUGH FOR ME TO FALL OVER AND KNOCK BEIDOU OUT ONTO THE GROUND.\n\n \nQueen MonAss ❤\n\n . \n\n\n Sorry \n\n\n Ill treat you to dinner \n\n \n\nKeqing. \n\n\n Don’t force yourself, you still have to pay rent. My treat. \n\n \nQueen MonAss ❤\n\n I LOVE U \n\n \n\nKeqing. \n\n\n I love you too.  \n\n \nQueen MonAss ❤\n\n We make a much better pair than Zhongli and stupid gingerhead right \n\n \n\nAjax Spray-n-Wipe\n\n\n thats great and all that you made up after your fight that lasted a total of 2 seconds but you guys realise im still in the chat right \n\n \n \nSurprisingly (or unsurprisingly), being Zhongli’s boyfriend is almost the exact same experience as being his roommate, that much is evident from the last few weeks they’ve been together.\nOr, perhaps, there has always been an overlap between the two—between all the cheeky bantering, splitting of the housework (a very uneven ratio, but the effort is there), quiet nights in front of the TV, and lazy morning hugs—but Childe has always been too stubborn to call it otherwise.\nThe only thing that’s changed, really, is that Zhongli is more open now. More heartfelt, genuine, maybe. It’s a bit like watching the slow ascent of mountainous fog rising into the skies, unveiling the sublime sort of contentment of watching mountains swathed in the golden light of dawn. \n \n“I like your hands,” Zhongli whispers to Childe one early morning, under the dim, artificial kitchen lights. “I think they’re beautiful.”\nHe trances a finger over an old laceration, almost as if deep in thought. His own hands are smooth in comparison, long and well-kept, the only visible imperfection a writer’s callus on the side of the middle finger, but even then, it blends in well.\n“I think  you’re beautiful,” Childe grins, breathless, a warm flush creeping up his neck, hands limp in the other’s grasp. Zhongli’s eyes go wide for a second, before a smile blooms across his face, soft and luminescent. Childe decides that not even the dazzling alpines of northern Snezhnaya could rival such a gorgeous sight.\n“I think you’re beautiful too,” Zhongli tells him, honeyed eyes crinkling with delight as he weaves their fingers together, firm, unabashed, like they were always meant to be, and slots their lips together as morning sunlight seeps into the room.\n \n\n\n\n\n\n\n\n \n \n \n \n \n(epilogue.)\n \nHavria keeps her promise, and organises a group video call as soon as she lands safely in her new country. Guizhong, Childe and Zhongli all watch with varying degrees of concentration as Havria tours them through downtown Fontaine, the potent combination of lag and constant movement rendering the video feed jumpy and unclear. \nGuizhong is currently backseat driving Havria around to each of the shops—commenting on everything from local fashion to delicacies to the Fontainean government’s military budget—while Childe is on the couch with Zhongli, sitting cross legged as the other man huddles against his shoulder, muffling a tired yawn into the back of his hand. As it seems, the timezone difference between Fontaine and Liyue means that what is three in the afternoon for Havria ends up being five in the morning for the rest of them.\n“Mmh…” the brunette mumbles, eyes flickering unsteadily as he tries his best to focus on Childe’s phone. The younger breathes out a chuckle, wrapping an arm around Zhongli’s shoulders to hold him closer as they let the two womens’ voices wash over them like familiar white noise.\n “Zhongli!!”  Guizhong suddenly presses her face so close into the camera that a single eyebrow takes up the entire space of the little rectangle.  “You know how to speak Fontainean, right? How do you say ‘your taste in souvenirs suck and a baguette is not an acceptable gift to someone who you’ve known for more than twenty years’?” \n“J'ai besoin de nouveaux amis,” Zhongli replies, before shimmying down until only half his face is left uncovered by the blanket, resting his head on Childe’s broad chest and closes his eyes, letting the other man’s faint heartbeat lull him into a state of peaceful zen.\nChilde laughs, indulgent, combing his fingers through his boyfriend’s fluffy hair in a mirroring motion to how he would comb Morax’s scraggly fur after a bath.\nHavria’s camera is still a blurry mess, but at least it’s now stable enough to no longer induce motion sickness. Guizhong leans back so most of her face is visible again, lips pursed in thought.\n “‘J'ai besoin de nouveaux amis’,”  she tests, satisfied, and grins. “Not bad! Hey Havria, ‘j'ai besoin de nouveaux amis’!” \n \n(fin.)\n \n "
}