{
    "id": "2831402",
    "url": "https://archiveofourown.org/works/2831402?view_full_work=true",
    "author": [
        "dalyeau"
    ],
    "title": "tea-stained polaroids",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Haikyuu!!"
    ],
    "relationships": [
        "Akaashi Keiji/Bokuto Koutarou"
    ],
    "characters": [
        "Bokuto Koutarou",
        "Akaashi Keiji",
        "Kuroo Tetsurou",
        "Haiba Lev"
    ],
    "additional_tags": [
        "Alternate Universe - Coffee Shops & Cafés",
        "photographer akaashi",
        "bokukuro friendship is so important",
        "wow i love lev so much bye",
        "side kuroken"
    ],
    "language": "English",
    "series": "",
    "published": "2014-12-24",
    "completed": null,
    "words": "5,765",
    "chapters": "1/1",
    "comments": "568",
    "kudos": "22,506",
    "bookmarks": "4,453",
    "hits": "205,037",
    "summary": "<p>“I'm gonna date that,” Bokuto declares solemnly, and Kuroo throws a plastic spoon at his head.</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a>.)</p>\n<p>if you feel like passing out and needing an ambulance, @Adelaida made some gorgeous <a href=\"https://i-like-to-look-at-your-back.tumblr.com/post/108957318963/\" rel=\"nofollow\">fanart</a> that will blow your head off like it blew mine.</p>\n<p><b>note as of september 2023</b>: thank you so much for all the kudos and comments! it's been like 8 YEARS and i still get so much love for this silly little fic, THANK YOU! i fail at keeping up and replying but i read every comment and i appreciate them so so so much aaaaaaa.</p>\n<p>please remember to be happy and safe! try a new hobby! wear sunscreen! drink water! write your self-indulgent fic you've always dreamed about! be kind to yourself!</p>",
    "text": " \nBokuto notices him the moment he walks in. It's impossible not to – the guy's tall and he snaps a picture of the coffeeshop right after getting past the door, blinding Bokuto with the flash and making him rub his eyes and blink.\n“The hell?” he hears some other customer say.\nThe newest visitor doesn't seem to care about the heads that turn to look at him and his camera, merely starts making his way towards the counter as he adjusts the collar of his jacket.\nHe's beautiful.\n“I'm gonna date that,” Bokuto declares solemnly, and Kuroo throws a plastic spoon at his head.\n“Way too out of your league.”\n“Probably straight too,” Lev offers with a yawn, head resting on his folded arms behind the cash register. He rises it just enough to take a peek. “Nice camera though.”\nBokuto straightens his dark orange apron, puffs out his chest to make sure his name tag is visible, and runs his fingers through his hair to spike it higher. By the time the customer is in front of him, Bokuto is already welcoming him with one of his best smiles – big but not overkill, just the right side of charming and gentle.\nThe customer does not seem charmed at all.\n“I'll have some tea,” he says, eyes quickly scanning the menu behind Bokuto, though it seems out of habit than anything else, his gaze never stopping long enough to really consider any of the very varied, carefully thought out drinks of Nekoma's. “Simple. No sugar.”\n“Aw, come on,” Bokuto says, smile widening. “You go to a coffeeshop to ask for tea?”\nThe guy stares at him. “Yes.”\n“...Alright then.” Bokuto's shoulders fall a little under that blank, unimpressed expression, and Kuroo politely turning his head to snicker does not help. Neither does Lev, who straightens up with a smirk in what is clear interest to see Bokuto's attempt at flirting crash and burn. “What's your name?”\n“Akaashi.”\n“A simple, no sugar-ish tea it is, Akaashi.”\nWhile Akaashi pays for his drink, Bokuto writes on the cup, Hey hey hey Akaashi, I'm Bokuto, but you can call me Any Time, with his phone number a lazy scribble that he hopes comes off as casual and endearing. Akaashi takes his drink after it's ready, his eyebrows rise near his hairline as he reads Bokuto's thoughtful message, and he goes find himself a table where he can calmly drink his tea and adjust the lenses of his camera.\nHe does not, in fact, call Bokuto that night, or any time during the week and a half it takes him to come back.\n \n \n \n \n \n \n \nThis time Bokuto sees the flash before he sees Akaashi, and he blinks it away with a ball of dread sinking his stomach. He's carrying the same camera, the strap hooked around his shoulder, and an umbrella under his arm, even though it hasn't rained in at least two weeks as far as Bokuto knows.\nBokuto groans, ducking behind the counter and lightly punching Lev in the leg.\n“Take this one for me,” he whispers.\n“No way,” Lev replies with a big grin that reminds Bokuto a lot of Kuroo, and really, why did he ever introduce them? “That's not my job, senpai. You take the orders, Kuroo makes the drinks, I charge. Up you go.” He waves at someone at the other side of the counter. “'Sup.”\n“Hi,” Akaashi replies politely.\nBokuto tries to get up as gracefully as possible. He hits his head on the counter and curses as tears of pain pool in his eyes.\n“Hey.” Play it cool. “Let me guess, tea again?”\nAkaashi nods, and Bokuto can tell he's surprised that he remembered his order from nearly two weeks ago, eyes widening if only a little. His fingers are absent-mindedly adjusting his camera, brushing over it with a gentleness bordering on devotion. It reminds Bokuto of the way he's seen players holding volley balls right before a serve; Akaashi must either be a professional photographer, or on his way there.\nAs Kuroo makes the tea, Bokuto can't really stop himself from asking, “What's with the umbrella? It's like, the nicest day out there.”\nAkaashi looks up. “A project for my class.”\n“Let me guess again. Photography?”\n“I've carried worse things,” Akaashi says, shrugging the shoulder that isn't holding his camera's bag. “The umbrella is okay.”\nBokuto is curious about the mysterious worse things, but the rejection from those weeks before still holds him back a little, makes him feel unusually shy and at loss of what to say. He's grateful that Kuroo hands over the tea only a minute later, this time with a simple Akaashi written on the cup, and as Bokuto passes it to Akaashi he notices how cold his fingers are as they brush his own. It's a perfectly sunny day, so Bokuto can only assume he's one of those people with permanent cold hands regardless of the weather or season, which he finds himself envying a little. He loves putting his hands under his unsuspecting friends' sweaters when they're cold in winter days, Kuroo being the the most usual victim, though Lev's screams are louder and better.\nAkaashi walks away with his drink and goes sit at the same table from before, and Bokuto pointedly does not stare at him (maybe there's a little staring going on, but that's at Akaashi's back when it's safe to do so). Kuroo pats him on the shoulder.\n“Aw cheer up, there's plenty of other fish in the sea. Fishes without umbrellas on sunny days.”\n“Go away, jerk,” Bokuto mutters, his dejected mode starting to activate. “Why did you let me give him my number? We're not supposed to ask customers out, it's bad for the business and stuff. You should have stopped me.”\n“You just looked so smitten,” Kuroo replies with a smirk, poking Bokuto on the stomach. “Seriously though, he looks really boring anyway. I bet all he can talk about is photography and maybe some pretentious shit about museums and books. You can do better than that, my friend.” He throws an arm around Bokuto's shoulder and pulls him close.\n“Yeah,” Bokuto says, thoughtful. “Yeah!” he repeats, encouraged.\n“Well, the boring and pretentious guy is staring at you right now,” Lev says, stretching his arms over his head and looking taller than anyone should have the right to while sitting down.\nBokuto immediately turns to check, stomach doing a weird funny thing, and certainly there it is: Akaashi is drinking and looking straight at him from over his cup of tea, brows a little furrowed. As soon as he realises Bokuto is looking back, though, he drops his gaze, and he does not look up again. There's no way he could have heard them from all the way over there, but Bokuto wants to apologise anyway, wants to walk up to Akaashi's table and tell him he doesn't think Akaashi is boring or pretentious at all, even though the umbrella is kind of weird. But that's okay; Bokuto likes weird just fine.\n“Go over there,” Kuroo tells him. “This is your chance.”\n“I thought you said he was boring and pretentious.”\n“Maybe he is.” Kuroo shrugs. “But he's hot, and you need to get laid.”\n“I second that,” Lev adds, helpful. “The getting laid part, not the hot part. He's alright, but too tall.”\nKuroo and Bokuto both turn to look at him in incredulity.\n“What,” Lev says defensively. “I like short guys!”\nBokuto swallows hard. He risks another glance at Akaashi and their eyes meet across the coffeeshop. This time, he does not look away as quick as before, holding Bokuto's gaze without shielding an inch.\n“Okay, okay,” Bokuto says with a sigh. “I'll go if he keeps looking after a while.”\n“Coward,” Kuroo says under his breath, and Bokuto punches him in the arm.\n“Asshole.”\n“Owl head.”\n“Bedhead.”\n“That's true.”\nThree other customers come in, highschool girls in their uniforms that couldn't be older than fiftteen, and Bokuto offers them a bright smile as he hands them their cappucinno, iced tea and espresso, which has them giggling as they mumble their chorus of thank you's. Really, Bokuto loves his job. He likes working with Kuroo and Lev, even if they don't stop him from flirting with hot customers that are definitely going to turn him down, and he likes learning about new drinks because some day he'd like to make them, if Kuroo leaves this job before Bokuto does. The money is alright, the schedule fits his classes nicely, most customers are nice, and he gets free coffee. Yeah, he definitely likes this job.\nAkaashi is drilling a hole into his head, Bokuto is so aware of his piercing eyes focused on him. He walks up to the counter to ask for another tea and that quiet, intense gaze has Bokuto messing up his name and apologising and offering to get him another cup.\n“It's alright,” Akaashi says. He fingers his camera's strap and speaks so low Bokuto has to lean in to hear him. “I have an offer.”\n“Oho?”\n“Shut up, Kuroo.” Bokuto chucks a sugar packet at Kuroo and turns to Akaashi again. “My shift is over in half an hour if you can wait. We kind of have an audience.” As if on cue, two customers walk in, a couple holding hands and laughing.\n“I'll wait.” Akaashi nods and goes back to his table. This time it's Bokuto drilling a hole into his back, he can't get his eyes off him.\n“Nice,” Lev says, grinning.\n“Good job,” Kuroo adds, ruffling Bokuto's hair.\nBokuto is not so hopeful. If Akaashi wanted anything to do with him, he'd have called at some point, surely. He had taken with him the paper cup with Bokuto's number on it, so it's not like Bokuto could make himself feel better by believing Akaashi forgot to save his number, or threw the cup into the trash can and then ended up regretting it.\nHe takes off his apron when it's seven o' clock, and resists the temptation to look at himself in a spoon's reflection to check if his hair is okay. Akaashi probably just wants to ask if there's a spot available for another barista at the coffeeshop, or maybe offer Bokuto to hang out as friends. It wouldn't be the first time that happens; that's how Kuroo and him met, actually, when Bokuto first came to the shop as a customer and asked the barista with the feline smirk out, only for Kuroo to turn him down but tell him that he thought Bokuto was cool and his weekend-casual volleyball team was just in need of a new player, if he was interested. Maybe Akaashi will be Bokuto's new friend. Bokuto is more than okay with that. There's always space for more friends, and he doesn't have anyone that talks to him about photography and maybe books and museums, which isn't really pretentious as far as Bokuto is concerned.\nAkaashi's finished his second cup of tea by the time Bokuto approaches him and sits down in front of him, trying not to fidget. Okay, so maybe it'll take a little time to get used to being friends with the prettiest guy he's ever seen, if that's the route Akaashi takes.\n“So, uh. Hi.”\n“Hi,” Akaashi replies, serious. “Thanks for coming,” he says, like Bokuto is the customer visiting his shop. “First of all, before telling you, I'd like to say that you don't have to say yes out of compromise, if you're the kind of person to do that. I need someone willing and serious about it. It'll be better for me that you refuse if you aren't convinced.”\n“Okay?” Bokuto says, and it comes out sounding like a question because really, by this point he has no idea what to expect. Sadomasochism? It's always the quiet ones, they say. Some manga club? He doesn't seen any anime stickers on Akaashi's camera. “Shoot.”\nAkaashi breathes in deeply. “I need someone as a model for several weeks for a project. I'm about to graduate from my photography class and my last assignment is taking pictures of someone else every day for a month, with certain conditions to meet; nothing out of the ordinary, and you don't have to actually model. You seem...” He purses his lips, thoughful. “Ideal for it, I guess.”\n“Oh.”\n“I would pay you, of course. We can discuss how much as soon as you want, if you accept.”\nBokuto whistles and folds his arms over the table.\n“Interesting,” he says, and it really is. “Okay, sure.”\nAkaashi narrows his eyes at him.\n“Really? I still have some days left before the project starts, you can think about it.”\n“Nah,” Bokuto waves a hand dismissively. “I need the extra cash and it sounds fun. As long as your last day's photo isn't murdering me and taking a picture of my body hanging from a hook in your basement, I'm in.”\n“Ah,” Akaashi says, eyelashes casting shadows on his face as he lowers his gaze. “Deal's off then.”\nIt takes Bokuto a moment to get it, and then he's throwing his head back and laughing hard, genuine. He shakes his head as he recovers, smiling wide at Akaashi. That deadpan expression only makes it better and Bokuto laughs some more.\n“I'm more than in. Tell me when to start.”\nThey walk out of the coffeeshop together five minutes later, Akaashi explaining in more depth what the project is about and what his goals are and how he expects Bokuto to work with him, and he only stops when he gets his camera out and takes a picture of a cat standing on a tree, the day's last rays of sunlight reflecting on its black fur and the orange leaves.\n \n \n \n \n \n \n \n \n“So, he's like. Taking pictures of you. Every day.”\n“Yeah.”\n“Just the two of you alone, wandering around the city.”\n“Yup.”\n“And he's said... what was it? That you're a good model and he'd like to keep working with you in the future if you're willing and available?”\n“I think so, yes.”\n“Damn.” Kuroo blinks. “That's something.”\nBokuto sighs very loudly for dramatics' sake. “Tell me about it, dude.”\n \n \n \n \n \n \n \n \nAkaashi Keiji is twenty-two and his photography course is a hobby for him, is the first thing Bokuto learns about him. He's studying graphic design, focusing on an extra side-class of Visual Advertisement, and sometimes he likes to combine business and pleasure using the pictures he's taken in his free time for his college projects. He's the quietest person Bokuto's ever met, except maybe for Kuroo's boyfriend Kenma, and his humour is the deadpan, dry kind that always hits Bokuto like a punch in the stomach and steals the breath out of him between thunders of laughter.\nHe has the nicest hands Bokuto's ever seen, too. Long fingers, pale and delicate, that hold his camera against his face at the perfect angle – Akaashi knows what he's doing. There's a mole on one of his knuckles and he does something with his wrist as he finishes taking a picture and puts his camera away, some sort of elegant twist, that steals the breath out of Bokuto just as effectively as that dry sarcasm, but without the laughter and a lot more uncomfortable longing low in his belly.\nThe first week goes as well as it can, while they try to adjust to each other, learn how to interact and work together to make it productive days. Akaashi comes pick Bokuto up when his shift at the coffeeshop is over and they walk together to whatever place Akaashi has planned for his picture of the day – so far it's been the park (thrice), a train station (once), in the middle of the street when Bokuto didn't even know Akaashi was going to take a picture (twice), and the front gates of Bokuto's old highschool (once, too). Bokuto's instinct wasn't wrong when it told him that this would be fun; there's a bit of awkwardness at first, when Bokuto doesn't know what face to make or how to stand to make Akaashi's picture a good one, but Akaashi is patient and guides him through it with that calm voice of his that is almost like a tender caress for Bokuto's nerves.\nHe really likes Akaashi. He's kind and doesn't get angry with him when Bokuto ruins a picture by blinking or sneezing; under that collected exterior he's all quiet, intense love for the photography he cares so much about, and wrenching a smile out of him feels a bit like winning the biggest prizes at festivals (and takes just as much effort). Neither of them mention that first day when Bokuto gave him his number in the lamest attempt of flirting known to mankind -as Kuroo and Lev have come to call it- but there's no hard feelings about it, or awkwardness. Bokuto is starting to think that he should have been more subtle and less brutal about it. Akaashi doesn't seem like he's very experienced in the subject of flirting or dating, or being social in general, so it's no surprise that Bokuto's advances had met a wall of no response whatsoever.\nAkaashi is, first of all, a very good photographer.\n“Hey, that's a nice one,” Bokuto says, looking at the most recent picture, the one Akaashi's just taken of him talking on the phone with Kuroo without him even knowing. Bokuto is grinning wide in the photo, face scrunched up in an exasperated but fond expression, gesturing with his left hand at nothing in particular. He looks happy and open and somewhat charismatic.\n“Day eight's subject is friendship,” Akaashi says, nodding pleasantly. “The condition was no other people allowed in the picture.”\n“A hard one,” Bokuto says with raised eyebrows. The previous days' subjects and rules had been pretty general and easy enough, technical things like the kind of lightning or zoom to apply.\nHe's liking this side-job more than he'd anticipated. Akaashi had said there was no actual modelling involved and he hadn't been lying, most of the pictures are casual and take no longer than a minute or two to stage, if at all. He wants Bokuto to act natural, just be himself and ignore the lens, and that's easy for him, who isn't particularly surroundings-aware and has never really been camera-shy anyway.\n“What's tomorrow's key word?” Bokuto asks, curious.\n“I don't know.” Akaashi is still looking at the newest picture, surely adding filters and layers in his mental Photoshop, maybe cropping some unnecessary inches. “I check day by day.”\nAh, right. Photography's about being spontaneous and ready for whatever new the day will bring, or something like that. Bokuto nods knowingly.\n“Yeah, good plan.” He puts his hands in his pockets as they reach his home. “Come say hi by the shop tomorrow, I need some witnesses in case you weren't joking about the hook in your basement.”\n“Very funny, Bokuto-san.”\n“Really, though, I'll get you a drink on the house. Or more like, on the money you're giving me, how's that sound?” He nudges Akaashi playfully and gives him a two-finger salute. “See ya. Don't stay up all night tweaking the picture, if those bags under your eyes got any bigger they could carry your camera for you.”\n“I'll order some coffee,” is Akaashi's dry reply. Then: “I don't really have a basement.”\n \n \n \n \n \n \n \nAkaashi does order that coffee. Black, of course, and all three of them are horrified.\n“Amazing,” Bokuto breathes out, watching Akaashi drink from the cup that says Best Employer Ever with an owl perched on the E. It's wearing glasses and carrying a camera. Really cute, Bokuto would call it his masterpiece.\n“How the fuck,” is Kuroo's terrified comment.\n“A true hero,” Lev adds, awed.\nKuroo passes Akaashi at least seven sugar packages over the counter, closing his eyes in a pained expression.\n“Please,” he says. “I can't watch this. Put yourself out of your misery.”\nBokuto wishes his friends were a little bit less embarrassing, though not really. Kuroo makes him a milkshake and tells him he'll cover your sorry gay ass while you flirt with your boss low enough to go unnoticed by Akaashi, though not by Lev, who nods along encouragingly.\n“I didn't think you were going to actually come,” Bokuto tells Akaashi as they sit down, honest. He feels a bit silly with his apron still on, but the milkshake is good enough to make up for that.\n“I like this place.” Akaashi looks around. “Too bad my pictures didn't capture it properly.”\n“Even I know that this lightning is awful for pictures, let alone that ugly flash. No offence.”\n“That was the point. Our previous project was about making beginner's mistakes, and then fixing them with Photoshop. I'll show you the end result sometime. I think it came out looking pretty decent, and so did the professor.”\nThey keep talking, about photography and Akaashi's iron palate to tolerate black coffee and Bokuto's hair, but his mind is somewhere far away, far behind, stuck on that sometime, on the fact that Akaashi is not planning on ditching him and never showing his face again once their month working together is done. He'd said so before, when he said Bokuto was a good model and they could maybe try working again some day, but that was vague and blurry, some possibility far beyond today. This is real. Bokuto's hands feel tingly and weird and he wipes them on his apron under the table.\nAkaashi leaves half an hour later, and he takes the paper cup with him, even though he's finished his coffee. At Bokuto's questioning raised eyebrow, he shrugs and says, “It's a cute owl.”\nKuroo whistles as Bokuto comes back to the counter.\n“That's the face of a broken man.”\n“I'm so fucked,” Bokuto says.\n \n \n \n \n \n \n \nThe later half of the second week is harder, because Akaashi needs better lightning for his pictures and he prefers outdoors, which means picking Bokuto up after his shift is done at seven doesn't really work. They try to juggle and compromise, what with their classes and Bokuto's job, and they end up agreeing on meeting first thing in the morning to take the picture as soon as the sun is out and helpful, so early that Bokuto is tempted to quit only to have a couple of more hours of sleep.\nHe hasn't even had time to do his hair. It makes him a bit irritated, though he already feels better when he sees Akaashi waiting for him across the street, camera bag hooked across his shoulder. It's clear at first sight that he's not a morning person; his hair is ruffled (though it isn't even close to rivaling Kuroo's bedhead), his eyes are half-closed and he doesn't reply the first three times Bokuto calls out his name, the last one when they're so close their feet are nearly touching. It's sort of cute in that sleepy, dead-inside kind of way. Bokuto grins lazily and they start walking.\nHe wonders what Akaashi would say if Bokuto told him that the reason he didn't get much sleep, apart from the ungodly hour he had to wake up to, is that he couldn't stop thinking about Akaashi's hands as he adjusts the lenses of his camera, the way his eyes narrow and focus right before snapping a picture, the bob of his Adam's apple as he drank his black coffee from hell.\nHe'd probably take a photo and save it for a day with a key word about being pathetic or something, Bokuto thinks, and pushes his hair away from his forehead with a sigh.\n“You're quiet today, Bokuto-san,” Akaashi says.\n“Yeah,” Bokuto replies. He's so tired. He wants to go back to his bed and maybe take Akaashi with him as a pillow, which speaks volumes about how bad he has it, because Akaashi is sort of skinny and he doesn't look very pillow-y at all. “Yeah.”\n \n \n \n \n \n \n \n \n“I don't like this job anymore,” he complains, near the end of week two.\n“Rude,” Kuroo says distractedly, in between making drinks and passing them to him.\nBokuto hands the orders to the customers and rubs at the back of his neck when they're gone to find a table.\n“Okay, I lied. I like it too much. Too much.”\n“Aww, love you too, bro.”\n“Senpai,” Lev says, munching on a donut. “If it helps, I think Akaashi likes working with you too.”\nHe points at the door, no discretion whatsoever, and Bokuto turns to see Akaashi entering the shop.\nHe's wearing a plaid shirt with the sleeves rolled up that nearly has Bokuto salivating, and this time he orders his usual tea, the corners of his mouth turning upwards when he sees the owl wearing goggles and piloting a little plane Bokuto drew for him.\n“Why is it on a plane? Owls can fly on their own.”\n“Christ, I don't know, just go with it.”\nAnd when an hour later Akaashi gets up and gets ready to leave, only to pause and rub his thumb over Bokuto's chin saying Be more careful with those milkshakes, Bokuto-san, Bokuto allows himself to believe that maybe Lev's right.\n \n \n \n \n \n \n \nLev was right.\nOr at least, he wasn't entirely wrong.\nAkaashi definitely seems to enjoy Bokuto's company well enough (in his own silent, are-you-sure-that's-a-good-idea-Bokuto-san? kind of way) and on week three's Tuesday he invites Bokuto over to his place to have dinner and talk about volleyball and let him see Akaashi tweaking the pictures he's taken during the month. They eat ramen, Bokuto bullies Akaashi into promising they'll play together sometime and Akaashi will toss to him, and Bokuto drops his head on Akaashi's shoulder in boredom as they sit side by side in front of the laptop, photoshop open with nearly fifteen different pictures of Bokuto and a lot of little windows with curves and numbers that he doesn't understand and isn't interested to.\nAkaashi lets him fall asleep like that and doesn't wake him up until he's done, the laptop announcing that it's nearly midnight. Bokuto refuses on principle to leave, saying that he deserves at least some good tv episode to make up for that yawn fest, and they end up watching some drama that Bokuto reenacts with a high voice and has Akaashi snorting and laughing a little, no matter how much he tries to hide it from Bokuto. They're in the same position the whole time, side by side, legs and arms and shoulders touching, and Bokuto can feel every vibration of Akaashi's body, he could count every freckle scattered on his cheeks if he was allowed to stare long enough.\nWhen Akaashi turns his head, his gaze flickers down to Bokuto's lips, so fast that Bokuto is sure he hallucinated it by sheer force of will. They're so close Bokuto would have to lean in only an inch or two to feel the breath Akaashi lets out as he speaks.\n“You can stay. I need you up at half past four anyway.”\n“Abuse of power at work,” Bokuto mumbles, grinning as he pulls back and excuses himself to the bathroom, feeling his skin itching from the inside.\nIt's on his way there, when he takes a sideways glance at Akaashi's library, that Bokuto finds the polaroid camera.\n \n \n \n \n \n \n \n \nHe's sure the reason Akaashi let him borrow it is that he doesn't really use it, and he didn't have the heart to refuse Bokuto's pleas. Bokuto is aware that he can be a bit of a child impossible to say no to when he gets really excited about something, but in his defense, the camera deserves it. It's old, there are some stains on it that don't go away no matter how much he rubs at it with his sleeve, the polaroids come out with an ugly yellow tint and Bokuto's sure its life is nearing the end, but it's still the greatest thing he's ever seen, and he takes it to the coffeeshop proudly.\nHe snaps pictures of Kuroo's bedhead and Lev smiling as he puts on his apron, takes a selfie of himself holding the cup he rescued from the trash can where he had scribbled the cutest turtle on his first day of work, and he also takes a photo of one of their regulars (Oikawa Tooru, ridiculously pretty, law student) when he sees Bokuto with the camera and asks for a picture with the most charming smile and honey-like voice. Honestly, if Bokuto wasn't so into Akaashi, he'd consider going for it. As it is, he takes the picture and gives it to Oikawa along with his caffé macchiato.\nLater, when he meets Akaashi outside the shop, he holds the camera up, grinnnig widely.\n“This is the coolest thing.”\n“You're very easy to please, Bokuto-san.”\nTonight's subject is reflection. Akaashi has it all planned out apparently, because he doesn't take more than a minute to tell Bokuto to take a picture of him with the polaroid, while Akaashi takes one of him with his own camera. They're facing each other, sitting on a wood bench at the park with just enough time before sunlight runs out, and their cameras click at the same time, Bokuto snapping his picture promptly when Akaashi finishes counting down.\nHe looks down at the polaroid, waiting for it to develop, and he waves it proudly when it's done.\n“I'm keeping this one!” he announces, but then he stops smiling when he sees Akaashi's face.\nHe's staring at Bokuto with heavy-lidded eyes, the straight white edge of his teeth digging into his lower lip, expression relaxed and easy, and sort of absent-minded. He snaps out of it as soon as Bokuto speaks and looks up, brows furrowing into his default Bokuto-san expression, but it's too late. Bokuto's seen it and not even a picture could last longer, it's now engraved into his mind and probably behind his eyelids when he goes to sleep tonight.\n“After your project is done, I'm going to ask you out again,” Bokuto declares.\nAkaashi's gaze is intent and focused like a camera's lens. He nods, once.\n \n \n \n \n \n \n \nLev sighs and gives Kuroo enough money for him to buy Kenma a new game.\n“Assholes,” Bokuto says, rolling his eyes. “You made a bet about me?”\n“You only had to hold it for like two more weeks,” Lev whines, looking miserable.\n“Ohoho,” is Kuroo's only response, counting the cash. “Banging the boss? I'm proud.”\n“I didn't get laid, give Lev his money back.”\n“What? I thought you were my friend.”\n“I like Kenma,” Lev assures Kuroo, “but that game is way too expensive. Senpai,” he turns to Bokuto, pressing his palms together in prayer, “please. Two weeks.”\nBokuto rolls his eyes again, and goes meet Akaashi at their usual table.\n“What's got him smiling so much if not sex then?” he hears Kuroo ask Lev, puzzled.\n \n \n \n \n \n \n \n \nBokuto resists it until Thursday. After days and nights of walking around the city with Akaashi and getting dinner together, taking pictures with Akaashi, sleeping in the same couch as Akaashi with his head on Akaashi's shoulder and Bokuto's arm thrown across his chest, after four weeks of what's been absolutely nothing but cute owls drawings on paper cups and Akaashi, with his long lashes and curly dark hair and nice forearms, Bokuto is about to explode, or implode, or whatever people do when they want someone so much it makes their toes curl and their chests feel heavy and swollen.\nThey only have like three days left until Bokuto asks him out again anyway, and unless he's the actual biggest idiot on Earth, he's pretty sure Akaashi is going to say yes.\nHe's not staying at Akaashi's tonight, and when they get to Bokuto's flat and stop at the door, Bokuto puts a hand on Akaashi's waist and takes a little step, until their shoes are touching. Akaashi seems frozen but not unwilling, the hand he always has on his camera's strap tightening around it, and he's so gorgeous, God, Bokuto could scream about it. He doesn't really say anything (he knows better than saying some clichéd, stupid thing like I'm going to kiss you right now, Akaashi ), just leans in and that's it, Akaashi's eyes are closing and his lips are parting and this is going to be good, this is going to be so good -\nAkaashi puts his hand between them, and Bokuto kisses the soft skin of his knuckles.\n“Not while I'm still paying you, Bokuto-san,” he says as Bokuto pulls away.\nBokuto rubs his hands over his face and takes a step back.\n“Really?”\n“Really,” Akaashi says, firm. “Patience.”\nHe grabs Bokuto by the collar of his shirt and kisses his cheek, dangerously near the corner of his mouth, leaving him standing there and staring at Akaashi's back as he walks away, smiling and shaking his head and so very breathless.\n \n \n \n \n \n \n \nLev buys the game anyway, because he's the softiest cupcake in the world and the actual kindest person Bokuto's met in his entire life. Kenma's playing it while sitting behind the counter at the coffeeshop, Kuroo's chin resting on his shoulder as he watches and says good job when his boyfriend beats the first boss, and it's adorable, actually, though Bokuto doesn't say that out loud because he doesn't appreciate having plastic spoons and sugar packets thrown at him.\nIt reminds Bokuto of how Akaashi had spent the previous night sitting between Bokuto's legs on the couch, his back to Bokuto's chest as he worked on his laptop, and Bokuto had been looking over his shoulder, chin resting there, his temple against Akaashi's cheek.\n \n \n \n \n \n \nThe last day's prompt is simple: a picture taken by the subject themselves. Just to make sure, Bokuto takes quite a few to give Akaashi more options to choose between, though he'll have to make do with the ugly yellow that tints every polaroid. There's the one where he's kissing Akaashi's temple, the one where he's kissing him straight on the mouth; nuzzling his throat or burying his face into his dark hair, though Bokuto likes the one where Akaashi is kissing his jaw best. Then there's the kisses against the kitchen counter with pans and pots behind them, and one that's all blurry because Bokuto had been trying to carry Akaashi while taking the pic and they fell.\nIn the end, Akaashi chooses the one Bokuto took late at night, hair down and closed eyes, hooting against Akaashi's smiling lips."
}