{
    "id": "2838050",
    "url": "https://archiveofourown.org/works/2838050?view_full_work=true",
    "author": [
        "Lindzzz"
    ],
    "title": "Safe and Distant",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "The Hobbit (Jackson Movies)"
    ],
    "relationships": [
        "Bilbo Baggins/Thorin Oakenshield",
        "Kíli/Tauriel"
    ],
    "characters": [
        "Bilbo Baggins",
        "Thorin Oakenshield"
    ],
    "additional_tags": [
        "Slow Burn",
        "hurt comfort",
        "AU - NO ONE DIES",
        "Bilbo POV",
        "Everyone knows but bilbo",
        "Thorin Is an Idiot",
        "Post BotFA",
        "Cultural Miscommunication",
        "Oblivious Bilbo",
        "Thorin is obvious",
        "accidentally engaged",
        "Fluff",
        "Thorin the biggest Schmoop",
        "King Under Shmoop Mountain"
    ],
    "language": "English",
    "series": "Part 1 of A Cultural Misunderstanding",
    "published": "2014-12-24",
    "completed": "2015-01-14",
    "words": "45,453",
    "chapters": "3/3",
    "comments": "608",
    "kudos": "16,149",
    "bookmarks": "4,293",
    "hits": "316,621",
    "summary": "<p>\"Bilbo never bothers denying that he is a slight, little bit, probably infatuated with Thorin. It’s not something that bothers him. Really. He’s pretty sure that everyone very likely has a little flutter in their chest for the dwarf. He’s something grand and unattainable. </p>\n<p>And it’s really much safer if it stays that way.\"</p>",
    "notes": "<p>This is my big old \"I'm denying all of that and covering my ears while crying\" fic. Blatant fixit in here. Also this was me experimenting with my idea that between the two of them, Thorin would NOT be the one who has serious emotional repression issues. Also my favorite Thorin is a besotted and secretly King Under Sap Mountain wreck, so there's that.</p>\n<p>I didn't even ship it. This freaking movie I swear to god.</p>\n<p>To the ROTG fans of mine: I'm not leaving one fandom for another! If anything, I'm really hoping that all this will kick me out of the huge funk I'm in so I can start picking up old projects again. You are not forgotten &lt;3</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Thanks to <a href=\"https://archiveofourown.org/users/pearlxthunder\" rel=\"nofollow\">pearlxthunder</a> for offering to beta and being ruthless with this chapter and hunting down the comma splices like an assassin 8D</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>Favorite trope is \"Thorin is not nearly as subtle as he thinks he is and Bilbo's still fucking clueless.\"</p>\n<p>All Khuzdul is based on <a href=\"https://dwarrowscholar.wordpress.com/\" rel=\"nofollow\">the writings and dictionary of neo-Khuzdul here.</a></p>\n<p>See notes at the end of the chapter for a link to the translations of what these dwarves keep saying.</p>\n<p>Edit: HOLY DANG YOU GUYS ARE ALL THE ACTUAL SWEETEST???? I want to just hug every commenter, you guys are amazing! I'm so flattered at the outpouring of love you all have shown!!</p>\n<p>Also, I mentioned this already in one reply, but ORIGINALLY I didn't plan on there being more in this universe. But then my documents magically opened themselves and a Thorin POV started appearing (surprisingly, the Thorin POV does not, in fact, consist of nothing but \"Bilbo. Bilbo Bilbo Bilbo, Bilbo. BilBO???? bil b o. BILBO! Bilbo.\" though it's a close thing)</p>\n<p>Still working on making the Khuzdul translation list. Which is actually making me wince because I'm having to reveal how godawful embarrassing Thorin is.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>\n<a href=\"https://linddzz.tumblr.com/post/108438502697/the-hell-did-he-just-say-the-khuzdul-in-safe\" rel=\"nofollow\">Direct translations of the Khuzdul are here.</a>\n</p>\n<p>Thorin has no idea how to take things slow it's literally all or nothing what a disaster.</p>",
    "text": "Bilbo never bothers denying that he is a slight, little bit, probably infatuated with Thorin. It’s not something that bothers him. Really. He’s pretty sure that everyone very likely has a little flutter in their chest for the dwarf. Thorin is just Thorin. He’s the brooding lost king you always hear about in stories, larger than life and filling every space he occupies with a solid surety that draws everything in around him. Thorin’s a magnificent legendary figure made real, walking around in Bilbo’s formerly quiet, ordinary world.He’s also a bullheaded, temperamental, arrogant moron who seems to expect that all he should have to do is lower his thick eyebrows and look Regally Angry enough to get whatever he wants. And when he smiles, rare as it is, it’s a flash of white teeth and brilliantly blue eyes. He cares so intensely and warmly, so fully and deeply, and all of it comes out in this glowing grin that tugs insistently at something in Bilbo’s chest every time it arrives.Bilbo doesn’t let himself think on that part though, and he is always very firm with himself to keep it locked down whenever anything deeper than a little flutter starts to stir. It’s better to stay shallowly infatuated with the Hero Thorin. Because Thorin is something grand and so, so unobtainable. And that’s alright, because it’s much safer that way.-------------“Thorin no, come on look at me, Thorin, look at me.” The wind is screaming with eagles and death and the ice is biting into his legs and Thorin’s blood is hot and and sticky-thick between his fingers. There’s been so much death and horror and blood and he knows someone should be looking for Fili and Kili, but all he can think about is how Thorin can’t die. He can’t die and leave a hole in the space he always filled up. He can’t leave Bilbo in a world that isn’t made more full with the existence of Thorin Oakenshield.Thorin watches him with a distant and faded wonder and smiles weakly with something warm and welcome and final, and Bilbo presses his hand down tight over the hole in Thorin’s side, grits his teeth against the stench of blood in the air and the gore under his palm.“Bilbo …” It’s a soft, rasping sigh and Bilbo refuses to hear any of the rest of it.“Don’t. Don’t you dare say goodbye to me, Thorin Oakenshield. Do you hear me? You’re not done here. You aren’t done, we aren’t done. Look at me, Thorin, look at me. Keep breathing, just stay awake, and look at me.”Thorin looks at him. His eyes are distant, and the bright blue is a dulled gray, but he does as he’s told and looks at Bilbo without asking why. He’s looking at Bilbo when talons delicately and gently scoop under them, and he’s looking at Bilbo in the air and as they land. He only closes his eyes as other hands gather him away and he’s taken into a room of cots and whispered voices. (But Bilbo holds onto his hand because he can’t let Thorin go. If he lets go then Thorin could go forever and Bilbo feels he has to keep his bloody fingers clenched on Thorin’s hand to keep him anchored here.)Bilbo’s still looking hours later, staring at Thorin swaddled up in bandages, blood wiped away, pale but breathing against the pillows. Bilbo keeps looking until the aches and pains in his body, combined with what he’s sure was some heavily laced tea courtesy of Oin, overcome him and fade everything into black.\n\n \n\n------------Thorin’s warmer to him since the goblin tunnels. Bilbo thinks he perhaps should have thrown himself at some orcs earlier, because it’s like a switch has been flipped and Thorin is calling him to sit in the middle of the group, and he actually pays some attention to what Bilbo says instead of just scowling at him whenever he remembers the hobbit exists.He’s just starting to think it’s downright peaceful when Thorin sits heavily beside him on a log and, without a word, pulls out Orcrist and begins carefully wrapping the blade tight in a leather cloth.Bilbo stares at him for a few seconds, waiting for some sort of explanation. He raises his eyebrows, clears his throat a little bit, lowers his eyebrows, then finally sighs as Thorin binds his sword.“What—”“Pull out your sword,” Thorin interrupts, finishing a knot and giving the wrappings an experimental tug. Bilbo does, still frowning, and holds the hilt awkwardly in his fist. “Okay … why did I do that?”Thorin looks up to answer, then his eyes flit to Bilbo’s hand on the hilt of the sword. He scowls like he has been personally offended and his nostrils flare with a sharp exhale. “It’s not a ladle,” he huffs, reaching out and grabbing Bilbo’s wrist in one massive hand and covering Bilbo’s fist with the other. He adjusts Bilbo’s fingers and the sword, ignoring Bilbo’s incredulous stammering as he talks. “You can’t clutch it that tightly; you’ll lose control of the blade. This is a small, quick weapon. Have most of your grip closest to the guard, your fingers loose and ready to shift so you can adjust your grip easily.”“Okay? Wait. What are you doing?”\nThorin’s sigh is long suffering, his eyes going skyward for a second at Bilbo’s apparent stupidity at not being able to automatically know what the blazes he’s doing at all times.“I’m going to teach you how to use a sword.”“Oh.” Wow. That is actually … “That’s … very nice of you actually. Considerate. Considering that I may be using this again. Later. At some point, hopefully not soon.”“My goal is to at least make sure you can use it without taking your own fool head off.” “Excuse me?” Oh, never mind any of the thanks! Bilbo is about to remind Thorin that this fool head is the one that saved his life, thank you, but he shuts his mouth on it quickly with an annoyed huff. It’s rude to point out that someone is in your debt, after all.Thorin raises his eyebrows slightly. “I saw how you flung that thing around. You were closer to hurting yourself than anything else.”Bilbo shuts his mouth with a click of teeth, thinks on it, then nods. “Right. Good point. Probably want to avoid that. So why all the … that?” He gestures to the binding on Thorin’s sword.“We don’t have wooden blades here. This is so I don’t end up accidentally hurting you.”“Oh. Good. Thank you for that. You’re not going to, uh,” Bilbo waves his sword a bit. “Just in case I—”The look Thorin gives him is absolute pity.“Oh, right, of course not, nevermind.” “Exactly,” Thorin says, standing up and pulling Bilbo roughly to his feet. “Now, what do you know of swords?”What sort of question is that? The closest thing Bilbo had held to a sword before this was a toothpick. He holds his blade before his face and makes a show of considering it, turning it to glint in the light as he weighs it in his hand. “Well, I do know, though this is mainly an academic knowledge, mind you. But I do know for certain that this bit,” he says, giving the blade a smart and certain tap with his finger, “goes into the squishy parts.”He keeps his expression very serious. Even in the face of the stare Thorin gives him, as if he has just sprouted not one, but two extra heads. Bilbo leaves him hanging for a few moments, just to enjoy the absolutely flummoxed confusion on Thorin’s usually grim features, before he grins and raises his eyebrows. “I’m not wrong, am I?”Thorin stares at him for a few more seconds, his mouth opening and shutting a few times, then he honest to gods snorts and ducks his head. Bilbo sees a flash of teeth while the dwarf shakes his head in disbelief.“No. You’re not wrong on that at least, Master Burglar.”---------------------------------------------------------------There’s the heat of a roaring fire on his face when he comes to. Warm air, scratchy cloth under his face, and a crick in his back from passing out slumped forward in the chair he’d pulled up next to Thorin’s cot. His back declares a very loud argument when he moves to sit up, and Bilbo groans at the pops and cracks. Next time he gets his own cot.He’s still rolling his shoulders and wincing when he hears rustling sheets and a small shift in Thorin’s breathing. A few wrenches in his neck loudly proclaim themselves and are ignored as Bilbo whips his head around and confirms that yes, Thorin is stirring and his eyelids are starting to flutter, though his skin is ashen and shining with fever.“Bilbo?” It’s such a lost, soft, sad little sound that Bilbo nearly scrambles up to grab at Thorin’s shoulder and shush him. “Right here. Right here, Thorin, I’m here. Lie down. Just … stay there. You got a bit banged up and a few more uh … holes … in places. Just lie down. Balin said you’d probably be feverish for a few days and—”“Bilbo?” Thorin’s eyes dart all over Bilbo’s face, wide and desperately fevered. He grabs at Bilbo’s arm, fingers scrabbling at his shirt until Bilbo places a hand over them with more flurried shushings.“Calm down, Thorin, it’s alright. Everything’s alright, just rest up and—”“Bilbo. Bilbo I’m so sorry. I can’t—” Thorin’s voice catches, rough and dry in his throat, his eyes still wide and wet and darting. “I am shamed, Bilbo. The way I acted. The things I said.”“No, shh, come on now. You weren’t yourself, Thorin. It’s alright. You were sick.”“I was wrong,” Thorin gasps, and he looks so pained, so gutted that Bilbo rubs the hand clutching at his shirtsleeve, making soft, calming sounds to try and get Thorin to ease back and stop looking so lost and horrified. “Thorin, really, stop it. It’s alright!”“I tried to kill you,” Thorin whispers, fingers nearly bruising Bilbo’s arm now. His voice hitches and cracks hoarsely.“I wanted to kill you. I couldn’t, I could never. It wasn’t—You were the only one brave enough to do what was needed and I—”“Thorin, it’s okay. It’s really okay. I forgive you. You were sick and now you’re you and it’s okay. Just calm down and—”“I was going to throw you,” Thorin goes on, breathing it, now, and shaking. “Throw you from the wall. Make you”—his face twists, pained and sick—“make you break on the stones. You. I was going to hurt you. My own betrothed and I nearly destroyed you—”“Thorin, please! Calm down and—” Bilbo stops. His mouth opens, shuts, repeats a few times before he settles on pressing his lips hard together. Thorin’s words replay back and forth a few times in his head. “Sorry, what was that?”“Forgive me, Bilbo, forgive me, please—”“Yes, yes, alright! I forgive you! Plenty of times already! Now what on earth—”“Keep it,” Thorin demands, fisting his hand in Bilbo’s shirt, eyes blazing. “The mithril, keep it.”“Yes, yes I was planning to, I don’t know why I wouldn’t—”“I’ve no right.” Thorin coughs and Bilbo is beside himself trying to calm Thorin while his chest seems to have quite forgotten where all the internal bits are supposed to go, and it’s making everything tight and difficult to breathe. Thorin goes on regardless, shaking his head firmly. “No right. No right to call you mine, Bilbo, I know, but keep it.”“Thorin, what does the mithril—”“Keep it. Bilbo …” Thorin’s grip starts to go lax, his eyes fluttering, and Bilbo’s name leaving as a sigh.“No. Nooono. No! Thorin! Don’t you—! No, do not fall asleep! Thorin! What was—”Thorin breathes out softly, sinking into the pillows and drifting off again, forehead tensed with fever dreams but otherwise lost to the waking world.Bilbo sits.Everything is all sharp and jumpy and he can’t place what the feeling is, but it feels a remarkable deal like panic, like a scream lodged in his chest. Because none of that, besides the apologies, made any sense. Thorin is sick. Thorin is confused. Something desperately beating flares in his chest, compresses his lungs and makes every breath into a short gasp. Bilbo scrubs a hand over his face and shuts his eyes, feels the air fill his chest and slowly empty, again and again, until he can let out a steady exhale and lower his hand. He tries to clamp down on the beating, shoving it back down into the safe place.There just needs to be some clarification. There’s been mistranslation somewhere, certainly. Thorin is sick. Thorin is confused. Thorin is unobtainable.----------------------“Tell me about the Shire.”It’s a warm, clear night. A rare breath where they’re far from anything chasing them and everyone is taking their time getting ready for bed. Bilbo has taken the first watch, which has been normal ever since it had been discovered how good his eyes were, and that he tended to stay up a little later anyway. The air is calm, the breeze just perfectly cool in the late spring. Thorin had sat by him without a word on the bit of rocks Bilbo had settled on, pulling out his knives to clean in the comfortable silence that has been growing into a regular occurrence.\n\nBilbo thinks it has to do with the fact that the two of them are the only ones in the group who really can be easily quiet for long periods of time. The dwarves tend to be a rowdy bunch, and sometimes one just needs a breather. \n\n\nThe silence is so comfortable, in fact, that it takes a bit for the words to register to Bilbo. He blinks, shakes himself and looks over with an apologetic twist of the mouth. “Sorry, didn’t catch that?”\n\n\n“The Shire, tell me about it,” Thorin replies, voice smooth and low. Bilbo’s come to recognize it as a sort of special conversational tone, something that only comes out in quiet moments like this, when Thorin won’t quite look up from what he’s doing.\n\n\n“Aaaahhhhh …” Bilbo trails off and blows out through pursed lips, shrugging and humming as he thinks. “That’s a bit of a general topic? There’s quite a bit to the Shire, you know. Well. Maybe not. Not compared to what all you lot have put up with. But there’s a lot to be talked about and trust me, not all of it is really all that interesting. What bits of the Shire do you want to know about?”\n\n\nThorin shrugs, a jerky hitch in one shoulder as he scrubs and buffs at one of his smaller blades with an odd amount of focus.\n\n\n“Helpful,” Bilbo says drily. “That narrows it down. If you don’t come up with a more select topic I’ll just start rattling off the names of the entire Baggins family tree.”\n\n\n“What parts do you miss?” Thorin asks, still low and strong. But there’s something a little softer in his voice. “When you think of it,” he goes on, still not looking up, “what parts come to your mind first?”\n\n\nThere’s another pause, a few moments of breathing while Bilbo thinks about it. He hasn’t really let himself do that as much lately, think about the Shire. It’s so far behind that it feels like a dream, like life has always been the travel and the road and running.\n\n\n“The woods,” Bilbo finally says, almost wincing at the wistful way his voice sighs out. “The little rivers … it’s such a small yet sprawling place. The people and homes are tucked away, but the trees are so large and the rivers so full and rushing by. There’s peace. It’s always so quiet and peaceful and there’s always light and warmth. Even when it rains, it’s soft and warm. Everything there is nurturing. It’s like the land itself is trying to take care of everyone there.”\n\n\nIt’s the land that keeps coming to him. He misses his armchair when he sits on the stones and he misses his hearth when the wind guts their campfires, but in moments like this he thinks of the wind through the trees and the bubbling sound of rivers and brooks that can be heard no matter where you stand. \n\n\nHe realizes the pause has gone on for a bit again, and he realizes that Thorin’s looked up now, hands stopped on his knives as he watches Bilbo. There’s something searching, something open and longing, like he’s drinking in every word from Bilbo’s mouth. Bilbo blinks at the open stare, and clears his throat. Thorin quickly looks away, mouth twisting oddly, and goes back to his work.\n\n\n“Why? If I may?” Bilbo asks, honestly curious. “It really isn’t the kind of place you’d be interested in.” Thorin’s head whips up, giving Bilbo another odd, searching look that makes his skin tingle, and he has to look away, break the contact and cough a bit. “I mean, I guess you could be? But it’s just … it’s such a little place. It’s small and quiet and nothing exciting ever happens there. It’s just … the Shire.”\n\n\nThorin blinks slowly, his mouth twisting again and jaw clenching a few times, before he shrugs and his face goes blandly neutral. “It’s pleasant, at times,” he says stiffly. “Hearing people tell tales of home.”\n\n\nHome. \n\n\nIt makes sense now. Thorin hanging on words of home, even if it isn’t his. Listening to how others feel of home, what they miss, what their memories are. The dwarf stubbornly sets his gaze on the horizon, eyes flitting back and forth, and it’d be a perfect replica of scanning for danger if it wasn’t for the way his throat was swallowing, his jaw clenching and unclenching.\n\n\n“Well,” Bilbo says, smiling a bit, “you’ll have some of your own I expect, at the end of this.”\n\n\nThorin looks back at him, brows furrowed. “Some what?”\n\n\n“Stories about home. You’ll be able to have some again, when we get your little mountain back to you.”\n\n\nThe silence crashes in, and Bilbo swears Thorin turns to stone. His fists clench sharply in his lap and Bilbo worries for a second that Thorin will cut himself on his blade. Thorin’s so stiff that Bilbo fears that he’s somehow angered the dwarf, but then there’s his face. \n\n\nHe looks pained. Sort of. He’s just staring at Bilbo, face still but eyes oddly frantic as he looks at the hobbit, hands clenching and unclenching between his legs. It’s such a nearly vulnerable thing that Bilbo wants it to stop, wants to break away from it, but he also wants to ask what on earth is going through that strange, dark mind.\n\n\nBefore he can figure out how to ask, or even what to ask, Thorin shoots up, bids a hurried, hoarse goodnight, and strides off back towards the camp.\n\n-----------------------------------------------------------The next time Thorin stirs into consciousness, Bilbo has found a book to very firmly distract himself with. He doesn’t realize that Thorin’s stirring until he feels the brush of a hand on his forearm that makes him jump.“Thorin! You’re awake!” He grimaces at the shrill edge to his voice and takes a few breaths. “How uh … how’re you then?”“How are you so small and soft?” Thorin asks hazily, eyes narrowed and bleary.“Oh. Good. You’re still all wonky in the head.” Bilbo sighs, swallowing nervously and fighting the urge to brush off the warm, solid and calloused fingertips on the skin of his arm. “And who’s soft?” he asks brusquely, narrowing his eyes at the prone king. “Last time I checked, I’m not the one babbling away in a fever from a lot of wounds now am I? So tell me again who’s small and soft then?”“You’re such a little thing,” Thorin says in a dazed wonder, less frantic than before but eyes still fever bright and the red splotches on his cheeks bright against his pale skin. “Such a small thing, and yet you’re so large. I don’t understand you.”“Thorin, I’m just … Bilbo. And you’re not yourself right now. I prefer this sick Thorin to the last sick Thorin, don’t get me wrong, but the fact still stands that you have no idea what you’re talking about.”“So small,” Thorin says again, “and you’re always so kind and loyal and simply good.” Thorin exhales sharply at that, brows furrowing as if that is the most confusing and incredible thing of all. “Everything you do is with goodness and warmth. Everything seems soft, but there’s steel. You’ve steel in your bones and fire in your blood. But you’re still so soft. I don’t understand. I don’t understand you.”The air’s getting too thick again, closing in, and no one describes Bilbo like this. He’s gotten used to ‘small’ and ‘little,’ but Thorin’s voice is thick with a breathy reverence. It’s like he’s describing an abstract but stunning artwork, a poem with a hidden meaning. Like something that’s most definitely not Bilbo.“Thorin … I don’t. Just stop. You’re not yourself and you have no idea what you’re saying. None. I’m just me. I’m not all … all that, with the steel and fire. I’m just Bilbo. Bilbo Baggins of the Shire.”“Don’t go,” Thorin suddenly pleads, fingers firmer on Bilbo’s arm, as if Bilbo might get up and walk away right now.“Thorin, I’m right here. I’m not leaving for a while yet, not until—”“Don’t!” Thorin repeats, sharper now. He goes on frantically, voice harsh and almost quietly manic, “You’re bigger than them. Better than them. You’re too much, too you for that place Bilbo. You’re too Bilbo. You can’t. You can’t go back there.”“It’s my home,” Bilbo whispers, chest aching and stabbing and he can’t tell if it’s at Thorin’s words, the emotions behind them, or the distant pain of the thought of the quiet, warm and sunny Shire.“I can make this home,” Thorin says, grits it out with a strange ferocious certainty, his eyes shining. It’s brilliant and burning but also so different from the burn of the dragon sickness. “I can. You should be here.”“I—”“Once, then.” Thorin’s soft again, fingers back to a brush and eyes guttering a bit from the burning, dying back down to the shining and glazed fever-gleam. “Just once.”Bilbo looks to the wall, working his jaw and blinking rapidly as he tries to sort out what’s happening. Thorin is sick. Thorin is confused.“Once before you’re gone,” Thorin says softly, voice starting to peter out into the sigh of another sleep episode.“Once wh—” Bilbo doesn’t see the hand reaching for his collar, fisting it with a shocking strength and yanking him down.It’s hardly a kiss. Not really. Bilbo nearly bashes his nose on the way down and their lips meet in more of a smushed crash than anything else. But he feels it spark down his back and dance over his skin and grab at his lungs, lighting him on fire while Thorin lets out a slow sigh and goes lax beneath him. Bilbo’s rearing back up as quickly as he was dragged down, gasping and almost wheezing with the shock of it all while he tries to process the fact that Thorin kissed him and then fell asleep.“Wh—What. What! What just—! Thorin! Thorin, wake up! Don’t you dare—No. No, you do not get to. To just—” Bilbo shoots up, shaking and stammering and … and angry. That’s it. That’s exactly what this is! Anger! How dare Thorin just—! Just do that! That there! With the kissing!He paces the room, breath coming fast and his hands scrubbing through his hair. Thorin is sick! He’s not in his right head and … what? What had he been talking about with the mithril earlier, with the damned talk of betrothed and home and staying and, and the kissing!Bilbo pivots sharply from his pacing to face the bed again and the pale, sleeping dwarf on it. He points an accusing finger sharply at Thorin, nearly shaking with the cacophony of emotions exploding everywhere. “We,” Bilbo hisses, “we … are going to have a discussion when you’re lucid again, Mister Thorin Oakenshield.”-----------------------------------“I look absurd. I’m a hobbit, not a warrior!” Bilbo sighs, holding out his arms to prove his point and wincing at the clinking chime of metal. It’s a beautiful thing, no doubt, and very kind of Thorin to give to him, but Bilbo doesn’t think he could ever be comfortable in something so glittering.It’s quiet. He realizes the dwarves are silent and watching, and Bilbo feels like he’s missing something vitally important again, because the dwarves are silent and watching like witnesses, and Thorin’s eyes are burning through him, flaming and roaring behind the expanse of his blown pupils. He’s gotten used to Thorin’s long stares, but this makes him want to shrink away, to hide, not from the strange emotions usually caught in Thorin’s gaze, but from the memory of burning orange eyes in the dark. And then Thorin’s yanking him aside, voice frantic and low and flaming still with the growl of suspicion. Even his smile is twisted. Thorin’s smile, which had before been a rare and glowing treat that Bilbo had seen a bit of when he had shown the acorn, is now a dazed and sickly thing, burning with a happiness that feels deranged and twisted. He growls and the dragon’s voice echoes in Bilbo’s ears, drowns out the sound of the dwarves marching up towards the wall; their metal clangs and clashes against stone, but it’s the dragon that Bilbo still hears.As the last of the dwarves stomps by, Thorin still stares at him from across the narrow hall, something dark in his gaze, dark and burning and glowing like the dragon’s chest did before a spout of flame.“I …” Bilbo clears his throat and quickly looks away, feeling sick with the need to run, to run away from Thorin, who is still looking, still making Bilbo feel like a small and helpless thing pinned down for inspection. “I’ll just … I’ll be …” He gestures towards the front of the hall, where the others are standing along the ramparts, and coughs again, stepping out to quickly hurry to them.Thorins hand shoots out and is an iron grip on his upper arm. Armored fingers dig so sharply into the muscle that Bilbo has to bite down on a yelp at the sharp pain of it. He’s yanked back, held firmly in place, and Thorin is looming over him, eyes incandescent.“Not you,” he says, the low, smooth voice a stark contrast to the earlier snarling growls. “You’re to go to the treasure halls.”“What? Why?” He can’t honestly be expected to guard … ?“It’s safer!” Thorin snaps, fingers digging in. “And now it’s where you belong.”“Thorin, what—”“You’re to stay there until I come to get you, is that understood?” Thorin growls, not angry, but still aggressive, dark and dangerous.“Thorin, what on earth am I going to be able to do down there? I can’t guard it all by myself.”“They will not,” Thorin hisses, pulling Bilbo in a few inches, “take anything from me. The thieves. The usurpers who would have what’s mine. I won’t let them. Do you understand me?” Thorin’s other hand comes up, gripping Bilbo’s shoulder, fingers curling into the mithril. Thorin fists the thin metal in his hand, staring over where it hangs on Bilbo’s body. His voice drops further and he bares his teeth in a feral snarl. “They won’t have anything that’s mine. Now do as I say.”Bilbo nods, mouth dry and lungs robbed of air. Thorin relaxes visibly as soon as Bilbo agrees; the hands digging painful bruises release him and rub over where they had sunk into Bilbo’s flesh, as if in apology. Thorin leans in a little, and sighs heavily. Bilbo forces himself to suck air down and not start shaking, even when Thorin lifts one hand and rests it along his jaw, the metal armor biting into his skin, and Bilbo nearly flinches at the contact.“We will speak of this later. After I’ve defended our home. Wait for me, Bilbo.”With that, he releases Bilbo, who nearly slumps to the ground in relief as Thorin marches off. He stumbles back, falls against the wall and covers his mouth to hide the terrified, pained noise that tries to claw its way up from his ribs. He walks in a daze to the treasure, the gold glowing with its own light, catching the flickering fire of the torches all around. He waits for a few hours, forces his breath to even, and feels the Arkenstone heavy and digging into his ribs.As soon as he knows it’s dark out, he snatches up one of the long, homemade ropes and heads to the front wall.\n\n \n\n-----------------------------\n\n \n\nBilbo leaves and doesn’t go back to where Thorin’s tucked away, instead wandering the mountain with shaking limbs and ragged breath. He does end up eventually going back to the infirmary, thinking to grab some of the calming tea that Oin is already well stocked up on.He nearly pours the scalding water on himself, his hands are still shaking so much, and he’s flapping his hand out in the cool air and cursing softly when he hears a soft, sweet, lyrical laugh echo through the stone halls, a delicate sound that is instantly out of place in the sharp mountain.There’s another more familiar laugh, and Bilbo follows it and the tinkling of conversation to the lit sickrooms, away from the crowded main hall filled with cots of the wounded. “A'maelamin.” Definitely not something that belongs here. It’s a womans voice, flowing and pure, and Bilbo frowns at the elvish words in the dwarven mountain. He finally places the room where the conversation is coming from and his first impression is fiery red hair catching the candlelight and a long green body tucked and curled around the small form on the bed. The elf woman, the guard from Mirkwood, curled easily on the bed that is much too small for her, her legs and arms almost forming a cage around Kili.She’s bright and giggling and smiling sweetly, but Bilbo’s reminded of a large mountain cat, protecting what’s hers from the rest of the world with soft purring and sheathed claws.“Amelamanin?” Kili tries, frowning through a smile when the elf woman laughs in delight. Bilbo’s anxiousness is dispelled completely for a bit by a rushing relief that Kili is very much alive, a profound confusion as to what the elven guard is doing braced over him and teaching him sweet elvish endearments, and a wild thought of “Does Thorin know about whatever is going on here?”“Ah, Bilbo, thank Mahal you’re here.” Bilbo’s attention is brought to the other cot, where Fili is nearly completely hidden in the swathes of bandages covering him. “Fili!” Bilbo forgets the odd pair on the bed for a second, manages to briefly forget Thorin and all … all that that’s with Thorin, and rushes over. The last time he saw Fili, the dwarf had violently kicked himself out of Azog’s grip and gone tumbling down the mountain. Bilbo runs over, grinning near to split his face with relief because that’s everyone, everyone’s alive. They’ve done it, and everyone’s made it through this madness. “Ah, thank heavens you’re alright! Well”—he clears his throat and takes stock of how completely immobilized Fili is by all the wrappings—“you’re mostly alright. Alive, anyway.”“I won’t be much longer!” Fili huffs, then winces in absolute pain at the tittering from the other bed in response. He looks up at Bilbo in misery. “They won’t stop. They keep just giggling on over there, Bilbo. It’s draining me. I can feel the will to go on leaving my broken body with every insipid little muttering!”Bilbo tsks at him and gingerly pats him on the arm. “Now, Fili, I think it’s, uh … well it’s very nice. We could use some laughing after all this.” He looks up and nearly jumps a little, because the elf is watching him now with hazel eyes that gleam like finely polished amber.The elves … unnerve Bilbo. They’re splendid and beautiful, but there’s something about their stare that keeps making Bilbo want to fidget and crawl off and sit and ask them endless questions all at once. The woman is no different, though her eyes are warmer and less piercing than the pale, icy gaze of the King. She studies Bilbo, then a slow, mischievous smile curls over her lips as she absently runs long fingers through Kili’s dark hair fanned on the pillow.“Kili was telling me about you,” she says, voice rich with amusement. “You’re the one, I hear, who stole the keys and took my captive charges out right under my watch.”Oh, is that what all the elves are going to start saying now? Bilbo clears his throat awkwardly, feeling as caught as he had done when King Thranduil had fixed him with his sharp eyes and said the same thing, though he had been far less entertained. “Yes … well, I still needed them, after all. And it’s not like they could’ve managed that well on their own.”Fili squawks an indignant protest and Kili begins stammering in offense overlaid by the brilliantly chiming laugh of the elf that had drawn Bilbo here.“Well,” Bilbo says, “my reputation precedes me again, I see, but I don’t think I was introduced to you much besides all the angry yelling and arrows everywhere?” He makes himself look up expectantly at the elf woman, for all that her easy, dangerous grace and bright eyes make him want to hide a bit.“Tauriel,” she says, the word flowing like rolling water, and Kili smiles up at her like she’s the most wonderful and amazing thing he’s ever seen. Tauriel catches his gaze and smiles back, the warmth of all the sun caught in her face, and she gazes down at the dwarf like he is life itself.Bilbo clears his throat, feeling incredibly awkward, and looks at Fili, who gives him a look that so clearly says “Now do you see?” that Bilbo has to hide his laugh behind a coughing fit.“All day, Bilbo. They’re like that for hours. I can’t take it much longer, I really can’t.”Bilbo chuckles and pats Fili consolingly on the hand. “Ahhhh, stay strong, Fili. You’ll make it through.” He grins and sits back. “It is good to see you alright, Fili. Very good. I was … well, I was worried there, for a bit.”“Can’t let my little brother run off to do whatever he likes, can I? Who knows”—Fili’s lips twist into a wry smile—“he might do something completely mad, like run off with a wood elf.”Tauriel’s laugh carries over again, and Bilbo snorts. Fili sighs in suffering, then his face relaxes, smile small but brows furrowing a little.“It’s good to see you as well, Bilbo. What of Thorin? Have you seen him? I heard he was in a bad way.”“Thorin is …” Bilbo clears his throat, rubs his hand over his face and takes a few breaths, trying to keep his voice casual and not at all like Thorin has become a source of incredible panic and earth-shattering confusion. “He’ll be alright, I expect. He’s not quite aware yet, sleeps mostly. And whenever he wakes up he—” He stops again and swallows, scrubs a hand over his face again and shakes himself while the other three watch him with mild concern. “He’s … well he’s still feverish. Oin says he’ll break through alright, but he mostly just talks, uh. Nonsense. Utter nonsense. He’ll ramble a bit and then pass back out.”Fili looks at him with such a small, sympathetic smile that a mad part of Bilbo wonders if he knows what sort of strange madness Thorin has been spewing. He shakes off that thought quickly. There’s no way anyone else could have known about all … all the nonsense.“He’ll be alright,” Kili says firmly. “He’s too stubborn to die on a cot.”Bilbo’s laugh is a little hysterical, and he quickly calms it down with a flurry of little coughs, ignoring the odd look the others give him at his outburst.“Right … right, that’s Thorin. Stubborn to a fault.”------------------------------------“You know, I think I’m actually getting the hang of this.”He says this as he awkwardly manages a flail that knocks Thorin’s slow jab to the side. Thorin raises his eyebrows and flips the sword around in his grip without a hitch. Bilbo knows he’s being babied at an almost embarrassing level. Every swing is obvious and the parries slow and steady as Thorin takes Bilbo through maneuver after repeated maneuver.Bilbo would protest for the sake of his pride, if it weren’t for the fact that he still keeps ending up knocked to the ground within minutes.“No, really!” Bilbo huffs, forcing his feet through the sidesteps and moving from parry to parry. “This isn’t so bad really. Bit like dancing. Though maybe shouldn’t compare it to that. I was always just, just awful at dancing. Did I ever—whoa!” He nearly trips over himself as he dodges another swing and laughs when he keeps his footing and blocks the secondary swing. “Aahhaaaa!” He waggles his sword in triumph, grin only growing at Thorin’s unimpressed eyebrows. “Alllmost had me there, eh? As I was saying, did I tell you about the time Arabelia Brandybuck tried to take me dancing when I was just a tween lad?”Thorin isn’t reacting at all to what Bilbo’s saying, of course. But it’s calming, in a weird way: the useless prattling makes him feel like he’s more at home. It’s a nervous habit, but something about the casual chattering makes it feel like this isn’t practice for a battle that could leave him in a very unpleasant state.“It was just … well it was terrible.” He whups again as his sword is nearly knocked from his hand. “I think I must have stepped on her feet about ten times. And she wouldn’t talk to me for days after!”“Doesn’t sound like that interesting of a girl, then,” Thorin replies easily, and it’s such a shock that Bilbo can’t begin to react to the sudden rush-in and twist Thorin does, swooping behind Bilbo and hooking a leg behind his knee to send him crashing down onto his back. He yelps when Thorin’s leather-wrapped sword points at his chest.Thorin raises his eyebrows and looks down at him. “You talk too much. I don’t even need to bother distracting you when you do it just fine yourself.”Later, there’s a small goblin raid, and there’s a white noise in Bilbo’s head that always seems to come and cover Bilbo in an oddly fuzzed, numb feeling whenever something like this happens. And there’s the usual frenzy of the dwarves working like a complicated machine. All the constant drilling from Thorin is finally coming through, though Bilbo still feels like an awkward, slashing disaster compared to the whirlwind of fury that is Thorin.He’s found his own tactic for battle, however.“And then there’s this particular move which I”—Bilbo flicks his sword lightly, knocking the goblin’s spear and jumping back from the return swing at the same time—“am quite fond of! Now then what you usually do as a counter—” He jumps back again. “Noooo! No, no, not like that. You need to answer it with a Handrilian Guard Parry!”There is no such thing as a Handrilian Guard Parry. Bilbo hasn’t the slightest idea what he’s talking about; he’s barely somewhat functional with a sword now after a few months of practice with Thorin. But the goblin stops and stares at him with its face twisted up in what Bilbo assumes is confusion.Bilbo keeps his sword up, waiting to see if the goblin will lower its guard a bit. “Now, now you see, what you need to do is, uh. Well, your footwork. Your footwork is just atrocious.” Bilbo snorts and shakes his head, not moving his eyes from the goblin’s weapon. “It’s almost embarrassing, really. I would be embarrassed. I am embarrassed, actually.” The goblin squints at him, and from somewhere behind them there’s an odd choking sound.“So what you do is—”“BURGLAR!” Thorin’s voice bellows out behind him, “SHUT UP!”Bilbo jumps a bit, but the goblin’s head whips around in confusion, enough of a pause that Bilbo can lunge forward and shove his blade through its chest with a yell.\n\n\n \n\n\n\nHe takes a bit of effort to yank the sword free, making a face at the wet, sloppy crunch it makes on the way out. When he looks up, Thorin is standing there staring at him like he’s the maddest and most unnerving thing he’s ever seen.\n\n\n“What,” Thorin sputters, “in Mahal’s name, is a Handrilian Guard Parry?”\n\n\n“What? Oh. That.” Bilbo looks down at the goblin, sniffs, and shrugs as he looks back at Thorin. “Haven’t the slightest idea. He didn’t either, though.”\n\n\nThorin stares at him for a few more seconds in complete, amazed shock. The laugh that comes out of him seems to startle him even more, and for a few seconds he seems more confused by that than anything else, until Bilbo grins and starts chuckling back, and soon Thorin’s leaning on his sword and laughing hard enough to shake his solid frame.\n\n\n \n\n-------\n\n \n\nOnce, Bilbo happens—completely by accident, mind you—to wander down close to where Thorin’s holed up. He can hear whispers of other voices, the splash of water, muttered curses and rustles of cloth and assumes that Thorin’s bandages are being changed. “Hold him down now, never was the best patient of mine, even when he’s lucid. Especially when he’s lucid.” Oin’s voice drifts to him, and Bilbo can’t help but smile. He’d seen a bit of Thorin’s reaction to fussing: snarling angrily and batting everyone away after the eagles had dropped them on the Carrock. As if he thought he would be just fine walking off getting thrown around by a warg like a chew toy. That lasted until he ended up collapsing again, as Gandalf had predicted with a surly mutter.“Bilbo …” Thorin’s voice, so small and faint where it’s usually demanding and sure, breaks Bilbo from his thoughts.“And will someone find Master Baggins already?” Oin sighs, and Bilbo feels a jolt of panic. There’s cool metal around his finger before he’s even aware he’s reaching for the ring, enveloping him in surreal light as he quickly hurries away from the dwarvish mutterings and the soft whispers of their King.It’s tempting to keep the ring on. Sometimes all he wants to do is disappear and wander as he pleases where no one will talk to him or ask him questions or make him think about unpleasant ideas that make his chest constrict painfully. But each time he considers giving in, there’s another wilder panic that arises, screaming against it, screaming at him to throw it away.He yanks the ring off, inhales cool air on the rubble outside the main gate of Erebor, and shoves the ring into his pocket.It’s also tempting to leave before Thorin wakes up. To write a little note. Something heartfelt and easy and polite. It’s been a wonderful time, minus the screaming and the fire and all the death. Really had a fantastic time almost getting killed on several occasions. Would love to do it again. Come by anytime, tea is at four. Don’t bother knocking. Your friend, Bilbo.It would be easier. Turn away, flee on his pony and start the long journey home. He’d leave in friendship and leave Thorin to his mad, fevered babblings. Leave Bilbo to his fantasy of the unobtainable dwarven king, made to be admired from afar. Out of reach, out of possibility, simple and uncomplicated. He would be safe to tell tales of the dashing, dark-haired dwarf that everyone could fall a little in love with, because that was what one did with legends. And he could pretend that his nice and easy little world hadn’t been upended by mad talk that he couldn’t even fully trust.He fingers the cool metal collar under his shirt. The mithril is so lightweight that he sometimes forgets that he’s wearing it, and it’s become a regular part of his outfit. He wonders, briefly, how he’d look to the folks in the Shire. His hobbit shirt and breeches, dirty and threadbare now, the buttons on his lovely deep green vest mostly gone. A shining shirt of priceless metal, a scuffed-up and soot-smeared jacket from the men of Lake-town, far too large and belted shut with a thick dwarven belt, an elvish blade hanging from his hip.“Not the least bit respectable,” he whispers with a small smile, and turns to walk back into the mountain.-------------------------“It is a good blade, even if it is a bit small.”Thorin’s sitting so close to him that their shoulders are brushing: a bit of warmth in the cold, dank cabin of Lake-town as they wait for night to fall.“Even if a letter opener is the only weapon we’re left with right now?” Bilbo asks mildly, still feeling just a little proud that he’s the only one who managed to keep a hold on his sword, which he’s gotten very fond of.Thorin’s lips twitch up at the corners. “I don’t worry so much about the length of the blade. I worry much more about the one using it.”“I should shove you back into the barrels!” Bilbo snaps. “Sit in a bit of fish guts and see what you have to say about my blade skills then!”Thorin chuckles, leaning easily in his chair. “Barrels,” he says, shaking his head and smiling at the fire. “How on earth did you think of barrels? I never doubted you’d get us out of there for a second, but that was hardly the way I would have ever thought of going about it. I believe you’re the only one who would be mad and brilliant enough to escape from that elvish ponce in barrels.”Bilbo’s eyebrows shoot up, and he lays his sword in his lap, feeling an odd bubble in his chest. “You … seriously thought I was going to get you out of there? Didn’t you think I may have, I dunno, run off? Or was maybe lost, wandering the woods?”Thorin snorts, as if the very idea is hilarious, as if the oaf hadn’t spent several months bemoaning how utterly useless Bilbo was. “Master Burglar, by that point you had somehow disappeared within the Goblin King’s domain and come out the other end with no explanation and missing only a few buttons. You climb up and vanish in the woods and later you’re leaping around like you were born in the trees, cutting us all down. So when you vanished again? No, I didn’t doubt that you would pop up with no warning or reason and with an escape already in place. I’ve learned well that, when you vanish, it seems to be just before you do something unexpected and incredible.”Bilbo swallows. Blinks rapidly. Breaks eye contact and looks into the fire. “That’s … thank you. That’s very …” He looks down at his sword, wipes his face, clears his throat a few times. There’s that blasted bubbling in his chest again and he squashes it down firmly, frowning down at the sword in his lap. It’s no use, Mister Baggins, to get yourself all worked up over some praise. Don’t be that swooning fool in all the stories. No good can come of that.“I named it, you know,” he says, looking up and keeping his voice light. Thorin’s still got the little hints of a smile and raises his eyebrows expectantly.“Did you?”Bilbo holds the sword up before him, watching the way the firelight flickers and dances over the fluid curves of the blade, catching in the elvish scrawl lacing its way over it like the veins of a leaf. He feels a smile tug at his lips, a bit different from usual: it feels slightly darker, a little more confident. It settles in place when he thinks back on the spiders screaming. “Sting,” he says softly, pleased still with the title.Thorin doesn’t answer, and when Bilbo looks up, the smile is gone, but Thorin’s still staring at him, looking surprised but strangely intense. Bilbo looks away quickly and clears his throat. “I got the idea from the spiders,” he says quickly. Then he realizes that he could only hear them speaking while he had the ring on and quickly adds a lie. “From … y’know. Their stingers. I got one in the trees and the idea hit me.”“You killed one of the spiders?” Thorin asks, voice unreadable.Bilbo clears his throat awkwardly. “I … wasn’t really counting them. Actually.”Thorin’s eyebrows go up.“Well it’s a lot easier to manage if you don’t go shouting and charging at them!” Bilbo points out, feeling pinned under the fierce look Thorin’s got trained on him. Thorin blinks, then sits back with a huffing exhale of a laugh, shaking his head. “And the surprises never cease,” he says, almost to himself, before pushing up out of his chair and giving Bilbo’s shoulder a quick, friendly grab as he walks by. “It’s a good name, Master Baggins. I’ve no doubt it’s earned it in your hands.”-------------------------------------Three days of wandering the mountain and Dale have passed by when he hears that Thorin’s actually awake. He’s been sneaking around so well that word doesn’t even get to him directly, but is overheard as he sits tucked within a small pile of rubble. An exchange of words from unfamiliar dwarf voices that drift off as they continue walking.Bilbo taps a sharp, rapid beat against his knee and he chews his lip, heart suddenly pounding near out of his chest. Thorin’s awake.Thorin’s awake, and no longer madly babbling, and Bilbo can finally get an explanation for all this rush of confusion he’s been thrown into. It’s what he’s been waiting for, pacing around in anticipation of it, for three days. But now that it’s here, now that his answers are so close, he’s paralyzed and staring at his knees with growing frustration.He could pretend none of it happened. That’s a good option. He could just smile and say it’s good to see Thorin back to himself, and he could slip back into the way it was.“Not bloody likely,” he mutters with a grimace. Thorin had to go and stir things up, had to make Bilbo wonder, and now Bilbo has to go up and face what will probably be either complete confusion or awkward rejection. At least he can count on Thorin to try and do it gently.He can still be angry that he has to do this at all, though.“Right,” he snaps, nodding to himself and shoving himself up. “Right,” he repeats, marching firmly into the mountain. He knows enough of the maze-like passages by now to make a straight shot for Thorin’s room, ignoring any passing friends who seem smart enough to move out of his way at the scowl he has growing over his face.By the time he reaches the door, he’s worked himself up into a nice fury, which suits his purposes just fine. Anger is fairly easy to deal with, all things considered.Thorin’s up. Sitting up against the headboard of the plain bed that was thrown together for his recovery, his entire abdomen wrapped in bandages and his skin pale, but healthier-looking than he’s been in a long time. Gandalf sits in a chair by the bed, and both look over when Bilbo storms into the room.Thorin freezes.Gandalf smiles, warm and amiable and far too entertained as he chuckles and gets up. “Well, well, Master Hobbit! Good to see you, as always.” He sweeps by, unmoved by the betrayed look Thorin gives him on the way out, as well as by the scowl Bilbo has fixed firmly on the dwarf who has made his life hell for the past three days. Bilbo only huffs as Gandalf pats him on the shoulder. “I’m sure you two have much to discuss.” The wizard chuckles, putting on his hat and laughing as he goes out the door.The door shuts, and Bilbo scowls on. Thorin actually fidgets, which in any other situation would be hilariously out of the ordinary, but now he plucks at the blanket and watches Bilbo warily and it just makes the hobbit want to knock that fool, troublemaking head a bit more.“Right,” Bilbo says, taking a deep breath and stalking towards the bed. “Right then. Mister Thorin Oakenshield.”“Bilbo,” Thorin replies cautiously, watching Bilbo’s approach like he would a hostile combatant. His face is unusually schooled, or at least it looks like he’s trying for schooled and collected. “It’s … good to see you are well.”“Don’t,” Bilbo snaps, now standing next to the bed. “Don’t. Give me that. You.” He points at Thorin, who eyes his finger like it’s a sword. “You. You kissed me.”Thorin blinks, very slowly, and his face is blank as he hesitantly looks up at Bilbo. “No I didn’t.”“Oh yes you most certainly did!” Bilbo yells. “Trust me on this one, I was actually awake for it!”Thorin swallows and just looks up miserably at Bilbo.“Just … where is this coming from?” Bilbo goes on, feeling the panic grab his chest again. “You pulling that! And everything else you were spouting off! I nearly watched you die and I had to deal with that, I had to sit there and hold your insides in where they’re supposed to be and I had to deal with that and then—you! You!” Thorin’s wide eyes are unreadable, and the rage leaves Bilbo in a rush so sudden and wiping that his knees weaken and he sits heavily on the edge of the bed, scrubbing a hand over his face as it all rushes over him. The terror of Thorin’s rage, the rush of seeing him back out, out of his king’s regalia and sword back in hand. Terror again as he heard Thorin’s rattling breath and felt the blood pushing up against his palm.“You nearly died up there,” he says weakly. “You nearly died and I didn’t … after everything else, I’d never thought of you dying at the end. You were always supposed to … to just be. Somehow. And I never took a chance to even think of, of any of that!”“Any of what?” Thorin asks, voice quiet.“This!” Bilbo snaps again, waving his hand generally at Thorin. “You! You kept waking up and, and saying things! And then in the mountain you were all—” He hears Thorin’s sharp intake of breath right as the cold memory grabs at him, and Bilbo shakes himself off, mentally brushing all that away. “You haven’t been you. It’s all too much. It’s all too much at once.”He feels his eyes burning and quickly scrubs them with the back of one sleeve and tries to get control of his breathing. But he just can’t. He can’t deal with any of this or even get a chance to sit and breathe and think.The hand in his lap is enveloped by a large, warm, calloused palm, thick fingers curling gently around his, and his breath is stuck in his lungs and refuses to budge or do anything useful.“I meant it,” Thorin says, voice soft. Softer than Bilbo’s ever heard before. “All of it.”Bilbo chances a look out the corner of his eye and instantly regrets it. Thorin’s leaning forward, reaching out to hold his hand, and his eyes are too bright, too full of … of everything. They’re full and warm and sparkling and fully directed at Bilbo.“Thorin—”“I meant all of it,” Thorin repeats, now reaching forward and taking Bilbo’s hand in both of his, covering it completely and pulling it closer to him as he looks up at Bilbo with a reverence that the hobbit can’t begin to accept. “Bilbo, even in my deepest madness, in my darkest time when I thought my kin were against me, I never thought to suspect you. Even then, through the sickness, I knew there was no darkness in you, that you were nothing but good. I’ve known it for a long time now. You’re the most … good, warm, and bright thing I’ve ever known. And that knowledge and surety stayed strong even against the dragon’s curse.”“You never said anything,” Bilbo points out faintly.“I had a few other things on my mind.” Thorin’s smile is wry. “There were several more pressing concerns than love or romance.”Bilbo hadn’t prepared himself for actually hearing Thorin say the word, and the sound he makes is embarrassingly pained and strangled. This doesn’t happen. This is against everything he’s built up, everything he’s worked to keep down, and now it’s like a war hammer beating against his chest. “You … called me your, uh.” He swallows and looks away, swallows again when Thorin’s large hands press in more around his one small one. “Your, uh … betrothed. When you first woke up. Something with the, uh. Mithril.”Thorin winces, but doesn’t move back an inch. “An unfortunate miscommunication between cultures, and a gesture that was a bit rushed due to my state at the time.”“You … seriously don’t actually mean … that was …?”Thorin shakes his head and laughs a little breathlessly. “I gave you the second most valuable thing in my hoard, in the middle of dragon sickness, and you suspected nothing?”“I thought it was a very nice gesture!” Bilbo says weakly, voice cracking a bit on the end.“A gift,” Thorin says, staring in Bilbo’s eyes with such intense focus that Bilbo couldn’t look away if he wanted to, which he very much does. “Given, witnessed and accepted. Something of great value and symbolism. A token of binding.”“What,” Bilbo squeaks.“I didn’t mean for it to happen then. I hadn’t planned on it. I had wanted to wait, to wait until this all was passed and I could explain it. But the heart behind it was true.” The hands tighten around Bilbo’s and Thorin is leaning further, eyes alight with a wrenching, bright hope. “Bilbo, I meant it. Stay here. Stay with me. I want you here, by my side. Naiblil'âmralê …”“What does that mean?” Bilbo quakes, heart clenching up because he doesn’t want to know the answer but needs to know what word Thorin says with such hope and wonder and reverence and so much else that should never be directed at Bilbo.\nThorin finally has the decency to look a little embarrassed, though it seems a tad bit late now. “I cannot give you the actual translation. It is similar to engagement.”“You mean like. Marriage. Like married, marriage. Getting married. You, marrying me. You want to marry me.” If he says it enough times it will start sounding less insane, he's sure. \"You, Thorin, want to marry me.”“I was going to wait,” Thorin says again in a rush. “You don’t have to do anything now, Bilbo. Just stay here … stay with me. Think on it, with me.”Bilbo has to look away, has to avert his eyes from everything that’s in Thorin’s. Because he’s never, ever, dreamed of anything like this. And there’s so much in his head still. He still feels like he’s drowning in the up and downs, the yanks and tears of these past few weeks straining on him, and then this. Thorin was unobtainable. It was safe. Everything was held down and away and locked up and now Thorin, with a smile and without a care, has flung it open and sent everything rushing out like a wild autumn storm. Bilbo feels his chest constricting again, his breaths jumping into short little bursts while his eyes burn and everything is too much, too much too fast and all at once. “Bilbo?”“I can’t,” he whispers. “I can’t. Thorin I can’t … can’t deal with this. Not right now. There’s too much. I can’t. I—”There’s a small, hitched breath, and Thorins hands slowly let go and drag away. Bilbo doesn’t watch them, keeps his eyes on the floor and tries to stop his vision from swimming in front of him.“I understand.” Thorin’s voice is flat, hollow, and when Bilbo looks over, Thorin’s face matches it. Blank and staring flatly at the wall. Bilbo quickly looks away, scrubs at his eyes again with his hand, and pushes himself up. “I … I’m.” He stops, inhales and works on finding some sort of steady mental footing. “You … you’ll be a great king, Thorin.”Everything feels heavy, like he’s walking through molasses, thick and dragging and ringing in his ears as he approaches the door. He needs his home, needs his armchair and sunlight and some space where he can sit alone, collect himself and think. Think without the rush of the life of the dwarves, without Thorin’s blue eyes full of hope and so much more.He walks out the door, and pretends not to hear the ragged, wet, broken sharp breath of sound that follows him.\n“What are they taking so long for?” Thorin mutters, frowning with all the might his eyebrows can muster at Beorn and Gandalf at the other side of the cottage.  Bilbo looks up from making the acquaintance of one of Beorn’s large, quiet cows, following Thorin’s line of sight and shrugging. “It looks to me,” Balin says amiably, “Like they are taking time to discuss, like reasonable folk, whether or not Sir Skinwalker should kick us out to the Orcs.” “If he’s to cast us out then be done with it. I don’t see why Gandalf is taking so long sweet talking him.” Thorin sulks, though Bilbo would hazard a guess that ‘sulk’ is not the word Thorin would use for it. ‘Broods’, would also be an accurate description.  “Because,” Bilbo sighs, stroking Bessie’s (or so he has just named her) nose and giving it a few scratches, “we burst into the man’s home without invitation, and Gandalf has manners.” “Manners,” Thorin sneers, as if it was a particularly disgusting word and not a basic protocol for social interaction, “won’t do us much good against dragons and orcs, Mister Baggins.” (Months later, Bilbo will very nearly burst into terrified and hysterical laughter as the dragon croons “You have nice manners...”) “Well they’ll do us good now, Mister Oakenshield!” Bilbo snaps back, and he takes a moment to savor the startled look that Thorin gives him and the small approving smile from Balin. Every day Thorin opens up more around him, Bilbo is more convinced that the dwarf King was most definitely raised without being questioned much. “Which,” he goes on, “is why Gandalf is talking to him, and not you, I’d imagine.” Balin chuckles and Thorin narrows his eyes at both of them, then sends the full force of his glare back at the Wizard and bear-man. “Besides,” Bilbo goes on, “I rather like Master Beorn, I think.” Thorin’s head whips around to redirect the glare back at Bilbo. “How can you have decided that?” “I was awake when he came back in early in the morning.” Bilbo shrugs. “After the...well...admittedly awkward introductions, we had a nice chat about gardening.” Thorin looks dumbfounded, and angry because he is dumbfounded. “Gardening?” He asks, lips curling in sneered disgust. “Yes, Thorin. Gardening!” Bilbo throws his hands up a little, having finally decided that he has had quite enough of this attitude. Thorin may have deemed him worth being considered part of the group, and hasn’t slacked in treating him like he does belong, but he also hasn’t dropped the habit of finding Bilbo just to needle and scoff at him whenever the dwarf’s mood drops. And Bilbo is quite done with being nervous and desperate for approval, thank you very much. “And you didn’t think, in this fine little chat of yours, to actually ask him if he would assist us?” Thorin grits, looming over Bilbo with all the menace that, a couple months ago, would have prompted several apologies or just a quiet acceptance. Bilbo squares his shoulders and glares right back up into the posturing anger of the Dwarf King. “No! I liked his garden! It is a very lovely garden, and no one who takes that much care of the plants or animals in their care can be all that bad, so I decided he would probably be alright to try chatting with. And he was! And he gave me some wonderful tips on how to get better results from my strawberry patch and how to keep the bugs off my roses! And it was lovely and I fully intend on inviting him for tea after all this is done!”  Thorin twitches back a little,“You’re going to invite the bear for tea?” He says slowly, the unspoken ‘you grand idiot’ clearly dripping from every word. “I-!” Bilbo starts, voice raising until he stops and realizes that they’re attracting an audience. The other dwarves are nervously eyeing the pair of them, then quickly glancing away when Bilbo notices. Balin has conspicuously made himself distant from them, sitting now and talking quietly with his brother a few feet away.  “I,” Bilbo goes on, lowering his voice, “am going to invite Beorn to tea, and I imagine he would not be a bear for it. Because that is what I do if I think someone is pleasant company. And Beorn, unlike some currently present, is very pleasant company!” Thorin huffs, crosses his arms and leans against a wooden post. “I don’t trust him.” He mutters. “Oh yes, that’s a shocker.” Bilbo snorts.  Thorin pauses, blinks the glare away and replaces with with a more confused, thoughtful frown. He tilts his head towards Bilbo, brows furrowed. “What do you mean by that?” “I mean, Thorin Oakenshield, that you don’t trust anybody.” Thorin’s mouth twitches down, his shoulders tense up and his hands clench a little bit against his arms. It’s an odd expression, and Bilbo didn’t know any better he’d say Thorin was honestly offended.  “I trust you.” Thorin says finally, “I trust those who follow me.” He adds with a nod towards the other dwarves before Bilbo can ever process the first part. “The skin-walker,” he continues, voice going sullen again, “I do not trust because he has given me no reason to. Nor, for that matter, do I trust the wizard. My trust extends to those who have earned the right of it.” Bilbo opens his mouth, shuts it, tries opening it on another idea, then thinks better of it. “I-, ah. Right. Sorry.” He settles on finally, and it feels cheap except for the small nod Thorin gives.\n\n   \n\nThe silence that comes over them feels less stiff now, Bilbo goes back to scratching Bessie behind the ears, and Thorin not really glaring at anything, instead looking off at nothing in particular with his brows drawn together in thought. “You...you uh,” Bilbo shuts his mouth and tries to find the best, not awkward way to ask this. He regrets opening his mouth in the first place, but Thorin’s cocked his head to look at him expectantly so there’s no pretending he didn’t say anything. He decides it’s best just to have it all out and blurts in a rush, “You really trust me then?” Thorin lifts his brows a little, and inclines his head in a small nod, as if it were obvious. “Not at first.” He admits. “I was not sure what Gandalf had plotted out with you, or what purpose you had for agreeing to this cause. Now?” And he lowers his head slightly, something earnest and serious in the look he gives Bilbo. “With my life.”\n\n   \n\n\nThere’s an odd bubbling in Bilbo’s chest, a giddy little flutter that has him smiling with what he’s sure is the stupidest expression to ever come over his face. He quickly looks back to Bessie, and runs a hand along her cheek until he can get his face under control again. \n\n“Then….then trust me on this.” He nods to where Gandalf and Beorn are still deep in a quiet conversation. “Let them do their talking and their-” he waves a hand vaguely at them, “their manners. You can’t get everything by just demanding it. And beside, even if Beorn ends up deciding not to help, everyone can rest while they work on it. The orcs can’t get here, and everyone’s exhausted.” He turns slightly and jerks his head towards the general cabin area, where most of the other dwarves are leaning against each other or wooden posts, if they aren’t outright lying within hay piles. “Let those two haggle and be polite so we all can catch our breath before we go running again.” Thorin looks at Bilbo for a few breaths, head tilted and eyes assessing, then scans out over his dwarves, pausing on each one. A few more moments, and he looks back at Bilbo, dips his head down in a nod, and says no more until nearly half an hour later when they’re all invited to sit at the table for breakfast.\n\n \n\n---------------------------------------------------He slips away quietly, unseen and unnoticed, leaving a little note for the others saying goodbye, and that they’re welcome at any time. It feels wrong, and he can imagine their disappointed faces at his short, distantly polite message, but he can’t quite face the idea of all the fussing and goodbyes.A dragon is one thing, but emotional dwarves are a challenge that Bilbo is not mentally equipped for. Not when he’s still reeling from one draining and wringing encounter. Thorin’s words, the glow in his eyes, his warm and rough hands, follow him all the way to Dale. There’s a constant barrage of confusion and thrashing panic and questions that he couldn’t imagine tamping down enough for a proper farewell.Not to mention the main question; Did they know? Thorin had said the issue with the mithril had been a “cultural misunderstanding.”Bilbo remembers the others standing silently, watching and not saying a word as the mithril slipped over his head, and has the feeling that he managed to get himself engaged with him being the only one completely unaware. He remembers Filli’s oddly sympathetic and worried smile when he asked about Thorin, and how no one seemed to question the fact that their fevered King had been asking after Bilbo.It would fit into the madness that his life had become this past year.He had at least thought to stop in Dale to meet up with Gandalf, thinking that a Wizard could be very handy on the long journey home, for either backup or pleasant conversation. He likes Gandalf. The wizard is gruff and has his own odd habits of wandering off with cryptic mutterings, but there’s something rooted and simple and common in his grandness that puts Bilbo at ease no matter where they meet. It takes only two days of surly head shaking and disgusted mutterings for him to completely regret that decision.“And what,” Gandalf spits, as they ride at a leisurely pace through the foothills along the Anduin, “do you plan on doing exactly, when you get back to your nice, peaceful little hole in the ground?\"Gandalf says ‘nice’ and ‘peaceful’ like they’re the basest of insults.“I plan,” Bilbo grits, reins creaking in his fists, “on making a pot of tea, in a real tea pot. Then, I’m going to do some much needed dusting, sit in my cushioned armchair by a fire that won’t get blown out or rained on, and just enjoy some time to myself! And then in the morning, I’m going to weed my garden, which I’m sure is a disaster. And I’ll enjoy some quiet without worrying about what might leap out and kill me, or who’s got the next watch, or any dwarves being- being...dwarves!”Gandalf pulls out his pipe, and mutters angrily to himself as he sets to light it. Bilbo catches the words “fool dwarves” and “act before they think” and nearly stops his pony right there.“Did you know too then?” He bursts out, “Did everyone know but me?!”“Know what, Master Baggins?” Gandalf mutters around his pipe, still sounding more disgusted and done entirely than anything else.“That I got myself bloody engaged without knowing it and without anyone bothering to tell me!”Gandalf glances at him sidelong, and huffs out a puff of smoke. “I had suspected, when I saw the mithril shirt. That is not the sort of token that any dwarf would part with easily, least of all one gone mad with dragon sickness. I decided the oncoming war was a more important matter.”“Why is it that important?” Bilbo wonders, tucking his chin to frown down at the bit of shining metal he can see peeking out from under his shirt. “It’s silver steel.”“That metal,” Gandalf says impatiently, “is the rarest on this world. And that ‘silver steel’ you’re wearing was second only to the arkenstone in that horde.”Bilbo frowns, jaw setting at the fact that once again, no one tells him these things! “So no one even thought to mention their surprise then? That Thorin had just...just handed me what was apparently a dwarven engagement ring?”“Bilbo Baggins,” Gandalf snaps, as if he’s correcting a wayward student, “I’m sure you were the only one who would have been surprised about any of it!”“What!?” Bilbo tenses up so hard that the pony (Buttercup, he’s called her) tosses her head and whinnies in protest, and Bilbo spends a few minutes getting her back under control while he keeps stammering. “What do-. How-. What do you mean? What do you mean I’m the only one surprised!? It’s surprising! Thorin is-” “Thorin is not subtle.” Gandalf interrupts loudly. “He is not subtle in any matters, and by dwarven standards he was entirely and disgustingly besotted! I advised him to say something long ago on the matter to have it out and done with. And of course he wouldn’t listen to me and was convinced that the quest had to come first!”“Long what- disgust-. What? How long-”“Of all the things,” Gandalf goes on, puffing at his pipe furiously, “for him to decide to use tact on! If he had that sense of discretion in any other matter the quest could have gone far more smoothly!”  Bilbo feels a little faint, he’s sure. Besotted? Long ago? Disgustingly besotted? “This is...this is Thorin we are talking about? Thorin Oakenshield? Big? Surly? Tends to talk about being King a lot?” Completely and entirely on a different level above Bilbo? Several levels above Bilbo? “And we are also talking about me, here? The Shire Halfling? I can’t even use a sword properly, Gandalf!”“Yes, Bilbo!” Gandalf explodes, “You and Thorin Oakenshield! The two halfwits it has been my great displeasure to have to watch dance around each other like jumpy younglings! One because he’s too caught up in his grand plans of the future to think of the now, and one too caught up in his own fool insecurities to see what’s happening right in front of him!”“I’m not-” Bilbo stops, swallows and blinks rapidly. He’s really not sure what he’s protesting against at this point. Then another details strikes him. Gandalf had told Thorin long ago? Before the battle, the last time they had seen Gandalf was….”Has this….has this been going on since before we entered Mirkwood?”“Greenwood.” Gandalf snorts, “Don’t let any of the elves hear you calling it that when we pass through it, Master Hobbit. And yes.” Gandalf sighs and deflates a bit, shaking his head, and goes on more gently. “Yes, Bilbo. That at least was when I noticed that Thorin had fallen absurdly in love with you.”Bilbo has to work a bit to swallow after that. In Love. Thorin had already used that heavy word once, but Bilbo hadn’t had to hear it said by anyone with that sure finality. Thorin in love with him. His first instinct is to laugh it off because really, Thorin, in love with Bilbo. But he can’t really brush it away after Thorin had spouted out all of that…marriage talk, can he?So, there it was then. All out there. Thorin was in love with Bilbo. There was no more denying that fact, no matter how mad it seemed.Was Bilbo in love with Thorin?\n\n \n\nIt’s not a line of thought he had ever let himself wander down. He knew he was something with Thorin. He knows that his world feels brighter for Thorin’s having been in it, that Thorin’s smiles lit something up in Bilbo’s chest like the searing forges, that Thorin made him feel more like himself than he had in decades. He had been used to being Mister Baggins, the title and all that was with it. With Thorin he was Bilbo, and all that he had grown into that.But love still seemed like something that was so beyond what Bilbo could hope to reach. He still had trouble wrapping his mind around what love with Thorin would be like, still reeling from the reality of it all too much to feel safe putting those words down.“I need time on it, Gandalf.” He finally says. “Thorin’s apparently spent months thinking this out and, and very obviously planning on it. But I just...this has been within days that he threw this all on me! I need time to think. To...to sort myself out. In my own space.”Gandalf snorts again, mutters something and shakes his head, but doesn’t prod or push at it anymore.------------------------------------------------------------------------------------------“So what about Erebor?”Another quiet, calm night, another night with Bilbo sitting back against a thin tree trunk, looking up at the sky with Thorin’s quiet company. It’s the dwarf’s watch this time, and Thorin stands and leans against another section of the tree, eyes sharp and scanning as he looks out over the hills and occasionally glances back to his troupe. He doesn’t stop at Bilbo’s question, but he does pause, and slightly tilt his head down in the hobbits direction without actually looking that way.“What of it?” He asks, cautious and wary.“Tell me about it.” Thorin’s response is instant and growling. “It lies in dragonfire and ruin.”Bilbo doesn’t smack him on the leg, but it’s a close thing. “I know about all that you idiot. I’ve gotten pretty familiar with the dragons and the burning and incineration and death and ruin bits. I’m talking about before all that. What was it like?”Thorin’s silhouetted by the moonlight, so Bilbo can’t see his face. But he does see the way Thorin tenses up, tilts his head to look in Bilbo’s direction now. “What do you mean?”“I mean,” Bilbo huffs, rolling his eyes now. Dwarves. “I mean, what was it like when you were there? When it wasn’t some grand distant lost homeland but just...a home?”He still can’t see Thorin’s face, but he hears the slow, steady exhale and marks the long quiet. Thorin stares out into the distance again, face now hidden by his thick curtain of hair and the silence goes on. It drags on so long that Bilbo starts to fidget and grow uncomfortable with it, it’s a different sort than the usual calm quiet between them.He’s opening his mouth to start apologizing for prying where he shouldn’t be, because it’s really not his place, not his business, when Thorin slides down the tree and sits heavily by him, forearms braced on his knees and staring forward at nothing in particular.“Why do you care?” He asks, and there’s no blame or anger in his voice. Nothing suspicious. It’s soft and confused, almost vulnerably so, and it’s the most honest thing Bilbo’s heard from him since he had said ‘I’ve never been more wrong in my life.’“Why wouldn’t I care?”Thorin grips his hands together, tucked up and guarded where he sits. “This is not your homeland. It’s not your stories. You knew nothing of Erebor before you signed your contract to me. You have no reason to care for what it was.”“It’s a home, isn’t it? Or was.” Bilbo sighs a little when Thorin jerks his head slightly in his direction, hands tense and still not really looking at Bilbo. “I mean...honestly I don’t really need all the treasure. I’ve my house, the name of Baggins behind me, all the prestige and nonsense that goes with that. A bit of gold wouldn’t do me much good. I don’t care about all that too much. But...but it’s like I said. When I came back. This is a home, and I don’t know it but it’s your home. That’s worth this daft journey, I think. And if I’m going to be facing fire and death and ruin and all that bit, I’d like knowing why. Why it all matters so much.”More silence. When Bilbo glances over, Thorin is completely still, head angled in Bilbo’s direction, hand fisted in front of him. It drags on, grow heavy and oppressive and Bilbo starts fidgeting with the ring in his pocket. It’s become a bit of a worry stone for him, and he rolls the always warm gold between his fingertips and feels the growing tension.“Look, sorry.” He says finally, starting to push himself up to give Thorin some space. “I’m sorry it’s not...it’s not really my business.  I didn’t-”A hand grabs him by the shirtsleeve, just a few fingers grasping the cuff, and tugs him back down to where he was. Bilbo stares as he sits again, and Thorin quickly pulls the hand back as soon as he does like it never happened.“When I was small,” Thorin says, voice soft and distant in memory, “I was always sneaking out onto the walls. Or into the great mines and forges. And I was always getting into trouble, dragging my sister with me to look at the rivers of gold through the rock beneath the mountain city.”Bilbo leans against the tree, smiling at the idea of a small Thorin, willful and serious as ever no doubt. “I didn’t know you had a sister.”“Filli and Killi’s mother, Dis. And as fine a daughter of Durin as there ever was.” There’s a small puffing breath that Bilbo thinks may be a laugh, and his own smile grows. Thorin is always so terse and filling the role of company leader, that it’s easy to forget that to some of these dwarves he’s family. “Dis didn’t have the same pressure as I, when we were young. She wasn’t the firstborn, and I often used her willful spirit as an excuse to escape. It was a lot easier to sneak out onto the ramparts, to watch the clouds in the sky, if I could say I was chasing after my sister.”“I can just imagine,” Bilbo chuckles, “you as a kid. Shire’s hills you must have been the worst little handful to manage. If you were half as stubborn then…” Thorin laughs softly, and Bilbo can see how he relaxes back, hands unclenching and head leaning back on the trunk of the tree.“I did not handle direct orders well, no. And I did not take well to confinement. The mountain was always...so vast. It felt larger than the entire world. You’ll understand, when you see it. You could stand on the ground level and look up and only see neverending staircases and archways, doors and lights shining like stars within the stone, stretching forever upwards. There was always light, always warmth from the forges below. The seams of gold in the upper levels were left in the mountain, and there were great scenes of our history and legend carved into them, glowing with the light of braziers and torches all around. You would think a mountain would be cold, wet stone. But it wasn’t.” Thorin’s voice trails off as he looks out over the distance, finally adding a whisper that Bilbo doesn’t think is really meant for anyone, too lost in the memories and feel of a home long gone. “It was always warm and light and forever vast.”Bilbo’s smile only grows, and for once he doesn’t take the time to stomp down the warm flush through his chest as he watches the small smile on Thorin’s face, lit by the flickering light of the campfire a ways away.“I can’t wait to see it then.” He says gently, smiling wider when Thorin turns his head to look at him in near surprise. “Truly. It sounds wonderful, Thorin.”“It is.” Thorin says slowly, watching Bilbo with the wide, unreadable expression that he’s becoming familiar with. His eyes flit over Bilbo for a bit and his eyebrows come together just slightly, as if he’s working through several thoughts and can’t decide which to land on. His hands clench up again, tension slowly returning. “Bilbo…”“Hm? Something the matter?”Thorin clenches his jaw, mouth set in a straight line, then lets out a slow breath through his nose. He pushes himself back up to his feet suddenly, voice gruff. “Get some rest. I may have your keen eyes for the next watch, and we have another long day tomorrow.”--------------------------------------------------------\n“Who was this person you pledged your services to? This ‘Thorin Oakenshield’?”He nearly bursts out laughing. What an excellent question. After all this nonsense, after coming home to ransacking and absolute chaos hidden with polite little greetings and curious stares. That is just the question of the century.“He…..he’s my friend.” Bilbo settles on, shaking his head and adjusting his shield (he had never thought to tone himself down a bit before walking into the shire. Didn’t even cross his mind.) and walks through his door.It takes over a week before he can really say that he’s home again. One week of using the money collected during the breaking down of Bag End to hunt down at least his favorite items. His mother’s box, the chair his father had made, the stupid doilies. And he’s finding that he seems to have left what little patience he had somewhere in Erebor.“Why, Mister Baggins! I understand it’s been a difficult time for you, but I still payed good money for these here chairs I did.”Bilbo rubs his forehead and breathes in slowly. “Right yes I’m sure you did, all four coins was hard spent I’m sure.” He snaps. “But you bought those while I was presumed dead, which you can see, since I am here to want the chairs back, that I am definitely not! And I’m paying you back for them!”Rido Hartford shakes his head, with a little frown so simpering that Bilbo is almost tempted to just knock it in and be done with it. “It’s dreadful business Mister Baggins, it really is.”“Yes! Quite dreadful seeing my furniture spread all over the Shire! That was wonderful to come home to!” He shoves the four coins into the portly hobbit’s hands and grabs the chair before anything else can be said, ignoring the shocked sputtering as he storms off with his damned property.It’s a scene that’s been repeated several times over. Even when they’re more cooperative, Bilbo has trouble keeping his temper around the hobbits and their damned need to just act like everything is sunshine and roses constantly.“Why Mister Bilbo, won’t you sit down for a bit? We’ve just started putting dinner on!”Lorri Boffin is all warm smiles and her mother fusses around while Bilbo tries to think of any excuse to get away from an evening of polite conversation. “Thank you, Miss Boffin, but I really-”“You’ve gotten far too thin, you have.” The older woman interrupts, “Nasty business just nasty, these adventures. Takes the flesh right off you! Don’t you fret Mister Baggins. I’ve got a lovely pudding that everyone can’t get enough of I does. We’ll get you looking like a proper hobbit again in no time! Put all that irregularity right behind! I always did say no proper hobbit-”“I’m not a proper hobbit then!” Bilbo snaps, then instantly winces and regrets it at the shocked looks. He really can’t be taking everything out on each poor soul who crosses his path. “Sorry, Misses Boffin. I’m sorry, it’s just been-”“Oh you poor dear.” She pats him on the arm while Lori looks on with a much more forced and nervous smile. “We’re glad to have you back home and proper Mister Baggins. It must have been just dreadful, being dragged about by all them dwarves. No manners to them, none at all. But it’s all done with and over now eh? You’ll be back to yourself in no time at all, just you wait and see.”“Right.” He says weakly. That may be exactly what the problem is. He’s been more himself than he ever was, and now isn’t quite sure how to go back to being Mister Baggins. It’s wonderful, being clean and dressed in fine soft cottons and well embroidered velvets again, being able to cook his meals as he wants them with his kitchen utensils, smoking his pipe without feeling grit sunk into his skin and worrying if there may be goblin blood in the bowl of it. That’s all be lovely. But as soon as he steps out the door…“Right…” he says again. “I just need to...right. Sorry, Misses Boffin I uh, I really do have another...previous engagement. I’ll have to try that pudding some other time, I’m sure it’s delightful.”Not everyone is so forgiving of his little foray into the not-so-proper or respectable.“Mister Baggins you open this door this instant!”Camellia Sackville, second only to her daughter-in-law Lobelia in sheer unpleasantness. And outranking her in stubborn vitriol. She’ll be there for hours if he tries to ignore her. Bilbo sets his jaw and yanks open the door with a grin that is all teeth.“Why, Misses Sackville, what a lovely surprise.” He grits, and shows more teeth at the sneer on the old woman’s face.“Don’t you ‘lovely surprise’ me! After what you’ve done to our good family name!”“If I recall correctly,” Bilbo says slowly, “I didn’t do anything to the Sackville-Baggins name.” It’s a low blow, but it’s entirely worth it for the way her face contorts in shock. Always so bitter that they couldn’t get Bag End.“You have brought disgrace! Going off on adventures! You’ve changed and you’ve dragged the Baggins name into the mud with you! It’s a travesty, seeing you in this good house after you go running off with dwarves and wander back in looking like that!”Bilbo leans against the curve of his doorway and raises his eyebrows in mock interest. “Must be dreadful, so sorry about all the racket.” “I knew it was a bad match! Just knew it! Bungo running off with that wild Took woman! The name was good but there’s odd blood in that family and now-”“I’m going to have to ask you,” Bilbo says, voice soft and steady, “not to speak of my parents that way, Misses Sackville. Especially not my mother.”\n“You’re no proper Baggins! If you ask me you should have stayed lost in the wilds with that dwarvish rabble and left the house and the name to those who would honor it!”“I’m going to have to ask you to leave now.” Bilbo grits.“I won’t be leaving till I’ve spoken my mind sir! You are selfish, disrespectful, downright odd and unruly and-”“And,” Bilbo interrupts, leaning forward and baring his teeth. “I learned some very interesting things while wandering about with the dwarvish rabble. Really enlightening, it all was. Did you happen to see the sword when I came back? Lovely elvish thing it is, gotten quite fond of it. Unfortunately I’ve picked up a few bad habits from the dwarves as well. It’s really dreadful. Things like the fact that I really, really, do not take it well when my kin or my home is disrespected. It gets nasty.”He’s going to regret that. He knows he is but oh is it worth it for the way her face pales and her mouth gapes in shock. The old woman sputters for a bit before gathering her skirts and quickly hurrying away, looking back in alarm when Bilbo bursts out laughing as he shuts the door.----------------------------------------This is what their quest was for, the dragon dead, the reclaiming of the mountain, crowning Thorin as king. This is what he had signed in to see done.It doesn’t stop the sick twist of unease in his stomach, as Bilbo stands along the walkway leading up to the throne with the others. It started as a little niggling doubt, watching Thorin stare at the mountain as Laketown screamed and burned in the distance. Watching Thorin near shivering with some unnamed emotion as they walked into the treasure halls, his eyes wide and bright.Now he watches Thorin march down towards the throne, where Balin waits with the crown, and the twisting doubt grows on. The dwarf has found the kings chambers, decked himself in the layers of fur and silk and gold that swamp him in clinking finery. Bilbo feels like Thorin’s disappearing under the huge cloak, like the dwarf he’s known has been smothered away by title and fire. The steady warmth in Thorin’s eyes has been replaced by a burning, by the manic gleam and nervous clenching of his hand and set of his jaw as he marches to his throne, eyes fixed firmly on the empty space where the arkenstone should be.He should hand it to him. It’s everything Thorin wants, everything Thorin’s been grasping for. And it’s warm and heavy tucked within Bilbo’s coat and he knows he should give it to Thorin. He wants to give it to Thorin. Wants to be the one who found it, wants to see the dwarf’s face light up as Bilbo hands him the one thing he wants above all else and then-...And then what? Bilbo keeps his hands clasped in front of him, keeps his mouth shut, and keeps the arkenstone tucked away. Something is wrong.The other dwarves bow to their king as Thorin marches by each of them, his eyes not on his kin who got him here, but ever on the throne. Bilbo swallows down his unease and tilts his head as well as Thorin approaches to pass him.Thorin stops, and Bilbo sets his jaw, wondering what on earth is going on this time. He doesn’t need to bow, Thorin is a king, but not his king.He keeps his eyes on the stone at his feet, and jumps a bit when the hand comes around to rest on his back. He looks up, and Thorin jerks his head, then sets his eyes back on the throne, a hand heavily adorned with rings pressed full against the small of Bilbo’s back, steering him wordlessly up the stairs to the dias. Bilbo lets the hand guide him and blinks rapidly, feeling something knot up in his chest and join the twisting in his gut. The touch isn’t unusual, he’s been led before by a broad hand on his back. A gentle nudge here, a pat on the shoulder, a friendly clasp, a hand reaching out and pressing against him while a voice yells at him to run.This is just the first time that he’s wanted to cringe away from the touch, feeling something dark and wrong in it, instead of the usual comfort. Thorin leads him to a spot to the side of the throne and stops then, turning to face Bilbo, who frowns in confusion because he really doesn’t belong here. What on earth is he doing up here?The hand pulls away, then reaches up to grasp Bilbo by the back of the neck, grab his attention and firmly root him where he is. Bilbo’s breath stops in his lungs and his heart pounds, every instinct screaming at him to run away while he just freezes up and stares with wide eyes at Thorin’s burning gaze.“This,” Thorin says, tightening his fingers briefly to empathize his words, “right here, is where I want you to be. Whenever I’m on the throne, you’re to stand here. Is that understood?”Bilbo nods quickly, brows furrowed in utter confusion but not daring to question the huge stranger in front of him. Thorin nods, releases Bilbo, and the hobbit quickly inhales a breath, feeling oddly like he’s faced down Smaug again. As he looks up, he meets Balin’s eyes, and is stopped short by the pained look on the old dwarf’s face, the white knuckles on the crown and the sadness in his eyes as he meets Bilbo’s. Balin shakes his head, just slightly, and they both turn their attention back to the King. He watches Thorin, frowning at the idea, at the return of that tensed dread that the dragon gave him, while the crown is lowered onto his friend’s head.\n----------------------------------------------------------------------------------\nHe weeds his garden. Feels the soil beneath his hands and tries not to think about the fact that this is the only place he really can feel home. It’s hard work, most of his plants overrun by over a year’s worth of weeds and grasses. Brambles growing wild and unchecked, mints overrunning all his other herbs. But he can dig himself into the soil, ignore the cuts from thorns on his hands and focus on the green and growing in his palms. The acorn from Beorn’s garden sits in a little box on his mantle. The bear-man had smiled at it, when Bilbo and Gandalf stopped by his little house on the way back. He’d smiled and given Bilbo a whole pouch of seeds from his garden, which Bilbo cheerfully plants into the rich, black soil, while the acorn sits in it’s own box.He doesn’t think about that either. Thinks only on if he needs to water or not, on the sun on his back and the earth beneath his feet and the fact that he’s learned that if he ignores all the cheerful greetings and ‘good mornings’ that drift up from the road, no one will talk to him. He’s very firmly not thinking about the implications of that, when a crackling caw catches his attention, sharp and guttural over the soft chirping of the usual Shire birds. Bilbo looks up, and the raven looks back at him from the top of his chimney, huge and black and starkly out of place against the blue sky. The raven tilts it’s head and flutters it’s wings, making a series of odd squawks and trills. Bilbo’s not really sure if he’s supposed to understand any of it, but he remembers seeing Thorin whispering to one, months ago now, that had been sent to get Dain.“You can tell them I made it back safe.” Bilbo finally says, heart pounding and hands shaking where they grip on a handful of grass he was about to pull up. The raven chitters for a few more seconds, and he knows he’s being stared at, knows that it’s just not regular to be talking to large birds but he can’t really care as he watches the huge black wings unfurl against the bright sky and carry off one of the ravens of Erebor.Bilbo slowly breathes out, can’t get his hands to stop shaking and nervously wipes the dirt off on his trousers, fingers coming to rest nervously over his pocket and press against the circle of gold that never leaves it. It was like a dream had come and interrupted the waking world, a reminder of everything that happened. He quickly goes back into the house, feeling like he needs to escape. Escape from the memories, from the pounding of his heart and from the fact that he can’t really lose himself in his own head and books like he always had before. The house is quiet. Warm and silent and tidy. His footsteps feel like an intrusion, like an interruption to the quaint peace that he had always been able to run to when the world became too much. This had always been his haven, his escape, his calm and peace where no one talked to him. Even now, no one talked to him.He sits heavily in his chair, and it still holds him perfectly, still shields him with it’s high back and full armrests. Bilbo picks up the book he had been flipping through, a discussion on elvish dialects through the ages, and puts it down when he remembers the glowing amber eyes of Killi’s elf woman.Has Thorin found out about all that? Did Killi manage to run off with his wood elf? The clock ticks in the silence, the fire crackles against the last dregs of cold holding on to the oncoming spring. Bilbo leans his face into his palm, fingers tapping against his temple as he watches the clock. The thing had always run a little fast.Bofur would have been able to fix it. He was always going on about tinkering and fixing little things, his hands always busy whittling little designs into whatever piece of wood he picked up while telling a bawdy joke or bursting into a song. Killi would join in of course and soon the lot of them would be vying for who could be loudest and the most absurdly out of tune. Softly, under it all, as if hoping he wouldn’t be noticed, Thorin would sing quietly along, his voice steady and low and drifting sure to wherever Bilbo happened to be in the midst of the chaos.\nBilbo sits in the silence of his house, his refuge of peace, and realizes that this is the first time he’s felt lonely while in his own home.\n\n \n\n--------------------------------------------------------------------------“Are all hobbits like you?” Thorin asks one day as they ride their ponies next to each other, frowning in curious confusion at Bilbo.“What? Like what? What am I like?” He’s not really sure if he wants to hear the answer, even moreso when Thorin tenses and looks away quickly, shrugging awkwardly.“Throwing themselves at orcs and bantering with mad goblins in the middle of a fight while missing their handkerchief.” Thorin finally says, mouth twitching up at the corners, and Bilbo bursts out laughing at the very idea.“Oh heavens no!” He chuckles, still giggling when Thorin stares at him and he has to wipe the tears from his eyes as he imagines the other hobbits seeing him now. “Oh not a bit. I’m really one of the worst hobbits I’ve ever met. I mean, I haven’t even tried fixing the buttons on my vest!” That sends him into another fit of laughter as Thorin stares at him like he’s gone mad.“What do you mean, one of the worst hobbits? You’ve done nothing wrong. If anything you’ve proven your value to the company many times over.” Thorin frowns, looking displeased with Bilbo’s title of ‘Worst Hobbit Ever’ and Bilbo starts up laughing all over again.“Thorin, Hobbits don’t do grand deeds or anything dangerous! If you go to Bree you’re considered an unusual and foolhardy adventurer! I was given enough glances for always reading about adventures, I can’t imagine the scandal that erupted after I ran by yelling about going on adventures with that contract in my hand and a pack on my back. A Baggins running off with a bunch of dwarves and a wizard! They’ll be whispering furiously and in shock about it for months I expect.”Thorin doesn’t look the least bit pacified, if anything his frown deepens. “They should honor you. You have left your home and saved my life, saved us from many perils and that is not something that should be shoved aside under shame.”Bilbo waves a hand and chuckles again. “Stop flattering me Thorin, you know I can’t stand it.”“It’s not flattery!” Thorin snaps, and he looks away with a scowl at Bilbo’s surprised look and mutters furiously at the back of his pony’s head. “You’ve done much, more than I would have ever given you credit for. And now I’m convinced that you’re better than any halfling who would think to look down on you simply because you’re greater than anything they could hope to be. The fact that you should go back to a place that would put you down for bravery and-” He stops and grits his teeth, twisting the reins in his hands and scowling darkly, jaw set and eyes blazing in Bilbo’s defense.There’s that fluttering again. The damned warmth that drops over him that anyone, least of all Thorin, could ever see him as all of that. “Thorin,” He says gently, “it’s really all right. Thank you. I don’t...well I don’t think any hobbit has ever been praised by any dwarf. I’m not worried about what they may think of me, I’m glad to have come along, and your words mean far more than any of their whispering.”“You should never have to tolerate their whisperings.” Thorin snarls, then spurs his pony on, trotting to the front of the line and leaving a very puzzled and giddy Bilbo behind him.\n-------------------------------------------------------------------------------\n\n \n\nThe loneliness doesn’t leave.He loves every arch and warm wooden beam of his home, but the quiet of it presses around him and the chattering of the hobbits grates on him. At every sidelong glance he wants to yell ‘I bantered with a dragon and walked out alive! What did you do last year?’ and bites his tongue on it. There’s laughter and merry songs outside his window, sunlight filtering through the trees and the growing of green things all around his house. And he feels like it's another world outside his window.He cooks and remembers Bombur suggesting what spices to use as him and Bofur bickered in good nature over the proper way to stew rabbits, snatching the ladle back and forth from each other until Thorin yelled that he’d set it all on the fire and they could eat the burnt crisps of it if they didn’t hurry up.He remembers teaching Ori to knit, getting the yarn and sticks from some traders and taking the young dwarf through the loops and knots, wearing the lumpy gloves with a warm pride weeks later. Ori took to it with all the focused fervor of any dwarf, soon weaving dwarvish patterns and sharp, geometric blocks into a series of scarves for all of them.Gloin would always go on about his family, showing Bilbo the pictures he’d convinced the Elvin prince to give back to him and his gruff voice filled with a warm pride as he talked about his wife and ‘wee lad’ Gimli.Thorin would sit by him always by the fire, and now Bilbo remembers the looks, the gentle brushes of a hand on his back. No matter who sat where, it always ended with Thorin by him eventually, quiet and comfortable and a warm presence by his side. A curled smile as Bilbo went through the sword drills, laughing eventually at the prattling when he accepted that Bilbo really wouldn’t shut up when nervous. ‘You should never have to tolerate their whispers’ Thorin had spat, enraged at the idea of Bilbo going back to the Shire as a shame.There were long, open stares, full of something that Bilbo is now starting to understand, and he could laugh at himself when he realizes how long he’s been seeing those odd, searching and longing looks. There were warm hands holding his in a tight grip, blue eyes full of more than Bilbo could take and promises of a home, of a place to belong. -----------------------------------------“So I’m just enjoying my dinner, I even remember what it was! A trout! A bloody trout with tubers and a lemon! And then this lout,” he gestures at Dwalin, who booms out laughing at Bilbo’s flapping, “barges in all ‘Dwalin at your service, where’s the food?’”“Aye and a good meal it was!” Dwalin shouts over the ruckus, and laughs louder when Bilbo throws a bread roll at him. “So I’m already all shook up, because there is a dwarf, in my home eating my FOOD.” Killi yells something incomprehensible at that and Bilbo flaps a hand at him to shut him up, “My food, thank you! And there goes the door again! Soon enough I’m infested and you lot,” the dwarves cheer as if they’ve been grandly complimented, “Shut up! You lot! You damned lot of buffoons, then somehow ate me out of house and home in one night and start going on about dragons and fire and incineration melting the bones off my skin!”“And wondering why yer dishcloths had a lot of useless holes in them!” Bofur shouts, cackling and ducking the stick that Bilbo lobs at his head.“I told you! That was a doily, and I’m sure it still has the stupid grease stains on it from your daft fingers!”The dwarves continue laughing and sharing the night’s meal between each other, shouting praise and yelling insults as Bilbo throws his hands up at the lot of them, hardly remembering how truly furious he was that night that seemed so long ago.It takes him a few moments, in the pandemonium, and shouting and laughter, to notice that Thorin is quiet and frowning into the fire. Bilbo feels the laugh dying in his throat and watches with a puzzled furrow in his brow when Thorin pushes himself away from the group and wanders off for a brood session. “Oh now what…” Bilbo mutters, extricating himself from the rowdy throng and making his way to where Thorin is stiff backed and staring out with his chin jutted out against the night. “Thorin? You alright?”Thorins fingers tap against the heavy padding of his shirtsleeve, frowning intently. “You truly did not know we were coming?”“What?” Is that all he’s worked up about? Bilbo sometimes wonders if Thorin just finds something to brood about, if it’s been too long since his last sulk. “Well no, but-”“Gandalf told us you were with us.” Thorin says quickly, voice a furious mutter that has Bilbo’s eyebrows going up.“Well...no. Gandalf had talked to me earlier that day but I’d told him to have off. He said he was looking for someone to join on an adventure and I’d been pretty quick to send him on his way.” He chuckles to himself at remembering how well that turned out. “Next thing I know there were dwarves swarming my house and Gandalf muttering something about a mark on the door.”“He said you were willing.” Thorin grits. “I’d wondered what you were so worked up about and thought it was you trying to barter a better bargain from us. Or that you had been a fool who’d agreed to something just for the idea of the grandeur and gold without any actual idea what we were for.”“Thorin it doesn’t really matter now-”“I dragged you out here, and you did not even know what was going on when we had met!” Thorin snaps, and it hits Bilbo how deeply upset the dwarf is about all this. “Gandalf meant well, it ended up alri-”“The wizard,” Thorin snarls, “has his own agenda. I already did not trust him. And I did not trust you thinking you two were in on something together. And now I trust him even less. He’s a schemer and I do not like that he pulled you unwillingly into a quest that was not his to assign.”Bilbo goes quiet, feels something cold in his chest and swallows down a blooming disappointment. “Do you….wish I hadn’t come then?”“That’s not what I meant.” Thorin huffs, shifting uncomfortably. “You’ve proven yourself of value many times over, and I’d want no one else in my company. That does not change the fact that you were pulled in against your will by a scheming wizard who doesn’t show his true plans. Does it not trouble you, that you were turned into a pawn in this play of his that we still do not know the purpose of? That you-”“Oh would you stop with that ‘against your will’!” Bilbo sighs, and narrows his eyes when Thorin looks at him sharply. “No, shut up. I signed that contract didn’t I? I may have not known what you all were doing in my house, but I read it all, I heard your story. I signed my own name, of my own volition, to that stupid bit of paper! And it was the most foolish decision I’ve made in my life and I don’t regret it one bit. So stop using me as your latest excuse to beat yourself up, Thorin Oakenshield! Because I’m glad I got dragged out by you wild lot and glad I had some scheming wizard to pull me out of my books and into the world!”Thorin blinks at him. “...I do not beat myself up.” He says.“Mister Oakenshield I’m quite sure that you can’t go for more than three days time without finding something to skulk off and brood about.”“I don’t.” Thorin says distantly, blinking still.“Yes you do. Now come on, it’s damned cold over here and not all of us are wearing ten different layers of cloaks.” Bilbo, feeling giddy on the excitement and joy of the night, actually dares to hook his hand in Thorin’s elbow and drag the dazed looking dwarf back to the main group.It’s not until almost a year later, that he recalls Thorin’s eyes fixed on him, wide and wondering for the rest of the night, and the significant glances sent around the campfire as he pulled the surly dwarf king back to the group.\n\n \n\n----------------------------------------------------------------Gods does he miss it.He misses the noise, the rabble, the nights spent laughing around the fire and feeling life all around him. He misses the banter and the shouting and the feeling that there was no one in the world but the fourteen of them. Bilbo goes through the motions of life in his hole. He makes his tea, cooks, gardens, sits in his armchair and sketches down memories. He pulls further and further away from the other hobbits, feeling the polite conversation and cheerful distractions grating on his last nerve. He starts watching the sky for black wings.There’s a mad part of him that half hopes a raven will swoop in with dark news, with a letter of alarm that will pull him from this apathy of peace and quiet. He had never had company, not since his parents passed. He’d never really felt himself relax around others, let himself laugh loud and long or tell his own jokes. And he doesn’t know how he thought he could really go back to a life of nothing but himself after all the color and life of the dwarves filling a hole he hadn’t known was in his heart. He misses cooking with Bofur and going over new stitches with Oin. Misses the drunken jokes and the laughter.He misses the quiet moments, where it wasn’t just him now, but Thorin as well. Sitting and filling a space next to him in his moments of peace like it had been made for him. Misses being able to sit with his pipe and feel a comfortable silence as Thorin cleaned his blades or simply sat and watched the fire by him. He misses the rush of feeling all that focus on him, of Thorin’s sure confidence in him, in seeing the surprised look when he managed to make the brooding dwarf burst into laughter at some deadpanned comment of Bilbo’s.Bilbo goes through his routine, his comfort, and finds himself wishing he had Thorin there to talk to. To pour tea for and talk over translations with, to share the quiet moments where they could enjoy just their company and the quiet stories passed back and forth between them.\n He remembers the long looks, the glances between the other dwarves, the way Thorin would look at him like he was some confusing wonder that was beyond comprehension. Like everything that Bilbo was was just...something incredible.Bilbo realizes that he had become Bilbo Baggins out there, found himself in the amazed eyes of Thorin Oakenshield, and now he couldn’t force himself back into the timid mold of Mister Baggins of Bag End.He’s sitting on the edge of his bed, mithril shirt like flowing silver in his hands. It’s been kept in the bottom drawer, out of site but constantly on Bilbo’s mind. The token that everyone but him had been expecting. That Thorin said was rushed by the sickness, but still true as the heart behind it.The metal is warm in his hands, and he runs the pad of his thumb along the ornate decorations along the collar of it.“I’ve been a right fool, haven’t I?” He says quietly to himself.The house doesn’t answer him, and Bilbo looks up at the empty, quiet rooms, the silence and oppressing loneliness that stopped being a refuge when he ran out the door so long ago. The smile comes slowly to his lips, and his hands curl the mithril against his palms. And he makes his decision.\n\nHe wonders how his life got to the point where, even when given food and hot drinks and clean clothes, he can’t quite relax. The men of Laketown have welcomed them and after days of freezing water, shivering whispers in a hut, and midnight break-ins, the whole company has been taken to the Master’s home to stay in the guest halls. They’re bathed, fed, given a comfortable area to sit, and Bilbo can’t bring himself to relax and laugh and lounge about with the others, which is ridiculous because this is probably the first bit of luck they’ve managed in this entire daft mess of a quest.\n\n\n   \n\n\nHe supposes it’s hard to relax, when you’re stuck wondering if you’re going to be made into a well toasted meal the next day. If you’re a reasonable, non-dwarfy sort, that is.\n\n\n   \n\n\nSo he clutches his tankard of hot mulled wine, frowns at the opulence of the Master’s halls in comparison to the ragged feel of the rest of the town, and sits on a small couch by the window, looking out at the mountain.\n\n\n   \n\n\nThere’s a soft touch to his back, a quick press of a hand, and it’s only because Bilbo’s gotten so used to Thorin’s quiet way of saying hello that he doesn’t jump out of his skin. The first few times he did, after he was suddenly deemed a real part of the company and learned first-hand how tactile the dwarves are. He’d already adjusted to the others tendency to grab and nudge and slap in constantly friendly greetings or joking prods, but for a while Bilbo had thought Thorin was simply separated from all that. It wasn’t until after the crushing hug on that rocky peak that he realized he simply hadn’t been accepted into the fold in Thorin’s eyes, as it were. After that there was a deluge of touches; a pat here, a tap on the shoulder, a quick hand pressed to his arm in acknowledgement as Thorin rushes by. Little touches that constantly kept him aware of the dwarf’s presence.  \n\n\n   \n\n\nBy now the palm between his shoulders is hardly out of the ordinary, it’s something of a comfort. It’s concrete, warm, steadying, and so normal that it settles a bit of the tension growing in him. Bilbo glances up with a little smile and a nod, and that’s their usual greetings now. A touch, a smile, and they go on.\n\n\n   \n\n\n“I need to thank you,” Thorin says quietly, hand sliding smoothly down Bilbo’s back before pulling away as the dwarf sits by him on his little couch by the window, “for speaking on my behalf earlier.”\n\n\n   \n\n\n“What? With the-? Oh that was nothing.” Bilbo loosely waves the thanks away with a scoff. “Of course I’m going to vouch for your honor. I don’t think you’d be Thorin without it, it’s like second nature for you.”\n\n\n   \n\n\nThorin’s smile is small and easy, eyes warm and unusually relaxed. “I wish it were so easy as you make it sound. I’m glad to know you think so highly of me.”\n\n\n   \n\n\n“You take honor to a nearly pigheaded level, if I’m to be honest.” Bilbo says with a laugh, and Thorin sighs and rolls his eyes, though his smile grows a bit.\n\n\n   \n\n\n“Ah, and there it is. I knew it would only be so long before our Burglar would find a way to spin praises to insults.”\n\n\n   \n\n\n“I mean the praise and the insult, thank you. You threw yourself over a cliff to pull me up once and you didn’t even like me!”\n\n\n   \n\n\nThorin’s smile shifts into an uncomfortable grimace, arms crossing awkwardly over his chest. “I didn’t dislike you, exactly.”\n\n\n   \n\n\n“Oh come off it.” Bilbo snorts, well remembering all the disapproving glares, annoyed huffs, and passing scowls whenever he happened to make any movement around Thorin.\n\n\n   \n\n\n“I didn’t trust you. But moreso, I didn’t think you capable of the tasks that would come. As Dwalin had said, you were of the gentle folk, yet you had pledged services to me. I did not much like the idea of having what I thought was your sure, violent death on my hands.” Thorin says in a rush, fingers tapping nervously against his arm.\n\n\n   \n\n\n“So I...made you feel guilty because I was going to die?” Bilbo’s face scrunches up as he muddles over that. He really had just thought Thorin had outright not liked him in general, but then it begins making sense. Thorin was constantly scanning over his company, mentally tallying each of them after any skirmish, being the first to jump up between a possible threat and his dwarves, yelling orders to keep everyone alive and intact. Thorin took a pledge of allegiance as a mutual trust of service and protection.\n\n\n   \n\n\n“I did say I had been wrong on that count.” Thorin mutters, sinking down a little.\n\n\n   \n\n\n“Well…” Bilbo tilts his head, then nods like he’s just made some important decision. “Well you really just proved my point then. You thought even some little halfling idiot who shouldn’t have come out of his hole was your duty to protect, just because he was fool enough to sign a contract.”\n\n\n   \n\n\n“You’re no fool, Master Baggins.” Thoin says gently, smile starting to show itself again.\n\n\n   \n\n\n“No,” Bilbo grins, “I’m not. And since I’m no fool, Thorin, I can say without any foolishness, that you’re worth staking my own honor on. You deserve every bit of it.”\n\n\n   \n\n\nThorin looks like he’s considering arguing on it, then he sighs and dips his head, eyes flicking down before he turns his attention to the mountain. The small smile doesn’t move, but it turns to something more poignant and longing, as he gazes on the mist shrouded peak. Bilbo looks out with him. They’ve been watching that single mountain for months now, it hardly feels real that he’ll be finally standing on it tomorrow.\n\n\n   \n\n\nHe can’t imagine what Thorin must be feeling, him and Balin, the two that remember the daunting and mysterious mountain as home. Bilbo can’t imagine how any of the dwarves feel really, even he feels a tightening in his chest when he looks at it, and when one comes down to it, he doesn’t even have a reason to care.\n\n\n   \n\n\n“How does it feel then?” He asks quietly, “Being this close to it all?”\n\n\n   \n\n\nThorin watches the mountain for a few more silent moments, and doesn’t take his eyes off it when he slowly answers. “It feels like I may actually be able to do this. That after everything that came against me, I’ll be able to do this for my people. There is still much to do before I can say it’s done, but we came this far within the right time, and everyone is alive. I…” He pauses, works his jaw and winces a little, as if he doesn’t really mean to let this out, “am loathe to admit it, but I wasn’t sure we would get this far. I would have fought to get here to my last breath, but I couldn’t see myself accomplishing this much. Not many did.”\n\n\n   \n\n\nThat...was far more than Bilbo was expecting, and he distracts himself by pretending to blow on his cooling wine as his mind works through all of that. He never had thought of Thorin as being one do doubt anything, much less his own abilities. “Well…” he starts, hoping he doesn’t go and screw it all up, “I don’t think any of them took into account how determined you can get. You’re one of the most stubborn folk I’ve met, I think if you decide you’re going to do something, it’s going to happen. Even if all you have with you are twelve dwarves and a very lost halfling.”\n\n\n   \n\n\nThorin glances away from the mountain with a smile that grows when he looks out over his company, then back to the mountain. “I wouldn’t want anyone else behind me in this. Or beside me.”\n\n\n   \n\n\nBilbo nods, and sips on his wine. “So, what is the plan then? After we get the door open? If the dragon is gone then easy enough, but if it isn’t?”\n\n\n   \n\n\n“The arkenstone.” Thorin says quietly. “That’s why we need to get the arkenstone. And it’s why we needed a burglar. If the dragon is in there, then it is sleeping, and we only need one stone. Something that small should be easy enough to take, and with that I would be recognized as the King of Erebor, and could summon the armies of all my kin to take the beast down once and for all.”\n\n\n   \n\n\n“And you seriously think I can do that? Steal a gem from a dragon.”\n\n\n   \n\n\nThorin glances over, eyebrows up like it’s obvious. “You were able to go undetected in an Elvish kingdom for nearly a month. If you can’t steal from a dragon, I very much doubt anyone can.”\n\n\n   \n\n\n“So...that’s it then? Open the door, sneak in, get the arkenstone, kill the dragon with a lot of angry dwarves?”  Bilbo pushes on, wanting to get the attention off of him as quick as he can. It was almost easier when Thorin didn't expect anything of him, and he didn't have to worry about praise that he highly doubted he could live up to. Though Thorin puts the plan out like it's so simple, so straightforward.\n\n\n  \n\n\n“There’s much to do afterwards.” Thorin admits. “Erebor is in ruins, my people would need to be brought back, as well as any kin who would wish to come. Most importantly, I would need to bring my kin here and establish my line as King. There’s much to be done, before I can say this is finished.”\n\n\n   \n\n\nBilbo sips his wine again, even if it’s cold now, and thinks. He only signed on officially for as long as it took him to finish his job as the burglar. Technically, he could turn right around and leave as soon as he did what he was brought on for. But it feels...wrong. “Well….” He begins, then in a moment of daring, reaches out to put a hand on Thorin’s shoulder. The dwarves really must be rubbing off on him, he thinks, and even Thorin shoots a look of surprise at the casual contact. “Well, I signed on to this, and I’ll see it to the end. I may have just been taken on as a burglar, but I want to see it finished.”\n\n\n   \n\n\nThorin turns his full attention away from the mountain, and looks Bilbo over like he’s not quite sure he believes the hobbit is there. The wide grin that Bilbo has become familiar with grows slowly over his face, and he grasps Bilbo’s shoulder in one hand, right over the collar of Bilbo’s now ragged good shirt.\n\n\n   \n\n\nHe leans forward, and Bilbo tenses up at the sudden breach of space, then freezes entirely when Thorin’s forehead presses against his own. It’s only the fact that he’s seen this gesture before, shared between Thorin and his nephews, or with Balin on a few occasions, that keeps Bilbo from yanking back in alarm. Even so he’s horribly aware of how close this is; of Thorin’s large hand on his shoulder, the gentle brush of air against his cheek as Thorin exhales, Thorin’s black hair falling around them like a curtain, shutting the world out and trapping him within this bubble of just the two of them.\n\n\n   \n\n\n“When this is finished, when it’s all done.” Thorin says softly, barely over a whisper. “We will have much to discuss, you and I.”\n\n\n   \n\n\nBilbo swallows, unable to find his voice to ask what the blazes Thorin means. He’s still trying to fight past the lump in his throat when Thorin sits back again, gives a final smile and friendly squeeze of Bilbo’s shoulder, like they just shared some deep secret together, and stands up to rejoin his company.\n\n\n   \n\n-----------------------------------------------------\n\n  \n\nThe problem with deciding to leave, is that this time Bilbo can’t exactly just grab a pack and go flying out the door. Technically he could, if he really wanted to. But he knows that this isn’t some last minute run after something wild and unknown, something that he’ll be coming back from. The entire idea is to not come back, and there's a lot to consider there.\n\n \n\nHe’s definitely going to remember his handkerchief, for one thing.\n\n \n\nHis first issue is getting to Erebor in the first place. Last time he happened to have a wizard and a band of dwarves with him, and Bilbo may be an irregular and foolish hobbit, but he’s hardly a stupid one. A few drills with a sword don’t do good when you’re driving a loaded cart through mountains and forests loaded with orcs, goblins, trolls, and heavens knows what else. Adventure is all well and good, but he would rather this trip be a little more calm than his last trek to the mountain.\n\n \n\nThat problem ends up solved easily enough by a few trips to Bree. Merchant caravans of Dwarves are common enough, and he hangs around the Prancing Pony until he hears mention of travel to Dale for trade, work, and the chance to see the legendary reclaimed Erebor. After that it’s a matter of a few coins, fewer questions, and a space guaranteed for him in their caravan within a month’s time. He knows he strikes a curious figure, a gentlemanly hobbit with a cloak and an elvish blade on his hip (he’d made sure to wear Sting, not just because he feels bare without it now, but because it doesn’t hurt to let Dwarves know one is armed just for the little bit of respect it brings) asking to join up in a very un-hobbit like journey halfway across Middle Earth. But the merchants only eye him curiously, accept his coin and his offer to help with cooking, and ask no questions. And if they send a flurry of small hand signals at each other when they think he's not looking, then that's their business.\n\n \n\nIt’s something he rather likes about Dwarves. Don’t pry into their affairs, and they won’t pry into yours. Unless they have decided you’re friend-kin, then every shred of privacy goes out the door and you’re fair game.\n\n \n\nBilbo figures he’ll likely have enough of prying, nosy dwarves in his future, and a few months of quiet and suspicious dwarves doesn’t sound all that bad.\n\n \n\nSo he’s left with a month to close everything up and prepare to leave the Shire behind him. The first thing he takes care of there is his will, and that’s only a matter of stopping by the notary and having it officially written and signed that after he is gone for a year, Bag End and all that is left in it will go to his cousin Drogo Baggins, his young wife Primula, and any of their line after that. Technically, without his change to the will the estate would have gone to the next in line, but that would leave it all to the Sackville-Baggins family.\n\n \n\n“And I’d rather go on in peace with knowing that I’ve thwarted Camellia for the rest of her life. Don’t write that down by the way. Actually can you? Can we make that officially part of the will? Camellia and Logo can have my blessings to stare at Bag End all they want while their far removed cousin and his Brandybuck wife live long and happy there. Drogo’s the only other Baggins I can stand, and I honestly can’t stomach the idea of any of the rest of this absurd family living there. That should do nicely.”\n\n \n\nThe notary is a professional, and his face is blank and nothing but business as he writes everything down, ignoring Bilbo’s unseemly and petty giggling. He leaves in a final note that the passing of Bag End not be announced until the year is up, just so he can know that the Sackville-Baggins brood would spend that long waiting to snatch it up only to see it go to Drogo. It’s the best going away present he can give himself.\n\n \n\nNone of it feels real, exactly. It’s like some game, preparing for some grand step that hasn’t really sunk in as an actual event. It isn’t until he buys a large cart and two sturdy ponies (Gerda and Tilda, he decides), and begins packing up that it finally begins to dawn at him that he’s leaving this place. For good, most likely.\n\n \n\nHis books take up three trunks alone, and he hires some workers to dismantle his writing desk to make it easier to take with him. It had been commissioned for him by his father, long ago, when he first started jotting down stories and ideas or notes on languages, and he still will pause sometimes and run his fingers over where he had crudely carved his initials into the leg as a small boy, or where he had spilled ink and stained the wooden top. Besides that there’s his mother’s jewelry box, all her crochet and knitwork, a trunk of his clothes, bedding, his parents portraits, and a few other small bits and pieces with more sentiment than any real use.\n\n \n\nHis armchair is the last to go out, carefully wrapped against the elements and secured tightly into the cart alongside two barrels of Longbottom Leaf before everything is covered and strapped in. When Bilbo walks back into his hole, he has to stop for a moment to look at the space it had occupied by the fire.\n\n \n\nIt’s two days now, before he’s due to meet up with the merchants outside of Bree, and Bilbo wanders the curving rooms and halls of his home.\n\n \n\nHe loved this place, still loves it. There’s marks on one doorway where his mother had jotted down his height, the couch where he had sat on his father’s knee and heard stories of his great great grandfather Balbo Baggins, who built this home and began their proud family line. Wherever he goes, a part of his heart will always stay here, in this place that will in some way always be home. It’s not a hard thing to come to terms with, and it’s not that he regrets his choice, but he’ll miss it all the same.\n\n \n\nIf things had gone different, he could have probably stayed here in his peace and isolation, content with his books and pipe and garden. But now he talks out loud to himself and feels a pang when no one answers. He’ll have some dry remark and wish he had Bofur’s crooked grin answering him with a joke. There’s his fireplace and warmth but there isn’t a broad hand on his back, a silent greeting of contact that’s so comfortable that he doesn’t even think on it. Not until it’s not there anymore.\n\n \n\nThis place is home, will always be a home, but his heart isn’t here, and hasn’t been for quite some time. And Bilbo’s starting to think that maybe one can have more than one home in their life, and it’s alright to outgrow one so happiness can root in another.\n\n \n\n----------------------------------------------------------------------------------------------------------\n\n \n\n\nIn literally any other circumstance, he probably would have loved the elvish kingdom in Mirkwood. The deep, underground city, built within the roots of the forest, has a wild beauty that mirrors Rivendell while being completely different. Rivendell’s delicate houses and open air balconies had a precise and refined elegance that ornamented the waterfalls they were built over. Each archway and each ornate balcony was a work of art there, with flowing, intersecting lines and complex patterns that must have taken years to plan out.\n\n\n   \n\n\nMirkwood is wild and entirely organic, each home and pathway looks like it was grown from the roots around it, and Bilbo wonders if the whole thing was made that way, instead of built. There are carvings here and there, a few more practical sections of simple structures. But everything here speaks of a beauty that could go feral at any moment. And the elves here match their home, fair haired and bright eyed, quicker than the dark, languid and draping Rivendell elves. The wood elves leap from path to path, move like wild animals on the prowl, laugh sharp, joke easy, and bristle with small knives or bows and arrows wherever they go.\n\n\n   \n\n\nIt’s the danger that currently strikes Bilbo more than the beauty, as he clings to the walls and flits from nook to nook within the city. The elves seem constantly on the alert, eyes scanning everywhere they go even as they laugh and grab drinks or walk arm in arm together. After two days of trying to find some weakness in their guard, Bilbo is so drained that he nearly falls off the path a few times, and it’s only the fact that he happened to be in an empty corridor that saves him from being caught at the unseemly squawk of alarm he makes.\n\n\n   \n\n\nHe needs to sleep, he needs to find somewhere to rest, but he can’t get himself to relax anywhere in this place. It’s not that it’s hard to find safe areas, Bilbo has already managed to crawl into several abandoned little crannies or dips within the wood. But every time he lays down he can hear his heart pounding, each trickle of water, the creaks and groans of living wood, and wonders about his companions deep, deep down in the dungeons.\n\n\n   \n\n\nAfter a whole day spent just going from resting spot to resting spot he finally gives up and very carefully makes his way down. It’s a slow journey past guards and patrols, including the red haired woman who seems to make it a habit to march sharply through every few hours, eyes focused and assessing as she checks her charges. All of the elves are frightening in their own way, but Bilbo finds her the most alarming, second only to the terrifyingly calm and intense king.\n\n\n   \n\n\nEventually he makes it to the dwarves cells, and, like a magnet, he’s drawn to Thorin’s.\n\n\n   \n\n\nIt’s late, gods know HOW late, but he knows it’s late by the quiet that’s fallen over the city and the soft snoring echoing through the dungeon. Every dwarf fell asleep hours ago, except Thorin, who sits on the ground with is back to the wall, practically plastered up to the bars of his cell with his hands gripping each other tight over his bent knees.\n\n\n   \n\n\nBilbo takes in the lank hair, left to hang wildly everywhere instead of pushed back as it usually is, the deep shadows around Thorin’s darting blue eyes, and has the feeling that the dwarf has slept about as much as he has. The worry-wart has probably just finished pacing and brooding menacingly at any elf that happened to pass by, and Bilbo almost feels sorry for the guards.\n\n\n   \n\n\nAlmost, he thinks, looking at the strained lines around Thorin’s eyes, but not quite.\n\n\n   \n\n\nHe carefully settles himself down against the wall in Thorin’s nook, finding a nice little alcove area in front of the bars. It’s become a fascination, watching people with the ring on, and Thorin is a completely different level of fascinating. Bilbo can see the way each breath is carefully measured, exhaled in a burst, and drawn slowly back in. Thorin’s eyes keep flitting from outside, to each wall of his cell, then back out to take a silent tally of each cell he can see from his own, forehead constantly furrowed. He really is pressed to the bars, the metal of them biting into his upper arm and his leg.\n\n\n   \n\n\nA while ago, he had talked about Erebor and his family, his childhood, and his voice had taken an oddly strained note when he mentioned how he hated the cramped room he would be locked up in whenever he was caught wandering out too far. Bilbo remembers that now, and remembers the wild, enraged panic in Thorin's voice as the fumes of mirkwood seeped in and all he would talk about were the trees pressing in around them and the lack of air. Bilbo decides that no, actually, he doesn’t feel sorry for any elves that come under that glare at all.\n\n\n   \n\n\nThe pad of his thumb runs slowly over the ring, warm and feeling alive with some buzzing energy against his finger. He watches Thorin, and seriously considers taking it off. What he would accomplish by that, he isn't sure. Some comfort maybe? Telling Thorin that he’s working on something, he’ll get them all out of there and get Thorin out of the cramped space. But he needs to stay secret, needs to make sure there isn’t any hint that the elves should go looking for an intruder. He knows Thorin wouldn’t make a scene, but he doesn’t imagine even he could keep fully quiet if Bilbo materialized out of no where, and the hobbit can only imagine the ensuing pandemonium as soon as the others got word that he was there.\n\n\n   \n\n\nHis hand falls away from the ring, and he sighs slowly and leans back against the wall. He scoots in as close as he dares, not really knowing what he’s trying to do, but wanting to reach out and take Thorin’s hand, to stop the nervous tapping and the darting, trapped panic in his eyes. Instead Bilbo just sits nearby, feeling useless as he looks in on the caged king.\n\n\n   \n\n\nAfter a few minutes Thorin inhales slowly, then steadily begins to calm. His frown never leaves, but he leans his head back on the wall and lets his eyes shut with a long sigh. Bilbo curls up where he is and watches the dwarf slowly drift off, finally relaxing enough to sleep sitting uncomfortably up against the bars of his prison.\n\n\n   \n\n\n‘I’m working on it.’ Bilbo thinks, feeling his own eyes grow heavy. ‘I’m here. I’ll get us out. Don’t lose hope and don’t give up on me just yet. I’ll get you out.’\n\n\n   \n\n\nIt’s a mantra that he repeats every night before his vision fades, returning to the same spot each night to sleep in front of Thorin’s cell.\n\n\n \n\n-----------------------------------------------------------------------------------------\n\n \n\nHe leaves when the first bit of light is creeping into the sky, but before the sun rises, when the night begins fading into a pale and clear dawn. The acorn is in a pouch on his belt, and he picks one last harvest of mid-summer vegetables from his garden. There’s a basket of tomatoes, squashes, and sweet pepper that he packs away to snack on in his cart.  That should at least give him a few days of something fresh before it’s all tough, bland road food.\n\n \n\nThis time there’s no one to avoid goodbyes with, though a few farmers are already out, watching him with solemn and concerned disapproval as he puts on his hat, lights his pipe, and lightly twitches the reigns to get moving.\n\n \n\nHe wears a plain and sturdy shirt and deep red vest, a brown jacket folded in the seat next to him. The mithril sits under it all, warming against his skin and hidden away under fine hobbit made cloth. If it weren’t for Sting resting at his hip, he would look like any other trader heading to Bree with his pipe and broad hat in the early morning.\n\n \n\nAs he approaches the edges of Hobbiton, he pauses for one last look back at Bag End, caught in the early morning light and perfectly tranquil. Gandalf’s words from over two years ago come back to him, and he smiles and makes one small change before he clicks the ponies on.\n\n \n\nHome is behind, home is ahead.\n---------------------------------------------------------------------\n\n \n\n\n“Perhaps it is best if that stone remains lost.”\n\n\n   \n\n\nBalin gives him a pointed look, and Bilbo swallows, gives the smallest nod, and steps back. He has to take a few breaths, feeling the air swim around him because he doesn’t want to lie to Thorin, it’s been hard enough as it is so far. But he can’t just give in and give Thorin what he wants and make everything worse.\n\n\n   \n\n\nIt gets just a bit too much, and he sits heavily on a dust coated box, rubbing his hands over his face and closing his eyes. This is one of the first times he’s had a real chance to breathe away from Thorin’s shadow. He scrubs his hands over his face again and has no idea what to do. He can’t just cart the arkenstone around forever, tucked away in an inner pocket of his coat.\n\n\n   \n\n\n“You alright, laddie?” Balin asks, coming up by him, voice gentle with worry. “Y’er looking faint.”\n\n\n   \n\n\n“No. I’m- I mean yes. Yeah. I’m. I’m just.” Bilbo looks around, and does his regular check for the gold glint and hulking shadow of Thorin that seems to lurk around every corner to snap at him to follow. And every time he does the check he feels a heavy lead weight sink into his guts. He shouldn't be checking to make sure Thorin isn't nearby, not when he used to want Thorin around.  “It’s just-” He laughs nervously, trying to make it sound lighter than he feels, “I think...I think Thorin may suspect something…”\n\n\n   \n\n\nBalins bushy brows lower, and he crouches down by Bilbo. “Lad...I think if he suspected you, you’d know.” He nods his head to give another significant look, and Bilbo recalls Thorin growls of ‘I will have my vengeance’ and has to agree with him.\n\n\n   \n\n\n“I don’t know. Maybe? It’s just-”\n\n\n   \n\n\n“Just?” Balin prompts, leaning in.\n\n\n   \n\n\n“I can’t-I don’t know. I think this is the longest time I’ve been able to go without him around? I don’t know what it is. He won’t let me out of his sight, Balin!\" Bilbo stands up then, running his hands back through his hair and starting to pace in a tight circle. \"He won’t let me down to search with the others for the stone, and I thought it was because I...failed...the first time.” He clears his throat and Balin nods rapidly as he goes on. “But he isn’t...he says I don’t need to keep looking because I’ve done my part. And then there was the bit at the throne...I’m just. I’m used to him always being around and I guess it’s not new but this feels…”\n\n\n   \n\n\nHe swallows, unable to voice the tense fear that Thorin inspires now, and how completely at odds it is from the usual comfort he had come to associate with his friend. How the enveloping safety and steadiness has been completely replaced by this tense apprehension, like he’s trapped prey whenever Thorin growls a command to follow him to some new part of the mountain. Thorin doesn’t even pay much attention to him, for all he’s dragged around. It’s like Bilbo is only really noticed if he talks, or if Thorin realizes that he isn’t nearby.\n\n\n   \n\n\nBalin grimaces, eyes looking away almost guiltily as he sets his mouth in a thin line. “Lad…” He stops and runs a hand down over his beard, and Bilbo stops his pacing and looks up, noting how unusually tense the old dwarf is. “Lad you’ve done your part. You were hired to sneak into the mountain past the dragon, and you’ve done that. Your part of the contract, as far as I can see, and I wrote that contract mind you, is fulfilled.”\n\n\n   \n\n\n“What do you mean?” Bilbo asks slowly.\n\n\n   \n\n\n“I mean,” Balin says, and he stops fidgeting, looking Bilbo firmly in the eye. “I mean, you should consider heading out, Master Baggins.”\n\n\n   \n\n\n“What? No! No no, Balin-”\n\n\n   \n\n\n“Bilbo.” Balin interrupts, “The winter will set in hard soon enough, and you’ve no more duty holding you here. I’d hate to see you go but-”\n\n\n   \n\n\n“I’m not going anywhere!” Bilbo snaps. “No, Balin! This isn’t done here! I told Thorin,” He has to stop and swallow, remembering Thorin as he was in Laketown, calm and relaxed and smiling out at the mountain. “I told him...I told him I’d see it finished. I promised him I would stay until it was all done. And it isn’t yet, not while it’s like...it's all wrong. I can’t just leave now while he’s like this. He’s sick and I can’t leave. Not while Thorin-” He has to stop himself before he says ‘needs me.’\n\n\n   \n\n\nHe can’t be thinking like that. There’s nothing he can do, really. He can’t fight sickness and he carries the one item that he had hoped could help hidden away in his coat. If anything all he could do is make Thorin worse, but he can’t make himself leave. Thorin isn’t right, Thorin needs help and Bilbo could never forgive himself if he left Thorin to this sickness and madness and ruin.\n\n\n   \n\n\nBalin sighs, and shakes his head with an odd, sad smile. “Right. Of course not. Would you promise me something then lad? If Thorin-...if anything happens-”\n\n\n   \n\n\n“What are you talking about?” Bilbo asks, and Balin looks at him with this unplacable sadness. “Balin? What do you mean? What would Thorin-”\n\n\n   \n\n\n “Bilbo!” \n\n\n   \n\n\nThorin’s shout is a shock to his nerves, making every one of Bilbo’s muscles clench up. He takes a bracing, deep inhale, and forces himself to relax bit by bit against the winding tightness that begins coiling up when he turns to smile curiously at the broad shadow storming into the room.\n\n\n   \n\n\n“Oh! Hello Thorin, you need something?” He asks, smile on and voice light, placating and calm. Thorin pauses, the thunderous scowl blinking away for a brief moment as he looks between Bilbo and Balin.\n\n\n   \n\n\n“What are you doing?” He asks, frowning suspiciously at the two of them. Bilbo wants to throw something, wants to scream that this is BALIN for goodness sake! What would either of them be doing against Thorin?\n\n\n   \n\n\nInstead, he shrugs, face scrunching up in innocent confusion. “Talking, we just were having a chat. Don’t get much chance for it these days.” Balin smiles amiably and nods besides him.\n\n\n   \n\n\nThorin’s full scowl returns, though it’s slightly less dark, which is the best they generally hope for these days. “We don’t have time,” he growls, “for chit chatting. Balin, get back with the others. Bilbo, with me.”\n\n\n   \n\n\nBalin nods and walks out, back to the endless piles of gold and the very, very lost arkenstone. Bilbo smiles and keeps his step light despite the hammering in his chest as he falls in line behind Thorin.\n\n\n   \n\n\n“You sure you don’t want me down there with them? I could-”\n\n\n   \n\n\n“You don’t need to do anymore.” Thorin interrupts. “It’s time they do their part.”\n\n\n   \n\n\n“Right.” Bilbo agrees quickly, jaw clenched and fists tight at his sides as he follows Thorin down to look over the hills and hills of gold.\n\n\n \n\n---------------------------------------------------------------------------\n\n \n\nHe’s being stared at again.\n\n \n\nLuckily for Bilbo, after coming home to the Shire decked out with a dwarvish shield and a chest of treasure, is used to being stared at. And the dwarves are far less prone to gossiping.\n\n \n\nWell, he thinks they are. There is an awful lot of quiet conversation in Khuzdul going on all around him, and while he’s starting to listen for the patterns he hasn’t quite got the sharp, stacatto language figured out yet. It’s awkward, but he continues on in his cart near the back of the caravan, keeping a book out to make it clear that he isn’t interested in conversation. It’s still an odd contrast to his last experience with dwarves. Maybe it’s different, when you’re not officially part of a company? But he feels like an odd outcast.\n\n \n\nJust a few months. And it is rather peaceful. He can sit around one of the fires, smile politely, chat about the roads that day with one of the other families, and go back to his cart without any trouble at all.\n\n \n\nIt’s nice while it lasts.\n\n \n\n“Interesting sword, for a halfling to carry.”\n\n \n\nBilbo is well practiced at dissembling at this point, and only looks up in vague, innocent interest at the young dwarf sitting on the other side of the fire, acting like he’s been asked about the weather and that there aren’t suddenly about ten sets of eyes watching him with interest. It’s nearly two weeks into the trip, and he thought they had all gotten used to him. But the dwarf, who must be around Ori's age, watches him curiously as Bilbo glances down at Sting like he just now noticed it there.\n\n \n\n“Hm? What? Is it? I thought it was a bit small.”\n\n \n\n“It’s elvish.” Another dwarf, older and decorated with ornate, beaded braids, says gruffly. Bilbo is not surprised at all at the hint of disgust in his voice.\n\n \n\n“Oh! Yes. I found it in ah, in a cave. Thought it was a-”\n\n \n\n“Do you actually know how to use it?” The young dwarf asks, no insult in his voice. He’s honestly curious, watching Bilbo like he’s some odd little animal that can do tricks. Bilbo can’t really be insulted. He’s back in his finer Shire clothes, well bathed, and calmly smoking a pipe, so he hardly looks the part of a warrior. He still doesn’t really see himself as one, to be honest.\n\n \n\n“Oh a bit.” He shrugs. “I mean, I’ve done some drills? Nothing really special. It’s mainly a deterrent, you know what I mean? It also helps to distract enemies because they wonder what the bloody hell a halfling is doing with a sword, and then I can have off while they muddle it over.” He smiles, and a couple of the dwarves chuckle, while a few others narrow their eyes at him.\n\n \n\n“Halfling’s don’t carry swords.” Another dwarf states, gruff and final.\n\n \n\nBilbo glances down at Sting and scrunches up his eyebrows in concern, working his pipe between his teeth. “Well this is awkward then. I wish someone had told me that.”\n\n \n\n“Especially not elvish swords.” Says the braided dwarf, and Bilbo looks up again and tenses when he notices the number of eyes on him has about doubled. He clears his throat and busies himself by puffing on his pipe, shrugging and fighting the urge to start reaching for the sword that has caught so much interest.\n\n \n\n“Well. You know. I just like carrying it. It’s-”\n\n \n\n“A halfling. With an elvish blade. Heading off to Erebor.” The young dwarf says, the words slow and drawn out, like the pieces of a puzzle. His eyes slowly start to widen as the description seems to sink in and strike at something.\n\n \n\n“Oh hell.” Bilbo mutters. Then winces at himself. He really picked up some dreadful language hanging around with the Company.\n\n \n\nThere’s a few heartbeats of tense quiet as everyone watches him, then the braided dwarf makes an odd, excited shout and points at him.\n\n \n\n“Akdâmuthrab! You’re the Burglar!”\n\n \n\n“What? The-” Bilbo leans back, eyebrows shooting up in shock. “The what? What did you call me? I have never-! How could-”\n\n \n\n“The Burglar in the company! The halfling that travelled with King Thorin to take back the mountain!” He goes on, and the explosion of activity drowns out Bilbo’s groan of pain.\n\n \n\n“I wasn’t a very good burglar.” He mumbles, pipe tight between his teeth and feeling a bit trapped by the crowd around him.\n\n \n\n“So you were then?” The young dwarf looks like he’s about to fall into the fire, he’s sitting so far forward on the box he’s taken as a seat. Bilbo sighs heavily, sends a silent goodbye to the peace and quiet of his journey, and shrugs.\n\n \n\n“Ah. Yes. Yeah I was in the Company. Bilbo Baggins, at your service.” He admits, half mumbling it into his pipe as if he hopes no one will actually hear him. The excited flurry of Khuzdul around him proves that the effort was in vain.\n\n \n\n“Did you really fight the dragon?” The young dwarf asks, breathless and wide eyed. “In the mountain?”\n\n \n\n“What?! Did I-? No! No goodness no! Where did you-” Honestly what WERE they all saying? He bet Bofur said that, the gossiping cad. “No I didn’t fight it at all! I think I was the worst fighter of the lot of them. I just talked at it a bit.”\n\n \n\n“You talked to the dragon?” Braids asks, now leaning forward as much as the younger dwarf. “You lived. How did you manage it?”\n\n \n\n“It uh,” Bilbo coughs and busies himself knocking his pipe out a bit before puffing it again. “You just...dragon’s are easily flattered and very...polite...in their very dragonish way? You talk at them and they just...sort of talk back. It wasn’t that impressive, I just babbled at the thing until I was able to get away.”\n\n \n\n“So you really do know how to use that sword.” Youngster says smugly, as if Bilbo had tried to lie earlier.\n\n \n\n“Well, Thorin taught me a bi-”\n\n \n\nThe dwarves absolutely explode into excited shouts and exclamations of awe. Bilbo groans and rubs at his forehead. Gods there’s a migraine coming on.\n\n \n\n“You knew him, then?” One dwarf yells, practically vibrating out of his boots.\n\n \n\n“Well I was in his company so I should hope so.” Bilbo snaps. “There weren’t that many of us-” He's half tempted to say that their Hero King was the one who got them lost half of the time, but decides that it would be bad form to ruin Thorin's shining image when he's possibly on his way to marry him.\n\n \n\n“What’s he like? King Thorin?” Youngster shouts over the din, and all like that they go silent, eagerly watching Bilbo as they hang on his imminent answer.\n\n \n\nBilbo looks around, takes a slow puff, and sighs, giving up on being able to get away from any of this. “He-”\n\n \n\nHe has to stop again, watching the fire and trying to find an actual, easy way to finish the sentence. Thorin is….\n\n \n\nIncredible, hopelessly brave and noble, honorable to a fault, one of the most caring people Bilbo has met, intense, determined, tad obsessive, a complete loss with directions, stubborn, good at battle strategy, bad at overall planning, complete moron when he sets his mind to it, can take years off your life with a glare or completely melt your insides with a smile that’s all teeth and bright blue eyes.\n\n \n\nBilbo is utterly hopeless, a complete loss. He clears his throat, feeling his face heat up a bit and hopes the firelight is too dim to really show how red he probably is. “He’s...well he’s beyond description...really. It was an adventure just being in his Company, and the greatest honor any halfling could ask for.”\n\n \n\nThe dwarves all gather in closer, all breathless and eager.\n\n \n\n“Were you there in the battle? When he charged out of the mountain?” Braids asks.\n\n \n\n“I wasn’t with him then.” Bilbo clears his throat, deciding it’s probably best not to tell a bunch of idolizing dwarves about how he betrayed the trust of the great King Thorin Oakenshield. “I was fighting in Dale, but I was able to see it.”\n\n \n\nThe dwarves press in more, and Bilbo gives in. He takes his pipe and leans forward, setting his elbows on his knees and looks out at the audience that’s gathered around him.\n\n \n\n“So, what was left of Dain’s army was backed against the front of Erebor, surrounded and barely holding together. I was on the walls of Dale, and thought I was about to watch a slaughter, when from the top of the ramparts of Erebor, the war horn blew…”\n\n \n\nIt goes on for hours, telling stories of his adventures with the legendary King Under the Mountain, and he manages to completely avoid the fact that he’s heading back with plans to accept a wedding proposal.\n\n \n\n---------------------------------------------------------------------------------------------------\n\n \n\n\nHe has absolutely no trouble with the fact that Thorin is attractive. Very attractive. Kingly and noble and seemingly having a sixth sense for when to look off when the light will hit him just so and the wind will ruffle his thick black hair.\n\n\n   \n\n\nIt’s annoying at first, and not because Thorin happens to be most definitely masculine. That was never much of a problem for Bilbo, who had always been a bit more interested in the people more than anything. An attractive person was just attractive. No, the issue with Thorin wasn’t that he was an attractive male dwarf, but that he was an attractive ass. No one, in Bilbo’s opinion, should be that surly and rude, and still manage to be devastatingly handsome while going about it.\n\n\n   \n\n\nEventually it’s something of a little internal joke to Bilbo. Thorin manages to be so attractive that it becomes funny. It’ll be raining, they’ll all look like half-drowned dogs, everything’s splattered in mud as they start trying to find a way to make camp, and there would be Thorin. Thorin, with his hair curling in the damp and flung wildly about him, his face smudged with just enough mud to make him look rugged, and water dripping around his glaring blue eyes. And Bilbo would have to stop himself from bursting out laughing because really: Who looks like that? Who honestly bloody looks like that except Thorin bloody Oakenshield?\n\n\n   \n\n\nSo it goes on well enough like that for a while. Thorin glares at him and snaps at him to keep up, the sun breaks through the clouds behind him in just the right way to crown him in golden light, and Bilbo tries not to start giggling because no one actually looks like that. He manages to keep a straight face usually, and just mentally ticks off another point on his list of Reasons Thorin Oakenshield Isn’t Actually Real.\n\n\n   \n\n\nThings take a bit of a wrong turn after the eagles drop them off.\n\n\n   \n\n\n“I have never been so wrong in my life!” And Bilbo has gotten quite used to Thorin scowling and looking good with it, but he was entirely unprepared for Thorin smiling at him. Thorin’s smile is flashing teeth and steely blue eyes suddenly sparkling with warmth and affection, fine lines that Bilbo had no idea existed crinkling at the corners. It’s really unfair, Bilbo thinks, his stomach dropping in shock at that smile, because no one warned him! And it’s doubly unfair, because Thorin has a gash across his nose, blood splattered on his face, and his cheek is swelling a bit and starting to bruise, and he still looks like that!\n\n\n   \n\n\nHe’s still mentally reeling from Thorin’s smile, and therefore doesn’t have a chance to prepare himself for the extra shock of Thorin yanking him into a bone crushing embrace. Bilbo never had been one for casual contact, even with regularly attractive people, and nothing could have prepared him for the enveloping warmth.\n\n\n   \n\n\nSeveral things strike him at once, in the first few seconds of that hug.\n\n\n   \n\n\nThe first one is that Thorin is very, very solid. It’s like being held by a very warm wall. And that’s the next thing, Thorin is incredibly warm. Bilbo’s surrounded by a sturdy heat, holding him secure and tight against Thorin’s front, thick arms around his back pressing him in and then Thorin somehow pulls him in more. Bilbo can feel Thorin’s face pressed against his jaw and feel that black hair about his face as it’s shoved into Thorin’s shoulder. It’s then that the smell hits him. There’s smoke and fire and the tang of blood but under it there’s leather and metal and spice. And there’s absolutely nothing funny about this, he thinks, his stomach still down somewhere around his feet and his heart frantically trying to escape his ribs. It’s terrifying and yet he feels the overwhelming urge to curl into that embrace and bury himself against Thorin’s chest and make himself quite comfortable there.\n\n\n   \n\n\n‘Oh dear...’ he thinks, feeling the first signs of an odd bubbling in his chest as he hesitantly lifts his arms and returns the embrace. ‘This is going to be a problem...’\n\n\n \n\n-------------------------------------------------------------------------------------------\n\n \n\nHe hardly recognizes Dale.\n\n \n\nBilbo knows that with the return journey, the months in the shire, and the long haul back, it’s been over a year since he last saw it, but he still can hardly believe the change that’s taken place. The caravan trundles into the city, which he can honestly call a city now, and he stares around with wide eyes, trying to equate this hustle with the ruins he remembers. There are still crumbled buildings and sections of missing wall from the battle. There are still large sections that feel empty, not yet occupied by what’s left of the humans of laketown. But every tumble of stones and every broken down tower is swarming with a mix of men and dwarves, all shouting and hammering and sawing and hauling away to rebuild.\n\n \n\nHe manages a few quick goodbyes to the dwarves who had listened most to his stories, fends a few headbutts off and graciously accepts the hugs and makes several promises to come by for dinner. Unlike with some of the Shire folk, he honestly looks forward to it this time. But work is to be done, wares to be sold, and he finds a space by the main road where he can pull his cart over and watch the work going on around him while he tries to get himself sorted.\n\n \n\nBilbo has absolutely no idea what he’s going to do now. He had months on the road to plan it out, and never really getting something down. Would he settle in Dale for a bit first? Or just make his merry way on up to Erebor and stride in as casual as he could, oh yes how is everyone? Don’t mind him he’s just here to see if Thorin still has that whole marriage proposal offer on the table or if Bilbo should just quietly scurry back to Dale and pretend none of that happened.\n\n \n\nHe doesn’t think Thorin would take something like that back. Or he hopes. Maybe. He had wondered often, if it was too late. If his sudden departure had soured what had grown between them and he’d be returning to the awkward remains of friendship. But this was Thorin, who had spent years in Blue Mountains fixating on Erebor, who had stubbornly held on to the conviction that his little band could reclaim an entire kingdom from a dragon. This was the Thorin who chose to sit in a cell rather than put aside an old grudge against the Elf King. No, he can’t really imagine Thorin letting anything go for more than a few decades.\n\n \n\nEspecially now that Bilbo's had time to really think back on it, and remember how long ago he started seeing those soft smiles. He doesn’t have much doubt that there may still be hope with Thorin, he’s just still not sure how exactly he’s going to bring it up without feeling incredibly awkward and foolish.\n\n \n\n“I had heard rumor, that the latest traders had a bit of an odd traveler with them.” Says an amused voice by his cart, and Bilbo jumps a bit from where he was staring up at a group of dwarves carefully constructing a large arched bridge over the main road. He looks around, then grins at the rider who’s come up by him.\n\n \n\n“Bard! Or King Bard, I hear is the official title now?” Bard grimaces, and Bilbo grins wider. The man looks slightly more like a king now, wearing finer leather and clothes without a bit of holes in them, though it’s still a simple outfit. The showiest part is the crossed black arrows over the back of his long coat, and the plain golden circlet on his head.\n\n \n\n“Hate the title. Hate the ruckus that goes with it, but there’s work to be done and someone might a well make sure it happens.” Bard shrugs away any more discussion of his royalty, as if it were a dreadful, tedious thing, which Bilbo suspects he honestly thinks it is. “What brings you all the way back to Dale, Master Baggins?” Bard goes on, holding out his hand.\n\n \n\nBilbo takes it and can’t stop smiling warmly as he gives a firm shake. He and Bard hadn’t had much chance to talk in all the smuggling, hiding, chaos, and discussions of war, but he had liked him and hadn’t realized he’d honestly missed the gruff bowman. “Oh just visiting, thought I’d stop in and see how things have come along on this side of the Misty Mountains.”\n\n \n\nBard raises his eyebrows and leans back on his horse, looking over Bilbo’s furniture loaded cart with an exaggerated slowness. “Do you think you may have packed a little lightly for a visit?” He asks, drolly casual.\n\n \n\n“Hm? What?” Bilbo spends a bit of time pulling his pipe out of his travel bag and shrugs, makes a few noises that aren’t really words in response, and coughs as he gestures at the bustle around him with his pipe. “This uh, you’ve done a lot of work here, haven’t you? I barely recognized the place, it looks like you’ve about finished rebuilding it already.”\n\n \n\nBard gives him a sidelong glance, mouth twitching at the corner as he eyes Bilbo’s cart again, then shrugs and goes with it. “King Thorin has been...surprisingly generous.” Bard's mouth thins a bit at the admission, and he grudgingly eyes the mountain. “After the battle had been cleared away, and the last of the dead buried, he rode into Dale with three carts of the precious gold he had been so eager to cling onto. Many of the dwarves coming in from the Blue Mountains and Iron Hills have also come here to find work and rebuild both kingdoms. I admit the shift is odd, but I’m not going to pry into any offers of assistance.”\n\n \n\nBilbo sighs and looks down at his pipe, playing with it in his hands. “It’s not that surprising,” he says quietly, “not if you really know Thorin.”\n\n \n\nBard shrugs. “Forgive me, Master Hobbit, I know he was your friend, but I have not been given much reason to give him my own friendship. I can give good will for what he has done for us, but I do not have to like him for the hardship he’s brought on to me and mine.”\n\n \n\n“He’s not-” Bilbo stops and has to take a breath before his temper gets the better of him. He knows, logically, that Bard really doesn’t have any reason to like Thorin. Even before the sickness, Thorin wasn’t exactly gracious and warm, and Bard’s worries had ended up well founded, though not for the reasons Bard thought. “He was sick.” Bilbo sighs. “He’s ambitious and rash, but until the sickness got ahold of him, he had always been one to keep his word.”\n\n \n\n“Aye,” Bard says, considering Bilbo’s words. “He did not come asking for pardon, simply stating that he would hold on to what vestiges of honor he had left. And he has done that much.” The king of Dale shrugs again, looking unconcerned with it all. “In the end, I can say he held to his word, and I can work with him as one King to another, but I do not have to like him.”\n\n \n\nBilbo snorts, Bard always had an honesty that was refreshingly open. “Fair enough.” He admits. “I know as well as any that Thorin can be...difficult.”\n\n \n\nBard looks over, glances at the loaded cart again, then back at Bilbo. “What really brings you to Dale?” He asks. “Do not get me wrong, I’m happy to have you here, and you’re welcome to wherever you’d like to live within my city, but I had thought you were long gone to your Shire.”\n\n \n\n“Yes. Well.” Bilbo holds his hands up and smiles. “The Shire ended up a bit dull. I’m still working out what exactly I’m going to do here. It will really depend on a few ah...very...key points. And how they play out.”\n\n \n\nBard nods, and doesn’t pry, which Bilbo is very grateful for, because he really has no idea what the bowman would think of him possibly going off to hitch up with the dwarf King he just admitted to not liking. It’ll have to come up eventually, but right now Bilbo’s not quite ready to admit what his little personal quest is about. Even the traders had only been told that he was wanting to settle in closer to where his friends were. Which isn’t a lie anyway, so it was an easy enough story to stick with.\n\n \n\n“Will you be staying in Dale for the night, Master Baggins?” Bard asks. “My home is always welcome, and this time I can offer slightly better accommodations, if you need them.”\n\n \n\nBilbo chuckles, remembering the strange trip up through the toilet and then the hours spent shivering in Bard’s little shack over the water. “No, thank you but no. I may take you up on that later, and we are definitely due for a visit that doesn’t have any imminent death or threat of capture muddying it up. But there’s a few things that I- well- that I need to get done. And I’m afraid if I don’t just head over to that blasted mountain to do it, I’ll end up hiding here for days working up the courage.”\n\n \n\nBards eyebrows come together, bewildered at Bilbo’s hesitance. “There’s no dragon in there anymore, if you may remember.”\n\n \n\n“Ah yes, and I do thank you for that. But at least I knew exactly what the dragon was about, and what it’s threat was. I’m afraid I was a bit of an idiot and left the entire company with only a note and with no goodbyes. And dwarves can be...emotional.”\n\n \n\nHe’s startled by Bard’s bark of laughter, and looks over in surprise, realizing he never really heard the human laugh at anything. “Oh I heard about that a little!” Bard chuckles, shaking his head. “A few of your little band stormed in asking if their fool Burglar had run off to my halls, but by then you were already off with the wizard. They made quite a scene. It was one with the odd hat, the tall bald one, and the King’s young kinsmen, his nephews, if I heard correct.”\n\n \n\n“Bofur, Dwalin, Fili and Kili.” Also known as all the loudest of the whole lot, and least likely to care about decorum and respect. Bilbo winces, imagining the spectacle they must have made. “Yes...sorry about that.”\n\n \n\n“Well,” Bard claps him on the back and grins. “I imagine my embarrassment is about to be repaid. I don’t envy you at all my friend.”\n\n \n\n“Oh I wouldn’t either.” Bilbo sighs. “They’ll either hug the life out of me, punch me, or both. Anyway, wish me luck, I hope I’m in one piece next time I see you.”\n\n \n\nBard laughs again and gives him a sarcastic little salute as Bilbo snaps his reins and gets his cart back on the road. Before he leaves the city, he sees a few wagons and dwarf families from his caravan, and gives a final cheerful wave goodbye as he passes them. Several look up and shout farewells, waving excitedly.\n\n \n\nHe’s too far ahead to see who the owner of the voice that booms out behind him is.\n\n \n\n“AYE LADDIE!” It shouts, clear and gleeful over the bustle of the city. “GO GET YER KING!”\n\n \n\nBilbo freezes, head whipping around to stare in panic as several of the merchant dwarves burst into loud, guffawing laughter. A good number of them join in with their own shouts of encouragement varying from calls of luck to a few more...colorful wishes.\n\n \n\n“Oh no. Nooo. No no no!” Bilbo squeaks, hunching down and quickly turning his attention back to the road, face turning beet red as the cheers and catcalls send him on his way to Erebor.\n\n \n\n-----------------------------------\n\n“Alright, I missed something.” Bilbo comes up besides where Bofur is twiddling away at a new bit of wood by the fire for the night. “I go get my bowl and he’s gone and sulked off.”\n\n\n   \n\n\n“Oh that,” Bofur looks up at where Thorin has separated himself to stare meaningfully off into the distance. “You want the short version or the long version?” He asks with his usual crooked grin, scooching aside to give Bilbo a place to sit.\n\n\n   \n\n\n“We’ll go with the short version.” Bilbo plops down, stretching his legs out in front of him, “I expect the long one is riddled with tragic backstory all over, and drama puts me off my appetite.”\n\n\n   \n\n\n“Oh I highly doubt that.” Bofur snickers and cleanly slices away a bit of bark on the wood, fingers moving quick and sure as he turns it this way and that. “Kili said something about wondering where Gandalf has run off to this time, Thorin says we don’t need him, Fili said he’s been a bit useful to have ‘round, specially with that troll incident not to mention him healing Thorin after the eagles, and GETTING us the eagles. Thorin is offended that his nephews have turned so cruelly and devastatingly against him.”\n\n\n   \n\n\nBilbo wrinkles his nose up, trying to figure out how all that has led to another dramatic brooding session. “But...Gandalf is useful. I quite like having a wizard around, myself.”\n\n\n   \n\n\nBofur puts his hands up, shrugging as he places his whittling aside and takes the bowl of gruel for the night from Bilbo. “I’m not sayin’ he’s makin’ sense! And don’t go saying that around him, he may go into a sulk for days if he gets it in his head that his nephews AND his burglar have ganged up on him and sided with, oh Mahal what did he call him? The ‘pointy hatted meddler.’”\n\n\n   \n\n\n“Oh this is ridiculous.” Bilbo snorts, glaring at their dramatic, brooding, idiot leader. “He’s just got his knickers in a twist because Gandalf doesn’t take orders from him.”\n\n\n   \n\n\nBofur shrugs. “Again, wouldn’t be saying that in front of him.”\n\n\n   \n\n\n“Well of course he’s decided to have a fit in the middle of dinner.” Bilbo sighs, pushing himself up with a groan as his legs inform him that they don’t appreciate being put to use again.\n\n\n   \n\n\n“You don’t think he should be sent to bed without supper?” Bofur grins, and Bilbo snickers.\n\n\n   \n\n\n“Supper was hours ago. And as much as I’d love to tell him off like the child he is, our grand leader probably needs to not end up passing out from lack of food at some point tomorrow.” Bofur mutters something about hobbits and their food, which Bilbo ignores as he slops some of the nights mess from the large pot over the fire into another bowl.\n\n\n   \n\n“You really gonna go over there? Y’know there’s no talkin’ with him when he gets like that. Dehersu zirin kall.” Bofur says, nodding over at Thorin.\n\n   \n\n\n“Well someone has to try or he’ll stay up all night and be unbearable tomorrow. And derhuwhatsit yourself, thank you. I’m at least going to make a go at it.” Food in hand, he makes his way over to Thorin.\n\n\n   \n\n\n“Hate to interrupt whatever you’re up to over here.” He starts, and feels just a little pleased when Thorin jumps a bit before glaring at him. As far as stealing things, he’s a rubbish burglar, but at least he has a pretty good handle on the sneaking bits. “Thought you might like some food. Or what we pass off as food.” He holds one of the bowls out to Thorin, who bristles and glares at it like it’s personally offensive.\n\n\n   \n\n\n“Thank you.” He says, making it sound like an insult. “I’m not hungry.”\n\n\n   \n\n\n“Oh come on.” Bilbo sighs, nudging Thorin on the arm with the bowl as he shoves it forward more. “Made it special myself. Just the way you like it, with extra lumpy bits of mystery in it. I worked extra hard on this batch, had to make up some completely new spices for it. By make up, I mean that they’re imaginary.”\n\n\n   \n\n\nThorin looks up at the bowl to give Bilbo the now familiar look. The one that says he’s not sure what to really think of the hobbit, and is undecided if his confusion should give way to anger or not. The quizzical look, bordering on outright suspicion, doesn’t leave as he takes the bowl from Bilbo’s hands.\n\n\n   \n\n\n“There you go!”\n\n\n   \n\n\nThe confusion gives way to a glare and Thorin yanks the bowl back, narrowing his eyes at Bilbo for a few more seconds before he takes the most grudging bite of the food, which utterly ruins whatever look he’s trying for as he stares meaningfully off at the horizon.\n\n\n   \n\n\n“How is it then? You know how I pride myself on my gruel cooking.” Bilbo prods, and manage to stop himself from cheering himself when Thorin’s mouth twitches up a little bit at the corner. The dwarf glances at him from the corner of his eye, the smile solidifying slightly at Bilbo’s wide eyed look of false earnest hope.\n\n\n   \n\n\n“It’s terrible.”\n\n\n   \n\n\n“Oh it’s dreadful.” Bilbo agrees, nodding rapidly. “But I imagine with a bit of any other ingredients, it could be salvageable.”\n\n\n   \n\n\n“It only needs to keep us fed.” Thorin points out, though he’s a lot less growly now.\n\n\n   \n\n\n“Thorin.” Bilbo says very firmly. “Remind me to actually cook you something after all of this.”\n\n\n   \n\n\nThorin eyes him again, as if he’s been threatened instead of offered a meal. “Alright.\" He says, sounding like he's weighing his words very carefully \"I’ll hold you too that, Burglar.”\n\n-----------------------------------------------------------------------\n\n \n\nIf he hadn’t already seen just thirteen dwarves build a sturdy barricade wall overnight, complete with built in stairs, ramparts, and peek-holes, using just random blocks of ruin and rubble, he wouldn’t have actually believe what he was seeing.\n\n \n\nThe makeshift wall is gone, and the bridge leading into Erebor is remade with smooth stone and hulking statues of the armed, crouched dwarves. Where there had been a gaping maw into the mountain, there was now a solid door of wood and iron, engraved with runes and great carvings of ravens clutching giant stones in their claws. The ramparts have been rebuilt over the gateway, fully manned by guards, and to the side is a giant block of stone that’s swarming with dwarves strapped in place and carefully chiselling away a new statue to replace the one Thorin had ordered destroyed to block the entrance.\n\n \n\nBilbo hops down from his cart to lead the ponies over the bridge, heart hammering as he stares at the massive doors before him. He feels far too exposed on the bridge, even with the bustle of dwarves (he hadn’t quite realized how many there must have been, waiting in the Blue Mountains) around him, all laden with hammers and axes and equipment as they come and go through a smaller door off to the side of the main gate.\n\n \n\n“Mahitdin!\"\n\n \n\nBilbo jumps, having forgotten for a second about the guards up over the gateway. He stops and grips at the ponies reins.\n\n  \n\n“What business do y’have with Erebor?” The voice is low and rough, having no patience for whatever Bilbo may say. Oh he knows that too well. Bilbo tilts his hat back and cranes his neck to squint up and sure enough, there’s a shining bald head set on broad shoulders that are just visible from where Bilbo is.\n\n \n\n“Well,” He muses, loud enough to carry to the top of the wall, “just a bit of burglary, really.” Dwalin leans hard over the top of the ramparts to stare down, and Bilbo can just hear the muttered curse as he grins up at the dwarf.\n\n \n\n“Bilbo!”\n\n \n\n“Hullo!” Bilbo waves, and Dwalin curses again.\n\n \n\n“Yah little SHIT!” He hollers over the wall, loud enough now that a few dwarves are stopping to stare. “I’m gonna wring your damned little neck! Open the gate! Open it right now! I’m gonna kill him!”\n\n \n\n“Oh dear.” Bilbo says to himself, wincing as Dwalin disappears behind the ramparts, echoes of various threats to Bilbo’s well being drifting up from behind the wall. He watches with raised eyebrows as something large and metal clanks, and one of the doors begins to swing open. Dwalin’s shouting can be heard the entire time, and he emerges as an image of rage from the gates of Erebor.\n\n \n\n“A note! Nothing but a fuckin note! Ag zasasmaki rathkh-hund!” He snarls, fists balled at his sides as he stalks towards the smiling hobbit. Dwarves dive out of his way and he looks like a legendary figure of war, dressed in iron armor emblazoned with a raven in flight over the chest. Bilbo notes the blues and deep reds, and also notes that there isn’t a hint of gold on the plate armor, for all it’s decorated with the complex geometric squares dwarves are so fond of.\n\n \n\n“Well I was always terrible at goodbyes…” Bilbo starts, and any other excuses are crushed out of him as he’s swept up into a hug that may be designed to break his back. Dwalin sets him down and grabs Bilbo’s head hard between both hands, and Bilbo sends up a frantic prayer that he isn’t about to get knocked out by a friendly dwarvish headbutt, but Dwalin settles for just shaking him.\n\n \n\n“You-!” Dwalin says,grinning wide even as he rattled Bilbo’s brains about in his skull. “Ah you’re a sight for sore eyes Master Baggins! Maybe we’ll finally have some peace ‘round here!”\n\n \n\n“Uh, peace?” Bilbo manages, voice jumping up an octave when the shaking stops and is replaced by an arm slung around his head and yanking him into an unbreakable headlock. “Dwalin! Dwalin get off me! I’m sorry alright! Ow-!”\n\n \n\n“AY! BROTHER!” Dwalin shouts, ignoring the little hobbit fists pounding away at his armored shoulder. “Come look at what’s crawled up to our doorstep!” Bilbo manages to land a hit on a joint in Dwalin’s armor, and only gets a loud laugh and a giant hand rubbing violently over his head for his efforts.\n\n \n\n“Brother,” He can just hear Balin’s voice approaching from the direction of the doors, sounding like this is a conversation they have had many times before. “I’ve told you, y’can’t refer to the men like that, it’s bad for diploma-oh bless my beard! Is that Master Baggins you have there?”\n\n \n\n“Balin!” Bilbo shouts, renewing his efforts to squirm his way out of the elbow locked around his neck. “Help!”\n\n \n\n“Little bugger just came riding up to our door!” Dwalin snorts, giving Bilbo another little shake. “Happy as you please and as if nothing was the matter at all.”\n\n \n\n“My goodness.” Balin just says, and Bilbo can hear the fond smile, but no mention of him actually being let go. He can just see a bit of white beard when he looks up through his hair, and one of the dwarf’s hands reaching out to get the attention of a nearby guard. “Could you take Master Baggin’s cart and find a place for it? And send word to the Eastern slope, I believe the King is still out there, and I expect he’ll want to hear about our new guest’s arrival.”\n\n \n\nBilbo swallows a bit at the mention of Thorin, half hoping that the King will take a bit getting to them so he can have a little more time to think of something. At the moment, however, he’s more concerned with the fact that he’s still doubled over and locked in place. He’s aware of someone taking the reins to his ponies from his flailing hands, and can hear the clop of hooves going off towards what he assumes are the stables.\n\n \n\n“Balin!” Bilbo yelps, hands flailing wildly to gesture at his current position, as if the older dwarf hasn’t already noticed it. Dwalin laughs again and he gets another hard ruffle over his hair. “Dwalin you let me go you confounded- I should turn around! Should turn right around, this is the worst idea I’ve ever had! Right after signing that stupid contract and leaving Bag End and getting dragged along just to be abused and-and- bring me my cart back! Bring it back right now I’m going to-”\n\n \n\n“Ah right, right yes.” Balin chuckles. “Ah, brother? I believe you can release our burglar now, I think he’s quite gotten your point.”\n\n \n\nDwalin lets go, without any warning, of course, and Bilbo nearly goes right to the ground. He manages to keep his footing with just an undignified squawk and a good amount of flailing, and punches Dwalin in the arm as soon as he stands. A choice he instantly regrets, and leaves him biting back a string of curses as he shakes his fist out. Dwalin just laughs again, and slaps him on the back hard enough to nearly send him to the ground again.\n\n \n\n“Dwarves.” Bilbo lets every bit of aggravated disdain he’s ever felt ooze into the word as he makes a pointed show of straightening out his jacket.\n\n \n\nBalin chuckles warmly and pats Bilbo on the back, and it’s hard to hold back the smile that comes over his face around the old dwarf.\n\n \n\n“You could have sent word, Master Baggins,” he points out, starting to lead Bilbo into the mountain. “Not that you aren’t welcome by any means, even after a departure that would be considered rude by any standards, much less a hobbit's.”\n\n \n\nBilbo winces, but accepts that he’s going to be hearing about that for a while, and can’t exactly blame any of them. “Well it’s not like I can exactly send a raven, can I? And I doubt the Hobbiton messenger pigeons would make it past the Misty Mountains. Besides, you all burst into my hole uninvited, I thought it was high time I return the favor.”\n\n \n\nBalin laughs, and the three walk into the mountain, now free of ruins and lit with the golden light Bilbo had heard Thorin whispering about. Last time he was here, the place was a tomb, filled with charred and desiccated bodies shriveled in their armor, stones and statues toppled to the grounds. And Bilbo doubts that the mountain has reached the full majesty that it had once had, but it’s still an amazing transformation into something that could be considered an actual home, instead of a shamble of ruin and memory.\n\n \n\nThorin works quickly.\n\n \n\n“It’s good to see you again, Bilbo. I’m sure the rest of the company will agree, once word’s gotten to them.” Balin says, and Dwalin claps Bilbo on the back again, this time without enough force to knock him down. Bilbo looks up into the hollow mountain, and can see glimmers of lights from braziers and torches, hear the echo of voices and shouts of orders, the ringing of hammers and the hum of saws.\n\n \n\n\n‘You’ll understand, when you see it. You could stand on the ground level and look up and only see neverending staircases and archways, doors and lights shining like stars within the stone, stretching forever upwards.’\n\n\n \n\nBilbo walks along the stone halls, gazes past the grand statues and ornate carvings, up into the lights glimmering within the depths, and thinks he is starting to understand. “It’s good to be back.” He says.\n\n \n\n------------------------------------------------------------------\n\n \n\n\nHe was prepared for drunk dwarves. Bilbo saw the laketown men hauling in barrels of wine and ale, platters of food in celebration of the deal struck with Thorin. And he really thought he was prepared, he had seen dwarves in celebration in an unfortunately up close and personal setting.\n\n\n   \n\n\nHe was not prepared for Thorin.\n\n\n   \n\n\n“Thorin! Get off me! You’re too heavy you lunk!”\n\n\n   \n\n\nThorin, who is well on his way through another tankard of ale (Bilbo had given up on keeping count long ago) just laughs and, as a result, sways and leans more heavily on Bilbo. Bilbo, who had mistakenly thought that their grand leader would have had the wisdom to not partake quite so much in the merriment. He was wrong.\n\n\n   \n\n\nDwarves.\n\n\n   \n\n\nThorin’s been as loud and excitable as the rest of them, booming laughter ringing over everyone else as he went throughout his company, exchanging hugs, friendly slaps on the back, and the occasional headbutt. At one point him and Dwalin had started yelling in good nature about something and had nearly destroyed some perfectly good furniture in the process. Bilbo made the mistake of intervening, and Thorin responded by throwing an arm over Bilbo’s shoulders, yanking him firmly against his side, and proceeding to drag the hobbit around for the rest of the night and, occasionally, use him as a crutch.\n\n\n   \n\n\n“Thorin!” Bilbo snaps, smacking the arm hooked around him for what has to be the tenth time that night. They’re supposed to be facing a dragon tomorrow! And everyone’s practically falling over themselves like a bunch of idiots, with this idiot leading the way. “Thorin let go!”\n\n\n   \n\n\n“Bilbo!” Thorin grins, voice too loud and sounding like he just remembered Bilbo was there and it’s the best surprise ever. “Bilbo you’ve been amazing!”\n\n\n   \n\n\nBilbo sighs. “Yes, thank you Thorin.” Thorin has been going to everyone and informing all of them how amazing, incredible, noble, and perfectly loyal they are. It was charming the first five times.\n\n\n   \n\n\n“I really-” Thorin sways again and Bilbo’s legs nearly give way under him. The dwarf catches himself and yanks them both back upright so suddenly that Bilbo yelps as he’s nearly lifted a little off the ground. “I really thought you were going to die within a week!”\n\n\n   \n\n\n“Yes, well, so did I.” Bilbo huffs, and lightly smacks the large arm around him again. “Thorin, come on! We really can’t be-”\n\n\n   \n\n\n“But you didn’t!” Thorin goes on, flinging out his free arm and sloshing ale all over the place. “And it is because of you we’ve made it this far.”\n\n\n   \n\n\n“Thorin, I really-”\n\n\n   \n\n\n“This quest owes our success to you, Master Baggins.” Thorin says firmly, and it would be touching if he weren’t slurring the praise.\n\n\n   \n\n\n“Thank you Thorin, but if we’re going to actually finish this in time, we need to get your drunken, idiot arse set and taken care of for the night.” He can’t imagine them trying to hike up the mountain tomorrow, not if Thorin is still recovering from this lunacy. For what has to be the hundredth time, Bilbo wonders how dwarves manage to function at all. Obviously someone here is going to have to be in charge of some intelligent, responsible decisions.\n\n\n   \n\n\n“I am set!” Thorin declares, “I’m King Under the Mountain!” He bellows the title out, and all the dwarves stop to cry cheers and shout in Khuzdul, raising their tankards. Thorin cheers back and Bilbo nearly gets ale spilled all over him. The only thing that saves him from a migraine is when they all stop to down their drinks.\n\n\n   \n\n\n“Right.” Bilbo mutters, and grabs onto the bit of Thorin’s sleeve in front of his face. “Right then. That’s all well and good but you’ll be King under the bloody tables if something isn’t done.” He tugs on the sleeve and manages to start steering Thorin, who’s being surprisingly cooperative, towards the stairs that lead to the rooms they all have been given. There’s a bit of difficulty once they actually reach the steps where Thorin forgets how to work his fool legs and nearly sends both of them tumbling down. Bilbo manages to grab the railing and grits his teeth at the explosion of cheers that their stumble brings.\n\n\n   \n\n\n“Ay Bilbo!” Bofur yells, “give him hell!”\n\n\n   \n\n\nBilbo rolls his eyes and waves his hand, and the headache starts returning when Thorin bursts into laughter right by his ear. Everyone else seems to think that Bofur is the most hilarious thing ever, and the cheering follows Bilbo and Thorin all the way up the steps.\n\n\n   \n\n\n“How’d we get up here?” Thorin asks, cheerfully curious as he looks around the room Bilbo’s managed to steer him into.\n\n\n   \n\n\n“Walking. Thorin. You walked. Or, more accurately, I walked and dragged. You stumbled, fell and staggered.”\n\n\n   \n\n\n“Are you taking me to bed, Master Hobbit?” Thorin cackles at his own joke, swaying wildly again and Bilbo aims him at the bed, where he lets the idiot fall into a pile. Thorin flops back and keeps on laughing while Bilbo rubs at his own abused shoulders, seriously wondering if one got dislocated during his stint as a support beam for inebriated kings.\n\n\n   \n\n\n“I’m putting you TO bed, you moron.” Thorin lifts a hand and waves it in Bilbo’s general direction, slurring something in Khuzdul which Bilbo loudly ignores as he goes to the side table. “Oh thank goodness there’s some water.” He mutters, picking up the full pitcher and pouring it into a mug.\n\n\n   \n\n\n“We are on a lake, Bilbo.” Thorin says with a slow grin. “There is plenty of water.”\n\n\n   \n\n\n“Shut up.” Bilbo snorts, getting a hand behind Thorin’s shoulder and easing him up to sit on the edge of the bed. “I can not believe you let yourself go like this you colossal idiot. No-shut up, just shut up. I don’t want to hear it. And stop grinning like that, you’re a disgrace. Drink this.” He shoves the mug into Thorins hand and the dwarf takes it without a protest, holding it with both palms and grinning widely at Bilbo.\n\n\n   \n\n\n“You’re incredible.” He declares.\n\n\n   \n\n\n“Thank you Thorin, drink that.” Thorin surprisingly obeys, chugging back the water with all the enthusiasm he had shown the ale earlier, then raises his eyebrows and tilts his mug so Bilbo can see that it’s empty.\n\n\n   \n\n\n“Will that suffice?” He asks.\n\n\n   \n\n\n“Oh yes well done, you’re still able to drink water.” He moves in to take the mug back, and as soon as his hands are free Thorin grabs Bilbo’s face between them.\n\n\n   \n\n\n“I” He announces solomnly, “am going to marry you.”\n\n\n   \n\n\n“That’s very nice Thorin.” Bilbo sighs, dislodging himself from Thorin’s grip and shoving lightly on his chest. “I bet you say that to all the nice halflings.”\n\n\n   \n\n\nThorin flumps back at the lightest shove Bilbo gives him, arms splayed wide at the bed. “I don’t like the other halflings.” He snorts.\n\n\n   \n\n\n“Shut up and go to sleep, you’re going to be a disaster tomorrow.” Bilbo moves over to the side table to put the mug back. And he really should have learned his lesson from downstairs, when it came to coming within grabbing range of drunk dwarves. He only has a second to realize his mistake when a large hand fists itself into his shirt and yanks him onto the bed.\n\n\n   \n\n\n“Thorin! Thorin let me go!” Bilbo’s voice nearly squeaks as he gets pulled in, smacking at one of Thorin’s wide shoulders but it’s far too late. Thorin mumbles something in Khuzdul and flings a thick arm over Bilbo, pinning the hobbit firmly and, just like that, starts to snore.\n\n\n   \n\n\n“You are joking!” Bilbo snaps, kicking in futile and yelping in indignant fury when Thorin mumbles in his sleep and tightens his arms around his unwilling captive. “Let go of me! You stupid, pig-headed, stubborn, pea-brained, thick skulled-”\n\n\n   \n\n\nBilbo continues hissing insults, squirming and flailing around until he can finally free himself of his prison. Thorin mutters something else as soon as Bilbo manages to escape, and flails his arm for a bit until his hand lands on of of the pillows, which he instantly curls himself around.\n\n\n   \n\n\nBilbo sighs, and shakes his head, glad no one can see the small smile that he can’t quite fight down as he tugs a blanket up over the loudly snoring legendary Thorin Oakenshield. “Tomorrow is going to be a mess, you idiot.” Bilbo says fondly.\n\n\n   \n\n\nHours later, long after he’s meandered his way over to another room and passed out on his own bed, he’s woken unpleasantly by a loud banging on his door.\n\n\n   \n\n\n“Wake up, Master Baggins!” Thorin’s voice booms through, perfectly clear and strong and brimming with excitement. “We leave within a half hour!”\n\n\n   \n\n\nBilbo highly doubts that, and stumbles over to the door, blinking rapidly as he flings it open into the sunlight. He squints his eyes when he spots Thorin, blinks again, then nearly flings his hands up in complete disgusted surrender. Because Thorin’s going from door to door, fully washed, dressed, bright eyed, and completely awake as if he wasn’t running into tables and loudly proposing just the night before.\n\n\n   \n\n\n“Dwarves.” Bilbo snarls, yanking his door the rest of the way open and marching out of his room.\n\n\n   \n\n----------------------------------------------------------------------------------------------------------------------------\n\n \n\n“You bastard!” Bofur yells, and Bilbo is swept into the fifth back crushing hug of the day. He’s wondering if he’s going to end up incapacitated for life as a direct result of enraged dwarf affection. “You slimy little bastard!”\n\n \n\nBalin’s pulled him into one of the smaller rooms with a long table that’s already been heaped with platters. Heaven knows when these arrangements were made, or how word got out so fast, but one by one the company arrives in, and each time Bilbo prays that this won’t be the one that finally breaks him. Goblins, trolls, orcs and dragons have nothing on dwarves.\n\n \n\n“I know, I know!” Bilbo says, voice cracking in surprise when Bifur comes up and slams a hand into his back. “I’m sorry!”\n\n \n\n“What were you thinkin’!” Bofur goes on, stepping back but holding Bilbo firmly by the shoulders. “Tea time is at four?!”\n\n \n\n“Well it is!” Bilbo says weakly, and is given another firm slap on his back for his trouble. “I said I’m sorry!”\n\n \n\n“Sorry he says!” Bofur declares, giving Bilbo a last little shake before he goes and falls into a chair with the others at the table. “Sorry! Can yeh believe it?”\n\n \n\n“So what’re y’here for then?” Gloin stabs right to the point, as per usual.\n\n \n\n“Well-”\n\n \n\n“Will you be staying?” Ori asks quietly with a hopeful smile.\n\n \n\n“I do actually plan on, well yes. It will depend on how some- how some uh, things, play out. If not here then I’ll be in Dale. The Shire is just...well you all got me too used to noise and you can’t yell at the other Hobbits like I can yell at you.” Bilbo grins and grabs a roll from the table, and feels lighter than he has in nearly a year. There’s noise and grinning faces around him, shouts and debilitating back slapping and a brilliant lack of any true civility. There’s no false smile, no forced polite little greetings, and Bilbo finally feels right in his skin again.\n\n \n\n“Hold on,” He asks, looking over the faces and taking a little tally. Thorin is still absent, which he desperately steers his mind away from. He did leave the two of them in a rather awkward place, he can’t really expect Thorin to sweep in and everything to automatically be alright. Though that’d be nice. But none of the royal line is present. “Where are Fili and Kili?”\n\n \n\n“Off to the Blue Mountains.” Dwalin says gruffly. “They’re going to try and convince the Lady Dis to return to Erebor with them.”\n\n \n\n“And,” Balin adds, mouth pulling into an odd mix of a grimace and a smile. “I did hear rumor that Kili has been waylaid in the woods. Dreadful business.”\n\n \n\nBilbo’s eyebrows go up. “Oh. Oh! So did he...oh no how did that go?” He asks, and the awkward glances around the table confirm his growing fear that whatever happened, it was not a pretty thing.\n\n \n\n“Well…” Oin starts carefully.\n\n \n\n“Ah don’t dance around it.” Dwalin snaps. “Kili ran off with his damned elf woman after Thorin nearly threw her out of the mountain!”\n\n \n\n“Oh nooo. No no he didn’t.” Bilbo winces, knowing full well that yes, yes he most certainly did.\n\n \n\n“He didn’t quite throw her out.” Balin amends. “Fili said she saved Kili’s life a few...well at least two times. So she wasn’t outright banished with a guard on her…”\n\n \n\n“But there was still a good deal of yelling.” Bofur says cheerfully.\n\n \n\n“Oh dear. I’m glad I wasn’t here for that.” Bilbo can only imagine. An elf and a dwarf was bad enough, but one of the royal family and a mirkwood guard...oh it must have been a scene.\n\n \n\n“But you’re here now!” Bofur throws his arms out, and the company cheers instantly, boisterous and happy as ever.\n\n \n\n“Yes yes! I-” He knows instantly. Though that’s hardly a difficult thing with how the company falls silent, eyes all trained on the entryway a bit behind Bilbo’s left shoulder.\n\n \n\nHe turns to follow their gaze, and there’s Thorin. He’s standing just in the doorway, arms crossed stiffly over his chest and Bilbo’s struck, more than with any of the other dwarves, at how he doesn’t look a bit different. They’re all cleaner, of course, and all notably well dressed. Thorin is back in his layers of black and blues with steel mail and leather vambraces. It’s almost a spot on for his outfit when they started the journey so long ago, except for the intricate designs of sharp squares and interlocking diamonds stitched in deep red on the sleeves and the crown of black metal and bright steel.\n\n \n\nThere isn’t a bit of gold anywhere, and Bilbo notices that the crown, while similar, isn’t the same that Thorin had worn when he’d decked himself in golden armor and the ostentatious clothes of his grandfather.\n\n \n\n“Thorin.” And his heart is pounding, his head is buzzing, but he feels strangely grounded, like he’s never been more solid. He can’t help the little smile starting to pull the corners of his mouth.\n\n \n\n“Master Baggins.” Thorin says cautiously, head tilting in a guarded greeting. He doesn’t move from the stone doorway, and his stiffly crossed arms don’t relax in the slightest. “I hope your journey went well.”\n\n \n\n“What?” The formality stops him a bit, and his heart stops the desperate pounding in favor of sinking down somewhere around his feet instead. “I. Yeah. Yeah it was alright. A lot less exciting this time around, but I’m not complaining.” His mouth twitches up nervously to try and force the joke a bit. Thorin just blinks and gives another stiff little nod.\n\n \n\n“Of course.”\n\n \n\nThe silence is excruciating. Bilbo is incredibly tempted to flee and run off from the fact that there is this awful heavy silence and bloody everyone is staring at the two of them staring awkwardly at each other. The only thing stopping him from doing so is the fact that Thorin is blocking the damn exit. He was expecting anger, maybe a little yelling, but not this uncharacteristic blank stiffness from Thorin.\n\n \n\nBilbo finally clears his throat and looks down at the roll in his hand, tossing it a few times and setting his jaw, mouth moving as it tries to figure out what exactly he’s going to say. “Ah, Thorin-”\n\n \n\n“You will excuse me.” Thorin says quickly, voice strangely flat, and he gives another quick nod as he steps back a bit. “I’m afraid I can not linger for long. My apologies, Master Baggins, there’s much to be done still. It’s.” And then Thorin stops, and Bilbo can see a brief crack in the carefully forced formal calm when Thorin blinks a few times and looks anywhere in the room but at Bilbo. “It’s good to have you visiting.” He says finally, and gives another awkward nod and turns to leave quickly.\n\n \n\nBilbo opens his mouth, shuts it, and raises his eyebrows as his innards try to remember where they’re supposed to settle. He had imagined his reunion in a million ways in the months that it took to come back, and that wasn’t anywhere close to any of them. Bilbo can’t even tell if that was worse or better than the most terrible scenarios he’d thought up.\n\n \n\n“Wh-” He starts weakly, then has to stop and blink rapidly as he tries to process all of that.\n\n \n\n“M’imnu Mahal!” Dwalin snaps. “Please tell me you’re going to do something ‘bout that now you’re here!”\n\n \n\n“Wh-? What? What do you-? What on earth was all-?” Bilbo gestures vaguely at the doorway, still staring wide eyed at it. “Was that? What was that?”\n\n \n\n“That was…” Balin starts awkwardly, then sighs and shrugs his shoulders. “Well you did leave a bit suddenly. And I don't think any of us really expected you to come back after the way you took off. I don't believe Thorin ah...had much time to prepare.”\n\n \n\n“Yeah well that’s because he-!” Bilbo stops, flushing as he remembers Thorin’s earnest and hopeful eyes and the large hands holding on to his. Then he notices the Company all shifting awkwardly and glancing around at each other. “And speaking of that!” Bilbo grits, narrowing his eyes at the guilty looking dwarves and pointing a finger out, waving it around to make sure all of them know they’re part of this. “At what point was anyone planning on telling me that I was engaged then? Think someone could have mentioned that before I had a fever-muddled king calling me his betrothed?”\n\n \n\nSilence.\n\n \n\n“Well?”\n\n \n\n“We uh,” Bofur grins apologetically, “well we thought you already knew. I mean you two were already-”\n\n \n\nBalin shakes his head rapidly and Bofur stops, staring at Balin, then at Bilbo, his eyes widening. The other dwarves all swivel their heads around to stare between them as well, ten sets of eyes widening in surprise. Bilbo’s hands curl into fists at his sides while he glares at the two of them.\n\n \n\n“We were what?” Bilbo asks cooly, raising his eyebrows as all the dwarves stare at him.\n\n \n\n\"No.\" Bofur says, directing it more at Balin than Bilbo. \"Y'weren't already...? You weren't already together?\"\n\n \n\n“No!” Bilbo snaps, throwing his hands up. “No we were not! I had no idea! None! And I thought you all just knew about the engagement! Not that everyone but ME was going about assuming that-”\n“How did you not know?” Nori asks, completely flummoxed. “How could anyone not know?! We all had to watch Thorin all but throwin’ himself at you every damned day!”\n\n \n\n“I didn’t think-!”\n\n \n\n“But at Laketown!” Bofur interrupts, pointing back at Bilbo. “You went upstairs! You two-”\n\n \n\n“I dragged him upstairs to get him to sleep! Because he was a drunk idiot and we needed to face a dragon in the morning! What on earth did you think-” He stops at the shocked faces on all the dwarves, except for Balin, who stares guiltily at the wall, and Dwalin who is shaking his head in disgust.\n\n \n\n“Balin?” Bilbo asks, narrowing his glare at the white haired dwarf.\n\n \n\n“Oh! Well.” Balin starts, smiling nervously. “I knew you two weren’t...well Thorin and I had talked about it you see. He wanted to wait until the quest was completed and-” He stops and shrugs with a smile as if everything is obvious. Which it most certainly is not.\n\n \n\n“And?” Bilbo prompts, crossing his arms.\n\n \n\n“You accepted the mithril!” Bofur snaps his fingers, grinning like he’s very proud for having caught Bilbo out. Balin coughs and starts shaking his head again, but Bilbo is already on it.\n\n \n\n“He said it was a token of friendship! I thought it was a nice friendship gift!”\n\n \n\nDwalin snarls something to himself in Khuzdul, and Bilbo decides that it’s not worth asking for a translation. Bofur sputters in indignant shock.\n\n  \n\n\"It's bloody mithril, isn't it?! You thought mithril was-\"\n\n \n\n“I was going to tell you what that was about.” Balin says quickly. “I knew what he had meant by it and that you weren’t ah, quite as aware. The significance of the value of mithril is easily lost on those who don't know the history of our culture. But then you had run off with the stone and...well.”\n\n \n\nThat calms Bilbo fast, memories of the chaos and the wild hurt rage in Thorin’s eyes as hands fisted in Bilbo’s shirt and nearly sent him over the wall. Fine, that’s an excuse he’ll accept. He nods a bit, hands clenching and unclenching at his sides.\n\n \n\n“The question.” Dwalin growls. “Is now what? Since we’ve all been updated one everyone’s emotions.”\n\n \n\nThey all turn to stare at Bilbo, who is reconsidering running off.\n\n \n\n“What?” He asks nervously. “What are you- alright! Alright fine I. Yes. I thought about it. I wanted to, to talk to Thorin. About...the whole thing. That he decided to spring on me. I just needed- well. I came back for you all too. I-” He rubs a hand over his face, wincing at the earnest grins all directed at him. “No nono stop that all of you!”\n\n \n\n“We missed you too laddie!” Gloin shouts.\n\n \n\n“Stupid decision.” Bilbo mutters into his palm. “Mad. Absolutely mad. I must be. I left all the quiet and peace-”\n\n \n\n“Well that sounds dull,” Bofur gets up to walk over and clap Bilbo on the back. “Just you and yer plants and yer dishtowels full of holes.”\n\n \n\n“It’s crochet.” Bilbo sighs into his hands, barely keeping himself from completely breaking down into a fit of crying or laughing, he isn’t sure which. “It’s supposed to look like that, and it’s a doily.” He looks up, feeling a bit hysterical. But there’s also a bit that needs to be done before he can work himself up into a complete nervous meltdown. “Right then. I need. I have to. Can anyone tell me where Thorin would have gone?”\n\n \n\n“Oh that.” Bofur laughs. “I imagine he’s up on guard.”\n\n \n\nBilbo blinks, frowns, and blinks again. “On what?”\n\n \n\n“Up on the front wall.” Balin explains.\n\n \n\n“Y’see.” Bofur explains. “Whenever our good King needs some alone time-”\n\n \n\n“Whenever he’s off to sulk.” Dwalin growls.\n\n \n\n“Right, yes. That too. Anyway. What he does is he goes up and relieves the guard from his duty up on the wall with some excuse about kings taking part in the workings of the kingdom. And there he broods all by his noble self.”\n\n \n\nThat did sound like Thorin. Bilbo takes a deep breath, shuts his eyes, and counts as he lets it out slowly. He can't put this off. Not after all this time, after this journey and after that painful reunion earlier. The feast laid out in front of him is forgotten as he keeps slowly breathing and working his nerves up. If he doesn't do this now he'll just be an anxious wreck for the rest of the night.\n\n  \n\n“Okay. Right. Alright. I-I uh. I guess I’ll be heading to the wall then.”\n\n  \n\n---------------------------------------------------------------\n\n  \n\n\nBilbo’s head is still swimming from the blow he’d taken earlier, and he can feel the trickle of blood down the side of his face that he can’t be bothered to wipe away. The world is still heaving around him, sounds reaching him slowly as he stumbles through the stone walls and staircases, trying to find ANYTHING. Because there had been so many orcs, swarming like insects over the walls. Too many to count, too many to comprehend. But now there isn’t anything but screaming wind and snow and his blood dripping down his face.\n\n\n   \n\n\nHe stumbles, catches himself on a large stone block, and hears his own harsh breathing echoing in his head, drowning out everything else.\n\n\n   \n\n\nThen he looks up. And Thorin’s standing on the ice, back to Bilbo, and overlooking the battle far, far below.\n\n\n   \n\n\nThe relief is like a veil lifting away from him, making the world clearer and making his vision settle. Thorin’s standing. Thorin’s alright. Thorin’s standing with shoulders back, the pale orc lying with Orcrist sticking from his chest in the middle of the ice, and in that moment everything is alright again. For a few soaring seconds, Bilbo can breathe and feel the small smile of relief that at the end of all this, Thorin is alright and alive and standing.\n\n\n   \n\n\nThorin’s knees buckle. Bilbo’s lungs stop. Thorin falls, a slow tipping to his side until he finally crashes down hard, lying back in a heap.\n\n\n   \n\n\n“No. Nono no no!” Bilbo’s fingers scramble against frozen stone as he flings himself over and onto the ice, nearly falling several times and his breath stopping and gasping, leaving him coughing on the dry, icy air as he runs as fast as he can to where Thorin’s lying.\n\n\n   \n\n\nNo it isn’t happening like this. Not after all this. Not after Thorin is finally back and finally himself again, not after the dragon and the fire and the terror of the past few weeks. This isn’t the end, this can’t be the end!\n\n\n   \n\n\n“Thorin!” He drops to his knees besides the King, and this small, broken dwarf can’t be Thorin. Thorin doesn’t breathe shallowly and stare blankly up at the sky, fight gone and eyes glazed. He doesn’t simply lie down and accept.\n\n\n   \n\n\n“Bilbo.” Thorin breathes, eyes focusing on the hobbit’s face.\n\n\n   \n\n\n“Lie still, Thorin lie still. Just. It’s just.” He reaches over and there’s blood, gods there’s so much blood. Bilbo nearly gags at it, at the sharp scent of it and the warmth against his fingers. There’s so much blood pulsing from a deep stab through Thorin’s side. Bilbo tries desperately to remember everything Oin had taught him about healing, as the dwarf slowly explained wraps and salves and different quick battle patches. He check’s Thorin’s face and there’s no blood coming from his mouth, no red between the pale lips so his lungs are alright. That’s the extent of Bilbo’s knowledge though, and he fight’s down the nausea building in his stomach and clamps a hand tight down over the wound.\n\n\n   \n\n\n“Hold on Thorin, just hold on.”\n\n\n   \n\n\n“Bilbo…I-\"\n\n\n   \n\n\n“Don’t you dare, don’t you dare. It’s going to be alright Thorin. The eagles are here. The eagles are here we’ll be alright. Just don’t, don’t you dare….don’t...” It repeats over and over in his mind. ‘Don’t you dare. Don’t you dare leave. Dont you dare leave me in a world where you don’t exist. Don’t you dare let go.’\n\n\n   \n\n\nDon’t let go.\n\n----------------------------------------------------------------------------------------------------------------\n\n  \n\nBilbo can’t keep his hands still as he walks up the steps in the main hall that lead to the guard wall. They tap against his legs, twist around each other, clench and unclench as he steps out into the clear night. It’s cool out, but not cold, and Bilbo thinks it a bit funny that he keeps coming to Erebor right at Autumn.\n\n \n\nThorin is easy to find, standing in the center of the wall, arms out and braced as he leans heavily against the ramparts and looks down at the sheer drop. Bilbo swallows, and remembers looking over his shoulder at a very similar height. This wall is cleaner, the stones set firm and the ramparts decorated with interlocking chains and complex geometric designs interspersed with carved ravens. But it’s still familiar enough to make Bilbo tense and remember when he nearly became very well acquainted with that fall.\n\n \n\n“I remember it all.” Thorin says softly, and for once Bilbo’s the one jumps a bit, then shuffles guiltily when he realizes he must not have been as quiet as he had assumed.\n\n \n\n“Yes.” He answers, swallowing as he leans his elbows on the stone a ways down the wall from Thorin, looking out at the night and definitely not down.“Yes. Well, I like this wall a great deal more.\" He goes on. “It’s nicer.”\n\n \n\n“I’m sorry.” Thorin’s voice is even quieter, a whisper that is almost carried away by the wind. “I’m so sorry, for all of it. For the things I said, for-”\n\n \n\n“Thorin, it’s alright.” Bilbo interrupts quickly, not sure he can really handle the vulnerable quake in Thorin’s voice right now. “It really…” and for a few moments it isn’t the terror of the drop, the rage and snarl in Thorin’s voice then that he thinks of, but the soft broken way he had said 'you would steal from me?' and the pained tears in his eyes. And gods, that look hits him so much harder now, now that he knows what the gift of mithril had meant, what Thorin had thought of them in his sick mind. Even then, Thorin had been sick, but he had later said the heart behind it was true. And for the better or not, knowingly or not, Bilbo had still thrown that in his face.\n\n \n\n“I’m sorry.” Bilbo sighs. “Whatever my reasons were, I betrayed you. And I didn’t...it wasn’t what I wanted. That was the hardest thing I did, and a few times I had been so close to giving it to you, just because I knew how badly you wanted it. I never wanted to betray you. Handing that stone over was-. I knew I was hurting you and I couldn’t-”\n\n \n\n“You did what you had to.” Thorin says, still not looking up from the wall. “You were right, to not give it to me, to take it away and know not to follow me into death and ruin. You were the only one who saw what was best for the company, for me.  Your only mistake was coming back after you did it. You always-” Thorin stops, breathes in slowly, and pushes himself away from the wall to stand fully. “My apologies. These shouldn’t be the sort of memories you dwell on during your stay.”\n\n \n\n“Where…” Bilbo sniffs, and taps his fingers on the cold stone, trying to find the best way to ask what could be a very dangerous question. “Where is it now? The arkenstone?”\n\n \n\n“Deep.” Thorin says, voice solid. “It’s back down in the depths of the mountain. Sealed within a tomb dedicated to those who lost their lives in this place.”\n\n \n\nBilbo nods. “Good. That, that’s good. It’s a good place for it.”\n\n \n\nThe silence that falls over them isn’t quite as painful as the one that came on with the company, but it’s still heavy. It presses down on Bilbo as he tries not to obviously watch Thorin, who is stiffly looking out away from Bilbo.\n\n \n\nHe wonders how many times Thorin came up here and just got lost in his own head, trapped in memories and regrets and unable to see what was happening now. Too lost in the ruins to see how much life and light he's brought to the mountain again.\n\n \n\nThey’ve both been morons, really. And Bilbo sighs as he walks up to Thorin, who refuses to look at him.\n\n \n\n“Thorin-”\n\n \n\n“How long will you be visiting us?” Thorin asks quickly, head turning away just slightly to look out at the hills, voice back to that forcibly stiff and formal grit. Bilbo stops, and it finally hits him what’s happening, why Thorin is standing stiff and formal and unusually forced into this unnatural politeness.\n\n \n\n“What?” He asks, eyes narrowing and taking in Thorin's tense shoulders, the hand out on the wall and fingers tapping against the stone.\n\n \n\n“You’re always...you can stay as long as you like. I’ll have Balin arrange a place for you, if you wish to spend your time in Erebor. It may be wise to wait until the spring, when it will be easier to cross the mountains back to the Shi-”\n\n \n\n“You idiot!” Bilbo yells. Thorin finally looks at him at that, taken aback and wide eyed. “You absolute idiot! I can’t believe-”\n\n \n\nThorin stares at him like he just now realized Bilbo existed, and wasn’t sure how he got there. “What?” He asks, hesitant.\n\n \n\n“You-! Why do you think I came back? Why do you think I hitched myself up to a bunch of dwarvish merchants and spent months coming all the way back to this bloody mountain!?”\n\n \n\n“I don’t-?”\n\n \n\n“You’re a king! You’re supposed to be able to catch on to things! You absolute moron! A visit!” Bilbo reaches up and tugs the collar of his shirt aside a bit, showing the mithril he’s worn since he left the Shire far behind him. “A visit! Really?!”\n\n \n\nThorin freezes, eyebrows furrowed in confusion for a moment, before he catches sight of the silvery gleam and his eyes go wide. He’s still for a few moments then exhales in an unsteady huff, his shoulders slumping and face open, full of disbelief as he reaches up to take Bilbo’s collar, tugging it down and to the side to show more of the mail beneath.\n\n \n\n“Why do you think I came back?” Bilbo shakes his head, laughing a little and heart wild in his chest. “You complete, utter, incredible moron.”\n\n \n\nThorin swallows, and Bilbo can feel the fingers shaking where they grip his shirt, and the dwarf just stares at the mithril. He looks briefly up at Bilbo’s face, expression shell shocked and dazed, then looks back at the metal shirt.\n\n \n\n“I just needed to think!” Bilbo goes on. “Thorin, I needed to actually think! Away from all the pressure here! I had no idea that you- that there was all that. I’d never dared to hope for any of that! You’re-. Well you’re you! You’re Thorin Oakenshield, the king and warrior and everything else you’ve become. I’m just-”\n\n \n\n“Bilbo.” Thorin breathes.\n\n \n\nBilbo swallows, and is afraid he may do something incredibly embarrassing. Like swoon. Fortunately his legs stay good and steady and he reaches up to hold the hand still gripping his shirt. “Yeah. Yeah that. Look this-” He takes a deep breath, once again regretting that he never took the time to rehearse this. “This is mad and irregular, but you kind of make me do mad and irregular things pretty...well...pretty regularly. I-”\n\n \n\nHe has to take a few seconds to breathe, and it’s hard to keep control of that when Thorin is looking him full in the face now, the look of wonder and awe that Bilbo had seen so many times returning with wide eyes and slack, parted lips.\n\n \n\n“I. Ok. I’m for it. Alright? The- the marriage. That whole thing. That idea. I’m. Yes. Yeah. I-you...I love you. Alright? And I did before but I had to get my head around the fact that that wasn’t a bad thing and that you were actually a thing that I could- Yeah. So I came back for that. Because I want-. That wasn’t home anymore. And I’m thinking this could be. A home. With you. If you-”\n\n \n\nThorin breathes out, making a soft, wordless sound and the hand on Bilbo’s collar slides around to the back of his neck. It pulls him forward as Thorin leans down and presses their foreheads together, breathing unsteadily in the space between them while Bilbo can feel a hysterical smile coming over his face again.\n\n \n\nHe reaches up and rests his hands on Thorin’s upper arms, fingers tensing nervously against the fur and leather. Thorin’s hair is draping around them again, and now he can close his eyes and let himself feel the closeness of it, the heat coming from Thorin and the soft brush of air between them as they breathe. Thorin’s hand moves from the back of Bilbo’s head to slide to his jaw, the other one coming up so Bilbo’s face is cupped gently between the warm and calloused palms.\n\n \n\n“Bilbo.” Thorin says, barely over a whisper. “I am going to kiss you now, and I would prefer if I not get yelled at for it this time.”\n\n \n\nOh help him he really might swoon. “I’ll yell at you if you don’t kiss me you utter-”\n\n \n\nHe doesn’t get a chance to finish what was sure to be a fantastic insult, as Thorin tilts his face up between his palms and swoops in, pressing his lips to Bilbo’s mouth.\n\n \n\nAnd this, this is a proper kiss. Bilbo can’t even be ashamed when he sways and grabs onto Thorin’s sleeves to steady himself. It’s warm and soft and firm all at once, and he feels like he’s completely surrounded by the dry palms against his face, thumbs gently stroking over his cheeks, the scratch of beard and the steady press of Thorin’s lips. He sighs out and relaxes into it, getting enough of a mental grip to lean up into this kiss, pressing back and feeling a swoop of elation as Thorin instantly responds by stepping in to press fully against Bilbo’s front.\n\n \n\nThorin breaks it first, though he barely moves away, just moves his head to kiss Bilbo’s cheek and press their faces together, arms wrapping around him and pulling him tight against his body. Bilbo laughs a little, feeling like his insides have been replaced with fireworks, like the only thing keeping him on the ground is the heavy, solid warmth of Thorin holding on to him. He buries his face against the thick black hair and reaches up to wrap his arms around Thorin’s shoulders.\n\n \n\n“I did not think I would see you again.” Thorin says, soft and wondrous. “When the raven returned with news that you had arrived safe, I thought it would be the last I would hear of you.”\n\n \n\n“Idiot.” Bilbo grins, tightening his arms around Thorin and laughing when Thorin returns the gesture with a low chuckle of his own. “I’m sorry about...about how I left. I was overwhelmed but it’s no excuse for just-”\n\n \n\nThorin moves again, stopping Bilbo with another, gentler kiss that’s barely a touch of lips. “You’re here.” He says, whispering the words against Bilbo’s mouth. “You came back. You always come back.”\n\n \n\n“And you’re always so surprised.” Bilbo grins on, giddy with everything. “I’m glad to be back. The Shire was...you were right, it’s too small now. I couldn’t just go back and be only me when I kept thinking of everyone here. Of you. And you were right about here, you’ve done so much in so little time. This is a home again. I think it really could be my home now.” He swallows and quietly finishes. “Our home.”\n\n \n\n“Ours.” Thorin breathes. “Amrâl’im’ê.” He tilts his head for another kiss, and Bilbo can feel the shift in this one. He can feel it in the way Thorin’s arms pull him in tight, lifting him a little into the dwarf’s body and in the way Thorin presses their mouths with a sure focus, catching Bilbo’s bottom lip between his own before moving to the top lip. All at once Bilbo’s aware of the cool air on his face, of Thorin’s hands sliding up and down his back in firm, broad strokes and of the thick hair caught up in his own fingers.\n\n \n\nIt really can’t be Autumn, not with how warm it is, awfully warm. Bilbo’s breath hitches a bit when he feels the soft, questioning brush of a tongue on his lips, a quick flash of heat as Thorin’s hands tuck up under his shirt, pressing warm through the cool mithril. Bilbo inhales, opens his mouth and tightens his arms around Thorin, fully aware that he’s practically holding himself up now. But even that nearly fails him at the low groan against his mouth, the fingers gripping at his back and biting cold mithril links into his skin while Thorin’s tongue slides hot against his own.\n\n \n\nEverything goes blurry, he’s a bit aware that they’re still fully out on the wall and only technically alone, and that this is a bit fast and not anything he’s really had any more experience with. But Thorin presses into him with a light scrape of teeth, bruising Bilbo’s lips and making low sounds that Bilbo can feel rumbling through the chest pressed against him and this is all very very far from sweet little kisses shared with flowers and shy smiles in the Shire.\n\n \n\nHe has to be the one to break the kiss this time, just to suck down cool air and try to get his heart back under control. Thorin’s no help, no help at all on that front. Bilbo’s trying to get his breathing steady and there’s lips dragging over his face, pressing open mouthed and hot along his jawline and quick flashes of the occasional tongue on his neck. No help. Not a bit of help.\n\n \n\n“Thorin-” Bilbo means to point out that they are very much outside, but his voice is embarrassingly breathy and thin. Thorin’s fingers dig into his back and Bilbo feels the groan reverberate against his neck as the dwarf mouths at his pulse and sucks sharply, sending Bilbo’s sentence off into a high, reedy little noise. His hands scramble at Thorin’s back for a second, then fist in his hair and if Bilbo were a bit more in his right mind he’d worry about pulling, though Thorin seems unconcerned.\n\n \n\nThorin moves away from his mark, dragging kisses along Bilbo’s neck up to his ear, which he lightly drags his teeth against and sends Bilbo’s world askew in the process. Bilbo had never really thought much about ears as being particularly intimate, but Thorin is making a very good argument with his teeth and tongue. There are sparks flashing all over him, he’s sure of it. He can’t catch his breath or keep a hold on the tiny noises that escape his throat, and there’s a huff of air that Bilbo suspects is a laugh as Thorin delicately traces the ridges of his ear and sucks the tip into his mouth.\n\n \n\n“Thorin!” And this time Bilbo isn’t really sure what he’s asking for or if he really has a thought behind the whine he makes. He can’t get enough air into his lungs and can barely keep himself upright against this onslaught.\n\n \n\nThorin releases Bilbo’s ear, only to kiss the sensitive skin behind it.  “Stay with me for the night.” He says, his voice is low, heated and smooth. And, it seems, designed solely to grab at something hot and fluttering in Bilbo’s chest. “Forever,” he adds, “but now, for the night.” Just in case Bilbo fails to catch his meaning, he opens his mouth against Bilbo’s neck again, hands sliding down to duck up beneath the mithril shirt, and dragging up along bare skin. “Akhjamu'e amule'mê, amrâl’im'ê.”\n\n \n\nBilbo pants, tightens his fists in Thorin’s hair, and buries his face into his shoulder as he tries to get his head together. Thorin doesn’t let go or loosen his grip, but he does move up to give a gentle, less heated kiss to Bilbo’s temple as Bilbo resettles himself past the rushing in his head.\n\n \n\nIt’s not that he had never thought about it, there had been the odd moment here or there; when Thorin would hug him, or in the quiet moments where they were sitting close enough that Bilbo could feel the brush of their shoulders with each inhale. But he’d never really let it go on past the light ‘what if’ fantasies. Though he also hadn’t thought about much beyond general kissing, and that had ended up working out more than alright.\n\n \n\nThorin carefully pulls his hands out from under the mithril, resting them over Bilbo’s shirt and rubbing calm circles against his back. And it’s that, that finally settles him. Bilbo exhales, relaxes against Thorin and lets himself close his eyes and just be held for a few calm moments. It’s the same safe, surrounding feeling he’s always had from Thorin, and it’s no different here than it is with anything else. It’s the steadying support that lets him do mad things and rush into the wild unknown.\n\n \n\n“It’s alright, if you do not.” Thorin says gently, lips still pressed to Bilbo’s temple. “You don’t have to-”\n\n \n\n“Alright.” Bilbo says suddenly, nodding quickly against Thorin’s shoulder and heart starting to pick up beat again. “I-yeah. Yes. I’m- I can do that. Definitely.”\n\n \n\nThorin inhales sharply, and the gentle stroking along his back presses just that much harder against his spine. There’s another quick kiss to his head, then Thorin leans back just slightly, grinning broad and bright. “You’re sure?”\n\n \n\n“Yes!” Bilbo huffs, face heating up. “I wouldn’t say it if I didn’t want-” Once again, he’s cut off by Thorin pulling him up into a hard kiss, one hand hooked firmly behind his back and the other resting along his jawline. Bilbo flails a bit when he’s nearly lifted off the ground and gets a good grip on Thorin’s back as everything narrows down to hands and teeth and tongues and-\n\n \n\nHis stomach interrupts with a loud rumbling sound, and he distantly wonders if perhaps there is another dragon out there that could eat him right then as Thorin freezes. There’s a small pause as Thorin leans back to look down at him with raised eyebrows, and Bilbo opens his mouth right as his stomach makes itself known again.\n\n \n\n“I’m sorry I am so-” Where is that dragon. Where is that dragon so he can just end everything right here. “I got caught up in everything since getting here and I didn’t get a chance to eat anything since- I am so sorry. Can we just-?”\n\n \n\nThorin slowly lowers his head to set his forehead heavily on Bilbo’s shoulder with a long, strained sigh. “Mahal akhjamu tulmel’e.” He mutters. “Save me from the halflings.”\n\n \n\n“I am so sorry.” Bilbo whispers, absolutely mortified. Thorin huffs out another sigh and grabs onto Bilbo’s head again, pushing their foreheads together with a bit of force and Bilbo really can’t tell if he’s laughing or just shaking.\n\n \n\n“No. No this is obviously my fault for being an ungracious host.” He says wryly.\n\n \n\n“I um. Probably. I probably should have grabbed something before coming to find you.” Bilbo admits, and Thorin is definitely laughing now, though it’s a tad desperate.\n\n \n\n“That would have been wise. You also could have mentioned this before saying you wanted to lie with me.” Bilbo clears his throat loudly and feels his face heat up even more, he’s probably letting off steam in the cool air at this point.\n\n \n\n“I am really, really sorry I didn’t-” He starts stammering out more apologies and Thorin kisses him roughly on the forehead.\n\n \n\n“Let’s go get you something before I change my mind.”  He sighs, then pulls away, and the cool air is a shock against Bilbo’s front after being pressed against Thorin for so long.\n\n \n\nIt takes them a bit of time actually getting to the dining hall where he had left the company. Which is entirely Thorin’s fault. Bilbo’s hand is kept in a tight grip as he’s practically dragged through the halls past the groups of surprised looking dwarves. At the pace Thorin is setting, they should have made it there within minutes, except for the fact that whenever there’s any hint of them being alone, Thorin will take the chance to whip around and yank Bilbo into a rough kiss. Things get muddled for a bit and time is lost in grabbing hands and searing heat before Thorin mutters some Khuzdul curse and is dragging Bilbo along again.\n\n \n\n“We really don’t need to rush.” Bilbo points out, stumbling a bit to keep up.\n\n \n\n“Yes. We do.” Thorin says firmly, marching on to where Bilbo can still hear the rest of the company laughing and yelling. The smell of meats and breads and the rest of the feast hits him and he winces as his stomach rumbles again.\n\n \n\n“You sure you don’t want to stop in and chat with the rest for a bit?” Bilbo asks, fighting down the wide grin as he’s tugged towards the room. “I need to ask Ori how his knitting is coming along.”\n\n \n\nThorin stops dead, whipping his head around to stare at Bilbo in horror. “You need to do no such thing.” He hisses, and Bilbo can’t stop from laughing at the strained grit in his voice. , Thorin narrows his eyes and tugs Bilbo in sharply, gripping him tight by the arms and leaning in to growl against his lips. “I have waited for over half a year while the quest was underway, then another year in which I thought I had lost you entirely. You will not be so cruel to make me wait while you discuss knitting with Ori. Not when I can offer a much more interesting subject.”\n\n \n\nBilbo’s mouth goes dry and his heart does an odd flip in his chest, all the heat from the wall rushing back all at once and his laugh is a little high and just a tad hysterical. “Well I imagine he’s come a long way on it, he had some really detailed knit designs and I’d be interested to see-”\n\n \n\nThorin crushes their mouths together, and Bilbo wonders if this is going to become a regular way to shut him up. He can’t exactly complain about it, seeing as every kiss so far has left him with his head spinning and his toes curling against the stone. He sighs happily and buries his fingers in the beard along Thorin's jawline, deciding to make good use of the sudden kiss.\n\n \n\nThere’s a loud cough somewhere behind him, and it’s like a bucket of ice down Bilbo’s spine.\n\n \n\nThey’re right in the bloody doorway.\n\n \n\n“So you two got that all sorted then?” Bofur asks, cackling as Bilbo cranes his head around, still very much trapped by Thorin’s grip on him, to stare in mortification at the assortment of grinning faces.\n\n \n\n“Oh no. No no no no.” Bilbo whines, and Thorin tightens his grip on Bilbo’s arms briefly before shouldering his way between him and the company, completely unphased by the jeering cheers and applause as he strides in. Bilbo covers his face with a hand after Bofur winks at him.\n\n \n\n“So you are aware this time, Master Baggins, of what’s going on now? Or is that bruise just a friendly token?” Bofur asks and Bilbo claps a hand to his neck, voice only managing a high noise of sputtering terror. Any hope from salvation from Thorin vanishes when he sees the wide grin on the king’s face. The absolute bastard. Bilbo is painfully aware of several details; like how mussed Thorin’s hair is, and the fact that his own shirt is awkwardly hitched and untucked around his bracers.\n\n \n\n“Ah, Thorin,” Balin smiles and clears his throat, kindly not staring at Bilbo like everyone else while Thorin marches to the table. “The mastercrafter from the western slope came by, he wanted to know if-”\n\n \n\n“I don’t care.”\n\n \n\n“Right. Thought not. Will you two be stay-”\n\n \n\n“No.” Thorin reaches over Gloin to roughly grab a plate piled with rolls and slices of meat. “We’re taking this, don’t wait for us.”\n\n \n\nBilbo wonders again if the dragon could show back up and kill him off right now. The company is all grinning hugely at him, and Bifur gives him and enthusiastic thumbs up as Thorin turns with his plate.\n\n \n\n\"I might faint.” He informs Thorin as the dwarf marches back to him. Thorin just puts a hand on his back and firmly takes him back out of the room, grinning at the applause and cheers that follow them.\n\n \n\n“No you’re not.”\n\n \n\n“I really might. That was mortifying. That was absolutely one of the worst-”\n\n \n\n“Well they would have found out eventually.” Thorin shrugs, not seeming to understand what an absolute problem it is that they're being seen off with shouts of what he's sure are absolute filth in Khuzdul. Bilbo grits his teeth and realizes that this is not something that he is going to win. Dwarves.\n\n \n\n“Here.” Thorin says, shoving a roll of bread into Bilbo’s hands as they walk. “Eat that.”\n\n \n\n“Are you trying to fill me up before we get to your rooms?” Bilbo asks, his smile coming back as he bites into the roll.\n\n \n\n“Yes. I am. I only have so much patience and you are testing it.” Thorin steers them up wide steps lined with grim looking statues of crowned dwarves towards a set of wide, solid oak doors.\n\n \n\n“I’m not doing anything.” Bilbo points out, grinning at the look Thorin gives him as he pushes the door open.\n\n \n\nHe wasn’t really sure what he was expecting from the King’s chambers, and he’s not sure if he’s surprised or not. The high, vaulted ceiling is expected, and the large pillars carved with crowned ravens and huge stone axes certainly fit in with the grandeur of the rest of the mountain. A fireplace that’s easily as tall as an elf, already lit with a roaring fire, fills the room with a gentle gold light that softens the dark stone and sharp geometric lines criss-crossing over every available surface. The walls are draped in blue and a deep red, banners showing a raven perched on an oak branch lining the walls. There’s a table covered in papers, a separate table and chair with a pitcher and a few solid, silvery cups, and thin veins of gold through the stone adding a fluid organic look to the otherwise sharp and measured space.\n\n \n\nBilbo silently notes that besides the natural veins of unmined metal, there isn’t a glimmer of gold in the room, and a few places of suspiciously scraped stone.\n\n \n\n“A far cry from a cozy hobbit hole, I’m afraid.” Thorin says quietly as he shuts the door. There’s a smile like he’s trying to pass it off as a joke, but Bilbo can hear the little question in it and smiles warmly around the honestly intimidating space.\n\n \n\n“Oh it’s not too bad.” He says, looking up at the daunting pillars and harsh rock. “A few little homey touches here and there, is all it needs.”\n\n \n\nThorin sets the plate down at the table and pulls Bilbo to him by the hand, sighing softly and holding him loosely as he kisses him on the forehead. “I’d like that.”\n\n \n\n“Well,” Bilbo gives a quick kiss to Thorin’s cheek, tugging lightly on one of his braids. “It’s a good thing I brought my furniture with me then.” He steps away to sit at the table, grinning at Thorin’s dumbfounded expression.\n\n \n\n“Did you really?” Thorin asks, keeping a hand on Bilbo’s back as he pulls a chair up as close as he can besides the hobbit, looking slightly dazed. Bilbo nods, grabbing a bit of roast and shoving it between the halves of two loaves. He holds a bit out to Thorin, who just shakes his head and continues lightly running his hand up and down Bilbo’s back.\n\n \n\n“I have a whole cart that Balin has tucked away somewhere.” He explains between bites. “Packed up my favorite belongings from Bag End, wrote up a will, and left everything else to my cousins.”\n\n \n\n“You really came meaning to stay here.” Thorin says, eyes wide and staring at Bilbo like he was some incredible, awe inspiring thing. As if it’s absolutely amazing that Bilbo did something as simple as pack up and leave the Shire. Bilbo shrugs and busies himself with his food, face flushing at the open wonder in Thorin’s face, and flushing more as the hand on his back slides up to lightly play with the hair along the nape of his neck.\n\n \n\n“Yes. Well. That’s usually what goes along with accepting marriage proposals. Or at least knowingly accepting them.”\n\n \n\nThorin’s laugh is a quick little exhale, and he leans in to kiss Bilbo’s temple, which Bilbo is starting to suspect will definitely be a regular thing. The hand on his neck shifts into an arm around his shoulders, holding him as Thorin buries his face in Bilbo’s hair with a brushing sigh. They sit like that in the comfortable silence that Bilbo’s always loved between them. Thorin simply breathing against him and Bilbo enjoying the warmth and the first meal he's had since leaving Dale earlier in the day.\n\n \n\n“You’ve calmed down a bit.” Bilbo notes, reaching up to rest his hand over the one cupping his shoulder.\n\n \n\n“I’m not entirely sure you’re actually here.” Thorin admits in a small voice, and Bilbo can feel the shift of his breath against his hair. “I have dreamed-” Thorin stops, and the hand under Bilbo’s turns to grip at his fingers. “You really did not know?”\n\n \n\nBilbo turns his head a little, nuzzling along Thorin’s scruffy jawline. “That seems to be the question everyone’s been asking me. But no, until you woke up and started babbling your fool head off, I had no idea.” He chuckles, smiling when Thorin tilts his head into the nuzzling and keeps it there. “There may have been some willful ignorance on my part.”\n\n \n\n“I was not exactly trying to hide it at the end.” Thorin huffs, fingers shifting a bit to weave in with Bilbo’s. “I thought that you knew. That we were both simply waiting for a better time. It was not until after I...after the sickness. When I thought I had-”\n\n \n\n“Well we were both quite the idiots.” Bilbo says quickly, before Thorin could start spiraling into self loathing regret again. He turns his head to kiss Thorin’s cheek again. “We got it all sorted out though.”\n\n \n\n“We did.” Thorin agrees, pulling back just enough to move in and kiss Bilbo as carefully as he had the first time. Bilbo tilts his head into it, and Thorin moves his other hand to rest against Bilbo’s side. It’s calm, soft and inviting and unrushed, and Bilbo leans in and lets just the slow drag of lips and the broad hand on his ribs take over.\n\n \n\nThe build is slow, gradual and steady. It’s in a hand cupping his jaw, fingertips stroking along his cheekbones, the arm around his shoulders pulling him in and Thorin’s shaking sigh when Bilbo opens his mouth into the kiss, hesitantly running his tongue along the seam of Thorin’s lips.\n\n \n\nIt picks up quickly after that, when Thorin sucks his tongue into his own mouth, scraping teeth over his lips and digging fingers into the soft skin at the crook of Bilbo’s jaw. “Please tell me,” Thorin murmurs, nipping at Bilbo’s bottom lip and continuing to press small kisses to the corners of his mouth between words, “that you’ve had enough food now.”\n\n \n\nBilbo blinks rapidly, taking a few moments to process words, or how to put them into a coherent sentence. It takes another few moments to get his tingling and swollen lips to cooperate enough to form said words. “What? Yeah. Yes. Yes I’m fine now, that was fine.”\n\n \n\n“Good.” Thorin growls, both hands suddenly grabbing at Bilbo’s waist and unceremoniously hauling him over. Bilbo squawks and flails for a second as he’s yanked onto Thorin’s lap, face heating up again. He feels like he should really put his foot down on this sort of rough handling, but Thorin’s mouth is back at his neck and he’s having trouble remembering what he’s protesting. So instead he decides it’s best to just let it happen, and he settles fully astride Thorin’s thighs, heart pounding and breath catching as he runs his fingers through the long black hair in front of him.\n\n \n\nThorin’s hands slide down his back, gripping briefly at Bilbo’s rear and tugging him in closer and oh Shire’s hills and rivers. There’s heat pooling down low and, more importantly, he can feel the press of heat against his inner thigh. His lungs nearly stop up entirely and he’s sure his heart does. His voice cracks on a small sound as it hits him that this is definitely happening and Thorin is definitely tugging at his bracers while pressing hard against his leg. This isn’t some dream to be quickly shoved away in the morning, and all of a sudden Bilbo can’t get it going fast enough.\n\n \n\nIt should be terrifying, and in a way is. But it’s the adrenaline rush of the unknown, his heart pounding and his head swimming as he quickly shrugs his bracers off. Thorin’s fingers dig in briefly, then slide around and up, fumbling at Bilbo’s shirt buttons as he keeps pressing hot, open kisses that are mostly tongue and teeth against every bit of skin exposed.\n\n \n\n“Thorin.” Bilbo’s voice catches and he has to swallow a bit to get it working again, shivering when Thorin groans deep against the skin at the base of his throat. “Thorin wait-wait just a. No no don’t stop don’t- you’re fine let me just-” He unwinds his hands from the death grip they had on Thorin’s hair and scrambles a bit at his shirt buttons, making faster work of it than Thorin’s fumbling. He leans back and laughs breathlessly when Thorin shoves the shirt down his arms as soon as the last button opens, throwing it to the side and reattaching his mouth to Bilbo’s collarbone.\n\n \n\n“Hold on hold on.” Bilbo huffs, laughing again when Thorin snarls some Khuzdul when he leans away from the kisses. “Let me-” He quickly tugs the mithril collar up over his head, and within seconds there are hands sliding up his bare sides and lifting the metal shirt up and off of him with a slow, deliberate reverence. Bilbo lifts his arms and lets Thorin carefully pull the mithril up over him, feeling a reversed version of the heavy, careful meaning that had hung in the air when Thorin had first held it out for Bilbo to put on. Thorin’s less careless than he was with Bilbo’s overshirt, carefully taking the mithril and laying it on the table, not taking his eyes from Bilbo the entire time.\n\n \n\nBilbo had never put enough thought into his body to be self conscious. There was never anyone to see it, and whenever they did it wasn’t in situations where Bilbo cared what he looked like. But now Thorin’s hands are settling against his side as Thorin openly stares at him with wide, dark eyes, dragging his gaze over Bilbo’s exposed torso, and Bilbo tries to fight the urge to squirm under the heavy look. He’s painfully aware of how generally unbuilt he is. His shoulders are laughable compared to Thorin’s broad build, and while by hobbit standards he’s waifish, there’s still a softness to his midsection and he knows that whatever muscles he’s gained over the journey, while impressive for halflings, are softened by curves of plumpness.\n\n \n\nThe callouses on Thorin’s palms, much thicker on his right than his left, catch at Bilbo’s comparatively tender skin and make everything feel ten times more sensitive. Bilbo does start to squirm a bit under the slow, steady drags over him, sliding up his middle then down his arms, pausing to dip fingers into the soft skin at his belly and feel his ribs through his flesh.\n\n \n\n“Abnâm’sulum.” Thorin breathes, one hand continuing it’s slow exploration of Bilbo’s torso while the other slides up to rest along his neck. “You’re perfect.” He goes on, and Bilbo has to lean in and kiss him hard before anything else comes out and makes him combust on the spot.\n\n \n\n“This is really unfair” Bilbo points out, tugging a bit on Thorin’s collar, and the dwarf laughs warmly, kissing down along Bilbo’s jaw.\n\n \n\n“I’m enjoying myself.” He says, grinning wide against Bilbo’s skin. Bilbo snorts and tugs sharply at one of his braids, flushing when Thorin keeps dragging his hands over him.\n\n \n\n“Come on,” He says, climbing off with some difficulty and tugging at Thorin. “Get up. I don’t want to think about how long it’ll take to get you out of all those layers.”\n\n \n\n“Thought about it much?” Thorin asks, grin absolutely wicked as he pushes himself up and right into Bilbo’s space. It hits Bilbo very suddenly how much bigger Thorin is, in height and in general breadth, and how much smaller Bilbo feels with his bare skin hitting the air and Thorin leaning over him, hooking a finger under his jaw to tilt his face up into a slow, deep kiss.\n\n \n\n“Come on.” Bilbo says again, voice a tad unsteady when he breaks from the kiss. He tugs at Thorin's wide belt with far more daring than he really feels.  “I don’t understand over half the clasps or ties on all of this, and I don’t really have the patience to figure them out right now.”\n\n \n\nThorin chuckles, rich and deep, and leans down to keep pressing kiss after kiss to Bilbo's mouth, moving from lip to lip and corner to corner while he slowly unclasps his belt and lets it fall with a heavy thunk to the floor. Bilbo grabs at his head and pulls him down for a deeper kiss, face flushing and eyes shut against Thorin's curled smile and the shifting of cloth and clinks of mail. Thorin is slow, methodical, and it's almost too intimate for Bilbo to watch, so he keeps his eyes closed and focuses on Thorin's lips on his and his tongue in his mouth while his heart pounds heavy as each layer falls to the floor with an audible rustle or thump.\n\n \n\nHe's only allowed to shut it out for so long, then there are large hands enveloping his own, tugging them out of Thorin's hair and pulling them down steadily. Bilbo feels the thin, supple cloth of Thorin's undershirt brushing against his fingertips and then Thorin's guiding his hands up and under. His palms hit skin and Bilbo has to stop there for a second, breathing heavily against Thorin's mouth and slowly settling his hands against Thorin's sides. It's softer than expected, but it's like the softness of fine suede leather over steel. There's no give to Thorin's skin, just a slight suppleness and hard muscle and steady heat.\n\n \n\nBilbo's eyes stay shut and he's horribly aware that his hand are shaking when he gets the courage to slide them up along Thorin's sides. It may be worse, he realizes, not looking. Because he's left feeling every dip and rise of a scar under his palm and the firm hills of Thorin's muscles. He can feel every catch in Thorin's lungs and how it goes with the sharp sounds of his inhales, hitching as Bilbo continues his slow journey, the shirt bunching up over his wrists.\n\n \n\n\"Are you alright?\" Thorin asks, voice low, hoarse, and tinged with concern.\n\n \n\n\"Yeah. Yeah I'm alright. It's alright. Very alright. I just-there's a lot of.\" Skin. There is a lot of skin. And a lot of Thorin. He's being ridiculous, he realizes, and grits his jaw in annoyance at his own absurdity and forces his eyes open. And everything is worse and so, so much better. Because he can see his hands up to Thorin's chest, the shirt rucked up and showing what is indeed, a lot of skin. And muscle. And the line of dark hair running down the center of Thorin's stomach down into his pants. And the very, very defined bulge in said pants, which Bilbo stares at for a few seconds longer than is decent before looking up and freezing at Thorin's dark stare.\n\n \n\nThorin grins, wide and full of teeth, and pulls his shirt the rest of the way off, letting it fall into a pile on the floor with Bilbo's shirt and kissing Bilbo's slack jawed expression away.\n\n \n\nThings were slow before, steady drags and hot molasses in the air and the sudden, tumbled rush is like a long fall. When Thorin pulls him in there's skin on skin and hands on his skin and skin under his hands. There's Thorin's heartbeat pounding against him and when he flings his arms over Thorin's shoulders to hold himself up there's hard muscle bunched under his gripping fingers. His voice cracks on the smallest, breathiest sound and Thorin's low growl in answer shoots right down his spine. All the shyness that had overcome him just seconds ago goes flying down the mountain as he grasps at skin and muscle and practically climbs Thorin, who hauls him up and half stumbles, half carries him to the bed.\n\n \n\nThere's a bit of a confused tumble after Thorin tried throwing him down onto the thick fur blanket and was foiled by the fact that Bilbo wouldn't let go of his shoulders. They nearly go falling right back off onto the floor in a pile of grabbing hands and locked lips but Bilbo manages to break away enough to scramble back fully onto the bed. He's barely up and on it before Thorin's on him again, bowling him over with a hard kiss and heavy weight that pushes him back into the soft mattress. He runs his hands up and down Thorin's back, pressed down and surrounded and whining softly at the crush of it all and feeling certain that Thorin's hands holding and grabbing at him are the only things keeping him together.\n\n \n\n\"Amral'imê.\" Thorin pants into the kiss, the word falling against Bilbo's parted lips and Bilbo can only manage a small little noise in response, his harsh breathing echoing loud and crashing in his head. Thorin settles more fully over him and he parts his legs to accomodate without thinking about it, without preparing for feeling Thorin's erection press through cloth against his own with a nearly unbearable heat and throbbing pressure.\n\n \n\n\"Fasâk, Bilbo.\" Thorin groans, deep and wrecked. Bilbo only whimpers softly, head falling back on the fur and lungs heaving at desperate grabs for air.\n\n \n\nThorin kisses him on his forehead, his nose, his cheeks. \"Are you alright?\"\n\n \n\n\"Wh-? What?\" Bilbo blinks, whines again when he shifts and feels Thorin against his erection, and tries to remember how talking worked. \"What? Yes. Yes alright I'm ok Thorin, don't- please don't try and ask me to be coherent right now!\" Thorin makes a low sound and presses his forehead to Bilbo's, forearms braced on either side of the hobbit's head and locking him in as he hesitantly rolls his hips. The hot, grinding drag and pressure has Bilbo clawing at Thorin's back, voice catching on little broken noises with every other gasp of air, though his little sounds are lost in Thorin's wrecked, growling moan.\n\n \n\n\"Fasâk!\" He hisses again, hips starting a slow, steady roll against Bilbo's. \"Bilbo. Tell me if you want- if I need to-\"\n\n \n\n\"Yes yes alright just-\" Bilbo lifts his hips back, biting his lip at the pressure that's too much and definitely not enough. \"Just yes to whatever you're thinking. Stop asking me if I'm alright I can barely think right now.\"\n\n \n\n\"If you don't-\"\n\n \n\n\"If I don't like something I'll hit you!\" Bilbo snaps, tempted to start hitting the fool dwarf right now for delaying things. \"So far whatever you're wanting has been fantastic so just- oh hell!\" Thorin took Bilbo's words to heart, and cuts his line of thought off with a sharp grind of his hips and teeth nipping at his ear.\n\n \n\n\"Izril'ê 'ubd'mê maigrifi'ê.\" Thorin gasps, rough and wrecked against Bilbo's ear and Bilbo has no idea what he's saying but nods anyway, biting his lip when Thorin leans back just enough to get to the button of Bilbo's trousers and yank them down. Bilbo is so far past self consciousness and eagerly lifts his hips, flailing his legs a bit to kick the offending cloth away and is quickly sitting up and pulling at the string of Thorin's pants.\n\n \n\n\"Let me-\" Thorin huffs, kneeling between Bilbo's legs and bowing over to kiss Bilbo with a fevered desperation as he struggles to yank his boots off and shove his way out of his pants, which get added to the spread out pile on the floor.\n\n \n\nBilbo breaks the kiss to lay back against the bed, but stops short halfway down when he gets an eyefull of all of Thorin. There's muscle and scars, dark hair only accentuating the broad planes of his chest and stomach and helpfully leading Bilbo's eyes down to the very erect, very flushed and thick cock jutting straight out from the black hair.\n\n \n\n\"Oh.\" Bilbo squeaks, mouth falling open a bit and oh gods he shouldn't be staring but he's close to bursting into strained and hysterical giggles because there is so much going on there and it's all leaning over him with a solid strength that leaves Bilbo wondering if this is what it's like being made love to by a solid block of stone come to life. He's reminded of when he used to laugh to himself that Thorin was just too ridiculously attractive to be real, and this is all just confirming that.\n\n \n\n\"Any complaints?\" Thorin grins, moving forward as Bilbo lays back in response, still staring wide eyed as Thorin braces over him and looks him over with a dark, hungry look.\n\n \n\n\"No. Nono absolutely- definitely not. No complaints. None.\" Bilbo does giggle a little bit at that, reaching out to run a hand over Thorin's broad chest, feeling just slightly giddy. Thorin lowers himself and kisses Bilbo with a slow, deep purpose, running his hands from Bilbo's hips to his shoulders, then back down to sink his fingers into the soft flesh of Bilbo's rear.\n\n \n\n\"Abnâm'sulum.\" Thorin murmurs again, sucking Bilbo's lip into his mouth and scraping his teeth along the swollen flesh. Any giggling dies quickly with a gasp and soft strangled sound as Thorin settles fully over him again, legs tangled together and kissing Bilbo like it was all he could do.\n\n \n\nBilbo hooks his legs around Thorin's hips, the soft cry getting lost in Thorin's mouth when their erections grind together and he's sure he might die from the shocks of heat and friction and wet slide. Thorin's moan is a punch to the gut and the broad hand reaching between them to grasp both of them together is a shock that has Bilbo jerking at the sensation crashing over him.\n\n \n\n\"Thorin!\"\n\n \n\n\"Fasâk!\" Thorin wraps his hand firmly around both of them, trapping Bilbo's erection in heat and rough calloused hands against throbbing velvety softness. \"Keep doing that.\" Thorin pants, \"Amral'im'ê, Bilbo, keep saying my name.\"\n\n \n\nThorin's name is all he can say at this point, it's all he can think. Bilbo breaks the kiss to pant heavily, burying his face into Thorin's shoulder and sinking his fingers into his back. He's distantly aware that he's probably digging his nails into Thorin's skin but right now it's all that's keeping him grounded and steady against the slide and pull of Thorin thrusting against him and breathing harsh, sharp curses and moans into his ear.\n\n \n\nBilbo feels like he's being wound tighter and tighter, body shaking and writhing against the everbuilding sensations drowning everything out and leaving him gasping Thorin's name like a mantra to keep him sane. One of his hands lets go of Thorin's back to fling up over his head, scrambling at the fur beneath him and tangling his fingers in it. Thorin shifts his weight, supporting it on his elbow so he can keep the steady pulling with his fist on both of the and clutch at Bilbo's hand at the same time.\n\n \n\n\"Bilbo, amral'mê. Maigrifi'mê, Bilbo.\" Thorin's voice catches, breaks down into a deep, rough pant of moaned words and Bilbo can feel the heated coil in him start to break. His nails sink into Thorin's back and he clutches desperately at the hand holding his against the furs, his back arching and breathing in gulping gasps.\n\n \n\n\"Thorin-! Thorin, I-\" And it hits him so hard and fast that he's shocked at the force of it, mouth open and gaping on stopped up air and body jerking suddenly as he releases over himself and Thorin's hand. The sound he makes is a strained, high noise that barely makes it past his lungs and he's still gasping through it when Thorin practically roars in his ear. Bilbo's hand feels like it may break in Thorin's grip and he hardly cares when he feels the hot, wet streaks on his stomach. They shudder and grasp at each other for a few moments, air buzzing and thick as Bilbo tries to get his lungs to start working again.\n\n \n\n\"Oh gods and Shire bless...\" Bilbo whimpers, shivering as he crashes back down into himself. Thorin kisses him a bit sloppily, still catching his breath with low, throaty noises and flopping with a heavy thud besides Bilbo. As soon as he's down there's a thick arm reaching out and pulling Bilbo in, pillowing his head on Thorin's bicep.\n\n \n\nBilbo slides an arm around Thorin's waist, head tucked up under the dwarfs chin and he feels like he's lit up all over. His muscles are sore and there's a cramp forming in his thigh and he can feel scraped areas of skin from Thorin's beard on his neck and face but really,really could not care a bit right now.\n\n \n\n\"Welcome home.\" Thorin rumbles, and Bilbo laughs a little breathlessly, curled and tucked against Thorin's chest.\n\n \n\n\"I should leave again, just to come back if that's the welcome I'll get each time.\"\n\n \n\nThorin's arms tighten around him, stiff and unyielding. \"Don't.\" He says, voice soft and open. \"Not again.\"\n\n \n\nBilbo nods quickly against his chest, curling his fingers against Thorin's side. \"No. No I won't. Not again. I won't.\" He feels Thorin's sharp, long exhale, and the ruffle of breath as Thorin tucks his face into Bilbo's hair.\n\n \n\n\"Don't be a dream.\" Thorin says, so soft and quiet that Bilbo has the feeling that it's not exactly meant to be heard. He leans away from Thorin's chest, working one hand up in the scant space between them to cup his face and ease him into a slow kiss. Thorin relaxes, sighing into it and following Bilbo's short kiss with a few soft, lingering ones.\n\n \n\n\"I'm not. I'll be here, I promise. I'll be here in the morning, and the morning after that and so on. I'm back.\"\n\n \n\nThorin's smile is slow to grow, but so full and painfully vulnerable that Bilbo has to duck down to hide his face against the dwarf's shoulder again. Thorin's arms wrap all around him, and the silence falls over them in the hush of steady breathing.\n\n \n\nHe falls asleep so gradually that he isn't fully aware of it, and as promised, he's there in the morning. And the morning after that, and after that, and so on through the years.\n\n   \n"
}