{
    "id": "28423923",
    "url": "https://archiveofourown.org/works/28423923?view_full_work=true",
    "author": [
        "ive_been_losing_sleep"
    ],
    "title": "not stolen",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Multi"
    ],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Aizawa Shouta | Eraserhead/Yamada Hizashi | Present Mic",
        "Aizawa Shouta | Eraserhead & Midoriya Izuku",
        "Midoriya Izuku & Yamada Hizashi | Present Mic"
    ],
    "characters": [
        "Midoriya Izuku",
        "Aizawa Shouta | Eraserhead",
        "Yamada Hizashi | Present Mic",
        "Tsukauchi Naomasa"
    ],
    "additional_tags": [
        "Married Aizawa Shouta | Eraserhead/Yamada Hizashi | Present Mic",
        "Aizawa Shouta | Eraserhead Adopts Midoriya Izuku",
        "Yamada Hizashi | Present Mic Adopts Midoriya Izuku",
        "Parental Aizawa Shouta | Eraserhead",
        "Parental Yamada Hizashi | Present Mic",
        "Midoriya Izuku Has a Quirk",
        "Midoriya Izuku Has All for One Quirk",
        "Sensei | All For One is Midoriya Hisashi",
        "Deaf Yamada Hizashi | Present Mic",
        "Yagi Toshinori | All Might Bashing",
        "Midoriya Izuku Does Not Have One for All Quirk",
        "Adopted Midoriya Izuku",
        "no beta we're detroit smashed by all might",
        "Implied/Referenced Child Abuse"
    ],
    "language": "English",
    "series": "Part 1 of not stolen, only borrowed",
    "published": "2020-12-30",
    "completed": "2021-01-08",
    "words": "19,496",
    "chapters": "4/4",
    "comments": "274",
    "kudos": "11,968",
    "bookmarks": "1,684",
    "hits": "127,521",
    "summary": "<p>Izuku hated his Quirk, and he hated what he thought his dad would do with it even more. So he would keep pretending, even if it made his dad angry. He would wait, and one day heroes would come to save him. </p>\n<p>And finally, they do.</p>\n<p>Izuku woke up</p>\n<p>Izuku goes home with two pro heroes.</p>\n<p>Izuku laughs</p>",
    "notes": "<p>howdy y'all</p>\n<p>why do i love adoption fics so goshdarn much? is it because i am starved for parental affection in my own life and think it's beautiful when complete strangers find a child and decide \"yes they are ours now\"? Mayhaps...</p>\n<p>Anywhosie, I've been reading a lot of dadzawa fics lately and this idea sprung into my head and i decided i have nothing better to do with my life than regurgitate my thoughts onto my laptop and share it with the world. so here it is :)</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>hmmm? izuku's quirk is erasure then? but the tags say... i wonder what's happening here </p>\n<p>please leave a kudos or even a comment if you enjoyed! it brings me such serotonin to know others enjoy the things i put out! </p>\n<p>Next chapter should be up monday, but don't be concerned if it's a little later on tuesday. i wish you all a safe and happy (hopefully uneventful) new year!</p>\n<p>as you can see, this ain't the final chapter after all! i increased the chapter count by one, so you have something to look forward to this week :) </p>\n<p>enjoy!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>y'all i just want to add that, while i know at least a fair amount of ASL, japanese sign language is obviously not the same thing. i've attempted to do some research, because i would hate to portray anything inaccurately, but resources on english to JSL are not very common apparently lol. because of this, my descriptions of the signing in this work are going to be influenced by my knowledge of how ASL is structured since that is the best i can do with the resources i have. the characters are still using JSL, though, and if any point someone who is well-versed in this than i am notices i have made an error or written something inaccurate, please let me know. i'm doing the best with what i can. </p>\n<p>ALSO: chapter count has gone up by one! I just really wanted to end this here, ladies and gentlepeople, i'm sure you understand why. Next chapter will go up friday (maybe Thursday if i get it done and feel like y'all deserve a treat), and then I'll get crackin' on the next fic in the series, so if u want more of this au make sure you subscribe to the series as a whole. </p>\n<p>see y'all then!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>thank yall so much for reading!! if you're interested in where else i take this au, please subscribe to the series not stolen, only borrowed. the next work takes place at the start of canon, and i should be posting the first chapter of it by the end of the month :)</p>\n<p>i also have some other ideas in my pocket for bnha au's, some of which will also have some quality dadzawa and probably dadmic too (because i love them both), and some ideas for deku w/ dif quirks, so if those sound like something you'd like, be on the look out! i'm in the middle of writing one rn with some solid aizawa &amp; deku and shindeku, which i'm very excited for</p>\n<p>again, thank you so much for reading, commenting, and interacting in any way! i am so amazed by you all. see you soon!</p>\n<p>i hope you enjoyed!!! if you did, please leave a kudos or even comment to let me know!!! if you didn't... please don't leave a comment, i'm sensitive. </p>\n<p>I aim to update this (and eventually the next work which will be a BEHEMOTH) on Mondays and Fridays. See you then!</p>\n<p>my tumblr: <a href=\"https://sage-the-ginger.tumblr.com/\" rel=\"nofollow\">sage-the-ginger</a></p>",
    "text": "\n He had been in the dark room for a long time. \n\n\n It wasn’t the first time he’d been put in the dark room, but he thought it might have been the longest. His dad was really mad when he saw him last, when he had disappointed him again. \n\n\n Sometimes, sometimes, there would be the sliver of light coming from the door to his room. It was nothing more than a thin, weak beam from the slot where his family passed him food. The moment he adjusted to it, his eyes squinting at the beautiful light slicing through the darkness, it would be gone. The light would disappear with a clatter as the metal slot slammed shut and his meal was dropped onto the floor. \n\n\n Once, a while ago, he had waited next to that slot, waited for the light to shine in, and the moment it did, he reached with his covered hands, eyes shut tight against the sharp, wonderful light. He fit a tiny hand into that small sliver of an opening out of his room, and reached—\n\n\n And the harsh metal of the grate slammed down on him. \n\n\n Even now, his wrist still ached from where it had been caught in the slot of his door, only slightly cushioned by the fabric of his mitts. He decided then that the light wasn’t worth reaching for and resigned himself to darkness. \n\n\n It wasn’t pitch black after all. There was enough light diffusing from somewhere that he could see the vague outlines of his meals and his bed. If he squinted really hard, he could just about see the shapes he drew with his crayons onto the floor below him. \n\n\n And at least the dark room wasn’t like the white room. He hated the white room. The white room meant tests and training, and it always ended with his dad getting disappointed and then getting angry. Then, after the white room and after the shouting, he was thrown in the dark room.\n\n\n His dad was always angry when he didn’t use his Quirk like he was supposed to. \n\n\n His Quirk was bad. He didn’t want to use it, he didn’t like using it, and he knew if he told his dad what it could actually do then he’d make him use it. And then things would get so much worse.  So instead, he pretended, and he waited in the dark room. \n\n\n One day, he would be able to leave. He knew there were heroes out there. He heard his dad and the others talk about them sometimes. They were afraid of the heroes! Because the heroes stopped the bad people like his dad! He just had to wait until the bad person they stopped was his dad. Then he could leave. \n\n\n For now, though, he’d wait in the dark and eat his food and draw happy pictures on the stone beneath him. He would ignore the aching, awful pain in his hands and the ache in his belly. He could wait. Soon the door would open, and his dad would be waiting there for him, and it would all repeat itself over again. But one day he’ll be able to leave, and he won’t have to be afraid of his dad anymore. \n\n\n So Izuku waited, and the door did open. \n\n\n And this time it wasn’t his dad standing there. \n\n \n \n\n The last thing Aizawa Shouta expected to find in the villain hideout was a goddamn child. \n\n\n A small, malnourished, injured child with haunted green eyes that stared blankly at the pro hero illuminated by the light pouring from the open door behind him. \n\n\n The room—the cell—housing the child was absurdly small. No windows. The only door was the locked, steel-reinforced behemoth Shouta had just charged through. A bare mattress laid in the corner, covered with a single threadbare sheet and a pile of musty rags—clothes?—folded at the foot of it. A metal toilet was embedded in the far wall. The center of the concrete floor was scribbled with nonsensical shapes, likely caused by the crayons strewn haphazardly across the room. \n\n\n The child himself was huddled fearfully in a corner. He was so, so small, just a kid. Maybe five? But hard to tell with how little meat there was on his bones. Too young to be faced with the horrors Shouta was sure he had seen here. His curly hair was dark and matted, covering the tops of those wide, green eyes that stared at Shouta without seeming to actually see him. When the door first burst open, those eyes had blinked harshly, as if unused to anything other than perpetual darkness. His hands, covered entirely by some kind of thick fabric, pulled tightly on his knobby knees as the child hunched further into himself, attempting to disappear into the shadows of the room entirely. \n\n\n Silently wishing that it had been Hizashi who had found the kid instead—loud, vibrant, cheerful Hizashi who could make just about anyone smile—Shouta resigned himself to dealing with the problem at hand. He sat down in the room’s entryway, knowing that crowding a scared child could have similar repercussions as cornering an injured animal. The child watched him steadily, waiting for a strike that will never come—never from Shouta, at least. \n\n\n Slowly, so that every movement was telegraphed, Shouta reached for the comm nestled into his ear and pulled it out, extinguishing the annoying shouts of triumph from the other heroes in the raid and the stringent orders of policemen concerned about protocol. This room concluded his sweep of the building’s basement, confirming that no other villains were hiding away in the lair. The chatter would only distract him, after all. The others could figure out semantics without his input for the moment, while he focused on a child who has likely experienced too much too young. \n\n\n “You can relax, kid,” Shouta stated bluntly, only barely remembering to soften his voice from his typical stern cadence. Even then, it came out more gruff than soothing, but it was about as good as Shouta could do at the end of a year-long recon mission and on just three cups of coffee today—one of them decaf, thanks to Hizashi’s worried mother-henning. “You’re safe now.”\n\n\n Doubtfully, the kid’s eyes flickered quickly over Shouta’s shoulder. \n\n\n “Look, kid, we don’t have all day.” Shouta felt his comms buzzing incessantly from where it dangled by its wire near his arm. Soon, his radio silence wouldn’t be chalked up to his charming, antisocial personality and would instead lead to cause for concern. He needed to get the kid and get out. “I’m a pro-hero, you can trust me.”\n\n\n Suddenly, a light flicked on across the kid’s face, and something like excitement passed over his eyes as he scanned Shouta, from unkempt hair falling across his face to capture weapon wrapped loosely around his neck to the bulky black boots on his feet. The boy’s body uncurled as if released from a spring. “Eraserhead!” he whispered gleefully. \n\n\n At first, Shouta was impressed that the child recognized him, before realizing that it was likely not a good thing that a child held prisoner by villains knew who you were. Shouta was good at staying under the radar, so someone must have been actively looking for him. \n\n\n But that problem would have to be dealt with later. \n\n\n “I am Eraserhead,” he confirmed. “Aizawa Shouta. Do you have a name I can call you?”\n\n\n The kid fidgeted, grasping his hands together and wringing them the best he could with the thick fabric encasing them. Now that he was more relaxed, Shouta could get a closer look at the ensemble the kid was fitted with. Whoever dressed him was likely hoping to cover as much skin as possible, with a dirty hoodie and jeans. The socks on his feet and what looked like oven mitts on his hands were tightly duct taped to the cuffs of the pants and hoodie respectively, ensuring that they couldn’t be pulled off. \n\n\n Likely a volatile, touch-based Quirk they were hoping to avoid, Shouta catalogued to himself. \n\n\n The kid shuffled, drawing Shouta’s attention back to that pale, young face. “I can leave?”\n\n\n “Yes,” Shouta agreed, and the child immediately began to stand on wobbly legs. “We can leave together. It would be faster for me to carry you.”\n\n\n “You can’t touch me,” he said, surer than any other words that had left his mouth so far, only for him to immediately backtrack with a wince. “Please, don’t touch me.”\n\n\n Watching as the child steadied himself against the wall, legs threatening to give out under his own weight, Shouta scoffed. “As if I’d let you walk out of here like that on your own, kid. What about over your clothes? As soon as we’re out, I’ll put you down.” \n\n\n And the kid stared at him again, scanning him top to bottom, and Shouta knew that this was a child who had been hurt over and over again and didn’t know what it was to be helped, but he’d be damned if he let this kid walk out of here with no one to steady him. So as soon as the kid nodded, albeit hesitantly, Shouta got to his feet and slowly, gently, lifted the boy into his arms. His thin legs wrapped around Shouta’s waist as Shouta hefted him so they were chest to chest, and the kid could wrap his own arms around Shouta’s shoulders. \n\n\n “Close your eyes, kid,” Shouta commanded softly as they made their way down the hallway, past the limp bodies of villains and lower lackeys that had resided at the base. Idly, he wondered if the kid had seen things objectively worse than the deceased bodies of those that had tortured him, but he hoped that he closed his eyes anyway. No need to add onto trauma unnecessarily. \n\n\n As he reached the stairs leading back to the ground floor, he remembered the ignored earpiece still hanging over his shoulder and popped it back into his ear. “Eraser,” he checked in, heedless of the likely unnecessary conversation he was interrupting. “Basement cleared out. All targets incapacitated. Coming out now with civilian.”\n\n\n He ignored the confusion brought upon by the mention of a civilian, since he was already reaching the door leading back to the street, where he knew a slew of cops, medics, and pro-heroes would be waiting. The kid, who had been completely still and silent for their walk away from his cell, suddenly twisted in Shouta’s grip, eyes widening as they neared the exit. Without straying his gaze from the door, he murmured, “Izuku.”\n\n\n “What?” Shouta asked, surprised that the kid said anything without prompting. \n\n\n “My name’s Izuku.” Then, as they pushed through the doors into the bright lights of police and ambulance sirens, he said, “Thank you.”\n\n \n \n\n Izuku was taken from his grip almost immediately by the medics waiting on the street. He grasped tightly to Shouta’s capture weapon, though, during the transfer, so Shouta begrudgingly let him hold onto it as he reassured him everything would be fine so long as he let the doctors look him over. “I’ll be back for it later, kid,” he promised, waiting until Izuku relaxed in the backseat of the ambulance before he trudged toward Detective Tsukauchi. \n\n\n Shouta found both Hizashi and Tsukauchi in the center of the chaos, in a heated discussion next to a cop car. Surprisingly, Hizashi managed to keep his voice down, and it wasn’t until Shouta approached that he was able to overhear their conversation. Unsurprisingly, it was centered on the unexpected minor found in the middle of a high-priority villain hideout. \n\n\n “Eraser,” Hizashi greeted. \n\n\n “Mic.”\n\n\n Always hero names on the field; never let anyone sniff out personal connections to be used as weaknesses. \n\n\n Tsukauchi simply nodded his head. “While I’m sure you’d love nothing more than to go home after a long night, Eraser, the presence of an unidentified minor… complicates things a bit. If you wouldn’t mind coming to the station with me, I can take your statement and we can figure out where to go from here.” The detective was always straight to business when it mattered, no time wasted on empty pleasantries. Shouta appreciated it. \n\n\n Ignoring Hizashi’s wailing lament of a late night, Shouta agreed easily to Tsukauchi’s request. “I assume you’ll be questioning the kid as well?”\n\n\n “We’ll have to.” Tsukauchi at least sounded reluctant to ask a likely traumatized child to rehash the circumstances of his trauma, but it couldn’t be avoided. \n\n\n “I’ll go to the station with him then, assuming his med-eval checks out, of course. He has my capture weapon.” He ignored Hizashi’s quirked eyebrow—the capture weapon was a weapon after all and wasn’t something he trusted with just anybody—and moved on. “Problem children aside, did you at least get what you needed from tonight?”\n\n\n The detective sighed. Not a good sign. “The higher-ups disappeared at the first sign of trouble, which was largely expected, but still disappointing that our countermeasures were insufficient. They disappeared in a dark mist. Some kind of warping Quirk, obviously, although we don’t know who was responsible for it. They could have been offsite for all we know. We did manage to capture some persons of interest, however, and the discovery of the child at least provides the potential for information, although it might be redundant with what we already know.”\n\n\n Hizashi frowned. “Please tell me you aren’t planning to use a traumatized child as an informant for an extremely dangerous ring of villains.”\n\n\n “I don’t much like the idea myself,” Tsukauchi admitted, “but if that is the best option to get what we need then it must be done.”\n\n\n Sensing that Hizashi wouldn’t let this go down easily, Shouta nudged their shoulders together. “Your job is done for the night, Mic. Go home, get some rest. I can send you an update after the briefing.”\n\n\n “Let me know how the kiddo’s doing too.”\n\n\n Shouta nodded, and with a final push to get him moving, Hizashi disappeared into the crowd of emergency vehicles with an exhausted, yet somehow still overenthusiastic, wave. Once he was gone, Shouta and Tsukauchi headed to the ambulances. \n\n\n Izuku lay across a gurney, drowning in the length of the capture weapon before Shouta reached to gently untangle it from him. His eyes were closed and his breathing steady, prompting an explanation from one of the two medics cutting through the fabric taped around his wrists. “He grew quite agitated when we attempted to check him over. Kiyoko-san was able to subdue him with her Quirk—”\n\n\n “If an individual is tired enough, I can lull them to sleep with a lullaby of sorts.”\n\n\n “—so we can remove his bindings. The indication of an unknown, touch-based Quirk does make things more difficult, however, since the majority of our healing Quirks rely on touch as well and using them now could pose a potential risk. We can still provide any necessary treatment through other means; it is just more complicated.”\n\n\n “How long will he be asleep?” \n\n\n “Indeterminate,” the medic with the sleep Quirk answered. “My Quirk forces the target to sleep until they can be considered ‘well-rested,’ which unfortunately is too subjective of a measure to accurately predict. Judging by the state he is in though, it will be at least twelve hours, likely longer. We can inform you when the patients wakes so you can take his statement, detective.”\n\n\n “He’ll be taken to Musutafu General, correct?” Shouta confirmed. At the medics’ nods, he pulled a card and a pen from one of the many pockets in his jumpsuit and flipped it over to write on the back. “His name is Izuku. That is all the information I was able to ascertain from him, so for now, please list me as his medical contact until we find someone more suitable. This is the information you will need to reach me.” He passed the card to the first medic. “I will come by during visiting hours tomorrow.”\n\n\n “Understood.” \n\n\n The medics bustled around the gurney. They finally freed Izuku’s hands from the thick mitts, and Shouta only barely caught a glimpse of gnarled, crooked fingers before they finished strapping the child safely to the gurney and loaded him into the ambulance. \n\n\n “I can provide my statement now, detective. Quicker I do this, the quicker I get home to rest, and it seems like it’ll be a long day tomorrow too,” Shouta grunted as they watched the ambulance drive away.\n\n\n “If you’ll come with me to the station, I’ll even make you a coffee for the trouble.”\n\n\n “Please do.”\n\n \n \n\n “I cannot believe you just let me sleep on the couch, Shou! My back’s gonna be outta wack for ages!”\n\n\n Shouta hid his smile behind the rim of his coffee cup. “I wouldn’t dare disturb you. You looked like you needed the rest.”\n\n\n When Shouta had finally shuffled into his apartment earlier that morning, his husband had been splayed uncomfortably across the living room’s short love seat. Hizashi often attempted to stay up for Shouta’s return from late night patrols and missions, although he usually succumbed to his own sleep cycle quickly. Last night, he hadn’t even washed the hair gel from his tall updo, and despite all attempts to wrangle it into a high bun this morning, blonde strands still shot out at odd angles across his scalp.\n\n\n It was quite comical, in Shouta’s opinion, even if it did lead to Hizashi halfheartedly grumbling about his poor decisions in life partners as they walked through the hallways of the hospital. Izuku was in the Victim’s Ward, a highly secure wing of the hospital meant for patients involved in villain attacks who still may be potential targets. Even after a year of long nights of recon and meeting with sketchy informants for this mission, Shouta still wasn’t entirely sure of the details surrounding the true intentions of the group of villains he had helped raid last night, with most of that information being classified from everyone aside for All Might and likely Tsukauchi as the lead detective. Yet even he knew that the group would be unhappy to find their prisoner in the hands of heroes and might decide to do something about it. \n\n\n Hence the need for security guards dutifully lining the hospital hallways, eyes lingering on the out-of-costume pros walking past. When they reached Izuku’s room, Shouta was required to scan both his hero ID and fingerprint for the door to unlock, Hizashi doing the same behind him.\n\n\n A small, prone, pale body rested on the hospital bed before them. In just a thin hospital gown, Shouta could see the full extent of the child’s physical trauma. For a brief moment, he allowed himself to be relieved by the lack of open wounds and fresh injuries, before focusing himself to look at the harm that has healed over. Izuku’s limbs were thin and frail, the bones of his wrists visible through his skin. Neat thin scars lined every inch of visible skin, too methodical in length and placement to be anything but purposeful, maybe even medical in purpose.\n\n\n And his hands. The joints bent at odd, unnatural angles. Even in sleep, his fingers curled stiffly toward his palms, reminiscent of the talons of a bird of prey.\n\n\n Hizashi hissed from beside him, pulling up a set of chairs to sit a comfortable distance from the bed. “Oh, poor kiddo. What did they do to you?”\n\n\n Shouta almost didn’t want to know. \n\n\n They didn’t wait long beside Izuku’s hospital bed before a grey-haired doctor bustled in holding a clipboard stacked with papers. After a brief minute wasted on pleasantries, the doctor recited what could be learned from Izuku’s medical analysis. \n\n\n The patient was six years old. \n\n\n No noticeable physical mutations indicating what his Quirk might be. \n\n\n Touching the patient with gloves, or any other barrier, did not produce any noticeable Quirk effect. Direct skin contact had not been attempted\n\n\n The patient was malnourished and dehydrated. An IV and special diet would be implemented to curb any lasting effects, but future issues caused by this were still a possibility. \n\n\n All present injuries had long since healed, likely naturally rather than aided by Quirk. \n\n\n The scars were caused by incisions and were of varying age. Some appear to have been healed for years, while others as recently as weeks ago. \n\n\n No wounds seemed to have caused anything more serious than artificial damage, and even seemed to largely avoid the areas of major arteries and organs. \n\n\n “The damage done to his hands is probably the most concerning,” the doctor continued, eyes only glancing up briefly from his clipboard as he talked. “There is evidence of several fractures to his metacarpals and phalanges, largely focused across his first and second fingers, which never healed properly. This is the same for both hands. He also has greenstick fractures on both the ulna and radius of his left wrist, more recent than the breaks in his fingers. It is likely that he currently has extremely limited movement and dexterity in his hands. We do have staff onsite with a Quirk which can realign his fingers into proper position, but it requires skin contact and will have to wait until we know the risks involved with his Quirk.\n\n\n “This also doesn’t even begin to mention the possibility of psychological issues these circumstances might cause in a child so young. The mind of a child is incredibly malleable, after all, but that also means that there is the possibility for healing, even if it takes serious effort from those in his life from this point forward. A child psychologist will be offered through the hospital once he is awake and stable to better understand his mental state and the best methods of healing from this point forward.\n\n\n “I understand you are not the patient’s legal guardian, but rather the pro-hero that found him after his ordeal. When it is determined whose care he’ll be entering, I will discuss his future needs for care with them. For now, I am happy to answer any questions you might have.”\n\n\n Shouta had plenty of questions, particularly concerning what kind of twisted individuals could cause such misery on a vulnerable child, but that was illogical to ask a doctor who wouldn’t know any more than Shouta did. Beside him, Hizashi was just gazing forlornly at Izuku, looking as if he wanted to grasp at those clawed hands and only just refraining from invading the child’s personal space. “That’s all we need for now. Thank you, doctor.”\n\n\n “Of course.” Finally looking up from his clipboard, which he hooked to the foot of Izuku’s bed, he frowned at the child sleeping before him. “There are terrible injustices in this world. I’m very glad that you got to him when you did, Eraserhead. I just hope that it was soon enough to reverse any damage that has been done.” \n\n\n “It’s my job,” Shouta said simply, because it was, regardless of whether he shared the doctor’s grateful sentiments. \n\n\n Hizashi scoffed fondly. \n\n\n “Well, I’m glad just the same,” the doctor continued as he moved to the door. “He’s expected to wake up by this evening, and if you two happen to be here when he does, please press the call button to let us know. A few nurses will likely be in and out, just to check in on him throughout the day, but there’s not much else we can do except keep him comfortable until we know the details of his Quirk.”\n\n\n “Thank you!” Hizashi called as the door shut behind him, volume just a little too loud to be appropriate for a hospital setting. He didn’t use his quirk, though, so perhaps he was attempting to dampen it. \n\n\n They sat in silence for a few minutes, shoulders pressed together in some semblance of comfort as they simply watched the child breathe. At some point, Hizashi yanked out his hearing aids and rested his head on Shouta’s shoulder, but his gaze still never wavered. \n\n\n “Does he have ID?” he signed after a moment, a little sloppily from his angle.\n\n\n Grumbling, because his idiot husband knew Shouta couldn’t visibly respond when Hizashi wasn’t looking at him, Shouta jostled him until they were both sitting straight. Still, their knees slotted together, neither of them refusing the comfort of physical contact. \n\n\n “Tsukauchi is looking,” Shouta responded, using the sign for true to denote Tsukauchi’s name. They’ve worked with the detective enough times to warrant the sign name. “He has nothing now.”\n\n\n Hizashi grimaced. “Where will the kid go? If he has no one?”\n\n\n At this, Shouta shrugged. It wasn’t particularly uncommon for children to be orphaned as the result of villain attacks, usually being placed in orphanages or foster homes. In Izuku’s case, however, he would likely need to be put in some form of protective custody, although Shouta isn’t sure what exactly that would entail for the child. “Maybe WP. But he might have family, people looking for him. We don’t know.”\n\n\n “He’s so small,” Hizashi murmured out loud. \n\n\n Shouta could only nod. \n\n\n They both saw a lot of despicable shit as heroes, Shouta arguably more so if only because underground heroics often entailed breaking up the seedier aspects of crime. But cases involving children were always hard to come to terms with. He’d come across a few trafficking rings, the occasional serial killer that targeted children, and those cases still sometimes caused him to lose sleep at night. But for all these cases he’d worked before, the ringleaders were nothing more than lowly, disgusting criminals. Their work was sloppy and their overall impact on society at large was small. \n\n\n In comparison, Izuku’s case was odd. Shouta had never heard of actual, bona fide villains taking interest in a singular child, especially not for extended periods of time. While he still needed to pester Tsukauchi for the full story on why this group of villains is such a concern, he knew enough to conclude that whatever it was, it was serious. Involving a child in what was undoubtedly a methodical organization of serious villains was extremely illogical. \n\n\n Unless he was somehow of use to them. \n\n\n Shouta rubbed his temples tiredly, ignoring Hizashi’s gentle, “you’re thinking too hard, darling,” as he pulled out his phone. He was going to get his answers one way or another, and since Tsukauchi would be the simplest way, it would only be polite to warn the detective beforehand. \n\n\nWhen he woke, he saw white. \n\n\n Oh, he thought. I didn’t get out. \n\n\n He was back in the white room. That wasn’t fair. A hero came for him! Promised that he could leave! So why was he back here?\n\n\n Deep in his chest, he felt his frustration bubbling, threatening to crawl up his throat and spill from his lips. He had to push it back down. He had to be quiet. They didn’t know he was awake yet, and he was too good at being quiet to let himself break that silence. \n\n\n So instead, he took stock of his body. He felt the familiar pinch of a needle in his arm, and he briefly wondered what they were putting into him this time. Whatever it was, it didn’t hurt, so he decided that he minded it less than what they usually used on him. He was surprised that he didn’t feel any other new pains, though, just the familiar ache in his hands, but, he slowly realized, even that felt oddly distant. \n\n\n That at least explained what the needle was for, anyway. It had been a while since they had given him the hazy-feeling chemicals like this. They must be going for something big today. He was probably in trouble. \n\n\n Of course, his dad would be angry that he had accepted the hero’s help. Of course, he would be in trouble after that.\n\n\n He stared up at that awful, white ceiling. He could close his eyes, pretend he was asleep like they probably wanted him to be, but he needed to see them, to get ready, when the doctors came for him. And they would come for him, with their sharp knives and their needles. \n\n\n So, he stared at the ceiling and waited. \n\n \n \n\n At some point in the four hours Shouta and Hizashi had been waiting at the hospital, the kid woke up. \n\n\n The problem was that neither of them were quite sure when exactly it happened. \n\n\n At around the two-hour mark, Shouta had bundled himself in his sleeping bag and plopped onto the cold linoleum tile of the hospital. Not to sleep, of course, but to think. Tsukauchi had responded to his request for answers quickly enough and had agreed to talk to All Might about clueing Shouta in on the finer details of who and what exactly they were dealing with. Which was frustrating in and of itself, of course, since All Might was a fool on the best of days and should hardly be dictating what Shouta did and didn’t know. \n\n\n Hizashi, meanwhile, busied himself with mindless games on his cellphone, allowing Shouta to have the space he preferred when he was stewing on something. \n\n\n While neither of them were strictly watching Izuku, there should have been some kind of outward indication that he had woken from his unconsciousness, but there wasn’t, and Shouta was only brought out of his grumbling thoughts by his husband’s startled yelp, followed by him stumbling out of his chair and tripping over the Shouta-shaped lump on the floor. \n\n\n Wrestling himself out from under Hizashi, Shouta freed himself from the mess of limbs and fabric and hoisted himself to his feet, only to briefly stumble back in shock himself at the sight of dull green eyes. He only barely managed to not step on Hizashi still sprawled below him. \n\n\n “Hi, kid,” he murmured, remembering to press the nurse’s call button as he shuffled closer to the bed, taking care to not get too close. “How are you feeling?”\n\n\n Izuku didn’t respond. His body remained completely still aside from his slow, measured breaths, as his eyes blankly looked up at the ceiling. \n\n\n “Can he hear?” Hizashi wondered as he moved closer to Izuku, as well. A quick glance to the side confirmed that he had replaced his hearing aids. \n\n\n Shouta shook his head, circling around the foot of the bed to stand on the other side. “There hasn’t been any indication that he can’t. He responded verbally to my questions when I found him.”\n\n\n “Maybe he’s still asleep?” \n\n\n “Oh, he’s certainly not asleep,” A nurse said as she hustled into the room. Frowning at the scene in front of her, she pulled a penlight from her breast pocket and shined it into Izuku’s eyes. Still no reaction. “My Quirk, EEG, allows me to sense brainwaves, and if I were to go off of that alone, I’d say he was in the middle of an anxiety attack, but he’s not displaying any other signs of that.\n\n\n “Okay, dear, I’m going to raise your bed up a bit, should make you a bit more comfortable,” she said to Izuku and pressed a button on the bedframe to incline him into a sitting position. “My name is Ishikawa Yachi, but you can just call me Yachi, okay? I’m a nurse, and I’m here to help you out.”\n\n\n When Izuku still showed no indication of awareness, she took a step back from the bed and rubbed at her temples. “Wow, there’s certainly a lot going on in there. I can add some sedatives to the IV drip, calming him down enough to snap him out of it. I just need the doctor to sign off on it.”\n\n\n “Are sedatives the only option?” Hizashi asked, frowning in concern. “He’s just so little.”\n\n\n Leaving the nurse to fend for herself against Hizashi’s mama bear tendencies, Shouta slowly circled back around to stand at the foot of the bed, stepping directly in Izuku’s line of sight. \n\n\n Immediately, those green eyes locked onto him, slowly scanning him up and down. Then, his brow furrowed in confusion.\n\n\n “Wh-” The hoarse voice broke off into sudden coughs, causing the nurse to gasp and Hizashi to jump dramatically in shock.\n\n\n When the fit subsides, Izuku peered curiously around the room, gaze lingering on the nurse still standing near the doorway. He hunched in on himself, his small body becoming impossibly tinier. “Where am I? You… you’re the hero? Erase- Eraserhead?”\n\n\n “I am,” Shouta confirmed. “You’re in a hospital.” \n\n\n “We… we got out?”\n\n\n “Yeah, kid, we did.”\n\n\n A choked sob burst from Izuku’s chest, and he belatedly clasped both hands haphazardly over his mouth as tears began to stream down his cheeks. Immediately, Hizashi—beautiful, wonderful Hizashi—stepped nearer to comfort him in hushed, gentle words. \n\n\n Shouta and the nurse waited silently on the outer edges of the room, listening to Hizashi assure the child he was safe now; he had two pro-heroes here to look after him, after all. Even as Izuku cried, no noise followed that first, unbidden sob. His breaths remained steady, if a little deeper, and his hands stayed pressed over his mouth. Every now and then he nodded or shook his head when Hizashi prompted him with a question. \n\n\n When the tears finally dried, Ishikawa approached the bed to reintroduce herself. “I’m just going to take some of your vitals, okay, dear? Nothing too bad I promise.”\n\n\n Izuku’s arms crossed tightly over his chest. He looked at her hands. “You have gloves?”\n\n\n “I do!” Smiling softly, Ishikawa wiggled nitrile-covered fingers. \n\n\n “Okay.”\n\n\n As the nurse secured a blood-pressure cuff around Izuku’s arm, Shouta decided that enough time had already been wasted. “Hey, kid, why don’t you like being touched?” He ignored Hizashi’s horrified reprimand for being too blunt. The easiest way to get answers is to ask questions.\n\n\n “My Quirk. People get mad when I use it.”\n\n\n “And it activates through touch?”\n\n\n Izuku nodded, watching blankly as Ishikawa removed the cuff.\n\n\n “And what exactly is your Quirk?”\n\n\n Hizashi hissed, “Shouta, stop it. If you want to ask questions, then you wait until Tsukauchi gets here.”\n\n\n Grumbling, Shouta reached for his phone to call Tsukauchi and demand he get to the hospital ASAP, while the nurse, evidently done with her tests, disappeared out the door with a promise to bring the doctor by soon. Before he could get very far, though, Izuku cleared his throat timidly. \n\n\n “I, uh… People can’t use their quirks… when they touch me,” he whispered shyly. \n\n\n For a moment, both heroes stared at him blankly. Then Hizashi shrieked, “Shou! He’s a mini-Eraserhead!”\n\n\n Wincing at the volume—for a pro-hero, Hizashi casually used his Quirk way too often—Izuku chewed at his thumbnail. “Yeah… My dad told me about you. He said your Quirk was like mine.”\n\n\n His dad? Who was his dad? Why must the answers just lead to more questions? Shouta needed Tsukauchi to get here now, because if he asked the kid anything about that right now, his husband would likely burst his eardrums.\n\n\n Hizashi—admittedly the one with more tact in their relationship—ignored that new rabbit hole of information and followed the other clear line of questioning.  “Izuku, do people get upset when you erase their Quirks? I bet that’s very scary.”\n\n\n Izuku hesitated, then nodded. “I can’t control it, so I- I don’t like when people touch me. I don’t want to use my Quirk on them.”\n\n\n “I can understand that, kiddo. But your Quirk shouldn’t be something you’re afraid of, okay? Lots of people rely a little too much on their Quirks, and it can make them feel vulnerable if they’re taken away. It’s not your fault if they get a little freaked out without them.”\n\n\n Izuku casted his eyes to the side. “I still don’t like it.”\n\n\n Hizashi looked like he wanted to press the issue a little more but was interrupted by a knock on the room’s door as Detective Tsukauchi stepped in. \n\n\n “Hello, Aizawa, Yamada.” Hizashi waved while Shouta simply nodded in acknowledgement. “And you must be Izuku. How are you feeling?”\n\n\n Izuku shifted uncomfortably. “I’m okay,” he whispered. \n\n\n “Glad to hear it. I’m Tsukauchi Naomasa, a detective with the Musutafu Police Department. I’ve been working on a very important case, and I think you could really help me out. Do you think you’d be okay to answer some questions for me?”\n\n\n Izuku certainly appeared hesitant, looking at the detective uncertainly as he fidgeted with his hands. After a moment, he glanced at Shouta. “Is he good?” he asked softly. \n\n\n Shouta sighed. Not out of any kind of frustration at the kid, of course. It just felt like there was an ache in his chest, building and building every time the kid’s trauma showed itself, and he needed to release that hurt somehow. “Yeah, kid. He’s a good guy.”\n\n\n “You can trust him,” Hizashi added. \n\n\n Izuku nodded slowly. “Okay. I can help you.”\n\n\n “That’s very kind of you, Izuku. Thank you.” Tsukauchi pulled a chair beside the bed, opposite of Hizashi. Shouta took a seat next to the detective. “I’m going to record our conversation, okay? Just so I can listen to it again later and make sure I didn’t miss anything important. There’s no rush here. If a question is hard to answer, and you need a minute, then you can take as long as you need, and I’ll wait until you’re ready. Do you understand?”\n\n\n Izuku nodded. \n\n\n “Great.” Tsukauchi pulled a small recording device from his coat and set it on the bed between them. “One last thing: my Quirk is called Lie Detector. That means I know when someone isn’t being truthful, and if you tell a lie, I’ll be able to tell, okay? I’m sure that you would’ve been honest, anyway, Izuku. You’re a good kid. But I need you to confirm that you understand that my Quirk will be active during our conversation.”\n\n\n Izuku nodded again, and Tsukauchi’s smile softened. He tapped the tape recorder. “Verbal confirmation, please.”\n\n\n “I understand.”\n\n\n “Great. Let’s get down to business then. Recording Detective Tsukauchi Naomasa, interviewing unidentified minor found by Pro-Hero Eraserhead during the A-F-O raid Saturday, August 19\n\nth\n\n, 20XX. The raid was intended to apprehend individuals involved in an organization of villains, self-titled the League of Villains. Recording taken Sunday, August 20\n\nth\n\n, 20XX. Interview begins: \n\n\n “Okay, we’ll start easy. What is your name?”\n\n\n “Izuku.”\n\n\n “True. Your family name?”\n\n\n Izuku’s eyebrows furrowed, and he chewed on his lip. “They only called me Izuku.”\n\n\n “That’s okay,” Tsukauchi reassured, even though all the adults knew that just made the kid’s history harder to track down. “How old are you?”\n\n\n “I, uh… I don’t know?”\n\n\n Shouta sighed again. “The doctor said he was six.”\n\n\n “True. Thank you, Eraserhead,” Tsukauchi said, mostly for the recording’s sake. “Izuku, can you describe your Quirk for me?”\n\n\n Those gnarled hands curled tightly under Izuku’s chin. “I take people’s Quirks away when they touch me.”\n\n\n Tsukauchi hesitated. “True. What do you mean by take them away?”\n\n\n Izuku flinched, eyes glancing away from Tsukauchi for the first time since he’d started asking questions. “When people touch me, they can’t use their Quirks anymore.”\n\n\n “True. So, it acts similarly to Eraserhead’s Erasure.”\n\n\n “That’s what my dad told me,” Izuku murmured.\n\n\n “Your dad? Was this before you were taken by the League?”\n\n\n “I wasn’t taken.” \n\n\n Tsukauchi visibly startled. “True. How long were you with them, Izuku?”\n\n\n “Always.” \n\n\n “True. Izuku, was your dad one of the villains?”\n\n\n “Yes,” Izuku whimpered. \n\n\n “True. Do you know his name?”\n\n\n “No. They… they called him…” Suddenly, tears began to stream from his eyes. “He’s bad, and… and he’s scary. He wants me to be like him, but he’s bad. I don’t want to be bad! He takes, steals people’s Quirks from them, and I can’t do that!” Despite his clear descent into hysterics, Izuku’s volume didn’t rise, and his breaths remained steady. On the outside, he was completely calm, but his words and the sheen in his eyes revealed his panic. “He wants me to, but I can’t, because they’re so scared, and I don’t want to be scary like he is! He hurts people! I ca-”\n\n\n “Izuku,” Hizashi interrupted firmly, angling his body to intercept his eye line. “Hey there, kiddo, can you look at me for a second?” Izuku obliged, turning his full attention to Hizashi. With him distracted, Tsukauchi released a long breath, face ghostly white as he seemed to process. Watching him, Shouta wondered what caused the extent of that reaction. While his own chest ached and his hands had fisted tight enough that his nails were surely leaving imprints in his palms, the detective’s reaction seemed to go deeper than the horror of hearing a child’s trauma firsthand. \n\n\n The bit about stealing Quirks was the most probable cause of the extreme distress, which was understandably alarming, but such a thing should logically be impossible. With no evidence of it actually happening aside from the convoluted testimony of a child, the story would be difficult to believe. \n\n\n Unless Tsukauchi knew something Shouta didn’t.\n\n \n \n\n Yamada Hizashi wasn’t an idiot, and if his ADHD was good for something, it was noticing multiple things at once. He absolutely noticed the detective’s strange reaction to Izuku’s words, and he knew Shouta noticed it too. Hizashi also knew his husband well enough to be certain that Shouta was already formulating a plan to get his answers. A single glance and responding nod only confirmed it. \n\n\n Giving the detective a moment to recollect himself, Hizashi demanded his dumb ADHD brain to focus entirely on comforting the upset child in front of him. When the tears finally ceased, Hizashi beamed, and to his complete surprise, Izuku shakily smiled back. A closed-lipped, tiny smile, but a smile all the same. “Ya know something, little listener? When I’m feelin’ sad, it makes me feel a whole lot better to hold someone’s hand.”\n\n\n Hizashi knew this was a total long shot, confirmed when the child instinctively pulled his body away from where Hizashi’s hand rested, palm up, on the bed. “But…”\n\n\n “It’s absolutely your decision, kiddo,” Hizashi reassured. “But I think it was real mean of all those people to be so afraid to touch you, ‘cause nothing makes me feel better than someone holding my hand, or even giving me a nice hug, and you’ve really been missin’ out. I promise I’m not totally lame like those other guys. I won’t be mad if my Quirk goes away for a bit.”\n\n\n Izuku stared into Hizashi’s eyes critically. “You promise?”\n\n\n “Cross my heart.” Hizashi even did the motion with his free hand. “’Sides, I can be plenty loud even without my Quirk. Who needs it, anyway?”\n\n\n “He’s right,” Shouta grumbled irritably, but Hizashi just grinned good-naturedly. He loved him. \n\n\n Then, his attention was taken by a gentle touch falling into his hand. Immediately upon contact, a faint tingle spread from the point of origin, and Hizashi had to suppress the instinctual gasp rising in his throat. Where Izuku’s misshapen hand rested on his, three concentric circles, glowing green, pulsed outward and faded in and out in a steady rhythm. \n\n\n Watching Izuku’s face closely to make sure he wasn’t overwhelmed, Hizashi cupped his own hand so it cradled the pinched claw shape of the child’s. The circles grew larger as the skin contact increased, but maintained the same, steady pulse. \n\n\n “Hey, now, that’s pretty snazzy, kiddo.” \n\n\n Izuku just stared at their connected hands. \n\n\n Peering curiously at them, Shouta raised an eyebrow. “Well?”\n\n\n Hizashi cleared his throat dramatically, hoping it would ease some of the tension in Izuku’s shoulders. Then, he screamed. “Yeeeeaaaaaaaaaahhhhhhh.” \n\n\n Well, it was loud. But definitely not Quirk amplified.\n\n\n “Yep, it’s gone alright.”\n\n\n “It’ll come back,” Izuku told him. \n\n\n “’Course it will, little listener! I trust you on this.” Hizashi was proud to see another small smile lift the corner of Izuku’s lips. \n\n\n “For the record,” Tsukauchi said into his tape recorder, “Izuku’s Quirk has been demonstrated to work as described, erasing Pro-Hero Present Mic’s Quirk, Voice.” Hizashi, an expert of voices himself, noted that the detective’s was now much fainter than it had been at the start of the interview. \n\n\n Definitely something going on, then. \n\n\n “Izuku, would you be alright to answer some questions about your dad?”\n\n\n That tiny hand pressed down into Hizashi’s more firmly. “Yes.”\n\n\n “Can you describe your father’s Quirk for us?”\n\n\n “He can… take someone’s Quirk away when he touches them. He has… a lot of other Quirks.”\n\n\n Hizashi frowned. That couldn’t be right. He’d never heard of a Quirk like that before. Copying Quirks, sure, but never one that completely stole another Quirk. For a brief moment, he thought that maybe Izuku was just confused, scared and traumatized, not remembering things correctly. \n\n\n One look at Tsukauchi’s face told him differently. \n\n\n “True.” He sounded so tired, so resigned. “And your father was hoping you’d have a similar Quirk as him?”\n\n\n “He made me test it a lot, and I never did what he wanted me to. He’s mad at me all the time.”\n\n\n “True. Did he hurt you, when he got mad?” \n\n\n “Sometimes,” Izuku admitted. “Or he put me in the dark room.”\n\n\n Hizashi looked at those small, damaged hands again and dared to tighten his grip around Izuku, mindful of squeezing too hard. “Do your hands hurt, kiddo?”\n\n\n Izuku stared. Hizashi wondered if he’d ever taken the time to actually consider the pain he’d experienced before. \n\n\n When Izuku didn’t answer, Shouta spoke instead. “Does your Quirk cancel out any other touch-based Quirk being used on you?” Hizashi remembered the doctor mentioning a nurse that could realign bones with her Quirk, so he was incredibly disappointed when Izuku nodded his head. Shouta just hummed, considering. \n\n\n “I think I have just one more question for you today, Izuku,” Tsukauchi interrupted, shifting uneasily in his chair. He looked like he wanted to bolt. “Everything else I can get from you at a later time.\n\n\n “Do you recognize the title All for One?”\n\n\n As soon as the last words leave Tsukauchi’s mouth, Izuku’s entire body spasmed. He wrenched his hand back from Hizashi and curled tightly into himself. “Yes,” he whimpered. “That’s what the… the others called my dad.”\n\n\n Immediately, Tsukauchi stood from his chair and grabbed the tape recorder to shove back into his coat. “I have to go now,” he said, even as he left. “You’ve been a huge help, Izuku. You gave me lots of valuable information to look into, thank you.”\n\n\n Hizashi whipped his head to Shouta, narrowing his eyes, because something was happening, but his wonderfully attentive husband was already on his feet and following closely after Tsukauchi.\n\n\n “Allow me to walk you out, Detective.”\n\n\n If possible, Tsukauchi’s face seemed to grow even paler. “Oh, that won’t be necessary, Aizawa.”\n\n\n “No, no, I insist. After all, I think we have much to discuss.” And the door closed behind them. \n\n \n \n\n Shouta waited until they were a decent distant from the room before he moved to stand in front of Tsukauchi, blocking his escape. “Would you care to inform me what exactly that was in there, Detective?”\n\n\n “I told you, I need to clear it with All Might,” Tsukauchi huffed, sidestepping in an attempt to circumvent him. “Can we at least walk and talk, Aizawa? I really do need to go.”\n\n\n Shouta allowed him to continue forward, falling easily into step beside him. “There’s no way that kid has any remaining family unrelated to the villains, and that father of his will want him back. Government care won’t be safe enough for him. You saw Hizashi in there with him. If he doesn’t sign the brat’s foster paperwork by the end of the day, I’ll eat my damn capture weapon. It’s inevitable. And it’s illogical to expect us to protect him to the best of our abilities without knowing what exactly we’re protecting him from. I need the information you have.”\n\n\n Tsukauchi smiled thinly. “We both know Yamada wouldn’t bring home a whole child without you approving it. You’ve gone soft, Eraserhead.”\n\n\n “Shut up,” Shouta growled, although even he could admit it was halfhearted at best. He just found it intriguing that the child had such a similar Quirk to his own, nothing more. “Are you going to give me the information, or will I have to find another way.”\n\n\n Sighing, Tsukauchi shifted on the balls of his feet. “Fine. You’re right. I won’t let lack of information put that kid in any more danger than he’s already in. But,” and Shouta almost groaned, “All Might really does need to be involved in this, you’ll understand why once everything’s explained. I’m going back to the precinct to meet with him now, actually, if you’re fine leaving your husband and new son here alone for a couple hours.”\n\n\n Shouta rolled his eyes at the jab but pulled out his phone to text Hizashi. He had seen the suspicious looks cast toward the detective during the questioning, so he knew Hizashi wouldn’t mind his disappearance as long as Shouta clued him in afterwards. \n\n\n “One other thing. If you’re serious about watching over the kid… I don’t think it would be wise to tell All Might that he’ll be in your care.” Shouta side-eyed the detective skeptically. “I just… don’t know what he’d do if he and Izuku ever met.”\n\n \n \n\n The talk with All Might was exhausting. At first, the hero was reluctant to even share the details with Shouta and only agreed at Tsukauchi’s persistent urging. Then, when he deemed Shouta worthy of knowing such an ‘important government secret,’ he gave the information in storybook format, reciting the history of One for All and All for One like a soliloquy performed for a captive audience. \n\n\n It was so absurdly inefficient that Shouta almost decided the information wasn’t worth it. \n\n\n Still, he did understand why this was all so tightly classified. If the public knew of a villain that could rival All Might, one that could give and take Quirks freely… \n\n\n The information was alarming to say the least. It was particularly alarming that such a small, innocent boy like Izuku had been roped into this whole mess. Izuku, who had been so traumatized and so, so hurt but still retained a hopeful glint to his eyes; who must have been so very afraid in his new, strange environment, but still bravely answered all of Tsukauchi’s questions; who refused to outwardly express his panic and vulnerability, but still attempted to offer Hizashi a smile. \n\n\n Shouta also understood why Tsukauchi was purposefully vague discussing Izuku’s future when All Might had asked. When the Symbol of Peace talked about All for One, there was an admittedly justifiable level of contempt and rage concealed behind that grin of his, but when he had been informed of a child born and raised to act as the All for One’s successor…\n\n\n Well, Shouta agreed with Tsukauchi that All Might’s knowledge of Izuku’s whereabouts should be limited. He didn’t want to think Japan’s Number One hero would ever hurt a child, but that amount of fear and anger could cloud anyone’s better judgement. \n\n\n The trip to the precinct’s record office also served to knock off another item on his ever-growing list of errands, and he now had a hefty stack of paperwork tucked away in a messenger bag.  Shouta had already resigned himself to his inevitable, indefinite guardianship of the child, and he had filled out most of the information in the time spent waiting for All Might at the precinct. Now, the papers only required two signatures for it to become official. \n\n\n Returning to the hospital, he stopped by the reception desk to enquire about the specialist with a bone-manipulation Quirk. Then, on the walk back to Izuku’s room, Shouta quizzed the older gentleman on some of the details of his Quirk. It did require skin contact, and based on the current state of Izuku’s hands, would likely take several minutes to realign each hand. The process didn’t need to be continuous, however, and can be paused and resumed as needed. \n\n\n Perfect. \n\n\n When they get back to the room, Hizashi’s tablet was sat on Izuku’s lap, and whatever they were looking at had Izuku completely mesmerized. Shouta thought he could see the slight movement of his lips as his eyes tracked movement on the screen, almost as if he was talking to himself. \n\n\n Hizashi was the only one of the two to notice Shouta’s return and beamed from where he was watching over Izuku’s shoulder. Then, registering the doctor in the room as well, he reached to pull away the tablet. “Sorry, little listener, looks like someone’s here to see you. I promise I’ll show you more videos later, mmkay?” \n\n\n Izuku pouted, staring forlornly at his lap. For Shouta’s eyes only—and probably the doctor’s—Hizashi clutched at his chest dramatically at the sight, then signed ‘too cute’ to himself. Shouta honestly had to agree. \n\n\n The doctor took a seat next to the bed and introduced himself and his Quirk. When he mentioned the touch requirement for it though, Izuku frowned and Hizashi hissed under his breath, “That’s gonna be a no-go then, won’t it?”\n\n\n Shouta rolled his eyes. “You think I’d bring him all the way here without a plan for that? Izuku, look at me.” Izuku complied, and Shouta activated his Quirk. “Feel that?”\n\n\n Eyes wide, Izuku nodded. Then hesitantly, he reached out for Hizashi who happily reached back. When their hands made contact, nothing happened, and Izuku’s face lightened. “It’s gone!”\n\n\n Shouta released his Quirk. The green glow immediately appeared, and Izuku pulled away, but his eyes still gleamed. “It’ll be slow, but if I cancel your Quirk, the doctor should be able to fix your hands up for you. I’ll warn the him every time my eyes need a rest, and he won’t touch you with your Quirk active. That sound good to you, kid?” \n\n\n “Yes, please.”\n\n\n Shouta was correct in his assumption that it would be a long process, especially toward the end when his eyes were dried out and he needed to blink more often. While the doctor said that the realignment wouldn’t necessarily be painful, it still looked to be uncomfortable for Izuku, although whether it was due to the Quirk itself or just the concept of skin contact, Shouta wasn’t sure. \n\n\n Hizashi, for his part, attempted to keep all of them distracted with his inane chatter, and while Shouta didn’t care much for the amusing anecdotes about their home life, Izuku seemed to appreciate it, so he let it continue without comment. \n\n\n When the doctor finally pulled away from Izuku’s hands, Hizashi was in the middle of his camera roll’s ‘Little Bastards’ album—all pictures of their cats, of course—and Shouta had used up about half of his bottle of eye drops. Izuku’s hands, when they looked at them, were no longer twisted into that rigid, painful claw shape. Instead, they rested flat on his lap, each finger laying neatly next to its neighbor as if their bones had never been broken in the first place. The only remaining evidence of their previous state were the thin, pale lines that striped across his skin. \n\n\n The doctor instructed Izuku to perform some simple motions, and Izuku stared in wonder as he curled and uncurled his fingers, circled his wrists, pressed his thumb and pinky together. Distantly, Shouta wondered just how long he’d gone without full dexterity in his hands. \n\n\n As they did that, Hizashi stepped away from the bed, assuring Izuku he’d be back in a moment. Then, he grabbed Shouta by the wrist and hauled him out the door into the hallway.\n\n\n He knew where this is going. \n\n\n “Shouta, darling, love of my life,” Hizashi began, and Shouta lifted an eyebrow. He was going to make his husband work for this. “You know how we’ve talked about having a kid one day? Well…” he drew out, and then exaggeratedly pointed back to the hospital room, “there’s a kid right there!”\n\n\n “Hizashi,” Shouta said, forcing his tone to remain neutral, “we’re only twenty-two. That is a six-year-old child.”\n\n\n “That makes it better!” Oh, now Hizashi was determined. An expressive man by nature, Hizashi’s body was always emoting for him, his movements impossibly animated like a living cartoon. But when he was set on something, he went rigid. His expressions forewent that easy fluidity for sharp, harsh gestures, like he thought he could punch his point across. “We skipped right past the fussy baby stage! Shouta, Shou-ta, we’re both pro-heroes. Fairly new ones, sure, but I’m already ranked in the top 50, and you would be too if you’d tolerate a little more attention! Plus, the radio station is doing really, well, too, for it just opening and all, so we got the money. And we have wildly different patrol schedules, so the kid would hardly be alone. It’d be nice to have the company while you’re patrolling at night anyway.\n\n\n “I know we’re young but that just means we have the energy for a kid! Or at least I do… You might need a couple more cups of coffee in the morning, but hey, you can handle it! C’mon, Shouta! Just look deep into that small, shriveled heart of yours and think about it, ‘kay? We can totally do this.”\n\n\n Shouta simply watched and waited for Hizashi to tire himself out from his little speech, surreptitiously pulling the papers from his messenger bag as he did so. When his husband finally finished, Shouta grinned.   \n\n\n Suddenly suspicious, Hizashi narrowed his eyes. “What?”\n\n\n “I agree. We just need to sign.” \n\n\n Hizashi outright shrieked in glee, Quirk activated, when he finally got a look at the papers, simply titled ‘Custody of a Minor’ across the top. Only Shouta’s own Quirk kept the hospital’s windows from shattering. “Hizashi, this is only fostering, at least for now. I am not stupid enough to allow both of us to officially adopt a child we’ve known for less than 24 hours. And I still need to fill you in on the details, but Izuku is still in a lot of danger, and the safest option for him is to be in the care of pro-heroes who can protect him.”\n\n\n “Shouta. I love you so, so much, my beautiful husband. Show me where I need to sign.”\n\n\nHe had always pretended that his Quirk wasn’t evil. He could keep pretending. \n\n\n Before, he did it so his dad wouldn’t make him use his Quirk to hurt people like he did. Now, he didn’t want to make the heroes angry at him. \n\n\n Eraserhead had saved him. And the blonde man told him he was a hero too with a Quirk that could make him really loud. They were heroes. They wouldn’t like his Quirk, like they didn’t like his dad’s. \n\n\n He could pretend it was just an erasing Quirk, like Eraserhead’s. That was a hero’s Quirk, a good Quirk.\n\n\n He could pretend. \n\n \n \n\n If Izuku’s return to consciousness earlier that day was any indication, the hospital was not healthy for his fragile mental state. It also would be a logical location for the child to be after his rescue, meaning that the villains could come looking for him there. So, after assuring the doctors that they’d return for additional appointments with psychologists and physical therapy for his hands, they swept Izuku back to their apartment that same evening. \n\n\n Unfortunately, this also meant that Shouta and Hizashi were extremely unprepared for the arrival and subsequent care of a child. While he had the foresight to urge Nemuri to take their two cats for the night, that was about all that could be done on such short notice. The apartment’s second bedroom was only occupied by a plain desk and storage boxes, and they didn’t have so much as a spare futon. They didn’t even have clothes for him. Shouta could only offer the length of his capture weapon to wrap the kid in over his hospital gown, and only that was at Izuku’s insistence that as much skin be covered when Hizashi insisted on holding him for their whole way home. \n\n\n Knowing his husband, Hizashi would be working hard to acclimate Izuku to human touch again, but Shouta was relieved that he seemed to at least tolerate clothed contact. The fact that the kid even allowed that much was a miracle, in Shouta’s opinion, and was a good sign that Izuku wasn’t completely closed off psychologically and could heal with enough time and resources. \n\n\n Izuku is even trusting enough in Hizashi’s grip that he dozed off in his arms, snuffling quietly as Shouta unlocked the door to their apartment and the two men toed their shoes off in the entryway. Cooing, Hizashi whispered, “I’m gonna let the baby sleep in the bed tonight. We can manage on the couch.”\n\n\n Shouta rolled his eyes. “’Baby?’ Hizashi, he’s six.”\n\n\n Glaring, Hizashi awkwardly rebalanced Izuku in his arms so he could sign an exasperated ‘baby’ as he took Izuku into the bedroom. Shouta, meanwhile, grabbed a juice pouch from the kitchen, a notepad, and pen, and sat at the couch to think of what all a six-year-old child needed to survive. He reasonably knew that if it weren’t for their credentials as pro-heroes, giving them the legality to emergency foster at-risk children, the two of them would not have passed any kind of inspection to let them care for a child. He didn’t like to be unprepared, and while this situation was certainly unexpected and taking Izuku home with them tonight was the most logical course of action, he refused to still be lacking by this time tomorrow. \n\n\n So, he started on a list. The kid would need clothes, obviously, since a capture weapon and hospital gown don’t make for a viable outfit outside of an emergency. And furniture for his room too, like a bed and dresser to start. Dammit, what do children eat? The doctor had suggested keeping Izuku on a diet of simple, nutritional foods before introducing him to more adventurous meals. Are jelly pouches nutritional for a growing boy? \n\n\n Suddenly, a weight plopped down onto the couch next to Shouta, a head of blonde hair leaning onto his shoulder. Reading over the pathetic list in front of him, Hizashi sighed and took the pen from his hands, crossing out the ‘jelly pouches?’ under Shouta’s ‘food’ bullet point. \n\n\n “This is bad,” Shouta signed, knowing Hizashi would’ve already taken his hearing aids out. “We don’t know what we’re doing.” \n\n\n Hizashi hummed and opened a search engine tab on the laptop. “We can learn.” \n\n\n They quickly decide that taking Izuku to a mall or any kind of shopping center would be a bad idea, since shoving an isolated child into a busy crowd could only end poorly. Hizashi eagerly pulled up multiple tabs for stores specializing in kid’s clothing, while Shouta started a grocery list on his phone. Every few minutes, they would confer with one another—usually Hizashi showing Shouta the ‘cutest little outfits for the little listener'—before going back to their individual tasks. Several times Shouta had to remind Hizashi not to go overboard with the clothes, at least not until they could figure out what Izuku actually liked wearing. \n\n\n As for furniture, Hizashi happily volunteered to go out the next morning to at least find the essentials. Shouta argued to go instead, knowing Hizashi would come back with more than necessary, but he’d been banned from picking décor for their apartment since they’d moved in and he’d attempted to use his sleeping bag as bed sheets, so Hizashi won that battle easily enough. Besides, Shouta figured it wouldn’t hurt for the kid to have a couple lava lamps or whatever childish nonsense Hizashi would bring him. \n\n\n By 3:00AM, they had a fair amount of the logistics figured out. Some clothes were due to arrive by the end of the next day, and Shouta had a lengthy grocery list of food items that the internet said would be suitable for picky eaters. Earlier, Hizashi had started to preemptively scan what the closest furniture store had in stock but had nodded off against Shouta’s shoulder while scrolling through the section on beanbag chairs. \n\n\n Shouta, meanwhile, had fallen into his own tangent of research, starting with articles on childhood trauma and recovery, then just clicking on whatever articles those led him to. It wasn’t until the familiar ping notifying him of an incoming email that he realized he had ended up on some kind of parenting blog suggesting activities for father-son bonding. Glad that Hizashi wasn’t awake to notice that particular detail, he closed the tab hurriedly and switched to his emails. \n\n\n Sender: [email protected] \n\n\n Subject: good luck  \n\n\n Eraserhead,  \n\n\n The kid doesn’t exist. I couldn’t find any child matching his Quirk and general description in the database. Unsurprising, but he’ll need an actual identity now. This does mean more paperwork for you. Enjoy.  \n\n\n Attached were a couple dozen PDF files, and a JPEG. Curious, Shouta downloaded the JPEG. Opening it revealed a cheesy, photoshopped graphic constructed to resemble a greeting card, with the words ‘Congrats! It’s a boy!’ typed across the top in blue comic sans. \n\n\n Shouta printed it off with the paperwork. Hizashi would enjoy the laugh, at least. \n\n\n Slipping off the couch to collect the paperwork, he rearranged Hizashi so that he was laying across the couch with his head resting on a throw pillow. Then, he set up at the kitchen table with a fresh pot of coffee and got to work. He was used to all-nighters, and the sooner he got this done, the sooner he could offer the kid some kind of stability. \n\n\n About an hour in, he ran into an issue when the form certifying his own capability of assigning an identity to a minor asked for his Hero Commission ID, which was a long series of numbers and letters that Shouta had never bothered to memorize in his four years of being a pro. All of his HC paperwork was stored in a safe in the bedroom where Izuku was currently sleeping. He could wait until the morning, but a sentimental part of him wanted a logical excuse to check in on Izuku anyway, so he took the opportunity. \n\n\n Creeping past Hizashi snoring on the couch—thankfully not Quirk-activated tonight—Shouta listened for a moment just outside the bedroom door. After hearing no sounds of activity, he twisted the knob slowly and edged the door open as quietly as possible. It took a moment to adjust to the darkness of the room, but Shouta could just see the small shape of Izuku laying on the bed. \n\n\n Then, he could see the glossy eyes staring blankly at the ceiling. \n\n\n Immediately, Shouta moved to hover over the side of the bed. “Izuku.”\n\n\n Those eyes snapped toward him, and after a moment, Izuku’s whole body relaxed. “Eraserhead?”\n\n\n “If you’re staying here with us, it would make the most sense for you to call me Shouta. And Hizashi, too. No hero names in this house. May I sit?”\n\n\n Izuku nodded, and Shouta sat at the edge of the bed. “Now, tell me what’s wrong.”\n\n\n “Nothing.” \n\n\n “Kid, you had the same look in your eyes when you first woke up in the hospital and panicked. Something was clearly wrong.”\n\n\n Izuku genuinely looked confused. “Nothing is wrong.”\n\n\n Sighing, Shouta scrubbed a hand over his face. “What were you thinking about before I came in?\"\n\n\n “It was dark. It was scary... but I know where I am now. I’m okay.”\n\n\n “Okay.” Shouta stood and opened the bedroom door father. The light from the kitchen washed over the room. “When you woke up, you thought you were still with the villains, because it reminded you of that room I found you in. That’s natural. You panicked because the darkness triggered you, so we’ll make sure you’re not left in the dark anymore.”\n\n\n Staring with wide eyes, Izuku curled into himself. “I’m sorry I was scared.”\n\n\n “Don’t apologize. You don’t ever need to apologize for being scared, or any other way you’re feeling. You have experienced a great deal of trauma. Of course there would be consequences of that.”  Shouta returned to his seat on the bed, next to Izuku but not quite touching. “If you ever feel like that again, and you want comfort, please let me or Hizashi know. You don’t have to suffer alone.” They sat in silence together for several minutes, Shouta’s back resting against the headboard, and Izuku still curled tightly under the blankets. His gaze was trained firmly on Shouta’s hands, but no expression was visible on his young face to indicate what he wanted. \n\n\n “You should tell me what you’re thinking about.”\n\n\n Izuku startled, then blushed faintly, averting his eyes. “Um, Hizashi- he held my hand, in the hospital. I liked that.”\n\n\n Shouta waited, but when nothing else was added, he said patiently, “If you want something, Izuku, you can ask.”\n\n\n “Can you, um… can you hold my hand.”\n\n\n “Of course,” and Shouta let his open hand fall into the space between them, allowing Izuku to meet him halfway. A moment of hesitation, and then Izuku latched on with both hands. “I mean that, kid. Anytime you want something, you can ask us. Even if the answer is no, we’d always be glad you asked.”\n\n\n It was the first time the two of them had touched, and Shouta was admittedly curious how it felt to be on the other end of an erasure Quirk. A strange sense of numbness had briefly flared in his body, synchronized with the appearance of the concentric glowing circles, but it wasn’t painful. Predictably, when he attempted to activate his Quirk, nothing happened. Shouta grinned, momentarily forgetting that the expression on his bland face was typically off-putting until Izuku flinched minutely. \n\n\n “Sorry, kid,” Shouta told him gently, still unable to wipe the smile away. “I’m just impressed. Zashi says my smile’s a little scary, but you’ll get used to it.”\n\n\n “Not mad?”\n\n\n “Not mad,” he confirmed, slowly placing his free hand over both of Izuku’s. “You can touch me or Hizashi anytime you want to, regardless of whether it erases our Quirks. Actually, I bet Hizashi would love it if you held his hand or gave him a hug. As for us, we’ll always ask for your permission before we touch you, but only because we don’t want to make you uncomfortable, understood? It won’t ever be because we’re afraid of you negating our Quirks.”\n\n\n Izuku stared at him for an uncomfortably long amount of time. Sighing, he prompted, “What are you thinking about now, Izuku?”\n\n\n “You use a lot of really big words.”\n\n\n Dammit, he forgot he was talking to a child. What kind of vocabulary is appropriate for a six-year-old, anyway? He needed to do more research, clearly. “The point is,” he groaned, trying to keep his voice gentle despite his despair, “we are here to help you. You can ask us for things. You should ask us for things. If you get sad, or scared, or anything else, you can tell us, and we will try to fix it. Okay?”\n\n\n Izuku chewed on his lip but nodded cautiously. “Okay.”\n\n\n “Good. Now go to sleep. I’ll sit with you if you want me to.”\n\n\n For tonight, the subtle tightening of Izuku’s hands around Shouta’s was answer enough. \n\n \n \n\n Hizashi made sure to take plenty of pictures of his husband and Izuku curled around each other on the bed, glowing rings indicating each point of contact between them, before hurrying out the door early that morning. He left a note on the counter in case Shouta woke up before he got back from furniture shopping (even though Hizashi knew he wouldn’t). \n\n\n Thankfully, Hizashi had found everything he wanted while they were browsing online last night, so he went through the store quickly, returning home in just under an hour with a gaggle of delivery men following behind him like lost ducklings. \n\n\n They dropped everything in the living room at Hizashi’s request, and after checking in on his boys in the bedroom—still asleep, as expected—he put some headphones over his hearing aids, cracked his knuckles, and got to work in the spare room. \n\n\n Turns out, building a bed wasn’t as easy as Hizashi expected, even with the instructions, and he spent most of the morning screwing on the headboard backwards, but he got most of it done before noon. When he was done, the previously storage room/office had transformed into the coolest little bedroom Hizashi could manage in just a morning. The bed was topped with the most comfortable mattress he could find and covered with an assortment of pillows and a few stuffed animals, one of which being a three-foot tall teddy bear covered with the softest fur Hizashi had ever felt. A lava lamp, Shouta’s suggestion, was on the nightstand next to a Present Mic figurine from his first line of merch. The simple wooden dresser—low to the ground and secured to the wall after reading several articles about them falling on children, what the hell—would soon be filled with small clothes that should arrive later that afternoon, and the bookshelf only held a few picture books and empty basket cubbies but will be filled soon as well if Hizashi had any say in it. Next to it were two plush, dark green bean bag chairs. \n\n\n Satisfied with himself, Hizashi retreated into the kitchen to start a pot of coffee and a simple breakfast of miso soup and rice. Then, he poured a mug of the coffee and slipped into his and Shouta’s bedroom.\n\n\n Their positions had shifted slightly in the last couple hours. Shouta, who usually slept on his back with Hizashi clinging to him like a spindly koala, was curled on his side facing Izuku with one arm fisted under his head and the other grasped by small hands. Izuku was on his back, tiny face soft and open as he slept. Both of his arms were secured tightly to Shouta’s, holding it tightly to his chest like a human stuffed animal, and his cheek rested on the bicep. \n\n\n Obviously, Hizashi took a few more pictures. \n\n\n “Shouta,” he crooned in his husband’s ear, waving the coffee tantalizingly near his face. Shouta only grumbled disinterestedly, but Izuku’s eyes snapped open at the noise. Hizashi shot him a wink as he hurriedly tried to extract himself from Shouta’s arm, only for Shouta to fist a hand in Izuku’s oversized sleep shirt and tug him closer.\n\n\n Hizashi watched the startled blush creep over Izuku’s face and took pity. “It’s time for you and the baby to wake up. I made breakfast, and coffee too.”\n\n\n At the c-word, Shouta snapped to attention, releasing Izuku and taking the mug from Hizashi’s hand in the same motion. Then, he chugged the entirety of the hot coffee in one gulp and stood from the bed. “Breakfast?”\n\n\n “Yeah! I mean, it’s pretty much lunchtime by now, but there’s nothin’ wrong with eating breakfast in the afternoon. Just some rice and miso soup this morning, but we can get groceries later. You got any foods you like, kiddo?”\n\n\n Izuku scooted off the bed. “Um, anything is fine.”\n\n\n “Remember, kid,” Shouta called, already in the hallway and likely heading to the kitchen for more coffee. “If you want something, let us know.”\n\n\n Izuku’s blush grew stronger. “I like pork,” he said, looking up at Hizashi shyly. \n\n\n “Pork sounds great, little listener! I can make katsudon for dinner. Anything else?”\n\n\n For a moment, Izuku looked like he was thinking, glancing toward the doorway Shouta disappeared through. Then he raised his arms. “Up, please.” \n\n\n The tiny version of Hizashi that lived in his brain wailed, clutched his chest dramatically, and fell to his knees at the debilitating cuteness of that sweet little face. The real Hizashi only let himself beam, crouching down to Izuku’s level to scoop him into his arms and taking care to avoid skin contact in case it was unwanted. Giving into temptation, he even tossed him slightly into the air, just high enough to go above Hizashi’s shoulders. Izuku released a huff of breath in brief shock and returned Hizashi’s grin with a timid smile of his own. \n\n\n So. Cute. \n\n\n Then, as if Hizashi’s heart hadn’t already overloaded from all the adorable, Izuku tentatively raised his bare arms so they were nearly wrapping around Hizashi’s neck and quietly asked, “Can, uh, can I touch you?”\n\n\n “Sure thing, kiddo!” As those thin arms—way too thin—wrapped around his neck, that Quirk-erasing tingle accompanied them, but years of exposure to Shouta’s Erasure made him unbothered. He tucked Izuku’s head under his, so Hizashi’s chin rested on those dark curls. \n\n\n They entered the kitchen this way, Hizashi signing an enthusiastic ‘baby’ at Shouta’s raised eyebrow. Maybe six-years-old was a little too old to be carried, but what would he know. He could lift the kid no problem, so it was fine in his book. Besides, the poor kid was obviously touch-starved, so hesitant to ask for the contact that he clearly craved, but Hizashi could absolutely do his damn best to help him overcome that. \n\n \n \n\n The first few weeks of Izuku’s stay with them was an endless stream of paperwork for Shouta. Turned out that fostering a child that didn’t technically exist came with an assortment of complicated legal issues. Half of the struggle came with keeping the information vague enough that Izuku couldn’t easily be identified if the League somehow accessed the database. It didn’t include photos of minors, luckily, so his appearance wasn’t particularly an issue, but his name and Quirk could still potentially be identifiable by the villains if they went looking. \n\n\nShouta refused to change Izuku’s legal name, since he assumed stripping away the child’s meager sense of identity might do more harm than good, and the name wasn’t too uncommon anyway, but he could invent a family name. Hizashi and he had debated on that for two days nonstop before Shouta had, only somewhat jokingly, written ‘Midori’ on the form because he had already written it about a half billion times whenever the paperwork asked about Izuku’s eye and hair color. Hizashi had predictably shouted that he couldn’t name a child ‘green,’ so Shouta simply revised it to ‘Midoriya,’ and submitted the form despite his husband’s protests.\n\n\n Besides, he doubted the kid wouldn’t be an Aizawa or Yamada for long, so it hardly mattered.\n\n\n The other issue was Izuku’s Quirk registration. Until now, Shouta had been the only person he knew of in Japan with anything like his Erasure, so the League would almost certainly follow up on a child with a registered Quirk like that. It was obvious that Shouta couldn’t register his Quirk as Erasure, then, but he wasn’t exactly sure what his other options were. He didn’t want Izuku to have to lie about his Quirk—he clearly had an unhealthy amount of resentment for it already—but what else could he do? \n\n\n For now, that particular form was left blank. \n\n\n At least the paperwork gave Shouta something to do during the day, when Hizashi was at the radio station and he was left alone with Izuku. The internet had warned him that six-year-olds were rambunctious, but it was likely that the years of prolonged isolation had left Izuku a quiet kid, so he didn’t get up to much of anything. Although, Shouta was surprised to admit to himself that he did wish the kid would cause a little bit of trouble, if only because it would mean he was comfortable enough to do so. \n\n\n They had found early on that Izuku loved heroes. He could watch videos on HeroNet for hours on end without ever moving his gaze from the TV. He had already watched as many videos of Present Mic battles that he could find, along with an annoying amount of All Might, and was particularly upset upon discovering that there were no accessible videos of Eraserhead. The pout after learning this almost made Shouta consider participating in a single limelight battle. Instead, he logged into the HC Database and pulled up some of his training videos which was enough to appease the kid. \n\n\n They settled into an easy, quiet routine during the day. Shouta would fill out his paperwork—some hero related, some kid related—on the couch with the cats dozing beside him while Izuku sat on the floor in front of the TV, enraptured. \n\n\nThat probably wasn't healthy... maybe he should take the kid to the park or something one day. \n\n\n Shouta blamed his position so far behind the kid for the fact that it took almost three weeks to notice what exactly Izuku was doing while he watched the fights. He only realized when he made the kid lunch and couldn’t divert his attention from a riveting battle between Present Mic and some lowly criminal with his usual call to come eat. When he approached Izuku, ready to shut the TV off if it meant getting the kid to eat something, he noticed the quick movement of his mouth and repetitive clenching of his fists as he watched. When Shouta finally called Izuku's attention away, the motions ceased. \n\n\n Interesting. \n\n\n Curious, Shouta gently maneuvered Izuku to the couch when they were done with their lunch, telling him that he’d damage his eyes sitting close to the TV. Which was likely true, in all honesty, but he had other motives for this. \n\n\n When Shouta turned the video back on, Izuku's strange mannerisms started up again almost immediately, and Shouta just watched. After a minute or two, it became clear that he was mouthing something, but the movements were too subtle for Shouta to distinguish exact words. His hands, however, took longer to figure out. The clenching and unclenching made it look like he wanted to hold something, but it wasn’t until he saw the jerky, aborted movements of his fists that Shouta realized he was miming writing. Or, more likely, drawing. \n\n\n Hadn’t he found crayons in that cell with him? And scribbles on the concrete floor, like the art of a child? \n\n\n “What are you thinking about, Izuku?” \n\n\n Startled, Izuku whipped his eyes to Shouta, but this game was familiar by now. Every day, Shouta had to remind Izuku that he didn’t have to hold himself back anymore. For so long, this kid had lived inside his own head and stuffed all his desires deep down so he wouldn’t act on them, and the habit had become ingrained. Izuku was safe here, with him and Hizashi, but Shouta knew it would take a while for him to understand that, so whenever he noticed his problem child suppressing something, Shouta made a point to prompt him about it. He hoped it would help Izuku realize that he was truly able to just exist freely here. \n\n\n “I, um, like Present Mic’s Quirk,” he murmured. \n\n\n This was another issue too. The kid was just so quiet. While Shouta certainly appreciated quiet, and he didn’t necessarily need two loudmouthes sharing his space, Izuku’s silence was unnatural. It felt like there was an energy, buzzing just underneath his skin, that he desperately kept tempered down. Even his panic attacks, which often left him wide eyed and crying in the middle of the night, made no noise at all, and Shouta had concluded that Izuku had trained himself into silence. \n\n\n So, he encouraged Izuku to break the silence. “What do you like about it?”\n\n\n “Well, it’s an emitter type that makes his voice really loud,” he started, hesitantly, then when Shouta gestured for him to go on, ramped up. And then continued to ramp up for the longer he went without a sign to stop. “And he can stop bad guys just by yelling at them which is super cool! He could have something different with his throat that makes him so loud. Maybe there’s a mutation there? Do you think I could ask him about it? It’s kinda weird though that his Quirk hurt him so bad and now he needs those hearing things to help him. Most people have mutations, so their Quirks don’t hurt them like that… But maybe his voice is just so strong that it happened anyway! One time, in a video, he screamed at a really hard wall that the villain was behind, and it shattered, so his voice must be super strong!”\n\n\n And it just… kept going.\n\n\n Watching in disbelief, because Shouta had never seen Izuku so animated and expressive, he vaguely had the forethought to pull his phone out of his pocket to discretely record this moment for Hizashi’s enjoyment later. He let Izuku continue until he began to follow a tangent on All Might, and Shouta decided that he’d rather risk interrupting the kid than listen to him rave about that oaf. \n\n\n “Your hands are moving like you want to write. Do you want to do that?”\n\n\n Izuku stared at his hands, still clenched around air, as if they had betrayed them. \n\n\n “Remember, kid. If you want something you should let me know.”\n\n\n Nodding, he finally asked, “Can I have crayons, please?”\n\n\n “No.” Shouta winced at the look on Izuku’s face and was quick to add, “We don’t have any. But I’m sure Hizashi has some markers lying around. I’ll get those for you for today, and I’ll make sure to get you crayons later. Be right back.” \n\n\n He managed to find a few colored permanent markers in the kitchen’s junk drawer and returned to sit on the floor by the coffee table, patting the carpet for Izuku to join him. Then, Shouta spread out several sheets of printer paper in front of them, helped Izuku grip his chosen marker like the physical therapist had shown him, and watched. \n\n\n A moment of hesitation, and then Izuku’s hand was blurring across the page in that easy confidence that only a child could truly possess. His attention flickered between the paper and the fight still playing on the TV screen, murmuring under his breath in a voice just too quiet for Shouta to hear. His art was certainly unrefined and childish, as was expected, but Shouta was still able to make out what it was meant to depict. The tall, yellow triangle on top of the shape’s head made it obvious in context. \n\n\n “Is that Present Mic?” \n\n\n “Yes!” Izuku beamed. Shouta honestly had to blink in response, surprised by the sudden unabashed happiness on the boy’s face. Then, he smiled back. \n\n\n “You depicted the hair very accurately. I like it.”\n\n\n He watched as Izuku happily added more details to the Present Mic. A black rectangle was drawn beneath the head to denote the speaker, and black scribbles over the arm-shaped blobs to represent his jacket. He also added in a large smiley face with yellow triangles over the eyes like Hizashi’s glasses. Then, Izuku drew a large, spiked speech bubble from Present Mic’s smile, filled with upward-pointing arrows. Then, a line from the speaker to another, even larger speech bubble, filled with even larger arrows. \n\n\n Oh, Shouta realized, he’s drawing how Voice works. \n\n\n When Izuku was done with Present Mic, he reached for another blank piece of paper after briefly glancing at Shouta for permission which was obviously given. This time, he drew the body with black marker, with long lines of dark hair sticking up from the head. Shouta immediately knew where this was going, but the red circles for eyes confirmed it. In yellow, Izuku drew another speech bubble like Present Mic’s on the side of the paper, only to cross it out with angry red marker. An arrow was drawn from Eraserhead’s eyes to the X. \n\n\n Honestly, Shouta was impressed. \n\n\n After drawing a curly swirl of Eraserhead’s capture weapon wrapped around a stick figure with X’s for eyes, Izuku seemed to stall, as if suddenly unsure of what to draw next. \n\n\n To Shouta, it should be obvious. “If you draw yourself,” he suggested, “I can put all three drawings up on the fridge, and there will be one of each of us,” and Izuku nodded and got to work. \n\n\n He wasn’t as determined with this drawing, every line hesitant like he wasn’t entirely sure what he was doing. In the end, he ended with a vaguely child-shaped blob with curly green ringlets for hair. Interestingly, there was no attempt at drawing his Quirk like he had for Eraserhead and Present Mic. \n\n\n There was something else missing too. \n\n\n “May I?” Shouta asked, holding his hand out for the green marker. Confused, Izuku passed it over, and Shouta drew a large, beaming smile on drawing-Izuku’s face. Real-Izuku’s own face smiled to match it. “These are very nice, Izuku, good job. Let’s go hang them on the fridge.” He stood up and went into the kitchen to do exactly like, Izuku right on his heels and the cats following behind like a small train. \n\n\n Glancing at the clock, he realized that Hizashi would probably be on his way home soon, and it was time to start on dinner. “Sit here at the table while I make us some dinner, okay? Is there anything else you want to draw?”\n\n\n Izuku thought for a moment, then bent down to pick up one of the cats: Joe, the smaller, nicer one, because the other still kept a wary distance from Izuku. “I can draw Cuppa and Joe! Can they go on the fridge too?”\n\n\n Shouta hummed, turning on the stove while Cuppa screamed at his feet for a piece of chicken. “Only if it’s really good, so you'll have to do your best, kid.”\n\n\n The next few minutes pass with an easy sense of domesticity that Shouta had never realized he wanted until he was right in the middle of it. Izuku sat at the kitchen table, drawing and complimenting Joe on her ‘pretty colored fur’ while Shouta stood at the stove, knowing Hizashi would be home soon to share in the warmth. If this was what a family felt like, they'd be signing the adoption papers even sooner than he thought. \n\n\n Hizashi slipped in through the front door just as Shouta was pulling the chicken off the skillet, calling, “I’m home! Took my hearing aids out already ‘cause I got a ragin’ headache.”\n\n\n Izuku slipped from his seat, darting into the entryway and signing “Touch, okay?” when he got there. He hadn’t had the time to learn many signs yet, but Hizashi and Shouta tried to speak and sign simultaneously whenever possible, hoping the exposure might help, and Hizashi spoke out loud even with his hearing aids out so Izuku could still be included. The sign for ‘touch’ had been added to the kid’s vocabulary early on. \n\n\n “Ya know what, kiddo? I would love a hug from my favorite little listener if that’s cool with you.” And Izuku dove forward with arms outstretched. \n\n\n Shouta waited until Hizashi had straightened up, hand clasped with Izuku’s, to ask, “Hard day?” After signing the words, he pulled his husband into a firm hug, careful not to pull him from Izuku’s grip, placed a gentle kiss on his lips, and nuzzled into his hair. \n\n\n “Long day,” Hizashi replied, tiredly. “Too many meetings, I hated it.”\n\n\n Snorting, Shouta drew him toward the kitchen. He walked backwards to sign, “Come. You will smile.”\n\n\n When Hizashi saw the pictures hanging on the fridge—now including Cuppa and Joe’s portraits too—he squealed gleefully. “Izuku!” One day, Shouta will tell Izuku that his sign name was just the sign for ‘baby,’ but more enthusiastic. “Did you draw these?! They’re totally awesome, kiddo!”\n\n\n Izuku’s eyes gleamed. “You like them?” he asked, Shouta translating for Hizashi over his shoulder. \n\n\n “Duh! They’re rockin’. I’m turning mine into my lock screen,” Hizashi said, pulling out his phone to take a picture of the Present Mic drawing. When he was done, he swept Izuku into his arms and swung them both into the living room. Shouta, alone in the kitchen while the two spun in circles and made fools of themselves, went back to plating their dinner and listened to Izuku’s quiet breaths of laughter.\n\n\n When he heard an ear-splitting shriek of laughter from the living room, undeniably amplified by Voice, Shouta instinctively leaned out of the kitchen doorway to cancel the Quirk with his own. It took a second longer for his brain to catch up with his body and realize that the yell hadn’t come from Hizashi. \n\n\n The laugh was far too high-pitched and childish. And Hizashi looked just as confused as Shouta did, staring at the wide-eyed boy still held tightly in his arms, bare skin forming those familiar glowing rings between them. \n\n\n Hizashi hadn’t used his Quirk. \n\n\n Izuku did. \n\n\nHe had never felt like this. Before, with his dad, he was so afraid and everything hurt, and it was so hard to pretend that his Quirk was different, but he had to. His dad couldn’t know that he was just like him. He had an evil Quirk, but if everyone thought it was a good Quirk then he could be good too!\n\n\n The heroes were so nice to him, so he would be good for them. They weren’t afraid of him like the others had been. He’d never had a hug before. He liked hugs. \n\n\n But he wouldn’t get hugs if they found out that his Quirk was bad, so he pretended it was good like Eraserhead’s. Even when they touched him, and he couldn’t resist that pull, as he stole their Quirks as his, he could still pretend he had a good Quirk. His dad had never found out that his Quirk was bad like his, so he could hide it from the heroes too. \n\n\n But they touched him so much, and he felt so happy, and every time they touched him he pulled at that warmth inside them and took it like it was his own. It wasn’t his though, so he had to give it back, and they would never know that he was a thief, that he was bad like his dad was. \n\n\n But then the loud hero, Present Mic, Hizashi, was laughing and swinging him around and touching him, and he was so happy. He’d never felt like that before. And he took Hizashi’s Quirk, like he always did, but this time he couldn’t keep it tucked away in his chest like a secret. The warmth bubbled up, the Quirk, the stolen Quirk, activated, and he just couldn’t help it…\n\n\n Izuku let himself laugh. \n\n \n \n\n Hizashi heard Izuku laugh. \n\n\n He wasn’t wearing his hearing aids. He shouldn’t even be able to hear a motorcycle engine from this distance, but he heard Izuku laugh. \n\n\n He also recognized that artificial, auto-tuned quality of it. He had grown used to hearing that since it happened every time he used his Quirk. \n\n\n Izuku had used Hizashi’s Quirk. \n\n\n It was clear that all three of them reached the same conclusion at the same time. From his spot in the kitchen doorway, Shouta released Erasure and simply stared as the glowing rings of Izuku’s Quirk returned. Still in Hizashi’s arms, Izuku froze. \n\n\n Then, he cried. \n\n\n Hizashi panicked, because there was a lot happening right now. He could feel the tingle of his missing Quirk again, and the baby was crying. Izuku was wiggling, desperately trying to wrench himself from Hizashi’s arms, and Hizashi didn’t know what he was even saying, could just see his mouth moving as he sobbed. \n\n\n “Shouta!” he called, because he didn’t know what to do, and he couldn’t hear anything. “The baby—”\n\n\n Shouta was already there, trying to wrap Izuku in a blanket to take him safely from Hizashi’s arms, but Izuku’s sobs grew, his chest heaving, and suddenly Hizashi can hear his wailing, because he was using Voice again as he begged Hizashi not to leave. \n\n\n Fighting to keep the fear out of his tone, Hizashi tried to placate him. “Izuku, baby, go with Shou for a moment. Just for a second. I promise I’ll be right back.” Finally, Shouta managed to separate them, Izuku’s Voice cutting out with the broken contact, and Hizashi darted to his bag in the entry, digging for his hearing aids. As soon as he had them, he ran back to Izuku. Shouta sat on the floor, in front of where he had placed Izuku on the couch, trying to calm him down but not touching him. Not when they didn’t know what that actually did. \n\n\n Izuku was wailing, the loudest Hizashi had ever heard him before five minutes ago. “I’m sorry! I’m sorry! I didn’t mean to! I’ll never do it again, never ever, I’m sorry! I gave it back, I gave it back, I didn’t steal it! I’m not like him, I’m not bad! I don’t want to be bad, please… please…” \n\n\n “Hizashi.” Shouta said sharply, eyes not straying from Izuku. “Is your Quirk still gone?”\n\n\n “No,” Hizashi answered, because he could feel that it wasn’t. After separating from Izuku, it had settled tightly in his chest like it hadn’t ever left. He remembered what Izuku said about his biological father’s Quirk, what Shouta told him after the talk with All Might. If Izuku had taken Hizashi’s Quirk like he suspected, it was back now. “No… he gave it back, I think.”\n\n\n Immediately, Shouta placed his hands on Izuku’s cheeks and pressed their foreheads together, uncaring of Izuku’s Quirk activating under his touch. “Kid. Izuku. Listen to me. We’re okay. You didn’t do anything that couldn’t be undone, so take a breath before you pass out. Hizashi and I aren’t mad, so relax.”\n\n\n Izuku’s eyes flitted to Hizashi doubtfully, and yeah, Hizashi was a little spooked, but he wasn’t mad. Not at Izuku. Never at Izuku, not for this. So, he smiled at the baby—his baby if he was being honest with himself—and finally Izuku breathed. \n\n\n The three of them sat for a moment, waiting for Izuku to match Shouta’s deliberately steady breaths. Part of Hizashi was proud, actually, and a little bit relieved that Izuku was reacting so strongly to this. Obviously, he was upset that the baby was upset, but Izuku was always so quiet about his pain, and Hizashi was glad that he was acting so vulnerably in front of them, like he subconsciously knew he was safe here. \n\n\n Once Izuku was a little more settled, Hizashi held out his hands. Izuku reached back, then hesitated, so Hizashi closed the distance. “We’re not mad, baby.”\n\n\n Izuku’s breath hitched, and he hiccupped, “I’m sorry I stole your Quirk. It was an accident.”\n\n\n “It’s okay, Izuku,” Hizashi said softly. “I believe you. We all have accidents with our Quirks sometimes. That’s why I get so loud when I’m happy. I just can’t contain my Quirk anymore!” He squeezed Izuku’s hands. “Were you really happy, Izuku? And you just couldn’t help it?”\n\n\n He nodded shyly, and Hizashi grinned. “That makes me happy! I’m happy that you were so happy, so let’s all be happy again!” \n\n\n Shakily, Izuku smiled. \n\n\n “Izuku,” Shouta murmured, and Hizashi was so, so proud that his husband, who was all sharp edges, was attempting to soften his voice, “was that your Quirk?” Izuku nodded. “Did you take Hizashi’s Quirk, Izuku?”\n\n\n Izuku whimpered, his smile slipping. “I gave it back! I didn’t mean to! I won’t do it ever again.”\n\n\n Hizashi hushed him. “It’s okay, baby.”\n\n\n “Kid, we just want to help you. We can’t do that if we don’t have all the information, so we need to understand what’s going on here. Did you know your Quirk could do that?”\n\n\n “Uh-huh. I don’t… I don’t like doing it though,” he sniffled. \n\n\n “Okay, that’s okay. Do you have any control over it?”\n\n\n “Not… not really…”\n\n\n “But you gave Hizashi’s back. Did you do that on purpose?”\n\n\n “I don’t like keeping them. It’s hard, and it hurts sometimes.”\n\n\n Shouta tapped his fingers against Izuku’s cheeks gently. “I can’t use my Quirk right now. Are you able to?”\n\n\n In answer, Izuku’s eyes glowed red. \n\n\n “Wow,” Hizashi whispered, unable to keep it to himself. He’d seen copying Quirks before, sure, but this was something else. Thank goodness Shouta was so cool-headed and could approach the situation so methodically, because Hizashi was internally losing his shit. \n\n\n “And if I pull away,” Shouta said, taking his hands from Izuku’s cheeks, “my Quirk comes back. You can’t hold onto it?”\n\n\n Izuku chewed his lip and shook his head. “I can hold it if I try really hard. I don’t do that.” \n\n\n “Why not?”\n\n\n “That’s stealing. My dad steals. I don’t want to.”\n\n\n “It’s not stealing!” Hizashi chirped. “Not if you give it back, and you’ve given both of our Quirks back, so that’s just borrowing!”\n\n\n Izuku’s tiny nose wrinkled, like an adorable rabbit. “Borrowing?”\n\n\n “Yeah, kid. Borrowing,” Shouta agreed. “Why don’t you try holding onto my Quirk for as long as you can. If it starts to hurt, let go of it.”\n\n\n This time, when Shouta pulled away, Izuku’s teary eyes stayed red for a couple seconds. Then, the glow petered out. “Good job, kiddo.”\n\n\n Izuku sniffed and used his sleeve to wipe at the snot on his face, to Shouta’s clear disgust. “You’re… you’re really not mad?”\n\n\n “Of course not, kiddo,” Hizashi reassured, while Shouta disappeared into the kitchen for tissues. “We’re a little disappointed that you didn’t tell us, but we understand. Why did you think we’d be mad?”\n\n\n “My Quirk is bad, and you guys are good.”\n\n\n Shouta returned and sat on the couch, using the acquired tissues to wipe the snot off of Izuku’s face. “Quirks can’t be bad, kid, only people. And you,” he poked Izuku hard in the forehead, “are not bad. You are good. Now, let me clean you up so I can ask more questions, Problem Child.”\n\n\n This time, when Izuku cried, he was smiling. \n\n \n \n\n Later, after Izuku had cried himself to sleep and Shouta had finished an exhausting phone call with Tsukauchi, Hizashi tugged Shouta into their bedroom. \n\n\n “We’re adopting the baby, right? And no mind games with me tonight, mister! I want a simple yes or no answer from you.”\n\n\n Shouta sighed, resigned. “Yes, we are adopting Izuku.”\n\n\n Hizashi actually fist-pumped, causing Shouta to sigh again. “Oh, don’t be such a sourpuss, Shouta! I know you like the baby and wanna adopt him just as much as I do. I can see your little smile, don’t even bother hiding it! We’re gonna be dads, Shou! Let’s sign the papers right now, where are they?”\n\n\n “Slow down, Zashi.” Shouta grabbed his husband by the upper arms and guided him to sit on the bed. “We have to figure out the logistics first. For one, we should probably talk to Izuku about this before we do anything permanent.”\n\n\n Hizashi frowned. “Ya think he wouldn’t wanna be adopted by us? But we’re great! We love him!”\n\n\n “I’m not saying that. We should just have a conversation with all involved parties before we jump the gun. His Quirk does complicate some things as well…”\n\n\n “The kiddo just doesn’t know how to control it yet! We can’t blame him for that, Shou!”\n\n\n “I know, and I am not blaming him. The fact remains that his Quirk is dangerous if it cannot be controlled, so the obvious solution is Quirk counseling. I’m the only person I trust with that. Even then, there will be people unwilling to look past the implications of his Quirk who will assume the worst of him. I refuse to advocate that he hide his Quirk, since that will only cause more issues in the future, especially psychologically, but we have to be careful about what people know. There is a positive to all this, though, in that it seems like he hid the true nature of his Quirk from his father, so the League will likely be looking for a kid with an Erasure Quirk, which we won’t register him as.”\n\n\n “We can’t register it as All for One… even if that is what this is,” Hizashi pointed out. “That’ll bring some serious attention, and probably not only from the villains.”\n\n\n “So, we call it something else,” Shouta said easily. “The Quirk registry is open access, but only an individual’s name and the name of their Quirk is visible publicly. Quirk descriptions are hidden without valid HC or police ID, and even that requires certain clearances. We call it something nondescript, and we keep its description vague, just in case someone manages to access that, and he won’t draw attention.”\n\n\n “Oh, I know!” Hizashi raised his hand, like they were high schoolers again, and Shouta rolled his eyes but gestured for him to speak. “Call it Borrow! That could mean anything.”\n\n\n “Borrow works,” Shouta agreed, mostly because he wasn’t very creative when it came to names himself and couldn’t think of anything better. “The paperwork is in the kitchen. The sooner we do this, the sooner it’s done.”\n\n\n They slipped quietly into the kitchen, sparing a quick glance to Izuku sleeping blissfully on the couch with Joe purring on his stomach. Digging through the piles of paperwork on the counter, Shouta uncovered the Quirk registration and the adoption papers, the latter of which Hizashi snatched from his hands.\n\n\n “I call dibs on him being a Yamada!”\n\n\n Shouta shushed him. Then kicked him in the shin and shushed him again when he squawked. “He’s obviously going to be an Aizawa. We’re trying to keep the attention away from him. Your name is too well-known, and Present Mic was recognized at the villain raid.”\n\n\n` “Eraserhead was at the raid too.”\n\n\n “No one saw him there,” Shouta said smugly. “Besides, my civilian name and identity is not common knowledge like yours is. It’s only logical for his name to be Aizawa Izuku.” Logical, yes, but he couldn’t ignore the light feeling that rushed through his chest saying his kid’s name out loud. \n\n\n “Not fair,” Hizashi pouted. “You’re only doing your whole logic thing ‘cause you want him to be an Aizawa. If we were being ‘logical’ we would just keep his name as Midoriya since that has no ties to us whatsoever.”\n\n\n Shouta flushed. “No need to get riled up about it right now. We’ll still discuss the adoption with him first anyway, and it might be a good idea to wait on that until he’s more settled.”\n\n\n But Hizashi immediately shook his head. “He was so scared, Shou. He thought we hated him just ‘cause his quirk’s a little… scary. He probably thinks we’re gonna up and leave him. We should tell him we want to adopt him as soon as he wakes up. Make sure he knows we’re not leaving, and we want him.”\n\n\n Well, that was certainly logical. \n\n\n So, they waited for Izuku to wake from his impromptu nap, sitting with him and petting his hair as he snuffled slowly back into awareness. Shouta’s fingers carding through his hair—absolutely ignoring Hizashi’s lovesick, smug look at the affectionate action—seemed to reassure Izuku, and he cuddled deeper into Shouta’s thigh, using it like a pillow. \n\n\n Heart feeling much too full, Shouta tugged gently at the strands under his hands. “Wake up for us, kiddo. We wanna talk to you about something important.”\n\n\n “Wha’” Izuku blinked sleepily, sitting up under Hizashi’s guiding touch. Shouta would feel bad about waking him up, especially after the fit he had earlier, but his nap had already stretched well into the evening, and Shouta wanted the kid to sleep through the night. \n\n\n “Hiya there, kiddo,” Hizashi cheered, semi-quietly, when Izuku finally managed to rub the haze from his eyes. Both he and Shouta had agreed that he be the one to take the lead on this. Shouta would be the first to admit to considering himself… emotionally stunted, and this conversation would likely require a more delicate emotional touch than he could provide. He would let Hizashi take the reins and offer Izuku support through presence and touch which, according to Hizashi, was the best way to do it. \n\n\n “Izuku, we love having you here, living with us. We care a lot about you, both Shou and I do, and we’d love to have you stay with us. We want to adopt you, if that’s something you want too.”\n\n\n “Adopt?”\n\n\n “It means we’d officially be your dads, and you’d be our son.”\n\n\n Izuku frowned, burrowing deeper into Shouta’s side. “But I already have a dad… He was mean.”\n\n\n “He shouldn’t’ve been,” Shouta growled, unable to hide his resentment toward Izuku’s sperm donor.\n\n\n “Shou’s right, baby,” Hizashi said, much more gently, because he’s just better at this stuff. “Dads shouldn’t be mean to their kids. No parents should be. They’re supposed to love you and protect you. Your father didn’t do a very good job at that, but we’d do our best every day and make sure you feel safe and happy.”\n\n\n When Izuku hesitated, Shouta, surprised at his own need to contribute, decided to add, “Kid, to put it simply, we love you, and we want you to be our son, but that’s gotta be your decision. Are you happy here with us? Do you feel safe? Do you like it here?”\n\n\n Nodding, Izuku reached for Hizashi’s hands. “Yeah! You’re so nice to me, and I’m really happy! I can stay here?”\n\n\n “Of course, you can!”\n\n\n “I wanna stay,” Izuku said decisively. “You’re my new dads?”\n\n\n Shouta nudged his shoulder against him affectionately. “If you wanna call us that.”\n\n\n “You said that dads make kids feel safe and happy. You make me feel safe and happy, so you’re my dads. But what do I call my other dad?”\n\n\n “Bastard.”\n\n\n “No! Do not say that word, Izuku, oh my god.”\n\n\n And Shouta grinned alongside his family. \n\n \n \n\n Izuku settled into their life so cleanly, Shouta was amazed that he hadn’t been there from the start. They decided to legally keep the ‘Midoriya’ surname for the time being, since Hizashi was technically correct that it was the most logical and safe course of action, but they couldn’t be blamed for introducing him as Aizawa or Yamada Izuku to their trusted friends—and Shouta would absolutely be legally changing his name to Aizawa once All for One was dealt with, and Hizashi could fight him on that.\n\n\n  The paperwork was eventually dealt with, and Shouta was sure to keep Izuku’s details as vague as possible, particularly when describing his Quirk. They only told Tsukauchi, and likely All Might by extension, the truth of it. According to the registry, Borrow was nothing more than an interesting mix of a Copy and Erasure Quirk, which was sufficiently accurate even if it left some details out. Shouta even asked Nezu—\"‘Our principal?!’ ‘He hasn’t been our principal in years, Zashi.’”—to add his own security measures to Izuku’s files. If it meant keeping his kid safe, he’d gladly owe the rat a favor.\n\n\n Unfortunately, the favor happened to be him meeting Izuku which could lead to nothing good. Shouta knew his kid had potential, and Nezu would logically see that and undoubtedly take him on as a personal student. From there, who knew what trouble the two of them could get into together? So Shouta told Nezu he would have to wait until Izuku was a little older, when he had a better sense of his own autonomy. Hopefully, by then Izuku’s own common sense could curb Nezu’s scarier tendencies. \n\n\n Other than that sense of impending doom, their lives settled into relative normalcy. During the day, Hizashi went to work—either the station, patrols, or both—and Shouta stayed with Izuku. They trained his Quirk in the mornings, since that was when Izuku had the most energy, and homeschooled in the afternoons. Despite his clear hesitance to ‘steal’ Quirks, even for the purpose of training, Shouta’s constant reassurances slowly allowed Izuku to trust himself and, by extension, his Quirk. He grew more comfortable with his abilities, increasing the time he could hold a Quirk after contact and even managing to hold both Hizashi’s and Shouta’s Quirks at once and use them simultaneously. Shouta was disgustingly proud of him.\n\n\n In the evenings when Hizashi returned from work, they ate dinner, and then Shouta patrolled from the late evening until the early morning. Over time, their fridge became covered with Izuku’s drawings and, once he learned, his writing, until they migrated into a constantly expanding collection of notebooks. Even then, his first drawings of Present Mic and Eraserhead were never removed from the fridge. \n\n\n It was all sickeningly domestic, and Shouta loved every second of it. \n\n \n \n\n All for One was defeated when Izuku was nine. When Tsukauchi delivered the news—with no additional details—the small family celebrated with ice cream and another, final legal name change. \n\n\n After heavy debate—which involved Hizashi threatening to sing pre-Quirk era pop songs to Shouta every night if Izuku’s name wasn’t changed to Yamada, and Shouta promising to delete the recordings of Hizashi’s favorite reality show if it wasn’t changed to Aizawa—Izuku had interrupted by sliding the paperwork, already completed by a shaky hand, between them. \n\n\n In the space of ‘Family Name,’ he had combined the first kanji of both of his dads’ names: Aiyama. \n\n\n And when he looked at them from across the table—the two men he had decided were worthy to be called ‘dad’ when the last holder of that title had done nothing but hurt him, who he childishly distinguished between as Shou-Dad and Zashi-Dad because he thought neither of them were more deserving of the title than the other, whose sign names of ‘Coffee’ and ‘Loud’ he combined with the sign for father every time he used them… \n\n\n When he looked at them and said he wanted a piece of both of them in his last name? \n\n\n Well, they couldn’t deny him that. \n\n\n That night, Aizawa Shouta, Yamada Hizashi, and Aiyama Izuku curled together on the couch, Izuku snuggled firmly between his dads, and watched movies. It was something they had done a thousand times before in the three years of being a family, but tonight there was an undeniable sense of peace settled deep in their bones. Izuku’s biological father, who had snapped his fingers and crushed his heart with his own hands, whose torture lingered in Izuku’s mannerisms when he slept with his vulnerable hands tucked to his chest, when his stiff fingers ached on bad days, when he silently panicked every time he woke up in a dark room… That man had been defeated. Izuku was safe, and his dads—his dads—could finally breathe a sigh of relief knowing their son—their son—was safe. \n\n\n That effervescent feeling of security lasted for the next few days as their movie night extended into a week-long movie marathon. The only interruption to their quiet celebration came at the end of that week, the day before Hizashi and Shouta would return to work, by the sharp ping of Shouta’s phone, the one reserved solely for hero work. Heart heavy before even glancing at the screen, he knew whatever he read on there would threaten the tranquil bubble he and his family had existed in since All for One’s defeat. \n\n\n As always, he was correct. \n\n\n\nALL MIGHT to ERASERHEAD\n\n\n\n\n&gt;Tsukauchi says you have\n\n\n\n\n   taken responsibility for All \n\n\n\n\n   for One’s child. \n\n\n \n\n\nTSUKAUCHI NAOMASA to ERASERHEAD\n\n\n\n\n&gt;I’m sorry. He wouldn’t rest until \n\n\n\n\n  he knew AFO’s successor\n\n\n\n\n  would not be an issue. \n\n\n \n\n\nERASERHEAD to ALL MIGHT\n\n\n\n\n&gt;We have adopted Izuku, yes\n\n\n \n\n\nALL MIGHT to ERASERHEAD\n\n\n\n\n&gt;Keep an eye on him\n\n\n\n\n&gt;A Quirk like that is a \n\n\n\n\n  dangerous weapon. Who \n\n\n\n\n  knows what All for One’s \n\n\n\n\n  child might do with it if \n\n\n\n\n  proper measures are not \n\n\n\n\n  taken. \n\n\n \n\n\nERASERHEAD to ALL MIGHT\n\n\n\n\n&gt;He is not All for One’s. He\n\n\n\n\n   is mine. \n\n\n\n\n&gt;Any Quirk is dangerous\n\n\n\n\n  without proper training. We \n\n\n\n\n  will not treat our son any \n\n\n\n\n  differently, and neither will\n\n\n\n\n  you. \n\n\n\n\n&gt;Thank you for dealing with \n\n\n\n\n  All for One. Now, stay away \n\n\n\n\n  from our son.\n\n\n\n All Might never replied, but Shouta was done with the conversation anyway. Objectively, he understood All Might’s trepidations. All for One had killed many people, some of which were personal connections of All Might’s. But Izuku was not his biological father. He was too good to ever be that, with his Hero Analysis for the Future notebooks, and the goofy doodles he left on the kitchen counter for his dads to find after patrol, and the painstakingly written ‘Aiyama’ on the paper taped to the fridge. There was no doubt in Shouta’s mind that Izuku would grow up to be a spectacular hero rather than the villain he was once groomed to be. \n\n\n Pulling his son close, Shouta knew it was only a matter of time before everyone else realized it too. \n"
}