{
    "id": "28843800",
    "url": "https://archiveofourown.org/works/28843800?view_full_work=true",
    "author": [
        "PhantomKetchup"
    ],
    "title": "The Incident",
    "rating": "Not Rated",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "Gen",
        "M/M"
    ],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Bakugou Katsuki & Midoriya Izuku",
        "Bakugou Katsuki/Midoriya Izuku"
    ],
    "characters": [
        "Midoriya Izuku",
        "Bakugou Katsuki",
        "Hatsume Mei",
        "Maijima Higari | Power Loader",
        "Aizawa Shouta | Eraserhead",
        "Original Characters",
        "Original Male Character(s)",
        "Original Female Character(s)",
        "Shinsou Hitoshi",
        "Todoroki Shouto",
        "Todoroki Touya (mentioned)"
    ],
    "additional_tags": [
        "Alternate Universe",
        "Alternate Universe - Canon Divergence",
        "Quirkless Midoriya Izuku",
        "Genius Midoriya Izuku",
        "Inventor Midoriya Izuku",
        "Support Department Midoriya Izuku",
        "Analyst Midoriya Izuku",
        "Bakugou Katsuki is a Good Friend",
        "Protective Bakugou Katsuki",
        "Possessive Bakugou Katsuki",
        "Feral Midoriya Izuku",
        "Protective Midoriya Izuku",
        "Powerful Midoriya Izuku",
        "Bakugou Katsuki Will Be Best Husband",
        "Bakugou Katsuki is a Good Significant Other",
        "Fluff and Humor",
        "Scary Midoriya Izuku",
        "Izuku's Robot Army (mentioned)",
        "Midoriya Izuku is Not Okay",
        "BAMF Midoriya Izuku",
        "Protective Izuku Can and Will Hand You Your Ass",
        "The Todoroki's Were Blessed With A Baby Izuku",
        "So that changed some things but don't worry about it",
        "Izuku is Hungry"
    ],
    "language": "English",
    "series": "Part 6 of Genius Support Course Izuku",
    "published": "2021-01-19",
    "completed": "2021-01-26",
    "words": "7,529",
    "chapters": "2/2",
    "comments": "165",
    "kudos": "5,832",
    "bookmarks": "292",
    "hits": "46,226",
    "summary": "<p>“Of course, Kacchan! No poison on the drone, pinky promise!”<br>Katsuki grumbles over the wording of the promise but knowing better than to try pushing for a promise of no poison at all. He wraps his significantly larger pinky around Izuku’s dainty little digit before ruffling his hair. Looking at his ruffled hair Katsuki frowns before checking his pockets then his bag when his pocket don’t have what he’s looking for. He pulls out a small, green plastic case with a glittery I branded on it in yellow and orange, from the case he pulls out a hair clip, this time with a cute little bunny charm on it and pins up Izuku’s bangs.<br>“You need a haircut soon.”<br>“Hm, will you come with me? You always explain it better to the person.”<br>“Sure. I gotta get to class early, nerd. 1-A’s got the field trip today, remember? We leave before lunch and won’t be back until classes let out so remember to eat lunch, you got me? OI! CLIPBOARD!”<br>Nakahara jumps in his seat, having been laying out his own designs. “Ah! Uh yes, Bakugou-san?” Nakahara turns to face Izuku and Katsuki.</p>\n<p> <br>---<br>USJ</p>\n<p>Izuku misses lunch and Katsuki sets a bot loose on a poor admirer.</p>",
    "notes": "<p>Lol nearly everyone was just ready and waiting for Izuku to really just mess up Shiggy and the league at the end of the last chapter ahahahahaa!! I hope this will be enough to satisfy you all!!</p>\n<p>Fun fact: This chapter is over twice as long as the last one (￣﹃￣)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>Thank you for all the comments and I can't wait to see you all in the next part!!! （＾∀＾●）ﾉｼ</p>",
    "text": "“Kacchan, you with me? Here! I finally got the materials right for all day wear for you! Now there is low to zero chance for your quirk to destroy it after prolonged exposure to it, it’ll actually get stronger with prolonged exposure! I’m still tinkering with other materials to get this to work on a larger scale for certain parts of your suit but you can have this now that I got it working!”\nIzuku holds out the simple looking bracelet that looks not quite like a gold chain but similar enough to pass as one from a distance. Katsuki takes it and looks it over, some sections are thicker than others but it’s light when Izuku takes it back to secure it delicately around his wrist for him. Heat spreads across his cheeks as Izuku holds his hand, turning it this way and that to see the way it rests on his wrist. Katsuki looks away as he adjusts his hold so that he can tug Izuku along to walk at his side. His hand tightens for a second to signal that he’s not letting go and Izuku just sends him a sunny smile and squeezes back in response, happy enough to lightly swing their hands between them as he begins his explanation for the bracelet.\n“Bracelet?”\n“Mmhm! It’s linked to Rice Cup and mine. I had to update Cuppy so that our channel runs in a closed circuit independently from other servers and … ah” noticing Katsuki’s slight confused and sleepy expression Izuku abandoned that explanation and decides to explain in simpler terms for now, he can explain fully later when Katsuki is awake and ready for lengthy explanations, “So as long as Cuppy is operational our signal won’t run into any type of interference. Since I was already doing these upgrades on mine I was able to make yours the upgraded version, nice and streamlined too since I know you like the simpler look. So do you feel how some sections are thicker?” Katsuki brings their intertwined hands up to eye level and runs his free hand over the bracelet again to show he understands which sections Izuku is talking about. Izuku nods at the pointed look at him. “Well one of those sections is the original pressure plate from version one that Cuppy can use to send you short messages, you can work out a specialized code with Cuppy later if you want but for now it’s set to our usual tap system. On the next section is a mic and speaker set for us. You just have to run your finger along the four edges of the panel to turn it on, it’ll pulse for an incoming transmission and the other will have to turn their side on before the line is live. The last panel houses a GPS just in case you lose it somewhere or if you call Cuppy for help he’ll start tracking your bracelet and I’ll receive the information; it works in reverse too so if I call an S.O.S. you’ll get the information too on your phone.”\nKatsuki grunts his understanding, still a little groggy from his short doze on the train but awareness starts to bleed into his eyes. They’ve got another ten minutes before they get to the school gates, Katsuki will be sufficiently awake by then and ready to take the lead on dropping Izuku off at his class. Izuku smiles soft and warm up at the partially fuzzy way Katsuki takes in their surroundings, never been much of a morning person but still insistent on taking care of Izuku as the older of the pair.\nThey’ve settled well into their routine after a week and a half of being in school. Katsuki comes to wake Izuku if he’s not already awake and then they catch the train to the station closest to Yuuei, sometimes Katsuki will lean on Izuku and doze off for a few extra minutes if they manage to find seats. A few times when all they had was a spot near the doors Katsuki would drape himself over Izuku’s back, wrap his arms around Izuku and rest his head in his curls, breathing in the faint strawberry scented shampoo Izuku uses and closes his eye for a few moments more while letting Izuku support the slight weight a drowsy Katsuki will allow himself to burden Izuku with. Izuku, having always been the type to be wide awake as soon as he opens his eyes, will keep an eye out for their stop and bask in the slight clinginess of a sleepy Katsuki.\nThe walk from the station to Yuuei serves to wake Katsuki up fully so that as soon as they cross the gates he’s displaying his usual assertive personality and leading the way down to the support classrooms. Izuku takes that time to begin cataloging all the quirks of the students that have the unfortunate luck to cross their path, if they don’t stop the pair end up with a nice fifteen minutes together in class 1-H before Katsuki has to head to his own classroom. What they do during those fifteen minutes is different most mornings. So far they’ve gone over Katsuki’s suit or various gear designs, played games to determine what movie they would be watching after school, and argued over what upgrades Cuppy or Fruit would be getting next. Katsuki has carried Izuku around the room over his shoulder a few times to keep him out of Hatsume’s hands, and Katsuki has also spent more mornings than he’d like glaring at Sakamoto to keep him from approaching Izuku’s desk.\nThis morning Izuku excitedly pulls out the blueprints for his current project to show Katsuki now that he’s had a few days to work on it and it’s close to being complete and officially too far along for Katsuki to talk him out of such a potentially dangerous item. Izuku rambles happily about all the fine tuning the drone had needed to undergo and the change he had made from the poisoned darts it shot in the beginning to the new addition of canisters that would disburse a highly potent sleeping gas he reverse-engineered with help from numerous samples from Midnight that Maijima-sensei had gotten for him in addition to the small but powerful speakers that would emit an isolated blast of sound that depending on which of the two frequencies it’s set on would either knock the target out or disorientate them for the user to finish off the job.\n“Izuku…”\n“Yes, Kacchan?”\nKatsuki looks at the crazed light present in Izuku’s eyes as he continues to look over his blueprints and Katsuki pinches the bridge of his nose and loudly exhales.\n“Izu, baby…“\nIzuku’s eyes snap to him, attention focused on him and only him as the blueprints get lowered to the table once more and a pretty blush makes an appearance on Izuku’s pleased face, Katsuki doesn’t call him that often but when he does it warms his chest and Izuku does his best to grant whatever Katsuki asks of him. In the background Sakamoto pouts as he gathers his gloves and apron from the lockers at the back of the room and in the front of the room Nakahara averts his eyes as an embarrassed bright red blush takes over his face at the cute look on Izuku’s face, the other students pay the pair no attention as they gather their own materials for the day.\n“Kacchan…?”\n“This is too much for a… you know what, it doesn’t shoot poisoned darts anymore right?”\nAt Izuku’s nod Katsuki lets out a soft sigh and Izuku confusedly tilts his head at the reaction.\n“Did you want the poison darts, Kacchan? I can put them back, don’t worry!! It’s just a little annoying that it’s such a small amount the drone is able to hold, you would have to really choose which targets are a priority but if you want the poison I can do that for you Kacchan!!”\nFrom his spot at the front of the room Nakahara face palms and quietly groans in despair over the hard work he’d done to get Izuku to let go of the darts, Katsuki similarly just moves to rub his temples before he looks Izuku in the eye.\n“No, Izu. It’s fine the way it is, no poisoned darts, okay? Do you hear me, Izu? No poison, promise me no poison.”\nIzuku blinks before nodding and holds up his pinky for Katsuki, smiling brightly at him.\n“Of course, Kacchan! No poison on the drone, pinky promise!”\nKatsuki grumbles over the wording of the promise but knowing better than to try pushing for a promise of no poison at all. He wraps his significantly larger pinky around Izuku’s dainty little digit before ruffling his hair. Looking at his ruffled hair Katsuki frowns before checking his pockets then his bag when his pockets don’t have what he’s looking for. He pulls out a small, green plastic case with a glittery I branded on it in yellow and orange, from the case he pulls out a hair clip, this time with a cute little bunny charm on it and pins up Izuku’s bangs.\n“You need a haircut soon.”\n“Hm, will you come with me? You always explain it better to the person.”\n“Sure. I gotta get to class early, nerd. 1-A’s got the field trip today, remember? We leave before lunch and won’t be back until classes let out so remember to eat lunch, you got me? OI! CLIPBOARD!”\nNakahara jumps in his seat, having been laying out his own designs. “Ah! Uh yes, Bakugou-san?” Nakahara turns to face Izuku and Katsuki.\n“I’m out today so you better make sure my nerd eats during lunch, don’t let him skip it because he’ll work through it if no one comes to force him to take a break. Keep an eye on the pretty boy too, don’t let him get his grubby hands on my Izu or it’s my foot down your throat and his, understand?”\nWith the nervous nod from Nakahara Katsuki scans the room for Hatsume. Seeing her just arrive he calls out to her as well.\n“GOGGLES!!” Hatsume’s gaze snaps to him immediately before grinning at Izuku who waves cheerily at her entrance.\n“ZuZu, Blasty.”\n“Tch. Whatever. I’m gone today and I want my nerd back in one piece when I get back.”\n“Of course, Blasty! Wouldn’t dream of breaking darling little ZuZu.” Hatsume grins just a touch too wide for Katsuki’s liking but a glance at the clock has him cursing. Hatsume simply gets to setting up her worktable for the day, eager to begin on a new baby with Izuku she’s been waiting for the right moment to start on.\n“Gotta go, Izu. I’ll come straight here when we get back so don’t try finding me, don’t think we’ll get away with pulling the quirkless card here if you terrorize the other students to tears.”\n“Ah okay!! Bye Kacchan! Don’t forget to take notes on the bracelet today, I wanna know how it holds up in action!!” Izuku waves at the retreating form of Katsuki who throws up one last backwards wave before he disappears from sight.\n“Na Koutaaaa~ Kacchan packed lunch for me today, do you wanna try it later?” Izuku’s eyes sparkle and his grin is sharp, Nakahara is confused by the overwhelming sense of danger he feels from such an innocuous question.\n“Ah, maybe. What is it?” he cautiously asks.\n“Kacchan’s signature curry!”\nNakahara relaxes. ‘Well I do love curry.’\n“Sure! It’s not too mild is it? I like a little spice with my curry.” Nakahara smiles oblivious to the danger he’s in.\n“Oh don’t worry, Kacchan adds just the right amount of spice for us.” Nakahara hums in understanding and turns back to his desk, completely missing the deviously delighted look on Izuku’s face.\nIt’s unfortunate that they don’t get a chance to eat the curry that day due to a surprise attack. A message from Katsuki sends Izuku into a cold and calculating rage that he’s never felt before and sends chills up the spines of his classmates. Midoriya Izuku is a 15 years old quirkless genius and as a group of villains are about to find out, quirkless does not mean helpless.\nIzuku finishes the last touches to the drone he’d shown to Katsuki. He gathers both his original blueprints and the updated version along with the notes on what he’d made changes to on the final design and brings them up to Maijima-sensei for review and to request use of the testing room for his new bot.\nHe’s in the middle of carting his child out of the shop when his watch gets the ping from Rice Cup. He looks down before he turns to rush back to his table, pulling his phone from the safety of his backpack and checking to see if he was mistaken and it wasn’t the emergency GPS ping he’d just received. The rest of class 1-H look on in concern at the tense form of Izuku gripping his phone tight in his hand, all activity stops and in the quiet of the room everyone can hear the soft humming coming from Izuku’s watch.\nWith a shaky hand Izuku quickly runs his fingers over the edges of his watch face and to the horror of everyone in the room, Katsuki’s voice comes out in a harsh whisper tinged with panic and anger.\n“Villains have invaded the USJ. The class is trapped and communications have been cut off from Yuuei. All Might is not here to help us.”\nMaijima-sensei is the first to snap out of his shock as he jumps up. He gives orders to Nakahara to keep everyone in the classroom and follow lock down procedures, hardly waiting for a confirmation before he’s out the door.\nIt takes the teachers 12 minutes after Maijima reports the security breach to scramble together and get in the transport vans to USJ. It takes Izuku 2 minutes to communicate with Rice Cup authorizing the opening of the storage unit closest to the school and activating the bot teams he’d equipped with the hover tech fast enough to get to the USJ. He leaves the school 5 minutes after Katsuki made contact wearing the prototype boots he’d made for Katsuki on his feet allowing him to blast through the air and the recently redesigned grenade shaped gauntlets settled on his arms, both gauntlet and boots filled with stored sweat he’d gotten from Katsuki giving them the fire power to operate as he makes his way to the USJ. Whizzing through the air with him is his new drone holding the black face mask he’d had to design to protect him from the potent sleeping gas he’d developed. Strapped to Izuku’s back and waist are weapons, a staff with an electric charge built into it and several knives he’d taken from Sakamoto who was unable to deny Izuku as he was at the time. The cold, quiet, fury shining in his eyes had everyone in the classroom frozen and unwilling to get in his way fearful of that sharp calculating gaze falling on them.\nBlasting through the air Izuku approaches the USJ, normally a 30-minute drive, in 10 minutes. The heroes likely to arrive 25 minutes after him if they’re speeding.\nNot far behind him a swarm of flying robots steadily catch up with him, various shapes and sizes with few shared traits between them. One being the obvious hover tech allowing each to fly, their glowing red eyes indicating them set to live combat rather than the usual calm green of the training setting, and finally the sleek and simple green sprout design of Izuku’s brand on them.\nAs soon as they’ve caught up Izuku calls attention and waits a moment to count the answering hums from his children making sure they’re all listening and ready to receive orders.\n“Team One with me. Teams Two, Four, and Five: Objective; Locate and assist Kacchan, acknowledge.” He waits for the affirmative ping to sound before continuing orders.\n“Secondary Operator Activation: Kacchan,” another ping of acknowledgement follows, “Scan for hostiles and eliminate threats.” The USJ is in front of them and Izuku can hear the beginnings of a fight and the abrupt start and cut-off of several screams before he crashes through the glass ceiling, the chaos below covering his entrance as the sunlight creates a halo around him before the light becomes snuffed by the red-eyed bots following closely behind him. The teams assigned to finding and helping Katsuki take off in different directions leaving behind the handful Izuku kept to help him, the new drone among them. As Izuku is controlling his fall he quickly settles the mask into place, obscuring his face while the reinforced tinted glass screen covering his eyes comes to life and scans the plaza where he sees many villains fighting a single person, eyes moving to find the familiar head of platinum blond hair and the longer he doesn’t see it the more his rage builds up.\n\n‘Where is my Kacchan, what have they done with him.’\n\nThough his rage is big and consuming he does not let it take his brain, calculating eyes count four students at the entrance and a quick look at his team to confirm the bots with him he gives a quick order, “Mizuno; Evacuation protocols for the students we come across starting with those at the entrance. Evacuation rendezvous point will be the transport vehicles 30 meters from the building. Return after drop off.” The large bot gives a ping before he sprouts many tentacle-like arms with large, gloved hands from his body as his eyes change to a happy blue to match his emergency beacon that pops out of the top of is head and emits a happy chirp every few seconds.\nMizuno flies off in the direction of the students, the cheery robotic voice Izuku modelled after Hisashi reassuring them as he approaches “Do not worry children, Papa is here! Help has arrived! Please allow me to take you somewhere safe! Do not worry!” The strong tentacle arms gently wrap around the students as the gloves give steady pats to their heads when they are lifted from the ground and Mizuno flies to the wall a pair of hands had punched a hole through for them to exit. The students, while unable to turn to look behind them while being held like puppies by the bot, can hear and smell the sweet-scented explosions they’ve come to recognize as a product of Katsuki’s nitroglycerin sweat and relax subtly at the assumed safety of the rest of their classmates who had been scattered by the warp gate just a minute earlier not knowing that while it is Katsuki’s sweat behind the explosions it is not Katsuki wielding the power. Mizuno continues his reassurances while he steadily and speedily takes them to the bus. “Authorities have been alerted, please stay here at the evacuation point and wait for further assistance.” His arms unwind from the students as they are gently deposited on the ground in a close group and with a final pat to their heads Mizuno turns, arms and beacon retracting into his body as his eyes switch from the happy blue back to combat red and returns to Izuku and the USJ.\nIzuku is angry and taking it all out on the thugs gathered in the plaza, after questioning the first few he had determined they were not truly villains, just common low lives and thugs here because they thought they were getting an easy paycheck beating up a class of kids. It’s too bad they had picked the class that had his Kacchan. Spotting Eraserhead fighting on the other side of the plaza he sends most of his bots to provide backup after tagging him as a teammate for his bots to differentiate him from the rest of the dark clothes wearing “”villains”” in the area.\nIzuku tears through the enemies on his side of the plaza, easily weaving in and out of attacks gracefully from years of training in many disciplines as he analyzes them on the spot, quickly finding weaknesses and happily exploiting them. Dutifully following above him is the new drone providing cover for Izuku, the dense gas releasing in short bursts to obscure him from sight while knocking those within the radius of the gas unconscious. No one is quite able to catch a glimpse of Izuku while he’s fighting in the dense black gas, the only thing visible from outside of the area are the occasional explosions lighting up vague silhouettes of someone short and the dropping bodies of taller adults that trail behind the moving cloud of gas. The last thing the enemy sees is the sharp, almost demonic, glow of Izuku’s acid green eyes within the swirling black gas as they fall victim to his rage.\nOccasionally Izuku has to recall a bot to assist in the takedown of someone to preserve some of Katsuki’s sweat. Though for the most part Izuku viciously uses the charged staff in combination with short, controlled explosions using Katsuki’s loaded gauntlets to add power to the blows he deals.\nA few times Mizuno sneaks, unnoticed by the enemies, off the plaza-turned-battlefield to assist evacuation as either he or Izuku spot students cautiously inching around the plaza to the entrance guided by bots from Team Katsuki. The fact that so many bots lead students to the entrance before flying back in the direction they came from fills Izuku with confidence as he takes it to mean Katsuki has successfully been found and is going through the various zones to find the rest of his classmates and sending them out. Izuku hadn’t been keeping track of the numbers but with every pair of students not containing Katsuki gets carried out he gets more and more frustrated with the group of weak villains. This leads to his moves getting more aggressive as he fights, broken bones on unconscious bodies becoming more common the closer he moves to the center of the plaza.\nLooking up after his last victim falls in a bloody heap at his feet Izuku takes note that Eraserhead, while slower than before, is not sluggish or sporting any major injuries as he systematically knocks out every person in his path with assistance from his babies. It even looks like he’s fighting, beautifully he might add, in turns with his children! He observes the way Eraser flips around someone and activates his quirk right as the bot most suited to challenge the villain deals a powerful attack giving Eraser the opening to deliver the final finishing blow, cleanly neutralizing each opponent while his other bots hold back the rest from rushing or ganging up on Eraserhead.\nHe looks at the dwindling number of villains before he catches sight of three people standing off to the side watching everything go down. The biggest one stands in place, unmoving and unblinking, stare empty with nothing to suggest having any thoughts of it’s own. The second is a tall, curious looking man made of mist wearing a suit. His narrow glowing yellow eyes seem to shift between the gas still keeping him from sight, Eraserhead, and the last person standing with the isolated group. The last is a boy, as Izuku doesn’t think he looks old enough to be called an adult despite the severed hand covering his face, standing hunched over as he frantically scratches at his neck and shakes in what Izuku concludes is barely controlled rage.\nIzuku takes a deep breath to clear his mind of the anger that clouds his head and gets to work analyzing the small group before he goes in to end it all.\n\n‘The three of them are separate from the rest, at first glance the smaller two look to be just as weak as the rest of the hired villains but the fact that they are separated from the group signifies importance, are they handlers for the big one or are they the leaders behind this invasion? The visible rage expressed by the shorter would indicate a leader rather than hired help as a pawn would show anxiousness for a job going sideways rather than the rage of unexpected variables changing the outcome of a plan. The suit is focusing more on the shorter, his form wavers in response to his growing tension showing a familiarity between them. The wariness points to him having a healthy amount of fear for the boy and being accustomed to his bouts of rage, maybe to do with his quirk? Could the last of the group be a part of his quirk? Maybe the ability to create and command such monsters, that would be reason enough for the suit to be wary of the boy’s rage if he is able to control the beastly thing. Something that big at the whims of a raging teen is formidable but it doesn’t add up. If the boy’s quirk had to do with controlling the beast Suit would be focused on the beast and not the boy... So the beast has nothing to do with his quirk but is still under command of the boy, the beast can’t be controlled by the suit because if he were the one in control what reason would he have to be afraid of the boy? So the boy is the leader. And the beast is its own entity. Okay, quirks.… He’s scratching at his neck a lot; it looks to be flaking off and there are trickles of blood. Is that evidence of a quirk or a medical condition? If a quirk it means he has something that effects his body, that hand on his face must be a hint at his quirk. A person’s costume is often a reflection of a person’s quirk if you know what to look for. So hands. What of his hands. They look to be a little larger for someone of his build and when he’s not scratching he talks with them. OH! The suit is focused on where his hands swing so that marks him as having a hand-based quirk, but what kind of quirk. His hands look dry, he looks dry overall. Maybe he dries out what he touches like a dehydrator. That would make sense with his neck flaking as he scratches too. Shouldn’t have an effect on my bots as they don’t have anything to dehydrate. Further observation is required. The suit. Obvious mutations to his body but that can’t be the whole of it, there has to be more to it if he’s being kept close to the leader. What purpose does he serve? He can’t be a mentor as there doesn’t seem to be any respect the boy holds for him. Maybe a handler for the boy? The way he flickers and wavers-“\n\nHis thoughts are interrupted by abrupt movement at the corner of his vision and the two he was analyzing take notice as well. Eraserhead had finished off the last of the thugs. Izuku’s notices the vaguely suspicious look that gets sent his way by the hero but both turn their attention to the trio, the boy looks to have started clawing at his skin and the suit is inching away warily before a misty purple-black swirly warp appears at his eye level.\n‘Is that a warp gate? A pocket dimension? This would explain the fast scattering of the students, what is he looking for, whatever it is his body language says he’s not finding it.’ Izuku can’t quite keep the small viciously satisfied smirk off his face as he sees the boy round on him and begin yelling at him for what Izuku suspects is the successful evacuation of the students. What Izuku catches sounds like threats of bodily harm and the boy giving away the suit’s quirk. ‘A warp gate, huh… Probably needs prior knowledge of a location to work if he wasn’t able to locate the students outside of the USJ.’\nBehind the trio he can see an odd tuft of hair peeking over a bush, Izuku is unable to discern if it’s two people or one person with bi-coloured hair but what he really wants to know is why they’re here and not evacuated with the others. ‘Did Kacchan miss them? Did Mizuno??’\nBefore Izuku can signal for Mizuno to get them out the boy, who for some reason looks vaguely familiar but he can’t focus on that right now, is revealed from the bush he’s hiding behind as the branch holding his weight snaps and he stumbles forward getting his shirt caught on the broken branch. His eyes are wide as he tries to tug his shirt free before he freezes as the flaky teen whirls around with a hand outstretched reaching for the bi-coloured boy’s face, shouting something about breaking someone’s pride. Izuku tenses ready to launch himself across the plaza when he notices the confusion plain to see on the teen’s form as he turns an annoyed and slightly impressed grin to Eraserhead, his pinky lifts separately from the rest of his fingers before the entirety of the villain's hand falls from the frozen boy’s face. He says something too low for Izuku to pick up from where he is and then between one blink and the next the beast lunges and has Eraserhead’s face in his monstrous hand and has slammed it down into the concrete. Izuku sees red, all of the rage he’s been working so hard to keep from taking over his brain, the agony of not knowing where Katsuki is in all of this, the vicious part of him trained in multiple fighting styles and practiced in alarmingly fast and accurate analysis that’s been tightly leashed and tamed by Katsuki’s exasperated hand is let loose seeing his favourite hero smashed into the ground like a bug.\nBefore the monster can pull Eraser from the crater he’s made in the concrete Izuku is flying from his position in the gas cloud, he’s got the bots surrounding the pair and while one bot shoots a steel reinforced netting over the monster, Mizuno’s arms swiftly extend to wrap tightly around Eraser and pull him from the slackened grip of the monster and carries him a safe distance away. In the span of the three explosions it takes him to reach the monster Izuku has devised a plan. As he does a spin on his last explosion to recenter himself he pulls three of the knives from the holster on his waist and throws them with deadly accuracy at the exposed brain of the beast catching a bit of the netting on one of the knives causing it to lodge into the brain as well. Three of the bots then move in with their sparking electric prods on the highest voltage, launching them the short distance to stick into various places around the neck of the beast. Izuku’s swift descent has him pulling his staff once more, the end crackling with the energy output he has running through it and using another controlled explosion to bring it down in a powerful arc landing the final blow on the brain of the monster. In a sickening squelch splattering brain matter and viscous black goo it ends, the monster slumps down in a twitching pile, electrified nerve endings causing his limp body to flail beneath the net as his brain quickly turns into a charred smoking mess.\nThe teen brings attention to himself with a screech of rage, accusations of cheating and nasty disgusting hackers fall from his crazed mouth. Izuku, still on his rage high propels himself into the air and pulls more knives out. ‘Hands, five-point contact activation as observed from the unconscious lifting of the pinky.’ Bright green eyes zero in on the twitching hands and he lets the knives fly true to their mark. A screech of pain is heard as the teen cradles his hands close to his chest. At his feet lay three of his fingers, from his left the top knuckle of his pinky and half of the ring finger and from his right hand the middle finger.\nIzuku lands and begins stalking toward the howling teen, his intimidating and oppressive rage radiating from his small form when suddenly the doors to the entrance of the USJ burst open, momentarily distracting Izuku from his path allowing the teen and the suit to make a hasty retreat. The last Izuku sees of them is the slight shimmer in the air from where the warp gate closed after swallowing them.\nIzuku has to suppress his emotions, choking as they are in how heavy they push on his chest in order to take a look around the plaza. He notes Mizuno carefully carrying Eraserhead up to the entrance and the bi-coloured boy sitting in shock still stuck in the bush staring at him with wide shining eyes. Before Izuku can send a bot to help the boy his ears perk at the familiar sound of Katsuki’s voice calling his name from the opposite side of the plaza.\nRelief, warmth and joy floods his system as he turns, already using explosions to propel him to Katsuki who similarly has done the same. They meet in the middle and Katsuki catches him in the air, Izuku clinging tightly to him as he can’t support himself any longer. All the negative emotions he let hold him the last half hour had drained him as he cries into Katsuki’s neck, one hand firmly fisting his sweaty gym shirt and the other tangled in his hair in what can only be a painfully tight grip for Katsuki but Katsuki doesn’t say anything about it. One hand soothingly stroking Izuku’s curls as the other arm wraps around his waist, holding him close and whispering reassurances to him.\nKatsuki slowly sinks down to the floor, lapful of a sobbing Izuku and the uncomfortable feeling of his mask, hard and biting where it is, being pressed tightly against his neck makes him wince the slightest bit. But trying to pull back enough to get it off of Izuku’s face makes him sob louder and cling tighter, the hand in his spiky hair tightens so much that Katsuki has to bite down on a curse. So he settles down, fights his own misty eyes as he takes in his surroundings. Sees the evidence of his Izuku fighting for him. He thinks back to the last of the fight he’d just caught, the vicious acid green of Izuku’s eyes as he propelled himself to Aizawa-sensei using Katsuki’s quirk. The frighteningly fast and efficient way Izuku had taken down a monstrous beast more than twice his size then the cold rage that had him cutting fingers off of the leader of the invasion. He’s not sure if he would have been able to stop Izuku from finishing off the teen if the rest of the heroes hadn’t arrived when they did, and as scary as that thought is he also can’t help the flood of pride that rushes through him. Izuku, his nerd, had proved once again how capable he is and had put fear into the heart of the asshole villains that had invaded his class trip. Had proven how strong he is without a quirk, how amazing he is with his bots ‘Our children’ Katsuki is reminded by the little voice in his head that sounds exactly like Izuku.\nAnd at that Katsuki can’t help but snort at the memory of a swarm of Izuku’s murder bots, letting out cheery little beeps and robotic chirps when they caught up to him and the few with voice boxes happily calling out “”Daddy”” which he’s glad none of the extras had been close enough to hear at the time. With a red face he had taken stock of the team Izuku had sent him and began work happily taking out the weak villains targeting them at the time. He might have reflexively freaked out when the swarm had surrounded him with their combat red eyes before he realized that he was an active operator and not training against the hoard then he allowed a manic grin to take over his face and he cackled with glee every time he sent one of Izuku’s precious little murder babies to fuck up a lame wannabe villain. After taking care of all the villains in the fire zone he’d been sent to he’d lead his team through the other zones, having a bot or two escort his classmates out as he found them. It was a little annoying having to shake the red-haired idiot but after coming across the invisible one who said she'd hurt her ankle Katsuki was able to get the red head to help her to the exit, he conveniently didn’t mention that the bots could have easily carried her out.\nThe snort and light shaking of Katsuki’s shoulders had Izuku’s sobs slowing down as he looked at him curiously, hiccupping all the while. Katsuki takes the chance to pull the mask off of Izuku and makes a face at the snot smeared on the inside of it. Seeing the curious gaze pointed at him Katsuki rolls his eyes, tightens his arms holding Izuku to him and explains how much fun he’d had fighting with the bots.\n“When did you learn to use my gear, Izu? I didn’t know you could do that.” Having said that the images of Izuku, wild eyed and covered in the blood of their enemies wearing his gear, smelling like him, artfully wielding his power and easily incorporating it into Izuku’s unique fighting style, makes something hot settle in his lower stomach and his face starts to burn. He has to shift Izuku in his lap a little to avoid any further embarrassment but he lets the pride he feels continue to swell in his chest.\n“Easy Kacchan, I’ve known you for longer than I can remember. If there’s anyone in the world that knows your quirk inside and out just as well as you do, it’s going to be me. And since I know you, know your quirk and built your gear for you I know how they work. It was a little rough in the beginning since I have them calibrated for you so I had to consciously shift a lot of my weight around and calculate the differences in our frames for power output.”\nKatsuki is no less impressed with his nerd knowing that now. If anything it makes him even crazier for him. Before he can muster the courage to do something embarrassingly soft surrounded by the unconscious bodies of villains his eyes catch the awkward form of his classmate, sitting on the floor with a large tear in his shirt and staring intently at his Izuku. And Katsuki doesn’t like that one bit, he growls low in his throat tightens his arms again and sets his chin on top of Izuku’s head he tucks him close to his chest as he sends a glare at the half and half asshole.\nUndeterred the boy just slowly gets up and picks his way over to them, Katsuki decides that it would be undignified of him to butt scooch backwards away from the idiot approaching them and instead stays where he is, content enough to curse him out if he tries anything. He really, really does not like the open admiration he can see in his eyes as he still hasn’t taken them off of Izuku. Izuku having finally picked up on Katsuki’s behaviour turns his head, glare in place as he expects to maybe see another villain waking up or something similar so he is surprised to see it’s just one of Katsuki’s classmates who oddly enough is staring at him with eyes he swears he’s seen somewhere. Izuku blinks in confusion and tilts his head at him, trying to place him in his memory.\n“It is you… Green Bean.”\nUnder him he can feel Katsuki tense.\n“WHAT DID YOU JUST CALL MY NERD HALF AND HALF!? DO YOU WANNA DIE RIGHT NOW?!!” Izuku just stares intently at the boy while Katsuki continues to shout at him.\nA sudden memory comes to Izuku’s mind of a little red and white split-haired boy peeking into the tatami room of a traditional Japanese house where Izuku sits at the side of his Papa who had taken him along on a quirk meeting someone important had requested of the world-renowned quirk specialist. He remembers the older boy they were there to help sitting with healing fingers wrapped in bandages next to … someone big with fiery red hair and a nice lady with the prettiest snow-white hair he’d ever seen. Recalls that it was him who had suggested to his Papa that maybe the boy should try making his fire cold instead of hot if it was burning him to use it. The older boy had jumped at the sound of his voice before cautiously bringing his uninjured hand up to his face and his blue eyes had squinted in concentration before a bright white flame flickered to life in his palms. He remembers the wonder and awe with which the boy had stared at his hand engulfed in freezing cold flames with no signs of injury appearing on him before his eyes had snapped to him and the excited grin that stretched across his mouth as he began to giggle in delirious happiness of finding a way to use his quirk without hurting himself. He can almost feel the way Papa had ruffled his hair in pride as he congratulated him on his first quirk consultation, the sound of Hisashi’s affection for him clear in the way he’d called him a smart little Green Bean. He remembers the excitement of writing down his observations and suggestions in his wobbly 4-year-old handwriting in the special notebook his Papa had bought him for the day’s quirk study while Hisashi lead the boy through hours of activities to test out his freezing flames. When they were set to leave Izuku had handed the boy his nearly full notebook and the boy had thanked him and told him to wait while he disappeared for a moment where Izuku had once again spotted the red and white boy spying on him from around the corner, Izuku had been about to call out to him when the older boy came back. The older had apologized for his baby brother “Shou” as he shoved his hand forward and deposited a small wad of crisp bills into Izuku’s pudgy little hands who blinked in surprised at him. The boy explained to him with pink on his face that it was payment for the notebook as his father had told him that they pay the people that help them and it was especially expensive when it’s done at home instead of an office. Izuku can’t remember the boy’s name, only that he’d taken to calling him nii-san as the day progressed and the ice cream he’d taken Katsuki for with some of his earnings after his Papa had taken most of the stack of bills and put it safely away into his piggy bank for him.\nBlinking out of the memory Izuku makes a note to check his dusty piggy bank when he gets home. But before that he has something to test. He squints his eyes and looks closer at the boy’s face but really the hair is enough of a confirmation for him, not many people have such unique hair. So he cautiously sounds out the name and waits for a reaction.\n“…Shou?” The pleased way the boy lights up and has an odd half blush on his face really makes Katsuki lose it as he quickly stands with Izuku still in his arms and turns to sprint away. Izuku gets bounced around but watches curiously as the boy gives chase and can feel the growl Katsuki lets out as he also spots their pursuer. Izuku feels a grin stretch across his face at Katsuki’s deviously amused order to the bots still under his command.\n“Mizuno! Evacuation order for the half and half bastard behind us!” The happy chirp is heard before the boy confusedly tries to reject the help from the large bot and Katsuki cackles while Izuku just tucks his head into his neck and allows himself to go limp in the strong hold of Katsuki. He can feel a short kiss being pressed into his curls and before he can lift his head to return the peck on Katsuki’s forehead that he’ll pretend to be annoyed with Izuku is interrupted by the loud growl of his stomach. Katsuki pauses his stride and looks at Izuku, mouth opening to ask if that was him when another thunderous roar emits from Izuku.\nCheeks pink Izuku just grins at Katsuki.\n“Ah. We missed lunch, Kacchan!”\nKatsuki just sighs in defeat."
}