{
    "id": "29496663",
    "url": "https://archiveofourown.org/works/29496663?view_full_work=true",
    "author": [
        "magneticwave"
    ],
    "title": "staring down the barrel of the hot sun",
    "rating": "General Audiences",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Star Wars - All Media Types",
        "The Mandalorian (TV)"
    ],
    "relationships": [
        "Din Djarin/Luke Skywalker"
    ],
    "characters": [
        "Luke Skywalker",
        "Din Djarin",
        "Grogu | Baby Yoda",
        "Obi-Wan Kenobi",
        "Mace Windu",
        "Bo-Katan Kryze",
        "Korkie Kryze"
    ],
    "additional_tags": [
        "Alternate Universe - Canon Divergence"
    ],
    "language": "English",
    "series": "",
    "published": "2021-02-16",
    "completed": null,
    "words": "25,754",
    "chapters": "1/1",
    "comments": "537",
    "kudos": "9,006",
    "bookmarks": "2,929",
    "hits": "76,632",
    "summary": "<p>“Gone to a Child of the Watch, the Darksaber has,” Grand Master Yoda announces in his creaky little voice. “Peace, there is not, and yet peace, there must be.”</p>",
    "notes": "<p>Republic survives AU! I imagine Mace Windu looked extremely fucking badass when he beheaded Palpatine twenty-eight years prior to the beginning of this fic.</p>",
    "text": "Luke barely has enough time to stagger to his rooms, wash his face, and strip off his filthy robes before his comlink chimes-- The presence of Knight Skywalker is requested immediately by the Jedi High Council , because of course it is, of course Luke can’t have five minutes to himself to wash the blood out of his--and Luke sighs and releases his frustration into the Force, where it swirls around him like little gnats before being swept away. \nHe’s bowing to the Council three minutes later, hair damp at the temples, skin of his back itching under drying bacta. He rolls his shoulders as he straightens, one at a time, and all that does is hurt. He hadn’t realized the burn on his shoulder was quite so bad--it was hard to notice it at all, frankly, what with the shards of durasteel he’d had to dig out of his back--until two minutes ago when he’d gone to slap a bandage on it and hadn’t had enough gauze in his fresher. He’d just thrown a tunic on and decided to deal with the consequences later.\nThere’s not much time for Luke to contemplate the misery waiting for him when he has to take his tunic off because the Council, with zero pleasantries, gets to the point immediately. “Gone to a Child of the Watch, the Darksaber has,” Grand Master Yoda announces in his creaky little voice. “Peace, there is not, and yet peace, there must be.”\nLuke, perplexed, stares at him for what feels like probably an embarrassing amount of time.\n“We’re sending you to Mandalore,” Master Tano clarifies. “To broker a peaceful transition of power.”\n“Me?” Luke echoes, looking across the weathered, troubled faces of the Council. “Uh,” he continues, when all he gets back a narrow-eyed stare from the Grand Master, “that is--brokering negotiations isn’t really my, uh--” and then he trails off, because what Luke’s inability to conduct basic diplomacy is is a personal failing that has haunted him since he first became a padawan, nearly twenty years ago.\n“I’m coming with you, Luke,” Master Kenobi says, taking pity on Luke after only a few seconds of awkward silence. “Although I have not met the new Mand’alor, I am familiar with the political situation there.”\nLuke does not ask,  then why in kriffing hell are you also sending me , but the thought must make its way to his face because Master Secura lifts a hand to her mouth in what is clearly an attempt to hide a smile. “Mandalorians can be difficult,” she says. “We have found over the years that they respond best to the presence of our more formidable Knights.”\n“And it’s been a few years since I last dazzled an audience with my lightsaber technique,” Master Kenobi adds drily. Although he’s hardly as ancient as Grand Master Yoda, who looks more shriveled by the hour these days, Master Kenobi is old for a human Jedi. That bit about his Soresu is a load of bantha shit, all the same--Luke’s seen him fight as recently as two years ago and he’d dismantled an entire battalion of Separatist-era battle droids almost single-handedly. \nBut it is true that Luke has a reputation for violence that is rare amongst Jedi. When he’d fought the last known living Sith last year, Luke hadn’t stopped to ask  what if someone records this and puts it on the holonet  because he’d been too busy trying not to die or let his sister and her diplomatic attachés be murdered. But the footage had been literally everywhere for months and he’s still feeling its aftershocks reverberating through his life. The Council had suggested that Luke maybe stop interviewing padawan candidates for the time being. There had been a Senate hearing, which had been excruciating for many reasons, not the least of which being that Luke’s mother is the kriffing Supreme Chancellor and his sister is the junior senator from Naboo.\nIt’s hard to blame the Council, really. Too many decades of hard work have gone into restoring the Jedi Order’s reputation as peacemakers and diplomats to have it all fall apart just because Luke keeps accidentally stumbling across angry Darksiders and violent leaders of organized crime syndicates during otherwise routine missions.\nNonetheless, Luke lets himself feel a bare second of irritation before exhaling, quietly, and releasing it into the Force.  There is no chaos, there is harmony , he reminds himself. It’s the part of the Jedi Code that he has always struggled with the most; Luke often seems to cause chaos just by existing. \n“Right, okay,” Luke says.  Harmony, harmony, harmony . “When do we leave, Master?”\n~\nAfter the Council releases him, Luke takes a speeder over to Leia’s apartment. She’s lived for the last few years on the top floor of a squat little duracrete antique within spitting distance of the much more luxurious high-rise where their parents have an apartment. Leia had denied its selection as any kind of political statement but the holonet had been full of breathless headlines for weeks afterwards: CHANCELLOR AMIDALA’S DAUGHTER REJECTS LUXURY FOR EGALITARIAN EXISTENCE, the usual ignorant bantha shit about how Leia’s upbringing in the Jedi Order had taught her to eschew material concerns, which was the kind of thing only somebody who’d never seen her hairpin collection would say. \nAs he’s parking his speeder on the roof, Luke sends an inquiring tendril down to Leia’s apartment, just to be polite. There are two familiar Force signatures inside, one so bright and dear to Luke that it’s like looking in a mirror, the other a pinprick of sullen, resentful competence. It’s been ten years and Han still acts like being Force-sensitive is a communicable illness. “I thought Han was off-world?” Luke says when Leia answers the door.\n“He just got back,” Leia tells him sourly.\n“If I’d known this was the kind of reception I’d get, I’d’ve stayed where I was actually wanted!” Han hollers from deeper in the apartment.\nLuke shrugs off his cloak and hangs it on one of the hooks by the door. “Deal gone bad?” he asks Leia in a low undertone as she slams the door shut.\n“I can’t be implicated if I don’t know the details,” Leia says, which is both a lie and a slanderous interpretation of her own character. She looks exhausted; there are deep circles under her eyes and her hair, although neatly braided up and around her head, looks less shiny than usual. “Where’s Ben?”\n“He was already asleep when I got away from the Council,” Luke says apologetically. “He’s still got that cold--the crèchemaster said he slept most of the day. It seemed better to leave him.”\nLeia looks even more haggard for a long moment and then she shakes her shoulders back and straightens up, that characteristic Senator Skywalker gleam coming back into her eye. “That was the right decision,” she says. “Thanks for checking on him. I’ll go by the Temple tomorrow and see how he’s feeling.” She goes to pull Luke in for a hug and then pauses, her hands extended towards his shoulder. “What happened to  you ?”\n“Explosives,” Luke says shortly. “The bacta will sort it out eventually. Come on, then,” and he snatches her for a quick hug, trying to ignore the way the movement pulls painfully at something deep in his back. “How’s my favorite sister doing, then?”\n“Run off my feet but fine otherwise,” Leia says. She settles for hugging his head instead of his torso, clearly able to tell that Luke’s too battered for much else. “You usually only come by when you’re headed off-world--don’t tell me they’re sending you out again?”\n“That’s sounding a little judgemental coming from the worst workaholic I know,” Luke points out, releasing her before his shoulder really begins screaming. He takes a second to focus on his physical pain and then drops it into the Force--and good riddance, too. It’s not a sustainable solution but it’ll keep him upright until he can spare a few hours for a healing trance.\n“I’m the only one allowed to bully you, you know that,” Leia says, frowning up at him. “Weren’t you escorting an AgriCorps relief freighter to Jakku? Why were there explosives?”\n“At least give the man some food before interrogating him, princess,” Han shouts from the kitchen.\nLeia has a good point, of course. Escorting AgriCorps relief freighters to ravaged planets is an extremely commonplace assignment for Jedi Knights and it’s only ever a little bit dangerous. Most of the other Knights view escort duty as a kind of sabbatical. It’s probably not surprising that  Luke  always manages to land the AgriCorps assignments that are disasters waiting to happen. This time it had been raiders interested in the energy cell for the freighter’s hydroponics system, but last time it had been bounty hunters--apparently AgriCorps specialists are a hot commodity in the Outer Rim slave markets, being both Force-sensitive and great at growing food on desert planets--and the time before that it had been a Darksider in the wrong place at the wrong time who’d clearly been itching to fight somebody in Jedi robes.\n“You didn’t cook, did you?” Luke asks her.\nLeia gives him a dirty look. “We ordered in,” she says.\n“You’re welcome!” Han yells.\n~\nWaking up in hyperspace is always a little bit of a rude shock for Luke. It takes him a few seconds to get his bearings as his sleepy, instinctual interrogation of the Force flails around trying to find another life form--for a long, dragging breath it’s as though he’s back on the AgriCorps freighter just as the hull had ruptured, the chilly hand of the vacuum of space reaching for him--and then he inhales, centers himself, and feels Master Kenobi’s unassuming signature in the cockpit of their ship.\n“Morning, Master,” Luke says as he climbs into the cockpit. He’s juggling two cups of caf and a datapad with as much information on the Children of the Watch as the Chief Librarian could chase down in a few hours. Which is to say: next to nothing. \n“Good morning, Luke,” Master Kenobi says, accepting the cup of caf that Luke offers as he drops into the co-pilot’s seat.\nNothing in his expression or presence in the Force betrays his disgust, but Luke knows it’s still there. “I’ll work on the kettle today,” he says in lieu of an actual apology, which he knows Master Kenobi would refuse to accept.\n“I appreciate your concern, Luke, but despite what the Temple rumor mill might suggest, I do not subsist solely on tea,” Master Kenobi says.\n“It’s no problem, Master,” Luke tells him, downing a hurried gulp of caf and then just as hurriedly releasing the pain of his burned tongue into the Force. “It’s not like there’s a lot else to fill my time. Is this really all that the Chief Librarian could find?” He uses his thumb to page through the datapad’s directory index. Two texts on religious cults from a specialist at the University of Sundari, a handful of articles from back-issues of  The Keldabe Review , and extremely grainy cam footage of the fight that had lost Bo-Katan Kryze the Darksaber. “Who recorded the footage?”\n“It’s unclear,” Master Kenobi replies, staring thoughtfully down into his cup of caf. “It’s possible that the whole stunt was part of a premeditated grab for power. It would be rather difficult for Bo-Katan or her nephew to deny the legitimate transfer of ownership of the Darksaber with such clear evidence to the contrary.” And then, very drily: “Not, of course, that Bo-Katan would ever stoop to such dishonorable methods.”\n“You’re familiar with the Kryze clan, Master?” Luke asks. He’s heard the rumors, of course, but it’s impossible to know how accurate any of those old stories might be. He probably does not manage to sound as innocent as he wants, because Master Kenobi shoots him an eyebrow that manages to be both amused and disappointed.\n“Further grist from the mills, Knight Skywalker?” he says.\nLuke can feel himself flush. “I know it’s probably mostly gossip,” he says. “I was just wondering.”\nMaster Kenobi says, “No, I did not have a torrid affair with Duchess Satine Kryze,” so mildly that it takes Luke a second to catch on, at which point he immediately chokes on his mouthful of caf. A small smile twitches at the corner of Master Kenobi’s mouth. “The situation on Mandalore was always an untenable one, I’m afraid,” he continues, gracefully ignoring Luke’s attempt to drown in his beverage. “A detente between the various Mandalorian factions was feasible under Bo-Katan but it was always going to die with her.”\n“I know Bo-Katan’s nephew is a New Mandalorian, but is he a true pacifist?” Luke asks, unable to shake the feeling that he ought to already know the answer to this. He asks the question anyway.  Everybody looks like an idiot sometimes  , Master Windu had frequently told him during his time as a padawan.  No point in pretending dignity if it’s the difference between making the right decision or a wrong one that could get people killed . \n“Not quite as stringent as the former Duchess,” Master Kenobi says. “But he certainly isn’t a warrior, and that is what one needs to be to hold the Darksaber against challengers.”\n“I don’t understand why the New Mandalorians kept the tradition of the Darksaber,” Luke says. “Its very existence is antithesis to a peaceful transition of power. You would think they’d want to drop-kick it off a cliff somewhere.”\n“They didn’t until Bo-Katan used it,” Master Kenobi says. “Unfortunately, the Mandalorian factions could not be united without it.” He’d be the one to know; he’s taught Advanced Topics in Galactic History and Intraplanetary Negotiation for the last thirty years. “Their culture is a very old one, Luke. They take pride in it.”\n“The oldest enemy of the Jedi,” Luke quips, feeling the phantom ache of Grand Master Yoda’s gimmer stick against the backs of his calves.  Pride there is not! Only peace and submission! \nMaster Kenobi hums, not quite in agreement, and they settle into a comfortable silence as they finish their cups of caf and turn back to their briefing texts. The lights of hyperspace dance across the surface of Luke’s datapad as he tries his best to read; eventually, the hypnotic lights and the rhythmic thump of his pulse in his injured shoulder pull him back into sleep.\n~\nIt’s immediately apparent upon their arrival that no one is pleased to welcome Jedi to Mandalore. Although Luke had expected as much, he’s a little startled by the outright hostility he feels radiating from the various helmeted heads awaiting them on the landing pad jutting out from the side of Sundari’s massive dome. The air on Mandalore is dry and ravaged; it whips down Luke’s throat in the few minutes that they’re exposed and he coughs into his fist to clear out the worst of the sand as he follows Master Kenobi to their waiting hosts.\n“General Kenobi,” one of them says, with a hiss that seems not completely attributable to interference from their helmet speaker.\n“I am a general no longer,” Master Kenobi says calmly, folding his hands into the sleeves of his robes.\n“Jedi, then,” the speaker allows. “Be welcomed once more to Sundari.” It sounds like they have to eke the words out from between their teeth. \n“It’s wonderful to be back,” Master Kenobi replies.\nThey all stand there for a few seconds, Master Kenobi looking blandly helpful, the various helmeted Mandalorians feeling like they’re seething impotently at something, Luke trying not to inhale too much sand, and then the Mandalorians turn on their heels and stalk towards the entrance to the dome. “You must be presented to the Mand’alor,” the same speaker throws over their shoulder.\n“Of course,” Master Kenobi says mildly.\nInside of the dome, Sundari looks sort of like a miniaturized Coruscant, with tall buildings all jostled in together and speeder traffic threaded amongst them. Luke can sense that not all of the life inside of the dome is sentient; there are trees and shrubs growing off of the sides of the buildings, reaching for the artificial sunlight. Something is in flowering season, dusting the air with clouds of pale pink pollen.\n“Come along, Luke,” Master Kenobi chides when Luke falls too far behind the not-so-welcoming welcome committee, the members of which are using narrow walkways to make their speedy way across the upper level. They’re making a beeline for the most impressive structure of the bunch, which looks like a huge transparisteel box nestled at the very center of the city.\nPerhaps what is most striking about Sundari is how very normal it seems. Luke has not met very many Mandalorians, mostly ex-troopers and bounty hunters, but he wouldn’t term any of them  normal . It’s impossible for him to imagine Boba Fett frollicking in a public park, for example, like the people Luke can just make out on top of a nearby mid-height building. There are children screaming with bright laughter as they chase each other into and out of shrubs and fountains. Luke can feel his shoulder, still a little tight with pain and new scar tissue, loosen at the familiar sound of shrieks echoing off of burbling water.\nLuke and Master Kenobi are not welcomed to the palace of the Mand’alor with very much fanfare. They’re ushered in a side door and then through a series of rooms, including a cavernous and empty one that has a very large chair off at one end, until they’re left outside of a set of double doors being monitored by a pair of protocol droids that nervously disappear inside. After a few minutes one of them reappears and says, “You are made quite welcome, good sirs, and encouraged to introduce yourselves posthaste,” making a repeated beckoning motion with one of its arms.\nInside is a conference room containing two helmeted Mandalorians in very, very imposing armor, a redheaded woman whose helmet is tucked under her arm, and two people who aren’t wearing armor at all. One of them is a man who looks, frankly, alarmingly like Master Kenobi.\nThere’s a beat of silence before the woman holding her helmet under her arm says, with a flicker of clear frustration, “Of course they sent  you .”\n“It’s always a pleasure to visit Mandalore,” Master Kenobi says, bowing to her. “It’s good to see you again, Bo-Katan.”\n“I requested Ahsoka Tano,” says the man who looks like Master Kenobi. He must be Korkie Kryze.\n“She sends her regrets,” Master Kenobi murmurs. “Urgent Council business has required her presence elsewhere.” By which he means: general Council policy is not to acknowledge requests for specific individuals.  They’ll get who they get and be grateful for it , Master Windu had once bellowed during a Council holocall in a rare display of true temper; rich, entitled Core Worlds never failed to get his back up. Mandalore is pretty far from being rich, entitled, or the Core but Korkie has a look about him that just screams aristocrat.\nAfter a tense few seconds Bo-Katan turns to the man at the head of the conference table. He stands with his arms folded against his chest and his legs spread, as though he is braced for blaster fire to start at any moment. Bo-Katan says, “This is General Obi-Wan Kenobi.”\n“I am a general no longer,” Master Kenobi demures, with his apparently bottomless well of patience. “Thank you for the invitation, Mand’alor,” he continues, followed by something in Mando’a that Luke--mostly fluent in curses--can’t quite follow. Something about welcoming the opportunity to be a guest.\nBo-Katan’s hard eyes flick from Master Kenobi over to Luke. There’s a moment of recognition swiftly followed by confusion that is very, very familiar to Luke--Luke has mentally designated the latter the  wait he’s too short  pause--and then she shakes it off and turns to Master Kenobi, demanding, “Who accompanies you?”\n“Jedi Knight Luke Skywalker,” Master Kenobi says. He and Luke bow in unison to the Mand’alor. He isn’t the tallest man in the room, nor the most physically imposing, but his armor is almost unbelievably shiny and it’s strangely threatening. After a few seconds’ contemplation, Luke realizes why: it’s made of pure beskar. It exists in the Force as something that is almost perpendicular to life.\n“Jedi,” the Mand’alor says after a long few seconds. He has an unexpectedly soft voice. “The Kryze clan says you are mediators.”\n“We often serve as such,” Master Kenobi allows.\n“Great,” the Mand’alor says. “Then you can mediate them into taking this kriffing saber back.”\n~\nIt takes a while for the shouting to die down. There’s a lot of chaos--Bo-Katan slamming her helmet onto the table, yelling about tradition, Korkie loudly saying something also about tradition that sounds like he nonetheless is disagreeing with Bo-Katan, the protocol droids hurriedly circling the room, trying to calm everyone down--as the Mand’alor sighs in a long crackle of static, his helmet drooping. The other Mandalorian in full armor, the one with the fur cloak, says something that does not quite make it to Luke’s ears, murmur murmur  the way . And there, in the middle: Master Kenobi. A tendril of satisfied anticipation curls out of him before being swept away into the Force. In this moment, he reminds Luke of no one so much as Leia, who always treats the seconds before she launches herself into an argument like she’s savoring the opening moves of a saber bout. Even if Luke had been extremely jealous in a way unbecoming of a Jedi when Master Kenobi had asked Leia to be his padawan, he can acknowledge now that they were a very good match.\nLuke has only just settled out of the way in a corner where he can come to Master Kenobi’s aid if so required when the other Mandalorian without armor sidles over to his side. “Skywalker?” he says, intonation clearly making it an inquiry. “I thought Jedi weren’t allowed to have children.”\n I thought politicians weren’t allowed to ask rude questions , Luke thinks. “Was that question?” he says instead.\nBoth eyebrows go up. “So you’re  not  the kid of the Hero With No Fear?” The New Mandalorian feels a horrible swirl of aggression and excitement as he asks this; it’s impossible to tell if he’s angry at Anakin Skywalker or hungry for information about a personal hero. Perhaps it’s both. Luke’s father had killed a lot of people during the Clone Wars. Everyone has complicated feelings about him.\nThis is not the first time somebody has tried to pump Luke for information about his father. Luke’s standard policy is to give the most useless answers possible; a polite  yes  or  no , interspersed with the default Jedi hum of acknowledgement, which they didn’t teach you as a youngling but everybody picked up from their master eventually.\nLuke dusts off his hum of acknowledgement and folds his hands into the sleeves of his robe, eyes moving pointedly towards the knot of people yelling at each other across the conference table.\n“If you don’t want to invite the comparison, you should try not dressing like him,” the man suggests, some kind of sharp emotion jabbing out of him.\nLuke makes his hum of acknowledgement go up in pitch at the end:  oh, really? \nThe man is recalled to the table by Korkie before he has a chance to try a different tactic, although there’s a gleam to his eyes that suggests he’ll be revisiting this line of inquiry at another time. He’s welcome to try, but Luke had once spent three days suspended by his ankles over a rancor pit while various Hutts poked him with vibrospears and he hadn’t told them anything about his father, so somehow he doubts a New Mandalorian pacifist is going to accomplish much.\n~\nLuke and Master Kenobi share a quiet meal in their quarters that evening. They’ve been tucked away in a suite with tall transparisteel windows looking out over the city. The artificial sun is beginning to dim and it’s difficult to make out the walls of the dome in the gloom. “New Mandalorians and most of the martial traditionalists will share meals with guests,” Master Kenobi tells Luke over their plates of curried qana beans and stewed Mandalorian oranges, “but the Children of the Watch do not.”\n“The helmet thing?” Luke asks, stuffing a spoonful of stewed oranges into his mouth. Master Kenobi, as is his wont, is picking at his qana beans but not really eating anything. When they were thirteen, only a few years into their time as padawans, Leia had told Luke that she was pretty sure her master got all of his calories from tea.  Does Master Windu eat?  she’d asked Luke.  I think my master gets all of his calories from eating his emotions , he’d told her.\n“Indeed,” Master Kenobi says. “Their doctrine requires their face go unobserved by any other living creature, although it seems that exceptions may be made for close family members--spouses, children.” He gives Luke a very dry look. “Casual lovers do not merit the privilege.”\nLuke feels the tip of his ears go red. “Is that a warning, Master?”\n“Simply some advice,” Master Kenobi says mildly.\n“Now who’s listening too much to the Temple rumor mill?” Luke says. He’s taken lovers, of course, and had gotten the occasional condescending eyebrow from Master Windu about it along with one very embarrassing conversation during a mission on Tatooine when he was nineteen about properly shielding a master-padawan training bond when otherwise distracted, but never anything for which he’d needed to be reprimanded.\n“Well, we old masters have to live vicariously through the adventures of spry young knights,” Master Kenobi says. \nLuke rolls his eyes. “Even if that wasn’t a load of bantha shit, you should just watch a holodrama or something. Leia made me watch an episode of this new one when I went over to have dinner with her and Han before we left--it’s about a MediCorps team stationed in Wild Space who’re all sleeping with each other and having screaming arguments in between ridiculous medical procedures.”\nMaster Kenobi says, mouth pursed, “How very thrilling.”\n“Well, if you’ve never actually been in a bacta tank or met a Jedi it’s probably entertaining enough,” Luke says. “Han claimed to hate it but he had pretty strong feelings about why one of the MediCorps Jedi ought to leave her current girlfriend for the knight that had rejected her as a padawan--” and then, to Master Kenobi’s moue of distaste, “--yeah, I know, but it’s not like the girlfriend was much better, to be honest with you.”\n“No one has ever claimed your brother-in-law has particularly good taste,” Master Kenobi says.\n“Ouch!” Luke grins at him. “Don’t say that too loud, Leia might hear.”\n“How did you find your sister?” Master Kenobi asks, and somehow Luke suspects that at least part of this conversation had been engineered to lead them around to this point. Luke doesn’t pretend to completely understand the relationship a master and padawan develop when the padawan decides not to undertake their Trials and instead goes and becomes the true nemesis of the Jedi Order--which is to say: a politician--but he’s always thought that Master Kenobi and Leia handled it surprisingly well.\n“Tired,” Luke says, deciding after a long second’s contemplation that it’s probably for the best just to be honest. “I’m not really following this session of the Senate but I think some of her projects aren’t doing well. Han’s being--you know. Han. And Ben’s been sick on and off for months now, so she’s worried.”\nMaster Kenobi trots out the standard little lecture about how the illnesses of the crèche are good for a youngling’s immune system, familiar to Luke as old boots after Ben’s myriad ear infections, and then he stirs his cooling qana beans for a few seconds and continues, voice still even and friendly, “Anakin mentioned that Leia seemed a little careworn, the last time they were able to speak.”\n“I’m not getting involved,” Luke says immediately.\n“I wasn’t asking you to,” Master Kenobi says, like a liar.\n“Dad and Leia will figure it out,” Luke says. “I’m not getting involved. I got involved once and neither of them spoke to me for ten weeks.”\n“No one has asked that you involve yourself, Luke,” Master Kenoi says.\n“I don’t know why they’re fighting, and I don’t want to know,” Luke says. “Go pump someone else for information. Han probably knows. Mom  definitely  knows.”\n“I simply wondered if your sister had shared her concerns with you,” Master Kenobi says, soothing and full of shit.\nLuke says, “She hasn’t,” and stuffs a huge spoonful of stewed oranges into his mouth so he’s physically incapable of responding to any more inquiries. Master Kenobi had basically raised Luke’s father and Leia had been his padawan for twelve years; you’d think he’d know better, by now. If they want to fight, nothing in the galaxy can stop them from doing so.\n“You’re lucky you inherited your mother’s temper, Luke,” Master Kenobi says.\n“Yeph,” Luke agrees around his mouthful of orange gruel.\n~\nLuke always wakes with the sun; it happens on planets that orbit more than one star, like Tatooine, and it proves true even in a city under a dome with zero exposure to sunlight. Master Windu, who had not been fond of mornings, had once irritably told Luke that it was possible to listen  too  well to the will of the Force and perhaps Luke ought to meditate on the subject for another two hours. \nDespite his master’s grumblings, Luke has always found it hard to sleep past the moment when the sun rises on a planet. He feels solar light as a kind of hot, questing touch and its curiosity and interest are difficult to ignore. \nHe doesn’t bother, that first full day in Sundari. He rolls out of bed, washes his face in the extremely fancy fresher, and goes to find somewhere he can practice his saber forms. There’s not much in the way of open space in the palace itself, which seems entirely composed of conference rooms, but Luke follows the winding path from the day before to the side-door leading outside and wanders around the upper-level walkways until he finds an empty little park on top of what feels like an apartment building.\nLuke doesn’t realize he has an audience until nearly two hours have passed. Although he is principally a user of the sixth form, he’d spent most of his adolescence being brutally beaten into the ground by Master Windu’s Vaapad exercises and he still finds them useful when he’s cut adrift in his own emotions. The sixth form is a practical choice for a Jedi Knight like Luke, who has more Force sensitivity than he necessarily knows what to do with and often ends up in scrapes where intuition and creativity are his best hope of getting out alive, but that doesn’t make it particularly suited for fostering mindfulness.\nThe counterpoint to which is, of course, that immersing oneself in a form like Vaapad can result in complete lack of awareness of one’s surroundings. Luke finishes his final exercise and sends a tendril of Force awareness back towards the palace, trying to determine if Master Kenobi is awake yet, and he’s immediately distracted by a much closer presence he recognizes: that perpendicular slide, like the Force is reflecting off of itself.\n“Mand’alor,” Luke says on a choked gasp, half-turning towards the presence. The Mand’alor’s arms are crossed, hand within half a second’s reach of the blaster at his hip. He’s standing between Luke and the fountain at the middle of the green; the artificial light of Sundari’s false sun is mostly behind him, creating a strange halo around his beskar armor. “Er. Good morning.” Luke thumbs off his lightsaber and clips it to his belt. He looks around, suddenly worried that he’s somewhere he ought not to be. The little park appears to still be mostly empty, but maybe the ferocity of Vaapad in action had scared off its normal denizens. “I’m not in the way--?”\n“Little late to worry about that,” the Mand’alor says. And then, perhaps in response to Luke’s guilty flush, he adds, “Probably not, anyway.”\n“Oh,” Luke says lamely. “Okay, great. I’m glad.”\nThere’s a long silence. Something in the Mand’alor’s bearing suggests that he’d be completely comfortable never speaking. Luke has, unfortunately, never been that kind of person. “Are you interested in saber forms?”\nThe Mand’alor’s helmet tilts a little to the side. “You offering?” he finally says.\n“Oh, I’m not--I’m just a knight,” Luke explains. Why is he so flustered? “I haven’t trained anyone. But, uh, Master Kenobi trained my sister. He’s considered one of the greatest living practitioners of the third form.”\nThe Mand’alor says, “Is that what you were doing?”\nLuke licks his lips. He’s starting to feel the physical effects of spending two hours with the seventh form--dehydration, muscle exhaustion--his kriffing shoulder --\n“That’s a variant of the seventh,” he says, rolling his shoulder. It feels like his shirt is stuck to his skin; he must not have applied a large enough bandage. “I don’t mean to be offensive, but, uh, it’s not usually taught to people that aren’t Jedi. It’s considered pretty dangerous.”\n“Looked fancy,” the Mand’alor says, with just a faint hint of disapproving dismissal. He might as well have said,  pretty with no substance .\nWithout quite meaning to, Luke lets out a bark of laughter. “Fancy is one way of describing it,” he says. It had been fancy enough to take Darth Sidious’ head off, for sure.\n“These--forms,” the Mand’alor says, slowly, like he’s feeling the word out for its proper use. “This is the way of the Jedi? To follow a form?” He gives an unfamiliar gravity to a term that Luke has used, carelessly, for his entire life.\nResponding to something in the Mand’alor’s voice, Luke contemplates his answer for a few seconds. His instinct is to say no, but-- “Sort of,” he finally says. “It’s generally better if the form fits your temperament. Soresu, the third form, is kind of the embodiment of patience. That works for some Jedi more than others.” The ‘some’ being Master Kenobi and the ‘others’ being basically every Jedi under the age of thirty. “My sister preferred Djem So, which is basically just hitting something until it falls over.”\n“Are the children of the Jedi tested for these forms?” the Mand’alor asks, with strange urgency.\n“What?” Luke says, perplexed. “No? It’s not--forms aren’t personality assessments, they’re just styles. Mandalorians don’t all fight the same way, do they? You have--snipers, or hand-to-hand experts or--” and here Luke flounders, because what would he term Boba Fett an expert in, other than being extremely irritating? Force, his shoulder really is killing him.\nThe Mand’alor leans back, as though Luke has said something that has taken him off of his guard. “I see,” he murmurs. And then, with a little hissed fizz of static, he says, “You’re bleeding.”\n“Huh?” Luke bleats, like the dashing young Jedi Knight that he is, and then he looks down and realizes that he is, in fact, bleeding. Impossible to tell against the dark fabric of his shirt, but he’d unbuttoned the collar to cool himself and there’s blood smeared over his shoulder and along his collarbone. “Aw, hell,” he mutters. This is why he always wears black.\n“Did a Mandalorian do that?” the Mand’alor asks harshly.\n“No,” Luke tells him, twisting around and trying to get a hand on the bacta patch that he’s now realizing must have slid out of place. “I was on a freighter that was blown up a few days ago.” He catches the corner of the bacta patch and pulls it out of the collar of his shirt. Judging by the hot, slimy feeling he smears more blood up the side of his neck in the process. \nAlmost as though he can tell that Luke is engaging in conduct unbecoming of a Jedi, Master Kenobi reaches out a very fine, polite tendril of awareness--is Luke available for breakfast? “I should replace this. Anyway, it was, uh, nice to see you, sir. Mand’alor.” Luke crumples up the bacta patch in his gloved hand and gives a hurried bow as he leaves the little park. The Mand’alor remains a still, steady presence at his back long after Luke returns to the palace.\n~\nThirty minutes into the morning’s negotiations a very cold silence descends on the conference room, precipitated by Master Kenobi’s benignly murmured,  Mand’alor, if you would describe the circumstances leading up to your duel with Bo-Katan?  Both Bo-Katan and the Mand’alor are radiating unsubtle menace into the Force. Master Kenobi is sipping from a cup of steaming Sauweceran tea that one of the protocol droids had fussily prepared for him. \nAfter nearly a full minute, the Mand’alor says, “She took the child.” Luke can’t help stiffening, instinctually. The Mand’alor says  the  but his presence in the Force is a loud, resonant  my  --  she took my child . \n“Ah,” Master Kenobi says.\n“It was a misunderstanding,” Bo-Katan replies through her teeth. Luke does not have to investigate her Force signature to comprehend her irritation; it’s scrawled across her face. At least Korkie, seated to her left, has the grace to look a little ashamed. “You are a bounty hunter and a Child of the Watch.”\n“To harm a child is the antithesis of the Way,” says the Mandalorian seated on the Mand’alor’s left, the one with red armor and a ruff of fur. She has a posh, almost Core accent, and the precise, steady diction of a Jedi Master of many decades. Maybe she leads the Children of the Watch? None of the resources compiled by the Chief Librarian had been able to conclusively identify who was in charge. One of the books by the University of Sundari specialist had postulated that they didn’t have a leader at all--that their teachings were individualistic, meant for self-guidance and self-discipline. The idea had intrigued Luke.\n“How was I to know that?” Bo-Katan demands. “You people maintain your ways in secret, like rawls slithering around in the darkness.”\n“To harm a child is to call yourself other, not of Mandalore,” the Mand’alor says, low and dangerous. “I would remove my armor before hurting a foundling.”\n“This is the Way,” the posh Mandalorian says, somehow managing to sound nearly as sanctimonious as Master Yoda.\n“This is the Way,” the Mand’alor echoes. He leans back in his seat with the slow, coiling motion of a cautious predator. He turns his helmet a few degrees to make it apparent that he’s shifted his attention to Master Kenobi. “I didn’t fight Bo-Katan out of desire for the saber. I just wanted the child back.”\n My  child; impossible to miss that tangle in the Mand’alor’s Force signature, all fierce love and affectionate concern jumbled up with a parent’s innate fear for their vulnerable child. Someone had tried to take Ben--just the once--when he was still too little to be given over to the crèche. Leia had snatched Ben back into her arms and then crushed the would-be kidnapper, their speeder, and a passing Rayshoian restaurant delivery droid into a ball the size of her fist in about four seconds. So, really, fighting a planet’s king and accidentally landing oneself possession of a sacred mark of leadership seems about on par with what Luke knows about how parents react to their children being in danger.\n“Is your kid okay?” Luke asks. He realizes this was a bad idea about three seconds too late to do anything about it; Bo-Katan is already swelling with offense.\n“He’s fine,” the Mand’alor says. Luke has a flash of insight, no more than a sliver of projected memory, of a child’s warm weight in his arms and its cheerful, burbling laugh.\nAcross the table, Bo-Katan shoots Luke a look that very clearly conveys that while she wouldn’t hurt a child, she’d have no issues throwing down with a twenty-eight-year-old Jedi Knight. \n“That’s good,” Luke mumbles. He can feel Master Kenobi’s exasperated affection like a breath against the side of his face and it makes him flush. Knowing that he’s a poor diplomat in the abstract is different from being reminded in situ, once again, that there’s a reason why Luke spends most of his time escorting AgriCorps freighters around the galaxy.\n~\nThe New Mandalorian obsessed with Luke’s father is offhandedly introduced over the course of the morning’s “negotiations” (yelling) as Korkie Kryze’s husband, Adarmatan. He has the somewhat pampered look of an actual trophy husband--versus Luke’s father, who isn’t allowed to wear any color other than black because he can’t be trusted to keep the grease off of his clothes--and the space between the two men feels cordial in the Force, as though they’re business partners. Arranged marriages are fairly common in political dynasties throughout the galaxy but Luke is kind of surprised to have stumbled across one on Mandalore, whose people are famous for forging deep, intimate bonds. \nThis anthropological curiosity does not make dealing with Adarmatan any easier, unfortunately. When they reconvene after a break for the midday meal, everyone settling back into their seats as annoyance swirls in the Force like colorful eddies, Adarmatan stops on his circumnavigation around the table to say, in almost an undertone, “Heard you were demonstrating lightsaber forms in Ne’tra Park this morning.”\nLuke flicks him a dismissive glance and hums in the back of his throat.\n“Did your dad teach you how to fight?” Adarmatan persists.\nLuke says, “No.”\nAlthough Bo-Katan had been very insistent that the Mand’alor ought to sit at the head of the table--Luke couldn’t help feeling, cynically, that this firm belief originated in Bo-Katan’s sense of her own importance and her status as the proper Mand’alor--Master Kenobi had gently countered that perhaps the two negotiating factions would feel more comfortable sitting across from each other. Bo-Katan had been overruled when the Mand’alor had dropped pointedly into a seat along the side of the table. He’d chosen the one next to Luke, much to the flared interest of Luke’s central nervous system. Unfortunately, his presence now does not seem to be much of a deterrent.\n“Oh, that’s right,” Adarmatan says, as though he’s only just recalled as such. “He left the Jedi, didn’t he? What’s the Hero With No Fear up to these days?” Since yesterday, he has allowed his anger to win out over admiration and his pale little moustache quivers with it.\nLuke wants very, very badly to roll his eyes. The answer to this idiot’s question is probably  helping rebuild his son-in-law’s Corellian YT-1300 light freighter  , because Luke’s father is easily bored and Han is always getting holes blasted in the side of his ship. Or it could be  playing at being a trophy husband  , because being married to the Supreme Chancellor of the Galactic Senate involves a not inconsiderable number of formal dinners and galas. Or, frankly, it could be  guest-lecturing ; Luke’s father drops in occasionally to help with the senior padawans at the Temple, stuff like how to use the Force to accomplish basic mechanical work.\n“Vision quest,” Luke says sarcastically.\nFor about half a second Adarmatan buys it, and then he seems to process Luke’s tone and gets all huffy and irritated. Luckily, though, he also seems to understand that that’s all he’s going to get from Luke and off he goes to sit by his husband. His impotent fury seethes around him in the Force, meeting Bo-Katan’s impatient annoyance and roiling into a dark cloud above Korkie’s oblivious head.\nMaster Kenobi murmurs, “My apologies, Luke. I often forget--”\n“It’s fine,” Luke interrupts quickly. He’s very conscious of the Mand’alor, sitting so close that Luke could probably touch his knee, if he was stupid enough to actually try to do so. Which: Luke is plenty dumb, but he’s not that reckless. Anyway, the Mand’alor is in quiet conversation with his posh advisor and hopefully missed Luke’s rather obvious loss of temper. “Not the first time that’s happened.”\n“Ah. Is that your usual response?” Master Kenobi asks. Although his mouth quirks into a smile, his eyes are probing.\n“‘Oh, I think he’s on Coruscant,’” Luke parrots, adopting a deliberately light, guileless tone. “‘The Senate is in session, so that’s where my mother is, you know.’” His shoulders have been pulled up near his ears and he’s reminded by a sharp twinge, deep inside muscle, that he ought not to be tensing his back at all. “Whose idea was it to give you two those stupid names, anyway?”\n“One does not control the holonet, Young Skywalker, but simply weathers its gales,” Master Kenobi says, and then he raises his voice and effortlessly calls their next negotiating session to order. On Luke’s other side, the Mand’alor leans back in his chair and rests one hand on the table. He has the coiled tension of someone who is always prepared to act, even in repose.\nLuke feels a sudden, unexpected spike of interest: what is this man like with his child? Someone with whom he can be his true self, with whom he can share his name and face. Is there a man capable of tender care inside of that impenetrable beskar husk? But that’s a disingenuous question, because the Force itself shows Luke the answer: the man is steady and deep and, in the moments he speaks of his child, almost radiant. \n Ah  , Luke realizes, almost distantly.  So I might be in real trouble .\n~\nThe first full day of negotiations does not end with any probable solution on the horizon, as far as Luke can tell. Everyone gets the chance to speak their piece, which Luke intellectually understands as a crucial first step for negotiating a lasting accord-- lance a wound and you prevent festering, padawan --but he can’t help feeling more and more tense as the day goes on and tensions ratchet higher. Master Kenobi seems pleased, though, so clearly Luke has missed something. \nOne of the protocol droids shows Luke and Master Kenobi back to their suite and Master Kenobi spares about half a second to look around their bland rooms before suggesting, “I don’t suppose you would be interested in a walk?” and Luke is very eager to agree that that sounds like a great idea.\nThey end up somewhere far from the palace, wandering along a mid-height series of walkways. Various one- and two-passenger speeders zoom overhead, cutting through the fading artificial sunlight. “Is it very different from before the war?” Luke finds himself asking Master Kenobi. \n“Which one?” Master Kenobi counters softly. “The Mandalorian Civil War had already ravaged much of the planet before I first came here. They had some peace, I think, under the Duchess, but.” He sighs. “The more years that pass, the more I recognize Darth Sidious’ foul influence on events seemingly far removed from those of the Clone Wars. I’m not sure we had ever had true peace during his lifetime.”\nYikes. “That’s pretty bleak, Master.”\n“Oh, I actually feel quite optimistic regarding the future,” Master Kenobi tells him. His face brightens with something--mischief? happiness?--and it peels some of the age off of his features. Master Kenobi might be old for a human Jedi but he’s still quite handsome, with strands of red still lingering in his hair and those cheerful blue eyes. He’s so charming even now that it’s impossible to imagine what he must have been like in his prime. Devastating, probably. “Your generation is so very bright, Luke. I can’t help but worry sometimes that we old masters were irrevocably darkened by our time at war.”\n Bright  is a familiar adjective to Luke. He’d grown up in the crèche hearing it over and over, whispered conferences when the crèchemasters thought that he and Leia were asleep--  they’re just so bright! Always said with a kind of dazed confusion. Presumably they’d had just as little of an idea of what to do with Luke’s father, the actual Chosen One, whose presence in the Force is a kind of impossible flame, but at least he’d had a helpful moniker to give them some idea of what to expect from him. Luke and Leia had come with no such user’s manual.\n“All experiences guide us deeper into the Force, don’t they, Master?” Luke points out. “Even dark ones.”\n“Hmm, I think I can hear Mace speaking to me from somewhere inside of that idea,” Master Kenobi replies. Their walkway suddenly ends, spilling them out onto a balcony clinging like a mushroom to the side of an office building, but Master Kenobi unerringly guides them inside and then out, catty-corner, to another walkway. Leia had once told Luke that Master Kenobi’s prescience often showed itself in strange ways and he’s beginning to understand what she’d meant. “I hope you do actually find his words to be true, Luke.”\nThat stings a little bit. “I learned more from Master Windu than just how to parrot back his teachings,” Luke says hotly. “He was a great master.”\n“Oh, yes, I’m absolutely sure of it,” Master Kenobi agrees, so mildly that it instantaneously extinguishes Luke’s incipient temper. “You are a credit to the Order, Luke. And not just for your skills with a saber, although they are prodigious.”\nLuke has been complimented on his saberwork for many years. It’s long since ceased to have meaning for him. “Being a Jedi is more than just saberwork,” Luke says. The weariness that this familiar line of thought pulls out of his chest is audible in his voice. “I know that I’m not--much of a diplomat, really. And peacekeeping enforced by a lightsaber is not really keeping peace at all, although I think it can be justice, sometimes.”\n Compassion, justice, peace: these are what guide us in the Force, padawan  , Master Windu had told Luke more than once.  Harmony comes from the tension between these states. \nSundari seems to be undergoing a transformation, the way all cities do on the cusp of night, as the children go to sleep and their presence in the Living Force shifts into softly curious unconsciousness. The closest Luke has ever come to experiencing something similar is when the sun sets on Lake Paonga and the water changes from transparent to opaque in a matter of seconds. \n Why don’t we meditate, together, on how chaos is the enemy of justice? The memory of his master’s deep voice daggers through his chest. Luke tries very hard to recognize the emotion that he is feeling so he might more efficiently release it into the Force, but it clings to his ribs and refuses to leave.\nThey walk in silence for a long time. Finally, as the last of the artificial sunlight fades and the glowglobes hovering above the walkways turn on, Master Kenobi offers, “He was very proud of you.”\n“I know,” Luke croaks. He could always feel when Master Windu acknowledged his strong emotions and released them into the Force; during his last few years as a padawan, Luke had felt that surge of fierce pride more than once.\nLuke hadn’t been able to really reconcile himself to the experience of losing Master Windu, not for months--not until four days ago, when those raiders greedy for a hydroponics energy cell had ripped open the hull of the AgriCorps freighter and Luke had spent an excruciating thirty-seven seconds in the vacuum of space, suddenly aware in a way he’d never been before of just how small and isolated a single life form could be when separated from the Living Force.\n No one is ever really gone, Luke .\n“I am sure Mace told you this many times, but there are so very many paths one might walk to bring balance to the Force. Most of them are unrecognizable as such until they’ve already been embarked upon.” Master Kenobi unfolds his left hand from the sleeve of his robe and strokes his beard thoughtfully. “Do you want a padawan, Luke?”\nLuke is so startled by this non sequitur that he missteps and almost plunges off the side of the walkway. “Uh!” he says, intelligently. “I mean?” And then, once he’s shaken off the worst of his confusion, “I mean, yes, I would. But I thought--you know, that I was too dangerous?”\nMaster Kenobi’s face looks drawn under the cool blue light of a nearby glow-globe. “Is this because of the Council’s advice to you last year?”\nLuke looks down at his feet, pretending that he somehow needs to watch where he’s going. “I meditated on the subject, as reprimanded,” he mumbles to his feet. “But it didn’t go anywhere productive. I really don’t know why I keep ending up in these situations--I don’t seek out Darksiders, really, I swear I don’t.”\nMaster Kenobi says, “Oh,  I  am well aware of that,” and he sounds decidedly sardonic. “It wasn’t meant as a reprimand, Luke, simply something of which it would behoove you to be aware. You most certainly are not too dangerous to train a padawan.”\n“This isn’t--to keep me from falling, is it?” Luke asks. “Like Master Tano and my father?”\nMaster Kenobi stops in the middle of the walkway. Luke only just manages to keep himself from crashing into him. “Luke!” he says, sounding honestly shocked. “No one thinks that you are in particular danger of falling to the Dark side.” Deep sincerity radiates off of him as he turns and grasps Luke by the arm. “Is this because of Maul? Luke, he would have killed you. I think I am perhaps the best authority on the subject, in fact.”\n“No, I know,” Luke backpedals, which is not quite true. There hadn’t been room for rational thought, not after Maul had cut off his hand and Luke’s animal hindbrain had recognized, in a sudden surge of horrified adrenaline, that if he didn’t end their duel as quickly as possible he was probably going to die and then who would protect Leia? She hadn’t carried a lightsaber in nearly a decade. “But it’s just--”\n“--who else would have the miserable luck of stumbling across a Sith thought long extinct? On an otherwise routine diplomatic mission meant to be nowhere near Tatooine?” Master Kenobi finishes drily.\n“Yes,” Luke says, lamely.\n“Your sister was my padawan, Luke, but I’m afraid that you received the bulk of my legacy,” Master Kenobi tells him. His eyes are very soft in the corners.\n“I don’t mind your legacy, Master,” Luke assures him. “I just--” He squeezes his eyes shut for a second. He feels completely adrift, like he had last year when he had been forced to recognize that the only way to get his sister and her staff out of Crimson Dawn’s clutches was to duel a kriffing Sith with only one kriffing hand. “I want to do good. The whole time, I try to do what I think is right, and then I’m at the end and there’s--there’s bodies, that I didn’t realize I would have to go through until I’m already past them.”\n“Did you ever speak on this with Mace?” Master Kenobi asks quietly.\nLuke laughs and then almost chokes on it. “Yes,” he admits. “He said that anyone carrying a saber has to accept that it can be used on a sentient creature.”  Feeling the weight of it isn’t the problem; it’s when it’s too light or too heavy that you need to put it down, padawan. \nEven though Luke had tried to explain--how it felt to be the scissors cutting the thread connecting a sentient being’s physical and spiritual selves--he had never been sure that his master really understood. It had taken Luke and Leia a long time to realize that the Force did not exist for them the way that it did for other members of their order. It simply was: irrevocable, endless, beautiful, loud. Like the ocean, but gravity. Like stone, but air. Luke hadn’t realized that he could actually feel the Force signature of every person on Coruscant until the first time he’d left the planet with Master Windu and been rendered completely disoriented by the jump to hyperspace. Not even their father understood, not really. He’d only been a Jedi for a decade, in the middle of a life otherwise filled by strange, horrible, wonderful things.\nLuke had grown to be very lonely when Leia had left the Order. It had only gotten worse when Master Windu died.\nSome measure of Luke’s misery must leak out of him, because Master Kenobi gently tugs him forward until he has wrapped Luke in a loose embrace. “I think you would make a very fine master, Luke,” Master Kenobi says. He smells faintly of red leaf. “If you will accept a bit of advice from an old man with a somewhat questionable track record--our padawans learn from our best and worst selves. It is impossible to hide the latter, I’m afraid, so you will have to reconcile yourself to this inevitability.” He releases Luke and moves back just far enough to nail Luke with a piercing stare. “Speaking of which, I think you had better let me take a look at that shoulder.”\n“Oh, it’s--” Luke tries.\n“It most definitely is not,” Master Kenobi interrupts, already turning on his heel, his robes flaring dramatically behind him. “Come along, Luke.”\nRather keenly aware of needing comforting, Luke follows.\n~\nLuke wakes with the sun and feels--not  better , necessarily, although his shoulder demonstrably is better, not quite so deeply painful, and Master Kenobi had been able to help with the burns enough that Luke likely won’t have to swaddle himself in bacta patches this morning. Optimistic about his course of improvement, maybe.\nHe drags himself back to Ne’tra Park and then through a few opening exercises for the sixth form, testing the range of motion of the newly healed skin of his shoulder. There is still an ache, deep inside the muscle, where the worst of the shrapnel had dug in, but it’s much more manageable. Luke’s cheerfulness at his improved physical condition wars with his mental disquiet and he doesn’t manage to engage himself more than superficially with his sixth form exercises, which means that when the Mand’alor’s signature in the Force feels stronger, suddenly, in his proximity, Luke is easily distracted.\nThere is someone with the Mand’alor; young, but very-- bright .\n“Oh,” Luke breathes.\nThe Mand’alor carries a child in his arms as he comes around the edge of the fountain in the center of the park. The child is making a soft cooing noise, his little three-fingered hand tugging at the bottom of the Mand’alor’s helmet. Luke reaches out to brush against his presence in the Force and the child makes a curious squeak of a noise and swivels around, his big eyes narrowing in on Luke.\n“Hello,” Luke says. He can hear that he’s gone soft.\n“Jedi,” the Mand’alor greets.\n“I have a name,” Luke tells him, aiming for waspish and falling somewhere much closer to fond. “It’s Luke. What’s your name?” he asks the child.\n\n Grogu! \n\n“It’s nice to meet you, Grogu,” Luke says. “You’re very--oh!” The child outstretches his hand, kind of imperiously, and there’s a sudden yank through the Force on the collar of Luke’s shirt that sends him skidding forward along the grass. “Wow, okay, a little commandeering, are we? You remind me a lot of my nephew.” He gently brushes off the beckoning touch and takes the chance to clip his lightsaber to his belt. “Can I?” he asks the Mand’alor when he’s close enough.\n“What?” the Mand’alor replies. Luke makes a scooping gesture with his hands and before he’s finished, the child is clambering out of his father’s grasp and throwing himself at Luke. “Oh,” the Mand’alor says, in a faintly perplexed fuzz of static.\n“You do, ah, know that he’s Force-sensitive, right?” Luke asks as Grogu settles into his arms and tries to stick one of his little hands up Luke’s nose.\n“The sorcery may have given it away,” the Mand’alor replies.\nLuke hides his grin, ducking down to inspect Grogu’s tiny little features. “I’ve never seen one of his kind so small,” he marvels. “No wonder Masters Yoda and Yaddle don’t tell anyone the location of their homeworld--they’d be overrun by child-snatchers.” Grogu gurgles curiously, his mind clumsily navigating around Luke’s with great interest. “I’m not sure Grogu has met very many other Force-sensitives, he seems so confused by me.”\nThe Mand’alor says nothing. When Luke looks up at him, it’s to find that impenetrable, reflective helmet pointed directly towards him. “What?” Luke asks. He can sense that the Mand’alor is feeling a number of things, all of them quite strongly. His fondness is almost bittersweet.\n“Grogu?” the Mand’alor says softly.\nLuke is very suddenly reminded that he is, on occasion, an idiot. “Jedi can share thoughts, sometimes. He showed me that his name is Grogu. He’s actually really--” Luke stumbles over the rest of his sentence when Grogu yanks at his nose again. “Ouch!” Luke informs him performatively, sending a sensation of exaggerated discomfort along in the Force. Grogu’s mouth twists in confusion and he babbles something that might be  ouch? \n“He almost feels trained,” Luke marvels, looking back up at the Mand’alor. “Did you find someone to tutor him?”\n“No, I--I found him.” The Mand’alor’s voice is still so soft, Luke can feel it melting down the back of his throat. “Someone had put a bounty on him. A doctor, working for some big-shot karkface.” The Mand’alor’s persistent air of lethality suddenly spikes from muted to aggressive. “They were doing things to him.”\nThe afterimage of a Force signature slithers from Grogu’s mind to Luke, more escaping than being willingly offered. Luke recognizes it, so acrid and harsh that it almost burns the inside of his nose, and he reflexively tightens his grip on Grogu’s wriggling body. “Maul,” he says tightly.\n“Not Maul,” the Mand’alor says. “The name was Gideon.”\n“No, I mean--that’s who trained him,” Luke explains. “Maul was a Sith apprentice, a long time ago, before his master was struck down. He spent thirty years murdering his way to the top of the Crimson Dawn syndicate and being a huge pain in the ass. I didn’t know--I mean, I never thought--Sith aren’t really known for their patience, you know? I don’t know that it ever occurred to anyone that they would try to raise a youngling to be their apprentice.” He feels incredible sorrow at the thought.  I’m sorry , he tells Grogu. The child doesn’t quite seem to know what to do with Luke’s apology.\n“What the hell is a Sith?” the Mand’alor demands.\n“They’re the ancient enemy of the Jedi,” Luke replies, by rote because he’s distracted again by Grogu’s huge, shining eyes. They’re like tiny galaxies. “They seek out darkness and sow chaos. The would-be Emperor Palpatine was a Sith, that’s why he engineered the Clone Wars.”\n“Someone  engineered  the  Clone Wars ?” the Mand’alor repeats.\n“Yes?” Luke says. “The Sith.”\n“Dank farrik,” the Mand’alor mutters.\nGrogu, seemingly able to intuit that his father is in need of comfort, twists around in Luke’s arms and gestures to his father with an inquiring little noise. The Mand’alor responds automatically, stepping forward and reaching into the cradle of Luke’s arms to embrace his son. He’s so close, his helmet bent down solicitously, the rattling hum of his filtered breath suddenly so loud--Luke feels heat flare throughout his body, in his stomach, along the fronts of his thighs, up his back. For-- kriffing hell .\nThe Mand’alor holds Grogu high enough in his arms that the child can place both palms against the lower half of his helmet. They seem to look into each other’s eyes for a long moment, and then the Mand’alor tilts his head and rests the top of his helmet against the child’s forehead. It is such a bewilderingly intimate thing to witness that Luke coughs and steps back. \nThat’s, of course, when the blaster fire begins.\nLuke unclips his lightsaber from his belt and ignites it even as he whirls around, deflecting the second, third, and fourth blaster shots in quick succession. It gives him just enough breathing room to inhale, exhale, center himself in the Force and then reach out--\n“Five-man team,” he announces absently. “Can you get Grogu somewhere safe?”\n“You can take a five-man team?” the Mand’alor says. Luke would be insulted by his skepticism under other circumstances, but there’s no time for that.\n“Yes,” Luke replies shortly and then he takes a running leap up, bolstering his strength with the Force so his trajectory intercepts the one on the speeder. He has about half a second to clock that she’s wearing Clone Wars-era clone armor, plastoid in lieu of beskar, no clan sigils on the vambraces or pauldrons, and then she’s raining down quick blows--head, solar plexus, temple with the other elbow--and Luke counters inside of her guard, where Luke is more maneuverable because he’s not in armor and he’s smaller, more flexible. Her neck snaps under a punch with the hilt of his lightsaber and Luke has to scramble to grab and jerk the parking brake to stop the speeder from crashing into a rapidly approaching apartment building’s transparisteel balcony. He takes advantage of the momentum to keep going, tumbling upright and sprinting along the railing of the balcony to the edge of the building. Then it’s another Force-assisted jump up to the nest that two of the snipers had established on the roof of a nearby high-rise. He comes down on top of them and they’re too surprised to react in time when he lands on the first one, leading with his knee. That one’s out cold the second their head hits the duracrete floor--more antique clone armor, no sigil, Luke notes absently--but the other one has time to unsheath a vibrosword and he’s not worried at all, which means cortosis. Kriff. There’s serious money behind this, then.\nParry, overhead strike, parry, parry, inside cut, feint a roll--people always expect Jedi to use fancy acrobatics, Luke blames all of the shaky holocam footage of ridiculous Ataru duels from the Clone Wars--and then Luke kicks out his opponent’s knee and beheads him with a upwards sweep of his lightsaber, no time for anything more complicated because it’s a five-man team and this was only number three. He has to find the second sniper’s nest.\nTime has slowed for Luke, now that his blood is up. He takes off for the edge of the high rise at a run and as he leaps off, prepared to hit the high-level walkway at sprint, he sacrifices a few precious seconds of attention to try and find the Mand’alor. The park is deserted--oh, there, speeding away through the air--Luke hadn’t noticed the jetpack. Maybe the Mand’alor didn’t wear it to the negotiating meetings? It would probably make sitting in a chair pretty uncomfortable--but Luke doesn’t have any time to waste on that sort of useless speculation; he can see now that the other sniper’s nest is clear because the two occupants also have kriffing jetpacks and are in pursuit of the Mand’alor and his extremely loveable tiny child, because of course they do, why would this be  easy --\n~\nFour minutes later, Luke rides the second fake clone down into the courtyard of the palace in a plume of noxious black smoke, jerking his lightsaber out of the mess of the jetpack and thumbing it off as he rolls off and springs to his feet. “This one should still be alive,” he announces to Master Kenobi, who is hurrying down the steps of the palace a few steps ahead of a swarm of Mandalorians in full armor. “Where’s the Mand’alor? Is Grogu okay?”\nThe Mand’alor is in the middle of the mass of people on the steps, Luke realizes. He’s not moving. He seems to be staring at Luke.\n“Luke,” Master Kenobi says, very loudly. “Your hand is sparking.”\n“Aw, kriff,” Luke says. He’d parried one of those vibroblade strikes very low along the edge of his lightsaber, to improve his leverage, and it must have caught his cybernetic hand. He uses his teeth to tug off his glove and it’s obvious once it’s been removed that there’s something very wrong. He tries to make a fist and smoke pours out of the wrist joint. “No, no, it’s fine,” he tells Master Kenobi, who’s made a concerned noise. “I’ll fix it later, it’s fine.”\nThe posh advisor is the first to reach the fake clone where Luke had left him as a groaning heap on the stone floor of the courtyard. She demands, “State your purpose, coward,” in the ringing tones of someone who expects to be answered.\n“No one said anything about a kriffing Jedi,” the fake clone gurgles. “Two million kriffing credits, no one said anything about a  kriffing Jedi .” He sounds, frankly, like Han when one of his slimy trading partners reneges on their part of a deal. “I’m not fighting a Jedi for two million measly credits.”\n“I think this explains why he surrendered so quickly,” Luke observes to Master Kenobi. “But one of them had a vibrosword with a cortosis weave, so someone definitely knew to expect a Jedi.” More loudly, Luke calls, “I left one on a balcony across from Ne’tra Park and two on top of a high-rise by there--one of those is still alive. The fifth also had a jetpack; he flew away before I could grab him, sorry.”\nThe posh advisor nods at him. “They will be collected,” she says. “You have our thanks, Jedi.”\nLuke shrugs and clips his lightsaber to his belt. The nerve information coming from his right hand is beginning to feel strange and he frowns down at it, opening and closing his fist. He flares his fingers and gives the whole hand a sharp shake and that connects something--there’s a dagger of sensation, jagged, up through his elbow and along the inside of his upper arm, and then it slowly dissolves.\nShaking his head does not quite get rid of the hot itch crawling from his cheek to his temple. That elbow on the speeder had gotten him good; he can feel that the skin above his right eye is split. There’s definitely blood clotting in his eyelashes. “Ah, Uncle Obi-Wan?” Luke says.\n“Yes, Luke?” Master Kenobi answers. He’s much closer than he’d been a few seconds ago. Wasn’t he just speaking with the Mand’alor’s posh advisor? But Luke can see now that the Mand’alor himself is talking to his advisor, making a gesture with one hand like his fore- and middle fingers are running along a flat surface. Grogu is tucked in against his chest, only the tufts of his ears visible over his father’s shoulder.\n“I think my shoulder isn’t good again,” Luke only just manages. He can feel that the adrenaline is finally draining out of him, leaving him cold and shivering. \n“Maybe you had better sit down,” Master Kenobi tells him, just before Luke loses his battle with consciousness.\n~\nThere is someone sitting on Luke’s chest when he wakes up. His eyes feel crusted shut and he has to blink a few times to clear away a disturbingly red film before he can focus. He’s disoriented enough that he actually croaks, “Grand Master?” before he realizes that it’s Grogu standing on his chest. The child has both of his hands pressed against Luke’s face and his eyes are closed.\n“No, no, no,” the Mand’alor chides, appearing from nowhere to sweep Grogu off of Luke. “What did I just tell you?” \nGrogu makes an insistent noise.\n“Let him rest, you little womp rat,” the Mand’alor mutters, disappearing from Luke’s immediate range of vision. \n“It’s okay,” Luke manages, in a rough scrape.\nThe Mand’alor reappears suddenly. “Luke,” he says, and there’s a confused rush of static around him in the Force, like trying to tune into two holonet channels at once. \n“Did I faint?” Luke asks him muzzily.\n“You had a bad knock to the head,” the Mand’alor corrects. After a strange pause, he says, “The Jedi said you were spaced a few days ago.”\n“S’fine,” Luke mumbles. “Barely a minute.”\nThe Mand’alor doesn’t say anything. Luke can’t tell if he falls unconscious again; he feels really, really strange. But he blinks a few times and the Mand’alor is still there, standing over Luke’s prone body, holding Grogu as he attempts to wriggle free. The child has a very determined expression on his tiny face.\n“I think--” Luke tries, at the same time that the Mand’alor says something, and Luke says, “Sorry, you go ahead.”\nAnother one of those strange pauses. Maybe Luke is high? Mandalorians seem exactly like the kind of people who’d use spice as a painkiller. Luke’s vision is starting to go a little dark along the edges.\n“Thank you,” the Mand’alor says, finally.\n“You’re welcome, Mand’alor,” Luke replies sleepily. Maybe if he closes his eyes for a bit, the dark spots will clear up.\nThe Mand’alor says, “My name is Din.”\n~\nLuke wakes up with the sun. It sucks krakiss balls. His whole body feels like one enormous bruise.\nBased on the scent of bacta and antiseptic, he must be in some kind of medical facility. The room looks very similar to the rest of the palace--large, square windows, ornate molding--and, really, why wouldn’t the Mandalorian Royal Palace have a Hall of Healing? Mandalorians fight each other all the time. Their sacred rite of kingship involves dueling, often to the death.\nThere is a tiny green body sacked out on top of Luke, starfished over his stomach so they are pressed belly to belly. There is a hand on the back of that tiny green body--thick, square fingers inside of a glove reinforced with beskar knuckle-guards--and Luke follows that hand up an arm to a shoulder with a familiar sigil on its pauldron. He should probably be confused about why the Mand’alor is sitting at his bedside, but Luke is too distracted by a kind of breathless, exultant feeling in his chest.\n\n Din. \n\n“He wouldn’t leave,” Din says. His voice is rough.\n“I think he tried to Force heal me,” Luke says. His cybernetic hand doesn’t feel quite right, but he can control it enough to lift it and drop it carefully down on top of Grogu’s head. His ears twitch under the pressure but he doesn’t wake. Luke doesn’t trust the pressure sensors not to suddenly short out, so he moves his hand away after only a few seconds.\n“He’s done it before,” Din says.\nLuke feels like his chest might rip open at any moment, all the better to tuck Grogu away inside of it. “What an incredible kid,” he marvels softly.\nHe’s awake enough now to look around. The Mand’alor is sitting in an armchair pulled up very close to Luke’s cot, presumably to better keep a hand on his child. Master Kenobi, still asleep, is tucked in a matching armchair by the foot of the cot. There are the beginning signs of purple circles under his eyes. He looks very old, like this.\n“How did the negotiations go yesterday?” Luke asks Din and he receives what he interprets as an incredulous stare in return, for all that it’s delivered by expressionless beskar.\n“Nonexistent. We were all here,” Din finally says.\nLuke can feel his face twist into an embarrassed frown. “I’m fine,” he says.\nDin does not say anything so pointedly that Luke clears his throat and looks back down at Grogu. It’s almost hypnotic, watching the child breathe. He does it with the complete abandon of the young. He must feel very safe with Din.\n“To be with one’s own kind,” Din says, suddenly. “It is the Way.”\nLuke had read about this phrase in one of the books on his briefing datapad. The university professor had made it sound very similar to the Jedi Code, a set of guiding principles by which the Children of the Watch lived their strange, nomadic existence. It made sense that they had very strict rules about children; like the Jedi, they did not frequently reproduce amongst themselves but instead adopted their younglings. This made them incredibly conscious of their responsibilities towards their vulnerable charges.\n“He’s your son,” Luke says firmly.\n“He’s a Jedi,” Din counters.\nLuke huffs out through his nose and immediately regrets this decision when sharp pain radiates along his brow ridge. “He’s Force-sensitive,” Luke says. “They’re not the same thing.”\n“Do you not want him?” Din asks, sounding almost offended.\n“Are you kidding? You have the most adorable kid in ten parsecs,” Luke tells him, and then he scrambles to add, “Of course, Jedi don’t covet people. Or possessions. Or people as if they’re possessions.” He can’t help it; he lifts his cybernetic hand again so he can skim it over one of Grogu’s soft, thin ears. “But if we did, I think he’s very covetable.”\n“Yes,” Din agrees darkly.\n“Ah,” Luke says, carefully moving his hand out of the way again. “Right. The fake clones. Were they sent by that guy? Gideon?”\n“Bounty’s two million,” Din says. “That’s alive. It’s only one if he’s dead.” Although he says this flatly, there’s a flare of nearly incandescent fury around him in the Force.\n“You know who can do something about organized crime syndicates trying to kidnap their kid?” Luke tells him. “Kings of planets.”\nThe edges of Din’s fury sputter and die and then he says, tiredly, “I know nothing about being the king of these people.”\nLuke may not be much of a diplomat and he can’t really be trusted not to put his foot in his mouth if given enough leeway to do so but he can tell, somehow, that the most important part of that sentence is  these  people. He tries to hum in an acknowledging way in the back of his throat and manages instead a dry, sputtering cough. Grogu sleeps peacefully through all of the jostling, even when Din removes his hand and goes to find Luke some water.\nHe comes back with a carafe and a small cup. Luke has to use his flesh hand to take it and he’s surprised by the stability of his grip. He hurts so much he’d worried in the back of his mind that he’d done something irreparable to his injured shoulder, but it seems to be working okay.\n“Are they very different?” Luke is eventually able to croak.\nDin moves his chair a little closer before he settles back into it, leaning back and extending his legs so his feet are under Luke’s cot, crossed at the ankle. “Yes,” he says. He doesn’t seem inclined to elaborate. \nAfter a bit of careful thought, Luke slowly offers, “It’s very disorienting, the first time you leave the Temple as a padawan. We’re pretty sheltered as initiates--all that Force sensitivity, none of the control. It can be disastrous. But then when we’re taken as padawans by a master, they basically throw us into the deep end. My sister and I were lucky in some ways, because our parents came to visit us when we were growing up. We heard stories, we knew a little bit more about how the galaxy really worked, but I was still--well. My first mission with my master was to coordinate this treaty renewal, on Melidaan. It’d been thirty-five years since they signed the original one and it was just supposed to be ceremonial, but there had been rumors that one of the leaders was going to be assassinated so they asked for a Jedi presence.” Luke’s voice is getting rough again; Din leans forward and refills his cup from the carafe.\n“Thanks,” Luke murmurs. “Anyway, I was just this kid from Coruscant. Worse than some rich Core World brat in a lot of ways, because the Order training emphasizes rationality, emotional intelligence, collaborative problem solving, all of that. Kids who can get upset and yank the roof out of a building need to learn to identify their emotions and resolve them pretty early in life. Ten years out from the Clone Wars, most Outer Rim planets weren’t really in a place to be thinking about that kind of stuff, you know?” Din snorts. “Yeah. Anyway, there I am, a ten-year-old raised on open-mindedness and conflict resolution, thinking I know all about the galaxy because I grew up hearing my dad’s stories, and there’s this planet that’s thirty-five years out from a civil war so devastating they had to rename the planet afterwards.”\nHe has to stop for a second, take a drink from his cup. Melidaan has been on his mind more than once in the last few months. That mission had been the first time he’d really been able to see Master Windu in action and he’d been astonishing. It had terrified Luke, the sudden realization that he would be expected to grow up into someone like this: poised, powerful, compassionate, firm. And tall, too, although Luke had never quite managed that.\n“Melidaan has a biphasic population. Have you heard of it?” Din shakes his helmet in brief negation. “Something like forty percent of the population is over seventy and fifty percent is under thirty. Their civil war was intergenerational; most of the young people died. They needed MediCorp aid for decades, because without gene therapy their kids would have gotten too many genetic disorders. I’d never even been off  Coruscant .”\nDin shakes his head and his helmet droops backwards, like exhaustion has suddenly sledgehammered him in the chest. He barks out a kind of hissed laugh and lifts a hand halfway to his helmet before he stops himself. “Right,” he sighs. “So you get it.”\n“It can be pretty disorienting,” Luke says. “Suddenly there’s this--abyss, of the stuff you didn’t know. You didn’t even know that you didn’t know.\"\n“When Bo-Katan grabbed the kid, she just--she took her helmet off. I’d never seen another Mandalorian take their helmet off before,” Din tells the ceiling. “She called me a Child of the Watch, she told me that I belonged to a cult. I didn’t know. I thought we were all like this. Why would I know? These New Mandalorians, they keep to themselves here in their little city-domes. The only Mandalorians I ever met were from other coverts.”\nGrogu stirs a little on Luke’s chest, probably reacting to his father’s distress in the Force. Luke releases his hold on his half-empty cup of water, trusting the Force to put it safely on the floor, and rests his flesh hand on Grogu’s head.  Sleep, little one , he thinks, and Grogu stops fussing, his arms and legs going slack.\n“That’s useful,” Din mutters. When Luke flicks a glance at him, he’s lifted his head, the front of his helmet is looking towards Luke. “He never wants to go to sleep.”\n“I wouldn’t say it’s--entirely ethical,” Luke says, a little embarrassed. “But he seems like he needs the rest. Force healing is incredibly draining.”\n“I’m not gonna complain,” Din says. His weariness is making his Force signature almost blurry at the edges. Luke should probably not be surprised at the extremely hot feeling that spikes through him at the thought of Din, sleepy and blurry, giving flesh underneath ungiving beskar, but he is. It takes him a not inconsiderable effort to wrestle this emotion into submission and offer it to the Force. Doing so leaves him feeling scraped out, like he’s released his bone marrow along with it.\n“You should sleep,” Luke tells him.\n“Doubt there’s time for that,” Din says. “I’ll be all right. Got a couple of hours before I woke up and realized the kid had escaped.”\nThere’s silence, then, comfortable and warm and heavy. Luke watches Din watch his child. Two days ago, Luke had no idea that someone like Din existed in the galaxy. Luke’s loneliness had felt both inescapable and preordained and he had finally begun the grueling work of resigning himself to it, fully. He hadn’t thought--he hadn’t even hoped, because to hope had felt like a betrayal of the Order--\nPleasure and sorrow hammer away at Luke with unfamiliar strength. There is little he can do but weather them.\n~\nMaster Kenobi returns to the Hall of Healing at midday, trailed by a protocol droid with two trays of food and that tea service droid he’d somehow unearthed for the first day of negotiations. “The little one still sleeps?” he asks quietly, looking down at Grogu with a fond twitch to the corner of his mouth.\n“He woke up to eat,” Luke says. “To be honest, it raised a lot of uncomfortable questions for me about Grand Master Yoda. Do you think they’re actually their planet’s apex predator?”\n“I’ve suspected as such for a while,” Master Kenobi tells him. His eyes are twinkling mischievously. “During the Clone Wars, the Grand Master was deployed to the front for a number of months and the frog population in the Room of a Thousand Fountains apparently became quite untenable.” He settles into Din’s abandoned armchair and gestures to the protocol droid to bring forward their lunch trays. “How are you feeling, Luke?”\n“Fine,” Luke says. “Also maybe like the Mand’alor left his kid here because someone told him it’d be a good way to keep me on this cot.”\n“I’m sure the Mand’alor simply feels that you are well able to protect his child against further attacks,” Master Kenobi says, mild and disingenuous. He fusses with Luke’s tray, rearranging the dishes, before he allows the protocol droid to set it across Luke’s lap. Grogu is tucked down by Luke’s knees, where he’d settled after he’d eaten and the irritable ex-trooper medic who’d examined Luke had declared him recovered enough to be allowed to sit upright. “I am not surprised he received that impression after your actions yesterday.”\nUgh. “Master,” Luke tries.\n“It was very impressive,” Master Kenobi continues mercilessly.\n“I had to make sure I had the entire team neutralized as quickly as possible,” Luke says, very quickly. “It was a calculated expenditure of effort.”\n“A massive expenditure, you mean,” Master Kenobi returns flatly.\n“I--may have not properly accounted for my lingering injuries after the incident with the AgriCorps freighter,” Luke allows.\n“You ought to have been marched from the landing pad straight into a bacta tank after that assignment,” Master Kenobi chides. “The only reason you weren’t is because you didn’t inform anyone and your mission report wasn’t filed until after we’d left for Mandalore. Luke, of all of the horrifically reckless things to do--Force’s sake, these idiots were hardly a Darksider strike team! You could have taken more than a few seconds to fight them.”\nLuke says, helplessly, watching a surge of something fierce rush to fill his own Force signature, “I had to make sure they were safe.”\nUnder any other circumstances, with any other master, Luke probably would have gotten away with it. Not Master Windu, of course, but his general style of mentorship had been spooling out enough rope for Luke to hang himself before offering vague advice that would allow Luke to figure out how to scramble his way to a solution. Big believer in independent problem-solving, Master Windu.\nMaster Kenobi’s mentorship style is to stare at Luke with flat incredulity that slowly drains away into resignation. “Two days, Luke?” he finally says.\nIt had taken Leia four minutes.  The Force just--calmed  , she’d told Luke. There had been no way to release her emotions into the Force, because the Force hadn’t been able to take them; its current had stilled, a kind of deep pool with Han at its center.  Is that why you immediately started shouting at him?  Luke had asked her. Instead of answering, Leia had punched him in the kidney.\nLuke shrugs jerkily.\nMaster Kenobi pinches off a sigh and squeezes the bridge of his nose. “Eat your qana beans, Luke,” he says.\n~\nDin appears in the late evening, just in time to catch Luke being discharged. The head medic of the Mandalorian Royal Palace is a grizzled old trooper named Blisk. It’s pretty clear he knows Kix, or has heard enough through the ex-trooper grapevine to be familiar with Kix’s myriad complaints from his time serving with Luke’s father, because the first thing he’d said to Luke was a mild, “If you try to get out of that cot I’m going to staple you to it.”\n“Am I cleared?” Luke asks now as Blisk slaps what is hopefully a final bacta patch on his split eyebrow. \n“Cleared for more idiotic stunts? Sure,” Blisk drawls. “You get spaced again, though, and you’re going right into a bacta tank.”\n“I’ll do my best not to get spaced,” Luke promises.\n“I’ve heard that before,” Blisk mutters under his breath. And then, more loudly, “You got someone lined up for that hand yet?”\nLuke spares a glance for his cybernetic hand. It’s not smoking anymore but it’s also stopped delivering nerve information, so the power cell’s probably cooked. “Nah, I do my own repair work.” This is not the first time Luke has broken his new hand in the last year. There’s a reason he’d given up on a synthflesh covering for it almost immediately.\nGrogu makes an inquiring noise and puts a little palm on the back of Luke’s hand, as though he’s offering to try to Force heal the cybernetics. “It’s okay,” Luke tells him softly. “We do something else for that,” and he shows Grogu a memory of replacing one of the motorized knuckles in his hand. Grogu gurgles and looks up at Luke with what seems to be real interest. “I’ll show you,” Luke promises. “I think I have the stuff I need in my kit.”\n“Show him what?” Din asks. When Luke turns, Din’s already halfway across the room. He nods once at Blisk, who nods back and then returns to his datapad, where he’s hopefully amending Luke’s medical records and finalizing his release.\n“He wants to help me fix my hand,” Luke says. There’s probably a dopey smile on his face as he watches Din scoop Grogu up into his arms.\n“What, more Jedi stuff?” Din says, with a spike of faint curiosity.\nLuke laughs. “No,” he says, “the hand’s just mechanic’s work. Nothing mysterious about replacing a power cell.” He tries to bend his wrist. A servo makes a sad noise but nothing else happens. “It’s only been a year and this’ll be my fourth power cell. Maybe I can source one a little more robust from Ubrikkian or something.” He frowns down at his blackened cybernetic hand, and then at the sling into which Blisk had forced his left arm after a long discussion about deep tissue damage.\n“You’re going to wear the sling,” Blisk says without looking up, “and if you try to take it off I’m going to--”\n“Yeah, yeah,” Luke says, “you’ll staple it on, I got it.”\n“Is this kind of stupidity genetic?” Blisk asks as he types away at his datapad. “Or do they teach it at your fancy academy?”\n“Wow, okay,  Kix ,” Luke says.\n“I’m honored by the comparison,” Blisk replies instantly, “since the man’s a legend for never losing his temper and murdering General Skywalker.”\nLuke rolls his eyes. “I’m not disagreeing with you. Everybody knows my dad’s a mess.”\n“And General Kenobi is worse,” Blisk says darkly.\n“And Master Kenobi is worse,” Luke agrees readily. “Can I go now?”\nBlisk says, “He needs to wear the sling for at least two days or else his shoulder’s not going to heal right, no matter what mystical bantha shit he tries.” It takes Luke a second to realize that he’s speaking to Din, who has tucked Grogu into the curve of his elbow and appears to be listening. “All the shrapnel should be out and the burns are basically healed, so there’s no need to put more bacta on it. He just needs rest. No saber practice.”\nLuke opens his mouth to complain but he’s stymied by Din, who nods sharply, as though he’s accepting responsibility for babysitting Luke--a grown man! A  Jedi Knight  !--during this absurd healing regimen. It suddenly occurs to Luke that maybe Din feels responsible, as though he’s in Luke’s debt because Luke had fought off those bounty hunters. He waits until they’re in the corridor to say, “You don’t need to--” and he waggles his right elbow back towards the infirmary. “I’m not actually a helpless infant. The ex-troopers just get like that sometimes. There are a few of us whose parents served with them during the Clone Wars and I think the troopers kind of see us as--I don’t know,  theirs , in some way.”\n“Responsibility for foundlings is shared by the entire covert,” Din says.\n“Right,” Luke agrees, relieved that this is yet another instance where the experiences of the Children of the Watch and the Jedi Order neatly intersect, no elaboration necessary.\nLuke is gently testing the rotation of his left shoulder inside of the sling, trying to get a feel for what Grogu had done while he was unconscious, when Din says, “Adarmatan Kryze said something today in the negotiations, about--Anakin Skywalker.” He doesn’t actually make it a question, but Luke can feel his curiosity as he says the name.\n“My father,” Luke says, feeling his face go flat at the reminder of Adarmatan’s strange venom. “Yeah, he keeps asking me about him. I can tell he’s got a chip on his shoulder but about what, I’m not sure.”\n“He raised you?” Din asks, with a weird inflection.\n“For a few years, but mostly I grew up in the Temple,” Luke says. “My father left the Order right after the Clone Wars. He fell in love, which is fine, but he’s not really--well. When you love too selfishly or deeply it can make you vulnerable to the Dark side of the Force. Fear, anger, all of that. Possessiveness is also really bad and my dad, uh. He feels very strongly about people he thinks are  his .”\nDin does not say anything. It feels like there’s a fist clenched around Luke’s esophagus. Luke recognizes the source of that as a kind of frightened anticipation and tries to release it into the Force. It goes, eventually. Sort of.\n“Coming out of the Clone Wars, that included the troopers in his battalion,” Luke continues around the lingering lump in his throat. “He was part of the body that negotiated that treaty, the one that allowed troopers who wanted to to become citizens of Mandalore. The New Mandalorians were pretty hesitant, I think. They’re all pacifists, they apparently didn’t want a lot of soldiers moving in--kriffing hell, I’m an  idiot ,” Luke realizes. Of course that’s the source of Adarmatan’s aggressive dislike. “That asshole, he’s just mad that my dad forced them to recognize the troopers as Mandalorians. Well, he can kriff right off!”\nDin’s amusement feels like a sudden flare of warmth along the entire left side of Luke’s body.\n“I’m a shit diplomat,” Luke tells him, the truth of that settling in as exhaustion along his skeleton. “I never can put this stuff together. My sister, Leia, she’s so--she’s just really good at it. She always knows what’s going on underneath what people say or how they feel in the Force. I never--I don’t know.” Luke frowns and then makes a face at himself. “Sorry, never mind.” With a start, he realizes that he recognizes the corridor they’ve just turned into, with its quartet of doors painted various shades of pale green. The one that looks almost yellow leads to Luke and Master Kenobi’s suite. “Thanks for walking me back.”\nDin does not take this opportunity to leave. He just stands there, holding Grogu, looking at Luke.\n“Uh,” Luke says, cleverly.\nAfter about fifteen extremely awkward and perplexing seconds of silence, Din says, “That hand needs fixing.”\nLuke says, “Are you--offering?”\n“Yes,” Din says.\n“Oh!” Luke says, embarrassingly close to a squeak. “Well, thank you. That, uh. That’d be great.”\nIf left to his own devices, Luke probably would have used the Force to do most of the fine mechanical work, undoubtedly tweaking his injured shoulder in the process and risking Blisk’s wrath, but Din proves to have a steady hand. Luke narrates most of the steps for Grogu’s benefit, telling Din what needs to be done and then explaining to Grogu why. The child probably only understands a little bit of what he’s saying, but he looks so serious and interested that Luke can’t help responding to that attention with thoroughness.\nHe gets distracted, once or twice, watching Din’s hands in their bulky gloves carefully cradle one of Luke’s extremely tiny screwdrivers as he removes the plate protecting the power cell. It’s so intimate that it should feel uncomfortable, shouldn’t it? The only people other than Luke who have ever seen inside of his hand are his dad and the DD-13 that had installed the hand in the first place. But it feels so good to be the recipient of Din’s careful focus.\nDin unfastens the power cell and lifts it out, turning it so that Grogu, sitting on Luke’s lap, can get a good look at it. “Fried,” he tells Grogu, showing him where the safety coating has eroded.\n“Blebleble,” Grogu agrees.\nDin unwraps the new power cell from its polyfilm packaging. Luke always packs extra parts for his hand in his kit and he is, unfortunately, usually rewarded for his foresight. “Not fried,” Din says, pointing to the smooth surface of the new power cell’s safety coating. Grogu taps it with a claw and makes a pleased noise at the texture.\n“This is already going better than his last attempt at electrical work,” Din says. He looks down into Luke’s splayed-open hand and his whole body seems to frown. “Okay if I clean this?” he says.\n“Yes,” Luke says. “But you don’t need to.”\nDin says nothing, pointedly. He fishes a nylar swab-tipped stick out of Luke’s repair kit and then scrounges around further, clearly looking for something. “You got any cleaning solution?” he asks.\n“I usually use saliva,” Luke tells him. “Here, let me,” and he makes an aborted movement with his left hand, tucked against his chest by the sling, before he remembers to stop himself.\nDin looks at the kit, and then the swab, and then at Luke. His body sort of twitches and then he extends the swab towards Luke, carefully, like he’s not entirely sure of what he’s doing. Luke leans forward and takes the swab into his mouth, closing his lips around the stick and gently rolling the swab across his tongue. It takes him a few seconds to generate enough saliva; his mouth feels very dry.\nAround them, the Force slows to a sluggish roil. There’s something coming off of Din, viscous and dense, seeping out from behind the beskar. Luke has attracted other sentient beings before and it’s always felt like being hit in the face with a cloud of expensive cologne--sharp, overwhelming, heady. Whatever Din is feeling is thick. There’s a steadiness to it that is confusing but also deeply pleasurable.\nLuke feels his thoughts actively liquify as Din carefully uses the swab to clean the worst of the soot off of the power cell chamber. When he discards the first swab and picks up a second, Luke barely has a second to press his tongue against the roof of his mouth, preparing himself, before Din turns away and there’s a tilting motion--oh, Luke realizes, slowly, all of his blood thickened to jogan syrup, because Din has  lifted the bottom of his helmet --and when he turns back the tip of the swab glistens faintly.\nLuke wants, so abruptly that it’s physically disorienting, to see Din’s face. He wants to know the shape of his mouth. He wants--\n Their doctrine requires their face go unobserved by any other living creature . Luke winces and straightens up, trying to shake off the worst of the disorientation. Luke is a Jedi Knight. This is so massively unbecoming that Master Windu, one with the Force, is probably shaking his head in disappointment right now. Not only is Luke a disgrace to the tenets of the Jedi Code, he’s being actively disrespectful of Din’s Creed.\nAlso, there’s a kriffing baby on his lap.\nDin finishes replacing the power cell and watches mutely as Luke tests for any further injuries requiring repair. One of the servos needs a new washer--Din leaves Luke to explain this process to Grogu, which Luke does with a croak to his voice that he hopes isn’t too embarrassingly obvious--and then it’s as good as a functional cybernetic ever gets after an encounter with a cortosis-enhanced vibrosword. Din collects Grogu from Luke’s lap, pulls the fried power cell out from where it’s been clenched between the child’s little teeth, and then says, quiet and rough, “Good night, Luke,” as he’s halfway out the door.\nLuke tries to meditate after they’ve left. It does not go well.\n~\nMaster Kenobi seems cheerful and restful when he joins Luke in the sitting room of their suite the next morning. There’s something almost smug along the edges of his presence in the Force, familiar to Luke because he’d seen it once or twice when Master Kenobi had a pop quiz planned for the students in one of his courses. “How are you feeling?” he asks. \nLuke shrugs and is pleasantly surprised when he doesn’t have to immediately shunt any physical discomfort into the Force. “Good, actually,” he says. “The sling’s annoying but my cybernetic hand is working again so it’s manageable.”\n“Ah, yes, I did notice,” Master Kenobi says, flicking a pointed glance at where Luke is lifting his cup of caf to his mouth. “Did Blisk assist you?”\n“Oh, uh.” Luke coughs. “The, uh. Mand’alor. Was able to help. With that.”\nMaster Kenobi seems sort of flatly unsurprised. Perhaps--oh  no --he’d been able to sense a faint trace of that thick, rich feeling in the Force when he’d returned to their suite last night.\n“And Grogu!” Luke adds, a little desperately. “Grogu, who was also here. With us.” Even if Master Kenobi thinks so poorly of Luke--which he must, because Luke is pretty obviously failing to adhere to the Jedi Code more and more with every passing second he spends on Mandalore--surely he knows that Luke would draw a line about doing anything with a baby around.\n“The child,” Master Kenobi says, apparently willing to be distracted. “He is astonishing, isn’t he?”\n“I don’t know what’s more amazing, that he’s so little and has so much control already, or that he apparently learned it from  Darth Maul .” Luke shakes his head and drains his cup of caf, turning his attention to the bowl of stewed oranges on his breakfast tray. “I sense very little darkness in him.”\n“No, me neither,” Master Kenobi agrees. Someone involved in catering has apparently wised up to his eating habits; his pot of tea is accompanied only by a small plate with two blue milk biscuits on it. “They are likely related. I suspect that Grogu is significantly older than his size suggests and he accordingly was with Maul for a relatively short period of his life. I’ve sent a message to the Council but they have yet to reply.”\n“I’m surprised Master Yoda isn’t frothing at the mouth to recover him,” Luke admits, squishing a segment of stewed orange into submission with the side of his spoon. Don’t Mandalorians ever get tired of this gruel? Luke’s eaten it for every meal since they landed on the planet and he feels like his fingernails are on the verge of turning orange.\n“You know that it’s difficult, with older children,” Master Kenobi says. “Grogu could very well be twenty or even thirty years old. He’s formed a very strong connection with the Mand’alor. You can sense it, can’t you?”\n“Of course,” Luke says, confused. “But most Force-sensitive children form bonds quickly, I thought that was normal.”\n“With the crèchemasters, certainly,” Master Kenobi says. “But with an individual so insensitive to the Force? It’s much more rare. If I may quote the Grand Master,  reeks of attachment, this does . It could be dangerous to separate them.”\nLuke frowns down at his mushed oranges. He’s heard stories, of course, from fellow knights who’ve stumbled across Force-sensitive children during other assignments. They’re almost uniformly tragic. Rarely, they have happy endings--Luke had grown up with age-mates in the crèche whose parents had moved to Coruscant to stay in orbit around their Jedi children, packing up their whole lives and becoming support staff at the Temple or finding jobs in nearby neighborhoods just so they could visit the crèche a few times a year.\nSometimes the children are in more precarious situations, unable or unwilling to leave parents unable or unwilling to themselves move. It usually isn’t a problem; untrained Force-sensitivity fades with time with nothing to hone itself against. But Grogu is rather demonstrably trained and leaving him like this would only make him a danger to himself and others. “What did you recommend?” Luke asks.\n“I think a tutor might give us the best outcome,” Master Kenobi says. “The situation is rather unique, you must admit. I suspect that Grogu will not be of an equivalent age to a senior initiate until after the Mand’alor’s natural lifespan has ended. After his death, perhaps the idea of joining the Temple might be revisited. It’s an unorthodox solution but one I believe the Order might accept.”\n“Wait, seriously?” Luke stares at him.\n“Grand Master Yoda once mentioned to me that he was not knighted until well into his first century,” Master Kenobi says. “I believe he meant to soothe my anxieties regarding my own delayed Trials, but as you might imagine it only made them worse.”\n“A  century !” Luke marvels.\n“Well, he’s over nine hundred years old, Luke,” Master Kenobi says.\n“I’m really glad it didn’t take me a hundred years to be knighted,” Luke says.\nMaster Kenobi crunches through one of his blue milk biscuits. “There were very few doubts about whether or not you would achieve knighthood, Luke. I hope you were not particularly anxious about that outcome.”\n“Isn’t everyone?” Luke points out. “All that bantha shit about the Chosen One, pft. Having a weird relationship with the Force doesn’t make you a Jedi Knight, it just makes you a Skywalker. And some of the masters seemed upset when I chose to specialize in Niman.”\nMaster Kenobi rolls his eyes. “Don’t let yourself be swayed by the grumbles of old masters, Luke. Common salle wisdom disdains Niman as the dilettante’s form but that’s a shallow interpretation and you know it. You’ve brought a rare artistry to the sixth form and  some  people ought to be grateful for it, rather than bitter over losing out on a few credits.”\nLuke makes a confused noise.\n“Oh, there were a few wagers on the subject of your and Leia’s eventual forms,” Master Kenobi says dismissively. “Mace and I were forbidden from participating but we were aware of it. Your sister is too short for Djem So but everyone knew that would hardly stop her, so that bet was not very interesting. Your preference was much more hotly contested.”\nLuke can feel his mouth twist into an awkward, embarrassed grimace. “I’m really glad I had no idea at the time,” he admits.\n“Mace shielded you from it, as I did for Leia.” Master Kenobi swirls his tea with a casual, thoughtless turn of his wrist, his mind clearly darting to some new subject. “You’re aware, of course, that the sixth form is meant to allow its adherents flexibility and creativity because it pulls from the first five forms. The general praxis is to learn the basics of the first, second, and third forms, undertake a few years of study of the sixth, and then pick up more advanced techniques as needed--a kind of scavenging of sorts. I don’t believe Mace taught it to you that way?”\n“No,” Luke says. “I learned the first five forms in full, and then Vaapad, and then the sixth form. I was already a senior padawan by the time he taught me Niman. I knew at the time it was a little unusual, but Master Windu said I needed the emotional stability provided by the other forms. I thought it was, you know, an accommodation.”\n“For being a Skywalker?” Master Kenobi smirks at him. “A reasonable assumption, and one I think Mace would have clarified if he’d had the time. No, Luke, it was most certainly not because the Skywalkers are a family prone to emotional instability.”\n“Well, we are,” Luke points out.\nMaster Kenobi hums in the back of his throat. “Your father struggled with anger and fear, yes. But he was brainwashed for a decade by a Sith lord powerful enough to live on the same planet as the Jedi Order without being detected, so I’m willing to give him some leeway on that point.”\nLuke says, “Okay, but Leia left the Order, too.”\n“In deference to her emotions?” Master Kenobi asks, the same way he’d used to lead recalcitrant padawans in his Mid Rim Poetry of the Ruusan Reformation seminar--Leia had forced Luke to enroll so she wouldn’t have to take it alone--to a logical conclusion just out of reach. It’s condescending and horrible and Luke has been trained by literal decades’ worth of experience to respond to it with a reflective pause.\n“No,” he finally admits. “She fundamentally disagreed with the tenets of the Order. She felt that we should interfere more, not less.”\n“Your sister’s decision not to undertake her Trials was almost entirely the result of rational philosophy,” Master Kenobi says. “Really, Leia is one of our Order’s great successes. She is unbelievably powerful and could be incredibly destructive, but she understands and controls her emotions. She respects logic and the will of the Force. She uses the skills she learned from the Order to serve her people. And I think, perhaps most crucially, she understands that the Jedi Order ought not to be involved in political matters--but political matters could be well-served by being undertaken by someone with the humility and integrity of a Jedi.”\nThis is an interesting interpretation of the character of Luke’s sister, who spends most of her time embroiled in sprawling, screaming arguments with both her husband and father and usually gets her way by sheer bulldozing. It does in many ways reflect Senator Skywalker, though--a woman who is frequently in holonet headlines advocating for a coherent galactic refugee charter or reducing Republican financial support for corporations that don’t subsidize medical droid access for their employees. It has never occurred to Luke that what Leia took away from the Jedi Order was a kind of professional armor she’s now able to don when she steps away from her personal life.\nLuke doesn’t realize he’s been totally distracted until he looks up from his now-empty bowl of stewed oranges and Master Kenobi is draining his second and final cup of tea. “You were trying to say something,” Luke prompts him. “About Niman?”\nMaster Kenobi says, a little startled, “Hmm? Oh, yes. I was.” His gaze sharpens on Luke, suddenly, like there are twin kyber crystals behind his eyes. “Mace didn’t train you in the sixth form in the traditional sense, Luke. He taught you the other forms and then allowed you to develop your own deep, personal interpretation of Niman. I think you will find it worthwhile to contemplate the difference.” \nLuke has no idea what to say. Eventually, he settles on, “Thank you, Master. I will.”\nMaster Kenobi puts down his cup and rises to his feet, his sharp stare tamping down into a mischievous twinkle. His Force signature has begun to sing; he’s excited about something. “Shall we proceed to the conference room? I think today’s negotiations will prove quite satisfying.” \nContemplations on lightsaber forms will have to wait; Luke has known Master Kenobi his entire life, so he has enough experience to know that that’s a terrifying sentiment.\n~\nThere are two new but very familiar faces waiting for them in the conference room when Master Kenobi and Luke arrive exactly on the hour. “I invited guests from Keldabe to join us today,” Master Kenobi announces, sweeping towards his seat with his cloak billowing behind him. “Governor, Minister, I believe you both know Bo-Katan, Korkie, and Adarmatan Kryze?”\nAdarmatan is too busy glaring poisonously at Luke but Korkie and Bo-Katan offer vaguely polite greetings.\n“Mand’alor, if I may introduce Governor Cody and Minister Numa?” Master Kenobi continues. There’s a long pause as everyone sizes up each other’s deadliness, the Force becoming ponderous, almost burnt-smelling, and then the feeling abruptly dissipates as everyone seems to accept that this is a room full of dangerous people, Adarmatan and Korkie Kryze presumably excepted. Kriffing Mandalorians. Din nods in acknowledgement of the introduction. “The governor serves as the head of the government of Keldabe, where most of the former clone troopers have settled, and Numa is their Minister of Planetary Affairs. And you know Luke, of course, governor.”\nCody looks at Luke’s arm in its sling and raises an eyebrow. “Heard you tried out flying a bounty hunter,” he says.\n“Well, I wouldn’t recommend it recreationally,” Luke says. It’s probably too much to hope that his parents haven’t heard about this yet; the ex-trooper grapevine is kind of terrifyingly efficient at disseminating information and Luke’s father is still mostly tapped in. “Nice to see you again, Cody. You too, Numa.”\nNuma says, “Hey, Luke. Glad you aren’t dead or whatever.” She’s carrying about fourteen datapads that she unceremoniously drops onto the conference table. When Adarmatan sneers in her general sort of direction, Numa looks down her nose at him and sneers right back.\n“Thanks,” Luke says.\n“Keldabe is currently the second-largest city on Mandalore and its citizens make up nearly half of the population,” Master Kenobi remarks as he settles into his chair. “I thought it appropriate for their head of government to participate in our discussion.”\n“The Mand’alor is the head of their government,” Bo-Katan says.\n“Do you object to the inclusion, Mand’alor?” Master Kenobi asks politely.\nDin says, “No,” and folds his arms across his chest. Is his chair a little bit closer to Luke’s than it had been two days ago? The angle makes it hard to tell; Din is turned so that Luke can mostly see him in profile, his chair oriented so that he has both the Keldabians and the New Mandalorians in the same line of sight.\nIt’s pretty obvious within a few minutes that something substantial had happened yesterday while Luke was laid up suffering Blisk’s tender mercies. The conversation no longer seems to be revolving around whether or not Din is going to just take off in the middle of the night and leave the Darksaber to whichever Kryze grabs it first--”It must be won in  honorable combat ,” Bo-Katan had hissed through her teeth when Din had made to unclip the Darksaber from his belt and chuck it across the table at her that first day--but instead a discussion about something that sounds like government structural reform.\nIt takes Luke a little while to catch onto the actual thread of the conversation, because he’s busy trying to get a sense of everyone in the Force. He demonstrably is not good at interpreting that information--case in point: Adarmatan--but it might be useful for Master Kenobi to know and Luke is anyway just sitting there. The various Kryzes are annoyed but much less impotently than previous days; their seething seems more focused. Cody and Numa are alert, attentive, and optimistic, which makes Luke think that they had been the dinner appointment that had kept Master Kenobi out until very late last night. The posh advisor is very, very good at keeping her emotions tucked away behind her beskar armor and all Luke can get out of her is a sort of wry amusement.\nDin feels prickly and turbulent, like a cornered back-alley tooka-cat.\n“Why isn’t there anyone from Keldabe on the Ruling Council?” he asks late into the morning. The sound of his voice rings like a bell in the Force for a long moment; Luke can feel that something has been set in motion, the reverberations so forceful that his molars rattle in the back of his skull.\n“Great question,” Numa says. “Why  isn’t  there anyone from the second most populous city on the planet on the Ruling Council, Kryze?”\nKorkie frowns. “You refused the position.”\nNuma says, “A non-voting seat isn’t a position, it’s a publicity stunt.”\n“No other cities were offered a place on the Ruling Council,” Adarmatan says. “It was an offer made only to the clones of Keldabe, and you refused.”\n“Because it was  non-voting ,” Numa says, enunciating slowly around her fangs. “And there aren’t any other cities on Mandalore, not really--eighty percent of the population lives in Sundari or Keldabe. That said, the governor of Concordia has a voting seat.”\n“Our only arable farmland is on Concordia,” Korkie says.\n“And half of our population lives in Keldabe,” Numa snaps. “Besides, you didn’t give the governor of Concordia a voting seat because you’re worried about farmland. Everyone at this table knows that the vast majority of our food is imported. You gave it because you didn’t want a second Death Watch fomenting up there.”\nBo-Katan hisses, “Do not dare.”\n“No one cares about your past exploits, Bo-Katan,” Cody says shortly. “Don’t look for insults where there aren’t any.”\nLuke can feel that Din is a little adrift in this back-and-forth. Does he know enough about Mandalore’s history to even be following this conversation? But inside of that thin cloud of confusion, Luke can feel a determined tendril of something that he thinks is fundamental to Din: a sense of keen, deeply-rooted responsibility. It was always there, but it seems to be growing stronger, like new growth soaking up the spring sunlight.\n“Does Keldabe need aid?” Din asks. The roiling confusion around him sharpens, suddenly, and Luke inhales and doesn’t exhale, waiting on the drop he can feel setting its hook behind his stomach.\nCody says, “Not in the immediate sense. But there’s too many of us in that little dome. We need to expand, or we need to get serious AgriCorps help to recover land. We’re on an island; it might be more feasible there than here on the main continent. Beyond even that, though: We are Mandalorians, not inconvenient pests. We’re owed a voice on the Ruling Council.”\nSomething in the Force shifts. Luke’s ears pop.\n“Yes,” Din says, steady now. That bright tendril-- kinship, honor, responsibility --feels like it has blazed into a great tree. “You are.”\nThe posh advisor says, “A Mandalorian will always come to the aid of another. This is the Way.”\n“This is the Way,” Din agrees.\nAdarmatan’s little moustache is shivering furiously above his mouth, like at any moment his indignation is going to make it dance right off of his face. “My father died defending the New Mandalorian way of life,” he says tightly. “He was far from the only one, but he did so gladly because it was righteous. And when we finally had peace--when the galaxy had peace, when people were finally prepared to listen to us--in flooded these--engineered creatures of war, shoved down our throats by the Jedi.” He bares his teeth. “They are not Mandalorians. They are clones.”\nNuma drawls, “Technically, I’m a Twi’lek.”\n“You’re Mandalorian and you know it,” Cody says.\n“If you’re not Mandalorian because you’re a clone, I’m even worse--I’m a Twi’lek who was adopted by clones,” she says. “That’s the logical continuation of his point. Were you born of some fine lineage, Mand’alor?”\n“I was a foundling,” Din says, with a low, audibly dangerous edge.\n“I’m not questioning the Mand’alor,” Adarmatan says to Numa, almost spitting now with the venom he’s clearly been nurturing for some time. “It’s you I question. The Republic forced us to accept your kind, but we aren’t members of the Republic and we aren’t beholden to their laws.”\nNuma looks about half a second from slinging one of her datapads into his face.\n“It wasn’t Republic law that recognized the clone troopers as Mandalorians,” Luke says. Din’s head whips around to look at him and Adarmatan follows suit, narrow-eyed and furious at the interruption. “They fulfilled the Resol’nare. The treaty simply acknowledged it.”\n“The six actions are archaic nonsense,” Adarmatan says.\n“But still legal,” Numa replies swiftly. “Very, very legal.”\nNext to Luke, Master Kenobi is radiating a truly unbelievable amount of smug satisfaction into the Force. No doubt he’d planned this entire negotiation process to get this exact outcome. And it’s obvious why he would have felt the need to do so--the air feels clearer even with Adarmatan’s furious words still floating around their heads. How many wounds need lancing before the Mandalorians can work towards an integrated and successful society, for kriff’s sake? \nLuke leans back in his chair and then can’t quite swallow back a wince; he’s stiff from sitting and he’s getting a headache from all of the tension and roiling emotions around him. Attempts to release his physical discomfort into the Force are met with abject failure.  This is yours  , the Force seems to be saying, sounding eerily like Master Windu.  Suffer and learn something.  \nDin is still looking at Luke. He says, “We break now.”\n“What?” Adarmatan squawks. “You can’t just-- end  a session!”\n“Yes, I can,” Din says flatly. “I’m the Mand’alor.”\n~\nSomehow, in the confusion of everyone breaking for lunch, Luke ends up in Din’s hands. He’s not quite sure how it happens; one minute, he’s talking to Cody, assuring him that he’s sore but otherwise okay, no need for anyone’s parents to be notified, and then the next Din’s hand is cupping his right shoulder, steering him without actually pressing against any injuries--isn’t  that  a distractingly gentle gesture--and Luke and Din are in a corridor by themselves and Luke can feel the nearby presence of Grogu, curious and happy and voraciously hungry.\n“What?” Luke manages as Din guides him through a doorway into a very, very nice suite of rooms. Luke is immediately distracted by Grogu stumbling to his feet and staggering towards Luke and Din with great enthusiasm and very little skill. He leaves on the floor behind him a Mandalorian whom Luke assumes is another member of Din’s covert because they’re wearing full armor, helmet included, folded up like a beskar pretzel along with a pile of blocks and an enormous stuffed mythosaur. “Hey, little guy,” Luke says. He only makes a twitch towards the child before Din has a hand back on his right shoulder, reeling him out of range of any overenthusiastic reunions.\n“Sit,” Din says.\nThere’s a lot of places to choose from; how many chaises can one room reasonably hold? The answer seems to be seven or eight. Luke sinks down onto the nearest one, which immediately envelops his body in its plush grasp. He involuntarily lets out a long sigh.\nDin swoops down, picks up Grogu, and then plops him down on the chaise next to Luke. “Gentle,” he tells Grogu, who stares up at his father with beguiling innocence. “ Gentle ,” Din enunciates.\nDin and the babysitter disappear back out into the corridor, destination unknown, and left unsupervised Grogu immediately crawls into Luke’s lap. He does so gently, at least. He doesn’t actually inquire after Luke’s health, but he offers a burble of interested sympathy, extending one of his hands towards Luke’s face. Luke leans down and pretends to nibble on his fingers, to Grogu’s intense joy. “Mmm, delicious youngling fingers, my favorite,” Luke says. “Just the kind of snack I was looking for.”\nGrogu chortles, both of his hands now extended up towards Luke’s face. Luke uses his cybernetic hand to steady the child as he pretends to bite at inquisitive little fingers. It feels like his exhaustion slowly oozes out of him, wrung out of his skin by Grogu’s bright happiness. Luke had always found his involuntary conscriptions to crèche service as a padawan a theoretically nice but ultimately exhausting exercise--Jedi younglings: very troublesome--but something about Grogu makes even these silly games feel restorative.\n“If you eat the kid, you won’t have room for lunch,” Din says, striding across the room with a steaming bowl of stew in each hand. \n“Kriff,” Luke says, straightening. “Your lunch. I can go, let me--” and he goes to lift Grogu off of his lap. Before he can manage it, Din is shoving one of the bowls into his cybernetic hand and plucking Grogu away in one smooth motion.\n“It’s fine,” Din says over Grogu’s loud squeal. “I’ll eat later.”\n“That’s--I don’t want to--” Luke tries, but he wilts in the face of Din’s calm implacability. Din puts Grogu on the floor and hands him the second bowl of stew, which might actually be bigger than the portion he’d brought for Luke. Grogu makes a kind of happy growling noise and immediately begins wielding his comically enormous spoon in pursuit of a chunk of scrubroot.\nLuke eats his stew. It’s delicious.\n“How’d you manage to avoid the stewed oranges?” Luke asks.\n“Told the protocol droids I’m allergic,” Din says, watching Grogu eat. “Then I told them to kriff off so they’re all afraid of me now.”\n“Rude,” Luke says. “But I can see how it would be effective. They’re a timid bunch. Master Kenobi’s been asking them to do favors for him and a flock of them have started following him around.”\nDin snorts. “He’s welcome to them.” \n“Not a fan of droids?” Luke asks.\n“No,” Din says shortly. After a painful-feeling pause, he adds, “My parents died at Aq Vetina. Separatists. I was raised in the Fighting Corps.”\nLuke does his best not to actually choke on a piece of scrubroot. “You were  Death Watch ?” he says. “How did you end up with the Children of the Watch?”\nDin seems uncomfortable. He twists his neck and then cracks a vertebra. “The distinction is meaningless to me,” he finally says. “I was a foundling, I was raised in the Fighting Corps, when I was grown I earned my armor and I joined the Bounty Hunter’s Guild as part of a covert on Nevarro. The Armorer, she led the covert there. We were the Tribe, not--children, or watchers.”\n“Right,” Luke says. “I’m sorry, I was just surprised. You said as much before. I just--well, you don’t seem to hate me that much. And every member of the Death Watch I’ve ever come across has hated the Order. Like--a  lot . This one bounty hunter, I don’t think he’s Death Watch anymore, but--I run into him every few years and he always seems personally offended by my continued existence. Although that might be because we first met when he was trying to pick up a bounty on my brother-in-law and I felt kind of morally obliged to step in.”\nDin stares at him.\n“Han’s an acquired taste,” Luke says weakly. “He’s the love of my sister’s life so we all just kind of deal with it.”\n“I’d never heard of your order until I found the kid,” Din says. “Even then it was just stories about ancient sorcerers.”\n“No seething ancient enmity? Great,” Luke says, smiling at him. “That would’ve been awkward, if your kid ended up a Jedi.”\nDin does not say anything. Tension unfurls inside his Force signature. Luke’s first instinct is to open his mouth and let loose the full force of his dumb kriffing babbling, but he somehow manages to gather enough self-control to bite it back. He gives Din the time to really gather his thoughts. Luke can almost see it happen in the Force, as though the space around him is becoming crisp and orderly.\n“His sorcery,” Din says finally. “He doesn’t know how to control it and he exhausts himself, sometimes very badly. Could your people--train him? Help him and keep him safe?”\n“Maybe,” Luke says softly. “But there are other concerns. I told you about my dad, how he left the Order? Some people love very deeply and they have trouble letting go. Grogu loves you, probably too much to be away from you for any long period of time. But you’re right that he’s just trained enough to be dangerous.” \nGrogu is completely preoccupied by licking the bottom of his bowl. He doesn’t seem to notice when Din lifts a hand and places it very gently on the back of his skull. He’s making little  plebplebpleb  noises. It should be disgusting but it’s stupidly adorable.\n“Master Kenobi recommended that someone be found to tutor him. His kind, they age really slowly. The question of him going to the Temple, it might be better addressed when he’s a little older.”\n“Wouldn’t he be more attached then?” Din asks.\n“You’re humanoid, right?” Luke asks.\nDin nods.\n“We’re talking decades from now,” Luke says. “Forty, maybe fifty years.”\nThere’s a sharp flare of shock from Din, like static electricity. “Are you kriffing kidding me?” he demands. “This little womp rat?”\n“He’ll be a child for a long time,” Luke says. “The question of attachment--the ability to love and let go--it’s not really a hypothetical philosophical question for a member of his species. He’ll live for hundreds of years, way longer than anyone he’ll ever know. He’ll lose everyone he loves to death eventually.”\nDin makes a very abbreviated, agonized noise.\n“I’ve met others like him,” Luke offers, desperate to soothe the pain he can feel dagger through Din. “They love with deep and astonishing compassion. I mean, the Grand Master’s a total asshole but--like, in a loving way. He trained my master. In the Order, a training lineage is a family of sorts, you know? He’s like a grandfather to me.”\n“So I won’t see him grow up,” Din says. His voice is a little raw.\n“You’ll see him grow,” Luke says. “He’ll be constantly growing and changing, like all children. But no, he probably won’t be grown to adulthood by the end of your life.”\nDin mutters, “Dank  kriffing  farrik.”\n“I’m sorry,” Luke says. He can feel that Din is struggling with sorrow, trying to wrestle it into a manageable size and failing. He feels like younglings do when they’re first beginning to practice meditation, as though his emotions are a beast too large for him to get his arms around.\nBut Din is not a youngling. He breathes for a while, hand on the back of his child’s head, and then he seems to deflate--acceptance, even if it’s not of the sort that the Jedi practices. Din’s tastes of long, bloody experience.\n“How do I get him a tutor?” Din asks wearily.\nBefore Luke has a chance to answer, a protocol droid shouts from the corridor in a timid warble, “Uh, Mand’alor? Your presence, sir, is required by Master Kenobi,” and it titters to itself nervously. \nDin exhales harshly and shakes his head. He stands surprisingly fluidly for someone wearing full beskar plate. When Luke goes to do the same, Din shakes his head sharply and puts out a staying hand. “You should rest,” he says. “You’re in pain, I can see it. The kid’ll sleep now, he won’t trouble you.”\n“The negotiations--” Luke tries.\nDin says, “They’ll be fine without you. Kenobi’s got the whole thing on rails. Besides, if you faint again, Blisk’ll probably end up with the Darksaber when he guts me in my sleep.”\n“I didn’t faint,” Luke says irritably but he doesn’t protest when Din plucks a limp, unprotesting Grogu off of the floor and drops him onto the chaise next to Luke.\n“Nap,” Din tells Grogu firmly. “Remember, be gentle.”\nGrogu coos sleepily.\n“You, too,” Din says to Luke. As he passes the chaise, he puts out his hand and runs the tips of his fingers--fore, middle, ring--along the edge of Luke’s hairline. It feels like Luke has been branded by this thoughtless, inquisitive touch, and it cracks open a kind of desperate hunger, somewhere deep inside of Luke, for a more deliberate caress. He wants to feel Din’s fingers rake through his hair and dig into the flesh of his scalp in a secure, confident hold. He wants it so badly that he actually has to yank up some very quick and shoddy shields, lest he corrupt the innocent baby wriggling closer to rest his head on Luke’s thigh.\n“I’m kind of kriffed, Grogu,” Luke whispers to the baby after Din has left.\nGrogu says, knowledgeably, “Blebleble,” and his eyes slowly blink closed. Luke means to stay awake for at least a little while, to make sure that the baby is safe, but it’s so hypnotic, watching him breathe, that very soon Luke, too, is fast asleep.\n~\nLuke and Master Kenobi hike out to the landing dock at sunset to update the Council from the holoprojection suite on their ship. It’s very disorienting to walk out of Sundari’s false gloom straight into the full force of the actual sunset. Mandalore’s sun is huge and there are no clouds to obscure it as its enormous red mass sinks below the horizon. Luke feels scalded under its gaze, the skin of his face hot and scraped raw by the sand.\n“How are you feeling, Luke?” Master Tano asks, after the negotiations have been discussed in depth and everyone agrees that Master Kenobi’s progress seems promising.\n“I’m fine,” Luke says. “It was just exhaustion.”\n“--and vacuum sickness, muscle tearing, third-degree burns, and a concussion,” Master Kenobi finishes waspishly.\n“And now I’m fine,” Luke says. “My shoulder’s nearly good as new.”\nMaster Tano rolls her eyes so hard that her holoprojection momentarily fuzzes out. Before she has the chance to say anything too mean, Grand Master Yoda cuts her off. “Seen the child, you have. Your thoughts we would hear.”\nLuke instinctively straightens under the Grand Master’s inquisitive stare. “Grogu? Uh, I don’t know what I could add that wasn’t in Master Kenobi’s initial report. He’s very--I mean, he’s a baby? He’s a good-humored, curious child. I don’t know how long he was with Maul, but he doesn’t feel touched by the Dark side, not really. It’s clear that he loves his father.”\n“To forming attachments, he is prone?” the Grand Master prods.\nLuke says, “I mean, to his dad, yes?”\n“Yes,” Master Kenobi smoothly interjects. “He’s attached to Luke already, it’s quite clear.”\nAll of the masters turn their intense attention on Luke, who suddenly feels like he’s trapped in the crosshairs of a full battalion of battle droids. Luke’s face flushes. “He’s just a friendly little guy. I think he hasn’t known many other Force-sensitive beings.”\n“The child used Force healing on Luke the day they met,” Master Kenobi tells the Council, dry as dust.\n“Evidence of attachment, that is not,” the Grand Master says, putting both hands on top of his gimmer stick and sighing with his whole body. “But troubling, it may be.”\nMaster Koon says, “The question of attachment aside, there are also security concerns. Can the child be left on Mandalore safely?”\nMaster Secura barks out a low laugh. “The only place in the galaxy he’d be safer is the Temple. They are feral in their protection of their young, those Mandalorians.”\n“I concur,” Master Kenobi says. “Although Luke stepped in to handle those bounty hunters, the Mand’alor is demonstrably a capable warrior. That said, I think it would be wise to open an investigation into the activities of this individual known as Gideon. If he is interested in obtaining Force-sensitive children, the Order must know.”\n“Concur as well, do I,” Master Yoda says. He slams his gimmer stick twice on the floor. “Investigate, we will. Your recommendation we will consider, Obi-Wan. Stay with the Mand’alor, the Child will for now.”\nLuke and Master Kenobi murmur their agreement and bow in unison as the holoprojection cuts out abruptly. The lights in the suite flicker and dim as the recording software automatically powers down. Luke feels a little disoriented; it takes him a moment to realize that it’s because the architecture in the ship is so delicate and curving, designed to mimic the aesthetic of the Jedi Temple. Luke’s gotten used to the stark, blocky architecture of Mandalore over the last few days.\n“The Mand’alor asked me to recommend a tutor for Grogu,” Luke says. \nMaster Kenobi hums thoughtfully.\n“I think it’s easy to get along with Grogu,” Luke says, “but this political situation seems kind of precarious. It’d have to be someone who can take care of themselves. Maybe a monk from the Temple of the Kyber--they’re hardier than most of the other orders.”\n“They’re capable warriors,” Master Kenobi says agreeably, “but I’m not sure a Guardian of the Whills would suit this task. They’re rarely more than slightly Force-sensitive.”\n“It would be a very bad idea to assign a knight or a master to this,” Luke says, starting to feel a little agitated. “Politically, I mean. Wouldn’t it? Like the Order is overstepping its bounds, supporting one political faction over another instead of serving as independent mediators.”\n“I suspect it could cause problems, yes,” Master Kenobi says.\nLuke’s neck feels tight. He twists it until the vertebra audibly cracks and when that doesn’t quite fix him, he begins to pace. It’s only ten steps to cross the width of the holoprojection suite. “It would be so much safer if the two of them came back to Coruscant. But they can’t, not really, because Din--he’s going to be a good Mand’alor, isn’t he? That’s what you were after, with these meetings. You were trying to convince him to stay and take on the job.”\n“It’s a thankless one,” Master Kenobi says softly. “But yes, I believe he will serve his people capably.”\n“He’s strong enough to please the martialists, righteous enough to keep the New Mandalorians in line, and his creed won’t allow him to stand for the subjugation of the troopers. He has the best chance of uniting this planet, doesn’t he?”\nMaster Kenobi says, “The will of the Force seems rather unambiguous on this point.”\nLuke continues, almost fretfully, “Grogu has a huge heart. It has to be the right tutor, someone who understands that he doesn’t need to repress anything, just--temper it. Forge it into real compassion, not the kind of benign benevolence that so many Jedi seem to think is an acceptable substitute.” He shoots Master Kenobi an apologetic look over his shoulder as his feet continue their furious pacing. “No offense, Master.”\n“I don’t disagree, Luke,” Master Kenobi says.\n“Master Windu used to tell me that releasing your emotions into the Force was only one way of interpreting the Jedi Code. He invented Vaapad because he found he could achieve peace by fully experiencing his emotions and then absorbing them back into himself--I always used to call it his ‘closed system.’ It can be dangerous, if you don’t do it properly. But if you can, it opens you up so much.” Luke’s shoulder twinges; he reaches up with his cybernetic hand and presses against a knot forming in the muscle just behind his neck. “I think that would suit Grogu, don’t you? True understanding of the self. Deep compassion.”\n“I think it would be a rare master who could train him,” Master Kenobi says.\n“Master Windu could have,” Luke says morosely.\n“Isn’t it fortuitous, then, that Mace’s last student has yet to take a padawan?” Master Kenobi replies.\nLuke snorts. “Be serious.”\n“I am,” Master Kenobi says mildly. When Luke shoots him an irritated look, Master Kenobi is sitting in his council chair, legs crossed with nonchalant grace. He looks very relaxed and not at all like a person who just suggested that Luke--\n“Are you saying I should leave the Order?” Luke squawks, stumbling to a standstill. “Am I really that terrible of a Jedi?”\nMaster Kenobi’s eyes are very gentle. “No, Luke,” he says. “I think you’re an exceptional Jedi.” He smiles and tilts his head, hair falling across his forehead. No wonder they’d made him one of the faces of the Grand Army of the Republic during the Clone Wars--he looks like the poster child of a Jedi, wise and dignified and handsome. “It’s been years since I’ve seen you at peace, Luke. What do you feel here that you don’t on Coruscant?”\nLuke frowns at him. “I--don’t know?” \nBut that’s not quite true. Master Kenobi’s expression of benevolent patience suggests he knows as much. For a few seconds, Luke struggles to grasp what has been eluding him for the last several days--what feeling has he failed, again and again, to recognize and release to the Force? It clings to him with ferocious intensity. Attempts to identify it as lust or fascination have failed. Is it passion? Is it  love ? But it resonates in him too deeply to be anything so selfish or tempestuous.\n“There’s harmony here,” Luke hears himself say. \nMaster Kenobi smiles, then. “Yes, Luke,” he says. “I had suspected as much.”\n~\nUnusually, it was just before sunrise when Master Windu woke Luke and took him down to the salle, the sconces in the hallway set to half-light and the cleaning droids scuttling through their rounds like mice. He unclipped his lightsaber from his belt and put it on the floor in front of his knees as he settled into a meditative posture. Luke mirrored him, sleepy and confused but still game for whatever this would turn out to be.\n“Tell me about harmony, padawan,” Master Windu said. “Eyes closed.”\nLuke obligingly snapped his eyes shut. “It’s the opposite of chaos,” he said.\n“Yes,” Master Windu said drily after a few seconds of silence. “What else?”\n“It’s kind of like resonance,” Luke tried. “One thing can’t have harmony, it has to be lots of things, working together. Like a musical chord.”\nWith Luke’s eyes closed, he found himself automatically reaching out to the Force, trusting it to serve as a kind of vision. His master, as always, read in the Force as unyielding and self-contained. He did not radiate very much, not like Leia or Master Kenobi, who was always giving his emotions over to the Force like one of the fountains. Master Windu reminded Luke of the deep underground lakes on Ilum, which Luke was in a good position to know because he’d fallen into one during his quest for a kyber crystal a few years ago.\n“Chaos is when things push against each other, when they’re in conflict. Harmony is being different but still working together. Like when Leia and I were partners in Master Kenobi’s seminar and had to write a poem together and she wanted it to be about tooka-cats and I didn’t.”\nSomething faint leaked out of Master Windu like a tendril of smoke. Luke didn’t have a chance to identify it before it disappeared. “Yes,” his master said, voice a little strangled. “That’s a good metaphor. Have you been able to find harmony in your saber work, Luke?”\nLuke frowned to himself. “I tuned my kyber crystal so it sounded right.”\n“Harmony between yourself and your saber, yes,” Master Windu said, in the leading way he did when that meant Luke had only managed part of the answer.\n“Do you mean between me and my opponent? Isn’t the point of fighting to win? That doesn’t seem very harmonious,” Luke said.\n“So the goal of fighting with a lightsaber is to make chaos,” Master Windu said.\nLuke said, “Yes?” And then, “Wait, no, that can’t be right. If a fight is chaotic, that means it’s uncontrolled, and other people could be hurt.”\nMaster Windu did not answer. So Luke was right, maybe, and just needed to keep going. He scrunched his eyes tighter, trying to focus, to  understand .\n“Harmony is about different things working together--so, it’s opponents working together? To end the fight? That’s the common goal. Or to have fun,” Luke added, thinking of how often he and Leia found themselves in the salle just experimenting with the different forms. Leia really liked Makashi but she thought it was too impractical to specialize in so she’d only practice it with Luke when they were goofing off. “Is this about picking a form, Master?”\nMaster Windu released a bubble of something small and fiercely effervescent into the Force. “Yes, Luke,” he said.\n“Harmony through a form,” Luke mused. “So you want to tune your body like you tune a kyber crystal?”\nMaster Windu said, “You can open your eyes.” When Luke blinked a few times to clear his vision, Master Windu was already rising to his feet. “When I was your age, Luke, I preferred Djem So. It was a rational choice. I’m taller and stronger than most humanoids.” Luke couldn’t help frowning a little. “What’s the matter?” Master Windu asked.\n“I was just thinking of Leia,” Luke admitted as he unfolded his legs and made to stand. “She likes Djem So, too, even though she’s not tall or strong. But she’s rational, isn’t she?”\n“You tell me,” Master Windu said drily.\n“She’s rational,” Luke said more firmly. “She uses philosophy to win arguments all the time, even with Mom and Uncle Obi-Wan--that is, Master Kenobi. But she said that Djem So was right for her. Do you think she meant that it was harmonious?”\nMaster Windu said, “I don’t pretend to understand your sister, padawan, but yeah, probably.”\nLuke absently reached out and called his lightsaber to his hand. “I don’t feel that way about any of the forms, Master.”\n“I didn’t either,” Master Windu said. “Put your lightsaber over by the stands, Luke, we’re going to use practice sabers today. I don’t want you to worry about burns while we try something out.” Luke obligingly turned his palm and pushed his saber away with flex of his wrist, trusting the Force to put it down safely on one of the benches. “Like I said, I thought that Djem So was the rational choice.”\n“But you use Vaapad,” Luke said, suddenly making the connection and feeling incredibly dumb. “Is that why you invented it, Master? Because you didn’t harmonize with anything else?”\n“For the most part, yes. I needed a saber form that could follow me deep into my emotions, because that’s where I find my strength.” Master Windu called two training sabers from the display wall above the doors and Luke snagged the smaller one as it raced by his head, taking a moment to test the grip and feel its weight in his hand. It didn’t feel as nice as the saber that he’d built for himself, but it would be fine for a few hours of practice. “Where’s your strength, padawan?”\nLuke thumbed on the practice saber to check the blade length. “My Force sensitivity?” he said distractedly.\nMaster Windu hummed in the back of his throat, which meant Luke had missed the point. Luke turned off the practice saber and took a second to really think. “I guess I listen to the Force,” he said finally. “It tells me stuff all the time, like people that are important or things I have to do.”\n“You trust the Force,” Master Windu said. His eyes were soft in the corners when Luke looked up at him. “That’s pretty rare, Luke. It’s easy for us Jedi to say we understand the will of the Force without really trusting it.”\n“So when Master Yoda tells us that we have to submit to the Force?” Luke said.\nMaster Windu’s expression stayed stern but there was that bubble, again, fierce and effervescent and almost joyful as it joined the swirling eddies of the Force. “You just have to listen, Luke, and trust.”\n~\nLuke wakes up with the sun. \nHe lays in bed for a few extra minutes, luxuriating in the feeling of being truly mended--no headache, no deep pain in his back and shoulder--and then, like a sudden electrical shock, he remembers the previous evening. Perhaps Luke is too old to be seeking absolution from authority figures, but that doesn’t keep him from feeling deep relief at the idea of having been given permission.\nHe stumbles out of bed and pulls on the nearest clothes that he can get his hands on--tunic, trousers, tabard, belt--and then yanks on his boots. He calls his lightsaber to his hand when he’s already halfway across the room, clipping it onto his belt with an automatic, thoughtless motion. He’s out into the corridor before he remembers to think of personal grooming, but it’s too late by then to turn back. He rakes his hands through his hair, combing it back from his face, and hopes that’ll be enough.\nIt’s surprisingly easy to find his way back to Din and Grogu’s suite, between the colors of the doors and the beacon of Grogu’s presence in the Force. Maybe Luke is actually learning his way around this jakrab’s warren. It’s a warming thought.\nDin answers Luke’s third knock. He’s wearing a tunic and trousers, helmet and boots on, but none of the rest of his armor.\n“Did I wake you?” Luke asks, suddenly struck by this thought. He’d assumed, after seeing Din those mornings in Ne’tra Park, that he was an early riser like Luke, but maybe that had been incorrect.\n“Where’s the sling?” Din counters.\n“I can feel that it’s healed,” Luke says.\nDin says, “Blisk specifically said not to believe your mystical bantha shit sorcery,” and steps back, tacitly gesturing Luke inside of his quarters.\n“No offense to Blisk, but I know when I’m healed,” Luke says as he steps past him. “I’m good. Really.” There’s no sign of Grogu on any of the myriad chaises, but that’s not surprising; the baby feels like he’s dreaming, likely still tucked away in bed. Over by the wall of staggeringly enormous windows, a hard-backed chair is angled away from a table with a steaming cup of something next to an empty plate. “Sorry, I didn’t mean to interrupt your breakfast.”\n“It’s fine,” Din says shortly. “What’s wrong?”\nLuke turns to him. Din is only a few feet behind him, looking unbelievably approachable without his usual chest plating and pauldrons. He’s still taller and broader than Luke but in a much less physically overwhelming way. “Nothing’s wrong,” Luke says distractedly.\nDin tilts his head to the left in silent inquiry. It occurs to Luke-- now , however many days into their acquaintance--that interpreting Din’s gestures had come to him with such ease that it’s as though they share a common language. Luke had thought it was the Force. That’s always the safest assumption, when it comes to strange shit that Luke knows instinctively. But it is dawning on him, as the light begins to spill out onto the floor through those huge windows, that maybe it is something else entirely.\n“I’m staying,” Luke says abruptly. “Or, I will stay. If you’ll have me. I’ll tutor Grogu.”\nDin makes an aborted motion and then stops himself, hands clenching at his sides. “Your people told you to stay?” he asks stiffly.\n“No,” Luke says. “I’d take a leave of absence from the Order.”\nDin’s helmet twitches, very slightly, like he’d started to make that same inquiring gesture and decided against it at the last minute.\n“It’s not the same thing as leaving completely, but it’s--well, it’s kind of the same thing, but there’s a door that stays open for me to go back. If they need me for something.” Luke can’t help self-consciously rolling his eyes. “You know, Sith-killing Skywalker.” It’s tempting to just stay on this superficial level, let sarcasm carry him through, but Luke can’t quite keep his grip on the bratty act. “If I--if I get married, I’ll leave for real. That door closes.”\nDin does reach out, then. One of his hands grabs Luke’s right arm, just above the elbow. The other one slides under his left arm and anchors itself on his hip. “Luke,” he rasps.\n“It’s only been a few days, I know, I’m not--this isn’t--I don’t  expect --” Luke tries. He lifts his left hand and presses his fingertips against the edge of Din’s helmet, framing the transparisteel eye slit. He’s close enough that if it were clear he’d be able to see something of Din’s face, but the transparisteel is smoked and impenetrable. \nIt’s lucky, then that Luke doesn’t need his eyes to see the truth of Din.\n“I’d like to stay,” Luke manages.\n“Yes,” Din says, very, very quietly. In half an exhale his hand has gone from Luke’s elbow to the back of his head, cupping his skull. Luke feels a delirious clench, like Din’s hand is actually closing around his heart deep inside of his chest cavity. Din guides him forward with steady, inexorable pressure until their foreheads are touching. The beskar is cold against his skin. Luke has to close his eyes as he fumbles to grab the back of Din’s helmet, securing them together. When he inhales, it feels like he’s breathing in the sunrise.\nThey stand there for--five minutes? forever? not long enough--and then Din says, “After we’re married, you’re getting that hand plated with beskar.”"
}