{
    "id": "29507616",
    "url": "https://archiveofourown.org/works/29507616?view_full_work=true",
    "author": [
        "starlight_poprocks"
    ],
    "title": "Without Hesitation",
    "rating": "Explicit",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "F/M",
        "M/M"
    ],
    "fandoms": [
        "原神 | Genshin Impact (Video Game)"
    ],
    "relationships": [
        "Albedo (Genshin Impact)/Reader",
        "Albedo/Traveler (Genshin Impact)"
    ],
    "characters": [
        "Albedo (Genshin Impact)",
        "Traveler (Genshin Impact)"
    ],
    "additional_tags": [
        "Consensual Non-Consent",
        "Dubious Consent",
        "Mildly Dubious Consent",
        "consensual drug use",
        "Drugged Sex",
        "Aphrodisiacs",
        "Temperature Play",
        "Overstimulation",
        "Forced Orgasm",
        "Orgasm Control",
        "Multiple Orgasms",
        "Hand Jobs",
        "Blow Jobs",
        "Dubiously Consensual Blow Jobs",
        "Cunnilingus",
        "Come Eating",
        "Vaginal Fingering",
        "Anal Fingering",
        "Foreplay",
        "Desk Sex",
        "Rough Kissing",
        "Rough Sex",
        "Workplace Sex",
        "Excessive Come",
        "Semi-Public Sex",
        "Drunk Sex",
        "Intoxication",
        "Scent Kink",
        "Breeding",
        "Breeding Kink",
        "Plot What Plot/Porn Without Plot",
        "Biting",
        "Missionary Position",
        "Mating Press",
        "No beta we die like Rex Lapis",
        "Dirty Talk",
        "breeding talk",
        "Sexual Roleplay",
        "Roleplay",
        "Creampie",
        "Anal creampie",
        "vaginal creampie",
        "sex potion",
        "reader drinks horny juice",
        "Dom/sub",
        "sub!Reader",
        "Dragonspine (Genshin Impact)",
        "dom!albedo",
        "Top Albedo",
        "Sexual Experimentation",
        "experiment roleplay",
        "Aftercare",
        "Albedo is a Homunculus",
        "albedo has a breeding kink",
        "gender neutral reader",
        "Reader is gender neutral"
    ],
    "language": "English",
    "series": "Part 2 of Genshin Impact [Smut]",
    "published": "2021-02-17",
    "completed": null,
    "words": "8,610",
    "chapters": "1/1",
    "comments": "752",
    "kudos": "24,874",
    "bookmarks": "2,887",
    "hits": "1,754,557",
    "summary": "<p>Dragonspine is cold, and Albedo has a way to warm you up. </p>\n<p>(reader is gender neutral and no gendered terms are used)</p>",
    "notes": "<p>please read tags carefully!!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>albedo is obsessed with creating life and ur gonna look at me and tell me he doesn't have a breeding kink? im right. </p>\n<p>i wrote part of this while listening to taylor swift's 1989 if you can guess which part you can have a kiss</p>\n<p>please drop by my tumblr, starlight-poprocks! im open for requests, and id love to answer asks n stuff!</p>",
    "text": "Albedo’s laboratory camp is both cold and warm. Torches crackle and pop softly, making the cave walls glow orange tones, but there is no tent flap or anything of the sort to fend off the bursts of icy wind. The tips of your fingers feel almost numb, and you breathe on them to try and warm them up. \n“Here, let me,” the alchemist says, noticing you breathing hot air on your bare hands. He takes your fingers into his warm palms and gently rubs, utilizing the friction to bring life back into your frozen fingers. \n“Thanks,” you whisper quietly as you suppress a shiver. \nWordlessly, Albedo slips his arms out of his coat and drapes it over your shoulders. You pull it close like it’s a cape. “Won’t you be cold?” You ask. You desperately don’t want to give back the jacket. \nAlbedo offers nothing more than a mild mannered shrug. “I don’t get cold.” And he does not elaborate. \nOutside is a black void. Far away from the city lights of Mondstadt, the only light source you had were the flickering torches around the cave campsite. It smells pleasantly of firewood and charcoal, and you bring the collar of Albedo’s coat around your frost-flushed cheeks. The fabric smells like him and you find yourself closing your eyes to imagine him holding you. \n“You shouldn’t fall asleep sitting up.” Albedo’s voice makes your eyes snap open. His cerulean eyes are trained right on you, face buried in the neck of his jacket and all. \nYou hunch it over your shoulders to overemphasize your coldness, hiding within the cloth. “What, is it bad for you?” \n“It’s neither healthy or unhealthy,” Albedo supplies. “But it can be uncomfortable when you wake, and you’re likely to fall over in your sleep.” \nYou make a low noise absently. “I wouldn’t have been able to sleep anyways. Too cold.” You shoot a hint of a glance towards the alchemist, but his attention is already focused back on his work. \nThe sun set hours ago. In fact, it was probably closer to dawn. “Albedo, take a break,” you call softly to him. “At least come warm me up for a bit?” \nYou hear the slight  clink of a glass beaker being set down on the wooden table as Albedo seems to contemplate your request. When Albedo turns to look at you, you’re holding open the jacket as a silent invitation. \nHe dips out of sight for a moment, retrieving something from a drawer behind the wooden table. You hear the sounds of glass vials tinking against each other. Albedo stands up, holding a bulb shaped potion bottle by the cork. He swirls it and you see the viscous liquid slosh inside. It’s deep red like blood, but shimmers like glitter is in it.\n“This will help warm you up,” Albedo explains, passing you the bottle as he sits on the log beside you. You stare at the bottle as if it’s the most enthralling thing you’ve ever seen, heart in your throat. “Go on. Drink.” \nYou waste no time popping the cork off the neck of the bottle and downing it in one go. It goes down thick like honey, leaving your mouth with a strange heady aftertaste. You gulp, and it warms your throat as it goes down. \nAlbedo gives a soft, low chuckle dripping with deceit. “You really just drank a mysterious potion without hesitation?” He lifts your chin to him, thumb resting just under your lips. “How adorable.” \nYour heart pounds wildly in your chest, making your head throb. With a few steady breaths, you manage to get it to settle down. You stretch your arm over Albedo’s shoulder to get his coat to encompass the two of you and use it to scooch closer to him. Your thigh is pressed close to his, and you inattentively tap your knee against his. \nAlbedo lacks any meaningful body heat to warm you up, remaining a neutral temperature even in a frigid environment such as Dragonspine. Lucky for you, whatever was in the potion seems to start to seep into your system. Your cheeks are pricked with intense heat, and all of your muscles seem to relax slowly. You sink into him all at once, shifting so you can lay your head on his chest. \nBefore you realize you’re doing it, your hand travels up the alchemist’s chest and to his neck. His breath hitches in the back of his throat as your fingers ghost across his diamond shaped mark. You turn his jaw toward your face and crane your head up to lock him in what you intended as a lazy kiss, but turns out much more fervent than you expected. \nYou lean forward helplessly as Albedo pulls away, watching coyly as you fall short. “So needy,” he teases. He runs a hand through your hair and down to cup your cheek. His thumb brushes your bottom lip, and you close your lips around the pad of his finger without thinking. \nEverything feels like it's moving at a different pace, as if you’re moving too fast and everything else is slow in comparison. You try to form coherent thoughts, but all you can think about is how warm you feel. The gusts of chilly air are no longer annoying, but a cool relief. Your cheeks pound dully, flush spread across your face to your neck and the tips of your ears. \nYou blame the heat in your cheeks on the warmth radiating from the fire. Albedo slips a hand around your waist to pull you into him and you melt into his touch. His free hand twirls a lock of your hair between his fingers absently, your mind wandering as you stare at the fire reflections dancing on the walls. \nAn eternity seems to come and go and you feel as if you’ve been slowly boiling in a pot. The heatwaves overwhelm you, making your head spin and breathe heavily through your nose. \n“Ah- hot…” you mumble, pulling your way out of Albedo’s coat draped across the two of you like a blanket. You try to stand, but your equilibrium fails you as everything goes slanted. Albedo catches you as you stumble, a ghost of a smirk on his lips. \nHis face is a hair’s breadth away from yours, teal eyes dancing with the fiery colors of the hearth. “You should be more careful,” he whispers against your neck and the shiver goes straight to between your legs. \nYou pant under your breath as Albedo presses featherlight kisses along your neck and jawline, making you squirm in his arms. “Ah- hah… Albedo…” Forming words feels overcomplicated. \n“You’re so vulnerable right now,” Albedo murmurs, left hand sliding down to grab the plush of your ass. “I could do anything I wanted to you.” \nSo close to you, you can smell the faint mustiness of chalk on the alchemist, an ever present dull scent that was so very  him. A whimper escapes you before you can stop it, practically liquifying in his arms. \nAlbedo gives a low coo. “You’d like that, wouldn’t you?” His hands move at a deliberate snail-like pace as he strips you of your shirt, slowly undoing the buttons before finally it slides off your shoulders and onto the ground. \nIcy wind hits you and you sigh as the cold cools the heat under your skin. You’re standing with shaky legs, supported by Albedo’s weight as his warm tongue trails over a hard nipple. You tremble and whine, but Albedo just steadies you and nips at you. A brief flash of pain makes you gasp as teeth connect with sensitive skin, and the sensation is sent directly to your groin. \nYour legs wobble involuntarily and your head feels filled with a thick haze. Albedo only chuckles. “Look at how helpless you are,” he purrs. He scoops you into his arms and turns to set you on the edge of one of the tables. \nThe second your weight is fully on the table you go limp, falling back onto your elbows. Your arms wobble with effort and fall weakly out from under you as you pant softly. \n“What a willing little test subject,” Albedo hums thoughtfully. “If I didn’t know any better, I’d say you knew what was in that potion and still drank it.” \nYou can’t help but make a pathetic noise crossed somewhere between a sigh and a whimper. Albedo’s gaze is firmly locked on you, analytical eyes scanning all over you. You feel hot under his intense stare. Your mouth feels dry and sticky, and your tongue sits like lead. \nPounding frantically behind your ribcage is your erratic heart, threatening to burst out. Short, hot breaths land on Albedo’s neck as he peppers kisses over every inch of your exposed chest. You want to reach a hand to run through his hair, but your arms have never felt heavier. \n“Your heart is racing,” Albedo whispers, lips pressed softly against your pulse on your neck. “Do you fear what I will do, or are you just enjoying this that much?” His teeth sink into the groove of your neck and you have just enough energy to whine. \nWhen he finally pulls away, cold air meets the bite-marked hickey, and you can feel it throbbing dully. Your head feels both light and stuffed at the same time, and your entire body is burning from the inside out. \nThe ache between your legs is almost unbearable. You muster up enough strength to grind your hips up against Albedo and you feel him smirk on your collar bones. \n“How cute,” Albedo chides. “Do you really think you are in charge here, even like this?” He strokes your cheek, and you croon into his gentle, dainty hand with a soft plea. A soft sigh escapes the alchemist. “Oh, no matter,” he says in a resigned manner. “I am unable to resist you either way.” \nIn one fluid motion, the lower half of your body is wholly exposed to the chill, clothing tossed elsewhere. The cold air hitting your wet sex makes you tense up, knees trembling. Albedo’s smooth hands steady your knees and slowly spread your legs open. \n“Hm, interesting,” Albedo notes. He slides two fingers along your sex and shows you the clear fluid of your arousal. “It would appear the aphrodisiac is more potent than I originally thought.” You can feel it dripping down your legs. \nHe uses your own slick to lubricate you, fingers just barely ghosting over your over-sensitive body. You twitch and choke back a whimper. Albedo peers down at you. \n“I’ve barely touched you,” Albedo says in a low voice, almost devious. “Are the effects heightening your sensitivity?” \nTo test his hypothesis, the tip of his index finger grazes along your sex, hardly even making contact. Nonetheless, the touch sends electricity through you and you can’t stop yourself from sucking in a sharp gasp. Albedo looks thoroughly fascinated in a way that makes your throat go dry.\n“I’ll keep that in mind for next time,” Albedo mutters.  Next time? Your heart skips a beat. \nBefore you can clear the fog settled in your head to speak, Albedo’s warm mouth closes gently around your sex. All of your sensations seem to focus there, your body practically in pain with desperation for release. \n“Ah- Al… bedo,” you pant needily. “Nnh… please… it  hurts.” You squeeze your eyes shut, feeling the urge to cry. \nThe alchemist licks his lips thoughtfully. “Tell me,” he asks, “are you in physical pain?” \nWith a rush of energy, you nod fervently. “Yes, yes, it… it hurts, please.” You regard him with misty eyes. “I- I need it.” \nAlbedo raises an eyebrow. “Need it? Do you mean to tell me you aren’t enjoying the pain?” A hand travels down the soft skin of your thigh and he pinches sharply with his nails. “If I recall correctly, and I do, you enjoy the thrill of pain mixed with pleasure.” \nYou whimper and writhe weakly, trying to search out any sort of touch or satisfaction. Albedo inspects you coldly for a minute before he speaks again. \n“I’ll ask again,” he says. He looms over you and grabs your jaw tightly in one hand. “Do you like the pain?” \nWith a choked exhale, you blink slowly and blearily up at the alchemist. “Yes, I…” you pant, flushed and disoriented. “I want it to hurt.” \nAlbedo lets go of your jaw and your head falls back. “As I suspected,” he says with cool satisfaction. “However,” he continues, settling back between your legs, “delaying your gratification is not the focal point of this experiment.” He fixes you with sly, half-lidded eyes. “It’s to see how much you can take.” \nYou fail to hold back a breathless moan as Albedo wastes no time working his mouth on you. “I can feel your pulse down here,” he teases. “It’s almost like a second heartbeat.” \nWith little to no verbal filter, Albedo was remarkably adept at dirty talking. You wondered at times if he never experienced such a thing as embarrassment or shame. Your train of thought is a blur of incomplete thoughts and silent pleas you don’t have the energy to vocalize as Albedo draws out uninhibited moans from you. \nAttentively, Albedo is committed to pleasuring every inch of your sex so much it starts to be too much at once; his hot mouth, his wet tongue, smooth fingers, all unrelenting. Barely able to move, all you can do is whimper and moan as you weakly squirm from the stimulation. \nWith the only thing you feel capable thinking about being your pleasure, you’re able to fight through the fog for a moment to reach a hand out to the alchemist as you approach your climax. Your arm feels heavy, and your hand tingles as you stretch out to him as far as you can. \n“Nnh- ah- Albe- Albedo-” you stutter out. “I- hah… cl- close…” You’re vaguely aware of your slight incoherency, but judging by the way his expression changes, he only seems more captivated by you. \nHis free hand comes up to meet yours, soft fingers rubbing your knuckles in such a gentle way it makes your heart burst. You squeeze his hand as your orgasm crashes over you like a tidal wave, hips shaking weakly as you cry out. \nAll the while, Albedo’s mouth stays on your sex, even as you twitch from the aftershocks. At first it’s nice, riding you through the intense orgasm, but it quickly turns to overstimulation making you tense up. \n“Ah, ah, too- too much,” you whine. Your whole body feels like it’s glued to the table you’re laying on, or weighed down by some invisible force. \nYou feel Albedo glance up at you, your head thrown back and sex quivering under him. His tongue does not ease up. Albedo continues to overstim you, and once the uncomfortable sensation gives way to pleasure again, your protests die. \nYou thought your second orgasm would satisfy him. It does not. Albedo does not falter or slow, not even to breathe, as you shake feebly and moan shrilly. Your body still feels like it’s burning from the inside out, a sheen of sweat shining on your forehead and chest. \nEven though your body zings with the overloading sensations, you feel yourself aching for more. Your brain is practically jelly, focused only on the fire inside and the way it hurt so good. Albedo regards you with piqued teal eyes, drinking your every reaction to his merciless mouth.\nOccasionally, Albedo would hum to send vibrations through your nerves, making you sigh in pleasure. Gravity pulls on you, keeping you in place on the table. Although, as your extremities tingle with numbness, you dully wonder if it’s got something to do with the drug. \nYour moment of clear-thinking is quickly extinguished as a third climax makes you babble senselessly, panting and weak all over. Albedo graces you with languid strokes of his tongue through this orgasm and you finally feel like you’re able to breathe. \nChest heaving as you start to relax, you hear Albedo give a quizzical noise. “Did you think I was going to stop at three?” He asks. “There’s still more data to collect, my little lab rat.” \nYour heart squeezes at the pet name. Fond and affectionate, but at the same time so… dehumanizing. It makes your arousal spike once again, serving as fuel to the hedonistic desires blazing just under your skin. \nTime warps and stretches, making your head spin. You swear you can feel your blood boiling,  literally, in your veins, and the edges of your vision spot. Your eyelids flutter as you lean your head back, legs limp and weak. \nDespite your sex aching with overstimulation, begging for mercy, there’s something primal crawling in you making you yearn for more. Your heart hammers wildly against your chest, echoing in your ears and you can feel your pulse throbbing in your hot cheeks. \nYour moans grow weaker as numb exhaustion and overstimulation take over, but that doesn’t stop Albedo from continuing his onslaught. His neatly done braids are loose and unkempt hanging in his face now, and you want nothing more than to tuck the platinum strands behind his ear. \nWithout taking his attention off of you, Albedo sweeps a hand through his hair and lets it fall on either side out of his eyes. You lock eyes for a moment, and he looks thoroughly focused on you. So absorbed in his inhuman beauty, you failed to realize the rising feeling of your orgasm. \nYou tense weakly as your legs fall off the edge of the table, but Albedo grabs your ankles and props them up on his shoulders. His tongue swirls around every sensitive spot as he drinks up your arousal and the soft, lewd noises escaping you. \nAlbedo’s mouth leaves your sex, and you’re filled with both relief and disappointment at the same time. He licks his lips, swiping a finger over his top lip where evidence of your last orgasm remained. His eyes remain locked on you, panting heavily, as he sucks your fluid off his finger. \n“You taste sweeter,” he remarks in a low voice. Slowly, Albedo climbs onto the table until he’s looming over you. “Care for a taste?” \nWithout waiting for an answer, Albedo’s tongue pushes into your mouth and you melt into his passion. A sharp mewl is swallowed up by his mouth on yours as one of his hands travels down your abdomen to stimulate your sex again. \nYour head feels light as oxygen leaves you and your toes curl as Albedo hand strokes you mercilessly. You gasp for air softly as Albedo lets you catch your breath. He hardly looks put out. A trail of saliva stretches from your tongue to his as you pant open-mouthed, but the alchemist merely looks amused at your lust-hazed expression.\nHe curls his palm against the throbbing pulse within your sex and you try to squirm away to no avail. “Too weak to move away or struggle,” Albedo coos into the shell of your ear. His breath is warm on your neck. “Yet you persist.” \nThe edges of his teeth scrape across the soft skin of your collarbones and neck, occasionally stopping to tenderly suck up a hickey. His hand does not relent, and as your hips twitch with the telltale sign of an impending orgasm, Albedo eats up your moans by sealing you in a kiss. Your squeals go unheard as his tongue sweeps against yours, making your mind go blank. \nAlbedo’s hand fucks you through your aftershocks once more, and his mouth leaves yours when you stop trembling under him. He raises his hand to you, stained with the aftermath of your orgasm. \n“Ah, what a mess,” he sighs. “One should clean their own messes, don’t you think?” \nHe brings his hand to your mouth and you obediently open to lick his fingers clean slowly and thoroughly. You curl the tip of your tongue over every digit with mindless precision.\nYou realize you really do taste sweeter than usual; it’s not the first time you’ve tasted yourself off Albedo’s tongue or fingers. The alchemist has something of an oral fixation you didn’t mind fulfilling. For a split moment, you’re graced with clarity as Albedo pulls his fingers from your mouth. Lazily, you press a featherlight soft kiss to his fingertips and regard him with a truly helpless look in your eyes. \n“Mm, how can I deny you when you look at me like that?” Albedo hums softly, stroking your cheek with the back of his free hand. \nAlbedo hops off the table and settles himself between your legs again, sex still sensitive. You expect his tongue, so when you feel a finger probe at your hole, you squeak in surprise. \n“Don’t worry, I will prepare you adequately for me,” Albedo assures you. “After all, I don’t want pain to overshadow your pleasure.” \nThe first finger slips in with ease, slowly moving in and out as his tongue licks teasing strokes up your sex. He uses just the one finger until he’s satisfied with the sounds of your impatience and they way your hole flutters in want. \nAlbedo allows you a second and you feel somewhere between satisfied and yearning to feel full of him. He scissors his pointer and middle finger open and close, making low hums against your sex as you clench against his fingers. \nYou’re murmuring nonsense, feeling like you’re on the verge of tears. Sometime during fingering you, you came again, but the pleasure was lost to the way Albedo teases. Your thoughts jumble together into one big indecipherable mess, but you couldn’t care less. \nA third finger finally enters you and Albedo deliberately probes the tight bundle of sensitive nerves inside you. You keen into him just barely, overwhelmingly hot and burning for it. He indulges you and your orgasm crashes over you a lot harder than you expected. You moan and cry from the back of your throat, and Albedo has the decency to slow his movements down a moment. \nAn entire lifetime passes you by before you’re given a chance to recover. By then, you’ve stopped counting how many times Albedo has forced an orgasm out of you. Your gaze falls out of focus, everything going fuzzy around the edges. \nThe alchemist notices your lapse, and you see him stand to look down at you. “You’re hardly lucid,” Albedo remarks. His voice is gentler. \nClarity jolts through you at the hint of finality. “No, no, no,” you ramble out pathetically. You struggle and fail to sit upright, the potion still making it feel like your bones are filled with lead. \n“Tell me then,” Albedo whispers along your jawline, leaving small nips. “How many times have you cum?” \n“I- I…” you falter, trailing off. You lost count somewhere after eight. You sigh weakly and let the back of your head fall back onto the table with a soft thud in defeat. \n“Ah, I expected you to lose count anyways,” Albedo says with amusement. His breath tickles the shell of your ear. “Fourteen,” he breathes. It sends a shiver down your body. “Do you think you can take more?” \nYour head spins. Between your legs twinges with overstimulation so badly, there’s a part of you that never wants to cum again. “C- can’t,” you whimper. But even so, the heat pulsing throughout your body says otherwise. \nAlbedo shakes his head. “I'm afraid that’s not the correct answer. Want to try again?” \n“It’s- hah…” you pant, heatwaves scorching every inch of you. “...too- too mu- ah…- uch.” \nAlbedo tsks. “Incorrect again. No matter,” he shrugs. “I’m finished with the first part of my experiment.” \nThe alchemist turns away from you and you can hear the sound of fabric shuffling and papers being thumbed through. “Orgasms thirteen and fourteen had a refractory period of thirty-two minutes between them. Twelve and thirteen had sixteen minutes between them. This pattern suggests further stimulation would take an hour to reach a fifteenth orgasm without the introduction of new stimuli.” \nHis musings go in through one ear and out the other, and you’re dully aware of the scrawling sound of pen on paper. Even though you’re going in and out of lucidity, you’ve always found his habit of talking aloud while writing down his findings adorable. \n“Onto the second phase.” \nYou hear the telltale sound of pants being unbuckled and the cloth and belt hitting the ground. There’s the sound of a drawer being opened followed by a cork popping off and a squelching noise. \nWhen Albedo walks back into your field of vision, there’s an uncorked glass bottle of what looks like clear, pale blue jelly in one hand. In his dominant hand, is his erection, coated in the jelly. \n“Wha…” you mumble, blinking in confusion. \n“Oh, this?” Albedo tilts up the bottle for you to see. “It’s lube, made from cryo slime concentrate. It’s quite cold.” \nIf he finds the lube cold, he does a remarkable job of hiding it, although you doubt it’s really affecting him significantly. He sets the bottle down on a wooden crate and picks up his jacket. \n“You will want this,” he says, handing it to you, as if he expects you to sit up and grab it. \n“H- hot…” you manage to pant out. Without his touch searing you, the warmth builds inside your body, making you dizzy and mindlessly lust filled\nAlbedo ignores your weak protest as he lifts your arms through the baggy sleeves and flips the hood over your head. “I can’t have my results tainted if my test subject refuses to cooperate,” Albedo says icily. His tone spears you through the heart. “So be a good little specimen, won’t you?” \nHe takes your choked whine as agreement, tilting his head to admire you. Under his analytical gaze, you feel something like a cadaver on an examination table, enforced by your immobility. You find yourself entranced by his lovesick eyes, following the shape of the alchemical symbol in his irises. \nLeaning over the table, Albedo holds himself up with one hand planted on the surface while the other lifts your chin briefly to lock lips. Every thought you had disappears as you melt in his mouth like milk chocolate. You feel his dominant hand ghost down your navel, and shiver shoots through you as the tip of his cock pushes against you. \nAlbedo lines himself up against your entrance, slowly probing his way in. The chill makes you tense, and your hole practically pulls him inside. Albedo groans into the kiss and you squeal in surprise at just how cold he feels inside of you. \nYour entire body seizes up when he bottoms out in you, pale hips flush to your skin. His cock feels like it’s made entirely of ice, making goosebumps prick up your arms and nipples harden. You suppress a shiver, pulling your shoulders together to hide within his warm jacket. \n“You’re so far gone you can’t even say no,” Albedo whispers on your kiss-swollen lips, teeth lightly biting at your bottom lip. You whine highly in your throat and muster the strength to lift a leg and try to nudge him away with your foot. \nAlbedo looks amused, eyes alit with inquisitivity. Your heel weakly pushes against his abdomen, and you flex the muscles in your hole to try and push his cock out of you.\n“You’re going to skew the results,” Albedo growls on your neck. His teeth meet your throbbing pulse and bites hard. He grabs your ankle and lifts your leg up on your shoulder. The angle puts strain on your adductor muscle and you cry out. \n“Ah- ow- ow,” you whimper, but what little movement you had regained in your limbs has already been spent trying to fight Albedo off you. \nAlbedo brings his hand and gently massages the cramped muscle. “Don’t worry,” he mutters. “I won’t put more pressure on your muscles than they can handle.” \nHe lets you relax your leg and the soreness fades away quickly, but before you can breathe a sigh of relief, Albedo begins to move in and out of you. You squirm pathetically under him, but one hand planted firmly on your shoulder is enough to keep you in place. There’s no pain as your body grows accustomed to the feeling of his cock buried to the hilt inside of you, but the chill feels as if it’s pooling in the pit of your stomach.\nYou’re wet, warm, and velvet soft around Albedo’s cock, taking him to the base with greed. He picks up a rhythm, rocking his hips into you steadily as the table creaks under the movement. Usually a consistent noise like that would be annoying to you, but the only thing on your mind was the primal lust making your core throb. \nHis length moving in and out rubs you in just the right way that you find yourself panting soft, breathy moans as you start to teeter on the edge of an orgasm. The table shakes as Albedo picks up his pace and your eyes roll backwards in mindless bliss. You weakly reach for his arm, but there’s no vitality left in you to try and push him off you. \n“There’s no point in fighting me any longer,” Albedo grunts out through his thrusts. “You’re helpless.” \nYou can’t stop yourself from clenching down on him as your body quivers with a dry climax, spent from his torture earlier. Albedo lets out a heavenly moan as you tighten around him and his hips slam into yours and stay there. \nWarmth spills into you, contrasting the coldness of his cryo lubed cock. The sensation makes your chest swell with satisfaction as you feel Albedo’s member twitching in the deepest part of you. He stays buried deep in you for a few moments and you remain blissed out. You come back to reality when you feel him pull out of you, and his seed starts to drip out. \nA pathetic whimper slips past your lips, distraught at the idea of any bit of his release escaping you. Your hazy mind begs you to push it back in with your fingers, but that invisible force is still weighing down on you. \n“I don’t plan on letting any of my seed leak out of you,” Albedo hisses softly as he uses the head of his cock to trace up the dripping fluid and ram it back into you. A cry leaves you as Albedo starts jerking his hips with intensity once more, lubed up with cryo slime lube again.\nYou feel so hot you’re cold, and so cold you’re hot. The conflicting temperatures coursing through your body make your head and cheeks throb in time with your pounding heart. You can feel beads of sweat dripping down your forehead and the back of your neck, while Albedo’s only sign of debauchery is his undone hair. \nHis lips smash into yours and you pliantly open your mouth to welcome his tongue in. Air slowly leaves your lungs as Albedo’s fervent kiss fries your train of thought. You try to grunt and moan, but any sound you attempt to make is swallowed. \nYou feel Albedo smirk against your lips as his hips grind into yours and he relishes every breathy noise you make. You can’t form coherent thoughts anymore, only feel the way the alchemist hits your sweetest spot with every calculated thrust. \nAlbedo is never one for being outwardly emotional, but the loving expression on his face gives away the way he’s worshipping every noise you make. His bright teal eyes shine with adoration, never looking away from the delirious faces you’re making. It’s as if he’s etching every twitch of your eyebrows and quiver of your lips into his memory. \nHis satiny lips press into the crook of your neck and you feel him groan deeply into your skin, his pleasured shudders rippling through your body. Albedo’s breath quickens and you feel the light warmth tickle your neck. You feel another warmth, deeper within you as Albedo bottoms out and keeps himself there as he empties out in you again. \nIt’s only a matter of seconds until Albedo is moving again, working slowly back up to his fervent pace. His stamina never ceases to impress you, but your surprise lasts only a moment before you’re a panting mess once more. \nAlbedo shakes out a coin sized portion of the cryo lube into a palm and spreads it over his hands. Before you can even think to wonder what he’s doing, his ice cold hands stroke up your chest and you gasp under your breath. The heat pulsing under your skin clashes with the cold substance making your chest shine with the clear fluid, and you give a high-pitched whimper. \n“Too cold?” Albedo muses, twisting a pebbled nipple between his fingers. The chill makes it perk up even more. “I didn’t give you my jacket for nothing.” To emphasize his point, he takes each side of the collar and brings it closer to you like it’s a blanket. \nHis scent is heavy on the material and you breathe it in like it’s a drug. There’s the faintest hint of chalk dust, but most of all, it smells like fresh lavender and old books. You bury your nose in the cloth and inhale his scent, feeling as if he’s embracing you while making love to you at the same time. If it wasn’t for the aphrodisiac, you could swear you could get high off his scent alone. \nYou hear Albedo mutter a curse under his breath, a rare occurrence for him to swear, but you understand why when you feel a rush of his cum flood you. You can feel him spasming inside of you and there’s still some coming out. It’s inevitable that some beads out and drips down your ass and down onto the ground, but that doesn’t stop a disappointed noise from leaving you. \n“Shh, shh,” Albedo hushes you gently, regarding your dewy eyes with sympathy. “I’m not spent just yet. I plan to breed you until we defy the laws of alchemy and create life through our combined efforts.” \nHis words make your pupils go wide, black almost consuming your entire irises. Your extremities feel numb. “Ah- n- no,” you gasp quietly. Albedo halts for a moment, but when you only offer a small whine, he disregards your feeble protest. \n“No?” Albedo hums, pretending to think. “Interesting. It would appear you are under the impression you have any say in the matter.” \nThe alchemist grabs you by the knees and pushes you backwards on the table until he’s looming over you. His knees are spread on either side of your hips in a half-squat and he pulls you close to him until your rear is in the air to greet his cock. Albedo takes a leisurely moment to dip two fingers into your hole, fingering his dribbling cum back into you in slow, deliberate motions. \n“This much virile seed ought to be enough to conceive, but that’s merely the bare minimum,” the alchemist purrs as he crooks his fingers in and out of you. “I want to breed you as if you’re in heat; copulate until I’m positive you’ll bear my offspring.” \nYou squirm feebly under him, but his other hand is firmly holding your waist in place. White fluid strings from his fingers when he pulls them out of your hole and he rubs the cum onto your sex sensually. You feel empty without his cock filling you, like there’s a crucial part of you missing.\nAs if reading your mind, Albedo suddenly plunges deep within you without so much as a warning and you cry out in surprise and pleasure. You can feel every tiny twitch and flex of his cold member inside of you, pressing against a sensitive knot of nerves. \n“You’re so soft and warm,” Albedo breathes in your ear. “I could spend forever filling you up with my cum, watching it spill out of you and then fuck it back in.” \nHis tongue suddenly slides into your mouth and you obediently accept him, one of his hands running through your hair spread across the surface of the table. Your mind is fuzzy with his scent suffocating you in the best way as you feel his seed pump into you again, some of it trailing down your ass and pooling onto the ground. The few moments of silent physical intimacy when Albedo stills make your heart grow to twice its size. He’s pushed to the hilt inside of you, cock pulsating as the alchemist presses fluttery kisses to your chest and cheeks. You feel like a kid sick with puppy love all over again for those few seconds.\nThe sickly sweet feeling is overwritten by the snapping movement of Albedo’s hips, replaced by your dazed cries whenever he hits the sensitive sponginess of nerves within you. With your hips raised up to him, he’s able to reach a depth further inside you that feels like he’s hitting your stomach with every thrust. Murmurs of praise spoken against your ear make you feel like you’re floating on a cloud. \nYour eyes cross, making your vision double as the feeling of every vein and curve of Albedo’s cock sends shivers down your spine. “Nnh- ahh- ar- archons abo- ove,” you stammer out through his thrusts. “Gah! Ohh, Bar- Barbato- tos, ple-  please, Albedo.” \nAlbedo runs the pad of his thumb over your puffy lips. “Careful,” he warns you. “He might hear you.” \nHis warning goes in one ear and out the other as you continue to mindlessly babble your pleas and cries to Celestia. Every low, angelic moan Albedo makes lights your body on fire before being cooled down by his ice cold cock pumping in and out of you. The sweet nothings that pass his lips are words you’ve heard before, but you could never grow tired of them. \nAlbedo laces his hand through your hair and cups the back of your head as your lips crash together. You weakly moan into his open mouth, body wracked with dry sobs and convulsing from overstimulation. Albedo makes muffled sounds of gratification, his thrusts turning sporadic as he keeps you pinned in a mating press. \nHis ejaculation feels like the biggest load so far, thick and warm as it leaks out from your hole as he continues to spurt his seed into you. Slowly, Albedo bucks his hips a few more times, ensuring you’re properly bred. He kisses light hickies down your neck and gingerly brings his hand down to your throbbing sex. It only takes a few strokes before you’re cumming on his hand with a rough cry. \nYour body feels foreign, ruined and claimed. You’re panting heavily, chest rising and falling with light bites and hickeys starting to bloom on your exposed skin. You’re pleasantly stuffed full of Albedo’s seed, high on the rush of endorphins and aphrodisiac. You don’t even realize the alchemist has pulled out once and for all until he’s scooping you up into his arms and lifting you off the table. \nYou give a weary sigh, distantly aware of his cum dribbling out of you and down the inside of your thigh and buttcheeks, but you’re too worn out to complain. You wrap your arms around his neck as he picks you up, hands supporting you by your plush thighs, chest to chest. You nose your face into the crook of his neck, breathing in his comforting scent, and he nuzzles you back. \nAlbedo lays you gently down on the roll-out mattress in the corner of the cave behind his work table. There, it is shielded from the biting winds and frigid cold. Dim dawn light peeks through the white dusted trees, rays of sun forcing you to squeeze your misty eyes shut. \nYou didn’t realize how stiff the table was until you sink into the tattered mattress. Although you remember it being lumpy and uncomfortable, right now it’s the most lavish bed in all of Teyvat. The moment your head hits your pillow, exhaustion takes you over and your eyes flutter shut. \n- X -\nBlearily, you blink your eyes open. Wetness in your eyes makes things look blurry, and you can feel sleep crust sticking to your eyelashes. You’re aware of how heavy your limbs feel and when you lift an arm to rub your eyes, it pricks with needles. \nAlbedo stirs beside you, ever an incredibly light sleeper. “How did you sleep?” He murmurs, brushing a stray lock of hair out of your face. \nYou arch your back and stretch your arms and legs out till they shake and then flop back onto the mattress. “Like a rock,” you yawn. You put two fingers to your temple and rub. “I feel like I have a hangover or something.” \nAlbedo regards you with concern. “Is last night a blank in your mind?” \nYou think back. It’s then you realize you’re completely naked aside from Albedo’s jacket, and there’s a dry stickiness between your legs. “That wasn’t a dream?” You gasp, staring at him wide eyed. \nAlbedo has the decency to blush. “Ah… no. Are you- was it- erm…” he clears his throat. “How do you feel?” \nYou snicker softly. “My arms and legs tingle,” you answer, twisting your wrists for emphasis. “You know, those pins and needles?” \n“Paresthesia,” Albedo supplies as you continue. \n“And- ah, well, sticky,” you groan softly, pressing your legs together. \n“That I can do something about,” the alchemist says, flinging the heavy blanket off him as he gets up. He rummages through a drawer and returns with a bottle of clear fluid and a soft looking rag. \nHe wets the cloth with the viscous fluid and you kick off the blanket to give him access. The cloth is nicely warm, and not shockingly cold like you had expected it to be. You can still feel the lingering sensitivity, and squirm every now and then as the rag drags over a sweet spot. \n“Sorry,” Albedo mutters, cheeks painted deep red. You give him a nudge with your foot to his forearm. \n“You don’t have anything to apologize for,” you assure him. “I kinda passed out the second I laid down. Not really a good time to clean up. If I remember correctly, one should clean up their own messes.” \nHe remains shyly quiet. The smooth fluid smells minty in the air. You tap his arm with your toe. “Hey, you came a lot,” you say cheekily. “Maybe you bred me good enough to fertilize me.” \nAlbedo looks up at you with a serious face. “I’m incapable of physically reproducing no matter how much I ejaculate inside of you. It is in my nature as a homunculus, remember?” \nYou fight the urge to roll your eyes. “I know, but just  maybe  we’ll accomplish some miraculous feat of alchemy, don’t you think?” You wiggle your hips at him. “That, or I guess we’ll just have to keep trying until we succeed.” \nAlbedo seems to catch onto what you’re trying to say, because he smiles softly. “If I’m understanding correctly, I take it you enjoyed yourself?” \nYou give him a playful shove. “Of course I did. I would’ve used our safeword if I didn’t.” \nAlbedo’s eyes flicker down for a heartbeat. “Ah, there were a few moments I thought you might too be out of it to give proper consent. You looked quite delirious.” \n“It was mostly from feeling so hot,” you admit. “And my arms and legs feeling really heavy was different from being restrained, but exciting.” You fix him with a tender look. “Thanks for trying to give me an out those couple times. It was sweet.” \nAlbedo gets up to toss the used cloth in the basket of dirty laundry. Shit, one of you would have to make a trip into Mondstadt soon to get it done or do it the old fashioned way in a freezing river. You make a mental note to go into Mondstadt later. \n“I wanted to be sure you were still responsive and aware,” Albedo says. “That’s important in such an intense scene.” \nYou roll your eyes while his back is turned. “Mmm, yeah, I know,” you grumble. When he turns to face you, he crouches to your level and you give him a soft peck on the lips. “But it was still sweet.” \nAlbedo seizes the opportunity to pepper your cheeks in light kisses, making you collapse back onto the mattress in a fit of giggles. “Albedo, heh, that tickles!” You snort, playfully pushing at his chest. “Your lips are cold!” \n“Actually, you’re just warm,” Albedo clarifies. “You  are completely nude aside from my jacket, you know.” \nYou clutch the jacket over your chest. “It’s comfy,” you retort with a mumble. “An’ it smells like you.” \nAlbedo falls onto his side next to you, propping himself up on an elbow. “I smell like me, too,” he teases, lazily holding out an arm. \nYou sigh softly and scoot into him, resting your head on his chest and listening to the perfect, steady sound of his heartbeat. He absently strokes your hair softly. \"It might be advisable to avoid Venti for the time being,\" Albedo suggets.\n\"Huh? Why?\" You peer up at the alchemist in confusion.\n\"You may not recall, but you took his name in vain,\" Albedo reminds you. \"Several times, might I add.\" \nThe foggy memory floods back and heat rushes to your cheeks. \"Oh, archons above,\" you grumble. \"He's never gonna shut up about that, is he?\"\nAlbedo pretends to think. \"Considering he can hear whenever someone speaks his true name, no, probably not.\" You let out a rather loud groan and bury your face into Albedo's chest in embarrassment, silently praying to disappear. Maybe you could avoid Venti forever if you stayed in Albedo's arms for the rest of your life. The two of you only stay like that for a moment, however, before your stomach makes a low grumble. \n“Ugh, what time is it?” You bemoan. \n“Past noon,” Albedo answers. “I tried to make some tea break pancakes for us, but- ah- I burned them.” \nYou laugh under your breath. “Should’ve stuck to sunshine sprats.” It was the only thing he was skilled at cooking. Still, he often preferred to have you cook instead with how frequently something went wrong when he tried. \n“Noelle makes it look simple,” Albedo huffs. “I’ll have to study her technique sometime.” \nYou plant a sympathetic kiss to his jawline. “Hey, some people can cook and some can’t. Don’t beat yourself up over it.” \nAlbedo’s eyebrows furrow. “I am  not ‘beating myself up’ over it. I merely wish to improve my method of baking such a dish.” \n“Any improvement would be significant improvement,” you tease further, tickling him by nuzzling your nose into his neck. \n“Alright,” he sighs in defeat. “I’ll fix you something. Give me a few minutes.” \n“Noooo,” you whine. “Stay. I don’t want sunshine sprats anyways.” \nAlbedo looks at you coolly. “Who says I was going to make sunshine sprats?” \n“The smell of burnt pancakes in the air.” \n“Ah.” \n“We can share some ration bars,” you suggest with a snicker. “Where are the chocolate ones?” \n“Favoring one over another may lead to an unbalanced diet,” Albedo responds. \nYou squint at him. “You ate it, didn’t you?” \n“Yesterday morning,” Albedo confirms. He doesn’t even have the decency to look regretful. \n“Hmph,” you grumble, and bury your hands in his white-blond hair and ruffle it so it stands in a tangled, puffed up mess. “That was  mine.”  \n“Is this… revenge?” He asks placidly, not bothering to try and fix his tousled hair obscuring his field of vision. \n“Yes.” \n“We can get more chocolate ration bars, you know,” Albedo offers. \n“Unless you can alchemy one right now, I don’t wanna hear it,” you huff stubbornly. “You and your sweet tooth. If I didn’t know better, I’d say all your teeth are sweet teeth.” \n“...I have a preserved vanilla cream pie,” Albedo says, shaking his hair out of his eyes. \nYou sit up skeptically. “Is that supposed to be a pun?” \nAlbedo raises an eyebrow. “A pun-? Ah- n- no.” His face quickly turns rosy at your implications. “Just… hold on.” He gets up and you hear him digging through his bag somewhere in the cavern, followed by the soft crinkling noise of wax paper.\nAs he sits down beside you, he finishes unwrapping it. “I was saving it. But, well, consider it an equivalent exchange for me taking your ration bar.” \nYou take the small pie from him and break off a bite with your fingers. “I  will consider this an equivalent exchange,” you begrudgingly agree. “Mm… did Noelle make this? It’s light and airy like the stuff she bakes.” \nAlbedo taps his chin. “Actually, Klee made it.” \nNow it’s your turn to raise an eyebrow. “Klee?  Make something? Other than a bomb, of course.” \n“Surprisingly enough, yes,” Albedo says. “Admittedly, she was aided by Kaeya, though I suppose that makes it even more impressive. It was a parting gift from her before I set out here.” \n“Well, here then,” you sigh, and turn the pie towards him. “You can have a bite. A  bite.”  \nAlbedo leans forward and takes a mouse of a bite. “Hm. It is quite delicious.” \n“Want another taste?” You ask. Albedo goes in for another bite, but you pull it back. “Uh-uh,” you tut. You point to your lips and smirk. \n“If you insist,” Albedo sighs playfully. He scoots closer to you and his lips are silky soft when they connect to yours. You can taste the vanilla cake on his lips, and you know he can taste the cream filling on yours. \nWhen you pull back, regrettably, for air, Albedo licks his lips like he’s just had a filling meal. “I believe you taste sweeter than the pie,” he says. “Though I’ll have to collect more data before jumping to conclusions.” \nYou flush and look away, turning your attention on finishing your breakfast. As you lick the powder off your fingers, Albedo stands and stretches. \n“We should probably start working soon,” Albedo points out. “If we don’t, we’ll have another late night.” \nYou flop back down dramatically. “Too tired,” you groan out. “I’m afraid I can’t get up; I’m hungover.” \n“You don’t have a hangover, you didn’t consume any alcohol,” Albedo sighs patiently. \nYou snap upright. “You  drugged me!” \n“Consensually,” Albedo reminds you.\nCrossing your arms, you blow your lips. “So? I’m sore and my head hurts, really.” Although a part of you just wanted to get out of work, there was a dull throb in your temples and moving your limbs felt like your bones were made of lead. \nAlbedo gets on his knees and puts the back of hand to your forehead. “Well, you don’t feel feverish at least. That’s a good sign. Do you need anything?” \nYou smack your lips. Your throat feels dry. “Water?” \nHe turns and hands you your canteen. The metal bottle is cold to the touch and the water is refreshing and eases your throat. You can;t help but chug it until it’s half empty. \nYou exhale in satisfaction and screw the cap back on, hanging it to Albedo. “Oh, one more thing,” you say as he turns to put your canteen back in your bag. \n“What is it?” He asks. \n“Could you get me some clothes?” "
}