{
    "id": "29595594",
    "url": "https://archiveofourown.org/works/29595594?view_full_work=true",
    "author": [
        "BelleAmant"
    ],
    "title": "Mirukodoriya",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Aizawa Shouta | Eraserhead & Midoriya Izuku",
        "Class 1-A & Midoriya Izuku",
        "Midoriya Izuku & Yamada Hizashi | Present Mic",
        "Midoriya Izuku & Yagi Toshinori | All Might",
        "Midoriya Izuku & Sasaki Mirai | Sir Nighteye"
    ],
    "characters": [
        "Midoriya Izuku",
        "Aizawa Shouta | Eraserhead",
        "Nedzu (My Hero Academia)",
        "Class 1-A (My Hero Academia)",
        "Shinsou Hitoshi",
        "Toogata Mirio",
        "Yamada Hizashi | Present Mic",
        "Yagi Toshinori | All Might",
        "Sasaki Mirai | Sir Nighteye",
        "Usagiyama Rumi | Miruko"
    ],
    "additional_tags": [
        "Personality Swap AU",
        "Actor Midoriya Izuku",
        "Izuku acts like Miruko for a day",
        "BAMF Midoriya Izuku",
        "Parental Aizawa Shouta | Eraserhead",
        "I'm so tired and I'm bad at tags I'm sorry",
        "I'm supposed to be studying but I wanted to offer you guys some chaos",
        "Crack",
        "Wow I finally put that tag on this series",
        "Nedzu is a Little Shit (My Hero Academia)"
    ],
    "language": "English",
    "series": "Part 17 of Personality Swap AU",
    "published": "2021-02-21",
    "completed": null,
    "words": "5,009",
    "chapters": "1/1",
    "comments": "363",
    "kudos": "13,670",
    "bookmarks": "548",
    "hits": "122,490",
    "summary": "<p>Nedzu is a little bit quicker, to send Midoriya the assignment, than Aizawa is.</p>\n<p>Or: Nedzu is a little shit, Aizawa regrets life, and 1-A has a heart attack.<br>(I'm so sorry)</p>",
    "notes": "<p>I'm so sorry if this is bad...I'm so tired, I have like...five tests (two of which are exams) this week and wow I can't fully focus on my screen anymore.</p>\n<p>But I hope you like it well enough! &lt;3</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>What did you think? Thoughts, comments, suggestions for future characters?</p>\n<p>(Also, sorry that my update schedule is so wack. I...life, you know?)</p>\n<p>Until next time! &lt;3</p>",
    "text": "\nSaturday comes and goes, as it does, and Shouta Aizawa doesn’t even begin to think of the next assignment for his student until Sunday is already halfway over. It’s well into the afternoon, now, and Shouta frowns as he looks at his phone, wondering what assignment he should give his student, if one at all.\n\n\nMidoriya deserves more breaks, after all. Last week, it was nice seeing Midoriya just...act as a normal kid, as himself, taking Wednesday and Thursday to get to sit and relax with his friends, without a part to play except his own. Because, sure, Shouta thrives on chaos, and his kid is great at causing it, but, damn, the kid deserves a chance to be himself.\n\n\nBut then comes the fact that, well...Midoriya \n\nlikes\n\n doing these assignments. And it’s been helping the boy to improve himself, and his grades. He’s been steadily improving, at a much faster and much less destructive rate than before, and it’s been \n\ngood\n\n for him.\n\n\nSo maybe it’s a little hard to make up his mind, and maybe Shouta has been glaring at his phone for far too long. Sue him.\n\n\nHe’s overthinking it. For tomorrow, he’ll have Midoriya impersonate someone. He’ll let the kid take a break, after, though. He needs to minimize the amount of assignments he gives Midoriya, once the boy starts partaking in work-studies. He doesn’t want his Problem Child to overwork himself, as the greenet is prone to doing. \n\n\nSo again comes the question: who should Midoriya impersonate for tomorrow?\n\n\nShouta hums, leaning back into his chair as he tries to recall the rules that he’s set out. They have to be chaotic, but not in a way that’s endearing. Someone covered up, but not with clothes that are skintight. Preferably someone older, but in a senile way, not an ‘I need makeup to be less attractive’ kind of way. Someone who is more chaotic than calming, who will strike the fear of God into the hearts of his students. \n\n\nAnd, most importantly, someone who won’t cause Izuku Midoriya to gain more suitors, not when Shouta is still trying to figure out how to sit Todoroki down to make sure the boy will treat his not-quite-a-son right, and put in enough healthy intimidation to keep the heterochromatic teen true to his words.\n\n\n(That last part...may take a while, but that’s quite alright. Todoroki seems to be too afraid, and Midoriya far too oblivious, for the two to get together anytime soon.)\n\n\nRight. Right. Those are the most important rules, and the ones that Shouta needs to follow. So who does that leave him with?\n\n\nWell, Ectoplasm could be an option, although Shouta doesn’t have a clue whether or not Midoriya has the proper attire for such an outfit- and how would Midoirya work around the legs, anyways? Or the man’s Quirk, for that matter? Midoriya has had moments where he’s clearly tried to recreate Quirks, from Bakugou’s explosions to Shigaraki’s decay- which Shouta still isn’t sure what the kid did, but he \n\nis\n\n rather creative with his acting, so Shouta will let him keep his secrets, this time.\n\n\nShouta doesn’t quite \n\nwant\n\n to know, however, how Midoriya would recreate such a Quirk. Likely with the help of his friends...and wow, Shouta does \n\nnot\n\n want to see dozens of mini Ectoplasms running around, causing mayhem. That’s too much for even him, admittedly.\n\n\nSo who is next? Cementoss? No, no, Midoriya doesn’t have makeup, he wouldn’t have the paint to cover himself gray- and besides, Ishiyama keeps his arms completely exposed. Shouta can’t let Midoriya do that.\n\n\nMaybe...Lunch Rush? Admittedly, Shouta himself isn’t sure whether or not the man has a Quirk beyond his abnormal appearance, or if his cooking \n\nis\n\n his Quirk...so maybe \n\nnot\n\n.\n\n\nAlright, what heroes are there outside of Yuuei? Oh, maybe Midoriya should be-\n\n\nHis phone buzzes, and Shouta blinks. It’s a message from Nedzu.\n\n\n‘\n\nDon’t worry about Midoriya’s next assignment, I’ve already chosen the perfect one for him! In fact, I’ll even let you know, just let me…\n\n’\n\n\nWith wide eyes, Shouta watches as his phone acts on its own, no doubt controlled by Nedzu as it exits out of the conversation, slipping into his chat with Midoriya. Letters begin to fill the screen, and Shouta lets out a curse when he sees the name being presented. Hastily, he tries to delete the words, but his keyboard can’t do anything.\n\n\nAnd so Shouta watches with dismay as the text is sent, and marked read not thirty seconds later.\n\n\nAnd Midoriya responds as he always has, cheerfully accepting the task.\n\n\nOh kami, Shouta is going to regret tomorrow.\n\n\n(Across the campus, Nedzu cackles.)\n\n\n-----\n\n\nIt’s not unusual, to the students of 1-A, for Izuku Midoriya to not be in class when the rest have all arrived. It’s just a sign of things to come, to them. A warning of chaos, of a Midoriya that \n\nisn’t\n\n.\n\n\nNor is it unusual for Aizawa to be in the room before them all, laying in his sleeping bag, clearly waiting for the day to begin. Eyes shut, but still seeing, still listening, still aware and ready.\n\n\nBut Aizawa is not in his sleeping bag today. No, today he is standing at his podium, head down, like a man grieving for a loss yet to be known. His hair hangs, casting a shadow around his face, a curtain that does its best to conceal his pain and grief.\n\n\nIt’s...confusing. An enigma, certainly. Because Midoriya is not in the room, and that means that he is about to act. Yet Aizawa still looks like anything but a satisfied man, ready to watch the world burn with fear.\n\n\nNo, he is the fearful man, and no one knows why.\n\n\nNot until Midoriya enters the room, and everything becomes crystal clear.\n\n\nBecause today, today Midoriya does not follow the trend that had been. Gone are the constant coverups, the long pants and matching tops, the masks to hide his features and baggy pieces to hide his muscles.\n\n\nToday, when Midoriya walks into the room, all eyes are on him, taking in the sight that is the green-haired wonder. The main piece is a sleeveless white leotard with dark purple trim around the shoulders and waist, a crescent moon over his chest and thick metal plates guarding his midriff. Purple thigh high boots run up his legs, with plating around the heels and toes, giving his feet a rabbit-like appearance. Thick white gloves are on the boy’s hands, and long white ears poke out of his head, clearly metallic yet still moving seamlessly, tracking noises as they twitch.\n\n\nWith a smile full of confidence, and a hand placed carelessly on his hip, Midoriya tilts his head and winks.\n\n\nAnd the students of 1-A understand why Aizawa seems to be dying, because they feel much the same. For a reason that is different, but a cause that is much the same.\n\n\nBecause Izuku Midoriya is impersonating the Rabbit Hero: Miruko, and there are no doubts that grades are going to drop today.\n\n\nKami, have mercy on their souls…\n\n\n-----\n\n\nHizashi Yamada knows that something is wrong the moment that he sees Shouta Aizawa walking through the halls. Because Hizashi knows Shouta, and he knows the man well.\n\n\nAnd while Shouta usually looks like he’s one missed night of sleep away from death, he usually doesn’t look like he’s \n\nmourning\n\n over the idea.\n\n\nBut here he is, with his shoulders slumped and head down, hair drooping in front of him more than usual. The man's hands aren't tucked into his pockets, instead dangling by his sides, as if he's so destroyed that he's forgotten his natural stance. \n\n\nHizashi isn't dumb. He knows his friend well, and knows that there are few things that could make Shouta act in such a way.\n\n\nAnd considering the past few weeks, there are only three things that Hizashi can think of, that may have occurred to cause such a reaction.\n\n\nThe first is the most unlikely, only a passing thought that gets brushed aside as soon as it comes. The first option is that Izuku Midoriya, the resident sunshine child and unofficial son of Shouta Aizawa, finally realized that Shouta cares for him like a son (because, really, for as analytical and observant as Midoriya can be, he's practically as oblivious as a rock when it comes to people caring for him)...and didn't react well.\n\n\nIt's a thought that can easily be dismissed, for two reasons of its own. For one, again, Midoriya is \n\nvery\n\n oblivious. It seems to stem from his low self-esteem, no doubt a product of his past in some way, shape, or form. \n\n\nBut even ignoring that, there's another rather simple fact that Hizashi knows to be truth, even if the boy has never said it himself: Izuku Midoriya would never be upset by the unofficial adoption, because Midoriya clearly holds Shouta in high regard.\n\n\nSeriously. Just look at them. They're a family of chaos in the making!\n\n\nSo the first option can be dismissed, which brings Hizashi to the second: someone finally confessed to Midoriya.\n\n\nThis option, too, can be waved away, because Shouta is alone. If someone \n\nhad\n\n confessed, Hizashi knows that Shouta would be dragging them away for a talk, scowling more than sad.\n\n\nWhich means there's only one real option...Izuku Midoriya is dressed up as a hero, and it's one that's causing his class to fall even further for the boy.\n\n\nSo when Hizashi walks in through the doors of 1-A, it’s with a heavy heart and a weary gaze.\n\n\nAnd, really, he should have expected this.\n\n\nBut Midoriya is sitting on his desk- not in, but \n\non\n\n the table- waiting casually, one leg swinging as he leans back, arms supporting his weight with ease. He’s talking to Uraraka and Yaoyorozu, apparently unaware of the way that quite a few of his peers are entranced by his casual pose, even the ones who look like they want to be anything but. Eyes linger, then dart away, except for a certain dual-haired boy, who stares up at Midoriya like the boy is the sun and he is a sprout, stuck to do nothing but watch in awe.\n\n\nWhich is rather ironic, Hizashi thinks, since Midoriya is the green one, and Todoroki the one who wields fire, but he digresses, because Midoriya is speaking.\n\n\n“It’s all about taking what you want,” Midoriya says, shrugging, the motion fluid and easy, the action rolling through him and leaving him leaning even further back than before. “The world is a bitch, yeah, but it’s all about making her \n\nyour\n\n bitch.”\n\n\nFor some reason, Uraraka and Yaoyorozu seem oddly empowered by Midoriya’s explanation, especially when Midoriya continues, saying, “Don’t worry about those who doubt you. They’ll come a dime a dozen, yeah, but fuck ‘em all. Just keep doing what feels right, and spring for the top, and you’ll make it.”\n\n\n“I’m gonna do my best,” Uraraka whispers, in a reverent way that reminds Hizashi of the passion she held during the Sports Festival, and the fire in Yaoyorozu’s eyes seem to be a similar spark to the brunette’s, only kindled further by Midoriya’s encouragements.\n\n\nIt seems as if Midoriya is giving some kind of...inspirational speech. Perhaps one about becoming a female hero, from the way that the other girls all seem to be listening in, in some way. It seems to be working, too, lighting a new drive underneath them all, one by one.\n\n\nAnd Hizashi, as he sees it, has two choices in this instant. The first is to do what he did the last time, when Midoriya was dressed up in the R-rated costume that caused his vast number of admirers to somehow spike. \n\n\nThe second option is to laugh, because finally, \n\nfinally\n\n, Shouta is facing true consequences for his life decisions, the very choices that have caused Hizashi to suffer for so long.\n\n\nYeah, Hizashi goes with the latter.\n\n\nAnd it’s nice to be able to brush it off and laugh.\n\n\nEven if he has to deal with most of his students being too distracted by Midoriya’s physique to focus on the prepositions he has on the board.\n\n\nHe’ll take it, because it comes with the satisfaction of knowing that Shouta is being just as affected as Hizashi was in the beginning.\n\n\nAnd \n\noh\n\n, isn’t it vindicating?\n\n\n-----\n\n\nThe time for lunch arrives, and the students of 1-A watch as Midoriya disappears, getting up and leaving the room without a second thought, ears twitching as if he's listening to something far away.\n\n\nThey don't follow him, assuming it's the wisest decision, instead going to the cafeteria to enjoy their meal before training.\n\n\nAnd lunch goes...rather calmly, surprisingly. Midoriya doesn't startle anyone in the cafeteria, nor does he make his way into the teacher's lounge. The halls are silent and not even the cameras can spot head nor tail- \n\nis\n\n Midoriya wearing a tail? No one can quite remember, can quite recall if they had seen one or not- of him. It’s almost as if he's not on campus at all- a feeling that is both calming and worrying. Relaxing, in the way that it offers a sense of serenity, of a known peace that won’t be shattered, not yet, not now. Yet all the same it stresses those who await his return, his next appearance, because it’s like he was never there at all, no trace of him to be found. It’s like Midoriya made his appearance on stage and then exited stage left, disappearing behind the curtains and out of sight of his eager audience, leaving behind a silence as the people await the final act.\n\n\nBut the actor is hidden.\n\n\nBut it's fine. Midoriya wouldn't just \n\nleave campus\n\n, would he?\n\n\nNo, of course not. That'd be silly.\n\n\n(And maybe they're right, that Izuku Midoriya wouldn't.\n\n\nBut Miruko would, and that's how Rumi Usagiyama finds her impersonator standing over an unconscious villain, smiling confidently as he ties the man to a lamppost. And she will question this moment, but only for an instant, and then she will laugh.\n\n\nShe’s heard rumors, of course, of the little actor of Yuuei. One cannot have such an act go on for three weeks, going on a fourth, in such a prestigious institution without word beginning to reach the outside world. And word has reached, little videos of the actor being posted, the message being spread. A mix of marketing students and heroes who have had their image embodied, and those who remain outside of those spheres to join. \n\n\nYes, Rumi Usagiyama connects rumors to truth quickly, and she cannot be anything but impressed as she sees the boy who has molded her image so well to his own, making it one and the same. \n\n\nThe day is only halfway through, and impressions make for great first impressions.)\n\n\n-----\n\n\nStanding here, watching his successor throw down with nineteen other teenagers, Toshinori Yagi can’t figure out whether or not it’s appropriate to be proud of his boy in this situation.\n\n\nBut he is. By Nana above, he is. \n\n\nThis hadn’t been a part of the plan, when Toshinori called 1-A to get dressed into their gym uniforms and head down to the gym. It was supposed to be a simple day of sparring, because, to be quite honest, being able to fight \n\nis\n\n one of the biggest parts of being a hero. But it was just...just simple spars. Nice, easy, routine.\n\n\nAnd then Midoriya turned to his peers, and issued them all a challenge.\n\n\n\n“Let’s fight! All of you against one of me- we’ll see if you even stance a chance against a \n\nbunny\n\n, or if you need to be sent packing!”\n\n\n\nAnd the students of 1-A, who have taken the Plus Ultra nature of the school in their hands and gone even further beyond the motto’s calling, answered without hesitation.\n\n\nThat’s how it began, with some of the more eager students taking the charge. Bakugou, for one, being the first to leap forwards, an explosion sending him to the front of the group, a right hook aimed perfectly at Midoriya’s face.\n\n\nAnd missing just as clearly, so obvious that no one could deny it. But Midoriya didn’t make any comments, no.\n\n\nNo, he simply smiled, eyes taunting, and that was enough. Bakugou lunged again, hand outstretched.\n\n\nHe was on the floor just seconds later, and the class went wild. If Toshinori were to take a guess, he’d say that this is what Aizawa saw, when the third year Togata challenged 1-A to an all-out brawl. Toshinori can’t say this with total certainty, of course, but he knows his class. \n\n\nSo he can say with quite a bit of confidence that he thinks Aizawa would understand the feeling that Toshinori feels now, watching 1-A try to fight Midoriya, nineteen hero hopefuls against one impressive impersonator.\n\n\nAnd the feeling is pride, surely and truly, because young Midoriya is decimating his peers, knocking them down quicker than they can even rise to the challenge, tripping them up and sending them sprawling.\n\n\nIt’s impressive on its own, how strong his successor has become. Midoriya has grown, and it shows in how he moves, every moment used with care, every action analyzed and understood intimately.\n\n\nBut it’s all the more impressive when one remembers that Midoriya is acting not as himself, but as another.\n\n\nAnd while Izuku Midoriya has adapted to his injuries and focused less on punches, rounding out his style with Full Cowling...well, Miruko is more of a kicker.\n\n\nAnd Midoriya isn’t one to ignore such a prominent fact. \n\n\nSo it is with nothing but his legs, his laugh, and a little bit of lip service that Midoriya beats his peers in a brutal takedown, eyes wide with exhilaration as he bounces from spot to spot, opponent to opponent, until no one is left.\n\n\nOnly then does Midoriya still, hands landing on his hips as he asks, “Is that it? Can’t take the heat of a little rabbit? Guess I’m just too good, huh?”\n\n\nNo one disagrees, not one bit.\n\n\nTruly, that’s the correct answer to be offered.\n\n\n(Yeah, Toshinori is proud.\n\n\nHe couldn’t have found a more worthy successor of One for All, a better boy to call his son.\n\n\nOnly a fool would believe otherwise.)\n\n\n-----\n\n\nIzuku takes a deep breath, looking at the door before looking back down, grateful for Togata’s patience. The boy had brought him to Nighteye’s-\n\nthe\n\n Sir Nightye’s- agency right after school for him to meet the man himself and ask to be mentored. \n\n\nWell, right after Izuku got changed, of course, because Togata sent him straight to the dorms before telling him to meet at the gate.\n\n\n\n“Maybe it’s best to wear your normal uniform,” Togata said cheerfully, not quite looking at Izuku, but not as affected as his peers seemed to be all day over his showing of skin- likely due to the nature of Togata’s very own Quirk. “Sir wasn’t the most impressed, the first time I accidentally showed too much, so it’s probably better to change first.”\n\n\n\nWhich Izuku isn’t sure was necessary, after seeing Bubble Girl, but...okay! \n\n\nNow Izuku just needs to...go in. His blond senpai isn’t pushing for him to rush, a solid, steady presence next to him, but Izuku doesn’t want to waste time. Not for the only known sidekick for All Might in all of history!\n\n\nWith this in mind, Izuku knocks on the door, and then pushes it open when given the clear.\n\n\nSir Nighteye is already standing, although it appears that he just got up, hands still resting on his desk and body angles in a way that implies he wasn't finished positioning himself. Curtly, the man rises fully, straightening his back and making himself appear even taller, all the more intimidating now that he can peer even further down at Izuku.\n\n\nBut appearances aren't everything, Izuku knows, and so he still moves forwards, into the room, lifting a hand to shake the man’s own.\n\n\n\"Hi!\" Izuku greets. \"Thank you for agreeing to meet. I'm Izuku Midoriya...I wanted to talk to you about work-studies?\"\n\n\nAlright, so maybe he falters at the end, but Izuku thinks he did pretty well to start. But Nighteye simply blinks down at him, before shifting his gaze to Togata, who still lingers in the doorway.\n\n\n\"Shouldn't you be on patrol right now?\" Nighteye asks, and Togata shoots upright.\n\n\n\"Right! See you around, Midoriya- hopefully around the office, too!\" Then, lowering his voice, he adds in a whisper, \"Remember: try to make him laugh! He loves jokes!\"\n\n\nIzuku watches the door shut, and then looks to Nighteye, who still keeps the same, blank look on his face. \n\n\nStaring at the man, Izuku decides to lower his hand and pocket the All Might impression that he had planned to do, when Togata had originally given him the advice on the way over. He doesn’t seem very amused, and probably wouldn’t be afterwards, either. It probably wouldn’t go over well, especially since Sir Nighteye and All Might aren’t partners anymore.\n\n\nSo Izuku chooses something else, taking a page from Aizawa’s book and hopping straight to the point, because Nighteye seems like the type who likes to cut to the chase as soon as possible.\n\n\n“Togata-senpai recommended you as a great mentor,” Izuku says, keeping his smile as perfectly in place as he can. “He said that you were able to make him the hero he’s becoming today, and praised your ability to turn him from the weakest link to one of the strongest parts of the chain. I’ve made progress with my Quirk, but it’s fickle, and-”\n\n\n“Your Quirk,” Sir Nighteye interrupts, and Izuku blinks in surprise. “Is that what you called it?”\n\n\n“Y-yes, Sir,” Izuku agrees, and Nighteye hums.\n\n\n“Is that so? You have the nerve, the vanity to call it yours?” Head tilting downwards, Nighteye states, “I would have assumed it was All Might’s more than yours, is it not?”\n\n\nIzuku doesn’t know why it surprises him, the fact that Sir Nighteye knows that he is the current holder of One for All, but it’s a surprise that he forces himself past.\n\n\nIt makes \n\nsense\n\n, Izuku tells himself, that the man knows. Yagi had encouraged him to go to his former sidekick, and had mentioned that the man knew of the Quirk’s nature. It’s only logical to assume that, somewhere along the line, Yagi let Nighteye know about who his successor is.\n\n\nRight. This should make it...easier, then. \n\n\n“Yagi-” Izuku watches how Nighteye frowns at the use of the man’s last name, and quickly steers clear of \n\nthat\n\n problem, “\n\nAll Might\n\n gave me the Quirk. He said it’s mine, now, and to treat it as such.”\n\n\n“And you use it like a fool,” Nighteye states, and Izuku blinks in surprise, smile slipping.\n\n\n“I- I’m \n\nsorry\n\n?”\n\n\n“You’re not worthy of One for All,” Nighteye says, voice dismissive as he steps closer, hand reaching out and tapping at his arm. “I saw your usage of it, during the Sports Festival. You were unrefined, an embarrassment to the legacy. You do nothing but break yourself, and you are merely a \n\nchild\n\n playing with the weapon of a pillar.”\n\n\nIzuku stares, wordless, as Nighteye shames him for the events of his past, for a time when no one was able to help, to offer advice. A time Izuku is \n\nwell\n\n past, a time that no longer showcases even a percent of what Izuku can do.\n\n\nIs Full Cowling nothing? Is his Shoot Style so worthless? Are the dozens of fighting styles that Izuku has adopted, has adapted to, has made his \n\nown\n\n...are they nothing? Does Nighteye not recognize these?\n\n\nDoes Nighteye not \n\ncare\n\n?\n\n\nInexplicable rage- no, no, it’s explicable, it’s comprehensible and understandable and \n\noh\n\n, so strong- courses through him, hotter than the crackling lightning that dances under Izuku’s skin, ready to burst and show this man exactly what he can \n\ndo\n\n.\n\n\nAnd then Nighteye gives him the chance.\n\n\n“I don’t want you here,” Nighteye states calmly, as if talking about the weather, about something unimportant. “But I will give you a chance. You have three minutes to take this stamp from my hand, and mark your form with it. If you manage to do that, I will teach you.”\n\n\nBut he will not \n\nrespect\n\n Izuku, will he?\n\n\nWill he?\n\n\nIzuku doesn’t know, but he \n\ndoes\n\n know that he’s being given a chance. Not a good one, no, but one he will take.\n\n\nOne he will use, to prove a point.\n\n\nAnd so Izuku moves, lunging and darting and ricocheting, all predicted by Nighteye’s ever-seeing gaze, empowered by a Quirk that sees all that he does and all that he will. And Izuku knows, he knows exactly the message that Nighteye is trying to give.\n\n\nHis every move is pointless. He cannot win.\n\n\nBut Izuku isn’t the bone-breaking, foolish teen that Nighteye has pinned him down as. No, he is Izuku Midoriya, and he’s beginning to realize that he’s a \n\nhell\n\n of a lot more than people have let him know.\n\n\nSo Izuku moves, and he shows everything that he is, crackling green as he darts, as he drops, as he, eventually, figures something out.\n\n\nNighteye can see his movements.\n\n\nHe \n\ncan’t\n\n see some of the results.\n\n\nThe flick of a finger can be tracked, but not the air that follows, if the current is weak enough.\n\n\nGrinning wildly, Izuku follows through, and the gust is enough to knock the stamp out of Nighteye’s lazy grasp. Darting in, ignoring Nighteye’s gasp, Izuku grabs the stamp, moves to his paper…\n\n\nAnd pauses. Hums.\n\n\nDrops the stamp on the desk, uncaring of how it leaves ink on his form, too busy glaring at Nighteye, who stares right back.\n\n\nThe timer runs out, and Izuku doesn’t care. Nor does he care about the fact that he won.\n\n\nNo, he just shakes his head.\n\n\n“I’ve changed my mind,” Izuku says, voice full of a confidence and conviction that doesn’t feel entirely like his own, but not unlike his own either. “I think I’ll find someone else to teach me.”\n\n\n“You passed,” Nighteye states, however, eyes clearly confused, Quirk still shining within them. “You...bested me. You won fair and square.”\n\n\n“I did,” Izuku agrees. “And now I am deciding, fair and square, that I do not want to be taught by a man who thinks he has the right to say whether or not my Quirk is my own. I came here hoping to find a \n\nteacher\n\n, someone to build me up. If I wanted to hear someone belittle me, I’d go back to my middle school educators, Sir.”\n\n\nNighteye looks, in all honesty, like he’s going to say something. His mouth is open and his eyes are narrowed with a sense of loss, but Izuku doesn’t trust the words he plans to say to be good.\n\n\nSo Izuku looks away, picking up his paper, nodding his head in farewell, and walking out of the door. He doesn’t pay much attention to Togata, who first offers a smile and congratulatory fist bump, only to blink in surprise at the anger in Izuku’s eyes, and then the blond is hurrying to Sir’s office, as if he, too, is confused by this turn of events. No, Izuku pays this interaction little care, all too focused on getting out of the agency he was so excited to be in not ten minutes ago.\n\n\nAnd for some reason, as Izuku exits the agency, he can almost swear that he still hears Nighteye’s voice, the man talking to Togata.\n\n\nBut it’s probably just the wind.\n\n\n-----\n\n\nSitting in his office, Shouta Aizawa hums, looking at his phone. He’s considering whether or not he should give Midoriya an assignment for the next day, leaning more towards a ‘no’ than a ‘yes’. But then, as he moves to type, he sees the signature three dots pop up, implying that Midoriya is texting.\n\n\nAnd then a message comes through.\n\n\n‘\n\nMay I talk to you, sensei?\n\n’\n\n\nHe says yes, of course, and not five minutes later, the boy is knocking on the door, entering the office.\n\n\n“I went to see Sir Nighteye,” Midoriya begins, but he looks far too upset by such a statement. Especially when he follows it with, “He offered to mentor me.”\n\n\n\"Alright,\" Shouta says, feeling far too much like a parent who is ready to fight a Pro Hero. \"You sound upset by this. Why?\"\n\n\n\"He doesn't think I'm good enough,\" Midoriya says, and Shouta can't help but be confused, because in what \n\nworld\n\n is his son not good enough? \"He says I don't live up to my potential, that I'm not as good and will never be as good as someone like Togata.\"\n\n\n\"He's wrong,\" Shouta says, plainly, and Midoriya smiles. It's weak, but it's something.\n\n\n\"I...I thought so, too. It doesn't make sense to me, to compare me to Togata. Of \n\ncourse\n\n Togata is stronger, and knows his Quirk better. He's \n\nsupposed\n\n to- that's the whole point of experience, isn't it? But Sir seemed upset by it, and I- I didn't get it.\" Shrinking into his seat, Midoriya admits, \"I rejected his offer.\"\n\n\n\"You did?\" Shouta asks, although he's not surprised. No, he's proud.\n\n\n\"I didn't… I didn't want another teacher like the ones I used to have.\"\n\n\nMidoriya is standing up for himself, protecting himself, why \n\nwouldn't \n\nShouta be anything but proud?\n\n\n\"I'm glad,\" Shouta says, and Midoriya looks up with wide, wondering eyes. \"Kid, you don't need to intern with someone who is just going to knock you down for things that aren't your fault.\"\n\n\n\"Thank you,\" Midoriya breathes, but Shouta isn't done, an idea coming to mind.\n\n\n“Problem Child,” Shouta says, and Midoriya still watches him with the same curious gaze. “How would you like to mentor under me?”\n\n\nMidoriya \n\nbeams\n\n, and Shouta responds in kind.\n\n\n(In the distance, the world trembles.)\n"
}