{
    "id": "29601687",
    "url": "https://archiveofourown.org/works/29601687?view_full_work=true",
    "author": [
        "arahir"
    ],
    "title": "he was a skater boy, he said—no, you know what, no, we're not calling it that",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "SK8 the Infinity (Anime)"
    ],
    "relationships": [
        "Hasegawa Langa/Kyan Reki"
    ],
    "characters": [],
    "additional_tags": [
        "Misunderstandings",
        "Mutual Pining",
        "Fluff and Angst",
        "sleeping on each other",
        "worried langa aka canon langa",
        "oblivious reki",
        "oblivious but very good and the best"
    ],
    "language": "English",
    "series": "",
    "published": "2021-02-21",
    "completed": "2021-03-01",
    "words": "8,185",
    "chapters": "2/2",
    "comments": "1,232",
    "kudos": "23,451",
    "bookmarks": "4,357",
    "hits": "150,912",
    "summary": "<p>Everyone knows Reki and Langa are dating. Everyone except Reki, that is.</p>\n<p>“Is it someone from class?”</p>\n<p>Langa pushes his board back and forth, the little rumble of the tires filling the late afternoon quiet between them as he takes a deep, audible breath, looks directly at Reki, and nods. “Yes.”</p>\n<p>And that’s a surprise. Reki tries not to let it show. “Have you guys been on any dates?”</p>\n<p>“Yeah. I mean, I thought they were dates.”</p>\n<p>That’s… kind of sweet. Sweet in the way that feels like it's going to make Reki sick. “How have you even had time for that?” he mutters. “You spend all your time with me.”</p>",
    "notes": "<p>sorry about the title among other things. wrote this in a noonday haze.</p>\n<p>ETA: ACTUALLY REALLY SORRY ABOUT THE TITLE. i didn't think this would get popular. i promise to do better by them in the future. reki, langa.... wait for me 😔</p>\n<p> </p>\n<p>\n<a href=\"https://ficbook.net/readfic/10524603#part_content\" rel=\"nofollow\">Translation to Russian here! | русский перевод здесь</a>\n</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>[<a href=\"https://twitter.com/thecmaly/status/1370704113177030658\" rel=\"nofollow\">PLEASE GO LOOK AT THIS ART FOR THIS FIC BY ALY PLEASE</a>] [<a href=\"https://archiveofourown.org/works/30205818\" rel=\"nofollow\">]\n[</a><a href=\"https://twitter.com/arahir/status/1363377706461667336?s=20\" rel=\"nofollow\">fic on twitter</a>] [<a href=\"https://arahir.tumblr.com/post/643711763727220736/untitled-6k-fluff-misunderstandings-pining\" rel=\"nofollow\">fic on tumblr</a>]</p>\n<p>and i try oh my god do i try i try all the time in this skating anime... please dm me on twit or anon on tumlor if there are any typos</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>[<a href=\"https://twitter.com/arahir/status/1363377706461667336?s=20\" rel=\"nofollow\">fic on twitter</a>] [<a href=\"https://arahir.tumblr.com/post/643711763727220736/untitled-6k-fluff-misunderstandings-pining\" rel=\"nofollow\">fic on tumblr</a>]</p>\n<p>i wrote this right after the first chapter and debated posting it at all, but then ep 8 really said ms hasegawa rights and idk if it makes anyone's day a little better then here it is! have a good one and thank you for reading this. literally can't believe the response on this fic and sincerely hope everyone who reads it has a great day!!</p>",
    "text": "Langa gets his first confession a month after he transfers in. Reki watches it from the upper windows with the rest of the audience Langa doesn’t seem to realize he has—the audience Reki would, if he were a better man, warn him about. \nHe isn’t a better man. \nThe girl’s voice is too soft to hear, but Langa’s carries well against the concrete of their old school building. “I can’t,” Langa tells her. The twist in Reki hadn’t realized his gut was caught up in uncoils, but only for that instant, because Langa follows it with, “I’m seeing someone.”\nThe floor slips out from under Reki like it's on wheels. Someone grabs him by the back of the shirt before he can slip out the window and meet his untimely—timely, actually—demise at Langa’s feet. Someone else leans in close and asks him, “Hasegawa has a girlfriend? Did you know?”\nThe hushed whispers filling the room die as the entirety of the class hangs on his answer. He dusts himself off, picks up the part of him that’s still spiraling across the floor, and gives the only one he possibly can: \n“Yeah. Of course, I knew.”\n \n \nHe didn’t, of course. The facts of his life Langa shares are simple and spare and as far between as a summer snow. No; bad metaphor, it never snowed in Okinawa before Langa showed up. Every fact of his life is something Reki has had to beg out of him, and it’s not even that he’s trying to hide anything. It’s not even that Langa is too cool to share. It simply wouldn’t occur to him anyone else wanted to know. A secret girlfriend is so on point for Langa that Reki wonders why he ever assumed otherwise. Won’t hit on girls, won’t go to meetups, won’t talk about girls period, come to that. \nReki works up the courage to ask between then and the ride home. \n“I saw what happened at lunch,” Reki tells him, and, “Sorry,” and hopes his voice sounds as light as he’s trying to force it to be. “Who’s the new girlfriend?” It almost comes out too casual, if that's possible.\nEvidently, yes, by the look Langa gives him. “Oh. Her? I don’t remember her name.”\nReki snorts. “Man, that’s brutal. No, I meant, I heard what you told her. You’re seeing someone. Who’s the lucky girl?”\nIt takes all of his mustered courage and a little more to come out with all that in a solid row of coherent words, but of course all it earns him is a roll of Langa’s eyes. \n“Haha,” Langa says. “Funny.” \nReki throws out his hand without meaning to, more for emphasis than anything else, because Langa still has that dumb-simple look like none of this matters. It connects with Langa's shoulder, a light slap. “No, I’m serious. Why didn’t you tell me you had someone?”\nLanga pulls up short. “You’re joking.”\n“No?”\n“But… Okay, wait.\" He puts a hand to his head like he's trying to hold it on straight. \"You’re serious? You’re not joking?” \nIt’s times like these his Japanese starts to fail him in little ways. The words come out stunted, accented, the syllables drawn out. It would be cute if Reki weren't so—something. \n“Yes,\" he bites out. \"Why wouldn’t you tell me? That’s kind of a big deal!” He isn’t trying to keep the hurt from his voice anymore. \n“I thought,” Langa starts, and stops. He puts his face in his hands, and continues in a muffled voice in no language Reki knows. It makes him mad, and he knows it’s not rational, but he still reaches out and slaps Langa on the shoulder again, lightly. \nWith his hurt hand, it occurs to him after, but the pain is a little bit good even as he clutches it to his chest. It’s a part of him that hurts for an actual reason.\n“We’re friends. You’re supposed to tell me this stuff.”\nLanga’s shoulders jump. “Friends,” he says to his hand. “Right. We are friends.”\nAnd, come on. They are that, at least. Langa has to know that. What else could it be? Work colleagues? Classmates? Or—no, what if Langa thinks he’s some kind of skateboarding instructor? His best friend in seventeen years thinks he’s a skateboarding instructor. Makes sense. Super cool.\nHe sits back on his heels and savors the ache in his hand and makes himself ask, “Is it someone from class?”\nLanga pushes his board back and forth, the little rumble of the tires filling the late afternoon quiet between them as he takes a deep, audible breath, looks directly at Reki, and nods. “Yes.”\nAnd that’s a surprise. Reki tries not to let it show. “Have you guys been on any dates?”\n“Yeah. I mean, I thought they were dates.”\nThat’s… kind of sweet. Sweet in the way that feels like it's going to make Reki sick. “How have you even had time for that?” he mutters. “You spend all your time with me.”\nLanga gives him a look. Or, gives the wall over Reki's shoulder a look, before he kicks off. “If you figure out who it is, I’ll tell you.” \nHow is that fair? “Is it Chiharu?”\n“No.”\n“Are you pissed at me?”\n“No.”\n“Are you lying?”\n“...No.”\n \n \nThere are few places to go in the city that Langa won't follow, and right now, Reki needs to put his head on straight, no blue eyes in sight. Luckily, he's been dodging an invite from Miya to crash a local restaurant for weeks. A quick text and he's got someone to distract him from the sad reality he's been dropped into, because even if Miya is annoying, he's at least less annoying than the voice in the back of Reki's mind that's been whispering a thin chorus of what the fuck since Langa left him at his door.\n“What’s wrong? You look like you busted your nuts on a board,\" Miya says when he walks in. \nReki sets his bag down, and his head on the counter. “Don’t. Don’t talk like that. It’s creepy coming from you.”\nIf anything, Miya seems to take it as a compliment. “Is this about Langa?”\n“How did you know?”\n“Who else?” Miya takes a long lick off his spoon. “Where is he, anyway? I thought you two were attached at the hip.”\n“I don’t know. Probably with his new girlfriend.”\nIt comes out bitter, but it’s hard to regret it when he gets to watch Miya choke on his cream soda. Really choke, like he’s dying. His spastic coughing catches the eye of the only other customer in the restaurant, and then, naturally, of its owner.\nJoe sticks his head out from the kitchen and Miya waves him over, almost frantic. \n“What? I’m busy.”\n“Reki says Langa got a girlfriend,” Miya gasps out. \n“Oh.” Joe wipes his hands on his apron and inclines his head to Reki, gives him a quick once-over, like he's seeing him for the first time. “I didn’t know you were into that.” \n“I’m—” Not, he almost says, but runs the words over first and realizes it might be a little much. He and Langa have a social agreement. If Langa wants to—to waste time with some girlfriend, that’s none of Reki’s business. “It’s fine.”\nThey give him the particular look he’s used to getting, if usually from Oka. \n“No, seriously. I’m fine.”\nMiya looks at Joe, Joe looks at Miya, and then Joe walks back into the kitchen. He comes out a moment later with a plate of pasta smothered in cheese, tomato sauce, and what might be basil. It smells like heaven. It smells like it could make Reki forget why he’s sitting here and not on the back of Langa’s scooter heading up the mountain, or out to the beach, or to the skatepark. Anywhere. Anywhere, with Langa, felt like something new. \nHis nose feels stuffy all of a sudden. Well, maybe he's allergic to basil.\n \n \nReki’s mind is the type that can chew on something for hours and days and still find something new to gnaw on. It’s on the tip of his tongue whenever he shares space with Langa now, and the weird part is that nothing else changes. Langa follows him out of class and up to the roof for lunch the next day like this little revelation meant nothing to him at all and he hasn’t got some secret paramour waiting for him. How secret could it be? Maybe she’s some real babe. Langa could pull that off. \nAs soon as they get out and under the sun and in relative private, Langa unbuttons his uniform jacket and stretches out, straight up, all his long lines on display in the shock-bright sun. His stubborn paleness is starting to give way to the edge of a tan. Well, almost. The strip of skin exposed over his abs is still pale as paper, but he’s getting actual muscle now. He always had it, but now it's serious.\nReki peers up at him. “Did you get bigger?”\nLanga stares down at him wide-eyed. His mouth works, but no sound comes out. \n“Yeah,” Reki tells him, “Yeah you are.” \n“I am?”\n“You’re getting taller.” Reki shifts to his feet and gets as close as he can to do a quick and dirty estimation of his height against Langa’s, and yeah, he has gotten bigger. They used to be eye-to-nose, but now it’s more like eye-to-mouth. Reki has a perfect view of his lips and this close he can see the new scar at the edge of his mouth, the result of a particularly bad fall a while back. He let Reki dab antiseptic on it—“It’s bad.” “It’s not, you big baby. It’s just a little blood.” “I don’t—“ “I know. I got it.”—with only minimal complaining.\n“See? You are taller.” Reki pinches the strip of exposed skin on Langa’s hip. “Nice. Must be all the skating. It builds muscles you didn’t even know you had.” \nLanga has gone still and silent. His breath is a little off, a little forced. When Reki looks up, his face is blooming with color. “This heat really gets to you, huh?”\n“Yeah,” Langa murmurs. \n“We don’t have to eat up here. You could eat with your girl, you know. I don’t mind.”\nLanga pushes at his shoulder, forcing him back a step. “Who said it was a girl?”\n“It’s not?”\n“Is that an issue?”\nReki waves his bandaged hand. “No, no. I’m just trying to figure out which guys in our class are dateable. Aside from myself, obviously.”\n“Obviously.” \nThis is a whole new wrench, a whole new aspect to this thing that Reki has to chew over. The pickings in their class were few and far between before Langa showed up. Even Reki has had his share of love letters and behind-the-school callouts. Okay—one, but that’s a lot! Of all the boys in their class, there might be two that are within Langa’s sphere of hotness. The hair, the height, the allure of his newness, the edginess of his occasional trips to the admin office for skateboard related crimes. It’s a lot to compete with. No, scratch that. No one is on his level. Reki, maybe, barely, and only because he knows that the better half of Langa’s coolness is down to the simple fact no one else has seen him faint at the sight of his own blood or pull his sandwich into pieces before he eats it. \n“Okay, look, this is killing me. You’ve gotta give me a hint about who it is at least.” \nLanga’s face twists around the frankly obscene bite he’s taken. “Mmmm,” he says eloquently and then nods and says what might be an okay. And good. Reki sucks at riddles, but he can make something out of this. He’s known everyone at their high school for years longer than Langa has, and he has a memory for it. Every sordid detail, every time someone fell on their face at a school festival or tried to ditch out on cleaning duty.\nOnce Langa has swallowed, he takes a breath and shuffles over on his butt to sit directly in front of Reki’s lunch, cross-legged. “What do you want to know?”\n“Um… What are his best qualities?”\n“He’s kind. He helps me out, even when I don’t know I need help. He’s patient, and—”\nReki slaps at him. “Enough, enough. My teeth are gonna rot out.” Those are all things Reki could do, if Langa would let him. Nothing special, nothing new. It’s also no clue as to who it could be. “But what does he look like?”\n“That’s cheating,” Langa chides, but then gives him a long, hard look, and murmurs, “He’s as handsome as you are.”\n“Oh, cheating! Cheating? That’s cheating!” Reki waves him off and away. “But seriously. He sounds like a great guy. I’m happy for you.” The words make his lunch burn in his gut. He might be sick. Maybe it was spoiled.\nLanga stands to follow him, gathering his bag and the remnants of his lunch. “Yeah. He really is.”\n \n \nIn his head, this means he’s going to be spending less time with Langa, but that’s not how it pans out. Or, he tries, he really does, and then one night later Langa texts him after work and asks if he can come over, and what’s a boy to do? Reki is thumbing back a heart and a thumbs up before he can register what he’s doing, purely out of habit. That’s half their text history. \nThe evening finds Langa seated between his legs in Reki’s room as Reki cranes his neck to read the magazine Langa’s holding, pointing at various builds and asking all the questions he can. It feels good to be an authority on something, but— “We should switch. I can hardly see over your shoulder these days.”\n“Have I gotten that tall, really?” \nHe hasn’t, but having all of Langa right there, close and warm, is a little much for Reki’s new-found fragility. “I can be smaller,” he offers, as if that’s a real thing, but then he slides down until his head is resting against Reki’s chest and half-lying on the floor instead of any approximation of sitting. It’s cute. \nReki slides his hands into Langa’s hair. Soft, like silk, and always a little cold, like he really is made of snow. “Hey, Langa…”\n“Mm?” Langa shifts, looks up at Reki through his long lashes, and oh that blue. It can’t be real, but like everything about Langa, it somehow is. The audacity of his existence is wonderful and strange.\n“Doesn’t he mind?”\n“Who?”\n“Your boyfriend. Doesn’t he mind you being over here all the time?” Never mind that Langa is almost in his lap. \nSomething glitters in Langa’s eyes. “I hope not.” \n“Wow. Boyfriend of the year. He must be a saint.”\n“Sure is.” \nIt’s like Reki isn’t even a threat. Like it would never have occurred to Langa he was on the table at all, and man, that bites. Was he never even an option? Did Langa ever look at him that way?\nHis mind stutters to a halt. Did he—does he want Langa to look at him that way?\nLanga’s blue gaze is sharp. “What’s wrong?”\n“Nothing,” Reki tells him. “Just thinking about your board. I kinda want to try something new with the wheels.” Reki stabs randomly at a blurb in the corner of the page he’d been looking at earlier. Langa is still a slow reader, and, as ever, Langa trusts him. He could be full of shit and Langa would still look at him like his every word were some separate dictate from on high. God of Skateboarding. At least someone thinks he’s cool. \n“I trust you,” Langa says. “Whatever you think.”\nMinutes later in their shared quiet, Langa’s breathing evens out, and the magazine tips against his chest. Reki only notices because it jolts him out of his own reverie of staring at Langa’s hands. He should get up, wake Langa, or at least move him where he won’t get sore. The sun is setting outside. He considers it for two seconds and then pulls out his phone to text Langa’s mom. He got the number after the first time this happened, because he might have dragged Langa into S but he’s not about to let it affect his homelife. \nLanga is with me. We’re studying late. He sends a thumbs up emoji with it, and then a heart, because the hearts are cute, and it seems like Ms. Hasegawa would appreciate that kind of thing. \nThe phone buzzes in his hand a moment later, just as his eyes are drifting shut. Thank you for taking care of him! It comes with a heart, and Reki tries to pretend it doesn’t warm something in him. \nAs his eyes slip closed, he wonders if Langa’s boyfriend sends messages like this to Langa’s mom. If they’ve met. If she likes this man more than Reki, and trusts him with all of Langa the way Reki is supposed to. \nIt isn’t fair, somehow. It aches worse than any fall he’s taken.\n \n \nHe wakes somewhere around midnight with his arm asleep from the weight of Langa’s head, Langa’s face pressed to his chest in their little heap of shared limbs. The magazine is crushed between them; Reki pulls it free with his good arm and pushes Langa off him. And then his other arm wakes up and decides that he needs to be punished for sleeping on it. \nA plate of biscuits is on the floor next to them, with a note in his mom’s familiar scrawl. You two are so cute. \nHe glances over at Langa, at the way his mouth opens when he sleeps, at the fall of his hair over his forehead. Yeah, super cute to wake up next to someone else’s boyfriend. Super cute to feel this way about it.\nReki pulls a blanket off his bed and drapes it off Langa before he climbs up and sprawls out on it. His arm hurts. Langa's quiet breaths are too loud. He fists his hand in the part of his hoodie that's still warm from Langa, and winces at the spot of drool on it. Winces, because it isn't that gross. \nWinces, because his heart starts going double time, and that—that's gross. \nMaybe this isn't going to be as easy as he thought.\n \n \nHe lets the rush of the morning push Langa out of the house before it can get weird. Between his sisters’ endless questions and his mom pushing enough food to feed an Olympic team off on Langa, they don't have time for more than a nod and a few words. After he sends Langa safely on his way, Reki makes a decision. \nIt’s enough. \nThe thing gnawing at his gut, pulling at the space behind his ribs whenever Langa gets too close—it can’t get bigger than it is. He spends the rest of the day in the garage, working on a new rig, sanding it down to butter smooth and then polishing it to a mirror finish, trying to bat back the annoying voice in his head that can’t wait to show it to Langa. Ugh. \nAvoiding Langa isn’t so easy, it turns out. Not in his own head, and not in reality. It should be, but ignoring his texts only makes the ache grow. Even the lame excuse he musters in reply feels like too much. Spend time with your boyfriend, he wants to send instead. Not your skateboard instructor. It only gets worse as the day progresses, and by evening he's weathered a passive aggressive tweet from Miya, and an active aggressive tweet from Shadow, before he concedes that yes, he’ll be at S that night. And no, he isn’t scared. \nNot of skating, at least, and not of those two. \nWhen he steps out his front door at a half hour 'til, Langa is waiting, and Reki doesn’t have the energy to argue even that. Anyway, only Langa could make a scooter look cool. It's kind of a skill.\nReki slides on the back of the bike and braces himself on the seat. “Did you pack snacks?”\n“Yeah.”\n“Phone?” \n“Mhmm.” Langa lifts it and waves it around as proof, because the last time he forgot it, Reki had to field a call from his mom and pretend that the sounds of the track were part of a video game. He’s a terrible liar. “I brought you an extra water, too,” Langa says, tossing the bottle over his shoulder. Reki catches it with a quiet thanks and tucks it in his own pack. \n“Ready,” Reki tells him.\nLanga is still looking at him, brow wrinkled. “Wait—“ He reaches out and it’s only shock that keeps Reki from jerking back as his headband is tugged at and resettled. Langa picks at his hair a moment and then nods. “Okay. You’re good.”\n\"Thanks.\" It’s already night out, and the gates will be open before too long. Reki keeps checking his phone for the time. “We might not make it,” he warns. \nHis mistake. Langa shifts gears and no—no scooter should be able to go this fast. Reki grips the seat as hard as he can and of course, that’s the moment his arm decides to remind him about its recent trials and tribulations. He can’t stop the sound that falls from his mouth, almost a whimper.\nLanga’s head whips back. “What happened?”\n“Eyes on the road,” Reki tells him hoarsely. It hurts. He’s an idiot. A day of working in the garage, of sawing and sanding, and he thought he was better. He did, really. “Just my arm.”\n“Hold onto me,” Langa orders. When Reki doesn’t immediately comply, he reaches back and grabs at Reki’s hoodie, tugs him until Reki hasn’t got any choice but to press into his back. “Hold on,” he says again, but softer, and Reki can feel the words under his hand. \nThis close, Langa is warm, and the wind can’t touch him but to tug at his sleeves. He was right; Langa has gotten bigger, and a little stronger. The muscle under his hand jumps as he gives Langa’s abs a friendly squeeze. “Do you take your boyfriend on rides like this?” he can’t help asking. It’s an addiction, at this point, and he might as well admit it to himself, if no one else. \nLanga breathes. “Yeah. Sometimes” \n“Haah.” Reki breathes with him, and the scent of whatever soap Langa uses fills his senses. It has a familiar tinge to it, like he’s picked this up from Langa over time without ever noticing. “I bet that’s nice.”\n“It is.”\n“Can you tell me more about him?”\nIf Langa thinks its weird he won’t stop asking, it doesn’t show. “What do you want to know?”\n“Is he taller than you?”\n“A little shorter.”\n“Can he skate?”\nThey’re coming up the mountain now. Langa slows as the distant sounds of the crowd start to fill the road. “Yeah. He’s incredible.”\nWhere the fuck would Langa even meet another skater? Reki rises off his back but doesn’t let go of his waist, keeping Langa in a death grip. “Seriously?”\n“Yep.”\nAnd then they’re there, and it's hard to ask anything over the din. Hard, even, to scream at Langa the way he wants to. They must have met at S, that’s the only explanation—but who from their school goes to S? It’s insanity. He feels like his mind is spiraling away from him again, the way it did that afternoon when he almost fell out the window and literally crashed the girl’s confession. \nLanga parks and swings off, grabs his bag in one smooth motion, totally ignoring that Reki is still half-hanging off him. “Langa, wait, you have to tell me who it is.” Langa doesn’t even look at him. “Is he here tonight? Do I know him?”\nApparently ten or twenty questions is over. The look Langa gives him down his nose is the closest to true frustration Reki has ever seen. Even a week of falling on his face didn’t make him look like this. Reki releases him and shrinks back. “Sorry. I’ll stop.”\nFor another breath, the tension holds, and then Langa wilts. He shakes his head and murmurs, “You’re really dense. Come on. Let me look at your arm.”\nThey find their usual place by the rocks; Shadow is already there, trying to pretend he isn’t waiting for them or trying to hang out with them, and Miya is a few steps away, aiming for the same nonchalance. Reki ignores them both and rolls up his sleeve under Langa’s gaze. “I told you it’s fine.“\n“You always say that.” Langa takes his wrist in hand and checks it over, pressing his fingers in at the joint, and then up, using his thumbs to massage the sore muscle. “Does this hurt?”\n“Nah. I mean, a little. It feels good.” \nLanga hums and increases the pressure. Reki sags. He can’t ask Langa to stop, because it’s just the right side of painful, and he can almost feel himself melting, but it’s embarrassing in front of so many people. A glance around, though, and no is watching. No one cares at all. A few looks, but probably only because everyone wants to look at Langa. Even Miya and Shadow don’t seem to think it's anything out of the ordinary, and sure, it wouldn't have been last week, but that was before Reki knew Langa was dating someone. \nReki tugs his arm away, a little harder than he means to. “Thanks. That’s—that’s fine. You don’t need to do this much for me.”\n“You’ve done a lot for me.”\n“Yeah, but you don’t owe me. Let’s call it even, okay?”\nNot okay. \nLanga’s face is a total blank. Usually, Reki can read something on it. Not this time. \n“I’m serious. You should spend time with people you actually care about.” \nReki tosses the words into the space between them and then watches them go, like a board down a mountain, riderless, completely out of control. Langa’s face does something odd, something Reki didn’t know it could do as it falls, and his mouth twitches down, and nope. No, he regrets it. All wrong. \n“Okay,” Langa says tightly. That one word, and then he’s kicking off on his board, gone, gone, gone. \nUsually, Reki loves to watch him ride. It’s art in motion. Not so much this time. As Langa disappears into the crowd, a heavy hand comes down on Reki’s shoulder. “What the fuck was that?”\n“...Wish I knew.”\nShadow shakes his head and turns back to his own board, busy fixing something in the setup. “You riding today?” Reki asks.\nHe nods. “Miya agreed.” \nOh, what Reki wouldn’t give to be on the wall for that conversation. “Good luck.” \n“I know.” Shadow might actually be nervous. That’s a first. Reki loves to see it. \n“You know, you and I could have a rematch sometime. I’m still pissed at you for burning my board.”\n“Oh, that? Seriously? Wasn’t sending your boyfriend after me enough?”\nHis what.\n“My what?”\n“Langa,” Shadow enunciates, makes the name into three separate syllables. \n“Langa isn’t my boyfriend. Don’t even joke about that.” He’s shocked at the hurt in his voice, at the anger, and evidently Shadow is, too. The look on his painted face is a little comical. Reki meters himself, and forces out the words he has to tell himself. “He’s, uh. He’s seeing someone else.”\nIt’s tragic news. Now Reki can acknowledge the specific cruelty the universe has perpetrated upon him and him alone. But Shadow has never heard of sympathy, apparently, and what did he expect. \n“No he isn’t,” Shadow says flatly, no inflection, like he’s not teasing and not surprised, but is telling Reki this simple fact about life. “None of us care. You don’t need to hide it like that. It’s a little sappy, but—“\n“I’m serious! He's seeing someone else! He doesn’t like me like that.”\nShadow bends back to his rig, checking it over. “That ride? His first ride? He just did that because I said I was going to fuck you up again.”\n“What? No. No way, he just wanted to ride.”\n“The man duct taped his feet to a broken skateboard because he didn’t want you to get any booboos.” He gags. \nReki gives him his best, most disgusted look. “That’s not true. You don’t get him at all.”\n“It is true.\" Shadow stands and looks down at him. \"You don't understand love. I’m done here. Go ask him, if you don't believe me.” \nReki looks at Miya helplessly, but Miya's expression isn't amused. He's looking at Reki like he pities him, and, well, cool. Get in line. \"I'm done here,\" Reki says to them, to himself, to the world at large. He drops his board and kicks off.\n\"Ask him!\" Shadow yells after him. \"Ask him who his boyfriend is while you're at it!”\n“I can’t because he won’t tell me!” Reki screams over his shoulder. Fuck this day, in its entirety. This week. This month.\n“That’s because you’re a fucking dumbass!” Shadow screams back. \nCool, really cool. And now he can’t stop thinking about it. Even weaving his way through the crowd, all he can see is Langa. Langa skates because he loves it, because he’s incredible at it, because he’s like Reki. Skateboarding is their first love, but the second…\nWas Langa really trying to protect him that day? What kind of idiot would skate S for a guy he met that morning? What does it matter, anyway. It doesn't, if he’s someone else’s boyfriend. \nThat sucks. His heart beats out of time. He imagines it the way he hasn’t let himself before: Langa’s head in someone else’s lap, someone else’s hands in his fine, pale hair. Fingers sliding against the gap where his shirt rides up, pushing under the cloth, tracing over all that pale skin, all that new muscle, and oh, no. Oh, no.\nHe shakes himself, and there’s Langa, a few steps ahead. Reki stops, kicks his board into his hand. Langa is bent over his rig, messing with something, right there in the lane. His jeans are a little low, and his shirt is a little high. He’s going to need new clothes if his growth spurt gets any worse.\n“Langa.” \nLanga whips his head around, and for a moment he looks at Reki like he always does, but then his face falls back into the placid nothing he only wears, Reki is realizing, when he’s nervous. \n“Let me look at that.” Reki holds out his hand as he bends beside Langa and eyes the board he built. A loose screw on the bottom, but too loose, because this board is weird like that—nothing can be as tight as it is on a traditional board, not if Langa wants to fly, and Reki wants him to fly. He pulls out the little kit he keeps in his back pocket and starts fiddling with the hardware, testing it as he goes. This isn’t the place to do it, but Langa isn’t moving, and Reki doesn’t want to, either. Not if it’s going to have Langa walking away from him again with that slouch in his shoulders. \n“Sorry. About earlier. I guess I just…” Reki starts, but doesn't know how to finish.\nLanga won’t quite meet his eyes. \nHe’s gotta ask. For both their sakes, he’s gotta know the answer to the question that’s been stuck in his mind like a splinter from the moment he found out Langa had someone. Or, rather, that Langa had someone, and it wasn’t him.\n“Did I ever have a shot with you?” \nNow, Langa is looking at him. Blue, blue eyes. He’s so handsome it makes Reki feel stupid. He trips over his words. \n“Would you have ever considered, you know. Dating me. Before.” \n“Yes,” Langa breathes, inches away now.\nAnd that question naturally leads into another. The harder one. The one he doesn’t want to ask. “Then, uh. What did I do to mess it up?”\nThey’re breaking up the flow of traffic. Skaters jeer as they pass, but it would take a force of nature to move Reki from that spot as Langa says, “Nothing. You didn’t mess up. You could never mess up.”\nThat’s not true, obviously. Something hot is stinging the corners of Reki's eyes. “Then why aren’t you with me?”\n“I am.”\n“Not literally,” Reki begs him, and wants to cry for real. So pathetic. He hates himself a little. No wonder Langa didn’t want him—no wonder Langa won’t even tell him why. “Why aren’t we dating?”\nLanga reaches out, grabs him by the shoulders, and says, “I thought we were.” And then, to seal the paralysis Reki is experiencing, he moves so close Reki's vision blurs, and there are lips brushing over his.  \nThe jeers around them change in tone. Reki can hear it over even the rush of blood in his ears. “Wait,” he whispers, and, “Okay, wait—“\n“I was talking about you,\" Langa says against his mouth. \"I thought you, ugh.” Langa leans back on his heels and puts a hand on his forehead. “I thought you knew, and then I thought you were messing with me, and—fuck.” He curses, and it’s the first time Reki has heard him use the word.\nHe has to run it all back over in his mind. The shock in Langa's eyes, the confusion, the edge of something that might have been hurt \n“Fuck,” Reki repeats back to him, and, “Fuck. I’m so stupid.”\nBut Langa isn't done. “You send me hearts when we text. You made me a board for nothing. You—“ It’s good it’s Langa’s turn for a meltdown, because Reki is starting to see the other side of his, and it’s beautiful. To be a good skater, you have to move fast. To be excellent, you have to know what you want. To be the best, you have to know how to get it. Reki isn’t the best, but he’s getting there. At this, at least, he might have a shot. \"You let me sleep with you. Even my mom thinks—\"\n“Langa.” He can feel himself smiling, and it’s probably horrific. “Lan-ga.”\nLanga looks at him, and man, that complexion couldn’t hide a blush even if he did his face like Shadow’s. “Don’t laugh at me,” he says hoarsely.\n“You think I’m handsome? You think I’m incredible? I’m patient. You think I'm a saint.“ Reki smacks a wet kiss, high on his cheek, and Langa makes a sound like a wounded animal. It occurs to him belatedly: “If we’re dating, why don’t you ever kiss me?” \nLanga's gaze jerks to his face. “I thought you were shy,\" he murmurs.\n“I’m not.\" Reki breathes him in, nudges close. \"I’m not shy.”\nLanga shifts, Reki shifts with him, and then the mouth on his is hot and slow and ah, this. This is why he stares at Langa’s mouth so much. It makes sense now. It’s all coming together. Reki bites at his bottom lip and slips his fingers under the gap between Langa’s shirt and waistband, the way he imagined some faceless stranger doing, but it’s better than he thought it would be because it's him, and Langa’s mouth opens under his at even that brush of skin and there’s a hand pushing at his sweatshirt, gripping to find purchase, and another in his hair, pulling at it, and Langa's long legs are bracketing his—he's so hot—\nSomething grabs him by his hood and tugs him up, hard, and then he's rising off Langa, his feet kicking uselessly.\n\"What the fuck are you two doing?\"\nJoe stares at him from inches away, holding him up by the scruff of his hoodie like he weighs nothing. Cherry has his arms folded, two steps behind, and is staring between him and Langa with what could best be described as delicate disdain. \n“On the track? Really?” \nThat’s fair. Joe sets him back on his feet and Reki realizes they actually were bottlenecking the racetrack. Embarrassing, right? That’s embarrassing. It should be. He doesn’t feel embarrassed, though, and then Langa steps up next to him and takes his hand loosely, his expression back to the bored implacability he usually reserves for the school's admin office. No apology in it at all. \n\"He's my boyfriend,\" Reki tells them stupidly. \"We're dating.\"\n\"Yeah, no shit,\" Joe starts, but then he looks between them, and his brow wrinkles. “Wait, you really didn't know? You two were that gross before and you weren’t even fuck—“ Cherry slaps a hand over his mouth for him. \nAnd, well. That’s fair, too.\n“How do you know if someone likes you?” Langa asks over the stove, a week after the move is settled and done and the two of them are starting to pick up all the pieces of their new life and set them in place. The question is so far out of left field that she assumes she’s misunderstood for the time it takes her to run the words back over. His Japanese is good, but it doesn’t have the nuance of someone who was raised there yet. \n“Likes you?” she asks.\nHe turns, and she hides her wince at the new bruise on his cheek she hadn't noticed when she walked in. That boy. \"Yeah. How do I know if someone likes me?\" he repeats.\nAnd something twists in her chest. This is a problem uniquely Langa, since he hit thirteen and all the baby fat started to go out of his features, and he gained inches on her and everyone else in his class in one summer. He went from friendless to a revolving door of confessions and indifferent dates he hadn’t seemed to quite realize were just that.\nYou don't have to go out with anyone who asks, Oliver told him in the end, and she was glad. He understood Langa in a way she didn't, with all Langa’s little peculiarities, all the little acts he felt obligated to that she never noticed. She’s noticing now, for the first time. \nBut then how do I know when to say yes? Langa had asked.\nIf you care about them. Oliver had shot her a look. If you want to spend time with them.\nIf you think they're cute, she’d added. That's why I went out with your Dad.\n\nReally? That was why?\n\nAnd she’d laughed. What else?\n\nGood then. Langa will be fine. He’s got all my good looks.\n\n\nMine, you mean.\n\nAnd that was enough. He didn’t bring home word of anyone new after that— friend or otherwise. It was bittersweet for a time, and then Oliver got sick, and it wasn’t anything, because everything was the same mess of the three of them, doing their best. \nAnd then the two of them, doing what they could.\nShe shakes herself when Langa’s phone dings. He picks it up with the hand not occupied with a spatula and smiles that new smile of his. For a time, she didn’t think he would smile again at all. For a time, she didn’t think she would either, but she feels her lips tug up at the corners. “Who’s that?” she asks. \n“Oh… It’s Reki.” \nAnd that’s the first time she hears it, that name. “Are you going out again tonight?”\n“Mm, yeah. Is that okay?”\nThey never had a curfew for him. Never needed one. Of course, it’s only now biting her in the ass, but if it keeps him smiling that, it’s worth it. He’s almost too old to listen even if she tried. “Of course, but Langa.” He turns to her. “Be safe.”\n“I will.” \nHe’s lying, of course, but it’s a white lie, and one she appreciates. A few bruises won’t kill him. When he sits to eat, he puts his phone on the table beside his plate; it dings again a bite in, and he smiles. From upside-down she can see a heart, a thumbs up, a snowboarder. \n“...Did someone ask you out?” she ventures. It’s a safe bet. Reki is the safe bet.\nHis ears tint. “Yeah.”\n“And do you like them?”\nHe nods. The blush spreads. \n“Is she cute?”\n“He is.” \nOh. They never had this conversation. But somehow, it isn’t unexpected. Something unravels in her at the revelation, as if she knew somehow. Maybe Oliver did. Maybe Langa told him. \nHis brow is still furrowed. “But how do I tell if it’s a date and not hanging out?” \nShe sets her meal to the side and thinks of how to put it in terms that will make sense to him. “It depends on where you’re going. Is it somewhere romantic?  The beach at sunset,” she starts listing off, “or maybe a park? Oh! A nice restaurant. Your father loved Italian. Sometimes I think he used date nights as an excuse to get pasta. That man.” She shakes her head and twirls one of the noodles around her chopsticks, the way Oliver taught her to a dozen times with a fork and spoon, as if she hadn’t learned the first time, and needed his hand on hers to remember how. It was sweet. \nWhen she looks up, Langa is smiling, and it’s the closest thing to shy she’s seen since she started having to up at him when they talked. “But we’ve been to those places already.”\nShe chokes on nothing. “Can I see a picture of Reki?” she asks when she can form words again.\nLanga picks his phone up, taps at it for a moment, and then pushes it toward her without hesitation. \nThe photo is taken on a roof somewhere in the city, Reki glowing in the sun, skateboard in hand. He’s as bruised as Langa, and his hair is dyed a shade that would look ridiculous on any teenage boy, but somehow doesn't on him. And oh, is he cute, all boyish charm and a smile it looks like he was born wearing.\nShe thumbs over by habit. The next picture is a selfie, not taken by Langa's hand, and probably meant more to be a picture of the board Reki is holding up between them than a selfie at all. The board is blue with a monster painted in white. The part that jumps out is the look Langa is darting, not to the board or the camera but Reki. It’s familiar. It’s a look she saw on his father’s face a thousand times. \nThey make a handsome pair. \"Can you send this to me?\" she asks, turning the phone so he can see. He nods.\n \n \nShe pulls it up later in her room in the quiet alone and looks, and thinks of Oliver, and tries not to cry. \nIt doesn’t work, but for once, the tears aren’t all sad. This was never the plan. The trajectory of their lives was never this. Moving countries, finding a new job, dragging Langa with her, restarting both their lives from square one. She's had time to regret the decision, but the Langa in the photo looks relaxed the way he rarely did anywhere but on the slope back home, and happy the way he never was around anyone but them.\nNow the only real regret in her is that she's the only one there to see it.\n \n \nIt isn’t all perfect. Langa’s performance in school tanks. They have a serious talk about it; he swears he’ll do better; she settles for him passing. He’s almost never home at night, and in the morning, he’s always beat up and raccoon-eyed over the breakfast table. She wonders what it says about her that she doesn’t quite have it in her to be scared or mad about any of it. The board he carries around with him has twice as many scrapes, but when she asks him about it, he holds it that bit closer and tells her Reki made it for him. \nOnce, she calls. Curiosity gets the better of her, so she conjures up some question about breakfast and dials his number while he’s out past midnight. It goes through, which is a surprise, and then someone with a voice nothing like Langa’s answers it, and that’s another. \n“Hi, Langa’s mom!” the voice says brightly. She gives herself three guesses as to who it is and the first two don’t count. The sound in the background is deafening—cheering, screaming, what might be airhorns—the sound muffles and Reki says, “Sorry, we’re uh. Watching a loud movie. Langa is in the bathroom.”\nIt’s such a bad lie she has to cover her mouth to keep from laughing. She really has gone nuts. What would Oliver say? “Is this Reki?” she asks, only to be sure. \n“Yes!” he says, and, “Wait—Langa told you about me?”\nIt’s hard to tell through the static fuzz of background noise, and his voice is a little rough anyway, but she imagines he sounds surprised, and well. It’s not as if Langa is gushing with emotion. There are a dozen things she wants to tell him, but she settles for a light, “Once or twice,” she says, and that isn’t technically a lie, but it is a stretch of the truth if the friend Langa talks about at every meal is anyone but him. \n“Did you need me to tell him anything?”\nShe contemplates it, and then decides on a light, “No, it’s nothing.” And then, because she can, adds lightly, “I’m sure it’s troublesome, but watch  out for him for me, will you?”\nHe’s quiet a moment, and then he says with all the conviction of the young, “Of course. I won’t let anything happen to him.” \nIt’s as good as she’s going to get out of either of them, and a little better than she was looking for, honestly. \nIt occurs to her after to send Langa a quick text. Tell Reki to send me his number. And he does, and Reki does, and that’s something.\n \n \nA month later they go on an overnight trip, the two of them. A real vacation to a beach with their pooled work money and a little extra she throws in because they aren’t flush but they aren’t doing so poorly that she wouldn’t move the moon and stars to keep the excitement in Langa’s voice at the prospect. It’s a healing vacation, Reki tells her, verbatim. Something about his arm and at least they’re trying to be discreet. \nLanga comes back two days later with a sunburn, a bag of souvenirs, and a grin. It looks good on him, and she realizes he’s crossed over some line she missed; he hasn’t been a child in a long time, but he was always closer to her and Oliver than he was to anyone else. She isn’t sure that’s true anymore. It’s a revelation both bitter and saccharine-sweet, and then she opens the bag he gives her. Pilfered shells, a box of shortbreads stamped into wave shapes, assorted cakes; all the odds and ends she missed about home when she lived in Canada, all the things Oliver and him used to treat her to on the rare times they could take a family vacation. Maybe, no matter how old he is, he’ll always be young to her. \nShe has that thought, and then sees a different color under the line of sunburn on his neck. \n“Langa—what is that?” She points to the dark little bruise, though she knows what it is, what it has to be. \nHe frowns, reaches up to pull at his collar. “Oh. I think Reki did that. We were messing around.” He uses the English word for it, and she wants to put her face in her hands. It’s not like it’s a surprise, at least.\nShe musters a little courage. “Are you two sleeping together?”\n“Sometimes,” he says with indifference and not an ounce of hesitation.\nThis boy. She prays Oliver had this talk with him at some point. They mentioned it; he said he would, and Langa has to know—about all that. He’s almost eighteen. He has to know. “You’re using protection, at least, I hope.”\nHe frowns at her. “Not really. The helmet makes it hard to see and knee pads throw my balance off.”\nShe really does put her face in her hands then. “No, I didn’t mean…” \nShe eyes the picture on the shelf of the three of them, and the new one beside it, the one she added, of her son and Reki. Oliver would love this. Every moment of it. \n“Okay, Langa,” she decides. “As long as you’re happy,”\n“I am.” His phone dings. He smiles. She believes him. "
}