{
    "id": "29956665",
    "url": "https://archiveofourown.org/works/29956665?view_full_work=true",
    "author": [
        "CalistaWon"
    ],
    "title": "The Multiplayers",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "Minecraft (Video Game)",
        "Video Blogging RPF",
        "Real Person Fiction"
    ],
    "relationships": [
        "No Romantic Relationship(s)",
        "Toby Smith | Tubbo & TommyInnit",
        "Ranboo & Toby Smith | Tubbo",
        "Ranboo & Toby Smith | Tubbo & TommyInnit",
        "Ranboo & TommyInnit (Video Blogging RPF)"
    ],
    "characters": [
        "Toby Smith | Tubbo",
        "TommyInnit (Video Blogging RPF)",
        "Ranboo (Video Blogging RPF)",
        "Wilbur Soot",
        "Clay | Dream (Video Blogging RPF)",
        "Sapnap (Video Blogging RPF)",
        "Alexis | Quackity",
        "Phil Watson (Video Blogging RPF)",
        "Technoblade (Video Blogging RPF)",
        "Jack Manifold",
        "Karl Jacobs",
        "GeorgeNotFound (Video Blogging RPF)"
    ],
    "additional_tags": [
        "Alternate Universe - Bands",
        "Band Fic",
        "Music",
        "Keyboard/Synth Player Tubbo",
        "Lead Singer Tubbo",
        "Toby Smith | Tubbo-centric",
        "No shipping",
        "They're still streamers!",
        "IRL Fic",
        "Secret Identity",
        "Drummer TommyInnit",
        "Bass Player Ranboo",
        "Identity Reveal"
    ],
    "language": "English",
    "series": "Part 1 of The Multiplayers (band au)",
    "published": "2021-03-10",
    "completed": "2021-05-03",
    "words": "27,547",
    "chapters": "14/14",
    "comments": "2,391",
    "kudos": "17,927",
    "bookmarks": "3,652",
    "hits": "257,765",
    "summary": "<p>The Multiplayers are a faceless band that the internet has gone wild about. They started by playing covers and posting them on YouTube but now they’ve got a slew of original songs and one hell of a fanbase. </p>\n<p>Tubbo, Ranboo, and Tommy started the band as a joke after a stream one day because “oh, haha, we all play instruments!” but now people actually like their songs… not that anybody actually knows the songs are theirs.</p>",
    "notes": "<p>IMPORTANT: alrighty, so some of you may know this, some of you may not, but this fic used to have Purpled in it. However, Purpled recently stated that he actually doesn’t want irl him in fics, only his dsmp character, so I’ve rewritten the fic so that he is no longer in it. </p>\n<p>I’ve simply replaced all of the chapters of the older version with the new one in the same fic so that people wouldn’t lose their bookmarks. This means that there are going to be some comments about Purpled in the comments section but he’s not actually in the fic anymore so don’t worry!</p>\n<p>I’ve left the author’s notes from the original version as well (some altered to exclude purpled), but I’ve also added new notes to some chapters! The Original notes will usually come before the new ones!</p>\n<p>If you notice purpled anywhere (or any other purpled related inconsistencies) please let me know so I can fix it!</p>\n<p>While I am sad to see the original version go, making sure I am within everyone’s boundaries is top priority!! </p>\n<p>Original Notes:<br>Hi! I don’t know where this idea came from, to be honest, but I decided I just had to write it, so here you go! </p>\n<p>(For those of you who are reading my “Can’t Be Herself” series, chapter three of Destroy the Transphobes (Karl Jacobs Yells at a Transphobe) will hopefully be done soon!)</p>\n<p>I hope you enjoy the fic!</p>\n<p>-Cal</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>Here are the songs mentioned in this chapter:</p>\n<p><a href=\"https://www.youtube.com/watch?v=EFgVMw2QHMU\" rel=\"nofollow\">\"Weird!\"</a> by Yungblud </p>\n<p><a href=\"https://www.youtube.com/watch?v=R2LrGpHZ6wY\" rel=\"nofollow\">“Techno Show”</a> by Peach Pit - side note: When Wilbur mentioned Peach Pit during one of his streams, the first thing I thought of was that on their 2017 album \"Being So Normal\" there's a song called Techno Show and there's a song called Tommy's Party and like... Wilbur must have realized this. Right? </p>\n<p><a href=\"https://www.youtube.com/watch?v=6TAPqXkZW_I\" rel=\"nofollow\">\"Betty\"</a> by Taylor Swift - HOWEVER, the version of the song I imagined them doing is <a href=\"https://www.youtube.com/watch?v=ht1qGtiLWBc\" rel=\"nofollow\">this cover</a>, by Vanadeen. </p>\n<p><a href=\"https://www.youtube.com/watch?v=X3E1H_oB-Wk\" rel=\"nofollow\">\"Minutes Away\"</a> by Jeremy Shada </p>\n<p><a href=\"https://www.youtube.com/watch?v=v_B3qkp4nO4\" rel=\"nofollow\">\"Shotgun\"</a> by George Ezra - HOWEVER, the version of the song I imagined them doing is <a href=\"https://www.youtube.com/watch?v=kPoyTCnPI0Q\" rel=\"nofollow\">this cover</a>, by The Vamps - took this from Tubbo’s Spotify</p>\n<p><a href=\"https://www.youtube.com/watch?v=iZ_P3F3nA1U\" rel=\"nofollow\">\"Cabinet Man\"</a> by Lemon Demon - took this from Ranboo’s Spotify</p>\n<p><a href=\"https://www.youtube.com/watch?v=HC9dZSzlzIk\" rel=\"nofollow\">\"Midnight Memories\"</a> by One Direction - the chapter title is from this song</p>\n<p>(“Lost and Losing” is completely made up so the ‘bridge’ of that is just by me, Cal.)</p>\n<p>Thanks for reading! </p>\n<p>-Cal</p>\n<p>edit 04/08/2021: BasicallySnakespere (Tadpole music) finished writing the lyrics of \"Lost and Losing\" and recorded it! You can listen to it <a href=\"https://www.youtube.com/watch?v=J6085P4P8sQ\" rel=\"nofollow\">HERE</a></p>\n<p>Original Notes (edited):<br>Aah! Thank you for the amazing reception the first chapter got! I’m so happy that people like this! </p>\n<p>Here’s a reminder of their aliases and instruments just in case:</p>\n<p>Player One: Keys/synth, lead vocals.<br>Player Two: Bass, guitar, backing vocals<br>Player Three: Drums, some guitar, lead backing vocals</p>\n<p>Important: the twitter handles and names associated witht them that I used in this chapter are all just random things I made up off the top of my head. I haven't checked to see if they actually exist and if they do those people aren't actually connected to this fic!</p>\n<p>Anyway, here’s chapter two!</p>\n<p>-Cal</p>\n<p>New Notes:<br>Welcome to chapter 2. Again, if you’re confused about any changes to the fic, read the beginning notes of ch. 1!</p>\n<p>Also, to clarify, Ranboo is still mainly the bassist of the band. In future, if they were to do live performances and stuff, they’d pre-record the guitar parts and they would just play them as a backing track to the rest of their instrumentalization.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>Original Notes:<br>New Songs Mentioned This Chapter:</p>\n<p><a href=\"https://www.youtube.com/watch?v=mpWY4ck6yr4\" rel=\"nofollow\">“Home”</a> by One Direction - thank you milkyumiitea for reminding me of this song</p>\n<p><a href=\"https://www.youtube.com/watch?v=vh9NGs-W5bk\" rel=\"nofollow\">“I Want”</a> by One Direction - Yes, for the One Direction fans out there, The Multiplayers did in fact change the line “different date every night” to “different dick every night” when they recorded the song.</p>\n<p><a href=\"https://www.youtube.com/watch?v=hV1lpw8cUsg\" rel=\"nofollow\">“Good Kid”</a> from The Lightning Thief: The Percy Jackson Musical - this musical is a masterpiece. (Chapter title inspired by this song)</p>\n<p>(“Masked” is another made up song. The verse from that is written by me. Can you tell I can’t write songs yet?)</p>\n<p>I feel like this chapter was a little bit slow but don’t worry, things start to pick up in chapter three! </p>\n<p>-Cal</p>\n<p>New Notes:<br>Now that I’m rewriting, I’m able to go back and analyze what I wrote. For example, this line “He’s always been a little better at improv than Tubbo,” about Tommy should be taken with a grain of salt. Tubbo is, on occasion, an unreliable narrator. It doesn’t really matter who’s better or worse!</p>\n<p>Original Notes:<br>Hi! I meant to have this chapter out yesterday but it wasn’t agreeing with me. I ended up changing it a lot from what I was originally planning for the chapter but I think it works way better than it would’ve if I hadn’t changed it. </p>\n<p>Sorry for the constant cliffhangers, by the way! Also, my only beta is grammarly so if you see anything please let me know!</p>\n<p>-Cal</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>Original Notes:<br>New Songs Mentioned This Chapter:</p>\n<p><a href=\"https://www.youtube.com/watch?v=DvUeqRmUO9Q\" rel=\"nofollow\">“Told You So”</a> by Little Mix - chapter title from this song</p>\n<p>THE GOOD KID ANIMATIC IS REAL: <a href=\"https://www.youtube.com/watch?v=Khh-wCbBiqc\" rel=\"nofollow\">Good Kid || Dream SMP || Animatic</a> by Rozu Gold </p>\n<p>Thank you so much for reading! Chapter Four will be out soon and yes, you will finally get Tubbo karaoke content!</p>\n<p>-Cal</p>\n<p>Original Notes:<br>Oh wow I am so sorry for worrying everyone with Technoblade last chapter! Here’s chapter four, enjoy!</p>\n<p>(note: any names/twitter handles are completely made up. if they are similar/the same as someone's real name or twitter handle, it is just a coincidence and accident! That being said there may be a reference here or there to fictional people.) </p>\n<p>-Cal</p>\n<p>New Notes:<br>I am no longer sorry about scaring everyone with technoblade. i would also like to add that i constantly mistype his name and write technobalde by accident.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">more notes</a>.)\n</p>\n<p>Original Notes:<br>New Songs Mentioned This Chapter:<br>(for these I’ll give links to the official audio and to the performances from the TV show)</p>\n<p>“Now or Never” from Julie and the Phantoms, featuring Charlie Gillespie, Owen Joyner, and Jeremy Shada:<br><a href=\"https://www.youtube.com/watch?v=Q6bFYaVXMiY\" rel=\"nofollow\">Version From the TV Show</a> - Tubbo would be Luke (lead singer with the sleeveless shirt) but minus the guitar, Ranboo would be Reggie (bassist on the left with the leather jacket), and Tommy would be Alex (drummer in the back).<br><a href=\"https://www.youtube.com/watch?v=FujKzzSlVWk\" rel=\"nofollow\">Official Audio Version</a></p>\n<p>“All Eyes On Me” from Julie and the Phantoms, featuring Savannah Lee May - chapter title based off of this song<br><a href=\"https://www.youtube.com/watch?v=OnGinyIMAUc\" rel=\"nofollow\">Version From the TV Show</a> (shorter than the official audio but fun to watch)<br><a href=\"https://www.youtube.com/watch?v=nthLFG9V0IA\" rel=\"nofollow\">Official Audio Version</a></p>\n<p>(“False Niceties” is another CalistaWon original and it is not my best.)</p>\n<p>The whole ‘secret identity’ thing is drawing attention to The Multiplayers. And things are getting a little heated on Twitter… </p>\n<p>-Cal</p>\n<p>(edit 15/04/2021: shayisgay (<a href=\"https://twitter.com/shayishellagay\" rel=\"nofollow\">@shayishellagay</a> on Twitter) made “False Niceties”!! You can listen to it <a href=\"https://www.youtube.com/watch?v=Ocu7fTp5Xlg\" rel=\"nofollow\">HERE!</a>)</p>\n<p>New Notes:<br>Ahahaha i forgot i wrote a The Multiplayers anti into this fic.</p>\n<p>(edit: 09/06/2021: Mafu sang \"False Niceties\" using the instrumental that shayisgay made!!! You can listen to it <a href=\"https://www.youtube.com/watch?v=62kkSYxM71I\" rel=\"nofollow\">HERE!</a>)</p>\n<p>Original Notes:<br>Oh my goodness. Thank you all for reading this and thank you for the kind words I’ve been receiving. Seriously, thank you.</p>\n<p>So first I should say that this chapter is much shorter than the other chapters in this story and that is on purpose. Chapter 6 will go back to being the usual chapter length. </p>\n<p>I’d also like to direct you to Chinnii’s Twitter (@/Katilieen). They made some amazing art for this fic! You can find it in <a href=\"https://twitter.com/Katilieen/status/1371670880493912066\" rel=\"nofollow\">this thread!</a> </p>\n<p>-Cal</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">more notes</a>.)\n</p>\n<p>Original Notes<br>New Songs Mentioned This Chapter:</p>\n<p><a href=\"https://www.youtube.com/watch?v=XeF_eRMTsuY\" rel=\"nofollow\">“Grow Up”</a> by Paramore<br>...<br>Again, check out Chinnii (@/Katilieen)’s art! You can find it <a href=\"https://twitter.com/Katilieen/status/1371670880493912066\" rel=\"nofollow\">here!</a> </p>\n<p>Anyway, thank you for reading!</p>\n<p>-Cal</p>\n<p>Original Notes:<br>I’m back! I know it’s been a while since the last update! Sorry! I needed a mental health break. Hopefully I won’t be gone for long again but I am getting close to the end of my first year of university so I can’t make any promises! </p>\n<p>Also, check out <a href=\"https://twitter.com/GhostFox667/status/1370645060845469699\" rel=\"nofollow\">this cosplay</a> of Ranboo singing “Weird!” by Dream_nootInnit (@/GhostFox667 on Twitter)! </p>\n<p>I hope you like this chapter!</p>\n<p>-Cal</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">more notes</a>.)\n</p>\n<p>Original Notes:<br>Okay a little disclaimer: I obviously don’t ship minors, and the ‘Tubbo wanting to create a romance with Player One’ thing isn’t speculation on Tubbo’s sexuality. It’s more or less the same dynamic that Tubbo and Ranboo have with their whole platonic marriage thing on the smp. Except for the fact that Tubbo is Player One which means they can’t actually be shipped together… </p>\n<p>New Songs Mentioned This Chapter:</p>\n<p><a href=\"https://www.youtube.com/watch?v=mWv7Vfku6w4\" rel=\"nofollow\">“Channel 5 News: The Musical”</a> by Bo Burnham </p>\n<p><a href=\"https://www.youtube.com/watch?v=pj_fZjn3zQc\" rel=\"nofollow\">“Two Player Game”</a> from Be More Chill (featuring George Salazar and Will Connolly) - Suggested by someone anonymous on Tumblr with advice on who should sing what part from Twitter and Tumblr - Chapter Title from this song</p>\n<p><a href=\"https://www.youtube.com/watch?v=Xa0Swz3X1cQ\" rel=\"nofollow\">“Your New Boyfriend”</a> by Wilbur Soot - I figure we probably all know this one..?</p>\n<p>(“I’ll Be There” is another CalistaWon original. This is probably my favourite of the ones that I’ve written? Not sure, though.)</p>\n<p>The podcast and the record label are fake. I have no idea how record labels actually work so we’re just going to pretend like this is it. I figured since Wilbur doesn’t use Twitter, he wouldn’t contact them that way, and he probably wouldn’t do it in a YouTube comment. The Multiplayers don’t have a public business email, so contacting the label would seem like the best option. </p>\n<p>Again, check out <a href=\"https://twitter.com/GhostFox667/status/1370645060845469699\" rel=\"nofollow\">this cosplay</a> of Ranboo singing “Weird!” by Dream_nootInnit (@/GhostFox667 on Twitter)! </p>\n<p>Thanks for reading!</p>\n<p>-Cal</p>\n<p>edit 18/06/2021: hurricanekadence created I'll Be There!! You can listen to it <a href=\"https://www.youtube.com/watch?v=wB0ReQycraA\" rel=\"nofollow\">Here on YouTube</a> and <a href=\"https://soundcloud.com/hurricanekadence/ill-be-there\" rel=\"nofollow\">Here on Soundcloud</a>!!</p>\n<p>Original Notes:<br>Hi! Thank you all for the kind words on my last chapter! </p>\n<p>Hope you like this one!</p>\n<p>(Also, if you'd like to know what The Multiplayers named their instruments, I posted about it <a href=\"https://calistawon.tumblr.com/post/646029786508083200/hi-first-of-all-i-absolutely-love-your\" rel=\"nofollow\">here</a> on my Tumblr.)</p>\n<p>-Cal</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">more notes</a>.)\n</p>\n<p>Original Notes:<br>New Songs Mentioned This Chapter:</p>\n<p><a href=\"https://www.youtube.com/watch?v=VzHtfnCDASA\" rel=\"nofollow\">“That Unwanted Animal”</a> by The Amazing Devil - chapter title from this</p>\n<p><a href=\"https://www.youtube.com/watch?v=2mBVP9Z_sac\" rel=\"nofollow\">“Fair”</a> by The Amazing Devil - yes, there’s a ‘The Office’ reference</p>\n<p>Honestly, The Amazing Devil is probably one of my favourite bands so I just had to include them. I would really recommend checking out some of their other stuff! <a href=\"https://www.youtube.com/watch?v=4PSvYqYTBI8\" rel=\"nofollow\">“Farewell Wanderlust”</a> is definitely one of my favourite songs but unfortunately it just didn’t seem to work with this fic.</p>\n<p>Anyway, uh, sorry for the cliffhanger?? </p>\n<p>-Cal</p>\n<p>Original Notes:<br>Oh my god I am so sorry that this chapter took so long to come out!!! I didn’t mean to leave you for so long on such a big cliffhanger! Unfortunately: university. Also, this chapter just didn’t want to cooperate at first. </p>\n<p>Thank you for your reactions to the last chapter! I appreciate all the support that this fic is getting! </p>\n<p>-Cal</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_8_endnotes\">more notes</a>.)\n</p>\n<p>Original Notes<br>New Songs Mentioned This Chapter:</p>\n<p><a href=\"https://www.youtube.com/watch?v=56OlKB5OhcA\" rel=\"nofollow\">“Fearless”</a> by Louis Tomlinson - chapter title from this song</p>\n<p>I really recommend listening to the song so you can get the full experience of the chapter! </p>\n<p>I also wanted to say that, as you may have noticed, updates are going to be slowing down a bit. I’m coming up on the end of this term of university. Don’t worry, though, I’m not going to abandon this fic!</p>\n<p>Thank you again to everyone for reading!</p>\n<p>-Cal</p>\n<p>New Notes:<br>ranboo swore!!</p>\n<p>Original Notes:<br>Hi! I honestly have no idea what to put in the notes today. I should really be studying right now… </p>\n<p>Enjoy the chapter!</p>\n<p>-Cal</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_9_endnotes\">more notes</a>.)\n</p>\n<p>Original Notes:<br>New Songs Mentioned This Chapter:</p>\n<p><a href=\"https://www.youtube.com/watch?v=TQ7KWsu1jQI\" rel=\"nofollow\">“Hydrangea”</a> by Census</p>\n<p><a href=\"https://www.youtube.com/watch?v=SOXGj_ciGfY\" rel=\"nofollow\">“Hydrangea Reimagined”</a> by Census</p>\n<p><a href=\"https://www.youtube.com/watch?v=AgEJK6Vk8Ro\" rel=\"nofollow\">“Ex-Wives”</a> from SIX The Musical - chapter title from this song - <a href=\"https://www.youtube.com/watch?v=aNkvQiozuOQ\" rel=\"nofollow\">HERE</a> is a lyric video version in case you want to know who sings what lines.</p>\n<p>Also! <a href=\"https://www.youtube.com/watch?v=MpurlUoPI5U\" rel=\"nofollow\">HERE</a> is a male cover of Ex-Wives that’s really good! This would be more like how The Multiplayers do the song. </p>\n<p>Listen I just really badly wanted them to do SIX…<br>(btw, the ‘British Hamilton’ thing is something one of my siblings said and my response to that was pretty much Tommy’s response in this)</p>\n<p>Thanks for reading!</p>\n<p>-Cal</p>\n<p>Original Notes:<br>Hello! I feel like it’s been so long since I updated! I was going to write and post this chapter a few days ago but I got distracted writing something else (ballet!tubbo). And then yesterday I wrote trans!benchtrio. But the chapter is here now!</p>\n<p>Anyway, I’ve planned out the last few chapters of this fic. It’ll probably be another 2 or 3 chapters and a short epilogue.</p>\n<p>Thank you again to everyone for reading and thank you for all of the kind comments! </p>\n<p>-Cal</p>\n<p>New Notes:<br>Hello. I have gotten to the point of reuploading this fic where i've decided i hate formatting. Why did i involve so many tweets in this fic??? </p>\n<p>in all seriousness, though, while formatting is really difficult, i'm glad i'm doing this. it gave me a chance to go back and fix grammatical mistakes (i'm sure i've missed plenty, but still) and it's a huge relief off of my chest. the half hour between when i found out about purpled's new boundaries and when i figured out how to hide the fic without deleting so i could rewrite it, i felt so bad? i'm happy i'm fixing it!!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_10_endnotes\">more notes</a>.)\n</p>\n<p>Original Notes (edited):<br>New Songs Mentioned This Chapter:</p>\n<p><a href=\"https://www.youtube.com/watch?v=1OeiYxdteTQ\" rel=\"nofollow\">“C’est La Vie”</a> by Weathers - This was recommended in the comments of a previous chapter by AnneOfTheDawn. I hadn’t heard of Weathers before, so thank you! Their music is great! </p>\n<p><a href=\"https://www.youtube.com/watch?v=dQw4w9WgXcQ\" rel=\"nofollow\">“Never Gonna Give You Up”</a> by Rick Astley - Alright this one was inspired by PixiePowders’ comments! It’s not exactly what they had in mind in the comment but I liked the idea too much to ignore it so I decided I would figure out a way to include it! - also the chapter title is from this!</p>\n<p>(\"Flowers\" is another one that I wrote!)</p>\n<p>(I want to add that I won't be able to get to everyone's song suggestions but I really appreciate them anyhow. I'll probably make another fic that's just a list of songs I think The Multiplayers would cover and how they would do it (like who sings what and stuff like that) if people are interested in that!)</p>\n<p>If you’d like to know the real reasons behind the ATLA bender tweets (they aren’t very serious...) then here you go:<br>Tubbo - Fire: Nukes and other explosives.<br>Ranboo - Earth: enderman pick up grass block<br>Tommy - Air: This was the hardest yet easiest to decide on? I really don’t know how to explain it other than it feels right.<br>(I think if I was being more serious about it then these would be different but I didn't really spend a lot of time thinking about it. The only one I'm super attached to is air bender Tommy)</p>\n<p>About Ranboo travelling to the UK: please don’t travel unless you have to! And if you have to stay safe! The timeline of this story is vague enough that I figured I could get away with them travelling. Stay safe everyone!</p>\n<p>-Cal</p>\n<p>New Notes:<br>Someone in the comments mentioned chickeninnit as the reasoning behind airbender tommy and i 100% agree with you.</p>\n<p>Original Notes:<br>It feels like it’s been forever since I updated even though I know it’s only been a week or so. I’ve been crazy busy with university (finals have started…) so the next update might not come until next week or the week after that! Sorry!</p>\n<p>Big Announcement: shayisgay (<a href=\"https://twitter.com/shayishellagay\" rel=\"nofollow\">@shayishellagay</a> on Twitter) made “False Niceties” (the song Ranboo/Player 2 wrote)!! You can listen to it <a href=\"https://www.youtube.com/watch?v=Ocu7fTp5Xlg\" rel=\"nofollow\">HERE!</a> </p>\n<p>I’ve also made a book that has the full lyrics to some of the songs that I wrote for this (I made it part of this series so it’s easy to find). A few people have asked to do covers, so if you want to, go ahead! Just make sure to credit me for the lyrics. Sending me a link would also be cool, so I can see it! </p>\n<p>Alright, that’s everything! Enjoy the chapter!</p>\n<p>-Cal</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_11_endnotes\">more notes</a>.)\n</p>\n<p>Original Notes:<br>Extra EP name ideas from: PixiePowders and stormieminds - their comments on Chapter 5. (if you two don’t want me to have those ideas in there just let me know!)</p>\n<p>New Songs Mentioned This Chapter:</p>\n<p><a href=\"https://www.youtube.com/watch?v=WYBhSVjqQwY&amp;list=PLL2LlLhJaqCXUI3v4D1OkX3KnThsyyqwP&amp;index=1\" rel=\"nofollow\">“Sorry”</a> by Joshua Bassett - chapter title from this</p>\n<p>Again, go listen to <a href=\"https://www.youtube.com/watch?v=Ocu7fTp5Xlg\" rel=\"nofollow\">“False Niceties”</a> by shay (shayisgay / <a href=\"https://twitter.com/shayishellagay\" rel=\"nofollow\">@shayishellagay</a> on Twitter)! </p>\n<p>Like I said in the beginning note, I made a book that has the full lyrics to some of the songs that I wrote for this (I made it part of this series so it’s easy to find). A few people have asked to do covers, so if you want to, go ahead! Just make sure to credit me for the lyrics. Sending me a link would also be cool, so I can see it! </p>\n<p>Now there’s just one or two chapters (likely just one unless I have too many ideas) and an epilogue left!!</p>\n<p>Small teaser for the next chapter: one of the notes I have on my ‘ideas’ doc for ch. 12 is “Wilbur does an oopsie”.</p>\n<p>Thanks for reading!</p>\n<p>-Cal</p>\n<p>Original Notes:<br>I finished my first year of university AND it’s my 19th birthday (25/04) so here’s another chapter!!! It’s a short one BUT I’m going to upload another one in a couple of hours! </p>\n<p>This was all originally going to be one chapter but it got really long so I split it up into this short interlude and then a longer chapter 13. </p>\n<p>Hope you like it!</p>\n<p>-Cal</p>\n<p>New Notes:<br>I originally posted this on my birthday? that feels like so long ago oh my god.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_12_endnotes\">more notes</a>.)\n</p>\n<p>Original Notes:<br>Like I said, chapter 13 will be up within the next few hours! It’s the Big Reveal! </p>\n<p>Also… new faceless singer in town? Miss Keledones is named after the singing automatons that Hephaestus made out of gold (the Keledones, sometimes spelled Celedones) in Greek mythology. They were apparently amazing singers who were potentially as good as the Muses.</p>\n<p>Thanks for reading!</p>\n<p>-Cal</p>\n<p>Original Notes:<br>Thank you all for the birthday wishes! As promised, here’s chapter 13!</p>\n<p>This is the last chapter before the epilogue! Writing this fic has been one hell of a journey and I want to thank you all (again, I know) for commenting, leaving kudos, and even just reading this! </p>\n<p>Enjoy!</p>\n<p>-Cal</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_13_endnotes\">more notes</a>.)\n</p>\n<p>Original Notes (edited):<br>New Songs Mentioned This Chapter:</p>\n<p><a href=\"https://www.youtube.com/watch?v=43fTwdrcziA\" rel=\"nofollow\">“Bugbear”</a> by Chloe Moriondo - recommended by Daydream_Child</p>\n<p><a href=\"https://www.youtube.com/watch?v=SKbCpQVZ-Ts\" rel=\"nofollow\">“One Little Lie”</a> by Simple Creatures - recommended by ChaosInTheKitchen</p>\n<p><a href=\"https://www.youtube.com/watch?v=Wk008ADh4iY\" rel=\"nofollow\">“The Other Side”</a> from The Greatest Showman, featuring Hugh Jackman and Zac Efron </p>\n<p><a href=\"https://www.youtube.com/watch?v=4THFRpw68oQ\" rel=\"nofollow\">“Bang!”</a> by AJR - recommended by Gabbygirl317 - the previous chapter title (chapter 12) is from this song</p>\n<p><a href=\"https://www.youtube.com/watch?v=wxDFIiTuxsM\" rel=\"nofollow\">“In My Head”</a> by Derivakat</p>\n<p><a href=\"https://www.youtube.com/watch?v=i_Vm6xSveiA\" rel=\"nofollow\">“Welcome Home”</a> by Derivakat</p>\n<p><a href=\"https://www.youtube.com/watch?v=2mIWJWi4Bhk\" rel=\"nofollow\">“Ain’t No Crying”</a> by Derivakat - also check out <a href=\"https://www.youtube.com/watch?v=wPiOtS9SZo0\" rel=\"nofollow\">“Honey”</a> by Derivakat!</p>\n<p>(“Singleplayer” by The Multiplayers ft. Wilbur is another one that I wrote myself! - chapter title from this)</p>\n<p>...<br>The epilogue will include everyone’s reactions!!! (The Feral Boys, Technoblade, Twitter…) </p>\n<p>The Masks from the “Bang!” face reveal announcement:</p>\n<p> <a href=\"https://i.ebayimg.com/images/g/IuYAAOSwv~RdGD1F/s-l400.jpg\" rel=\"nofollow\">Ranboo’s Mask</a></p>\n<p> <a href=\"https://i.pinimg.com/originals/ba/0f/84/ba0f847e6d4efad7886860cb8b79c68e.jpg\" rel=\"nofollow\">Tubbo’s Mask</a></p>\n<p> <a href=\"https://i.ebayimg.com/images/g/ihUAAOSwH1pcS4mq/s-l300.jpg\" rel=\"nofollow\">Tommy’s Mask</a><br> </p>\n<p>Also, someone anonymous on Tumblr mentioned a while ago that maybe I should set up a Discord server? Is that something that people would be into? I’m honestly not sure how I would go about doing that so if anybody has any tips they would be greatly appreciated!</p>\n<p>Thanks for reading!</p>\n<p>-Cal</p>\n<p>Edit 26/05/2021: Someone made ‘Singleplayer’!!! Wonder (@wonder_disaster on Twitter)!! <a href=\"https://twitter.com/wonder_disaster/status/1397617618807316483?s=20\" rel=\"nofollow\">Here’s The Link!</a> This is the original version. </p>\n<p>Edit 13/06/2021: The final version of 'Singleplayer' by Wonder and Kade can be found <a href=\"https://twitter.com/wonder_disaster/status/1404239901911027714?s=20\" rel=\"nofollow\">Here on Twitter</a>, <a href=\"https://soundcloud.com/hurricanekadence/singleplayer-ft-wonder\" rel=\"nofollow\">Here on SoundCloud</a> and <a href=\"https://www.youtube.com/watch?v=snquAy1sL80\" rel=\"nofollow\">Here on YouTube!</a> (find them at @wonder_disaster and @hurricanekade)</p>\n<p>New Notes:<br>still thinking about Tommy and Ranboo doing \"The Other Side\" together. still thinking about it.</p>\n<p>also \"Singleplayer\" is probably my favourite of the songs i wrote for this.</p>\n<p>Original Notes:<br>This is it…</p>\n<p>There’s a longer note at the end but I just wanted to say thank you again. Writing this has been so much fun and though I’m sad to see it end, I’m really happy that you guys seem to have enjoyed reading it as much as I have enjoyed writing it. </p>\n<p>Here’s the epilogue.</p>\n<p>-Cal</p>\n<p>(ps: again, any twitter handles/extra names are all randomly made up off the top of my head. Some are also from an online generator)</p>\n<p>New Notes:<br>I made it to the epilogue oh my god formatting takes so much time!!!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_14_endnotes\">more notes</a>.)\n</p>\n<p>Original Notes:<br>Miss Keledones in Chapter 12 wasn’t mentioned for no reason..?</p>\n<p>Okay now get ready for sappy endnotes:</p>\n<p>Wow! I can’t believe this is the end! Which is why it might not be! I’m thinking about writing a sequel (though I’m not sure yet, so no promises!) I really like this world I’ve created. Writing it, writing these characters and all the shenanigans that they get themselves into, it’s honestly been so much fun. </p>\n<p>So yeah, I won’t promise anything, and I really don’t want to overwrite this (if that makes sense), but I do have ideas that I wasn’t able to get around to in this book. It would be nice to write more! That being said, I do have other fics I want to write (for example, I need to finish my Broadway Ranboo fic “King of New York”) so if a sequel does happen, it might not be right away!</p>\n<p>I honestly can’t thank you all enough for commenting, leaving kudos, and continuing to read every chapter! When I first started writing this, my plan was to have two or three fun little chapters about these four being a band. That… didn’t happen, but I’m so glad that you guys stuck around! </p>\n<p>Lastly, I am currently setting up a Discord server. I’ve never done that before so it’s taking some time. (If anybody has any tips/suggestions, feel free to let me know!) Once it’s ready, I will possibly - temporarily? - add another chapter onto this fic that will just have the link to the Discord for those of you who want to join. Otherwise, it’ll be in my ao3 profile and i’ll probably link it on twitter and tumblr. </p>\n<p>Thanks again (I know, I keep saying that)</p>\n<p>-Cal</p>\n<p>(tldr: Possible sequel, thank you!!!, Discord server coming soon, thank you!!!)</p>\n<p>New Notes:<br>Yep | @Hen118 is my favourite OC</p>\n<p>Alright, I'm going to say thank you again. Not surprising. Like I said before, while I will miss the original version of this fic, I'm not upset about having to change it. I don't want anything that goes against cc boundaries in my ao3 works. So thank you all for bearing with me while I hid the fic and reworked it. </p>\n<p>Also, thank you for 100k hits! that's so cool! </p>\n<p>Alright, one last thing, the 'possible sequel' i mentioned in the original notes IS happening! I'm in the process of writing it and i will hopefully begin uploading chapters soon! (don't worry, this doesn't mean i've abandoned the other works i'm currently writing! I'll still be updating those!)</p>\n<p>I have a Spotify playlist! I’ll be adding all of the original songs that The Multiplayers make covers of to it as I write the story! You can find it <a href=\"https://open.spotify.com/playlist/1dPYmR2JuwWm2vfnBIjQW1?si=6cfa5cdff6814c98\" rel=\"nofollow\">HERE!</a></p>\n<p>I also now have a tumblr: <a href=\"https://calistawon.tumblr.com/\" rel=\"nofollow\">calistawon</a></p>\n<p>Twitter: @/CalistaWon</p>",
    "text": "It starts with Bedwars. Ranboo had wanted to do a video with Tommy and Tubbo so they’d joined one of his streams to get footage. Tubbo has fun. It’s nice to just let loose and have a little fun with his friends every once in a while. When the stream ends, Tommy and Ranboo continue to play while Tubbo messes around with his keyboard, playing random songs into the mic. \n“Oh!” Tubbo exclaims at one point.\n“Oh?” Ranboo asks. \n“Shit!” Tommy shouts as his character gets knocked into the void. \n“I got a new instrument!” Tubbo says happily, ignoring Tommy’s grumbling.\n“What is it? Another ukulele?” Ranboo jokes. Tubbo snickers, looking to the several ukuleles he’s already got hanging on his wall. \n“No,” Tubbo says. “It’s a synthesizer.”\n“Wait, really?” Ranboo asks. “A synth?” \nTubbo hums in conformation. It’s a really cool instrument and though it took a while to get the hang of it, he doesn’t think he’s half bad. He’s created some pretty great sounds with it. \n“Damn,” Ranboo says. “That’s actually pretty cool.”\n“Thank you,” Tubbo says, then laughs as Tommy dies and Ranboo wins the game. \n“Fucking hell!” Tommy shouts. He sighs and they start up a new game. Halfway through, Tommy starts laughing, “Ha! Everybody but Ranboo plays an instrument.”\n“Wait what do you play?” Ranboo asks.\n“Piano,” Tommy admits immediately, then, clearing his throat, he quietly adds, “and drums.”\n“You play drums?” Ranboo asks, ignoring the jab. \n“Yes!” Tommy shouts as he wins a fight and breaks somebody’s bed. “And yes, I play the drums. What of it?”\n“Nothing, just…” Ranboo starts laughing uncontrollably. “We- we could make a band!” he barely gets the words out as he laughs. Tubbo starts laughing too. That would be cool. And hilarious. Twitter would have a field day. \n“Are we ignoring the fact that you can’t play an instrument?” Tubbo asks him. \n“Don’t trust what Tommy says,” Ranboo tells the other boy. “I play bass.”\n...\nSo, Tubbo knows it started as a joke but… it actually sounds pretty cool. Starting a band, that is. Turns out, Ranboo also knows how to play guitar. It’s a few days later and they’re all on call with one another again, none of them streaming, when  Tommy, of all people, brings it up again. \n“What would we even call ourselves?” Tommy jokes. He gets three answers in quick succession.\n“The Bumblebees,” Tubbo jokes immediately.\n“The Children,” Ranboo suggests, even less seriously.\n“The Multiplayers,” Tubbo says. \nThe call goes silent for a moment, then Ranboo says, “Hold on. Tubbo, that isn’t bad.” \n...\nOne thing leads to another and… suddenly, they’re posting a song to YouTube on a new channel called The Multiplayers. The channel isn’t linked to any of them and the song is just an audio - over an image of a sunset Ranboo took a while ago - so nobody can connect their faces to their channels. They collectively decided that they wouldn’t show their faces as The Multiplayers so that if people liked them, they liked them for the music, not because they were already fans. Plus, it’s kind of funny having some sort of secret identity. \nThe song they post is a cover of “Weird!” by Yungblud and Tubbo isn’t sure how it happened but he ends up being lead vocals. It was difficult to put together, considering they’re scattered across two different countries and all. However, with learning how to use the synth, Tubbo learned a little about mixing too, so he was able to put all of their separate pieces together into one song. \nRanboo ends up having to record twice, since he’s the designated bass player  and the designated guitar player, but it works out in the end.\nThe video gets four views, and three likes, probably from Yungblud fans who were just looking for covers. \nNone of them really care that it doesn’t get much attention. It was just a fun thing they figured they’d do because  why not?  \nAfter doing “Weird!” and generally having a lot of fun with it, Ranboo suggests they just keep doing covers. Tommy agrees, citing that it’s nice to actually be doing something with his drumming knowledge since he hasn’t really played much since getting big on Twitch (and since starting college). \n“Even if mother and fatherinnit complain about all the noise,” Tommy says, as if he’s actually making more noise than he usually does (he’s not, it’s just a different  kind of noise).\nThe second song they do is “Techno Show” by Peach Pit. It doesn’t really require any piano or synth which ends up reinforcing Tubbo’s role as lead vocalist. Tommy ends up as, like, the  lead backing vocalist  because Ranboo isn’t sure if he’s comfortable actually recording his singing yet. Ranboo also ends up having to do both the lead guitar  and the rhythm guitar parts in addition to the bass parts. It’s fine, though, because then Tubbo just mixes it all together. \nThe video is once again only audio with no video footage, just a poor-quality photo Tubbo took of a rainy sky last week. This time they overlay the photo with the title of the song and the original band’s name, as well as their band’s name. \nIt gets one view, one like, not that any of them notice. They  are still busy doing other things like making videos and streaming on the Dream SMP. \n...\nTommy proposes they cover Taylor Swift on the same day that Ranboo suggests they make a TikTok account, which Tommy vehemently opposes. \n“It  is  how I got big as a streamer, though,” Ranboo urges. “Well, that and the SMP… But it would give our band a bit more exposure! We just have to upload, like, a few seconds of one of our covers and then tell people to check us out on YouTube.”\nTommy leaves the Discord call. Tubbo laughs, snorting at his friend’s antics. When Tommy returns a few seconds later, he sighs heavily. “Fine,” he pretends to say begrudgingly, “we’ll make a TikTok.”\nThey record a cover of “Betty” first. It’s a little more pop-punk than Taylor Swift’s version but it sounds nice. Tubbo gets to play around with some effects on the vocals (his again, he thinks he may have officially been dubbed lead singer) when he’s mixing the song to get a sort of far-away effect on the second part of the pre-chorus after verse three. \nThey post the audio from the first chorus on TikTok. \nThey post the full cover on YouTube.\n “Betty” gets forty-six views, and twenty-seven likes. The Multiplayers get eleven subscribers.\n...\nIt’s  One Direction that makes The Multiplayers famous. It’s been a few months since they started the band. They’ve covered songs like “Minutes Away” by Jeremy Shada, “Shotgun” by George Ezra (in which Ranboo joined Tommy in doing backing vocals), a few more Peach Pit songs, and “Cabinet Man” by Lemon Demon. Tommy has been teaching himself guitar so that he and Ranboo can alternate playing for different songs.\nAnd then Tubbo and Tommy are in a call with the Dream Team and Quackity one night. And Sapnap is streaming. And he gets a dono asking him what his favourite One Direction song is. \nSapnap, Dream, and Quackity get into a small debate over it and eventually conclude that Midnight Memories and Night Changes are pretty okay.\nTubbo knows that the second they say that, Tommy  must have a shit-eating grin on his face. Sure enough, just a second after everyone has moved on from One Direction, Tommy sends something to The Multiplayers Discord chat. \nAnd  that is how they end up doing a cover of “Midnight Memories” by One Direction.\nAll three of them sing. They each play their parts. Tubbo mixes it all together. \nThey post it on YouTube.\nThey post a clip of it on TikTok. \nIt  blows up. \nThe  band blows up. \nBecause of  One  fucking  Direction.\nTubbo laughs about it with Ranboo for a good ten minutes after they realize that. \n...\nA week after  One Direction, The Multiplayers have a pretty decent following. A lot of the people who watched “Midnight Memories” clearly went back and listened to their other covers because the viewer counts on those increase drastically. \nBut then people start  asking about them. The band has created a Twitter and an Instagram at this point and they keep getting questions. Who are you? How many members are in your band? Do you make original music? What are your names? Who plays what? \nSo they go with:\n \nPlayer One: Keys/synth, lead vocals.\nPlayer Two: Bass, guitar, backing vocals\nPlayer Three: Drums, some guitar, lead backing vocals\n \nAnd people kind of  love it. They like the mystery, the secrecy, the unknown. And so, The Multiplayers amass a following. \n...\n“I wrote a song,” is the first thing Tubbo says when The Multiplayers have their next call. He’s really excited about it, especially since he wrote it for his ukulele instead of on keys. \n“Oh,” Ranboo says. “Me too.”\n“Are you guys being serious?” Tommy asks, sounding incredulous. Is this something to be incredulous about? \n“Yes?” Tubbo responds. Ranboo hums. Tommy starts laughing, which isn’t unusual for Tommy but is unusual in the sense that Tubbo doesn’t understand what’s funny. \n“I wrote a song as well,” Tommy says, catching his breath. Okay, yeah, it’s pretty funny, Tubbo must admit. \n“Wait, Tommy, really?” Ranboo asks.\n“What?” Tommy says, a little defensively. “You sound surprised. Don’t think I can do it, Big Man?” \n“No, no,” Ranboo says. “I just didn’t know writing was something you wanted to do. Let’s hear it. But, uh, before you start. I should tell you guys that I may have also written another one. A song, I mean. I’ve got two.”\n...\nThey end up releasing one of Ranboo’s songs first, mostly because it’s easier to add other instruments to a song that was originally written on a guitar. At least, for them it is. They aren’t exactly  professionals. It takes them a while to figure things out, but once they get into the swing of writing, they all get pretty excited about it. \nIt’s called “Lost and Losing” and somehow, despite being written by their lead guitarist, didn’t have a guitar solo until  after the other two of them had gotten their hands on it. It’s a bit of a slower pop-rock song and Tubbo really enjoys the bridge;\n\n When rivers dry\n\nLeaving scars behind,\n\nAnd when cities sink\n\nBeneath waves and rage,\n\nI’ll wander,\nAnd I’ll wonder,\n\nAre we out of time?\n\nThey use The Multiplayers’ Twitter to contact an artist, commissioning them to make cover art for the song. Unfortunately, the only artists they really know of are ones who often make fanart for the Dream SMP, which means that a rumour starts that The Multiplayers are fans of the SMP. It’s not terrible, but they  would  have liked for there to be absolutely  no connection between the band and the SMP. \nFortunately, people who make Dream SMP fanart are  very  good at what they do, and the cover art turns out  amazing.  (And, if, because of the rumours, their following grows a little bit, well, they aren’t complaining. There’s a reason they post their music to YouTube. They want to share it with people.)\n...\nThe song gets really popular. The following they had from their covers only grows. “Lost and Losing” gets nine thousand views in its first week. That’s nothing compared to the numbers that they get as gaming youtubers and streamers but it’s pretty significant considering their band has only existed for a few months. \nThings are going well. Things are going  great! People actually enjoy their music, whether it’s their original song or their covers. Tubbo loves reading the comments that talk about each of them individually. The ones that say  the bass sounds so good!  The ones that say  that person’s an amazing drummer, wow.  The ones that say  that piano sounds extraordinary.  The ones that say  their voices sound great together!  \nBecause those comments mean that their band is actually doing something. It means that they aren’t just deluding themselves into thinking they’re good at music. \nAnd well, nice comments are just that:  nice. \nSo yeah, things are going well. And then Wilbur’s stream happens. \n...\nWilbur’s doing a Just Chatting stream. Tommy and Tubbo have already been Facetiming each other for hours when Wilbur starts his stream and now Tommy wants to call Wilbur to bug him, which means that Tubbo’s going to join along for sure. \n“We’re doing media shares,” Wilbur explains to Tommy, Tubbo, and the chat. “But this won’t be a You Laugh, You Lose. This is just going to be a chill stream.”\n“A chill stream?” Tubbo asks. “Bye Tommy.”\n“Oi! Fuck off,” Tommy shouts. Wilbur lets out a fake long-suffering sigh. \nThings start off with a few funny videos. The three of them chat in between clips while Wilbur fucks around on the Origins smp. He said they could hop onto the server, too, but Tubbo’s already in bed and Tommy says it’s “too much work” to set up, or something like that. \nA huge slew of animatics come next, which Tubbo thoroughly enjoys. There are plenty of new ones that he hasn’t had the chance to see yet. Tommy ends up going off on a tangent about how cool animators are which makes Wilbur  aw at him. Tommy grumbles and Tubbo starts cackling-\n-and then he’s not laughing anymore because  that’s our song playing. That’s “Lost and Loosing”. Oh my god, what the hell?  \nHe focuses his attention back on Wilbur’s stream and  there it is. Someone media-shared the  entire song. \nTubbo notices subconsciously that Tommy has also gone completely silent, but he’s too caught up in watching Wilbur. “Lost and Losing” by The Multiplayers is currently playing on Wilbur’s stream and Wilbur has  no idea that two of the band’s members are currently in a call with him. \n“Oh wow,” Wilbur says. Through his headphones, Tubbo hears Tommy suck in a breath. It’s quiet enough that Wilbur probably hasn’t heard it. Tubbo knows exactly what Tommy’s feeling. Wilbur makes music too. Wilbur is  great at making music. What he says next… what he says about their song, it’s important to both of them. “This is really good.”\nTubbo, thankfully, remembers to mute himself before letting out a breath. He slumps a little, the built-up tension in his body beginning to flow out. Running a hand down his face, he quickly unmutes himself again.\n“Hold on,” Wilbur is saying. “What is this? I want to find them.”\nOne of Wilbur’s mods spams the link to The Multiplayers’ YouTube channel in the chat. Wilbur pulls the channel up on his stream, but he doesn’t start any of the videos yet. The media-shared song is still playing and it looks like Wilbur is really enjoying it. Tubbo can’t help the grin that spreads on his face. \n“Alright,” Wilbur says when the song ends, “I’m going to pause the media-shares for a second so I can listen to some of the other stuff The Multiplayers have done. It looks like that was their only original song but I really like their sound,” he smiles wide. “I love finding new music to listen to.”\nHe puts on their cover of “Betty” and the second it starts, his eyes go wide. “Wow,” he says, “this  has a different sound. It’s actually very good though, don’t you think?”\nIt’s then that Tubbo remembers he’s not just watching Wilbur’s stream. He and Tommy are still in a call with him. Oops. \n“Yeah,” Tubbo says, hoping it isn’t too obvious that his voice definitely just cracked. “They sound pretty good.”\n“Is this a Taylor Swift song?” Tommy asks, trying and failing to sound incredulous. Instead, he sounds a bit like he’s choking. God, you’d think for two people who act in a Minecraft roleplay all the time, they’d be better at… acting. \n“You know,” Wilbur says, stopping “Betty” partway through and putting on “Shotgun” instead, “the lead singer sounds a bit like you Tubbo, don’t they?”\nTubbo’s eyes go wide. Oh no. They’re busted. Their secret is out. Now everybody’s going to know who The Multiplayers are and the band won’t know who actually likes their music and who’s just a fan because they were  already a fan. This is it. \n“Ha! If Tubbo could actually properly sing!” Tommy jokes. A thank god Tommy managed to snap out of it. He’s always been a little better at improv than Tubbo. \n“Tommy…” Wilbur tries to scold. Tubbo just laughs. Finally, the last threads of tension leave his body. Everything’s okay. Their secret isn’t out. It looks like Wilbur is about to say something else, but he gets distracted by the screen. “Oh! They did a Peach Pit cover!” \n...\nTheir other original songs still need a little work, so they decide to do a few more covers in the meantime. After Wilbur’s stream, their fanbase grew a hell of a lot bigger. They pulled a bunch of Wilbur’s fans but also a lot of Tommy and Tubbo’s as well (while there is some overlap in their fanbases, Tommy’s is indisputably larger and Tubbo’s has grown past just Minecraft due to his variety alt streams). \nSo they do more covers. They can’t just leave thousands of people hanging, can they? \nWell, they probably can, but they’re a band made up of three people with YouTube and Twitch content creator mentalities. \nAfter their One Direction cover, they get several requests for even more One Direction. At first, they weren’t going to do any more, but people seem to really like “Midnight Memories” so Tubbo started listening to more of One Direction’s discography. It turns out, Ranboo did the same, because they each suggest a One Direction song for their next cover.\n“Did you two coordinate this?” Tommy asks accusingly. “Are we turning into a boyband?”\n“Aren’t we already a boyband?” Ranboo asks.\n“What?” Tommy all but shrieks. “We are  not! ” \n“I mean,” Ranboo shrugs (they’ve all got their cameras on. Ranboo doesn’t wear his mask, gloves and glasses for these calls anymore), “we  are  a band and we  are all boys… Unless one of you isn’t! Which is totally cool, too.”\nNobody speaks up so Tommy sighs and says, “Anyway, what were those songs you suggested again?” \nRanboo suggests “Home” because it sounds great and he likes the lyrics. \nTubbo suggests “I Want” because he thinks the piano part, while fairly simple, will be really fun to play.\nThey end up just doing both, because why not?\nThe piano part in “I Want”  is really fun to play, Tubbo discovers. He sings alone whenever only one member of One Direction is singing, but when they all sing together, Tommy and Ranboo join in. \nDoing more songs where he does a lot of backing vocals must be what leads Tommy to the day that he, out of the blue, says, “Guys, I’ve got a song I want to try,” then nervously, adds, “but I was wondering if I could sing it, perhaps?”\nTheir cover of “Good Kid” from The Lightning Thief musical does really well. Their fans freak out about it because the vocals sound different and in the credits, which they’ve recently started adding, “lead vocals” sits beside Player Three instead of Player One. \n...\nMaya Dean | @M_ayaDean#askthemultiplayers How old are you?\nThe Multiplayers | @TheMultiplayersNot very-P2\n \nCongrats it’s a demigod | @Steph47#askthemultiplayers More musicals? \nThe Multiplayers | @TheMultiplayersYes -P2\nThe Multiplayers | @TheMultiplayersMaybe -P3\n \nProbably a Fan | @Tabitha_Riley #askthemultiplayers Ok but are you gonna reveal your faces at some point? How do we know you’re not robots?\nThe Multiplayers | @TheMultiplayersIDK -P1\nKath | @WOOoo_#askthemultiplayers What does this mean????\n \nNick Halden | @NotCaffrey#askthemultiplayers Pronouns?\nThe Multiplayers | @TheMultiplayersWe all go by he/him, thank you for asking! -P2\n \nYep | @Hen118#askthemultiplayers You don’t have to answer if it makes you uncomfy but where are you from? P1 sounds like he’s from the UK but one of the background singers (not sure who) sounds American?\nThe Multiplayers | @TheMultiplayersP1 and P3 are from the UK. I’m American. We record everything separately and then P1 mixes it.\nYep | @Hen118Oh wow\n...\nThey start getting fanart. Like,  actual The Multiplayers fanart. A lot of it is of instruments with fancy ‘Player’ labels to denote each member. Some artists take random multiplayer video games and design instruments in the art style the video games are in. \nThere’s also some fanart that includes actual people. Artists try to imagine what each member of The Multiplayers looks like. They’re never accurate but Tubbo scrolls through them anyway. \nOne thing that Tubbo notices because of the art is that they’ve accidentally used the colours associated with their  streamer selves in the credits of their The Multiplayers videos. Player One is always in green font, Player Two is either in white or black font, depending on the background colour they chose for the credits, and of course, Player Three is in red. \nIt’s not super obvious, considering they’re just a bunch of random colours to most people, but Tubbo does believe they should have probably thought that through a little more. It means that there’s a bunch of art circulating that involves green-themed keyboards, black and white bass guitars, and red-themed drums (with the occasional black and white or red guitar). \nThankfully, it doesn’t seem like anybody has put two and two together yet. Tubbo is grateful that Tommy managed to stop any rumours of Tubbo sounding like Player One before they could start. He still can’t quite believe that Wilbur even picked up one that. Then again, Wilbur  has heard Tubbo sing before.\nThey release Tommy’s original song next. It’s another pop-rock song, but more fast-paced than “Lost and Losing”, called “Masked”. \n“And no,” Tommy had clarified when he’d first shown it to them, “it’s not inspired by Dream. Fuck off.”\nIt’s a song with a lot of storytelling, which is why Tubbo suspects that Tommy was influenced by Wilbur’s music, at least a little. When he brings it up while they’re rehearsing one day, Tommy loudly explains that “No, Wilbur was influenced by  me!” Which basically means, “Yes, obviously,” in Tommy-speak. \nThe story, on the surface, is about a girl running away from someone trying to  murder  her. She’s trying to find the love of her life, hoping he’ll help keep her safe, only to discover that the person trying to kill her  is her lover. In the end, she doesn’t need anybody to save her. She can save herself, dammit. \nSo yeah, on the surface, it seems a bit basic, but it turns out that Tommy is a really great storyteller. And, he’s surprisingly good at  metaphors. The whole song’s a damned metaphor. \nThat being said, it does take them a while to get the music just right. Not only because writing music can be difficult (none of them are what you’d call experienced) but also due to the different time zones they’re in. Figuring out when the best time for everyone is can be difficult, especially because they have to factor in the fact that all three of them stream and make videos. And that’s not even mentioning school. \nWhen they  do  finish writing “Masked”, there’s a heavy and somewhat complicated bassline during the verses (like, “Another One Bites the Dust” level of  heavy) while the choruses end up being more soft-rock; light and airy sounding, but to the point that it seems unsettling. \nTubbo thinks the best part of the song starts at verse three (there are five verses and no bridge). He likes it because Tommy’s drumming sets the scene for you, immersing you in it. \n\n His footfalls are approaching\nWhile the shadows are encroaching\nOn her, poaching\nAny confidence\nShe once had within.\n\n\n \nAnd his mask falls.\nAnd her heart stalls. \n\nAnd then Tommy’s drum solo kicks in. \n...\nThey put “Lost and Losing” and “Masked” on Spotify (once they figure out how). Masked also gets its own cover art, from a new artist this time. They actually chose one from The Multiplayers’ following and everything! Both songs immediately get tons of streams. It’s pretty cool that they’re being noticed, Tubbo thinks.\nIt’s also sort of terrifying. Tubbo  likes that they’re a faceless band. He likes that “Tubbo” isn’t connected to The Multiplayers. Knowing that he can hide behind Player One - knowing that nobody knows who Player One is - makes Tubbo more confident in his singing. In his musical abilities. He knows the others feel the same. \n...\nTubbo’s signing some things regarding TubNet with Philza’s stream pulled up in the background one evening. Phil’s on his hardcore world, working on his latest project. Tubbo likes watching his friends’ streams and they definitely tend to make working more bearable.\nAbout halfway through the stream, Wilbur and Tommy turn up to chat with Phil and generally be obnoxious, as they often do. He knows that the three of them were filming one of Tommy’s mod videos with some others earlier. \nTubbo signs the last page and begins to gather up his papers. He’s sort of scattered his work all over his desk. As he sets about his task, Tubbo starts humming along to the song that Phil has playing in the background of his stream. It’s when the song gets to the first chorus that it hits him.\nThe song playing is “Good Kid”.\nSung by Player Three. \nHoly shit. \nPhilza Minecraft has listened to The Multiplayers?\nTubbo’s head snaps up to look back at the screen. \n“Oh! Phil,” Wilbur says, excited, “you listened to them!”\n“I did,” Phil says, bobbing his head along to the song. “By the way, Chat, Wilbur is talking about the song that’s playing. It’s a cover by this band called- um...”\n“The Multiplayers,” Tommy stammers. Neither Phil nor Wilbur seem to notice that Tommy most definitely sounds panicked. The song playing  is the one he sang alone, after all. \n“Right,” Phil continues. “The Multiplayers. Wilbur told me to check them out. They’re very good.”\n“They are,” Wilbur agrees. “And they’ve got two original songs as well. I quite like both of them, truthfully.”\nOh wow. Wilbur genuinely likes their music. Phil too, if he added one of their covers to his streaming playlist. \n“Tommy?” Phil probes after a moment. Tommy has been fairly quiet since the song started, which is very unlike him. Tubbo can tell that Phil’s a little worried about him, though he probably just thinks Tommy is tired. \n“Hm?”\n“Have you listened to them yet?”\n“Yep,” Tommy pops the ‘p’. “First heard them on Wilbur’s stream, actually. They’re alright.”\n They’re alright. \nWell, okay then, Tommy. \n“They, uh,” Tommy continues.  No!  Tubbo thinks.  Stop! Before you dig yourself into a hole! Don’t you remember the lesbianinnit incident? “Let’s think about this one”??? Tommy! “Good bass.”\nTubbo bursts out laughing. \n...\nLater that same night, Tubbo gets a message from Karl Jacobs on Discord. Tubbo is tired and he isn’t thinking straight, which is why, without really thinking about it, Tubbo agrees to join Karl’s karaoke stream tomorrow.\n“I’ve fucked up,” Tubbo tells his bandmates. \n“What do you mean?” Tommy asks. “Are you okay?”\n“I agreed to do Karl’s karaoke stream tonight,” Tubbo honestly can’t believe he did that. “And I would feel terrible if I backed out.”\n“What’s wrong with Karl’s karaoke stream?” Ranboo asks, confused. \n“It’s strange, innit?” Tommy says. “That our good friend Tubbo sounds a lot like the lead singer from that one band. What was it? The Multiplayers. Yeh, Tubbo sure does sound like Player One, doesn’t he?”\n“Shit,” Tubbo groans. On screen, Tubbo sees Ranboo go pale. “Wilbur already mentioned once that I sound like… myself?”\n“He did,” Tommy nods. Tubbo groans, dropping his head dramatically into his hands. “Is Wilbur going to be part of the karaoke stream, too?” \n“I think so,” Tubbo says. “With Sapnap and Dream and George. Probably a few others.”\n“Well, fuck,” Tommy says. “I suppose you could just cancel.” \n“But I’ve already agreed!” Tubbo laments. The stream is going to be starting soon, too. He’d sort of forgotten about it entirely until he’d gotten a message from Karl reminding him of when he would be starting the stream.\n“Uh, yeah. Guys?” Ranboo bites his lip. Tubbo notices for the first time that Ranboo hasn’t been part of this conversation save for his initial question. “We may have a problem.”\n“Another one?” Tubbo throws his hands into the air.\nRanboo rubs the back of his neck. “Heh, uh. I may or may not have also agreed to do the karaoke stream?” \n...\nTubbo tells Karl he’s feeling ill. Ranboo, however, joins the stream. They were worried about it being suspicious if they  both  cancelled on Karl. Thankfully, Ranboo isn’t the  lead singer  of a band currently growing substantially in popularity. While he  does sing on their tracks, his voice will, hopefully, not be quite as recognizable as Tubbo’s. So there, problem solved.\n“That’s alright,” Karl had told Tubbo when he’d broken the news. “Get well soon! You can be part of my next karaoke stream.”\n“Right, yes. I will absolutely be there next time,” okay so maybe their problems aren’t actually solved. Oops. Listen, Tubbo panicked. He doesn’t want to be mean and say  no. He already feels bad enough about cancelling  this time.\nBut he tells Karl he’s ill and then pulls the stream up a few minutes later so he can watch it. He uses an alt account, one that nobody knows of. \nWilbur  is there, as well as the Dream Team, Bad, Quackity, and of course, Ranboo. Karl has already gone through the usual ritual of welcoming chat and now he, Quackity, and Sapnap are singing a song that Tubbo hasn’t heard before. \nTubbo sets about editing the new episode for The Let’s Play Channel while keeping an ear on the stream. It’s about a half-hour in when Tubbo hears someone mention The Multiplayers. He focuses back on the stream only to find that  Dream  was the one who mentioned the band.  Dream? God, their following is going to grow even more now, and it’s going to be harder and harder to keep their identities secret. \n“-heard of them?” the man is saying. Everybody in the call, as it turns out, has heard of The Multiplayers. What the fuck? Have The Multiplayers become some sort of  thing within the Minecraft YouTuber community? \n“Let’s do both of their songs!” Karl says, clapping his hands together in excitement. \n“I learned them both on guitar, actually,” Wilbur tells them. \n“Oh, Wilbur, you can play them for us while we sing!” Bad says.\n“Wait really?” Ranboo chokes. “We’re singing The Multiplayers?”\n“Yeah, man, they’re good,” Quackity says.\n“Uh, right.”\nTubbo’s Discord pings with two messages from Ranboo.\nRanbooHELPAre you watching the stream?\nTubboYesIdk how ot help thoSay you have strep throat\nRanbooWtfThat’s not helpfulI was just singingWhat do i do??????\nTubboYou got this big man!!;)\nRanbooTUBBO\nWilbur starts playing “Masked” first. It sounds much different, considering he’s only using an acoustic guitar, but it’s kind of crazy that Wilbur even learned how to play it in the first place. \nEverybody launches into song at once. With everyone singing, and not everyone hitting the proper notes, it sounds… not the best. Thankfully, it masks Ranboo’s voice quite a bit. Tubbo also notices that Ranboo is only actually singing the parts of the song that he  doesn’t sing backing vocals for in their recording. That’s smart-thinking on Ranboo’s part. People probably won’t even realize he sounds a lot like Player Two. People won’t even think to wonder about it. \nThey finish the song with… flair. They’re all laughing, though, including Ranboo (thank god). They’re clearly having a lot of fun. It continues into their rendition of “Lost and Losing”. \nOverall, Tubbo thinks the karaoke stream goes really well. And yes, even when George joked, “Wow, Ranboo. You’re not bad. You should be a singer,” and Tubbo just  knows that Ranboo didn’t know whether to panic or to laugh. \nNow all Tubbo has to do is make sure that the next karaoke stream he accidentally agreed to join goes just as well. \n...\nNobody knows that Tubbo is in a band except for, well,  the band. \nAnd his family. \nAnd his bandmates’ families, too, but that’s not what’s important right now.\nWhat  is  important is the fact that one of his sisters just asked him to cover a song. It’s a good song, but it might take some work because Tubbo knows for a  fact that even if they mess with keys and octaves, he doesn’t have the vocal range that the original band has. They’ll have to adjust some things, but when Tubbo brings it up with the others they’re both on board. Tommy does make some jokes about Tubbo being wrapped around his sister’s finger, though. \n“Told You So” gets uploaded to The Multiplayers’ YouTube channel and it quickly becomes one of their most popular covers. \n 4971 Comments \nLara ClarenDidn’t know I needed a Little Mix cover by The Multiplayers until today omg\nBassBoy9Wow, piano in this song sounds so good! \nMaia QI agree! I’m glad they added it! \nSalted Chocolate ChipOh i feel like i’m being given a warm hug when I listen to this! Thank you for introducing me to Little Mix btw\nPh1LzA ✓Great cover!\nWhile it’s one of their most popular, the Little Mix cover is also the first time they get an abundance of hate. Sure, people have left mean comments before, but it’s not until they cover a song by a girl group that things turn particularly nasty. The only other time they got comments like that was under their Taylor Swift cover. Apparently, men aren’t allowed to enjoy music sung by women? It’s stupid, Tubbo thinks. Thankfully, all of the sexist and homophobic comments get buried under positive ones. \n...\n“You guys are never going to believe what I have to show you,” Ranboo says one day. Tubbo has just finished streaming and now they’re all going to work a little more on Ranboo’s second original song. It’s looking like the song is going to involve a lot more synth than the other originals they’ve made, so the three of them have been testing out sounds recently. \n“Uh… what is it?” Tubbo asks tentatively. In their Discord call, Ranboo starts screen sharing. His web browser is opened to YouTube with a video called “Good Kid - Dream SMP Animatic” pulled up and ready to be played. Tubbo watches as Ranboo full-screens the video and hits play. \nThe animatic is good, but Tubbo knows that’s not the only reason that Ranboo is showing them this. The focus of the animatic is dsmp!Tommy, at the beginning of the exile arc, singing “Good Kid”. But the artist didn’t use the original cast recording of the song. They used  The Multiplayers’ version. \n“Oh, holy shit,” Tommy says, awed. \n“This is so cool,” Tubbo watches intently. It’s an emotional animatic and he gets sucked right into the story. It probably helps that it’s actually Tommy singing, so his drawn character sounds just like-\n-Oh. \nThis explains the random upsurge in “Tommy is Player Three” rumours that Tubbo has been seeing recently. Is Tommy’s secret identity in jeopardy? Or will people (hopefully) continue to think it’s just a funny rumour or an ‘it would be pretty cool if’? No matter how hard they tried, there were still some comments after the karaoke stream about Ranboo sounding like Player Two. \n“Oh wow,” Tommy says when the animatic has ended. “I’m sending that to Wilbur.” \n“Wait!” Tubbo says. “Don’t.”\n“What? Why?” \n“Tubbo’s right,” Ranboo says. “Wilbur knows you. Your voice, paired with an animatic of you? It would be-”\n“Really obvious,” Tubbo finishes.\nTommy sighs, “Damn.”\nRanboo, of course, is the strongest advocate for keeping their identities secret, and while it may seem like Tubbo is the second-most fervent supporter of the idea, that role belongs to TommyInnit.\nTommy likes to make jokes about getting subs and follows and views and, like, recognition or whatever, but Tubbo  knows  him. Tommy hasn’t explicitly said it before, but Tubbo knows that Tommy’s a little bit scared of everybody finding out he’s part of The Multiplayers. In fact, Tommy might actually be a little bit embarrassed. Not of the band! And not of their songs, either! But his singing, his playing, those are things that can be picked apart and used to target Tommy specifically. And  that is what’s absolutely terrifying.\nTubbo understands. He feels the same way sometimes. \n...\nThey start getting crossover fanart. Tubbo is almost always drawn as Player One, which,  thanks a lot, Wilbur. Tommy is often drawn as Player Three, rocking out on his drums and generally having the time of his life. Player Two seems to fluctuate the most. Now that people headcanon Tubbo and Tommy in a band, they just chose random Dream SMP members to fill the other role. \nStill, Ranboo is Player Two a lot. That headcanon is, of course, attributed to the karaoke stream. Player Two is also sometimes Jack, because Jack can sing, and Eret, because of their deep voice. There also seem to be quite a few Niki!P2 headcanons. \n“Look at this one!”\nThe fanart that Tubbo has sent is SBI as The Multiplayers. Phil is Player One, Techno is Player Two, Tommy is Player Three, and Wilbur is a player that the artist made up themself, Player Four.\n“Nice, I saw that one,” Ranboo says. “Have you seen this one?”\nThe art Ranboo found has Dream as Player One, George as Player Two, and Sapnap as Player Three. \n“What the fuck is this?” Tommy has joined the call, it would seem. Ranboo bursts out laughing.\n“Hey Tommy,” Tubbo greets his friend.\n“Tubso.” \n“Alright, are we ready to practice the song?” Ranboo asks, grabbing his guitar from off-camera. \n“Um, actually,” Tommy says. “I think you boys should go watch my VOD.”\n“Tommy,” Ranboo teases.\n“No, seriously. Just- just near the end,” Okay… Tommy sounds nervous. That’s never good.\n“Did something happen?” Tubbo questions. He’s suddenly  very worried. \n“Uh, yeh,” Tommy says, looking directly into his camera. “Technoblade happened.”\n“Okay, it’s really not as bad as you implied it would be,” Ranboo says when Tommy pauses the VOD.\n“What do you mean?” Tommy gasps, voice raised enough that Tubbo turns down his volume a little bit. “Ranboo this is… this is-”\n“Fucking hilarious!” Tubbo doubles over laughing, disappearing from the view of his camera almost entirely. \nTommy gasps again, more dramatically this time. “I feel so  betrayed  . How do you not see how  awful this is?” he whines. \n“I mean, it’s not like your cover is blown,” Tubbo points out, trying to regain his composure. “You just-”\n“I just got  my own song  explained to me by  Technoblade, Tubbo!” he groans, running his hands through his hair and thoroughly messing it up. “Seriously, what the fuck? And I had to act normal!”\nThe stream had been another SBI Terraria stream. Near the end, Wilbur had given up on actually playing and had busted out his guitar. That led to Phil mentioning how Wilbur had learnt both of The Multiplayers’ songs for Karl’s karaoke stream. \n“Did you listen to The Multiplayers like I told you to, Technoblade?” Wilbur had asked. \nTechnoblade hummed. “I was surprised at how good their songs are lyrically.”\n“Really?” Tommy had asked. To anyone else, it would seem like Tommy had simply been curious, but his bandmates knew he was rather thrilled to have someone say that. \n“Yes. Like ‘Masked’ is-”\n“Ah yes,” Tommy interrupted then, and this was the moment that made Tubbo facepalm; “Murder.” \n\nLike, seriously, Tommy. You wrote that. It’s your song. \n\n“Eh- it’s more than that,” Technoblade had said. From there, Techno and Wilbur got into a long conversation about the metaphors and storytelling in “Masked”. They also spoke about “Lost and Losing” but that’s clearly not what Tommy is currently focused on. \n“You know what I mean?” Techno had ended with. Wilbur had responded, same with Phil, but when Tommy didn’t, Techno prompted, “Tommy? Get it?”\nAnd Tommy, having been panicking for the last ten minutes because of that entire conversation and having thus missed the conversation entirely, had blurted, “Right, yes. Very- very metaphorical,” like an idiot. \nAnd now Tommy had terrified Tubbo and Ranboo into thinking there was a full-blown crisis, when in reality, “You barely even embarrassed yourself, big man.”\n“Tubbo! That was the longest ten-odd minutes of my life! That was- that was-  Technoblade, he-”\n“He went all  English major  on you, man,” Ranboo cackles. \n...\nThey did eventually get around to practicing Ranboo’s second original song that night. Now, a couple days later, Tubbo is sitting at his desk in a call with the others, preparing to upload it. They had intended to upload it two days ago but the artist they had commissioned to make the cover image needed a little bit more time. It was well worth it, though. The cover looks amazing! \nThe song is really amazing, too. It’s a full-on pop song, which Tubbo is still sort of surprised came from Ranboo. This kind of pop is something Tubbo listens to more than anyone else in the band. But, “False Niceties” is a pop song. \nInstrumentally, it’s heaviest on the guitar and synth, though it does have an intro and an outro solely played on the piano. Tommy’s drums help keep the rhythm in a way that makes the song very obviously pop: it’s easy to dance to. And, despite having been written by their bassist, the bass isn’t all that prominent, not like it is in “Masked”, at least. The bass part  is rather complicated, though, according to Ranboo.\nTubbo figures most people would classify “False Niceties” as a ‘bop’, and it is, but it’s also got  layers  . He supposes it could be an  angry bop. It sounds upbeat, especially for what’s basically a breakup song. Still, the song exposes some of Ranboo’s insecurities. The chorus, especially, highlights that.\n\n Are you content\n\nWithin this knockoff love?\n\nBuilt on inconsistencies,\n\nOn false niceties\n\nthat you gave me?\n\nAre you lying\n\nwhen you tell me\n\nThat you want to know\n\nThe real me?\n\nOr is that just another\n\nFalse nicety? \n\nIt’s not just about a romantic relationship that feels fake, it’s about any relationship that feels fake. Even more, it’s about not actually knowing whether a relationship is real. Not being able to tell. \n“Are you sure you want to share this one, Ranboo?” Tommy asks out of the blue. \n“Yeah? Why wouldn’t I be?” Ranboo questions, genuinely confused. \nTubbo sits forward in his chair, “Well, it’s a very personal song.”\n“I just-” Tommy runs a hand through his hair, “I just want to make sure you’re… comfortable with putting that out there.”\n“It’s not like people are going to know that I wrote it,” Ranboo says. The silence that falls is solemn, nearly suffocating. \n“It-” Tubbo takes a deep breath then quietly queries, “We all know it won’t last forever. The secrecy, I mean. Right? Someday-”\n“Yeah,” Ranboo says. “I know.”\n...\nNew Band ‘The Multiplayers’ Randomly Growing In Popularity Amongst the Minecraft YouTube Community \n'The Multiplayers’, originally a cover band, have become popular amongst Minecraft YouTubers, especially those within the Dream SMP community. \nby Claire Han\nRead more\nCheck Out ‘The Multiplayers’ on YouTube: The New Band That Hides Their Faces\nBeginning as a cover band, ‘The Multiplayers’ now have three original songs and a massive following that just keeps on growing - and it’s totally deserved. \nby Evan Diaz\nRead mor\nPlayers One Through Three: ‘The Multiplayers’ Band Gets Big on YouTube and TikTok\nA new band called ‘The Multiplayers’ has wooed their audience with amazing vocals, guitar, bass, drums, and keys/synth. \nby Jamie Gonzalez\nRead more\nWhy Are ‘The Multiplayers’ So Popular?: A Look Into the Popularity of Secret Identities\nFrom Daft Punk to Pussy Riot, and from Dream to Corpse, keeping their identities secret has been important for artists and content creators for a variety of reasons. Why is it that they do it and who is the new faceless band currently gaining traction?\nby Lexa Green\nRead more\nWho Are The Multiplayers?\nEverything the internet knows about ‘The Multiplayers’ in one list.\nby Todd Willison \nRead more\n...\n“Tubbo! Glad you could make it this time!” Karl says. \n“Hi Karl, hi chat,” Tubbo replies enthusiastically. Or, as enthusiastically as he can considering he’s terrified. Why he agreed to do another karaoke stream is beyond him. \nSome of the others in the call greet Tubbo while they wait for everybody else to show up. Dream, Sapnap and Quackity are already there and a minute or so later, Bad and Wilbur show up. That’s apparently everyone for tonight, so they get right into it. \nTubbo manages to avoid singing for the first twenty minutes of the stream, letting the others go through their song choices. But then Wilbur asks Tubbo if he wants to do a Hamilton song, like they had in a previous karaoke stream, and Tubbo figures, why not? The style of songs found in Hamilton are different from the types of songs The Multiplayers do. It’ll be fine.\nAnd it  is  fine. It goes surprisingly well. Nobody even  mentions the Multiplayers (Tubbo has the stream pulled up on his other monitor so he can watch the chat). \n“Hey Wilbur,” Karl says when the song ends, “have you learned “False Niceties” yet?”\n“On the guitar? Almost. I could probably figure it out now.”\nOh no. Seriously? The Multiplayers really  have  become a thing in the mcyt community. How did this even happen?  Wilbur. Well, Wilbur’s media share. \nThinking about it, though, Tubbo has no idea how the Dream Team found The Multiplayers. And how did Karl find them? Quackity? He heard Puffy talking about them too. And Eret. Fuck, even non-dsmp Minecraft YouTubers have mentioned the Multiplayers! \n“Let’s do it!” Quackity exclaims. \nTubbo has about five seconds to decide what to do. He has two options. He can sing, which would risk revealing his secret identity as Player One.  Or  , he could not sing, which would be just as incriminating. He would be so obviously avoiding it, plus his friends would get suspicious or worried, which might bring even  more attention to the fact that he wasn’t singing. \nHe goes with option three: singing, but doing an absolute  shit job of it. \nHe sings half-heartedly at best and pushes away from his desk a little so that his mic has a harder time picking him up. It seems to work. Mostly. Wilbur, when they’ve finished the song, still says, “Tubbo, you really do sound like Player One.” \nThat fucker.\n“You’re right, he does,” Dream says. Tubbo tenses, biting his lip. Could his friends just shut up for a second? \n“Awe, thank you,” Tubbo says, trying to play it off. \n“And you play piano, too, right?” Sapnap asks. Goddammit. \nLaughing nervously, Tubbo confirms that yes, he does play the piano. “But I’ve no idea how to use a synth, much less how to  write music,” he lies. Thankfully, the others drop it. They move on, with Karl and Quackity singing some Taylor Swift song from like, 2013 or something. \nAnd things are fine. Tubbo chills, fading into the background of the stream a little bit.  Tubbo Player One trends on Twitter for an hour, though. \nAfter the stream, Sapnap messages him, which is kind of unexpected.\nSapnap\nHey man\nYou good?\nYou were kind of quiet when we did false niceties\nAnd after that too\nTubbo\nI’m fine!\nJust tired!\nSapnap\nYou sure?\nTubbo\nYeah!\nI just\nDon’t like the multiplayers that much\nThey’re okay\nbut\nWell, now Tubbo is digging a hole for himself. God, he’s as bad as Tommy. \nSapnap\nYou don’t like the mutliplaeyrs??? \nTubbo\nBro\nTubbo\nI don’t disliek them\nI just don’t\nLike\nThem\nU know?\nSapnap\nI guess\nAs long as ur doing okay\nTubbo\nNever been better\n...\nHaving now released Ranboo’s second song, The Multiplayers only have Tubbo’s original song to put out. It still needs work so they do some more covers. \nThe first cover is one that people have been requesting a lot; “Now or Never” from the Netflix show  Julie and the Phantoms. The request is probably so popular because it’s performed by the band  Sunset Curve in the show, which is a group of four boys (never mind that there are only three Multiplayers). \nBefore they do “Now or Never” though, they play a little trick on their audience. They tell everyone that they’ll be doing a  Julie and the Phantoms cover, and while everyone expects “Now or Never” they, instead, perform “All Eyes on Me.” \n\n I keep the party going all night, all night\n\nI set the trends that you all like, all like\n\nI make an entrance when I don't try, don't try\n\n'Cause all I see is all eyes on me\n\nI only lead, I never follow, follow\n\nI never open 'cause it's my show, my show\n\nDon't know if people think I'm shallow, shallow\n\nBut all I see is all eyes on me\n\nThey do it because it’s  hilarious. None of them had watched  Julie and the Phantoms before, so none of them had known any of the songs. After people kept requesting “Now or Never” they’d all gone and watched the show (the episodes aren’t that long, it’s bingeable). After hearing “All Eyes on Me”, Tubbo had messaged their group chat.\nTubbo\nGuys.\nWe have to do All Eyes on Me\nPlease\nTommy\nWtf\nwhy??\nTubbo\nWe’re a faceless band\nThere are no eyes on us\nNone\nIt’ll be funny\nRanboo\nAhahahaha\nLet’s do it\nThey do release “Now or Never” two days later, but it’s hilarious to see the reactions they get from “All Eyes on Me”. \n...\nNick Halden | @NotCaffrey\nOkay but can people be more respectful of  @TheMultiplayers  privacy maybe? There’s probably a good reason they don’t want to show their faces...\nPreSerum Steve | @N_Leeds\nSeconding this! Also has everyone forgotten the ‘not very [old]’ tweet? Stop making gross comments please?\n \nClark | @NopeGoAway\nAll you @TheMultiplayers fans are stupid. How do you know they’re good people?? You have no idea what they look like, you don’t know anything about them other than they make okay music.\nTara | @Tara_K\nThere are other artists out there that we don’t know a lot about… \nI guess | @LoveTheMultiplayers\nHow do you know they’re /not/ good? Your argument can be made both ways motherfucker\nKath | @WOOoo_\nTheir music is better than ‘okay’ \n \nYep | @Hen118\nI love mcyt as much as the next person but maybe we should stop comparing The Multiplayers to Tommy and Tubbo and everyone\nYep | @Hen118\nI mean, the art is cool but it’s just for fun. We shouldn’t take the conspiracies seriously. I don’t mind making headcanons and art and stories but don’t harass The Multiplayers and all of the content creators about it, you know? \nYep | @Hen118\nAnd if the mcyts actually are The Multiplayers then they shouldn’t feel pressured to reveal their secret identities.\nYep | @Hen118\nAnd if they aren’t, then it seems a bit disrespectful to The Multiplayers to only like them because you’re assuming they’re some random minecraft youtuber you like. \n \nTommyInnit | @tommyinnit\nWhy do people keep asking me about drums?\n\nGot My Band and a Light That Won’t Go Out: An Interlude in Three Parts\n\n \n\n\nThe Dream Team Interlude:\n\n\nOkay so Sapnap is sort of worried about the kid. ‘The kid’ being Tubbo. It started during the karaoke stream. Tubbo had gone all quiet after they’d started singing “False Niceties”. But now, looking back, Sapnap knows that something has been up for a long time.\nFirst of all, Tubbo doesn’t stream nearly as often as he used to. Seriously, there was a point when Tubbo would stream pretty much every day. And he’d go on other people’s streams after his own! Now, he misses a day here and there with no explanation. \nTubbo also seems to be more tired than usual. Sapnap doesn’t always manage to catch the kid’s streams live, but Twitter is usually filled with screenshots and clips afterwards and  damn. That kid is often sporting some serious bags under his eyes. \nAnd then there’s The Multiplayers drama. Okay, it’s probably stretching it to call it drama. People are sort of just going around assuming that Tubbo, and Tommy and Ranboo, are in a band together. Sapnap actually thought it was funny and kind of cool. And the art is great, too. \nBut then Tubbo told Sapnap that he doesn’t really like The Multiplayers all that much and well… Sapnap can guess what that means. Tubbo is sick of constantly getting harassed about a band that he doesn’t actually have any connection to. \nAnd now Sapnap has brought it up with the  worst tact. On George’s stream. Because Sapnap is an idiot who is currently kicking himself to the fucking moon. \n“What? Tubbo doesn’t like The Multiplayers?” Dream gasps, because  of course  Dream is here too. George is currently speedrunning alone with Dream and Sapnap on call with him. “They make the  exact kind of music that he and Tommy like.” \n“Oh no no no no!” George screeches as a ghast nearly fireballs him into lava. Meanwhile, chat is going wild with the news that Tubbo doesn’t like The Multiplayers, which Sapnap really didn’t mean to let slip in front of thousands of people. It looks like a lot of people feel betrayed, which is kind of dumb because Tubbo isn’t  actually Player One. \n“Yeah,” Sapnap says. “He’s allowed to have his own opinions.”\nDream must catch on to the fact that Sapnap is trying to change the subject because he immediately starts teasing George for taking so long to get blaze rods. \n...\nGreen Cat | @wotlen @TubboLive doesn’t like @TheMultiplayers ????? What is this???? WHY?\nKath | @WOOoo_I’m honestly kind of not surprised? If you watch some of his recent streams he goes all quiet whenever donos ask him about being part of the band. I think he’s sick of people always asking about it.\n \nYep | @Hen118Leave @TubboLive alone. He’s allowed to not like things\n \nThe Multiplayers | @TheMultiplayersLove you, too @TubboLive -P1 \nCongrats it’s a demigod | @Steph47oh my god\n \n\n\nThe Sl\neepy Bois Interlude:\n\n\nIs Wilbur maybe a little bit worried about Tommy? No. He’s definitely quite a lot worried about Tommy. \n“You’re not the only one,” Phil tells him. They’re in a call together, with Techno as well, none of them streaming. Wilbur has The Multiplayers’ latest cover, “Grow Up” by Paramore, playing in the background. It’s a damn good cover. \nTechno hums. “Yeah, he’s been acting weird lately.” \nWeird is an understatement. Tommy has definitely fucked up his sleep schedule again. He’s also been really busy lately, which is strange considering Wilbur knows when Tommy streams and he knows when Tommy is filming a video because Wilbur is always there to film it with him. And while college might keep Tommy a little busy, it’s never been  this bad. \nAll of which is to say; Tommy is hiding something. And okay, fine, maybe Wilbur should give him his privacy, but he’s  worried. He feels like Tommy has been pulling away from him. Did Wilbur overstep somehow? Too many ‘brothers’ jokes? No, Tommy makes those jokes too. So what is it?\n“I noticed he’s been spending a lot more time with Ranboo and Tubbo,” Phil says. \n“That doesn’t seem abnormal,” Techno points out.\n“No, I mean all of them together at all hours of the day,” Phil explains. “Tommy has mentioned it once or twice but he always gets jumpy when I ask what they’re up to.”\n“Maybe they’re just making a video together?” Technoblade suggests.\n“For several months?”\n“Maybe it’s a series?” Technoblade is grasping at straws and Wilbur can tell that he knows it. “Or maybe they’re just, you know, being  friends.”\n“Yeah, that makes more sense,” Phil agrees. “Still, I’ve noticed similar behaviour in Ranboo and Tubbo.”\nWilbur sighs, running a hand through his hair to get it out of his eyes. \n“You know, this started about when that band started getting big,” Techno says. \n“What? The Multiplayers?” Wilbur asks. What would The Multiplayers have to do with this? \n“D’you think they’re being weird because of all those conspiracies?” Phil asks. \n“I mean, I think it would be weird for people to assume I was in a band that I have nothing to do with,” Techno says. “So maybe they’re just weirded out and taking some time?”\n“I dunno,” Wilbur says. “It doesn’t seem like them. Wouldn’t they just address it? Why  haven’t they addressed it?”\n“Maybe because Tubbo has some weird Twitter beef with them?” Philza guesses. “He and Player One have been tweeting at each other nonstop for the past couple of days.” \n That  had certainly been a strange development. It seems to have convinced a few people that Tubbo isn’t actually Player One (which is strange because couldn’t someone tweet at themself from two different accounts? It would be weird, sure, but they  could). Wilbur hasn’t actually seen any of their exchanges, what with not using Twitter anymore, but Phil, Tommy, and Tubbo himself have kept him well up-to-date with it all. \nThe call is quiet for a second before Phil says, “Oh. Wow.”\n“Wow?” Techno inquires.\n“That band. The Multiplayers. They’ve been  signed.” \n...\n\n\nThe TommyInnit Interlude:\n\n\nTommy has been prepared for this record deal. \nThey get contacted one morning through Twitter by a well-known record label. The label wants to set up a virtual meeting to discuss… important things with the band. While the rest of the band freaks out because they have no idea what they’re meant to do, Tommy contacts the lawyer he set up for them months ago. \nWhen it had looked like their original songs were really doing well, Tommy had contacted a lawyer, just in case. Now, he’s glad he did. He doesn’t want the band getting screwed over by a record label and Ms. Erica Asante will stop at nothing to make sure they get a fair deal. \nAfter several meetings, The Multiplayers come away with a record deal, full artistic control over their music, sound, and image, and the guarantee that the label won’t reveal their identities until they’re ready. Thank you, Ms. Asante, for realizing that non-disclosure agreements might be a good idea. \nNow, The Multiplayers get to make an  actual  EP! All three of the original songs they have out now will be on it, plus Tubbo’s original (once it’s finished) and two  more originals! \nThey’ve also got access to real recording studios, now. The label has studios in London, New York, Los Angeles, and Toronto. It sucks that they can’t all be in the same studio together right now but the fact that they can even be in a studio at all is amazing. \nTo top it all off, if their first EP does well, the label will let The Multiplayers make a full album. When they’d first started the band, Tommy  never  thought it would become this…  big. He also didn’t expect for the band to become so important to the three of them. Yet, here he is. Here they  all are. Together. \nNow they just have to figure out how to balance streaming, making videos, school, and creating an EP. Oh. Sleeping and eating should probably go in that list somewhere, too. \nThe first thing they do after getting signed is release another cover. Instead of pressuring themselves to do everything at once, they pull out their instruments and record a cover of Bo Burnham’s “Channel 5 News: The Musical”. Tubbo sings the opening of the song, Tommy sings the part of Chip Walker, and Ranboo finishes it off as the part of Max Stevens. \nSo yeah, they spend time working on the cover. And school. And streaming. They can worry about finishing Tubbo’s original song and writing two more songs later because right now, all they need to worry about is-\nWilbur?\nTubbo stops scrolling through the comments on “Channel 5 News: The Musical”. Someone has mentioned Wilbur in their comment. It isn’t unusual to see his name - or the names of any of their fellow Minecraft YouTubers - in The Multiplayers’ comments. What is unusual is the fact that the comment has a  lot of likes and replies. \nSalted Chocolate Chip\nOk but, consider… The Multiplayers covering a Wilbur song?\nScrolling further, Tubbo finds that there are several comments about Wilbur, ranging from The Multiplayers covering his songs to actually making a whole new song with him. \nAnd well, thinking about it, Tubbo has to admit; it  would be pretty cool. \n...\nTubbo is currently having the time of his life. He’s got his @TubboLive Twitter open on his phone and @TheMultiplayers in an incognito window on his laptop. He may or may not have plans to turn this rivalry into an epic romance. When he’d told the others about it, Ranboo had sighed and said, “Of course you would start a slow burn, enemies-to-lovers Twitter relationship with yourself.” \nWhatever that means… \nIt’s just a lot of fun, is all, and it seems to be dispelling some of the rumours that Tubbo and Player One are one and the same. Which is hilarious, considering Tubbo is, in fact, himself. It also helps distract him when he gets too overwhelmed. Juggling everything in his life is proving to be more difficult than he expected it to be. \nThe Multiplayers | @TheMultiplayers\nCooking stream? @TubboLive you can’t cook -P1\nTubbo | @TubboLive\nExcuse you!!! Yes I can. Let me come over i’ll cook for you\nTommyInnit | @tommyinnit\nYeah Tubbo you tell him\nTubbo | @TubboLive\nHmm\n“Tubbo, seriously. What are you doing?” Ranboo asks in a Discord call a few minutes later.\n“I told you-”\n“Enemies to lovers,” Ranboo deadpans. Sighing, he adds, “Do you know when Tommy said he’d be here?”\n“He said he has homework to do,” Tubbo says at the exact same moment that Tommy joins the call. \n“I have an idea,” Tommy blurts before anybody can greet him. \n“Oh?” Tubbo inquires, only partially paying attention as he taps something out on his laptop.\nThe Multiplayers | @TheMultiplayers\nMaybe I will invite you over. What are we having? -P1\n“Yeah. For another cover, if you’re feeling up to it.”\nTubbo | @TubboLive\n...\nI can make pancakes?\n“What song?” Ranboo asks.\nCongrats it’s a demigod | @Steph47\nLiterally what is happening with Player One and Tubbo????\nCurrently Losing It | @TamFox\nTubbo_ whispers to you: this is deffo flerting\n‘Success’ Tubbo thinks as he reads the replies to his tweet. This is so fucking fun. Then Tommy says, “Your New Boyfriend,” and Tubbo nearly drops his phone.\n“What?” Ranboo exclaims.\n“Are you out of your mind?” Tubbo shouts. \n“Hear me out,” Tommy responds calmly. “Obviously I can’t sing it. I’ve done that too many times on stream. \n“I can’t sing it either,” Tubbo says, thinking about the  several times that Wilbur has pointed out his similarities to Player One. “That’ll bring too much of the wrong kind of attention.”\nTommy hums, contemplative. “But what if...”\n“Oh,” Ranboo says softly, almost a whisper. He takes a long, shuddering breath. “Yeah, what if I sang it?”\n...\nThe first time that Player Two is credited as ‘lead vocals’ alongside his usual ‘bassist and guitarist’, he ends up trending on Twitter. The small clip of it is The Multiplayers’ most viewed video on TikTok. Wilbur Soot comments “Well done!” on the YouTube video. \nAfter the amazing reception they get from “Your New Boyfriend”, Ranboo is more confident in his singing. Not that he hadn’t been before, but considering he’d only really done backing vocals for most of their songs, or at least shared in singing lead, he wasn’t sure if he’d ever be ready to sing lead on his own.\nTubbo is glad that Ranboo finally feels comfortable enough to sing lead sometimes. He has a good voice. \nThe next cover Ranboo suggests is from a musical. “Two Player Game” from  Be More Chill. Ranboo and Tubbo both sing for Michael while Tommy sings the part of Jeremy. Ranboo has a lot of fun when Tommy sings “You know that you are my favourite person” and he gets to poke fun when he sings back “Is it really true? I’m your favouwite person?”\nThey do make one big change to the song, even though it messes with a rhyme here or there. Instead of “Two Player Game” they sing it as “Three Player Game”. \nTheir audience loves it. Especially because of the game theme that goes well with the theme the band has been rolling with since day one. And when they announce that their EP is going to have more original songs? The excitement that has been spreading throughout their fan base grows until it’s almost overflowing. Tubbo can’t imagine what’ll happen when they actually release their full EP. \n...\n“-and then Ranboo you come in a few beats before us with that same strumming pattern you were using-”\n“This one?” Ranboo does it for a few seconds, though he slips up on a note for some reason.\n“Yeah, that one. And then I’ll bring the ukulele back at the same time that Tommy-”\nThe boy in question beats down on his drums far more aggressively than necessary.\n“-does  that. And  then Ranboo, come back with the bass… Ranboo?”\n“Huh? Oh,” Ranboo swaps the guitar for his bass, playing a few notes.\n“Right… and then-”\n“Sorry, hold on,” Ranboo sets his bass down again. Tubbo tilts his head to the side, showing his confusion. “I just- I just checked Twitter-”\n“Aren’t you the one who’s always telling us not to get distracted during practice?” Tommy teases.\n“Yeah, I know but- Listen, a podcast dm’d us. They want us to be in one of their episodes.”\n“Oh wow,” Tommy gasps. “Really?”\n“We can’t,” Tubbo frowns. Their singing voices may be harder to recognize but their speaking voices? They basically speak for a living. He tells the others as much. \n“I was actually thinking about that,” Ranboo says. “What if we mess with our microphone settings?”\n“What? Like… use them as voice changers?” Tubbo asks.\n“Exactly,” Ranboo says. “If we’re going to start making music professionally, we’re probably going to have to do interviews and stuff, right? We should figure it all out now when we aren’t-”\n“When we aren’t rich and famous?” Tommy exclaims.\n“Not exactly what I was going to say but yeah, that’s the gist of it.”\n“That’s not a bad idea,” Tubbo says. Ranboo is right, they’ll need to have some sort of presence, especially once they drop their EP. Starting out small, with a podcast, will help them out in the long run. “Let’s do it.”\n...\nThey finally finish Tubbo’s original song. Their fans had been getting antsy because it had been so long since “False Niceties” was released and because, after being signed, The Multiplayers promised a new song would be coming soon. Even Puffy had mentioned on stream once that she couldn’t wait for The Multiplayers to release another song. \nThis song ended up taking so long because they were finally able to use real studios to record and mix. It meant some travel time for all of them (safely, with masks and testing) but allowed Tommy and Tubbo to meet up at the London studio. The label had someone there to use the controls and such so all they really did was record, but it was still pretty cool.\nThe plan is to re-record their other originals for the EP some other time, probably when they go in to record their final two songs (which they haven’t even started writing). \nTubbo’s song is more of a folk song, but with quite a bit of pop influence. Instead of using the keyboard, Tubbo’s on his ukulele. He sings the first verse and pre-chorus  on his own;\n When your days seem too long\n And you’re lost in the throng\n And the masses of thousands of people,\n I’ll be by your side\n With each turn of the tide\n Holding onto you, keeping you stable.\n If you’re worried or scared\n That I’ll leave you there\n All alone, with nowhere to go,\n Just know,\nThen the others come in for a rather grand chorus. Tubbo goes back to singing verse two and another pre-chorus on his own, then another chorus with everybody. Tommy sings the bridge. The last chorus is another group effort, but the outro goes back to just Tubbo, stripped back so only the ukulele is being played. \nIt’s a song that Tubbo holds close to his heart because it’s… well, it’s about his friends. It’s for his friends, and especially for his band. He thinks they probably know that, even though he’s never expressed it to them out loud. He hopes that they know that. \n...\nTranscript from ‘Chatting with Kara Kane and Spencer Khatri’\nSeason Four, Episode 9\nFeaturing: The Multiplayers\n\nExcerpt:\n\nKara: Welcome! Why don’t you go around and introduce yourselves? You can explain what you do in the band, while you’re at it. \nPlayer Two: Sure thing. Should we go in order?\nPlayer One: Probably. I’m Player One. I’m the lead singer and I play keys and synth. Oh, and the ukulele!\nSpencer: Yes! We heard that in your latest song, which is amazing, as usual, by the way. \nPlayer One: Awe, thank you. That’s the one I wrote, actually. I’m also the one who mixes our songs, usually, although the others are often on call with me while I do it.\nSpencer: Wow. And for our listeners, the song we’re talking about is “I’ll Be There”. \nPlayer Two: Right, I guess it’s my turn? I’m Player Two. I play the bass, guitar and I do some backing vocals. \nKara: And the song that you wrote is “False Niceties”, right? \nPlayer Two: Oh, yeah. And “Lost and Losing”\nPlayer Three:  And I’m Player Three! I do  drums . \nPlayer Two: He also does the majority of our backing vocals and some guitar\nPlayer Three: Yeah! An’ I wrote “Masked”. \nSpencer: So! I think we’re just going to jump right into it! When’s the EP coming out, boys?\nPlayer Two: Oh gosh, I don’t think we have any idea. \nKara: None at all?\nPlayer Three: We only just finished “I’ll Be There” so it’ll probably be a while. We have other things going on in our lives. Outside of the band. \nSpencer: Oh? Like?\nPlayer Two: Well, some of us have school.\nPlayer One: And other jobs. \nKara: School? What are you studying? What years are you in?\nPlayer Three: I thought Americans called them grades.\nPlayer Two: I think she meant university? We’re in high school. \nPlayer Three: College for me!\nPlayer Two: Which is similar to what we call high school. \nSpencer:  What? High school! Did you mean to share that? Should we cut it?\nPlayer Two: It’s alright. We talked about what we would and wouldn’t share before this!\nKara: Ah. That does remind me that I wanted to ask about how you met. And do you all live in the same place? You’ve mentioned before that one of you is American and two of you are Brits? \nPlayer One: Indeed. We all actually live in completely different places. We do everything through video calls and audio recordings. \nPlayer Three: We met online. Quite a while ago, actually. \nSpencer: Online? Wow, the powers of the internet. \nPlayer Three: Ha! Yeh. \nSpencer: So, why did you decide to go faceless? I figure a lot of high schoolers would probably want to be seen. Do you plan on ever revealing your faces?\nPlayer Two: Well, mostly, we wanted to keep our privacy. \nPlayer One: We also wanted to make sure that people actually liked or disliked us solely because of our music, not because of how we look, how we dress, that sort of thing.\nPlayer Three: We’ll probably reveal our faces at some point. Jus’ not sure when.\nPlayer Two: Or how. It’s nice not being seen. I prefer it to people constantly watching and following my every move. Although, Twitter sort of has that same effect anyway, so…\nKara: Oh, yes! Twitter. Player One, can you explain the rivalry you’ve got with the well-known Minecraft streamer and YouTuber ‘Tubbo’. \nPlayer Three: Don’t get him started!\nPlayer Two: Oh jeez-\nPlayer Two: [loud, playful sigh]\nPlayer One: Kara, Kara, am I ever glad that you asked.\n...\nInbox: \nFrom: Carlos Avila - Euterpe Record and Music Group:    [email protected]      \nTo:  The Multiplayers:    [email protected]  \nThe Multiplayers,\nGood day! I am writing to inform you that we were recently contacted by Wilbur Soot about doing a song collaboration with you all. If you are interested, I will send his contact information so you can discuss with him directly the details of a collaboration. He has informed us that he has a song written but he is willing to sit down with you all and work on it, or write a new one, if it is not to your liking. \nIf you are not interested, I will let him know.\nKeep up the good work,\nCarlos Avila\nKara and Spencer | @ChattingWithKSThank you again to @TheMultiplayers for being on the show! It was really great talking to you three!\nThe Multiplayers | @TheMultiplayers@ChattingWithKS Thanks for having us! -P2\n \nPreSerum Steve | @N_Leeds@TheMultiplayers They’re in high school????? THey really meant it when they said “not very old” huh. \n \nProbably a Fan | @Tabitha_Riley @TheMultiplayers “And other jobs” what other jobs?? Do you work at Subway or something? Other jobs? I-\nCurrently Losing It | @TamFoxLol that was so ominous. Player One mentioned it and then they just didn’t talk about it.\n \nMaya Dean | @M_ayaDeanOh my god I leave Twitter for barely even a month and when I show up again @TheMultiplayers have been signed and are putting out an EP? /pos\n \nNick Halden | @NotCaffreyFor anyone wondering about the @TheMultiplayers interview on @ChattingWithKS they are using voice changers to keep their privacy.\nClark | @NopeGoAwayThat’s dumb do they also change their voices when they sing too? They’re so fake. Fuck @TheMultiplayers\n \nTara  | @Tara_KI always thought that P1 and P3 were in one place together, and P2 was somewhere else, but they really are just all in separate places, huh? How do they do it??? Wow!!!!\n \nWOODREAM | @Wiltered@TheMultiplayers met online? Friends for a while? Don’t live in the same place? Other jobs??? Streamer!TheMultiplayers confirmed? /j\n \nYep | @Hen118“We also wanted to make sure that people actually liked or disliked us solely because of our music, not because of how we look, how we dress, that sort of thing,” (P1) Oh my god this is the sweetest!!! @TheMutliplayers on @ChattingWithKS\n \nGreen Cat | @wotlen I’m really sorry I’m genuinely confused… is Player One in love with Tubbo or something? Like obviously he’s talking about a rivalry on the podcast but it sounds… idk how to explain, I’m literally so confused? \nCurrently Losing It | @TamFoxOh my god??? You’re right? Tubbo did offer to make pancakes for Player One that one time…\nKath | @WOOoo_Just a heads up for anyone speculating! Tubbo and Player One are both minors! Just keep that in mind is all I ask! Please don’t be weird! I beg of you!\nI guess | @LoveTheMultiplayersSmart thinking @WOOoo_ That being said I’m about to speculate: Remember when @tommyinnit said he could probably beat P2 in a fight and then P1 said he would definitely lose a fight to @TubboLive (½)\nI guess | @LoveTheMultiplayersAnd then Tubbo said “You would. Let me at you” and P1 said “come and get me”. Literally it looked like a fight. But now??? The podcast really threw me off oh my god. (2/2) \n...\nTubbo is not supposed to be awake right now but he can’t sleep. It’s particularly terrible because he’s exhausted. After the podcast, which was recorded at 1:00pm EST, meaning 5:00pm for Tubbo, he decided that streaming with Tommy for several hours would be a good idea. And then  after  his stream, Tubbo had decided to join a vc with Ranboo while  he was streaming. Tubbo didn’t end up going to bed until nearly three in the morning.\nAnd now he can’t even fall asleep. Dammit. \nWith a heavy sigh and an angry grumble, Tubbo turns over on his side and grabs his phone. He can scroll through Twitter or see if Sapnap is still streaming or go through his emails. Speaking of emails, he should check the shared The Multiplayers email. \nHe taps the app on his phone and swipes down so the inbox reloads. Oh! An email from the record label. \nTubbo opens the email.\nHe reads it. \nHe reads it again, just to make sure his eyes aren’t playing tricks on him. \n“Hey, Tubbo. Why’re you calling me on my phone?” Ranboo picks up after the second ring.\n“Too lazy to open Discord,” Tubbo says flippantly. He can barely sit still. He can’t tell if he’s trembling from nerves and terror, or bubbling with excitement. Maybe both. \n“Uh, okay-”\n“Are you still streaming?”\n“No? You were there when I ended-”\n“Have you checked the email?” \n“No? Is something wrong? I-”\n“Wilbur wants to do a collab.” \n“Sorry.  What? ” \n...\nTubbo gets woken up by his phone ringing incessantly in his ear. After freaking the fuck out with Ranboo for a little bit last night (well, early this morning for Tubbo), they agreed to talk about it with Tommy today. After everything, Tubbo fell asleep almost immediately. Emotional rollercoasters really take a lot out of a person. \n“Tommy? What time-” he checks the digital clock by his bed. “Aren’t you in college right now?”\n“Tubbo holy shit what the fuck?!”\n“Ah. You saw the email?” \n“You saw the email?” \n“Yeah? It was marked as read when you saw it, right?”\n“Tubbo that is really  not important right now! What the fuck?”\n“You did ask…” \n“Jesus christ. Tubbo! Wilbur wants to do a song with us!”\n“I know, Tommy!”\n“He- I- We-” Tommy finally stops to take a breath. He’s panting from all the yelling. Finally, quietly, he continues, “He wrote a song for us.”\nTubbo grins. Tommy sounds so touched. “He did.”\n“This is so-” Tommy stops for a moment. Several moments, actually. Tubbo is starting to get worried when Tommy finally says, “We can’t do it, can we?” He sounds so  heartbroken. It’s excruciating. \n“Why not?”\n“Our… our secret identities. We-”\n“We’ll discuss it as a band later. Once Ranboo is, you know, actually awake. Okay?”\n“Yeah,” Tommy says, dejected, “okay.” \n“Boys! What the  fuck are we meant to do?” is the first thing out of Tommy’s mouth when he joins the vc that afternoon. \n“Okay, show of hands,” Ranboo turns on his camera and everyone else follows suit, “if secret identities weren’t a thing, who would want to do a song with Wilbur?”\nImmediately, all three of them put a hand up. They’re all very serious right now, if a little nervous. Tommy doesn’t even make a joke about a Ranboo hand reveal as if he doesn’t see Ranboo’s face nearly every single day. \n“Okay,” Tubbo says, “we have three options.”\n“Say yes and try to keep our identities hidden throughout the entire process,” Ranboo offers.\nTubbo hums, “Or just tell him who we are.”\n“Or,” Tommy’s face falls, “or we have to say  no.”\n...\nThey go with option four.  Don’t say anything at all.  They ask Carlos Avila to tell Wilbur that they will get back to him soon, but seeing as they have some covers that they’re working on (which they actually  aren’t  working on), it’ll be a while before they can do another original. \nNow they just have to decide on what covers to do. If they don’t come up with something soon, it’ll be obvious to Wilbur that The Multiplayers are avoiding him. Wilbur is already nervous enough, according to Tommy. \n“He sounded so worried about it,” Tommy relays to them a couple days after they received that initial email. Tommy has just finished filming a mod video with Wilbur, Phil, and Jack Manifold. “He was afraid he might’ve overstepped or something. I wanted to say something but I couldn’t.”\n“It’s kind of hard having to keep this from all of our friends, isn’t it?” Tubbo mumbles. \n“Yeh. I wanted so badly to tell him it was fine but-” Tommy tugs at his hair, “-but I don’t think I’m ready to show my face as Player Three, you know?”\nTubbo hums. “I know exactly how you feel. I’ll be playing Valorant with Sneeg or planning Voltz Wars with the Captain and Jack or I’ll be in a call with Phil and Wilbur and one of them will mention one of our songs or a cover that we did and I want to say  thank you  or just- just join in on the conversation. But I’m too scared to reveal my identity. I want to… but I  don’t.”\n“Welcome to being faceless,” Ranboo mutters. \n“Oh fuck,” Tommy says. “You’ve always been faceless.”\n“How in the fuck do you do it?” Tubbo groans. Ranboo just starts laughing hysterically. \n...\nThey finally chose what songs to cover. “That Unwanted Animal” and “Fair” by The Amazing Devil. They do have to change the songs a bit because Tubbo definitely doesn’t have the same range that The Amazing Devil’s singers have. \nTubbo sings lead vocals for both songs, as usual, while Ranboo sings Joey Batey’s parts in “That Unwanted Animal” solely for how deep he can make his voice during the final line of “No, no, not I.” \nThey upload “That Unwanted Animal” first, saving  “Fair” for another time to make it look like the songs took them longer than they actually did. The songs aren’t exactly their usual genre of music, but that actually works to their advantage. It gives them a reason behind taking so long to get back to Wilbur. \nThe first cover does well. People are excited that they’re branching out into different types of music. But then the time comes when they have to put out the second cover, which means they’ll need to give Wilbur a proper response. It’s been too long, though, since the first cover, so they upload “Fair” to YouTube and then jump into a call with each other.\n“Okay, so… do we have a plan?” Ranboo asks. “We have to make a decision eventually. Sooner, rather than later.”\n“I really want to do a song with Wilbur,” Tommy’s voice comes through slightly muffled. He’s leaning back in his chair, which he has pushed away from his desk a little. His head is in his hands, like he’s hiding behind them. \n“Me too,” Tubbo agrees. Ranboo nods in agreement. “So, we all want to do it. Now we just have to decide on whether or not we reveal our-”\n“Fuck, hold on,” Tommy frowns and abruptly leaves the call.\n“What? What happened?” Ranboo sits up straighter in his chair. “The hell?”\n“I dunno,” Tubbo shrugs.\n“Well, I guess it’s just us, then,” Ranboo says.\n“Yeah,” Tubbo frowns. He wonders what’s going on with Tommy. Whatever it is must be pretty important if he decided to leave the call. “Just us.”\n“Oh Jesus,” Ranboo’s eyes go wide. “Nevermind, Tubbo. Just you. I’ll be back in a second, too. So sorry!”\nAnd then it really is just Tubbo, sitting alone in a call, gaping at his screen. Okay, what the fuck? And then he gets several messages through Discord.\nJack ManifoldTubbo!!!!HelpEveryone else i’ve messaged hasn’t responded yetThis is urgentTubboLike TOS urgentTerms of fucking serviceI fucked up.Oh shit. \n...\nJack adds Tubbo to a call and Tubbo doesn’t even notice that anybody else is in the call until he hears Tommy say, “Jack, what the fuck?” \nHold up. Didn’t Jack say nobody else responded? Is this why both of his bandmates just up and disappeared?\n“Jack, what did you do?” Ranboo asks, confused. \n“Did you get fucking banned from Twitch?” Tommy asks. “You said it was TOS but you don’t seem very worried anymore.”\n“Yeah, you sounded a lot more freaked out in your messages,” Ranboo adds. \nAnd then Jack Manifold grins, which is not the sort of look that Tubbo was expecting from the man who just told him he’d “fucked up.” \n“Alright, I lied. Nothing happened, I’m not in any trouble. I simply need to ask you a question,” Jack steeples his hands, leaning forward. “What the  fuck  is up with you lot? You three have been acting sketchy for  months. And don’t tell me it has something to do with the smp. I know everything that you’re each doing for lore.”\nFrozen in his seat, Tubbo blurts, “We’ve been setting up a cool new smp.”\nTo Tubbo’s utter dismay, Tommy speaks at the same time, citing, “Helping each other with homework,” for some reason. Seriously, what the fuck, Tommy? That doesn’t even make any sense. Tubbo isn’t in school anymore.\nTo top it off, half a beat later, Ranboo exclaims, “Dungeons and Dragons!”\nThe call goes silent and remains that way for far longer than Tubbo is comfortable with. Finally, Jack, looking skeptical, asks, “All of those?” He gets a chorus of ‘yes’s and ‘yep’s. \n“All of those  and more,” Tommy waggles his eyebrows, obviously trying to break some of the tension that is currently suffocating the call.\n“Right,” Jack says. For a second, Tubbo thinks Jack might seriously believe them. “You’re all  terrible liars.”\n“You’d be surprised,” Ranboo says under his breath. He obviously intended for nobody to hear that comment but Tubbo still wants to smack him. \n“Would I though?” Jack asks, a grin spreading on his face once again. “You all have secret alt accounts on Twitch so you can watch streams without people knowing you’re there, right?”\n“Yes, but Jack,” Tommy lets out an exasperated huff, “what does that have to do with-” \n“Lads,” Jack holds up a hand to stop Tommy. “Who do you think media-shared your first song to Wilbur in the first place?”\nIs this what drowning feels like? \nTubbo can’t hear anything. Or, well, he  can, but it’s all muffled. There’s this weird pressure on his chest, like he’s being crushed, and he can’t-\nHe can’t breathe.\nThen just as quickly as the drowning began, Tubbo is being pulled - no, dragged - up from the depths.\nNow he can hear everything so sharply that it’s overwhelming. The pressure on his chest is still there but now he’s breathing far too quickly to be healthy. \n“Jack,” he registers Tommy saying, “What the  fuck? ” \n“What are you talking about?” Ranboo asks, trying to play it off. He’s failing. Tubbo’s next words contradict Ranboo’s though, so it doesn’t matter so much that Ranboo is being really obvious. \n“How did you know?”\n“Well, Tommy and I were in a vc one day and there were drumsticks sitting on the shelves behind him,” Jack says.\n“Tommy,” Ranboo scolds.\n“What?” Tommy snaps, sounding offended.\n“Hold on,” Jack says, “that’s only where it started. There’s more.”\n \n\n\nThe Jack Manifold Interlude\n\n\n\nSeveral Months Ago\n\n \nThe drumsticks are strange, sure, but such a minuscule detail that Jack forgets about them completely… \n...\nJack has been looking for new music recently and Wilbur recommended some band called Peach Pit. Looking them up is how he finds The Multiplayers. He listens to their cover of “Techno Show” and really enjoys it. Checking out their channel, he finds that they only have two other songs out, a Yungblud cover and a Taylor Swift cover. \nHe listens to them both.\nHe reminds himself to subscribe to them whenever he next signs in to his private, personal (and secret from the public) account. They’re really good. \nAnd then he sees the photo they used for their “Weird!” cover. It seems vaguely familiar. Like, really strangely familiar, actually. \nWith a frown on his face, he opens one of the many Dreamsmp group chats he’s a part of and scrolls past several of the previous conversations until-\nHa! There it is. The same fucking photo.\nWhat the hell?\nThe messages are from about a month ago. Ranboo had sent that photo out of the blue, followed up by several messages in quick succession. \nRanbooLook I actually went outside today!Oh OopsWrong chatSorryEnjoy the sunset tho i guess\nThe only response that Ranboo had gotten was:\nJack ManifoldAhahaIt’s okayNice sunset\nOkay, so that’s weird, right? Why would The Multiplayers have the same photo that Ranboo apparently took and then accidentally sent to a private smp group chat? \nMaybe a member of The Multiplayers is in the group chat that the photo actually  was  intended for?  Yeah, that’s probably it,  Jack rationalizes. \n...\nAlright, some parts of The Multiplayers’ new cover sound suspiciously like Ranboo is singing. Jack isn’t one to speculate much but one of the singers sounds  so much like Ranboo that it’s actually sort of scary. \nThe cover is “Midnight Memories” by One Direction and while the person who seems to be doing lead vocals is still doing just that, the other members of the band are singing as well.\nAnd one of them sounds like Ranboo.\nJack has to admit that he  is  speculating. After the sunset picture, and then the Ranboo-sounding guy, Jack remembers the  drumsticks . Tommy had had random drumsticks on his shelves one day. Jack hadn’t asked about them, too preoccupied at first, then simply forgetting about them later. Now, he wishes he had asked, because things are getting… \nListen, it may just be a big conspiracy theory, but Jack thinks that Ranboo and Tommy might be in a band. They might be The Multiplayers, to be specific.\nAnd where they go, Tubbo goes. (Or perhaps it’s the other way around, but nevertheless, the three of them are inseparable.)\nAfter listening to their covers on repeat, Jack thinks Tubbo sort of sounds like the lead singer - or Player One, as they’ve now been dubbed. \nHe knows that it’s crazy. His friends secretly being part of some faceless band? That’s weird. But, he  does have evidence. He supposes he’ll just have to wait and see. If it really is them, they won’t keep it a secret for long, surely. \n...\nJack’s mad theory gets proven correct the day that The Mutliplayers release their first song, “Lost and Losing”. \nHe gets the little notification that tells him they’ve posted something new. Seeing as he isn’t meant to stream for another twenty minutes, he pulls up the video and hits play.\nIt’s a really good song, and he’s glad The Multiplayers have branched out into original music. It’s when the Bridge begins that everything falls into place. At first, Jack thinks he’s mistaken, so he restarts the bridge and listens to it again. \nHe knows this bridge.\nHe’s heard the tune, heard some of the lines, too. \nA week ago.\nFrom  Tubbo . \n...\n“Are you serious?” Ranboo asks incredulously. “You figured it all out because you heard Tubbo  humming.”  \n“Sorry,” Tubbo mutters.\n“To be fair,” Jack says, “I probably wouldn’t have noticed if I hadn’t already been suspecting something.”\n“So it was a group effort then?” Tommy inquires.\nJack hums, “A group effort. And uh, don’t worry about me telling anyone. I’ve kept it a secret this long, I’m not about to stop.”\n“Thank you,” Ranboo sighs. The tension that Tubbo hadn’t even realized was in him slowly begins to seep away. \n“Man, you really scared me, there,” Tubbo says.\n“Sorry. I didn’t mean to worry you.”\n“Why’re you telling us this  now?” Ranboo questions. \n“When I first found out, I decided I would just sit back and let everything play out. I shared your song with Wilbur because your music is actually incredible and I figured Wil would like it. Other than that, I decided not to meddle. But only… only because I thought you would have told  somebody  about the band by now. Whether it be Wilbur or Phil or fucking Dream even. But it’s been months and  nothing. And then Wil kept talking about how worried he was that he’d overstepped in asking The Multiplayers to do a song with him.”\n“Oh,” Tommy mumbles.\n“Yeah, oh,” Jack sighs. “Why haven’t you said yes yet?”\n“Yet?” Tommy asks.\n“Well, you  are going to say yes,” nobody responds. Concerned, Jack adds, “Aren’t you?\nRanboo huffs. “Don’t get us wrong, we want to, but-”\n“Then what are you waiting for?”\n“We never thought we’d get this big,” Tubbo says, finding his voice. “We never expected the fans and the- the popularity and the  record deal. The band was half  joke  when we started it. And now everything is just so- so  big. Everything feels like such a big deal and revealing our identities-” Tubbo cuts himself off. He’s working himself up too much. \n“Revealing our identities,” Ranboo continues, “is a huge step. One that we aren’t sure we’re ready to take. We didn’t expect for an identity reveal to be such a big deal. But as we got more well-known as a band, it became  a thing .” \n“But guys…” Jack says, “it’s  Wilbur.”  \nTubbo has to double-check to make sure he didn’t go on deafen because the call goes completely silent. \n“Well, yeh,” Tommy finally says, “it’s Wilbur. We’ve been keeping this from him, from everyone, for months. What if he-” Tommy chokes.\n“What if he gets angry?” Tubbo finishes. \n“Do you seriously think Wilbur will be angry with you for wanting to keep your band a secret? For wanting to keep it private?” Jack asks. “If anything, I think he’d be proud of you.”\n“Proud?” Ranboo asks, incredulous. \n“You’re making amazing music, you got signed, people  love  you,” Jack lists, “and… and you’re having  fun.  Wilbur has already said he’s proud of you boys for  far less. It’s frankly ridiculous that he would think anything else.”\n“Oh,” Ranboo says. “Jack’s  right.”  \n“Of course I am,” Jack teases, lightening the mood. \n“Uh, guys?” Tubbo tentatively speaks up. “I have an idea.”\n...\n“I’m glad you reached out,” Wilbur says. “I was worried that I sounded too pushy.” \n“No, don’t worry,” Tubbo , armed with a voice changer and no facecam, is currently the band’s spokesperson. They’re all in the call, but considering Tommy is kind of terrified and this was Tubbo’s idea in the first place, they figured he could do the talking. For now. “We were just… busy recently.”\n“Yeah! Congrats on the record deal, by the way,” Wilbur says. He’s got his camera on so Tubbo can see him smiling. Tubbo grins back, despite his nerves and the fact that Wilbur can’t actually see him. He can’t believe they’re about to do this. He can’t believe it took Jack Manifold slapping some sense into them to get them to do this in the first place. \n“Thank you. Thanks,” Tubbo responds.\n“Of course,” Wilbur says. “So, did you have a chance to look at the song I sent you? Or did you want to write something else?”\nTubbo sucks in a breath. Faintly, he hears Ranboo do the same. Oh god. Here we go. “We actually wanted to tell you something first.”\n“Oh?” \n“Yeah, uh… through song? If that’s okay?” \n“Oh, sure,” Wilbur says, sounding very much  unsure.  This probably seems a bit weird from his perspective, now that Tubbo thinks about it. Actually, it probably seems more than just  a bit weird. \nRanbooWe’ve got this you guys.\nTommyThanks big man\nTubbo turns on his mic and hits the first notes on his keyboard, beginning the first verse of “Fearless” by Louis Tomlinson. \n“Tell me, do you, tell me, do you still remember feeling young?” He sings the first line of the chorus himself. Then, the rest of the band joins in on their instruments - Ranboo pre-recorded his guitar parts so he’s currently on bass - and they all sing together to finish off the first chorus.\n\n Tell me the truth, tell me, do you still remember feeling young\nAnd strong enough to get it wrong in front of all these people?\nJust for tonight, look inside and spark that memory of you\nStrong enough to get it wrong in front of all these people. \n\n “Fearless,” they sing.\n“ Fearless,” Tubbo turns on his camera.\nA beat later, Ranboo sings, “Fearless,” and his camera goes on as well.\nAnd finally, Tommy finishes the post-chorus, “Fearless.” \nWilbur watches in disbelief, mouth hanging open, as they finish the song. Tubbo focuses on singing and playing so he doesn’t have to think about whatever Wilbur’s reaction is going to be. \nTubbo sings the final line on his own, then finally looks up to watch Wilbur, waiting for the man to say something. \nAfter what feels like forever, Wilbur, with wide eyes, says, “What the  fuck?”  \n“Surprise?” Tommy waves, drumstick still in his hand. \nWilbur disconnects from the call.\n“Oh shit,” Ranboo says.\nWilbur reconnects.\n“Fuck,” Wilbur sighs, sounding rather put-upon, “I should have fucking known, huh?”\n“I mean… we kept it a secret on purpose,” Tommy says.\n“I literally said that Tubbo sounds like Player-” Wilbur freezes, eyes going wide all over again. “Tubbo.”“Uh? Yes?”\n“I don’t use Twitter but I  have been told-”\n“Oh!” Tubbo can’t help but burst out laughing. Wilbur seems to be taking this well and the relief of that has left Tubbo feeling a bit hysterical, to be honest. “Yeah, I’ve been fighting with myself on Twitter.”\n“Flerting,\" Tommy teases.\nWilbur shakes his head, chuckling. “I cannot believe you guys,” he says. “You’re  The Multiplayers. You-” he gets a strange look on his face, soft, genuine, “you make spectacular music. I had no idea you were so talented.”\nTubbo smiles. The fear and nervousness that had been filling him up for weeks has completely vanished. What’s left now is excitement and elation and  peace. \n“Thank you, Wilbur,” Tommy ducks his head, trying to hide his grin.\n“Of course,” Wilbur smiles. “I’m proud of you. All of you.”\n...\nThey spend  hours  telling Wilbur  everything . When it’s all done, Wilbur looks even more awed than before. They perform all of their original songs for him and the excitement on his face is contagious. Tubbo can’t believe he was ever worried about telling Wilbur. \n“Are you going to tell the others?” Wilbur asks when they finish “I’ll Be There”. He doesn’t specify who ‘the others’ are but Tubbo knows he means the rest of the smp and their other streaming and YouTube friends.\n“No,” Tommy says, “not yet.”\n“But eventually?” \n“Eventually,” Ranboo nods. \nWilbur hums, “Well. I’ll have your back whenever you decide to tell anyone else.”\n“Thank you, Wilbur,” Tubbo says.\n“Yeah, we seriously appreciate it,” Ranboo adds.\n“Good, good,” Wilbur tilts his head to the side. “So, about that song that I wrote-”\nTubbo can’t believe that Wilbur actually thought they might not like the song he wrote. It’s, frankly, ridiculous. Of course they like the song! It’s actually strange how perfect the song is for the Four of them, especially since Wilbur wrote it before discovering who The Multiplayers are. \nThey do need to work on it, though, because Tommy wants to make the drum part a little more complicated and Wilbur wants to make some of the lyrics flow a little better. They also decide to switch up some of the line distribution. One of the main changes is giving Tubbo’s line in Verse 2 to Tommy. \nIt’ll be a while yet before they release the song, but Tubbo is already excited for the reaction it’s going to get. It’s a  damn good song. The plan, however, is to release it on their EP as one of the two extra songs they’re allowed to put on it. Wilbur had readily agreed to the idea, but it means they’ll have to keep the collab a secret for a long time. They want it to be a surprise, after all. \n...\nRanboo is streaming so  of course Tubbo is going to call him. It’s not like Tubbo has anything better to do… \nHe should probably be sleeping, actually, but fuck if he’s actually going to. He wants to talk to Ranboo. Tommy is asleep already for sure and Wilbur- Tubbo actually has no idea what Wilbur is up to but he hasn’t been answering any of Tubbo’s messages so he’s probably busy or asleep.\nHe really wants to talk to Ranboo.\nSo he jumps into the vc that Ranboo and Techno are in. Neither of them are doing lore. In fact, Tubbo isn’t actually sure that Techno is even on the smp right now, but Ranboo is just mining so it’s fine for all of them to talk, he figures. \n“Hey Tubbo,” Ranboo says, chuckling a little. Tubbo wonders if Ranboo even had to check to see who joined the call or if he just  knew.  \n“Hello Ranboo.”\n“Oh, hi Tubbo,” Techno greets.\n“Hello, Technoblade.” \n“Shouldn’t you be sleeping?”\n“Oh jeez,” Ranboo says, “don’t ask.”\n“I wanna talk to Ranboo,” Tubbo whines as explanation. They end up talking about food because apparently, all of them are hungry but none of them are willing to actually get up and get themselves some food. Chat keeps telling them to feed themselves and when that doesn’t work, they at least get Ranboo to hydrate. \nRanboo also spends the time answering questions from donos, and everything is going fine until someone asks “Hey what’s your favourite song by The Multiplayers?”\nRanboo immediately says that he can’t decide on a favourite. Tubbo jokes that he likes all the songs except for the one written by Player One, which Ranboo’s chat gets rather upset about. \nTechno answers the question too, this time. “I like all of them,” he says, “but the metaphors in Masked are pretty great.”\n“What metaphors?” Ranboo asks. \nTubbo catches on immediately. “What’s a metaphor?” \n“Are you bein’ serious?” \n“Yeah? What are you talking about?” Ranboo plays up the confusion.\n“Yeah, I thought that song was about murder or something…” Tubbo has to mute himself so he doesn’t give it away from laughing so hard. \nTubbo unmutes just as Techno sighs, long-suffering, and says, “You’re just as bad as Tommy.”\nTubbo mutes again. \nA little later, another dono comes through, asking Ranboo if he plays any instruments. Ranboo, who is currently fighting two creepers and a zombie while on low health, answers without thinking. “An instrument? Yeah.”\nTubbo’s eyes go wide. Techno makes a small noise of surprise, which is probably what alerts Ranboo of his mistake. \n“Ha. The, uh, the tambourine.”\n“What?” Techno deadpans.\n“Yep. Tambourine.”\n“Tubbo,” the next dono asks, “are you in love with Player One.”\n“Absolutely.”\n...\nWilburTubbo\nTubboMr. Soot\nWilburWhy?\nTubboBahahahahaha\nWilburSeriously, though, be careful. People might get weird about it.\nTubboI know.I’ll be careful and I’ll shut it down if it gets weirdIt’s just meant to be fun.\nWilburOkay.Do you think Ranboo can actually play the tambourine?\nTubboAbsolutely. \n...\nThe next two covers they do are “Hydrangea” by Census and “Ex-Wives” from Six: The Musical. They’ve been working on learning the music for “Hydrangea” for a while now and they added the piano from the version of the song “Hydrangea Reimagined”, somewhat combining the two versions of the song. \nThey release the cover into the waiting arms of their fans, who get really excited about it. It looks like a lot of them are happy to see The Multiplayers doing another rock song. More rock music might be on their horizon, it seems.\n“Ex-Wives” is a project they started working on some time ago. They put it to the side after things started picking up for them because they wanted to do it properly.  Properly involves all of them singing, because there are six parts in the musical and only three of them.\nTommy is cast as Catherine of Aragon.\nTubbo is Anne Boleyn.\nRanboo sings the part of Jane Seymour.\nTommy also sings as Anna of Cleves.\nTubbo plays Katherine Howard.\nLastly, Ranboo is Catherine Parr.\n Properly also involves some video editing, because they make a lyric video for the cover. That way, it’s easier to see who’s singing what line. \nAll of the work that they put into the cover pays off. \n \n\n 10,135 Comments \n\nWottlesOh my god this was everything\nPh1LzA ✓Very cool\nSalted Chocolate Chipthe multiplayers never fail to impress me that was spectacular and omg i’m so happy that we get to hear more player two singing. he’s usually so far in the background\nKatherine ReedWhy did Henry marry so many C(K)atherines? And two anne(a)s??? Wtf. \nThe Multiplayers ✓We agree. That is very weird. Wtf henry. \nTam FoxI love SIX!! The Multiplayers are really out here doing covers for all of my fav musicals, huh?\n...\n\n Messages: WE KNOW \n\nJack ManifoldWhy did you not tell me you were going to do that???Why haven’t I heard of this musical?Tubbo broke england from the church apparentlyRanboo really just said: “I died” And tommy said that Henry VIII had a small dick\nWilburSIX: The Musical. British Hamilton\nTommyWilbur what the fuck\nRanbooJack you should listen to the rest of the musical. \nTommyNo, seriously wilburWhat the fuck???\nTubboOh my god Ranboo!\nRanbooTubbo!?\nTubboWe should watch Six on your alt twitch\nRanbooI think streaming slime tutorials might be illegal\nWilburOut of context that message looks weird as fuck RanbooAlso well done you guys. Your last two covers are terrific. Seriously, I’m blown away by how amazing you three are. Also don’t do anything illegal please\nTommyNo promises\nTubboNo promisesTommy you stole my reply :( \nTommyNo you stole mineBitch. \n...\n“Guys, I made a mistake,” is not a sentence that Tubbo expected would come out of Ranboo’s mouth, and yet here they are. It’s been several days since they released “Ex-Wives”. They haven’t had a lot of time since then to do The Multiplayers things because of streaming. Smp lore is really kicking them in the asses, but none of them are complaining because it’s fun as hell. \n“What do you mean?” Tubbo asks cautiously. The last time somebody freaked out, it was Tommy scaring all of them into thinking that Technoblade had done something like reveal their identities or something. And then it had turned out to be  nothing.  \n“I accidentally told a friend about the band…” So, not nothing then. “They’re a friend from school. The only person who knows about me being Ranboo, too.”\nTommy manages to top Ranboo’s earlier statement as ‘the most unexpected thing Tubbo has heard this week’ (this week and not this month or year because a  lot of weird shit happens to Tubbo, believe him) by blurting, “Oh thank fuck.”\n“Um… what?” Ranboo’s brows scrunch together.\n“Eryn and Freddie have known for fucking  months,” Tommy confesses. What the hell? Why didn’t Tommy tell them? He asks Tommy as much. “I dunno. I was worried you’d be mad about it? I swore them to secrecy! And they haven’t told anyone, so it’s fine.”\n“So it’s okay that my friend knows then?” Ranboo asks, worried. \n“Yeah, Ranboo, it’s alright,” Tommy tells him.\n“Wait, is it?” Tubbo asks. He figures it probably is, but they haven’t exactly spoken about this sort of thing yet. \n“I mean, I don’t see why not,” Tommy shrugs. It seems like that’s that, until Ranboo gasps so loudly that his mic briefly cuts out.\n“Tubbo,” Ranboo says, “does this mean you  haven’t told anyone?”\nTommy bursts out laughing. It’s not long until Ranboo and Tubbo join in.\n“I can’t- I can’t believe that-” Tommy tries to catch his breath in order to finish the sentence, “I can’t believe that, out of all of us-” he gasps,  “Tubbo is the one who hasn’t let the secret slip to anyone.”\n“Fuck off,” Tubbo grins. “I can keep a secret.”\n...\nTubbo is upset. There’s a song that he wants The Multiplayers to cover but he knows that they can’t. Not if they want to keep their identities a secret.\n“I know what you mean,” Ranboo says. “There’s a song that I think would be so great to do, but…”\n“Yeah,” Tubbo sighs.\n“Derivakat,” they both say at the same time.\n“So I guess I’m not the only one who’s been thinking about her songs?” Tommy asks. Tubbo hadn’t even noticed him join the call. \n“Guess not,” Ranboo says.\n“Her songs would be so fun to cover,” Tommy sighs.\n“Maybe someday,” Ranboo says wistfully.\n“Yeah,” Tubbo mutters. “Someday.”\n \nWilburYou know, you could still learn to play the songs anywayJust don’t record them.\nJack ManifoldYou could even record them, if you wanted to.Just don’t post them\nRanbooThat’s actually not a terrible idea…Guys?\nTommyLet’s fucking do it. \n...\nTommy is late for his own mod video. Tubbo rolls his eyes. He’s currently sitting in a vc with Wilbur, Jack, and Phil. They’ve been waiting for a while, not that any of them mind. They’ve been having fun just chatting with each other and they all enjoy doing the mod videos anyway. \nTubbo does wish that they could get on with it, though. Jack said that he had an idea he wanted to run by him after filming. It apparently involves The Multiplayers. Due to Phil being in the call, they can’t exactly talk about it yet.\nPhil. Tubbo kind of wishes they could tell Phil. Maybe he should bring it up with the rest of the band. Tommy will probably be on board. Ranboo, too. Philza Minecraft is great, after all. \n Finally, Tommy joins the call. He starts talking immediately (which is not unexpected for mid-afternoon pre-filming Tommy). \nWhat  is unexpected (Tubbo needs to change ‘the most unexpected thing Tubbo has heard this week’ into ‘the most unexpected thing Tubbo has heard today’ because the weird shit has been coming at alarming rates recently), are the words that come out of Tommy’s mouth.\n“Tubbo, you have  got  to stop flirting with yourself on The Multiplayers Twitter account!” Oh fuck. Tommy hasn’t noticed that Phil is in the call. How the fuck hasn’t he noticed? Tubbo sits, frozen, as Tommy continues to ramble. “You accidentally signed off your last tweet as Player Three!  I don’t want to flirt with you, full offence.” \n“Uh- Tommy,” thank god for Wilbur. Tubbo can’t seem to find his voice right now. When he was thinking about telling Phil, it sure as hell wasn’t supposed to go like  this. “Tommy we aren’t… alone.”\n“What? Wilbur what the fuck is that supposed to-” Tommy cuts himself off. “Oh.”\n“Yeah,” Jack cringes. “Oh.”\n“Well,” Phil sighs, “I really should have seen this one coming. Why am I not surprised?” \nThey’ve gotten too comfortable. Now that Wilbur and Jack know, The Multiplayers got comfortable talking about the band with them. Tubbo knows that’s why Tommy didn’t even notice Phil in the call. He saw Wilbur and Jack (and Tubbo) and thought it would be fine. As if he wasn’t the one to invite Phil for the video in the first place.\n“Fuck,” Tommy says. The call remains quiet for a good few seconds before Phil sighs again.\n“Let me guess,” he says. “You, Tubbo… and Ranboo?”\n“Uh, yeah,” Tommy says. \n“Wow,” Phil says. “You three are amazing.”\n“What?” Tubbo blurts, finding his voice. \n“Your music is amazing. Kristin and I love it,” Phil says genuinely. Mumza! Tubbo smiles. He honestly isn’t very worried anymore. Maybe it’s because they’ve already gotten through two people finding out, maybe it’s because it’s Phil, maybe it’s because he doesn’t care as much about keeping a secret identity anymore.\n“Awe,” Tommy gasps, over-the-top but clearly touched,  “Phil.”  \nThey end up spending some time telling Phil about how the band started. They get to gush about the collab that they’re doing with Wilbur, too. Phil mentions the Tubbo and Player One rivalry-to-romance story which sets Tubbo into a fit of laughter. \n“Tubbo!” Tommy shrieks. “That reminds me! Fix your Tweet! Or else you’ve just formed a love triangle!”\nTubbo does fix the tweet by responding to it with “shit this is from P1 not P3 I’m so sorry @TubboLive.” \nThey eventually get around to filming the mod video. Afterwards, Phil goes quiet for a second, then says, “Holy shit. Have you boys been messing with Techno about metaphors this entire time?”\nTommy and Tubbo can’t respond for a full two minutes. They’re laughing too hard. \n...\n“Phil knows,” is the first thing Tommy says when they get into a call with Ranboo later that day. Wilbur should be joining the call any minute now, as well. They’re rehearsing his song.\n“What? How?” Ranboo questions. \n“Tommy,” Tubbo responds, only  Ranboo says it at the same time, answering himself.\n“Wha- Ranboo!” Tommy complains. “You weren’t even there!”\n“But I was right, wasn’t I?”\n“What was Ranboo right about?” Wilbur asks, joining the call. \n“Tommy told Phil,” Ranboo explains.\n“Oh. Yeah, I was there.”\n“I didn’t  tell him…” Tommy winces. “I just didn’t realize he was in the call.”\nThey rehearse Wil’s song for a while. The bridge is particularly complicated, especially because Tubbo and Wilbur worked for a while to add even more to it. They also spend a lot of time working on the vocal harmonies. \n“How are we going to record this?” Wilbur asks while they take a break. Tubbo explains to him how they usually do it. Wilbur sort of knew already how they recorded and mixed their songs, but when Tubbo explains the whole process more in-depth, he grows even more impressed with all of them. \n“The label suggested we re-record the other songs with better microphones and stuff for the EP, though,” Ranboo explains.\n“But they’re still going to let me mix the songs!” Tubbo grins. \n“Ranboo are you going to come to the UK to record?” \n“Oh,” Ranboo says.\n“I think we were all just going to record our parts at the studios closest to us,” Tommy answers.\n“The travel ban has been lifted,” Wilbur points out.\n“Ranboo-” Tubbo starts.\n“-How would you like to come to the UK?” Tommy finishes. \n...\nMaya Dean | @M_ayaDeanOh my god when Player One accidentally signed a tweet for Tubbo as Player Three I got so scared.\n \nGreen Cat | @wotlen I know! I was like P3 is coming for your man, P1\n \nI guess | @LoveTheMultiplayersI’m so excited for the @TheMultiplayers EP!!!!!\n \nNick Halden | @NotCaffreyIt would be so cool if @TheMultiplayers did covers for every SIX song\n \nYep | @Hen118You’re right!!!! (no pressure tho lol)\n \nKath | @WOOoo_Someone asked for this and I am so happy to provide: @TheMultiplayers as ATLA benders - a thread\n \nKath | @WOOoo_Player One: Fire bender - I feel like he’d either be a fire bender or like, from the earth kingdom (but not an earth bender).\nKath | @WOOoo_Player Two: Earth bender - it was this or water but i feel like Player Two is a very grounded person so I chose earth solely for the pun… And also because i just think it fits.\nKath | @WOOoo_Player Three: Air bender - I almost said fire bender but I feel like air fits better? Idk why tho.\nKath | @WOOoo_Alright, that’s the thread. Feel free to make art lol\n...\nTubbo is on the Dream smp server but he isn’t streaming. He’s pretty sure Foolish is streaming, but he doesn’t feel like joining any streams right now. Karl and Sapnap are also on the smp somewhere but Tubbo thinks Karl ended his stream at least a half-hour ago. \nThat’s why he’s confused right now. Sapnap is asking him to join their vc. Tubbo frowns but joins nonetheless.\n“Tubbo!” Karl exclaims.\n“Hello.”\n“Hey man,” Sapnap says. “How are you?”\nSomewhat puzzled, Tubbo says, “I’m well. How are you both?” He supposes it isn’t too surprising that they just want to chat. \n“Great!” Karl says. “But we are a bit worried about you.”\nOkay, what? What does that mean? Why would they be worried about Tubbo? Did something happen recently? \n“Um, how come?” \n“No specific reason,” Sapnap says. “But you have seemed a little more tired than usual.”\n“And you’ve been streaming less than usual,” Karl adds.\n“Is that a bad thing?” Tubbo can’t help but ask. \n“No!” Sapnap rushes to say. “No, stream as much or as little as you want, Tubbo. We just mean that you used to be very consistent about streaming every day. It’s okay to take a break! We just wanted to make sure you weren’t…”\n“Overwhelmed,” Karl supplies, “or exhausted. Burnt out?”\n“Or, if you  are, that you’re taking care of yourself,” Sapnap continues, “Or getting support.”\nTubbo knows the reason behind his stream schedule and his sleepiness is the band. But he can’t say that. “Everything is fine. I’m just taking some time for myself,” he tells them instead. \n“Alright,” Karl says, dragging out the word a little. Tubbo winces. Karl clearly doesn’t believe him. \n“Listen,” Tubbo says, “I’ve gotta go. My sister needs my help with something.”\nTubbo flees the call before Karl and Sapnap can say anything more. \n...\nHe calls Sapnap back later that night. One person isn’t as nerve-wracking as two.\n“I’m Player One.”\nAlright, if the others have both told at least one person, other than Jack, Wilbur, and Phil, then Tubbo gets to tell one person too. Who better than someone that he trusts? It’ll also help get Sapnap off his back. He appreciates the worry but it’s truly unnecessary. \nSapnap doesn’t say anything for a long moment. Tubbo prepares to lay down his proof, but Sapnap speaks before it’s needed. “Oh for fucks sake.”\n“Um.”\n“Sorry. I just mean,” Sapnap takes a breath, “in hindsight, it’s sort of… obvious? But I never would have known if you hadn’t just said it outright.”\n“Oh. Alright.”\n“I- are you flirting with yourself on Twitter?”\n“Uh… yes?”\nThat seems to lighten the mood. They both laugh over the absurdity of it. \n“So, why are you telling me this now?” \n“I didn’t want you to be worried about me,” Tubbo explains.\n“I mean, it explains why you’ve been streaming less,” Sapnap says, “but I’m still sort of worried. You don’t want to overwork yourself.”\nTubbo smiles. “Thanks, Sap, but it’s alright. Wilbur has been on our asses about not overworking ourselves lately. We’ve been getting better about taking breaks and getting sleep.”\n“Wilbur knows?”\n“And Phil and Jack,” Tubbo says. “Jack actually figured it out on his own.”\n“Well shit,” Sapnap says, sounding impressed. “And, um, who’s  we? Is it actually…”\n“Tommy and Ranboo?”\n“I can’t believe that the fucking conspiracy theories are  true,\" then, “Tommy is totally Player Three, isn’t he?”\n...\n“I still can’t believe you told  Sapnap,” Tommy grumbles. Tubbo just laughs at him. He’s glad he told Sapnap. Now there’s one more person that he can talk to about the band. One more person he can be completely honest with, no hiding things, no lies. \n“You told Eryn and Freddie,” he counters.\n“Tubbo has a point,” Ranboo says. “We all told someone, it’s only fair that he be allowed to someone, too. Plus, it’s Sapnap. He’s good at keeping secrets. He knows what Dream’s face looks like and he hasn’t shown anyone.”\n“I mean, I think that’s just decency and like, being friends,” Tubbo says.\n“Yeah. He’s decent and he’s your friend.”\n“Can we get back to the song?” Tommy asks.\n“You’re the one who brought it up,” Ranboo chuckles. Nevertheless, they do get back to writing their song. “Flowers”, as they’ve titled it, is going to be the final song on their album. It’s a sappy as hell bubblegum pop love song and Tubbo  adores it. Once it’s done, it’s going to be so fucking fun to play and to sing.\nThe first two verses go like this:\n With the sun shining down on me Flowers surrounding me I know that all I need now Is you! \n With your heartwarming smiles, I’m so often beguiled. My thoughts go on for miles ‘Bout you!\nThey just need to write a third verse now, although they’re thinking of changing the guitar chord progression as well. Ranboo and Tommy are both going to record guitar parts for the song, Ranboo doing the main melody while Tommy does rhythm guitar. First they have to actually finish the chord progression, though. \nThen they get to record it! They’re going to wait to record it until Ranboo arrives in the UK. Then they’ll spend some time re-recording their older songs and newly recording “Flowers” and their song with Wilbur. \nTubbo is so freaking excited for him to finally arrive. It’ll be Tubbo’s first time seeing him in person  and  the first time that they’ll all be together as a band.  And,  as long as they keep it a secret that  The Multiplayers are meeting up, they don’t have to keep it a secret that the three of them as streamers are meeting up. They can do streams together!\n...\nThey’ve been spending so much time working on their original songs and streaming that The Multiplayers’ fanbase is getting… antsy. Luckily, they have one cover that they only need to record vocals for, having already played and mixed the music, so they find the time to do that.\nThey release their cover of  “C’est La Vie” by Weathers. Player Three sings it. Their fans rejoice. A shit ton of TikTok videos are made using soundbites from the cover. The Multiplayers briefly trend on Twitter. Buzzfeed makes a list of “The Multiplayers’ Top Ten Covers”. \nIt’s strange, because it’s a similar reaction to what Tubbo sometimes gets when he streams. People  missing him after a long period of silence. People getting excited whenever he streams, whenever he shows up on someone else’s stream. It’s… it’s touching that people care so much, but it also puts a lot of pressure on the band to constantly put out songs. \nThere’s also the constant pressure to reveal their faces. Tubbo has no idea how Ranboo copes, considering he gets  double the pressure. \n“I have an idea,” Ranboo says one day, after Tubbo has brought up the face reveal pressure. Ranboo barely gets three words into explaining it before Tommy is already agreeing. Tubbo feels like an evil mastermind just thinking about it. \n...\nThe video is titled “Face Reveal!!!”\nThe cover that they do -  because of course they’re actually going to cover the song, not just put the original into the video - is “Never Gonna Give You Up” by Rick Astley. \n\n 7194 Comments \n\nSalted Chocolate ChipWe really should have been expecting this… \nPh1LzA ✓Oh my god\n \nThe Multiplayers ✓AHAHAHAHAHAHAHA - P3\nPLUETOWHAT THE FUCK YOU MOTHERFUCKERS\nTam FoxAs mad as you might be that they tricked us, you gotta admit that their cover is really good.\nWottlesOh\n \nThe cover seems to get the message across that they don’t want to do an identity reveal. \nExcept, Tubbo’s starting to think that maybe… maybe he  does.  \n\nRanboo is in the UK. This is not a drill. \n\n\nTubbo hasn’t actually met up with him yet because he’s quarantining for ten days in a hotel (better safe than sorry, or whatever) but the fact that he’s even here is incredible. \n\n\nBefore Ranboo flew to England, The Multiplayers recorded one more cover that they would release in the middle of the ten day quarantine so that there wouldn’t be some unexpected hiatus. The song is “Sorry” by Joshua Bassett. \n\n\nThankfully, Ranboo can stream from his hotel since he never uses a camera and therefore won’t give away that he’s gone anywhere. His setup is kind of a mess, because, while he was able to bring his microphone from home, the rest of it is made up of a bunch of extra parts from Tommy, Tubbo, and Wilbur. \n\n\nThe rest of their time is spent working on their song with Wilbur and finishing “Flowers”.  \n\n\nRanboo also starts learning how to play his keytar. He’s apparently had it for a while but never learned how to play it. Instead of bringing more of his streaming setup, he decided to bring the keytar so he would have something to do during quarantine. Tubbo can’t imagine how boring it must be, being stuck all alone in a hotel room with no in-person interactions with \n\nanybody.\n\n\n\nTubbo is pretty sure that Ranboo has started writing a song that involves the keytar (even though they could just use Tubbo’s keyboard?), but he can’t be certain. \n\n\nMeanwhile, Tubbo and Tommy have to pretend that one of their best friends (and bandmates) isn’t visiting. Tubbo keeps accidentally talking about Ranboo visiting in present tense instead of future whenever his chat asks about it. Ranboo tweets “the weather in england is so weird??” and has to play it off as Tommy complaining to him about it on Discord. \n\n\nThey’re a bit of a disaster, but Tubbo doesn’t really care. He’s too excited about all of this for it to really matter to him.\n\n...\n\nTubbo \n| @TubboLive\nHey P2 and P3 can we finally meet in person?\n\n\nPreSerum Steve \n| @N_Leeds\nUh? Tubbo do you only want to meet up with 2/3 of The Multiplayers??? I thought you were flirting with P1? \n\n \n\nMaya Dean\n | @M_ayaDean\n@TubboLive is Player One confirmed? /j\n\n\nGreen Cat \n| @wotlen \nWait holy shit is Tubbo Player One? Did he use the wrong account??\n\n...\n\nTubbo has a greater than usual number of Twitter notifications when he wakes up. He barely has time to be concerned about it before Ranboo is busting into the room Tubbo and Tommy are sharing. \n\n\n(The American’s ten day quarantine ended yesterday. Tommy and Tubbo arrived in London late last night and checked into the hotel room beside Ranboo’s. They slipped an extra room key under the door for their bandmate to use in the morning.)\n\n\n“Tubbo!” Ranboo shouts, panicked. “Tubbo!” \n\n\n“Wha-?” Tommy flails in his bed, startled awake. \n\n\n“Your Tweet from yesterday!” Ranboo shoves his phone into Tubbo’s face. Tubbo grabs the phone to steady it and reads the tweet.\n\n\nThe Tweet that was meant to come from The Multiplayers account. \n\n\nThe one that he Tweeted on his \n\nTubbo \n\naccount. \n\n\n“Oh shit,” Tommy says. Tubbo turns to find a half-asleep Tommy staring down at his own phone, obviously looking at the Tweet. Tommy rubs at his eyes and reads it again, like he’s just too tired to be seeing it right. When he finds that it hasn’t changed, he mutters, “shit,” one more time for good measure. \n\n\nTubbo- Tubbo might cry, actually. He can’t believe he fucked up so badly. The others must notice that he’s on the verge of tears because Ranboo immediately backs off and climbs onto the end of Tubbo’s bed. Tommy sits up and swings his legs over the edge of his own bed to face Tubbo. \n\n\n“Hey, listen,” Ranboo says softly. “It’s alright. We can figure something out, okay?”\n\n\n“Actually,” Tommy says, looking pensive, “you didn’t sign the Tweet off as Player One. I think I have a way that we can fix this.”\n\n...\n\nThe Multiplayers\n | @TheMultiplayers\nLol guys I’m visiting Tubbo right now - P1\n\n\nTubbo \n| @TubboLive\n&lt;3\n\n \n\nCurrently Losing It \n| @TamFox\nTubbo and P1 met up? Was it a date..? /j\n\n\nTubbo \n| @TubboLive\nhmmm… \n\n\nCurrently Losing It \n| @TamFox\nTubbo???? What does this mean????? \n\n...\n\n“Hey chat,” Tubbo says. “For anyone who was wondering about my Tweet, yes, I met Player One. No, I’m not going to be meeting any of the other Players anytime soon. I just want to meet them eventually. One of the Multiplayers is still in America, though, so it’ll be a while.”\n\n\nAnd that’s that. Tubbo opens Minecraft and hops into a vc with Ranboo. \n\n\nOr, that’s mostly that.\n\n\nPeople definitely think he’s dating Player one, now. \n\n...\n\n“Holy shit,” Tommy says. The three of them - plus Wilbur - are standing in the recording studio. Someone has already walked them through how everything works (for over an hour, seriously) and now they’ve been left alone to figure things out. Wilbur has experience with this already, and Tubbo and Tommy have both been to this studio before (though they weren’t allowed to touch much that time), so Tubbo isn’t too worried that they’ve been left to their own devices. \n\n\n“This is amazing,” Ranboo says, looking around the studio. Tubbo spins, taking it all in. He \n\nnever \n\nthought he’d ever be here. In a recording studio \n\nand \n\nin this position: lead singer and keys player in a well-known band who’s about to make their own EP. \n\n\nHe doesn’t know why he says it. Maybe it’s the high of being here or the excitement he feels being surrounded by his friends. \n\n\n“I want to tell people.”\n\n\nIt’s like time stands still. Nobody says anything. Nobody moves. The air is so thick that Tubbo thinks he might very well be choking on it. Fuck. He shouldn’t have said that. What was he thinking? God, he doesn’t want to be the reason that the band falls apart. \n\n\n“What, uh,” Ranboo is first to speak, “what do you mean by \n\npeople?”\n\n\n\nFuck it. This is what he wants. “Everyone.”\n\n\nTubbo watches as Ranboo sucks in a breath and exchanges an apprehensive look with.\n\n\nOkay. Maybe he should backtrack. Tell them it’s a joke and forget about it. This was a mistake. \n\n\nA hand lands on his shoulder. He jumps, startled. It’s Wilbur. “Why don’t we sit down,” he says, pulling out one of the office chairs in front of the mixing equipment for Tubbo. He grabs the other office chair for himself and gestures to a small armchair for the others. \n\n\nTubbo sinks into the chair, grateful to be off his feet. He fears that if he’d been standing any longer, he would have fallen over. The others squeeze themselves onto an armchair. It’s really not built for two people, both of whom are at least six feet tall, but they make it work. \n\n\n“Alright,” Wilbur says, “Tubbo, why don’t you explain to the others what you mean.”\n\n\nLooking at his friends, Tubbo finds that they seem ready to listen. “I want to tell everyone. To do a \n\nface reveal \n\nor whatever we’ve been calling it. Hiding has just been so- so \n\ndifficult \n\nrecently.” \n\n\n“I agree,” Ranboo says. Wait-\n\n\n“Really?” Tubbo asks incredulously. \n\nRanboo \n\nagrees?\n\n\n“Really. It’s hard enough keeping one secret identity,” okay, that makes a lot of sense, actually. “And like, we’ve already established ourselves as a good band, I guess, so we know we’ve got a following even without our streaming audiences.”\n\n\n“Tommy?” Wilbur prompts. Everybody looks to the boy in question. The studio is quiet and then-\n\n\n“Fuck,” Tommy jumps up and flees the room.\n\n\n“Tommy!” Ranboo calls, beginning to stand.\n\n\n“No, wait,” Tubbo stands too, holding a hand out to stop him, “let me.”\n\n...\n\nTubbo finds Tommy sitting on a step in the stairwell. He’s hunched over and jittering, one leg bouncing up and down. He startles when Tubbo sits down beside him, but says nothing. A light flickers overhead.\n\n\n“Hey,” Tubbo nudges Tommy’s knee. He gets no response. They sit there in silence for a few minutes until Tubbo speaks again. “We don’t have to, if you don’t want to.”\n\n\n“Yes, we do,” Tommy grumbles, barely audible. \n\n\n“What? Tommy, we-”\n\n\n“You both want to,” Tommy says. Tubbo is still a bit surprised that \n\nTommy, \n\nof all people, \n\ndoesn’t. \n\n\n\n“That doesn’t matter,” Tubbo insists.\n\n\n“It does!” Tommy yells. His voice echoes in the stairwell. “It \n\ndoes \n\nmatter, Tubbo! I don’t want to be the thing holding you both back!”\n\n\n“Holding us- Tommy! You won’t be holding us back! Look,” Tubbo turns slightly, angling his body so that he’s facing Tommy as best as he can. Seriously he says, “We aren’t going to tell anyone unless we \n\nall \n\nwant to, but… don’t you think it’ll make our lives a little easier?”\n\n\n“Easier? Tubbo, we’re going to have even more eyes on us! Even more people talking about us! \n\nCriticizing \n\nus! Everything will- it’ll all come crashing down on us!”\n\n\n“Don’t you want control?” Tubbo shouts.\n\n\n“I- what?!”\n\n\n“I want control of how people find out,” Tubbo explains. “I want to tell people on our own terms before they find out on their own. Before they… I don’t know, speculate and come to their own conclusions. I want to be in control of our narrative.”\n\n\nTommy’s mouth drops open, but it snaps shut as he sobers. “We keep messing up, don’t we?” he whispers.\n\n\n“Yeah. One of these days, there’ll be no way to cover it up. No excuses to fall back on.”\n\n\n“And everything will come crashing down anyway.”\n\n...\n\nIt takes them two weeks to record everything to their liking. It’ll probably be another month or two until the EP is completely done, though. Tubbo has to mix the music and keep a semi-normal streaming schedule, and \n\nthen \n\nthere’s all the marketing stuff that the record label wants to prepare for. \n\n\nThey’ve told the label their face reveal plan. The label \n\nloves \n\nit.\n\n\nIn their downtime, whenever they aren’t in the recording studio, they vlog. After Tubbo’s accidental Tweet from the wrong account, they decided that streaming together might be a bad idea. It’d be too suspicious. Too obvious. Instead, Ranboo is pretending that he’s still in the States. They’ll release their vlog after the face reveal. It’ll also serve as a ‘Behind the Scenes’ for their EP.\n\n\nThey eventually settle on a release date for the EP. It’ll also be their face reveal date. It’s far enough away - two months from now - that Ranboo and is going to fly home and then fly back to the UK again for the reveal. His family misses him and he also needs to, you know, finish school. \n\n\nTubbo would definitely be more upset about him leaving if he didn’t know he would be returning sometime soon. \n\n...\n\n“Oh holy fuck,” Tommy joins The Multiplayers’ vc abruptly and without warning. He’s just ended his stream, which Tubbo and Ranboo were both watching together. They were making funny comments but never actually joined Tommy’s vc. \n\n\n“Um, Tommy?” Tubbo inquires. \n\n\n“We haven’t chosen a name for our EP!”\n\n\n“Oh,” Ranboo says, then \n\n“Oh!”\n\n\n\n“We could just self-title it,” Tubbo suggests. Even before the others turn it down, he finds he doesn’t like the idea. \n\n\n“What about… RPG?” Ranboo suggests. “For Role-Playing Game? Because we’re, like, role-playing as Players One to Three? And also because we role-play on the smp? God this idea is not as good as it sounded in my head.” \n\n\nTommy laughs. “Yeah, not great,” he jokes.\n\n\nThey run through a few more ideas, including but not limited to: Select Player, Choose Save File, and AFK (because they were away from their keyboards - meaning not streaming or playing Minecraft - while they made the EP). \n\n\nThey’re contemplating ‘Select Checkpoint’ when Tommy suddenly bursts out laughing for absolutely no reason. \n\n\n“What?” Tubbo asks. “What is it, Tommy?”\n\n\n“I-” Tommy takes a deep breath. “I had a stupid idea.”\n\n...\n\nThe Multiplayers\n | @TheMultiplayers\nGet ready! “The Multiplayers: Update 1.0.0 - EP” by The Multiplayers is coming soon! \n\n\nThe Multiplayers\n | @TheMultiplayers\n2 months… -P2\n\n\nThe Multiplayers\n | @TheMultiplayers\nMark your calendars boys! -P3\n\n\n\nThe Feral Boys Interlude:\n\n\n\n\n(\n\n\nDream\n\n\n added \n\n\nWilbur Soot\n\n\n to \n\nFeral Boys!!! Group Chat\n\n)\n\n\n\nWilbur Soot\n?\n\nDreamHey Wilbur\n\nWilbur Soot\nHi?\n\n\nQuackity\nHI!!\n\n\nKarl\nHi! \nWe wanted to let you know that all of us are coming to London in a couple of months to meet up with George!\n\n\nWilbur\nOkay?\n\n\nKarl\nDo you want to set something up with Phil and Jack and Tommy and Tubbo?\nAnd you, obviously\nSo we can all meet up for a day or 2?\n\n\nWilbur\nOh! Of course! \n\n\nDream\nYes!\n\n\nSapnap\nDon’t tell anyone else tho!\n\n\nGeorge\nWe’re going to surprise Twitter\n\n\nWilbur\nAlright\nWait hold on\nWhy are four of you coming to the uk instead of just having George fly to America?\n\n\nQuackity\nAhahahaha\nDon’t ask\n\n\n\n(\n\n\nGeorge\n\n\n removed \n\n\nWilbur Soot\n\n\n from \n\nFeral Boys!!! Group Chat\n\n)\n\n\n...\n\n“Wilbur, that’s literally the day of our face reveal!” Tubbo realizes when Wilbur asks if he and Tommy are free to meet up with the Feral Boys. \n\n\n“Oh,” Wilbur responds. “Shit.”\n\n\nTommy cackles. “Wilbur, you’re meant to be there for the reveal! How the hell did you forget?”\n\n\n“I don’t-” Wilbur sighs. “Right, I’ll tell them we’ve got to change the day-”\n\n\n“Now hold on,” Tommy interrupts. “Instead of doing that, why don’t we…”\n\n\nTommy explains his idea. Tubbo can feel his own smile growing as Tommy outlines his plan. They’ll have to run it by Ranboo, but he doubts their bandmate will object. In fact, it sounds vaguely like something Ranboo would’ve come up with himself.\n\n\n“You know, Tommy,” Wilbur says, “you’re a little bit evil, I think.”\n\n\n“Oh, he’s definitely evil,” Tubbo giggles.\n\n...\n\nThe Multiplayers Announce Collab on Their EP\n\nThe faceless band known as The Multiplayers announced this morning that one song on their upcoming EP is a collaboration with mystery artist.\n\nby Todd Wilson\n\nRead more\n\n\n\nFans Excited Over EP from The Multiplayers, “Update 1.0.0”\n\nOriginally a cover band, The Mutliplayers have slowly been releasing original songs. Now signed by Euterpe Record and Music Group, the group of three is preparing to release their first EP. \n\nby Claire Han\nRead more\n\n\nCheck Out ‘Miss Keledones’ on YouTube and Spotify: Another Faceless Singer With a Spectacular Voice\n\nIf you like The Multiplayers, you’ll like Miss Keledones. Named after the mythological singing maidens that Hephaestus sculpted from gold, Miss Keledones will blow you away!\n\nby Evan Diaz\n\nRead more\n\n\n\nIs The Multiplayers’ New EP Name Inspired by Minecraft?\n\nMany fans of the band have pointed out the connection between “Update 1.0.0” and the popular game Minecraft. Is the EP Minecraft themed or is it all just a conspiracy theory? \n\nby Paul Wood\n\nRead more\n\n\n\nDream Said He Wants To Go To a ‘The Multiplayers’ Concert After the Pandemic and Antis Are Mad\n\nPeople are mad at Dream and I honestly don’t even know why. Please tell me in the comments. On another note, stream The Multiplayers’ new EP when it comes out!\nby Amelia Larann \n\nRead more\n\n\nIn the weeks leading up to their face reveal, The Multiplayers only release three more covers. Ranboo is crazy busy with lore on the Dream SMP, Tommy and Ranboo are swamped with school, and Tubbo spends most of his time either streaming or mixing their songs. In fact, Tubbo is so busy that the others end up doing two of the covers without him. \nTubbo helps with “Bugbear” by Chloe Moriondo, singing lead, but the others do “One Little Lie” by Simple Creatures and “The Other Side” from The Greatest Showman on their own. Ranboo sings the verses and pre-choruses for “One Little Lie” while Tommy sings the choruses. For “The Other Side”, Ranboo sings Hugh Jackman’s parts while Tommy does Zac Efron’s. \n...\nTubbo sees the beginnings of the meetup through Twitter and through the occasional Facetime with Tommy. The Americans went to London - obviously, that  is where George is - and while Tubbo is actually in London as well, he can’t let them know that he is. He’s in the studio mixing songs (he’s done as much as he can at home, and the studio has way better equipment, even if he was allowed to take some home with him after their recording sessions). \nRanboo has been helping him as best as he can from across the ocean and then from his hotel in quarantine. Tommy had been helping, too, but now that he’s with the Feral boys…\nHe’s not mad at Tommy, obviously. In fact, he’s glad that Tommy is directing attention toward the meetup. It means less attention on Tubbo himself.\nTubbo was sad to have to tell his fans that he’d be taking a week off from streaming, but he knows that it’s necessary if they want to release the EP on time. Thankfully, he’s got a backlog of YouTube videos that he can release, one on his main channel and two on The Let’s Play Channel that he filmed forever ago and just never bothered to edit. Everybody - save for The Multiplayers and the people who know their identities - thinks that Tubbo is doing important family things. \nBut finally,  finally, the EP is done. They’re releasing it in a week. \nTubbo leaves his hotel feeling as though a huge pressure has been lifted from his shoulders. He’s not far from where everyone else is staying for the meetup. Because it’s such a big deal, and because the Americans are staying for a long time, they opted to just rent a house. \nPhil messaged Tubbo earlier in the morning to tell him that everyone was planning to just have a chill day today, which Tubbo is thankful for. He’s rather tired from all the work he’s been doing and he’s not sure that he’d be able to handle meeting everyone in person for the first time  and going into content creation mode immediately.\nHe arrives around midday, struggling slightly to knock on the door when he’s got a duffel bag in one hand and his ukulele in the other. He’s glad he was able to leave his keyboard and synth at the recording studio, but he wanted to bring his ukulele to the meetup just in case. You never know, maybe Wilbur will randomly bust out his guitar and Tubbo can join in. Tommy’s drum set is also already at the recording studio. The label offered one of their sets to Tommy to use so he wouldn’t have to lug his down again, but Tommy wasn’t having any of that. \n“Tubbo!” It’s Karl who answers the door, flinging it wide open. He immediately takes the duffel bag out of Tubbo’s hands, helping him inside. Everyone else is scattered about in the living room, but they all stand up to greet him. \n“We were just deciding what we wanted to do for lunch,” Phil says once everybody has had the chance to say hello. Tubbo had even gotten hugs from Sapnap and Wilbur (and Tommy, but it was a very subtle, secret hug). “Any suggestions?”\nTubbo does not have any suggestions and they end up just ordering several pizzas. An hour into the meetup and Tubbo is already having the time of his life. He’s eating pizza and having fun with all of his friends. George and Quackity get into a shouting match over the last slice of plain cheese pizza, Jack and Tommy keep ‘Ayup’ing at each other for literally no reason. At one point, Karl and Wilbur launch into a shitty rendition of “Lost and Losing”, which makes Tubbo choke on his laughter and Tommy groan because  why not “Masked”? Through it all, Phil and Dream somehow have a full, mature conversation about taxes or some shit. \nGod, Tubbo can’t wait for Ranboo to finally be through with his two-week quarantine. He knows that he won’t be able to spend much time with him until  after their face reveal, since it’s a secret that he’s even in the UK, but Tubbo doesn’t mind. \n...\n“The Multiplayers dropped another cover,” Dream says at breakfast the next morning. From across the table, Tommy sends Tubbo a mischievous grin. This is Part One of their plan. Ranboo uploaded the video about an hour ago.\nIt’s a cover of “Bang!” by AJR. Tubbo sings lead and plays keys, as always. Ranboo is on bass, Tommy on drums. Ranboo is also on… trumpets. Listen, there’s no guitar in the song and Ranboo was apparently in his middle school marching band or whatever the fuck so he offered to do the trumpet bits for Tubbo to layer on top of each other.\nWilbur insists that they watch it on the T.V. screen together. He’s in on the plan - he’s a bit upset that they chose an AJR song. Wilbur doesn’t like AJR - so he obviously wants to see everyone’s reactions at once. \nGeorge hits play on the video. It fades from black to a shot of Tubbo’s hands playing the keyboard. As the other instruments get added in, the others show up in other quadrants, but the shots only show their hands playing the instruments. Ranboo is there twice, in one quadrant with his bass and in the other with his trumpet.\n“Oh holy shit,” Sapnap subtly raises an eyebrow at Tubbo, who simply smiles wickedly at him and focuses back on the screen. \n“Are they revealing their faces?” Karl asks. Tubbo can’t tell if Karl is concerned or ecstatic. From the look of it, Jack  is concerned. So is Phil. Oh right! They never told them the plan. Oops. \nAs the song continues, the cameras pan out. Each Player’s background is plain white (they used greenscreens) and they’re all wearing Venetian masquerade/carnival-style masks. Black, hooded cloaks hide their hair. Camera angles help to further hide their identities. \nTubbo really likes his mask. It’s green and white, covering only the top half of his face, around his eyes. Ranboo’s is a black and gold bauta mask, covering his entire face. Tommy’s is red and black. It covers most of the right side of his face but only the top half of the left side of his face. \nTubbo worries his lip, looking at his friends’ faces for any hints of recognition. By the time the song is almost over and none of them have said anything, Tubbo relaxes. \nThe song ends. The Multiplayers in the video all reach up to their masks, as if to take them off, and then- \nIt cuts to black.\nOn the screen, in white text, the link to the new Twitch account that The Multiplayers made appears. Under that is the date of their EP release.\n“Oh my god,” Quackity says. “They’re gonna livestream a face reveal? Is that what this means?”\n“I think that’s exactly what this means,” Wilbur says as if he has no idea that this does, in fact, mean they are going to face reveal live on Twitch. \n...\nPhilza\nYou’re going to stream your face reveal???\nWhy did i not hear about this until today?\nJack Manifold\nYeah, feeling a little caught off guard, you guys\nTommy\nFuck\nWe forgot to tell you\nTubbo\nSorry!\nRanboo\nAhahaha\nOops\nPhilza\nJesus christ\nAre you doing a full reveal, Ranboo?\nRanboo\nNah. \nI’m gonna put on my mask and glasses and gloves before we turn on the camera\n...\nThe morning of their EP release and face reveal, they upload some of the Derivakat songs that they recorded forever ago. One sung by each of them. It’s Part Two of their plan. Ranboo sang “In My Head” and Tommy did “Welcome Home”, of course. And, while Tubbo did sing a version of “Honey”, they end up uploading his version of “Ain’t No Crying” because they want all of the covers to be directly Dream SMP themed. \nThe Feral Boys go, well, slightly feral after they hear the covers. They’re obviously pretty excited that one of their favourite bands did something based off of the Minecraft role-play that they’re all a part of. \nThe internet is going pretty crazy, too. There are tons of theories, ranging from The Multiplayers actually being Ranboo, Tubbo, and Tommy, to The Multiplayers potentially getting added to the smp. \n...\n“So,” Sapnap says. He and Tubbo are washing lunch dishes. \n“So,” Tubbo replies, drying a plate.\n“Today?”\nTubbo grins. “Today.”\n“Good luck,” Sapnap says.\n“Awe. Thank you.”\n“Of course,” Sapnap gives a small nod. There’s a few seconds where they just go back to doing the dishes. Tubbo puts the plate away and moves on to drying a cup, but he suddenly feels water being flicked into his face.\n“Hey!” he screeches, smacking Sapnap with the kitchen towel in his hands. Sapnap just laughs.\n...\nThey bring everyone to the recording studio under the pretense of Wilbur needing to get some short voice recordings of them all for  his next song. He’s apparently going to alter their voices so they sound like instruments. Wilbur’s next song doesn’t actually exist, but the others take the bait. \nThis. This is Part Three of the plan. \n“Alright, I want to get Tommy and Tubbo’s voices first,” Wilbur says, leading them into the live room (where all of the microphones and instruments are), leaving the others in the control room (where the mixing equipment is). \nTubbo can only imagine what the others’ faces must look like when Ranboo suddenly enters the live room from a separate door. He’s too busy hugging him -  finally - to look. He checks afterwards, though. They all seem very confused, but Wilbur is blocking them from opening the door into the live room.\nTubbo sees the exact moment that Sapnap notices the streaming equipment. Sapnap gets this huge grin on his face and takes a step away from the window, leaving more room for the others to look into the room.\nThe Multiplayers grab their instruments. The stream has been gathering viewers for a few minutes now. Tommy started it, using the simple “Starting Soon” screen in comic sans that Ranboo made, like, yesterday. Wilbur takes hold of his guitar. The stream is titled “Live Concert Before EP Release” which they all know is an absurdly bland title. They’ve recruited Phil to change it to “New Song ft. Wilbur Soot” once they actually start playing.\nSomeone knocks on the glass and Tubbo looks up from where he’s making sure his keyboard settings are in place to see Karl holding his phone up so they can see it. He’s got their The Multiplayers stream pulled up, looking at them all questioningly. Ranboo holds a finger up to his mouth to tell Karl to ‘shh’. Karl, eyes wide at the revelation, turns the phone off and puts it into his back pocket, not letting any of the friends beside him know what he’s just discovered. \nRanboo takes off his mask, glasses, and gloves. They’ll impede his singing and playing if he leaves them on. They did some rehearsals in which he wore them and things didn’t work out. He’ll put them back on again just before they turn on the camera. He doesn’t mind his streamer friends seeing his face, though. A lot of them have already seen it, actually. \nTubbo hits a button, making the “Starting Soon” sign leave the stream. Their viewers are left with a simple black screen, since the camera is still off. \nThey turn on their microphones.\n \nRanboo starts playing first. Then Tubbo hits a button on his synth and Ranboo’s pre-recorded electric guitar part begins playing, alongside Wilbur on an acoustic. Tommy comes in next with a quick drum beat. Finally, Tubbo sets his hands down on his keyboard and plays. \nAnd then he sings.\n \n[Verse 1 - Tubbo]\nRight along beside you\nI can help you fight the monsters.\nBut only if you let me join the game.\nRight along beside you\nI can help put out your fires\nAnd I’ll try my best to ease all of your pain. \n \nThe song is sort of… intense. Not in the actual instrumentation, but the- the  emotions.  The feelings you get when you hear it, the feelings Tubbo gets when he sings it. It’s a song from the heart and it’s probably not the  bang  that anybody was expecting from the long-awaited The Multiplayers face reveal but it’s… it’s  real.  \n \n[Pre-Chorus - Tubbo] \nBut I can’t help you,\nAlthough I want to,\nUnless you let me\nUnless you add me to the game.\n \nRanboo and Tommy join him for parts of the chorus.\n \n[Chorus - Tubbo, The Multiplayers]\nWill you play the game alone?\nOr will you let me be there too?\nAm I allowed to build you up\nWith blocks right to\nThe sky above? \nOr will you keep playing \nA multiplayer game\nIn singleplayer?    \n \nWilbur takes the second verse, save for the last line, sung by Tommy. It gives Tubbo the chance to look through the glass into the control room. Jack and Sapnap have gravitated toward each other, knowing that they both already know what’s going on. Karl seems to have noticed their knowing looks because he’s slowly inching towards them as well, all the while not taking his eyes off of The Multiplayers. \nDream, George, and Quackity all look very impressed and  very confused. \nPhil looks proud. \n \n[Verse 2 -  Wilbur, Tommy]\nYou’re here right beside me\nSwinging swords against my enemies\nAnd I badly, badly, want to let you in\nYou’re right here beside me\nTaking shots at thoughts that bury me\nOh, I wish to god that you would let me in\n \n[Pre-Chorus - Tubbo] \nBut I can’t help you,\nAlthough I want to,\nUnless you let me\nUnless you add me to the game.\n \n[Chorus - Tubbo, The Multiplayers]\nWill you play the game alone?\nOr will you let me be there too?\nAm I allowed to build you up\nWith blocks right to\nThe sky above? \nOr will you keep playing \nA multiplayer game\nIn singleplayer?    \n \nTubbo likes the bridge. Their playing grows more frantic and their singing becomes quicker and quicker, almost  desperate in tone. It’s a sort of overlapping ping-pong between their lines and Wilbur’s. \n \n[Bridge - Tubbo,  Wilbur,  The Multiplayers]\nPlease let me in.\nI can’t let you in.\nI know we can win\nWe’ll never win\nPlease let us in\nWe’ll never win\nLet us join the game\nIt’ll end in pain\nInvite us in\nI won’t invite you in\nLet us help you win\nI can’t let you in\nFine! \n \nThe music cuts out. For a moment, it’s like nobody breaths. Then Tubbo sings one line, completely alone:\n \n\"Don’t let us in.\"\n \nIn a broken whisper, Wilbur replies:\n \n\n\"Wait… no.\"\n\n \nThe music slowly begins to fade back in, starting with keyboard, then guitars and bass, then finally drums, all growing louder and louder and faster and faster before finally going back to normal as Wilbur starts up the third verse.\n \n[Verse 3 -  Wilbur ]\nStanding here beside you\nI think I’m finally understanding\nYou’re not trying to take the controller from my hands.\nStanding here beside you\nI can see it all so clearly now\nAnd I’d like to give this new gamemode a chance.\n \nThe final chorus is grand, but also… intimate, in a way. It feels… right. Tubbo has no other way to describe it. It feels right. \n \n[Chorus - The Multiplayers, Wilbur, The Multiplayers+Wilbur]\nSo you won’t play the game alone?\nAnd you’ll let us be there too?\nAnd we’re allowed to build you up\nWith blocks right to\nThe sky above? \nOr will you keep playing-\nI’ll never again play \n\n A multiplayer game\n\n\nIn singleplayer. \n\n\n \nRanboo puts on his disguise.\nTommy runs a shaky hand through his hair.\nWilbur steps out of frame.\nTubbo turns on the camera. \nThe second he sees Ranboo walk into the room, Karl knows. Or, he thinks he knows. He’s pretty sure he’s right. And then they start grabbing instruments and his theory is all but confirmed.  Only, there’s  no way, right? \nBut the “Bang!” video. Even disregarding the colours of the Players that correspond with his friends’ respective brands, the Multiplayers are supposed to reveal their identities today (not that they ever specified what time they’d be doing it). This all looks a lot like a big reveal set up. \nSo, Karl opens Twitch on his phone. He’d gone and followed The Multiplayers just seconds after watching their “Bang!” music video (has had nearly a million other people) so he immediately sees that they’re live. \nKarl opens the stream. The comic sans “Starting Soon” screen reminds him of Ranboo.\nSubtly, he knocks on the glass in front of him and shows his phone screen to the- the  band  on the other side. Ranboo nods and shushes him. Karl can practically  see the smirk from underneath the mask and glasses. \nKarl has no idea what to do with the confirmation that Tommy, Tubbo, and Ranboo really  are The Multiplayers. A hell of a lot of things make so much more sense, in hindsight, from the weird way Ranboo and Tubbo had acted during Karl’s karaoke streams to Tubbo being totally evasive when Karl and Sapnap had been worried about him.\nOh! Sapnap! The day after they had both confronted Tubbo, Sapnap had just stopped worrying. Tubbo must have told him.\n“What the fuck is going on?” Dream blurts. Karl just shrugs, acting just as confused as Dream is. Ranboo had shushed him, but even if he hadn’t, Karl is excited to see the looks on the others’ faces when they inevitably realize what’s happening. \nThen finally, the Multiplayers start playing.\nKarls  friends start playing. \nKarl has been a fan for a long time. He’s always known how good The Multiplayers are, but seeing them in person,  knowing who they are? It’s mind-blowing. \n...\nRanboo is here? And he’s playing a song with Tommy and Tubbo and Wilbur? What the fuck?\nDream is confused. Like, really fucking confused. They’re good - spectacular, actually - don’t get him wrong, but like, why is this happening? When did Ranboo even get here? Since when could they all play instruments so well (excluding Wilbur, obviously)? He knows that Tommy and Tubbo have both talked about playing piano, and Tubbo plays the ukulele, but this on  another level.  \nThe song ends. Tubbo and Tommy start talking to the camera - wait, there’s a camera? - but Dream is more focused on the people around him. Phil, Sapnap, and Jack start clapping. Karl sort of does, too, but he looks a little bit stunned. \nDream gets startled by Quackity’s whoops and cheers. Quackity doesn’t seem confused at all, just excited. Thankfully, Dream meets eyes with an equally bewildered George. They share a silent “what the fuck?” with their eyes but it gets cut off by Quackity throwing his arms around both of their shoulders and pulling them together. Dream sees George nearly lose his footing. \n“We should have seen this coming!” Quackity says enthusiastically. \n“What?” George asks, genuinely confused.\n“That they formed a band?” Dream asks. How could they have possibly seen this coming? \n“Yes!” Quackity grins. \n“Right?” Karl joins the conversation. “I mean, looking back on it, it makes total sense that they’re The Multiplayers.” \nDream freezes, eyes going wide. “They’re the  what?!”  \nThe room goes silent.\n“Uh, mate,” Phil breaks the tension, “you didn’t realize?”\n“No!” Dream says, defensive, “How could I have possibly realized?”\n“Their colours?” Karl offers.\n“Their general shadiness?” Sapnap adds.\n“Tubbo willingly flirting with someone other than Ranboo?” Jack points out.\n“It was in front of our eyes the entire time!” Quackity exclaims.\n“Oh,” Dream gasps. “Shit.”\n“Wait,” George says, a smile spreading across his face, “The Multiplayers collab is with  Wilbur?”  \n...\nTechnoblade sees the exact second that The Multiplayers go live. He may or may not have been lurking in their offline chat all day. \nHe’s a fan, not that he’ll ever admit it. Their music is really good. Even their covers. And the metaphors! There are so many hidden messages in  all of their songs. As much as he wishes that Tommy wasn’t so (purposefully) obtuse about it, Techno does appreciate that Tommy’s ignorance of the topic gives him the opportunity to talk about and vocally analyze the songs. \nThe “Starting Soon” leaves and the screen goes totally dark. The new song starts. They aren’t even through the entire first verse when Techno decides that this is one of his favourite songs by The Multiplayers. \nThe song is the only reason that he’s here, so he’s really happy that it’s so good. He really doesn’t give a shit about what the band might look like. He understands the pressure of a face reveal. So, yeah, he doesn’t give a shit. \nOnly, when the song ends and a few seconds later the camera turns on, Technoblade decides he gives  several shits. \n“What the fuck?” He whispers to himself. “What the fuck?”\nOh, he’s gonna throttle that fucking child.\n“Hi!” Tubbo says on camera, waving at the screen with a big but nervous smile on his face.\n“Hello boys!” Tommy says in his signature ‘starting stream’ voice.\n“Hey guys,” Ranboo waves a gloved hand.\nTechno is gonna throttle three fucking children. Jesus fuck.\nThe three Players - these three fuckheads are  The Multiplayers - go around introducing themselves, since there are definitely fans out there that won’t know who they are as Minecraft streamers. \nMeanwhile, Technoblade books a plane ticket.\nIt only hits him after he’s done packing a suitcase that it was  Wilbur  singing with them.  Wilbur is the collaboration on their EP.\nWilbur Soot was  in on it. \nMotherfucker. \n...\nHOLY WHAT NOW?? | @WilteredHoly shit??? I was right???\nMaya Dean | @M_ayaDeanHuh? What did i miss\nHOLY WHAT NOW?? | @Wiltered|(face reveal - clip)\nMaya Dean | @M_ayaDeanoh my god\n \nTara | @Tara_KI’m sorry, could somebody explain why everyone is talking about Minecraft in relation to The Multiplayers? I was at work during the stream /gen\nYep | @Hen118Sure! All three players are popular mcyts (Minecraft Youtubers) and Twitch streamers. They are all a part of the Dream SMP//\nYep | @Hen118Player One:  https://www.twitch.tv/tubboPlayer Two:  https://www.twitch.tv/ranboolive  Player Three:  https://www.twitch.tv/tommyinnit  \nTara | @Tara_KThank you! I’ll have to check them out!!\n \nElectra | @electra_nicsTommy can play drums? Get ready for art y’all omg\n \nLara Claren | @LarcRanboo is Player Two??? This is the best day of my life\n \nTubbo is Player One (Green Cat) | @wotlen My favourite streamer is in my favourite band?? Guys i’m crying /pos\nKath | @WOOoo_Green do you realize what this means?\nTubbo is Player One (Green Cat) | @wotlenWhat? What? Kath you can’t leave me in suspense!!!!\nKath | @WOOoo_Tubbo was feuding and then flirting with himself\nTubbo is Player One (Green Cat) | @wotlenOh SHIT\n \nCurrently Losing It | @TamFoxOh god, now mcyttwt is gonna take over The Multiplayers fandom\nCongrats it’s a demigod | @Steph47Tam you’re literally part of benchtwt?\nCurrently Losing It | @TamFoxOh fuck oh fuck /j /j i meant /j\n \nI guess | @LoveTheMultiplayersWilbur is the collab? this is not a drill Wilbur is the collab-\n \nNick Halden | @NotCaffreyReminder that the reason @TheMultiplayers kept their identities secret was so they could make music and get known for it without their established fanbases. It’s both okay to like them even if you don’t know them for anything but their music //\nNick Halden | @NotCaffreyand if you already liked them as streamers but we should respect their wishes to keep streaming/youtube/minecraft separate from their music\nNick Halden | @NotCaffreyHere’s a clip of them talking about it in case you missed it(boundaries - clip)\n \nErik | @ranboobooGood morning! What did I miss?\nMaya Dean | @M_ayaDeanRanboo plays bass!!! Adhauewhsgoijk\nErik | @ranboobooI just scrolled through my tl… oh my god?\n \nProbably a Fan | @Tabitha_Riley Everyone’s over here like “oh my god the multiplayers are minecrafters” or whatever and i’m here like “that song was fucking amazing??”\nProbably a Fan | @Tabitha_Riley Don’t worry i love you mcyttwt (is that what you’re called what does that even mean)\n \nElectra | @electra_nicsGuys, Tommy wrote Masked and pretended not to know anything about it to mess with technoblade…\n \nSarah Jean | @jeansssAbout @TheMultiplayers : I have no idea who these people are outside of being Players 1-3. Should I start watching their streams? How hard would it be to catch up on the “dsmp lore” or whatever you call it?\nCurrently Losing It | @TamFoxOh god it would take years to catch up\nErik | @ranboobooDefinitely watch their streams! \n \nKara and Spencer | @ChattingWithKSStill can’t believe that some of the theories about @TheMultiplayers were true! Congrats by the way you three (and Wilbur), love the new song!\n \nLee | @ThyCrayonThe minors are The Multiplayers! And they streamed their face reveal?? I love this timeline holy fuck\n \nDSMP Updates | @updating_dsmp@tommyinnit @TubboLive @Ranboosaysstuff are the well known band @TheMultiplayers (open thread for clip)\nJessika | @PavaI thought this was a joke but it’s real? Next you’re gonna tell me that Miss Keledones is Drista or something omg"
}