{
    "id": "30278670",
    "url": "https://archiveofourown.org/works/30278670?view_full_work=true",
    "author": [
        "Bergen"
    ],
    "title": "All good things come in threes",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "Marvel Cinematic Universe",
        "Spider-Man (Tom Holland Movies)"
    ],
    "relationships": [
        "Michelle Jones/Peter Parker",
        "Peter Parker & Tony Stark"
    ],
    "characters": [
        "Peter Parker",
        "Tony Stark",
        "May Parker (Spider-Man)",
        "Michelle Jones"
    ],
    "additional_tags": [
        "Secret Identity",
        "Identity Reveal",
        "Tony Stark Has A Heart",
        "Anxiety Attacks",
        "Humor",
        "Light-Hearted"
    ],
    "language": "English",
    "series": "",
    "published": "2021-03-26",
    "completed": "2021-04-04",
    "words": "27,550",
    "chapters": "3/3",
    "comments": "503",
    "kudos": "15,456",
    "bookmarks": "4,118",
    "hits": "127,944",
    "summary": "<p>“I know all about your secret identity.”<br>A beat of silence. “Um,” Peter said, bunching his sweater in his hands. “Which… which one?”<br>--<br>Peter has three secret identities: Spider-Man, the superhero who swings around the city to save people. Parker Benjamin, who gives Tony Stark unsolicited advice on his research. And NightMonkey, the Instagrammer who keeps uploading increasingly popular but embarrassing drawings of Iron Man.<br>And he can juggle them all just fine, thankyouverymuch.</p>",
    "notes": "<p>Read the fancomic <a href=\"https://www.fanon.co/fanfics/0012\" rel=\"nofollow\">here</a></p>\n<p>warning: chapter contains anxiety/panic attack</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>Thank you for reading 💖 Have a great day!</p>",
    "text": "\nPart I: NightMonkey \n\n \nThe top three best moments of Peter life were, in no particular order: his first camping trip with May and Ben; his first time kissing MJ, during a detention; and the first time Clint Barton reposted the drawing he uploaded on Instagram.\nThe last two happened on the same day. In fact, Peter received the notification while he was still gazing sappily into MJ’s eyes, his lips tingling. She was staring back at him with an expression akin to amusement. “You still with us?”\n“Your lips are really soft,” Peter said, before instantly flushing with embarrassment. “I mean… Yeah, that was cool.”\n“… the most important meal of the day,” Captain America’s PSA prattled on in the background. Coach Wilson was sleeping in his chair.\nPeter glanced down at his phone to see who had rudely interrupted his unexpected detention-make-out-session with MJ by messaging him. “Oh my god,” he breathed, gripping the phone tighter. “Oh God – Ned says Hawkeye just reposted my drawing on Instagram!”\nMJ was not that easily impressed. “Probably someone pretending to be Hawkeye.”\n“Um, no,” Peter said, already scrolling through the app. “The profile name is ReallyRealHawkeye.”\n“Right. Because that sounds legit.”\n“MJ, I’ve been following these people online for years. YEARS. I know which profiles are real! And he… oh shit, he reposted that drawing? That one was kinda mean, though.”\n“Oh, the one with Iron Man ironing his clothes?” MJ immediately guessed.\nPeter gave a nod. He and MJ had bonded over their mutual interest in ridiculing people through drawings. While MJ favored a more artsy style, making black and white portraits of people in crisis, Peter’s preferred way of expressing himself – and pissing people off – was by making colorful, four panel comic strips. Over the last few months, the Avengers had become his favorite victims. He uploaded his drawings on Instagram under his username ‘NightMonkey’, and some of them had gotten a pretty good response.\nHe remembered the way he had cackled evilly while drawing this particular one: Iron Man ironing in his Iron Man suit – but without the helmet – when his phone rings and, in a temporary lapse of judgement, Tony Stark lifts the iron to his ear instead of his phone. The results are self-explanatory.\n“If Hawkeye reposted my drawing, do you think Tony Stark will see it?” he wondered out loud. “Do you think he’ll be offended?”\n“I’m offended. Thirty seconds ago we were making out,” MJ pointed out. “Just mentioning it. Since you seem to have forgotten already. This is not how I imagined our first kiss.”\n“Sorry,” Peter said, hastily shoving his phone away. Because, yeah, kissing MJ really should take precedence over anything short of apocalyptic events. “So you… you’ve been imagining this moment, then?”\nMJ looked a little caught out. She didn’t like to be accused of having any emotions, let alone the particularly sentimental ones.\n“So are we…” Peter licked his dry lips. “Um – are we, like, boyfriend girlfriend now?”\n“Yes,” MJ said, “as long as it’s clear that I won’t make fun of you any less. And that I don’t need you carrying stuff around for me like I’m some incapable damsel. And no kissing in public; we’re not a roadshow.”\n“Would you maybe like to write up a contract?”\n“Don’t push your luck, because I just might,” she warned. “And I will make sure to get custody of Ned if we break up.”\nPeter leaned his head down on the desk, without breaking eye contact with her. “Could I get him on weekends and every other Christmas?”\nShe gave him a benevolent smile and reached out to push a strand of his hair out of his eyes. “I like that you’re not weirded out when I make strange, awkward jokes,” she confessed, which was probably as close to an ‘I have a massive crush on you’  as you could get from MJ. Peter grinned.\n“Let’s get out of here,” MJ said.\nPeter blinked. He had gotten a detention for being late for two days in a row – something May already wouldn’t be thrilled about. “You should be preparing my eulogy if you let me skip detention, because my aunt will actually kill me.”\n“Hm,” she said. “How about I go and get us both some milkshakes. I’ll be back by the time your prison sentence is up, and we can go to the park or something.”\n“What if Wilson wakes up? Won’t you get into trouble?”\n“I don’t actually have detention,” she revealed. “I just came to see you in crisis.”\nOf freaking course. “Okay then,” he said with a soft smile. “See you later.”\nHe waited for MJ to leave, then grabbed his phone to scour the internet for gossip about Tony Stark.\nIf Hawkeye liked comics that made Stark look like an idiot, then Peter would certainly oblige.\n-\nThe NightMonkey might have a bit of a mean streak, but Peter Parker always made a point of being kind.\nThe café where he worked every Saturday had many regular customers, and Peter knew them all by name. Including the homeless people who came by from time to time because they knew Peter would serve them free coffee and sometimes throw in a donut.\nPeter always made sure to have a little chat with them, treat them as a human beings instead of giving them a wide berth like most people tended to do.\nDon, the owner, definitely wouldn’t be thrilled to learn that Peter was giving away food on a regular basis. But hey, he always hid away in the back, letting Peter do all the work and only occasionally coming out to point out everything Peter was doing wrong. He paid only half the minimum wage and he always, always made Peter work late because the sonnuvabitch knew how much Peter needed this job to support May.\nSo yeah, Peter was giving away donuts and even throwing in some extra chocolate sauce whenever he felt like it. Sue him.\nToday’s homeless guy was one Peter hadn’t seen before. But that wasn’t unusual. Sometimes people had heard through the grapevine that they could come here for free coffee. And sometimes they just wandered in by chance, hoping to be able to get a little warm inside before getting chased out again. This one looked like he fell into the latter category: he didn’t seem to expect to be offered anything. He just sat in a corner booth, his back towards Peter, hunched over, trying valiantly to look invisible. He had a large coat, the hood pulled forward as far as possible, and stained jeans.\nPeter poured a cup of coffee and eyed the selection of donuts for a while. This man definitely looked like a banana-cinnamon sort of guy.\nWhen he approached the man, he thought he actually heard something akin to a low growl in the back of the guy’s throat. He was probably expecting to get thrown out into the cold.\nPoor dude.\n“Would you like some coffee?” Peter asked lightly as he set the tray down. “And a donut? It’s on the house.”\nIt stayed quiet for a moment. “You’re giving me a donut,” the man then repeated, a little hoarsely. “Why?”\nIt wasn’t unusual for homeless people to be suspicious when Peter gave them free food. “There’s no strings attached,” he gently explained. “You just look like you had a rough day. And it’s pretty cold out. Don’t worry, you can stay as long as you want. But if the owner comes in and just sees you sitting here, he’ll chase you out. So best pretend that you paid for this, okay?”\n“Do you… Do you think I’m homeless?” The man asked, a strange edge to his voice, and Peter suddenly felt his stomach drop. Oh damn, did he just insult some random New Yorker, in full possession of a roof over his head? He didn’t usually make that mistake. With his luck, the guy was probably someone important like a state judge, or a politician, or…\nThe man sat up straighter, letting his hood fall back and tugging his scarf down and oh God. Peter absolutely froze, wishing a hole would open up in the middle of the café and swallow him whole.\n“I didn’t think I looked that horrible,” Tony Stark said. “I mean, granted, I got my workshop-jeans on, but I’m wearing my expensive shoes for chrissake.”\n“Oh god,” Peter managed. “Oh my god, Sir, I’m so sorry. I’m so… Gah, I’m an idiot. And you… You have very nice shoes, of course you do, very nice. I just don’t know anything about fashion I’m… I’m an idiot, oh my God-“\n“All right,” Mr. Stark cut in. “As entertaining as it is so watch you unravel, allow me to put you out of your misery. Not offended, here. In fact, I’m guilty of prejudice, too. When you came up, I figured you were some fanboy angling for an autograph. Instead, you were feeding the homeless.” He grinned as he plucked up the donut with two fingers. “You don’t need to feel bad for being kind. And I did in fact have a rough day.”\n“Sir, if I’d known it was you I probably would have angled for an autograph,” Peter said earnestly. “Well, maybe I wouldn’t, because I don’t want to bother the customers, but I'd definitely quietly hope that you would spit into a napkin and leave it behind so I would get to keep it.”\n“That’s disturbing,” Mr. Stark said. But he was still smiling, so Peter figured it was okay.\n“So did you want to order something then, sir?”\n“No, this looks perfect, actually,” the man replied, waving his hand at the cup of coffee. “And don’t worry. I’ll pay for it.” He pulled his hood back up to hide his face.\nPeter nodded and retreated back to the counter where a lady was waiting to order, resisting the urge to bow a few more times in Tony Stark’s direction as he went.\nHoly shit, the Tony Stark was casually eating a donut in his café. Peter would totally use it as the topic of his next cartoon-drawing, except that went against his principles not to aggravate the costumers. Tony Stark was… well… he was Tony Stark. But in here, he was just another customer and it was Peter’s job to make sure he had a positive experience.\nThat was what he loved about working in this café. He enjoyed taking care of people.\nA sweaty, bald man clutching a large camera stepped into the café and immediately shuffled up to the counter. “Haven’t seen Tony Stark running past here by any chance, have you?” he asked, half-jokingly.\n“Oh – yeah I did,” Peter said as he gathered three teacups together on a tray. “Went that way.” He pointed randomly.\nThe photographer swore under his breath and ran back out the door so fast he almost bum-rushed two elderly ladies who were about to enter.\n“Oh my,” one of them said, stumbling, and Peter quickly left his tray behind to rush to her aid. “Hello Mrs. Albasiny, Mrs. Zellerbach,” he greeted, extending an arm. “Let me give you a hand. Booth by the window for you ladies?” He glanced towards the empty booth next to Mr. Stark. The man probably wouldn’t mind two adorable old ladies at the next table.\nMrs. Albasiny clutched his arm like it was her lifeline. “The world moves faster every day,” she complained. “They ought to put handrails all over the place. I’d walk from my apartment to this café without ever having to let go.”\n“Well, the doctor did say you shouldn’t go out without your walking stick, Edna,” Mrs. Zellerbach chided.\n“That doctor told me five years ago that I had four months to live. I don’t trust a single word that comes out of his mouth. I wouldn’t trust him to locate his own asshole, let alone mine!”\n“We’re all so happy that you’re still with us,” Peter said, his voice only slightly teasing, as he delivered the ladies to their booth and helped Mrs. Albasiny sit down.\n“You’re such a sweet darling boy, Peter,” she said, reaching up to pinch his cheek.\nPeter didn’t usually mind when she did that, but right now he could feel Tony Stark’s eyes burning into his back. “Thank you Mrs. Albasiny,” he said meekly. “A chai tea and a cappuccino, as usual?”\nThe ladies also ordered a piece of cheesecake to share between the two of them, and Peter once again hastily retreated to the counter.\nHe was about to step into the back to grab some clean napkins when he bumped into Don, who poked his head through the doorway. The man threw a disinterested glance around his café, before that glance finally settled on Peter. “I’m going home,” Don informed him. “Make sure you turn off all the lights when you leave, because you missed the one by the backdoor last week.”\nPeter bit the inside of his cheek for a moment. “Yes, sir,” he then said. It was over an hour before closing time, but Don had taken up the habit of leaving earlier and earlier each week, leaving Peter in charge. Part of Peter knew that that shit really wasn’t acceptable. Another part of him, though, was happy to have the café to himself for a few hours. It was not as if Don did any work when he was here, anyways.\nTime ticked by. Costumers entered, customers left. Tony Stark remained unmoving, quietly sitting in the corner booth, making little drawings on the napkins. When Peter approached him to ask if he needed anything else he just shook his head.\nMrs. Albasiny and Mrs. Zellerbach were the last customers to leave, with lots of pinching of cheeks and clucking of tongues.\nPeter let the door fall shut behind them and turned the sign to ‘closed’. He saw how Mr. Stark half-turned in the booth, looking his way but not asking anything. He still looked haggard.\n“You don’t have to go yet,” Peter offered. “I’ve put up the ‘closed’ sign, but still have to clean the whole place, so you can stay until I have to leave.”\n“Thank you,” Mr. Stark said. “I’m just waiting for someone to pick me up. He won’t be long, but it would be helpful if I can wait inside.”\nPeter just nodded and set to work. He finished the paperwork and moved the food into the fridge, and then began mopping the floors. When he had worked his way over to where Mr. Stark was still sitting, the man spoke up again. “Are you-…? You can’t be the only one working here.”\nPeter shrugged in a way that he hoped looked nonchalant. “The owner left early.”\n“Huh,” said Mr. Stark.\nPeter leaned down to check whether any assholes had stuck gum underneath the tables. When he found none, he rightened himself and glanced back at Mr. Stark who was still following all his movements with a detached expression, as if Peter was a mildly interesting television show. “My decathlon team is visiting your expo in Manhattan next week,” Peter offered.\n“What day?”\n“Um – Wednesday.”\nMr. Stark nodded. “I might be there.”\n“That would be cool,” Peter earnestly said. He picked up the bucket and carried it to the back where he emptied it into the sink. He loaded the dishwasher. When he stepped back into the café, it was suddenly strangely deserted. Tony Stark had left. Through the windows, Peter just saw the tail lights of a car.\nHe moved to the corner booth to clean it and gathered some of the napkins, glancing down at Tony Stark’s abstract drawings. Huh, the man was certainly no slouch as an artist. Who’d have thought Tony Stark had a secret talent like this?\nHe found a short message written on one of the napkins.\nThanks for the kindness, Peter. Sorry, I didn’t spit in it. But maybe an autograph will do? It was signed Tony Stark, and folded into it was a crisp fifty dollar bill.\nPeter actually felt tears burn behind his eyes. Jeez, he was about to start bawling in the middle of a café, as if he were Halle Berry winning her Oscar. He wasn’t sure if it was for the money, which more than doubled his salary for the day, or for the personal message. Probably both, he decided, before carefully tucking everything away into an inner pocket.\nOnly when he came home that evening did he see the news from earlier that day: Tony Stark had been followed around the city by a stampede of paparazzi photographers. He had driven his car into a lamppost in his attempts to get away from them, before ditching the car, taking off running, and disappearing down an alleyway. That’s how he must have ended up hiding away at the café.\nPoor guy.\nPeter should definitely make a comic strip about it.\n                                                                      \n\nPart II: Parker Benjamin \n\n \n“I made pasta Arrabiata; it’s in the fridge.”\nMay nodded gratefully, disappearing for a moment into the bedroom before reemerging with a clean t-shirt on. She made a beeline for the fridge and took out the bowl Peter had left for her there. She grabbed a fork a started poking at the food, shuffling closer to Peter and glancing at all the papers he had laid out on the coffee table in front of him. “Still doing homework?”\n“No – and did you know we have a microwave?”\n“I’ve recently discovered that I like my pasta cold.” She moved around the table to sit sideways on the couch, glancing down at his notes. “What are you doing, then?”\n“Tony Stark is researching solar distillation and he just published a new design of a solar still on his website, that has a flat plate collector and uses thermosyphon mode which gives a ten percent higher yield. But I figured, if you can somehow harness the heat loss and use it for further distillation, the overall efficiency is even higher!”\n“I have concussed patients who talk less gibberish than you,” May said, before forking a large bite of pasta into her mouth.\n“Gibberish, hah! I’m just trying to figure out the calculations so I can send them to him. Do you think he’ll read them? And Spider-Man stopped a mugging last night. Oh, and NightMonkey gained so many followers since that one comic went viral, it’s insane.”\n“Um-hm,” said May. “And what about Peter Parker; did he brush his teeth and finish his homework?”\n“May!”\nHer gaze turned stern. “Answer me.”\n“I did. I even finished the book report that’s not even due for another week.”\nShe smiled now, reached out and squeezed his arm. “Oh, well done, honey. I’m proud.”\n“Really. That gets a compliment?”\nShe shrugged and turned her full attention to her food. People who accused Peter of eating too much had never seen May fork down a meal after a double shift at the hospital. She probably didn’t even like her pasta cold; just wanted to get it all in her mouth as quickly as possible.\n“Any weird injuries today?” Peter asked once she had finished and set the bowl down with a sigh.\n“Had a little boy who stuck a bean up his nose, weeks ago,” she said. “And the thing had started sprouting in there. Nice and moist, of course. He needed surgery to have it removed.”\nPeter shuddered. “Oh god. Remember when I pushed a piece of clay up my nose? I couldn’t get it out and panicked. But uncle Ben just made me blow my nose and it came right out. I was glad then that I told him, even though he mercilessly made fun of me for about three months.”\n“Yes, well, twelve is far too old to still be getting things stuck up your nose,” May pointed out.\n“I’m a scientific soul, May. I needed measurement-based testing and practical experiments.”\n“Uh-hm. And the hypothesis you were researching when you pushed that clay up your nose was…?”\n“I’m not sure anymore, but there is something interesting about beans being able to sprout inside a human’s nose, wouldn’t you say?”\n“I don’t know, Doogie Howser,” May said. “Why don’t you discuss it with your pen-pal Tony Stark?”\nPeter pushed his face into a pillow to muffle his dramatic, high-pitched scream. May chuckled and Peter felt her fingers poking the side of his leg. “Peter, I’m teasing. I just think it’s funny how much your life revolves around Iron Man.”\nPeter lifted his head and clenched the pillow to his chest. “It does not,” he sputtered. “It’s not my fault that the guy keeps turning up everywhere. If anything, his life revolves around me. And these are all just entirely coincidental interactions and definitely not something that could end up getting me arrested by SHIELD for being a creepy stalker.”\nMay inhaled sharply through her nose, clearly trying to hold back laughter. “I’m sure Tony Stark will be nothing but delighted to discover that the same kid who mistook him for a homeless guy last weekend, has now taken an interest in his research.”\nWell, that was the thing.\nPeter had sort of decided he would not be emailing Tony Stark under his own name. He hadn’t planned being secretive, but now that he had met Tony Stark in real life, it seemed weird to use his real name. He didn’t want Mr. Stark to actually think that Peter was some creepy stalker. He had settled on the pseudonym ‘Parker Benjamin’, and had already made a separate email account to match it. Now he just needed to remember to check it regularly for a response.\nOr maybe he was crazy to think that he might get a response.\n-\nParker Benjamin might be a genius, but Peter Parker could be embarrassingly dumb.\nHe’d been confronted with his own stupidity plenty of times, already. Having MJ as his girlfriend didn’t help there, because she was more than glad to point out when he was being a blathering idiot.\n“No, Peter,” she would say. “People don’t swallow spiders in their sleep. That’s an urban myth. Stop panicking. And don’t put duct tape on your mouth at night, you blathering idiot.”\nPeter trusted her, but he still tried to breathe through his nose every night when he went to sleep.\nBut all that was nothing compared to his most impressively embarrassing moment, which occurred during his visit to the Stark Expo, with his whole decathlon team there to see it.\nHe had overslept and skipped breakfast – even though he knew how much that tended to throw his whole body out of whack – to be at school in time. And then Ned had convinced him to sit in the far back of the bus, where every bump felt like getting launched by a catapult, and fed him an endless supply of marshmallows. Peter had initially readily accepted them, glad to have something to fill up his empty stomach. But about halfway through the drive, he had felt those same marshmallows try to crawl back up his throat at every sharp turn the bus driver made; like they had united forces and formed one giant marshmallow and wanted to break out from whichever entrance they found first. \nAnd now he was walking around the expo with nausea rolling heavily in his gut. The tour guide was enthusiastic and everything on display was equally amazing, but Peter barely registered what he was seeing – too focused on breathing calmly and steadily to keep from throwing up.\nThey were moving from the ‘green energy market’ to the building where the keynote speech would be held, and Peter officially wanted to give up. He was glancing around for a toilet he could escape to and spend the rest of the day, when he almost bumped into Ned, only now noticing that everyone else was standing stock-still and a tense hush had descended over their group.\n“Enjoying the tour?” a voice spoke up; one that Peter recognized immediately .\nHe turned, blinking through a haze of please don’t throw up and could barely make out Tony Stark standing only a few feet away from him. He wasn’t addressing Peter specifically, though, his gaze encompassing the whole team, a benevolent smile on his face.\nHe clearly didn’t even remember Peter. But that was okay. Peter wouldn’t have wanted to draw attention to himself when he was already so busy valiantly fighting down a wave of nausea.\nThe two security guards who were flanking Mr. Stark paused, hesitating, and exchanged a glance that clearly said ‘Is Stark actually going to bother with this group of smelly teenagers?’\n“This is the decathlon team from Midtown Tech, Mr. Stark,” the tour guide said brightly. “We were just on our way to your speech. Well. So are you, clearly.”\nNed’s hand shot into the air so fast he almost knocked Mr. Harrington’s glasses off. Mr. Stark’s gaze drifted in his direction. “We have a Q&amp;A after the speech, kid. But I like the enthusiasm. What’s so important?”\n“Mr. Stark,” Ned said, a little breathless. “Did you see that comic from NightMonkey that went viral?”\nTony Stark’s left eye twitched.\n“…where you accidentally burn your own ear off?” Ned continued, either not realizing or not caring that Peter was purposefully stepping all over his toes to stop him talking.\n“No idea what you’re talking about,” Mr. Stark said smoothly. “And for the record – I don’t iron my own clothes. Some of us have better things to do.” He turned away from Ned to another kid who had raised her hand.\n“Dude, he totally saw your comic!” Ned breathed at Peter.\nStepping on toes was too subtle, apparently. Peter opted for a swift kick at Ned’s ankle. Anything to keep the other boy from outing him as NightMonkey right in front of Tony Stark when he already felt ready to faint.\n“Ouch - Why are you kicking me so much?” Ned whispered. “Do you want another marshmallow?”\nPeter whirled away from him and promptly threw up... all over Tony Stark’s shoes.\nGroans and exclamations of disgust filled the air as Peter stumbled back, horrified, his vertigo hitting him only harder. He could feel he was only minutes away from throwing up again and needed to get out of here fast.\nHe could feel arms catching him – whether it was Ned or Mr. Harrison he didn’t even know – and quickly leading him away from the group.\nThe restroom was probably only a minute away, but it felt like the damn thing was somewhere on top of mount Everest. They finally reached the blessed relief of a cold, marble toilet bowl and Peter threw up again, recoiling at the disgusting sight of half-digested marshmallows floating around in the toilet bowl. This second round did instantly make him feel better, though. He breathed out in relief as he felt his heartbeat return to a more normal rhythm. He took off his backpack and kicked it away, then reached out and flushed the toilet, wiping some sweat of his brow. “Oh god,” he said miserably, pinching his eyes shut. “Oh god, I threw up on Tony Stark’s shoes.”\nA chuckle sounded, from somewhere to his left.\nPeter didn’t see the humor in the situation. “His shoes probably cost a thousand bucks each. A thousand for the right and a thousand for the left. And I’ll have to pay for new ones and I can’t pay for new ones and he’ll make me clean the whole Avengers tower with a toothbrush until I’ve paid off my debt.”\n“Yeah, he’s an asshole like that,” the voice said. It was a voice Peter recognized, and horror instantly washed over him like a freaking tsunami.\nHe whipped his head around – his vertigo did not respond kindly to that – and saw his worst suspicions confirmed when he laid eyes on the Tony Stark himself, casually leaning against the wall, his sunglasses pushed up into his hair. He wasn’t wearing his shoes anymore.\n“Ummmmm…” Peter said as his brain short-circuited.\n“Remember me?” the Tony Stark asked.\n“Re-… Re…”\n“You brought me a donut last week.”\nPeter blinked up at him, arms and legs still clenched around the cold toilet bowl, koala-style. “You remember me?”\n“I remember everyone who brings me food. It’s practically imprinting. You’re my momma bird now.”\n“Gross,” Peter said, grasping for some toilet paper to wipe his mouth. “Um – my puke, I meant. Not your analogy. Sir – your shoes…”\n“I know,” Mr. Stark lamented, wiggling his eyebrows. “Your cleaning duties start tomorrow. Bring a toothbrush.”\nPeter would have laughed if there wasn’t a part of him still afraid that Mr. Stark was being dead serious.\n“So, you’re Midtown Tech, huh?” Mr. Stark said. “A school for smart beans. Are you a smart bean?”\n“I’m…”\n“What’s two times a thousand bucks?”\n“Uh,” Peter mumbled, still torn on whether Mr. Stark was teasing or simply tightening the noose. “It’s… I mean… It’s… two. Thousand. Two thousand, sir.”\n“That was some real quick math, squirt. I can see why you’re in a STEM school.”\nPeter was pretty sure he could have fried an omelet on his face right about now. Mr. Stark just chuckled, standing and moving past Peter to the sink. Peter slowly turned and leaned his back against the wall, so he could keep Mr. Stark in his field of vision.\nHe now realized that they weren’t in a public bathroom; at least, it was way too shiny and quiet to be a public bathroom. Had he just thrown up in Mr. Stark’s fancy, private facilities?\nMr. Stark started rummaging through a cabinet. “And how much do you figure I should pay you by the hour, to clean my tower with a toothbrush?”\nPeter swallowed. “Sir, I…”\nThe sound of the tap running, and a moment later Mr. Stark extended a plastic cup to him. Peter took it, taking a sip of the water to rinse his mouth, spitting it into the toilet bowl.\n“Much as I’d like to continue my little experiment of seeing how red your face can get, I suppose I should cut you some slack, since you are sick and since I, contrary to popular belief, do have a heart. So…,” Mr. Stark crouched down in front of him, both his knees popping, “don’t worry about the shoes, squirt. I have around two hundred other pairs. They have their own room. It’s bigger than Captain America’s bedroom. My point is; forget it ever happened. Which won’t be easy because, knowing teenagers, your classmates will lord this over you forever.”\nPeter just stared up at him, eyes wide, both hands clenched around the plastic cup.\n“Venga,” Mr. Stark said. “Stop looking so scared.”\n“Are you really serious?” Peter whispered.\n“Am I serious about not making you into my toothbrush-wielding slave? Yeah, I think I am.”\n“No but I mean,” Peter paused for a minute to take another sip of water, “you could still sue me or something.”\nThere was a knock on the door and one of the security guards poked his head in. “Mr. Stark,” he said in a deep voice. “Miss Potts reminds you that the key note speech was due to start five minutes ago.”\n“That gives me roughly another twenty minutes to be fashionable late,” Mr. Stark stated, his eyes still steady on Peter’s face. “I’m guessing we should be calling a parent right about now?”\n“Sir, you don’t have to-.. You must be very busy.”\n“Peter,” the man said, his voice now flat. “Stop worrying. I have nowhere to be.”\nPeter snapped his mouth shut, blinking fast because holy shit, Tony Stark remembered his name. “This is... insane.”\n“I don’t think it is,” Mr. Stark said. “You were kinder to me last week than most people I’ve met in my life, and you didn’t even know who I was. This? This is… nothing.” He took out his phone. “Why don’t you tell me who I can call to pick you up?”\n“May,” Peter murmured. He took another sip of water, then closed his eyes for a moment and took a deep, steadying breath. The nausea had subsided and he didn’t think he would throw up again. The vertigo was still unpleasant, though.\nIt wasn’t until he opened his eyes again and saw Mr. Stark patiently looking back at him that he realized a first name wouldn’t exactly be enough information for this man, even if it was Tony Stark. “Uh,” he said - and God, could he stop blushing already? “Her number is in my phone – let me…” He planted one hand against the cold, clammy tiles to give himself some leverage. But before he could push himself up, Mr. Stark had already reached for his crumpled backpack and pulled it closer.\n“In the front pocket,” Peter quickly squeaked, because oh boy, if Mr. Stark opened his backpack and spotted the Spider-Man suit crammed in there; or the NightMonkey sketches; or his own research on solar distillation with Peter’s notes in the margin…\nYeah, he’d be busted. Three times over.\nBut Mr. Stark just opened the front pocket, fishing out Peter’s bruised and battered phone. “This piece of crap is yours?”\n“It’s seen better days,” Peter agreed. “I should probably, uh-“ he reached out a hand to help Mr. Stark unlock the phone, but before he could even finish his sentence, Mr. Stark had done something complicated, aiming his own phone at Peter’s screen, and there were little bleeps and whooshing noises and then Mr. Stark just started merrily tapping through Peter’s phone, as if this was something he did on a regular basis.\n“Did you just hack my phone?” Somehow that was equal parts offensive and awesome.\n“H I J K L, May. May… Parker? That your mom?”\n“Aunt.”\nMr. Stark merely nodded as he tapped the screen again.\nPeter shifted his position a little. “I really like your work, sir. I read all your papers on-“ he faltered, suddenly worried that he might give something away if he’d start talking about solar-distillation right now. “On, umm…”\nMr. Stark chuckled as he lifted the phone to his ear. “Don’t worry, squirt. You don’t have to pretend to be familiar with my research. - - Yes, hello? Is this May Parker speaking? I have something here that belongs to you. Brown hair, comically large eyes, nerdy t-shirt … Sounds about right … Yes, he’s fine, just threw up all over the Stark expo, but otherwise peachy, any chance you can- … Uhuh … That’s the place.”\nPeter took another deep breath, leaning his head back against the tiles and trying not to feel guilty about making May leave work.\n“She’s on her way,” Mr. Stark said, hanging up. “While we wait, why don’t you go ahead and ask the famous Tony Stark something you’ve always wanted to know?”\nPeter grasped for a question that had nothing to do with solar-distillation but came up with nothing. “What’s your favorite color?” was all that came out in the end.\nMr. Stark laughed again, slapping his knee. “Can’t believe you’re going to a STEM-school.”\n \n\nPart III: Spider-Man \n\n \nIt was a particularly nice afternoon in Queens, with the sun shining and the birds tweeting and the whole shebang. It had been raining all morning, so Peter was feeling rather content as he could now relax on his favorite rooftop: right on top of the hospital where his aunt worked. The temptation to take off his mask and let the sun hit his face was hard to resist. But he knew better than to make a rookie mistake like that.\n“Enjoying the view?”\nPeter jumped a little and turned around. It wasn’t often that Iron Man managed to sneak up on him with that big, loud, ugly suit of his. Peter must have been really lost in thought.\n“I was actually,” he said, glancing back at the large mural painting looming over them. The colorful artwork was another reason why he loved sitting on this particular rooftop. It was an abstract group portrait, and if Peter cocked his head and squinted, he could see his uncle Ben in one of the figures, smiling down at him.\nMr. Stark glanced up at the mural painting, too. “Meh. Average at best.”\nPeter bristled. No one was allowed to call anything that reminded him of his uncle ‘average’. “You’re out of your mind, Stark.”\n“I can probably bribe the artist to paint your bedroom walls, if you want.”\nWas that another way for Tony Stark to try to get his address, his identity? “Good luck. I googled the artist once,” Peter said, “but nothing came up.”\nThe painting must have been commissioned by someone. And it was signed with the name Nescio in the lower right corner, but Peter had never been able to find a full name. He had never been able to send the artist an email, thanking him for making Queens a little brighter.\n“You like art, then?”\n“Uhm,” Peter said, an image of his latest NightMonkey comic flashing through his head. Abort. Abort. He jumped to his feet. “Never mind. Change of topic. So what brings you to my neck of the woods?”\n“Waiting for my future murder victim. If our intel is correct, a woman we’ve been looking for for a looong time is about to walk into that building right there.”\nPeter squinted at the building across the street, then looked back at Mr. Stark. “Fraser &amp; co? Don’t they just own parking lots?”\n“Yup, but the company has been used as a cover to launder millions of dollars.”\nBehind him, Peter spotted the roof door swing open and out stepped Captain America and Black Widow, both looking grim and completely ready to kick some butts. “Hey websy,” Romanoff said, lifting her chin a little in greeting.\nPeter wanted to squawk in indignation at the uncool nickname, but really, how could he be mad about it when it was Black Widow saying it?\nIron Man took a step back so they all ended up standing in a neat semi-circle. “I thought you were going to bring the quinjet?\"\n“I did,” Romanoff said in her smooth voice. “I just parked it out of sight. Or did you want me to fly overhead with a large big banner saying ‘the Avengers are here’?”\n“Nah, although I wouldn’t say no to you flying out of here later with a big banner saying ‘the Avengers were here’. In fact-”\n“You guys need any help?” Peter interrupted. In his experience, a back-and-forth between Tony Stark and Natasha Romanoff could go on for a while.\nIron Man turned to him. “I wouldn’t ask that of you. But I’m aware you’ll probably to do it anyway.”\n“Hey, at least I’m not so clumsy that people make embarrassing comics about me on Instagram.”\nNatasha snorted.\n“Those comics are wildly inaccurate,” Mr. Stark said with a huff, “because I don’t do my own ironing. And I am not clumsy, I am graceful as a sugar plum fairy.”\n“You’re getting too old for this,” Peter told him with a lazy smile.\nThe face plate abruptly lifted and Tony Stark laid his piercing gaze on Peter. “Excuse me? Say that again?”\n“Don’t say that again,” Natasha advised him.\n“Do any of you remember why we are here today?” Rogers asked.\n“Apologies, boss,” Mr. Stark said in light tones. “Please, impart your wisdom on us.”\n“Let me start with a friendly reminder. We’re about to go up against a woman who has great accuracy with firearms and is part robot.”\nPeter felt his curiosity spike. “Woah, part robot, really?”\n“You can fanboy over her after we’ve caught her,” Mr. Stark tells him.\n“What’s your plan of action, then? Have you tried taking her out with a localized electromagnetic pulse?”\nMr. Stark shuffled his feet, which looked a little ridiculous in that large suit. “We’ve attempted that. It resulted mostly in embarrassment. She has a covering of conductive material surrounding her chest that blocks electromagnetic fields. So the only thing that actually stopped working when we fired off the EMP, was my own suit.”\nPeter fought back a snort. Oh, he should definitely make a comic strip about that.\n“Which means that today, we’re just going for a good old-fashioned punch-up,” Steve Rogers said in light tones as he readjusted his shield. “There’s three of us this time, so we should be able to get this wrapped up without embarrassing ourselves too much.”\n“Four of us.” Peter corrected.\nSteve Rogers gave him a nod, clearly just to be polite. “Right. I appreciate the offer. Why don’t you… why don’t you stay up here and be our eyes and ears? That’s a very important job.” He looked to Natasha for support.\n“Very important,” she echoed.\nRight. Far be it from Peter to act like a whiny teenager in front of Captain America. If he wanted to be included, he needed to show that he was responsible and could follow orders. So he just nodded.\nOnly after the three Avengers had taken their leave – Tony Stark flying to the roof of the Fraser &amp; Co company and Romanoff and Rogers taking the stairs down to the street – did Peter realize that they hadn’t even left him with a comm.\nNow that was just damn disrespectful.\nHe sat down on the edge of the roof again with a sigh of resignation, and glanced up at the mural painting by Nescio. Uncle Ben looked down at him with a benevolent smile. “Glad you’re feeling cheerful, Ben,” Peter muttered. “’Be our eyes and ears’, they said. ‘It’s an important job’, they said. What do they expect me to do if I actually see something dangerous? Send smoke signals?”\nUncle Ben just smiled, like he always used to do when Peter was complaining. And even though it was actually just an abstract wall painting, Peter somehow still felt chastised.\nHe waited; his legs dangling over the side of the building, and he could tell that the Robot-lady was around when he saw Iron Man suddenly jumping to attention, stepping up to the edge of the roof.\nPeter scanned the street, not immediately spotting their enemy until a tall figure in a long, grey raincoat caught his eye. The face was covered by the hood as she – it? – hurried down the street with long strides, a suitcase in hand.\nShe came to a full stop when she came face to face with Natasha, who appeared out of the Fraser &amp; co’s front doors and blocked her entrance. In the same moment, the Iron-Man suit fired up and Tony Stark hovered to a position right above her.\nNoticing him, she shrieked: the sound a strange mixture of a human cry and a fire alarm going off. She threw off her large raincoat, and wow-ee: Metal plates covered the right side of her face and her shoulder, a machinal eye moved independently from her natural one. Her right arm was more exposed; through the gaps in the metal, Peter could see red and blue wiring running down towards her hand.\nIn one motion, she slammed her suitcase down against the ground and opened it, exposing what looked like a strange sort of machine that Peter would really like to take home and poke with a screwdriver. Robot-lady smashed her hand down on a button, then took off running.\nFor a split second, it seemed like nothing happened at all.\nThen, the street lights and all the neon signs hanging over nearby shops turned off as one, like candles blown out on a birthday cake.\nAnd above Peter, in mid-air, the Iron Man suit suddenly didn’t hover any more, but dropped out of the sky, tumbling towards the tarmac at alarming speed.\nPeter jumped forward, shooting his web. It caught the Iron Man suit on the leg, which meant that Tony was left dangling upside down, about thirty feet about the ground. But hey – he was still alive. Peter gently lowered the suit to the street where it remained, unmoving, flat on its back. Not even one tiny blinking light. She had fired off an EMP, Peter suddenly realized. Of course. Apparently, Robot-lady had learned from her last encounter with the Avengers. The Avengers had tried to throw her a grenade, and now she had taken the pin out and thrown it right back. Peter almost admired her.\nToo bad she was totally evil.\nRomanoff and Rogers were in pursuit, but they were hundreds of feet behind her and she was fast; shoving pedestrians out of her way and jumping across garbage cans with terrifying ease. It looked like Peter was going to have to solve this. As usual, he might add. Tony Stark was probably trapped like a sardine in a can right now, but he could wait.\nPeter turned and swung. He saw Robot-lady turning a corner in the distance, and he launched himself up to the roof, crossing it diagonally before diving back down towards the street, swinging from lamppost to lamppost. He was already ahead of Rogers now, and Romanoff had completely dropped out of sight with her poor normal human legs.\nThe Robot-lady tore down the street like an out of control steamroller. She kicked a poor tree, that had apparently offended her, so hard that it snapped in half. Pedestrians gasped and ducked out of the way.\nPeter had almost caught up with her. He gazed ahead, mentally mapping out Robot-lady’s route and his heart skipped an excited beat when he spotted a canopy above the entrance of a store, in the perfect position. It was dipping in the middle, where a large puddle of water had gathered. And if Robot-lady kept running in a straight line, Peter could treat her to a lovely mid-day shower, free of charge. Robots didn’t generally do well with water, did they?\nHe whooped as he swung up again, factoring in Robot-lady’s speed and falling perfectly in line with her movements. And just as she disappeared under the canopy, Peter slid across the top of it, his free arm outstretched, bringing the water sloshing to the edge.\nThe water didn’t hit her perfectly; it mostly hit her on the back of the head and shoulders, not against the arm where machinery seemed most exposed.\nShe still let out an unearthly shriek, furiously shaking her head back and forth, sending droplets flying. Something sizzled. A red spark. She stumbled forward a few more paces, suddenly looking like a baby-deer taking its first steps. But even as she went down, Peter saw her crane her neck upwards and aim the gun straight at him.\nThere was a BANG, ominously reverberating against the buildings, and in the same moment Peter felt his right shoulder explode with pain.\nNot this again.\nQuickly shooting a web with his good arm, he lowered himself down to the street, gritting his teeth against the blinding pain. He glanced back to see Steve Rogers jump on top of the woman, practically spreadeagled. All pedestrians had their attention fully focused on the floundering mass of limbs on the pavement.\nPeter quickly ducked behind a large, triangular stone pillar that decorated the façade of a fancy apartment block. Out of sight - - hopefully out of mind.\nEvery single breath sent a jab of pain shooting through his chest and down his right arm. Yeah, he’d taken a proper hit. He knew from long experience how to deal with gunshot wounds like this. He tried to keep his breathing as superficial as possible as he reached his left arm around and felt for an exit wound. Turned out he wasn’t flexible enough to reach all the way behind his shoulder, and even trying to stretch that far hurt like a mother trucker.\nSo he slid down to the ground, leaned back against the wall for a bit and gloomily picked at the bullet-sized hole in the front of his red-and-blue hoodie. Another suit down the drain. Or maybe he could fix it with a little patchwork.\nWho had ever expected that being a superhero would involve so much sewing?\nHe was surprised to hear the whirring of repulsors. Apparently, the Iron Man suit had already recovered from the cyber-meltdown. Too bad, because Peter was in no mood for a patented Stark-lecture. The ground shook as Iron Man landed ungracefully on the pavement. Mr. Stark was always overly protective of him when they fought together. Iron Man, mother hen.\nThe Iron Man suit moved closer. The face plate lifted, revealing Tony Stark’s tight face, eyes trained on Peter’s shoulder. “Does it hurt?”\n“No, it tickles,” Peter snapped. “Did I… Did I — take her down?”\n“Steve are we clear?” Mr. Stark asked and, after listening for the answer, continued: “All right. I’m with Spidey. Nat, keep the Quinjet ready, we may need to get him back to home rank.”\n“Nnnnope,” Peter said, still focusing on keeping his breathing as shallow as possible. They were gonna have to do a lot worse to him than a simple bullet hole before Peter would consent to be taken to the Avengers’ headquarters.\nMr. Stark stepped out of his suit and knelt beside him. “You have a gunshot wound, Underoos.”\n“Yeah, thanks for — pointing out — the obvious.” Peter grunted, slowly releasing another breath. He wasn’t going to puke all over Mr. Stark’s shoes again, he just wasn’t. They were nice shoes, too. Bright red with flashy laces.\nMr. Stark looked annoyed. “Well, apparently you’re one of those people who needs the obvious pointed out to them.”\n“Just tell… just tell me — if there’s an exit wound. As long as — the bullet — is not in there… I’ll heal.”\nTony Stark muttered something under his breath that definitely contained several colorful swear words and scooted closer, tugging a little at Peter’s collar.\n“Don’t take off my mask,” Peter pleaded.\nMr. Stark didn’t respond. He just carefully peeled the red-and-blue fabric away from Peter’s shoulder, one strong arm firmly around Peter waist to keep him steady, as he leaned over to glance down Peter’s back. “Exit wound,” he confirmed, and Peter exhaled in relief.\nMr. Stark carefully readjusted his suit and set him back against the wall. Peter only winced slightly when his injured back hit the bricks. “Thanks, Mr. Stark.”\n“Call me Tony, kid. We’re there.”\n“Thanks, Tony. Um, that will be all. You can be on your way now.”\n“If you think I’m going to leave you here, you must be concussed on top of everything else.”\nPeter shrugged dismissively with his one good shoulder. “Stay as long — as you want. But as soon as — I can stand without throwing up, I’m leaving ... My aunt is a nurse ... She can fix me up when I get home ... If I’m not — fully healed by then.” He heaved in a slightly deeper breath. It was getting easier already; the sharp jabs of pain turning into the tingling, burning sensation that always accompanied his healing factor.\n“Your aunt knows about this, then?”\n“Uhuh. Helped me dig the bullet out this one time when I didn’t have an exit wound.”\n“You are one tough motherfucker,” Tony said.\nLanguage, young man!” Peter scolded.\nTony snorted.\nPeter laid his head back against the wall. “Thanks,” he murmured. “For not, uh… That is… I figured you’d use this as an excuse to take a peek under the mask.”\n“Hey, it’s in my own best interest to keep your identity a secret, Underoos,” Tony said. “Judging by your size and voice you’re – rough estimate – twelve years old. You’re a kid playing an adult game, and I don’t need that on my conscience. But as long as you keep the mask on, I can pretend that I don’t know how young you are.”\n“Excuse me very much, I’m fifteen.”\n“You’re not making the compelling case you think you are. Let me take you home, at least.”\nPeter lifted his head again to study Tony through his goggles. “You know that’s not gonna happen, right?”\n“You can’t expect me to—“\n“Listen, Tony, I don’t have a death wish, okay? So if I thought the situation was bad, I’d ask for help. But I’ve been through this particular mill a hundred times already. I know what I’m doing.” Peter sat up straighter and, when he wasn’t overcome with a wave of nausea, carefully pushed himself to his feet.\nTony stood up too, still frowning deeply. But all Peter did was give him a little wave and say “tell Captain ‘you’re welcome’ for me, and maybe to actually work with me next time, and I’ll see ya when I see ya,” before shuffling around him and into the sunlight.\nAnd Iron Man probably thought Peter didn’t notice him following; didn’t feel Tony Stark’s eyes on him from somewhere overhead as he walked home. As soon as he could, Peter ducked into an alleyway and managed to escape him.\n-\nSpider-Man might be a ‘tough motherfucker’, but Peter Parker sometimes needed help.\nFor instance, when he was handing another steaming cup of coffee to Jennie, a shy but sweet homeless lady with a troubled past who came to the café almost every Saturday, and suddenly Don popped up next to the table, distrust and suspicion written all over his face.\n“Are you happy with your order, ma’am?” he asked, his voice laced with a false sincerity, eyes trained on Jennie like a shark who had smelled blood in the water.\nJennie stared up at him like a dear caught in headlights, nodding quickly in spite of her clear panic, and there was a small chance that Peter was definitely about to get fired.\n“And will you be paying in cash or by credit card, ma’am?” Don asked, going in for the kill.\nJennie threw Peter a helpless glance, then ducked her head, almost disappearing inside the giant scarf. Peter held his breath, clenching his tray tight, grasping for some kind of excuse.\n“Well?” Don demanded.\n“Excuse me,” a voice said.\nTony Stark really had a knack of turning up at the worst moments. Peter turned, wondering if this situation was about to get better or much, much worse. Tony was standing behind them in a nice looking suit. He was wearing those same bright red shoes. His eyes drifted from Don’s set jaw, to Jennie, to Peter’s nervous face. He didn’t say anything else, yet.\nDon did a double take, then blinked. “Hey, aren’t you—“\nTony finally spoke, as if he had waited for Don to start just so he could interrupt him. “I certainly hope you are not accosting my business partner, hm?”\nDon floundered for a moment. “Business partner?”\n“Yes,” Tony said. ”This is Mrs. Flanigan, head of NYU Tandon school of engineering. Problem?”\nDon glanced at Jennie’s oversized coat and dirty nails. Jennie puffed out her chest a little, holding his gaze this time. “No problem,” Don said in his most oily voice. “I’m honored to receive you in my establishment, Iron Man.”\n“Yes, well, you have excellent staff,” Tony said, with a single pat on Peter’s shoulder. “Hey, kid.”\n“Hello T-… Mr. Stark,” Peter said, catching himself just in time. Tony had only allowed Spider-Man to get to a first-name basis, after all. “I like your shoes.”\n“Of course you do. They’re the height of fashion,” Tony said with a grin. “They’re so cool, you could store tubs of ice cream in them.”\nDon glanced between Tony and Peter for a moment, lips pursed in aversion. Anyone who talked to Peter like a normal human being, would clearly never be a friend of Don. But the man apparently had enough braincells left to not challenge Tony Stark directly. So instead, he just dumped a few more insults on Peter. “I didn’t hire you to stand around. Maybe actually get your lazy ass to work for a change; you have a line of customers at the counter.” He turned his back on them.\n“Yes, sir,” Peter mumbled, deciding not to point out that the line was there because Don had felt the need to check up on him in the first place.\nTony gave him an incredulous look, and as soon as Don was out of earshot, he mimicked: “Yes, sir. Why the hell are you letting that guy walk all over you?”\nPeter released a breath, so long that it felt as though he had been holding it through the whole conversation. “Thank you, Mr. Stark,” he said, fully aware that Tony just saved his job.\n“Welcome, squirt,” the man said, turning to Jennie with a slight bow as he gestured at the chair. “May I?”\nShe blinked, then shrugged her consent.\nTony sat down at the table with her, languidly leaning back and grinning up at Peter. “Why don’t you get me and my business partner some donuts?” he took off his sunglasses and pointed them at Jennie. “You like banana and cinnamon, Mrs. Flanigan?”\nShe narrowed her eyes, gauging his expression for a moment. “Chocolate raspberry,” she then said.\nTony nodded. “Excellent choice.”\nPeter returned to the counter, head still reeling. Tony had saved his ass for now, but Peter knew this wasn’t the end of it. Maybe Don had seen Jennie at the café before and had been suspicious of her already. Either way, Peter really needed to be more careful with the free coffee, because Don would probably be watching him for a while.\nHe took a few more orders, then paused for a moment behind the counter to massage his shoulder. His muscles always did feel a bit sore the day after he’d gotten shot or stabbed. He had made it back home just fine last night. His wound had already closed nicely by then, so May couldn’t fuss over him like she always wanted to. Instead, she had clucked her tongue a bit when she saw his bloodied and shot apart hoodie and set about washing out the worst stains with hot water and soap. Peter had told her to forget it, that he was going to throw it out and make himself a new one, but May had insisted that it needed to be cleaned first to avoid questions from the neighbors (“Didn’t we watch 'Mr. and Mrs. Smith' together? Don’t you know any one of our neighbors could be a secret spy?”).\nHe made Tony a cup of coffee and then brought the odd couple their donuts. Tony appeared to have no problem keeping up a conversation with a homeless woman; their current topic of conversation was business relations, and Jennie apparently had plenty of advice.\n“It’s all about image,” Tony was saying. “I just need to get those people to like me, somehow.”\n“You can steal their stuff and then pretend you found them under a garbage can,” Jennie said.\nA wicked light entered Tony’s eyes. “Interesting.”\nPeter didn’t want to know what schemes they were hatching, but there was something heartwarming about the simple fact that Tony Stark had actually sat down with Jennie – and he didn’t even look at her all superior and condescending. Peter already knew that there was something resembling a kind person beneath all those carefully constructed layers of cynicism and snark, but it was always pleasant to see a reminder.\nHe set the donuts down, before clenching the tray against his chest. “You should probably not come by during the day for a few weeks,” he told Jennie, forcing down that little bubble of guilt. “Lay low for a little while. But you can drop by around closing time, because Don has usually long left by then, and I always close up by myself.”\n“You need to quit this job,” Tony said with a frown as he reached for his donut. “That asshole is abusive.”\n“What?” Peter squeaked. “No sir, he doesn’t… he never…”\n“Not like that. Verbally abusive, not to mention exploitative. How old are you, thirteen? Are you even allowed to work this many hours? Working overtime while he just goes home?”\n“Excuse me very much, I’m fifteen.”\nTony gave a dramatic sigh, waving his donut around. “God, if I had a penny for every time I heard some kid say that as if it would actually make a damn difference… well, I’d have two pennies. Quit you job, squirt!”\n“Thanks for you insight, Mr. Stark, but some of us aren’t billionaires who can spend their days snorting caviar and bathing in champagne.”\n“Sounds like someone has been reading my diary,” Tony said, wiggling his eyebrows.\nPeter just frowned at him. He didn’t want to be snarky at Tony, but the man’s ‘nothing matters’-attitude annoyed him. “I need this job, it’s my safety net.”\n“I’ll give you a job,” Tony offered. “The tower has a restaurant where you can work. Several, in fact. I’ll double whatever that asshole pays you, and you won’t have to do unpaid overtime. Mi casa es su safety net.”\nPeter breathed out, now feeling guilty about snapping. Tony’s frame of reference might be a little detached from reality, with his mindboggling state of wealth and fame, but he was always kind to Peter and he had just saved him from Don’s wrath. “Thank you sir, but I don’t want to quit,” he explained. “I really like this job. I mean – not the owner, or the hours, or the pay. But I like the customers. They know me, they come here to talk to me, to get free coffee when they need it.” He threw a quick glance at Jennie. “I don’t want to ditch them.”\n“Excuse me,” a breathy voice interrupted them. A young man had appeared next to the booth; early twenties, wobbling nervously on his feet. “Sir, I’m such a big fan. Can I… Can we get a selfie?”\nTony’s mouth snapped shut. He threw Peter a calculating look that seemed to imply that Peter had not heard the last of his ‘quit your job’-rant, but then turned his attention to the young man. “Big fan, huh? What’s my favorite color?”\nThe man blinked. “Your…”\n“Just making sure you’re not one of those fake fans who only started liking me after I saved the planet from aliens.”\n“It’s, uh… red and gold?” The man ventured.\n“Lucky guess,” Tony said. “Get in here.”\nWith a undignified squeal, the man got his selfie before bouncing off, back to his own table. A few other customers had turned their heads, too, comprehension dawning in their eyes as they took a good look at Mr. Stark.\n“I’d better leave,” Tony murmured, taking out his wallet and pushing some money into Peter’s hand without even looking how much it was. “That’s to cover everything. Keep the change.” He rose from his chair and bowed at Jennie again. “Goodbye Mrs Flanigan, thank you for the interesting, fierce and – I think – productive debate on establishing long-term working relationships.” He left.\n“Gosh,” Jennie said as she happily dunked a piece of donut into her coffee. “Can you believe Tony Stark thought I was the head of some university?”\n \n \n\nPart I: Anthony Edward\n\n \nTony Stark was in his element.\nMaking vague threats to incompetent assholes was easily in the top 10 of his favorite pastimes. He had even put on his big, flashy ‘evil businessman’-watch for the occasion, even though he was speaking on the phone and his current victim couldn’t see him. Still, he felt that dressing the part made you feel the part, and feeling the part made your voice sound all the more intimidating. “My friend; if the government finds out you are breaking federal labor laws on this scale, you’ll go to jail. And I mean straight to jail. Do not pass go, do not collect five hundred dollars.”\n“I don’t know what you’re implying!” Don barked.\n“Oh, sure you do, you human-shaped turd. I’ve been to your café. You pay below minimum wage, you violate the permitted working hours for minors. And that’s just the tip of the iceberg.”\nDon grumbled a little on the other side of the line, before grunting: “So what do you want?”\nTony lazily rested his arm on the desk, gazing down at his ‘evil businessman’-watch. “I want you to sell me your café. Stat.”\nThis definitely seemed like a good idea.\nDon sputtered and objected and cursed a blue streak and made a whole array of increasingly unimpressive threats, but as always, Tony got what he wanted in the end. He even offered Don a decent prize, which was certainly more than the man deserved.\nAfter he hung up, he made his way to Pepper’s office. He found her sitting cross-legged on top of her desk, twirling a pen in her fingers as she read a contract. She looked more relaxed than usual, and Tony felt a little bad about ruining her good mood with what he was about to tell her. “Honey? I bought a café.”\nShe frowned, not looking up from the contract yet. “Excuse me?”\n“A lovely little place somewhere in Queens. Got rid of the current proprietor, effective immediately. So it would be nice if we could find someone else to run it, like today.”\nPepper carefully laid her pen down, although Tony somehow got the impression she was resisting the urge to fling it at his head. “Have you gone mad?”\n“The jury is still out.”\nShe slipped off the desk, sat down in her desk chair and crossed her arms. “Do you have any idea how many FDA regulations are involved with owning a food business? Regulations that we have no expertise on whatsoever?”\n“I didn’t think that far ahead.”\n“Yeah,” she said. “You should have that tattooed on your forehead. What’s the story here? Why a café? Is it like that time you bought an island because you thought it was shaped like E.T.?”\n“No,” Tony said, shuffling his feet and bringing up a hand to scratch the back of his head. Pepper always had a way of making him feel like a clueless school boy. “It’s just…. There’s this kid. You know, the one I told you about a few times. And – uhm – he likes working there, but he doesn’t like the owner. So I’m rectifying that.”\nPepper’s eyes scrutinized him quietly. There was no annoyance in her gaze anymore, just a questioning glance. “And who exactly do you suggest I hire to operate this café for you?”\n“I don’t know. Someone who is good with kids.”\n“Someone who is good with kids,” Pepper repeated. “Not someone who is a good barista, or someone with a knack for business?”\n“Yes, yes. That too, of course.”\nShaking her head in exasperation, Pepper turned in her seat to grab a piece of paper and a pen. She started writing out a list, and Tony couldn’t really make out what it was. You’d think someone as orderly as Pepper would have exemplary handwriting, but in reality it was nothing more than an illegible scrawl. “Whatcha writing there?”\n“A letter to Human Resources, complaining about you,” she quipped without missing a beat.\n“Pep!”\n“Just leave it with me for a moment, Tony. I’ll get your café all sorted out before lunch.”\n“Do you think I’m going crazy?”\n“Certainly not,” she said briskly. “I’ve seen you get caught up in far, far more insane projects. In fact, this particular bout of lunacy doesn’t even crack the top ten.”\nFair enough. “Just make sure you double the kid’s salary, okay? And whoever else works there, too. And maybe set up something like a ‘pay it forward’ type of program where we pay for homeless people’s coffee. And change the name to something clever. Oh – and make sure to put in some new booths that are kinda secluded – you know, so famous people can sit there without getting bothered by the GP.”\n“Would you like to quit your job at Stark Industries and just run this café?” She asked, amused.\n“Don’t tempt me. Actually – don’t tell the employees I’m the new owner, would you? I think it might freak the kid out. Use a pseudonym or something.  Let’s call him… Anthony. Anthony Edward.”\n-\nFor some reason, Clint had made it his personal mission to keep Tony up to date on the most embarrassing and offensive pictures he could dredge up from the social media swamp. And his new favorite supplier was some Instagram asshole called ‘moon monkey’ or something like that.\nClint always chose the worst moments to bother him with them, too. When they were in the middle of a mission. Or when it was five AM and Tony had finally drifted off to sleep. Or when he was walking down the halls of a hospital.\n\nTones. NightMonkey uploaded another one of you. Pepper says it’s both hilarious and accurate. Shall I forward it to you right away, or do you prefer to wait until you get home so I can walk you through it?\n\nTony stared down at his phone, not sure if he wanted to roll his eyes or scream in frustration.\nHey Cupid’s weird cousin, he messaged back, I’m in a children’s hospital. Do you really want to be responsible for putting me in a bad mood while I have a meet and greet with young leukemia patients?\nHis phone stayed quiet for a few seconds. All right, Clint then replied. In person it is. I’ll be waiting for you, boo-boo &lt;3\nJust wonderful.\nHe put his phone away and redirected his attention to Erin, one of his PR managers. No-nonsense, hardworking Erin, who had never demonstrated even the slightest evidence of a sense of humor. Bless her heart.\n“Sorry about that,” he said. “Barton keeps insisting I look at some idiotic comics.”\n“Oh,” she said, readjusting her glasses. “The ones from NightMonkey that he keeps reposting? Ya, they’re pretty funny.”\n“Et tu, Erin?”\nShe cracked a smile, the first one he had ever seen on her, and then gestured for him to enter the room behind her. A room that would be full of young cancer patients who all wanted Iron Man to read them a story.\nAnd those little buggers were probably all on Instagram; every last one of them. One of them might even be NightMonkey.\nTony liked to imagine that these kids somehow had the upper hand over him. It made him feel just slightly less inadequate about being completely unable to save them. Slightly less paranoid that every doctor and nurse who glanced his way was secretly thinking ‘I saved just as many lives as you did, Mr. Avenger. Where is my medal?’\nHe entered the room, where a nurse was helping five kids settle into a pile of large pillows on the floor, in front of a large armchair where Tony was clearly supposed to sit. The set-up made him think of those mall Santas he only really knew from TV.\nHe recognized the nurse as Peter’s aunt, May Parker. Funny. It seemed weird to start a whole conversation right now, though, so he simply gave her a polite nod. Her returning smile was friendly but professional and no recognition shimmered in her eyes. Had she forgotten about meeting him?\nThat was definitely impossible.\nOn the other hand; the day they met, her attention had mostly been focused on hoisting her wan, semi-lifeless nephew into the backseat of her car, while rattling off a lecture about the dangers of marshmallows. (“Did we not watch Ghostbusters together? Don’t you know those things can gang up on you?”)\nHe couldn’t dwell on the thought, though, because May had already left the room and someone pushed a picture book into his hands and now five pairs of wide, curious eyes were staring back at him.\n“Before we begin,” he said. “Any of you people on Instagram?”\nAll five hands lifted.\n“Explain to me the appeal of this cheap Facebook knock-off?”\n“What’s Facebook?” a girl asked, her face scrunched up in confusion.\n“It’s Instagram for old people,” a boy whispered.\n“Oh,” the girl said, with an understanding nod. “So we have to switch to Facebook when we get old?” She had the gall to wave her hand in Tony’s direction at the word ‘old’.\nThe boy considered her question for a while. “Probably,” he then said.\n“Let’s just read,” Tony decided.\n-\nTony supposed the universe was trying to tell him something when he stepped out onto the sidewalk an hour later and saw May Parker right outside the door, zipping up her coat, a backpack clenched between her legs.\n“Miss Parker?”\nShe jolted, turned and stared back at him with surprised eyes.\n“Tony Stark,” Tony said, pointing a thumb at his own chest. “We met that day when your nephew threw up all over my shoes?”\n“I remember,” she said. “I just didn’t expect you to.”\nIt was funny how often people were surprised that Tony remembered their names. Apparently, he was supposed to be a bigger asshole or something. “I’m a genius,” he pointed out. “I wouldn’t forget your name.”\nHer eyes crinkled at the corners. “You remind me of Peter. I see why he likes you so much.”\n“How is he?” Tony asked, conversationally.\n“Still alive, I hope,” May said, a little shortly. She hoisted up her bag. Hesitated. “I apologize, Mr. Stark. It’s… I just ended a double shift. I’m starving, sweaty, exhausted and I really want to get home to my nephew to make sure he hasn’t gotten himself into any trouble today. And the bus is leaving in five minutes.”\n“Let me drive you home,” Tony offered. “I’m parked right around the corner. And it’s on my way.”\nIt wasn’t. And she probably knew it wasn’t. But she smiled gratefully, accepted the offer and followed him to his car.\n“You’re not going to kill me in this thing, I assume?” she asked as she put on her seatbelt.\n“I’m an excellent driver. I only hit one cone on my way here. It jumped in front of my car.”\nShe hummed. “Do you have a tiny red button, like the car in Men In Black?”\n“No.”\n“How about a flux capacitor?”\nTony was beginning to see why Peter had turned out so well. “No. But I have this.” He pressed a button and a shiny blob appeared above the dashboard.\n“Is that a holographic bobblehead dog?” May asked.\n“That is a holographic bobblehead dog,” Tony confirmed. “And he bobbles when the car moves. Watch.” He demonstrated by bouncing up and down in his seat.\n“Why,” May asked, “does it exist?”\n“Because I made it. I wondered if I could and, as always, the answer was ‘yes’.”\n“Did you ever wonder if you could make a flux capacitor?”\n“No comment.” Tony started the car and pulled out of the parking space. The dog’s bobblehead veered to the left. “So, you work a lot of double shifts?”\n“Ah yes,” she said. “Well, you’ve met my nephew. He’ll be off to college before you know it. Knowing him, an expensive one. That boy can’t stop getting straight A’s.” She made her voice sound exasperated, but the look of sheer pride in her eyes gave her away. “So I’m making sure we have the money in the bank.”\n“Your husband…?”\nShe shook her head. Tony knew not to ask any further. “The kid might get a scholarship,” he suggested. Because getting straight A’s at a STEM school? Not exactly plain sailing. More like sailing through a hurricane on a raft made of cheese. The French type of cheese that breaks apart if you even look at it too hard.\n“He might,” she agreed, settling into her seat and closing her eyes. “I think he’s aiming for one. But I don’t want him to feel like he needs one. I don’t want him to feel like his only shot at getting into a good university is by getting the scholarship, because he has plenty of responsibilities on his shoulders already.”\nTony hummed non-committally.\n“What did you think about those emails he sent you?”\n“What emails?”\nShe frowned without opening her eyes. “Your research about solar – something. Sunbeds? No – surely that wasn’t it. Either way, he read something on your website and wanted to email you about it. He was pretty excited.”\n“Solar distillation. Huh. I don’t remember receiving an email, but those usually get filtered out at the Front Office. For an email to make it to me it has to do whatever is the email equivalent of climbing Mount Everest on stilts. Peter hasn’t mentioned anything about it.”\n“Did you publish the research, yet?”\n“No. Some scientist I had never heard off sent me a few notes that were interesting, so I’m pretty much reworking the whole thing. I’ll talk to Peter about it, Saturday.”\nShe opened her eyes and smiled. “Were you planning to visit?”\n“I drop by the café now and then. To keep him out of trouble. Kinda like a … parole officer meets guardian angel. I was there last weekend.”\n“He told me. I hope you will see him this weekend because Peter, for one, is pretty sure that he is about to lose his job.”\nTony frowned. That couldn’t be right. “Why?”\n“I don’t know exactly. Something about a sudden change in ownership this week. Peter got an email about it. It just said that they would sign his new contract on Saturday, but I think he’s wary that there’s a catch. They renamed the café GoaTea. Tea, like T-E-A  tea.”\n“No kidding,” Tony said. “Do you think I’ll get a discount because I have a goatee?”\n“It’s worth a shot,” she judged.\nWhen a short silence fell, FRIDAY jumped into the conversation. “Boss. Mr. Barton would like to know your ETA. He has an urgent matter to discuss with you.”\n“This urgent matter had better not include the word ‘night’ or ‘monkey’,” Tony warned.\nA stifled laugh escaped May. Tony glanced aside to see her press her hand against her lips. “What?”\n“Nothing,” she said a little too quickly, her eyes sparkling with mirth.\nTony groaned. “You saw those comics, didn’t you?”\nThe half guilty, half mischievous look on her face said it all. “I’m sure whoever made them is really just a big fan,” she assured him. “You know, mockery is the sincerest form of flattery.”\n“That’s… not the saying, Miss Parker.”\nThey reached the front door to May’s apartment block about fifteen minutes later. It turned out, Peter lived just down the street from the café where he worked – the café Tony now owned. The façade had been repainted. Large letters above the door spelled out ‘GoaTea’.\nMay opened the car door, then paused for a moment. “Do you want to come in for coffee or something? Say hello to Peter?”\n“No, that’s okay. Tell him I’ll see him Saturday. And, uh, tell him not to worry about that job. I have a good feeling about it.”\n \n\nPart II: Maria Howard\n\n \n“Pepper, what I’m about to suggest might upset you.”\nPepper responded with all the dignity and grace you could expect from a Stark CEO: she blew a raspberry at him.\n“If only our board members knew what you were like behind closed doors,” Tony lamented, leaning against her office door. “They’d have so much more respect for me.”\nShe sat forward in her chair. “Just lay it on me, Tony.”\nTony cleared his throat and took a seat, too. “You remember the kid from the café?”\n“Peter Parker,” she said. “He’s signing his new contract today.”\n“Right. – Did you double his salary?”\n“Tripled it, actually.”\nTony nodded, rubbing the back of his neck. “Good. Good.”\nShe narrowed her eyes. “Spit it out, Tony. What – you want to adopt him? Clone him? Make him the sole heir of Stark Industries?”\n“All in good time,” Tony said with a half-smile. “For now, I wanted to set up a college fund for him. I met his aunt at the children’s hospital this week. Real good, hardworking woman. They certainly aren't living the high life. And the kid’s supposed to be smart. I mean, he never really seems that smart when I talk to him, but I guess I never really seem smart when I talk to you, so who am I to judge?”\nPepper cracked a smile at that. “That’s it?” she said. “Over Christmas, I came home to find a donkey in our living room and you didn’t even bat an eyelid; but you want to do something as simple as set up a college fund, and you get all bashful about it?”\nShe had a point. Tony frowned down at his hands as he tried to figure out why he felt so strangely self-conscious about his latest crusade. “Well the donkey was… First off, in my defense, I thought it was a reindeer -”\n“Not a great defense.”\n“- and I just wanted to bring about that real Christmas spirit. While this thing is… To be honest, I don’t really know what this thing is, and I suppose that makes me apprehensive.”\n“You’re troubled by your ability to care about another human being,” Pepper deducted.\n“Astute, if a trifle harsh. I’ve just been in a strange mood lately, I think.”\n“Tony,” she said in a gentle voice. “You’ve been in a strange mood for as long as I’ve known you. So would you like me to set this up through MIT?”\n“No,” Tony immediately said, because he had actually thought this part through. “He’s only fifteen. I don’t want to limit his options in picking the university he wants. Can you contact Mrs. Whatshername over at Global Scholarship Grants? And let’s make sure to do this anonymously.”\nPepper gave him a long look at that, her head slightly cocked, as if she wasn’t looking at Tony, but at one of his abstract paintings that she wanted to figure out. “You should introduce me to the kid sometime,” she then said as she turned and opened her laptop. “It’s funny how much your life revolves around him. And you don’t even want him to know it.”\n“I don’t want him to think I’m some creepy stalker,” Tony said.\n“Because secretly pulling the strings in a kid’s life from behind the scenes isn’t creepy.”\n“I don’t care about being creepy. I just don’t want him to think I’m creepy.”\n“Spoken in true Tony Stark fashion. So the donation won’t be in your name, then?”\n“No. Let’s call him… let’s call her… Mrs. Maria Howard.”\n-\nTony didn’t often use the term ‘perfect’ for anything, but the new, secluded booths in the back of GoaTea were damn close. A row of plants shielded him from the rest of the café. He could spy on everyone else, but no-one could see him.\nArguably the best way to be in public.\nToday, he was particularly fascinated by a stoic-faced girl, Peter’s age, who sat in a booth near the window. Peter’s awkwardness seemed to skyrocket around her, which was interesting, because Tony thought he had already seen Peter at his most embarrassed.\nShe had ordered a milkshake and was casually sipping at it as her dark eyes constantly followed Peter around the café. Judging from the slight blush on Peter’s face as he took orders, he was aware of the scrutiny.\nPeter arrived at his table with a notepad and a lopsided grin. “Hi, Mr. Stark. MJ says there’s a creep staring at her from behind the bushes.”\nOkay, maybe Tony wasn’t as completely hidden as he had thought. “Sorry. That your girlfriend?”\n“No? I mean – maybe. Uhhh… I mean yes.” Peter visibly cringed at his own awkwardness. “YES. God, please don’t tell her I said ‘maybe’.”\nThis kid was more amusing to watch than most late night TV hosts.\nTony glanced towards the matronly woman behind the counter that Pepper had apparently hired. “What about her? She’s new.”\n“Yeah. Don left. Super of the blue. I mean – it’s a not a surprise, he didn’t seem like he enjoyed his job. But still. And now Laura is kind of running things around here. She’s cool. And I’m actually getting paid properly.”\n“So that’s good, right?”\n“It might be,” Peter agreed. “Just wary about what’s going to happen next. Waiting for Parker luck to strike.”\n“What’s Parker luck?”\n“The kind of luck that has you mistake a billionaire for a homeless guy and then throw up on his shoes. Coffee?”\n“Sure. Hey - your aunt said something about you emailing me?”\n“Huh?” Peter said, tearing his eyes away from his notepad.\n“About my research on solar distillation?”\n“Oh – the… yeah, the solar distillation,” Peter said, once again blushing. Honestly, he might as well just paint his cheeks red at this point. He already seemed to be almost permanently in a state of embarrassment, anyway. “That… That was nothing. Did you publish it, yet?”\nIf only. Tony had been ready to get his work published when a certain Dr. Parker Benjamin emailed him out of nowhere with a whole array of insightful comments and interesting ideas that would significantly improve his research project.\nIt was all kinds of terrible.\nHe had sent Mr. Benjamin a simple reply: Was interested to read your notes and would like to include them in my paper. All with due credit, of course. Can we hop on the phone? –Tony Stark.\nThe response had been nothing but a deafening silence.\n“I’m close to publishing it. Just trying to include some new comments I received recently, but the person who sent me the comments is not responding to my email.”\nPeter suddenly smacked himself on the forehead.\n“What?”\n“Damn. I mean – nothing,” Peter said. “Just realized I forgot something, but it has nothing to do with this. Go on.”\n“I think I’ll wait a few more days and then I'll use other methods to trace him down. Maybe show up at his doorstep unannounced.”\n“Sure, uhuh, sounds good. Let me get your coffee,” Peter said, before rushing away.\nTony leaned back in his seat and grabbed a menu to study it. Pepper had really outdone herself. Or maybe this was all Laura’s work. Judging by the extensive list of lunch options, she was a stellar cook. The pesto tortellini pasta salad looked particularly good.\nAt the bottom of the menu was a tiny, framed message. For every 20 cups of coffee sold, GoaTea donates one free cup of coffee to the homeless.\nCute.\nHumming under his breath, he took out his laptop and opened it. Why not do a little work in the café that he officially owned? He had noticed the endless supply of young men and women, sitting around at cafés with their laptops and their mocha lattés and their hippie sweaters and their overly large glasses. It was high time to see what all the fuss was about.\nHis phone chimed.\nWow. Speaking of the devil. He had received an email from Parker Benjamin. Hello Mr. Tony Stark mister Iron Man sir, it read. No need to credit me, just use the notes in your paper as you see fit. -P. Benjamin.\nTony frowned down at his phone. What the hell? He tapped the reply button. Not acceptable. He wrote. All contributions merit authorship credit. He hesitated for a moment as he considered what else to write. He didn’t understand why this was such a big deal. It wasn’t as if they were exposing state secrets. Just let me include your name, university and field of research. He activated voice command on his laptop. “FRIDAY, find a Dr. Parker Benjamin, US based, who specializes in the field of clean energy.”\n“Processing. Stand by,” FRIDAY said, before reporting: “No results found.”\n“Canada based? UK, Australia?”\n“Among closest hits are a Dr. Benjamin Perker working at the Clean Energy Technology Network in Missouri, or the Irish Dr. Caroline Parker-Benjamin specializing in mesoporous materials for clean energy technologies.”\nSpectacular.\nHe put his phone down on the table with a sigh, leaned back and surveyed his surroundings for a while. Peter was sitting with MJ, both of them peering intently at the screen of his phone.\nProbably on Instagram, Tony thought, a little chagrinned.\nPeter jumped up when Laura slid a cup of coffee across the counter, and left his phone in the hands of his girlfriend as he grabbed the order.\nTony waved his phone in the kid’s face as soon as he was close enough. “FIRDAY can’t find a Dr. Benjamin anywhere. I think it might be a fake name!”\n“No kidding,” Peter said, carefully setting the cup down. “Would you like something to eat, too? They took donuts off the menu, but we got a great selection of muffins.”\n“Banana cinnamon?” Tony asked. He dropped his eyes back down to his phone when it chimed again. He sat up. “Whadduya know. Dr. Benjamin replied again. He’s awfully talkative, suddenly.”\n“What does it say?”\nTony opened the email and read out loud: “Listen, Inspector Gadget, it’s not hard: either include my notes or don’t. Now leave me alone. - - Well that’s just rude.”\n“That is rude,” Peter said, his eyes flashing. “Let me go get you that muffin.”\nHe marched back to the counter and, inexplicably, punched his girlfriend in the shoulder on his way. She sent him a lazy smirk in return, then turned her gaze towards the plants Tony was hiding behind. Tony quickly dropped his eyes down to the screen of his laptop.\nIt didn’t help. She came over anyway.\nThe table wobbled as she sat down in the booth opposite him. She set her milkshake down between them like it was a recording device, and gave him a hard, long stare. Then, she began her interrogation with: “So what’s your deal?”\n“Hm?”\n“Why’re you hanging out at this café when I’m sure you have around seven private restaurants of your own, one for every day of the week?”\n“I like to be among the people.”\n“Is that why you’re hiding behind these plants like a flasher waiting for his moment to shine?”\n“Touché. So, you’re Peter’s girl?”\n“No. He’s my boy. Don’t change the subject. Why are you hanging around here? It’s not because you…” she slowly swayed her head back and forth a little, “…I don’t know; know certain things you’re pretending not to know?”\nTony leaned forward and rested his chin in one hand as he intently stared back at her. “Like what?” Was this girl implying she knew he was the new owner of this café? No, she couldn’t possibly. This secret identity thing was already making him paranoid. He wondered how Spider-Man did it.\n“I don’t know,” she said, bringing the straw of the milkshake to her lips again. “Surprise me. What’s the biggest secret you know?”\n“I assure you that not one of my top ten biggest secrets has anything to do with this café.” Big fat lie. “Or with Mr. Parker himself.” Even bigger, fatter lie. “But I am enjoying this GDR-style interrogation.” That one was partially true. She was amusing, if somewhat mystifying.\n“There you go, Mrs. Albasiny,” Peter’s voice sounded. “I’m going to put the two of you right here so you can keep an eye on MJ over there. She’s trouble.” Balancing a tray on one hand, he used his free arm to guide two elderly ladies to a booth near Tony’s one, sending him an apologetic grin on the way.\n“Oh – are you two a couple? Oooh, that’s adoooorable!” One lady said as she sagged into her seat. “She’s such a pretty little lady!”\nFor the first time, MJ looked slightly awkward. “Don’t set old ladies on me, Parker,” she quietly hissed when Peter came over to set a muffin down in front of Tony.\n“Don’t bother my customers, Jones,” Peter shot back, pointing his thumb at Tony.\n“I just bet Peter is a wonderfully romantic young man,” the other lady said loudly as she unfolded a napkin.\n“Not in the slightest,” MJ proclaimed, leaning over to look at them. “He broke off our first ever kiss because he needed to check his Instagram.”\n“I’m not on Instagram, you’re on Instagram!” Peter blurted as his eyes widened with unexplained panic.\n“Settle down, Beavis,” MJ muttered.\n \n\nPart III: Nescio\n\n \nSpider-Man was exactly where Tony expected him to be: lounging on top of Queens children’s hospital.\n“Who let you up here?” Spider-Man asked when he caught sight of the two Avengers approaching him.\n“Oh, the hospital staff treat Steve and myself as one of the family,” Tony said. “We’re always here. Reading to sick kids, cashing in karma points.”\n“Such benefactors,” Spider-Man said. He got to his feet. “Are we going to fight a half-robot again?”\n“No shenanigans today,” Tony said, waving at Rogers and himself as a way to point out that they were not dressed for a mission. “Take a day off, Ferris Bueller.”\n“Then why are you both here?”\n“I’m here because I made some tech I want to share with you,” Tony said, before jerking his head at Steve. “Rogers is here because he likes to feel relevant.”\n“I’m here because I have a proposition from the Avengers,” Steve said with a half-smile. “Stark is here because he’s a bit of a control-freak when it comes to you.”\n“Oh,” Spider-Man said, his voice full of anticipation. “What proposition?”\nTony delved into an inner pocket and took out the smartwatch he had finished developing this morning. He held it out to Spider-Man.\nThere was some hesitation in the kid’s movements as he stepped forward to take it. “What is it?”\n“A way to call for help. If you ever run into any trouble, if you ever get hurt and you need back-up, you can activate it. There is a panic button that’s directly connected to our headquarters.”\n“Is it also a way to track me?” Spider-Man asked sharply.\n“If I wanted to know who you are and where you live, believe me, I’d already know it,” Tony said. “I’d run an algorithm on Spider-Man’s behavior, predict the location of your domicile with an accuracy of 72 percent, obtain security footage from all cameras in that area, run facial recognition and juxtapose the results against the times and places of Spider-Man sightings and KAPLOW!”\n“Wow. That’s … oddly specific.”\nTony waved a hand. “I think I already made it clear last time that I feel much more comfortable not knowing who you are.”\nSpider-Man looked down again, and ran his fingers along the edges of the watch. “It is useful, I suppose. If there’s a major Avengers-level threat going down, and you need my help, you can reach me.”\n“It won’t be used for that,” Steve warned him. “We’re simply giving you a way to ask for help when you need it. For us to help you; not the other way around.”\nSpider-Man lowered the watch, his whole posture suddenly screaming resentment. “So – what, you’re essentially giving me a baby monitor? Think I can’t hold my own out here?”\n“It’s nothing to do with that, son,” Steve said, hesitating. “You know what you’re doing, and you can handle a fight, I’ve seen that. But I don’t want to shoulder the responsibility of… well…”\nSpider-Man’s shoulders slumped in resignation. “You think I’m twelve years old, too, don’t you?”\n“You told Tony it was fifteen.”\nSpider-Man turned his head to Tony, who could practically feel the glare, although it was hardly impressive from behind those stupid swimming goggles. “What?” Tony said. “Was that a state secret?”\n“No, it was our secret.”\n“That’s cute. I don’t even know your name, but we’re sharing secrets now?”\n“Just keep that,” Steve said, with a nod at the watch. “Whether you use it is up to you. But at least you’ll have it.”\n“Sure,” Spider-Man said and then, apparently remembering his manners, added: “Thanks for looking out for me.”\n“Likewise,” Tony said. “I would probably be a red-and-gold pancake if it weren’t for you.”\n“I like pancakes,” the kid said randomly, and Tony loved him a tiny bit more right then.\nHe turned to Steve. “I need a minute with the kid. I’ll see you at home.”\nSteve didn’t even look surprised. He just gave another regal nod to the both of them, then turned away. Tony gazed after the man as he marched back to the roof door and let it fall shut behind him.\nHe turned back to find that Spider-Man had moved away from him and had sat down at the edge of the building, facing the large mural painting, letting his legs dangle over the edge. Tony approached him, sitting down by his side.\nIt stayed quiet for a moment.\n“You know, if you wanted to know who I am, I think I would just tell you,” Spider-Man then said.\nTony floundered for a moment. The kid had never made an offer like that before. “Really?”\n“I don’t know. I’ve been thinking about it. But you said you didn’t want to know, so…”\nTony glanced Spider-Man up and down. The skinny legs swaying back and forth, heels bouncing against the side of the building, the hands fumbling in his lap, the slouching posture that couldn’t possibly be comfortable. He reminded himself once again that there was an actual teenager under there, who lived and breathed and had thoughts and probably worried about homework and girlfriends or boyfriends. Someone who could maybe use a mentor. “Give me a few days to think about it, okay?”\n“Okay.”\n“The secret identity thing can be a bit of a drag, right?” Tony said. “I’m wrapped up in one, too. Maybe more than one.”\nSpider-Man cocked his head. “Tell me more, Hannah Montana.”\n“I won’t bore you with the details.” Tony leaned back on his hands and glanced up at the colorful mural painting he knew so well. “What is it about this painting you like so much?”\nSpider-Man slowly rocked back and forth, as if he was debating whether he should answer the question. Finally, he lifted a hand and pointed. “I can see my uncle. The smiling figure on the far right.”\nTony cocked his head and squinted. The main reason why he loved abstract art, was that everyone could see themselves reflected in it somehow. “I see. You get along with him, then?”\n“Yeah,” Spider-Man said, lifting his shoulders for a moment.\n“Well,” Tony said, trying to keep his voice light, “as someone who has no real family left to speak of: make sure he knows it.”\n“Yeah,” Spider-Man said again, his chest lifting and deflating with a deep sigh.\n“Do you want a copy or something?” Tony suggested. “Because I was serious last time; I can get it done for you.”\n“I don’t think you can,” Spider-Man said in a rather matter-of-fact tone.\nThe artist’s name Nescio might seem mysterious to anyone who had ever tried to google the painting, but it wasn’t a mystery to Tony. He had been into art from a young age, and had always favored colorful, abstract paintings. Having more money than he could possibly spend in a lifetime, meant that he could afford to have some of the worlds finest art hanging from his walls. It wasn’t until about five, maybe six years ago that he started to show his own work to other people. Just Pepper first, and then, with some of her encouragement, to some friends who had an eye for art. One old colleague who worked in local government now, asked him if he would be interested in having one of his painting replicated in a mural they wanted to paint opposite the children’s hospital of Queens.\nTony had agreed, under the condition that he could sign it with a pseudonym. He didn’t want to run the risk of art connoisseurs everywhere mocking him. At the same time, he had agreed out of some sense of self-importance. Having your painting up here for the world to see… well, it certainly stroked his ego. He hadn’t fully realized until recently that his painting might actually mean something to other people. Something to cheer up the kids when they looked out the hospital windows.\nHe didn’t know why he didn’t just tell Spider-Man about it. Maybe it was something to do with how Spider-Man insisted on hiding his name, address, face, the whole kit and caboodle. So Tony figured he was allowed one little secret of his own.\n-\nNowadays, Tony’s Saturdays were all exclusively reserved for one activity: hanging out in the back of the café he owned and pestering Peter about his job, his grades and his girlfriend.\nPeter didn’t ever seem to mind, always humoring him with a gentle smile and patient responses. Tony couldn’t fathom why. As far as he was concerned, his own behavior was entirely ridiculous from start to finish.\nThen again, he had nothing better to do, so what the hell.\n“What about your paper on solar distillation?” Peter asked, after he had finished giving Tony a satisfactory rundown of the essay he was writing.\nTony gave a helpless shrug. “Dr. Benjamin is still acting like he’s the damn Spider-Man of the science world, and he has no reason to. It’s not as if we invented time travel. We’re slightly altering the design of solar stills, that’s all. What do you think I should do?”\n“Just publish it without putting his name,” Peter suggested. “He said he was okay with it.”\n“Maybe I will. Thing is, the way he is avoiding me feels a little suspicious. Like he’s waiting for me to publish it, so he can claim I plagiarized his work without his consent, and then sue me for a billion dollars.”\n“Oh, I’m sure he won’t.”\n“You’re too trusting, squirt,” Tony informed him. “Newsflash: People are evil.”\n“You don’t really think that.” Peter said. “You wouldn’t work so hard to save people all the time if you did.”\n“You’ve got me on a technicality,” Tony admitted. “What about you? The café is running just fine, right?”\n“Sure,” Peter said. “The regulars will keep coming.”\n“But…?” Tony asked, because he sensed that there was one.\n“It’s like this,” Peter said. “Some guy called Mr. Edward is the new owner, but no one has ever seen him. People just whisper about him, like he’s the phantom of the opera. I don’t know his deal. Laura’s a really good cook and she’s got amazing social skills and all. But she just wants to stuff people full of her homemade cakes; it’s like her life’s mission. She’s not gonna be doing the PR for this place. Like, posting pictures on social media, or sending newsletters or organizing promotion contests. And I don’t see anyone else doing it, either. Which is a problem, I think. These days, if you don’t exist online, you might as well not exist at all. GoaTea is basically stuck in the stone age.”\n“Hm,” Tony said, frowning thoughtfully. “So you need a Facebook page?’\n“We’re better off using Instagram,” Peter said. “Instagram is visual. So is food. We need to upload loads of pictures of coffee and pie, the kind that make you drool all over your keyboard. Preferably with funny puns, like… ‘It’s Tea o’clock!’.”\n“You’re on Instagram, right?”\n“Uh,” Peter said, suddenly blushing heavily. “No.”\n“Your nose is growing, Pinocchio. What, your profile is a bunch of mushy pictures of you with your girlfriend?”\n“I’m not on Instagram,” Peter insisted.\nIt didn’t really matter, so Tony let it slide. “What about the other one? Uhm – Twitter?”\n“Meh,” Peter said, making a wibbly-wobbly gesture with his hand.\nA shadow fell over their table. “Hey,” the shadow said.\nTony glanced up and sat back in his seat. “Mrs. Flanigan, always a pleasure.”\nJennie looked back at him, a little blearily. She looked worse than last time.\n“You okay?” Peter chimed in.\nShe shrugged, picking at a lose thread in her scarf. “I’m having one of those days, you know.”\n“That’s okay,” Peter said gently. “Why don’t you find a seat? I’ll bring you a cup of tea and we’ll talk about it.”\n“Don’t want to talk about it.”\n“Just tea, then,” Peter concluded.\n“Have a seat,” Tony suggested, pointing at the other side of the booth. “I cold use your advice on a few things.”\nShe sat, her large coat puffing up around her. “I need to tell you something,” she said, dropping her voice to a conspirational whisper. “I’m not actually the head of some university.”\n“Huh. No kidding,” Tony said.\n-\nTony should have known he wouldn’t be able to come to the same café every Saturday, moving around among the general public, without anything ever going wrong.\nAnd bad luck always comes in threes.\nStrike one was the rude man claiming to be a fan who spotted him when he passed their booth on his way to the toilet. He lingered near their booth, no matter how many hints Tony dropped that he didn’t want to be crowded, and kept asking questions about chitauri aliens and wormholes. The type of questions that made Tony’s anxiety spike even on a good day. The man didn’t leave until Tony decided to screw professionalism and told him to “just get lost already”.\nStrike two was the warning message Happy sent him ten minutes later, that some passerby had posted a picture of him in the café on Instagram. Fucking Instagram. Tony’s feeling of unease increased.\nStrike three was the stampede of photographers that invaded the café less than five minutes later, as if summoned by the devil.\nJennie responded to the invasion by promptly lowering herself to the floor and hiding under the table. Honestly, Tony wished he could do the same. But that wouldn’t do much for his reputation that was already shoddy at best.\nStay calm and address them politely, Pepper always said. But as Tony pushed himself to his feet unsteadily, he was feeling that pressing weight on his chest and that numbness in his hands, which he recognized as the tell-tale signs of an all-consuming panic attack brewing in his mind like dark storm clouds.\nCameras flashed and people shouted questions that may as well have been in Hebrew, and Tony could see even more photographers gathering near the door, cutting off his escape route.\nA firm, steady hand grabbed his arm. Peter. “Tony, run!” he urged, and then he was pulling him along through the sea of paparazzi. It seemed like there were hundreds of them now, arms brushing against him, someone tried to trip him, Peter pushed back and snarled. They were in a small room with piles of dirty dishes. A narrow hallway past a kitchen. People were still following, and Tony could feel his heart skip into overdrive. His chest ached from it. It was the only thing he could still feel. That, and Peter’s hand around his arm, leading him on and on.\nPeter pulled him outside into an alleyway littered with garbage bags. He slammed the door into the face of one of the photographers and took out his key, turning it in the lock. “Come on,” he said, grabbing Tony’s arm again. “They’ll try to go around.”\nTony didn’t ask where they could even go. He just needed to breathe right now. Breathe. There were street tiles and a rat scurrying away and more doors and stairs and a fire extinguisher against the wall and plush carpet. They were inside again, Tony realized.\nPeter’s hand left his arm, which Tony took as a sign that the kid considered them to be in safe territory. Tony trusted him to be right, and let himself slide to the floor, his back pressed against the wall.\nHe could tell by Peter’s animated gestures that the kid was talking to him, but he didn’t register any sound. Just blood rushing in his ears. His body was strung with tension, so much so that every single muscle was hurting.\n\nMy meds.\n\nHe didn’t get these attacks as often as he used to, but he had still badgered Dr. Cho until she had signed of on some killer sedatives that always worked like a charm.\n“Water,” he rasped. He didn’t hear his own voice, but something must have come out, because Peter left and returned with a glass. Tony dug through his pocket to fid the pills and took two, just in case.\n-\nA door slammed. Tony grumbled. He didn’t want to get up yet. He didn’t have to, did he? Did he have any meetings today? Today was… wedntuesday, right?”\n“Oh, damn, you woke him up!” a voice said.\nHe then heard a female voice. Pepper, he thought. He was supposed to tell her something, but what? He couldn’t remember now. It had been something important. He opened his eyes and blinked a few times, but the world remained dark. Were those Pepper’s footsteps, coming closer?\n“Did you invite a drugged-up homeless guy into our home again?” Pepper asked.\nTony frowned at the strange question. But before he could formulate a reply, the other voice said, from somewhere to his left: “No, May. That’s Tony Stark.”\nHis blanket was pulled down and everything wasn’t dark anymore. The world was still blurry, though. “Oh, excuse me,” Pepper said, her voice a drawl. “Did you invite a drugged-up Tony Stark into our home?”\n“He took some prescription for his anxiety. He’s just a little loopy. You gotta let him sleep it off.”\n“Pepper,” Tony muttered, suddenly remembering what he was supposed to tell her. “We gotta, uhm, make social media accounts for the café. Because if you don’t exist online you might as well not exist at all.”\n“Ignore him,” the voice said. “He’ll be fine in an hour and then I’ll feed him some dinner, maybe put him in front of the TV.”\n“So you’re not going on patrol this evening, then?”\nA short silence fell. Somehow it felt tense.\n“Oh, relax,” Pepper then said. “Don’t give me that look. He’s clearly not going to remember any of this.”\n“Pepper,” Tony insisted. “We need Instagram. It’s the future. GoaTea is stuck in the stone age.”\nAnother blurry blob of a person moved closer to him. Someone short and slender. Tony wrecked his brain trying to remember who it was. Did Pepper hire a new assistant? “It’s not your café, Tony,” the voice said. “You don’t need to worry about any of that.”\nThe voice was kind and soothing, but Tony still frowned, because something was not right, there. “What do you mean? You took care of it, right? Uhm – when you sent that letter to Human Resources?”\nHe heard a sigh. “Go back to sleep, Tony,” the voice murmured, and a hand patted his blanket.\nTony did.\n-\nTony emerged from the pleasant haze of his sedatives to find himself in a small, somewhat chaotic apartment. He was lying on a couch, covered with a blanket and surrounded by tiny pillows that almost exactly did not match.\nMay Parker was sitting at the dining room table, peeling a potato. Peter was nowhere in sight, but Tony became aware of the sound of a shower running somewhere.\n“Wha’time izzit?” he croaked.\nShe glanced at him. Her whole composure was casual, as if Peter bringing random people back to the apartment to crash on the couch was a common occurrence around here. “A little past six. Want to join us for dinner?”\nTony sat up, roughly rubbing his face for a few seconds. He could still feel the tightness in his neck and shoulders, and the buzz of anxiety in the back of his head. But he had made it out without punching any journalists in the face.\nRealizing May had asked him a question, he looked back at her. “Sure. If it’s no trouble.”\nShe merely nodded, before pointing at the phone on the table in front of her. “Your phone went off a few times. Someone named Happy. But we didn’t answer.”\n“I’ll let him know I’m not dead,” Tony mumbled. He pushed himself to his feet and made his way to the table on wobbly legs, before sagging down in a chair with a deep sigh.\nMay studied him across her pile of potatoes. “I know it’s the American way to try and fix everything with pills. But honestly, sometimes those things do more harm than good. You’d do a lot better with some breathing exercises.”\nDr. Cho had suggested the same thing. Tony hadn’t exactly thanked her for the advice. He just wanted the drugs. But he couldn’t let himself be as rude to May Parker as he had been to Dr. Cho, that day. “Maybe,” he allowed.\nAnxious to get off the subject, he picked up his phone. He winced at the nine missed calls from Happy. None from Pepper, though. That meant the situation was salvageable. He dialed Happy’s number.\n“Tony?”\n“You’re the worst head of security ever,” Tony accused.\n“I can’t secure you if you insist on gallivanting around Queens on your own every Saturday!” Happy argued. “And I did warn you someone had clocked you on Instagram. Where the hell are you? The news says you were kidnapped by a teenager who has connections to some drug lord.”\n“Surprisingly accurate.”\n“What does that mean?”\n“Look, I’ll be home later this evening, okay? The drug lord was kind enough to invite me to dinner.”\nHappy didn’t even balk at that. “Do you want me to release a statement to the press?”\n“Tell them the next time they gang up on me, someone‘s gonna die.”\n“I’ll run that by Erin, first,” Happy muttered.\nPeter emerged from the bathroom ten minutes later, toweling off his wet hair. “Hey,” he said, grinning brightly. “You’re awake. How are you feeling?”\n“A bit like I was trampled by a herd of cows.”\n“We were almost trampled,” Peter agreed. He hung the towel over the back of his chair before sitting down in it.\n“Did you contact your boss about this whole shitstorm?”\n“Yeah. Laura was cool about it. Said it’s probably good publicity.”\n“And Jennie?”\nPeter seemed to appreciate that question a lot. “A little shaken, but fine. She can stand her ground.”\nBetter than Tony, clearly. He tried not to feel too bad about that. You’re allowed to not be okay, sometimes, Pepper always said.\n“No double shift today?” He asked May.\nShe straightened her back and her eyes brightened. “I’m taking a break for those for a bit. Peter got a full scholarship from a foundation we had never even heard of. Paid by some lady we don’t know at all. For whatever university he decides to go to!”\nPeter ducked his head, looking quietly pleased.\n“No kidding,” Tony said, his eyes drifting to Peter. “What do you want to study?”\n“Chemical engineering. MIT, I hope.”\nTony approved.\nThey had chicken with mashed potatoes, and for dessert May fed him something that people in the middle ages probably used to fortify their castle walls, but that she claimed to be ‘walnut date loaf’.\nPeter ate the whole thing and told May it was delicious, so Tony did the same.\n“I guess you won’t be coming to the café for a bit?” Peter asked. He looked disappointed at the prospect, which warmed Tony’s hart.\n“Probably unwise,” he agreed. “But maybe you want to come to the tower sometime? I can give you a tour of the workshop, or Dr. Banner’s lab. He studied chemical engineering, too. He studied everything.”\nPeter’s mouth dropped open, his eyes widened comically and his ears turned red again.\n“That’s how his face looks when he is excited,” May assured Tony, and Tony laughed.\nHe helped May do the dishes after dinner and, after studying the dark street for a while from behind the curtain to make sure he would make it to his car without getting accosted by anymore paparazzi, he finally said his goodbyes.\n“We’ll set a date soon, kid,” he told Peter, who fervently nodded in response. “And thanks for the walnut date loaf, May. It was… yeah, bye.”\n \n\nPart I: Three confessions \n\n \nPeople often assumed that Tony had to be a prime example of unbearable hubris and narcissism, constantly surrounded by people who told him how great he was. How people could possibly draw that conclusion was beyond him. He was married to Pepper and rooming with the Avengers. Caustic comments abound. And even most of his staff was insubordinate, even on a good day. Pepper hired only people who were the very best in their field, meaning every single one of them could find another, possibly even a better job at the snap of their fingers. Tony Stark generally needed them more than they needed Tony Stark.\nExhibit A: Dr. Cho, whose stern and unimpressed face was currently filling one of the screens in Tony’s workshop as he brabbled through an explanation on how he might do better with some breathing exercises, after all.\n“Do you mean,” Dr. Cho said with wonderful restraint, “the kind of breathing exercises I suggested to you over a year ago? When your response was: ‘go stick your head up a dead cow’s ass and just give me the meds’?”\nAll right, so maybe Tony could be a little unbearable at times. “You know, I’ve always liked you, Helen,” he started.\n“I’ll pass a few leaflets on to you,” she cut in, her voice perfunctory. “I suggest you get in touch with a therapist to make full use of them. I’m not an expert on PTSD.”\nTony resisted the urge to tell her to stick her head somewhere, and nodded politely.\nMinutes later, he was frowning down at a leaflet that gave step-by-step instructions on breathing through an anxiety attack.\nFittingly, Clint Barton chose that moment to stroll into his workshop, his bow in one hand, his phone in the other. “Stark. I got something important to show you.”\n“Please tell me it is not an Instagram post.”\n“It is definitely not an Instagram post.”\nIt was an Instagram post.\nWell, this one was kind of funny, Tony would admit that. And it wasn’t even terribly insulting.\nThe comic had only two panels, which was also new. Apparently, NightMonkey was moving into a new style period like Picasso going from blue to rose. Or maybe something less pretentious.\nThe left panel showed an infuriated Tony Stark holding a cup of coffee in one hand and a muffin in the other, surrounded by paparazzi all shouting inane questions. The right panel showed an utterly relaxed Tony Stark surrounded by ‘mamarazzi’; a group of plump women all strangely reminiscent of GoaTea’s new chef, Laura. They were feeding cartoon Tony Stark cookies, patting his head and making cooing noises.\n“Mildly amusing,” he concurred.\n“Meh,” Clint said. He turned the screen of his phone back to himself and glanced down at the comic. “It doesn’t make you look like an idiot, so I’ll have to mark it down for that. But I’ll repost it anyways.”\n“I notice you haven’t made a single joke or scathing remark about my full-blown meltdown at GoaTea last weekend,” Tony said. It was telling. For Clint of all people to consider something off limits to joke about, he had to be genuinely concerned about Tony’s mental sanity.\n“This is me joking about it, isn’t it?” Clint said, waving his phone.\n“That’s not you making a joke. That’s you clicking a single button on Instagram. Ten points for laziness, zero points for style.”\n“Maybe I made this comic.”\n“Yeah, but you didn’t, though.”\nClint gave a challenging smirk. “Did too. You don’t know who owns that account. I suppose there’s no better time to reveal; it was me all along. All part of a long, elaborate prank.”\n“You know FRIDAY can trace the actual IP address for that account in about three seconds, right?”\n“So trace it!”\n“For what? Just to see the name of some random American on my screen? I literally could not care less.”\nClint put his phone away. “You care. Whether you admit it or not, I got into your head.”\nTony made a show of sagging down in his chair with a disinterested face. “Anything else? Because I got a teenager coming over to visit any second now, and I don’t want his first experience in my workshop to be ruined by your presence, no offense.”\n“Offense taken,” Clint said. “I’m great with teenagers. And speaking of segues, I tried to shoot a teenager through the head this morning but the release of my bow didn’t trigger properly. So if you could have a look.” He held the bow out.\n “I feel like I should ask more about the teenager, first.”\n“Natasha and I were training. She set it up. It wasn’t actually a teenager, just a smaller-sized dummy.”\nAcross the room, Dum-E fired to life.\n“No,” Tony yelled, raising a hand to halt Dum-E’s movements. “He wasn’t talking to you. Keep your extinguisher in your pants, don’t even think about it!”\nDum-E whirred in disappointment.\n“I’ll take a look at it,” Tony told Clint, taking the bow. “Now, beat it.”\nClint did, but not before tapping repost on his screen with exaggerated motions and a superior sort of smirk.\n“I might just rework this bow so it fires backwards next time!” Tony called after him.\nAs if Clint would set up an Instagram account like that. Well, it would be just like him, actually. But that man didn’t have an artistic bone in his body; he certainly wouldn’t waste his time on drawing comics. Tony sighed and focused his attention on the bow in his hands. Because Clint didn’t get into his head. He didn’t.\nHe just didn’t.\nDamn it.\n“FRIDAY find the IP address behind that Instagram account.”\n“Please stand by. Analyzing account. IP address found.”\n“Who’s behind it?”\nFor the first time in her existence, FRIDAY didn’t grant him with an immediate response.\n“FRIDAY?”\n“I don’t know if I should say,” FRIDAY then said, and Tony almost tumbled out of his chair because his A.I. had never before made a comment like that.\n“FRIDAY!”\n“Are you sure you want to know?”\n“Well, before I could barely be bothered, but now you bet your artificial ass I want to know! What has you so secretive? Is it actually Clint?”\nInstead of telling him, FRIDAY simply showed her findings on the screen in front of him.\n“Oh,” Tony said.\nThe elevator doors slid open.\n“Hey! A bit late. Sorry,” Peter said, his face flustered as always. “My sweater got caught in the sliding door. They always say on the subway ‘stand clear of the closing doors’, and I’ve ignored it, and now the doors strike back.” He had taken off his sweater and balled it up, clenching it to his chest. He shuffled forward, glanced at the screen on the wall and evidently saw his own name there, because he smiled and asked: “were you googling me?”\nTony turned in his chair and stared up at him. “Do you like orange juice?”\nPeter frowned, puzzled for a moment. “Sure.”\nTony gave a nod and turned to move to the fridge in the corner of his workshop. The kid shuffled after him. Tony laid Clint’s bow on his workbench and turned on his soldering iron. He opened the fridge and reached inside for the orange juice, then turned and casually revealed: “I know all about your secret identity.”\nA beat of silence. “Um,” Peter said, bunching his sweater in his hands. “Which… which one?”\n“Which one?” Tony echoed, dropping the bottle of orange juice to the table. “Which one? Who are you, Banksy? Does he do Instagram on the weekends?”\nPeter had the gall to smile. Tony had seen everything and anything make this kid nervous, but now he smiled, all dimples and twinkly eyes. “Oh, that. Took you long enough to find out. Did you hack Instagram?”\n“FRIDAY took care of it in two seconds flat.”\n“Are you mad at me?” Peter asked with a look of wide-eyed innocence, though it was still plain and clear he was making an effort not to giggle.\n“Does Barton know it’s you?”\nPeter shook his head. “Him reposting the comics was a complete coincidence. Case in point; he first reposted my comic before you and I had even met.”\n“Then I’m not mad. Because I see ample opportunity to use this against him somehow.” Tony slid a glass of orange juice across the table.\nPeter sat down on the edge of the chair, still fiddling with his sweater. “I don’t know that I want to make Hawkeye my enemy,” he said. “I met him in the elevator, and the first thing he said to me was that he shot someone just my size through the head this morning.”\n“But making me your enemy is not an issue?”\n“Of course not,” Peter said with a smile. “You’re a big softie.” He took a few sips of his orange juice, and as he did, his expression slowly shifted into something Tony couldn’t really put his finger on. He was about to ask what was on the kid’s mind, when Peter spoke first: “You know what you should do? You should get FRIDAY to find the IP address for that Dr. Benjamin, too.”\n“The guy who commented on my research? I’d sort of given up on him.”\n“Find him,” Peter suggested.\nTony stared at him, a horrible suspicion brewing in the back of his mind. “FRIDAY?” he asked.\n“Processing … Stand by … IP Address found …. - Are you sure you want to know?”\nShortly after, the findings were presented on the screen, and then Tony’s worldview really tilted on its axis. He cocked his head. Rubbed his eyes. Closed them and took a steadying breath before looking again, but it was still the same name being displayed on his screen.\n“This is a joke, right?” he asked, even though he knew it wasn’t because FRIDAY never lied. “Did Barton put you up to this?”\n“It’s not that big a deal, when you really think about it,” Peter said. He was still fiddling with his sweater. He looked nervous, but more like he was concerned for Tony’s mental health than like he was worried about getting in trouble.\n“Right,” Tony said, his mind slowly falling apart into shellshocked shards. “Your generation obviously has a very different definition of ‘a big deal’ than mine. This coming from someone who once flew a nuke through a wormhole.”\n“I was nervous,” Peter explained. “I had been following your research for a while, and I was going to email you about that solar distillation. Then you turned up at my café that day, and suddenly it seemed weird to email you under my own name.”\nTony shook his head. Dazed. Astonished. “Look – no offense, but I’m still not convinced this isn’t some prank.”\n“Do you want me to talk you through my notes on solar distillation? My main point was, if you can harness the heat loss and use it for further distillation, there is less thermal loss and the overall efficiency is higher. I suggested using a cylindrical tube collector, because sun rays hit it at a different angle than if you used a flat tube collector, which means heat loss is reduced.” Peter started counting on his fingers. “The tube collector has an absorbing tube, and evaporating tube, an outer glass tube-“\n“All right, squirt, I don’t need to hear all the reruns from Bill Nye, the science guy. I believe you.”\nPeter snapped his mouth shut and lowered his hand. Then, he smiled a little and went back to sipping his orange juice while Tony stared at him and tried to make sense of what his life had become. “Kid, that’s… that’s PhD level science.”\n“You did most of the work,” Peter said. “I just had a good idea.”\n“Your good idea is going to save companies thousands of dollars. How did we never-… You do-… You do realize you’re a genius, right?”\n“Oh, I don’t think-“\n“Kid, don’t get freaking modest on me right now. Please just tell me, you do know you’re a genius, right? Don’t let this be one of those Rain Man scenarios where your talents have gone unnoticed by everyone and now I have to be the one to step up and fix it.”\n“I’m a straight-A student,” Peter said with a faint smile. “And I already got a scholarship. From some lady I had never even heard of. I think we’re good. I didn’t keep it a secret to mess with you or anything. I was awkward about bringing it up, you know?”\nTony realized now that he did know, because he had been doing more or less exactly the same thing. He cleared his throat and rubbed his sleeve at a coffee stain on the table. “I suppose I should…” he started, but then stopped again. He felt like he was about to enter a minefield where any wrong move could have very, very nasty consequences.\nBut this was his window to come clean, and if he didn’t now – after everything Peter had just told him – he felt like Peter might hold it against him later.\n“Here’s the thing,” he started again, before taking another pause to think. Finally, he settled on: “You know how I’m used to solving every problem by throwing money at it?”\n“I don’t know,” Peter said. “But I’m curious where this is going, so let’s say I do know.”\n“I bought the café where you work, using a fake name, and renamed it GoaTea.”\nPeter stared at him, his facial expression not changing even a little bit. He just blinked a few times. “You bought the café? Why?”\n“Tax benefits.”\n“Tony.”\n“O-kay… Well, I didn’t like how that boss-guy was treating you, and then you said you didn’t want to quit, so I did the next best thing.”\n“The next best thing,” Peter echoed weakly. “The next-… When someone tells you you can’t have a dog, do you do the next best thing and buy up a whole zoo?”\n“Hey, you’re talking to a guy who once bought a live reindeer for Christmas to brighten up the living room. Actually, it was a donkey, but that part was my mistake.”\n“I-“ Peter said.\n“I was also the one who set up that college fund for you,” Tony said, because he felt if he just added that on real quick, it would feel more like an addendum on his first secret rather than a whole separate secret.\nPeter still blanched. “They told me that was some lady who-“\n“Maria Howard,” Tony nodded. “So we both have some pseudonyms flying around. Call it even?”\n“It’s… it’s not the same, though,” Peter said, his voice now shaky. “The Instagram and the solar distillation; I did all that stuff because I thought it was fun to do. But you actually… Why would you do all that for me when I didn’t ever do anything for you?”\n“It’s not a big deal – I’ve done this for lots of kids.”\n“Oh,” Peter seemed to relax marginally. “Really?”\n“No. I made that up. Sorry. I just don’t want you to freak out.”\n“Freak out?” Peter’s voice was pitched even higher than usual. “I’m not. I’m not freaking out. It’s totally normal to have a billionaire spend thousands of dollars on you. Totally normal.”\n“You’re freaking out,” Tony established. “Can I give you a hug?”\n“Yeah,” Peter readily said, standing.\nIt was a clumsy hug, with Peter’s nose pressing into Tony’s shoulder and his balled up sweater getting squished between them. “I just… Thank you,” came Peter’s muffled voice. “You’re the whole reason my aunt doesn’t have to work double shifts anymore!”\n“Good,” Tony said, stepping back. “More time to watch classic movies with her favorite nephew. Now that I know you were the one who send me notes on solar distillation, I am three times more sure that you deserve a scholarship more than anyone. And this is good. All the secrets out of the way. You know who I am. I know who you are.”\nPeter blew out a breath, and slumped back into the chair. “There’s something else I suppose I should tell you.”\nTony braced himself. “Lay it on me.”\n“I…” Peter paused for a moment. “I don’t actually like orange juice that much.”\n“Oh,” Tony said. “Well, after everything else, that’s certainly something I can handle.”\n“Also,” Peter said, “do you remember that time Spider-Man got shot in the shoulder after saving your ass, and then he told you his aunt was a nurse and she would take care of it?”\n“Yeah? I mean - - wait. I mean - - WHAT?”\nPeter thoughtlessly twirled a strand of hair around his finger. “I was so worried when May said she met you at the hospital a few days later. I thought you would figure it all out. I mean – you must have thought it was strange that the aunt I live with is also a nurse.”\n“No,” Tony said. “Nope. Time out.”\nPeter dug into a pocket and took out the watch Tony had given Spider-Man a few weeks ago. He gently placed it on the table. “You said you didn’t want to know who I am. But you get to a point where it’s weird to keep it a secret because you already did know who I am. You just didn’t know that you know.” He paused for a moment. “If you think about it, it’s really cool.”\n“Is it, now,” Tony said in a level voice.\n“Isn’t it?”\n“Look,” Tony said, “I’m just freaking out a little bit. This is too much. I gotta lie down or something. I need – I need my breathing exercises. Grab that leaflet over there on my desk.”\n“What?”\n“The blue and green one – hurry up!”\nAs Tony lay flat on his back, Peter hurried away and came back with the leaflet, already reciting: “This breathing technique for stress, anxiety and panic takes only a few minutes and can be done anywhere. You will get the most benefit if you do them regularly, as a part of your daily –“\n“Forget that part, just get to the breathing!”\nPeter sat cross-legged next to Tony on the floor. “Breathe in through your nose to a count of five.”\nTony did.\n“Now hold your breath for ten seconds.”\nTony puffed out. “What am I, a blue whale?”\n“Less talking, more breathing! Start from the top. In through the nose.”\nTony let Peter talk him through two cycles of breathing in and out before giving up again. “But kid,” he said, desperate to make Peter see reason. “You can’t be all three those people. You just can’t. This is impossible.”\n“Weirder things have happened.”\n“Yeah, but only about six, in the history of the entire universe.” He looked up at Peter. He looked again. And again. “You’re Spider-Man. You’re… you’re Spider-Man. I mean, when you know it…. It’s like staring at a drawing of a duck for years and then finding out there’s also a rabbit in there. I suppose I should have realized the thing about your aunt. Not to mention your uncle, whom you saw in my painting… though you didn’t say then that he’d passed away. Hah! The painting that I made! There, that’s another secret from me. Not that it matters because you’re Spider-Man.”\n“What are you jabbering about?”\n“The mural painting you love so much? I made it. Just didn’t want to sign my own name.”\nPeter’s mouth dropped open, the leaflet fluttered to the floor. “You’re Nescio?”\n“Don’t gape at me! You got no right after that bombshell you dropped on me!”\n“But why didn’t you tell me?”\n“You didn’t tell me!”\n“I didn’t want you to think I was a creepy stalker!”\n“I didn’t want you to think I was a creepy stalker.”\n“But you… oh my god, you really painted it? That’s … insane. Insane. Hang on. Are you Banksy?”\n“Kid, you’re freaking Spider-Man. Don’t talk to me about what’s insane.”\nAnd they kept talking, not so much with each other but at each other until they were both out of breath and just staring each other in the face with tentative smiles.\n“We make a fine pair, huh?” Tony said. He slowly sat up and ran a hand through his hair. “Damn. I should have listened to Pepper.”\n“Why, what did she say?”\n“I don’t know, I wasn’t listening. Your aunt knows about this, right?”\n“Yeah.”\n“Good. Good. If she knows, then I am one hundred percent in the clear. I’m still going to lecture you, though. Get ready.”\n“Um,” Peter said, “would this be a good moment to ask if your workshop is supposed to be on fire?”\nTony spun his head around, then swore and jumped to his feet. “Damnit, Dum-E!” he yelled as he rushed to turn off the soldering iron. “The one time there’s actually a fire!”\n-\nClint returned to the workshop a few hours later.\nPeter hadn’t heard him come in; the guy was just suddenly standing between two rows of shelves like he was the grim reaper. When Peter jumped and dropped a heavy wrench to the floor, Clint grinned.\n“Clint,” Tony said without looking up from his work. “Do I need to put a tiny bell on you, like my mother used to do with the cat?”\n“Whatever gets your motor running, boo-boo,” Clint said, sauntering closer to the table where Tony was avidly sketching.\n“Ugh.”\n“Did you finish my bow, or what?”\n“Priorities. We’re making a Spider-Man suit, instead.”\nClint raised an eyebrow. “We?”\nTony glanced at Peter. “This kid is officially my minion, now.”\n“Yeah,” Peter said, offering a tentative smile. “Mr. Stark is my Gru.”\nTony’s brow furrowed. “The hell does that mean?”\n“You started it with the ‘minion’ thing!”\n“Minion is a word, kid. Dictionary-approved and all. I don’t know what millennial thing you are referencing.”\n“I’ll send you a picture later.”\n“Where did you come from, again?” Clint asked Peter. His gaze was less hostile and more curious now than it had been in the elevator that morning. “A nephew of Pepper’s, or something?”\n“No,” Peter said, glancing over to Tony for help. He didn’t mind telling the other Avengers the true story at this point, but he didn’t know if Tony was ready to go over the whole thing again, after the reveal this morning had almost sent him into a panic attack.\n“He’s a new intern,” Tony said, waving a hand. “Look, Barton, we’ll get to your precious bow eventually, all right?”\nClint approached the workbench where Tony had left his bow and frowned down at it. “It looks… scorched. Did you set my bow on fire?”\n“It’s supposed to look like that,” Tony said. “I’ll finish it later. Is that really such a problem?”\n“Yes,” Clint said. “You’re putting a serious dent in my plans to go sit in a tree and shoot pigeons all afternoon.”\n“Shoot pigeons.”\n“They’re assholes.”\n“You need a proper hobby,” Tony told him. “Learn to crochet or something. Now, scram. The more you distract us, the longer it will take for me to actually get around to fixing your damn bow.”\nThat finally convinced Clint to leave them alone. He gave Peter a final, searching glance, then retreated back to the elevator, muttering about pigeons under his breath. The doors slid shut and peace was restored.\n“You can tell them,” Peter said. “Everything.”\nTony gave a nod. “I will. Just… gotta let it sink in, first.”\n“So what does it mean that I’m your ‘minion’?” Peter asked, because all this tinkering around with a new suit was nice and all, but he also needed to know where exactly they stood.\n“It means I got your back.” Tony said.\n“You mean like a side-kick? Or like a mentor?”\n“Weird,” Tony said. “You’re a kid genius and a super-hero. On paper, I’m the perfect mentor. But in reality … I don’t know if you need a mentor perse, with that brain of yours. What advice could I possibly give you? Maybe the sidekick-role is a better fit, if you’re giving me a choice.”\nPeter wasn't sure why Tony's choice felt somehow disappointing. “But you could tell me stuff like… ‘stop worrying about your grades and spend more time doing the things you love!’”\n“Okay.”\n“And then I’d be all like: ‘But Mr. Stark if I don’t get good grades I won’t graduate college and I’ll never get a job and I’d end up living on the streets and dying behind a dumpster!’”\n“Huh,” Tony said. “And then what would I say?”\nPeter smiled. “You figure the next one out yourself. You already ask about my school and my love life all the time.”\n“And you don’t think that’s… annoying as hell?”\n“No, I like it,” Peter confessed. May was always involved in his schoolwork, but at the same time, often didn’t really understand his work. He couldn’t bounce ideas off of her like he could Tony. And May was supportive of his relationship but… sometimes you just needed advice from another man. Not a sidekick. A mentor.\nIt was as if Tony could fill in some of the gaps.\n\nThe gaps Ben left behind?\n\nDamn, what was he getting himself into.\n \n\nPart II: Three weeks later\n\n \nPeter first used his panic button a little past midnight on a dark, stormy Friday evening, as gusts of wind slammed waves of thick droplets against the windows of Avengers Tower.\nSteve was already up and out the door before Tony fully realized where that sudden, annoying beep was coming from.\nHe still reached Peter before Steve did. There was no wormhole, no steadily growing puddle of blood, not even some sort of child-eating monster dressed like a clown. Only a nervous Spider-Man in a back alley, who started brabbling as soon as Tony landed next to him and stepped out of the suit.\n“Sorry – no emergency – ohmygosh I’m sorry.”\nTony frowned and lifted a hand to shield his eyes from the sharp raindrops whipping down. “Did you press it by accident?”\nPeter nervously hopped from one leg to the other, as if he had a sudden urge to pee. “No I didn’t. I just… I’m sorry… I’m so sorry. I was so focussed on working through this freaking storm and my web fluid ran out and I got disoriented with all the rain and I followed this bicycle thief and lost track of where I even am and when I finally got back my backpack was gone with my clothes and my phone and my wallet and my keys and my aunt is working a night shift so I didn’t… I didn’t know how I was supposed to even get home and I’ve been walking for an hour thinking of what to do and I couldn’t work it out and I did try to-“\n“All right, kid,” Tony said. “You got some good lung capacity there, but take a breath before you pass out. FRIDAY, tell Rogers it’s not an emergency and not to worry his pretty little ass.”\n“I’m so sorry,” Peter repeated, miserably. “That was really lame. I… I don’t know why I called you. I didn’t even think and then when I realized how stupid it was, there was no cancel-button. I know that button is supposed to be for, like, when dragons attack and stuff.”\n“That would definitely be an excellent reason. I’ve fought dragons a few times, myself. I could give you some pointers.”\nThe attempt at humor fell flat, judging by Peter’s slumping shoulders. Tony figured he should try again once the kid was dry and warm. “Can we get a spare key anywhere?”\nThe stream of babbling instantly started up again. “My aunt May, of course. But I can’t go into the hospital like this. Maybe you could go, but if she’s in surgery you’ll have to wait a long time and I don’t want to make you wait a long time. Or maybe you could lend me some clothes or something and I’ll go in myself.”\nTony sighed. This was beginning to sound far too complicated for a late Friday evening. “How do you feel about crashing at the tower for the night? Yeah, that’s probably for the best. I’ll send your aunt a message.” He lifted a hand to knock against the breastplate of his Iron-Man suit. “Hey FRIDAY, is Steve still on his way or did he turn back? Because we could use a ride. The alternative is I carry Spidey bridal style, and that will just be embarrassing for the both of us.”\n“He is five minutes away,” FIRDAY informed him.\n“That’s my boy. Give Pepper a heads-up, please. And this suit is gonna have to find its own way home.”\nImmediately, the faceplate closed, the repulsors fired up and the suit lifted up into the stormy skies.\nTony ran a hand through his wet hair, and slowly started pacing, making a mental list of teenage requirements. Pizza was probably a big one. He glanced back at Peter, and noticed that the kid was standing awfully still. Tony realised he hadn’t even verified if the kid wanted to stay at the Tower for the night. “You all set to go?”\n“Uh, you can’t see my face right now,” Peter said, “but rest assured that I’m looking shocked and a little bit absolutely freaking flustered. You – you really think I can stay at the tower? Like … pajama party with the Hulk?”\n“Sure. We have about twenty guest bedrooms for you to choose from. And one couch. Huh,” Tony stopped pacing for a moment and frowned thoughtfully. “We should get more couches.”\nSteve parked at the end of the alley a few minutes later. “Late patrol,” he remarked when Peter and Tony crawled into the back.\nPeter pulled his mask off and leaned his head back, his expression disgruntled. “I was planning to be home – like – two hours ago.”\n“Ran into some trouble, huh?”\n“Had his stuff stolen,” Tony said, when it seemed Peter wasn’t going to be forthcoming with an answer.\nSteve merely hummed and grabbed something from the passenger seat. “Here,” he said, throwing a  sweater into the back seat.\nTony wanted to point out that Peter’s suit was as flawless as every single one of his designs thankyouverymuch and that Peter was perfectly warm and dry in there. Peter, of course, was too nice to bring that up, and obediently pulled the sweater over his head. He harshly tugged at the sleeves until his hands peeked out through the ends. “I shouldn’t have pressed that button. It’s stupid, I feel so embarrassed.”\n“Kid,” Tony said, pushing against Peter’s shoulder until he could make eye contact “there is never not a good reason to call us, okay? If you feel like you need help, don’t ever hesitate. I’m being dead serious right now.” His gaze on Peter didn’t waver until the kid gave a reluctant nod. He then added: “Though I could try to work out a system where you can differentiate between a life-or-death situation and a less urgent emergency. Maybe I’ll simply put a whole separate A.I. in your suit.”\nPeter merely hummed, leaning his head against the window. He still looked really down. Tony was just happy to have the kid around again. Things had been quiet, the last few weeks. Tony wanted to steer clear of GoaTea for a little while, but when he had invited Peter over the tower last weekend, Peter had declined with what felt a bit like a lame excuse.\nBut maybe Tony was just imagining things. “Did you finish you homework at least?”\n“Couldn’t. Someone put superglue all over my books at school.”\n“Did you have dinner?”\n“I burnt it.”\nTony glanced him up and down. “You’ve had a pretty rough day, haven’t you?”\n“I thought going patrolling would take my mind off it… Turns out that just when you think life can’t get shittier, it goes ahead and proves you wrong.” He gave Tony a glance. “Did you really fight dragons once?”\n“Oh yeah,” Tony said. He held his hands a few feet apart. “Vicious little creatures. This big.”\n“Oh,” Peter said. “So they weren’t really dragons.”\n“They were!”\n“Did they breathe fire?”\n“No, but-“\n“So they were basically lizards,” Peter said. “That’s your story: you were once attacked by a bunch of lizards.”\nSteve chuckled.\n-\nPeter carefully descended the steps towards the Tower’s living area, where he knew he’d find the large, open kitchen.\nHis lousy, lousy day yesterday had had a surprisingly satisfying ending. Shortly after pressing his panic button he had, ironically, panicked. It seemed that there were about a hundred options more viable than calling in the Avengers over a stolen backpack.\nBut Tony had reacted in typical Tony fashion. Like the dumbest thing Peter had ever done was no big deal at all. It was funny. Tony always gave out a vibe like he was supposed to be a bigger asshole or something. But he wasn’t. He might just be one of the kindest people Peter had ever met. Peter had been a little apprehensive these last few weeks, about whether this whole mentor-thing had been a terrible idea. But talking to Tony again last night… he realized he’d missed the man’s gentle cynicism and easy-going stubbornness.\nHe was still wearing the sweater Steve had lend him last night, and he had pulled the drawstrings of his borrowed sweatpants tightly around his waste to keep them from slipping down. He shuffled forward carefully, focussing on where he stepped so he didn’t trip over his own pant legs, all the while mumbling “boy oh boy-ee-boy” under his breath.\nHe didn’t look up until he had reached the kitchen island. So it was only then that he spotted Clint Barton and Natasha Romanoff, both sitting at the other end of it, wearing equally amused expressions. He immediately realized he had blown his chance at an awesome, cool and collected first impression. “Hey,” he blurted out, wondering why the universe kept spitting out the most embarrassing scenarios for him. What had he ever done to the universe?\n“You’re the one who made the Instagram comics, right?” Clint questioned in lieu of greeting back.\nNatasha slowly stirred her cup of tea.\n“Uh, yeah,” Peter said, gingerly climbing onto one of the high chairs. “Also, I’m Spider-Man.”\n“Spider-Man, schmider-schman,” Clint said. “Tell me about NightMonkey. What’s he gonna draw next?”\nPeter chewed his lip as he thought. “I’ve recently been informed that Tony Stark was once attacked by a bunch of lizards. I think I’ll start there and see where we end up.”\n“I approve,” Clint said.\nNatasha spoke up. “So we’re supposed to believe that you are Spider-Man and you’re the person who was cyberbullying him and you’re an employee at the café where he hid from the papzz?”\n“And a few things more. That’s how we met, I don’t know what to tell you,” Peter said with a shrug.\n“I’m still somewhat convinced Tony just found you in his Happy Meal one day,” Natasha said.\nRude.\n“Well, come on. Feed him, Clint,” Natasha told Clint.\n“Me? Why don’t you do it?”\n“Can’t you see I’m busy?” she asked, before gently blowing on her tea.\nClint clearly decided to choose his battles, and turned back to Peter. “What can I get you?”\n“Whatever is easiest.”\n“Not exactly high maintenance, are you? Welp, he isn’t Tony Stark’s secret illegitimate son, then, we can establish that much,” Clint poked Natasha in the side before sliding off his chair to open a kitchen cabinet. “And you’re gonna go home dressed like that?”\n“My aunt is picking me up. She’s bringing clothes. And I need a new phone, and I need to apply for a new ID and oh god we probably have to change all the locks. May is going to kill me.”\n“I’m not going to kill you,” a voice said. “It would take far too much time to train a new nephew to make good pasta.”\n“Love you too, May,” Peter said, turning to face his aunt. She was standing near one of the doorways next to Tony, who evidently let her into the building. May was holding a plastic bag, Tony a paper one.\n“Did you have a fun sleep-over, honey?” she asked, clearly not the least bit aware that she was supposed to make Peter look cool in front of the Avengers damnit!\n“It wasn’t a sleep-over,” he complained. “It was a… a business meeting. At night.”\n“My bad,” she replied without batting an eyelid. She patted the plastic bag. “I brought you some clothes, unless you want to drive back home in your business attire?”\nPeter glanced down at the oversized pajamas.\n“And speaking of outfits: Your suit,” Tony said, lifting the paper bag. “I put an A.I. in it, so it’ll be easier for you to contact us in the future.”\nWow, that was quick. “Just like that?”\n“Well, let’s not trivialize my achievements, I spent all night on it. Couldn’t help but notice that you unlocked several web-shooter combinations that I specifically set to ‘advanced level only’.”\n“I got a friend to hack it.”\nTony gave him a hard stare.\n“I’m advanced!”\nTony’s stare remained unwavering.\n“That’s not gonna work on me,” Peter informed him, crossing his arms across his chest as his pajama sleeves flopped around. “I grew up with her. I became immune to death glares at age eleven. The whole point of the suit was that I’d be safer, right? So let me use it to its full potential. Otherwise, you might find me dead in an alleyway one day and you’ll have to give my eulogy and be all like ‘if only he had had his taser-web, he’d still be alive today’. You don’t want that, do you?”\n“I do hate giving speeches,” Tony admitted.\n“Not exactly the point I was trying to make, but we ended up where we needed to be, I guess,” Peter said. As far as he was concerned, that had been a pretty good little speech. He almost figured that maybe he could get his fellow Avengers to look at him with awe and respect after all.\nUntil he slipped off the chair to grabs his clothes from his aunt, tripped over his pant leg and promptly face planted on the kitchen floor.\n \n\nPart III: Three musketeers\n\n \nPeter had expected things to get easier after the panic button-incident. After he had been reminded how awesome it was to be at the tower, how much fun it was to have back-and-forths with Tony.\nBut things didn’t get easier.\nTony sent him a message the following Saturday, once again inviting him to the tower. Something about working on developments in the forensic field with Dr. Banner and holy shit that sounded awesome. Peter read the message about fifty times over the course of the day, but it was as if an invisible force stopped him from responding.\nOn Sunday came blessed relief in the form of MJ.\nHey Peter, she texted him, Ned and I are at GoaTea. Wanna come hang out?\nGood. He could go hang out with Ned and MJ and then send Tony a message, something about seeing his invitation too late and already making plans with friends.\nHe shouldn’t have been surprised to step into the café only minutes later, to find his friends hiding in the booth in the back, accompanied by…\n“Oh, hey kid! What a coincidence.”\n“What the hell are you doing here?” Peter demanded.\n“Oh, the usual,” Tony said, lazily reclining in his seat. “Expanding my horizons, hanging out with teenagers…”\n“What if the papzz come in?”\n“Come on,” Tony said. “They’ll never suspect I’m here again. They know only an idiot would go back to the exact same place where he was cornered last time.”\n“But why are you here?”\nTony shrugged. “Pepper abandoned me, like an old toy at the second hand store. Went on a trip to one of those countries where it’s cold and the people are miserable so they just sit around inventing new technology all the time. I’m all by myself. Just need two misguided robbers and I could re-enact the Home Alone franchise.”\n“Ah,” Peter said. “Well, first off, thanks for moving your pity party into my café.”\n“It’s actually my café, I’ll remind you.”\n“Fair point.” Realizing how awkward he looked, just standing next to the table, Peter reluctantly sagged into the booth next to MJ. “Is this a set-up?”\n“What do you mean?” she asked, stirring her milkshake with her straw, “why would we have a reason to set you up?”\nThis was definitely a set-up.\n“Is Peter an Avenger now?” Ned excitedly asked Tony.\nTony clearly struggled with a response for a while. “Why would be he?” he then asked in a polite voice.\n“They both know about the spider-thing,” Peter informed him. “I told them.”\n“We figured it out,” MJ corrected him.\nTony narrowed his eyes at Ned. “That reminds me. You’re the one who hacked my training wheels protocol, aren’t you?”\n“No,” Ned immediately denied, eyes wide. “No, no no – really – that was..”\n“An impressive feat.”\n“Oh,” said Ned. “Well then, yeah, it was me.”\n“Well,” Tony cradled his coffee cup. “then I see Peter’s sidekick-position has already been filled by you two musketeers.”\nThe comment somehow stung, and Peter wasn’t sure why. And Tony didn’t even have the decency to move on to a less grating topic. Instead, he addressed Peter directly and bluntly: “So. You didn’t respond to my message.”\n“Uh-hm,” Peter said slowly, giving himself some time to think. He needed a proper excuse. Something diplomatic and plausible and specific enough that no one would doubt it was the truth.\n“I was busy.”\nOkay, he needed to get better at making excuses.\nA short silence fell.\n“I gotta go pee,” MJ abruptly announced. She turned her piercing gaze on Ned.\n“Oh. Yeah, me too,” Ned said, clearly catching on. “Like, ready to burst. And poo, too. Might take a while, I’ve had major constipa-”\n“Ugh, you ruined it,” MJ said, reaching out and tugging at his arm. “Just come on.”\nThey left.\n“If that’s the general level of subtlety amongst teenagers, it’s a damn miracle you managed to keep your secrets for so long,” Tony said. His tone was light, but his eyes were steady as he gazed at Peter across his coffee cup.\nPeter didn’t respond. Not because he was trying to be an asshole. Just because he couldn’t figure out why his was finding this whole situation so hard to deal with.\n“I think I may have upset you when I said the sidekick-role would fit me better,” Tony continued. “It was mostly a joke, but I don’t think you took it that way.”\n“I don’t think that’s it,” Peter slowly said.\n“Oh,” Tony said, setting his coffee cup down. “What you mean is, that’s not the reason why you’ve been avoiding me like the plague these last few weeks?”\n“Right. Yeah,” Peter said, because there was no point denying at this point. “That’s what I mean.”\n“Are you embarrassed about faceplanting on my kitchen floor? Because, you know, that looked pretty embarrassing.”\nPeter scowled. “Thanks dude. And, no. That’s not it.”\n“Are you unhappy about the scholarship? Or about the new suit?”\n“Of course not,” Peter instantly denied, cringing as he realized how rude he had actually been, avoiding Tony after everything the man had done for him.\n“All right,” Tony said. “Then how about we play a different game where I stop guessing and you just tell me? Because I wasn’t planning on going anywhere unless you give me a good reason.”\nThe comment strongly reminded Peter of the sort of things his uncle Ben used to say, and as an unexpected surge of memories washed over him, he suddenly found a way to put his feelings into words. “I don’t know. I just… When I said that thing about you being a mentor, it’s as if I heard my uncle’s voice in my head going ‘what about meeee?’.”\nTony nodded. “He was a good guy, wasn’t he?”\n“The bestest. You’ve got some pretty big shoes to fill.”\n“Challenge accepted,” Tony said. “But, uhm, I’m gonna bring my own shoes. So his can stay where they are. You’ll simply have three pairs of shoes now, instead of two. Maybe expand the shoe rack a little. Two inches either side.”\n“You’ve lost me.”\n“Yeah, I took the analogy too far.”\nBut Peter got it, though. It was pretty silly to think that he couldn’t accept another mentor figure into his life, or that Ben wouldn’t have wanted him to ask for help at times. “I really want to come to the tower again,” he admitted. Because he did. “And hang out and build my suit and talk about solar distillation. Thank you, Tony. Thanks for not letting me ignore you.”\n“I’d be a pretty shitty mentor if I bailed at the first sign of teenager stubbornness.”\nPeter smiled. Tony was good at this. This was going to be okay.\n“I brought you something,” Tony said. He reached into the bag he had left next to his seat, and pulled out a cardboard tube. He popped the lid off and out came a thin, very fine sheet of paper. Tony turned it over and towards Peter. “One of the final sketches I made for the mural painting.”\nPeter carefully pulled the sketch closer. It was all there. The smiling faces. Ben’s eyes looking up at him. And the colors popped even more on paper.\n“That’s really cool,” Peter said with a soft smile. “Thanks for showing it to me.”\n“No, kid. That’s for you to keep. If you want it, that is.”\nPeter resisted the urge to immediately hug the piece of paper to his chest. Whatever lingering doubts he still had about Tony and Ben and what it would all mean for him, floated away into the air, and he was left with only a strangely peaceful feeling. “Thank you,” he whispered.\n“You’re welcome, kid,” Tony said. “That’s what I’m here for.”\nPeter glanced down at the sketch again. Ben smiled back at him. It’s okay, his eyes said. I want you to do whatever makes you happy.\n“So … can I come to the tower next weekend?” Peter ventured.\nTony frowned a little as he thought. “I actually have to attend another expo.”\n“Can I come? I kinda missed the last one.”\nTony cocked his head as he considered that question. “Are you sure you want to be seen in public with me?”\n“What’s the worst that could happen?”\n“I don’t know. I’m pretty famous, you know. You might get kidnapped for ransom.”\n“I can’t get kidnapped,” Peter said. “I got homework.”\n“I don’t know that you’ll have much say in the matter.”\n“Point taken. But maybe that wouldn’t be a bad thing. Some poor dweebs who think they’re kidnapping a defenseless teen, and then instead they get me.”\n“And how do you imagine I explain you to the press who will inevitably ask questions? Shall I introduce you as Spider-Man or as the kid-genius who is co-writing my paper on solar distillation?”\n“Easy,” Peter said. “We hit them with so many wild theories that in the end, no one will know what is actually going on. One paper will print that I’m your long lost half-brother from a dwarf-planet, where people never grow past a size of 5 feet 6. Another one will say I’m you, from the past: The result of a time-travel experiment gone wrong. And a third one will say I’m Bob, an orphan who saved your life when you almost choked on a peanut, and who has now wormed his way into your heart Annie-style.”\n“You really want to go with ‘Bob’?”\n“If that’s your main concern with the plan, I think we’re pretty much on the same page.”\n“How do we get papers to print this?”\n“Let’s just write it ourselves. What’s one more secret identity? ‘By Michelle Leeds; your local freelance journalist’. Send it to the papers. Include a picture. I bet you they’ll pay us to publish it. Let me go get MJ, she’ll take the picture for us!”\n-\n“That’s weird,” Steve said the next weekend at the dinner table. Peter and Tony, who had been sitting at the table with him, endlessly bickering over something called ‘solar stills’, whatever that was, finally broke off their discussion to look in his direction.\n“They wrote an article about the two of you,” Steve continued, laying the newspaper flat on the table. “It’s wildly inaccurate. And there’s a picture of the two of you. Together. In some café.” He frowned as he scrutinized the page. “It’s taken from really close by. Some journalist has definitely been following you around.”\n“Huh,” Peter said.\n“No kidding,” Tony said.\nAnd that’s all they would say on the matter.\n "
}