{
    "id": "30744035",
    "url": "https://archiveofourown.org/works/30744035?view_full_work=true",
    "author": [
        "Owlwinter"
    ],
    "title": "this time it's a tweet cute",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Video Blogging RPF",
        "Minecraft (Video Game)"
    ],
    "relationships": [
        "Clay | Dream/GeorgeNotFound (Video Blogging RPF)",
        "Clay | Dream & Sapnap (Video Blogging RPF)",
        "GeorgeNotFound & Sapnap (Video Blogging RPF)",
        "Clay | Dream & GeorgeNotFound & Sapnap (Video Blogging RPF)",
        "Wilbur Soot & Technoblade & TommyInnit & Phil Watson"
    ],
    "characters": [
        "Clay | Dream (Video Blogging RPF)",
        "GeorgeNotFound (Video Blogging RPF)",
        "Sapnap (Video Blogging RPF)",
        "TommyInnit (Video Blogging RPF)",
        "Technoblade (Video Blogging RPF)",
        "Phil Watson (Video Blogging RPF)",
        "Wilbur Soot",
        "Alexis | Quackity",
        "Ranboo (Video Blogging RPF)",
        "Toby Smith | Tubbo",
        "Sleepy Bois Inc. (Video Blogging RPF)",
        "Dream SMP Ensemble"
    ],
    "additional_tags": [
        "Enemies to Friends to Lovers",
        "Secret Identities",
        "Fluff",
        "Happy Ending",
        "Meet-Cute",
        "dream is george's mortal enemy but parasocially",
        "Mutual Pining",
        "sapnap is so done with their shit",
        "sbi is also so done with their shit",
        "Enemies to Lovers",
        "Rivalry",
        "POV Outsider",
        "feat SBI",
        "for some parts not the whole fic",
        "Social Media",
        "Texting",
        "Chatting & Messaging",
        "Fluff and Humor",
        "Humor",
        "IRL Fic",
        "media fic",
        "Crack Treated Seriously",
        "Twitter"
    ],
    "language": "English",
    "series": "",
    "published": "2021-04-17",
    "completed": "2021-05-06",
    "words": "12,122",
    "chapters": "6/6",
    "comments": "1,289",
    "kudos": "14,616",
    "bookmarks": "2,937",
    "hits": "157,288",
    "summary": "<p>Sapnap: Damn, even I think that is one dry-ass trending description<br>Sapnap: How much do you get paid to write those again?<br>George: none. this is an unpaid internship and I hate it here.</p>\n<p>--</p>\n<p>Or: in which George is the Twitter Description Man, and Dream is the perpetually-trending Minecraft youtuber he has a love-hate relationship with.</p>",
    "notes": "<p>The setup: Dream is a huge Minecraft youtuber known for his “Minecraft but” videos. George is the Twitter employee that has to write brief descriptions for all the trending hashtags (aka the Twitter Description Man). Sapnap is a fellow coworker at Twitter HQ who’s been friends with George for a long time.</p>\n<p><b>Chinese translation now available!!</b> <a href=\"https://xiaoliushinibaba.lofter.com/post/30a06c94_2b42ea186\" rel=\"nofollow\">Read here!</a><br><b>Russian translation now available!!</b> <a href=\"https://ficbook.net/readfic/11526495/29619999#part_content\" rel=\"nofollow\">Read here!</a></p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>hmmm...I wonder who twitter user @notdream could possibly be...HMMMMM...... </p>\n<p>And that's a wrap for part 1!!! Part 2 should be posted on Tuesday so keep an eye out for that :D I'm really excited for this fic and I hope you've enjoyed it thus far!! </p>\n<p>Huge shoutout to my beta readers, AmberRunnel (go check out their fanfics, they’re all super pog!!!), BlueWater5, CupofDepresso_ and SleepySlooth! Yall are the best &lt;3</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>...And so their adventure begins...</p>\n<p>Thank you so much for all the support for my fic, I can't believe we hit 100 kudos on chapter 1!! And all the comments were so lovely as well &lt;3</p>\n<p>Chapter 3 should be up on Friday!! :]</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>sapnap is doin his best o7</p>\n<p>Thank you all so, so much for all the love and support you've given me on these first couple of chapters, all of your comments have been so lovely and mean the world to me!! &lt;3 Next chapter should be up on Tuesday, see you all then! :]</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>Does anyone remember that week where Dreosquare was a thing??? Because I certainly remember that week where Dreosquare was a thing. (https://shipping.fandom.com/wiki/Dreosquare if you're unfamiliar). So yeah, you can think of DescDream as the equivalent of that XD. This chapter was actually some of the first parts that I wrote out for the story!</p>\n<p>I say this every chapter, but thank you all so so much for all the kudos, bookmarks, and comments!! It means the world to me that folks out there are enjoying my fic &lt;3</p>\n<p>Next chapter should be up on Saturday! :]</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p>Not to be sappy or anything but I'd like to think that the dream team would find each other in any universe &lt;3</p>\n<p>We're closing in on the end, only one more chapter is left folks!! I'm very veryyyy excited for it :D </p>\n<p>For this last chapter, if you are interested in a cameo as one of the bajillion random twitter users commenting on things, include your twitter @ in a comment! And I'll do my best to work everyone interested in :)</p>\n<p>Once again, thank you all so much for all the love and support you have given this fic, every single comment means the world to me &lt;3 Last chapter should be posted on Wednesday! :]</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">notes</a>.)\n</p>\n<p>And with that, 'this time it's a tweet cute' is complete!!!! Thank you all so so much to everyone for joining me on my silly lil fic, with all its descdream, tom brady jokes, unpaid internships, #teamdescriptionman vs #teamgeorge shipping wars, sapnap's eternal suffering while being the best bro ever, twitter's inherent chaos, and many, many trending descriptions. I hope you all enjoyed the ride &lt;3 </p>\n<p>Huge shoutouts to froggyfinral and the other wonderful description anon whose comments inspired parts of this chapter!! &lt;33333</p>\n<p>and thank you all so so much to everyone for all the comments, bookmarks, and kudos you've left on this fic. the amount of love you all gave my fic absolutely blew me away. I was nervous about posting this but everyone was so kind, thank you all so so much &lt;3333333333333</p>\n<p>I'd love to hear your thoughts now that the fic is complete!! :] (Also, feel free to come say hi to me on tumblr, I'm @owlwinter8 !! ^^)<br>-----<br><b>EDITING IN SOME AWESOME LINKS!!!!! :D</b></p>\n<p>\n<b>Translations</b>\n<br>\n<a href=\"https://xiaoliushinibaba.lofter.com/post/30a06c94_2b42ea186\" rel=\"nofollow\">You can now read Tweet Cute in Chinese!!!</a>\n</p>\n<p>\n<a href=\"https://ficbook.net/readfic/11526495/29619999#part_content\" rel=\"nofollow\">You can now read Tweet Cute in Russian!!!</a>\n</p>\n<p><b>Fanfics, omakes etc based in the Tweet Cute Universe (yes I do declare these all to be 100% canon with my author powers!!! &gt;:D )</b><br><a href=\"https://archiveofourown.org/comments/438423409\" rel=\"nofollow\">- Omake by myself</a> on twitter reacting to the fact that dream and george have stantwt accounts! (&amp; also the <a href=\"https://archiveofourown.org/comments/442652848\" rel=\"nofollow\">associated fanart by TumblingBackpacks!!!)</a> </p>\n<p><a href=\"https://archiveofourown.org/works/33058408\" rel=\"nofollow\">- this fic we coded it so that dream majorly fucks up by wonder_womans_ex</a> Taking place a few years after Tweet Cute, this fic is about the the eventual descdream marriage proposal and yes absolutely everything will go as planned right? right????? (wrong!)</p>\n<p><a href=\"https://archiveofourown.org/comments/455771017\" rel=\"nofollow\">- An adorable guest omake by Descanon!!!</a> In which Ranboo may or may not expose himself for having a secret stan acc...</p>\n<p><a href=\"https://archiveofourown.org/works/33399547\" rel=\"nofollow\">- undercover shenanigans by TumblingBackpacks</a> Based on the previous guest omake by Descanon, this is about Ranboo accidentally revealing that he has a stan acc. There is an imposter among the GC....dun dun DUN!!! Who is the imposter? Read to find out!</p>\n<p><a href=\"https://archiveofourown.org/works/33206710\" rel=\"nofollow\">- only a small percentage of viewers actually understand this shit by OutOfTune</a> This takes place between Tweet Cute and \"this fic we coded it so that dream majorly fucks up\" by wonder_womans_ex and is about Dream and George finally moving in together and all the shenanigans involved!! And SOMEONE may or may not accidentally slip up and leak their identities to the GC...</p>\n<p><a href=\"https://archiveofourown.org/works/33440914\" rel=\"nofollow\">- accidental face reveals make twitter 10000% more drunk by OutOfTune</a> - Dream accidentally does a face reveal live on stream, and boy oh boy the bird app is not prepared...and neither is the person that has to write the resulting trending descriptions....</p>\n<p><a href=\"https://archiveofourown.org/works/33545299\" rel=\"nofollow\">- time to face the consequences by TumblingBackpacks</a> - Do you know who else isn't happy with how twitter is reacting to Dream's accidental face reveal?? Drista. Feat more secret stan accounts, more bird app chaos, and many, many more forks!!</p>\n<p><a href=\"https://archiveofourown.org/works/33932014\" rel=\"nofollow\">- the bird app, but every minute there's random chaos by OutOfTune</a> - IT'S A WEDDING FIC!!! and dnf has absolutely reached maximum sappiness, bless their hearts &lt;3</p>\n<p><b>Fanart!!!!!</b> </p>\n<p><a href=\"https://archiveofourown.org/comments/433152964\" rel=\"nofollow\">- A couple of pieces of fanart by TumblingBackpacks!!!!!! </a>User TumblingBackpacks left a comment with a couple of pieces - Dream bein all excited from right after The Confession, as well as fanart of the shipping war between #TeamGeorge and #TeamDescriptionMan!!! Make sure to check them out, both pieces are super awesome!!!!!</p>\n<p><a href=\"https://archiveofourown.org/comments/442652848\" rel=\"nofollow\">- More fanart by TumblingBackpacks!!!!!</a> This is the cutest thing ever, it's fanart of <a href=\"https://archiveofourown.org/comments/438423409\" rel=\"nofollow\">the previously linked omake sequence</a> with the messages all drawn out!!! And all the characters have the cUTEST avatars ever and react with the messages in the most adorable of ways, this fanart is just just pure serotonin so be sure to check it out!!!!</p>",
    "text": "@dreamwastaken: Have\n\n(Tweet deleted)\n\n\n \n\n@dreamwastaken: I pressed send too soon, no one saw anything\n--@ranaltboo: Have\n--@TubboLive: Have\n--@Technothepig: Have\n--@tommyinnit: dream this is just embarrassing for you man\n \n\nTWITTER TRENDING\n\nHAVE\n\n5,483 tweets\n\n \nText Message:  George, Sapnap\nGeorge: story time\nGeorge: so I finish writing the descriptions for the current trending topics, and I realize that none of the current trends are about that stupid minecraft man, and I think. ah. peace at last.\nGeorge: so in celebration I go get myself some nice warm coffee\nGeorge: and then when I get back\nGeorge: guess what I see. right there, top of the list.\nGeorge: A BRAND!! NEW!!! TREND!!!!! AND JUST GUESS WHO IT’S ABOUT!!!!!!!!!!\nSapnap: ahhhhh I get the sense that your mortal enemy has struck again\nGeorge: DO YOU KNOW HOW MANY TIMES HE’S TRENDED TODAY. DO YOU KNOW, SAPNAP.\nSapnap: Six. I know that because you’ve texted me for every single one of them, George.\nGeorge: YOU’RE RIGHT, IT WAS SIX!!!!!!!!!!!! AND NOW IT’S SEVEN!!!!!!!!!!!!!!\nSapnap: The horror\nGeorge: YES IT IS!!!!!!!!!\nGeorge: LOOKS LIKE he pressed send on a tweet too soon\nSapnap: happens to the best of us amiright\nGeorge: AND THE WORST, APPARENTLY\nGeorge: JUST WHY. WHY IS HE ALWAYS TRENDING FOR THE DUMBEST SHIT ?????\n \n\nTWITTER TRENDING\n\nHAVE\n\nFans laugh at Minecraft YouTuber Dream for a mistweet\n\n\n5,709 tweets\n\n \n\nText Message: George, Sapnap\n\nSapnap: Damn, even I think that is one dry-ass trending description\nSapnap: How much do you get paid again?\nGeorge: none. this is an unpaid internship and I hate it here.\nGeorge: BUT ALSO OH COME ON WHAT AM I SUPPOSED TO SAY??  OH WOE IS HE, DREAM THE AMAZING FAMOUS MINECRAFT YOUTUBER HATH MADE A FUNNY MISTAKE, COME JOIN IN WITH HIS FANDOM AS THEY CACKLE AT HIS MISFORTUNE\nGeorge: SO WHAT IF HE CLICKED SEND TOO SOON\nGeorge: WHYYYYY IS THAT WORTHY OF A TREND\nSapnap: Idk man, it’s kinda funny to me.  Like have\nGeorge: I fucking hate you\n \n@karaamochi: Who tf crawled up twitter description man’s arse\n@CaffeineChmist: NOT AGAINNNN twitter man -.-\n@ranboop_: dreamtwt public enemy list: 1. Twitter Description Man.\n@sweetchayos: If I die just go ahead and let the twitter description man be the one to bury me so he can let me down one last time\n@tae_innit: twitter description man has the biggest boomer energy I’ve ever seen\n@karaamochi: OKAY I’VE HAD ENOUGH OF DESCRIPTION MAN’S BULLSHIT it’s honestly just so rude????  Like other fandoms get legit good descriptions for their trends and we get…crumbs at BEST.  #TwitterManStopBeingSaltyChallengeFailed\n--@SleepySlooth: Yeah for real fuck that guy #TwitterManStopBeingSaltyChallengeFailed\n--@ItsMoonjiMoth: Vouch #TwitterManStopBeingSaltyChallengeFailed\n \n\nTWITTER TRENDING\n\n#TwitterManStopBeingSaltyChallengeFailed\n\n3,139 tweets\n\n\n \n\n\nText Message: George, Sapnap\n\nSapnap: Ayo I think the fans have finally had enough of your shit\nGeorge: ? wym\nSapnap: Refresh the trends my dude\nGeorge: Oh fUCK\nSapnap: Yep\nSapnap: Honestly kinda on their side for this one\nSapnap: Long live the revolution\nGeorge: OH FUCKKKKKK BOSS LADY JUST MESSAGED ME\nSapnap: L\nGeorge: OH GOD SHE JUST ASKED ME TO AND I QUOTE “COME ON DOWN TO MY OFFICE FOR A QUICK CHAT” I AM DEADDDDDDDDDD\nGeorge: AHHHHHHHHHHHHHHHHHHHHHHHHHHHH I FUCKED UP I FUCKED UP\nSapnap: HAHAHAHAHAHA\nGeorge: FUCK OFF I MIGHT ACTUALLY GET FIRED YOU DICK, WHAT DO I DO I’M FREAKING OUT LIKE FOR REAL\nSapnap: Dude, I’d say I feel bad for you but like, it’s honestly your own fault\nGeorge: DIE\n \n\nText Message: George, Sapnap\n\nGeorge: Okay so I wasn’t fired\nSapnap: Damn really?  I already started claiming your office supplies though :/\nSapnap: Did you know your chair is so much nicer than mine?? It’s so not fair\nGeorge: You are such a bitch oh my god\nGeorge: One more quip and I’ll rename your contact, I stg\nSapnap: Oh sooo scary whatever will I do\nGeorge: FINE\nGeorge: NOW YOU ARE IMMORTALIZED FOREVER AS THE BITCH YOU ARE\nSapnap(Bitch): omg all my dreams have come true\nSapnap(Bitch): …No for real though, what’d boss lady say to you?\nGeorge: Yada yada you’re making the company look bad, yada yada make sure it doesn’t happen again, yada yada do your research and I quote “you better learn how to be enthusiastic for that fandom or it is your ass is on the line”\nGeorge: Boss lady was actually, uh, pretty serious on that one\nSapnap(Bitch): ... :(\n \n\nText Message: George, Sapnap(Bitch)\n\nGeorge: Oh god no I think that stupid minecraft man is going live for a Q&amp;A today\nGeorge: Ughhhh save me pleaseeee\nSapnap(Bitch): Well now, is that what you call an enthusiastic look? o.O\nGeorge: Like, how do I even get excited for this dude?  He’s a MINECRAFT YOUTUBER for god’s sake\nGeorge: Minecraft was uncool like five years ago\nSapnap(Bitch): RUDE\nSapnap(Bitch): OUT OF POCKET\nSapnap(Bitch): UNCALLED FOR\nGeorge: Just saying\nSapnap(Bitch): Wait don’t you still play it too\nGeorge: Oh shut up\nGeorge: Okay well at least I don’t do Minecraft for a living, I mean come on\nSapnap(Bitch): Ah yes compared to your actual job which pays you actual money\nSapnap(Bitch): Oh wait that’s right, you look at twitter all day for literally nothing since it’s an UNPAID INTERNSHIP\nGeorge: …Bro.\nSapnap(Bitch): Diss your minecraft man all you want, but don’t you ever call Minecraft uncool again bitch\nSapnap(Bitch): Also while we’re here, just for the record?\nSapnap(Bitch): Dream’s content is actually pretty awesome, just saying\nGeorge: I am never speaking to you again\nSapnap(dead to me): Lol k\n\n \n\n\nText Message: George, Sapnap(dead to me)\n\nGeorge: Wait time out on my not speaking to you again agenda\nSapnap(dead to me): Couldn’t even last a full minute\nGeorge: Seriously how do I “learn how to be enthusiastic” for the stupid minecraft man\nGeorge: help\nSapnap(dead to me): My dude\nSapnap(dead to me): We work for twitter.com\nSapnap(dead to me): Go make a dream stan account\nSapnap(dead to me): Go incognito with the locals and shit\nSapnap(dead to me): Soak in their love and affection\nGeorge: wtf\nGeorge: How is that even remotely a good idea\nSapnap(dead to me): That’s all I got\nGeorge: DUDE I AM N O T MAKING A DREAM STAN ACCOUNT, ARE YOU KIDDING ME ????\nGeorge: I’D RATHER DIE\nSapnap(dead to me): I mean, it’s your ass on the line, not mine, so.\n \n[Twitter.com]\n[Sign up]\n \nTwitter account: @gogyyy\nDescription: Gogy ◉‿◉ | 23 | he/him\nLocation: ur mom\n \n@gogyyy: Hello everyone! ＼(^o^)／ My name is Gogy and I am really new to the dream fandom!!  It’s nice to meet all of you, please help me find some moots!! (✌◠▽◠) #dream #dreamtwt\n--@mayamoon: Hiiii Gogy!!!\n--@tae_innit: Welcome to the best fandom ever!!!!\n--@mayamoon: Hey Gogy I have a GC where we discuss the videos whenever they come out and also chat and stuff if you want to join!!\n--@gogyyy: Omg maya you are literally the nicest person ever ;;;;; I would really appreciate that!!! ( ＾◡＾)っ❤\n \nDream’s Bitches Group Chat - Members: 32\nMayamoon: ADDING NEW MEMBER TO THE GC!!!! Welcome, Gogy!!!! Everyone come say hi!!! :D\nGogy: Hello guys, I’m gogy!!!! Nice to meet all of you!!!!\nbella | day 73 of crying over dream: Hello gogy!\nCryptid ☽:  Hi!!!\nThat²³: WELCOME!!!\nnotdream: lol gogy love the location, mind if I steal the joke\nGogy: Go crazy mr. notdream\n \nNotification: @notdream followed you!\n \nTwitter account: @notdream\nDescription:  just hanging out, nothing here to see.  nothing at all nope :) | he/him | 20\nLocation: ur mom :o\n \n\nText Message: George, Sapnap(dead to me)\n\nGeorge: So I’ve infiltrated a dream fan group chat\nSapnap(dead to me): HAHAHAHAHAHA DID YOU REALLY\nGeorge: Now what\nSapnap(dead to me): What do you mean, now what\nGeorge: Like how is this going to help me?\nSapnap(dead to me): Idk man lmao\nGeorge: YOU WERE THE ONE WHO SUGGESTED IT\nSapnap(dead to me): I WAS JUST PISSED AT YOU FOR CALLING MINECRAFT UNCOOL\nGeorge: …I actually hate you\n \n\nTWITTER TRENDING\n\nUPSIDE DOWN DUCK\n\n8,901 tweets\n\n \n\nDream’s Bitches Group Chat\n\nbella | day 73 of crying over dream: UPSIDE DOWN DUCK???\nmayamoon: UPSIDE DOWN DUCK!!!!!!!\nwil²³: I JUST SJKFDHJKDFHJKDFS\nGogy: Wait what is the joke I can’t watch the stream\nmayamoon: UPSIDE DOWN DUCK!!!!!!!\namnesi_acc | currently supposed to be working: UPSIDE DOWN DUCK!!!!!!!\nGogy: does anyone have a clip\nwil²³: uPsIdE dOwN dUcK!!1!1!!1!!!!!!!!!!!!\nmayamoon: UPSIDE DOWN DUCK IS UPSIDE DOWN DUCK!!!!!!!\nGogy: BUT WHAT IS THE DUCK AND WHY IS IT UPSIDE DOWN HUH\nbella | day 73 of crying over dream: UPSIDE DOWN DUCK!!!!!!!!!!\nGogy: AGHHHHHHHHHHHHHHHHHHHHHHHHHDFHDFHJKDJKHFG\nnotdream: lmao gogy dm me I’ll explain it\nGogy: THANK YOU!!!!!!!!!!!!!!!!!!\nmayamoon: UPSIDE!!!!!!!! DOWN!!!!!!!!!!!!!! DUCK!!!!!!!!!!!!!!!!!!!!\n \n\nTwitter DM: @notdream, @gogyyy\n\nGogy: please twitter notdream, you are my only hope\nGogy: save me from this upside down duck hell\nGogy: what is it and why is it trending\nnotdream: lol aight\nnotdream: so during Dream’s last livestream\nnotdream: Quackity just came up with the random phrase ‘upside down duck’\nnotdream: the joke is that no one is supposed to explain or give any context when they tweet about it\nnotdream: because there is none, and that is funny\nGogy: ...\nGogy: ..........\n\n \n\n@gogyyy: OFFICIALLY DO NOT LIKE THIS BIRD APP\n \n\nTWITTER TRENDING\n\nUPSIDE DOWN DUCK\n\nDuring content creator Dream’s last livestream, Quackity came up with the random phrase ‘upside down duck’ for fans to trend, asking fans to not include any explanation or context when they tweet about it\n\n\n9,239 tweets\n\n \n@linb3at: nooooo twitter description man ruined the jokeeeee but I can’t be too mad because like it’s????? An actually decent description???? For once??????\n--@karaamochi: The twitter people must have saw the hashtag we made for them hhhhhhsfhjsdfh\n \n@dreamwastaken: ......WELL THAT’S A BIT SUS\n\n(Tweet deleted)\n\n\nTwitter DM: @gogyyy, @notdream\n\nGogy: Hello again user notdream\nnotdream: Hi?\nGogy: quick question, is patches a dream related trend??\nnotdream: Yeah totally\nnotdream: That’s the name of Dream’s cat\nnotdream: Dream posted a video of her purring a few minutes ago\nnotdream: She’s very adorable, everyone's in love with her\nGogy: ok thanks!!!\n \n\nTWITTER TRENDING\n\nPATCHES\nDream posted a video of his adorable pet cat Patches purring, and fans are in love  with her\n\n3,203 tweets\n\n \n@notdream: Hmmmmm…\n \n\nTwitter DM: @gogyyy, @notdream\n\nGogy: Homeless Dream???\nnotdream: Technoblade was teasing Dream for not having a home base on the dream smp server\nGogy: Thankssss\n \n\nTWITTER TRENDING\n\nHOMELESS DREAM\n\nIn today’s news on the Dream SMP, Minecraft YouTuber Technoblade teased Dream for not having a home base on the server\n\n\n11,942 tweets\n\n \n@notdream: HMMMMMMMMM\n \n\nText Message: George, Sapnap(Bitch)\n\nGeorge: So guess who figured out a way to hack their job\nSapnap(Bitch): What did you do this time.\nGeorge: So so so get this\nGeorge: There’s this dude I met on twitter\nGeorge: He explains all the Dream related trends to me and I just use that to write the descriptions\nGeorge: E Z CLAP\nSapnap(Bitch): …Uh yeah so what happens when he figures out that you’re the description man\nGeorge: No no no, don’t worry, I’ve got this\nGeorge: I am a master at stealth\nGeorge: He’ll never figure it out :D\nSapnap(Bitch): My worrying has only intensified\n \n\nTwitter DM: @gogyyy, @notdream\n\nGogy: Why is #ButThenAgainRussia trending from dream fans\nnotdream: Dream was playing geoguessr and it became a bit of a meme where he would go into a lengthy analysis on what country he was in before giving up and guessing russia\nGogy: ur the best man, thanks\n \n\nTWITTER TRENDING\n\n#ButThenAgainRussia\n\nWhile playing the popular game Geoguessr, content creator Dream amused fans with his lengthy analysis on what country he was in, only to give up and guess Russia\n\n\n5,542 tweets\n\n\n \n\n@notdream: okay you know what, that is IT\n \n\nTwitter DM: @gogyyy, @notdream\n\nnotdream: Okay look\nnotdream: I may not be Sherlock Holmes\nnotdream: But like, I’m not DUMB either\nnotdream: You know what I’m saying, don’t you…Mr. Twitter Description Man.\nGogy: WHAT NO THAT’S NOTME WHA\nGogy: NOIDEA WHADT YOURE TALKING ABOUTt HAHAHAHA !!!!!\nnotdream: bruh why even deny it\nnotdream: like\nnotdream: do you want me to make a powerpoint presentation comparing everything I sent you to the actual trending descriptions and pointing out the similar phrasing and word choice, plus the timestamps of our conversations\nnotdream: Because I can totally do that\nnotdream: Or I can just skip to the good part and tell you the conclusion right now:\nnotdream: CAUGHT IN 4KKKKKKKKKKKKKK\nGogy: FUCKKKKKKKKKKKKKKKKKKK\nnotdream: HAHAHAHAHAHA IT REALLY IS YOU ISN’T IT\nGogy: BRB DELETING ACCOUNT\nnotdream: NOOOOO WAIT COME BACKKKKK\nnotdream: AT LEAST LET ME LAUGH AT YOU MORE BEFORE YOU GO BECAUSE COME ON\nnotdream: THIS IS HILARIOUS AS HELL\nGogy: This is so embarrassing\nnotdream: Oh it totally is\nGogy: Oh my god please don’t tell anyone\nnotdream: My lips are sealed\nnotdream: Man, I’m gonna be laughing about this one forever\nGogy: I’m gonna get so much shit from one of my coworkers about this\nGogy: How the hell did you figure it out???\nnotdream: Did you really think you were being subtle????\nGogy: Was I not?\nnotdream: dude\nnotdream: You know that meme where the one person is like “hey can I copy your homework”\nnotdream: And then the other person is like “sure just change a few things so it’s not obvious”\nGogy: Yeah?\nnotdream: That’s you\nGogy: O-oh!\nGogy:  Well okay then :’&gt;\nGogy: Ok gonna go delete this account forever and then go die of embarrassment in a corner somewhere\nnotdream: Nononono don’t delete your account\nnotdream: I haven’t even told you the best part about all of this\nGogy: ?\nnotdream: Look I’ll just tweet you from my main\nGogy: ???\nnotdream: Okay done\nnotdream: You’ll see in fifteen minutes or so\nGogy: ?????????\nGogy: ?????????????????\n \n@dreamwastaken: Just want to try something here…#HelloTwitterDescriptionMan\n \n\nTWITTER TRENDING\n\n#HelloTwitterDescriptionMan\n\n13,290 tweets\n\n \n\nTwitter DM: @gogyyy, @notdream\n\nGogy: Wait what the fuck\nGogy: No way\nGogy: You cannot possibly be implying what I think you are implying here\n \n\nMessage requests (1):\n\n @dreamwastaken:   What, you don’t like the hashtag I made for you Gogy? :&lt;\n \n\nTwitter DM: @gogyyy, @notdream\n\nGogy: WHAT THE FUCKKKKKKKKKKKKKKKKKK\nnotdream: HAHAHAHAHAHAHHAHAHAHAHAHA\nGogy: OH MY FUCKING GOD\nGogy: YOU HAVE A STAN ACCOUNT FOR YOURSELF????????????\nnotdream: What can I say, I love looking at all the fanart! People are so talented :D\nnotdream: It also happens to be a quite helpful way to keep an eye on any potential drama before it becomes an issue, so there is that, too.\nGogy: WHAT THE FUCKKKKKKKKKKKKKKKKKK\n \n@gogyyy: GOING DARK\n--@sweetchayos: u ok dude?\n----@gogyyy: N O\n--@notdream: HAHAHAHAHAHAHHAHAHAHAHAHA\n \n\nTwitter DM: @gogyyy, @notdream\n\nGogy: To be honest I am not nearly drunk enough to unpack this all right now\nGogy: I cannot believe the one (1) random dream fan I used for help making my descriptions just happened to be Dream himself\nGogy: I am going to use this as proof that the universe must hate me\nnotdream: I actually find this entire thing quite wholesome, I can’t believe you went undercover to make better trending descriptions for me\nGogy: I didn’t want to be fired okay\nnotdream: You know, now that all the cards are laid out, as wild as they are\nnotdream: What if we like…properly teamed up\nnotdream: Send me any trending tags relating to me, I write descriptions for them so they’re not dry as hell like usual, full offence\nnotdream: Like #HelloTwitterDescriptionMan could be “Fans of Minecraft YouTuber Dream greet the Twitter Employee that writes trending tags descriptions – hi! :)”\nnotdream: See that is straight up viral material\nnotdream: Random twitter users are entertained, I get more people interested in my content, my fans are happy\nnotdream: Everyone’s a winner\nGogy: Hmmm\nnotdream: Also you’d get great descriptions without having to do the work\nGogy: You make a convincing argument\nGogy: …You know what, why not.\nnotdream: It’s a deal then, Mr. Twitter Description Man :D\n \n\nText message: George, Unknown Number\n\nUnknown Number: Why hello there Mr. Twitter Description Man\nGeorge: Oh hey, lemme save your number\nthe actual dream wtf: What should I save yours as? Gogy ◉‿◉ ?\nGeorge: …That is just so much worse when not on twitter\nthe actual dream wtf: Too late, already saved it~! G o g y y y\nGeorge: Wow would you look at the time, I have a meeting, gotta go bye\n \n@Dreamwastaken: Okay how about…#TwitterDescriptionManWhatIsYourName\n \n\nTWITTER TRENDING\n\n#HelloTwitterDescriptionMan\n\nFans of Minecraft YouTuber Dream greet the Twitter Employee that writes trending tags descriptions – hi! :)\n\n\n23,933 tweets\n\nHE TALKS\n\n6,482 tweets\n\n#TwitterDescriptionManWhatIsYourName\n\n9,234 tweets\n\n \n\nText message: George, the actual dream wtf\n\nGeorge: OH THAT IS SO CHEATING\nGeorge: FOUL PLAY\nthe actual dream wtf: Here you go: “Twitter users want to know what to call the Twitter Employee that writes trending tags descriptions – ‘Twitter Description Man’ is fine!”\nthe actual dream wtf: See, you don’t even have to actually give your name for that one for it to be fun\nGeorge: like, that’s good and all, but also why are you like this\nGeorge: I already regret agreeing to this\n \n\nTWITTER TRENDING\n\n#HelloTwitterDescriptionMan\n\nFans follow Minecraft YouTuber Dream’s footsteps in greeting the Twitter Employee that writes trending tags descriptions – hi! :)\n\n\n29,579 tweets\n\nHE TALKS\n\n8,312 tweets\n\n#TwitterDescriptionManWhatIsYourName\n\nTwitter users want to know what to call the Twitter Employee that writes trending tags descriptions – ‘Twitter Description Man’ is fine!\n\n\n16,236 tweets\n\n\n \n\n\nText message: George, the actual dream wtf\n\nGeorge: My name is George\nGeorge: Since you were curious\nthe actual dream wtf: !!\nthe actual dream wtf: Well, nice to meet you, George\nthe actual dream wtf: I’m Clay\nGeorge: I’d say I already knew that from the internet but I feel like that’d be a dick thing to say, so thanks I guess\nthe actual dream wtf: I look forward to a long and beautiful partnership :)\n\nTWITTER TRENDING\n\n#TwitterDescriptionManRedemptionArc\n\n5,235 tweets\n\n \n\nText message: George, the actual dream wtf\n\nGeorge: Your fans are trending #TwitterDescriptionManRedemptionArc\nthe actual dream wtf: Nice to see that our partnership is working out\nGeorge: I’d say that I’m proud but it’s really all just you ghostwriting your descriptions this past month, so there’s that.\nthe actual dream wtf: I will pat myself on the back for you\nthe actual dream wtf: “Fans of Minecraft YouTuber Dream cheer at the recent quality of his trending tag descriptions”\nGeorge: Got it!\n \n\nTWITTER TRENDING\n\n#TwitterDescriptionManRedemptionArc\n\nFans of Minecraft YouTuber Dream cheer at the recent quality of his trending tag descriptions\n\n\n8,201 tweets\n\n \nDream’s Bitches Group Chat - Members: 34\nCryptid ☽: YALL LOOK AT TRENDING\nSlooth: YOOOOOOOOO\namnesi_acc | work is theoretically happening rn: Twitter description man saw our hashtag!!!\nThat²³: AWWWWWWWWWW MY HEART\nGogy: &lt;3\nChem: Twitter Description Man x Dream enemies to lovers au???\nGogy: Nope\nnotdream: No way\nbella | day 106 of crying over dream: HAHAHAHAHAHAHA\nGean: LMAOOOOOOOOOOOO\nGean: THE SHUT DOWN\n \n\nText Message: George, Sapnap(on thin ice)\n\nSapnap(on thin ice): Sooo George\nSapnap(on thin ice): I haven’t heard you talk about your mortal enemy recently\nSapnap(on thin ice): …Everything okay bro?\nGeorge: Well, I’ve been thinking\nSapnap(on thin ice): Dangerous\nGeorge: …I hate you\nSapnap(on thinner ice): not my fault that ur too easy\nSapnap(on thinner ice): So what were you thinking?\nGeorge: Welllllll\nGeorge: I may need to downgrade Dream to “former mortal enemy” status\nSapnap(on thinner ice): Ayo ???\nGeorge: I’ve been thinking about it for a while\nGeorge: And I’ve decided that football trends are worse\nSapnap(on thinner ice): Oh yeah?\nGeorge: I mean, Tom Brady,,, like,,,UGHHHHH\nGeorge: Do you KNOW how many grown men simp for him Sapnap\nGeorge: DO YOU KNOW?????\nGeorge: HE’S A FOOTBALL PLAYER FOR FUCK’S SAKE\nSapnap(on thinner ice): Well, I’m glad to see that you’re doing same as always :)\nGeorge: IT MAKES NO SENSE, SAPNAP. NONE\n \n\nTWITTER TRENDING\n\n#tombrady\n\n4,179 tweets\n\ndream’s shoes\n\n3,372 tweets\n\nWHAT ARE THOSE\n\n9,231 tweets             \n\n \n\nText message: George, the actual dream wtf\n\nGeorge: You seriously have no shoe game\nGeorge: In TOTALLY unrelated news, “WHAT ARE THOSE” is trending, along with “dream’s shoes”.  Hmm…\nthe actual dream wtf: for the record no boomer has any right to judge my shoe game\nGeorge: um excuse me???????\nGeorge: Did you just call me a boomer??????????\nthe actual dream wtf: Oh please, you exude boomer energy\nGeorge: Bitch I am 23, didn’t you read my stan twt bio\nGeorge: Don’t make me pull out my carrd because I will\nthe actual dream wtf: No way you are 23\nthe actual dream wtf: 27 at MINIMUM\nGeorge: Why would I lie about that??\nthe actual dream wtf: Send a photo of yourself then\nGeorge: Sure?\n\nPicture sent (1) - Selfie of George smiling brightly\n\nthe actual dream wtf: Lol nice job u catfish\nGeorge: ????? This is literally me????????\nthe actual dream wtf: Lmao, yeah RIGHT\nthe actual dream wtf: A hundred bucks says that’s not you\nGeorge: Bruh\nGeorge: Do you want me to prove it?? This is quite confusing\nGeorge: I mean, I’m down to FaceTime if you are?\nthe actual dream wtf: You know what, sure\nGeorge: Dream face reveal, not clickbait, let’s go\n \n\nFaceTime: George, the actual dream wtf\n\nDuration: 0:00:04\n \n@dreamwastaken: ASJKDJKHFJKHDFHJKDFHJHJKJKHDFS HOT HOT H O T T T T T T ohmygod\n--@BadBoyHalo: Did you burn yourself you muffinhead\n----@dreamwastaken: MISTAKES MAY OR MAY NOT HAVE BEEN MADE\n \n\nText message: George, the actual dream wtf\n\nGeorge: YOU HUNG UP SO FAST LMAOOOOO\nGeorge: I TOLD YOU IT WAS ME YOU LOSER\nthe actual dream wtf: YEAH SO I WAS WRONG\nthe actual dream wtf: YOU’RE NOT A CATFISH I GUESS\nthe actual dream wtf: MY BAD\nthe actual dream wtf: SO SORRY JHSDFHJKDSF\nGeorge: Easiest hundred bucks of my LIFE HAHAHAHAHA\n \nGoogle search: “what do you when your former mortal enemy is actually kinda cute maybe”\n \n\nText message: George, the actual dream wtf\n\nGeorge: Heyyy\nthe actual dream wtf: Hey!!!\nGeorge: So theoretically\nGeorge: If someone were to binge watch your content\nGeorge: Where would be a good place to start\nthe actual dream wtf: !!!\nGeorge: Asking for a friend\nthe actual dream wtf: Naturally, naturally\nthe actual dream wtf: Well my ‘Minecraft, But’ series is the most popular\nthe actual dream wtf: I’d recommend you start with the playlist of those that I have posted on my channel :D\nGeorge: Not me!!! A friend\nthe actual dream wtf: My bad, I’d recommend YOUR FRIEND starts with the playlist of those that I have posted on my channel\nGeorge: Cool cool, thanks, will pass that on\n \n@gogyyy: So it’s 5 am and I have just finished binging all of Dream’s videos. send help\n--@notdream: Oh I’m so glad that your (checks notes) “friend” enjoyed the videos !\n----@gogyyy: GO AWAYYYYYYYYYYYYY\n \n\nTWITTER TRENDING\n\ndream has the flu\n\n3,392 tweets\n\n \n\nText message: George, the actual dream wtf\n\nGeorge: Hope you feel better soon\nthe actual dream wtf: Awww, thanks! :)\nthe actual dream wtf: Wait\nthe actual dream wtf: How’d you know I was sick???\nGeorge: How do you think?????\nthe actual dream wtf: Oh right, duh\nthe actual dream wtf: I’m so out of it today\n \n\nText message: George, the actual dream wtf\n\nthe actual dream wtf: George\nthe actual dream wtf: Georgeeeee\nGeorge: What\nthe actual dream wtf: I’m bored\nGeorge: That’s not my problem\nthe actual dream wtf: I can make a trending tag for you and then it will have to be your problem\nthe actual dream wtf: Checkmate\nGeorge: You are the literal worst\nGeorge: Are you still sick today?\nthe actual dream wtf: Yeah, I’m fully bedridden\nthe actual dream wtf: Thus, my boredom\nGeorge: Well, good luck with that\nthe actual dream wtf: Hey George\nGeorge: Whatttt\nthe actual dream wtf: Did you really used to hate me?\nthe actual dream wtf: Back before we met on stan twitter\nthe actual dream wtf: Which I will never shut up about hahaHA\nGeorge: Oh my god\nthe actual dream wtf: No wait, I really want to know, though\nthe actual dream wtf: Be honest\nGeorge: Hate is a too strong a word\nGeorge: It was more like uhhhhh\nGeorge: You ever have a mortal enemy, but parasocially? It was like that\nthe actual dream wtf: Wait WHAT\nGeorge: Oh my god this is so embarrassing to write this out, don’t interrupt me\nthe actual dream wtf: Sir yes sir\nGeorge: I got a strong sense of…irritation? whenever another stupid tag was trending\nGeorge: And let me tell you, there was always another stupid tag trending\nGeorge: A lot of them were hard to figure out why they were even trending in the first place\nGeorge: And I guess part of the negative emotions I had for the stupid tags wore off to how I perceived you and your content\nGeorge: So I had a general distaste for you without having seen any of your content because of that association\nthe actual dream wtf: Wow, I say be honest and you drop a diss track\nGeorge: Sorry\nthe actual dream wtf: No, don’t be, I asked for that\nthe actual dream wtf: Well, I can see why having to deal with all the trends would get old\nGeorge: It’s much better now that I have you to translate what’s going on\nGeorge: Thank you for that\nthe actual dream wtf: It’s actually kinda fun writing those\nGeorge: Tell you what, if being a Minecraft youtuber doesn’t pan out, I will recommend you to the twitter.com hiring team\nthe actual dream wtf: I’m flattered\nGeorge: Full disclosure: the pay is shit\nthe actual dream wtf: Lmao, noted\nGeorge: Hey, look\nGeorge: I’m sorry\nthe actual dream wtf: ?\nGeorge: For not giving you and your fandom a proper chance, before\nGeorge: Everyone is actually quite friendly\nGeorge: And the trends are for the most part funny if you’re in on the inside joke\nGeorge: And I can’t believe I’m saying this but\nGeorge: Your content is actually quite good\nGeorge: It was stupid and immature of me to be biased against you before, so I’m sorry\nthe actual dream wtf: Apology accepted :)\nGeorge: Oh, speaking of, you’re trending again\nGeorge: It’s quite wholesome, #restwelldream\nDream: Do you want to facetime again for a few minutes to hash out the description? My thumbs are getting tired\nGeorge: Yeah, sure\n \n\nPhone call: George, the actual dream wtf\n\nDuration: 3:37:05\n \n@gogyyy: Wtf that was the fastest three and a half hours of my life\n--@notdream: Vouch\n---@gogyyy: DIDN’T I SAY GO AWAYYYYYYYYYY\n---@gogyyy: why do you even follow this account still\n----@notdream: Damn and here I thought we were Bonding™\n-----@notdream: Call tomorrow?\n------@gogyyy: I’d love to :)\n-------@mayamoon: oomfs need to get a room\n \n\nText Message: George, Sapnap(Bitch)\n\nGeorge: Sapnap\nGeorge: I’ve messed up\nSapnap(Bitch): I call your office chair\nGeorge: ???\nGeorge: I WASN’T FIRED YOU ASS\nSapnap(Bitch): Damn\nGeorge: I will actually kill you\nSapnap(Bitch): I mean, oh that’s great !\nSapnap(Bitch): What’s up\nGeorge: I maybe kinda possibly maybe could have maybe caught feelings for someone\nGeorge: maybe\nGeorge: Please advise\nSapnap(Bitch): O-OH????\nSapnap(Bitch): WTF\nSapnap(Bitch): Who?????? Do I know them?????\nGeorge: Uh it’s Dream\nSapnap(Bitch): Dream\nSapnap(Bitch): As in, famous Minecraft youtuber Dream?\nSapnap(Bitch): As in, your self-proclaimed mortal enemy Dream?\nGeorge: Former* mortal enemy!!!\nSapnap(Bitch): Uh huh…?\nGeorge: Yep, that's the guy I’m talking about!\nSapnap(Bitch): ....OHHHHHHHHHHH \nSapnap(Bitch): LMAOOOOOOOO\nSapnap(Bitch): I thought you were serious for a second there and nearly had a heart attack\nSapnap(Bitch): Hah!! You having a crush on Dream, what a thought\nSapnap(Bitch): Good one bro, you got me\nGeorge: …\nSapnap(Bitch): ……\nSapnap(Bitch): What.\nGeorge: Yeah.\nSapnap(Bitch): You’ve got to be joking.\nGeorge: I really, really wish I was.\nSapnap(Bitch): UM.\nGeorge: So we’ve been texting for a while now, but today was the first time we’ve talked over the phone and boy oh boy am I in over my head\nGeorge: He’s just so easy to talk to???\nGeorge: And maybe just a little cute as well\nGeorge: maybe\nGeorge: hhhhhhHHHHhh\nSapnap(Bitch): Woah woah woah\nSapnap(Bitch): Hold on a second\nSapnap(Bitch): You’re going to have to back up, like ten steps here for me\nSapnap(Bitch): You’ve been texting…Dream????? As in the minecraft youtuber Dream????  You actually know him????????\nGeorge: Yeah, it’s kinda complicated but long story short we met on stan twitter\nSapnap(Bitch): ??????????????????????????????????????????????????\nGeorge: Okay so it’s a bit of a long story but anyways can we please focus on what’s important here??? I may or may not have a crush and need advice Sapnap, please helpppp\nSapnap(Bitch): …You have to understand that this is a very surreal conversation for me\nGeorge: I know, sorry\nGeorge: I just didn't know who else I could go to for advice ;-;\nSapnap(Bitch): ...One second\n \nGoogle search: “how to help friend with a crush”\n \n\nText Message: George, Sapnap(Bitch)\n\nSapnap(Bitch): Okay so here’s what you have to do\nSapnap(Bitch): 1. Continue talking with him and get to know him more\nSapnap(Bitch): 2. Figure out if you still are interested in him\nSapnap(Bitch): 3. Try and figure out if he might be interested back\nSapnap(Bitch): 4. If the signs look good then go ahead and ask him out! This guide was brought to you by WikiHow\nSapnap(Bitch): Oops, ignore that last part haha, just a joke and totally not copy pasted hahaha\nGeorge: Ok four steps, I can do that!!! You’re the best Sapnap, thank you!!!!  ( ＾◡＾)っ❤\n \n@Twitter: POLL: so does love make people act weird or something?????????\nA) Yes – 38943 votes (56.85%)\nB) Yes – 29347 votes (43.15%)\n@tae_innit: So I drew some Twitter Description Man fanart because he has been redeeming himself lately uwu\n\nAttached – A drawing of a cute anime boy with long hair, wearing glasses and a light blue hoodie with a Twitter logo\n\n--@tae_innit: Oh wow this popped off????\n---@ranboop_: You literally called him a boomer three months ago, where is this cute anime boi energy coming from\n----@tae_innit: Shhhhhhh don’t expose me\n-----@tae_innit: To be fair, he did have big boomer energy back then asjkasdhjsd\n \n@tae_innit: ALRIGHT\n@tae_innit: YOU KNOW WHAT\n@tae_innit: If I get to 1000 followers in the next 5 hours I will draw Twitter Description Man x Dream fanart\n--@c_albb: TAE N OO O O OO O\n \n@tae_innit: WTFFFFF I LOOK AWAY FOR AN HOUR AND NOW I HAVE 1830 FOLLOWERS ??????? YALL BE SO THIRSTY THAT IT AMAZES EVEN ME\n \n@tae_innit: Well y'all, don’t let it be said that I’m not an artist of my word o7\n\nAttached – Fanart of Dream kissing anime Twitter Description Man in a meadow, under a sizzling sunset \n\n--@stupidsanbii: UH ??????\n--@ItsMoonjiMoth: HELLO???\n--@ThatIsImportant: This had NO RIGHT to be as spicy as it was wtf\n--@CaffeineChmist: ......do you have any more where this came from? asking for a friend\n--@c_albb: …oomf… you got clout…… but at what cost…………\n----@tae_innit: i have no regrets\n \n@tae_innit: NOT THE DREAM FANART ACCOUNT LIKING IT SHSDJJDFJKHDFHJK DREAM I AM SO SORRYYYY I REGRET EVERYTHING AHHHHHHHHHHHHSADKJSADHASD\n \n@NekoKat14: Okay but like what would That ship name even be?  Dwitter?? Tream???? Drending????\n--@SleepySlooth: Twitter Description Man x Dream.... DescDream?\n----@stupidsanbii: DESCDREAM HAHHAHAHHAHAHA\n@ThatIsImportant: DescDreamtwt rise UP we ride at dawn\n \n\nTWITTER TRENDING\n\n#tombradyGOAT\n\n1,183 tweets\n\nDescDream\n\n4,283 tweets\n\n \n@c_albb: TAE .....WHAT HAVE YOU DONE ...........\n--@tae_innit: ..........oops?\n \n@gogyyy: I just woke up, what is DescDream and why is it all over my timeline\n--@c_albb: Go back to bed\n \n\nText message: George, the actual dream wtf\n\nGeorge: So your fans accidentally started trending what I’m decently sure is the ship name for you and me, the twitter description man\nthe actual dream wtf: W H A T\nthe actual dream wtf: HAHAHAHAHHAHAHA NO WAY\n \n\nTWITTER TRENDING\n\n#tombradyGOAT\n\n1,483 tweets\n\nDescDream\n\nFans of the Minecraft YouTuber Dream discuss the fictional romantic pairing between him and the Twitter Employee that writes trending descriptions\n\n\n7,283 tweets\n\n \n@karaamochi: Alright dreamtwt it’s time to have a talk. /srs /neg (1/8)\n@karaamochi: We as a fandom need to have a discussion about this kind of thing.  Like even if it’s just a “joke” or “meme” ship, the fact that it was talked about to the point that the twitter description man saw it is NOT okay.  We don’t even know if he is okay with himself being shipped like that. (2/8)\n@karaamochi: It’s as bad as donating to a CC about ships.  Don’t do it.  This crosses all sorts of personal boundaries and is a terrible….\n \n@SleepySlooth: …I’m just saying, there IS a way to find out his boundaries… #TwitterManIsItOkayIfWeShipYou\n--@c_albb: no\n---@tae_innit: #TwitterManIsItOkayIfWeShipYou\n----@c_albb: nO\n \n\nTWITTER TRENDING\n\n#tombradyGOAT\n\n2,483 tweets\n\nDescDream\n\nFans of the Minecraft YouTuber Dream discuss the fictional romantic pairing between him and the Twitter Employee that writes trending descriptions\n\n\n19,389 tweets\n\n#TwitterManIsItOkayIfWeShipYou\n\n3,285 tweets\n\n \n\nText message: George, the actual dream wtf\n\nGeorge: Please pick your fandom up, they’re drunk\nGeorge: #TwitterManIsItOkayIfWeShipYou is trending now\nthe actual dream wtf: …Well.\nthe actual dream wtf: It’s nice of them to ask about your boundaries? Ahahahahaha\nGeorge: -.-\nthe actual dream wtf: Uh how about “Twitter users respectfully inquire about the personal boundaries of the twitter employee that writes the trending descriptions” and then add your thoughts. \nthe actual dream wtf: All the shipping stuff doesn’t bother me at all, but if it bothers you then you should say something! No worries whatever you decide. :)\n \n\nTWITTER TRENDING\n\n#tombradyGOAT\n\nYet again, twitter users discuss footballer Tom Brady’s best plays\n\n\n2,683 tweets\n\nDescDream\n\nFans of the Minecraft YouTuber Dream discuss the fictional romantic pairing between him and the Twitter Employee that writes trending descriptions\n\n\n26,472 tweets\n\n#TwitterManIsItOkayIfWeShipYou\n\nTwitter users respectfully inquire about the personal boundaries of the twitter employee that writes the trending descriptions - go wild!\n\n\n4,185 tweets\n\n \n@CaffeineChmist: bruh\n@sweetchayos: UM???? AM I SEEING THAT RIGHT\n@ThatIsImportant: OH HE’S INTO IT\n@tae_innit: TWITTER DESCRIPTION MAN’S NEW ENERGY IS THAT MEME WHERE THE CAT GOES I SEE NO GOD HERE…OTHER THAN ME!!!!!\n@SleepySlooth: TWITTER MAN IS INTO IT, JUST SAYING\n@quacktvt: NOT EVEN A “IT DOESN’T BOTHER ME” OR \"IT'S FINE\" ... HE DEADASS SAID “GO WILD”  GO W I L D\n@ItsMoonjiMoth: DESCDREAMTWT TONIGHT WE T H R I V E\n@mayamoon: DESCDREAMTWT STAYS WINNING\n--@c_albb: DescDreamTwt was literally made an hour ago as a meme what do you mean you ‘stay winning’\n----@mayamoon: YOUR POINT???? WE’VE YET TO TAKE AN L\n@NekoKat14: …so we all agree he’s into it right\n@IncorrectTwitterDescriptionManQuotes: Description Man: …Yall got any more of that descdream fanart?\n--@gogyyy: ahaha\n@bellabel: The sexual tension between dream and the man that sees all our dumbass trends about him\n@ranboop_: TWITTER MAN IS TOTALLY INTO DESCDREAM,,, JUST SAYING,,,,,,\n@Ph1LzA: Twitter Description Man woke up today and chose chaos\n \n\nText Message: George, Sapnap\n\nGeorge: Okay. so.\nGeorge: It has been a couple of months since I first talked with Dream\nGeorge: I’ve spent hours talking to him on the phone almost every day now\nGeorge: Anddddd my crush on him has only grown\nGeorge: It’s probably the size of the moon right now\nGeorge: So now how do I do step three\nSapnap: Step three??\nGeorge: “Try and figure out if he might be interested back”\nSapnap: Ah right\nSapnap: Are you telling me that entire thing wasn’t just some fever dream????\nGeorge: Dream has a fever????\nSapnap: You know what, never mind\nSapnap: Just ask him, dude\nGeorge: No way, that’d be so awkward omg\nGeorge: What if he’s not interested???\n \n@Twitter: does anyone else feel like they’re stuck in middle school all over again. for absolutely no reason in particular\n \n\nText Message: George, Sapnap\n\nSapnap: Alright, listen, I’ll do some research, okay?\nSapnap: You sit tight\n \n@dream_spotify: Dream is currently listening to: Pocketful of Sunshine by Natasha Bedingfield\n@dream_spotify: Dream is currently listening to: Love Story by Taylor Swift\n@dream_spotify: Dream is currently listening to: Just the Way You Are by Bruno Mars\n@dream_spotify: Dream is currently listening to: Pocketful of Sunshine by Natasha Bedingfield\n@dream_spotify: Dream is currently listening to: Love You Like a Love Song by Selena Gomez and the Scene\n@dream_spotify: Dream is currently listening to: Pocketful of Sunshine by Natasha Bedingfield\n@dream_spotify: Dream is currently listening to: sunkissed by Khai Dreams\n\n \n\n\nText Message: George, Sapnap\n\nSapnap: Yeahhh, he’s head over heels in love right now\nGeorge: !!!!!!!!!!!!!!!!!!!!!!!!\nGeorge: THANKS SAPNAP, YOU’RE THE BEST!!!!\nSapnap: Nooooo problem.\nSapnap: So are you going to ask him out or what\nGeorge: No wayyyyyy that would be way too awkward\nGeorge: What if he rejects me????\nSapnap: OH. OH MY FUCKING GOD\n \n\nTwitter DM: @sapnap, @notdream\n\nSapnap: Hey\nSapnap: Hey\nSapnap: Hey\nSapnap: Hey there\nSapnap: HELLO ANYONE THERE\nSapnap: YO WTF DON’T IGNORE ME MAN WE NEED TO TALK\nSapnap: What can get your attention\nSapnap: GEORGE GEORGE GEORGE GEORGE GEORGE GEORGE GEORGE GEORGE\nnotdream: Can I help you?\nSapnap: OH FINALLY\nSapnap: Yeah you know George? The George that’s been talking with you\nSapnap: Description guy or whatever they call him these days\nnotdream: Yeah?\nSapnap: He’s my best friend. We’re coworkers, I run the twitter account\nnotdream: Sorry, which twitter account are you talking about?\n \n\nMessage requests (1):\n\n @Twitter:   T H E TWITTER ACCOUNT, BITCH\n \n\nTwitter DM: @sapnap, @notdream\n\nnotdream: O-oh :o\nnotdream: Well hello there Sapnap! How can I help you?\nSapnap: I just wanted to say\nSapnap: If you break his heart, I will actually murder you\nnotdream: We’re not dating??\nSapnap: Oh trust me I know\nSapnap: Point stands\nnotdream: Okay twitter man, I will never break other twitter man’s heart, cross my heart and hope to die\nSapnap: Excellent, glad we understand each other.\n \n@sapnap: oh my god, I just spoke to my favorite content creator!!!! literally shaking rn, can’t believe that just happened. life is fucking awesome\n--@notdream: You literally threatened me wtf\n---@sapnap: yeahhh sorry about that mate. but it just had to be done. bro code and all. (sorry again)\n----@gogyyy: ????????????????\n\nText message: George, Dream!!!\n\nGeorge: Well Dream, I have crunched the numbers\nDream!!!: Let me guess, I should post more cat pictures\nGeorge: Um\nGeorge: Excuse me\nGeorge: I haven’t even started my analysis here :/\nDream!!!: Sorry, sorry, go on ahead\nDream!!!: I’ll be quiet\nGeorge: Okay so!!! in the four months we’ve been properly chatting, you or something related to you has trended 78 times.\nGeorge: Which, just for the record, makes you the number two trendable topic on twitter\nDream!!!: What’s number one?\nGeorge: Tom Brady, god I hate that man\nDream!!!: tf did Tom Brady ever do to you???\nGeorge: Exist\nDream!!!: …did Tom Brady replace me as your parasocial mortal enemy?\nGeorge: No comment\nDream!!!: And here I thought I was special ;-;\nGeorge: I SAID NO COMMENT\nDream!!!: Sure, sure, go on about my trends then\nGeorge: Yeah so of your trend descriptions, you’ve written 59 of them, with the others having been trending at times you were busy or asleep\nGeorge: Your cat Patches was the most frequent trend, trending on seven separate occasions\nGeorge: And on those seven occasions, not only was the clickthrough rate of the trending tag among the highest of the day, but you also got a relatively higher bump in new twitter followers\nGeorge: So what I’m trying to say here is…\nDream!!!: …I should post more cat pictures?\nGeorge: …You should post more cat pictures\nDream!!!: Noted, thank you Mr. Twitter Description Man\n \n@dreamwastaken: Twitter Description Man pls forgive me for not posting pictures of Patches in a while, I know you must have missed her #Patches\n\nPicture attached (1) – A picture of Patches curled up, looking extremely adorable\n\n \n\nTWITTER TRENDING\n\n#Patches\nAt long last, Minecraft YouTuber Dream updates his fanbase with pictures of his incredibly adorable cat, Patches! :D\n\n3,423 tweets\n\n\n \n\n@stupidsanbii: jasdjhasdjkhad descdream just confess your love for each other pLEASE\n@SleepySlooth: Okay but descdream is honestly the cutest #patches\n@ranboop_: DescDream literally started ironically but somehow isn’t anymore.  So what I’m saying is, descdream is the dab of ships send tweet\n@NekoKat14: patches is cute but lets be real, the descdream content is cuter\n--@c_albb: oomf u better take that back right now, patches &gt;&gt;&gt;&gt;&gt;\n----@dreamwastaken: No ur oomf is right\n------@c_albb: UM HELLO???????\n------@gogyyy: you are on the wrong account dream, you absolute dumbass\n--------@dreamwastaken: idk, am I? :P\n@mayamoon: DESCDREAMTWT, TODAY WE FEASTTTTTT JDFJDSDDFFSJJKHSDF\n \nDream’s Bitches Group Chat - Members: 35\namnesi_acc | I’M WORKING I PROMISEEEE: HFDHFDHJFD TOMMY NOOOOOOOOOOOO\nFluffy Moon || BLM: OMG\nGogy: What’d Tommy do??\nCryptid ☽: Wilbur was like, “Oh no, BLOW IT UP is trending number two in the UK”\nCryptid ☽: And then Tommy responded “It’s fine, Dream’s boyfriend can explain it to the locals” LMAOOOOOO\nbella | day 195 of crying over dream: OMG TOMMYYYYY\nGogy: HHHHHHHHHHHHHHHHHHHH\nnotdream: HHHHHHHHHHHHHHHHHHHHHHHHHHHHHH\nChem: ONE OF US!!!!!!  ONE OF US!!!!!!!!!!!\nCryptid ☽: IT WAS JUST A JOKE GUYS, DON'T READ TOO DEEPLY INTO IT\nSlooth: DESCDREAM SUPREMACY!!!!!!!!!\n \n\nText Message: George, Sapnap\n\nSapnap: So, Dream’s boyfriend, eh?\nGeorge: WE’RE NOT DATING SAPNAP, IT WAS JUST A JOKE FROM TOMMY AJHJAKSFHJKAFH\nSapnap: You mean, you’re not dating yet*\nGeorge: HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH STOPPPPPPPPPPPPPPPPP\nSapnap: Seriously man you just gotta confess, this is just embarrassing for you at this point\nGeorge: SOON OKAY???? IM WAYYYY NOT READY FOR THAT RIGHT NOW\nSapnap: Alright buddy, whatever you say\n \n@Twitter: does anyone else ever get the urge to just [INCOHERENT SCREAM] or is that just me\n--@c_albb: nope, not just you Mr. Twitter ™ man\n----@Twitter: Okay great, thanks\n \n\nText message: George, Dream!!!\n\nDream!!!: Hey!!\nDream!!!: Sooooo I’m about to play Among Us with a few friends, there’s a spot in the lobby if you’re not busy\nDream!!!: I’m not streaming but I think a couple of them are though\nDream!!!: Would you be interested in joining in maybe?\nDream!!!: No pressure or anything!!\nGeorge: I mean, if you’ll be there I’d be down for anything\nDream!!!: JSDFJKDSFHJK\nDream!!!: OKAY COOL GIMME A SEC AND I’LL SEND YOU THE CODE THEN!!!!\nGeorge: :D\n \n@dream_updates: Dream is currently playing Among Us with BBH, WilburSoot, TommyInnit, Philza, Quackity, Tubbo, Ranboo, Karl, and someone named George!\n--@CaffeineChmist: ¾ curse strikes aGAIN ARE YOU FUCKING KIDDING ME\n--@stephisoftie: Wait who’s George\n----@dream_updates: We don’t recognize him, he might be an irl friend of Dream’s based on their conversations so far? He sounds British, that’s about all we know ^^;\n\n \n\n@SleepySlooth: So we all agree that that was the most hilarious among us game ever yes? Yes.\n@quacktvt: Yall seriously WHO IS GEORGE, he and Dream have the best dynamic ever????\n@CaffeineChmist: Dream and George are just….the cutest???? Has Dream ever laughed that much before?????\n@mayamoon: This is now a george stan account don’t @ me\n@George_Updates: Hello everyone!!! we’re a new updates account for Dream’s friend George, please DM if you’re interested in helping out as an admin~!\n@sweetchayos: Unfollow me right now, ‘COME HERE GEORGE’ is the only thing I'm gonna talk about for the next two weeks\n@ItsMoonjiMoth: how tf does no one know who George is, I’m actually crying\n \n\nText message: George, Dream!!!\n\nGeorge: I CAN’T BELIEVE YOU TRICKED ME THAT LAST GAME YOU ABSOLUTE BASTARD\nGeorge: LOOK #RIPGEORGE IS EVEN TRENDING NOW, I HATE THIS\nDream!!!: Hahahhahaha\nGeorge: YOU ARE THE LITERAL WORSTTTTT I TRUSTED YOU\nGeorge: I defended your innocence to badboyhalo!!!! I let badboyhalo down I am a MONSTER\nDream!!!: Sucks to SUCK\nGeorge: Hey I have a video idea for you motherfucker: Minecraft but I just try to freaking kILL YOU THE ENTIRE TIME\nDream!!!: …wait a second\n \n@dreamwastaken: New video is out!!! Minecraft Speedrunner VS Hunter\n \n@_xyzeia: GEORGE!!!! MY BELOVED!!!!!!!!!\n@George_Updates: YESSSS!!!!!!! WE’RE EMPLOYED!!!!!!!!!!!!!!\n@c_albb: GEORGE IS BACK!!!!!!! AND DUDE WHAT THAT VIDEO WAS SO GOOD????? \n \n@mayamoon: Okay yall might hate me for this but,,,George/Dream &gt; Twitter Description Man/Dream send tweet\n--@tae_innit: H o t take\n--@SleepySlooth: Oomf gonna get her ass cancelled\n--@dekudancee: No but like low-key,,,,agree #teamgeorge\n--@linb3at: you can pry descdream out of my cold dead hands #teamdescriptionman\n@SleepySlooth: #teamdescriptionman\n@mayamoon: #teamgeorge\n@NekoKat14: #teamdescriptionman\n@ThatIsImportant: #teamgeorge\n@c_albb: .....SO WE’RE DOING THIS AGAIN GUYS????? REALLY????????  REALLY???????????????\n \n\nTWITTER TRENDING\n\n#TampaBayBuccaneers\n\n3,193 tweets\n\n#teamdescriptionman\n\n2,124 tweets\n\n#teamgeorge\n\n1,523 tweets\n\n \n\nText message: George, Dream!!!\n\nGeorge: Hey are you up?\nGeorge: I need help with a couple of descriptions\nGeorge: Dreammmmmmm\nGeorge: Damn okay, I guess it is late by you\nGeorge: ….How tf am I supposed to write a trend about myself???? This is weirddddd\nGeorge: Man I wish you were awake because I gotta be honest with you, I am terrified that people will make the connection that I’m the Description Man\nGeorge: Need to play it cool\n \n\nTWITTER TRENDING\n\n#TampaBayBuccaneers\n\nIn a surprising turn of events, the Tampa Bay Buccaneers won their last game, 31-9\n\n\n3,193 tweets\n\n#teamdescriptionman\n\nTwitter users discuss the fictional romantic pairing between Dream and the Twitter employee that writes trending descriptions, a ship which has been popular over these last few months\n\n\n3,129 tweets\n\n#teamgeorge\n\nTwitter users discuss the fictional romantic pairing between Dream and George, a random man Dream has occasionally talked with\n\n\n2,527 tweets\n\n \n@NekoKat14: UM\n@SleepySlooth: .....are...are you all seeing this...\n@dekudancee: d-does twitter description man have,,, actual beef,,, with George,,,,, \n@sweetchayos: IM CRYING THIS IS THE FUNNIEST THING THAT’S EVER HAPPENED ON THIS BIRD APP\n@ItsMoonjiMoth: DO I SMELL A JEALOUSY ARC???????\n@CaffeineChmist: The sHADE IM HOLLERING\n@ThatIsImportant: Damn description man really did my man George dirty like that smh #teamgeorge\n@stupidsanbii: THIS. THIS IS WHY I AM TEAM DESCRIPTION MAN\n@tae_innit: “RANDOM MAN” OMG DESCRIPTION MAN ILY #teamdescriptionman\n \n\nText message: George, Dream!!!\n\nDream!!!: So George\nDream!!!: I wake up\nDream!!!: And immediately check my stantwt account, as one does\nGeorge: As one does\nDream!!!: And what do I see?  My stantwt timeline is in shambles, arguing about something along the lines of #teamgeorge vs #teamdescriptionman\nDream!!!: Care to explain?\nGeorge: Uhhhh yeah\nGeorge: So about that\nGeorge: I may have accidentally broke twitter last night\nDream!!!: What, exactly, did you do.\nGeorge: ...So I may have accidentally created a shipping war between you, myself and my alter ego while you were asleep?\nGeorge: .....happens to the best of us right? ahaha\nDream!!!: Oh. my god\nDream!!!: Only you, George\n \n\nText message: George, Dream!!!\n\nGeorge: Heyyyy so question for you\nGeorge: How difficult is it to start streaming?\nDream!!!: !!!!!!\nDream!!!: You want to be as streamer???\nGeorge: Maybe it’ll be a side thing, idk\nGeorge: But hhhh it’s been fun gaming with you though, I wouldn’t mind trying streaming out so we could do that more often\nDream!!!: !!!!!!!!!!\nDream!!!: I’ll send you a list of my recommended setup!!! :D\n \n\nText Message: George, Sapnap\n\nSapnap: Sooooooo George, if you’re free for a few minutes, I need to walk you through how today went for me.\nGeorge: Sure?\nSapnap: So. After another long day of running the official Twitter account\nSapnap: I get home, just wanting to relax for a while\nGeorge: Alright…?\nSapnap: So I go to Twitch.tv\nGeorge: Ohhhhh\nSapnap: And wHO DO I SEE ON THE FRONT PAGE\nGeorge: OHHHHHHHHHHH\nSapnap: RIGHT UP THERE IN MY RECOMMENDED BETWEEN FREAKING POKIMANE AND LUDWIG\nSapnap: THAT’S RIGHT, IT’S MY BEST FRIEND, GEORGE\nGeorge: Oh hey that’s me!\nSapnap: WHO APPARENTLY HAS A TWITCH CHANNEL\nSapnap: AND IS PLAYING MINECRAFT\nSapnap: WITH DREAM\nSapnap: WITH WELL OVER 50,000 PEOPLE WATCHING\nSapnap: PLEASE EXPLAIN\nGeorge: Ahaha\nGeorge: So\nGeorge: You know how I was on Dream’s manhunt video right\nSapnap: You told me that was “just a one time thing” and you “weren’t gonna jump careers overnight”\nGeorge: Well yeah but like\nGeorge: People liked the content, you know? And it was really fun to make that video\nGeorge: And so I thought, why not just try streaming out for a bit, just as a side thing?\nGeorge: And then Dream helped me get a good setup picked out\nSapnap: Uh huh\nGeorge: So here I am, Twitter Description Man by day, twitch streamer by night\nSapnap: …Ok clark kent\nSapnap: Don’t forget about me when you get famous\nGeorge: K\n \n\nText Message: George, Sapnap\n\nSapnap: Wait hang on\nSapnap: How much do you get paid for this hobby of yours\nSapnap: George?????\n \n\nText Message: George, Sapnap\n\nSapnap: No you know what\nSapnap: Pass your specs on to me, I want to try out this streaming thing for myself\nGeorge: Twitter doesn’t pay us enough, eh?\nSapnap: TWITTER DOESN’T PAY US ANYTHING, GEORGE\nSapnap: WE’RE LITERALLY UNPAID INTERNS\n \n\nText Message: George, Sapnap\n\nGeorge: Do you want to help me kill Dream\nSapnap: OH GOD NO DID HE BREAK YOUR HEART\nSapnap: I ALWAYS KNEW THAT MOTHERFUCKER WAS NO GOOD FOR YOU, OH YOU POOR THING\nSapnap: DON’T YOU WORRY ABOUT A THING, I WILL OBLITERATE HIM FOR YOU\nGeorge: SAPNAP NO WAIT STOP\nGeorge: I MEANT HELP ME KILL DREAM ******IN MINECRAFT******\nGeorge: LIKE IN ONE OF THOSE MANHUNT VIDEOS\nSapnap: …oh of course! haha\nSapnap: Ignore the last few messages, I didn’t really mean them ahaha\nSapnap: Ahahahaha\nGeorge: ..........\nSapnap: ....oops?\n \n@dreamwastaken: New video is out!!! Minecraft Speedrunner VS 2 Hunters\n \n@mayamoon: #TeamGeorge…just saying\n@NekoKat14: never forget your roots #TeamDescriptionMan, stay strong\n@stupidsanbii: people still simping for the description man when a whole-ass george is Right There, I don’t get it #TeamGeorge\n@tae_innit: Reject modernity Embrace tradition #TeamTwitterDescriptionMan\n@c_albb: TEAM STOP BICKERING AND ENJOY THE MANHUNT YOU IDIOTS\n@karaamochi: So Dream, Sapnap, George….if they’re gonna collab a ton then they need a group name!  Dream Team?\n \n@dreamwastaken: Dream Team. :)\n\nTWITTER TRENDING\n\n#RanbooSaysHi\n\nMinecraft streamer Ranboo wanted to join in on the meta fun of talking to the Twitter employee that writes the trending descriptions, and asked his fans to pass on a greeting from him - hello right back at you, Ranboo! :D\n\n\n4,294 tweets\n\n \n\nText Message: George, Sapnap\n\nGeorge: Holy SHIT Sapnap, I almost messed up so badly today\nSapnap: What happened??\nGeorge: So I was chilling with Ranboo on stream earlier\nGeorge: And then he started a bit about saying hi to the Twitter Description Man\nGeorge: And I just BARELY stopped myself from responding to him then and there\nSapnap: Oh…that would have been bad\nGeorge: I think I’ve reached the point where I no longer enjoy being Clark Kent\nGeorge: It’s starting to get confusing keeping my identities separate from each other, especially now that I’m actually regularly interacting with the people that I write trending descriptions about\nGeorge: And the entire #teamgeorge vs #teamdescriptionman thing REALLY isn’t helping\nGeorge: …I’m growing more and more worried that my identity will leak before I’m ready to reveal it\nSapnap: And when do you think you’ll be ready to reveal it?\nGeorge: Hmm…\nGeorge: Probably when I figure everything with Dream out?\nSapnap: BRO\nSapnap: WHAT IS THERE LEFT TO FIGURE OUT???????\nSapnap: IT’S SO OBVIOUS THAT YOU IDIOTS BOTH LIKE EACH OTHER\nGeorge: OKAY BUT I STILL HAVE TO LIKE CONFESS AND STUFF SDJKHDFJDFJDF GET OFF MY BACKKKKKKKKKK\nSapnap: George, and I say this as your friend… one of these days you really just need to sit down and sort out your shit\nGeorge: Yeah yeah, that’s on my bucket list\n \n@ItsMoonjiMoth: HOLD UP I JUST REALIZED THAT THERE ARE NOW FANS OUT THERE THAT DON’T REMEMBER A TIME WHEN DESCRIPTION MAN WAS OUR NUMBER ONE ENEMY\n--@carrotboichan: Hang on what??  But descdream is so cute?????\n----@ItsMoonjiMoth: …nature is healing\n \n@blve_bellflower: i want to take a nap but I feel like something Big is about to happen. i just feel it in my bones.\n@blve_bellflower: …Nah it’s probably nothing, see you in a bit everyone! zzz\n--@m0ssyst0ne: don’t worry, i’ll wake u up if smthn happens\n----@blve_bellflower: ty oomf!!\n \n@bovinophobe: Woah hold on what\n@egghhhhhhhhh: did you guys see…\n@pigeonat2: SOMEONE TELL ME IS THAT LEGIT??????\n@NekoKat14: IS THAT REAL????????\n@m0ssyst0ne: UH @BLVE_BELLFLOWER I THINK YOU SHOULD MAYBE WAKE UP??????????\n@v_serks: WHATTTTTTTTTTT\n@Lindsflea: OH MY GOD THAT CAN’T BE REAL!!!!!!!! IS IT REAL???????????\n@HarleyBritton2: NO WAY\n \nDream’s Bitches Group Chat - Members: 36\nGogy: Yo is something happening??? My tl is acting all weird rn\nChem | teamgeorge: OMG GOGY, HOLY SHIT IS THERE T E A TO SPILL\nGogy: ????????\nChem | teamgeorge: SOOOOO\nChem | teamgeorge: SOMEONE ON TIKTOK DID SOME DIGGING\nChem | teamgeorge: AND YOU’LL NEVER GUESS WHAT THEY FOUND\nGogy: ??????????????\nChem| teamgeorge: APPARENTLY SAPNAP WORKS AT TWITTER ??????\nThat²³: W H A T\namnesi_acc | what is work, really: WAIT WHAT??!!!!!\nbella | day 251 of crying over dream: NO WAYYYY THAT HAS TO BE FAKE RIGHT????\nwil²³ .  descdream supremacy: HANG ON WHATTTTTT !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n \n@Areto123: SAPNAP WORKS AT TWITTER???????????\n@Carrotboichan: I LOOKED UP THE SOURCE, IT’S LEGIT!!!!!!\n--@whitestarsnmoon: JKDFJDSFJKSDFJHKDF FOR REAL??????????\n----@Carrotboichan: YES!!!!!\n-------@whitestarsnmoon: HOLY SHIT!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n@HarleyBritton2: SAPNAP IS A TWITTER EMPLOYEE??????\n@m0ssyst0ne: @BLVE_BELLFLOWER WAKE UP WAKE UPPPPPPPP IM BEGGING PLEASE OH MY GODDDD\n@v_serks: ARE YOU GUYS THINKING WHAT IM THINKING\n@bovinophobe: THEN THAT MUST MEAN -\n \nDream’s Bitches Group Chat - Members: 36\nGogy: wait why is that a big deal?????\nChem | teamgeorge: oomf….do you really need me to spell it out for you????\nGogy: YES!!!!\nChem | teamgeorge: Well……\n \n@egghhhhhhhhh: SAPNAP HAS TO BE THE DESCRIPTION MAN!!!!!!!\n@Carrotboichan: HE’S THE TWITTER DECRIPTION MAN!!!!!!!!!\n@Lindsflea: SAPNAP IS THE TWITTER DESCRIPTION MAN?!?!?!?!?!??!?!?!!!\n@JournoLily: SAPNAP IS RLY THE DESCRIPTION MAN IM SCREAMINGGGGGGGGG\n@lvdsmei: WAIT B/C SAPNAP BEING THE DESCRIPTION MAN JUST MAKES SO MUCH SENSE?????? LIKE THAT’D BE HOW HE MET DREAM AND EVERYTHING??????????\n \n\nText Message: George, Sapnap\n\nGeorge: Please for the love of god don’t open twitter right now\nSapnap: wtf did you do\nGeorge: NOTHING IT WAS SOME TIKTOK PERSON I SWEAR\nSapnap: wtf did they do, then\nGeorge: THEY FOUND OUT THAT YOU WORK AT TWITTER\nSapnap: …Well, that would explain why I’m getting so many endorsements on linkedin right now\n \n@tae_innit: I THOUGHT DESCDREAM WAS JUST A MEME SHIP BUT…. IF SAPNAP IS ACTUALLY THE DESCRIPTION MAN…\n@Lindsflea: THIS MAKES THE TEAMGEORGE VS TEAMTWITTERDESCRIPTIONMAN DEBATES SO MUCH MORE INTENSE OH MY GODDDDD\n@m0ssyst0ne: @BLVE_BELLFLOWER @BLVE_BELLFLOWER @BLVE_BELLFLOWER PLEASE WAKE UP IM CRYINGGGGG YOU CANT BE SLEEPING RIGHT NOW\n@karaamochi: THAT EXPLAINS WHY GEORGE ALWAYS HAD A WEIRD LOOK WHENEVER TEAMGEORGE VS TEAMTWITTERDESCRIPTIONMAN WAS BROUGHT UP!!!!!! BECAUSE IT WAS HIM VS SAPNAP!!!!!!!\n@mayamoon: WAIT DOES THAT MEAN THAT THE DREAM TEAM IS A LOVE TRIANGLE ???????\n \n\nText Message: George, Sapnap\n\nSapnap: Bruh I ignored your advice and looked at twitter for 2 seconds and have already seen one tweet telling me that I better stop getting between you and Dream and two tweets telling me that they support me in winning Dream’s love and affection\nGeorge: …I am so sorry\nSapnap: Look, I’m going to bed, you better have fixed this mess by the morning\n \nDream’s Bitches Group Chat - Members: 36\naegean misses bad and skeppy: OMG LOOK IT’S ALREADY TRENDING\nGogy: Oh thank god\n \n\nTWITTER TRENDING\n\nSAPNAP IS THE TWITTER DESCRIPTION MAN\n\n16,354 tweets\n\n \n\nTWITTER TRENDING\n\nSAPNAP IS THE TWITTER DESCRIPTION MAN\n\nNo, Sapnap is not the Twitter Description Man.\n\n\n16,389 tweets\n\n \n@Areto123: Oh……\n@pigeonat2: ………I guess we were wrong…………\n@JournoLily: …..oh………\n@c_albb: GUYS. THERE IS MORE THAN ONE EMPLOYEE AT TWITTER. FFS\n--@Areto123: that’s…..a really good point actually,,,\n@lvdsmei: It all made so much sense though, I’m crying ;-;-;-;-;\n@whitestarsnmoon: Damn….\n@blve_bellflower: IM BACK WHATS UP TL\n--@blve_bellflower: …I’m never napping ever again.\n----@m0ssyst0ne: oomf I tried to wake you up,,,, I am so sorry,,,,\n@egghhhhhhhhh: WELL THAT WAS A FUN 15 MINUTES, THANK YOU FELLOW CLOWNS FOR JOINING ME OUT HERE TONIGHT\n \n\nText Message: George, Sapnap\n\nSapnap: Good morning, is twitter safe to look at yet\nGeorge: Yeah\nGeorge: Uhhhh everyone’s using various photos of clowns as their profile pictures, you can just ignore that haha\nGeorge: I’m really sorry about the situation Sapnap\nSapnap: Honestly it’s fine, the entire thing was fucking hilarious\nSapnap: Just...please just sort out your shit, mate. Your double identity as the twitter description man, your maybe-relationship with Dream. If you could just sort it all out so shit like this doesn’t happen again, I’d really appreciate it. For real.\nGeorge: Will do.\n \n\nText Message: George, Sapnap\n\nGeorge: ALRIGHT. I sat down yesterday and have officially made a plan to Sort Out My Shit!!!!\nSapnap: Yeah so one part of me is wants to go PROUD OF YOU and the other part of me wants to screenshot that message for when things inevitably go to shit again\nGeorge: Bruh\nSapnap: Go on, tell me your plan\nGeorge: So you know how next week will be the six month anniversary since Dream and I first talked with each other, right?\nSapnap: I literally did not know that but continue\nGeorge: You have to keep it a secret, but my fingers may have slipped a little…\n\nAttachment sent (1) – Picture of a plane ticket confirmation\n\nSapnap: Is that a plane ticket to Florida\nGeorge: M-maybe\nSapnap: DUDE.\nGeorge: I KNOW!!!!\nGeorge: The plan is for me to go and surprise him and idk, confess my true feelings hgfgjdfgfcdgf\nSapnap: NICE my dude :)\n \n\nText message: George, Dream~!!!\n\nGeorge: So I may have a surprise for you soon…\nDream~!!!: What a coincidence, I’ve got one for you soon as well!! :o\nGeorge: !!!!!\n \n\nText Message: George, Sapnap\n\nGeorge: I’m off!!! So nervous hhhhhhhhhhh\nSapnap: You got this!!!! I’m rooting for you :D\nSapnap: But also.  Just as a hypothetical. If everything were to go terribly wrong, just let me know, okay? I might theoretically have a backup plan prepared, a doomsday button which once activated would take less than a minute to obliterate Dream for you. Just a theoretical though, of course~ &lt;3\nGeorge: Thanks….I think ???????? ??? ????? ?\nSapnap: You’re welcome~!\n \n\nText message: George, Dream~!!!\n\nDream~!!!: Are you at your apartment?\nGeorge: No, I’m uh, out for a while\nDream~!!!: …Out for how long?\nGeorge: A few days. Why?\nDream~!!!: ………uh.  I may have fucked up.\nGeorge: Oh my god.\nGeorge: Please don’t tell me you are outside my apartment right now\nDream~!!!: I am outside your apartment right now\n\nPicture sent (1) – Photo of a familiar British apartment building\n\nGeorge: Oh my god\nGeorge: I literally just landed in Florida an hour ago.\nDream~!!!: ……..oh my god.\nDream~!!!: You have to be joking\nGeorge: I really, really wish I was\n\nPicture sent (1) – Photo of a familiar Floridan airport\n\nDream~!!!: GOD DAMN IT\nDream~!!!: This is honestly kinda hilarious, in a very tragic manner\nGeorge: I can change my return ticket to fly back tomorrow\nGeorge: Just have to figure something out for the night\nDream~!!!: You can stay at my mother’s place, I’m sure she’d love to have you!\nDream~!!!: And we know some folks in the area, I’m sure I can crash on a couch somewhere tonight\nGeorge: Sounds good then!\nDream~!!!: ……..I can’t believe this is real life right now\nGeorge: …We are such idiots\nDream~!!!: …We are SUCH idiots\n \n\nText Message: George, Sapnap\n\nGeorge: SAPNAP WE FUCKED UP\nGeorge: UH BUT DON’T USE YOUR THEORETICAL BACKUP PLAN THOUGH !!!!!!!\nSapnap: Oh phew you said that just in time, I was like a second away from hitting the doomsday button\nGeorge: …\nGeorge: ………\nSapnap: SOOOOO what happened??\nGeorge: We’re so dumb\n\nAttachment (2) –  Screenshots of previous text messages between George and Dream\n\nSapnap: …man I just KNEW this would come in handy\n\nAttachment (1) –  Screenshot of the text message “ALRIGHT. I sat down yesterday and have officially made a plan to Sort Out My Shit!!!!”\n\nGeorge: LOOK MAN, I’M TRYING OVER HERE\n \n@sapnap: when two of your friends schedule a surprise visit to each other on the same weekend, thus missing each other\n\nAttachment (1) – “What are you” / “An idiot sandwich” meme\n\n--@dreamwastaken: @ me next time, bitch boy\n----@sapnap: @dream @georgenotfound\n----@TubboLive: @dream @georgenotfound\n----@tommyinnit: @dream @georgenotfound\n----@Ranboosaysstuff: @dream @georgenotfound\n----@Technothepig: @dream @georgenotfound\n----@Ph1LzA: @dream @georgenotfound\n \n@dreamwastaken: I hate every single one of you on this bird app\n--@GeorgeNotFound: :'(\n----@dreamwastaken: You’re the exception to the rule\n------@tommyinnit: simp\n------@TubboLive: simp\n------@Ph1LzA: simp\n------@quackity4k: simp\n------@CptPuffy: simp\n------@Ranboosaysstuff: simp\n \n\nTWITTER TRENDING\n\nsimp\n\n18,123 tweets\n\n \n@dreamwastaken: Twitch is gonna ban yall with that language\n--@Technothepig: simp\n--@Technothepig: ANDDDD THAT’S A CHECKMATE, THANKS FOR COMING OUT EVERYONE\n--@Technothepig: TECHNOBLADE 2, DREAM 0, MR BEAST I HOPE YOU’RE KEEPING TRACK HERE\n \n@Cthulhu_2005: I want to laugh at dnf being dumb this but also…….descdream….. my beloved\n@patcheshumank: I think this is the end for descdream,,,I’m crying\n@bovinophobe: YESSSSSSS TEAMGEORGE WE HAVE WONNNNN\n@the1andonlypop_: dhmu right now\n@starcreu: THEY SAID WE TEAMGEORGE FANS WERE NO FUN??? WELL LOOK WHO’S LAUGHING NOW, WE’VE WON BOIS BWAHAHAHAHAHAHAHA\n@Cthulhu_2005: descdream is dead and I am Sad\n@blve_bellflower: #teamdescriptionman…. this may be it for us, it’s been an honor o7\n@m0ssyst0ne: should we maybe try not to trend anything to be considerate to the description man? Since he’s probably going through it rn along with the rest of us ;-;\n@Katsurou11: wait what happened, I just woke up???\n--@patcheshumank: dream and george doing suspiciously boyfriend things\n----@Katsurou11: oh…\n@Katsurou11: going dark\n@mayamoon: I KNEW TEAMGEORGE WOULD WIN, I KNEWWWWW IT, GEORGE IS WAYYYY TOO HOT TO LOSE TO THE FUNNY TWITTER MAN\n \n@Areto123: okay but hear me out…what if george was actually the description man\n--@Areto123: woah what’s with all the pqrts????\n----@starcreu: you should probably delete this oomf…don’t you remember that entire mess that happened when it was rumored that sapnap was the description man?? we REALLY don’t need that again…\n------@Areto123: oh…you’re right, sorry……\n \n\nText Message: George, Dream~!!!\n\nGeorge: Your mum is quite nice\nDream~!!!: I know right? :D\nGeorge: How are you doing? Did you find somewhere to stay the night??\nDream~!!!: Yeah!\n \n\nText Message: Tommy, Wilby\n\nTommy: Wilbur, are you really with The Dream right now\nTommy: Like in real life\nWilby: Child I have told you five times that I am indeed hanging out with the individual commonly known as Dream, yes\nTommy: That’s just so…weird\nWilby: Weirdest day of my life thus far, trust me\nTommy: What’s he look like and more importantly could I take him in a fight\nWilby: Tommy, anyone could take you in a fight\nTommy: YOU TAKE THAT BACK RIGHT NOW\n \n\nText Message: George, Dream~!!!\n\nGeorge: Your mum is telling me all these stories about from when you were a kid\nDream~!!!: Oh no\nGeorge: Did you really cut off your sister’s hair?? You hooligan, you\nDream~!!!: OH N O\n \n\nText Message: Dream, Ma\n\nDream: STOP TELLING ALL MY EMBARRASSING STORIES MA PLEASE\nDream: I BEG OF YOU\n \n\nText Message: George, Dream~!!!\n\nGeorge: HAHAHAHA YOUR MUM JUST LOOKED AT HER PHONE, SCOFFED, AND TURNED IT OFF\nDream~!!!: BETRAYAL\nDream~!!!: BETRAYAL ON THE HIGHEST LEVEL\n \n\nText Message: Tommy, Wilby\n\nWilby: Dream keeps looking at his phone and smiling\nTommy: Simp behavior?\nWilby: TOTAL simp behavior\n \n\nText Message: George, Dream~!!!\n\nGeorge: Alright, I’ve got a plane ticket back home for tomorrow\nDream~!!!: Before you leave, be sure to tell my mother I will have my revenge when I get back\nGeorge: She just laughed and said she told you the surprise visit was a bad idea\nDream~!!!: WOW. HOW VERY HELPFUL. TELL HER THANKS FOR THAT.\nGeorge: Hahaha I will\nGeorge: Well, see you tomorrow then!\nDream~!!!: Yeah\nDream~!!!: See you soon :D\n \n\nText Message: Sapnap, Dream \n\nDream: Heyyyyyyy Sapnap I need advice\nDream: So there’s this guy I kinda like\nDream: And I was planning on asking him out but now I’m getting nervous\nDream: What if he doesn’t like me back??\n \n\nText Message: George, Sapnap\n\nGeorge: So uhhhhhh Sapnap\nGeorge: You know how this entire surprise trip thing was so that I could ask Dream out in person, right?\nGeorge: Do you still think that’s a good idea?\nGeorge: Like, what if he doesn’t like me back?????\n \n@Twitter: oKAY THAT IS. IT.\n--@starcreu: ???? are you okay twitter.com\n--@NekoKat14: pov: twitter about to s word someone’s ass\n \n\nNew Twitter Group Chat created!\n\nGroup Chat Name: People that I know for a FACT are mutually in love with each other can you dumbasses just talk it out PLEASE I BEG\nMembers (3): Sapnap, GeorgeNotFound, Dreamwastaken\nSapnap: Discuss.\n\n[Sapnap has left the group]\n\n \n@Twitter: you’re welcome, you absolute idiots\n \n\nGroup Chat: the 4/4 that twitter would cry to see  \n\nMembers (4):  Tommy, Wilby, Techno, Phil\nWilby: Help, Dream is physically shrieking right now and it woke me up\nWilby: What do I do????????\nTommy: Send a video\nTechno: Describe this shrieking\nWilby: He sounds like he is, uh, going through great emotional turmoil right now\nWilby: taken with great stealth\n\nAttached – Video (1)\n\nTechno: Huh, I did not know his voice could reach that high an octave\nTechno: I am impressed and ever so slightly intimidated\nTommy: The Blade??? Intimidated????? Impossible\nWilby: Okay wait he said something\nWilby: Something something sapnap is dead to him????\nPhil: Oh then it’s probably a personal issue, go back to sleep\nWilby: Okay Philza Minecraft\nPhil: …Is what I probably should say, but please snoop and send us further updates, I for one am very curious\nWilby: OKAY PHILZA MINECRAFT\nTommy: HAHAHAHAHAHAHAHA\nTechno: I’m starting up a bag of popcorn for myself\nPhil: You know what, that’s a great idea\n \n\nPeople that I know for a FACT are mutually in love with each other can you dumbasses just talk it out PLEASE\n\ndreamwastaken: O-oh!\nGeorgenotfound: Oh !!!!\nGeorgenotfound: This is kind of a lot to take in, hang on give me a second here\n \n\nText Message: George, Sapnap\n\nGeorge: YOU MOTHERFUCKER\nGeorge: I AM GOING TO MURDER YOU\nSapnap: Sorry, can’t hear you over the sound of the zero fucks I give about your overly long mutual pining arc\n \n\nPeople that I know for a FACT are mutually in love with each other can you dumbasses just talk it out PLEASE\n\ndreamwastaken: So uh…how accurate is the name of this group chat?\ndreamwastaken: Haha\nGeorgenotfound: Uhhhhhh\n \n\nText Message: George, Sapnap\n\nSapnap: You got this bro, I believe in you :)\n \n\nPeople that I know for a FACT are mutually in love with each other can you dumbasses just talk it out PLEASE\n\nGeorgenotfound: Yeah\nGeorgenotfound: Yeah, it’s accurate on my end\nGeorgenotfound: please tell me it is for you as well, I am dying over here right now\ndreamwastaken: Of course it is, George\nGeorgenotfound: ………So I guess that makes this easy, then?\ndreamwastaken: Yeah, it really does.\nGeorgenotfound: &lt;3 ?\ndreamwastaken: &lt;3 .\n \n\nGroup Chat: the 4/4 that twitter would cry to see  \n\n\nMembers (4): Tommy, Wilby, Techno, Phil\n\nWilby: New development, bois\nPhil: FINALLY\nWilby: This is wild\nWilby: Dream flopped face down on the couch, buried his face in a pillow and is kicking his feet extremely fast while squealing like a teenager in love\nTommy: VIDEO. NOW.\nWilby: Again, taken with great stealth\n\nAttached - Video (1)\n\nTommy: HAHAHAHHAHAHAHAHA I CAN’T BELIEVE THIS IS REAL\nTechno: So you think he and George confessed their love for each other then?\nPhil: Well obviously\nTommy: Damn, can’t believe Dream just broke the Twitter Description Man’s heart like that :/\nPhil: LOL watch the descriptions go back to being stale af\n \n@Georgenotfound: Home has never felt so far away, my god\n--@Sapnap: I thought we were past the angst stage now??? Jfc get your act together man\n----@Georgenotfound: Oh I’m still not done with you, you motherfucker\n------@Sapnap: Hahahaha WHELP time to go\n \n\nGroup Chat: the 4/4 that twitter would cry to see  \n\n\nMembers (4): Tommy, Wilby, Techno, Phil\n\nWilby: I drove us to the airport, we are now waiting at the terminal\nWilby: I am in full incognito mode and standing under a fake tree near a magazine stand, Dream thinks I am parking the car still\nWilby: Jokes on him, I am more than willing to pay the price of a parking ticket in order to continue snooping for us sleepy bois\nTommy: o7\nTechno: o7\nPhil: o7\nWilby: Last chance to place bets, gentlemen\nPhil: Three pounds says they kiss within the first ten seconds\nTechno: You’re on\nWilby: Okay, looks like they’re coming out of the plane now\nTommy: HERE WE GO BOIS\nWilby: …You owe Phil three quid, Techno\nTechno: DAMN IT DREAM\nTechno: YOU COULDN’T LAST TEN SECONDS???????\nTechno: TEN SECONDS?????????????????\nPhil: Ah, young love.\n \n\nGroup Chat: dream team~  \n\n\nMembers (3): George, Dream &lt;3, Sapnap\n\nGeorge: Yeah so we’re dating now :D\nSapnap: AYOOOOOOOOO CONGRATULATIONS!!!!!!!!!!!!!!!!!!\nSapnap: I’m so freaking proud of you two idiots :)\nGeorge: Thank you so much for everything, Sapnap\nDream &lt;3: We really owe you a lot, don’t we? Thank you from me as well :)\nSapnap: No problem yall\nSapnap: I’m just glad I didn’t have to use my doomsday button\nDream &lt;3: wait hold on, your WHAT?\nGeorge: DON’T ASK!!!!\n \n\nText Message: Dream, Sapnap\n\nSapnap: don’t forget our earlier talk\nSapnap: break his heart and I will murder you\nDream: Trust me, you don’t have to worry about that ever :)\n \n\nText Message: George, Dream &lt;3\n\nDream &lt;3: You ready? &lt;3\nGeorge: Yeah, I am\nGeorge: I’ll write the description by myself this time &lt;3\n \n@Dreamwastaken: A serious (but very very happy) announcement – I’m dating George!! Who by the way, just so happens to be the Twitter Description Man.  (No, I’m not joking.) (Yes, really.) tl.gd/n_1srmd07\n@Dreamwastaken: #DESCDREAMCANON #DNFCANON\n \n@Ph1LzA: 1. Congratulations 2. Excuse me what\n@tommyinnit: I’m sorry I think I misread that, did you just say that George is the twitter description man or did my eyes just totally stop working\n--@Georgenotfound: nope you read that right\n@honkkarl: so so happy for you both!!!!\n@Ranboosaysstuff: *checks calendar* so today is somehow not April Fool’s Day, congratulations but also ?????????\n@quackity4k: You’re telling me that George, the most unsubtle guy I know, somehow managed to hide his true identity from everyone for months wtf\n--@dreamwastaken: for the record, I figured it out AGES ago\n----@Georgenotfound: yeah but that was on our stantwt accounts though\n------@Ranboosaysstuff: your what\n@TomBrady: Congrats champs!\n--@gogyyy: ಠ_ಠ\n--@notdream: ಠ_ಠ\n@TubboLive: WAIT GEORGE IS THE TWITTER DESCRIPTION MAN??????????????????????\n@technothepig: I’m going to be real with you, I did not expect that plot twist\n--@technothepig: (but also congratulations)\n----@Ph1LzA: You still owe me three pounds\n@Georgenotfound: But like how come people are more surprised about me being the description man than about me and Dream dating?????\n--@quackity4k: George my friend, that was a long time coming, let’s be real\n \n@Twitter: FINALLY\n@Twitter: DO YOU GUYS KNOW HOW LONG THEY WERE ANGSTING ABOUT THIS\n@Twitter: BLAH BLAH BLAH ‘bUt wHaT iF hE dOeSn’T LiKe mE bAcK??1?1?11’ ON AND ON AND ON DAY AFTER DAY AFTER DAY\n@Twitter: yes i know i’m not on my personal account shush, this is a big moment leave me be\n@Twitter: THOSE ARE /MY/ TWO IDIOTS, RIGHT THERE\n--@karaamochi: Um…thank you Twitter™ man for the tea???????????\n--@tae_innit: Hear me out…. Twitter™ man x Sapnap\n----@Twitter: …I’m gonna have to stop you right there\n \n@c_albb: I DON'T SEE A /J BESTIE, DID THEY FORGET THE /J ??????????????\n--@Georgenotfound: No /j this time, we’re being serious :D\n----@ranboop_: YOU’RE ACTUALLY THE DESCRIPTION MAN????? LIKE FOR REAL???????????\n------@Georgenotfound: Yep!!!\n@Areto123: JFJHDKJFJHDF I CALLED IT???? I CALLED THAT GEORGE WAS THE DESCRIPTION MAN. AND YOU ALL LAUGHED AT ME FOR IT!!!!!!!\n--@starcreu: OOMF CONSIDER THIS MY FORMAL APOLOGY\n----@Areto123: ALL GOOD OOMF, WE ALL WON TODAY\n@the1andonlypop_: I DON’T EVEN KNOW HOW TO PROCESS THIS W H A T\n@amnesi_acc: IS NO ONE ELSE CONCERNED BY THAT WHOLE DREAM AND GEORGE HAVE STANTWT ACCOUNTS THING???????? NO ONE ????????????\n@blve_bellflower: WHAT DO YOU MEAN GEORGE AND MR DESCRIPTION MAN ARE THE SAME PERSON? ⊙_⊙\n--@blve_bellflower: I THINK I MUST BE DREAMING RN\n----@m0ssyst0ne: NO BESTIE I’D HAVE WOKEN U UP\n@stupidsanbii: TEAMGEORGE…..WE WON!!!!!!!!\n--@SleepySlooth: BESTIE I THINK TEAMDESCRIPTIONMAN WON AS WELL\n----@stupidsanbii: TECHNICALITIES\n------@sweetchayos: STOP FIGHTING KIDDOS TURNS OUT WE’RE ALL ON THE SAME SIDE HERE\n@mayamoon: ARE YOU TELLING ME….ALL THIS TIME THAT WE WERE ARGUING TEAMDESCRIPTIONMAN VS TEAMGEORGE. AND. AND. THEY WERE THE SAME PERSON THIS ENTIRE TIME??????!  HOW IS TODAY EVEN REAL????????\n--@dreamwastaken: Just wait until you hear who introduced the two of them\n----@mayamoon: UM ?????????? ????????????????????? ???? ???????????? ??? ? ? ? ?? ? ????? ? ??\n \n\nTWITTER TRENDING\n\n#DESCDREAMCANON\n\nFamous Minecraft YouTuber Dream announces to fans that he’s dating the Twitter Description Man, who is currently the happiest man in the world &lt;3\n\n\n123,337 tweets\n\n\nTrending with: #DNFCANON, CONGRATULATIONS, GEORGE IS THE DESCRIPTION MAN, HI GEORGE, WAIT WHAT\n"
}