{
    "id": "30812927",
    "url": "https://archiveofourown.org/works/30812927?view_full_work=true",
    "author": [
        "teeth_eater"
    ],
    "title": "Home Again, Home Again",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "Minecraft (Video Game)"
    ],
    "relationships": [
        "Tommyinnit & Tubbo"
    ],
    "characters": [
        "TommyInnit (Video Blogging RPF)",
        "Tubbo",
        "Wilbur Soot",
        "Technoblade (Video Blogging RPF)",
        "Philza",
        "Clay | Dream (Video Blogging RPF)"
    ],
    "additional_tags": [
        "Aliens",
        "Alien Abduction",
        "Alien Biology",
        "Alien Culture",
        "Cultural Differences",
        "Language Barrier",
        "Humans Are Weird",
        "Humans are space orcs",
        "yes motherfucker its one of my FAVORITE TROPES",
        "Hurt TommyInnit (Video Blogging RPF)",
        "Hurt/Comfort",
        "Sleepy Bois Inc-centric",
        "Avian Phil Watson (Video Blogging RPF)",
        "Phantom Hybrid Wilbur Soot",
        "Piglin Hybrid Technoblade (Video Blogging RPF)",
        "Bee Hybrid Toby Smith | Tubbo",
        "sorta for all of these",
        "theyre not really hybrids as much as aliens but yknow",
        "Human TommyInnit (Video Blogging RPF)",
        "Science Fiction",
        "Misunderstandings",
        "Traumatized TommyInnit (Video Blogging RPF)",
        "Claustrophobia",
        "Claustrophobic TommyInnit (Video Blogging RPF)",
        "Flashbacks",
        "Good Friend TommyInnit (Video Blogging RPF)",
        "Panic Attacks",
        "Platonic Cuddling",
        "Found Family",
        "Sleepy Bois Inc as Family"
    ],
    "language": "English",
    "series": "Part 1 of Human Error",
    "published": "2021-04-21",
    "completed": "2021-06-05",
    "words": "33,252",
    "chapters": "13/13",
    "comments": "1,084",
    "kudos": "15,934",
    "bookmarks": "2,185",
    "hits": "286,145",
    "summary": "<p>Tommy Innit may not be the most well-behaved kid or even the best person at times, but he certainly deserves better than to be abducted by aliens. Luckily for him, the aliens didn't seem to expect him to be able to break out of the stupid cage they stuffed him in and destroy their ship from the inside out. </p>\n<p>Now he just has to figure out where to go from here. </p>\n<p>__________</p>\n<p>Philza just wants to fly his cargo ship with his two sons, he's left behind all the excitement of his old life, so when he hears rumors of a human crash landing on the trading post where they are docked, he gathers up what he had managed to get and takes off again. </p>\n<p>This time with a stowaway.</p>\n<p>HOWDY AND HELLO!! thank you to my wonderful beta reader @commieinnit on tumblr who BULLIED me into making the title an amongus reference. xoxo</p>\n<p>TWs:<br>-general dehumanization. its not personal or meanspirited, just generally referring to sapient beings like animals</p>\n<p>sorry for not getting this out sooner, i meant to finish it last night but I got too caught up working on the designs, which you can find on my art blog here! <a href=\"https://ratspleen.tumblr.com/post/649123253715140609/alrighty-gamers-new-au-in-the-works-here-are-the\" rel=\"nofollow\">\nif you have any (non-spoliery) questions about the au, shoot me an ask!</a></p>\n<p>HELLO AGAIN<br>thank you as always to my wonderful beta reader @commieinnit on tumblr </p>\n<p>no trigger warnings for this chapter! except i guess a lot of cussing bc half of it's tommy's pov, but i digress</p>\n<p>thank you as always to my beta reader @commieinnit on tumblr xoxo</p>\n<p>warnings for this chapter:<br>-claustrophobia<br>-panic attacks</p>\n<p>Thank you as always to my beta reader @commieinnit on tumblr ❤❤❤</p>\n<p>Warnings:<br>-mentions of dehumanization</p>\n<p>TIME FOR TUBBO!! IVE BEEN WAITING FOR THIS ONE</p>\n<p>Thank you as always to my beta reader @commieinnit on tumblr xoxo</p>\n<p>Some of Tommy's backstory gets revealed here 😈</p>\n<p>Warnings:<br>-panic attacks/flashbacks<br>-mentions of abuse<br>-mentions of dehumanization</p>\n<p>thank you to my beta reader @commieinnit on tumblr :D</p>\n<p>no warnings for this chapter, it's pretty fluffy! though we do get a little more insight into Tommy's thought process.</p>\n<p>thank you to my beta reader @commieinnit on tumblr xoxo</p>\n<p>slowly but surely tommy starts to warm up to his captors(?) new friends (?) time will tell. also time for my reminder that this is not and wont ever be a shipping fic between tommy and tubbo. i don't fuck with that</p>\n<p>warnings<br>-slight flashback<br>-beginnings of a panic attack</p>\n<p>thank you as always to my lovely beta reader @commieinnit on tumblr :D</p>\n<p>BIG WARNINGS FOR THIS ONE<br>-full on mental breakdown. its not good. <br>-death ment </p>\n<p>Tommy finds out something he's known for a while.</p>\n<p>thank u as always to my beta reader @commieinnit on tumblr :)</p>\n<p>CW:<br>-teensy tiny bit of blood talk<br>-aftermath of destructive panic attack</p>\n<p>the one where tubbo is protective :)</p>\n<p>thank you as always to my beta reader @commieinnit on tumblr</p>\n<p>CW:<br>none!</p>\n<p>Wilbur finally grows a pair and visits</p>\n<p>Thank you as always to my lovely beta reader @commieinnit on tumblr</p>\n<p>No warnings this time.</p>\n<p>The days after Tommy and Wilburs meeting and then some plot progression.</p>\n<p>Thank you as always to my beta reader @commieinnit on tumblr<br>CW:<br>Mentions of starvation<br>Dehumanization</p>",
    "notes": "<p>Howdy and hello. This first chapter is very very short just to get some introductions out and set up the story. My other chapters should be longer!<br>this is loosely inspired by lost in translation by silverwing15, GO READ THAT IT'S SO GOOD. it is pretty dissimilar, but I got the idea after reading there's, so credit where credit is due.</p>\n<p>TW:<br>-mentions of gore and child endangerment<br>-brief mentions of amputation<br>-mentions of dehumanization</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>THANK YOU FOR READING!! the reception to this au and this story have been AMAZING!! comment if you liked it, and if you missed it, i have designs for everyone on my art blog, linked at the top notes!! </p>\n<p>xoxo, rat.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>THANK YOU FOR READING!! if you liked this chapter, leave a comment, they encourage me to keep writing and to get chapters out faster ;) </p>\n<p>designs for the sleepy bois can be found linked in the top notes of chapter two, on my art blog @ratspleen on tumblr. if you like what i put out gimme a follow there too! </p>\n<p>remember to subscribe so you can get emailed when this story updates!!!!!</p>\n<p>xoxo<br>rat</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>THANK YOU FOR READING!! if you liked this chapter leave a comment!</p>\n<p>if you wanna see more content from this au, i answer some quesitons and have some art of this au on my art blog here <a href=\"url\" rel=\"nofollow\">https://ratspleen.tumblr.com/</a> </p>\n<p>i also got fanart!!! WHICH IS FUCKING CRAZY!!!! check it out <a href=\"url\" rel=\"nofollow\">https://ratspleen.tumblr.com/post/649489721634996224/philza-has-gained-1-son-tommys-opinion-on-the</a></p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p>You can find my tumblr <a href=\"https://ratspleen.tumblr.com/post/649405785981534208\" rel=\"nofollow\">here</a><br>I have some extra content and worldbulding for the au there, as well as some art, all under the tag alien au </p>\n<p>If you liked this leave a comment, that's the best way to get chapters to come out faster!!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">notes</a>.)\n</p>\n<p>HAH! WHO SAW THAT COMING? probbaly a lot of you, but that's okay.</p>\n<p>Well, the next chapter might take a little longer to come out since some family stuff came up today, but thankfully commie edited this for me in its entirety so everyone give them a round of applause for letting me get this chapter out on time. </p>\n<p>If you liked this leave a comment, it's a great way to encourage more writing faster!</p>\n<p> You can find me @ratspleen on tumblr where I have some bonus content about this au, as well as some art, from me and from other people! This is all filed under the tag alien au!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">notes</a>.)\n</p>\n<p>THANK YOU FOR READING! If you liked this chapter, leave a comment, it's one of the best ways to get more writing out of me! If you want some bonus content for this AU, such as questions being answered and some art, both by me and other people, check out the 'alien au' tag on my blog @ratspleen on tumblr!<br>XOXO</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_8_endnotes\">notes</a>.)\n</p>\n<p>HIII THANKS FOR READING THIS CHAPTER. </p>\n<p>if you liked this, please leave a comment, its a great way to get more work out faster!! :D</p>\n<p>you can also find designs for the sleepy bois + tubbo as well as some other fanart and bonus content on my art blog <a href=\"https://ratspleen.tumblr.com/post/649405785981534208\" rel=\"nofollow\">here!</a> all bonus content for this au will be under the 'alien au' tag :D <br>OH YEAH!! you can also ask questions there through the ask box. if they're too spoilery i wont answer them BUT I love worldbuilding!!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_9_endnotes\">notes</a>.)\n</p>\n<p>Well that was a heavy one, ay? thanks for reading !! </p>\n<p>if you liked this chapter, leave a comment, it's a great and proven way to get me to work faster!!!!!!!</p>\n<p>also there's some bonus content for this au (art and worldbuilding and such) on my blog <a href=\"https://ratspleen.tumblr.com/\" rel=\"nofollow\">HERE</a> </p>\n<p>if you have any non-spoliery questions about this au, shoot me an ask!!!!!!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_10_endnotes\">notes</a>.)\n</p>\n<p>THiS TOOK SO LONG IM SORRY<br>i wasn't home for most of the week and I have a bunch of stuff going on UGH</p>\n<p>BUT I'm home now and after this weekend I'm gonna have a lot more time to write so updates should be getting back on schedule by the end of next week hopefully. </p>\n<p>If you like this AU, there is more content on my tumblr <a href=\"https://ratspleen.tumblr.com/\" rel=\"nofollow\">RIGHT HERE</a>!!!! you can send an ask about the universe if u like!! as long as its not to spoilery ill try to answer it</p>\n<p>IF YOU LIKED THIS CHAPTER LEAVE A COMMENT, ITS THE BEST WAY TO GET ME TO WRITE FASTER (I am shamelessly holding more writing hostage for more comments &gt;:)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_11_endnotes\">notes</a>.)\n</p>\n<p>GUESS WHO JUST GRADUATED!!!!!!!!!!!!!!! IM FREE until fall when I go to college but whatever</p>\n<p>so that's where I've been, wrapping up school, but Im hopefully gonna have more time now!!!</p>\n<p>were getting real close to the end of this installment, so here's the plan, there's gonna be a few short stories in this universe and then a sequel! </p>\n<p>Also if you like this au, my tumblr has more content under the 'alien au' tag! You can find me <a href=\"https://ratspleen.tumblr.com/\" rel=\"nofollow\">HERE!</a></p>\n<p>MOST IMPORTANTLY LEAVE A COMMENT!! AS I SAID LAST TIME IM HOLDING MY WRITING HOSTAGE FOR COMPLIMENTS!!!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_12_endnotes\">notes</a>.)\n</p>\n<p>Thank you all!!! WERE NOT QUITE DONE YET. I plan on an epilogue and THEN finishing it. </p>\n<p>As it stands there may be a break between this installment and the next, depending on how I feel. Some serious shit is happening in my personal life and I dont know how it's going to play out yet. We will see. </p>\n<p>Regardless there WILL be a sequel after a set of shorts that introduce new characters ;) </p>\n<p>LEAVE A COMMENT IF YOU LIKED IT. I don't feel like linking my blog cause I'm on my phone but you can find me @ratspleen on tumblr. Its linked in the notes of the last chapter :] theres more content for this au there</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_13_endnotes\">notes</a>.)\n</p>\n<p>Thank you as always for reading! You can find more content for this au on my tumblr @ratspleen !!</p>\n<p>This wraps up this installment! But were not done yet. If you wanna see more subscribe to the Human Error series!!</p>\n<p>THANK YOU FOR READING!!!</p>\n<p>if you liked it please leave a comment! I'm working on designs for the Sleppy Bois (plus tubbo in the future) which will go up on my art blog @ratspleen on tumblr. Feel free to shoot me an ask there :D </p>\n<p>XOXO </p>\n<p>-rat</p>",
    "text": "\nUrban legends are not confined to planets alone. With the connections between space fairing vessels and trade routes among planets, news spreads just as fast as the goods being transported. \n\n \n\nSo when humans are found, the rest of the universe is quick to find out about it. \n\n \n\nAt first, they are excited, a new young species just barely making its way into space. The Galactic Council is content to leave them alone and allow them to make their own way until they reach the outer galaxy where the rest of the trade routes lie. \n\n \n\nBut with discovery comes new dangers. \n\n \n\nRouge scientists and bounty hunters come in droves, all secretly, of course. The Galactic Council would have their heads if they were spotted by a human before it was time, and took humans off of their home planets. To study or to keep as some twisted pet, the humans didn't care, and they didn't go quietly. \n\n \n\nWith the language barrier firmly set in place, the humans all likely believed they were going to be killed, and apparently, a cornered human is a dangerous one. \n\n \n\nThey didn't look it, but they were deadly creatures. Not for size or for sharpness like some other beings, but for the sheer \n\nwillpower\n\n they exuded in every breath. If they did not want to die, they would not die. Simple as that. There was a case where a woman and her child were stolen off-planet. Whoever had captured her tried to take the child from her, apparently ignoring one of the most important rules of dealing with any hostile creature. Never \n\never\n\n touch the child when the parent may be nearby. \n\n \n\nNobody was on that ship when the Galactic Council came to clean up the mess. There were only corpses. The woman had taken over the ship and landed it on a random planet before grabbing her child and running into the woods. They managed to find her camp before being chased out, all bared teeth and angry screaming. She seemed to be doing quite well for herself and her child, but the Council can only observe at a distance, so who's to say? \n\n \n\nThere were other rumors, though nothing set in stone. A human had their arm cut off and kept fighting until everyone was dead or unconscious before wrapping the arm and marching out, a human smashed a smuggler's head in with the handcuffs they had been bound in, a human is on the planet they were docked at right now. \n\n \n\nOkay, that one is a little concerning. \n\n\n\"Here?\" Philza asks, clucking in surprise. \"On-planet?\" The grizzled bargoer he had been talking to nods solemnly, raising his drink to one of his mouths. \n\n\n\"Yessir.\" He says gruffly. \"Some group of dumbasses thought it would be a good idea to steal a human away, took a young one. Thought they wouldn't have as much trouble.\" The man chuckles darkly into his drink. \"That thing tore through them like paper. I don't know why they thought they would be different from anyone else that tried stealin' an 'uman.\" \n\n\n\"Have they caught it yet?\" Philza asks, swirling his own drink in a clawed hand. The man shakes his head. \n\n\n\"Nah, you know how humans are. That thing is probably so deep in the woods that no one'll find it for years.\" \n\n \n\nPhilza hums thoughtfully, throwing a couple of coins onto the counter of the bar before standing. The bartender nods at him. \n\n\n\"Well, thanks for the gossip, mate,\" Philza says, ruffling out his wings. The man nods, not looking up from his drink. \n\n \n\nPhilza marches out of the bar, eyes scanning for his sons (they were his crewmates, but they'd been traveling together so long that a title like that seemed overly professional). He spots them pretty quickly, they never wander far when they visit planets, bless them. Wilbur is haggling for prices, an umbrella firmly in his hand to block his sensitive skin from the sun. Technoblade stands beside him, arms crossed as he stares down the nervous-looking sales clerk. Philza would usually let them intimidate and annoy their way into better pricing, but they need to get off-planet as soon as possible. Technoblade glances over to him and seems to register the serious expression on his face, because he grabs Wilbur's shoulder and tries to tug him away. Wilbur shoves him off, still trying to haggle, but Technoblade whispers something in his pointed ear and Wilbur stiffens and turns to look at Phil with a worried expression. Phil nods his head towards the ship and his two boys start to head in his direction. The shopkeeper breathes a sigh of relief at their departure as they catch up to Phil, coming up to his side. \n\n\n\"What's happenin' Dadza?\" Wilbur asks, twirling his umbrella in his hand idly, though the backward tilt of his ears betrays his nervousness. \n\n\n\"According to locals, a human crash-landed here a few days ago and no one has been able to track it down,\" Philza explains hurriedly. Wilbur's eyebrows shoot up to his hairline, and Technoblade, despite his deadpan expression, blinks a few times in surprise. \n\n\n\"Oh. That explains why this place is so dead.\" Techno drawls boredly, though his gaze darts around at the trees surrounding them, and he stands a little straighter, as though preparing to defend the three of them. \n\n\n\"Do you think it's the real deal or just local legend?\" Wilbur asks, uncharacteristically serious. Philza sighs. \n\n\n\"I'm willing to bet this is real. You remember seeing that wrecked ship when we came in?\" \n\n \n\nWilbur hisses through his teeth at the thought, claw coming up to pick at his skin nervously. Technoblade slaps his hand away, and Philza retreats into his thoughts as his boys bicker.\n\n \n\nThey needed to leave as quickly as possible or risk running into the human. Phil honestly doesn't think it's going to attack them in the middle of the woods like this, according to all the legends humans almost never attack when there is an option to run; and to attack three people at once would be foolish of any species. Having Techno with them is a huge bonus. Even if the human doesn't know of Piglin's historical rank as a warrior species, Techno's broad stature and height would scare off just about anything. Especially if the rumors were true and it really \n\nwas\n\n just a young human that the smugglers took. Phil frowns at the thought of a child being out on an alien planet all alone, human or no, it made his wings twitch with restlessness. \n\n \n\nHe comes back into the present to see his sons staring at him suspiciously. \n\n\n\"What?\" Phil asks, a bit self-conscious of how his wings are twitching upwards without his control. \n\n\n\"\n\nWhy\n\n are your wings twitching Phil?\" Wilbur asks slowly, raising an eyebrow. Phil scoffs, but there is no point in trying to hide it now. \n\n\n\"Apparently the smugglers took a fledgling human, even if it's human I \n\nhate\n\n thinking of a fledgling all alone out here,\" Phil says, and the empathy filling his voice has both his sons coming up in arms. \n\n\n\"Oh no,\" Technoblade says. \"We are not going to hunt down some rouge human child and possibly get mauled in the process just so you can \n\ndad\n\n it.\" \n\n\n\"That- That is \n\nnot\n\n what I was saying!\" Philza huffs, wings fluffing up in offense. \n\n\n\"Okay, \n\nsure\n\n.\" Wilbur teases. \"That's why you got all bent out of shape when you thought about it being all alone in the woods, cold and hungry- \n\nthere\n\n! Look Techno, he's doing it again!\" \n\n \n\nPhilza grumbles and tries to pat down his twitching feathers to no avail. He glares at his sons from where he is trying to wrestle his feathers back into place. \n\n\n\"You two are awful, you know that?\" \n\n \n\nPhilza guides them back to their ship, grumbling at his son's teasing the whole way there. It isn't his fault he has fathering instincts, okay! His species is very community-based. No matter how many times he tells his sons this, they still make fun of him for his relentless mother-henning, even towards a creature that could likely break most of his hollow bones with one hand. \n\n \n\nThey board the ship in high spirits, or at least Wilbur and Techno are in high spirits, Phil is still caught up thinking about the young human alone in the woods even as he fends off the rampant teasing. \n\n \n\nPhil manages to get to the cockpit without dying of embarrassment or rushing back out into the woods to find the human fledgling, so he considers it a win. He lifts the 'Sleepy Bois Inc' off of the ground, listening to the soothing hum of its engine. He stares sadly down at the trees as he lifts them up and into the sky, trying not to think about how long the human would survive down there. Techno and Wilbur are likely busying themselves with unloading the things they had managed to buy on-planet, so Phil tries to relax and focus on getting them out of there. \n\n \n\nThere are some things that he just can't save, and one of those things is a rouge human fledgling who is probably tucked away in some other animal's burrow right now. Philza sighs and decides to put it out of his mind as they pass the atmosphere layers and head into the dark sky. \n\n \n\n______________________\n\n\nDeep, deep down in the belly of the ship, a human in a torn white and red shirt crouches behind one of the many storage crates. He hopes these aliens won't be as creepy as the last ones, maybe they'll even let him hitch a ride back to Earth. \n\n \n\nSomehow, he doubts it. \n\n \n\nThe thing about living on an isolated ship is that things rarely change within its walls. Sure, on the outside things are almost never the same, not with the way they hop from planet to planet, but inside the thick metal walls of the Sleepy Bois Inc, it is reliably consistent. \n\n \n\nSo when something changes, even in small ways, everybody on board notices. \n\n \n\nIt feels as though the energy in the ship has shifted slightly, that it buzzes just a little too fast to feel normal. Phil's sharp hearing catches shifting in the vents, but the chances of an animal figuring out the door to the ship are slim to none, so he tells himself there is just something wrong with the ventilation and resolves to check it out later. \n\n \n\nWilbur's pens and paper have been going missing. He had confronted Technoblade about it, irritated that he didn't ask before taking his things, but Techno denied taking anything, and the Piglin was a terrible liar on a good day. Philza insisted he hadn't taken anything either, and he had no reason to be dishonest. Wilbur tries not to think about it too hard, he probably hid them away somewhere while half asleep. He doesn't want to think about the alternative of some stranger in his room. \n\n \n\nTechnoblade is being watched. He can feel it as surely as one can feel the clothes on their back. He keeps an eye out, but never manages to catch what is watching him. He knows it isn't Wilbur or Phil because the feeling persists even with them around. It unsettles him. He has never much liked being spied on. \n\n \n\nIt takes two days of this tense nervousness for one of them to snap. \n\n \n\nTechnoblade slams his hands down on the dinner table, getting a dirty look from Wilbur for the noise. \n\n\n\"Alright,\" He growls, shoving his food to the side. He can't eat, not with the eyes he feels on the back of his neck. \"This is ridiculous. Something is wrong, I know you both can feel it too. There's something on the ship.\" \n\n\nWilbur and Philza exchange a look that tells him he's right, and Phil sighs deeply. \n\n\n\"Alright, I will admit I can feel that something's off. The vents have been making weird noises lately.\" \n\n \n\nTechno's ears twitch back in irritation. \n\n\n\"And you didn't think to mention this?\" He grumbles. Phil chuckles sheepishly. \n\n\n\"Admittedly, I was kind of hoping it was a maintenance issue.\" He admits, taking a bite from the fruit he is holding. Techno puts his head down on the table and groans loudly. \n\n\n\"Someone's been stealing my shit,\" Wilbur says, making Techno glance at him irritably. \n\n\n\"Why does no one tell me when weird stuff happens?\" Techno complains, rubbing his eyes tiredly. \"How am I supposed to guard the ship when no one tells me what to guard against?\" \n\n \n\nWilbur shrugs, humming nonchalantly around the mouthful of steak he's eating. \n\n\n\"I kinda thought I was doing it in my sleep,\" Wilbur admits, making Phil hit his shoulder with a wing for speaking with his mouth full. \n\n \n\nAt the end of the meal, they reach a general consensus that some sort of animal had gotten in through some weak spot in the ship, and to keep an eye out for it so they can catch it before it manages to do any real damage. The last thing they need is for some woodland critter to chew through their ship's wires. \n\n \n\nAnd that's that. Problem solved. \n\n \n\nUntil the next night. \n\n \n\n__________________\n\n \n\nWilbur is a nocturnal creature by nature, though he resists the urge to sleep the day away to spend more time with his family, but this doesn't come without its costs. He often has trouble falling asleep, and then with \n\nstaying\n\n asleep, and tonight is no exception. He throws his blankets off of himself with a grumble and gets to his feet, stretching his legs before heading to the door. Maybe he'll sleep easier with a full belly. \n\n \n\nHe ambles to the kitchen, humming to himself and easily dodging the clutter of the ship in the low light thanks to his night-vision. There is light spilling from the kitchen, but this is not surprising. Both Phil and Techno are notorious night owls themselves, and it is not uncommon for them to run into each other on their nightly walks around the ship. Wilbur walks into the kitchen with a yawn, quietly greeting whichever crewmate has decided to raid the fridge in the middle of the night.\n\n \n\nWilbur's vision focuses after his yawn, and he freezes. \n\n \n\nIt is not one of his crewmates rummaging through the fridge. \n\n \n\nIt is a scrawny human leaning halfway inside the box, a bushel of round, yellow fruits gathered in their shirt. There is a piece of fruit in their mouth as well, held fast by blunt teeth. \n\n \n\nThey stare at each other for all of three seconds before the tension snaps like a taut rubber band and the human hisses wildly, which isn't that effective with a mouth full of fruit, and lunges at Wilbur. \n\n \n\nWilbur shrieks in terror and stumbles backward, falling hard onto his tailbone. He tenses, waiting for the human to descend on him, all blunt nails and unrelenting grip, but they only leap over his prone figure and dart back to the vent shaft they apparently came out of. Wilbur had been juked. By a \n\nhuman\n\n.\n\n \n\nWilbur stares after the human long after they have scrambled out of view, mouth agape. He stays like that until his crewmates come thundering down the hall, drawn by his scream. Phil's wings are ruffled to make himself look bigger, and Technoblade has his blaster in one hand and a sword in the other. They look ready for a fight, so Wilbur isn't surprised that they are confused to see him sitting on the floor gaping like a fish at the open air vent. \n\n \n\n\"Why'd ya' scream, mate?\" Phil pants, wings slowly lowering as he realizes the danger has passed. \"We thought you were hurt.\" Wilbur opens and closes his mouth a few times, trying to speak around his shock. \n\n\n\"There's a fuckin' human in the walls!\"\n\n \n\n______________________\n\n \n\nAlright, \n\nmaybe\n\n Tommy could have found food another way. There were probably some rations in the storage dock somewhere, but he didn't want to risk giving himself away by breaking open all their dumb high-tech crates and rummaging through them when they might just have something inedible in them. \n\n \n\nBesides, he had seen the aliens eat together and the fruit they had in a bowl on the center of the table looked \n\nridiculously\n\n delicious. All shiny and yellow. He doesn't regret it, even if the one weird blue alien had caught him with his hand in the metaphorical cookie jar. He eats the fruit as quickly as he can without making too much noise or choking, shoving what he has decided to call gapples (they're gold and they're apple-shaped. He's not feeling that creative, okay?) into his mouth. \n\n \n\nHe throws a core to the side and swallows thickly, relishing in the warm fuzzy feeling the gapples provide in his stomach. He hunches over his stack of stolen stationary, scribbling out a quick sketch of the blue alien now that he had gotten a better look at it. If he was going to be hiding out on some alien ship he might as well record what he sees for when he goes back to Earth. \n\n \n\nHe doesn't let himself think about an alternative, he just writes down his observations on the aliens. He grabs the paper and shoves it into a pile with his other drawings and notes. They know he's here now. He had a feeling they were suspicious before, he isn't exactly subtle, but he had to steal \n\nsome\n\n things in order to survive. \n\n \n\nAlright. Maybe taking the blue one's paper and pens was a little unnecessary but he gets \n\nbored\n\n just sitting in an air duct all day, alright? He's a growing boy, he needs a little mental stimulus.\n\n \n\nHe collapses onto his nest of pilfered blankets with a heaving sigh, shuffling around to get as comfortable as he can. Which isn't very, admittedly, considering he's sleeping on a nest of dusty sheets in the vents of an alien ship. He stares at the shiny metal ceiling and sighs. He doesn't know what to do from here. He can't exactly hide out on their ship forever, and there's no way of knowing if they are just going to kill him if they find him. The blue one had seemed too surprised to do anything, and realistically, Tommy could probably take it in a fight. It was spindly enough to be pretty easy to knock down, but Tommy doesn't trust the wicked set of claws it's sporting, nor the mouthful of sharp teeth. He would stand no chance if all of them managed to corner him somehow. They were all shorter than him, but the pig-looking one had \n\nbulk\n\n. Tommy doesn't doubt that he could hold his own, but the chances of him being able to knock it to the ground and run are slim at best. \n\n \n\nPlus, he had seen the weapons it carried on its hip. Tommy \n\nreally\n\n doesn't want to be shot with an alien disintegration ray or whatever that thing does. He pulls a blanket over his legs, still scraped up from his foray in the woods and sighs deeply. He tugs another, softer blanket over his shoulders and curls into it. He takes a deep breath. As terrible as the situation is, he is not going to \n\ncry\n\n. \n\n \n\nTommy falls asleep soon after that. As stressed as he is, his days are exhausting, and sleep comes easy. He dreams of long grass and the moon. He dreams of home, and if he wakes up with his eyes watering a bit more than normal then, well, it's not like there's anyone around to judge him for it. \n\n \n\n___________________\n\n \n\nPhilza and Technoblade don't believe him at first, of course. Why would they? His claim is absolutely wild, and he \n\nhas\n\n been known to have rather vivid dreams, but after Wilbur frantically explained what he had seen, the evidence began to fall into place. \n\nAll\n\n of their fruit was missing. Somehow. How it even managed to carry all that, they have no idea. \n\n \n\nOnce it has been established that Wilbur's encounter with the human was not just a waking dream, they sit down around the table to come up with a plan, heedless of the late hour. \n\n \n\n\"We need to tell the Council,\" Technoblade says gruffly, hand still on his blaster as though the human is going to come dropping from the ceiling at any moment. Which, if it really \n\nhas\n\n been living in the vents, it's definitely a possibility. \n\n\n\"No, no, c'mon,\" Philza says with a shake of his head. \"You know what the Council does to humans that get captured.\" \n\n\n\"Yeah, but that's not \n\nour\n\n problem,\" Techno says, crossing his arms. \"I don't care what happens to it after, I just need it to not be on our ship.\" \n\n\n\"Oh, but if it's the one from that trading post-\" Phil starts, a taloned hand coming up to rest over one of his hearts. Techno and Wilbur cut him off with twin groans. \n\n\n\"Phil, don't start,\" Wilbur says from where he is draped over the kitchen chair. \"I saw it, it's not a \n\nbaby\n\n human. It's not an adult, but it isn't a \n\nbaby\n\n.\" \n\n \n\nPhil's tail feathers rattle in agitation, and he opens his mouth to speak again before being cut off by Wilbur. \n\n\n\"Alright, okay. I'm not saying we turn it into the Council either- oh, Techno don't you give me that look. Do you know how \n\ninteresting\n\n humans are?\" Wilbur says, a sharp-toothed smile spreading across his face as he leans forward further. \n\n\n\"Oh for the love of-\" Techno growls before Wilbur continues. \n\n\n\"\n\nNo one\n\n is able to research them successfully! They're too slippery and bitey, but \n\nwe\n\n have one on the ship, and it's not like there's anywhere for it to go. If we can get it in one spot we could learn \n\nso\n\n much about them.\" \n\n\n\"Wilbur. You had better not be-\" Philza starts, a warning in his voice. \n\n\n\"Oh don't be such a \n\ndad\n\n,\" Wilbur says, waving his hand dismissively. \"I'm not gonna dissect it or anything, I just wanna take some measurements!\" \n\n\n\"Are you kidding me?\" Technoblade rumbles. \"Are you \n\nboth\n\n seriously going to try to \n\ntame\n\n it?\" \n\n\n\"It- \n\nthey\n\n are not an animal, Techno. Humans are sapient, you know that.\" Philza admonishes sternly, making Techno roll his eyes. \n\n\n\"We don't know \n\nhow\n\n sapient, though.\" Wilbur points out, eyes off in the middle distance as he gets drawn back into his theories. Techno and Phil both elect to ignore him as he descends into his quiet ramblings. \n\n \n\n\"Alright, fine,\" Techno says finally, standing up from the table. \"If I really \n\nam\n\n outvoted and we aren't turning it in to the Council, then we need to figure out a way to catch it.\" \n\n \n\n________________________\n\n \n\nTommy is downright \n\noffended\n\n. \n\n \n\n\nThis\n\n is the trap they laid out for him? Do they think he's a fuckin' rabbit? \n\n \n\nTommy stares at the plate of food sitting innocently inside of a wire cage as though he can levitate it to him through sheer force of will. They might as well have put it under a box with a stick. Tommy snorts at the thought, uncrossing his arms. \n\n \n\nAs irritating as it is to be treated like some wild game, it at least means they're underestimating him, which is good news for him and \n\nterrible\n\n news for the aliens. He also isn't going to leave a fuckton of food out for the space rats, not with the way he's been eating for the past couple of days. He glances around the storage room where the pathetic trap had been sprung. His eyes land on a long metal pole and he smirks, snatching it from the wall. \n\n \n\nIt takes a few minutes of maneuvering, in which his eyes constantly dart to the door, waiting for one of the aliens to burst in and tackle him to the ground. Not that he would be able to be held down by them for long. Unless it was the pig-one. Then he'd have some trouble. Tommy eventually slides the plate out of the cage. The moment the plate leaves the metal box the door to it snaps shut, though it gets stuck on his metal pole. Tommy scowls and wrenches the pole out of the door. It's \n\nhis\n\n pole now, motherfucker. The door closes fully, and Tommy chuckles at the idea of the aliens coming back to an empty trap. \n\n \n\nThat's what they get for treating Tommy Fuckin' Innit like some dumb animal. \n\n \n\nHe grabs the plate and hops up to the air duct, he shoves the plate and the pole inside and then climbs in after it, shutting the vent behind him. The last thing he needs is them blocking off the vents that he uses as entryways into the rooms. \n\n \n\nHe eats a balanced meal for the first time in a \n\nvery\n\n long time once he gets back to the intersection where all the vents meet, which he's been taking to calling his 'Home Base'. It's a lot cooler than his hidey-hole, it makes him feel like a badass spy. He shoves the plate into a corner and hopes the aliens set more traps that he can steal from. \n\n \n\n____________________________\n\n \n\n\"So,\" Phil says, frowning. \"We know they're smart enough to avoid being trapped.\" \n\n\n\"Ya'\n\n think?\n\n\" Technoblade growls, glaring at the empty cage as though it committed a personal offense against him. \n\n\n\"What say we keep trying?\" Wilbur suggests from where he was inspecting the cage for any signs of mechanical failure. \"Keep setting up more and more complex traps to see how good it is at being a little escape artist.\" \n\n\n\"Why not just set up a \n\nreally\n\n foolproof one right away?\" Techno asks with a frown. Wilbur smiles impishly. \n\n\n\"Well then we won't get an accurate measure of their intelligence, will we?\" \n\n \n\nTechno groans in irritation for what feels like the millionth time since Wilbur had first seen the human. Of course he would get stuck with a mad scientist, an overly paternal Elytrian, and a \n\nhuman\n\n. \n\n \n\nHe really does have the worst luck\n\n \n\nHonestly, Tommy’s kind of having fun. \n\n \n\nSue him, he's been bored on this stupid space boat, though it was definitely more fun than that other ship he had been on. His point is, there isn't a lot to do, so when the traps the aliens set out for him get steadily more tricky to find a work-around for, he jumps to the challenge without hesitation. \n\n \n\nBesides, he has to get food \n\nsomehow\n\n, and there's no way they aren't keeping a close eye on the kitchen. Not after he had been caught red-handed by the blue one. Alright, \n\nmaybe\n\n he had gotten a \n\nlittle\n\n cocky after four straight days of successfully outsmarting every trap that the aliens laid out. Eventually, they became less like traps and more like puzzle boxes. \n\n \nAgain, Tommy would be offended at the notion of needing to open a puzzle box to get food, like some sort of overgrown lab rat, but beggars can't be choosers. Not that he'd ever beg, of course, he just takes the stuff he wants like a man. \n \n\nOn the fifth day of the strange game the aliens seemed to be playing, Tommy got cocky. This would, like many instances in his life, prove to be his downfall. He silently climbs out of the vent, peering around the room for anyone who may be standing nearby. There is no one, so Tommy creeps forward, leaning down as far as he can without walking on all fours. There is a now-familiar trap laid in the middle of the room, more complex than the primitive cage the aliens had first set up, but less intense than some of the more recent ones. It is a plate of food on a pressure plate with a net laid under it, the ropes dyed the same color as the floor. If Tommy had worse vision, he might not have seen it. \n\n \n\nAs it stands, though, Tommy has twenty-twenty vision, so he scoffs and hoists up his metal rod, poking at the net to see if it springs up. Nothing happens, so Tommy takes another step forward. \n\n \n\nA floorboard creaks behind him and he whips around, food all but forgotten. He lifts his metal rod, ready to bring it down on the head of whichever alien had managed to sneak up on him.\n\n \n\nIt's the fuckin' blue one. Only it's not blue now, it's a steely grey, blending in near perfectly with the walls. Of fuckin' \n\ncourse\n\n it's a goddamn chameleon. Well, that doesn't matter, he'll smash its stupid big head in either way. \n\n \n\nHe is knocked to the ground when his metal pole is bear inches away from the chameleon-fuck's head, it goes clattering across the floor loudly. Tommy howls in rage and immediately tries to roll over and start clawing at the eyes of whatever fucker thought they could attack \n\nhim\n\n, but he doesn't get the chance before a thick, red cloth is draped over him and then wrapped tight, restraining his movement. Tommy thrashes wildly, snarling and making all the animalistic noises he can think of. If they want to treat him like a wild animal then \n\nfine\n\n. Tommy can \n\ndo\n\n wild. \n\n \n\n\"Fuck all of you!\" He howls, though he knows there is no way they speak English. \"When I get out of this fucking blanket I'm burning this ship to the fucking ground I don't \n\ncare\n\n!\" \n\n \n\nOf course, the aliens don't react to his threats. The one holding him down speaks, and its voice is deep enough that the sound rumbles solidly throughout his entire body, so that at least tells him that it's the pig-looking-one holding him down, which only makes him thrash harder. Why couldn't the bird one have been the one to capture him? His legs look fairly breakable. \n\n \n\nHe feels panic begin to build in his chest when his writhing and spitting do nothing at all. He begins thrashing more furiously, howling louder as fear grasps his heart. His breathing speeds up, which he really can't afford considering the fact that his mouth is covered with a fabric that he can barely breathe through as-is. Suffocating in some alien's bedsheets is maybe the \n\nleast\n\n cool way to die in space. \n\n \n\nTommy jerks his head one more time and manages to free his head from the fabric. He takes the opportunity to take a deep breath of blessedly cool air, he looks up at the aliens, fully ready to start screaming again, but pauses, eyes wide. It's the first time he's gotten a close look at them, and the strangeness of each of their faces startles him into silence for a moment. \n\n \n\nHowever, that moment of quiet is broken when the birdy one reaches out a careful hand towards his head. \n\n \n\nOh, fuck no. No. He might have been captured, but he is not going to be pet like a fucking \n\ndog\n\n. He is not going to be these aliens’ freaky little \n\npet\n\n. \n\n \n\nHe lunges to bite at the bird-thing's hand, only missing because the pig-one noticed his movement and tugged him back, sliding him across the floor. He grumbles something to the bird-one and covers Tommy's head with the blanket once again. As soon as the blanket is back over his head, he starts screaming bloody murder again, voice going raw after so much use after not speaking for months on end. \n\n \n\nTommy is so so \n\nso\n\n pissed off. There isn't anything he can do but lay here wrapped in a \n\nblanket\n\n and wait to see what the aliens do to him. The worst part is that he could probably break out of the pig-thing's hold if he hadn't been living off of fruit and weird alien food for the past however-long, but as it were he hadn't exactly been the pinnacle of health lately, only getting meals from poorly constructed traps. \n\n \n\nSo he was stuck, and that makes him so \n\nmad\n\n. \n\n \n\nHe can't just sit here and scream while the aliens have a weird, garbled conversation over him like he's not even there. Which, to them, he might as well not be. He doesn't know what they want from him, but he's willing to bet they don't see him as an equal in any sense, not with the way they had been trying to trap him for the past few days. \n\n \n\nHe can't keep screaming, not with the way his throat is burning and his breath is coming in short, panicked gasps, but there is one more thing he can try. \n\n \n\n___________________\n\n \n\nTruthfully, none of them were \n\nreally\n\n expecting this to work. The human had been successfully avoiding every single one of their traps like clockwork, delighting Wilbur and irritating Technoblade.\n\n \n\nTechnoblade put his foot down when the human had managed to steal food from a lockbox, not by finding the key, but by stealing the box and r\n\nepeatedly throwing it down the stairs until it broke\n\n. Clearly, it wasn't going to give up. They needed to find another way. \n\n \n\nWilbur disagreed but was quickly overthrown by Philza, who was starting to worry that the human was going to manage to break into the cockpit and crash the ship like it had the last vessel it had been on. Technoblade quietly rejoiced in his head that at least \n\none\n\n other person on the crew had some modicum of sense to their name. \n\n \n\nThe next issue is actually managing to find a trap that can hold the little monster. Techno suggested some sort of nerve gas to knock them unconscious, but finding one that would be effective on a human proved surprisingly difficult. Of course humans would just \n\nhappen\n\n to be stupidly resistant to poison. Why not? \n\n \n\nAfter a lengthy discussion about how to capture the human without it being able to attack them, the decision they came to was almost laughably simple. \n\n \n\nWilbur would hide in the room with the trap in it while camouflaged and distract it while Techno came up behind it and wrapped it in his cape. Philza had pointed out that the human would probably be able to break out, only for Wilbur to remind him that they had been living in the walls and only getting one meal a day. Not to mention the fact that none of them knew how they were being treated on the other ship, but it likely wasn't good enough to keep it at peak health. \n\n \n\nTechnoblade winces at the broken-hearted expression that crosses Phil's face when Wilbur mentions how skinny they looked when he had found him raiding their fridge. There was no way he wouldn't baby this human into an early grave once they actually managed to catch them. \n\n \n\nSo all this nonsense leads to where they are now, with the human hissing and spitting viciously from where they are tangled in Techno's cape. They are a lot bigger than Techno thought they would be, even taller than him. \n\n\n\"I thought you said they were a shoat!\" Technoblade grumbles, adjusting the writhing bundle of cloth in his grip. \n\n\n\"They \n\nare\n\n,\" Wilbur says, still a little shaken from almost getting his head taken off by a piece of pipe. \"I hope they're big for their age, because if this is a young human I do \n\nnot\n\n want to see a grown-up one.\" \n\n \n\nPhilza winces as the human lets out another furious scream, his sensitive hearing no doubt giving him a headache already. \n\n\n\"Okay. We've got them all secure,\" Techno says, eager to leave the human in a room somewhere and not have to listen to it scream any more. \"Phil, you got the holding cell all set up?\" \n\n\n\"Yup,\" Phil responds, eyes not leaving the thrashing human. Techno rolls his eyes at the unfiltered empathy in his gaze. \"Wilbur helped me set it up with stuff humans need.\" \n\n\n\"Great, now-\" \n\n \n\nTechnoblade goes silent when the human's breathing starts to change, going from heaving, shaky breaths to shallower wheezes. \n\n\n\"Uh-\" Is all he manages to get out before the human jerks a couple of times, his thrashing less angry and more desperate, before falling limp under the cape. \n\n \n\nThe three crew members freeze, all staring down at the human. \n\n\n\"Holy \n\nshit\n\n,\" Wilbur breathes. \"Did you fucking \n\nsuffocate\n\n it?\" \n\n\nPhil jumps into action even as Techno sputters out denials. Technoblade jostles the human in his arms, trying to get them to react. Screaming and trying to bite anyone that got close is infinitely less unsettling than lying limply like this. Humans are \n\nsupposed\n\n to be loud and aggressive. They aren't supposed to be so... \n\nstill\n\n. \n\n \n\nTechno starts to worry that he really has killed them, and the thought traces a shiver up his spine. This human is still young, and though the chances are slim, the stories of what happens to people who kill a human child are fresh in his mind. \n\n \n\nAfter all, parents are always close behind. \n\n \n\nPhil pulls the blanket away from the human's head, revealing a slack face, half-covered by ear-length greasy blond hair. They don't react to the blanket being pulled away, making Phil click worriedly in the back of his throat. Techno looks up to Wilbur, brows furrowing. His brother only gives him an equally concerned look in return as Phil tries to figure out where the pulse point is on the human. \n\n \n\nPhil pulls back for barely a second, and that’s when the human springs up out of Technoblade's arms, making everyone but him shout in alarm. Phil reels backward in surprise as the kid dives past him towards the vent he had come out of. Techno is frozen for only a second before he dives after them, grabbing them by the legs before it can fully climb into the vent. He tugs them down, where they crash to the ground. They look dazed for only a moment before they go right back to trying to claw Techno's eyes out. \n\n \n\nTechno grabs their wrists, struggling to get a good hold that would actually allow him to pin them down.  He manages though, and the human opens their mouth to scream again. Techno surges forward and collides their foreheads together with a solid thud. \n\n \n\nThe human goes limp, hopefully for real this time, and splays out across the floor, blinking dazedly a few times before their eyes slip shut and their breathing finally settles. \n\n \n\nHe turns to see Phil and Wilbur both looking at him with exasperation. \n\n\n\"What?\" He grumbles. \"They're not trying to kill us anymore.\" \n\n\n\"Techno, mate, you couldn't have gone for a less violent approach?\" Philza asks, coming up beside him to check on the human himself. \"We don't know the first thing about human medicine, if you really hurt them none of us would be able to treat them.\" \n\n\n\"If you would rather I just let them run back into the vents and live in our walls like a little pest, then I can just shove them back in there.\" Technoblade shoots back, slinging the human over his shoulder. Philza doesn't respond, which Techno takes as a win. \n\n \n\n\"Now c'mon. Let's get this 'poor innocent baby' to a holding cell.\" He says, marching to the prison deck as quickly as he dared. The last thing any of them need is the human to wake up on their way to the holding cell. \n\n \n\nTechno manages to get to the cell without any more disasters, which is quite the feat with this crew, not to mention their newest stowaway, and dumps the human on the bed that had been set up for them by Philza and Wilbur, who had both done their best with what little information there is about human culture. \n\n \n\nTechnoblade hopes they like it, for the sake of his eardrums. \n\n \n\nTommy wakes up, which is a surprise in itself considering the last thing he remembers is having his head smashed by the pig-alien. Honestly, if he had been conscious long enough to think about it, he would have expected to be dead. He tries to ignore the sting of dread that crawls up his spine. He's glad he's alive, sure, but if he's still breathing then the aliens must have some sort of plan for him.\n\n \n\nHe shakes his head to clear it of his quickly darkening thoughts, and then immediately regrets it when his head gives a painful jolt. He doesn't know how to check himself for a concussion, but he sure hopes he doesn't have one. He's going to need to be in top condition if he's going to fight off the aliens. \n\n \n\nTommy opens his eyes, breathing a sigh of relief at the dim lights of the room. He sits up, and his stomach sinks in dread at the sight of the room around him. \n\n \n\nIt's small and square, with dark metal walls on all sides. There is a sunken rectangle in the wall, clearly where the door is, and Tommy immediately darts to it and tries to pry it open, scratching at the edges, trying to find a place to slip his fingers in and force it up.\n\n \n\nHe has no luck at all, the door clearly isn't going to open from the inside. It may as well be a part of the wall. Tommy pulls away a bit too quickly and his finger starts to bleed. He hisses through his teeth, wrapping the bloodied finger in his shirt to stem the bleeding. \n\n\n\"Shit,\" Tommy says, scrambling back further into the corner of the cell. \"Shit.\" He says again, more of a breath than a word. \n\n \n\nHe doesn't know what to do. He- he's fucking stuck. \n\nAgain.\n\n \n\n \n\nHis breathing is speeding up, but he doesn’t notice that. He doesn’t notice anything except for the way the walls are slowly closing in on him. Fuck, is this some fucked up alien torture chamber? Is this another horrible test of his strength? \n\n \n\nHe's panting now, though the moment he notices he slaps a hand over his mouth. No. Fuck that. He is not an animal, no matter how they treat him. He is a person. He is a \n\nperson\n\n. \n\n \n\nHis head is starting to spin, and the walls aren’t ceasing their movements. He's going to black out if he keeps going like this, and then he really \n\nwill\n\n be defenseless. He tries to calm himself down, recite the things he learned in health class. \n\n \n\nAlright. Five things he can see. Uh- dark walls, no doors, no windows, no- okay, no. Fuck keeping himself in the moment. The moment is what's \n\nmaking\n\n him lose his shit!\n\n \n\nHe takes a deep, shaky breath, long enough that it strains his lungs. They burn, but his vision begins to clear. The walls aren’t moving. That's good, though he still tries to keep his eyes on the ceiling, to not focus on how \n\ntiny\n\n his cell is. \n\n \n\nIt's better than the last one, at least. This cell had to be twice the size of the puny little fucking \n\ncage\n\n the last aliens kept him in. \n\nSeriously\n\n, fuck them. This one even has stuff in it, though he's too nervous to focus on what that stuff is. \n\n \n\nHe hears something from beyond the not-door, making him jump. It rumbles like a voice but is in no discernable language, so at least Tommy knows the aliens aren’t shoving him in solitary confinement for the rest of forever. He shifts forward, clenching his teeth anxiously when the fabric of his clothes shift against each other. The alien voices go silent. He curses under his breath. \n\n \n\nWell, they know he's awake. \n\n \n\nTommy glares at the not-door, waiting to see what will happen next. To his surprise, the door disappears, spilling light into the dim room. His head throbs at the sudden brightness, but he doesn’t give a shit. How could he when freedom is right \n\nthere\n\n? The bird-alien is standing in the doorway, making gestures at him that Tommy doesn’t have the slightest chance of understanding. It doesn’t matter, if the bird-alien is the only thing guarding him, then this will be a total cakewalk. \n\n \n\nTommy lunges for the door. He can practically taste the dust of the air vents that he has been calling home for the past week. The bird-alien makes a panicked noise, but Tommy isn’t going to hurt him (much), not unless he gets in Tommy's way.  \n\n \n\nTommy finds out why the bird-alien had let out that panicked squawk when his head collides with the door, shuddering the frame and knocking Tommy on his ass. Tommy blinks up at the not-door dumbly, before shaking his head and bellowing in rage, making the bird-alien coo nervously at him. \n\n\n\"Are you \n\nFUCKING KIDDING ME?\n\n\" Tommy rages, getting to his feet and ignoring the wave of dizziness that overtakes him. \"First your stupid fucking door is just- not even a fucking door! It's a goddamn wall! And then it disappears and what? It's some dumb-as-shit \n\nforcefield\n\n?\" \n\n \n\nTommy spins around, throwing his arms in the air. \n\n\n\"FUCK THIS AND FUCK YOU!\" He turns around once again to point viciously at the alien with the most terrifying glare he can muster. \"And \n\nespecially\n\n fuck your door.\" He hisses. \n\n \n\nThere are more footsteps pattering down the hallway of the cell he's being kept in, and Tommy retreats back into the furthest corner from the now-transparent door, curling his lip into a snarl and trying to keep his panic at bay. \n\n \n\nThe aliens stop outside of the door, all three of them are standing there now, the pig-one looks as impassive as always, the bird-one still looks concerned, probably for the bruise that is spreading across his forehead, and the chameleon-one is staring at him with excitement. \n\n \n\nTommy's stomach immediately twists in disgust and dread upon the sight of its expression. No one has ever looked at him like that with good intentions. The curiosity burns in its huge eyes, making Tommy want to lash out, to cry, to curl up in a ball under his cot and never come out. \n\n \n\nHe does none of these things, he stands his ground. Whatever they want from him, he's going to do everything he can to stop them from getting it. Fuck them and fuck their ship and fuck their door. He isn’t doing this again. He won last time, he got out. He can do it again. He can do it however many times he needs to. \n\n \n\nHe tries not to think about how these aliens have actually set him up in a real cell, not just some crate. They aren’t underestimating him anymore. \n\n \n\nHe shudders. \n\n \n\nThe chameleon-one starts talking to the other, fast and excited, and fear rises in Tommy's chest. He smothers it with anger, clenching his fists hard enough that- had he not bitten them all down to the quick, his nails would be digging into his palms right now.\n\n \n\n\"Shut \n\nup\n\n!\" He barks out, making the aliens stare at him. He flinches back under the attention but doesn’t stop. He can’t afford to show weakness of any kind right now. \"Go away! Leave me alone!\" He growls, but the aliens, of course, don’t move. They can’t understand him. He flips them off, just to get a little more of his anger out. \n\n \n\nThey don’t react, and Tommy feels all the fight drain out of him as his head gives another painful throb. He lets out a shaky breath, hoping he doesn’t look as lost as he feels right now, and walks over to the cot. He tugs the blankets off of it and drags them underneath. He isn’t sleeping on a bed they gave him. He'd rather sleep on the floor. He can manage fine on his own. \n\n \n\nHe doesn’t open his eyes until the light behind his eyelids dies out, telling him that the door has gone opaque again. He lifts his head to check and lets out a breath of relief that the aliens aren’t staring at him anymore. He lays his head back down and buries his face in the blankets. \n\n \n\nHe'll find a way out. He will, but for now, his head hurts and he's tired deep down to his bones. He wants nothing more than to curl up and cry, but he can’t. He doesn’t know when they are bringing him water, and he isn’t going to risk dying of thirst so he can cry it out. \n\n \n\nIf a few tears slip out then, well. It's not like it was much lost water anyway. \n\n\n___________________\n\n \n\nIt's been about a day since the human woke up, and they have made no progress whatsoever. Realistically, it was going to take a lot longer than that to get through to the human and convince them that they aren’t going to hurt them, especially after their rather violent introduction, but the human wouldn’t so much as look at them without spitting and hissing and making all sorts of ferocious noises that- even if they didn’t speak the same language, were clearly insults. \n\n \n\nStill, though, despite all of the human's aggression, they are a child. A terrified child, no less, and Phil is not going to give up on them. Even if they do not show the same signs of youth of his own species, they still show the universal indicators of a creature that has not yet reached full maturity. Their eyes are a little too big for their face, and they are lanky in a way that tells of them shooting up too fast without enough time to grow bulk as well. Every part of them makes Phil's hearts pang with pain. He can see in the human's stance that they hadn’t known peace for a good long while. Phil hopes he can change that. \n\n \n\nThe language barrier is a massive issue, of course, but there isn’t much to be done about that. They try to communicate through gestures and drawings, but the human will not look at them. They rarely come out from under their cot, nor do they do any of the activities Phil left out in the room for them. He left puzzles and things to keep the human-occupied while they waited to figure something out, but they barely looked at them before scowling and shoving the boxes into a corner. \n\n \n\nWilbur is eager for the human to interact with them, even nonverbally, but Phil reminds him that they are likely \n\nvery\n\n overwhelmed right now. The last thing they need is to push them past their breaking point when they won’t even look at the three of them.\n\n \n\n\"Right,\" Technoblade says gruffly, gazing through the one-sided window into the human's room. \"What're the chances the human doesn’t just break out of here and bring the ship down like it did the last one?\" \n\n\n\"I don’t know,\" Philza admits, resting his forehead on the blessedly cool metal of the wall. \"Less, I'm pretty sure. I got the reports from the remains of the ship, they were holding them in something much less advanced, fairly easy to break out of if you could figure out how the lock mechanism worked.\" \n\n \n\nTechnoblade hums, not moving from his position at the door. Wilbur returns, causing Phil to let out a sigh of relief.\n\n\n\"Hey Wil,\" Phil greets, bumping his forehead against Wilbur's shoulder in greeting. \"You bring food for the little guy?\" \n\n \n\nWilbur nods, ignoring the incredulous scoff that Techno lets out. \n\n\n\"\n\nLittle guy\n\n,\" He mocks under his breath, rolling his eyes. \n\n\n\"How are we supposed to get the food to them?\" Wilbur asks, ignoring Techno. \"I'm not going in there, they almost took my head off earlier.\" \n\n\n\"There's a slot in the door,\" Phil says, pressing a button that opens it. The human immediately shoots to a sitting position, glaring at the door, clearly paranoid about any change. \n\n \n\nWilbur slides the container of food in through the slot, where it sits on the floor. The three of them watch as the human slowly creeps across the room and opens the container like it will explode if they move too fast. \n\n \n\nThe human stares at the food for a moment before pulling back with a sigh. They mutter to themself before picking up the container and carrying back under the cot. They eat with their back to them, as though one of them is going to come into the room and take it. Phil chuckles at the thought, none of them are going to risk losing a hand to take the food away from the human. \n\n \n\n___________________\n\n \n\nTime passes, and they make no progress. There have been four sun rotations since the human had been captured and put in their room, and still, the human will not look at them. The only time they come out from under the cot is to eat and try to get the door of the room open. \n\n \n\nWilbur has run out of notes to take, and besides, their atypical behavior isn’t that useful from a scientific perspective. This clearly isn’t how humans would act in a normal setting. \n\n \n\nTechnoblade is getting restless, spending most of his time guarding the door or pacing the hallway. \n\n \n\nPhil tries to get through to the human. Though not much is known about humans, it is pretty clear that they are social creatures, so he makes a point to reduce the opacity of the door at least once a day and try to have a conversation with the human. \n\n \n\nThey only ever scowl at him, but they watch him with wide eyes as Phil reads to them in a language they cant understand. Phil can’t tell whether they won’t stop looking at him out of fear or out of curiosity. Phil hopes it's curiosity, for both of their sakes. \n\n \n\nThe only time the human is unsupervised is when the crew members eat dinner together. Though it was usually a peaceful affair, meant to foster familial relationships among the crew, for the past four days it had been more stressful, mostly due to Techno constantly checking the cameras to make sure the human hadn’t escaped. \n\n \n\n\"Techno, mate, could you stop freakin' out?\" Philza pleads. \"You're makin' everyone nervous.\" \n\n\n\"No, Phil.\" Techno huffs. \"This is stupid. This was a bad idea, we should have just turned them in to the Council.\" \n\n\nPhil opens his mouth to argue, but Techno pushes forward. \n\n\n\"I am not going to sit here and wait for them to figure out a way to escape and kill us, I've put too much time into this ship to lose everything to some human shoat.\" \n\n \n\nTechno stands up, punching numbers into his communicator. Philza reaches out to grab it, panicked that he was calling the Galactic Council. \n\n\n\"I'm not gonna report them, Phil. We'd get in a heap of trouble for fostering a human anyway.\" Phil sighs and relaxes back into his chair again. \"There's only one person we know who can even speak a little bit of human.\" \n\n \n\nHe punches in the last number and brings the comm up to his ear. \n\n\n\"Hey Tubbo, you busy?\"\n\n \n\nIt's been five days, if Tommy's counting right. There aren't any windows, and even if there were a clock in here it would probably be in stupid alien numbers anyway, so Tommy keeps track of the days by the times the aliens bring him food. They are keeping him on three meals a day, which is at least better than the last ones. \n\n \n\nHe still hasn't tried to communicate with his captors. He doesn't see the point, even though they keep making gestures and sounds at him like he's going to suddenly understand what they're trying to say. They are either going to kill him, turn him in to the space cops, who will\n\n definitely\n\n kill him, or do fucked up experiments on him until he's so fucked in the head that he won't be able to lift a finger to fight back. They might even try to keep him as some sort of twisted pet, his money is on that at the moment based on the way the bird-one keeps trying to talk to him. At least he isn't being fed out of bowls, he'd rather starve to death than stoop that low. \n\n \n\nIt is a strain on his dignity to accept the accommodations the aliens have set for him already, but if he is going to keep his strength up then he needs to eat. He's pretty confident none of the food is poisoned, as it lacks the bitterness of most of the orally administered poisons, but hey, maybe they managed to find some sweet deadly chemical to slip into his meals. He tries not to think about it as he eats. \n\n \n\nHe's mostly just been sleeping and staring at the wall, which he knows is pissing off the chameleon one, who he's spotted taking notes on his behavior. Well fuck them, if it comes in here to hit him for being uninteresting it's gonna lose a hand. \n\n \n\nThere are little items scattered around the room, presumably to stop him from tearing his hair out in boredom. There are what look like puzzles on a shelf in the corner, but when Tommy opens the boxes the pictures on the puzzles are alien landscapes. Tommy's heart pangs with homesickness, and he slams the lid shut and shoves the box into the corner where he doesn't have to look at it anymore. \n\n \n\nThere are toys as well, but Tommy isn't interested in them. He is not their pet, he isn't going to mess with any of the weird stuff they left him. No matter how bored he is. \n\n \n\nOkay, maybe he fiddles with a couple of the lockboxes they left him when none of the aliens are looking. There might be something cool inside, after all, and he needs all the advantages he can get. Apparently one of them saw him messing with the box because the same day he manages to get it open, another one is left with his food, and the bird one looks extra cheerful when he comes to read to Tommy in his strange, chirping tongue. \n\n \n\nTommy listens to the bird-one speak as he lays on his stomach under the cot and tries to figure out the combination to the lockbox. He may not understand what they are saying, but it\n\n is\n\n nice to hear another voice after so long alone. He tries not to get too reliant on him, though, it's only a matter of time before the company ends, and he's alone in this stupid dark cell again. He tells himself he looks forward to being alone and spins the dial on the box a few more times. Nothing happens, and he grumbles in frustration, tilting the box so he can get a new angle. \n\n \n\nHe looks up when he realizes the bird thing has stopped speaking and frowns when he sees the door has gone opaque again. Strange, the bird one usually stayed for longer than that. Tommy shrugs to himself, trying to ignore the icy pang of loneliness that begins to creep into his heart. Whatever. He doesn't care, he doesn't even want the bird-thing to talk to him at all. Whatever.\n\n \n\nThe lockbox clicks but doesn't open. Tommy growls and resists the urge to throw it against the wall and break it open by force. \n\n \n\nHe hears voices outside of the door, and he blinks a few times in confusion when he realizes there is a fourth voice this time, one he doesn't recognize, smooth and buzzing somehow. Tommy sits up, setting the box aside silently. A new person spells nothing but danger for him. He backs himself under the cot and waits to see what will happen. \n\n \n\nWhat else can he do? \n\n \n\nAfter a few more minutes of hushed conversation with this new alien, the door clicks and turns clear. Tommy tenses, expecting some buff-ass space cop armed to the teeth, here to kill him. \n\n \n\nIt is not that. \n\n \n\nTommy stares at the newcomer. They are \n\ntiny\n\n, for lack of a better word. Four feet tall, \n\nmaybe\n\n. They are marked with yellow and black stripes, immediately reminding Tommy of the bees back home, sporting a ring of \n\nextremely\n\n soft-looking fluff around his neck and wrists. \n\n \n\nOnce the shock of seeing yet another alien creature has worn off, rage settles back into Tommy's chest. Oh hell no, are they selling tickets to see the human or some shit now? Is this some sort of zoo? \n\n \n\nHe flips the alien off, snarling, and the alien's mouth twitches into a smile, and they flip him off back. \n\n \n\nTommy laughs, though mostly from shock. The alien's antennae wave back and forth in what Tommy could guess is excitement. \n\n\n\"Hullo!\" They say, making Tommy jump. \n\n\n\"What the fuck,\" He mutters, a hand coming to his mouth. \"You speak English?\" \n\n\n\"Uh...I am learning to speak Human.\" The alien says, voice thick with an unidentifiable accent, as though its mouth was not formed to speak it. Which, Tommy reasons, it probably wasn't. \n\n \n\nTommy's first response is to hide back under his cot, to keep being standoffish and mean. To preserve his independence and his dignity at all costs.\n\n \n\nBut- he's so \n\ntired\n\n. And though he hates to admit it. He's painfully lonely. He hasn't truly spoken to anyone in months. \n\n \n\n\"...My name is Tommy,\" He says, and the alien beams. \n\n \n\n\"Oh,\" They say, and then mutter something under their breath that Tommy can't understand. \"Wow. I wasn't thinking you'd really talk to me. They say you're hiding. Scared.\" \n\n\n\"I am not \n\nscared\n\n,\" Tommy says, bristling. \"I am-\" Tommy cuts himself off, pursing his lips, trying to think of what the feeling that has been chasing him for the better part of three months is. \n\n \n\n\"I'm pissed off,\" He settles on finally, crossing his arms. \n\n\n\"I don't know what that means.\" The bee-alien admits. Tommy huffs through his nose, reminding himself to speak in simpler terms. \n\n\n\"I'm angry,\" He tries, and the alien lights up. \n\n\n\"Oh! That is why you tried to bite, yes?\" The alien asks. Tommy laughs again, against his will. This alien better not get too proud of themself for making him laugh. There isn't exactly a lot of comedy in the prison of a UFO. \n\n\n\"Yeah, that's why I bite,\" Tommy says wryly. \"Hey, tell me your name. You know mine, it has to be fair.\" \n\n \n\nThe bee-alien takes a moment to stare at him blankly, making Tommy bristle before he realizes they are probably just translating what he said. \n\n\n\"Tubbo,\" They say, smiling. \"And uh, I'm male. I know it can be hard to tell for other species...and uh, if you don't mind me asking?\" \n\n\n\"I'm a dude- or, a male. Also.\" Tommy says, trying not to use slang so as not to confuse Tubbo. \n\n \n\nTubbo nods and smiles, and Tommy feels a smile creep up on his face in response despite himself. He does his best to tamp it down, but based on the pleased fluttering of Tubbo's wings he hasn't managed it. \n\n\n\n\n\n____________________________\n\n \n\n\"Are you fucking kidding me?\" Wilbur says from where they are watching on the cameras. \"Five days and we make no progress and Tubbo makes them laugh in two seconds and gets their name in five?\" \n\n\n\"He's a friendly guy, mate.\" Phil reasons from the kitchen. \n\n\n\"That's one way of putting it,\" Wilbur says, collapsing onto his chair. \n\n\n\"To be fair,\" Technoblade says, not taking his eyes off the screen. \"Tubbo is probably the least outwardly intimidating out of all of us.\" \n\n \n\nPhilza wanders back over to the screen, setting down a cup of tea in front of Wilbur. He takes it with a grateful churr and drinks deeply. \n\n\n\"Oh, this is great!\" Phil says, smiling. \"They aren't even hissing at him!\" \n\n \n\nThe two teenagers are talking animatedly with each other in a language none of the other crewmates can understand, all rounded vowels and emphatic hand gestures. Tubbo gets excited about something and his wings flutter wildly. The human- \n\nTommy\n\n throws his head back to laugh, showing all his teeth. \n\n \n\nSomehow, it doesn't look like a threat. \n\n \n\n____________________________\n\n \n\nThey speak for around half an hour just enhancing small talk, but Tommy finds himself drawn into the conversation anyway. Maybe it's because he's been isolated for so long, but there is something so \n\nengaging\n\n about Tubbo. His jokes always landed, even in stilted English, and he can dish out as much as he takes. Eventually, after a short lull in the conversation, Tommy builds the courage to ask the question that he needs to know the answer to. \n\n \n\n\"Why am I being kept here?\" Tommy asks, licking his lips nervously. Tubbo stares at him for a moment before answering, a quirk Tommy has gotten used to already. \n\n\n\"You...broke into the ship?\" Tubbo says slowly, tilting his head as though he is not sure what Tommy is asking. \n\n\n\"No, no,\" Tommy says, waving his hands. \"I mean, why- why in this \n\ncell\n\n? Why couldn't they have just dropped me off somewhere if they didn't want to deal with me? Am I their fucked up \n\npet\n\n or something?\"\n\n \n\nAs soon as Tubbo processes the question, his face contorts into disgust, which at least tells Tommy that keeping sapient pets is not socially acceptable. Good news all around. \n\n\n\"Ew, no!\" He squeals, scrunching up his face.\n\n\n\"Then why am I here?\" \n\n \n\nTubbo's pause is longer this time, and he seems to be pondering his question as well as translating it. \n\n\n\"They are scared.\" He says. Tommy furrows his eyebrows. \n\n\n\"\n\nThey're\n\n scared?\" Tommy parrots incredulously. Tubbo nods his head, a bit stiffly, as if the gesture isn't natural to him.\n\n\n\"Not a lot is known about humans,\" Tubbo says, almost apologetically. \"The few times they have been off their home planet they've done insane amounts of damage, so the best option to them was to keep you here.\" \n\n \n\nTommy thinks back to the smoking wreckage of the alien ship he had brought down and winces. \n\n\n\"Yeah, call me a wild card, bitch.\" Tommy says, sighing at the blank expression on Tubbo's face. \"Uh, a wild card means an unpredictable person.\" \n\n\n\"Ooh,\" Tubbo says, tapping his hands on his knees. \"That's cool.\" \n\n\n\"Are they taking me back to Earth?\" Tommy asks, and his stomach sinks with dread at the empathetic frown on Tubbos face. \n\n\n\"Tommy... no one can get near Earth, the Council has it guarded against any more smugglers.\" \n\n \n\nTommy opens his mouth to argue but closes it just as fast. It's not like it's Tubbo's fault, and he didn't say he'd never go home. He isn't going to start a fight with the one person he's been able to actually hold a conversation with in the past five months. \n\n \n\nHe nods, a bit stiffly, and Tubbo gives him a strained smile. \n\n \n\n__________________________\n\n \n\nThey talk until dinner time, when Phil (Tommy has learned their names by now) comes around with two plates instead of one this time. Tommy looks up at him warily, but he just smiles and pushes Tommy's food through the slot in the door. Tubbo stands, and Tommy only barely manages to stop himself from reaching out to him. He's not that desperate. Tubbo doesn't seem to have noticed his twitch forward, though he's shuffling on his feet, reluctant to leave, but Phil has seen the motion, and sets Tubbo's plate down in front of Tommy's cell door. \n\n \n\nPhil speaks in the weird alien-language that Tommy cant understand, and he nearly jumps at the sudden change. If he didn't look at Tubbo's  buglike features, he could almost pretend that he was back on Earth, talking to some foreign exchange student with a thick accent. Now, though, he is brought back into stark reality when Tubbo replies in the same language. \n\n \n\n\"He wants to know if will let me eat dinner with you.\" Tubbo relays, looking at Tommy. He looks up, surprised to be given a choice. \n\n\n\"You- you can stay if you want, I guess.\" Tommy says, not looking up from his food. He sees Tubbo beam out of the corner of his eye, and he tries not to smile at the way the fluff on his neck fluffs up happily. \n\n \n\nTubbo plops back down in front of the door, crossing his strange, spindly legs in front of him and pulling his plate into his lap. Tommy tilts his head, looking at Tubbo's plate as he eats. It's mostly flowers and leafy vegetables, though obviously none that Tommy recognizes. \n\n\n\"What're you eating?\" Tommy asks around a mouthful of food. \n\n\n\"Uh... wildflowers mostly.\" Tubbo says, picking up a light purple flower and chewing the petals off. \"How about you?\" \n\n\n\"I have no idea,\" Tommy says flatly, making Tubbo wince. \n\n\n\"Right... I can see about getting you better food. What do you like?\" \n\n\n\"...sweet shit.\" Tommy says. He may not like any alien knowing his business, but like hell is he gonna turn up the opportunity to get some real food in this dump. \n\n\n\"I do too!\" Tubbo says excitedly. \"I have to eat stuff with nectar in it.\" \n\n\n\"What, are you some kinda fuckin' bee?\" Tommy asks, cocking an eyebrow. \"You kinda look like one with all the stripes.\" \n\n\n\"What's a bee?\" Tubbo asks. There's a petal stuck to the corner of his mouth and Tommy wishes the door was gone so he could wipe it away. It's bothering him. \n\n\n\"Little stingy bastards that go around eating pollen and vomiting up honey,\" Tommy says, taking another bite of food. \n\n\n\"Well, I guess that's kinda like me.\" Tubbo says thoughtfully. \"I fly and sting \n\nand\n\n I eat pollen, so I guess I would be like a bee.\" \n\n\n\"You sting?\" Tommy asks. \n\n\n\"Yup,\" Tubbo replies, rather proudly. He stretches out his hand so that Tommy can see the stingers protruding from his knuckles. Tommy nearly reaches out to touch them, before remembering the invisible door and pulling back. \"They're venomous too.\" \n\n\n\"Sick.\" Tommy breathes. \"I wish I had those.\" \n\n\n\"Yeah,\" Tubbo says, taking his hand back to his side. \"They're pretty cool.\" \n\n \n\n_______________________\n\n \n\nThey talk for hours more, about their home planets mostly. Tommy does a lion's share of the talking, but Tubbo doesn't mind. It's not like he's very good at speaking human- or, rather \n\nEnglish\n\n, as Tommy called it. Apparently there are hundreds of languages on Earth, which is \n\ninsane\n\n. The idea of it nearly has Tubbo buzzing out of his skin in excitement. \n\n \n\nThe ciridican lights are nearly out by the time Tubbo stands to leave, so it must be well past midnight. Tommy is practically asleep sitting up, but he still grumbles discontentedly when Tubbo gets up. \n\n\n\"Hush, you're basically asleep. I'll be back tomorrow.\" Tubbo says, keeping his voice quiet in the still air of the hallway. \n\n\n\"No, c'mon.\" Tommy mutter, and Tubbo thinks he might actually be talking in his sleep. He's heard that humans can do that.\n\n\n\"Stop being clingy, I'm tired.\" Tubbo whispers. Realistically, the human cant do anything to stop him from leaving with the force field in place, but Tubbo still feels guilty leaving him alone. \n\n\n\"You're the clingy one,\" Tommy says, head bobbing up and down as he struggles to keep his head up. \"Talkin' to me all day.\" \n\n \n\nTubbo has a bit more trouble understanding what he's saying with how his words are slurring, but he still gets the gist. Tubbo rolls his eyes and adjusts his coat. \n\n\n\"Goodnight, Tommy.\" He says. Tommy looks uncomfortable leaned up against the wall like that, but it's not like he can get into the cell to adjust him.\n\n\n\"...'night.\" Tommy mutters, eyes already closed. Tubbo walks away, hoping Tommy doesn't have too bad of a crick in his neck come morning. \n\n \n\n_______________________\n\n \n\nTubbo tries to make it to his allotted room on the ship without running into any of the Sleepy Bois, but he has a feeling they were watching him on the security camera, because they intercept him near the kitchen, all wide eyes and hushed questions. \n\n \n\nTubbo holds up a hand to silence them, and luckily it works, because he does \n\nnot\n\n feel like shouting this late at night. \n\n\n\"I'll tell you everything I know in the morning,\" Tubbo says around a yawn. \"But for now, I'm exhausted. I'm going to bed.\" \n\n \n\nTubbo turns to continue down the long hallway, but is held fast by a large hand wrapping around his wrist. Tubbo jerks to a stop, turning back to glare at Technoblade lightly. Luckily the Piglin remembered not be so rough with his grabbing this time. Phil had been \n\npissed\n\n when Techno had grabbed him hard enough to leave bruises. Realistically, it wasn't totally his fault. Tubbo is much smaller than him and Techno isn't used to needing to be gentle, but he still was much more careful after Phil's lecture, which Tubbo appreciates. \n\n \n\n\"Hold on, one thing before you go to bed.\" Techno says gruffly. Tubbo has a feeling it isn't up for debate, so he nods and slides his arm out of the piglin's grip. \"Is he dangerous?\" \n\n \n\nTubbo furrows his brows. \n\n\n\"No,\" He says slowly. \"I don't think so. I think he's scared and confused, and that's why he lashed out. I think... I think once he understands we aren't going to hurt him, then he'll be a good person to have around.\" \n\n \n\nTubbo pretends not to see how brightly Phil is smiling as Techno hums thoughtfully. \n\n\n\"Alright. Go to bed, cretin.\" Techno says, ruffling Tubbo's hair in a rare show of affection. Tubbo doesn't hesitate to follow that command, his wings lifting him off the ground slightly to gain more speed. He reaches his room in no time at all now that he is not being badgered by the crew, and shucks off his coat before climbing into bed. As much fun as he's had talking to Tommy, he's exhausted from the journey over here, and from all the social interaction he'd had to do today. \n\n \n\nHis last thought before falling asleep is that he's going to need to start a new section in his English study booklet entirely for the swear words that Tommy has taught him. \n\n \n\nTubbo relays what little Tommy had told him over breakfast, as promised. \n\n\n\"His name is Tommy, he's sixteen, which is around my age in human-years, so he's not full-grown,\" Tubbo says around a mouthful of nectar. Techno scowls at the idea that the human may grow more, already a solid three inches taller than the piglin. \"He calls his home planet Earth. I don't- I don't think he had any family there, though.\" \n\n \n\nTechno and Wilbur both heave sighs of relief. The last thing they need is for a gaggle of full-grown humans coming to retrieve their kid. Sure, they handled one malnourished child, but an entire pack? Their ship wouldn't stand a chance. Philza frowns, though, eyes turning sad. \n\n\n\"Why was he taken?\" Phil asks softly. Tubbo shrugs. \n\n\n\"Probably because the smugglers thought no one would miss him.\" Tubbo sighs, looking out the window at the stars that zip past. Philza keens low and sad in the back of his throat, and his wings fluff up again, making Techno roll his eyes. \n\n \n\n\"Can I go back to visit him today?\" Tubbo asks as he clears his plate. \"I think he's lonely. Humans are social creatures you know.\"\n\n\n\"Of course,\" Phil says, still apparently deep in thought. \n\n \n\n___________________\n\n \n\nTubbo brings Tommy breakfast, humming under his breath to fill the silence of the halls. He reaches the indent in the wall where Tommy's cell is, and knocks twice. \n\n\n\"Good morning!\" He calls, one of the first human phrases he'd learned. \n\n\n\"Fuck off, I'm sleepnig!\" Tommy calls back. He hadn't known that word until yesterday, but he had quickly slotted it into his vocabulary. \n\n\n\"I'm gonna turn the door clear,\" Tubbo warns before pressing a couple of buttons. The door buzzes and turns transparent, revealing Tommy lying in the middle of the cell on his back. \n\n\n\"Did you sleep like that?\" Tubbo asks as he slides the plate into the food slot. Tommy sits up, wincing and rolling his shoulders. \n\n\n\"Yeah, fell asleep sitting up and didnt feel like moving.\" Tommy says as he starts to dig into his breakfast. \n\n\n\"Do you have enough blankets?\" Tubbo asks, eyeing the pile of them he's been sleeping on under the cot. \"You’re using most of them to nest.\" \n\n\n\"I'm not \n\nnesting\n\n,\" Tommy says with a scoff. \"I'm just not gonna sleep on a bed they gave me. I can handle myself fine.\" \n\n\n\"Oh, alright,\" Tubbo says. As much as he would love to convince Tommy that he doesn't have to deprive himself of a \n\nbed\n\n just to prove a point, he thinks getting Tommy some extra blankets will be enough for now. \"I can ask Phil to bring you more blankets then, if you want.\" \n\n \n\nTommy hesitates, swallowing. \n\n\n\"I don't need anyone's pity shit,\" He mutters, taking another bite. Tubbo frowns, eyes tracing the bare skin of Tommy's arms. \n\n\n\"You have goosebumps,\" Tubbo points out. \"I read about them, humans get them when they're cold.\" Tommy immediately jumps to rub at his arms, fixing Tubbo with a glare that he no longer flinches at. \n\n\n\"Shut up, what do you know.\" Tommy mutters. \n\n\n\"I kind of have to get Phil to open the door, otherwise I'd give you the blankets myself.\" Tubbo explains, standing up. \"You don't have to use them, but I'm bringing them anyway. Tommy, you don't need to deprive yourself of comfort, alright. I know this sucks, I'm doing everything I can to make it better.\"\n\n \n\nTommy just stares at him warily. Tubbo sighs and goes to get Phil. \n\n\n\"I'll be right back.\" \n\n \n\n_____________________\n\n \n\nIt is a little odd to have a linen closet on a spaceship, but he supposes the blankets have to go somewhere. He fills his arms with bundles of thick, multicolored blankets and marches off to find Phil, barely able to see over the stack in his arms. \n\n \n\nPhil is still in the kitchen, washing dishes and whistling a lilting tune to himself. Tubbo drops the stack of blankets on the floor and clears his throat, making Phil jump in surprise. The elytrian's eyes soften when he sees Tubbo though, and quickly turn to confusion when he processes what he's seeing. \n\n\n\"I thought you were with Tommy, mate?\" Philza asks, cocking his head. \n\n\n\"I was. Humans get 'goosebumps' when they're cold, and he had them. He wouldn't admit that he was cold, but it can't exactly be warm in that cell. Not to mention that he's using all his blankets to nest.\" \n\n \n\nPhil winces at the thought. \n\n\n\"You're right, good eye Tubbo.\" Phil says, scooping up the blankets from the floor and bringing to walk in his bouncing gait to Tommy's cell. \n\n\n\"What's this about the human?\" Techno asks gruffly, appearing from the hallway right in front of Tubbo. The teenager barely manages to bite back a scream of shock at the sudden appearance. \n\n\n\"Tubbo says he's cold, we're bringing him blankets.\" Phil explains cheerfully. Techno's face hardens. \n\n\n\"And you don't think this is a ploy for him to escape?\" He asks dryly. Tubbo shakes his head. \n\n\n\"He wouldn't admit that he was cold, I only noticed because I learned about human tells for this kind of thing.\" \n\n \n\nTechnoblade only grunts and follows them at a close range. \n\n\n\"Either way, I'll be keeping an eye on things,\" Techno says, and though his voice leaves no room for argument, Tubbo tries anyway. \n\n\n\"I'm not sure he's comfortable around you, didn't you knock him out?\" Tubbo says. Technoblade nods. \n\n\n\"Yup, so if I'm there he'll know not to try to get out again.\" \n\n \n\n__________________\n\n \n\nIf they're gonna be stupid enough to open the door, then Tommy is going to try to escape, obviously. He's an opportunist, he has to be to survive. \n\n \n\nHis plan is to attack Phil, not to really hurt him, just surprise him, and make a mad dash for the vents again. Once he gets in there he's gonna find where the vents lead out to the cockpit, turn on the emergency lights so the aliens know to get to safety, and land this dump as best he can on the closest planet. \n\n \n\nHis master plan is foiled when he sees Tubbo and Philza returning with Technoblade following close behind. His lip curls up in a snarl, and Techno narrows his eyes at him in retribution, only making Tommy bristle more. \n\n \n\nTheir stare-off, is broken, though when the door hisses and clicks, before sliding open. Tommy's eyes snap to the door, though he knows he won't make it to the vents with Techno standing right there, even if he has been eating three square meals a day for the past couple of days. Besides, he wouldn't want Tubbo to get hurt in the fight that would no doubt ensue. No doubt the little meddler would try to get in between them. Not that Tommy cares about him, he's just the only person he's able to hold a conversation with. Whatever. \n\n \n\nBesides, he doesn't know what the punishment would be for trying to escape. Though he never managed it himself, he saw what happened to some of the other people who tried to run. They were shoved into smaller cages, treated even worse. \n\n \n\nBefore Tommy can get pulled too far into his own memories, Tubbo marches into his cell like he owns the place and shoves the blankets into Tommy's arms. Tommy takes them with a huff of breath at the sudden weight. He has to look down to meet Tubbo eyes, and his mouth twitches up. If he wasn't being watched like prey by two aliens he would probably make fun of Tubbo for his height, but as it stands he would rather not start any argument, even a playful one. \n\n \n\nWhen Tubbo pulls away his hand brushes Tommy's, causing a shudder to run down Tommy's spine. How long has it been since he had been touched without malice? Tommy doesn't actually know, and isn't that a depressing thought. Tubbo notices, insightful little bastard, and looks at him with his weird, bug-like eyes. \n\n\n\"Oh, right...\" Tubbo says, hushed. \"Humans need touch, right?\" He asks, looking up at Tommy. The human immediately recoils, panicked at the idea of \n\nneeding\n\n anything from the aliens. \n\n\n\"No, no! Just- just kids. Kids need touch or they- you know. Get all fucked in the head.\" Tommy huffs. Tubbo tilts his head at the strange wording, ignoring Techno's not-so-subtle attempts to draw Tubbo out of Tommy's cell. \n\n\n\"You \n\nare\n\n a kid, though.\" Tubbo says, confused.\n\n \n\nTo Tommy's horror, tears start to well in his eyes. Why the fuck did that set him off. His arms start to shake, his breathing coming in faster pants. \n\n\n\"No, no-\" He mutters, sinking down to the ground and covering his face with one shaking hand, the other twisted in his shirt. \"No. I- I don't need anything, I can take care of myself.\" He says thinly. Tubbo takes a step back, looking nervous. Of course, here's Tommy having a meltdown over nothing and being the big scary human everyone expects him to be. He can hear his breaths coming out too high and thin, not getting enough oxygen to his lungs. \n\n \n\nHe's a kid. Fuck. Why did this have to happen? Tubbo turns to look at the door, and he doesn't know where he is anymore. All of a sudden, the green that is moving at him slowly, gently, as though afraid he may break if he is touched, isn't muted, forest greens. It's bright enough to hurt his eyes and make him want to vomit. \n\n\n\"No, no, no-\" Tommy says, eyes wide as he stares up at the green blur. \"Please, please for the love of everything- I was \n\ngood\n\n!\" Tommy wails. Dream hesitates, taking a step back, and then backs out of the room. Tommy watches silently, frozen in place where his arms guard his face, waiting for him to return. To hit him or scratch him or inject him with strange liquids with no labels, just to see how much he could take. Dream doesn't come back, instead someone else does. The new alien is yellow and brown. \n\n \n\nNone of his guards were that color. \n\n\n\"Tommy?\" The yellow alien says softly, sitting in front of him. None of the aliens called him by his name, even when he told them it. He was always 'human' to them, barked in loud, grating sounds. The only English word they knew. This isn't a guard, so it must be another prisoner. Tommy reaches out a hand, shakily. He knows it's not a good idea to stop guarding his face, but if he's been put with another prisoner then they both need comfort. The prisoner takes his hand in both of their own, much smaller than his. \n\n\n\"You're okay,\" They mutter, pressing his hand to their forehead. \"You're gonna be okay.\" \n\n \n\nTommy feels tears rolling down his cheeks as the prisoner pulls him forward and hugs him. How long has it been? In the cell, without affection of any sort. His only contact was talking to the people through the cell wall. He brings his arms up to press the prisoner closer to him, and they hum in a strange way that buzzes throughout his entire body. Tommy lets out a shaky sob, and the stranger breathes louder. Tommy instinctively matches their breathing, and slowly his mind becomes less fuzzy, and he returns to the present. \n\n \n\nPhilza is watching him worriedly from the doorway, peeking around so that most of him isnt showing. Technoblade is watching him too. Tommy can't read his facial cues, but he is staring holes into Tommy. Tubbo is wrapped around him, practically sitting in his lap, buzzing lowly in his throat, soothing Tommy inexplicably. \n\n \n\nTommy moves his hands to shove Tubbo off of him, but he cant make himself do it. Tubbo is rubbing slow circles into his back, which makes Tommy want to burst into a new round of tears. He doesn't, though, he's embarrassed himself enough. \n\n\n\"Sorry about that,\" Tommy says, trying for nonchalance. It doesn't seem to work, if the worried look that is on Tubbo's face when he pulls his head away from Tommy's shoulder is any indication. \"Don't know what that was.\"\n\n\n\"You had a panic attack,\" Tubbo says, the calm to his voice betrayed by the wild twitching of his antennae. \"A really bad one.\" \n\n\n\"Well, my bad.\" Tommy says, moving to stand. Tubbo scoots off of him, and Tommy stands, ignoring how wobbly in the knees he feels. \"Now if you don't mind, I didn't sleep too well last night. I think I'm gonna nap.\" \n\n\n\"Tommy-\" Tubbo starts, eyes wide and concerned. \n\n\n\"I'm fine.\" Tommy cuts in. \n\n\n\"\n\nTommy\n\n, you really shouldn’t be alone right now-\" \n\n\n\"It's fine,\" Tommy says with a little more desperation. Tubbo snaps his mouth shut, seemingly sensing that any more pushing may make things worse. \n\n\n\"Alright. Okay,\" Tubbo says, through the concern in his voice never leaves. \"I'll be right outside the door, okay? Just knock and I'll turn it clear for you.\" \n\n\n\"Yup,\" Tommy says. He'd agree to anything at this point if it would mean all the aliens \n\nleave him alone\n\n. He ushers them out, and the door snaps shut and turns opaque. The last thing he sees is Tubbo's pitying expression. The idea makes him seethe, but he pushes it down. He grabs the stack of blankets off the floor, climbing into his makeshift bed and pulling a few over him. He folds one and shoves it under his head. He gets a sick feeling in his stomach, regardless of how comfortable he is. \n\n \n\nHe got these because he's been \n\ngood\n\n. They've been rewarding him like a dog. \n\n \n\nHe can't bring himself to shove the blankets off of himself, though, no matter how he got them. He's finally warming up, and his stupid little freakout earlier had compltely drained him. \n\n \n\nHe heaves out a shaky sigh. \n\n \n\nMotherfuck. \n\n \n\n______________________\n\n \n\n\"What was \n\nthat\n\n?\" Phil asks, a hand to his forehead as he paces the common room frantically. Techno sits on the couch, chin in hand as he thinks, and Wilbur is watching Phil panic with a concerned expression. Tubbo stares out the window blankly, but his fluttering wings betray his upset. \"Tubbo, what did you \n\nsay\n\n to make him freak out like that?\" \n\n \n\nThere is no blame in Phil's voice, but Tubbo flinches back anyway. \n\n\n\"I-I just said he was a kid.\" Tubbo says, hushed. He doesn't take his eyes off the passing stars. \"I don't know what set him off. He looked so \n\nscared\n\n.\" Tubbo bites his lip. \n\n \n\n\"It may have been the touch,\" Technoblade says, making everyone startle slightly. He had been so silent many of them had forgotten he was there. \"I assume on the last ship he was on he didn't get much positive touching.\" Techno says with a cold scoff. \"You said humans need touch to live, Tubbo?\" \n\n \n\nTubbo nods forlornly. \n\n\n\"Then he's starving, in a way. It's like... when you don't eat for a long time, and then try to eat a big meal. It makes you sick.\" Wilbur says thoughtfully. \"And since any physical contact he's had since he's been in space was likely painful or punishing, it wouldn't be too surprising if that sent him into a panic attack.\" \n\n\n\"But me hugging him brought him out of it,\" Tubbo says, brows furrowing in thought. Wilbur shrugs. \n\n\n\"It may have just been the surprise of it, but I also can't see a hug being painful, so he may not have negative associations with hugging like he would other, less encompassing touch.\" \n\n \n\nTubbo hums in agreement, turning his face to look out the window again. \n\n\n\"It wasn't your fault, Tubbo.\" Phil says softly, putting a taloned hand on his shoulder. Tubbo sighs and leans into the touch. \n\n\n\"No, no. I should have thought about this. I should have been more careful.\" \n\n\n\"No, mate. This is new to all of us. We're still getting to know Tommy, and he's been through a hell of a lot. There are going to be triggers for things that we don't know yet, and they may be triggered accidentally. It's not gonna be any of our faults, but we need to take notice of the things that cause panic attacks and be careful to avoid it in the future.\" \n\n \n\nThe room is silent before Wilbur lets out a snort of laughter. \n\n\n\"You are such a \n\ndad\n\n.\" He says through laughter. Philza lets out a mock offended squawk, though it is cut short when Tubbo hugs him around the middle. Phil smiles and sets a hand on top of Tubbo's hair, careul to miss the antenne. \n\n\n\"You're doing good, Tubbo.\" He mutters, and the teenager hugs him tighter. \"Tommy's gonna be okay.\" \n\n \n\nIf Tubbo were less determined, yesterday's fiasco may have thrown him off. As it stands, though, it would take something far more heinous than a panic attack for Tubbo to give up on Tommy. \n\n \n\nSo he shows up the next day with breakfast. \n\n\n\"Good morning!\" He chirps, making Tommy jump from where he had been lying under his cot. He smacks his head on the underside of the cot, causing Tommy to shout and Tubbo to wince. \n\n\n\"Sorry,\" Tubbo says as he sets down the box of food. \"Did not mean to scare you.\" \n\n\n\"You didn't scare me,\" Tommy says drowsily as he rubs his head. \"Whatcha' bring?\" \n\n\n\"Uh, I don't know what they are called in Human-\"\n\n\n\"English,\" Tommy corrects. \n\n\n\"In English. It's some sort of...meat dish?\" Tubbo explains, squinting. Tommy huffs. \n\n\n\"Great, I'm starting to think they think I'm a carnivore,\" He complains, though he doesn't hesitate to start shoveling food into his mouth. \"They saw me take those gapples, they know I'm not a fuckin' wolf.\" Tubbo ignores the words he doesn't understand, knowing from experience it would take far too long for Tommy to try to explain. \n\n\n\"I think they kind of figured you are mostly carnivorous,\" Tubbo says, settling into a more comfortable position outside of Tommy's cell door. \n\n\n\"Right, cause I'm a fuckin' big scary human,\" Tommy mutters around a mouthful of food. \n\n\n\"No, because of your teeth.\" Tubbo corrects, making Tommy blink at him. \"They're pointy.\" \n\n\n\"Only in the front,\" Tommy says, pulling the corner of his mouth back and tilting his head back to show a row of flat, dull molars. Tubbo leans in to get a better look, hunger for knowledge roaring in his mind. \n\n\n\"Oh cool!\" He says in his own language. \"You \n\ndo\n\n have omnivorous teeth!\" \n\n\n\"See,\" Tommy says smugly, taking another bite of his food. \"Not a carnivore.\" \n\n\n\"If you let Wilbur take a mold of your teeth we could try to put together a better diet plan for you,\" Tubbo says idly, hoping Tommy would go for it, but getting a distinct feeling he's still too nervous to let Wilbur anywhere near him. Despite Techno being the one to knock him out, he still seemed the wariest around Wil. \n\n\n\"No, no, I'm fine with- with what I've got now.\" Tommy insists, backing up a bit, eyes going wide. Not wanting a repeat of yesterday, Tubbo lets the subject drop without further argument. \n\n\n\"Okay, you don't have to,\" Tubbo assures, and Tommy relaxes, though he still shoots Tubbo a wary expression. \n\n \n\nThe two of them lapse into a tense silence, and Tubbo decides it's high time they change the subject. He scrambles through his mind to find something to say and eventually lands on something he \n\nhad\n\n actually been meaning to bring up with Tommy. \n\n\n\"I was thinking of asking Philza to let me start hanging out in the cell instead of sitting outside of it,\" Tubbo suggests, watching Tommy's body language to see if the idea made him nervous. Tommy doesn't tense or pull back, so Tubbo pushes forward. \"We would probably have to have someone outside of the cell, just because they’re a bunch of paranoid pricks.\" Tubbo jokes, hoping that Technoblade's presence wouldn't scare Tommy out of the idea. Apparently, it doesn't, because Tommy only laughs into his hand at Tubbo's playful dig at the crew members of the Sleepy Boi’s Inc. \n\n\n\"Sure if your little bird captain will let you, I don't care,\" Tommy says flippantly, but Tubbo can see the brightness of his eyes that reads of excitement from a mile away. Tubbo stands, wings fluttering excitedly. \n\n\n\"I'll be right back!\" He says before racing down the hall to find Phil. \n\n \n\nHe nearly crashes into the captain in the hallway, where Phil had been walking to check on Tommy and Tubbo, as he often did. Phil stumbles backward, but doesn't fall, and braces Tubbo so he stays standing as well. \n\n\n\"What's the rush? Phil asks, but Tubbo can see the concern in his eyes. \n\n\n\"I wanted to know if I could be in the cell with Tommy,\"  Tubbo says quickly. Philza's mouth opens, presumably to say no, but Tubbo pushes forward. \"He's never going to get used to us if he's alone all the time.\" \n\n \n\nPhil purses his lips worriedly, but Tubbo can tell that he's at least considering it. \n\n\n\"I just... Tubbo, he's been through a lot, and he clearly doesn't trust us. If he has another attack like he did yesterday and lashed out, you could get seriously hurt.\"\n\n\n\"But I was\n\n in\n\n the cell during his attack,\" Tubbo argues, antennae twitching irritatedly. \"He didn't do anything to hurt me, even when I hugged him all he did was hug back a little tight.\" \n\n \n\nPhil's wings droop in defeat, and he lets out a long-suffering sigh. \n\n\n\"I- fine. Fine, you can go in his cell,\" Tubbo lets out a victorious trill, but Phil silences him with an outstretched hand. \"\n\nOn one condition\n\n,\" He amends, making Tubbo groan. \"Technoblade has to be in there too.\" \n\n\n\"Phil, Tommy hates Techno!\" Tubbo argues. \"Can't you be the one to watch us?\" \n\n\n\"I don't trust myself to be able to separate you two without getting hurt myself,\" Phil says, shaking his head. \"I'll talk to Techno about it and get him down here, you head back to Tommy and ask if he'd be comfortable with that, because that's the only way I'm allowing it.\" \n\n \n\nTubbo sighs defeatedly, once Phil has made up his mind like this there is no winning, and at the end of the day he\n\n is\n\n the captain of the Sleepy Bois Inc, so Tubbo \n\ntechnically\n\n has to do what he says. For now. \n\n \n\nHe walks back to Tommy's cell, wincing internally when he sees Tommy's hopeful expression through the clear door. \n\n\n\"Well?\" Tommy asks, leaning back once Tubbo is in front of him again. \n\n\n\"Phil says I can't be in there with you unless Technoblade is too,\" Tubbo says, wings sinking apologetically. \"I know you don't like him much after everything with your capture, but he's not gonna do something like that again. I mean, it's your choice, obviously.\" Tubbo snaps his mouth shut once he realizes he's rambling, but Tommy doesn't look annoyed, instead, he is staring thoughtfully at the slate-grey wall, pushing around the last of his breakfast. \n\n\n\"That's the only way you'll be allowed in the cell?\" Tommy asks, his sharp blue eyes catching Tubbo's.\n\n\n\"Yeah, sorry I tried to convince Phil but-\" \n\n\n\"Technoblade can come in,\" Tommy says with an air of false confidence, shoving the empty dish that held his breakfast to the side. \n\n\n\"Really?\" Tubbo asks, straightening in surprise. \n\n\n\"Yes, really, did I fuckin' stutter?\" Tommy asks though the playful smile twitching on his face betrays the false anger in his tone. \"He's not gonna be able to fuckin' understand what we're saying anyway, we can talk shit on him with him in the room, it'll be fuckin' great.\" \n\n \n\nTubbo laughs and pretends he doesn't see the way Tommy's hands shake minutely as he gestures wildly. \n\n \n\n_______________________\n\n \n\nTechno arrives with Phil after about ten minutes, and Tommy is on his feet the moment the piglin comes into view, a scowl plastered on his face. Tubbo can read Tommy better than he had been able to a few days ago, and he sees fear more than anger. Not that Technoblade knows that, he just fixes Tommy with a deadpan stare and punches in the code that will open the door, not breaking eye contact with the human the entire time, as if daring him to try to escape. Tommy doesn’t, though Tubbo can see the way his eyes dart to the vent longingly. \n\n \n\nTechno steps into the room with Tubbo close behind, and the door shuts behind them immediately. Phil waves at them brightly, a stark contrast to the tension that has suddenly skyrocketed in the cell, and walks off. Tubbo turns back to Tommy and Techno, who are having a stare off from opposite ends of the cell. Tubbo rushes Tommy, making Techno jump and step forward. Tommy immediately bristles but relaxes when Tubbo tackles him, not hard enough to send him to the ground, but enough to get a reaction out of Tommy and \n\nhopefully\n\n break the tension. \n\n \n\nIt works, thank the gods, because even though Technoblade just looks more and more high-strung, Tommy's attention is off of their makeshift guard, and now on Tubbo. \n\n\n\"Are you tryin' ta get me fuckin' killed dipshit!\" Tommy says, trying to pry Tubbo off of him to no avail. \"You rush me like that you're gonna get this pig fuck to think you're attackin' me, and whose side do you think he'll take?\" \n\n\n\"Oh, he's not gonna do anything.\" Tubbo drawls, unhooking his limbs from Tommy's torso. \"He's just here to make Phil less nervous. If anything I'll probably get yelled at for provoking you.\" \n\n\n\"Nah, you're one of them,\" Tommy scoffs. \"I'm a human, they're just waiting for me to fuck up.\" \n\n\n\"What are you talking about?\" Tubbo asks, frowning.\n\n\n\"Nothing,\" Tommy says, too quickly to be telling the truth. \n\n\n\"No, what do you mean 'waiting for you to fuck up'?\" \n\n\n\"Well, like-\" Tommy grumbles as tries to think of the right words. \"I'm- I know humans aren't allowed to be on ships like this. They had to sneak us, I remember that, so like, why am I here and not turned over to the space cops unless they want something from me, right?\" Tubbo opens his mouth to answer, but Tommy presses on. \"So they- I think they're just, you know. Waiting for me to fuck up and hurt somebody so they don't feel as bad about... doing whatever it is they're gonna do.\" \n\n\n\"Tommy...\" Tubbo starts slowly, his dark tone getting a concerned look from Technoblade. \"What- what are you talking about?\" \n\n\n\"Stop acting like you don't know what's going on!\" Tommy says, suddenly angry, his lip curled up to show his canine teeth. Techno shifts from where he sits against the wall and Tommy settles back down instantly, shooting him a wary look. \"No one keeps a human around for no reason,\" He mutters, eyes darting to Techno every few seconds. \"We're... we're fucked up. Alright? Humans are. We're mean and we're loud and we’re... too much. We hurt people we don't mean to hurt.\" Tommy huffs in irritation and glares at the wall. \"We're not safe to have around, alright? That's why we belong on Earth. It's mean like us. It's a good fit, but here in space where everyone is all soft... it doesn't... it doesn't work out, Tubbo.\" \n\n \n\nTommy crosses his arms and lays his head on them. \n\n\n\"No offense, but I could kill you without even trying,\" He says, shooting him a look. Tubbo swallows nervously. \n\n\n\"That's... not great,\" Tubbo says with a laugh. Tommy matches it, a sad huff of a thing. \n\n\n\"No, it's not.\" He says, looking back to the wall. \"It sucks.\" \n\n \n\nThings are silent for a moment. Then,\n\n\n\"Why am I here, Tubbo?\" Tommy says, tilting his head so he is making eye contact with the smaller boy. \n\n\n\"What do you mean?\" Tubbo asks hesitantly. \n\n\n\"Why haven't you all killed me yet?\" Tommy clarifies. \"I get like, maybe your captain would have felt bad about it, he seems like a big softie, but is keeping me in a cage for the rest of forever better?\" \n\n \n\nTubbo has no answer. \n\n\n\"I'm not an animal Tubbo,\" Tommy says, sadder than Tubbo has ever heard him. \"I'm not one.\" \n\n\n\"Tommy... what happened on that other ship?\" Tubbo asks, a dark picture being painted in his mind's eye. \"The one you brought down.\" Tommy fixes him with a haunted look and shakes his head. \n\n\n\"I don't want to talk about it.\" He says with an air of finality that Tubbo has a hard time refuting. \n\n\n\"Okay,\" Tubbo says instead. As much as he would like to know what happened to Tommy so he can figure out how to help him as best he can, pressuring him into talking about rather \n\nrecent \n\ntrauma won’t do any good if he says he's done talking. \"We can do something else then.\" \n\n \n\n______________________\n\n \n\nThey end up doing a puzzle. As it turns out, putting together different shaped objects to form a picture is surprisingly universal. Tommy complains about the landscapes and tells Tubbo about how the ones on Earth are much better. Tubbo lets him talk about his home planet as they slot the pieces into place one-by-one. \n\n\n\"-and we don't have any of this 'purple grass' bullshit- unless you're on LED or something,\" Tommy explains emphatically. \"No, no, our plants are fucking \n\ngreen\n\n. Good healthy green.\" Tubbo nods, taking mental notes of everything Tommy is saying. If he wasn't sworn to secrecy by the members of Sleepy Bois Inc then the people back at the academy would \n\nflip\n\n when he told them about all he's learned. \n\n \n\n\"What's on your planet, then?\" Tommy asks once he's seemingly exhausted all facts about Earth. \n\n\n\"Mostly plants,\" Tubbo says with a hum as he sets another piece of the puzzle in place. \"My species are pollinators, so you know, we've got a lot of flowers.\" Tommy hums from where he is lying on his stomach. \n\n\n\"That sounds nice,\" He says. \"I didn't see many flowers where I lived. I grew up in a city, but there was a garden near my- near where I lived. Sometimes I'd sneak out and go see it. It was pretty poggers. Not sure about a whole planet full of those little colorful shits, though, I'd sneeze my goddamned head off.\" \n\n\n\"Do flowers make humans sick?\" Tubbo asks, setting aside a corner piece. Tommy shakes his head. \n\n\n\"Nah, we aren't \n\nthat\n\n weak,\" He says, shooting Tubbo a glare of mock offense. \"It's the fuckin' pollen. If you have allergies it'll make you feel like total shit.\" He explains. \n\n\n\"Do you have allergies?\" Tubbo asks. He will occasionally come back from his home planet with pollen worked into his fluff for \n\nweeks\n\n afterward, and he wouldn't want to make Tommy sick. \n\n\n\"No, I'm too big of a man,\" Tommy says, pressing a hand to his chest proudly. \n\n\n\"Oh yeah?\" Tubbo asks, a mischievous smile spreading across his face that has Tommy leaning back. \"Then you wouldn't mind me doing \n\nthis\n\n!\" \n\n \n\nTubbo lunges forward, shaking out his neck fluff and releasing a small cloud of pollen. Tommy immediately descends into a sneezing fit, making Tubbo nearly cry with laughter. \n\n\n\"Fuck- fuck- yo-you!\" Tommy says in between sneezes. \"You ar-are such a- a little- sh- shit!\" Tubbo continues to lose his shit in the corner while Techno watches them both warily, ready to break up any fights that may occur. \n\n \n\nOnce Tubbo has managed to stop laughing long enough to stand up, he goes to check on Tommy, who is still sneezing. \n\n\n\"I'm sorry, I'm sorry,\" Tubbo says, though the effectiveness of his apology may be dampened by the fact that he is still fighting off giggles. \n\n\n\"A- apology not- not ac-accepted!\" Tommy says with a glare, still sneezing into the crook of his arm. \n\n\n\"That's not actually gonna make you sick, right?\" Tubbo asks, starting to get concerned with the amount of sneezing Tommy is doing. Tommy immediately clutches at his chest and falls to the ground, still sniffling. \n\n\n\"No, I'm dead.\" He says, deadpan. \"You killed me with your dumb yellow powdery shit.\" \n\n\n\"Nooo,\" Tubbo cries out, collapsing dramatically on top of Tommy, who huffs out an 'oof' when he lands. \n\n\n\"How will I carry on?\" Tubbo ponders aloud, pressing the back of his hand to his forehead. \"Knowing I've caused the death of my very best friend.\" \n\n \n\nTommy's half-hearted struggles stop underneath him, and Tubbo looks down to see if Tommy has decided to finally commit to playing dead. Instead, he sees the human looking up at him with wide, surprised eyes. \n\n\n\"I'm your best friend?\" He asks, sounding shocked. Tubbo shrinks back, suddenly self-conscious. \n\n\n\"Yeah? Or, I mean, you don't have to be-\" \n\n\n\"No, I mean, do you not already have one? You seem like you'd be the popular type.\" Tubbo clears his throat, embarrassed. \n\n\n\"Shut up, you don't know.\" He mutters. \n\n\n\"Oi! Don’t tell me to shut up, you just said I'm your best friend!\" Tommy says, his smile growing wider now. \n\n \n\nThe issuing play-fight is quickly broken up by Techno, holding them both by the scruffs of their necks at an arm's length, looking more tired than Tubbo has ever seen him. \n\n \n\nThe system that has been put in place by Philza works great. Tubbo is allowed to hang out in Tommy's cell rather than outside of it, and Technoblade sits silently in the corner, usually reading some boring old novel. Over the course of a few days, he slowly starts to warm up to Tommy, in his own way. \n\n \n\n\"Hullo,\" He says one day, apropos of nothing as he enters the cell. Tommy's gaze snaps to him immediately. \n\n\n\"What the hell,\" Tommy mutters getting to his feet. \"You learnin' English then, prick?\" He asks, tilting his head. Techno looks pained. \n\n\n\"...Hello.\" He says again, making Tubbo and Tommy both laugh. Apparently, Tubbo has been working on teaching the other aliens English as well as teaching Tommy Common, which is apparently what they called their language. Tommy hopes they are able to actually hold a conversation one day, then he could actually \n\nask\n\n to be let out of the cell instead of just snarling and snapping at anyone that came near him. \n\n \n\nSo many of the hours Tommy and Tubbo spend together become lessons in English and Common, respectively. Tubbo's pronunciation slowly gets better, and eventually, even Technoblade can hold a relatively simple conversation. He's a fast learner, but so is Tommy, and he practices his Common at every turn. \n\n\n\"Hullo, good mornin',\" Techno says sleepily as he ambles into the cell, Tubbo walking behind him cheerfully. \n\n\n\"Mornin' to you too, bitch boy,\" Tommy says, doing his very best to be irritatingly cheerful in comparison to Techno's exhaustion. The piglin shoots him an irritated look but sits down in his usual corner without retaliating. \n\n \n\nTommy and Tubbo sit down and eat together, as they usually did. Tommy refused to sit with his back to any of the aliens other than Tubbo, of course, so he sees it when Techno pulls something shiny out of his cloak. Tommy is immediately on guard, but he can’t think of anything he had done wrong. Or, at least not wrong enough to warrant an attack. He doesn’t think convincing Tubbo to pull pranks on Techno in his stead counts as a death sentence, but hey alien rules are different. \n\n \n\nTechno seems to notice his suspicious glare and snorts in amusement. \n\n\n\"It's a-,\" He says a word that Tommy can’t understand, and tosses a gapple in Tommy's direction. Tommy catches it with wide eyes, staring at him as thoguh it may explode. \n\n\n\"A gapple?\" He says, confused. Techno rolls his eyes at Tommy's made-up word, but nods. \n\n\n\"Tubbo say you eat plants and meat,\" Techno explains haltingly, word choice still limited, but Tommy can’t begrudge him for that, he's only been learning English for a few days, after all. \"You steal fruit before. Take it.\" \n\n \n\nTommy takes a bite, not breaking eye contact with Techno, as thoguh afraid Techno is going to walk over to him and take it. Techno does nothing. Tommy swallows the bite of fruit, licking his lips. \n\n\n\"...Thank you,\" Tommy says hesitantly. He isn’t usually one for manners, but... this feels less like a piece of fruit that Techno has an abundance of and more like an... olive branch, and Tommy needs all the help he can get right now. Techno nods, another gesture he had learned from Tommy and goes back to reading one of his dusty old novels. \n\n \n\nTommy finishes the gapple and then the rest of his breakfast, continuing his conversation with Tubbo, who had watched the interaction between Tommy and Techno with something like pride. Maybe. Tommy is still learning Tubbo's body language. \n\n \n\nEventually, the intercom crackles on, like it sometimes does. The voice on the other end, who Tommy \n\nthinks\n\n is Phil is speaking in Common, so Tommy can only pick up a few words like Tubbo's name, 'school', and 'worried'. Tubbo groans and gets to his feet. Tommy tilts his head, concerned that something bad is happening. \n\n\n\"I've gotta go do damage control,\" Tubbo says, but he doesn’t look afraid, so Tommy allows himself to relax slightly. \"One thing about disappearing on a 'special mission' and being sworn to secrecy is that you have to do a fuckton of lying.\" Tommy laughs and shoulders Tubbo playfully as he leaves, getting a glance from Techno to make sure they aren’t going to kill each other. \n\n\n\n\n\n___________________________\n\n \n\nThe cell is strangely quiet without Tubbo in it. Of course, Tommy is used to the silence of the cell when he's alone, but it's a bit disquieting to have this dead silence with another person in the room. There's no point in Techno leaving if Tubbo is going to be back in a few minutes, after all; but Tommy can’t help but be a bit nervous about the fact that this is his first time being alone with Technoblade. Sure, he hadn’t done anything \n\nyet\n\n, but that was when Tubbo was here and would be able to tell Phil if Techno was being an ass. Tommy wouldn’t be able to report shit, he can barely speak Common, and besides, who would their captain believe? Their head guard or some stowaway human stray.\n\n \n\nTommy gets a cold jolt in his stomach at the thought, and he feels the presence of the walls more clearly than he had since he first was thrown in the cell. He doesn’t want to be alone with Techno. He doesn’t want to be alone with anyone but Tubbo. \n\n \n\nHis breathing is speeding up, not that he can tell, he's too focused on the fact that Technoblade is \n\nlooking\n\n at him. He was probably just waiting for Tubbo to leave so he could kill him, get rid of their problem. He's the security, after all. What is security good for if not to kill pests?\n\n \n\nTommy slides his back against the wall until he is sitting on the metal floor. He doesn’t trust himself to stay standing, his breath coming in strange pants and his knees weak. Technoblade is moving now, and this only draws a terrified wheeze from Tommy's throat. Techno freezes at the noise and then sits on the ground on the other side of the cell. \n\n \n\n\"I am not going to come closer,\" Techno says gruffly, the sudden noise making Tommy press himself further into the wall. His brain is getting foggy again, it's getting harder to keep track of where he is. He can’t remember who is talking, but he doesn’t see green.  \"You are safe. You are on the Sleepy Bois Inc, and no one is going to hurt you.\" \n\n \n\nThat's... that's right. He just has to focus. He can’t slip back into the past, he needs to prove that he's not weak. That he can handle himself just fine. That he can be let out of his cell without snapping. \n\n\n\"Do you want to know how I got to be a guard?\" Techno says suddenly, making Tommy look at him with wide eyes. Tommy nods, eager to get his mind off of his terror. \n\n \n\n\"Only the strongest are let to go to space,\" Techno says, voice even and calm in a way that slows Tommy's breathing. \"You have to fight in arena. Not to death.\" Techno amends when he sees the panic return to Tommy's eyes. \"Fight until enemy gives up. Then if won you get crown and go to space.\" Techno gestures to the ornate golden crown on his head, inlaid with shimmering red jewels. \n\n\n\"So you won?\" Tommy asks hoarsely. Techno nods solemnly. \n\n\n\"I won. Left for space, got stuck on trading planet. Was there for weeks. Thought I will starve, Philza found me and offered job. I took.\" \n\n\n\"Do you like your job?\" Tommy asks, slowly uncurling from where he had been pressed against the wall. \n\n\n\"Yes,\" Techno says firmly. \"Phil is good. Wilbur is... annoying, but good.\" Tommy hums. The danger of having another freak-out has passed, but he still feels drained, and it doesn’t look like Techno is going to be moving any time soon. Tommy rests his head on his folded knees. \n\n\n\"I'm just gonna rest,\" Tommy says tiredly. \"Wake me up when Tubbo gets back.\" \n\n \n\n__________________________\n\n \n\nWhen Tommy wakes up, there is a warm body pressed against his side. His immediate reaction is to flail and shove them off of him, but then fluff brushes against his nose and he sneezes. Ah, Tubbo. Tommy opens his eyes to see the bee-creature tucked against him like Tommy is his only source of warmth, fast asleep. Techno is back in his corner occasionally glancing up from his book to check on the two of them. \n\n\n\"You were supposed to wake me up,\" Tommy says in a whisper, not wanting to wake Tubbo. Techno shrugs. \n\n\n\"You looked like you needed sleep,\" Techno says. Tommy rolls his eyes but doesn’t try to get up. He isn’t going to wake Tubbo, obviously. The boy would be a total bitch about it if he did. \n\n \n\n\"Go back to sleep, gremlin,\" Techno says, looking back down at his book. Tommy huffs incredulously. \n\n\n\"When the fuck did you learn that?\" He asks, still trying to keep his voice down. Techno taps one of his floppy ears. \n\n\n\"I listen.\" He says, and then lifts his book to cover his face, signaling that the conversation is over. Tommy sighs and settles back against Tubbo, burying his face in his neck fluff despite the sneezing fit that is sure to overtake him later. Whatever. That's post-nap Tommy's problem. For now, he is content. \n\n \n\nAs content as he can be, he supposes. \n\n \n\n_________________________\n\n \n\nPhilza's stomach sinks in dread when Technoblade messages him to come down to Tommy's cell. He moves as fast as he can without flying. Despite his best efforts, the hallways are just too narrow to accommodate his wingspan. \n\n \n\nHe spends the entire run down to the cell imagining the worst-case scenarios. Tommy had injured Tubbo, either on purpose or on accident. Tommy had managed to escape and darted back to the vents. Tommy is \n\ndead\n\n, Tommy is- \n\n \n\nTommy is asleep, curled up against Tubbo.\n\n \n\nPhilza skids to a stop in front of the cell door, feathers trying to fluff up and lay flat at the same time to show his mixture of different emotions. Techno nods his head in the direction of the sleeping pair, and Philza lets out a deep sigh, sinking low to the ground. \n\n\n\"Techno, mate, you couldn’t have told me what this was about? I thought something bad had happened.\" Philza says in a hushed voice as he opens the cell door and walks inside. Techno shrugs. \n\n\n\"Didn’t think of that,\" He says tonelessly. \"Just figured you'd wanna see.\" \n\n \n\nPhilza sits next to Techno, not wanting to be in either of their personal space if they woke up. \n\n\n\"They're gettin' along?\" Philza asks, though he doesn't need an answer with the display in front of him. \n\n\n\"Yup,\" Techno answers shortly, dog-earring his book and setting it off to the side. \n\n\n\"Humans are pack-based, yeah?\" Philza asks again. Techno shrugs. \n\n\n\"Tubbo's the one who knows all this stuff,\" He says. \"But based on the way he's acting, yeah. Definitely.\" Philza frowns, looking at the pair. \n\n\n\"I don't like leaving him alone in here, then,\" Philza says lowly. Techno looks at him with exasperation. \n\n\n\"Philza, we're not gonna keep him in here forever, but remember what he did to that other ship? We can't underestimate him.\" \n\n \n\nPhilza looks to the human, face buried in Tubbo's neck, breathing deeply. When he is asleep he doesn't carry that ever-present anger that coats his face like a mask. He looks young. \n\n\n\"He's not a fledgling, Phil.\" Techno reminds him with a roll of his eyes. Philza smacks his shoulder in retaliation. \n\n\n\"I know that,\" He huffs good-naturedly. \"But he's young. And he's scared. I want to help.\" \n\n\n\"You need to be patient.\" Techno hums. \"He needs time, more than anything right now.\" \n\n\n\"Patience is \n\nyour\n\n forte,\" Phil mumbles. Techno hums in agreement. \n\n\n\"You'll learn,\" Techno says, standing up. \n\n\n\"Where are you going?\" Philza asks. \n\n\n\"Out,\" Techno replies vaguely. \"I don't think Tommy is gonna cause any trouble, and he needs to start getting used to the rest of us if he's gonna be let out any time soon.\" \n\n \n\nPhilza scrambles to his feet, grabbing Techno's sleeve. \n\n\n\"Hold- hold on, mate!\" Philza hisses quietly, eyes darting to the sleeping boys to make sure they aren't waking up. They aren't. \"I don't think that's such a good idea.\" Techno shoots him a look, but before he can open his mouth to argue Philza carries on. \"I just mean while he's sleeping. I'm fine with staying here later, but if he wakes up and I'm here instead I won't have the vocabulary to explain. And besides,\" Philza shoots the sleeping human a sorrowful look. \"I think he's stressed enough as it is.\" \n\n \n\nTechno sighs and sits back down with a huff. Phil gets up to leave, but Techno grabs his belt and yanks him back down. \n\n\n\"Nope,\" Techno says boredly. \"If I'm stuck in here you are too.\" Philza groans quietly but doesn't argue, instead settling back so his wings are out of the way. He fiddles with his comm and occasionally tries to read over Techno's shoulder before being smacked away. \n\n \n\n_____________________\n\n \n\nIt's a few hours before Tubbo wakes up, slowly settling into wakefulness. Tommy follows soon after, though he wakes up much less slowly. \n\n\n\"Shit! When did that bird fuck get here?\" He yelps, startling Tubbo completely awake. Philza can’t understand most of what he said, but he knows 'fuck'. It's a curse, and Tubbo has taken to saying it every other word. \n\n\n\"Hello,\" Philza says, and then wracks his brain for other English words Tubbo had taught them. None come to mind, and Phil finds himself tongue-tied. The human stares back at him, waiting for him to continue. \n\n \n\nTechno says something in English, making Phil sigh. He really does need to put more effort into learning English. Tommy seems appeased, though, and is giving Phil a curious look now rather than a suspicious one. \n\n\n\"You are new guard?\" He asks in heavily accented common. Phil blinks in surprise. He hadn't known Tommy was learning Common, but he supposes it makes sense. It would be easier to teach one person a new language than teach three. \n\n\n\"Not guard,\" Phil replies, trying to speak as simply as possible so as not to confuse Tommy. \"Techno says you are safe to be around. I watch for now. Until you leave the cell.\" \n\n \n\nTommy perks up at the mention of leaving the cell, making Phil wince internally. He wishes he didn't have to lock Tommy up, but with the destruction of the other ship in plain view, they couldn't afford to underestimate him, and at the end of the day, the safety of the ship and its inhabitants falls to Phil.\n\n \n\nHe guesses he has one more person to add to that list now. \n\n\nThe next time Tubbo enters the cell, he is holding a bundle in his arms and smiling mischievously, which immediately captures Tommy's attention. Tommy rolls over onto his elbows from where he had been staring at the ceiling, a matching smile stretching across his face. \n\n\n\"Where's Techno?\" He asks, making Tubbo look sheepish. \n\n\n\"I maybe didn't exactly tell anyone I was here,\" Tubbo says, though his smile only widens. \"I came to bring you this.\" \n\n \n\nTubbo shoves the bundle of papers into his arms with a trilling laugh. Tommy looks down at it, blinking in surprise when he sees his drawings from half a month ago that he had left in the vents. \n\n\n\"Where did you get these?\" Tommy asks, setting the papers down on his cot and rifling through them to make sure they're all there. \n\n\n\"I heard you had been living in the vents for a while so I went to go check them out and found your little hidey-hole.\" \n\n\n\"Secret base,\" Tommy corrects absentmindedly. \n\n\n\"Sure, I have to go now before one of the others finds me, I'll be back later.\" \n\n \n\nTubbo bonks his forehead against Tommy's shoulder before he leaves. Whether that's from his own culture or he thinks it's a human thing Tommy doesn't know. Tubbo disappears out the cell door and it closes behind him, rematerializing with an electrical hum. Tommy turns to the stack of stolen paper and pens now sitting on his cot. \n\n \n\nWell, there are a few more things he's learned since he had been caught, he may as well update his drawings.\n\n \n\n________________\n\n \n\nTubbo shows back up with Technoblade around two hours later, he doesn't look particularly guilty, and Technoblade looks as straight-faced as always, so Tommy doesn't think Tubbo's unauthorized visit was discovered, or at the very least it had already been smoothed over. Tommy relaxes slightly. He doesn't want Tubbo to get in trouble to do something nice for him. Not that he cares. Whatever. \n\n \n\nTommy turns back to his drawing with a huff. He had started working on a sketch of Tubbo after he finished updating his files on the other aliens. Suddenly, there is a presence behind him, and there are hands on his shoulders, making everything in Tommy flare up in terror and rage.\n\n \n\n\"Is that me?\" Tubbo says joyously, but Tommy just whips around and grabs his wrists, wrenching them off his shoulders. They stand there for a moment, Tommy breathing heavily. He lets go. \n\n\n\"Don't fucking sneak up on me like that!\" Tommy says, doing his best to hide his shakiness with anger. \"You startled me! I could squish you bitch!\"\n\n \n\nEven to Tommy, it doesn't sound like a threat, it sounds like that's what he's afraid of. And it's true, isn't it? Tubbo has to treat him like he's dangerous, because he is, no matter how much confidence Tubbo has in him.\n\n \n\n\"Sorry,\" Tubbo says, and he really sounds like he means it. Tommy huffs, why in the world would Tubbo be sorry when Tommy had been the one to nearly smash him into the ground for grabbing his shoulders. \"I won't sneak up on you anymore.\" \n\n \n\nTommy blinks at him in surprise. \n\n\n\"Whatever,\" He scoffs eventually, crossing his arms. \"It's fine. I just- fight or flight, ya'know?\" \n\n \n\nTubbo seems to sense Tommy's distress because he changes the subject without another word. \n\n\n\"\n\nWere\n\n you drawing me, though?\" He asks, leaning in to see Tommy's drawing. Tommy covers it with his arms, leading to a brief wrestling match that ends when Techno pulls them apart by the backs of their shirts. \n\n \n\n\"Cut it out,\" He says gruffly before turning back to his reading. Tommy sticks his tongue out at him once his back is turned, and Tubbo mimics him, making Tommy laugh. The moment Tommy is distracted Tubbo reaches over and snatches the paper off the cot, making Tommy scramble to get it. Tubbo is faster than him, however, and darts to the corner, turning his back to Tommy so he can't grab the paper back. Tommy huffs in irritation but lets him take it. No point in trying to wrestle it back when Technoblade will break them up within a minute. \n\n \n\n\"You made this?\" Tubbo asks quietly. Tommy scoffs and crosses his arms, trying very hard not to focus on the fact that his face is steadily turning red. \n\n\n\"\n\nNo\n\n, I found it like that.\" Tommy quips, but Tubbo doesn't rise to the bait, still staring at the drawing. \n\n\n\"It's really good,\" He says, tracing the paper with one of his pointed fingers. Tommy flushes further but doesn't say anything. Tubbo looks up at him and immediately looks concerned, making Tommy take a step back. \n\n \n\n\"Are you alright?\" Tubbo asks, standing up and walking towards Tommy, making him lean back. \n\n\n\"What?\" Tommy asks, bewildered. Techno looks up at the commotion, and concern also flickers across his features before his expression is schooled back into neutrality. \n\n\n\"Are you sick?\" Techno asks, setting his book down and moving towards him as well. \n\n\n\"No, fuck off!\" Tommy groans, shoving the two of them away. \"I'm \n\nfine\n\n- why are you guys being so\n\n weird\n\n?\"\n\n\n\"Your face is all red,\" Tubbo says, reaching up to poke at his face before Tommy smacks his hand away. Tommy only flushes further at his words, hiding his face in his hands with an embarrassed shout. \n\n\n\"Shut up, it's not!\" Tommy barks, but the other two don't seem to pay attention. \n\n\n\"Are you sick?\" Technoblade asks. \"Fever?\"\n\n\n\"No, fuck off.\" \n\n\n\"Why is your face red, then?\" Tubbo asks, still trying to get in Tommy's personal space. Tommy pushes him back, but it doesn't do much good. Tubbo is a persistent little fuck, for sure. \n\n\n\"Jesus, I'm fuckin' embarrassed. Fuck.\" Tommy huffs, still covering his face. \"Do you weirdos not blush?\" \n\n \n\nTubbo looks delighted. \n\n\n\"Awww,\" He trills, making Tommy shriek with rage. \"You don't need to be embarrassed at a compliment.\" \n\n \n\nTommy buries his face in his pillow. \n\n\n\"Fuck both of you,\" He says, words muffled by the fabric. Tubbo pays no mind to his insults, instead lying on top of him, trying to ruffle his hair. Tommy immediately rolls over to try and pin him, and before long another wrestling match has broken out, before the two of them are pulled apart yet again by an exasperated Techno. \n\n \n\n_________________________\n\n \n\n\"You can't be starting fights, Tubbo,\" Phil says sternly as he plates food for dinner. Tubbo's wings twitch in exasperation. \n\n\n\"I've never gotten hurt once,\" He points out. \"He always pulls his punches, he's terrified of hurting me.\" \n\n\n\"For good reason,\" Wilbur says from the table, earning a glare from Tubbo. \"What? I'm just saying. It would be remarkably easy for him to kill you, even accidentally. His paranoia is probably saving your life.\" \n\n\n\"Just because he's pulling his punches doesn't mean it's safe,\" Phil says, setting down his spoon. \"He's probably used to roughhousing with other humans, you're a lot less durable than a human.\" \n\n\n\"Fine, fine. I won't start fights,\" Tubbo says. \"But you guys can’t treat him like a ticking time bomb forever.\" \n\n\n\"Don't underestimate him,\" Techno says quietly. \"You didn't see the wreckage of that other ship.\" \n\n\n\"He didn't do that for no reason!\" Tubbo snaps. \"They did \n\nsomething\n\n to him. He won't say what, but... he flinches constantly, he gets flashbacks. Wilbur, he's \n\nterrified\n\n of you, and you haven't even done anything to him!\" \n\n\n\"What does that have to do with anything?\" Wilbur asks, tail swishing curiously. \n\n\n\"You're a scientist,\" Tubbo responds, sitting down heavily. \"He got \n\nso\n\n scared when I told him that.\" \n\n \n\nThe kitchen is silent for a few moments. \n\n \n\n\"I don't know what to do,\" Tubbo says, putting his head down. \"He wants to go back to Earth, and I don't know how I'm gonna tell him it's impossible. He's already lost so much.\" \n\n \n\nPhil puts a hand on Tubbo's back, and the teenager leans into the touch. \n\n\n\"You're doing a great job, Tubbo,\" Phil says softly. \"He's made an incredible amount of progress since you started talking to him. None of us could have done this better than you.\" \n\n \n\nTubbo nods, but his posture still sings misery. \n\n\n\"I'm gonna bring him dinner,\" Tubbo says, standing up with two plates. \"I'll be back in an hour.\" \n\n \n\nNo one tries to stop him as he leaves.\n\n \n\n_______________________\n\n \n\nAnother week passes, and a few things change. Techno can understand most of the things Tommy says, and Phil has started hanging around more. Tommy still hasn't seen much of Wilbur, but he can't say he's disappointed about that. \n\n \n\nTubbo has started to be allowed into the cell alone, which makes a secret part of Tommy very happy. They are starting to trust him, which might mean he'll be let out soon, taken back to Earth. \n\n \n\nIf he is \n\never\n\n going back to Earth. \n\n \n\nTommy has a sinking feeling that there are no plans being made in that regard. Every time he asks Tubbo about going home, he changes the subject awkwardly. The same goes when he talks to Technoblade, and Philza just smiles pitifully and gives non-answers. Those conversations are the worst. He doesn't need pity, he needs to go home, and Philza is the \n\ncaptain\n\n. What he says goes. \n\n \n\nTubbo is hanging out in his cell as he often is, reading one of the books Philza left behind while Tommy sketches on one of his stolen pieces of paper. Tommy likes the company even when they aren't doing anything. \n\n \n\n\"Tubbo, am I ever going home?\" Tommy asks, breaking the comfortable silence. Tubbo jumps and stares at him like a deer in the headlights. \n\n\n\"I- uh-\" \n\n\n\"Please don't lie to me,\" Tommy mutters, not looking away from where is pencil is held in shaking hands. \n\n\n\"Tommy...\" Tubbo says haltingly. \"We... there are rules in place. We- we can't take you back.\" \n\n \n\nTommy doesn't say anything, but something freezing sinks into his gut.\n\n\n\"I'm sorry,\" Tubbo says. He sounds close to tears. Tommy is quiet. His view of his drawing becomes blurry as tears flood his vision. He is aware of his shoulders shaking, and a hand hovers near his back. \n\n\n\"Can I touch you?\" Tubbo asks, and Tommy shakes his head stiffly, pointing to the door. \n\n\n\"Go,\" Tommy says, but his voice holds no anger. Tubbo hesitates, but Tommy points again and the teenager walks out of the cell. The door closes behind him leaving Tommy in darkness. \n\n \n\nTommy rises on shaking legs. \n\n \n\nHe can't go home. Ever. He won't die on Earth. He won't be buried there. \n\n \n\nTommy realizes his nails are digging into his palm and lets go before he starts bleeding. He clutches onto the edge of the cot instead, but his dread turns to rage and he slams it against the wall. The wall does not shake or thud, it's too solid. Tommy's breaths are coming in harsh pants, and he tears the cot away and throws it to the side. It tips over in the middle of the room. He needs to tear everything apart. He needs to preserve what little he’s got at all costs. \n\n \n\nTommy is blinded by panic and anger. He's seeing red. Thank \n\nGod\n\n he sent Tubbo out of the room. \n\n \n\nHe can't leave, he's more trapped than he had been before, because he won't hurt Tubbo, and if he crashed the ship again there's no guarantee that Tubbo would be okay.  \n\n \n\nHe's probably going to die in this cell.\n\n \n\nThe realization tears all the air out of his lungs and he collapses to his knees in the middle of the four walls, seeming closer than ever. Around him are the destroyed remnants of the things that had been left in the cell with him, he can't remember wrecking his meager possessions, but it doesn't matter. \n\n \n\nHe looks up at the ceiling, he looks down at his hands, dotted with bleeding crescents. Four on each palm. \n\n \n\nHe screams until his voice is gone.\n\n \n\nHe falls asleep with a sore throat and grief-tinged memories of a home he is never going to see again.\n\n\nTubbo didn't come to dinner, which immediately puts Phil on guard. The teenager had spent the day with Tommy- as he often did, but hadn't come to get food for either of them. Phil hopes that he had just lost track of time or fallen asleep, but the sinking feeling in his chest spurs him to walk to the cell as fast as he can without arising suspicion from the other crewmembers. \n\n \n\nThey don't give him a second glance, too wrapped up in some meaningless argument of their own, and Philza slips out of the room, unnoticed. He holds the two plates of food, one in each hand. If nothing is wrong he can just say he was bringing dinner, he doesn't want Tommy to think he's paranoid of him. The last thing he needs is to know that his current wards dont trust him, but Phil thinks that ship may have already sailed.\n\n \n\nWhen Phil enters the hallway, his eyes are immediately drawn to Tubbo, who is sitting with his back pressed against Tommy's cell door. His head is tucked into his knees and his shoulders are shaking. Phil immediately speeds up, dropping the food he had brought and jetting to the teenager's side. \n\n\n\"What happened?\" Phil asks, a hand finding its way into Tubbo's hair, a small comfort from whatever had upset him. \n\n\n\"I told Tommy that we cant bring him back to Earth,\" Tubbo says miserably, voice muffled from where his face is buried in his knees. Phil's wings ruffle up nervously as he gives Tubbo a once-over for injuries. \n\n\n\"I take it he didn't react well?\" Phil asks, sitting next to Tubbo. The teenager shakes his head, not looking up. \n\n\n\"He sent me out of the room,\" He explains, and Phil is barely able to hold back his sigh of relief. \"But I could hear him screaming through the door. I think he was breaking things too.\" \n\n\n\"I don't blame him,\" Phil mutters, tapping a few buttons on the control panel of the door to get a read on Tommy's vitals. He's fallen asleep, but his heart rate is still way too fast. \n\n\n\"Neither do I,\" Tubbo says. He's moved to stand behind Phil and reads Tommy's stats over the Elytrian’s shoulder. \"I'd act the same way if I couldn't go back home, but I don't think I'd be able to do that much destruction.\" \n\n \n\nPhilza winces at the camera feed of the cell. What little furniture was there has been overturned. The bookshelf's contents are splayed across the floor in pieces, the blankets Tommy had been sleeping on torn and scattered. Tommy sleeps in the middle of the wreckage, curled into himself. Phil can see drying tear tracks on his face, and his hearts pang in empathy. He only barely manages to refrain from going in there and comforting the human himself. He has a feeling that would not go over very well. \n\n \n\n\"Poor guy,\" Phil sighs. \"I wish the rules weren't so strict so we could bring him home.\" \n\n\n\"They're in place for a reason,\" Tubbo says sadly. \"If we went into human airspace we would probably be shot down before we could even get Tommy on-planet.\" Philza hums in agreement, not taking his eyes off of the curled-up figure in the center of the destroyed cell. \n\n \n\n\"Did I miss dinner?\" Tubbo asks after a few seconds of silence, voice sounding a little more steady.\n\n \n\n__________________________\n\n \n\nWhen Phil and Tubbo arrive back at the dining hall, Wilbur and Techno are still arguing, though they seem to have moved on to a completely different topic now. Neither of them look up at the two of them when they take their seats and are only silenced when Tubbo speaks. \n\n\n\"I think it's time that Tommy gets let out of the cell.\" He says firmly, not breaking eye contact with Phil. Damn Tommy, teaching him how to display dominance. \n\n \n\nPhil is... hesitant, and based on the faces that Techno and Wilbur are making, they are too. Tubbo pushes on, unperturbed by the cold reception to his words. \n\n\n\"He can’t go back to Earth, he knows that now.\" Tubbo points out. \"We can’t leave him in a cell for the rest of his life, he'll die. I asked.\" Phil winces at the idea of Tommy dying in the cell. \"Humans need space and sunlight and- and they cant be locked up forever!\" \n\n\n\"The other ship-\" Techno starts, but Tubbo pounds his fist on the table, startling all of them. \n\n\n\"The other ship was full of fucking \n\npoachers\n\n!\" He yells. \"They were stealing humans! Tommy was the last one on that ship, I read the files. They killed \n\neveryone\n\n else.\" \n\n \n\nThe table falls silent. \n\n \n\n\"Tell- tell me you wouldn't have done the same thing,\" Tubbo says firmly. \"He didn't do that because he's human, or because he’s some monster that can’t control himself, he did that because he's a \n\nperson\n\n. He wanted to live as much as anyone else.\" \n\n \n\n\"Tubbo... just- just give him a few more days. Until he's comfortable.\" Phil says, tail feathers rattling quietly. \n\n\n\"You keep \n\nsaying\n\n that!\" Tubbo barks, anger not quelled. \"How many \n\n'few more days\n\n’ is it gonna be, Phil?\"\n\n\n\"Tubbo-\" Wilbur tries to interject, standing up, but Tubbo only turns his attention towards him instead, pointing a finger, another gesture he'd learned from Tommy. \n\n\n\"No! \n\nYou\n\n never visit him either! You just take notes through the door, don't think I don't hear you!\" \n\n\n\"He doesn't want to see me, you said it yourself!\" Wilbur defends. \n\n\n\"Because you only show up to \n\ntake notes on him\n\n!\" Tubbo shouts. \"He doesn’t want to be treated like an \n\nanimal\n\n, Wil! You need to treat him like a person, put some \n\nreal\n\n effort into learning English.\"\n\n\n\"He's already learning Common, why would I need to learn his language?\" \n\n\n\"\n\nSo he feels like you give a shit\n\n!\" \n\n \n\nTubbo doesn't realize how much he's bristling until Phil pulls the two of them away from each other by their shirts. \n\n\n\"Boys,\" He barks in his most authoritative voice. \"That's \n\nenough\n\n! Tubbo is right, Wil, you need to interact with him. He's going to be let out of the cell eventually, and I don't want your first real meeting being in the hallway.\"\n\n \n\nWil huffs, but doesn't argue. \n\n\n\"I'm not going today,\" He says. Tubbo sighs in irritation, picking up Tommy's plate. \n\n\n\"Normally I'd yell at you for being a pussy, but I don't think he's in the best headspace right now,\" Tubbo says as he walks to the door. Phil opens his mouth to argue against Tubbo visiting him while he's upset, but Tubbo whips his head around and fixes the captain with such a harsh glare that Phil's mouth snaps shut with a click. \n\n \n\n______________________\n\n \n\nTubbo knocks on the door and waits for a response. There is a sniffle, and then a quiet: \"Tubbo?\", that makes the teenager's heart clench painfully. \n\n\n\"Yeah, it's me,\" Tubbo says quietly. \"I brought dinner, do you want me to leave it for you or can I come in?\" \n\n\n\"You can come in,\" Tommy says after a pause. He sounds tired, but that isn't surprising to Tubbo in the slightest. Honestly, he's pretty shocked Tommy is even awake after how much his meltdown seemed to take out of him. \n\n \n\nTubbo waves the door away and steps inside the room, wincing at the destruction. His sensitive sense of smell picks up blood, heavy and salty on the air. It smells different from the other kinds of blood he's known, it is unmistakably human. Tubbo nearly drops the plate but manages to set it down on the floor before flitting over and giving Tommy a frantic once-over. \n\n\n\"I smell blood, are you hurt?\" Tubbo asks, brushing a small hand over Tommy's face to check for any obvious injury. Tommy brushes his hand away. \n\n\n\"I'm alright, my nails dug into my palm. It'll heal.\" He says, and Tubbo backs off a little, only because of the bone-tiredness in Tommy's voice. \n\n \n\n\"You look pissed, what happened?\" Tommy says, lying back down on the floor. Tubbo ignores his blatant subject change to get one of Tommy's torn pillows and tuck it under his friend's head so he won't get a stiff neck when he gets up. \n\n\n\"Nothing,\" Tubbo sighs. \"The others are just being stupid.\" Tommy opens an eye, suddenly looking serious. \n\n\n\"What did they do?\" He asks angrily, sitting up. Tubbo laughs and pushes Tommy back down onto the pillow. \n\n\n\"Are all humans this protective?\" Tubbo teases. \n\n\n\"No, I'm just super awesome and a good friend,\" Tommy says from where he lies. Tubbo lies next to him, his head on the metal floor. Tommy huffs in irritation and scoots over a bit so Tubbo can lay his head on the pillow. He does. \n\n\n\"I've been trying to get the others to let you out of the cell,\" Tubbo admits. \"They're being stubborn, but I think I'm wearing them down.\" \n\n \n\nTommy is silent, so Tubbo turns to look at the human, who is staring at him, wide-eyed. \n\n\n\"Really?\" Tommy asks. \"You've been trying to get them to let me out?\" \n\n\n\"Well yeah,\" Tubbo says, confused. \"I've basically been trying to convince them since we met. You're not dangerous, Tommy.\"\n\n \n\nTommy turns his gaze back up to the ceiling, not responding. \n\n \n\n\"Would you be open to talking to Wilbur?\" Tubbo asks once he sees that Tommy is not going to continue this line of conversation. Tommy's jaw clenches nervously, and the human gives him a wary look. \n\n\n\"I'd be here the whole time, and whoever you wanted to be could be too.\" Tubbo amends hurriedly. \"But you're not gonna stay in this cage forever, and he's part of the crew, you're gonna have to meet him eventually.\" \n\n \n\nTommy's mouth twists in a way that tells Tubbo he's chewing on the inside of his mouth, a habit he seemed to have when he was thinking or nervous. Tubbo resists the urge to stop him. He'd nearly had a heart attack the first time Tommy had spit blood. \n\n \n\n\"Yeah, whatever,\" Tommy says, forcefully casual. \"He can’t touch me though, I'll start biting for real this time. And- and I don't want him to do any science shit. If he does he has to leave.\" \n\n \n\nTubbo nods. \n\n\n\"Do you want me to be there?\" Tubbo asks, leaning towards Tommy so their shoulders are pressing together. Tommy doesn't move away. \n\n\n\"Yeah,\" Tommy says quietly, voice still hoarse. Tubbo doesn't need to ask why, he'd heard the screaming through the walls. The high-tech soundproofing of the SBI could only do so much. \n\n\n\"Tomorrow?\" Tubbo asks. Tommy nods, not moving from where he is pressed against Tubbo. \n\n \n\nThey sit like that for a while, silently slotted against each other. Tommy's breathing slows after a while, and once he is sure the human is asleep, Tubbo stands up to leave. \n\n \n\nHe doesn't get far, Tommy's hand snaps around his wrist, a bit too rough at first, but when Tubbo makes a slightly pained noise his grip loosens significantly. \n\n\n\"Tommy?\" Tubbo asks, not pulling his wrist from the human's hold, even though he easily could with how loose Tommy's grip is. \n\n\n\"Don’t go,\" Tommy mutters, still mostly asleep. Tubbo stares at him for a moment before sitting back down at his side. \n\n\n\"Alright,\" Tubbo says. \"I'll stay with you.\" \n\n \n\nTommy relaxes immediately, going completely boneless against Tubbo, pushing him to the floor under his weight. Tubbo laughs, shuffling a bit so his breathing isn't hindered by the pressure. \n\n\n\"Hold on, hold on, I'm not sleeping on the floor,\" Tubbo says, and Tommy groans against his shoulder. \n\n\n\"No...\" He grumbles. Tubbo shoves at him gently. \n\n\n\"I forgot how clingy you get when you're tired,\" Tubbo says, a small smile quirking up the corners of his mouth. \n\n\n\"Fuck off,\" \n\n\n\"Up,\" Tubbo orders, shoving at his friend's shoulder. Tommy obeys. \n\n \n\nTubbo gets to work setting up a place to sleep among the destroyed remnants of Tommy’s cell while Tommy dozes in the corner. It mostly consists of pillows and blankets piled up on top of each other, but Tubbo tucks himself into it and shuffles slightly, making sure his wings won’t be pressed against the fabric uncomfortably. \n\n \n\nTommy seems to be completely asleep in the corner, snoring quietly. Tubbo smiles at how unthreatening humans are when they're sleepy, but the smile slips off of his face when he remembers \n\nwhy\n\n Tommy is so tired. \n\n\n\"Tommy,\" Tubbo calls, and the human’s head shoots up, though his eyes are still bleary. Tommy stands and stumbles over to the blanket pile Tubbo had made before collapsing on top of it, and by extension on top of Tubbo. \n\n \n\nTubbo wheezes when the full force of Tommy's weight presses down on him, tapping his shoulder frantically. \n\n\n\"Up, up! Cant breathe!\" Tubbo huffs. Tommy rolls off of him immediately, exhaustion in his gaze replaced by concern. Tubbo gives him a thumbs up, a gesture he'd picked up from Tommmy pretty early on in their friendship. \n\n\n\"Sorry,\" Tommy mutters. Before Tubbo can tell him not to worry about it, Tommy is wrapping his arms around Tubbo and tucking his face into his shoulder. \n\n \n\nTubbo has a vague memory of hearing a rumor that humans were cuddly, but he had dismissed it at the time, what with their reputation as cold-hearted killers. Tommy snores into his collarbone, and Tubbo thinks that rumor may have had some basis in fact after all. \n\n \n\n___________________\n\n \n\nTubbo is too high-strung to sleep, even with the warm weight of Tommy's arm crossed over his chest bringing him comfort. Tommy's heartbroken screaming is still ringing in his ears, intercut with sobs that wrench at his heart. \n\n \n\nTubbo cards his fingers through Tommy's hair, making the human mumble something in his sleep and press closer to Tubbo. The teenager smiles at that. Tubbo can’t even imagine the pain that Tommy is going through, but he can be here for Tommy while he shoulders it. The idea of not ever going back to his home planet leaves him with a sick feeling in his stomach, and to think that Tommy had never been given a choice to leave home at all nearly brings tears to his eyes. \n\n \n\nHe doesn't cry, though, he just keeps running his fingers through Tommy's hair, frowning at the greasy feeling it leaves behind on his hand. He winces at the realization that they hadn't exactly left Tommy anything to keep clean with. Just another reason to get him out of this cell as quickly a possible. \n\n \n\nTubbo lays like that for a while, combing out the knots in Tommy's hair with the hand not being held down by Tommy's relentless clinginess. He snorts in laughter at the thought. If the human could hear that he'd be shouting up a storm right now. \n\n \n\nThree knocks sound on the door, making Tubbo frown. \n\n\n\"Come in,\" He says as loudly as he dares to without waking Tommy up. The door turns clear, revealing Phil standing nervously on the other side. His eyes widen when he sees the two of them, and a soft smile appears on his face. \n\n\n\"Well, I came to see if everything was alright, but I guess I worried for nothing,\" Phil whispers. \n\n\n\"You're good at that,\" Tubbo teases quietly. Phil's eyes dart down to Tommy's sleeping form and his eyes turn sad. \n\n\n\"How's he doing?\" \n\n\n\"Not good,\" Tubbo says with a sigh. \"He was upset, obviously, and I don't think being held in a cell is helping him,\" Tubbo says with a pointed look. Phil sighs and runs a hand through his featherlike hair. \n\n\n\"I know,\" Phil says. \"I meant what I said at dinner, Tubbo, he's not going to be in there for much longer.\" \n\n\n\"Sure,\" Tubbo scoffs, turning back to a particularly troublesome knot on his friend's neglected hair. \n\n\n\"Tubbo,\" Phil says firmly, making Tubbo look at him again. \"You have my word as your captain. He is under my protection as a member of this crew, and I will do everything I can to help him. He will leave soon, alright? I want to set up his room tomorrow, and I want your help, you know him better than I do.\" \n\n \n\nTubbo smiles at Phil. \n\n\n\"You're a good captain, Philza Minecraft,\" Tubbo says. Phil's determined expression melts into fondness. \n\n\n\"So will you help with his room?\" \n\n\n\"Not tomorrow,\" Tubbo says, shushing Tommy quietly when he mumbles something in his sleep. \"He said he would speak to Wilbur tomorrow and he wants me to be there.\" \n\n \n\nPhil relaxes further. \n\n\n\"Good, good,\" He sighs. \"I was worried he wouldn't want to speak to him. Which- you know, he has that right, but it would be hard to live on a ship with someone you avoid like the plague.\" \n\n \n\nTubbo hums in agreement, sticking his tongue out as he tries to untangle another knot. \n\n\n\"Why... why is Tommy so scared of Wilbur anyway?\" Phil asks hesitantly. Tubbo pauses in his ministrations. \n\n\n\"I... well I have some ideas as to why, but nothing set in stone. It's just guesswork mostly.\" Tubbo says. Phil waits for him to continue. Tubbo does. \n\n \n\n\"I think... well, I think whatever happened on that other ship, a lot of it was... experiments? He gets really freaked out whenever I talk about my science classes, and he nearly started climbing the walls when I said Wilbur was the ship's scientist.\" \n\n\n\"Shit,\" Phil says, sinking to the floor and sitting cross-legged. \"I'll have to tell Wilbur not to do any freaky science shit when he visits Tommy.\" \n\n \n\nTubbo nods in agreement. \n\n \n\n\"Do you want me to let you out of there?\" Phil asks, one of his talons hovering over the button that would take down the door. Tubbo shakes his head. \n\n\n\"No, I don't want him to be alone, and I think humans are pack-sleepers anyway. He seems much more comfortable than usual.\" \n\n \n\nPhil smiles. \n\n\n\"Alright, call me if you need me.\" He says before walking down the hall. The door turns opaque and the room is shrouded in darkness once again. Tubbo sighs, running his fingers through Tommys mostly untangled hair once again. \n\n \n\n\"What happened to you?\" Tubbo mutters. Tommy doesn't answer beyond snuffling slightly in his sleep. Tubbo sighs and leans further into the human's touch. \n\n \n\nIt takes a while, what with the stress of the day, but the combination of Tommy's body heat and his slow, steady heartbeat eventually manages to lull Tubbo to sleep, a constant reminder that despite the hell his friend has been through, he's still here. \n\n\n\n\n\n\nTommy wakes with anxiety swirling in his gut, though it takes him a few minutes of sleepy pondering to figure out why he's feeling sick with worry. \n\n \n\n'Oh right,' He thinks, eyes still closed. 'Wilbur's visiting today.'\n\n \n\nTubbo shuffles in his sleep, and Tommy tries to shove down the embarrassment that crawls up his throat when he remembers basically strongarming the alien into \n\ncuddling\n\n. He was tired, alright? And he hadn't had any nightmares for the first time since he got on this stupid ship, so that was a plus. \n\n\n\"Wake up bitch,\" Tommy says, poking at one of Tubbo's antennae. He pokes more gently than he usually would, not knowing exactly \n\nhow\n\n sensitive they are. He doesn’t want to \n\nactually\n\n hurt Tubbo. His plan works, and Tubbo snaps awake with a snort before immediately trying to hide his face under the pillow with a groan. \n\n\n\"Fuck off...\" Tubbo groans, voice muffled by the pillow. \n\n\n\"There's shit to get done today,\" Tommy argues, pulling the pillow off of his friend. Tubbo turns away from him, hiding his eyes from the light.\n\n\n\"Turn the lights off,\" Tubbo mutters. \n\n\n\"I fucking can't, everything’s automated.\n\n\n\"Shit,\" \n\n \n\nAs it turns out, Tubbo is not a morning person in the slightest. It takes nearly half an hour for Tommy to pester him into even sitting up. \n\n\n\"When do you want to see Wilbur?\" Tubbo asks, eyes still drooping with tiredness even as he pulls his thick coat back on. \n\n\n\"Whenever,\" Tommy says, stretching. \"If you ask me to pick I'll pussy out or some shit, fuck that.\" \n\n\n\"Fine, I'll go get him in like an hour. He's a late sleeper.\" Tubbo says. Tommy tries to breathe through the sweeping fear that rushes through his entire body. \n\n\n\"Cool,\" Tommy says like his mind isn't full of warning sirens. \n\n\n\"Are you sure you're okay with this?\" Tubbo asks, leaning forward to get a better look at Tommy's face. \"You're face is going all white.\" |\n\n \n\nTommy covers his face and fixes Tubbo with a glare. \n\n\n\"It's whatever,\" Tommy insists. Tubbo gives him a look and Tommy throws his hands in the air exasperatedly. \"Alright! I'm fuckin' nervous, okay? Sue me, but if I don't talk to him now I never will.\" \n\n\n\"If you say so,\" Tubbo says, clearly still brushing off the last cobwebs of sleepiness. \"I'm gonna go get breakfast, what do you want?\" \n\n\n\"Do you have those little bread-and-jam things?\" \n\n\n\"Yeah, I'll grab some while I'm out.\" \n\n \n\nAnd with that Tommy is alone in his cell again, with his mind left to wander. More accurately, his mind is left to spiral. He wants to ignore the sick terror that rises up his throat, but it's hard. He knows he \n\nhas\n\n to talk to Wilbur, and that Tubbo would be there the entire time, but- but what if Tubbo tries to get in the way and gets hurt. \n\n \n\nWhat if Wilbur decides to take... things from him. Blood or skin- in some of the worse cases \n\nbone\n\n samples. Tommy still has a shiny pink scar on his bicep from \n\nthat\n\n event. He's a scientist, and Tommy would be lying if he said that he's had any good experiences with scientists. \n\n \n\nOne thing is for sure, though, if Wilbur tries to take anything at all, even benign shit like hair, Tommy is fighting back. It was honestly kind of stupid of the aliens to provide him with this much food and water- he's much stronger than he had been when they first captured him, and even with Wilbur's claws and teeth, Tommy would be able to take him in a fight. Sure, he may be killed for injuring a crew member, but he would rather die than lay down and let them take any more from him. \n\n \n\nTommy shakes his head, clenching and unclenching his hands. No. No, the crew on the Sleppy Bois Inc arent like that. At all. They haven't even brushed his \n\nhair\n\n without his explicit consent. \n\n \n\n_____________________\n\n \n\nWhen Tommy is alone, grief always manages to slip into the gaps. Where there were people once there is an ache in his chest, growing into the cracks like an invasive plant. Now is no exception. He has no window, so he lays on the floor and lets his eyes blur. He tries to see trees and water and grass, but it's hard. \n\n \n\nHe misses Earth, more than anything else. He misses the way sweetgrass smelled, and he misses wrestling with someone without being afraid of \n\nreally\n\n hurting them, and he misses climbing trees and sleeping in a real bed. \n\n \n\n'I'm lucky, really.' He tells himself, but his fingers twist together anxiously anyway. 'I didn't leave anyone behind, at least.' \n\n \n\nIt could be worse, really. He grew up in a group home, and it was fine, but it's not like he really has anything to go back to. He didn't even have a dog. \n\n \n\nHe still misses things he thought he'd never miss. Mowing lawns and swimming, anything and everything. He can't do any of that here, not even whatever cheap replacements that would be available in space are offered to him. \n\n \n\nThere is a knock on his door and his eyes fly open. Tommy pats his cheeks to make sure they are free of traitorous tears. They are, luckily. \n\n\n\"Tubbo?\" He asks. Tubbo is the only one that visits consistently, after all. \n\n\n\"Uh, yes!\" Tubbo says, and then Tommy hears someone clearing their throat and his heart drops into his stomach. Right, Wilbur. He had almost forgotten about that in his stupid, self-pitying monologue. \n\n\n\"I'm here too- uh, Wilbur. I am him.\" Wilbur says haltingly, his English almost laughably bad. \n\n\n\"Okay,\" Tommy says past the lump in his throat. \n\n\n\"Can I open the door?\" Tubbo says. Stupid Tubbo always asking for permission to do things. Sure, it's nice but it's \n\ncertainly\n\n not what Tommy is used to. Even on Earth, he was rarely given a choice, and then in space, it was \n\nso\n\n much worse. Being on the Sleepy Bois Inc is something of a culture shock in a lot of ways. \n\n\n\"Turn it clear first,\" Tommy says, hoping against hope that his voice isn't trembling right now. He can't afford to show any weakness.  \n\n \n\nThe door shimmers for a moment before going transparent, revealing Tubbo and Wilbur, the latter standing a few feet away from the door tensely. Tommy shoves down the pit of shame in his gut that always appears when someone is afraid of him. This is good, in this case. If he's afraid of Tommy then he is \n\nmuch\n\n less likely to try anything nefarious. \n\n \n\nTubbo moves to the side and shoves Wilbur forward, causing the older alien to glare at Tubbo before turning to Tommy. \n\n\n\"Hello,\" Wilbur says after a brief hesitation. \n\n\n\"Hello,\" Tommy parrots, trying to remember to keep his wording simple enough for Wilbur to understand. There are a few seconds of silence where neither can think of anything to say, and they both become tenser and tenser as time passes. \n\n \n\nTubbo ends up being the one to break the silence, elbowing Wilbur in the side and whispering something in Common to him. Tommy is still learning and can barely hear him, so he doesn't manage to catch any of it, but Wilbur perks up, looking relieved. \n\n\n\"Oh! You take paper!\" Wilbur says, and Tommy tenses further. He should have known that would come back to bite him in the ass. \n\n\n\"No! Not mad!\" Wilbur says quickly, making Tommy look up at him warily. \"Think it... cool? Good? Tubbo say you note-take. About us.\" \n\n\n\"I... do. You want your shit back?\" \n\n \n\nWilbur stares at him blankly and Tubbo translates it. Wilbur makes a small noise of understanding and shakes his head jerkily, clearly, Tubbo had explained human body language to him before he showed up. \n\n\n\"No, you keep. I bring more, later?\" \n\n\n\"That would be good,\" Tommy says though he keeps his eyes down. \n\n\n\"I come in?\" Wilbur asks, and Tommy is on his feet in an instant, making Wilbur step back, though Tubbo stands his ground. \n\n\n\"No! No, don't!\" Tommy says quickly. Wilbur steps back, tail lashing in what Tommy assumes is anxiety. \n\n\n\"Ok, ok, no come in,\" Wilbur says lowly, clearly trying to be soothing. Tommy doesn't sit back down, but he doesn't do anything else either. He is willing to be friendly, and it seems that Wilbur isn't going to do anything without his permission, at least not with Tubbo here. \n\n \n\n\"Did not mean to scare,\" \n\n\n\"Didn’t scare me,\" Tommy says gruffly, crossing his arms. He is choosing to ignore the exasperated look Tubbo throws his way. \"Just surprised.\" \n\n \n\nThey lapse into an awkward silence once again until Wilbur clears his throat and finally speaks up. \n\n\n\"See your drawings?\" He asks, and Tommy purses his lips as he considers the question. This could easily be a ploy to see how...humans take notes, just another experiment!\n\n \n\nYeah, it sounds flimsy even to him. \n\n \n\n\"Fine,\" Tommy sighs, and turns to get the small sheath of papers from under his bed. He isn't going to give them to the alien, he's worked too hard on them to lose them without good reason, so he shoves them against the clear plane of the door. \n\n \n\nHe holds the papers there for a while, resolutely ignoring the way his face turns red when he hears the small, awed noises that Wilbur makes when he switches the page. \n\n\n\"You are good at drawing,\" Wilbur says, finally tearing his eyes away from the papers. Tommy is sure he is bright red, but he's pretty sure Tubbo is the only one who knows what that means, based on the shit-eating grin he's throwing Tommy's way. \"Are all humans good at it?\" \n\n \n\nTommy winces internally, it's an innocent enough question, but that's how it always started. First, it was 'what are humans good at?' and by the end of the hour, he'd be asking him where the arteries are. Wilbur seems to have noticed his blunder, at least and is smiling a bit nervously. Tommy's eyes catch on his wickedly sharp teeth and the alien snaps his mouth shut, averting his large, owl-like eyes. \n\n \n\nTommy feels a pang of... familiarity in his actions. How many times has he hidden parts of himself that felt so natural on Earth? The number is far too high to count. Despite Wilbur's species (he's gonna have to ask for its name) not having as harsh of a reputation across space, he still had to work to be seen as non-threatening. \n\n \n\n\"Don't hide your teeth,\" Tommy says. \"You have them, they're not goin' away.\" \n\n\n\"You look scared,\" Wilbur counters, his mouth still behind his hand. Not that it does much good with his claws. Tommy decides not to point that out. \n\n\n\"I'm not scared, dipshit, I have sharp teeth too. Not as sharp, but look.\" \n\n \n\nTommy sticks a finger behind his cheek and pulls back, revealing the rows of enamel protrusions, slightly discolored. It's not like he's had a dental hygenist following him around while he galivanted around space, okay?\n\n \n\nWilbur leans in, tilting his head in interest. \n\n\n\"Oh hey, you do have sharp teeth,\" Wilbur mutters in common, barely loud enough for Tommy to hear it. His hand is away from his mouth, though so Tommy counts that as a win. \"You eat plant and meats, right?\" \n\n\n\"I'm an omnivore, yeah,\" Tommy responds after biting down a few times to get rid of the feeling of his mouth being stretched open. \n\n\n\"Tubbo said that,\" Wilbur says. \n\n \n\nTommy can tell he's starting to get frustrated with the limited word choice, so Tommy decides to throw him a bone. \n\n\n\"You can speak in common if you need to,\" Tommy says in Common, making Wilbur blink at him in surprise. \"I've been learning it longer than you learning English.\" \n\n\n\"You little brat, you could speak Common the whole time?\" Wilbur says with a growl, though Tommy can see his mouth tilting up at the corners, an expression so human it makes his heart hurt. Tommy laughs, partially to dispel the ache in his chest. \n\n\n\"Maybe I wanted to see you flounder, bitch boy!\" Tommy says, mixing in a few English swears for color. \n\n\n\"You're lucky this door is here bitch!\" Wilbur says picking up the cussing quickly, to Tommy's delight. \"I'd wipe the floor with your scrawny ass!\" \n\n \n\nTubbo gives him a somewhat panicked warning look at his threat, but Tommy feels a lightness in his chest that he hasn't felt for a long time. Wilbur... isn't scared of him. He's joking around and making threats. Sure Tubbo did much of the same but he was always \n\ncareful\n\n around Tommy. Of course, Tommy didn't blame him for this, he would be too if he was in Tubbo's situation, but still- it's nice to just be treated like a rowdy neighbor kid again. \n\n \n\n\"Yeah, bitch? Even with those claws, I'll rip you a new one!\" Tommy says with a broad, mischievous smile, instinctively lowering into a fighting stance despite the door blocking him from Wilbur. It's not like he would \n\nactually\n\n fight him anyway, just bat him around a little bit, that's all. \n\n \n\n__________________\n\n \n\nAll things considered, the visit with Wilbur goes... incredibly well. He's charming and funny and it's easy to forget his connections to the last ship. Every day those reminders disappear like dew in the sun. \n\n \n\nWilbur comes to visit every day now. It's been two days since they first met, Tommy has been getting better at tracking the time in space. Tubbo had gone to take a nap because \n\napparently,\n\n his species needed more sleep than humans. Wilbur is holding a black case, which immediately sets Tommy on edge. Wilbur smiles at him and sits down on the other side of the door, which smoothes over some of the rough edges of Tommy's nervousness. If he isn't coming into the cell then Tommy is still relatively safe. \n\n \n\nWilbur opens the case, and it is not filled with sharp tools like Tommy had feared, but instead a smooth slope of wood. Tommy tilts his head curiously and moves a bit closer to the door to better see the object. \n\n \n\nWilbur pulls the thing out of its case and sets it on his lap. It sort of looks like a misshapen guitar. \n\n\n\"What's that?\" Tommy asks. Wilbur smiles at him, excitement pooling in his huge eyes. \n\n\n\"Instrument from my home planet,\" He says in English. Tommy appreciates the effort. \"Not too good at talking English yet, music no talking, just... it just is.\" \n\n \n\nTommy settles back to listen, and Wilbur's smile widens a tiny bit. \n\n \n\nWilbur plays the instrument, which sounds suspiciously like a guitar, but Tommy supposes there are only so many ways for instruments to sound, so he dismisses the strangeness of it. Wilbur's songs are sad, brimming with longing and grief, but there is hope there too. Tommy hears it in the notes Wilbur plucks out. He feels it too, softening something in his chest that he had thought was long dead.\n\n \n\nTommy doesn't know he had fallen asleep until he wakes up and Wilbur is gone. In his place, there is a plate of food and a stack of paper and pens. \n\n \n\nTommy takes to art like a fish to water, or, more accurately, like a human to creation. The moments when he was not in the company of the other crew members was once something to dread with everything he had, but now he sort of...looks forward to it. It gives him a moment to relax, to not worry about whether or not he looks too intimidating. To just draw. Pictures of people he had met back on Earth, flowers, butterflies, sappy shit that he hides under his mattress. He misses Earth dearly, and he's terrified of forgetting even tiny things about it. \n\n \n\nSo he draws what he remembers, and really, the drawings aren't that great. They're a bit clumsy and heavy-handed, but he can't hold that against himself. It's not like he had a ton of time to practice while being held prisoner. \n\n \n\nDespite his drawings being rather unimpressive, both Tubbo and Wilbur regard them with a quiet sort of reverence. Tommy kind of wonders if their species can draw at all, based on the way they're acting about a simple doodle. \n\n \n\nWhen he asks about it, it turns out that, yes, both Tubbo and Wilbur's species \n\nare\n\n able to draw. The two were just fascinated to see scenes from Earth from more than just Tommy's limited vocabulary in Common. Tommy tries not to let them see the blood that rushes to his face when they compliment his art. Judging by Tubbo's amused giggling, it's unsuccessful. \n\n \n\n___________________\n\n \n\nThings feel…\n\n good\n\n. For the first time in a long time, Tommy actually feels \n\nsafe\n\n. He's on good terms with all of the members of the ship, they all seem to trust him to some extent. As long as he doesn't get too far in his own head he's fine. So he throws himself into making things to keep his hands busy and his mind blank. Once he gets bored of drawing he asks Phil for yarn and tries to finger-knit. It's not like he couldn't use a scarf while he lives amongst the cool metal of the cell. \n\n \n\nBoredom still stalks him at every turn, though, no amount of occupying his hands with meaningless tasks will keep him distracted very long. He wants to \n\nrun\n\n. Now away, but he wants to move, to go fast! He snorts humorlessly at the irony. This ship is probably going faster than he can even conceptualize, but it's not like he can feel it in this stupid metal box. \n\n \n\nSo when Tommy has exhausted all his benign crafts and Tubbo is \n\nstill \n\nnot going to be visiting for another hour, he takes to another hobby of his. \n\n \n\nTrying to get the cell door open. \n\n \n\nHe doesn't really think he's going to be able to do it, it's mainly just a force of habit by now. Living like this, Tommy has grown to appreciate the stability that a ritual brings. \n\n \n\nSo Tommy lays on his stomach and tries to stick his fingers through the strange, force-field-like door to no avail, as had happened every time before. Tommy sighs and rolls onto his back, staring up at the shimmering, transparent door as though the force of his glaring will make it open. It doesn't, it just stays there, being a door. \n\n \n\nTommy sighs and bonks his head against the force-field. It doesn't go through. He bonks again. It's softer than the walls, at least, and it feels kinda cool. Like TV static on his skin. He bonks again, not hard enough to hurt him, but enough to make Tubbo yell at him if he was caught. He bonks again. \n\n \n\nHis head meets the cool air of the hallway. \n\n \n\nTommy's eyes snap open and he scrambles back on instinct, staring at the door. Or, the doorway, now. Because the door is gone. \n\n \n\n\nThe door is gone! \n\n\n \n\nTommy stares at the door for a moment, mouth gaping like a fish. \n\n\n\"Oh,\" He says dumbly. \"Oh shit.\" \n\n \n\nTommy rushes forward, eager to leave the cell he's been trapped in for the better part of a month, but stops short just before passing the threshold. What... What exactly is his plan? \n\n \n\nHe can't go back to Earth, even if he's the one driving the ship, he'll be shot down. And that's assuming that Tommy would even be able to figure out the controls of an alien vessel, all written in a language that Tommy can't read. As much as Tommy values confidence, he knows he won't be able to do that. Crashing the ship on a planet and ditching is just plain stupid at this point. He'd just end up back at square one. \n\n \n\nEven if he did get back to Earth, he'd probably be taken away and interrogated by the government, anyway. And it's not like... it's not like he had anyone on Earth who missed him. The only people he truly felt a connection to was the man in the cell next to his, and he's long gone by now. He just...didn't come back after testing one day. Tommy doesn't need to ask what happened. That had been the final straw for him, he had nothing left on the ship to protect. \n\n \n\nBut now he has Tubbo, and fuck it, not that he'd ever say this to their faces but he \n\nkinda \n\nhas the other crewmembers too. He's not going back to the vents. He'd be dragged out again, this time with significantly more bitching and whining considering the slowly crumbling language barrier. \n\n \n\nHe can't go home. Probably ever. Tommy swallows back the tears that come with admitting that to himself, even in his own head. Maybe once he gets out of this cell, he can find a way to make this place feel like home. Maybe one day it really will be. \n\n \n\nIt's wishful thinking; but hey, Tommy's an optimist. \n\n \n\nHe takes a step past the threshold and into the hallway. The air smells different, cleaner. Less like him. It clears Tommy's head some. Tommy takes another step, nervousness coiling in his gut. He's terrified Techno will come barreling down the hall at any moment, shoving him back into his cell. He likes Technoblade, thinks he's a real stand-up-guy, but he's the security guard, and he doesn't seem like the type to skip out on his duties for any reason. \n\n \n\nTommy makes it to the end of the hallway and Technoblade is nowhere to be found. Neither are any of the other aliens, for that matter, which makes Tommy relax a little bit. Not fully, of course, he can't let his guard down even if they aren't going to hurt him. \n\n \n\nThe ship is how he remembers it from his brief stint in the vents, though it looks a bit different looking at it from the ground rather than the walls. It also looks strange when fully lit, rather than shrouded in darkness from Tommy's little habit of sneaking around at night. It looks less intimidating like this. There's a blanket thrown over one of the chairs that's dusted with pollen, so it clearly belongs to Tubbo. Tommy grabs it and wraps it around his shoulders. He's cold, alright. Why the fuck couldn't they put some better insulation between them and the freezing vacuum of space for fuck's sake? \n\n \n\nHe hears voices, and takes a few hesitant steps in their direction. It would be better for Tommy to find them then for them to find Tommy, after all. If he's remembering the layout of the ship correctly, then the voices, which are becoming more and more clearly an argument as he draws nearer, are sounding from the kitchen. \n\n \n\n\"-the fucking \n\nsecurity \n\nwould have figured this out by now!\" Wilbur shouts in Common. Tommy is thankful that he's better at understanding Common than he is speaking it, or he would be at a loss right now. \n\n\n\"Do you think I have heat seeking vision? What exactly do you want me to do right now?\" Techno asks coldly, though clearly just as angry. \n\n\n\"Has anyone checked the cockpit, if- shit. If he's there then-\" \n\n \n\nTommy stands in the doorway, watching the- \n\nhis?\n\n- crewmates run around like chickens with their heads cut off. It takes him a few slow moments to realize they are talking about trying to find \n\nhim\n\n. Huh, guess he wasn't as sneaky as he thought. Tubbo looks close to tears, and it makes Tommy wince in guilt. He opens his mouth to speak, but something gets caught in his throat. He's nervous. \n\n \n\nThere really is no guarantee that he won't be sent back to the cell, especially if the others are coming down off of the terror of thinking he had \n\nactually \n\nescaped with the intent to get off the ship. \n\n \n\nTurns out he doesn't have to say anything, because Tubbo calls out: \"I'll go check,\" In response to something Tommy didn't hear, and marches out the door, barreling directly into Tommy and knocking them both to the floor. Tubbo lands on top of Tommy, thankfully, Tubbo won't be squished today, thank you very much. \n\n \n\nThe room goes silent, and when Tommy looks up after making sure that Tubbo is okay, all of the crewmembers are staring at him. \n\n \n\nTubbo is the one that ends up breaking the impromptu staring match by throwing his arms around Tommy's neck with a loud cry. \n\n\n\"Oh thank the stars you're okay!\" Tubbo says. Tommy sees Techno stare at him incredulously and mouth \n\n'he's \n\nokay?' before he turns his attention back to Tubbo. \n\n\n\"Why wouldn't I be? I just wanted to get out of that stupid cell,\" Tommy says haughtily, but his eyes never leave Philza. \n\n \n\nPhil is the captain, and if he says that Tommy goes back into the cell, then Tommy has very little choice in the matter. Convincing Phil right now is vital.\n\n \n\n\"How did you get out?\" Phil says, but he doesn't sound angry. He crouches in front of him, head tilted. \n\n\n\"Your door fucking sucks.\" Tommy says, voice tight with nervousness. Philza just stares at him. If it wasn't for the kindness in his gaze Tommy would be bristling right now. \n\n \n\n\"I- I'm not going to try to escape,\" Tommy says quietly, so that only Tubbo and Phil can hear. \"Where would I go? But- but I'm not going back to the cell, okay? If- if you put me back there... then- then I really will do whatever I need to do to get out.\" \n\n \n\nPhil doesn't seem swayed by the grim determination in his eyes, even though the captain has seen what Tommy had done to the other ship. He doesn't look scared. He looks sad. \n\n\n\"You're not going back to the cell, Tommy.\" Phil says quietly. \"I was already working on setting up a real room for you on the ship. It's not quite done yet, but I think you'd prefer that to the cell, ay?\" \n\n \n\nTommy stares at him for a moment, an unidentifiable emotion rising in his chest. He blinks away tears, and Philza's smile becomes softer still. \n\n\n\"Oh. Yeah, okay.\" Tommy manages. Tubbo laughs again and pulls him closer, humming against his shoulder before standing and helping Tommy to his feet. His wings are buzzing behind him excitedly. Wilbur and Techno watch the two of them with fond exasperation. \n\n\n\"Come on! I helped pick out stuff for your room, come see it!\" Tubbo says with a broad smile, practically dragging Tommy through the ship. Tommy laughs, still a bit shocked that he \n\nactually \n\nwouldn't have to go back to the cell. \n\n \n\n____________________\n\n \n\nThe room is actually... really nice. Tommy was expecting a cell 2.0 or something, but it kinda reminds him of the rooms back home. Tubbo had clearly done his research. Tommy throws himself down onto the bed with a sigh, bouncing a little. Tubbo sits at the end, smiling at him. \n\n\n\"No sleeping under the bed this time?\" Tubbo asks with a testing smirk. Tommy closes his eyes against the simulated sunlight of the overhead. It feels good on his face. \n\n\n\"Nah,\" He says. \"I've outgrown that.\" \n\n \n\nTommy rolls a bit to get up, and feels something a bit firmer than the blankets around him poke his back. Tommy reaches under himself and retrieves the offending object, glaring at it for a moment before he processes what it is and his eyes widen. \n\n \n\nIt's a stuffed cow, clumsily made. The stitching is uneven, fluffing pokes out at the seams, the buttons eyes are barely hanging on. It's the most beautiful thing Tommy has ever seen. \n\n \n\n\"Wh- did- Tubbo did you make this?\" Tommy asks, holding the stuffed cow as though it will break in his hands. Tubbo's neck fluff puffs up, a sign of embarrassment for him. \n\n\n\"Uh- yeah! It's not very good but-\" \n\n\n\"How did you even... it's a cow. From Earth?\" Tommy rubs a finger over the cow's cloth horns, staring at it reverently. \n\n\n\"I found one of your drawings,\" Tubbo admits sheepishly. \"I figured it was an animal from Earth and thought you would feel better about... about not being able to go home if you had something from Earth with you. Even if it's not the real thing.\" \n\n \n\nTommy is a big man. Big men don't cry over shoddily made cow plushies. \n\n \n\nOkay maybe Tommy can make an exception this one time. \n\n \n\nTommy watches drops of water fall onto the cows head and moves him out of the way. He doesn't want him to get damaged in any way. Tubbo elects to ignore his tears, which Tommy appreciates. \n\n\n\"What are you gonna name him?\" Tubbo asks, swinging his legs up onto the bed and crossing them over each other. \n\n \n\nTommy thinks for a few seconds. \n\n \n\n\"Henry.\" He decides on. \n\n \n\n________________________\n\n \n\nTubbo brings him to go eat dinner with them, which is a nerve wracking experience to say the least. He enters the room stiff and quiet, terrified of saying the wrong thing and getting sent back to the cell. \n\n \n\nHis streak of tense politeness is broken within five minutes when Tubbo starts mocking Technoblade behind his back and makes Tommy laugh so hard he almost chokes, causing Philza to pound him on the back. Phil is deceptively strong for his stature, and nearly knocks Tommy's head into the table, which just makes him laugh harder. \n\n \n\nAt the end of dinner, there is considerably more mess than there had been before, but Tommy had eaten as much as he could stomach, what with his limited diet, and the combination of a full stomach and the stress of the day is making him sway sleepily. Phil notices, and chuckles softly as he sends both Tommy and Tubbo to bed to 'let the grown-ups talk'. Tommy would rise to the bait if he wasn't so bone-tired. Besides, he's kind of eager to break in his new bed. \n\n \n\nTubbo follows him into his room, but before Tommy can ask what he's doing Tubbo has moved to a hidden panel on the wall. \n\n\n\"Hold on, I want to show you something,\" He says, eyes crinkling in a smile. He presses his hand against the panel and it slides open, revealing a set of buttons. Tubbo presses a few and a hatch opens in the wall, revealing the white streaks of passing stars. Tommy's breath catches in his throat. \n\n \n\nDespite all his time spent in space, he had never seen the stars like this. \n\n \n\nTommy moves closer to the window in a daze, pressing his hand up against the window. \n\n \n\nFor the first time since he's left Earth, it's really hit him that he's free. \n\n \n\n\"We downloaded scenes from Earth too,\" Tubbo says. \"So you can look out the window to something familiar. I labeled all the buttons in English, look.\"\n\n \n\nSure enough, all the buttons on the panel have a piece of tape with English translations over them. Tommy ignores the frankly ludicrous amount of misspellings in favor of feeling touched that Tubbo had been so considerate to translate it for him. \n\n \n\n\"Thank you Tubbo,\" Tommy says. It doesn't feel like enough to say it, but Tubbo seems to catch the rawness of his voice and throws him a tired smile. \n\n\n\"You're welcome. I'm glad you like it, Tommy. I really hope this place can be a home for you someday.\" \n\n \n\nThey stare at each other for a moment, the only sound in the room being the ambient buzzing of space, something that Tommy once found terrifying. \n\n\n\"Well, it's been a long day,\" Tubbo says, starting for the door. \"I'm gonna go to bed. Goodnight, Tommy.\" \n\n\n\"Goodnight, Tubbo.\" \n\n \n\nThey share one more hug and then Tubbo leaves, shutting the door behind him. Tommy stands in the center of the room for a few minutes, just taking in the fact that this is \n\nhis\n\n place. Tommy checks the door to make sure it can lock from the inside and not the outside, and finds no evidence that they plan to lock him in here. \n\n \n\nHe really is free.\n\n\nDespite everything- the comfort of the bed, the exhaustion in his bones, the soothing light of the passing stars, Tommy cannot fall asleep. \n\n \n\nHe attributes this to the change in setting throwing him off, grumbling as he rolls over for what seems like the millionth time since he had laid down. His hair is probably a total rat's-nest. Not that it could have been much worse after his stint through space. He sits up and runs a hand through his hair, wincing when it gets caught in the tangles. Now that he's free he\n\n really\n\n needs to figure out where the baths are.\n\n \n\nThat will have to come in the morning, though. He's not sure that anyone is awake at this hour, and he doesn't want to mar his first free night by pissing off one of the crewmembers by waking one of them up to ask where the showers are. \n\n \n\nHis mind wanders in the silence, the darkness of the room permeating his senses entirely. He heaves another sigh and tries to wrench his thoughts to something lighter than the dread that's made a home in his chest since he was taken off of Earth. He stands, wrinkling his nose at the feeling of the cold tile against his bare feet. He really needs to see someone about getting some shoes that aren't mismatched or torn to shit. \n\n \n\nHe walks out of his new room as silently as he can, which, due to his lack of shoes, is pretty damn silent. He holds the newly-dubbed 'Henry' close to his chest. As embarrassing as it feels to be walking around holding a stuffed animal, he has already grown stupidly attached to the thing. Maybe it's because it reminds him of home, or maybe it's just because Tubbo made it.\n\n \n\nThe hallways are dark, lit with tiny globes stuck into the wall that light up when he walks past them. Tommy chuckles quietly at the notion that a futuristic spaceship would have nightlights but keeps moving to the kitchen. There's no way he'll be able to figure out the layout of the ship in its entirety on his own, but he doesn't want to lay in bed and let his mind wander down dark alleys when he could just get up and get some water instead. \n\n \n\nHe finds the kitchen without much trouble. It had been the place he frequented the most while living in the vents, after all. He grabs a glass from the cupboard and fills it with water from the sink. He drains it and fills it again, sipping more slowly this time. The last thing he needs is to get sick after everything. \n\n \n\nHe leans against the counter, staring at the wall as he drinks. \n\n \n\nIt's been a long time since he's been in charge of anything in his life. He can't remember the last time he had gotten himself food or water without being terrified of being caught. Over the past few months he'd gotten used to being fed rather than feeding himself, and even now the indignity of it twists his gut. He finishes the water and sets the cup down next to the sink before starting back to his room. \n\n \n\nOn his way back, one of the nightlights flicks on and illuminates a door slightly open. Tommy, ever the curious one, pokes his head inside without any hesitation. It's Tubbo's room, as made apparent by the fact that Tubbo is sprawled over the bed on his stomach, drooling into one of his pillows. Sleepiness drags down Tommy's eyes just looking at him, and he huffs under his breath before pushing the door open a little more and standing over Tubbo. \n\n \n\nHe hopes he doesn't wake up while Tommy is watching him sleep like a stalker, but Tommy is too tired to truly care. Tommy grabs one of Tubbo's many unused pillows and sets it on the ground before lying down, tucking Henry under one arm. It isn't exactly comfortable, but it's more familiar than the bed had been, and the sound of Tubbo's whistling breaths put him at ease. It drowns out the white noise of space that has been chasing him for far too long. \n\n \n\nTommy falls asleep pretty easily after that.\n\n \n\n_________________________\n\n \n\nEverything hurts, and it's only going to get worse. That's what all the other prisoners say, anyway. They look at Tommy with something so \n\npitying \n\nthat it makes him want to lash out, but he can't, and not just because of the bars that separate them. They're going through this together, all of them, and a few of them have formed close bonds. Not all of them speak English, of course, they've all been taken from different parts of Earth. \n\n \n\nOne of the guards steps into the room, not Dream, the pure white one wearing gold, and the caged people immediately hush. A few of them spit, both literally and figuratively, but Punz seems completely unbothered, stepping towards Tommy's cage. Tommy bares his teeth at the alien, but he doesn't flinch. Tommy couldn't really do anything, and they both know it. Dream keeps everyone underfed enough that they aren't able to fight back, just barely enough to keep them alive. \n\n \n\nPunz grabs him by the arm roughly, digging his claws in when Tommy tries to resist. A few of the other people caged around him shout and shake the bars but the guard doesn't pause, only continues to drag Tommy out of his cell for more testing. As much as Tommy hated the cage, the testing was a hundred times worse. \n\n \n\nThe memory shifts like someone swirled it in a glass of water and then Tommy is staring at his neighboring cage. It's empty, and it has been for a few days. The others say he's gone, and Tommy knows they're probably right. There is only one thing that could have happened when one of them disappeared. \n\n \n\nThe memory shifts again, and then Tommy is sort of aware of the fact that he is dreaming, but nothing changes, and the realization slips out of his mind like water between his fingers. \n\n \n\nTommy is gripping the wheel of the ship so hard that his knuckles have gone white. He did it. He actually fucking did it. All the others have been killed or sold off, but according to some of the few who had been able to pick up a bit of Common, they had something special planned for him. He can hear Dream trying to speak to him through the door, all broken English and cloying lies.\n\n \n\nThe front of the ship crumples against the surface of some distant planet, and Tommy slams against the far wall. He gets up panting and rushes for the door. \n\n \n\nDream's hand is on his shoulder. He's in his cage and in his cell and in his room back on Earth, all blended together in some dark mashup. \n\n\n\"You can't leave, Tommy.\" Dream says, and Tommy knows this isn't real. Dream never was able to speak English and he certainly never knew Tommy's name, but all that information seems to slip out of his mind as soon as he realizes it. \"You can't leave.\" \n\n\n\"You died.\" Tommy says weakly. \"I made sure-\" \n\n\n\"You can't know that,\" Dream says, like he's talking to a child. A pet. Something lesser. Tommy wants to push him away, but his arms are as heavy as stone. \n\n \n\n\"You're not safe, you're not safe anywhere but Earth.\" Dream says, voice shifting all over the place. \"You can't go home with them. I can take you home. I went to Earth before, remember?\" \n\n \n\nTommy wants to cover his ears but he can't move at all. \n\n\n\"I'm your only hope, Tommy.\" Dream whispers. \"You need me.\" \n\n \n\nTommy wakes up screaming, and then immediately claps a hand over his mouth and rolls into the fetal position. Shit, shit, shit. Okay. No one heard that-\n\n \n\nA hand is on his shoulder and it takes every ounce of self control for Tommy not to turn around and deck whoever is touching him. He can't hold back a full body flinch, however, and the hand pulls away. \n\n \n\nShit. He fell asleep in Tubbo's room. Fuck. \n\n \n\n\"-ommy? Tommy, are you okay? Can you hear me? Do you need me to get Phil?\" \n\n\n\"Don't get Phil,\" Tommy gasps, rolling back onto his back. Tubbo's hands are hovering over him like he wants to pull Tommy into a hug but doesn't want to upset him further. \n\n\n\"Take deep breaths,\" Tubbo says evenly, and Tommy shoots him a look. \n\n\n\"I'm not havin' a fuckin' panic- panic attack,\" Tommy hisses. \n\n\n\"I didn't say you were, but you're breathing like you were running. So breathe right or you're gonna black out.\" \n\n \n\nHe has a point there, actually. Tommy makes an effort to slow his breathing, even though it feels like fire going in. Once he's calmed down enough that he's stopped shaking, Tubbo sits next to him. \n\n\n\"Can I touch you?\" Tubbo asks. Tommy opens his mouth to reply with something snarky, just to break the tension of the room, but he closes it again. \n\n\n\"Not the shoulders, please,\" Tommy mutters, and Tubbo nods, grabbing onto Tommy's hands like they're his only lifeline. \n\n \n\nA few minutes of quiet pass until Tommy has fully calmed down. \n\n\n\"Nightmare?\" Tubbo asks quietly. Tommy snorts out a humorless laugh. \n\n\n\"No I had a dream I won the fuckin' lottery,\" Tommy snarks. \"Yeah, I had a nightmare.\" \n\n\n\"Do you want to talk about it?\" Tubbo asks. Tommy hesitates. He doesn't want to. Like, at all. But the school counselor used to say that the only way to get over something was to talk about it, though that might have just been her way of getting Tommy to tell her all his secrets. \n\n\n\"Just... about the last ship.\" Tommy admits. Tubbo nods sagely. \n\n\n\"I figured that might have been it,\" He says. \"Anything specific or was it just general.\" \n\n\n\"Specific,\" Tommy says, tucking his face into his knees. \"But it was a bunch of different memories all swirled together.\" Tubbo hums in understanding. \n\n \n\n\"Tubbo?\" Tommy asks, looking up from where he had hidden his face. \n\n\n\"Yeah?\" \n\n\n\"What are the chances of someone surviving a ship crashing the way I crashed it. A non-human.\" \n\n \n\nTubbo hums thoughtfully, putting a finger to his chin. \n\n\n\"Phil showed me the pictures of the wreckage, I'd say there's an almost zero percent chance they lived, depending on where they were in the ship. Why? Someone in there you don't want getting out?\" \n\n \n\nTommy nods. Tubbo scoots next to him, pressing against his side. \n\n \n\n\"Come lay in the bed, the floor can't be comfy,\" Tubbo says, pulling him to his feet. Tommy groans, throwing his head back. \n\n\n\"I've been sleeping on the floor for like a million years, I am \n\nnot\n\n used to beds right now.\" \n\n\n\"Good a time as any to get used to them, then!\" Tubbo says cheerfully before shoving Tommy into the bowl-shaped bed and clambering in after him. Tommy huffs in irritation and erects a small pillow-wall between them, making Tubbo roll his eyes. \n\n\n\"You're so proud,\" Tubbo teases. Tommy is too tired to put up a real fight, but he shoots Tubbo what he hopes is a withering glare anyway. Tubbo doesn't look upset in the slightest. Tommy nestles Henry against his collarbone, glaring at Tubbo as if daring him to say anything. Tubbo only smiles. \n\n \n\n\"I'm staying on the ship, you know.\" Tubbo says quietly. Tommy blinks at him. \n\n\n\"Were you not going to before?\"\n\n\n\"I came here as a favor to Phil, but I was always going to need to go back eventually. I've sent in a request to stay here full time as a sort of abroad student, and it was approved.\" \n\n\n\"Oh-\" Tommy says, relief flooding his chest. Thank \n\nGod \n\nhe wouldn't have to be here without Tubbo, then he really \n\nwould \n\nbe miserable. \"Good.\" \n\n \n\nThey lay there for a while, Tommy staring up at the dark ceiling. Sleep is coming to him much more easily than before. Tommy chalks this up to hearing someone's breathing. \n\n\n\"Humans are pack-based, you know.\" Tubbo says, making Tommy blink tiredly. \n\n\n\"I know.\" \n\n\n\"I mean, you're built to protect each other. I just- Tommy who was protecting you? Did you have family on Earth?\"\n\n \n\nThe room is silent again, and Tommy sees Tubbo open his mouth to apologize, but Tommy beats him to the punch. \n\n\n\"I didn't have a family on Earth, no.\" Tommy admits. \"I lived in a group home, which is like where children can go when they don't have parents. After- after I was abducted there was- well most of the people there didn't have families either. I think that's why they took us. The person in the cell next to mine, he was probably the closest thing to family I had. He protected me.\" \n\n\n\"Where is he now?\" Tubbo asks quietly. \n\n\n\"Dead,\" Tommy says, trying to sound nonchalant. It doesn't work. \"They took him for experimenting one day and he just...never came back.\" \n\n\n\"I'm sorry,\" Tubbo says. Tommy shrugs. \n\n\n\"No use crying over it now.\" \n\n\n\"You're going to be okay, you know,\" Tubbo says. Tommy looks over to him, slightly startled by the hard determination in his eyes. \n\n\n\"What?\" \n\n\n\"You might not feel it now, but you're going to be okay. Okay?\"\n\n \n\nTommy can feel tears welling up in his eyes and desperately tries to tamp them down. \n\n\n\"Okay.\"\n\n\n\"Now go to bed. I'm not gonna be the one to tell Wilbur you slept through your first day as a real crewmember because you were up late being sappy.\" Tubbo says, smacking his shoulder. Tommy laughs wetly, wiping his eyes in a way that he hopes is subtle but probably isn't. \n\n\n\"You're a good friend, Tubbo,\" Tommy says. Tubbo smiles at him. Tommy rolls over and presses Henry against his chest. It is a small comfort in a place as large as space, but it soothes him all the same. He sleeps without nightmares. \n\n \n\nWhen he wakes, a passing star glows through Tubbo's window. It looks like a rising sun. \n\n "
}