{
    "id": "311092",
    "url": "https://archiveofourown.org/works/311092?view_full_work=true",
    "author": [
        "cloudyjenn"
    ],
    "title": "The Mirror",
    "rating": "Mature",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "F/F",
        "F/M",
        "M/M"
    ],
    "fandoms": [
        "Supernatural"
    ],
    "relationships": [
        "Castiel/Dean Winchester",
        "Sam/Various"
    ],
    "characters": [
        "Castiel",
        "Dean Winchester",
        "Sam Winchester",
        "Gabriel (Supernatural)"
    ],
    "additional_tags": [
        "Mirror Universe",
        "Kid Fic",
        "Complete"
    ],
    "language": "English",
    "series": "",
    "published": "2012-01-02",
    "completed": "2012-01-02",
    "words": "24,568",
    "chapters": "3/3",
    "comments": "377",
    "kudos": "10,129",
    "bookmarks": "2,558",
    "hits": "105,869",
    "summary": "<p>When Dean touches a strange mirror, he's whisked away to one alternate reality after another and it doesn't take him long to realize the universe is trying to tell him something.</p>",
    "notes": "<p>This story is based off a comment_fic prompt on Livejournal that I can no longer locate.</p>",
    "text": "Touching the mirror is a mistake. Dean knows touching the mirror is a mistake. But there is something so mesmerizing about it, about the liquid shine of the round smooth glass and Dean literally can't stop himself from reaching out to trace the tip of one finger along the mirror's surface.\nIcy shards of white hot pain slice through his body. For one moment, Dean's a live wire, a conduit of energy crackling lightning bright and then it's over. His hand falls to his side and he stumbles to his knees, choking on nothing more than aftershock.\n\"What the hell,\" he gasps, but no one answers. It takes a moment to gather himself and when he does, Dean leaves the room that holds the mirror, expecting to find his brother and angel, Sam and Castiel are gone. The dark and dusty hallway is empty save Dean.\n\"Sam?\" Dean calls out, forcing the word through his growing panic. \"Cas?\"\nAgain, there is no answer and Dean trades fear for anger because anger is easier. He tugs out his cell phone and flips it open, dialing Sam. It rings and rings and Dean only hears Sam's voice when he's sent to Sam's voice mail. The same thing happens with Castiel's number.\nThis is so not funny.\nDean pulls out his gun and carefully steps down the grimy stairs to the ground floor, calling out for his brother and their angel every few steps. It's not until he's near the front door that he finally hears a sound. Pressing himself close along the wall beside the door, Dean slows his breath and listens hard.\n\"Please be careful,” a voice says from outside on the front porch.\nThe voice both relaxes and upsets Dean because it's good to know Cas is alive, but why the hell did he leave Dean when he must have heard him gasping in pain on the floor above? Dean's hand settles on the knob and he starts to turn it, but then another voice answers Cas and it shocks Dean to stillness.\n\"I'm always careful, Cas.\"\nIt's a woman's voice, dark and smoky and it makes Dean think of shadows in a bar. He doesn't recognize it, but Castiel obviously does because he sighs and speaks again.\n\"That is a lie,\" Castiel says sternly. \"You're reckless. The job of watching over you requires far too much effort.\"\nWatching over her? Since when did Cas get new humans to watch over?\n\"Oh yeah, well, I didn't hear you complaining last night,\" she says with a smile Dean can hear.\nSomething dark and unpleasant curls in Dean's chest. Dean never thought he knew every detail of Castiel’s existence, but he did think he knew everything Castiel did on Earth and that includes overly intimate relationships with women he doesn't know. Dean doesn't like her innuendo. Not one bit.\n\"That's not exactly what I meant,\" Castiel says, but now he sounds amused.\n\"Hey, you picked me, you're stuck with me. Good and bad,\" she says and they are close enough now that Dean can hear the unmistakable sounds of kissing. The unpleasant feeling in Dean's chest explodes into a kind of blind rage Dean doesn't even understand and that's enough. He rips open the door and stares at Castiel.\n\"What the fuck, dude?\"\nCastiel's eyes widen only slightly and he sways backwards, but for him, that's nearly an overreaction. The woman beside him covers her own surprise so fast Dean only has a second to register her cropped brown hair, green eyes and squared jaw before there's a gun in his face.\n\"Stay back,\" she snarls and the way she positions herself in front of Cas would be endearing if it weren't Dean’s angel. \"Who are you?\"\n\"Who am I?\" Dean asks, incredulous. \"Who are you?\" His eyes snap over her head to Cas, who is studying Dean, his eyebrows a dark line of concern across his forehead. \"Cas, who is this chick? Where's Sam? \"\n\"That's it,\" she snaps, cocking her gun to emphasize her words. \"Tell me who you are and how you know Sam or I swear to God, I'm blowing you away.\"\nIt's this threat that's makes Dean realize this situation is something other than Cas hiding a girlfriend from him. He recognizes that look in her eyes. That insane protective glint shining in eyes that suddenly look a lot more familiar than he realized. Cas having a secret lover is one thing. But there’s no way Dean wouldn’t know someone this overtly defensive of his own brother.\nDean steps back and holds up his hands a little, needing the distance to look at the woman and really see her. She is exceptionally tall for a girl, maybe only an inch or two shorter than him. Her body is lean and hard, but with enough curves to be considered feminine. Not Dean's type, not with the short hair and flat chest, but she's attractive in an athletic kinda way.\n\"No, DeAnna,\" Cas suddenly pipes up, laying a hand on the girl's arm. \"That wouldn't be a good idea.\"\n\"Why not?\" she asks just as Dean says, \"DeAnna?\"\n\"I recognize him,\" Castiel says with faint disbelief. \"There is...I sense...he's-\"\n\"Spit it out, Cas,\" the woman and Dean say in tandem. She frowns at him, but Dean keeps his eyes on the angel and holds his breath because he's almost positive he knows what Cas is going to say and it's so fucked up, he can't think straight. Especially not when he remembers the way this chick was all over Cas just before going onto a job.\n\"He carries my Grace,\" Castiel says quickly.\n\"Excuse me?\" Jealousy scorches her words and Dean would laugh if he weren't busy trying not to panic. His other self, his female self turns to Castiel, but keeps her gun trained on Dean. “You been pumping other people full of your Grace?”\n“Of course not,” Cas says, sounding annoyed. “This is you, DeAnna. A version of you from another reality.”\n“No fucking way,” she murmurs.\n“Great,” Dean sighs, rubbing his temple. Just great. Not only did he get sucked into an alternate dimension, he got the one where he’s a girl. A girl that’s apparently screwing his angel.\n“Fucking mirrors,” he mutters.\n*******************\n\"The only thing I can think to say is touch it again,\" Castiel says.\nDean and DeAnna both look at him like his head is on fire.\n\"That's all you got, Cas?\" DeAnna says with no small amount of sarcasm. Dean snickers quietly. Yeah, it's weird as fuck seeing himself as a chick, but at least she's awesome.\nCastiel frowns with his whole being.\n\"I have more information at my disposal than you could know in the entirety of your life and this is the only solution that presents itself. Dean came here through the mirror. He must go back the same way.\"\nLooks like being in a mirror world hasn't changed Castiel all that much.\n\"Yeah, but...what if it doesn't go back to the right world?\" DeAnna asks reasonably and that touches the secret fear Dean realizes has been growing in his mind.\n\"I am concerned about that as well,\" Castiel admits. \"Of course, I had planned on asking my brothers for advice. But I do think this is the proper course of action.\"\n\"Okay,\" DeAnna says. \"So go. Talk. Come back with answers.\"\nTo Dean's surprise, Castiel leans over to peck DeAnna on the mouth before he disappears with a gust of wind. He raises an eyebrow at her.\n\"Really?\"\n\"Shut up,\" DeAnna growls. At least she has the good sense to blush. \"Cas likes it, okay?\"\n\"So you're whipped,\" Dean concludes, but his joke doesn't have the desired outcome. DeAnna just smiles this crazy distracted grin and nods.\n\"You bet your ass, Boy Me,\" she says happily.\nDiscomfort curdles Dean's insides. A thought here and there is one thing. Those are easily squashed. But this...DeAnna looks like she's really in love. Even being a girl doesn't dismiss the very real panic at the idea of any version of himself feeling those kinds of feelings for Castiel.\n\"You look like you're gonna ralph,\" DeAnna comments. \"I know what you're thinking. How could we love him? He's so weird and awkward and not a chick, blah blah blah.\"\n\"Easy for you to say,\" Dean snaps. \"You're a woman!\"\nDeAnna's gaze cools considerably.\n\"What makes you think I like dudes any more than you do?\"\nFor a second, Dean is lost and then it clicks in his head. He shouldn't be so pleased. He really shouldn't, but learning that his female counterpart is a lesbian is so completely awesome.\n\"Dude. Hot.\"\nShe slaps the back of his head.\n\"Quit being so me about this and listen. You're not straight. I'm not gay. So stop acting like you don't like both and hit that. Seriously,\" she says over Dean's objections. \"You won't regret it. He's a fucking tiger in the sack.\"\nDean makes a face. This is not awesome anymore. \"C'mon, stop...he's an angel. He's not...he shouldn't be doing that.\"\n\"Oh I know. We've been through this,\" she says, nodding eagerly. \"He shouldn't be fucking random people and becoming a sad shell of himself. I totally agree.\"\nHer hand, so much smaller than Dean's and yet so very familiar, lands on his arm.\n\"I'm going to say something very gay, so prepare yourself.\" She only gives him a few seconds before continuing. \"It's different with love, okay? If he's in love and if I know my Castiels, he's totally gone on you, then it's different.\"\nHer Castiel saves Dean from having to answer. His return doesn't steal DeAnna's attention though and Dean's gaze is locked on hers when Castiel starts talking.\n\"Alright, I've checked and all my brothers agree that it's best if you touch the mirror again,\" he announces.\n\"Right,\" DeAnna murmurs. She shakes herself a little, the intensity melting off her face and she smiles at Castiel. \"Thanks, babe.\"\n\"You're welcome.\"\nDean rolls his eyes. \"Well, I guess I'll just...you know, get out of your disgusting lovefest.\"\nCastiel's head cocks to the side and Dean's chest tightens. So very like his...like the other Castiel.\n\"It's uncanny how very similar you are to DeAnna,\" Castiel says and that bit of creepy coincidence makes Dean step up to the mirror.\n\"Well, here goes nothing,\" he says.\nHe reaches out and the mirror takes him in.\n*******************\nEven through the flickering remnants of the sharp pains that accompany traveling through the mirror, Dean can tell he's not in the right universe. There are three women standing six feet from the mirror, each one with identical expressions of surprise. One of them is DeAnna. Complete with the short haircut and battered blue jeans and green t-shirt combination she wore in the previous universe.\nDean barely notices her. His attention is immediately snared by the giantess beside her. This chick is tall. At least the same height as Dean's Castiel, if not taller. Her silky brown hair flows down around her face and neck until it reaches one of the biggest racks Dean's ever seen. He's actually shocked by the size of this woman's chest, but not shocked enough that he doesn't notice the rest of her body is equally curvy. Her tight blue jeans and white button down blouse don't do anything to hide the effect.\nThis woman is dangerously hot.\nAnd yet, even as Dean is thinking it, he realizes it's a very distant assessment. Like you might feel while looking at a nice painting. It's pretty, yeah, but you don't wanna hang it on your living room wall.\n\"This is very unusual.\"\nThe voice belongs to the third woman. It's soft and rough, like maybe she'd been smoking for twenty years and the sound of it spikes a shiver up Dean's spine. His eyes flick to her face and his lips part.\nForget the other chick. This has to be the hottest woman Dean's ever seen.\nHis stomach immediately ties itself in knots and his heart rate picks up like it does when...\nOh crap.\n\"Castiel?\"\nHer head cocks to the side. \"You are...DeAnna Winchester?\"\n\"Well, Dean, but yeah,\" he says.\nDeAnna and the other girl's eyes widen with surprise.\n\"You've gotta be kidding me,\" DeAnna grunts, but the other girl is contemplating Dean closely, her hazel eyes narrowed in thought.\n\"I don't know. He's got your eyes and mouth,\" she says.\n\"Hey,\" Dean protests, although it's not like he can really deny it.\n\"Thanks for your support, Sam.\"\nOh right. Of course. Now that DeAnna's said it, Dean realizes he'd known. Of course, he'd known. It's Dean and Sam. He'd recognize him or her anywhere and anywhen. Even subconsciously. A certain measure of relief eases the tension Dean's feeling. If he'd been turned on by Sam, he'd have to just kill himself.\nAlthough, the thought leads to another that has Dean's stomach clenching.\nStupid slobbering dickheads with their paws all over this Sam. God, if Dean actually did have a sister, Sam would never ever get laid.\nEver.\n\"Dean?\" Sam says, sounding perplexed. Dean shakes himself.\n\"Sorry. Look, this mirror thing keeps sending me to the wrong reality. I don't know what it is. The Cas in the last world went to ask around, but he couldn't figure it out. So, maybe you could try again, only this time actually find something?\" Dean says, directing his attention to the female Castiel.\nThat flare of possessive desire heats him once again, but Dean tries to step back from it and consider her without the haze of lust clouding his mind. What he sees is surprising.\nShe's actually sort of plain.\nNot ugly by any stretch of the imagination. Her face is cute enough. Oval-shaped with a small mouth and a button nose. The hair hanging loose around her shoulders is thin and light brown, truthfully more of a blond. The only feature of her face that's really striking are the eyes. They're an intense deep brown. So dark that Dean can barely see a difference between the iris and pupil and while that's not such a surprising color, combined with the blond hair, it seems unusual.\nBut it's more than just a weird color. This Castiel stares as much as the male version and there is something in her gaze that Dean recognizes. A spark that makes these eyes as odd and striking as the blue ones Dean associates with Castiel.\nMaybe it was never the color that made them stand out.\nShe's short. The top of her head barely reaches halfway up DeAnna's neck and her body is slight. Curvier than DeAnna's and she's got a nice respectably sized chest hidden under her navy pea coat, but she's not really like the bombshells that Dean usually dates.\nBut holy fuck is she ever gorgeous.\n\"Stop staring at her,\" DeAnna snaps.\n\"Sorry,\" Dean grumbles, even though he's not. He just doesn't want to fight a murderous jealous version of himself. \"I take it you are also fucking the angel.\"\n\"I'm going to ask for advice from my brothers,\" Castiel says before DeAnna can answer and then she's gone.\n\"Well, this is awkward,\" Sam murmurs, inspecting her dark red nails.\nIt figures Sam would be the whole make-up and nails kinda chick. Seriously, DeAnna must spend all her time fighting guys off of Sam. Then again, Dean doesn't keep Sam from the ladies, so maybe DeAnna just high fives her Sam after she scores another douchebag. Dean curls his lip. The idea taunts him.\n\"You got a problem with me and Cas?\" DeAnna asks, arms crossed defensively over her chest. Dean gets the impression that her relationship with this Castiel is rather newer than the last DeAnna's relationship.\n\"No,\" Dean says, even though, yeah, it still freaks him out. \"But hey, at least you're with the right gender this time.\"\nDeAnna frowns.\n\"What's that supposed to mean?\"\n\"You know...because she's a girl and you're a girl,\" Dean says slowly. \"And you're a lesbian...\"\n\"I'm not a lesbian,\" DeAnna says, one eyebrow raising up her forehead. \"Well, I mean, I'm with a chick, so yeah, but...not that Cas is really a girl. But she's Cas, so you know...\"\nDeAnna trails off to an awkward silence. Oh yeah, she definitely just started screwing Castiel. Dean allows himself a moment to contemplate how it would look.\nDamn.\n\"Stop imagining it!\" DeAnna snarls.\nSo apparently, Dean is angry and possessive early in relationships that actually matter to him. Good to know.\n\"I take it Castiel isn't always a girl,\" DeAnna says after a moment of stilted silence. Dean wishes Sam would wander back from her unconvincing fascination with looking out a nearby window.\n\"Yeah, my Cas, I mean the one from my reality, is a dude.\"\n\"What's he look like?\"\n\"I don't know. Taller. Black hair, blue eyes, always wearing a trench coat.\"\nThe first smile Dean has yet to see on this version of himself tugs at DeAnna's mouth.\n\"So in another dimension, Cas' pea coat is a trench coat?\"\nHe snickers. Of course Castiel is stuck in that same outfit. A pea coat and khaki pants instead of the trench coat and blue suit, but consistent nonetheless. Some things are universal.\n\"Yeah, I thought about stealing it and burning the damned thing, but I'd hate to see a grown angel cry,\" Dean says and when DeAnna chuckles, Dean feels like he's won some kind of competition. He's surprisingly hard to get along with when he's in a bad mood. Sam must never know Dean had that thought.\n\"Are you fucking him?\" DeAnna asks.\n\"No,\" Dean answers, rather too quickly. \"I'm not...I don't...\"\nBut he does. Dean did recognize the feeling he had when looking at the female version of Castiel. That low curl of desire made a thousand times stronger by a stupid fondness that came out of nowhere. And that's when it hits Dean.\nHis reaction to this Castiel is what he's been trying to quell all along. The feeling isn't stronger because this Castiel is a girl. It's just clearer because he's not afraid of the sensation when Castiel is in this form.\n\"Are you okay?\" DeAnna asks worriedly.\nDean shakes his head.\n\"Not really.\"\n\"What the hell happened-\"\n\"I am sorry, Dean,\" Castiel says when she explodes into existence to interrupt DeAnna. \"My brothers and I both believe you will not be able to manipulate the direction this portal takes you. It's unlike anything I have ever seen.\"\nGreat. If the angels don't know what's going on, then Dean's in really deep shit.\n\"Right. Okay. Um, I should...\" He points towards the mirror, feeling dazed and uncomfortable.\nSam starts to say something, but Dean just wants out. Before the words reach his ears, his fingers are grazing the glass and he's gone.\n*******************\nThe pain is easier to bear this time. Instead of white-hot electric forks of pain scattering across his body, the sensation feels more like a sharp ache in his bones. Still not pleasant, but less shocking. Dean wonders if this is his new lot in life. To travel through dimension after dimension until the sensation of passing is little more than a pleasant warmth.\nHe doesn't wonder long though because when he looks into the room, Dean sees himself kissing Castiel.\nNot DeAnna. Plain old dick-owning male Dean Winchester with his tongue shoved down very male Castiel's throat.\nGod, it's so weird. Seeing himself for the first time in this state. With his hands clutching desperately at Castiel's stupid trench coat and moaning like a two-dollar whore.\nDean knows that moan. He recognizes it, even if he's never heard it with such urgency before. It means he's fucking gagging for it.\nA wave of heat, both arousal and humiliation, crashes through him and he can't move. He's glued to spot, watching Castiel fumble with the other Dean's zipper as he bites at other Dean's jaw. Neither of them have noticed him. Dean wonders how often they stop in the middle of hunts to fuck against walls.\nHis brain comes back online when Castiel sinks to his knees.\nIt's far too much. Dean spins around and claps both hands against the mirror.\n*******************\nIt occurs to Dean as he lands on his feet once more than eventually he's going to have to spend more than fifteen minutes in each of these realities. Sooner or later, he'll have to take a leak, if nothing else. Not to mention needing food and sleep. He seems to be arriving at more or less the same time in each world, but it's probably been at least an hour since he left his own reality.\nHe can already tell this won't be a good reality to stop in.\nThere's a gun in his face.\n\"What the hell is it, Cas?\" the other Dean snarls.\nFrankly, Dean prefers being threatened to seeing himself tongue-fucking Castiel.\n\"It's you,\" Castiel answers in that low enticing tone. She's the same blond-haired woman from two realities ago. There must only be two choices then. This chick or Jimmy. She's just as unbelievably hot as she was the last time, but there's something drastically different about her.\n\"You knocked her up?\" Dean shouts.\n\"What the fuck?\" other Dean growls. \"This is me, Cas? What the hell is going on?\"\nCastiel's hands rest on her slightly rounded stomach. Dean's not an expert on pregnancy, but it looks like Castiel has only just begun to show. An exquisite kind of boiling rage darkens his vision and without thinking too hard about it, Dean smacks the gun out of other Dean's hands.\n\"You knocked her up and then let her go on hunts?\"\nOther Dean's surprise shows clearly on his face. Obviously he didn't expect Dean to attack like this, but Dean knows himself. He wouldn't shoot anything that Castiel didn't find dangerous.\n\"You try telling her anything!\" other Dean growls. \"I told her to stay at home, but she kept saying she could take care of us and the baby and I should just shut the hell up.\"\nDean lifts an eyebrow at Castiel. \"You said that?\"\n\"Dean is paraphrasing,\" Castiel says in a perfectly deadpan tone.\nGod, Dean wants to fuck her so damn bad. She's definitely rocking that pregnancy glow thing.\n\"How is an Angel pregnant anyway?\" Dean asks, shaking off the feeling.\n\"Fuck that,\" other Dean says. \"How are you even here?\"\nCastiel steps between them, pinning first her Dean with an annoyed glare and then Dean himself.\n\"I am not fully angelic,\" she explains. \"I still have my powers, but living away from my brothers has somewhat curtailed them.\"\nAn old guilt flares in Dean's chest. Castiel, stuck away from home and losing his abilities because of Dean. It's not fair to him. Dean's never been worth it.\n\"Stop it,\" she says, sounding so very like a normal grumpy pregnant woman that Dean can't help smiling at her. \"I chose this life.\"\n\"What about her,\" Dean says, nodding towards Castiel's middle. \"Your vessel.\"\nSadness glows in her deep brown eyes, but it's nothing compared to the crushing guilt in other Dean's face. They don't have to say anything. Like Jimmy, this woman must have died when the archangels attacked Castiel. Or some other time. Either way, she's gone now and Castiel is stuck in her body.\n\"Okay, so my turn now?\" other Dean says, crossing his arms and matching Castiel's glare. \"Why is he here?\"\n\"I don't know exactly,\" she admits. \"But he carries the evidence of my Grace. He is you, but from another place. Another world.\"\n\"There actually are multiple dimensions?\" other Dean asks skeptically. \"This sounds like something Samantha would love.\"\n\"Samantha,\" Dean says, nodding. \"You got a sister, huh.\"\n\"What's that supposed to mean?\"\n\"Mine's a Samuel.\"\nOther Dean makes a face. \"That's fucked up, dude.\"\n\"I should go ask my brothers for help-\"\n\"Don't bother,\" Dean says with a sigh. \"They never say anything useful. I'm just going to...\" He points to the mirror. \"So yeah. Congratulations on your weird hybrid baby.\"\nHe touches the mirror before other Dean can return an insult.\n*******************\n\"Dean, you scared the shit out of me!\"\nHe stares. Rubs his eyes and stares again, but what he's seeing doesn't change.\n\"Are you okay?\" Jess asks, her pretty blue eyes filled with concern.\nFor a moment, Dean is transported back to that dreamworld the djinn created for him. Jess alive and well and his mother too, but his relationship with Sam screwed all to hell. He wonders if there are realities out there where he and Sam never got along. He wonders if this reality is one.\nHe's stalling for time.\n\"Uh, Jess,\" he says. \"Um...hey, is Cas around?\"\nShe snorts inelegantly and Dean can't help smiling. Even making less than graceful sounds, Jess is beautiful. Well, it's more than just simple beauty. There's a sparkle about her that draws you in, one that has nothing to do with her looks, though there's no denying she's hot. She exudes a kind of feminine warmth that no man can resist, regardless of whether they like pussy or cock. At least no man Dean wants to know.\n\"He's your main squeeze, not mine,\" she teases.\nNervous tension fills Dean's belly. So, this is a male Castiel world.\n\"Look, I'm not really-\"\nWhich is when he's interrupted, of course.\n\"Jessica?\"\nCastiel's voice echoes up the stairs. Dean's nerves spike. He's yet to actually speak with a male Castiel who's already in a relationship with Other Dean. There's no reason to be so nervous, surely. It doesn't change anything about him. It's not as though Castiel will suddenly know more about him, not really.\nBecause he's not this Dean.\n\"In here, Cas,\" she calls back.\nIt's obvious Castiel knows he isn't the right Dean. As soon as those compelling blue eyes fall on him, Castiel whips in front of Jess, pushing her back protectively. An embarrassing warmth glows in Dean's chest. Of course Castiel would be protective of Jess.\n\"It's okay,\" Dean says. \"Alternate reality mirror.\"\nJess' expression is utterly bewildered, but Dean sees Castiel's understanding in the relaxing of his shoulders. He still doesn't move away from Jess, though. Maybe this might be a good reality to pause for a break.\n\"What's going on, Cas?\" Jess asks from behind him.\n\"This is not the Dean from our reality.\"\n\"Excuse me?\"\n\"I just left Dean in the Impala and came to find you. We're ready to leave. This man is Dean Winchester, but he is not from this world,\" Castiel explains.\n\"How-\"\n\"The mirror,\" Dean says. \"Look, it's a long story. I was wondering...\" But before he can ask for help, a question niggles into his consciousness and Dean can't stop it from immediately coming out of his mouth. \"Where's Sam?\"\nBoth Castiel and Jess' postures and expressions radically change. Stunning grief dims Jess' bright gaze and she seems to crumble in on herself. Castiel slips his arm around her shoulder, rubbing soothing circles into her back and glaring at Dean, as if he hurt Jess on purpose. Tension fills Dean's stomach, making him feel sick.\n\"What?\" he asks, his voice stony. \"What happened?\"\n\"Is he...is he alive?\" Jess asks in an odd blank tone. \"In your world?\"\nDean falters. He doesn't want to explain what happened to her. Finding out you apparently like dick is one thing. It’d be nothing to compared to learning you were dead in another reality. Just considering it gives him a strange vulnerable feeling.\n\"Yeah,\" he finally says, but doesn't offer anything else.\n\"He's been gone for years here,\" Jess says. The sadness filtering into her lifeless voice is a cold comfort. \"He died in the fire.\"\n\"The fire? You mean when we started hunting?\" Dean asks in amazement. \"But how?\"\n\"He saved me from the demon, but it killed him. I don't think it meant to, but there was a struggle...so really, if it weren't for me-\"\n\"Jessica,\" Castiel interrupts. \"Please don't. We've discussed-\"\n\"It's true, Cas!\" Jess snaps, tearing out of his grasp and spinning on him. \"You have no idea what it's like, Cas, okay? All this time and all those other people, none of them matter. Sam was...I loved him, Cas and he's gone,\" she whispers. \"Could you just get over it if Dean died?\"\nDean starts backing away towards the mirror. He shouldn't be seeing this. He shouldn't be seeing the pain in Castiel's eyes, the very idea of Dean's death dragging his whole posture down with sorrow. These two share a history and an affection not connected to Dean. This Jess' grief over her lost lover isn't for him to witness.\nThe man she lost is not his Sam. His Sam is alive and well.\nJess looks away from Castiel's stricken expression. Dean frowns. Castiel's eyes hold more than mere sadness. Fear and panic crowd his melancholy.\n\"How does this mirror work?\"\n\"Jessica, no-\"\n\"Wait, you can't-\"\n\"Don't tell me what I can and can't do!\" She surges into Dean's space, determination etched into every line of her face. \"I saw your expression when you saw me. You looked like you'd seen a ghost. I'm gone, aren't I? I died in the fire instead of Sam.\"\n\"Jess,\" Dean says weakly.\nHer jaw clenches tight once, twice and then she nods.\n\"I'm going through.\"\n\"You can't just leave us,\" Castiel says, true devastation coloring his tone, making Dean's chest ache.\n\"I'm not...Cas, I wouldn't go without talking to Dean first,\" Jess says, turning back to him. \"You guys have each other. I'm not saying I won't miss the hell out of you,\" she says with a watery chuckle. \"We've been hunting together for three years. I've been with Dean for almost seven! I wouldn't just leave like that,\" she promises and Dean watches in fascination as she lays her forehead against Castiel's. He had no idea Castiel could have a relationship like this. \"But it's Sam. You'd go if it were Dean,\" she murmurs.\nAnd it's true. Dean knows it's true deep down with the same certainty as death and taxes and his love for Sam.\n\"Jessica,\" Castiel murmurs. \"I don't want you to go.\"\nHis arms encircle her, pulling her into an embrace that speaks of love and...family. Guilt squeezes around his chest like heavy iron bands. If he'd never come here, she'd never have known. He's breaking up Castiel's little family.\n\"Jess,\" he starts, but when she looks up at him, Dean pauses.\nThe hope in her eyes eases the tightness in his chest.\n\"Good luck,\" he struggles to say and then he touches the glass.\nDean isn't a fan of God, but as the mirror whisks him away, he can't help shooting a fervent prayer into the void.\nHelp her find him.\n*******************\nDean doesn't care if this is a reality where he's a hermaphrodite and Castiel has tentacles, he's stopping for lunch. His stomach rumbles with hunger that isn't at all helped by the constant jolts of traveling pain. Dean's tired of stepping through the glass. He's tired of this ugly murky house. If nothing else, he wants some fresh air.\nThere's no one waiting for him in this world. It's disconcerting, but since it happened in the first reality, Dean tries not to worry about it as he makes his way out of the room. God, he hopes this isn't a world with a dead Sam or psycho Castiel or something equally horrifying. He's committed himself to this world. He doesn't want to have to turn around and sprint back to relative safety.\n\"Oh.\"\nCastiel is standing at the foot of the stairs, apparently monitoring the area while his other self and possibly Sam do some scouting. Dean's not entirely sure.\n\"Cas?\"\nHis head tilts so far to one side, Dean seriously worries it's going to topple off his neck. An emotion Dean strongly suspects is wistfulness flares in his chest. Stupid nerdy angel.\n\"You are...?\"\n\"Yeah, it's me. Same as your Dean. Or DeAnna,\" he adds, jerking his thumb over his shoulder. \"I came out of the mirror. Long story. Hey, listen, could you take me somewhere to get something to eat?\"\nIt's not fair to expect each new world's inhabitants to be up to speed on the situation, but Dean refuses to let that moment of shocked disbelief linger. Castiel is an angel and Dean's seen crazier shit than this his entire life. Getting with the program should be a quick process for everyone involved.\n\"Another reality?\" Castiel studies him. Soon enough, Dean sees that familiar moment of understanding clearing the confusion in Castiel's eyes. \"Why are you here?\"\n\"I didn't mean to. I'm trying to find the way back and before you start, you can go ask your brothers later. I'm hungry. Where is other me anyway?\"\nCastiel nods to a door. \"You required a bathroom.\"\nThey've been talking for about three minutes. Add the at least two minutes it took Dean to run into Castiel and he has a pretty good idea of how this reality worked out.\n\"I'm a chick, aren't I?\"\n\"You are female, yes,\" Castiel confirms.\n\"Are you fucking her?\" Castiel's brief confusion makes Dean roll his eyes. \"Not currently, dumbass. I mean, are you a couple?\"\nAnyone else might not see the slight irritation that darkens Castiel's eyes. It's probably not a good sign that Dean feels absurdly proud he can.\n\"Yes.\"\nAwesome. So he gets prolonged exposure to this disturbing love affair. The only saving grace is that it's DeAnna and not Dean. He's just not ready to watch himself mack on Castiel for more than five minutes together.\n\"Well, could you tell me to hurry the fuck-\"\nDeAnna walks out of the bathroom before Dean even finishes his sentence. True to form, she's dressed in that same jeans and t-shirt combination from the other worlds. The only significant difference to her outfit is the shining silver band on the ring finger of her left hand. Dean's heart skips a beat.\n\"Are we engaged?\"\nShe crosses her arms over her chest and raises an eyebrow at him.\n\"I don't remember inviting anyone else into this relationship,\" she says before glancing to Castiel. \"Who is this clown? One of your brothers?\"\n\"Hell, no,\" Dean snaps.\n\"He is you.\"\nWhich, of course, leads to the requisite explanation. Luckily, Dean/DeAnna have pretty much always believed everything Castiel has ever told them. So it's not long before her annoyed suspicion turns to shock and then to intense curiosity.\n\"Awesome,\" she says as she gives Dean a good once-over. \"I'm a pretty hot guy. Right, Cas?\"\n\"So anyway,\" Dean hurries to say before Castiel can answer. \"I've been traveling through realities for a couple of hours now and I'm fucking hungry.\"\n\"God, me too,\" she says. \"Let's go eat at that one diner.\"\nDean knows the one. They ate breakfast there what must be nearly half a day ago. It sounds perfect. But then, anything sounds good right now.\n\"Well, then, if DeAnna is taking you to eat, I should go consult my brothers,\" Castiel says. \"I'll return shortly.\"\nAnd of course, he has to collect his kiss before he can go. Who knew Castiel was such a sap? DeAnna's cheeks are slightly red when he pulls back, but Dean just shrugs.\n\"Angels,\" he says.\n\"Seriously,\" she agrees. \"C'mon. We'll have to swing by and pick up Sam and Mark.\"\n\"Who the fuck is Mark?\"\nIdeas whirl through his mind. Another hunter? Another unknown cousin? One of Castiel's brothers? Sam's new boyfriend? He snorts at the last idea, but his grin falls away when he catches the odd troubled look on DeAnna's face.\n\"What?\"\n\"Well, it's just...I guess it makes sense since you're a dude and Castiel is a dude, but god, that sucks that you don't have Mark,\" she says, her mouth turning down at one side like it does when Dean's trying not to let something bug him even though it really really does.\n\"Okay,\" Dean says uneasily. \"So who he is?\"\n\"My son.\"\n*******************\nIt's unsettling not driving the Impala. A part of Dean wants to demand that he drive his own car, but his rational mind knows it's not his place. This particular beauty is DeAnna's and despite being a girl, she knows how to handle her just fine. Given that the car's also in great shape, Dean figures Dad didn't give a shit that he had a daughter instead of a son. There's something pleasing about that notion.\nHowever, there is nothing pleasing about the idea of a version of himself giving birth.\nDean's not stupid. DeAnna's a girl. She's got girl parts and presumably at least a hint of the desire to procreate. Dean knows the basic rules of upkeep for a female body, but the actual practice of dealing with birth control and...all that other stuff freaks Dean the hell out.\nBut whatever. It's weird, but no big deal.\nIt's the stupid low gut-wrenching jealousy that makes Dean want to stab out his own eyeballs.\nNot jealousy that he can't get pregnant because really, Dean's just fine and dandy with that part. But Dean knows himself well enough to understand how badly he wants a family of his own. So badly that he tried to force his way into a family where he didn't fit. And here this version of Dean got that without any fuss. With someone she actually loves.\nDean can't exactly do that with his own Castiel.\n\"So hey,\" he blurts, eager to turn his thoughts to happier topics. \"How old is Mark?\"\n\"Six months,\" she says.\nDean shivers. He can't ever think of six-month old babies without getting a prickle of fear up his spine.\n\"Dude, I know,\" DeAnna says, nodding in sympathy. \"On his six-month birthday, I stayed up all night long and I made Cas stay with me too. But nothing happened.\"\n\"Does Cas leave a lot at night?\"\n\"Well, no, but he thought I was being 'overly cautious',\" she says in a fairly decent imitation of Castiel's gruff monotone.\n\"Fuck him.\"\n\"That's what I said!\"\nThey share an amused glance. It's almost like having a twin sister. An extremely close twin sister that lives inside your head, but a sister nonetheless. Even presented with the evidence, Dean has a hard time thinking of this person as his exact copy and not just because she's a woman. She's had her own life experiences, things Dean's not done and vice versa.\n\"So I don't get it,\" he says. \"Why'd you even have a baby?\"\nStarting a family while hunting isn't unheard of. But Dean can't imagine he'd be ready for a kid after only a couple of months of being with Castiel.\n\"We didn't mean to,\" DeAnna admits. \"We're usually better about condoms and all that shit, but there was a really bad hunt awhile back and I thought Cas died.\"\nDean winces. He will never get used to that particular feeling.\n\"Yeah, it sucked balls and when he was okay, I kinda went crazy on him. And nine months later, I had Mark.\"\nThat figures. If Dean Winchester were going to get pregnant, it would be because of fear-fueled absentmindedness.\n\"Is he all the way human?\" he asks, thinking of the pregnant Castiel and the child he'd called a 'hybrid'.\n\"Well...mostly. He has a human soul, according to Castiel. He says that since he's alone in the vessel, the body is fully joined with his grace. Or some shit like that. Anyway, the point is, Mark might be a little angelic, but we're not sure how. The only thing he really does that's weird is mind-meld with Cas.\"\n\"Excuse me?\" Dean asks, his voice going somewhat embarrassingly high on the last word. DeAnna snorts with laughter.\n\"Yeah, tell me about it. With me, he's a normal baby. Cries when he's hungry or whatever, but when Cas is around, they just kind of stare at each other and he knows what Mark needs. It's not like he's talking to him. Just sort of...sharing impressions is how Cas explained it,\" she says. \"Anyway, I could give a shit how it works. I just know it's awesome at 2 o'clock in the morning when I haven't got a clue what's wrong with him.\"\nIt does sound rather convenient. So maybe there are perks to being in a relationship with an Angel of the Lord.\n\"And you left him with Sam,\" Dean says, smiling fondly. \"Uncle Sammy...wait, Sam's a dude, right?\"\nDeAnna gives him a curious look. \"Yeah. You've seen Sam as a girl? An actual girl and not just a man-child that acts like one?\"\nDean grins.\n\"Awesome. And yes I have. She's got huge tits.\"\n\"Figures,\" DeAnna says.\n*******************\nDeAnna calls Sam ahead of time and explains the situation. Dean hears his tinny exclamation of surprise through the phone followed by about 47 million questions. DeAnna finally tells him to shut up and hangs up on him. It's good to know that some aspects of their relationship remain the same.\nSam meets them at the door of their motel room and when he sees Dean, his lips part in surprise.\n\"I wasn't ready for this,\" he says as he stares at Dean like his head's on backwards. \"This is so weird.\"\nIt is weird. Dean isn't accustomed to his little brother looking at him without a hint of recognition.\n\"Snap out of it, Mongo,\" DeAnna says. \"Where's my kid?\"\n\"In the crib,\" Sam murmurs, his eyes still locked on Dean's face. His fascination is both annoying and so very Sam.\n\"Hey,\" Dean says. \"I said, snap out of it.\"\nSam blinks.\n\"Dean, c'mere,\" DeAnna calls from inside the motel room. \"Mark's got that half-asleep drug addict thing going on. It's hilarious.\"\nDean takes a deep breath, but it does nothing to steady his nerves. DeAnna had nine months of getting used to the idea before meeting her son. Dean's had half an hour. And no matter how much it might feel that way, Mark is not his child. Just an echo of another life. Of something that will never be his.\n\"Dean?\"\nNow her voice sounds gruff and tense, the way it does when Dean's trying to hide worry. He shakes himself. In his life, he'll never know anyone as well as he knows this woman and yet they only just met. Because of the obvious differences between them, speaking to her is even more surreal than speaking to the male exact copy of himself.\n\"Yeah,\" he croaks and then walks into the room.\nDeAnna's holding Mark. For some reason, Dean almost expected her to look awkward, but Mark fits as well in her arms as Sammy always did. Dean really needs to work on accepting that he's good with children.\n\"Well, this is him,\" DeAnna says. \"D'you want to hold him?\"\nHis chest aches with a melancholy sort of desire. He nods and holds his breath as DeAnna carefully transfers Mark into his waiting arms. As he looks down into sleepy blue eyes, all Dean can think is this is Castiel's kid.\nThe ache grows.\n\"Hey,\" Dean says quietly. Mark is still so little. Totally reliant on DeAnna and Castiel. And at that moment, on Dean. He feels incredibly powerful.\n\"Well, he's not crying, so that must be a good sign,\" DeAnna jokes.\nMark watches Dean closely. That can't be normal. Dean could swear the kid looks confused. He wonders if Mark is doing a weird half-angel scan on him and trying to figure out why Mommy is a boy now.\n\"He looks like me,\" Dean comments, the words squeezing past a nearly closed throat.\n\"Yeah?\"\n\"When I was this age, yeah. Like the pictures of me. But that's Cas' nose.\"\nThe shape of his face and those sweet drowsy eyes are pure Winchester, but the nose is a carbon copy of Castiel's and how weird is that? A child in any reality with Dean's smile and Castiel's nose and who knows which of their personality traits. He could grow up to have Castiel's intensity and Dean's charisma and maybe a bit of Sam's geekiness. Their good qualities would make a great kid, Dean decides as he bounces Mark lightly in his arms.\nMark suddenly yawns and Dean's heart nearly stops.\nDeAnna laughs.\n\"No wonder Sam teased me so much when he was born,\" she says. \"I acted like a fu-...like an idiot every time he did something new.\"\n\"Cas was worse,\" Sam chimes in. \"His entire body vibrated with silent excitement every time Mark moved a muscle.\"\nIt's not right how easily Dean can imagine Castiel doing that.\n\"Yeah, Mark's made us all complete morons,\" DeAnna says fondly.\nDean smiles. He can easily imagine that too.\n*******************\nCastiel returns right after they take their seats at the diner. Somehow, DeAnna's got him trained well enough that he actually uses the door like a regular person instead of appearing out of thin air. He'd ask her how she did it, but Dean suspects it has to do with tits and ass and he's not ready to consider that sort of step with his Castiel.\n\"I'm sorry, Dean-\"\n\"Yeah, yeah,\" Dean interrupts him, but without any heat to his tone. \"You guys have no idea what's going on.\"\nCastiel's expression of regretful concern is more comforting than Dean would have thought. He takes a seat beside DeAnna and spares a slight smile for the baby tucked in her arms.\n\"Hello, Mark,\" he says. His smile grows when Mark's tiny arms flail and reach for him.\n\"Hey, Dean, watch this,\" DeAnna says as she hands Mark to Castiel. \"Do the face, Cas.\"\nThe face? Already, Dean's amused. The concept of Castiel making a face to tickle a child, especially his own, is downright ridiculous and hysterical. Without realizing he's doing it, Dean leans forward to get a better look. Castiel carefully arranges Mark in his arms and lifts him until their faces are level. For a long moment, Castiel only stares blankly at Mark and then suddenly, he takes in deep breath and puffs out his cheeks as far as he can. It's the only thing he changes about his face and the instant it happens, Mark breaks into peals of shockingly loud laughter. A few heads turn their way, each stranger with a fond smile for the young father and the adorable baby laughter.\nDean hates the way it makes his heart pound.\nNot his baby. Not his Castiel.\nBut if not the baby, Castiel would be yours, his brain reminds him.\nNot if I don't get home, Dean snarls back.\n\"You really have no clue what the mirror is made from?\" Dean asks, ignoring Sam's jolt of surprise at Dean's clipped tones. As well as DeAnna's knowing look.\nCastiel's cheeks flatten.\n\"I've never seen anything like it. It's power is strong, but foreign to me. I examined it closely and found no markings on it. The frame itself is made from ordinary wood, but the glass is a substance I've never encountered before,\" Castiel explains, bouncing Mark gently in his arms to ease a bit of fussing. \"My natural instinct is to warn you away from it altogether, but I think I know DeAnna well enough to know you won't do that.\"\n\"I can't,\" Dean says, shaking his head. \"I can't just leave my Sam and Cas.\"\n\"Yeah, you better not,\" Sam says. \"Cas is a big baby without you.\"\nHis tone lilts upwards. An obvious attempt to lighten the mood. One that Dean allows. He grins and rolls his eyes and if it doesn't show true joy, no one comments on it. They let the conversation turn to differences and similarities in upbringing as lunch progresses. Dean laughs when he learns that they lost their virginity to same girl, who apparently couldn't resist the allure of Dean Winchester, no matter his form. The quickly squashed flash of jealousy in Castiel's eyes over the topic sticks in Dean's mind, but he doesn't call Castiel on it. Instead, he focuses on DeAnna and Sam, even on Mark.\nIt's just too weird to look at Castiel and see the same deeply abiding love on his face that's there when Cas looks at DeAnna.\n\"Do you have to go back right after lunch?\" Sam asks. \"You could stay the night and get some rest.\"\nSam's familiar worry makes Dean smile.\n\"Nah, I'm not tired. I just want to go home.\"\nAnd I can't take much more of this, he thinks as he watches Castiel gently put Mark back in DeAnna's arms so he can go pay the bill.\n\"In fact, I better get going,\" he says.\nDeAnna apparently understands what Dean needs because she slides out of the booth and jerks her head towards the door.\n\"Come on. I'll drive you back now and save you the big dramatic goodbye,\" she offers.\n\"Oh,\" Sam says, disappointed.\n\"You wanna trade me in already, Samantha?\" DeAnna asks with a frown.\n\"Shut up! It's interesting. And it's you, but not-\"\n\"I get it, Sammy,\" Dean cuts in. The poor guy looks so flustered and upset that Dean gives him a short impulsive hug. \"I'll see you around, I'm sure.\"\nThen he slips out the door without a backwards glance.\nIt takes DeAnna a few moments to strap Mark into his car seat. When she climbs in beside him, Dean can't look her in the eye.\n\"I'll explain it to him,\" she promises. \"He's used to the Winchester method of dealing with emotional trauma.\"\n\"It's in every world,\" he whispers. \"Every world I've gone to, it's me and Cas. In some form or another. Except mine.\"\n\"So you're slower.\" She starts the car and pulls out of the lot. \"You'll get there. If you're freaked out about it, tough shit. Falling in love with an angel is stupid, but we're stupid,\" she says with a shrug. \"If you're worried about the fact that you like dick, all I can say is...dicks are awesome.\"\n\"Wow,\" Dean says, finally turning to look at her. \"I really have a way with words.\"\nShe grins. \"Play with the baby. You only have a few more minutes.\"\nDean obeys. On the way back to the mirror house, he stays turned in his seat, making faces at Mark and letting him grasp one of Dean's fingers in his tiny hand. Being the focus of all the trusting love is so damned addictive that Dean finds himself wishing he and Castiel could adopt. The change this journey is creating in him doesn't strike Dean until after he waves goodbye to DeAnna and Mark.\nHe's seriously thinking about Castiel and kids.\nThe thought is firmly shaken off. No reason to freak out yet. He's got to find a way back to his world first.\nTurning, Dean trudges into the house and back up the stairs to his next chance.\nWhen Dean stumbles through mirror, he is facing himself again, complete with the gun pointing at him. There is sadly a lack of beautiful pregnant Castiel.\n\"Don't shoot,\" Dean says, hands held high. \"I'm not a monster, I'm you. Get Cas and he'll tell you.\"\nDean seriously considers whether he could fall back into the mirror again before other Dean takes a shot. If he's here, this obviously isn't the right universe. But then other Dean says something that confuses him into forgetting that course of action.\n\"I don't know anybody named Cas,\" he snarls as he cocks the gun. \"What are you?\"\n\"What do you mean, you don't know Cas? Castiel? Nerdy angel guy? Or maybe a cute blond chick?\"\nAnnoyed confusion crosses other Dean's face.\n\"Which is it?\"\n\"I don't know,\" Dean grumbles. \"It changes in each world. I don't understand. How could you not know Cas? Who dragged you out of hell?\"\nHis confusion erupts into shock that truly worries Dean. There's no way. He can't have found a world where Dean didn't make the deal to save Sam. A sick suspicion settles in the pit of Dean's stomach.\n\"Where's Sam?\"\n\"You listen here,\" other Dean snarls, thrusting his gun further in Dean's face. \"I don't know any Cas or Sam and I sure as fuck don't know any angels.\"\nOkay, whoa. Dean's head hurts with the truth of what the other Dean is telling him. A life lived without Sam. Without the stupid annoying little brother that this Dean couldn't live without. He stares at the other Dean. Who is he without Sam?\n\"You don't have a brother?\"\n\"Yeah, I'm through talking.\"\nOnly instinct and a healthy understanding of his own mind keeps Dean alive. He sweeps out his foot and lunges towards himself. The other Dean's surprise at his sudden motion gives Dean the split second he needs to knock the gun away. Other Dean does not stay off-guard for long though. He tackles Dean to the ground, kneeing him hard in the stomach. Pain radiates through Dean's entire body, but he fights through it, punching and kicking as much as his other self.\n\"Stop...it...\" he grunts, curling a leg around other Dean's waist and throwing every ounce of his strength into flipping them over.\n\"Fuck you,\" other Dean spits.\n\"Yeah, yeah,\" Dean mumbles, holding other Dean down with one arm across his throat and rifling through his pockets.\n\"Whoa, hey. Dude, I know we're hot, but that's too freaky, even for me,\" other Dean pants as he struggles to throw Dean off. His words more than his actions very nearly succeed in breaking Dean's concentration. It doesn't sound much like he's joking. Like maybe he's all too used to finding guys hot.\n\"I'm getting at your holy water,\" Dean explains.\nHe finally grasps the metal flask and draws it out. Other Dean stops fighting and stares up at him in wary understanding.\n\"Cheers,\" he says before tipping the flask and swallowing. He tosses the flask aside and while other Dean is contemplating him, he drags out his own silver knife and with an annoyed huff, carefully slices down the center of his palm. It smarts like hell, but it's worth it to see some of the suspicion ease out of other Dean's eyes.\n\"Not a demon or a shape-shifter or any other monster, okay? I'm you.\"\nOther Dean abruptly rolls to the side, taking Dean along with them until their positions are reversed. The breath whooshes out of Dean's lungs. His body is fucking heavy.\n\"Okay, fine. I believe you're not a monster. Not sure I buy the other shit. Tell me about Cas and Sam.\"\n\"Sam's my brother,\" Dean wheezes. \"He was born in 1983. A few years back, he died and I made a deal to bring him back to life. A couple years after that, an angel named Castiel saved me from Hell. We're hunters together and I'm trying to get back to them through that mirror,\" he says, jerking his head towards the mirror.\nOther Dean sits back, his ass uncomfortably close to Dean's crotch.\n\"Angels? Seriously?\"\n\"Yeah, I know. I didn't believe it for a long time either, but...it's real.\"\nHe doesn't even consider telling other Dean about the whole mess with Lucifer and the Apocalypse. It's just too unbelievable. Not to mention that Dean wishes he didn't know. No reason to torment this other Dean.\n\"Why would an angel care about you?\"\n\"I have no idea,\" he says honestly. \"But he's my...friend, I guess.\"\nOther Dean snorts as he climbs off Dean's lap. The bitterness etched along his features depresses Dean. But what other feeling could this Dean possibly have? Alone all his life, obviously out hunting by himself. It's a terribly lonely life. Dean's lucky to have Sam and now Cas. There's no reason for loneliness now.\nWhich is...not something he'd realized yet.\n\"How did you start hunting anyway?\" Dean ask, frowning. \"If Sam wasn't born...well, the way it happened to me, Dad wouldn't have gotten into hunting.\"\n\"Dad? Dad was never a hunter,\" other Dean says with a matching frown. \"Demons kidnapped him when I was 11 and Mom got back into hunting to find him.\"\n\"Did she?\" Dean asks quietly.\n\"Yeah, but...she was too late. Anyway, she got me into it before she died and...\" He holds out both arms. \"Here I am.\"\nZachariah had a good point. Dean really does always find his way back to hunting. Even without Sam or his father, it still happens. His destiny to save lives and search out evil things.\nThe universe has so many things to tell him.\n\"You better get back to it,\" other Dean says, nodding to the mirror and it's a concession. Dean knows there are still doubts in his other self's mind and yet he's letting Dean go without any more fight. But as Dean picks himself off the floor and dusts off his pants, he realizes he doesn't want to leave other Dean alone. Not when he knows someone who could so easily make him happy.\n\"Just...hold on.\" Please be out there. \"Cas? Castiel? Could you...just...get your ass over here?\"\nOther Dean is thoroughly bewildered. Dean just hopes that Castiel doesn't try to visit in his true form.\n\"Cas?\"\n\"Yes?\"\nBoth men spin around to see that very familiar face. The same old Cas with his dark staring eyes and ugly trench coat. Dean's heart twinges.\n\"Hey, Cas. It's...uh, well, I'm Dean Winchester.\"\n\"Me too,\" other Dean chimes in.\nCastiel looks from one Dean to the other, his expression the same hard cold one Dean remembered from when they first met. Whatever's been happening to Cas, it's clear he hasn't learned much about human emotion. Dean wonders if this was a mistake.\n\"You have evidence of my Grace in your soul,\" he says to Dean.\nOther Dean raises an eyebrow at him.\n\"From saving me from hell,\" he explains and other Dean nods as if it makes sense. Dean has a feeling he's just going with the flow now.\n\"I did not save you from hell,\" Castiel objects. \"I saved Gregory Trent from hell.\"\n\"Who? Wait, no, don't tell me. The righteous man?\"\nCastiel nods.\nWhite hot jealousy blisters through Dean's entire being. Another righteous man forming a bond with Castiel. Another man traveling with him and growing close with him. The anger must show on Dean's face because his other self elbows him and says, \"Dude, are you okay?\"\n\"Are you fucking him?\" Dean growls. \"Gregory?\"\n\"Of course not,\" Castiel says, offended. \"He has a wife and child.\"\nOh. That takes the winds out of Dean's sails. He glances at other Dean.\n\"You fuck guys?\"\nOther Dean nods.\n\"Of course.\"\nRight. Obviously. With some difficulty, Dean overlooks that point and turns to Castiel.\n\"Look, he can explain about his life and I got a feeling you're stuck here, am I right?\"\nAnyone else might not notice it, but Dean knows Castiel too well, even this version that never saved him from hell or discovered emotions. He sees the pain and the wash of sadness in those glittering blue eyes. This Castiel is as alone as the Dean standing beside him. The truth of the matter hits Dean so hard, he releases a breathless laugh.\nThey so obviously need each other.\n\"Cas, this is Dean. Dean, this is Cas. Good luck.\"\n\"What-\"\n\"I do not understand-\"\nBut Dean's backing away, reaching behind him towards the mirror.\n\"It'll make sense, I promise,\" he says before touching the glass and being whisked away.\n*******************\nDean really hates it when he can immediately tell he's not in the right world. Sometimes he retouches the mirror immediately, catching only a glimpse of shock on his own face or the female version of the same. But even so, when he steps out of the mirror once more and sees this version of DeAnna facing him, he can't help stopping.\n\"What the hell?\"\nInstead of the t-shirt and scruffy jeans look, DeAnna is wearing a dark green sweater that fits against her curves to perfection and a pair of really nice blue jeans. Maybe even designer jeans, Dean has no idea. The point is, she looks amazing in that outfit. And the look is completed with long shiny brown curls cascading down her back and impeccably done make-up. As far as Dean knows, they don't have curly hair and they certainly don't naturally have make-up, so it looks like DeAnna spent hours getting ready that morning. And it works well for her.\nShe's stunning.\nHe knew she was a good-looking woman, but this version could have stepped off the cover of a magazine. Dean had no idea his female self cleaned up so well. He wonders whether the same could be said for him if he ever changed out of his flannels and jeans.\nStill, hot girly look or not, her instincts obviously remain the same because the moment she sees Dean standing there, she's got a gun pointed at his chest.\n\"What are you?\"\nLuckily, the usual rigmarole is expedited by the presence of Castiel, who touches DeAnna's arm and says, \"No, don't hurt him, De.\"\nDe?\n\"Give me a good reason,\" she orders, though Dean notices her body relaxes significantly under Castiel's touch. Obviously another example in the great universal message that Dean and Castiel like fucking each other. He sighs. Really, he understands now. He'd just like to go home.\nDean listens idly as Castiel explains once more who he is and what's going on. Midway through DeAnna's disbelieving rant, Samantha appears in the doorway and the whole process begins again. Dean literally can't believe how epically hot Samantha is. Even with DeAnna's new look, she's got nothing on her sister and yet, Dean's actually more attracted to DeAnna than he is Samantha.\nWhich is a disturbing and kinky thought.\nAt any rate, seeing Samantha with her curtain of glossy brown hair and skintight tank top that reveals way more of her chest than is strictly necessary physically exhausts Dean. He's relieved he ended up with a goofy Sasquatch to protect instead of this Amazonian beauty. The tiny women Sam favors are way less threatening than the muscle-bound idiots Dean's sure Samantha attracts.\nWell, unless they're demons.\n\"Can I just ask you something?\" Dean interrupts. The other three stop bickering and face him, Castiel with that old familiar head-tilt that gives Dean a painful jolt of homesickness.\n\"What?\" DeAnna says, not unkindly, though her suspicion remains.\n\"Who taught you to put make-up on?\"\nHer surprise is palpable.\n\"Excuse me?\"\nDean gestures at her face. \"You know, the make-up. Looks really nice and I've been through about ten versions of you who didn't wear any, so I was wondering who taught you how to put it on.\"\n\"Um, Mom?\" she says with a 'no duh' tone.\n\"Mom? Did Dad...?\"\n\"Died. In the nursery,\" Samantha says, both girls now wearing matching frowns, but all Dean can do is smile and look away as odd tears itch behind his eyes.\nThe exact opposite universe. Instead of John Winchester and his boys hunting through the countryside, it was Mary Winchester and her girls. John raised DeAnna as a boy because he obviously didn't know any different, but in between teaching them how to shank demons and salt corpses, Mary must have taught her daughters all the stuff women know about hair and makeup. Dean remembers how good Mary looked even when hunting. Dean believes even his female self wouldn't care so much about her appearance, but if making herself pretty reminded her of good times with her mother, Dean knows she'd do it religiously.\n\"I take it things are different in your world,\" DeAnna ventures.\nDean just nods. \"Hey, do you...I don't know...\" He breaks off with a short laugh. The change is such a small one. Unlike the last Dean, who's mother never had Sam, this Mary is almost the same person. \"I'll trade you stories about Dad for ones about Mom,\" he finally says.\nThe bright eager smile DeAnna gives him makes her even lovelier.\n\"Deal.\"\n*******************\nThe sunlight glowing weakly in the dusty window of the mirror room flows across the floor at the same angle as ever. Despite the fact that Dean spent hours talking himself hoarse with DeAnna and Samantha, it's still around one o'clock in the afternoon the previous day when he steps through into the next world. So very weird, but Dean doesn't have much time to ponder it because he's immediately distracted by the presence of a strange woman.\nIt's not DeAnna, Samantha or Castiel's female vessel. She's a short well-built black woman with a gorgeous mass of curly hair and she's wearing a tight skirt that reveals a pair of shapely legs. She reminds Dean a little of Cassie, but the combination of sharp humor and smug conceit shining in her dark eyes ends the comparison thoroughly.\n\"Um...hi?\"\n\"Oh, this is too good,\" she says, turning her head to shout down the stairs, \"Yo, Sammy! You gotta see this!\"\nThere's a loud clomping sound indicative of Sam's heavy ass running up the stairs.\n\"Who are you?\"\nThe woman ignores him in favor of watching Sam walk into the room, his expectant smile turning to confusion.\n\"Dean? I thought you were staying in with Cas? How did you even get up here?\"\n\"Not quite, babe. Try again,\" the woman says. The way she speaks to Sam and the way he looks at her both speak of familiarity. They are clearly longtime friends, if not more. It bugs the hell out of Dean that he doesn't recognize someone who knows Sam so well.\n\"Okay, I don't get it,\" Sam says after just a moment. \"What's going on?\"\n\"Yeah, I'd like to know that too,\" Dean says irritably. \"Who the hell are you?\"\n\"That's not a comforting sign,\" she comments without any real concern. \"Or else I've got a different vessel in your world.\"\n\"World?\"\n\"Vessel?\" Dean exclaims over Sam's question. \"You're an angel? Wait, hang on...\" Her smirk is suddenly excruciatingly familiar. \"Gabriel?\"\n\"The one and only,\" she says with a wink. \"Let me guess. I'm either this vessel's male form or...maybe you know me as a shrimpy brown-haired person? The female version didn't suit me and I decided against using a male when I vacated Heaven. Men are so much easier to control when you're a sexy female,\" she confesses.\n\"Hey,\" Sam complains.\n\"Sorry, sweetheart, but it's true,\" Gabriel says as she reaches up to pat Sam's cheek. \"But don't worry; I still love you best.\"\nDean's thoughts screech to a halt. The words might be teasing, but the emotions behind them aren't. When Gabriel says she loves Sam, she really means it. And judging by the way Sam blushes and nuzzles ever so slightly against her hand, he really likes hearing it.\nOh god, his brother is fucking Gabriel.\n \n*******************\n\"Will you stop looking at her like that?\" Sam snaps.\n\"He can't help it,\" Gabriel says. \"He still can't quite grasp the concept that angels don't have genders.\" She leans over to Sam and says in an exaggerated stage whisper, \"This Dean isn't knocking boots with Castiel yet.\"\n\"Uh, look, I think-\"\n\"Really?\" Sam exclaims in amazement, interrupting Dean. \"Is he from the same time in the other dimension?\"\n\"Oh yes,\" Gabriel confirms. \"He's just duller, I think.\"\n\"Hey!\"\n\"I'm only teasing, of course. You're both equally dull.\"\nFor a second, Dean considers fighting with her, indulging the instinct to defend himself from Gabriel's brand of schoolyard insults. But really, she's not the Gabriel he knew. Obviously this is the wrong dimension. No reason to waste his breath.\n\"Be nice,\" Sam scolds\nDean smiles, pleased to know that even a Sam who's fucking Gabriel still has Dean's back. And then Sam proceeds to whirl on Dean and totally lose any points he's earned.\n\"And what's wrong with Cas? You're not still being an asshole to him, are you? He deserves better than that,\" he lectures. With his arms crossed over his chest and his angry tone, Sam reminds Dean of someone's nagging wife. Another thing that obviously never changes.\n\"Look, I know you're Sam, but things are different back home,\" Dean says, even though Sam's right. Dean has been an asshole to Castiel and he's not even sure why. Just that Castiel drives him so crazy and it pisses Dean off. Maybe even more than pisses him off. But Dean doesn't like to dig too deeply under the easier anger to the more difficult emotions hiding beneath.\n\"Different how?\" Sam challenges.\n\"He's lying,\" Gabriel butts in. \"Have you worked out why you're traveling through all these dimensions yet?\"\n\"What? There's no...it's just random,\" Dean says, but as soon as he says it, he feels the untruth of the statement. The worlds haven't been random at all. Not when there's so much that could be different. Worlds destroyed by war or famine. Worlds where this building doesn't exist or the mirror had moved to a museum or who knows, the house is under miles of water. Or smaller changes. He could have found world after world where Dean and Sam never hunted, worlds where they were both long dead or criminally insane. Any number of changes and all Dean gets with few exceptions are worlds where he and Sam both exist as hunters in this very building.\nWorlds where Dean and Castiel are a couple. Even if the universes aren't lying and there's no being in existence more perfect for Dean than Castiel, there still must be worlds where Dean's too stubborn or Castiel too cold or Dean already married or Castiel unwilling to cross the line into human romance or just anything. But Dean's not seen a hint of those worlds. All he's seeing are the one's where Castiel makes Dean smile simply by holding his hand. Where they've started a family or are standing in the glow of new love or are actually fucking there in the mirror room.\n\"Yeah, now you're thinking,\" Gabriel says with a devious smile Dean's never trusted, not on her or her male counterpart. \"Sounds like you still haven't quite gotten there yet.\"\nThen she snaps her fingers and the mirror room disappears around them.\n\"What the fuck, Gabriel!\"\nDean sighs. That's a too familiar voice. He turns around to see his counterpart half-naked and tangled up with Castiel on the bed. Unlike the last time Dean saw his male copy fucking around with Castiel, Dean's captivated by the image they present. Castiel flat under Dean's body, his cheeks flushed red and his hair made wild by Dean's fingers. His hands clutch at the other Dean's ass and the sight of it makes Dean's dick twitch and start to ache.\n\"What the hell is this?\" the other Dean snaps as he climbs off Castiel and grabs his shirt.\n\"It's you,\" Sam answers. \"From another dimension.\"\n\"What?\"\n\"It's true,\" Castiel says, faintly surprised. \"He carries the mark of my Grace on his soul.\"\nThe ache in Dean's groin only worsens at Castiel's desire wrecked voice. The other Dean's feelings aren't nearly so pleasant.\n\"Are you fucking kidding me? That's not possible,\" he complains as he shoves his shirt down over his head.\n\"Oh but it is,\" Gabriel says, her voice now bored. \"And he needs to ask you about gay panic. We'll give you a moment alone.\"\nAnother snap of her fingers has the room empty save the two Deans.\n\"I really hate it when she does that,\" other Dean grumbles.\n\"Does she do it a lot?\"\n\"I take it your Gabriel is less of a total bitch?\" other Dean asks.\nHe shrugs into a plaid button down Dean recognizes. His amusement at the little detail helps ease Dean past the awkwardness of other Dean's question.\n\"Not really,\" he answers vaguely. \"Never trapped me alone with myself though.\"\n\"Well, that's new, I gotta say.\"\n\"You're being really calm about this,\" Dean comments.\nOther Dean shrugs. \"Cas believes it,\" he says as though that's the only proof he needs. It only takes half a moment of thinking for Dean to realize it's all he would need as wel. No matter how much they've fought or how angry they've gotten, Dean always immediately accepts whatever Castiel tells him.\n\"C'mon.\" Other Dean sits in one of the motel chairs and gestures to the other. \"The sooner we get this over with, the sooner I get some ass,\" he says.\nThe quiet glow of jealousy in Dean's chest doesn't even faze him. That alone should prove that he doesn't need this stupid conversation, but Dean suspects Gabriel won't let him go until they talk. Angels are such assholes.\n\"So let me guess,\" other Dean says. \"You wanna screw Cas, it freaks you out, you're being a dick to him and are generally miserable.\"\n\"I'm not miserable,\" Dean denies with an annoyed frown. \"As matter of fact, things are better than they've ever been.\"\nIt's true. With Sam safe and intact and Castiel hunting alongside them on regular cases, Dean had been enjoying his life before the mirror stole him from it. If it wasn't perfect, it was still massively better than anything he'd been experiencing in the previous six or seven years.\n\"Yeah, I thought so too. Look, I'll save us some time. It's gonna be weird. You're gonna miss tits and pussy and you're gonna hate the way people look at you when Cas wants to hold your hand in public, okay? Get used to it,\" other Dean says bluntly. His lack of sympathy doesn't surprise Dean in the slightest.\n\"Gee, thanks.\"\n\"I'm not done, jack-off,\" he says, earning a snort from Dean. \"All that shit doesn't matter. You like dick, okay? We always have and don't even try denying it. Fucking Cas is a thousand times hotter than any chick you've ever known, trust me. And not just because he's got a tight ass. I won't ruin the surprise, but let's just say he loses his goddamn mind in the bedroom and he wants it all the time.\"\nThis conversation is doing nothing to ease Dean's creepy arousal.\n\"And even that isn't the most important thing.\"\n\"And what's that?\" Dean asks sarcastically. \"That I'm just so in love with him?\"\n\"Yes, asshole,\" other Dean says with a smug grin. \"You fucking worship the ground he walks on or you will if you get your head out of your ass and stop being a dick. And when those dipshits glare at you when you're holding Cas' hand, you won't care because he's happy and when you think about chicks, you'll remember you've never loved any of them half as much you love a weird little angel man.\"\nDean snorts again. Talking to other Dean is oddly like his inner monologue. Without the open declaration of love, of course. But the same attitude and profanity.\n\"Are we clear?\" other Dean asks.\n\"Yeah, I think that about covers it.\"\n\"Good because I had to bribe Gabriel to keep Sam out of my hair long enough to get some. I'm not wasting this afternoon talking to myself.\" He tips his head back and calls out, \"Yo, Gabriel. We're done here.\"\nFor the third time that day, the scene immediately changes. Instead of sitting in the motel room, Dean is standing with his back to the mirror. Before him stands Sam, Gabriel, other Dean and Castiel. Other Dean looks annoyed, but Castiel is watching him with frank curiosity. Heat flashes through Dean's belly. He quickly shoots his gaze to Gabriel.\n\"Am I ever going to actually get back?\"\n\"I hope so,\" Gabriel says, her voice uncharacteristically kind. \"I think maybe there's a few more miles to go before you sleep...you know, with Cas.\"\nDean rolls his eyes.\n\"Well, that's as good a place as any to escape you people.\"\n\"Good luck,\" Sam says.\n\"Remember what I said,\" Dean adds. \"It's worth it, I promise.\"\n\"Yeah, thanks.\" Dean looks at Castiel. \"You got anything to add?\"\n\"Tell my other self to take care of you,\" he says.\nThere's no way for Dean to wrap his mind around the emotions that statement dredges up in his chest, so he doesn't try. Instead, he buries the feelings and nods without saying a word, turning towards the mirror. Dean takes a deep breath.\nHere he goes again.\n*******************\nWhen Dean lands in the next dimension, he almost touches the mirror again right away because he sees his copy walking through the door at the other end of the room. But he stops short when he gets a good look at what his copy is wearing. A pair of green plaid shorts and a red t-shirt with what Dean thinks is one of those little mushroom guys from Mario Bros on it. His long hair hangs down into his eyes and he's wearing a pair of wire-rimmed glasses.\nWhat the ever loving shit is this?\n\"There you are!\" other Dean says. \"I've been looking all over the house for you. Cas says this place is a bust. He wants to break for lunch. C'mon.\"\nWithout waiting for a reply, other Dean spins around and clatters down the stairs. Dean doesn't even think before he follows. Screw this being the wrong dimension. He has to know what is going on. The answer to that question becomes even more elusive when Dean reaches the first landing on the stairs and a third Dean emerges from a room to the left of the foyer. Nerdy Dean stumbles to a halt and stares at this new Dean.\n\"What the hell?\"\n\"Who the fuck is that?\" New Dean asks, pointing his gun up the stairs at Dean.\nDean presses a hand to his temple. This situation is fast becoming confusing. Nerdy Dean flattens himself against the wall at the end of the stairs and shoots panicked looks between the two other Deans. His already pale skin blanches to near white.\n\"Cas?\" he calls out. \"A little help?\"\nTo Dean's great relief, Castiel immediately appears in the foyer, though his annoyed expression isn't a good sign.\n\"What's the matter, Will? What's taking so long?\"\nA small measure of clarity eases the confusion in Dean's mind. There aren't two Deans in this world. There's a Dean and...a twin? Probably. Having a geeky twin brother is actually kinda cool.\nUnfortunately, Dean doesn't get the chance to ruminate on the situation because Castiel's irritation hardens into suspicion. Between one blink and the next, Will and other Dean disappear from where they stand and reappear behind Castiel's aggressively protective stance. Neither of them complain and in fact, Will shrinks closer to Castiel and peeks over his shoulder.\nWeird. If Castiel had done that to Dean, he'd probably elbow him at the very least.\n\"What are you?\" Castiel growls.\n\"Um, I'm Dean. I mean, not your Dean. Another Dean. Can't you see your Grace in me?\" Dean asks, now worried that he's finally found a world where Castiel can't recognize him well enough not to strike him down as an evil impostor.\n\"I see my mark,\" Castiel confirms, but he doesn't sound pleased. \"Did the Angel Council send you?\"\n\"Angel Council?\" What the ever loving fuck? \"I don't know what that is.\"\n\"You don't know the Angel Council?\" Will pipes up, surprise lifting his voice.\n\"Big fucking council of Angels? Been running the world for about three hundred years now?\" other Dean adds in an incredulous tone.\n\"Okay, wow,\" Dean can't help saying. \"Look, I'm not from this world. I came through a mirror in that room up there,\" he says, nodding back up the stairs. \"That's why you see your mark or whatever, Cas. I'm looking for my own world and this obviously isn't it.\"\nCuriosity brightens Will's gaze, but neither Castiel nor other Dean give up their wary mistrust. Maybe it wasn't such a good idea to stay in this world. Dean's getting weird vibes off everyone here. The way Castiel curls a hand around both Will and other Dean's wrists freaks him out. Almost as much as the fact that other Dean doesn't seem to find it odd.\n\"He's telling the truth,\" Castiel allows grudgingly.\n\"Really?\"\nWill tries to get past him, but he's stopped by Castiel's powerful grasp. Seemingly without noticing the movement, Will lets himself be tugged close against Castiel's side, held tight by an arm slung around his waist.\n\"What's your world like? Where's the other me?\"\n\"There is no other you,\" Dean says faintly, his attention mainly on the way Castiel beckons other Dean to take his hand. Their fingers thread together, joining all three in some kind of bizarre co-dependent little circle and yet again, no one acts like anything is fucking weird.\n\"No Will?\" Castiel says. \"How is that possible?\"\n\"I...don't know? I mean, I've got Sam-\"\n\"Is Sam your twin's name?\" other Dean asks.\n\"No, I'm...what I'm saying is I don't have a twin,\" Dean explains, his eyebrows high on his forehead. \"I have a younger brother named Sam. He's not here?\"\nWill and other Dean shake their heads. Other Dean looks very disturbed. He keeps exchanging short dark glances with Castiel, but Will appears oblivious. He wraps an arm around Castiel's neck and apparently unconsciously begins playing with a lock of Castiel's hair.\n\"I've never heard of a younger brother,\" he says, fascinated. \"How much younger?\"\n\"Four years,\" Dean says. \"And what do you mean you've never heard of a younger brother?\"\n\"This world only produces one set of twins per family,\" Castiel says, cutting across Will's next excited statement. \"Each human has an identical sibling. I assume that is not the case in your dimension.\"\n\"Yeah, no,\" Dean says.\nA longer explanation about his world and about Sam springs to mind, but is utterly destroyed when other Dean presses his cheek against Castiel's shoulder and Castiel releases other Dean's hand to hook his thumb into one of other Dean's belt loops. Dean's brain locks up. He can't reconcile what he's seeing. Open affection is one thing. But Castiel is feeling up both brothers and it's not just loving touches. The twins gravitate towards Castiel like he's a big Angel magnet. And the way Castiel keeps them both slightly behind him speaks more of protection than love.\n\"Okay, I'm sorry, but what is going on?\" Dean blurts. \"Why are you standing like that?\"\nWill frowns.\n\"Cas is our Angel,\" he says as though that were explanation enough.\nWhen Dean doesn't answer, other Dean speaks up.\n\"The Angel Council gave us to him. You don't have an Angel? I thought you had Cas' mark?\"\n\"Um, yeah, but not because of that,\" Dean says, thoughts now whirling. He looks at Castiel. \"So you're not screwing them?\"\nWill snorts with laughter. \"Oh my god, are you serious? Why would he do that?\"\nBut Dean catches the flash of panic in other Dean's eyes. He sees how other Dean tries to pull away from Castiel and the sudden guilt that overwhelms Castiel's expression. So that's how it is. Either this Dean and Castiel are fucking or they want to. And they won't say anything to Will because Castiel owns them or something. Dean makes a face. That's so messed up.\nHe's not leaving until it's fixed.\n\"Because he's in love with Dean?\" Dean fixes his gaze on Castiel. \"Aren't you?\"\n\"Angels don't fall in love with humans,\" Castiel says, an obvious recitation. \"We are here to protect and nurture them.\"\n\"Bullshit,\" Dean says.\n\"What's he talking about, Cas?\" Will asks, eyes wide with confusion.\nCastiel glares at Dean, but only briefly before turning to Will. His fingers dip under the edge of Will's shirt and he rubs what Dean assumes are comforting circles into Will's belly. On his opposite side, other Dean has released his grip on Castiel until they are only connected by their pinky fingers.\n\"It's nothing,\" he says.\n\"You're lying to me,\" Will accuses. \"Why are you lying? Cas...do you...do you like Dean that way?\"\nSilent tension holds the room captive. Dean can tell Castiel is thinking fast. Unable to lie, but unwilling to tell the truth. It's one of the only familiar things about this world. Other Dean stares at the floor and he's biting the inside of his mouth. Dean thinks maybe he wants to say something, but can't override Castiel's authority.\n\"Will,\" Castiel finally says. \"I didn't mean for this to happen.\"\nHope explodes across other Dean's face. His eyes snap from the floor to Castiel, his lips parted in shock.\n\"Oh my god, it's true!\" Will exclaims. \"Why didn't you tell me? Didn't you think you could trust me?\"\n\"Trust you?\" Castiel asks, also surprised. \"It's forbidden. It's dangerous-\"\n\"So? Since when have we cared about danger?\" Will places his palm against Castiel's forehead, an odd gesture Dean doesn't understand, but which obviously means something to Castiel. He slumps against Will, his expression suddenly alive with so much emotion, Dean has to look away.\n\"You're my Angel, Cas,\" Will says quietly. \"And Dean is my brother. So what if it's forbidden? I'm not going to tell anyone.\"\n\"I'm sorry,\" Castiel answers just as softly.\n\"Don't say it to me.\" Will nods over Castiel's shoulder at other Dean. \"Tell him.\"\nDean turns away before Castiel does. Good for them and all, but he could do without yet another display of a different Dean getting what he wants. Whatever power sent him into that mirror has a wicked sense of humor. Somehow Dean's ended up as some kind of inter-dimensional Yenta. Behind him, he hears Castiel's low gruff tone murmuring something to other Dean.\nHe sighs.\nTime to try again.\n*******************\nThe first thing Dean hears when he steps out of the mirror is the sound of his brother's shrill indignant voice.\n\"See, I told you he would be here!\"\nSam glares at Dean, his arms crossed over his chest and chin stuck out the way it always does when he's feeling disgustingly superior. It usually makes Dean want to punch Sam in the kidneys, but right now, it makes him feel terribly homesick. He misses his big stupid bitch of a younger brother.\n\"I didn't not believe you, Sam,\" the other Dean grumbles. \"It's just weird.\"\nWeird is right. Once Dean drags his attention away from his Sam-related melancholy, he really sees who is standing in the rest of the room. Sam and the other Dean, both male and dressed the way they should be. Beside them stands Castiel, a bemused expression on his face and in Castiel's arms, there is a little girl, perhaps two or three years old. She's got curly brown hair, big blue eyes and a breathtaking grin that Dean can't help returning.\n\"Daddy!\" she squeals, kicking at Castiel's stomach and reaching out for Dean.\n\"Hey,\" other Dean says, sounding mildly annoyed.\n\"It's really you.\" Wonder lightens Castiel's deep voice. He doesn't move closer, but he does let the squirming girl down and watches in surprise as she stumbles into Dean's legs. \"Marianne knows you.\"\nDean's not sure what he should do. It's not cool to grab up a stranger's child, but if he doesn't respond to the girl, she might get upset. Her surprisingly strong arms clamp around his calves and she stares up at him with those shining blue eyes. Not blue like Castiel or like DeAnna's son, Mark. Instead they are a clear sky-blue, so light that her pupils are a shocking darkness at their center. Dean already feels himself falling under their spell.\n\"What's going on?\" he asks weakly, finally giving up and reaching down to swing the girl into his arms.\n\"You're here from another dimension,\" Sam says excitedly. \"I saw it in a vision. I even saw myself explaining that I have visions because your Sam doesn't. At least not anymore and not in the same way. And no, it's not because of the demon blood. I was always psychic. I was only given demon blood because I had that power.\"\nAll the while Sam is spewing this confusing speech, other Dean is glowering at his child snuggled against Dean's side. He can't blame him. Dean's never had a child, but he knows he'd hate having one call another man 'Daddy'. Unless it was Cas, Dean's brain automatically corrects.\n\"Marianne,\" other Dean blurts before Sam can draw breath to continue his explanation.\nThe girl turns her striking eyes from Dean's face towards the voice calling her name. A puzzled frown forms on her small mouth and she cocks her head to the side, a movement she must have picked up from Castiel.\n\"Daddy?\" she asks.\n\"Yeah, I'm Daddy,\" other Dean says. \"Just want to make that clear.\"\nMarianne's frown deepens and she turns her head back to Dean. One of her tiny hands pats against his cheek as she searches his face. He stills, uncertain of what test she's giving him, but somehow hoping he passes.\n\"Different Daddy,\" she decides.\nWhen Mark had looked at him, Dean had fallen in love and at the time, he assumed seeing his and Castiel's features in the child's face was the reason. But this girl doesn't look a thing like him and it doesn't matter. One look at that total trust and complete adoration and Dean's gone once again.\n\"Yeah,\" he says.\n\"Not exactly,\" other Dean objects. \"He's-\"\n\"But he is you,\" Sam declares. \"I told you, he's the exact same as you. Marianne's not going to see the difference.\"\n\"How did you know that anyway?\" Dean asks\n\"I told you, I'm psychic! You see-\"\n\"Sam,\" Castiel interrupts, his clever eyes locked on Dean's face, probably catching every detail of his bewilderment. \"Dean appears overwhelmed. Didn't you say he would need a break?\"\n\"Oh right.\" Sam grins. \"I even saw you telling me that, but I forgot. Are you hungry?\"\nThe last question is directed at Dean. Until Castiel mentioned it, Dean hadn't thought about his stomach or any other need in several hours. But now that he's said it, Dean's stomach clenches and he realizes he has to piss like a racehorse. Sooner or later, he'll have to stop and sleep. Dean has no clue how long he's been up, but it must be very late at night back home. Maybe even the next day. But he's not ready to stop that long yet. Only when he's on the verge of collapse.\n\"Yeah, I could eat.\"\nOther Dean snatches Marianne away from Dean.\n\"C'mon, baby girl. You wanna eat?\"\nShe giggles and rests her cheek against other Dean's shoulder.\n\"Hi, Daddy.\"\n\"That's right,\" other Dean says as he carries her out of the mirror room. Dean snorts when he hears other Dean's rapidly fading voice say, \"Can you say Number One Daddy?\"\n\"Well, that's great. Now I'm Number Two Daddy.\"\n\"Actually, Cas is Number Two Daddy,\" Sam says helpfully. \"You'd be Number Three.\"\n\"You can shut up,\" Dean says, poking him in the chest. \"Let's go. I'm starving.\"\n*******************\n\"Where'd she come from anyway?\" Dean asks.\nThe odd little group sits in a booth at the same diner where Dean ate the last two times. He's beginning to memorize the menu. Not that these places ever vary much in their choices. Good thing his eating habits rarely vary either. Even in alternate realities. He and other Dean place the same order of a double cheeseburger and onion rings. The only difference is the short exasperated glance Castiel gives other Dean. Dean grins. He's seen Cas and other Dean having sex and he's listened to other Dean talk about how much he loves Cas, but he's never seen them act like a typical couple. They work seamlessly. Other Dean grabs the high-chair and Castiel inserts Marianne into it seconds after other Dean's got it in place. Other Dean's water comes with lemon and Castiel scoops it into his tea without asking. Castiel's handing him a tissue the moment other Dean realizes he needs to clean off Marianne's cheek. It's...oddly endearing.\n\"Well, you see, when a man and a woman love each other very much,\" other Dean says.\n\"I meant, how did you get her,\" Dean interrupts, rolling his eyes.\n\"It's called adoption,\" other Dean quips as he hands Marianne the graham cracker Castiel produced from nowhere.\n\"Yeah and I don't know about you, but my record isn't exactly clean enough to adopt a kid.\"\n\"Oh well, when a man and an angel love each other very much, the angel can pull strings about the man's FBI record.\"\nDean glances sidelong at Castiel.\n\"Breaking laws for me, Cas?\"\n\"I was only correcting mistaken information,\" Castiel says in an falsely innocent tone.\n\"So you see,\" Sam says from Dean's left. \"You don't have to worry that you can't have children with Cas. You just have to trust him.\"\n\"Okay, doesn't that freak you out?\" Dean asks other Dean and Castiel.\nThe idea of Sam with true psychic powers is terrifying. His Sam is good enough at wheedling information out of Dean without adding the actual ability to read his mind.\n\"All the time,\" other Dean says with an exaggerated eye-roll.\n\"Don't listen to him,\" Sam counters. \"I don't have visions all the time. Only when I need a message. The worst being when Dean and Cas refused to tell me they'd hooked up.\" He shudders. \"My brain decided to provide me with evidence in technicolor and surround-sound. I had to beg them to tell me or stop, so I wouldn't have to see it.\"\n\"Needless to say, we told him,\" Castiel says lightly.\n\"And your visions decided you needed to know about me and kids?\" Dean asks.\nIt sounds far-fetched, but Dean can't forget what Gabriel had told him. Something sent him through these worlds for a reason. These weren't random worlds. Each one had a message for Dean or a purpose he could accomplish for the Dean and Castiel in that world. Dean thinks of Mark and how envious he'd been of DeAnna.\n\"Apparently.\" Sam gives him a gentle smile. \"I know how much you want your own child.\"\n\"Yeah,\" Dean answers, voice rough with suppressed emotion. He immediately tumbles into another question to smooth past a potentially awkward moment. \"How do you go hunting with her around?\"\n\"In turns,\" other Dean says. \"We live a couple of hours from here. Most of the time, Marianne stays at home, of course, but you know, Sam's visions had her here.\" Dean nods. \"Anyway, we only go on hunts within a day's drive and me and Cas never go on the same hunt. Nothing we hunt anymore can really hurt him, but you never know.\"\n\"Right,\" Dean agrees. It's a good way of making sure Marianne is never left alone, but he has to admit, it sucks that he can't hunt with Castiel anymore. Yet at the same time, he likes the idea of the sacrifice, that he could find a compromise between staying a hunter and giving up his whole life entirely.\n\"Cas still makes me take an angel with me though.\" Faint disgust mars other Dean's expression. \"Usually Balthazar.\"\n\"Seriously?\"\n\"Batazar!\" Marianne shouts.\n\"Marianne loves her uncle Balthazar,\" Sam says sourly.\nThe waitress interrupts Dean before he can properly mock Sam for his familial jealousy. When she sets Castiel's plate in front of him, Marianne immediately stretches her arms forward, past other Dean's plate and makes grabby hands.\n\"I wanna french fry, Das,\" she demands.\n\"What'd she call you?\" Dean asks as Castiel hands his daughter one french fry.\n\"Das,\" he says. \"We taught her to call Dean 'Daddy' and attempted to have her call me 'Dad'.\"\n\"Which she thought was stupid,\" other Dean says, rather proudly Dean thinks. \"She heard me calling him 'Cas' all the time and sort of...smashed the two together.\"\n\"French fry, Das,\" Marianne pleads.\nCastiel gives her two more French fries, but Dean can tell by the look on his face that it's all she's getting. If Dean does end up having a child with his Castiel, the kid might actually grow up on a healthy diet. And with constant supervision. A strange and wonderful concept.\n\"You know, if you want her to eat better food, you should set a better example,\" Sam says in a haughty tone from behind his mountainous salad.\n\"Turkey is healthy,\" Castiel protests. \"It comes with french fries.\"\n\"French fry?\" Marianne says. \"Das?\"\n\"Besides, Dean is the one who sets a terrible example.\"\n\"Hey, you don't catch me giving her onion rings.\"\n\"What child likes onions?\" Castiel exclaims.\nThe three of them soon dissolve into good-natured bickering while Marianne tries to steal a pickle off other Dean's plate. Dean watches them in amused silence. They're not perfect, not by a long shot. But they sound like a family and Dean wants this so bad, he aches with it. But not the same sort of ache as before. Not the depressed certainty that he could never be truly happy, a family man in his own life. It's the pain of separation. There's no denial. Dean knows what he wants.\nHe only needs to get back to his own world.\n\"Are you okay?\" Sam asks, finally noticing Dean's silence.\n\"Don't suppose you had a vision about how long I'll be out here?\"\nSam shakes his head.\n\"No, I'm sorry,\" he says with sympathy. \"But it can't be too much longer, right? What else could you have to learn?\"\n\"That's what I'd like to know.\"\n*******************\n\"Are you sure you don't want to stay the night?\" Castiel asks.\n\"No, I'm good.\"\nDean can't explain it, but somehow he knows this world isn't one he needs to visit for very long. He needed to see this family, but they don't need him. If Dean's ever going to get home, it can't hurt to earn points with whatever sent him out by helping when he can. This family doesn't need help. Their happiness is obvious in every glance they exchange, every gentle touch or whispered word of endearment.\n\"Good luck,\" Sam says. \"I mean with your family.\"\n\"Thanks.\"\nSam drags Dean into a massive, but brief hug, as if he knows it'll be too painful for Dean to linger in the embrace. The other two don't offer the same comfort, which Dean appreciates. With other Dean, it'd be too weird. And with Castiel, he's not sure he could let go.\n\"You wanna say goodbye, Marianne?\" other Dean asks.\n\"Bye? Bye, Daddy?\" she asks, obviously confused by the turn of events.\n\"Daddy number two,\" other Dean reminds her. \"I'm not going anywhere, kiddo.\"\n\"Oh.\" She leans out of his arms suddenly and Dean only just moves fast enough to catch her. \"Bye, Daddy.\"\nGod, that name cuts right through Dean. Wrapping his arms fully around her, Dean holds Marianne close, his eyes shutting against the powerful wave of melancholy. Marianne will never be his child. In his world, her other self has already found a home, he imagines. Like Mark, he'll never see her curious blue eyes again or hear her sweet voice begging treats from her 'Das.'\nThe universe better stop screwing with him soon. Dean can't take much more of it.\nWithout another goodbye, Dean hands Marianne over to her father and marches towards the mirror, hand stretched towards the smooth glass.\n\"It's soon,\" Sam suddenly says, his voice oddly flat. \"Very soon, Dean.\"\n\"What?\"\nBut his momentum is too great and Dean's fingers graze the mirror's surface.\nThe mirror takes him.\nThere are four people waiting for him when he tumbles through the mirror, but he's only seen two of them before. DeAnna and Samantha peer at him with wide eyes. They stand between two other women. One is older, in her mid to late-50s with a strong jaw, dark hair and hazel eyes. The woman on the other side is tall, black-haired and gazing at him with oh-so-familiar crazy blue eyes.\nIf Dean isn't very much mistaken, he's looking at the female versions of himself, his father and Jimmy Novak.\nOh god, this Castiel is even more epically hot than the blond woman. It's not the generous curves or the soft waves of black hair falling around her face or the hilariously adorable short female version of Castiel's trench coat. It's those eyes. The exact same curious eyes Dean sees in his Castiel's face and he must be a sucker for blue eyes because without the hang-ups Dean's finally learning to drop, he would have been fucking this version of Castiel before he knew he could even trust her. His heart squeezes. All that time wasted.\nGoddamn, he misses Castiel.\n\"I said, hey!\"\nDeAnna's voice finally penetrates Dean's mind. He tears his gaze off Castiel to meet DeAnna's annoyed gaze. Clearly, she's not happy with the way Dean's ogling her girlfriend.\n\"Sorry,\" he grunts.\n\"Who are you?\" DeAnna asks, probably for the second or third time.\nShe's caresses the gun at her side, but not yet pointing it at Dean. Probably because Castiel hasn't made a move. Dean's...mother? His Dad mom. Whatever she is, she takes a step forward to be in front of DeAnna. Dean smiles. Yes, that's his father.\n\"My name is Dean Winchester. I'm you from another world. A world with a greater distribution of dick in my family, apparently.\"\n\"What's that supposed to mean?\" his Dad mom asks.\n\"My parents were John and Mary Winchester and they had me and my brother Sam,\" Dean says with a nod in Samantha's direction.\nHis Dad mom draws her gun and points it at Dean's chest. Dean doesn't move. He's not really afraid this woman will shoot him. Not with Castiel here. But he doesn't want to spook her and if he knows anything about his father, it's that John Winchester didn't trust anything easily.\n\"Do I shoot it, Cas?\" she asks.\n\"I wouldn't advise it,\" Castiel answers in a predictably low sexy voice that send chills up Dean's spine. \"He carries a mark similar to the one I gave you.\"\nGave her? Dean's eyes dart between them. Confusion flickers in Dad mom's eyes, but the tension eases out of her body and she lowers the gun. Castiel shows nothing more than intense curiosity. DeAnna and Sam both gape at him.\nHuh. A world where John ended up being the righteous man after all. Dean wonders how this must have changed the relationship between DeAnna and Castiel. Without that special connection, had Castiel managed to worm her way past DeAnna's defenses the way Castiel had his?\n\"I can only imagine he tells the truth,\" Castiel continues.\n\"Well, damn,\" his Dad mom says. She shoves the gun back in its holster. \"I gotta say, I was hoping I wouldn't have to shoot you. You look too much like my kid.\"\n\"I'm glad you didn't either, but uh...for a different reason,\" Dean answers. \"What the hell do I call you?\"\nShe snorts. \"Kinda hard to imagine myself as a man. You can call me Jane.\"\nJane Winchester. That tickles Dean. He wishes John were still alive back home. He'd get a kick out of this story. Or at least Dean would get a kick out of telling it.\n\"What happened to you?\" DeAnna pipes up. \"I mean, why'd you get Cas' mark instead of...whatever, your dad?\"\nDefinite jealousy underlines DeAnna's tone and Castiel flicks a glance in her direction, one so brief that Dean nearly misses it. The second she sees Dean watching her, she snaps her attention back to him, her expression turning wooden. Like defenses slamming shut. He blinks. What the hell is going on here?\n\"Dad didn't break,\" he says bluntly. \"I did. So here I am, with Cas' mojo stuck in me.\"\nHis words ripple shock through the group, but each one quickly recovers. Dean can only imagine they've had the same experience taking blows as he has. However, he does notice Castiel move closer to DeAnna, as if she'd heard that something terrible happened to DeAnna instead of her counterpart.\nJane and Sam don't appear to see it.\nSuspicion grows in Dean's mind. Something's off here. The way DeAnna and Castiel look everywhere except at each other, yet are clearly drawn to the other's side. DeAnna's jealousy of Jane for Castiel's mark. Not to mention her irritation at Dean's gawking. Okay, so maybe they aren't together yet. But why is Castiel trying so hard to hide her feelings? His Castiel still hasn't learned how to hide his feelings.\n\"My other self obviously didn't realize what he was doing,\" Jane says.\nHer tone is not unkind and Dean understands what she means, but it doesn't stop him from feeling defensive. John couldn't have known what he was doing and Dean would never change that it happened to him instead of someone else. He opens his mouth to say as much when it hits him.\nJohn would have never understand Dean's feelings for Castiel. The Dean who hadn't gone on this mirror journey would never have felt brave enough to tell his father that he'd fallen in love with a man. It doesn't matter that Castiel isn't technically a man. It doesn't matter that Dean loves Castiel as much as John loved Mary. John wouldn't have understood and Dean wouldn't have wanted to disappointed him. He can so easily imagine it. His heart beating faster each time John caught him staring at Castiel. Dreaming of Castiel only to wake up with the certainty his fantasies are written on his face. Unconsciously teaching Castiel to avoid drawing attention to his obvious preference for Dean.\nThen there's the Dean he is now. The one that's traveled through a dozen worlds and learned nothing matters more than being happy. Dean won't forget other Dean's warnings that he won't like the looks people give him and Castiel. And he's never going to be a poster child for Gay Pride.\nBut the message remains. Nothing matters more than being happy. Than being with someone who loves you for exactly who and what you are.\n\"I guess not,\" Dean says.\nHe smiles. His heart and mind are both clear.\n\"Look, I gotta go. My family is waiting for me in my own world.\" He looks at DeAnna. \"Hey, if you love her, go for it. She's right there,\" he says, nodding to Castiel. \"You have no idea how huge that is. Nothing else matters.\"\nWithout waiting a reply, Dean touches the mirror once again.\n*******************\nDean never thought he'd dislike having Castiel's hungry eyes on his face. When Dean pops into the next new world, he sees other Dean on his knees kissing at Castiel's stomach and slowly unzipping his pants. The shock on Castiel's face quickly turns to an eager sort of desire. Normally Castiel's pants hanging open and his underwear pulled down enough to show off gorgeous sharp hipbones would pool heat in Dean's belly. But the look in Castiel's eyes ruins the effect.\n\"Oh wow, um...sorry, I'll just go-\"\n\"Wait!\"\nOther Dean sits back on his thighs and wipes at his mouth, watching in bemusement as Castiel pulls his pants back into place and surges into Dean's personal space. His confusion deepens into anxious worry when he sees his copy standing beside the mirror.\n\"You are Dean Winchester,\" Castiel says happily. \"Not my precise Dean Winchester, but another.\"\n\"Yeah.\" Dean edges away from Castiel and his manic joy. \"I'm looking for my world and uh, yeah, this obviously isn't it, so I'll-\"\n\"You can't go.\"\nHis joy flattens into the dark commanding tone Dean often wants to obey without thought. But not this time. The only reason Dean doesn't escape right then is because Castiel's hands clamp around his elbows and he holds Dean in place with frightening strength. Over his shoulder, Dean sees other Dean's worry exchange for sadness he doesn't understand. He tries not to sigh. Fatigue drags at Dean. He needs sleep, not this mess.\n\"You're the solution. It's perfect.\"\n\"Solution to what?\" Dean asks in a calm reasonable tone because you speak softly to crazy people. Only Castiel's never been crazy before. Not even the unhinged future version of Castiel from 2014 was crazy. The fervor in this Castiel's stark blue eyes scares the shit out of Dean.\n\"We need our third,\" Castiel explains. \"But I don't want any of the other humans. They disgust me. The idea is intolerable. But Dean needs his second.\" He reaches up to touch Dean's face. \"You could make us both happy.\"\nWhoa. Dean's too freaked to move as Castiel traces the curve of his cheek with trembling fingers. He's gotten tossed into some kind of...threesome universe? With a disturbing version of Castiel who's willing to kidnap people and a sad meek Dean who's curled into a ball on the floor as his boyfriend propositions another man.\n\"Please,\" Castiel pleads quietly. \"People are starting to ask questions. Sam keeps trying to send us on dates with strange humans. He and Sarah and Jess won't stop worrying.\"\nNot a good time to snort, but wow, Sam hit the jackpot in this world.\n\"Right, uh. Are you sure he wants that?\" Dean asks, nodding to other Dean hugging his knees to his chest.\n\"Of course. All humans require two partners,\" Castiel says without hesitation.\n\"They don't,\" other Dean whispers.\n\"You must...\" Castiel trails off when other Dean's words finally penetrate his mind. To his credit, he immediately releases Dean to kneel by other Dean's side. \"What are you talking about?\"\nDean wonders what made this other Dean so shy. It's difficult to watch. He can barely get the words out to murmur softly to Castiel. Dean catches a few here and there. '...weirds me out' and 'please don't' and 'only you.' Speaking of being weirded out. Dean really doesn't like this world.\nHe backs away until his back hits the mirror. The electric zing that signals traveling curls around his body, a brief twinge of pain and then Dean is falling backwards into a pair of warm strong arms. A familiar spicy scent fills his nostrils and Dean relaxes. Even if he's in the wrong world, he's home for a moment.\n\"Cas?\"\nA shaky intake of breath, Castiel's arms wrapping around Dean's front, holding him so safe and close.\n\"Dean,\" he sighs, voice wrecked and oddly, full of tears. \"You're here.\"\nHope explodes in Dean's chest. Oh god, could he really be home? Back with his own Castiel? There's a part of him that wants to stay like this forever. In Castiel's arms, hope not yet destroyed again. He closes his eyes and breathes deeply, memorizing everything he senses. Castiel's long slender fingers clutching Dean's shirt into his fist. His hot breath puffing against Dean's neck, drawing goosebumps across every inch of his skin. The way Castiel rolls his hips against Dean's, settling the curve of his groin against Dean's ass.\nBut another voice echoes through the doorway, breaking the moment.\n\"Cas? What's...oh my god.\"\nDean reluctantly pulls away from Castiel and turns. Sam stands in the doorway, wide eyes glued to Dean's face. He gets a sinking feeling. There's fear in Sam's eyes. Fear and panic and nothing makes sense. Dean doesn't want to look at Castiel, but he can't help himself. His eyes turn to Castiel's face and he can almost hear his heart breaking.\nHe's never seen such devastated grief in his life.\n\"Cas?\"\n\"How are you here?\" Castiel asks wonderingly. \"You're dead.\"\n\"What's going on, Cas? What is this?\"\nSam's in the room and pulling Castiel against his side before Dean registers his movement. Details Dean had missed in those first moments filter into his brain. Castiel wears his trench coat, but the blue suit has been replaced with a pair of dusty blue jeans and a white t-shirt under a green button-down Dean recognizes from his own wardrobe. His hair is flat and messy as though he'd slept on it. But Castiel isn't supposed to sleep. Not if he's still angelic.\n\"Are you human?\" Dean blurts.\n\"What are you?\" Sam demands, stepping around Castiel to hide him partially from view. The innate protectiveness of the action is almost enough to make Dean smile. But the growing anger on Sam's face stops him. Dean knows better than to provoke Sam when he's pissed and confused.\n\"I'm Dean, I swear. I'm from another dimension.\" At Sam's incredulous snort, Dean holds up his hands and nods. \"Look, I know it sounds crazy, but I swear to god, I came here through that mirror. I'm just trying to get back home.\"\n\"Stop it, Sam,\" Castiel says. He lays calming hand on Sam's shoulder and Sam instantly relaxes, practically melts at the touch. \"I can see he's telling the truth. There's enough grace in me for that if nothing else.\"\nWell that answers one of Deans questions. Not entirely human, but almost there. Unfortunately, that doesn't even begin to cover the whole story.\n\"The truth? You mean...I don't understand,\" Sam says weakly. \"It's really Dean?\"\nSomething's wrong. There's so much broken in this world. While Castiel's eyes shine with joy, there's a depth of hurt in Sam's that Dean can't stand seeing. A smile turns up the corners of his mouth, but Dean knows it's not real.\n\"Dean, I can't believe it,\" he murmurs.\nHe should leave. Too many undercurrents Dean doesn't understand in this world; he's bound to screw something up. Except...the happiness on Castiel's face tugs at Dean. His grief lingers, but the pleasure is very real. Dean can't imagine stealing it from him by leaving this Castiel to his pain without at least trying to help. His exhaustion weighs heavier than ever and suddenly, Dean understands. Maybe he's not really getting a message from anyone, but he knows without a doubt he needs to stay in this world. At least until he can sort out what's happening.\n\"Yeah, it's really me. Um, look...I know it's a lot to ask, but I've been going through these worlds for I don't know how long. Would be alright...could I catch a nap at your motel?\"\nCastiel leaps forward and grabs one of Dean's hands.\n\"Of course. Yes, of course you can,\" he says eagerly.\nPlease don't let this be a mistake, Dean thinks as he lets Castiel lead him out of the room, Sam's narrowed eyes following them every step of the way.\n*******************\n\"If we'd known you...well, of course, we couldn't have known,\" Castiel babbles, sweeping a pile of fast food trash off the table in their motel room. \"We would have cleaned up more.\"\nThe room is the same Dean and Sam were sharing in his world. One bed is neatly made like Sam always does it in the mornings. The other is a disaster, the blanket skewed almost sideways. A wall of pillows line the center, obviously so Castiel won't feel alone in the bed. Dean winces. God, he had no idea he held the power to so completely destroy someone.\n\"Hey, don't worry about it,\" Dean says, his voice a gentle tone he's never heard from his own mouth before. \"Looks way better than I would have it.\"\n\"Yes, I remember,\" Castiel says fondly.\nSam stalks into the room behind them and plops down in a chair.\n\"Are you hungry?\"\n\"Not really,\" Dean answers.\nHis attention fixes on Sam. Dean recognizes that expression. The pursed lips. The refusal to look up. The flared nostrils. Sam is seriously pissed at someone and Dean strongly suspects he's that person. Irritation bites at Dean. Okay, so Dean's here stirring up shit, but Castiel's clearly not healed. Maybe he needs to say goodbye. Maybe there's some stuff he never got to tell the other Dean. Hell, maybe Castiel just needs to give Dean one good punch for leaving him. Anything to get some closure. And even if it doesn't work, Dean can't help that the universe dumped him here. There's no reason for Sam to be that angry.\n\"Right, well, then you probably want to rest,\" Castiel says, walking to his bed to straighten the covers. \"You can use this bed. We'll just let you have some quiet. Unless...unless you'd like some company?\" he asks so hopefully that Dean's already thoroughly battered heart squeezes in his chest.\nHe means to tell Castiel he'd never refuse him anything, but Sam jumps from his seat, snagging their attention.\n\"Are you fucking kidding me, Cas?\" he demands. \"This isn't our Dean. God, Cas, you were just starting to get over him and now you're acting like he's back from the grave?\"\n\"Hey,\" Dean says, frowning.\n\"Fuck you,\" Sam spits. \"You were already here. You're always here, man. Why couldn't you have just moved along?\"\nThere's no chance to answer. Sam pushes past him and out of the room, slamming the door on his way out. Worry springs to Castiel's expression and he's at the door in an instant, tugging it open to shout down the hall. \"Sam! Sam, don't, please.\"\nDean catches Castiel's arm before he can follow Sam. \"What's going on here?\"\n\"I don't know,\" Castiel says, honestly confused. \"I need to go talk to him. He's been in such pain since you died.\"\n\"Well, forgive me if I disagree,\" Dean says. \"He doesn't need comfort. He needs a good kick in the pants.\"\n\"Dean-\"\n\"Hey, you trust me, right?\"\nThe worry doesn't exactly fade, but it does ease under the glow of such profound love Dean forgets where he is for a moment. He captures Castiel's face between two hands and presses their foreheads together. Castiel's hands settle on his hips.\n\"Yes,\" Castiel says on a deep exhale.\n\"I don't know what the hell is going here, but I'm going to fix it, okay?\" A stupid thing to say, an impossible promise. But Dean hears love makes people stupid. \"And then I'm going to take a fucking well-deserved nap and you're going to stay with me.\"\n\"Okay,\" Castiel agrees quietly. \"Please help him, Dean. I can't lose him too.\"\nThe words knock around in Dean's brain, touching on something he can't quite understand yet. He tucks it away for later. Right now, he's got a brother to fix.\n\"Wait for me.\"\n*******************\nDean finds Sam in the parking lot, sitting on the ground on the far side of the Impala. His arms loop around the knees drawn against his chest. The moment he sees Dean, he tenses and looks away.\n\"I'm sorry,\" he mumbles.\n\"I know,\" Dean says.\nSettling on the ground beside him, Dean leans against the car, his baby's smooth metal still warm from the ride over. Sam's breath hitches in his lungs.\n\"No, you don't. God, Dean, you have no idea.\"\nThe edge of panic Dean saw in Sam earlier returns to his tone and Dean wonders if he can get Sam to talk before he runs. These two must have been holding on by a thread. There's no telling when they would have snapped. He feels a bolt of irrational anger at the other Dean for dying.\n\"I don't know how it happened here, Sammy, but I know exactly what it's like to lose a brother,\" he corrects. \"And I thought I'd die. I wanted to die. I wouldn't have made it this far without you. It's okay to freak out, but you're scaring Cas and he doesn't need that shit.\"\n\"Don't I know it,\" Sam says bitterly. \"Cas needs Dean, but he's not here. But then you appear out of nowhere and get his hopes up.\"\n\"Cas knows I'm not staying-\"\n\"In his mind, maybe, but I haven't seen him that happy in months.\" Sam rubs his fingers into his eyes, a gesture of fatigue meant to cover tears. \"Fuck, I'm sorry. I'm so sorry.\"\nSomething changes in Sam. A realization that drags his shoulders down and when he speaks again, Dean can definitely hear the tears in his voice.\n\"I miss him so fucking much. I should be ecstatic to see you, but all I could think was that Cas had been getting better. You don't know. God. You weren't here when he died. I honestly thought Castiel would lose his mind. He begged the angels to bring you back, but they wouldn't and then...then he was just gone,\" Sam says, voice hollow. \"He was blank. If I hadn't been there, I don't think he'd ever get up in the mornings. But then it started changing. He would talk to me, you know?\" Dean nods, his throat too thick for words. \"I started seeing his personality again and he...he tried to cheer me up. We'd talk about you for hours and hour, but sometimes, it would be...it would change to just us. You were still there, but not as much. I'm sorry, Dean. I didn't...I never wanted. I didn't mean to.\"\nAt first, Dean has no idea what Sam is talking about. But he sees the guilt lining those familiar hazel eyes and the truth strikes him so hard, he sucks in a sharp breath.\n\"Oh my god, Sam, are you in love with him?\"\nThe tears Sam had been holding back spill down both cheeks, but he meets Dean's eyes and nods.\n\"I'm sorry,\" he whispers.\nDean has no idea what to feel. He's numb for a long moment as Sam finally looks away and buries his face in the crook of his arm. In all those worlds, there'd never been a hint of romantic feelings between Sam and Castiel. But Dean had always been there. Maybe that's all it took. The impossible weight of shared grief, a heightened protectiveness, being left alone together. Sam's heart broken by Dean's death, finding comfort in the most obvious place.\n\"Sam,\" he says before he even realizes he wants to talk. He lays a hand Sam's rigid shoulder. \"What did you think I would think?\"\n\"You're not exactly the sharing type,\" Sam lifts his head enough to say.\n\"Yeah, but I'm dead.\" When Sam jerks with shock, Dean sighs. \"It might be easier on you both if you'd accepted that. He's dead, Sam. Yeah, if you were sniffing around Cas while he was alive, he'd castrate you.\"\nThe comment draws a reluctant puff of laughter from Sam.\n\"Draw and quarter me, more like,\" he grumbles.\nDean grins and squeezes his shoulder, sweet heady relief lightening his insides.\n\"They'd never find the body,\" Dean agrees. \"But hey. Look at me.\"\nHe waits until Sam's damp reddened eyes lock onto Dean's face. Dean places his hand against Sam's collarbone, his thumb sweeping lightly over Sam's pulse point, the way he used to do when they were kids and Sam would cry about whatever the hell kids cry about. Some of the tension drains out of Sam's body.\n\"I'm not him, but I know how he thinks. He wouldn't blame you for it. It'd be pretty fucking hypocritical of him.\"\n\"But it's weird-\"\n\"So?\" Dean interrupts. \"Who gives a shit? That's not more important that being happy. Trust me, Sammy, I've been stuck away from my Cas long enough to get that now.\"\n\"Are you telling me to go for it?\" Sam asks in faint surprise. \"I don't think Cas even knows.\"\nSam's right. It is weird. Dean's not exactly comfortable telling his baby brother to horn in on his territory. But he's also not wrong. This Castiel is alone. He needs Sam. And if it helps Cas stop being miserable, Dean would tell his worst enemy to go for it, much less his Sammy. Come to think of it, there's no one in the world Dean would trust more with Castiel than Sam.\n\"I'm saying you're both really fucking unhappy right now and there's no reason for it.\"\n\"But what if I tell him and he can't handle it?\"\n\"He's stronger than that,\" Dean assure him. He slips his arm over Sam's shoulder and pulls him close. \"Enough talking. I know you want to cry on me like a little girl.\"\n\"God, Dean,\" Sam says, turning into the embrace and hiding away against Dean's neck. \"I miss you so goddamned much.\"\nAnd this time, when Dean says it, they both know it's absolutely true.\n\"I know, Sammy. I know.\"\n*******************\n\"Where's Sam?\" Castiel asks worriedly when Dean gets back.\n\"He's getting his own room for the night. We need to talk.\"\n\"Talk? I thought you wanted to sleep,\" Castiel says, sounding nervous.\n\"Oh god, you have no idea how much I want to sleep,\" Dean says. \"I'm so tired I think I'm legally drunk, but I won't sleep until we get this straightened out.\" He collapses on Castiel's bed. \"Sam and I had a long chat. He told me some interesting stuff.\"\n\"Oh?\" Castiel turns away and begins fussing with the order-in menus laying on the table, pulling them into neat stacks. \"What did he say?\"\nDean's heard Castiel trying to lie before. He sucks at it. This overly casual tone stands out because of how convincing it sounds. Somewhere along the road to humanity, Castiel's picked up some pointers. Dean watches his restless hands, catches the troubled expression in his eyes.\n\"Oh holy hell, you know,\" Dean breathes.\nCastiel's hand clenches hard around one menu, crushing it and his eyes slam shut.\n\"You know,\" Dean repeats. \"You know how Sam feels about you. Why haven't you said anything to him?\"\n\"Because it's wrong,\" Castiel snaps.\nDean reels back from Castiel's harsh tone. The shock of realizing Castiel knew washes away in a flood of anger. Okay, yes, he adores this man, but he also loves his brother and Sam can't help the way he feels. His emotions have been screwed all to hell for who knows how long. He shouldn't be blamed when they settle onto a positive feeling for once.\n\"What do you mean, wrong?\" Dean snarls. \"It's not like he can help it for pete's sake.\" When Castiel doesn't answer, only stares at his ruined menu, Dean climbs off the bed and stalks over to him. \"I can't believe you'd blame Sam for this! You were the only thing he had left. He couldn't-\"\n\"I'm not talking about Sam!\" Castiel leaps from his chair, nearly overturning it. \"I'm talking about me!\"\nDean's heart stops. For two long impossible seconds, time halts and Dean's thoughts clog in his mind. Understanding wavers on the edge of his brain, but he can't allow it. Not quite yet. Before him, Castiel whirls around, pacing across the room and back, words falling off his tongue with surprising ease.\n\"You've only been gone for a little over a year, did you know that? One short year and if not for Sam, I don't know what would have happened to me. I can't imagine what it cost him to care for me like that.\" Castiel reaches one end of the room and then turns back. \"It's not like before. Not like you.\"\nThat elusive understanding slams into Dean with such force that he stumbles backwards, sitting hard on the edge of the bed. He suddenly understands what Castiel meant by not losing Sam.\n\"You love him too.\"\nCastiel pauses, his eyes glued to the ground, his body so still that Dean wonders if he's even breathing.\n\"Cas?\"\n\"I hate this,\" Castiel mutters. \"I hate feeling this way. You deserve better.\"\n\"What? No.\" Dean rises on shaky legs and takes Castiel's hand. \"What are you saying?\"\n\"How could I forget you so quickly?\" he asks, his voice breaking.\n\"God, Cas, if there's one thing you're not doing, it's forgetting me,\" Dean says with a weak laugh. He pulls Castiel into his arms, sighing heavily when Cas melts into his side, his eyes wetting the edge of Dean's collar. \"Do I really have to have this conversation twice?\"\n\"What?\" Castiel asks, the question muffled.\n\"C'mere.\"\nDean leads them to the bed and climbs atop the covers, scooting and shuffling until he's comfortable and then he drags Castiel down beside him. He settles into the space at Dean's side, a perfect fit. Dean digs an arm under him and wraps it around his back. When Castiel throws a leg over one of Dean's, there isn't an inch of them that's not touching. Dean kisses Castiel's temple.\n\"You didn't do anything wrong.\"\n\"How can you say that?\"\n\"Because I'm smart,\" Dean teases.\n\"Dean,\" Castiel says, tone long-suffering.\n\"Well, it's true. I know how your Dean would feel about you being alone and unhappy without him,\" Dean says, his lips grazing Castiel's hairline. \"I know how annoyed he'd be with both of you for letting a ghost come between you. We fight ghosts, Cas. We don't let them control our lives.\"\n\"I don't want to fight you,\" Castiel confesses.\nHis fingers dance across Dean's chest up to the bare skin of his throat. His touch warms Dean's body. Probably more than Dean should allow. But he doesn't speak. Just lets Castiel trace his jawline, over his cheeks, down his nose.\n\"You are so beautiful,\" Castiel says, his blue eyes heavy with memory. \"I would do anything to have you back.\"\nDean catches Castiel's hand, presses his lips to the palm.\n\"He would do anything to come back.\" Dean's free hand cups Castiel's face. \"But he can't. You have to let him go.\"\nFor a moment, Dean thinks Castiel will resist. He sees the denial tucked away in his gaze, feels the way Castiel tenses against him and Dean can't blame him. He's never been good at letting go of people he loves. It's unfair of him to ask Castiel to do the same. But there's also no choice. Not if the other option is Castiel and Sam staying in pain.\n\"You really don't mind?\" Castiel's voice is so small Dean can barely hear him. \"You're really okay with it?\"\n\"It's not the most comfortable thing I've ever done,\" Dean admits because Castiel deserves honesty. \"But your happiness is more important than anything.\"\nUntil he says it, Dean hadn't realized the depth of that truth. Dean loves Castiel so much, he'd do anything to see him happy, even if it means pushing him into the arms of another man. His own brother. The realization is both shocking and fucking amazing. Dean wraps his other arm around Castiel's waist and pulls him atop his body, smiling when Castiel relaxes fully, draping himself languidly across Dean.\n\"I'm afraid,\" Castiel says against Dean's neck. \"If I love Sam, I'm afraid I'll lose how I feel about you.\"\n\"I don't think it works like that,\" Dean says. \"Your feelings don't have to be the exact same for both of them.\"\n\"It's not the same,\" Castiel says again, his tone fierce. He lifts his head to gaze into Dean's eyes. \"Not even close. Doesn't Sam deserve more?\"\n\"You're not going to get me to say Sam could do better than you,\" Dean jokes to lighten the mood. To his relief, it works. Castiel shakes his head at Dean, but he's smiling.\n\"I don't know why I'm asking you these questions. You're hardly a relationships expert,\" he says as he settles back against Dean.\n\"No shit. I'm just saying, it doesn't matter why it started or if it's exactly perfect.\"\nCastiel draws a deep breath and blows it out, seeping warmth under Dean's tee.\n\"It hurts every single day,\" he comments, almost idly. \"The only time I'm not miserable is when I'm with Sam.\"\nDean kisses his temple.\n\"Then you should always be with Sam.\"\n*******************\nDean doesn't wake up until late into the night. The clock says 11:49. The maybe six hours of sleep aren't nearly enough for Dean, but he needs to leave.\n\"Cas?\"\nA light groan tickles his throat.\n\"Dean?\" Castiel lifts his head, confusion and then clarity transforming his features. \"You're leaving.\"\n\"Yeah.\"\nCastiel gets up without complaint and waits by the door as Dean uses the restroom one last time. When Dean steps up to him, Castiel takes his hand and squeezes it once before letting go.\n\"Thank you.\"\n\"Are you going to be okay?\" Dean asks.\n\"I don't know,\" Castiel admits. \"But I suspect I'll have a better chance now than before.\" He hands Dean the keys to the Impala. \"I'd like to say goodbye now, if that's alright. You can take the car back to the house. We'll take a taxi to pick it up.\"\n\"You're going to talk to Sam, aren't you?\"\nDean keeps expecting hesitation or melancholy. Jealousy or anger. Anything other than profound relief, but it won't come. As Castiel nods and leans up to press a gentle close-mouthed kiss to Dean's lips, all he can think is Wow, I really fucking love him.\n\"I hope you find him soon,\" Castiel says. \"And when you do, you must promise me to be careful.\"\n\"I will,\" Dean says as he opens the door. Castiel tries to turn away, down towards Sam's new room, but Dean's grip on his wrist stops him. \"I love you.\"\nCastiel's expression crumbles and he's back in Dean's arms without another word, clinging, holding him so tight. In a moment, Dean will have to let him go. Send him to Sam and start his journey back to the mirror, back to his never-ending quest.\nBut for now, he's right where he needs to be.\n*******************\nStupid mirror. Dean hates that he needs the thing. Before he touches the glass yet again, Dean allows his mind to sweep him into a very pleasant daydream of taking a baseball bat to the mirror. The satisfying Crack! and subsequent shattering of the glass into a million jagged shards gives Dean a real thrill.\nHis life is pathetic. But he's leaving behind another person who's getting a chance at happiness and Dean's jumping into this fucking mirror yet again. In light of that, he's probably allowed to be a little pathetic.\n\"See ya, Cas,\" he says as he lets his fingers fall onto his only current constant.\nCastiel is watching him from the doorway of the mirror room when Dean shakes off the zap of energy. His confusion has Dean lifting his hands, palm up.\n\"Don't shoot,\" he jokes. \"It's me. Well, not your me. I'm from another world. I came through that mirror.\"\nHe's never seen Castiel's eyebrows raise that high before. Luckily, this Castiel is clad in his boring old trench coat and blue suit combination, his hair styled in his perfect Heavenly sanctioned look. He should be more than powerful enough to tell that Dean's not lying.\n\"Check me out. I got your mojo in me, I swear. Is Sam here?\" Right now, more than anything, Dean wants to see a regular Sam who's not in love with his angel. As much as he needed to help those two, he wants things back to normal. \"Please tell me he's around somewhere.\"\n\"He's downstairs,\" Castiel says, frowning. \"We've both been looking for you.\"\n\"I'm sure I'm around here somewhere,\" Dean says, peering past Castiel into the hallway. \"Knowing me, probably hiding in a closet,\" he says, snorting at his own bad joke.\n\"Dean...\" Castiel narrows his eyes at him. \"Are you unwell?\"\n\"No, why?\"\n\"You're not making sense.\"\nDean sighs. Castiel usually catches on to the situation much faster. Thank god he got some sleep last night. His brain can handle the questions.\n\"I know it's weird, but it's true. That mirror is sending me through dimensions and I'm trying to find my way back to the right one-\"\n\"Dean,\" Castiel interrupts as he walks right up to Dean, reaching out to curls his hands around Dean's shoulders. \"I have no idea what you're talking about. You are not in the wrong dimension.\"\n\"No, but see...\" Dean pauses. \"No because I've been...all over...what?\"\n\"I promise you, I would recognize you anywhere,\" Castiel says. His hands press harder into Dean's flesh, probably bruising him. Anchoring him, holding him to this world. Everything about this Castiel is familiar. The right clothes, the right hair, the same subtle distance in his eyes covering a vast unimaginable amount of affection. Dean's legs weaken and he grabs at Castiel's elbows.\n\"What?\" he repeats stupidly.\n\"There is no other Dean here. You are my Dean,\" Castiel declares, voice deep and possessive.\nFor a moment, only a second, Dean stares, too amazed to move. There's no question of belief. Besides Castiel's inability to recognize Dean as from another world, Dean knows that tone. It's Castiel's 'Do what I say or I'll fuck you up' voice. Believing anything said in that tone is too ingrained in Dean's psyche to do anything other than accept what Castiel says as the complete truth.\nIt sinks in suddenly and Dean snaps.\n\"Fuck, yes,\" Dean groans, struggling out of Castiel's grip to throw his arms around Castiel's neck. \"Oh my god, Cas, I thought I was never going to find you again. You have no idea. It sucked so bad and I was a girl and you were a girl and fuck, I love you.\"\n\"What?\" Castiel says, his turn to be startled. He pushes Dean away enough to look into his face, his eyes lit with shock and hope Dean's seen before, but never here. Not in these eyes. His Castiel's eyes. Dean knows he should answer him. Should explain his journey and spell out exactly how much Dean loves and wants him, but for the first time in a dozen worlds, he's with his Castiel and he's officially tired of holding back.\nDean kisses him. Full on the mouth, tracing Castiel's lips with his tongue, eager to taste and connect. Castiel opens to the kiss, his chest hitching with a surprised moan that Dean immediately wants to hear again. He walks Castiel backwards until they hit the wall and presses hard against him, unable to get close enough.\n\"Dean?\" Castiel gasps when Dean pulls back to draw breath. \"What happened to you?\"\n\"I don't know,\" he says, one hand sweeping down to palm Castiel's chest. \"I left and you were always there. But I couldn't have you.\" Dean's aware he's babbling, but he can't find a way to stop. \"There was always another me. God, it drove me nuts, Cas.\" He kisses along Castiel's jaw. \"Wanted you so bad.\"\n\"Did you...\" Castiel releases a short gasp when Dean bites down on his earlobe. \"Did you always feel this way?\"\n\"Yeah, too stupid to see it. Sorry, so fucking sorry,\" Dean says distractedly, more interested in the way Castiel's shaking apart in his arms than on his words. \"Always loved you, Cas.\"\n\"Dean,\" Castiel sighs, tipping his head back and rolling his hips like his last counterpart had, only this time, it's intentional and Dean can feel Castiel's hardening dick against his own.\nHoly shit, that's amazing.\n\"Swear to god, if you don't stop, we're fucking right here-\"\n\"Guys?\"\nDean's forehead drops onto Castiel's shoulder. Of couse. Sam. The inter-dimensional cockblock. He appears in the doorway and jerks back in surprise at the scene before him.\n\"What the hell are you doing?\"\n\"Dean loves me,\" Castiel says dazedly.\n\"Um...okay?\"\nHis utterly bewildered tone reminds Dean how much he'd missed him, his own Sam. The only Sam Dean knows inside and out, the only one with the exact same past as him. With some reluctance, he releases Castiel and gives Sam a less pornographic version of the enthusiastic hug he'd given Castiel.\n\"Goddamn, I missed you, Sammy.\"\n\"What is going on?\" Sam demands, although he does return the hug, giant hands patting at Dean's shoulder.\n\"You know what,\" Dean says as he steps back and takes Castiel's hand. \"It's a long story. And I'm tired and I wanna fuck Cas.\"\n\"Wow, okay,\" Sam says, holding up surrendering hands. \"I'll ask later.\"\n\"Yeah, ask me...\" He eyes Castiel thoughtfully. \"Tomorrow morning. And get your own room.\"\n\"Definitely,\" Sam says, nose wrinkling with disgust.\nDean ignores him in favor of turning to Castiel and once again, laying his forehead against Castiel's. Except it's entirely different. Because Sam doesn't want to think about Cas and sex in the same sentence and Cas isn't a girl and he's not human and he's doesn't belong to some other Dean.\nHe belongs only to this Dean.\n\"Take me home?\"\nAnd so Castiel does.\n*******************\nDean watches Castiel sleep. The angel doesn't need to sleep, of course, but it'd taken very little to talk him into making his Grace retreat and letting the human body he now owns take over. A decision Castiel's particularly enjoys when Dean's mouth closes over his erection and Dean works him to what he suspects is Castiel's first orgasm. Definitely the first with a partner. It's going to take Dean awhile to get used to giving blow jobs, but watching Castiel completely lose his control is well worth the effort.\nHe places a palm in the center of Castiel's bare chest, smiling at the gentle beat that thrums against his skin. Just an hour ago, Dean had been buried deep inside Castiel's body and leaning down to press a kiss to his pulse point, noting even in the heat of urgent pleasure the way Castiel's pulse beat rapidly against his lips. Dean still has so much to learn about Castiel. Both in bed and out. Though truth be told, he's more eager for the bedroom lessons. After nearly four years, they have a lot of catching up to do in that department.\nTo think he almost missed this. Dean knows he won't let go of that what-if very easily. If not for a freaky mirror, Dean might have settled for less than love. Dean doesn't believe in soul mates, but after that trip, he certainly believes in the universe nudging you in the right direction. He can't wait to tell Castiel about all the bizarre worlds that brought him to this very moment.\n\"I got the message, thanks,\" he says quietly.\n\"Good.\"\nDean nearly jumps out of his skin. Only instinct developed over years of dangerous situations keeps Dean from screaming like a little girl. He flips away from Castiel, making sure to put his body between Cas and whatever is speaking to him.\nEven in the dimness of the room, Dean immediately recognizes his visitor. Recognizes, but can't quite believe is here.\n\"Cas?\"\nShe smiles and crooks her finger, beckoning Dean towards the door to the room. Curiosity has Dean hurriedly tugging his pants up his legs and stumbling after her. His Castiel peacefully snores on, not a care in the world. Once Dean joins her in the hallway, this Castiel turns to him, her dark brown eyes glittering with some emotion Dean doesn't recognize.\n\"I wanted to say goodbye and explain myself.\"\n\"What the hell is going on?\"\nDean finally understands how the people in those other worlds must have felt when he turned up out of nowhere.\n\"You have a lot to talk about with your Castiel in the coming days,\" she says, brushing a lock of her long blond hair out of her face in an oddly human gesture. \"I knew the why would eventually bother you too much for true peace.\"\n\"It was you,\" Dean guesses, not any closer to understanding than before she showed up.\n\"It was,\" she agrees.\n\"But why? And how? How are you even here? There's already a Castiel here.\"\nShe cocks an eyebrow and gives Dean the classic 'no duh' look. Which, really, he probably deserves. But none of this makes any sense to him. All he knows is that this woman is Castiel. He can't mistake that fond exasperation any more than he could if he were looking at the man laying in the bed in the room behind him.\n\"I'll make this as brief as I can,\" she says. \"In my universe, the war took nearly all my brothers. When they were gone and my Father returned to create order from chaos, he bestowed upon me the title and powers of archangel. In my existence, I had never wielded that kind of power. So much power that I found I could break through the barriers between worlds. But even so, I couldn't bring them back.\"\nHer sadness breaks Dean's heart all over again and he wishes he'd just gone to sleep when Castiel did. He hates seeing Castiel in pain. Any Castiel.\n\"Them?\" he can't help asking.\n\"Sam,\" she says and for the first time, her voice wavers as she continues, \"And Dean.\"\n\"They died? And your fuckhead Dad wouldn't bring them back?\" Dean asks, though he's not even surprised anymore. \"What a douchebag.\"\n\"Yes,\" Castiel says simply.\nThat surprises Dean. His Cas believes so faithfully in the good of his Father. Even after everything that's happened without God interfering. Dean wonders if this is the line. Losing him and Sam. Doesn't really want to know, but he knows he owes it to Castiel to listen to her story.\n\"How come?\"\n\"I think He knew I'd be here now,\" Castiel says, her tone now even and accepting. \"Telling you why I sent you into that mirror.\"\n\"Because of me?\" Dean murmurs, eyes wide. That's way too much for Dean to shoulder.\n\"You and others like you. I've been traveling for longer than I can remember.\" Her smile returns, so human that Dean aches to see it. He hopes his Castiel never has to learn how to be anything other than a dorky angel. \"You're not always so difficult to teach. But you're also not the worst. Not by far.\"\n\"Gee, thanks,\" Dean says, more out of habit than true irritation. \"So what, you're jumping in and out of universes and finding Deans to screw with? What's the point?\"\n\"The point is, someday I'll find one I can keep.\"\nDean can't begin to fathom it. His journey times a million, except she doesn't know if there's a world out there for her, not like Dean knew his Castiel was waiting. How could anyone have that kind of patience? How is it possible for this creature to love him so fucking much?\n\"God, Cas,\" he breathes. \"How can you stand it?\"\n\"I have faith,\" she says. \"And I'm very stubborn. That's why it's such a difficult task. Finding a world where my counterpart isn't clinging to your side has proven very trying.\"\n\"I don't know what to say,\" Dean says, utterly helpless in the face of her immense devotion.\nHer smile grows and she reaches up with both hands to cup Dean's face.\n\"Just say you'll be happy.\"\nThere has to be more he can do. There has to be more for this Castiel than just giving happiness to others. Dean could barely handle it for a few days. Who knows how many years she's been searching for her own Dean? He wants to do more for her. It hurts too much to think he can't.\n\"Cas-\"\n\"Please,\" she says, eyes dark with emotions Dean could never deserve. \"Just promise me you'll be happy.\"\nHe covers her hands with his own.\n\"I already am.\""
}