{
    "id": "31111568",
    "url": "https://archiveofourown.org/works/31111568?view_full_work=true",
    "author": [
        "Angeeelatin"
    ],
    "title": "The Field Trip",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [],
    "fandoms": [
        "Marvel Cinematic Universe",
        "Spider-Man (Tom Holland Movies)"
    ],
    "relationships": [
        "Peter Parker & Tony Stark",
        "Michelle Jones & Ned Leeds & Peter Parker",
        "Betty Brant & Cindy Moon"
    ],
    "characters": [
        "Peter Parker",
        "Tony Stark",
        "Ned Leeds",
        "Michelle Jones",
        "Flash Thompson",
        "Cindy Moon",
        "Betty Brant",
        "OCs",
        "Roger Harrington"
    ],
    "additional_tags": [
        "Peter Parker's Field Trip to Stark Industries",
        "Flash Thompson being an Asshole",
        "Peter Parker is Tony Stark's Heir",
        "Peter Parker is the heir of Stark Industries",
        "Intimidating Peter Parker",
        "BAMF Peter Parker"
    ],
    "language": "English",
    "series": "Part 16 of Angel's Marvel One-Shots and FicsPart 5 of Peter Parker & Stark Industries",
    "published": "2021-05-06",
    "completed": null,
    "words": "5,222",
    "chapters": "1/1",
    "comments": "83",
    "kudos": "9,340",
    "bookmarks": "856",
    "hits": "106,534",
    "summary": "<p>I think its time.</p>\n<p>The field trip fic.</p>\n<p>Or: how peter's team decided enough was enough and invited midtown over to SI to deal with their baby boss' <em> bullying issue </em>. Surprisingly, they didn't have to do a thing. </p>\n<p>At SI, Peter Parker bows to no one, especially not to an entitled brat like Flash Thompson or this asshole from the military who came to stir up trouble.</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a>.)</p>\n<p>I'm not too sure of this fic. I wrote it down this afternoon but I feel like everything didn't come out the way I wanted?? I think I'll leave this here for now but i might come back Nd add another chapter. Who knows<br>Anyways~<br>Feedback and comments are appreciated and welcome!<br>Thanks for stopping by~</p>\n<p>6/9/21</p>\n<p>I set up a tumblr!If you have a prompt or just want to hmu, see my <a href=\"https://bit.ly/2RFkoLH\" rel=\"nofollow\">tumblr</a>! I'm open to anything though I can't promise I'll write them immediately.</p>",
    "text": "Roger Harrington has been arranging a field trip for the Academic decathlon team for a while now.\nSomehow, all their field trips ended in… disaster.\nSo, he wanted this year's field trip to be the best. As such, he emailed and messaged Stark Industries for a spot on their tour week.\nSubject: Tour Group for the Academic Decathlon Team\nFrom: Mary Royle ([email protected])\nTo: Roger Harrington ([email protected])\nGood afternoon, Mr. Harrington. This is Mary Royle, the intern head of the HR department of Stark Industries. I am emailing to inform you that your request for a tour in Stark Industries has been approved. Attached here is the tentative schedule of events, date and time, and other relevant information you need to send within the week. To confirm, please reply in the next 24 hours. Thank you and have a good day.\n[Attached: Midtown_schedule.pdf, NDA.pdf, name_info.pdf]\nOpening his email and seeing the message, Roger jumps up in joy, surprising the surrounding teachers in the faculty room. Sheepishly rubbing his neck, he sits down and types up a reply.\nThis was going to be a good fieldtrip.\nHopefully.\nMeanwhile, in SI, all the intern heads were currently in a meeting. Hell Week starts in 2 days and they needed to iron out all the details.\nSince SI announced all the changes after the civil war fiasco, they introduced Hell Week.\nTo make sure that the security of Stark Industries would not be compromised, HR decided to reserve a week for every four months dedicated to tour groups and other events involving outsiders. This way, SI would only need to up the security for a week every four months instead of regularly.\nIt worked for the company. There weren't any incidents like last year.\nHowever, for the interns? The week quickly became known as Hell Week. All interns were going to cycle through the various tasks required, like the touring, Q&amp;A, arranging, etc. As such, they were all miserable.\nCurrently, they were in meeting room Alpha discussing what to do for the first day.\nIn the center of it all, Tony Stark sits in the middle of the long table. All participants in the meeting are staring at the projected screen of an StarkPhone and specific email. Locking eyes with each other, they let out identical cackles.\nThey had heard Peter was being bullied at school by some kid and was too much of a goody-two-shoes to do anything about it. He, obviously, didn't plan to do anything about it.\nThey concluded that they would have to do it themselves.\nThat's why, they decided to dedicate the first day to Midtown High.\nNormally Hell Week was a pain in the ass but this?\nOh this was going to be good. \nTick. Tick. Tick. Tick. Ti-\nCovering his ears, Peter glares at that bastard of a digital clock. For the past few minutes, he'd been hearing the damn thing tick tick ticking and it was starting to get on his nerves.\nRight now, he had a class with Ms. Warren who, though was usually sort of interesting, was currently droning on and on and on and on on a, quite frankly, easy topic. (Read: It wasn't an easy topic. Everyone didn't know what the hell was going on. Peter was just too oblivious to notice.) He was bored out of his mind. So bored, in fact, that he started stealthily drawing a caricature of his teacher.\nIt was supposed to be a life-like drawing but alas, Peter wasn't destined to be the next Leonardo da Vinci. Thus, he settled with calling it a caricature.\nIt looked nothing like Ms. Warren.\nWhile he was drawing his caricature, he failed to notice MJ looking over his shoulder. MJ, the resident artist, was wondering what Peter had been so engrossed in. Turns out, he was drawing a quite frankly disturbing picture of their teacher.\nIt was so disturbing that MJ could only shiver and dazedly stare at the white board.\nWhat might have been a short time of dazedly chanting 'what the fuck' as Peter Parker finished his weirdly disturbing picture was, to the class, literally the entire period. Suddenly startled out of her daze, she tuned back into the conversation only to hear Ms. Warren say, \"Miss Jones, you are being called to the teachers' lounge. Mr. Harrington has something to discuss with you.\"\nNodding to notify her that she was going to head there after the class, MJ started packing up. Its nearing the time of year for the team field trip.\nWalking towards the lounge, MJ couldn't help but wonder where. Hopefully it wasn't going to be as disastrous as the past ones.\nShe takes it back.\nThis fieldtrip was going to be disastrous.\nWhere were they going? Where else.\n\"We're going to Stark Industries in two days.\" Passing out the consent forms, NDAs and other needed documents, she continued. \"Yes, yes. It's exciting or whatever. Quiet down. I'm passing out the relevant documents that you need to pass tomorrow. Understand?\"\nThe team nodded their understanding, but MJ wasn't satisfied. \"I don't think you heard me. Peter. You need to pass this tomorrow. Un-der-stand?\"\nThe boy in question, Peter, was currently miserably staring out the window. \"I don't think I do, Miss Jones. It seems that I have another plan set up for the day after tomorrow. Terribly sorry. I have to go and watch over my spiders.\"\nRaising her eyebrow, she glared. \"Parker, if you don't go, I will personally kill your spiders. Do you want to test me?\"\nInstead of answering her question, Peter looked out the window miserably. \"This is it, narrator. This is it.\"\n\"Peter, what the fuck are you talking about?\"\nStaring right into her eyes, as if challenging her, Peter said, \"This is my villain origin story.\" After which, he promptly stared out the window again, not bothering to participate in the conversation. Behind him, Ned mouthed to the team, 'I'll take care of it.'\nIn the front of the room, MJ sighs, resigned. She was going to have to threaten the two resident hooligans, wasn't she? Glaring at the ceiling, MJ couldn't help but curse Liz slightly. Why did she have to choose her to be the captain. \nShe wasn't paid enough for this.\nPeter leaned on his locker, mournfully moaning. \"MJ, I don’t want to go.\" Prolonging the last word, he started to cry tears of anguish. Looking at them, Ned didn't know whether they were fake or not. Knowing Peter, they probably weren't fake.\nIn response, MJ only stared Peter down coolly. \"You'd sooner divert a river from its course before I allow you out of this one, Parker.\"\n\"But, but I don-\"\n\"Stop arguing. You'd have to die before I excuse you.\"\nSuddenly collapsing to the floor, Peter mutters incoherently, staring into space as if seeing a being only he could see. \"The lights…. Fading… I see … stairs … hear… singing… gospel songs…\" Staring at his hands that he obviously started to shake intentionally, he continued. \"my hands… growing numb… this is… it… death… I… welcome you…\"\nUnimpressed, MJ cuts into his tirade. \"Shut up, asshole, we're literally in front of you.\"\nHowever, like every hero protagonist, Peter soldiered on, knowing full well the risks of this move. \"Why…. Does satan… look like… MJ…? I knew… she was… evil… Ned! Be fooled… no longer… the truth… shall p-prevail…!\"\nGlaring, MJ pulled out her big guns. \"Are you going to go on this field trip or should I ask Tony for permission.\"\nJolting in fear, Peter hurriedly stood up and agreed. \"I'm going, I'm going. Who said I wasn't?!\" Turning away, Peter stealthily wipes off the cold sweat on his brow. Phew. Close call. Shivering in fear, Peter knew that if Tony knew… He was going to raise hell.\nIt was better to go quietly than have Tony be informed of his trip.\nThat afternoon, Peter arrives at the tower nervously. Tony, who has been waiting for this the whole afternoon, sits smugly on the sofa, coffee in hand.\n\"Hey, kiddo. How was school? Anything noteworthy happen?\"\nLaughing nervously, Peter took off his jacket and shoes. \"O-oh… nothing happened. You know. Just the usual. Nothing interesting at all happened. Yeah… I need to… greet aunt May… uh… bye…?\"\nPatting himself on the back for his quick thinking of shutting down the conversation, Peter turns to the elevator to check up on May, completely missing the look on Tony's face promising absolute chaos.\nPeter would never know what hit him.\nSitting on the bus, Peter was so close to just jumping out of the window and hope for the best. For the past few minutes, Flash just wouldn't leave him alone.\nLooking at Peter who was rubbing circles on his forehead with irritation, Ned could practically feel the incoming migraine. Poor thing.\n\"Hey, Penis. You excited to see your,\" making quotation gestures, \"'work place'? Bet you aren't even an employ-\"\nCompletely irritated, MJ cuts him off. \"Hey, Flash.\"\nTurning to MJ, Ned expected her to flip Flash off but he was surprised. Instead of flipping him off, MJ held up her hand, making the universal gesture of short with her thumb and pointing finger.\nNodding patronizingly, she said. \"You're giving off a lot of small dick energy, right now. You have a crush on Peter or something?\"\nLooking at the horrified and angered face of Flash Thompson, MJ commits it to memory. Flash has never looked so offended.\nYep, MJ didn't regret it one bit. It shut him up and was going to go in the sketchbook later tonight.\nBeside her, Ned couldn't help but sweatdrop. As expected of MJ. Truly an outstanding individual, meant for absolute greatness.\n\"Hey, Penis! Look its Stark Industries! Take a good look, loser, you're not going to be able to see it again because of your lies.\"\n\"Fuck off, Flash.\"\nSurprised by Peter cursing, Mr. Harrington turns to the two, nervous that the employees of SI might have a bad opinion on their school. Sternly, he said. \"Now, Mr. Parker, that type of language isn't encouraged in our scho-\"\n\"He literally just called me Penis, Mr. Harrington. What's your point?\"\nSputtering, the teacher tried to salvage the situation only to be interrupted by the arrival of their tour guide, an intern from R&amp;D Peter was familiar with, Amanda Rodriguez.\nSmiling with her teeth bared, Amanda said. \"Good morning! You must be Midtown High! I'm Amanda Rodriguez,\" gesturing to her ID, she continues. \"She/her pronouns, as observed on my ID, please. I will be your tour guide for today!\"\n\"Now, I must emphasize one of SI's most important and main rule. We do not condone any type of bullying. Whether that be from…\" quickly glancing at Flash, \"children or biased… adults.\" Obviously showing that she had heard the words of Mr. Harrington.\nSheepishly, the teacher turns red and moves to the back of the group, embarrassed. Nonchalantly observing, she continues, \"Now, I'll be handing out your ID cards in a moment. These are just plain white ones, as  you can see. This is to signify that you all are visitors. At the end of tour, you will be returning these cards to me so that they can be reprogrammed for the next tour. No unnecessary waste, see?\"\nWalking towards the security, Amanda swipes her gold ID card. \"Amanda Rodriguez. R&amp;D Intern and Tour guide. Clearance level: Silver 2, temporary Platinum 1. Welcome.\" \nCaught by surprise, the students aside from Ned, MJ and Peter jolt. \"This is SI's main AI, FRIDAY. She manages everything in the company. Do anything suspicious, she will know and we will not hesitate to kick you out.\nWalking past security, she motions for the students to swipe their cards and enter too.\n\n\"Betty Brant. Visitor. Clearance level: Lurker. Welcome.\"\n\n\n\"Cindy Moon. Visitor Clearance level: Lurker. Welcome.\"\n\n\n\"Abraham Attah. Visitor. Clearance level: Lurker. Welcome.\"\n\nAs FRIDAY continued to call out the names of the rest of the Academic Decathlon team, Betty couldn't help but wonder about the differences in levels of clearance and ID cards. Raising her hand, she asked Amanda. \"Excuse me, maam. What are the different clearance levels? Why is your ID gold?\"\nNodding approvingly, Amanda answers, turning to the whole group so they can hear her answer as well. \"Nice catch, Ms. Brant. If you'll notice, your IDs are white which signifies you are visitors. If you look behind you towards our security guards, their IDs are red, signifying they are part of the security. There's none here so you won’t see it but the press will only get a black ID.\"\nHolding up her gold ID, she continued. \"Mine is gold, signifying I am an employee of SI. All employees have gold IDs labelled with their name, picture and pronouns only.\"\n\"If you heard FRIDAY just now, you'd have heard her say my clearance level is Silver while yours is lurker. That’s because SI has 10 clearance levels. The first is ghost, meant for the press. The second is yours, lurker, for visitors. The third is bronze, for family and friends of employees. Fourth is silver and has 2 sublevels: 1 for high school and 2 for college interns. Fifth is gold for intern lab directors. Sixth or platinum has three levels for employees of different departments. Seventh, diamond, has two levels as well for floor directors and the board of directors or investors. Eighth is Elite which has two levels. The first for the Stark security details, PAs and other people that interact directly with the big bosses. The other is for close friends and family of the bosses. Ninth or the Gods is for the New Avengers when visiting.\"\n\"and the last?\"\n\"The last, tenth, is called Titan. They are exclusive to the big bosses.\"\nWhile Amanda was busy with her explanation, Flash was busy laughing at Peter, Ned and MJ. \"Hey, losers. You weren't given IDs. Are you really that thick-skinned that you're shameless enough to push your way through? I know you aren't an employee at SI, Parker. Let's see if you're still so high and mighty now.\"\nNow normally, Peter would roll over and let Flash get away with it. However, he was in Stark Industries at the moment.\nHe was in his company.\nLetting the employees in SI see that their CEO-in-training would allow a bully to get away with it wouldn't look good.\nHere, he was not going to bend over.\nWith a patronizing nod, Peter takes his obviously gold ID card out of his front pocket and swipes it. \"Peter Parker. Intern dictator. Clearance level: Titan. Welcome back, Peter. Are you heading to the Intern Labs?\"\n\"No, fri. I'm here for a tour.\"\n\n\"Michelle Jones. Visitor. Clearance level: Elite. Welcome back, MJ.\"\n\n\n\"Ned Leeds. Visitor. Clearance level: Elite. Welcome back, Ned.\"\n\nTurning back to the frozen Flash, Peter said with a sarcastic tone, \"Yeah, I totally agree. Who the fuck said that I'm an SI employee?! God, what a dumbass.\"\nTurning to walk away, Peter sashays to the dumbfounded tour group, throwing out one last sentence. \"Might want to thaw yourself out, Flash. Stay frozen any longer and you'll miss the entire tour.\"\nStartled out of his shock, Flash hurries into the elevator, noticeably quiet. Quickly giving him a side-eye, Amanda nods, satisfied. Hmph. That’s what he gets for trying to insult their baby boss. Initially, she was planning to consult with the main team on what she should do about it, but to her surprise, Peter dealt with it quickly and efficiently.\nAs expected of the Intern Dictator and their CEO-in-training. When at SI, Peter Parker bows to no one.\nMaking sure everyone was on the elevator, Amanda calls out to FRIDAY. \"Floor 18, please, FRIDAY.\"\n\n\"Noted, Ms. Rodriguez. Floor 18. R&amp;D Intern Labs. Please exercise proper lab etiquette.\"\n\n\"Now. Our first stop for this tour is the R&amp;D Intern Labs on Floor 18. Right now, the interns over there are working on a new project on air pollution. As such, I hope everyone refrains from disturbing them and asking questions. We'll stay within the yellow lines that you'll see when we arrive. Don't get lost. If you have any questions, you ask me. There will be time for a Q&amp;A later.\"\nTurning towards the doors of the elevator, Amanda stops just in time to hear the ding of the elevator, signifying their arrival. \"Floor 18. Intern Labs.\"\nStepping in, the team looked around, mumbling exclamations of awe.\nPeter understood. The first time he came in here, he was that amazed too. For a floor that was just an intern lab, all the equipment were state of the art and could be easily cleaned.\nHowever, Peter was already used to the sight so, instead of joining the tour that he already knew practically every detail of, he decided that he would help out the other interns.\nRoaming around the room, Peter starts to look at the different prototypes of the interns, making comments along the way. Noting he wasn't around, Flash raised his hand. \"Why can Peter go there but we can't.\"\nTurning to the stare at the kid she absolutely despised, Amanda said coldly. \"Well, when you became the head of all intern heads and manage all the interns at Stark Industries, let me know and I'll let you do that too.\"\nWhile the team continued on with the tour, Peter stayed back to help one of the interns. However, probably because he enjoyed himself too much, he lost track of time.\nSuddenly, Amanda gets his attention. He hears her mention that they were going to go to the cafeteria for lunch. As such, Peter ambles over, apologizing to the interns surrounding him and promising he'll be back to check it again.\nStanding beside MJ, he asked her if he missed anything important. Shrugging, she said. \"Not much. We just looked around and had a short Q&amp;A at the end. Flash asked dumb questions, as usual, and I got a lot of new material to draw but that’s about it.\"\nAt the cafeteria, Peter orders his usual: The Spider-man Special, made by Tony when he found out that Peter liked to eat with the other employees down at the cafeteria when he was at work. It was four sandwiches, a pizza, 3 pieces of chicken, a side of mashed potatoes, 2 milkshakes and 2 burgers. It was a hulking amount of food, usually ordered by either Spider-man or Peter Parker or by an enthusiastic group of employees who planned to share.\nHappily collecting his order, Peter made way to his usual table by the wall of the cafeteria with Ned and MJ.\n(Peter doesn’t notice, but the lady serving the dishes gives him a long glance. Everyone but Peter at Stark Industries lowkey knew that Peter was Spider-man. He was really bad at hiding secrets, after all.\nEveryone saw him stick onto the ceiling when one of his experiments exploded in shock. He had looked around hurriedly, trying to see if anyone saw him. Coming to the conclusion that no one saw him, he continued on with his day.\nEveryone saw him.\nLuckily, everyone at SI adored Peter. They, obviously, wouldn't sell him out. They even signed an NDA about it.)\nBeside him, the next in line, Flash Thompson, sees Peter order the massive amount of food. Thinking he was showing off, Flash decided to order the same thing. Peter Parker wasn't anyone special, just a random kid in his school. If he could order it, so could Flash.\nPurposely walking by their table, Flash shows  his obviously identical order and said. \"Yo, Parker! Quit showing off. I know you won't finish that Spider-man special. Anyways, I'm gonna finish mine right over the-\"\n\"Quit it, Flash. This isn't an airport. You don’t have to announce your destination. We. Don’t. Care.\" Ned said while chewing his sandwiche absentmindedly.\nTaken aback by the sudden dismissal, Flash opens his mouth to continue his tirade only to be stopped by MJ's glare. Scared, he scurried towards the table his friends sat at.\nBy the time an hour passed, Flash looked positively green, obviously sick from eating too much. Meanwhile, across the cafeteria, Peter happily finishes his food and gets up to order another meal, obviously still hungry. However, he was interrupted by Amanda's announcement.\n\"Attention, Midtown! Lunch ends in 8 minutes so please prepare yourselves and clean up!\"\nDone cleaning up and eating, the students converge in front of the elevator. Moving inside, Amanda asks FRIDAY to go to the museum. \"Floor 1. Stark Industries Museum.\"\nFinished with her task, she turns to the students. \"Now, we will be going to the museums of SI. In total, they span 3 floors. The first is the SI museum which showcases the evolution of SI through the years from Howard Stark's era to Tony Stark and finally, to Pepper Potts. The second is the hall of science which we will visit last. Here, the most notable research and inventions of SI employees and scientists are displayed. The third is the Avengers museum which shows the story of the Avengers which then evolved into the New Avengers.\"\nHearing a ding, the elevator opens, revealing the face of Howard and Maria Stark. \"We are now in the first floor: SI museum. You'll have 30 minutes to look around before we move to the Avengers floor. Look around and I'll call you back 5 minutes early.\"\n\"Dude, there's a Spider-man display!\" Ned said excitedly, motioning for Peter and MJ to hurry. Seeing this, Peter groaned. He had confirmed with HR that the Spider-man display wasn't ready for viewing when he had asked in preparation for the trip last week.\nWhy was it here?\n(Upstairs, Tony and the intern heads all busy with their various workloads all sneezed simultaneously. They had expedited the construction to get it done in time for the tour.\nLet it be known that Peter's main team were full of little shits.)\nKnowing his team, Peter could only let out a resigned sigh. They probably made sure it was finished by now. Honestly.\nQuickly reading through the labels, MJ turned to Peter. \"It says you could talk to and control spiders. What… you do that?!\"\n\"Huh?!\" Leaning closer, Peter could make out the words 'has a habit of talking to spiders and asking them to do simple tasks'.\nWhat.\nTurning to MJ, he said seriously. \"I cannot talk to spiders. We tested it and everything. Tony must have put that there for shits and giggles.\"\n(He didn't.)\nWalking down the Hall of Science, Betty's eyes couldn't help but pay attention to the small tags on the various inventions and research that are displayed on the floor.\nNoticing one very familiar  name, Betty let out a yelp, surprising the person beside her, Cindy.\nGetting her attention, Betty whispers hurriedly. \"Cindy, Cindy! Look at this tag. That says what I think it says, right?\"\nLeaning in closely, Cindy curiously reads the tag.\n\nMedical Braces | 2018\n\nTony Stark,\nin collaboration with\nPeter Parker and Helen Cho\nCindy breathes out, awe evident in her tone. \"No. way. Peter made the medical braces that SI recently released?!\" Turning to Betty, she said, words rushing out hurriedly. \"Peter Parker. I mean all of us lowkey knew that he had an internship at SI but… he actually…\"\nGetting her thought, Betty finished for her. \"He works with Tony Stark. Oh. My. God.\"\nSo here's the thing: Peter Parker didn’t like showing off. He was a lowkey kind of kid, you know?\nEveryone in Midtown knew that Peter was going to be one of the greats someday. The kid was probably the only student they knew that could ace literally everything without studying.\nHe won science fairs, spelling bees, academic decathlon competitions. The schools needs to win an important competition? Call Peter Parker.\nPeter Parker was a gifted kid. But he never like attention. It made him feel itchy, like there were ants crawling all over his body. Its why he made it a goal of his to never stand out.\nHowever, though Peter didn't try to get attention, he always acquired it somehow. There was something magnetic about him, as if screaming that he was meant to be someone. \nAs if he was some unreachable, untouchable being.\nAnd in some way, he sort of was. Peter had his own little friend group, just Ned and MJ. Those three had their own world. They did everything together and thought they obviously though of themselves as the outcasts, the nerds of Midtown, they were looked to be untouchable.\nIt made people envious. It was obvious that those three had a connection with each other, the type that could last a lifetime. No one could just slip into their dynamic.\nThat's why, everyone in Midtown was aware that Peter had an internship at Stark Industries, not because Peter went around to boast about it, but because Flash just couldn't leave him alone.\nHonestly, Flash should just fuck off.\nStill, though Cindy always believed that Peter really did have an internship with Stark Industries, she never thought he worked with fucking Tony Stark. Good lord.\nLooking around more attentively, she noticed that there were more and more tags with his name on it.\n \n\nWater Purification System | 2018\n\nWilliam Graves, Harry Gray, Gill Bert,\nIn collaboration with\nPeter Parker\n \n\nFlexible Rescue and Construction Web | 2018\n\nPeter Parker\n \n\nIron Spider Suit | 2018\n\nTony Stark\nIn collaboration with\nPeter Parker\n \nCindy was speechless. Looking around, she saw more than half of the research displayed in the museum that was published in the past 2 years had the words: 'in collaboration with Peter Parker'.\nThere were more than four major inventions that Peter made or contributed to.\nHoly shit. \nTurning to look at the boy in question, Cindy couldn't help but think. She had thought that Peter was going to be one of the greats someday. She was wrong.\nPeter Parker was already one of the greats.\nTurning to her watch, Amanda checks the time. They should get going if they wanted to tour the other facilities and attend the Q&amp;A at the meeting sector later.\nTurning to the tour group, she calls out. \"Everyone, you have 5 minutes to wrap everything up! We need to get going to our next destination.\"\nSuddenly, her walkie-talkie crackles to life. Amanda listens to the message carefully, making sure to remember every detail.\nMoving to stand beside Peter, Amanda whispered. \"Peter, Mr. Stark and Ms. Potts had to leave for an emergency at the Hong Kong headquarters. They left you in charge. The intern heads have already taken over position.\"\nMaking sure to school his expression, Peter nods minutely. There must have been a problem in the investors in Hong Kong. He vaguely remembered a conversation he and Pepper had on the problems with their latest investment.\nTaking a deep breath, Peter calms himself down.\nThis was fine.\nIt was just like the usual.\nTurning to Amanda, Peter asked, \"Is there anything urgent I have to deal with?\"\nShe answered with \"No, I don-\" only to be cut off by FRIDAY. Suddenly, her voice rings across the museum. \"Mr. Parker, Protocol bastard has been activated. General Rolland barged into reception demanding an audience. According to boss, you have full control of the situation and to do as you pleased.\"\nNodding, Peter valiantly ignores the stares from his teammates. \"Send him to meeting room omega on floor 68. I'll handle it.\" Turning to Amanda, he said. \"I'll leave this tour to you?\"\nSeeing her nod her consent, Peter moves to the elevator. \"Take me up to the meeting room, Fri.\"\nWhen the elevator doors close, the team suddenly startles out of their stupor. What just happened? Did Peter just...? What the...\nClapping to regain their attention, Amanda smiles her PR smile. \"Mr. Parker has something to deal with so he won't be joining the tour. Instead, we will be touring the various facilities of SI before you leave.\"\nDing.\nThe elevator doors open to reveal the meeting sector of the company, Topaz. Leading them across the floor, Amanda said. \"We are currently on floor 68. We will be having a Q&amp;A session in one of the meeting rooms here to finish the tour!\"\nWalking along the hallway, the group was suddenly disturbed by the sound of a hand slapping a table. Turning to the side, they are greeted by the sight of one Peter Parker staring down a hulking man known as General Rolland, the strictest military general in the US right now.\nSeeing their normally dorky classmate stare down one of the most influential and intimidating figures in US politics today, the team couldn't help but freeze and stare, shell-shocked, at Peter Parker who starts talking.\nSighing, Peter cuts the man off. With a piercing stare, he said, \"General Rolland.\" Stiffening, the general turns to the boy who cut an intimidating figure. \"Let me make this clear. It is you who is asking for the favor. Not us. I may not be Tony Stark or Pepper Potts but right now, I am just as important as they are. Do not treat me any less.\"\nWalking closer, Peter glared. \"I have told the military time and time again. Stark Industries is not and will not make any weapons for the use of war. My answer is the same as the one I gave two months ago. No. We will not donate or lend any iron man suits to the military.\"\nPutting his hand on the man's shoulder, Peter pushes him back on his chair. \"I will not tolerate this disrespect to my company. It was you who barged into my company without warning. I have given you enough respect that I tolerated your presence for the past 10 minutes.\"\nTilting his head to the side, Peter stands and moves to the door, opening it. \"Stark Industries is a major investor of government projects. As such, I have to assume that you, Mr. Rolland, represent the government. I can only assume that the government has no care for SI's say in this conversation. Do you really not respect our company?\"\nKnowing he was in uncharted territory and may affect the government, the general hurriedly disagrees. He stutters out, \"N-no, Mr. Parker. It is o-\"\nCutting him short, Peter holds out a hand. \"Then, please do not put me in the position where I need to pull all our funding. I would hate to announce that SI no longer supports the military.\" Opening the door, he continued. \"Leave, General Holland. This will be the last time. Try to reach for something that is above you; try to ask for something we already denied again,\" staring out and letting his vigilante persona take over, Peter turns to look at the shaking man. \"If you ever try to disrespect me or my company again...\"\n\"Make sure you are able to survive the consequences.\"\nWalking out the door, Peter unhurriedly strolls towards the elevator, unaware of the stares coming from a certain group of students on his back.\n\nAsks | FF.net | Wattpad\n"
}