{
    "id": "3130037",
    "url": "https://archiveofourown.org/works/3130037?view_full_work=true",
    "author": [
        "Speranza"
    ],
    "title": "4 Minute Window",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Captain America (Movies)",
        "Marvel Cinematic Universe"
    ],
    "relationships": [
        "James \"Bucky\" Barnes/Steve Rogers"
    ],
    "characters": [
        "Natasha Romanov",
        "Clint Barton",
        "Tony Stark",
        "Pepper Potts",
        "Sam Wilson (Marvel)",
        "Peggy Carter"
    ],
    "additional_tags": [
        "Surveillance",
        "It's Like Grand Central Station In Here",
        "Brooklyn Boys",
        "Power Couple",
        "People Are Sick of Conceptual Art"
    ],
    "language": "English",
    "series": "Part 1 of 4 Minute Window",
    "published": "2015-01-06",
    "completed": null,
    "words": "24,127",
    "chapters": "1/1",
    "comments": "1,625",
    "kudos": "15,437",
    "bookmarks": "4,782",
    "hits": "294,716",
    "summary": "<p>\"Look, if they catch me,\" Bucky muttered, \"they're either going to kill me or they're going to put me in a box with a little window and—Steve, I <em>can't.</em>\"</p>",
    "notes": "<p>Huge beta thanks to counteragent and lim and astolat!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Feedback highly appreciated - come talk to me! - and if you liked, please consider <a href=\"https://cesperanza.tumblr.com/post/107341084810/4-minute-window-24125-words-by-speranza-ao3\" rel=\"nofollow\">reblogging on Tumblr</a>.</p>\n<p>Also - FYI - this is the verse where <a href=\"https://archiveofourown.org/works/2685881\" rel=\"nofollow\">The Second Time As Farce</a> is set - so now maybe that story makes more sense. :D</p>\n<p>ETA: Also also check out the <a href=\"https://counteragentfilms.tumblr.com/post/108195433387/yelp-page-for-coney-island-design\" rel=\"nofollow\">Yelp page</a> for Coney Island Design and Construction and the 8 tracks <a href=\"https://weirywolf.tumblr.com/post/109239044034/its-like-grand-central-station-in-here-a-mix-for\" rel=\"nofollow\">playlist</a> by weirywolf: \"Like Grand Central Station In Here\"</p>",
    "text": "She crashed on top of him from the roof above, landing hard on his shoulders—his own damn fault for letting her get the drop on him. He reeled backwards, trying to smash her against the wall of the terrace, only then feeling the wire pull on his throat: God, but she loved that fucking wire. He slammed her, hard, against the bricks, his windpipe constricting—and slammed her again—and then, desperate for air, plunged with her through the sliding glass doors into the living room. The glass shattered as they crashed through, and she flew off his shoulders and rolled onto the thick white carpet, but she didn't stay down—she was up in a second, bloodied and panting, with a deadly black baton in her hand, which would have brained him if he hadn't got his arm up in time. It didn't stop her—she launched herself at him, forcing him backwards and pinning him down and slamming the baton against his throat.\nShe spoke in Russian: Why are you following him? What do you want with him? He didn't answer, and it was only when he saw the gun with its Walther silencer in her gloved hand that he knew that she meant to kill him. He flexed his fingers. Plates shifted along his arm.\n\"You want to help him, turn yourself in,\" she said, now, in English.\nHe stared up at her and didn't blink when she pressed the gun to the center of his forehead.\n\"He'll be upset but he'll be better off without you,\" she told him, and he flinched uncontrollably because it was true. Then her face changed—she was staring down at him like he had done something unexpected—and this was his chance, his only chance to stay free. He lurched upward, knocking the barrel away, the bullet missing his head by inches—and clocked her with his metal fist. She went down hard, knocked unconscious and bleeding from the side of her head onto the carpet—and he scrambled up and ran out; Bucky Barnes ran for his fucking life.\n \n\"On your left,\" Steve called out, running past a woman in black workout gear. Her blonde ponytail streamed behind her as she ran. He moved smoothly around her, past her, churning up the gravel of the path.\nHe ran on, turning at the looming white of the Lincoln Memorial. \"On your—\"\n\"Don't even,\" Sam Wilson gasped, and Steve grinned and slapped him on the back before sprinting past, out of clocking range, though Sam swung out with a long arm and really nearly got him.\n\"On your left,\" Steve called out, and the man, blue sweatshirt, moved away, and then abruptly jerked back into his path. Steve smashed into him, knocking him forward. They tumbled onto the grass, and Steve tried to fling himself to one side so as not to land on top of him, but even so they crashed hard in a tangle of limbs.\n\"Sorry,\" Steve said immediately, instinctively, moving to sit up. \"Are you—\"\n\"Act normal,\" Bucky told him. \"We're being watched by one, two—at least three agents.\"\nSteve gaped at him. Bucky was unshaven, but he'd cut his hair like it used to—and then Bucky winced and reached for his ankle, and Steve was moving in to help before he realized that Bucky was giving him cover: some pretext for the look that must be on his face. Bucky was also giving him an excuse to scoot closer, and a reason to touch him. It had been ages, but it all came flooding back to him—this vocabulary of almost-innocent touches, an everyday life of deceit. Steve put his hand on Bucky's calf and peered down at his ankle; Bucky's head bent close to his.\n\"Bucky, is it you?\" Steve muttered, chest tightening.  \"Are you all right? Do you—\"\nBucky's eyes met his. \"Yeah,\" he said. \"It's me,\" and there was none of the confusion from the helicarrier. \"I can't get near you. You've got agents on you at all times, plus bugs in your apartment and a tracker on your bike.\" Steve felt rage rising up in him—how dare they, who the hell did they think they—and Bucky's gloved hand landed on his arm. \"It's me.\" Bucky's mouth twisted unhappily. \"It's me they're trying to protect you from. Steve, I'm sorry—\"\n\"It's all right,\" Steve said helplessly. \"They don't understand. I, it's—we have to explain—\"\n\"We can't explain.\" Bucky looked miserable. \"They're not gonna—they won't ever—here, help me up, lever me up,\" and Steve darted in to support him, stealing an almost-hug when Bucky leaned against him to put weight on his ankle. Bucky's gloved hand clutched at his shoulder. He was good; Steve kept forgetting it was an act.\n\"Look, if they catch me,\" Bucky muttered, \"they're either going to kill me or they're going to put me in a box with a little window and—Steve, I can't.\" Bucky jerked away and shifted his weight from sneaker to sneaker to show that he was fine, see, no problem. \"Here, shake my hand,\" Bucky said, and swung out his hand.\nSteve reached for it without thinking. They shook hands like strangers.\n\"So what's the plan? Tell me the plan,\" Steve said, low and urgent.\nBucky hesitated. \"Steve, I can't ask you to trust—\"\n\"Shut up. Shut the hell—I'm coming with you.\"\n\"You can't. Not—yet. But I have some ideas,\" Bucky admitted. \"C'mere, let's throw them off,\" and Bucky reached into the front pocket of his sweatshirt and pulled out a phone. \"Selfie,\" he said, slinging his arm around Steve and lifting the phone, and Steve actually laughed out loud because that was exactly what always happened when people recognized him. He disliked it, actually; the casual presumption of it; it made him feel even more like public property, a tourist attraction; the Washington Monument. \"Thing is, we’ve probably only got a ten minute window,\" Bucky said. \"You go off the grid for ten minutes, they'll send in a SWAT team. It's not a lot of time—not if we want to get away clean. And it's got to be clean if we want to—you know. Make a life somewhere,\" Bucky mumbled, and then they both averted their eyes. They couldn't look at each other; Steve's throat hurt, he wanted it so bad.\n\"You've got to go,\" Bucky said tightly.  \"Turn around and start running. I'm going to limp this off.\"\nSteve wasn't ready. He couldn't do it.  He—\n\"Keep your eyes open. I'll find you. And say yes to things,\" Bucky said. \"Just say yes, all right?\"\n\"Yes,\" Steve said immediately.\n\"Good. Make it a habit,\" Bucky said. \"Now hurry, go: it's too long as it is,\" and maybe he saw that Steve was still hesitating, because he said, \"It's my life, Steve. Go,\" and nothing else in the world could have made him, but now Steve turned and ran off, picking up speed. Behind him, Bucky began a slow, lopsided jog.  The second time he looked back, Bucky was gone.  The whole thing had taken maybe three minutes.\nHe burst into a sprint, torn between elation and despair. Three minutes and everything was different; his whole life was different; the future. He wanted to feel breathless, wanted to feel his lungs bursting, like in the old days.\nSam was waiting for him, impatiently, beneath the usual tree.  Steve collapsed on the grass beside him, chest heaving.  \"What, did you pop up into Delaware? I hear their bagels are fresh up there,\" Sam said.\n\"No, I—I ran into somebody,\" Steve said and looked up at the wide open sky.\n \n \n\n17:30 SGR departs Mt. Pleasant Library (A- 81)\n17:38 SGR arrives Pleasantville Green Market (A- 43)\n17:46 Cover break—A-43\n18:06 SGR departs Pleasantville Green Market (A- 43)\n18:15 SGR arrives 2003 Hillyar; site secure (A- 13)\n\n\"What's interesting,\" Natasha said, looking up from the reports, \"is that Agent 43 thinks he spotted her.\"\n\"I know.\" CIA Director Leo Cooper said. \"She's already been replaced. I won't take chances.\"\nNatasha held her tongue. 43 was a good agent; Natasha had requested her specially. She wouldn't have made any rookie mistakes. So why had Steve noticed her? And why now, when they'd been running this operation for weeks? Steve didn't pay a lot of attention to his environment—he walked around in a bubble, separate and a little lost. It worked the other way, too: Steve should have been a conspicuous figure, six foot two and handsome as he was, but the eye sort of slid over him; people walked around him like he wasn't there, didn't exist.\nOne ghost would attract another, she thought.\n\"He's never left anyone alive before,\" Cooper was saying, staring down the glossy photos scattered across his huge desk: Steve Rogers running through the Mall, Steve Rogers eating scrambled eggs and toast at the Charcoal Diner, Steve Rogers buying cherries at the fruit stand. \"Not if they're on his kill sheet. Rogers was his last assignment—it was Fury, Sitwell, Rogers. Jesus, look at how vulnerable he is.\" Cooper pushed a photo across the desk toward her: Steve Rogers coming out of the Pleasantville market with a paper bag of groceries crooked in one arm. \"Two shots and I've got Captain America dead in the middle of Dupont Circle.  Agent Romanov, are you sure— \"\n\"I'm sure,\" Natasha said. \"It's not going to go down like that.\"\n\"Because I can bring him in,\" Cooper said.  \"Put him in protective custody— \"\n\"Rogers won't stand for it,\" Natasha said.\n\"I wasn't going to give him a choice,\" Cooper said. \"We have cells that can hold him.\"\nNatasha kept her face carefully blank. \"It's not going to go down like that,\" she repeated. \"In my opinion you're already wasting personnel on open air surveillance. He's not going to shoot him from a rooftop. He's going to get in close, somewhere private—his apartment, the locker room, the men's room. Put more agents around his apartment and narrow his window: cut it to seven minutes.\"\nCooper looked hard at her. \"You think it's personal?\"\nNatasha just stared flatly back; the CIA didn't know the half of it, and they didn't need to know. Only six people in the world knew that the Winter Soldier was Sgt. James Buchanan Barnes: Steve, Sam, Fury, Maria, Tony, and her. Cooper didn't need to know any more than he did; she wasn't going to give him another weapon to use against Captain America. \"Yes,\" she said. \"I do,\" and then: \"His last kill order, after all. He might be sentimental about it.\"\nCooper thought about this for a moment, and then nodded. \"All right. I brought you in to consult, I guess I should listen to you,\" he said, but he sounded disgruntled about it. \"You've seen and survived him twice, after all.\"\nMore than that, she thought, but held her tongue. \"I was never on his kill list,\" she said sweetly and turned back to the reports, looking for anything unusual; a trigger for Steve's sudden attentiveness to the world around him. There was that jogger, she supposed—maybe he felt bad about that and decided to watch where he was going for a change.\n\"I still think we should bring him in,\" Cooper muttered, going to stand by the huge window, \"while we can.\"\nNatasha braced her hands against the desk and said, as calmly as she could manage, \"Sir, you take Captain America against his will and you're going to have a PR nightmare on your hands and you still won't have the Winter Soldier. So back off and let me do my job,\" she said. \"We can protect him—but only if he doesn't know we're doing it.\"\n \n \nSteve was just leaving Peggy's room when his phone rang; it was Stark. Stark never called him. He frowned down at the phone, then pressed answer.  \"Hello?\"\n\"I got your message,\" Stark said. \"It's great; it's totally the right decision,\" he said. \"I can have the movers at your place in an hour, but I don't know if that's too fast for you. Pepper's cautioned me against being pushy, though I prefer to think of myself as devastatingly efficient. Do you think you'll be here in time for dinner, or what?\"\nIt took Steve a moment to work his way through all that.  \"Movers? In—an hour?\"\n\"Yeah—I mean, you weren't planning on doing it yourself in a U-Haul, were you?\"\n\"No,\" Steve said slowly. \"No, I wasn't.\"\n\"So, an hour? Two? Okay, fine,\" Tony said, \"I'll have them there first thing tomorrow, say 9 a.m., all right?\"\nIt only took him a second to decide. \"Yes,\" Steve said. \"All right. That would be great.\"\n \n \n\"Great,\" Tony said, and hung up, and then he rang Natasha and said, \"So you're a genius: how the hell did you manage that?\"\n\"Manage what?\" Natasha asked.\n\"Rogers,\" Tony replied. \"New York,\" and when she didn't answer, he frowned and said, \"Rogers is moving to New York. I got a message from him this morning, he wants to come in to the Tower. I thought it was you, tucking him up here for security reasons.\"\n\"I have to think about this,\" Natasha said, and hung up.\n \n \nSteve turned around and went back into Peggy's room, tamping down his feelings when she looked up, surprised and delighted to see him—as if he hadn't just visited, as if their plates and coffee cups weren't still stacked up high on the tray beside the bed. \"Peggy,\" Steve said, sitting back down beside her and taking her hand in his, \"I—think I'm going away for a while. To New York. I'm going to go stay with Howard's son in New York.\"\nPeggy's eyebrow lifted. \"With Tony?\" she asked.\n\"Yes,\" Steve said, and then honesty compelled him to add, \"for a while, and then maybe somewhere else.\"\nPeggy searched his face for a moment, then tugged at his hand. He leaned in and kissed her mouth, cupping her cheek, her cloud of soft hair. Peggy didn't always get the details right anymore, but she knew him—better than anyone; almost anyone. He closed his eyes and gave himself to the kiss; he still liked it when she kissed him.\n\"Something's happened,\" Peggy murmured against his mouth. \n\"Yeah,\" Steve said. \"Yeah, Peg. I think—Peggy, I think I have a chance to be alive again,\" and now Peggy's face was intent and serious and full of love, and how could he leave her, she was his best girl, how could he ever—\n\"Then go. You have to go,\" Peggy said. \"Darling boy. Go and don't look back.\"\nHe felt his face twisting in all directions. \"Looking back's all I ever do,\" he said and kissed her again, struggling for control of himself. \"I'll write,\" he promised, soft and urgent, \"or I'll call, if I can—\"\n\"Don't let them find you,\" Peggy warned him, soft and sharp: still the best operative in the world. \"Do more than you think necessary. Overcompensate. Steve,\" she said, clutching his hand in hers; her grip was strong. \"Don't tell me too much, but will there be someone to look after you?\" She looked hard at him. \"You need someone to look after you.\"\n\"Yes,\" Steve said, and squeezed her hand tight.  \"Yes, there will be.\"\n\"Good,\" Peggy said.\n \n \nSteve went back out to the elevator and pressed the button, then tugged his cap down over his eyes, needing to keep his churn of feelings to himself.  The door opened onto a crowded elevator, and Steve got on and pressed \"L\". There were two white-jacketed doctors, a woman pushing her mother in a wheelchair, a young guy with a baby strapped to his chest, and a delivery guy carrying a giant bouquet of flowers—lilies, Steve noted. Peggy's favorite.\nIt was a sign of how deeply engrossed he was in thinking about Peggy that he noted the flowers before he registered the familiar face behind them. He turned away, noting that Bucky was using the flowers to hide from the elevator's camera. They stopped and two more women got on. They all shifted, and Steve moved closer to Bucky, keeping his eyes fixed on the lit-up floor numbers above the door. He twisted his head to avoid getting a face full of flowers.\n\"Sorry,\" Bucky said. \"It's like Grand Central Station in here.\"\n\"Yeah,\" Steve muttered back. \"It sure is.\" They had a quick, intense conversation with their eyes before going back to pretending that they didn't know each other. They were close enough that their elbows jostled; Steve put his hands in his armpits to stop himself from touching. \"Actually,\" Steve said the next time the doors opened, and they all made another effort to make space. \"It's funny you should say that. I'm about to move to New York.\"\n\"You don't say,\" Bucky said.\n\"Yeah, I'm from there originally,\" Steve told him.\n\"You like it? The big city?\" Bucky asked.\n\"Oh yeah. I love it.\" The elevator arrived at the lobby and began to empty out; Bucky looked at Steve and then glanced upward before pushing the button for Peggy's floor.  Steve nodded; yeah, she would like that.\n \n \nNatasha frowned down at the phone, then pressed the button and brought it to her ear.\n\"What the hell is happening?\" Sam said, in lieu of a greeting. \"He just called and asked me over to dinner. He says he's packing up, going to New York. Is that you people, moving him around the board?\"\n\"Not me. Not Stark or the CIA either. But someone,\" Natasha admitted. There was a new player in the game; she could feel him.\n\"You people have to got to stop jerking him around,\" Sam said.  \"I'll do anything I can to protect him, but if you people are messing with him—\"\n\"It's not me,\" Natasha insisted, and then she sighed and said: \"It might be Barnes.\"\n\"Oh, great,\" Sam said. \"That's just—\"\n\"New York's his home turf.  He...\" She hesitated for a moment and then told Sam, \"We've had a couple of skirmishes. He might be trying to level the playing field, change the terms of engagement—\"\n\"You've seen him?\" Sam asked.\n\"Yeah.\" Natasha rubbed her forehead; the cut she'd gotten in her last fight with Barnes had scabbed over. \"He's here.\"\n\"Shit,\" Sam said, low and sincere, and then he sighed.  \"All right. How do you want me to play it?\"\n\"Don't play it,\" Natasha said; she'd pushed Sam far enough. \"You're his friend, be his friend. Do what you'd do, ask whatever you'd ask.  But if you see any danger signs—\"\n\"Yeah, okay,\" Sam said, and disconnected. \nShe hadn't even put down the phone when it rang again: Sharon Carter, Agent 13. \"He came over,\" 13 said, immediately going into her report. \"He knocked on my door. He told me he was moving, he brought me a bottle of wine and a plant, asked me if I wanted any of his kitchen things. He said he was sorry we hadn't gotten to know each other better and maybe we'd have the chance to work together again someday. But he didn't believe it,\" 13 concluded, \"not a word of it. He's a terrible liar. Did I miss a memo or something?\"\n\"No,\" Natasha said. \"It's not you.\"  She hung up and bent over her tablet—she'd missed something: some trigger, some key exchange of information. She swiped through the logs, looking for anything unusual, and saw that Steve had spent nearly two hours with Peggy Carter.  He usually spent only about an hour with her.\n \n \nNatasha arrived at the Roosevelt Home at a bad time: the residents had just finished dinner, and Carter's aides were getting her ready for bed. Natasha leaned against the wall outside her door with her eyes closed. Very possibly she was overthinking this. Going back to New York could be Steve's idea. She was pretty sure he'd only stayed in D.C. this long because he hoped the Winter Soldier would find him here. But he might be giving up, changing strategy.\nA pink-jacketed aide came out of Agent Carter's room. \"Is it important that you see her? She's had a tiring day.\"\n\"It is,\" Natasha said. \"It's important,\" and the aide sighed and gestured for her to go in.\nPeggy Carter, wearing a bottle-green peignoir over her nightgown, was already beginning to drift against her propped up pillows. \"Agent Carter,\" Natasha began, sitting on the chair beside the bed. \"I'm Natasha Romanov, I used to work for SHIELD.  I just wanted to ask you a few questions. About Steve. Steve Rogers.\"\nPeggy's eyes drifted to the bedside table where, among the framed photographs of her husband and children, there was a little hinged diptych.  She stretched out her hand, and Natasha picked it up and passed it to her. Peggy looked at it and then handed it back to her: one the left was a photo of Steve she'd never seen before, though she'd seen others like it: a tiny kid with a shock of blond hair and thin shoulders and huge, brave eyes. On the other, there was a picture of Steve as she knew him today: strong, oddly guarded. Natasha frowned, but looking back and forth between the two pictures it was obvious. Steve looked healthier now, and much, much unhappier.\nWhen Natasha looked up, Peggy was smiling. \"What do you want to know? I'm always happy to talk about Steve.\"\n\"Well, just—when he came to you today, did he seem upset about—\" but this was as far as she got, because Peggy's mouth was quivering. \"But he's dead, dear,\" she said. \"Steve's been dead for more than seventy years.\"\n\"Right,\" Natasha said, under her breath; was she supposed to break it to Agent Carter that Steve was alive? Would it jog her memory or just upset her? She bit her lip. She seemed to remember that you weren't supposed to argue with or correct someone with dementia; you'd just distress or frighten them. \"I'm sorry,\" she said. \"Yes, of course.\"\n\"He was such a sweet boy,\" Peggy said, taking the diptych back from her and looking down at it affectionately. \"Not a day goes by that I don't think of him. Sometimes I think we were wrong—that we didn't have the right to do what we did to him. But we needed him, you see.\" She wiped her eyes and lips with the handkerchief she clutched in her gnarled, papery hand. \"Him and no one else. Can you imagine having given all that power to anyone—lesser?\"\n\"No,\" Natasha said, meaning it. \"No, I can't. Steve is a really good person.\"\nIf Peggy noticed her slip into present tense, she didn't show it. \"He had so much courage,\" she was saying. \"Such strength and such heart. I knew he was Captain America the moment I saw him. The serum—it was never about the serum.\" Her eyes filled with tears. \"Steve was Captain America in every way that mattered. Darling boy.\"\nNatasha smiled at her. \"I'm sorry I bothered you. I'll let you get some sleep.\" She looked at the vase of flowers beside the bed and poked through them with her fingertips; no card. \"Lovely flowers,\" she said as a parting shot.\n\"Yes,\" Peggy agreed; she sniffled and smiled again.  \"James brought them,\" and Natasha stopped.\n\"James?\" Natasha repeated. \"James Barnes?\" She had to resist the urge to call in the team, surround the building.\n\"Yes. He came to see me—the rascal. He brought me flowers and some eccles cakes. I do like eccles cakes.\"\nNatasha frowned at the white pastry box. Steve had brought the cake; it was in the report, he'd stopped specially for it at Georgetown Bakery. No mention of flowers, though. \"What did he say?\" Natasha asked slowly.\n\"Who?\" Peggy asked.\nNatasha took a breath before answering.  \"James Barnes.\"\n\"Oh, he just wanted to tell me he's moving to New York,\" Peggy said, smoothing down her coverlet. \"He's going to stay with Tony, Howard's son Tony. I think he's going to try to rescue Steve,\" she confided, voice dropping to a whisper. \"But I don't know if he can.  Steve's been dead for such a long time now.\"\nNatasha mouth opened and then closed again; she had no idea what to say to that. Peggy let out a sigh.\n\"Poor Steve. Poor James, too. It was impossible, then, what he wanted. Now, of course, I'm impossible, aren't I.\"\n\"I—I'm sorry, I don't understand,\" Natasha said carefully. \"What did James want?\"\n\"Well, Steve, of course. But James was a realist. Steve was not a realist. He couldn't see that it was impossible—that he was Captain America, a figure of some minor importance, and rather more conspicuous than the average G.I.\" Peggy shook her head. \"It was never going to... But things are different now, aren't they.\" She showed Natasha a small smile. \"So many impossible things have happened. What is it they say? Where there's life, there's hope?\"\n\"Yes,\" Natasha said, and nodded earnestly. \"Yes, I believe that, too.\"\n \n \nShe went straight to the security office and had the guards wind back the surveillance footage; it was the cheap kind, grainy black and white images, and the cameras only took pictures every three seconds, so the footage jerked in fits and starts. Still, she could see right away that it wasn't Steve who'd brought the flowers. The delivery guy was nondescript: slouching but with a strong build, wearing a hat and a windbreaker with the florist's logo on it.  She peered down at the monitor, trying to see if it could really be Barnes: there wasn't a clear picture of his face from any angle, but she could see his hand around the vase—his gloved hand. He was wearing work gloves.\nAnd then her breath caught, because Rogers got onto the elevator with him—and if it was true, if Peggy wasn't out of her mind and it was Barnes, he'd gotten way too fucking close to Steve, separated only by a bouquet of flowers.\nPossibilities ran through her head, all of them bad: that Barnes could get that close without Steve noticing—not impossible, but why? Or that Steve had noticed, and had kept it to himself, which would mean—what? She gnawed the side of her thumb. The move to New York. She’d suspected Barnes was playing him, somehow; what if he was doing it overtly? Keeping Steve quiet with—the possibility of coming in on his own, without a fight? She nodded a little to herself: that would have gotten Steve to cooperate, no question. But why? To maneuver Steve into position for—what, exactly?\n\"I want that picture,\" she told the guard. \"Get me a printout of that,\" and then she was opening a secure line to the team and giving the order, \"Bring it down to a four minute window.  Rogers goes off the grid for more than four minutes, I want to know about it—and I want a team standing by, armed and ready to take the Winter Soldier down.\"\n \n \n\"I need you,\" Natasha said into her phone, and twenty minutes later there was a knock on her door and he was there.\n\"Honey,\" Clint said, and they both laughed. Natasha kissed him, slammed the door, then muscled him down on to the bed. He stared up at her as she straddled his thighs, tugged his shirt from his pants, and unzipped him. \"Don't get me wrong,\" Clint said, \"because this is fine, but was this what you needed me for?\"\n\"This first,\" Natasha said, and took him. He was good in bed, her favorite. He was so lithe and strong and patient, so interested in giving her pleasure, but more than that, he knew how to get out of his head and get her out of hers, help her just be an uncomplicated body for a few precious moments. He made her come twice before she gasped and gave him permission to let go, and then they were laughing and fucking each other wildly before collapsing breathlessly back onto the bed.\n\"I'm going to tell you something,\" she said, sweaty and panting up at the ceiling, \"that's so secret that it doesn't even have a security clearance.\"\n\"Okay,\" Clint muttered.\n\"The Winter Soldier,\" Natasha said, without looking at him, \"is James Buchanan Barnes.\"\nShe felt him react, and then he rolled onto his side and frowned down at her, his brown hair haloed in the light. \"James Barnes,\" Clint repeated. \"As in 'Howling Commando Bucky Barnes?\"\n\"Yes,\" Natasha said.\n\"Shit,\" Clint said softly.  \"Does Cap know?\"\n\"Yes,\" Natasha said. \"He's the one who recognized him.\"\n\"How's he taking it?\" Clint asked.\nNatasha smiled wryly. \"He's not taking it. He can't see the Winter Soldier for what he is—only for who he was.\"\n\"The guy shot him,\" Clint objected.\n\"Oh, he did more than that,\" Natasha said, pushing Clint away and sitting up. \"You didn't see him after the helicarriers. The Winter Soldier beat the shit out of him—and Rogers let him. He let him, Clint,\" she insisted, pre-empting Clint's attempt at an objection. \"I've fought side by side with Steve, I know what he can do. I saw him fight the Winter Soldier when he didn't know who he was. He let Barnes hit him. And Barnes hurt him.\" She let her mask slip for a moment, let worry spread across her face. \"Steve could take the Winter Soldier—but he can't take James Barnes.\" She looked hard at Clint.  \"So it's going to be up to us.\" \nClint gently slid his hand along her side, then traced the puckered scar with his thumb. \"How can I help?\"\n\"Rogers is moving to New York,\" she said. \"To Stark Tower, if you can believe that.\"\n\"Well, that's good, isn't it?\" Clint said, surprised.  \"Stark Tower's a hell of a lot more secure than where he is now.\"\n\"Sure, if he stays inside; you think he'll stay inside?\" Natasha shook her head. \"It's going to be a thousand times harder to protect him in New York—that's why I need you. I think Rogers is going to be out looking for Barnes, and—I think he might find him. I think Barnes might let Rogers find him. Peggy Carter says—\" She stopped, backtracked. \"I just had a very confused conversation with Peggy Carter. \"\nSomeone who didn't know Clint might have missed the quickening of interest in his expression. \"Tell me.\"\nNatasha shook her head and almost laughed. \"She's not sure which of them is alive, or if either of them is. She mixes them up in her mind, which is interesting in itself. But she told me two things. One: she said that Barnes was moving to New York to rescue Steve. But—\"\nClint was already nodding. \"She's got it backwards.\"\n\"Right,\" Natasha said. \"Steve must have told her that he's going to New York to rescue Barnes. That makes sense anyway. I think Steve's hoping to find the Winter Soldier and bring him in to the Tower—or to lure him there.\"\n\"Tony'll love that,\" Clint muttered.\n\"Better Stark than the CIA,\" Natasha pointed out. \"I mean, if I were Steve, that's what I'd be thinking. I know Steve's a pollyanna where the government's concerned, but even he's got to realize that if the CIA gets hold of Barnes they're going to throw him down a well somewhere.  Disappeared, maximum lockdown. With Stark, there might be tasers and whatever passes for maximum security up there, but they've got a chance with Stark.\"\n\"What else did she tell you?\" Clint asked.\nNatasha bit her lip. \"She said they'd been—involved. Rogers and Barnes. Sexually. Or in love, I guess.\" \n\"Oh, you're kidding,\" Clint said.\n\"I'm not. That's what she said—and she was Cap's girl, I figure she ought to know.\"\nClint looked as nonplussed as Clint ever did. \"Well,\" he said, \"that explains your spectacular failure at yentaing.\"\n\"It explains more than that,\" Natasha said grimly. \"It explains why Cap would let the Winter Soldier kill him.\"\n \nSteve left everything for the movers, including his motorcycle with its tracking device, and opted for the train instead, taking his backpack, a hat, sunglasses. He got to the station early, which was just as well; it took him only a few minutes to buy a ticket from the machine (no point in paying cash; not yet) and then he wandered around, wondering which of the harried looking women in their suits, which of the too-old college kids in sneakers, which of the men barking into their cell phones, were assigned to watch him. He stood on line at a crowded breakfast place, bought juice and yogurt, then slumped down in a chair in the waiting area to eat them. He tried not to look for Bucky. If he saw Bucky, one of the harried women or college kids might see him seeing Bucky, and then they'd have him.\nStill, Bucky must have been there, because on the train Steve discovered a plastic card in his jacket pocket: Whole Bean Coffee, it read. Grand Central Station, and Steve tucked the card into his wallet. Then he pulled out his book—Catch 22—and read all the way to New York. It was a pleasant ride. It was almost disappointing to get there.\nThere was something about being in New York, though: he felt it the second he stepped onto the platform at Penn. Above him, paint peeled away from rusted girders that had been there long before he'd gone into the ice, and he realized with a start that he felt competent again, and confident; Bucky'd given them the home field advantage.\nHe would normally have gotten out and walked—there was lots about the garment district that hadn't changed from when he'd been alive, and it was always nice to walk past the window displays at Macy's—but instead he took the subway to Grand Central and found Whole Bean Coffee in a corner of the dining concourse.\nThere was a line—every place had a line: welcome to New York—but he waited patiently, looking around. The woman waiting for a salad the next stand over had been on the train with him, and he thought from the cut of her jacket that she was wearing a holster. He smiled at her and touched the brim of his hat, and that did it—he got various responses when he smiled at women these days, though a lady from New York was always liable to ignore you or tell you to fuck off, but this particular combination of steely-eyed determination and panic?\nThat was an agent who'd been made.\n\"What can I get you?\" the man at the counter demanded, and Steve was about to order a small coffee, light and sweet—except people didn't seem to do that anymore.  He also wanted to linger, to have an excuse to stay in the dining concourse, so he looked up at the chalkboard and read the first thing off the list of specials.\n\"Can I have a—chai latte with a shot of espresso?\" he said, doubtfully.\n\"Chai latte with a shot!\" the guy at the counter shouted, and Steve gave him the plastic card.\nThe coffee was a shocking $5.85, but maybe even more shockingly, the card had a hundred dollars on it; clearly, Bucky wanted him to make a habit of getting coffee here. Steve sipped at his latte as he dodged the rushing commuters—it was like Grand Central Station in here—and found the elevators up to Stark Tower. The building perched on the station like a vulture; a shame, really, that Stark had been allowed to do it, to put Grand Central in the shadow of his own towering ego. Steve took another sip as the elevator doors closed; it was delicious, though he wouldn't call it coffee. It was more like liquid cake: in fact, it reminded him of a vanilla spice cake that Bucky's Ma used to make.\n \n \n\"He spotted me,\" Agent 55 gasped in Natasha's ear, \"I don't know if he spotted Will.\"\nNatasha frowned. \"You're sure?\"\n\"Captain America looked at me. He smiled. He saluted—\"\nAll right; yes. \"Where is he now?\" she demanded.\n\"He went up to the Tower. I followed him off the train, through the subway, and into Grand Central. He bought a latte and went upstairs—\"\nNatasha frowned. \"He bought a latte?\"\n\"Yeah. Chai latte with a shot of espresso—I heard the guy call it in.\"\nThe last time she'd felt this out of her depth, there'd been aliens involved. \"Rogers doesn't even know what that is.\"\n \n \n\"Cap,\" Tony Stark said, coming forward with his hand extended, and Steve found his dislike of the Tower dissipating when confronted with the man himself; ugly the building might be, but Tony Stark was offering him a place in his home. Steve came forward and pumped his hand gratefully. Tony looked at him like he was doing something wildly inappropriate. \"Uh, yeah, good to see you, too,\" Tony said, pulling his hand away. \"Your stuff's not here yet; you beat the van. But your room's furnished, and if there's something you need…\" He made an airy gesture of hospitality.  \"I'd be happy to have my personal shopper pick you up a few things…\"\nNo thanks, Steve was about to say, then changed his mind: just say yes. \"Yes,\" Steve said, and lifted his arms; he was wearing a windbreaker, a plain blue shirt, khaki pants. \"I'd appreciate that. I could use some new things,\" and in different circumstances, Steve would've been worried about the grin spreading across Tony's face. As it was, he couldn't think of a better way not to look like himself than to have Tony Stark's personal shopper dressing him.\n\"Great,\" Tony said. \"Great. I'll have someone come up to measure your—\" he waved a hand at him, \"vastly over-engineered body,\" and twenty minutes later, a sharp-eyed woman wearing all black came to his rooms with a tape measure and walked around him, measuring and muttering to herself.\nThe woman returned with an entire garment rack and several large bags and Clint Barton, who trailed the whole parade in, eyebrows lifted, looking bemused. Steve was glad to have Barton there as a bit of a reality check, because otherwise he might not have found the clothes so funny: tight black jeans that rode so far down as to expose his hip bones, a nearly floor-length white leather trenchcoat, and an entire collection of t-shirts with every possible variation of the Stark Industries logo blazoned across them. He managed to keep it together until the lady offered him, in all apparent seriousness, a black baseball hat featuring a skull and crossbones etched in rhinestones, and then he broke up laughing and couldn't stop, despite the rudeness of it; the woman looked so unhappy.\nShe managed to keep her professionalism, though. \"If you don't like it, I have plenty of other—\" She reached for the hat but Steve jerked it away and clutched it to his chest with both hands.\n\"Like it? I'm nuts for it,\" Steve said, and put it on, and now Barton was laughing, too. Steve shrugged on a giant green canvas camouflage coat with a white raccoon fur-trimmed hood and tried walking across the room. \"Well, I just don't know,\" Steve said wonderingly, turning and looking over his shoulder in the mirror. Then he caught sight of the five digit price tag, and he couldn't, not even if Bucky really wanted him in camo and raccoon fur.\nSome of the other things weren't so bad, and he ended up keeping some pastel button-downs, two nice v-neck sweaters, and some comfortable long-sleeved shirts that made him feel like he was wearing his underwear in public, although Barton insisted otherwise. Barton also said he should keep the black jeans, so he did; he also let himself keep a black leather jacket with a sheepskin lining: the collar had something of the RAF about it.\n \n \nClint noted that Stark was practically rubbing his hands together with satisfaction now that he'd got four out of the six Avengers lodged under his roof. \"I get Romanov and Thor and I run the table,\" Tony said, and stabbed a forkful of steak. \"Cap, what the hell led you to make such a sensible decision at long last?\"\nA series of complicated emotions crossed Cap's face; geez, the guy was a terrible liar, Clint thought.\n\"I don't know,\" Steve said finally, smiling awkwardly. \"Homesick, I guess.\"\nTony nodded sagely. \"Yeah—must be hard on a city boy, living in DC.  DC thinks it's a city, but it's not,\" and when Clint began to protest, Tony steamrolled him: \"It's not. It's totally not. Don't try to tell me it is when it's not.\"\n\"It's really not,\" Steve added, almost apologetically.\n\"Boston is a city.  Chicago is a city.  Baltimore, God help them,\" Tony said, shuddering a little, \"is a city. Washington is a museum and a park in a swamp surrounded by buildings.\"\nClint looked at Steve. \"I can't say he's wrong,\" Steve admitted.\n\"Well, I grew up in Iowa,\" Clint said, and then he saw something he'd never thought to see: Steve Rogers and Tony Stark trading horrified winces.\n\"Well, Iowa,\" Stark said sympathetically, like he was telling Clint he was sorry his dog had died.\n\"Brooklyn's the fourth largest city in the country all by itself,\" Steve explained. \"Kinda spoils a guy for other places. London, maybe,\" and Steve's eyes went far away as he went somewhere in his head; Clint took the opportunity to search his face. \"I liked London,\" Steve said vaguely.\n\"I'm sure London liked you too,\" Tony said magnanimously, and filled Steve's glass. Steve shot him a slow, amused glance. \"In fact, you really should have gotten London's phone number.\"\nSteve turned to Clint. \"So what brings an Iowa boy to New York?\"\nAlways best to tell the truth, Clint thought; or as much as you could. \"A job,\" he said, and refilled his own glass. He was no super soldier. He could totally get drunk. \"Which I can't talk about.\"\n\"Oooh, espionage,\" Tony Stark said, but it was Steve's reply that stopped him.\n\"Aren't you tired of it?\" Steve asked; his smile was quick and sad.\nClint thought about it. \"Kind of, yeah,\" he admitted. \"But what's the alternative?\"\nSteve sighed. \"Well, that's the sixty-four dollar question, isn't it.\"\nThey all considered that for a moment.\n\"You mean the sixty-four thousand dollar question,\" Tony said.\n\"No. I don't,\" Steve said.\n\"Jesus. Inflation,\" Tony said, eyebrows flying up.\n \n \nThat night Steve opened his eyes, irrationally sure that Bucky was there. He wasn't—how could he be? Steve was alone in his climate-controlled glass box, and suddenly he needed air, a window, and he got out of bed and grabbed a bathrobe and went in pajamas and bare feet to the common room and out onto the terrace. It was cold but he didn't care. He sucked air into his lungs and looked out at the glowing windows of the city. Lines of white streetlamps, and a red stream of taillights, even at this hour. He wondered where Bucky was: an apartment or hotel, a flophouse or shelter? Or on a rooftop, watching him through a rifle sight? Steve sketched out a lazy salute just in case.\n\"Hurry,\" he murmured, like the city would hear him and pass it on. He hugged himself through his bathrobe. \"C'mon, Buck—\"\nSteve turned before he knew why, hope blossoming in his chest. Hawkeye stepped out from the shadows, and Steve tried to school his disappointed expression, knew he was failing.\n\"You all right?\" Barton asked him.\n\"Fine, thanks,\" Steve replied automatically.  \"Just needed some air.  I usually sleep with the window open.\"\nBarton frowned. \"You should tell JARVIS if the temperature's not—\"\nSteve forced a smile. \"JARVIS isn't a window,\" he said.\nBarton nodded and came forward until he was standing beside Steve at the railing. He seemed to be debating himself.  Finally, he came to a decision and said, looking uncomfortable, \"Natasha told me about—your friend.\"\nBarton was watching him closely; Steve just nodded and didn't say anything.\n\"Look, you've got to know that people are worried about you,\" Barton said.\nBut this time Steve couldn't help himself.  \"Is that what they are?\"\nBarton seemed genuinely taken aback.  \"Sure they are. Of course they are. Look, whatever's happened to him, whatever he's become—you don't have to face it alone,\" he said. \"It's—I hate to say that this is something we know about, but this is something we know about.\"\nSteve could see what an effort this was for Barton, no talker by nature, so he clasped his hands and listened.\n\"We can deprogram him. Debrief him and help him reintegrate,\" Barton said, and Steve struggled to keep his face neutral. \"Look, Fury saved Natasha. Natasha saved me. Let us bring him in,\" Barton said. \"Let us—\"\nSteve flashed a thin smile. \"You don't need my permission. You would have done it already—if you could have.\"\n\"He'll come to you,\" Barton said flatly. \"If he hasn't already. Has he?\"\nSteve was ready with a question of his own. \"This job of yours—it's me, isn't it,\" and Barton's poker face was much, much better than his, but no matter. \"It's all right,\" he told Barton, and meant it.  \"I understand. Really I do.\"\n \n \nThe clothes helped, actually. Dressed in jeans and sneakers, with a black hooded sweatshirt on under the black jacket, Steve felt a lot more anonymous as he moved through Grand Central: less like himself, anyway. He went down to Whole Bean for a cup of coffee, then wandered around the station, window shopping, looking for Bucky's reflection in the glass. Steve didn't see him, but he was pretty sure that he recognized the kid loitering by the newsstand. Steve picked up his pace, determined to lose him, darting through the crowd and then abruptly ducking into a store. He yanked a shirt off the rack, went into a changing room, and peered through a crack in the heavy velvet curtain; the college kid didn't come by, but another man—gray suit, phone to his ear—passed by twice, and then parked himself outside to finish his call.  Steve sighed and came out, thanked the salesgirl, and left.\nHe decided to walk across the bridge, and so caught the 4 train downtown. He liked the train, liked being shaken up in its familiar rhythms. He also felt less conspicuous than he'd ever been—like he was finally fitting in—and he had the sudden, almost overwhelming impulse to just run for it: just get out at a random station and disappear.\nThe train had gotten crowded, and Steve stood, holding on to the overhead bar and let his expression drift into blankness: New York courtesy was the same now as then, and Steve knew what outsiders often mistook for unfriendliness was actually a polite attempt to give your fellow New Yorkers some illusion of space. Here, there was hardly any: a tiny Hispanic woman had wedged herself under his armpit, and his knees were bumping those of the kid sitting in front of him, and some guy behind him was pressed so close that—\nIt was Bucky, he knew it was. He felt Bucky's gloved left hand drift past his hip, and saw Bucky's other hand clutching the pole to Steve's right. He couldn't help it: he reached down blindly and laced their fingers together. He felt Bucky's breath on his neck. Bucky was hard up against him, close enough to kiss if he just turned his head.\n\"I looked for you,\" Steve muttered over his shoulder. \"I looked everywhere for you.\"\nBucky's mouth was almost on his ear.  \"I know,\" he said. \"I was watching. I wanted to see how you were.\"\nSteve shifted slightly so that his leg lodged firmly against Bucky's. They rode along in silence for a minute.\n\"Turns out there's lots of people watching you,\" Bucky muttered. \"I thought you were maybe with that girl, Romanov,\" and Steve jerked helplessly, but before he could say anything, Bucky said, \"No, I know. But she's relentless, that dame. She won't let me get near you,\" and Steve tucked his head down, not wanting anyone to see his reaction to that; not even Bucky. \"I thought maybe she was watching you the way I was watching you,\" Bucky said into his ear. \"Like she was in love with you.  But now I don't think so. She's got her own reasons.\"\n\"It's you,\" Steve murmured. \"They want you. They want to—I don't know. Reprogram you.\" He let the words fall out of his mouth. \"Debrief. Reintegrate. Sounds to me like that they want you to work for them now.\"  \n\"Work,\" Bucky said quietly. \"Kill, they mean,\" and Steve swallowed against the acid in his mouth. He knew Bucky well enough to hear the hesitation, the reluctance in his voice when he said. \"I would if—if you—\"\n\"No. No,\" Steve said through gritted teeth, and then: \"That's the last thing I want.\"\n\"Yeah. All right.\" Bucky let go of Steve's hand, and a moment later, Steve felt the newspaper brush his fingers, and grasped it. \"It's not a ten minute window,\" Bucky said. \"It's a four minute window.  I'd be flattered if I wasn't so irritated. But it's what we've got. Read your paper,\" he said. \"They're flummoxed by paper,\" and then Bucky pulled away from him as the train pulled into Canal Street. He got off and disappeared into the crowd on the platform.\nSteve had planned to get off at the bridge, but didn't, and when a seat opened up, Steve swung down into it. He opened the paper—a tightly folded up copy of the Times—and began to read.\nHe had no idea what he was looking for.  He knew it the second he found it.\n \n \nNatasha stood across the street from Stark Tower, on the Vanderbilt side, and watched the people swarm by. It was a nightmare, from a security perspective—not only the busiest intersection in the world, not only right over a railway station that serviced millions of people, but the whole area was under construction and covered in scaffolding: midtown was still recovering from the Chitauri attack. She could call for more agents, she supposed, but you'd need half the National Guard to cover the place properly. She peered up at the Tower. The elevator was the bottleneck, she decided. Rogers would have to take the elevators in and out—they'd just have to stay with him, and not lose him.\nHer phone rang. \"Where is he?\" she asked.\n\"The library, if you can believe it,\" Clint replied. \"First he went to the Botanical Gardens. He ate a sandwich and looked at the roses. Then he got back on the train and went to the big library at 42nd. Look, he knows,\" Clint said impatiently. \"I told you he knows. He knows we're watching him, and he likes us but he doesn't trust us as far as he could throw us—which is pretty far, I'd say.  So he's playing games, leading us around town like a tourist—\"\n\"Was he ever out of sight?\" Natasha interrupted.\n\"Not for more than four minutes. He disappeared for a minute in Banana Republic, and then he went into the men's room at the Gardens—no worries, well within the parameters of a piss,\" Clint added dryly. \"Other than that, we've had eyes on him: on the subway, by the roses. Barrett's got him now, she says he's in the NYPL map room.\"\nThat stopped her. \"The map room?\" Natasha frowned.  \"What's he's looking at?\"\n\"We don't know. She's going to try to get a look, but it's not easy to get close. He requested a lot of stuff—maps and blueprints: paper tubes. Cap's got a lot of things on his table but it's hard to see what he's actually looking at.\"\n\"Great,\" she said. \"Are there cameras?\"\n\"No cameras,\" Clint said grimly.  \"Libraries are crazy that way.\"\nShe sighed. \"Well, I'm glad someone's holding the line on privacy.\"\n\"Probably why Cap went there—to thumb his nose at us.\"\n\"No, I don't think so. Library, train station, Botanical Gardens: they're all big, public places. He's putting himself out there—for Barnes,\" she sighed. \"Leaving himself open to approach—or making himself a goddamned target.\"\n\"You saw his clothes?\" Clint interrupted.\n\"Yeah.\" She'd seen photos, Steve Rogers in a hoodie and a black leather jacket. Unnerving; for the first time, Steve had managed to look like any other guy on the streets of New York. \"He looks good. Let's not lose him.\"\nClint hesitated and then said, \"I told Cap we could help him—Barnes, I mean. Will we be able to?\"\n\"I don't know,\" Natasha said. \"If it's Stark—maybe. If it's the CIA....\" She bit her lip. \"The Winter Soldier's a hell of a trophy: the CIA's going to want to hang his head on the wall. And Steve won't stand for that, so they're going to have to bury him, too. Cooper's already thinking about what kind of cells they have that could hold him.\"\n\"Jesus,\" Clint said.\n\"Yeah. I've thought about planting counterintelligence: get the CIA off our backs, give us room to operate. We could put it around that the Winter Soldier's been spotted in—Arkhangelsk. That'd be familiar territory: gateway to the north, to Novaya Zemlya, the Soviet research bases. Cooper would believe that. We could leak it to Steve, too,\" she added thoughtfully; if Rogers thought Barnes had left the country, it'd be a hell of a lot easier to get rid of him. A pauper's grave somewhere; easy peasy. Rogers might keep looking, but he'd get discouraged after a while.\n\"You don't think Cap would just high-tail it to Arkhangelsk?\" Clint drawled. \"He's not what you'd call a quitter.\"\n\"I'm telling you, it's best if Steve never finds him,\" Natasha said. \"It's best if Barnes just goes away.\"\n \nSteve stayed in the map room till they announced that the library was closing, then rolled up all the drawings and blueprints and brought them back to the desk. He waited until the librarian squirreled them away—he could feel eyes on him, even here—but Bucky was right of course: paper was paper, and secure in a way that digital files weren't.\nSomeone else might have looked at the numbers Bucky'd scrawled on the Times and assumed they were phone numbers, but Steve knew his Dewey decimal system. The NYPL didn't connect names to item request numbers, and he'd requested a lot more than he needed. So hopefully nobody would ever know what he'd looked at, or that Bucky'd left tiny pencil-marks for him on the rolled-up sheets, which Steve had carefully erased.\nHe'd always been good with maps and blueprints; his brain was wired for visual information, he supposed. It had been an asset to him during the war: he didn't have to look long at a field map or a strategic plan before he had it: well enough to draw it. He remembered leading the Howling Commandos through the elaborate twists and turns of the Berchtesgaden Armory after they'd wired the place to blow: in fact, Steve bet he could still remember the place well enough to draw it, even now. Compared to that maze, Grand Central's layout was simple.\nThe only tricky part was that Bucky'd directed him to maps from three different years, and he realized that Bucky wanted him to superimpose them, in his mind—to see where the dingy corridors of yesteryear lay within the shiny restorations of today. Like so much of the city, Grand Central was composed of layers upon layers, not just in space but in time: tunnels and service corridors and boarded-up delivery entrances to stores long gone: all the barbershops, haberdasheries, and soda fountains replaced by fancy boutiques and the Apple Store.\nHe thought he had it, though.  When he closed his eyes, he could see the whole station laid out in front of him.\n \n \nHe strolled the couple of blocks back to Stark Tower along the teeming sidewalks, happily anonymous in the crowd. He slowed as he turned onto Vanderbilt: a limousine had pulled up outside the main entrance, and a chauffeur was handing out Pepper Potts. That reminded him of a thought he'd had, something he'd meant to do, so he made a beeline for her, intercepting the doorman and taking possession of her briefcase and carry-all.\n\"Steve!\" Pepper greeted, and stretched up to kiss him. \"I heard you were here.\" She took his arm and let him escort her into the ornately marbled lobby. \"How are you? I'm so glad to see you.\"\n\"Same here,\" Steve told her, meaning it; he really liked Pepper. \"I'm happy I ran into you: I wanted to talk to you about something.\" The concierge had the elevator waiting for them. \"I could use your help, I think…\"\n\"Of course.\" Pepper was looking curiously at him.  \"What can I…?\"\nSteve thought about how to put it, then made a face. \"I'm not entirely sure what I'm asking for. I guess I'd like to—as Captain America, I mean—\" He shook his head and started over. \"When I was kid, sometimes they had famous people on the radio, reading books and telling stories,\" he explained as they shot upward. \"And then, during the war, I did some broadcasts myself but—you know, it was all about the war, buying stamps and…\" Pepper was looking at him with polite confusion, so he stopped and tried again. \"I'd like to do something for children,\" Steve told her. \"As Captain America. Something—educational,\" he added. \"Maybe something at a library. Or on the radio—\"\nPepper's face lit up. \"Sesame Street! Why haven't we put you on Sesame Street? You're a natural for it.\"\n\"I don't know what that is,\" Steve said truthfully.\n\"It's what you're asking for,\" Pepper said with absolute certainty. \"Children's television. I'll set it up,\" she said.\n\"Soon,\" Steve blurted.  \"If possible—please,\" he added, remembering his manners. \"If you can.\"\n\"I think,\" Pepper said, smiling ironically, \"that they'll be pretty eager to—\"\nThe elevator door binged open and Tony Stark was standing there with a huge bouquet of daisies.\n\"Sweetheart,\" he said, and then glared at Steve. \"Not you.\"\nPepper grinned fondly at him and then finished her thought as Steve tucked her briefcase and carry-all outside the door and pushed the button for his floor. \"I'm sure they'll bend over backwards for you. They'll want you to do it.\"\n\"Who'll want him to do what?\" Tony asked.\n\"Sesame Street,\" Pepper replied, as Steve surreptitiously pressed the CLOSE button.\nTony blinked. \"He's doing Sesame Street? I want to do Sesame Street!\"\n\"Really?\" Pepper asked, wincing a little, as Steve jammed the button again: close, close.\n\"Sure! Why the fuck not?\" Tony demanded as the door slid shut, but Pepper must have convinced him otherwise, because neither Tony nor Iron Man made an appearance the next morning. Clint, however, blearily looked up from his coffee at Steve, who was standing there in his brightest, most colorful uniform, and said, \"This I've got to see.\" Steve forced a smile and tried to make himself believe that Clint didn't mean that literally; that he wasn't on the job.\nPepper took them via limo to a studio in Queens, where Steve spent five happy hours filming various sketches for the Children's Television Workshop, mainly playing straight man to a bit of pink fur. It had been years since he'd done anything like this, but he had been pretty good at it once, and he could see that the directors were pleasantly surprised by his chops, because they kept coming up with new bits for him to do. He talked a lot about the letter A. (A is for America, he explained, smartly pointing to his forehead. A is for Avengers. A is for Orangutang—what, it's not? What do you mean, it's not?) He let Super Grover accompany him on a mission and shared a wince with the children at home when Grover messed it all up. He pointed out that Stars and Stripes both started with the ST sound—the ST he needed to point to, they explained, would be digitally generated to appear above his head just where the green tape was, but he'd never had any problems hitting a mark. It was just like vaudeville, he explained.\nIt was, too.\n \n \nHer phone beeped.\nNAT, Clint had texted. SGR going to Queens to do Sesame Street\nShe stared at the message and then went out to the street and waited until Pepper's limo turned out of Stark's garage, as if seeing the limo could answer all her questions, could make this make sense. Sesame Street?  But that was—\n—and fuck her for letting this distract her, because he was on her, metal arm tight across her throat and dragging her through a door into a boarded-up Chinese restaurant.  She struggled, kicking at him, trying to claw at any vulnerable part of him—face, eyes, groin—but he had a damn good grip. Her boots skidded up off the ground.\n\"I am trying to be patient,\" he growled, \"but you are testing me, lady. Stay away from him. Leave him the fuck—\"\n\"No!\" she snarled, trying to pry his arm off her throat.  \"Not until you tell me what—\"\n\"I don't,\" he gritted out, \"answer to you,\" but her hand had found the taser, and he reeled at the first shock and dropped her. She whirled, kneecapped him with her baton, and kicked him hard with a steel-toed boot when he went down: twice in the kidneys, and once in the head. He whitened with pain, but didn't pass out or slow down—just grabbed her by the leg and twisted. She flipped over backwards and came down ready for him when he rushed her.\nThey crashed together through the dilapidated kitchen door and onto the ancient iron stove with all its sharp points and mangles. She tasered him again, jabbing it into his neck, and he sent it careening out of her hand. He was much, much stronger than she was, so she climbed onto his back and held on, tightening her legs around him with all her strength, making him lurch under her weight, trying to stay close enough that he couldn't hurt her without hurting himself, at least a little. She clawed at his face, but metal fingers closed on her arm, and she gasped in pain.\nHe dropped to his knees, yanking hard on her arm, and she slid around his body, half-onto his shoulder—and he had her. His flesh hand felt as strong as his metal one, and he was about to smash her down onto the concrete floor.\nShe needed a weapon, and fast. \"Peggy Carter says he used to fuck you,\" Natasha said breathlessly, holding on to him. \"Is that what you want from him? A good fucking?\" and it had been a hail mary pass, but it worked beyond her wildest dreams: it stopped him cold, shocked him into stillness. She pushed the advantage. \"That tidbit wasn't in the Smithsonian,\" she said, tsking softly. \"People are so sloppy about fact-checking these days. No pride in their work.\"\nHis jaw tightened, but his face grew harder.  \"You don't know anything about me.\"\nShe felt the crack, and quickly shoved the wedge in. \"Well, I know you nearly put him in the ground,\" she said, hard and cheerful. \"Four bullets, three in the gut. Very painful, gut wounds—the stomach acid scarred up his insides, did you know that?\" and she wasn't prepared for the spasm of pain that crossed his face. \"You smashed his cheekbone. You cracked his eye socket.  Three weeks in the hospital—you really did a number on him,\" and to her horror his eyes filled with tears. This...was not how this was supposed to go down, Natasha thought. The Winter Soldier was not supposed to—just break like this. His grip on her loosened and she jerked out of his hands, staggered back and pulled both her guns. He took no notice of her; just sat down on the ground and started blankly at nothing.\n\"It wasn't me.\" He seemed disoriented. \"It wasn't me— I would never—\"\n\"It was you,\" she said. \"I can match the bullets to your gun. I can match your fists to his bruises, your fingers to the marks on his neck,\" and he hunched over and began to sob raggedly, wet and ugly. She watched as he shoved the heels of his hands into his eyes and struggled to control himself. She stared at him, shocked and unnerved. But it wasn't in her not to go in for the kill, and she could smell blood, now: Steve was his weak point as surely as he was Steve's. \"The best thing you could do,\" she told him, \"is to let them disappear you before he figures out you've gone missing. Sure he'll be sad, and I bet he'll even keep looking for you, but it'll give him something to do on the goddamned weekends and you won't be responsible for taking him down with you.\"\nShe kept her guns trained on him as she talked; she knew better than to underestimate him, but she thought that if she could keep provoking him like this, engaging his emotions, he might get sloppy, make mistakes. Emotions made you predictable, but the Winter Soldier had always been cool and practical and utterly terrifying.\nHe got real quiet then, though his shoulders still heaved with his heavy, ragged breathing. When he dropped his hands and lifted his face, the tears were gone, but his face had gone oddly slack. \"Okay,\" he said.\nI've miscalculated, she thought.\nHe was far away, staring at something she couldn't see, his expression shifting from pain to regret to something very like terror, and then he was offering his hands and wrists to her, the palms up. His fingers were oddly delicate, even the metal ones. \"You're right,\" he said. \"Take me in,\" and then, muttering more to himself than to her, \"I can do it.\" His eyes went unfocused. \"Whatever it is, I can...\" He swallowed hard and extended his hands further.\nShe was carrying cuffs and a powerful sedative and she didn't want to use either of them. She couldn't bring him to the CIA: not when he so clearly understood what was in store for him. She studied him: it was the first time she'd had a good look at him. James Barnes. He was having trouble controlling his face: his mouth was surprisingly curved, and it was trembling, a little. She wondered if that was why they'd kept him in a mask all those years.\nStark, then. She would bring him to Stark. That was the obvious solution: the Tower was here, the Tower could hold him, and they could keep him in lockdown until they figured out what to do with him. If he was rehabilitatable, if there really was this much of James Barnes alive in him, she'd wrap him up in a bow and give him to Steve for Christmas, a little thank-you present. That ought to make him happy, she thought.  Except—\nExcept Rogers had gone to Sesame Street, she thought, and frowned.\nBarnes was looking at her curiously, eyes wary, and right then she made up her mind: she was pretty sure she could capture him again, now that she knew how he ticked, but once he was in custody he wasn't ever getting out. \"Go,\" she said, holstering her guns, and she didn't know who was more surprised, him or her. \"Get out of here,\" and then things got crazier, because he didn't go. He just sat there, looking lost: a guy torn between conflicting orders.\n\"But,\" Barnes said, and took a deep breath. \"You said—\"\n\"Forget what I said,\" she said irritably, and then she knew what she needed to say: \"I don't give a damn about you. I'm doing this for Steve. I'm trying to figure out what's best for Steve,\" and then he was nodding rapidly and moving in a blur for the exit, his world obviously making sense again. He hesitated at the door and looked back at her.\n\"Me too,\" he said awkwardly. \"If you can believe it,\" and left her there.\n \n \nBackwards. She'd had it all—Sesame Street, she thought, shaking her head. That was legacy stuff: Steve Rogers was reflecting on his legacy as Captain America, and that put everything he'd done in a whole different light. \nSteve wasn't trying to bring the Winter Soldier in. Steve was trying to get out. He wasn't looking to pull Barnes out of his hole; he was looking for the hole Barnes was in so that he could jump in and disappear with him.\nPeggy Carter had told her this, she realized a moment later—and damn it all, she should have listened to Peggy, because Peggy really knew them, both of them. He's going to rescue Steve, she'd said, and Natasha pictured the tense, unhappy face framed on Peggy's nightstand; pictured Steve's empty apartment, his strange half-life of a life.  Even when I had nothing, I had Bucky—and here he was: James Barnes, back from the dead and coming to save him.\nExcept they weren't going to make it. She knew, better than anyone, how many agents were on Steve. The U.S. government had had eyes on Steve Rogers ever since he'd come out of the ice in 2011—hell, ever since 1943, probably.  A figure of some little importance, rather more conspicuous than the average G.I., Peggy had said. They'd watched him in the hospital, at S.H.I.E.L.D., in his apartment in D.C.—they'd maybe given him more than a four minute window, but not much more. Steve had always had agents assigned to him, and there would always be agents assigned to him. She saw now why it had been so easy to push Barnes into despair: he knew how much surveillance was on Steve. He’d probably known about it in 1943, too; James, as Peggy had explained to her, was the realist.\n \n \nA whole morning in uniform as Captain America left him itchy and over-scrutinized, so when Steve got back to the tower he changed into the most nondescript clothes he could find and headed down into Grand Central for coffee. He walked around the dining concourse, sipping his coffee and mapping the room onto the blueprints in his head. He could see why Bucky had chosen it: the room was ringed with exits: not just the enormous staircase and twin escalators, but numbered exits to the platforms all around, not to mention access corridors, ramps, delivery bays, service panels for the water and gas lines needed to prepare food. And a lot of the lower-level tracks were disused. He reached the end of the hall, then turned, and a man in a suit, talking on a cellphone, abruptly stopped too.\nFour minutes, Steve thought, and looked at his watch. Hardly any room for—and his attention was caught by an older man with an unkempt gray beard sitting on the floor in a dirty alcove. He was wearing an army jacket and combat boots, and holding a raggedy cardboard sign. HOMELESS VETERAN PLEASE HELP, it said, and Steve tossed his coffee cup into the bin and went to him without thinking, crouching down.\n\"What unit?\" Steve asked.\n\"The 103rd,\" the man replied; his hands were filthy. \"Operation Urgent Fury—Grenada, 1983. What about you?\"\nSteve made a face. \"My situation was a little—complicated. I was kind of attached to the guys in the 107th.\" He pulled out his wallet, took out five twenties—all the cash he was carrying—and a little rectangular card with his name and a small embossed shield on it. He'd resisted the cards at first, but they'd come in handy, more than once. He pulled a pen from his inside jacket pocket, flipped the card over and printed a message on its back in tiny caps. Bob—Robert Turner ran a shelter for veterans, and Steve liked him—please help the bearer of this card, not as a favor to me, but because one at a time is better than nothing. SGR.  He handed the money and the card to the man and said, \"You know the Rosemont Shelter down the Bowery?\"\n\"Yeah,\" the man said, after a moment. \"I know the place.\"\n\"Ask to see the guy in charge and give him that,\" Steve said. \"He'll help you.\" He moved to get up, and the man handed him his coffee cup. Steve took it, thanking him as he straightened, then smiled politely. \"This isn't mine.\"\n\"Sure it is,\" the man said, and Steve looked down at the paper cup. It was from Whole Bean, and it said STEVE in black marker on one side, and on the other, written smaller: We shouldn't do this. This is a mistake. \n\"I'll kill him,\" Steve said, without thinking. \"I am going to—\" and then he was crouching down again and pleading, \"Where is he? The guy who gave this to you.\" The man just stared at him. \"I need to see him,\" Steve insisted. \"Please. He's my best friend, and he was my sergeant, and he's making a very big mistake,\" and the veteran frowned for a moment, maybe weighing Steve's pleas against whatever information Bucky had given him.\n\"Track 125,\" the man said; his eyes were clear and serious.  \"The service hall.\"\n\"Thank you,\" Steve said.\nDon't run, Natasha had told him. Walk, so Steve put his hands in his pockets and made himself stroll back across the dining concourse. The guy in the suit was still on his phone, or pretending to be, but he gave Steve some distance; probably afraid Steve was on to him. Still, Steve figured there had to be at least one other operative in a room of this size, maybe more. The etched glass sign indicating Tracks 125 - 126 was beside an ice cream stand, and Steve stopped and stared down at the round vats in the cold glass case, like he was trying to choose a flavor.\nThe gold double doors leading to the platform were closed, but he'd bet they weren't locked.\nFour minutes, he thought, looking at his watch. Maybe it was time to see exactly how long that was.\nHe took a breath, pressed a button on his watch, and walked calmly but purposefully toward the doors—pulled one open, slipped through it. Only on the other side did he break into a run, sprinting the length of the deserted platform and up the frozen metal escalator steps on the far side.  He came out into a dingy hall, with EXIT hand-painted on the grime-streaked tiles and an arrow pointing to the right—and ran the opposite way, toward what he knew was the service corridor, and barely stopped himself from knocking over an elderly woman as he rounded the corner.\n\"I—sorry,\" Steve gasped. \"I'm sorry,\" and geez, what an idiot he was: the hall was full of people, most of them carrying their entire lives with them in sacks or boxes or shopping carts, and he—how many cards did he have?—but there was Bucky, staring at him with his mouth open and a surprised look on his face, and Steve grabbed him by the arm and dragged him down the hall and through a rusted metal door that looked like it had been peeled back with a giant can opener.  An electrical way-station, with transformers humming and a vaguely metallic taste in the air, and Steve wheeled on him and pointed at him and said: \"You do not get to make this decision! Do you hear me? I'm not letting you do this again: you can't make decisions for both of us. You don't have the right, Buck.\"\n\"But,\" Bucky protested, and Steve shut him up by grabbing him by the shoulders and kissing him, hands moving to his face to lock him in place. Bucky jerked in surprise and tilted off balance, but Steve didn't let go.\nTime slowed. They held each other and time stilled and the world was warm for the first time in forever, Bucky's arm sliding heavy across his shoulders, his mouth opening. The kiss deepened and went hungry, and they were falling back against the filthy wall and kissing sloppily: cheeks, jaw, pressing themselves together everywhere, chins slick with it. Christ, he missed Bucky, he missed sex, he missed—and Steve was gasping, dragging his fingers through Bucky's hair and pulling him closer, tasting his—\nHis watch let out a series of piercing metallic beeps.\n\"Gotta go,\" Steve gasped, managing to stumble backwards, but Bucky had collapsed, shoulder against the wall, panting; he looked desolate. Steve grabbed Bucky and shook him. \"You've got to stick to the plan,\" he insisted. \"Okay? Please, Buck—you've done so much, you've been so strong—and we're so close now—\"\n\"Steve,\" Bucky's expression was agonized. \"I just don't want to drag you down. I never wanted to—\"\n\"Stop it. Stop.\" Steve's fingers tightened on him involuntarily. \"That's not what—Look, from now on, where you go, I go, do you understand? We've done it the other way and it's no good. It's together or nothing—okay? Okay?\"\n\"Okay,\" Bucky said, just as Steve's watch beeped again. \"Go,\" and Steve took off at a run, barreling out through the rusted door and jumping over trash and obstacles as people shrank to both sides of the corridor—and instead of going back down to the platform, he followed the painted exit signs up, knowing they'd lead him out to the station's main concourse. There would be cameras there, and he had to get back onto the grid and fast.\nNatasha's voice in his head—\"When you're on the run: walk,\"—but he wanted to be spotted, needed to be—and so he came out into the main concourse at a jog, moving diagonally across the room, as conspicuous as he could make himself without actually waving his arms at the cameras. His fellow New Yorkers instinctively cleared a path for him, some of them clutching their purses and shooting him dirty looks for his disruption. Steve fast-walked through the Graybar Passage, then stopped under a huge camera and ordered a dozen donuts, taking his time about it.\nHe'd have two…no, three jellys, two glazed, and what were those over there, crullers?\n \n \n\"We got him!\" Clint heard in his earpiece, along with a crackle of static. \"He's just off the main concourse, at Fancy Donuts,\" but Clint was headed the other way, tracking the still-visible wake Rogers had left in the crowd. Back through the passage he'd come out of, back through the service door, metal flakes on the floor below the hinges, down into the station. He emerged in an empty corridor, but he could hear voices further down. He smelled the homeless people before he saw them. They stopped talking and looked at him: a wall of hostile, defensive stares.\n\"Sorry,\" Clint said.  \"As you were,\" and he was just about to move on when he saw it—the quick exchange of glances, a nervous intelligent look—and he sensed the rising tension when he turned into the corridor instead of walking past it.  He could tell they were seriously debating whether to engage him—to confront him, stop him, block his path—but they kept still as he passed. A black man in a dusty pea-coat leaned against the wall and glared at him, toothpick wiggling in his mouth. Two old women sitting on milk crates gave him dirty looks. A filthy old guy in an army jacket lay on a piece of cardboard next to a younger soldier sitting against the wall with his knees up and his head down, and then a girl with blonde cornrows and a filthy pink—Clint stopped and turned back.\n\"Barnes,\" Clint muttered, and Christ, he was fast: up and on his feet before he even got his hand up, though his fingers brushed the fabric of his jacket before closing on empty air. \"Shit,\" Clint muttered, and gave chase—and he was going to catch the bastard, he knew he was: the Winter Soldier wasn't going to lose him in the station's empty corridors and tunnels, and if he headed upstairs, where the people were—and he did, shoving through an access door into the public part of the station, but the presence of people immediately slowed him down. Clint ran after him as he dodged and weaved, then broke out into a run, heading for the subway entrance: the 4, 5, and 6 trains. The Winter Soldier vaulted the turnstiles—did he think he was just going to get on the express?—and Clint leapt after him, shoving people out of the way as he ran down the steps to the platform. A train had just left, so the platform wasn't as full as it could have been. The Winter Soldier was walking up the platform ahead of him, head down, hands jammed in his pockets.\nClint strode after him, getting his bearings, assessing his options. He was armed, but there were civilians everywhere, and he had to assume the Winter Soldier was armed, too, even though he hadn't pulled a weapon.  So he slowed, lifting his chin and showing his empty hands; the Winter Soldier didn't seem to be looking in his direction, but Clint knew better: he was a world class operative, a Natasha-class operative. Sure enough, he slowed, then stopped near the end of the platform. The Winter Soldier turned to stare at him.\nHe'd cut his hair, but there was no mistaking the eyes: a steely blue surrounded by hollows dark as a bruise.\nClint kept walking, raising his hands a little higher.  \"Sergeant Barnes! I just want to talk!\"\nHe didn't expect the WInter Soldier to answer, and was surprised when he did.  \"We got nothing to talk about!\" he called back.\n\"You can make a different choice, sir,\" Clint said, coming closer. \"You can make a different call.  They want you to think you're against the wall, but it's not true. We've got options. Captain Rogers has friends who'll—\"\nThe Winter Soldier put up a black-gloved hand, and Clint stopped, obliging him: close enough.\n\"There's more than one way out of this,\" Clint said seriously.\nThe Winter Soldier looked at him. Now that he was close, Clint could see lines of pain on his face that shouldn't be there; they looked unnatural on such a young guy. James Barnes looked used; worn. \"More than one way?\" he repeated, looking like he wanted to laugh but couldn't. \"I'd be happy with one way,\" and Clint felt the ground shake and knew what Barnes was going to do before he did it.  He ran toward him, hoping to grab him or tackle him to the platform, but Barnes was faster—and Clint could only watch as he leapt, twisting, in front of the oncoming train.\n \n\"Jesus, Natasha,\" Clint said, panting, into the phone. \"I think I killed him. He jumped in front of the train—\"\n\"I need you,\" Natasha said. \"Come now, to—\"\n\"Didn't you hear what I said?\" Clint interrupted.\n\"I heard you. You didn't kill him: no offense,\" Natasha added, tactfully. \"Winter Soldier's been around a while.\"\n\"He's not the Winter Soldier,\" Clint said. \"He's Barnes—I saw him. He's James Barnes.\"\n\"I know. The game's changed; we're in a whole new game now. Hurry up: I've got a lot to tell you—after.\"\n \n \n\"Are you all right?\" Pepper asked when Steve returned to the Tower, and he was so off-kilter that everything nearly came spilling out of him: how he had Bucky's kiss on his lips, how leaving him had hurt like a physical pain, how he could feel every inch of the distance between them, even now, and if he didn't get out of here soon, he was going, he was going to—\n\"Sure. I bought donuts,\" Steve said. \"These crullers looked really good.\"\nPepper looked like she didn't quite believe him. \"Are you sure? Because I was going to ask you to—never mind.\"\n\"I'm fine,\" Steve assured her. \"Please.  What can I do for you?\"\n\"Well—it's really not important,\" Pepper said, \"so feel free to say no, but I'm hosting a little reception tonight. It's for Engineer Africa: they build roads, develop infrastructure. You wouldn't have to stay long—\"\nTony had come up behind her.  \"You'd have to wear a monkey suit,\" he interjected. \"Or, you know: a tux.\"\n\"—but it would obviously be a coup for me to have you as—\" Pepper made a face at Tony, \"—a guest.\"\n\"I—of course, I'd be happy to,\" Steve replied, and that was how he ended up clutching a flute of champagne at a cocktail party full of politicians, celebrities, and socialites. And maybe it was because he'd just kissed Bucky Barnes for the first time in seventy years, or maybe it was because formal wear had changed less than most other items of clothing, but Steve felt he was drifting in time: he'd been at parties like this during the war, often as the guest of some senator or congressman. There'd been more uniforms, of course, but he felt that any moment, he might turn around and see Peggy looking ravishing in a red dress, or maybe—\n\"More champagne, Cap?\" Howard asked, patting his back paternally and waving the bartender over.\nTony. It was Tony of course.\nSteve shook his head and covered his glass.  \"Is it sacrilege to say I never much cared for it?\"\n\"Whisky, then,\" and Steve must have given something away because Tony laughed and said, \"Come with me, mon capitaine,\" and Steve kept seeing his father in him: Howard with his wry smile and his knowing, amused eyes.\n \n \n\"Fondue's just cheese and bread, my friend,\" Howard had said meaningfully, and Steve had always thought that Howard knew more than he'd let on about the mess that had been him and Peggy and Bucky back then. He'd always wondered if Peggy'd confided in Howard: he was the kind of guy who seemed to invite those sort of confidences. A man of the world.\nHe knew that Bucky wouldn't have said anything: Bucky confided in no one.\n \n \n\"I've got some great stuff for you to try,\" Tony said, towing Steve along with him. \"It belonged to my father, actually—he liked it so much he bought up a ton of the stuff. '64 Macallan, it was 50 years old then,\" and the band in the corner was playing songs that Steve actually knew—A Fine Romance. Embraceable You. I Can't Give You Anything But Love, Baby.  If he closed his eyes, he could imagine Bucky waiting for him at the bar, tie loosened, a cigarette already in his mouth, drumming his hands in an impatient, off-rhythm beat as he waited for his drink. His memories were in all in vivid Technicolor, so much brighter than the faded sepia tones of this world now.\n \n \nIt had been their secret, for as long as Steve could remember. Just boys being boys, and the truth was that he'd never thought anything of it until Bucky made it queer one day by cupping Steve's neck and pulling their mouths together. Steve had been shocked, really shocked, because messing around was one thing but everyone knew that guys didn't kiss each other unless they were queer. And Bucky must have felt it, because he pulled away fast, red-faced and cringing with embarrassment—and worse than that, suddenly afraid of him. Bucky was looking at him, Steve, as if Steve might do something to hurt him—and that was so crazy, so completely nuts, that Steve could only gape at him.\n\"I was just kidding,\" Bucky said, and there was a new edge, a mean edge, to his voice, \"seeing if you would fucking fall for it, which you totally did, you stupid-ass punk—\" and he shoved Steve in a way that wasn't quite friendly.\nSteve had just stared, open-mouthed, like an imbecile—first, the kiss (his first) and then this—but the thing was, he knew Bucky better than anyone, he'd known Bucky his whole life, and he could see the sweat on his forehead, the stone-cold terror in his eyes. \"Buck, it's all right,\" Steve had managed, though he wasn't sure it was, actually—\n \n \n\"Maybe later,\" Tony said to some guy who tried to intercept them on the way to the bar; Steve barely saw him.\n \n \n—and Bucky didn't seem so sure anymore either, just kept shaking his head, hard and defensive. \"It was a joke, okay?\" Bucky said, his voice strained near to breaking. \"You dumb cluck. It was just a fucking—\" and they'd nearly come to blows over it, because Bucky was so out of his mind that Steve had had to physically grab him, fingers knotted in Bucky's shirt hard enough that the worn fabric ripped when Bucky tried to pull away, and for one terrible moment Steve was absolutely sure that Bucky was going to beat the crap out of him: you're the faggot, you are, get off me, don't you fucking touch me. But Bucky's fist stopped in mid-air, arm muscles quivering, his mask slipping, and Steve didn't know if he was queer or what, but he couldn't stand to see Bucky in pain like this.\n\"It's okay. Buck. It's—\" but words didn't mean anything, so Steve grabbed him and kissed him, sloppy and inexpert, and kept kissing him until Bucky melted and finally clutched him back. Steve learned the curves of Bucky's lips, the faint scratch of beard on his cheeks, the taste of his tongue. He loved Bucky Barnes more than anyone in the world.\n \n \n\"—ah-ha, I knew this was here.\" Tony said, popping up with a dusty bottle and two thick crystal tumblers and settling them down on the polished wood.  \"Nobody knows to steal this because people are philistines,\" he said.  \"But this is the good stuff.  This stuff is older than you are. Want to try?—No rocks, rocks would be a travesty.\"\n\"I—yeah. Twist my arm,\" Steve said, and bellied up. He took a sip of the smoky liquid and let it roll around his mouth before swallowing.  His head swam. It tasted like heaven. It tasted like sex.  It tasted like—\n \n \nThey didn't talk about it; they never talked about it. The closest they came was that sometimes, afterwards, Bucky would mouth his ear and whisper, \"You find a girl, you tell me. Some girl's going to see you for who you are and make a play for you, just you wait,\" and Steve had been upset and angry every time Bucky said it, because no girl was ever going to want him and he didn't need Bucky's pity and, most of all, because he assumed it meant that Bucky was keeping the option open for himself: it was Bucky who had always attracted the girls, after all.\nIt wasn't until later, until Peggy, that Steve realized that Bucky (how could he have ever doubted it) was being kind. Peggy looked at him the way no other woman had ever looked at him, which surprised and pleased him. Bucky saw it too and had just smirked and slipped his condom ration into Steve's jacket pocket, not that he'd ever had the chance to use them.  And then Bucky had pulled away from him; Bucky had gone under like a submarine.\n \n \n\"—have you, Rogers?\" Tony was saying, and somewhere in there Steve had closed his eyes.\nHe opened them and said, \"I'm sorry, I didn't hear the question. I was enjoying this. It's amazing.\"\nTony was looking at him with a funny expression. \"But you don't feel the effect.\"\n\"No, but I still like the taste.\" Steve took another sip and shuddered, his eyes closing. \"It tastes like a memory.\"\n\"A good memory?\" Tony murmured.  Steve didn't answer.\n \n \nHe finally ran Bucky to ground in an Italian safehouse, slipping into his room after hours and locking the door and getting into bed with him before Bucky could protest. Bucky looked despondently at him for a moment but then gave in, lying back and letting Steve get on top of him. Steve had been so hungry for it; Steve had been starving.\nAfterwards, they had their longest conversation ever on the matter.\n\"What are you doing? Why are you doing this to me?\" Steve had asked him.\n\"Because I love you,\" Bucky said, low and deadly. \"You fucking idiot.\"\n\"But,\" Steve began.\n\"Don't be stupid,\" Bucky had said to him, holding him, Bucky's come drying all over him. \"You could have children with her,\" and Steve winced as if Bucky had struck him. He hadn't thought about children, but Bucky knew him better than he knew himself, and certainly in a perfect world he'd have liked children. Christ, that hurt.\n\"But look,\" Steve said, desperate, choosing his words carefully, \"if you were a girl I'd married back home, I wouldn't just—\"\n\"But I'm not,\" Bucky said flatly. \"And you didn't.\" He pulled out of Steve's arms, got out of bed, and lit a cigarette, standing naked in the moonlight by the window. \"I'm not talking about this anymore,\" Bucky had said finally. \"This is what's gotta be,\" and maybe he'd been wrong about Bucky not confiding in anyone, because hadn't Peggy looked at him with such sympathy afterwards, and been extra kind to him, and then when Bucky'd been killed, Peggy had—\n \n \n\"Captain Rogers? Jane West, New York Times, we met at the Mayor's—\" and Steve took stock of himself before lifting his head; his eyes were maybe damp, but he wasn't crying, so that was okay. He was okay.\n\"Not now,\" Tony said firmly, waving her off like a fly. \"Sorry. Private conversation,\" and the woman hesitated but then smiled and moved off. \"You're not all right,\" Tony said to Steve. It wasn't a question. \"You're not even close.\"\n\"No—I—No.\"\n\"Right,\" Tony said. \"Come on, we're getting out of here,\" and almost as an afterthought, he snagged the bottle with one hand, and Steve's arm with the other. \"We're going to go drink someplace else.\"\n \n \n\"Understand that this is just my natural curiosity,\" Stark said later, sprawled across the sofa, \"but are you sure you can't get drunk? Sure, your metabolism's sped up, but if you pounded it, if I handed you the bottle, couldn't you—\"\n\"When Bucky died, I—\" Steve stopped; it felt like sacrilege to say it out loud. \"I had the bottle,\" he finished awkwardly, staring down at his glass. \"It didn't—\" He shook his head. \"It's just as well,\" he added, smiling faintly.\n\"Yeah, I guess,\" Tony sighed. \"What fun we could have had together in rehab, though,\" and that made Steve laugh.\n\"Men in my day, we didn't do rehab,\" Steve said, slouching back and letting his glass rest on his abdomen. \"We just became silent, stony drunks,\" and the look that flickered across Tony's face made him wonder if Howard—had Howard? Steve nudged Tony's leg with his stockinged foot. \"Tony, your father would have been wowed by you. He would have been out of his mind, shouting from the roof at all you've accomplished.\" Tony forced a quick smile. \"No, really,\" Steve insisted. \"It would have been embarrassing: Look at my son, my son's a genius, my son's Iron Man—actually, it would have been unbearable,\" Steve concluded, frowning. \"I think I'm glad I missed it.\"\nThat made Tony laugh for real. \"All right,\" he said, tilting a little awkwardly as he sat up: he was already two sheets gone, \"I know you said you had the bottle when—\" He couldn't make himself say Bucky's name. \"—when your friend, he died, but it couldn't have been anything like this.\" He waggled the whisky, then leaned forward and filled Steve's glass nearly to the top. \"This is the real super serum. This stuff costs more than most cars you've driven.\"\nSteve shook his head dubiously. \"I don't know, Tony,\" he replied slowly. \"Some of those cars cost a couple of hundred bucks,\" and he couldn't help it, he started laughing before Tony figured out he was yanking his chain.\n\"Jesus, you mess with my head; you really do,\" Tony said.\n\"Oh, it's my only pleasure,\" Steve said, letting his head loll back.\n \n \nAnd the truth was that he was actually feeling—not drunk, actually, but kind of toasty, pleasantly tipsy, when Clint walked in with—All the good feelings drained out of him. She looked beautiful, actually, in a sapphire blue gown and heels, her arm twined around Clint's. Steve sat up and began clumsily to put his shoes on.\n\"Well, look who's here,\" Tony said, eyeing them.  \"You guys clean up nice.\"\n\"We looked for you downstairs,\" Natasha said to Tony, her eyes never leaving Steve. \"I didn't know the VIP party was up here.\"\n\"I wanted to try getting Captain America shitfaced without ending up on the front page of the New York Times,\" Tony said, shrugging.\n\"You did a good job of it, too,\" Steve said, managing to get to his feet.  \"In fact, I should turn in.\"\nTony didn't move, just tucked an arm behind his head; his tuxedo shirt was rumpled. \"Aw. Are we breaking up?\"\nNatasha showed Steve a devastating smile.  \"We just got here,\" she said.\nHe wondered if she was counting on him being polite; he didn't feel polite. \"I know,\" Steve said. \"But it's late.\" He looked at Tony and said, \"Tell Pepper I'm sorry.  It was a wonderful party. Goodnight, all,\" but when he turned for the door, Natasha trailed after him. He didn't know why he thought she would give up; Natasha never gave up.\n \n \nSteve didn't turn around, just kept walking resolutely—down two flights of stairs, toward his suite of rooms.  Her tulle underskirt rustled against her legs as she followed him, and she knew he could hear her, but he didn't stop.\n\"You could have told me,\" she called out, and that stopped him—cold.\n\"Oh, that's rich,\" Steve said, turning, and she could see that he was hurt. \"That's really rich, coming from you.\"\nShe'd thought she was in control of herself, and found she wasn't. \"Were you just going to go, or—?\"\n\"—Aren't you in Europe?\" Steve replied angrily, not answering the question. \"I distinctly remember—\"\n\"Were you even going to tell anybody?\" she demanded. \"Or were you going to up and vanish into—\"\nSteve's pale skin was mottling. \"Did I have any way to reach you? Did you leave me any contact infor—\"\n\"Did you even tell Sam?\" Natasha shot back, and Steve's face contorted before he turned and began to fumble with the lock to his rooms.  \"What about Tony?\" she pressed. \"You'll drink his booze but you won't—\" and Steve banged his door open so forcefully it smashed into the opposite wall. He went inside but she was right behind him, palms up and slamming the door open when he tried to close it again. He looked surprised; hell, he probably still thought it was improper for a lady to be in a man's rooms unaccompanied. Well, fuck him. \"Did you tell Clint or Bruce or—?\"\n\"Well, being as you're having me watched, you know I damn well didn't!\" and they panted angrily at each other until Natasha blew out a final long breath and flung herself down on his sofa in a rustle of silk. She kicked off her heels.\n\"It wasn't me,\" she told him. \"It wasn't me, all right? It was all in motion before I—\" and suddenly she had Barnes's distracted voice in her head; it wasn't me, I would never... \"Well, shit,\" she sighed, and let her shoulders fall back against the cushions. She lifted her feet, stared down at her painted toes, let them drop again.  \"They've been watching you for ages,\" she told Steve. \"I only got involved because I thought he might actually fucking kill you.\" She lifted her chin and dared him to give her an argument. \"Which was not an unreasonable conclusion, Rogers.\"\nSteve didn't argue; he'd let anger slip off his shoulders like a robe. \"It's not.\" He collapsed down onto the sofa beside her, toed his shoes off, and stretched his legs; God, he looked tired. \"I know it's not,\" he agreed, twisting to look at her, \"but—Natasha, he wouldn't. He couldn't. Even after everything they did to him, he wouldn't have been able to—\"\nShe tightened her jaw. \"You're a terrible judge of character, Rogers.\"\n\"No,\" he said, and looked at her. \"I'm not,\" and she turned away fast.\nHer eyes found the shield; he'd hung it up on the wall like a decoration. \"You're really going,\" she said softly; it wasn't a question.\nSteve hesitated, and then said, \"Yeah,\" and he leaned in when she kissed him, let her cup his cheeks and draw his face down close. And it was weird, but he was sexually alive in a way that he hadn't been the last time they kissed: he was coming alive for Barnes, she thought. But there was a spark in him that hadn't been there before, and the kiss flared hot between them. She felt his breath catch, and she knew then that if she pushed him back onto the sofa and unbuckled his belt, he would let her—because he was leaving, and because it would make things easier between them to pour what they were to each other into a more conventionally-shaped bottle. He would let her take him, grope him and ride him and reduce him to a notch on her bedpost—and part of her really wanted to do it, especially because she was almost sure that he'd never been with a woman before. But she couldn't—he was so much more to her than that.\nShe changed the kiss, dampening it, and let him pull away from her. His expression was serious, tender.  \n\"I can't ask you to trust me, but,\" she began, and she was taken aback when Steve laughed. \"What?\" she demanded.\n\"I don't know: people are always saying that to me,\" Steve replied.  \"I don't know why.\"\n\"Because you're a terrible judge of character,\" Natasha said, glaring.\n\n\"I'm not!\" Steve insisted. \"I'm a terrific— I picked all the Howling Commandos. I picked Sam. I— \"\nNatasha rolled her eyes.  \"Do you want me to help you or—?\"\n\"Us,\" Steve said with unexpected earnestness. \"I'm an us, now,\" and then: \"Help us, please, Natasha. Please.\"\n \nHe couldn't sleep after she left. She hadn't said goodbye, which didn't surprise him: he didn't know how to say goodbye either, and she was just him turned inside out. Inside, he was five foot nothing and sick all the time, but Natasha was five foot nothing and colossal inside. She'd been shocked that he'd been able to see her as she was, but he knew better than anyone what it was like to have your insides not match your outsides. They had the mutual sympathy of the constantly misjudged; she'd been an unexpected friend, almost a sister; an oddly twinned soul.\nIt hurt to lose her, but that was the worst of it. He'd braced himself for more loss and she was the worst of it.\n \n \nCome the next morning, he found he was wrong. He'd planned to leave with only his compass and his dogtags and the clothes on his back, but then, like Lot's wife, he'd looked back from the door and seen his shield reflected in the mirror.\nHe'd hung it on the wall as a gift for Tony—it was Howard's legacy as much as anyone's—but now he couldn't bear to leave it behind. That piece of metal was a part of him: it had survived Bucky's death and all the years in the ice with him.  Steve froze in an agony of indecision. Talk about conspicuous—it could jeopardize the whole—\n\"Damn it,\" Steve breathed, and then he was rummaging on the floor of his closet and pulling out the round black cymbal case he sometimes carried the shield in, and shoving it and his uniform inside.  The canvas bag had a thick, padded strap, and so he slung it over his shoulder as he headed down into Grand Central Station.\nThe place was a madhouse, jammed with commuters, and the line at Whole Bean was longer than he'd ever seen it, though it was moving. The station was always busy—even at 4 a.m it was busy—but this was the morning rush. It was electrifying, and Steve found himself rocking onto his toes as he waited on line: maybe this explained Tony, he thought; maybe Tony drew his energy up from the place. It was wall-to-wall people, constant movement: a beehive. Even if they put on extra agents, Steve thought wildly, good luck tracking anyone though this mess.\nIt was like Grand Central Station in here.  God, he missed Bucky so hard his teeth ached.\n \n \nSmart, Natasha thought. The whole bit with the coffee was smart: establishing the routine of it, the waiting in line. She watched Steve stand there, shuffle forward, stand, and anyone who needed reassurance could get it: there he was, getting coffee. She felt it herself, the urge to relax, even though she knew better—Barnes (because it was Barnes; this was the plan of someone who understood the psychology of waiting) had made them read the line as a timeline. The brain couldn't help but estimate—it was going to take him at least six minutes to get to the front, order, and pay—so you could stand down a little, blink your eyes, file your report: SGR on line at Whole Bean Coffee. She resisted the urge to look at her watch—and even with her eyes fixed on him she nearly missed it, because it happened so fast and he was so graceful about it: he just stepped out of the line and disappeared behind the counter.\n \n \nHe'd darted into Whole Bean's employee–only area and out the back door before anyone could question him, emerging on the loading dock for Tracks 105-106. And then he was running for his life, taking the metal steps at the end of the platform four at a time and then racing down a series of corridors, because there were eight stories and five doors between him and Bucky Barnes and the whole rest of his life. Steve could see them all in his mind, handwritten in fading letters on maps from 1912, 1952 and 1971: METER HOUSE, PIPE STATION, ACCESS SHAFT, TRANSFORMER VAULT, STAIR D: NY BILTMORE HOTEL. \n \n \nAgent 86, Seburn, still hadn't noticed Steve was gone. Natasha could see that he had segmented the room in his mind and was methodically scanning it for the Winter Soldier, just like he'd been trained to do, because he thought Rogers was in pocket. She saw his attention go inward and his eyes jerk back to the line: his earpiece had gone off, probably. But the area in front of the counter was dense; impossible to see at a glance if Rogers was there or not.\nShe moved closer, not yet wanting to be noticed. \"No, I don't have a visual; repeat, I do not have a visual,\" he said, and she glanced at her watch: 8:37, four minutes before reinforcements or lockdown—though even here, Barnes had chosen well: who the hell was going to lock down Grand Central? Even the Chitauri attack hadn't closed down Grand Central. Their whole protocol had been designed for D.C.—the Hill and the Mall had lock-down procedures that went into effect every other day in the wake of the Triskaleon, and it was easy enough to adapt them to, say, a subway station, or the Botanical Gardens. But Grand Central? Were they going to stop every train, every subway, every cab, seal off every exit, tunnel, elevator or shaft under midtown because Steve Rogers wanted some alone time? It would be a political nightmare for somebody—if angry commuters didn't kill them first.\n\"Do you have him?\" Seburn was saying. \"I don't have him. Dammit,\" and then he paled as Natasha strode up to him, all business. \"Agent Romanov,\" he said, swallowing.\n\"You don't have him?\" Natasha demanded.\n\"No,\" Seburn admitted. \"He—walked off.  Just disappeared.\"\n\"Any sign of the Winter Soldier?\" she pressed.\n\"No,\" Seburn said, rather more strongly. \"No sign of him, and no sign of a struggle either. I don't think Cap's in any danger, ma'am; I think the guy just—\" He hesitated, perhaps remembering who he was talking to. \"Captain Rogers seems to dislike being under surveillance,\" he said carefully, and yeah, that was one way of putting it. \"He's done this before when he's spotted us—just walked off. But we've always managed to—\" Seburn cut off, listening intently to his earpiece. Then he shook his head. \"We don't have him yet,\" he said tensely. \"What should I do?\"\n\"Get a team together,\" Natasha said. \"If he's gone off on his own, I don't care,\" she added pointedly, hoping that Seburn's mic was powerful enough to pick up her voice; this was all going to be evidence later, she was sure of it. \"He's not a prisoner. But if he's hurt—if the Winter Soldier's lured him away or picked him off—then we've failed our mission.\" She looked down at her watch. \"Start in this room,\" she said. \"I want every platform and door off this room searched,\" and that made enough tactical sense that she could defend it later; she knew she'd have to.\n \n \nSteve ran into trouble at the second to last door, which wouldn't open. He knew that Bucky would have gone through and checked everything, but someone must have come through afterward and locked it again. He tried forcing it first with his hands, then with his shoulder, and he hadn't realized how much adrenaline he'd built up until he practically kicked the door off its hinges and burst through, panting. So close—and there was the metal door marked STAIR D, and Steve went up and up and up.\nNEW YORK BILTMORE HOTEL was painted in faded letters on the dirty walls of the stairwell—but the Biltmore wasn't even there anymore: it had been gutted and rebuilt into a boring skyscraper with a Madison Avenue address.  But it sat atop what had once been Grand Central's cab stop, and Steve emerged into a narrow tunnel, filthy but beautiful, with an arched Guastavino ceiling that matched Grand Central's architecture.\nThere was only one car there—a beat-up black livery cab with its trunk popped—and one person, Bucky Barnes. He was leaning against the fender with familiar stillness—a stillness that Hydra had perverted and made terrifying by turning him into the Winter Soldier.\n\"How're you doing?\" Steve asked as he clambered into the old car's empty trunk.\n\"Hanging in,\" Bucky said, and shut Steve up into darkness.\n \n \n\n08:45 SGR NO REPORT\n08:50 SGR NO REPORT\n08:55 SGR NO REPORT\n09:00 SGR NO REPORT\n\n \n \nThe team did well, actually—tracing Steve from the back of Whole Bean, across Tracks 105 and 106, up the stairs and through two turns before losing him. \"Trail's gone cold,\" Seburn told her, taking the bullet for all of them.\nNatasha tilted her head at him.  \"Frame that differently,\" she said.\nSeburn thought about it; he wasn't dumb. \"We've established that Captain Rogers was alive and left the area voluntarily,\" he said.\n\"Attaboy,\" Natasha said.\n\"We can bring in sniffer dogs,\" Seburn suggested, and then he frowned. \"That is—if you—\"\nIt had all started to seem just a little bit fascist. One of the arriving agents—55, Natasha marked the number—announced that she had triangulated the nearest trains and exits and sent teams to cover them, which was exactly what Natasha didn't want her to do, but you couldn't keep a good woman down. \"Good job,\" she said, instead.\nClint arrived while she was on the line with Director Cooper. \"Rogers went off the grid,\" she told Cooper; she met Clint's eyes and held them. \"Slipped away from us during the rush. Probably just went walkabout, but there's a strong possibility that the Winter Soldier has lured him into some sort of—\"\n\"No, I don't think so,\" Cooper interrupted, and Natasha bit her lip. \"We've got new intelligence: the Winter Soldier's been spotted in Arkhangelsk—which probably means he's going north.  Novaya Zemlya,\" he said, and then added: \"The Soviets had bases there, top secret scientific research facilities; it's likely the Winter Soldier's home base.\"\nNatasha raised an eyebrow at Clint, who grinned back at her. \"You don't say,\" she said.\n \nThey drove for a long time—first in stop-and-go traffic that had Steve braced inside the trunk, then in a steady, rocking rhythm. It was hell finding even a semi-comfortable position pretzeled up like he was, but he focused on breathing and let his mind drift: it was odd not to know where he was going, odder still not to care. Finally, the car glided off the highway onto a stretch of rough road, and then turned onto gravel. They pulled to a stop, and he heard the car door slam and then a metal chain rattling: a garage door, he thought after a moment, coming down.\nThe trunk opened and Bucky peered down at him worriedly. \"You all right?\" he asked, extending Steve a hand.\nSteve took it and let Bucky haul him out of the trunk. \"Sure,\" he said, groaning and stretching his back. \"Loads of fun, let's do it again.\" The garage had three bays and was lit by long, dingy fluorescents— a rural gas station, Steve thought.  There was a workbench on one side and tools hung on the wall.  A dusty white van was parked next to them, ladders hooked onto its side, but the third bay was empty.  A grimy window beyond showed trees.\n\"Where are we?\" Steve asked.\n\"Pennsylvania,\" Bucky answered. \"We're not staying, but we needed to stop. It's safe here—isolated, no cameras,\" and Steve felt relief and a kind of exhaustion rolling over him: he and Bucky were finally alone, with no mission, no one to report to, nobody trying to kill them—and he let his shoulders drop and tilted forward until his forehead thunked down on Bucky's shoulder, and Bucky cupped the back of his neck. He thought he could sleep for a year.\n\"Go on,\" Steve mumbled, breathing in Bucky's familiar smell: 1943, Brooklyn, home. \"Keep talking.\"\nBucky's whole arm came around him and then they were squeezing each other, tight tight. But Bucky's voice, when he spoke, sounded normal enough. \"We've got to change clothes. And change cars. And eat. And this,\" and Bucky's flesh hand was slid up into Steve's hair, affectionately fingering the strands and then tugging gently.\n\"You want me to shave my head?\" Steve asked, lifting his face from Bucky's shoulder.\n\"No, but we've got to get rid of the blond. It's too distinctive,\" Bucky said regretfully. He touched Steve's face and said, \"And you should grow a beard, maybe.\"\n\"Yes. Anything,\" Steve said, but Bucky jerked back when Steve moved to kiss him, his metal hand coming up between them.\n\"I can't,\" Bucky said. \"We've got a long way to go yet, and I won't make it if you start that. I’m spit and glue over here,\" he said, averting his eyes, and then he handed Steve a paper sack.  \"Eat something,\" Bucky said.\nThey had sandwiches and Cokes, and then Bucky took Steve into the garage's tiny little john and helped him dye his hair a nondescript brown with some smelly stuff out of a box. Then he made Steve strip down and black-bagged everything he was wearing, giving him a pile of heavy duty work clothes to put on instead: work pants, a heavy canvas jacket, a worn pair of construction boots. Then Bucky pulled a pair of gold wire-rimmed glasses out of his breast pocket and handed them to Steve, who turned them over before hooking them over his ears.  He'd seen officers wearing glasses like these in D.C.—and that's when he saw the persona that Bucky'd created for him: ex-military, worked with his hands in engineering or construction. Bucky stepped back, surveying his work, and then nodded, satisfied. \"You look good,\" Bucky said. \"Just enough like someone else to look like nobody.\"\nHe'd brought a second set of work clothes for himself, and he began to change into them, shucking his black jacket, kicking off his sneakers—Steve was guessing that they'd be driving the work van out of here—and yanking his shirt off—and suddenly Steve was breathless, suckerpunched, ambushed by tears at the ropey scars streaking down Bucky's shoulder, the seared flesh around the metal, the skin grafts. They'd cut into the beautiful envelope that was Bucky's body—and suddenly it was 1943 and Italy and it was raining, and there were wounded men everywhere, groaning on stretchers with their arms and legs blown off—but this was Bucky. His Bucky.\n\"What?\" Bucky looked up. \"Steve?\" and then he tugged his shirt onto his shoulders and muttered, \"Sorry, I forgot you haven't seen—\"\n\"Don't you fucking say you're sorry,\" Steve said, savage and wet. \"I'm sorry. Everyone else should be sorry. Not you,\" and then, feeling wild and heartbroken: \"No, I take it back: you should be sorry. But not for this. You know what for,\" and Bucky knew him better than anyone, Bucky'd known him his whole life.\n Bucky jerked a nod. \"Yeah,\" he said, and scrubbed at his hair. \"I know.\"\n\"Good. Good. Because it was wrong what you did. We don't have to talk about it anymore, because it's not just water under the bridge—the whole bridge is gone, and the whole world with it—but we were—well, you know what we were.\"\n\"Married,\" Bucky said bluntly, and the word brought Steve up short.\n\"Yeah,\" he said.\n\"Yeah. Well,\" Bucky said. \"I was trying to be a gentleman. I don't do that anymore.\" He sighed and added: \"Though I did tell her, you know. Peggy.\"\nSteve frowned. \"What did you tell her?\"\n\"That I was taking you,\" Bucky replied. \"That I need you more than she does. I always did, too,\" Bucky said, and roughly yanked on a pair of gloves. \"She liked you well enough, but she needed you like a hole in the head. Look at her—100% less you and look at how well she did for herself,\" and Steve laughed and covered his eyes. \"It's the truth!\" Bucky protested. \"God's fucking truth; that woman's ninety-eight and looks better than either of us.\"\n\"You flatterer,\" Steve said. \"Sweet talker.\"\n\"I call it like I see it,\" Bucky said, and threw the plastic bags with their clothes in them in the back of the van before Steve loaded his shield in. \"Check the car, make sure it's clean,\" Bucky directed, giving the garage a once-over.\n\"We're leaving it?\" Steve asked.\n\"It's theirs,\" Bucky said absently. \"The van's ours,\" and then: \"Place looks okay, right? Should we burn it down anyway?\"\nSteve looked at him. \"No,\" he said.\n\"They're insured,\" Bucky pointed out. \"We'd probably be doing them a favor.\"\n\"Get in the van,\" Steve said.\n \n \n \n \n\"Hey, you're going the wrong way,\" Steve said.\n\"No, I'm not.\"\n\"We're going back to New York?\"\n\"You want to root for the Cubs?\"\n\"No,\" Steve said.\n \n \n \n \n\"I want a dog,\" Steve told him.  \"A big dog. Maybe two dogs.\"\n\"We're not even there yet,\" Bucky objected.\n\"I can hold the line at two dogs,\" Steve said.\n\"Jesus Christ.\"\n \n \n \n \nBucky took them back to New York the long way, down into Jersey and across Staten Island over roads and bridges that hadn't existed when they were kids.  There was construction—it was Brooklyn, there was always construction—the road narrowing down to one lane, and so it was dark when Bucky pulled the van onto Ocean Parkway. Steve peered out the front window: he didn't recognize the neighborhood—wasn't Ocean Parkway much further south?\n\"Where are we?\" he asked Bucky.\n\"Coney Island Avenue,\" Bucky answered, turning onto it.\n\"No,\" Steve disagreed.  \"Can't be. Coney Island's miles south of here.\"\n\"The north side,\" Bucky said, taking his hand off the wheel to slice upward with his fingers. \"McDonald Avenue, Ocean Parkway, Coney Island Avenue, they all go straight down to Neptune, and the water. Other side of the park.\"\n\"I can't picture it,\" Steve said, frowning.\n\"You got the whole rest of your life to picture it,\" Bucky said.\nThis part of Coney Island Avenue was commercial—a series of two and three story brick buildings, industrial: a plumbing warehouse, a tile company, auto glass, a couple of places that installed car alarms. The street was dead, because all the stores were closed, metal roller shutters down over the store windows, garage doors padlocked and painted NO PARKING and 24 HOUR ACTIVE DRIVEWAY. Bucky slowed, then pressed a button on his sun visor, and one of the garage doors began to go up. Bucky turned into the driveway, and Steve leaned forward to look at the bright yellow sign overhead: CONEY ISLAND DESIGN AND CONSTRUCTION. The lights inside came on automatically, and Bucky drove in slowly—this garage was something else entirely from the one they'd just left.\nIt was obviously a functioning business, and it was crammed with stuff: tools, building supplies, drywall, bags of concrete, a welding station. The whole back of the garage was a workroom: Steve saw a wheelbarrow, sawhorses.  There was a rough wood counter on the side with pens and a phone and an invoice book and a calculator.  Steve got out of the van to look around as the garage door rattled down behind them; he turned and saw that there was a smaller door beside it that led out to the street while other doors around the interior lead deeper into the building.\nThe slam of the van door echoed in the space, and then Bucky came around the hood, watching Steve warily.  \"I can give you the whole tour tomorrow,\" he said. \"Right now I could do with a pizza. There's good food around here, actually—deli and pizza down the block, an Indian place. The hipsters haven't reached us yet, though they're coming—there's all these fancy restaurants down Cortelyou. A whole shop for muffins—crazy.\" Bucky went to the counter and picked up the phone, which, to Steve's delight, was black and had a dial on it—and, turning to squint at the wall, began to dial; Steve saw that the wall behind the counter had phone numbers written all over it in pencil.\n\"Hey Nicky's,\" Bucky said, \"I want to order a large pizza,\" and Steve leaned with his elbows on the counter and said, \"Great: what are you going to eat?\" and Bucky rolled his eyes and said, \"...and you got sausages?  Give me an order of sausages.\" Steve rolled his hand twice. \"And meatballs,\" Bucky said.\n\"And something green,\" Steve suggested.\n\"And what kind of vegetables do you—\" Bucky tucked the phone into his shoulder and muttered, \"It's a fucking pizza place, not Delmonico's—what?\" He listened for a second and then said, \"Spinach or broccoli?\"\n\"Spinach,\" Steve said. \"That's it.\"\n\"You sure?\" Bucky rolled his eyes. \"You want a leg of lamb, suckling pig?—no, I'll come get it,\" Bucky said, and slammed the phone down. \"Jesus, I remember when you didn't eat anything.\"\n\"Yeah, well I remember when Joan Crawford was Queen of the Box Office,\" Steve said. \"C'mon—show me the rest.\"\nSteve followed Bucky through a door and up a battered flight of wooden stairs. Two doors faced each other on the landing, both closed. Bucky pointed to one of them and said, \"This is for tomorrow. It's a surprise; you'll like it,\" and Steve's felt his throat closing up, because for the first time in a long time, that was likely to be true: Bucky actually knew him, and knew what he liked, so he might actually like it. Bucky unlocked the door on the other side and opened it; inside was a small apartment, just two rooms, and so—he walked in—achingly, achingly familiar. Steve couldn't even have said why that was, at first: something about the plainness of the furniture. Table, bookcase, a small kitchen—everything old but real, made of real things: wood, metal, glass. He stepped into the bedroom. There was a plain wool blanket on the bed and—somehow this was what did it—a pair of battered leather shoes kicked into the corner. Bucky's shoes—and suddenly he could hear Bucky's mother's exasperated voice in his head, because Bucky was always kicking off his shoes and she wanted everybody's shoes lined up neatly beneath the bed.\nBucky lives here, Steve thought.  We live here.  I'm home.\n\"It's nothing fancy, I know,\" Bucky said, darkening the door of the bedroom behind him, \"but—\"\nSteve turned. \"Bucky, I swear to God, I never in my whole life wanted more than this,\" he said.\nTo his surprise, Bucky let out a laugh, a real one, loud and strong. Steve stared; it had been such a long time since he'd heard Bucky's laugh. \"This isn't even the good part,\" Bucky protested, and grinned at him. \"Wait until you see what I've—\" and Steve kissed him then; he was tired of waiting, and one of the best things—maybe even the best thing—about being big now was that sometimes he was the one who got to tug Bucky in for kisses.\nBucky didn't push him away this time; instead he slid his arms around Steve's waist and opened his mouth, and the kiss became searingly hot. Steve helplessly rubbed his hard-on against Bucky's hip—he missed sex; he missed it so much—and felt Bucky's hands stroking up his back and then down over his ass.  He remembered—God—that first time, when Bucky had been kissing him and rubbing off against him and his cock had accidentally slipped, slickly, nearly into Steve's ass, and suddenly that had seemed like a really great idea, and Bucky'd barely had time to choke out, \"oh, God—please,\" before Steve was rolling over and pushing back and God, it had been a really good idea, so good that Steve thought he might die of it—having Bucky inside him and Bucky's hand on him, Bucky's other hand cupping his inner thigh and Bucky sobbing and losing his mind behind him. Now, they broke apart, panting.\n\"I have to warn you,\" Bucky said shakily; maybe remembering, too, \"that if we do this, I might fall apart right here.\"\nSteve pressed his forehead against Bucky's.  \"You're carrying too much. Give it to me,\" he murmured, \"let me hold it,\" and Bucky smothered a soft, hurt sound against Steve's mouth. Steve muscled him back onto the bed, and then they were trying to get their clothes off while still sucking on each other's tongues, and suddenly Bucky twisted away, pressed his cheek into Steve's palm like a cat and groaned, \"I have to get the goddamned pizza.\"\nSteve slid his thumb across Bucky's full lower lip, and Bucky opened his mouth. \"I,\" Steve began, and promptly forgot what he was saying. \"I'll get. After,\" he said. \"We'll eat it after,\" and this was all he had ever wanted ever.\n \n\"Where the hell are you?\" Bucky demanded, when Steve finally picked up the phone.\n\"What do you mean?\" Steve shot back. \"I'm in Jersey, I just finished. I'm waiting for them to pay me,\" and in fact he was standing out on the lawn in the sunshine, having just packed up the van. \"I'll be out of here in five minutes—\"\n\"Not good enough,\" and something was really wrong; he could hear it in Bucky's voice. \"Where are you, exit 9? Shit. That's an hour minimum—see, this why we shouldn't take jobs in Jersey, I told you we shouldn't—\"\n\"What's going on?\" Steve asked.\n\"Bats, it looks like,\" Bucky said, and for a moment, Steve thought he couldn't have heard that right.  \"On the bridge.\" He didn't need to say what bridge.  \"It's all over the television—there's some super-nightmare in a cape with an army of bats,\" and Steve was running into the house now, phone pressed to his ear, \"big ones, got to be eight or nine feet—\" and Mrs. Markov looked up from her checkbook, surprised, as Steve went to the flatscreen in her sunny kitchen and said, \"I'm sorry, may I just look at your television for a—\" He switched it on and then they were both staring at the shaky helicopter footage of giant bats strung out like birds on a wire across the Brooklyn bridge.  Others circled in the air above the river, occasionally swooping down to attack cars or bite fleeing pedestrians. Below the bats, a giant man in a helmet and a cape was waving his arms in the air. He was superhuman—had to be—or maybe an alien; Steve had never seen him before. He looked like he was giving a speech.\n\"I got it, but I don't have sound,\" Steve said. \"Anybody know what he's saying?\"\n\"Who cares what he's saying?\" Bucky objected. \"He's a lunatic, it's a Hitler speech: bow down before me or bats will eat you. It ain't the Gettysburg address, I can tell you that,\" and even as Steve watched, he saw the first streak of red and gold across the sky: Tony'd gotten there anyway. \n\"Shit. Shit.\" Bucky, muttering low and constant in Steve's ear. \"All right. Well.\" He sighed. \"Honestly, if it was midtown I'd let the bats have it, but that's my bridge,\" Bucky said, and then: \"I'm taking your motorcycle, all right?\"\n\"Yeah, of course,\" Steve said softly, and he could hear Bucky running up the stairs to their apartment, could practically see him flinging open the top of the old footlocker at the end of their bed. \"Be careful, will you?\"\n\"Oh sure,\" Bucky said distractedly. \"No worries. I told you we shouldn't take jobs in Jersey,\" he said, and hung up.\n \n \nNatasha and Clint reached the bridge maybe seven minutes after Tony did, pulling up in an open-top Jeep.\n\"Eccch,\" Natasha said, looking up, because the bats were disgusting—like flying rats with sharp little teeth.\nClint was already loading his bow.  \"I'll take down the bats—you go after Die Fledermaus.\"\nNatasha looked at him gratefully. \"With pleasure,\" she said, and unholstered her guns.\nClint began firing arrows, and the air was filled with a terrible screeching as wounded bats began swooping unevenly through the air, their wings flapping wildly. Somewhere out over the river, Tony was blasting them out of the sky—she could hear them crashing into the water.  Natasha ran around the cars on the bridge—most were empty, doors open, but a few, she saw, had people cowering in them; she was trying to find a good strategic position to take this madman—Chiroptera, he styled himself, and they had all had a good eyeroll over that—down. He was at least ten feet tall—some lab experiment gone wrong, Natasha supposed. Well, weren't they all—but you didn't have to be an asshole about it, she thought, and hunkered down behind a Porsche to try and get a bead on him.\nBetween the splashing and the screeching and the whup-whup of the news helicopters flying overhead, she didn't hear the roar of the motorcycle until it was practically right on top of her—speeding up onto the bridge and then falling onto its side, wheels still spinning, because Cap had already leapt off it and onto the top of a minivan, and the shield was out and zinging across the bridge. It smashed into Chiroptera's chest and sent him careening backwards—and Cap ran forward, leaping from car to car, and snatched the shield out of the air when it rebounded to him.\n\"Holy shit,\" Clint's voice, in her ear.  \"It's Rogers.\"\n\"No,\" Natasha said. \"It isn't.\"  Steve had a totally different fighting style.  \"It's the other one.\"\n\"Wow, they're a power couple,\" Tony mused, a little static-y. \"Like the Clintons. Buy one, get one free,\" and Cap took a flying jump onto Chiroptera's back and crooked his arm—the left one, Natasha noted—around his throat in a stranglehold.  Chiroptera let out a roar and began to stagger around the bridge with Cap on his shoulders. \"Stupid bastard should have attacked the Triborough,\" Tony tsked. \"These Brooklyn boys are really kinda defensive.\"\n\"Any reason we shouldn't let Cap, uh, kill this thing?\" Natasha asked, watching as Cap wrenched off Chiroptera's metal helmet with his free hand: his dark skin was leathery like a bat's and his eyes were shiny red beads, inhuman.\n\"Uh, no,\" Clint said, and fired another flight of arrows. \"Tell him to go for it.\"\n\"Fine by me!\" Tony chirped. \"Yay!\" and sent out a blast that sent two more bats into a fiery downward spin.\nCap rode the collapsing Chiroptera down to the ground, then landed gracefully and kicked him with his boot to see if he moved. \"Stand back,\" Natasha said, and Cap looked warily at her but did so, and Natasha fired a clip's worth of bullets into him for insurance. \"Here,\" she said, and threw one of her guns to him; he caught it neatly and jerked a nod of appreciation. \"You take the Brooklyn side,\" she said, and they split up to pick off the rest of the bats.\n\"Tell Bucky-Cap lunch is on me,\" Tony said. \"I'm thinking Chinese—I've got a yen for Kung-Pao chicken.\"\nClint said, \"I don't think you can have a yen for—\"\n\"He can't.\" Natasha bit her lip and watched as one of the helicopters suddenly veered off, and she knew where it were going: it was going to try to follow Barnes. \"He's got to get back without leading them to Steve. Tony,\" she said tentatively, \"you don't think you could maybe—\"\n\"—have a little accident? Butterfingers?  Whoopsie!\" Tony said, and sent out an EMP that knocked out the engines on both copters and sent them spiraling into emergency landings at the Downtown Manhattan Heliport.\n \nThere were cars pulled up on the sidewalk along this stretch of Coney Island Avenue, and so she had to walk around and between them.  Two guys who were installing a car stereo looked up at her as she passed, then nudged at each other and muttered in Spanish; at the auto glass store, they were Russian, and so she was able to tell them that sorry, no, she had no interest in marrying any of them. They laughed and clutched their hearts, miming devastation.\nThe garage door was open at Coney Island Design and Construction, and she skirted the dirty white van parked there and made her way, carefully, toward the back of the shop. James Barnes was bent over the counter, taking notes in a spiral notebook as he talked on an ancient, corded phone, and then he looked up and saw her and immediately became someone else; eyes sharpening, nerves going taut. \"I have to call you back,\" he said, and hung up.\n\"I hear you fix things,\" Natasha said, tilting her head toward a metal sign on the wall behind him: REMODELS, DRYWALL, CARPENTRY, PAINTING, INSTALLATION, ELECTRICAL, REPAIR: WE FIX THINGS.\nBarnes didn't say anything, just nodded slowly, and so she went up to the counter and pulled out the pocket-watch.  She'd had it since she was a child: one of her handlers had given it to her, saying it had belonged to her father. She hadn't believed him, but she had kept the watch anyway—the lie itself had been a kindness she wanted to remember.\nBarnes frowned down at the watch in surprise—he obviously hadn't expected her to commit to her pretext of being a customer—and then picked it up.  He turned it over in his gloved hands, and then popped the gold back off with obvious skill—and now it was her turn to be surprised, because he reached down under the counter and pulled out a little velvet bag of watchmakers tools: thin and silver, with different points and textured grips.\n\"This is a nice thing,\" Barnes said, sounding sincere about it. \"It looks French but the case is Russian—so maybe it's a Russian copy of a French watch, I don't know,\" and then he was poking delicately into it with one of the little silver tools, and twisting the knob on the top, and to her surprise she heard soft ticking, and then a delicate chime.\nShe felt her eyebrows shoot up.  \"It works?\"\nBarnes's mouth pulled up at the corner. \"Oh sure,\" he said. \"Can't break something like this, this thing'll outlast all of us,\" and then he popped the back on and handed it back to her. \"Take it to a real place, get it cleaned and—\"\nThey heard the tumble of Steve's feet on the stairs, and they looked at each other. There was an alcove behind the counter, and in wordless agreement, Barnes yanked the curtain aside and Natasha ducked behind it, turning and positioning herself to peer through the crack. Barnes quickly turned back to his notebook and picked up his pen.\n\"Hey,\" Steve said, coming through a door in the back, and if she hadn't known it was Steve, she wouldn't have recognized him—though it wasn't the darker hair or the beard or the cardigan, or the fake gold-rimmed glasses. It was the whole way he carried himself.  He looked—younger, slimmer, happier; a little rumpled and distracted, like his shirt maybe was one button off, brown hair standing up in tufts, like he'd finally come unstarched.\n\"The beer wasn't getting cold so I put it in the freezer part of the icebox. Can you remember to take it out in ten?\"\n\"Sure,\" Barnes said. \n\"Game starts at seven. I thought I'd take the dogs out and then pick us up a pizza on the way back,\" Steve said.\n\"Great,\" Barnes said. \"What are you gonna eat?\"\nSteve grinned. \"And maybe some pretzels or something. Chips. I don't know; I'm dying for something salty. Is there something special you want, or—\"\n\"Ice cream,\" Bucky said, and Steve lifted his eyebrows.\n\"Ice cream?\"\nBucky put his elbows on the counter.  \"Yeah. I mean, were you asking, or was that, like, a formality?\"\n\"I'm asking, I'm asking. What kind of—never mind, I know.\" Steve went to the back door, put his finger and thumb in his mouth, and blew out a piercing whistle—and two golden labradors bounded into the garage, barking and circling Steve's feet and looking up at him adoringly. Natasha froze as one of the dogs sniffed the floor and made a beeline for her, but Barnes said sharply, \"Gracie,\" and the dog immediately whirled around and went back to Steve.\n\"I wish I could do that,\" Steve sighed.  \"They don't listen to me like that.\"\n\"To be fair, that was pretty much my job in the war, too,\" Bucky said, and Steve laughed.\n\"All right, guys,\" Steve told the dogs, and then he went over to Barnes and gave him a kiss that wasn't so much a kiss as it was the sincere promise of a fuck later, and Natasha had never in a million years imagined Steve Rogers kissing anyone like that. Barnes stiffened self-consciously, aware of her where Rogers clearly wasn't, but he didn't hesitate for long before opening his mouth and giving himself over to it.  Even that small hesitation must not have been characteristic, because Steve pulled away, frowning quizzically, and asked, \"Everything all right?\"\n\"Yeah,\" Barnes managed, biting and sucking at his own lip. \"I'm just—in my own head a little.\"\n\"Well, don't do that,\" Steve said seriously. \"It's so empty in there,\" and Barnes cracked up and said, \"Fuck off.\"\n\"Text me if you want something else, you pig,\" Steve said, the dogs nearly tripping him. \"I won't be long. Don't—\"\n\"I won't forget,\" Barnes said. He waited until Steve was out of sight before turning back to Natasha and yanking the curtain open. \"George is all right but Gracie's a little high maintenance,\" he told her. \"His fault; he fucking spoils those dogs.\" He looked hard at her for a moment, and then jerked his head toward the door Steve had come through.\n\"C'mon,\" he said. \"Show you something,\" and she followed him through the door and up a flight of battered stairs. There were two doors on the landing, and she had a quick glimpse into their apartment—a small square table and chairs, a tiny kitchen and a beat-up sofa beyond—before Barnes yanked that door shut; our life, not yours. \nHe opened the other door and she took a surprised breath: the studio had a curved glass roof like a greenhouse and was full of easels and paint cans. It was bright and smelled like turpentine. There was a picture in progress on the nearest easel—a girl on a barstool, lips curving as she smiled into her pint glass—but Barnes waved her away from that—\"Commercial,\" he said. \"He's doing that for some bar in Fort Greene\"—and took her deeper into the studio. Here there were other paintings, lots of them; paintings she didn't understand, canvases covered with thick layers of paint in jagged lines of blue and black and white. She looked at them one after another and slowly began to feel a kind of violence coming off them; violence of feeling anyway. Clouds; or smoke, she thought. Ice.\nBarnes was staring at them, too, and nodding to himself. \"It all came pouring out of him,\" he said. \"It's how he thinks. Sometimes he can't...\" He chirped his hand absently; talk. \"You know anything about painting?\" Barnes asked her, and pursed his lips when she shook her head. \"They're good,\" he said. \"They're really good. I told him he should put a show together. He's worried they're too retro—not conceptual enough—but I think people have had it with that conceptual shit. You have an idea, write it down: you don't need paint for that. Such garbage in the museums, I can't tell you.\" He was staring at one of the canvases: blue and black and white, a smear of brown and red on one side. \"Pouring out of him,\" he murmured, \"one after the other,\" and then: \"You take this from him, I'll kill the lot of you; every one.\"\n\"Wouldn't dream of it,\" Natasha said.  He gave her a sharp look, but whatever he saw on her face seemed to satisfy him. \"Look, James—can I call you James?\"  She didn't wait for his answer.  \"I can't ask you to trust me—\"\nHis face cracked into a wry smile.  \"That's my line,\" he said.\n\"—but secrets are something I understand. Nobody needs to know that Captain America lives here,\" Natasha said. \"Or Steven Rogers, either,\" she added, and the look on James Barnes's face was worth everything."
}