{
    "id": "31654376",
    "url": "https://archiveofourown.org/works/31654376?view_full_work=true",
    "author": [
        "Ididloveyou_once"
    ],
    "title": "Trust fall",
    "rating": "Mature",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Batman - All Media Types",
        "Batman (Comics)"
    ],
    "relationships": [
        "Tim Drake/Kon-El | Conner Kent",
        "Jonathan Kent/Damian Wayne",
        "Tim Drake & Damian Wayne",
        "Tim Drake & Jason Todd",
        "Tim Drake & Dick Grayson"
    ],
    "characters": [
        "Tim Drake",
        "Damian Wayne",
        "Kon-El | Conner Kent",
        "Jason Todd",
        "Dick Grayson",
        "Bruce Wayne",
        "Alfred Pennyworth",
        "Jonathan Samuel Kent"
    ],
    "additional_tags": [
        "Batfamily (DCU)",
        "Brotherly Bonding",
        "Coming Out",
        "Emotional Hurt/Comfort",
        "Emotional Hurt",
        "Light Angst",
        "Panic Attacks",
        "Tim Drake Needs a Hug",
        "Tim Drake Gets a Hug",
        "Bad Parents Jack and Janet Drake",
        "Good Sibling Damian Wayne",
        "Good Sibling Tim Drake",
        "Good Sibling Dick Grayson",
        "Good Sibling Jason Todd",
        "Bruce Wayne is a Good Parent",
        "Protective Tim Drake",
        "Protective Damian Wayne",
        "Family Dynamics",
        "Brotherly Love",
        "Damian Wayne Has a Crush",
        "The kents all live on a farm together",
        "Including Kon",
        "and Jon",
        "Family Feels",
        "Fluff",
        "Anal Sex",
        "Sexual Content"
    ],
    "language": "English",
    "series": "",
    "published": "2021-06-01",
    "completed": "2021-06-17",
    "words": "22,423",
    "chapters": "7/7",
    "comments": "841",
    "kudos": "11,483",
    "bookmarks": "2,233",
    "hits": "116,081",
    "summary": "<p>‘Drake?’</p>\n<p>Tim felt like he was choking. His throat was tight. He couldn’t swallow.</p>\n<p>‘Damian?’ He managed.</p>\n<p>Damian was… here. At Kent Farm. Dressed in the too-big Batman pajamas that Dick had bought him last Christmas as a joke. And- And-</p>\n<p>Tim was wearing Kon’s t-shirt and his hair was messy and his lips were swollen and- He wasn’t ready for this- He wasn’t- He couldn’t-</p>\n<p>How had he been so stupid?</p>\n<p>Or: Tim comes out to Damian and prepares for the entire family to know by morning. It just so happens that Damian can keep a secret. Multiple, actually.</p>",
    "notes": "<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>This is all already written (pretty much). Updates will be every other day or so depending on how cruel I feel.</p>\n<p>Much love.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>Happy pride month! &lt;3</p>\n<p>The tags have been updated. This is the most explicit that it gets so feel free to skip if it makes you uncomfortable (this chapter has very little bearing on the rest of the plot).</p>\n<p>Enjoy &lt;3</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>I just love cringey romance dialogue. Can you tell?</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>My new, confused, and completely unorganized <a href=\"https://ididloveyou.tumblr.com/\" rel=\"nofollow\">Tumblr</a> &lt;3</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p>Much love.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">notes</a>.)\n</p>\n<p>Apparently I think that cheating at go fish is the peak of romance. Quick, someone tell the love of my life.</p>\n<p>Me, yesterday: This is finished enough that I can post it.</p>\n<p>Me, yesterday, for literally no reason: Ew no I’m not uploading on a Wednesday.</p>\n<p>So, yeah, happy Thursday everyone.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">more notes</a>.)\n</p>\n<p>Much love. </p>\n<p> <a href=\"https://ididloveyou.tumblr.com/\" rel=\"nofollow\">My Tumblr</a> &lt;3</p>",
    "text": "Tim untangled himself from Kon gently. The cool air of the room pressed against his warm skin like something wanting. It was refreshing. A stark contrast to the literal space heater pressed against his back. \nHe lifted the arms around his middle, kicked his feet free from the blankets, and stood up. \nThe room was still dark, even with the moonlight shining through the window. They’d forgotten to shut the curtains last night. Well  - Tim stretched and yawned - they hadn’t really forgotten.  But they had been preoccupied. \nTim tugged the covers back over the other boy’s shoulders and brushed a thumb across his cheekbone fondly. It had been a week since they’d last seen each other. \nA long,  exhausting week. \nTim had been busy and Kon had been off-world and while weeks without each other weren’t infrequent - a week wasn’t even long in comparison to the months they’d done before - it still sucked. \nIt didn’t help that whenever he complained about it to Kon he’d hear some teasing drivel about how absence makes the heart grow fonder. Tim rolled his stiff neck and rubbed at his bruising wrists. \nApparently, it also made the heart grow more aggressive.\nKon made a sound, low and sleepy, and his eyes cracked open. Tim gave him a small smile. \n‘Go back to sleep. I’m just going to the bathroom,’ he whispered.\n‘Hurry up,’ Kon murmured thickly, eyelids already drooping again, ‘I miss you.’\nTim rounded the bed and pulled a t-shirt over his head. \n‘Absence makes the heart grow fonder,’ he hummed in response.\nHe fumbled for his phone, grimacing when his hand brushed against last night’s takeout containers. \n‘Smartass,’ Kon grumbled.\nTim bit his lip to keep from smiling. He waited for the other boy’s breathing to even out again before slipping out of the room and down the hallway. \nThe bathroom door was locked and light glowed from under it. Tim slumped against the wall with a sigh. \nA not small part of him really hoped that it was Jon in there. The kid could hardly walk straight when he was tired let alone string a sentence together. Tim wasn’t awake enough to attempt awkward small talk.\nHe flipped his phone in his hand and turned it on, squinting at the too-bright screen. \n3:34 am.\nHe could probably catch a couple more hours of sleep before heading back to the Manor, sneaking in his bedroom window, and concealing all evidence that he’d ever left, in time for breakfast.\nThe toilet flushed and water splashed in the sink. Tim turned off his phone and tried not to shiver. His skin was starting to prickle and he was getting increasingly eager to return to Kon and his overwhelming warmth. \nThere was a grating sound as the lock twisted and Tim pushed away from the wall. He swallowed, putting on his best apologetic smile for whatever half-asleep Kent he was about to awkwardly pass by. \nThe door creaked open and the bathroom’s brightness filtered into the hallway and-\nTim’s jaw fell slack.\n‘Drake?’ The voice wavered uncharacteristically, unsteady with shock.\nTim felt like he was choking. His throat was tight. He couldn’t swallow. \n‘Damian?’ He managed. \nDamian was…  here. At Kent farm. Dressed in the too-big Batman pajamas that Dick had bought him last Christmas as a joke. And- And Tim was wearing Kon’s t-shirt and his hair was messy and his lips were swollen and-\n‘What are you doing here?’ Damian’s hands clenched into nervous fists at his sides, ‘did Father send you?’\nTim spluttered.\n‘I- What- I- Me- Why would Bruce- What are you doing here?’ he settled on.\nSomething in his response seemed to soothe Damian because the younger boy untensed slightly. \n‘I’m here for a sleepover with Jon.’ \n Of course.  The brat had literally one friend and oh-  that was probably where Bruce had disappeared to yesterday afternoon. Dropping Damian off for his sleepover at the farm. How had Tim been so stupid?\n‘Me- Me too. I- had a case. It ran late. You know what I’m like,’ he forced a laugh but it was weak and breathy.\nDamian just nodded, eyes wide, expression the picture of bewildered. \nStill, Tim didn’t have a chance to feel surprised at his easy acquiescence because the younger boy sidestepped him and padded down the long corridor.\nIt took a moment for Tim’s brain to reconnect with his body and his movements were jerky as he walked into the bathroom and locked the door with a click. His feet hardly carried him and he collapsed on the toilet seat, blood pounding in his ears dizzyingly. \nThe shock was morphing into something more horrified, reaching his stomach and making it roll. \nThey hadn’t decided to keep their relationship a secret on purpose. Kon’s family knew. A couple of the Titans knew. Hell, a bunch of barely-even-acquaintances knew. \nBut it had become an unspoken agreement that the Bats weren’t going to find out. Not until Tim was ready to tell them. \nWhen he was ready - when he could think about doing it without hearing Jack and Janet’s voices in his head - he was going to sit everyone down and- \nThe thought made him shudder. \nHe wasn’t ready. \nHe took a deep, stuttering breath in an attempt to calm himself. Perhaps Damian would believe the lie. It was late. They were both tired. \nHe stood up and stepped towards the mirror, twisting his hands together to keep from shaking. Perhaps the worst he was going to get was a reprimand for working too late and sneaking out when he was supposed to be sleeping. \nHe traced the lovebites on his neck with a trembling finger. \nSomehow, he didn’t think that was likely.  \nHe ran the water cold in the sink and splashed it over his face. He needed to calm down or his surging heartbeat was going to wake Kon and-\n\n You can’t control your heart, Tim. \n\nHe inhaled deeply and pushed the thoughts to the side.  No, he couldn’t control his heart but he could think about other things. \nLike how he had to return that blue sweater to Dick. And how he really needed to clean his room because he couldn’t find his favorite camera lens anywhere. And how he might as well have just come out to his little brother.\nHe swallowed and unlocked the door with shaking fingers.  \nPerhaps not thinking about it was a futile effort. \nHis legs were stiff as he returned to the bedroom and he held his breath to keep from gasping.  He could lie.  He shut the bedroom door carefully.  He was good at lying.  He sat on the bed and hugged his knees into his chest.  He could put on a face and act- \n‘Tim?’ Kon’s voice was thick with sleep.\nHe swallowed the lump in his throat and steeled himself. \n‘I’m fine. Go back to sleep.’\nAs if to prove his point he reached out to drift a trembling hand through the other boy’s hair. Kon melted beneath the touch. \nHe couldn’t say that he hadn’t expected one of them to find out at some point. But it had been months and there hadn’t been any questions, or suspicious glances, or anything. It had all lured him into a false sense of security and now he’d relaxed so much that he’d let-\nA hand clasped his wrist, stilling his movements, and Kon sat up. Eyes narrowed, calculating and wide awake. \n‘I’m fine,’ he managed, breathless, ‘I’m-\n‘Babe. Don’t lie to me. I can literally hear your heart racing. And I can figuratively hear you thinking too hard. What hap-’\n‘Damian,’ Tim replied hoarsely, ‘Damian is here.’\n‘Yeah,’ Kon said slowly, ‘so?’\nAnnoyance flickered in Tim’s chest.  Super hearing.  \n‘You couldn’t have warned me?’\n‘Well, he’s here half the time so,’ Kon rubbed the back of his neck awkwardly, ‘you want me to preface all of our meetings with that? I feel like it would sort of ruin the mood.’\nTim knew he was joking, trying to lighten the mood. Something about it made Tim feel worse. A whine escaped him. It was high-pitched and broken, somewhere between frustrated and scared.\n‘He saw me, Kon,’ the words came out pleading, ‘I-  Damian saw me. Looking like  this .’\nHe pulled his collar down for emphasis and Kon swallowed. The small action felt like the final nail in the coffin. \nHis eyes grew warm and he yanked the collar back up, clutching it tightly against his jaw. As if hiding would change what Damian had seen. \nHe opened his mouth to speak but the words wouldn’t come. His eyes were watery and his throat hurt -\n‘No. None of that.’ Kon’s voice was soft but firm and his hands came up to untangle Tim’s grip on the t-shirt. \n‘Do you remember the other day?’ he rubbed soothingly across Tim’s knuckles, ‘when you told me that you almost came out to Jason? Maybe.  Maybe.  This isn’t all bad.’\n‘But I didn’t. I didn’t. Because I wasn’t ready. I’m not ready. And the brat won’t go to  Jason. He’ll go to Bruce or Dick or  both.’\n‘Babe, I know this isn’t the point. And all of this is still horrible for you. But it doesn’t change the fact that they’re not gonna care-’\n‘I know,’ Tim whispered, ‘I know it’ll be okay. I know they’re not like my parents. I still- I can’t help but-  You know.’ \nKon’s hand came up to cup Tim’s cheek, brushing away tears that he didn’t even realize had fallen. \n‘I know. I’m sorry. I should’ve said something. I didn’t-’\nTim shook his head miserably. \n‘Doesn’t matter. It’s done now. We’ll have to deal with it,’ he slumped against the other boy’s shoulder with a resigned huff, ‘I’m surprised we managed to hide it this long if I’m being honest.’\nA hand wrapped tightly around Tim’s shoulders and a chin pressed into his hair. There was an amused hum.\n‘I think they already know. They probably just ignore us out of respect.’\nTim scrubbed at his cheeks and snorted wetly. \n ‘Respect?  Have you met my family?’ he felt Kon chuckle and his own lips quirked upwards at the sound. \nThere was a moment of stillness and the lump in his throat pulsed. His smile morphed into something sour.\n‘There’s no way to get out of this, is there?’ he asked quietly. \nAfter a couple of long seconds, he felt Kon shrug.\n‘Memory wipe? Drugs? A hard hit to the head?’ \nThe burst of laughter that escaped his lips took him by surprise and he felt some of the tension in his shoulders ease. \n‘You could always just lie,’ Kon continued, ‘straight-up deny it. Say that you have no idea what he’s talking about.’ \nTim smiled fondly and rolled his eyes.\n‘I’m not gonna gaslight my little brother, Kon.’\n‘Gaslight is a  strong word-’ Tim cut him off with a playful shove to the torso. \n‘I’m  not  gonna gaslight my little brother.’\nDespite the conviction he’d said it with, Tim found himself reconsidering that decision as he headed down the Manor stairs a couple of hours later. He’d donned a red hoodie - large enough to cover his neck - and sweatpants, and he looked about the same as he always did in the morning. \nMaybe the bags beneath his eyes were a little darker and maybe his skin was a little pale but he could blame it on a bad night’s sleep. There was no reason for anyone to presume that he’d spent the night anywhere but in his bedroom. \nNot that any of that would matter once Damian returned home. \nTim hesitated in the kitchen doorway. \nBruce was sat at the end of the table, glasses perched on the end of his nose, phone clutched in his hand as if he was reading something on it; it didn’t do anything to convince Tim that the man wasn’t still half asleep. His eyes were barely slits and the apples of his cheeks were uncharacteristically rosy. \nThe famed world’s greatest detective was a zombie in the morning. The only person that Tim had to fool was Alfred. That wasn’t too hard, Tim was good at not drawing attention to himself.\nAlthough, he had a sneaking suspicion that Alfred knew and just hadn’t said anything.\nHis eyes drifted to the place set for him at the table and the place set for Damian opposite-\nHis heart stuttered. \n For Damian?  Damian was already back-\n‘Good Morning, Master Tim. Coffee is on the table. Pancakes?’ \nIt took a moment for him to remember how to put one foot in front of the other but he managed to move stiffly to the table and take a seat. He nodded jerkily.\nAs if on autopilot he reached out to pour himself some coffee, thanking Alfred for the pancakes with a smile as his eyes bored into Damian’s place setting like it was an insult. \n‘Is Damian here then?’ his voice came out steadier than he felt and he sipped at his too-hot, burning, tongue-on-fire-fuck  coffee. He put the cup down with a splutter. \n‘Careful,’ Alfred reprimanded, ‘it’s hot.’\n‘I know that now.’ \n‘I apologize, Master Tim. I assumed that the steam might’ve clued you in.’\nBruce looked up. \n‘Why wouldn’t he be?’ he replied. \nTim looked at him bewildered.\n‘He is up a little late, I suppose,’ Bruce conceded with a shrug.  \nTim schooled his expression into something carefully blank. He stirred his coffee absently. \n‘Where were you yesterday?’\n‘I had a meeting. It ran over,’ Bruce’s voice dropped to a grumble, ‘because no one cares about my time or my plans.’\nAlfred set a plate of toast in front of the man. \n‘It’s such a hard life isn’t it, Master Bruce?’\nBruce looked down like a chastised toddler. \n‘Sorry, Alfred. I-’\nTim didn’t hear the rest of what he said over the pounding in his ears. Bruce hadn’t dropped Damian off at the farm.  Bruce thought that Damian was still upstairs-\n‘Good morning, Master Damian.’\nTim swallowed the painful lump in his throat. \nHis eyes followed the younger boy as he sat down at the table. He was dressed casually. In a t-shirt and jeans. No evidence that Tim had ever seen him wearing those hideous pajamas. No evidence that he’d spent the night anywhere but sleeping in his bed. \nAlfred set a plate of pancakes in front of him and Tim watched as Damian drizzled a sickening amount of syrup on top of them. He couldn’t help but wonder if the kid’s time with Dick had been a death sentence for his teeth. \nDamian opened his mouth to speak and Tim’s throat tightened, his stomach rolled and his eyes squeezed shut of their own accord. \n‘Thank you, Pennyworth. Father, you look especially old today. Drake, would you like the syrup?’\nTim’s eyes snapped open. He heard Bruce mutter something about his delightful son but it didn’t register. He just stared at Damian, dumbstruck and-\nDamian met his gaze unblinkingly, expression impassive. \nThey looked at each other for a moment, frozen.\nAnd then Tim gave a rough nod and Damian handed over the syrup.\nTim looked down at his pancakes, shoveling them into his mouth and swallowing his confusion and doubt and hope.\nHe didn’t look up again for the rest of breakfast.\nThis was not a bribe. \nHe’d been in the kitchen and he’d had nothing better to do so he’d decided to do something nice for his little brother.\nIt was not a bribe. \nIt was not a bribe.\n Say it one more time and you might actually believe it,  a voice in the back of his mind sneered. He frowned.\nHe stood outside of Damian’s bedroom door, rocking on the balls of his feet, one hand holding a cup of tea with fresh lemon and brown sugar - more of an incentive than a bribe - and the other hovering in mid-air inches away from the door. \nHe worried his lip between his teeth. \nWaiting any longer would just make him feel worse. This way he was ripping off the band-aid, biting the bullet, facing the-\nHe knocked. \nThere was a second of silence and Tim’s heart rate surged. His breath quickened. His skin prickled. And then. \n‘Yes?’\nTim tensed to keep his hands steady as he opened the door and took a wary step forward. \nHe could count the number of times he’d been into Damian’s room on one hand. The majority of those had been when the kid had first arrived. Before the various murder attempts, cutting remarks, and the general hostility.\nOf course, that hostility had since developed into a fragile respect (forced - begrudgingly - by multiple disapproving looks, a handful of scoldings, and a not small amount of time spent benched from patrol, for both of them) that hinged on staying out of the other’s way. Funnily enough, that included staying out of each other’s rooms. \nIt looked nicer now. More lived in. There were blankets on the bed. Art on the walls. Papers scattered on the desk. Decorative cushions on the chair that Dick definitely gifted to him because they were really fucking ugly and Damian was a lot of things but he didn’t have bad taste.\n‘I assume you are here for a reason?’ Damian looked strangely soft. He was sat cross-legged in his desk chair, pencil clutched tightly between his fingers, sweater sleeves falling over his hands.\n‘What’s going on? Damian, who-  oh,  hi Tim!’ \nTim blinked. \n‘Hi Jon,’ he stuttered, raising his hand slightly in greeting. Jon waved back brightly, hand blurring with the motion. \nDamian snapped the laptop shut, effectively cutting off the video call. Tim just stared bewildered. Damian’s ears were tinged red and his nose was wrinkled and his sweater-  was that Jon’s? \n‘A reason, Drake?’ he ordered tersely. \nTim shook his head as if to clear it. \n‘Right,’ he swallowed and raised the cup, ‘tea?’\nDamian took the offering with narrowed eyes. \n‘Is this your attempt to rid yourself of me, Drake? Poison feels a little demeaning. Do you really think I’m that-’\n‘It’s not poisoned,’ Tim sighed, exasperated. The words came out steady but his stomach flipped and his heart stuttered in his chest. \nDamian took a sip and his face twisted. \n‘I wish it was. This is horrible. You cannot make tea, Drake.’ \nDamian set the cup down, glaring at it in distaste. If Tim had been less jittery he might’ve rolled his eyes. He reached out to finger one of the sheets of paper on the bed. Anything to keep his hands from trembling. \n‘Math homework, huh? You two do that together?’\n‘If you do not tell me what you want I will tell Pennyworth that you tried to poison me.’\n\n ‘I didn’t.’ \n\n‘He will taste  that  and disagree.’\nTim took a shaky breath and walked stiffly toward the door. He shut it with both hands, keeping his back turned and allowing his forehead to rest against the wood. The lump in his throat had returned and it was painful.  He opened his mouth to speak but the words felt trapped and his hands clenched into frustrated fists. \n\n Come on, Tim. Get it together.   \n\nHis next breath came out strangled, a mixture between a word and a gasp and-\n‘I do not believe there is anything we need to discuss,’ Damian’s voice was firm but there was a softness in it that took Tim by surprise, ‘where you spend your nights is none of my business. Where I spend mine is none of yours. Father needn’t know.’\nTim gaped. \nHe spun around, jaw set, eyebrows pinched, shocked protests on the tip of his tongue. Why would Damian do that? Did he understand what was going on? Did he even know what he’d seen? \n‘Next time you leave Kent’s room in the middle of the night - or ever,  in fact - please wear more. I did not think the sight of you could get more disgusting but-’ Damian shuddered and his face scrunched up and-\nTim barked a perplexed laugh. It was strangled and strained and he hardly recognized it as his own. \n‘I take it that you agree with me then? Father needn’t know?’\nTim’s brain was yelling at him. Telling him that Damian had an advantage over him now. The younger boy could hold this over his head and force him out of his place and Tim would go  willingly  because he was scared -\nTim nodded dumbly. \nDamian might use it against him later. But later was better than now and Tim would take what he could get.  \n‘You can leave now,’ Damian said simply. He turned back to the desk, fingers itching to reopen the laptop. ‘Take  that  with you.’\nTim gave an amused huff and took a step forward. Something half-suspicious and half-what-he-really-didn’t-want-to-call-fond had settled in his chest.\nHis little brother was bundled up in another boy’s hoodie, hiding the lower half of his face in the collar, tapping a chewed pencil against the desk impatiently. His scowl did nothing to hide his eagerness to return to the video call and something inside of Tim melted a little.\nHe picked up the mug. \n‘You know I’m never gonna make you tea again, right?’ \nDamian’s scowl deepened, ‘please don’t call that tea-’\n‘Fine. I get it,’ Tim rolled his eyes and headed to the door, ‘I’ll stick to coffee.’\nDamian grimaced. \n‘Your taste in beverages is almost as bad as your taste in men.’\nTim froze. It was stupid.  So stupid. He really shouldn’t. The words were out of his mouth before he could stop them. \n‘You’re one to talk.’ \nDamian didn’t say anything. The kid’s ears turned a deeper red and his eyebrows scrunched and he was suddenly very interested in a loose thread in his jeans. \nTim spun around. He shut the door behind him and a smile crept onto his face. He felt light suddenly. Like the weight that had been crushing him for the last ten hours or so had lifted. He could breathe again. \nHe also felt a little warm, a little affectionate, and a little bewildered. There was something jarring about seeing the brat look so adorably embarrassed.\nPerhaps Tim should feel guilty about that but a not-small part of him was fairly certain that it was an older brother’s right to tease their little brothers about crushes and dates and boys. \nSmile growing wider, he turned around and smacked into a chest. The tea jolted, Tim yelped and a hand steadied him. \n‘Do you walk around with your eyes shut? Or does your spatial awareness just really suck?’\n‘Dick?’ Tim squinted up at him, confused, ‘I didn’t know you were coming here.’\nDick shrugged. \n‘Needed some files.’\n‘Oh, well, Bruce isn’t here,’ Tim pointed out. \n‘Right on the money, baby bird,’ Dick rubbed at the nape of his neck sheepishly and Tim groaned. \n‘I’m not here. I didn’t see you. I’m not getting roped into being an accessory to your theft.’\n‘I’m not asking you to,’ Dick retorted, indignant, ‘I already have everything that I need. I just wanted to come and check in on my little brothers,’ Dick’s eyes narrowed and he took a step backward, ‘what were you doing in Damian’s room?’\nTim rolled his eyes at the obvious skepticism. \n‘I made him tea.’\nDick hummed, ‘you still have it.’\n‘I made it wrong,’ Tim shrugged and gestured with the mug, ‘tea?’\nDick took the mug, eyes still scanning over him in suspicion. \n‘So if I go in there-’\n‘Damian is fine. He’s busy though,’ Tim almost groaned at how guilty that sounded. Still, he was feeling fond and Damian had been so eager to return to his call and Dick could be relentless sometimes.\nDick leaned back and sipped the tea, face the picture of doubt. His expression twisted. \n‘This tastes like shit, Tim. What did you do to it?’\n‘It’s exactly how Damian likes it,’ he complained, exasperated.\nDick snorted, ‘I can tell you for a fact that Damian does not like-’\n‘Can you please continue your conversation somewhere that is not right outside of my room,’ Damian’s voice drifted through the door, snappish and annoyed. \n‘Hi, Dami,’ Dick replied sweetly. \n‘Goodbye, Richard.’ \n ‘Ouch,’  Tim laughed and Dick stuck his tongue out childishly. \n‘Hold on. While you’re here,’ Tim headed for his bedroom and Dick followed, ‘I still have your sweater.’\nThe older boy leaned against the doorframe and Tim could feel eyes following him as he rummaged around his room. Dick wouldn’t comment on the mess. He was just as bad.\n‘I’d say that you can keep it but I’m pretty sure I’ve given you half my clothes at this point,’ Dick chuckled, stirring the tea absently, ‘plus I like that sweat-’\n‘Found it,’ Tim yelled, holding up the blue clothing with a triumphant grin. \n‘I’m actually impressed,’ Dick smirked and sipped at his-\n‘Fuck,’ he spluttered, ‘take this away from me,’ he put the mug down wiping at his mouth dramatically, ‘Jesus wept.’\nTim rolled his eyes. \n‘I’ll have you know that some people like my tea,’ he lied, turning around to pull his bed cover across absentmindedly.\n‘If you’re gonna lie-’ Dick stopped abruptly, voice dropping to a barely-there whisper,  ‘what’s that?’ \nTim’s heart jumped in alarm and he turned-\nSomething slammed into his back. A hand twisted his shoulder. Arms flipped him. He fell onto the bed with a gasp, eyes wide.\n‘Dick, what the  fuck?’\nDick’s knees came to straddle his chest, digging into his shoulders, pinning his arms to the mattress. His eyes were barely slits and his lips were turned up in a malicious smile. Tim struggled against the hold to no avail.\n‘Dick, what the  hell  are you do-’\nA hand tugged lightly at his collar and Tim froze. His cheeks grew hot and he let his eyes flutter shut with a resigned sigh. \nDick pulled the sweater down, slowly,  torturously. \nTim opened his eyes, intending to glare but he couldn’t do anything but gulp when he met the older boy’s gaze. His blue eyes glinted with something wicked and Tim melted into the bed.  If he buried himself in the sheets how long would it take for him to suffocate? \n‘Do you want to tell me-’\n‘Fuck you,’ Tim managed.\n‘-what kind of vampire-’\n‘Seriously, fuck you to hell.’\n‘-has been trying to drain-’\n‘Please  don’t phrase it like that.’\n‘-my little brother?’\nThere was a moment of silence and Tim scowled. \n‘I hate you, Dick. Do you know that? I really hate you.’ \nDick’s lips stretched into a full-blown grin and Tim wanted to smack it right off his face. As if Dick could read his mind, the grin grew wider and the knees dug further into his arms. Not enough to hurt but enough to remind him that he couldn’t move. \nTim snarled. \n‘No, you don’t. It’s a brother’s right to-’\n‘Well, perhaps I should’ve exercised my right to point out those hand marks I saw around your neck a couple of weeks ago,’ Tim hissed and Dick’s grin faltered. \n‘I told you. I was attacked on patrol-’\n‘Nightwing didn’t patrol that weekend.’\n‘So, what? You’re stalking me now? How do you know that?’\n‘I didn’t but I do now,’ satisfaction curled in Tim’s stomach and Dick chuckled.\n‘Touché.’ \nThere was a second of stillness and then the weight was gone. It took a moment for Tim to reorient himself, head still spinning from the tackle, and he watched as Dick jumped up and slung the sweater over his shoulder. \n‘Movies?’ \n‘With you?’ Tim drawled, eyebrows raised, ‘no way.’\n‘Fine. Pizza? Burger? Whatever you want,’ he headed for the door, ‘let’s go.’\nTim watched him disappear and threw his head back with a groan. \n‘You can take me wherever you like but I’m  not  telling you, Dick.’\n‘I’ll meet you in the car!’ Dick called, voice sweet. \nTim heard the front door slam and he shook his head with a small smile before dragging himself to his feet, grabbing his house keys, and following.  \nHe purposely left his wallet on the nightstand. \nDick owed him. \n‘You.’ Kon’s hand traced the muscles in Tim’s back before digging tightly into his hip bone. Each thrust was sharp and rough and Tim clutched at the headboard as it smacked against the wall. Kon was so deep inside of him, hips slamming against his ass, just painful enough to make Tim whine, dizzy with pleasure.\n‘You,’ Kon repeated, voice so rough with want that Tim shuddered, ‘like this?’\nTim’s lips parted and he turned to look over his shoulder with half-lidded eyes. Kon’s expression was dark, gone with lust, lower lip caught harshly between his teeth and Tim moaned.\n‘Yeah. God,  yeah.’\nKon fucked into him harder, deeper, fingertips digging in tighter, and Tim barely had time to breathe before he was yanked back again and again. Pleasure was building inside of him and he wasn’t going to last much longer. Every drag of Kon’s cock made his back arch, heat cascading across his abdomen, his chest, his neck. \nKon shifted forward. His chest pressed firmly against Tim’s back and Tim’s body sung in response to the closeness. He pushed backward, meeting the other boy’s thrusts halfway and gasping at the feel of breath, hot and heavy, against his ear. \n‘Good,’ Kon moaned, ‘so good.’ \nHe pulled back and Tim didn’t have time to protest the movement as a large hand splayed out between his shoulder blades and pushed.\nHis hands fell from the headboard and he cried out as he crashed into the mattress face first.\nThe only thing holding him up was Kon’s unforgiving grip on his hips and it was all he could do to twist his hands in the sheets and bury his face to keep from yelling. \nEvery thrust hit that spot that made Tim see stars, pleasure rising so high that he struggled to think.\n‘No,’ Kon snarled.\nA hand twisted in the hair at the nape of his neck and yanked. Tim moaned, body clenching reflexively.\n‘Fuck,’ Kon used his grip to turn Tim’s head to the side, ‘don’t hide,’ Tim’s mouth parted and he gasped with every snap of Kon’s hips, ‘wanna-  fuck, babe-  wanna hear you.’\nKon’s hands returned to his hips and he slammed into him harder, more forcefully. Tim’s eyes squeezed shut, heat building and building and he whimpered.\n‘Please,’ he wasn’t sure what he was begging for but the word fell from his lips over and over, breathy and desperate. \n‘So good- So-  Fuck-  I-’ Kon moaned behind him. \nTim wet his lips, feeling his muscles contract instinctively. He knew that Kon was close and he wanted,  needed,  more of that unintelligible, jumbled-up praise that poured from his lips. \n\n ‘Please.’  \n\nThe word came out a strangled keen and Kon babbled reassurances, hammering into him brutally, rhythm lost to something erratic and desperate. Tim felt the other boy twitch inside of him, hips churning, fucking him deeper. His words were nonsensical, dripping with pure need and it made Tim burn hot.\nHis whole body tightened, hands twisting in the sheets. Every thrust felt so good, and there was nothing else but want and pleading because he needed more, something, anything. \nKon leaned forward, chest pressing against him, hands bruising him, teeth biting down hard on his shoulder and that was it. \nWhite-hot pleasure surged through Tim, pressure releasing, eyes squeezing shut, and he fell off the edge with a wordless shout. He heard Kon cry out behind him, chanting his name like a litany, but it was distant, washed out by pulsing, flowing, mind-shattering relief.\nHis orgasm rolled over him in waves, long and consuming and so,  so good. When he came to, the haze receding slightly, he was gasping. \nKon slumped heavily against his back. Tim could feel the other boy’s forehead resting against his shoulder blade, warm breath fanning across his skin, heart pounding in time with his own. \nHe relished in the closeness. Enjoying the feel of the infuriatingly perfect boy pressing against him, even if it was cutting off his air supply. He could deal with a little suffocation if it felt like this.\nKon shifted and Tim made a sound of protest, hands darting out to lace with the ones on either side of his head. He’d waited over a fortnight for the other boy to return and the thought of letting him go was torturous. He’d rather be crushed. \nFull lips brushed against his skin sweetly and Tim sighed, contented, and more at ease than he’d been in so long.\nKon chuckled.\n‘I’m gonna squish you.’\n‘Good,’ Tim replied, stubbornly. \nKon huffed a laugh, peppering gentle kisses across his neck and up to his ear and Tim hummed.\nHe could hear birds outside, feel the warm afternoon sun breaking through the gap in the curtains, smell the aroma of something rich and homemade put on to slow cook hours and hours ago.\nKon broke away, pulling out and pushing to his feet. Tim groaned.\nHe collapsed fully onto his stomach and folded his arms beneath his head. Pouting, he turned to watch the other boy as he tied the condom and tossed it into the trash. \n‘You don’t care about me.’\nKon laughed brightly.\n‘Ah, yes. The epitome of cruelty. Not crushing your boyfriend to death.’\n‘Yeah. Well,’ his voice was a petulant grumble and he reached out for one of the pizza boxes balanced on the nightstand, ‘I asked nicely.’\nTim picked up a slice of pizza. It was cold and a little tough from hours sat out but that didn’t stop Tim from moaning when the cheese oozed and stretched from between his teeth.  \nHe gazed at Kon’s back, not-so-subtly appreciating the way that his muscles tensed with every slight movement, and chewed loudly.\n‘You know, Jon and Damian have been gone for a while. How long do people normally walk dogs for?’\n‘Seriously?’ Kon turned, ‘that’s  what you’re thinking about right now?’ He met Tim’s eyes and his lips stretched into an arrogant grin. He winked. ‘Enjoying the view?’\nTim resisted the urge to throw the pizza at him and Kon eyed it, nose wrinkling. \n‘What? It tastes good and it hasn’t been out for that  long.’\n‘You’re disgusting.’ \nTim hummed, tongue darting out to lick at the sauce on his lips. He felt a curl of satisfaction when Kon’s eyes followed the movement. Disgusting.  He almost scoffed.\n‘Have some.’ \nIt was an empty offer and Tim couldn’t say he wasn’t surprised when Kon knelt down at the side of the bed, cocky smile still tugging at his mouth, and took the slice between his teeth.\nTim’s eyes glazed over as he watched, transfixed by Kon’s darkening gaze, it was heated and heavy and wholly appreciative. Soft lips brushed against his fingertips and Tim’s teeth found the cushion of his lip, unbidden-\nHis eyes narrowed. He wasn’t stupid. He knew when Kon was trying to distract him. But what-\nHe threw his head back with a groan. \n‘When did they get back?’ \nKon rubbed the back of his neck sheepishly. \n‘Like, five minutes ago,’ Tim’s mouth parted in disbelief. ‘Don’t worry. He didn’t hear anything. They got to the gate and Jon took him on a detour.’\n‘That doesn’t make it any better.’\n‘Oh,’ realization dawned on Kon’s face, ‘you’re worried about Jon? Don’t be. He’s heard worse. There are literally no secrets here.’ \n‘That’s not the point-’\nKon interrupted him, voice lilting with amusement, ‘don’t pretend that this wasn’t exactly what you wanted. Why else would you have called me like that?’ \n‘I  said  I needed a break.’\n‘A break, huh?’ his voice strained with barely suppressed laughter, ‘is that code now? As if you didn’t know how I was gonna take that after two weeks apart.’\nTim blushed furiously and hid his face in the covers. Suffocation was looking better by the minute.\nThere was nothing worse than being around a smug, arrogant, post-sex Superboy except... maybe... not being around him.\n‘I hate you,’ it came out muffled and Kon chuckled. \nFingertips swept through the hair at the nape of his neck and lips brushed his ear, making him shiver. \n‘You look good like this,’ Kon murmured lowly, tongue darting out to taste his skin.\nTim’s thoughts swam - drunk on the other boy’s closeness - and he pushed backward, lifting his head and exposing his neck further. He couldn’t help it, he could feel the heat radiating from Kon’s skin and it drew him closer like a moth to a flame.\nTeeth grazed over his pulse point and Tim made a soft, wanting sound. It was involuntary and embarrassing but he couldn’t find it within himself to care. Blissfully lost in the feeling of lips on his neck.\nThere was an appreciative hum and then Kon stood up and Tim whined in wide, bleary-eyed protest. \n‘You were chastising me?’ Kon prompted, barely hiding a laugh.\nTim swallowed and tried to reorient himself - it really wasn’t fair. No one should have that kind of debilitating effect on him. He was a  vigilante for fuck’s sake - before glaring hotly. \n‘I can’t believe your entire family knows what I like in bed.’\n‘Not my entire fami-’ Tim threw a pillow at his chest and he chuckled.\n‘Stop worrying. Everyone minds their business because no one wants their secrets aired out. Jon won’t say anything. Plus-’ Kon looked thoughtful, ‘I have a fair amount of embarrassing blackmail on him if he does.’ \nThat perked Tim’s interest and he sat up on his elbows.\n‘Pray tell?’\n‘Hypocrite.’ \n‘No. I’m just worried about the well-being of my little brother. Presuming this blackmail has something to do with Damian.’\nKon just shrugged and Tim sat up fully, eyes narrowed. His mimicry concern was beginning to feel a lot less fake. \n‘Wait,’ his voice was hushed, ‘they’re not- nothing,  inappropriate, right?’\nTim suddenly felt a little out of his depth. He wasn’t equipped to give Damian any kind of sex talk. Hell, he wasn’t equipped to talk to Damian about the weather, let alone-\nKon burst into surprised laughter. \n‘Tim, they’re children-’ \n‘They’re  teenagers -’ \n‘-It’s just a crush.’\n‘A  reciprocated  crush.’ \nTim wasn’t trying to be difficult. Really, he wasn’t. He just felt a little protective, and a little defensive, and maybe a little annoyed that Kon wasn’t taking him seriously. His little brother wasn’t old enough to be- He grimaced. He didn’t want to think about it.\n‘Babe, they blush when they  look  at each other-’\n‘I  blush when you look at me,’ Tim protested, indignant. Kon’s lips twitched and-\nTim threw another pillow at him. \n‘Shut up.’\n‘I didn’t say anything.’ \nHe was smirking down at Tim, expression soft, eyes adoring, and Tim’s hands flew up to cover his face. To his horror, his cheeks were warm beneath his palms. \n‘You know what you’re doing.’ \n‘Cute,’ Kon murmured, almost to himself, before continuing, ‘Normal teenagers don’t talk about their feelings. You really think that Damian - son of  Batman  - is gonna be the one to break the mold?’ \nThat- That was actually a good point. \n‘Anyway,’ Kon spoke before he could think of a rebuttal, ‘no more talking about blackmail or Jon’s tiny heart is gonna give out. It’s beating a mile a minute and he’s not even done anything wrong.’ \nTim’s face softened and he nodded in agreement. He hadn’t meant to panic the kid. Jon didn’t deserve any kind of distress. And yet, he’d actively chosen to crush on Damian. Tim almost snorted.  Everyone was a masochist. \n‘Sure. I was just interested in how many more  important  secrets about  my  family you were keeping from me.’\n‘Hey. Firstly, they’re not my secrets to tell. And secondly, it’s only fair. I didn't tell you about those two. Jon didn't tell Damian about us,’ Kon snickered, ‘you did that one all on your own.’\nTim swallowed and let his head slump forward. It still made his heart stutter to think that someone else knew. More so that it was  Damian. \nFor the last few weeks, he’d been walking on eggshells around the younger boy. Giving him space, being courteous, not encroaching on his privacy. Anything to keep him from running straight to Bruce. Although - his face scrunched - perhaps that had been a mistake.\n‘Clothes. Now. Get dressed,’ he ordered, sitting up and frowning at the stickiness coating his torso. ‘Pass me those.’ \n‘What’s with the sudden urgency?’ Kon tossed him the pack of wet wipes along with a t-shirt. \n‘We’re going to check,’ Tim wiped himself down before tugging on the t-shirt, ‘on them,’ he clarified. \nKon sighed exasperated, but he started pulling on his clothes anyway.\n‘What exactly are we going to check? I told you that they’re not doing anything inappropriate. I’d know.’\n‘Well, forgive me, but letting you decide what is and isn’t inappropriate doesn’t really put me at ease-  Don’t look at me like that. I love you, but today is a case in point. You have no ground to stand on.’\n‘Fine,’ Kon conceded with a shake of his head, ‘we’ll go and  check on  two best friends-’\n‘We were best friends-’\n‘- and their cute, adorable, unvoiced crushes,’ Kon paused pulling on his jeans to fix him a look, ‘best friends don’t fuck.’\n‘I meant before,  asshole. And that just proves my point.’ \n‘Did you never have a crush as a kid?’\n‘Of course, I did-’\n‘Really? Who was your first crush? How old were you?’ Kon sounded fascinated,  eager, and who was Tim to deny him? He wondered briefly if the power the other boy had over him was truly dangerous. If it would be his downfall. \n‘I don’t know. Second grade?’ Tim finished pulling on his socks and stood up, ‘she was some annoying, pretentious, self-important 7 year old that I couldn’t stop thinking about for some reason,’ Tim looked up at Kon and brushed a hand across his jaw. \n‘Clearly my tastes haven't changed at all.’\nKon snorted, flexing his muscles somewhat. \n‘I’d argue that they’ve changed a little.’ \n‘A little,’ Tim conceded with a smile before returning to the matter at hand, ‘crushes are meaningless. This is more than that for them. Damian doesn’t  do  meaningless.’\nDamian didn’t even coo nonsense at his pets. Everything was important. It was as endearing as it was difficult.  \n‘Okay. So crush might be the wrong word,’ Kon snapped playfully at his fingers as they brushed his lips and Tim glared until he yielded and let him trace his features unhindered, ‘but it’s still unspoken whatever it is and I’m willing to bet good money that it’ll stay that way until they’re well over the age of needing to be  monitored  for  inappropriateness.’\n‘He’s my little brother he’ll never be old enough to-  oh my god,’ his eyes grew wide, ‘does this mean I’m gonna have to shovel talk Jon?’\nKon stepped around Tim and shrugged into his jacket with a laugh. \n‘Damian beat you to the punch on that one.’\nTim’s jaw fell slack. \nHis brain stuttered over the words- Damian what? \nDamian threatened- for him-  \n‘What did he say?’ he demanded breathlessly. \n‘What didn’t he say? He can be terrifying when he wants to be.’\n‘Yeah. All the time,’ Tim agreed absently, ‘I want a list. Of everything that he said.’\nKon fixed him a look that translated to a distinct and disapproving no - he’d seen it on Alfred’s face enough times - and his heart dropped. He’d do anything. He wasn’t above begging.\n‘Please,  baby. I promise-’ A loud clatter from downstairs interrupted his whining and-\n‘Well, now seems as good a time as any to check on them.’ \n‘Uh-huh.’\nTim near-sprinted towards the kitchen, ducking into an alcove beside the door and yanking Kon behind him. He wasn’t stupid enough to be upfront with Damian. If this whole fiasco had taught him anything it was that the boy was an unparalleled liar.\n‘What happened to not invading the kid’s privacy?’ Kon whispered, eyebrows raised. \nTim just raised a finger to his lips and turned his attention to the pair in the kitchen. The sound had clearly been something inconsequential because the two seemed unfazed. \nThey lounged on stools at the breakfast island. Damian’s feet swung idly and he scowled at the fruit bowl. Next to him, Jon’s eyes were wide and his lips formed a pout.\n‘Jon knows we’re he-’\nTim cut him off with a glare, pressing a finger to his lips more emphatically. \nKon made a face - sticking his tongue out and mouthing defeats the point  - but he did as he was told, leaning against the exposed brick wall and pulling out his phone. \nTim turned back to his little brother. Straining to catch the conversation. \n‘Please,  D. Help me complete  one  level of overcooked and then we can play-’\n‘Am I supposed to believe that you won’t start shouting aga-’\n‘I won’t,’ Jon promised, leaning forward eagerly, ‘it’s only one level and I promise I’ll listen to you the entire time. I can’t do it on my own.’\nDamian’s scowl deepened. Tim knew that there were very few people that could get the kid to compromise… It seemed he was weak to those with big blue eyes and a near-dangerous mastery of the kicked-puppy-expression. \n‘Of course you can’t. You’re hopeless.’\n‘So you’ll help?’ the teen practically vibrated in place. ‘C’mon, Dami.’ \nJon fluttered his eyelashes and Tim almost snorted. Damian had no chance. In fact, he’d done well to hold up for so long. Tim would’ve caved the moment those blue eyes widened. \nJon reached out, brushing a hesitant fingertip gently along the edge of Damian’s nails. \n‘We can watch more of Kimiuso afterward,’ Jon offered quietly, cheeks a little flushed and eyes suddenly very distracted by the wooden table.\nTim gaped. He wished, not for the first time, that someone else was seeing this with him - someone that wasn’t Kon because, honestly, his disinterest and respectful-boundaries-thing was starting to get on Tim’s nerves. Maybe Jason. Or even Dick - because the brat swayed, actually swayed, dizzy with the featherlight touch.\n‘You have to listen to me the whole time,’ Damian’s demand was weak, voice wavering, ‘and  don’t call me Dami-’\n‘Yes! Definitely,’ Jon jumped up, bouncing on his toes and grinning wide, ‘thanks, D.’ \nHe bounded into the other room and Tim watched Damian slip off the stool and follow him blindly. His ears were tinged red and he looked dazed - heartbreakingly bewildered - in a way that made Tim want to risk a stab wound to hug him.  \nHis eyebrows were furrowed and his lips were turned down as if he couldn’t comprehend how something so simple had prompted such an overjoyed reaction. Like he didn’t know how he had been given the power to make someone else so happy.  \nIt made Tim’s chest ache. \nHe stared after his little brother until he felt hands on his waist and a chin pressing against his head. \n‘I told you so,’ Kon’s lips brushed his hair, ‘they’re just cute.’\n‘Yeah,’ Tim agreed, turning to fit their mouths together gently.\n‘They’re adorable.’\nTim watched Kon move around the living room and tried to ignore the dread coiling in his stomach.\nThe other boy was talking to him animatedly as he prepared blankets, closed curtains, and grabbed snacks but Tim couldn’t concentrate. He nodded along and hummed whenever Kon paused but the words weren’t going in. \nHis mind was preoccupied. Engulfed by his steadily growing horror, his stomach turning panic, his skin prickling unease-\nHe was going to watch a movie with Jon and Damian. They were going to watch a movie with Jon and Damian.\nTim inhaled. It wasn't a big deal. It was going to be fine. It was only a movie. He exhaled.\nIt didn't matter. The mantra did nothing to calm him. Yes, it was just a movie. But still.\nHe knew that Damian was aware of his relationship but there was a difference between knowing and seeing. Tim was certain - anxiously, soul-shatteringly sure - that this would be pushing the limits of Damian’s secrecy. He felt like he was willingly traipsing towards his own slaughter.\nKon looked at him and he nodded jerkily in agreement or whatever, forcing a smile, drumming his fingers against the couch, and tensing to keep his knees from bouncing.\nThankfully, the response seemed to satisfy the other boy as he continued chatting away while adjusting the cushions.\nTim’s brain was whirring, thoughts rushing away from him, frantically running through different scenarios for how the night might go; none of them were good. Nearly all of them involved Damian’s face twisting in disgust and a long, disapproving,  disappointed,  phone call from Bruce.\n‘Babe,’ Kon was in front of him, nose brushing his, expression the picture of concern.\nTim blinked. \n‘I asked if you were okay?’ Kon’s voice was soft and understanding, ‘we can call this o-’\n‘I’m fine,’ Tim forced a smile, ‘it’ll be fun.’\nFingertips tilted his chin and eyes scanned his face wearily. He wasn’t sure whether he wanted Kon to believe him or call him out on the lie. Both outcomes felt like hands around his throat but he supposed that only one of them ruined the evening. He forced his smile wider and relaxed his shoulders, trying to sound genuine. \n‘We should watch a horror movie. Something really terrifying.’ \nKon stared at him for a moment longer, eyebrows raised, face completely unsatisfied and Tim wet his lips nervously. \n‘I mean it,’ he tried to look sincere, ‘I want to do this.’ \nKon’s expression brightened at that. He looked earnest, a wide grin stretching his lips as he jumped up and bounded away to call the two teens downstairs excitedly. And, yeah - Tim swallowed the lump in his throat - he was definitely doing this. He’d suffer through all of the discomfort in the world for Kon to look that happy. \nBesides, he could always move to the farm if Bruce kicked him out of the Manor. Sure, he knew that Kon had a hard time being out in Smallville sometimes but he wasn’t sure that he could face a Gotham where he’d lost two families. \nHe was being ridiculous and his thoughts were spiraling and his heart was beating too fast. All he could think about was the fact that he could lose everything. All because he’d agreed to watch a fucking movie.\n‘What are we watching?’ Jon sounded uncharacteristically snippy and Tim glanced over - movement stiff, palms sweating, face clammy - to see the three of them appear in the doorway. Damian looked skeptical and Jon mimicked his expression. His arms were folded, his nose wrinkled, and his eyebrows raised in a challenge. \n‘Have a look.’\nTim’s eyes lingered on Damian, tracking him as he perched on the edge of the couch. He looked tense, as if he was ready to bolt at the first opportunity. Tim wanted to tell him to do it, wanted to beg him to, it’d be easier that way-\n‘I told Father I would be home this evening.’ \nTim stiffened. He swallowed the lump in his throat.\nKon had coaxed him into calling Bruce earlier. Into telling him that they were going to have a movie night and wouldn’t be home. He told Damian as much and the boy’s face-\n‘Don’t look at me like that,’ he snapped, harsher than he meant to, words panic-fuelled and strained, ‘we’re allowed to see friends, and at least this way we’ll get points for spending time together without murdering one another.’\nDamian tensed further. Shoulders hiking up to his ears. He tutted. \n‘Don’t speak so soon, Drake.’\n‘That’s true,’ Tim replied coolly, voice steadier, crueler, and more  detached  than he felt, ‘the night is still young.’\nDamian’s face twisted and he opened his mouth and Tim craved it. Ached for whatever spiteful words were going to snap from his little brother’s lips. He wanted to belittle, to sneer, to make someone else - to make Damian  - feel the turmoil roiling inside of him. He was practically vibrating, eyes cold, stomach churning, saliva pooling in his mouth.  \nAnd then he watched as Jon leaned in, whispered something that made Damian’s lips quirk upwards, made his muscles untense, made him lounge back on the couch next to Jon with ease. \nA weight settled to the left of him but he didn’t acknowledge it. His anger was dissipating as he watched the two whisper and it left him feeling nauseous. His muscles felt taut. His skin stretched tight. His whole body tingled as if he’d been tased-\nSomething brushed his shoulder and he flinched violently. \nHis head snapped around just in time to see Kon’s hand drop as if he’d been burned.\nThe hurt that flashed across his expression made Tim feel breathless but the careful blankness that followed made him feel worse. Nausea settled at the base of his throat and he stared as Kon picked up the remote, asking for suggestions and bickering with Jon and Damian about what to watch as if nothing had happened. \nTim swallowed and the world tilted. He swallowed again. His heart pounded in his ears. He was going to vomit. He swallowed again, throat convulsing. He wasn’t going to vomit. He couldn’t. He wouldn’t make things worse. If they could get worse because  fuck. \nHe’d just flinched away from Kon. Involuntarily.  Instinctually. He’d even wanted to glare. To snarl at him. To ask him what the hell he thought he was doing trying to touch him when Damian was right there.\nHe could taste bile in his mouth and he pressed his lips together, holding his breath and trying to focus on the burning, the amounting pressure, instead of the rolling in his stomach.\nPerhaps if he wasn’t so selfish, if he didn’t take his issues and wield them into weapons to stab and twist and hurt everyone around him, he’d lose less. \nHe could blame his parents for his distress as much as he liked but they weren’t the ones hurting the people he loved. They were dead.  And he was living and hurting and harming with every breath.\nHe wanted to squeeze his eyes shut to escape it but he knew that if he did he’d see Kon’s hurt face burned behind his eyelids. He didn’t know if he’d ever loathed himself more. \nKon shifted and part of Tim soared in spite of himself. Even with all of his dread, it was a relief that the other boy was going to reach out for him, that he didn’t hate him enough to never touch him again.\nKon was going to hold him and everything was going to be okay again. \nAnother part of him, a selfish, ugly,  hurtful part, panicked. It screeched a hysterical  Damian, Damian, Damian,  on repeat. He couldn’t- He could. He wanted Kon to hold him. He needed to feel okay again-  \nKon didn’t touch him. He just moved away. As far as the couch would allow.\nTim’s throat pulsed, his heart spasmed, he felt like he’d been torn in half. His eyes were warm and his vision blurred until the flatscreen was nothing more than bright colors.\n‘Tim,’ Jon’s soft voice interrupted his thoughts, ‘what do you think?’\nTim couldn’t see the film through his watery eyes. From what he’d gathered it was a horror. Something stupidly inappropriate for the two teenagers. \nHe swayed, inhaled, swallowed - he wasn’t going to vomit.  He wasn’t - and managed a quiet.\n‘That’s fine.’\nDistantly, he heard the film start but he couldn’t focus on it, he couldn’t focus on anything but trying to stay calm, trying not to choke on the emotion trapped in his throat, trying to remember how to breathe. He tugged his knees up to his chest and stared unseeingly at the screen.\nGuilt and fear and shame felt like knives in his chest and he teetered on the edge of composure. He was certain that if he uncurled, even slightly, he’d shatter.\nHis whole body felt torn up, crumpled somewhere between needing Kon to hold him and why wasn’t he holding him? Why wasn’t he- Tim needed. Please. And spine-chilling fear at the thought because no, not in front of Damian, he couldn’t lose his family. He couldn’t.  \nBut Kon didn’t understand and Tim had flinched and god, his eyes burned. He felt terrible, selfish,  burdensome-\nThere was a deep huff and then arms wrapped around his scrunched-up form and he was pulled against a strong chest.\nThe grip was firm and unyielding, and stubborn thumbs rubbed circles into his arms. Despite the part of him that longed to melt into the touch, Tim stiffened. \nKon responded by holding him tighter. The action was pointed and it felt punishing, like Tim was trapped. Like the hands were around his throat instead of his middle. \nHis eyes darted over to Damian. The boy was smiling faintly, listening to Jon talk, nose wrinkled in response to something on-screen. Tim’s heart thudded in his chest so painfully that it was dizzying. Every second forced his breath faster, shorter, more hysterical and it made him feel lightheaded, vision spotting. \nHe didn’t pull away. He wouldn’t do that again. He’d endure or he’d blackout. There wasn’t a world in which Tim willingly made Kon feel that hurt again. \nHe knew about the other boy’s insecurities. Knew about his fears. Knew that he had nightmares about hurting Tim. Nightmares that reduced him to broken sobs, that made him choke at the thought of sharing a bed, that made him scramble away, gasping out desperate pleas for Tim to always carry kryptonite.\nAnd Tim had flinched.\nEvery reassurance, every comfort, every promise he’d ever made about not being scared had cracked in Kon’s expression. Even if it hadn’t been like that. Even if it had been so far from that Tim wanted to let out a bewildered laugh. He hadn’t been scared of Kon. Just annoyed, selfish, and thoughtless.\nIt didn’t matter because he’d still given Kon a glimpse of that future, that fear that the other boy imagined so vividly in his nightmares and there was nothing that could make him do that again. \nHe wondered distantly - beyond the pounding of his heart and the churning in his stomach - if this was him choosing Kon over his family. He had to sacrifice something and if he wasn’t going to pull away then he was going to let Damian see and his little brother’s face was going to twist in revulsion and then-\nAnd then small feet burrowed beneath his leg, cold toes digging, almost painfully, into the warm fabric of his sweatpants. \nDamian wasn’t even looking at him. He was staring fixedly at the television screen as he pushed his feet a little further before settling.\nTim could feel them leeching his heat through his sweatpants, he could feel hands rubbing against his arms, he could hear Kon’s heartbeat, steady beneath his ear, he could-\nHe could breathe again. \nIt took a moment to hit him, a moment spent relishing in the feel of air making his chest expand and contract, and then he crumpled into Kon’s chest. His muscles untensed and he trembled uncontrollably. His body felt so far away, so fragile, that it took all of his energy to twist his neck and bury his face into Kon’s t-shirt.\nTears carved lines down his cheeks and he sobbed silently. It was overwhelming and desperate and he wasn’t sure if he was relieved or exhausted or regretful but either way, it was dizzying. Emotion settled in the base of his throat and dripped from his lashes rapidly, relentlessly, he wasn’t sure if it’d ever stop.\nThe arms around him stiffened and the chest beneath him stuttered and he felt Kon’s panic as if it was his own. The hands that were rubbing his sides fluttered uselessly and the heartbeat beneath his ear grew frantic and-\nTim squeezed Kon’s arm tightly, as tight as he could force his uncooperative fingers to clasp, digging his nails into invulnerable skin. It was supposed to be reassuring. He felt better, well, he felt something that wasn’t mind-numbing fear because Damian wasn’t repulsed by him and Kon was holding him and he was still overwhelmed by guilt and shame but he didn’t feel like he was being torn in half anymore. He knew he’d missed the mark when Kon cupped the back of his head, holding him something fierce as he shifted to reach for the remote. \nTim stopped him, lacing his fingers through the reaching hand weakly. He could get through this. Really, he could.\nHe pressed into the junction between Kon’s shoulder and his neck and allowed himself a couple of wet, shaky breaths.\n‘I’m sorry,’ he choked out, quiet enough that anyone who wasn’t Kon would’ve struggled to catch it over Jon and Damian’s chatter. (‘That method of dismemberment isn’t actually effective or accurate.’ ‘Still gross though.’ ‘Agreed.’)\nHe pressed a trembling kiss to the other boy’s shoulder. And then another. And another. Tears wet his cheeks and his hair fell into his eyes. \n‘I’m so,  so  sorry.’\nKon responded instantly, words firm and certain.\n‘Not your fault. I shouldn’t have forced you into this.’\nHis voice was so bitter, so regretful, and so self-hating that Tim felt his guilt triple, spiking in his chest like a stab to the heart. Unbidden, he remembered the excited,  eager expression that the other boy had worn not even an hour earlier. He felt wounded, physically pained, to know that he’d destroyed that, twisted it into something sour, replaced his exuberant chatter with words drenched in self-disgust.\n‘Please don’t,’ he forced out, muscles in his face spasming as he fought against streaming tears to keep his voice steady, ‘it wasn’t your fault, Conner.’ He meant it with his entire heart. \n‘Please,  please don’t-’ he broke off. His throat ached and his eyes were sore and there was no point in scrubbing at his cheeks because tears just kept falling.\nKon shushed him. He brushed Tim’s hair back and pressed gentle kisses to the top of his head. The touches were careful and sweet, and Tim couldn’t help but lean into it, letting his eyelids slip shut to relieve some of the relentless stinging. \nThe minute he could think without his head pulsing, he’d promise Kon that it wasn’t his fault. \nBut right now, it was hard to form words when his lips were cracked and his head hurt. It was hard to focus on anything except the steady heartbeat beneath his ear and the soft lips against his hair and the strong, warm,  safe arms encasing him. So he didn’t even try.\nWhen he next opened his eyes it was to a dark room and the sound of hushed voices.\n‘-carry him just give me a sec-’\n‘I can-’\n‘Don’t argue with me, half-pint.’\nThe sounds drifted away and his eyes ached and he let the weight of his eyelids drag him back down. He was warm and comfortable and he couldn’t think enough to care-\nHis pillow shifted and his eyes snapped open, lips parting in a sharp, disorientated gasp. \n‘Hey,’ the arms around him squeezed gently, ‘it’s okay. It’s just me.’ \nTim’s heart slowed and his breathing settled. He let his eyes flutter shut, leaning into the warmth. \n‘I didn’t mean to wake you but I gotta carry Jon to bed,’ Tim made a sleepy noise of agreement, and Kon’s responding chuckle reverberated through him. A dopey smile curled his lips instinctively.  What was funny? \n‘You’re gonna need to sit up for that, sweetest.’ \nKon brushed his hair back softly and his groan morphed into a wince. His hand moved to rub at his sore throat. What had-  The movie. Kon. Damian.  \nHe wet his dry lips and pushed himself up into a sitting position before blinking slowly and struggling to reorient himself. \nHis thoughts were slow, still adjusting to being awake. He hardly listened as Kon left. Instead, he let his eyes wander the room.\nCushions littered the floor, a variety of chocolate wrappers sat beside the couch, small pieces of popcorn scattered the coffee table. \nHe could hear Damian breathing softly beside him, feel his eyes boring into the side of his face, and he shook his head as if to clear it.  What time was it? \nSwaying, he moved to stand up but his legs were unsteady and he stumbled and- A small hand grasped his bicep, tugging him back down. \n‘Be careful,’ Damian snapped and then his voice morphed into something that Tim’s tired brain could only call amused. \n‘If this is how incompetent you are when you’re tired then it’s no wonder you have a caffeine addiction.’ \nTim’s woolly brain labored over understanding the words before brushing them off. He shifted again, movements sluggish, someone had to-\n‘Stop moving. Kent will carry you to bed once he gets back.’\n‘Someone’s gotta clean this up,’ his voice came out whiny and he wondered distantly why he was even listening to Damian. Tim could do what he wanted.  He was the older brother.  He was in charge.\nHis brain faltered when Damian huffed a laugh.  A laugh. This had to be a dream. \n‘I am going to do it. Just- stay put,’ he lowered his voice to something that could only be described as gentle, ‘I was supposed to follow Kent and Jon but now I am certain you will fall and die without supervision.’ \nTim just grumbled in response.  Dramatic brat.  He wasn’t going to fall and die. He let himself slump back into the cushions, eyes slipping shut. He could hear the crinkling of chocolate wrappers, the sound of cabinet doors opening and closing, soft footsteps moving from carpet to linoleum. \nIt was soothing. Sound always was. It offered the comfort that he wasn’t alone, that he wasn’t waking up to an empty house. It helped him to drift, sinking a little further into the comfortable couch. \nThere were a couple more clicks, a soft tumbling sound, a gentle hum, and then quiet. It lasted for a moment - long enough for Tim’s eyebrows to pinch but not long enough for him to peel his eyes open - and then Tim could hear footsteps moving down the stairs and someone humming a tune under their breath. And then.\n‘Goodnight, Timothy.’ \nTim might’ve called the words affectionate if they’d come from anyone else. It made something warm unfurl in his chest and he fought against exhaustion to make his lips move. It took a few seconds but when he spoke his voice was hoarse and tired and undeniably fond. \n‘Goodnight, Damian.’\nTim listened to him pad away and smiled, dazed. Being a big brother was easy. He couldn’t fathom why Dick and Jason ever complained.  It was easy.  Tim drifted.\n‘Tea?’ Tim shut the bedroom door behind him, clutching the small china cup between his hands and drinking deeply. It tasted sweet and warm and it worked wonders for soothing the ache in his chest. \n‘From you? Thanks but no thanks.’\nTim rolled his eyes and weaved his way through sheets and sheets of paper to sit cross-legged in the center of the bed. He reached out to touch one of the files absently.\n‘I-’\n‘Hands off,’ Jason growled, shooting him a glare from where he sat on the floor, papers fanned out in front of him as he organized them alphabetically or by date or whatever it was he said he was doing. Tim wasn’t sure.\n‘You sure?’ He tempted, taking another sip of the tea. ‘I didn’t make it. Damian did.’ \nThat earned him a look of disbelief and Tim scowled. \nHe couldn’t blame Jason for being skeptical (even if it did make him feel a little defensive) because he’d been more than a little suspicious when his door had knocked and he’d found the first cup of perfectly made tea sitting on the hallway carpet. \nThat was two weeks ago. \nSince then he’d learned to expect a cup twice a day, mostly in the evening.\nHe hadn’t asked why. He hadn’t mentioned it. The one time he almost did, they'd been sparring and Damian had hit him so hard that his nose poured blood and the only words that had fallen from his lips then were harsh, snapped insults. \nHe’d still received a cup of tea that evening. \nIt didn’t matter anyway, he didn’t need to ask, Tim was fairly sure he knew why. \nKon was off-world, completely unreachable, and he’d taken Jon with him; Tim wasn’t sure when they were going to be returning. Wasn’t sure whether they were okay. Wasn’t sure if they’d be returning (He knew the thought was ridiculous. It didn’t stop it from haunting him). \nTim occupied himself to cope. \nDamian made tea.\n‘You’re the new favorite now then? Dick won’t like that,’ Jason reached out and Tim handed the cup over, somewhat reluctantly. \nTim scoffed. \n‘He’s probably just trying to lure me into a false sense of security. If I die by poison you know who to blame.’\nJason didn’t look convinced - Tim couldn’t blame him. The words had been half-hearted at best - but he just shrugged and turned back to the papers. There was a moment of silence until-\n‘I don’t want to pry-’\nTim groaned. \n‘Dick has a big mouth.’ \n‘He does,’ Jason agreed easily, ‘I’m just letting you know that if someone dangles you from the top of one of the towers by your ankle and demands that you tell them who you’re fucking. And if that someone happens to be me. It wasn’t my idea, okay?’\nTim pinched the bridge of his nose. \n‘But you’re still gonna do it?’ he asked flatly.\n‘But I’m still gonna do it,’ Jason confirmed. \n‘Dick’s relentless. And you-  you’re- Fuck you. I didn’t think you were easily led?’ \nJason didn’t rise to the obvious bait, he just continued sorting the papers with a slight smirk. \n‘You could make this easier on yourself by telling me now. I won’t tell Dick, promise.’\n‘Again, Jason,  fuck you.’\nJason rolled his eyes, ‘do you really think you’re gonna be able to hide it from Cass when she gets back?’\n‘Cass is the only person in this family who respects my privacy enough not to pry.’\nJason hummed at that. He bunched the papers into a neat pile and set them down on the bookcase. Tim wondered how long it had been since he’d been able to see the carpet in his room. \n‘I need to vacuum,’ he commented absently. \nJason snorted, ‘I think you need to clean the other side of your bed first.’\nTim took one look at the clothes, cables, and drinking glasses - how he’d collected so many without Alfred noticing he wasn’t sure. But he was too scared to take them down now. Alfred would have his head - scattered across the other side of the room and shrugged. \n‘It’s a lost cause.’ \nJason ignored him. For which he was immensely grateful because his older brother usually had to tamp down on the urge to strangle him (Tim could tell because his eye twitched and his voice came out strained) whenever he stepped foot in Tim’s room. Which begged the question-\n‘Patrol with me on Wednesday,’ Jason said suddenly as if it had just popped into his head. \nTim groaned. \n‘So that’s why you’re here.’\n‘What?’ Jason asked innocently, ‘Do I need a reason-’\n‘Am I supposed to agree to go with you after you’ve just threatened to  torture  me or whatever?’\n‘Oh,’ Jason grinned, ‘this has nothing to do with that. Don’t worry. Dickie’s away next week and I’m not gonna do anything without him. How cruel do you think I am?’\nJason stood up and Tim followed suit, watching as the other boy shrugged on his jacket. \n‘Cruel enough to ignore my boundaries and make me cry. Because I  will cry, Jason. I’m warning you.’ \n‘Thanks,’ Jason rolled his eyes, ‘I’ll be prepared.’ \nTim followed him out of the bedroom, taking a second to look back and admire the organized files.  \n‘You don’t have to clean my room whenever you're here, y’know?’ Tim accompanied him down the stairs, placing the teacup on the counter and leaning against the wall as Jason tugged on his shoes.\n‘Someone has to,’ he grumbled before sighing exasperated, ‘you have to know that it annoys me, right? It physically pains me that your room looks like that. How do you find anything?’\n‘Easily,’ he retorted stubbornly. \nJason’s lips twitched.\n‘Anyway,’ he stood up, ‘Wednesday night. 21:15. Dock 7.’\n‘Jason, no!’ Tim whined, ‘that’s so specific. This isn’t gonna be good for me-’\nHe was cut off by arms wrapping him into a hug (a somewhat obligatory hug since Dick had set parameters for  necessary  and  important-for-your-well-being-Tim-stop-arguing-with-me  family affection at the last family meeting.) He returned it, resting his forehead against Jason’s shoulder wearily. Jason let go, pinching his cheek in a way that made Tim blush and smack at his hand. \n‘No ulterior motive,’ Jason opened the door and started down the steps to his bike. Tim folded his arms in the doorway and resisted the urge to stamp his feet.  It was so obviously a lie.  The older boy just grinned, delighted by Tim’s annoyance. \n‘Goodbye, Jason,’ Tim snapped, reaching to shut the door. \n‘See you on Wednesday,’ he called cheerily. \nTim just stuck his middle finger up in response. Shutting the door and-\nA foot in the doorframe stopped him. He glared through the gap. \n‘What?’\n‘Promise you’ll be there,’ Jason demanded.\n‘No.’\n‘Please. It’s got nothing to do with your sex life.’ \nTim sighed. Even so, whatever it was, it wasn’t gonna be good.\n‘Fine,’ he conceded. \nJason grinned wider and moved his foot, heading back towards his bike.\n‘21:15,’ he called over his shoulder.\n‘Okay,’ Tim agreed tiredly.\n‘The docks.’\n‘Okay.’\n‘Don’t be late.’\nHe almost groaned. \n‘Goodbye, Jason.’ \nHe shut the door before the other boy could respond. \nThe Manor felt oddly quiet in Jason’s absence. Tim heard the bike start up and peel away leaving him with the muted sounds of downstairs; the whirring of the tumble dryer, the low humming of the oven, the ticking of the grandfather clock. \nHe wandered into the kitchen and glanced at the glowing oven door. Banana bread. Warm and sweet-smelling. Breathing it in felt comfortable, familiar in a way that didn’t make sense but made his chest feel full anyway. \nHe gazed out of the window, resting his elbows on the kitchen counter. \nThe sky was grey. A nice grey. The kind of grey before it rained, not the regular Gotham kind. He almost snorted. Kon would cite that exact train of thought as one of the many reasons why he’d rather die than live in Gotham:  you’re differentiating between types of grey, Tim. You know that skies are supposed to be blue, right? \nAnd he was right. But there was something beautiful about this kind of grey. It was the kind that happened everywhere right before a storm. At times like this, the Gotham sky looked ordinary, and ordinary was rare in Gotham. Tim had learned to savor it. \nHe wet his dry lips and made a snap decision before bounding up the stairs.  Why not? He was going anyway. He might as well. \nHe knocked on Damian’s bedroom door sharply. \n‘What do you want?’\n‘Coat. Shoes. Car. Five minutes,’ he ordered.\nHe heard movement and continued before Damian could ask.\n‘No. No costu-  uniforms. Just civvies. Something with a hood,’ he hesitated before adding, ‘no murder plot. I promise.’\nHe strode to his bedroom, fumbled around for a coat, and spent the better part of ten minutes searching for his favorite camera lens (to no avail. Perhaps he could get Jason to work on that next time he visited) before deciding that his phone would do. Photography wasn’t really the point of going out tonight anyway. \nHe bounded down the stairs, yanked on his shoes, grabbed his keys from the hook, and headed outside. Damian was waiting by the car door, arms folded, face set in a scowl. \n‘Sorry,’ Tim breathed as he jogged over and unlocked the car, ‘took longer than I expected.’\nDamian tutted but he didn’t say anything as he climbed into the passenger seat. Tim got into the driver's side, pulled on his seat belt, and started the engine.\n‘Where are we going?’ Damian asked, voice sharp.\n‘You’ll see,’ Tim pulled off the driveway, heading towards the inner city. \nDamian looked skeptical but he didn’t push the subject. Instead-\n‘If you are driving there. I am driving back.’ \nTim snorted. There it was. \n‘You can drive my car when I’m dead.’\nDamian’s lips quirked upwards and he opened his mouth but Tim cut him off. \n‘Shut up or I’ll make you sit on a booster seat.’ \nDamian slumped, glaring out of the window with his arms crossed. Tim’s lips curled into a smile and he relaxed in his seat. \nThe journey was fast and mostly silent. Tim had cursed once when a brunette woman in a red SUV cut him off and Damian hadn’t said anything, just raised his eyebrows in a condescending way that made Tim want to smack him. \nHe pulled into a side street and then into an alcove, half-obscured by a brick wall. Better safe than sorry. He really didn’t want to lose his car or his tires. If only because Jason would never let him live it down. \n‘With me,’ Tim motioned for Damian to follow as he climbed out of the car and strolled into the alleyway. They walked in silence, Tim ahead and Damian one step behind as they turned corners and crossed roads until they reached a ten-storey apartment building with a fire escape that Tim trusted with his life. \n‘After you,’ he gestured upwards.\nDamian narrowed his eyes and Tim sighed, exasperated.\n‘I  promised  no murder plot.’\nDamian hummed in disbelief but he scaled the building easily and Tim followed, sparing a second to glance around before he vaulted the final meter of crumbling brick to land on the roof. \nDamian was already standing at the edge, hands shoved into his pockets as he shot Tim a glare. \n‘We are  supposed  to be civilians.’\nTim shrugged and strolled over to stand beside him, ‘no one saw me.’ \n‘That’s not the point.’ \nTim ignored him, gazing at the sky and the Gotham city below it. From here, he could see everything. Well, everything that mattered. It was one of his favorite spots. Had been since he was nine. \nThe night in Gotham could be a captivating thing to photograph; he had a thousand photos of Batman and Robin, various other vigilantes, and a fair few rogues to prove it.\nBut there was something special about the early evening. \nPeople traveling home from late shifts, working girls getting ready, the shutters of stores coming down, most decorated with brightly colored graffiti: a red bat to remind criminals of Crime Alley’s protection, an ‘O’ to deter thieves, there were even a couple that had directions to various shelters and facilities adorning their metal. \nTim tilted his head slightly. They hadn’t been there the last time he came. Granted, it had been a while. Still, the neat writing, bright red paint, and the fact that all of them were Wayne-owned made him wonder if Jason had gone out and painted them himself. \nHe smiled. The early evening in Gotham was something to be savored. The calm before the storm. \nTim looked up at the grey clouds and suppressed a laugh.  Literally. \nHe turned his attention to Damian. The teen was staring out at the city with an expression as open as Tim had ever seen it. His eyebrows were pinched and his lips were parted and he looked soft; not annoyed or angry, just curious. \nTim slipped out his phone and snapped a photo. Damian’s head whipped around to face him, face twisting as he eyed the phone. \n‘What are you doing?’ he demanded. \n‘Making sure I have photos of all of the Robins.’\nDamian scoffed, ‘so that’s why you dragged me here? To complete your collection.’\n‘No,’ Tim took a step closer, a sly smile pulling at the corners of his mouth, ‘I  dragged  you here because it’s pretty and I wanted to share that with you,’ he took another step closer, ‘and because I wanted to do this.’ \nHe slung an arm over Damian’s shoulder, tugging him close, lifting his phone to take a photo while Damian twisted, shoving an elbow into his ribs, kicking at his ankle. \n‘Timothy, I don’t want a photo taken with  you .’ \n‘Tough. I do.’ \nTim fought back, squeezing him tighter, his smile a full-blown grin now as he wrapped his other arm across Damian’s front and-\n‘What the  fuck!’  Tim let him go, rolling up his sleeve to examine his arm, ‘you bit me.’ \n‘You put your arm near my mouth,’ Damian retorted stubbornly. \nTim snorted, rubbing at the circle of indents in his arm. \nThe roof felt quiet after their shouting and Tim sat down on one of the containers with an exaggerated sigh. It really was nice before a storm. Even the air smelled fresh, like it had already been cleansed and the ground was just waiting. \nHe pulled out his phone and heard Damian sit down beside him. He was staring out at the sky, expression thoughtful.\n‘Jason asked me to patrol with him on Wednesday,’ Tim said after a moment, ‘there’s definitely an ulterior motive.’\nDamian breathed a sigh. \n‘The drug trafficking operation we’ve been tracking. There’s a meet. Father told him to stay away from it.’\nTim groaned and rubbed his eyes. \n‘Yeah. That makes sense,’ Tim paused, ‘thanks for letting me know.’\n‘You’re still going to go?’\nTim shrugged, ‘Why not? Look-’ he tilted his phone so that Damian could see, ‘this photo is nice.’ \nTim’s arm was wrapped around Damian’s chest, a grin on his face, a happy glint in his eye. Damian looked less than impressed, his face was a little blurry with his struggle but his lips were tilted upwards in a half-smile. Tim presumed his little brother had just decided to sink his teeth into his forearm.\nDamian didn’t say anything, he just scowled, watching as Tim flicked through photos.\n‘You don’t mind having your photo taken as Robin,’ Tim commented, thinking about the various photos his little brother had with his teams. \nDamian shrugged. \n‘I am proud of Robin.’ \nBefore Tim could unpack that statement - all he knew was the tugging feeling in his chest and the flare of vehement dislike for the fact that those words had left his little brother’s mouth - Damian continued. \n‘I wasn’t aware that you had visited London outside of work,’ he gestured to Tim’s phone wallpaper.\n‘Oh,’ Tim said in surprise, ‘I haven’t. Not really, anyway. I- We had a lead that took us to Edinburgh. It was good intel so we wrapped everything up pretty quickly and we had a couple of days spare,’ Tim gestured vaguely as if to say you know the drill. \nDamian raised an eyebrow, drawling sarcastically, ‘ah, yes. Edinburgh. Is that in London or just outside?’\n‘Shut up,’ Tim reached out to shove at him and Damian swerved the touch with a smirk.\n‘I was getting to the point. Everyone was celebrating and Kon asked if I wanted to get away,’ his lips stretched into a smile and he looked down, cheeks warm. He’d expected maybe a night alone or a meal out but- ‘Next thing I knew we were in London. We stayed in a little hotel near a theatre and nearly died visiting about a thousand museums,’ Tim snorted, ‘we also ate some really good Chinese food while walking back. I still crave it every time we order takeout.’ \nTim pressed his home button and gazed at the image fondly.\n‘That photo was taken on some bridge. Not that you can really see the Thames behind us. The woman I asked to take it was  so  bad at taking photos but she hardly knew how to work my phone so I guess she tried her best.’\nTim’s smile turned wistful. Kon would be home soon. With Jon at his side. Safe and unharmed and thrilled to see him. Tim could already imagine his smile, the sweeping embrace, the infuriatingly arrogant miss me? whispered in his ear.\nDamian interrupted his thoughts. Voice uncharacteristically small.\n‘Were you together at the time?’\nTim nodded. They’d been together, but not for long. Maybe only three weeks officially. \n‘I- It took me by surprise. We’d never really done anything like dates or romance or stuff away from work-’ he used his fingers to form air quotations and Damian rolled his eyes, ‘I guess we hadn’t really had the chance with me wanting to keep it a secret from B and all. But- I don’t know. We were so far away and I felt like a completely different person. I’d never thought- It was nice.’\n‘A different person?’ \nIf Tim couldn’t see Damian he might have mistaken the words for a scoff. But the other boy’s face was soft, more honest than he’d ever seen it, and Tim couldn’t help but wonder if this was the side of the kid that Dick adored.\n‘You don’t get to choose who you are. People and situations do that for you,’ Damian paused, ‘you know that there is nothing to be afraid of. Neither Todd nor Richard will care. Cain is likely already aware, Pennyworth too. Father will, understandably, disapprove of your choice in partner but-’\nTim shoved him with a good-natured hey and Damian’s lips turned upwards. \n‘Why don’t you?’ Tim asked quietly after a second.\nDamian shrugged. \n‘I simply don’t see a reason to. I do not need to waste everyone's time when-’\n‘And I do?’ Tim rolled his eyes and Damian glared. \n‘It’s clearly impacting you. My silence does not hinder me.’\n‘I’m pretty sure that’s an insult,’ Tim replied weakly before sighing, ‘I already told one Father. I don’t wanna disappoint another.’ \nA drop of rain melted into Tim’s hand and he watched it disappear. Then another. And another. \nHe really didn’t need to hear how accepting his family would be and he definitely didn’t need to hear some offended defense of Bruce’s honor. He knew that they’d accept him, it was a not small part of the guilt that churned in his stomach whenever he thought about hiding it. It didn’t change the fact that he couldn’t force his mouth to form the words when he was in their presence.\nHe didn’t know if he would ever be able to talk about Kon to his family in the way that other couples did and that thought made his throat tighten. \n‘What was Scotland like? I’ve never been outside of work,’ Damian changed the subject. Because Damian had already told him in no uncertain words that his family would accept him and he wouldn’t repeat himself. Tim practically melted in relief. \n‘Me neither. I suppose we spent a few hours there before London and it was- I don’t know- hilly?’ he shrugged. \n‘Maybe we’ll go back,’ his expression turned thoughtful, ‘I’m pretty sure that Kon just wanted to get away from everyone. They were making plans and we hadn’t spent much time alone and I think he could tell that I wasn’t feeling it,’ Tim paused, voice softening, ‘he’s good at that. Sometimes I feel like he can read my mind. And I know he can literally hear my heartbeat and everything but it’s like he looks at me and knows exactly what I need.’\nTim traced his finger in patterns on his jeans absently, connecting the spots left by the rain. \n‘Sometimes...  I  don’t even know what I need and he’s there like:  Tim, let's watch a movie and order food  or  let’s check out that other case  or  Tim, go to sleep or I’ll never speak to you again.  I-’ Tim took a breath, ‘It’s nice. Like someone actually understands. Even if he doesn’t mean it. Even if he’s just telling me what I need to hear in the moment. I- He just  knows  and he always tries to give it to me even when it hurts him-’ \nTim knew that his overworking hurt Kon. He knew that his silence hurt Kon. He knew that keeping their relationship a secret hurt Kon. But the other boy was always understanding, always accommodating, constantly compromising-  \nTim didn’t think he’d be able to stop the words pouring from his lips even if he wanted to. \n‘-it really hurts him sometimes. I can tell. I get tired and I shout and he doesn’t make me feel any less for it. I mean, he’s arrogant to shit sometimes and he’ll argue with me about the smallest,  dumbest things but he always tells me how he feels even if it hurts his pride. I need that, I think. Someone that knows what to say and how to say it and when. Someone that-’ Tim trailed off. \nHe’d never had someone like Conner. Someone that made it clear that he still loved Tim even if he was annoyed, or disappointed, or downright angry.  I hate you right now,  he’d say,  but I don’t suddenly not love you just because you’re acting like a fucking idiot.   \nTim coughed and rubbed at the back of his neck. He was suddenly all too aware that he’d rambled on for the better part of ten minutes.\n‘I- What about you?’ he asked, wringing his hands, ‘how is it- with Jon?’\nDamian’s lips pressed together in response and Tim didn’t mind the silence.\nHe felt his anxiety dissipate with every passing second. He felt light, lighter than he had in a while. Talking about Kon made him feel content, made him realize that he probably had enough to say to talk forever and then some. He felt a little dizzy with the warmth of it all. \nHe wasn’t sure how much time slipped by but he wasn’t expecting an answer from Damian anymore. The sky was still spitting and Tim turned his palm up to catch the raindrops. It was mesmerizing, really. \n‘We should probably get going soon,’ Tim stated but he made no effort to move. \nLeaving was the last thing that he wanted to do. He glanced over at Damian, knees tucked up to his chest, gazing out at the darkening sky. The sky was too pretty to look at through a window. He leaned back, staring upwards, letting the rain spot his face. It was too pretty to not feel. \nWhen Damian spoke his voice was soft. \n‘He makes me feel like I am easy to be around even when I know I am not.’\nHis words sat in the space between them, amongst the gentle patter of rain. \n Good,  Tim didn’t say.  You deserve someone like that,  he didn’t say. He just stared up at the cloudy sky. There was a moment of stillness and then-\n‘We should probably leave soon,’ Damian echoed his words from earlier, and Tim hummed in acknowledgment.\nNeither of them moved.\n‘Could you please slow down for a seco-’ Tim jostled as the car jerked over another uneven bit of road. \nThe driveway was long and twisting, and,  usually, there was something beautiful about it. There was something beautiful about the farm in general; the vast expanse of green, the soft orange sky, the gentle buzz of things happening far away. Usually heading towards the house when the sun was setting felt a little ethereal. So different to Gotham that Tim wasn’t convinced it was even the same planet.\nRight now, however-\n‘Conner!’ Tim snapped as they jolted over another bump. He adjusted the tray of milkshakes balanced in his lap, scowling when he heard Kon laugh.\n‘If you make me knock these over I’ll- I’ll-’\nTim met his eyes and his breath caught as he took in the way that the golden light washed over the other boy, slanting across his cheekbones and painting his lopsided smile. His eyes were crinkled and his lips were wet. A thin sheen of sweat coated his neck and glossed his forehead, dampening his hair and making it curl. \nTim sucked his lip between his teeth, only a little reluctant to admit that perhaps it wasn’t the farmhouse that was ethereal.\n‘You’ll?’ Kon prompted as he rolled to a stop outside of the house. He sucked at the straw of his milkshake, eyebrows raised. \nTim clicked his tongue. He was never letting Kon drive again.\nHe reached to open the door, face set in a glare. ‘Well, it doesn’t matter now-’ \n\n Click. \n\nTim clenched his fists.  Never again.  \n‘Babe,’ he asked levelly, ‘why  is the child lock on?’\n‘I’m giving you adequate time to finish your threat.’\nKon’s arrogance sparked a burst of annoyance in Tim’s chest and he scoffed, leaning back in his seat and sipping at his milkshake coolly. \n‘If these melt then you can explain that to Damian.’ \nKon leaned forward and Tim’s stomach flipped, irritation morphing quickly - so quickly it was actually embarrassing - into anticipation. \n‘Sure,’ Kon lifted a hand to cup Tim’s cheek, thumb brushing lightly at his lower lip in a way that made him feel like electricity was buzzing under his skin. Kon’s eyes were a shade darker than usual, his expression more heated and Tim exhaled warmly against the pad of his thumb. \n‘How’s your drink?’ Kon’s voice was low and gravelly and his eyes flickered to Tim’s lips, hot breath fanning across Tim’s cheeks in a way that drove him a little bit crazy. \nHe hummed, gaze fixated on Kon as he took a long drink of his milkshake before grinning something wicked. \n‘Find out.’\nFor all his strength, Kon’s lips were soft against his, slow and deliberate, and Tim sighed into the touch. It was all he could do to keep still, to not jostle the drinks, to not push forward and kiss back forcefully. Kon tasted like the Oreos from his milkshake and his lips were teasing, infuriatingly so, teeth tugging at his lower lip in a way that made Tim feel hot, heart racing, blood searing in his veins. \nKon broke away and Tim chased him with a breathy whine, the fingers twisted in his t-shirt, yanking at his collar, did nothing to pull him back and Tim’s eyes blinked open to see Kon gazing at him, expression fierce.\n‘Now,’ Kon’s voice was rough and the pad of his thumb brushed across Tim’s cheek, ‘what was it you were gonna do to me?’ \nTim watched as the other boy’s tongue moved forward to run over the tip of his canine. He- He was just so-  So- Tim felt breathless.\n‘Positive reinforcement is more effective than negative when attempting to deter undesirable behavior.’\nKon smirked, arching an eyebrow. ‘Is that right?’ his voice was rough and appreciative, ‘what will you do  for  me then?’\nTim wet his lips, letting his eyes roam the other boy, taking a  long second to enjoy him, disheveled and wanting, before he leaned backward and shrugged. \n‘Your laundry?’ \nKon groaned and the doors unlocked and Tim grinned as they climbed out of the car. \n‘You’re insufferable.’\n‘What?’ Tim grinned wider, following him towards the house, ‘fine.  I’ll clean your room? Pair your socks? Do your casework?’\nKon faltered. \n‘Wait, seriously?’ \nTim made a face. ‘Sure but I gotta get these to Jon and Dami intact first.’ He took a sip from one of the two bright blue drinks and narrowed his eyes. What did they even put in it to make it blue? \n‘You have trust issues. I can drive flawlessly-’  Tim fixed him a look that he ignored, ‘I wasn’t gonna knock them over. Jon would make that sad face he makes and  nothing  could convince me to do that to him,’ Kon pulled open the screen door, ‘how does it taste?’\n‘Like drinking syrup,’ Tim wrinkled his nose in distaste before gazing up at Kon through his lashes, ‘nothing  huh?’\nKon groaned and Tim slipped in front of him and into the house, with a smirk. Kon was easy to rile up and Tim was going away for a few days and what better way to leave than with bruised hips and an ache so good that he couldn’t sit down.\n‘You’re killing me, do you know that? You’re actually  killing  me.’\nTim didn’t look at him, smiling in satisfaction as he walked in the direction of voices. \n‘Got any sevens?’\n‘Go Fish.’ \n\n ‘Liar.’ \n\nTim stepped into the kitchen, the tray of milkshakes in one hand and his own half-empty shake in the other. Damian and Jon sat at the small kitchen table, a deck of playing cards split between them. \n‘Go fish?’ Tim snorted, raising an eyebrow and setting the drinks down in front of them. Damian glowered. \n‘Ma banned us from electronics for the rest of the day,’ Jon offered.\nDamian rolled his eyes and snatched up his milkshake, expression set stubbornly. \n‘Daytime lasts until approximately 6pm so technically the ban ends in fourteen minutes. Then I can go back to destroying you at Mario Kart and you can stop cheating at go fish.’\n‘Firstly D, I don’t think that’s what she meant,’ Jon sounded dejected but it quickly morphed into something indignant, ‘Secondly, I’m  not  cheating!’\n‘It is impossible to be so good at a game of luck.’ \nJon feigned a gasp, ‘did you just compliment me?’ \n‘No, Jonathan. I am scorning you.  This  is scorn.’\n‘I’ll take it,’ Jon shrugged before sipping his own milkshake, pupils growing wide. ‘Oh my god. You were right, Dames. This is amazing.’\n It’s literally just sugar,  Tim didn’t say.  Dick has given Damian bad habits and now Damian is giving them to you,  he didn’t say. He just leaned against the wall, suppressing a smile and pitying whoever it was that had to deal with the two sugar-crazed teens later that evening. He really hoped it was Bruce. \nDamian tutted. \n‘Of course I was right. Richard and I have tried almost every combination in the store. This is by far the best,’ he paused, ‘any threes?’\nCurious, Tim peered over Jon’s shoulder. \nTwo threes. Three sevens. A two. And a nine.\n‘Go fish. Got any twos?’\nTim bit down hard on his straw to keep from laughing. Damian handed over a card with gritted teeth. \n‘You are a liar, Kent.’ \n‘I am not!’ Jon protested before blinking up at Tim innocently, ‘Tim, am I cheating? Tell the truth.’\nTim remained carefully composed. \n‘I don’t think it’s possible to cheat at go fish,’ he lied. \nPerhaps this would be how he died. Damian would stab him with one of the knives that he definitely had hidden somewhere, all because he’d lied for Jonathan Kent.\nAlthough, he was stupidly certain that they’d moved past all of that. Damian fixed him a look but before he could voice his betrayal Kon appeared in the doorway. \n‘How are your cups of sugar?’ he asked, moving behind Tim and wrapping an arm around his waist. Tim leaned into the touch, smiling when Kon kissed his temple gently. \n‘Incredible!’\n‘Sufficient.’\nIt wasn’t lost on him how at ease he felt. It made something he couldn’t identify settle in his throat and he swallowed. \n‘Good. Because they took-’ Kon broke off with a groan. He looked at Jon. ‘Rock, paper, scissors?’\nJon wrinkled his nose but his eyes hardened and his lips pressed together in determination.\n‘On three?’\nTim met Damian’s eyes and saw his own bewilderment mirrored there before it quickly morphed into a scowl. Tim supposed it was his own fault that he was the subject of Damian’s ire but, as Kon had said earlier, there was nothing that could convince him to make Jon sad. Not even a murderous Damian. He stuck out his tongue childishly and delighted in how Damian’s scowl deepened.\n‘Sorry, kiddo,’ Kon snipped at his hand with pretend scissors, ‘you can’t win at everything.’\nJon slumped, setting his cards face down and standing up with a grumble. \n‘Okay fine, I’ll bite. What’s going on?’ Tim stirred his milkshake absently.\n‘Ma wants someone to help with firewood-’ Jon muttered and then his eyes lit up and his lips broke into a sly smile and-\nKon sighed. \n‘She wants both of us.  Apparently,  I can’t keep cheating at rock, paper, scissors. I don’t know how she thinks I’m cheating like it’s literally not-’ his voice trailed off as he set his milkshake down and left, glaring at a smug-looking Jon. \nTim heard the front door shut behind them. \nIt was quiet in their absence and Tim took Jon’s seat at the table, sipping at his milkshake and tapping his fingers on the wood. The windows were open wide and a gentle breeze fluttered the curtains, making them brush and catch on various sweet-smelling jars. Ma had been making jam and Alfred might kill him if he didn’t bring some back to the Manor. Secret relationship or not, he’d know.\nDamian reached out-\nTim moved Jon’s cards out of reach. \n‘That’s cheating,’ he chastised with a smirk. \nDamian glowered and- \nTim’s skin had started to prickle. Not because of the breeze but because he’d been meaning to talk to Damian for days and this was his chance. The perfect chance. And Tim was going to waste it because his stomach was tying itself in knots and his heart was pattering so fast that-\n‘I think I’m gonna come out,’ Tim blurted, voice strained and breathless.\nDamian didn’t say anything, just stared at him expectantly and Tim took a shaky breath in a futile attempt to steady himself.\n‘I’m going to come out,’ he repeated, slower and firmer, ‘talking…uh- with you the other week. I felt- It was- easier than I thought it... And, uh- I want to-’ \nTim almost groaned in frustration. If this was how eloquently his coming out was going to go he’d rather the ground below him open and swallow him whole to avoid the embarrassment. He just needed a moment. To gather his words. To be honest.\n‘I felt happy,’ he murmured after a long minute, ‘I can’t remember the last time I felt like there wasn’t weight on my chest. I want-’ he inhaled, ‘I want to talk about him to everyone. Anyone who will listen. But it wouldn’t be fair if I didn’t talk to you first. I refuse to force you into any kind of situation you’re uncomfortable with and- what I’m trying to ask-’ \nTim took another deep breath and tried to steady his pounding heart. It was like his tenuously maintained composure slipped further away with every word and regaining it felt like grasping at water. When he spoke, his voice was impossibly small. \n‘Do you want to do it with me?’\nHis eyes searched Damian’s face. He’d thought his little brother might appreciate the excuse to tell someone, even if he wasn’t burdened by his silence or whatever it was that he’d said. Tim didn’t want to make him feel like he couldn’t- Just because Tim- He took a breath.\nDamian had a thing about being second. Tim didn’t want to be the reason that something that wasn’t a big deal to Damian became something to fixate on and suffer over. He didn’t want Damian to feel like he had. \nHis brother looked surprised, a little perplexed but not betrayed or angry. Tim continued, words pouring from his lips before he could think- \n‘It’s only a suggestion. No pressure. Please don’t feel like you have to. And I won’t do it if you think it’ll hurt you. I know that you said you don’t care but if you do - if you were lying - that’s fine. I don’t mind. We can figure something-’\n‘Timothy,’ Damian interrupted him, he sounded sincere, if a little amused and a fraction annoyed, and Tim felt his uncertainty morph into confusion as he snapped his mouth shut, ‘you’re embarrassing yourself and, frankly, me. I’m insulted that you assumed I would not support you.’\nTim melted in relief. Tension drained out of his tight muscles and he slumped into the chair.  \n‘Thank you,’ he whispered. \nDamian tutted, nose wrinkling and shoulders tensing like he wanted nothing more than to leave. \n‘But I meant what I said before,’ he stated stiffly, ‘I don’t see a need,’ he paused, shoulders stuttering back down, eyes suddenly very interested in the cards in his hand. When he continued his voice was soft. \n‘Thank you for thinking of me.’\nHis mouth sealed like the words were hard to say and Tim nodded because of course.  He couldn’t imagine a world in which he didn’t talk to Damian first. He wouldn’t purposely make him feel abandoned, even if the worry that he’d feel as such was ridiculous or - what did Damian call it? - embarrassing.  Tim might’ve rolled his eyes if he wasn’t feeling so fond. He couldn’t even muster up the strength to be annoyed. How else had he expected Damian to respond if not with snark and thinly veiled insults?\nHe opened his mouth to say something undecided but definitely far too affectionate when the front door slammed open and-\n‘I win!’\n‘I let you win.’\nHe settled for a smile. Something warm and grateful and relieved. Damian nodded slightly, the high points of his cheeks reddening and Tim wanted to reach out and pinch them. Instead, he grinned widely and called out.\n‘He’s lying, Jon. He wouldn’t sacrifice his pride for anyone.’ \nThe youngest boy bounded into the room, Kon just behind him, and Tim stood up to give the kid his seat back. \n‘Oh.  I know,’ Jon agreed heartily, sitting down with a grin, ‘I won fair and square.’ \nDamian raised an eyebrow, ‘I don’t believe that fair is in your vocabulary,’ he lifted the cards in his hand slowly,  deliberately,  and Tim stifled a surprised laugh. \n\n When- How had he- Of course- \n\n‘Hey!’ Jon whined, ‘give me back my cards. That’s against the rules-’\n‘Lying is against the rules-’\nA hand slipped along Tim’s waist and the arguing faded into the background. He leaned against Kon, twisting in the hold so that his nose brushed the junction between his neck and shoulder.\n‘I did let him win, you know?’ Kon spoke into his hair. \nTim gave a non-committal hum. Kon had once refused to let a seven-year-old girl win at DDR with the whole arcade watching. There was no way he let Jon win. \n‘You don’t believe me? Your own boyfriend-’\nTim rose up on his tiptoes, pressing a kiss to the soft skin behind Kon’s ear and delighting in his sharp inhale. \n‘I don’t think you’ve ever voluntarily lost anything in your life, Conner Kent,’ Tim spoke against Kon’s skin, feeling him tense in response. \n‘I can’t believe that-’ \nTim’s lips brushed his ear, breath hot, bouncing back against his face, as he tongued at the other boy’s earring, taking it between his teeth and tugging lightly. Kon broke off with a gasp and Tim let his lips quirk upwards in smug satisfaction as they trailed back down his neck. \n‘You can’t believe that?’ He prompted, pulling back and turning his attention to his milkshake with an amused smile.\nKon looked at him, eyes dark, lips curled into a wicked grin and Tim swallowed involuntarily. When Kon spoke his voice was a whisper, barely audible over Damian and Jon’s ever-intensifying argument.\n‘I can’t believe you thought you were gonna get away with that.’\nAnd then hands hooked behind his knees, hoisting him up and Tim barely had time to scoff an honest  I didn’t  - because,  really, he didn’t. He’d been hoping for the opposite actually and well, when had Kon ever denied him - before lips claimed his bruisingly. \nKon moved and Tim crossed his ankles around the other boy’s middle, pressing their chests flush together, one hand clutched tightly at the back of Kon’s neck, the other slipped up to tangle in his hair. He could hear noises of disgust behind them, growing more distant with every step. Embarrassed protests. Fake retching. \nTim grinned into Kon’s mouth.\nThe Cave was quiet and comfortable in the way that it sometimes was after a relatively simple patrol. No one had anywhere to be or anything strenuous to do that couldn’t wait until morning and the relief was palpable. Tim could practically feel the tension of the day dissolving as everyone relaxed.\nIt was nice, homely in a way that Tim was hesitant to associate with the Cave. Too often it was the backdrop for disappointment, harsh scoldings, masked faces, and bitter arguments and it felt a little precarious to link it to the Manor. Right now, however, it was as comfortable as the plush couches upstairs. \nTim could hear the whirring of the Batcomputer, the humming of the blood pressure monitor, and the sound of Damian grumbling - a few choice words that Bruce was pretending not to hear - from where he sat, cross-legged on the floor with a needle, thread, and some fabric, only half out of his Robin uniform.\nHe was dressed in bright green boots, black tights, and a blue Nightwing sweater. It was equal parts endearing and ridiculous but Tim didn’t say anything, humbled by the knowledge that he’d put together much worse outfits when he was tired after patrol. \nHe turned to Bruce, taking in his tight-lipped expression as he sat by the medical cot, fingers drumming impatiently against his knee. The corners of Tim’s mouth turned upwards and he reached out to poke a finger into one of the frown lines on the man’s cheek.\n‘What’s wrong, huh? Can’t function without Alf?’ he teased, swinging his legs back and forth off the edge of the cot like a toddler on a swing set, ‘how many days ‘til he’s back?’ \n‘Three,’ Bruce replied tersely, eyes flickering behind Tim, ‘it takes two to make any of you  stay put.’\nTim glanced over his shoulder, grinning when he saw Jason perched on the medical cot behind him. He looked seconds away from fleeing as he listened to Dick’s obvious manipulation. \n‘I think Dick is doing a decent job. He stayed to be checked over at least. Small wins,’ Tim shrugged and turned back to Bruce. \nBruce fixed him a hard glare, the look of a father that would prefer it if all of his children stayed in the house forever, before shifting it to the side and raising an eyebrow.\n‘Are you going to turn up every time my son’s heartbeat jumps a little?’ his nose wrinkled in distaste. \nTim looked up at Kon to see him rub the back of his neck awkwardly. \n‘Pretty sure this is the first time I’ve done that unwarranted.’ \nBruce grumbled in response - something about well, one of you did and what’s the difference and Tim wondered if Jon had actually turned up that many times or if Bruce was just overdramatic - before busying himself with the blood pressure monitor. \n‘As expected, you’re fine,’ he declared, removing the band from Tim’s arm with a huff and a pointed glare at Kon, ‘it was just the fall that got your heart going. Alfred would call it healthy adrenaline.’ \n‘Alfred  would be a lot nicer to my guests.’\nBruce ignored him, padding back over to the Batcomputer. He collapsed into the chair and his shoulders slumped over the control panel.\nTim leaned against Kon absently and watched Damian stab himself with the needle and stick his thumb in his mouth, face drawn in frustration. Tim snorted and Damian’s retaliating glower could’ve leveled a city if he’d had heat vision. \nTim just grinned wider and pressed his cheek into the soft fabric of Kon’s t-shirt. He smelled of something sweet, and there was flour smeared across his jeans. Tim wondered if he’d been helping Ma bake before he’d dropped everything in a panic to get to Gotham.\n‘Thanks for coming, I guess,’ he chuckled, feeling a little guilty for dragging him away. Still, out of all the things his traitorous heart had alerted Kon to this was far from the worst. \n‘Anytime,’ Kon replied without hesitation, ‘even when I’m not wanted, apparently.’\nTim tilted his head to blink up at him. His eyebrows were furrowed and he chewed at his cheek. His gaze burned into Bruce’s back as if that alone could ease the man’s disapproval. \n‘You’re always wanted,’ the reassurance escaped him naturally and Kon turned to look at him with an amused huff. \n‘Not by  him.’\nTim almost laughed. He wanted to tell him not to worry, that Bruce was dramatic and almost as petulant as Damian when it came to the Supers, but his thoughts scattered when he saw the way that Kon was looking down at him, gentle and affectionate, like he was the only important thing in the world. \nTim swallowed. He knew that Kon was the only important thing to him. Well, perhaps only wasn’t the right word. It was more that all of the other important things paled in comparison. Conner was the only thing that felt necessary, the only thing that he’d turn his morals for, that he’d raze cities to the ground for, that he couldn’t face losing. \nEverything else felt a lot more trivial as he stared into eyes that were so adoring he couldn’t imagine how he’d ever been uncertain about doing this. \nAnd he was doing it. Now. With no prior warning or preemptive conversations with any of his family except for that one with Damian. He could apologize to Kon later if he needed to. \nHis hands came up to clutch at Kon’s t-shirt, tugging and- he stifled a burst of laughter. Conner was distracted and pulling at him felt like trying to move stone.\n‘Can you come here, please?’ Tim asked quietly, a fond smile tugging at his lips. \nStill, quiet felt loud in the Cave and Tim could feel eyes on him. He knew that everyone could hear him even if they were acting like they couldn’t. And, he knew that Conner heard his heartbeat surge in response to that thought because realization dawned on his face and he mouthed a small oh.  \nThere was a moment of pause before he grinned widely, in a way that took Tim’s breath away, and then he was leaning down. He moved slowly as if he was giving Tim time to move away and change his mind. \nTim didn’t. He pulled his knees underneath him and pushed up on his heels, letting their lips brush before fitting them together firmly. His palms pressed against Kon’s chest and one of Kon’s hands moved to cup the back of his neck. Even with his family in the room, there was nothing less searing about the gentle brush of a thumb against his jaw. He assumed it was supposed to be reassuring but that only made his blood surge faster. \nThe kiss barely lasted a few seconds but it was enough to make him sway when they parted. His heart pounded and his breath escaped him in little gasps but looking at Kon, staring into fiercely adoring eyes, made him feel alright. He placed a soft, reassuring kiss to the tip of the other boy’s nose, blushing at the responding chuckle. \nHe looked down, very aware that the Cave had shifted from quiet to silent. Bruce had stopped typing and his older brothers had stopped bickering. Tim felt heat creep up the back of his neck, all the way to the tips of his ears.\nIt lasted for a beat. Then. \n‘Can no one in this family get a fucking room? There’s plenty. It’s a-’ \n‘Well, perhaps if you gave up one of your three, Todd,’ Damian continued to sew, barely looking up as he spoke, ‘now is as good a time as any to inform you all that I am not heterosexual and ah-’ he inhaled sharply through his teeth as he stabbed his finger accidentally with the needle. He rethreaded it, holding the end of the cotton in his mouth before continuing distractedly.\n‘Anything that you say to  him, I will be taking personally.’ \nThe final word came out harshly, a little protective and a lot defensive and Tim felt Kon smile into his hair. \nJason hummed, murmuring an affectionate,  ‘brat.’\nTim met green eyes and saw his own  holy-shit-the-kid-is-fucking-adorable  mirrored there. Suddenly, he could breathe a little easier. \n‘He’s right, Jay,’ Tim smiled hesitantly, looking down again when Jason turned that fond expression to him, ‘you’re never here so why do you need three bedrooms?’\nHis voice faded to an embarrassed mumble and he picked at the sheet on the cot.\n‘Well, I wouldn’t call the library a bedroom although I am glad everyone has agreed that it’s mine.’ \nTim leaned against Conner and stared hard at his knees. His teeth worried the cushion of his lip and- He didn’t need Bruce’s approval.  He didn’t. \nBut, fuck, he wanted it. \nAs much as he’d wanted it when he was Robin. \nThe want was almost urgent, overwhelming his senses and making his muscles twitch. \nThat was the excuse he’d use for startling so violently when Dick’s hand slipped across his shoulder. It snaked across his chest and to his other arm, tugging him into an awkward half-hug. \n‘Just to be clear,’ Dick’s voice was sincere and soft, and his chin moved against Tim’s shoulder, ‘did you just come out to us?’\nTim’s breathing stuttered and he swallowed, chest tight, before nodding. He opened his mouth to confirm it verbally, but his tongue felt heavy and no words came, so he settled for nodding again.\n‘Just checking, because we can ignore that slip if it was an accident. We’re good at repressing-’\nTim snorted and shook his head, emotion settling in the base of his throat as he leaned into Dick’s hold. The arms tightened and after a moment of slow breathing and clenched eyelids, Tim spoke hoarsely, \n‘I meant to do it.’ Saying the words felt like someone was undoing restraints wrapped around his chest.\n‘Good,’ Dick murmured, ‘because I really don’t think I’d have been able to stop myself from doing this.’ \nDick’s hand fell from Tim’s back as he moved forward and reached out to pinch both of Conner’s cheeks, expression utterly delighted. Tim fought - he really did - to suppress his amusement but the perplexed look on Kon’s face made his chest tighten and tighten until laugher burst out of him in breathless gasps. Kon turned red and his eyes narrowed and Tim grinned wider. \nHe couldn’t tear his gaze away from Kon, expression mercilessly teasing, but when his older brother spoke he heard the smile in his voice. \n‘You’re cute together.’ \nTim grinned, reaching out to pinch Kon’s cheeks himself only to receive a warning glare, and strong, unbreakable fingers around his wrist.\n‘Thanks, Dick.’ \nTim blinked up at Kon innocently and he huffed, releasing the grip to lace their hands together. Tim supposed it was a compromise. He settled against his side and watched Dick walk over to Damian. He sat behind the kid, arms wrapping around him, legs encasing him in a way that made him look small. \n‘Happy for you too, sweetest.’\nEven his scowl couldn’t hide the way he swelled at the words. \n‘See,’ Tim reassured, smile still on his face, ‘it’s not just you,’ he broke off with a yawn, ‘Dick’s just like that.’\nKon hummed and his thumb brushed along Tim’s knuckles. A caress that never failed to send electricity buzzing through his veins.  \n‘Tired?’ he asked, a smile in his voice. \nTim bit his lip and inclined his head in a non-answer. The touch on his hand and the warmth pressed against his side was distracting but there was still a tightness in his chest. And-\nKon was on the right track. Tired or not, he needed to go to bed. He needed to leave before he did something stupid like ask  Bruce if he approved. Before he let someone else’s opinion taint his own. \nHe gave a delayed nod. \n‘Turning in doesn’t sound like a bad idea.’ \nHe inched forward-\n‘Goodbye, Conner.’\nTim’s movement stuttered and he clenched his fists. Something scared and hopeful and eager bloomed in his chest. He tried to tamp down on it. He didn’t need approval.  He didn’t. \n‘You’re welcome to stay in one of the guest rooms, the beds are comfortable I just assumed you would prefer to go home,’ Bruce stood up to flick through one of the filing cabinets. ‘Unfortunately, Alfred isn’t here, he usually makes an impressive breakfast.’ \nHe said it absentmindedly, if a little woefully, and Tim’s brain faltered when he heard Dick snicker. He swallowed the emotion choking him and tried to gather his thoughts, noting distantly that there were eyes on him and how was he supposed to feel?  How was he supposed to respond to that?\n ‘Bruce,’  he tried to whine but it was halfhearted, voice embarrassingly wobbly and eyes too warm to approximate any semblance of frustration. Bruce met his gaze, face softening.\n‘No boys in bedrooms until you’re forty, Tim. You know the rules.’ \nDick grinned wickedly. \n‘Oh,  I hope you know that on my fortieth birthday I’m gonna bring home  so many  boys and-’\n‘Stop,’ Bruce grimaced, ‘please, Dick, just-’ he pinched the bridge of his nose, ‘when Alfred gets home we can have a discussion okay, Tim? I’ll  consider  lowering it to thirty-five.’\n‘You hear that, Dames? You might get him down to thirty.’ \nTim snorted wetly, and his voice came out hoarse, ‘okay.’ \nHe wanted to have that conversation, he wanted ridiculous boundaries that he and Kon could laugh over, he wanted to worry about being caught breaking dumb, overprotective rules. Bruce turned to Conner. \n‘My son is tired so what will it be? Should I prepare a guest room?’\nTim blinked up at him with watery eyes, managing a very wet smile at his flushed cheeks and nervous shifting. \n‘I- No- I-’ Kon swallowed and straightened up, ‘thank you for the offer, Sir, but I already told Ma I’d be home.’\nTim exhaled a shaky laugh, heart surging with affection. He really couldn’t- He- There was no one like him. He was just so- just- He squeezed the hand in his as tight as humanly possible. He was ridiculous. Completely, utterly, ridiculous.\nAnd Tim was entirely gone for him. Thoughts incoherent, breath catching, and heart stuttering embarrassingly when the boy pressed a chaste kiss to his hairline. \n‘Later,’ he promised quietly, before turning on his heel and leaving with a quick wave and well-mannered goodbye Mr.Wayne. \nFor a moment, Tim stared after him, heart pattering in his chest, pressure gathering behind his eyes, and then words were tumbling from his lips, \n‘You like him?’ It was a question; an insisting, desperate one, and Tim bit his lip hard because why did he ask?  He didn’t need approval.\nBruce made a soft sound.\n‘I like seeing you happy,’ he paused, letting Tim see the sincerity in his face before turning back to his work. A gesture to make him feel comfortable, to ease the pressure of being scrutinized.  \nHe marked a folder, pen scratching against paper, ‘That goes for both of-  all  of you.’\nDick had already resumed whispering to Damian about something that made the kid’s face scrunch in embarrassment (Jon, probably, if anyone could get him to talk about his crush it was Dick) by the time that Tim replied.\n‘Okay.’ His voice was a barely-there whisper and Bruce just nodded in acknowledgment. \nA hand tugged sharply at his hair and whipped around intending to glare at Jason but- he didn’t have the energy. He just shuffled over and patted the space beside him on the cot. He grinned as Jason rolled his eyes but sat down anyway. \n‘Are you okay?’ Tim asked, scanning over him warily, ‘that hit to the head looked pretty nasty. You sure you’re not concussed? How many fingers am I holding up?’\nJason chose to ignore him, which he did fairly often actually - Tim filed that realization away for later - and turned to stare directly into his eyes. \n‘Are  you happy?’ \nThe question took him by surprise because he thought that much had been obvious. \n‘Yes,’ he answered without hesitation. \n‘He’s nice to you?’\n‘Yes.’\nThere was a pause.\n‘You remember last time?’\n‘Yes.’ The word came out hoarse and he choked to force it through his lips. Because yes he remembered last time. He knew that being together would only intensify the hurt if he ever lost him again. They’d spoken about it and- Well- It would hurt Tim unbearably anyway. So he’d thrown caution to the wind because what was adding a little more hurt to unbearable pain. \nIt didn’t matter anyway. Tim wasn’t going to let anything happen to Conner. Not while he lived. Jason seemed to notice how he’d stiffened because he squeezed his shoulder in reassurance. \n‘I was just checking. Nothing to worry about,’ he paused, ‘the kid? Really? Out of all the people to confide in you chose the-’\nTim cut him off with a good-natured hit to the torso before leaning against a leather-clad shoulder.\n‘I- Damian was an accident. A  good one,’ he admitted quietly, swallowing before he continued, voice soft. \n‘If it means anything I almost told you that night in the diner. It was a Thursday I think? Anyway, they mixed up our order and we ended up with banana milkshakes instead of strawberry. We had to wait for like ten minutes for them to fix it and it was annoying… but it was also kind of a perfect opportunity. And then Dick turned up and Cass was there and the moment just slipped away.’\n‘I remember,’ Jason mused, offering him a lopsided smile, ‘probably a good thing that you didn’t. I hid it well but I was pretty pissed about those milkshakes.’ \nTim laughed and his body shook with it, little chuckles escaping him - because he had not hidden it well - as he watched Dick stroll towards them, eyes narrowed suspiciously. \nStill, he didn’t ask, he just leaned against the cot, lips tugging upwards in a conspiratorial grin. \n‘It seems,’ he drawled the words slowly, as if he was tasting them on his tongue, ‘that  we  need to pay a visit to Kent Farm.’ \nJason’s face stretched into a devilish smile. \n‘I suppose there are other things I need from the vault anyway.’\nTim clicked his tongue and jumped up from the cot.\n‘Well, that’s my cue.’ \n‘What? You don’t want to listen to how we’re gonna threaten the kid?’\n‘Kids,’ Dick corrected and Damian scowled, betrayed, and recognition flitted across Jason’s face. He grinned wider, meeting Tim’s eyes and arching an eyebrow.\n‘An accident, huh? Has someone been sneaking-’\n‘Goodnight,  Jason.’ \nTim’s voice was firm and he turned on his heel. He wanted to end the night on a high,  not on a lecture about sneaking out.\n‘Before anyone leaves,’ Tim paused at the sound of Bruce’s voice, it was entirely neutral, ‘is there anything additional I should be buying? Anything  important  that anyone needs?’ \nThe question was carefully directed at everyone but Tim knew it was for him and it made his cheeks burn. He heard Dick barely stifle a laugh and he was suddenly very glad that his back was turned. He took a breath. \n‘I’m going to bed.’\nHe walked towards the stairs, strides long and purposeful because he was not having this conversation with Bruce.  Especially not in front of his brothers. \n‘Don’t hesitate to-’\n ‘Goodnight Bruce,’  he said pointedly at the same time as Damian snapped,\n‘Father, you are embarrassing yourself and him,’ Tim could hear the embarrassment in Damian’s voice and he was suddenly confronted with how young his little brother actually was. He clearly wasn’t the only one because he could imagine the realization - that he probably should’ve waited to catch Tim alone - dawning on Bruce’s face well enough. \n‘No one needs anything,’ Damian continued, tone unimpressed, but there was something thoughtful in it, ‘although, I do think it would be impressive if I were to drive the Batmobile-’\n‘No.’\nTim threw his head back with silent laughter because of course and his chest swelled with fondness.  \n‘Why not?’ Damian’s voice was defensive, ‘I can drive.’\n‘No.’\nTim grinned and the voices faded away as he took the stairs two at a time, leaving the Cave, and heading straight for his bedroom. One way or another Damian was going to get his hands on the Batmobile at some point and Tim was going to make sure he was there for the fallout.\nHe shut the bedroom door behind him and took a second to relish the quiet. \nThe empty space was easier to fill, easier to feel things in, and the softness in his chest seeped into the silent room. Alone, he could think clearer and for a second he thought he might collapse with the weight of it all. \nHis eyes fluttered shut and he let himself take a moment to breathe. \nFeeling such overpowering emotion was scary, like looking down from a height. But he reached out for it tentatively, trying to remember the last time he’d been able to breathe fully, with his whole chest. The last time he’d felt so relieved. If he’d ever felt like his parents had less of a hold on him. \nIt was like the roots of everything they’d said, the standards they’d held him to, the words that wrapped around his heart and splintered every relationship he’d ever made; filling it with doubt and insecurity and fear had been unearthed. \nAnd he loved them, he really did - and that might be half of the problem - but he’d never felt so separate from them. He’d never felt so at ease. \nHe pushed away from the door and padded around his room. He put away some laundry, potted a couple of pens before giving up and collapsing onto the bed, pulling out his phone. He replied to a few messages, scrolled various apps, let his finger hover over that game that Kon told him he got way too worked up over. \nHe’d only just opened the app when there was a light knock at the door.\n‘Hello?’ he asked, sitting up on his elbows. \nThe door creaked open and Damian stepped into his room, uncharacteristically hesitant. He closed the app. Probably for the best.\nDamian took a moment to look around and Tim noted that his face wrinkled when his eyes landed on the mess. He wondered briefly if two of his three brothers couldn’t step into his room without wanting to strangle him. Because of the mess, obviously. Not just in general.\nThere were newly printed photos amongst the others pinned to the wardrobe door. Tim didn’t miss how Damian’s gaze lingered on them. \n‘You left this,’ he said after a moment, holding out a bundle of clothing and swallowing in a way that might have been nervous. \n‘Thanks,’ Tim took the clothing and draped it carefully over his pillows. Kon wouldn’t appreciate his jacket joining Tim’s on the floor.  It’s expensive Tim, he’d say.  I care about it more than I care about you,  he’d say.\n‘Are you okay?’ he ventured tentatively. It wasn’t like Damian to look so subdued around him. \nDamian exhaled. His entire body untensed. The words seemed to reassure him of something. Tim just stared, confused. \n‘I am fine. Are you?’\nTim nodded. \n‘Yeah. I’m good,’ he paused to stand up and brush down his sweats, ‘working on a way to steal the Batmobile for you though.’\nDamian’s lips twitched and he looked away. Staring at his feet for a long moment.\n‘Thank you, Timothy,’ he said quietly. \nTim looked at him, expression soft, heart-tugging. Tim was pretty sure he was thanking him for more than just an outrageous plan for theft but he couldn’t pinpoint what. \n‘It’s okay,’ Tim murmured sincerely, ‘thank you, Dami.’\nThere was a beat of silence. It was comfortable and understanding. His little brother didn’t even scowl at the nickname. And then there was a soft tumbling sound.\nDamian's lips turned up knowingly.\n‘I’ll leave you to your Kryptonian.’\n‘I- uh- yeah- I-’ Tim stammered, a half-embarrassed, half-apologetic smile curling his lips, ‘he doesn’t have the best of timing.’ \nThey stared for a second longer and then Damian turned on his heel. He paused in the doorway. \n‘Father is off-world next week. It will be easier to steal the car from Richard.’\nTim grinned. \n‘I’ll see what I can do.’ \nThe door shut and he stood for a moment, heart light, smile on his face. And then he spun around and opened the window. \n‘Sir?’ he raised his eyebrows, ‘really?’ \nKon popped up, just beneath the window frame. \n‘He’s Batman, Tim,’ he smirked and Tim reached out to tug him into the room, ‘and I’m fucking his son who, by the way, seemed to like that a lot.’\nTim’s cheeks heated and he drew his lips between the teeth. So he’d found the politeness attractive.  Sue him. \n‘You know, you’re gonna have to work on being quiet,’ he snarked as Kon stumbled and regained his balance. Tim looped his arms around his neck, ‘now that they know they’ll be paying more attention.’ \nConner’s hand pressed into his lower back and then he slotted their lips together, warm and slow and sliding. A hand slipped under Tim’s t-shirt, thumb pushing into the center line of his abs and Tim dug his fingers into the soft skin of Kon’s neck, tugging him closer and gasping a little when a tongue glided across his lower lip. Kon pulled back, cheeks flushed and lips parted in a breathless chuckle. \n‘I don’t think I’m the one that’s gonna have trouble being quiet.’ \nTim made a show of rolling his eyes before yanking him back down. \n‘Don’t make promises you can’t keep.’ \nKon grinned into his mouth, ‘Never.’"
}