{
    "id": "31695131",
    "url": "https://archiveofourown.org/works/31695131?view_full_work=true",
    "author": [
        "BelleAmant"
    ],
    "title": "Perception",
    "rating": "Not Rated",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Aizawa Shouta | Eraserhead & Midoriya Izuku",
        "Midoriya Izuku & Yamada Hizashi | Present Mic",
        "Midoriya Izuku & Yagi Toshinori | All Might",
        "Class 1-A & Midoriya Izuku",
        "Eri & Midoriya Izuku"
    ],
    "characters": [
        "Aizawa Shouta | Eraserhead",
        "Midoriya Izuku",
        "Class 1-A (My Hero Academia)",
        "Yamada Hizashi | Present Mic",
        "Yagi Toshinori | All Might",
        "Eri (My Hero Academia)"
    ],
    "additional_tags": [
        "Personality Swap AU",
        "Actor Midoriya Izuku",
        "Quirk Shenanigans (My Hero Academia)",
        "Midoriya Izuku Has a Quirk",
        "Midoriya Izuku Has One for All Quirk",
        "I finished this and immediately slammed it up so lets get going",
        "Boku no Hero Academia | My Hero Academia Manga Spoilers"
    ],
    "language": "English",
    "series": "Part 24 of Personality Swap AU",
    "published": "2021-06-02",
    "completed": "2021-06-17",
    "words": "8,724",
    "chapters": "2/2",
    "comments": "811",
    "kudos": "12,546",
    "bookmarks": "525",
    "hits": "109,741",
    "summary": "<p>\"Did you just use Bakugou's Quirk?\"</p>\n<p> </p>\n<p>Things are changing.<br>(What's going on with Midoriya?)</p>",
    "notes": "<p>I hope you enjoy! ;D</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>It's six in the morning where I am and yes, I did indeed wake up early before I have to go to work just to finish this and post it.<br>Enjoy!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>What did you think? Let me know in the comments!<br>Until next time! &lt;3</p>\n<p>What did you think? Let me know in the comments, and I'll see you guys in the second part &lt;3</p>",
    "text": "\nIzuku Midoriya gets up bright and early on Monday morning, ready to begin the day. He moves about seamlessly, goes through his morning workout without a second thought, then returns to his room without delay. It’s all familiar, these idle motions.\n\n\nMindless work, almost, thoughtless in their actions, no reactions to be had. It’s easy work, stressless, the simplicity of a routine known by heart, one Izuku has lived for quite a while.\n\n\nIt gives him time to think.\n\n\nAnd that’s what Izuku does, thinking, recalling the conversation from Friday afternoon as he prepares for the day.\n\n\n\n“Midoriya.” Aizawa’s normally monotone voice was filled with shock, a shock racing through Izuku’s heart all the same. “Midoriya, did you just use Bakugou’s Quirk?”\n\n\n\nIzuku buttons up the white dress shirt, scarred hands shaking only slightly with the motion.\n\n\n\nHe’s mimicked Kacchan’s Quirk before, of course. Did it so many weeks ago, on the first day of the impersonations, on the first day of the personality swap assignments.\n\n\n\nBlack dress pants are next, slipped on, the shirt tucked in neatly. \n\n\n\nHe made a crude parody of Kacchan’s signature blasts, using One for All to aid him, flicking air in a way that was reminiscent of the boy’s AP shot style.\n\n\n\nA dark gray tie comes after, tied in a way that takes thrice the time as Izuku’s normal style. Much more constricting, much more elegant.\n\n\n\nHe’s mimicked Kacchan’s personality, too. Tried being brash and loud, confident and sure. But being Monoma was different.\n\n\n\nDress shoes get tugged on, tapping against the wooden floor as he shifts around. \n\n\n\nMonoma isn’t Kacchan, Izuku knows that. Anyone would be able to tell, of course. Sure, some may have called both arrogant blonds, and Izuku can agree that both seem to like using insulting nicknames more than they do people’s real names, but that’s where the similarities begin and end. Monoma is less sure, more scared. He’s been viewed as weaker, lesser, because his Quirk is only strong when with others. Alone, Monoma is practically Quirkless.\n\n\n\n\nAlone, Monoma is just like Izuku was. \n\n\n\nIzuku adjusts the cuffs on his sleeves, makes sure that they’re buttoned together. It looks unprofessional, otherwise, he idly notes.\n\n\nAnd then he’s lost, back in the fog of his own mind.\n\n\n\nMonoma is just like Izuku was, if a little higher up on the totem pole of life. Scared, deemed beneath others, considered powerless despite giving it their all to do all that they could.\n\n\n\n\nPerhaps that’s why Izuku slipped into the role so easily, so fluidly, as if being Monoma was as easy as breathing.\n\n\n\nIzuku picks up the final piece of his costume, inspects it. Looks for any grime or grit, anything that could mess up his appearance.\n\n\n\nIzuku has always found a way to connect to his character. For Kacchan, it was the familiarity, the past they shared. He had extensive knowledge on his childhood friend’s habits, speaking patterns, and general mannerisms. For Aizawa, he analyzed all that he could, referenced notebook pages with moonlight-aided scribbles from a hand that twitched with excitement and anxiety. Nedzu was his brain, his analysis. Present Mic was his joy, All Might his dreams. Midnight was the confidence he always wanted, Snipe the carefree life he yearned for. Tsukauchi was a dream of a world, if All Might hadn’t changed his mind. Gran Torino was a memory of a week of chaos, of a time spent learning to make One for All his own. Recovery Girl was a different dream, a half-baked one, in which Izuku had promised himself that, if all else failed, he would do his best to help by working in the medical field. Best Jeanist was the man on billboards, a constant presence and source of inspiration, but not an idol. Shinsou was the boy Izuku thinks he would have been, if he were a little more tired and a little less lucky. Shigaraki was an odd parallel, someone who reminded Izuku of a boy he could’ve become, if he were less willing to fix what was broken. Miruko was the shining light Izuku has always hoped to be, the carefree nature that he strives to obtain. Mrs. Joke is the laughter that Izuku hoped to keep, to offer to the world. Hatsume was a different world, one in which Izuku let himself breathe a little easier, and create as a means of being a hero. Hawks embodied the topic of personas in Izuku’s mind, the ability to switch in and out of a character. Even Toga had a connection, if only the urge to put on a mask and act.\n\n\n\nHe finds nothing.\n\n\n\nBut Monoma’s feelings were a raw, internal thing, so close yet so far to the boy Izuku used to be. The boy who wanted a chance, who wished so desperately for a Quirk if only so he could belong, so he could \n\nmatter\n\n.\n\n\n\n\nSo when Izuku saw Kacchan, when he reached his hand out?\n\n\n\nIzuku lifts up the metal brace, slipping it onto his shoulders, sighing as it covers up the majority of his face, leaving only his eyes to peer into the mirror.\n\n\n\nHe could not help the primal urge to \n\nwant\n\n, to reach out and \n\ntake\n\n.\n\n\n\n\nAnd a copy formed within his body, and a bang from his very fingertips.\n\n\n\n\n“Yes.”\n\n\n\nIzuku looks away, feeling far more tired than before.\n\n\nYes, Izuku Midoriya had used Explosion, because he had used Copy...because he had used something else, something Izuku never thought that he would have, not for himself.\n\n\nNot like this.\n\n\nBut Izuku Midoriya had a Quirk.\n\n\nAnd now it is up to him to figure out what it did.\n\n\n-----\n\n\nIt’s a beautiful Monday morning, just like most others, if perhaps a little cooler than the one before. The weather is changing, the seasons going, and there are only a few weeks remaining in the second term. While this does guarantee the approach of term finals, it also offers a reprieve in the form of winter break, a time that the students of 1-A cannot help but look forward to.\n\n\nBut this is not where their minds are, not today. No, today their thoughts are elsewhere, in another place.\n\n\nAnother time, to be more precise, and it is the same time for each student sitting at their desk.\n\n\nFriday afternoon. \n\n\nBecause no one quite understands what happened that Friday afternoon. Most of them were busy sparring against their own opponents, the majority did not see what had occurred. All that they remember is an especially jarring explosion, and then a silence from that vicinity. They can recall assuming that Bakugou or Monoma had simply used too much power, that Kirishima or Midoriya had been \n\nhurt\n\n, and stopping in their motions to check on the two.\n\n\nOnly to find Aizawa leading a shaking Midoriya away, his teammate and opponents staring after him with perplexed expressions.\n\n\nOnly to hear that it had been Midoriya who had let loose the explosion, not the one to receive it.\n\n\nAnd that….that is intriguing, and confusing, because there is no talk of gear from Hatsume, no explanation for how such a feat is possible without a Quirk.\n\n\nUnless there \n\nis\n\n a Quirk.\n\n\nAnd the students of 1-A are curious, of course, and they want to know more. But...\n\n\nBut Midoriya had looked panicked, whenever someone brought up the incident. His eyes would water and his shoulders would shake, and that was more than enough to get whoever was curious to stop asking. Conversations would be shifted, new topics transitioned to in the blink of an eye.\n\n\nAnd now it is Monday, and the students of 1-A are as clueless as they had been that Friday afternoon. But they will not pester Midoriya for answers, not when it clearly hurts him so to think of the moment. No, they will just treat him as they always have, as their friend Midoriya and nothing more.\n\n\nThis plan is halted the moment the bell rings. Because with the bell comes Aizawa, and with Aizawa comes Midoriya.\n\n\nAnd Midoriya isn't dressed as himself.\n\n\nDress shoes click against tiled floors, perfectly pressed pants show no creases and a perfectly done shirt and tie have no wrinkles or odd folds. A metal brace rests upon his neck, covering the bottom of his face.\n\n\nAnd doing nothing to hide the dismissive yet assessing gaze that Midoriya sends their way.\n\n\nMidoriya stands motionless at the front, hands clasped behind his back and head tilted in a way that shows deference to Aizawa, and yet allows him to continue his sweep of the room. It is a gaze both piercing yet dull, and all the more unsettling thanks to this odd duality.\n\n\nAnd the students of 1-A cannot help but be surprised that Aizawa chose to give Midoriya an assignment, but they are more surprised by \n\nwho\n\n Aizawa has chosen for their peer.\n\n\n\"I have been tasked with watching over Kurogiri for the day. If anything happens, inform me immediately,\" Aizawa warns, and the class reels back in shock.\n\n\nA villain. Izuku Midoriya has been set to play a villain, even after Friday's events.\n\n\nBut they do not complain, partially because they know their classmate, and know that he would not do an assignment if he was uncomfortable. He has promised to do so, and Midoriya hates breaking promises.\n\n\nThe other part is fueled, however, by the way that a single glance from the current Midoriya is enough to send shivers up the sign of his peers. Perhaps it is not the best time to speak out.\n\n\nPerhaps not, indeed.\n\n\nAnd so Monday begins with confusion, wonders, and worries.\n\n\n(Well placed worries, not that they will be truly noted as such.)\n\n\n(Not until later.)\n\n\n-----\n\n\nHizashi Yamada isn’t quite sure what he was expecting out of today, but it sure wasn’t, well, \n\nthis\n\n.\n\n\nThis, of course, being the way that the class seems to evade Izuku Midoriya’s space, the boy exuding a rather...eerie aura as he sits calmly in his seat. \n\n\nThe boy’s apparel is far more formal than usual, and as much as Hizashi isn’t surprised that Shouta went for a new swap today- even with the rumors of Friday’s occurrence running through the halls- he is surprised but how...silent today’s swap is.\n\n\nAnd Hizashi cannot help but be unnerved by the sheer lack of reaction from Midoriya, by the way that the boy simply stares straight ahead, watching Hizashi with an empty gaze. The rest of 1-A, Hizashi can tell, are just as affected, as much as some try to hide this fact. \n\n\nIt’s something about how little Midoriya moves, the lack of a reaction to the actions that go on around him. His hands stay still no matter what Hizashi says, the boy never reaching for his pencil nor his notebook. His eyes only move when someone says the name \n\nKurogiri\n\n, the only sign of who Midoriya is supposed to be past the brace that rests on his face and covers the bottom half of his face. There is no reaction otherwise, no words spoken, nothing uttered even once.\n\n\nAnd this is rather...odd, as Kurogiri spoke before, has been reported to have spoken during the U.S.J. attack when declaring the intentions of the League to this very class, has had witnesses recall how he was the one to reveal Shigaraki’s name when conversing with the man.\n\n\nYet here? Here, Midoriya remains silent, simply watching and waiting.\n\n\nBut Hizashi isn’t sure what Midoriya is waiting for, and that’s one of the worst parts of it all.\n\n\nAnd for a moment, Hizashi cannot help but look into Midoriya’s eyes and think of them as lifeless, like the light in them is only a forcefully created illusion to hide the decay behind the source.\n\n\nBut Kurogiri is alive, Hizashi knows, and so he brushes the thought aside, lets himself believe that he is merely overthinking Midoriya’s acting as he has before.\n\n\nAnd yet when Midoriya’s eyes flash yellow, even if only for a moment… this time, Hizashi lets the image stay in his mind.\n\n\nHe won’t turn a blind eye to such an instance, not anymore. \n\n\nNot after Friday.\n\n\n(Because a part of Hizashi wonders how many little moments have happened, how much sooner they all could have realized that Midoriya’s acting was more than just the hobby, that it was something ingrained in the boy without the greenet’s knowledge.)\n\n\n(Wonders if it would have made a difference, and how.)\n\n\n(And later on, Hizashi will wonder if catching the Quirk’s appearance earlier would have changed the outcome of today...but that is for another day.)\n\n\n-----\n\n\nThe bell for lunch rings, and nineteen of the twenty students of 1-A are up and out of the classroom mere moments after, all ready to head to the cafeteria.\n\n\nThe final student stays still, perfectly poised in his seat. \n\n\nWell, that's almost correct. Izuku Midoriya does, in fact, move, but only to reach out and grab his lunch, and then to eat. The motions are simple, efficient, precise.\n\n\nHe stops moving the moment he is done, empty containers packed away and nowhere to be found. He sits in his chair, stares straight ahead, and if anyone were to glance in, they would note how even Midoriya’s breathing is minimal.\n\n\nBut no one glances into the room, because they are all too wary of the character Midoriya has become.\n\n\nA shame, truly, for it means missing how Midoriya acts as if he is nothing more than an NPC awaiting an order.\n\n\nPerhaps, if only one person had looked his way, they would've noticed that Midoriya does not move without a goal, that Midoriya acts under predetermined commands that only he knows of.\n\n\nPerhaps it would have reminded them of another creature, one first seen at the U.S.J., and the story of tomorrow would not have come as such a shock.\n\n\nBut no one sees, and the story of tomorrow has not yet come, and so Midoriya remains frozen until the period ends, and the day goes on.\n\n\nAnd life continues.\n\n\n-----\n\n\nToshinori Yagi has had mixed feelings about young Midoriya’s personality swapping assignments from the very beginning. He was terrified at first, scared by the boy’s ability to switch his act so smoothly, to be so jarringly different from his normal character. \n\n\nTerror changed, however, becoming a calm acceptance to an earnest enjoyment of the boy’s displays, even if Toshinori found himself terrified from time to time thanks to Aizawa’s targeted choices. The swaps were nice, a chance for his successor to shine and stand out, for the world to see the potential that Toshinori had all those months ago. It was a chance for the boy to be himself, for Midoriya to see how much more he was than he had initially believed. \n\n\nIt was a piece of Midoriya untouched by a Quirk, the boy’s brain and talent shining through, nothing that Midoriya couldn’t have done while Quirkless. It was just Midoriya, and always had been.\n\n\nBut then it wasn’t, as revealed by a sudden explosion that originated from his successor. An explosion that sparked a flurry of reveals, of understandings, of brushed aside ‘beliefs’ being noted as perhaps something more.\n\n\nYoung Midoriya had a Quirk, and had absolutely no clue. That much was clear by the way that he had reacted, by the talk the two had had over the weekend.\n\n\nA heartbreaking one, at that.\n\n“I...I can give you One for All back,” Midoriya promised, with shaking hands and teary eyes. “I didn’t- I didn’t know, I didn’t mean to trick you, I-”\n\n\n“I know,” Toshinori said, and he meant it because he \n\ndid\n\n. “But the Quirk is not one that I want back. It’s \n\nyours\n\n, kid.”\n\n\n\n\n“But I have-”\n\n\n\n\n“And now you have another,” Toshinori cut in. “And we will work on this, to help you master them both, until you feel confident enough to see that they both belong to you, and always will.”\n\n\n\nHe had been so frightened, so lost, and yet his first thought was on giving up One for All...Toshinori shakes his head, forces the memories aside. As much as he wants to ponder over this revelation, as much as they all want to, he knows that he must teach.\n\n\nStill, he cannot help but let his thoughts stray to his boy the moment Midoriya and his peers are on the training field.\n\n\nBecause it appears that Midoriya is still doing his acting assignments.\n\n\nAnd for a moment, Toshinori cannot help but wonder \n\nwhy\n\n Aizawa would choose to do such a thing, and then he realizes that the man is likely trying to figure out the Quirk as well. Its features are unclear, after all, and no one is quite sure why it has activated when it did, just that it is tied to Midoriya’s acting. It makes sense, then, to have Midoriya act during hero training, and the rest of the day, as well, in order to give the boy the chance to try unlocking his Quirk yet again.\n\n\nStill, Toshinori cannot help but find a bit of him rather...uneasy, with such a thing. Especially when Midoriya is set to be Kurogiri, one of the League of Villains main, well, villains.\n\n\nBut perhaps that is simply because Midoriya’s Quirk seems to be working, albeit oddly. \n\n\nWorryingly.\n\n\nToshinori sends the students to their own individual spots, separated far away from one another in order to work on their Quirks and special moves, leaving Midoriya in a corner of his own, with more distance from the rest for safety’s sake.\n\n\nAnd Midoriya….doesn’t do much. Not at first, at least. He just stands there, eyes barely moving, unshining.\n\n\nBut then something seems to change, and his eyes begin to sweep over the room, searching, flickering yellow at random.\n\n\nAnd then something shifts, and so does Midoriya, an arm reaching out, hand opening slowly.\n\n\nMist begins to surround him. Dark purple wisps dance up and down his arms, matching portals of shadow opening wide, leading to who knows where. Midoriya tilts his head, opens one wider, snaps it shut.\n\n\nFive more form in an instant, small and misshapen but most definitely there. \n\n\nNo one is working anymore. They haven’t been since the first wisps of fog began to cover the boy, but now they all just watch and wait, keep their eyes on the boy whose eyes are eerily empty.\n\n\nToshinori can’t find it in himself to correct them. He’s too busy doing the exact same thing, watching his boy do something that he never would have thought possible.\n\n\nThe wisps of fog grow in size, denser than before. It is harder to see Midoriya’s arms underneath the misty purple expanse, but Midoriya does not show even the slightest bit of concern. It is as if he has grown desensitized to the fog, as if it isn’t unusual in the slightest.\n\n\nA portal grows wider in front of Midoriya, and the boy steps within it without a moment of hesitation, earning startled gasps from his peers. But Midoriya appears seconds later, halfway across the gym, right beside Bakugou. The action startles the blond, but Bakugou does his best to hide the way he stiffens at Midoriya’s sudden closeness.\n\n\nIt does little to change how Midoriya locks eyes with Bakugou, head tilting a mere fraction as he studies his peer.\n\n\nThe only one who had ever been dragged through Kurogiri’s portals during the summer camp.\n\n\nAnother portal opens, and Bakugou takes a step back, fists raising. Midoriya stares at him, then moves back into the portal. \n\n\nThere is clear relief when the portal snaps shut, and Midoriya ends up across the room once more, and Toshinori cannot help but notice how Bakugou tracks Midoriya more intensely than before.\n\n\nMidoriya flits around a few more times, stepping from portal to portal, from one corner of the room to the next, and then he pauses in the center of the room. Bright yellow eyes flick around, and then both hands reach out, palms out and far reaching.\n\n\nAnd then he makes a wide, sweeping gesture, and dozens of portals form. Some large, some small, but all scattered throughout the space.\n\n\nAll placed exactly where Midoriya had already been, down to the flickering wisps that encompass the edges.\n\n\nArms stretch out wider, fingers splayed, and the portals grow darker and wider. Those nearby stumble backwards, and Toshinori feels the urge to call upon the Quirk he’s long since said farewell to.\n\n\nBut then, like an act of mercy, the bell rings, the portals snap shut, and Midoriya moves with a gait both fluid and stilted, as if the boy is detached and unaware of his own movements, simply following a code that is built into his head.\n\n\nThe fog does not disappear from his arms. In fact, it only creeps further along his body.\n\n\nToshinori cannot wait for the day to end; he wants to see the life return to Midoriya’s eyes as soon as possible.\n\n\n(He’ll get his wish, but not in the way that he expected.)\n\n\n-----\n\n\nIt's nearing the end of the day, and the students of 1-A cannot help but be grateful for such a fact.\n\n\nBecause there are less than ten minutes on the clock, less than ten minutes before the bell rings and school is over, which means that there are less than ten minutes until Izuku Midoriya goes back to being himself.\n\n\nThe students of 1-A, at the end of the day, like the personality swap assignments that have filled their days with excitement and anticipation. When all is said and done, the class cannot help but look forward to who Midoriya will be next, cannot help but wonder how Midoriya will raise the bar for his own talent once more.\n\n\nBut all is not said nor done, and Midoriya is covered in that purple fog that has only grown since hero training, and so 1-A waits impatiently for the day to end, so that Midoriya will become Midoriya once more.\n\n\nEven Aizawa seems affected, today, which makes sense. Midoriya has never been like \n\nthis\n\n, slowly encompassed by a fog of his own creation. It looks as if Kurogiri is trying to take the boy away, or perhaps take him over, and the students of 1-A would not be surprised if Aizawa is thinking of their encounters with the man of mist.\n\n\nThey are, too, after all. Times when Midoriya was far too close to portals, when they all were. The fear that they had felt, the way they had to save themselves. They had been nothing but panicked determination, wild eyed and worried.\n\n\nBut here sits Midoriya, swallowed by the fog that once sent him crashing underwater, and yet his eyes are blank, posture poised yet serene, an artificial peace.\n\n\nHis eyes are one of the only visible parts of him, shining bright beneath the mist, but no one makes a comment. Not when they are so close to it all going away.\n\n\nAnd then, with just two minutes left on the bell, things change.\n\n\nThe classroom door is pushed open, and two people walk in. The first is Yamada, someone familiar, recognizable. The second is much smaller, a little girl with shining red eyes and white hair, one that it takes 1-A a few seconds to remember.\n\n\nEri, the girl Midoriya saved not so long ago. Who looks up to Midoriya as if he personally set the stars and sun into the sky just for her, as if he is the brightest star of all. She looks up to him the way 1-A might their own idols, or siblings, or perhaps even both.\n\n\nAnd now, Eri is looking at Midoriya, mist-covered, yellow-eyed Midoriya, with the same unabashed admiration as always.\n\n\n“Sorry, she didn’t want to wait,” Yamada explains, but everyone is more focused on how Eri races right to Midoriya, arms reaching out and wrapping around the boy’s legs just as he stands up, undoubtedly about to break character. The purple fog dances around the boy, then begins to dim, fading.\n\n\nBut then Eri, in her joy, squeezes Midoriya’s legs tighter and laughs excitedly, horn sparking with her joy, a sign of Quirk activation.\n\n\nAnd Midoriya collapses.\n\n\nAnd everything goes wrong.\n\n\n-----\n\n\nA part of Shouta knew from the moment Izuku Midoriya walked into class this morning that today was a bad idea. There was something eerie in the way that Midoriya’s gaze had gone blank, something worrying in how little the boy seemed to register the world around him. His plans seemed to swap immediately, going from something good to something worth keeping a wary, watchful eye on.\n\n\nA part of Shouta \n\nknew\n\n, and yet he let it continue. Because he is Midoriya’s teacher, and teachers are meant to help their students grow. Shouta knows that Midoriya’s previous teachers failed miserably at this task, and so he refused to let his own doubts interfere with Midoriya’s growth.\n\n\nBecause with the activation of Midoriya’s Quirk- of a Quirk Midoriya clearly never knew he had- Shouta knew that Midoriya would need help \n\ntraining \n\nit, would need to learn how to activate it and how much it could do. Shouta knew that past instances that he had brushed aside as tricks of the light or similar ideas were the beginnings of his Quirk awakening, and knew that Midoriya could do so much more- a surprising yet unsurprising notion for the boy- than before.\n\n\nAnd Kurogiri was chosen on \n\npurpose\n\n. Kurogiri wasn't a pick left to chance, he was carefully studied and decided on. Because Kurogiri \n\nshould have been safe\n\n. His Quirk gave him portals, nothing more. His Quirk wasn't naturally dangerous, not like touches that lead to decay or the ability to wield explosions. It was just \n\nportals\n\n, and Midoriya should have been \n\nsafe\n\n.\n\n\nHe never factored in Eri, or how Midoriya’s Quirk would react to new situations. He never considered the idea that Midoriya could just...collapse.\n\n\nBut one touch from a Quirk-using Eri and Midoriya was dropping, and suddenly Shouta found his life blurring, nothing important except grabbing his kid and getting him to Recovery Girl.\n\n\nAnd that's where they've been, since. It's been at least an hour, maybe more, but Shouta has yet to stray from his student's side. Hizashi dismissed the kids back to the dorms, Shouta thinks, but he can't get himself to go and check. He just can't bring himself to leave Midoriya’s side, to risk missing the moment when Midoriya wakes up.\n\n\nHe just needs his kid to wake up, to prove that he's alright. Until then, Shouta will sit right here and wait.\n\n\nAnd Shouta waits, and waits, and it takes until the middle of the night but Midoriya wakes up, and Shouta is relieved.\n\n\nAnd then he is not, because when he locks eyes with his kid, it is not green eyes that peer back at him.\n\n\nNo, Shouta locks eyes with ones that are a bright, clear blue, and one realization comes to mind.\n\n\nMidoriya may not be Kurogiri anymore...but Shouta isn’t looking at Midoriya, not right now.\n\n\n(Something is terribly wrong.)\n\n\nBright blue eyes stare into Shouta’s own, and they watch him in a way that makes Shouta feel like he’s being analyzed for all that he’s worth. \n\n\nAnd right now, he can’t say for certain that that’s very much at all.\n\n\nBut those eyes keep staring, searching, looking for \n\nsomething\n\n and Shouta just doesn’t know what it is. It must be found, though, because those blue eyes light up, quite literally, shining in the dark for just a moment before glancing away, wandering the empty room. Recovery Girl’s office is odd, eerie, leaving Shouta with shivers down his spine in the moonlit area.\n\n\nOr maybe the feeling comes from the calm emanating from his student, from his student who should have green eyes and a cheerful smile, now much more passive in the midnight hour.\n\n\nShouta looks away, unable to make eye contact any longer. He glances out the window, sees the moon shining high and the stars dancing in the darkened sky. It’s calm, serene, outside of the room that Shouta resides in. \n\n\nShouta doesn’t feel very calm, but he looks back to his student nonetheless. Because this is his student, and he doesn’t know what is happening, just that things are not as they \n\nshould\n\n be, and it is up to Shouta to make things right.\n\n\nBut when Shouta looks back, it is to eyes already shut and soft breathing to match.\n\n\nIzuku Midoriya is asleep once more, and Shouta is more stressed than he was just moments before.\n\n\nHe can only hope that Midoriya will be his usual self when he wakes again.\n\n\n-----\n\n\nMidoriya is not his usual self, and Shouta Aizawa feels like a fool for expecting anything else.\n\n\nHe fell asleep, too, at some point. Between one moment of worries and another of trying to come up with solutions, Shouta must have drifted off, too overwhelmed and helpless to prevent the call of sleep from claiming him. Not that it helped, no, he still feels like he’s in a waking nightmare from the moment that he opens his eyes.\n\n\nBecause Midoriya is up and awake, and he is moving about. But it is not with the familiarity that Midoriya usually does, having been in the nurse’s office so many times at the beginning of the year, but a sort of wonder, as if seeing something that he has not in quite some time.\n\n\nQuite some time, indeed, if Midoriya’s comments are to be accounted for.\n\n\n“That wasn’t there last time,” Midoriya murmurs, eyeing a machine that Shouta can recall having been bought the year after he started working here.\n\n\n“Oh, it seems they replaced the old cot. And here I thought that third year with the metal Quirk would get to have a legacy within Yuuei!” \n\n\nShouta can’t recall there being a third year with a metal Quirk this year.\n\n\n“Woah! Those are a \n\nlot\n\n of new buildings! They must have done some renovations, eh, Shou?” Bright blue eyes glance his way, and Shouta stares back. Midoriya doesn’t look at him for long, though, pushing open the window to look at some of the dorms. “Wow. I knew Yuuei worked fast, but this is \n\nincredible\n\n. Gee, I wonder what else they may have done!”\n\n\nAnd then Midoriya is turning and walking out of the room, leaving Shouta to race after him. The boy’s head turns this way and that, as if confused by his surroundings, and yet Midoriya is able to make his way through the school all the same.\n\n\n“Wait, are these \n\ndorms\n\n?” Midoriya asks, glancing at Shouta. “That sounds like fun, I wonder why they decided to put them in, though.” Midoriya reaches a hand up, as if going to tap at his chin, only for it to bump into the metal brace that Shouta hadn’t been able to get off of his student, too afraid to jostle his kid around in his sleep and risk any more problems. The brace seems to startle Midoriya, though, and his eyebrows furrow as his fingers curl around the edges of it before yanking it off.\n\n\n“Why was I wearing this?” Midoriya murmurs, and then glances at his outfit. “What am I, a bartender or something?” He snorts at his own joke, and then turns to Shouta. “Hey, is there anywhere I can swap my clothes?”\n\n\nShouta clears his throat, pushes past the feeling that screams that Midoriya is acting far too familiar right now, that there’s a few missing pieces to the puzzle that he’s been forcefully given and that they need to click into place for Shouta to finally \n\nunderstand\n\n, and nods. “Follow me,” Shouta says, and then he leads Midoriya to Heights Alliance.\n\n\nThe dorms are silent, when Shouta enters them. No one is up, not a soul is to be seen. It’s early, Shouta knows, but another part wonders if his students are just afraid to get up, to realize that Midoriya isn’t in his dorm sleeping peacefully, or outside doing his morning workout as he normally does.\n\n\nHe can’t blame them, not when that pervasive feeling of \n\nwrong\n\n lingers in his heart as he leads Midoriya to his own room, the boy looking mystified with every turn, as if nothing is familiar anymore.\n\n\n\nWhat happened to his kid?\n\n\n\nWhen Shouta opens the door to Midoriya’s room, Midoriya waits for Shouta’s cue to walk in, as if he doesn’t know whether he’s allowed inside of its walls- as if it’s not his own space to inhabit. \n\n\n“Wow,” Midoriya says instead, a toothy smile covering his face, eyes darting around the room. “This room belong to a cosplayer or something?”\n\n\n“An actor,” Shouta says, playing along even as he wants to scream, because it feels safer that way, like it’s still just an act, just some game that Shouta and Midoriya had been playing on the school, and not some suddenly horrifying Quirk at play. “Go ahead and get dressed, kid.”\n\n\nMidoriya gives him an odd look at the word ‘kid’, but shrugs and turns to the closet- and here Shouta flashes his Quirk, stares directly at Midoriya only for \n\nnothing to happen\n\n- , pushing hangers around until he finds what he needs. Shouta exits the room, shuts the door behind him, trusting that Midoriya will come out when he’s ready.\n\n\nAnd Midoriya does, opening the door with one hand while doing the final adjustments to a perfectly done tie with the other, looking far too at ease as he does.\n\n\n“Alright, I’m ready!” Midoriya cheers, eyes closing from the force of his own smile, a moment where Shouta doesn’t have to see that worrying blue color. “Let’s go, Shouta!”\n\n\nIt’s only then that Shouta processes the name.\n\n\nAnother piece drops onto the board, but the picture is still unclear.\n\n\n(It won’t be for much longer, and Shouta will wish that he had kept his eyes shut.)\n\n\n(But wishes don’t come true, and perceptions change with time.)\n\n\n-----\n\n\nThe students of 1-A wait in their classroom, all watching the door with unconcealed worry. It’s a fear that has festered, an anxiety that stewed overnight, growing more rapidly with every passing hour lacking their green-haired friend’s return.\n\n\nThey’ve heard nothing about Izuku Midoriya. Not one bit of information has been shared, not one person knows how he is doing, if he has even yet to wake from unconsciousness. No texts have been sent, no knocks have occurred on anyone’s door. \n\n\nThey’re truly in the dark. \n\n\nAll that they know is that Izuku Midoriya has not been spotted by any of their members since the moment he collapsed under Eri’s touch, and that Midoriya is no longer in Recovery Girl’s office.\n\n\nAizawa was with him, 1-A knows, and so they know that their friend is safe, unharmed. And the fact that he has changed locations implies that their friend is \n\nawake\n\n, but that begs the question...why didn’t Midoriya come to see any of them? Surely, he knows his friends are worried for his well being, doesn’t he?\n\n\nShouto Todoroki is especially stressed by the current situation, Quirk control fluctuating without his awareness, his only focus being the giant wooden door that still remains frustratingly shut. Already his desk is covered in ice, its origin point being the edge that he grips tightly underneath his hand, and Momo Yaoyorozu is prepared to make a fire extinguisher immediately, should Todoroki prove to be just as unstable with his other side.\n\n\nAnd luckily for Yaoyorozu, the bell rings before Todoroki can set himself alight.\n\n\nUnfortunately for them all, it is clear that something is \n\noff\n\n the very moment that the door opens.\n\n\nMidoriya is the one to lead the way, wide eyed and full of glee, which wouldn’t be all that different from the normal state of their peer...if those wide eyes were green, and not very clearly blue.\n\n\nBut bright blue eyes shine as they take in the room around them, and Midoriya seems both familiar and confused by the walls around him.\n\n\n“This isn’t the same,” Midoriya says to Aizawa, who looks much paler than usual, as if their teacher is the one who will pass out next. “Shou, what class \n\nis\n\n this?”\n\n\n“1-A,” Tenya Iida murmurs, always one to answer a question as soon as he possibly can, despite the quiver in his voice, and Midoriya turns to him with a wide smile.\n\n\n“Thanks, mini Tens!” Nodding to himself, Midoriya murmurs, “That’d explain a lot. Man, it’s nice getting to see my underclassmen every once in a while!”\n\n\n“Underclassmen?” Tsuyu Asui questions, and Midoriya nods.\n\n\n“Yep! I’m a proud member of 2-A, just one year above you. But don’t worry, the first year isn’t as bad as the second.”\n\n\n“It gets \n\nworse\n\n?” Denki Kaminari asks, and Midoriya laughs. His eyes shut with the sound, smile too wide, and for a moment 1-A cannot help but get lost in the persona.\n\n\nBut then his eyes reopen, and it’s far too jarring, far too different, and everyone cannot help but be on edge.\n\n\nAnd students glance at Aizawa, hoping to understand, to learn, but Aizawa is watching Midoriya as if he, too, is trying to figure out what comes next.\n\n\nMidoriya takes his seat, slouches in what seems to be a comfortable manner, and then drums his fingers on his desk for a moment before smiling to himself, hands resting and the boy becoming silent. \n\n\nAizawa stares a moment longer, they all do, really, but then he looks away, the action clearly forced. The lesson starts, the day begins.\n\n\nHitoshi Shinsou taps on Midoriya’s back.\n\n\n“Midoriya,” he whispers, an attempt to get his friend to break character.\n\n\nMidoriya doesn’t react, doesn’t so much as flinch or tense. \n\n\nAnd so Tuesday begins with Shinsou as one of the few to keep their eyes on Midoriya the entire time, his position in the class enabling him to do such a thing.\n\n\nAnd when Midoriya’s hair begins to lighten, Shinsou takes notice.\n\n\n(They all will.)\n\n\n-----\n\n\nAfter the events of yesterday, Hizashi Yamada can officially say that he is horrified by the personality swaps that Shouta Aizawa assigns to Izuku Midoriya. Watching Midoriya collapse, all because of a single touch from Eri- and \n\noh\n\n, how Hizashi regrets giving in to Eri's pleas to see her hero just a few minutes sooner, regrets the gasps and cries and teary red eyes that had looked at him with so much \n\nfear\n\n- had been heartstopping. \n\n\nAnd yet it happened nonetheless, despite Hizashi’s wishes that it could be nothing more than a horrible dream, and Hizashi feels awful for his mistakes.\n\n\nAnd yet, somehow, this guilt and regret seems to pale in comparison to the feeling that fills Hizashi upon seeing Midoriya.\n\n\nBecause Midoriya is not Midoriya, and that isn't \n\nright\n\n. Hizashi \n\nknows\n\n Shouta, had seen the fear and despair in his friend's eyes when Midoriya would not wake, and he knows damn well that Shouta would not give Midoriya an assignment today, not after yesterday's mishap.\n\n\nAnd 1-A seems stressed, too. Not the normal fears, the panic that would turn to laughter at the end of the day, no. No, this is something more urgent, yet somehow static, a confused worry that lingers and halts their actions, leaves them puzzled.\n\n\nLeaves them all waiting for the other shoe to drop.\n\n\nHizashi tries calling Midoriya by name, tries urging the little listener to simply break character for once, but Midoriya does not so much as blink at his name.\n\n\nNo, Midoriya just smiles at his peers, peers who do not smile back, but watch in ever building apprehension.\n\n\n\"He won't respond to his name,\" Hitoshi Shinsou informs, and Hizashi watches as Midoriya’s hair seems to fade, growing lighter.\n\n\nAnd as Midoriya’s hair loses its dark green tint, the boy finally acknowledges him, blue eyes shining bright as he smiles.\n\n\n\"Hizashi!\" Midoriya cries. \"Wow, your hair is longer than I remember! You really did stick to your style, huh? That's great, Zashi.\"\n\n\nThe words don't make sense. They're far too familiar to be someone Hizashi doesn't know, and yet Hizashi doesn't know anyone who would make such a comment.\n\n\nNot someone from anytime soon, at least. But who could Midoriya be, to make a statement like that, a claim that Hizashi’s hair was so different than remembered?\n\n\nHizashi doesn't know, and the bell ringing deters his thoughts for a moment, just a moment. Hizashi has a lesson to give, he knows.\n\n\n\"Study hour,\" Hizashi calls out, and the students listen. Slowly, surely, they pull out their books.\n\n\nHizashi wonders if it's because the familiarity of studying at least makes sense. Kami knows their peer sure doesn't, not when he has wisps forming around his hands, weaving between his fingertips.\n\n\nAnd it feels like deja vu, like a parody of the day before, except today the mist is not purple but blue, light and cheerful in color.\n\n\nAnd it grows dense, denser, not by much but in a way that's too familiar to a time years ago.\n\n\nAnd when Hizashi glances at Midoriya’s face again, just in time to watch a streak of blue race through Midoriya’s hair, Hizashi cannot help but gasp and stare.\n\n\nBecause Izuku Midoriya is clearly, unmistakably, Hizashi’s old friend Oboro Shirakumo.\n\n\nBut Shirakumo has been dead since their second year.\n\n\n\n(Something is \n\nwrong\n\n.)\n\n\n\n-----\n\n\nShouta Aizawa, Hizashi Yamada, and Nemuri Kayama are all within the teacher's lounge when the bell rings for lunch, the room vacant except for one other.\n\n\nExcept for Izuku Midoriya, the subject of their worries, their beliefs.\n\n\n\"He can't be,\" Kayama says, although it is less a belief and more a plea, a wish that she so desperately wants granted. \n\n\n\"Because if Midoriya is acting like this \n\nnow\n\n,\" she chokes out, a shaky hand gesturing at the now blue-haired boy, the boy who seems far more enamored by the room and the 'new' heroes pictured on the wall- their staff photo, for kami's sake- than by their fears, their revelations, \"if he's acting like this because of Eri's \n\nRewind\n\n Quirk, and he was acting like \n\nKurogiri\n\n-\"\n\n\n\"I- no,\" Yamada says, despite being the one to connect the dots. \"There's no way. It must just be a mistake- an error or- or something.\"\n\n\nBut it's Aizawa, poor Aizawa, who has seen so much and feels as if he knows too little- or perhaps just the brink of enough- who shakes his head, eyes still locked on his student. \n\n\n\"Midoriya has been doing these assignments for nine weeks. \n\nNine\n\n weeks.\" Aizawa takes in a breath, shuts his eyes, and then opens them slowly, painfully. \"I've yet to find a single mistake in \n\nany\n\n of his assignments. Even the stories he's told were correct. I checked.\"\n\n\nHis eyes are shining, tears forming as he looks away from his student.\n\n\n\"Midoriya doesn't \n\nmake\n\n mistakes. And now that his Quirk has awakened…\"\n\n\nHe doesn't have to finish. The implication is clear enough.\n\n\nMidoriya’s Quirk isn't wrong, and something happened that made Oboro Shirakumo into Kurogiri.\n\n\n(\n\nSomeone happened, they all know, but none can gather the courage to say it out loud, to shatter the perceptions they all had of the world they've known so long.\n\n)\n\n\nMidoriya looks their way as they all fall silent, and blue eyes flash before shining with interest.\n\n\n\"You're different, now.\" The words are startling, and all three look to Midoriya with curiosity, a gaze which Midoriya matches with a pensive look of his own.\n\n\n\"Well, it's kind of obvious. You guys look so much older, now, for one.\" Midoriya laughs to himself, no one joins in. \"It's professional, I like it!\"\n\n\nTilting his head, Midoriya asks, \"You guys seem uncomfortable. Is there something wrong?\"\n\n\nNo one responds, and Midoriya smiles. It's softer, more concerned. \"I know I'm not where I'm meant to be right now,\" Midoriya admits, and the words hurt to hear. \"Something has changed. The world moved without me, or maybe I just skipped a portion. So, what did I get hit by? A time travel Quirk?\"\n\n\nA building, Aizawa almost croaks out, watching as Midoriya's hair changes, the mist that dances around his hands finding a home above his head, merging with his blue hair and causing it to float, flickering like a dying flame.\n\n\nBut words do not come, only regrets. Only fearful, heartbroken stares from all three of Midoriya’s teachers as they watch him lose interest in waiting for an answer, instead back to marveling at the 'future' he never got the chance to know, as if he truly is their long past friend and not their student trapped within his Quirk.\n\n\nThey had always wanted to see Oboro again...but not like this.\n\n\nKami, \n\nnever\n\n like this, whatever this may be.\n\n\nThey can only pray that Midoriya is able to snap out of it soon.\n\n\n(He will.)\n\n\n-----\n\n\nShouta feels his anticipation grow all the more, somehow, when hero training finally arrives. Apprehension builds in his heart as his students are led away by Yagi- and really, it's unsurprising that Shouta takes up the end, following behind his class. \n\n\nAs if he’ll make the mistake of leaving his child alone, as if he'll repeat all of yesterday’s problems.\n\n\nYagi seems just as uncomfortable, with a Midoriya so clearly not Midoriya, one who is far past the stages of acting, but he's already learned that Midoriya won't- \n\ncan't- \n\nbreak character, and so he, too, is resigned to a worried compliance, accepting Midoriya’s role with clear hesitation before turning to instruct the students. \n\n\nThey're doing outdoor training, sparring within city grounds yet again. A part of Shouta reminisces, recalls the way Midoriya had sprung around, acting as Gran Torino.\n\n\nThe larger part is more focused on the present Midoriya, the one who is making a small cloud in his hands, playing around with it as if it’s second nature to do such a thing.\n\n\nYagi divides the class into pairs, and Shouta can't even bring himself to be remorseful over the fact that he doesn't catch a single pairing that the blond decides on. No, he's too busy watching his kid, making sure that his Problem Child stays safe. A part of him, a part based on nothing but hopes and gut feelings, is sure that Midoriya will drop the act on his own, so long as he gets to the end of the day, can hear the school bell ring without interruption. If Shouta is lucky, it will work, and Midoriya’s brain will be able to connect the sound and time to the need to let go of his persona.\n\n\n(Shouta doesn’t want to consider what will happen if Midoriya \n\ndoesn't \n\nreact to the bell in such a manner, not when Erasure didn't work, and he's not sure that Midoriya would willingly sit around in Recovery Girl’s office without a reason for his character to understand. The boy had already walked out once without hesitation, and Shouta doesn’t think he could bear to force Midoriya along, not with his kid like this.)\n\n\nShouta just wants- no, \n\nneeds\n\n- to get Midoriya through the day without issue.\n\n\nThe world has another plan.\n\n\nShouta isn't sure what happens, not at first. Looking back, he'll be able to see that Ashido had been knocked back into a building, the very same one that a Quirk-hardened Kirishima had slammed into in the previous fight. But Ashido is the next to be slammed into the building, and Ashido had been pushing her Quirk to its limits, trying to break through the concrete faster, more efficiently.\n\n\nShe'd been doing well, too. \n\n\nWell enough that the spot Ashido hits is destroyed in seconds. And enough seconds pass that Ashido starts to get up, but not enough for her to get away when the building starts to give in, dropping under its own weight.\n\n\nNo, it's not enough time for her to react.\n\n\nIt \n\nis\n\n enough time for Midoriya to do so, however.\n\n\nAnd it happens in an instant. Ashido's scream, cut off as Midoriya leaps forwards, shoving her out of the way with one hand as the other forms a familiar blue cloud, large enough to cover his kid.\n\n\nBut not large enough, and when the building collapses, falling in on itself, Midoriya is gone with it.\n\n\nAnd something \n\nshatters\n\n in Shouta.\n\n\nA part of Shouta registers, distantly, the gasps and fear-filled screams that come from Yagi and his students, the panicked cries that follow the crash. But a larger part is focused on one thought, one idea that burns through every inch of him.\n\n\nThe thought that he can't lose another person so dear to him in such a way.\n\n\nHe's moving before he processes it, sprinting forwards and reaching the rubble in the blink of an eye. Shaking hands reach down and tug off piece after piece, his only thought of unearthing his student.\n\n\nA second pair joins quickly, and Shouta glances over to see Todoroki beside him, expression frantic in a way Shouta has never seen on the boy. \n\n\nAnd then comes a third set, and a fourth, Uraraka smacking the larger pieces with an earnestness unparalleled and Asui flinging them away. And fifth, sixth, seventh, eighth, Iida and Kirishima grabbing heavy chunks in sync, Bakugou ripping pieces off with an angry intensity as Yagi works on what he can. \n\n\nAnd then there is a ninth as Shinsou hops into the fray, tenth as Satou downs a pack of sugar before lifting, eleventh and twelfth and on and on, more hands joining until there are twenty-one Yuuei inhabitants working together.\n\n\nAnd then they find Midoriya.\n\n\nHe's unconscious, sprawled out on the ground, but he doesn’t seem to be harmed. Not externally, at least, save a few scratches that Shouta doesn't remember to have been there before. He's breathing deeply and doesn't show any signs of pain, two facts that allow Shouta to finally take a breath of his own.\n\n\nShouta takes a deep breath, wills his hands to stop shaking, and then crouches down, moving quickly yet carefully to lift his kid out from the rubble. And like clockwork, Midoriya’s hair fades with the touch, the blue retreating, a sky replaced by the forest Shouta has always known.\n\n\n(Things aren't perfect, no, but they're getting a little bit closer to where they were.)\n\n\n-----\n\n\nAnd when Midoriya wakes up- which he \n\ndoes\n\n, just moments after being pulled out of the rubble, thank kami, before Iida can return with Recovery Girl- his eyes are not blue, but rather a vivid, familiar green that makes Shouta want to sob with relief.\n\n\nAnd he lets himself cry, lets himself pull Midoriya into a hug that is not tight, but secure, enough that his kid can't slip away.\n\n\n\"Sensei?\" Midoriya murmurs, voice heavy with exhaustion. \"Are you okay?\"\n\n\nIt's such a blatantly Midoriya answer that Shouta cannot help but let out a choked laugh, one that turns into even heavier tears, ones that cloud his vision, turning Midoriya into nothing but an assortment of colors.\n\n\nBut that's quite alright, because Shouta can see green, can hold his son and not let him slip away, right out of his fingertips.\n\n\nMidoriya and Oboro didn't meet the same end, and for that Shouta can let the tears fall without shame.\n\n\n\"I- \n\nkid\n\n,\" is all Shouta gets out, and even if Midoriya doesn't seem to understand, head tilting just so, Shouta considers it enough to be said.\n\n\nAnd so he says nothing more, simply hugs his kid tighter and lets the world keep moving, lets the silence take hold and the tears fall down as the rest of 1-A and Yagi wait for Iida's return, waits for Midoriya to be deemed safe so that they can all breathe fully, deeply, truly.\n\n\nThere is nothing more to be done, nothing Shouta can do except hold his kid.\n\n\nIt's all he can do as his perception changes, the world realigning right before him, leaving a world yet unclear.\n\n\nYes, Shouta will just sit here a moment longer, and thank the world for not stealing away his son.\n\n\n(The world is changing, but Shouta will be there.)\n\n\n(He refuses to lose another shining star, the way he had before.)\n"
}