{
    "id": "31927759",
    "url": "https://archiveofourown.org/works/31927759?view_full_work=true",
    "author": [
        "ladyofsnails"
    ],
    "title": "are u dating??",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Bakugou Katsuki/Midoriya Izuku"
    ],
    "characters": [
        "Midoriya Izuku",
        "Bakugou Katsuki",
        "Uraraka Ochako",
        "Ashido Mina",
        "Todoroki Shouto"
    ],
    "additional_tags": [
        "Minor Ashido Mina/Uraraka Ochako",
        "Streamer Midoriya Izuku",
        "Fashion Student Bakugou Katsuki",
        "that should be a tag",
        "Fashion Student Ashido Mina",
        "Celebrity Todoroki",
        "Alternate Universe - College/University",
        "Alternate Universe - No Quirks (My Hero Academia)",
        "Friends to Lovers",
        "Roommates",
        "deku is a streamer and his viewers ship him with his roommate 'kacchan'",
        "who never comes on screen",
        "pining ensues",
        "Mutual Pining",
        "obligatory idiots to lovers tag that should be on all my bkdk fics",
        "Social Media",
        "Fluff"
    ],
    "language": "English",
    "series": "Part 16 of snail has bkdk brainrot",
    "published": "2021-06-13",
    "completed": "2021-06-19",
    "words": "26,372",
    "chapters": "6/6",
    "comments": "926",
    "kudos": "13,517",
    "bookmarks": "2,795",
    "hits": "138,573",
    "summary": "<p>Izuku's life is going amazingly well, with his Twitch channel where he streams himself playing video games and discussing the nerdiest things imaginable hitting 3 million followers, his best friend as his roommate, and his other close friends as tight-knit as they've been since high school. The only possible road bump is his viewer's continuous demands to know who \"Kacchan\" is - thanks to Katsuki often coming into his room during streams and Izuku's repeated attempts to pull him into video game competitions - and, more importantly, if they're dating. Which is <em>crazy.</em></p>\n<p>Shenanigans on Ochako's livestream and more Kacchan and Deku chaos</p>\n<p>Izuku works through some feelings with Ochako's help, and Katsuki is stuck with Mina and Todoroki, who have a suggestion</p>\n<p>Katsuki finds out what there is to see on the internet and Izuku talks through some feelings.</p>\n<p>In which Katsuki and Izuku finally talk.</p>\n<p>Tying up some loose ends.</p>",
    "notes": "<p>hi hi hi lovely people!! wrote this based off an idea-barf thread i made about a month ago on twitter (@ladyofsnails). fun times</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>thank you for reading!! comments and kudos much appreciated, next chap should be up in a few days!!</p>\n<p>- snail :D</p>\n<p>ps if you see your username in here its because im bad at thinking of them so i picked the usernames of some consistent commenters and/or those who said really nice stuff that stuck with me. you can ask me to take yours out if you want ofc!! but ily</p>\n<p>im really bad at chapter summaries, sorry about that. anyways hello lovely people!! hope you enjoy the chapter :D</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>yes this is a reformed dekusquad made up of my absolute favorite characters, sorry to the rest of the gang I still love them but I didn't want to add way too many people. anyways chaotic bkdk rights!!!</p>\n<p>thank you for reading :D comments and kudos very much appreciated</p>\n<p>- snail &lt;3</p>\n<p>this has like...the teeniest tiniest bit of angst but it's not /angst/ it's just feelings!! I promise it's still fluff the boys are just stupid. anyways enjoy the chapter and thank you for all your comments and kudos so far :D</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>sorry for cliffhanger!!! I'm trying to keep chapter lengths consistent but hopefully the new chapter will be out by tomorrow? no promises but I'll do my best.</p>\n<p>thank you very very much for reading, comments and kudos much appreciated &lt;3</p>\n<p>- snail :D</p>\n<p>welcome y'all, today we got some chaos, some mushy stuff, and then some more fluff pining. I am still bad at chapter summaries as seen above. anyways, enjoy B)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">more notes</a>.)\n</p>\n<p>shoutout to codi if you happen to be reading this, neon trees song made me think of you (also the song is everybody talks by the neon trees because it was stuck in my head)</p>\n<p>hope you liked this chapter!! comments and kudos much appreciated &lt;3</p>\n<p>- snail :D</p>\n<p>some of y'all guessed exactly what happens at the beginning of this chapter so congratulations for that lol</p>\n<p>hope you enjoy :D</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">more notes</a>.)\n</p>\n<p>*pops confetti* they did it!! next chapter will be an epilogue-type thing, aka when I just put in random non-plot fluff stuff because this is my fic and I can do whatever I want B)<br>who knows how long it'll be but yeah. thank you for reading!! comments and kudos much appreciated &lt;3</p>\n<p>- snail :D</p>\n<p>it's just dorks in love fluff. my favorite &lt;3</p>\n<p>update: <a href=\"https://collisiondiscourse.tumblr.com/post/654538466577793024/it-started-with-a-whisper-and-that-was-when-i\" rel=\"nofollow\">THIS HAS FANART NOW THANK YOU CODI</a><br><a href=\"https://twitter.com/cappucinovio/status/1407014932663525382?s=20\" rel=\"nofollow\">more fanart!!! &lt;3</a></p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">more notes</a>.)\n</p>\n<p>and then kacchan got on trending again B)</p>\n<p>anyways, thank you so much for reading!!! this was a lot of fun :D check me out on tumblr and twitter (links below) for occasional rambles or threads about these dumb boys or just to say hello to me!! &lt;3</p>\n<p>- snail :D</p>\n<p>tumblr: <a href=\"https://lady-of-snails.tumblr.com/\" rel=\"nofollow\">@lady-of-snails</a><br>twitter: <a href=\"https://twitter.com/ladyofsnails\" rel=\"nofollow\">@ladyofsnails</a></p>",
    "text": "DEKU! @smallmight\nAll Might stan and nerd by day, also those things by night. Check me out on twitch and youtube to see me do stuff :D\n614 Following 892.4K Followers\n-----\nPinned Tweet\nDEKU! @smallmight\n“you’re nerdy as shit and so are all three fucking million people that follow you” – kacchan\nanyways thank you so much for three mil on twitch!! love you all very much (´▽`ʃ♡ƪ)\n[Image: an All Might cake with a 3-shaped candle in it]\ncarrot is in love w villains @carrotsticks\nReplying to @smallmight WE LOVE U TOO DEKU ITS WHAT U DESERVE!! &lt;3333\nHoney | mirko’s fluffy tail @honeycomb\nReplying to @smallmight kacchan has such a way with words 💕💕\nmax @freckledeku\nReplying to @smallmight and @honeycomb ikr…almost like he’s proud of deku or smthng 😏😏 \nOchako✿ @uwuraka\ndo no harm but take no shit 💖\nwifey: @alienkween\n230 Following 365.2K Followers\n-----\nPinned Tweet\nOchako✿ @uwuraka\nSTREAMING MON, WED, AND FRI ON TWITCH!! Come watch me play games and rant about my gf &lt;3\n \nShouto ✓ @todo_shouto\nI like soba\n42 Following 2.3M Followers\n-----\nPinned Tweet\nShouto ✓ @todo_shouto\nGo follow @smallmight and @uwuraka they’re my friends that are more interesting than me :)\nDEKU! @smallmight\nReplying to @todo_shouto alskdkdf todoroki!! you’re very interesting and cool don’t sell yourself short!!!\nOchako✿ @uwuraka\nReplying to @todo_shouto who gave you the right to be this sweet shou, ilysm\n--\n \nIf you told twelve-year-old Izuku Midoriya that in seven years’ time he’d have three million people wanting to watch him rant about superheroes and play his favorite video games, he would either cry about that being far too many people or not believe you for a second. But here he was, nineteen years old, surrounded by his four closest friends, and celebrating just that. With a piece of a cake made for him by Kacchan, no less, who he lived with. Tell that part to twelve-year-old Izuku and he probably would’ve grinned and said I knew it, because he always did know his friend would come around.\n“I’m surprised you’re not crying right now, Deku,” Ochako joked, smirking at him from the couch where she was cuddled up with her girlfriend, Mina. Todoroki nodded his agreement.\n“He did that already,” Kacchan deadpanned from the kitchen, making Izuku laugh sheepishly, “for like, two fuckin’ hours.”\n“Not that long!” Izuku protested, earning blank, unbelieving stares from all four of his friends. Izuku shrunk back in his chair a bit. “It’s a big deal to me…”\n“As it should be!” Mina declared, lifting her glass of soda to the air, “If you cry, then you cry, Mido, more power to you!”\nIzuku raised his own cup meekly in reply, feeling his cheeks burn and watching Kacchan join the rest of them in the small living room area of their shared apartment. Him, Kacchan, Todoroki, Ochako, and Mina had been friends since high school and managed to stay friends after graduation, thanks to Kacchan and Mina going to the same high-ranking fashion school in their city and the other three going to the same college, also in their home city. Izuku was forever glad for that, as he would’ve been heartbroken to be separated from any of them, and utterly lost without Kacchan.\nIt had even been this group of friends that got him into streaming in the first place, originally with Ochako showing Izuku someone she’d seen talking about comic books on a stream, who he disagreed with so strongly he’d picked up the courage to start streaming himself. His initial popularity boost was surely in large part to Todoroki tweeting about him to his millions of avid fans – perks of being friends with a famous child actor, apparently – but even after that his follower count just kept growing. Lots of nerdy people in the world, he guessed.\n“Damn, Bakugou, I always forget how good of a baker you are,” Ochako hummed through a mouthful of cake, snapping Izuku out of his head.\nKacchan glared at her. “The fuck is that supposed to mean, Cheeks?”\n“It’s a compliment, Blasty, just take it,” Mina smirked, picking a spare chunk of frosting off her girlfriend’s plate and licking it off her fingers.\n“It means you’re amazing at everything you do, Kacchan,” Izuku grinned at his childhood friend, who just rolled his eyes. Kacchan was truly good at everything he did, because he worked so hard at it, and there was no doubt in Izuku’s mind he’d be a great designer one day.\n“Are we going to play something?” Todoroki asked, taking Izuku’s attention off Kacchan.\n“Sure!” he chirped, grabbing the remote to turn on the TV, “Did you want to stream or just be us?”\n“Three million celebration stream!” Ochako cheered, leaning forward to snatch a game controller off the coffee table. Mina and Todoroki agreed, and when Izuku turned to Kacchan, he just shrugged. \n“Your fuckin’ party or whatever.”\n“Well, I still want you to play,” Izuku said, holding out a controller to Kacchan, who stared at it for a second before accepting.\n“Fine,” he conceded, shifting further towards the end of the couch, “just keep my fucking face out of frame.”\n“Of course!” Izuku agreed, moving to turn on the webcam he kept set up by the TV and get his computer ready to stream. Kacchan had always been a very private person despite his parent’s fame in their industry and being friends with two popular streamers and one actual celebrity, but he didn’t seem too opposed to being heard on their streams or in Todoroki’s Instagram stories. As long as his face wasn’t shown, Kacchan would kick Izuku’s ass in a video game any chance he got.\nIzuku finished setting up the stream and posted an announcement to his Twitter, and soon enough viewers started flooding in and spamming the chat with hellos and congratulations that made him smile.\n“Hey everyone!” he greeted, taking his seat at the edge of where the camera frame lay, next to a just out-of-frame Kacchan with his other three friends on the couch on his other side. “I’ve got some friends over right now and we’d thought we’d play some games to celebrate three million of you lovely people!” His friends, minus Kacchan, said their hellos to the viewers. “Kacchan’s here too,” Izuku added with a grin, reaching off-camera to pat Kacchan’s soft blond hair and earning a slap to his hand. \n“Fuck off,” Kacchan sniped as Izuku laughed.\n“That’s mean, Kacchan,” Izuku fake pouted, “You’re supposed to be congratulating me.”\n“Was the damn cake not enough for your greedy ass?” Kacchan shot back with an eyebrow raised. \n“The cake was amazing,” Izuku smiled, then turned to face the camera again, “Kacchan made me a cake because he’s actually a very nice person who-” Izuku was cut off by Kacchan’s socked foot pressing into his face and pushing him back into Todoroki. “Mmpf!” He shoved Kacchan's foot off his mouth and was met with a very handsome, amused smirk. He felt his cheeks suddenly heat at the sight, mustering a glare and trying not to get flustered. “Rude!” \n“Never slander my name again,” Kacchan said as their friends laughed behind them.\n\nChat\n\nShimuraNana: congratulations deku!!!\njustalittlebeekeeper: wooooo three mill!! you deserve it 😊\n[MOD] TheEighthUser: ocha and mina are here!! best gfs uwu\nanquelbean: kalsdfdkj deku and kacchan back at it\nCloudFormations: you love 2 see it\nTenkoTenko23: Kacchan’s voice how I missed you &lt;3\nLesbianNebula: ‘never slander my name again’ lmaooo\n“Come on, you two!” Ochako said loudly, drawing Izuku’s attention away from Kacchan and back to the matter at hand – he noticed that happened often with Kacchan sitting in on streams, he’d completely forget about being filmed or watched by anyone outside of Kacchan himself. “Let’s get to playing, I want to kick Kacchan’s ass,” she smirked, careful to use the nickname that was attached to Kacchan’s only internet presence through Izuku’s streams. \n“Like hell you will, Mochi Cheeks!” Kacchan snapped.\n“What are we even playing?” Todoroki asked. \nIzuku grinned. “Mario Kart, and I’m going to kick all your butts.”\n“Just say ass,” Ochako and Kacchan said in unison, then each made matching looks of disgust at the other as Mina and Izuku snickered.\n“Something they agree on!” Mina laughed, earning a look of betrayal from her girlfriend.\n“Fine!” Izuku giggled, “If you both insist, I’ll kick all your asses!”\n \nMany rounds later, Izuku had no idea who was winning overall, thanks to the competitiveness of him, Kacchan, and Ochako, and the fact that Todoroki had grown up the youngest of four children. But what he did know was that the second he finally beat Kacchan, he declared himself total victor and said the game was over.\n“Absolutely not!” Kacchan snapped, glaring at him with his controller gripped dangerously in his hands. Izuku grinned at him and puffed his chest out in an overdramatic pose. \n“Deal with it, Kacchan, you lost!”\n“He did beat you,” Todoroki added helpfully as Kacchan narrowed his eyes further. \n“I’m gonna kill you,” Kacchan growled, hardly threatening to Izuku at this point and really only serving to make him blush slightly.\n“You’re on camera,” he pointed out, “there’s no way you’d get away with it.”\n“Oh yeah?” Kacchan challenged, setting his controller down and raising an eyebrow.\n“Yeah, try me-” Izuku cut himself with a yelp and a laugh as Kacchan grabbed him by the legs and dragged him off the couch and out of frame, holding him so he hung upside down in the air, which was a very impressive show of strength and made him glad for the blood rush to his face. “AH! Kacchan!” \nHe flailed his arms around until he grabbed onto Kacchan’s ankle, yanking on it, and only realizing how stupid that was when Kacchan yelled in surprised and toppled backwards, Izuku landing haphazardly on top of him as someone’s limb hit a tall lamp and sent it crashing to the ground. Kacchan’s instincts were just barely fast enough to catch the top before the lightbulb shattered against the hardwood, and his cussing was almost drowned out by Izuku and the rest of his friend’s laughter.\n“Deku!” Kacchan yelled, making Izuku laugh even harder as Kacchan shoved him off. \n“That was-hah! That was your f-fault, Kacchan!” Izuku managed through his laughter, then winced at the sore spot on his back where Kacchan’s knee had hit him. It was moments like these when he understood why his mother has seemed slightly concerned at the prospect of him and Kacchan renting an apartment together. They’d had the tendency to a little carried away ever since they were kids, and that did not stop when they turned eighteen. \n“Fuck off, that was on you!” Kacchan protested, slapping Izuku’s leg with his free hand.\n“Is the lamp okay?” Izuku asked, sitting up. \nKacchan nodded and winced. “God fucking dammit, now I’ve got a headache.”\n“Woops!” Izuku laughed, pushing himself to his feet and making his way back on camera, grinning lopsidedly at his viewers, “Well, now my back hurts, so I think I’ll end it here. Thank you for watching and thank you so much for any donations! Love you all, catch you next time.”\n \n--\n \nbread @bag_uette\nOchako is all of us watching Deku and Kacchan lmao\n[Image: a gif of Ochako watching Izuku talk to someone off screen, then turning to smirk at the camera]\n \nishi @edamame\nASDKLFDFKD DID THEY BREAK A LAMP WHILE WRESTLING?? IDIOTS I LOVE THEM SM #Deku\n \npixie @funkyclouds\nno thoughts just deku’s smile when he’s talking to kacchan &lt;3\n[Image: screenshots of Deku smiling softly or smirking at someone off camera]\n \n--\n \nThe next morning, Izuku woke up to his alarm and dragged himself out of bed to face the day. Kacchan’s bed was already empty, and he could hear his roommate moving around in the kitchen outside, because despite being the opposite of a morning person Kacchan never let himself sleep in on weekdays. Izuku preferred to fit in extra hours whenever he could, especially with his busy life as a full-time psychology student and a streamer.\n“Good morning!” Izuku smiled as he entered the main room of the apartment to find Kacchan warming up leftover miso soup in the microwave as he did something on his computer and mumbled a greeting in response. He was wearing his glasses, red eyes narrowed and concentrated on his screen, one finger pressed into his lips and brows furrowed like every time he got focused, and Izuku would be lying if he said it didn’t make him feel something. Really, seeing Kacchan do anything made him feel that something, but he tried to ignore it. Kacchan was his closest friend, of course seeing him would make him feel…warm, or whatever. “What are you working on?”\n“School thing,” Kacchan muttered, and Izuku knew he wouldn’t be getting more of an explanation than that, at least not until Kacchan was done with whatever the project was. As Mina would say, he was in the Fashion Zone.\nInstead of bothering him, Izuku just made himself some breakfast and sat at the counter, pulling out his phone to check for any important notifications before he had to go to class for the day. There were more congratulatory replies from friends and fans – it was so weird to think that he had fans, but he didn’t know what else to call them – and a few message alerts from people sending him things they thought he’d want to talk about.\nAnd then he found the Kacchan comments. There were always Kacchan comments when Kacchan joined him on streams, and sometimes when he wasn’t there at all, because his little voice cameos had that much impact on people (Izuku understood one hundred percent, of course). Many of them fawning over Kacchan’s deep voice – which, okay, they had a point – and even more seeming to claim he and his roommate had some sort of relationship beyond friendship. Those suggestions never failed to make Izuku think he was about to pass out. \nHim, dating Kacchan. \nOr, more accurately, Kacchan dating him. Yeah, not likely, and very not true. Maybe his viewers thought that because they couldn’t see how way out of his league Kacchan was – Izuku had been told he was cute a few times by people that weren’t his mother, but Kacchan was…Kacchan was hot, if he were to put it bluntly. Kacchan was hot and cool and Kacchan, he was just Deku, and that was that. Their Venn diagrams were far from intersecting in terms of dating.\nTherefore, Izuku thought it was best to ignore the tweets and chat messages the best he could rather than embarrass himself in flustered attempts to explain that they were just friends. He ignored them, Kacchan never saw them, it was all fine.\n \nHe got back from classes later that afternoon to an empty apartment with Kacchan still at school for what he guessed would be a few more hours, since it was nearing finals season and his friend preferred not to bring his projects home where Izuku would undoubtedly do something stupid like spill soup on cashmere or step on a pin cushion. Kacchan only ever brought a sewing project back to the apartment if he absolutely had to, but Izuku loved it when he did. Seeing Kacchan in his element, all focused and intense, was amazing. \nIzuku worked on his own classwork for a while, texting Kacchan to ask him to pick up groceries for dinner before he got home in between drafting papers and taking diligent notes on textbook chapters about his favorite subjects. After a few hours of work and response from Kacchan that said ‘fuck you’ that let him know Kacchan was on it, it reached the time in the afternoon when he was usually online. He quickly finished the last part of his assignment and grabbed his black and green headphones, then logged on to Twitch and started a new stream. It didn’t take long for viewers to start coming in, spamming the chat with exclamation marks and hi deku!!s that never failed to make him both flustered and happy.\n“Hey everyone!” he said to the camera, smiling. It had taken him a while to get comfortable talking to a camera when he wasn’t just rambling about superheroes, but he liked to think he was better at it now than he was back in first year of high school. “Sorry for starting a little later than usual, I had to finish up an assignment. My professor is pretty harsh about late work.”\n\nChat\n\n[MOD] TheEighthUser: hi deku!! :D\nAbsolutelyNot: Good job being a good student!! ( •̀ ω •́ )✧\nFrogzz: ughhh, school is ew\nanquelbean: yikes, strict professors suck :/\nHoneyComb: what was the assignment? (also congrats on 3mil!!)\n“Thank you!” Izuku said, reading through the chat messages he could see, “Yeah, my professor’s pretty strict but he’s a really good teacher. And the assignments are super interesting! They just take a lot of time,” he continued, leaning back in his chair and running a hand through his unruly hair. He should probably take a shower. “But, you know, life of a college student.” He lowered his voice to an impression of All Might’s. “I’m an adult now, so I have…responsibilities.”\nHe laughed at himself to his empty room, Kacchan’s voice popping into his head unannounced to tell him how stupid he sounded. Screw off, Kacchan, he’s an adult.\n“Anyways,” he snickered, opening Steam on his desktop and clicking on one of his favorite games, an All Might RPG he and Kacchan used to play as dorky eleven-year-olds squeezing in next to each other in front of the Bakugous’ TV. “My brain is tired, so let’s beat up some nomus!”\nHe played the game for an hour or so, answering questions in the chat and rambling about the history of the game and any easter eggs he happened to notice as an All Might super-fan who knew way too much about this bullshit – Kacchan’s words, not his, as if Kacchan knew any less about niche nerd things that he did. He got so caught up in all of it he didn’t hear the front door of the apartment open, or the first few times Kacchan called his name.\n“This specific nomu design is actually one that’s been around since the original All Might comics, which is why it’s recognizable to a lot of-”\nIzuku’s rant was cut off by the door to his and Kacchan’s shared room opening with a bang and Kacchan’s gruff voice snapping, “Deku.” \n“WAH!” Izuku yelped, startling up so suddenly he nearly fell out of his chair and slapping a hand over his racing heart, “-chan! Kacchan! Hi!”\nKacchan glared at him from the doorway with one eyebrow raised. “Come on, fucker, you’re helping me unpack groceries.” Before Izuku could respond, Kacchan hooked his foot through the armrest of Izuku’s wheeled chair and yanked him out of frame. \n“Ah, okay!” Izuku yelped, quickly shedding his headphones to avoid yanking his whole setup off his desk with the still plugged-in wire and scrambling out his chair before Kacchan could pull him all the way into the kitchen. “Be right back, everyone!” he chirped, pausing the game with a little wave at the camera before following Kacchan into the kitchen, where his friend had started putting things away after abandoning Izuku’s chair in the bedroom doorway. “Thanks, Kacchan!”\n“You’re doing it next time,” Kacchan responded, tossing him a bag of vegetables to put in the fridge.\n“Sure,” Izuku answered, “But only if you give me a list, otherwise I’m buying all the wrong things again and you’ll get mad at me.” \n“I got mad at you because you bought two fucking vegetables, Deku,” Kacchan huffed, glaring at Izuku out of the corner of his eye. Izuku grinned back sheepishly grabbing some more items from the grocery bag to put away and finding that Kacchan has bought a few small cartons of strawberry milk.\n“Ah!” Izuku gasped, “Thank you, Kacchan!”\n“Whatever,” Kacchan said, not even looking up to see what Izuku was talking about, “Just make sure to save some for the rest of the idiots.”\n“Aw, Kacchan, you’re being nice again,” Izuku smiled, only for his smile to drop as Kacchan turned to glare menacingly at him, revealing the eyes of a design student on crunch time that did not need to be messed with right now. “I gotta go back to my stream now thank you bye!” he blurted before making his quick, tactical retreat back to the bedroom with a carton of strawberry milk and a fuzzy feeling in his chest. Kacchan seemed to love pretending that he thought of his friends on accident or only in passing, but that didn’t change the sweet things he did every so often. \n“I’m back!” he announced, slipping his headphones back on and lifting his carton, “and Kacchan bought me strawberry milk!”\n\nChat\n\nLesbianNebula: yum!! (*^▽^*)\nNerdCandy: wow kacchan how kind of u 😏😏\nRedWingHawks: simp behavior methinks…\ncarrotstix: I love strawberry milk!! &lt;3\nDabiDabiDoo: is kacchan going to play with you?? I missed him last night im sad\nBubblegumMirko: wait I wanna hear more about the nomus! (/≧▽≦)/\nIzuku elected to ignore the comments about Kacchan, sipping his milk as his cheeks heated even thinking about the suggestion of the possibility of Kacchan doing anything close to simping for him, instead focusing on the messages on what he’d been rambling about before. \n“Okay, back to what I was talking about,” he smiled, setting down the milk carton, “the nomu character that I was fighting was designed by Horikoshi way back in the very first All Might comics, which is why merch designs nowadays still have nomus with those bat-like wings even though they’re all so different!” He glanced back at the posters on his side of the room to look for any sign of the nomu that he could show the viewers, only for the door to the bedroom to open again as Kacchan came back in.\n“Wait, nerd, before you get back into your dumb shit,” he smirked, and Izuku noticed one hand hidden behind his back. His childhood instincts immediately screamed at him to run away from whatever Kacchan was holding, so he shuffled his chair back a bit. \n“What…?” he said, trying to hold back a nervous laugh as Kacchan continued to smirk at him. Then, to his surprise, Kacchan stepped between him and his desk, effectively blocking out the camera with a view of his back. Izuku was suddenly so overwhelmed by Kacchan smirking at him from point-blank range that he hardly noticed his friend slipping something over his head until he’d left, not a word more spoken and hot-faced Izuku in his wake. Well.\nIzuku blinked a few times at nothing to get his brain back in order, then focused on his tiny self in the corner of his monitor to see just what Kacchan had put on him, hoping it was nothing that would embarrass him more than he was already. He couldn’t hold back his laughter when he found a pair of bunny ears on his head, and he didn’t try to, making sure to glare the best he could out his open doorway as he did. “I was seven, Kacchan!”\n“You’re welcome, Small Might!” Kacchan yelled back, and Izuku could clearly imagine the subtle smile he was no doubt wearing somewhere in their living room. “Go eat your fucking carrots!”\n“They were not bunny ears!” Izuku protested through another laugh, remembering the hero costumes he and Kacchan had designed as little kids. He turned to address the camera. “They were so I could look like All Might.”\nThe chat, meanwhile, seemed to be going crazy with the new developments.\n\nChat\n\nRedWingHawks: HWY DID HE LOOK SO BUFF IM GONNA SDFL’;DFL;JD\nHoneyComb: aklskdfl deku you look adorable!!\nMightyShield: KACCHAN??\nFrogzz: Deku why are you blushing sm 👀\n[MOD] TheEighthUser: deku and kacchan lore??? explain pls??\nRedWingHawks: KACCHAN COME BACK\nedamame: bunny ears!!! dekubun!!\nBurntToast: what is happening\nLoserpixels: is this flirting?\nPhoenixShadow: decchan backstory?? what bunny ears??\nNerdCandy: STRAWBERRY MILK AND NOW THIS\nIzuku felt his face heat up dramatically once again, and he covered his burning cheeks with his hand in an attempt to not give himself away any further. God, this was mortifying. \n“Okay, okay, let me explain, guys,” he managed, dropping his hand back to his keyboard. “When Kacchan and I were kids, we designed ourselves hero costumes, and I added little things to the top of mine –” he held his hands up to his head, mimicking the front parts of All Might’s hair “ – like this, so I could look like All Might, of course!” He put his hands down again and faked a pout. “But everyone thought they were bunny ears and Kacchan has never stopped making fun of me for it.”\nHe aimed his voice out the door towards his roommate. “As if you weren’t the one who put grenades or your arms!” \n“Those were badass!” Kacchan yelled back, apparently close enough to hear him and making Izuku laugh.\n“Sure they were, King Explosion Murder!”\n“That’s Great King Explosion Murder God Dynamight to you, loser!”\n“Right, right,” Izuku laughed, smiling comfortably at the old memories that came with that dorky nickname, “Great King Explosion Murder God Dynamight. Imagine that guy being your best friend. I was the luckiest kid on the block.” He glanced at the clock in the corner of his computer screen to see that it had been a few hours since he started and sat up a little more in his chair, stretching out his shoulders. “Alright, everyone, I think I’m going to call it there since I still got homework to do. See you all later and thank you for stopping by!” \n \n--\n \n\nneon-froggy\n\nGREAT KING EXPLOSION MURDER GOD DYNAMIGHT??\n#everything about the end of that stream was GOD TIER for the decchans #oh my god #childhood friends moments?? #kacchan on screen?? #strawberry milk?!? #BUNNY EARS?!?!? #DEKU BLUSHING?!?!?!? #PERFECTION #deku #kacchan\n \n\nboomboombitches\n\nlisten. listen. of course I have thought about what kacchan looks like and of course I assumed he’d be hot because of his voice but none of that could’ve prepared me for seeing him be THAT MUSCULAR?? LIKE HOLY SHIT??\n#I AM LOOKING RESPECTFULLY #AT HIS SHOULDERS #WOWEE #throwback to the time we saw his hands for the first time #this is like but 10x more so\n \n\ncup-o-noodlez\n\nI didn’t think it was possible to love deku any more than I already do but I was WRONG. BUNNY DEKU FTW\n#how is he hot and cute at the same time #thanks kacchan I owe u my life #*looks at kacchan getting smiled at by deku* god I wish that were me\n \nDEKU! @smallmight\nthen vs now (costume courtesy of my mom, bunny ears courtesy of kacchan)\n[Image: An older picture of a young Deku grinning in a homemade green hero costume with a hood pulled over his head, two large “ears” on the top as, then a picture of current Deku with a pair of costume bunny ears on his head, smiling at the camera with fingers held in a peace sign beside his face.]\nOchako✿ @uwuraka\nReplying to @smallmight adorable then adorable now babes &lt;3\nboops @vintagecomicbook\nReplying to @smallmight AL;SKDDFKJ OH MY GODDDDD EVERYTHING ABOUT THIS\ndeku my beloved &lt;3 @twelveturtles\nReplying to @smallmight how are you so darn cute deku ヾ(≧▽≦*)o\n“You know you have fan accounts, right?”\nKatsuki didn’t look up from his sketchbook, too busy trying to figure out proper measurements for his final project to indulge Mina in whatever gossipy conversation she wanted to engage him in. Not that his disinterest had ever stopped her or ever would – every single one of the four idiots he hung out with would talk his ear off before letting his bad attitude towards socialization get in the way of their rambles. Annoying shits.\n“This one has like, two thousand followers,” Mina continued, scrolling through her phone from her seat near the other end of the large workroom table covered in scattered fabric scraps and sketch pages. “’I could literally fall asleep to his voice it’s so soothing’,” she read aloud, followed by a poorly hidden laugh, “That’s one way of describing it.”\n“Fuck off,” Katsuki countered, marking the length of a pattern piece on his drawing and glancing up to inspect the mannequin he’d pinned his mockups to earlier. He honestly couldn’t care less about fan accounts or weird extras fawning over his voice on the internet as long as they didn’t fuck with him directly or get creepy. It helped that he avoided social media like it was the plague, and therefore never had to see that shit.\n“Ooh, this person is freaking out about your shoulders,” Mina said with an eyebrow raised, looking over at Katsuki with a look of appraisal. “Fair.” \n“What the hell,” Katsuki scowled, “that’s weird as shit.”\nMina shrugged. “What can I say, Blasty, people are drawn to mystery, and you’ve created quite the persona.”\n“So you’ve said,” Katsuki grumbled, snapping his sketchbook closed and raking a hand through his hair with a huff. “Bunch a fuckin’ extras don’t need to know shit about me.”\n“Doesn’t help that everyone’s got a crush on Mido but can obviously tell he’s only got eyes for you,” Mina added nonchalantly, followed by a loud crack from Katsuki accidentally snapping his pencil in half by gripping it too tightly. \n“Shut the fuck up,” he snapped, ears dangerously warm as Mina gave him the least believable look of innocence he’d ever seen.\n“What, I’m just saying!”\nKatsuki glared at her. “I fucking told you to stop it with that shit.” Over the past few years, Mina seemed to have developed a Todoroki-level conspiracy that led her to believing Deku had some kind of crush on Katsuki. Which was an absurd fucking idea, and Katsuki didn’t think that from lack of confidence in himself, but merely from the fact that it was Deku. It’s not like the looks he gave Katsuki were any different than those he gave to limited edition All Might merchandise. The fucking dork blushed when his own mother called him a ‘handsome young man’. He was Deku. They were friends. Enough said.\n“The internet agrees with me, Katsuki!” Mina protested, waving her phone around in its fluffy pink phone case as if that argument helped her in any way. “He likes you back!”\nKatsuki stood up so fast his chair went screeching backwards and nearly toppled over. “I never fucking said I like him!” he yelled, glaring at Mina, who seemed entirely unperturbed.\n“Yeah, but you never talk about your feelings anyway,” she pointed out, sounding like Katsuki’s therapist or her fucking girlfriend, “you’re more of a ‘show don’t tell’ guy.”\n“I’m gonna kill you if you don’t shut the hell up,” Katsuki threatened, not at all interested in a breakdown of his character for Mina to prove he had a thing for the nerd. Which he didn’t. Or at least, not that much of a thing.\n“Even now, you’re not denying it-”\n“You know what, fuck you, you can go home by yourself,” Katsuki interrupted with his ears burning red, snatching his stuff of the worktable and starting out the door.\n“Wait, no, Katsuki!” Mina yelped, scrambling to collect all her things and chase after him. “Come on, I’m just trying to help out!”\n“Well, it ain’t fucking needed or appreciated,” Katsuki snapped, “Stay out of my damn business.” He did not have feelings for Deku. Would he say yes if Deku offered? Sure. Well, maybe. Deku would never do that anyway so the question was irrelevant.\nMina sighed, her heeled leather boots clacking on the floor of their school hallways as Katsuki’s intimidating presence cleared their way through any other students who happened to be there this late into the day – which was most of them, thanks to final projects being due soon. “I swear there’s something between you two.”\n“Yeah, it’s called fucking friendship,” Katsuki said, glaring at her as they exited the building they were in and headed for the train station. “Deku’s not into me and the internet is fucking insane.”\n“Random question, but do you even watch his streams?” Mina asked.\n“Why the hell would I do that when I see his stupid face every damn day,” Katsuki responded, scowling. He lived with the nerd, he didn’t need to watch him through a screen to see him ramble about All Might and suck at video games for three hours. He’d been seeing that shit every day since he was four. Mina sighed again. “You fucking got something else to say, bubblegum?” he snapped.\n“I’m too tired for this, topic dropped,” Mina said, adjusting the bag over her shoulder, “Your mess of a love live can wait until after I’ve killed these stupid finals and established myself as queen of fashion school.”\n“Oi!”\n“You can be king, but Ochako might hit you.”\n“Fuck her, I can be king if I – I mean fuck you, my love life is not a mess!”\n \nKatsuki and Mina parted ways after disembarking the train at the same stop, Mina heading to the small apartment she shared with Uraraka and Katsuki to the one he shared with Deku. As he expected, Katsuki entered the apartment to the sound of Deku chattering away to whatever nerds seemed so inclined to hear what he had to say, most likely not hearing him come in. Instead of going to bother him like usual, Katsuki went straight to the kitchen to start dinner, because he’d been so busy today at school that he’d pulled a Deku and forgotten to eat lunch.\nAs he moved about the kitchen, gathering everything he needed to throw together a meal of leftover curry and whatever else he thought would be good, he found himself unconsciously tuning into Deku’s bubbly voice through the wall. He was talking about the comparative powers of characters in a superhero fighting game, pointing out some secret move he found out about by trying to copy the character’s move in a comic book he read, and he sounded so damn interested and happy about it that Katsuki had the strange urge to bang his head into a wall.\nIt wasn’t because he was into him, though. Because, again, while he could admit that Deku was cute – sometimes – he wasn’t dying to date him or anything. That would be…why was he even thinking about this. Mina was seeing things, extras on the internet didn’t matter in the slightest, it was whatever.\n“Deku!” he called out, mostly to get his brain away from stupid thoughts and back to reality.\n“Hi Kacchan!” Deku called back after a moment, “What’s up?” \n“You want curry?”\nInstead of an answer, he got Deku blurting something to his viewers and practically racing out of the bedroom and into the kitchen. “No, don’t make stuff!” he cried, slapping his hands down on the counter with a pout, “I was gonna make you dinner tonight because you’re working so hard on things.”\nKatsuki tried to frown at him and ignore the traitorous heat in his face and ears at the sight of Deku still wearing the stupid bunny ears he’d apparently put on at some point and forgotten to take off, his nose crinkled up with the pout like he was, well, a rabbit. “Why?”\n“I just said!” Deku admonished, throwing his hands up then grabbing Katsuki by the arm to start dragging him out of the kitchen, “You’ve been working really hard on school, and you made dinner the past few days, so now it’s my turn.”\n“It’s just reheating curry,” Katsuki pointed out, letting himself be pulled away regardless until Deku deposited him behind the counter that split the kitchen from the living room.\n“Shush,” Deku said, “I am making you dinner.”\n“You’re gonna burn something for sure,” Katsuki countered. Deku was a perfectly fine baker, but for whatever reason he couldn’t cook for shit.\n“I will not,” Deku objected, returning to the other side of the counter and looking at the food Katsuki had already gotten out, “You’ll be watching me the whole time and you’d never let that happen.”\nKatsuki snorted, leaning forward to prop his elbow up on the counter and rest his chin on his fist. “Alright, bunny.”\nThere was a loud crash as Deku literally yanked the spice drawer he had been looking in off its hinges, making Katsuki shoot up straight again in surprise. Deku yelped, quickly lifting the drawer up and fitting it back where it belonged, muttering something incoherent and nervous as he did.\n“What the hell, nerd?” Katsuki snapped with a barely hidden laugh, “Fine, you’re not burning shit, you’re breaking shit!”\n“I-you-it was-shut up,” Deku stammered, burying his surely red face in his hands and turning away from Katsuki. Katsuki snorted again, which got Deku to laugh and fold over the counter in embarrassment. “You saw nothing.”\n“I saw plenty,” Katsuki countered, “You’re destroying our kitchen.”\n“It was your fault!” Deku protested, whirling around to face Katsuki and reveal that his cheeks were, in fact, beet red.\n“How the fuck was it my fault?”\n“You were the one who-” Deku cut himself off with one accusatory finger held out, meeting Katsuki’s eyes for a second before looking away. “Aaaagh, I hate you.”\n“What the hell did I do?” Katsuki pressed, raising an eyebrow.\n“You called me bunny!” Deku blurted, throwing his hands up. \nKatsuki’s brain shut down. Rebooted. And then, finally, he barked a laugh. “’Cause you’re wearing the fucking ears, dumbass.”\nDeku’s eyes went wide, and he slowly reached up to pat the top of his head and find that the ears were actually still there. “Oh.”\n“Yeah, stupid, what the fuck did you think I was saying,” Katsuki scoffed.\n“Nothing!” Deku squeaked, a little too fast, taking the ears off and tossing them on the counter, “Nothing at all. Who knows? It was whatever.”\n“Oh…kay,” Katsuki said, narrowing his eyes as Deku gave him an awkward smile and turned back to the food. Fuckin’ weirdo.\n“Anyways!” Deku said, a little too loud as he set the timer on the microwave, “How was your day?”\n“’S fine,” Katsuki answered, leaning on the counter again, “Made progress on my shit, Miss Midnight was annoying as fuck, nothing new.”\n“What’d she do this time?” Deku asked, by now familiar with Katsuki’s history of fashion teacher due to his consistent complaints about nearly everything she did – he would admit she knew what she was doing, but that didn’t make it any less bothersome when she lectured for an hour about bondage gear making its way into mainstream fashion and said nothing about what she actually should’ve been talking about. It wasn’t like he needed her to tell him that when the way she dressed was proof enough.\n“Today was all about fuckin’ boob windows,” Katsuki said.\nDeku laughed. “I bet Mina had fun with that.”\n \n--\n \nHoney | mirko’s fluffy tail @honeycomb\nthe way deku heard kacchan call for him then /immediately/ stopped streaming….deku do you have something to share with the class\ngreat explosion murder max @freckledeku\nReplying to @honeycomb gay gay homosexual gay\nall might is gay @mightyshield\nReplying to @honeycomb not to mention his eyes LIGHTING UP when kacchan called his name uggghh they’re so OBVIOUS I STG\ndeku my beloved &lt;3 @twelveturtles\nDeku wearing the bunny ears again on stream!! I’m crying he’s so cuuuutttee 😭😭💚💚\n \nDEKU! @smallmight\nI just watched kacchan take a bite of the curry I made, make a face, then go find our cayenne pepper and dump like an entire tablespoon on his food. bear in mind I already put more spice than necessary. help\nMinaaaaa @alienkween\nReplying to @smallmight same but opposite energy as the time he dumped a cup of sugar into his coffee in chugged it in one go\nOchako✿ @uwuraka\nReplying to @smallmight and @alienkween what a guy.\n--\n \nThat weekend, Katsuki somehow found himself in Mina and Uraraka’s bathroom, along with the rest of the idiots, having been dragged into their latest craziness as Mina chided him and Deku about working themselves too hard for school. Today’s goal was to, apparently, cut Uraraka’s hair so she could have the “lesbian undercut of her dreams” – Mina’s words, not his. Oh, and they were doing it on stream, because of course they were.\n“Why the fuck aren’t we just going to a hairdresser’s?” Katsuki asked, not for the first time but still confused as to why he had to be standing behind a camera as five whole people squeezed into the tiny apartment’s bathroom. Deku was perched on the lip of the bathtub for space. Todoroki was sitting in the bathtub.\n“Because it’s way more fun this way,” Mina answered, plugging the electric razor into the wall socket. She flicked it on, making it buzz loudly, and Katsuki immediately bristled. \n“Be fucking careful with that thing!” he snapped. \nMina shut the razor off and grinned at him. “Chill out, mama bear, I’m fine.”\n“What the hell is that supposed to mean?” Katsuki scowled.\n“It means you’re the mom friend,” Uraraka answered from her stool in the middle of the bathroom, digging her hand into a bag of chips then passing them to Deku, who was nodding along with her. Traitor.\n“You would make a wonderful mother,” Todoroki commented from the bathtub, “You’ve packed us all lunch before, and there was that time at the museum.”\n“Mama bear Kacchan,” Deku agreed with a shit-eating grin.\n“I fucking hate all of you,” Katsuki grumbled. \n“Love you too, Kacchan,” all four of the idiots responded in unison, because they were a hive mind formed with the sole purpose of annoying the shit out of him on the daily. Letting people make friends with him was a mistake and he’d known that since the second he laid eyes on one Todoroki Shouto.\n“Die.”\n“You wish,” Uraraka said, grinning at him smugly.\n“Kill me yourself,” Deku challenged, sticking his tongue out.\n“I’ve been dead for thirty years,” Todoroki deadpanned.\n“Haircut time!” Mina announced. Katsuki, who had been busy sticking his tongue back out at Deku while flipping him off, turned his attention back to the unfolding disaster and kept careful watch on the electric razor. Who fucking cares if he’s a mom friend – if he weren’t, these dumbasses would’ve died a long time ago.\n“Okay!” Uraraka chirped, clapping her hands and turning her attention to the computer screen while Mina started collecting parts of her hair into a ponytail, “This is a Q and A, so let’s hear some questions! They can be for any of us ‘cause we’re all here.”\n“I ain’t answering shit,” Katsuki corrected, hoisting himself up to sit on the bathroom counter.\n“You always say that,” Deku pointed out, tossing another chip in his mouth, “And you always end up talking.”\n“Because you never get anything right!” Katsuki snapped\n“First question!” Uraraka said, interrupting what would’ve surely turned into yet another wrestling match, “How long have you and Mina been together?”\n“Three years by next month,” Mina answered, leaning down to kiss her girlfriend’s forehead as Uraraka tiled her head back to grin up at her. Katsuki didn’t miss the look Deku gave them, like he was seeing the most adorable puppy in the world and lamenting the fact that he didn’t have one back home. Did the nerd want a fucking dog?\nKatsuki did not at all like the fact that he found himself wondering about what breed. He. Did. Not. Care. And that analogy was stupid.\n“We started dating in high school!” Uraraka continued, “First year.” \n“Thank god we didn’t have to endure that pining for another two years,” Deku added good-naturedly, and Katsuki was inclined to agree. The two of them had never stop staring at each other or stuttering over words like the smitten messes they were, and it was infuriating to watch.\nUraraka, Mina, and Todoroki didn’t seem to have the same idea, however, if their blank stares in Deku’s direction were anything to go by. Deku stared back at them nervously.\n“Yeah,” Todoroki finally monotoned, “Thank god there’s been zero pining in this group of friends since then.”\n“Yup,” Mina answered, for some reason glancing at Katsuki then dead into the camera.\n“What the fuck are you three talking about?” Katsuki cut in, scowling at them. \n“Nothing,” Uraraka said, not even looking at him, “Next question!”\nThe next few rounds of questions Katsuki mostly tuned out, bored by answers to things he already knew and shit that really had nothing to do with him. He never said it aloud, as he’d never felt the need to, but sometimes hanging around these idiots was enough by itself to melt away his stress, if only for a moment. He’d never really thought he’d have that feeling with anyone but Deku, but there was at least a version of it with the other three. No matter how fucking annoying they were.\nHe tuned back in a bit when he heard Deku say his name, glancing up slightly to find him grinning. “It’s what Kacchan used to call me when we were kids! My real name’s kanji could be misread as ‘Deku’ and Kacchan thought that was funny, then it kinda stuck around.” Ah, someone had asked about the nickname again. “Kacchan and Deku are actually both childhood nicknames!”\n“Yeah,” Mina cut in, “and if any of us non-Dekus call him Kacchan off stream he tries to kill us.” Katsuki scowled at her, and she just smiled sweetly in response and went back to her attempts at cutting Uraraka’s hair.\nHe tuned back in all the way when Uraraka laughed obnoxiously loud, reading something off her screen. “Midori-Cat asks if Kacchan is, quote, as hot as he sounds.” She snorted again, glancing over at him. “I dunno, how hot does he sound?”\n“Fuck off,” Katsuki grumbled, flipping her off as he did.\n“I mean, I’m not into men, so I can’t really pass judgement on that,” Uraraka said, ignoring him, “Any guy-lovers want to answer for the dear viewers? Scale of one to ten.”\n“He’s like…a solid nine,” Mina smirked. \n“Fuck you!” Katsuki objected, “I’m a damn twelve!”\n“And a fifteen if you’re not making the gremlin faces,” someone muttered, and Katsuki had to do a mental double-take to make sure it had really been Deku, staring at a spot on the floor with the look he got when his mind was half-somewhere else. Everyone was dead silent for a moment, then Uraraka broke into a small grin.\n“So you think he’s hot?” she asked before Katsuki could stop her.\n“Yeah, duuuuu-” Deku’s eyes slowly went wide as he glanced up and seemingly remembered where he was and who exactly he was with “-uuaaaaAAAAAH I MEAN MAYBE,” he yelped, cheeks turning red as Katsuki felt his own ears burn, “I was-I wasn’t-I mean he is, you are, I just…” Deku trailed off, then broke eye contact with Katsuki and jumped to his feet, “I have to go to the bathroom!”\nThe room was quiet for a few beats of awkward silence after Deku made his escape, Uraraka looking very pleased with herself while Katsuki tried not to let his brain turn into a pile of scrambled eggs or a dumpster fire. Eventually, Todoroki piped up, again from his seat in the bathtub, “We’re already in the bathroom.”\nWhat an astute fucking observation, Half-n-half.\n \n--\n \ngreat explosion murder max @freckledeku\nA;LSKDJHSLA;FJS;FK; SCREAMS FOR SIX HOURS THAT COULD NOT HAVE BEEN REAL!!!!\nHoney | mirko’s fluffy tail @honeycomb\nReplying to @freckledeku what happened???\ngreat explosion murder max @freckledeku\nReplying to @freckldeku DID YOU NOT WATCH OCHAKO’S STREAM HONEY???\nHoney | mirko’s fluffy tail @honeycomb\nReplying to @freckledeku I HAD SCHOOL 😭😭\ngreat explosion murder max @freckledeku\nReplying to @honeycomb GO FIND IT ON YOUTUBE RN DEKU CALLED KACCHAN HOT THEN GAY PANICKED\nHoney | mirko’s fluffy tail @honeycomb\nReplying to @freckledeku OH MY GODDDDD I NEED TO SEE\nmoon @moono_pixie\nnot the rest of the dekusquad basically confirming that kacchan and deku have been pining after each other for YEARS 😭😭😭 mina looked so Done with them I swear\n \n--\n \nIn the ten minutes it took for Izuku to finally come back into the bathroom, Uraraka had graciously moved onto other questions while Izuku tried to set his brain back in order and wished he could disappear off the face of the planet. One second he was listening to his friends having a good time and poking fun at Kacchan, the next he was muttering things out loud and admitting things he really should be keeping in his head. He tried calming himself down by thinking of all the ways it could’ve been worse – he could’ve told Kacchan he looked cute when he was sleeping or that one very strange night in second year where he dreamed about his arms, however that would’ve come up naturally – but all that succeeded in doing was making him feel like his face was melting off. If there were any god that loved him, he’d have been struck down by lighting right then and there.\nBut there was no god, at least not a merciful one, and he had to go back inside before anyone started worrying about him.\nThankfully, the topic was not brought up again, but Izuku could feel Kacchan’s eyes on him almost the entire time, right up until his roommate got distracted by Mina’s haircut job and started snapping directions at her. Mina argued that her mom was a hairdresser, Kacchan countered that “that shit’s not exactly hereditary knowledge”, and they ended up lowering the camera so he could take over without his face being seen. He also threatened to shave Uraraka’s head all the way. Todoroki made another mom friend comment. It was whole thing.\nIn fact, Izuku got so caught up in the normal chaos of all his friends in one place that he almost completely forgot about his entire debacle until he and Kacchan were all the way back at their apartment building, riding up the elevator in comfortable silence. It was almost like Kacchan had been waiting to trap him where he couldn’t run away.\n“So…,” Kacchan started, raising an eyebrow as he leaned back against the wall, hands in his pockets like some 80s greaser high school sweetheart, “fifteen out of ten, huh?”\nIzuku’s face lit on metaphorical fire in seconds. Kill him. Kill him right now. Code red brain meltdown initiated oh hell this was bad. “Uh,” he managed eloquently, unable to meet Kacchan’s eyes from the sheer embarrassment that could only come from admitting that you thought your best friend was attractive, to his face, after years of managing to keep that yourself. Someone get him a scientist to classify him as a natural (bisexual) disaster. Oh god.\n“I’d say…three,” Kacchan said, making Izuku look up with a hint of confusion. He was met with a smirk and a look in Kacchan’s crimson eyes that made him shove his hands in his pockets so as not to fan himself like an overdramatic Victorian woman. \n“What?”\n“Maybe five on a good day,” Kacchan continued, and in the few seconds it took for things to finally click in Izuku’s brain, the elevator door opened and Kacchan pushed himself off the wall.\n“You jerk,” Izuku pouted, narrowing his eyes at his friend and following him out of the elevator, “I’m at least an eight.”\n“According to who, your mom?” Kacchan scoffed, smirk transforming further into what was more of a teasing smile, “News flash, Deku, Auntie has to say that, she’s your mother.”\n“You’re calling my mother a liar?” Izuku gasped in mock offense, “She would never!” He grinned, throwing his arm around Kacchan’s neck and yanking him down into a headlock. “Now take that back!”\n“Fuck no!” Kacchan yelled, suddenly wrapping his arms around Izuku’s hips and lifting him off his feet before he could stop him. Izuku yelped, finding himself hoisted over Kacchan’s shoulder like a sack of flustered potatoes, his headlock attempt completely thwarted in what was arguably the best and worst way possible. “Ugly loser.”\n“Put me down!” Izuku demanded, unable to stop laughter from permeating his complaints. He kicked his feet around, trying to hit Kacchan in the face, but Kacchan just shoved his feet away with a snort of laughter. “You know what, I’m gonna…,” Izuku said, then trailed off, not entirely sure what he was going to do. In a split-second decision he decided on hugging around Kacchan’s waist like an upside-down koala, thereby shoving his nose into Kacchan’s shirt. \n“What the fuck are you even doing?” Kacchan guffawed.\n“I don’t know!” Izuku laughed, squeezing tighter as the blood rushed to his head. Kacchan was having zero problems carrying him, huh? “I think I’m gonna puke, honest-”\nAnd then their neighbor’s door opened. \nIzuku snapped his mouth shut with a slight sense of dread, slowly tilting his head to the side to meet eyes with an elderly gentleman in his pajamas, holding his room’s door open and staring Izuku down with harsh, judgmental old man eyes as Izuku hung upside down over Kacchan’s shoulder. Uh.\n“Good evening, Mr. Kiyabu,” Izuku finally said after far too many moments of uncomfortable silence, smiling awkwardly, “Hope you’re doing well.”\n“Later, gramps,” Kacchan cut in rudely before Mr. Kiyabu could respond, quickly unlocking the door to their apartment, carrying Izuku inside, and slamming the door closed behind them. \nThe second the door to their apartment shut, the two of them broke into laughter, Kacchan practically squealing like a boiling kettle as he barely made it to the couch to dump Izuku off his shoulder. Izuku, for his part, was laughing so hard his abdomen hurt and he was starting to find it difficult to breath. Kacchan’s barks of laughter dissolved into giggles, then snorts, then he all but collapsed onto his knees and pressed his forehead into the coffee table, his entire body shaking. The entire scene only made Izuku laugh harder than he already was, and he was pretty sure he was going to die soon.\n“Good-,” Kacchan finally managed, sucking in a breath that turned into a squeal, “good evening? You fucking-HAH!”\n“I didn’t know what else to say!” Izuku protested through a wheeze, gripping his stomach and shoving his face into the couch cushions. This was always how things ended up when he started laughing too hard with Kacchan – he’d be lucky if he weren’t still snickering about this by tomorrow morning. “He’s gonna hate us now for sure.”\n\"Now?” Kacchan barked, snorting, “That asshole hated us since we moved in!”\nIzuku rolled over on his back, trying to take deep breaths as the last bits of laughter forced their way out. “That’s your – hah – your fault, Kacchan.”\n“Why the fuck does everything gotta be my fault?” Kacchan groaned, reaching over to slap Izuku’s arm half-heartedly.\n“Because!” Izuku laughed, “You’re the one who carried way too many boxes at once to prove you were stronger than me, then almost kicked down his door because you couldn’t see which-”\n“Shut the hell up.”\n“-which one was ours,” Izuku pressed on, “and then I almost ran into you because you were outside the wrong door, and then you got mad because I almost ran into you, and then you almost dropped my bronze age figurine, which was really expensive and you-AH!” Kacchan yanked him off the couch before he could finish rambling, making them both narrowly miss the coffee table as the tumbled to the ground, Izuku landing face-down on top of Kacchan with a yelp.\n“Gah! Get the fuck offa’ me!” Kacchan snapped, shoving him to the side where he hit the couch, making it screech backwards a bit until there was just enough space for Izuku to flop over on his back, head resting on Kacchan’s arm and halfway under the couch as he laughed.\n“You’re the one who-,” he cut himself off with a giggle, tilting his head to the side to better look at Kacchan, “-you’re the one who yanked me on top of you!”\nKacchan stared back at him strangely for a moment, his expression unusually soft. He almost looked surprised. Izuku felt his face grow warm. “Fine,” Kacchan said eventually, pushing the coffee table out of the way and sitting up, “eight on a good day.”\nBy the time Izuku registered what he meant, Kacchan had already disappeared into the bedroom, and he sat up so fast he banged his head into the bottom of the couch. “OW!”\nIzuku’s head hurt for the rest of the day, but he was a little to busy trying not to fall apart while getting all his schoolwork done to think about it much. The most Kacchan had ever said about Izuku’s look was teasing him for having bird’s nest hair or calling him ugly after he just woke up. The most Izuku had ever said back was absolutely nothing, because he knew the second he did it would turn right into every time he complimented anything about Kacchan, which is to say he’d ramble for an hour and embarrass the hell out himself. \nNot to mention the split-second thought he’d had about kissing him, which had since occupied his panicked mind for hours before he finally fell asleep. His tiny, accidental comment/confession had somehow spiraled into a full-on crisis. Kacchan was cool and talented and good-looking and amazing and Izuku knew all that, had always known all that, but for whatever reason was only now panicking about it. \nKacchan would never want to date him. Another thing he knew.\nBut did he want to date Kacchan?\nNo, he didn’t, that would be crazy because Kacchan’s just his best friend in the entire world but they’re not-\n“Hey nerd.”\nIzuku startled a bit and glanced up to find Kacchan leaning over the kitchen counter, propped up on his elbows with his somehow perfect bedhead that Izuku had always envied, reading glasses perched on his nose as he gave Izuku a somewhat sleepy smirk that really just looked like a smile. He sounded like he woke up two minutes ago. And he was giving Izuku that look again.\n“You look like shit.”\nOh no.\nOh no, this was very incredibly bad. \nNot that he looked like shit – Kacchan told him that all the time – but the fact that he was feeling feelings that he did not want to be feeling right now.\n“Yup,” he managed like an idiot, quickly busying himself with grabbing breakfast so as not to stare at Kacchan any longer and blush at him any harder, “By the way, I’ve got a lot of, uh, work I need to finish today so I’ll probably be in our room for a while,” he blurted, an excuse for the way he was planning to run right back into his bedroom and scream into a pillow. \n“Oh, okay,” Kacchan said, almost sounding disappointed but most likely just confused as Izuku grabbed a bowl of rice and literally nothing else that might be a part of a sane breakfast, “Talk to you later I guess.”\n“Yep!” Izuku responded, voice very nearly cracking in the middle of the word as he escaped to the bedroom and away from ~Kacchan~, “Have fun in your classes!” he called for politeness’s sake as he shut the door, almost entirely sure the unsuspicious factor had been completely thrown out the window at this point.\nThen, he flopped face-down on his bed, shoved his face into his pillow, and tried not to scream too loud. As soon as that was out of his system, he sat up, grabbed his phone, and opened it to his contacts. There was absolutely no way he was working through this by himself if he knew anything about his ramble-y, panicky brain, and the amount he was freaking out right now. For the record, he thought it was a perfectly logical amount to be freaking out about possibly definitely being romantically interested in the man you’ve been best friends with since you were four.\nOchako picked up after a few rings, sounding cheery, “Hey Deku! What’s-”\n“The internet people were right I think,” Izuku blurted without thinking.\nThere was a beat of confused silence on the other end of the phone, then, “What?”\n“The people on the internet,” Izuku repeated, brain running to fast to think about Ochako’s utter lack of context, “I think they might have been right.”\n“About…?” Ochako prompted, and Izuku bluescreened. He didn’t think this whole ‘talking’ thing through at all. “Deku? Are you okay?”\n“No,” Izuku blurted again, then quickly backtracked, “I mean yes. Physically yes.”\n“Are you having a panic attack? Let me call Baku-”\n“No!” Izuku yelped, waving his hands around in a panic, “Nope! Not a panic attack, don’t call Kacchan! No Kacchan needed, it’s fine, I’m fine, I shouldn’t have even-”\n“Deku,” Ochako interrupted in a commanding voice that made him shut his mouth immediately, imagining the look on his friend’s face, “Deep breaths, please.” \n“I, uh…right, okay,” Izuku conceded, inhaling deeply before letting it out and trying to make his heart stop racing. He wasn’t in danger; it was just feelings. “Okay,” he repeated with another deep breath, “I’m good now.”\n“Great,” Ochako responded, “now, what’s wrong? What internet people?”\n“There are…uh, there are rumors on the internet that I…like Kacchan,” Izuku explained awkwardly, bouncing his leg up and down with nervous energy, “In the…you know, romantic sense. Like I want to…” he felt his face go red and wondered why he was still talking “…hold his hand?” he decided on instead of something that might’ve made him combust internally.\n“I…okay,” Ochako said, probably even more baffled now. Izuku was being so weird right now, “and they’re…right?”\n“Maybe,” Izuku squeaked, grabbing his pillow to shove his face into, “I don’t know.”\n“Deku, you’ve held Bakugou’s hand before. I’ve seen that,” Ochako said, matter-of-fact.\n“No!” Izuku protested, face hot, “I mean…the other part.”\n“The romantic feelings,” Ochako clarified, and Izuku wished he could fall through the floor, “You have romantic feelings for Bakugou.”\nIzuku nodded into the pillow before remembering Ochako couldn’t see him and mumbling, “Yeah.”\nTo his surprise, Ochako just huffed a laugh. “Took you damn long enough. I coulda’ told you that back in first year!”\nIzuku simply did not understand. “What?”\n“Don’t worry about it, Deku,” Ochako said, sounding way too happy about this. Then, she laughed again. What the hell. “This is great! Finally!”\n“What?” Izuku repeated, “No, it’s not great! What the hell am I supposed to do?”\n“Uh, take him out to dinner?” Ochako answered like that should’ve been obvious, “Then buy me, Mina, and Todoroki some champagne so we can celebrate. Or we could just steal some from old man Enji.”\n“What?” Izuku said for the third time, this time almost a shriek until he remembered Kacchan might still be on the other side of the door, “Take him out to-Ochako, no! No, no, no! I can’t do that!”\n“Why not?” \n“Because he’d say no?” Izuku explained, baffled as to why Ochako seemed to think otherwise.\n“Because he’d say…oh my god.” Ochako sighed heavily. “I celebrated too soon.”\n“Ochako, what in the world are you going on about?” Izuku asked, feeling tears start to well. Ochako must have recognized the change in his voice.\n“I’m sorry, Deku, I got ahead of myself,” she apologized, “You called me freaking out about this. Tell me why.”\n“I already told you why,” Izuku said, pulling his knees up to his chest and squishing the pillow he’d been hugging, “I walked into the kitchen this morning, and he smiled at me, and I felt like I got hit by a bus.” He sighed, curling in on himself a little further. “I don’t know what I’m supposed to do about this.”\nOchako was quiet for a minute and Izuku felt himself slipping into emotional despair. “You don’t think he feels the same way, do you?”\nIzuku frowned into his pillow. “No, of course not.”\n“Of course not,” Ochako repeated flatly, “Of fucking-okay. Deku, darling, my amazing, smart, beautiful friend, why would you think that? Honest question here.”\n“I don’t…,” Izuku ran a hand through his hair, trying to think of an answer to that question that wasn’t just because Kacchan, “I don’t know, it just doesn’t make sense that he would.”\nOchako sighed. “I want to come over there and give you a hug…then hit you maybe.”\n“Why hit me?” Izuku pouted.\n“Out of love,” Ochako assured him, “Deku, listen. I could sit here and soliloquize for hours about how great and deserving of everyone’s love you are, but I know for a fact you have a class to get to and I have a strong feeling I’m not the person you need to hear it from. So, all I’m asking – wait no, I’m not asking. Do this for yourself.” She paused for a second, and Izuku fiddled with the corner of his pillow. “Just don’t give up too soon, alright?”\nIzuku didn’t answer for a while, mind running a million different directions until his eyes drifted to an All Might plushie tucked into the corner of his bed. Kacchan had given it to him way back on his fourteenth birthday, a rare golden age model he’d tracked down through his parent’s connections to famous people. “Okay.”\nHe heard Ochako’s exhale of apparent relief and could tell she was smiling when she spoke, “Great. Want me to come over later?”\n“I don’t want to be a bother, since I already-”\n“Alright, I’ll see you around five,” Ochako interrupted, making Izuku smiled. He should’ve known better.\n“Thanks, Ochako,” he conceded, “and, um…could you do me a favor and not tell Mina about this? It’s not that I don’t trust her, I just…”\n“No problem, Deku, I understand,” Ochako assured, “I’m not gonna go around spilling your secrets, promise. I gotta go now, though, so I’ll see you later!”\n“Bye, ‘chako.” Izuku hung up with a hint of a smile, then flopped back on his bed with a heavy sigh, staring up at his ceiling. \nDon’t give up too soon, huh?\nAfter a few moments of contemplative silence, Izuku reached over to pick his phone back up and open Twitter. Then, against what might prove to be his better judgement, he searched for decchan, a word he had been seeing in his chat and all over his little part of the internet for a while now. Originally, he had assumed it was just a mashup of his and Kacchan’s nicknames for conciseness’ sake, but now he knew that it was…not that. Either way, he had never actively searched out the term until now, and although Ochako might have told him not to, he wasn’t feeling incredibly rational at the moment.\n \nkacchan’s shoulders @shadowphoenix\nI want what decchan have oh my GOD… need me someone to love and be gay for 😔😔 \n \nyeah @apparently29\ndecchan pining is real and almost painful to watch (in the best way) like aaaaaaah just kiss already!!! I cannot imagine being the rest of the squad watching that all the time lmao. rip todoroki fr\n \nall might is gay @mightyshield\nsince ocha’s last stream became the absolute decchan GOLD MINE that it was (also shoutout 2 undercut ocha woWEE) I have updated my tumblr masterpost of decchan being gay. enjoy &lt;3 \n[LINK]\n \nIzuku frowned, curious, and clicked on the link. It opened a new page on Tumblr, which he really only used nowadays to participate anonymously in All Might fandoms. This…was not something he had come across before.\n \n\nmightyshield-canon\n\n\nMASTERPOST OF DECCHAN BEING GAY (RIGHT IN FRONT OF OUR SALAD)\n\nHello and welcome to my compilation of Deku and Kacchan moments that made me scream into my pillow loud enough for my mom to ask if I am okay from the kitchen downstairs. Because I love them. I’ll be updating it every so often to keep it up to date with all of Decchan’s…everything. \n(quick disclaimer: this is all in good fun, please use nothing on this list to harass real people)\n---\n1) Obviously we have to start with the legendary introduction of Kacchan himself (while I’m pretty sure he was in Deku’s very first stream, that has since been taken off the internet in almost all forms so I’m starting the count from when Deku blew up). That amazing moment when he walked in on Deku mid-ramble and Deku stopped talking (about All Might?!?!) and LOOKED AT HIM LIKE THIS.\n[Image: a young high school Izuku in a bedroom covered in All Might memorabilia, wearing headphones, and sitting in a desk chair, grinning brightly at someone beside the camera with his mouth partially open like he’s exclaiming something, eyes wide and bright.]\nIf anyone ever looked at me like that, I’d propose to them on the spot. (Especially if they’re as cute as bby Deku look at HIM!!!) Not to mention the way he says ✨🥰KACCHAN!!🥰✨ I mean…\n \nIzuku tried not to grimace at the image of his younger self, but he did admit he looked awfully excited to see the person behind the camera. But what in the world were those emojis around the name supposed to mean or imply in this context. He said Kacchan’s name normally. \n…Didn’t he? Yeah, he did. Whatever.\n \n2) I’m not doing this in chronological order that’s too hard. Anyways next up we got some gay panic from Kacchan’s end, aka that time Deku beat him in a racing video game (hero themed one, duh) because Deku smirked at him and he accidentally drove his car off a cliff. Same, Kacchan. \nAnd!! The entire reason Kacchan was playing with him is because he came in to give Deku a snack and yelled at him for not eating breakfast. We love a caring man &lt;3\n3) Actually while we’re on the topic Kacchan does that a lot. Like too many times for me to find proof for all of them, he’s just consistently checking in on Deku and I think that’s so??? Cute??? Like oh my god I need me a Kacchan 🥺🥺\n4) Next up we got a special shoutout to Decchan randomly tackling the shit out of each other!! Love that for them, every so often Deku will just be yoinked off-camera and it’s like those sound effects in cartoons where a bunch of things crash around and then a cat yowls. Just plain chaos while I sit there going GOOD FOR YOU HONEYS and laugh my ass off. Fellas, is it gay to tackle your childhood best friend any chance you get (yeah kinda)\n5) Have I mentioned ✨🥰KACCHAN!!🥰✨ yet? I’m mentioning it again. \n \nHe did not say it weird!\n \n6) And as a follow-up to ✨🥰KACCHAN!!🥰✨ I think I have got to mention *spoken like an embarrassed signifigant other being flirted with in public but they actually think it’s funny* “Deku”. Slightly rarer occurrence but Kacchan always sounds like he’s being flirted with by his husband of twenty years and it’s the best thing\n \nThat was…incredibly specific. \nIzuku decided to ignore that last bit due to the fact that he didn’t flirt with Kacchan and, more importantly, they were not married, but the rest of it was…extremely confusing, if he were being honest. If he did his very best to shove his own opinions out of the way, his own preconceptions about the relationship between him and Kacchan, he just ended up wondering if all the things they did were romantic in some way. Because they had pretty much listed everything that he and Kacchan did, and had been doing for years now.\nThey checked in on each other, had fun together, and yeah, Izuku was always happy to see him.\nIt all just wasn’t fair. There were hundred of screenshots out there of Izuku looking at Kacchan like that and none to even possibly prove it was ever the other way around. \nIzuku huffed, shutting his phone off and laying back on his bed again. This was too much right now, and he had to get to class soon. \nHe forced himself up, changing out of his pajamas and grabbing his stuff and the abandoned bowl of rice on his desk, which he hadn’t even gotten chopsticks for. He was seconds away from just dumping it into his mouth like a starving toddler as he hefted his bag over his shoulder and made his way out of the apartment, but a note stuck to the fridge caught his eyes just before he did. He lowered the bowl of rice and went to grab the piece of paper, assuming that Kacchan had already left by the fact that he had apparently left Izuku a note.\n\nYou forgot chopsticks, dumbass. And you’re not going to get shit done if you don’t eat well, we’ve been over this. Eat a better breakfast or I’ll kick your ass. Don’t stress about shit too much or I’ll also kick your ass. Also there’s leftover fish in the fridge.\n\nIzuku grinned despite himself, grabbing the Tupperware of fried fish and greens from the fridge and dumping his rice in before snapping a picture and sending it to Kacchan.\n \n&lt;&lt; [image attachment] this better?\n&lt;&lt; also you could’ve just texted me instead of a whole note…\n \nKacchan responded almost immediately. \n \n&gt;&gt; you don’t ever check your phone when your stressed or running late\n&gt;&gt; and that meal is pitiful but I guess that’s why I’ll always be stronger than you\n&lt;&lt; you wish!! (╬▔皿▔)╯\n&gt;&gt; you’re weak. now get your ass moving before you’re late\n \nIzuku checked the clock. \n \n&lt;&lt; oops. I shall eat on the go. thanks kacchan!!\n&gt;&gt; you’re a disaster\n \nDon’t give up too soon.\n \n--\n \n“You look relieved,” Mina commented as Katsuki shoved his phone back in his pocket and continued on their walk to their first class of the day. He scowled at her in response. “Everything okay?”\n“What?” Katsuki said, “Yeah, everything’s fine.”\n“Who were you texting?” Mina asked.\n“Deku, you fucking nosy-ass,” Katsuki answered with a huff, “Why the hell do you care?”\n“Because I’m your friend, remember?” Mina responded, rolling her eyes, “And I want to make sure our resident angel is doing okay.”\n“He was being weird as fuck this morning,” Katsuki said, opening the door to their classroom, “but that’s not exactly a novel occurrence.” Usually he didn’t just run away like that, though. And the look he’d given Katsuki before he did was still stuck in his mind – he’d looked surprised and slightly horrified.\nWas it because of something Katsuki said? Maybe his weird…whatever he’d been doing yesterday? He wasn’t even sure what that would be. It had just kind of happened, some instinctual need or want to continue poking fun at Deku’s apparent (objective) attraction to him. Though, poking fun at Deku certainly wasn’t anything new.\nKatsuki’s real problem at the moment was the fact that his actual rating for Deku might be a little more than an eight of ten. But whatever, objective attraction didn’t mean anything.\n“Anything…interesting happen after you went home last night?” Mina asked in a strange tone as they took their seats, raising one brow. \nKatsuki stifled a laugh and smirked. “Yeah, Deku tried to tackle me and we ended up annoying the shit out of the old guy next door. What else is fucking new?” The excited expression melted off Mina’s face, and Katsuki finally realized with a bit of a start that her tone had been suggestive. His ears felt warm again, the fucking traitors, but before he could go off on her the teacher came in. Fucking hell, Mina.\n \nHours later, Katsuki somehow found himself at Mina’s apartment, busying himself in her mess of a kitchen he didn’t have the self-control to leave dirty as she and Todoroki chatted loudly at the counter. Mina had dragged him there after classes, claiming that they could work on their projects in a “relaxed environment” and citing that Ochako was going over to his place to hang out with Deku. Which only made Katsuki feel a little weird, because since when did Deku not tell him shit? But whatever, it was probably nothing.\nMina hadn’t told him she was inviting Todoroki over too, but apparently the guy had some time off from whatever the fuck he did all day – there might have been some movie he just got cast in that Katsuki had forgotten about, possibly a TV show, but whatever it was it had Todoroki coming over in the shittiest baseball cap and sunglasses disguise he’d ever seen. What was this, an Avengers’ movie?\n“Better than what you’ve done,” Todoroki countered when he brought it up, making Mina snicker and Katsuki scowl as he scrubbed a dish in the sink.\n“Hoodie turtle mode,” Mina smirked, curling up a bit in her seat and miming putting a hood up over her head, “That’s what Mido called it.”\n“Shut the fuck up,” Katsuki grumbled, rinsing the plate off and setting it to the side to dry. Once or twice in the past he’d had to hide in his fucking hoodie to avoid annoying fans – of any one of his friends, but mainly Todoroki – from taking a picture with him in it and inevitably coming to the conclusion that he was “Kacchan”. One time, Deku had yanked his hoodie strings closed and pushed him into a bush to avoid a confrontation, which obviously earned him proper retribution. But it wasn’t a thing.\n“I’m sure people would’ve deleted pictures if you’d asked,” Todoroki commented, sipping from the berry drink Mina had handed him upon entrance.\n“Yeah, like these fuckers respect your privacy,” Katsuki said, frowning.\n“No, I mean if you asked,” Todoroki amended, “In your Bakugou voice.”\n“What the fuck is my Bakugou voice?” Katsuki snapped, accidentally holding up the knife he was holding like a weapon.\n“See, just like that,” Mina grinned, Todoroki hummed a noise of approval. “Though, from what I’ve seen online they might be even more all over you then,” Mina added, waggling her eyebrows.\n“Ew,” Katsuki gagged, “I did not need to hear that. Disgusting.”\n“Katsuki, you think that’s disgusting, you would probably combust if you actually had any social media,” Mina said, Todoroki nodding along slightly. “The things I’ve had to read about my own girlfriend are surreal, and that’s not even approaching the gross stuff.”\nKatsuki frowned at that, brows knitting with a bit of genuine concern for the sake of all his “famous” friends. He wasn’t a naïve idiot, he knew the internet was a place, and they could all take care of themselves perfectly fine, but still.\n“A lot of it is just funny,” Todoroki said, steering the conversation from slightly darker topics, “For example, I recently found a thing called Endeavor-bashing, which I quite enjoy.” Katsuki snorted and Mina laughed again. “Wanted to add some of my own thoughts but my PR manager said Endeavor-bashing was different that Enji-bashing and wouldn’t let me.”\n“Good for you, Todoroki,” Mina giggled, patting him on the shoulder.\n“You should do it anyway, your PR guy can go fuck himself,” Katsuki added. \n“Unfortunately, I can’t fire him,” Todoroki said with the tiniest hint of a smirk, “but I added some things on my side account he doesn’t know about.” Mina laughed even louder at that.\n“Holy shit, Todoroki, you’re a gem,” she grinned, and Todoroki looked almost proud of himself. Fucking dork. Mina suddenly gasped and snapped her fingers. “Oh my god, that’s what you should do, Katsuki!”\nKatsuki glanced up from the cookie pan he was washing. “What?”\n“A secret account!” Mina exclaimed, clasping her hands together, “No one would have to know it was you! This is a genius idea.”\n“Bubblegum, did you forget that I’m not a part of that cesspool because I don’t want to be?” Katsuki said, making a face, “Why the hell are you so interested in me getting an account?” \n“Because,” Mina said, drawing out the word, “it’s the 21st century, Katsuki! You’re trying to break into the fashion industry, there are things you need to know!” Katsuki just gave her a deadpan look. If he needed social media for fashion, he’d just use his parent’s company’s account.\n“Because it would be funny,” Todoroki corrected, and Katsuki commended his honesty, at the very least.\n“Yeah, mostly that,” Mina admitted, then gave him pleading eyes, “Please? I’m just curious here.” \n“Name five reasons why I should even consider doing that,” Katsuki challenged flatly, rinsing off his hands in the sink and drying them on a towel.\n“One!” Mina announced, holding up her finger then pausing for a suspiciously long time, “Cute…pictures of cats.” Katsuki raised an eyebrow, but she barreled on. “There are lots of adorable cats on the internet, and I know you like those, you can’t deny it.”\n“I wasn’t going to, but-”\n“Two!” Mina interrupted, adding another finger, “All Might nerd heaven. Need I say more?”\n“You need not,” Todoroki cut in as Katsuki scowled at her.\n“Thank you, Todo,” Mina smiled, then continued, “Three! You can like all of my pictures because I’m your beautiful best friend and you love and support me.” Katsuki rolled his eyes at that one, stealing Todoroki’s drink as retribution for his previous comment. “Four! Cute pictures of Mido.”\nKatsuki damn near choked on his drink, spluttering out a cough as he ducked his head and slammed a fist into his chest to try and breath correctly again. “What?”\n“There’s a lot of them,” Mina said casually like Katsuki hadn’t been nearly dying a second before and like he wasn’t glaring at her with malice right then, “because he has a lot of simps. Like, a lot, and they collect pictures of him.”\nKatsuki paused his plans to throttle her where she sat. “He has whats that do what now?”\nMina blinked at him for a second. “Five, you won’t be so out of the loop that you seem like first year Todoroki.”\n“Oh, fuck you!” Katsuki snapped, “Just tell me what the hell you’re talking about.”\n“Get on Twitter for once and you’ll find out,” Mina smirked, wiggling her eyebrows.\n“Enlighten yourself, Bakugou,” Todoroki said with an utter lack of emotion or conviction, “like I did.”\n“Yeah, like Twitter is enlightening anybody,” Katsuki grumbled, pulling his phone out of his pocket despite all logic saying he should do literally anything else. He opened the app store and went to download the app of hell to a background of Mina’s excited gasp. “I’m deleting this the second you losers realize there is literally nothing of interest to me here.”\n“Deal!” Mina squealed, practically jumping up in her seat and scurrying around the counter so she could peer over Katsuki’s shoulder. He shoved her away lightly with a scowl, but she was too damn excited to be stopped. “Okay, okay, you gotta pick a username first and then you can-”\n“I know how to make a fucking account, I’m not clueless,” Katsuki interrupted, making Mina roll her eyes dramatically. \n“Well hurry it up then!”\n“Fuck off,” Katsuki scowled, setting his user and display name as the first things he could think of. “Now what.”\n“That was fast,” Mina commented, poking her head around his shoulder again and huffing, “Really, Katsuki, that’s and incredibly boring profile. You don’t even have a picture.”\n“I already told you I think this is fucking stupid and you expect effort from me?” Katsuki protested, “No. This is fine.”\n“What’s his username?” Todoroki asked like Katsuki wasn’t right there, taking another sip of his previously stolen drink. Gross.\n“Dynamite but it’s spelled d-y-n-a-m-i-g-h-t,” Mina answered, again ignoring Katsuki’s presence, “which is a cute childhood reference and all that, but the display name is just ‘no’.”\n“Tell me what the fuck you hairbrains wants me to do or I’m deleting this and leaving,” Katsuki threatened, already having regrets.\n“Okay, okay, cool your jets, big man,” Mina said, smiling in faux innocence, “Just look up your name or something, that’s always fun. Make sure you put in ‘Kacchan’, though, not Bakugou.”\n“Is that…really the best choice?” Todoroki asked with a hint of a frown.\n“I already know about the weirdos,” Katsuki said, glaring at him. Did he not think he could handle weird comments or something?\n“No, I mean the…other thing I’m not actually supposed to mention,” Todoroki said, then must have immediately realized he was spilling someone’s secrets and returned full, awkward attention to his drink.\n“What the fuck?” Katsuki snapped.\n“Don’t worry about it,” Mina grinned, “just look it up.”\nKatsuki frowned, looking between the two of them. “Both of you are up to something here and that’s pissing me off.”\n“I am up to nothing!” Mina declared with overdramatic offense, “I only want my dear friend to know…certain things that he really should.”\nAlright, Katsuki was done with the weirdness and riddles. He just needed to find out what the fuck these two dunces were going on about and get this over with, so, he found his way to the search function and typed in his stupid nickname. What could possibly be such a big thing.\nKatsuki didn’t know what he’d been expecting. No, correction, he knew what he’d been expecting, but in the face of what he actually got he somehow found himself still taken by surprise despite all the things he’d heard from Mina. And “by surprise” he meant the “hit by a bus” kind of surprise. The “stepped off the sidewalk only to realize it was into a highway” kind of surprise. The “what the actual fucking fuck is this” kind of surprise. \nBecause what the actual fucking fuck is this.\n \nkacchan’s shoulders @redwinghawks\nI am so incredibly jealous of Deku imagine LIVING WITH KACCHAN??? THAT ENTIRE MAN?? HHKSDLKFS\n \nmirko @bunnybun28\nyesterday’s stream was basically just confirmation that deku and kacchan have been pining for each other for as long as the dekusquad has been together and prob even longer and. we been knew but stil!!!\n \ngecko @lesbian_bubblegirl\nevery day I wake up and deku and kacchan /still/ aren’t actually dating (as far as we know) and I’m /still/ baffled as to HOW and WHY NOT\n \nbumble @mightybeedeku\n10,000Ұ says Kacchan’s a blonde, no I do not take criticism\n \n🌈 @NeurovascularEntrapta\ndeku when he ✨🥰KACCHAN!!🥰✨ (affectionate)\n[Images: pictures of Deku looking extremely happy while dressed and framed like he’s streaming, mouth open in exclamation as he looks towards something off-camera with bright eyes.]\n \n“Katsuki?” Mina asked after a second, “You good?”\nKatsuki ignored her, instead clicking on the pictures of Deku to make them bigger and immediately wondering if he was suffering from a heart attack. Why the fuck did his face…why did he look like that. What the fuck. Why. How. Who. What was going on.\nAlso the internet thinks their dating? When the actual hell did that become a thing and why the fuck was he not informed. \n“I think he found the…things,” Todoroki said, barely snapping Katsuki out of his head. He looked up to glare at the both of them, holding up his phone. \n“You’re telling me you guys knew about this shit?” he almost yelled, ears warm and heart racing for indiscernible reasons. “The fucking…” he trailed off, unable to even begin describing whatever the hell this was.\n“Shipping?” Mina provided, shrinking back the tiniest bit.\n“The what?” Katsuki snapped, “Shipping? Like a fucking package?”\n“Oh, uh…nope, not that kind,” Mina responded, doing a very poor job of holding back laughter, “It’s when people see two other people or characters and decide that they should date. They ship them.”\n“That…is the stupidest fucking thing I’ve ever heard,” Katsuki decided after a moment, “Why would you call it – never mind!” He shook his head and huffed. “Why the hell are people doing that to me and Deku?”\n“Because they want you to date,” Todoroki monotoned, “I thought we explained that part already.”\n“Die,” Katsuki growled, “Also, explain.”\n“Explain what?” Mina asked, raising a brow in confusion.\n“Why does he look like that!” Katsuki yelled, then quickly moved to correct himself, “I mean, why the fuck would they want that?”\n“Are you okay, Bakugou?” Todoroki said, narrowing his eyes with a hint of a frown, “Your ears look sunburnt all of a sudden.”\n“Why are you blushing?” Mina gasped like a rabid animal catching scent of nearby prey. Her eyes were wide, and he could practically see the cartoon sparkles of interest. “Give me your phone! What did you see?”\n“No! Fuck off!” Katsuki shouted, holding his phone above his head as Mina lunged for it, shoving a hand into her fluffy pink hair to hold her back as his face heated even more. He hated this entire experience with a burning passion.\n“I bet it was Midoriya,” Todoroki suggested, looking completely relaxed in the face of this chaos.\n“Obviously,” Mina responded, as if she weren’t trying to attack and rob Katsuki that very second.\n“What?” Katsuki screamed, accidentally dropping his phone as he did. He and Mina lunged for it at the same time, both missed, and it clattered the counter and slid right into Todoroki’s waiting grasp. That fucker. “Give that back!” Katsuki snapped.\n“No, give it here!” Mina yelled, leaning so far over the counter she might have climbed on top of it and making grabby hands at the phone. Todoroki, for his part, just flipped the phone over so it was screen-up, then slid it back to Katsuki.\n“It was Midoriya.”\n“I knew it!” Mina practically shrieked, pumping her fist in victory.\n“Knew what?” Katsuki yelled, snatching his phone back. She was too damn loud.\n“That you,” Mina said, punctuating her words with a finger to Katsuki’s chest and grinning up at him, the fucking she-devil, “have a thing for your shitty Deku.”\n“I DO NOT,” Katsuki screeched, his entire face far too hot and heart racing far too fast. “What in the fucking hell would fucking give you that damn-”\n“You swear a lot when you’re flustered,” Todoroki deadpanned, and Katsuki snapped his mouth shut and whirled around to glare at that monotone Canadian flag son of a bitch. “Which is around Midoriya.”\n“Even he sees it,” Mina pointed out.\n“Even I see it,” Todoroki agreed.\n“You two can go die in a ditch, I’m leaving,” Katsuki snapped, shoving his phone in his pocket and swiping his keys off the counter where he’d dropped them earlier. He started for the door, but Mina jumped to scramble after him and latch onto his arm. \n“Wait, no, Katsuki!” she whined, “C’mon, dude! We’re trying to help here! Just admit that you-”\n“SO WHAT IF I DO?” Katsuki suddenly yelled, whirling around to face her and shaking her grip off his arm. And then he froze. What the fuck did he just say. Mina slowly broke into a grin. Oh fuck no.\n“So you admit-”\n“Good bye,” Katsuki snapped, yanking the door open and slamming it shut behind him. He was definitely having a heart attack. Or dying. Or dreaming. What the hell was going on.\nWhat was going on is that he just admitted he had a crush on Deku.\nMaybe he was going insane.\nWith an aggressive huff mostly directed at his own stupid brain and traitorous body, he shoved his hands into his pockets and stalked down the stairs out of Mina’s apartment building. He felt his phone, and immediately his mind flashed with those pictures of Deku, looking at him, like that. Why were his palms so damn sweaty? \nHe had to be going insane or something, because there was no way he’d ever have a thing for Deku. Dorky nerd Deku with his stupidly big smile and those dumb eyes that look like crystals made of sea glass, or his obnoxiously loud laugh at the most idiotic of jokes, or his accurate-to-the-point-of-being-creepy impressions of All Might he always did at the worst of times. Or his incredibly messy hair that stuck up in every direction imaginable and looked like an absolute beast when he went to bed with it wet. Or the way he always had to sleep on the left side of any bed, and the way he bit the inside of his lip when he got nervous, and the way he had that one All Might hoodie he wore when he was feeling down, and the way he would always kneel down to talk to little kids so he could look them in the eye.\nOr his freckles that were splattered everywhere on his face like someone had shaken a wet paintbrush at him – there was one bigger one by the outer corner of his right eye that for some reason always stuck in Katsuki’s mind. Or those scars on his hand from that time Katsuki challenged him to a race on their bikes as kids and he skidded into the ravine and fell into some blackberry bushes. Katsuki had managed to carry him almost all the way back home on his back, and now his ring finger was slightly crooked from where it had broken.\nThere were four scars total from that accident, actually. Three on his hand, one on his shoulder next to the collection of freckles that slightly resembled the Pleiades. Katsuki distinctly remembered a time in third year elementary school, when he and Deku were sitting outside to eat a dinner his mom had made them, and Deku took off his shirt because he’d gotten too hot. His arms were covered in freckles and scrapes from their summer day of running around in the woods, and Katsuki had the clear thought that he looked like the night sky, then frowned to himself because that didn’t sound big enough.\nKatsuki slowed his walking to a stop.\nDeku was gorgeous, and Katsuki knew almost every inch of him inside and out.\nWell. \nFuck.\n \n--\n \nWhen Izuku opened the door, Ochako was waiting with a bottle of his favorite strawberry soda, four packs of pocky, and a sympathetic, knowing smile as she took in his well-worn All Might hoodie, baggy shorts, and messy hair that was sticking up at odd angles thanks to continuously running his hand through it. “Hey there, Deku.”\n“Hi, Ochako,” Izuku answered, trying for a smile as he stepped to the side to let Ochako in their apartment and closed the door behind her, “I think Kacchan’s coming home soon.”\n“No, he’s with Mina at my place,” Ochako said, making her way to the living room to place all her stuff on the coffee table and plopping herself down on the couch. “Which give us some time to talk,” she added, patting the seat next to her. Izuku practically collapsed into the couch, taking the soda she offered with a mumbled thanks. “Are you okay, Deku?”\nIzuku took a sip of the strawberry soda, not meeting his friend’s concerned gaze. “Yeah, I think so,” he answered honestly, “Just feel a little weird, to be honest.” \n“How so?”\n“I don’t know,” Izuku muttered, pulling his legs up on the couch, “I think I’m confused.” He paused, and Ochako stayed silent to let him collect his mess of thoughts. “I looked up ‘decchan’ on the internet.”\n“You did what?” Ochako gasped, pretty much the reaction he had been expecting. “Oh, Deku, that’s…”\n“It probably wasn’t the best idea I’ve ever had,” Izuku admitted with an instant of a smile, “But it made me realize just how much of my…fanbase, I guess, is dedicated to thinking me and Kacchan have a relationship. Or wanting us to have one.” He took another sip of his drink, thinking back to all the things that had been stuck in his mind all day. “And that makes me feel kind of stupid, really.”\n“What do you mean?” Ochako asked, frowning at him, “You’re not stupid at all.”\n“Literally millions of people watch me be disgustingly into him every day and I didn’t even figure it out until this morning,” Izuku countered, huffing and chewing on the inside of his lip, “I’m kind of stupid.”\n“Deku…” Ochako started, then sighed and shuffled across the couch to wrap an arm around his, squeezing his shoulder in comfort, “That doesn’t make you stupid. It’s hard to know ourselves, especially when you…well, when you’ve kind of been like that at least as long as I’ve known you.”\nIzuku’s shoulders slumped, “It was that obvious, huh?”\nOchako gave him an awkward smile and tilted her head back and forth. “Pretty much.”\n“Oh, man,” Izuku groaned, dropping his head to his knees in embarrassment, “It would be a miracle if he didn’t know, then.”\n“Well,” Ochako said, rubbing his back, “you would think so, wouldn’t you?”\n“What’s that supposed to mean?” Izuku asked with a pout, turning his head to look at her.\n“It means you and Bakugou are of the same mind in this sense,” Ochako said, reaching up to ruffle his hair, “I’m not saying you’re both stupid, but oblivious might be a better word for it.”\n“So, he doesn’t know,” Izuku said, sitting up again. \nOchako shook her head, “Nope.”\nIzuku let out a tiny sigh of relief. “Neither Kacchan or I knew I liked him.”\n“Or the other way around,” Ochako mumbled, making Izuku’s eye widen as he choked on his soda.\n“Huh?” he managed to cough out as Ochako patted his back. He caught his breath. “The other…what?”\n“That’s what I was trying to tell you this morning, Deku,” Ochako smiled, “Don’t give up too soon?”\n“You…” Izuku started as Ochako patiently waited for his brain to catch up with the rest of him, “you think Kacchan likes me back.”\n“Bingo,” Ochako smirked, clinking a stick of pocky against his bottle then eating it, “And before you go denying it, just think for a second.”\nIzuku tried. He really did. But all he could do was what he’d done his whole life – think about how amazing Kacchan was. His strength, his steadfast, fiery determination to do anything and everything he set his mind to, the way stood tall in the face of people that tried to tear him down. He was smart, talented, hard-working, everything Izuku ever wanted to be. He was basically a hero, but better because he was real. \nIzuku told him that when they were young. Kacchan would beat off a bully, get up after every fall, show off anything and everything he could do, and Izuku would be right there behind him to grin and brag about him being cooler than All Might. \n“Listen, Deku,” Ochako said, brow furrowed in sincerity as she sighed, “I don’t know how much sway I have here, but trust me when I say seeing you two together…the way you look at each other can be physically painful at times.” She shook her head, laughing under her breath. “For heaven’s sake, Deku, it’s like you’re each other’s suns. That’s grossly poetic but…I mean, he hardly even smiles when you’re not there.”\nIzuku had no idea what to say to that.\n“This is probably a lot, I know,” Ochako said after a few drawn out moments of silence, “but you obviously don’t have to do anything about this right now, okay? And no matter what, you always got me.”\n“Thanks, Ochako,” Izuku mumbled, leaning into his friend’s side. She opened her arm to let him in a little closer, running her fingers through his hair as she did.\nThey ended up watching some trashy drama show Ochako found on TV, and spent most of the time yelling at the characters for missing obvious clues to the crime they were trying to solve. It was incredibly frustrating and exactly what Izuku needed, seeing as he’d almost completely forgotten all his negative feelings by the time the door opened and Kacchan returned home.\n“Are you fucking kidding me?” Ochako yelled at the exact time Kacchan walked into the living room, “It was obviously Takata, not Hashimoto! Why are you arresting her?”\n“Because they’re stupid,” Izuku said, glaring at the TV, “She was framed for sure.” \n“For sure!” Ochako agreed, throwing her hands up, “Gah! How could they do that to that beautiful woman?”\n“Are you sure you’re not just on her side because you think she’s hot?” Izuku asked.\n“That’s irrelevant,” Ochako denied with a wave of her hand, making him laugh.\n“What the fuck are you two doing?” Kacchan cut in, making Izuku startle and twist around on the couch to grin at him. \n“Kacchan!” he chirped, “Welcome home!”\nInstead of his usual response, or any at all, Kacchan just stared at him, once again looking softly surprised for no discernable reason. Izuku just stared back at him awkwardly, feeling his cheeks heat up more the longer it went on. Kacchan was pretty like this. Really-\nA gunshot from the TV made Izuku yelp in surprise, breaking the weird eye contact thing and whirling around to find Ochako watching him with a smug, knowing look and smile as she crunched down on a stick of pocky. “I think Takata just shot someone.”\n“I, uh…we guessed it,” Izuku managed, making Ochako smile even wider.\n“Yeah, apparently I was right,” she said, and Izuku felt his face heat up even more. He mouthed at her to stop, but she just grinned at him and leaned back to look at Kacchan, who looked like he might have been in crisis. Which was…concerning, to say the least. “How are you doing, Bakugou?”\nKacchan blinked at her for a second, then fixed his face into a scowl. “Fucking whatever, Mochi Cheeks. What are you doing here?”\n“I was just about to leave, actually,” Ochako said sweetly, pushing herself off the couch as Izuku felt his heart drop to his stomach, jumping up to scramble after her.\n“No, no, you should stay!” he laughed nervously, grabbing her arm and giving her a pleading look that he hoped Kacchan didn’t see. He could not be left alone with Kacchan right now, he might die.\nOchako, obviously knowing this, just smiled at him, patted his hand, then pried it off her arm. “Sorry, Deku, but I gotta get home and do some work.” \n“Ochako,” Izuku hissed under his breath, glancing back at Kacchan for a second. \n“Bye!”\nThe door shutting behind her carried a lot more finality than it probably should have, and Izuku turned around to face Kacchan after clearing his throat forcefully. His eyes darted around the room for a second until he forced them to stay on his roommate, who somehow seemed to be feeling just as awkward. “Hi.” Wait, shoot, he already said that.\n“Hi,” Kacchan echoed, red eyes scanning him up and down. There was another awkward pause and Izuku silently wondered what the hell was going on. “Who the fuck is Takata.”\nIzuku snickered, forcing a bit of tension out of his shoulders. This was still just Kacchan. “A character from this show ‘chako and I were watching,” he said, making his way back over to the couch and flopping down, “And he’s a traitorous bitch.”\n“Oh?” Kacchan said, raising an eyebrow in a very casual way that did not make Izuku blush, then leaning over the back of the couch and propping himself up with his elbows, “Do fucking tell.”\n \n--\n \nno @dynamight\nokay yeah fuck I’ve got a thing for deku\ngreat explosion murder max @freckledeku\nget in line then 😤😤 (we’re all behind kacchan tbh…)\ndeku my beloved &lt;3 @twelveturtles\njoin the club friend\nOkay, why the actual fuck did people see that. Katsuki hadn’t posted it expecting to get responses, especially not fucking challenges (apparently?). It was a mere impulse after watching Deku ramble about some stupid TV show for fifteen minutes straight. Side note, he was starting to understand a little better why people just posted their random shit on the internet.\nOut of curiosity, he clicked on the profile of the first person to respond to him – the person who had a name that was a reference to him by the way – and found that it was an account almost solely dedicated to…him and Deku. Seriously, every tweet or retweet was about them, and whatever the fuck “decchan” was. Name combination? That was just weird as fuck.\nAnd they had the nerve to tell him to get in line? What the fuck?\nKatsuki was momentarily glad he had better impulse control than his high school self, else he might’ve just revealed his identity right then and there out of pure spite. Instead, he glared at his phone and flopped back on his pillows, glancing over at Deku, who was working on an assignment at his desk on the other side of their shared room. He was wearing his headphones, obviously listening to something from the way he swayed back and forth ever so slightly in his seat, mouthing the words to some song with a soft smile on his face.\nno @dynamight\nReplying to @freckledeku never. he’s mine.\ngreat explosion murder max @freckledeku\nReplying to @dynamight a challenger approaches, I see. here’s what I got\n[Image: screenshots of Deku on stream, a picture of him and Uraraka, and a picture of Deku laughing in a frog bucket hat.]\nKatsuki frowned at his phone screen, slightly confused. What in the hell kind of challenge was that?\nWhatever it was, this extra had chosen a losing battle because Katsuki was the one who’d taken most of the pictures Deku posted online. He opened his camera roll, then started his search. It was during this he learned that most of his pictures were either of Deku or his fashion projects, which…He’d just say that a lot of things were making way more sense in hindsight after he realized just how far gone he was for this freckled dumbass.\nThe freckled dumbass he’d known since childhood, so suck it, Max.\nHe replied to the extra with a few pictures of Deku looking like a dork, then shut his phone off and tossed it to the side before he got too invested in stupid internet drama on his first day of being on it. Instead, he busied himself staring at his roommate in real life, who had gone from slight movements and mouthing song lyrics in his seat to a dramatic, silent reenactment of the singer at a concert, invisible microphone and all. His eyes were closed, and Katsuki would bet he’d completely forgotten he wasn’t alone in the room.\nKatsuki fought off a smile and the urge to shove his face into a pillow. Who the fuck gave Deku the right.\nSuddenly, Deku took off his headphones, yanking the plug out of his computer and letting the music – that was at far too high a volume for headphones, by the way – fill the small bedroom as he stood from his chair, not stopping his lip-sync dramatics.\n“Hey honey, you could be my drug, you could be my new prescription!” He mouthed along, reaching over to turn the volume up even more than it already was. “Too much could be an overdose, all this trash talk make me itchin’!”\n“Deku.”\nThe nerd was full on dancing around their room now, switching between an invisible microphone and an air guitar seemingly on a whim. “Oh my, my shit. Everybody talks, everybody talks, everybody talks too much…”\n“Deku!” Katsuki yelled, grabbing a pillow to throw at him as Deku reached the chorus of the song with somehow increasing dramatics.\n“It started with a WHISPERRRR!” Deku sung out loud this time, clutching one hand to his chest in an exaggerated pose and using the other to bat away the pillow projectile. “AND THAT WAS WHEN I KISSED HERRRR!” \n“You’re not even singing!” Katsuki shouted, unable to stop a laugh.\n“And then she made my lips huurrrt, I could hear the chit chaaaat!” Deku yelled, and Katsuki briefly thought of old man Kiyabu next door, “Come on, Kacchan!”\n“Absolutely not, you dorky fuck,” Katsuki said, grabbing another pillow for defense against Deku’s advances towards his bed, not stopping his progression through the nerdiest dance number to ever exist.\n“Nope, you’re dancing with me before I go insane from boredom,” Deku grinned, grabbing his ankle to pull him off the bed.\n“Oi, fuckwad!” Katsuki laughed, prying Deku’s hand off his ankle only for Deku to grab Katsuki’s hand and continue pulling him. “I think you’ve already gone insane,” he snorted, having been fully yanked to his feet as Deku waved his arms around like a…octopus on drugs? Who fucking knows, but he looked like a dumbass, and it was fucking adorable. \n“Hey sugar show me all your love,” Deku mouthed, squeezing his eyes shut again as he raised on arm to point forward, which just happened to be where Katsuki was standing. Uh oh. “All you’re giving me is friction! Hey sugar, what you gotta say?”\nDeku waved his other arm around in the air, swaying back and forth as Katsuki just stood there, feeling completely frozen. “It started with a whisper! And that was when I kissed her! And then she made my lips hurt!”\nWhy the hell was he standing so damn close?\n“I could here the chit chat, take me to your love shack!” Oh yeah he was way too close now. Holy fuck. Did he realize he was doing this? “Mama’s always gotta backtrack, when everybody talks back!”\nDeku finally, finally opened his eyes, locking them with Katsuki’s as he discovered that he had chaotically danced his way right up into Katsuki’s space while Katsuki had failed at doing absolutely anything to keep him away. His vibrant green eyes widened a little with the realization, lips parting open slightly, his hair messy from the day and smooshed down a bit where his headphones had been, making him look like an utter disaster that was literally making Katsuki feel slightly weak in the knees. This was the worst fucking thing that had ever happened to him.\n“It started with a whisper, and that was when I kissed her.”\nHe seriously needed to move before this entire environment pushed him into doing something absolutely idiotic. Like kissing Deku right fucking now and possibly sending their friendship careening off the tracks. Which was a huge, flashing red NO, but for some reason he was not moving. The song had fucking ended, a new one had started, and neither of them were moving.\n“I-” Katsuki started, the cut himself off to clear his throat because he’d sounded like he was wheezing through a ten-ton weight on his chest, “I think Mr. Kiyabu’s really gonna hate you now.”\nDeku blinked at him, furrowing his brows slightly, then finally came back to himself and laughed loudly. “Yeah, probably.”\n“I also hate you now, turn that shit down,” Katsuki said, shoving him back towards his computer as Deku laughed again, finally turning the racket down to an acceptable volume. Katsuki flopped back down on his bed. “I don’t know what the hell prompted you to do that.”\n“Me neither!” Deku chirped brightly, sitting back in his desk chair, “But I feel much better now. I’m just going to finish this assignment, then I’ll go to bed.”\n“Alright,” Katsuki yawned, stretching one arm across his chest, “Night, then.”\nDeku smiled at him, something a little more personal than his usual camera-worthy grin. “Night, Kacchan!” He twisted back around in his seat, humming along quietly to the next song that was playing, and Katsuki covered himself with his blanket before he was caught smiling at him like an idiot. Who the fuck gave Deku the right.\nWhen Katsuki grabbed his phone to turn off his alarm the next morning, he came face to face with more notifications that he had ever gotten. All from his stupid fucking Twitter account. What the hell?\nDeciding he was too tired for whatever that shit was this early in the morning, Katsuki just rolled out of bed and went to get dressed, yanking back the curtain as he did and making Deku grumble from under his pile of blankets. The dumb fuck probably stayed up too late working again. For good measure, and also because he felt like it, Katsuki grabbed the pillow he’d thrown last night off the floor and chucked it onto Deku’s head.\n“Kacchaaaan,” Deku groaned, shoving the pillow off his face and sitting up with what was perhaps the cutest glare Katsuki had ever seen. Katsuki wanted to…squish his face, or something. God, he sucked at this.\n“Mornin’, dumbass,” Katsuki greeted, pulling his tank top over his head then grabbing his phone from off the dresser and heading out of their room. He went to grab himself some leftover miso soup from the fridge, only for his damn phone to buzz again. Alright, fine, what the hell was going on there. \nThe first thing he noticed was his new four thousand and something followers, then the countless numbers of direct messages. What in the actual fuck? Thoroughly confused, Katsuki clicked on the notifications tab, finding that his singular tweet that had pretty much zero content had somehow blown up. Most of the replies were…he felt his stomach lurch a bit with sudden dread – most of the replies seemed to be under the impression that he was Kacchan.\nHe fucked up. He really fucked up. How in the hell did this even happen?\nKatsuki navigated his way back to the conversation he’d been having last night with the extra, assuming that had to be where this had all started because he’d literally done nothing else.\nno @dynamight\nReplying to @freckledeku [Image: multiple pictures of Deku doing different things.]\ngreat explosion murder max @freckledeku\nReplying to @dynamight ASLKDLDKF OKAY I’VE NEVER SEEN THAT THIRD ONE YOU WIN. where did you find that??\nOh, fuck. Fuck, fuck, FUCK. He thought he’d only posted pictures Deku had posted, too. Shit, this was bad, this was very, very bad.\ngreat explosion murder max @freckledeku\nReplying to @dynamight okay wait seriously where did you get the third one because deku only posts so many pictures of himself not with his friends…\nKatsuki clicked on the extra’s profile and found that his theory was correct. They’d posted the damn photo – a picture of Deku in heart sunglasses and floral button-down he’d found in a shitty thrift store, holding up peace signs and obviously on the verge of laughter – and captioned it asking their one thousand something followers if they had ever seen it. Someone asked where they got it, everyone remembered “Kacchan” was the one who took most of Deku’s photos thanks to Deku apparently mentioning that before, and then things blew themselves out of proportion thanks to a bunch of fucking pseudo-Todorokis and their conspiracies.\nIn short, Katsuki had fucked up.\n“Kacchan?”\n \n--\n \nKacchan whirled around the second Izuku said his name, eyes wide and looking almost defensive about something – which might have been the phone he was literally hiding behind his back. Izuku frowned at him, still rubbing the sleep from his eyes. “Are you okay?”\n“Why the fuck wouldn’t I be,” Kacchan snapped, almost robotically if Izuku thought Kacchan had any capability of being truly awkward. \n“I dunno,” Izuku shrugged, furrowing his brows, “you tell me.”\nKacchan glared at him, the are-you-seriously-sassing-me-right-now kind, then huffed. “I’m fine.”\n“Okay, then,” Izuku conceded, making his way into the kitchen and hip-checking Kacchan out of the way to get to the fridge. Kacchan elbowed his shoulder in retribution, making him laugh. \n“You stayed up too late again,” Kacchan said, not a question. Izuku smiled at him sheepishly.\n“Not that late…I was only up for an hour…or so,” he admitted, feeling himself blush a bit because part of the reason it had taken so long to get his work done was that he kept getting distracted thinking about his…moment…with Kacchan last night. He had thought about kissing him, again. But, like, actually kissing him. Which was a lot. \nKacchan flicked his forehead. “Ack!”\n“That’s for being dumb.”\nIzuku pouted at him, rubbing the spot on his forehead a bit as he grabbed a slice of bread from the fridge. “Rude.”\n“You deserve it,” Kacchan said, taking a bowl of miso soup out of the microwave, then moving to sit at the kitchen counter and look back at his phone. His expression made Izuku slightly concerned, but he figured it was something about school and decided to let him be. He could always ask him about it later, when he wasn’t as stressed. Maybe whatever it was would fix itself by the evening.\n \nIzuku actually got to class on time that day, and spent his day doing his best to listen to his professors drone on about behavior of human beings and patterns of speech processing rather than following passing daydreams of romantic beach picnics with Kacchan, or more kissing. He wasn’t doing a very good job, though, seeing as one of his classmates asked him if he was sick because his cheeks were so red. So that was great.\nAbout halfway through his fourth and final class of the day, Izuku got a text from Todoroki asking if he could meet for coffee in an hour or so. Thinking his friend must’ve finally got a short break from his busy schedule as of late, Izuku happily agreed and walked to the coffee shop a few blocks away from campus after his class let out. He found Todoroki hiding in the back corner of the place, away from most windows but not from prying eyes and dramatic glances from other patrons.\n“Hey!” Izuku greeted, taking the seat across from him.\n“I ordered your usual thing,” Todoroki responded, pushing a coffee cup across the table, “hope that’s okay.”\n“Oh, thank you very much,” Izuku smiled, taking the drink and taking a sip, “I see you got a break, finally. How’s the new movie going?”\n“Fine,” Todoroki answered with a bit of a shrug, “I think I made a new friend.” He took a sip of his tea. “Her name is Camie and she’s a little strange, but she’s nice.”\n“I think I’ve heard of her,” Izuku mused, “She played the main character in Illusion, right?”\n“Probably,” Todoroki said, then sat up straighter in his chair and fixed Izuku with a very serious look that made his more than slightly nervous. “Sorry, Midoriya, bit there was actually something I wanted to talk to you about.”\n“Okay…,” Izuku said, wondering what in the world he could be thinking of, “Go ahead.”\n“I wanted to apologize,” Todoroki continued with the sincerity only he could have. Izuku was only more confused. “A while ago you requested that I not tell Bakugou about…” he trailed off, glancing around the café and making a few patrons quickly duck their heads and pretend they weren’t staring or trying to eavesdrop. Izuku sighed in annoyance. “…well, the dating thing.”\nIzuku’s eyes went wide as his heart sped up a bit. “Yeah?”\n“Well, yesterday evening I was over at Mina’s home, and we…convinced Bakugou to go on Twitter,” Todoroki said, cringing the slightest bit, “and then Mina told him to look up his nickname, and he…saw things.” He what. “I’m very sorry for breaking your trust,” Todoroki continued, bowing his head slightly, “I should’ve stopped them.”\n“Oh,” Izuku said, then shook his head to come back to himself, “Oh, no, Todoroki, that’s fine! Don’t worry about it, Kacchan can do what he wants so that wasn’t your fault.”\n“You still look worried.”\nIzuku sighed, tapping the top of his coffee cup. “He was acting a little weird yesterday and this morning…” His heart dropped as quite the depressing thought came into his head. “Oh, shoot, he was probably grossed out by the idea.” Of course Kacchan would be weirded out by people thinking he’d date Izuku. It was weird.\n“I wouldn’t say that,” Todoroki commented coolly with a sip of his tea, making Izuku look up, confused, “He seemed more surprised than anything.” He took another sip, then mumbled, “Or flustered.”\nIzuku blinked at him, feeling like he’s just been slapped across the face with a raw fish. “What?” he squeaked. Was Todoroki on Ochako’s side?\n“I do not wish to breach the privacy of another friend,” Todoroki said, effectively side-stepping the question, “I would only warn you to not put words into Bakugou’s mouth. He doesn’t seem the type to take kindly to that.”\nOnce again, Izuku found himself with no clue as to how to respond. Todoroki didn’t seem bothered by his silence at all, continuing to drink his tea and waving at a little boy in the line at the counter who had been staring at them. \nThe problem was that Todoroki was right. Kacchan hated it when people said things for him or assumed things about him. Izuku knew that, but…but that didn’t mean anything. Well, maybe it did? But what was he supposed to do, ask Kacchan if he liked him back or not? He’d rather fight All for One with his bare fists than do something that risky.\nBesides, he had a slightly bigger, more immediate issue to deal with.\n“Do you think he’s mad at me?” Izuku asked after a bit of silence. “For, you know, not telling him.”\n“I’m pretty sure you can tell when Bakugou is mad,” Todoroki deadpanned, and Izuku laughed sheepishly. \n“Right,” he smiled a bit, “I should probably still say something to him about it, though.”\n“Probably,” Todoroki agreed, then looked at Izuku for a second, almost analyzing him. “But…I wouldn’t worry too much about it. You’re very close, something like this isn’t strong enough to do anything.”\nIzuku smiled for real at that. A recognition of his and Kacchan’s bond always did that to him. “Thank you, Todoroki.” He grabbed his coffee cup again. “Anyways, tell me about your new friend Camie!”\n“You say that like I’m your preschooler son.”\n“They grow up so fast.”\n \nTodoroki had to leave after an hour or so to get back to set, paying the bill before Izuku could argue and giving him a cryptic look before getting in his car and driving off. After walking home, Izuku still had some time before he planned to start a stream, and he decided to check his phone for any important notifications he’d muted before setting himself to work on school. \nHe opened his Twitter to more direct message notifications than he’d ever gotten, possibly more than the time his wi-fi had cut out mid-scream while he was playing a horror game Kacchan had triple-dog-dared him to try. There were thousands this time. Literally thousands.\nStarting to feel a little panicked and desperately hoping nothing terrible had happened, he clicked on a random one and read through. The only contents of the message were an all-caps “IS THIS KACCHAN” along with a screenshot of an account by the username @dynamight, no profile picture, zero following, and over five thousand followers. The display name was just plain “no”. \nIzuku frowned, clicking through a few more messages to find more or less the exact same situation from nearly every single person. Finally, he found one with a bit more explanation to it. \n \nluka (๑•̀ㅂ•́)و✧: people think that they account @dynamight is actually Kacchan because of one of the pictures he posted, is that true?? this was the picture\nluka (๑•̀ㅂ•́)و✧: [Image: a picture of Izuku wearing heart shaped sunglasses and floral shirt, grinning at the camera with his hands held up in peace signs.]\nluka (๑•̀ㅂ•́)و✧: sorry about the spam I’m sure you’re getting lol 😅\n \nIzuku opened the picture and frowned deeper, furrowing his brows. Why would that make people think this user was Kacchan? There were hundreds of random pictures of him online. But, he did admit he wouldn’t have thought of posting this one himself, seeing as he looked like he was about to burst out laughing and it was slightly embarrassing. It must’ve been from one of his friends, then. It surely didn’t make this random person secretly Kacchan.\nOut of curiosity, Izuku decided to take a look at @dynamight’s profile to search for any other clues to why people would connect the account to his roommate. But there was literally only one tweet on the account, albeit a popular one, that simply read “okay yeah fuck I’ve got a thing for deku”. Izuku felt his face flush, but this was just another random person on the internet.\nUnder the replies tab, @dynamight had briefly argued with another random user over…well, over Izuku himself, which was certainly not helping his flustered situation, and posted a few pictures of him. All in all, it wasn’t anything Izuku hadn’t seen before. So, what was the big deal? Kacchan hated social media with a passion, he didn’t have any accounts on it anyway.\nAgain, feeling curious, Izuku went back to @dynamight’s main profile and discovered that the account was only made sometime in this past month. The singular tweet was from last night. This person hadn’t been on this account for long.\nAnd Todoroki did say Kacchan had looked through Twitter yesterday – no! No, that was crazy. Kacchan had probably just used Mina or Todoroki’s account, not made a new one of his own. @dynamight was not Kacchan. \nProbably.\nNo, definitely. Don’t be stupid, Izuku.\nBut, because he was a masochistic idiot, Izuku spent the next far-too-many minutes scrolling through his direct messages and mentions for further reasoning to the “@dynamight is Kacchan” theory. He learned that, apparently, the photo had never been posted before, which was a reasoning that only served to make him wonder exactly how closely these people followed him. How in the world could they know for sure he or one of his friends had never posted that image?\nThings only got worse when he found that Kacchan was trending on Twitter thanks to Ochako’s text message. \n \n&gt;&gt; have you seen this yet?\n&lt;&lt; kinda\n&lt;&lt; I am very confused ochako\n&lt;&lt; they think they found kacchan on twitter\n&lt;&lt; but he doesn’t have twitter?? so why??\n&gt;&gt; oh…\n&lt;&lt; what’s that supposed to mean?!?\n&gt;&gt; nothing!! just maybe talk to bakugou? communication is key, remember?\n \nIzuku sighed. She was right, but how the hell was he supposed to bring this up when he’d been hiding this kind of stuff from Kacchan for the past five years?\nThe door opened before he got a chance to think it through.\n \n&gt;&gt; oh shit he’s home help\n&lt;&lt; talk. to. him.\n&gt;&gt; nononononono I cant do that\n&lt;&lt; do it. I’m turning my phone off now\n&lt;&lt; OCHAKO\n&lt;&lt; OCHAKO COME BACK\n&lt;&lt; you’re the worst\n \n“Deku, what the fuck is wrong with you,” Kacchan said, interrupting his mild panic. Izuku shot up straighter in his seat at the kitchen counter and slammed his phone down a little too harshly. Kacchan gave him a look of slight concern.\n“Nothing!” Izuku nearly yelped, then lowered his voice to a sane level, “Nothing at all, everything is A-okay! All good here.” Kacchan kept staring at him. “No…no problems. Everything is-”\n“Cut it out.”\n“Yes.”\n“Now take a fucking breath, Deku,” Kacchan ordered, hanging his schoolbag on the wall hook and making his way over to the counter, leaning on it on the opposite side from Izuku. Izuku complied, taking in a few slow breaths to calm his racing heart and keep his head in order. “What’s the damn problem.”\nIzuku took one more deep breath, mostly to stall, trying to figure out what exactly he wanted to bring up first. “So…uh, I talked to Todoroki today, and he told me that you found out about the whole…” He cleared his throat awkwardly, unable to meet Kacchan’s eyes. C’mon, Izuku. “Uh, the shipping stuff. Of you and me?” He finally mustered the courage to glance up and was surprised to find Kacchan looking relieved, of all things. “I guess I just wanted to say sorry?” he continued, “Because, you know, I never told you about that even though it involved you.”\n“Oh,” was all Kacchan said in response, which only made Izuku more nervous.\n“I only didn’t say anything because I…well, I had no idea how to bring it up, really,” he started to ramble, “because, you know, it’s kind of…uh…kind of…awkward? That people think we’re-that you would- that we’re…yeah, I just didn’t know how to bring that up and, oh gosh I’m embarrassed about it now I should’ve just told you the first time you would’ve probably laughed at me and then we-”\n“Deku.” \n“-it would have been nothing, probably!” Izuku blurted right over him, “Why would it be anything, it’s not like we actually are…you know! Nor do we want to be, so…it’s nothing! Nothing at all, not a big deal, we’re cool. Totally-” He cut himself off when he caught sigh of Kacchan’s expression again. He didn’t look weirded out or even mildly annoyed like Izuku would’ve expected. In fact, given Izuku’s long life of figuring out Kacchan’s feelings from his expressions and body language, he looked disappointed. Hurt, even. About what? “Are you okay? I’m really sorry about-”\n“Deku, shut up,” Kacchan interrupted, making Izuku snap his mouth closed as he fiddled nervously with his hands, “It’s whatever.”\nWhy did he sound so sad?\n“Was there anything else you wanted to say, or can I get to my fucking work?”\nNow he sounded mad. But…Izuku would rather get this all over with right now than draw it out for later. \n“Uh…there was one more thing, actually,” he started, tapping his fingers nervously over his phone case and jiggling his leg under the counter, “Because I figure you should know about this stuff now…you’re kinda trending on Twitter today.” Izuku got absolutely zero reaction from that, which served to make his heart race faster because something was definitely wrong. “It’s not a big deal, just some people found an account and they think it’s you.” He laughed, awkward and strained. “Which is crazy because you don’t…you don’t have social media so. Yeah, just people being weird.” \nKacchan stayed quiet, staring at Izuku with those red eyes like firelight reflecting of billowing smoke, an almost vulnerable look. A resigned look. But that wasn’t right. Kacchan didn’t just…give up on stuff. And what was he even giving up on?\n“Kacchan…something’s wrong,” Izuku finally said, “I can tell something is wrong. What is wrong? Did I do something?”\nKacchan tapped his fingers against the counter, just once, then averted his eyes and started to stand. “I’ll get over it.”\nIzuku blinked at him in surprise, also standing. “Get over what?” Kacchan didn’t answer. “Kacchan, please talk to me. What did I do?” He raked a hand through his hair, feeling tears prick at his eyes as the words spilled out, desperate for any solution to a problem he didn’t understand. “I promise I never meant to lie to you, and I’ll never do it again – or is the account? I can make a statement saying it’s not you, it’s just a joke – or I can tell everyone we’re not dating, if that’s what’s bothering you!” \n“Deku, stop.”\n“No!” Izuku yelled, fully crying now, “No, I’m not gonna stop because you’re mad at me and I don’t know why and I’m trying to fix this but I don’t know what I did wrong! I never meant for this stuff to happen, I’m doing my best here, but I can’t…you can’t just do this to me again!” He sniffled loudly. “Don’t push me away and not tell me why, Kacchan, I deserve to know why!”\n“Fucking hell, Deku!” Kacchan yelled, slamming something down on the table, “Shut your damn mouth already! This is my fuck-up, not yours.” Izuku froze, meeting Kacchan’s crimson eyes as his friend sighed. “Just look at the fucking phone and then yell at me all you want, I don’t care. But…I’m not fucking leaving unless you want me to, alright? I’ve stuck around your dumb ass too long for that shit.”\nIzuku, now thoroughly confused but incredibly touched, wiped his tears with the sleeve of his t-shirt and looked down at what Kacchan had put in front of him, which happened to be his phone. Open to a Twitter account. Kacchan’s Twitter account. \nWith the username @dynamight.\nMeaning a) Kacchan was @dynamight, b) Kacchan was into him, and c) Izuku had essentially just rejected him without the middleman step of a confession. Also known as screwing up, badly.\n“Deku,” Kacchan said, making Izuku realize he had been sitting there, staring at the phone in shock, for who knows how long.\n“You’re…” Izuku started, glancing up at him and trying to form any coherent thought through all the screaming in his head, “it was actually you?”\n“What does it fucking look like, idiot?” Kacchan glowered. \n“It looks like you’re dynamight,” Izuku said. Kacchan gave him a look, and he cleared his throat nervously. “You’re dynamight. Right. Got it.” He furrowed his brows. “Wow, I can’t believe people actually guessed that. It’s a little creepy, honestly.”\n“Deku!”\nIzuku stood up a little straighter and remembered he should be saying something very different right about now. “Yup. Sorry. Um. This is just…did you…” he pointed at the phone screen awkwardly, “did you happen to actually mean that?”\nKacchan drew in a breath, glaring at him. “Yeah.”\n“Oh,” Izuku squeaked, suddenly feeling faint, “I think I’m…I’m gonna sit down for a second,” he announced quietly, dropping into his seat at the counter and staring into space. This was not real. This could not be real. “I don’t think Kacchan knows any other Dekus, though.”\n“What?”\nWoops, he said that out loud.\n“Sorry,” he managed, “sorry, I’m just…I’m not asleep, am I?” He pinched himself to make sure and found that it very much did hurt. “Ow! Nope, not asleep.”\n“What the fuck is wrong with you?” Kacchan frowned, “Aren’t you gonna…I don’t know, leave?”\nIzuku blinked at him dumbly, feeling as if his brain was in a haze. “Why would I leave?”\nKacchan looked at him like he was a total dunce, which was nothing new. “Because I told the entire fucking internet that I have a fucking thing for you.”\nHearing him say it out loud was like getting his head dunked in ice cold water, a complete shock to the system that confirmed for the thousandth time that this was actually happening. “You have a crush on me,” he breathed.\nKacchan growled in frustration, propping his elbows up on the table and running his hands through his hair aggressively. “For the last fucking time, yes. God damn it, could you be drawing this rejection out any fucking longer you asshole.”\n“This…” Finally, reality came back to him like a bullet train going over the speed limit and Izuku jumped out of his seat so fast he nearly fell over. “No!” he yelped, waving his hands around like a crazy person, “No! This isn’t-I’m not!” Kacchan glared at him harder while Izuku struggled to form actual words, using his hands to chaotically motion back and forth between the two of them. “I-you…I also. I mean, shit, uh. I, uh, you – me too.”\nHe was disaster who belonged in a dumpster. What in the world was that.\nIn good news, Kacchan no longer looked seconds away from strangling him. Now he just looked…confused out of his mind.\nWell done, Izuku.\nSucking in one last deep breath, Izuku clasped his hands together in front of him and exhaled strongly. “What I am trying to say, Kacchan, is that I…feel…the same as you do. I also have the…” Was it, like, a hundred degrees in this apartment? “…the romantic…notions. Those.”\nKacchan stared at him in stunned silence, and Izuku buried his red-hot face in his hands. “If there is any god listening, now would be a great time to smite me,” he muttered, “I am the worst. That was the worst. Let me shrivel up and die. Oh my god.” After way too many seconds of nothing, Izuku peeked out from between his fingers to find Kacchan still staring at him like he’d grown a second head, his ears painted bright red under his ash blonde hair. “Kacchan?”\n“I don’t…I don’t know what the fuck I’m supposed to do right now,” Kacchan admitted, which was rare enough of a statement that it made Izuku almost laugh. Which of course, Kacchan noticed, earning Izuku a glare. \n“Sorry,” Izuku snorted, covering his mouth as more laughter bubbled up, mostly thanks to nerves. “I think I’m going crazy.” He snorted again, sinking to his knees as he covered his face with his hands. “Oh my god what is happening.”\n“I have no fucking idea, now why are you on the ground?”\n“I don’t know!” Izuku said, his voice pitched way to high as he let out another laugh. “Help.”\n“Okay, something is seriously wrong with you,” Kacchan grumbled, suddenly grabbing his arm and dragging him to his feet. Izuku just let him, finding his balance again and then freezing when he glanced up to meet Kacchan’s eyes and realized he was still being held onto. Kacchan’s cheeks were pink now, too, and Izuku couldn’t help but think it was adorable.\n“I have no idea what to do either,” he said, grinning at Kacchan and feeling like that time as a kid he’d taken a shot of Auntie’s whiskey and almost broke a vase.\n“Why are you looking at me like that.”\n“Like what?”\n“Like that,” Kacchan repeated, narrowing his eyes at Izuku. That just made Izuku start laughing again, then Kacchan shook him back and forth which made him laugh harder, and without another thought and lunged towards Kacchan and squeezed him into a hug. \n“’Cause I like you,” Izuku said, muffled into Kacchan’s shirt. Then, he pulled back a bit to look at him. Stark red eyes, sharp nose, spiky ash blonde bangs, and a look of someone without a smidgen of an idea about what to do with themselves. He made Kacchan look like that. He made Kacchan feel like that. Once again barely thinking, Izuku slid his arms out from around Kacchan and placed them on his cheeks instead. “Can I kiss you?” he breathed, then immediately froze up. “I mean…shoot, that’s a little fast, sorry, I thought I was gonna say something else-”\n“Okay.”\nIzuku’s heart just straight-up stopped beating. “What?” he managed, little more than a whisper.\nKacchan smirked at him. “I said okay.” \nAnd then he was being kissed.\nBy Kacchan.\nKacchan was kissing him.\nHOLY SHIT KACCHAN WAS KISSING HIM. \nIzuku’s brain rebooted just in time to stop Kacchan from pulling back, quickly sliding his hands from his cheeks to around his neck. Kacchan’s hands settled on his waist. His lips were so soft. Izuku suddenly felt like he was going to fall down at any second. Oh boy. Lots of things happening.\nHe broke away after a few seconds but didn’t even think about letting go, both because he might’ve collapsed the second he did and because he really did not want to. He never wanted to let go of Kacchan again. This was the best thing that had ever happened to him. Including that time the real life actor for All Might shook his hand. Well, maybe it was tied with that.\n“Seriously, I’m tied with All Might?” Kacchan said, making Izuku realize he’d been muttering his train of thought this entire time. He smiled at him, raising a brow with a shrug. \n“It was All Might, Kacchan.”\n“Well,” Kacchan started, leaning in and grabbing Izuku’s chin lightly, “you always used to say I was better than him.”\n“Mm,” Izuku hummed, full-on staring at Kacchan’s lips instead of his eyes. “You could always try to convince me.”\n“Easy.”\nKatsuki loved threading his hands through Deku’s hair. It was so damn soft. And he made this weird-ass purring noise when he did, which made Katsuki feel all kinds of things he didn’t want to think too hard about. \nThe two of them probably spent the better part of an hour on their couch, doing nothing but letting out all the stupid pent-up feelings from the past…ten years, probably. Deku tasted like caramel-sweetened coffee and coconut chapstick, and Katsuki couldn’t get enough of it. Couldn’t get enough of every part of him. God damn it, if only he’d realized how badly he wanted to do this and fessed up a whole lot earlier. He could’ve made out with this nerd a hundred times over.\nBut fuck that, he had all of right now and the foreseeable future to make up for lost time. He planned on more than making up for it.\nEventually, Deku broke away fully to take in a huge breath, staring down at Katsuki with his face bright red as Katsuki smirked up at him, keeping his hands at their place on Deku’s waist. He liked holding onto him. He liked a lot of things about being with Deku like this, he’d found.\n“So,” Katsuki murmured, his voice a little rougher than usual, “still thinking about All Might?”\n“Absolutely not,” Deku responded, sounding like he was about to pass out. Katsuki smirked. Damn right. “But I think if we keep doing this I’ll die. There is only so much I can take in a day, Kacchan.”\n“Hm,” Katsuki hummed to himself, looking up at Deku like the damn idiot he apparently was, “that’s a fucking shame.”\nDeku’s eyes went wider, and he shoved his face into the couch arm next to Katsuki’s head. “That’s what I’m talking about, Kacchan. Stop that.”\n“Stop what?” Katsuki mumbled, tilting his head to kiss Deku’s neck and making him shoot upright with a tiny yelp.\n“Kacchan!”\nKatsuki snorted at his beet-red face and electrocuted expression. This was fun, actually. “What, you fucking dork.”\n“You-I-Kacchan, you-,” Deku spluttered, narrowing his eyes with a pout, “You’re doing this on purpose.”\n“Hell yeah I am,” Katsuki agreed, “you’re cute when you blush.”\n“Okay,” Deku wheezed, “okay, I can’t do this anymore. Great while it lasted, Kacchan, but if you keep talking like that I will die.” Katsuki snorted again, sitting upright as Deku tried to scramble off of him in a flustered panic, somehow fucking up bad enough to fall off the damn couch. Katsuki would’ve laughed at him if the fucker hadn’t grabbed his arm and yanked him down too.\n“Deku!” Katsuki yelled, untangling their limbs until he was able to bring himself up onto all fours above the nerd, who quickly hid his face in his hands and muttered something completely unintelligible. He was adorable. “You wanna get away from me so bad you pull me off the fucking couch?”\n“Shut up!” Deku wailed, obviously embarrassed beyond belief which only served to further Katsuki’s amusement. \n“Make me,” he grinned. \nDeku opened his hands to glare at him. “Stop flirting with me, I am literally having heart palpitations.”\n“You’re so fucking dramatic,” Katsuki said, meaning it to come out a scoff but instead somehow landing on a purr. Deku literally squeaked at him, shoving a hand over Katsuki’s face to push him backwards. “Oi!” \n“Stop being pretty at me!” Deku wailed. \n“What the fuck does that even mean?”\n“I don’t know! I’m overwhelmed!”\n“Alright!” Katsuki laughed, grabbing Deku’s wrist to pry his hand off his face and sitting back on the balls of his feet, resting his arms on his knees and smirking down at Deku. “I’ll give you a break.”\nDeku blinked at him from where he lay star-fished on their carpet, then pouted. “Wait no come back.”\n“Oh my god, Deku!” Katsuki guffawed, pushing himself all the way to his feet. “Make up your damn mind!”\n“Never!” Deku countered, sitting up but staying sat on the floor. Then, he frowned a bit. “We still have things to talk about, don’t we.”\n“I guess,” Katsuki agreed, dropping into a spot on the couch. Deku pulled himself off the ground and sat opposite from him, pulling his legs up to his chest.\n“Okay,” Deku started, tapping his knees a few times, “uh…I don’t know how to start this.”\n“Don’t fuckin’ look at me,” Katsuki frowned, “I’ve never done this shit either.”\n“Well, I guess first on the list would be what ‘this’ even is,” Deku concluded, meeting Katsuki’s eyes with a nervous smile. “I mean…you said you were into me.”\nKatsuki wished he had something to throw at him. “Yeah, then I fucking made out with you for an hour, I’d sure hope we were past that part.”\n“Right, yeah,” Deku said, staring blanky at a point on the couch for a second, “that did, in fact, just happen in real actual life.” He looked back up at Katsuki. “Which would make us…uh. Dating? Even though we’ve never been on a date, so I don’t know if it counts, and don’t these things usually go a little slower? Maybe they do, I’ve only watched movies so I have no good frame of reference for this specifically, but-”\n“Oi, nerd.” Katsuki reached out a foot to tap Deku’s forehead before he could start a ramble. Deku snapped his mouth shut and gave Katsuki his attention. “I don’t give a shit what you call us, honestly, but…” he trailed off, looking Deku up and down for a moment. “If it helps your nerd brain stop freaking out, just say boyfriends.”\nHe figured the only real difference between how he and Deku were feeling right then was that he was better at hiding it. Or at least he hoped he was. He freaked out in his head while Deku looked like he’d been told all superheroes were real and they were waiting outside the door to meet him, or possibly like Katsuki had slapped him across the face.\n“Oh,” he finally wheezed.\nKatsuki tried not to laugh in his face. “You good, Deku?”\n“So good,” Deku rasped, then coughed aggressively, “yup.”\n“Great,” Katsuki said, leading into an awkward pause, “Next thing.”\n“I guess if we have all the…us stuff figured out,” Deku said, his cheeks pink, “then it would just be the, you know, internet situation.” Katsuki scowled. Yeah, that. “I mean, we could just ignore them if you wanted.”\n“Nah,” Katsuki said, even surprising himself a little with an answer he hadn’t thought out beforehand. But he might as well go with it. “Gimme a second,” he decided, standing from the couch to retrieve his and Deku’s phones from the kitchen counter. He flopped back down, tossing Deku’s phone over to him before opening his own and making some edits to his Twitter profile. First up was deleting everything he’d posted up to that point, which was only the one embarrassing tweet and the few replies. Next was the rest of it. Finally, he followed his three friends and one boyfriend.\n \nKatsuki @dynamight\nAKA Kacchan.\n4 Following 6,024 Followers\n \n“There,” he said, turning his phone screen around to show Deku, “Kacchan’s got a Twitter now.”\nDeku grinned at his phone, then at him. “You know this means everyone’s going to know you like me, right?”\n“Pretty sure they already fucking figured that out,” Katsuki countered, cheeks warm.\n“Fair,” Deku said, nodding a bit, “And you’re okay with your real name there?”\n“Wouldn’t have put it if I fucking wasn’t,” Katsuki pointed out. People would figure out who he was eventually, as he’d discovered, but it didn’t really mean anything in the long run. He’d keep doing whatever he wanted regardless, fuck anyone and anything that tried to get in the way of that.\n“Alright then,” Deku smiled, grabbing his own phone, “I’ll tag you in something to let everyone know it’s real.”\n“Go for it,” Katsuki muttered, leaning back into the couch cushions and staring at him for a second. His boyfriend, with his wild dark hair and all those stupid freckles. He had the strong urge to reach out and latch onto him like koala, so instead of stopping himself he just grabbed Deku by the waistband of his shorts and pulled him across the couch, twisting him around as he did until his back was against Katsuki’s chest. Fuck yeah. \n“Kacchan, what…” Deku trailed off as Katsuki wrapped his arms around his torso and leaned forward to rest his chin on Deku’s shoulder to look at his phone screen.\n“What’d you write?” Katsuki asked, playing it off as nonchalant because he knew that would fluster his nerd the most.\n“Uh…” Deku managed, sounding a little hoarse, “nothing yet.”\n“Well hurry it up then,” Katsuki smirked to himself, breathing in the faint laundry smell of Deku’s sweatshirt and feeling more comfortable than he had in a while.\nDeku cleared his throat quietly, then slowly relaxed a bit into Katsuki’s hold. Cute. “How…uh, how do you feel about telling people that we’re together?”\nKatsuki thought about that for a moment. He hated random people in his business, and definitely valued his privacy, but…for fuck’s sake, three million people on the internet were out there thirsting over his boyfriend every damn day. Not like Deku was gonna go running off to any of those random extras but he might as well show them what’s what.\nAnd it may have been less than a few hours since they got together, but Katsuki didn’t see getting over him or getting away from him anytime soon. Not when he’d apparently been wanting this for way too many fucking years.\n“Go fucking wild, I’m yours now,” he mumbled. Deku made the weirdest noise he’d ever heard, like the verbal keysmash of strangled person. “What is wrong with you?”\n“You can’t just say things like that!” Deku wailed pathetically. \nKatsuki rolled his eyes and squeezed Deku a little tighter. “Alright, fine, I hate you. Ugly loser ass.”\n“Now that’s what I’m used to,” Deku said, making Katsuki laugh. “Okay, how’s this?” He held up his phone for Katsuki to better see. \n \nDEKU! @smallmight\n@dynamight my beloved is now on twitter everyone say hi kacchan\n \nKatsuki felt his face heat up in a very unwelcome change of events. “Your what.”\n“Hey,” Deku said, and Katsuki could clearly hear his shit-eating grin in his voice, “you said you were mine.” Katsuki did not like this taste of his own medicine whatsoever. “I’m yours too, handsome.”\n“Shut up,” Katsuki hissed, feeling his palms start to sweat. Deku giggled, which made everything a billion times worse. \n“What, I can’t flirt back?”\n“No.”\n“See?” Deku said, clicking send on the tweet, “Now you know how it feels…my beloved.”\n“I’m gonna kill you.”\n“Charming.”\n \n--\n \ngreat explosion murder max @freckledeku\nOH MY FUCKING GOD I WAS RIGHT HOLY SHIT ASDLKFJLD\n \nHoney | mirko’s fluffy tail @honeycomb\nDECCHAN CANON THIS IS NOT A DRILL THEYRE REAL IM FREAKING OUT RN\n \ngecko @lesbian_bubblegirl\nKACCHAN IS HIS BELOVED IM GONNA CRY. DECCHAN CANON YALL\n \nbread @bag_uette\nDECCHAN CANON AND KACCHAN ARE TRENDING TODAY IS THE GREATEST DAY\n \nkacchan’s shoulders @redwinghawks\nKACCHAN NAME REVEAL WHY IS KATSUKI SUCH A HOT NAME. face reveal next?? 👀👀\n \nKatsuki @dynamight\nAKA Kacchan.\n4 Following 152.3K Followers\n \n--\n \nThanks to both of them muting notifications to avoid the outpouring of chaos they’d caused, Katsuki was able to easily excuse the upwards of forty missed messages from all his and Deku’s friends. Of course, that peace couldn’t last long, as he found when the door to their apartment swung open so fast it banged against the wall and startled Deku so much he screamed, which in turn scared the shit out of Katsuki who was trying to finish a history of fashion assignment.\n“What the fu-”\n“KATSUKI,” Mina yelled right over him, pointing an accusatory finger, “Why haven’t you answered my messages?”\n“How the fuck did you get in here, the door was locked,” Katsuki countered. \n“Ochako knows how to pick a lock, now explain yourselves!” Mina shrieked, planting her hands on her hip. Her girlfriend behind her copied the pose, while Todoroki stood off to the side with a slight smile. \n“Uh…hi guys,” Deku started, nervously lifting his notebook to hide most of his face and he sat, curled up on the couch. \n“Don’t you ‘hi guys’ me!” Mina yelled, stomping over.\n“We did not sit through your shit for five years to learn you finally started dating over Twitter!” Ochako shouted, slamming her hands down on the counter where Katsuki was working. What the fuck was going on.\n“Oh, uh, sorry about that,” Deku tried to apologize, eyeing Mina like she was a raptor and he was an unlucky goat thrown in the cage, “We kinda…it just sorta happened. But…yeah. We’re dating now.” He shrunk back even further, his voice quiet. “Hooray.”\n“Congratulations,” Todoroki said as the only bitch in this house with any manners, apparently, while the two women each glared at their respective person who lived in the house they just broke into. \n“Thank you, Todoroki,” Deku squeaked, not taking his eyes off Mina as he shrunk back so far into the couch he might’ve disappeared into it. \n“Do you have anything to say for yourself, Bakugou?” Ochako demanded, narrowing her eyes at him. \nKatsuki just shrugged. “Deku speaks for the both of us now. Bother him.”\n“Kacchan!” Deku hissed, betrayed.\n“We are getting the full story right this second,” Mina announced, stalking over to Katsuki and grabbing his arm, “from both of you!”\n“Oi!” Katsuki protested as he was yanked off his chair and thrown onto the couch by Mina’s freakishly strong arms. The other three took their seats on the other side, consequently shoving Deku towards Katsuki which he had absolutely no problem with. In fact, he pulled Deku closer, right onto his lap, then hugged around him from behind to use him as a shield against the harassment. “Fuck off.”\n“Oh my god, Katsuki,” Mina cooed, squishing her cheeks and making him scowl at her. \n“What do you even want us to tell you?” Deku asked. \nOchako grinned with a frightening look in her eyes. “Everything.”\n \n--\n \nSix months later, Katsuki sat on the very same couch next to an energetic Deku as he rambled on about something way off topic from the question he was originally trying to answer. It was supposed to be a six-month anniversary Q&amp;A (that Katsuki had agreed to after a lot of promises), but someone had asked something Katsuki already forgot about and now Deku was going on and on about the technological advancements made my David Shield in the Plus Ultra fictional universe. \n“Deku,” Katsuki finally interrupted, reaching on camera to flick his forehead.\n“Ah!” Deku squeaked, cutting off his ramble with wide eyes, “Oh darn it! What was the question again?”\n“I think you should just move on,” Katsuki laughed, making Deku flush in embarrassment.\n“Okay, okay, next question,” he conceded, squinting at the chat log on his computer, “Since you’re childhood friends, do you have any embarrassing stories about each other?” Deku grinned and Katsuki groaned. “Ooh, I like that one.”\n“You do, huh?” Katsuki said as Deku smirked at him. “Alright, what if I told everyone about the time with the beetle?” Deku’s eyes went widened and Katsuki grinned in victory. “You remember, the little beetle you named…Bug Might, was it?” \n“Kacchan, no,” Deku started, pointing a finger at him. \n“You captured this poor bug and put it the jar, which suffocated it until it died because your dumbass forgot about air holes for dear old Bug Might-”\n“Kacchan!”\n“-and then you sobbed about it for like two whole hours!” Katsuki continued as Deku stuck out a foot to try and push him further away. Katsuki just grabbed his ankle and shoved his leg back in response. “But then you got scared that your mom was going to get mad at you for killing the bug-”\n“KACCHAN!” Deku yelped, trying to scramble out of his hold. \n“So what did you do, Deku?” Katsuki grinned, releasing him, “Do you remember? Because I do.”\n“Shut up.”\n“You ate it,” Katsuki concluded, “You ate Bug Might’s corpse.”\n“Shut up!” Deku wailed, burying his red face in his hands. He was so fucking cute. “I was like five years old! Don’t hold it against me!”\n“Bug killer.”\n“You’re one to talk!” Deku yelled, throwing his hands up, “For example, that one time you stepped on an ant hill to spite me for telling you to watch out for it-”\nNow it was Katsuki’s turn to get embarrassed. “Deku, don’t you fucking dare.”\n“And all the ants started climbing all over you,” Deku continued with a shit-eating smirk, “So you-” Before Katsuki knew what he was doing he lunged forward and tackled Deku back to the couch, shoving a hand over his mouth as he let out muffled protests and maneuvering himself to sit right on top of him. He was fully center frame now, a surprise face reveal, but all he did was grin sharply at the camera. He didn't care at this point, but his pride was not going to stand for Deku finishing that story.\n“Deku is dead, this is my channel now,\" he announced.\nAnd then Deku pushed him off the couch.\n \n--\n \nKatsuki @dynamight\nyeah.\n[Image: a picture of Katsuki and Izuku wearing heart-shaped sunglasses and matching patterned button-downs, taken in store’s dressing room mirror. Katsuki’s taking the picture with his free hand flipping the viewer off, and Izuku has an arm around his shoulder with the other holding up a peace sign.]\ngreat explosion murder max @freckledeku\nReplying to @dynamight HOLY FUCK"
}