{
    "id": "32651032",
    "url": "https://archiveofourown.org/works/32651032?view_full_work=true",
    "author": [
        "orphan_account"
    ],
    "title": "He Was Actually Really Being Truthful (For Once)",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "F/M",
        "M/M",
        "Gen"
    ],
    "fandoms": [
        "Spider-Man - All Media Types",
        "Spider-Man (Tom Holland Movies)",
        "The Avengers (Marvel Movies)",
        "The Avengers (Marvel) - All Media Types",
        "Marvel Cinematic Universe"
    ],
    "relationships": [
        "Peter Parker & Tony Stark",
        "May Parker (Spider-Man) & Peter Parker",
        "Peter Parker & Pepper Potts",
        "Peter Parker & Everyone",
        "Peter Parker & Flash Thompson",
        "Michelle Jones & Ned Leeds & Peter Parker",
        "Avengers Team & Peter Parker & Tony Stark",
        "Pepper Potts/Tony Stark",
        "James \"Bucky\" Barnes/Steve Rogers"
    ],
    "characters": [
        "Peter Parker",
        "Tony Stark",
        "Pepper Potts",
        "James \"Rhodey\" Rhodes",
        "Steve Rogers",
        "Bruce Banner",
        "James \"Bucky\" Barnes",
        "Happy Hogan",
        "Clint Barton",
        "Natasha Romanov (Marvel)",
        "Sam Wilson (Marvel)",
        "Avengers Team",
        "Academic Decathlon Team (Spider-Man: Homecoming)",
        "May Parker (Spider-Man)"
    ],
    "additional_tags": [
        "Fluff",
        "Domestic Fluff",
        "Domestic Avengers",
        "Stark Tower",
        "Tony Stark Has A Heart",
        "Tony Stark Acting as Peter Parker's Parental Figure",
        "Parent Tony Stark",
        "Parent Pepper Potts",
        "Protective Happy Hogan",
        "Adorable Peter Parker",
        "Sleepy Peter Parker",
        "May Parker (Spider-Man) & Tony Stark Coparenting Peter Parker",
        "Secret Identity",
        "Television Watching",
        "Peter Parker Gets a Hug",
        "Hurt Peter Parker",
        "Precious Peter Parker",
        "Peter Parker Has a Family",
        "Peter Parker Has Nightmares",
        "Peter Parker Has a Bad Day",
        "Peter Parker Gets Stabbed",
        "Peter Parker's Field Trip to Stark Industries",
        "Peter Parker Meets the Avengers",
        "Everyone Thinks Peter Parker is Tony Stark's Biological Child",
        "Everyone Thinks Spider-Man is Tony Stark's Biological Child",
        "I Wrote This Instead of Sleeping",
        "Everyone Thinks Peter and Tony are Related",
        "the avengers freak out",
        "POV Outsider"
    ],
    "language": "English",
    "series": "Part 1 of Safflower-verse",
    "published": "2021-07-18",
    "completed": "2022-05-26",
    "words": "14,672",
    "chapters": "10/10",
    "comments": "497",
    "kudos": "16,499",
    "bookmarks": "2,190",
    "hits": "251,375",
    "summary": "<p><em>Natasha looked more closely. She first saw hints of a second person in the sock poking out of the blanket at a strange angle, and the pale hand with curled-up fingers resting on Tony’s chest. Then she found a head of what looked like brown curls, tucked snugly under Tony’s arm. And eventually, a second set of sleeping breaths, slow and light.</em> </p>\n<p>OR</p>\n<p>The Avengers return from months of missions to find a child fast asleep on the lounge, with Tony snoring beside him. A mystery ensues.<br>Is Tony Stark a father? (It looks like it!) How have they never discovered the kid until now? I mean, Iron Man has always been good at keeping secrets, but a whole CHILD?</p>\n<p>Rhodey could trace the shock residually plastered through every crease and curve of the other man’s face. Natasha still had a particularly pensive expression, sure, but Clint was floored. He looked like he had a concussion.</p>\n<p>Maybe he did. Maybe that was a side effect of finding Tony Stark asleep on the couch <em>next to a kid</em>.</p>\n<p>“He’s yours, isn’t he?” Rhodey asked quietly. “Your son.”</p>\n<p>Tony opened and closed his mouth. Like a fish. “No?”</p>\n<p>Clint leant forward to end the recording, but now that Tony was finished talking the quiet ‘beep!’ the phone made was highly audible.</p>\n<p>“Oops,” he whispered, and quickly sent the video off to the Rogue Avengers’ group chat, with the caption, ‘Proof Stark has a son’.</p>\n<p>Sam flew through something sticky and flailed around in the air for a second before righting himself. “What was that?” he spluttered. He recognised the feeling, but; “a spiderweb? What the fuck?”</p>\n<p>The door to the lab slid mechanically open, to reveal a genius-billionaire-playboy-pilanthropist-<em>possibly-dad</em> according to the team’s conspiracy theories; and a slender, surprised-faced teen with brown curls standing awkwardly half-behind him.</p>\n<p>Maybe it was better that the Rogues didn’t sit in on this particular board meeting.</p>\n<p>At least it wasn’t as bad as the time he jumped onto the ceiling by accident because his pencil had rolled to the very edge of the table and the back of his neck felt like a bomb was about to go off.</p>\n<p>\n<em>“Colonel Rhodes has informed you on multiple occasions that you do not have to force yourself into threatening or vulnerable situations, but he encourages you to converse with Steve Rogers, as it may be a healthy way to resolve your emotions.”</em>\n</p>\n<p>“I’m already awake,” Peter cut in suddenly, without moving his head. </p>\n<p>Yep. That was a voice Steve recognised, holy shit. Conspiracy confirmed.</p>",
    "notes": "<p>So this is basically my first //idea// in the IronDad fandom... I took a few classic tropes (Peter meets the Avengers, Field Trip to Stark Industries, Everyone Thinks Peter and Tony are related) and just rolled them together with a massive bundle of fluff. And added a slight twist, which is that the Avengers think [censored due to spoilers] [sorry not sorry!]<br>There'll be ten chapters, but they won't be posted regularly.</p>\n<p>Argh I can't believe how mentally exhausting it is to write \"candy\" every time instead of \"lolly\"... American spelling is driving me nuts. Sorry, guys, you might end up with a weird mix of \"colour\" but then \"candy\"... If there's something blaringly not-American let me know.</p>\n<p>In case anybody was wondering about the whole mammoth milk thing in the last chapter (I know I was) both mammoths and elephants actually do produce milk. However, its toxic to humans, so no giant buckets of mammoth-milk carried around by little cave-men. And no mammoth cheese.</p>\n<p>Sadly.</p>\n<p>Many, many, endless thanks to everybody who enjoyed the first chapter of this story (and everybody who didn't enjoy too, I guess)! Your feedback and kudos meant so much to me!!</p>\n<p>Hi! It's been a while!</p>\n<p>Here's some sleepy-confused-and-a-bit-irritated Tony. And some Peter, too.</p>\n<p>I'm back in lockdown; going through online learning number 2, and I've got one thing to say. Not. Fun.</p>\n<p>Anyway, I've been meaning to finished this chapter for aaages but my computer was confiscated twice and then my notepad went through the wash, so there's that.</p>\n<p>Many thanks to everybody who reads, comments, leaves kudos, and bookmarks, have a wonderful day; and please stay covid-safe!! Wear a mask!!</p>\n<p>So, I've been asked to update... and I have! (Suprise!)</p>\n<p>Aaaah, hello!! It's been a little longer than I'd hoped... I lost my planning sheet for about the fifth time but I can mostly still remember what happens so I'm just going to roll with it. I'm a bit of a disaster sometimes so idk.</p>\n<p>A million thanks to everybody who is leaving kudos, bookmarks, comments... you guys are amazing and I absolutely, 100% wouldn't have the motivation to do this without you, you're pretty much the only reason this fic is alive in the first place!! I can't say thank you enough!!</p>\n<p>I've discovered that wanting to write and actually writing are too very different things. Sadly. But. I will promise that I will have the next chapter done and up by... well, how about before the weekend?</p>\n<p>(PS Also, Bucky's whole character did a 180 and just... I'm sorry. I couldn't fix it; and it didn't want to be fixed.)</p>\n<p>THERE IS AN ART. SOUND THE ALARM. SKBRIFUEDKJN PLEASE GO CHECK IT OUT <a href=\"https://www.tumblr.com/blog/view/fluffyartbl0g/674346754376974336\" rel=\"nofollow\">HERE!</a> ITS REALLY REALLY AWESOME AND THe person who made it is spectacular and i love them, you can check them out on tumblr @fluffyartbl0g and hand on my deepest respects</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">more notes</a>.)\n</p>\n<p>oH nO... nAt'S cLoSiNg iN!!!!<br>Sorry, Bruce, but she's literally the only person on the team with a braincell at the moment.</p>\n<p>(Sorry for the enormous delay! I really truly am sorry! Plus I hate this chapter it was a bitch to write and I didn't edit or read through at all so if you find mistakes please correct me in the comments!)</p>\n<p>Hello all you wonderful people!<br>Now, I'm sorry for going slightly AWOL during the holidays, I promise it's not permanent!! &lt;3 Not sure when the next chapter will arrive but I have no intention of deserting this fic so rest in peace etc. I love all your comments and kudos, they make my day!! Thank you!!</p>\n<p>PS I'd also like to extend a formal apology to the absence of Wanda, Vision, Thor, and the whole concept of canon. My eyes are suddenly open to the many painful holes in this fic, so if you're actually enjoying this, you get extra credit. I don't know what's happening with my brain at all.</p>\n<p>Happy New Year's Eve!</p>\n<p>I'd first like to make it quite clear to everyone who commented and left kudos that this chapter is dedicated to you. I wrote it for you and it belongs entirely, to you.</p>\n<p>Secondly, I'd like to explain away my absence as being the fault of Merlin and Good Omens (I love them both very much) which led my wandering feet very far from this work at times.</p>\n<p>Have a wonderful day, and if you've been waiting for this chapter, I applaud you for your patience.</p>\n<p><strike>*rocks up three months late with a multiverse plot*</strike> sssh what are you talking about</p>\n<p>So I started watching the Mandalorian and then I wrote like, half a chapter of this and half a chapter of that other series and half a chapter of something else entirely before I started thinking about how many fic plots I have written down in total and BOOM! This fic is gonna be part of a series which will, eventually, join a Multiverse. </p>\n<p>Also, I started this chapter like, \"I don't ship Stucky that much!\" and then, rereading this chapter.... uhh....</p>\n<p>nkjrefhdwkjn ive got a hundred and one things to do and of course i choose to do this ugh</p>\n<p>sorry for the very long delay i got bored. it happens sometimes. thankfully this is the last chapter so you dont have to worry about that happening again! in other words, thanks for coming on this journey. as something i started purely to get myself comfortable 1. being in a fandom outside of my head, 2. fumbling my way into things i liked and finding things i didn't like, and 3. posting online; this fic took off much more than i thought it would, so thanks to the <em>five and a half thousand</em> people who left kudos (holy shit there's so many of you)</p>\n<p>this last chapter, as always, is for you. </p>\n<p>ps. i gave up on american spelling, im not sorry.</p>",
    "text": "The night mist cleared. City lights glowed against the glass and steel facades of the skyscrapers.\n“30 minutes to landing,” the speakers crackled.\n“And do elephants produce milk?” Clint asked. He swallowed a mouthful of gummy bears before continuing with, “did woolly mammoth’s give milk? Did cave people ever make mammoth’s cheese?”\nThey were close enough to watch the plane’s reflection glide around on the dark patches of the city, broken by the glass into little pieces. “Hell, what is wrong with you, featherhead?” Natasha snorted from her stance by the window.\nThe man giggled. “Can you imagine little cave men milking their woolly mammoths?”\n“No,” Sam replied, a traumatised note to his voice. “And I never thought I ever would until this conversation.”\n“I think that’s enough candy for you now.” Steve scooped up the bowl, glanced at it once, and made the wisest decision – which was passing it immediately into the arms of the person sitting to his left.\n“Hey!” Bucky complained. “How did I end up with custody of the most prized possession on the goddamn plane?”\n“That baby’s all yours,” Steve grinned, and leaned over to brush his boyfriend’s lips. “Keep it safe.”\nRolling his eyes at the couple, Sam put up a sneaky hand. Another few handfuls of (almost) pure sugar disappeared. Bucky scowled protectively, shoved him away, and held the bowl closer. It nestled perfectly in the crook of his metal arm.\nNatasha had forgotten how large and bright New York could be. The wet black sky surrounding the small jet was the greatest contrast it could be to the golden metropolis sprawled out below. She touched a fingertip to the cold glass window. A quiet voice behind her said, “it will be good to be back.”\nBruce watched Natasha as she pictured Tony Stark’s indignant face when the Avengers told him they hadn’t waited for his private jet to pick them up from the airport, instead renting a small charter. The vote had been unanimous – none of the Avengers would choose waiting for a comfortable flight over getting to the Tower sooner. Natasha’s mouth twisted upward. “Yes,” she told Bruce. “It will be good to be back.”\n“You did tell Tony when we’re due to arrive, didn’t you?” Bucky asked, slightly worried.\nSteve screwed up his nose. “Yes, and he said he had a project to work on but he’d try crawling out of his lab at some point to say hello.”\n“His words or yours?” Clint laughed.\n“It’s almost 3 in the morning.” Bucky sounded surprised. “Does he sleep, like, ever?”\nThe Avengers shook their heads. “Guy runs on coffee,” Bruce explained.\n“20 minutes to landing,” said the speakers from the corner of the ceiling. “You want me to drop you at the airport?”\n“Avengers Tower, Stark Industries,” Natasha remedied. “There’ll be a small runway.”\n“Yes, ma’am,” the pilot replied. Natasha left her seat and casually swiped the bowl of candy from Bucky. “In that case, 5 minutes to landing.”\n“Look,” Sam supplied, “I can see the Tower.”\nIt glittered silver. Avengers Tower easily dwarfed the rest of the block, smooth sides soaring higher than the boxy apartments and offices surrounding. It was an elegant shape, Natasha mused, crunching on candy. As much as a building could have grace and poise.\nHell, she was tired. It was getting to the point where the constant weight of the spare dagger strapped to her leg was an ache rather than a reassurance. Where even her fingerless gloves felt like they were weighing her down.\nShe flicked her gaze to the others. Yeah, they were tired, too. Forget suitcases, those were body-bags under Bruce’s calm eyes. And the rest of the team who weren’t hyped up on sugar (read: just Rhodey) had dull expressions and slumped shoulders. The last five chaotic months had seen mission after mission, only remotely assisted by Tony, taking them far and wide and beyond by never with a chance to break.\nNatasha couldn’t wait to just collapse in her room and pass out. Not that she’d ever let anybody know that. The Black Widow retained her dignity now matter how exhausted she became, please and thank you.\nOh but hell, she was tired.\nThe plane shuddered slightly as they landed. Natasha balanced the bowl of food on her knees with, to her credit, only slightly less agility than as per usual. None of the candies spilled to the floor, so the woman stood and began moving toward the door.\n“Wow, Nat, slow down,” Clint began. She turned loose a frostily unimpressed look. “I mean,” he stammered, “we haven’t even stopped moving completely yet.”\n“Hey, I agree with Natasha,” Rhodes said. He shot the low ceiling a dark glance and rubbed the back of his neck. “Get me the hell off this plane.”\n“Language,” Bucky pointed out with a snort, nudging Steve.\nEventually the door was unlocked and the Avengers clambered down the makeshift stairs one at a time. It was relieving to escape the cramped space and suck in deep breaths of cold (and polluted) night air.\nThe pilot unloaded their luggage onto the smooth concrete. There wasn’t much of it: just a small suitcase or two between them and various duffel bags of different sizes and colours. Steve thanked her and the woman, obviously uncomfortable with the knowledge that she’d just flown seven superheroes to the private runway above Stark Industries, disappeared back inside the plane. The team picked up their luggage (a little unenthusiastically) and turned to face the glass double doors.\nTony wasn’t waiting for them.\nGranted, they weren’t exactly expecting it. Okay, let’s be fair, although they had told themselves not to expect it, almost all of them had been silently hoping to see a welcoming face.\nNatasha squashed down the brief flash of disappointment into something unidentifiable and led the way inside.\nSeveral employees greeted them, and a janitor professed that he was glad the team were back, but when they all stepped into the elevator and the silver doors slid shut, all they could feel was awkward silence.\n“So much for Tony,” Clint snorted.\nBucky rubbed his metal arm, a tad nervously. After all, this would be only his second visit to the Tower. Tony had waved a hand in the air and proclaimed the events of the “Civil War” over, but he had been remarkably reluctant to join the team on missions. And they’d only really dropped by the Tower once after for a few hours for a team meeting when the Accords had been mended, so bonding time had been overlooked.\nFor now, though, Natasha was going to take Tony at his word and assume they were welcome. She had bigger things to worry about. Like sleep.\n“Level 98, Avengers quarters,” FRIDAY chimed as the doors eased open. “Please keep your voice down.”\nThey drabbled into the room, too physically drained to think carefully about what the AI had told them. Natasha made a beeline for the room she’d stayed in before, and to her pleasure it was still plainly hers. The bed was oak and the handles of the bedside cabinets were steel. She lit one of the large lamps angled next to the bed and sighed gratefully.\nClint made a choking noise just outside the bedroom door.\nNatasha let her stuff fall on the floor and slipped back down the hallway. The team were huddled together behind the glowingly polished island bench of a large kitchen, staring open-mouthed at the living space adjoining.\nNatasha blinked. A man was asleep on the lounge.\nNo, Tony Stark was asleep on the lounge. Tony Stark, a qualified insomniac, who had once stayed up for ninety-six hours straight, was wrapped in a blanket with his feet up and his head back, honest-to-god snoring.\nClint made the choking sound again.\n“Wow,” was Bruce’s only reaction. He sounded vaguely impressed.\nBucky shook his head. “This does not match the image of Tony Stark I was given by you lot,” he reprimanded, glancing at the list of movie credits still scrolling on the TV screen. “I never-- wait. Is that a kid?”\nNatasha looked more closely. She first saw hints of a second person in the sock poking out of the blanket at a strange angle, and the pale hand with curled-up fingers resting on Tony’s chest. Then she found a head of what looked like brown curls, tucked snugly under Tony’s arm. And eventually, a second set of sleeping breaths, slow and light.\nIt looked so… intimate. Tony’s face was so gentle. Softer than Natasha had ever seen. He was wearing a T-shirt instead of a suit, and Natasha could’ve sworn the man slept in his suit. He had one hand clutching the blanket and the other with his fingers woven through the kid’s hair.\n“Holy shit,” Sam said. “That’s a kid.”\nThe Avengers stared at each other.\n“Not just that,” Rhodey added disbelievingly, and pointed. “You see the hoodie that kid’s wearing? Well, I’d know that hoodie anywhere. That’s Tones’ precious MIT jumper. Most favourite piece of clothing he owns.”\nClint finally found his voice. “But Tony never shares his jumpers.”\nNatasha nodded. “We know…”\nEventually they had been standing there long enough with their mouths open that Rhodey felt the need to do something. He ushered the team down the hallway and into the room set aside for him.\nThey gathered around the bed. \n“Stark and a kid,” Sam was repeating. “That was a kid.”\nRhodey nodded wearily. He didn’t know what to do. This was more trouble than he’d been expecting, and that was saying something, since he’d been prepared for the outbreak of Civil War number two. He’d decided on the plane over exactly what kinds of platitudes would be needed for the team, and mentally prepared a calming speech for Tony. It wouldn’t work, of course; Tony only listened to his best friend when he was being either exceptionally wise or exceptionally stupid, but it was a good plan. Because Rhodey would do almost anything to stop the team disintegrating further. That was why he’d been by the former Rogues' sides through all the recent missions. \nHe knew Tony. He knew how much he’d been hurt by what the media were calling the Avenger’s Civil War. He’d witnessed Tony’s nightmares when Pepper hadn’t been there, and talked him through panic attacks in the young hours of the morning because a sound, a sight, had reminded the man of the battle. He’d been there when Tony threw up in the toilet sixteen nights in a row.\nAnd he’d seen the blueprints of the armour that he’d worn. Complete with a shattered, jagged curve where the arc reactor should have been.\nHe didn’t know how the team was ever going to be that again. A team. A complete set.\nEven just friendly acquaintances would be good at this point.\nSo the whole prevent-another-fight thing was a good plan. A plan wholly overthrown by the fact that Tony wasn’t worked up and crisising after all. In fact it was the complete opposite. He was sound asleep.\nRhodey was fairly sure he’d never even seen the man voluntarily fall asleep. And this was voluntary. That much was obvious. The way the child was nestled so safely into Tony was absolute proof. And the older man’s fingers… Tony must have fallen asleep carding gently through the kid’s curls.\nTo say nothing of the jumper. That was nothing short of a miracle.\nIt was the purest thing Rhodey had ever witnessed. And coming from Tones, also the most unexpected.\n“So who’s the kid?” Steve asked.\nIt took Rhodey quite a minute to realise everybody in the room was staring at him. \n“Why would I know?” he spluttered.\nThey glared at him like it was a given he could read minds. \n“I mean, you’re Tony’s best friend,” Steve pointed out. “Out of everyone here you’re definitely the… closest to him.” \nA slight awkwardness settled over Rhodey’s room, because of course they all once were close to Tony. It was washed mostly away by the following, “Why wouldn’t you know who the kid is?”\n“But I--“ Rhodey looked at Clint, who rolled his eyes. \n“I’m not going to be any help. We were all fucking criminals five months ago, remember?”\nRhodey could trace the shock residually plastered through every crease and curve of the other man’s face. Natasha still had a particularly pensive expression, sure, but Clint was floored. He looked like he had a concussion.\nMaybe he did. Maybe that was a side effect of finding Tony Stark asleep on the couch next to a kid.\n“We haven’t exactly been around,” Bruce admitted.\nThey all looked expectantly to Rhodey again.\nRhodey was confused.\n“He’s just as surprised as the rest of us,” Natasha said.\nSam, who had quickly formed an opinion of his own, was caught off guard. “Stark didn’t even tell you? Damn. That must hurt.”\nClint caught on. “Turns out he didn’t really ever trust any of us...”\n“Tell me what? Trust us with what?” Rhodey repeated.\n“Isn’t it obvious?” Sam asked. “That was a kid.”\nThey all nodded and thought for a moment.\n“That was his kid.”\nAnd that single sentence summed it all up. Tony Stark had a son.\n“Fuck…?” Bucky said wonderingly. “How old would he be?”\n“He must be… oh, in middle school at least,” Natasha said. “Probably older. I mean, think about Stark's past.”\n“Genius, billionaire, playboy, philanthropist,” Bruce mused.\n“And nobody knew? Tony kept him secret this whole time?!”\n“Must be,” said Bruce.\nThey were all beginning to freak out now.\n“So for more than a decade, Stark had a child hiding out in the Tower?” Clint screeched. “And we never even noticed?”\nHe collapsed onto Rhodey’s bed, complaining, “I thought I was the only one with a secret family.”\n“Oh god.” All eyes turned to Steve, who suddenly looked sick. “I broke his suit – when we fought in Siberia – I smashed the arc reactor and almost killed him and just left and, and…” The words spilled out at unnatural angles. His voice, already roughened, dropped lower. “And all that time he must have had a child waiting for him to come home.”\n“No wonder he packed us off on missions halfway round the world as soon as he could,” Sam groaned. “He didn’t want us around his kid.”\n“Good reason, too,” Steve said piously, and for the first time since Rhodey had worked with him after the Accords he looked sorry. Like all the frustration and remorse he’d had boxed up inside him was finally slipping through.\nMaybe reconciliation would be easier than Rhodey had thought. And all it had taken was a sleeping kid.\nA mystery sleeping kid.\n“Well,” said Natasha, “I’m going to find who this kid is that Stark has conjured.”\nRhodey agreed. Whoever the hell could get Tony to sleep would be worth knowing. \nHe still doubted the child was actually Tony’s, but he had a sneaky suspicion that was only because he was in denial that his oldest friend had kept such a huge secret from him for so long… \nThere was no faking what Rhodey had seen in the living room.\nTony Stark was a father.\nTony woke to sunlight and a familiar set of sleeping breaths.\nHe sighed contentedly. There was warm sun on his face and his eyes were closed. They didn’t even have to open any time soonish. He’d cleared his schedule months before for the Avenger’s homecoming date; but all he was planning to do was lab time with Peter. They had a whole weekend to themselves, since May was busy. He’d been wanting to show the boy the new nanite tech he’d been working on. It would make fantastic armour. Maybe they could revamp the Spider-suit with it – give it a new name, even – what about the Iron Spider?\nHa, Rhodey would laugh at him about that. \nBut wait. Rhodey wasn’t here, he was off on missions with the Avengers while Tony hid away in his tower like the fucking coward he was; unable to face his parents’ brain-washed murderer and a man he’d once considered a teammate… they were coming home, though, and Tony regretted saying they could but he already had and that was all in the past now.\nHow did meeting them go? His brain supplied encouragingly. Surely it can’t have been as bad as you were worrying?\nWait. That was a good question. Tony wracked through his jumbled thoughts, but for the life of him he couldn’t remember meeting the Avengers last night.\nWhat he did remember (with a sinking feeling) was Peter’s backpack spontaneously combusting and smashing the penthouse TV. Turns out the boy had somehow contaminated his school books with a variety of chemicals from the lab and also a poison-tipped knife some mugger had almost stabbed him with. The kid had an alarming penchant for getting into scrapes. \nHe was going to turn Tony’s hair grey one day. It was lucky neither of them were in the room at the time. \nTony had, of course, said everything was fine (except for how the hell did this kid get his backpack to explode). He could always buy another TV but in the meantime, they could go downstairs to the Avengers floor, where there was another TV.\nSo they did, and Peter fell asleep halfway through the movie and then Tony supposed he did too, which meant—\nFuck.\nHe hadn’t met the Avengers last night.\nDouble fuck.\nIt felt a bit like two parallel lines had crossed – one world where Tony had the Avengers and one where Tony had Peter. How the hell had two schedules collided so abysmally? \nHe’d been thinking about this weekend in two separate contexts for months.\nGod, he was an idiot. He’d fallen asleep in the Avenger’s fucking living room.\nSo had Peter.\nTony was trying to protect Peter. Not push him into the spotlight to be judged. Oh, he’d royally screwed up.\nHe opened his eyes.\nYep. The Avenger’s living room.\nTony looked down at Peter, who’d somehow wriggled into the crook of his arm. The kid’s breaths were deep and even. Tony really didn’t want to wake him up, but he couldn’t just leave him here for the Avengers to find and obsess over.\nGod, that would be a disaster.\n“Peter,” he murmured, running a thumb along his arm. “Pete, buddy, wake up.”\n“Mmph,” the kid said sleepily. \nTony hid a smile. “Peter, you gotta get up.”\n“Why?”\nOh crap. Hadn’t thought this through very well, had he? “Well. Uh. You want some breakfast?”\n“’Sit morning yet?”\n“Yeah, buddy, it’s morning. Or maybe noon, eyeing that sunshine. How ‘bout you go back upstairs and have a shower while I get some food going?”\n“Mm sleepy,” Peter grumbled adorably.\n“Yeah, I know.” Please just go upstairs before they find you. Please, I don’t know what I’d do; don’t know what they’d do, I don’t trust them anymore— “C’mon, buddy.” He sat up and rubbed his neck. “You gave me a stiff neck.”\n“Stop falling asleep on the couch, then,” Peter replied, yawning.\n“Well, I’d try, but there’s this annoying Spider-kid that seems to like falling asleep on me. Terrible, y’know? But what can I do?”\n“Mr Stark,” Peter protested.\n“Go have a shower,” Tony replied. “Lab day, remember?”\nThe kid perked up a lot and raced towards the elevator. As the doors closed Tony let go of a breath he hadn’t realised he’d been holding. Now, to get out of here himself without being seen…\nThat plan didn’t last long. Tony turned around, still wearing a hoodie, trackpants, and socks, with the couch blanket wrapped around his shoulders and looking (if he did say so himself) almost disgustingly domestic; opened the door, and was met with a waiting circle of not-very-happy Avengers.\nBoom. Ambushed. \nTony’s heart sank right down into his feet.\n“Good morning,” Clint snarked. “Wasn’t expecting you to wake up anytime soon. Looked like you needed the sleep.”\nShit. They’d seen him. Had they seen Peter?\n“Ah,” he tried, “my tower, my rules.”\n“You said you were going to come and say hello, Stark.”\n“I said maybe I would. I was- uh, working in the lab?”\n“Doesn’t explain why we found you out cold in our living room.”\n“Let’s cut to the chase,” Natasha decided. A hush settled. “Who’s the kid?”\n\nThey saw him.\n\n\nOh fuck.\n\n“Well. Uh.” \nIt wasn’t often Tony was lost for words. But this was one of those times.\nHow was he supposed to describe Peter? And how was he supposed to explain what Peter meant to him, to the Avengers, who were all convinced (with the possible exception of Rhodey) he was an asshole?\nPeter was… Spider-Man, obviously, though he couldn’t tell them that. A random kid he’d tracked to Queens. A genius, to make those webs that had the tensile strength to pretty much hold two halves of a ferry together and were so sticky Tony had spent five memorable hours holding onto a screwdriver from scratch using only whatever chemicals his science teacher wouldn’t miss. The kid was possibly smarter than Tony. \nHe was a mentee. A protegee. Somebody Tony could pass his experience to. But more than that.\nHe was—oh crap.\nPeter felt like Tony’s kid.\nNot a kid.\nHis kid.\nBut he wasn’t, and Tony didn’t have the right to parent him. To be a dad.\nNo, they were mentor/mentee. Nothing more.\n“He’s my intern,” Tony said weakly.\nThey glared at him.\n“Really?” asked Rhodey, who looked slightly confused.\n“No, he’s not,” Natasha snapped. “I know what a lie sounds like.”\n“Tell the truth, Stark,” Sam admonished.\n“He’s—” Tony struggled. “Stop questioning me!”\nIf only he’d gotten an extra few hours of sleep. Maybe then he’d have the brain capacity to leave this situation.\n“Ah. Guys?” Bruce asked. They turned and looked at him. “Give Tony some space. We’re in his home, after all.”\n“He’s yours, isn’t he?” Rhodey asked quietly. “Your son.”\nTony opened and closed his mouth. Like a fish. “No?” \nA pause. Nobody looked like they believed him. “No! NO! No, he’s not mine. He’s an intern. Just an intern.”\nClint blinked. “Exactly how dumb do you think we are?”\nNow wasn’t a good time to antagonise people. “Very?” Dammit, you smartass mouth.\n“Tony?”\nThe man turned, socks sliding over the floor. And came face-to-face with Steve.\nCaptain fucking America.\nGreat.\n“I just wanted to say sorry,” the bigger man said humbly.\nTony scoffed.\n“I’m really, truly sorry. Nothing can make what I did alright. Nothing ever will. But for the little it’s worth, I’m sorry for lying to you. And fighting you.”\nBucky looked at Tony—shyly?\n“I’m—I’m sorry too,” the other man whispered.\nTony left without another word, fuming.\n \nUpstairs, he checked with FRIDAY first to ensure none of the Avengers had tried to follow him (into his very private penthouse, fuck them); which luckily none of them had. Then he asked FRIDAY to ban them from the penthouse floor.\nShe did.\nThen he turned on the stovetop, and got out a frying pan, and went into something Peter knowingly called his “stress cooking phase”, where his body was on autopilot. Peter said some of the most interesting meals he’d ever tasted were from when Tony stress-cooked. And that was saying something, because he’d seen the kid gulp down a very questionable-looking biscuit a fan had baked him once. Not to mention his Aunt’s cooking (if that can be labelled as such).\nNo, Tony’s stress-cooking was delicious. Delicious but a little strange.\nPeter came out of the shower just as Tony felt like he’d woken up. The kid was wearing a new pair of pants and undoubtedly another dorky science T-shirt, but Tony couldn’t see that because his own MIT jumper was in the way.\n“You ever going to take that thing off, kid?” he asked, amused.\nPeter slid onto a stool at the breakfast bench and accepted the plate Tony handed him. “Nope.”\nClint woke up on Monday morning with jet lag. Which he smothered in two croissants, one glass of orange juice, and a cookie.\nThe kitchen was empty, and so was the living room. No sleeping-Tony-plus-kid combo to be seen. (Did it feel weird, now that they were gone? Surely not. Surely a snoring Tony wasn’t something Clint felt should naturally be on the couch.)\nHe thought about that as he scanned the fridge, picking up a plum thoughtfully. Tony had never seemed like the fatherly type. Always very gruff, and rude, and smug.\nWhat had he called himself?\nGenius, billionaire, playboy, philanthropist.\nNo. It should have been genius, billionaire, playboy, philanthropist; dad.\nGod, that was a mouthful.\nClint really wanted to meet this kid. He wanted to be the cheeky uncle that took the nephew on adventures that his dad wouldn’t approve of (now that Clint came to think of it, Tony would make a great helicopter parent). He wanted to introduce this kid to his own family and set up a day for them to all play together. \nThey hadn’t seen Tony since yesterday morning; when he’d stormed away from Steve and Bucky’s apologies – Clint couldn’t exactly blame him – and gone upstairs. Of course, Natasha had tried later that day to get into the penthouse, but FRIDAY had quietly informed her that the Avengers were not welcome on the upper floors, and the AI sounded so very pleased about it that Natasha hadn’t even decided to sneak past. Even FRIDAY knew that they were horrible friends.\nEx-friends, now.\nAnyway, Tony had apparently spent all afternoon in the lab (where was the kid, then? Probably in there with him if he’d inherited Tony’s brains). Rhodey had gone to find Pepper partway through the afternoon, looking confused and slightly hurt, and the strange thing was Clint hadn’t seen him since either.\nMaybe this was the start of a horror movie. Find a billionaire asleep on the couch and suddenly your team gets picked off one by one.\nClint shook his head. Maybe it was time to go around and see if anything had changed since he’d lived here before.\nBeside, he could really do with some spying right now. He had so many questions.\nStill in his pyjamas, Clint stalked out of the kitchen and down the hallway. He passed his room and Natasha’s room and Steve’s room that Bucky had not-so-surreptitiously moved in to. Then he got in the elevator and went down to floor 34, which was his favourite entrance to Tony’s vent system.\nLuckily it was still there. \nClint stepped out of the elevator and shuffled through a very busy office filled with very busy people doing … stuff? All he could see was rows upon rows of desks and computers and occasionally large tables and whiteboards and holographic screens. And a few pot plants.\nClint realised most of the people were staring at him, and he smirked and waved a little awkwardly. These people had no business being so wide awake at nine o’clock in the morning. How dare they stare at him. Just because he was a recently un-banished Rogue Avenger (Hawkeye, the best one, obviously) walking through their office looking for a vent so he could crawl inside the wall in his pyjamas didn’t mean they could be all judgemental. \nHe ignored them (mostly; he couldn’t resist making a peace sign at one group of gawkers) and reached the vent, which was exactly the same as he remembered. Well, somebody had screwed it shut, but that was okay, because he came prepared.\nHe reached inside his pyjama shirt pocket and pulled out a small screwdriver he’d noticed on the coffee table upstairs. It was probably dropped by Tony. Somehow. Who carries screwdrivers around with them anyway?\nGenius mechanics, apparently. \nOr possibly genius mechanic kids.\nFortunately the screwdriver mostly fit the screws, and within a few minutes Clint had the vent open and ready to go. \n“Excuse me,” one of the employees said bossily.\nClint stuck one leg awkwardly inside the wall before it dawned on him he was who she was talking to. “Uh, yeah?” he asked.\n“You’re not really supposed to go around unscrewing vent grilles,” she told him. \n“Really?”\nShe frowned. \n“I used to do this all the time,” he informed her. “Were you working here a year or two ago?”\n“No. But I think that’s quite beside the point—”\n“It’ll be fine.” He jumped into the dim space and crawled away as quickly as his knees would manage. Outside, the woman frowned again, and pocketed the tiny screwdriver and screws. She left the vent cover where he’d put it down.\nClint went up, then down, and then took two lefts. Every so often he’d pass another grille, mostly in the walls of offices and quite low to the ground (“Sign here, please, if that’s quite satisfactory”; “Just two milligrams, you don’t want to explode, do you?”) but Clint barely looked sideways because it was like muscle memory. He knew where he was going, and he knew how to get there.\nEventually he reached a long conference room where Pepper was quite successfully roasting a trio of old, wrinkly men. She spread a few papers out on the table and gestured to five highlighted spots, smiling as she did so.\nClint listened for a moment, fiddling with his hearing aids, but the only useful thing he heard was, “Yes, Tony will be here, but he’s not due to arrive for another half hour. Now,” and Pepper’s voice trailed off into talking about marketing and budgets and other things Clint couldn’t be bothered to listen to.\nHe decided to go up a floor and found a small room where Tony was shifting through a stack of papers. \nClint settled down comfortably on his belly (his pyjamas were going to need a serious wash after this) and peered through the vent, which this time was in a corner of the ceiling.\nTony was predictably grumbling. “Can’t these just be uploaded or shit,” he grouched, “I swear the pile’s getting larger.”\nClint pulled another cookie out from where he’d stuffed it ‘for later’ in the pyjama pocket. \nTony’s phone rang. \nHe scrunched up his eyebrows and picked up the call. “Kid, why are you calling me in the middle of the day? There’s this little thing called school.”\nClint fished his phone out and positioned it on the grille of the vent, pressing record stealthily. Then took a bite of his cookie.\n“Yes, I am very aware that recess exists, but you can’t pull that one on me, okay? The bell doesn’t ring for another—” he checked his watch. “Sixteen minutes.”\nTony sighed. “Are you skipping class again? C’mon kid, you’ve got to stop doing this.”\nThe man huffed and swept all the papers off the desk in one fluid motion. “I get it that you know the syllabus and whatnot already, I believe you, kiddo. You’ve been ahead in physics since pretty much forever. I know that. But you can’t keep skipping.” He rubbed his head slightly and transferred the phone to the other ear. \n“No, absolutely not. Karen’ll tell me if you try anything.”\nTony stood up. “Just go back to class. Have a boring day, and then sit with Ted and scary Michelle at lunch, and then get picked up by Happy and we’ll do something in the lab tonight to make up for it. Sound good? I’ll ring May, she’ll be fine with it.”\n“Yeah. Yeah. Why do you think I went to MIT early?”\n“No, okay, yes, I know.”\n“You’ll be fine, kid, surely it can’t be that bad? Did you bring lunch? I know how hungry you get.”\n“I told Happy! And Pepper!”\n“Nope, that’s not enough. Still got those granola bars in your locker?”\n“Well use them, buddy, this is an emergency.”\n“Yeah, not that kind of emergency, but eating is still important. We can refill your stock whenever. Literally. So just eat them.”\n“That’s what they’re there for!”\nClint finished his cookie. This phone call was a goldmine. He was enjoying every second.\n“Yeah,” Tony said. “Bye.”\nHe put the phone down.\nClint leant forward to end the recording, but now that Tony was finished talking the quiet ‘beep!’ the phone made was highly audible.\n“Oops,” he whispered, and quickly sent the video off to the Rogue Avengers’ group chat, with the caption, ‘Proof Stark has a son’.\n“Clint,” the man growled from below. “I know you’re up there. Get down here.”\nA reply shot up from Natasha. Huh. I’m surprised you got that without being caught.\nI wouldn’t speak so soon, he sent. And crashed through the vent into the office below.\n“Barton,” Tony grumbled. “Do you know what the word privacy means?”\n“Er, not really,” Clint admitted, struggling up from his position on the floor surrounded by dust, a vent grille, and a few dodgy screws, and two chairs knocked onto their sides. He figured he must look a mess with dirt all over his pyjamas, so he wiped his hands over them to fix it but left a few dark handprints and a smudge of something on the pants. He shrugged.\nThe group chat dinged. He glanced at his phone screen.\nBruce: Not the vents again, Clint.\nSteve: He’s so paternal.\n“I invite you into my home, and you spy on me?” Tony asked.\n“Sorry.”\n“Sorry doesn’t cut it, Barton.”\nThe group chat was fizzing with replies. \nSam: Sounds like the kid’s got some interesting friends. Who names their child Ted?\nBruce: Playschool fans? \nBruce: Or, bears, I guess? Seems like a bear name.\nSam: Ha! But we all know Tony’s going to be the mama bear here.\nBruce: I’m more concerned about “scary Michelle”.\nNatasha: Sounds like a mini-Pepper.\nBucky: Who do you think are Karen and May?\nSteve: Who is the kid’s mother?\nBruce: Rhodey would probably know.\nSteve: Colonel Rhodes?\nNatasha: Rhodey?\nSam: Rhodey, where are you?\nClint went back to the video. “Evidence,” he pointed out. “Tony, you’ve got a kid.”\n“This sort of thing should be illegal,” Tony replied, but he wasn’t denying it like yesterday. He rubbed his face tiredly.\n“What’s his name?” Clint prompted.\n“Not saying,” Tony answered. \n“Age?”\nSilence.\n“What about his mother? One of your one-night stands? Can’t be Pepper’s, surely?”\nClint must have crossed the line, because Tony started yelling. “None of your fucking business, Barton! I told you already he wasn’t mine!”\n“But—” Clint gestured to the video, where a tinny copy of Tony’s voice was saying, “Are you skipping class again? C’mon, kid, you’ve got to stop doing this.”\n“Yeah, yeah, I know how it looks,” real-life-Tony said wearily. “He’s—” he looked uncomfortable. “He’s my, uh, intern.”\n“That’s what you said last night,” Clint replied. “Do you watch movies on a Saturday night with all your other interns?”\n“No, he’s like, my personal, uh, intern.”\n“Tony, usually you’re such a good liar. You’re slipping up, man. You don’t have personal interns.”\n“I’m telling the truth.”\nClint didn’t believe a word. “Yeah, okay.” He thought for a second. “Hey, when I meet your son, can I introduce him to my family? Cooper and Lila will love him, I bet.”\nTony’s face made Clint nervous that he might be about to die, but then the man just sighed and sat down. “Maybe one day. He’d like that.”\nClint sent one more text to the group chat; Tony’s sticking to the intern story, and then changed the name from We’re criminals now I guess to Let’s meet Tony’s son.\nNatasha wrote back: I wonder if Spider-Man has anything to do with this. \nTony said, “you want some lunch, Barton?” and thankfully oblivious to the Rogue’s suspicions, ordered them both shawarma.\nSam was just about to bite into his fourth slice of pizza when the alarm blared.\n“Avengers!” Steve shouted magnificently, then looked at the room, which was pointedly ignoring him, and trailed off uncertainly. “…Assemble?”\nTony got to his feet (really, Sam was shocked he’d even decided to sit down and eat takeout with his ex-teammates, one parent-killing-former-assassin, and a friend who’d almost killed him; but it was his funeral after all) and strode out of the room.\nThey all scrambled into their gear and shuffled after him guiltily, Steve bringing up the rear with a miserable expression.\n“But my pizza?” Sam asked.\nNobody answered. \nSam found it hard to face Tony Stark these days. Sure, he was the Falcon, and a tough Bucky-teasing superhero, but he could admit he had a soft spot deep inside his core that was growing – after Civil War, increasingly – concerned about the feelings of others.\nStark was mad. Sad. Probably frustrated. And possibly lonely? Very definitely emotionally injured, and not yet healed, judging by the defensiveness of his manner nowadays. \nAnd Steve (who Clint had apparently heard talking to Bucky yesterday from inside the vents; don’t ask Sam why Clint thought telling him was a good idea – us bird-themed heroes better stick together, man – Clint was mad, crawling around in the ceiling eavesdropping like that) was all the above minus some of the emotional battering, and plus a giant chunk of guilt, which Sam would personally recommend seeing a therapist about. \nHmm. Maybe one day he should kidnap them all and send them to a giant therapy session. Sam stifled a smirk as he imagined how well that would turn out.\nBut anyway, they were done sitting in a swamp of almost visible tension eating pizza and ignoring said tension because apparently there was a mission downtown. Another wormhole and some Doombots. Just another Tuesday.\nThe first Sam saw of the battle ground was a big purple smear across the sky, like somebody had tried to paint some fancy art but then wiped it by accident while it was still wet. It was just hovering, or floating, suspended by nothing, folded in on itself like an optical illusion in a way that made Sam’s brain hurt just by looking at it. Strings of Doombots were pouring out of it, and when Sam swooped in too close, he started to vibrate like a fucking harp. Which hurt.\n“What is that purple thing?” Stark directed at nobody in particular (he wasn’t to know it then, but he’d find out eventually that purple was really not his colour). \nThey all tried to look at it without actually looking at it. Sam’s head throbbed. \n“Portal?” Rhodey replied when none of the others dared to say a word. They all were a little scared, Sam thought, subconsciously seeking acceptance from Tony and terribly insecure because they didn’t want to mess up again.\nSam flared his wings and dropped lower. \n“Somebody’s gonna need ta shut it down,” Bucky said over the comms. “Stevie, get ya fucking ass over here and help.”\nIt looked like some of the Doombots had already been disposed of. They were missing metal limbs or had bent plates or were sparking with electricity, but most were stuck to the ground, or the walls, and covered in white stringy stuff.\nSam flew through something sticky and flailed around in the air for a second before righting himself. “What was that?” he spluttered. He recognised the feeling, but; “a spiderweb? What the fuck?”\n“Did you say spiderweb?” Stark barked. “Ah, jeez, please tell me—”\n“Whoa!” a new voice squeaked over their private comms. (How the fuck had somebody hacked Stark’s fancy tech? Wasn’t it supposed to be unhackable?) “It’s the Avengers! Oh my god, it’s the Avengers!”\nStark groaned. “Hey, spider-kid.”\n“It’s Spider-Man, how many times do I have to tell you?”\n“Sure, spider-baby.”\n“Spider-Man.”\n“Spiderling,” Stark countered, with just a hint of a smile in his voice. This sounded like a common argument. There was no other response, but Sam could tell everybody had their confused faces on.\nSilently and without warning, the portal collapsed in on itself with a horrible jarring flash. The endless arrival of Doombots stuttered to a stop. “Okay,” Steve said through comms, “we’ve got the purple thing closed. Now we just have to defeat all the robots before they hurt anybody.”\n“I know what you’re thinking,” the new voice said confidentially, presumably to Stark (and amusingly ignoring Steve, who was trying to battle-plan in the background), “and I promise I didn’t go looking for—” \n“Kid. You are a magnet for trouble. Seriously. You don’t even need to go looking for it. Your- you know who is going to kill me. You are an absolute dumpster fire of a person. Human disaster. Accident-attraction supreme. You’re giving me grey hairs,” Stark hissed, his tone laced with annoyance and a bit of affection, too, if Sam was reading it right. \n“But—”\n“Only you, kiddo. Only you could turn a patrol into this. This is Avengers stuff, y’know? Not quite at your level. This is a big step up from rescuing cats in trees,” Stark pointed out. “Why were you trying to take this on alone!?”\n“Oh, come on, I was going really well! No hits! And I don’t just save cats from trees. I also save people!”\n“From trees?” Stark smirked.\n“You know what I mean!”\n“You help old ladies cross the street.”\nNatasha interjected before Stark could be webbed down by a frustrated enhanced teenager. “So, you’re Spider-man.”\nThe voice squeaked again and rose an octave. “Yes, and you’re MissNatashaRomanovBlackWidow. Ma’am.”\n“Come again?” Clint laughed. \n“Hellopleasedon’tkillme,” the newcomer said breathlessly. “Oh my god I’m meeting the Avengers! My guy in the chair is going to freak!”\n“Hmm,” Natasha said. “Good to meet you too.”\nSam circled around and kicked a Doombot in the chest. It tumbled backwards and Sam heard a thwip-thwip sound before the bot was plastered to the ground in synthetic webbing.\nHe caught a glimpse of Spider-man then. The red-and-blue costumed vigilante was crouched halfway up the side of the wall, eyes comically widened, arms out webbing down bots without getting too close.\n“Spidey, go away,” Iron Man growled.\n“But I’m helping!” \nThe vigilante sounded like a petulant toddler. How old was this guy? At the airport, Sam had assumed he was in his thirties, and then five minutes ago he’d revised that to early twenties, but now the dude was sounding like he was eleven?\n“We’ve got this covered,” Tony urged. “You can go.” He blasted a Doombot in the classic Iron Man pose, then made the I’m-watching-you fingers at Spider-Man, who flipped him the bird.\n“Hey, Spidey,” Rhodey called, “Nice to finally meet you.” His voice had an undercurrent of amusement and irony that suggested he knew something they all didn’t. It had to be from Pepper. What had she told him? Where had he spent all those hours on Sunday?\n“Well,” Spider-Man huffed dramatically. “I would say the same, Un- I mean, uh, Mister Rhodey, but unfortunately Iron Man has grounded me, and meanwhile I’ve been robbed of my trust in him because y’all in New York? Why didn’t anybody tell me?”\nOh god, Sam could feel him pouting without even looking. And he was wearing a mask.\n“Spidey,” Stark warned. “Go home and do your homework or something.”\n“Yes Mister Iron Man Sir,” the vigilante snarked sarcastically, and webbed down a final bot before fleeing the scene. “Bye, Avengers! Be nice to Iron Man!”\nAnd goddammit, if Tony Stark didn’t stand there on a rooftop watching the vigilante web away, waved back to him as he swung around a corner, and shook his head. “He’s going to give me a heart attack one day, I swear.”\nAnd Rhodey chuckled.\nSam opened up a private comm with Clint, who was almost hyperventilating at Stark’s behaviour. “Spider-baby? Kiddo? Your you-know-who? Uncle Rhodey? Go home and do your homework?”\n“Fuck it all,” Sam agreed.\nThey wrapped the rest of the Doombots up quickly. It was awkward to be standing together post-battle again, all slightly exhausted and sweaty and having just fought side-by-side like the good old days. Stark quickly excused himself to go find, quote unquote, “whatever fucked-up tech conjured that magic portal shit,” and Rhodey followed him, still smirking to himself. They saw him nudge Tony fondly as they walked away and muttered something in his ear.\nSam landed and they all exchanged glances. They knew they were thinking the same thing.\n“Well,” Clint began proudly. \nSteve shrugged and slung his shield over his shoulder, just like he always did. “I guess we found Stark’s kid.”\nBruce was three-quarters of the way through rewriting a particularly intense nuclear physics equation on a holographic screen in his private lab in Stark Tower (courtesy of one Tony Stark) when the door whooshed familiarly.\n“Come in?” he murmured absently, checking back to see if he carried the one from the last sub-equation. He had. \nThe door to the lab slid mechanically open, to reveal a genius-billionaire-playboy-pilanthropist-possibly-dad according to the team’s conspiracy theories; and a slender, surprised-faced teen with brown curls standing awkwardly half-behind him.\n“Ah!” Tony Stark said, derailing Bruce’s train of thought, which promptly was engulfed in flames and then exploded for good measure. Bruce couldn’t even remember what he was thinking about.\nWhy was there a child in his lab?\n“You distracted me,” he frowned mildly. “Tony, who is this?”\n“Well,” said Tony, a tad sheepishly, “I thought- you didn’t come to the last team mission yesterday, Brucie, and I thought I might as well bring my very favourite intern up to say hello to his idol.” He tugged his collar. “Seriously, he’s been yapping my jaw off about you. You’re on his school’s hero wall, or something of the sort. Nah, but I still reckon I’m his favourite Avenger. Anyway, that’s not important. Well, it is, but I’m sure it can take a backseat for the minute, we can sort out blatant and completely unjust favouritism later. Anyway.” Tony took a breath and spread his arms. “Brucie. Meet Peter Parker.”\nBruce looked at Peter Parker, whose eyes were so wide and speechless that he might as well be a bit comatose.\nPeter Parker looked back at Bruce.\nThen the floodgates broke.\n“Ohmygodyou’reDoctorRobertBruceBanner,” the teenager gasped, “thegreatestscientistofourgeneration.”\nWhile Bruce was struggling to decipher what the boy had said, Tony Stark rolled his eyes. “What about me?” he complained good-naturedly.\n“Yes, Mister Stark,” Peter assured the man with a sly grin, “you’re oh-so-important. But oh my god, you’re Doctor Robert Bruce Banner, sir, I’ve read your papers on nuclear physics, is that your famous equation on the board, sir, I’m a major fan of your work, it’s groundbreaking, unbelievable, you’ve got seven PHDs, sir, SEVEN, oh my god, did you know—”\nBruce was blown away. This sparkly-eyed kid was looking at him as if he was the greatest human being that ever lived, all dreamlike and excited. Stark put a hand on the kid’s back, and murmured, “don’t forget to breathe, please.”\nHe wasn’t worthy of all that praise, right? \nThough he was naturally taken aback with the sheer adoration the teen was exuding, Tony Stark twinkled at him knowingly. Bruce decided to claim the kid’s hero worship, albeit shyly. He offered Peter a happy smile.\nThis was something entirely new. People only ever looked at the Hulk like that; and only after particularly impressive displays of brawn, smashing lots of enemies, bringing victories to the team. This boy thought Bruce Banner was all that. Not Hulk, but Bruce.\nA great deal of warmth softened his heart.\n“Yes,” he replied, “I did know that, actually.”\nPeter blushed. “Sorry, sir, I mean, obviously, you’d know how many PHDs you’d have, you were the one to study for all of them, I was just so excited, too excited probably… Mister Stark had to remind me to breathe five times in the elevator, it was crazy, I was almost hyperventilating, but oh my god you’re Bruce Banner!”\nBack to square one, Bruce supposed. “Hi Peter,” he tried. “It’s nice to meet one of Tony’s interns. Would you like to call me Bruce?”\nPeter’s eyes widened even more (surely, that was impossible. Apparently not) and nodded carefully, like he thought that moving his head too rapidly would cause it to fall off.\n“Yes, if you’re really okay with that, Dr Ro- Bruce, sir.”\n“No need for the ‘sir’, Peter.”\nThe teen nodded enthusiastically. \n“So…?” Tony said. “I guess I’ll just leave you to whatever nerd stuff you were doing? Have fun, Brucie, Peter’s a clever kid.”\nHe turned back to the elevator.\n“Thanks, Mister Stark!” Peter bellowed after him.\nBruce caught a smirk as the door closed. “So, Peter,” he asked. “What work do you do with Tony?”\nThe boy turned bright red. “Uhm, w-we, I, um, I usually just, uh, tinker? Like, Mister Stark sometimes goes all,” he put on a very bad impression of Tony, \"“Pete, kiddo, look at this” and then at others times, he’s like, “pass me the screwdriver- no, sorry, I need a soldering iron” and then I’m like, “but Mister Stark how do you mistake a soldering iron for a screwdriver” and he’s all gruff and “shut up Pete we can’t all be as geniuses” but then, I say, “you literally ARE a genius, Mister Stark” and then he gets grumpy ‘cause I’m full of teenage sass, apparently, and anyway I don’t know that much about the Iron Man suits anyway ‘cause every time we really get into pulling them apart either DUM-E blows something up, which is kinda proving what I was saying to Mister Stark before, about how DUM-E’s got even worse luck than me – he doesn’t believe me, but I reckon it’s definitely true – or Pepper always comes ‘cause she gets worried when we’re in the lab for like twelve plus hours at a time and then usually we get sidetracked watching a movie or—”\nBruce blinked at the verbal vomit that had exploded from the boy, but after listening to it for a moment a smile crept back onto his face. \nAlso, this kid? Was way too close to Tony to be just an intern. And handing him things? Something Tony didn’t let anybody do. Not even Bruce.\nI mean, Bruce theorised, spending more than twelve hours in Tony’s personal lab at a time? Could only happen if the kid’s parents were either out of the picture or completely involved, and probably even then only if the kid was living part-time in the Tower.\nAlso, watching a movie? Not an intern activity. \nCalling the indomitable Pepper Potts by her first name? Also not something a mere intern could do without dismemberment. Just not possible.\nAnd the hair. Brown curls. The one defining feature that the team had catalogued on that fateful morning they’d stumbled into the tower, jet-lagged and shocked with the greeting of a sleeping Tony Stark.\nOkay, but apparently the rest of the Avengers were convinced that Spider-Man was Stark’s kid.\nBruce wasn’t quite sure how that would work. He’d never met the Queens’ vigilante, but then, that was proof against that theory, wasn’t it? And a vigilante operating solely in Queens couldn’t live in the Tower with Tony and Pepper, and would they let their child swing around the streets stopping muggings and catching cars in spandex?\nHmm. Nope.\nBruce shook his head, and three hours later, after Peter left, flushed and happy after an afternoon with his idol (honestly, Bruce couldn’t remember the last time he too had felt more appreciated and able to just talk about his work with people actually following along); he opened the group chat.\nMy bet’s on Tony’s intern, he typed.\nBut Spidey! Clint replied quickly.\nSteve: What makes you think that?\nBucky: It’s definitely spidey\nSam: that spider brat for sure\nBucky: you’re still salty you flew right through his webs\nSam: it was creepy! Spiders freak me out\nRhodey: true, spiders are weird\nSam: too many legs\nSteve: Anyway, let’s get back on topic.\nClint: the intern thing was a cover, remember, Bruce? Stark was clearly lying\nBruce typed one more message, but I met the intern today. Can’t entirely be a cover cause the intern’s real. Tony actually has a personal intern; and pondered on the mystery.\nHe noticed Natasha hadn’t replied to any of the messages.\nPepper was glaring at her husband.\nShe found herself doing this a lot during board meetings. It was frustrating, keeping tabs on the presentations and discussions and potential decisions while simultaneously sending telepathic messages that screamed Tony, get off your phone.\nBut, she supposed, that was yet another one of life’s constants that wouldn’t ever change. And could she smash one of life’s constants?\nIt was an uphill struggle, but she liked to think she made progress. At least Tony mostly turned up to the meetings nowadays.\nHe looked every bit the overgrown high schooler – albeit a genius, billionaire one – sitting in the metaphorical back row, staring at his crotch that was illuminated faintly blue by the latest StarkPhone. He was probably texting the kid.\nPepper watched him as he smiled, and she decided to let her own fond smile show too. Peter was a good influence on Tony (except perhaps with his attendance in board meetings). On Sunday, she’d found Rhodey, and brought him to meet the kid, and the other man had agreed that Tony was a total dad – even if the teen wasn’t biologically his own.\nRhodey had kept her updated with screenshots of the Avengers’ group chat, that she had yet to show her husband. The confusion and wild theorising the former rogues got up to made her laugh, but she knew Tony would probably just scoff. He was still feeling tension towards Rogers and Barnes, and no wonder: they’d seriously hurt him in Siberia.\nThey were getting vaguely close: yes, Queens’ beloved neighbourhood vigilante was for all intents and purposes Iron Man’s son, but what they were failing to realise was that Peter Parker, Tony’s teenage intern, was the man behind the mask.\nHer own phone pinged and she smiled a wordless excuse me, please as she picked it up. Rhodey wanted to know whether the Rogue Avengers could sit in on the meeting. Apparently they were bored (a common affliction for superheroes, apparently) and driving him insane.\nShe sighed. The board members had just moved on to arguing the merits of having “unjustly pardoned outlaws” living fifty floors above them, in the same building as hundreds of Stark Industries employees. Whether that contributed to a good or bad street reputation was highly controversial, though, as half of the discussion’s participants thought that the heroes were a danger themselves, and the other half a shield against worst things.\nMaybe it was better that the Rogues didn’t sit in on this particular board meeting.\nNot a good time, she replied. Send them to the gym instead. They can work off their funk there.\nToo late, Rhodey texted back immediately with a cheeky emoji. They’re on their way down now. Have fun!\nIf this meeting goes to shit, she threatened, slightly put out, you’ll be in for a world of trouble later.\nHe sent back another smile, and a small, genuine, sorry.\nPepper looked over to Tony, who had a thunderstruck expression of horror on his face. She followed his gaze to the glass wall of the conference room, where lined up in the hallway and peering nervously inside were Steve Rogers, Bucky Barnes, Bruce Banner, Clint Barton, Natasha Romanoff, and Sam Wilson. \nSteve knocked politely on the door, which was redundant since by this time everybody in the room was staring.\nPepper thought she died a little inside. This probably wasn’t going to go well.\n“Uh, excuse me, ma’ams, sirs,” he poked his head in the door, “we were told we could witness this board meeting?”\nThey filed in and plopped themselves in the empty seats lining the walls. Tony stilled and threw Pepper a questioning glance and she texted him surreptitiously, You’ve got Rhodey to thank for this. Apparently his patience was running low upstairs.\nPepper glanced at the Avengers, trying her best to stay seemingly attentive to whatever blustered conversation was taking place, and noticed they were all gazing with varying degrees of secrecy at Tony, who had returned to texting on his phone.\nRhodey sent her another screenshot of the group chat and she read through it with a hand raised over her mouth, thinking she might combust with the effort of holding her laughter in.\nClint: ooh, look, he’s texting someone. who d’you reckon it is?\nBruce: can’t be Pepper. She’s not on her phone and he’s texting too quick for somebody not to be replying\nSteve: So you think it’s his son?\nSam: hang on hang on\nSam: it could be literally anybody\nSam: it’s probably Rhodey\nNatasha: it’s not Rhodey. \nClint: how do you know that\nNatasha: it was Rhodey who sent us down here, but when we entered the room Tony stopped texting to look at Pepper in confusion. \nNatasha: he knew Rhodey was upstairs with us, so if he had been texting Rhodey he would have just asked him what was going on, rather than looking to Pepper for an explanation\nClint: oh\nBucky: yeah that makes sense\nBruce: what if its his intern though?\nClint: who would bother to ignore Pepper’s murder-stares to text an intern? who probably only fetches him an endless stream of coffee or something?\nClint: definitely his son\nBruce: but what if the intern is the son\nSam: you said the intern called him Mister Stark tho\nSteve: I thought we’d agreed his son was Spiderman?\nBucky: hey hey\nBucky: apparently there’s a hyphen\nSam: who the fuck told you that\nBucky: spidey\nSam: when have you talked to him outside battle!?\nBucky: I didn’t. this was during battle\nSam: why’d you write his name down during a fight\nBucky: I didn’t\nBucky: he just said he could tell I was saying it without the hyphen apparently\nSam: what the fuck\nClint: definitely related to Stark\nPepper put her phone down and turned her attention back to the board members.\n“Not much left to say,” she offered, flicking to the last pages of her itinerary, eager to wrap this up as quickly and smoothly and possible before any damage control was needed. “A reminder that our new school-centric field trip program will be running every Friday beginning tomorrow, the relevant schools at the top of the waiting list have been notified and provided with the details prior to—”\nPepper found herself cut off by a familiar whirring sound and the smashing of a glass window. She looked up reflexively, frowning, but it wasn’t the former rogues that had caused the trouble this time: an Iron Man suit stood just inside the room, casting unfiltered sunlight onto the carpet, surrounded by shards of glass. Tony was already racing for the suit, his watch flashing distinctive red and blue.\nThe armour closed around him amid shouts of confusion and annoyance from the board members, and Iron Man blasted away.\nThe Avengers exchanged glances while Pepper calmed the room. Strange to say it was not the first time her husband had spontaneously left a board meeting, however, that was his most dramatic exit yet. \nBucky raised his hand. “Ms Potts?”\nShe sighed. “Yes, Barnes?”\n“What the fuck was that?” he asked politely.\nSteve hissed at his boyfriend. Pepper strode over to Tony’s abandoned phone, left open, and read the notification at the top of the screen. \nShe sighed again. “Tony received an alert that Spider-Man had been stabbed,” she told the room. \nMutterings rose up. Pepper might not have had enhanced hearing, but the Avengers’ whispers were loud and crystal clear.\n“Overprotective, much?” \n“What the- Stark has an alert set-“\n“He’s monitoring Spidey’s vitals? What the fuck?”\n“-is that not dad behaviour-“\n“I mean, Spider-Man was stabbed? Of course he was. Have you even ever seen the news?”\n“That’s it,” Steve said with a note of finality. “Spidey is definitely Stark’s son.”\n“No doubt about it,” Clint agreed.\nPepper hid an exasperated smile. Natasha caught the CEO’s eye and lifted a single eyebrow knowingly. \nThe meeting lasted two more awkward minutes until Pepper ushered everybody out of the room and told them she’d talk to them later.\nPeter’s death was imminent. Contrary to his all of his (enhanced but admittedly unreliable) survival instincts he’d just handed his signed field trip permission slip back to his teacher.\nNed didn’t seem to get it. “Peter,” he hissed as the class began trudging outside to the waiting school bus. “This is going to be the literal best day ever in the entire existence of humankind.”\n“I’m sure billions of people dying all over the world right now agree with you,” MJ commented drily, appearing beside them with her nose in a book. \n“Where did you come from?” Peter groaned. “I didn’t see you ten minutes ago when I was trying to think of a cunning plan to destroy my permission slip.”\nMJ cocked her head. “Oh?” she said pertly.\n“You’re good at thinking up cunning plans,” the boy grumbled.\nShe raised an eyebrow fondly and made her unobtrusive way to the back seat of the bus. This was where they always sat: MJ on the left, leaning on the window, curled up around her bag with a book in a manner than Peter would never admit to anyone that he thought was really cute; Ned on the right, bag on the seat next to him and very happily invading Peter’s personal space (because he knew Peter was a tactile person, and liked sitting close enough to people that their shoulders were pressed together, and Ned also liked hugs, so it worked out well for both of them), and Peter in the middle, falling into the aisle every time the bus lurched in traffic but somehow always managing to catch himself.\nToday, however, Peter settled into his seat with a long-suffering scowl and face-planted Ned’s shoulder. “’M doomed,” his muffled voice whined.\nFlash leant over the seat, blown up like a poisonous pufferfish, but before he could make a scathing remark, probably about Peter and all the wicked lies he supposedly spent school hours telling, MJ beat him to it. \n“I don’t think so,” she deadpanned, and calmly went back to reading her book. \nFlash closed his mouth, but almost immediately opened it again, this time even more aggressively. \n“And no,” MJ continued, flipping over a page of her book without looking up.\nHe opened his mouth again. \n“Nope.”\nAnd again.\n“Uh-uh.”\nOnly a few minutes after that; “Mm,” MJ said warningly, and for the rest of the trip it only took a bored glance over her book for Flash to close his mouth and turn away, red-faced and grumbling. \n“MJ,” Ned said wonderingly, “do you think you could teach me how to do that?”\nPeter didn’t join in the indignant dispute that followed, but by the time they all forwarded off the bus he had a glimmer of a smile on his face, and MJ had a twist to her mouth that hinted she was pretty pleased at being the one who put it there.\nEveryone had their faces tilted to the sky. \n“Stark Tower,” Ned murmured at the glittering silver building rising gracefully into the sky. \n“Stark Tower,” Peter muttered in agreement. “Quick. I need a disguise.”\nHis best friends shrugged, and by the time Mr Harrington had marked the role (again) and briefed the class on being sensible, mature students, Peter was wrapped in an oversized hoodie that belonged to Ned, had his fringe artfully arranged in front of his eyes courtesy of MJ, and was slumping as best he could in a moody-teen sort of way, which, contrary to his usual eager manner, was about as effective as he could possibly hope for.\nIn the lobby, Peter dawdling at the back of the group, the tour group handed out badges and maps. “My name is Aislie,” she said cheerily, looking suspiciously energetic for a woman who by all rights should be in the very middle of her midlife crisis. “Welcome to Stark Tower!”\nShe parried questions and exclamations with dexterity while simultaneously managing to explain the history of the site and the dates the Tower opened, closed, and then opened again.Peter could see why she had been hired. She was seriously good at dealing with excited teenagers, and thankfully for him, if she noticed him lurking sullenly at the back of the group, she didn’t say a word.\n“This is FRIDAY,” Aislie said, waving a hand at the ceiling.\n“Hello, Midtown School of Science and Technology tour group,” the AI answered smoothly.\nPeter resisted the urge to wave to one of the nearby security cameras. \n“She’ll let you all through this tour-specific turnstile!” Aislie continued. “The light will flash green as you pass. That means that FRIDAY has scanned you and your badge and evaluated your threat level as insignificant to the wellbeing of Stark Industries.”\nPeter wondered if she’d learnt a script off by heart, or if she changed it slightly each time around. Maybe she just knew so much stuff she could look at the turnstile and spout facts. \nThe class buzzed through the gates, the line proceeding as fast as humanly possible in anticipation for what awaited them on the other side. Peter hoped that nobody would notice that as he passed through that the light didn’t flash green but stayed blank. At least FRIDAY didn’t make a loud noise, or alert everyone to his status as biometric-uploaded-and-recognised like he’d heard her sass once to Mister Stark.\nActually, Aislie had noticed, although she passed it off as a system error since the AI hadn’t sounded the alarm, and so had the red-haired receptionist, who sipped her coffee with a concealed but satisfied smile.\n“This way, class.”\nThey climbed up the floors one by one, passing all sorts of displays. The group paused briefly at a statue of the original arc reactor, except this one was blown at up least three times bigger than the original. Aislie handed out fuzzy over-photocopied worksheets and pencil stubs as she spouted facts. Flash tried to stick a piece of gum under the statue but MJ and Aislie, with impeccable timing, caught him in the middle of two sub-zero glares, and he swallowed hastily and turned away.\nPeter hid a snigger.\nSo did Peter’s shadow, and his spidey-sense prickled on the back of his neck, though he brushed it off as the cold (yes, he was wearing a jumper. Yes, he is an idiot).\nThey breezed through the finance department and arrived at the Avenger’s museum.\n“Slowly,” Aislie cautioned, as all twenty-six kids made a rush for the entrance.\nInside, the ceiling was high, and everything was painted white, and the room felt fashionably empty. The students scattered like ants to the different podiums and glass-covered walls. \nPeter, not wanting to stand out by hanging around awkwardly in the middle of the room, followed the closest of his classmates to the Iron Man display. \n“His middle name’s Edward,” said one of them thoughtfully. \n“How did you not know that?” shrieked another. \nThey all laughed, Peter awkwardly bobbing his head up and down so as not to seem wholly excluded from the group. \nNed materialised from nowhere. Peter jumped, but his spidey-sense, already crawling uncomfortably, didn’t do him the decency so much as to spike before his best friend arrived at his elbow to drag him away.\n“They have an exhibit on you,” he hissed in Peter’s ear.\nPeter blinks. “Yeah, it’s really weird.”\n“You KNEW?!” Ned hissed as furiously as somebody trying (and failing) to be subtle could. “YOU KNEW THAT YOU HAD AN EXHIBIT IN THE AVENGERS FRICKING MUSUEM AND YOU DIDN’T TELL ME?! ARE YOU INSANE, PETER! THIS IS THE BEST—”\nPeter looked so forlorn that Ned sighed. \n“Sorry, I’ll be more quiet. But the Avengers’ Museum, Peter, really?”\nQueen’s one and only vigilante shrugged. “It’s kind of embarrassing, actually. And I, sort of forgot to tell you? I didn’t not-tell you on purpose.”\n“I know,” Ned replied satisfactorily, with an added snort. “You’d never do something like that, what do you take me for, Peter, an idiot? But you’ve got to admit it’s super fucking cool—”\nHe pulled the boy to a halt in front of a glass tank of Spider-Man memorabilia and spread his arms magnificently. “See?”\nPeter winced. “Yeah, I see…” he said miserably.\nRight, smack in the middle of the case, was the tattered, tiny onesie that Spidey had made his debut in. Peter thought he might die of embarrassment. The suit wasn’t anything to be proud of, for Thor’s sake, he - and everyone else to visit the museum - could plainly see even the uneven stitches where he’d fixed up the fabric gashes in his legs, and painfully sewn his first logo onto the front of the suit. Even the mask was there. \n“I still can’t believe you were going out in this every night,” Ned said, nose almost touching the glass. “Heck, I can’t believe something my best friend used to wear is in one of the most popular museums in New York.” \nPeter brushed on of the exhibit’s labels. Spider-Man stitches, it said, with a magnified photo of the suit’s crooked seams. Some heroes start from scratch, and when they’ve battled their way up from nothing against unbelievable odds, and they’re still kinder than you’d even hope to become: that’s when you know they’re already the best of us all.\nIt was a quote from Tony Stark.\n“Spider-Man,” said Peter with a smile. “Sometimes I can’t believe it either.”\nThen the spidey sense screamed.\nPeter ducked, dragging Ned down beside him, before turning around and standing back up again. There was a black-clad woman right in front of them, her hand raised as if to silently tap their shoulders before Peter had dived for the ground. “Hello,” she said with a smile that didn’t quite reach her eyes, although a crease in the corner of her mouth made a slightly-impressed reaction.\n“Hi,” said Peter. At least she wasn’t pointing a gun at him. He had a sneaking suspicion as to her identity, and he also suspected that she might have come with thankfully non-murderous motives.\nDamn you, spider anxiety, he grumbled to himself, trying to force down the wave of adrenaline. Why did it always have to be so unspecific?\nAt least it wasn’t as bad as the time he jumped onto the ceiling by accident because his pencil had rolled to the very edge of the table and the back of his neck felt like a bomb was about to go off.\nStill.\n“Hello,” said Ned frigidly. \n“Oh, I was talking to Spider-Man,” she replied, staring at Peter.\n“I- I think you’ve made a mistake,” Ned continued bravely and totally uselessly. “This is just Peter, he’s not Spi- er—” He shrank under her calm silence.\n“It’s fine, Ned,” Peter said wearily. “Nice to meet you, Ms Black Widow.”\nNatasha smiled properly this time.\n“So, you’re the little Stark everybody has been frantic about,” she offered.\nPeter laughed nervously.\n“Only you’re not, are you?”\nThe boys didn’t reply.\n“I’ll see you around. Peter.”\nStevie was an idiot.\nThey were finding their rhythm again, Bucky and Steve. Steadily, softly. Verbally, emotionally, physically. Bucky rolled over in the dark and laid his arm on top of his boyfriend, who wasn’t sleeping but pretending to be. He didn’t want to cuddle up to Bucky in bed anymore, melancholic but adamant that the other man needed personal space. Bucky didn’t like that it was true. His bed had been cold and hard and empty since the 40s, and an unexpected presence in the night could easily suffocate him, maybe even trigger a flashback – though it didn’t change how much he wanted Stevie close.\nBucky wasn’t stupid. When Stevie slept, he snored lightly.\nIt was the middle of the night, they were in Stevie’s old room at the Avengers Tower, and his boyfriend was the dumbest, most insecure idiot he’d ever met.\n“So,” he tried casually at a low murmur, “when are you gonna apologise? Properly, I mean. Not that golden-boy shtick you tried out when we first got here.”\nStevie jumped. “Buck,” he said hoarsely. “I thought you were asleep.”\nBucky grumbled wordlessly. “You’re laying like a fucking statue.” He took a breath, puffed it out gently as a warning, and shuffled closer, the tip of his cold nose brushing the back of Stevie’s neck, which was warm as always. Bucky curled his toes around Steve’s foot under the covers.\nSteve relaxed slightly. \nBucky waited through the silence for the storm to break.\n“How--?” His voice cracked in the silence. “How do I fix it?”\nBucky thought about it. And sighed. “Start by saying sorry, dumbass.”\nSteve rolled over to face him, until their noses met in the middle of the bed. Steve was warm. Toasty. Golden. Made Bucky feel less broken. \nThere were tears in Stevie’s eyes. “I really messed up, Buck,” he whispered thickly. “I razed my relationship with Tony to the ground. I—I didn’t make the right choices.”\nHe paused. “I wanted you back so badly I ruined everything.”\nBucky’s metal hand stole up to cup Stevie’s face. A rough thumb wiped away the shiny tears. Bucky was learning, again. Learning to be gentle. Learning to be calm. Learning how to use those hands for holding velvety fruit instead of guns. Toothbrushes instead of knives. Buttons on a toaster instead of a heavy, ticking bomb. Feeling the soft, worn edges of Stevie’s hoodies instead of cold steel. Leaves and wind and umbrellas and coffee. A warmth that never left his side. There might be nightmares and screams and electricity and panic and sometimes he froze and sometimes he couldn’t fucking breathe.\nBut Stevie helped.\n“In the morning,” he said. “I’ll sit with you and listen. And you can apologise to Stark.”\nSteve sniffed.\n“Go to sleep,” Bucky murmured. \n“You first,” Stevie grumbled stubbornly. “Love you, Buck.”\nBucky closed his eyes. Stevie’s breathing was getting deeper and slower. He hummed from the back of his throat. “Yeah.”\nThe morning came far too soon for Bucky’s liking, but Stevie made breakfast, and Bucky dropped six handfuls of berries and chocolate chips in the pan while his boyfriend wasn’t looking, and the pancakes ended up as lumpy as fuck, but delicious.\nAfter a few hours Stevie went to talk to Stark.\nBucky wished him luck and then hauled ass down the corridor to Nat’s room. He knocked softly and wiggled the handle. She was sitting in a chair in the corner, dagger in her lap and an expression that may have suggested she had been pondering something before he came in.\n“Patch me into Stark’s workshop,” Bucky demanded.\nNat raised an eyebrow. “What makes you think I’ve got surveillance on Stark?” She paused. “We’re here to heal the team, not spy on each other behind their backs.”\nHe eyed her, wondering if on some level the words hadn’t been taken straight from an internal monologue. “You and I both know you’ll never not have surveillance on everyone. Just patch me in.”\nShe hummed.\n“Stevie’s gone down to apologise. I need to know how badly it goes. Patch me in, Natalia.”\nThe corner of her lips quirked up. “Yeah. Okay.” \nShe pulled out a laptop from inside the chair’s seat (an all-but-invisible seam that looked like she’d probably unstitched it herself), and within minutes Bucky was staring at a grainy table leg. She dialled up the volume. “This one’s only good for audio.”\nBucky winced at Stark’s rendition of ‘It’s a Long Way to the Top’, somehow managing to be heard even above the sacrilegiously loud music. The distinctive sound of a wheeled chair scraping across concrete buzzed through the laptop speakers, followed by a wrench (or maybe five) clattering to the floor and a muttered shit.\nBucky frowned. Nat grinned.\n“It’s like that mostly all the time,” she said. “No point in planting the bug, really. Hard to be a superspy in the face of loud, bad music.”\n“Boss, Steve Rogers is requesting a conversation with you,” FRIDAY suddenly chimed through the laptop.\n“Ack,” Stark replied, taken aback. “Fri, you startled me.”\n“Lack of spatial awareness is a sign of sleep deprivation,” the AI responded.\n\n“Yeah, yeah, I’ll have you know I had over four hours last night—wait, did you just say Rogers wanted to talk to me?”\n\n\n“Correct. On both counts.”\n\n“What’s the delay on this?” Bucky asked. \n“Twenty-four seconds,” Nat sniffed. “And seven milliseconds.”\n“Not bad.”\n“It’s downright disgraceful, that’s what. I had to go as low tech as I could so the damned AI wouldn’t see me as a threat.”\n“Tell him to go away, then,” Stark replied.\nA pause, barely long enough for the music to kick back in before; “He is informing me that he would like to apologise to you.”\n“Yeah, well, he tried that already, didn’t he?” Stark snarled.\n\n“Correct. As did Barnes. Though I am not sure that either of them had the chance to fully express their emotions before you left the room. I registered disappointment and shame on both of their faces.”\n\nNat cast a sideways glance at Bucky. “We all have a lot to apologise for,” she said lightly.\nBucky turned his head back to the screen. “Me and Stevie most of all.”\n“Yeah, disappointment,” Stark continued bitterly. “Its always disappointment, isn’t it?”\n\n“I do not believe the disappointment was directed at you, Boss.”\n\nThey heard a loud, derisive scoff.\nBucky drummed his human hand on the edge of the seat. “Is that really what he believes?” he asked quietly.\n“Correct,” FRIDAY replied, her voice coming from just behind them. \nNat and Bucky jumped a mile. Bucky glanced from the laptop speakers to the corners of the ceiling. Nat physically restrained herself from slamming the laptop shut and pulling out her knife. “You asshole,” she hissed at the ceiling under her breath. “Stop watching us.”\nBucky took a large breath. “FRIDAY?”\n“Yes, James Barnes?”\n“Don’t call me that. Are you always listening?”\n“How do I get out of talking to him?” Stark asked through the laptop. “Fri, I don’t—I don’t think I’m ready for this.”\n“Correct,” FRIDAY said in Nat’s room. Nat winced at the timing.\n“Tell him what Stevie told me last night?”\n“I will also need Steve Roger’s permission to share a private conversation with a third party,” the AI said.\nBucky almost growled. Instead, he just sighed. “Then ask him.”\n\n“Colonel Rhodes has informed you on multiple occasions that you do not have to force yourself into threatening or vulnerable situations, but he encourages you to converse with Steve Rogers, as it may be a healthy way to resolve your emotions.”\n\nFrom what it sounded like, Stark blew a raspberry. “When have I ever done anything healthy,” he snapped, sounded pissed off and tired. “—Don’t answer that, FRIDAY.”\n\n“Boss, Barnes has asked me to pass on the following audio message. I have an accompanying one from Steve Rogers, who is standing down the hallway.”\n\nStark sighed. \n“The first one begins as follows,” the AI said, and the audio changed into a shifting of bed sheets and breaths, thick with tears. \n\n“I really messed up, Buck,” Steve’s voice echoed. “I razed my relationship with Tony to the ground. I—I didn’t make the right choices.”\n\n“The second clip continues,” FRIDAY said.\n\n“Tony?” said Steve hesitantly. “I get why you don’t want to talk to me. That’s fair. I was a jerk. I was an asshole.” He paused. “I really miss being friends with you. You didn’t deserve that hurt; emotionally, that I just up and broke and abandoned the team because of ‘some guy I used to know’. I mean, Bucky’s not really some—anyway, that was a real dick move, even without the fact that I, uh.”\n\nBucky could still smell that day.\n“Physically harmed you.” \nSweat. Blood. Tears. Smoke.\nYeah, that day wasn’t disappearing any time soon. Even if it wasn’t one of the more definitively painful ones.\n\n“You deserve a lot better than my friendship. I’m not—Tony, I’m not really—I don’t know how to say this. I won’t keep hassling you if you decide you don’t want anything to do with me. I get that. I just wanted to say I’m sorry. I’ll be sorry for the rest of my life. So sorry. So fucking sorry.”\n\nThere was a long silence from the laptop.\nBucky bit the inside of his cheek.\n“FRIDAY?” said Stark.\n\n“Yes, Boss?”\n\nWould he let Steve in? Would he leave the conversation for another time? Would he reject Steve? \n\n“Did I just hallucinate? Did the oh-so-mighty Captain America just use the fuck-word?”\n\nBucky barked out a soft laugh. Nat raised a hand to her mouth.\n\n“You have not displayed any signs of hallucination, Boss.”\n\nMaybe.\nMaybe they’d be okay.\n“Maybe,” said Stark, almost to himself, before there was another clatter and a muffled oops. “Set a fifteen-minute timer, then remind me to go to the common room and have a chat. Tell him to meet me there, there’s no way he’s coming in my beautiful lab.”\n\n“Correct.”\n\nStevie cried, later that day. Bucky joined the “talk” about half an hour in, to make his own apologies, and when they were all done, feeling very drained and so much more emotionally mature (look at them, talking out their feelings like big, responsible children), they left the common room and the blonde man broke down and sobbed.\nBucky thought he might be smiling, though he wasn’t sure really what his face was doing, since his hands were all mixed up on his boyfriend’s shoulders, holding him up. He knew the tears were of relief.\n“Thanks for the support, Buck,” Stevie said.\nDidn’t he know that’s what Bucky was here for?\nStevie was an idiot.\nHe laughed, then, when Bucky told him so, and pretty soon their weird crying-hug-huddle turned into a slow kiss. Gentle, like Bucky was learning. Sweet, like the future. Deep, like the favour he now owed Nat.\n“Oh, get a room,” she said.\nStevie laughed more.\nThey went to their room.\nA few hours later, Bruce knocked. “Clint’s organising a movie night, or something,” he said. “We’ve been all in the kitchen, finishing dinner. We’ll move into the common room in a minute, I just thought. Um. Should give you some notice.”\nNow it was Bucky’s turn to start laughing, as silently as he could. Steve cleared his throat. “Thanks, Bruce.”\nAn awkward cough from the other side of the door. “No problem.”\nBucky laughed harder. Steve shoved him in the side, playfully, and Bucky rolled over and off the bed. There was a thump as he hit the carpet. Bruce coughed and scurried away as Bucky soundlessly cackled on the floor.\nStevie grinned.\nThe common room was unusually quiet when they entered from the hallway. The Avengers were clustered around the lounge in a standing crowd, all gaping. \nIn the dim room, Tony Stark was asleep on the couch. Movie credits, once again, rolled on the screen, and there was a mop of brown hair leaning against the billionaire’s arm.\nClint spluttered quietly, and then came the second surprise. Tony lifted his head and turned slightly to look at the group of watchers. “Ssh!” he said with a wicked grin. “Pete’s asleep.”\nBruce turned white.\nSteve almost couldn’t believe his eyes and ears. That was Peter? Peter, as in, Tony’s shy intern? The teenager that Bruce had said all along that was acting like Tony’s son?\nSteve could’ve swallowed his tongue. Why didn’t they listen to Bruce? \nOh, but Spider-Man. Spider-Man had them all totally convinced—I mean, they’d all seen the way Iron Man and the vigilante interacted, and even Rhodey—\nWait.\nSteve might’ve been internally combusting before, but—\n\nWhat.\n\nHe sank to the floor.\nSo Peter was Tony’s son—\nAnd they all saw the way Spidey—\nEveryone was looking at him. \nNo, now everyone was looking at Tony—\nEveryone was looking at Peter.\nPeter who was the right height, the right build—\nSounded like a teenager, Peter, of course he sounded like a teenager, he was a bloody teenager—\nAnd Steve might not have heard him talk like Bruce had but he could bet—\nHe would bet—\nHe knew exactly what he sounded like—\n\n—but unfortunately Iron Man has grounded me—\n\nEveryone looked at Tony.\n\n—And I don’t just save cats from trees. I also save people—\n\n\n—Sure, spider-baby—\n\n\n—Oh my god I’m meeting the Avengers! My guy in the chair is going to freak—\n\nTony smiled.\nNatasha smiled.\nSteve choked.\nLight bulbs suddenly flickered on in every member of the team’s head. Steve could almost see them. There were tears in his eyes. He made a funny noise. He wasn’t sure whether it was a laughing noise or a crying noise or an oxygen-deprived noise, but Bucky looked sideways at him and he knew it too, Steve could see it in his stupidly cute eyes.\n“Peter,” said Bruce, the colour coming back to his forehead. He sighed long and hard. \nSteve put a hand over his face and breathed deeply for a few moments. Behind his closed eyelids he could hear Sam whisper, “what?”\nClint pointed at Natasha furiously. “You knew!”\nShe hummed a little.\n“Shoo,” Tony told them firmly. “I wasn’t kidding, you’ll wake him up—\"\n“I’m already awake,” Peter cut in suddenly, without moving his head. \nYep. That was a voice Steve recognised, holy shit. Conspiracy confirmed. \nFuck. He’d dropped a huge metal loading thing on a kid.\nTony’s kid, no less. \nThere was a pause where everyone stared at each other. \nSteve took a step forward. “In that case,” he tried for a friendly smile, “it’s nice to meet you. I’m Steve.”\nPeter squinted. “Mm-hm. Brooklyn.”\nCold, but. That was fair. After all, he'd dropped a fucking airport bridge on him.\nBucky smirked from beside him, but before Steve had a chance to clear the dawning horror from his throat and apologise, Peter continued with a follow-up sentence that really got them all confused.\n“Peter Parker.”\n“Hang on,” Sam asked, “aren’t you a Stark?”\nTony grinned.\n“Nah,” the kid replied. “Just an intern-vigilante mess.” And he closed his eyes again, flopping back onto the billionaire’s shoulder. “Can we do introductions tomorrow?” he mumbled to Tony. “’M sorta tired right now. Bit grumpy too.”\n“Whatever you say, kid,” Tony replied easily, brought a hand up to card through the head of hair resting on his shoulders, and turned to the Avengers. “Mister Parker here has requested to reschedule this meeting for a later date when he is achieving the goal of keeping his eyes open for more than three seconds at a time.”\n“Mister Staaark,” Peter grumbled.\n“So he’s not your kid?” Sam asked. He looked like he didn’t believe it. Hell, Steve didn’t believe it. They had similar hair and everything. Surely they were related.\nTony looked a bit awkward for a moment, and then answered with a short, “no.”\n“But we all thought—”\n“I know what you thought,” he said, “FRIDAY told me.”\n“It was so genuine—”\n“Surely you couldn’t’ve been faking the whole—”\n“How the fuck are you not a father—”\n“The sheer dad vibes, Tony, the—\"\n“I called bullshit,” Rhodey burst out. “You love that kid like he’s yours, Tones, that’s what it’s about. I only met him last week and even I can tell you that.”\nBruce nodded. “You don’t have to be genetically related to someone to be a parent.”\n“I’m still awake, you know,” Peter muttered, but he sounded vaguely emotional.\nTony huffed quietly. “Yeah,” he said. “Welcome to the Avengers, they never shut up.\" He paused. \"Love you, Pete.”"
}