{
    "id": "32792506",
    "url": "https://archiveofourown.org/works/32792506?view_full_work=true",
    "author": [
        "emmacortana"
    ],
    "title": "Spiderhead",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "Marvel Cinematic Universe",
        "Spider-Man - All Media Types",
        "DCU",
        "Batman - All Media Types",
        "Spider-Man (Tom Holland Movies)"
    ],
    "relationships": [
        "Peter Parker & Bruce Wayne",
        "Batfamily Members & Peter Parker",
        "Peter Parker & Tony Stark"
    ],
    "characters": [
        "Peter Parker",
        "Bruce Wayne",
        "Batfamily Members",
        "Dick Grayson",
        "Tony Stark (mentioned)"
    ],
    "additional_tags": [
        "Peter Parker is a Mess",
        "Peter Parker is a Little Shit",
        "Bruce Wayne is a Good Parent",
        "Bruce Wayne Adopts Orphans",
        "Peter Parker Acts Like a Spider",
        "Peter Parker Has a Family",
        "Peter Parker Needs a Hug",
        "the author has daddy issues and takes it out on her favourite characters"
    ],
    "language": "English",
    "series": "Part 1 of Spider and Bat Friends",
    "published": "2021-07-24",
    "completed": null,
    "words": "11,393",
    "chapters": "1/1",
    "comments": "408",
    "kudos": "19,814",
    "bookmarks": "3,469",
    "hits": "213,612",
    "summary": "<p>Peter acts like a spider.</p>\n<p>The bats have opinions on it.</p>\n<p> </p>\n<p>\n<a href=\"https://archiveofourown.org/works/33726178\" rel=\"nofollow\">sequel</a>\n</p>",
    "notes": "<p>THIS FIC HAS A SEQUEL NOW. it’s called <a href=\"https://archiveofourown.org/works/33726178\" rel=\"nofollow\">Left of the World</a> and it’s part 6 of this series so go check it out if u want!!</p>\n<p>before u read this fic, y'all should know it's based off of another fic called Dark Matter by mysterycyclone, aka the fic that got me into Batman in the first place. and i'm so glad it did bc i actually joined the fandom right when the batman harley quinn show gate was happening on twitter and that was the most serotonin i've literally ever received in my LIFE. I did get the ok from the author to publish these fics tho don't worry!!</p>\n<p>if u don't read that fic (although u rlly should, it's a VERY good fic,) then all u need to know to understand it is that after peter got snapped in infinity war, he woke up in the DCU, and he's been barely scraping along alone in Crime Alley, and he decided to be Spider-Man in specifically the alley. i take a few creative liberties and also there are some differences because Dark Matter is still updating and i write off my theories/headcanons, but it's still heavily influenced by the fic so show the author some love!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>~ spiders in my head! spiders in my mind! ~</p>\n<p>i have been on a writing KICK lately so we'll see how this fucking works out!!!!! literally i've written like 200 pages in the past some week it's insane. also ik some of batman was ooc probably but also i could not care less i'm so sorry i just don't this fic was dredged up from somewhere VERY deep inside of me.</p>\n<p>anyway i'm a slut for kudos and comments, please leave them!!! &lt;3&lt;3&lt;3 i have a lot more peter parker and batman crack where this came from, and i might post those too! and knowing y'alls thoughts would help me. make that decision. some of those are. significantly longer than this. i just thought this might be easiest to start posting bc it's a lot lighter lmao</p>\n<p>all of peter's spider behaviours are either real science facts or lifted straight from canon. the bonus scene was a play on Spiders-MAn, that What If story about Peter Parker being devoured by an army of spiders who absorb his conscioussness (wtf). ethyl chloride is spidey's kryptonite in the comics, and he has canonically pretended to raise an army of spiders or eat criminals during interrogations before. i researched sm about spiders for this fic. i'm arachnophobic. i'm having nightmares.</p>\n<p>reminder that if u liked this then there’s also the sequel :))</p>\n<p>ETA 12/04/2023 lmao i edit all my fics after they're posted. sometimes just little grammar things, sometimes adding whole new scenes &lt;3 this one i added a few more lines just to show peter's progression into being a little bitch.</p>",
    "text": "“Why Spider-Man?”\nPeter’s been getting asked that question since pretty much the first time he’s ever put on the mask.\n“I thought you were supposed to be the World’s Greatest Detective,” he jabs. “Figure it out.”\nBatman frowns, an unhappy set to his mouth. “The only spider-like abilities you have is to stick to things and shoot webs—and the webs are artificial. You might as well have been Sticky-Man.”\nPeter groans. “Actually, all of my powers are spider-themed,” he informs. “Proportional strength, speed, senses, and durability of a spider. And my patented Spidey Sense—actually, no one really knows what that is,” he admits.\n“And did you just happen to get exactly the same numbers as a spider?”\n“Dude, my name is Spider-Man. Literally think about what that implies.” Peter thinks it might not be a great idea to reveal how he got his powers just yet, but he can hint at it. “I mean that, genetically, I am part spider, part man. That’s why I chose the spider-shtick.”\nBatman is probably in the running for the least expressive person Peter has ever met, but even he can’t disguise the small grimace of disgust at that. “Was one of your parents a spider?”\n“Something like that,” Peter agrees. It’s not actually anything like that but hey, at least it throws the bats off for a bit. “I mean, why did you think I was so arachnid-like? I thought you would’ve figured it out.”\nBatman looks frankly disturbed at the thought of Peter being born of a human and a spider. Honestly, in his situation, Peter would feel the same. But right now it’s just funny. “I assumed you were taking your role seriously.”\n“Method acting,” Peter grins. “But no. Actually, I try to hide my most spidery behaviours,” he admits. “It tends to freak people out, and it’s not a great look for my average Joe civilian ID.”\nThere’s a grudging intrigue in Batman’s voice as he points out, “You don’t need to hide in costume. People already know you’re Spider-Man, why not lean into it?”\nPeter tilts his head at him. “I have a few times,” he reveals. “A lot of the behaviours come instinctively for me. Like this pose,” he settles back into his crouch more, accentuating the unnatural, unhuman-like sense of it. “You’ll probably see what I mean when I say creepy tics sooner or later.”\nHe skitters across the floor on all fours, only the pads of his fingers or his toes ever touching the ground, with an inhuman speed to it. Like a spider plucking the strings of its web. He feels more than sees Batman’s shoulders tense.\nHe snorts to himself. If the bat can’t handle his crawling, then wait until he finds out about some of his more… unsavoury habits.\n-\nPeter decides he should ease them all into his spider-like tendencies.\nEven if he’s not technically half spider, and even though he’s never actually tested out how much of his DNA was changed by the bite, he knows a significant part of him is inhuman. The changes went farther than a six pack and better eyesight.\nBut his short conversation with Batman sticks with him because he’s, well, right. There really isn’t a reason to hide his traits anymore, not when it’s already established that he’s spider-themed. And it’s not like he’s ashamed of them, or freaked out like he was at first when some started to emerge.\nMostly, he just hangs upside down from the ceiling on a thin strand of web, or scurries like a spider from place to place. Doesn’t stop his body from naturally contorting in ways that humans aren’t meant to be.\nHe gets some odd looks, but they’re not judging—mostly curious, or even fascinated, and, okay, occasionally unsettled.\nOne night, Spider-Man catches a guy Batman had been tracking for three days.\n“Good work, Spider-Man,” he says, forcing out the words, awkward but genuine.\nPeter just gives him a salute, not bothering with a response. Honestly, he’s pretty pleased with himself, too. That was quick thinking, and a smart trap, with both minimum risk and energy required. He’s getting better at this whole hero gig.\nThere’s a silence for a while, with Peter cheerfully watching Batman secure the criminal for good and having Oracle dispatch some cops. Then, the bat suddenly speaks.\n“Are you—are you making that sound?”\nPeter startles, and the low humming momentarily stops. He flushes, extremely glad that his mask hides it. “Oh, uh, yeah.” He ducks his head, bashfully rubbing the back of his neck. “I’m kind of in a good mood tonight,” he says as if that explains everything. Which it kind of does.\nBatman seems thrown out by it. “What is it? The noise, I mean.”\nThe sound comes back, albeit weaker and more self-consciously. “Um, d’you know that some species of spiders purr?”\n-\nHe starts greeting the bats with a little chirping sound.\nOr, equally frequently, when the bats decide to try to scare him by popping up out of nowhere (damn you, Spidey Sense), he responds with a hiss, or the occasional growl.\nSometimes he does this for no reason, just to throw them off.\nIt’s very fun.\n-\n“Spider-Man, what the fuck are you doing?”\nIt’s Spoiler who asks that, actually. Peter doesn’t look up from his glaring match with his opponent.\n“We’re fighting for territory,” he snarls, stooping low in his crouch and making a threatening lurch forward with his body, growling all the while.\nThere’s a moment of silence as the bats process that. Then, Nightwing speaks. “It’s like, the size of a fingernail. You don’t need to fight for territory.”\nPeter just bares his teeth, even through the mask. “It was  threatening  me,” he defends. “I’m settling this. Also, it’s one of the four most venomous species in New Jersey—I know my stuff,” he adds at their blank looks.\nBatman is glowering—but then again, when is he not? “Just step on it,” he grumbles, which will probably be the only time ever that he encourages Spider-Man to kill an enemy.\nPeter yelps, finally breaking off from the glare with the spider. “Are you  insane? It’s a yellow sac spider! On top of the cytotoxin, they  eat other spiders. I’m not trying to die.\"\n“Spider-Man,” Batman snaps. “You’re not  actually  a spider. It can’t eat you. Just be careful not to get bit, and kill it.”\nPeter hisses—but it doesn’t even matter. The spider he’d been locked in a war with just turns around and leaves. Peter cries in indignance. “You just made me lose! Oh my God, this is so humiliating, I can’t believe I lost to a  sac.”\nNightwing comes forward and steps on it. Peter stares in wide eyed shock at the splat on the floor.\n\"Thank you,\" Spoiler sighs in utter exhaustion.\nPeter has nightmares of Nightwing stepping on him for weeks. Not that he would ever tell them—they have enough on him to begin with.\n-\nPeter is walking on walls because he’s so bored.\nStake-outs are honestly the worst part of the job, and even Batman’s amazingly stellar and not awkward at all company is not enough to keep him from going insane. At first, he just walks up walls and across the ceiling of the abandoned building they’d chosen as a look-out, which for some reason, gets Batman even more worked up than his skittering.\n“How much longer?” He complains like a child ready to throw a tantrum.\nBatman looks as if he has a bad taste in his mouth. “A while.”\nPeter sighs. “Great. I’m going to go make myself comfy, then,” like he hasn’t tried to do that several times before and just couldn’t sit still long enough. But this time, he removes one of his gloves.\nBatman spares him a brief questioning glance before turning back to his binoculars. Peter pays him no mind, only crawls up the walls to a dusty corner of the room and starts nesting.\n“What are you doing?” Batman narrows his eyes into the lenses.\nPeter pays him no mind. “I’m getting comfy,” he repeats, shooting a strand of silk from one of his natural spinnerets on his wrists. There’s a spider web already in the dark corner—an ideal spot, really—but the spider abandons it and drops to the floor the moment Peter approaches. “Yes, thank you. See,  this  is a reasonable spider. It sees that I am clearly much bigger than it and submits to me. Steatoda nobilis,” he says fondly. “A fine species. That’s one I’m from, exactly.”\nBatman actually abandons his binoculars for a moment. “You’re part of their species?” He asks incredulously. Then, more disturbed: “Your webbing actually comes out of you?”\nPeter snorts. “I’m from a lot of species, actually. It’s why I have such a mix-and-match of behaviours. The spider that made me was a genetic mutant, experimented on until she died.” And he knows what he’s implying when he phrases it like this, but honestly it’s not like he’s  lying. Just a bit of misdirection. “And I have both manufactured and biological. I made my web shooters first, but then,  surprise, I also make this stuff.”\n“Why still use the shooters, then?”\nPeter doesn’t stop from where he’s building his web, quickly and efficiently. “Longer range,” he calls out. “And they have more tensile strength, and take less energy for me. Natural spider webs were never meant for slinging. I use my web shooters to swing and get the guys, and I use my natural spinnerets when I want to make a web, stick anything  especially  hard or last longer than three hours.”\nSatisfied with the state of his web, he crawls around on it, plucking strings like a spider. It’s a  very  large web—covers up most of the wall, and it’s meters long. Enough for Peter to feel right at home. He sighs in contentment and dozes off.\nHe awakes to Batman uncertainly throwing chunks of debris onto his web.\nPeter doesn’t realize this at first, waking up and scrambling to where the vibrations on his web came from, excited for his catch—\nHe slumps in disappointment when it’s not prey. And then has a crisis because what the fuck he was expecting, a human sized fly to slurp? Like, honestly.\nBatman, at least, looks properly distraught by this show. “We have to go,” he tells Peter. “The buyers have arrived.”\nPeter gloomily stalks off his web.\nThe fight goes easily until it doesn’t. A guy holds a machine gun between both Batman and Peter, and although that would really be an easy enough fix, there’s also some explosives in the room, and they can’t afford any wild, stray bullets in such close vicinity.\n“Stay back!” He yells, flipping the gun between the two vigilantes. “I’ll shoot you all to hell.”\nPeter hunches over, grunting and moaning, back contorting in ways no human should be able to do.\n“Jesus Christ,” Bad Guy whispers.\nBatman actually looks distressed. “Spider-Man, what are you doing?”\nHe pants, heavy and loud. “I’m summoning them,” he groans.\n“What?”\n“The spiders!” He makes jerky movements, slowly raising his arms up like Spider Jesus or something. “I’m summoning the spiders! I’m calling for their aid, because I am the Spider-God, and my brethren will come in armies.”\nThe gun drops onto the floor with a clatter, and Bad Guy raises his hands high in a surrender. “I give, dude!” He yells, panicked. “Stop!”\nPeter slowly ceases his twitching movements, relaxing his body. “Thank you, brothers, for your eagerness to help, but it is no longer needed,” he tilts his head back and says to the sky. Batman quickly apprehends the guy, and the cops arrive to arrest all of them.\n“Can you actually do that?” Batman asks, perturbed, afterwards.\nPeter is purring again, delighted at how the night had turned out. “I was joking,” he says, and chirps twice in wicked delight. “I’ve pulled that trick a few times. You won’t believe how well it works.”\nThere’s a slackness to Batman’s jaw that Peter finds extremely funny. “Just how much spider are you? And how much human?”\nPeter actually takes time to consider this. “I’ve never really checked,” he admits. “And only three people have ever seen me act full spider before. I think my spider genes are really fused in with my human ones, though. I mean, my eight eyes and all.”\nHe adds that in as a joke, but is surprised to see Batman’s eyes widen. You know what? He’ll roll with it. Maybe it’ll even help keep them off his back about secret identities.\n“This isn’t you acting very spidery,” Batman says flatly. “You can be more.”\nPeter chirps in cheery agreement. “If you ever see me pull a stunt like that, though, don’t worry about it. It’s all for show.” Batman relaxes almost imperceptibly, and Peter tilts his head in heady contemplation. “That’s not how I’d really summon them.”\nHe swings ahead, waiting for Batman to follow, purring all the while.\n-\n“Spider-Man, focus.”\nPeter snaps his attention back to where the bats are discussing how best to proceed in their information extraction without resorting to full-out torture, and he hears what they’re saying. Full body threatening, bad cop worse cop, Red Hood wanting to just shoot the guy, uh huh, great. His mind wanders off again.\n Buzzzzzzzzz.\n\"Spider-Man,\" Batman sounds impatient, like Peter’s being purposefully difficult.\nPeter meets his eyes. “Sorry,” he mutters somewhat sheepishly. “There’s a fly here.”\n“Ignore it,” he snaps, and Peter rolls his eyes.\n“You try that when you’ve got super senses,” he hurls back. “It’s like there’s buzzing at the base of my skull.”\n“Just kill it,” Nightwing pipes in, leaning back on the hind two legs of his chair. “Or is that going to give you nightmares too?”\nPeter scowls at him, but stands up anyway. He hears the buzzing, can see the fly with an impossibly detailed sight. He stalks his prey, slowly inching closer and closer to the wall, and then suddenly, in a move so fast he’s almost a blur, he traps it in his hands.\nHe feels the fly buzzing around within his clasped hands, and he walks over to the window.\n“Sorry, little guy,” he talks casually to the fly. “You do look delicious, but today’s your lucky day. I’m kind of on a vegetarian diet—well, I eat meat, but I try not to eat insects anymore.” That was a wild ride. “Here you go,” he says, nudging the window open and letting it fly off.\nHe subtly licks his lips watching the fly leave.\nThere’s silence in the room as Peter returns back to his seat. “As you were saying?” He gestures to Batman, who’s staring at him.\n“Did you just say that fly looked delicious?\" Red Hood demands.\nPeter winces. Oh. So he’d let that slip. “I don’t get why all of you always get so surprised when I do something spidery,” he says instead. “Like, I’m a  spider. When will you get that through your head?”\n“You eat  bugs?\" It’s Spoiler, this time, looking properly disgusted.\n“Ate,” Peter corrects. “I’m reformed now. I, uh, accidentally ate a friend, and there’s really no going back from that.”\n“You ate your  friend?\" Nightwing sounds extremely upset by this revelation. “Your friend was a  bug?\"\nPeter holds back a pained flinch. “More like a friend of a friend?” He offers weakly, grimacing, remembering Antero. “This guy I know, Ant-Man, he can talk to ants, right? His daughter and I were friends, so I was over at his house, and I just saw this ant, and oh man, it looked so good. Turned out his name was Antero, and Ant-Man spent the next week looking for him and crying. He said he would forgive me as long as I promised to seek recovery.”\n“Ant-Man,” Batman says, stony and expressionless. “You know a guy named Ant-Man, who can talk to ants.”\nPeter nods. Antero really had tasted delicious—just the right amount of juicy.\n“Ants and spiders,” Red Hood mutters under his breath. “Spiders and ants. What’s next, wasps?”\nPeter makes a face, thinking about Scott’s girlfriend. “Well, actually—”\n“Stop,” Red Hood orders, putting fingers to his temples. “I don’t want to know.”\nPeter shrugs, turns back to the one-way mirror that shows their latest bad guy, who may or may not know where more of Black Mask’s shipments are. “You know, this conversation actually reminded me of an idea…”\n-\nBad Guy wakes up in Peter’s web.\nIt’s a very expansive one—covers most of the room, and Peter had had to use both of his spinnerets to make it. He lurks over, plucking the strings, trying to seem as distinctly spidery as possible.\n“You’re awake,” he says, cheerfully. “Oh, I love it when they’re awake. They taste better—I mean, I know that it technically doesn’t change anything, but half the fun is in the  experience, you know? What fun is a bug when they’re all asleep and boring?”\n“What are you doing?” Bad Guy forces out, attempting to sound tough but ending up terrified.\nPeter tilts his head, and then for good measure, tilts it further, until it should be well past broken. “Isn’t it obvious?” He asks, picking at a strand of webbing that goes directly to Bad Guy’s right foot. “You’re caught in my web. You’re trapped. And  I  am going to have a  meal.”\n“Spider-Man doesn’t kill people,” he says, almost like he’s trying to assure himself. “Neither does Batman.”\nPeter laughs, a chittery sound that’s more arachnid than human. “You see Batman around here?” He questions, amused. “He doesn’t think you’ll talk. Believe me, we’ve both seen scum like you before. You  never  talk, so there’s no point trying. No, Batman thinks you’re safe and well, tucked away in a jail cell and rotting for the rest of your life. You’re alone with  me. And  I  am going to eat  you.”\nBad Guy is trembling in fear now, two seconds away from peeing his pants. “You don’t do that.”\nPeter leans forward in his webs. “I do. I’ve just eaten everyone who’s ever known about it.” He grins in delight at how squirmy Bad Guy is getting—he’d say he’s going to crack any moment now. “I’m a spider, a natural predator. I hunt and eat prey. Take pride in being one of the few people to know just how arachnid I am—I’m going to bite you, and my venom will melt your insides, and I will leave you a husk of a body—”\n“No! Stop!” Bad Guy is crying. Good, his criminal record said he’d killed an innocent old lady before. “Tell Batman I’ll talk. Please, I’ll talk. Don’t—don’t eat me.”\nPeter settles back, tries to force disappointment into colouring his own voice instead of satisfaction. “Shame,” he sighs, making his way back to the door. “You looked so tasty, too.”\n-\n“You don’t actually eat people, right?”\nPeter quirks a smile. “No,” he reassures all of the bats. “I don’t eat people. I do have venom though.” He clicks his teeth a few times, watching as the bats all simultaneously turn a micro-shade paler.\n“So you  could  eat people,” Nightwing deduces, extremely unsettled. “You just choose not to. Because of morals.”\n“Anyone could eat people,” Peter points out. “I would just do it in an especially weird way. I tend not to let my really wild instincts get a hold of me. I do like smoothies, though,” he adds wistfully. “I like to wrap them up in my webs and then slurp. It’s just as good as the real thing.”\nNightwing pauses. “Good to know,” he says, and then claps Peter on the shoulder. “Nice work getting him to talk, but I also think I speak for all of us when I say we’re never doing that again.”\nSpoiler makes a noise of confirmation. “How did you do that?” She asks, gesturing to his body. “The moving thing. You looked like slime.”\n“What, this?” He asks, squatting down on the floor and moving unnaturally quickly, quietly, joints moving in ways that should not be able to be moved. “I’m flexible.”\n“No,  I’m  flexible,” Nightwing huffs, a sort of sick look on his face. \"That’s  not human.” There’s no meanness to his words—only fascination, with a touch of both envy and nausea.\nPeter blinks at him from his position on the ground, although they can’t see it through the blankness of the mask. “Spiders don’t have bones.”\nNobody knows what to say to that.\nPeter skitters up the wall, sticking on and hanging off by his feet flat on the ground and just a few finger tips. “Anyway, if you don’t mind—I actually used up a lot of my bio-webbing back there. Since the dude’s in a proper jail cell now, I was thinking I could catch a few Z’s in my crib?”\nEspecially since they still had work to do, what with tracking down the info Bad Guy provided, but Peter really needed a nap. And with the web, he’d be able to feel if someone came too close for his liking.\nBatman scowls at him, but he doesn’t growl some kind of disapproval, so Peter takes that as a yes.\nHe flashes a thumbs up at the bat, crawling to the ceiling and making his way back to the interrogation room. “I’m also running down on my aminos and proteins,” he calls out carelessly. “So don’t mind me when I’m eating my webs. Reduce, Reuse, Recycle, and all that.”\n-\nPeter does have bones.\nThey’re just… looser than they should be.\nHe doesn’t tell them that because it’s funny to see them lose their minds when he gets floppy.\n-\nThe bats start bringing him smoothies when they have a designated meet up. They watch in fascination as he takes off his gloves and spin the cup around and around with his webbing until only the straw pokes out.\n“Where does the venom come from?” Batman asks one day, glancing at where Peter’s mask is lifted just above his mouth on a rooftop. “You don’t have fangs.”\nHe happily slurps away at the smoothie Nightwing had gotten him before being called off for something or other. It’s mango flavoured. “Don’t need ‘em,” he says cheerily. “Comes out from one of my salivary glands—and only when I want it to, or if I’m, like, starving. I actually did do a lab on them once,” he mentions thoughtfully. “It’s a weird cocktail of several types of venoms—both cytotoxins and neurotoxins. I hail from a strange mix of spiders.”\nBatman pauses. “Are they lethal?”\nPeter shrugs. It’s not like he’s ever tested it out or anything. “Yeah. From what I’ve found through, like, humane experimentation—the neurotoxin comes first. That’s what floods my mouth, sometimes.” It tastes a bit—almost soapy? It’s not unpleasant, if a little alkaline. “The cytotoxin only comes out when I bite.”\nHe sucks on the straw, hollowing his cheeks, a deep purr emanating from his chest. If mango-flavoured bugs existed, then Scott’s friend or not, there would’ve been nothing holding him back from a life with an arachnid diet.\n“When you said you had some more off putting spider behaviours, I wasn’t quite expecting this,” Batman admits. “I assumed they’d be more… personality traits, or your creeping movement, instead of biological and dietary differences.”\nPeter grins at him, showing his teeth. “You’ve actually taken it a lot better than I thought you would,” he compliments. Even if he still gets noticeably unsettled watching Peter sometimes. “I mean, even in spider terms, I’m weird. I freaked myself out with some of my powers, even.”\nBatman jerks his head slightly. “When you said you were genetically modified…”\nPeter bites his lips as he smiles, cheeks dimpling in the night. “I’m a mix-and-match of like a dozen different spider species, and something completely different,” he explains, in further detail than he had previously. “My spider mom—you know, the spider that birthed me—was part of a cross-species genetics experiment. Lots of splice-and-diced DNA, and lots of radiation. I mean, I’ve been experimented on a few times, but I’ve never actually seen what they came up with.”\n“Is that why you hid your traits for so long?” There’s a firm set to Batman’s jaw, and he seems even more tense than usual.\nPeter chews on his bottom lip. “Where I come from, people like me are kinda frowned upon,” he reveals. “Metas can be locked up, experimented on, tortured—all legally, by some very powerful people. I never had too much of a problem as Spider-Man—I had a high up figure looking out for me,” he says wistfully, thinking about Tony. “And I was pretty low-leagues, most of the time. Just trying to do my part on the ground, you know? But if my civilian identity was found out as Spider-Man or even just a meta, I would’ve been thrown to the pits.”\nThere’s a deep sense of fury radiating off of the bat that Peter takes care to ignore. “And where is this?”\nPeter huffs a laugh. “Not telling you that,” he snorts. “And don’t worry about the metas—last I heard, there was a huge prison break. But that’s why we never looked into my genes all that much. I mean, I wanted to—I’m kind of a nerd,” he admits, embarrassed. “But it was one thing for my mentor to shield me from metahuman rights politics, but in case I  was  arrested, he needed to be able to have a strong defence. Couldn’t do that if he knew the exact numbers of how  not  human I am.”\nHe sips at his smoothie more, his appetite slightly curbed from the topic at hand. He misses Tony, misses the security he felt knowing that fucking Iron Man always had his back.\n“You’re human,” Batman says. His voice has less of that signature growl than Peter’s ever heard it before. “Eight eyes and all.”\nHe blinks, startled. Then, like a crack in a dam, relief. He beams up at Batman with all the brightness of the sun. “I like to think so, too,” he agrees warmly. “My mentor—he’s kind of to me like how you are with your crew,” Peter says contemplatively. “He tried to get me to embrace both my spider and my human. Didn’t even complain about all the webbing in his house.”\n“Where is he now?” The question has a weight to it, as if in some way he already knows. And maybe he does. Spider-Man is notoriously a loner—especially with his repeated declines to joining the bat party. Two guesses as to why.\n“I don’t know,” Peter answers honestly. “But I hope he’s okay. I hope he comes for me soon. I… miss him.”\nHe finishes his smoothie, leaning over the edge of the roof and dropping the empty husk into where he knows is an open dumpster. He should go home now—they’d already cracked down on the drug trade before Nightwing had left, and Peter doesn’t normally tend to stick around after these things.\n“Well, B-man, it’s been fun,” Peter says, tugging down the edges of his mask. “Let’s do it again sometime.”\nBatman gives a quick nod that’s uncharacteristically not-grumbly. Peter gives him a salute and shoots a web off the roof.\n-\nGotham City  sucks.\nPeter hates Gotham. New York  certainly was never so mean to him—except for the times it was, but whatever. Anyway, he’s dying on the floor.\n“Holy shit!” A guy in a Superman mask says, unbelieving glee in his voice. “That actually worked.”\nPeter groans from his position on the ground in between hacking his lungs out. His throat is on  fire, and his senses are going crazy, and he can barely  see.\nHis hand fumbles blindly upwards to his earpiece under the mask, switching it on for the first time that night. “Hey, Oracle?” He chokes, voice low and rough and breaking. “I need some back-up.”\n“Spider-Man?” She replies through the unit, sounding surprised and more than a note concerned. It’s not like he’s one to call for help often—mostly he’s the kid-in-way-too-over-his-head type. “Sending someone on your way. Are you okay?”\n“Fine,” he tries to manage out, before a kick to the stomach knocks the wind out of him. Okay, not so fine. But he’ll be fine. Back-up’s coming. He curls protectively into himself, body spasming slightly.\nA guy wearing a Flash mask crows delightedly. “Who would’ve thought? Spider-Man taken down by bug spray.”\n Yeah, yeah, fuck you, Peter thinks with a vengeance. Fuck them and their stupid little drug trade that Peter would’ve left alone if they weren’t creeps to their female customers about it, and their one lucky break that the bug killer they happened to pick up for the warehouse  also  happens to be the one that is deathly poisonous to Peter.\nPeter’s heightened senses are failing, and everything blurs. Through the thick haze of gas, he can’t breathe without his lungs searing in pain. And of course the criminal crew aren’t affected, of course it’s only  Peter  who gets fucked by the spray.\nHe can’t see the next kick coming, or the one after, or the one after that. Distantly, he’s aware that he shouldn’t black out—not while he’s still on the ground.\nBut it just comes so easily.\nThe only thing he’s aware of is when the pain stops.\nHe moans, eyes slowly blinking. His brain is sluggish, his body is writhing on the ground from pain and the gas, like a spider that’s been knocked on its back and is now having each leg pulled off.\nA figure kneels down next to him. “Don’t move,” he says, voice distinctly bat-like.\nPeter completely ignores this because if the bat’s here, then the wannabe Justice League are taken care of, and Batman doesn’t know what he needs. He drags in an inhale, chokes on air.\n“Get,\" he drags a painful breath, \"me outta here.” He gags, convulsing on the floor.\nThere’s a brief hesitation, before arms slide under his body and smoothly pick him up. Peter clings on desperately, chest heaving. He can feel the earth sway beneath him as they make their quick escape.\nSoon, he’s being lowered to the ground, propped up against a brick wall. His fingers immediately fly upwards, twitching and jerking as they are, to push his mask about his mouth and nose so he can  breathe. \nInstead, he hacks up blood onto the ground.\nHe can feel panic coming off of Batman, which doesn’t happen very often, so it kind of freaks him out more. His chest collapses under the weight of his breaths.\nBut now that he’s out of the thick of the gas, he can feel his airways clear up with delicious, soothing, clean air—well, as clean as it gets in Gotham, which is not very clean at all. He just needs a moment or twenty to catch himself, and he sputters as much to Batman in between groans.\nEventually, his lungs feel less  on fire  and more singed. He places a hand on his chest and feels it stutter and hitch.\n“That  sucked,\" he wheezes, voice sounding raw. His throat feels like it’s gone three rounds with sandpaper. “D’you beat ‘em up?”\nBatman ignores the question, instead moving right onto his own. “What was that?” He demands. Peter belatedly realizes that one of his hands is still on his shoulder, pressing him back against the wall. “You were seizing.”\nPeter pauses. Was he? He can’t remember much of that whole thing. He wipes the drool and blood from his mouth with the back of his hand. His bottom lip is split, and it stings at his touch. “Ethyl Chloride,” he rasps. “Achilles heel.”\n“Bug killer,” Batman says flatly. “You’re susceptible to bug killer.”\n\"Especially  ethyl chloride,” Peter agrees, trying to catch his breath. “Poisonous. Kills… spider in me. Be fine, in like… a week?”\nThere’s a hard set to Batman’s mouth. “I’m taking you back to the cave,” he says firmly, and Peter jerks.\n“No!” He coughs again, and Batman pushes against him harder to force himself to lean back and open his airways instead of curling up in pain. “I’m fine. Had it before.” He’ll have it again, too, if those asshats tell anyone about it. He’ll ask Batman to have them put in solitary or something.\n“You need a blood test,” he insists. “You just inhaled poison.”\n“Takes more to be lethal,” Peter counters, which in hindsight might not be a great point. “I’m fine. Just gotta… just gotta catch my breath.”\nBatman growls in disapproval. “You can keep the mask,” he tries to reason. “Just get checked up, rest for a few hours.”\nPeter’s already shaking his head. “Home,” he gasps. “Early night. Maybe few days off. Fine.” He gives a weak grin, flashing his teeth—which is maybe not as reassuring as he’d hoped, what with the blood in his mouth and all.\nBatman opens his mouth to protest again, maybe even order him to stop being stupid, but Peter drags one arm up and rests a trembling hand on the crook of Batman’s elbow, where he’s holding Peter steady by the shoulder. \"Home,\" he repeats.\nBatman stays with him until he can breathe without rasping.\n-\n“Do you have any other spider-based weaknesses?” Batman asks him next time Peter’s out again.\nIt had taken him longer to recover from the ethyl chloride than he’d hoped—possibly because he was starving and not sleeping. Over a week had gone by since, and his voice was still a little throaty.\n“Uh, a few.” Peter rubs the back of his neck shyly. “Essential oils are pretty bad for me, and I don’t like things that are too vinegary, or lemony, or baking soda-y. I had a friend, actually. Whenever she was mad at me, she’d put on eucalyptus hand sanitizer, just to really dig it in.”\nHe gets all mushy thinking about it, remembering having to stand ten meters away from a pissed off MJ, yelling out apologies for whatever dumb thing he did. He misses her.\nAt least Batman quirks a small smile at that—an impossible feat in and of itself. “So if I ever want you to back off a case, I can spritz you with vinegar?”\nPeter hisses at him. “You do that, and I will bite you.”\n“Is there anything else?”\n“Nope,” Peter says, rather cheerful for the discussion topic. “That’s about it.”\n-\n“Okay, so there is one more thing,” Peter says one dreary, freezing night. “Just one tiny, minor detail I forgot to mention about spider weaknesses.”\nBatman levels him with a terrifying glare. Peter pretends he doesn’t notice, just shivers harder.\n“You forgot to mention that you  hibernate,\" Batman growls, and Peter winces.\n“I don’t!” He defends himself. “I just—spiders can’t thermoregulate. Causes me to shut down.”\nIf anything, Batman’s glower gets even  worse. It’s colder even than the frosty weather. “So you forgot to mention that the cold will  kill you.\"\nPeter sees his own mistake. “Only the really bad cold,” he yelps. “Otherwise, I just take a little nap, that’s all. I’m coldblooded.”\nIt was not a little nap. He’d been in the middle of patrol when he’d stopped just to take a breather, and then somehow had wound up deep asleep, tucked in behind a gargoyle, since Friday night. It was almost Sunday, now, and apparently the bats had kept an eye out. Okay, so maybe it is hibernation.\nThey’re still by the gargoyle now, sheltered from the wind just a bit. Peter winces. He feels kinda bad—must not be Batman’s idea of a good time to go looking for him and then find him passed out with an incredibly slow heart rate, very resistant to being roused.\nAt least he’d found a heart beat before he was going to take off his mask.\n“You need a warmer suit,” Batman grumbles. “A jacket. Or a way for someone to know when you’re  ‘shut down.’\"\nPeter shrugs, not too bothered. “It actually doesn’t happen all that often,” he offers, trying to reassure him. “And it’s no big deal. Just a little doze. I kind of get into nooks and crannies a lot.”\nBatman looks such a strange mix between baffled and irritated, it’s kind of funny. Honestly, Peter remembers Tony’s reaction when he’d first found him passed out in a laundry basket. It was the best sleep he’d had in weeks.\nNow that he’s awake, his body is getting colder and colder. He curves in on himself to try to conserve body heat. Gotham is like New York, only worse. It’s cold but dry, and the air prickles at Peter’s skin even through the suit.\nAnd then suddenly it doesn’t.\nPeter blinks owlishly as Batman undoes his cape and drapes it around his figure. After a stunned moment of hesitation, he wraps it around himself.\nBatman sighs, even as his rigid stance doesn’t change. “We need a way to keep an eye on you,” he resounds. “If you’re in danger, somebody needs to know.”\n“I have the earpiece,” Peter points out. “I can just call out for help.”\n“Like you did Friday?” Batman flatly counters, and okay, point, but Peter’s not going to just let him have that.\nPeter bites the inside of his cheek in heady teenage rebellion. “I didn’t need help on Friday,” he shoots back. “I’m  fine.\"\nBatman is less than impressed, if the twitching on the right side of his mouth says anything. “You could’ve died,” he says stonily. “You  could  die, next time.”\n“There won’t be a next time,” he assures with a cheery confidence. “I’ll be more careful. And besides,  if  it happens again,” which honestly it might, considering Parker Luck and also who Peter is as a person, “then you’ll find me, won’t you?”\nPeter doesn’t miss the way Batman thaws slightly at this, but he also doesn’t know how to react. He just pulls deeper into the cape.\n“I’ll try,” Batman says softly.\n“So there’s nothing to worry about,” Peter reasons smoothly.\nThere’s a moment of quiet after that. Now that Peter’s body is warming up from the low-homeostasis sleep state he was in, he’s truly appreciating the delightful warmth of the cape, which actually offers much more protection from the weather than he’d have thought.\nHe snuggles into it further, a low purr unconsciously escaping from him, barely audible above the noises of Gotham.\n“Go home, Spider-Man,” Batman tells him quietly. “Warm up.”\nFor once, Peter doesn’t argue as he straightens up. “I’m trusting you,” he warns, but there’s no real threat or bite to his voice. “Don’t follow me. I don’t think I’m up to swing.” His sleep-addled mind’s not clear enough to calculate his aim, and his Spidey Sense hasn’t been the most reliable lately.\nBatman nods, and Peter believes him.\nHe reluctantly unbundles himself from the cloak, holds it out. Batman doesn’t make a move to take it.\n“I have others,” he says, peering distrustfully at how Peter’s standing just a little off kilter from his centre of balance.\nPeter tilts his head fleetingly, and then pulls the cape back on, sighing into the warmth. “You think I could be Batman?” He cheeks, only slightly tired. He doesn’t wait for a response, only flings himself off the gargoyle—which is too high for a normal person to jump off of without something to catch themself on. He hears Batman’s breath hitch watching him fall.\nHe lands in his crouch, cloaked in dark fabric, his unnaturally strong but flexible joints absorbing the force of the impact. He suddenly feels a lot more awake.\n“Hey, this is fun!” Peter calls back up at Batman, whose slightly faster heart rate betrays his indifferent expression. “Maybe I should add a cape to my suit.” He swishes it around the way he’s seen Dr. Strange’s cloak friend do, and turns in the general direction of the firehouse—meaning to take a few wrong turns, just to be safe.\nPeter is right in that it never happens again, if only because every time the temperatures dip below freezing, Batman will track him down and tell him to go straight home.\nHe’ll take his wins where he gets them, he supposes.\n-\nThere’s a bomb.\nIt’s a trap, a minefield. Peter’s Spidey Sense has been going off just looking at the floor, but he ignores it, because he’s an idiot, because he doesn’t know how to say to the Batman: Hey, a weird sense tells me we’re in danger while infiltrating a gang warehouse. That’s weird, right? Let’s forget all this and leave. \nBatman steps on the trigger, and Peter  runs.\nHe runs towards the bomb.\nHe shoves Batman so hard he flies across the room.\nThe bomb explodes.\n-\nDistantly, Peter’s aware of the pain.\nHis leg was burned, is burning, will continue to burn.\nHis chest is lacerated, so is his stomach, so is everything about him.\nBatman is there. A furious, flying frenzy. He yells something to Peter and then he yells something to no one. He calls for help.\n“Hold on, just hold on,” he repeats like a prayer. The words stick like static to Peter's brain.\nEverything is far away, even the pain. He fades and then comes to, and then fades again and comes to again.\nHis mask is pulled off, and he stirs, blinking up at nothing.\nAt least he can see clearly, some part of Peter’s brain says, trying to rationalize the situation. And at least his breath isn’t muffled, and at least Batman is here, and he looks alright. Peter must’ve pushed him back really far, and it looks like his cape got the worst of it anyway.\nPeter’s body unconsciously reacts to the pain even as his mind can’t process it.\nHe fades, then comes to.\n-\nHe wakes up several times during surgery. They don’t have anything strong enough to keep him under, or to stop the pain. Eventually, he passes out cold, for good, one last time.\nHe wakes up two days later.\nPeter’s eyes slowly peel open, stinging and dry. He blinks owlishly at the ceiling.\n“Ow.”\nHe mutters it, but it doesn’t matter anyway because someone hears him, and then suddenly a large man is by his side.\n“What works on you?” The man desperately demands, eyes wild. “What painkillers?”\nIt doesn’t really enter Peter’s brain at first, as sluggish as it is. It takes half a minute to even come up with an answer, with how the pain suddenly and deeply sets into his bones. “Midazolam,” he gasps. “With morphine. Seven times dose.”\nThe man doesn’t question the impossibly high dosage, only scrambles to a stand in which some medical equipment lies, opening a drawer and taking out many needles and little bottles of painkillers. Peter closes his eyes, tries to separate himself from the pain as much as possible.\nIt’s always a whole ordeal to get him doped up. Back home, they could use some of their super-soldier serums—triple Captain America’s dose, generally. But with normal painkillers, they’d have to use bottles and bottles of the stuff before Peter even got affected, and not only that, but it was also unsafe to go any higher at some point. They always ran the risk of his heart just giving out, especially while under stress from injuries.\nPeter’s face spasms as the first of the injections start, and he feels steady hands grab his arm as a needle goes in. The man must have some knowledge in doing this, because his hands are clinical and he spreads the shots apart enough.\nIt takes a while, all the shots that need to be given, and injections are pretty immediate-relief. By the time the last of the shots are being finished up, the first of them are kicking in.\nPeter’s body relaxes, losing the tension he’d been holding from the pain. Midazolam should in theory knock him out, but for him it would just make him drowsy. He can still feel the pain, sharp and clear as ever, but there’s some kind of barrier between it and him.\n“Good now,” he says, as the distance between him and the pain grows even further. “Hurts less. Yay.” His voice breaks from disuse.\nHe finally opens his eyes again, squinting at the man. He kind of looks familiar, although Peter could not say from where.\n“When’s your next dose?” He asks, and his voice is tight with… something. Peter’s head spins too much to think about it.\nHe takes a moment to make sure he’s remembering it right, thinking back to the too-frequent medbay trips with Tony. “Triple dose, every two hours,” he rasps. “Four if I’m asleep.”\nThe man has a hint of a frown as he takes this in, averting his gaze from Peter, unable to meet his eyes.\nPeter blinks at him confusedly. “Who are you?”\nThe man hesitates, an unnatural stillness to his stance. “I’m Bruce,” he finally settles on. “We know each other, through our… night lives.”\nPeter has no reaction at first, thinking what on earth he could possibly mean, and then all at once, his jaw gapes. His eyes widen comically, and he chokes on his own spit. \"You’re  Batman?”\nBatman’s Super Secret Identity Bruce nods in a tentative confirmation.\nThere’s a moment where Peter just stares at Bruce, who looks like he’s seen better days, trying to see it. His brains make connections far too slowly, comparing every possible feature. And then he bursts into giggles.\n“You’re Batman,” he repeats between little gasping laughs. “You’re vengeance, you’re the night. That Batman.”\nBruce should probably be offended by his reaction, but if anything, he looks sick. “Do you remember what happened?” He asks in a low voice, something shameful etched into his face.\nPeter’s a bit taken aback by how serious his expression is, until he realizes he  does  remember what happened, and decides maybe he should sober up, too. “The bomb,” he says. “It was a trap. I felt it just before it went off.”\n“It was touch and go there for a while,” Bruce says quietly, and  oh, the weird expression on his face is  guilt. Because of course it is. “An associate doctor performed surgery on you, and then we brought you home to recover.”\nPeter notes the room he’s in then. It’s absurdly expensive feeling, in that distinctly Old Money classy way and not Tony’s futurist one. He tucks that away for later.\n“It ended up alright,” Peter tries to reassure at that horribly grief-stricken look on Bruce’s face. “Thanks for, like, not letting me die. But we’re both not dead so everything’s fine.”\nIf anything, Bruce looks even worse, bitter remorse and sorrow written in every line. He opens his mouth, closes it, then opens it again. “You’re not fine,” he breathes, pain in his voice. “You were  blown up.\"\nPeter isn’t too bothered about it. He’s definitely had worse—like when he’d died, for example. And even the pain is nothing compared to the spider bite.\n“You nearly bled out on the table,” Bruce presses on. “You sustained major lacerations and abrasions throughout your entire body, but… your left leg was directly on top of the explosion.”\n“That explains why it hurts so much,” Peter remarks dryly. Bruce looks like he’s been punched in the face.\nHe takes a small stuttering breath, obviously steeling himself for something—which is weird, because Peter wouldn’t have thought Batman needed to steel himself for anything.\n“Peter,” he begins slowly, and he startles at the use of his real name, even though of course Batman would’ve figured it out by now. “Your leg was too close to the bomb, and it was—it’s gone. Your leg is gone. I’m so sorry.”\nPeter stares at him flatly for a second, because that can’t be right. He still feels his leg—it hurts like  hell. And then he jerks his hands to move to push away the blanket from off his body, because he needs to  see.\nStrong hands push back against them, trying to keep Peter lying down, not agitate his number of bandages, but even half-blown-up and doped up, he’s stronger than the bat on a good day. Eventually, Bruce seems to realize this, and instead of holding him back, he gently helps him take the blanket off.\nThere’s a massive bandage where half of his leg should be. It ends in a stump just less than mid thigh.\nPeter stares at it.\n“Well, that sucks,” he finally says, taking pity on Bruce, who looks like the silence is eating him alive.\nBruce is averting his eyes again, his face pale and drained of blood. “I’m sorry,” he repeats again, voice cracking.\nPeter jerks his head up at the raw display of emotion from Batman—fucking Batman. He looks like he’s about to fall apart.\n“It’s not your fault,” he immediately says, alarmed. Peter remembers similar conversations with Tony, how that man carried a guilt complex as big as Peter’s own. “Don’t worry about it. I’ll be back on my feet—well, foot,” for now at least, “in like a week.”\nPeter’s easy dismissal of his injury only seems to distress Bruce more. “You can stay as long as you want,” he says quietly. “Actually, you won’t be leaving unless I know you have someone to look after you.” Peter winces—that’s not going to happen, and of course Batman notices and correctly interprets it.\n“I’m fine,” he insists again. Tony tried to ban him from saying that once, and it didn’t go so well. “Honestly. Like yeah, it sucks, and it hurts like a bitch, and I’ll have to take a few months off from being Spider-Man…” Peter trails off in contemplation.\nBruce looks confoundedly upset. “Peter, you lost your leg,” he says as gently as he can. “You won’t go back out there.”\n“What?” Peter is immediately indignant. “I can’t just  stop  being Spider-Man.”\n“You need to.” Bruce’s voice is sorrowful, but resolute. “Don’t worry about Crime Alley, I’ll take care of it. It’s the least I can do.”\nPeter blinks at him again. In his drug-addled state, he doesn’t quite know what else to do. “Yeah, for like, a month or two. But then I’ll be back in the game. I can’t let  one  bad experience put me off for good.”\n“This isn’t a  bad experience,\" Batman stresses, his voice tight. There’s a strain to how he holds his body that’s making Peter uncomfortable. “Of course we’ll get you the best care we can find, and if you want a prosthetic, you’ll have one. But I can’t let you go out into the field with one leg.”\nPeter cuts off from his prepared argument. “Oh,” he blurts out. “I think I know what the problem is.” He looks down at his missing leg again. “Yeah, it’s gonna grow back.”\nBruce looks like he’s been hit. “I’m sorry?”\n\"My leg.\" He pokes at the bandage, wincing when a sharp pain courses through his body. That's on him; he doesn't know what he was expecting. \"You know how, like, if spiders lose their legs, they mold and grow it back? Yeah, my skin's gonna peel off at some point, and I'll be good as new.\"\nBruce stares at him with something akin to horror. \"Your skin peels off?\"\n\"No,\" Peter immediately assures. \"Sorry, I don't know why I said that. I just felt like lying. But my leg will grow back, that part's true. It's just gonna hurt and itch like hell for a while. I actually don't know how long it takes—it took me a month for my teeth to come back in the last time, so probably at least that long.\"\n“Your legs grow back.”\nPeter nods.\n“And your teeth.”\n“My eyes, too,” he chimes in.\nBruce’s expression is a mix of one of a man who’s just been exonerated in the line for a guillotine, as well as of a man who’d just been told that Peter could grow back his leg like a spider.\n“You… could have led with that.”\n-\nTrue to his word, Bruce doesn’t let Peter leave his house—which turns out to be a mansion. He also turns out to be Bruce fucking Wayne, but that’s neither here nor there.\nPeter kind of gets it. If something like this happened at home, there’s no way Tony would let him leave his sight for months. He’d be so grounded. Also, something like this has kind of already happened at home, what with him dying and all, so when he gets back he has micromanaging and helicopter parenting to look forward to—from both Tony and May.\nBruce still seems to permanently carry the guilt of Peter’s injury around with him. He was the one who stepped on the bomb, after all, and Peter had gotten hurt pushing him out of the way, while Bruce had ended up with only a few burns, stitches, a fair amount of bruises.\nThe guilt complex is a part of the gig, probably. If they didn’t feel guilty, that might make them the bad guys. Even so, Peter tries his best to reassure Bruce like he would’ve Tony—through gentle humour and good-natured acknowledgement of what happened.\nHe also meets the family out-of-suit. He’d never actually interacted all that much with Robin, but he's warming up to Damian in a way that Damian definitely isn't warming up to him. Or maybe he is. At least he isn't yowling at him like a cat, the way he does to Tim.\nSurprisingly, he’s met everyone else out of costume before.\nThere’s a lot of yelling when he sees Tim and Duke.\nPeter isn’t allowed to go to school yet—Bruce pulled some strings to get him excused and able to learn from home. Probably a good thing, not to let them know that his left leg is currently missing but not for long. Tim and Duke are still going, of course, because it’s also apparently not a great idea to have their absences coincide on each other.\n“You could use the wheelchair, you know,” Bruce says, eyeing how Peter is precariously keeping balance of a hoard of notebooks in his arms while hopping on his one leg.\nPeter shrugs, and then nearly topples over trying to keep all of his books together. “I like hopping.” Except for when he falls. His balance might be impeccable on two legs, but this was rather beginning to become tiresome—and he doesn't like the blow to his dignity whenever he crawls outside of his room. “It’s too much work to get the chair.”\nBruce sighs long-sufferingly, walking over to Peter and taking the books from his arms. Peter lets him, gratefully. “Are you going back to your room?”\nPeter’s room is too big and too expensive and far too cushy, and he doesn’t like to spend much time in it, except for the days he can’t get out of bed. “The lab,” he says instead, ignoring Bruce’s frown at that. He doesn’t like it when Peter turns into a little lab gremlin. “I’ve got a new project.”\nBruce’s frown sets in even deeper at that. A new project for Peter means no sleep, no eating, no leaving the lab—and given the caliber of this next one, Peter is probably going to be very, very busy. He’d learned from Tony, after all. Bruce sets down the notebooks on a table, overlooking Peter’s objections.\n“I need those, you know,” he remarks pointedly, starting to skip closer to the table to get them himself.\nInstead of stopping him, Bruce takes him in his arms and picks him up smoothly.\n“Or you can do that,” Peter sulks. He’s been getting hauled places against his will for the past three weeks, and he’s more than a little grumbly about it. Sometimes he’ll begrudgingly allow it, if only because there are lots of stairs in the manor, but really there’s no better way to make him feel like more of a child. Especially when all Bruce has to do to get him out of the lab is just pick him up like a sack of potatoes.\nThe worst are when Duke or Tim are around. They’re not mean about it, but those are his  friends,  and he looks like a  baby. Although he does enjoy making Dick give him a piggyback ride, if only because he gets such a look about it. He also enjoys requesting tricks while he’s stuck on—some of which are actually obliged.\nTo his surprise, Bruce doesn’t carry him to his room—instead, he turns into the makeshift medbay  beside  Peter’s room. Great.\n“I’m changing your bandage,” Bruce informs like it wasn’t obvious the moment they stepped in the room. He gently sets Peter down on a couch. “And then you get three hours.  Three,” he warns, seeing Peter perk up. It doesn’t get to him, he’ll probably be able to push it, or sneak in while everyone’s out being bats. “And you have to take a break for dinner.”\nPeter shrugs, obliging. He wiggles impatiently as the bandage comes off of the stub of his leg.\nIt’s definitely growing. The stump is just an inch or two longer than it was since the explosion, which was almost a month ago, although it is healing faster with time. At this rate, he’ll have to put off being Spider-Man for a long while—which is why it’s the perfect time to start on his project.\n“I’m going to need a full list of all of your spider powers,” Bruce says, hands gently checking the new skin. It’s red and tender, and more than a little sore. “And a real explanation of how you got them.”\nPeter snorts. “Radioactive spider bite,” he gives in. “I wasn't actually born from a spider. And you know most of them.”\n“I want numbers,” Bruce insists. He takes a soft towel and some distilled water, gently washes the limb.\n“Actually, I do have some measurement,” Peter admits. “Mr. Stark couldn’t have done a gene test on me, but we did a few physicals. We didn’t check everything, but I can run 250 miles per hour—except only for fifteen minutes before collapsing—and jump 85 meters. I can also breathe underwater for a scary amount of time, and we didn’t have anything heavy enough to test my strength but I  have  lifted up a building before.”\nBruce pauses at the quantitative data he clearly wasn’t expecting to be getting. “That is terrifying.”\nPeter shrugs. “Proportional to a spider,” he says cheerily.\nIt’s a quick affair—checking the stump, washing it, rebandaging it to protect the sensitive and still-healing skin. When it’s done, Peter fiddles as he watches Bruce put away the supplies.\n“Lab time now?” He asks hopefully, grinning when Bruce sighs in a way which he knows means he’s conceding. He raises his arms like a toddler, willingly, this time, settling into Bruce’s hold on him.\nPeter knowing about all of their outings as bats means he’s allowed access to the cooler lab used to make all of the bat stuff. Bruce carries him down and sets him on a rolling chair so that he can get around by himself.\n“I’ll get your notebooks,” he says before leaving the room.\nInside are several half-finished projects that Peter’s been tinkering with in his spare time, as well as more than a few bat gadgets, some of which Peter’s been taking apart. He rolls to the work bench, pushing up his sleeves.\nBruce returns quickly, dropping his notebooks off on the table. “What’s your new project?”\n“Hm?” Peter looks up from where he’s been getting more work paper. “Oh, uh, it’s a pretty big one. I’m looking for a way home.”\nThere’s a pause. “To Queens?”\nPeter nods. “There’s just something I have to do before I can go home.” He looks wistfully at his hands, wringing together in his lap. “Mr. Stark wouldn’t give up looking for me if he thought there was a chance he could find me, but he also just might not think there  is  a chance. And I suddenly have all this free time, so I figured if he can’t find me, then I’m going to find him.”\nHe says this with a steadfast determination. Honestly, the laws of Parker Luck dictates that nothing ever really works out for him, even when it does—but the prerequisites of being a Parker in the first place also states that Parkers don’t believe in no-win situations. This can be done, it has to be possible.\nBruce hesitates. “And if you do figure it out?” He speaks with an odd tone.\n“Then I go home,” Peter closes his eyes briefly, thinks about the paralyzing fear of May being snapped. “I was worried there isn’t much of a home to go back to but… if Mr. Stark’s there, then I can always make one, right?” He can find another family. And he can try harder than anything to get May back, to get  everyone  back.\n“You have a lot of faith in him,” Bruce observes, a note of… something in his voice. He looks sullen, and then suddenly shifts to masked mortification—for what, Peter doesn’t know.\nPeter chews on the inside of his cheek. “I trust him,” he decides, words forceful. “We never really talked about it, but… he was kinda like a dad to me. I miss him a lot. And he’s like the smartest and coolest person ever, so if anyone can figure it out, it’s him.”\nBruce’s expression is like he’s swallowing a lemon. Or a golf ball. Or something just overall too big and awkward and bitter. A grapefruit? “Will you ever tell me what happened in Queens?” He asks, a hint of bitterness coming through his normally carefully composed voice.\n“Sooner or later,” Peter allows. “If I get closer to cracking my way home, maybe. Best case scenario, it’ll only take a few months—but it’s most likely that it’ll take a while to make any kind of heads on this. Could be years.”\nStrangely, Bruce relaxes somewhat at this. “Take as long as you need,” he says emphatically. “You’re welcome here as long as you’d like.”\n“Yeah, thanks,” Peter replies, flashing him a small, grateful smile.\nBruce suddenly clears his throat, becoming a lot more awkward, and makes his way to leave. “Three hours,” he reminds. “And I’ll be back to take you down for dinner. Tim and Duke will also be wanting to spend some time with you.”\nPeter brightens up at that—Tim and Duke coming back after school are the highlights of his otherwise boring days.\n“And no sneaking back in at night,” Bruce adds, noting Peter’s scowl at this. “I’ll find out.”\n“You can’t stop me,” he shoots back. “I can crawl on the ceiling.” Even though he very much can stop him, can literally lock him out of the lab, and while Peter could find a way to break in, he’d also be extremely perceptible to just being picked up and carried back to his bed again.\nBruce seems to realize this, because he doesn’t deign a response back—only gives Peter a  look  and then leaves.\nPeter swivels his chair back around to the desk. “Okay,” he mutters, opening his notebooks to where more than a few designs and theories have been sketched out. “Home.”\nHe gets to work.\n\nIn a semi-alternate universe...\n\n-\n\"They're going to be back any second,\" Dick warns to the group. \"We need a game plan.\"\nTim just squints at Peter. \"Can't you just break the bars?\"\nPeter considers it, but then shakes his head. \"They're charged too high,\" he says ruefully, listening to the distinct sizzling sound from the electrically charged mettal. \"I'd fry up, probably pass out before I can finish the job.\" The kidnappers Peter doesn't know who they are yet have actually thought somewhat far ahead.\nBruce scowls menacingly. It really is a predicament they've gotten into—every single one of the bat crew plus Peter, trapped in a cell by some bad guys who plan to unmask them publicly, live, on whatever channel they hacked into. No back up is coming for them now.\nPeter wracks his brain, comes up with an idea, almost immediately scraps it. \"I have a plan,\" he says slowly. \"I don't know how well it'll work, but... just trust me. Let them come for me first.\"\n\"What are you planning?\" Bruce growls, never one to be left out from scheming. Peter just stares at him blankly from the mask and flashes him a thumbs up.\nWhen the masked men come, Peter makes a point to be as mouthy as possible. All it takes are a few too many fuck you's and also a few personal attacks to their fashion sense.\n\"Alright, you're first,\" the lead guy snarls, grabbing Peter by the handcuffs he can definitely break out of. He just has to wait for the right timing to catch them off guard.\nThey lead him to a chair, pretty much throwing him down before strapping it to him. He can hear the sharp, angry inhales coming from the peanut gallery in their cell, but he pays the bats no mind. Just focuses on doing something that he knows will leave his skin feeling itchy for weeks.\nOne of the henchmen turn the camera on, points it straight at Peter. he gives a little wave from where his hands are tied.\n\"Starting off our entertainment tonight is the Spider-Man,\" the lead guy sneers. He hunches over to Peter and threateningly grasps him by the jaw. \"Are you prepared to be exposed, bug boy?\"\n\"I've made my peace with it,\" Peter snarks. \"Stop dancing around and just get it over with, buddy. You're boring me, and I'm hungry.\"\nThe guy thunders, socking him in the stomach to Batman's furious growl before gripping the edge of the mask from where it peaks out under the rest of his suit. Peter prepares himself.\nThe mask lifts over his head.\n\n\"WHAT THE FUCK?\"\n\nPeter's face is nonexistent, mass dissolving into an army of spiders that pour out of his body, spilling out of his suit, leaving it entirely empty. During the moment of sheer terror and confusion from the villains of the night, Peter sends a few of his spidery body parts to pick up the keys to the cell from where they've been dropped on the floor by the men in their eagerness to get the fuck away from Peter's consciousness scattered into several thousand spiders.\nHe carries the keys over to the cell, where the bats are watching in open-mouthed horror.\n\"Here you go,\" Peter says, using a fair amount of spiders to morph into a vague-humanoid shape, putting the key into the lock and turning it. A few of the spiders zap and die in the process, and Peter feels the pain acutely, like sharp needles in various points of his body. But the rest of him isn't all that affected.\nThe door swings open.\nThe fight is over before it even began.\nPeter pulls his spider suit back on before morphing back into his own body.\n\"Eugh,\" he says, making a face. \"I hate doing that.\"\nEveryone is staring at him. Even Damian looks at him with an expression that goes past his usual disgust, and is just landing on terrified.\nPeter distantly realizes that he's never quite mentioned this power to them.\nHe embarrassedly rubs the back of his neck. \"Oh, did I forget to mention that I can turn into a body of spiders that have my consciousness?\" It's rhetorical. He already knows he didn't tell them.\nThere's a long, heavy silence. Nobody's even paying attention to the unconscious bad guys who'd been minutes away from unmasking them earlier.\n\"Spider-Man,\" Bruce says, and his voice is uneven in the way that Batman's voice is never uneven. There's no growl at all. \"What the fuck.\""
}