{
    "id": "33358210",
    "url": "https://archiveofourown.org/works/33358210?view_full_work=true",
    "author": [
        "katydid"
    ],
    "title": "Awful for One",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Midoriya Izuku & Sensei | All For One",
        "Midoriya Izuku & Yagi Toshinori | All Might",
        "Midoriya Izuku & Shigaraki Tomura | Shimura Tenko",
        "First One For All User & Midoriya Izuku",
        "Midoriya Izuku & Todoroki Shouto"
    ],
    "characters": [
        "Midoriya Izuku",
        "Shigaraki Tomura | Shimura Tenko",
        "Yagi Toshinori | All Might",
        "Sensei | All For One",
        "Garaki Kyuudai | Ujiko Daruma",
        "First One For All User (My Hero Academia)",
        "Banjou Daigorou | Lariat",
        "Shimura Nana",
        "Todoroki Shouto"
    ],
    "additional_tags": [
        "Midoriya Izuku is So Done",
        "Midoriya Izuku is a Little Shit",
        "shameless crack",
        "misuse of Twitter",
        "Pretend Villain Midoriya Izuku",
        "Hidden/Fake Identity",
        "AFO suffers almost as much as he deserves",
        "One For All Quirk Haunted by Past One For All Users' Ghosts (My Hero Academia)",
        "dadmight",
        "Sensei | All for One is Mistaken for Hisashi Midoriya",
        "Actual truth is left ambiguous",
        "Chaotic Midoriya Izuku",
        "Corrupt Hero Public Safety Commission (My Hero Academia)",
        "Conspiracy Theorist Todoroki Shouto",
        "Drugged Midoriya Izuku",
        "Timeline What Timeline"
    ],
    "language": "English",
    "series": "Part 1 of Izuku Midoriya is So Done: A Series of Alternate UniversesPart 1 of All for One Versus Social Media",
    "published": "2021-08-19",
    "completed": "2023-03-01",
    "words": "8,596",
    "chapters": "2/2",
    "comments": "806",
    "kudos": "15,534",
    "bookmarks": "2,707",
    "hits": "127,764",
    "summary": "<p>While high on painkillers at the hospital, Izuku creates a troll twitter account pretending to be All for One. The League of Villains, the Hero Public Safety Commission, and All Might all fall for it.</p>\n<p>Shouto pretends to be Endeavor on twitter and Izuku trolls the HPSC.</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>Credit for this story idea goes to my dear sister, my first reader.</p>\n<p>I didn’t put this story in my <a href=\"https://archiveofourown.org/series/2223669\" rel=\"nofollow\">Dad for One series</a> because I deliberately left it ambiguous if All for One is Hisashi Midoriya or not. Personally, I think it’s hilarious either way for different reasons. In the Not Dad for One AU, All for One launches his fake bomb of evidence at the same time that Izuku develops Black Whip. People see a boy with All Might’s quirk and multiple quirks and completely believe that he must be the test tube baby of All Might and All for One. Izuku goes on a troll rampage in retaliation, and by the time the dust clears there are enough conspiracy theories to make Shouto Todoroki weep from joy.</p>\n<p>In the Dad for One AU, All of One can’t convince anyone that he’s Hisashi Midoriya. The Hero Public Safety Commission already released a statement saying that All for One is Izuku’s father and then released another statement taking it back. They’re not going to change their minds again—it would make them look too foolish. The story has been entrenched in the public’s mind as notorious fake news. No one will ever be able to convince Izuku of it because he’ll always believe that All for One is just trolling him back.</p>\n<p>The critical difference between these AUs is a matter of timing. Dad for One tried to keep Izuku’s relationship to him secret until the right time to prevent him from being taken hostage. The non-related All for One could care less so he spews out his fake story immediately. Ironically, this results in people only believing All for One is Izuku’s father in the AU where he isn’t. Izuku, of course, doesn’t believe it whether it’s true or not. That was Izuku’s lie first and he’s very miffed at All for One for trying to steal it.</p>\n<p>I had no plans to continue this fic, but it won a poll on my tumblr (<a href=\"https://www.tumblr.com/aimportantdragoncollector\" rel=\"nofollow\">aimportantdragoncollector</a>) for which of my oneshots should get a chapter two. I’m grateful to everyone who loves this cracky story. I refuse to answer any questions about why a oneshots series now has a second chapter. I also refuse to answer any questions about the timeline, this takes place in crackverse.</p>\n<p>Thank you to BucketOfMud and RianMoeru for helping me come up with twitter names, and my sister for brainstorming the plot with me.</p>",
    "text": "The whole mess never would have happened if the hospital hadn’t put Izuku Midoriya on oxycodone.\nAfter a major attack on U.A. by the League of Villains left dozens of students seriously injured, Recovery Girl couldn’t get to all of them fast enough. An overworked nurse added the strongest available painkiller to the IV of the poor green-haired boy with two broken arms.\nIf Inko Midoriya had been present, she would have told them absolutely no oxycodone, because her son had a strange reaction to it, and no one wanted a repeat of the time a six-year-old vigilante had roamed the neighborhood creating net traps to capture a purse snatcher, two underwear thieves, and an overly aggressive dog. Alas, Inko was not consulted until it was far, far too late.\nIzuku opened his eyes. He stared at the white ceiling of the hospital, aka his home away from home. His head spun and his tongue felt dry. He couldn’t move his arms. A tingling covered his body. Euphoria raced through his veins, bringing with it a drug-induced sense of confidence and a craving for chaos and destruction.\n“All for One sucks,” Izuku said.\n“Command not recognized,” his phone replied. The same kind nurse who’d give Izuku oxycodone had also enabled voice commands on his phone so the patient with the broken arms could at least have some entertainment.\n“I’m going to tell the whole world how much All for One sucks.” Izuku was riding high on the self-righteous fury of a young hero who’d seen the people he cared about hurt by the League of Villains. He was also just plain high. “Gonna tweet about it.”\n“Opening twitter,” the phone said. “You are not logged into twitter. Would you like to enter a username and password or create a new account?”\n“Create a new account. I’m going to call it ‘Awful for One.’” Izuku giggled. In his floaty state of mind, this seemed absolutely hilarious.\nBy the time Izuku stopped laughing and babbling nonsense, he dimly registered a mechanical voice saying, “Your new account has been created. What would you like to tweet?”\n“Send tweet: I’m All for One! I want to rule Japan, but I can’t fasten a tie!” Izuku laughed even harder.\n“Tweet sent.”\n“Tell them…tell them I’m an overgrown chuunibyou who loves monologuing…” Izuku frowned. Even in his inebriated state, this didn’t seem quite cutting enough. “No, wait. Cancel that tweet.”\n“Tweet deleted.”\nIzuku knew he could come up with something better. Something all the more vicious for being true. His thoughts soared at hyperactive speed. “I’m highly disappointed in the performance of the League of Villains today. What kind of lame ass clowns attack a school full of children and get their asses kicked? Particularly embarrassing was how the League of Villains got in each other’s way, culminating when Tomura decayed a wall onto—”\n“Character limited reached.”\nIzuku blinked owlishly. He desperately needed to scratch his nose, but his arms wouldn’t move. “Send what you have to Tomura Shigaraki, then.”\n“Tweet sent tagging Tomura Shigaraki, account name DecayHands.”\n“Start new tweet. Critique of League of Villains Performance, 1/5. Tomura had the single worst performance today. When he decayed a wall onto Mr. Compress and Twice, he turned the tide of battle in favor of the heroes. Maybe he should go seek employment at U.A.”\n“Tweet sent.”\n“2/5. Dabi chased his younger brother around like a headless chicken until he walked straight into a trap laid by Izuku Midoriya, who was clearly the only intelligent person on the battlefield that day.”\n“Tweet sent.”\n“3/5. Toga dedicated herself to creeping on students she found attractive rather than fighting, and Twice’s pitifully obvious puppy crush led him to cover for her mistakes. Tell them both to play kissy face on their own time.”\n“Tweet sent.”\n“4/5. Mr. Compress’ trench coat got in the way of his fighting and he needs to acquire some trick besides turning people into marbles. He doesn’t have as much talent in his whole body as his great-great-grandfather had in his pinky.” Izuku was especially proud of that last insult because it sounded like something an immortal supervillain would say.\n“Tweet sent.”\n“5/5. Spinner was completely fucking useless. I don’t know why we keep him around. I’d call him comic relief except he’s not funny.”\n“Tweet sent. You have received a reply to your tweet. DecayHands says, ‘Sensei, I understand that you’re disappointed in us, but please don’t air the dirty laundry publicly.’ You have received a reply to your tweet. IHateEndeavor says, ‘Shiggy you moron, it’s a troll account. Ignore it.’”\nIzuku’s eyes shot open. They doubted the verity of his account, did they? He knew how to prove himself! “Reply to DecayHands: Would a fake know that I instructed you to obtain One for All from the current nineth holder?”\n“You have received a reply to your tweet. DecayHands says, ‘It really is Sensei! I’m sorry for disappointing you! I’ll do anything to make it up to you!’”\nAnything, eh? Izuku’s smile widened. “Reply to DecayHands: Your fashion sense is a disgrace. What are you going for, goth NEET? Next battle, I want you to wear—” Izuku’s brain short-circuited as he tried to think of the ugliest possible villain costume on the fly. He’d always been told his own fashion sense wasn’t the best. “—surprise me. Model yourself after a combination of Wash and Minoru Mineta but more even more purple.”\n“Tweet sent.”\n“Reply: From now on, you must obey Izuku Midoriya as you would me because—” Izuku’s painkiller-hazed mind strained. Because he’s awesome didn’t seem like a very plausible explanation. “Because he’s my long-lost son.” Brilliant!\n“Tweet sent.”\nIzuku was on a high (quite literally). He just knew he could top himself. It would only take one more push. “I would like to confess my love to Doctor Kyudai Garaki, the beloved of my immortal life.” Perfect!\n“You have reached five thousand, eight hundred, and six followers. Would you like to follow any of them back?”\nIzuku laughed so hard he passed out.\nAll Might stared at his computer screen with horror. Nezu had forwarded a link to a twitter account with a simple question mark. All Might would like to believe it was all a prank, but only All for One would know about One for All.\nWith shaking hands, All Might emailed the Hero Public Safety Commission that he believed this account genuinely belonged to All for One.\nThen he headed to the library to look up books on how to talk to children about villainous parents. After such a devastating public reveal, young Midoriya would require all his support!\nThe League of Villains was in a state of disarray. Spinner curled up in a ball in the corner, muttering, “All for One thinks I’m useless…”\nToga spun her knife. “How dare he try to restrict my pursuit of my dreams?”\nDabi stood over them, shouting, “It’s not real! The account is clearly fake! What’s wrong with all of you?”\nMr. Compress shook his head sadly. “It must be real, because his analysis of my performance today was spot on. I need to go practice some more.”\nTwice said, “I think the account is real,” followed by, “Ha! That thing is faker than a porn star’s breasts!”\nTomura ignored all of it, because he knew the truth. No one besides Sensei would know about One for All. He added a giant diaper and a washing machine to his amazon shopping cart, hoping he was along the right track for his new costume. He had a new little brother, so he needed to look good for the next family reunion.\nIt looked like the family might get even bigger soon, too. Dr. Garaki? A strange choice for love, but Tomura just wanted his sensei to be happy.\nYawning, Izuku stretched his arms. Recovery Girl had come by to heal him while he’d been asleep, how nice. His phone buzzed.\nLooking over, Izuku saw that he had over three million notifications.\nThe events of yesterday rushed back in an opioid-blurred haze. Had he randomly decided to pretend to be All for One’s son? And Tomura Shigaraki had brought it?\nAs he scrolled through his new troll twitter account, his heart rate kept accelerating. Twitter had verified the account as belonging to All for One? The Hero Public Safety Commission had issued a statement asking civilians not to follow the account while they filed a suit to get it deleted? The request had clearly backfired on them: Izuku had several million followers. The count rose even as he watched it.\nHis finger trembled over settings, about to delete this account before anyone ever found out what he’d done.\n“Psst! Nineth!” The ghostly figure of the First One for All user waved at him. Yoichi Shigaraki flickered in and out of existence. “Can you see me? We’re still working out the kinks of how to manifest when you’re awake.”\n“Ahhhhhhhhhhhh! First!” Izuku dropped his phone. “I’m so sorry about what I did, I was high on painkillers, it will never happen again! I’m about to delete the account!”\n“You are?” Yoichi tilted his head, frowning. “That’s too bad. I came to give you tips on how to make it look even more real.”\nThe painkillers were out of Izuku’s system at this point. He had no excuse for what he said next. “That does sound like fun.”\nIn the waiting room for those about to be released from the hospital, Shouto Todoroki scrolled on his phone. A long hiss emerged from his mouth.\n“What’s wrong?” Tenya asked, looking over his shoulder.\n“All for One has a new twitter account!” Shouto pointed with a shaking finger. “Izuku is his long-lost son! This ruins several of my favorite conspiracies. Unless…do you think there’s any chance All for One and All Might had a test tube baby?”\n“What?” Katsuki stomped over. “No, Hisashi Midoriya isn’t All for One, I’ve met the man! Gimmee that.” He snatched Shouto’s phone. “Dammit, that’s fucking Deku tweeting!”\n“But twitter verified the account as belonging to All for One,” Tenya protested. “Izuku would never pretend to be someone else. He’s far too honorable.”\nKatsuki snorted. “You’ve only ever known his good boy side. You don’t know what he’s like when he snaps. Did someone in this shitty hospital give him oxycodone? I swear, we’ll be lucky if he doesn’t burn this whole building down if he’s on oxycodone.”\nShouto muttered, “I need to update my conspiracy theorist blog.”\n“Cool down.” Katsuki rolled his eyes. “Just wait, after the painkillers wear off, the shit nerd will delete the account and this will all blow over.”\nYoichi hovered over Izuku’s bed. “Before we start the good stuff, let’s add some more content to make this look convincing. Old twenty-first century memes. But no good memes for my brother. Stupid memes! Google ‘Be Friend with Stupid People, Feel Like Genius All the Time.’ Yes, the bad grammar is deliberate.”\n“Ooo, that one is perfect for the All for One and the League of Villains.” Izuku laughed as he edited the image to show a picture of the league as the “stupid people.”\n“Next up: ‘Working on my five year plan. 1. ? 2. ? 3. ? 4. ? 5. And then they’ll all be sorry.’”\nBanjo popped up next to Yoichi. “Are we embarrassing All for One? Can I tell the story about the time his shoe got stuck on an escalator?”\nYoichi shook his head. “I would love to tell that story, but we need to make this account look real, and he’d never willingly tell that to the public. I’ve been dictating to Izuku the story of the time he stole the Hero Public Safety Commission’s experimental quirk-enhancing serum.”\n“Won’t that story make him look good, though?” Banjo asked.\n“Not after I explain how the serum gave him permanent baldness and hemorrhoids.”\n“But it didn’t…oh!” Banjo said with enlightenment.\nIzuku typed rapidly. “This will embarrass the Hero Public Safety Commission, too. I love it.”\n“All this is just the appetizer.” Yoichi steepled his fingers. “Now for the main course. Dictate: ‘I’ve been pining lately for a colleague of mine. That domelike head, the cute goggles, the majestic whiskers’…”\nIzuku hesitated. “The Dr. Garaki love confession was one of my less convincing lies. Are you sure this won’t expose us?”\n“We only need to convince one person. And that won’t be hard. People believe what they want to believe, and I’ve seen how that creepy doctor looks at my brother.” Yoichi’s grin became diabolical. “Next tweet: ‘My desire grows stronger with every day, but I fear disrupting our working relationship as colleagues. If you’re reading this, and you don’t return my feelings, then we can pretend this never happened. But if you feel the same way, then give me a signal. A sign. Sneak up behind me while we’re at work, take me into your adorable potato arms, and kiss me like we’re both still twenty.”\n“I see what you’re doing.” Banjo hummed. “If we can just pull it off, I’ll be satisfied for the rest of my unlife.”\nAs Izuku posted his latest tweet, Yoichi cackled maniacally. “Ha! This will teach you to stick me in a bank vault, big brother!”\nEven Izuku couldn’t help shuddering. Note to self: Never piss the First off.\nDr. Garaki’s heart rate accelerated as All for One entered his laboratory. He lowered his face to his desk to hide his blush.\nAt first, Dr. Garaki hadn’t believed the new twitter account could be real. But then it had filled with stories of the past, stories that no one alive knew except for himself and All for One. Dr. Garaki concluded that the outward absurdity of the account had all been to disguise a secret message meant for exactly one person. The only other person who would understand those old secrets and memes.\nLately, All for One had been a tad short with Dr. Garaki, even asking him to “stop staring so creepily.” But Dr. Garaki completely understood why—his employer must be impatiently waiting for an answer to his confession.\nOf course, it wasn’t as if Dr. Garaki had never thought about it. The master was an exceptionally handsome man. But after suppressing his feelings so long, it was difficult to work up the nerve.\nDr. Garaki’s breathing came out rougher.\n“How should we troll Tomura?” Izuku asked, tapping his chin. “I thought about giving more scathing critiques, but I’m concerned that he might learn something from them.”\n“Let’s embarrass him,” Yoichi said.\nNana appeared. “That’s my job! I’m a grandmother—I exist to embarrass that boy. Toshi has been looking through old records of Tomura’s childhood before that bastard All for One appeared.” Her face pinched. “There’s loads of great humiliation material.”\n“Ready when you are,” Izuku said.\nNana began, “When my protégé Tomura was a cute little four year old, he wanted to marry the family dog Mon-chan when he grew up—”\nAs Izuku typed, he thought, Note to self: Also never piss Nana off.\nIzuku didn’t know why All Might had asked for a private talk in the teacher’s lounge. He understood even less why All Might had expressed constant concerns for his health throughout the day. He’d been cleared for release from the hospital, the same as everyone else.\nHis mentor stood with his hands behind his back in front of a huge stack of books. They had titles like A History of Discrimination Against Quirks Labeled as Villainous and How to Have Difficult Conversations with Your Child.\nIn a faltering voice, All Might asked, “Young Midoriya, have you seen the twitter account Awful for One?”\n“That? I thought it was funny. Did you not think it was funny?” Izuku wondered if he was about to get in trouble for what he’d done.\nAll Might bit his lip. “I’m not sure if you’ve yet seen what he said about you, but I want you to know what whether he’s lying or not, it makes no difference to me.”\n“What?” Izuku paled as he realized the meaning behind his mentor’s words. “You think that’s real? I created that twitter account as a joke! I was trolling Tomura!”\nAll Might sagged into his seat. “Oh.”\n“I’m sorry! I never meant to trick you, too.” Izuku waved his hands. He bounced back and forth with nervous energy.\nAll Might ran a hand down his face. “Tomura believes that it’s real? Am I understanding that correctly?”\n“Yeah, I’ve been having so much fun embarrassing him.”\n“Young Midoriya, did it ever occur to you to lead Tomura into a police trap?”\n“Ohhhhhhhhhhhhh,” Izuku said.\nTomura did not know what to make of his sensei’s instructions to summon the League of Villains to a picnic in an industrial park. It all seemed very random. But Sensei had been firm that everyone show up and that he must bring mochi.\nHopefully, Tomura would have a chance to ask Sensei to stop telling those stories about his childhood online. The leader clearly thought they were cute, but they were making the rest of the League of Villains give Tomura funny looks.\nThe food was already spread out at the park, but All for One hadn’t yet arrived. The League of Villains sampled the picnic, barely noticing how they became drowsier with each bite. They had all fallen unconscious when the police arrived to pick them up.\nStanding among the tanks of Nomu, All for One wondered where the hell Tomura and the rest of his minions had gotten off to. He’d been meaning to talk to the boy about his new costume. All for One tried to let his student make his own choices and mistakes. But that monstrosity was a step too far.\nDistracted in his thoughts, All for One didn’t notice Dr. Garaki sneaking up behind him.\nA horrified scream echoed through the night.\nOMAKE TIME!\nOmake: Nezu Knows All\nNezu: I suspect this twitter account is false. Awful for One, can you offer proof that you are All for One?\nAwful for One: How do you prove yourself to be “human” in those computer tests to verify you’re not a robot?\nNezu: Definitely fake, but hilarious. I’m going to arrange for this account to be verified.\n#\nOmake: If This AU Is Not Dad for One\nAll for One: (Scrolling through the twitter feed. )What a clever little troll. The most evil One for All user yet, and I mean that as a compliment. Time for some trolling back. How best to fake evidence that Izuku Midoriya is a clone created from my DNA and All Might’s?\n#\nOmake: If This AU Is Dad for One\nAll for One: Izuku Midoriya, Nineth Wielder of One for All, I am…your father!\nIzuku: Nice try, I already told that joke.\nAll for One: What are you talking about? It’s not a joke.\nAll Might: I fell for that once, I’m not falling for it again.\nAll for One: I’m Hisashi Midoriya!\nIzuku: Yeah, sure, and next you’ll tell me that Dr. Garaki is my new stepdad.\nBowing his head formally, Shouto Todoroki said, “Please teach me how to destroy my father as you obliterated your own sperm donor, Great Sensei Midoriya.”\nSpinning around in his computer chair, Izuku glared. He had a hideous stomach ache, putting him in a bad mood. His forehead wrinkled. “I keep telling you, All for One is not my father! Can’t you go back to your All Might love child theory? That one had a much smaller impact on my sanity. See, how else would I have obtained so much All Might merch unless I was his secret lovechild or stealing it from Sir Nighteye?” Izuku gestured around his bedroom. Every spare bit of wall had an All Might poster or an All Might figurine mounted on a shelf. The windows were covered in decals. All Might’s white teeth gleamed in his trademark smile on the bedcover. The pillows had yellow hair tufts. The rug trim was circled by a dozen smiling All Mights wearing sunglasses.\nShouto nodded. “I understand, it’s a grave scandal that the Symbol of Peace and the Symbol of Evil had a secret lovechild. I will be more discrete.” He mimed zipping his mouth.\n“I don’t think you understand at all.” Izuku leaned back in his chair and sighed. “I wish I could help you embarrass Endeavor, but I don’t remember what I did when I pretended to be All for One on twitter. It’s all a drug-induced blur. I think it would be a lot harder to pretend to be Endeavor, since he’s got an official account.”\n“I could hack his account,” Shouto said. “My dad keeps all his passwords taped under his desk.”\nIzuku blinked. “Oh, that is helpful. Hmm. Do you know any embarrassing stories about your father?”\n“Our family stories are mostly sad.”\nIzuku winced, remembering the time Shouto had won a horror contest telling what he believed to be a fun story about his childhood. “Um, could you post embarrassing photos of your father?”\n“Our family photo album mysteriously burned down, but I can look for backups online.” Shouto lowered his voice and whispered, “The fire department has blacklisted us.”\n“What if you posted a bunch of conspiracy theories so ridiculous that even you don’t believe them?” Izuku spoke more rapidly as he warmed to his subject. “Oh, and you could pick fights with important people online to destroy Endeavor’s reputation. Urk!” He clutched his side.\n“Is something wrong?” Shouto asked.\nIzuku attempted a smile. Sweat dripped down his forehead. “I’ve had a stomach ache all day. I might have eaten something bad. I’m sure it will go away if I ignore it, like how I aggressively ignore all my pain.”\n“Is it because I talked about your father? Talking about my father makes me ill, too.”\n“I keep telling you, All for One is not my—ow!” Izuku fell over sideways.\nShouto ran to catch him, crying, “I’m sorry, I’ll stop promoting that theory. What if you’re All Might and Sir Nighteye’s lovechild instead?”\nSheer rage made Izuku sit up and cough up blood. Then his eyes rolled backward and he collapsed. The noise and shouting around him became distant. As the ambulance carried him away, he muttered in his sleep, “Any imaginary father of mine would have given me his Tenth Anniversary All Might poster.”\nIn the hospital, Izuku Midoriya was diagnosed with appendicitis and prepped for immediate surgery. The doctors were baffled, since no one in the modern era had appendixes. Well, except for the quirkless. But this boy had a strength ability.\nA note on Izuku’s file stated that he was not to be put on the painkiller oxycodone under any circumstances. An overworked, inexperienced intern gave him RoxyBond. Unfortunately, RoxyBond was a brand name for oxycodone.\nShouto hummed under his breath as he knelt down and peered under his dad’s desk. Ah-ha! He’d found the list! Enji hadn’t labeled all his passwords, which briefly worried Shouto, but at least he’d marked his twitter password with a crudely drawn bird.\nBack in his room, Shouto locked the door and then logged into twitter as his father. Even though he couldn’t have caused Izuku to develop an illness from the dawn of the age of quirks, Shouto still felt guilty. He knew just what would cheer his friend up—tormenting horrible fathers! They both enjoyed that. As soon as the hospital allowed visitation, Shouto would show Izuku the results of their plan.\nEndeavor’s twitter name was Flame_Hero. How boring. Smirking, Shouto changed his handle to EndNever.\nThe twitter account was barren except for a few posts about Endeavor’s stats and retweeting articles praising him. Those had been created by an intern who had since left the agency. Nevertheless, Endeavor had a sizable following of his fans. Since Endeavor never checked twitter, Shouto expected to have free rein until a member of his father’s agency caught him. He cracked his knuckles.\nWhat to do first? Shouto decided to start small.\n\nEndNever: I blew up my kitchen for the third time this month. Why do I keep installing a gas stove? #Hero problems\n\nThis had the advantage of being true, but for his next tweet Shouto went more ridiculous:\n\nEndNever: I ran out of hair gel today so I tried to use hair spray to style my spikes. Why did no one tell me that stuff is flammable? Does anyone know where I can get a good hat? #Hero problems #Hair problems\n\n\nEndNever: Why does my ranking keep rising no matter how much I suck as a hero? I’m tempted to stop randomly arresting people and pretending they are villains. Having a mutant quirk while being out in public = maliciously loitering. #HPSC corruption\n\n\nEndNever: Why are those computer tests asking you to prove that you’re human so ridiculously hard? @RatGod how do you prove yourself human? #Hero problems\n\nTime to pick some fights. Shouto giggled as he tagged Nezu. Then he tried to tag the HPSC president for his corruption tweet. Between the two of them, surely Endeavor would get absolutely destroyed. Huh, the HPSC didn’t seem to have a twitter account. After two tries, Shouto finally found a new account to tag that looked close enough.\nFinally, Shouto typed up an extremely long analysis about how Lady Nagant had been a secret HPSC assassin, then tagged the HPSC again. Soon, his father’s hero career would be absolutely ruined!\nLeaning back in his chair, Shouto waited for the replies.\nTossing and turning on his lumpy hospital bed, Izuku tried to get comfortable. A floaty feeling filled his mind, making words come bubbling up from his lips. He clamped his hand over his mouth to stop the mumbles from escaping. Distantly, he remembered what had happened the last time he’d gotten too chatty after surgery. He didn’t want to babble something that would get spread across twitter again.\nCome to think of it, wouldn’t the problem be solved if he turned off voice commands on his phone? Izuku slurred, “Turn…off…voice…control? Assistant? Something…yeah, that should take care of voice control.”\nThe phone sitting on his bedside table replied, “Voice control activated.”\nOwlishly, Izuku blinked. He wasn’t sure what he’d just heard, but he decided it must have worked and everything he said from this point forward would be harmless. “Good thing I did that. After I created a fake account for All for One last time, who knows what I might do this time? I might pretend to be the HPSC president on twitter!”\n“Opening twitter,” his phone said. “Creating new account called, ‘All for One who knows what I might do this time I might pretend to be the HPSC president on twitter.’ Name is too long. Please provide another name.”\n“The HPSC is, like, totally the worst,” Izuku mused, his eyes darting in all directions as he scanned the cracks on the ceiling. It felt like there were ants crawling on his skin. He slapped his own face. “Their twitter account should be called…hmm…Help Preserve our Supreme Corruption.”\n“Account created.”\nIn a moment of drug-inspired brilliance, Izuku added, “Also, add a blue checkmark after the name so that everyone knows the account is legitimate. Better yet, add ten blue checkmarks.”\n“Searching for blue checkmark emoji. Emoji found. Ten emojis added.”\n“Whoa, I’m the HPSC president now.” Izuku laughed. “The power is going to my head. I feel dizzy. Could someone stop the room from spinning? I want to get off this ride.”\n“You have been tagged in two tweets from EndNever.”\n“The people love me already!” Izuku declared, waving his finger in the air along the outline of a crack above. “Read the tweets.”\nAs Izuku listened, he nodded along. “Oh, yeah, Lady Nagant was definitely an HPSC assassin. You can post that. Shouto told me all about his theory yesterday and the evidence was overwhelming. Frankly it was his first conspiracy theory that I completely believe.”\n“Tweet posted.”\nSadly, Izuku said, “That stuff about disproportionate arrests for people with mutation quirks is also true. Did you know that mutants are twice as likely to be killed by heroes? Everyone should know that! I’m going to tell the world!”\n“Tweet posted.”\n“Another th—th—thing. Prisoners with mutation quirks are more likely to be put under heavy restraints, placed in solitary confinement, or sent to Tartarus. Of course everyone in Tartarus is imprisoned under inhumane conditions.” Izuku gnawed on his lower lip, tasting coppery blood. “We should abolish Tartarus.”\n“Tweet posted.”\n“While I’m at it, I, the HPSC president, grant all heroes and committee employees free mental health services and an extra two weeks of vacation.”\n“Tweet posted.”\n“Since I’m doing so much good in the world, I deserve something for myself.” Izuku tried to think as ants danced behind his eyes. What did he desire more than anything except maybe becoming a hero? “I demand one of every single piece of All Might merchandise in the world. I also demand all the Tenth Anniversary All Might posters. Ha-ha, Sir Nighteye will be furious!”\n“Tweet posted.”\n“Furthermore, anyone who does not accept these HPSC decrees as completely and utterly true must be some kind of moron, because I have a hundred blue checkmarks after my name!”\n“Additional checkmarks added.”\nSitting behind the HPSC president’s desk, Hawks drew up his wings and sulked. The president had left that morning on a vacation to Hawaii. Hawks had been begging for years for a vacation. Hell, he’d groveled asking for just one day off work. Every single time, his requests had been denied. Between his hero job and the extra tasks assigned by the HPSC, apparently he was too busy for vacation days. But that hadn’t stopped the president from taking an entire month off and assigning Hawks to do all her work in her absence.\nHawks already ate his meals while filing his paperwork, slept on a sleeping bag on the floor of his office, and only had time for four hours of sleep every night. Handling the HPSC president’s paperwork on top of that would completely break his sanity. But he’d still accepted the assignment without complaint because he’d believed it would be a chance to help the League of Villains members imprisoned in Tartarus after the Awful for One incident. In spite of himself, Hawks had developed an attachment to the group of oddballs and wanted to offer them a second chance. Thinking about them in Tartarus made it even harder to get his scarce hours of sleep at night. Ever since the league’s arrest, Hawks had been bugging the president for better prison conditions, plea bargains, and community service using their unique talents. He’d been laughed at.\nUnfortunately, the president had anticipated what Hawks might do with a little power and specifically forbidden him from interfering in Tartarus without direct orders. Then she’d vanished too quickly onto the airplane for him to protest. Hawks had spent an hour trying to hack into her computer without luck.\nWhat had he been thinking? It was all hopeless. He’d never be anything except an HPSC pawn. Hawks slumped down with his head on the keyboard.\nMera pushed open the door. “Sir, there’s been an online scandal about a fake HPSC account. We need damage control.”\nHawks took the offered phone and rapidly scanned the tweets. His grin widened. “Oh, no, this account is entirely legitimate. The president told me that she was creating it before she went on vacation. I guess we have new orders from above! Time to launch a committee investigating discrimination against mutants and start Tartarus reforms. Oh, and let’s release all the secret files on Lady Nagant.”\nMera gaped in open disbelief. “No, this is extremely obviously fake.”\n“Look, this account has ten blue checkmarks, we can’t argue with that.” Hawks slung an arm around Mera’s shoulder and whispered, “Also, two weeks of vacation is fourteen more days than we get right now.” They both worked on weekends.\nMera rubbed his eyes, with their giant sleepless bags from overwork. “Whoa, I just realized how genuine this account must be with its hypnotic bright blue checkmarks. I’ll get that committee started before I go on leave. Finally I can see my children for the first time in years!”\nWhistling, Hawks logged into his own official twitter account to verify that Help Preserve our Supreme Corruption was a completely legitimate HPSC account belonging to the president. Everything posted should be taken absolutely seriously as the word of the government.\nHawks didn’t care who was behind the fake twitter account. The real HPSC president had never given him vacation time or mental health services.\nTapping his paws on his desk, Nezu read the tweet. He chuckled. “Ah, what an amusing prank, young Todoroki. And such useful timing! The moment has come for me to move against the HPSC.”\nNezu added his own tweet concurring that the new HPSC account was completely real (as proven by the blue checkmarks.) Then he contacted a reporter acquaintance to arrange an article about discrimination against mutants and inhumane conditions in Tartarus. Next, Nezu emailed Hawks to arrange a meeting to discuss how they would use their window of power while the president was on vacation for maximum impact.\nFinally, Nezu made sure to praise Endeavor for drawing public attention to this corruption. Just to get a little revenge on young Todoroki for that cute attempt at trolling.\nShouto stated at twitter in confusion. Why wasn’t this going anything like when Izuku had pretended to be All for One? Endeavor was receiving massive praise for his tweets! People were saying that he’d blown open HPSC corruption. They liked how Endeavor had humanized heroes by admitting to his mistakes. They were complimenting Endeavor’s great sense of humor.\nThis was ridiculous—Shouto knew that his father had no sense of humor at all. Endeavour couldn’t even manage dad jokes. Shouto couldn’t help being a little happy that his Lady Nagant theory had been revealed to true. But why was his father getting credit for it? Why were there news articles praising Endeavor as the leader of reforming hero society? This was madness!\nFuriously, Shouto searched his father’s google photos account for the most stupid and embarrassing pictures. He posted pictures of his father accidentally setting a monopoly board on fire, his father falling on the floor while dancing drunk at an office party, and his father trying to put on a hero costume that had arrived a size too small and ripping the shirt.\nThe likes and retweets started immediately. Shouto had a bad feeling that people were laughing with his father, not at him. What could he do that Endeavor would absolutely hate? Shouto channeled his inner Izuku and typed:\n\nEndNever: I would like to publicly confess that I’ve only been critical of All Might because I’m secretly in lust with him. I apologize for every negative thing that I’ve ever said about the wonderful, handsome man.\n\nThe replies rapidly poured in:\n\nOMG Endeavor just came out as bisexual!\n\n\nThe first top bi hero! Bi representation!\n\n\nWe’re proud of you for being so brave, Endeavor!\n\n\nIt takes a real man to admit his flaws. Good for you, Endeavor. I’ve never been an Endeavor fan but today my mind has been changed.\n\nShouto slammed his forehead against his desk. They’d completely missed the point! The gender hadn’t been the issue, everyone had been supposed to mock Endeavor for admitting to his inferiority to All Might.\n\nEndNever: No, no, you’re all supposed to hate me!\n\n\nHawks_Official: Endeavor, are you okay? The HPSC is starting a new program to help heroes with their mental health. You should take us up on it.\n\nWhy did people seem to like Endeavor more the lamer he got? Shouto ground his teeth. Taking a sip of his water bottle, he pondered. Maybe Shouto was going at this the wrong way. Maybe Endeavor had been more contemptible when he’d been arrogant. Maybe it wasn’t too late to try a new tactic to ruin his father’s reputation. Shouto wouldn’t give up!\nA new reply popped up, and Shouto made the mistake of looking at it.\n\nEndeavorSimp99: Endeavor I love you. I love you because you’re a mess of insecurities taking them out on the world. I love you because you can’t stop saying the wrong thing on television and you sail through life from one scandal to the next. I love how pathetic you are and how you never spend time with your family. I love how obviously you hate All Might and how adorably you rant about him. Most of all, I love that sexy chest bursting out of your costume plz post more naked chest pics. If your children don’t want you then you can be my Daddy.\n\nShouto stopped reading. Half his face turned bright red and the other half frosted over. He deleted the twitter account.\nIzuku had been awake for nearly twenty-four hours. Maniac energy had filled him, making him unable to fall asleep. He’d asked the nurse for sleeping pills but she’d said that would be a bad idea, citing possible interactions with the painkillers. A doctor came by to take his temperature, monitor his pulse, and leave a bottle for a urine sample. She said that he was having a reaction to the RoxyBond but it would wear off, then ordered him to drink more water.\nAfter having drunk enough water to make his stomach bloated but still wide awake, Izuku was in a mood to take out his aggravation on the universe. Lying on his back, he stared at his phone screen, but it was too blurry for him to make out anything. “Am I still on twitter, gnome who lives in my phone?”\n“Opening twitter,” his phone replied. “You have thirty thousand, two hundred, and six new notifications.”\nIzuku blinked owlishly. “Well, I’m sure that’s not anything important. Time to critique some heroes and villains! First off, Hawks, if you know your weakness is running out of feathers then have you ever tried saving them? Also, that tan fur coat of yours reminds me of Overhaul, and I hope you have the common sense to realize that’s not a compliment. Endeavor, for someone whose weakness is endurance, why did you make your costume so heavy? And for the love of god please shave off your moustache, it looks like a furry caterpillar.”\n“Tweet posted. Tweet posted.”\n“Death Arms, I heard you left a child die and then criticized another child for saving him. Yet somehow your greatest crime remains those amazingly ugly wrist-guards.”\n“Tweet posted.”\n“Moving on to villains! Spinner, a gecko quirk ought to give you an amazing sense of smell, why don’t you ever use that? Also I’ve seen better Stain cosplays at an anime convention.”\n“Unable to find account for Spinner. Tweet posted.”\n“All for One, what the hell man, you have hundreds if not thousands of quirks and your main method of fighting is swelling up your arm and punching people. You have clearly gone senile and should have retired a long time ago. I’m not even going to touch the stupid-looking mask.”\n“Tweet posted.”\n“All Might, you’re perfect as you are, just keep rocking it.”\n“Tweet posted.”\nSitting up, Izuku shouted, “Will you stop saying that over and over again? You’re making my head hurt even worse, phone gnome!”\n“Tweet posted.”\n“That wasn’t a…oh, never mind.” Izuku rubbed his temples. He grabbed his water bottle and drank the rest. His stomach gurgled.\n“You have received a reply from Hawks_Official: For the record the costume was your idea, Madame President. I wanted a turquoise bodysuit with a golden chain and sunglasses, but you said it would look too villainous. How would you like to handle Tomura Shigaraki’s brainwashing deprogramming?”\nIzuku slurred, “I dunno, give him a dog, everyone loves dogs.”\n“Tweet posted.”\n“Aargh! I told you to stop saying that! You are a bad phone and will be punished!” Izuku threw his phone at the wall.\nThe One for All-powered force of his throw sent the phone clean through the wall. A scream came from the neighboring hospital room, then a sickening squelch.\nStanding up, Izuku peered over the pieces of plaster. A bald man lay on a hospital bed with all four of his limbs in casts. Blood spurted from where the phone stuck out of his skull.\nThe nurse rushed in. “Oh, no! You just killed the respected Dr. Garaki, chairman of Jaku General Hospital.”\n“In my defense, that guy was very mean when he told me I didn’t have a quirk as a child.” Izuku stared at the bed, where Dr. Garaki/Tsubasa twitched very slightly. It was unclear if this was a death throe or if he was barely clinging to life. “What’s my childhood pediatrician doing here? This is all a dream, right? It must be a dream! Dr. Tsubasa vanished a long time ago.”\nConfident in his theory, Izuku returned to his bed, pulled the covers of his head, and went to sleep. He slept through the arrival of the police, the discovery of files on Garaki’s phone revealing experiments on children’s corpses, and the authorities taking away the mostly dead Garaki. The police wanted to interrogate Izuku but acting HPSC President Hawks and Principal Nezu had ordered them to leave him alone.\nEnji pushed open the front door. “I’m home. Shouto, the strangest thing happened at work today.”\n“Ugh, whatever.” Shouto crouched on the living room couch with his knees pulled up to his chest, loudly playing an All Might video on the television in an attempt to ward off his father.\nIt didn’t work. Enji said, “I was given an award for promoting mental health awareness among heroes.” He held up the plaque. “Except I don’t remember doing anything? The award also came with an extra month of vacation and the HPSC absolutely insisted that I take it for my mental health. This is ridiculous, my ranking will slip if I’m forced to take time off.”\n“You mean I did sabotage you after all?” Shouto shot to his feet and pumped his fist in the air. “My plan worked backwards! There’s still justice in the universe!”\nEnji said, “On the plus side, this means I’ll have loads of time to spend with my family.”\nShouto wailed, “NOOOOOOOOOOOOOOOOOOOOOOOOOOOO!”\nIzuku woke up to sun shining in his eyes and the whirr of a heart monitor from the room across the hallway. For some reason, the wall to his right had been caved in. The area was surrounded by police tape. Also, his phone was missing. Sitting up, he coughed to clear the soreness in his throat. He winced, feeling the stitches in his chest throb. His head ached. He had the vague sensation that he’d done something terrible last night but he couldn’t remember anything. Hopefully it was just his low self-esteem talking.\nYoichi popped up next to the hospital bed, the light from the window shining through his ghostly figure. “Ninth, I want to congratulate you on redeeming Tomura Shigaraki. I’ve persuaded the others to accept your viewpoint. Truly, you are an inspiration to us all. You’re just naturally heroic.”\n“I did what now?” Izuku asked.\nBoy and ghost stared at each other awkwardly for a moment. Yoichi said, “So anyway, to reward your heroism, Second and Third will finally give you their quirks.” He winked frantically.\nIzuku clasped his hands together. “Of course, I redeemed Tomura, it’s all coming back to me now. I felt like the two of us had a special bond from the moment he tried to decay me at the mall. Which quirks am I going to get?”\nSecond appeared next to Yoichi. Looking down at Izuku, he said, “For the record, I didn’t change my mind because you got Tomura a dog, although that was a clever move. I’m extremely impressed that you committed manslaughter, unlike all these modern heroes too good to get their hands dirty. Finally we have a successor with balls.”\n“I DID WHAT NOW?!” Izuku shrieked\nThe air wavered, then Third stood with his arms crossed and scowling. “I never agreed to this!”\nYoichi elbowed Third. “Stop pretending not to approve of Ninth. I know you’re just trying to keep your quirk secret because it’s lame.”\nThird glared. “Should the guy who got the useless half of All for One’s power call anyone else’s quirk lame?”\nThe hospital room went completely silent. From the Void, Banjo shouted, “Oh no he didn’t!”\nWith an inhuman howl, Yoichi lunged at Third. Second tried to get between them and they all fell backward into the Void. Shrieking and slapping sounds came from the distance.\n“Hmm, I wonder if I can steal their quirks while they’re distracted?” Izuku mused. He closed his eyes and concentrated. Green sparks danced down his arm. “Excellent. I wonder who’s power that is?” Planning to look up his new quirk, Izuku hunted around for his phone. He found it lying among the plaster, covered in blood. “Whoa, that’s disturbing.” A blurry memory lurked at the edges of his mind. He kept seeing his childhood doctor but that must have been a drug-fueled hallucination.\nThe phone rang. Izuku dropped it, accidentally hitting speakerphone. Tomura’s voice echoed through the drafty room: “I’ve finally tracked you down, Awful for One! I was going to decay you for tricking me, but then you got me a pet dog so we’re cool now. In fact, I’ve even decided to swear loyalty to you since you’re clearly a way better villain than Sensei.”\n“Shhhh!” Izuku hissed, grabbing his phone. “I can’t have you go around telling people that I’m a villain! I’m already in enough trouble for whatever got blood on my phone.”\nTomura continued, “I just need a small favor in return. The Metahuman Liberation Army kidnapped my broker. I’m still in a correctional facility so it’s not easy for me to rescue him.”\nIzuku said, “That doesn’t sound like my problem.”\n“They’re threatening to cut Giran’s fingers off! Please? Pretty please? I won’t tell anyone that you’re the leader of the League of Villains now, and I’ll let you analyze my quirk.”\n“I’m not your leader but I do want to analyze your quirk.” Izuku tapped his chin, considered. “Okay, first we’re going to create a fake twitter account for Re-Destro…”\nAll for One had taken dozens of showers to get Garaki off himself including repeatedly bathing in blood, but he still felt unclean. He had a nagging sense that he was forgetting something—oh, right, he needed to go rescue his losers from Tartarus.\nDropping down from the sky in front of two prison guards, All for One summoned the full force of his menacing aura. With a twisted smile, he demanded, “Guide me to the League of Villains and maybe I won’t kill you.”\nReleasing a faint scent of urine into the air, a guard said, “T-they aren’t here any longer. Tartarus is no longer a prison.”\n“You don’t sound like you’re lying. Have you gone mad from fear?” All for One tilted his head. “No matter, I’ll find them myself.” He shouldered past the stunned guards and opened the door.\nA massive pile of All Might merchandise poured out: everything from apparel to posters to figurines to comic books. All for One was buried from head to toe. Only one finger stuck out, twitching.\nThe guard said, “I tried to tell you that the HPSC president ordered Tartarus converted to a massive All Might merchandise warehouse. She said her new collection and all her Tenth Anniversary posters must be kept in the safest place on earth.”\nThe other guard coughed. “He can’t hear you, he’s unconscious. We should arrest him before he wakes up and slaughters us.”\n“Oh, yeah.” The first guard quickly pulled out his handcuffs. “Hey, do you think we’ll get a reward for arresting the Symbol of Evil?”\n“Depends on if he got any blood on the merchandise.” The second guard shook his head. “The president was really intense about the need to keep the merch spotless. We’re in big trouble if he bled on it.”\nOMAKE TIME!\nOmake: Meanwhile at U.A.\nAll Might: The new HPSC account is clearly young Midoriya, right? I’m very proud that I can recognize his drug-fueled writing style now. Should we do something about that?\nEraserhead: I’ll have the energy to care about whatever the problem child is up to when Nezu gives me an extra two weeks of vacation. Besides, did you see how blue those checkmarks were?\n#\nOmake: First Attempt at Name Change\nShouto: I’m going to change my dad’s twitter name to IHateEndeavor—hey, that name is already taken! I should have seized that first.\nDabi: You would have needed to be born first.\nShouto: Big brother! Please give me advice on how to torment our father. Everything I do backfires and benefits Endeavor.\nDabi: Whoa, I don’t know what to tell you. That’s tragic. I’m no longer jealous of you. In fact, I pity you too much to kill you.\n#\nOmake: The Tell\nHawks: I know that you’re not the real Endeavor.\nShouto: How can you tell? I even hacked his official account.\nHawks: You don’t have a blue checkmark.\n#\nOmake: True Motives Revealed While Under the Influence\nAll Might: Did you want One for All to become a hero or because it was the ultimate piece of merchandise?\nIzuku: Yes.\n#\nOmake: Family Bonding\nEnji: Shouto, why am I a bisexual icon now?\nShouto: I don’t know, it’s a mystery why anyone would want you. Why don’t you ask EndeavorSimp99?\nEnji: Who?\nShouto: I’ll show you the tweets, that way I can at least get a bit of amusement out of my miserable failure.\n#\nOmake: Shouto’s Happy Ending\nLady Nagant: Thank you for starting the movement that led to me being freed from Tartarus.\nShouto: That conspiracy theory was true? Even I thought that one was far-fetched. And I believe that All for One is from the dawn of the age of quirks.\nLady Nagant: …\nShouto: …\nLady Nagant: Do you want to hear about some real government conspiracies?\nShouto: Boy, do I ever!\n#\nOmake: Maybe the Real Heroism was the All Might Merchandise We Stole Along the Way\nAll Might: Young Midoriya, Dr. Garaki is in a coma and it’s touch and go if he’ll pull through.\nIzuku: Am I going to get expelled?\nAll Might: Of course not! You caught a villain who had infiltrated Jaku General Hospital. We’re going to give you a medal. The new HPSC is much cooler with vigilantism. Speaking of which, congratulations on destroying the MLA.\nIzuku: Ha-ha, I have no idea what you’re talking about!\nAll Might: And defeating All for One. You have proven a worthy Ninth successor to One for All.\nIzuku: This time I sincerely have no idea what you’re talking about but I’ll still take credit.\nAll Might: I’m trying to figure out why my former sidekick is on the run from the police. Something about Sir Nighteye refusing to turn over a contraband Tenth Anniversary poster?\nIzuku: I DON’T HAVE THEM ALL YET? I mean, I’d like to volunteer to help you out, sir. I’m sure amnesty can be arranged if Sir Nighteye turns over his entire merch collection."
}