{
    "id": "3341162",
    "url": "https://archiveofourown.org/works/3341162?view_full_work=true",
    "author": [
        "relenafanel"
    ],
    "title": "(760): I literally cut myself out of my pants. Waste. Of. Money.",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Captain America (Movies)"
    ],
    "relationships": [
        "James \"Bucky\" Barnes/Steve Rogers",
        "Natasha Romanov/Sam Wilson"
    ],
    "characters": [
        "Steve Rogers",
        "James \"Bucky\" Barnes",
        "Sam Wilson (Marvel)",
        "Natasha Romanov"
    ],
    "additional_tags": [
        "Alternate Universe - Modern Setting",
        "texting a stranger",
        "Sexting",
        "Flirting",
        "Bucky sends Steve a dick pic",
        "Sam is long-suffering but brings it on himself",
        "twenty-somethings in love",
        "Romantic Comedy"
    ],
    "language": "English",
    "series": "Part 1 of Sex Pants",
    "published": "2015-02-12",
    "completed": null,
    "words": "6,654",
    "chapters": "1/1",
    "comments": "294",
    "kudos": "12,769",
    "bookmarks": "2,424",
    "hits": "124,875",
    "summary": "<p><i>Hey friend of Sam’s can I get an opinion on this outfit? </i>Bucky texted, attaching the selfie taken in Sam’s bathroom mirror. </p>\n<p>He received an answer almost immediately. Bucky was almost expecting a lecture, or at least a concerned question about who had stolen Sam’s phone. </p>\n<p>He got neither.</p>\n<p>New text from Steve:<br><i>What do you want it to say?</i></p>\n<p>Or: Bucky strikes up a flirtation with a stranger over text message in the month leading up to Valentine's Day.</p>",
    "notes": "<p>Potential warning: Bucky sends an unsolicited dick pic mid-flirtation (Steve does not mind, but it might not be your thing).</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>\n<a href=\"https://relenafanel.tumblr.com\" rel=\"nofollow\">Join me on Tumblr</a>\n</p>\n<p> </p>\n<p> </p>\n<p>If you're interested in a rebloggable post <a href=\"https://relenafanel.tumblr.com/post/111038476723/760-i-literally-cut-myself-out-of-my-pants\" rel=\"nofollow\">I made one with cover art</a></p>",
    "text": "It was right there, taunting him, tempting him into picking it up if only for the convenience of the location.\n\nBucky had watched Sam open his phone a billion times. He could have swiped in the right direction of the security code with his eyes closed and the phone behind his back. His own phone was so far away. He’d have to make an effort to get it and there were at least twenty steps from Sam’s bathroom to the front hallway where Bucky’s jacket was, and for some reason Sam kept his phone charger next to his electric razor charger.\n\nConvenient. Location.\n\nIt wasn’t like Bucky was going to use Sam’s phone for nefarious means. He just needed to text Natasha for a second opinion. He’d felt confident when he left his apartment less than an hour ago, but Sam’s bathroom mirror was showing a slightly varied reflection than his own, maybe because the counter was shorter or the mirror was taller, or the lights were harsher, or something. Whatever it was, Bucky was looking at himself in it and frowning.\n\nNat would know if these jeans were too One Direction for him to pull off.\n\nNay, they might be worse than One Direction. They might be Jonas Brothers circa two thousand and whatever the fuck year the Jonas Brothers were big in.\n\nBucky squinted and stared at his thighs. God, maybe he should skip thigh day at the gym sometimes. He wasn’t used to actually being able to see anything bulging in that general area, unless is was up a few inches and a bit more centralized. Skinny jeans always looked fantastic on him.\n\nMaybe he should have stuck to black instead of trying different colours.\n\nEspecially bright red.\n\nBright red. What was he thinking?? He was a side-seam away from appearing like some kind of superhero in tights.\n\nNat didn’t answer his text. More specifically, Nat ignored the text from Sam that was actually from him, which either meant she had nothing good to say about the pants and wanted him to wear them anyway, or she wasn’t close to her phone.\n\nBucky panicked slightly and looked at Sam’s most recent text list.\n\nThe person beneath Nat on Sam’s friend list was Steve. Bucky had never met Steve, though he’d heard about him a few times, and he thought that Sam might have a reason to keep his friend groups separate – like maybe when he needed to catch a quiet moment, he’d have Steve.\n\nBucky would resent that if he wasn’t halfway through attaching a selfie to the end of the string of messages between Sam and this Steve person. That wasn’t exactly making his case as a responsible individual.\n\nSteve. Steve.\n\nThe name alone was enough to make Bucky assume that he was a member of Sam’s grown up friend group. With a name like Steve he was probably born a responsible adult. The kind of person with 401Ks and mortgages, and no problems paying both. Bucky couldn’t even afford to make minimum payments on his credit card this month, especially not after treating himself to the jeans he was currently obsessing over. They’d seemed like such a great idea in the store.\n\nSteve was probably the kind of person who wouldn’t grab his friend’s phone and start texting strangers to find out if a pair of jeans made his thigh muscles look like ham hocks.\n\nWell, Bucky loved nothing more than horrifying uptight people.\n\nHey friend of Sam’s can I get an opinion on this outfit? Bucky texted, attaching the selfie taken in Sam’s bathroom mirror.\n\nHe received an answer almost immediately. Bucky was almost expecting a lecture, or at least a concerned question about who had stolen Sam’s phone.\n\nHe got neither.\n\nNew text from Steve:\nWhat do you want it to say?\n\nWell then. Bucky immediately reassessed this Steve person. If he was willing to play along with Bucky, then Bucky was going to use that to get what he wanted.\n\nI’m young enough to wear these pants but old enough to know how to blow your mind at sex. General ‘your’. Not you specifically.\n\nThe answering selfie was of a guy giving him a thumbs up. Bucky hadn’t known that selfies could be that sarcastic without there being a single word attached to the message. It was kind of impressive, so impressive that the second thing Bucky realized was that the man was really attractive. Like, really cataclysmically attractive.\n\nAww hell Steve you sure know how to reassure a guy, Bucky texted back.\n\nI’d do you, Steve answered, but now that Bucky had seen the expression on Steve’s face, he read the text in an equally deadpanned and unimpressed tone.\n\n“Fuck it,” he said to his reflection in the mirror. “If you can pull off leather, you can pull off red skinnies,” he said sternly. “You are not a Jonas Brother. You are a hot and young and adventurous enough to try new things.” He hesitated. “You do not have a promise ring.”\n\n“Are you talking to yourself in there?” Sam asked, rapping on the door with his knuckles. “I’m ready to go. Can you grab my phone, Mr. Hot, Young and Adventurous? Whenever you’re done staring at yourself, that is.”\n\nBucky rolled his eyes and watched his reflection look equally as unimpressed and sarcastic as the selfie Steve had sent him. He should have known better than to think Sam could make friends who didn’t have some brand of acerbic wit.\n\n“Are you really wearing those pants?” Sam asked, giving him the eyebrows of judgement.\n\n“Steve thinks they’re fine,” Bucky responded, tossing Sam his phone.\n\n“Oh,” Sam answered sarcastically, rolling his eyes. “Well, if Steve thinks they’re fine.”\n\nx.x.x.\n\n“Aw hell no,” Sam exclaimed halfway through the evening. The two of them were standing on opposite sides of the chrome bar table, and Bucky had both his elbows braced on the top as he played Nerf Hoops on his phone and tried not to allow anyone to see his game choice. “You actually texted Steve.”\n\n“I said I did,” Bucky pointed out, completely unconcerned. His pants were completely wasted on this place. His ass was practically on display and not a single person had approached him because of it. Bucky wasn’t deliberately trying to pick someone up, his stance more of a by-product of his boredom than a deliberate choice, but it was pretty telling that a place was lame if there wasn’t at least one person watching him from across the room.\n\nThese pants? Wasted.\n\nBucky? Not wasted enough to deal with this.\n\n“Yeah, well…” Sam said, showing Bucky his phone.\n\nSteve:\nHow do I know this is actually Sam?\nSteve:\nI’m not telling a stranger how to get into La porte vert.\nSteve:\nNo pic no proof.\n\nBucky was so delighted he almost dropped his phone on the table. “Does Steve know you can’t take a selfie until 2016?”\n\n“Yeah,” Sam answered miserably. “He’s been trying to make me lose the bet ever since.”\n\nBucky totally liked this Steve guy.\n\nSam continued, “Steve’s an asshole. I don’t know why you look so pleased with yourself, he was our IN to better places.”\n\nLa porte vert wasn’t necessarily a better place, but it was new and hot and gaining traction in certain Brooklyn circles. Bucky had first heard of it the week before, and it was vaguely impressive that Steve knew how to find it before Bucky. He was definitely curious about a lot of Steve related things, but his most pressing concern was making the most out of his night out. Bucky let Sam stare miserably at his phone for a few moments. “You could just call him,” he pointed out, the need to go somewhere that didn’t end with him draining his phone battery playing app games pressed as a greater need than tipping Sam over the edge of losing his bet.\n\n“I could call him,” Sam repeated, sounding far more enthusiastic than the suggestion warranted. Damn. Sam had probably been really close to caving on taking a selfie. Nat wasn’t going to be happy with him if she found out that Bucky was the reason that Sam was still in the running for their bet/New Year’s pact.\n\nSam dialed, pressing the phone to one ear and blocking the other with a finger.\n\n“Me, that’s who!” Sam said into the phone. “I call people! Deal with it.”\n\nBucky could only imagine that Steve had picked up the phone and immediately gave Sam grief for making a phone call. No one made phone calls these days.\n\nBucky was liking Steve more and more.\n\n“Don’t be an asshat,” Sam then said. For a moment Bucky thought it was directed at him for smiling at the one sided convo. It wasn’t. “You know it’s me. You recognize my voice.”\n\n“Don’t believe him, Steve!” Bucky yelled, leaning across the table towards the phone. “This could be a body snatching scenario.”\n\nSam gave him the dirtiest look he’d ever directed at Bucky. It was kind of awesome, because Sam was typically cool and collect. The last time Bucky had seen that expression on his face, Bucky had accidentally stepped on his airplane model of an F-16 and broke the wing part. “Yeah, that’s Bucky.” Sam’s face then morphed from anger to one of frozen misery as he stared at Bucky. “Same guy, but please don’t ever call him that again.”\n\n“What?” Bucky asked curiously. “What did he call me? STEVE! WHAT DID YOU CALL ME?”\n\n“I’m not sending you a selfie! You should be on my side. Both of you suck.” Sam ended the call and stared at Bucky for a moment. “I hate you, you know.”\n\nBucky allowed Sam to stew in his misery for a moment, but not too long because if Steve had the key to somewhere less lame than this, Bucky was going to try to unlock it. It was pretty bad that Sam was even able to hold a conversation on his phone in the middle of the club. Sam shouldn’t even be able to feel his phone vibrate, let alone talk to someone on it. “Hold up your phone so Steve can see it,” he finally told Sam, opening up his picture app. “It’s not a selfie if I take it.”\n\n“So long as you were the one to suggest it,” Sam answered, which told Bucky that he’d already considered the possibility, but it went against one of Nat’s rules in the bet. Bucky was actually kind of bored these days without Sam’s selfies and Nat’s emojis, but he was betting it would take a few more months before the whole bet collapsed on itself. He could probably last a few months.\n\nPossibly sooner, if Sam ever gave in. Nat wasn’t the one who was going to slip up.\n\nSeriously, who made a bet that lasted a full year? Nat and Sam, that’s who. Ridiculously stubborn, evil people.\n\nBucky snapped a picture of Sam. “What’s Steve’s number?” he asked, copying it from Sam’s phone and attaching the picture to the text.\n\nThanks, Sex Pants, Steve answered.\n\nBucky found himself laughing. “Sex Pants,” he said out loud, completely delighted.\n\n“Don’t,” Sam held up his hand. “Just don’t.”\n\nSteve’s next text was an address and instructions on how to knock on the door. The thing about La porte vert is the door is purple, Steve texted. Immediately afterwards he added: La porte vert also is not a gateway to other green things, like environmental consciousness or marijuana.\n\nSo it’s just another bar with a door themed gimmick that gains flash popularity? Bucky questioned.\n\nI suspect it’ll disappear in three months and reappear in the fall as La porta viola and have an orange door. No one will remember that it’s the same location as La porte vert and we will all spend months searching for a purple door only to ultimately be let down.\n\nWho the hell was this guy? And why hadn’t Sam introduced them already? That kind of caustic outlook was exactly the type of thing Bucky responded to, and Steve seemed to be thinking in the same way Bucky did. Welcome to Brooklyn, Bucky finished with, grinning down at his phone as he retrieved his jacket from the coat check.\n\nx.x.x.\n\nFor some reason, Bucky just assumed that he and Sam would be meeting Steve at La porte vert, but that didn’t seem to be the case as they slid into an empty booth. Five minutes later, Natasha sat next to Bucky. “It took you boys long enough,” she said. “I’m done here.”\n\n“Why do we fall for this every time?” Bucky questioned, looking around the bar. It was a laid back environment, a mash-up of speakeasy themes, old New York charm, with a modern techno beat and refinished wooden dance floor that had more than one encroaching table so they could fit as many people into the room as possible. It was analogous to almost every other bar in the area, only less established into a single theme. Bucky knew where to get the best drinks, the strongest drinks, the most authentic experience, the least authentic experience, and all within a subway stop or two. Walking distance, really, if it wasn’t the beginning of January and so cold he was sure his legs were the same color as his pants if he spent more than a minute outside.\n\nSam’s allowed his head to fall against the wooden table top. “It used to be fun.”\n\n“People used to be more creative,” Bucky complained.\n\nNatasha observed both of them. “They were never more creative, you were just younger and more impressionable to the novelty of secrecy.”\n\n“I’m not old,” Bucky whined. “Look at my pants. These do not say old.”\n\nNatasha gave him a deadpanned, sarcastic expression, her face almost entirely blank but her eyes saying she was passing judgement on him and his pants.\n\nYeah. No one did that expression as well as Natasha did.\n\nx.x.x.\n\nBucky probably should have deleted Steve’s number from his phone.\n\nHe didn’t.\n\nx.x.x.\n\nHis relationship with Steve was a bit strange. Unconventional.\n\nBucky was mostly convinced they were flirting, even if they knew nothing about each other.\n\nMostly, he thought that they should both just get Snapchat. That was pretty much exactly what they were doing: sending each other pictures, some text. But they weren’t actually talking to each other, unless Bucky really ascribed to the ‘a picture is worth a thousand words’ idiom, and he didn’t. What was worth a thousand words was the fact that Steve’s pictures didn’t just disappear, and Bucky sometimes spent a few minutes looking at them and sussing out details about Steve from the background.\n\nFor a while, he thought that Steve was in another city and that was why Sam had never introduced them, but there was a picture of him with Brooklyn Bridge in the background, his face giving commentary on the people behind him who seemed to be doing yoga in the park during the start of the snowstorm.\n\nIt was the same expression Steve had given him about the pants.\n\nBucky responded with a picture of himself on the subway, showing the way he was standing during the busy rush hour crowd, his hand resting on the railing by his head. His face was discontent, but it was caused by people in general rather than something specific.\n\nYeah, I hate that, Steve responded.\n\nBucky sent Steve a picture of his favourite coffee shop and a few moments later Steve sent back a picture of a disposable cup with the same logo on it. There were only three locations in and around Brooklyn, so even if it wasn’t from the same café Bucky was standing in, it was still local enough that it felt like Steve was within reach.\n\nReally, there was no excuse to why the two of them hadn’t met yet.\n\n“Steve says to remind you that the pizza place you treat yourself to and horde away in secret after your monthly basketball game had five cases of food poisoning last week.”\n\nSam waved Bucky aside. “Tell Steve I do what I want.”\n\nBucky gave Sam an unimpressed expression. “You can tell him yourself.”\n\n“Why? You seem to text him more than I do.”\n\n“Why haven’t you ever introduced us?” Bucky finally caved, simultaneously feeling ridiculous for asking and indignant that Sam’s circle of friends seemed to be a venn diagram with Sam in the middle, and the Steve circle and the Bucky circle weren’t overlapping.\n\nSam frowned at him. “You two haven’t met yet? Man, all I hear from you is Steve this, Steve that. I thought for sure the two of you had pulled your heads out of your asses and met up.”\n\n“You know him!” Bucky pointed out. “Why didn’t you introduce us before, then?”\n\nSam just shrugged. “Never really thought about the fact you didn’t know each other. Do you actually want me to?”\n\nYes. Yes, Bucky wanted him to. He also kind of wanted to throttle Sam and demand to know if Steve had ever asked to meet him. Did Steve talk about him? Did all Sam hear from Steve was Bucky this, Bucky that?\n\n“It’s not important,” Bucky shrugged, playing it as cool as possible. “It’ll happen sometime.”\n\n“See, that right there is a blatant lie. The two of you need to get your shit together on your own. I don’t want to be the intermediary… that sounds awkward as all hell. Do you really want me to invite both of you for coffee and then sit there as you discover the joys of flirting with each other in person? That sounds like the worst waste of my time. Just get yourself together and ask him yourself.”\n\n“Do you think Steve liiiikes me?” Bucky whined, just to be an asshole and watch the way Sam threw up his hands and stalked away.\n\nx.x.x.\n\nIt was foolish, but he was just tipsy enough to be riding a high between feeling completely sober and just a little looser than usual, and his hand was on his cock when Steve’s message came in. It was a picture of a beer, Steve’s fingers loosely encircling the neck, and Bucky couldn’t see it as anything other than an innuendo. He knew he shouldn’t do it, that it was gross at best, and invasive at worst, but it felt good to take a picture of his hand reaching beneath his pants, his legs splayed wide and the obvious shape of his erection standing stark against the thin material of his pajama bottoms.\n\nIt took a while before Steve answered, long enough that Bucky had stopped moving his hand along his cock and was now actively concerned that he’d overstepped. It was impossible to feel good with that kind of worry invading his brain, and he was sitting up and hunched over his phone, trying to compose an apology when Steve responded.\n\nSteve sent back a picture of his lap. He was very clearly out in public, and very clearly hard against the front of his jeans. Menace, the text said.\n\nIf I was really a menace, I’d take a picture of myself NOW, Bucky answered in return, flopping back on his bed. He was prepared to keep flirting with Steve, even while masturbating.\n\nBucky had a lot of practice with one handed texting.\n\nDon’t tell his friends.\n\nWhy don’t you? You’ve already made me hard in public, Steve answered. Make me have to get up to finish in the bathroom.\n\nWell then.\n\nx.x.x.\n\n“Introduce me to Steve,” Bucky said, not even bothering to greet Sam. “Or I’ll start oversharing the details of our sexting.”\n\n“Steve wouldn’t sext,” Sam scoffed. “Steve doesn’t even know what that is.” He paused for a moment, his face taking on this expression of regret. “I don’t want to know about your sexting. Look, I invite Steve out with us sometimes. He doesn’t usually say yes, and the few times he has, he said no at the last minute.”\n\n“Why?”\n\nSam shrugged. “I like the guy, but I don’t know much about him. He has a government job, so maybe that. It’s not like we do things together outside of exercising and he doesn’t jog around the park so much as he runs like he’s being chased by his job, so maybe he is.” Sam just shook his head and shrugged like he was entirely disinterested in why Steve hadn’t ended up out with them, though Bucky knew better. If he and Steve texted as often as it looked like they did, then Sam definitely had thought about it and wondered.\n\n“You think he’s a spy?” Bucky questioned, just to be a little shit. Sam was adamant that Nat’s job managing a copy store was code for something else. He said, quote: have you heard her walk up behind you? No! That’s not because she’s concerned about people shoplifting paper.\nBucky had his own New Year’s pact. He was going to get to the bottom of Nat’s job if it killed him. He’d already tried to prove she worked in a copy store the year before and ended up going to every single one of them within travelling distance of her apartment with no luck, but he was convinced that Sam’s theory was wrong.\nNat as a spy? Ahahahahah ha ha ha\nHa.\n(Wow he supremely hoped not).\n\n“No!” Sam answered with the type of honest ‘who me? Why would I think that?’ indignancy that told Bucky he was lying. Sam had definitely thought about it.\n\n“Wow, ok,” Bucky answered, laughing. There was no way Steve was a spy and still managed to send him pictures all the time. That was probably against spy code.\n\nHe looked through them again just to check. None of them looked like Steve was a spy, but a good spy would be able to hide it.\n\nHuh.\n\nx.x.x.\n\nBucky wasn’t so much of a casual around-the-park jogger as he was the kind of person who found his way to the running track at his local gym twice a week after his workout was done and stayed on it until he had to get home for The Voice (or whatever came on television that night that worked as a good excuse for him to stop running hard around a track).\n\nSam had been trying to convince him to go with him on his morning jogs for ages, but Bucky always had the good sense to say no and sleep in for an extra hour.\n\nNot today, though. Today saw him bundled up in layers of spandex to stay warm in the frigid winter air, because Sam was a monster. Sam was the jogging equivalent to the yoga people Steve had sent him a picture of.\n\n“Aww hell,” Sam said when he saw Bucky. Bucky had literally needed to take the subway to get there, an earlier one than he strictly needed because he wasn’t sure what time Sam usually started and he knew there was a huge margin of error if he incorrectly assumed Sam’s starting point was the entrance closest to his apartment. This was in no way convenient for him, and he saluted Sam with his disposable coffee cup and grimaced at the sun rising on the horizon. He hadn’t felt this haggard in the morning since his hung-over and still going to work days.\n\nGod, he was old.\n\n“Hey Sam,” Bucky greeted, trying for cheerful and accomplishing something more along the lines of resentful.\n\n“No,” Sam answered. “Why don’t you just ask him to meet? This is pathetic.”\n\n“Well I would,” Bucky answered, tossing his coffee and making sure his sunglasses were in place. “But then I’d miss the look on your face.”\n\nSam rolled his eyes like someone long aggrieved by his friend choices. “Come on, Indoor Runner, let’s see what you got.”\n\nSam wasn’t exactly a slow jogger. He had a pace and he stuck to it, and Bucky could respect the endurance that took. Bucky was the kind of guy who liked sprinting, expelling all his energy in one go, and not wasting any more time than he had to. Jogging around a park was good for the kind of thing Sam did. He could take in the scenery, enjoy checking out the woman with the Pomeranian who greeted him by name, and just meander along at his own pace.\n\nSlow and steady and all that.\n\nBucky was bored. Bucky was bored and there was no sign of Steve Rogers.\n\n“Why are you here?” Sam asked, his breath a steady inhale-exhale after Bucky had just finished running around one of the side trails, meeting back up with him. “If I wanted an over-exuberant running partner with a low attention span, I’d get a puppy.”\n\n“My grandma is faster than you,” Bucky sniped back. “With her walker.”\n\n“Didn’t I mention?” Sam continued with a smile that was too much teeth. “Steve takes Mondays off.”\n\nBucky stopped dead. “You’re an asshole,” he told Sam, who was jogging away at his steady pace. “I’m going home!”\n\nSam waved his hand.\n\n“You could have started with that!” Bucky was outright yelling now, partially because he felt a little like this deserved yelling, but mostly because Sam was actually pulling away from him. “Would have saved yourself the annoyance!”\n\n“I didn’t think you’d last a mile, Indoor Runner.” Sam yelled back. “I was looking for a good laugh.”\n\n“Fuck you, Sam Wilson.” Bucky walked backwards with his middle fingers thrust in the air.\n\nBy the time Bucky reached the subway, he was aware of his mistake. His thigh and calf muscles were burning, and his feet had tender spots that made him think he was a few steps away from a blister. Fuck running on pavement, there was no way he could complain about this to anyone. It would get back to Sam and then he’d lord it over Bucky for ages.\n\nThe only good thing that came from the entire morning was the picture he’d taken of Sam plodding along in front of him, stepping up his pace to pass a man with a stroller. He sent it to Steve.\n\nYou jog with Sam? Steve texted back almost immediately, no picture attached.\n\nSometimes on Sunday night I think that this will be the week I start exercising in nature. Usually by Monday morning I’m 100% done with that idea, Bucky responded. It wasn’t exactly a lie, but it also hinted at Bucky going out more than just this once and told a story far different from the truth. The truth was that Bucky hated exercising in nature, hated waking up at 5:30 in the morning, and would not do it again, not even for Steve.\n\nIt’s not for everyone, Steve agreed. Sorry I missed it this morning, though. I would have tried to be there if I’d known.\n\nThat was something, at least. Even if Steve hadn’t sent a picture of himself as was their habit. Maybe he really was a spy.\n\nThen the image came through of Steve in bed, his face creased from his pillow and his eyes still heavy.\n\nUsually Bucky would enjoy a picture like that, but mostly he just felt jealous that at least Steve was smart enough not to wake up early on a Monday morning.\nBy noon, he was fed up with not seeing Steve in person. If it was their ‘thing’ then their ‘thing’ was lamer than La porte vert.\n\nLet’s meet, he texted Steve, taking a deep breath as he thumbed the send button on his phone. He exhaled and checked to see if Steve responded before he set his phone to the lock screen and tried his best not to check it every five minutes.\n\nTwo hours later and Bucky still hadn’t heard back. He had opened his phone twice to make sure that somehow he hadn’t missed the text coming through in the second it took between staring at the message history and turning on the lock screen. He hadn’t. His last text sat there mocking him and he had visions of it being the final text in their string of messages until Steve’s conversation moved to the bottom of his contacts and eventually Bucky ended up deleting him.\n\nHe wanted to berate himself, but a part of him, the part not freaking out over not hearing from Steve in a few hours, was actually glad he’d done it. If Steve didn’t want to meet, and didn’t even text him to explain why, then Bucky didn’t want to invest any more of himself in that relationship.\n\nSteve:\nSure!!\nSteve:\nYou sent this hours ago, I’m so sorry. Let’s meet.\nSteve:\nThe Bean Grind on Saturday at 3?\n\nBucky watched as his phone lit up, one text after the other.\n\nSteve:\nBut why don’t we make this fun? Standing date next Sat, but earlier if you can find me first?\n\nBucky stared at the text for a moment. Seriously? He responded. Because seriously? Steve was giving him permission to track him down? Are you sure you want to go there?\n\nSteve:\nI like clever men.\nSteve:\nBesides, Saturday is Valentine’s Day and that’s a cliché too obvious for two Brooklynites.\n\nWell hell.\n\nNo using Sam, Steve sent as a final edict.\n\nChallenge accepted.\n\nx.x.x.\n\nTuesday after work found Bucky loitering about three subway stops away from his apartment.\n\nHe vaguely knew the area Steve lived in because of the amount of recognisable landmarks in his selfies, and yet he wasn’t sure if it was creepy to be walking around the stop that was his best educated guess to be the one Steve used. It was based on a picture Steve had sent once of the morning fog, heavy on the street. Bucky also considered the times Steve usually worked, which was a more difficult thing to get a grasp on. Steve didn’t seem to follow traditional 9-5 hours, or if he did, he put in a lot of overtime.\n\nBucky was walking around the block, checking in stores to see if he could spot anyone who looked like Steve. He really needed to narrow down a point in Steve’s schedule, because this was disastrously stalky.\nEmphasis on disaster.\n\nBut it was possibly the best thing that ever happened to him when he passed one of the intersections and almost dropped his phone into a grate when he was fumbling to quickly retrieve it from his pocket of his tight jeans.\n\nHoly shit, this was the best day ever. He didn’t even know if he could convey this in a text without just sending a string of exclamation points.\n\n“A phone call? Really?” Sam sounded like he was throwing shade, for someone who had to make phone calls to verify his identity about once a week now that Steve set a standard that Bucky was only happy to keep up.\n\n\"So you know how your girlfriend works at a FedEx Office store?\" Bucky questioned, the moment Sam picked up, putting specific emphasis on the place where Nat worked. His voice sounded calmer than he felt.\n\n\"I'm pretty sure that's code for the fact she can't tell me what her actual job is.\"\n\n\"Not everyone is a spy,\" Bucky answered with a barely covered laugh. \"Sometimes people really do work for FedEx.\"\n\n\"What?\" Sam asked.\n\n\"I mean, sometimes you search every single copy shop in the tri-state area just to prove a point, and sometimes you hit pay dirt when you’re trying to track down your sexting partner on a dare.\"\n\n\"What?\"\n\n\"I found Natasha, FedEx Office employee,\" Bucky finished with glee.\n\n\"That's bullshit.\" Sam sounded uncertain.\n\n\"Sure, Sam,” Bucky said in a placating, condescending tone. “Hold on, I'm going to get a picture.\"\n\n“Wait! Don’t do it. She’ll kill you.”\n\nGood point. But then, Bucky had said he was going to find Natasha if it killed him. “Gonna do it anyway.”\n\nBucky knew he had to be quick about it, walking up fast to Natasha's cash before she noticed him and aiming his phone in her face. He forgot his flash was on, so he probably deserved the attempted black eye.\n\nIt was definitely worth it. Even Natasha texting him that she would kill him five minutes after he left the store was worth it. There were a lot of things Bucky regretted in his life, but that was not one of them.\n\nx.x.x.\n\nIt wasn’t like Bucky had a driving need to prove himself to Steve, it was just… Steve had dared him to come find him.\n\nOk, so Bucky had a driving need to prove himself to Steve.\n\nAlso, he had trouble resisting dares.\n\nPlus, Steve was kind of a huge enabler. On Monday night he sent Bucky a picture of his television. He was watching Elementary – that was a taunt, right?\n\nBucky wasn’t sure until Steve also texted: Sherlock would have found me by now.\n\nBucky was kind of frighteningly into how much of a jerk Steve could be. You wouldn’t be able to put up with Sherlock for long, Watson, he texted back. You’d eventually need to put him in his place.\n\nHave you even seen the show? Steve questioned.\n\nGreat, now that was something else Bucky was going to have to add to his list.\n\nSteve:\nWe should watch it together. Once you find me.\nSteve:\nImagine spending hours pressed together on my couch.\nSteve:\nSeems like a waste of time that you’re not here next to me.\n\nBecause Steve was a taunting little shit, he texted Bucky where he was having lunch, the location familiar to Bucky. There wasn’t a thing he could do about it because he was heading into a meeting it was mandatory he attend. He sent back a picture of the boardroom.\n\nWhoops. Steve texted him with a smiley emoji.\n\nBy Wednesday, Bucky was standing with a clear view of Steve Rogers. Steve was sitting in a subway car, absorbed with his phone. He was in the middle of lifting it up to take a picture of himself when it hit Bucky exactly what was happening and instead of approaching Steve, he took a picture of Steve taking a selfie he was probably sending to Bucky.\n\nMeta as fuck.\n\nIt would be so easy for Bucky to get on the train after sending the picture. He had time, but instead he found himself watching Steve stare at his phone. He looked… lonely.\n\nIt was obvious when Steve received the picture because his head jerked up, eyes searching until they rested on Bucky. Bucky smiled and waved as the doors slid shut. He kept waving as Steve stood, looking out the door and as the train moved away from the platform. Tag, you’re it, Bucky texted Steve.\n\nx.x.x.\n\nBucky looked up from his club sandwich when his phone lit up with a message. The image was of him cramming the last bite and a half of one of the sandwich corners into his mouth and was so unflatteringly ridiculous that he had to stare at it for a moment, impressed. It seemed to be originating from the booth next to the one he was sitting in and Bucky looked towards the divider between them. Steve probably would have had to walk in a low crouch to get there without Bucky noticing. “Wow. That is kind of creepy, isn’t it?” he asked, hoping Steve was still next to him.\n\n“I regret coming up with the challenge in the first place,” Steve admitted. His voice was deeper than Bucky would have placed it, and yet seemed right. His head appeared over the partition, looking at Bucky with his clear blue eyes crinkling at the corners in mirth.\n\n“You should join me for lunch,” Bucky offered. “I feel a little like Deep Throat talking like this.”\n\n“While I appreciate the reference,” Steve responded, smirking at him. “I don’t think it evokes the meaning you intended.”\n\n“Who says?” Bucky knew exactly what the reference should have made Steve think about. Bucky knew how to flirt with someone using his brain.\n\nSteve slid into the booth across from him. “Hi,” Bucky said with a smile. “Welcome to our first date.”\n\n“Date?” Steve questioned, but there was a teasing lilt to his tone, and a smirk on his face. Bucky might not know him in person, but he knew enough about Steve to understand that he wasn’t being entirely serious. “You asked to meet, so I thought we were just arranging a meeting. No one said anything about dating.”\n\nBucky was actually pretty sure that Steve had mentioned the word date when he brought up the fact that Saturday was Valentine’s Day, but Bucky also knew how to play along. “Do you really think that either of us would have put so much effort into the chase we just led each other on if we weren’t interested in dating.”\n\n“Well there’s that,” Steve mused, actually rubbing his chin like he was thinking about it. “I think the sexting was more of a clue that I’m interested in you.”\n\nBucky grinned, slow and dirty. “Baby,” he drawled in a low tone, not entirely serious about the pet name but hoping to make Steve flustered. “I can think of at least one picture that proves how interested I am in you.”\nSteve seemed flustered, but he grinned at Bucky, soft and shy as he ducked his head and looked directly at Bucky through his eyelashes. \"I'm glad we found each other,\" he said.\n“That’s cheesy, Steve,” Bucky pointed out, but he couldn’t help but grin back.\nx.x.x.\n“What’re you doing?” Bucky slurred, reaching for Steve with his bare arm. It felt overly heavy from exertion, so he dropped in back on the warm, empty space beside him and squinted up at Steve standing over him with his phone.\n“Taking a picture to show Sam why I’m skipping our run this morning,” Steve responded.\nBucky grinned, delighted. “Well in that case,” he answered, pulling the sheet down to expose more of his torso. “Make it worthwhile.”\n“I’m keeping that one,” Steve answered, slipping back beneath the covers. “I’ve been thinking about our selfie problem, and I think if we really… oh, Sam sent back a pukey face emoji.”\n“Rude,” Bucky huffed, settling closer to Steve and enjoying his warmth. “Hold on, keep that face,” he said, groping for his own phone. “Excellent,” he considered, sending Steve’s sarcastic expression as he looked at his phone to Sam. “If he didn’t want this to happen, he should have introduced us when I asked.”\n“Mmmhmm.” Steve pressed his mouth against Bucky’s and took another picture of the two of them kissing. “I agree on that one. Putting up with us flirting for an hour is probably better than receiving pictures of every moment we have from now on.”\nOf course Sam had given Steve the same reason for not introducing them. Of course. “You’re perfect,” Bucky decided. “And evil.”\nSteve smirked at him. “I answer to Steve.”\nPerfect. “Yeah? Let’s see if you can make me call it out.” Bucky was already aroused, pressed against all of Steve’s bare skin.\n“I can’t see that being a challenge,” Steve answered, peeling back the blanket and putting his mouth against Bucky’s navel. He continued to move downwards, his hand stroking Bucky’s cock before he shifted slightly, licking his lips as he fit his mouth over the tip of Bucky’s erection.\n“Should I send a picture of this?” Bucky questioned, voice strained and only half joking.\nSteve looked up at him through his eyelashes, considering, before he pulled back enough to give Bucky an answer.\n "
}