{
    "id": "33663907",
    "url": "https://archiveofourown.org/works/33663907?view_full_work=true",
    "author": [
        "SrirachaBunny"
    ],
    "title": "A Split Thread",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen",
        "M/M"
    ],
    "fandoms": [
        "One Piece"
    ],
    "relationships": [
        "Monkey D. Luffy/Roronoa Zoro",
        "Monkey D. Luffy & Mugiwara Kaizoku | Strawhat Pirates",
        "Monkey D. Luffy & Roronoa Zoro"
    ],
    "characters": [
        "Monkey D. Luffy",
        "Roronoa Zoro",
        "Mugiwara Kaizoku | Strawhat Pirates"
    ],
    "additional_tags": [
        "Monkey D. Luffy-centric",
        "Crew as Family",
        "Alternate Universe - Canon Divergence",
        "Alternate Universe - Time Travel",
        "Everybody Lives",
        "Except Blackbeard",
        "From Romance Dawn to Sabaody",
        "Can be read as zolu",
        "Zoro is just a devoted boi who can blame him"
    ],
    "language": "English",
    "series": "Part 1 of Spin a Yarn",
    "published": "2021-09-03",
    "completed": null,
    "words": "11,648",
    "chapters": "1/1",
    "comments": "202",
    "kudos": "9,325",
    "bookmarks": "1,364",
    "hits": "62,779",
    "summary": "<p>The Straw Hats find it a little weird that they don’t have a first mate. Whenever they ask, Luffy just laughs and says they do. Which is weirder, because none of the crew have ever met this so-called first mate.</p>\n<p>A time-travel au, in which a captain and his first mate go back to the very beginning, and figures they can do more good apart than together. At least for now.</p>",
    "notes": "<p>I haven't been on ao3 in years, but I've been on a One Piece binge and here we are. It's weird writing something without planning every single detail and sticking to the things I learned at Uni, but rules are meant to be broken and writing fanfiction is oddly freeing.</p>\n<p>Don't be scared by the mature rating, but there is one scene with (spoilers) severed fingers. Not a main character, and I think everyone will be happy to hear who got them chopped off.</p>\n<p>Anyways, enjoy this overly long one-shot that just wouldn't quit.</p>\n<p>Edit 12/03/2022: Fixed up a bit of the formatting and grammar.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>I hope you enjoyed this self-indulgent piece of mine. A second part is in the works, featuring Zoro's odd travels, the story of why Bon Clay and Sabo are at Sabaody, and the new scar he got from Blackbeard.</p>\n<p>Follow me on Twitter for updates, ramblings, etc. @Srirachabunny</p>",
    "text": "It doesn’t end in blood and fire.\nIt ends lonely, with two men at the end of a story that once held more people than them. Laugh Tale is neither a paradise nor a living hell, it simply is. A captain and his first mate, side by side, sharing a toast of dreams fulfilled while pulling at wounds that would never heal. A toast for the people lost, gained, remembered, and forgotten.\n“To the King,” says Zoro and clinks his cup against Luffy’s. “To reaching the end.”\nLuffy smiles, still painfully wide in the way only a man made of rubber can manage it. “Shishishi,” Luffy laughs, aiming for another clinking of sake cups. “To the best first mate–-” he starts and stops.\nTilting his head, the pirate king frowns and stares out at the silent ocean. The sake is forgotten between them.\n“What is it?” Zoro already has one hand on Wado. Not that he has taken his hand off his swords since they arrived.\nThere is a gentle note on the wind, like gold skimming across skin and made of promises. Like fresh grass and dew in the morning. Like blood and death and fire and the same  loneliness  that has taken permanent residence in both of their chests.\nLuffy frowns. “Can’t you hear it?”\n“No.” To Zoro there is just a breeze making his earrings dangle. It doesn’t stop him from putting down his sake cup, because his captain has always been oddly perceptive of what lies in between the fabric of their world.\n“It’s like bells.” Luffy stands, dusts off the stray petals that have fallen onto his shorts and keeps his eyes on a horizon that is nothing but calm, lulling waves and a brilliant sun that never sets. “I think I’ve heard it before.”\nNow it is Zoro’s turn to frown. “Where?”\nShaking his head, the captain grabs the brim of his hat. There is a smile on his lips, smaller than usual, but brimming with the same wanderlust that had once driven their journey. “You really can’t hear it?”\nZoro stands and bumps his shoulder against his, relishing in the brief moment of contact. “No, but I trust it’s there if you say so.” Luffy is rarely wrong about these sorts of things. The weird things.  The miracles. \n“Shishishi. Zoro trusts me a lot.”\nThere is a snort, followed by a soft declaration. “I wouldn’t be here if I didn’t, captain.”\nLuffy grabs Zoro’s hand, the one not resting on his swords, and squeezes tight, tight, tight until the bones start squeaking in protest. Zoro doesn’t tell him to stop. Luffy doesn’t let go.\nThe pirate king looks away from the sea, and turns back to his first mate with a dazzling grin reminiscent of their earliest days. He takes in the scar on his eye, the stitches along his chest, the countless small blemishes on the skin that he can see through the open robe. Zoro has given a lot of himself to be here, right next to him.\nLuffy squeezes the hand in his once more. A reassurance. A mutual strength. A confirmation of  I’m still here. \nZoro squeezes right back, unhesitant in his affection.\nThere is a moment of quiet, then a breath and a whisper. “Trust me one more time?”\n“Aye, captain.”\nThe sound of a bell chiming, carries on the wind.\nFar, far away - away from the New World and far above the Blue Sea, the golden bell of Shandora rings again. She rings clear like a furnace of fragile glass, her sound a thread that will reach the man she wants to help.\nRinging and ringing, waiting for him to hear her chimes. To let her help.\nTo guide her people back to the sea where it all began. Where they all belong.\nAll of them.\nTogether once more.\nAt Laugh Tale, Luffy smiles one last time with Shandora’s gentle voice whispering of a second chance in his ear.\n \n***\n \nLuffy wakes up, fourteen and alone, facedown in a bush of hogweed on Mount Corvo. He cries for a good minute, sobbing and screaming into poisonous foliage. He blames the redness of his skin on the rash that emerges by the time he makes it back to Dadan’s hut.\nDogra and Magra yell at him when he trudges inside, sniffling and trying to ignore the sting of the hogweed sap that is causing blisters to bubble up on his cheeks. The two men force him into accepting medical care, and Luffy can’t help the smile that breaks out on his face as they fuss and remind him not to go sitting around in hogweed, because  it’s poisonous, dammit, Luffy! \nThe door swings open, followed by the unmistakable stench of unbranded cigarettes.\nDadan looks the same as she always has, with magnificent ginger curls, worried teeth gnashing at the stub of a cigarette and a screech ready on her lips. “The hell were you sitting around in hogweed for, you dumb brat!”\nIt is decidedly not worded as a question.\nShe raps him over the head with a knuckle, and Luffy yields to her power, grinning and laughing a soft  shishishi  while his eyes continue to water. He is probably acting weirder than usual, judging by the worried edge of Dadan’s brow.\nHe has a remedy for that, though.\n“I missed you Dadan!” Luffy yells and slingshots himself off the ground until he is wrapped around her like a persistent octopus. Her yell of outrage is muffled against his vest, fingers grappling for purchase while he holds onto her with as much strength as he can muster.\nWhen she finally gets her face free, there are daggers in her eyes. “You’re still covered in hogweed sap, you  stupid--!\" \nLuffy laughs and takes the scolding with a smile.\nOnly to be thrown head over ass into the bathhouse by the still raging Dadan.\nHe ends up staying the night inside with the bandits. It is not that he doesn’t want to go out and sleep in Luffy’s  Ace’s  Kingdom, but he hasn’t seen this many people since… well, since before Laugh Tale.\nThere is a painful ache in his chest, listening to Dadan snoring away like the engine of a sea train, but he can’t help but be happy.  Ace is alive,  he thinks, curling a hand against his unscarred chest.  Sabo too. \n\n And Nami, Usopp, Sanji, Chopper, Robin, Franky, Brook, Jimbei-- \n\nZoro.\nLuffy is not a big planner, that  was is more of Law’s department, even if he never really followed whatever scheme the surgeon came up with.\nThis time, though, Luffy thinks he might need one. He is fourteen and alone. Ace has left and Sabo is alive somewhere out there, but oh so lost in his own head.\nNami is in the clutches of Arlong. Usopp is telling lies somewhere in Syrup, Kuro lurking in the shadows. Sanji is no longer with his family, thankfully, and likely with Zeff. Chopper is with Kureha, isolated and without friends. Robin is somewhere in the wind, alone. Franky is Franky, not Cutty Flam, but Tom is still gone. Brook is drifting, waiting like he has done for so, so long. Jimbei is trying his best, but the rift between fishman and people is a yawning grave.\nAnd Zoro, who wouldn’t have been in time to save Kuina from the stairs.\nLuffy sniffles again, smashing his head into his pillow to stifle his cries.\nShandora, beautiful and brilliant and hopeful, has brought him back, but still not far enough back to stop his crew from hurting.\nLuffy settles in for the night, drinking in the snores and grumbles of the mountain bandits like a starving man, and tries not to think how he has failed before even getting started.\n \n***\n \n“The hell is this?!” Dadan’s scream is loud enough to wake the dead, even if she is outside the hut itself. Luffy wakes with a small  mrph  and a hand rubbing the gunk of sleep from the corner of his eyes. He is still covered in bandages, but pleased to note that the hogweed swelling has gone down and appears non-existent.\n“Luffy, get your ass out here!”\nWhoops, Dadan is still yelling. Dogra and Magra are cowering in the corner, eyes wary when Luffy merely reaches for his straw hat, plops it onto his head and skips out the door to see what the woman is yelling about now. It is too early in the morning for him to have done anything wrong.\nThe hot sun is scorching, and the young boy smiles brightly, eyes closed to accommodate his show of mirth. Half a laugh is making its way past his throat before he can stop himself. “What are you yelling for? I haven’t even done anything yet, shishishi!”\n“Did you adopt another stray?” Dadan screeches and raps him with a fist over his head just for good measure. He rubs the light stinging at the back of his head, but as far as he can recall he definitely did not pick up any strays at this point in time.\nSo Luffy says just that. “But I haven’t picked up any strays?”\nDadan frowns so hard she bites her cigarette in two and throws a hand in the direction of the forest, a vein popping from the forceful motion. “Then what do you call that?”\nHe follows her burly hand, squinting in the harsh morning light so prevalent on Dawn Island, and then he sees him.\nSitting ever so casually, leaning against a tree and snoring away like Dadan hadn’t just been screaming - three swords at his hip with three earrings to match. His green hair is unmistakable, his chest void of scars and a whole two eyes closed in slumber. Zoro looks so young like this.\nZoro, Zoro,  Zoro-- \n“Zoro!” The yell, happy and full of love, leaves him before he can think of anything else. He launches himself across the small distance, propelling into the other  man  boy and wrapping his limbs around him like a kleptomaniac anaconda.\n“Oi, what the--” Zoro doesn’t get to say more than that, words drowning in a mouthful of black locks that doesn’t yet smell of sea salt and freshly smeared tar on lumber. Luffy leans into the hug with fervor, nuzzling his head under Zoro’s chin and letting out bursts of laughter that somehow devolve into sobbing hiccups.\nZoro hugs him through all of it, curls tight around his captain and pretends he isn’t crying a bit too.\nScowling at them, and perhaps slightly worried about Luffy though she will deny it to her dying day, Dadan puts her hands on her hips and tries to look menacing. “I’m not taking in another one,” she huffs, eyeing the bundle of swords next to his hip. “Unless this one is actually useful.”\nHad this Zoro not lived through several Yonko encounters and the wrath of the World Government, he might have been a little intimidated by the mountain bandit. As it stands, Zoro smirks at her and gestures to Luffy with a cock of his head. “Depends on my captain.”\nThat comment gets him another wet laugh, and then Luffy is leaning back. He slaps his cheeks and wipes the snot and tears off his face with the corner of his vest. “Stay.”\n“Aye, aye, captain,” says Zoro, and stands up before his legs can cramp any more than they already have. He ruffles Luffy’s hair and picks up the fallen straw hat, putting it back where it belongs.\nLuffy bats at his hand with a grin. “This is Zoro,” he says, turning to address Dadan and all the other mountain bandits no doubt listening by the door. “He’ll be staying for a bit.”\nDadan scowls but keeps her mouth shut, clearly used to Luffy’s weird whims. “Whatever, but he’s staying in Luffy’s Kingdom.” She points at the rickety shelter for good measure and Zoro pales a bit at the state of it.\nExcept he has slept in worse places and Luffy knows this.\n“That’s fine,” says the future king of pirates, one hand on his straw hat and the brim covering his eyes, but not his smile  never his smile. “I need him by my side.”\nZoro can’t stop his own answering smirk.\n \n***\n \nThree days later, holding each other’s hands under the crumbling shelter, both of them lie awake in the summer night despite the late hour.\n“Do you think…” Luffy starts and trails off. Zoro doesn’t press him, and Luffy takes a minute to gather his scrambled thoughts. “Do you think the others remember?” He bites his lip, and the hand in his squeezes again. A subtle press of fingers on his pulse, just to check that they’re both  here.  Luffy squeezes back.\nWords have never been needed between them and the stretching silence is enough of an answer in itself.\nTurning on his side, resting his free hand under his head in lieu of a proper pillow, Zoro’s gaze is nothing but piercing. “Sleep,” he says, and Luffy can feel the same heartbreak in his chest echoing across from him. Only two made it to the end. Only two are here now. “We’ll find them again. All of them.”\nIt is a weak reassurance, but one Luffy needs to hear anyway.\n \n***\n \nZoro has been on Dawn Island for a month and Luffy knows the other is getting restless. His swords cut deeper than needed when they hunt, and the trees surrounding their temporary home look like a tiger has mauled them beyond recognition.\nThe pile of firewood is overflowing to the point where Dadan has pleaded for them to stop bringing any more.\nThat restlessness - the same itch rests just beneath Luffy’s rubbery skin. The knowledge that what they’re doing isn’t propelling them forward fast enough, but nevertheless it is necessary.\nTheir minds might be older, might have knowledge of Haki and ancient weapons and stories of a century that ceased to exist; but their bodies are young and undeniably fragile in a way they haven’t been for years. Warlords, Admirals and Yonkos are beyond their capabilities for now.\nDaily life on Dawn Island, however, is almost too easy at this point.\nThe wailing mews of a scared Tiger Lord is quickly snuffed out and Zoro removes a chunk out of Mount Corvo’s side in the process. Luffy laughs and Zoro sheathes Wado. It had only taken him one sword, one strike, and both of them are  bored. \nLuffy has already plopped down in a grassy patch (without any hogweed, thank you very much), when Zoro joins him, humming under his breath.\n“What’s the plan?” He asks, well aware that Luffy has never made any other plans in his life besides becoming king of the pirates or how much meat he can stuff in his mouth. Still, he asks and prays for a miracle that doesn’t come.\n“Don’t have one.”\n“Okay.”\nZoro flops down beside him. There’s a cloud above their heads shaped like cotton candy and Luffy really wants to snuggle with Chopper. He wants to hear Brook play a song. He wants to smell Sanji’s cooking and steal scraps from the kitchen when the cook isn’t looking. More than anything, Luffy  wants-- \nHe is a pirate. He is allowed to want.\n“I don’t think I should stay here,” says Zoro, breaking him out of his reverie. Luffy stays silent and turns onto his stomach, resting his head in the palms of his hand and swinging his legs like the child he is pretending to be. “We’ve beaten everything in this forest, but I can’t get stronger like this.” There is frustration trembling in his voice.\nA minute passes, then another three, then half an hour with no answer from the captain. Maybe he fell asleep. Maybe they both did, as deep thinking tends to do to them both. It doesn’t stop them from picking up the conversation like they didn’t just doze off in the middle of an important discussion.\nLuffy pokes him in the shoulder, eyes tired with more than just their impromptu nap. “What does Zoro want to do?” Luffy has always been adept at knowing when something is gnawing away at his first mate.\n“I want to find Mihawk,” says Zoro, even as he spits the name like a curse from his tongue. “I’ll find a boat and let it take me wherever. I’ll drift until I find him, if I have to.”\nBecause while Luffy can train on his own, practicing Haki without another living person around if need be, Zoro yearns for opponents to cut into just as much as his swords sing for blood and death.\nZoro refuses to cut his captain, and will never be able to raise his blade at the other man ever again. (They won’t repeat Whiskey Peak this time. They haven’t talked about it, just like they haven’t talked about all the other things between them, but they both  know  and that is the only thing that matters.)\n“I can make a bigger difference out there. You don’t need me here right now, but you need someone out there who can take care of things.” Zoro doesn’t specify what the  things  are, and Luffy isn’t sure he wants to know. “So if you don’t have anything against it, I’ll set sail early, captain.”\nAnd because Luffy has never questioned his reasoning before, he doesn’t question this time either. “Okay,” he says and crawls into Zoro’s space, grabbing whatever part he can reach and resting his head over the beating heart of his swordsman. “But Zoro better stay safe. I’ll need him again some day.”\nZoro nods, his chin bumping into the crown of Luffy’s head that is still covered by the straw hat.\nIt doesn’t take more than that, and by the next morning, Zoro is gone and Luffy is alone on Dawn Island - fourteen, alone again, and a crew of two walking in separate directions.\nIt doesn’t matter, thinks Luffy, even if Zoro isn’t visible by his side, he will always have the best first mate in the entire world.\n \n***\n \nLuffy is seventeen, alone, and sets sail in a small dinghy. He punches a sea king, gets shipwrecked within a day and stows away in a barrel. He meets a pink-haired crybaby (who’ll grow so, so strong, and yearn for justice in a way others can only dream of) and drops him off at a Marine base in Shells Town.\nHe trashes the man known as Axe-Hand Morgan, but there is no swordsman strung to a pole in the courtyard and his chest aches. When he sets sail again, he drifts and drifts, and wonders not for the first time whether Zoro has found Mihawk yet. It has been three years, but the sea is vast and their luck can only stretch so far.\nAnd then he meets Nami.\n \n***\n \nShe is stealing and plundering, and all around reluctant to join the weird rubbery kid who comes bumbling in while she’s trying to get her hands on some much-needed treasure.\nBut Luffy is nothing if not persistent, and within long he has added a navigator to his pitifully small pirate crew. She gripes and complains, but he merely laughs and pretends not to notice when she pilfers his tiny wallet from his shorts.\nNami is still weary of the world, and Luffy knows she needs the money, for now at least. If he has any say in it, Arlong won’t be around Cocoyashi for much longer.\n \n***\n \nAt Syrup village, they meet a liar with trembling knees and a penchant for arts and crafts. Luffy laughs loudly and declares him a member of their crew within the first two minutes. The boy tries to argue that if anything, they’ll be the ones joining  his  crew under the flag of captain Usopp.\nThat doesn’t happen, but the three of them do end up stumbling upon the plot of a dastardly evil pirate butler.\nZoro isn’t here, but that is okay, because Luffy will keep them safe this time around.\nHe doesn’t use Haki, but he makes sure that none of his crew members suffer any larger wounds. They need the training, after all, even if they don’t know it yet. As much as he wants to hold their hand, he has to prepare them for what awaits them in the Grand Line, and even more so the horrors they will face in the New World.\nIn the end, Luffy manages to get Kuro alone without Nami or Usopp around. He can feel them nearby, running through the forest to help Kaya get away from the weird hypno pirate, but Luffy trusts them to handle it.\nThey are not quite his yet, but that doesn’t mean they are weak.\nWith nothing more than one punch and a desire to decimate his opponent, Luffy breaks the teeth of captain Kuro and gives the man a concussion that will leave him unable to think, speak, or walk for days. The black cat pirates that are still awake can only scream as their captain goes down.\nLuffy shrugs off their terror and makes his way through the forest, ready to back up his crew if they need him to step in.\nThey don’t.\nTwo days later, Luffy has a sniper and a ship that feels like home.\n \n***\n \nA fight with Don Krieg awaits them at The Baratie. As does a cook named Sanji, and Nami’s ‘escape’ with both their ship and all their money. Luffy isn’t worried, even as Usopp screeches into his ear about betrayal and whatever else he can think of.\nThe fight is over quickly enough, and while Don Krieg’s fleet had still been annihilated before his eyes, there is a distinct lack of Dracule Mihawk.\nLuffy takes this as a good sign, and a part of him knows that Zoro must be busy training. He can’t wait to have his first mate back at his side again.\n \n***\n \nIt is only after Arlong Park - after the mikan trees and the pain Nami has endured for so long - on their way towards Reverse Mountain and a fateful meeting with Laboon, that the question pops up for the first time.\n“Say,” starts Sanji as they sit on the main deck, all four of them playing a game of cards that Nami is unsurprisingly good at. “If I’m the cook, Nami-swan is the most beautiful navigator on all the seas, and Usopp is the sniper… I know the crew is small, but aren’t we supposed to have a first mate by now?”\nUsopp crosses his legs and throws down a pair of two’s alongside a  take that!  that has Luffy wrinkling his face in annoyance. “Now that you mention it, yeah.” He says and smirks when Luffy has to pass on his turn and falls into last place.\nNami puts down a king, swiping the entire pile and winning another round before the rest of them can blink. She might not be robbing them blind of money, but old habits are hard to break, and she’d rather die than lose a game of cards with these loveable dorks.\n“Well, I was technically the first crew member, so I guess it falls onto me.” The ginger says it like she can’t quite imagine anything worse than taking on any more responsibility. “Not like we can trust our captain to act rationally.”\nThe look she directs at him is as exasperated as it is fond.\n“Shishishi,” Luffy puts down his cards, not the least bit salty at having lost for the nth time. “Nami isn’t our first mate - we already have one!”\nThe three of them look at him as though he has grown an extra head. Sanji lights a cigarette and Nami cocks an eyebrow, clearly waiting for him to elaborate on his outrageous statement - the ship isn’t that big, and she is certain her captain hasn’t picked up another wayward teenager since she last checked. Although with Luffy, one can never be too certain.\nThe captain doesn’t elaborate, but he grabs the deck of cards and starts shuffling with a wide grin on his face. “One more round!”\n \n***\n \nWith a plea from Vivi, a princess and a duck become part of the life onboard the Going Merry. He sees Robin again, if only for a second and with a threat on her lips.\nThey make it all the way to Little Garden before Luffy has the nagging feeling that he is forgetting something  important. \nIt is a throbbing at the base of his skull, like a pounding headache and a warning wrapped in one. He doesn’t heed it, because he needs to go and save his crew from the  stupid  Baroque Works agents. Zoro isn’t there when Luffy arrives at the spinning candle slowly turning Vivi, Nami, and this time, Usopp too, into wax figures.\nIt doesn’t go quite the same way as it did the last time.\nLuffy is stronger, more protective, and he can’t help the wave of anger he feels when he can hear his friends have trouble breathing through the wax particles hanging in the air.\nThe fight itself isn’t hard, but what comes after  is. \nBecause Luffy forgot.\nForgot something  important,  and Nami is suffering because of it. Because of him.\nHe didn’t remember that this is where Nami gets bitten. Gets infected and fever ridden and nearly dies as a result.\nThe Going Merry is unusually quiet as they head towards an island in the distance, one made of snow and ice. Somewhere in the little winding towns and on the icy roads runs a reindeer who thinks himself a monster.\nThey arrive to hostility and fear in abundance. Luffy knows why, remembers with an unprecedented anger as soon as he hears someone say the name  Blackbeard.  He grits his teeth and the inside of his cheek bleeds with a temper that seethes and boils.\nHe shakes his head to clear it, if only for a little while, because he is a captain and Nami needs him right now. So he climbs and fights and suffers from frostbites that aren’t nearly as bad this time. Luffy doesn’t relax until he has made it to the castle and he hears the familiar  tap tap tap of little reindeer hooves trudging through the snow. He begs all the same.\nTony Tony Chopper listens, and answers his plea.\nWhen Luffy wakes up, Nami is safe and recovering again, (how could he  forget,  what kind of captain  does that? ) and he beats the crap out of Wapol. It is a poor substitute for the fury that started as an itch when he heard Blackbeard’s name, but it will do for now.\nChopper is bawling his eyes out again, watching cherry blossoms bloom on a winter island and vowing to become the best doctor the world has ever seen. He might be a monster to some, but he is  their  monster,  their doctor, and the Straw Hat pirates leave Drum Island with one more crew member onboard their ship.\n \n***\n \nChopper is the one to point it out after they arrive in Alabasta.\n“Luffy, aren’t you having trouble sleeping? Do you want me to make some medicine for you?” He is tugging on Luffy’s clothes with a tiny hoof, blue nose wrinkled with worry.\nEver since they have gotten closer to the desert kingdom, his captain has been sleeping less and less. Nami has noticed too, Chopper knows, but Luffy has shrugged off her concern every time. Except Chopper is a doctor, and Luffy might be his captain and a friend, but he is also a constant patient.\n“I’m fine,” Luffy says with a grin, the dark circles under his eyes a stark contrast to his statement. “Don’t worry about it Chopper!” The response elicits another frown from the reindeer, and Luffy decides that that won’t do and proceeds to tickle the heck out of their doctor until he is a laughing and whimpering mess of a reindeer.\nLuffy doesn’t tell them that his mind is whirling full of possibilities of what could go wrong. He trusts his crew, trusts them with his life and the kingdom of Alabasta, but they are young and inexperienced and more than ever, Luffy feels the Zoro-shaped hole at his side.\nAlabasta will be a trying time for them all, and Luffy can’t be everywhere at once. There are dangers around every corner and Luffy knows they will have to stand on their own two feet. He is prepared for Crocodile this time, but even with all the extra training, his body isn’t up to snuff yet.\nHe can’t relax. He can’t sleep.\nLuffy keeps one eye open at all times, reassuring himself that his crew is  still here.  He naps as much as he dares, but jerks awake at every little sound and it is taking its toll on him.\nWhen Ace is standing on the railing of the Going Merry, Luffy’s shoulders sink into a semblance of relief that hasn’t been there for days. It is his first time seeing his brother since he ‘came back’ and it punches him in the gut like an elephant gun.\nThe hug they share is tighter than usual but Ace merely laughs and ruffles his hair like he always does. He bows and thanks the crew for taking care of his little brother, and Luffy tries to stifle the tears threatening to burst out of him. He clings and clings and clings, and when Ace decides to stay for a few days, he slips into a deep sleep that settles a part of him.\nAce is breathing, carding a hand through his hair as Luffy has his head in the other man’s lap and fists clenched in whatever clothing he can reach.  Ace is alive,  he tells himself and breathes in the scent of embers and warm sunlight that clings to his brother’s skin. Around him, Usopp talks in his sleep, Sanji snores, Nami turns with a murmur and Chopper breathes through his stuffy nose with a little whistle of a sound.  His crew is alive. \nHe ponders, if only for a second, whether he should tell Ace.  Don’t go after Blackbeard, please, please, please. \nWonders if he can change anything if he utters three different words instead.  Sabo is alive. \nIn the end, he says neither. Ace keeps watch over the mismatched crew his little brother has gathered, and Luffy sleeps like a rock for the first time in a while.\nWhen Ace gives him his vivre card the next day, Luffy grips it tight in his hand. “Thank you,” he says with a smile. He pulls Ace into another hug, clings just a bit more for now and allows himself to have this. “I love you.” His voice trembles and Ace stills.\nThey have never said it out loud before, but Luffy won’t let that stop him now. He loves his brother. He knows Ace is still struggling with the mere thought of his existence and if this can help relieve a fraction of that doubt, Luffy will say it as many times as he can.\nLuffy pretends not to notice the wet sheen to Ace’s eye when they let go, and the man brings down the brim of his hat and sniffles for a bit. “Ah, got some sand in my eye.”\nChopper tells him sand in the eyes can be dangerous, but Nami merely pats his head and whispers how it is a metaphorical grain of sand. The doctor doesn’t quite understand, but he lets it go anyway. He is good like that.\nNot warning Ace about Blackbeard is gnawing at Luffy’s stomach, but a part of him knows that from where he stands, he cannot prevent this. Another part of him, his heart - heavy and full of faith - knows that out there in the world, a swordsman wanders and is causing havoc.\nA first mate that will hunt the people who hurt them, before they have a chance to do so again. So Luffy says nothing, ignores the pit in his stomach, and trusts Zoro to have his back this time too, albeit in a different way.\nLuffy looks forward instead, fights Crocodile to hell and back, and comes out of Alabasta without a claw through his chest, his friends still safe, and Nico Robin stowing away on the Going Merry.\n \n***\n \nAt Mock Town, they are still laughed at. What Luffy doesn’t see is Blackbeard’s vile face choking on pies and alcohol, and he knows he made the right decision not to tell Ace in Alabasta. Knows he made the right decision to trust his first mate.\nZoro and him have always been on the same wavelength after all, no matter how many years or miles apart.\n \n***\n \nSkypiea is harder than anything Luffy has ever done.\nNot because the fights are harder, but because the separation of the crew tastes like sour failure on his tongue. He knows about mantra now, and what to expect. But that knowledge doesn’t stop his crew from being beaten within an inch of their life, and Luffy tries so,  so  hard to finish his fights faster so that he can help his friends.\nHe can’t, because Enel is a bastard and despite his best (worst) efforts, a civil war breaks out anyway. Usually it would have been fine - Luffy will focus on the big guy pulling the strings - except his first mate isn’t there to pick up the pieces, and everyday pushes Luffy into the role of both captain and acting first mate.\nOne day soon, he thinks he might break under the pressure of it all.\nHe wants his crew, his friends, his  family  to be safe.\nLike any good pirate, Luffy  wants-- \nBut he knows that, for now, he can’t have what he wants.\nSo he beats Enel and makes up his mind. After they party and steal enough gold to satisfy Nami’s cravings, Luffy sits them all down onboard the deck of the Going Merry, more serious than his crew has ever seen him before. He tries to put a smile on his face like usual, but it doesn’t come to him quite as naturally as he hoped it would. Robin, ever so perceptive, takes notice.\n“What is wrong, captain?” She asks, and her soft tone is enough to draw the attention of everyone else. Chopper is close to dozing off on Usopp’s lap, but he snaps out of it and Usopp grips his fur just a bit tighter than usual. Nami, too, stays quiet. Sanji inhales another puff of smoke from his cigarette.\nLuffy twitches under their imploring gazes. He isn’t used to being this serious, but he can feel the necessity of it all down to the tip of his toes. Knows what awaits them, and that they are running out of time.\n“I want us all to train together. I want all of us to get stronger. I don’t want to let anyone feel like they’ve been left behind.”  I don’t want to lose any of you,  he doesn’t say, but he thinks they hear it anyway.\nNami frowns. “Geez, captain, and here I thought it was something serious.” She flips her short hair with a huff of annoyance, and Luffy knows she won’t mention the tears in his eyes or his wobbling lip.\nExtinguishing his cigarette, Sanji stands and dusts off his pants from imaginary dirt. “Why not? Wouldn’t hurt.”\nUsopp’s knees are quivering so hard Chopper nearly gets knocked off his lap, but both of them nod their heads and Luffy hasn’t seen their faces so determined in ages. “G-gotta make sure captain Usopp and his army of eight thousand men stay sharp!”\n“Mh!” Agrees the reindeer, curling his little hooves into what resembles fists.\nRobin says nothing, but the way she regards her captain feels a bit like she is stripping him raw. Like she knows more than she should. She smiles at him, the kind that doesn’t quite reach her eyes yet, and Luffy vows to make her smile for real soon enough.\nAfter he finishes beating his crew into the ground to make them stronger, of course.\n \n***\n \nTraining appears to have done little in terms of Usopp’s self-esteem. Knowing he will come back doesn’t make the sniper’s departure any easier to endure, and this time Luffy doesn’t have Zoro’s shoulder to cry on. Instead, he curls around a pillow and sobs as quietly as he can into the cotton and bites his teeth into it to stop himself from wailing out loud.\nThe crew is tense, sensing Luffy’s distress and clings just a tad tighter to him with Robin gone too. It feels like he can’t breathe, and Water Seven is stifling with its winding channels and tall buildings.\nHe isn’t sure if they will make it through the ordeal at Enies Lobby unscathed, but Luffy is pleasantly surprised to find several of the CP9 agents suffering from what appears to be older wounds from swords that have cut too deep to heal.\nIt gives them the edge they need, and Luffy is floating on a cloud, even when he can barely move after fighting Rob Lucci and his stupid pigeon. His hand smarts from weak bouts of armament Haki and his skull throbs as it threatens to burst with the overload of information provided by his observation Haki.\nIt is weird, using Haki so early in their journey, but the years of training in solitude at Mount Corvo has paid off, if only a little bit, and Luffy will take what he can get.\nHe isn’t surprised when Merry comes to pick them up, her soft voice echoing in his ear as his heart cries out for her once more. She has been his home twice over, and she is just as much crew and family as the rest of them.\nWhat surprises Luffy, is the scrap piece of wood he finds on the deck as they make their way back to Water Seven. “What’s this?” It is not the same material as the Going Merry, but something within him urges him to pick it up.\n“Oh!” Says Usopp, looking at it with a strange look of bewilderment and a quick glance at Franky. “I found that when Franky took Merry and I to the hideout during Aqua Laguna. It was already there, propped up against the wall. I’ve been meaning to ask you Franky, did you make it?”\nThe cyborg stumbles over with a frown, grabbing the scrap of wood and turning it over in his hands. The rest of the crew lean in closer, trying and failing to appear uninterested. Franky whistles with his brows all the way up in his artificial hairline. “Woah, this is a  super  nice carving, but nah, I didn’t make this Usopp-bro.”\nThe piece of scrap wood looks so small in Franky’s large hands, and the Straw Hats take in the symbols carved into one side. It is a familiar lamb’s head, wearing a straw hat. There is a carved wreath underneath - a funeral wreath of different flowers that Luffy doesn’t recognize but knows must have been carefully chosen.\nThe captain plucks the wood from Franky with trembling hands and holds it close to his chest.\nRobin frowns. “A funeral wreath and a clear symbol of the Going Merry… One might think this a threat, captain.”\nImmediately, Usopp and Chopper start running around with their limbs flailing in every direction, accompanied by shrill yelling. Nami grows pale, clutching her wounds and scanning the horizon as though she expects another enemy to drop into their lap any moment now.\nLuffy smiles. “Nah,” he says and leaves it at that. The others don’t press, but they do relax at the conviction in his voice. He traces the carving with reverence, uncaring of whatever splinters might lodge themselves in his rubbery fingers.\nZoro hasn’t been on  this  Merry, but he mourns her all the same. It is only right that he gets to say goodbye to her too. Flowers wouldn’t keep, and Luffy doesn’t know when Zoro was in Water Seven, only that he  has been. \nWhen they give Merry the funeral pyre she deserves, the carved piece of wood is leaning against her broken mast. A message of mourning from a friend she didn’t get to meet in this lifetime, but feels a connection with all the same.\n Thank you,  she whispers, cradling their hearts in her hull for just another moment longer.  For taking me on adventures again. For loving me, one more time. \nThe Straw Hats cry as the flames consume her.\nFar from Water Seven, in a bar surrounded by ruffians and pirates alike on some remote island he can’t remember the name of, sits a swordsman with a cup of alcohol. A voice wraps around him, warm and familiar, and goosebumps break out across his skin.\nHe motions for another refill of his drink, and the bartender kindly ignores the tears dripping down his face as he pours him another one. Zoro raises his cup in the air, uncaring of who sees him.\n“To Merry,” he whispers. “Rest in peace, my friend.”\nThe tears don’t stop, and he makes no motion to dry them.\nTonight, he mourns the loss of a friend who has transcended time alongside him and his captain. Tonight, he wonders when he will see them all again and drinks, drinks, drinks some more.\nSoon, he thinks, and downs another bottle, loneliness a permanent structure in his chest after so many years apart.  I’ll be there soon,  he doesn’t say it out loud, but he knows Luffy will hear it just the same.\n \n***\n \nArriving at Thriller Bark is as surreal and as life-threatening as the last time. Brook has broken away from them, chasing his shadow somewhere. Luffy doesn’t quite know what happened between getting his shadow caught and Oars making his appearance, but he is eager to not repeat the debacle.\nNami, Usopp and Chopper make their way inland and Luffy tries to tell himself that everything is going to be fine. They managed fine without him before, and Zoro hadn’t been with them either. It doesn’t make it any easier listening to their screams and Mini Merry going missing.\nSanji yells and kicks, ready to take on the world, while the rest of them are down for a decent adventure of whatever awaits them in the fog and decay of the giant ship.\nKeeping his crew together doesn’t work, but Luffy manages to pack a lunch this time.\nTo the others, it doesn’t seem important at the time, but Luffy doesn’t know how else to explain the zombie’s weakness other than grabbing a piece of salted fish and ‘accidentally’ shoving it in the mouth of a whining zombie. “Whoops,” he says with no remorse whatsoever.\nA shadow pours out of its mouth with a pitiful wail, and Robin looks at Luffy again with that raised eyebrow of hers. “Interesting.”\nLuffy whistles and looks away - his armament Haki covered fist has a date with Moria’s smug Paramecia face any minute now - and he doesn’t have time to decipher Robin’s subtle comments and sceptical gaze.\nIt turns out not having Oars go on a rampage is pretty freaking great. So is keeping his shadow attached to his body.\nMoria goes down like a lead balloon only half-full of shadows this time, and Brook falls down to join them minutes before the sun rises. His shadow isn’t back, and for a short second, all Luffy knows is a terror that grips his heart and  squeezes  until he can’t breathe.\nThe skeleton is laughing away, saying it has been a good fifty-odd years of pseudo living, and Luffy wonders whether this happened before. Thriller Bark has always been a hazy blob in his mind, and while he can move slightly, his body is still suffering from the extra strain he has put it through.\nIt is no wonder that he forgot about Kuma ( don’t think about Sabaody, ) and his crew cries out in terror when the warlord shows up. The sun is dawning on the horizon, rays gleaming and Brook looks at it like a dying man awaiting his execution.\n“Yohoho,” he laughs, skull rattling and tipping his hat at the Straw Hats. “It was nice meeting you!”\nLuffy cries out, because they’ve just met again and he is not ready to let go. He will never let go again, that has been the whole  point  of this entire journey.\nStanding tall, one paw on a bible and another gloveless, Kuma ignores the commotion. “If you could take a trip anywhere,” he flexes his fingers. “Where would you go?”\nThe mountain of a man walks closer, and Brook stays in the sun.\nAnd the skeleton doesn’t burn.\nThere is a shadow beneath his feet, and a resounding crash from a tower as it is smashed into pieces. A samurai zombie plummets from the sky and into the ground.\nKuma pauses. They all do.\nAnother person follows the path down, down, down, like he isn’t bothered by the fall at all. Three earrings, three swords by his hip (Wado, Kitetsu and  Shusui  too), and green hair that Luffy knows like the back of his hand.\nThe scar on his chest isn’t there, but he has still lost an eye and something appears to have burned off part of his ear into a gnarled lump of flesh.\n“I think you’ll find,” says Zoro. “That we won’t be taking a trip anywhere.”\nWado slips from its sheath.\n \n***\n \nNami doesn’t know what to make of the newcomer. As if it isn’t bad enough that there’s a  second warlord right after they have finally beaten Moria, some suicidal maniac jumps out of a tower. Seriously, that kind of fall should kill anyone who isn’t Luffy, but instead the man just stands and quips like Kuma hadn’t just erased the ghost girl out of existence with a tap of his hand.\n“Roronoa Zoro.” Kuma states and turns from the injured Straw Hats to face what is apparently an enemy of the warlord. (Finally, a bit of good luck. An enemy of my enemy is a friend, at least for now.)\n“Kuma.” Snarls Roronoa Zoro, one sword half out of its scabbard.\nThen her captain laughs like a lunatic, lying on a rock with what is undoubtedly an entire set of bruised ribs and some internal bleeding for good measure. “Zoro!” He yells and throws his hands into the air with all the manners of a child.\nChopper beats Luffy back into a somewhat resting position and then seems to think of what just left his captain’s mouth. “Eh? Luffy, you know this guy?!” His eyes nearly pop out of his head, and Nami might have found it funny any other day of the week if they weren’t still in mortal peril.\nHer captain can barely move, Robin is on her knees with exhaustion, Sanji is trying and failing to light a cigarette with trembling hands, Usopp is crying behind a rock, Franky’s hair is floppy and devoid of cola, and Chopper is too busy fretting over all of them to pay attention to his own injuries. Brook, alone, stands in the sun and cries (“Ara, I can cry even without eyes, yohoho…”)\nNami grabs her clima tact and turns back to the battle between Kuma and this Roronoa Zora, except--\nExcept it isn’t much of a battle. Kuma is on the ground, bleeding but breathing, and the swordsman is sheathing his sword again. His shoulders are drawn up to his ears, so tense she can see his outline shivering from the strain.\nKuma taps himself with a pawed hand, and suddenly he is gone.\nNothing left but a bunch of injured Straw Hats and a stranger who just  annihilated a warlord.\nNami gulps and clutches a dial on her clima tact, ready to unleash a hellstorm if need be. She is by far the least injured out of them all, and she will protect her crew.\nThe swordsman looks at them, one by one (is he trying to find the weakest link?), until his gaze settles on Luffy. “That reminds me…” He starts digging around in a pocket in his robe and pulls out a small coin purse. This ‘Zoro’ fellow chucks it at Luffy and there is a faint  clatter  from the purse that sounds like money.\nNami dives for it, Beli signs in her eyes, and grabs it without a second thought. Luffy is laughing, trying to sit himself up on the rock he is perched on. Usopp’s protests in the background fall on deaf ears, because Nami can spot something shiny and glittering at the bottom of the purse.\nShe shakes out the contents, and wishes she hadn’t.\nTen fingers, grimy with little black hairs, clearly chopped off from what had once been a living human and still wearing the golden jewellery to prove it, land on the ground. “Eeek!” She might puke, and not even Brook is making a joke. Sanji is looking green in the face - actually all of them are, except for Luffy.\nHe stares at the fingers with a near revering look on his face. “Is this--?” Luffy reaches out to touch them, but Chopper slaps his hands away with a screech of  don’t touch it! \nZoro sits down on the ground, apparently content as he pulls a bottle of sake from somewhere in that spacious robe of his and takes a big swig. He is grinning at the fingers. “A gift for the captain.”\nNami is pretty sure it is more of a threat than anything else.\nBy the frown on Robin’s face, she takes it that way too.\n“Wait just a second!” She rounds on Luffy, ready to smack him over the head and ask what the hell is going on, but her anger falls short.\nThere are tears dripping down his face, snot too, and he laughs. Laughs loud and long and like a great burden has been lifted from his shoulders. “Good,” he mumbles and tries to wipe his face. He only manages to somehow make it even worse. “Good.”\nLuffy repeats it like a mantra through the tears and the laughter as he eventually tapers off into quiet sobs that still shake his whole body. Nami has to remind herself that her captain is seventeen, and while the sight of severed fingers doesn’t appear to frighten him - whatever meaning is behind the ‘gift’ is something of monumental importance to him.\nShe sits down next to him and lets him rest his head on her shoulder. Normally she would complain about his messy face and the stains she will have to wash out, but not right now. Her captain is crying, and she wants to comfort him.\n“Luffy…” Chopper must feel the same way, because he climbs into Luffy’s lap and pretends not to wince when he is squeezed in a hug. It doesn’t take long for the rest of the crew to join them in some sort of impromptu pile of affection, everyone having at least some form of contact with Luffy.\nThe swordsman stays seated, a handful of steps away and drinking. He doesn’t bat an eye at Luffy’s crying, but his fingers twitch. Nami can’t tell whether they’re twitching to reach for a sword, or something else.\nShe thinks he might leave, but then Luffy is making grabby hands in the air, nearly suffocating under the bulk of his crew as they lie on top of him, and Nami sees the fond smile on Zoro’s face.\nThere is barely any room, but he squeezes himself in between Usopp and Franky, settling behind Luffy and letting the exhausted captain lean on his broad chest in a practiced motion.\nLuffy snakes a hand around the man’s wrist, two fingers resting on a pulse that is beating and steady and  here.  He burrows his face into Zoro’s chest and tucks his head under the other man’s chin. Seconds later, her captain falls limp and she can hear him snore.\nShe makes eye contact with the swordsman.\n“Yo.” He says it as a way of greeting, clearly pretending Usopp isn’t still a quivering mess beside him, but he pays him no mind other than offering the teen his half-finished bottle of sake. “I’m Roronoa Zoro.”\nNami cocks an eyebrow at him, because that doesn’t explain anything.\n“The first mate.”\nOh.\nSomehow, it is not as weird as it probably should be.\n \n***\n \nBrook doesn’t know this swordsman, and neither do any other Straw Hat except for the captain. He can’t help but think that perhaps this Roronoa Zoro isn’t all that bad - he did give Brook his shadow back, after all.\n \n***\n \nZoro carries their captain back to the Thousand Sunny and climbs aboard as though he knows every nook and cranny of the ship. To Franky, he is an odd-ball and he can’t relax near the other man yet. It isn’t until he sees him tuck Luffy into a bed in the infirmary and brush aside a lock of his captain’s hair, that he thinks having the swordsman onboard might not be such a bad thing.\nStill, for someone who got lost five times on their way to the ship, the man is awfully familiar with Sunny’s layout.\nFranky is tempted to remodel several areas, just to see if the swordsman will even notice.\n(And no, it is not because he is bitter that Zoro turned down a grand tour of the Sunny. It is  not. )\n \n***\n \nOn the first night after Thriller Bark, Robin is on watch.\nRoronoa is a strange character - part of her wants to be wary, as mistrust is deeply rooted within her very being. But her captain had smiled at the man, had clung to him without hesitation and had shed tears in his presence.\nIt is a privilege the Straw Hats have not witnessed often despite their long time at sea together and sharing close quarters.\nIt took Roronoa less than five minutes to gain that kind of trust from her captain.\nThe swordsman still hasn’t left Luffy’s side, and last time she peeked into the infirmary, both of them had been asleep in the same bed, snoring away.\nShe decided then not to keep the extra eye, but she does keep the extra ear.\nWhich is why she isn’t surprised when she hears the soft gasps and choked cries that accompany a nightmare. What surprises her is that they come from the swordsman.\nThe door to the deck opens, and Roronoa steps out on unsteady feet. He leans over the railing, gasping in lungfuls of sea air and she can see the pulse in his neck throb far too quickly. His brow is lined with sweat, and he shakes where he stands.\nThis won’t do, Robin decides, because her captain has already claimed this man as one of them.\n“Swordsman.” She announces her presence, because she has no doubt he might accidentally punch her in the throat if he gets spooked.\nHe doesn’t spook, but he does tense and keeps his gaze on the sea.\nShe stands next to him, and takes a chance. She knocks their shoulders together for a brief moment.\nZoro breathes out, wills his pulse to calm down and leans into her side with an unprecedented amount of trust for a man who has lost an eye and most of an ear.\nShe feels him grip her hand but she stays calm. They admire the dark sea in a companionable silence.\nMuch like the dear captain, this man seeks contact in small ways. Like he can’t quite believe someone is there unless he can feel them.\nRobin wonders how many people this man has lost, to trust strangers so completely.\n \n***\n \nChopper doesn’t like the smell of the swordsman. It is steel and blood, lingering so close to his skin that the reindeer knows it won’t come off no matter how many showers the man takes.\nLuffy is sleeping in one of the infirmary beds while Chopper reapplies bandages. Zoro hasn’t left the captain’s side in the days he has been onboard their ship, but Chopper has managed to bully the other man into not drinking while in the sickbay. Luffy, meanwhile, has somehow managed to sleep through all of it.\nZoro’s one eye is trained on the practiced motion of his hooves slathering some ointment onto the bruised parts of Luffy’s skin that aren’t covered in bandages.\n“You’re a good doctor.” Says Zoro, without any prompting.\nChopper, despite his will to live and fear of the man, swears at Zoro with his usual fervor and a blush visible through his fur.\n“Th-that sort of praise doesn’t make me happy at all, you stupid swordsman!”\nInstead of a sword to the face, Chopper gets a genuine smile, and underneath the steel and the blood there is something like cherry blossoms. It smells like fondness and devotion.\n \n***\n \nSanji is pretty sure the swordsman has a drinking problem.\nLuffy has always insisted they keep a large stash of alcohol aboard their ship at any given point in time, despite none of them drinking hard liquor more than once in a blue moon. But when he checks the cabinet on the third day since the stupid moss-head came aboad the Thousand Sunny, there is one bottle left  and it’s not even the good stuff! \nNaturally, Sanji flies out of the kitchen door with fire in his eyes and a shoe aimed at the swordsman’s head. “Oi, moss-head!” He is blocked by a sword and a yawn. Zoro has grass in his hair from where he must have been napping on the deck. “There is one bottle of sake left, you bottomless pit! What if Nami-swan and Robin-chan want a drink later, huh?!”\n“Then stock up better.” The guy grumbles, unafraid of Sanji’s mounting wrath.\n“Hah?!” He can’t stop his eye from twitching at the sheer audacity.\n“I said ‘then stock up better,’ are you going deaf in your old age?”\nFlinging his head forward, Sanji headbutts the guy that is clearly the same age as himself. “If anyone is deaf, it’s you, you shitty, drunken moss-head!”\nHe gets a headbutt in return, and both of them are growling at each other, unrelenting. If the swordsman wanted to, he could have drawn any of his three swords by now and cut Sanji’s hands in the same way he had delivered ten severed fingers to Luffy.\nZoro doesn’t, but he screeches insults at a volume Sanji is quick to match.\nNo, they definitely don’t get along, but Sanji can feel his stress melting away as they bicker.\nFor a moss-head, he doesn’t seem half-bad.\n \n***\n \nTheir captain wakes up in time for dinner, after sleeping for three whole days.\nIt has been weird having their so-called first mate onboard, and Usopp is still scared witless whenever the swordsman goes near him.\nHis knees start wobbling and Usopp simply freezes.\nSo when the entire crew settles down for dinner that night, Usopp tries hard to ignore his racing heart and the sweat on his brow. He spoons a mouthful of sea king curry into his mouth and tries not to tremble when he reaches for a glass of water.\nZoro isn’t even looking at him and Usopp feels like he can’t breathe.\nThe swordsman is sitting next to Luffy, who is steadily shovelling three days worth of meat into his mouth with the unhinged jaw of a python. It is not an uncommon sight, but most people still recoil from it. Zoro doesn’t, instead he throws an arm over the back of Luffy’s chair and sips his sake.\nUsopp thinks he might be the only one who is still on edge around the guy, because no one else seems to give a damn about the stranger in their midst.\nHe might say something about it, if he can pluck up the courage, but then he spots one of Luffy’s hands  not shovelling meat into his mouth. The hand is picking up a bowl of rice and another helping of sea king meat, but he puts it down in front of Zoro like the captain sharing his food isn’t the biggest crime on the planet.\nLuffy  never  shares his food.\nApparently, he does with Zoro.\nUsopp can’t stop himself, because he is pretty sure he just entered the twilight zone, and talking is a way of coping with absolute, mind-numbing terror. “Did you kill the guy you stole the fingers from?” Oh, he put his foot in his mouth, didn’t he?\nEven Luffy has stopped eating.\nThe dinner table grows uncomfortably silent in the wake of his question. There is no doubt who he asked. Usopp knows that they are pirates - they are criminals and they plunder and steal, but never before have they killed or tortured purposefully, like those ten severed fingers implied.\n“I did.” Zoro takes a swig of alcohol ( the last bottle, moss-head! ) and doesn’t appear the least bit regretful. “I watched him bleed out and cut his head off for good measure, too.”\nChopper’s upper lip trembles, no doubt the doctor in him already imagining the bloodbath it must have been.\nLuffy - sweet and kindhearted Luffy - doesn’t appear the least bit troubled at the fact that the swordsman just confirmed his part in voluntary manslaughter and torture. Like the captain isn’t sitting next to a coldblooded killer.\n“Usopp,” says Luffy, because apparently Zoro is done with the conversation as he goes back to nursing his sake. The eyes of his captain are tempered steel and they pierce Usopp to his core. “I’m glad he’s dead. I’m glad you’ll never get to meet him. I’m glad Zoro hurt him.”  Like he hurt me,  remains unsaid.\nLuffy doesn’t mention a name, but Zoro’s hand reaches up to his gnarled ear and traces it, his mind a thousand miles away. Suddenly, Usopp  is  glad to not have met the man who could have scarred Zoro (Zoro, who chased away a warlord the size of a mountain with nothing but a single sword).\nPart of Usopp knows that if they had crossed paths with whoever gave Zoro that scar, the crew would have been killed. Of that, he has no doubt.\nZoro might be scary, but part of Usopp is grateful for that trait.\n \n***\n \nOnly once more had the question of first mate popped up in conversation, before they had encountered the perpetually tipsy swordsman.\nIt had been after the chaos that had been Enies Lobby, with the newly christened Thousand Sunny and a cyborg shipwright on their crew.\n“Ay, ay, who’s the first mate?” Franky had knocked his hands together and posed, clearly expecting a straightforward answer that none of them could give. They had all been gathered on the lawn deck, and the man had frowned when no one jumped to answer him.\nLuffy had been napping, the rest of them enjoying the sun but nevertheless awake. Nami had kept one eye on her captain, and spun an answer that sounded stupid even to her own ears. “We don’t have one. Whenever we ask Luffy he just laughs it off and says we do, but we’ve never seen neither hide nor hair of a first mate.”\nRobin had nodded assent to the statement. “I have tried to ask our captain as well, but he has proven unusually adept at avoiding the topic.”\n“Technically Nami was the first crew member, so I guess she’s it?” Usopp said it like a question, and yeah, they probably should have discussed this way before they made it this far into the Grand Line, but hindsight was twenty twenty.\nSanji raised a hand in the air, puffing out cigarette smoke in the shape of hearts. “Yosh, all in favour of Nami-swan as our first mate?” The rest of them raised their hands. Chopper had said she deserved the title since she was the one keeping them on track anyway, especially whenever the weather turned bad or Luffy chose to ignore all common sense.\nNami had frowned. “Acting first mate, then.” She had agreed at the time, despite the unease at the sheer amount of responsibility resting on her shoulders.\nInside her chest she had known that she wasn’t really what a first mate should have been like. Sure, she could yell at them and they’d listen to her orders, but she had never been a solid rock in the way a first mate needed to be. She was constantly scared, out of her mind with worry, or telling Luffy what he  couldn’t do, only to have the rubbery captain turn around and prove her wrong.\nSo when she sees Luffy sitting on the railing with a fishing rod, Zoro on the deck and napping no more than two feet away, she thinks Luffy was right about already having a first mate - that first day they had asked, playing cards and nearly getting themselves killed on Reverse Mountain.\nNami can’t be the rock the crew needs. She doesn’t have the same fire in her chest that she can sense in Zoro.\nSaid man’s head lolls to the side, his snores soft and relaxed, and Luffy leans back to run one hand through the swordsman’s green hair.\nIt isn’t an ease that has appeared in the span of the week Zoro has been with them.\nIt is the sort of trust that can only come from near death experiences and shared grief. Part of her wonders how long they must have known each other. Another part of her is glad that she can stop being acting first mate now, even if Zoro can’t tell right from left and drinks every time he sees a bottle. She wouldn’t make a good first mate anyway, no matter how much Sanji insists.\nZoro had killed a man for Luffy (has probably killed more than one).\nNami loves her captain, but that is a line she can’t cross yet.\nZoro can, and doesn’t seem opposed to doing it again if the need arises. Zoro can hold his own against a warlord and walk away. Zoro can hold Luffy when he cries, because he can pick up the slack when his captain crumbles. He can be the rock they  all  need.\nNami can’t do that.\nBut Zoro can.\n \n***\n \nLuffy hasn’t slept this well since Zoro left Dawn Island over three years ago.\nThey are still missing Jimbei, but the crew feels more whole again. Complete, for now, as they make their way to the Sabaody Archipelago. Luffy can’t boast of having received many gifts in his lifetime, but the severed fingers of Blackbeard had his body relaxing within seconds. With Blackbeard gone, Ace’s vivre card had remained unchanged, and although Zoro’s ear is mangled from what Luffy knows is a scar from the yami yami no mi, his chest swells with pride every time he sees it.\nHe can see the mangrove in the distance, from where he sits atop Sunny’s mane. Sanji and Zoro are bickering over something stupid in the background, and Nami is without a doubt two seconds from knocking them both over the head.\n“Shishishi,” Luffy laughs, and gets ready to disembark on the weird non-island consisting of trees. Hachi has promised them takoyaki in return for their help with Camie, and his mouth is already watering at the thought. He remembers the taste well enough, but it has been so long  a lifetime  since he has had them. “Takoyaki! I can’t wait!”\nThe argument behind him has died down, and he senses Zoro close by. The swordsman doesn’t dare step foot on his special spot on the Sunny, but there is a devilish grin on his face that promises adventure when Luffy turns to look at him.\n“Oi,” yells Usopp, pointing a quivering finger at Zoro. “What’s up with that smirk of yours? Knock it off, it’s sca-sca-scary!”\nLuffy cocks his head, but Zoro keeps the grin and shrugs. “You’ll see.” He says, more mysterious than he has any right to be. “I think you’ll like this present, too.”\nHe hadn’t been expecting another present from his first mate - having Zoro close again is a present enough in itself - but then they get to the little takoyaki stand and Luffy eats his own words.\nThree patrons are casually waiting for an octopus fish-man to start cooking.\nLuffy knows these people. Hadn’t expected to see them  here,  of all places.\n“Go on, captain, they’re waiting for you.” Zoro gives him a push forward with a snicker, and Luffy didn’t think he could love the other man more than he already does.\nBon Clay is munching away on a handful of dried squid, not a bandage on him and a grin on his face as he laughs at something  Sabo  just told him, the top hat and pipe unmistakeable even after all these years.\nPortgas D. Ace sees him staring, pulls out a stool and pats the seat. “Come on, Luffy! We’re gonna have an eating contest!” His brother laughs, his chest unmarred by magma and  alive. \nThree people he didn’t think he would ever see sitting next to each other, but here they are. “Wait for me!” He slingshots himself into his brothers, and the friend who gave his life for him so long ago. Luffy laughs through his tears and grins so wide even his rubber cheeks ache.\nZoro always knows what he needs the most, even before he knows it himself.\nAnd  this,  thinks Luffy, is what he has needed all along - his crew settling in around him, next to his family until he can’t tell them apart, as they trade stories and eat their weight in takoyaki.\nThis has been worth the wait."
}