{
    "id": "33944716",
    "url": "https://archiveofourown.org/works/33944716?view_full_work=true",
    "author": [
        "Monkeygirl77"
    ],
    "title": "What A Deku's Capable Of",
    "rating": "Not Rated",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Midoriya Izuku & Takami Keigo | Hawks"
    ],
    "characters": [
        "Midoriya Izuku",
        "Takami Keigo | Hawks",
        "Aizawa Shouta | Eraserhead",
        "Nedzu (My Hero Academia)",
        "Hero Public Safety Commission (My Hero Academia)",
        "Hero Public Safety Commission President (My Hero Academia)",
        "Class 1-A (My Hero Academia)",
        "Yagi Toshinori | All Might",
        "U.A. Faculty (My Hero Academia)",
        "Bakugou Katsuki"
    ],
    "additional_tags": [
        "Genius Midoriya Izuku",
        "Scary Midoriya Izuku",
        "Sadistic Midoriya Izuku",
        "Hacker Midoriya Izuku",
        "Hero Public Safety Commission President Midoriya Izuku (My Hero Academia)",
        "Hero Public Safety Commission Bashing (My Hero Academia)",
        "Parental Takami Keigo | Hawks",
        "Midoriya Izuku is a Little Shit",
        "Soft Takami Keigo | Hawks",
        "Sadistic Nedzu (My Hero Academia)",
        "Nedzu is a Little Shit (My Hero Academia)",
        "Izuku is 14 years old",
        "And President of the HPSC",
        "Bully Bakugou Katsuki",
        "Protective Takami Keigo | Hawks",
        "Bullied Midoriya Izuku",
        "Takami Keigo | Hawks Adopts Midoriya Izuku",
        "General Education Department Bakugou Katsuki",
        "Yagi Toshinori | All Might Bashing",
        "Update: End Of Chapter Notes"
    ],
    "language": "English",
    "series": "",
    "published": "2021-09-18",
    "completed": "2022-05-06",
    "words": "6,839",
    "chapters": "2/2",
    "comments": "88",
    "kudos": "6,112",
    "bookmarks": "1,082",
    "hits": "57,483",
    "summary": "<p>Izuku grins to himself as he looks around the spacious office space and finds himself staring up at the HPSC emblem emblazoned on the wall across from the desk, crossing his arms in that self-satisfied way, his grin turns a tad bit feral. <em>You can be a hero Kacchan, go on, it’s all yours. I get it, I can’t be a hero, it’s just not in the books for me. No. I’ll settle. I’ll be your fucking boss instead.</em></p>",
    "notes": "",
    "text": "Summary: Izuku grins to himself as he looks around the spacious office space and finds himself staring up at the HPSC emblem emblazoned on the wall across from the desk, crossing his arms in that self-satisfied way, his grin turns a tad bit feral. You can be a hero Kacchan, go on, it’s all yours. I get it, I can’t be a hero, it’s just not in the books for me. No. I’ll settle. I’ll be your fucking boss instead.\n\n…\n\nAfter bandaging his burns and other various wounds, Izuku washes his hair carefully under the faucet of the bathtub, puts on his nicest suit, tries to tame his otherwise untamable curls. Finishing his attire with a pair of dark sunglasses, he makes his leave from his otherwise empty apartment, whistling pleasantly as he makes his way to work.\nHe’s got himself a nice job. With a nice office, awesome desk chair, a nice view of the city.\nAt fourteen he’s doing pretty good for himself.\nStepping into the large lobby of the massive building, he smiles at his employees as he walks passed them towards the elevator, humming under his breath as he steps into the first one to open, he presses the button for the level his office is on and folds his hands together behind him as the doors close.\nOh, did he forget to mention that he’s the President of the Hero Public Safety Commission?\n…\nWith heroes flanking him, he steps up to the podium on the stage in the HPSC Headquarters auditorium, he vaguely hears Hawks ‘he is an adorable little baby bird like how—’ but he pays him no mind. “Hello,” he leans into the mic. “As President of this somewhat fine establishment, my first order of business is making some changes, can those who were and or are a part of the Paragon program stand up please?” He hears the winged hero inhale deeply at the mere mention of the program, some of the other heroes behind him mutter questioningly between each other, Izuku feels predatorial eyes stabbing into him from behind. People stand, men and woman, of all different departments, all working in one heinous program. “Good, thank you, you’re all fired. Get out.” Muttering and denials break out among his gathered employees and he nods. “Oh no, I’m being very serious, you know where the exits are, you have ten minutes to exit my building before law enforcement gets involved.”\nMore whispers behind him.\nHe hears the winged hero whisper to himself too softly for him to pick up.\n“Awesome, can those who determine the hero rankings stand up.” Hesitantly more people stand. “Great, thanks a lot, you’re all fired too. Leave.” Izuku waves as they slowly leave, throwing him nasty looks, some on their phones, undoubtedly with their lawyers. That’s fine, he has more than enough incriminating evidence against every single one of those individuals to win any matter of court cases. “Good, now that we took the garbage out, we can move on. Anyone who puts profit or reputation over actual factual statistics will not have employment within my Commission. We stand with the people and for the people, we work with the heroes we do not lord over them like a puppet master controlling the strings. Anyone who willingly puts innocent lives in danger, whether it be civilian, hero, or villain, will have no place in my Commission.”\nThe greenette holds his hand out and an intern sets a thick file folder on it. “Speaking of which, starting now, all those with life contracts are hereby released from their contracts.” Izuku turns as he pulls the heavy file in before he can drop it. “Hawks, come here for a moment.” Hawks blinks in shock for a moment before stepping forward as was requested, it’s comical, how much the man towers over his boss. “Here.” The hero fumbles to catch the thick file when it’s tossed at him. “Your contract is terminated. Do with it what you want. You want to be a hero then be one of your own accord. You’re a human. I won’t own a human.”\n…\nSometimes Izuku forgets his the President of the organization that oversees the entire hero community, especially when he’s at school, only when he’s at school, facing Kacchan and his lackies periodically through the day.\nLike, when Kacchan burnt his notebook and backpack and shoulder, Claws carved into his arm, and he was shoved into this utility closet some two hours ago. Checking the time on his wrist watch, he heaves a deep sigh, he’s going to be late for work at this rate.\nTugging his burnt backpack closer, he prays mentally that his work phone is still intact, his prayers are answered when he opens the front pouch of his bag and his sleek smart phone is in perfect condition. Opening his contacts, he debates on who to reach out to, they all technically worked for him, so they all should respond.\nHe chooses Eraserhead and Hawks. They’re in the area today. He shoots off the messages and sits back, looking back when his phone dings two confirmations, and waits patiently.\nTen minutes later there’s voices on the other side of the closet door, he pushes himself to his feet, and the lock clicks from the outside before the doors tugged open.\nThe winged hero grins at him for a moment, grin slowly fading as he takes in his appearance. “Boss what happened?\"\n“Boss!?” He flinches and glowers at the voice of his once childhood friend, of course he’d be here, though he doubts his bully would recognize Eraserhead, Hawks was rather recognizable, the wings were a dead giveaway, of course he’d follow. “Why’re you calling a quirkless Deku boss!”\nIzuku looks down to his backpack as he leans over to grab it, ignoring the stares of the two heroes on him for the moment, and grimaces when he pulls the strap up over his burnt shoulder.\nHawks eyes him contemplatively, exchanges a glance with Eraserhead, and turns to the younger blonde standing behind the janitor they’d called on. “Because he signs my paycheck.” Gold eyes narrow dangerously. “Did you just call him useless?”\n“That’s what he is!” Bakugo shouts. “I don’t know what bullshit—”\nHe has enough of this conversation, he just wants to leave, go home and tend to his injuries, and just climb in bed. So he steps forward, between the two heroes, knowing they’ll follow after him, and pauses in front of his explosive bully.\nBiting back his nerves, he turns his head, even cool emerald eyes meet burning red. “You’ll never be a hero, Kacchan, never, trust me, you’ll never get the chance.”\n…\n“So,” Izuku stares the two men before him down, Hawks standing beside him shifting nervously, he’s been trained to keep appearances collected, but his feathers are fluttering, giving him the indication that the man is nervous. “Amenomori, you were Hawks handler, were you not?”\nA scaled man nods stiffly, glaring daggers at him, that’s fine. He’s dealt with hate from everyone he’s ever known all his life, adding one more, two more people to that list isn’t going to cause him much harm.\nThe greenette turns to the other man, furred, a fellow animalistic quirk user. “Banzai, you were Hawks punisher, were you not?” The man nods just as stiffly, though unlike the other man, he keeps his hatred well hidden. “Very good, what is it you would do to him when he was sent to you to be punished, answer truthfully.”\nBanzai huffs. “We’d pluck feathers from his wings amongst various other things.”\n“Interesting.” He turns to the other man. “Amenomori, you were the one who sent Hawks to be punished every time he was sent, correct?”\nThe reptilian quirked man scoffs and chooses not to answer his question, instead asking one of his own. “Are you firing me sir, or are you not?”\n“Oh, I am.” A scowl falls over the man’s features. “But first—” A light of unease shines in his once heated eyes. “I’m sending you to Sector H for punishment. For abuse of power and willful endangerment. For allowing someone to be tortured.” Hawks turns to look down at him in shock, but he ignores the winged man, focusing solely on the two men before him. “You two are cousins, correct, Banzai your mother took in Amenormori when he was just a young boy. Your cousins but think of each other as brothers. Correct?” The feline quirked man nods slightly. “Good. Amenormori, it is excruciatingly painful for Hawks to have his feathers forcibly removed. I think an appropriate punishment for you is to experience the same treatment as you submitted your client to.” Izuku turns to the other man. “Banzai, how many feathers would you pull from Hawks wings?”\nHe swallows thickly. “Three dozen. Sir.”\n“Great.” The greenette nods firmly. “I want you to pull three dozen scales from Amenomori’s person.” The man opens his mouth to protest but he’s already moved on to the other. “Amenomori, you willingly allowed Hawks talons to be filed down to the point of injury, I want you to file down Banzai’s claws just as low as you’d file Hawks talons. You made him bleed from how low his talons were filed. I will have someone monitoring you at all times. I want you to file Banzai’s claws down to the point that blood is shed. There will be consequences if you don’t.”\nThe scaled man stares, face as white as a ghost. “What’s to keep me from walking out?”\n“Well, there’s this.” Izuku smiles pleasantly. “I’m not overlooking your constant endurance retrainings you submitted my hero to under the last President, I am not so easily going to overlook your blatant disregard for the wellbeing and humanity of another being. You had Hawks tortured as young as six years old, on multiple occasions, under the guise of him not being good enough. I could very easily inform those in Tartarus of your actions and just what you submitted a child to and throw you in the water with the sharks.” He taps his fingers over the desk top. “From what I can recall, Takami Kettie and Takami Kentaro are in Block J, they’ve still got three months of their sentence left. I could have it arranged that the three of you are locked together in a cell, the cameras turned off, guards ordered away from the area, and have them informed as to what you submitted their son and nephew to. From what I can find, both, especially Kettie, loved Hawks very much, do you wish to see what their punishment for your infractions might be. Need I remind you Takami Kettie once scalped a man for something as simple as stealing a feather from him. They’ve done worse for less. Do you really want to find out what they’d do with the knowledge of what you’ve done to one they love so dearly?”\nHawks makes a small sound beside him, as though in disbelief that this cute little baby bird (his words) could be so vicious and cold hearted, or perhaps in amusement at the mental picture of what the man before them would look like after being locked in a cell with his dad and uncle.\n“You can have one or the other.” Izuku, President of the HPSC, smiles sickeningly sweet at the man who dared try and find an escape route from his sadistic punishment. “I’ll let you chose.” He turns to the other man. “Same for you Banzai, though, if I were you, I wouldn’t want your crimes to be revealed to the two elder Takami men. You may not walk out of that cell in one piece. If you were to walk out at all.”\n…\n“Your request is denied, All Might.” Izuku takes vindictive glee in this one. “You are not going to scope out a child to use as a guinea pig for your quirk. I will provide you a list of qualifying individuals and you will chose from there. So no, you will not be teaching at UA unless you have a valid teaching license.”\nThe blonde man before him, sickly looking and fall apart, coughs up blood into a handkerchief. Hawks makes a small noise of disgust behind the boy at the desk. “Might I ask why I wasn’t taken to see the President, that’s who I requested to see.”\n“Oh ho ho pal.” The teen presses a hand to his chest. “I am the President. Denied.”\n“That’s not possible.” Small Might has some audacity to be insulting him in his own office. “You’re a child.”\n“Yes. I am.” He nods. “A child who asked you if a quirkless person, like me, could be a hero, like you. What was it you said again?” Izuku taps his chin mockingly. “Oh, right, it’s not possible, you just can’t say that one could be a hero without a quirk. You told me to be realistic, be a police officer you said, well, the first question on the application for the academy is what your quirk is. Be a doctor you said, well, I can’t get into those kinds of schools, hell, the only high school around here that accepts quirkless students is UA, so my going to college, especially for the medical field, isn’t even slim to none, it’s just plain old none.” He leans forward against his desk. “It’s okay to dream, the great All Might said, but you have to be realistic too kid. And then you left me on the rooftop of a building alone. So I decided, you’re right, everyone who ever told me I could never be a hero was right, so I gave up that dream, it’s in the past, no.” The teen shakes his head. “No no no, see, me being quirkless doesn’t make me ignorant, so I did what I do best, ruined someone’s career, and arranged a peaceful transition of power. So no, I don’t want to be a hero anymore, you have no worries, I want to be their boss now.” Izuku smiles cheerfully. “And I am. So, as your boss, I’m saying request denied. If you’re caught on UA grounds your hero license will be revoked and you’ll be arrested for breaking and entering. And, in light of how truly medically disadvantaged you are, I wouldn’t want to find myself in prison.”\n…\n“This isn’t fair!” The greenette is the first one to break the silence in their staring match, both teen President and hero staring each other down, chest to chest (as chest to chest as they can be) with their hands on their hips. “Let me level the playing field mister pterodactyl.”\nKeigo turns as the teen marches around him, raising an amused eyebrow when he tugs his desk chair back and climbs up to stand on the desk, noticeably, how he stands heads above him. “Really now?” He shakes his head. “We’re gonna play that game?” Opening his wings, he lifts himself off the floor, hovering above the kid’s stance. They go back to staring each other down, President standing on his desk, hero hovering above his head.\nIzuku breaks first and whines in defeat. “Fine. I’ll move in.”\nHe crows in victory and closes his wings, tucking them into his back, falling to the floor with a thump. Grabbing the small teen by the waist, he lifts him off his desk and turns, plopping him down on his feet in front of him. “You make it sound like it’s a bad thing. Am I really that much of a bad guy?”\nThe boy heaves a sigh and flops forward into the man’s arms. “No. I just don’t wanna have to listen to a mother hen all day.”\n“Le gasp.” Keigo curls his arms around the teen leaning against his front and squeezes him close as his hands slowly travel around to his ribs. “If anything—” he claws his fingers into the boy’s ribs and smiles when he shrieks with laughter. “I’m a tickle monster. Not a mother hen.”\n…\nNedzu cackles in the teacher’s lounge before beginning the yearly staff meeting before the term was due to begin, eyes skimming over the contents of the letter once more, he cackles again. “Ladies and gentlemen we are in for quite a treat this year, truly.”\nAizawa groans and faceplants into the table he’s sitting at as it appears he’s going to have to be the one to ask what’s gotten the Principle so excited. “Why?”\n“First and foremost,” the stoat begins as he folds the paper up and slides the letter back into it’s envelope. “Quirkless combat and defense will be added to the curriculum this year and hence forth. Heroes these days rely too heavily on their quirks. One must be able to tactfully and skillfully take down their opponent without reliance on their quirk.” He pauses.\nWhispering breaks out among the others.\nThe dark haired man lifts his head to stare at the mammalian. “Quirkless combat, I’ve been fighting for that class since I started teaching here, why’s it only being approved now.”\n“Why,” Nedzu chirps happily. “The President of the HPSC is quirkless.”\n“No way!” Yamada exclaims, Majima and Kayama nodding along with him, Kan hums in agreement. “He’s got to have some sort of intelligence quirk! He managed to overthrow the previous President at fourteen! He can’t be quirkless!”\n“I’ll allow it to get passed just this once because I don’t believe you hold any ill intention with that statement.” Nedzu takes a sip from his tea. “But that line of thinking is incredibly Quirkest Yamada, quirklessness does not equate to intelligence, some of the smartest specimens of mankind were quirkless. Our new President is highly intelligent. His ability to initiate a transfer of power between himself and our dear departed President was done from sheer intelligence. That in and of itself, knowing he does not have any sort of enhancement to aid him, makes this feat even more magnificent.”\nEctoplasm changes the subject before it can derail from there. “Who’s teaching the new class?”\n“Aizawa.” The eraser hero’s eyebrows raise. “You’ve been chosen as the one to teach the hero students quirkless combat considering your entire fighting style is quirkless in nature.”\nKayama bites her lip. “Is that it?”\n“No!” The Principle chirps again. “Our heroics teacher this year will be Kamui Woods. That’s not what’s got me so intrigued, our newest student this year will be Midoriya Izuku.” He grins ferally when their faces pale. “President of the Hero Public Safety Commission. Hawks will be joining him as his security detail, he’s a very influential and high standing young man, he needs the best of the best to stand as his protector.”\nMijima raises his hand slightly. “Why not have Endeavor then, he’s second in rank, Hawks is third.”\nNedzu hums cheerfully. “Endeavor is no longer on the Commission’s payroll and any heroic acts he commits will be taken as Vigilantism and treated as such.”\n…\nThe new class falls silent when a boy and Hawks appear in the door way to their classroom, both wearing dark suits and sunglasses, hair tied back fashionably, hands in their pockets, identical (not completely—for obvious reasons) in stance.\nIida bows respectfully. “President Midoriya.”\n“Hello Iida.” The boy’s head bobs. “I hope Tensei is doing well.”\n“He is, yes.” The youngest Iida nods. “He wishes for me to thank you for the sidekick recommendations.”\n“Of course.” The greenette, Midoriya, by assumption from Iida’s greeting, bobs his head again as he surveys the rest of the class. “Students.”\n“You’re a student too Problem Child.” A fond nickname donned by Eraserhead, well-fitting too considering, and both boy and hero turn to face the man in his eyesore of a sleeping bag. “Are you really wearing the same suit?”\nHawks grins. “First impression is key.”\n…\n“No,” Midoriya takes a sip from his tea cup. “Absolutely not. The Sports Festival will be postponed this year, if we hold it at all, I understand the necessity for students to perform and gain work studies with heroes in the field, but they are children (he skillfully ignores Keigo’s pointed throat clearing—asshole—he’s so gonna fire him) who just went through a traumatic ordeal. They need time to process and heal.” He takes another sip of tea. “And, besides that, the whole idea of the Sports Festival is incredibly ignorant. Not only do you announce the students name and what department they’re in, but you also announce their quirk, which is asinine on multiple levels. Not including the vital information it gives away for those intending to go into underground heroics, it puts all students in danger. Any villain with half a braincell could very well watch the Sports Festival, which is broadcasted nationally for any and all to see, learn of their targets quirk and brainstorm ways to combat them. That would leave the students as sitting ducks waiting to be picked off. I am denying this request.”\n“Fledgling,” Keigo takes the initiative when the stoat sends him a glance, everyone in the room knows that the teen listens to the winged hero more so then anyone else, for personal reasons. “I understand your reasonings, we all do, and it’s not fair to them. I agree that they need time to process, manage, and heal. Mandatory sessions should be set up with Hound Dog, setting it mandatory that they attend at least two sessions is a great idea and we support it wholeheartedly.” He smiles gently when the teen turns to look at him, green eyes glowing with knowledge, analytics, and calculations. “But the students need this. We can postpone the Sports Festival for a certain amount of time, but it’s not fair to them to withhold the opportunities their upperclassman were given. Those in the other departments can enter the hero course through the Sports Festival, it’s not fair to those who’ve been training all this time for the chance only to have it snatched from them due to no fault of their own.” Aizawa nods in agreement, everyone in the room knows he’s been training someone, and the winged hero bows his head slightly. “Is there a compromise we can come up with?”\nThe President of the HPSC sighs as he takes a sip of tea. “Okay. I concede to your point. But I have certain stipulations.” He turns to address Nedzu sitting across from him. “First, name’s can be broadcast, but quirk cannot. For privacy’s sake as well as safety. Second, I am limiting those who are able to view the broadcast, the live stream will only play over the hero network, no exceptions, I understand that it will cause disruption with the public, but the safety of the students comes first and foremost. Third, all students, and I mean all students, are required to know at least basic self defense tactics. Fourth, everyone involved in the attack at the USJ must complete their two mandatory sessions with Hound Dog before they can qualify for participating in the Sports Festival. Fifth, the Sports Festival will be held two months from now, to give the students an appropriate amount of time to come to terms with the trauma they experienced and begin to heal from it.”\nNedzu smiles pleasantly. “I agree wholeheartedly Midoriya, indeed I do.”\n…\n“I’m rejecting Bakugo Katsuki transfer.” Izuku announces, standing in front of the stoat’s desk, hands in the pocket of his hoodie, Hawks standing beside him in a matching hoodie in the same exact position. “He’s too volatile, he hasn’t learned a thing, he’s got a superiority complex a mile high. No, I am not allowing him to transfer into the hero course.” He levels a stare on the mammalian across from him, the only one ballsy to do so, and meets him with a dare to challenge his decision. “And if you decide to go around my back and transfer him anyway I’ll cut the schools funding completely.”\nThe hero at his side snorts softly. “Baby birds grumpy this morning.”\nHe glares at the man next to him. “Shut up Kei.”\n“Excuse you.” Keigo turns to look at him, eyebrows raised, as though questioning the decision the teen just made. “What did you just say to me?”\n“I said shut up.” Izuku glowers at him. “As in, stop talking, be quiet, silence peasant. Shut up.”\n“Okay, first off, watch the attitude.” The blonde man straightens from his slouched position and turns completely. “I know you’re angry, but you’re not going to disrespect me like that, so mind yourself.”\n“You can’t talk to me like that.” The mini President snaps. “I’m your boss.”\n“And I’m your guardian.” Keigo shoots right back. “That trumps everything. Drop the attitude.”\n“Or what?”\nThe teen yelps when the mans hand snaps out and snags his ear, pinching as he tugs him around by said ear, the man calls over his shoulder as he makes his way across the Principle’s office. “We’ll finish this meeting later. I’m gonna go roast his backside.”\n\nIzuku sniffles miserably, head resting on his guardian’s chest, enjoying the feeling of fingers playing with his curls. The body under him shifts and lips brush over his temple. Tears were falling down onto the chest of the person under him, something soft brushes against his other cheek, tears of anger and tears of a child with a sore rump to their name. \n\n\nLips brush over his temple. “What’s wrong with my precious little Eyas, this isn’t like him?”\n\n\nThe greenette swipes at his nose miserably. “I got to let him into the Hero course.”\n\n\nKeigo makes a face, of all the things he knew of that Bakugo brat, he had no right to even lay his eyes on the hero course uniform. “Why?”\n\n\n“Because of Shinsou Hitoshi. He made it in.” Izuku pets the wing curled around him and it curls in closer. “If I don’t let Bakugo Katsuki in too that would seem as the the HPSC was showing favoritism, or that we are spiteful, and in this case we are, I am, I want to see the look on his face when he doesn’t get the acceptance letter. But we can’t. Because I made it a point to remain impartial to these things unless an explicit reason is given by a professional as to why he shouldn’t be place–”\n\n\n“Oh, I could give you hundreds.”\n\n\nThe greenette giggles softly and wet. “No Kei, I mean by one of his teachers, one of his teachers would have to give an impartial reason as to why he wouldn’t be fit for the hero course. None of his teachers have any. They’ve already signed him over.” And promptly sniffles again. “And just after I thought I was away from him–”\n\n\n“Now hold up just a minute.” A tan hand raises in his line of sight. “If you think this feathered father slash bodyguard would let some playground bully at his baby bird slash boss then I’m extremely offended right now.” That tan hand comes in and brushes through his curls. “And thats not to say you have to let him into Class 1-A, there’s always Class 1-B, just as nice as the original.”\n\n\n“Oh, true.” Izuku tilts his head. “That’s true.”\n\n\n….\n\n\nThere were times, days, when him and the Principle would enjoy a cup of tea together sitting in a secret back room to the mammilians office, where they sit now, sipping at steaming cups of calming tea and watching class 1-B train out in the field behind the school. \n\n\n“My dearest friend,” the stoat begins in the silence. “I don’t know how you manage, dealing with hormonal teenage humans is a trial for myself, how do you manage to run an entire Government organization without, with lack of better term, losing your mind.”\n\n\nThe feather dangling down his chest wiggles slightly, a silent inquiry, and he rubs it in response, he’s okay. But the feeling brings a smile to his features as he takes a sip of tea. “Keigo. I’d be a bumbling mumbling mess without him. He takes good care of me. Sometimes I wonder who’s really running the Commission, myself or him, it’s only when I sign his paycheck that I get that reality check that it is in fact me.”\n\n\nNedzu snorts into his drink softly. “He still gets paychecks?”\n\n\nThe boy cracks a smile. “It’s for shits and giggles at this point, he laughs every time he sees the envelope on his desk while having a debit card for the Commission’s personal accounts in his back pocket.” Midoriya takes a small sip as to continue. “He says he’s putting those away in a college fund for me despite the fact I could easily utilize the courses we already have.” He sighs and rubs his thumb down the shaft of the feather, fingers curled around it tightly, and takes another sip. “There are days I can’t even get out of bed, my doctor, the best the hero world has to offer, says it’s crippling depression, I won’t bore you with the details.”\n\n\n“You are a wonder Midoriya.” The stoat hums into his tea. “So young but so well achieved, a mystery I have yet to solve.”\n\n\n“It’s simple really.” A somber smile is sent his way. “I played russian roulette with Life and Death.” The small boy takes a sip. “Death won.”\n\n\n….\n\n\nIzuku wasn’t lying when he said he relied on Keigo, the man kept his sanity from leaving him, he has no idea after an official full year of running the Hero Public Safety Commission how he hasn’t gone insane yet. Running the HPSC and going to school at the same time and full time no less would run anyone ragged. Perhaps that's what happened to the previous President, she didn’t have her own Keigo to keep her from spiraling down into the darkness too deep. \n\n\nBut he has his Keigo.\n\n\nA man who knows him better than he knows himself. \n\n\nWho caught him when it all became too much and he started crumbling, caught him in his arms, curled him up in his wings, and hid him away from the world until he deemed it was good again. \n\n\nHe relied on Keigo in what was most probably an unhealthy amount. \n\n\nNeither one of them will ever speak of the weekend after Izuku suggested reopening the Paragon Program with stricter guidelines for the instructors. Keigo had pulled away from him completely and he never realized how truly broken he was until the moment he didn’t have his glue that kept him together. Izuku’s played russian roulette with life a number of times. Death always won. Keigo had come back ready to talk about these stricter guidelines and how they’d get the children and age requirements, things of that sort, and found him on the roof with a bullet in his head.\n\n\nHe won’t bore you with the details. \n\n\nKeigo never pulled away again.\n\n\nIzuku wasn't ever allowed to have a gun again.\n\n\nThe sight of the HPSC doctors pulling the bullet out of his charges head as they revived him will forever haunt the man’s dreams. \n\n\n….\n\n\nKeigo’s not blind. \n\n\nLet him explain, he can see the weight of the world settling on his poor chick’s shoulders, carrying the weight of the hero world is weighing him down. He was starting to grow a tad darker, like when he brought up the Paragon Program again, something of which, after he explained himself, he agreed with, especially given the fact that he’d be overseeing the training and such himself, because he knew when something was being taken too far. \n\n\nBut he also kept a close eye on his charge, he was a wonderful multitasker, he could keep an eye on both things. He could see the bags growing under the boys eyes as his work started growing later and later into the night, his hair became greasier and greasier as he stopped taking care of himself, it was when he noticed him starting to itch \n\ndown there\n\n consistently that he stepped in. \n\n\nFirst things first, he left the Paragon Program to Rumi to watch over as he focused his undivided attention on his fledgling. \n\n\n“Come on,” he tugs the boy up from his office chair and around from behind his desk. “We’re going to the doctors.”\n\n\nIzuku perks up. “Why?”\n\n\n“Because,” he winds an arm around his shoulders as he leads him out of his office. “You have a yeast infection, that’s why you’re so itchy down there, we’ll get you the necessary topical cream for down there, go home and get you a nice long shower, get you a nice filling meal, and we’ll settle down in the nest and watch a few movies until you fall asleep for a nice long night’s sleep.”\n\n\n“But why?” The greenette tries to duck out from under the man’s arm but gets nowhere. “I got work to do Kei, I can’t afford to–”\n\n\n“If you don’t come with me willingly I’ll turn you over and warm up your behind and drag you to the doctor’s by the ear if need be.” Keigo smiles down at him softly. “Your choice.”\n\n\nIzuku rubs at his bottom just at the thought of a spanking. “I’ll come willingly.”\n\n\n“Good choice.” The hero slash bodyguard nods and brushes a kiss over the side of his boy’s head despite the greasiness. “There’s something I want to talk to you about when we get you settled down nice and comfy in the nest too. And I want you to let me speak without interruption, okay, no interruptions, I’m pulling the guardian card which myself, you, and your little bottom knows trumps all else.”\n\n\nIzuku nods. “Okay Kei.”\n\n\nKeigo joins them in the examination room at his boy’s request, it’s ever endearing his fear of doctors, perhaps a tad concerning as well, what could have happened in his boy’s past that made him so fearful of being alone with a doctor. He’d delve into that at a later time. He was there as the doctor did his examination, and immediately rises when he dismisses his boy. “I don’t fucking think so, perscribe him what he needs or so help me god.” He knows the dismissal was because of his quirkless status. \n\n\nFacing the possibility of facing the number two hero’s rage was not something the doctor wanted to experience and therefore prescribed him the topical cream he’d need for his yeast infection. \n\n\nThe man cooks them a nice large meal while he listens to the shower run, it takes a while, his little one takes a nice long shower just as he said he would, he specifically said under no circumstances was he to come out of that shower in less than ten minutes, he wanted him nice and pruney when he saw him again. \n\n\nThey eat in companionable silence, he watches happily as the boy shoves food in his mouth, clearly starving, his cheeks puffed up like a chipmunk, and when he has his fill, he can’t eat any more, he leans back in his chair with a comfortable smile and rubs his full tummy. \n\n\nThen they settle down in the nest, Izuku settled in the crook of his shoulder, a small happy smile spread over his features. His itchiness taken care of for the time being (until it was time to apply his cream again),  he was nice and clean and not greasy and sticky, and his tummy nice and full, not to mention cuddled up in his beloved guardian’s embrace. \n\n\n“Okay, I’m going to bring up what I said I wanted to, okay, remember what I said,” Keigo strokes a finger down the bridge of his boy’s nose, smiling at his content sleepy smile, waiting for him to nod before continuing. “Fledgling mine, I’m concerned about you, highly concerned, you’re running yourself ragged. I don’t think you should be acting President anymore, not for a while at least.” He presses a finger to the boy’s lips when he makes to speak. “Shhh, no interruptions, remember. I want to take over for you so you can rest and heal, and when I think you’re ready, you can come back to your position, but only when \n\nI\n\n think you’re ready. You can still have your say in decisions that we need to make, but I don’t want you to be making the decisions on your own, you’re starting to head down a dark path and I don’t want you to make a decision you’ll regret for the rest of your life.” He strokes a finger down the bridge of the boy’s nose again. “Because you’re so young and you don’t deserve that. You deserve to rest and heal, act like a child still, focus on your studies, have fun, hang out with friends you’ve made.”\n\n\nIzuku, though sleepy and content, is paying rapt attention to what’s being said. “Keigo–”\n\n\n“No no chick mine.” The hero shakes his head. “I’m not asking. I’m pulling the guardian card and temporarily removing you from power. You’re breaking yourself my little one and I don’t like it. Rumi can take care of the Paragon Program while I’m doing this for you.”\n\n\nThe greenette smacks his lips. “You and me?”\n\n\n“Sure, little one, you and me. Mostly me. But you and me.” Keigo scratches at the back of the boy’s neck because he knows how much he likes it. “I just want you to be okay.”\n\n\n“Okay Kei.” Izuku nods slightly against his shoulder. “I trust you.”\n\n\n…\n\n\nIt takes time, but Izuku begins to flourish again, the shine that had left his eyes is there once more, the smile that made everyone’s day had returned, and he was making his way through the halls of the Commission Headquarters like a beacon of light, the same beacon of light that had been there for the first couple months after he had taken charge of everything. \n\n\nKeigo was ready to tell his baby bird that he thought he was fit to return to acting President, but he didn’t have the heart to, watching him laugh with his friends and play video games and get back into his journaling. Izuku never asked for it either, he never brought it up, and if he didn’t bring it up then he wasn’t going to bring it up either. So he kept the seat to himself, taking care of things internally while their previous president had a good time being the kid he still was. \n\n\nSure, they still got together when it came to the big decisions that had to be made, but Izuku never asked for his seat back and he didn’t want to force it on him, he was more than able to run things on his own (for the most part).\n\n\nSo the Presidency stayed with the winged hero as the usurper hung out at the mall with a group of his friends.\n\n\n….\n\n\n“Boy oh boy is my fledgling giggly today.” Keigo teases, wiggling his fingers in his charges lower belly lightly, smiling at his contagious wild giggles. “I love it when my fledgling gets all giggly.” He crawls his fingers up the youth’s belly and claws his fingers in the boy’s ribs slightly, laughing softly when the boy squeals and bats at his hands. “I can’t get over how ticklish you are, I’m barely doing anything and you’re already a mess.”\n\n\n“Kehehehehehei! Stohohohohohop!” (Kei! Stop!) Izuku shrieks with giggles as fingers knead into his ribs. “Pleeheheheheheheease! Ihihihhiihihihit tihihihihihihihickles!” (Please! It tickles!)\n\n\n“Coochie coochie coo.” The greenette squeals with laughter when fingers spider down his sides suddenly, up, and down, and up again, and down once more. He wiggles and rocks from side to side in an attempt to get away from the spidering fingers. “Tickle tickle tickle.”\n\n\n“Eeeieiieaiaahahaahhaahhaahahahahaa Keihehehehheheheheeeiieee! Aaaahahhahhahhahahahahahaaaha eeieiieeiaaahahahahahahahahahhahhaaa stohohohohohop tehehehehehehehheasing meheheheheheehe!” (Kei! Stop teasing me!) He squeals when the fingers come up to spider all around his belly, arching his back into the spidering fingers, and squeals once more when they start spidering all over the place, up and down his sides and all around his belly. “Keheheheheeieieiaahahahahahahahahahahaa nohohohohoohohoohohoohhooo nohohhoohohohot thoohohohohohose! Nohohohohot thehehehhehe eiieiaiiaaahahhahaahhhahahhahaaha spihihihihihihiders!” (No not those! Not the spiders!) \n\n\nHe giggles wildly when the hands raise, fingers wiggling slightly, looking between them both with wide eyes. “You know whats coming your way now?” The hands dip and he shrieks with laughter until their raise again. “Guess what’s coming your way.” The teen squeals when they dip, this time touching his belly, and he arches into them, before they lift again. “There’s a certain kind of claw that the tickle monster utilizes on his victims.” The hands dip, and he squeals, because Izuku knows what he’s talking about and how bad they are. The hands hover over his belly, and he stares at them with wide horrified eyes, giggling wildly, the fingers stop wiggling and curl inwards. “The tickle claws.”\n"
}