{
    "id": "34234810",
    "url": "https://archiveofourown.org/works/34234810?view_full_work=true",
    "author": [
        "ElliahRose"
    ],
    "title": "If We Could Go Back (I'd change the world for you)",
    "rating": "Not Rated",
    "archive_warnings": [
        "Major Character Death"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "Minecraft (Video Game)"
    ],
    "relationships": [
        "Wilbur Soot & Technoblade & TommyInnit & Phil Watson",
        "Toby Smith | Tubbo & TommyInnit"
    ],
    "characters": [
        "Wilbur Soot",
        "Dave | Technoblade",
        "Phil Watson (Video Blogging RPF)",
        "TommyInnit (Video Blogging RPF)",
        "Toby Smith | Tubbo",
        "Jschlatt (Video Blogging RPF)"
    ],
    "additional_tags": [
        "Sleepy Bois Inc as Family",
        "Sleepy Bois Inc-centric",
        "Sleepy Bois Inc Angst",
        "Sad Parental Phil Watson (Video Blogging RPF)",
        "Bad Parent Phil Watson (Video Blogging RPF)",
        "Good Parent Phil Watson (Video Blogging RPF)",
        "eventually",
        "Child Neglect",
        "Implied/Referenced Child Abuse",
        "Suicide Attempt",
        "Suicide",
        "Time Travel Fix-It",
        "Time Travel",
        "Depressed TommyInnit (Video Blogging RPF)",
        "Suicidal TommyInnit (Video Blogging RPF)",
        "Bad Sibling Wilbur Soot",
        "Bad Sibling Technoblade (Video Blogging RPF)",
        "Regretful Technoblade (Video Blogging RPF)",
        "Regretful Wilbur Soot",
        "Regretful Phil Watson",
        "Angst",
        "So much angst",
        "Angst with a Happy Ending",
        "It Gets Worse Before It Gets Better",
        "but it does get better",
        "Wilbur Soot and Technoblade and TommyInnit are Siblings",
        "triggering content",
        "read with caution",
        "TommyInnit-centric (Video Blogging RPF)",
        "Wilbur Soot-centric",
        "Dark SBI",
        "Dark Sleepy Bois Inc",
        "Sort Of",
        "They just suck for a while",
        "They get better"
    ],
    "language": "English",
    "series": "Part 1 of How much angst can I shove on to one character? (A lot)",
    "published": "2021-10-02",
    "completed": "2021-11-30",
    "words": "24,928",
    "chapters": "4/4",
    "comments": "1,253",
    "kudos": "15,841",
    "bookmarks": "2,910",
    "hits": "194,737",
    "summary": "<p>The death of Kristen broke the Craft family. Phil, in his grief, neglected his youngest, Tommy, subconsciously blaming him for the death of his wife. Techno, who was never great at handling emotions or children, followed suit. Wilbur, who was closest to his mother, was cruel and vicious to the child, and even though a part of him loved his youngest brother, his grief was far stronger.</p>\n<p>If Kristen’s death broke the Craft family, Tommy’s suicide shattered it. Each family member blaming each other for the fate of the youngest son, the no-longer Craft family split apart.</p>\n<p>Ten years after the suicide of Wilbur’s younger brother Tommy, Wilbur drunkenly opened up to his friends about his biggest regret, but when asked if he wanted the chance to change what happened, Wilbur and the rest of his estranged family members wake up ten years in the past, one week before Tommy killed himself.</p>\n<p>Wilbur and the rest of the Craft family must put aside their hatred for each other to save their youngest, and hopefully, in the process, fix their family.</p>\n<p>DO NOT REPOST/COPY/BIND THIS FANFICTION! IF THIS IS POSTED ANYWHERE THAT IS NOT AO3, I DID NOT ALLOW IT. 2/27/24</p>",
    "notes": "<p>TW: Graphic description of child neglect/abuse, graphic description of planning and committing suicide. This entire chapter is potentially very triggering! Please read with caution!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>TW: Alcohol abuse, mentions of suicide, mentions of past child abuse/neglect </p>\n<p>LISTEN TO THIS PLAYLIST WHILE YOU READ THIS CHAPTER (or the entire book if you want the full effect)<br>https://www.youtube.com/watch?v=jhX-2wYCjxI&amp;list=LL&amp;index=2&amp;t=19s</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>Here we go, the second installment to the book! I really hope you enjoyed this chapter. (I posted this a day early because I couldn't wait!) Next chapter we'll see how the struggling family tries to fix their mistakes as well as learn more about what happened to them after Tommy's death. Y'all, I know I said this would have a happy ending, but it's gonna be more bittersweet. (It'll be more sweet than bitter, though, if that helps) Anyway, if you liked this chapter, leave a kudos and a comment, they really help me out! &lt;3</p>\n<p>I'm back y'all!! </p>\n<p>I'm sure you've noticed the change in the number of chapters, but don't worry! All will be explained at the end of the chapter! I reccomend listening to the playlist listed in the previous chapter as you read this chapter, as it really sets the mood for the story! Happy reading everybody!! :)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>Hey guys! Sorry for how long it took me to post this. I had so much trouble writing this final chapter, and I literally had to rewrite the ending several times, and eventually, I had to scrap almost twenty pages! The reason being; I changed my mind about how I wanted the story to end halfway through the editing stage. Originally, the story was going to end with Wilbur waking up and realizing that all of it was a dream and he never really went back in time and Tommy was still dead. The story ends with Wilbur calling Phil and Techno and meeting them both at Tommy's grave where they all grieve for Tommy together as a family for the first time since the funeral. <em>However</em>, I decided that ending was too sad and it didn't give Tommy the chance he deserved, so I scrapped it and rewrote the final chapter with a new ending, that is a bit happier than the last. </p>\n<p>That being said, AO3 is being a little finicky for me right now and I was forced to split the final chapter up into two chapters. So, the second half of this chapter should be posted after Thanksgiving (or for those of you who don't celebrate the holiday) around the end of the weekend. </p>\n<p>I hope you all enjoyed this chapter, and thank you all for the lovely comments you've given me, they really inspire me to write! :) &lt;3</p>\n<p><em>Trigger Warnings:</em> graphic description of suicide attempt, mentions of past child neglect/abuse</p>\n<p>Read with caution people!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">more notes</a>.)\n</p>\n<p>Finally finished with this, wow. This one was really hard to write so I hope you enjoyed it. The ending might let down some people but I felt like it was the only way to end the story. Realistically, Tommy wasn't going to heal in one week. No matter how badly they wanted to, they would never be able to magically fix years of neglect through one week. In the end, choosing what was best for Tommy was the only option. The original ending that I had planned for this book is still written, though, so let me know if any of you would be interested in reading it, I might publish it, too. </p>\n<p>As for Dream... maybe he sent them back, maybe he didn't... the ending is a bit ambiguous, so that's completely up to you. </p>\n<p>That's all for this book, though, so for those of you who stuck around since the very beginning, thank you for reading and waiting for the updates! I hope all of you enjoyed this book! &lt;3</p>\n<p>Wow. This chapter was honestly so hard to write. This entire chapter was just so heartbreaking, but I think what made it so difficult to write was how Tommy viewed his suicide. Tommy is just so young and naive, he didn't really understand the permanence of killing himself. He saw it more as moving in with his mom who separated from his dad, and less like <em>killing himself</em>. Honestly, the whole chapter had me in tears.</p>\n<p>As for Phil, Wilbur and Techno... Yeah. Their actions may seem irredeemable, but I'm going to shove redemption down their throats because TOMMY DESERVED BETTER THAN THIS!!!!!!</p>\n<p>Thank you so much for reading, I really hope you enjoyed this! If you liked it, please leave a comment and a kudos, they really help me out! :)</p>",
    "text": "Tommy Innit Craft was born on a Tuesday. \nNo one could remember the exact time it happened, as right after Tommy was born, Kristen got sick. For the next three years of Tommy’s life, Kristen— “Mommy!”—was in and out of the hospital for her illness. There wasn’t a single doctor who could tell the Craft family what was wrong with her, and the uncertainty of it all, the stress of the medical bills as well as the drain Tommy’s young personality had on everyone made Phil tired all the time. \nSo whenever Tommy would bounce into his room, his wide, gummy smile lighting up his face as he rambled endlessly about this and that, Phil would just grimace at the toddler and send him off to bother his brothers, giving Phil more time to sleep. \nTommy, who was getting used to being ignored by his father, would just shrug it off and toddle over to wherever Techie or Wilby were, and he’d tell them all the things he wanted to tell Phil. \n“And, didja’ know that bees eat flowers?” Tommy asked, bouncing on his heels with excitement as he tugged on Wilbur’s coat. “Tubs says so!” \nIn his excitement, Tommy never noticed the way Wilbur’s eyes narrowed at the toddler, nor did he notice how Wilbur’s hummed response was just a little too sharp to be caring. “Interesting,” Wilbur drawled, the ten-year-old drawled, harshly tugging his coat out of Tommy’s grip. “I’m sure Techno would just love to hear all about it.” \n“Weally?!” Tommy asked, his sky-blue eyes lighting up with hope. “O’tay!” \nBut Techno never even opened the door, as the second he heard Tommy’s light pitter-patter footsteps on the hardwood floor, he lunged forward to lock the door and pretended to be asleep. \nBut Tommy, being only a child, never realized that his family was ignoring him, he simply thought they were too busy, or just a little distracted. It wasn’t bad. It didn’t hurt. \nBut then Kristen died and everything changed.\n\n-.-.-\n\nTommy was three and three quarters when Kristen went to the hospital for the last time.\nTommy didn’t understand why his dad and big brothers looked so scared, but Tommy was afraid to ask, as the last time he bothered Wilbur when he looked like this, Wilbur yelled at him and it was really scary. \nTommy paid no mind to the wires and the beeping that surrounded his mom, choosing instead to climb up the bed himself and give her a hug. Tommy loved his mom! Whenever Dad and or his big brothers were too busy to play with him or speak with him, Tommy would just sneak into Mom’s room and take a nap with her. \nJust as she always did whenever Tommy snuck into her bed, Kristen wrapped her frail arms around Tommy and pulled him tight to her chest, pressing soft and gentle kisses to his forehead. \n“It’s time for me to go now, baby,” she whispered to him. \n“Go where?” Tommy asked, blinking as he looked up at her. “I come?” \n“No, baby, you can’t come with me,” Kristen said softly, a single tear sliding down her cheek. “You have to stay with Daddy and your brothers.” \n“Oh,” Tommy said quietly. It wasn’t that Tommy didn’t love his dad and his big brothers, it’s just… they were scary sometimes.\n“I love you so much, sunshine,” Kristen said, kissing him on the cheek one final time before Techno reached over and lifted Tommy out of her arms. Tommy wanted to whine and curl back up with his mom, but one look at Techno’s grim expression made Tommy silent. \nTommy couldn’t hear what his mom said to his dad and his big brothers, she whispered too quietly, but Tommy could easily see the way his dad broke down sobbing, as well as the way his big brothers began to argue and shake their heads. \nTommy didn’t like it whenever Wilbur got angry, and the three-year-old, fearful of the yelling that was sure to come, hastily toddled out of the hospital room. \nTommy wasn’t there when the heartbeat monitor flatlined, nor was he there when Phil broke down and the twins began to weep. \nIt wasn’t until, nearly two hours later, when security called over the P.A system, was Tommy found by his family.\nAs Tommy got older, he would look back on that moment and wish he was never found.\n\n-.-.-\n\nTommy was a big man.\n“I am a big man,” he said loudly to the mirror, only to freeze when he heard sleepy shuffling from down the hall, and his heart beat spiked for a moment before he realized that no one had actually woken up. Letting out a small sigh of relief, Tommy turned back to the mirror to whisper quietly. “I am a big man. The biggest.” \nTommy turned seven today, and he was officially the biggest and coolest man in the universe. Even though he knew his Dad wouldn’t look at him when he came downstairs for breakfast, and even though he knew Techno would avoid him and even though he knew he would avoid Wilbur, Tommy was actually moderately happy for his birthday. \nTubbo had wished him a happy early birthday yesterday as he was leaving school, and Tommy was still riding the high of someone caring about him enough to mention it. Tommy smiled at his reflection, choosing to ignore the dull look in his eyes and the bags underneath them. \nTommy was a big man, and today was going to be a good day! \nTommy was just about to whisper more cool things to himself when heard shuffling coming from Techno’s room. Tommy’s eyes widened as he realized his older brother was probably going to get up soon, and Tommy didn’t want the first thing his grumpy older brother saw in the morning to be his face. \n(Tommy didn’t want to be ignored on his birthday, so please… please…)\nTommy sent one last look at his reflection in the hall mirror before he quickly shuffled down the hall to his bedroom and shut the door, wincing as his door creaked. His room was the smallest in the house, but that made sense because he was the smallest in the house. \nHis room didn’t have a lot in it, but Wilbur always told him that he didn’t need a lot of things anyway. He had a small twin-sized bed pushed up against a wall and a single cow plushie his mom had given him when he was just a baby named Henry and a lamp and a dresser. \nOver the years, Tommy had slowly hung up every piece of artwork he ever did on the wall, because he knew Phil would never hang it up on the fridge like Tubbo’s dad did, and if Phil wasn’t going to be proud of the work he did, then Tommy would just have to be proud of himself. \n(But he really wanted Phil to be proud of him. He really wanted a hug, please.)\nTommy jumped onto his bed and hugged Henry tight to his chest. “Guess what Henry?” Tommy asked the cow. “I’m seven today. That means I’m a big man now. Do you think Wilbur will want to hang out with me now that I’m not an icky baby?” \nHenry’s worn head wobbled slightly before it fell over, the stuffing inside not strong enough to support the weight of the cow’s enormous head. \nTommy pouted. “Yeah… I didn’t think so either,” he whispered, fighting off the sudden urge to cry. Tommy was a big man now! He was seven years old, which meant he didn’t cry over stupid things! Only babies did that! “But that’s okay, because I’m a big man so I don’t need nobody!” \nHenry said nothing in response, but Tommy could feel the cow’s judgment. \n“You know what, Henry? You are being very unhelpful right now!” Tommy exclaimed. “You are showing me a lot of dis-ree-spect! I don’t apree-ciate that.” Tommy said, parroting a conversation he had with Phil a few weeks ago when Tommy complained about how little time the man spent with him. \n(It was Tommy’s fault for being so demanding. Dad didn’t want anything to do with a murderer.)\nHenry said nothing, once more, but tiny button eyes shined in the light and Tommy thought it kind of looked like tears. Instantly, Tommy felt horrible. \n“I’m sorry Henry,” he whispered, hugging the cow tighter. “I didn’t mean to be a meanie. I’m sorry.” \nHenry didn’t look as upset after Tommy pulled away, so Tommy took it as his apology was accepted. With that, Tommy set about getting ready for the day. He ignored the loud footsteps in the hall that meant everyone else had woken up and was now getting ready for school, as he carefully dressed himself. \nPhil never taught Tommy how to tie his shoes, and the last time Tommy asked Wilbur for help, he laughed at him and then slammed the door in his face. Tommy realized that his family wasn’t going to help him, so Tommy helped himself. \nHe learned that the easiest way to walk with laced shoes was to slip the laces underneath his heels so he didn’t trip and he didn’t have to tie them! Tommy was so smart. \n(If only his family would see that! Dad loved Wilby and Techie because they had good grades. If he saw how smart Tommy was, would he love him too?)\nAfter Tommy was all dressed for school, he grabbed Henry and gently placed him inside his backpack. \n“You know I’m not ‘upposed to bring you to school, Henry,” he said to the cow as he zipped up the pocket. “I could get in trouble!”\nHenry just slumped pitifully in the pocket of his backpack. \n“Okay…” Tommy relented. “I’ll bring you, but only because it’s my birthday! And you can’t be seen or I’ll get yelled at!” \nHenry said nothing and Tommy smiled smugly. \n“Good cow, Henry.” \nTommy walked downstairs to the kitchen where everyone else was already eating breakfast. Tommy shuffled awkwardly in the door, unsure if he would get in trouble for grabbing the food again. Last time, Wilbur had gotten really angry with Tommy because Wilbur only cooked for Techno and Phil. \n“Stop standing there and eat, Tommy,” Phil said, not even looking up from his mug of coffee. “If you’re too picky to eat what Wilbur made, then make yourself a bowl of cereal.” \nTommy tried not to let his eyes water at the harshness of Phil’s voice. Tommy, carefully ignoring the heated glare from Wilbur, slowly grabbed a plate and dished himself a small serving of eggs and toast. \nHe wasn’t really sure where he should sit, but not wanting to anger Phil anymore about how much time he was wasting, chose to gently pull out the empty chair next to Techno. Techno was probably Tommy’s favorite brother. \nTechno never really spoke to Tommy or hung out with him, but he also never yelled at Tommy, just ignored him, and Tommy would take that over Phil’s yelling and Wilbur’s mean comments about him any day. \nTechno raised an eyebrow dryly at Tommy’s choice of seat but said nothing, and Tommy was grateful. \nTommy hunched in on himself, making sure that he wouldn’t draw any unwanted attention towards himself as he ate, a habit he picked up very quickly after his mom died. \n(“After you killed her!”)\nAs soon as Tommy was finished eating he left the table, carefully placing his dishes in the sink before he sped-walked out of the kitchen. No one ever took him to school, always too busy to be around Tommy, so Tommy walked to school. It wasn’t too bad of a walk, but Tommy knew he had to leave early in the morning to get there in time. \nThe school day was normal, something that made Tommy a little sad, to be honest. Tommy wasn’t really sure what he was expecting on his birthday, but he’d hoped for a little more fanfare. \nTubbo wasn’t going to be at school today because he had a doctor’s appointment, which was why he wished Tommy a happy birthday yesterday. Since Tubbo was Tommy’s only friend, Tubbo was the only one who knew today was Tommy’s birthday. \nTommy wanted to tell Mr. Sam, his teacher, about today, but years on Wilbur telling him to just, “Shut up, Tommy! No one likes a know-it-all!” Tommy decided to just keep his mouth shut and sink into his chair. \nHe said nothing when it was announced over the P.A system during morning announcements that it was Clementine’s birthday today, as he knew Phil had never e-mailed the school about it, so they would never announce it over the system. Instead, Tommy clapped along with the rest of his class as they wished her a happy birthday. \n(It was so unfair. Clementine wasn’t even in Tommy’s class! Tommy had never wanted someone to wish him a happy birthday more!) \nTommy felt like the day stretched on forever, and even though Tommy wasn’t really excited to go home to his empty bedroom quiet walls, he was seriously starting to get bored with times tables. \nTommy, after what felt like another eternity of math class, looked over to his backpack which was sitting on the ground next to him, and felt a wave of sympathy for Henry. Tommy hated always being stuck in his room, it was always so lonely. He wished that Wilbur would be nice to him. \n(He wished his family loved him.)\nNot wanting Henry to feel sad, Tommy risked a look towards Mr. Sam, who was still busy writing times tables on the blackboard, hastily grabbed Henry out of his bag and placed him on his lap. \n“There you go, Henry,” Tommy whispered. “Now you won’t be sad anymore.” \n“Tommy.” \nTommy froze, his deer-in-headlights expression freezing on his face as he looked up to see Mr. Sam stared at him with a stern expression. “Mr. Sam, I—” \n“Tommy, we’ve talked about this,” he said, and he sounded disappointed, and it made Tommy’s chest squeeze. He didn’t want Mr. Sam to be disappointed in him! This wasn’t fair! Tommy just wanted someone to spend his birthday with him! To his humiliation, Tommy felt tears swell up in his eyes. “Hand me the toy, please.” \nTommy sniffled pathetically as he handed Henry to Mr. Sam, trying hard not to look at the plush’s betrayed expression. Henry didn’t want Tommy to abandon him! Henry was going to think Tommy didn’t love him anymore! Tommy didn’t want Henry to think that!\n“Sorry Henry,” Tommy whispered sadly. “I still love you, but you have to stay with Mr. Sam, now.” \nMr. Sam placed Henry on his desk and Tommy tried very hard to focus on the lesson until lunch, but every few seconds, his eyes would stray towards Henry’s slumped form. Henry looked so sad. \n(Please don’t be sad. It’s okay. Someone loves you, please…)\nWhen the bell rang for lunch, Tommy waited until everyone else had already left for the cafeteria before he walked up to Mr. Sam’s desk, his head bent down, his eyes staring resolutely at the floor. Mr. Sam’s shoes came into Tommy’s vision, and he heard Mr. Sam sigh. \n“Tommy, can you look at me please?” Mr. Sam asked softly. \nTommy wrapped his arms around himself as he shook his head. He didn’t want Mr. Sam to see him cry. Tommy knew he was a big man now, seven years old today, but he was miserable. This was an awful birthday! Tubbo wasn’t here, Henry was gone and Mr. Sam was disappointed in him! \nTommy wished he could just disappear. \nMr. Sam knelt down so that he could see Tommy’s face without Tommy moving. Mr. Sam looked sad, and Tommy didn’t want Mr. Sam to be sad. “I’m sorry,” he whispered, because apologizing was the fastest way to make everything better. “I’m sorry I was bad.” \nHis apology didn’t seem to work, though, as Mr. Sam just looked sadder. “Oh Tommy,” he whispered, and his voice sounded hurt. “You’re not bad, Tommy, it’s okay.” \n“”M sorry I brought Henry to school, even though I’m not ‘upposed to,” Tommy said, trying another apology. \n“Supposed to,” Mr. Sam corrected. “And I’m not angry with you. You’ve been bringing Henry to school a lot lately. Is there a reason why?” \n“I don’t want him to be lonely,” Tommy explained, biting his lip. “He’ll be all alone and then he’ll be sad. I don’t want Henry to be sad!” \nMr. Sam’s eyes narrowed. “Do you ever feel lonely?” he asked softly. \nTommy shifted uncomfortably. Tommy was lonely, sure, but the way Mr. Sam said it made Tommy wary. He said it like it was a bad thing. “Sometimes,” Tommy answered vaguely. “Can I have Henry back now, please?” \nMr. Sam stared at him for a couple more seconds before he nodded. “Yes Tommy,” he said, standing up and walking over to his desk where he gently lifted Henry and handed him to Tommy. Tommy hugged Henry tightly, mentally promising to never let Henry be taken away from him again. “Make sure not to have Henry out during class again, okay?”\n“Okay,” Tommy agreed. Tommy thought that was the end of it, but Mr. Sam called him back just as he was about to leave the classroom for lunch. \n“Tommy…” Mr. Sam said softly. “Is everything okay at home?”\nTommy froze, his hands clenching into fists at his side anxiously. Mr. Sam never asked about home before. Why was he asking about it now? He bit his lip as he stared at Mr. Sam. Was everything okay at home? \n\nWilbur was screaming at him, calling him selfish. “You’re just a waste of money!” he yelled, his arms crossed over his chest as he stared at Tommy with disdain. “You killed mom! I don’t even know why Dad kept you! You’re a horrible little brother!” \n\n\nTechno was ignoring him again. Techno thought Tommy didn’t hear him lock the door every time Tommy got near his bedroom, but Tommy did. After a few times of that happening before Tommy even got close to his room, Tommy realized that Techno just didn’t want to be around him. Tommy stopped seeking Techno out for things after that. \n\nPhil couldn’t look at him. Tommy couldn’t even remember the last time his dad looked him in the eyes. Whenever Tommy managed to have a conversation with him—once every few weeks or so—he would always be staring just over Tommy’s head, or just below. Never at him. Phil didn’t like looking at Tommy. \nTommy tried to keep the sadness and loneliness off his face as he answered Mr. Sam. \n“Yep, everything’s normal at home.”\n\n-.-.-\n\nHe got the idea from Tubbo, actually. \nHe’d been walking to Tubbo’s house after school with Tubbo and his dad, Mr. Schlatt, when Tubbo mentioned it. The day had been normal, only two days after Tommy’s seventh birthday. Tommy took a test on multiplication that he did well on—Mr. Schlatt said he was going to hang Tubbo’s test up on the fridge. Tubbo got a B on the test where Tommy got an A. \n(Tommy wasn’t going to bother showing Phil his test. Phil would probably throw the test away before he hung it up on the fridge.)\nTommy had noticed that Tubbo looked really sad all day, and he finally had the courage to ask what was wrong when they were a block away from Tubbo’s house. \n“Why are you all sad, Tubbo?” Tommy asked, kicking a random pebble off the sidewalk. \n“My Nana went to heaven yesterday,” Tubbo explained sadly, his chestnut eyes filling with tears. Beside him, Mr. Schlatt offered him a hug. “I don’t get to see her anymore.” \n“Why not?” Tommy asked. “Why can’t you just visit her in heaven?” \n“Daddy says I can’t go to heaven until I’m old and gray, like Nana,” Tubbo replied. \n“Why not? That sounds dis-crim-inating,” Tommy said, enunciating the big word he heard Wilbur use a few weeks ago. “We should go to heaven to visit your Nana, then you won’t be sad anymore!” \n“Yeah!” Tubbo exclaimed, his face brightening at the prospect. “Daddy, can we go to heaven to visit Nana, please? Please?” \nMr. Schlatt just sighed and shook his head sadly. “You can’t, Tubs,” he said. “I’m sorry.” \nTubbo began to cry, covering his face with his hands. Tommy, upset at the way Mr. Schlatt was upsetting his best friend, stepped forward with crossed arms. “That’s mean! You’re being a big meanie, Mr. Schlatt!” Tommy said, pointing an accusing finger at Mr. Schlatt’s chest. “Why can’t Tubbo and I go to heaven?!” \n“Heaven is where you go when you go to sleep for a long time,” Mr. Schlatt explained. “You’re too young to go to sleep for a long time.” \nTommy puffed out his cheeks. “How long?” \n“Forever,” Mr. Schlatt said. Tommy’s eyes widened. Forever? That was a really long time! How did Tubbo’s Nana sleep that long? Tommy could barely sleep longer than his alarm clock! \n“Oh,” Tommy said softly. “I don’t want Tubbo to go to sleep forever. When would we get to play?” \n“I still want to play with you, Tommy!” Tubbo cried. “I promise I won’t sleep forever!” \n“Good,” Mr. Schlatt said. “I would be really sad if you went to sleep forever.” \n“My mom went to sleep forever,” Tommy said with a frown. “But Wilbur said it’s because I killed her. That means she died.” \nMr. Schlatt’s face hardened. “Wilbur is wrong, kid,” he said with a frown. “You didn’t hurt your mom. It was just… really hard for her to stay awake, is all. She was ready to sleep. It’s not your fault.” \nTommy nodded, but it was hard to believe Mr. Schlatt was telling the truth when Wilbur said things like that all the time. He stuck his hands inside his pocket and continued to walk towards Tubbo’s house. \n“Does that mean Tommy’s mommy is in heaven with Nana?” Tubbo asked. Tommy perked up, interested in hearing the answer. \n“Yes, baby,” Mr. Schlatt said. “Tommy’s mommy is heaven like Nana.” \n“Maybe your mommy and my Nana are friends! How cool would that be?!” Tubbo cried, spinning around to face Tommy. “Maybe they even live next to each other!” \n“That’d be really cool!” Tommy said with a smile. “I wish I could live with my mom, I bet we’d have so much fun together!”\nMr. Schlatt’s face looked weird and pinched when he spoke. “But don’t you want to stay with your Dad and your brothers?” \nTommy frowned. He knew that if he went to live with his Mom in heaven, Wilbur would want to come too, but then Mom would spend all her time with Wilbur like Dad does. Then Tommy would be as alone there as he is here. \n“No, I think I want to live with my Mom in heaven,” Tommy said firmly. “Tubbo, do you think your Nana would like me?” \n“Nana would like you!” Tubbo promised before he frowned. He tapped the side of his chin thoughtfully. “But if you went to live with your mommy, you’d have to go to sleep forever! When would we play?”\n“I’ll just wake up!” Tommy promised. “I’ll go to sleep forever, except for on weekends! We can play on the weekends and then I can go back to my mom! Like Fundy does!” \n“I forgot that Fundy lives with his mom on the weekends and his dad on the school days,” Tubbo said with a frown. Fundy’s parents were divorced, which meant they didn’t love each other anymore. Fundy used to be sad when his parents split up, but he once mentioned that now he has two birthdays a year, instead of one! “Would your dad be okay with you living with your mom?” \nTommy thought of the way Phil couldn’t look at him. “I’m sure he won’t mind!” \nMr. Schlatt didn’t seem very happy, though. “Okay, enough, we’re done with this topic,” he said firmly. “Tommy is not going to live with his mom in heaven, and Tommy is definitely not allowed to sleep forever.” \n“But… why not?” Tommy whined. He would be happier living with his mom in heaven! He just knew it! \n“Because I said so,” Mr. Schlatt said, and his tone left no room for argument. \nTommy didn’t bring up the idea of living with his mom again, and they reached Tubbo’s house a couple of minutes after they finished the previous conversation. Tommy spent the rest of the day playing with Tubbo and eating Mr. Schlatt’s dinner before he walked a couple of houses down to his house. \nThe door was unlocked and Tommy could hear laughter coming from the living room. He peeked his head inside to see Phil, Wilbur, and Techno watching a movie together. A part of Tommy wanted to go inside and watch the movie with them, but the floor made a soft creak and Wilbur looked up and glared at Tommy. \nTommy quickly walked away from the living room and went into his bedroom. He sniffled softly as he sat down on his bed, grabbing Henry and crying into his soft fur. He just wanted to be included! Why didn’t they ever spend time with him?! \n“Why don’t they love me?” he sobbed. “I just want to be loved like Mr. Schlatt loves Tubbo!” \nHenry didn’t say anything, but Tommy felt like Henry was trying to hug him tighter. Tommy just cried, doing his best to be quiet so he didn’t bother his family. Wilbur looked really angry when he saw Tommy earlier, he didn’t want to know what would happen if he bothered him. \nWould… Would his mom do the same thing? \nTommy could only vaguely remember the feeling of being hugged by his mom. Tubbo was the only person who hugged Tommy now, and he hadn’t hugged Tommy since his birthday. Tommy really wanted a hug, but he knew he wouldn’t get one. \nBut Tommy’s mom would hug him! \nTommy never mentioned going to live with his mom in heaven to Tubbo after that night, but the idea never left his mind. \nTommy was going to figure out a way to sleep forever so he could live happily with his mom in Heaven, away from mean Wilbur and the rest of his family.\n\n-.-.-\n\nTommy spent a couple of days researching on the family computer the best way to sleep forever. The results were really weird, though, and Tommy had trouble understanding them. He saw a lot of posts talking about knives and ropes, and Tommy didn’t really understand how that would help fall asleep, but he found one post that said taking a lot of sleeping pills could make you sleep forever, so Tommy decided to go with that. \nTommy knew that Techno had something called “Insomnia” which made it hard for him to sleep. He had heard Phil talking about getting Techno sleeping pills and Tommy knew that they were kept in the bathroom. All Tommy had to do was take all of the funny candies inside the bottle and then he could go live with mom in heaven! \nOn the day Tommy decided to leave, he woke feeling oddly happy and excited. \nHe had a bounce in his step when he got dressed, and from his perch on Tommy’s bed, Tommy could see Henry smiling at him. \n“Today’s the day, Henry!” Tommy said with a grin. “We’re going to live with Mom!” \nHenry never responded, but Tommy felt a distinct form of excitement coming from the cow plush. With a wide smile on his face, Tommy skipped downstairs to the kitchen where everyone was already sitting eating food. \n“Good morning!” Tommy said with a cheesy laugh. \n“Why are you so happy this morning?” Wilbur asked with a bitter scoff. \n“I’m going to—” Tommy stopped himself with wide eyes as he clapped a hand over his mouth. Oh no! He almost told Wilbur he was going to live with mom! If Wilbur found out, he’d want to come too, and Tommy really didn’t want Wilbur to come with him. \nWilbur eyed him suspiciously. “You’re going where?” \n“To school!” Tommy replied. \n“You go to school every day,” Wilbur said, raising an eyebrow. “Why’s today any different?”\n“Just is!” Tommy said, shoveling a forkful of food into his mouth. \nWilbur just scoffed and went back to his food. Tommy grinned. Mission to derail Wilbur’s questions; Success! \nTommy had trouble paying attention during class, as he was too excited to go home and go to sleep, anxious to finally be with his mom. But Tommy also knew that he had to say his goodbyes. Tommy had said that he would wake up during the weekends so he could play with Tubbo, but his research showed that Tommy would be asleep forever forever. Which meant a really long time. \nTommy was sad that he would never see Tubbo again, of course, but he knew Tubbo would be happy for him. \nHe also wanted to say bye to Mr. Sam. Mr. Sam was Tommy’s favorite teacher out of all the teachers. He was really nice and he helped Tommy with history and he let Tommy bring Henry to school, as long as he only brought Henry out during lunch and recess. \nWhen the final bell rang, Tommy walked over to Mr. Sam’s desk quickly and placed a card on his desk. Mr. Sam looked at the card with a smile. “What’s this for?” he asked kindly. \n“It’s a goodbye card,” Tommy explained. “I made it all by myself!” \nMr. Sam frowned. “A goodbye card? Are you going somewhere?”\n“Mhm!” Tommy nodded. “I’m going to live with my mom.” \nMr. Sam looked even more confused. “I thought… I wasn’t aware your mom was in your life?” \n“She wasn’t, but she will be now,” Tommy said. “I probably won’t be coming to school anymore, so I wanted to say bye! Thank you for being my favorite teacher, Mr. Sam!” \nMr. Sam’s eyes softened, and he leaned down to pull Tommy into a hug. Tommy’s eyes widened at the sudden embrace, and he leaned into greedily to Mr. Sam’s warmth. A hug! Mr. Sam actually gave Tommy a hug! \n“I’m going to miss you, Tommy,” he said. “Thank you for being my student. I hope you’re happy with your mom.” \n“I will!” Tommy said with a grin. “Bye-bye, Mr. Sam!” \n“Bye-Bye, Tommy.” \nSatisfied with his goodbye, Tommy skipped out of school to meet with Tubbo. They were going to walk home together again, but Mr. Schlatt was busy at work today, so Tubbo and Tommy were walking home with some of the big kids in their neighborhood. \nAs they walked, Tommy ignored the big kids talking about their upcoming tests, and lightly tugged on Tubbo’s sweater. “Tubbo,” he said quietly. “I have to tell you something!” \n“What’s up?” Tubbo whispered. \n“I’m leaving tonight,” Tommy said. “I’m going to live with my mom.” \n“But I thought your mommy was in heaven? Daddy said you’re not allowed to go!” \n“But my Dad is okay with it!” Tommy argued. \n“Really? He knows?” \n“Well, no, but I’m sure if I told him, he wouldn’t mind,” Tommy said. “Doesn’t matter what he thinks, though, ‘cause I’m leaving tonight anyway.” \n“Oh,” Tubbo said with a frown. “Will you still wake up on the weekends to play with me?” \nTommy frowned. “I don’t think so, Tubs,” he said with a sad sigh. “I’m sorry.” \n“I’m going to miss you,” Tubbo said, tears starting to fall down his cheeks. “Why do you have to go? Why can’t you just stay here?” \n“I don’t want to be sad anymore,” Tommy admitted. “I’ll be happier with my mom, I think.” \n“Oh. Well. I don’t want you to be sad,” Tubbo said with a frown. “So, I guess it’s okay. I’m going to miss you lots, though.” \n“I’ll miss you, too!” Tommy exclaimed, pulling Tubbo into a hug. Usually, he didn’t initiate contact with people, not wanting to make anyone uncomfortable, but this is the last time Tommy would see Tubbo, so he made sure to give him a proper goodbye. \nWhen Tommy got back to his house, he noticed that everyone was home already. Not that surprising, since Phil got off of work early today and Wilbur and Techno’s school was really close to Phil’s work. \nThey were currently watching some weird TV show when Tommy walked inside. Usually, Tommy would hover around the living room whenever this happened, awkwardly waiting to either be invited to sit down or sent away, but this time, Tommy happily ran to his bedroom to finish getting ready. \nThere wasn’t much he wanted to take with him, nothing actually. The only thing Tommy planned to take with him to his Mom was Henry. Even though he knew they probably wouldn’t read it, Tommy made sure to write a quick goodbye card to his family so they knew where he went. \n\nTo family,\n\n\nI’m going to live with Mommy in Hevan, like Tubbo’s Nana. I have to sleep foreber, tho, so this is goodbye. \n\n\nI love you lots\n\n\nTommy\n\nSatisfied with the note, Tommy doodled a little sketch of him holding hands with Mom under a rainbow so they knew that he was going to be happy. Once that was finished, Tommy quickly cleaned his bedroom so that he wouldn’t be leaving behind a big mess, and placed the card on his freshly made bed.\nWith that done, Tommy was finally ready to leave. \nWith Henry in hand, Tommy walked into the bathroom and stood on his tip-toes to reach Techno’s sleeping candies. They were inside an orange bottle with a cap on it, and Tommy struggled to open it for a few seconds before the lid popped off. \nThere were a lot of green tic-tacs inside, and Tommy frowned. The post said Tommy had to take a lot of them to sleep forever, but Tommy wasn’t sure how much was a lot. Just to be safe, Tommy poured the entire bottle into his hand before he swallowed them down with the water from the sink. \nIt was hard to swallow so many candies at once, and it took Tommy a couple of gulps of water before they were all gone. Almost immediately, Tommy felt strange. His tummy started to feel all weird and twisty inside, but Tommy figured that meant the candies were working. \nAs he stood there for a few seconds, getting dizzier and dizzier, Tommy realized that he really, really wanted to hug his family before he left forever. \nTommy found it was really hard to walk, as his head was starting to get really fuzzy, but Tommy really wanted that hug, so he persevered, and awkwardly stumbled into the living room where everyone was watching TV. \n“Tommy, move, you’re in the way!” he heard Wilbur exclaim. \n“Wil—Wilby!” Tommy said with a smile. Tommy hadn’t called Wilbur, Wilby, since he was five and Wilbur got really angry with him. Wilbur gave him a strange look when Tommy spoke, and he frowned, sharing an odd glance with Techno. \n“Tommy?” he said hesitantly. “What’s wrong with you? Why are your words slurring like that?”\n“I wan’... I wan’ a hug, please, Wilby!” Tommy said, stretching his hands out towards Wilbur. “Can I hav’... have a hug, now?” \n“Tommy?” Techno was the one speaking this time. “Are… Are you okay? You’re acting weird.” \n“‘M okie,” Tommy said with a wobbly grin. “Jus’ wan’ a hug goodbye!” \n“Goodbye? You going somewhere, mate?” Phil asked, raising his eyebrow. Though his words sounded amused, he was eyeing Tommy with a concerned look.\n“Mhm!” Tommy nodded, only when he nodded the world spun, and Tommy stumbled, barely managing to stay standing. “Going to… to live with Momma!” \n“What?” Wilbur asked, and his voice sounded strained. \n“Oh no,” Tommy said, covering his mouth. “Not ‘upposed to say that! Wilby… you… you can’t come to Heaven with me!” \n“What are you talking about?! Tommy!” Wilbur lunged forward to catch Tommy when the dizziness finally got the better of him. “Tommy what’s the matter with you?!” \n“Dad…?” Techno asked nervously. \n“‘M gonna live with Momma in Heaven, Wilby,” Tommy explained before his eyebrows furrowed. “My tummy hurts.” \n“Dad, something's wrong,” Wilbur said, looking at Phil desperately. \n“Why does your tummy hurt?” Phil asked, kneeling next to Tommy and Wilbur. “Tommy? What’s going on?” \n“I… I ate all of Techie’s icky candy in the bottle,” Tommy said. “It didn’t taste good.” \n“What? Candy? What candy?” Wilbur frowned before his eyes widened. “Oh my god, Techno your pills!” \nPhil made a weird choking noise as Techno raced to the bathroom. Phil leaned forward, his thumbs pushing Tommy’s eyelids up as he checked Tommy’s pupils. “Tommy! Tommy, I need you to tell me if you took Techno’s pills!”\n“I ate them all, Dad,” Tommy said with a giggle. The world was spinning like the weird teacup ride at the carnival Mr. Schlatt took Tubbo and him to. “I have to sleep forever so I can… can live… live with Momma in Heaven!” \n“Oh my god,” Wilbur explained, looking absolutely horrified. \n“All my sleeping pills are gone!” Techno shouted as he ran back into the room holding an empty bottle, his face frantic. \n“Fuck! Oh my god! Fuck! Techno call 911, now!” Phil shouted, holding Tommy’s body close to him. “Tommy, no! What have you done?!”\nWilbur was sobbing next to him and Tommy didn’t want Wilbur to be sad. Even though Wilbur scared him sometimes, Tommy still loved him. Even if Wilbur didn’t love Tommy all that much, Tommy hated it whenever Wilbur would get sad. \n“Don’ be sad, Wilby,” Tommy said, but it was getting harder to speak, his words coming out all mushed. “I’m living with Momma!” \n“No, no, no,” Wilbur muttered, yanking desperately at his hair. “Dad, do something!” \n“The ambulance is on it’s way!” Techno cried. “The lady on the phone said to try to get Tommy to throw up!”\nTommy was starting to get really tired, which meant the sleeping candies were working. “Bye-Bye, Wilby,” he said sleepily. “I’m gon’... gon’ live wit’ Momma.” \n“NO!” Wilbur shouted. “Tommy stay awake! You need to stay awake, please!” \nTommy felt Phil open his mouth and shove his fingers down his throat. Tommy whined at the uncomfortable feeling and instinctively gagged, but he was so tired, and the thought of moving to throw up made Tommy whimper. \n“Please throw up,” Phil begged. “Tommy, you need to throw it up!”\n“No! I’m sleepin’!” Tommy argued, but the world was spinning too fast and Tommy couldn’t even see Phil’s face anymore. “I’m tired.” \n“I know you’re tired bubby,” and if Tommy weren’t so exhausted, he would have been surprised at the nickname. Wilbur hadn’t called Tommy that since Kristen died. “But you need to stay awake, please! For me?” \nTommy tried really hard to focus on what Wilbur was saying, but the world was spinning and his tummy really hurt and all Tommy wanted to do was go to sleep. He could feel the exhaustion through every part of his body, but there was a reason he bothered everyone during their TV show instead of lying on his bed to sleep. \n“Hug? Please I wan’... wan’ hug?” Tommy mumbled, his words slurring together. \nSomeone sobbed, and Tommy could feel himself being embraced by warm arms. “I’m sorry, I’m sorry, I’m sorry,” someone wept over and over again. \nSomeone stuck their finger down Tommy’s throat again, and Tommy sluggishly pushed the hand away. “No, Tommy, you need to throw up—”\nThe ringing in his ears started to get louder, and it sounded like he was hearing everything from under the water, muffled and quiet. Tommy liked the quiet. It was much easier to fall asleep when everything was quiet. \n“Tommy,” someone’s voice cut through the pleasant fog that settled over Tommy’s mind. “Wake up! Keep your eyes open! Please! Please! I’m sorry, bubby, please don’t go! Don’t leave, please—” \n“The ambulance is here!” someone cried, and Tommy felt his body being jostled, and Tommy let out the softest of whimpers. He just wanted to go to sleep, why was everyone bothering him so much?\n“Oh thank god! OVER HERE! PLEASE HELP HE WON’T WAKE UP!” \nTommy managed to open his eyes briefly, his eyelashes fluttering. Tommy could just barely see the hazy outline of Wilbur and Phil leaning over him, flashing red and blue lights in the background. \n“Wil—Wilby?” Tommy whispered.\nWilbur’s eyes flashed down. “Tommy!” he wept, his voice cracking. Tears poured from his eyes like a faucet, some of the droplets landing on Tommy’s numb face. “Please don’t leave, I’m so sorry, please stay here. Don’t go. Stay awake, Tommy.” \n“‘M tired, Wilby,” Tommy muttered. \n“I know but please, for me, stay awake?” Wilbur begged. But Tommy could feel the exhaustion pulling him in, and his eyes fluttered shut once more. “NO! Tommy! TOMMY NO! Please, I’m so sorry, I love you, Tommy, please wake up. Wake up! WAKE UP TOMMY!”\nBut Tommy was just too tired to stay awake.\nWilbur was completely numb as he threw the shot back, relishing in the burning feeling of liquor sliding down his throat. He could see out of the corner of his eye, the way his friends stared at him with concern clear as day on their faces. Wilbur could understand why they were nervous, after all, they’d never seen him behave like this before. Wilbur, whenever invited out for drinks, was usually quite modest with them, never drinking more than a few glasses and a couple of shots. This was Wilbur’s eighth shot. \nTo be fair, however, no one had ever seen him on this day. \nIt was the ten year anniversary—\n“Another one, barkeep!” Wilbur called, slamming the glass on the counter. \n“Holy shit, Wilbur,” Quackity chuckled, but there was a nervous tint to it. “Should we cut you off?”\n“Big Q, my man, my main man,” Wilbur had to swallow the desire to say Big Man like it was poison on his tongue. “If you take away my access to alcohol tonight, I will never forgive you.” \nQuackity shifted anxiously, shooting a wide-eyed glance to Nikki who was sitting peacefully across the bar. “What’s his deal?” he asked in a stage whisper. \n“Don’t know,” Nikki shrugged, however, despite her blase attitude, she too was eyeing Wilbur with an uneasy look. “He’s never like this. Do you think something happened?”\n“You know I’m not deaf, right?” Wilbur asked before he let out a series of uncontrollable giggles when the waiter returned with another glass of whiskey. “Oh, I think I’ve fallen in love with the barkeep!” \n“Okay Wil, seriously, what’s the matter with you?” Quackity finally said, leaning forward to snatch the shot glass away from Wilbur before he had the chance to drink any of it. Wilbur whined pitifully as his only method of escape was stolen from his grasp. \n“Hey! Give it back! Come on man, don’t be mean!” Wilbur whined, making grabby hands towards the glass. \n“Seriously man, talk to us,” Quackity demanded. “You’re acting so weird!” \n“Please,” Wilbur whispered, fighting off the urge to cry. “I don’t want to be sober right now.” \n“Wil, wha—” Quackity’s attempt at interrogation was interrupted, however, by the sound of the door to the bar slamming open. \n“Dream! My friend!” Wilbur called, momentarily forgetting his lack of alcohol in favor of greeting his friends. “Looking good, mate!” \nDream paused as he eyed Wilbur quizzically. “You’re… not looking so good,” he said, regaining his stride as he took a seat next to Wilbur, his bright emerald eyes filled with concern. “What’s up, Wil?”\nWilbur was seriously starting to get tired of everyone asking if he was okay or not. Why couldn’t they understand that Wilbur was okay because he was currently not sober? They did not want to see how he coped with this night when he was. \n“I’m fineeee,” Wilbur said, drawing out the end of the world in a slur. “Let it go.”\n“How many has he had?” Dream asked, incredulous. \n“Eight or nine,” Nikki said with a slight shrug, her narrowed eyes giving away her concern. “I’ve honestly lost count.” \n“Well, that’s no good,” Dream hummed. “What’s got you drinking like there’s no tomorrow?” Dream asked, lightly elbowing Wilbur in the gut. “Don’t you have that huge meeting tomorrow with another record deal? Are you seriously going to show up hungover?”\nThat’s right. Wilbur had honestly forgotten about that. He had his agent schedule that meeting, if Wilbur had scheduled it, he would’ve known not to schedule it the day after… because he always drinks like it’s the civil war on the anniversary. \n“I’mma cancel it,” Wilbur said decisively. There was no way in hell Wilbur was going to be able to get out of bed tomorrow, just as there was no way in hell he was going to a meeting tomorrow. \n“You’re going to what?!” Quackity cried. “Wil, you’ve been so excited about this meeting! It’s all you’ve been talking about for the last three months!” \n“Okay, I’m officially concerned now,” Dream said with a furrowed brow. “What the hell is going on with you, Wilbur?” \nMaybe it was because he was drunk, or maybe it was because he was tired of spending this day stewing with regret, self-loathing, and two bottles of whiskey every year, but whatever reason it was, Wilbur decided he might as well tell his friends what today was and why Wilbur was drinking with reckless abandon. \nWilbur hummed nervously. “What do you know about my family?” \nEveryone paused for a moment, clearly not expecting that. To be fair, Wilbur never talked about his family, in fact, he was adamant he had none! So for him to willingly bring it up, they were rightfully a little wary. \n“Um… not much, to be honest,” Quackity said nervously. “I know you have a dad and a twin brother.” \nWilbur said nothing, but slightly inclined his head, a nonverbal cue to keep talking. \n“You were in foster care for a while, weren’t you?” Nikki asked hesitantly. \nThat much was true. \nAfter Tommy… after Tommy’s death, their family was investigated and found unsuitable. Wilbur and Techno were sent into separate foster homes for a little over a year while Phil took classes and struggled to gain custody. It didn’t really matter much in the end, though, because by the time Phil finally gained custody and they all began to live together again, they were no longer a family. \n“I was,” Wilbur nodded. “Do you know why I was in foster care?”\nThis was where everyone fell silent, an uneasy look being traded amongst his closest friends. Wilbur nodded when the silence lasted a little too long. He sighed and gestured for the waiter to come closer. \n“I’m going to need an entire round for my friends and me, please,” Wilbur said and the waiter nodded and quickly set off to get their drinks. \n“Er, Wil, I don’t think you should be drinking anymore,” Quackity cut in with a nervous laugh. \n“Trust me, this is as much for me as it is for you,” Wilbur said with a wave of his hand. “You’re going to need a drink if you wanna hear what happened.” \n“Oh...kay?” Quackity nodded. \nWhen their drinks arrived, Wilbur took a slow drag from his glass before he spoke. \n“You were right, I do have a dad, I suppose, but we don’t really talk. I think I’ve said all of five words to him since I moved out when I was eighteen,” Wilbur spoke. Nikki looked startled. She opened her mouth to speak but quickly shut it when Wilbur continued speaking. “My twin brother, Techno, we speak a little more often than I do with Phil, but not a lot. To be honest, we’re not really a family. Haven’t been since…” \nWilbur trailed off, his baby brother’s name sitting on his tongue. Wilbur let out a heavy sigh and closed his eyes, struggling to recall what he looked like. There was only one real picture ever taken on Tommy, and that was his kindergarten school picture. Wilbur had sorted through boxes upon boxes, desperately trying to find a single picture of Tommy. At the time, Wilbur was starting to forget his brother’s face, and that was unforgivable. \nFinding that picture had been both a blessing and a curse. \nWilbur was grateful for the picture, and it sat in a frame on his mantle at all times, but seeing that picture filled Wilbur with the most intense feelings of regret and self-loathing, some days, Wilbur couldn’t even stand to look at it. \n\nMurderer! Abuser! Criminal!\n\nHis mind would scream at him whenever he saw the picture, mockeries of the very same words Wilbur had once spat at Tommy, back when he was fourteen and stupid and thought he was invincibal. \n“Wilbur?” Nikki’s gentle voice pulled him from his thoughts. “Are you alright? You don’t… you don’t have to continue if you don’t want to.” \nWilbur smiled softly at her. She really was so kind. “It’s fine, Nikki,” he said with a shake of his head. “I can continue.” \n“If you’re sure…” she said. \n“I am,” Wilbur nodded. He took a deep breath, another sip of his drink, and then exhaled. “What I’m about to tell you, I’ve never told another person, except for my therapist.” \n“Okay…” Dream said warily. \n“I had a baby brother,” Wilbur said, and it felt choked as it came out of his mouth. He could see the way his friends paused for a moment, taking in Wilbur’s grim demeanor and he could see the way they all realized where this was going. Or at least, where they thought this was going. “His name…” Wilbur’s voice cracked as a tear fell down his cheek. “His name was Tommy Innit Craft,” he paused, steeling himself for what he was about to say next. “Today… Today is the ten-year anniversary of his suicide.” \nDead. Silence. \nNikki had covered her mouth with her hands, her eyes wide with sympathetic horror. Dream’s face was completely empty, but Wilbur could see the surprise and devastation in his eyes. Quackity had physically staggered back at Wilbur’s words, his mouth dropping with surprise. \n“Jeez-us,” he whispered in horrified shock. “God, Wil, I’m… holy shit. I’m so sorry—” \n“I helped kill him.” \nThere was another moment of shocked silence, this one lasting much longer than the one before as his friends visibly struggled with what to say next. Wilbur let out a desperate, half-hysterical giggle as he covered his face with his hand. \n“I helped push him to suicide, I… I was horrible to him,” Wilbur said, his voice coming out in a shaking whisper. His friends were silent as he spoke. “I was so cruel to him, guys. I… I blamed him for my mom’s death and I took it out on him.” \n“Wil—” Nikki reached out her hand as Wilbur descended into sobs. \n“I called him a murderer,” Wilbur said in between gasps. “I don’t think he even knew I loved him. He killed himself because he wanted to go live with our mom in heaven.” Wilbur choked on a sob as he looked up to make eye contact with Dream.\n“He was seven.” \n“Fuck.” Quackity said in an almost silent whisper. \n“My baby brother was seven years old and he swallowed an entire bottle of sleeping pills to get away from our family,” Wilbur wept. “To get away from me!” \nNikki covered her mouth as tears slid out of her eyes. “Wilbur,” she whispered. “God.”\n“He asked for… for a hug,” Wilbur said in a punched-out breath. “He came for a hug goodbye. The first time I told him I loved him was when he was dying in my arms!” \nWilbur’s hands were shaking as he downed the last bits of alcohol in his glass and slammed it onto the table hard enough to leave a crack in the glass. “Fuck,” Wilbur whispered, his other hand coming up to violently rub the tears from his eyes. “God, he was… he was just a baby—” \n“Wilbur, you’re having a panic attack,” Dream said quickly, his hand grasping Wilbur’s shoulder. \nWas he? That certainly explained why he felt like he couldn’t breathe. His entire head felt like it was submerged underwater, the water clogging his ears and forcing its way down his throat. Wilbur wasn’t sure if he wanted to force his head to the surface or just let the wave of panic take him. \n“Wilbur, you need to breathe,” Dream said, forcing Wilbur to look at him. “Come on, man, breathe!” \nWilbur whined as his throat closed, memories from all those years ago once again suffocating him. Tommy really was just a baby, wasn’t he? His front tooth hadn’t even grown in before he died. Just a baby. He deserved so much better than what he had. So much better. \n“Wilbur, please, calm down,” Nikki begged. There must have been so many people staring at them, at him, a grown twenty-four-year-old man breaking down at a bar, but Wilbur didn’t care. Everything hurt and he hated himself and he just wanted to go back and change everything—\n“Wilbur,” Dream’s voice was as hard as steel, and it brought Wilbur out of his spiraling thoughts. “Wilbur, look at me. Do you wish you could change what happened?” \nHow could he know what Wilbur was thinking? “More than anything,” Wilbur wept. “I’d give up everything just to fix what happened. I’d give up everything!” \nDream’s face had a strange glint to it, but Wilbur wasn’t sure if his drunken mind was just seeing things. His eyes seemed brighter, somehow, like they were glowing. Dream closed his eyes before Wilbur had the chance to look too deep into it. \nDream tugged Wilbur forward into a hug, and Wilbur grasped at his shoulders desperately as another sob shook his body. “I hate myself for what I did to him,” Wilbur whispered brokenly. “He was my baby brother. I was supposed to protect him! It was my job to protect him!” Wilbur wept. “I ruined him!” \n“It’s going to be okay—”\n“It’s never going to be okay!” Wilbur cried, frustrated tears mixing with the devastation that poured down his cheeks. “It will never be okay, Nikki, because I’m sitting here drinking my weight in booze while my baby brother rots in L’Manburg National Cemetery!” \nA sharp clap of pain on his cheek brought Wilbur out of his misery. He looked up at Nikki in shock, his face heating from where she’d struck him. “Wilbur Soot,” she hissed. “Don’t you dare sit here and pity yourself! Is this what Tommy would’ve wanted for you?” \n“He should,” Wilbur muttered darkly. “He should want this for me.” \n“But he doesn’t,” Nikki said with a glare. “He doesn’t want this for you!” \n“How would you know?!” Wilbur cried. “You’ve never even met him! You never will! How could you possibly know what he’d want for me?!” \n“Because if he’s anything like you, then he’s already forgiven you,” Nikki said, her voice soft as she leaned forward to cup Wilbur’s face. “He’s already forgiven you, Wil. You need to forgive yourself.” \n“I don’t think I can,” Wilbur said, his voice breaking as he felt himself starting to shatter. “I don’t think I can ever forgive myself.” \nNikki’s smile was full of pity, and the sight of it sent something ugly roaring in Wilbur’s stomach, but he couldn’t bring himself to be mad at Nikki for his kindness. But he also couldn’t bring himself to stare at that look any longer because he didn’t deserve it, and why couldn’t they see that? \n“Come on Wil,” she said, standing up and offering him a hand. “Let’s get you home. I don’t think this is a good place for you to be right now.” \nProbably not, even Wilbur could admit that. He wasn’t sure why he even accepted his friend’s invitation for drinks tonight, because he knew how he got. Wilbur let out a weary sigh and stood, taking Nikki’s offered hand and following her and the rest of his friends out of the bar. \nThe return to his apartment was hazy and blurred, he could only vaguely recall Nikki, Dream, and Quackity helping him into his apartment and settling him to bed. If Wilbur were sober enough, he might’ve been embarrassed by the state of his apartment. \nHis apartment, usually clean and only slightly disorganized, was a huge, shriveled mess of dirty laundry, random papers and day-old take-out. But since Wilbur was completely wasted, he only mumbled out a quiet, slurred “Thank you” to his friends before he completely backed out. \nThe last thing he heard before oblivion pulled him under, was a quiet, careful whisper, the words ringing in his head as he fell asleep. \n“I hope you use your second chance wisely, Wilbur. I really do.”\n\n-.-.-\n \nWhen Wilbur awoke the next morning, he was not greeted with the steady, agonizing pounding in his head from a hangover he definitely deserved for the amount of alcohol he consumed from the night prior. No, instead, Wilbur awoke feeling… smaller. \nHis eyebrows furrowed as he woke to the sounds of birds chirping outside his window and the sunlight beating unbearably against his face. He slowly cracked open his eyes only to do a double-take when he took in his surroundings. \n“What… the hell?” Wilbur muttered, rubbing his eyes harshly before opening them once again. “What the fuck?” Nope, he was still there. \nThrough no fault of his own, Wilbur was somehow standing in his childhood bedroom, a room that Wilbur had not seen since he left home at eighteen. The room looked almost exactly the same, with only a few small differences.\nHis bed was still shoved into the same far corner by the window, as always, his blankets piled up on in one gigantic heap. His nightstand looked almost the same, same worn, scratched wood, same rickety drawer that wouldn’t close all the way, but Tommy’s favorite plush Henry wasn’t there, and that’s where Wilbur kept it ever since Tommy died. Wilbur felt anger course through him at the missing plush. \n“I swear if Techno or Phil moved Henry, I will physically fight them,” he seethed as he stood up, stretching back and letting out an inaudible groan when his back popped. \nHe yawned and scratched his back as he walked through his childhood bedroom, taking in the familiar flaking walls. It’s been so long since he’s been here, but there was still the same overwhelming feeling of despair and self-loathing in these walls, Wilbur couldn’t stand to be here any longer. \nHe wasn’t sure how he got here, but he was going to have some choice words with whoever brought him here. \nWilbur slammed open the door, his rage practically radiating off of him as he stalked through the hall to the kitchen. He was expecting to see the small framed photo of Tommy in kindergarten sitting on the coffee table where Phil always kept it—Wilbur remembered the violent screaming match he got into with Phil over it. He’d been so pissed when he found out Phil took the photo of Tommy from him and got it copied—but it wasn’t there. Wilbur narrowed his eyes at the missing photo, as though it personally offended him, which it kind of did. \nPhil wasn’t sitting in the kitchen with a steaming mug of coffee like he always was this time in the morning, so Wilbur slouched into the kitchen to make himself a mug of coffee. He frowned when he struggled to reach the top cabinet. Did… did the shelves get taller or something? \n“W-Wilbur?” \nWilbur turned around, a scowl already present on his face when he heard the familiar voice of his estranged twin brother. “Techno—What the hell?!” Wilbur’s sarcastic remark died on his tongue when he caught sight of his brother. \nTechno looked like he was fourteen again. Techno looked like he was fourteen again! \n“What the fuck,” Techno breathed, his eyes wide as they stared at Wilbur. “What the fuck. W-Wilbur? Is that you?” \n“I should be asking you that!” Wilbur cried. “You look like you're fourteen!” \n“So do you,” Techno replied. “What the fuck is going on?!” \n“What?!” Wilbur cried, rushing over to the full-length mirror at the end of the hall. Sure enough, Wilbur looked just like his fourteen-year-old self. He stared unseeingly at his reflection, disbelief coating his features. “This can’t be real…” \n“Boys?” Wilbur turned to see Phil standing in the doorway of his bedroom in shock. He looked younger, too, Wilbur thought. His hair wasn’t tinged with white, and the bags that seemed ever present under his eyes ever since Wilbur was fifteen were nonexistent. \n“Phil?” Techno said, looking at the man with wide eyes. “What is happening?!”\n“I… I don’t—” Phil stuttered, his eyes wide with disbelief. “H-How is this possible?” \nWilbur was completely silent, his mouth wide with uncomprehending shock. He was fourteen again. How could this be happening? Somehow, somehow, Wilbur was standing in his childhood house, surrounded by the family he hasn’t spoken with in years, de-aged ten years!\n“It looks exactly the same…” Techno mused to himself, his eyes darting around the familiar halls, nostalgia tinging his eyes. “Everything except…” \nWilbur caught the exact moment Techno noticed the missing picture in the living room. His eyes hardened and he spun back around to glare at Phil. “You moved his picture?” he hissed, and Wilbur was almost surprised at the venom in his twin’s voice. Techno was almost always on Phil’s side whenever he started a fight with him. \nPhil’s eyes widened and he spun around to face the living room, a small, choked noise escaping his lips as he covered his mouth with his hands. “I didn’t,” he swore. “I didn’t touch Tommy’s picture!” \n“Well, it’s missing,” Techno pointed out with a glare. \n“So’s Henry,” Wilbur said, crossing his arms over his chest as he leveled Phil with a scathing glance. “Henry’s always on my nightstand, but he wasn’t there when I woke up.” \n“What the hell, Phil?” Techno demanded. “Why are all of Tommy’s things missing?” \n“Boys, I swear I didn’t touch Tommy’s picture or Henry,” Phil said, his voice grave. “I’d never do anything like that to Tommy!” \n“Yeah, we know you didn’t do anything for Tommy,” Wilbur snapped. “That’s the fucking problem, Phil!”\nPhil flinched back, his blue eyes watering as hurt cut deep across his face. “That’s not fair,” he whispered softly. \n“Seriously, Wilbur?” Techno scoffed. “Five minutes with him and you’re already starting shit,” he let out a bitter chuckle and shook his head. “Great family reunion, guys.” \n“Fuck off, Techno, you’re just as guilty as the rest of us!” Wilbur replied, his face screwed up with anger. “Don’t stand there and act like you’re a fucking saint!” \n“I’m not!” Techno hissed. “You think I don’t despise myself for what happened? You think I’m just above everything, don’t you?! Fuck you, Wilbur, you don’t know me!” \n“Boys, please, don’t do this,” Phil begged, stepping forward to place himself in between Wilbur and Techno. “Not now. Not today, of all days.” \n“Today of all days, huh? I’m surprised you even remembered,” Wilbur said, the start of tears springing up in his eyes. Wilbur knew what was happening. He left this house and never looked back when he was eighteen for a reason. This place, this house, it was full of bitter memories and the stark absence of the fourth member of their broken family. Wilbur couldn’t stand to be in this house, this house where Tommy died. Being here brought all the feelings of self-loathing, guilt and regret rushing back. Wilbur couldn’t stand it. “You weren’t very good about remembering that sort of thing.” \n“Wilbur,” Phil breathed, tears swelling up in his eyes. “I loved him.” \n“WELL, YOU DIDN’T LOVE HIM ENOUGH, DID YOU?!” Wilbur shouted, his voice cracking. “NONE OF US DID! THAT’S WHY HE’S NOT HERE!” \nIt was dead silent after that, no noise save for Wilbur’s struggled inhales and barely choked back sobs. The weight on his chest was unbearable, and fuck, he was too hungover for this. Wilbur really needed another drink. He needed a drink and he needed to not be fourteen again. \n“Fuck,” Wilbur sighed, dragging his hands down his face. “I can’t fucking do this. Not again. I can’t stand it here—” \n“You don’t get to just walk out after that!” Techno cried, stepping forward to grab Wilbur’s shoulder before he could leave. \n“Don’t touch me, Technoblade, I’m not kidding,” Wilbur hissed, flinching away from Techno’s touch. \n“No! You said your piece, now listen to mine!” Techno replied dryly. “You don’t get to come here and act like a saint in your grief! You don’t get to throw poison around and then walk away like nothing happened!” \n“That’s not—” \n“That’s exactly what’s happening here,” Techno reiterated, his gaze boring holes into Wilbur’s neck as Wilbur turned his gaze to the floor. “You think you’re alone in your grief? Huh? You think we don’t miss him too? He was my brother, too, Wilbur!” \n“Then why didn’t you act like it?” Wilbur demanded, spinning around to level an accusatory glare at him. \nTechno simply raised an eyebrow. “Why didn’t you?” \nWilbur had nothing to say in response to that. Techno’s stare was cold and unwavering, and Wilbur couldn’t stand it. He couldn’t stand it. Wilbur’s face crumpled with grief, the sob that he had been holding back finally escaping his chest with a vengeance. He all but fell apart in front of his twin and father, his small frame wracking with the force of the sobs. \nTechno sighed. “You’re not alone in your grief, Wilbur,” he whispered. “We’re still here.” \nWilbur just shook his head. How was it fair for him to still have a family when Tommy was gone? How was it fair for Wilbur to rely on Phil and Techno when Tommy never could? How was it fair? Not for the first time, Wilbur wished Tommy was still here. If he were here the very first thing Wilbur would do is—\n\nTHUD!\n\nWilbur jolted in shock at the loud thud from the kitchen, his face paling. “Did you have someone over?” Wilbur asked, looking at Phil with shock. Did that mean the guest heard their entire argument? Wilbur flushed with a mixture of embarrassment and rage. \nPhil shook his head, his face white. “I didn’t.” \n“Someone broke in?” Techno asked, his eyes wide. “Should we call the police?” \nWilbur rolled his eyes. “No, Techno, we should invite them for breakfast!” \n“Don’t be an asshole, Wilbur,” Techno replied in a deadpan. “Oh wait—”\n“Boys! Is this really the time for that?” Phil demanded. Wilbur pursed his lips but said nothing. “Should we go see what it is?” \nWilbur didn’t even bother dignifying that with a response. Instead, Wilbur walked with purpose towards the kitchen. “Whoever’s in there, I have a baseball bat and I’m not afraid to use it!” Wilbur called, ignoring Techno’s hissed reply of, “Are you crazy?!” \nWhatever Wilbur had been expecting to see when he entered the kitchen, his dead baby brother was not one of them. \nWilbur faltered and then took a step back, his face dropping from pure shock. “T-Tommy?” \nTommy, his seven-year-old brother stood before him, a sheepish expression on his face as he looked warily at Wilbur. His messy, golden hair was tousled from sleep, a small bandaid on his cheek depicting dancing cartoon cows. He was wearing a pair of thin pajamas, and his feet, covered in mismatched socks, awkwardly shuffled on the linoleum floor. In his hands, held limply from the leg, Henry hung in Tommy’s hold. \n“Wha—Tommy?” Techno cried, rushing forward, Phil directly behind him. Techno crashed to a stop behind Wilbur, his eyes impossibly large as he stared at Tommy. When Phil caught sight of Tommy, he collapsed to the floor, a sob escaping his chest. \n“Tommy,” he whispered, his blue eyes swimming with tears. “Oh God, Tommy, Tommy…” \n“I… I’m sorry?” and God, it’s been so long since Wilbur heard his voice, he’d honestly forgotten it. The sound of Tommy speaking brought actual tears to his eyes, and he sagged against the wall. “I didn’t mean to… um, I was just… I just wanted some cereal?” There was a red, plastic cereal bowl on the ground, presumably dropped which was what made the loud thud. \n“Tommy, my baby,” Phil wept, his hand reaching out towards Tommy. Techno seemed completely catatonic. \nWilbur, though, Wilbur did the one thing that he’d always wanted to do. The one thing that he’d secretly wished for since Tommy’s death when he was fourteen. \nWilbur strode forward, ignoring the ache in his chest when Tommy flinched away from him in shock and pulled his baby brother into a tight embrace. \n“W-Wilbur?” Tommy squeaked, his eyes wide with shock. \n“I love you so much,” Wilbur wept, burying his face into Tommy’s golden curls. “I’m so sorry, bubba.” \nWilbur stood there for a long time, his arms wrapped around his now living brother, Phil’s sobs echoing throughout the small kitchen. Wilbur relished the contact, and after a couple of seconds, Tommy’s hesitance seemed to disappear as shaky hands slowly wrapped around Wilbur’s waist to return the hug. \n“Wilbur.” \nWilbur lifted his head from Tommy’s hair to see Techno staring at the calendar with a dark look on his face. “Look at the date,” he said, gesturing to the calendar on the fridge. Not willing to remove his hands from Tommy, Wilbur awkwardly shuffled to the left, only for his heart to drop to the bottom of his chest at the date. \nApril ninth. \nTommy’s seventh birthday, but also, exactly one week before Tommy’s suicide. \n\n“I hope you use your second chance wisely, Wilbur. I really do.”\n\nPer Phil’s insistence, Tommy stayed home from school that day. When asked why, Phil responded in an overly cheerful voice that did nothing to hide his true feelings of panic and grief, “It’s your birthday, silly!”\nTommy, who looked utterly gobsmacked at the idea, replies, in a very timid voice that simultaneously plucks Wilbur’s heartstrings and rips his heart to shreds, “You remembered?” \nWilbur forced himself to choke back a sob at the disbelief on his little brother’s face at the thought of his family remembering his birthday. The worst part was that the disbelief was not misplaced! Wilbur knew for a fact that they never celebrated Tommy’s seventh birthday, something Wilbur went on to regret for the rest of his life. Wilbur’s hands shook as he knelt down to look at Tommy. \n“Tommy,” he whispered, watching with a strange emotion bubbling in his gut when his baby brother—who’d been dead only hours earlier—turned to face him. “I know that we… we haven’t been a very good family, have we?” Tommy’s eyes narrowed slightly, and he nervously nibbled on his lower lip. “But that’s going to change! I promise you, we’re going to do better this time.” \nTommy said nothing for a very long time, simply eyeing them suspiciously. “Why?” he said after minutes turned into eternities. “Why would you… you said… but I’m a murd—” \n“No!” Wilbur cried, interrupting Tommy before he could finish that cursed sentence. Self-hatred poured over Wilbur like a crashing wave, and Wilbur took a couple of seconds to compose himself before he addressed Tommy’s disbelief. “You… You are not a murderer,” behind him, Phil let out a choked gasp, and Wilbur absently wondered if Phil even knew about the kind of shit Wilbur had been telling Tommy when they were kids. “You are my baby brother and I… I was wrong.” \nTommy eyed him suspiciously, and every moment that Tommy did not believe him, sent stabs of self-loathing down his spine. “You’re acting weird,” he muttered. \n“Tommy,” Techno said, finally shaking himself from his shocked stupor. “I know it may seem like… like a shock,” Understatement of the year. “But we really do mean it. And… And we’re going to prove it to you!” \nTommy stuck out his lower lip in a confused pout. “How?” \nTechno fumbled for a second, his eyes still locked on Tommy’s face. Phil, sensing Techno’s problem, jumped in. “It’s your birthday, today! What do you want to do today?” \n“I get to choose?” Tommy asked, incredulous. Wilbur recalled on his and Techno’s birthday, they would each choose an activity they wanted to do and Phil would allow them, and Tommy would be dragged along to do this and that while they always ignored Tommy’s birthday. It was all just so unfair, how horribly Tommy was treated. \nBut this is a second chance, Wilbur reminded himself. This was a second chance and there was no way in hell Wilbur was going to screw it up! \n“Yep!” Phil said, popping the ‘p’ as he spoke. “This is your day, Toms! Whatever you wanna do!” \nTommy frowned and looked at the ground, nibbling his lower lip as he thought. His sock-clad toes wiggled nervously against the linoleum tile, and his hands held Henry tightly to his chest. The picture was so soft and adorable and would have been absolutely heartwarming if not for the context behind it. Instead of a sweet child thinking about what he wanted to do for his birthday, it spoke of a lonely child anxious not to disappoint his family and ruin what he thought might be his only chance. \n“Can we… Can we watch a movie? Together?” Tommy asked softly, risking a glance towards Phil. \n“Of course, Toms!” Phil said, and though he sounded happy, Wilbur could hear the strain behind his voice. \nWilbur glanced to the left to look at his twin brother. Techno was still leaning heavily against the door frame, his eyes wide with disbelief as they traced Tommy’s features with a desperate glint to it. He was breathing heavily, and Wilbur could just barely see him counting his fingers over and over again, trying to convince himself that this was real. \n“Come on bubba,” Wilbur said, stepping forward to lightly push Tommy’s shoulder, gently guiding him to the living room. “Let’s go watch a movie!” \nTommy’s face lit up like someone just told him he won the lottery, instead of watching a movie with his family. Wilbur could vaguely remember watching movies with Phil and Techno, and glaring at Tommy whenever he tried to join them. No wonder Tommy wanted to watch a movie together so badly, he’d always been denied before. \nSwallowing the bitter taste in his mouth, Wilbur sat down on the couch and lightly tugged Tommy to sit next to him. Wilbur wasn’t sure if he’d ever cuddled with his baby brother before, but it was something he always regretted. With Tommy sitting next to him on the couch, looking incredibly unsure, Wilbur slowly put his arm around Tommy’s shoulder and pulled him into a half hug. \nPhil and Techno followed in suit, Techno sitting on the other side of Tommy with Phil sitting on the ground next to him. It seemed so domestic, and it was everything Wilbur had dreamed of and it was everything Wilbur had grieved the loss of. \n“What movie do you wanna watch, Tommy?” Phil asked, tilting his head back to get a better look at Tommy, his eyes desperately tracing every feature on Tommy’s face. Looks like Wilbur and Techno weren’t the only ones in utter disbelief. \n“Um… Up?” Tommy asked. \nPhil smiled warmly. “Sounds good, mate!” \nTommy slumped gratefully, as though he was worried about what they’d say about his movie choice. Wilbur slowly moved them so Tommy would be more comfortable leaning against him, but Tommy jolted like he was about to be hurt. \n“‘M sorry,” he mumbled, awkwardly pulling away. Wilbur’s heart shattered. \n“No, no, sweetheart, it’s okay,” he soothed. “Come back, I was just trying to make it more comfortable, is all. You can lie next to me, it’s okay.” \nTommy hesitantly laid back down, and Wilbur let out a sigh of relief. He wasn’t going to hold Tommy against his wishes, but Wilbur desperately wanted to hold Tommy, if only for a little bit. Wilbur still wasn’t entirely sure this wasn’t a dream, and Wilbur wanted to enjoy every moment of this if it was. \n“Have you watched this before, Tommy?” Techno asked as the movie loaded onto the TV. \n“Mhm,” Tommy nodded nervously. “Um, Mr. Schlatt let me and Tubs watch it at his house.” \nAh, Schlatt. Wilbur had nearly forgotten about the man. He was Tubbo’s father, and since Tubbo was Tommy’s best friend, Tommy was well-acquainted with the man. Wilbur—and by extension, Phil and Techno—had only met the man in passing. However, after Tommy’s suicide, the man had come to the house drunk and absolutely furious. \nHe had ranted to them about how horrible they were to Tommy, screaming with his red-face and slurred words about how Tommy deserved a better family, and that Phil was a disgrace of a father. At the time, Wilbur was numb. This happened only two weeks after Tommy’s funeral, and Wilbur still hadn’t fully processed it. \nPhil got into a screaming match with him, and it ended with the police being called and both men having to spend the night in a cell. After that, Wilbur never saw Schlatt again, but only a couple weeks later, CPS came to the house and determined Phil unfit and sent Wilbur and Techno off to separate foster homes. Wilbur to this day, never knew if it was Schlatt that made the call. \nPhil grimaced at the mention of Schlatt, his hands twisting into a fist. Techno, to his credit, didn’t even hesitate. “That sounds nice,” he said in his usual monotone voice. “Do you like Mr. Schlatt?”\nTommy’s eyes lit up. “Yes!” he said, excitedly bobbing his head up and down. It was the most animated Wilbur had seen him. “He’s so nice! He always talks about how much he loves Tubs and he always hangs Tubbo’s tests on the fridge, even when he gets a worser grade than me! Mr. Schlatt’s a really good daddy!” \nPhil winced at the unintentional barb and Wilbur wondered if Tommy’s tests had ever been hung on the fridge. Instinctively, Wilbur knew the answer was no. “He seems nice,” Wilbur said, his voice coming out a little harder than it should have because Tommy flinched back. \n“You’re angry?” he asked in a hushed whisper, trying to scooch away from him. \nWilbur wanted to cry. “No, baby, I’m not, I promise,” Wilbur said softly. “You can stay.” \nTommy eyes him suspiciously for a minute before he settles back into place. Wilbur was grateful that Tommy accepted his apology so easily, but another part of him hurt because Tommy was so sensitive to his moods, and that was because Tommy was scared of him. Wilbur knew that Tommy was afraid of him back then, but to witness it all over again hurt way more than it should have. \nThe silence was stifling before the movie began to play. \nAs the soft tones of the Pixar movie began to play, Wilbur let his gaze rest on Tommy’s golden curls. Tommy had settled into his position comfortably, and after twenty minutes passed, Wilbur felt his shirt grow damp. Gently shifting, Wilbur was able to see Tommy’s snoring face pressed against Wilbur’s chest, a small string of drool pooling on Wilbur’s shirt. \nWilbur internally cooed at Tommy’s adorableness. \n“He’s asleep?” Techno whispered, his eyebrow raising with surprise. Wilbur nodded. “Good, that means we can freak out now.” \nWilbur scowled. “What’s your problem, Techno?” \n“My problem? My problem is that we’re fourteen and Tommy's alive!” Techno cried in a hushed half-whisper. “He… he was dead yesterday and now we’re all sitting on the couch like everything’s normal!” \n“You should be fucking happy! Both of you should!” Wilbur exclaimed, mindful of his volume so as not to wake up his sleeping brother. “I mean, seriously! We have a second chance!”\n“It’s a miracle,” Phil agreed. “But we need to be careful. I mean, how did this even happen? It’s not possible!”\n“Clearly this is a time-travel scenario and there are rules to this kind of thing!” Techno protested. “We’re not supposed to change things! What if we write ourselves out of existence?!”\n“Are you fucking kidding me right now? Not change anything?!” Wilbur hissed. “Tommy kills himself in seven days and you want us to sit back and do nothing?!”\nTechno winced. “That’s not what I’m saying—” \n“That’s exactly what you’re saying!”\n“Don’t twist my words, Wilbur—”\n“Boys!” Phil’s hissed words interrupted the screaming match that Wilbur felt bubbling up in his throat. “Is this really the place for this?” he asked, shooting a meaningful look towards Tommy’s sleeping figure. “Why don’t we put him down to sleep and continue this in the kitchen, hm?” \nWilbur wanted to argue, wanted to hold Tommy tight to his chest where he could be protected forever and never let go, but Wilbur knew that this was a conversation that needed to be had. Wilbur reluctantly lifted Tommy up enough to slide out from underneath him, and gently rested his head on the couch cushion. Tommy mumbled sleepily but did not wake. \nWilbur allowed himself one last lingering look at his brother’s peaceful face, brushing his sandy hair out of Tommy’s face and pressing a soft kiss to his forehead before he walked into the kitchen. Out of the corner of his eye, Wilbur could see Phil and Techno both giving Tommy soft affection before they followed him. \nWilbur crossed his arms and leaned against the marble island. “So,” he said with a glare. “Speak your mind Techno. Explain to me how you want to sit back and do nothing with this second chance we’ve been given.” \n“Don’t say it like that, Wilbur, you know that’s not what I meant,” Techno hissed. “You think I want to just let Tommy die? Huh? You think I haven’t spent every day of my entire life wishing for this? For a second chance to prove to him how much I love him?”\n“Then why are you saying this?” Wilbur demanded. “We have a chance to fix everything! Tommy’s still alive, and we’re never going to let him kill himself! We have a real shot at being a family again! I mean, fuck, Techno,” Wilbur chuckled bitterly, dragging his hands down his face. “We haven’t been a family since Tommy’s death! This is our chance!” \n“We need to be careful, that’s all I’m saying,” Techno said with a sigh. “Of course we have to prevent Tommy’s death, I wasn’t saying we shouldn’t. I’m just saying we need to be careful! We don’t know how we got sent here and we can’t risk making a mistake.” \nPhil sighed, burying his face in his hands for a second before he nodded. “Techno’s right, Wil—”\nWilbur scoffed. “Of course he is.” \n“Don’t,” Phil warned with narrowed eyes. “Don’t start a fight. Not now. We can’t afford to be at each other's throats while Tommy’s life is on the line.” \n“So what do you suggest Dad,” Wilbur sneered, ignoring the flash of hurt on Phil’s face. \n“We need to work together to help Tommy,” Phil said. “We can’t be fighting like this in front of him.”\n“He already thinks something is up,” Techno pointed out. “We need to act like we did before Tommy’s death, otherwise he’ll get too suspicious.” \n“He’s seven! He’s not going to immediately jump to fucking time-travel if we don’t act as close as before,” Wilbur rolled his eyes. \n“We’ve gone back in time ten years somehow,” Techno said with a drawl. “But for Tommy, nothing changed. If we start screaming at each other when we used to be closer than close for no reason, he’s gonna get confused. Let’s throw one surprise at him at a time.” \n“Right because loving him is such a surprise,” Wilbur bit out. \n“It is,” Techno said with a blank face. Wilbur’s breath hitched in the back of his throat. “It is a surprise, Wilbur. You can lie to yourself all you want but don’t stand there and lie to the rest of us. All of us failed to be Tommy’s family when he was alive. We didn’t show him we loved him at all, and now we’re trying to change that.” \nWilbur groaned. “This is going to suck, isn’t it?” he asked, ignoring Techno’s statement. \n“Yeah,” Phil nodded. “This is probably going to be the hardest thing we’ll ever do.” \nWilbur shook his head. “No. Burying Tommy was the hardest thing we’ve ever done,” he said before he lifted his gaze to meet his brother and father. “Now, we have to make sure we never have to do it again.”\n\n-.-.-\n \nTommy had the most amazing dream. \nHe dreamt that his family remembered his birthday and Wilbur hugged him and told him he loved him and then they watched a movie together. It felt so realistic, that when Tommy began to wake up, he had to fight back tears. He sniffled quietly and angrily rubbed his face raw. Why was he even upset? It was just a stupid dream!\n“Tommy? What’s wrong? Why are you crying?” \nTommy looked up to see Wilbur hovering over him nervously, behind him stood Phil and Techno, both equally worried. Tommy’s lower lip wobbled. “It… It wasn’t a dream?” he asked softly. \nWilbur’s face crumbled. “Oh bubba…” \nTommy couldn’t remember the last time Wilbur had called him that, and it made his eyes water. He sniffled pathetically, mentally berating himself for showing such emotion in front of his older brothers and father. He knew they didn’t… they didn’t love him, and he should really stop bothering them before they get angry. \n“‘M sorry,” Tommy sniffed, harshly scrubbing the tears off his face. “I dunno why ‘m crying.” \nWilbur stepped forward, his hand reaching towards Tommy’s face. Tommy flinched back, his eyes wide. They’d never hit him before, but would they start now? Was this what Tommy got for bothering them so much? This really was a horrible birthday, isn’t it? \n“Tommy I’d never—” Wilbur cut himself off with a choked gasp when he saw the way Tommy flinched away from him. His voice sounded oddly choked as he approached Tommy slowly, his hands held hesitantly above his head. “I would never,” he said firmly. “I’d never hit you, Toms. None of us will, I promise.” \n“I… I know,” Tommy lied, shifting awkwardly at the tense atmosphere. “Sorry.” \nWilbur looked down, and for a second, Tommy could have sworn he was crying before he looked back up. “There’s nothing you need to apologize for, Toms.”\n“Don’t be sad birthday boy,” Phil cooed, and Tommy couldn’t stop the hiccup from escaping his chest. If this is a dream, don’t ever let me wake up, he begged. “Come on! What kind of cake do you want?”\n“A cake?” Tommy asked with disbelief, only flinching slightly when Wilbur leaned forward to gently wipe the leftover tears off his face. “I get a cake, too?”\n“Of course, you do, bubba!” Wilbur said, lightly tweaking Tommy’s nose playfully. “It’s your birthday, after all!” \n“Can… Can I please have… have a chocolate cake? Please?” Tommy whispered hesitantly. He always wanted to have a chocolate cake for his birthday, but he wouldn’t be heartbroken if Phil said no. \nInstead of shaking his head as Tommy expected, Phil’s face warmed as he smiled sweetly. “Of course honey,” he said, looking over to Techno—who had been acting very strangely all morning, and was still leaning against the wall staring at Tommy with a strange expression—and nodded his head. “Techno and I will run over to the store real quick and get your cake. Will you be alright with just Wilbur here, Toms?”\nTommy looked over at Wilbur suspiciously. Usually, when Tommy and Wilbur were the only ones home, Tommy would hide in his room in order to avoid him. Tommy hated the mean comments Wilbur always made whenever he saw Tommy, but Wilbur didn’t look at Tommy the way he usually did. \nIn place of the hateful sneer that seemed to live on his older brother’s face, Wilbur was staring at Tommy with a strange mix of grief and adoration. Something told Tommy that Wilbur wasn’t going to be mean to him while Phil and Techno went out. \n“Mhm,” Tommy nodded, squeezing Henry’s arm for luck. \nPhil nodded. “Alrighty then Toms, we’ll be back soon,” he said. And then, instead of just walking out the door as Tommy expected, Phil walked forward and pressed a gentle kiss to Tommy’s forehead. “I love you, Tommy.” he said, thumbing his forehead thrice before he and Techno left the house. \nTommy sat there, a shaky hand reaching up to lightly press the spot where Phil just kissed him in disbelief. He looked to Wilbur as if to confirm what just happened, and Wilbur looked at him with a strange expression. \n“Come on Toms,” he said, after he shook himself from his stupor. “Why don’t you show me your room? I don’t think I’ve ever seen it before!”\nTommy hesitated for a brief second. His room? That was his safe place and Wilbur wanted to go in it? A part of Tommy wanted to refuse, but Tommy was afraid that if he did, Wilbur would go back to being the way he was before. And Tommy didn’t want that. \n“Okay…” Tommy agreed, sliding off the couch to lead Wilbur to his room. \nTommy’s room wasn’t very exciting, but it was Tommy’s favorite room in the house. He watched nervously as Wilbur entered his safe place and looked around. Tommy said nothing, only nervously tugged on Henry’s ears as Wilbur walked around. \nHe paused at the tests and drawings taped up on Tommy’s walls. \n“What’s this?” he asked, turning to look at Tommy curiously.\n“Um, they’re my tests,” Tommy said, stepping forward warily. “I.. I did good on them, see? That one’s an A and that one’s an A plus!” Tommy smiled as he looked at the tests that he worked hard on. “And these are my drawings I made in art class!” \n“They’re very nice,” Wilbur said with a soft smile. \n“I know,” Tommy said with a small grin. “That’s why they’re on the wall, see? It means I’m proud of myself!” \nWilbur paused at that and turned to look at Tommy with a frown. “You… You know, if you wanted, we could put these on the fridge?” \nTommy froze, his eyes widening impossibly large. “On… On the fridge?” \nWilbur nodded. “Of course, Toms,” he said. “If you want to.” \nTommy did want to. Tommy remembered crying himself to sleep a couple of weeks ago when Tommy got his first A plus and Phil didn’t even look at it, where Mr. Schlatt put Tubbo’s B on the fridge. \nHe nodded eagerly and reached forward to delicately tear the A-plus test off the wall, only to freeze a second later. “We have to put it on the side, though…” Tommy said nervously. “So Dad doesn’t get angry.” \nWilbur’s face did a funny thing then, almost like he was constipated. He frowned deeply and Tommy hesitantly took a step back. “Phil, er, Dad won’t get mad at you if you hang your test up on the fridge.” \n“Are you sure? I really don’t want to make him angry, Wilbur,” Tommy said. \n“I’m sure, Toms,” Wilbur said, and he sniffed awkwardly. Tommy watches apprehensively as Wilbur reaches for Tommy’s A-plus test and lightly tugs it off the wall. “Come on, bubba, let’s go put this on the fridge!” \nTommy tries hard to suppress a smile at the thought of his best test hanging up on the fridge. He follows Wilbur into the kitchen and watches him hang the test up by a smiley face magnet Techno had gotten from school a few years ago. \n“Wait!” Tommy cries, stopping Wilbur seconds before he places the test in the very front of the fridge! “We should put it on the side of the fridge, so it’s not taking up so much space.” Tommy suggested, nervously eyeing the music scores Wilbur would be covering with his test. He really didn’t want to cover up Wilbur’s music, Phil liked that music! That’s why it was at the center! What would he say if he came home to see Wilbur’s music covered up by something of Tommys? Would he just decide Tommy was being too selfish and cancel his first-ever birthday party? Tommy couldn’t risk it! \nWilbur’s face fell slightly, and Tommy didn’t know why. Wilbur knelt down in front of him and lightly placed his hands on his shoulders. “Tommy…” he whispered, biting his lip. “Why… Why don’t you want to put the test on the front of the fridge where everyone can see?” \nTommy toed the linoleum tile awkwardly. “But Dad won’t like it if I cover up your music…” \nWilbur looked strangely constipated at the answer, as he looked at the ground for several tense moments before he let out a shuddering sigh. “This is going to be so much harder than I thought it would be,” he said. \n“What?” Tommy asked nervously, his fingers clenching at his side. \n“Nothing, bubs, just me being silly like usual,” Wilbur said with a wry smile. “Come on Tommy, I promise Phil won’t be mad if we put your test on the front of the fridge.” \n“Phil?”\nWilbur paused. “Er, Dad, I mean,” he said quickly. “Nevermind that, Toms, let’s put this test where it belongs!” \nFor a brief moment, Tommy is afraid Wilbur intends to throw the test in the trash, but Wilbur simply places the test on the center of the fridge, covering several music scores and even one of Techno’s papers, and takes a step back to look at it proudly. \n“Good job on your test, Toms,” Wilbur says, and Tommy, for what felt like the hundredth time that day, wonders if perhaps he’s still sleeping. \nBefore Tommy has the chance to say anything, perhaps ask if Wilbur is feeling well—perhaps ask if aliens came in the middle of the night to replace his family—the front door opens, the loud sudden noise making Tommy flinch as though he’d been caught doing something bad.\n“Oh! They’re back!” Wilbur said, his voice sounding strangely strained. \n“We’re home!” Phil called, stumbling through the door, his arms weighed down by several plastic bags. “We got food for dinner and some special surprises for a very special boy…” \nIt took Tommy an embarrassingly long time to realize that he was the special boy in question, and that the brightly wrapped presents barely hidden by the plastic bags were meant for him! He gaped at Phil, his eyes wide with sheer disbelief. \n“I got presents?” he gasped, a bright smile lighting up his face. “Really?!” \nTechno mumbled something under his breath and Tommy tensed, his body trembling as he took a small step backward, prepared to run back to his room. Whenever Techno was angry, he’d storm through the house, his loud footfalls scaring Tommy into hiding. He should have known better than to think he’d really get a birthday party. \n“Tech,” Phil said softly, shooting a glance at Tommy. \nTommy watched nervously as Techno looked at him, his eyes flashing with pain for a brief second before he looked back down. “Sorry for scaring you Tommy,” he said softly. “I didn’t mean to.” \nTommy laughed to cover up the way his hands trembled. “You didn’t scare me! I’m the biggest man ever!” \n“That’s right, you are!” Wilbur agreed from behind him. “And since you’re the biggest man ever, you get to choose whether you want to open presents first or eat dinner?” \nTommy hesitated. He really did want to open presents, but he was worried that if he made the wrong choice, everything would be taken away. He looked over to Phil for help, but his face didn’t give anything away. \nTaking a risk, Tommy chose to eat dinner first. No one seemed to be angry with his decision, so Tommy relaxed slightly. He took his usual spot at Techno’s side at the table, knowing that he was probably safest next to him, and dug into the food Phil had bought. \nAfter dinner was over, Tommy followed his family into the living room, where Phil had spread out several presents on the ground. “Go on then!” Phil said enthusiastically, and Tommy let out a small giggle and ran over to the pile. \nHe ripped open the first box, his blue eyes lighting up with excitement at the soft, fuzzy cow blanket. He blinked when a flash went off and looked up to see Techno holding a camera. “There seems to be a shortage of photos of you, Theseus,” Techno said when Tommy looked at him questioningly. \nTommy’s heart skipped a beat at the old nickname. Techno hadn’t called him that since momma went away. Tommy smiled warmly at Techno and Techno flushed, taking another picture. \n“Tommy! I want to see you open the present I got you!” Wilbur whined, drawing Tommy’s attention away from Techno. \n“You… you got me something?” Tommy asked. \n“I told Phil, er, I mean, I told Dad what to get while he was at the store,” Wilbur explained, looking at Phil with a strange emotion. Wilbur pointed to a small box near the edge of the pile. “That one’s mine!” \nTommy opened the box and let out a huge gasp, his eyes practically falling out of his skull with excitement. “It’s a moth!” he cried, gleefully pulling the moth plush out of the box. “Look! Look at her! She’s so pretty!” \n“I’m glad you like her, Toms,” Wilbur said with a soft smile. \n“I love her!” Tommy exclaimed. “I’m gonna call you Clementine!” \nThe rest of the evening played out much the same. Tommy opened what felt like hundreds of gifts, when really there were probably only a couple. Each one felt absolutely priceless to him, as he’d never had a real birthday party before. \nAfter the gifts were all opened, they moved to the couches where Tommy was allowed to pick out another movie to watch. Tommy, still riding the high of spending positive quality time with his family, chose another Pixar movie, and settled against Wilbur and Techno. \nJust as he felt himself starting to fall asleep, Tommy jolted up in a panic, startling Wilbur. “Tommy?” he cried. “Are you alright?” \nTommy’s eyes watered. “This is… This is the best birthday I’ve ever had!” \nWilbur’s face softened. “Awww, Tommy…” he cooed. “Why do you look so sad, then?” \nTommy sniffled. “I don’t want it to be a dream!” he wailed. \n“Tommy,” Tommy turned, blinking the blurriness from his eyes as he faced Phil. “I promise this isn’t a dream, mate. We’re going to do better.” \n“We love you, Theseus,” Techno said, his hand gently carding through Tommy’s curls. “You can go to sleep. I promise we’ll still be here in the morning.” \nAnd Tommy believed him. \n(Not really, but he wanted to hope.)\n\n-.-.-\n \n“That was so much harder than I thought it would be,” Phil whispered, lightly caressing his son’s sleeping face. “He… he thought it was a dream.” \nTechno’s face was grim as he gently lifted Tommy and slowly walked to his bedroom. “Yeah, well, it’s not that surprising given our history,” he said. He slowly placed Tommy in his bed and tucked him in with his new blanket, making sure Clementine and Henry were right next to him. “But we just have to keep moving forward.” \n“He was so scared to put his test on the fridge,” Wilbur whispers. “Worried he’d make Phil angry.” \nPhil closed his eyes and let his head fall back against the wall, self-loathing flowing through him like a wave. “I don’t know what I’m doing,” Phil whispered, covering his face with his hands. “What am I doing? How are we supposed to change what we’ve done?” \n“We just have to be better!” Wilbur hissed. “You don’t get to give up now! Not when we finally have a chance!” \n“I’m not giving up!” Phil replied sharply. “But you can’t just expect to fix everything in a day! He… He thought you were going to hit him!” and wasn’t that just a punch to the gut. Phil hadn’t felt that much grief and nausea since three weeks after the boys had been sent to foster care and Phil got on the family computer for the first time and saw “How can I sleep forever” in the search history.\n“I know,” Wilbur sighed. “I know. But… But we just need to keep trying.” \n“And that’s going to fix everything?” \nWilbur’s voice cracked. “We have to try.” \n“We’re not giving up Wilbur,” Techno grunted. “We’re just asking you to be a little more realistic.” \n“Realistic? What? Realistic like traveling ten years back in time?” Wilbur snapped. “Is that realistic?” \n“Boys? Again? Really? You’re going to wake up Tommy!” Phil said in an exasperated tone. This gave both boys a pause at the ridiculousness of the situation. It was silent for a few seconds as the three of them seemed to realize that. \nFinally, Wilbur cracked a smile. “I’m twenty-four, and Phil’s telling me to be quiet so I don’t wake up my dead brother ten years in the past,” he said with a dark chuckle. \n“None of this is funny,” Techno points out. \n“I know,” Wilbur nods. He bent his head and pinched the bridge of his nose. “Okay. We… We need to stop arguing so much. It’s not getting us anywhere.” \n“That’s what I’ve been saying—” \n“We also need to come up with a game plan,” Wilbur continued, ignoring Phil’s splutters. “We need to keep an eye on Tommy and make sure he doesn’t… that he doesn’t get to… you know.” \n“Kill himself,” Phil said, spitting the words through his lips like venom. \n“Right,” Wilbur nods, uneasily clearing his throat. “Techno, grab your pills and hide them somewhere—”\n“I flushed them down the toilet ten minutes after I realized the date,” Techno interrupted, crossing his arms over his chest. “I wasn’t risking it.” \n“Okay, good,” Wilbur nodded. “Now we just need to keep an eye on him and get through the rest of the week.” \n“And what happens at the end of the week?” Phil asked. \nWilbur frowned. “I don’t know.”\nWilbur awoke the next morning, uncomfortably cramped in his childhood bed, and let out a sigh of relief. It wasn’t a dream. Wilbur let a relieved smile crawl across his face as he turned around to snuggle into the pillow. \nIt was real. He really went back in time and Tommy—his sweet, baby brother—was still alive! They had a real shot at saving him! And yeah, it was going to be hard based on the way he reacted yesterday, but that didn’t mean they were going to give up! If anything, it meant he was going to try harder. \nThrough the morning breeze, Wilbur smelled a faint scent of eggs being cooked, and slowly sat up. Phil must be awake, cooking breakfast in the kitchen. The thought of Phil standing in his childhood kitchen, preparing breakfast for his three children forced a lump of nostalgia down his throat. \nHow long had it been since Wilbur ate a meal cooked by Phil? A decade at least, maybe even more. After Tommy’s death, Wilbur had been in too deep a state of catatonia to eat much—he could vaguely recall the panic Phil went through during that phase, wondering if he needed to hospitalize Wilbur to keep one of his two sons left alive. After Wilbur had been sent to his foster home, a very friendly couple by the names of Bad and Skeppy, Wilbur got back into a regular eating schedule. When Phil finally got custody back, Wilbur was too furious with the man to eat anything he prepared, so Wilbur usually cooked instead. \nWilbur let out a heavy sigh and stumbled out of bed, stumbling slightly as he was used to his twenty-four-year-old body, not his fourteen one. He walked through the silent hall into the kitchen where, sure enough, Phil stood in front of the stove making eggs and pancakes. Wilbur stood against the threshold of the kitchen for a few seconds, watching the man work silently. \nIt was so bizarre to see Phil after all these years, looking as though nothing had changed. Phil, who had turned to open the fridge, startled when he saw Wilbur staring at him. “Mate,” he said, placing his hand on his chest with a sheepish grin. “You scared me. Why didn’t you say anything?”\nWilbur shrugged. “Didn’t have anything to say.” and that was true enough. \n“Ah,” Phil said, his grin tugging down at the corners. “Right.” \nThey stood there in awkward silence, then, neither one of them knew what to say. There was so much damage between them, and for the longest time, Wilbur always thought it was irreparable. Now, though, standing in front of him in their old home with their past mistakes walking around as a living ghost, Wilbur wasn’t so sure. \n“Wilbur,” Phil said, breaking the silence with a sigh. He turned off the stovetop, moved the pan of eggs off the heat, and braced himself against the counter. “We can’t just leave things as they are anymore, can we?” \n“I suppose not,” Wilbur conceded, pulling out a chair. Something told him this would be a long conversation. “But I don’t really know what there is to say. Do you?” \nPhil was silent for a long time, long enough for Wilbur to assume that that was the end of the conversation. Wilbur pursed his lips and nodded, moving to stand up and walk away, only to pause when Phil spoke. \n“I know you blame me for what happened,” he said softly, and Wilbur froze. “That’s okay because I blame myself, too. If I had just been a better father… if I hadn’t been so caught up in my grief…” Phil sucked in a harsh breath. “There is no excuse for the mistakes I’ve made, Wil, I know that. My choices made me lose all my sons, not just Tommy.” \nWilbur’s chest clenched and he looked down at the table, his hands clenched into fists. “Why did you blame him?” \n“Why did you?” \nThe question wasn’t meant to be a taunt, Wilbur knew, but he sucked in a breath and tensed anyway. “I was a kid!” Wilbur cried. “I didn’t know… I was just a kid! I know that’s not an excuse, but it’s the truth! I was just a stupid little kid who just lost his mother and I thought…” \nPhil’s face softened. “I know, Wil, I know.” \nWilbur covered his face with his hands. “It’s not an excuse for what I did,” he said into his palms. “I was young but I should have known better. I’ve made my peace with that.”\n“Then why are you still so angry?” Phil asked, sitting down in the chair opposite Wilbur’s. \n“You don’t get to ask me that,” Wilbur hissed, dropping his hands to glare at Phil. “I’m angry because of you! You… You were the adult! You were supposed to be our dad! Even if I was being stupid and petty, you were supposed to recognize that and fix it! But you never did!”\n“That’s true,” Phil allowed. “I never bothered to fix it, and when it was too late, it became one of my biggest regrets.” \n“I will never forgive you for that,” Wilbur said honestly because it was true. It had taken years of intense therapy for Wilbur to even consider forgiving himself for his part in Tommy’s suicide. But Wilbur knew that he could never forgive Phil for his part in it. \n“I’ve made my peace with that,” Phil said gently. “I’ve known for a long time that my actions were irredeemable and I knew that I never had a chance at fixing my relationship with my remaining sons.” \n“Then why did you keep trying?” Wilbur asked. If Phil had known this whole time that Wilbur could never forgive him, why did he always try to reach out? Every year on his birthday, Wilbur would get a call from an unknown number—unknown because Wilbur refused to save it to his contacts—but Wilbur always knew it was Phil. \n“How could I not?” Phil replied in lieu of an answer. “How could I not try and reach out after what happened? When my negligence caused the loss of one of my sons, how could you expect me to make the same mistake again?” \nWilbur was silent. Deep inside of him, an ache that he didn’t realize still existed, pulsed inside him. The desperate desire for family, the longing for his father who Wilbur once thought could do no wrong. \n“So where do we go from here?” he asked, looking up at his father and finally, for the first time in a decade, seeing the broken man underneath the gentle facade. “I can’t forgive you. But we need to get along for Tommy.” \nPhil nodded. “I suppose, instead of forgiving, we can work on moving forward?” \n“Moving forward?” \n“You don’t have to forgive me, Wil,” Phil said with a soft smile, full of resigned acceptance. “But please. Can’t we try to move past it? We won’t be starting over, it’s not fair to either of us, but can’t we at least try to heal?” \n“Phil I—” \n“I miss my family, Wil,” Phil whispered. “We have a real chance to fix things. You don’t have to forgive me, but please, can’t we try to be a family again?” \nWilbur was silent for a long time, his eyes searching Phil’s face for any sign of deception. When he saw the genuine desperation in his father’s face, Wilbur knew he wasn’t lying. Wilbur closed his eyes, and all the hatred and bitterness that Wilbur kept locked inside of him started to lessen. \nIt had been there for so long, Wilbur had begun to think it was simply a part of him. He never really noticed how exhausting it was. He never noticed just how heavy it was, it had been weighing him down for so long. The ever-present ache from the emotions made Wilbur cringe. Could he really stop carrying it? \n“I think…” he whispered. “I think I want to heal.” \nPhil smiled and he slowly stood up to wrap his arms around Wilbur’s chest in a close embrace. Wilbur allowed himself to rest his head on Phil’s shoulder and take comfort in his father’s embrace for the first time in over a decade. \nSomewhere inside of him, a dull ache began to heal.\n\n-.-.-\n \nTommy woke up to the smell of pancakes, and he frowned for a second when his fingers hit a moth plush before his memories from the previous day hit him. He let out a surprised gasp and pulled Clementine close to his face, his hands trembling as he handled the moth with extreme care. \nIt… it wasn’t a dream! \nA hesitant smile made it’s way across Tommy’s face before he got control of himself. Just because yesterday was incredible, didn’t mean that today would be, too. Maybe yesterday was just a prank. When Tommy walked into the kitchen, everything would go back to normal and Dad would ignore him and Wilbur and Techno would glare at him. \nTommy let out a small whimper at the thought of having to go back to the way things used to be. It was just mean! How could they get Tommy’s hopes up like that, just to go back to the way they always were? \nTommy didn’t want to cry so he grabbed Henry and Clementine and hugged them tightly to his chest. “It’s okay guys,” he whispered. “We can get through it. Why? Because we’re the biggest men in the world! Even Clementine, but Clementine is the prettiest one.” \nWith a short nod, Tommy gained whatever confidence he had and left the safety of his room to walk into the kitchen. \nDad was dishing eggs and pancakes onto plates by the counter, while Wilbur and Techno sat at the table, staring at each other with weird expressions. Tommy wasn’t sure what was going on with his family lately, but it was weird. Why were Wilbur and Techno looking at each other like that? \n“Good morning, Toms,” Phil said, causing Tommy to jump and swivel his head to Phil in shock. Did… Did Dad really just greet him? “How did you sleep?”\nTommy was still in so much shock, it took a few seconds to realize that Phil had asked him a question. Tommy pulled Henry and Clementine close to him for comfort as he looked at the floor. “Good.” \nBecause he was staring resolutely at the floor, he missed Phil’s tightening expression at his hesitant response. Phil looked over at Wilbur for a brief second before he put the plates on the table and stepped over to Tommy.\n“Is everything okay, bud?” he asked, gently placing his hand on Tommy’s shoulder, saying nothing when Tommy flinched. \n“Mhmm,” Tommy nodded. “It’s… um, all good.” \n“Okay…” Phil didn’t sound like he believed him, but he didn’t push further, and Tommy was grateful for it. He wasn’t really sure what was going on, but Tommy didn’t want to accidentally say the wrong thing and make everyone hate him again. \n“Are you hungry bubba?” Wilbur called, patting the seat next to him. Tommy’s breath hitched when Wilbur called him bubba, his eyes lighting up with joy. “Come sit next to me, let’s eat!”\nWilbur called him ‘bubba’ and was inviting him to sit next to him during breakfast, Phil was paying attention to him… What was happening? It was just like yesterday! Tommy didn’t know why they were acting like this, but Tommy was going to enjoy it for as long as it lasted. \nTommy walked over to the empty seat in between Wilbur and Techno and sat down, hesitantly looking at Techno to make sure he wasn’t angry. Techno nodded and smiled—it was tiny, and could have just as easily been a twitch, but Tommy wanted to think his gruff brother actually smiled at him, so he didn’t read too much into it. \n“Hurry up and eat, kids,” Phil said, placing their plates in front of them. “I gotta get you guys to school.”\n“You’re making us go to school?” Wilbur demanded, and Tommy flinched at the anger in his voice, and he quickly hunched in on himself. If he was smaller, maybe Wilbur wouldn’t turn his anger on Tommy. \n“Wil,” Phil said, shooting a glance at Tommy. Wilbur paused and grimaced when he saw Tommy. Tommy shrank even further. Was he mad? Was he going to yell? Tommy’s trembling fingers slowly started to work over the soft patch of fur on Henry’s ear, trying to calm himself down. \n“I’m sorry, Tommy,” Wilbur said softly. “I wasn’t mad, I promise. Just… a little surprised, is all.” \nTommy wasn’t sure why Wilbur was apologizing to him for acting the way he usually did, but he didn’t want to make Wilbur angrier by ignoring his apology, so Tommy quickly said, “It’s okay.” \n“It’s not, but I’m going to do better,” Wilbur promised, and it was so strange that Tommy uncurled a little to look at him. Wilbur just smiled before he turned his attention back to dad. “Why are we going to school?”\n“Because you need to,” Phil said plainly. “I can’t keep you out of school without reason, Wil.” \n“And this isn’t a good enough reason?” Wilbur scoffed. “What do you expect us to do in high school?” \n“What usual high schoolers do, Wil,” Phil responded. Tommy frowned in confusion. Why were they talking funny? Tommy had a distinct feeling that he was missing something, and he wasn’t really sure how to find out what it was. \n“Right…” Techno drawled beside him. “This’ll be fun.” \n“You’ll be fine, boys,” Phil said with a dismissive wave of his hand. “Stop overreacting.”\n“Over—” Wilbur cut himself off, glancing nervously at Tommy. “Overreacting? I think we’re a little justified, given the situation…” Wilbur said in an even tone. \n“Wilbur, enough. You’re going to school. End of story.” Phil said firmly. Tommy quickly shoveled the food in his mouth, wanting to get as far away from the table as possible, as it looked like Wilbur was about to get very angry. \nHe cleared his plate in less than a minute, and though his stomach gurgled unhappily at how quickly he ate, Tommy stood up from the table. Usually when he did this, he would be able to get away without anyone noticing, but this time, all three heads snapped over to him the second he moved. \nTommy froze at the sudden attention, unsure. “Um… I’m finished?” he said pointing at his empty plate. \n“Oh! Wow, you… you must have been hungry?” Phil said with a nervous laugh. Tommy merely shrugged, awkwardly shifting. “Do you want some more?” \nTommy shook his head. “I gotta go, now.” \nEveryone at the table froze, and for a brief second, Tommy could have sworn they looked panicked. “Go? Go where? You don’t need to go, Tommy, you can stay!” Wilbur said frantically. \n“I have school…” Tommy replied hesitantly. \nPhil frowned and looked at the clock. “School doesn’t start for another hour. Why do you want to leave so early?” he asked. \n“It takes a long time to walk,” Tommy said with a shrug. “Better to leave early.” \nTechno’s face did a funny thing. “You… you walk to school?” Tommy nodded silently, confused as to why they looked so shocked. Didn’t they know that, already?\n“Well, you don’t need to worry about that anymore,” Phil said, his face weirdly tight. “I’ll be driving you from now on.” \n“But… I thought you were too busy?” Tommy asked, tilting his head. \n“Nope! I’m never too busy for you, Toms,” Phil said, his voice oddly choked up. “Besides, it’s not safe to walk on your own. What if you got lost? No, I think it’d be better if I just drive you from now on.” \nTommy didn’t argue. He was too stunned to speak. Dad… Dad wanted to drive him to school? Secretly, Tommy had always wished that Phil would drive him to school like all the other daddies drove their sons. \n“Does that sound okay?” Phil asked. \nTommy nodded enthusiastically, a large grin spreading across his face. Even if it all ended tomorrow, Tommy wanted to enjoy spending time with his family today. Phil’s face seemed to melt with relief. “Alright then, why don’t you go get ready?” \nTommy let out a nearly silent giggle as he ran back to his room to get ready. He was practically bouncing up and down with joy. “Can you believe it?” Tommy cried to Henry. “Dad actually wants to drive me to school! And… And… And Wilbur’s being nice to me! I don’t know why, but I love it!” \nHenry gave him a look that practically screamed ‘it’s not going to last’. \n“I know that, Henry, I’m not a stupid baby,” Tommy spit as he pulled off his shirt and grabbed another one. “‘M just sayin’ that it’s nice!” \nHenry’s black eyes seemed to almost stare at him with pity. \n“Don’t give me that sass, Henry,” Tommy said, glaring at the cow as he slipped on a pair of jeans and his sneakers. \nClementine, who had been silent moments before, shifted down just a little, and her button eyes almost looked worried. Though she hadn’t been with him as long as Henry, Tommy treasured her. \n“I’m not getting my hopes up, Clem,” Tommy disagreed. “I know it won’t last long. I just… I just wanna enjoy it while it lasts…” \nAs Tommy finished tucking his laces under his heels, Clementine and Henry seemed to back off, which Tommy appreciated. He knew they were just looking out for him, but Tommy really didn’t want to think about what was going to happen when it all went back to normal. Why couldn’t he just enjoy it while it lasts? \nAs Tommy finished packing his back, he sent a worrying look at his plushies. Should he bring them? Mr. Sam didn’t like it when Tommy brought Henry to school, but he couldn’t help it! He didn’t want Henry to be lonely in Tommy’s room. Sure, Henry had Clementine now, but it wasn’t the same as being with Tommy. \n“Clem… you haven’t met Tubs yet, have you?” Tommy said, a small smile lighting up his features. “That’s a crime! I guess you’ll have to come with me! Tubs will be so jealous!” \nWith that settled, Tommy tucked Henry and Clementine into his backpack and walked into the living room where everyone was waiting. \nWilbur noticed him first, a smile pulling up the corners of his mouth. “Tommy! You look so adorable!” \nTommy flushed and looked at the ground. “Thanks.” he mumbled. \nWhen he looked up he noticed Techno staring at his shoes with confusion. “Tommy, why are your laces under your feet?” he asked. \n“I dunno how to tie shoes,” Tommy said with a shrug. “It’s easier this way, I don’t trip as much.”\nPhil looked gutted, and Tommy wasn’t sure why. “You… you never learned how to tie your shoes?” he whispered, his hands shaking. Tommy shook his head hesitantly. It wasn’t that big of a deal… So why did he look so upset?\n“Oh Toms,” Wilbur said softly, crestfallen. \n“C’mere Tommy,” Techno said, waving him over. “Let me show you.” \nTommy’s face lit up at the chance to spend time with Techno. Techno was definitely Tommy’s favorite brother, but he rarely ever talked to Tommy. Tommy walked over to Techno and let Techno place his foot on his knee. \nTechno gently slipped the laces out from underneath Tommy’s heel. “Watch. You make a knot, and then two bunny ears,” Techno said, and Tommy giggled. Techno’s face seemed to soften and he smiled slightly. “And then you make another knot.”\nTommy gasped when Techno was done and revealed a bow. “You did it!” he said with a laugh. \n“That’s right,” Techno nodded. “Now it’s your turn.” \nTommy frowned, nervously nibbling on his lower lip. If he did it wrong, would Techno be upset? He slowly reached for the laces and made two bunny ears. He made a knot like Techno showed him, but it just fell apart. Tommy looked at Techno with fear. “I’m sorry—” \n“Hey, it’s okay,” Techno soothed. “It’s your first time, it’s alright to make a mistake.” \n“Sorry,” Tommy apologized anyway. Techno just smiled gently at him. \n“It’s alright, Toms,” he said. “Try again. Remember, you have to make a knot before the bunny ears.” \nTommy nodded and tried again, this time making a knot, then bunny ears, and then another knot. When he pulled the bunny ears tight, they formed a bow, just like Techno’s. Tommy let out a surprised gasp and looked up at Techno. \n“Look! I did it!” he cried. “I tied my shoes!” \nTechno’s smile was soft and he reached forward to ruffle Tommy’s hair, and Tommy didn’t flinch. “Good job, Theseus. You did it.” \nTommy had never felt so much joy in his life, and he let out another giggle. “I did it! I’m the biggest man ever!” \n“That’s right you are,” Wilbur said, reaching forward to tweak his nose. “Big Man Tommy Innit!” \n“I’m proud of you Tommy,” Phil said with a smile, and Tommy had to fight back tears. Had Phil ever said that before? Tommy wasn’t sure. If he ever did, Tommy couldn’t remember it. If Tommy thought yesterday was the best day of his life… \n“Now then, I think it’s time to get to school!” Techno said. “You ready Toms?” \nTommy nodded. He couldn’t wait to show Tubbo his tied shoes and Clementine. Tubbo would never believe it! \n“Come on, then,” Phil said. “Off to school!” \n“Ugh. Don’t remind me,” Wilbur griped. \nTommy followed them into the car and he rode to school with a smile on his face.\n\n-.-.-\n \nWilbur honestly thought they were doing pretty well. It was clear that their new behavior had been an adjustment for Tommy, who took their kindness hesitantly, always waiting for it to be taken back. That was hard to watch, to be honest. But Wilbur powered through because this was his brother, and Tommy deserved to be loved. \nIt had been three days since Wilbur and his estranged family woke up ten years in the past, and Wilbur felt like he really had a shot at fixing things. \nThen Tommy came back from school, two days after his birthday, and Wilbur felt the entire world crash down upon him. \n“Did you know that Tubs Nana went to heaven?” he asked as he walked through the door. Though Phil desperately wanted to be able to pick up Tommy after school, it was impossible as he was back to working the frankly ridiculous hours he used to. Since Tommy was used to walking home from school with Tubbo and Schlatt, Phil conceded that it was okay. \n(Wilbur didn’t comment on Phil’s obvious grudge against Schlatt.)\nIt took a few seconds for Wilbur to process what Tommy said before he frowned in sympathy. “Oh, no, I didn’t. I’m sorry, Tommy. Tubbo must be really sad, huh?” \nWilbur had been sitting at the kitchen table doing homework from school. (Hah.) It was incredibly easy since Wilbur had already graduated, but it was so easy it was almost boring, and Wilbur had been putting it off. Across the table sat Techno, who was facing a similar problem. \n“I guess,” Tommy shrugged. “Mr. Schlatt won’t let him visit her, even though Tubbo really wants to.” \n“Well you can’t exactly visit Heaven, Tommy,” Techno said, not looking up from his worksheet.\n“That’s what Mr. Schlatt said,” Tommy pouted. “I just don’t think it’s fair.” \n“Yeah, Heaven’s not very fair, is it?” Wilbur said, and though his tone was light, Wilbur felt dread start to grow in the pit of his stomach. \n“Tubs said that Momma probably lives next to his Nana,” Tommy continued, and just like that, both Wilbur and Techno were staring at Tommy with dread. “I think I want to live with Momma in Heaven, like Fundy does. I’d have to sleep forever, but I think I’ll wake up on the weekends so I can play with Tubbo—” \n“NO!” Wilbur shouted, and Tommy startled, but Wilbur was too busy trying not to have a panic attack to notice. He reached out to grab Tommy and pull him into a tight hug. “No, no, no, no—” \n“Wilbur, calm down, you’re scaring him,” Techno called, but Wilbur could hear the fear in his twin’s voice. \n“I’m sorry,” Tommy whispered. “I’m sorry.” \nIt took Wilbur a ridiculously long time to calm his racing heart, and even longer to convince himself to let Tommy go. When he finally did, Tommy stumbled backwards. Instinctively, his hand reached out to steady him, but Tommy only flinched. \nFuck. With that simple motion, Wilbur felt like any progress they’d made over the past few days were shattered. “I'm sorry Tommy,” Wilbur said gently. “I didn’t mean to scare you.” \nTommy nodded, but Wilbur could tell he didn’t believe him. \n“Tommy,” Techno said, his voice uncharacteristically serious. “You are not, under any circumstances, allowed to live with mom.” \nTommy frowned. “Why not? Won’t… won’t you be happier?” \nWilbur felt like he’d just been sucker-punched. He sucked in a harsh breath, the phantom pains of Wilbur’s grief choking him. “No!” he choked out. “No, baby, please, we’d miss you so much! You can’t go!” \n“You’d… You’d miss me?” Tommy asked, his voice high-pitched and surprised. \n\nHe stood frozen as he watched the tiny coffin that held his baby brother’s body was lowered into the ground. He felt like he was having an out-of-body experience as Phil tossed a handful of dirt over the coffin, sobs wrenching their way out of his father’s chest. \n\n\nSitting in his old house for the first time since Tommy’s… Phil had finally gotten custody back of him and Techno, and for what? They would never be a family again. The house was empty and Wilbur hated it. \n\n\nThree years had passed and they were breaking apart more and more every day. Techno’s face was constantly pale, eye backs so deep they looked like bruises. His insomnia was worse than ever, and he barely got enough sleep to be safe. Phil had tried to convince Techno to start taking medication again, only for Techno to sprint to the bathroom and vomit before breaking down into sobs. Phil didn’t suggest sleeping pills again. \n\n\nSix years since Tommy’s death and Wilbur was beyond wasted. He was so drunk, for a brief second, Wilbur could have sworn he saw Tommy. He raced out of the bar, drunkenly stumbling over his own feet as he chased after the ghost of his baby brother, only to get hit in the face with pepper spray as a mother defended her blonde son from the so-called ‘Drunk Creep’. \n\nWilbur blinked against tears, and out of the corner of his eye, Wilbur could see Techno trying to fight off tears. “Yes,” he whispered, his voice breaking. “So much. I’d miss you like I’d miss my hand.” \n“Really?” Tommy asked, stepping forward. \nWilbur nodded. “I love you so much Tommy, so please… Please, stay with us.” \nWhen Wilbur was able to wrap his arms around Tommy he buried his face in his brother’s sandy hair and sobbed. At some point, Techno had joined the hug, and the trio of brothers sat there crying and holding each other. \nEventually, Phil came home to find them in the kitchen. He was confused, but Wilbur was too emotionally exhausted to tell him what happened. Later, once Tommy had fallen asleep, Wilbur would explain what Tommy said and Phil would begin to cry. \nBut Tommy never agreed to stay, and Wilbur wouldn’t realize this until it was too late.\n\n-.-.-\n \nTommy stared at the rope in his hands with hesitance. \nHe felt a little guilty for going to live in Heaven even though he knew everyone would miss him—they would miss him! Tommy still couldn’t believe it!—but he knew he couldn’t stay. Even though things had been really good lately, Tommy knew it couldn’t last forever. It would be better for everyone if he was gone before it happened. \nHe’d done a bunch of research over the week on how to sleep forever, and there were a lot of results that he didn’t understand. He was originally going to eat some of Techno’s gross sleeping candies, but when he looked in the cabinet, they weren’t there. So instead, Tommy decided to go with the other option that didn’t seem like it would hurt. \nTommy had to watch countless videos on how to tie the rope for it to work right, but finally, after several practice attempts, Tommy was ready. \nTommy had already said his goodbyes, and though Tubbo was sad, he understood. Besides, maybe he could ask Momma if there was a way for him to wake up on the weekends, that way, Wilbur and Techno wouldn’t miss him too much. \nHe left a note for them just in case, so they know he went to live with Momma and stepped up on his tippy-toes to reach the fan. He had to jump up and throw the rope several times for it to secure around the fan, but once he did that, he was ready. \nAs he slipped the noose around his neck, he held Henry and Clementine close to his chest and breathed in. “It’s time to go be with momma, now,” he said. “Bye-bye Wilbur. Bye-bye-Techno. Bye-Bye dad.” \nWith that, Tommy kicked over the chair and the noose tightened. \nIt hurt. It hurt. It hurt. Tears began to stream down his face as he struggled against the pain in his neck, chest and head. In his struggle, he dropped Clementine and Henry, and Tommy sobbed harder. He didn’t like this. \nWhy did it hurt? He didn’t like it. He wanted it to stop. Just stop! Stop, stop, stop, stop—\nThere was a loud creaking sound before Tommy fell. Instantly, Tommy was able to breathe again, and he sucked in a deep breath and let out a hoarse scream that turned into a sob. Everything hurts! His leg was on fire, and Tommy didn’t know why it hurt so much. \nHe just wanted to live with momma in heaven, why did it have to hurt so much? \n“Tommy? What happened? Are you okay—TOMMY!” Wilbur burst the door open when he heard Tommy’s cries, only for a scream to escape his chest as he took in the sight of his little brother crying hysterically on the floor, drywall chunks scattered around him from where the ceiling fan had fallen off the ceiling. “PHIL! TECHNO! CALL AN AMBULANCE!” \nWilbur rushed into the room, his hands shaking as he gently touched Tommy’s face. His lips were blue. Why were his lips blue? Wilbur froze when he saw the rope tied around Tommy’s neck, the skin scraped raw. \n“Oh god…” Wilbur whispered in horror, nausea bubbling up inside him. “You didn’t…” \n“Wil? What’s happening—” Phil cut himself off as he saw the room. “Oh fuck. God, no. Please… he didn’t…” \nTommy was too busy crying to notice the panic of his family members as they raced into the room. His leg hurt! His head was pounding, but Tommy could breathe again. “Wilby,” Tommy whimpered, and Wilbur let out a choked cry. “It hurts! Please, it hurts so much!” \n“It’s going to be okay, bubba,” Wilbur wept. “Why did you do this? Why?” \n“I just wanted to stay with Momma!” Tommy cried. “It wasn’t ‘upposed to… to hurt!” \n“Wilbur, the fan is on his leg,” Techno called, and he slowly lifted the ceiling fan, and Tommy screamed. “I think it’s broken.” \n“Shh, my baby,” Phil cried, cradling Tommy’s head in his lap. “It’s alright. Dad’s here, it’s going to be okay.” \nTommy’s mind was nothing but a blur of pain and fear. He didn’t remember what they said to him, but he remembered Wilbur screaming at Tommy to stay awake. He didn’t remember the EMTs rushing into the room, and he didn’t remember being lifted onto a stretcher and raced to the hospital. \nThe last thing Tommy remembered was his family’s faces, staring at him from above, their faces contorted with desperate fear. It made Tommy sad to see them so scared. He wanted to comfort them, and tell them that they didn’t need to be scared, but Tommy fell asleep before he could.\n\n-.-.-\n \nPhil paced the length of the hospital waiting room, his face tense as he struggled not to scream. His little boy… God, just the image of Tommy’s body lying there, rope around his neck, ceiling fan crushing his leg, it made him want to vomit. \nTommy tried to kill himself. Again. \nFrom what he could gather, he tried to hang himself from his ceiling fan, only for it to fall, unable to support his weight. Phil wanted to feel numb, wanted to escape this overwhelming feeling of grief and failure. \nPhil thought they were doing well. He really thought they were fixing what they’d done. He thought they were helping Tommy! So why did he try to kill himself? What had they done wrong this time? \n“Phil…” Techno whispered, and Phil looked over to where the twins were sat huddled against each other in the uncomfortable waiting room chairs. “Sit down.” \n“I can’t,” Phil shook his head. “He…” \n“I know,” Techno nodded, his face grim. \n“My baby—” Phil’s voice broke. “How could we have missed it? Why did he…” \n“I don’t know,” Techno answered honestly. “But… we… we should have expected this, shouldn’t we?” \nPhil whipped around. “Don’t say that! How could you say that?! We… We shouldn’t have expected this! We were sent back to save him!” Phil cried, dragging his hands roughly through his hair. “We did everything—”\n“We showed him love and affection for a week,” Techno replied. “How was that going to solve years of neglect?” \nPhil wanted to cry. He wanted to scream. He just wanted everything to be fixed. He wanted Tommy to live! He wanted his family to be healed! Why did this have to happen? What had they done wrong? How could Phil have missed the signs? What drove Tommy to do this?\n“Family of Tommy Watson?” \nPhil spun around to see a doctor standing by the door. Phil raced over to him, Techno and Wilbur following close behind. “Is he okay?” Wilbur cried. “Is he alive? Please, is he alright?” \n“Tommy is alive and is expected to make a full recovery,” the doctor said. Phil slumped with relief, and he finally felt like he could breathe. “He had a bit of damage to his vocal chords and he should have a sore throat for a while. His leg is broken, so he’ll need to wear a cast for a while, but he’ll be just fine.” \n“Thank God,” Phil whispered. “Can we see him?” \nThe doctor frowned and looked at them, seemingly searching for something. Phil knew what the doctor must be thinking: Why would a seven-year-old try to kill himself? Phil knew exactly what was going to happen soon. CPS would definitely be called, and Phil would have to fight for his children. Again. \nBut Tommy was alive, and that, in Phil’s opinion, made every hardship that was soon to come absolutely worth it. \n“You can see him,” the doctor finally conceded. “He’s on some pain medication, though, so he’ll be a little loopy.” \n“Thank you,” Phil said. “Truly. Thank you.” \nPhil followed the instructions the doctor gave him to reach Tommy’s room, and when he arrived, he felt his heart shatter all over again. \nTommy looked so small lying in that hospital bed. His leg was wrapped in a red cast and elevated slightly off the bed. His neck, which was a ring of red and purple bruises, stood out against the pale white of the bedsheets, and it made Phil want to break down. \nTommy twisted his head to see who was at the door, and Phil didn’t even want to try and decipher the expression that came over Tommy’s face. \n“Hi, baby,” Phil said, stepping forward to brush a stray hair out of Tommy’s face and cup his cheek. \n“Hi, Dad,” Tommy replied, his voice scratchy and hoarse. A single tear managed to slide down his face. “Why are you crying?” \n“Because I almost lost you, baby,” Phil croaked. Again. “I was so scared.” \n“Oh.” Tommy whispered. “I’m sorry.” \nThe dam broke, and Phil began to weep. “Oh baby, I’m so sorry. I’m so sorry.” Phil whispered over and over again. He held his youngest son tightly, relishing the weight of Tommy’s head in his hand because it meant he was alive. \n“Toms,” Wilbur whispered. “Why did you do it?” \nTommy’s face crumbled. “I wanna stay with Momma,” he said, and Phil wanted the world to swallow him whole. “I thought it would be better!” \n“No, Toms,” Wilbur shook his head. “We love you!”\n“But how long will you love me?” Tommy asked and that… that broke Phil. “What if you stop loving me again?” \n“That’s why you did this?” Phil asked, his voice wrecked. “Because you were scared we’d stop loving you?” \n“You did before,” Tommy replied. “I thought it’d be better.” \n“It wouldn’t,” Phil denied instantly. “Tommy we’d miss you so much. I promise you, baby, we’re never going to stop loving you.” \nTommy eyed them suspiciously. “I don’t believe you.” \n“I know,” Phil sobbed. “But that’s okay. We’re going to prove it to you.” \nTommy didn’t say anything after that, and Phil allowed it. For the rest of the visiting hours, the small family stayed together in silence. After half an hour or so, Tommy dropped off to sleep, leaving Phil, Techno and Wilbur alone.\nWilbur’s face was red and blotchy from sobbing, and Phil was sure his face looked similar. Techno held Clementine and Henry tightly, his hands trembling as silent tears ran down his face. They failed. \nTommy, despite all their efforts, tried to kill himself. It was only sheer luck that kept him alive. They were so close to losing Tommy all over again! And why? Because Tommy thought they were going to stop loving him and he didn’t want to be there for it. \n“What do we do?” Wilbur asked, breaking the silence. \n“What?” Phil looked up. \n“What do we do now?” Wilbur repeated. “He… He’s alive but he still tried…” Wilbur trailed off, his face clenching with pain. “What do we do now?” \n“We have to do what’s best for Tommy,” Techno said. “Even if it’s hard.” \n“What does that mean?” Wilbur demanded, glaring at his twin. “What are you suggesting?” \n“One week of love can’t erase a lifetime of neglect, Wil,” Techno said, and he sounded exhausted. “Tommy doesn’t believe that we love him, which means he might try this again.” \n“So what do you think we should do?” Wilbur cried. “How do we fix this?” \nTechno looked up at him, and Phil flinched at the determination in his son’s face. “How do we fix this, Phil?” \n“We just.. We need to try harder—” Phil stuttered.\n“We need to do what’s best for Tommy,” Techno said again. “Not what’s best for us or this family. Tommy.” \nPhil’s breath hitched in the back of his throat as he realized exactly what Techno meant. “You… You c-can’t be serious—” \n“Phil.” \n“—we just got him back! We can’t! We just need to be more vigilant!” Phil continued, his hand seeking out Tommy’s and squeezing it gently, as if to remind himself that Tommy was still there. \n“What? What’s he suggesting? Techno?” Wilbur asked. \n“He’s suggesting we give Tommy up,” Phil said, choking on the words. “Give him up for adoption.” \n“WHAT?!” Wilbur cried. “What the fuck, Technoblade?! Are you serious? We can’t. What’s Tommy going to think if we just give him up after promising to love him forever?!”\n“I’m thinking that Tommy will be able to heal!” Techno snapped. \n“What’s wrong with you?! That’s our brother! How could you even suggest that?!” Wilbur demanded. “How could you be so selfish!?”\n“Selfish?! Selfish?!” Techno cried. “You’re being selfish! You want Tommy to stay here where he’s miserable?! Where he tried to kill himself just to get away from us?!” \nPhil sucked in a harsh breath. “Techno, we can’t just give up,” Phil argued. “We can still fix this—”\n“Do you think I want to do this?!” Techno asked. “I want Tommy to stay, too!”\n“Then let him stay!”\n“But I want Tommy to be alive, more!” Techno cried, and Phil closed his mouth with an audible snap. Wilbur looked like he’d been slapped across the face. Techno sighed and buried his face in his hands. “I want Tommy to be alive and happy. He won’t be if he stays here, with us.” \nPhil closed his eyes and he could see it. Exactly what Techno was talking about. He could see them bringing Tommy home from the hospital, and desperately trying to show him how much they cared about him, only for him to try again, only this time, they weren’t there to save him. \nHe could also see Tommy laughing and smiling, he’d be alive and healthy, and he’d grow up. But they wouldn’t be there to see it. It broke Phil’s heart. \nBut he wanted Tommy to live. \n“Techno’s right,” Phil whispered. Wilbur froze. \n“Excuse me?!” Wilbur cried. “Phil what the fuck?! Are you serious right now?!” \n“Wil, you know he’s right,” Phil said softly, staring at his son desperately. Wilbur’s eyes watered and Phil knew he’d won. “Tommy… Tommy isn’t happy with us. We… We lost our chance to be with him a long time ago. Whatever sent us here, didn’t send us back far enough to fix that mistake.” \n“You’re just giving up?” Wilbur asked, his voice cracking. “He’s right there! We… We could be a family! I thought you wanted to be a family! Please! Please don’t do this.” \n“Wilbur,” Phil said, stepping forward to take Wilbur’s shaking hand in his. “We will always be a family. I swear to you, we will. This isn’t the end.” \n“It is,” Wilbur wept. “That’s my brother! Your son! We’ve come so far, please don’t give up now!” \nPhil let his tears fall freely down his cheek. “Don’t think of it like that,” Phil said. “We’re not giving up, Wilbur. We’re doing what’s best for him.” \n“Why can’t we be what’s best for him?” Wilbur sobbed. \nPhil shook his head softly. “We lost that chance, Wil.” \n“No! No, but we were sent back to fix our mistake!” Wilbur argued weakly. “We were sent back to save our family.” \n“No, Wil,” Phil said, looking over to the sleeping figure on the hospital bed. “We were sent back to save Tommy.” \nWilbur’s face crumbled, and Phil could see the broken acceptance written all over his face. “We’re losing him all over again,” he cried. \n“No, we’re not,” Phil said firmly. “We aren’t going to leave him. We had our second chance, Wil, and we’re going to do this right.” \nPhil pulled Wilbur into a tight hug, his hand reaching out to grab Techno too. “My boys,” Phil whispered. “We will be a family, I swear. This is not the end for us.” \nTogether, in that hospital room, the Watson family wept together for a future they would never see, and finally, finally began to heal.\n\n-.-.-\n \nWilbur woke with a gasp, his body jolting up with shock as he took in his surroundings. He was back. His room was a disaster of dirty clothes, crumbled music scores and old take-out and it was home. \nWilbur was back. \n“Oh god!” he cried, frantically stumbling out of the bed from his phone. Was it all a dream? Was Tommy still gone? His trembling fingers scrolled through his contacts, searching for Phil’s number to find out if he knew what happened, only to freeze at a contact he didn’t have before. \nWith a shaky breath, Wilbur pressed the number and held the phone up to his face. “Please, please, please…” Wilbur begged. \nThe other end of the line clicked and Wilbur heard a groggy, grumpy, beautiful voice respond. “What the fuck, Wil? It’s like three in the morning, why are you calling me?” \n“Tommy,” Wilbur wept, relieved tears pouring down his face as he fell to the ground, hugging his knees to his chest. “Tommy, is that you?” \n“Yeah? You called me, dickhead,” Tommy replied. “Seriously, are you okay? You sound funny?” \n“I’m okay, Toms,” Wilbur said in between silent sobs. “I have never been better. God, Toms, I… I love you.” \n“Oh...kay? I love you too, Wil,” Tommy said hesitantly. “Are you sure you’re okay? You’re acting weird.” \n“I’m okay, Toms,” Wilbur said. “I just… I had a bad dream, is all. I really needed to hear your voice.” \n“Ah, of course! You needed big man Tommy Innit to make you feel better,” Tommy crowed. “I’m happy to be of service to you. Now, can I go back to sleep?” \n“Of course, bubba,” Wilbur whispered. “I love you.” \n“Love you, too, Wil,” Tommy laughed. “You are so weird. Good night Wilby.” \n“Good night, sunshine.” Wilbur said, and as the call ended, Wilbur leaned back against the dresser, he thanked every god out there. \nHis little brother was alive. \nWilbur would later come to realize that no one except for him remembers going back in time and the life they all lived before. Later, he would call Phil and demand to know what happened only to find out that Phil and Techno didn’t remember any of it. \nHe would come to find out that after Tommy’s attempt, CPS was called and Phil made the call to put them up for adoption while he worked on fixing himself and becoming a better parent. Wilbur would be able to recall a childhood he didn’t have before, where he and Techno were adopted by the very couple that had fostered Wilbur the first time, and though they had a new family, they never lost contact with Phil or Tommy. \nWilbur would find out that Tommy was adopted by Schlatt, and he lived to be a happy and healthy young man with his best friend turned brother, Tubbo. Their family, while no longer together, still talked, and they were slowly working towards healing. \nWilbur would find all this out later, though, as right now, he was too busy weeping on the floor of his bedroom, staring out the window at the moon and thanking every God he could think of for his second chance. \n\n“I’m glad you used your second chance, wisely.”\n"
}