{
    "id": "3439895",
    "url": "https://archiveofourown.org/works/3439895?view_full_work=true",
    "author": [
        "drunkonwriting"
    ],
    "title": "You Got Me",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen",
        "M/M"
    ],
    "fandoms": [
        "The Hobbit - All Media Types",
        "The Hobbit (Jackson Movies)"
    ],
    "relationships": [
        "Bilbo Baggins/Thorin Oakenshield"
    ],
    "characters": [
        "Thorin's Company"
    ],
    "additional_tags": [
        "Dwarf Culture & Customs",
        "Company-focused fic with some Thilbo thrown in",
        "everybody loves Bilbo and gives him shit",
        "Fluff",
        "Alternate Universe - Everyone Lives/Nobody Dies"
    ],
    "language": "English",
    "series": "",
    "published": "2015-02-26",
    "completed": null,
    "words": "18,983",
    "chapters": "1/1",
    "comments": "357",
    "kudos": "16,300",
    "bookmarks": "5,114",
    "hits": "155,281",
    "summary": "<p>The Company shows their affection for Bilbo in accordance with dwarvish tradition. Bilbo... has no idea why everyone keeps giving him gifts.</p>\n<p>(Dwarves give gifts of craft to start friendships or romance. Everybody lives AU, canon-compliant through the first movie.)</p>",
    "notes": "<p>i mean we all know dwarves love their craft so i decided to roll with that and make it A Thing That They Do. there are some footnotes throughout that are all in the endnotes. i don't really have references for the gifts, so use your ~imagination. the thilbo is pretty laid-back--they have like... two kisses and a lot of sexual tension. mostly an ensemble fic. this was originally going to be like 5k i don't really know what happened.</p>\n<p>feel free to point out mistakes - i didn't really fact-check any of this so it's possible i fucked up somewhere. enjoy!!!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>[1] Hobbitish, as I imagine it, is sort of like a street accent—Bilbo and Frodo were “gentle hobbits” and spoke very high Westron; their “lower class” neighbors (such as the Gamgees, for instance) speak with more slang and such.<br>[2] <i>Thanks, uncle.</i> Khuzdul taken from the Dwarrow Scholar dictionary.<br>[3] Thorin was probably way too young to actually make the shirt. Erebor fell when Thorin was like… nine years old, maturity-wise. But let’s just pretend that it fell a little while later or something, for the plot’s sake.</p>",
    "text": "\nOri\n\nBilbo relaxes at a table in the Prancing Pony and watches the tides of men as they make their way in and out of the door—besides him and the dwarves, there are only men in the bar, but none of them seem to be paying his group much attention, thank the Valar. The last thing any of them need to is gain the attention of someone unsavory, and though Bilbo’s never been to Bree before, he’s heard stories. \nThe dwarves had their own table, tucked in the corner of the room, but it had been hard enough to find one to sit thirteen, so after some pointed shuffling and looks Bilbo had gone off and found one just for himself. It had been oddly disappointing to be not-so-subtly nudged out of the way, but not really surprising; all the dwarves had made themselves clear on what they thought of their hired burglar, Thorin most of all. \nGandalf’s gone off somewhere, so Bilbo takes up a mead—made in the Shire, for no Man has ever made anything so sweet and heady. He’s starting to feel a little melancholy when he looks up to see Ori standing in front of his table, shifting from foot to foot and biting his lip.\n“What is it?” Bilbo asks, nonplussed by Ori’s squirming.\nOri’s one of the nicer dwarves—younger than Fíli and Kíli, Bilbo’s been told, but much less rowdy. But they haven’t spoken much—not, in fact, since the night at Bag End when Ori had found a book in Bilbo’s library of hobbit folklore. Ori had asked before they’d all retired for sleep if he could borrow it, eyes bright with curiosity and book clutched to his chest. Bilbo hadn’t had the heart to tell the dwarf that he doubted it would be returned—after all, they were all going to fight a dragon—but had allowed Ori to take it anyway. Bilbo had read the silly thing more than once; his father had been the one to write it down, for Bilbo to learn his letters when he was just a fauntling. He hadn’t looked at it in years—not since his father’s death.\nBilbo had seen Ori reading it on the way to Bree, but Ori never brought any further questions to him about hobbits, so Bilbo had decided not to ask. \n“Master Baggins,” Ori says, casting a furtive glance back at the table of dwarves. “I wanted to thank you for your gift.”\n“Oh!” Bilbo says, surprised. “It was no problem, Master Ori. It’s a small book and one I haven’t read for many years.”\nOri frowns at him. “But in the in scripting, it says—authored by Bungo Baggins. Isn’t that your da?”\n“Well, yes. He wrote it for me when I was a fauntling, y’see.”\nOri’s starting to blush. “I should not have asked to borrow it,” he says. “I will return it at once, I’m so sorry, Master Baggins—“\n“Have you finished it yet?” Ori’s hesitation is answer enough and Bilbo sighs. “Keep it, Master Ori. It’s doing a world more good informing a curious mind than sitting dusty on my bookshelf.”\nOri wrings his hand. “I will take care with it,” he says. “And see it safely returned to you when I am finished.”\nBilbo takes a long look at him; dusty from travel and earnest. He’s the youngest of them all and possibly the most foolhardy, considering his posturing at Bag End, and Bilbo feels a little sad for him. To be so young and to come on a trip such as this? At least Dwalin and Balin and the others have had a life—at least Fíli and Kíli are reclaiming a birthright! \n“You may keep it, Master Ori,” Bilbo says. He smiles, feeling a little mischievous. “Think of it as a gift for having the good sense to inquire first about where the dishes went instead of just tossing them about as soon as you were done.”\nOri’s mouth drops open and he stares so long at Bilbo that Bilbo begins to think he’s made some sort of mistake. Then, to Bilbo’s surprise, Ori begins to blush. \n“I am honored by your gift,” he says. Bilbo frowns at him, not sure why Ori seems so touched by something so simple, but then Ori’s pulling something from his loose cardigan. “I had thought to give this to you later, when we were not in everyone’s company, but—“ He shrugs and hands it over to Bilbo.\nIt is a book, similar to the one Bilbo let Ori have; small, but hardy, with a brown leather cover and a single golden rune (Khuzdul?) on it. Bilbo opens the first page and blinks when he realizes that the book is written in Westron: Tales of Dwarrow Mythology, a translation is written on its title page. The paper itself is as creamy and fine as anything in Bilbo’s stock of stationary, and the calligraphy is neat and beautiful. Bilbo looks from it to Ori, who regards his examination with an anxious look.\n“It’s lovely, Ori,” Bilbo says, putting as much warmth in his voice as possible, for it seems that Ori is nervous of his opinion.\nOri relaxes. “It—it is crafted of mine own hand,” he says. The words are oddly formal and stilted, as if they’re being recited, but Bilbo is too busy being astonished to notice over-much.\n“You wrote this!?” he exclaims, examining it again. The calligraphy is so lovely! He flips a few pages in and blinks when he sees colorful pictures, detailed and tiny in paragraphs of text. “But that’s amazing!”\nOri’s gone an endearingly deep shade of red. “I am glad you approve of this gift,” he mutters. \n“I will treasure it,” Bilbo says. “Thank you for your kindness, Master Ori.”\nOri frowns at him, redness slipping away. “But—are we not friends now, Bilbo?”\nBilbo frowns at him, confused. He would not have thought any of the dwarves—dwarrows, as they apparently called themselves—would want his friendship, not even Ori, kind as he is. Perhaps the gift meant more than Bilbo thought . . . .?\n“Well, yes,” he says and Ori relaxes again. “I must apologize—“\n“Hobbits are so polite,” Ori observes. “But between friends there is no need for manners, don’t you think?” He beams at Bilbo. “May I sit with you and drink, Bilbo?”\nHe sits before Bilbo can say a word and orders his own tankard. Bilbo thinks he should probably be indignant about having his privacy invaded by this odd dwarf, but, as he fingers the warm leather of his new book and listens to Ori chatter about the days ahead, all he can feel is warmth.\n\nBombur\n\nOri becomes a permanent fixture at Bilbo’s side as they ride out of Bree. They talk of folklore and once Bilbo encourages him, Ori expands on his own works—he dabbles in translation, but is a scribe by trade. Bilbo’s a little astonished, then a little ashamed at his own surprise—after all, even if none of the dwarrrows had ever seemed prone to book-learning, weren’t there plenty of hobbits who had never bothered to read a page in their lives? Ori laughs when he voices this thought, but admits that books are more of an oddity among the dwarves than any other race, as they prefer songs and spoken tales. \nThe others in the Company seem strangely discomforted by Ori and Bilbo’s new friendship. Fíli actually drops his knife when he hears Bilbo address Ori without a title for the first time! It’s odd for a group that seemed to lack manners to put so much stock in proper address, but perhaps it is different for Fíli, being the heir to the throne and all that. Bilbo thought so for about two hours before Dori gave him a menacing look when he called Ori over to have dinner together!\nBut Ori seems to have straightened everything out—everyone’s giving odd looks to Ori now, as if they’re not sure what part of his mind he had to lose to befriend Bilbo. It’s enough to make a fellow self-conscious, their carrying-about, and Bilbo says as much to Ori after dinner as he smokes a bit of pipeweed as Ori scribbles in the book he keeps on hand to document their adventure.\n“Oh, they’re just surprised,” Ori says as he draws something that Bilbo’s becoming increasingly suspicious might be his own profile. “It’s not proper to go without titles and such if you haven’t given a gift and since no one saw me give you one, they thought we were just being rude. I’ve told Dori and it’s all settled. I think they might be wondering what I did to get you to accept it, that’s all.”\n“Well, why wouldn’t I?” Bilbo asks, frowning now, and Ori gives him a little smile.\n“Well, we really don’t know that much about hobbits, so we weren’t quite sure how this sort of thing goes about.”\nBilbo’s pretty sure that he’s missing something, but Ori’s being called over by Nori now, so it’s too late to ask. Bother these dwarves and their strange customs! What on earth did gifts have to do with anything?\nThere’s a soft poke to his shoulder and Bilbo jumps, choking on the bit of smoke he’d already inhaled. Coughing, he turns to see Bombur watching him, round-eyed with concern.\n“Master Baggins?” he asks uncertainly. “Are you alright?”\n“You—startled me,” Bilbo coughs out. “Sorry, sorry, just—“ He manages to get his breathing to even and turns to face Bombur properly. It’s only then that he notices Bombur’s holding something that Bilbo had thought he wouldn’t see for ages. “Is that a cake?”\nBombur’s gone red. Bilbo feels a creeping sense of deja vu. \n“It is crafted by mine own hands,” Bombur mumbles as he shoves it toward Bilbo.\n“How on earth did you manage that?” Bilbo asks, honestly perplexed as he takes it. \nIt’s still warm, for Yavanna’s sake, and smells lovely. Tiny—barely bigger than his palm—but plump, it is almost Hobbitish. To think a dwarf baked it! From they way they treated Bilbo’s food, he knew they had an appreciation for it, but he’d never suspected any of them could bake like this! \n“Ah, well, I had a chance to grab the necessary ingredients in Bree,” Bombur says, speaking so fast that Bilbo can only catch the gist of what he’s saying. “And I’ve made them fireside before, y’know, on the road and what have you—can’t always have an oven, sadly—so it was just a wee matter of using the right tools and knowing when to take it out of the fire—“\nBilbo bites into it, groans, and Bombur falls silent. Bilbo takes another bite, smooshing too much in his mouth so that he probably looks like a deranged chipmunk, but he can’t care because it tastes so good—Nutty and sweet, the cake wasn’t like any Bilbo had tasted before—and as a Hobbit, he prided himself on the number of cakes he’d eaten in his life. \n“This is amazing,” he tells Bombur once he’s managed to chew and swallow. “If you ever have reason to settle in the Shire, any number of lasses or lads would court you for your cooking skills alone.”\nHe looks back when Bombur doesn’t say anything and smiles a little. Oh, dear. That’s a deep shade of red indeed.\n“I am glad you approve of this gift,” Bombur says. He’s stuttering a little but he sounds sincerely happy. \nBilbo pauses over the last bite of the cake. “Master Bombur,” he asks, suspicious now because he’d been distracted at the time but weren’t those the exact words that Ori said—?\nBut Bombur’s face falls and gets that trembly look Bilbo recognizes from faunts on the edge of tears.\n“Was it not satisfactory?” he asks, thick-voiced. “I’m so sorry, it’s just so difficult to make it the right taste on a cooking fire—“\n“No!” Bilbo yelps, so loud that several dwarrows nearby look over. “No,” he says again, softer. “It’s absolutely lovely Bombur, and I thank you for making it for me. Don’t even think otherwise.” To think that Bombur could doubt his own skill! Bilbo won’t allow that. “Will you teach me your tricks?” he asks, partly to see if it will cheer Bombur up and partly out of a selfish need to have as many of those cakes as possible. “I would love to be able to make cakes as you do!”\nBombur’s gone wide-eyed. “You wish to learn my craft?” he asks, so bemused that Bilbo thinks he might’ve stepped in it somehow. \n“If it’s alright,” he says, cautious now. “Only, I bake as well y’see, so I just—“\nBombur smiles. “Oh, you are a baker as well! Well, I would be honored to expand your learning,” he says. “Do you not write books as well? Hobbits must be skilled to learn so many crafts!” \nBilbo’s never going to understand dwarrows. And blast it all if Bombur doesn’t get him talking about different Hobbit recipes for so long that he completely forgets to ask why he’s getting these strange gifts and why everyone seems to think them an overture of friendship! \n\nBalin\n\nThe night that Balin tells them all the story of Thorin’s tortured and frankly astonishing past, Bilbo sits on a stump outside their camp and fiddles with his pipeweed. His favored pipe had broken nearly two days before in his pack—one of the stoutest he’d had, but stout for Hobbit lands was apparently not the same thing among dwarrows. He’d asked Bombur and Ori if they’d packed extra, but though they were always happy to share with him, they’d only brought one each. \nBilbo tries not to think about how many nights Thorin has gone without the comfort of a bit of pipeweed—how many nights Thorin and the dwarrows he’s traveling with have gone hungry or tired or friendless. He’s heartsick at the mere thought of Thorin having to see his father decapitated, to see his grandfather go gold-mad, to lose his homes to dragonfire . . . Well, the list goes on, doesn’t it? \nBilbo can’t really fault Thorin now, for being a grump. If he’d lived through half of what Thorin did, he’d be a grump too.\n“Mighty pensive look on ye, laddie.”\nBilbo smiles as Balin plops down to sit next to him—their stump would be a tight seat for a Man, but it fits a dwarf and a hobbit easily enough.\n“You told us a mighty tale,” Bilbo says. “I never realized I walked with legends, that’s all, Master Balin.”\n“Ach. Don’t let Thorin hear you call him that—hates being treated different, he does,” Balin says, though he’s smiling. “I only hoped to help you and the lads understand him a bit better, that’s all. Thorin’s their Uncle, but Fíli and Kíli don’t know much about the details of his past. Thorin’s always preferred it that way.”\nBilbo glances back to where Thorin sits, near the edge of the fire. He’d accepted first watch, and he has a familiar brooding look to his brow. At the feel of eyes on him, Thorin looks up and catches Bilbo’s gaze. Bilbo hurries to look away, flushing a little to be caught staring. \n“You all admire him so much,” he says to Balin. “I suppose I can see why you’ve all followed him on this mad venture now.”\n“And you, Master Baggins?” Balin asks. “Why did you follow us?”\nBilbo means to say something flippant—a comment about the stubbornness of dwarrows, perhaps—but finds that he can’t on this night, when Thorin allowed his whole sad history to be laid down for all of them. \n“He sang,” Bilbo says. “You all did, that night at Bag End, for this home that you all longed for.” He hesitates, then adds, a little shy, “I think anyone would have come running after him once they heard him sing.”\nBalin stares at him, as shocked as Bilbo’s ever seen him, then begins to laugh. Bilbo chances a glance over his shoulder and blinks with surprise when he realizes Thorin’s gaze is still fixed on him, rather intently. And—is that a blush? \n“You’re an odd sort, Master Baggins,” Balin says, drawing Bilbo’s attention away from the oddly appealing sight of a flushed Thorin Oakenshield. “But you’re honest and you’ve a willing heart. What more can we ask?” He smiles. “Ori told me you’ve broken your pipe.”\nBilbo frowns, caught off-guard by the sudden subject change. “Yes,” he says. “A few days ago. Not a problem, it’s just—well, I like to think with my pipe, y’see. Clears out the mind.”\nBalin chuckles. “Oh I know, laddie. Which is why I have every confidence you’ll use this well.” \nHe pulls something out of the folds of his cloak, but it’s dark enough that Bilbo can’t see it until it’s deposited in his hands—a sturdy pipe made of white stone, of all things, and easily one of the most beautiful pipes Bilbo’s ever seen. He runs a reverent hand over it—the tiny carvings of trees and flowers, little bees snoozing around the bowl! He’s never seen such detailed work: though some hobbits do carve their favored pipes, they tend to be crude. To do such detailed work in stone must be even harder. Bilbo can’t imagine the amount of work that must go into such a thing.\n“My word,” Bilbo breathes, thoroughly astonished.\n“It is crafted of mine own hand,” Balin says gently, eyes crinkling as he smiles. \n“It is beautiful, Balin,” Bilbo says. \nHe’s learned his lesson from Bombur and Ori—there is something about the gift that means he stops with formalities, but he feels awkward to ask now. \nBalin beams. “I am glad you approve of this gift,” he says warmly. “If you wouldn’t mind, I would love to try some of your Shire leaf, for I’ve not had any before.”\nBilbo straightens in indignation. “Never had any—! Why, how have you lived so long without any Old Toby?” He reaches over and grabs Balin’s pipe, stuffing it full of his hoarded leaf. “We can’t have that, Balin, it’s a disgrace! Have you—don’t tell me you’ve been smoking the Men’s weed, I wouldn’t wish that even on my worst enemy—!”\nBalin laughs and draws a full breath of smoke. His blissful expression at the first inhale of Old Toby is enough to satisfy Bilbo that dwarrows do not have terrible taste in all things and clearly some of them have very good taste indeed.\nHe chances a glance back at the fire, but Thorin has already turned away and gone back to whatever thoughts trouble him. Bilbo tries hard not to sigh as he prepares his own pipe. \n\nDori\n\nBilbo’s miserable and he’s tired and, most of all, he’s wet.\nHe wants to go home. He wants to be in his little dry hole where he can huddle under his warm thick quilt and listen to the thud of rain against his house and drink some nice hot tea. He bemoans, not for the first time, ever running out of his door—and, most importantly, running out of his door all willy-nilly, without even taking the time to pack properly first. \n“Shoulda feckin’ brought a gorram raincoat,” he mutters, slipping into Hobbitish[1]. \nHis father hadn’t approved of such speech, of course—Bagginses were gentlehobbits and Bilbo had been raised to speak proper Westron— but his mother had taught him a variety of curses in Hobbitish. Sometimes it was on accident, like when she had dropped a pan on her toes, but mostly on purpose. She’d been a strong believer in being able to curse fluently and creatively; she’d even taught him some of the filthier elvish, though Sindarin never could quite stoop itself low enough to curse to their satisfaction. \nThere’s a rumbling laugh behind him and Bilbo sits up quickly, his cheeks flushing. “I mean, uhm—“\n“Strong words from such a wee creature,” Dwalin says as his pony shoulders past Bilbo’s. “Perhaps you’re made of stronger stuff after all, Burglar.”\nBilbo gapes at his retreating back, but he can’t help but feel a little pleased—after all, besides Thorin, Dwalin was his biggest naysayer. Perhaps he should try out some of the more creative phrases his mother preferred when Dwalin happened to be nearby. \n“I could teach you a bit more than that if you like,” Nori adds slyly as his pony comes up to Bilbo’s. \nBilbo can never quite get a handle on Nori—or rather, most of the dwarrows make some sort of noise when they move, to the point where Bilbo can always hear them coming sooner rather than later; all except Nori.\n“Yavanna’s gorram tits,” he breathes and then slaps a hand over his mouth. That was a phrase his father had heartily disapproved of.\nNori’s laughing now. “Mahal, you are dirty-mouthed for such a fussy little creature! Do all Hobbits talk like you?”\n“Only the ones who want to get boxed ‘round their ears,” Bilbo mutters. “Or if, like me, they are in a particularly frustrating situation.”\n“Ah, yes, the lack of a cloak,” Nori says. “I would offer, but I’ve none to spare—most of us only brought what we’d need for ourselves, since it would be such a long road, y’see.” His teeth gleam as he grins. “If we were near a town I’d simply lift one off the shoulders of a Man, and you’d have enough cloth to cover yourself twice over, Master Baggins.”\nBilbo straightens in his seat, a little indignant. Twice over, indeed! \n“Hobbits are a perfectly respectable size!” he says and then undermines his own scolding when he sneezes, five in a row. \n“Poor hobbit,” Nori says. He looks over his shoulder and back again, and that grin is something Bilbo knows to fear. “Here—I’ll be a good dwarf and give you a hand, shall I?” Then, for reasons only known to himself, he raises his voice and says, “Oh you poor wee thing! You’re going to catch a cold, carrying on like that!”\nBilbo’s going to argue with him—Hobbits may be small, but they’re hardier than that!—when he sneezes again and this time it’s bordering on six or seven, all wet, booming, disgusting things. \n“I told y’all I needed a feckin’ handkerchief,” he mutters he tries to rub at his nose with the sleeve of his ruined shirt. Disgusting.\n“You’ll catch chill!” Nori says, ridiculous and melodramatic. Who on Earth is he putting this show on for? “Probably die on the road, frozen to your little toes!”\n“Excuse me—“ Bilbo starts. His toes are not little!\n“Nori, leave off the hobbit,” someone says from his other side, and Bilbo twists around to see Dori regarding him with a weather eye. “Master Baggins, are you feeling alright?”\nBilbo opens his mouth to answer, but Nori gets there first. “Our hobbit is very delicate, Dori,” he says. “This weather is going to make him quite ill! Look, he’s already halfway to his death!” \nHe gestures to Bilbo as if Bilbo’s on the edge of collapse and Bilbo would argue with him if he wasn’t sneezing again the Valar be damned—\n“Oh dear,” Dori says. He eyes Bilbo for a moment longer, then nods as if he’s come to some sort of decision. “Well. We can’t have that, can we?” \nHe rides on ahead without another word, but Nori winks at Bilbo as he follows his brother. Bilbo watches them go in complete and utter confusion. \nThey stop for rest somewhere along the road, but no one bothers to try and make a fire; the wood’s too wet now, after days of being thoroughly soaked, and Thorin’s paranoid about orc riders besides. Bilbo can’t blame him, not after that story Balin told, but he’s a little too grumpy to admit as much. Blast Thorin and his temper and arrogance and stubbornness—\n“Master Baggins?”\nBilbo jumps. He huddled down to sleep next to Gandalf, as he has since the start of their journey—although the others have become friendlier, they all tend to sleep in family groups still, and Bilbo’s hesitant to try and join in with any of them. Gandalf always sleeps on the outer ring of the Company, so Bilbo made a bed for himself nearby, outside the piles of dwarf bodies. \nDori stands in front of him, grumpy under the wide brim of his hood. All the dwarrows brought some sort of waterproofed cloak to wear, the lucky bastards, but none of them had one to spare for sopping hobbits who hadn’t even thought to bring a normal hood, let alone one to protect against rain. \n“Did you need something, Master Dori?” Bilbo asks. \nPoliteness is hard to hold on to when you’re so miserable. Dori sighs in the put-upon way he adopts sometimes when dealing with Nori. \n“You must not catch cold,” he says. “And I doubt it will help much, but here.” He holds out a wing of his cloak and offers a bundle of cloth. Bilbo can’t see much in the darkness, but it looks green. “A cloak for you. It is crafted of mine own hands,” Dori says, sounding aggravated.\nBilbo grabs for it, heaves it over his shoulders and burrows under the warmth. It is made of thick cloth, and though it dampens almost immediately under the light sprinkle, it is hardy enough to add some warmth and protection. At the very least, it keeps the rain out of his eyes and for that alone, Bilbo could’ve kissed Dori.\n“Thank you so much,” he says. “I finally do not have water in my eyes—Yavanna, it is a feckin’ miracle.”\nDori’s gone very still. “You like it, then?” he asks. “It is warm enough?” He sounds oddly insistent.\n“Of course!” Bilbo says. “I mean, I would’ve been happy with a scrap of blanket, but this is much warmer and thicker and also, as far as I can see, a lovely green so thank you very much, Master Dori.”\n“I am glad you approve of this gift,” Dori says and the grumpiness melts from him. “But you must promise not to catch cold, Bilbo, and it is only Dori—no need for titles among friends, no matter how odd hobbits are.”\nHe starts to stomp back to his brothers as Bilbo gapes at him, but turns midway and comes back.\n“And you must not sleep here,” Dori says crossly. “Come, come. The wizard obviously is no use at all, don’t know why His Majesty brought him along, but you’ll freeze to your death without anybody to huddle with, come on—“\nDori herds Bilbo and his bedroll to the little circle his brothers have made and plops him right in the middle. Ori is already asleep and barely shuffles as Bilbo is planted at his side, but Nori slits an eye open and grins.\n“Oh, he’s adopted another one, has he?” he says. “Well at least you’re pretty, Master Baggins.” \nBilbo gapes at him and Dori swats at his head. “None of that, brother,” he says. “Bilbo is here for warmth and I won’t have you leering at him as he sleeps.”\nBoth of Nori’s eyes open at that. “Bilbo, is it?” he asks. “Ah, the cloak, of course. Soon enough you’ll have an entire set, Master Baggins.” He winks for good measure and Bilbo sputters.\n“I beg your pardon—“\n“Go to sleep,” Dori orders Nori as he bunkers down on Bilbo’s other side. To his bemusement, he is boxed in by dwarrows. “You too, Bilbo,” Dori says and Bilbo sighs deeply before he closes his eyes. \nWell. It’s warmer, at least.\n\nKíli\n\nBilbo has a moment when he’s being used, in an ironic twist of fate, as a handkerchief by a troll, where he realizes that he’s come on this adventure with a bunch of utterly incompetent madcap idiots. It would be nice to say that he’d been proven wrong by them coming to his rescue, but considering his numpty companions fluffed it up so bad that Bilbo had to be the one to cobble together some sort of plan until Gandalf got to them—well. \nNow he knows why they invited him along—because they’re all complete morons. He should’ve realized the moment Thorin said he got lost in Hobbiton, the place with one road.\nHe fumes in front of the troll hoard and tries not to think about the way he smells or looks right now. He aches all down his back from being flung at a dwarf and his joints are tender from being pulled so hard by an angry troll. All he wants, more than anything, is a nice bath and a warm bed, but he they still have miles of traveling to do before they can camp and it’ll be the hard ground once more.\nBilbo’s determined to convince Thorin to go to Rivendell if only so that they can stop camping on the gorram ground for once. He doesn’t care if Thorin hates elves.\nA hand lands on his shoulder and he groans. \n“You okay, Master Baggins?” Kíli asks, leaning down to look him in the face. His nose wrinkles, but he must have more common sense than Mahal gave the common dwarf, for he says nothing about it. “You aren’t hurt, are you?”\nBilbo glowers at him. “Hoot once like a barn owl?” he asks acidly.\nKíli winces again. “Ah,” he says. “Well, that was a stupid rescue plan, I guess. But we came out of it all right!”\n“You came out of it all right!” Bilbo says. “You and your numpty brother! I came out of it covered in troll boogies and bruises from an impromptu game of hobbit-dwarf conkers!”\n“What’s—?”\n“Oh, never mind!” Bilbo snaps. “The point is, I’m never listening to you two ever again! Of all the brainless, foolhardy things to convince me to do—!”\nKíli’s grinning a little and Bilbo never thought there would be a dwarf he’d want to clobber more than Thorin. Perhaps it runs in the family?\n“You did it though, Master Baggins,” he says. “Went right in and got those ponies out, didn’t you?”\nBilbo frowns. “Well, yes,” he says, nonplussed. \n“Helped get us out of that tight spot too,” Kíli says. “Even if you did say we have parasites.”\n“Thank you for taking so long to catch on, by the way,” Bilbo says. “If you’d spent one more minute screaming about how you didn’t have them, the trolls might’ve caught on, thick as they are!”\n“You can thank Thorin for that,” Kíli says. “He caught on to what you were doing before the rest of us did. Gave me a right ol’ kick to shut me up.”\nBilbo’s eyebrows lift in surprise and he spares a glance at the dank hole that Thorin and Gandalf have disappeared into—he figured someone must’ve caught a clue, but to think it was Thorin Oakenshield! The Valar must have been feeling kind to Bilbo indeed to give that empty-headed fool a bit of cunning!\n“The point is,” Kíli says, “you’re an alright sort for a hobbit, Master Baggins. And you got us all out of a right old mess and you went along with me and Fee even though you didn’t want to. So.” He fishes around for a moment in his jacket and pulls out a small silver box engraved with the odd runes that Ori writes in—Khuzdul. He opens it and plucks something out, offering it to Bilbo. “It is crafted of mine own hands,” he says, smiling.\nBilbo takes it and gasps. Hobbits don’t wear much in the way of jewelry—wedding rings being the exception, or nice earrings if someone’s inclined—but even he can tell that the necklace is a work of art. The chain is delicately wrought and the dwarrows must be rubbing off on him, for Bilbo can tell that it is silver immediately. It is studded with tiny sapphires the size of Bilbo’s pinky nail, all, as he sees when he looks closer, engraved with tiny runes. The sapphire at the heart of the necklace has a tiny emblem of crossed axes under a crown with seven stars embedded in it. It is a beautiful thing that must have required a delicate touch—Bilbo couldn’t even conceive of hammy, rough-handed Kíli making something like this!\n“It—it is beautiful, Kíli,” he says.\nKíli blinks at him, then beams, the largest smile Bilbo’s ever seen him wear. He remembers, suddenly, that Kíli is considered young even by dwarf standards—barely older than Ori, who’s just out of his tweens himself. And though Bilbo can’t speak for Kíli’s parents, he does have a stern uncle who told him not a few weeks ago that he knew nothing of the world. \n“I’ve never seen its like,” Bilbo continues on warmly. “But surely it is too lovely to give to me?”\nKíli’s expression dims. “You think I can’t offer you what you deserve?” he asks, puzzled and, strangely enough, hurt. “You think I care so little for your friendship?”\n“What? Of course not!” Bilbo reaches out and takes Kíli’s hand. “You came back to save me from the trolls, didn’t you? It’s only—well, wouldn’t it be better to sell it for funds? For the journey?”\nKíli relaxes. “Oh. No, that necklace is not one I could sell—Uncle would murder me if I gave it to a Man or, Mahal forbid, an Elf!”\n“Because of the Khuzdul?” Bilbo guesses and Kíli grins at him.\n“You’re a right clever hobbit, Bilbo,” he says and slings an arm over Bilbo’s shoulder. His nose wrinkles. “Even if you do smell.”\nBilbo glares up at him. “And whose fault is that—?!”\n“Well, your own,” Kíli says, his voice pragmatic even as his eyes dance. “After all, if you had been a better burglar, you wouldn’t have been caught! You’ll need to practice before we get to the Mountain, I guess.”\n“If you continue to pester me, you won’t have to worry about me going to the mountain at all,” he says. His eye is drawn back to the necklace. “What do all these runes mean, anyhow?”\n“I—well, I don’t suppose I can tell you what it says, but it’s like a prayer. It’s what Mahal said to Durin to wake him from his long sleep.”\n“I don’t know that story,” Bilbo says, frowning. Everyone knows Aulë created the dwarrows, but anything beyond that has been kept very secret. \n“You don’t know about Durin!” Kíli says, aghast. “What do they teach you hobbits? Come on, we can go talk to Ori, it’s a ripping good story—!”\nThorin steps out of the hoard, cutting Kíli off. He’s covered in dust and there’s a furrow to his brow that means he’ll spend the night around the campfire brooding, but he’s holding a sword that gleams even through the dirt, so the foraging couldn’t have all been a waste. He casts a glance at Kíli, then catches sight of the necklace in Bilbo’s hands. For a moment, his expression tightens, but Bilbo can’t tell if it’s fury or surprise.\n“Pack up,” he says after a long moment. “We’re leaving.”\nHe sweeps past them. It isn’t until he’s halfway across the clearing that Bilbo lets out a long sigh and turns back to Kíli, who looks gobsmacked. \n“I don’t know what I’m going to do with this, but thank you,” Bilbo says. “Even if you are a empty-headed numpty who’s terrible at rescue plans.”\nKíli smiles at him, so wide and fond and terribly happy that Bilbo suddenly aches with affection for him. He’s so young, Bilbo thinks. \n“I am glad you approve of this gift,” Kíli says. He grabs at Bilbo’s elbow and pulls him away. “Now come on, we must speak to Ori immediately—!”\n\nÓin\n\nThey’ve not been in Rivendell for more than an hour before there’s a hard knock against Bilbo’s door. Bilbo opens it, bemused, and finds Óin on the other side, scowling and re-adjusting his ear trumpet.\n“Kíli says you’ve got bruises,” he says, blustering in through the door and stomping to Bilbo’s bed. He’s got a little sack under one arm. “Sit down and let me look at ye.”\nBilbo’s sitting before he realizes what he’s doing. “I’m fine,” he says automatically as Óin runs a critical gaze over him. “Nothing wrong with me at all.”\nÓin gives him a long look and then pokes him, hard, right in the middle of the purpling bruise over his ribs. Bilbo shouts and spasms in on himself, shooting Óin a look of utter betrayal. Óin just snorts and opens his sack.\n“Fine my well-toned behind,” he mutters. For Óin, a mutter is more like a mild shout, but Bilbo covers his laugh with a cough. “Take off your shirt, laddie.”\nBilbo blushes. “Is this really—“\n“Your. Shirt.”\nHe grumbles, but shucks off the nasty-smelling waistcoat and linen shirt underneath. No great loss to have those off, but he still feels exposed as Óin looks him over. Bilbo hasn’t often been naked with other people since he was a young lad, and even if Óin is older than dirt and a healer besides, it’s uncomfortable. He’s lost a stone since the start of the journey, but he’s still quite . . . round compared to the rest of the Company and before now, he’s done his best to not get naked in front of any of them and expose himself to ridicule.\nNot that he’d say no if some of the dwarrows got it in their head to take a look at him half-naked, but Bilbo’s doing his best not to think too much about that. Down that road lies madness and broken hearts and all that.\nÓin pulls out an odd little jar that unscrews on the top like a jam jar. Inside is a sweet-smelling paste that he smears some on his fingers. Óin moves to put it on Bilbo, but pauses just as his fingers are about to touch skin.\n“Ah, that’s right,” he says, though Bilbo has no idea who he might be speaking to. “This is crafted of mine own hands,” he tells Bilbo, and proceeds to rub it all over the bruise.\nBilbo squirms away from the touch—the paste is icy and then hot, as if he’s been plunged into freezing and then boiling water, but after a moment it does begin to soothe his muscles. Bilbo relaxes, bit by bit, as the ache he’s suffered from since the trolls begins to fade.\n“Any other pains, laddie?” Óin asks. Bilbo scrunches his nose and Óin rolls his eyes. “Just tell me, Bilbo,” he says. “Sooner said, sooner this is all done and you can go and get yourself a bath.”\n“I don’t smell that bad,” Bilbo says, cross.\n“Well, without your shirt it is a wee bit better,” Óin admits. “But you’ve still got troll gunk in your hair and my sense of smell got keener when my hearing went, y’know.”\n“Oh, all right,” Bilbo says. “The troll pulled my joints a bit when he was throwing me about—think he might have done something to my shoulder.”\nBilbo relaxes a little as Óin examines the joint and deems him fit enough, dabbing another paste on the bruise collecting there as insurance. It isn’t until Óin’s already left and he’s sinking into a much needed, much appreciated bath that he realizes that Óin gave him his own healing pastes and Bilbo didn’t even so much as say thank you. Spend enough time with dwarrows and you pick up their manners!\nAfter the bath, he thinks and sinks in to his chin with a happy sigh. \n\nNori\n\nRivendell is so lovely that Bilbo aches just at the thought of leaving it; even the draw of the Shire is lesser here, surrounded by the quiet and the beauty. He thinks he will ask Lord Elrond if they might have a place for a small hobbit sometime in the future—he wants to go back to Bag End, but he can’t say that Rivendell wouldn’t be a good place to live once he got older and frailer. A place to finish the book he’s half-thinking about writing once this is all done. His father always told him that all good adventures had to be written down.\nHe sits on a bench by the main gardens and smokes the pipe Balin gave him, content for the first time in weeks; so content that he fails to hear Nori approach until the dwarf plops down next to him. \n“You’re a hard fellow to find, Master Baggins,” Nori says.\nBilbo lets go a smoke ring. “If any of you knew anything about hobbits at all,” he says, too relaxed to be irritated, “you would’ve known this would be the first place to look for me.”\nNori smirks. “I do know something of hobbits,” he says. “I checked the kitchens first.”\nBilbo laughs. “What can I do for you, Master Nori?”\nNori, for the first time Bilbo’s known him, goes oddly tense. Nori, like Bofur, is one of the few dwarrows in the Company who seems content in their own skin—loose, easy, prone to jokes or innuendo or song. Bilbo’s never seen Nori look discomforted before.\n“I know it is not right,” Nori says. “I know it is not the proper way. But I thought to give you a gift anyway, Master Baggins, if you would accept it.” \n“Master Nori, what—“\nNori pulls something from his jacket and offers to Bilbo. He takes it, nonplussed, and raises his eyebrows when he sees the tiny pin in his hand. It is cleverly made and probably silver, but Bilbo has no doubt it was made by the elves—a bright green leaf would never probably occur to dwarrows. It has a clever pin on the back and Bilbo realizes it must be for a cloak. In fact, the leaf matches the color of the cloak Dori gave him almost exactly.\n“I wish I could say it is crafted of mine own hands,” Nori says, a bitter twist to his mouth. “But it was taken with them, so perhaps that can count.”\n“You stole this?” Bilbo says, aghast. “From who!?”\nNori gets a little sly, shifty look in his eyes. “You know Lord Elrond’s twin sons?”\n“Oh no,” Bilbo says, looking down at the little pilfered pin. “You’re going to get into so much trouble!”\n“I can take it back,” Nori says, brusquely enough, but his voice trembles just a little bit and he’s turning away from Bilbo now, as if unable to face him. “I know it’s not a real gift, not the kind you deserve, but—“\nWell. Enough is enough.\n“Nori,” Bilbo says and ignores the way Nori’s head snaps back around, eyes gone wide. “What is it with you dwarrows and all this gift business?”\nNori looks entirely flummoxed. “You mean you—you don’t know?”\nBilbo throws his hands up in the air, though he’s careful to keep hold of the pin. “Of course I don’t know! Hobbits don’t do any of this gift-giving foolishness; if we want to be friends with someone, we just ask them or spend time together or what have you!”\n“Oh,” Nori says, nonplussed. “Well, that’s awfully odd, isn’t it? How can you tell if they truly care for you if they don’t give their craft, Master Baggins?”\nBilbo pokes him in the chest. “It’s Bilbo,” he says. “And why shouldn’t they be my friend, even if they don’t give me a gift?”\nNori pauses, thinking it over. “You really don’t know,”  he says, wonderingly. “Why haven’t you said anything?”\n“Well, I didn’t want to be rude,” Bilbo says. “Seemed a bit disrespectful to ask questions when I was given such lovely things.”\nNori begins to laugh. “Everyone’s going to be beyond themselves when they find out,” he says, wheezing a little. “Balin’s already gifted you and he didn’t know! Oh, I can’t wait to see his face—!”\n“Nori,” Bilbo says, impatient now. “Explain it to me!”\n“Oh, oh, of course,” Nori says, settling a little bit more firmly on their bench. “Well, I suppose you could say craft has a special place for dwarrows. Mahal crafted the first dwarrows from rock, y’see, and then passed on that gift for craft to us, to make us the superior race.” Bilbo rolls his eyes, but Nori doesn’t notice. “So we take it seriously. The only other ceremony for dwarrows other than Coming-of-Age and marriage is when they choose the craft they will pursue through adulthood.”\nBilbo thinks on this for a moment. “Can it be anything?” he asks. “Bombur gave me a cake for his gift—so your craft can be baking?”\n“We believe that as long as it has been created from nothing or re-shapes something ordinary or dull or useless, then it can be called craft,” Nori says. “Bombur’s a bit unusual—most dwarrows do something with metal-smithing or jewelry, as you’ve seen with young Kíli. Ori’s a scribe, so he’s all about creating books. Balin does pipes, usually from stone—though I heard he made one from mithril for the last King. But the point is the art of creation—so I suppose by your view, it can be anything.”\nBilbo absorbs this. “So why do you need to give gifts upon friendship?”\n“It shows honor for your new bond,” Nori says. “What we craft is who we are—when Bombur gave you his cake and Balin a pipe or Dori his cloak—they’re giving you little pieces of themselves, to show that they trust you to hold it and that they believe you worthy of them.” He smiles. “And to show that you are precious to them as well. We consider it an insult if you give a craft to a loved one that is not well-made, as the quality of the gift is a reflection of how well you feel to the gifted.”\n“Oh my,” Bilbo says, a little overwhelmed. “To think, I just thought they were being nice!”\nNori laughs. “We give gifts to honor our close connections, Master Baggins,” he says. “To friends or family and to our Ones. They are a sign of our affection.”\nBilbo, though, is caught on Nori’s insistence on using his title, and remembers what brought this about to begin with.\n“Why don’t you think your gift counts to me, Nori?” he asks, as gently as he can.\nNori examines Bilbo’s face for a long moment—whatever he’s looking for, he must find, for he gives a long, resigned sigh.\n“Examine my hands, Master Baggins,” he says. He holds them out for review.\nBilbo takes them in, brow furrowed. What on Earth—? But then he sees it. If they hadn’t just talked about craft, perhaps Bilbo wouldn’t have made the connection, but the hands in front of him are different from the other dwarrows. Nori has long, elegant fingers, a length and width that Bilbo’s seen on elves but never on a dwarf. \n“Elf-hands,” Nori says quietly. “My hands are not made for creation, Master Baggins. I’ve tried almost all, but I can never quite get the hang of it. Not enough to declare a mastery, anyway.” He’s blushing now, as if ashamed, and that’s startling enough to make Bilbo reach out and take one of those hands in his. Nori blinks at him and smiles a little. “Dwarrows who cannot create are—“ He frowns and says a word in Khuzdul. “Unblessed, outcast; I suppose cursed would be the closest connotation in Westron, Master Baggins.” \n“Cursed!” Bilbo repeats, startled. \n“Aye, cursed. What good is a dwarf who is born without the gift Mahal gave us?” Nori sounds so bitter, as if he’s been told this so many times in his life. “What sets a dwarf apart when he cannot use the gift of his Maker?”\n“Oh, Nori—“\n“I wish you would not call me that,” Nori mutters. “It was a foolish idea, to give you that pin and it is not a true gift, not at all.”\nBilbo reaches out and, hesitant because he knows now how dwarrows are about their hair, touches one of the points of Nori’s braids. Nori’s head snaps up and Bilbo holds his gaze.\n“For Hobbits,” he says, “friendship happens when we feel true affection for each other. I like you, Nori, for you are sly and charming and you know a great deal of good drinking songs, which any Hobbit can appreciate. At the very least, you are brave or mad enough to come on this journey, and you obviously love your brothers. I do not care if your hands were not made for craft—Mahal must have known what he was doing, for he gave you a thief’s hands and you have done good work with them.”\nHe pins the little leaf to his shirt under Nori’s disbelieving eye. \n“I will take this gift and honor it as I have all the others,” he says. “For you gave it to me and that makes its precious.” He stops and considers for a moment. “Besides, what other hobbit can say he wears an elf-lord’s cloak pin?”\nNori chokes out a laugh. “You are a most surprising creature,” he says finally. He stares at the pin on Bilbo’s shirt. “You like it?” he asks, so shy that it might be Ori sitting in front of Bilbo instead. “For true?”\nBilbo wonders how long its been since Nori was able to give a gift to anyone—has he never do so? Or, even worse, did he try and get rejected by other dwarrows? \n“I love it,” he says. “Though how I’ll explain it to Lord Elrond, I dread to think.”\nNori laughs and, to Bilbo’s surprise, draws him into a hug. “I’ll protect you from the weed-eaters, Bilbo,” he says into Bilbo’s ear and Bilbo smiles, leaning into the shoulder offered to him.\n \n\nBofur\n\nBilbo doesn’t look at any of them as they march into the cave after the close call with the Stone Giants—he can’t bear to meet any of their eyes, even the ones who have already proved their friendships in gifts. He’s never felt small before on this adventure; out of his depth, yes, and sometimes a little useless, perhaps—but this is the first time that Thorin has ever made him feel utterly worthless.\nIt’s the only time Thorin has ever told him to go home; even when Thorin was grumbling and grumpy and glaring at him, he never told Bilbo to go home before. He curls up in the cloak Dori gifted him on the edge of the group and continues to ignore them all. He feels eyes on him, but the Company respects his mood and leaves him be.\nFor the most part. \nBilbo’s half-asleep when he feels the gentle press of a hand on his shoulder. \n“You awake?” Bofur asks, squatting down to sit beside him.\n“Would it matter if I wasn’t?” Bilbo asks, cross and not trying to hide it.\nBofur smiles at him and draws out his pipe. Bilbo can tell now that it is one of Balin’s and wonders if it was given as a gift. He can usually tell if one of the dwarrows have given gifts, for they drop the titles almost immediately, but he’s never noticed that between Bofur and Balin—perhaps Bofur bought one from him instead? \n“If you’ve come over here to talk to me about Thorin—“ Bilbo starts.\n“D’you know that my brother and I have never seen Erebor?” Bofur says.\nBilbo frowns. “I thought you all were born there!” he says. “You mean you and Bombur weren’t?”\n“Aye,” Bofur says. “Bifur was just a wee dwarfling when the dragon came—he can’t remember the mountain at all.”\nBilbo stares at him, astonished. “And yet you came on this madcap trip?”\nBofur smiles. “When you say it like that, it sound stupid,” he says. He takes a long drag of his pipe and flutters out a smoke ring. In the darkness, it is pale, ashy, eerie. “Bifur was with Master Thorin at Azanulbizar,” he says. “The battle where King Thrain was lost. That’s where his,” he makes a little motion toward his head, “happened. And we would have had a dead body instead of a cousin if Master Thorin had not insisted he have the best healers—Bifur was wounded protecting the Prince, y’see, even if he didn’t succeed.”\n“The Prince?” Bilbo says, confused. \n“Master Thorin’s younger brother,” Bofur says. “Frerin. He died in that battle as well.”\nBugger. Every time Bilbo thinks he can hate Thorin with impunity someone has to come and remind him that Bilbo’s never met anyone with a more tragic past. Damn the dwarf.\n“Bifur and Bombur—well, they’re all I have left,” Bofur says. “So when Master Thorin saved Bifur, I promised him our family’s allegiance.” He blows out another smoke ring. “Aye, we’ll follow him to that mountain—and to any other mountain he sets his sights on.”\n“He wishes me to go,” Bilbo says. “Didn’t you hear him? And what’s even worse is that—is that he’s right. What have I done for you all besides keep you from getting killed by the trolls? And even that wouldn’t have happened if it weren’t for my damnable clumsiness—“\n“Master Thorin has a problem,” Bofur says. “He has never had a good rapport with outsiders and he doesn’t like strangers.”\n“I’ve been traveling with you for weeks,” Bilbo says, indignant. “And yet he still considers me a stranger!”\n“You’re not a dwarf, Master Baggins,” Bofur says, raising his eyebrows.\n“Yes, well!” Bilbo blusters. “I’m so sorry that I couldn’t be born to the ‘superior race’ but I don’t see what I can do about it! And I’ll have you know that Hobbits were given to this world by Aulë’s wife, so I’m the closest non-dwarf dwarf you fellows are ever going to get! And frankly, considering how ridiculous and temperamental and stubborn you lot are, all I can say is I’m thankful that I was born a sensible hobbit instead!” \nBofur stares at him—hell, half of the dwarrows are staring at him now, for his voice had climbed considerably as he spoke. Bilbo flushes to the tips of his ears, but glares back at them. Some of them, like Thorin and Dwalin, turn away without expression, but Balin winks at him and Ori and Nori grin. \n“Ach, calm down,” Bofur says. “You’re such an excitable little thing, aren’t you?” He reaches out and presses a hand to Bilbo’s shoulder. “I just wanted you to get a better sense of him, that’s all. He’s an honorable dwarf and he’s had much to give him cause to doubt others. He doesn’t mean what he says to you—and even if he does, well, isn’t it better to stay and prove him wrong?”\n“He’s had a hard time,” Bilbo says, fierce still, “but that doesn’t mean I’m going to sit around and excuse the way he treats me. I’m not his enemy and I’ve come on this godforsaken quest to get his gorram homeland back. I don’t want gratitude, but I could do with tolerance at the very least!”\nBofur grins. “I expect that if he doesn’t find his manners soon, you’ll bully some into him.” He reaches into his jacket with his free hand and offers something to Bilbo. “Here. I would’ve given it to you sooner, but—well, let’s say Thorin isn’t the only who’s slow to trust around here, aye?”\nBilbo takes it and stares down at the tiny ruby dragon. It is curled up like a sleeping cat, its eyes shut, and it is half the size of Bilbo’s palm, but every scale is intricately engraved. He’s never seen anything like it.\n“Oh,” Bilbo says. “Oh my.”\n“You’re not going to faint again, are you?” Bofur asks. He’s grinning, but Bilbo notices that he has a tight grip on his pipe. “It is crafted from mine own hands, Master Baggins.”\n“Call me Bilbo,” Bilbo says. “And I find that I no longer have the desire to faint at the thought of dragons.”\nBofur takes a long drag off his pipe. “Well, that’s a relief, I have to say. Would’ve been a right pickle for us if you got all the way into Erebor and fainted at the crucial moment.”\nBilbo takes one last look at the tiny carving before he tucks it carefully away in his jacket. “I’ll stay,” he says, because he knows that’s what Bofur really wants to ask him. “But I won’t take Master Thorin’s disdain for much longer.”\nBofur’s grin is wide and warm. “Oh, I never thought you would, laddie.”\n\nDwalin\n\nThey all dread the long walk down the Carrock, so they set up camp on the top of the mountain for the night. Bilbo finds himself enfolded amongst the ‘Ri brothers. They had all been pale when Bilbo found them and Dori had grabbed him and pulled him into a tight hug. Bilbo had been surprised when Nori had taken him immediately afterward and knocked their foreheads together as he had seen Balin and Dwalin do, though much more gently. \n“Don’t do that again,” Nori had said. “You are the only one outside my family to accept my gift, Bilbo—you’re not allowed to die, d’you understand?”\nBilbo probably shouldn’t have felt so warm at that; he had made people who cared about him quite worried indeed, and that wasn’t a thing to feel glad over. But he did appreciate Nori’s worry, for he knew that it spoke of his affection—and Bilbo found that he had been without it so long that he was cherishing it even more upon its reappearance in his life. \nAll his other friends had come to check on him personally as well—Kíli came to run a hand over him and give a hard bop to the forehead, Balin with a personal thanks and a shoulder squeeze, Bombur and Bofur with tight hugs . . . . Between their obvious relief at his wellbeing and Thorin’s acknowledgement, the memory of being told to go home on that cliff was very nearly gone. Despite their close call, Bilbo feels more content than he has in days.\nHe’s nearly asleep when there’s movement outside their little circle—he looks up to see Dwalin, of all people, standing over him. When he sees Bilbo looking, he indicates with his head that Bilbo should follow him. Tired, but curious, Bilbo carefully extracts himself from his little circle and follows Dwalin to the edge of camp. They stand for a moment and watch the fire.\n“Did you need something?” Bilbo asks, concerned now.\nHe and Dwalin have never much spoken together—indeed, Dwalin doesn’t speak to many outside his brother and Thorin. But Bilbo can’t deny there’s something comforting about Dwalin; it’s hard to feel unsafe when there’s a dwarf nearby who’s nearly a head taller than you and twice as wide wielding two wicked-looking axes. \n“You saved my king today,” Dwalin says, voice a low rumble. “When I was too slow to make it to him in time.”\nUnbelievably, Bilbo’s ears warm. “Ah. Well. Any of you would’ve done the same.”\nDwalin shakes his head. “Aye, we would’ve. But you’re the only one who could. And you have no obligation to him or to us, especially after what he said to you in the mountains.”\nThis is more than Bilbo’s ever heard Dwalin say before. “Well, I couldn’t just let him die, could I?”\nDwalin gives him a long look. “I’ve misjudged you very badly, Master Baggins,” he says. He takes something off his belt and holds it out to Bilbo. “It is crafted with mine own hands.”\nBilbo’s so surprised to get a gift from Dwalin that he fumbles for a moment with it before he can get a good look. It’s a small axe—next to Dwalin’s, it looks like it’s made for a child, but it’s much heavier than it looks. The edge is inscribed with runes and the guard is of some sort of black wood that gleams, even in the dim firelight. It has a ruby set in the end the size of Bilbo’s thumbnail.\n“I don’t know how to use this,” Bilbo tells Dwalin. He hefts it up and grimaces. “I don’t know if I can use this.”\nDwalin grins. It makes his face much less grim. “I’ll teach you, laddie,” he says. “After all, if you’re going to be fool enough to charge orcs and face down the Berserker, you’d best have more weapons on you than that little kitchen knife.”\nBilbo puffs up. “I stabbed an orc with that knife!” he protests. \n“Aye, you did,” Dwalin says. “But let’s not pretend that wasn’t pure luck and surprise, Bilbo.”\nBilbo blinks, caught off-guard. “You don’t have to do this out of some sort of—obligation,” he says.\nDwalin frowns. “Obligation?” he asks, and he sounds angry, for some reason. “You think I would give away my craft for something so petty?”\n“Well, how do I know?” Bilbo asks, cross now. “You’re the one who was talking about how I saved Thorin right before you gave me an axe!” \nDwalin’s beard twitches, but Bilbo can’t see what’s so funny. “Thorin?” he asks. \nBilbo ignores the stupid question. “I just don’t want this to be some sort of odd thank you!” he says. “I didn’t save him to get any sort of prize or reward!”\n“I am glad to hear it, Master Baggins.”\nBilbo squeaks and turns on his heel to find Thorin staring down at him from the fire, though Bilbo could have sworn everyone else was already asleep, Thorin included. Bilbo frowns and takes Thorin in—ragged around the edges, bags under his eyes, pale as a new moon and trembling like a scared fauntling.\n“You’re supposed to be asleep,” he says crossly. “You just got gnawed on by a warg, or did you forget?”\nThorin scowls. “I am perfectly well,” he says.\n“Listen to the hobbit,” Dwalin says, unexpectedly backing Bilbo up. “I’ll keep watch until morning.”\nBilbo rounds on him. “You are going to sleep as well!” he says, giving Dwalin the threatening finger that had subdued many a small relative back home. “You haven’t slept in days!” \n“Just two,” Dwalin says, unaffected by the finger. Blasted dwarf. “I’ve had worse.”\nBilbo resists the urge to stomp his foot. “You’ll both sleep,” he says. “I’ll keep watch. After all, I am now properly equipped, thanks to you.” He raises the axe meaningfully. \n“Dwalin’s gifted you?” Thorin asks, and he sounds so incredulous that Bilbo rounds on him with ferocity. \n“Yes, he has!” he says. “And it’s a lovely gift too! Why, look at those engravings! Look at the sharpness of that edge! Look at the size and cut of that ruby! I could not ask for a better gift or a more thoughtful one, considering I doubt this is the last time we’ll be facing orcs, nor the last time I will have to save your royal behind!” \nThorin’s eyebrows are almost to his hairline, jaw soft with surprise. It’s the most flummoxed Bilbo’s ever seen him, so he turns back to Dwalin with satisfaction. Dwalin, though, is staring at him too—and there’s a flush climbing steadily from his cheeks to the bald dome of his head. Bilbo stifles a smile and tries to look stern.\n“You go to your bedroll and sleep,” he says. “I’ll keep watch and then—why, and then I’ll see if Fíli or Kíli will sit after. They’re both young enough to bounce back from this sort of thing.”\nDwalin’s blush doesn’t really fade. Bilbo’s not even sure Dwalin heard him.\n“You really do like it?” he asks, a most un-Dwalin-ish question. \n“Of course I do,” Bilbo says. “Although I really don’t know how to use it, so I doubt I’ll give it the kind of care it deserves.”\nDwalin looks over Bilbo’s shoulder and whatever he sees there makes him smirk. “I’ll teach you, as I said,” he says and presses in close to give Bilbo the gentlest forehead touch he’s had yet. “And you do have my thanks,” he says when they’re sharing space. “Whether you want it or not.”\nHe leaves before Bilbo can say anything and Bilbo shakes his head. Dwarrows are confoundedly confusing sometimes.\n“You are becoming something of a collector, Master Baggins,” Thorin says. “Is that half the company now, or more?”\n“More,” Bilbo says. “Not that it’s any of your business who I befriend.” He looks at Thorin and sighs. “You really should rest,” he says, going over to him. “You nearly died not a few hours ago.”\n“I am not so easy to kill, Master Baggins.”\n“You would’ve been killed, if not for me,” Bilbo says. “So I’d say you most certainly can die easier than you think.”\nThorin glares at him. “I am not so weak, to be ordered to bed like a child,” he says.\nBilbo leans up into him, going on his tiptoes so that he and Thorin share breathing space. Thorin’s eyes go wide—Bilbo wonders if anyone’s had the guts to get in his face like this before. Perhaps not. Perhaps Bilbo would not have the guts if he were not so tired and fed up.\n“I saved your life,” he says. “If you dare waste it, if you dare squander it, I will be most unhappy, Master Oakenshield.”\nThorin doesn’t speak for a long moment, holding Bilbo’s gaze. Then he gives a short nod and Bilbo moves away. He’s a little embarrassed at invading Thorin’s space like that, but pleased that it at least got him some results. He had hoped that dwarfish honor would keep Thorin in line. He doesn’t want to ever see Thorin on the ground again, bleeding and hurt.\n“Go sleep,” he says. “I’ll wake you if there’s trouble.”\nThorin’s still staring at him like he’s never seen Bilbo before. “I must apologize again, Master Baggins,” he says as he finally turns away. “I have never misjudged a person so tremendously before in my life.”\nBilbo smiles at his retreating back. If the rest of their journey is like this, he finds that he does not mind the danger so much.\n\nFíli\n\nBilbo wakes up warm and content for the first time in what feels like an age. It’s still dark inside Beorn’s and he can hear Bombur and Dwalin snoring, but his bladder is pressing him, so Bilbo gets up instead of drifting back off again to use one of the discrete chamber pots. He’s so sleepy that he doesn’t notice the figure by the fire until he’s nearly back to his bedding. He hesitates, torn, but sighs when he sees that the figure is Fíli and that the set of his face by firelight is long indeed. \nDamn these dwarrows.\nHe grabs his blanket and throws it over his shoulders like a fauntling playing dress up before he waddles over and sits down at Fíli’s side. Fíli jumps when Bilbo appears, but he smiles a little.\n“I didn’t think anyone else was awake, Master Baggins,” he says. “Isn’t it past bedtime for little hobbits?”\nBilbo scowls at him. “I am your elder, you know,” he says. “Even if I’ll never be taller or—well, more muscular than you.”\nFíli’s grin widens. “Aye, that’s true.” He pokes the area Bilbo’s belly would be if his body wasn’t swaddled by cloth. “You do run a little softer, Master Baggins.” \n“I won’t take cheek from you, Master Fíli,” Bilbo says severely, swatting away the offending finger. “Now—tell me why you are not taking full advantage of being relatively dry and safe to sleep peacefully instead of brooding by the fire?” He makes a face. “Don’t tell me you’re trying to be like your uncle. Didn’t anyone tell you that that much brooding isn’t good for the body?”\nFíli laughs. “I promise I’m not trying to copy Uncle Thorin,” he says. “I don’t think I could ever reach his level anyway.” Fíli sobers a little. “He’s got a lot more to brood about, after all.”\nBilbo sighs, exasperated. “I know we are not friends,” he says and Fíli’s eyebrows rise. “But I would hear of your troubles, Master Fíli, for I don’t like to see you worried or sad—youngsters, in my opinion, should never feel those emotions unless absolutely necessary.”\nFíli bites his lip and looks back into the fire. They sit in silence for a long moment before Fíli sighs and looks back at Bilbo.\n“Kíli and I—our father died a long time ago,” he says. “Just after Kíli was born, in fact. I barely remember him and Kíli doesn’t at all. Ever since we were little . . . Thorin was our father, d’you see?”\nOh.\n“And you nearly lost him,” Bilbo says softly. \nFíli shivers. “What if we can’t get the mountain back?” he says. “What if—what if Kíli or Uncle get hurt? Azog, he was—he was so intent on getting to Uncle, Master Baggins. He’s killed our grandfather, Uncle Frerin—“\nBilbo reaches out and grasps Fíli’s forearm. He’s sure to a dwarf, his hold can’t be more than a child clinging, but he grips as tight as he can anyway. Fíli turns to meet his gaze, wide-eyed with surprise. \n“It’s alright to be afraid, Master Fíli,” he says. Fíli grimaces, but Bilbo presses on. “Yavanna knows I’ve been afraid more than once on this little trip of ours.” He hesitates. “But what I’ve come to understand is that you must work past it, if you’re to get anything done at all. I would imagine that goes doubly for reclaiming a homeland, which seems to require quite a bit of courage. Thorin is—well, he’s lived through much worse than this. And you’re there to keep Kíli out of trouble, aren’t you?”\nFíli stares down at Bilbo for a long moment, his face so blank that Bilbo begins to worry he’s said something wrong. Then, to Bilbo’s surprise, Fíli reaches out to draw him into a tight, warm hug. He hugs a little like his Uncle—fierce, comforting, all-encompassing. Bilbo relaxes into his hold and smiles against his shoulder. \n“I don’t want to lose either of them,” Fíli says against Bilbo’s hair. “Or you or anyone in the Company. Some days I want to tell Thorin we should just go back to Ered Luin and hope for the best, that Erebor isn’t worth it.”\n“There’s little people won’t risk for their home,” Bilbo says. “And I don’t think Thorin will ever turn back, especially not now that we’re so close. So you’ll just have to keep a weather eye, Master Fíli, and pray to Mahal that things turn out in our favor.”\nFíli draws back. “And thank Mahal for giving us a hobbit,” he says. “For Thorin would already be dead already if not for you.”\n“Not you too,” Bilbo mutters. Fíli laughs. “I jumped in without thinking. It’s not like it was some sort of heroic deed. I would’ve done it for any of you, not just Thorin—“\n“Oh, aye, Master Baggins, of that I have no doubt. Which is why I think it’s time I give you something that I’ve been meaning to pass on for some time.”\nFíli reaches into his tunic and draws out a small metal case. Bilbo tenses because he’s seen a case like that before—indeed, it might as well mirror the one Kíli flashed when he was presenting Bilbo with a—\n“It is crafted from mine own hands,” Fíli says as he offers his gift to Bilbo with a smile. \nBilbo takes it from him and turns it over in his fingers. It is a bead like the ones that he’s seen the dwarrows in the Company wear in their hair, though no one in the Shire has ever worn such jewelry in theirs. It is a small one, barely as wide as Bilbo’s pinky finger and made of gold, of all things. Embossed into the metal is that crossed axes emblem again, the one Ori had told him was the symbol of Durin. \n“It goes in your hair,” Fíli says. “Yours is finally long enough for a braid, I think.”\n“I’ve never braided my hair before,” Bilbo says, baffled. “I’ve never braided anyone’s hair before.”\nFíli goes very still. “I would be honored,” he says, low and serious, “to braid your hair, if you would allow me to touch it, Bilbo.”\nDwarrows are a tight-mouthed bunch, but Bilbo would have had to be blind and dumb not to notice the devotion and care they took with their hair and braids. He has a feeling braiding someone else’s hair is an intimate act for dwarrows—perhaps even as intimate as combing someone else’s foot-hair is to hobbits. He hesitates, watches Fíli’s face grow dim with sad understanding, and then sighs.\n“Just don’t muck it up,” he says and turns with his back to Fíli for easier reach. “I don’t need to look sillier than I already am, with half my buttons missing and my second-best jacket nearly shredded to bits.”\nFíli doesn’t say anything, and when Bilbo looks over his shoulder, Fíli’s just staring at him, wide-eyed. \n“Well?” Bilbo says. “Are you going to do it or not?”\nFíli stares a little more, then grins. “Yes, Bilbo,” he says. \nHis hands are surprisingly gentle as he takes up strands of Bilbo’s hair—there’s something a little disorienting about the feeling of them there, but it becomes quite soothing after a time. Bilbo’s half-asleep when Fíli finishes and prods at him to hand over the bead. \n“Done,” he says.\nBilbo reaches up to touch his hair cautiously, then more thoroughly once he realizes that the braid won’t come undone at the slightest touch. Fíli’s left some of his hair loose, only braiding half of his hair starting from the crown downward. It is a tight weave and feels oddly smooth to Bilbo’s fingers. He turns to face Fíli and blinks with surprise at the honest satisfaction in Fíli’s face. \n“You should wear braids from now on,” Fíli says.\n“Oh?”\n“We put braids in for battles or marriages or children,” Fíli says. “For deaths, sometimes. Important events. You deserve a battle-braid by now. You faced down Azog the Defiler, after all.”\nBilbo reaches out and carefully takes Fíli’s hand. “When the time comes to face him again,” he says and Fíli’s eyes darken, “I will be between him and Thorin, just as I was before. And between him and Kíli. Or you.”\nFíli takes Bilbo’s nape in his free hand and gives him a gentle forehead tap. “We did not know the gift Gandalf gave us when he led us to your home,” he says. “Akhmân, irak'adad.”[2]\n“Fíli?”\nFíli pulls away so fast that Bilbo jumps a little. They both turn to see Thorin watching them, a strange look in his eyes that Bilbo can’t quite read in the half-dark. Thorin takes a step forward, brow furrowing.\n“What are you—“ \nHe stops dead, his gaze fixed on Bilbo’s hair. Bilbo raises a hand to touch it and realizes that Thorin must have just seen Fíli’s braid. He raises his chin and challenges Thorin to say anything about it—Thorin’s show remarkable resistance to the idea of Bilbo learning anything about dwarf culture, and doubtless sees the braid as some sort of affront or insult. \nThorin turns on Fíli and says something in rapid Khuzdul. Whatever it is must be quite bad, for Fíli pales and trips over his words trying to get out a response. Thorin’s gaze darkens even further, so Fíli must have (like always) managed to put his foot in it.\n“Why have you allowed Fíli to give you a braid?” Thorin demands of Bilbo. \nBilbo looks from Fíli to Thorin in utter confusion. “He gave me a bead,” he says, and something about that must be terribly wrong, for if Thorin looked wrathful before, he looks ten times worse now. Fíli looks like he might actually be uttering his final prayers to Mahal, so Bilbo decides it’s high time to do something. “As a gift of friendship.”\nDead silence. The storm clouds in Thorin’s expression lesson by a bit. \n“Is this true, nephew?”\nFíli’s nod is so rapid that his head might spin off. “He—I’ve meant to give it to him since Kíli gifted him, uncle, but there never seemed to be the right time or—“\n“And the braid?”\n“I don’t know how to braid,” Bilbo says. Thorin’s eyebrows shoot up in surprise. Honestly. Do dwarrows think everyone braids their hair? “The bead is meant to be put in your hair, so I asked Fíli to do it for me, since I’d probably just muck it up.”\nThorin regards them both with suspicion. “And it was a gesture of friendship?” he asks, more to Fíli than to Bilbo. “And nothing else?”\nBilbo realizes, with a dawning embarrassment, that Thorin thinks Fíli might have had romantic intentions toward him. \n“Absolutely nothing else!” Bilbo says before Fíli can answer. “By the Valar, Thorin—“ Something shifts in Thorin’s expression, but Bilbo’s too distracted by his outrage to put much note into it. “He’s barely out of childhood!”\n“Oi!” Fíli says, outraged himself now. “You’d be quite lucky to have my braid in your hair, Bilbo!” \n“We both know that you come with your brother attached,” Bilbo shoots back. “That’s far too much work for one hobbit to handle!”\nFíli makes an extremely lewd gesture, coupled with a filthy smirk. “Well, if you want to handle—“\n“Fíli!” Thorin barks and Fíli goes pale again. It’s quite satisfying. “You have no interest in Fíli?” Thorin asks Bilbo, his voice oddly intent. \n“Of course not,” Bilbo says, irritated. “What a ridiculous question.”\nThorin’s nostrils flare. “Not so ridiculous,” he says. “Many races find dwarrows desirable, Master Baggins.”\nBilbo can quite imagine, for he’s found several in the Company desirable—including the one currently glowering at him. But Thorin’s distaste is quite clear; look at how he reacted when he thought Fíli was interested in Bilbo! No, Thorin would not be happy to hear of the daydreams Bilbo sometimes entertains on their longer days of travel.\n“You’re all a bit too tall for my taste,” Bilbo lies through his teeth. “And no respectable hobbit has quite so much hair on their face, or such small feet.”\nNow both dwarrows are looking at him in outrage. They do remarkably similar when they make that expression—all gaped mouth and raised brows. \n“Small feet—!” Fíli says.\n“Too tall—!” Thorin snarls.\nBilbo gathers up his blankets. This conversation has gotten quite silly enough for his tastes.\n“Thank you for the gift and the help, but I find I must go to bed right this instant,” he says and, with as much dignity as he can muster, hurries off to his bedroll and leaves the two dwarrows behind to stew.\n\nGlóin\n\nIf they stay any longer at Beorn’s, Bilbo might actually get used to a warm place to sleep and having enough food to eat. It’s been far too long since he’s gone to bed every night with a comfortably full belly. \nHe sits out in Beorn’s yard as the sun falls and smokes his pipe. Beorn, though he doesn’t look it, has an extraordinarily green thumb—though his garden is wild and rougher than any Bilbo might see in the Shire, it bursts with fruits and wildflowers. Bilbo exhales a perfect smoke ring and smiles as it drifts off into the night air. Much like Rivendell, this little house is full of peace; he wonders if Beorn would mind a visitor for a week or two on the trip back.\nThough as the days pass and he gets more and more fond of his companions, he finds it harder to imagine going back. \n“You probably should head inside, Master Baggins.” Bilbo looks over his shoulder to find Glóin standing nearby, a pipe in his hand. “It’ll be dark soon and you know how Beorn is about being outside once night falls.”\nBilbo sighs. “I was going to go inside once I finished this bit of leaf,” he says. “Would you like to sit with me, Master Glóin?”\nGlóin hesitates, looking between the doors and Bilbo. Then he sighs and shoulders his way onto the small bench Bilbo’s been sitting on. \n“You come and sit out here for hours, Master Baggins,” Glóin says as he takes a puff from his own pipe. “I cannae see the appeal myself, I must say.”\nBilbo laughs. “I miss my garden,” he admits. “It’s tradition for hobbits to start a garden together when they marry, y’see, and my parents were careful with theirs.” He sighs, takes a puff of the pipe. “I’ve kept it up since they died, as a way to remember them. Hopefully Master Gamgee down the road doesn’t let it die while I’m away.”\nHe can’t quite stomach the thought of his father’s tomatoes or his mother’s lilies dying. For many years, the garden was all he had—no relatives he was especially close to once his parents died, no boon companions, no partner . . . . Bilbo hadn’t realized until he came on this trip how lonely he had been, shut away in his house by himself.\n“I am sorry for your loss, Master Baggins,” Glóin says. “’Tis a hard thing, to lose your parents.”\n“They passed away some time ago,” Bilbo says. “My mother first, from a cough she got during the Fell Winter. My da loved her so much—he followed not a year after, and though the doctors say it was some sort of illness in the lungs, I always thought it was a broken heart.” Bilbo smiles, a little sadly. “He couldn’t bear to live without her, you see.”\nGlóin’s silent for a long time. “I don’t like to imagine what the world would be without my wife,” he says finally. “Or my wee Gimli.”\n“Your son, isn’t that right?” Bilbo asks, brightening a little. None of the dwarrows have been forthcoming about their families. “How old is he?”\n“Ach, just 68,” Glóin says. He reaches to his neck and pulls out a locket, opening it to show two drawings within—a dwarrowdam with a fine beard and a young dwarf with the looks of Glóin around the eyes. “He was raring to come with us, but Thorin said he was too young. I’m glad, considering the hardships we’ve faced so far—and we’ve not even come to the dragon yet!”\n“I do worry about the younger ones,” Bilbo admits. “But they’ve all held up remarkably well.”\n“Kíli most of all,” Glóin admits. “Ori’s got a good head on his shoulders, whatever his posturing, but Kíli’s always been a wild little fellow—I’ve been impressed with him, these past few weeks. Fíli too.”\n“They’re good lads,” Bilbo says and the look Glóin gives him makes him blush, for his warmth toward them must have surely shown. “A credit to Thorin, I’m sure.”\nGlóin’s eyebrows shoot up, though Bilbo doesn’t know what about that’s surprising. Surely all the dwarrows must think so as well?\n“Aye, they are,” Glóin says, after a long pause. Bilbo frowns at him, but Glóin just takes another puff of his pipe. “Do you think often of returning home, Master Baggins?”\nBilbo gives the question the consideration it’s due.\n“I love my home,” he says. “Not just the Shire, but Bag End itself—it was built for my mother by my father, y’see, for their wedding.”\nGlóin nods. “A most appropriate wedding gift,” he says, sounding pleased. \nBilbo belatedly remembers that dwarrows put much stock in craft-gifts—by their standards, his father’s wedding present must seem princely. Bilbo tamps down the sudden flood of warmth at that thought.\n“But as much as I love it, I can’t deny that the thought of returning has began to trouble me rather than excite me,” Bilbo admits. “I used to travel much as a faunt—I had forgotten the joy in it, being rather overwhelmed by the danger. I don’t know what it will be like, to go back to the Shire after all this has ended.” Bilbo laughs a little. “Gandalf did say I would not be the same.”\nGlóin considers him. “I have spent my life on the road, Master Baggins,” he says finally. “There is nothing in it new or exciting to me anymore. But to have a place to call your own, to live in it and not fear enemies or departure—aye, that is an idea that brings spark back to me, I admit.”\nBilbo flushes. “Oh, dear, I didn’t mean—“\nGlóin smiles at him. “I remember the beauty of the road,” he says. “Once upon a time, I was as reluctant to leave it as you. But don’t forget the wonder of home while you’re on your feet, Master Baggins. ’Tis a glorious thing, to have a place to return to.”\nThey sit in companionable silence for some time as the sun sinks ever lower. It is only when just the tip of it is just showing over the trees that Glóin sets his pipe aside and stands. He looks down at Bilbo and smiles wide before reaching into his tunic.\n“Hold out your hand, Master Baggins,” he says. Bilbo does so and Glóin deposits something into his palm.\nBilbo holds it up, frowning. It looks to be a cuff of some kind, though it is too narrow to fit on wrist or ankle or even finger. It has the design of a dragon mid-flight, making a natural curve that—Bilbo squints—would fit just perfectly over the curve of his ear. The fine silver is etched with Khuzdul and the dragon has tiny rubies set for eyes. \n“What is it?” Bilbo asks, transfixed. He touches a finger to the tiny dragon snout. \nGlóin huffs. “It is crafted of mine hand. A cuff for the ear,” he says. “My family are all jewelers, much like young Kíli. May I demonstrate its use?”\nBilbo nods and the gift is swept from his fingers and secured deftly onto his left ear. It adds a slight weight, but the metal is light enough that after a moment, Bilbo can’t really notice it. He turns his head this way and that to try and get a better look, but can only catch glimpses of the dragon’s nose from the corner of his eye. Glóin, however, looks supremely satisfied.\n“Fits perfectly,” he says. “I was a little worried, considering how wee and odd your ears are, but I haven’t lost my touch!”\n“My ears are not wee and odd—“\n“I’ll make you another for your other ear once we reach Erebor,” Glóin continues. “It’s good to have a matching set. But one alone is striking—perhaps you’ll start a new fashion, Bilbo!” He roars with laughter. “What do you want for the other side? Another dragon? A bird? A bear perhaps?” He winks.\nBilbo glares at him. “I’m sure I look quite ridiculous,” he says. Glóin’s face darkens and he hastens to add, “Because I am not made to wear such finery! Of course this—this—ear-cuff is the best in the land, since it is made by your hands, Glóin, but surely I look strange in it?”\nGlóin’s brow furrows. “You look magnificent,” he says. He looks over Bilbo’s shoulder and his face brightens. “Thorin! Come over here for a moment!”\nBilbo wishes for a violent moment that his Eagle had actually dropped him on the way here. \n“What is it, Glóin?” Thorin says as he approaches. “I was just for dinner.”\n“You must settle something for us - Bilbo worries that his new finery does not suit him! What do you say, cousin?”\nBilbo wildly wonders if Beorn will appear in bear-form and eat him.\nBooted feet appear in Bilbo’s frame of vision, but Bilbo determinedly does not look up from the ground. His face is burning, he can feel it, so the contact of two fingers against his chin is oddly cool. He flinches and looks up out of instinct to meet Thorin’s eyes—except Thorin is not looking him the eye. He stares directly at the cuff on Bilbo’s ear, his expression decidedly odd. \nThere’s a long silence.\n“Thorin?” Glóin demands. He sounds odd too—triumphant, though Bilbo can’t guess what for. Perhaps because he got to make Bilbo look like a complete numpty. “What do you think?”\nThorin—Yavanna, Thorin actually jumps. He takes a step away from Bilbo and clears his throat and—by the Valar, there is a blush rising up his cheekbones. Bilbo stares. He’s never seen Thorin so flustered before.\n“It is a princely gift, cousin,” he says. \n“Does Bilbo not look well in it?” Glóin asks, sounding sly. Bilbo gives him a suspicious look, but all Glóin’s attention is on Thorin.\nThorin clears his throat and looks anywhere but Bilbo. “It—suits the hobbit well,” he says as if through gritted teeth, as if the very compliment had to be pulled from the darkest recesses of his soul.\nBilbo’s abruptly extraordinarily cross.\n“There’s no need to pander to my vanity,” he says tartly. Thorin’s eyes snap to him in a most satisfying way. “I’m not some fauntling going through their first courting.”\nThorin’s brow furrows. “You do look well in it,” he says, with a bit more feeling than last time. “It suits you.” Bilbo scoffs and Thorin’s face darkens. “You do not believe me?” he asks.\n“Should I?” Bilbo asks. “You sound the same giving compliment as you would giving funeral announcement.” Glóin suffers a sudden, mysterious coughing fit. Neither of them look at him. “Are you not a king? Shouldn’t you be well-versed in this kind of thing?”\nThorin scowls. “I have no patience for courtly airs or fripperies,” he says. “I say what I mean, as any good king should.”\n“Even good kings should be better at giving an honest compliment,” Bilbo says, feeling much more relaxed now. “How do you expect to woo your intended if you sound like you are giving her a dire omen instead of telling her how nice her beard looks?”\nGlóin’s coughing fit grows louder. \n“I do not intend to court,” Thorin snaps. “You look well in your Mahal-damned ear-cuff, Master Baggins, and I am going to go get my dinner now!” He turns on his heel and stomps away. Bilbo watches him go, bemused.\n“He really is quite strange, don’t you think?” he asks Glóin, but Glóin only bursts into peals of unmuffled laughter and is of no help at all.\n\nBifur\n\nBilbo’s relief when they finally escape Mirkwood fades when he realizes, three days into their stay at Laketown, the reason most hobbits don’t go swimming in icy water. The Company are preoccupied with preparations, so no one seems to notice that Bilbo’s been sneezing a lot or that his voice is hoarse. Bilbo had felt fine when they first landed, but as the days pass his head begins to throb and his nose is so stuffed that it’s hard to breathe.\nThe morning of their fourth day at Lake-town, Bilbo opens his eyes and immediately wishes he hadn’t. Everything aches. His head feels as though it’s been stuffed with cotton wool and his nose—well, it feels rubbed raw from the number of times Bilbo had to blow yesterday. \nBilbo just lays there under his blankets and tries not to move or breathe or be a hobbit. He wishes desperately for his mother, who always gave him hot soup and tea when he was sick and read by his bedside. \nHe’s nearly drifted off to sleep again when he hears the heavy clomp of boots and the door opening.\n“Master Baggins? It’s already breakfast, what—“ \nBilbo whimpers and curls in on himself when his blankets are pushed off his body. There’s a long pause and then a warm, heavy hand is on his forehead. \n“You’re burning up.” Bilbo cracks an eye open and glares at Thorin, who’s frowning down at him like Bilbo chose to get sick on purpose. \n“Knew that,” he whispers to Thorin, his voice a cracked, hoarse thing. Thorin’s frown deepens. \n“I’ll go get Óin,” he says. “He might have something to ease you until you recover.”\nBilbo expects him to leave immediately, but Thorin pauses for a moment, his hand lingering over Bilbo’s brow. Their eyes meet and despite the aches and the stuffed nose and the burgeoning fever, Bilbo feels—he—\nThorin turns away, so hurriedly that he nearly runs into a dresser. “I’ll be back with Óin,” he says as he stomps out of the door. \nBilbo closes his eyes. Foolish hobbit, he thinks.\nÓin, predictably enough, prescribes bed-rest and warm food, but doesn’t have much else to help. He orders Bilbo to drink tea and water and then turns a weather eye to the other dwarrows gathered in Bilbo’s room—the rest of the Company showed up not long after Óin.\n“I’ll want someone to sit with him until he’s feeling more himself,” Óin says. “I can’t be on watch all day and the lad will feel better to have someone nearby.”\nBilbo might resent being treated like a child if he wasn’t pathetically grateful that they weren’t going to leave him all alone. \n“We’ll take first shift,” Bofur says, gesturing toward Bombur and Bifur. “A few hours apiece from each of us should do the trick, I think. The others can come in after we’re done.”\nBilbo closes his eyes as they discuss, exhaustion bogging him down. Before he hears the rest of the arrangement, he falls into sleep.\nWhen he wakes, Bifur sits at his bedside, carving something with a small, sharp knife. Bilbo watches his clever hands for a long moment, mind blank with exhaustion. \n“You’re quite good at that,” Bilbo says after nearly a half-hour has passed. Bifur’s managed to carve out the shape of an animal—Bilbo thinks it’s a badger. \nBifur jumps and then looks down at him. His wide smile is guileless and happy and he makes some sort of motion with his arm. Bilbo wishes, not for the first time, that whatever sign language the dwarrows had was more like the one hobbits used. Bilbo knows enough of the hobbit one to have a decent conversation—he learned when one of his cousins had been born without the use of her ears. But whatever the dwarrows use is much different; Bilbo can’t make heads or tails of it. \n“I’ve never liked being ill,” Bilbo says. “Even as a faunt.”\nBifur makes a low, sympathetic noise. His hands never stop moving; even when he’s looking at Bilbo, he’s still carving. It’s an extraordinary kind of skill. Bilbo’s never been a deft hand at carving, though Belladonna did teach him some embroidery and he’s a decent cook. \nHe wonders what it must be like, to devote yourself to one craft for the entirety of your life. Surely some of the oldest dwarrows must be masters of their craft indeed—200 years devoted to one thing! Bilbo can’t even imagine it. \nThe door opens and Bofur pops his head inside. “Ah, you’re awake,” he says, smiling and stepping into the room. “You worried us when you dropped off.”\n“How long have I been asleep?” Bilbo asks.\n“Oh, about half the day. It’s quite late now and it was mid-afternoon when Óin was here to check on you.”\nBilbo grimaces. “Thank you for looking after me,” he says, directing it to both of them. “I hate to be a bother when we’re so close to finishing.”\n“Thorin needs a bit more time to get what we need,” Bofur says, settling in on an extra chair. “And besides, it’s finally your time, Bilbo! This is what we dragged you all over Middle-Earth for—we can hardly leave you behind now!”\n“But Durin’s Day is so close,” Bilbo frets. “What if I’m still sick? What if I—“\nBifur lays a hand on Bilbo’s and says something in Khuzdul. \n“He says you needn’t worry,” Bofur translates, smiling. “We’ll figure it out, Bilbo. Honestly, if it weren’t for you, we’d still be stuck in Thranduil’s prison when Durin’s Day passed—at least you’ve given us a better chance!”\nBilbo frowns. “I just hate to be a bother,” he mutters. \nBifur says something again and while Bilbo can’t understand the words, the irritation comes across rather clear. Bofur laughs.\n“My uncle thinks you are too hard on yourself, Bilbo,” he says. “And I rather agree. We all owe our lives to you several times over—don’t think we’ll forget that.”\nBilbo’s not sure if the heat in his face is a blush or the fever, but he decides to blame the fever as he burrows back down under his covers. Bofur laughs, but doesn’t call Bilbo out—instead, Bilbo can hear him settling in his chair. Bilbo smiles a little under his blankets; it’s nice, to have people who are willing to look after him. To think that this group would have tossed him off the side of the road if he had dared fall ill during those first weeks! \nHe’s nearly asleep again when something drops on top of his covered head. Bilbo yawns and peeps out to meet the gaze of the newly carved badger sitting on his blankets. It’s face is twisted in a ferocious snarl that bares all its teeth, and it is ruffled with rage. Bilbo’s never seen a badger in person before, but he thinks it a fair likeness; in any case, it is intimidating, even for a carving. Bilbo touches one of its cleverly made ears and wonders if Bifur would be willing to teach Bilbo how to do that. He’s never been a fair hand at wood-carving.\nBifur says something in Khuzdul, sounding shy. \n“It is made of his own hand,” Bofur translates. “As you well know, since he did it while he was standing guard by your bedside.”\nBilbo smiles up at Bifur. “It’s lovely,” he says. “But why a badger?”\nBifur’s face goes distinctly sheepish and he mutters something that makes Bofur roar with laughter.\n“He says—“ Bofur gasps. “He says it reminds him of you!”\nBilbo’s smile slides into a scowl. A badger? He looks down at the ferocious little creature and his ire turns considering. He’s heard stories about badgers—slow to anger, but if their nest or cubs were attacked, they would attack more viciously than any other animal on Middle-Earth. Bilbo picks up the carving and brings it to eye-level, admiring the animal’s bravery. He might need something of that courage, to face a dragon, something of that ferocity. \n“Thank you,” Bilbo says to Bifur. “I will treasure it.”\nBifur grins at him and thumps his chest even as he speaks. Bilbo looks to Bofur, who seems oddly subdued after Bifur finishes.\n“He says it is a good-luck token,” Bofur says. “For when you go to face the dragon. There’s a rune on the underside, see?” Bilbo turns the badger over and there is indeed a small rune carved at the bottom. “It’s for providence and safe-carriage. We usually use it to protect travelers going into dark places.”\n“Very apt,” Bilbo says, a little grimly. He nods to Bifur. “I will carry it with me into that dark place.”\nBofur sighs. “First you must get well, Bilbo,” he says. “Then you can go charging off to steal from dragons.”\n“One step at a time,” Bilbo agrees and Bifur laughs. \nBilbo settles back into bed as Bifur and Bofur talk in rapid Khuzdul, the badger sitting on his chest. He curls a hand around it and feels hopeful for the first time since remembering his task.\n\nThorin\n\nBilbo’s had it up to here with Thorin bloody Oakenshield. \nDismissing Bard like that! Refusing to open the doors! Searching for that bloody Arkenstone day and night as if a gem has anything to do with the army on their doorstep. Bilbo’s put up with a lot on this little adventure of theirs—hard beds, terrible smells, not nearly enough meals, near-death—but this takes the figurative cake! \nThorin’s not in the treasure room when Bilbo comes stomping in, but Fíli and Kíli are. They freeze when they see him, the expressions on their faces nearly a mirror to the ones Bilbo’s younger cousins wore when Bilbo caught them stealing from the cookie jar. \n“Where is he?” Bilbo asks. He is even-voiced and pleasant, but Fíli and Kíli pale. \n“He, uh—“\n“Look, Bilbo—“\n“Where is he.”\nFíli and Kíli exchange looks of resigned despair.\n“The throne room,” Fíli says, proving that he is the smarter of the two brothers. \n“Please don’t murder him,” Kíli says as Bilbo stomps out.\nBilbo says nothing because Bilbo doesn’t believe in making false assurances or promises he can’t keep. \nThe throne room is dark and empty except for the brooding figure perched on the ridiculously large throne. The throne had been overturned when they found it, but the combined efforts of the Company had righted it again. Still, it is much too large for any dwarf, even one as tall and broad as Thorin. Bilbo’s pretty sure he’d look like a child if he tried to sit in it.\nGandalf wasn’t lying when he said that hobbits could be light on their feet—Bilbo, when he’s conscious about it, moves almost soundlessly. He creeps through the shadows until he’s only a few feet from the throne and the brooding moron sitting on it before he clears his throat. Thorin actually jumps, which makes Bilbo viciously happy.\n“Master Baggins—!” \n“Do you remember a conversation we had not long ago, Master Oakenshield?” Bilbo asks, adopting the pleasant tone he’d used against Fíli and Kíli. Thorin’s eyes narrow. “We talked about how displeased I would be if you squandered the life I saved.”\n“And you believe I’m squandering it, Master Baggins?” Thorin asks, thunder on his brow. “You think I throw it away foolishly? This is my kingdom, that is my gold—!”\n“What good is a kingdom without people?” Bilbo demands, abandoning pleasantness. “What good is gold—“\n“It is mine by right!” Thorin roars. “Mahal be damned, I will not let anyone take it from me—not the bowman, not the elves, not even you!” \nBilbo stares at him, stunned, and Thorin recollects himself, his anger draining away.\n“I will not apologize for protecting what I have given so many years to reclaim,” he says.\n“Is this truly what you came back for? Is this really the Erebor you fought for? This empty husk, filled with corpses and jewels? Thorin—“\nThorin’s face twists. “I wish you would not call me that!”\n“Call you—?” Bilbo has to consciously retrace his words before he realizes and colors. “Ah. I see. My apologies, it slipped out—“\n“You have called me such since our travels began,” Thorin says. “At first, I knew it to be ignorance—and when you came to realize how my people feel on such matters, your persistence felt more like a promise. A declaration.”\nBilbo’s brow furrows. “I don’t—“\n“But now here you stand, insisting I give away my line’s birthright to the unworthy,” Thorin says. It’s almost like he’s talking to himself now, not to Bilbo. “You are a maddening creature, Master Baggins.”\nBilbo puffs up in indignation. “I am the only sensible one in this gorram mountain!” he spits. “You will risk your life—risk Fíli and Kíli’s lives—the lives of this entire Company—for—“\n“—the craft that belongs to my people!” Thorin bellows, anger returning. “You know now what it means to us, so how can you stand there and insist we give it to those we do not cherish—?”\n“I insist because craft is nothing if you are not alive!” Bilbo yells. “Craft is nothing if it means you and the others being buried!” \n“Outsiders can never understand,” Thorin says. “It is like giving away a limb—“\n“Then give it away,” Bilbo says. “Better a limb than a body.”\nThorin turns away from him. “Leave me, Master Baggins. I will not move on this matter.”\nBilbo stares at that profile, the one he’d traced so often during the past few months that he could probably draw it from memory now. He’s trembling, he notes with a distant sort of understanding. He remembers the way the others talked of Thrór, the way they whispered of dragon-sickness, the bloodlust in Thorin’s eyes when Bilbo had first tried to escape Smaug. The way Thorin searches, day and night, for the Arkenstone. \nIf this continues, Bilbo knows there will be war. And he’s no longer that naive hobbit from the Shire: people die in wars. His friends could die and he won’t have that, he won’t lose the people he loves again when he’s only just realized how much he needs them. He won’t allow it.\nBilbo marches up to Thorin Oakenshield’s bloody throne and slaps him hard across the cheek. Bilbo’s entire palm stings, but the way Thorin turns to him, wide-eyed and incredulous, is more than worth it. Bilbo reaches out and grasps one of Thorin’s beard braids, using it to reel him in until they are nearly nose-to-nose. Thorin’s eyes are huge now and somewhere in the back of his brain Bilbo’s in awe at his own daring, but there isn’t time to care.\n“You listen to me,” Bilbo says in the low, fierce tone he remembers his mother using whenever she was truly angry. “I understand that that gold out there is important to you and I don’t begrudge you that. But if you think for one second that gold is worth more than your life or your sister-sons’ lives or the lives of anyone in this mountain, then you are not the dwarf I ran out of my door and left everything behind to follow.” He tugs on Thorin’s braid sharply, but the gesture is unnecessary—he has Thorin’s undivided attention. “You are not your grandfather, Thorin. You made a promise to those people out there—and a promise to us, as well. Is your word worth so little, that you’ll throw it away like garbage? Are our lives worth so little that you’ll let us be flimsy shields for a horde?”\nThere’s something happening to Thorin. His eyes shift, expression tightening, as if he’s fighting some inner battle of his own. Bilbo keeps his hold on Thorin’s braid and watches the shift. In his pocket, the Arkenstone is like a heavy weight and an idea occurs to him. It might be the wrong move—may push Thorin back toward the dragon-fever—but Bilbo’s out of options and ideas. \nHe reaches into his coat with his free hand and pulls it out of his pocket. Thorin’s arrested immediately, eyes narrowing on the gem even as he reaches for it. Bilbo’s fingers tighten around it.\n“This is what you want, isn’t it?” he asks. “This is the stone you’ll give all our lives for?” \nThorin doesn’t look at him. Bilbo starts to panic—perhaps this was a mistake, perhaps he messed it all up, he has to do something, anything to get Thorin to look away from the stone—\nBilbo reels Thorin in and kisses him square on the mouth.\nFor a moment, they stand there, each frozen—Bilbo’s panic triples and he wonders if he should pull away, pretend it never happened, obviously this was the wrong solution, oh Yavanna—\nThen Thorin’s hand slides into Bilbo’s hair, catching on the braid Fíli gave him, and they are—they are kissing. \nBilbo makes a small noise in the back of his throat as Thorin deepens the kiss, not sure what to do with his hands or his lips. By the Valar, it’s been years since he’s done this, years since he was young enough to kiss someone for the joy of it. He still clutches the Arkenstone in one fist, but he moves his other hand from Thorin’s beard to his hair. \nThe kiss goes on—it could be seconds or minutes or years. When they finally pull apart, Bilbo feels shaky, untethered. As if the mountain underneath his feet has disappeared.\nThorin’s eyes are fixed on Bilbo’s face. The gloom that has lingered on his brow since they first met has melted away and Thorin, to Bilbo’s embarrassed pleasure, looks as if the world has just given him a treasured gift. \n“You said I was too tall,” Thorin says.\nBilbo blinks, caught off-guard. When—? His mouth twitches as he remembers; the night at Beorn’s, when Fíli gifted him. Thorin’s indignant frown when Bilbo pretended he didn’t find any dwarf attractive.\n“I find that I can overlook that,” he says. \nThorin’s smile is a glorious thing, untouched by grief or fury. His eyes, for the first time in days, are clear as a summer morning and Bilbo’s eyes burn. It isn’t until he’s reaching to rub at them that he realizes he still holds the Arkenstone; his heart skitters when Thorin remembers and looks down at the stone in Bilbo’s fist with consideration. \n“You had it all this time?” he asks.\n“I found it when I first confronted Smaug,” Bilbo admits. Thorin’s eyes flash. “I almost gave it to you, when you met me in the hall,” he says. “But you—“ He shivers, remembering the look Thorin had given him. “You were not yourself.”\n“I frightened you,” Thorin realizes. \n“Smaug told me it would change you,” Bilbo says. “I didn’t want to believe him, but you acted so strange then, and in the days that followed. I didn’t want to give you the stone if it would make it worse.”\nThorin looks from the stone to Bilbo’s face and then, to Bilbo’s surprise, begins to laugh. Bilbo’s never heard him laugh before—it is a deep sound, a belly-chuckle that makes Bilbo smile in response.\n“You are a wonder, Master Baggins,” Thorin says. “I did not believe Gandalf, when he told me you would be essential—but here you are, dragging me kicking and screaming out of the dragon-fever that ruined my grandfather.”\n“You do not feel it anymore?” Bilbo asks, hopeful. \n“It is a distant thing,” Thorin says. “Whereas before, it blinded all my reason. The stone in your hand—five minutes ago, I would’ve died for it. Now, it is only a stone; beautiful, but no more so than any other.”\n“Thank the Valar,” Bilbo breathes. “Then you will not go to war with Bard and Thranduil? You will make peace?”\nThorin’s face darkens at Thranduil’s name, but it is not the kind of anger that has ruled him for the past few days.\n“I will give Bard and his people what they are due,” Thorin says. “We woke the dragon and it ruined their home. I can do no less. Thranduil . . . .”\n“All he wants are jewels that his people’s,” Bilbo says. “Is it really that much to ask?”\nThorin’s eyes flash, but when he sees Bilbo’s scowl, his anger abates and he smiles instead.\n“If I say no,” he says, fonder than Bilbo’s ever heard him, “I suspect you will bully me until I change my mind.”\nBilbo sniffs, affronted. “I would only reason with you until you come to your senses,” he says. Feeling a little sly, he adds, “Or kiss you until you’re senseless and more amiable to my way of thinking.”\nThorin’s eyebrows shoot up. “I did not realize hobbits were so indecent, Master Baggins.”\nBilbo scowls. “You still call me by title?” he asks, a little hurt.\nThorin startles, expression changing swiftly to embarrassed realization. He shifts away from Bilbo and reaches over the throne to grab something hidden on the other side. When he turns, he presents it to Bilbo with a wry smile.\n“It is crafted of mine own hand,” he says.\nBilbo takes it and gasps as it unfolds: a shirt made of pale gems, beautifully wrought and lighter than it has any right to be. He holds it to his nose to examine the way the links sparkle in the torchlight. For a moment, Bilbo feels as if he holds starlight at his fingertips. \n“What is it?” he asks, awed.\n“Mithril,” Thorin says. “A precious gem that is stronger than almost anything—that shirt will deflect all but the hardest blows. I crafted it when I was just a dwarfling, before Smaug came to the mountain. It was my choosing craft.” [3]\nBilbo runs a reverent hand over it. “It is a princely gift,” he says. “But surely Fíli or Kíli—“\n“They can take care of themselves,” Thorin says. “It would—it would give me great peace of mind, to know that you had this to protect you, Bilbo.”\nBilbo shudders a little. Thorin’s never called him by name before. \n“Can you—“ Bilbo clutches the shirt to his chest and tries not to show how flushed he is. “Can you say that again?”\nThorin’s eyebrows lift and he smiles, a little sly. “Bilbo?” he says and Bilbo’s shudder goes from ear to toe. Thorin leans in and presses a soft, chaste kiss to Bilbo’s forehead. “Bilbo.”\nBilbo closes his eyes, leans in as Thorin presses a kiss to his cheek, then to his left eyelid, then to the tip of his nose . . . . \nBy the time Thorin reaches his lips, Bilbo’s smiling."
}