{
    "id": "3453020",
    "url": "https://archiveofourown.org/works/3453020?view_full_work=true",
    "author": [
        "PhenixFlare"
    ],
    "title": "Imprinting",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Gravity Falls"
    ],
    "relationships": [
        "Bill Cipher/Dipper Pines",
        "background Mabel Pines/Pacifica Northwest"
    ],
    "characters": [
        "Dipper Pines",
        "Bill Cipher",
        "Mabel Pines",
        "Pacifica Northwest",
        "Candy Chiu",
        "Grenda (Gravity Falls)",
        "Stanford Pines",
        "Wendy Corduroy",
        "Jesus \"Soos\" Alzamirano Ramirez",
        "Melody (Gravity Falls)",
        "Waddles (Gravity Falls)"
    ],
    "additional_tags": [
        "Soulmate AU",
        "sorta - Freeform",
        "it doesn't really work perfectly",
        "background macifica",
        "minor background Soos and Melody",
        "sort of age balanced",
        "as in Bill waits for age of consent",
        "Older Dipper Pines",
        "Human Bill Cipher",
        "grey morality",
        "Bill is creepy",
        "Dipper doesn't mind",
        "Soulmate-Identifying Marks",
        "Alternate Universe - Soulmates",
        "Fluff",
        "sappy romance-y stuff",
        "Magic",
        "references to things",
        "everyone else is pretty much in the background but they're in the tags anyway",
        "Teenagers"
    ],
    "language": "English",
    "series": "",
    "published": "2015-02-28",
    "completed": null,
    "words": "11,897",
    "chapters": "1/1",
    "comments": "355",
    "kudos": "15,167",
    "bookmarks": "2,358",
    "hits": "142,383",
    "summary": "<p>Most people are born with a name tattooed on their inner wrist, in every written language imaginable; some people are born without. Dipper Pines is born with a small black triangle with a flesh colored dot at the center printed neatly onto his skin, standing out against its dark backdrop like an open eye. </p>\n<p>He doesn't know what to make of this.</p>",
    "notes": "<p>I'm a sucker for soulmate AUs, and I recently read a Tumblr entry considering takes on the genre in which the system is flawed; this is an attempt at presenting an imperfect soulmate AU. Hopefully I managed to keep everything organized, as well as doing the gradual build-up of the relationships justice. Concrit appreciated!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Not sorry about the references. Sorry not sorry. So what did you think? I have to level up my nonexistent artistic skill as I'd love to draw the scene with the paopu flowers. I hope I gave you some warm fuzzies!</p>",
    "text": "In a perfect world, imprints would be considerably less complicated.\nThe notion of being born with your match (your soulmate, not just in terms of hyperbole or flimsy words of endearment, but the other half of who you are at your core, a vital note in your personal symphony whose addition resonates with beautiful clarity) neatly printed on the inside of your wrist, clear as day should be a blessing. No more messy wading around in the proverbial sea with its bounty of other fish or waiting anxiously for return messages after an amazing first date or fretting over dying alone in a dark apartment surrounded by cats or dogs or whatever your choice of companion animal is. Pigs. Dipper is pretty sure that should Mabel choose or be relegated to the life of a hermit she'd live out her life surrounded by pigs and glitter and barrels of black market Smile Dip.\nThat doesn't sound too bad.\nBut it's also irrelevant, because his sister is one of the incredibly lucky ones with a relatively unique first name tattooed across her skin in crisp lettering, a strange name that evokes the image of the surface of the ocean gleaming beneath a luminous summer sun; the name of a girl with a sheet of perfect blonde hair that she spends the initial few weeks of their first summer in Gravity Falls shaking her fist at and the last few dragging throughout the mall hand in hand, pointing out everything of interest with the most brilliant smile Dipper's ever seen plastered across her face.\nAnd even if she continually gripes about being spiritually tied to a peasant with terrible fashion sense, sometimes he catches the same expression on Pacifica's face as well.\nBesides - there's a certain amount of notoriety that comes with finding one's match, and Pacifica definitely isn't complaining about the attention.\nMabel's lucky, alright - most of the time it's a good deal more complicated. There aren't just plenty of fish in the sea - there are billions. Some people are born with names scrawled in unfamiliar characters, Arabic and Chinese and Hebrew; sometimes said names are subscripts beneath a larger umbrella of written language: Hanzi, Kanji, Yiddish. Many people are born with a single, unremarkable first name pinpointing a single presence in an unfathomably large whole.\nAnd on occasion, someone is born with an unblemished inner wrist, no name whatsoever.\nWith those kinds of odds, it's a miracle that anyone manages to find their soulmate in a wide world full of people all following their own path and hoping they just happen to collide with someone who they recognize upon first sight, someone with their name embedded in their skin like a promise.\nSo the flawed system become less common over time; most people stop paying attention to their imprint and follow their heart where it takes them. Some have theirs covered over, like a corrective tattoo obscuring evidence of a fate they're unlikely to encounter. There are the usual hopeless romantics that cling to the notion, and whenever the touching story of two people coming together in a perfect union crops up here and there everyone coos and smiles over it then moves on. As time marches on, imprints are relegated to the status of odd birthmarks. After all, so few people actually meet their soulmate.\nDipper Pines is born with a single black triangle, flawless except for a small, perfectly circular dot in the center, the color of the flesh beneath his imprint. It looks for all the world like an open eye, staring back at him in mocking incomprehensibility.\nHe really isn't sure what to think about that.\nSo he doesn't.\n-\nAbout a month and a half into the summer of his twelfth year of existence, when he and Mabel and Soos are running from a floating monster shaped like a pyramid with a single eye hell bent on toasting them alive for interfering with his plans to probe their grand uncle's mind for information to assist a sociopathic munchkin pretending to be a psychic (life is weird), he doesn't think about it. Mostly because he's trying very hard not to die.\nLater on, while surrounded by the wreckage of a mechanical version of said munchkin with over half of the town's populace milling around shaking their heads with disappointment (life is really weird) and Mabel expounding loudly upon the virtues of grappling hooks, he doesn't think about it either. A ghost of a thought brushes against his consciousness, but only the faintest touch. It really doesn't register until much later.\n-\nA couple of weeks later he ends up being yanked out of his own body by the same pyramid-shaped monster (who's rapidly becoming one of his least favorite people) in a bid to abscond with the journal of  paranormal phenomena he found shortly after their arrival. Granted, it's partially his own fault for trusting a guy that's clearly a homicidal maniac and a liar and an asshole to boot, but it takes two to ruin a sock puppet play, and it's not exactly balanced when one of them has some pretty obvious malicious intentions. It's a terrible experience (and one that results in having to seek actual medical attention) and really poorly timed (although in retrospect Mabel really did dodge a bullet with that guy), but for the first time the realization, or at least its seeds, get lodged in one of the deep dark corners of his skull.\nIt's only an instant, right before he finds himself floating in midair and looking down at himself in a momentary haze of disorientation, but the moment his hand slips into the ball of blue flames sealing their bargain he remembers the symbol on his wrist - a dark triangle with a spot that resembles an eye.\nThen of course the shit hits the fan and it's pushed into the back of his mind yet again.\nBut this time he isn't the only one that notices.\n-\nA couple of days pass, the pain pills are pretty effective, he finally stops cringing at the sight of forks, everything settles down, or at least as much as it can in a place where this kind of shit goes down on a daily basis. Things are weird, but it's the normal kind of weird.\nExcept for the creeping suspicion that he's being watched.\nAt first Dipper dismisses it as mere paranoia. Who wouldn't be a bit paranoid after some of the harrowing experiences he and Mabel have been through this summer? There are probably a million things with too many eyes or legs watching the Shack from the woods, anyway.\nBut the feeling persists even when he's not on the porch or on the lawn or anywhere near the woods -- it follows him into his and Mabel's room and into the diner and everywhere, every step he takes, the sensation of being spied on. However, it's deeper than that; less surface level observation and more like something is scrutinizing his entire being. Studying his soul.\nFor the first time in ages, he finds himself inspecting the tiny triangle on his inner wrist and wondering just how it's connected to their recent dealings with their apparently resident dream demon. He voices the question to Mabel late one night when they're on their way to sleep on opposite sides of the room, and she thinks for a minute before venturing, sleepily, \"Maybe that isosceles monster is your soulmate.\"\n\"I'm pretty sure that guy doesn't have a soul, Mabel.\"\nMabel remains quiet for a minute or two, and Dipper concludes that she's probably drifted off to sleep. Then she speaks again, with a note of finality, \"So?\"\n-\nHe's sitting on the ledge outside their room, reading one of the mystery novels he brought with him and trying to take his mind off his mysterious admirer/potential assassin/some creepy combination of both. It's not very effective, because the feeling is a lot stronger today, and it's legitimately starting to worry him.\n\"Hello.\"\nDipper yelps and the book goes flying off into the blue. It's no big loss, honestly. He's read better.\nThe voice belongs to a young man (potentially; at the bare minimum he's at least a few years older than Dipper) with a head full of wavy blonde hair of a rich, warm hue that reminds him of sunshine; it's complemented with a black top hat. This doesn't make any sense out in the woods, but neither does the guy's presence, so Dipper files it away for later. He can't tell whether the newcomer is trying for a particular look or just in possession of a very limited wardrobe - he's dressed way too well for where they are, and everything is yellow or black. It's an odd fashion choice, but not in a bad way. A single hazel eye regards him carefully; the other is obscured behind a simple black eye patch. It's all vaguely familiar, but Dipper is too busy recovering from nearly toppling off the roof in surprise to make any kind of connection. \"Whoa, man! How'd you get up here?\"\nThe young man's voice is also familiar, and it sends a layer of goosebumps running along Dipper's forearms even though it's blazing hot in the middle of summer. \"Is that really the first question that came to mind?\"\n'Who the hell are you' was slated to follow, but Dipper has the feeling he knows the answer to that question. \"Can you blame me?\"\nThe young man grins in response, and then it clicks. Dipper glances over at the window, wondering whether he can make a run for it; probably not seeing as the intruder has conveniently placed himself in front of it. His grin widens at the look of recognition on Dipper's face. \"I take it I don't have to introduce myself again?\"\n\"No, Bill.\" Dipper sighs. \"I know who you are.\"\nBill's smile is absolutely radiant. \"Excellent! I was starting to worry that I'd damaged that rather impressive brain of yours last time.\"\n\"Thanks, by the way. That really sucked.\" He's having a conversation with the aforementioned pyramid monster that's tried to kill him on at least one occasion and who's apparently decided to try again in human guise. Dipper wonders if this one is stolen too.\n\"You're welcome!\" Bill says cheerfully. \"Hopefully it was a learning experience. Don't make deals with people like me. But not me specifically. You can totally trust me.\"\nDipper doesn't bother dignifying that statement with a response. \"So are you going to push me off the roof or try to jack my soul again-\"\n\"Body. You can keep your soul. I don't have a use for it yet.\"\n\"That is the least reassuring thing you could have said.\"\nBill shrugs. \"I'm honest every blue moon. But nah, today's an off day. You're safe. Mostly.\"\n\"Um...\" The entire situation is unsettling, mostly because Dipper does not trust this guy (with good reason), but also because he has no idea how to react. The problem resolves itself momentarily when the demon reaches over and seizes his left arm, tilting it to get a good look at the mark on his wrist. \"Hey!\"\nBill's grip is pretty firm; not tight enough to hurt but definitely precluding any thoughts of shrugging free of it. \"So this is your imprint, huh?\"\n\"Didn't you notice before?\" Dipper decides to cut the question short, not wanting to provoke him, but 'while you were gallivanting around in my body' hangs in the air between them.\n\"I was a little occupied.\" To his credit the demon's pretty calm, inspecting the imprint with interest. He runs a finger over the skin, and Dipper has to will himself not to shiver. \"These are a bit inconvenient, aren't they?\"\nDipper mirrors his shrug with his free arm. \"Not really. They don't matter too much anymore. Some people get lucky, some don't. It's no guarantee. Some people don't even get one. I guess they're relics of human history at this point.\"\nIt's a rather nihilistic way of thinking about it, but he's still a little down in the dumps from Wendy's rejection; more than once he found himself hoping beyond hope that despite his confusing imprint her wrist might bear his name, but it doesn't. He feels a little dumb for succumbing to the romantic notion, albeit briefly. Even if it had he's not sure it would have mattered. A match isn't an absolute.\nHe realizes that Bill is staring at him intently and he's forced to look away, incapable of holding his intense gaze for more than a few seconds. \"You don't seem too concerned,\" he says thoughtfully.\nIt's a sore spot, and Dipper can't prevent the edge from creeping into his voice. \"Sometimes it's frustrating when you're interested in someone and you start dwelling on whether you two are...you know?\"\n\"I think you're all fragile insects that could be wiped off the face of the Earth pretty easily, so no.\"\nWell okay then. Dipper doesn't have anything to say to that, so he opts to carefully pull his arm back (Bill lets him) so he can stare at his imprint himself. He's so lost in thought that he barely notices when Bill asks, casually, \"Have you?\"\nDipper rotates his forearm and points at the black triangle. \"Does this look like a name to you?\" A shadow of something he can't identify or fully comprehend passes over the demon's face, clearing up as quickly as it comes.\n\"Maybe I was wrong about you being more intelligent than the average meatbag.\"\nDipper's ready to take offense at this until Bill adds, \"It's a logogram.\"\nIt's a perfectly reasonable theory, one that's actually occurred to Dipper on several occasions. \"I figured. That doesn't narrow it down when there's no indication of which language system it belongs to.\"\n\"Hm.\" The noncommittal sound is followed by the demon looking away from him and settling with his back against the outer wall. \"I know what it says.\"\nDipper looks up at him suspiciously. \"You can read it?\"\n\"Oh course I can. Knowledge of centuries, remember?\" Bill says with a level of personal satisfaction that's almost overwhelming. \"But I don't provide translation services. Unless...\"\nIt's at this point that the novelty of the experience runs dry, and Dipper bravely heads for the window, lightly nudging the demon out of the way and slipping back into the Shack. \"Nope.\"\nBill doesn't stop him, and when Dipper looks up again he's gone.\nThe rest of the summer proceeds in the same eccentric manner as usual, but Bill doesn't make any more appearances. It's sort of a relief.\n-\nSummer comes to an end and the twins say their goodbyes to their new friends and extended family then head home. Compared to the past few months the trip is fairly unremarkable, which is a little disappointing; Dipper misses the cavalcade of misadventures already. He and Mabel have an unspoken agreement that they're definitely not telling their parents about their many brushes with death, or at least not yet -- the thought of not being allowed to come back the following summer is already unbearable, for both of them - although Mabel's news will probably sway any misgivings in their favor.\nIn the end, it's not an issue - Mr. and Mrs. Pines are so thrilled at the idea of their daughter's revelation that Dipper doesn't get a chance to mention the handful of times he found himself on the crappy end of a physical altercation. They are slightly surprised that the name is indeed that of another girl, but they're really not the type to care, and apparently neither is Mabel. For the first time in awhile he feels the merest hint of envy; it doesn't brush aside his involuntary smile when he thinks about the way Pacifica's mask of confidence fell away when hugging Mabel goodbye, but he finds himself looking over his imprint again and wondering who he could possibly belong to.\n-\nThe school year drifts by in its slow, bloated monotony. It's frustrating and spotted liberally with early teenage drama and stressful encounters with peers that feel the need to take him to task over his geeky demeanor and academic aptitude and decidedly uncool interests. Dipper doesn't understand the glorification of middle and high school in almost every form of popular media out there. He's ready for it to be June again by the middle of November, and when the year finally rolls over and deposits the twins in the warm period between spring and summer they're both looking forward to the lengthy ride out to Oregon with a fervor that borders on madness. Mabel misses her friends and can't wait to see Candy, Grenda, and of course Pacifica again, and Dipper wants to return to the antithesis of normality that Gravity Falls represents, bored to tears by a world with no magic or monsters or ancient artifacts. Piedmont pales in comparison to the place where he's most certainly not crazy, and the journal with the six-fingered hand emblazoned on the cover that he carries with him constantly is a promise of even more exploration.\nTheir friends and extended family are just as happy to see them, with Candy and Grenda nearly bowling Mabel over in a vicious bear hug while Pacifica pretends to be not be bursting with the same amount of glee on the sidelines and Waddles squeals excitedly; their notoriously morally challenged yet endearing Grunkle says some questionable things about cheap labor that indicates that he has poor understanding of child labor laws, and Dipper is immediately swept up into catching up with Wendy (whose long red hair has lengthened and whose angles have softened into more noticeable curves and Dipper has to mentally remind himself not to stare because they've been down that road before) and Soos, who is Soos, as usual. It's an amazing reception, and Dipper falls asleep with a smile on his face that night.\nThe first couple of weeks back are like déjà vu - there's a vending machine being haunted by the ghost of health food nut switching out cans of soda for healthier alternatives that Mabel has severe issues with, the brief reemergence of a merman she dated for a few days the year before on the run from his manatee fiancée, an embarrassing incident involving Robbie, Tambry, and the bottomless pit that no one's going to let them live down...the usual. It's exciting and ridiculous and sometimes terrifying and so much more lively than Piedmont.\nThree days later, during an evening foray further into the woods than usual, Dipper accidentally stumbles on a hooded figure going through a strange series of somatic gestures while being set upon by a handful of pale figures hissing in some sibilant language that he can't understand, and finds himself whisked up into the branches of a large tree hanging overhead before he can release the scream bubbling up in his throat. The hand that clamps over his mouth to muffle it doesn't help with alleviating his terror in the least.\n\"You've really got a talent for being in the wrong place in the wrong time, kid.\" Bill says dryly, pulling his hand away before Dipper has an actual anxiety attack. It takes a few seconds to register where he is and who he's with and when he does he scoots as far away as he can without falling off the thick branch, glancing down nervously at the spectacle below.\n\"Just so we're clear...\"\n\"That is a necromancer fighting the remnants of a hive of vampires,\" Bill chimes in, sounding pretty damn pleased with himself. \"Guess who took care of the rest?\"\nIt's then that Dipper notices that there's a copious amount of blood splashed across his face, and his suit, and kind of everywhere, and that single eye is gleaming a vivid, ominous red. It's all he can do to keep his balance while shuddering, and he doesn't have the heart to provide an answer. His reaction seems to amuse the demon greatly, and Dipper can't help but glare at the bastard while he laughs his triangular ass off at his expense. \"You meatbags freak out at the most random things!\" He waves a hand, and the gore disappears, leaving him as pristine as the last time Dipper saw him. \"You happy now, Pine Tree?\"\nHappy isn't the word, exactly; 'less likely to throw up on a vampire' is more like it. Dipper shifts into a more comfortable position in the tree, eyeing Bill warily. His eye isn't glowing anymore, having returned to its rich hazel, and granted he did just save Dipper from whatever happens when you interrupt a necromancer fighting the remains of a hive of vampires...but he still doesn't trust him, with good reason. \"So was that a normal guy, or...\"\n\"Was.\" Bill's grin is predatory. \"You're not the only one without the common sense to avoid making deals with the devil. They get what they want, I get what I want, it's a profitable system, you know?\"\nHe sounds exactly like a shady used car salesman, and Dipper laughs, even though it's not necessarily funny. \"Is this a normal demon thing, then?\"\n\"Depends. I'm more of an independent contractor. I've even got a client confidentiality policy! I like to keep it professional,\" the demon says arrogantly. \"Uphold that necessary division between business and pleasure, and all...although sometimes they overlap.\" He holds up a gloved hand,  and actually runs his tongue over the few drops of blood clinging to the leather and Dipper suddenly hates his hormones because his stomach does a thing that he doesn't understand. \"Just a little.\"\nDipper looks away, down at the piles of dust scattered across the ground being carried away by the light breeze, and hopes his flushed cheeks aren't obvious. There's only a few of the vampires left, and now the necromancer's laughing hysterically. He stiffens at the feeling of arms wrapping around his midsection, and looks up to find himself face to face with his infernal companion. \"Let's get you home before you get into any more trouble, Pine Tree.\"\nDipper opens his mouth to protest, but it doesn't matter because he's floating in midair now, or rather Bill is and he's holding on for dear life, and it's a long way down. His heart rate jumps up a notch, and he buries his head in Bill's chest because it's either that or look down and he really doesn't want to look down. \"If you're going to drop me,\" he stammers, squeezing his eyes shut, \"Just go ahead and get it over with.\"\n\"What makes you think I want to drop you?\" There's surprisingly no trace of malice in the demon's voice -- he sounds more bemused by the suggestion that anything else.\n\"I thought you swore your revenge on us when we defeated you last year.\" Dipper makes no attempt to wiggle free; he can tell they're moving now, and he still doesn't trust Bill to not just release him and let him tumble through the air to what would definitely be his death.\n\"I wouldn't say defeated. You just got lucky.\"\n\"Whatever.\" There's anger blooming in his chest now; clearly the demon is toying with him before making a likely soon-to-be successful attempt on his life, and annoyance overpowers fear. Dipper forces himself to open his eyes and look up at him. \"You hate us, right? Or at least me.\"\nOnce again, there's a flicker of that expression on his face, the one Dipper couldn't read before and he can't read it now. \"Hate's such a strong word,\" Bill says, mildly. There's little trace of the violent monster Dipper knows he can be, and he can't tell whether that's comforting or more unnerving. \"I find you intriguing.\"\nThis is not the answer Dipper was expecting. \"Why? How?\"\nThe hazel eye glances down at him, giving him that sensation of being scrutinized. \"The going rate for single questions is two years of mindless servitude, but I can give you a discount if you want to go with both.\"\nDipper sighs. \"Is that an official policy or are you just making stuff up now?\"\nBill doesn't answer, but that grin is back. Dipper places his head against his chest again -- with less panicked enthusiasm than before. \"Never mind, I like not being a zombie.\"\n\"Geez, Pine Tree, you're so demanding. Fine, I'll let you ask one, free of charge. I'll even be honest this time.\"\nThere are a million things that he can ask that would actually be useful -- what are your weaknesses, what are your plans for this town, what does my imprint say -- but Dipper's brain isn't working correctly at the moment because the first thing he blurts out is \"Why am I intriguing?\" He instantly regrets it, but he's too embarrassed to ask if he can take it back.\n\"You're intriguing,\" Bill responds thoughtfully, \"...because you're intriguing.\"\nDipper groans. \"That's such a cop out!\"\n\"I never promised a straight answer! Or a refund.\"\nDipper fumes all the way back to the Shack, but he's smiling, with his ear pressed to where he can hear what sounds like an oddly alien yet still rhythmic heartbeat. He's surprised to hear it, but that's a question for another day, if this one isn't a fluke.\nA short while later they're back at the Mystery Shack, where Bill deposits him on the ledge more gently than Dipper would expect him to. \"Here you go, princess.\"\n\"Um...\" It's such a weird situation that Dipper fumbles for words before settling on a simple \"Thanks.\"\n\"No problem!\" Bill sounds as cheerful as ever. \"After all, your continued existence is relevant to my interests.\"\n\"It's two years of mindless servitude per question, right?\"\n\"That's right!\"\n\"Nope.\" Dipper slips past him and crawls through the window into his room (where Mabel is thankfully sound asleep; he isn't ready to explain this one and he doesn't know how, anyway). When he looks up again the ledge is empty.\nIt's a little disappointing.\n-\nJuly arrives with no further dream demon related incidents. He and Mabel have their various misadventures and moments of personal growth sprinkled with a light dusting of teenage angst, especially when an argument between two of Wendy's friends results in a furious battle of text messages and other means of covert communication. If that's what he, Mabel, Pacifica and Mabel's other friends have to look forward to in a few years, being thirteen doesn't seem so bad anymore.\nPacifica is still Pacifica, no matter how much she gets along with Mabel (and Dipper) now. She's still wary and a bit judgey around Candy and Grenda, but Dipper can't hold that against her. He's nowhere near the lovelorn, hopeless romantic Mabel can be, but it's sweet watching the two of them interact with each other. It's a pretty young age to encounter one's soulmate, and with distance, age and personality taken into account it's definitely not the love at first sight that the more hackneyed, sappy romantic comedies generally play up. But the two mesh and balance each other out so much that it's obvious that they're teetering on the edge of that tentative form of love that people their age find themselves pulled into. It's in the way Mabel sometimes quiets down and talks about Pacifica shyly, because his sister is anything but shy when it comes to people she's attracted to, and it's in the ferocity that shines in Pacifica's eyes when someone makes a comment regarding Mabel that she doesn't care for.\nIt's impossible not to feel a little lonely.\nThe third week into the month Mabel approaches him while he's reading, or at least pretending to -- he's mostly staring at his imprint with more interest than ever. \"Hey, Dipper?\"\nHer entire bearing is off; her cheeks are bright pink and she's looking down at the floor. It's such a rare sight that it borders on downright bizarre, and Dipper sets his book aside, concerned. \"What's up? Are you okay?\"\n\"Yeah.\" Mabel continues staring at the floor. \"Can you help me with something?\"\nIt's how he ends up back out in the woods with the humid early evening air leaving a light sheen of perspiration on his forehead, clutching a page of directions hastily copied from his journal. There's just a little sunlight left, enough to see by, and he keeps his eyes trained on the patches of grass he moves through on his way to the spot highlighted in the book.\n\n\"How do you pronounce this? Pow-pu?\"\n\n\n\"I think so.\" Mabel points at the somewhat crudely drawn image of the flower scribbled on one of the pages of the journal. Its five petals form a star when it's in full bloom.\n\n\n\"And why do you want this again?\"\n\nIt's stupidly hot and muggy, and Dipper sort of regrets agreeing to go track the flower down. But Mabel had used the eyes and he couldn't say no to the eyes.\n\n\"So-called magical properties linking the destinies of the one the holder presents it to?\" He rolls his eyes. \"Let me guess. It's for Pacifica?\"\n\n\nMabel's nods enthusiastically, wringing the hem of her sweater in her hands.\n\n\n\"Aren't your destinies already linked? Your name's tattooed on her arm!\"\n\n\n\"I know!\" Mabel stares up at the ceiling, fidgeting. \"I just want to make sure.\"\n\nIt's not the hunt for such a small, possibly insignificant plant that's the problem, but the fact that according to the journal they're either out of season now, or close. Apparently they can only be found growing in clumps near a small pond, and it takes half an hour of walking and mentally checking off landmarks before he reaches the pond. It's definitely small, about four or five feet in diameter - a glorified kiddie pool, really.\nAnd of course there isn't a single flower in sight. Great.\n\"Looking for this?\"\nHe's getting used to the fact that Bill doesn't know how to announce his presence like a normal person, and it's the only thing that keeps Dipper from tumbling headfirst into the pond. He does yelp, though, because he's only human, and turns around to level an irritated glare at the man standing behind him. \"Do you have to do this every single time? Is it really that hard to just approach me from the front like a normal person?\"\n\"I'm not a person.\" For a moment Dipper swears that the teeth visible in that grin look more like the jagged canines of a creature accustomed to tearing the throats out of lesser creatures, but it's only a moment, and probably just a flash of paranoia.\nHe shivers anyway.\n\"Yeah, I know. You're a being of pure energy with no weaknesses.\"\n\"You got it!\" The sunny expression on the demon's face rivals Mabel's -- the inconsistency between the monster and the man is so very disconcerting. That's when Dipper notices what he's holding - a flower with a perfect pale green stem, and five golden petals arranged in the shape of a star. It looks like a fresh bloom, the last one refusing to sleep until next spring.\nDipper blinks. \"You found one?\"\nHe's worried for the flower in those normally bloodstained hands, but Bill cradles it like a newborn kitten. \"I did. What are you going to give me for it?\"\nOf course. Dipper scowls; of course he'd try to take advantage of him, now that he's starting to let his guard down. \"My sincere and undying gratitude?\" he says, forcing the words between clenched teeth.\nBill shakes his head. \"A question.\"\n\"That's it?\" Now Dipper doesn't know what to think; it seems to be the order of the day when interacting with Bill. \"No mindless servitude?\"\n\"Not unless you really want to.\"\nDipper doesn't want to. \"Shoot.\"\n\"Who is it for?\" The demon's demeanor doesn't shift in the slightest, but to Dipper it looks just a little forced. He's not sure why he wants to know, either.\n\"The flower?\" It takes a couple of seconds for the situation to click in his head, and once the realization floods in he throws his hands up, innocently. \"Oh, no, this is for Mabel. She wanted to give one to Pacifica so I volunteered to track one down for her.\" Volunteered isn't exactly accurate, but Bill doesn't need to know that.\n\"I see.\" That golden eye, locked with his own and staring straight into his soul. It's really unnerving, and Dipper waves his hands even more frantically. \"Seriously, it's not for me. Or anyone connected to me.\"\nAll at once the intense stare softens, and the tension in the air around them fades. \"Calm down, Pine Tree. I was just curious.\"\nThe \"why\" on the tip of Dipper's tongue must be obvious, because Bill follows it up with \"I have my reasons\" in such a manner that Dipper instantly knows not to question them.\nA soft golden bubble surrounds the flower, and Dipper reaches out to accept the glowing sphere when it floats in his direction. This time he's genuinely grateful to see the demon, disorienting behavior aside. \"Thanks. I was worried there weren't any left.\" It's getting dark, so he takes a final look around. \"I'll see you around, I guess.\"\nHe heads back into the woods, grateful for his increasingly apt navigational skills, but also the warm glow of the sphere lighting his way. There's a soft shuffling noise behind him, and he glances over his shoulder to see Bill casually strolling after him, on foot. Perhaps they're just heading in the same direction; it's a foolish thought but he's so overjoyed with how the evening's gone thus far that he doesn't want to let suspicion take root in his heart once more. However, it's hard to ignore a guy a few years your senior trailing after you in the woods, so finally Dipper stops and looks back at him. \"You're not planning to kill me and dump my body out here, are you?\"\nBill regards him thoughtfully. \"Well. If I was, this would be a good place to do it. Isolated, no one to hear you scream...\"\nApparently Dipper's unease is visible because the demon sighs, shaking his head. \"If I was going to kill you, I'd have done it already. It's not like it would be a challenge or anything.\"\nDipper decides to let that minor insult go, and anyway it's probably true. \"Then why are you following me?\"\n\"I'm not following you. I'm walking you home. It's dangerous, being out here alone.\" There is an unspoken threat inlaid in that statement, but Dipper gets the feeling that it's not meant for him. By now the sun has slipped completely below the horizon, and there is only the gentle light of the sphere in Dipper's hands illuminating the darkened woods around him. There is also the gold pinprick of Bill's eye, and perhaps the pearly gleam of his teeth.\nAt any rate, Dipper feels pretty safe now.\nThe walk back to the Shack is rather peaceful. The crickets provide a sweet, symphonic backdrop; the light of the sphere is joined by that of a numerous fireflies. The silence between them isn't tense or apprehensive, but congenial; it's pleasant. After about fifteen minutes another sound joins the ambient noise of the woods - a tuneful melody that's incredibly familiar. Bill's humming.\nThe song is really familiar, and although Dipper can't quite remember where he's heard it he knows the song; it's woven into his memories and hearing it makes him lightheaded. He begins to unconsciously hum in unison, and the rest of the walk home proceeds in perfect harmony.\nThe moon's out by the time they arrive. Instead of approaching the Shack Bill hangs back behind the tree line; Dipper gives him a questioning look until he hears the sound of voices from outside the building. Dipper nods, comprehending the situation immediately - he doesn't want to bother with explaining anything either. \"Thanks,\" he says softly; he doesn't understand why he's feeling so very awkward all of sudden.\n\"It was my pleasure,\" the demon says with an elegant bow worthy of a gentleman. Things have officially gotten too weird for Dipper, so he turns and runs off before he can open his mouth and say anything stupid.\nAlso his face is flaming red and he's a little dizzy.\nMabel is overjoyed with the flower; she nearly hugs him to death, and she's especially pleased with the protective sphere encasing it. She's too excited to ask how Dipper managed to accomplish this, which is a relief. Of course he isn't there to watch her give Pacifica the flower, given that it happens somewhere on the Northwest property beneath a sky full of stars, but he assumes it went pretty well when Mabel returns a little after midnight and wakes him up by dive bombing him with a squeal that puts Waddles to shame.\nShe then proceeds to chatter about their date for the next two hours on the phone with Candy first and then Grenda. Dipper retrieves his blanket and a pillow and goes to sleep out on the ledge.\nSummer draws to a close and before they know it it's time to go home. This time Pacifica doesn't hang back, rushing forward to wrap her arms around Mabel's neck in a rare show of emotion, and Candy and Grenda provide the appropriate 'awww's in the background. Dipper says his goodbyes to Stan, Soos, Wendy, and the couple of Wendy's crew that he's actually become pretty good friends with in spite of the age difference, but something's missing.\nHe boards the bus with a heavy feeling of dissatisfaction weighing him down, and spends a good bit of the ride staring despondently out the window. Mabel notices and asks him if he's okay.\n\"I don't know,\" Dipper says truthfully, because he really doesn't.\n-\nHigh school is awful. Dipper is convinced that it's almost identical to prison: a bunch of awkward, emotionally charged individuals trapped in a building for an indeterminate amount of time, continually moving through cycles of infatuation and hatred. It's even worse being a freshman. The same idiots from middle school that got a kick out of tormenting him now have their own bullies, and instead of inspiring solidarity they decide to take it out their frustrations on him.\nThere's also the ever present issue of hormones. They're now asserting themselves more than ever, and this is compounded by the fact that it isn't just his female peers that turn his head on a regular basis. This is a revelation that he keeps to himself. He doesn't even tell Mabel - not yet, although he knows he'll find nothing but acceptance there, especially given her relationship with Pacifica. But he knows good and well that not everyone is as tolerant and downright encouraging as his family, and he really doesn't need any more reasons to spend lunch periods holed up in the computer lab.\nThe one thing that makes his stay in hell tolerable is encountering a couple of friends with similar interests. It's wonderful to have other people to talk to about his paranormal experiences, and Cora (whose hair moves through the entire spectrum of different shades of blue over the school year), Norman (a small kid with a shock of black hair and ears that can probably receive satellite signals) and Dib (a guy that literally wears a trench coat and claims to have gone to school with an alien before moving out to California) are impressed with his tales of his summers in what might be the weirdest place in America. They form a strange little group that often draws scathing commentary from their 'normal' peers, but who cares when you've got other people to share blurry photographs and discuss possibly extant prehistoric creatures with?\nThat said, he can barely stand the wait until May, and he and Mabel convince their parents to let them head up to Oregon the day after school lets out. The routine bus trip up North is spent in a state of restlessness that he can't put a name to. It's the same feeling that hung over him like a dark cloud during their last day in Gravity Falls the previous summer; Mabel's chattering goes in one ear and out the other while he broods.\nThe reception is the same as the year before, and while Dipper is thrilled to see everyone again the knot of anxiety remains firmly fixed in the pit of his stomach. He makes an excuse to turn in early, citing a non-existent headache, and is grateful for Mabel's absence for the rest of the night -- she's swept up in a car that likely costs more than most people make in a decade and whisked off to Northwest manor the moment she drops her luggage in the Shack. The peace and quiet is welcome, and once the noises of his grand uncle and his crowd of hapless tourists fade he climbs out of bed and out onto the ledge. The sky above his head resembles a watercolor canvas of deep pink and orange hues, and he inhales the scent of the evergreens. Home. This is home.\nHe's settled back against the wall, allowing his eyes to slip shut for just a moment...\n\"Welcome back, Pine Tree.\"\nAnd all is right with the world.\n-\nThey settle into a facsimile of a pattern; Bill shows up and scares the shit out of him and then proceeds to be alternately annoying, unnerving or creepy while somehow managing to be endearing at the same time. Sometimes he makes his appearance while Dipper's sitting out on the ledge, pretending like he isn't waiting for him, peering over his shoulder at whatever he's reading and providing commentary. A couple of times he whisks Dipper off into the air and heads into the woods (the first couple of times Dipper almost has a heart attack, and even when he gets used to it it's still nerve-wracking) to show him things that aren't in the journal. This results in Dipper amending parts of it with a series of Post-It notes that eventually become entire pages stuffed into the book. He's not sure when the demon stopped wanting the journal for his own purposes, but he also isn't sure when they became friends.\nAnd they are; for all his maniacal machinations and occasional momentary descents into insanity -- more than once he arrives with the evidence of having killed something or someone on his clothes, usually just to see Dipper shudder, and there are enough flashes of the monster lurking beneath that slick surface that it's impossible to forget that he's a freaking demon. But he feels perfectly safe around him, and when they're walking through the woods at night Dipper doesn't worry about anything jumping out of the shadows at him. It's pretty sweet to be on the good side of the predator at the top of the food chain.\nBut for all his grey morality (dark grey) and ambiguous motives overall there is a side of Bill that completely throws him for a loop every time. It's the side that holds on to him tightly when they're in the air and places him gently on the ground instead of dropping him. It's in the way that he simply teleports them back to the Shack when it starts to rain and Dipper freaks out over the journal or whatever he's got in tow getting wet, and in the way that even when Dipper ventures out by himself he can always tell that Bill is lurking nearby; he slowly begins to realize it's a protective gesture instead of a malicious one. And when Dipper has moments of disappointment or an overflow of teenage angst and crawls out onto the ledge to be alone he's joined by a silent figure that removes his cap so he can run gloved fingers through his hair and hums the song that Dipper knows by heart and has somehow always known.\nDipper doesn't appreciate the teeth and claws and other creepy offerings that start showing up on his bed, but he doesn't throw them away, either.\nFor the first time since he and Mabel started visiting the town during summer vacations the end of summer is damn near devastating. He does spend a fair amount of time with Wendy and the gang, given that most of them will be on their way to college after graduating the following year, and that's a distressing reality on its own, but on the last day before they leave he returns to the pool where he found Mabel's flower and rests his head against Bill's shoulder until he falls asleep, listening to their song and wishing he didn't have to leave.\nThe period between the three months they spend in Gravity Falls a year is dull in comparison. It isn't as if those months aren't eventful. He and his friends have their trials and triumphs; he and Mabel bicker and protect each other and tell each other secrets. As expected, Mabel and his parents are as supportive of his announcement as they are of Mabel's relationship with Pacifica. School continues to be awful, but not in a way that particularly stands out. Life is, in turns, exciting and frustrating and occasionally boring, but it feels muted overall. His first relationship with a girl that's drawn to his quirkiness lasts for a few months of mild happiness before fizzling -- it's not a bad relationship, and they thankfully remain friends afterwards, but the passion isn't there to keep him hanging on. The attitude towards imprints shifts slightly among his peers. There are a small handful of couples that come together with each others' names printed on their wrists and the internal harmony and intimacy letting them know they've found their match, and for some students they're a source of envy. Dipper isn't envious, necessarily -- he still doesn't know what his triangle means, and he doesn't talk about it much.  \nAs the years pass, it feels as if his heart hibernates from September to May, then starts beating out of control the moment he returns to the town that he now definitively thinks of as home. The year he and Mabel turn 15 Wendy departs for her freshman year of college with a promise to stay in touch. She's replaced by another local teenager that Stan doesn't have to pay too much. She stares at her phone most of the time and is cynical and aloof and pretty, but she's no Wendy, and while she and Dipper are on friendly terms he doesn't entertain any thoughts of romantic intentions involving the two of them.\nThis is probably because he's gradually falling in love, but he's too inexperienced to realize it the way Mabel does the moment he starts walking around the Shack moony-eyed and lightheaded after disappearing into the woods for several hours at a time. By now she and Pacifica are 'official', with the local media having already assigned them a celebrity portmanteau: Macifica, which has a better ring to it than the alternative. It's a level of popularity Mabel isn't used to, but she embraces it wholeheartedly and with an aura of offbeat charm that makes her stand out on her own. It's useful advertising for her artistic endeavors, as is the support of the Northwest family (who have finally pulled the sticks out of their asses enough to at least be happy for their daughter), and Grunkle Stan is overjoyed at the attention it brings to the Shack. It's all very exciting for Mabel, although her newfound fame definitely contributes to the widening gap between her and her brother.\nThat doesn't mean their relationship has dwindled; they're still capable of that subconscious, non-verbal communication, and one day when Dipper returns with an utterly stupid expression plastered across his face and a handful of crystals with varying magical properties that he plans to spend the rest of the evening studying Mabel corners him in the kitchen with a knowing grin. \"So who is it?\"\nDipper yelps, and drops his crystals on the floor. He's starting to think the problem is him.\nHis reaction only spurs Mabel on further, and she drops to the kitchen floor beside him as he's scrambling to retrieve his findings (or rather Bill's findings). \"Come on, little bro. Don't lie to the Angel of Love!\"\n\"Is this an official position or did you just make that up?\"\n\"I have many talents, Dipper. Guiding Cupid's arrow is only one of them.\" She helps him pick up the rest of the crystals, admiring a deep red one with a luminescent sheen. \"This is beautiful! Where'd you'd find them?\"\nDipper's brain does a thing and he internally freaks out for a second. \"Oh. Um. In the woods.\"\n\"In the woods?\" Mabel echoes.\n\"Yeah! In the woods! Just wandering around, you know?\" Dipper is well aware of the fact that his laugh is hollow and suspicious.\n\"You've been spending a lot of time in the woods,\" Mabel says thoughtfully.\n\"It's fun. There's all this stuff in the journal that's totally inaccurate or just a little off, and he's been helping me make corrections-\"\n\"He?\" Mabel's smile resembles that of a Cheshire cat, and Dipper realizes the mistake he's made. \"I knew it!\" she crows triumphantly. \"Oh my gosh who is it? Do I know him? Is he cute?\"\nDipper blanches. This is a moment he's been dreading and anticipating for some time, and he still isn't ready for it. \"So...yeah.\"\n\"What's wrong?\" Mabel's eyes are sparkling. \"You know you can tell me anything, right?\"\nThis is a little beyond 'anything'. Dipper stares at the floor for a couple of minutes, then holds out his arm and points at his triangle.\nThere's a deafening awkward silence. Mabel's expression shifts from stunned to enraged to suspicious to downright bewildered in less than thirty seconds. \"That triangle guy?\"\n\"Yes.\"\nNow Mabel looks extremely confused. \"That triangle guy??\"\nDipper realizes the main source of her confusion and holds his hands up defensively. \"He's not a triangle all the time! Most of the time he's a guy. Like a regular guy.\"\n\"A cute regular guy?\" Mabel says with a smirk.\nDipper buries his face in his hands, unable to answer. It's an affirmative, and he's realized this for awhile, but coming to terms with having a possibly misguided crush on an occasionally homicidal dream demon isn't the easiest thing in the world.\nMabel places her hand on his arm, and when Dipper peeks through the gaps in-between his fingers he notices a gentle yet concerned smile on her face. \"Dipper. It's okay. Is it okay?\"\nDipper nods. \"He's...different with me. He's...\"\n\"Kind, supportive, and genuinely seems to care about you as a person?\"\n\"You're pretty good at this, Mabel.\"\n\"Angel of Love!\" Mabel announces proudly.\nDipper lowers his hands slowly, although he still avoids making eye contact with his sister. \"Yeah. He started dropping in on me after the thing with that guy you wrote the sock opera for.\"\n\"Dodged a bullet.\"\n\"And,\" Dipper says quietly, because he's well aware of how crazy it sounds, \"He hasn't tried to kill me or hijack my body since then, so that's a bonus.\"\nMabel looks less than reassured at that. \"Are you sure it's okay?\"\nFor four years Dipper has spent almost half of his time in Gravity Falls exploring the woods and finding new material to write about and study and staring at the stars picking out constellations in the night sky with Bill Cipher at his side, ready to protect, irritate, or comfort him in turns, and for better or worse Dipper is convinced that he has nothing to fear, not anymore. And he knows that if he could stay in Oregon even after summer wanes and fall sets in, he would in a heartbeat. \"It's okay.\"\nMabel still seems a little worried, but she accepts Dipper's confident answer with a soft sigh. \"Does he have an imprint, too?\"\n\"I don't know.\" Dipper's never really checked, partially out of courtesy but more recently because he isn't sure he wants to know. After all, if against all odds his name somehow appeared on the demon's body somewhere he's sure Bill would have mentioned it by now. \"I've never asked.\"\n\"So...are you gonna tell Mom and Dad?\"\nDipper isn't entirely sure how to bring up the fact that he's kind of falling in love with a dream demon, much less tell them about anything that comes of it.\n\"Yeah...not yet.\"\n-\nTelling Mabel is more of a relief than Dipper expected it to be, and he regrets not telling her sooner. Nothing changes apart from the sudden influx of relationship advice and good-natured ribbing that always leaves him flustered, and it's nice to have someone to discuss the situation with.\nAnd it is rapidly becoming a situation given that Dipper is now incapable of behaving like a normal guy not trapped in a constant paroxysm of teenage awkwardness and longing whenever he's around Bill, even for a moment. It reminds him of how goofy he was around Wendy five years ago, tripping over both his feet and his words, except now it’s worse because he knows how obvious he’s being -- and Bill, like the asshole he’s always been, feeds into it with little modesty (Dipper doesn’t think he knows what that word means). It’s a visible evolution of their interactions when he was a few years younger; whereas it’s never been completely innocent now there’s an element of flirtation that leaves him breathless from time to time. It’s very different from the rudimentary hugs and kisses and flimsy pillow talk from the only romantic relationship he’s ever had.\nThe lingering touches and soft fingertips against his cheek and blatantly lascivious grins all come to a head the day before he and Mabel head back to Piedmont; they’re walking through the woods at twilight again with the fireflies hanging around their heads and Dipper’s feeling incredibly self-conscious and hyper aware of every word that leaves his mouth.\nThen it all ceases to matter whatsoever when Bill stops abruptly, backs him up against the trunk of a nearby tree and captures his lips in a deep, passionate kiss that makes the world around him disappear; there’s nothing but the warm body pressed against his and the rough bark scraping against his lower back where his shirt has ridden up a little and the slightly cool tongue slipping between his lips and mingling with his.\nWhen they finally part, mostly so Dipper can catch his breath (he’s sure it doesn’t matter one way or another to Bill) he gazes up at the golden eye watching him with a hungry gleam that makes him shiver in the most delightful way; before he has time to even consider what to say in response those lips are against his neck, tracing a line of kisses along his collarbone, and talking takes a backseat for awhile.\nBy the time he manages to make it home he’s really glad Mabel isn’t in their room, for a number of reasons.\nThe next day he has to force himself to walk up the steps onto the bus, continually looking back at the tree line with a wistful look in his eyes. Mabel seems to understand what’s going on, and she spends the entire ride home doing her best to cheer him up and letting him sleep off the temporary bout of depression on her shoulder.\n-\nThe summer of their junior year in high school brings a new change, this time for Soos. His longtime girlfriend Melody moves out to Oregon and Dipper and Mabel end up helping plan a wedding -- or rather Mabel does. He, Candy and Grenda are responsible for the actual setup. It’s the most eccentric ceremony he’s ever been involved in or witnessed: it takes place on the lawn outside the Mystery Shack, Waddles is both the ring bearer and the flower pig, Dipper’s the best man with Mabel serving as the overly enthusiastic wedding coordinator, and the reception involves copious amounts of cold cuts and the mechanical badger-fronted band from the mall. Regardless, everyone has an amazing time, Wendy makes it out with her new boyfriend in tow, and Stan actually cries (while claiming he has glitter in his eyes, which is entirely possible with Mabel’s decor but everybody knows the truth).\nWatching Soos and Melody try their hand at dancing makes something in Dipper’s stomach twist; even if the names on their wrists don’t match, it’s obvious that for the two of them it isn’t and has never been an issue. Soos lifts her up in the air and Melody laughs, with her train swishing behind her and he really can’t imagine either of them with anyone else. They’re perfect for each other, anyway.\nPerhaps imprints and matches and soulmates aren’t assigned on a one to one ratio, he muses, while nursing a glass of the champagne donated by Pacifica’s parents. They’re no promise or a virtual red string of fate, but a suggestion of one possibility whose existence doesn’t preclude that of any others. Maybe there are two other people out there that are better for Melody and Soos than they are themselves, but they’re happy, and they clearly love each other, so does it really matter? Even if Mabel and Pacifica never met each other, there’s a good chance that they would have found someone else that made them just as happy as they are now.\nLife is weird.\nHe pushes up the sleeve of his tuxedo and runs his fingers over his own imprint, tracing the lines of the triangle  -- they’re flawlessly straight, equidistant from the eye in the center. Somewhere in the world, there might be someone with his name on their inner wrist, wondering if they’ll ever meet him. Or maybe the logogram is a replacement for a name -- Bill, and any names it’s derived from can’t be that ancient, can they? Linguistics isn’t something he’s invested much time in. But he’s also never heard of any species other than humans with imprints, and no matter what form he decides to take, Bill isn’t human, either. Does he even have a soul?\nThe eye at the center of the triangle stares back at him, mocking him as it has for seventeen years, only twelve of which he’s understood what it is.\nMaybe two years of mindless servitude won’t be so terrible, as long as he gets to spend it with someone he’s pretty sure he loves. Although a ‘no using my body to commit murder’ clause might be negotiable.\nSomewhere across the lawn a group of female voices erupt into cheers and hoots of encouragement; apparently Mabel’s caught the bouquet.\nHe’s sure it’ll be in the paper tomorrow.\n-\nAs the reception winds down following a rousing sendoff for the happy couple involving sparklers, Dipper slips past the tree line into the woods, still donning his tuxedo and just a bit tipsy from the champagne. He hasn’t been afraid of being out there alone at night for the past couple of years, and after so much time spent weaving through the trees his feet know the way to his destination: the pond where Bill found the flower for him so long ago. He’s not entirely sure why he’s headed there - it just seems right.\nThe moment he steps into the small clearing around the pond he’s stunned by the sight awaiting his arrival.\nThere are numerous flowers, their golden petals unfurled into a net of stars nested into the soft grass. There are seemingly millions of fireflies drifting lazily through the balmy air, but upon further inspection they’re tiny motes of light casting a warm golden glow over the pond and around the trees. It’s breathtakingly beautiful.\n“Whatever the occasion, I could definitely get used to this.”\nDipper blames the alcohol for the way he topples over into Bill’s lap, somehow having missed the demon sitting in the soft grass, leaning against a trunk. At least this time he doesn’t yelp like a startled puppy.\n“I was in a wedding that included a pig, a goat, and a mechanical badger earlier,” Dipper explains, attempting to right himself, but the arms that encircle his body prevent him from making much progress.\n“Are those uncommon elements?” Bill sounds genuinely intrigued, and Dipper raises an incredulous eyebrow.\n“Wait a second. You’ve never been to a wedding?”\n“Not as an invited guest.” There’s that flash of canine and split-second crimson spark in his eye that Dipper has grown used to, and he shakes his head.\n“I don’t want to know. And no, not really.” He gives up on trying to extricate himself from the demon’s embrace and nuzzles into it; if you can’t beat ‘em, join ‘em. “Soos and Melody were cool with it, though, so I guess it doesn’t matter if it was weird or not.”\n“You humans and your marriage contracts,” Bill says, sardonically.\n“What, not enough bloodshed for you?”\nBill smirks. “A contract of devotion requires a sacrifice, carving the name of your intended onto your bare chest with a needle anointed with the blood of a virgin, and speaking the words of a soulbond.”\nDipper pauses for a second before answering. “That seems unnecessarily hardcore.”\n“Not particularly.” The demon sounds completely flippant over his explanation; Dipper supposes it’s an ordinary day for him.\n“What kind of sacrifice?”\n“Nothing big.” Bill shrugs. “A deer works fine.”\nAnother momentary silence, and then Dipper soldiers on, ignoring his misgivings. “Have you ever done it?”\nBill looks down at him with that indecipherable expression. “Of course not. Your contracts are temporary and easily broken at an embarrassingly steady rate. I’m talking about something more permanent.”\nDipper focuses on a single mote of light a few feet above his head, because eye contact is out of the question. “...do you have a soul?”\n“In a sense.\"\n“What about imprints?\" \nThe response is exactly what he expected, but it’s still a little disappointing. “This is a human shell, Pine Tree. I’m not human. You know that, right?”\nThe emotion simmering in his chest boils over, and there’s a sort of desperation in how Dipper forces his way out of Bill’s grasp, sitting up and pulling up his sleeve. “You said you know what this says, didn’t you?”\n“I did,” the demon says impassively.\nDipper is trembling now. “If...if this isn’t your name, then what does it mean?”\n“That service doesn’t come cheap.” Bill’s eye glitters of its own accord. “What are you going to give me for it?”\nDipper blames it on the alcohol, but he knows he’s lying to himself; he wraps his arms around the demon’s neck and kisses him. He’s not as experienced with his tongue as Bill, but what he lacks in experience he makes up for in enthusiasm. He breaks away and is both surprised and awed by how dazed the demon looks. It’s not every day (or month, or year) that he manages to render someone like Bill speechless.\n“I don’t care what it means or whether it stands for you or not. I just want to know.”\nHands seize his wrists, and in a confusing flurry of motion Dipper finds himself flat on his back with the grass tickling his neck and Bill leaning over him. His top hat’s gone, leaving his mass of blonde waves free; his golden eye shines with an intensity that rivals those of the points of light floating all around them, and his usual composure is absent. “Are you sure you want to offer  yourself?” he asks, voice husky with audible arousal. “You know what I am. And I don’t intend to share.”\n“I don’t want you to,” Dipper whispers. “And yes, I do.”\nA fingertip trails over his lips. “Are you sure you can trust someone like me?”\n“I do.” Dipper gasps as the demon’s hand moves elsewhere. “I trust you.” He doesn’t have an explanation for why, and it’s not just because he’s way too interested in what that hand is doing -- he doesn’t know. It doesn’t matter.\n“And you do understand what I’m going to do to you in the very near future, right?” The roving hand finds its way beneath his clothes and Dipper’s next words come out in a desperate moan.\n“I do. I want it.”\nBill grins, and the sharp teeth are there. “I can tell.”\nIt’s an incredible effort trying to break through the fog in his head, but Dipper manages to force the question he’s been dwelling on for so very long. “Do you…”\n“Do I?”\n“Do you love me?”\nThe moment the words leave his mouth Dipper’s nerves tense up; he can’t bear the thought of the answer being anything other than an affirmative.\nHe isn’t disappointed.\nBill rolls his eyes, as if the answer’s the most obvious thing in the world. “Of course I do.”\nDipper’s vision blurs with tears. “Oh.”\nThe demon runs a finger over his imprint, then leans down to press a gentle kiss against it -- followed by his tongue darting out to trace the sides of the triangle. “What this means is that you were made for me. You are, and always have, been mine.”\nShame’s three sheets to the wind; the tears coursing their way down Dipper’s cheeks are those of joy. “Does this mean we have to do the thing with the animal sacrifice and the virgin blood?”\n“Oh, that? I was lying.”\n“...you asshole.” Dipper cries with dismay.\nBill laughs, and then proceeds to fuck him senseless in a bed of paopu blossoms.\nDipper doesn’t return to the Shack that night. Or for most of the next day.\nHe doesn’t mind.\n-\n“So this is it.”\n“Yep.”\nMabel wipes the dust on her hands on her sweater; it’s been years since the attic’s been cleaned thoroughly, and with Dipper moving in indefinitely it was high time to take care of the dust bunnies lurking in the corner.\nFor all their post-graduation excitement a pall hangs over them; in a few weeks they’ll be parting for more time than they’ve ever been away from each other. As expected, Mabel’s following Pacifica to study abroad; the Northwests have finally cracked and warmed up to their daughter’s plebian girlfriend (helped in part by Mabel’s infallible cheer but mostly by the fact that her artistic skill has resulted in rising to prominence outside of her relationship with Pacifica; some people don’t change too much). They’re sponsoring her education at some fancy college somewhere in Europe where Mabel will wear her sweaters and glitter barrettes and continue to be Mabel, because Mabel doesn’t change either.\nPacifica seems to prefer it that way.\nIn contrast, Dipper’s aspirations lie in the other direction. He’s decided to move into the Mystery Shack to keep Stan (and Waddles, by extension) company and lend a hand at the Mystery Shack now that Soos isn’t around as often, while studying a mesh of creative writing and communications at a local college. The journal’s expanded to a journal and three notebooks at this point, and even though he’ll be facing a world of ridicule (potentially; cryptozoology’s still a pseudoscience but it’s not as maligned as it used to be) it’s time to turn his longtime hobby into a career.\nThat’s the explanation on paper for everyone but Mabel, who knows the other half of why he wants to stay in Gravity Falls. “You know you have to tell them eventually,” she comments, setting a stack of books on the nightstand.\nDipper glances over at her from where he’s fiddling with a clump of wires. Setting up a wireless router in a wooden tourist trap in the woods is proving to be a real pain in the ass. “After the soulbond ceremony, I promise. I haven’t managed to get ahold of a proper sacrifice yet.”\nMabel knocks the stack of books off the table in alarm, then glares at him when Dipper bursts out laughing. “He’s a bad influence.”\n“Of course he is. He’s a demon, remember?.”\nMabel wings a paperback at him, and Dipper throws a pillow; setting up the attic grinds to a halt while they temporarily revert to the younger versions of themselves, leaving maturity behind for awhile.\nLater they’re sitting on the ledge watching the sun set. Mabel sighs. “I’ll miss you, Dippin’ Dot.”\n“Me too.” Dipper looks over at his sister and returns her smile. If he’s honest with himself he’s already experiencing separation anxiety, but it’ll pass in time. He’s anticipating a slew of text messages and pictures and calls from halfway across the world, with his tales of the weirdness of the town he now lives in in response.\n“I’m going to send you a sweater every week.”\nDipper has a brief mental image of his room covered in boxes of sweaters. “Mabel, that’s 52 sweaters a year. I don’t need 52 sweaters.”\n“Once a month?” \nIt’s still excessive, but it’s a massive improvement. “That’s...better?”\nMabel bolts up, clasping her hands against her chest with excitement. “Oh! If I send Bill a sweater, do you think he’d wear it?”\nDipper doesn’t know how to answer this question. “Um...he’s more of a suit and tie kind of guy, but probably. I think he likes you.”\nMabel beams. “Can I meet him? Like, not as a triangle. The guy you’ve been making out with. Unless you’ve been making out with him as a triangle.”\nDipper buries his face in his hands. “I’ll ask,” he mutters.\n“I mean, one day he’ll be my brother-in-law. That’s kind of cool.”\n“I think you’re getting ahead of yourself,” Dipper sighs. “I’ll ask.”\n“Ask, and you’ll receive.”\nDipper has given up on trying to overcome being easily startled. After all - some things don’t change.  \nMabel squeals excitedly, leaping up to greet the demon sitting beside her on the ledge. “Dipper, you didn’t tell me he was cute cute!”\n“What’s the difference?” Dipper snaps, glaring at both of them.\nBill ignores his irritation, extending his hand to Mabel; she takes it and giggles when he plants a chaste kiss on top of hers. “Hello, Shooting Star. You’ve grown into quite the lovely young woman.”\nMabel giggles again. “Oh, you!”\nDipper is torn between feeling unjustifiably protective over Mabel and annoyed at how polite his stupid demon boyfriend is being with her instead of him. “I hate you both,” he grumbles, but as his two favorite people (or, more accurately, favorite person and favorite dream demon) settle into a conversation about sweater preferences he has to smile.\nAfter a while Mabel crawls back through the window, leaving the two of them to their own devices. Once she’s gone Bill invades his personal space as usual, tackling him and pinning him against the ledge.\n“When are you leaving?” If Dipper didn’t know any better, he’d swear the demon actually sounded worried.\n“I’m not,” he says; his heart skips a beat at the unfettered expression of glee on Bill’s face.\n“Good. Welcome home, Pine Tree.”\nEvening falls around them, while Bill holds him close humming their song into his ear, and Dipper can't imagine being anywhere else than where he is now."
}