{
    "id": "347350",
    "url": "https://archiveofourown.org/works/347350?view_full_work=true",
    "author": [
        "worldaccordingtofangirls"
    ],
    "title": "What Meets the Eye",
    "rating": "Mature",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Sherlock (TV)"
    ],
    "relationships": [
        "Sherlock Holmes/John Watson"
    ],
    "characters": [
        "Sherlock Holmes",
        "John Watson"
    ],
    "additional_tags": [
        "Prompt Fic",
        "Oneshot",
        "de-anon",
        "Amnesia"
    ],
    "language": "English",
    "series": "",
    "published": "2012-02-26",
    "completed": null,
    "words": "8,249",
    "chapters": "1/1",
    "comments": "718",
    "kudos": "32,307",
    "bookmarks": "5,782",
    "hits": "341,017",
    "summary": "<p>Amnesia is just another case to solve. Piece together unfamiliar faces, reconstruct the old identity, the lost reality. A challenge that Sherlock could even enjoy. He can read people like books. The man with the silver hair is his boss. The tottering old woman, his landlady. The girl with the worried look in her eyes…infatuated. And as for John Watson? His husband. Obviously.</p>",
    "notes": "<p>De'anon from <a href=\"http://sherlockbbc-fic.livejournal.com/15638.html?thread=91763222#t91763222\" rel=\"nofollow\">this prompt</a> at the BBC Sherlock kmeme. </p>\n<p>A mild sexual situation, fluff, and probably some bad amnesia clichés.</p>\n<p>(Also um hello Sherlock fandom. This is my first work around here; I hope to contribute a lot more later on. Nice to meet you all. /waves)</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
    "text": "His eyes open; surely of their own accord, for he cannot imagine how he might have opened them himself. There is an ache at the back of his head; he recognizes little else except for the pain and the unpleasant sharpness of consciousness. Not the starched sheets drawn up to his chin, not the plaster ceiling, not the sterile glow of the hospital room and the chatter of the monitoring machines, nothing. Not even the man who sits in the armchair across from the bed and seems to shed fifty years when he meets his gaze, the creases about the corners of his eyes and his mouth coming undone in an instant.\nThe man leans forwards over the bed, making as if to run his hand through his hair. He stops halfway there, held back. By what?\n“Sherlock,” he says tentatively.\nSo that is his name.\nSherlock blinks. The man is wearing an oversized wool sweater that smells of mothballs, of coffee, of fear. Fear. For him? Perhaps. He dismisses the thought as irrelevant. What matters is that sweater; it must be winter. Winter. Sherlock takes a moment to turn the word over in his mind. Winter. The ideas of cold and grey swirl into his mind. Winter. But London is always cold and grey, he thinks next, and then recalls that London is where he lives.\nBut who is this, he wonders, blinking again.\n“Are you alright?” asks the man. “How do you feel? You gave us quite a fright, you know.”\nSherlock is rescued from answering by the cry of the door. A young woman rushes inside; she is a flurry of brown hair and crackling laboratory coat and pinched lips and worry. She jerks to a stop at the rail of the hospital bed, and the man lifts a hand to the small of her back, making a soft hushing sound from the back of his throat. Is she his wife?\n“Oh Sherlock,” gasps the young woman, and he realizes that she cannot be the wife of the man, not when she is already so helplessly infatuated with him; the panic in her voice and the flush that rises to her cheeks and the singing of her pulse when she squeezes his hand – tentatively, as if it were somehow precious or fragile – spell her heart.\n“Oh, Sherlock!” she wails again. “Thank goodness you’re safe. I came the moment I heard.” She bites down ferociously on her lower lip.\nSilence for a moment, fractured by the whirr of the monitoring machines and the labored come and go of the young woman’s breathing. Finally, the man shifts forwards.\n“Molly,” he says softly. “Molly. He seems to be just fine. Trust me, I’m a doctor.”\nSo this man is his doctor? Impossible; he is not wearing a medical coat. Coincidence? Sherlock takes a brief glance at his hands. They are brown and battered, the skin turned to sandpaper by calluses. They must have once been often used in strong sun; perhaps they are so worn from tying stitches, or changing bandages?\nOh, what Sherlock would give to hear his name!\n“Yes,” he manages finally, and his voice emerges dry and crackling, as if his throat were covered in dust. The man starts. “I’m fine.”\nThe man nods and shifts one of his hands to Molly’s forearm, rubbing up and down in an effort to soothe her. She sucks on her lower lip; she is the type of girl who quivers with excess self-awareness even when standing completely still.\n“It was very sweet of you to come,” says the man eventually, “but I’m sure Sherlock needs his rest. Besides, the hospital visitor hours are about to close.” He stands, and one hand falls to his thigh, pressing for an instant. An old habit? But why? “I should be going, as well.”\nMolly nods and trembles from the room. The man hesitates at the doorknob, glancing back uneasily at the hospital bed. He is obviously grappling with indecision. What troubles him? Sherlock feels parched for want of knowledge.\n“Goodnight, Sherlock,” says the man eventually. There is a curious scratch in his voice. “I’ll be back tomorrow.”\nSherlock can only nod. He does not trust himself to speak; he has not yet ascertained how people expect his character to react, how they expect him to look at the world. The man does not seem alarmed; he only runs one hand through his hair and opens his mouth again.\n“John?” Molly startles them both. “John, are you coming?”\nSo John is his name, then. But still the question remains: who is he?\nOr better: who is anyone?\n-\n The next week brings a myriad of visitors. There is the tottering Mrs. Hudson; she must be his landlady, judging by how she prattles on about the state of the flat, wherever that may be. There is Lestrade, the man with the silver hair and disgruntled expression, from whom Sherlock learns his own profession: an amateur detective, as emphasizes Lestrade’s subordinate, a young woman with perpetually pursed lips. They are clearly sleeping together; she takes pains to hide the marks at her throat, and he is too careful not to brush against her when they leave the room. Sherlock treats them coldly, and they do not seem surprised.\nHe has also discovered the circumstances of his malady: apparently, he had been conducting a dangerous experiment when the chemicals reacted incorrectly. He fainted from the fumes and struck his head quite badly on the edge of the kitchen table. He suffered a concussion, explained the doctors, but nothing worse. He has to keep from laughing when he hears this.\nIf only they knew that he can remember nothing.\nThe visitors come and go, a blur of unfamiliar faces twisting in concern or distaste, and yet he easily discerns the identity of each and every one. Such seems to be his talent. It is the man who stays, who dozes upright in the armchair at the side of the bed, who swallows the bitter hospital coffee in the morning, who argues with the doctors and checks Sherlock’s pulse and forces him to eat, who confounds him.\nNobody will tell him who John Watson is.\nAnd when he is allowed back to the flat, the situation only grows more perplexing. It would seem that he and John share the place; the furniture is a jumble of personalities, the walls peeling with hidden stories that Sherlock itches to uncover. He has been confined to his bed, but once John has left to purchase some groceries, he rises and begins to wander about the apartment, searching, but for what? He has harbored the quiet hope that something will jog his memory, that he will be broken from this dreamlike world which does not seem to belong to him, but as he runs his fingers across the spines of crumbling old volumes and hesitantly presses his palm into the cushions of the sofa, as his fingers find the slender bow of a violin and – much to his surprise – draw out a few whining notes by the windowsill, it becomes increasingly apparent that this will not happen.\nJohn comes home to find Sherlock tucked defeated beneath the sheets, lost in the mist of the unknown past that he may never realize.\nBut John cannot know this, of course. That would ruin the puzzle.\nSherlock is quickly seized with the need to uncover the identity of John Watson. Over time he gathers that John helps Sherlock with his detective cases, that he otherwise works at a nearby medical clinic, that he has a sister, that he is a war veteran, that he blogs. But this is not enough, and Sherlock begins to understand that he does not want this emotionless profile; he wants to experience John, to taste his heart, his motives. Why, his agonizes, why? Why does he share this flat with Sherlock? Why does he look at him so carefully, hesitantly, sometimes gently, sometimes angrily?\nWhy does he care for him so unconditionally?\nWhile Sherlock is bound to his bed, John brings him tea, coffee, books, his laptop, anything, whatever he asks. He tolerates complaints and he tolerates erratic periods of taciturnity and he does not ask for thanks. If Sherlock talks, he replies, and does not flinch when Sherlock returns with cutting fragments of sentences. Several times, when he thinks Sherlock is asleep, he smoothes back the hair from his forehead with a startlingly tender hand. He forces him to eat. He laughs.\nHe looks at him with soft eyes.\nWhen Sherlock is almost healthy, when he has learned his way around the flat and can flawlessly tune himself to the expectations of others, they eat at the breakfast table together and fight over the newspaper. John surrenders if Sherlock will eat half an egg. Sherlock concedes and John smiles with warmth that he can feel against his cheek.\nThen it occurs to him and he nearly leaps from his chair in victory, too thrilled to feel strange or question his revelation.\nJohn Watson is his husband.\nObviously.\n-\n Now that he has discovered his role in this intricate theatre of unfamiliar faces, Sherlock must do all he can to play the part well. He is not daunted but rather intrigued by the idea. The flat is not uncomfortable and John is not unlikeable; perhaps he can hollow out a space for himself here, regardless of his memory. And even if he cannot, at least he can enjoy the thrill of experimentation for a time.\nThe series of deductions falls into place effortlessly: John is his husband, so Sherlock consented to marry him. Therefore, he was quite in love with the man. The idea does not seem impossible; his mind wastes no time worrying over sexuality (merely chemical, that), and John is not unlovable. However, it soon becomes obvious that they are not an affectionate sort of couple. John does not drop kisses on his cheeks or forehead, only sugar cubes in his coffee, and he looks alarmed when Sherlock smiles at him one morning over his mug.\n“What’s gotten into you, eh?”\nSherlock shrugs and catalogues the data for later reference.\nWeeks have passed. He is finally released from his bed and for once John does not seem perplexed by his good mood. He makes bacon for breakfast and Sherlock eats a slice and a half; he looks so pleased that Sherlock wonders if he will kiss him. His heart is still pounding when John leaves the table. He marvels at the blood rushing thick and hot to his fingertips. They spend the day roaming about London. The city has the insubstantial familiarity of a dream.\nSherlock nearly stumbles in his façade when evening falls and, wandering back towards Baker Street, they stop at a restaurant that he should know. He panics – our favorite restaurant, where we first met, perhaps the proposal spot? – but John seems oblivious to his lapse of composure, and he has the time to deduce that the place is nothing more than an old haunt. It is shabby and John is relaxed, and the owner booms and beams at them fondly. It is nowhere special, just familiar. Or so it should be. He is relieved when they return to the flat, the more sharply-defined reality.\nSince his release from the hospital, John has dozed at his bedside, waking him every few hours, making him walk a few paces to ensure that his concussion has not taken an unseen toll. Sherlock assumes that the upstairs bedroom goes unused; such is the behavior of married couples, is it not? But John looks stricken when he tries to stand from the bed and Sherlock catches his hand; his pupils dilate and Sherlock can see color rush to his neck. His own breath catches. Has he made a mistake? Impossible; he swallows the pounding of his heart. Impossible.\n“You’re not going to stay?”\nThe color spills from John’s neck to flood his cheeks. He opens his mouth. His pulse sings, a startled bird trapped beneath Sherlock’s thumb. He blinks slowly; his chest seems to swell. An unsteady exhale buoys his reply to the ceiling.\n“Alright.”\nAnd he removes his socks.\nSherlock rolls over and closes his eyes. He feels the mattress sink and the sheets draw more tightly across the bed. John fumbles noisily with the lamp for a time, and then they are enveloped in darkness. The silence is fractured by his breathing; he is far from sleep. For the first time it occurs to Sherlock that they will eventually have to perform sexual intercourse. Oh.\n“Sherlock.” John’s voice carries that curious scratch again. Sherlock is still not entirely sure of its meaning. “Sherlock, what -”\n “Hush, John,” he interrupts, forcing the panic from his tone; he will need more time to prepare for that. He rolls across the bed to meet his gaze. “I’m not in the mood right now.”\nEven in the almost-darkness, he can see John’s jaw slacken in shock. Do they really have sex that often? Sherlock will have to do some research, evidently. He realizes with a jolt of shock that the idea sends his heart into his throat again. He swallows thickly and turns away, drawing the sheets closely around himself.\n“Goodnight, John,” he manages, shuts his eyes. Silence stretches between them, and then Sherlock feels a hand come to rest at his forehead, feels fingers tentatively smoothing back his hair. His heart stutters.\n“Right, Sherlock,” whispers John, voice still scratching. “Goodnight, then.”\n-\n The world remains nebulous and strange, and John remains the lone anchor in the murk of the dream. Sherlock wants to breathe him in like cigarette smoke, to touch and taste him, to absorb the unique tangibility that is John. He finds that his hands wander; his fingers dance over the bumps of his spine, the dip of his lower back; they linger too long at his wrist, trapping the frantic metronome of his pulse. John occasionally asks what’s gotten into him; more rarely, he returns the touch, smoothing the curls back from Sherlock’s forehead or letting their fingertips bump together for an instant. But he is always wary, as if Sherlock might shatter to bits beneath his hands, as if the jagged fragments might dig into his skin.\nBut how Sherlock likes touching John!\nPerhaps it is because John is familiar and sharply defined; perhaps it is because the Sherlock lost in the gloom of his memory is fighting back into his consciousness. Perhaps it is because John spells his heart in boldface whether he means to or not; perhaps it is merely because John is there. Regardless, Sherlock lies awake at night tracing shapes over the strong lines of his back; he marvels at the sharp angles of his shoulder blades, the powerful curves of his hips, the gentle slope of his stomach. He listens intently to the rhythm of his breathing and thinks what luck that he married such an intriguing man.\nAfter another few weeks, Sherlock takes up work again to combat the restlessness and the pain of unfamiliarity. He finds the cases thrilling and the people disgustingly stupid. Lestrade – the silver-haired man from the hospital room – can scarcely function for his idiocy, and his subordinates are worse. In fact, it seems the entirety of Scotland Yard is dull and listless, while the criminals boast admirably sharp and interesting minds. Only John is bearable. He is hardly quicker than the rest, and yet he is indispensable. Sherlock will not work without him.\nSoon there is an ugly murder; John crouches by the body and says the woman was asphyxiated, though there are no fingerprints at her throat, no traces of inhalation. Sherlock struggles to disguise his pleasure. John will have none of it and scolds him, but his eyes shine. They gather evidence, they test theories, and Sherlock berates John when he fails to meet his deductions halfway. They shout and throw things and John banishes Sherlock to the couch several times.\nThey have never been happier.\n Or at least as far as Sherlock is aware; it seems improbable, but perhaps lost somewhere in the recesses of his subconscious exists some memory of a time when they were still more engrossed in one another. John never talks about their relationship, so Sherlock knows agonizingly little. How did they meet? Where did they go on their first date? When did they have their first kiss? Then Sherlock realizes that he does not know what it is like to kiss John at all.\nHe cannot stand not to know something, let alone something to do with John Watson.\nThey solve the case and quiet settles over Baker Street. Sherlock takes to lingering at the windowsill and worrying his violin; John reads and blogs. They sit on the sofa for hours with their computers on their laps and their hands wound together. They don’t speak. They don’t need to.\nTouching John is no longer an essential part of Sherlock’s role; rather, it is an essential part of Sherlock.\nAt some point, the indistinct grey shroud of evening falls over the shoulders of London. John orders food, turns on the telly, sets the kettle on the stovetop. When he sits down again, Sherlock unthinkingly shifts closer and grazes his temple with his lips. John stares at him. His throat convulses in a swallow. And then he kisses Sherlock.\nThe kiss is gentle and firm at the same time. It fits his personality. He tastes like tea. Sherlock sighs. He closes his eyes and tries to memorize the taste of John Watson on his lips.\nAt last.\nThey break apart and return to opposite sides of the couch. John reaches for his hand. A comfortable silence settles on their shoulders. They do not need words. Their fingers intertwine. John turns up the volume of the telly.\nSherlock, for his part, realizes that he is falling in love.\nNever has he missed his memory so much.\n-\n Their relationship is simple. They wake early. Sherlock might find himself nestled into the crook of John’s shoulder, breathing against his skin, or John pressed into the hollow of his chest, his hands curled on his ribcage. More likely, however, they are on opposite sides of the bed, enjoying the singular peace that comes with familiarity. They know each other too well to be uncomfortable with separation.\nThe irony therein is hardly lost on Sherlock.\nThey shower and dress, and John makes breakfast, forcing Sherlock to eat a few bites as he fiddles with his laptop or the newspaper. He circles the table, dropping two cubes of sugar into his coffee and a kiss at his temple. Sherlock smiles and dissolves the sugar, the edge of his spoon singing against the mug. John unfolds the newspaper with a flourish. Mrs. Hudson usually totters downstairs around midmorning; she flutters about clearing dishes and reorganizing their silverware drawer, huffing and scolding and pinching their cheeks until they glow. Once she has departed, they gather the evidence files and leave for work.\nAt one point, John remarks on how much calmer life has become, and Sherlock can only give a noncommittal nod. How should he know what life was before?\nThe days blur together. John still seems tentative, uncertain; he still bites down on his lower lip whenever he reaches out to touch Sherlock. Sherlock wonders if he has always been this way, or if the accident made him oversensitive. He wants to show him that he will not shatter, but he misses his memory more than he would like to admit, and some days he feels very fragile indeed.\nThey kiss spontaneously, impulsively. Even Sherlock cannot predict when. Sometimes, it happens at the worst moments: just as John lifts a cup of tea to his lips, just as the cabby pulls up to the curb, just as Sherlock bends over to inspect a corpse. Other times, they have better luck: pressed up against the kitchen counter, in the back of the cab (where John lifts his hand and curls his fingers into Sherlock’s hair), walking back to Baker Street after a case has been solved, when their lips taste like adrenalin and victory. After these kisses, John smiles at him.\nThey never mention their marriage; they do not need words. John’s eyes speak for them both.\nOne Sunday, Sherlock wakes late and descends to find a strange man enthroned in their living room instead of familiar John frying eggs at the stove. He stares until John pokes his head from around the corner and gestures at him with a spatula. Sherlock’s stomach turns. Is he supposed to know this man?\nHe circles the armchair and sits down on the sofa, tucking his bathrobe beneath him. He locks eyes with the man and his heart stammers.\n\nMycroft.\n\nFor the first time, the name occurs to him on its own. His jaw falls slack. Mycroft is his brother. Mycroft annoys him very much but he is unfortunately necessary. And then Sherlock feels dizzy. He sees a little boy with a shock of dark curls clinging to an older boy by the hand. He hears the laughter of the other children, tastes the dust of the playground bitter on his lips, burns with hurt and frustration. He cannot understand why they cannot understand him. He sees a lanky teenage body, feels the starched collar of a graduation gown chafe his neck, the rush of cocaine streaking through his veins. He tests his intellect, researches, cracks cases. He finds an apartment. 221B. Sherlock curls his hands into the couch cushion. He knows what comes next.\nAnd then it stops. The memories drop off abruptly. The dream envelops him again. Sherlock wants to scream in frustration. Instead he smiles stiffly at Mycroft.\n“What do you want?”\nMycroft sighs as if he has just been dealt a mortal blow. He starts talking; Sherlock pays him little attention. The past two decades of his life have been returned to him in an instant. What will it take to regain the rest?\nJohn soon joins them with three cups of coffee and a tray of sugar cubes. Sherlock wants to kiss him. But more than that, he wants to remember him, everything about him. Now he knows it is not impossible.\nWhen Mycroft leaves, Sherlock sweeps John into his arms and kisses him until neither of them can breathe, think, wonder, forget, remember, anymore.\n-\n Summer billows warm and rainy into London and Sherlock wakes to realize that six months have passed since the accident.\nIt is one of those mornings when he and John wake up on opposite sides of the bed; late on a Saturday with rainy sunlight trickling through the windowpane to puddle silver on the floor. Sherlock is comfortably warm. John is quiet except for the rise and fall of his shoulders, the whisper of his breathing across the pillow. His back is turned. Sherlock – unsettled by having lived so long in a world he doesn’t remember - wants to reach for him, to touch the anchor in the dream, absorb his tangibility. He rises onto one elbow.\nFor once he is uncertain as he scoots across the mattress and tentatively winds one arm down around John’s waist. The gentle rhythm of his breathing stutters and Sherlock pauses, but John only sighs and presses against his stomach. He is still asleep. With bated breath, Sherlock carefully splays his fingers across his stomach, tests the swell of his abdomen, the nuances of his ribcage, the thrum of his heartbeat. Then all at once he buries his face in the crook of his shoulder and a sigh of immeasurable satisfaction escapes his lips.\nJohn stirs and Sherlock can feel his eyes fluttering open, smell his confusion as he orients himself, taste his surprise at finding arms snaked around his waist and curls pressed against his neck. John has become all five of his senses. Sherlock draws him closer. Six months in a cloudy world. Without John Watson, the agony of unfamiliarity might have sapped him of strength long ago.\nSherlock’s gratitude lodges in his throat.\n“Good morning,” says John thickly. “What’s all this, then?”\nSherlock shrugs and dares to press his lips to his neck. John stiffens in his arms.\n“Relax,” mumbles Sherlock. His skin tastes soft and human, like tea and sweat and sleep. John gives a shuddering exhale. He turns and Sherlock can see the questions forming on his lips; he kisses him and tastes the how, the why, the what now? Oh, John is brimming over with questions.\nBut he and Sherlock do not need words.\nUsually John ducks his chin. Usually he braces his palms on Sherlock’s chest, breathes into the hollow of his throat. Usually he melts from his arms –\n(Sherlock attributes this to fear, delicacy, any number of things)\n - but that morning, he stays. His fingers wind into Sherlock’s hair; he opens his mouth; one hand drops to the soft spot at the brittle curve of Sherlock’s hip. Sherlock feels dizzy. The light outside the window weakens; rain sings against the roof. He is breathless; that must be why he feels so desperately compelled to inhale John.\nFingers dance down his spine. Lips press against his jaw, his throat, his collarbone, the dip of his navel. The world is real; John closes his mouth and the world is blindingly real. Sherlock feels his back snap from the mattress. An unborn gasp scorches his throat.\n\nJohn.\n\nHis orgasm is raw and razor-sharp with reality. He cannot keep himself from clutching at John, digging his nails into his shoulders, pulling him down, as he fades back onto the mattress. He just scrapes together the decency to return the favor; John shivers into his shoulder, his name falling from his lips to shatter on the pillowcase.\n\nSherlock.\n\nIt is a fragile thing indeed.\nAnd yet, lying there struggling to breathe, Sherlock thinks that he might not be unhappy even in this unsubstantial reality. John exists. Can he not subsist on John alone?\n“Thank you,” he breathes, with the dreamlike slowness of a sleepwalker.\nJohn turns and smiles, ghosting his fingers ghost the slender arc of Sherlock’s jaw. Sherlock swallows and leans into the touch. Sleep clings to him, sticky and soft. John welcomes him into the circle of his arms and he settles against his chest. The rain falls harder, a thousand drumbeats overhead, in tune with the heartbeat beneath his cheek. His lost reality suddenly seems impossible to recover from the fog of memory. He swallows. John pushes his damp hair back from his forehead. The rhythm of his breathing is familiar and Sherlock sighs in unabashed relief.\nHe can be happy like this.\nIn light of this realization, what happens next is infinitely more ironic.\n-\n Summer trickles away through their outstretched fingers. They solve cases. They scour London and come home to watch crap telly and hold hands on the middle cushion of the squashy old couch. They stay up late into the night analyzing evidence. Usually they are very efficient, but every once in a while they remember how close they are standing and fall into each other. Then the cases take longer to solve. It is worth the trouble.\nSometimes, Sherlock wakes and John is already gone, but the whisper of eggs frying on the stove is as good as his lips against his ear. Other times John stays and then his lips really are against his ear, his cheek, his forehead, his mouth, whispering without speaking. They ask each other a thousand questions without a single word. Sherlock has fallen in love.\nHe does not remember the feeling. In the odd twenty years of his life that he recalls, he never knew it. Perhaps he remembers the occasional flicker of affection for Mycroft; there was also some warm sort of connection with their mother. He remembers feeling secretly grateful to Lestrade. But never has he been in love. He greets the feeling cautiously. It is an uncomfortably new acquaintance.\nAnd because of it, Sherlock is reintroduced to fear.\nHe remembers the feeling differently. Once, when he was six or seven, he was alone in the house and felt uneasy. Another time, Mycroft fell and broke his arm at the elbow. Their mother was uncharacteristically unsettled. Clutching her hand in the hospital waiting room, Sherlock had felt his stomach twist.\nBut this feeling is different.\nIt is strange and wild and consuming. It is an infection planted in his heart that spreads through his whole body. It is an epidemic. It is the trill of his cellphone in his pocket. It is the moonlight reflecting wanly from the trembling water. But most of all it is John, scarcely able to breathe past the bomb strapped to his chest.\nSherlock’s hands are shaking.\nMoriarty waltzes onto the scene and extends his hand to Sherlock for a dance. His fingers ghost the trigger. John is gasping for air. Sherlock can taste the acrid flavor of his fear. His heart pounds. John. It is John who hangs in the balance. And yet it is also John who lunges for Moriarty, clutches death close to his chest, begs for Sherlock to run with a wild look consuming his face. Love drives him. He will die for it.\nIt is then that Sherlock meets terror.\nThere is no small talk; the feeling grabs hold of him without so much as an introduction. It possesses him. It fills his mouth and nose and eyes and ears. He is fixated on John, on the tiny red dot wavering on his forehead. He sees his own expression reflected on his face when Moriarty grins and his eyes flicker upwards momentarily. It is not hard to deduce.\nThere must be a red dot trembling on Sherlock’s temple, too.\nJohn lets go of Moriarty.\nArtful detectives and villains as they are, they strike up a conversation before getting down to the business of death. They speak evenly, only raising their voices to be heard over the ragged come and go of John’s breathing. Sherlock knows the game well; in fact it is predictable until Moriarty turns and saunters away. For once he is dumbfounded, but has no time to wonder before he is tearing at John, ripping away his coat and the explosives, reassuring himself that he is warm and alive, clutching at him even as he plucks at his sleeves and gasps not to be so frantic, it’s alright, they’re safe.\nSherlock only just begins to believe him when Moriarty returns for another dance. The next few moments are a whirlwind. Then he is pointing his gun at the pile of explosives. He is pointing the gun and John is reaching for his hand. Their fingers are winding together. He can feel the trigger digging deeper and deeper into his skin. The slightest pressure would do it. John presses down on his palm with one hand.\n Sherlock presses back with both.\nThey are consumed in flames. Sherlock is vaguely conscious of a deafening roar. Savage heat swirls around them. His mouth runs impossibly dry. The world seems to crumble away beneath their feet. In an instant the entire universe takes on the same dreamlike quality that has tortured Sherlock since the accident.\nAll that is real is John’s hand.\n-\n He feels the concrete. He blinks and sees debris and the glassy skin of the swimming pool. He tastes ash on the tip of his tongue. He smells singed hair and clothing. He hears John gasping beside him. Their hands are still joined as if melted together by the flames. His palm is sticky. Sherlock feels a weight on his chest, but more oppressive than anything is the weight of memory.\nThey met some time ago. They shared the flat on Baker Street. This was back when John walked with a cane and was reluctant to join Sherlock. His leg improved and his attitude changed. He smiled more often; he went through some number of girlfriends. They were never married.\nJohn Watson is not his husband.\nSherlock rises slowly to find John already propped up on his elbows. Blood drips from his forehead but he is smiling rakishly. Victory. Sherlock looks at him in relief and he remembers everything; for a moment he cannot move. He groans and presses his face into his hands. He hears John shift forwards in concern, his hand on his arm: are you alright? Sherlock cannot catch himself in time.\n“You’re not my husband,” he whispers. He wants to bite his tongue. For a moment there is silence. John chuckles cautiously.\n“No, I’m not. Never have been.”\nSherlock gazes at him emptily. His brow furrows. Neither of them considers their current situation: injured at the crumpled ruins of an old swimming club. The police are probably already halfway there.\n“What…” John bites down on his lower lip. “What of it, then?”\nSherlock knows he should be quiet, but his hands are shaking. His shirt is torn and there is a burn twisted into the skin of his stomach. His head swims with pain and exhaustion and fear. John is not his husband. He has made a fool of himself.\n“I thought you were,” he gasps. John seems at a loss for words. “After I struck my head I couldn’t remember a thing about you,” he continues. His voice hitches wildly every few words. “I tried and tried to figure out who you were. It was hard; you weren’t easy to deduce like Molly or that fellow at Scotland Yard or the landlady. Then I…well. You always brought me tea, and you put up with me, and sometimes when you thought I was asleep you would…touch my hair, and the way you smiled at me, I…” He glanced up at John helplessly. His face was blank. “It seemed only logical to think that you were my husband.”\nJohn is silent. Sherlock panics. Words begin to stumble from his lips.\n“So I decided to act along, invite you into bed with me, hold hands every once in a while, maybe mention our wedding or an anniversary, things like that. I was relieved when it became evident that we weren’t an affectionate couple. There was no need to discuss our relationship. But I was wrong. I was wrong…” He pauses a moment. Something occurs to him and he gazes up at John with wide eyes. “I was wrong, but John…you didn’t push me away. You were always skittish; I just assumed it was part of your personality, but you…you never pushed me away…but why…when I was wrong…” He stops. John’s mouth has formed a thin line. “Oh.”\nThe silence seems an eternity. The water laps gently against the sides of the pool. They breathe.\n“Oh,” repeats Sherlock quietly. “So you were in love with me from the beginning, then.”\nJohn looks down. He laughs miserably and presses two fingers to his temple. Sherlock watches him curiously.\n“Fantastic,” gasps John eventually. “Just fantastic. I really should have known better. Of course it was nothing but an experiment to you. No, not even that. Only you would keep amnesia a secret for fun, Sherlock. You were just doing what you thought was expected. You were playing a part. It was a game. We were playing charades like children. Nothing about it was real. Terrific.” He stands. There is blood on his palms. The sound of human voices erupts into the air and he glances over his shoulder. “The police. We will need to go to the hospital. You can barely sit up. I’ll go say hello.”\nHis eyes are sad; he turns to leave. Were Sherlock not so dizzy with pain and shock he would’ve reached out to stop him. He wants to scream in frustration but his throat is cracked and dry. John is wrong. He doesn’t know. He needs to know.\nSherlock was in love with John from the beginning, too.\n-\nThe hospital is another one of those dreamlike realities, just like the ones produced by the amnesia. Hard colors like white and silver blur soft at the edges. Juxtaposition. The voices of the nurses are gentle. The whine of their heels against the tile hurts his ears. There is the stifling reek of antiseptic, the cool dry palms of the doctor as he turns Sherlock from his cot onto the examination table. There is the biting cold of the stethoscope against his chest, the dull pain of the injection in his arm. Ointment wet against his stomach. He drinks a cool liquid. There are voices. The rush of water. Exhaustion tugging at his arms and legs, morphine sucking away his consciousness.\nThe last thing he registers is that John is not at his side.\nHe wakes parched. The nurse brings him a plastic cup of water and he drinks desperately. He sets the cup down on the nightstand and glances at the other bed in the room. An old man is sleeping beneath the starched white sheets. Not John. Sherlock deduces his illness to hide his disappointment. His face is ravaged and grey as ash; the rise and fall of his chest is labored. One of his knurled hands is curled into the sheets. A gold band glints on his ring finger; it has not been polished in years, but Sherlock cannot bring himself to believe that he was an adulterer. He decides instead that his wife died years ago and he has been slowly wasting away from grief ever since.\nThe old man’s eyes flutter open. Sherlock shifts.\n“Good morning,” he says. The man smiles and the wrinkles at the corners of his eyes pull upwards. No, he could not have been an adulterer. “I’m sorry,” adds Sherlock before he can help himself. “They don’t realize that it’s inevitable, do they?”\nThe man looks at him in surprise. “How did you know?”\nSherlock cracks a smile. “It’s always obvious to me, I’m afraid.” He chuckles sadly. “How long?”\n“Sixty years,” answers the man. “Sixty years and I was never bored.”\nSixty years. An eternity. Without knowing why, Sherlock asks: “And what was is like? To be with her so long, I mean.”\nThe old man lifts his gaze to the ceiling. His face clouds with memory. Memory. Only now does Sherlock understand the value of such a thing.\n“She just existed,” begins the old man. “She was there in the morning and still there in the afternoon and in the evening and stealing my pillow at night. I breathed for her and she breathed for me. I’m sorry, it’s hard to describe…” His voice swells with a chuckle. “We never talked about it much, you see. We didn’t have to. We were rubbish for words, anyways. We knew each other as we knew ourselves. She was familiar like the back of my hand. Is that the old saying? Or was it different?” He shakes his head. “Irrelevant. She was always there. Her presence grew to be both as essential and unnoticed as…as the presence of my heart, or my lungs. We never remember that they’re there keeping us alive.” He smiles. “They simply are. They just exist. So did she.”\nHe falls silent. Sherlock’s head has begun to swim with pain and morphine and the pounding of his heart. He feels the sear of the burn at his stomach more sharply. He opens his mouth to reply, but his voice cracks. His lips are dry again. Suddenly, a nurse materializes and presses him back into the pillows. She gives him a fresh injection and the curtain falls on the dream of the hospital.\n-\nHe wakes again after some time. Brittle bars of sunlight spill in through the hospital windows to shatter into razor shards of gold on the tile. Late afternoon. The burn wound only hurts him vaguely. He turns over and sees that the other bed is empty.\n To his surprise, his eyes fill with tears.\nAnother nurse swoops into the room just as he finishes wiping his eyes on the edge of the sheet, bewildered. He prays she will not give him another injection. He wants to be awake; he feels fine, albeit thirsty. Always thirsty. She brings him another cup of cold water and does not try to fill his veins with morphine. He takes an instant shining to her. She is jotting down notes on a clipboard when he dares to ask for John.\n“Watson?” She purses her lips. “Short? Little cardigan? Bandage about the head?”\n\nSherlock nods, heart pounding. Admittedly, he isn’t sure about the bandage, but the rest seems to fit. The nurse smiles.\n“He was in just an hour ago. Sat about watching you for a bit. Sighed a lot.” She plucks his wrist from the mattress and takes his pulse. “Friend of yours?”\nSherlock chuckles sadly. “Of sorts.”\nThe nurse furrows her brow. “Your pulse is racing all of a sudden,” she says, and presses her palm to her forehead. “How do you feel?”\nSherlock shakes his head. She drops her hand. “Like a fool,” he replies. “I’m afraid I’m rather unaccustomed to the feeling.”\nShe surveys him for a long moment. Her hair is bright red, obviously from a bottle. Her mouth is thin and determined. There is a spray of freckles across her nose. Dark shadows beneath her eyes. Unmarried. A strong and exhausted woman.\n“I’ll go ask for Watson right now,” she says eventually. “I spotted him moping about in the waiting room not half an hour ago.”\nSherlock gapes. “You…”\nOne corner of her mouth quirks upwards. “You’ll be good as new in a few days, Mr. Holmes. It’s my job to help people with pain, you know.” And with that, she whirls from the room.\nOrdinary people astound him.\nTen minutes later and the door opens to admit John. He looks rumpled and mortified. His hair is matted and dull. His eyes are exhausted. His ratty purple cardigan and grey oxford are filthy and wrinkled. There is indeed a bandage wrapped around his forehead. He has been subsisting on coffee and hospital pastries nicked from the tray by the secretaries alone. He is worried and angry, palpably caught between the two emotions. Sherlock aches with love.\n“John,” he says. “You’re alright.”\nJohn sighs and comes to his bedside. He reaches out to wrap his fingers around the railing but stops and stuffs them into his pocket. “In a sense,” he says. “How do you feel?” He speaks politely, detachedly, but the flicker in his eyes betrays him. Sherlock stares into his lap.\n“Thirsty,” he replies quietly. “I haven’t stopped being thirsty ever since I arrived here.”\nJohn obligingly fills the plastic cup and hands it to him. Sherlock sips slowly. He feels that so long as the water lasts, John will stay. He has some ten ounces of liquid to make an irreversible confession. Perhaps the most daunting challenge he has ever faces.\n“John,” he says eventually. “John…have you been here all this time?”\nJohn starts forwards; anger and shame crackle into his expression. “I…well, yes. I’m a doctor. I could hardly just leave you here.” He stares at his hands. “Don’t misunderstand me.”\nSherlock sees an opportunity. “Ironic that you would say that,” he says quietly, “when I might ask you to do the same.”\nJohn looks at him sharply. “Misunderstand you? Tell me, Sherlock, what is there to misunderstand?” His voice breaks and he bites down on his lower lip. “Look, I don’t know why you’re bringing this up again. I was going to stay and make sure you were alright. Then I was going to find a new apartment and move out. We were going to forget about everything.”\nSherlock laughs out of an infuriating combination of love and frustration. “Oh, John,” he sighs. “John, I never want to forget anything again.”\nJohn colors. “Right. Of course you wouldn’t…want that.” He looks away. “I’ll just go, then. I’m sure I can find another place without too much trouble.” He says it so easily; his expression is veiled. Sherlock just imagines the idea of Baker Street without John Watson and is left nearly breathless with pain\n“John, no.” He unthinkingly reaches for his hand. “Don’t you understand? I thought you were my husband and so I decided to fall in love with you. I was…terrified, frankly. I had no idea what would happen. To forge such a feeling seemed…impossibly daunting.” He stops for a long moment. John’s hand is limp in his grasp. He presses his thumb into his palm, feels the rush of his pulse. “It was easier than I imagined. And then one day sitting on the couch I realized that it was easy because it was real.”\nJohn stares at him. Half the water is left in the cup. Sherlock takes a frantic gulp.\n“I had fallen in love with you. Without even…without even trying, and so deeply that when you attacked Moriarty I thought I would die of fear. You had become like…” He pauses. “Like the back of my hand, or is that how the saying goes?” He shakes his head. “Irrelevant. You just existed. You still do. I sincerely believe you always will. And John…” He inhales deeply. “When I woke with my memory back, I remembered two things. The first is that you are not and never have been my husband. The second is that…the second is that I have loved you from when you first looked at me and weren’t repelled by my mind. From when you smiled and said fantastic. From when you remembered two sugars in my coffee after two days. John Watson…” His voice is thick. “John Watson, I daresay that I have loved you from the start.”\nAnd rather than look at John, he tips back the plastic cup and drains it.\n\n-\nThree days later sees them on their way back to Baker Street. Sherlock is eager to see the flat again, this time with his memory returned. He wants nothing more than to run familiar eyes over familiar books and furniture and peeling wallpaper, and is positively delighted by the fact that he can finally explain the bullet holes and yellow spray paint on the far wall.\nJohn is just as happy. They hold hands in the back of the cab and his pulse is steady and content. Sherlock wants to tune himself to the consistent rhythm; he is as nervous to return to the flat as he is eager. Mrs. Hudson did him a great service over the past two days; now this favor rests heavily in the jacket of his trench coat. John has forgiven him. John kissed him over the hospital bed and tasted like stale coffee and relief. But Sherlock cannot forget the old man, and although it is not like him to become so attached to material symbolism, he fingers the little box through the silk lining of his pocket as if it were about to disappear.\nThe cab stops and they step onto the street. Sherlock pays as John takes the suitcase he brought to the hospital from the trunk. They exchange a smile before John walks to the door and fits his key into the lock. The door swings open and he steps inside. Sherlock doesn’t follow. John turns back to ask whether he’s coming or not and Sherlock can see his heart unfold on his face.\n“I…” He stares at the ring. Surprise. Disbelief. Fear of believing. Helpless joy. Fear of joy. More joy. Fear of disappointment. A wild glimpse of hope. “I…is this what I think it is?”\nSherlock rolls his eyes. “You really are daft,” he murmurs fondly. “What else would it be?”\nJohn takes the ring. “You’re not down on one knee.”\nSherlock snorts. “Ridiculous, that custom. I don’t want to make a scene or dirty my trousers.” He meets John’s eyes. “Nevertheless, will you?”\nJohn slips the ring onto his finger. A simple gold band. It fits well.\n“Will there be a ceremony?” he asks anxiously. Sherlock actually laughs aloud and the sound is a mixture of relief and happiness and exasperation.\n“Can you honestly imagine that?” he asks softly, reaching for John’s hand and turning it over gently. They have both forgotten that they are standing in the middle of a doorway in full view of the entire city. John shakes his head laughingly.\n“Ourselves, at the altar, perhaps in matching tuxedos?” he suggests, eyes following the path of the grey sunlight over the curve of the ring. Sherlock laughs again.\n“Positively adorable,” he murmurs. The laughter fades from his voice. “Thank you, John.” He takes him by the collar and kisses him briefly. Their fingers wind together.\n“For what?” breathes John when he pulls away, lips slightly parted.\n“Not quite sure myself,” replies Sherlock as they step into the building, hands still joined. He can feel coolness of the ring and a wild smile breaks onto his face. He kisses John again in the foyer. “I’d just rather like to thank you.”\nJohn grins and they kiss a third time. Then they go upstairs and put away their luggage, and John puts the kettle on and Sherlock opens his laptop and they bicker. The ring glints in the ashy sunlight, and the dreamlike reality has ended. They are finally home."
}