{
    "id": "35397454",
    "url": "https://archiveofourown.org/works/35397454?view_full_work=true",
    "author": [
        "dancing_homestuck"
    ],
    "title": "Who Did What Now?",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "One Piece"
    ],
    "relationships": [
        "Roronoa Zoro/Vinsmoke Sanji"
    ],
    "characters": [
        "Roronoa Zoro",
        "Vinsmoke Sanji",
        "Usopp (One Piece)",
        "Nami (One Piece)",
        "Tony Tony Chopper",
        "Nico Robin",
        "Franky (One Piece)",
        "Brook (One Piece)",
        "Monkey D. Luffy"
    ],
    "additional_tags": [
        "POV Third Person",
        "Dinner",
        "Marriage",
        "Fluff",
        "Attempt at Humor",
        "Please don't at me about the title",
        "idk either",
        "no beta we die like men",
        "Tooth Rotting Fluff",
        "Secret Relationship",
        "Relationship Reveal",
        "Implied Sexual Content"
    ],
    "language": "English",
    "series": "",
    "published": "2021-11-29",
    "completed": "2021-12-22",
    "words": "14,530",
    "chapters": "3/3",
    "comments": "372",
    "kudos": "11,742",
    "bookmarks": "2,084",
    "hits": "101,027",
    "summary": "<p>“Hey, Zoro, I don’t think I’ve ever asked before – do your earrings mean anything?”</p>\n<p>Zoro rolled his eyes and turned back to his food, shrugging. “No real meaning to ‘em. Just exactly what you see: three swords. Thought it looked cool.”</p>\n<p>“What about the other one?”</p>\n<p>Zoro just grabbed a fork full of rice. “Wedding band.”</p>\n<p>--</p>\n<p>Or, the one in which the strawhats find out that somehow, at some point, RORONOA ZORO, local grump and all around non-romantic, is literally MARRIED</p>\n<p>Zoro and Sanji do some splainin</p>\n<p>Literally just fluff and goop</p>",
    "notes": "<p>I was trying to be funny, I swear. Hope you like it xoxo</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Not me actually finishing a fic like I promised. </p>\n<p>Anyway, here's the promised second chapter (Which is, for some ungodly reason, almost twice as long as the first one) and then also an epilogue because I finished the second chapter and STILL hadn't used the pieces of writing that wanted to use when I started this, lol</p>\n<p>Fair warning, this gets heavier for a lil second in here, but I think it's still pretty funny, lol</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>Hope you enjoyed! Goopy goopy goopiness in the epilogue</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>Anyway, this concludes this fic, thanks for reading, sorry if you got cavities from the sweetness, byeeeeeeeeeee</p>\n<p>Thanks for reading! Comments and Kudos always appreciated!! Second part will be out relatively soon; it'll be Sanji and Zoro doin some splaining (and, hopefully, a lot of cute flowery romantic images of their wedding)</p>",
    "text": "               Dinner was incredible as always. Fish caught earlier that day served with garlic rice, potatoes, rolls, and sautéed vegetables all topped with a tangy glaze. The texture of each side dish complimented the main course, each presenting a slightly different note in the same melody. In all honesty, Usopp, who largely fed himself off of what he could decipher from his mother’s cookbook, probably wasn’t actually cultured enough to truly understand just how good it was.\n               “The meal is awesome, Sanji,” Usopp complimented, piling his plate high with seconds before Luffy could take it all for himself. He might not have enough culture to understand, but he could still appreciate and show it. He tried his best to compliment Sanji for every meal they had, especially since Whole Cake. He refused as a matter of pride to take the cook and all his prowess for granted.\n               Around the table were noises of agreement, hums around food and a, “SUPER delicious!” from Franky, pose and all. Sanji preened at the attention, finally sitting down with them after the matters of his kitchen were attended to for the moment.\n               “I’m glad it’s to everyone’s liking,” he said, a small and sincere smile on his face. Usopp admired how Sanji could be proud of his work yet still humble when he received compliments. Usopp himself still had no idea how to balance that sort of thing, all too often letting things go to his head until he was swiftly reminded of the reality of limitations he lived in. He should really be taking notes.\n               From next to him, Usopp noticed Zoro looking up from his plate. He caught Sanji’s attention, making direct eye contact. Usopp braced himself. Direct eye contact was how wild predators started fights, and when it came to those two it was exactly the same.\n               “Food’s good, cook,” Zoro said lowly. It was rare for Zoro to use actual words to compliment anyone, especially Sanji. Usually, he used undecipherable grunts to communicate, especially at meals.\n               Instead of preening at Zoro’s compliment, as he had the others, Sanji rolled his eyes and gave him some kind of look.\n               Usopp really didn’t understand. From the surface level, it looked like Zoro paying Sanji a rare word of appreciation. According to both their body language, though, it was like Zoro had tried something and Sanji was exasperated about it. Zoro smiled smugly back.\n               “Chew with your mouth closed, you cave man!” Sanji said.\n               “Sure,” Zoro said around his food, clearly not doing as told.\n               It was a predicable exchange, one Usopp could set his watch by, but he has never truly understood the actual logic of how communications between them worked. How did they pick what to fight about? How did Sanji read Zoro’s flat tone? How did Zoro manage to find the exact worse time to do something? It’s like they were flawlessly synchronized but chose to clash perfectly rather than harmonize. Even after all this time, those two were a complete mystery to him.\n               As Zoro returned to his meal, the movement of his head made his earrings ring together, drawing Usopp’s attention despite him being plenty used to the sound. Three long, thin tear drops in gold pierced in succession up one ear. There was also a simple gold cuff sat high in the cartilage of the same ear. Zoro had always had the three dangling piercings as long as Usopp had known him, but the cuff was newer, though Usopp couldn’t exactly place when he got it. It wasn’t like he kept track of everyone’s personal body jewelry choices. He wondered if either of them meant something in particular. Zoro could sometimes surprise you with how deep something seemingly innocuous ran. And, unlike whatever Zoro and Sanji’s little rivalry was about, he could actually relatively harmlessly ask about it.\n               So, he did.\n               “Hey, Zoro, I don’t think I’ve ever asked before – do your earrings mean anything?”\n               Zoro turned to him with a raised eyebrow, the motion making his earrings chime again.\n               “We’ve been sailing together for how long and you haven’t ever thought to ask before?” Nami said from across the table.\n               “Have you ever asked?” he countered, eyes narrowing at Nami.\n               Nami pouted at him and crossed her arms. That was a no, then. Usopp stuck his tongue out in victory, because he was a man and that was an appropriate, adult response.\n               Zoro rolled his eyes and turned back to his food, shrugging. “No real meaning to ‘em,” he said around a mouthful of fish, quickly slapping a stretchy arm away out of pure instinct, “Just exactly what you see: three swords. Thought it looked cool.”\n               “Huh,” Usopp said, shrugging as well. He deflected the hand that went for his food after failing to get Zoro’s. He kind of figured that was all, but theoretically there could have been a cool story there.\n               “What about the other one?” Nami asked, apparently interested. She gestured with her hand to her own ear, pointing to the shell of it right where Zoro wore the gold cuff.\n               Zoro reached up, absentmindedly rubbing at the piercing.\n               For a moment, he didn’t say anything. He only looked up at Sanji seated directly across from him. Usopp watched as they shared some sort of telepathic conversation. That happened sometimes. He imagined little lines of electricity connecting the two, crackling as they battled for mental dominance.\n               Sanji lifted a brow, Zoro’s face remained exactly where it was, completely expressionless. Sanji narrowed his eyes in a glare, Zoro remained exactly the same. Sanji rolled his eyes, Zoro remained exactly the same. Sanji let out an exasperated sigh. “Fine, fine, just stop with the puppy-dog eyes,” he finally said, waving off the matter with a hand and returning to his meal.\n               Usopp blinked at the two. That was… unexpected. Not only did it not make any sense for Zoro to look to Sanji about answering a personal question, but Sanji seemed to have just given some sort of permission? And not offered to separate Zoro’s head from his body? Not to even mention that Zoro’s face looked absolutely nothing like a puppy’s, so where Sanji was getting that Usopp had no clue.\n               Zoro also returned to his meal as if that odd happenstance had never even occurred.\n               A moment passed. Usopp’s leg started bouncing, curious. Zoro said absolutely nothing.\n               “…Well?” An almost impatient voice said, sounding from further down the table. It was Brook, who apparently had tuned in to their conversation as well.\n               “Well, what?” Zoro asked, eyeing him.\n               “What does your fourth earring represent?” He asked. “All your quiet has made my heart pound in anticipation, though, I suppose I don’t actually have a heart, yohohoho!”\n               “Oh,” Zoro said, as if realizing that the rest of them could not, in fact, read minds, and therefore did not, in fact, understand his aside to Sanji. Which, by the way, was still weird.\n               Finally, Zoro just shrugged again, grabbing a fork full of rice. “Wedding band.”\n               “Ah,” Usopp said mildly, “You think wedding rings are the most common type of jewelry out there? Since even people who wouldn’t ever think of wearing necklaces or bracelets would still wear one? Then again, maybe there’re enough people who like jewelry but won’t do the whole marriage thing to balance it out. I mean, you don’t look like the type for either, but here you are with three earrings and a…” Wait. “Wedding…” Hold on just a second. “Band…?”\n               Usopp stopped his runaway mouth, words finally turning into concepts and ideas.\n               Wedding band? Marriage? Zoro!?\n               Usopp whipped his head around to stare at Zoro so fast that he heard something in his neck crack. He’d care about that later, though. This took precedence.\n               Everyone but Luffy, Sanji, and Zoro had followed suit, stopping their meal and staring at their stoic, unyielding swordsman who had, to Usopp’s knowledge, never looked at another human being with anything nicer than neutrality before in his life, let alone romantic interest.\n               “Wh-what the hell do you mean wedding band!?” Nami yelled, breaking the silence.\n               Zoro looked up from his dish mildly and shrugged – shrugged, at a time like this! – and said around a mouthful of food, “Can’t really do rings, it’d just get all beat up. And a necklace just hanging there would be used to choke me. So, you know. Earring,” he flicked the little cuff harmlessly, “It works.”\n               “I guess I can see the sense in that…” Chopper said, nodding to himself, yet still seeming shell shocked.\n               “Screw the logistics!” Usopp said, standing suddenly, unable to take all of Zoro’s dodging. Or is it teasing? There’s no way this is real, is it? He’s just pulling their leg, right? “Having a wedding ring means that you’re married!”\n               Usopp tried to imagine Zoro in some picturesque cottage out by the sea. He’d herd goats or something. His loving spouse would cook and together they’d care for their four children, living happily.\n               Zoro would literally hate that.\n               “Yup,” Zoro said simply, as if that was any kind of a reasonable response. A small little smile grew on his face, looking actually rather pleased with himself. Like he wasn’t just married – as if that was even a possibility – but happy to be, too.\n               Usopp felt like tearing his fucking hair out.\n               “Whoa, whoa, whoa, whoa, Zo-bro,” Franky said, butting in, “You can’t seriously be saying that, at some point, you found someone you wanted to marry. Like, together forever marry? And then actually did it? Without inviting any of us?”\n               Zoro scoffed, “Don’t see how my romantic relationship is anyone else’s business. And I’m telling you now, aren’t I?”\n               Usopp’s head was reeling. Has he ever heard Zoro even say the words “romantic” or “relationship” before? Zoro was a man of steel and harshness. Sure, Usopp knew very well by now that there was a special little soft spot in him that he only showed to a select few, to his nakama, and even then, only so very often, but this was a whole other league. Zoro has a secret relationship that is so important to him that he got married and now wears his ring everywhere he goes? And now he’s talking about it openly like it’s no big deal?\n               “Bu-but… When!?” Nami cried, seeming just as flabbergasted as Usopp. He’s glad he isn’t alone here.\n               “Little after Wano. Some spring island,” Zoro answered.\n               That was a stupid answer, though, because Wano was well over a year ago.\n               “You don’t even remember the name of the island?” Sanji snorted, acting far too casual considering the impossible thing happening.\n               “I was busy,” Zoro replied in a deadpan.\n               “Uh-huh,” Sanji said, a mocking smile playing on his lips.\n               Usopp didn’t know if it was best to be mocking Zoro about this. If it happened. Which it probably didn’t. He was actually fairly convinced this was all a fever dream, to be honest.\n               “The Minello Isles?” Nami asked with a far-off look, brow furrowing. Leave it to their navigator to figure out which island Zoro could possibly mean. Usopp tried to think back, finding it difficult. They just came across so many little islands – not to mention not-islands like floating cities and traveling groves of vegetation – between their larger adventures and this one had been, reportedly, over a year ago.\n               “The ones with the hot springs?” Chopper chimed in. A memory clicked in place, then, of a cluster of spring islands in full bloom. They were littered with natural hot springs and all the tourist attractions they came with. The log pose had taken two weeks to set, so they had an unusually long amount of time to enjoy their stay.\n               Usopp mostly remembered spending time with Franky investigating some of the unique properties of the mineral deposits brought up by the springs. He also did his fair share of bathing and relaxing with everyone else, too.\n               Usopp tried to place Zoro there, on one of the idyllic islands. Showered and clean, his usually unruly green hair combed back and smoothed, dressed in a black tux with a bow tie. A red carnation poked out of his pocket. He stood at the top of one of the blooming hills, forcing himself to be patient yet clearly eager, as he nervously waited at an alter for his dearly beloved.\n               It was an actual impossibility.\n               “What a beautiful venue,” Robin said, sounding uncharacteristically dreamy. Oh god, was the weirdness spreading?\n               “Though it would be unfortunate if you were to fall into some of the less hospitable pools,” a smile coming to her face, “I understand their acid is… quite corrosive.” Usopp sent a prayer of thanks to literally anything listening. She was normal. Creepy, but normal.\n               Franky suddenly broke out in tears. “Zo-bro,” he cried, blowing his nose into a handkerchief (Usopp’s pretty sure he only programmed himself with tears and snot for the effect rather than true medical necessity), “That’s so super of you to commit to someone like that.”\n               “Do you even know how to talk long enough to say proper vows?” Nami asked. The words themselves sounded like an insult, but one look at how she tugged at her hair revealed that she was closer to incredibly anxious on Zoro’s behalf.\n               Zoro scoffed at her, offended nonetheless, “I managed.”\n               Sanji snickered.\n               Usopp couldn’t even conceive of what vows Zoro would say.\n               “A point of order, if I may,” Brook said, raising a boney hand and addressing Zoro directly, “Was this an actual wedding? That is to say, was there some sort of minister there to perform the ceremony, or any witnesses? Not that it truly matters, of course, as we are pirates who have no need for rules such as those.”\n               Yes, now someone was talking. Maybe Zoro was just fucking stupid. Maybe he thought if he liked someone and put an earring on and then literally told absolutely no one about it, they’d be as good as married. He has a funny working brain like that, it was actually not unprobeable.\n               “Luffy did it,” Zoro said.\n               “LUFFY!?” The table yelled, now swiftly changing focus to their captain.\n               Luffy sat at the head of the table, rubbing his full belly. Usopp looked down at his own forgotten plate. It was empty. Typical.\n               “Huh?” Luffy asked, aware now of the sudden attention since his feeding frenzy was finally over.\n               “You officiated Zoro’s wedding!?” Nami demanded.\n               “I did?”\n               Usopp sighed and rubbed his face. If Luffy really did officiate, then, as a ship’s captain, he would be capable of legally binding them. But it sounds like the affair doesn’t ring a bell. He could strangle Luffy, honestly. How do you wind up with a guy you really can’t be sure would remember officiating his first mate’s wedding?\n               “We bribed you with porkchops,” Zoro reminded helpfully.\n               The use of “we” sent an odd tingle up Usopp’s spine.\n               Luffy’s eyes glazed over, surely trying to parse one porkchop from another. A line of drool dropped down his chin even though he’d literally just eaten, the damn glutton. “Oh yeah!” he finally cried, breaking out in a wide smile, “Those were really good! Sanji, make those again sometime!”\n               Sanji returned the demand with a smile, always happy to hear requests of past dishes. “Sure,” he answered, looking like he was taking stock of their supplies in his head, “Next time we stock up I’ll get the right meat for it. Though, I have to admit, the pork on that island was exceptional. Maybe it had something to do with the hot springs?” Sanji discussed the matter so nonchalantly, as if food was in any way an important topic in this batshit conversation they were having. He supposed that for Luffy and Sanji food was always an important topic, but still.\n               Usopp revised his image of the alter. Now a Luffy in a suit stood before a podium (even in his imagination, Usopp couldn’t muster up a tie for him). Sanji, in a pressed suit even nicer than Zoro’s – not even actually trying to upstage Zoro for once, just happening to by merely being how he is – was off to the side, holding a platter of pork chops for their captain to eat off of as they waited for the final guest.\n               “Wait, wait, wait, wait, wait,” Usopp said, a realization suddenly hitting him, “You cooked the bribes for Luffy?”\n               “Well, duh.”\n               “So, you knew about Zoro getting married!?”\n               For the third time that meal the table went dead silent, everyone staring at their crewmate.\n               Sanji – the absolute rat bastard – had the nerve to shrug.\n               “Of course he did!” Luffy said, all grins and laughing, “He was there, after all!”\n               Well, that sure didn’t compute. It made absolutely no sense. Why, out of anyone on the crew, would Zoro let Sanji – and only Sanji – be present for his goddamn elopement? And then Sanji had said absolutely nothing about it? There was no teasing at all? There was no way in this lifetime that he could have ammunition as fucking good as Zoro getting on one knee and not bring it into literally every argument they have ever had since.\n               Where had Sanji been on that island if not spreading whatever happened at that wedding? There was no way there wasn’t massive dirt there of either Zoro being completely stone faced the whole time or being somehow pathetically romantic (Usopp wanted to puke at the concept). Sanji should’ve been singing about the whole affair for weeks. Now that Usopp thought about it, he hadn’t really seen Sanji those two weeks, though. Then again, each of the little islands that made up the area had slightly different foods – some coordinated tourist thing to encourage people to explore the whole area instead of just the most popular stops – so he’d just written it off as Sanji exploring the cuisine.\n               Had Sanji, what, isolated himself for those two weeks? Because he knew he wouldn’t be able to help but to spill the beans? But why would he care about Zoro’s secrecy though? They fought like cats and dogs! Sanji’s job on deck was first as cook and second as personally-appointed-Zoro-annoyer, (not that Zoro didn’t deserve it; he once watched Zoro walk over to where Sanji was sitting down for once in his life, mumble like three words to the guy, and Sanji’s face immediately flew into such a bright redness that he literally – and Usopp does really mean literally – caught on fire. Sanji had dragged them off to an entirely different part of the ship to have what was almost certainly a fucking hell of a battle.) so why would Sanji ever keep a secret like this?\n               “Luffy!” Nami scolded, breaking Usopp out of his thoughts and bringing him back to the conversation, “Do you even understand how serious marriage is!?”\n               “Sure I do,” Luffy shrugged, picking his nose because he was a literal five-year-old. “They said they’d take care of each other and now they’re doing just that. For like, forever.” If it weren’t for the nose picking and the matter-of-fact tone, Usopp would almost think that was sweet.\n               “Wow,” Chopper said, little stars in his eyes, “So human marriage is about taking care of each other forever?” It was actually sweet to see the little reindeer starstruck at the concept. Usopp guessed that as a doctor, caring for other people meant an awful lot to him.\n               “That’s so SUPER beautiful,” Franky cried, at this point creating a puddle.\n               “That’s why I keep saying no to Hancock,” Luffy explains, still far too laid back for this conversation, “She keeps trying to marry me, but I don’t have time to take care of some lady for forever. That’s just way too long!”\n               “Ah, the beautiful Boa Hancock,” Sanji predictably swooned, hearts in his eyes, “If only she’d asked me to marry her; I would be at her lovely beck and call at this very moment.”\n               Usopp rolled his eyes.\n               “I’m sure she’ll come around again sometime,” Robin said, “Why don’t you ask her then?” Her question was oddly sharp, like a pin looking to spear a butterfly’s wing to cork.\n               “You’re so incredibly bright as always, Robin,” Sanji purred, because he was an idiot, “And so kind to look out for my dreams like that.” Usopp’s not sure exactly what that question was aimed at, but he’s pretty sure that wasn’t it. “Alas,” he cried, dramatically leaning back, his wrist resting on his forehead limply like some sort of damsel, “My hand is already spoken for.”\n               Usopp blinked at him. What? Something here wasn’t processing. What the hell did that mean? Already spoken for?\n               “Sanji…” Nami said, sounding unsure and upset, “…You’re not talking about Pudding, are you?”\n               Sanji’s dramatically anguished face curdled like spoiled milk. “What? No!” he said. Relief washed through Usopp almost before concern had. “Don’t get me wrong,” he continued, recovering, “She’s a beautiful, kind, clever, sweet girl and all, but she’s literally 16. I just… I can’t really feel that way about someone that much younger than me. And I knew her for like a week. A very stressful week. During which she tried to kill me. Which, I have forgiven her for, but still.”\n               There was a collective sigh of relief around the table. Everyone had kind of had their one-on-one time with Sanji about the whole incident, and it seemed so far in the past now, but some wounds run deep. Such clear denial was good to hear.\n               “Then, Sanji-san,” Brook said, “If my ears did not deceive me – not that I have any, mind you, yohohoho! – then I would be led to believe that someone else has laid claim to your heart?”\n               “Wait, yeah!” Usopp yelled, pointing an accusatory finger, “Who the hell else would you get married to?” And since when were they talking about Sanji getting married to someone? Wasn’t this supposed to be an investigation into Zoro’s marriage? How many people on this ship are getting married behind everyone’s backs!?\n               “Ugh, a complete brute,” Sanji answered, now leaning his head in one hand, arm resting on the table, “Literally the opposite of those gorgeous ladies. No soft skin, no delicate hands, no supple curves, no luscious long hair. Pretty much a brick wall in both body and mind.”\n               Usopp blinked at him yet again. What the fuck did literally any of that mean? He can’t comprehend the words, let alone the associated tone. Sanji was supposed to be talking about his spouse (Fiancé? is he saying he’s already married or just promised? What the fuck?) but he wasn’t doing any of his normal twirling. Hell, it sounded a lot like he was complaining, which was so not mister romance extraordinaire like he normally is about love and beauty.\n               As Usopp tried to find anything usable in what Sanji said, a shiver suddenly ran down his spine. He turned to Zoro to see him glaring at Sanji hard from across the table. Usopp shied away, knowing the start of one of their fights when he sees it.\n               “You know, if you didn’t want to, you could’ve just told me no,” Zoro said gruffly.\n               “Hm,” Sanji said, tilting his head in his hand and making a face like he was actually thinking about it, “Should I have?”\n               Zoro’s glare intensified. “I don’t know, cook,” the title is said with shrapnel sticking out of each letter and Usopp could feel a spring somewhere being coiled dangerously tight, “Should you have?”\n               “Hm,” Sanji said again, looking Zoro up and down, examining him. He must be trying to guess what move Zoro will attack him with. Not that Usopp really understood why this is starting a fight between the two, but that’s like half of their fights for him.\n               Suddenly, though, Sanji’s face did something completely insane. It softened into his supporting hand, basically melting into it. His lips became a soft, involuntary smile. His eyes, though, are the biggest change. They fill with a kind of gentle softness Usopp has only ever seen very few times in his life. He’s seen it in his mother’s eyes when she laughed at one of his lies, in Kaya’s when she waved them off, in Ace’s when he bid his little brother farewell. Sanji’s eyes were full of fondness and love. And they were looking directly at Zoro as if they were the only two in the room.\n               “Nah, I guess not.”\n               Zoro blew a bit of air out of his nose in way of a laugh and suddenly his entire miasma of doom dissipated. The spring that was coiled so tightly became a silk ribbon, falling away like nothing. He looked away, towards the table, as if holding Sanji’s soft gaze was simply too much for him. A small smile slipped across his face and Usopp saw his dimples for the first time in what felt like years. His face was dusted pink.\n“Good,” is all he said.\n               That’s it, Usopp decided, this literally cannot be real. Brook’s mouth was on the floor, Robin looked smug, Chopper was whipping his head between Sanji and Zoro trying to figure out what was happening, Nami looked completely shell shocked, Franky had his glasses lifted as he stared in astonishment at the two, and Luffy had fallen asleep at the table. The only logical conclusion he could possibly arrive at is that he tripped, hit his head, and was dreaming all of this in a coma.\n               The only other logical conclusion, if he followed all the clues, read all the signs, was in-fact not logical in the least. If he wasn’t insane or dreaming, then…\n               “Cook-bro…” Franky said, unusually careful, “Did you… marry Zo-bro?”\n               Silence hung in the air for a heartbeat, then another.\n               Then Sanji, without breaking his gaze, dug a thumb under his shirt collar and pulled out a gold chain. Usopp had seen that chain before shining out when Sanji undid a couple buttons on his collared shirts or appearing under the loose collar of the too-big t-shirts he often wears to bed. He’d never thought to ask about it before, nor considered that there might be something at the end of the chain. Yet, as Sanji pulled it from his shirt, it was clear he maybe should have.\n               “Yup,” he said, popping the “p”, and smiled wide like a complete dopey loser.\n               Sitting there on the chain, held up by Sanji’s hand, was a classic, simple gold ring.\n               A wedding band.\n               Zoro’s blush deepened, reaching the tip of his ears, and kissing his own wedding band.\n               Usopp hoped someone outside of his coma was watering his plants.\n“Okay, you two are going to spill every detail!” Nami demanded, fuming over her pudding.\nSanji had by now cleared away the dinner plates and was bringing out dessert. Usopp didn’t always indulge, but this time he wasn’t going anywhere until he got some explanations.\n“Anything you desire, Nami-swan,” Sanji sang, setting in front of her a bowl of yellow pudding piled high with whipped cream, fruit, wafers, and other elaborate toppings. Usopp would think it was an apology if it weren’t for the fact that this was typical of any given Tuesday for the girls.\n“Is that so?” Nami asked with a huff. She dug a spoon into the treat angrily. Usopp saw her eyes light up at the taste and a smile come to her face. She then must have remembered that she was mad, though, because she next stuck her nose up, humphing at the dish. The effect was significantly diminished when she took a second a scoop.\nSanji presented Robin with a slightly smaller but no less elaborate bowl and a cup of decaf coffee. “Thank you, dear cook,” Robin said, stirring her coffee.\n“It’s an honor to be able to serve you, Robin-chwan!” Sanji cried, completely noodling out. The normalcy of it was somehow unnerving to Usopp.\n“Sanji, if I may be so bold,” Brook began, breaking the man out of his heart-filled trance, “Is that truly appropriate? When your paramour is right there?”\nBefore Sanji could answer him, Zoro snorted. He sat back languidly in his chair, crossing one leg over his knee and tossing an arm to rest on the chair’s back. “Why the hell should I care about the idiot fawning over women?”\n“Uh…” Usopp said, staring at him, “Because of the whole… married thing?” Thinking about it, Usopp hadn’t noted any sort of downplay in Sanji’s reactions to women; he still threw himself at the feet of strangers in every town they visited. He also certainly hadn’t changed his opinion of men, as he was currently setting down much smaller and less decked-out desserts in front of all the male crew members.\n“Oh,” Usopp said, speaking a sudden idea out load because he didn’t know how to keep his thoughts on the inside of his head like smart people do, “Unless it’s a marriage of convenience. You know, for tax fraud, or just to change Sanji’s last name.”\nThat kind of thing happened all the time. It’d make sense, then, why they wouldn’t bring it up – if it wasn’t real, then why say anything? That didn’t really match up with Sanji’s look of complete infatuation earlier, but Usopp was still trying to convince himself that wasn’t a hallucination. Or maybe Sanji’s more into Zoro than Zoro’s into him?\n“Hah?” Zoro asked, sounding indignant. Suddenly, the whole room became twenty degrees colder. The swordsman looked down at him, chin raised, a dark shadow cast over his features leaving his one, steel gray eye to pierce into his soul. “You think I’m going to marry someone and not mean it?”\nOh god. He fucked up. Oh god, oh god, oh god. Usopp shrunk back into his chair, throwing his hands up. “N-n-n-no! Of course not!” he cried, already imagining the pain of getting slashed by three swords, “I-I’m sure your matrimony was full of love and respect,” or would he only use one because of how weak Usopp was? “And that you each promised your souls with full sincerity,” Or would he even deign to bloody his swords with him, instead throttling him until his last breath was a distant memory, sending him into darkness forever? “And that your unparalleled dedication to one another’s hearts will be sung of for generations to co-“\nSuddenly, he was cut off by a completely unexpected kick to the face, sending him flying out of his chair and crashing into the galley’s wall.\n“Stop that,” he heard Sanji’s voice say as he saw stars, “You’re being embarrassing.”\n“Right…” Usopp replied, dazed.\nOkay, so it probably wasn’t a marriage of convenience. Noted.\nAs Usopp righted himself, feeling his face for all of its components, Zoro continued where he’d left off. “Asking love-cook here not to flirt is like asking him not to cook. That’s just how he decides to treat women, there’s nothing to be done about it. If I minded, I should’ve picked someone else.”\nIt was weird to hear Zoro talk about Sanji like that. The words themselves weren’t terribly filled with emotion, but the ease at which he talked felt oddly intimate. Zoro wasn’t just spouting bullshit about how he thinks Sanji’s brain worked, he was talking like he knew this was how it was. He was so in-tune, so familiar, that there was no doubt in him that he was simply correct.\nKnowing someone like that… it wasn’t easy, especially with Sanji. He had this uncanny ability to wear his heart on his sleeve and yet keep every detail of himself buried deep. Every glimpse Usopp’s ever gotten into how Sanji worked had always been in times of breakdowns and heavy-hearted conversations, and even those were just snippets of what all was there. To speak of Sanji with such confidence meant that Zoro had to have put a lot of time into being trusted enough to see it all.\nUsopp would be lying if he said it didn’t make him just a little bit jealous – of Zoro for having that trust, and of Sanji for having someone who could earn it.\nHe picked himself up off the floor, making his way back to his seat. He gave Zoro a sheepish smile, now embarrassed at himself for his earlier suggestion. Every minute that passed seemed to prove just how preposterous that idea had been.\nZoro just gave him his usual blankly grumpy look, but Usopp noted that he still had a bowl of pudding at his place rather than it being stolen by the now-awake Luffy in his momentary absence. He ate it gratefully, relishing the mango-vanilla taste. He definitely wasn’t tearing up even a little.\n“Besides,” Zoro said, finishing up his thoughts on the matter, “I’m not the jealous type.”\nAt that, a sudden short laugh came from the kitchen. Sanji was behind the counter holding a bottle of sake he must have pulled from some hidden cabinet or whatever system he had to keep Zoro out of the booze. “That’s the biggest pile of bullshit I’ve ever heard in my life.”\nZoro narrowed his eye in a glare, previously relaxed position turning intimidating with the shift. “Name one time,” he challenged.\nSanji rolled his eyes, clearly not intimidated in the least. “Lara’s on Big Brag,” he said. Usopp vaguely recalled a bar by that name at the last place they docked.\n“Okay, name two.”\nSanji gave him a look as if to ask if he really wanted to play this game. Zoro gave him a look right back. Sanji sighed, setting down the sake, and started to count on his fingers. “Rico’s, San Josanna, the market in Mahalli, Dress Rosa, that guy with the blue shirt, oh, and you can’t forget the mandolin incident,” that one made Zoro blush, and Usopp couldn’t decide if he wanted to know or not, “Jessica’s, Oronaco Island, Seychelles, that bar with the overly-pink lighting, Seagull Bay, that guy just asking me for directions in Vulmullen, Robert’s Bar &amp; Grill, Fishman Island-“\nA slam and the sound of a chair scratching across the floor suddenly filled the room, cutting Sanji off. Nami had stood up, hands balled on the table and looking down at her place unseeingly. Usopp pressed back into his chair, willing it to swallow him whole. Nami was terrifying when she was angry, and she looked pissed.\n“Fishman Island!?” she exclaimed, turning her head to glare at Sanji over her shoulder. Sanji flinched. “Just how long has this been going on for!?”\nThe mood plummeted from teasing to terrified, the shift vacuuming all the air from the room such that you could hear a pin drop. Sanji was taken aback, Nami’s glare stunning him where he stood. Beside Usopp, Zoro was tense, ready to spring into a fight, but left dry as words were never his weapon of choice.\nThe silence stretched, time warping around the tension to turn seconds into days.\nSuddenly, a small voice cleared its throat, breaking the silence and drawing all eyes to it. It was Chopper, sitting on Zoro’s other side. He flinched from the sudden attention of so many eyes on him, especially Nami’s glare, but he didn’t back down. Usopp was very proud of him for that because that’s what he’d do in his hooves.\n“I think what Nami is trying to get at,” he began gently, “is that clearly, you two have been together for a long time now. And clearly, you make each other happy, and you’re important enough to each other to even get married. Which is wonderful! But, you did it all in secret, when we were all right here. Under our noses, even. We’re your nakama, your family, we care about you and your happiness, so why have you never told us something that’s so very, very important to both of you?”\nThat was the crux of it, wasn’t it? Underneath all the shock, Usopp could feel it too, that bit of indignation. How could they possibly have kept this all a secret? And why? Don’t they trust them? Why did they decide they needed to go behind the crew’s backs about this whole thing? He knows he isn’t owed an in on their relationship or anything, but he really was made to miss something as monumental as two of his best friends getting married. They deserve at least an explanation.\nZoro and Sanji exchanged looks, nervousness clearly written all over Sanji’s face. Zoro gave him a look that was equal parts reassuring and a mirror of his nervousness. Somehow, it was both soft – which looked bizarre – and ultimately resolute – which looked fitting. Sanji’s shoulders lowered minutely. Zoro motioned with his head a bit, as if summoning Sanji to his side. Sanji let out a long breath, running a hand through his hair, before picking up the sake bottle again and making his way over to Zoro.\nThere they go, having conversations in each other’s heads again. Disbelief was becoming harder and harder justify.\n“We, uh, we do have our reasons,” Sanji said as he crossed the room, “But I guess it’ll really be up to you guys if those reasons are good enough.” When he reached Zoro, he put a hand on the other’s shoulder as he set the bottle in front of him. Rather than immediately go for the booze, Zoro took hold of the hand on his shoulder. He turned his head and pressed a gentle kiss to Sanji’s knuckles before looking up at him with that same half-nervous half-reassurance as before. Sanji smiled gratefully down at him, looking calmer now.\n“Well?” Nami interrupted, tapping her fingernail on the table. She still hadn’t sat back down, now leaning over the table and fixing the pair with her glare. “We’re waiting.”\n“Well, um, er, you see-“ Sanji stammered, clearly having difficulty, “The thing is, just, uhm-“ Even Usopp, king of stalling, couldn’t watch this. Luckily, just before he was going to look away, a sigh cut Sanji off. It was Zoro.\n“Look,” he said, “You all know how… we are.” At this, he rubbed the back of his neck, looking bashful. Honestly, seeing emotion so plainly written on Zoro’s face made Usopp feel better about being long-term lied to already. It was rare for Zoro to bare himself like this; he was really trying here. “We’re… stubborn, and hot headed, and we fight all the time, and we aren’t always great at communication. And, you know, sometimes I can be a little oblivious to how other people feel, and sometimes cook can overthink just a little.” There were a couple puffs of laughter at that as those were understatements of the century, but Zoro continued, still serious, “We just… we didn’t know if it would work out between us. It almost didn’t, a couple times.”\nUsopp blinked at that, surprised. It had never occurred to him that they might have had trouble working out. The Zoro and Sanji he was seeing right now looked comfortable and easy next to each other, hands still joined near Zoro’s shoulder. Sure, they bicker constantly, but when push came to shove, Usopp had always known them to fight side-by-side, as equals and as partners. But what they said had been true, too; they were stubborn and prideful and locked themselves up so tight it was near impossible to pry them open. He supposed, theoretically, there could be some problems that arose from that.\n“We got off to… a really rocky start,” Sanji continued for Zoro, “We were just… scared. Of ourselves and each other. Of falling too hard or too little.”\nEyebrows raised in surprise around the room. Nami’s posture lost some of its rigidity. Those words… they were so honest. They held none of the dodging that Zoro and Sanji liked to usually do about feelings. It was shocking. It was vulnerable.\nIt must have been very difficult.\n“So,” he said, plowing forward, “With how messy it was, we decided to keep what we did just between us. If things didn’t work out, if they went sour or worse, we couldn’t risk it affecting the rest of the crew. If it was just us… then it not working out would stay just between us and we agreed to be big boys and figure out a way to still cohabitate.”\nEveryone let that statement breath for a minute. That sounded exactly like those two. Only they could turn secretly dating into some self-sacrificial sacrament. They were both too protective of the crew for their own good. They really were willing to go through heart break – with someone they would have to see and interact with every single day – all alone if it was for the good of the crew.\nThose bastards.\n“But, it did work out!” Luffy said suddenly and brightly, completely steam rolling over the fragile mood. He was smiling wide, looking pleased as punch. Nami sighed, collapsing back into her chair, head falling into folded arms as if suddenly exhausted.\nZoro snorted a short laugh and Sanji chuckled, a small blush coming to his face. “Yeah,” he said, so soft that it was mostly to himself, “It did.” Zoro rubbed the spot on Sanji’s finger where his ring would be if not around his neck.\nFranky broke into sobs again.\n“Fine,” Nami said, sitting up with a sigh. She still looked upset but had now moved from bristling anger to residual grumpiness. “Then, how did you two get from rocky to…” and here, Usopp would have used the word “gross”, because the amount of goopy, lovey-dovey vibes coming off of them was really just egregious, “…Married.”\n“Ah, well…” Sanji said awkwardly, avoiding eye contact. Usopp could understand, this was a very awkward conversation, and a clearly very personal question. That didn’t mean he was able to quell his own curiosity to know, though, so he certainly wouldn’t be stepping in to save them.\n“Come on,” Zoro said, finally now reaching forward for the sake, “We promised we’d tell ‘em everything.”\nUsopp raised an eyebrow at that, having not heard such a promise, but was not unpleased about it.\nSanji sighed, not moving from his spot behind Zoro, but instead now leaning an elbow on his shoulder, casually using him as furniture. Zoro didn’t seem to mind. “Fine, then you tell them, why don’t you?”\nZoro rolled his eye as he took a sip. “Fine, fine,” he acquiesced, “We decided to start dating at the after party of Fishman Island. From there, stuff happened, and then better stuff happened, and then worse shit happened, and then much better stuff happened, we got married, and now we’re here.”\nEveryone at the table gave Zoro a flat look. This is what happens when you leave it to him to tell a story.\n“That’s funny,” Robin said from down the table, head tilted in her hand, “I was under the impression your relationship began shortly after Thriller Bark.”\nAll eyes snapped accusingly to the couple, whose faces rapidly reddened in tandem.\n“That was, I, uhm, well, you see,” Sanji stammered, then abandoned his attempt to take a swig of Zoro’s sake.\n“We, uh, well, we weren’t,” Zoro coughed awkwardly, “We weren’t, uh, dating. Yet. Then. At that time.”\nUsopp felt his own face redden. Ah. Messy indeed. That was, coincidentally, exactly as much information about those types of events that he wanted. In fact, it was nearly more.\n“I thought it started in Skypiea?” Luffy said, head tilting to the side like a dog. At this, eyebrows raised. Robin was never wrong about this sort of thing, but Luffy’s intuition was uncannily accurate.\n“Skypiea?” Sanji asked, looking at Zoro with confusion. Zoro did not look back. Instead, he was seized up, bottle halfway to his lips, and burning so red that Usopp swore he could feel the heat all the way from where he was sitting.\nSanji’s face immediately assumed a playfully smug expression. “Mosshead?” He prompted, clearly delighted.\nZoro refused to look at him, instead finishing taking his sip, or rather his chug as he downed what must have been at least half the bottle in one go. His face continued to burn.\n“Ma-ri-mo,” Sanji sang, now hanging his face upside down in front of Zoro’s. Zoro closed his eye, refusing to look at him. “We promised to tell everything once they asked, remember? That means everything.”\nZoro set the bottle down, gripping it tight as he grimaced. “Tch,” he said, opening his eye to glare at Sanji. Sanji looked truly excited. Zoro sighed in defeat, looking at where he thumbed his bottle’s label rather than anyone else. Somehow, his face burned brighter.\n“Skypiea is just where… You know there was the bonfires and the parties… and the firelight with your hair and you were dancing and drinking and had that damn stupid cute smile and… you just… that was when I noticed… you know… how… beautiful you are. And stuff.”\nUsopp was going to barf. That was way too sweet.\n“That is so embarrassing for you,” Sanji said, still hanging in front of Zoro, smile impossibly wide and eyes absolutely shining in mirth.\nUsopp couldn’t help spurting a laugh, trying to stifle it. Nami was clearly struggling herself, and he could hear Chopper giggling too. Luffy and Franky were laughing outright, pretty much falling out of their chairs.\n“How beautiful,” Brook said, “May I use that in a song?”\n“No way in hell!” Zoro snapped, a giggling Sanji still in his face.\nZoro leveled Sanji with a glare, but it held absolutely no heat because he was pouting rather than snarling. Sanji somehow smiled wider. “Shut up,” Zoro said, shoving at the other’s smile, “Get your face outta my face, curly brow.”\nSanji let himself be pushed away, still laughing. Usopp didn’t miss the way he caught himself as he leaned back by hugging around Zoro’s shoulders, nor how Zoro made absolutely no complaint about it.\n“So, what happened after Fishman?” Chopper asked as the table calmed back down.\n“Ah, well,” Sanji said, looking calmer than before, “Like algae-brain said. ‘Stuff’. Mostly, we were just awkward and dumb and didn’t know what we were doing. Eventually, though, we did figure out how to talk to each other – with words and everything – and things got better from there. Much better.”\nZoro hummed in agreement. “You’re still dumb, though,” he said.\n“Look who’s talking, stupid,” Sanji answered with a smirk.\nUsopp was struck once more by just how normal that was. The intimacy and the information were weird, but at the core, they were still the same. Always bickering, everything a competition, forever in perfect synch. It just had a new, softer twist to it.\n“If things were going so well, then why’d you still keep it hidden?” Usopp asked. Messy and rocky he could understand wanting to hide, but if it got anywhere close to right now, wouldn’t it be easier to tell everyone than to keep sneaking around?\n“Hm, yeah…” Sanji said, smile suddenly looking sad, somber even. Zoro reached up to the hands still wrapped around his collar, holding them gently, like they were precious. “We maybe would have – told everyone, I mean – sometime around then. But then, I, uh, ran off to Whole Cake.”\nThe table was hushed once again. He’d settled his own feelings about the incident with Sanji a long time ago. In all honesty, after hearing the full story, he really couldn’t be mad at him – unhappy, yes, but not mad. All Sanji had truly done was be the kind person that he always has been, that everyone loves him for. That said, he remembered how he felt before hearing the full story – confused, scared, betrayed. How would it feel then, to be Zoro? To have something good with someone, and then they, out of the blue, run off to go marry someone else without a word.\nUsopp remembered how quickly Zoro had stated his rationale for why they shouldn’t go after him. He remembered what he’d said to Nami back then, “First of all, how could he get wrapped up in such a thing as marriage? It’s such a small deal!”  He remembered how Zoro was silent and drunk the whole ride to Wano.\nHe bet it didn’t feel real great.\n“Yeah…” Sanji said softly after a moment, sounding like he knew what everyone was thinking about. He looked down, avoiding their gazes. Doing that, though, just lead him to Zoro’s, as the other was now looking up at him with an unreadable expression.\nZoro reached up with his free hand, caressing Sanji’s cheek. “We’re better now, though,” he said, loud enough for everyone to hear but clearly directed truly at Sanji.\n“Yeah,” Sanji replied, smile turning now grateful as he leaned into Zoro’s touch, “We are.”\nUsopp was not crying. Franky, Brook, and Chopper were, and Nami’s eyes definitely looked a little wet, and so did Robin’s, but Usopp was definitely for sure not crying. There were just tiny bits of water coming out of his eyes, is all.\n“Anyway,” Sanji said, coughing to break everyone out of the tender moment, “That and Wano were both very… intense. And after, once the dust settled, everything kind of moved quickly. Before we even knew it, Zoro was proposing and I was accepting and then the perfect little set of islands came by and we just, well, went and did it. There was never really a good time to let everyone know. What were we supposed to say? ‘Hey everyone, if you aren’t doing anything else, Zoro and I are going to go get married on a random hill.’”\n“You liked the hill,” Zoro reminded him.\nSanji rolled his eyes, “Yes, I did like that hill.”\n“I get that it might have been awkward,” Franky said, interrupting their aside, “But were you guys really just never going to tell us? Not very cool, bros.”\nUsopp frowned. On one hand, it was none of their business. On the other hand, of course it was their business.\n“No, no, no,” Sanji said, shaking his head, “We were always going to tell everyone eventually. After the wedding, we promised that if anyone asked about us or our relationship, we’d tell them everything. Or, after two years. Whichever came first.”\n“What?” Usopp asked, “You really expected one of us to just out-of-the-blue ask you if you were married?”\nSanji shrugged. “Honestly, we expected someone to ask where we were those two weeks.”\n“Hey!” Nami cut in, “I asked you if you got a chance to try all the food on those islands!”\n“Yeah, well he did. Crap-cook here dragged me to every. Single. Island. Even the tiny one with only a food stand.”\n“And that stand had the best fried squid ever,” Sanji defended.\n“You make better,” Zoro rejected.\n“I make better because I learned what they did first,” Sanji said, but Usopp noticed his ears turning red.\n“Ooh, fried squid sounds really good! Sanji, do we have any squid?” Luffy cut in.\n“You just ate!” Sanji scolded, “And no! We don’t! If you want some you have to go catch it yourself.”\n“Awww,” Luffy whined, “No fair.”\n“Wait, how long ago did you guys get married?” Usopp asked, trying to do the math.\n“One year, three months, and eight days,” Zoro answered.\nEveryone looked at him. “What?”\n“Zoro,” Nami asked, “What day of the month is it?”\n“Why the fuck would I know that?” He responded, raising an eyebrow.\nEveryone stared at him once more, and he stared back.\nSanji shook his head. “Yeah, I don’t know how he does it either.”\n“So this whole time,” Usopp said, just skipping over that, “None of us have asked you anything that would lead you to tell us you’re married?”\nZoro shrugged. “We haven’t really been subtle.”\n“Oh please,” Nami huffed, crossing her arms, “If this,” she said, gesturing to their clear physical affection, “is how you two normally are then you definitely have been!”\n“Not really,” Zoro responded, “I mean, I help with dishes every night and then we just talk on the couch until everyone goes to bed.”\nOkay, well, Zoro does help with the dishes, but Usopp figured that was some peace treaty between him and Sanji about all their constant fighting. He had noticed when he was on watch duty that the galley light is on really late, but he assumed that was just Sanji doing breakfast prep; he didn’t know Zoro hadn’t left yet. “\n“I spend all my smoke breaks in the crows’ nest watching him train.” Sanji chimed in.\n“I thought you went up there to pick fights?” Chopper said.\n“Yeah,” Sanji smiled dreamily, “That too.”\n“Luffy and Robin definitely already knew,” Zoro pointed out.\n“Huh? Wasn’t it obvious?” Luffy asked innocently, the idiot.\n“I thought so,” Robin agreed, which was kind of rude of her because they all knew she was basically a surveillance state in her own right.\n“Wait,” Sanji said, “Didn’t Usopp catch us making out, like, a couple weeks ago?”\n“Making out!?” Usopp said, shocked. He tried to think back to a couple weeks ago. Did he witness something and, due to trauma, block off the memory? Then, a memory surfaced. It was just Zoro and Sanji in the guys’ room, doing normal things. Or, wait, “I thought you two were just literally butting heads!”\n“Well,” Zoro said, giving Sanji a smirk, “We were also doing that.”\nUsopp’s face lit on fire. Franky whistled. Nami covered her ears and Robin covered Choppers. Brook looked overly interested.\n“Stop that,” Sanji scolded lightheartedly, booping Zoro on the nose. Zoro shrugged and took another swig of sake, not breaking eye contact. Literally shameless, those two.\n“I do wonder, though,” Robin said, breaking the overly adorable moment between the two, “Why two years?”\nZoro just shrugged, “No real reason, just figured that by that point it’d be more awkward for you guys to still not know than to tell you point-blank.”\n“Well,” Sanji added, “And we thought that on our second anniversary, it might be nice to renew our vows, this time in front of more than just Luffy.”\n“Oh?” Robin asked, sounding genuinely intrigued, “A second wedding?”\n“Yeah,” Sanji replied, “One with suits. And a real venue. And groomsmen and a ring bearer, and all of that.” He was blushing lightly, looking a bit like he wanted to hide behind Zoro but bravely staying in the open. “One where you guys are actually in attendance,” he continued, “We do, genuinely, want to share this with you. You’re our family, after all, and we love you.”\nA second wedding? Held just so everyone could attend? Because they’re important to them? A warm feeling bloomed in his chest. Their friends did care, they did matter to them, they just needed a little time to settle themselves out.\n“Oh, well, when you say it like that,” Nami said, flicking her wrist and smiling, flowers basically emanating from her.\n“That doesn’t make me happy to hear at all, you bastards,” Chopper protested, dancing.\n“This wedding’s going to be SUPER!!” Franky announced happily, little confetti cannons on his shoulders going off. Were they new? Maybe Usopp should talk to him about making confetti stars. They could be really fun at parties or for sneak attacks.\n“Yeah, well, kind of unavoidable anyway,” Zoro remarked, “Cook wants a reception.”\n“Is it so bad to want to cook a wedding feast?” Sanji asked.\n“Feast!?” Luffy asked, “I want a feast!”\n“I didn’t say it was bad,” Zoro said, “I just said you wanted it. Like how you wanted to cook after the first one, too. I got the honeymoon suite with a kitchen, didn’t I? Still paying that shit off too.”\n“Don’t complain about it when I didn’t tell you to do that in the first place,” nagged Sanji.\n“So you would’ve happily gone two weeks without a kitchen?” Zoro asked, raising an eyebrow.\n“Fuck you,” Sanji spat.\n“Hmm, not right now, thanks,” Zoro said, smirking up at Sanji.\n“Shut the fuck up, you shitty marimo!” Sanji yelled, face turning a fresh shade of red. He raised his leg in threat, “I’ll fucking kill you!”\n“Like to see you try,” Zoro smiled, hands going to the swords at his hips.\n“Cut it out!” Nami yelled, knocking them both on the head, effectively ending their fight before it could begin. It really was just like them to let a petty spat pull them away from such an important discussion like this. Usopp found himself happy, ultimately, that they weren’t really any different now.\n“Damn witch,” Zoro mumbled, rubbing his head as he sat back down.\n“Don’t call Nami that,” Sanji scolded, also rubbing his head. Zoro answered with a tisk.\n“So, if we ask you questions, will you answer them?” Usopp asked, brimming with things he wanted to know.\n“Yes,” Sanji answered, turning to him with a small smile, “Since we did still keep everyone in the dark, we promise to answer all of your questions, no matter what they are.”\n“In that case,” Brook said, “Pardon me asking, but, which one of you top-“\nA foot met the left side of Brook’s skull as a scabbarded sword met the right side of his ribs, sending him spinning out of his chair and into the ship’s mast with force. “ANYTHING BUT THAT!” The couple roared in unison.\nUsopp was glad. He didn’t want to know. Ever.\nZoro and Sanji dusted themselves off, Zoro returning to his chair and Sanji returning to the kitchen. “Any of you animals – or my dearest Nami or fairest Robin – want more dessert?” He called.\n“Ooh, me! Me!” Luffy and Chopper replied in unison. The whiplash of going from weird to normal hit, but Usopp did his best to take it in stride. “Me too, please!”\n“So,” Franky said, “Zo-bro was the one to propose?”\n“Mhmm,” Sanji hummed, doling out pudding without letting Luffy eat the whole serving bowl, “He certainly did.”\nZoro groaned, rolling his eye.\n“Did it while lost-,”\n“I wasn’t lost!”\n“-In a scenic little wood-,“\n“It was a massive forest!”\n“- and covered in blood.”\n“Zoro!” Chopper yelled, never happy to hear a story where someone was hurt.\n“It wasn’t my blood!” Zoro defended.\n“I don’t think that makes it better,” Usopp pointed out.\n“I don’t know,” Robin said, gaining a sly smile, “beseeching betrothal bathed in the blood of your loved one’s enemies sounds rather ideal, does it not?”\n“IT DOES NOT!” Usopp, Nami, Chopper, and Brook yelled back.\n“It was bear blood,” Zoro said, exasperated.\n“Why the hell were you covered in bear blood?” Nami asked, giving him a bewildered look.\n“Because there was a bear!” Zoro yelled, throwing his hands up. He then took a deep breath, calming himself down as he raked a hand across his face. “Look,” he said, clearly having had explained these circumstances to exhaustion before, “We were docked at some island, and I went to town to find some booze. For some reason there was a huge forest between the port and the town-“\n“-There literally was not, the small forest and town were in opposite directions,” Sanji cut in.\n“The forest was between them!” Zoro insisted, “So I go through the forest. There’s no trail-“\n“There was a really well-worn walking trail straight through to the beach,” Sanji said, “Couldn’t miss it.”\n“There was no trail!” Zoro insisted, “And I couldn’t figure out which way they put the town because the trees started repeating.” That didn’t even get dignified with a correction. “Somehow, though, I must have wandered into a bear’s territory.”\n“A real bear!?” Chopper cried, as if he couldn’t turn into a skyscraping monster at will.\n“Oh yeah, a big black thing with shaggy fur and a scar on his cheek.” Chopper noticeably shivered, and Zoro got an evil grin on his face. “He had huge paws the size of your head with razor sharp claws. His teeth looked like they could crush bone easy,” he said, having too much fun looming over Chopper. Chopper, in turn, cowered in fear. “He must have not liked where I was, because out of nowhere lunged at me!”\nZoro suddenly lunged forward himself, scooping Chopper up. “Ah! Zoro!” He yelled. After a minute of light roughhousing, Zoro set him back down in his chair.\n“Don’t worry, though,” Zoro said, all pride, “I didn’t let him get me that easy.”\n“How’d you get out!?” Chopper asked, hanging off every word.\n“I sliced it clean down the belly,” Zoro smirked, motioning in a straight line with his hand.\n“So cool!” Chopper cheered, stars in his eyes.\n“Super!” Franky yelled, posing.\n“So, that got you covered in blood?” Nami asked, coming back to the actual point of the story.\n“Ah, not really,” Zoro dismissed, “What did that was carrying it back.”\n“Carry it back!?” Usopp gasped, “Why on earth would you bring that thing back with you!?”\n“Cook likes trying to make tough meat taste good. Figured he’d like to try bear.”\nEveryone looked to Sanji, who was adding extra whip cream to Chopper’s extra dessert. He just shrugged, “It’s a fun challenge for myself.”\nZoro lugging back a whole dead bear while helplessly lost in the woods just for Sanji’s hobby? They were at port, too, so it wasn’t like they were low on food; necessity was clearly not considered. God, the poor bastard was really in it deep.\n“So, you’re lost in the middle of the woods with a dead bear bleeding profusely,” Robin surmised, “How does this lead to a proposal?” Somehow, the way she asked made it sound like she was taking notes.\n“Well, after he was gone for a few too many hours, I went to go look for him,” Sanji answered, pudding bowl resting against his hip, “Thought about trying the town first, but the forest looked dangerous and foreboding, so I figured he went in there. A path of chopped down trees later, and there I find the plant-man himself, all his green dyed red, with a giant ass bear on his back. So I say, ‘what the hell are you doing out here? Is that a fucking bear?’ And do you know what he says back to me?”\nZoro shot daggers at him out of his eyes.\n“What?” Luffy asked, clearly on the edge of his seat.\n“He looks me square in the eyes and says,-“ and here Sanji lifted his bangs to imitate Zoro’s hair and dropped his voice an octave, “’Marry me.’”\nLuffy doubled over laughing, and the rest of the table devolved into giggles. Usopp, of course, abstained, definitely successfully holding back his snickering, not even a little bit bursting out into open laughter as Franky hit the table with his huge fist and even Robin chuckled behind her hand.\nZoro’s face was red hot again, this time clearly in anger. A vein was popping out on his forehead, his teeth were bared, and both hands gripped onto his biceps in a way that definitely hurt, as if doing otherwise would only ever end in everyone’s instant slaughter. It probably would. Somehow, that made it funnier.\nSanji laughed, too, bright and bubbly, like it was the funniest thing in his life. He laughed his way over to Zoro, wiping a tear from his eye. “Come on, marimo,” Sanji said, “It’s very funny, looking back.”\nZoro just growled at him, like an animal. “You weren’t laughing then.”\nAt that, something in Sanji’s smile softened. No longer manic in laughter, his eyes once again regarded Zoro with impossible fondness. “No, I suppose I wasn’t,” he said, sitting down in Zoro’s lap like he belonged there, mostly empty bowl in his own lap.\n“Somehow,” he said, skimming the bowl with a finger and coming up with a glob of pudding, “You made that the most romantic thing I’ve ever witnessed.” He booped Zoro’s nose, covering it in pudding. “And I just couldn’t help but say yes.”\nZoro still glared at him, unmoving for a moment. Eventually, though, without breaking eye contact, he released the grip on one of his arms to swipe at his nose with his thumb. He licked the pudding off, sampling it.\nHe puffed air through his nose.\nUsopp prepared for Sanji to get skewered.\nAnd then Zoro’s face broke out into the stupidest smile Usopp has ever seen in his life, looking just as fond as Sanji did. “Stupid cook,” he said, “That’s way too sweet.” Sanji just smirked back.\nThen, they both started to lean in.\nUsopp coughed.\nInstantly, both their heads snapped to him, eyes shocked, like they were surprised he was there. Sanji shot up out of Zoro’s lap, face red and not looking at anyone as he dusted invisible specs off his apron. Zoro’s face was still red from before, but now it was clearly in embarrassment.\nUsopp felt like the biggest fucking idiot in the world that these two dumbasses managed to keep their shit under wraps for so goddamn long when they let the rest of the world fall away so readily. He blamed it on him always avoiding them when they were together because they were supposed to be fighting.\n“Wait, did you even have rings with you when you proposed?” Nami asked. Usopp wondered if she was mentally tallying Zoro’s debt, looking for borrowed money that lied outside of his usual habits.\n“No, as a matter of fact, he did not,” Sanji answered, a huff in his voice. “I was the one who got a couple rings from town afterwards. I even had the idea for the earring, so mosshead had no room to object about it.”\n“And I didn’t, did I?” Zoro spat. Usopp had the strangest feeling like he probably did, to some degree.\n“Wait, then why do you wear yours around your neck, Sanji?” Chopper asked, whip cream smeared around his mouth, “Aren’t you afraid it could be a choking hazard?”\nZoro picked up his (completely unused, because he was a slob) napkin and wordless held Chopper’s face in his hand and started cleaning off around his mouth.\n“I,” Sanji said with an air of haughtiness, gesturing to his chest, “Do this wild thing civilized people do called, ‘wearing a shirt regularly’. It includes not getting progressively less dressed the more intense a fight is.”\nZoro rolled his eye, surveying Chopper for spare splatter before releasing him. He mumbled something under his breath about Sanji not always complaining about that, but Usopp chose to not hear it.\n“That said,” Sanji continued, “A ring on my finger wouldn’t really work out for me, either. Really easy to get bacteria trapped under there and make for an unsanitary workspace.”\nAh, so he wasn’t hiding it. He was just keeping it tucked in to protect it and prevent accidents. That made sense. Usopp saw how the ring now hung outside his shirt, brought to rest around his collar rather than within it. He was almost surprised at the simpleness of both his and Zoro’s rings. He guessed that if they were picked up on just any old island, selection must have been slim. But maybe there’s some poetry in the two having a complicated relationship only for a simple marriage. It was sweet if you thought about it like that.\n“I have been wondering,” Robin said, looking inquisitive, “Why get married at that group of islands? If I recall, we passed by several others between your engagement and your marriage.”\nUsopp elected to ignore the fact that neither had actually stated which island they’d become engaged on.\n“Blondie here hates the cold,” Zoro answered, “So at least half of those islands were out for being Winter islands. Other islands we only stopped at for a day or so, which was mostly taken up by cook stocking the ship. This one had good weather, good food, a long stay, and the baths which might make the idiot actually relax for once.”\n“And what was in it for you?” Robin asked, eyebrow raised.\nZoro shrugged, “Happy wife, happy life.”\nSanji smacked him in the back of the head so hard his forehead banged on the table and he came bouncing back up again, “DON’T SAY SHIT LIKE THAT!”\n“HEY, THAT REALLY HURT!” Zoro roared, turning in his seat and rubbing his head.\nThese two really do never change.\nThe group talked long into the night, asking questions and getting answers. The wedding had been just the two of them and Luffy – no suits, no alter, no music or fanfare – and then they’d run off to some rented apartment on a different island of the archipelago than the rest of them. Once it was time to go, it was just business as usual for them.\nFrom there, certain events were cleared up and new stories were told. Like the time Usopp found them in the galley, Zoro covered in squid ink and Sanji rolling on the floor laughing. Or that time they came back to the ship covered in alpaca fluff. Or that time Sanji sleepwalked into the crow’s nest while Nami was on watch. The more stories that were told, the more everything clicked into place and Usopp had to ask himself again and again how he hadn’t figured it out sooner.\nThe big picture of it all was absolutely crystal clear in Usopp’s eyes: they were hopeless, they were in capital “L” love, and they were happy that way. Usopp, for his part, was happy for them. Two of his best friends, his family, filled with so much love and joy. He couldn’t really hold it against them for keeping this to themselves for a while; they did deserve privacy and space. Plus, they were letting everyone in now, and now is really the time that matters most out here on the Grand Line.\nAs the night wore on, yawns were elicited, growing more frequent as time passed. Finally, Nami stood up, “Well, it’s too late to get any more into this,” she decided, “I’m going to bed.”\n“Why of course, Nami dearest!” Sanji extoled, “Your rest and well-being is extremely importa-“\n“But,” Nami said, cutting him off, “If I have more questions, will you two answer them later?” She gave both Zoro and Sanji a hard look.\nSanji’s heart eyes softened in something genuine and sincere. “Yes,” he answered, “We promise, no more hiding.”\nNami stared him down a minute more, assessing him. Finally, she seemed to come to a conclusion she liked, because she leaned back with a smile. “Good! Oh, and Zoro?”\n“Hm?” Zoro asked, looking at her with a quirked brow.\n“For not telling me sooner, all interest rates on your debts are increased by 200%.”\n“TWO HUNDRED!?” Zoro yelled, aghast. Nami just winked and stuck her tongue out. She then simply turned and left the galley, humming happily, leaving Zoro seething in his seat.\nOne by one, everyone rose to follow her lead, emptying out of the galley. Franky was the one to grab Luffy by his collar, dragging his sleeping-like-a-rock form to the barracks. “Congratulations, bros,” he said as he left.\n“Yes, congratulations,” Robin said, leaving as well.\n“My heart would be pounding in excitement for the two of you,” Brook said, “If I had one!”\n“We really are happy for you guys,” Usopp assured them, making his leave as well.\n“Thanks, Usopp,” Sanji said, sounding sincere. It was nice to be allowed past all those walls every now and then.\n“Zoro, Sanji,” Usopp heard Chopper say. He paused in the threshold, wondering what the serious tone from their usually chipper shipmate was about.\n“Yes, Chopper?” Sanji asked, sounding a bit concerned, “What is it?\n“Were you two really sexually active with one another shortly after Thriller Bark?”\nZoro and Sanji both froze, faces becoming red hot.\n“I- uh- you see,” Zoro stuttered.\n“The thing is- I mean- medically speaking I guess-“ Sanji forced out.\nSuddenly, Chopper grew to his full human height, towering over them. With his giant fists, he bashed them both on the head, sending them crumpling to the floor.\n“There’s no way either of your bodies – let alone Zoro’s – were ready for that kind of physical exertion! If either of you pull a single stitch doing something like that, I’ll kill you myself!”\nZoro and Sanji were nothing but two dazed piles on the floor, but they managed to let out a collective groan of, “Yes, Chopper.”\n“Good!” Chopper said, giving them one last hard stare. Then, he shrunk back to his hybrid form and walked proudly past Usopp.\n“Oh!” he said, just before he crossed the threshold, “And congratulations!” He waved cheerily at the two lumps on the ground.\nUsopp suppressed a laugh.\n“So…” Sanji said, handing Zoro the last plate.\nZoro grunted in response, accepting the plate and drying it.\n“The others know now,” he continued.\n“Well, that was the plan, wasn’t it?” Zoro finished drying his plate, placing it on the stack of identical ones beside him. Sanji opened the right cabinet and Zoro slid the stack into place, as always.\n“Yeah,” Sanji admitted, “It’s been a long time coming, too.”\n“Mmm,” Zoro agreed. Lowering his arms from lifting the plates, he encircled Sanji from behind, the other fitting perfectly in his hold.\n“Didn’t you get enough from all that PDA earlier?” Sanji teased, settling against his chest anyway.\n“God,” Zoro said, nuzzling into the crook of Sanji’s neck, “That was the most embarrassing thing I think I’ve ever done. We are never doing that again.”\nSanji laughed at him, scratching a hand through green hair, “Even more embarrassing than asking me to marry you?”\n--\n\n               “There you are! Holy shit, what happened to you? Is that a bear?”\n\n\n               Sunlight filtered through the canopy, turning yellow hair golden in the dappled light. A Cigarette sat tantalizingly between soft lips, and his face was gently flushed from the heat of the day. \n\n\n               He reached out a perfect, sacred hand and wiped a trail of blood off his cheek. The hand stayed there, moving his face left and right to inspect him.\n\n\n               He’d found him. Again. As he always did. No matter how lost he was, Sanji would always come and find him. \n\n\n               Zoro wanted him to do that forever. Knowing Sanji, he would, if only he asked.\n\n\n               The words left him before he even thought them, his heart speaking instead.\n\n\n               “Marry me.”\n\n--\n“Way worse than that,” Zoro answered.\n“Oh?” Sanji said, “Then how about picking the island? Saying we should actually follow through?”\n--\n\n               Trees colored pink and white with blossoms danced along the hills, small pokes of bright green baby leaves complementing them on brown branches. \n\n\n               Strong, scarred arms wrap around a waist from behind, holding the other preciously, secretly. \n\n\n               “Let’s do it here,” he said, smiling into sun-warmed blonde hair.\n\n\n               “Yeah,” was the soft reply, “Let’s do it here.”\n\n\n--\n\n               “That was easy,” Zoro dismissed, squeezing him tighter.\nSanji laughed in his arms and Zoro relished the sound. “Let go of me,” Sanji smiled, wriggling, “I want to finally go sit down.”\n               Zoro sighed but let Sanji escape, only to smile softly when Sanji caught a now free hand in his, dragging him along, too.\n“Oh, what about when you started going the wrong way to the hill?”\n--\n               “Come on,” a hand in his, calloused but differently, marks earned perfecting the art of creation rather than destruction, “No getting lost this time.”\n\nA red velvet case sat heavy in his pocket, yet the weight was no burden. It was heavy only from the potential it held inside. The anticipation of entropy made him giddy to his bones.\n\n\n               “I’m never lost,” he retorts, lying through his teeth. He’s always lost these days. Lost in blue eyes, in tender touches, in soft words, in moments where it’s just them and the rest of the world falls away. \n\n--\n“I knew where I was going.”\n“Uh-huh,” Sanji said, falling onto the couch and dragging Zoro with him. Zoro automatically wrapped his arms around the other, sitting back until his head rested on the couch’s armrest and Sanji rested nestled against his chest. He ran a hand up and down Sanji’s back, soothing the muscles of his hard-working cook.\nSanji made a content little noise, stirring butterflies in Zoro’s stomach, which was stupid because they did this nearly every night, yet it seemed it never got old. Sanji reached for his pocket, pulling out his usual cigarette, but Zoro put his hand over his to stop him.\nSanji looked up with a questioning brow. “You already had six just washing dishes,” Zoro explained, gesturing with his head over to the sink. An ashtray sat beside it, filled with butts and dark ash.\n“Oh, did I?” Sanji frowned, putting his pack away.\n“Maybe I’m not the only one embarrassed,” Zoro teased, nuzzling playfully by his ear.\n“Oh please” Sanji denied, “Sure it was… certainly something. But it really wasn’t that bad, was it?”\nZoro sighed, continuing his ministrations, “Honestly? It went over better than I thought. Even when Nami looked like she wanted our heads on pikes.”\nSanji shivered in his arms. Their whole arrangement had never been about pulling one over on everyone or anything like that; they just wanted their privacy. Still, Zoro couldn’t fault them for being a little angry with them, and he knew how having either of the girls’ ire directed at him made Sanji feel (in-short, not great).\n“I’ll cook her a feast of treats to apologize!” Sanji declared, determination in his voice. Zoro could see the clockwork in his brain ticking, recipes and decoration ideas already thrumming through his head. He smiled at him fondly.\n“I don’t think she’s really mad anymore,” he assured him, remembering her soft smile before she’d slipped out of the galley. “And,” he added, “If she is, she won’t be much longer.”\nSanji looked up at him, narrowing his eyes in suspicion. “What are you up to?”\n“Jeez,” Zoro said, giving Sanji and incredulous look, “It’s nothing bad, I swear. Give me some credit.”\nSanji didn’t let up on his suspicion, though, and Zoro rolled his eyes. “I’m gonna ask her to be my best man. Maid of honor? I don’t know, whichever, both.”\n“Oh,” Sanji said, blinking at him. Then, he smiled, turning back into Zoro’s chest to hide it. “I think she’ll like that,” he said. Zoro hummed in response.\nA moment of gentle silence passed. Zoro just soaked in the content feeling of holding Sanji close. They got so few moments truly alone. Even now, like this, in the back of their minds they were watching the doorways with haki, waiting for someone searching for a midnight snack or glass of water to wander their way. Though, Zoro supposed that he didn’t have to roll off the couch and hide underneath or rush to lock himself in the pantry or slip out to the upper deck via the ladder anymore. Maybe they should have told everyone sooner. Ah, but the idea of keeping Sanji and the things he did all to himself was very attractive, and hiding had its own thrill to it, too.\nAs Zoro lazily considered these things, Sanji began to fuss in his arms. At first, it was just a light tapping rhythm of his finger. Soon, though, he was playing with a button on his shirt, then worrying the hem of Zoro’s sleeve, then tugging, just a bit, at the ends of his bangs. Finally, Zoro had enough of it. “Cook…” he said testily, though he followed it with a small kiss to blonde hair.\nSanji sighed, digging his face in further to Zoro’s chest. Zoro gave him a moment, knowing a number of ways to get whatever was bothering him out if he didn’t fess up willingly.\n“So, uh,” Sanji said, most likely well aware of all of Zoro’s ways, “You’re really okay with, you know, doing it again?”\n“Doing what?” Zoro said, frowning down at him, “The wedding? I’ve said as much before, haven’t I?”\n“Well, yeah,” Sanji said, shrugging and lifting himself enough to look at Zoro’s face, “But now it’s all a lot more real. Everyone knows now, so we can start, like, actually planning, and stuff.”\nSanji had trailed off at the end of his sentence, looking away, but Zoro brought his hand to Sanji’s chin and made him turn to look at him once more. Zoro looked in those blue eyes with all the calm resolution and sincerity he felt, “I would do anything to get to marry you again.”\nSanji looked owlishly up at him. He blinked. He blinked again. Small patches of red blossomed in his cheeks. The patches grew, engulfing his pale skin, until his whole face was red, blush reaching to the tips of his ears and bleeding down to his chest, and he just kept getting redder. Zoro smirked.\n“Holy shit, shut the fuck up, you asshole!” Sanji sputtered, sitting up to choke Zoro around the neck, but not actually squeezing. He looked furious except for his eyes which were full of glee.\n“Get off me, crap-cook!” Zoro protested, laughing, lightly attempting to dislodge him but really just using it as an excuse to caress his wrists.\n“No way! I have to kill you before you kill me first pulling crap like that!” he was laughing too, his façade easily broken.\n“If it’s a fight you want…” Zoro said, switching tactics. He relinquished his wrists to put a hand in Sanji’s hair, pulling him forward suddenly enough to catch him off-guard, and crashing their lips together.\nSanji hummed into the messy kiss, hands releasing their mock hold so that one could rest on his collarbone and the other could thumb circles at his cheek.\nThey parted, breaths hot and mingling, for just a moment before meeting again, softer this time. The gentle press of Sanji’s soft lips against his was nothing but pure heaven. It was all he could ever want and more, and it was all freely given by a man who loved him.\nThey parted once more, and Zoro looked up at his beautiful husband, the overhead lighting of the galley giving him a halo that was well deserved. Sanji gave him a smile that Zoro would kill a thousand men for.\nHe knew he was being uncharacteristically goopy – even within their private moments, this was a bit much – but he just couldn’t help it; an evening of reliving memories had dredged up so much fondness, his heart was simply overflowing with the syrupy feeling. On top of that, he was simply too emotionally drained to put up his usual front, especially when Sanji would only see right through it anyway.  \nSanji looked down at him equally as goopily, so he felt no shame in this allowance.\n“Why do you ask, though? About the wedding?” Zoro said, furrowing his brow as he brought them back to their previous point. “It was your idea in the first place. Do you not want to anymore?”\nSanji rolled his eyes at him. “Of course I do, dummy,” he said, which was a little uncalled for when all Zoro was doing was showing he cared, “I just need to make sure you are. It’s a whole lot of doing stuff in public, you know? You’d have to say your vows again, out loud, in front of everyone.”\n--\n               “I, Roronoa Zoro,” he swallowed thickly. He’d rehearsed these lines in his head a thousand times over but saying them with his voice was something else entirely. \n\n               A soft squeeze of their joined hands brought his attention back. Blue eyes full of sincerity met his. Right. He could do this. For him, he could do anything. \n\n\n               “I give you my whole heart to have and to hold, and promise to do so with your heart if you will let me,” he felt the enormity of his own words. He reveled, rather than drowned, in it. He slipped the chain bearing his ring over golden hair.\n\n\n               “Forever.”\n\n--\nZoro’s face grew warm at just the thought. It really would be embarrassing to announce in front of everyone he knew how he felt. And yet, a possessive part of him didn’t mind it one little bit. In fact, that part of him wanted to tell every single passerby on any street of any island, “Yes, this is mine, he let me be his, all mine and no one else’s, just for me, forever.”\n“You have to say yours too,” he says in lieu of revealing such desires.\n“That’s true,” Sanji said, looking contemplative for a moment. Then, a smirk came to his face. “You gonna cry again when I do?” he teased.\n--\n               “I, Blackleg Sanji,” he stops, tears welling up in his eyes. His smile doesn’t falter for even a second. \n\n               A blessed hand reached up, whipping wetness away from his own eye. It rests there on his cheek, warm and gentle. A sniffle and a shaky breath, and then he continues.\n\n\n               “Promise to care for you always, and to let you care for me in return. To be each other’s forever.”\n\n--\n“I only cried because you did!” Zoro protested, now even redder.\n“Uh-huh,” Sanji slyly smiled, unconvinced.\nZoro huffed at him. The hands that were resting on the small of Sanji’s back wrapped further around the other’s lithe frame, trapping him to Zoro’s chest. His captive secured, Zoro gave him a punishment he deserved and tickled him mercilessly.\n“Hey! Hahaha! You algae-heehee-brain!” Sanji scowled between giggles, wriggling in his hold.\nZoro didn’t let up, smile maniacal as he enjoyed Sanji’s struggle.\n“Stop it!” Sanji yelled, laughing harder. He thrashed, trying to get away from those fingers, and ended up sending his body weight towards the open side of the couch. Zoro continued to refuse to relinquish his grip, so the pair was sent over the edge, Zoro just barely fitting a hand behind Sanji’s head as they met the floor hard.\nSanji’s breath was knocked out of him once as he landed and once again as Zoro landed on top of him. Zoro sat up on his elbows and looked down at him. Sanji looked up at him. A beat passed. They broke into laughter, dissolving into a pile of giggles and mirth.\n--\n               Their captain, who found them, who brought them here, who they’ll follow to the ends of the earth, stands before them, smiling.\n\n               “I now pronounce you,” he says, reading from a card, “Mr. and Mr. Roronoa!”\n\n--\nZoro’s insides felt impossibly light, watching Sanji’s flushed face as his thousand-sun smile shined at him. He meant what he said: he’d do anything to marry this man again and again and again and again. As many times as he would have him.\n--\n               The sunset burns red across the sky, their shadows becoming long and merging into one. \n\n               He reaches a hand into blond hair and dips him, unable to control himself.\n\n\n               Soft lips press against his, the kiss lovingly marred by their inability to stop smiling.\n\n\n               He was now tied to this man’s side forever.\n\n\n               He would have it no other way.\n\n "
}