{
    "id": "36120184",
    "url": "https://archiveofourown.org/works/36120184?view_full_work=true",
    "author": [
        "AliceTheBrave"
    ],
    "title": "The Truth Always Comes to Light",
    "rating": "Not Rated",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Merlin (TV)"
    ],
    "relationships": [
        "Merlin/Arthur Pendragon (Merlin)"
    ],
    "characters": [
        "Merlin (Merlin)",
        "Arthur Pendragon (Merlin)",
        "Knights of the Round Table (Merlin)",
        "Gaius (Merlin)"
    ],
    "additional_tags": [
        "Truth Spells",
        "Merlin's Magic Revealed (Merlin)",
        "Love Confessions",
        "Stupidity",
        "Hurt/Comfort",
        "Happy Ending",
        "Fluff and Angst",
        "Good Morgana (Merlin)",
        "mentioned in passing - Freeform",
        "Gwaine Being Gwaine (Merlin)",
        "Lancelot (Merlin) Lives",
        "Alternate Universe - Everyone Lives/Nobody Dies"
    ],
    "language": "English",
    "series": "",
    "published": "2022-01-01",
    "completed": null,
    "words": "12,192",
    "chapters": "1/1",
    "comments": "133",
    "kudos": "9,161",
    "bookmarks": "1,262",
    "hits": "56,642",
    "summary": "<p>“What did you do now Merlin?”</p>\n<p>“Got cursed.”</p>\n<p>Merlin slumped into the room and fell onto the bench of the table across from Gaius, laying his head dramatically on a book of something or other Arthur didn’t bother to look too closely at. </p>\n<p>“Cursed.” Gaius echoed, unimpressed. </p>\n<p>“Cursed.” Merlin sighed back, like some kind of weepy maiden. </p>\n<p>“He can’t lie,” Arthur supplied, walking further into the room and standing behind Merlin, pushing his head off the book roughly. Merlin squawked and glared at him before shaking his head and turning back to Gaius. </p>\n<p>\"It gets worse.\"</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a>.)</p>\n<p>I wrote this in one day so quality is dubious at best.</p>",
    "text": "“Well that was awful,” Arthur muttered, heaving in heavy breaths as he stared at the crumbling cliff which had just fallen away in front of him - luckily taking the mad witch trying to kill them with it. \nThe splash as she met the river below still echoed off of the stones though he paid it little mind. \n“Could have been worse,” Merlin groaned in answer, pulling himself to his feet from where he had fallen to the ground in front of Arthur. \nArthur grabbed him beneath the arms and helped him up, steadying him with a hand on his shoulder and ducking to peer into his eyes, searching for any signs of confusion or delirium. \n“What were you thinking? No one asked you to jump in front of her spell like that, you idiot!”\nArthur had been entirely caught off guard by the blast of light and power the old bat had thrown his way, though he was even more unprepared for Merlin pushing him aside and taking the blow in his stead. \nMerlin had hit the ground hard and Arthur’s ears had rung as though he were the one that had been struck after all. He hadn’t realized he had stopped breathing until Merlin groaned and rolled to face the witch, battle instincts delayed while his worst fears seemed to come true. \nHe could never bring himself to leave Merlin behind - there was none he trusted more on these quests than him and it was his job besides. Still, every time some bandit or sorcerer turned their hateful gaze toward his servant Arthur felt his blood run cold. He didn’t know why. Merlin had very rarely come to harm and even then it was only minor wounds. \nArthur had never let anything worse happen to him. He never would. Merlin was perfectly safe as long as he stayed by Arthur’s side. \n“No one ever does,” Merlin said, bringing a hand up to his head as if it ached and blinking at him with bleary annoyance, “Never stopped me before.”\n“What?” Arthur drew back, surprise overcoming his displeasure at Merlin’s recklessness. \n“What?” Merlin drew back himself, the two of them staring at each other in mixed confusion and horror. \nThey must have been a sight, awkwardly bending away from one another while Arthur still gripped Merlin’s shoulders and Merlin clutched his own head. \n“What was that about ‘never stopping you before’?” Arthur barked, grip tightening as he pulled Merlin back in, glare threatening him to try and lie and see how far he got with it. “There’s been a before?”\n“‘Course,” Merlin said immediately, eyes flying wide as if in disbelief at his own words, “I'm always taking blows for you. Must’ve been a thousand times by now.”\n“A thousand-!” Arthur released his shoulders and shoved him back with disgust. Obviously if he was being this insolent he was perfectly fine. “Yes, I’m sure cowering behind trees while the knights and I do all the fighting is very dangerous work, Merlin.”\n“Only when people realize what I’m actually doing behind those trees,” Merlin said, eyes wide and horrified, “Once they catch on they usually single me out pretty quick and then I’ve got to take care of them before they blow my cover.”\nMerlin gasped at himself, slapping his own hand over his mouth to shut himself up. He stared at Arthur in absolute horror, all the color drained from his already pale face. \n“What are you talking about?” Arthur stared at him in open astonishment, mind struggling to make sense of any of the words coming out of his mouth. “What’s wrong with you?”\nMerlin blinked at him and shook his head, pressing his hands tightly over his mouth as if to keep himself silent by force. \n“What the hell is going on, Merlin?”\n“She cursed me!” Merlin yelped, pulling his hand away from his face only briefly before slapping it back down again with a smacking sound that would have been comical if Arthur weren’t so worried. \n“Cursed you?” Arthur barked, hurrying up to Merlin once more and tearing his hand away from his mouth, forcing his head to the side and manhandling him to turn around so as to check for any visible sign of damage. Finding nothing obvious he scowled and shoved Merlin back around to face him. “Cursed you how?”\n“I’ve got to tell the truth,” Merlin said and with such despair that he might have said he had been cursed to death. He certainly looked weepy enough about it. \nArthur stared at him in exasperation, entirely unimpressed by Merlin’s dramatics. \n“That’s it?” He drawled, looking Merlin over with clear judgment. \n“No, I think I’m forced to answer questions when I’m asked,” Merlin said, somehow even more upset by the revelation, “I can’t deflect or ignore you like I usually do.”\n“Merlin! You're not supposed to do that anyway, you insolent whelp, I’m the bloody Prince!”\nMerlin desperately shoved his fist into his mouth then, only barely managing to muffle whatever words he was about to speak. If they were so insolent that Merlin of all people darent utter them, Arthur couldn’t imagine what manner of treason they must have been.\nHe stared at him for a moment, disbelief warring with relief. He had been frightened for a moment that this curse had actually been something serious. He would never admit it, not even under pain of death, but he didn’t quite know what he would do if Merlin were in real danger. \nIf history was any precedent, he’d be willing to defy the King and put his own life at risk doing so at the least. \nHe knew better than to invite that kind of madness onto himself. It was bad enough the first time. Merlin had drunk poison for him and Arthur had barely been able to forgive himself for it. If he had been cursed for him - it doesn’t bear thinking about. \n“Gaius will know what to do,” he said, though he was not sure potions and tinctures could uncurse someone. But Gaius always had the answers to these kinds of things and if he didn’t have them he always somehow found them. \nMerlin nodded enthusiastically at the idea and Arthur sighed before turning back the way they had come. He heard Merlin’s steps fall in behind him though it was the only indication he was there at all. \nAfter two minutes too long of silence, Arthur glared back over his shoulder to see his idiot manservant waddling along after him and still clutching his hands over his mouth. \n“Stop that,” he barked, whacking a low tree branch out of his path in annoyance, “You look ridiculous.”\n“You always think I look ridiculous,” Merlin retorted quickly, though he looked frustrated at himself for slipping up and Arthur couldn’t help but to laugh. \n“Yes, well, it can’t be helped how you were born, can it,” Arthur said, but the mirth faded from his smile when he saw the troubled look that came over Merlin’s face. \n“No,” Merlin murmured, almost to himself, eyes on his feet as he walked, “No, it can’t be helped.”\nArthur let his smile fade completely as he watched the despondent way Merlin picked through the forest. \nMerlin had been cursed to speak only the truth. That meant then that whatever he said, even in jest, must be what he truly believed.\nArthur didn’t actually think Merlin looked ridiculous. \nIt was just a joke between them, as it always had been. He thought Merlin knew that. It wasn’t as if the fool could be that ignorant to his own looks. \nMerlin was not classically beautiful the way that most people tended to fawn over, no, but he had a sharp and rare quality to him that made him easy on the eyes regardless. Something rare and elegant in his bone structure and the glint in his eyes. Not that Arthur really cared or noticed or thought about it enough to put into words. \nMerlin wasn’t ugly and that was just a fact. It didn’t mean anything that Arthur had functioning eyes. \nHe had just always assumed Merlin knew it too. \n“I don’t actually think that, you know,” Arthur said, haltingly, slowing his steps so that he walked by Merlin’s side, “You’re not always awful to look at.”\nHe didn’t turn to look at him but he caught Merlin look toward him in surprise from the corner of his eye. After a moment of stunned silence Merlin snorted out a laugh and shook his head, bumping Arthur’s shoulder with his own. \n“Thanks, I think,” he chuckled and Arthur pushed him away in mock annoyance. \nThe trip back to Camelot was long and slow, impeded by Arthur’s soreness and Merlin’s reluctance to speak. \nArthur didn’t know, really, why it bothered him so much except that he didn’t like having to look over his shoulder every five minutes to be sure Merlin was still there. When he chattered at him all the time he never had to worry about things like that. He never had to worry about growing bored either, or the way his thoughts spun around and around in his mind with no distraction, spiraling ever into places he did not want to be. \n“This is just unnatural. I don’t think you’ve been this quiet in your entire life. What are you so worried about anyway?” He groused after the third time he had said something blatantly taunting with no response but for a frown and a shake of Merlin's dark head. \n“Telling the truth.” \nThe sound of Merlin smacking himself hard was enough to almost startle his horse. Arthur stared at him in disbelief, eyeing the red mark on his pale face and the way he tried very hard to look nonchalant. As if he wasn’t acting half mad. \nNot that it was very different from usual. \n“And what secrets, exactly, do you have to worry about?” He asked, reigning his horse closer to Merlin’s, and frowning at the way he didn’t even glance in his direction as he did so. “I can’t imagine what you’d find embarrassing enough to hide from me. You make a fool of yourself every other moment of the day, it seems there’s nothing left for you to possibly be ashamed of.”\n“I’ve quite a lot to be ashamed of, actually,” Merlin answered before he ripped off his neckerchief and tied it tightly about his head, effectively gagging himself with a thunderous expression. \nArthur blinked at him in genuine shock and a fair bit of hurt. \n“Well, except for that, apparently,” he said, though he lacked any real bite in his tone. \nFirst of all, Merlin was being ridiculous. He couldn’t possibly have any secrets worth fretting so much over. Secondly, it was just unfair. Arthur told Merlin nearly everything. It was both incidental to their working relationship and the foundation of their private one. Not that they had a private relationship, not really. Just that, maybe, sometimes, he would admit that Merlin was his friend. When he wasn’t being insolent and stupid beyond comprehension. When Arthur needed him to be. Without fail and without expectation. Often without reward. \nSo Merlin knew nearly everything about Arthur because he trusted him and because he had very little else to give to show Merlin how much. He couldn’t  tell  him, he’d rather jump out his chamber window than admit to any of it aloud. But he was the Prince and secrets, he had aplenty. \nMerlin kept them all. He even teased him about some. Consoled him about others. Gave disconcertingly sage advice about many. \nHe had thought it an equal transfer. Merlin had never seemed to hold his tongue around him, and this was equally infuriating as it was satisfying. He wasn’t afraid to tell Arthur whatever mad, treasonous, brilliant thoughts he had. He acted completely deranged sometimes, and Arthur let him because it was Merlin and he had never had any qualms about Arthur’s eccentricities, hard as they were to unearth. But they had been together for years now and Merlin knew him better than anyone. \nHe thought he knew Merlin just as well. \nThe thought that there was something Merlin was keeping from him, something he felt ashamed of enough to  gag himself  - it was awful. \nHe thought he could read him better than that. He always had in the past. Sometimes Merlin would fall into dark moods for no discernible reason and Arthur would prod him out of them with some effort. Because he could do that at least, could say ridiculous, pompous things until Merlin’s outrage outweighed his melancholy. But he had never really learned how to console someone, not properly. Not like Merlin or Morgana or Gwen. He couldn’t do anything to truly make anyone feel better except to distract them. \nMaybe that was why Merlin didn’t want to tell him. \nMaybe he knew Arthur was inept, knew he would only make things worse. Maybe he didn’t trust Arthur like Arthur trusted him. \nThe ride back to Camelot was silent and terrible and full of heavy things unsaid. \nAs soon as they arrived, Arthur waved away the knights with promises to give a report later. Most took one look at his scowl and Merlin’s thunderous expression and averted their eyes before scurrying away. \nThe gag still in his manservant’s mouth might have had something to do with it. \nGwaine looked at Merlin, blinked, turned to look at Arthur and his tense shoulders, raised a brow and grinned salaciously before looking back to Merlin. \n“Good on you, mate,” he said with a wink before Percival grabbed him by the scruff and dragged him off, the drunk bastard howling all the while, “Good luck, Merls!”\nArthur stared after him in confusion before turning to Merlin with a questioning look, forgetting for a moment that he would get no answers. \nMerlin’s face was bright red and mortified before he quickly ducked out of Arthur’s line of sight as he dismounted his horse. \nHe unlatched his saddle bags, and Arthur took the time to dismount himself before he handed off his horse to a stable hand. \n“Straight to Gaius,” he ordered, stopping whatever Merlin was trying to explain to the stable hand using only his eyebrows and very large sweeping motions with his hands. \nMerlin turned to scowl at him and did something with his eyebrows that Arthur knew was an insult. \n“Shut up,” he said, rolling his eyes, though he scoffed at the look Merlin sent him which clearly stated ‘but I haven’t said anything’. Entirely false. Merlin didn't need to use his voice to communicate insubordination, his face did it well enough. Something smug crossed Merlin’s face at Arthur's annoyance and he reached out to slap him upside the head on instinct. “Watch it, I’ll have you in the stocks for that!”\nIt was only as Merlin laughed silently that Arthur noticed the baffled looks the stable hand was sending them. Now that he was looking, half the courtyard was staring after them like they were a spectacle. \n“And take this off, you look like an idiot,” he barked, reaching out and digging his fingers into the gag. He tugged it down, his knuckles grazing the rough stubble Merlin had somehow grown throughout the day. His hair was dark and so it was always easier to see when he needed a shave than it was for Arthur. He should tell him to shave. \nHe might look good with a bit of beard though, Arthur thought distantly, before immediately kicking that thought far far away and moving to saner topics. \n“Arthur!” Merlin hissed, lips shiny from spit that had accumulated on the rag and Arthur didn’t answer, turning away and marching towards Gaius and answers and sanity. \nMerlin cursed something under his breath but followed soon enough. Arthur smiled a little at the sound of his boots pattering after him faithfully.\nGaius did not seem as pleased when Arthur swung open his chamber doors. \n“Sire,” he drawled, a perfunctory bow before his gaze trailed accusingly to Merlin where he stood behind Arthur. “What did you do now Merlin?”\n“Got cursed.”\nMerlin slumped into the room and fell onto the bench of the table across from Gaius, laying his head dramatically on a book of something or other Arthur didn’t bother to look too closely at. \n“Cursed.” Gaius echoed, unimpressed. \n“Cursed.” Merlin sighed back, like some kind of weepy maiden, as if it was the worst thing to have ever happened to him. The man had almost died on several occasions and been accused of witchcraft in front of Uther himself and  this  was what got him all mopey and resigned. Ridiculous. \n“He can’t lie,” Arthur supplied, walking further into the room and standing behind Merlin, pushing his head off the book roughly. Merlin squawked and glared at him before shaking his head and turning back to Gaius. \n“Yes, but that’s not all! It gets worse,” he said, fingers worrying at the glass vials scattered about absently, “I have to tell the truth. Answer questions when I’m asked. No redirecting or playing dumb. No lies, no omission. Just the truth.”\nGaius straightened in his chair with a look of dawning horror before his gaze flickered to Arthur for a moment, quicker than lightning, though all the more suspicious for the speed of which he caught himself. \n“I see.” Gaius said in a very controlled tone of voice. \nIt was the same voice he used when someone told him they had mild symptoms but he had already guessed that they would likely die before they recovered their health. \nWhatever lie Merlin was so desperate to keep, Gaius knew of it and thought it just as dire as Merlin did. Arthur had been willing to chalk it up to Merlin’s stupid and overblown shenanigans before but now he began to doubt. \nWhatever it was neither of them wanted Arthur to know. \nIt was a struggle to remind himself that Merlin was entitled to his secrets. He was, after all, his own person and had a life outside of his service to Arthur. He forgot that sometimes, and it was always a queer shock when he was reminded of it. The fact that Merlin had never really shared much of himself from his time before Camelot often escaped him, he felt he knew him so well it was as if those things had never happened. As if Merlin’s life before Arthur were incidental and wholly unrelated to the man he knew. But that was naive, and Arthur knew better. Just because Merlin never spoke of it did not mean that his private affairs had not shaped him.\nArthur might not like the thought of Merlin having faced such trials without his knowledge but that did not mean it had not happened.\n“He’s been suspiciously tight lipped ever since, not that I’m complaining,” Arthur said with a smirk, though if he were to be truthful the heavy silence and worried tilt to Merlin’s brow grated on his nerves more than his rambling ever had, “But I can’t have him spilling state secrets to the entire kingdom. How can we uncurse him?”\nThe sooner Merlin was back to normal the sooner Arthur could go back to pretending that he knew everything there was to know about him. He wouldn’t have to fret and wonder and be suspicious of the one person in this world whom he trusted with all he was. Merlin didn’t deserve that.\nBesides it was probably something embarrassing or off color, nothing more. Merlin had come from a small village, had a sorcerer with a treasonous loathing of nobility for his best friend. He was Fatherless in a world where lineage meant everything. Whatever he had done, whatever secret he kept, Arthur was sure it had only come about because of necessity. Merlin did not have it in him to do anything truly unforgivable. He was too good for it.\n“I can’t say, sire,” Gaius said, tossing a curious gaze toward Merlin, “But I’ll look into it. In the meantime it might be best to take Merlin off of his regular duties. The less people he interacts with the better, I think.”\n“If you think that's best,” Arthur agreed reluctantly, not thrilled by the idea of going through the rest of this ordeal without his manservant by his side. But needs must, and he couldn’t have Merlin embarrassing him every time he opened his mouth - more than usual, anyway.\n“But I’ve got so much to do!” Merlin protested, rather uncharacteristically if you asked Arthur. He was always trying to weasel his way out of work, always needling him for days off or showing up late and leaving early, doing things half way and with little care simply to get them done. He had never shown such initiative or pride in his work in his life. “I can’t be stuck here all day! I promised Vigo I’d look at the kitchen stores with him, and the girls in laundry have at least three lye burns I want to check on. Tom’s got a horse he can’t even step into the stall with without me there to reign it in and that’s not to mention the chores I’ve got to do for Arthur! I’ve got to clean up Arthur’s armor from that last fight, ding out all the dents, polish it, replace the wa-” He shoved his fist into his mouth at once, biting hard on his knuckles enough to break skin.\n“Replace the what?” Arthur asked, knocking Merlin’s hand away from his mouth and frowning at the trickle of blood that ran down his palm.\nMerlin’s other hand flew to his mouth as he answered, the words muffled and unintelligible as he cast a panicked look at Gaius.\n“The wax,” Gaius answered easily, rising from his seat to walk over to Merlin and take his bleeding hand from Arthur’s grasp gently, “For the leather straps, I’m sure. It seems your pension for rambling on will get the better of you with this curse, my boy.” He said to Merlin, frowning at him and the bite marks in his skin with great displeasure.\nMerlin lowered his hand at last and grimaced, turning his gaze broodingly to the table, as if he could find some cure in the whirls of the well worn wood. It wasn’t like Merlin, this brooding, the thundercloud expression on his face, and Arthur felt off balance and unprepared in the face of it.\n“I’ll take care of him, sire, worry not,” Gaius said, consolation and dismissal both, and Arthur nodded before he muttered a thank you and left with a pat to Merlin’s shoulder.\nMerlin’s absence did not go unnoticed. Arthur would almost be offended by the odd looks he received as he went about his day - as if he could not walk about his own castle unattended - if he did not also feel the missing presence at his back like a missing limb.\n“Cursed!” Gwaine shouted at him, as if Arthur had been the one who had cast the thing, when Arthur had reluctantly told the knights the tale.\n“Is it deadly?” Leon asked, all concern and loyalty, and Arthur snorted at the dramatics.\n“Not hardly,” Arthur told them, struggling with removing his armor before a squire ran over to help him, “He’s been cursed to speak only the truth. Only Merlin would fall victim to such a useless curse.”\n“Only the truth?” Lancelot asked, some odd weight to the question and the hesitation he held onto when all the other knights relaxed at the news.\n“Yes,” Arthur answered, eyes narrow and suspicious, “And he has to answer questions when asked. None of that insolence of his anymore, I’m afraid.”\nThe knights all laughed good naturedly at that, all except Lancelot who had grown alarmingly pale, eyes cast to his feet as if he was thinking very carefully about something dire.\n“He’ll be alright, Lancelot,” Arthur said kindly, taking pity on the softhearted knight, and patting his shoulder. \nMerlin had been his friend before he had ever been a knight, before he had ever bowed at Arthur’s feet. Arthur did not know how they had met or when, and frankly he did not think he wanted to. But Merlin was important to Lancelot in a way that Arthur couldn’t quite bring himself to look at clearly, but that he understood regardless. He was grateful for it, for him and his regard for Merlin, and the assurance that Merlin would be protected by someone else just as fiercely as Arthur protected him, but by someone with the chance to show it more clearly and without guilt. \n“I’m going to see him, then,” Gwaine said, equally as fond of Merlin and half as loyal to the crown. Arthur should be more worried about that. But Merlin was more loyal to him than anyone had ever been and where his loyalties lay so Gawaine’s followed. Merlin would never turn against him - the thought was laughable - and so he never had to worry about Gawaine either.\n“Gaius wants to keep him away from as many people as possible,” Arthur warned, waving away the squire now that he was fully out of his armor. He frowned at it where it was stacked on the bench and squinted, trying to see any evidence of wax on the leather. He didn’t think he’d ever seen Merlin do anything like that.\n“Maybe, but when else am I going to be able to make him spill all his embarrassing secrets?” Gwaine cheered, and Leon said something chiding even as he was drowned out by the laughter of the others.\n“I’d like to visit as well, by your leave, sire,” Lancelot said, far too serious for the situation.\n“You hardly need my permission to visit a friend,” he scoffed, waving them off with an uncomfortable grimace. Lancelot was very earnest, and while it was an admirable trait, it often made it hard for Arthur to keep his aloof pretense around him.\n“Let’s all go,” Elyan suggested, knocking Percival’s shoulder where the giant looked torn between amusement and concern, “No disrespect, sire, but I think we’d all feel better once we see that he’s alright for ourselves.”\n“Of course,” Arthur said, smiling and leading the way to the Physician’s chambers himself. \nHe had always appreciated how his closest knights were so fond of Merlin. The old guard, Uther’s men, had often cast suspicious glances or else dismissed him altogether. Some even questioned his right to follow Arthur into hunts and quests, as if Arthur had not ordered him there himself. It might not be custom to take servants along, but Merlin was better company than nearly all of those Lords and Knights put together. Not that he’d tell him that.\nThey piled into Gaius’ chambers, the lot of them pushing at each other noisily, as the Old Man cast them a disparaging look from his stack of books, as if they were misbehaving children.\n“Hallo Gaius!” Gawaine cheered, pulling out from the headlock Percival had caught him in with an easy grin. “Is Merlin about? We heard he’d gotten himself into a bit of a spot while chasing after the Princess again.”\n“Oi!”\n“He’s in his room. I’d recommend against bothering him.” Gaius sighed, gesturing up the narrow staircase to the broom closet of a room that Merlin ostensibly kept. Most of the time the bed was piled with clothes or books or other nonsense so that Arthur couldn’t imagine he actually slept there. He must have dumped it all to the floor nightly, only to throw it back onto the bed at dawn. Maybe that was why he was always late. Fighting an avalanche every morning must be time consuming.\n“We’ll only be a minute,” Gwaine said cheerily, striding toward the steps with purpose, heedless of the look the old man shot at him.\n“No, Sir Gwaine, I don’t-”\n“What are you all doing here?” Merlin himself asked, popping his head out from the flimsy door of his room with exasperation. The knights cheered at the sight of him, hurrying in to surround him with pats to the back and jibes.\n“Yes, yes, hello everyone,” he muttered, slipping out from the group and sitting next to his mentor while rubbing his brow as if he had a headache.\n“Got yourself cursed, then?” Gwaine cheered, as if it was funny, leaning on the table next to him.\n“Yes, it seems that way. You’d think I’d learn to stop jumping in front of spells meant for Arthur by now.”\n“Well, we’re lucky it was you and not him,” Leon said, a consoling smile on his face as he stood politely along the wall across from them, “It would be disastrous if the Prince couldn’t hold his tongue around the right people.”\n“That and I think Arthur would die if he had to be honest about his emotions even once,” Elyan said dryly, ducking the affronted slap Arthur aimed at the back of his head.\n“Meanwhile you never hold your tongue in the first place,” Percival said with a fond smile.\n“I hold myself back more than you’d think, actually,” Merlin said, immediately sighing afterwards as if he hadn't meant to say that.\n“Oh, really?” Gwaine said, eyes bright with mischief as he leaned toward him eagerly.\n“Really,” Merlin said, clearly forcing back other words that wanted to spill forth.\n“Are you going to be alright?” Lancelot asked, worry clear as day in his voice, and Merlin blinked away his annoyance enough to offer him a warm smile in thanks.\n“As long as I can keep my mouth shut as much as possible,” he said with a shrug and a wry smile.\n“Don’t be like that, Merlin!” Gwaine whined, sliding down to sit uncomfortably close to Merlin on the bench. “This is a good opportunity for some bonding. Tell us something embarrassing then, hm? Oh, I know, there’s a rumor going around that you’ve got yourself a love! Is it true? Is she one of the maids?”\n“No,” Merlin said, blinking at Gwaine as if he had grown two heads, “I’m not in love with any maid.”\n“Oh, but you are in love?” Gwaine pressed and Merlin shuffled back in his seat awkwardly.\n“Yes, obviously,” Merlin muttered, clearly trying to stop himself and failing.\nThe knights made various interested and curious sounds and Arthur stared at Merlin in horrified shock. Merlin was in love?  Mer lin? With a girl? Who? Not a maid, he said, but who else could there be? How hadn’t he known? How had Gwaine known, for that matter?\n“Is it Gwen?” Elyan asked, curious, and a little accusatory, heedless of the horrified looks Lancelot and Arthur shot him.\n“No!” Merlin said, aghast, “I already said it wasn’t any maid! Gwen’s lovely, and I do love her, of course I do, just not like  that .”\n“Lady Morgana, then?” Percival asked, as if that wasn’t a horrible thought. Merlin and Morgana had been awfully familiar lately, and Arthur had caught them whispering to each other in corridors more than once, but he couldn't imagine them together, not like that. It was unthinkable.\n“No, it's not Morgana,” Merlin said with a roll of his eyes and a snort as if the idea was amusing, “I’m not her type. Far from it. Besides, I think we’re too similar. We'd tear each other apart if we tried anything like that.”\n“What does that mean?” Arthur asked, baffled. First of all, he hadn't a clue what he meant about Morgana’s type. Merlin was fine. Perfectly alright, actually. Just thinking about what other kind of person Morgana could be attracted to made him feel like he wanted to wretch though, so he moved on to other thoughts. \nWhat on earth had Merlin meant that they were too similar? They were nothing alike. Morgana was cunning and unbending, the kind of viscous that was frightening to behold if you crossed anyone she held dear. Merlin was harmless.\n“Oh come off it, Merlin,” Elyan smiled, all easy friendship, “You’re not similar at all. The Lady is one of the most frightening women I've ever met, and I say that with great admiration - you, well, no offense, but you’re harmless.”\n“No, I’m a pacifist,” Merlin argued with a frown of affront.\n“What’s the difference?” Gwaine barked out a laugh.\n“If you’re not at least capable of great violence, you're not peaceful, you’re harmless,” Merlin answered easily, rubbing at his head again with a pained grimace, “It’s the choice that makes the difference. A good man chooses to be good when he has the option to be cruel. A man who never had to choose isn’t really all that good now is he?”\nSilence echoed through the chambers then, all eyes on Merin as he seemed oblivious, too focused on his aching head.\n“Gaius do you have anything for this headache? I feel like Arthur’s used me as a training dummy again,” he muttered with a pout, before he seemed to realize that everyone was staring at him in surprise, “What? Is there something on my face?”\n“No,” Leon said after a long moment where no one said anything at all, “No, it's just, well, that was unexpectedly wise of you, Merlin.”\n“Unexpectedly? I’m always wise, Leon,” Merlin said with a teasing grin, jolting as Gaius placed a vial of something foul next to him with a clack.\n“If you all don’t mind, Merlin needs his rest, and I need some peace and quiet in order to fix this,” he said, gesturing to Merlin as if his entire person was the evident problem, “Besides, I can’t say I approve of you lot forcing things out of him when he hasn’t any choice in it. You should know better.”\nSuitably chastised, the Knights muttered apologies and goodbyes, shuffling out of the room, content now that they’d seen Merlin up and about with their own eyes.\nGaius sent him a look when he refused to move. He raised his brow at the man in a challenging look he had learned from him, incidentally enough. The physician smiled and shook his head, patting Merlin on the back and excusing himself to go raid Geofrrey’s library for relevant books on truth spells.\n“I’d ask you to refrain from asking him any questions, sire,” Gaius muttered as he passed him, gaze heavy and serious, “At least while he can’t answer of his own free will.”\nArthur nodded, though he gripped his crossed arms tighter at the reminder that Merlin had been keeping things from him of his own free will.\nAfter he had left, it was just the two of them, and Arthur gestured impatiently at the tincture in front of Merlin. Merlin rolled his eyes but took it and downed it with a grimace and a cough.\n“Disgusting,” Merlin hissed, “I don’t know how he manages to make it taste like that. Nothing in there should do that!”\nArthur snorted and crossed over to sit on the other side of the table from him, chin in his hands almost boredly.\n“The headache,” he muttered gesturing to Merlin’s dark curls absently, “Is that part of the curse?”\n“I think so. It’s worse when I’m compelled to tell the truth,” he answered, eyes down and refusing to meet Arthur’s own.\nSilence reigned for a long moment, unnatural and unwelcome between them.\n“You never told me you were in love,” Arthur said against his better judgment. \nHe didn’t know why it bothered him so much. Merlin’s flights of fancy had nothing to do with him really. It's just that Merlin had been privy to several failed courtships of his, helped him pursue them and nurse the fallout, whether it were heartbreak or embarrassment. He would have thought that Merlin would have asked the same of him, before anyone else. Had he asked Lancelot? Gwaine? He hadn’t ever considered Merlin falling in love at all, if he were honest. The idea came to him now though, the thought that maybe Merlin would meet someone, and marry her. That he would resign in order to start a family. \nA manservant's job was for a young man with no family duties to distract him. Merlin’s spouse would be due all of his attention, when he married, adn Arthur would have no grounds to deny that.\nThe thought made him distinctly uneasy.\nThe idea of children with Merlin’s dark hair and blue eyes running to some strange woman, all of them unfamiliar to him as Merlin went to embrace them lovingly - he hated it. He hated that it was a possibility and he had never even known.\n“No, I didn’t.” Merlin’s answer was defensive but honest. He couldn't be anything but honest, not now.\n“And why not?” Arthur asked, picking a splinter out of the table to mask the earnestness of the question.\n“I didn’t think you’d want to know,” Merlin said, at last, sounding as if the words were tearing out of him against his will, “And I thought you already knew, at least a bit. I’ve not been very subtle.”\n“Subtle enough,” he said, angrier than he meant to be. \nMerlin was silent and Arthur regretted the words though he couldn't bring himself to meet his eyes and apologies for them. Merlin had been one of the first people he had ever learned to apologize to. The first person he'd wanted to forgive him. The first person who’s approval he had to earn that wasn’t his Father.\n“Are you angry with me for it?” Merlin asked then, voice small and almost frightened and Arthur did look up then, though now it was Merlin who was avoiding his eyes.\n“No,” he said, whispered, before he cleared his throat and tried again, “No. You’re entitled to love whomever you want. It’s nothing to do with me.”\nMerlin flinched at that, and Arthur didn’t know why, didn’t know what he’d said wrong. Merlin looked at him then with pain blatant on his face, his eyes searching his as if asking him to take back what he said.\n“It’s everything to do with you,” Merlin choked out before his eyes widened and he surged to his feet, hurrying to his room without another word.\nArthur sat there for a good minute, stunned. What did he mean by that? \n ‘It’s everything to do with you.’  \nWhat did that mean?\nArthur couldn’t quite believe what his natural conclusion was. \nIt didn't make sense. He couldn't have meant that. Not Merlin. Not Arthur.\n“What did you mean by that?” He heard himself ask, slamming open Merlin’s bedroom door before he could catch himself. “Merlin! What did you mean?”\nMerlin was huddled on his bed, one knee drawn up to his chest, the other hanging over the side, his arms crossed and his face buried in them. He glared up at Arthur at the question, defiant and furious and hurt and Arthur balked at the sight of tears in eyes, though they had yet to fall.\n“I meant just what I said.” Merlin blinked as he said it in an oddly cryptic way, not lying but not answering and Arthur felt frustration mixed with something else bubbling in his chest.\n“You being in love,” he said slowly, closing the door behind him, not taking his eyes off of his manservant where he sat on his bed in the dark, glaring up at him from under his lashes like he would fight him if he got too close, “has everything to do with me?”\n“Yes,” Merlin spit out, as if he hated the words as they were forced from his lips. He didn't stop glaring at him, didn’t turn away in shame or fear. His gaze was stormy and firm and tears glistened on dark lashes and Arthur could feel his heart thudding in his chest.\n“Merlin,” he said, and in any other instance he’d have been horrified at the give in his voice then, the softness, but not now, “Merlin. Do you love me?”\nMerlin was silent for a very long minute before he closed his eyes slowly, sighing as if resigned.\n“Yes.” He said and Arthur blinked at him, at the softness of the word, no fight or anger in it as there had been up till now.\n“You love me.”\n“Yes.”\n“You’re in love with me?”\n“Yes.”\n“Romantically?” He asked, just to be absolutely certain.\n“For the love of - yes, you arse, I’m in love with you. I love you. Romantically. Stupidly. Sexually - whatever. I love you.”\n“Sexually!” Arthur barked, horrified that he had said that, admitted to that aloud, what on earth was he thinking, had he no shame? Of course not, he thought half hysterically, Merlin had never had any shame at all.\n“Is that really the part that’s got you worked up?” Merlin asked dryly, as if Arthur were acting a prude. As if admitting that he desired him like that wasn’t earth shattering, wasn’t world changing.\n“Since when?” Arthur asked, distantly, and urgently because he needed to know and because he needed to stop thinking about the word ‘sex’ in Merlin’s voice, reffering to him and Merlin, Merlin and him,  sexually -\n“I don’t know,” Merlin said, throwing up his hands as if he was frustrated with the whole thing, “Since always? You’ve always been attractive but I wouldn’t have touched your personality with a ten foot pole at first. Just, somehow, you got better, and then - I don’t know. I couldn’t leave you. I just looked at you one day and I - I don’t know, I realized it. But it had been true for a long time before then. So I don’t know  since when, Arthur, I don’t think it works like that.”\n“Why -” Arthur said, horrified when his voice cracked before he cleared his throat and looked at his feet, his face hot, “Why didn’t you say anything?”\n“I told you,” Merlin sighed, leaning his head on his folded arms atop his knee as if he were exhausted by the conversion, as if this wasn’t perhaps the most important conversation they’d ever had, “I didn’t think you’d want to know. I thought you already suspected.”\n“What? I had no idea! And why wouldn’t I want to know?” He couldn’t imagine why Merlin would think that. \nArthur burned with the knowledge. He hated not knowing, thinking that it was someone else, that Merlin was meant for someone else. But he wasn't. He loved him. He’d said so.\n“You didn’t know?” Merlin asked, curious and confused and Arthur almost laughed in his face at the baffled look to him. “I thought I was being pretty pathetic about the whole thing. Morgana saw it. Gwen too. Gaius. I think even your Father knows it, though I can’t be sure. Sometimes he looks at me a certain way, though, and when he dueled that wraith he asked me to take care of you. He said he was glad that you had me. I always thought that was odd. Made it harder to hate him, for a moment, despite everything.”\n“You hate my Father?” Arthur asked, drawn up abruptly from his hazy euphoria. He knew Merlin was afraid of his Father, though that was fair enough as he was the bloody King. A certain amount of fear was healthy. But he hadn't thought Merlin hated him. He hadn't thought Merlin hated anyone.\n“With everything I am.” Merlin said, looking away as if ashamed to admit it. “But that’s not the point.”\n“The point?” Arthur asked stupidly, not following.\n“I’m sorry.” Merlin said, not meeting Arthur’s eyes, his tears falling freely now and Arthur didn’t know what to do with himself at the sight.\n“Sorry?” He echoed, absently.\n“I know you must hate me for it,” Merlin said with a miserable sniff, “I never meant to make you uncomfortable. I understand if you don’t want me on as your servant anymore, but please don't send me away. I couldn't bear that.”\n“What?” Arthur asked, confused, horrified. “Why would I send you away?”\n“Because I love you?” Merlin said, as if he was just as confused as Arthur. “Because I want you? Because you have enough to deal with without me lusting after you and making you have to worry about it. Half the Ladies and Princess’ you’ve ever met have looked at you like a piece of meat and I never wanted you to feel like that with me. I’m sorry.”\n“Lusting?” Arthur echoed, heat flaring up his neck at the words, though Merlin just looked at him like he’d gone mad. He felt like he was going mad. Merlin needed to stop casually mentioning that he desired Arthur carnally or he was actually going to lose his mind.\n“Yes.” Merlin answered, because he had to, because he was cursed to tell the truth and Arthur had asked him.\n“I don’t hate you.” Arthur said, trying to make it obvious how stupid of a notion that was. And it was. Merlin made him angrier than almost anyone could, baffled him beyond reason, drove him insane with insolence and ineptitude and snark. But Arthur could never hate him, not for anything, not really. Not wholly. “Why would I hate you for that?”\n“Because now you think you can't trust me.” Merlin choked out, and looked like he regretted the words as he said them. He gasped on what might have been a sob as he said it and Arthur still didn’t know why he was crying or how to make him stop.\n“What are you talking about? No, I don't. Why wouldn’t I trust you?” \nNone of this made sense. Merlin kept making jumps that Arthur couldn’t follow, not now, while trying to process all of this. Often he couldn’t follow Merlin’s train of thought, and that was on a good day, when neither of them were enchanted and they were emotionally stable. Right now neither of those things were in their favor.\n“Because I’m a liar!” Merlin gasped out, grasping at his hair in despair as the words ripped out of him against his will.\n“Merlin,” Arthur said, stepping forward and taking his hands away from his head before he could think too hard about it, “Not telling me that you-” his voice hitched, the words impossible and true and unwilling to be spoken aloud, not yet, “That you feel. That way. About me. That's not a lie. That's- understandable. Stupid. But fair. I don't blame you for that. Unless you’ve been lying to me about something else?”\nHe quirked a weak smirk down toward him at the joke but the horrified look on Merlin’s face killed it quickly. He made a weak sound, ripping one of his hands away from Arthur and shoving it into his mouth, screwing his eyes shut as if he was in pain.\n“Merlin?” Arthur asked, shocked, afraid of whatever it was Merlin hadn’t wanted to say so badly that it put a look like that on his face. Merlin shook his head harshly, a heart rending sound sneaking out from behind his hand before he pitched forward and pressed his forehead into Arthur’s shoulder, free hand clutching his desperately.\nArthur stood there feeling Merlin’s breath hitch out unsteadily against his collarbone, felt the shaking of his shoulders, and was afraid for the first time in a very long time.\n“Merlin,” he said, and reached out, pulling Merlin’s hand away from his mouth, staring in horror at the bloody crescent his teeth had left in the flesh, torn open and vivid red.\n“Arthur, please,” Merlin gasped out on a sob, ducking away from him, trying to back away, as if Arthur was hurting him with his touch alone, “I can’t. Please, Arthur, please.”\n“What are you afraid of?” Arthur asked.\nMerlin sobbed, face red and splotchy and wet and Arthur had seen Merlin cry, but not like this. Not ever like this. He looked as if someone were killing him, as if someone had killed someone he loved.\n“I’m afraid of- of what you’ll have to do once you know. Once you know the truth,” Merlin said, and hatred like Arthur had never seen in him flashed across his face as he slammed his own hand down onto his thigh, as if he could make himself shut up with pain alone.\n“Stop it!” Arthur barked, afraid and confused and hurting. He gripped Merlin’s offending hand tightly, probably too tightly, tight enough he could feel the delicate bones in his wrist, the pulse of his blood. “What do you mean ‘what I’ll have to do’? Merlin, what the hell are you talking about? What truth?”\nMerlin was so desperate, so afraid, and Arthur felt ice in his veins at the thought that Merlin was that frightened of him. Hadn’t he just said he loved him? Why would he be so afraid then? What had Arthur ever done to make him that scared? He’d been rude and callous on occasion, he could admit. He threw things at him and slapped him upside the head too often and was too rough with him in general, he knew, and he’d work on it, he would. But he’d tried, as much as he knew how, to show Merlin that he could trust him. That Arthur cared about him. That they were safe around each other if no one else. \nHe had thought Merlin knew that. He had thought, this feeling, this safety and security and admiration and respect, was mutual. \nMerlin loved him. He had said so. He couldn't lie.\n“Arthur,” Merlin gasped out, shaking his head, eyes wet and sadder than Arthur could bear, shaking like a leaf in the wind, “Arthur, I’m sorry. I’m so sorry. I only ever used it for you. Everything - it was all for you. I’d do it again. A million times. For you.”\n“What are you talking about?” Arthur asked, stepping back, suddenly feeling certain that he didn't want to know.\n“I’m,” Merlin gasped, stopping to breathe through his sobs, “I’m magic. I’m a sorcerer, Arthur.”\nArthur stared at him, emptiness rushing in to fill his trepidation and fear.\n“No. Why would you say that? No, you’re not.” Arthur said, shaking his head, the words a bizarre echo from his Father’s court, where he’d said them more than once, where he’d been certain that Merlin was innocent, was good. “I’d know, Merlin. You are not a sorcerer.”\n“Look,” Merlin gasped out, frantic and urgent, “Here.”\nHe raised his hand toward the sad little hearth across the room, the embers glowing weakly. His brows furrowed and his weeping eyes flashed golden like the sun, molten and precious.\n“ Upastige draca,” he whispered, his voice deep and familiar and foreign all at once. The embers melted out from the hearth, coalescing into one and wiggling themselves into a shape. A little dragon made of flame blinked at them, shaking out its wings and taking a few cautious steps about, as if testing out its new legs. Living, moving. Life from nothing but flame and ash.\nMerlin turned to look back at him, and Arthur thought he looked heartbroken, but Arthur couldn't be sure. Not anymore. He couldn't be sure of anything at all when it came to Merlin, not after this.\n“No,” Arthur said, stepping back, and Merlin fell out of the bed, tripping over himself in his haste to stop Arthur.\nArthur flinched at the movement and Merlin jerked back as though struck at the sight of it.\n“Arthur-” Merlin started but he  cut him off.\n“No!” He barked. He couldn't hear it, couldn't hear him say his name like that. It made him want to go to him, to console him, and it was a trick, and enchantment, it must be because Merlin was a sorcerer. \nHe couldn’t lie. He had to speak the truth. He had shown him. His eyes had flashed gold and inhuman and it hadn't been Merlin, not his Merlin, not the Merlin who made his bed and rolled his eyes at him and told him he loved him. No. That Merlin hadn’t been real, had he? A trick. A lie.\n“You’ve lied to me all this time.” He couldn't recognize his own voice, couldn't recognize the emotion in Merlin’s face. He had thought he had known that face. None better.\nMerlin didn’t say anything, only made some odd keening sound and hung his head in acceptance.\n“I thought,” he said, thought to say ‘ I thought you loved me’ but the words hurt too much to speak, “I thought I knew you.”\n“I’m still the same person,” Merlin whispered, wretched and folded into himself on the ground. Merlin always had some odd sense of pride to him despite his station. Some inherent nobility that the Lords hated and Arthur had always adored.\nWhere was it, now? Gone, with the rest of the Merlin he had thought he knew.\n“I trusted you,” he said, and he felt tears well up in his own eyes despite his better judgment.\n“I’m sorry,” Merlin said, meeting Arthur’s gaze though he wished he wouldn’t.\n“I’m sorry too.” He heard himself whisper and then he was stumbling out the door, out of Gaius’ chambers, into the hall.\nMerlin had been tending to his duties quietly, unobtrusively. Every morning he came to Arthur’s chambers and threw open his curtains to let the sunlight in and every morning Arthur opened his eyes and felt his heart sink when he remembered he couldn't be happy to see him. \nNot anymore.\nHe didn’t linger anymore, not like he used to. He didn’t trial Arthur’s steps throughout the castle, he didn’t smile at him or joke with him. He didn’t dress him, only left his clothes laid out neatly for him to fight with alone. He brought his meals in when Arthur wasn’t looking and took the trays away while he was out. He helped him into his armor quickly and without meeting his eyes. He was never around unless he had to be. Arthur hadn’t realized how much of Merlin’s presence was voluntary. How much he relied on it. Craved it.\nIt was cold. Merlin was trying to light the fire, but Arthur only knew it because the flick of the flint had distracted him from his work at his desk. He hadn’t even noticed Merlin come in. If he had been asked only a week ago he would have claimed Merlin incapable of such stealth. He would have decried him as a terrible liar and he would have laughed at the notion he could ever be a sorcerer.\nOdd that it had been only a week ago.\nArthur watched him, the line of his shoulders, the curl of dark hair against the knot of his neckerchief and his jacket’s collar. The flint sparked three more times but refused to light any flame.\n“Why don't you use magic?” He asked, startling both of them.\nMerlin almost dropped the flint and turned to stare at him in surprise. Arthur clenched his fists against his desk, caught unawares by the resignation in those blue eyes. He hadn’t gotten a proper look at them since that awful night.\n“Habit, I suppose,” Merlin muttered, hands lowering, a question in his eyes.\nArthur took a deep breath. Merlin had been cursed to tell the truth. He had sworn that he had only ever used his magic for Arthur. He could not lie.\nHe tilted his head toward the hearth, pretending he didn’t see the way that Merlin’s shoulders relaxed for the first time in days. For a long moment he didn't move before he seemed to steel himself, back straightening and shoulders squaring.\nArthur waited for him to raise a hand toward the hearth again, for strange words in a tone of voice he had never heard Merlin speak in before. Instead, a flame sprang to life with no signal or warning. No spell, no movement. Merlin sighed and the flames crackled and Arthur would not have known it had been magic if he had not watched Merlin do it.\n“Feels strange,” Merlin murmured, a wry grin on his face as he turned to face him, though it didn't even come close to reaching his eyes.\nArthur didn’t say anything in reply. He did not laugh and ask him if he had any idea how strange it must feel for Arthur. How it felt to look at the one person he thought he knew best, the one person he thought he could trust more than anyone, and see a stranger. To feel angry and betrayed and to be unable to bring himself to send him away. To throw him in chains. To sentence him to death.\nHe should. He knew he should. Every law and lesson he had ever been taught urged him to. But the very thought of it made him ill. The idea that it could be Merlin in chains, awaiting execution, on the pyre or the headsman’s block - it made him furious and frightened in turns. \nHe couldn’t even bring himself to exile him. Couldn’t even fire him. He could barely stomach this silence between them, he couldn’t bear the emptiness of Merlin’s absence, certainly not the knowledge that he had been the one to do it.\nHe was pathetic. He was likely enchanted.\nEven that wasn’t enough to turn his anger to hatred. It ought to be. A part of him wished it were.\n“Why are you doing this?” He asked, as Merlin rose and began to collect his soiled laundry. He stopped in his task and stared at him in confusion. “Why are you still acting like a servant?”\nMerlin straightened then, a look on his face as if Arthur had slapped him. Something hard and determined came over him after a moment, a look that Arthur had only seen rarely, in oblique glances when Merlin was set on something and nothing could stop him. Arthur had always been too distracted by his own quests, his own trials, to really look at that expression, to see the strength behind it, the certainty, the power. \nPower had not been a word he associated with Merlin.\nNot until now.\n“It’s my destiny. It has been since the day we met.”\nHe sounded so certain, so steady. Arthur had never put much stock into the notion of destiny. Fate seemed something incidental to one's birth and unimportant thereafter. Men made their own fates. That’s what Uther had alway taught him.\n“I tried to take your head off with a mace the day we met,” He drawled, sitting back in his chair, entirely unconvinced by Merlin, though his heart wavered at his words despite his hesitation.\nMerlin smiled a little at that, and Arthur tried very hard to ignore the flood of relief that surged through him at the sight. It had been days since he had seen Merlin truly smile. He had not wanted to notice but he had, as he always had. Merlin’s happiness was vital to him. His own could not flourish without Merlin’s as it’s foundation\n“And I stopped you, using magic,” Merlin said, amused.\n“You cheated!” Arthur cried, sitting forward in outrage.\n“You were going to kill me,” Merlin shrugged and Arthur made to roll his eyes and say something annoyed before the situation caught up to him. \nHe hadn’t been going to kill him. Not then. Hadn’t even thought to. He’d only been annoyed and embarrassed and intrigued, he’d only been trying to push him, to make him grovel and back down.\nBut Merlin didn’t know that. He didn't know that then and he didn't know it now. Arthur didn't even know it, not really.\n“I should’ve,” he said, and hated the words as soon as he spoke them, hated the way that they were true. \nIf he had killed him then he wouldn’t have had to suffer the pain of not being able to do it now. Of having to make the choice. He didn't want to have to make the choice. Not with Merlin.\nMerlin didn’t seem upset by that. Didn’t even seem surprised. He just shrugged and leaned against Arthur’s desk with a little smile, still sad around the edges but better. Arthur didn't like the ease with which Merlin accepted such a statement. Merlin shouldn’t be so comfortable with someone telling him they wanted him dead. Especially not Arthur. Even if he didn’t mean it, not really.\n“I'm glad you didn’t. I do this because of you, Arthur,” he said, straightening the papers on his desk, fiddling with the inkwell, a melancholy but fond smile tugging at his lips as he looked up to meet Arthur’s gaze, “Without you Camelot is nothing. I believe in you, who you are. As a man, as a Prince. The King that you will become. The kingdom you will build.”\nArthur looked away, hands fisted on the table top as Merlin sighed and pulled away. The space he put between them hurt. Arthur hated it as much as he knew it was necessary. He had to give Merlin credit where it was due. He had kept the distance between them, kept the formality and the chill. Arthur couldn’t have done it. Merlin had done it for him, just as he had always done when Arthur couldn't do things himself.\n“More than that, I do it because you are my friend. Whatever else we are, that won’t change.”\nArthur pushed to his feet at the words, at the sound of Merlin’s steps retreating toward the door. The scrape of his chair on the stone was too loud, too abrupt. He saw Merlin flinch and he hated it. Hated himself for making him afraid, hated this distance, this betrayal, this rift between them. Merlin had put it there and Arthur was duty bound to uphold it but he couldn’t. He couldn’t go on like this.\n“Why did you never tell me?” He hoped Merlin didn’t hear the break in his voice, or that he would be gracious enough to ignore it. Merlin had always had more grace for him than Arthur deserved.\n“I wanted to,” he answered, turning to peer at Arthur curiously, seemingly unconcerned. As if all the grief had gone out of him and all that was left was resignation.\n“But you didn’t.”\n“You would have chopped off my head.” Merlin said easily, his eyes sharp but not accusing. The unspoken knowledge that Arthur still might sat heavy between them. Merlin did not look afraid. He had been, before, when he had told Arthur. He had been shaking and crying, he had begged him not to force him to speak the truth.\nArthur had not listened. He never listened, not when it mattered. Now they suffered the consequences.\n“I’m not sure what I would've done,” Arthur said, as close as he could to admitting that he didn't know what to do. That he wanted Merlin to tell him.\nMerlin should have run. Arthur had given him the chance, had tried to give them both the chance. If Merlin had left Arthur wouldn’t have to see him executed. Arthur wouldn’t have had to pretend that he hated him when all he felt was grief.\nBut Merlin didn't seem afraid to die. He didn't seem afraid of the pyre though the thought terrified Arthur. He had been so scared to tell him, but now he didn’t seem to fear the consequences of the revelation.\n“And I didn’t want to put you in that position,” Merlin said, with such regret in voice that it took the breath from his lungs. \n“That’s what worried you?” He asked, incredulous, run through. “That’s what you were afraid of?”\nMerlin smiled a little self deprecating thing, the kind of charming smile that made him seem like a bumbling idiot half the time, like a mischievous boy the rest of it.\n“Some men are born to plow fields, some live to be great physicians, others to be great kings,” he said, walking over to pick up the basket of Arthur’s laundry, “Me, I was born to serve you, Arthur. And I'm proud of that. And I wouldn't change a thing.”\nHe said it so simply, so certainly. He said it like a promise. Like a farewell.\nArthur didn’t want to say farewell. He never wanted to say it, not to Merlin.\n“You could have so much more than that,” Arthur said, desperate to stall, to keep Merlin here where they could argue and fight and Merlin was safe from prying eyes and heavy laws, “With magic like that, you could have anything. Go anywhere.”\n“Go where? Everything I want is right here,” Merlin blushed a little after he said this, looking away for the first time as if he hadn't meant to say that.\n“Maybe,” he said, rounding the desk to be closer to him, “but is this- this destiny, or whatever you call it, worth dying over? You know the law. You’ve always known the law.”\nHe had been here for nearly a decade and had seen countless executions of people just like him. He had smiled and laughed and the entire time the axe had been hanging above his head. Every breath he took at Arthur’s side was a risk to his life. He knew it, had to know it. Arthur couldn’t stand it.\n“Yes. For you, I’d give my life easily,” Merlin said and he meant it. Arthur knew he meant it because he had tried to do it before. Had drank poison for him, had jumped in front of bandits, and assassins, and curses for him.\n“Well I never told you to!” Arthur barked, trying to keep his terror at the idea locked behind his anger where it belonged.\n“Since when have I cared what you told me to do?” Merlin snorted, some of his usual insolence slipping through the heaviness.\n“Dammit, Merlin, why can’t you just leave?” Arthur asked, pleading and furious and afraid.\n“Do you want me to?” Merlin asked, and there was the fear in his eyes, clear now when it had been absent as Merlin spoke of his death like a forgone conclusion.\n“No,” Arthur choked out, “Yes.”\n“You know you’re not making sense, right?” Merlin chuckled, though it was a wet, sad sound, and his hand came up to grasp Arthur’s sleeve hesitantly. As if he was afraid Arthur was going to leave him.\n“None of this makes sense, Merlin,” he sighed, stepping closer to him, taking that hand in his own, “You’re not safe here anymore.”\n“I never have been.” Merlin blinked at him as if he was being stupid. As if he didn’t know that, as if it was a moot point. As if Merlin’s safety wasn’t worth arguing about, as if it never factored into his own choices. \nMerlin had never been safe. Not in Camelot, not in Ealdor, not in Arthur’s chambers.\nEven if he did leave, what kind of life would that be? Uther had convinced the allied kingdoms to ban magic on pain of death. Those Kingdoms not allied with them either held the same law or considered sorcerer's chatel. Merlin’s native Essetir enslaved any known sorcerer to the service of the crown. Merlin wouldn’t stand for it. He was a terrible enough servant, he’d never make it as a slave. He’d spend the rest of his life on the run. \nArthur couldn’t allow it. But he couldn’t let Merlin stay here, hiding in the shadows, under the constant threat of execution.\n“You’re still cursed?” Arthur asked, and Merlin binked before nodding at him slowly, clearly confused. “Have you ever enchanted me?”\n“No.” Merlin said immediately, blinking at his own quick answer in surprise.\nArthur nodded and sighed a breath of relief. He had feared otherwise. He would have liked to say that he trusted Merlin not to take away his free will, but he was still reeling from the things he had thought he knew about Merlin. He couldn’t afford any assumptions. Not now. Not with Merin’s future on the line.\n“Can I trust you?” He asked, grip tight on Merlin’s hands.\n“I’m loyal to you, Arthur, before anything else,” Merlin said, a tinge of annoyance to his voice, “I just said that about five times, thanks for listening.”\nArthur huffed out something that was almost a laugh and startled at the delight and relief that it brought to Merlin’s face. He had forgotten, in his own turmoil, that Merlin must be just as miserable as he was. Maybe more. \nHe had spent all this time in quiet acceptance while he waited for Arthur to decide his fate. To decide whether he would lose his home, his friends, his very life. He had stood patiently at Arthur’s side day after day, folding his clothes, making his bed, while he waited for him to banish or kill him.\nIt was ridiculous. It was exactly the kind of passive, stagnant thing Merlin would never do. Not unless he was completely serious about what he said, about not wanting a life anywhere else.\n“You,” he said, mouth dry, fear in his throat, because he really didn’t want to know, actually, if he was wrong, if he’d ruined everything, “You still love me?”\nMerlin gaped at him for a moment, and Arthur would have laughed at him if he weren’t so nervous for his answer.\n“Wha- yes? Always,” he said after an awful, silent minute, incredulous and a little offended, “Why? What’s that got to do with anything?”\n“Nothing, just checking,” Arthur said, grinning despite himself.\n“You and your ego,” Merlin muttered and Arthur couldn’t help but pull him into a hug.\nIt shut him up well enough anyway, even if Arthur was horribly embarrassed as he pulled back. The dopey look on Merlin’s face was worth it though. Maybe enough to convince him to do it again. Later.\n“From now on, you don’t do anything magical without my knowledge,” he said sternly, all Prince and none of the friend of earlier, “If you’re going to stay in Camelot I’m not letting you get us both tried for treason.”\n“Both?” Merlin echoed stupidly.\n“Yes, idiot, I can’t very well pretend that I wasn’t harboring a sorcerer in my service,” he scoffed with a cuff to Merlin’s head, though he caught it at the last minute, ruffling his hair roughly to cover the mistake, “Who’d believe you were smart enough to hide it from me? Ridiculous.”\n“I did though,” Merlin said, still confused.\n“Shut up,” Arthur turned to head to the door, “Let’s go, we need to see if Gaius has found a way to break your curse yet. Your honesty is going to lose us our heads.”\n“Wait, so you’re okay with me now?” Merlin asked, incredulous, looking at Arthur as if he was speaking nonsense.\n“Oh no, I’m still furious with you,” Arthur assured him, “But the magic is just another one of your many, many shortcomings, I suppose. I’ll learn to muddle through somehow.”\nMerlin stood stunned for a moment, before a hesitant smile came over his face.\n“And the- the other bit?”\n“What other bit?” Arthur asked, annoyed at Merlin’s stalling. Really, the sooner they got this honesty business over with, the easier he would sleep. What if the wrong people asked Merlin the wrong questions? It would be a nightmare. Literally the contents of the last few bad night’s sleep he had suffered through.\n“You know, my being smitten with you, and all,” Merlin said with a little awkward shrug.\n“What about it?” He asked, baffled.\n“It's just,” Merlin said, and he looked embarrassed now, which was ridiculous considering the course of their last two conversations, “You’ve not actually said anything about it.”\nArthur blinked at him in disbelief. Merlin was so stupid. How he had managed to hide not one, but two, earth shattering secrets from Arthur he would never understand.\n“Right, well, at least we know you have good taste.”\n“Arthur-”\nArthur cut him off with two quick steps back into his space, before he leant in and pecked him lightly on the lips. \nHe retreated hastily, face hot and unable to meet his eyes. He hadn’t actually thought about it, not so clearly as that, but it had felt right. He hadn’t realized that Merlin was actually a bit taller than him, or that his lips weren’t that chapped actually. Or that he smelled of rosemary up close like that.\n“Fine?” Arthur asked, probably too brusquely for the situation.\n“More than fine,” Merlin said faintly, a shell shocked expression on his face that made Arthur grin through his embarrassment.\n“Good.”\n“Yeah, great.”\n“Well, we’ve got, uh, to go ask Gaius still,” Arthur said, retreating to the door awkwardly.\n“Yes, Gaius. About the curse,” Merlin said, stilted, still stunned.\n“Well don't just stand there like a fence post, Merlin, let’s go,” he barked, flinging the door open and hurrying out before he did or said something else monumentally embarrassing.\nMerlin’s footsteps followed faithfully, and Arthur couldn’t help the relief that flooded through him.\nThey could do this. They’d be alright. Together."
}