{
    "id": "36621292",
    "url": "https://archiveofourown.org/works/36621292?view_full_work=true",
    "author": [
        "CurrentlyCaffeinated"
    ],
    "title": "Take Your Opinion And Shove It Up Your A**",
    "rating": "Not Rated",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "Multi"
    ],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Midoriya Izuku & Takami Keigo | Hawks",
        "Midoriya Izuku & Nedzu",
        "Aizawa Shouta | Eraserhead/Yamada Hizashi | Present Mic"
    ],
    "characters": [
        "Midoriya Izuku",
        "Class 1-A (My Hero Academia)",
        "U.A. Faculty (My Hero Academia)",
        "Hero Public Safety Commission President (My Hero Academia)",
        "Hero Public Safety Commission (My Hero Academia)"
    ],
    "additional_tags": [
        "BAMF Midoriya Izuku",
        "Midoriya Izuku Does Not Have One for All Quirk",
        "Quirkless Midoriya Izuku",
        "Genius Midoriya Izuku",
        "Midoriya Izuku is the HPSC President",
        "Midoriya Izuku Does Not Go to U.A. High School",
        "Midoriya Izuku is a Little Shit",
        "Midoriya Izuku & Nedzu Friendship",
        "Nedzu is a Little Shit (My Hero Academia)",
        "Chaotic Nedzu (My Hero Academia)",
        "Aizawa Shouta | Eraserhead is So Done",
        "Protective Aizawa Shouta | Eraserhead"
    ],
    "language": "English",
    "series": "Part 4 of The Multiverse's Centered On Midoriya",
    "published": "2022-01-24",
    "completed": "2022-07-29",
    "words": "14,803",
    "chapters": "4/4",
    "comments": "252",
    "kudos": "10,210",
    "bookmarks": "2,257",
    "hits": "91,832",
    "summary": "<p>Midoriya Izuku is quirkless. This is a fact.</p>\n<p>Midoriya Izuku is worthless? <em>That's</em> a shitty ass opinion.</p>\n<p>So, after hearing that he wouldn't be able to become a hero for over 8 years, he decides to make a small change to the planned future career he's chosen. After all, what's a better way to say 'fuck you' to those who doubted him than to become their boss?</p>\n<p>Or:</p>\n<p>Midoriya Izuku becomes the HPSC President out of pure spite and ends up changing it for the better.</p>\n<p>I'll be honest here, my motivation for this piece is dwindling. A sparkler that has reached that not out yet but not sparking section. I'll finish the next chapter, I don't intend to drop it, but I apologize if anything seems... lackluster. I might come back and fix it but no promises.</p>\n<p>I finished as promised! I was hit with a small burst of motivation and an idea so I managed to finish it on my day off, I hope you enjoyed this fic! If you want more, this fic is apart of a series dedicated to making different alternative versions to what could have happened in MHA if Midoriya changed his outlook/dreams. HHH Inc in particular seems to be everyone's favorite so far so I recommend you go check it out!</p>\n<p>(I also plan on posting a support Aizawa Shouta fic as well so be on the look out for that.)</p>",
    "notes": "<p>Heeeeeeeeeeeeeeeeeeeeeeeeeeey there guys :)))) I finally managed to gather enough motivation to get this, and several other fics, updated this week! The chapter your about to read is way longer than I expected and a leading one that sets up the next one so I hope you enjoy, I'm exhausted so I'll be taking a nap. Go wild.</p>",
    "text": "Nedzu watched with amusement through the security cameras he was given access to as the HPSC went through a power transfer. Not one they wished willingly to have, but with the amount of blackmail evidence being dangled behind that wide toothy smile and sharp green eyes, well, what could they do? Say no? That would risk a total upheaval of society itself and more than a little jail time. So he was given the privilege of watching the old president of the HPSC get forcefully escorted out of her office as the newly dubbed president, despite his young age, watched on. His face was unreadable past the polite smile that seemed carved into his skin. \n A wonderful way to spend his Saturday morning.\n He could still remember the first time he was approached by the now president. Having already finished all of his necessary schooling and just starting on his first college degree, the newly dubbed teen had shown up at his private gate along the UA wall and politely asked for a meeting. Considering not even the faculty knew of that entrance? It was safe to assume he was curious. \nWhat had followed was a fascinating discovery of another brilliant mind that could not only challenge him, but outdo him when it came to a select few topics. It was marvelous and he had immediately pushed forth for a weekly tea time between them. He wouldn’t dare let an opportunity such as that one slide past him. \nHe chuckled at the memory of the flustered mess the teen had become, embarrassed and yet validated on a level that bordered on desperate. Considering the label of quirkless, it wasn’t a surprise. He was glad that society hadn’t had the time to instill a crippling amount of self-deprecation in him or he may have never been given the chance to know him. \nSociety was always so good at snuffing out that which scares it, silencing the minority while placing those it deems worthy on pedestals. \n(He had a lab setting for his worst nightmare, this teen didn't have such a luxury. How sad is it, then, that something so horrendous could be considered better?)\nThus, he watched. A wide smile that would send his faculty running stretched onto his face as someone who was at the bottom of the barrel just 3 years ago reached out and grabbed his fate with his own hands, yanking it out of society's clutches and making a path for himself.\n.\n.\n.\n.\n“Are you being serious? I have no time for games, Nedzu,” he asked irritatedly.\n There was just no way that after all this time, the HPSC would suddenly change its mind. They’ve been keeping UA underneath a microscope for so long, picking at them like vultures to a dead carcass, yet suddenly they want to be cooperative? He doesn’t believe for a second.\n “I am Shouta-kun. I understand your reservations about this all-”\n “Justifiable caution.”\n “-considering previous attitudes, however there is a very easy explanation as to why the HPSC is being so… lenient.” The rat finished, an amused grin in place of his normal polite smile.\n “And what, pray tell, is this explanation,” he grouched, eyes narrowed in disbelief.\n He knew Nedzu wasn’t joking, hell the rat hated the HPSC more than he did. Yet, he just couldn’t believe that the group of stuck up fuckers that reigned like overlords behind the scenes of the world of heroics would be so accepting. Especially considering the attitude the president had, he had only met them once and that was enough for a lifetime.\n Nedzu flashed him a smile he reserved for moments of true victory, all predatory and pleased.\nHe was instantly thrown off guard.\n “Simple, the previous president of the HPSC was removed from office yesterday morning and the replacement is actually a good friend of mine. Someone who knows quite a bit of the dark side of society and wishes to change it.”\n The mug that was placed firmly in his hands slipped.\n “What,” he asked flatly, face blank in shock.\n “I do quite enjoy our tea sessions, though I suppose he will be a bit too busy for the next few months as he adjusts. I guess I’ll have to push back our tea time to a later date.” The rat contemplated, completely ignoring him. A little deserved since he just shattered a mug on Nedzu’s floor, but he also just had the metaphorical rug ripped out from underneath him so he feels a little justified.\n “The president of the HPSC was replaced on Saturday and no one was notified,” he stated calmly, a stark difference to the internal chaos he was feeling.\n “Yes!” The Rat chirped. “He’ll be paying a visit during the exam’s for the incoming 1st years, he’s quite curious about the effectiveness of the new exam format!”\n “Is there a reason as to why this changing of power, one that effects the entire fucking country, was done in absolute secret without anyone knowing?” He ignored the fact that Nedzu knew. \nHe always knows.\n “Ah, that’s because the president was coerced into giving up her position!” Hold on a minute- “Don’t worry, the hero community will be notified once the new year starts!” He wasn’t worried about when they would be notified anymore, what did Nedzu just say? “The current president wants to make some small changes beforehand.”\n What the actual fuck was happening???\n.\n.\n.\n.\n“Shouta? Is there something wrong love?”\n “The world is ending, Hizashi, the rat has friends and they're just as bad as the chimera himself.”\n “Oh- oh no.”\n.\n.\n.\n.\nHe gave his mirror a polite smile as he finished tying the knot on his tie, fortunately not looking like he was attempting to strangle himself for once. All that practice had paid off.\n He walked out and gave his mom a goodbye hug, one she happily reciprocated after worrying about him to make sure he looked presentable, before heading out of the apartments to reach his chauffeur. When he reached the inconspicuous car he had chosen- why use an expensive car if it’ll stick out like a sore thumb?- he huffed an amused breath as red entered his vision, the host grinning a bright grin that had become increasingly more common since Saturday.\n “I assume you're my ‘bodyguard’ then?” He asked the winged hero.\n “Absolutely Boss-man!” Keigo chirped. “I was appointed-”\n “Self-appointed,” he cut in, amused.\n “-as your one and only bodyguard for any and all things. Can’t let you go out alone, green bean, that's dangerous.” Keigo grinned a shit-eating grin as he held open the door from him, a single hand waving off his words.\n With an amused glance, he was going to UA which was objectively the safest place in japan for him to be at that wasn’t the HPSC headquarters, he took the offered seat and slid into the car. Keigo sitting in the passenger seat up front with his driver.\n “We shall arrive at UA within the hour, sir,” a voice chimed from the driver's seat.\n “Thank you Aoki,” he said with a proper smile, one he knew the man would see through the rearview mirror. \nAoki was amazing at his job. The man had been reduced to grunt work despite his skill set due to pissing off the previous president. He, upon noticing this, immediately asked if Aoki would be willing to be promoted to his secretary. The man had agreed readily considering his family and the pay increase, but as time passed- as short as it has been- it was obvious he was enjoying his work a lot more than he did before. He would go as far as saying they were close enough to be called friends now.\n “Always, sir,” Aoki responded, a soft smile on the usually stern face.\n They pulled out of the complex parking lot and began their way to UA, Keigo belting out his favorite songs as Aoki restrained himself from decking the man as they drove. Noticing this, Keigo began to sing even louder- if that was even possible- which led to Aoki’s patience snapping and a particularly sharp turn led to Keigo’s face being plastered to his own window. A giggle escaped him as he held onto the door to keep upright.\n “Apologies for the sharp turn sir, I needed to avoid a pothole.”\n Waving off the words, a smirk on his own face, he turned to look out the window as the world passed by in a blur as they drove. The smirk melting into a satisfied smile as a content sigh passed his lips.\n Things needed changing, and now?\nNow he gets to be the catalyst that starts it all.\n.\n.\n.\n.\n“Who’s this cutie?!” Nemuri cooed as she reached out to pet green curls.\n Shouta was sitting next to Nedzu at the head of the monitor room where they were all currently waiting for the written exams to end. They had only been there for a few minutes when Hawks, the current number 3 hero which was impressive for his age, walked in while holding the door open for a kid and another person. The kid was short, reaching what looks to be no taller than 166cm, and had the curliest green hair he has ever seen. Wincing in sympathy, he blew some of his own wild black curls out of his face. He could barely tame his own hair, when he tried, let alone the bird’s nest that was on the newcomers. \nThe other person who had walked in was tall, probably as tall as he was, with a blank look to his face that rivaled his own. Short dark purple hair was slicked back, revealing the almost unnoticeable com in his right ear. A quick glance showed that, sure enough, all three of them had com’s placed inconspicuously on their bodies. If it wasn’t for his experience as an under, he doubted he would’ve noticed them at all.\n “Ah, Midnight-san,” the kid greeted, a small nod sent in her direction, “A pleasure. My name is Midoriya Izuku.”\n With a squeal, Nemuri ruffled the kids' curls. Marveling over how soft they were with a slight amount of teasing. Hizashi, who was getting ready to leave for the auditorium, gave a small coo at the kid for acting all formal. Shouta, however, didn’t dare. There was something off about this random kid's appearance that didn’t sit well with him. What kind of kid had access to a com system and the secret observation room for UA’s entrance exams? Not a normal one, that’s for sure. \nThere was also the slight twitch of the purple haired man’s right hand when Nemuri reached to ruffle the kid's curls. An involuntary action that, no matter how much you try, can’t be concealed. One that’s present in most bodyguards that are armed. \nWhoever this kid was, they were being guarded closely. \n His unasked question was answered when sharp green eyes snapped over to the seat next to him, Nedzu’s whiskers twitching with glee. The smile that stretched over freckled cheeks was unnerving at best, but it was the dead eyes that accompanied it that really set him on edge. He’s seen that expression on Nedzu's own furry features several times. \nSuddenly, he remembered the conversation he had with Nedzu about the exam changes with a single moment of clarity before the dread set in.\n No-\n “Nedzu-chan,” the kid chirped as the faculty choked, “How’s the processing so far?”\n Dear god.\n “Well Izuku-chan,” Nedzu greeted just as fondly, uncaring of the shivers he sent down their backs, “it seems to be going quite well! Yamada-kun, if you will?”\n He knew it, the world was ending and it was all this sadist-sunshine child’s fault. There was no way someone got so close to Nedzu without having or adopting some of the rat’s more eccentric tendencies. Sadism is just the best bet at the moment.\n Tentatively, Hizashi nodded as he went to leave. Tossing glances back until the door was fully closed. The room was rendered silent as they observed the kid in front of them happily chatting with Nedzu. Random acronyms and words being tossed in that he hadn’t heard of before and really didn’t want to know either, such as the suspicious combination of letters A.D.M.B. in reference to defense systems.\n “Uh, Nedzu-san,” spoke up a hesitant, familiar voice, “what is…Uh, Midoriya-kun?” The kid gave a nod, confirming that it was indeed his name, but the all knowing smile that followed it made the man gulp. “Midoriya-kun doing here?”\n “Oh? I explained a few days ago that he would be coming, did you forget Yagi-san?”\n Shouta groaned, sounding more like a dying man by the minute, into the silence that followed Nedzu’s statement. The teachers snapped their gazes to him questioningly as he face planted into his own hands.\n “Problem child,” he grumbled, looking up enough to catch Midoriya’s gaze, “I’m not explaining,” he voiced to the rest of the room.\n The kid chuckled, amused eyes that still held that sharpness looked towards Nedzu questioningly. He let out an inaudible sigh of relief, glad that those eyes were off of him now. The brat had the same gaze Nedzu did, one that told you your every move was being considered and deciphered until you were as easy to read as a children's picture book. \n Nedzu gave Midoriya a nod, a feral smile accompanying it as Midoriya turned around to fully address the room.\n “It’s a bit early, the announcement was going to be delivered a week from now but what's the harm? Let me reintroduce myself,” a blinding smile replaced the polite one from earlier, “My name is Midoriya Izuku, the current president of the Hero Public Safety Commission.”\nThe room was silent.\n“I look forward to working with you all. Oh! I nearly forgot,” a predatory smile appeared on his face, “it’s a pleasure to meet the number 1, even if it’s the second time, Yagi-san.”\n.\n.\n.\n.\nThe exams progressed smoothly after that, the room of teachers all too shocked to do much else than to fall into autopilot mode. Especially Yagi, who looked to be questioning life itself as he glanced warily at the green child talking amicably with Nedzu in the seats closest to the monitors.\n The new format had three different exam styles that the potential students could choose from based on what they assumed they would excel in. Destructive or ‘flashy’ quirks could choose the original exam which used the usual battle city scenario with robots, mental or subtle quirks could choose the one-on-one battle scenario where they would fight one of ectoplasm’s clones, or a third exam which no one was given the details to but Nedzu seemed especially happy about. \n At one point during the exam, Midoriya had broken into what could only be called a mutter storm. A hand resting across his mouth as he spoke, twitching as if it wanted to write, muffling the already quiet sound. Nedzu was leaning in, listening intently as Midoriya lost himself to his own thoughts for a good few minutes. At the end of it, Nedzu’s face broke into an animalistic smile that sent shivers down their spines before he reached for the student list. Pawing through it until he reached a specific one, he pulled it out and placed it to the side.\n He was curious (sue him), so he moved towards the front, already knowing he was risking life and limb.\n (Dramatic but also completely acceptable considering who he was getting close to.)\n “Ah, hello Eraserhead,” Midoriya greeted cordially. \n He pushed down the urge to shudder, refusing to ask why this child knew his hero name. Yes he was the president of the HPSC, but he was also a president that was newly ‘elected’. He sincerely doubts the kid had enough time to go through every hero listed in their database, which means his name was either specifically searched for, or the kid knew of him for far longer than he wanted to know.\n He gave a nod in return, already reaching to read the selected paper. \n The photo of the selected student showcased wild purple hair and deep eyebags. ‘Shinsou Hitoshi’ was the name. The kid obviously needed to work on his stamina, considering he had almost failed the one-on-one tests, but he pulled through with his quirk. \n “Curious?” Midoriya asked, his sharp eyes once again intently staring at him.\n “Yes,” he admitted. What good would it do to lie? He’s almost 100% sure he’d be seen through anyways, no matter how good his poker face was.\n “Well, Shinsou-kun needs more focused training for his body, that much is clear, but based on his performance and the potential hidden within his quirk it would be a shame to lose him to the general education track. I do believe your particular brand of teaching would suit him well, don't you?” \n This time he couldn’t hold back the shudder, cursing himself for it as he saw a flash of amusement dancing behind emerald green eyes. There was something unnerving about this kid, something so reminiscent of Nedzu that it made him want to crawl into his sleeping bag and never wake up again. No one needed two Nedzu’s. For fucks sake the world was barely hanging on with just one.\n “Yes,” he managed to get out, “I had similar thoughts.”\n “Good!” Nedzu chirped, abruptly reminding them all of his presence. “Since he’s just been accepted into class 1-A.”\n He groaned internally, questioning all of his life choices that led him to this moment. Sighing heavily, which earned him an amused smile from Midoriya, he sagged into the last seat left at the front of the monitoring room. He was already here, might as well stay for the long run. \n “Oooh,” Nedzu started, his voice edged in a way that made Shouta sit up straighter, “It seems you were correct once again Izuku-chan.”\n Midoriya perked up, eyes roaming the screens before it settled on the one showcasing a teen with an explosion quirk. Following his gaze, Shouta cringed at the feral smile that decorated the blonde’s face as he destroyed the robots. Great, another superiority complex having flashy quirk user. \n “Ah,” Midoriya said, giving a small nod as if confirming his own thoughts, “Of course. Bakugo has always been very… aggressive with his approach to heroics.”\n Suddenly, green eyes were on him again as a single eyebrow raised in question, a curious look on Midoriya’s face as he watched his expression intently.\n “Say, Eraserhead,” the teen(?) drawled, “how much do you enjoy destroying world views and correcting societies mistakes when it comes to enforcing biased world views through academic environments?”\n His eyes sharpened as he glanced from the screen then back to Midoriya.\n “About a solid 6 on a scale of 10, though I do find it a necessary nuisance.”\n “Lovely,” Midoriya chirped before going back to watching the screens, Nedzu pulling another paper out and placing it on top of Shinsou’s.\n This is how the exam watching progressed for the next few hours. Random interruptions from Nedzu and Midoriya as they talked to each other, and occasionally himself, watching the students finish their exams. By the end, there were already two stacks of potential applicants for both Vlad and himself to go through. Each stack tailored based on who would do good under which teaching style. Midoriya stood up with a polite smile, a more genuine one than the one he had from when he walked in, heading to the door where Hawks and the other were standing at attention.\n “Well, I’m afraid that I must head out, though I enjoyed my time here. Thank you for the invitation, Nedzu-chan,” Midoriya said, words soft and joyful.\n “Of course Izuku-chan! I’m just sorry that we’ll need to push back tea time, considering how busy we’ll both be very soon. Your insights on the exam were certainly informative!” The rat responded, tail switching in delight.\n With a final dismissal, the teen left and the room plunged into silence once again. Each of the teachers stared at each other in the same bewilderment from earlier. That was until Hizashi walked through the door, a strained smile on his face before he spoke.\n “So, our new boss is a very green- adorable- sunshine child? How did that even happen?”\n The only response was the delighted cackles from Nedzu.\n\n“Shishido-san, the President requests your presence in his office.”\n\n \n\nShishido Hisao, having been in the middle of staring aimlessly at the ceiling for several minutes by then, startled at the sound of someone speaking to him.\n\n \n\nSpinning his chair around, he came face to face with someone he never imagined he would ever see in his entire life while working at the HPSC. Standing there, hair styled back to reveal the full force of the apathetic face he was wearing, was Tsugikuni Aoki. The fucking secretary of the \n\nPresident of the HPSC\n\n. The \n\nPresident\n\n. What the fuck was the secretary of the President standing here in the offices-\n\n \n\n\nWait a damn minute-\n\n\n \n\n“M-” he coughed, clearing his throat before speaking once more, “Me? The president is asking for me?”\n\n \n\nTsugikuni raised an eyebrow.\n\n \n\n“Is your name Shishido?”\n\n \n\n“Yes?”\n\n \n\n“Then yes, he is. Follow me,” Tsugikuni stated curtly before spinning on his heel and headed for the elevator. \n\n \n\nScrambling, Hisao snapped out of his chair and hurried after his superior. His superior by a whole lot. Only a single person stands above the secretary and it's the president. The \n\npresident\n\n. No, he hasn’t freaked out enough over this yet. Thoughts like ‘God what the actual fuck was happening in his life?’, ‘What did he do wrong?’, and ‘Why him?’ running through his head as he caught up. \n\n \n\nThe elevator ride itself was extremely uncomfortable, like being a rabbit trapped in the same cage as a wolf. He hated every single second of it. Dread crawled up his spine as the numbers displaying what floor they were on went up, and up, and \n\nup\n\n. How many fucking floors were there anyways?!? He never passed the first 10! He would rather be in a fucking meeting where the speakers went over the\n\n same goddamn topics\n\n every single time for \n\nhours\n\n on end then be heading towards the Presidents office. He felt remarkably similar to a criminal on death row, walking his way towards the guillotine.\n\n \n\nHe hadn’t even met the previous president! He just received orders down the grape vine of superiority complexes and did what he was told so that he wouldn’t mysteriously disappear one day! Hell, it's the worst kept secret of the HPSC that the current president got his seat by ‘\n\nsuggesting’ \n\nthat it be passed over. That kind of person viscerally terrifies him at his core. \n\n \n\nThe past president had been horrible, but to dangle blackmail at said horribly terrifying president and coerce them into giving up their seat despite how greedy they are? Well that just means the current president is a fucking demon, thats what. \n\n \n\nNo human he knows of is capable of that.\n\n \n\nEven Nedzu, labeled the ‘HPSC’s pain in the ass’ for his ability to fuck with them, hadn’t been able to push that far.\n\n \n\nThe ding of the elevator chimed that lovely chime it always does and Hisao wanted to toss himself through the ceiling-to-floor windows that decorated the long hallway the doors opened to. Too bad the President's secretary was now turning his vibrant violet eyes towards him, that same impeccably blank facial expression seemed incredibly intimidating despite its lack of… anything really. He’s pretty sure he’s seen sculptures with more expression than this man. So Hisao did what anyone else would do when faced with a similar situation. He turned towards the long hallway and began to walk. \n\n \n\nGod he wanted to \n\ncry\n\n.\n\n \n\nTsugikuni followed him closely, quite literally only two steps behind him, and it felt like being escorted by a police officer to a jail cell, or, once again a criminal being escorted to their inevitable death. \n\n \n\nThe hallway to the president's office was, as stated previously, long. It took over 5 minutes of walking to even see the doorway. What was the point of having such a long ass hallway?!? Intimidation purposes?!?\n\n \n\nActually, that’s probably \n\nexactly \n\nwhy it was built like this.\n\n \n\nCongrats, he’s thoroughly intimidated. \n\n \n\nOnce they reached the door, Tsugikuni took the lead and knocked on expensive looking mahogany wood. Well, he’s pretty sure it's mahogany. He might not know much about wood types but he’s pretty sure those rich CEO offices in the TV dramas all used mahogany so he’s kinda just assuming.\n\n \n\nThe door opened and Hisao felt himself lose just a little bit more of his sanity as \n\nHawks \n\nleaned up against the entryway. Piercing gold eyes scanning over them before landing on Hisao and lingering for a good minute before a charming smile broke out across his face.\n\n \n\nIt wasn’t comforting in the slightest.\n\n \n\nIn fact, Hisao felt \n\nhunted\n\n.\n\n \n\n“Come on in, the president is expecting you,” Hawks chirped, stepping away so that he could walk through the door. \n\n \n\nHisao crossed the threshold and walked a bit further before he heard the sharp click of a door closing shut. A quick glance showed both Tsugikuni and Hawks standing beside the door at attention. Returning his attention back to infront of him, Hisao audibly gulped as he stared at the back of the office chair in front of him.\n\n \n\nHow cliche of the \n\nPresident \n\nof the fucking \n\nHero Public Safety \n\nCommission. \n\n \n\nHe was going to have a full blown breakdown at this rate.\n\n \n\n“Sir,” he started, voice wavering with nerves and he silently cursed himself for it, “you called for me?”\n\n \n\n“I did!” A voice chirped, a \n\nyoung \n\nsounding voice.\n\n \n\nSuddenly, the chair spun around and Hisao could physically feel the years being chopped off his life span as he went through several revelations in the span of a second.\n\n \n\n“There's a few questions I wish to ask you about concerning the documents that pass through your desk,” Midoriya Izuku- according to the nameplate on his desk- said, sharp green eyes staring directly through his soul as he smiled, “and a few regarding to the orders you received concerning those documents, if you don’t mind \n\nthoroughly \n\nexplaining.”\n\n \n\nThe president of the HPSC was a teenager. \n\n \n\nA teenager had blackmailed the government and \n\nwon\n\n.\n\n \n\n“Of course not,” he said, feeling resigned even as his eyes burned with unshed tears, “I’ll start from the beginning then, sir.”\n\n \n\n.\n\n\n.\n\n\n.\n\n\n.\n\n\n\n\n\n“That poor, \n\npoor \n\nman,” Keigo lamented, staring at the now closed door that Shishido-san had just left through, “he was shivering Boss Man. Absolutely terrified. If I hadn’t experienced a similar situation first hand it would’ve been funny.”\n\n \n\n“Tch,” Aoki clicked his tongue, shaking his head slightly in admonishment before he headed over to his section of the office. A smaller desk was placed off to the side just for him.\n\n \n\nKeigo’s feathers ruffled in a pattern Izuku was getting used to recognizing as amusement before he straightened them out, turning from facing the door to looking over his desk as he worked. Aoki and Keigo had developed a unique friendship over the last few weeks, honestly it reminded him of siblings in a way. Aoki’s sarcasm and spite versus Keigo’s little sibling syndrome. \n\n \n\n“Eh,” Izuku started, pushing a green curl behind his ear as he shifted the documents placed before him, “a little bit of trauma is fine. Adds some spice to life.”\n\n \n\nKeigo snorted before stretching, leisurely walking his way towards the office door as he waved his hand through the air in a lazy goodbye.\n\n \n\n“I’m heading out for my patrol Boss Man,” Keigo called, tilting his head back to send him a wink, “try not to have too much fun without me.”\n\n \n\n“Well Kei,” Izuku responded, a slow and sharp smile stretching across his face as he read over the newest document he had just grabbed, “I’d rather not make promises I can’t keep.”\n\n \n\nWith a rather decisive twist of his wrist, Izuku placed his official signature on the police request form he had found beneath a stack of paperwork. Holding it up to show a curious Keigo who had stopped in the doorway.\n\n \n\n“Mind handing this to Detective Tsukauchi of the Musutafu police department for me? I think he’ll be rather delighted to receive this.”\n\n \n\nKeigo sent a feather and retrieved the paper, gold eyes scanning over the document with impressive speed before he choked. Eyes wide as he snapped his gaze to his own, hissing out words faster than he’s ever heard the man speak.\n\n \n\n“\n\nDid you just casually sign a warrant for an internal investigation as if it was a field trip permission slip?\n\n”\n\n \n\n.\n\n\n.\n\n\n.\n\n\n.\n\n \n\n(First Day of the New School Year)\n\n \n\n“Good Morning,” Nedzu chirped, his tail wiggling a bit in excitement as he sat on the staff lounge’s couch. \n\n \n\nConsidering class was supposed to start within the hour, all of the faculty were there to jump in surprise at his sudden presence. All but one. Shouta had always been hyper aware of things when he was a student, especially when it concerned himself. He had wanted to cultivate that talent so he did. He was glad his lessons seemed to help quite a bit, he never really could startle the man anymore unless he was actively focusing on him specifically, Shouta was one of the few humans Nedzu considered a friend.\n\n \n\nA chorus of greetings echoed in the room as the clearly exhausted faculty tried to wake up before dealing with, and he quotes, “demon children born from the culmination of human sin”.\n\n \n\n“Nedzu,” Shouta’s gruff voice cut through the air and the room went silent, the man had sounded \nwary, \"what did you do?”\n\n \n\nInstantly, several pairs of eyes snapped to him with unveiled terror. The air in the room grew heavy under the weight of the tension. Unable to help himself, Nedzu grinned. All sharp and bared teeth as he stared at them all. Amused as he watched his faculty shudder in fear before he spoke.\n\n \n\n“How harsh Shouta-kun,” he said, reigning back his elation and smoothing the grin into a polite smile, “I’m just excited for a segment that will be happening in about,” he glanced at the clock on the wall and grinned once again, “a minute or two.”\n\n \n\n“What segmen-” Vlad had started before he was cut off by a cheery chime that seemed to resonate in the room.\n\n \n\nSuddenly, the lights of the faculty room dimmed and a rather large section of the wall behind him started to open to reveal a screen. Playing on the flat screen tv was the local new station, the speakers in the room instantly syncing up to the audio.\n\n \n\n“Officially,” the news reporter started, his voice echoing in the room as the faculty stared at the screen in silence, “as of an hour ago, the president of the Hero Public Safety Commission has changed. The change of power was done yesterday evening and according to the statement they released on the matter, the current President’s name is Midoriya Izuku. Currently, there is no more information regarding who, or what the new President intends to…”\n\n \n\n“Well,” Nedzu started once the volume died down again, “time for the start of the new year! Good luck with your students everyone, plus ultra!”\n\n \n\n.\n\n\n.\n\n\n.\n\n\n.\n\n \n\n(A Week Into the School Year)\n\n\n “I’m this close to strangling the man,” Shouta hissed, hair fidgeting around his shoulders as he glared towards the ceiling of his apartment.\n \n\nDeft hands gently worked through his hair, scratching lightly in a soothing motion that helped him calm down. He sighed as he let the tension seep out of him, going boneless on Hizashi’s lap. \n\n \n\n“Understandable,” his sunshine agreed, looking down at him through his casual glasses and a Shouta’s breath hitched at the quiet panic hidden behind green and red eyes, “I’m just glad that the alarms had been triggered when they did. If someone had managed to jam the signal, or if you had headed in with your class any sooner I-”\n\n \n\nReaching up, Shouta gently cupped Hizashi’s cheek. He felt his face softening at the genuine worry that was twisting his sunshines expression. He might hate worrying Hizashi, but to see how much Hizashi cared about him had that warm spot reserved for the blonde flaring hot. \n\n \n\n“It's okay Hizashi,” he murmured, thumb soothing over Hizashi’s cheek, “it's all in the past now. It won't do you any good to think of the ‘what if’s’.”\n\n \n\n“True,” Hizashi conceded, a soft smile appeared on his face before a glimmer of mirth settled in his eyes, “I guess I should focus more on how the higher ups will handle this.”\n\n \n\nCurious, he raised an eyebrow. Silently asking Hizashi to continue.\n\n \n\n“Well, the attack had to be reported to the commission you know? Now, I’m not a hundred percent positive about it, but the green bean seemed a little hostile towards Yagi didn’t he?”\n\n \n\nHe had been. Shouta could remember the way Midoriya’s eyes had bore into the Number 1 with the kind of cutthroat calculation he remembers seeing on Nedzu’s face back when he was dealing with the old president. It had been intriguing to see, especially considering the kids' age. Most teens were still stuck with their rose tinted glasses and worshiped the very ground the man walked on. However, one doesn’t become the president of the HPSC at Midoriya’s age with rose tinted glasses.\n\n \n\nHe must’ve had a fucking magnifying glass to get where he was.\n\n \n\nHe gave Hizashi a small nod, agreeing that he \n\nhad \n\nnoticed the hostility. Noting his nod, Hizashi continued while still gently removing tangles and knots from his hair.\n\n \n\n“I had heard Nedzu talking with Nao earlier about the break in and he had said something about a ‘friend coming to help me deal with the situation’. We both know that Nedzu doesn’t consider many people \n\nfriends \n\nso that statement was probably referring to Greenie.”\n\n \n\n“True,” he drawled, remembering the time Nedzu gave him a 3 hour long lecture on how trust is dangerous if given to the wrong people.\n\n \n\n“Now considering the villains had apparently shown up to kill All Might, who wasn’t even there yet due to being late, and add that on to the really weird circumstances surrounding his employment that we aren’t privy to…” He trailed off, glancing back down at Shouta with a raised eyebrow.\n\n \n\n“Ah,” he realized, eyes widening as they stared at each other.\n\n \n\nThe room was silent for a long moment, the soft sound of pattering paws from cats being the only interruption. Then, at the same time, wide smirks broke out across their faces.\n\n \n\n“I would give my left kidney to be there during that meeting,” Hizashi smirked, eyes bright with glee.\n\n \n\nA ping rang out from both of their phones and Shouta instantly recognized the sound.\n\n \n\n“It seems we just might get too,” he snickered, while grabbing his phone.\n\n \n\nSure enough, right there in his notifications was Nedzu requesting the presence of all the hero faculty in one of the more secured meeting rooms the next day at 9am sharp. Turning his phone, he showed his screen to Hizashi who burst into a fit of cackles. \n\n \n\nHe was going to \n\nenjoy \n\nthis meeting.\n\n \n\n.\n\n\n.\n\n\n.\n\n\n.\n\n \n\n(A Day Later, Early Morning)\n\n \n\nHe was right, he was enjoying the hell out of this meeting.\n\n \n\nDressed in a perfectly tailored suit, all black besides the deep emerald tie that was held in place by a Hawks pin for some odd reason, Midoriya Izuku sat at the head of the U shaped table in the meeting room. Legs crossed as he leaned back into his chair with the documents detailing the entirety of the break-in held securely in his lap with a hand. The other occasionally flipped the pages for him to read or grabbed the teacup Nedzu had placed in front of him to drink. Nedzu himself had perched on the unoccupied arm of Midoriya’s chair, occasionally answering any questions the teen had about the papers.\n\n \n\nWhere was All Might?\n\n \n\nA seat, that looked soft at first glance but he knew better, had been placed right in the middle of the U shaped table. Completely isolated from the rest of the faculty and put on display for all to see. The man was \n\nsweating\n\n. Eyes anxiously glancing around the room as the silence wore on. His frail, \n\nreal\n\n, body was shivering with nerves.\n\n\n\n\n\nNot a single soul tried to help.\n\n \n\nIt was \n\nbeautiful\n\n.\n\n \n\n“Hmmm,” Midoriya hummed, flipping to the last page, “this \n\nis \n\nrather concerning.”\n\n \n\nThe room was still silent, everyone seemingly on edge. Well, it \n\nwas \n\na bit nerve-inducing to have the person who holds their very careers in the palms of his hands sitting in the same room. He, however, was too busy focusing on the way Yagi had flinched at Midoriya’s cold tone. The vindictive and petty part of him preening a bit at the sight of it. \n\n \n\n“It is,” Nedzu agreed, his usual polite smile replaced by a solemn one as he turned to speak with Midoriya, “I would apologize for dragging you away from the numerous things you would no doubt need to deal with as a newly elected President, however, this takes precedence.”\n\n \n\n“You’re right, I probably would have involved myself the minute I caught wind of this anyways,” Midoriya sighed before placing the document on the table in front of him, “for now I’ve got my secretary overlooking the… \n\nprojects \n\nI’ve started. He’ll keep everything running smoothly while I’m out.”\n\n \n\n“Now,” Midoriya started, eyes snapping towards Yagi before they settled with a cold calculative look piercing the man, “It seems we have much to discuss about the USJ Incident. The ‘League of Villains’, or so they call themselves, have made their point quite clear- and based on reports it seems they’ve invested enough into it to be a bigger problem than previously expected.”\n\n \n\nYagi shivered under the look Midoriya was giving him, eyes darting around the room in a futile attempt to avoid the teen’s gaze. Against his wishes, Shouta found himself a little impressed at how good Midoriya was at unsettling people with a mere look. \n\n \n\n“Now, while having the symbol of peace- a man with countless enemies- would be a danger to have as a school staff member,” Yagi flinched at the thinly veiled jab, “especially having it publicly announced, I find it rather intriguing that there is a noticeable difference between the time you were scheduled to arrive at work and,” a snap echoed from Midoriya and suddenly the ceiling opened up to lower a screen out of it, “the last time your hero ID was used to register a point of activity in the system as ‘completed’.”\n\n \n\nShouta leaned forward slightly, curious despite the situation. He knew the HPSC had a way of cataloging the hero licenses they issue but the heroes themselves aren’t allowed to see the database. The only people with access to it are kept on a list and placed in a specific department he’s only heard whispers about. \n\n \n\nOn the screen was a list that was categorized based on year-month-day-time in that order. It was a large chart-like list with a single ID number repeated over and over that he realized was All Might’s. The referenced times highlighted in a bright obnoxious yellow, the exact same shade as the one the hero himself wears. He knew. He knew Midoriya was a petty, spiteful, \n\nsadistic \n\nteenager. It was still nice to have confirmation. The teen even had the nerve to put the referenced times- already highlighted with that obnoxious yellow- in bold with an underline.\n\n \n\nShouta approves.\n\n \n\n“If I’m remembering correctly,” Midoriya stated slowly, as if speaking to a child, “UA has it stated in their contracts that unless suitable forewarnings or reasons are given, all teachers are expected to arrive on time and attend the classes they are placed in an authoritative position over. Failure to do so has consequences they must face which range from verbal reprimands to an unverified amount of time where the violator will be subjected to the N.E.Z.U. protocol.”\n\n \n\n“So explain to me, Yagi-san,” Midoriya stated, a sickeningly sweet smile stretching across his face, “I’m curious. What reasons do you have to neglect the job you had asked for? One my predecessor had taken certain \n\nactions \n\nto make sure you received?”\n\n \n\n“\n\nOh shit\n\n,” he heard someone whisper into the silence, Nemuri’s gobsmacked face coming into view when he turned to see who said it.\n\n \n\nOh shit indeed.\n\n \n\n.\n\n\n.\n\n\n.\n\n\n.\n\n\n(Same Day Later Time At HPSC Headquarters)\n\n \n\nIzuku ran his gaze over those presently sitting at the large oval table the meeting was taking place at. Taking the time to do so, he counted each of the board members that had arrived on time for the meeting he scheduled. Some were late, the type that comes from negligence and not out of unfortunate events, but he had already expected that.\n\n \n\nSatisfied that his expectations were correct, he leaned over to grab the tea cup that was placed before him on the table. He could feel the eyes pinned on him as he moved and had to push down the smile that he felt twitching his lips. It would do no good to antagonize them…\n\n \n\n…yet.\n\n \n\nLooking at his watch, Izuku noted that the time to start the meeting had just passed. He would give them 10 minutes. !0 minutes to arrive and be in their seats before he resorted to calling in a bit of help. That seemed reasonable.\n\n \n\nBy the time 10 minutes had passed, however, there were still 3 board members missing. Unfortunate but not entirely unexpected, though he had hoped for better. \n\n \n\nDisappointments till the very end.\n\n \n\n“Well,” he started, placing his tea cup down as he addressed the room, “I believe it’s in our best interest to get started despite the missing members. Unfortunate.”\n\n \n\nBut, once again, not unexpected.\n\n \n\n“You never specified what this meeting would be about,” a man named Miyaharu Hotaru called out, looking incredibly unimpressed, “Midoriya-kun.”\n\n \n\nIzuku, who knows how manners work, smiled politely before speaking.\n\n \n\n“Yes,” he allowed, “though, Miyaharu-\n\nsan\n\n, I do believe my station warrants such secrecy? Especially considering that today will be focusing on several topics labeled under classified?”\n\n \n\n“True,” the man responded, his eyebrow twitching in annoyance, “though your lack of explanation must’ve interfered with your desire with punctuality, they probably were stuck with more important matters that are taking longer than expected. We are very busy people after all.”\n\n \n\n“So the board members, people who report to the president directly, believe that my requests are optional?”\n\n \n\nIzuku let the silence sit for a second, his smile widening slightly when no one spoke.\n\n \n\n“Besides,” he sent a pointed glance towards the name plate that sat in front of him, the word ‘president’ engraved in elegant scrawl, “I’m quite busy myself. There are quite a few things that require my attention.”\n\n \n\nRunning his gaze over the people present once more, he watched as they shifted and squirmed in their seats. Obviously, this meeting isn’t going how they expected. He knew long before Miyaharu decided to use the wrong honorific that their entitled attitudes were premeditated. Leaning over the table once again, he tapped the table right beside where his name plate was. A beep echoed in the silence and he smiled.\n\n \n\n“Aoki, send someone to retrieve my \n\nemployees\n\n,” he called out, enjoying the offended and enraged expression on Miyaharu’s face, “they seem to be a bit lost.”\n\n \n\n“Yes, sir,” Aoki responded, an amused edge to his voice that he knew only he could hear.\n\n \n\nThe call ended with another beep and Izuku relaxed into his chair. Tossing one leg over the other as he brought a hand up to gesture at the documents in front of him.\n\n \n\n“Since we have time, why don’t you go ahead and read the itinerary for today's meeting?”\n\n \n\n.\n\n\n.\n\n\n.\n\n\n.\n\n \n\n“YOU CAN'T DO THIS!” Miyaharu spat, his face fading into a concerningly bright red as he screamed, “YOU DON’T HAVE THE AUTHORITY!”\n\n \n\nWincing at the volume, Izuku sighed as he once again gestured to his name plate while raising an eyebrow.\n\n \n\n“Yes,” he dryly stated, “Yes I do.”\n\n \n\nBehind him, Detective Tsukauchi nodded despite his head being tucked down as he read off the list of crimes Miyaharu was being arrested for- which was extensive compared to the lists for the others so far- along with several other board members. Though, even if he couldn’t see his face, Izuku knew he was holding back laughter due to the slight shake of his shoulders. There were several similar shouts from the other people being arrested but, frankly, Izuku could care less.\n\n \n\n“If you hadn’t broken any laws and abused your given powers, we wouldn’t be having this conversation. Instead, though, I get to sit here and watch as you are restrained with the same metal cuffs the HPSC provides for high profile targets that need maximum security. I do hope you’ll reflect on your actions,” he sighed, sending the man a look that conveyed his repulsion, “but I sincerely doubt you will. I’ll let you handle it from here Detective.”\n\n \n\nGetting up, Izuku sent a nod in the detective's direction as he walked out the back door. Aoki fell into step behind him once he exited the room and they headed for the private elevator that leads to his office.\n\n \n\n“I have the applicants you chose sitting in the lobby room, will you be addressing them all together or one by one?”\n\n \n\n“All together,” he responded back, grabbing the papers Aoki had been holding for him, “I don’t have the time to conduct one on one meetings at the moment. They’ve already been cleared by Tsuka anyway. Have the necessary people been informed of the structural change?”\n\n \n\n“Yes Sir,” Aoki stepped forward and pressed the button for the elevator, “I’ve also set up the gala where the changes will be announced.”\n\n \n\n“Good,” he commented, only half paying attention as he read through the papers detailing the skills of the applicants he was about to meet, “I’ll have you handle the invitations personally. I don’t trust them to get to the right people as it stands. Any messages?”\n\n \n\n“Just two,” Aoki handed over his phone as they loaded onto the elevator, “Nedzu requests your time table so that he can set up a tea and chess session.”\n\n \n\n“Go ahead and send it over, He’ll pick out a convenient date. Though, do remind him that crashing the gala- no matter how fun arson sounds- would be a pain and I’d rather not need to coerce him into paying therapy fees for his collateral damage.”\n\n \n\n“Done. Also, Inko-san was wondering if you’ll be home for dinner.”\n\n \n\n“It’s \n\nkatsudon \n\nnight, Aoki.”\n\n \n\n“Understood, I’ll let her know to expect you.”\n\n \n\nThe elevator dinged and they stepped out, heading straight for the office he had gotten rather attached to in the last few weeks. There seemed to be millions of things to do, problems popping up one right after the other, but he wouldn’t change it for the world.\n\n\nThings were changing, and he was going to make sure it \n\nstuck\n\n.\n\n \n \n\n“It's a pleasure to meet you Eraserhead,” the teal haired man said, looking like they would rather be anywhere but there in that moment and he agreed, “My name is Takahashi Kaze, as introduced during the gala, and I’ll be the head of the UHN section of the HPSC. Considering your rating- after we compiled all of your data and records during your time as a hero- which sits firmly as the top underground hero the HPSC has, you’ll be seeing me an unfortunate amount of times most likely.”\n\n \n\n“What.”\n\n \n\n“Ah,” Takahashi-san said, head nodding sagely, “it must be surprising to hear considering the HPSC’s shitty structural systems from previous leadership but it's true. Your arrest record, raid participation, mission completions, descelation skills, lack of extreme force, efficiency. Add it all up and you rank higher than every other hero we have working in the Underground. Same for the spotlights as well but they don’t matter to me. Not my department.”\n\n \n\nShouta stared at his new superior, Midoriya having separated the HPSC into three types of heroes, spotlight, twilight, and underground. Within those three sections there were also the differences between healing, combat, and rescue. It has led to an increase in effectiveness in terms of regulating those in the profession and keeping tabs on them closer than before to prevent any toxic and corrupt situations from arising again. But that was besides the point, currently he was still trying to process what the ever-loving-fuck Takahashi had just said.\n\n \n\n“Why would I be seeing you more often,” he decided on, ignoring the whole fuck-ton of revelations- it was really only one giant one but still- that was dumped on him within minutes of arriving here.\n\n \n\nIf it was even possible, Takahasi looked even more done with this scenario.\n\n \n\n“It’s my job to handle large operations and delegate them to Heroes that might be able to handle them. When I mean large, I mean League of Villains snooping around and developing a large fucking spiderweb big enough to trip a metal giant off the side of a cliff if your not careful kind of large operation,” he sighed, “such as the one you are involved in already.”\n\n \n\n“Ah.”\n\n \n\n“Yep,” Takahashi-san said, looking grim, “so here, the full file regarding the information we managed to dig up out of our previous board of directors offices. Surprising right?” The man looked anything but surprised about the thick file folder placed on his desk.\n\n \n\n“Sure,” he sighed.\n\n \n\nBoth of them sat there for a second in silence, just staring at the folder on Takahashi’s desk as they contemplated their lives for a second. Then, once the silence sat just a little too long, Takahashi turned to grab another folder and pen to start working again.\n\n \n\n“There’s coffee on the right in the breakroom, have at it.”\n\n \n\n“Thanks.”\n\n \n\n.\n\n\n.\n\n\n.\n\n\n.\n\n \n\n“Nedzu,” Izuku greeted, smiling warmly at the screen of his computer where he had just answered his friend's video call, “what can I help you with?”\n\n \n\n“Izuku-chan,” Nedzu greeted back just as warmly, “I wanted to check in with you a bit for when you will be available for the next tea session? It hasn’t been long since the last but I would quite enjoy a relaxing time talking with a friend.”\n\n \n\n“Oh!” he snapped his head over to his schedule, double checking the date he had circled in red before looking back at Nedzu. “I was just about to send you the date actually! I had a feeling you would after everything that's happened.”\n\n \n\n“Wonderful!”\n\n \n\n“Your first-years applied for entrance to the provisional licensing exam that's being held in a month, I just so happen to have that specific day off. I think having tea while watching the newest batch of heroes in training sounds like a good way to spend a day together, don’t you?”\n\n \n\n“\n\nDelightful\n\n,” Nedzu chirped, “absolutely, I’ll clear my day.”\n\n \n\n“No need,” he responded, dropping his voice into a sugary sweet tone, “I’ve gone ahead and taken the liberty of… adjusting your schedule. It appears Yagi-san will just have to have that meeting next month, pity.”\n\n \n\n“A pity indeed,” the chimera mused, a sharp grin spreading across animalistic features before he cracked and started to cackle \n\nloudly\n\n. Honestly he’s pretty sure he heard the principal's door slam back shut during his moment of laughter and it tipped him over into his own set of chuckles.\n\n \n\n.\n\n\n.\n\n\n.\n\n\n.\n\n \n\n“Nedzu? You were coming along?”\n\n \n\nShouta, who was currently being used as the principal’s form of transportation, huffed. He and Vlad were wrangling all the first-year heroics classes onto their respective buses, or well, he was until he had been called by Nedzu. Apparently the rat wanted to tag along for some reason- he absolutely knows what that reason is but is avoiding it out of necessity- so he had been turned into a shuttle bus for the chimera.\n\n \n\n“Yes,” the principal nodded, a cheery smile on his face.\n\n \n\n“Sir!” He heard from behind and barely held back the groan that wanted to escape him.\n\n \n\n\nHow \n\nwas this child related to terror Tensei in \n\nany \n\nway.\n\n \n\n“Ah,” Iida Tenya, honorary nephew and stickler for the rules, fumbled at the sight of Nedzu, “Principal Nedzu! It is an honor to be within your presence today sir!”\n\n \n\n“No need for the formalities, Iida-kun!” Nedzu chirped, his open expression replaced by the polite formal one he adopts for most people he isn’t close to. “I’m just hitching a ride to see a friend-” Goddamn it he \n\nknew \n\nthat was the case “- and it's technically my day off. So no worries!”\n\n \n\n“Ugh,” he slipped, letting his thoughts show for a moment and was rewarded with a truly feral grin from his old mentor. \n\n \n\nHe would rather be crawling his way through the mud in a forest as skinwalkers crawl towards him than be anywhere near Nedzu right now, and yet he is cursed to walk around aimlessly with a cosmic 'kick me' sign attached to his spiritual back. He has beef with the spiritual deities that had allowed his existence, obviously there was some miscommunication happening because no way in hell has his soul sinned enough to be forced through this nightmare.\n\n \n\n“Shall we get ready to depart?”\n\n \n\n“Yes, sir.” \n\n \n\n“Lovely,” Nedzu hopped off his shoulder and began walking towards class 1-A’s bus because of course he did, he always did enjoy messing with people like that, “come along, Shouta-kun!”\n\n \n\n.\n\n\n.\n\n\n.\n\n\n.\n\n \n\n“Now make sure to pay attention and use your lessons to the best of your abilities, plus ultra and all that,” Aizawa-sensei droned from the front of the group, his monotone indifference actually soothing part of his nerves, “yes, Uraraka?”\n\n \n\nTilting his head to get a look, Hitoshi eyed the bob cut of Uraraka from where she was standing in front of him with a hand raised. He couldn’t think of anything that needed clarification so…\n\n \n\n“Sensei,” Uraraka chirped, voice tinged with curiosity, “what's with those mirrors up at the top of the building?”\n\n \n\nLooking up, he caught sight of what Uraraka was pointing towards. Sure enough, at the top of the stadium was a box-like room- kind of like those radio/announcer booths you find at pro sports games- that was outfitted with mirrored glass to prevent any onlookers from seeing who was inside. He \n\nalso \n\nrealized why she was asking. \n\n \n\nIf that was the judges booth, then they’ll know when and where to do certain moves within or out of sight. How on brand for the Todosquad, that chaotic law breaking group of chaos.\n\n \n\n“It's not the judges booth, if that's why you're asking,” Aizawa stated tiredly, slumping even further into his scarf, “the judges will be placed in several areas among the audience while also having video feed to go over during the final scores stage. That box, however, is still important to consider.”\n\n \n\nThe class paid rapt attention as they saw the look of pure dread on their teacher's face. Just what could have caused Sensei to look like \n\nthat\n\n?\n\n \n\n“That box,” Aizawa continued, heaving a sigh, “is where the president of the HPSC sits in order to get an eagle eyed view over the stadium. Normally it's unoccupied but considering this is the first year they have permitted a full class of first-years…”\n\n \n\nThe class was \n\nfrozen\n\n.\n\n \n\n“That's right!” Nedzu, their principal, cheerily called out from next to Aizawa (when in the hell did he get there?!?). “Now if you excuse me, I have a meeting with the president to attend.”\n\n \n\n“Nedzu,” came the toneless yet still somehow sharp voice of Tsugikuni, the secretary positioned off to the side where he was holding open an ‘employees only’ door, “the president requests your presence.”\n\n \n\n“Of course,” Nedzu nodded politely, “did he receive the gift I sent prior?”\n\n \n\n“Yes,” Tsugikuni nodded, allowing Nedzu to slip past him, “He wished for me to inform you that he appreciates the sentiment and is particularly fond of the cinnamon notes within the tea.”\n\n \n\n“I thought he might like-” and that's where the conversation cut off, the door having closed behind them.\n\n \n\n“So,” Kaminari piped up from beside him, “not only are we a year behind everyone here all while we compete under close scrutiny from hardass judges, but the \n\nPresident \n\nof the \n\nHPSC \n\nis going to be watching us.”\n\n \n\n“Language,” Aizawa reprimanded, but the usual heat wasn’t there.\n\n \n\n“We’re fucked,” Kirishima softly voiced, eyes wide.\n\n \n\n“\n\nLanguage\n\n.”\n\n \n\nThere's the heat.\n\n \n\n.\n\n\n.\n\n\n.\n\n\n.\n\n \n\nOverall, they had actually done pretty okay considering the circumstances. 18 out of 20 was an extremely high passing percentage apparently. Honestly they weren’t even expected to have a 50% passing rate, so the fact that the only real reason 2 of them didn’t pass was because of nit picking is impressive.\n\n \n\nNot that Bakugo was taking that very well.\n\n \n\nStudiously ignoring the ticking time bomb that was Bakugo in the corner of the room, Hitoshi walked over to where Aizawa had called for them to come closer.\n\n \n\n“Alright,” the man sighed, “we’ll be heading out after we get the case filled with your provisional licenses. When we get back to UA you ca-” a knock cut the man off.\n\n \n\n“Come in?” Aizawa said, raising an eyebrow towards the door that was just out of view from the rest of them.\n\n \n\n“Aizawa-san,” a familiar voice called out before red entered Hitoshi’s vision, a gasp escaping him at the sight of who had knocked on the door, “you busy?”\n\n \n\n“Hawks,” their teacher responded, acting very casual despite the \n\nnumber 2 hero\n\n being the one he was addressing, crossing his arms as he turned to face the hero, “why, is there something you needed?”\n\n \n\nHe looked hesitant about that. Obviously the man doesn’t want to leave them alone, and together, considering their rather impressive track record with villains.\n\n \n\n“Yep,” came the cheeky response, Hawks leaning lazily against the door as he spoke, “but you can bring your kiddies along with. I fear the extended length of time that Nedzu has spent with Bossman and request that you end that immediately.”\n\n \n\n“Fuck,” Aizawa cursed, startling them all. He was pretty sure Ashido’s jaw actually unhinged a bit as she gaped, “why are they still together? The exam ended an \n\nhour \n\nago.”\n\n \n\n“Probably has to do with your little gremlins,” Hawks hummed, glancing over them all, “I know the reason the president stayed for the exam today was so that he could see them in action.”\n\n \n\nOh look at that, confirmation that they were the reason the President was here.\n\n \n\nThat's not terrifying \n\nat all\n\n.\n\n \n\n“Great,” Aizawa flatly stated, “just great. Lead the way then.”\n\n \n\nThe class of 20 plus the two pro’s walked together in a group, looking remarkably similar to ducklings following their parents as they went through the behind the scenes sections of the stadium. Walking up several sets of stairs and ignoring the blatant cooing the staff was doing over their appearance. It took a couple minutes to get to where they were going, but he recognized exactly where they were when they arrived. \n\n \n\n“Yo,” Hawks called out while he knocked an unfamiliar pattern into the door, “Bossman, I brought some ducklings and a very tired looking hobo!”\n\n \n\nA few of his classmates snorted, rushing to cover it up when a glowing red glare snapped over to pierce through them with its intensity.\n\n \n\nThe door was pushed open by the same guy who had come to collect their Principal, their short purple hair impeccably slicked back and violet eyes staring emotionlessly at Hawks as they sighed. \n\n \n\n“You love me,” Hawks cooed.\n\n \n\n“Like a particularly stubborn fungus,” the man replied blithely before opening the door all the way, “in.”\n\n \n\n“Offensive,” Hawks cackled, walking past the man as he glared at him.\n\n \n\nThey all followed in a single file line as they crossed the threshold, curious eyes snapping to the two figures that sat on comfy looking armchairs as they played chess using what looked to be an \n\nexpensive \n\nchess piece set. There was a full tea set off to the side and a stack of papers on the opposite side of that. He would be more curious about that stack of papers, it seemed ominous in the same way Aizawa smiling during homeroom- or at all- did, but his attention had been grabbed by the person playing chess with their principal.\n\n \n\n“Ah,” the unfamiliar figure who sat across from Nedzu started, a choked noise erupting from somewhere in the room, “Aizawa-san, a pleasure.”\n\n \n\nHitoshi glanced around, trying to find who had choked at the sight of who he was 89% sure was the president despite his looks, and almost gaped when he saw who it was. Bakugo, feral pomeranian with hell’s flames licking at his heels and a temper that could melt steel, was pale as a sheet. Face turned several concerning shades white as he began to \n\ntremble\n\n.\n\n \n\n“Midoriya-san,” Aizawa returned in what could be considered a polite tone, \n\nbowing slightly \n\nto the teen who sat in the chair, “a shared sentiment. Now, I was told to retrieve my boss?”\n\n \n\n“Which one?” Nedzu chirped, a cheerful grin stretching across his face.\n\n \n\n“Not funny,” Aizawa sighed.\n\n \n\n“I for one,” Hawks piped up, “find it hilarious.”\n\n \n\n“Of course you do,” Midoriya responded, giving an indulging nod from where he sat, “you seem the type.”\n\n \n\n“The fuck is that supposed to mean?”\n\n \n\n“So,” Midoriya continued, cutting off the incredulous response from Hawks, “I assume this is your class of baby hero hatchlings?”\n\n \n\n“Like you weren’t watching them from here earlier,” Aizawa said, looking as if he would rather be anywhere then here at this moment.\n\n \n\n“Hmmm,” Midoriya hummed, choosing to remain silent before calling out a, “Tsugikuni?”\n\n \n\n“Sir,” the man who had opened the door, Tsugikuni apparently, responded immediately. \n\n \n\n“Are their licenses ready?”\n\n \n\n“Yes, sir. I had assumed this would happen so I had them brought up.”\n\n \n\n“Wonderful,” Midoriya breathed, standing up fluidly while straightening out his impeccable suit. The crisp three-piece black suit was highlighted by a deep emerald green dress shirt.\n\n \n\nHitoshi has never felt underdressed in his life, to tired or deprived of fucks to give when it comes to other peoples opinions, but even he has to admit Midoriya makes him feel like he had just walked into a formal gala wearing the equivalent to an Adam Sandler outfit. He was dressed in his UA uniform, arguably a more formal option for him to choose, but it didn’t help.\n\n \n\n“There we go,” Midoriya said, cutting through his thoughts, as he grabbed a briefcase from Tsugikuni, “now, may I do the honors?”\n\n \n\n“I honestly couldn’t care any less,” Aizawa said, apparently having given up in more than one way at this point.\n\n \n\n“Perfect.”\n\n \n\nThe next 30 minutes were dedicated to being called up by the President of the HPSC to receive their provisional licenses. At this point, he’s half concerned that this is all a fever dream and he’s about to be rudely awoken through those fall dreams he hates. Instead of that, he is being handed a shiny plastic rectangle by Midoriya that grants him certain abilities the average civilian will never get to enjoy in their life. He handed Hitoshi the first step to his \n\ndream\n\n.\n\n \n\nIt's almost enough to forget that the man is Hitoshi’s age.\n\n \n\n“Are we,” Uraraka shakily spoke up, half crying from receiving her license and half crying out of relief that she had passed still, “ignoring that?”\n\n \n\n“Ignoring what?” Midoriya asked, smiling politely yet still somehow seeming so… \n\ndangerous\n\n.\n\n \n\n“Uh,” Ashido piped up, “I’m pretty sure she’s referring to you…sir.”\n\n \n\n“Oh, I guess it is rather surprising, I’m so used to my colleagues already knowing that I forget that most people don’t know what I look like. It’s a little shocking isn’t it, to have a president that’s your age?”\n\n \n\n“More than a little,” he drawled, satisfied at gaining confirmation on Midoriya’s age, “how did you even-”\n\n \n\n“That’s for me to know and you to never find out,” Midoriya cut in, eyes dark even as his smile remained polite, “I see we have two left out.”\n\n \n\nHe let the topic change gracefully, still trying to settle his nerves that had spiked after being looked at with \n\nthat \n\nface. Those dead eyes had taken his soul out of his body and gave it an impromptu ice bath in the 9th circle of hell. Forget seeming dangerous, he’s met \n\nserial killers\n\n (stain) who didn’t put him on edge as Midoriya does. \n\n \n\n“You-” Bakugo began, his face still pale but his hands twitch in the tell-tale signs of anger.\n\n \n\n“Bakugo,” Midoriya’s voice was cold while he said the teens name, only returning to normal when he continued, “and Todoroki. Try not to take this too hard, there will be more chances. After all, you are here early. Take your time to relearn some of the things your judges have pointed out on your evaluation sheets. As for the rest of you, welcome to the next stage in your hero carriers! I look forward to the day when you become pro-heros.”\n\n \n\n“Oh my god,” he heard Jirou pipe in from the back, “that makes you our boss, doesn’t it?!”\n\n \n\n“It would,” Aizawa said, half his face ducked into his scarf so they couldn’t tell but Hitoshi knew the man was smirking beneath it all, “the minute you all go pro, Midoriya-san here will be your highest superior, just as he is mine.”\n\n \n\n“Bossman here is president after all,” Hawks chimed in, standing slightly behind Midoriya in a way that seemed picture perfect for a movie, “He’ll be the person who holds your careers in the palms of his hands!”\n\n \n\n“Keigo,” Midoriya sighed, everyone too stunned at this point to speak any further, “you’ll scare the poor things.”\n\n \n\n“Were you, or were you not the man who gleefully put together an entire document recording the crimes of people who used to work for the HPSC just so you could read it out loud as the police walked in to arrest them?”\n\n \n\n“That has nothing to do with this,” Midoriya grouched, pouting a bit at the hero.\n\n \n\nHe \n\nwhat\n\n.\n\n \n\n“Sir,” Tsugikuni spoke up, tapping his watch.\n\n \n\n“Ah, It seems I have overstayed my welcome. I have a meeting to attend so I shall see you all at a later date. Nedzu, shall we arrange our next tea session for a week from now?”\n\n \n\n“That sounds lovely.”\n\n \n\n“Perfect,” Midoriya beamed.\n\n \n\n.\n\n\n.\n\n\n.\n\n\n.\n\n \n\nThere was no way. \n\n \n\nHe refuses to acknowledge this.\n\n \n\nAs the bus started to take them home, pulling out of its designated parking space to head back onto the road, Katsuki found himself at the front by himself. Everyone was already asleep, having been tired out from the stress and exhaustion from the exam (One that he didn’t even pass-). Words echoing in his head even as he turned the volume up on his headphones. Using music to drown out his thoughts.\n\n \n\n\n“Bossman-”\n\n\n \n\n\n“Midoriya-san-”\n\n\n \n\n\n“President-”\n\n\n \n\n\n“Highest superior-”\n\n\n \n\n\n“-makes you our boss, doesn’t it?!”\n\n\n \n\n“Fuck,” he whispered, hands gripping the seat hard enough to make them creak under the stress. He couldn’t let off explosions now, everyone was sleeping and Aizawa was anal about that shit for some reason, but his hands were sweaty. Sweaty and twitching spastically as his adrenaline spiked with his emotions.\n\n \n\nFuck all of this.\n\n \n\nFucking \n\nhow\n\n?!?\n\n \n\nHow in the hell was the nerd there? As the goddamn \n\nPresident\n\n?!?\n\n \n\nSnatching his phone and opening it to pull up a search page, he immediately went straight for the hero news network. Scrolling through the newest articles until he found the exact one he was looking for.\n\n \n\n\n‘Recently, the Hero Public Safety Commission has released a statement that the prior president has gone into retirement. The mantel was then passed down to the new president, a man named Midoriya Izuku-’\n\n\n \n\nHe scrolled further.\n\n \n\n\n‘BREAKING NEWS: Top board members of the HPSC arrested for several crimes, some of which being embezzlement of funds and discriminatory practices on a wide scale level. President Midoriya was the one who had signed off on the police warrant and had given full permission for the police force to-’’\n\n\n \n\n\nFurther\n\n.\n\n \n\n\n‘New HPSC structure? What could this mean for the future of heroics? During a gala scheduled by President Midoriya of the HPSC, it was revealed that the HPSC was going to separate into three large categories in order to better compensate for the differences-’\n\n\n \n\n“How the fuck,” he whispered to himself, hand clenching his phone hard enough that the screen protector gained a small crack, “did I \n\nmiss \n\nthis?!?!”\n\n \n\nThere was no way, \n\nno fucking way\n\n, that Midoriya Izuku aka: Deku became the President of the HPSC. \n\nHe was the same fucking age as him\n\n, this doesn’t make any sense! There was no place on this mortal plane of existence where that weak fucking nerd would ever get a position as fucking high and powerful as the Presidents seat in the HPSC!\n\n \n\nAnd yet, the proof was everywhere he looked. \n\n \n\nEvery news article.\n\n \n\nEvery segment on the actual news channel itself.\n\n \n\nTwitter.\n\n \n\nReleased statements from the HPSC.\n\n \n\nIt was real, and he was so incredibly \n\nfucked\n\n.\n\n\n\n\n\n\n\nIngenium: What are your thoughts about the newest president?\n\n\n \n\nBestJeanist: Can you even have any thoughts considering we haven’t even seen the man's face yet?\n\n \n\nIngenium: Party pooper, I meant based off of the changes he’s made so far.\n\n \n\nRyuuku: You guys know you could just ask Hawks, right? He has always had close ties with the commission\n\n \n\nIngenium: Ehhhh~ that's no fun though!\n\n \n\nBestJeanist: Are there any other people who know the president personally?\n\n \n\nRyuuku: Nedzu?\n\n \n\nIngenium: Over my dead fucking body will I willingly visit the rat god\n\n \n\nHawks: Oh this is fun\n\n \n\nRyuuku: Hawks!\n\n \n\nIngenium: Ugh\n\n \n\nBestJeanist: Hawks, you finally decided to use the HN?\n\n \n\nHawks: I’ve been using it though?\n\n \n\nMiruko: AHHAHAHA NONE OF YOU BITCHES NOTICED?\n\n \n\nBestJeanist: Miruko? What are you talking about?\n\n \n\nMiruko: Eyas? The random HN id that shows up to absolutely rag on endeavor and similar heroes? Randomly drops vaguely unsettling comments?\n\n \n\nIngenium: WAIT A FUCKING MINUTE-\n\n \n\nRyuuku: You mean the infamous Eyas, the character who would always show up randomly and comment shit like ‘Nice carpet grippers you unwashed spoon’ before leaving us to deal with the whiplash, WAS HAWKS ALL ALONG?\n\n \n\nMiruko: WHO ELSE WOULD IT BE?\n\n \n\nHawks: I’m- I’m so proud of this legacy\n\n \n\nIngenium: HAWKS YOU MOTHER FUCKER\n\n \n\n-This ID has been muted for 3 minutes due to profanity-\n\n \n\nRyuuku: Uh-\n\n \n\nMiruko: What?\n\n \n\nHawks: Since when did the HN have a profanity filter?\n\n \n\nNedzu: Since two seconds ago!\n\n \n\nBestJeanist: NEDZU?\n\n \n\nHawks: Oh hey ratgod, hacking the HN now?\n\n \n\nNedzu: Unfortunately, Hawks, this one wasn’t me! Though I’m thoroughly enjoying the results.\n\n \n\nMiruko: Then who?\n\n \n\nHawks: You don’t think-\n\n \n\nRyuuku: He’s busy being a president, why would he take the time to set up a profanity blocker?\n\n \n\n-That's true, I am busy-\n\n \n\nMiruko: WHAT THE FUCK\n\n \n\n-This ID has been muted for 3 minutes due to profanity-\n\n \n\nHawks: OH MY GOD\n\n \n\nRyuuku: DBJVKEDOVKEOJNV\n\n \n\nIngenium: NO FUKING WAY\n\n \n\n-This ID has been muted for 4 minutes due to profanity-\n\n \n\nHawks: The time is increasing\n\n \n\nOrca: Oh god-\n\n \n\nThirteen: There’s two of them\n\n \n\nBestJeanist: Thirteen?\n\n \n\nThirteen: I didn’t believe him the first time, I do now\n\n \n\nOrca: Thirteen? That’s really cryptic? Wha-\n\n \n\nThirteen: The president is like the unholy clone of Nedzu but shoved into a tiny body and given a VIP slip into the behind the scenes of Heroic Society, I fear\n\n \n\nThirteen: I fear\n\n \n\nOrca: T-thirteen?!?!?!?\n\n\n\n\n\n\n.\n\n\n.\n\n\n.\n\n\n.\n\n \n\n“Oh,” Katsuki heard from the stadium chairs, freezing immediately as recognition settled over him, “I see the remedial lessons are going quite smoothly.”\n\n \n\n“Ah! Midoriya-sama! I didn't know that you would be stopping by today!”\n\n \n\nHe could feel the vein on his head increasing in size as a familiar mess of emotions bubbled beneath the surface. The strongest one being confusion because what in the FUCK was deku doing here?!? The others being a garbled mess of anger (familiar and calming), disgust, and for \n\nsome-fucking-reason\n\n theres this pit in his stomach that refuses to go away.\n\n \n\n“I had some extra time on my hands,” thats a fucking lie, Katsuki’s seen the changes been made by the HPSC on various articles, the nerd is probably swamped in paperwork so what the fuck, “so I decided to stop by.”\n\n \n\n“It's an honor sir,” the wet squib of a HPSC bastard said, sparkling eyes turned towards his… superior.\n\n \n\nSuddenly, he felt the weight of someone watching him. Staring at him with the type of intensity he was all too used to. Snapping his head over, he caught sight of Deku watching him, eyes boring menacingly into his head as he sat in the front row. Unusually dark and cold green eyes unsettled him to his core. A smile placed on his lips but in no-fucking-way did it reach his eyes.\n\n \n\nWho?\n\n \n\n\nWhat\n\n?\n\n \n\nThat- thats not fucking deku!!!!\n\n \n\nDeku doesn’t do shit like unsettling!\n\n \n\nThen, as if understanding the trail his thoughts took, Deku’s smile got wider. Ever so slightly, and just enough to be considered a change. The difference was this smile was colder than before, sharper, more dangerous in a way he wasn’t used to seeing.\n\n \n\nSuddenly, he recalled all those notebooks Deku would make. The analysis ones. The ones that had way more information than they should have. He had conveniently named the his ‘stalker’ notebooks because who the fuck knows that kind of shit? He can still remember the first time he had read one about himself and was made uncomfortable aware of how his unconscious food intake decisions affected his quirk levels\n\n \n\nFuck.\n\n \n\n“Well, I should be on my way,” Deku mused, he sounded \n\namused\n\n.\n\n \n\n“Of course, let me show you out.”\n\n \n\n.\n\n\n.\n\n\n.\n\n\n.\n\n\n\n\n\n\n\n\n“U-uh, Midoriya… sama? Sachou? Mr.President? Man in the chair? Heroic societies dadd-”\n\n \n\n“\n\nKaminari\n\n,” Iida stressed, his face a remarkable pale that reminded Izuku of those clickbait youtube titles where a ghost spawns on the mortal plane to commit atrocities.\n\n \n\n“Midoriya-san will do just fine,” he said, saving Iida from the aneurysm that would no doubt happen if Kaminari had been allowed to finish speaking that last version.\n\n \n\n“Cool,” Kaminari smiled, brushing off Iida’s melt down as easily as the teen breathes, “what brings you here, Midoriya-san? Aren’t you like… busy? Being president?”\n\n \n\n“I am,” he agreed, nodding his head slightly as he smiled over the cup of tea he held just before his lips.\n\n \n\nThey stared at each other for a moment. The entire common room of the class A’s dorms stilling in their curiosity as they all stared at him. It was kind of amusing how they reminded him of curious little puppies that caught sight of a colorful butterfly flying nearby. How \n\nadorable\n\n.\n\n \n\n“Sooooooo are you going to explain?”\n\n \n\n“Do I have any reason to?” He questioned back, taking the sip of tea he had meant to a moment ago.\n\n \n\n“I- You're kind of terrifying.”\n\n \n\n“Thank you!” He beamed, radiating happiness. “I try!”\n\n \n\n“You know what?” He heard piped up from the back of the common room, a look telling him exactly who had just spoken. “I don’t want to know. I refuse. Goodnight.”\n\n \n\n“Shinsou it’s 12pm on a saturday?”\n\n \n\n“Exactly,” Shinsou stressed, “I should have never been awake to witness this.”\n\n\n\n\n\n\n“Mood,” drawled a familiar voice. Well, familiar to him.\n\n \n\nAs screams erupted within the common room, Izuku sighed to himself. He should really make do on that promise of his to put a bell on a collar for Keigo, especially if he was going to sneak around like a little shit.\n\n \n\n.\n\n\n.\n\n\n.\n\n\n.\n\n\n“President Midoriya, about this-”\n\n \n\n“President Midoriya! According to the data sets-”\n\n \n\n“Midoriya-san, what will you do about-”\n\n \n\n“Midoriya-sama, I swear that this is-”\n\n \n\n“President-san, will you be-”\n\n \n\n“Izuku?”\n\n \n\nThe room stopped, every single person- some of which were the main drivers behind the entirety of the heroics industry, including Izuku himself- going still at the sound of a confused yet warm voice cutting through the volume of the room. It was feminine and soft, like a mothers, and it drew everyone's attention to the door. \n\n \n\nAoki, the president’s secretary, was standing in the entrance of the now open door, arm placed delicately on the upper back of a shorter woman who bore strikingly familiar features and green…\n\n \n\nGreen?\n\n \n\n“Mom?”\n\n \n\nMom?\n\n \n\n“Izuku, sweetie, I came to drop you off some baked goods from our favorite bakery… but it seems your busy?”\n\n \n\n“Oh no not at all,” the president smiled, the evidence to the contrary piled high on his desk in the form of paperwork, “thanks mom, I appreciate it.”\n\n \n\n“Oh stop it,” the woman giggled, walking over with a cute little box of cakes, “I’m your mother, let me spoil you sometimes without you being so sweet.”\n\n \n\n“Never,” Midoriya smiled, a genuine smile that was soft and fond.\n\n \n\nWho the fuck was this?\n\n \n\nMidoriya-san doesn’t do soft and fond.\n\n \n\n“Anyways, I have to head out now, Mitsuki and I are going for a girls shopping day.”\n\n \n\n“Oh that's exciting, I hope you have fun. You haven’t hung out much with Auntie Mitsuki in a while.”\n\n \n\n“I will.”\n\n \n\nAnd with that, the green haired woman was gone, taking their sanity with her. Obviously that was the president’s mother. They were just having a hard time combining the images of the cold and ruthlessly efficient president with the soft gooey teenager that was talking to their mom.\n\n \n\nOh \n\ngod \n\nthat was right, Midoriya-san was a \n\nteenager\n\n.\n\n \n\nHow many labor laws have they been breaking?!?!\n\n \n\n.\n\n\n.\n\n\n.\n\n\n.\n\n \n\n“If you have a problem,” Izuku spoke slowly, enunciating his words carefully as he let his eyes bore into the teenager who had confronted him, “then I suggest you find a way to articulate it. Just spewing whatever comes to mind first is terribly inefficient and overall annoying to deal with.”\n\n \n\n“I,” Monoma Neito stammared, face going redder than a tomato as his brows furrowed in anger, “what? Who are you to say that to me?!?”\n\n \n\nAh, it seems he’s been lacking in the exposure department still. He had forgotten that not everyone was aware of his status. 1-B seems woefully confused about this whole ordeal and 1-A’s terrified expressions are probably not helping.\n\n \n\nAll he had wanted to do was terrorize Katsuki a bit and then head up to Nedzu’s office to talk about… things. Well specifically, a possibly giant domino reaction regarding the person that has been carefully and quietly added to their custody as of three days ago. There was a small, very small, chance of reversing some of the damages and considering the members on staff…\n\n \n\nWell, he may act cold and ruthless while as president but the opposite is the truth. He’ll act cold if that’s what it takes to save lives.\n\n \n\n“Who do I think I am?” He questioned, making a show of furrowing his own brows in confusion. \n\n \n\n“\n\nYes\n\n,” Monoma stressed, angry puffed up cheeks looking remarkably like a chipmunks.\n\n \n\n“M-Monoma,” Kendo, or at least he believes that's her name, spoke up, “I don’t think this is a good idea-”\n\n \n\n“Shut up! He was looking down on me!”\n\n \n\nOh. Oh does he hate people with that mentality. The fucking bullshit revolving around the ‘looking down on me’ inferiority complexes. The byproduct of a shitty education system that revolves around toxic heroic society culture that's a byproduct of the old HPSC. He had to deal with it for over 8 \n\nfucking \n\nyears before he finally managed to get his hands of the very thing that could change it all, and yet here it is again. Being shoved down his throat.\n\n \n\n“Huh,” he finally spoke, his voice sounding cold to his own ears, “so you're one of those.”\n\n \n\n“Excuse me?” Monoma tried, his own voice going slightly shaky despite the man's unsubtle attempts to sound dangerous.\n\n \n\n“The type of person to make their problems everyone else's,” Izuku continued, a cold sort of fury settling beneath his skin, “making everyone miserable because ‘if I had to be than so do you’?”\n\n \n\n“That’s not-”\n\n \n\n“That’s exactly what you’re doing though,” he cut off, “you're so terrified of being washed away. Of being forgotten or seen as inferior or weak that you lash out. You fight tooth and nail and scream at others to look but in reality you're doing the same exact thing you feared happening to you. You’re calling others weak, just so you won’t get called weak in return. You call others inferior just so they know you’re not like them. You say they suck because you're terrified of being seen as the same. You isolate yourself because you fear what would happen if you let anyone in.”\n\n \n\nHe needs to stop.\n\n \n\nHe’s starting to project and he needs to stop, but…\n\n \n\nBut this is no longer about Monoma, or even about Katsuki and all their similarities.\n\n \n\nThis is about society and his number one pet peeve, and he needs to rant.\n\n \n\n“So Monoma,” he said, smiling that perfectly polite smile he has perfected over the years, “I do believe I have a say. Afterall, I don’t have my title for nothing.”\n\n \n\n“Title?” He heard someone in 1-B say, Monoma having gone frozen still after his rant.\n\n \n\n“That’s what we were \n\ntrying \n\nto warn you about,” Uraraka grumbled, “Midoriya-san here isn’t a UA student.”\n\n \n\n“Eh?”\n\n \n\n“He’s the president,” Ashido helpfully added, several eyes snapping to look at her, “of the \n\nHPSC\n\n.”\n\n \n\n.\n\n\n.\n\n\n.\n\n\n.\n\n \n\n“It seems you had fun down there.”\n\n \n\n“Ugh, Nedzu-chan don’t remind me, I almost killed a child.”\n\n \n\n“My, my Izuku-chan, it seems that you’ve forgotten that you are also a child.”\n\n \n\n“Ew.”\n\n \n\n.\n\n\n.\n\n\n.\n\n\n.\n\n \n\n“Are you alright,” Izuku took a quick glance at their stance, “Ichi?”\n\n \n\n“Close,” the head of the rescue heroic’ department said, their smile fond and amused, “It's Kiki.”\n\n \n\n“One of these days I’ll get it right on the first try, you and ichi are similar but there are some minor differences,” Izuku smiled in return, “besides that, how's the recording algorithm coming along?”\n\n \n\n“Good,” Kiki said, “we’re close to finishing it, Ichi was just too tired to continue last night.”\n\n \n\n“Understandable, I did tell them to take a break if they needed it,” he nodded, walking alongside Kiki as they headed for the records department, “They might be the only one who can use your quirk in such an intricate way but they're still a valuable friend. I’m not going to force you all to do anything.”\n\n \n\n“We know,” Kiki smiled, something deep and relieved hidden beneath their façade, “I’ll take my leave now.”\n\n \n\n“Alright,” he agreed, already heading over to where his objective was benign printed.\n\n \n\n“Midoriya-san!” The head of the printing department cried, all but launching out of his seat to hurry over. “To what do we owe the pleasure?”\n\n \n\n“Ah, nothing huge don’t worry,” Izuku smiled, “I just heard about someone I know completing their remedial provisional license class and wanted to grab his license to deliver it myself. I was heading over to UA to meet with Nedzu anyway.”\n\n \n\n“Of course, sir,” Soroichi nodded fervently, “right this way.”\n\n \n\n.\n\n\n.\n\n\n.\n\n\n.\n\n \n\n“Hello,” Katsuki heard the same hauntingly familiar voice say during his homeroom class, Aizawa stopping mid-sentence at the sound, “sorry to interrupt.”\n\n \n\nIt was only because he was sitting close enough that he heard a distressed Aizawa mumble ‘no, no you’re not’ before speaking up to say, “Midoriya-san.”\n\n \n\n“Why,” he whispered to himself, “why the fuck. Why the fucking fuck of fucking fuck does he always do this shit?”\n\n \n\nIdly, he knew that Jirou and Shoji had turned to him with matching incredulous expressions, but he just didn’t care anymore. Izuku has been terrorizing him for weeks now, fucking weeks and it’s getting on his nerve-\n\n \n\n…. Since when did he call him Izuku?\n\n \n\n“Bakugo, Todoroki,” Izuku said, standing at the front of the room, “or should I say Shouto and Ground Zero?”\n\n \n\n“Eh?” He heard half-n-half say, and it was more shocking to hear emotion in the teens voice than it was to see the rectangular cards in Izuku’s hand.\n\n \n\n“You’ve officially been granted your provisional licenses,” Izuku smiled, “congratulations.”\n\n \n\n“Oh,” He and Halfie both said at the same time. Staring frozen and fixated at the cards being placed on Aizawa’s podium.\n\n \n\n“Good luck,” Izuku said, and with that finishing statement, he left the classroom.\n\n \n\n.\n\n\n.\n\n\n.\n\n\n.\n\n \n\n“Congratulations,” Izuku said once again during his time at UA, this time it was up on a podium and directed towards the masses of UA, “for making it this far despite the tribulations and suffering you’ve no doubt had to persevere through to get to this point.”\n\n \n\nIt has been 3 long years, three years plagued with enemies and hardship. Struggles and peace. Excitement and anxiety. Three years of the best and worst times of their lives, all to get to this point. To get to where they were finally, \n\nfinally\n\n, getting to work in the profession of their dreams. To finally be proheroes. \n\n \n\n“I’ve been watching, as much as I could, as you’ve changed over the years. Grown as heroes and as people who will serve the public and help. To be the good that some people won’t get otherwise. I am proud, as much as I can be, that you’ve chosen to struggle through the times and reach this point. Proud that you’ve decided to enter into the world of saving lives as Heroes.”\n\n \n\nKatsuki stared up at Izuku, his old childhood friend turned brother turned victim turned… \n\nsomething\n\n. Watching as he spoke and soaking up all the differences he could see. It took awhile, and a ton of therapy that was forcefully mandated at some point due to ‘outside intervention’ (a fancy way of saying the president and principal fraternized with each other to descend on them like well meaning but manipulative devils), but he’s finally accepted that yes. Izuku was in fact the president and wasn’t actually spiteing his very existence. (Casual spite, however, was expected and delivered post-haste as well as deserved). \n\n \n\nThe speech wasn’t long, but it was powerful. The way Izuku worked words around and structured them to best deliver his message was always a skill Katsuki reluctantly admired. He had never been skilled in the way of words. Refusing to cherry pick just so some fuck-up extra didn’t get their feelings hurt. Though he could have used it when it came to the more emotional talks he’s had with Izuku over the last year. After finally getting over himself, he had asked for some time for them to talk.\n\n \n\nThat had led to several discoveries, one of which being Izuku could pack a mean punch and was \n\nwell trained\n\n.\n\n \n\nOnce the speech was over, class A, freshly graduated, had walked over to gather around Izuku. The man having visited them several times over the years to either terrorize them or Aizawa before heading to see Nedzu. He had become a common sight to see in their common room as well. Finally having shed his president’s mask to show more of the honey sweet personality he was known for having when they were kids when he had gotten comfortable.\n\n \n\n“Izuku!” They all cheered, smiling and crying and laughing as they all celebrated finally reaching this point. Even Aizawa had cracked a grin, a true smile, instead of his usual smirk.\n\n \n\nThey talked for a while, discussing future decisions and where they were all planning on going from that point onward. Getting advice from the president himself on how to handle certain interactions with the HPSC and to call him at any time if they needed help. They sat there for hours just talking and existing together for a final time before they were separated by their future paths. They would always come back together, in meet ups and hangouts, but for now they would separate.\n\n \n\nIt was when they had started to walk away, Katsuki having dragged Eijirou with him as they started to head towards the afterparty, when Izuku spoke up.\n\n \n\n“Kacchan!” He called, making him instantly snap his head around to stare wide eyed at his old friend. “Welcome to heroics!”\n\n \n\nThe area seemed to dull out and muffle around him, his focus kept directly on Izuku. The same person who had discarded that nickname the minute he had decided Katsuki couldn't be his friend anymore. And yet, and yet there it was again. Rolling off his tongue easily, as if he never stopped using it.\n\n \n\n“Or should I say,” Izuku smiled, a shit-eating grin, “welcome to \n\nmy \n\nheroics industry.”\n\n\n\n\nYep\n\n, he smiled, amused despite everything as he let out a sharp bark of laughter, \n\nstill fucked.\n\n"
}