{
    "id": "36740683",
    "url": "https://archiveofourown.org/works/36740683?view_full_work=true",
    "author": [
        "cvrely"
    ],
    "title": "knight in shining (plot) armor",
    "rating": "Explicit",
    "archive_warnings": [
        "Graphic Depictions Of Violence"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "전지적 독자 시점 - 싱숑 | Omniscient Reader - Sing-Shong"
    ],
    "relationships": [
        "Kim Dokja/Yoo Joonghyuk"
    ],
    "characters": [
        "Kim Dokja",
        "Yoo Joonghyuk"
    ],
    "additional_tags": [
        "Dubious Consent",
        "Isekai",
        "vine sex",
        "Aphrodisiacs",
        "Suicide mentions",
        "Bottom Kim Dokja",
        "Top Yoo Joonghyuk",
        "WOS is a Romance Novel",
        "Ludicrous Sexual Situations",
        "Very Brief YJH/Woman but Trust Me it's Just For Context",
        "The Universe is Yoo Joonghyuk's Wingman",
        "Sacrificing Yourself is Romantic",
        "Anal Sex",
        "Blow Jobs",
        "and there was only one bed",
        "Tls123 spoilers"
    ],
    "language": "English",
    "series": "Part 1 of one knight stand",
    "published": "2022-01-29",
    "completed": "2022-02-10",
    "words": "21,795",
    "chapters": "3/3",
    "comments": "266",
    "kudos": "12,018",
    "bookmarks": "1,903",
    "hits": "127,779",
    "summary": "<p>\"You could just let me die,\" Kim Dokja says, weakly. Yoo Joonghyuk squeezes his hip, almost hard enough to hurt.</p>\n<p>Yoo Joonghyuk scowls. \"This is a terrible time for jokes, Kim Dokja.\"</p>\n<p>He can't believe this is really happening to him. Kim Dokja has been poisoned by a random snake attack. In the middle of the forest. With no healers and no antidote in sight. Yoo Joonghyuk has to suck the poison out.</p>\n<p>Han Sooyoung, you <i>brat</i>.</p>\n<p>-</p>\n<p>Kim Dokja wakes up to find that he's been isekai’d into one of Han Sooyoung's secret, smutty web novels.</p>\n<p>He's not sure what's more at risk: his life or his virtue.</p>\n<p>Truthfully, Kim Dokja should have expected it.</p>\n<p>Even if his heart is closed off to romantic attachments, Yoo Joonghyuk has the libido befitting an erotic novel stallion. Kim Dokja is surprised that he falls under the category of people Yoo Joonghyuk would be okay with fooling around with. Maybe it’s a situation where Yoo Joonghyuk is content to lay with any warm and willing body?</p>\n<p>They say that desperate times call for desperate measures, after all.</p>\n<p>And, as per usual, there is only one bed. </p>",
    "notes": "<p>this fic has art drawn by the wonderful @BakedMPotato! it's in the fic, but please also give it love and support on her twitter!</p>\n<p>my original plot idea was rapidly approaching 15k words and I thought that would be too long for me to finish… so I changed gears and wrote 20k of a new au completely. 🤡</p>\n<p><b>special thanks to</b>: jelly bean, 🥕 husband, 🍯 jar, kim reikja, yammy, deme-ya, and the 9158 server for keeping me somewhat sane through quarantine.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>again, <a href=\"https://twitter.com/bakedmpotato/status/1487454166977060869?s=21\" rel=\"nofollow\">please make sure to give jelly some love for her wonderful art!!</a> i am IN LOOOOOVE WITH IT... can't wait to show you the other piece she drew for it in a few days!</p>\n<p> </p>\n<p>\n<a href=\"https://twitter.com/cvrely\" rel=\"nofollow\">thanks for reading!</a>\n</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>this fic goes down as the most self indulgent thing I've ever written and I am just delighted to force it on the world.</p>\n<p> </p>\n<p>\n<a href=\"https://twitter.com/BakedMPotato/status/1489301423401713666?t=LilqijU6IdYn9294doTUBg&amp;s=19\" rel=\"nofollow\">please make sure to check out jelly's art on twt for the 2nd chapter! It is AMAZING!!! </a>\n</p>\n<p> </p>\n<p>thank you for reading!!!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>WAHOO it's over! </p>\n<p>please make sure to <a href=\"https://twitter.com/BakedMPotato/status/1487454166977060869?t=mKCX7VOAejSj01LQeql33A&amp;s=19\" rel=\"nofollow\">send Jelly all the love for her art!</a></p>\n<p>this was meant to be only porn, with very little plot. It was also meant to be short. It didn't turn out like that, but hopefully you enjoyed anyway. </p>\n<p>thanks for reading!</p>",
    "text": " \n\n\n\n \n \n \nHan Sooyoung's first mistake is leaving Kim Dokja alone in her living room while she takes a call. \nHer second mistake is leaving her laptop unlocked.\nKim Dokja recognizes the web novel page banner. He meant to check if one of his favorite series had been updated. It's by absolute chance that Han Sooyoung is logged into an unfamiliar account, and it's suspicious to him that Han Sooyoung—who constantly demands he read drafts as soon as he receives them from her—hasn't told him about this pen name. \nIt's a strange point of pride for him to get to read her writing before anyone else. What is he supposed to do? Not  be nosy? After a quick scroll through the comments and descriptions, he can already guess the gist of this series. \n Ways of Seduction,  or WOS for short, follows the story of Yoo Joonghyuk: an ex-knight-turned-mercenary; a man with a terrible personality and overwhelming strength; a stoic but sensual lover with passion deep in his veins; a devastatingly handsome rogue against a world that turned its back on him.\n\n Really.\n\nIs this what Han Sooyoung writes when she isn't torturing her other characters with thousands of chapters of emotional and physical abuse? The torrid sexcapades of an ill-tempered, angsty mercenary with an alleged monster cock? \nDespite the risqué porn every other chapter, she retains her roots as a master of violence and death. The world she's designed is impossibly dangerous. Most introduced side characters drop dead like flies, but apparently, those that fall into Yoo Joonghyuk's bed can live till the end of their adventure with him—as if this man is the eye of the storm, the sole safe haven in an otherwise bleak existence. \nEven with all her gruesome worldbuilding offsetting the romance, Han Sooyoung is an excellent writer, and the smut is— \nWell...  \n\n …Yoo Joonghyuk lifted her by her thighs, his wide hands leaving handprints on her soft skin with the force of his passion. Her throat was raw and sore from the moans he worked from her body, and she wasn't sure how much more of his intense gaze she could stand before throwing herself at him.  \n\n\n \"Yoo Joonghyuk,\" she gasped, as his head dipped between her legs, seeking the heat of her core. As his tongue lapped up her intimate sweetness, she trembled, carding her fingers through his thick, wavy hair.  \n\n\n His brows, seemingly drawn by a single, uninterrupted stroke of a famed artist’s brush, furrowed with concentration as he… \n\n \nKim Dokja flushes. \nNot his usual choice of literature, but there's a particular aesthetic appreciation for Han Sooyoung's… wordplay. As he scrolls past a post-coital snuggling scene, the soft click of Han Sooyoung's door alerts him to her return. \n\"Eh? Get away from my shit—\" She drops her phone and bolts towards him, the obvious panic of someone who  knows they've left something suspicious across her face.  \n\"Sooyoung-ah,\" Kim Dokja says, backing away with his hands held up, narrowly avoiding Han Sooyoung's sharp kick as she wraps her body around her laptop, \"I didn't know you were such a connoisseur of erotic fiction.\" She frowns and starts to open her mouth, but it's too late; his phone is out of his pocket. \n\"You seem to enjoy this  tls123,\" he notes innocently, swift fingers swiping over the keys and loading up the familiar mobile site. Soon, he's openly scrolling through an account with web novel covers graced by a built, broad chest covered in scars, and adds, \"Seeing as you've amassed quite a collection.\" \nHis finger stalls over a particularly saucy cover with a 4.9/5.0-star rating and a considerably high review count. \n\"Hm,\" Kim Dokja says, smiling as politely as ever. \nStunned, Han Sooyoung's brows furrow before the embarrassed rage kicks in, and she snaps. Her cheeks are bright red as she lunges at him. \n\"Wanna die?!\"\nOver the next few months, Kim Dokja teases her for her depravity, but she recovers quickly. \nHer desire for his reactions overcomes her initial surprise at being caught. Han Sooyoung starts flipping it back on him by asking which parts he liked best since he's 'definitely read it all by now.' \nTo his chagrin, she's not wrong. \nThe problem is that Kim Dokja's endeavors to be a supportive friend and dedicated reader were meant to be something other than that. Supportive. If he'd known the predicament he'd find himself in, he would have read it much more closely. \nMaybe he would have never read it at all.\n\n\n\n\n■■■\n\n\n\n\n\nWhen Kim Dokja looks down at the inky black marks on his body, he knows where he is. \n\"I'd like to take a walk in the gardens.\" \nSeated on the windowsill of an opulent, spacious room that smells of medicine, he stares at the temple gardens below. The last minutes of sunset shines down on the lush plants below his fourth-story window; as pretty as a painting, something nice to look at but fast out of reach. The servant cleaning up the remains of his meal (herbal tea; soft, buttery bread; an assortment of tiny, bottled tonics that Kim Dokja nearly vomits at as he downs) hesitates.\nWith a pitying smile, the servant says, \"It's too cold outside, my lord.\" Kim Dokja glances at the short sleeves of a gaggle of passing monastery servants, one of them with their hair tied up to prevent it from sticking to the back of their neck with sweat. \"Perhaps once you have been cleansed.\"\nKim Dokja resists the urge to chew on his nails.\nBeing pampered is nice at first, so different from his lonely childhood, but after three weeks in this world, Kim Dokja knows that these walls are a finely decorated cage. He can't take two steps outside without guards gently but firmly urging him back inside. An honored \"guest\" in need of protection, even if it means imprisoning him in an opulent and secure set of rooms.\nSomehow, Kim Dokja wakes up to the familiar setting found in Han Sooyoung's smutty web series.  \nHe has no choice but to overcome his surprise at being isekai'd (although he supposes he perfectly fits into the average overworked salaried worker trope), and deal with the problem at hand. \n The Cursed Lady is another sordid installment following Han Sooyoung's dark, brooding MC. Each volume has a different love interest as Han Sooyoung's equivalent of a Bond girl. The one he happens to wake up in features a sheltered, cursed noblewoman with a troublesome plot twist. \n \n\n …From a young age, the noblewoman was afflicted with a curse. One that destroyed her body from the inside out, which led to her parents growing desperate while they secretly looked for a way to save her. In their distress they followed every lead, but each trail went cold.  \n\n\n Discreetly shuffled between every doctor and priest in the kingdom, twenty winters passed in this young woman’s life with no cure in sight.  \n\n\n Until a hand stretched out from a secluded religious sect, claiming experience with her particular affliction.  \n\n\n As they quickly ran out of options, they decided to send the woman to the mysterious temple against her will, where clergymen holding greed in their hearts promised miracles… \n\n \nNow he's that noblewoman. Sort of.\n(Damn it, why is there so much plot?)\nWhen he looks in the mirror, he sees no red eyes, pure white hair, or anything outlandish to indicate his status as a love interest. He looks exactly the same as he does in real life, barring the new black marks swirling from above his heart, extending across his torso and down his arms like an elaborate tattoo.\nThough he doesn't have the telltale chronic, often debilitating pain associated with the marks, his stamina has been reduced to trash. The smallest actions seem to exhaust him. He nearly passes out after a (supervised) tour around the monastery (and several subsequent escape attempts). \nKim Dokja had a desk job, and maybe he didn't work out as much as he should, but he certainly wasn't this weak. \n\"If I can't leave, let me enjoy the fresh air. It will be good for me.\" \nThe servant bites her lip, hesitant to oblige, but Kim Dokja is a noble. She may have her orders, but he can pressure her a bit. Kim Dokja might have tried to bolt the other times, but  surely he can't escape from a fourth-story window with a body like his. \n\"I'll come to close the window before bed. Is there anything else, my lord?\" \n\"You may leave,\" he hums with disinterest. It's the kind of dismissiveness that Kim Dokja's bosses might have used, but it seems to work here. \nWith a low curtsy, she obeys. The door closes behind her, the latch clicking into place as he's locked inside.\nThis is his chance. \nHopping off the windowsill, he throws the wardrobe open. A small sack is hidden towards the back filled with supplies, salvaged during his several unsuccessful attempts to escape. He wishes he had boots or something instead of the short heels angrily clicking across the floor. \nIt would certainly make this next part much easier. \nThere was no way Kim Dokja would be able to escape during the day. When they allowed him out of his room, there were always a thousand eyes on him. No, this world still follows the novel—Kim Dokja could try a thousand times and he'd never manage it on his own. \nKim Dokja needs to wait for him, after all. \nHis wardrobe is filled with clothes of various modest, but elegant designs. Chaste white and gentle ivories that Kim Dokja clumsily tied together to form a rope; a bit cliche, but Kim Dokja is merely playing along to the tune of Han Sooyoung's horny writer fiddle at this point. \nThere will be other times he will need to protect himself against the plot, but that comes later. After all, the words of the novel remain fresh in his mind, almost haunting with their clarity.\n \n\n … After twenty years of obedience and taking every foul medicine, being sent here was the closest thing she had known to betrayal.  \n\n\n She’d heard stories of a Witch on the other far side of the kingdom, past forests thick with untold dangers. Mystifying tales of the Witch’s prowess, unmatched beauty, and the ability to twist the universe to her slender fingers had filled her with hope…  \n\n\n She sounded terrifying, the woman thought, but what choice did she have? What was there for her to lose? \n\n\n Anything would have been better than staying here, with these priests and their snakelike smiles. Her family abhorred the usage of sorcery, of black magic different from the mana utilized by the clergy, but even if she was to die, she would rather die free.  \n\n\n Not here, trapped by these false holymen and their wandering hands... \n\n \nOnce outside, the sheltered noblewoman faces immediate danger—each time saved by Yoo Joonghyuk, an ex-knight mercenary that gallantly escorts her across the lands, protecting her from all sorts of evils… Sexual and otherwise.\nOriginally, she fell while trying to climb down—how could she not? \nClimbing onto the railing, a rueful smile crosses his face as the refreshing evening air rustles his clothes. \nShe was weak to begin with, and shouldn't be engaging in strenuous activity, much less rappelling down the side of a building. The silks and other delicate fabrics were never meant to hold the weight of a human being, especially when tied by her inexperienced hands. \nShe fell right into Yoo Joonghyuk's arms, their eyes meeting as he'd saved her… \nWith his jaw clenched, Kim Dokja lowers himself off the edge, trying to make his way down slowly. \nFabric stretches and snags under his weight. If this wasn't what had happened in the novel, there's no way that Kim Dokja would have done something like this. Each shift strains the taut fabric, creaking like it'll rip any second. His shoulders ache with exertion, and his arms tremble. \nIt seems to be a race between what will give out first: the makeshift rope or Kim Dokja's grip.\nFor a moment, he's reminded of memories he tries not to think about. Of a time in his life when he'd felt trapped, desperate, like this woman must have as she tried to fight her fate. \nIn truth, he knew what he would have to do all along. \nKim Dokja lets go. \nThe fabric whistles as it leaves his hands, his balcony gets smaller and farther, and the endless sky opens up above him. \nStars twinkle in the dark, bright enough in this world that Kim Dokja wonders if he could reach out and grab them. He never hits the ground. Solid, strong arms loop behind his back and under his knees, holding him against a firm chest. \nGrinning, Kim Dokja looks up at the bewildered, trespassing protagonist. \n\"Hello.\"\nAnd then he says:\n\"If you don't want me to scream and alert the guards, Sir Joonghyuk,\" —Yoo Joonghyuk's eyes shake, his hold around Kim Dokja threatening to bruise his delicate skin—\"take me with you.\" \n\n\n\n\n\n■■■\n\n\n\n\n\nYoo Joonghyuk looks like he wants to hit Kim Dokja over the head to knock him out, but just as Kim Dokja had read, a passing patrol is about to turn the corner and forces Yoo Joonghyuk's hand. \nIn an impressive show of protagonist skill, Yoo Joonghyuk escorts him outside of the temple grounds without any issues. It's a little annoying how Yoo Joonghyuk is more successful in his single attempt than all seventeen of Kim Dokja's tries, but Kim Dokja has read plenty of ridiculous scenes including Yoo Joonghyuk's luck. \nWhen Yoo Joonghyuk finally stops in a quiet clearing in the woods, Kim Dokja is still glancing over his shoulder nervously. The gaze Yoo Joonghyuk turns on him is piercing, and full of suspicion.\n\"Who are you?\" He hasn't drawn his sword, but his fingers look like they itch to. \n\"An admirer of yours.\" When Yoo Joonghyuk actually places his hand on the handle of his sword, Kim Dokja breezily continues, \"My name is Kim Dokja—a noble's son. The temple told my parents they could 'heal' me, but I've just been locked in a room for nearly a month.\" \nIt's almost hard to say the word 'parents', but he manages. Kim Dokja's story is plausible, many people are fooled by the temple's fraudulent values, but the problem is… the bastard man himself. \nAfter having been betrayed and robbed of significant wealth by Anna Croft in the last book, Yoo Joonghyuk is in the middle of a cynical character arc. \nNot that Yoo Joonghyuk was particularly trusting to begin with, but if Kim Dokja understands anything about tropes, Yoo Joonghyuk is in desperate need of saving from himself by some sex-driven character development. \nKim Dokja doesn't have love or interest, but he does have a sack of gold coins and knowledge Yoo Joonghyuk would be interested in.\nHis plan starts with convincing the protagonist to be his meat shield for a few weeks and ends with urging Han Sooyoung into writing wholesome, unproblematic slice-of-life fiction. \n(Of course, there are a few additional objectives here and there—like \"don't have sex with Yoo Joonghyuk\"—but Kim Dokja will cross those bridges when he gets to them.) \nIt's his time to shine, right? He didn't spend a few weeks locked in a room for nothing. All Kim Dokja has to do is set the stage and Yoo Joonghyuk should follow the preordained path. \nCompared to the journey ahead, this should be easy. \n(As easy as purposefully falling from a fourth-story balcony can be.)\nYoo Joonghyuk doesn't look like he believes him, but he hasn't run him through with a sword, either. Considering that Yoo Joonghyuk once dropped a man off a bridge for little reason but inconvenience and bad timing, Kim Dokja considers this a win.\n\"The main road is nearby,\" Yoo Joonghyuk says, gesturing to his left and into the trees. \"Follow it and you'll hit town before daylight.\" \nIn  Ways of Seduction,  Yoo Joonghyuk left the FL behind too. \nIf Kim Dokja had a choice, he would have preferred to avoid Yoo Joonghyuk altogether… Being next to the MC is begging to be thrown into outrageous, and probably (definitely) indecent situations—but he's at a disadvantage even with his knowledge. As coddled as this character was, Kim Dokja doesn't seem to have picked up any useful skills like magic or swordsmanship. \nAnd to make matters worse, Yoo Joonghyuk is the only character with plot armor! \nKim Dokja might actually be more fucked without Yoo Joonghyuk's presence. \nAfter being attacked by a beast and having a near-death experience, Yoo Joonghyuk had come to the FL's rescue. By the time she'd woken up, Yoo Joonghyuk was already branded a suspect in the \"abduction\" of a nobleman's daughter. The combination of the temple and her parents had whipped up such a frenzy that made it difficult to leave town. \nA troublesome situation. Kim Dokja grimaces. It would be best to move now, while his disappearance is still undiscovered.\n\"They'll just take me back to the temple.\"\n\"Is that any business of mine?\" Yoo Joonghyuk asks.\n\"You should make it your business, seeing as I know why you're here.\"\nYoo Joonghyuk pauses. They've been hiking away from the temple for hours. Kim Dokja ignores how his legs tremble from exhaustion, but he can't let up now. \"You're looking for the Witch—I can show you where she is.\" \n\"How would  you  know?\"\n\"I'm rich and well-informed?\" Kim Dokja says, instead of confessing that he's read about Yoo Joonghyuk fucking women every which way across the kingdom, and maybe there were bits of lore scattered amidst all the sex. \"I have an ailment for which there is no cure, and she's my only lead. Take me with you—we can both benefit from this.\" \n\"Go by yourself.\"\n\"I can't do that,\" Kim Dokja says. \"My family is against black magic and it's a dangerous journey. I would only be able to make the trip if it's you  escorting me.\" \n\"I don't deal with troublesome things,\" Yoo Joonghyuk says callously, turning around and walking towards the trees. Kim Dokja grits his teeth, following after him.\n\"When else will you get a chance to find her?\" \n\"You assume I believe you?\" Yoo Joonghyuk seems adamant, and his quick stride has him close to disappearing into the forest. \nKim Dokja is a bit nervous as he blurts, \"You still haven't gotten your revenge for how she tricked you last time!\" \nYoo Joonghyuk stops. \nHe turns around. Quick enough to send Kim Dokja stepping back, Yoo Joonghyuk closes in on Kim Dokja until they're less than a meter apart, his sword glinting viciously under the moonlight as he brandishes it in warning.\nWith narrowed eyes, Yoo Joonghyuk says, \"I won't ask again—who are you? \"\n\"I told you, I'm a  fan of yours—\" Yoo Joonghyuk's sword stops breaths away from Kim Dokja's neck. He resists the urge to swallow, lest his throat bob and he slits his own throat on Yoo Joonghyuk's blade, \"—even a servant in the lowest household would know who you are!\" \nThis isn't technically a lie. \nKim Dokja is a fan of Han Sooyoung's writing, and he enjoyed reading about Yoo Joonghyuk's adventures. Yoo Joonghyuk in the novels is canonically quite infamous for his deeds; the overpowered, world-shaking stories, not his bedroom exploits.\n Damn you, you fussy bastard,  Kim Dokja thinks. Yoo Joonghyuk seems to be searching for any sign of deception in Kim Dokja's expression. At the very least, Kim Dokja's desperation is genuine. \n\"I'll pay you to take me. Please.\"\nIn the tense silence, he can see Yoo Joonghyuk digesting his answer. \nRidiculous shit happens to Yoo Joonghyuk every damn day! He fights off creatures and beasts that others will never even know exist. All manner of absurdities follow the protagonist; why shouldn't Yoo Joonghyuk believe one more impossible coincidence?\nAfter what feels like ages, Yoo Joonghyuk's eyebrow twitches. The sword drops, deftly sliding into its sheath.\n\"Twenty thousand gold.\"\n\"Fine,\" Kim Dokja agrees, far too quickly.\n\"If you're lying to me…\"\nKim Dokja takes out his pouch and reveals two bright gems. Along with the ambiguous western royalty setting, Han Sooyoung played fast and loose with the fantasy setting, meaning things like magic and mana stones exist. Even a man like Yoo Joonghyuk can't doubt his sincerity with this. \n(Or more likely, it'll make Yoo Joonghyuk several times more suspicious of him, Kim Dokja thinks with dry humor.)\nThe mana stones resting in Kim Dokja's palm are incredibly valuable, made of pure material humming with power. The noblewoman used them as emergency energy sources for when her strength gave out… but Kim Dokja needs them for something else now. \n\"Will this do?\" \nKim Dokja presents the gems, easily worth ten thousand gold in two little pieces, and like Yoo Joonghyuk's blade, they catch the light, \"Half now, half later. Get me there in one piece and you can have all the gold you want.\" \nYoo Joonghyuk doesn't say anything, but his silence as he accepts the gems is enough confirmation for Kim Dokja. \nAh... \nMoney is really, really great. \n \n■■■\n\n\n\n\n\nAt first, Kim Dokja eyes the horse warily. \nYoo Joonghyuk doesn't even offer to help him up, not that Kim Dokja asks. He's never ridden one before, but thankfully, he doesn't have to know. The FL is familiar, and after a brief hesitation, he mounts the animal as if he's done it a hundred times. \nThough the FL was bedridden for most of her life, the horseriding was likely a treat for her, something she didn't often get to indulge in. If Kim Dokja focuses, he can see glimpses of her life: her loving, but overprotective family driven to obsession; the gilded luxury with which she grew up; the solemn, sickly shadow that followed her always. \nIt doesn't feel quite right to pity her with all she was blessed with, but there isn't any other word he can think to describe someone spending their entire life inside only to die without truly seeing the sun. \nHowever, her tragedies aren't unusual in the scope of this world. The bitterness inside him must be some sort of echo of her character, or a bizarre phantom memory, and he suppresses the emotion. This is a fictional world. She doesn't exist, and neither does Yoo Joonghyuk, not really. This is only a story, after all. What matters to Kim Dokja is surviving. \nThey travel in silence, Kim Dokja lost in thought.\nThe distance across the kingdom is unspecified within the book, summarized as a few weeks' journey. Yoo Joonghyuk insists they can make the trip in half the time—Kim Dokja doesn't want to stay any longer, but if Yoo Joonghyuk wants to make sure Kim Dokja doesn't die from exhaustion (which he already feels close to after a few hours of riding), then they're going to need to pace themselves. \nThe deal between them is thus: \nEscort Kim Dokja (unharmed) to the Witch's cabin deep within the forest bordering the kingdom. Half payment now, the rest upon delivery.\nWhile the half-payment is partly to make sure Yoo Joonghyuk doesn't leave him stranded in the middle of a forest, the true reason is that Kim Dokja can't afford to blow all his gold this early on. Having fled the city without his family's consent, this character's wealth is out of his reach, and his funds are severely limited. Nor can he use all the mana stones, or he'll end up being bedridden.\nKim Dokja could go back, but they'll never let him leave if he does. The irony isn't lost on him that he's been isekai'd into a world where he finally has a loving, present family and his first instinct is to run for the hills. \nKim Dokja refuses the destiny of a curse not meant for him, or to be poked and prodded by conmen and/or religious hacks. He's stuck with a pathetic body and a cranky mercenary sex god—not that he's interested in the latter, not in the way that most of Han Sooyoung's readers were.\nFrankly, Kim Dokja doesn't see the appeal of Yoo Joonghyuk's brooding nature. \nHow does having a terrible personality make someone dreamy? This isn't a trashy male lead redemption story! \nStill, he  is the rugged adventurer type, and his looks are unfortunately as… spectacular as Han Sooyoung had described him. Yoo Joonghyuk hadn't flinched when the weight of a fully grown adult male dropped into his arms from a fourth-story window, but even so, Kim Dokja has a thousand questions for the hundreds of comments touting Yoo Joonghyuk's allure. \nIt's unreasonable to think that Yoo Joonghyuk's complete lack of tact would ever make him a good companion. His face is the only good feature, but even then his handsome lips are turned down in a permanent, impassive frown.\n\"It's not too late to go back,\" Yoo Joonghyuk says. \"The dangers will only worsen as we travel across the kingdom.\"\nKim Dokja hasn't inherited any combat abilities. Holding a sword or weapon in his hand feels as clumsy as it would have in real life. His arm trembles when he tries to draw a bow, the arrow pitifully landing at the base of the tree trunk he was aiming towards. \nHowever, his knowledge of herbology has increased. This world's medicine is a combination of science and magic, and the noblewoman spent most of her time with her nose stuck in books about it. Perhaps searching for a cure for herself. He can identify most of the plants they ride past, which is helpful, but mostly useless for keeping him alive in a fight.\n\"Your concern is touching.\" Kim Dokja grits out, rubbing the red mark on his forearm from where the bowstring snapped against his delicate skin. It might even bruise, he thinks irritatedly. \n\"A dead man can't pay his debts.\" \nYoo Joonghyuk isn't laughing at him anymore (he'd honestly scoffed when Kim Dokja had tried to fire an arrow), but Kim Dokja can tell the man is appraising him. Whatever he sees, Yoo Joonghyuk must find him lacking as Yoo Joonghyuk takes the bow and arrow from an embarrassed Kim Dokja.\n\"Do you have such little faith in your own capabilities?\" Kim Dokja scowls.\"I can't protect you from your own weak body,\" Yoo Joonghyuk tilts his nose up at him.\nThis man is so rude. Just as Kim Dokja opens his mouth to respond, Yoo Joonghyuk silences him abruptly, hand held up. Yoo Joonghyuk brings their horses closer together and slows their pace. \nDoes he want Kim Dokja to shut up? \nAnnoyance races through Kim Dokja, but before he can do anything, Yoo Joonghyuk's hand grabs the back of his neck, forcing him to bend down as arrows whistle by. \nKim Dokja barely has time to shout before bandits start pouring out of the shadows. At least ten of them, all dressed in mottled clothes that help them blend into the trees. Yoo Joonghyuk grabs Kim Dokja's horse by the reins and jerks them both down the road in a quick gallop, but another arrow flies by and lands with a sickening shhk in the thigh of Kim Dokja's horse. \nWith a sharp whinny, his horse rears up onto his back legs. \nHe's a QA Specialist, not an Olympic horseback rider—Kim Dokja goes flying through the air, landing roughly in a thorny bush. His horse gallops away, kicking up dust as it flees. As soon as Kim Dokja is tossed off his horse, Yoo Joonghyuk hops off his own to begin fighting off the men closing in on them. \nKim Dokja has never seen a man die, but even with the gurgling of their assailants choking on blood, Yoo Joonghyuk is elegant even in violence. Soon, his face is splattered in blood, sword moving faster than what Kim Dokja's eyes can track. \nHiring Yoo Joonghyuk is worth every penny. The man is effortlessly effective in taking down their enemies. If he wasn't struggling to catch his breath from being tossed off, Kim Dokja would clap or cheer. \nAh, but nothing is ever so easy. \nA well-placed sword swing catches at Yoo Joonghyuk's tunic, the sharp rrrrip  of fabric ungodly loud even in the chaos. \n\"No,\" Kim Dokja whispers.\nBefore him, Yoo Joonghyuk's upper body twists with another elegant strike. His muscles shift under his tanned, scarred skin. Yoo Joonghyuk glistens with sweat, loose waves of his hair sticking to his handsome face, more blood dripping down his torso. The ferocious glint to his eyes, the sharp canines of his snarl, framed by full, handsome lips…. \nKim Dokja feels faint. \nThe universe is merciless, but so is Yoo Joonghyuk, who kills ten people in less than twenty minutes. \n\"Are you injured?\" Yoo Joonghyuk asks, walking up to Kim Dokja with his shirt torn in ribbons. His body is streaked with dirt and blood. Kim Dokja's mouth goes dry.\n… Kim Dokja smacks himself in the face. Yoo Joonghyuk is unimpressed. \n\"You should go home now if this was enough to scare you.\" Perhaps this is his version of kindness if Yoo Joonghyuk could ever be portrayed as such. \n Generous, yes, but only in bed. \n\"Just worry about getting me there in one piece.\" With a huff, he pats the dirt off his pants and keeps his face turned away, adding, \"Or else you won't get paid at all.\" \nHe doesn't have to hide the high flush across his cheeks. Yoo Joonghyuk could easily assume it to be shock from the attack.\n… shamefully, Kim Dokja wishes it was fear.\nMaking sure to force distance between them while pretending to calm their remaining horse, Kim Dokja curses himself once more. He shouldn't be looking at Yoo Joonghyuk like that just because he's shirtless and sweaty and hot. Definitely no daydreaming, either.  \nIf he's looking, it's out of jealousy, or aesthetic appreciation. Maybe Kim Dokja gets why Yoo Joonghyuk is so popular. He's tall, dark, and handsome. A tortured past, filled with plenty of emotional traumas to untangle. But… \nAbsolutely not! Never in a million years! \nHe may be attracted to men, but not to brutes like Yoo Joonghyuk. Kim Dokja has no desire to be bent in half and broken by his cock, thanks. It's only because Han Sooyoung wrote so  much porn, not because Kim Dokja wants to sleep with him. \nHan Sooyoung, this world's unintentional god, wasn't very clever with Yoo Joonghyuk's romantic strategies besides his dubious protagonist charm and big dick. For lack of better ideas, she throws predicament after predicament at her main duo to force them into sleeping together.   \nKim Dokja will remain strong. He has to. \nThis is merely the beginning of his troubles. \n \n■■■\n\n\n\n\nYoo Joonghyuk is blissfully unaware of the ruckus Kim Dokja's disappearance has caused. \nHaving made excellent distance from the temple, they enter a town in the late hours of the night. Yoo Joonghyuk rents a room while Kim Dokja waits at a table, a thick hood obscuring his appearance from sight. \nBecause Kim Dokja changed their meeting, Yoo Joonghyuk doesn't have to carry his unconscious body into town. There is no one to link the suspicious mercenary to the missing noble. \nKim Dokja ought to pat himself on the back for figuring out a way to not make Yoo Joonghyuk the prime suspect of his supposed abduction; not that Yoo Joonghyuk would thank him for it, or anything. \nLed wordlessly by Yoo Joonghyuk, they travel up the stairs of the inn towards a long hallway of doors. They stop in front of one, and Kim Dokja knows the answer to his question before he asks, but stupidly, he'd hoped things would have changed because they arrived early. \n\"Are these two rooms ours?\" Kim Dokja asks. \n\"Just one.\" Yoo Joonghyuk enters, leaving a hesitant Kim Dokja lingering at the door. Steeling himself, Kim Dokja follows. \"There were no other rooms available.\"\nHe's telling the truth, but Yoo Joonghyuk likely wants to keep an eye on him as well.\nFrom where Yoo Joonghyuk lies in the middle of the bed, his hair tumbles into his gorgeous face, his body stretched across the hay-filled mattress. Unsurprisingly, he's still in his mercenary gear. As far as Kim Dokja is aware, the only time he's not in it, he's in someone. His dark eyes watch Kim Dokja enter their shared room, the last one available at the inn they'd sought refuge in during the late hours of the night. \nBefitting the story, there is only one bed. \nBut, again, Yoo Joonghyuk is lying in the middle. \nAs broad and muscular as Yoo Joonghyuk is, he takes up a significant amount of space. Kim Dokja would have to cuddle up against him to not fall off the already small bed. Does he expect Kim Dokja to get in with him? There's no goddamn way. The FL had woken up in bed. There hadn't been any conversation about this in the original.\n\"You don't expect me to get in there with you, do you?\"\nYoo Joonghyuk almost looks amused, \"We aren't sharing.\" \nFramed by his disdainful, handsome brows, Yoo Joonghyuk glances toward the table. Kim Dokja follows his gaze. A bedroll is perched against one of the seats. \n… The floor? \n\"I'm a noble?\" Kim Dokja says, dumbfounded. Maybe Kim Dokja is used to being looked down on, but this character certainly wasn't. Can Yoo Joonghyuk treat him like this?\n\"What part of your begging was noble?\" Yoo Joonghyuk asks, and Kim Dokja feels his mouth snap shut. Full payment gets the bed, half payment gets the floor, Yoo Joonghyuk is saying. \nDamn this body, damn this world. What's the point of being born into wealth if he can't use it? The small coin pouch he'd brought with him is already halfway emptied, and he can't pay for another room with the mana stones. \nHaving given Yoo Joonghyuk two stones, that only left one for Kim Dokja's emergency use. With an unreliable body and a long journey ahead of them, it makes Kim Dokja nervous. Besides, trying to pay with the stone for another room would be like trying to buy an ice cream cone with a diamond ring, and would surely attract attention. \nYoo Joonghyuk closes his eyes, but Kim Dokja knows from the novel that Yoo Joonghyuk barely sleeps. It's enough to have him silently stewing in fury. Moving Yoo Joonghyuk would be impossible. Sharing a bed with him is even worse. Kim Dokja settles into the bedroll on the hard inn floor. \nFine. Fine! \nAt least his virtue isn't in danger if Yoo Joonghyuk's uninterested, that absolute bastard. \nIn fact—it's encouraging! He'll get out of this damn novel! \nAnd when he does, he'll force Han Sooyoung to write less traumatized, emotionally-constipated, uglier characters, Yoo Joonghyuk be damned. \n\n\n\n\n\n■■■\n\n\n\n\nThey make it half a day's ride out of town before Kim Dokja's resolve is tested. \nHaving lost Kim Dokja's horse and lacking the means to purchase another, they end up having to share Yoo Joonghyuk's. Yoo Joonghyuk's body heat pressed at his back is maddening. Especially because Yoo Joonghyuk seems to find pleasure in watching him struggle to stay upright. Kim Dokja is horrified by how firm his arms and thighs feel against him, bumping up against him with every powerful stride.\nTo be honest, their uncomfortable closeness aside… traveling with Yoo Joonghyuk isn't as bad as Kim Dokja thought it would be. Han Sooyoung ghosted over the major bouts of travel in lieu of only writing the action, so there's plenty of \"dead space\" that Kim Dokja tries to fill with chatter. \nHe isn't usually one to do things like this. Kim Dokja has never considered himself outgoing, and Yoo Joonghyuk is a murder-happy psychopath at times… but Kim Dokja still prefers him over her main series' protagonist. Yoo Joonhyun pales in comparison to Yoo Joonghyuk's… colorful nature. \nBesides, how many opportunities will he get to meet his favorite character? He's allowed to be a little curious. Kim Dokja doesn't have to want to fuck him to be interested in small talk. Most of the time, Yoo Joonghyuk is unresponsive or dismissive to Kim Dokja's attempts at conversation, but even the periods of silence aren't as stifling as they could be. \nHilariously, the more outlandish Kim Dokja is with his conversational topics, the more Yoo Joonghyuk actually deigns to respond; perhaps out of some sort of annoyance (or amazement) at his stupidity, but still.\nIt's at this point in their travels, where Kim Dokja thinks,  this might not be so bad, that the world laughs in his face.\nThe horse stumbles on some rocks. \n(Or maybe it steps wrong, or any irrelevant excuse of the universe's to get Yoo Joonghyuk in Kim Dokja's pants.)\nKim Dokja has no idea, but however it happens, they lurch suddenly. Kim Dokja grabs onto the first available surface, which just so happens to be Yoo Joonghyuk's broad forearms as he grips the reins. Instinctively, Yoo Joonghyuk's thighs tighten for stability, and if Kim Dokja thought he was caged within Yoo Joonghyuk's hold before, he was sorely mistaken. \nTrapped between Yoo Joonghyuk's firm, muscular thighs and the horse, Kim Dokja's breath hitches.\n\"Stop fidgeting.\" Yoo Joonghyuk orders and Kim Dokja can't help but listen to the low timbre of Yoo Joonghyuk's voice in his ear, sending shivers up his spine. \nWhat the hell. \nAs the sun dips under the horizon, Kim Dokja demands they make camp for the night. Getting off the horse after Yoo Joonghyuk, Kim Dokja slips. Before he hits the ground, Yoo Joonghyuk catches him, lifting Kim Dokja bridal style like he'd done when Kim Dokja dropped out of the sky that first day, as if he weighs nothing. \nIt does  not leave him breathless and his heart pounding. \nAnd then Yoo Joonghyuk drops him flat on his ass.\n\n\n\n\n\n■■■\n\n\n\n\n\nTraveling under the blazing mid-morning sun, a unicorn shows up on the road and starts nuzzling up against Kim Dokja. \nWhile he's first delighted by the appearance of such a beautiful creature, Yoo Joonghyuk has a distinct expression like he's holding back a smirk. Then he remembers that unicorns are said to only like  virgins. The creature gallops back into the forest before Kim Dokja can try and ride it if only to get away from Yoo Joonghyuk's stupid face. \nOnce they stop to refill their waterskins, Yoo Joonghyuk washes his face from a nearby stream. Water trickles down Yoo Joonghyuk's chest once he stands, sticking his tunic to his broad chest. \nPerhaps if Kim Dokja was more honest, Yoo Joonghyuk would be less antagonistic towards him. Or maybe he'd be the complete opposite and distrust Kim Dokja even more. Even as a reader of the novel, Kim Dokja finds Yoo Joonghyuk unnecessarily complex.\nYoo Joonghyuk still has his doubts about Kim Dokja's motives and is quite open about showing them, but he's not as aggressive as Kim Dokja thought he might be, but could it just be Kim Dokja starting to win him over? … Probably not. The original FL kept the details of her curse close to her heart too, so Kim Dokja doesn't know if it would help or hurt to tell the truth. \nBest to not show his whole hand, he thinks, even if it means Yoo Joonghyuk is convinced he's some spoiled, rebellious brat. \n\"Stop staring, or I'll charge you for that too,\" Yoo Joonghyuk says, one brow cocked. \nKim Dokja should leave. He can die, it's fine.\n\n\n\n\n\n■■■\n\n\n\n\n\nActually, Kim Dokja just might die regardless.\nA quicksand pit that actually sucks him up to his waist before Yoo Joonghyuk yanks him out and on top of him… The ground crumbles beneath him and he nearly falls off a cliff, but not before Yoo Joonghyuk tackles him to safety… He trips into Yoo Joonghyuk's arms enough times that he's pretty sure Yoo Joonghyuk thinks he's incapable of walking in a straight line… Every animal seems to want to eat Kim Dokja's face off… \nKim Dokja's life is endangered no less than five times in the next three days. \nAfter Yoo Joonghyuk has to help Kim Dokja onto the horse (instead of falling on his ass) more often than not, he just starts automatically lifting him. Kim Dokja nearly punches him the first time it happens, startled by Yoo Joonghyuk's wide hands suddenly wrapping around his waist and raising him into the air. \nKim Dokja doesn't want to thank him, and he doesn't think Yoo Joonghyuk wants to be thanked, either. It's all for convenience. It's a hassle for Yoo Joonghyuk to watch Kim Dokja struggle pathetically to get up. Kim Dokja bears the humiliation in silence. \nAnd now—\n\"You could just let me die,\" Kim Dokja says, weakly. Yoo Joonghyuk squeezes his hip, almost hard enough to hurt. \nYoo Joonghyuk scowls. \"This is a terrible time for jokes, Kim Dokja.\" \nWith a sharp, disbelieving laugh, Kim Dokja tosses his head back. He can't believe his luck. He can't believe this is really happening to him. \nKim Dokja has been poisoned by a random snake attack. In the middle of the forest. With no healers and no antidote in sight. Yoo Joonghyuk has to suck the poison out. Han Sooyoung, you brat.  \n\"Make sure to spit out the blood,\" Kim Dokja groans. It wouldn't do well for Yoo Joonghyuk to find out his secret. Yoo Joonghyuk tosses him an annoyed glance as if to say obviously.  \nForced on his back against the hard ground, he looks up at the lush canopy and ignores Yoo Joonghyuk at his side. \nUnfortunately, he is hyper-aware of Yoo Joonghyuk's hands on his hips. His left hand pulls down the top of his trousers and exposes the sharp, dark red snake bite on the curve of his hip bone. If Kim Dokja's outfit properly covered his midsection, then  maybe he wouldn't have had this problem. \nThe problem is less the snake bite, and more Yoo Joonghyuk lowering his mouth to cover the wound. Kim Dokja stops breathing altogether as Yoo Joonghyuk sucks. And spits. And sucks again, harder. Spits. Brings his mouth back to Kim Dokja's swollen skin, returns the sharp graze of teeth, his tongue lapping at the blood. \nBlood spots at the corner of Yoo Joonghyuk's mouth when he pulls away this time, a line of spit connecting them still. \nOh,  shit. Don't get hard. Don't get hard. Han Myungoh's chest hair. Gong Pildu's breath. \nKim Dokja screws his eyes shut, palms pressed into his sockets, grateful that whatever writhing he does to hide his erection can be blamed on pain. The only pain Kim Dokja feels is shame, and a traitorous ache low in his belly. \nTime seems to slow down to nothing as Yoo Joonghyuk's tongue laps at the wound. \n\"Aren't you done?\" Kim Dokja asks shakily. \n Yoo Joonghyuk doesn't say anything, but his tongue continues to swirl around the bite. Sensing something is wrong, Kim Dokja glances through his fingers. \n\"Oi, Yoo Joonghyuk—\" Yoo Joonghyuk looks up at him with blown pupils and a flushed face. A white flash of teeth has Kim Dokja's breath catching as Yoo Joonghyuk's mouth moves over the wound again, teeth grazing against his hip bone… \nOh, hell. Kim Dokja's cock twitches. Is this an effect of his blood? Or the poison? \n(Is it foolish to think about the logic of a fantastical world where everything is trying to get them to fuck?)\nEither way, he has to stop this. Regardless of whatever's causing it, Yoo Joonghyuk will kill him for this. \nKim Dokja's hands clutch and push at Yoo Joonghyuk's shoulders. His body writhes underneath Yoo Joonghyuk. Unfortunately, the effects of the poison, however little remains in Kim Dokja's blood, has taken its toll on him, making his efforts to fight back as useless as a kitten's claws. Yoo Joonghyuk's hands travel over Kim Dokja's body, chasing exposed skin. His touch is scorching as they brush up his bare sides, down his hips to hook fingers into his waistband. \nKim Dokja should run. He should fight. He should try to talk sense into Yoo Joonghyuk—\n\"This will help,\" Yoo Joonghyuk says. \nKim Dokja takes one look at Yoo Joonghyuk's flushed, lustful expression, and says, \"I don't think it will?\" \nYelping when Yoo Joonghyuk tugs his trousers down to free his cock, Kim Dokja tries to close his legs. A shiver goes up his spine at the surprise chill of the evening air, but he's only cold for a moment before Yoo Joonghyuk shifts down. With one dismissive bat of his hand, Yoo Joonghyuk spreads his knees and pins him down by the hip with one hand. \n\"You've been hard this entire time. Don't lie to me.\" \n\"You don't care about that,\" Kim Dokja insists. \nThe first hot kiss of Yoo Joonghyuk's mouth on his cock nearly makes Kim Dokja cum on the spot. \nAnd then he's swallowing Kim Dokja's cock, one hand holding down his hips to stop Kim Dokja from… bucking towards him? Away? \nThe smooth, wet sensation of Yoo Joonghyuk's mouth is unlike anything Kim Dokja has experienced. Kim Dokja can't think, he can't speak. The protagonist's hand dipping between his legs to stroke his balls will make him orgasm embarrassingly quick. \n\"Ah, Yoo  Joonghyuk —\" Yoo Joonghyuk sucks his cock like a man possessed, like he wants to devour all of Kim Dokja in one bite. \nIt takes only moments but feels like an eternity for Kim Dokja to climax, spilling down the back of Yoo Joonghyuk's throat. Yoo Joonghyuk hums as he swallows, sending another strange sensation through Kim Dokja that draws out the last waves of his orgasm, pulling Kim Dokja to a place that he can't handle.\nKim Dokja glances down at Yoo Joonghyuk between his legs. Spit glistens over Yoo Joonghyuk’s lips. His pupils are still blown, his face is obviously flushed. \nHe's the most beautiful man Kim Dokja has ever laid his eyes on.\nKim Dokja passes out.\n\n\n\n\nIt feels stupid to say, “I didn’t realize you’d want to fuck me too” out loud, so Kim Dokja doesn’t. \nTruthfully, Kim Dokja should have expected it. \nEven if his heart is closed off to romantic attachments, Yoo Joonghyuk has the libido befitting an erotic novel stallion. Kim Dokja is surprised that he falls under the category of people Yoo Joonghyuk would be okay with fooling around with. Maybe it’s a situation where Yoo Joonghyuk is content to lay with any warm and willing body?\nThey say that desperate times call for desperate measures, after all.\nConsidering how much sex Han Sooyoung wrote for him, it would be more OOC for Yoo Joonghyuk to  not  get sexually frustrated. It's Yoo Joonghyuk's bad luck to be stuck gallivanting across the kingdom with a skinny, weak companion like Kim Dokja. Compared to a protagonist dripping in sex and angst, Kim Dokja feels like an ill-fitted foil. Han Sooyoung's readers would have surely hated him.\nThankfully, Yoo Joonghyuk was  distracted enough that he didn’t notice anything strange about the injuries suspiciously healing on his body. Kim Dokja has been so careful to not get injured or bleed in any way. He seemed to have blamed the entire aphrodisiac fiasco on the snake poison, which is perfectly fine with Kim Dokja, nor has he kicked Kim Dokja’s ass for cumming in Yoo Joonghyuk’s mouth. \n(Disregarding that it was  completely  Yoo Joonghyuk’s fault.)\nThey don’t mention yesterday at all, actually. Kim Dokja doesn’t understand this development. \nThe original plotline is too strong to deviate from; is that what this world is trying to tell him?\nKim Dokja is a thousand times more aware of their close quarters on the horse, but Yoo Joonghyuk seems unbothered. For a second, he wonders if he dreamt up the whole thing, but the bite wounds (from the snake  and  Yoo Joonghyuk) throb when they brush against his clothes. \nA storm hits them around midafternoon, pouring rain that soaks them through their layers. \nKim Dokja’s teeth chatter so badly that Yoo Joonghyuk takes one look at him and yanks his horse by the reins to lead them off the path and into the forest. They decide to take cover in a small cave until the morning. \nYoo Joonghyuk’s hair looks wonderful even when plastered to his forehead, curling as he dries by the fire, close enough in the tight space that Kim Dokja can see water droplets illuminated by the flickering flames. Close enough that if he reaches out, he could catch a droplet rolling down Yoo Joonghyuk's cheek. \nKim Dokja turns over on his bedroll and tries not to look at him. He hears rustling noises. \n“Take off your clothes.” \n“Excuse me,” Kim Dokja gapes, twisting to prop himself up on his elbows—only to shy back when he realizes Yoo Joonghyuk has come closer. \nWhen had he closed the distance between them? When had he placed his hand so close to Kim Dokja’s own, his palm flat against the ground?\n“You have to dry them, fool. I won’t wait weeks for you to recover from a cold,” Yoo Joonghyuk scoffs. If Yoo Joonghyuk reached down, he could rip the clothes off Kim Dokja himself. \nHis gear has been set to the side, only clad in a thin black undershirt and his trousers. Earlier, Kim Dokja had faithfully kept his gaze cast away as Yoo Joonghyuk stripped out of his armor, but now he can’t tear his eyes away. He glances furtively at the exit of the cave, blocked off by Yoo Joonghyuk’s scarred arms caging him in.\nThere is a smirk on Yoo Joonghyuk’s face. The  barest  quirk of the corner of his lips, as if he’s making fun of Kim Dokja. \n“You’re just trying to take advantage of me,” Kim Dokja accuses, although a week ago he would have laughed at the very idea of someone as hot as Yoo Joonghyuk trying to persuade him into sex. “Like the other night.”  \nYoo Joonghyuk tilts his head, “Were you unwilling?”\nYes? No? Kim Dokja wonders what he’s supposed to say to that.\n“It… It was the poison…” This wasn’t in the plan. In fact, this was the  opposite  of the plan. \n“I’ve seen the way you look at me. Unless you have another reason to scrutinize me so closely…” \nSwallowing, Kim Dokja says, “I’m just making sure the mercenary I hired is doing his job. You’re doing a terrible job, by the way.” \nYoo Joonghyuk tips his head down, arms braced by either side of Kim Dokja. He has a slight smile on his face, as if confident in his stupidly fat pecs and gorgeous cheekbones. \n “Is that so.” Yoo Joonghyuk says. \nKim Dokja wants to tell him yes, just to piss him off, but the raindrops Kim Dokja had been so entranced by are now even closer. One falls onto Kim Dokja’s face, right on the lush curve of his mouth. No, he most definitely is not, Kim Dokja wants to shout, but his tongue flicks out to meet it, tasting nothing but craving more.  \nYoo Joonghyuk traces the action with his eyes, pupils blown and reflecting the burning, dancing gold of the fire. Kim Dokja’s mouth is dry. His lips part. \nHe isn’t sure when he started holding his breath; but his heart lurches into overdrive when Yoo Joonghyuk leans down to kiss him.\nThen, Kim Dokja sneezes in his face. \n\n\n \n■■■\n\n\n\n\nDying seems like a great idea. \nHe knows that once he gets out of the novel, no one will ever know that he sneezed into the face of the most handsome person he’s ever met… but Kim Dokja will know. And somewhere in this fictional world where Yoo Joonghyuk traipses around and fucks people significantly better looking than Kim Dokja, Yoo Joonghyuk will know too. \nSo yes, dying sounds great. \nThe mood is thoroughly ruined after his  accident , but Kim Dokja considers it to be a blessing in disguise. \nHe’d been caught up in the mood: the fire, the cramped quarters of the cave, the memory of Yoo Joonghyuk’s mouth on his skin… \nBut a new day dawns, and Kim Dokja has a renewed determination to protect his virtue. \nBy now, the temple will have notified their High Priest about his disappearance, and his parents will be equally frenzied. Yoo Joonghyuk’s has yet to be associated with Kim Dokja, but the High Priest has a special way of finding things out. He has no time to waste getting his brains screwed out, not when he still has so much preparation to do.\nKim Dokja has a lot of information. He plans to use it. He  wants  to. He can’t quite get over the feeling of inadequacy from being near someone as perfect as Yoo Joonghyuk. \nBut… statistically, this is very,  very  risky. \nKim Dokja looks at a gigantic venus flytrap-like plant. Without Yoo Joonghyuk here, Kim Dokja could die. With him, something absurd is destined to happen. Either way, Kim Dokja can’t win, but if last night is any indicator, then maybe he’ll be able to actually fend off Yoo Joonghyuk’s advances. \n(Kim Dokja has no idea what Yoo Joonghyuk is talking about when he says things like ‘I’ve seen the way you look at me’—he isn’t looking at Yoo Joonghyuk in any particular way!)\n\"This is a waste of time.\" \n“Either help me or shut up.” \nYoo Joonghyuk, obviously, doesn't do anything but stare imperiously at Kim Dokja’s struggle. \n“The secretions of this plant are actually useful, you know.” \nYoo Joonghyuk clicks his tongue. “For controlling the release rate of medication. There are other ingredients that can do the exact same thing.” He pauses, examining the plant and Kim Dokja, before his brow cocks. “And without suicidal collection methods.” \nKim Dokja pauses. \nWhy the fuck does Yoo Joonghyuk know that? \n Damn it,  Yoo Joonghyuk. Just let Kim Dokja show off for  once . Not everyone can be as effortlessly cool and knowledgeable as the protagonist. Some of them have to use the knowledge they gained from being forced to read their friend’s lecherous smut before she sent it off to her editor. \n“Those are expensive,” Kim Dokja says, then gestures at the plant with a winning smile. “This is free!” \nWhile continuing to internally harangue Yoo Joonghyuk, Kim Dokja carefully approaches the plant. It’s huge, towering over both their heads. Kim Dokja holds his breath slightly as he makes it into range of the stalk, reaching towards the glistening goop dripping down the sides…\n“Kim Dokja—!”\nIn an instant, Yoo Joonghyuk lunges forward as the two of them get swept up by the massive plant. \nKim Dokja has never been in a relationship, but he’s been told that communication is the most important factor. He doesn’t seem to be very good at it, seeing as how Yoo Joonghyuk tried to warn him. \nAnd now they’re trapped.\n Encased  might be a better word, what with how they're surrounded in the slimy inner walls, but when Kim Dokja tries to argue the semantics, Yoo Joonghyuk glares hard enough to shut him up. \n\"It's fine, I can get us out—\" Kim Dokja says, wiggling one trapped arm behind him, trying to find the seam of where the plant has shut around them. His hips move forward to allow his hand more freedom and—Kim Dokja stifles a shout. \nYoo Joonghyuk goes utterly still. His voice, quiet with rage, sends shivers up Kim Dokja’s spine. \n“Stop. Moving.” \nWhat the hell, Han Sooyoung? Writing your protagonists to be so… graciously endowed? Yoo Joonghyuk isn’t hard, but even with Kim Dokja's front brushing up against Yoo Joonghyuk’s crotch, he can get a sense for the monster locked under his pants. Even the brief touch sets all of Kim Dokja’s nerves on fire.\n\"S… Sorry,\" Kim Dokja swallows. His hand moves away. \n“My sword,” Yoo Joonghyuk says. \n Yes, I know, Kim Dokja wants to say,  I can feel it up against me, thanks, but surely, that’s not what Yoo Joonghyuk is hinting at. \n“Excuse me?” \n“Get my  sword.” \nOh.  Oh. Kim Dokja wants to smack himself in the face. Of course Yoo Joonghyuk wasn’t talking about his...\n“I can try,” he says, shifting, but his movements cause the plant to squeeze even tighter around them. \nTheir bodies are now flush against each other, where Kim Dokja can feel Yoo Joonghyuk’s breath on his cheek. With their closeness, he’s once again reminded of the slick warmth as Yoo Joonghyuk sucked his cock. Would sleeping with the protagonist feel better than that? Would his cock even fit inside him? \nIf Kim Dokja wanted to, he could tilt his head to the side and mouth at Yoo Joonghyuk’s pulse, maybe kiss the man. Having never kissed anyone before—he’d sneezed in the face of the man closest to it—so he’s not exactly sure what that all would entail. \nBut that’s only if Kim Dokja wanted that. Which he doesn’t. For some reason, his cock hardens in his pants. \n“You…” \n“Please, shut up,” Kim Dokja begs. \nAnd then, to his horror, he realizes that Yoo Joonghyuk is also hard. \nHis cock is irritatingly (and predictably) much bigger than Kim Dokja’s own, swelling against him, an impressive size even when felt through the fabric of their pants. For lack of any other way to stop him from moving, Yoo Joonghyuk bites down on the soft curve of his shoulder fiercely, painful even through the fabric of his tunic. \nHe can’t believe Yoo Joonghyuk  bit  him. \nEven less so, he can’t believe the strangled moan it rips from his lungs. \nKim Dokja screws his eyes shut, body taut against Yoo Joonghyuk’s. Both men freeze at the sound, Kim Dokja quickly turning red with embarrassment. Technically, if they were to wait, the plant would digest them in twenty to thirty days. \nAfter his moan, Kim Dokja wonders if there’s anything he could do to speed that process up.\nYoo Joonghyuk’s teeth actually bite down on Kim Dokja once more, his hands grabbing the fabric of his sleeves from where his arms are trapped at an awkward angle. Before Kim Dokja can make any more humiliating noises, his fingers brush against something metal. \n“Got it!” \nKim Dokja’s voice is deceptively calm as his hand wraps around the hilt of Yoo Joonghyuk’s sword—no, he curses at himself, Yoo Joonghyuk’s  actual  sword. He shimmies the blade up and out of the sheath, to where he’s finally able to dig the tip of the blade into the seam of the trap. \nThankfully, it doesn’t take a lot of strength. \nThe plant recoils at the first bit of pain, flying open and sending them stumbling out back into the forest. They’re covered in a sticky substance from the inside of the plant. Yoo Joonghyuk’s lips press together as if he’s about to say something, but Kim Dokja interrupts. \n\"Can we just,\" Kim Dokja gestures helplessly, \"pretend that never happened?\" \nEven while covered in clear goop, Yoo Joonghyuk is strikingly handsome as he glances up through loose waves of hair tumbling into his face, intense eyes set like sparkling obsidian as they look over Kim Dokja. At first, confusion, and then his brows narrow, eyes glaring as if something made him angry. \nBut if they act like it was nothing, then there’s nothing to be upset about. \nRight?\n\n\n\n■■■\n\n\n\n\n\nAs they near the gates of a bustling border city, Yoo Joonghyuk is silent, to the point where Kim Dokja can't keep his mouth shut any longer. \nYoo Joonghyuk’s mood hasn’t improved since they escaped from the plant, but Kim Dokja is sure he’ll get over being disgusted by their accidental light frotting eventually; they have more important things to worry about, like not letting him get caught by whatever search retinue the temple has sent out. He takes the reins from Yoo Joonghyuk and brings them to a stop. \n\"We need a cover story,\" he says, sliding off the horse before Yoo Joonghyuk can dismount and help him. Being so close to Yoo Joonghyuk isn’t good for his heart, and he feels the need to pace as they talk. He needs some space between them to clear his head, to think. “People may or may not be searching for me.”\nFrom atop the horse, Yoo Joonghyuk regards him with an unreadable gaze, lips turned downwards. \nKim Dokja hopes his reluctance doesn't slip out past his polite smile. \"It’s nothing too bad. The temple is just trying to find me.” He recognizes this town from the novel. The templars searching for the noblewoman will be here, looking for him. “And maybe a few retinues of royal guards.” \nA vein throbs at Yoo Joonghyuk's temple. \nYoo Joonghyuk has plenty of enemies. The royal family is one of them, and Kim Dokja is bringing attention to his front door. Anna Croft’s betrayal in the last volume had been just the icing on Yoo Joonghyuk's cake of misfortune. \n“Explain,” Yoo Joonghyuk demands.\n“If they see me, you’ll probably be the prime suspect of my abduction.\"\n“Abduction?  Kim Dokja. ” His body shifts like he’s going to draw his sword and strike Kim Dokja down.\n“—Of course you didn’t. You’re my knight!” Kim Dokja rushes to say. He bares his teeth in a grin, hands held out placatingly. “Don’t worry, they don't know you’re associated with me. If we keep a low profile, we can get in and out of town before anyone recognizes either of us. Anything else I'll clear up later.\"\n“I should leave you here,” Yoo Joonghyuk says. The tell-tale vein at his temple has been quite busy since meeting Kim Dokja.\nKim Dokja laughs, but there’s a bit of nervousness in his chest. “You wouldn’t though, would you? We made a deal.” \n“Damn your deal,” Yoo Joonghyuk growls. \nEyes brimming with subdued anger, Yoo Joonghyuk tosses his thick cloak at Kim Dokja. Kim Dokja grunts as he catches it, grumbling under his breath. Yoo Joonghyuk doesn’t storm away, but this certainly wasn't how it was in the novel. After entering the unpredictable area, Yoo Joonghyuk had tenderly put his cloak around the FL’s shoulders… \n \n \n\n ...her heart jumped at the feeling of his warm hand on her waist as he brought them through town. \n\n\n The cloak draped around her shoulders smelled strongly of him, dizzying in its intensity. She was grateful that he’d lent the cloak to him. Though she knew it was to obscure her identity, the hood covered her blushing face, the lingering warmth from his body seeping into her exhausted bones. \n\n\n Yoo Joonghyuk was rough on the outside, but he was dependable. Truly, this was a man she could rely on... \n\n\n\n\nIn comparison, Kim Dokja gets a mouthful of beast fur. \nOf course, by this point the noblewoman had fully given into Yoo Joonghyuk’s charms. \nIs he still upset that Kim Dokja sneezed on him? Or maybe how he got them trapped in a man-eating plant? The same could be said of any of the other ludicrous accidents Kim Dokja seems to fall into, but Yoo Joonghyuk is particularly irate today. He probably isn’t happy about having been lied to, but Kim Dokja fixed the trouble there, didn’t he? No one from the royal guard will know he’s even on this side of the kingdom. Kim Dokja would insist he go find some willing bedpartner if it didn't mean Kim Dokja's untimely doom.\nWithout hesitating, he rides past Kim Dokja. Before Kim Dokja can mount with him, he urges the horse onwards faster than Kim Dokja can get on.\n“What? Wait, what are you doing?” \nKim Dokja has no choice but to follow after Yoo Joonghyuk’s slow trot, but brisk pace for a human, especially as he’s weighed down by carrying Yoo Joonghyuk’s heavy cloak. \nWhen they get to the guard, he looks over Yoo Joonghyuk’s papers with disinterested eyes that flicker to life once they look at the handsome man. His eyes glance at Kim Dokja, who is significantly less impressive in a muddy brown cloak and hood covering him and his smaller stature, and then at the heavy cloak he holds.  \n“What brings you to town, Sir Knight?” The guard asks Yoo Joonghyuk. \n“I have business in Eden.” Yoo Joonghyuk is a hard man to question. The guard looks both starstruck and intimidated, but doesn’t pry further.\n“The entry fee is five silvers.” \n“Pay him,” Yoo Joonghyuk orders. \nKim Dokja stares at the guard, until Yoo Joonghyuk glances over his shoulder to glare at him. Kim Dokja’s eyes widen, before he clenches his jaw and dips his head obediently. He digs through his pockets for his coin pouch, significantly lighter than when their journey began. \nThe entire time they wander the marketplace, Yoo Joonghyuk treats him like a servant.\nMaybe it’s because he knows how well Yoo Joonghyuk treats the women he beds that Kim Dokja’s annoyance intensifies through their brief restock in town. Kim Dokja has never thought of himself as an angry or dramatic person; even when he was bullied in school, he managed to keep his cool throughout their torment, but there’s just something about Yoo Joonghyuk that drives him up the wall. \nHe blames the novel’s tendency to make everything he does somehow seductive. It’s almost suffocating to be met with a desire that doesn’t even feel like his own, that feels like a monster rearing up inside him. He feels so strung out on this ache, so ready to return to a place where he doesn’t feel like he’s choking on unsettling, unwanted irritation.\nStill, Kim Dokja plays along. \nApart from making a few purchases for himself, he keeps his head down, following behind Yoo Joonghyuk’s steady gait. The inn only has one room. \n\"Stay here,” Yoo Joonghyuk commands, and then immediately leaves. He doesn't say where or why, but Kim Dokja aches enough to not care enough to ask. Kim Dokja waits until the door to their room shuts to start complaining. \n\"Servant? Yoo Joonghyuk! You bastard!” \nKim Dokja wants to throttle him. \nLeft alone in their room, he looks around. To his unsurprised frustration, there's only one bed. Again. He lies in the middle of it, claiming the space. \nHay sticks through the thin sheet and pokes at any exposed skin, but despite the lumpy and scratchiness, it's better than sleeping on the hard ground. He dozes pleasantly for the first time in weeks—up until Yoo Joonghyuk returns and sends him flying off the mattress with one swift tug of the thin blanket. \nKim Dokja lies on the ground, struck with enough pain to have him frozen in place. His jaw clenches, forehead pressed against the hard floor. \nYoo Joonghyuk makes him sleep on the floor. Again. \nKim Dokja  hates  him. \n\n\n\n\n■■■\n\n\n\n\nIt’s only after they leave town (leaving behind that small room, the single bed, the hard floor beneath Kim Dokja as he forced himself to recount the details of the novel that he knew to not think about Yoo Joonghyuk’s quiet, even breathing mere meters away), that he feels like he’s able to breathe again. \nThey travel in silence for most of the day. A stuffy, tense several hours where Kim Dokja tries to not touch Yoo Joonghyuk even whilst completely pressed up against him.\nLater, they set up camp by a nearby river.\n“I’m refilling my waterskin. Don’t follow me,” Kim Dokja says as Yoo Joonghyuk tends to the fire. Yoo Joonghyuk’s response is a disinterested grunt, followed by him adding another stack of branches to the growing flame. \nYoo Joonghyuk might be capable. He might be the best swordsman in the land. He might be incredibly handsome. He could have three heads and six wings for all Kim Dokja cares—he absolutely can't stand him. \nStupid sexed up bastard with an incorrigible personality. Kim Dokja should cut off his cock next time Yoo Joonghyuk even thinks to use him to blow off steam! \nHe kneels at the base of the river, rinsing out his waterskin. If he wasn’t so exhausted from tossing and turning on the floor, he might have noticed the vines creeping up on him. \nIn an instant, everything falls apart. \n\n\n\n\n■■■\n\n\n\n\nHan Sooyoung is a pervert. Han Sooyoung is a pervert! \nThis sentence plays over and over in his head as the slick green vines wrap around his limbs. Even if Kim Dokja hadn’t inherited the herbology knowledge from this character, he would know this trope anywhere. \nThey rip off the flowy fabric of his shirt, exposing his bare skin to the cold slime oozing from the plant. He fights the vines pulling at the cords of his pants—but it isn't long before the vines loosen the knots. \nThe pants slip down over his hips, exposing his cock and ass to the mid-afternoon heat. Kim Dokja is thrown on his stomach in lush foliage, crawling away as the vines wrap up his exposed thighs and spread them. Smaller vines tug and pull at his nipples, making them stand out against the cool air.\n\"Damn it, Han Sooyoung,\" Kim Dokja curses, face pushed into the sweet smelling flowers. \"Who taught you this?\" \nHe licks his lips. The pollen smells sweet, but tastes earthy, like the herbal tonics he'd drank at the temple.\nA vine prods at his hole. Kim Dokja chokes, and a vine takes the opportunity to fill his mouth. The thick end of it rubs up against his cheeks, spreading the sticky substance across the tight ring of muscle. It almost feels like a tongue, Kim Dokja thinks, chest heaving. \nDespite his initial fear, the vine doesn’t seem to want to enter him yet, messily rubbing up against his hole instead. Pleasure makes his body twitch, uselessly struggling against the other vines holding him face down in the flowers. Pollen puffs up into the air almost comically, settling to leave another light layer as if it wasn’t already completely covering him. \nAt the first foreign breach, Kim Dokja shouts around the vine stuffed in his mouth, but most of the fight has left his body. The vine isn’t very thick, but Kim Dokja never thought his first time would be with a fucking plant, and it shakes him to his core regardless. He wishes he was disgusted at the sensation, but instead, he finds his hips rocking back into the thrusting plant, letting it curl inside him and stroke against his walls. \nAll the dizzying lust he's tried to suppress over the last weeks come bubbling to the surface, making him give in easier than he'd like to admit to the plant's foreign touch. \nAn itch is being scratched, whether he wants it or not. \nWhen the vine brushes against a spot that sends sparks dancing across his vision, Kim Dokja almost panics. But then the vine strokes that spot again, prodding it curiously; again and again, Kim Dokja groans into the flowers. It feels better than touching himself. Heat steadily builds inside his stomach. \nHow much time passes like this? Kim Dokja's cheek rubs into the soft petals, drool slipping from the corner of his mouth. \nHe must have been gone long enough to make Yoo Joonghyuk notice. A flashy, dramatic show of swordsmanship frees him, vines flying through the air as Yoo Joonghyuk cuts them down. \nWith true main character timing, Yoo Joonghyuk saves him. \nUnfortunately, he also interrupts him before Kim Dokja can cum.\nThe palpable relief Kim Dokja has started to feel whenever Yoo Joonghyuk shows up is an addictive, dangerous feeling, but this time, it’s replaced by disappointment as he’s suddenly empty, hole clenching greedily around nothing. The vine in his mouth falls, Kim Dokja coughing as he gasps for air. \nYoo Joonghyuk looks down at him, handsome even with the bright yellow pollen dusting his cheeks. Vaguely, he wonders if he should be concerned about Yoo Joonghyuk also being exposed to the substance, but his hole twitches as if lonely. \nKim Dokja has spent the last week fighting off all manners of ludicrously sexual situations, and this feels like the icing on the cake. \n“Kim Dokja,” he says, alarm in his dark eyes as Kim Dokja paws at the front of Yoo Joonghyuk's pants.  \nToo distracted by his lust, Kim Dokja doesn’t see how Yoo Joonghyuk’s gaze travels over Kim Dokja’s exposed, pale skin. His fingers are clumsy as they fight with Yoo Joonghyuk’s belt, desperate to get the hardening cock obscured beneath the fabric.\n(One of several belts he normally wears, but thankfully he’s only wearing one right now. Kim Dokja would be fucking himself senselessly on his fingers if he had to wait for Yoo Joonghyuk and his damn belts.)\nInstead of rage, Kim Dokja thinks he might be able to accept what that burning emotion in Yoo Joonghyuk’s eyes has been for the last few days.  Desire . \nAs if he wanted this. As if he wants Kim Dokja.  \nThis isn’t the first WOS book he’s read. All of the previous books follow a pattern, and from the beginning, Kim Dokja would have been blind to not see it. If this universe is centered around Yoo Joonghyuk’s sexual adventures, and those adventures  aren’t  happening, the natural flow will only continue to keep trying to fix it.\nFuck it, Kim Doka thinks. Set the universe right. \n“You’re not in your right mind,” Yoo Joonghyuk warns, firm hands on Kim Dokja’s trembling shoulders. \nIf the universe wants Kim Dokja to fuck Yoo Joonghyuk, then he will. Kim Dokja wants to exist without worrying about getting trapped by yet another monster plant. He’d rather be trapped on a monster cock. Yoo Joonghyuk being stupidly handsome has nothing to do with it. \n\"You didn't care last time.\"\n\"Kim Dokja.\"\n \"Yoo Joonghyuk,\"  Kim Dokja groans, shoving him down onto the floor. For some reason, Yoo Joonghyuk lets him do this, his hands resting on Kim Dokja's waist as he hovers above him, in his lap. “Shut up and fuck me, you damn son of a bitch.” \nHis nails dig into Yoo Joonghyuk's skin. Blood wells up under thin crescent cuts, and Yoo Joonghyuk's eyes shake. \nAnd as if a dam has broken, Yoo Joonghyuk reaches up to grab him by the back of the neck as he lurches upright, his free hand preventing Kim Dokja from falling back at his sudden movements. He yanks Kim Dokja forward, mashing their mouths together. \nIt feels like a dance, like being devoured, like everything Kim Dokja has ever wanted in life. Kim Dokja can taste the pollen off Yoo Joonghyuk’s lips, and doesn’t have it in him to care. Yoo Joonghyuk holds onto him hard enough to bruise, as if Kim Dokja will try to once again escape from his grasp. Kim Dokja deliriously wants to laugh. He's terrified, but there's nowhere else he'd rather be. \nAfter kissing an inexperienced Kim Dokja breathless, he pulls back, a single string of saliva connecting their parted mouths.\nIt might be a testament to whatever aphrodisiac Kim Dokja's been huffing for the last hour, but the comparison of their cocks does not make Kim Dokja as self-conscious as he thought he'd be. \nRather, the opposite; Kim Dokja's mouth salivates at the sight. He wants to put his mouth on it. He wants to feel it inside him, changing his insides, making him writhe. Fucking him like he'd read Yoo Joonghyuk fuck those girls; until they were dripping, half-drunk on his cum. \nKim Dokja's cock dribbles pathetically as it grinds against Yoo Joonghyuk's own, thick enough that his hand can’t properly wrap around the both of them. \nWhen Yoo Joonghyuk’s hand covers his, Kim Dokja stops thinking. He arches his back into Yoo Joonghyuk pulling at a pink nipple, tugging with his teeth till it gets swollen under his mouth. Every inch of skin that Yoo Joonghyuk touches feels set alight, boiling his blood with an itch starting low in his belly. \nHe ruts against Yoo Joonghyuk’s cock as his hole twitches, an empty ache from being teased open but not satisfied. Kim Dokja doesn’t know how to ask for this. He’s afraid to say anything at all, because once he does, it’ll be begging that Kim Dokja can’t stop. \n“You started this,” Yoo Joonghyuk breathes, and flips them over. \nYoo Joonghyuk’s cock slips between his cheeks, bumping past his hole stretched by the vines. With a whimper, Kim Dokja rolls his hips and reaches between them to position it at his entrance. Cursing low under his breath as he watches, Yoo Joonghyuk runs a soothing hand down Kim Dokja’s spine, to the curve of his ass, rubbing the ring of muscle as the tip of his cock kisses him there. \nAt the first breach of Yoo Joonghyuk’s cockhead past his rim, Kim Dokja shivers. His muscles are already soft, made slick by the sticky residue oozing from the plant, but he wants to take this slow. He wants to feel Yoo Joonghyuk fill up his belly.\nYoo Joonghyuk has no such compulsions, grabbing Kim Dokja by his waist and burying his fat cock into him. \nKim Dokja cries out. He feels full to his throat, stuffed close to breaking at the seams. Then Yoo Joonghyuk lifts him off, only to bring him down in another ruthless, savage motion. Easily, Yoo Joonghyuk fucks the air out of his lungs as Kim Dokja tosses his head back, short  ah, ah, ahs in tandem with each snap of his hips. \nHe squeezes around Yoo Joonghyuk's cock. \n\"I thought you'd be chattier,\" Yoo Joonghyuk grunts, surprising them both. It only takes a glance at the protagonist’s flushed face to see that Yoo Joonghyuk is also being affected by the pollen. \n Shut up, Kim Dokja wants to tell him, but Yoo Joonghyuk has Kim Dokja as far down on his cock as he can go, and is grinding down even further. The head of his cock rubs against Kim Dokja's deepest walls as if trying to—one of Han Sooyoung’s favorite lewd lines—mold the shape of his body to Yoo Joonghyuk’s cock. \n\"You're more trouble than you're worth,\" Yoo Joonghyuk says, but he's still reaching up to Kim Dokja's cheek and slipping three fingers into his mouth to spread over his tongue. Kim Dokja moans as he laps at his hand. Yoo Joonghyuk watches him with a flushed, pleased expression. \nKim Dokja wants to strangle him so he shuts up; but he also wants to listen to him talk forever. God  damn  it, Han Sooyoung. \nThanks to the pollen, the first orgasm makes him black out, his vision only returning as his body relaxes from the taut stretch of his toes curling, his muscles contracting violently. \nThen, Yoo Joonghyuk grabs his cock and milks a second one from him. Kim Dokja’s cock spurts all over Yoo Joonghyuk’s hand, dripping onto the lush ground beneath them. His hips twitch and buck, body shivering uncontrollably. \nBy the third, Kim Dokja realizes he’s crying, tears spilling down his face from the sensation of being filled, over and over and over again as he babbles. \n“Stop, please,” Kim Dokja begs, even as his hard cock still bobs between his legs. “I, I can’t…” \n\"How can I stop when you aren't satisfied yet?\" Yoo Joonghyuk’s hand cups Kim Dokja’s cock, thumbing the head as he affectionately nuzzles into Kim Dokja’s hair. \nKim Dokja crawls to the stream to sip water, or try and get away, or find some relief from the pleasure overwhelming everything he’s ever known… but Yoo Joonghyuk slides his hands under his waist, lifting him and pulling him back towards his cock.\n\"Don't run, Kim Dokja.\" \nYoo Joonghyuk’s unnecessarily digging his nails into Kim Dokja’s skin. His hold is a cage that Kim Dokja wouldn’t be able to escape anyway.\n“Hhk!” Sand slips through Kim Dokja’s scrambling fingers as Yoo Joonghyuk grinds his hips as deep as he can go. He has no idea how many times Yoo Joonghyuk makes him cum. \nThe sun begins to set, turning the evening sky a furious red, like Kim Dokja’s knees rubbed raw from the sand and stones. Yoo Joonghyuk takes him until his spent cock leaks clear liquid onto the riverbank, until the protagonist’s cum leaks down his bitten inner thighs and the stars come out to enjoy the show.\nFor the second time in his recent memory, Kim Dokja does what every overwhelmed love interest does when met with Yoo Joonghyuk’s prowess.\nHe passes out. \n \n■■■\n\n\n\n\nRiding a horse is ten times worse after sex.  Everything  aches. \nHe feels like he’s been hit by a truck, and even wonders if he had been. Maybe that’s how he got here in the first place and he just doesn’t remember, but it would make sense. That’s how it happens in all those other stories, right? \nYoo Joonghyuk keeps a blessedly slow pace, mindful of Kim Dokja’s discomfort. Truly, the most gentlemanly the man has been yet. By the time they arrive at the next town, the moon is full, bright, and high in the sky. Lanterns dot the outsides of buildings, most windows lit up by the inhabitants inside. \nDespite the distinct ache in his back (and every other part of him), Kim Dokja is the most content he’s been this entire journey, wiped clean and swaddled up in Yoo Joonghyuk’s thick cloak. He drowns in the scent of something intrinsically Yoo Joonghyuk, drunk and lightheaded with it all, but that could be the exhaustion. \n\"You should consider a muzzle,\" Kim Dokja suggests, frowning as the collar of his tunic grates against tender skin, raw with bites. \nHis idea to muzzle Yoo Joonghyuk somehow doesn't get him thrown off the horse. Maybe that would be better than riding a horse with him; less awkward than being aware of his warm, solid presence against Kim Dokja's back.\nHis firm thighs press up against Kim Dokja's thighs. Kim Dokja can easily picture the length of his huge cock pressing up against his ass, having become intimately acquainted with it for the last several hours. \nTo Kim Dokja's chagrin, his ability to not think about Yoo Joonghyuk’s sexual prowess has weakened significantly.\nThe innkeeper assumes they are married, but Kim Dokja is too distracted by his mauled body to notice the slip up, half-asleep leaning against Yoo Joonghyuk. Yoo Joonghyuk guides the mildly delirious Kim Dokja to their room. \nAgain, one bed.\nInstead of collapsing into it like he wants to, Kim Dokja collapses into the wooden chair. He props his elbow up on the table and holds his face in his hand. He’ll set up the bedroll, he just needs a second. \nKim Dokja doesn’t know how long his eyes have been closed, until Yoo Joonghyuk’s voice, softer than he’s ever heard, speaks up.\n“Take the bed,” Yoo Joonghyuk says. \nKim Dokja’s eyes open, and Yoo Joonghyuk is seated across from him. \n“All it takes is some sex pollen and you’re letting me have the bed?”\n“If you had told me…” Yoo Joonghyuk says, indignant. Kim Dokja sits up with a frown, wondering if Yoo Joonghyuk is  really  going to try and start a fight  now , of all times— “Your curse. I didn’t know.” \nAh. Yoo Joonghyuk saw. Of course he saw, Kim Dokja thinks. \nYoo Joonghyuk had fucked him for hours, licked and sucked his nipples to their swollen state. There were bitemarks all along his shoulders from the man’s teeth; there was no way he missed the black tendrils spreading over his body.\nKim Dokja laughs. \n“How would you have known? Why would I have told you?” he says. \nYoo Joonghyuk, watching him with indiscernible emotions behind dark eyes and a furrowed brow, remains silent. Kim Dokja’s fingers itch to remove the day’s clothes and fall into bed, but that vulnerability seems unwise. \n“It wouldn’t have changed anything anyway,” Kim Dokja adds, trying to diffuse the awkward tension.\nWhat… What is this atmosphere? \nKim Dokja wonders if it’s because of the nature of his curse that Yoo Joonghyuk is acting this way. Yoo Joonghyuk has never gotten along with the constellations, so perhaps he feels some sort of pity for Kim Dokja. Yoo Joonghyuk would know best the double-edged swords of mysterious constellations playing god with this world.\nAt first, Kim Dokja assumed Yoo Joonghyuk was angry. Yoo Joonghyuk being a bastard, yes, that’s business as usual and he hates it, but he can deal with it. \nThe fire in their room crackles, the warmth settling into Kim Dokja’s sore bones. He’s more awake than he was minutes ago, perplexed at Yoo Joonghyuk’s unexpectedly concerned face. Yoo Joonghyuk doesn’t say anything else, only staring at Kim Dokja as if… \nNo. This must be anger. He doesn’t know what to do if it’s not. \nSuddenly, the room is too stuffy. \nEven though his body screams at him to sleep, he pushes himself out of the chair. \n“I’m hungry.” \n\n\n\n■■■\n\n\n\n\nA bard croons a simple, pleasant tune, her fingers strumming a lute. Men play cards on a table in the corner, the sound of their casual chatter indiscernible as it drifts to Kim Dokja’s tired ears. He hasn’t had a chance to properly enjoy the world, too focused on staying alive and getting out, but… \n This is nice, Kim Dokja thinks. \nYoo Joonghyuk drops into the seat across from Kim Dokja. A steaming bowl of soup is set in front of him, chunks of meat and vegetables floating in the thick broth. With a smile, Kim Dokja happily digs into the offering. Sex has worked up an aggressive hunger, he realizes with a flush.\n“You shouldn’t be straining your body to this extent,” Yoo Joonghyuk says, out of the blue. It catches Kim Dokja off guard, spoon held halfway to his open mouth. \n“Are you worried about me?” Kim Dokja grins. \n“Forget I said anything,” Yoo Joonghyuk scoffs, arms crossed. The tankard of ale in front of him remains untouched. It's as if he’s too invested in ensuring Kim Dokja eats to do anything else but watch him. \nHe isn’t sure if Yoo Joonghyuk’s concern is referring to Kim Dokja’s insistence that they eat in the tavern rather than holing up in their room after nearly getting fucked to death by him, or his determination to trek across the kingdom with a rotting body. The soup fills his stomach with warmth, and the gentle bustle of townsfolk around them create a comfortable atmosphere for honesty.\n“I have to go. This is my last chance,” Kim Dokja confesses. He keeps his eyes focused on the crackling fire of the hearth at the center of the room. “If we fail...” \nIf he goes back, this character’s family will never let him leave. Out of misguided, genuine concern, yes, but he does not belong here. Kim Dokja shrugs.\nKim Dokja refuses to live trapped in an unfamiliar world. \nYoo Joonghyuk doesn’t say anything, not that Kim Dokja is looking for comfort. However, if there is even an ounce of the honor or righteousness within Yoo Joonghyuk that Kim Dokja’s read about, then he’ll at least take advantage of that. \nTo return back to his world, Kim Dokja will use anything he can. \nThey don’t talk for the rest of the meal. \nYoo Joonghyuk has never been chatty, but he’s more subdued than usual. Kim Dokja doesn’t know how to shake the weird mood off them, but the anxiety of being so close to their goal distracts him from even trying. \n“I’ll head to bed first, then,” Kim Dokja says, spoon clattering as he places it in the empty bowl. Yoo Joonghyuk eyes him, as if appalled at his horrible manners despite his upbringing, but stays seated. They’re not obligated to return to the room together, after all. \nIt’s halfway down the upstairs hall that he senses someone following him, but when he glances over his shoulder, there is no one.\nDread rises within him like bile. Their room is so close, but time slows down, and the door seems farther with each step. Finding Yoo Joonghyuk would be the safest course of action, but that path is blocked by whoever is following him. Part of him wonders when he so easily began to rely on Yoo Joonghyuk, finding it almost pathetic. \nStill, Kim Dokja squares his shoulders and thinks of that broad, dependable back as he faces his opponents. With a long sigh, Kim Dokja stops. He turns around. \n“I know you’re there.” \nThe candles spread through the hall flicker from wind he doesn’t feel, dancing in the dimly lit space.\nKim Dokja never makes it to the room. \n\n\n\n\n■■■\n\n\n\n\nUpon arriving at the humble, secluded monastery, Kim Dokja is stripped, bathed, and clothed once more in soft white robes. As quaint as this area is, there is a significant number of guards patrolling the grounds; Kim Dokja recognizes the insignia on the front of their coats as the holy symbol of the clergy. \nThe room he's kept in is modestly furnished, tidy, and welcoming. Both of his abductions have been reasonably pleasant. The most unpleasant detail right now is sitting across from him. \n“Are you wondering where your little knight went?” The High Priest asks, smiling as his head tilts. “We thanked him for keeping you safe and paid the rest of his fee, but said it would be  troublesome for you to remain away from our protection any longer.” \n“At least someone’s paying him.” \nKim Dokja’s words are relaxed, but something drops in his stomach. If he’s been paid off, there’s no reason for Yoo Joonghyuk to come. What else kept Yoo Joonghyuk by his side except for their debt? \nThe High Priest clicks his tongue, like talking to a child.\n\"Your family is worried for you. Acting out like this will only break their hearts.\" \n“You won’t be rewarded once I tell them about my treatment at your hands,” Kim Dokja grinds his teeth. \nMost of the side characters in this series remain unnamed and unimportant (as Han Sooyoung prioritized the sex, obviously) but Kim Dokja could never forget the character in front of him. One of the recurring antagonists of the story, a beautiful clergyman with malicious intent: \nHigh Priest Asmodeus smiles. \nHe crosses one leg over the other, his elbow propped up on the arm rest as he stares unrepentantly at Kim Dokja. He has never met the High Priest before, but all of his senses are screaming to run.\n\"The sheer relief of your return will overshadow everything else,” Asmodeus says. The pure white of his robes are ill-fitted to the heavy, almost suffocating presence sitting before him. \nKim Dokja’s eyes glance outside. A few hours have passed. The setting sun dyed the sky an angry red, and the window overlooks a dense, darkening forest. Asmodeus mistakes his drifting attention as a desire to escape, as he chastens him.\n\"It might have worked the first time, but please don't try escaping this way again.\"  Or do, Asmodeus' smile seems to say. \nA strange, giddy emotion bubbles up inside Kim Dokja. \n“Actually, I’m exactly where I want to be,\" he says.\n“Oh?” Asmodeus’ brow quirks, but he doesn’t seem surprised. A shiver goes up Kim Dokja’s spine at Asmodeus leaning forward.\n“I have something valuable to offer you. More valuable than my blood.” \n“Valuable? I think you’re mistaken, child.” \n“Am I?” Kim Dokja muses. “Why else would the High Priest come himself?” \nAsmodeus doesn't skip a beat as he says, “You are an honored guest.” \n“A Demon King doesn’t care for honor,” Kim Dokja says. The room becomes chillier. Asmodeus’ smile doesn’t fall, but there’s something that flickers behind his gaze. Still, Kim Dokja persists,  “I want the key you stole from the Witch.” \n\"My key.\" Asmodeus blinks, slow realization crossing his face. \"I should have guessed she was hiding nearby. And you're trying to get to her…\" Asmodeus' smile turns mocking. “It won’t work—no one can break your curse.”\n“I'm not  trying to break it.\" It feels like the first truth in weeks coming from his lips. \"You can’t undo the gift of the constellations.” \nAfter all, the marks stretching across Kim Dokja’s body aren’t a curse. \nIf Han Sooyoung’s lore is to be believed: they’re a blessing.\n\n\n\n \n\n …one of this world’s crueler secrets, and greatest gifts.  \n\n The  Blessing of the Stars, a mysterious attribute bequeathed upon unfortunate mortals by the constellations. An existence so rare that only a few living souls would be able to understand the cause of her suffering.  \n\n An ounce of her blood could heal superficial wounds. A pint could bring someone from the very brink of death. If distilled, the restorative properties could be increased tenfold.   \n\n This only applied to humans other than herself. The strength of the blessing came at the heavy cost of her own health. So long as she was breathing, she could help thousands of people. However, should any other species  —  be it devil, angel, or allegedly the constellations themselves  —  come into contact with her blood, unimaginable pain would be felt. \n\n In the wrong hands, she was an unlimited source of poison, a way to fell gods and ruin kingdoms. In the wrong eyes, she was more valuable than any gold mine, waiting to be stripped and laid bare… \n\n\n\n\nAsmodeus’ silence is answer enough.  \nMonths ago, Han Sooyoung had sent him the first chapter of the volume titled,  The Saintess. Kim Dokja’s immediate suggestion was for her to change it, because it was spoiling the surprise. \nThat conversation feels like a lifetime ago, Kim Dokja thinks.\n\"If you give me the key, I'll kill the Witch.\" Yoo Joonghyuk wasn't the only one with unsettled scruples. If the Witch didn't want to be used for plot progression, she shouldn't have made enemies with eighty percent of the characters.  \"You were going to use my blood to kill her anyway.\"\n\"You're quite well informed.\" It sounds like a threat.\n\"Is there anything money can't buy?\" Kim Dokja lies again, \"If she can’t help me like you said, then it doesn’t matter to me if she lives or dies—there’s something else I want, but I can loot it off her corpse if I need to.\"\nThere’s almost a lecherous tone to Asmodeus’ voice as he looks Kim Dokja up and down, “You're  going to kill her?” Kim Dokja can't disagree. It would be laughable for him to kill one of the most powerful beings in this world by himself.\n“Well, I hired a mercenary for the dirty work.\"\nAn explosion is heard outside, rocking the fragile walls.\n Ah, Kim Dokja thinks with a surprising surge of relief and pain blossoming in his throat,  protagonist timing. \nDespite the chaos outside, Asmodeus only laughs, his eyes going manic with excitement. “What if I want to kill the Witch with my own hands? If I want to tear her to pieces myself? It’s an interesting offer—”\n“You don’t have a choice.”\nSuddenly, Kim Dokja coughs. \nHis shoulders rack with the force of it. The sour taste of iron coats his tongue. When Kim Dokja pulls his hand away, Asmodeus’ eyes widen at the black bile spattered on his palm. \nKim Dokja grins with slightly bloodied teeth, “Either you give me the key, or I die here.”\n\"What have you…\" His delight cut short and replaced by outrage, Asmodeus threatens, \"I'll kill your companion.\"\nScreaming from the courtyard. The unforgiving sound of a blade cutting through flesh and bone.\nWiping at the blood at the corner of his mouth, Kim Dokja can’t help but laugh. “You can’t kill Yoo Joonghyuk. You can’t kill the Witch—but you can let me die, and lose everything you’ve worked so hard for.\"\nHe can feel Asmodeus’ indignation. It reminds him of sitting too close to a fire, close enough to let it burn his skin. \"Death is not something that will come so easy.\"\nAsmodeus doesn't know how right he is. In WOS, he was the driving force behind her power being found out and abused for profit. Not if Kim Dokja has anything to say about it. \nThe door swings open, a guard tries to speak, “High Pr—hggk!”\nA blade bursts from his chest as he's interrupted, and Yoo Joonghyuk roars, \"—Kim Dokja!\"\nUnlike the novel, there's no desperate, romantic concern blazing in Yoo Joonghyuk's eyes.\nHe’s  furious. \nThe kind of rage that makes Kim Dokja worry he's jumping from the frying pan into the fire with his knight in shining armor… He's probably mad about Kim Dokja going missing and the only lead being Asmodeus' name scribbled on a note left under Kim Dokja's empty bowl of soup. \nThe poison has him feeling delighted, if not delirious.\n\"You're late, Joonghyuk-ah.\"\nYoo Joonghyuk steps over the body of the guard he’d killed moments ago. His long strides bring him to Kim Dokja's side in an instant, his sword pointed towards Asmodeus. As Asmodeus observes Yoo Joonghyuk with an intrigued expression, shouting comes from down the hall with more approaching guards. \nReturning his attention to Kim Dokja, Asmodeus’ lips press together, eyes shaking with a mix of anger and glee that Kim Dokja nearly shivers at. After a tense silence with guards cautiously entering the room, Asmodeus eventually says, “You must be in a lot of pain.” \n“This is nothing,\" Kim Dokja says, \"but I should probably take the antidote before I die.\"\nThanks to the FL's and Kim Dokja's combined knowledge, scavenged snake venom mixed with the goop from the carnivorous plant was easily turned into a slow-acting poison. \nIt was so easy that Kim Dokja had reservations about downing the black liquid, but this was the best course of action. The agony has gotten progressively more painful over the last few hours, but Kim Dokja thinks being used as a blood farm for the rest of his life would be worse. \nWith bloodied teeth, Kim Dokja smiles refreshingly. \n\"Do we have a deal?\"\nIf someone were to tell him he’d be isekai’d into his friend’s erotica, he’d have assumed they also read an absurd number of fantasy novels. \nIf they’d gone even further and told him about traveling across a kingdom alongside a novel protagonist, fending off all manner of man and beast, making himself a hostage by poisoning himself… He would have given them a strange look and ignored them. \nBut the fear is real. The pain is undeniable. The uncertainty is nearly tangible, as if Kim Dokja could open his mouth and choke on it. \nStill, Kim Dokja will see this story to the end. \nAsmodeus lets them go, but only just.  \nHis gaze does not waver, though his hands tremble where he keeps them at his sides. Kim Dokja leans heavily against Yoo Joonghyuk as they exit, partially out of necessity, and partially to stop Yoo Joonghyuk from killing everyone there anyway. \nWhile Yoo Joonghyuk certainly wouldn’t have died from an all-out battle, Asmodeus wouldn’t have made it easy on him. Past lore has proved the High Priest is not only difficult to kill, but also cruel and intelligent. It’s one of the reasons he’s lasted as an antagonist in the series, and Kim Dokja is sure that they would have regretted it somehow.\nThey’re better off running away as fast as possible.\nThe ball of tension in his chest refuses to unfurl even as they travel further from the hamlet.  The tiny silver key burns a hole in Kim Dokja’s pocket. \n“You could have taken the money,” Kim Dokja says once they’ve gotten far enough away. They take some time by a river to assess if any of Kim Dokja’s injuries from the past few days worsened in Yoo Joonghyuk’s absence. \nWhere is Yoo Joonghyuk’s rage now? In the quiet space between them, the ache increases. \n“I… would have understood,” Kim Dokja continues, quieter. He feels foolish for having even said it—why would Yoo Joonghyuk care about Kim Dokja understanding his decisions? Since coming here, all Kim Dokja seems to have are questions with impossible answers.\nYoo Joonghyuk hesitates, before continuing to tend to him. \nHe shivers at Yoo Joonghyuk’s hands as they brush up his calf, checking diligently. On his knees before him, Yoo Joonghyuk looks up. His eyelashes are thick and curled enchantingly, his words lifting weight Kim Dokja hadn’t realized was suffocating him. \n“We’re far enough now.” Yoo Joonghyuk frowns, glancing away. “Take the antidote.”\nLips twisting, Kim Dokja fiddles with another small vial. He pops the cork out, downing the herbal tonic. \n“There.” He brandishes the empty bottle at Yoo Joonghyuk. “All better!” \nYoo Joonghyuk has an absolute look of disdain on his face, as if he’s about to launch into a tirade about Kim Dokja’s stupidity in  poisoning himself and relying on a rescue he didn’t know would be coming for sure. \nFunnily enough, Kim Dokja thinks that he wouldn’t mind listening to it. Instead of the lecture, Yoo Joonghyuk’s face goes pale.\n“Kim Dokja.” \n Joonghyuk-ah, Kim Dokja starts to reply teasingly, but instead, his stomach lurches. Something warm and wet fills his mouth, dripping down from the corner of his lips. \nWhen Kim Dokja touches his fingertips to his chin, he pulls his hand away to reveal black blood. \nTrembling hands scramble for his coin pouch, smearing his blood across his belongings as he pulls out the last of the bright mana stones. As the mana seeps into his body, the stone crumbles under his touch. \nThe pain doesn’t recede. \n“We’re running out of time,” Kim Dokja coughs through gritted teeth, clutching his chest as another wave crashes over him. \nWordlessly, Yoo Joonghyuk lifts Kim Dokja onto the horse.\n\n\n\n\n■■■\n\n\n\n\nThey ride the last few hours of the journey at a backbreaking pace, which is already a lot to ask of Kim Dokja’s exhausted body. He passes out a few times, each time waking up to Yoo Joonghyuk’s arms around him, as good as any seatbelt. \nThey arrive at the Witch’s house, and to his surprise, it isn’t a shack or damp cave, but rather a  mansion. \nStaring up at the lush garden, tall stained glass windows, pristine stone walls, the place doesn’t look at all decrepit or haunted. More luxurious than whatever hovel he’d originally pictured. Han Sooyoung actually never described the Witch’s appearance or her home in any of the previous novels, just that she was a beautiful, mysterious, and somewhat chaotic character. \nA wrought iron gate and high fence surround the property. Kim Dokja is worried they won’t be able to enter, but Yoo Joonghyuk inserts Asmodeus’ tiny key and opens the gate easily. The front door to the estate is unlocked, possibly a testament to the Witch's confidence in her abilities. She probably didn’t bank on Asmodeus having stolen a copy of her garden key two books ago.\nThe empty foyer welcomes them, Kim Dokja's arm slung over Yoo Joonghyuk's shoulder. \n“Who the fuck is here so early in the morning?” A voice asks. A  familiar  voice, Kim Dokja realizes. \nShe descends down the grand staircase in a dark purple dress, dotted with tiny shining gems that remind him of stars. The fabric spills across the marble floor, shimmering as she steps closer to them. The black flame at her side somehow emanates light, casting a glow on her features. \nAn annoyed frown. Dark hair cut at her shoulders. A mole dotting her cheekbone under fierce, catlike eyes. \n“You,” Kim Dokja says, taking a step forward only to stumble. Yoo Joonghyuk is at his side before his knees hit the ground, holding him upright. “How are  you  the Witch?” \n“That’s rude,” the Witch says. “I’m a  sorceress, not that anyone listens.” \nDespite looking exactly like Han Sooyoung, she doesn’t seem to recognize him. The coincidence is startling, but Kim Dokja takes this as a sign that he’s made the right choice by coming here. If the author isn’t here, then surely, this Witch that looks like her can help him. \n“Now, tell me what you want before I burn you alive.” \n“Witch.” Yoo Joonghyuk growls, his sword brandished in front of him.\n“Knight.\" The Witch crosses her arms and sneers, before smirking confidently, “Do you think you can fight me in my own home and win?\"\nYoo Joonghyuk narrows his eyes, but he smiles and rolls his wrist holding the sword. The Witch’s smirk turns into a scowl. Kim Dokja interrupts before any bloodshed can begin.\n“We’re not here to fight.” \nAs if she’d forgotten Kim Dokja was even here, the Witch’s gaze travels over Yoo Joonghyuk’s arm wrapped protectively around his waist to hold him up, and then at Kim Dokja. She lingers there, staring at him with pursed lips. Something seems to click in her gaze, her brows raising.\n\"Your soul… it doesn’t be—” \n“Have you heard of the Blessing of the Stars?” Kim Dokja blurts, not wanting Yoo Joonghyuk to know the truth. Yoo Joonghyuk’s hand tightens on his waist. “Well, it’s killing me.” \n\n\n \n■■■\n\n\n\n\nKim Dokja took the antidote in time, but his awful body is in no condition to be walking around. Having pushed his luck as far as he can go, the mana stones can’t help him like they used to.  Like pouring cups of water into a bottomless hole, the Witch says. Kim Dokja’s luck is truly coming to an end.\nShe gives them a room.  Too early in the morning to deal with this crap,  she tells them. \nAnd, as per usual, there is only one bed. \nKim Dokja laughs, but it sounds strung out, bitter to his own ears. \nYoo Joonghyuk is a man of few words, but his silence now is a particular brand of speechlessness. As if he doesn’t know what he should say, rather than not wanting to speak. \nHell, Kim Dokja has no idea either. He isn’t sure about anything anymore.\nHe doesn’t know what drives him to do it. Maybe he’s crashing after the adrenaline rush of the final leg of their journey, but for all of his protestations, it is the easiest thing in the world to melt into Yoo Joonghyuk. \nThe man is uncharacteristically tender as he helps Kim Dokja out of his clothes, taking full stock of the injuries across his body. The black, inky curse mark that marrs his upper body is stark across his pale skin, his reddened skin where the harsh day’s ride has bruised and battered him. As Yoo Joonghyuk presses his lips to one of the tendrils at his shoulders, Kim Dokja shivers. \nYoo Joonghyuk strips to only his pants before him, and Kim Dokja’s mouth goes dry. \nEverything about him is perfect. \nIt’s not the muscles, or his scars, but something about Yoo Joonghyuk is exactly what Kim Dokja has always been looking for. That leaves a bitter taste in his mouth, and Yoo Joonghyuk seems to sense this.\n“Stop thinking,” he says, a mix of scorn and fondness that makes Kim Dokja want to run back across the kingdom. He can’t run, though, not when Yoo Joonghyuk’s hands drift up his ribcage. His thumb moves to flick Kim Dokja’s nipple, but Yoo Joonghyuk catches himself. \n“You should rest,” Yoo Joonghyuk says, hand moving to hold his chin, turning Kim Dokja’s face side-to-side. Kim Dokja is sure he looks like a mess, considering the last day he’s had. \nThis is what he wants, though. What he’s wanted since the beginning, even if he didn’t want to admit it. \n“It’s a little late for that,” he laughs, tilting his face into Yoo Joonghyuk’s palm. Shaky hands move to Yoo Joonghyuk’s waist, clumsily undoing the front of his belt. Kim Dokja is a selfish man. \nFor all his protestations, Yoo Joonghyuk is easily persuaded into touching Kim Dokja. Almost as if he didn’t have to be persuaded at all… but that would be ridiculous.\nSettling a naked, fidgety Kim Dokja onto his back amidst the plush blankets, Yoo Joonghyuk’s thick fingers stretch him open. Kim Dokja wraps his arms around his neck, burying his face into Yoo Joonghyuk’s dark hair, his breath shuddering with each finger added, each electric graze against his prostate.\n“Ah, Yoo Joonghyuk,” he begs, but he’s unsure what he begs for. Exhaustion is still deep in his bones, accompanied by a melancholic ache he’s unable to shake off. \nHe chews on his lower lip to stifle his moans, but Yoo Joonghyuk plays him like an instrument, kissing him to swallow the noises he tries to hide. Once he accepts three fingers easily, Yoo Joonghyuk presses the head of his cock to Kim Dokja’s hole and threatens to shatter whatever sanity Kim Dokja has left.\n“Kim Dokja,” Yoo Joonghyuk murmurs, his lips pressed to the shell of Kim Dokja’s ear, and then he’s pushing inside. \nThe pollen had put everything into a hazy bliss, but this is too much, too much, not enough, please, wait —Kim Dokja mumbles under his breath, eyes screwed shut as Yoo Joonghyuk fills him. \nHis nails dig into Yoo Joonghyuk’s back, scrambling for something, anything to ground him. \nEventually, there is the brush of Yoo Joonghyuk’s dark curls against his ass, so full of Yoo Joonghyuk’s huge cock that Kim Dokja can feel it in his throat. Pathetic moans tumble from his lips, legs wrapping around Yoo Joonghyuk; to prevent him from grinding deeper, to prevent him from pulling out, Kim Dokja doesn’t know.  \nAnd then, as if to remind Kim Dokja that trying to not fall for Yoo Joonghyuk is futile, he begins to move. \nYoo Joonghyuk takes him apart, takes him to pieces. With his mouth, with his hands, with each brush of skin against skin. A pleasure Kim Dokja has never experienced, nor does he think he ever will again. \nYoo Joonghyuk fucks him with a gentleness that was absent from their romp on the riverbank. \nHe thrusts slowly, allowing Kim Dokja to get used to his imposing size, but once he does, Yoo Joonghyuk doesn’t let him go. His hands hold Kim Dokja’s thighs apart, he doesn’t allow him to hide or run. Sharp teeth and a wicked mouth leave bites and bruises all over his pale skin, as if trying to cover up every cursed tendril with a mark of his own. \nAs if Yoo Joonghyuk can free Kim Dokja from his curse with his cock and his touch alone.\nHe’s read nearly countless scenes with this man, but nothing compares to being in his arms. When Kim Dokja cums, not for the last time that night, he has the single, pathetic wish that this could belong to him. \nSince it doesn’t, he’ll take what he can get.\n\n\n\n\n■■■\n\n\n\n\n“Kim Dokja.” \nScarred knuckles brush against a bite mark Yoo Joonghyuk left on Kim Dokja’s collarbone. He’s like a big, apologetic dog, Kim Dokja thinks fondly as they’re pressed together, the sweat cooling on their skin. \n“You say my name like it hurts you,” Kim Dokja chuckles. “I’m thirsty, will you get my waterskin?” \nYoo Joonghyuk is obedient after sex. It’s endearing, but Kim Dokja doesn’t know what to do with it. When Yoo Joonghyuk returns to the bed with the waterskin, Kim Dokja opens it. Instead of drinking, he rubs his thumb along the rim, lost in thought. \n“You…” He starts, but honestly, he has no idea what he wants to say. \nThat he’s sorry? That he’s had a great time? \nThe end of everything is so near. Would Kim Dokja have felt this way if they hadn’t slept together? Would he have been able to resist these emotions if he’d just...  held out? He wishes Yoo Joonghyuk wasn’t as charming as the books described him, despite his rough, somewhat murderous edges. \n“We need to put a muzzle on you,” Kim Dokja says, instead of all the secrets tucked under his tongue. He shoves the open waterskin into Yoo Joonghyuk’s hands. Yoo Joonghyuk’s smiling as he scoffs, automatically lifting the offered drink to his mouth. \n“I’d like to see you try.” \nAs he drinks, Kim Dokja watches the bob of his adam's apple, the sharp curve of his jaw with his head tossed back. \n“Bastard,” Kim Dokja breathes, no heat left in his words. \nHe waits until Yoo Joonghyuk’s breathing slows, and his face goes slack with sleep. \nKim Dokja pokes his cheek experimentally, whispering under his breath, “Hey.” Yoo Joonghyuk doesn’t stir, his lips parted handsomely, even in deep sleep. “You’re too damn good-looking.” \nHe slaps Yoo Joonghyuk on the cheek; once is a test, twice is payback, thrice is an indulgence. Thanks to this universe's equivalent of horse tranquilizers made from two or three herbs that Kim Dokja stored in his bag for a situation like this, Yoo Joonghyuk is dead to the world. \nHe’ll sleep for at least six hours, which is all Kim Dokja needs. He crawls out of his arms. An ugly sensation twists his stomach into knots, and he looks away from Yoo Joonghyuk resting peacefully in the bed. \nYes, Kim Dokja is selfish. \n\n\n\n\n■■■\n\n\n\n\nWhen Kim Dokja joins her in her study, the Witch seems lost in thought as she stares into the fire. \n“Sooyoung?”\n“Who?” she frowns, her gaze shifting to him. \n“… Someone you resemble,” he settles into the chair across from her. \n“Ah, so someone beautiful and all-powerful.”\nEven over the course of three volumes, Kim Dokja hadn’t realized that the Witch was a thinly veiled self-insert. Considering her (both the author and the character’s) unpredictable and arrogant nature, Kim Dokja is surprised he never made the connection before. \n“Are you going to help me or not?”\n“Tch, you should feel honored I even let you in my home.” \nDespite her elegant outfit, the way she crosses her arms reminds him exactly of Han Sooyoung the last time Kim Dokja did something to irritate her. \nThus, the instinct to mess with her is equally strong.\n“You didn’t, we broke in.”\n“Yes, but I could have burned you both to ashes if I so chose,” she sniffs.\n“… Yoo Joonghyuk would have survived,” Kim Dokja shoots back. He should really stop trying to start bickering with the only character that seems to have an idea of how to get him out of this mess. \n“Whatever.” She shrugs, waving her hand, but not disagreeing with him. “So you’re here about your soul—”\n“You can tell?” Kim Dokja interrupts, resisting the urge to lean forward, to dig deeper into how she knows.\nThe Witch looks affronted. “How could I not? Everything about you is… wrong,” Grimacing, she gestures at his body. “You’re a branch about to be pruned.”\n“What does that mean?”\n“What, do you think I have time to write you a novel? Explain the mysteries of the universe?  You  do not belong, and your very existence is being suffocated by the laws of this world, idiot.” \n“Suffocated.” \n“Suffocated,” she says, nodding. “You’ve got to fight against the pull of this world or be lost to it.”\nKim Dokja wants to be obstinate and ask what the hell she means, but he unfortunately understands. “I’ve tried.” \n“Not very hard,” the Witch snorts.\nWith a snap of her fingers, a tiny spark of magic shoots out at a bite mark on his collarbone, peeking out from under Kim Dokja’s shirt. It tickles like static electricity, and Kim Dokja’s hand flies to cover the spot. Lips pressing together, he tries to not flush too obviously. \nFighting against the pull of the world sounds a lot like trying to change the plot. \nKim Dokja already tried his hardest not to fall into the role of the FL, but the tender ache in his backside is clear evidence of his failure. Does it mean he just has to stop touching Yoo Joonghyuk, then? Even  that  would be following the plot. \nYoo Joonghyuk has never remained with a previous FL past their storyline; Kim Dokja’s role was to warm his bed for  this  journey, not for the next. Expected, but still unpleasant in a way that Kim Dokja doesn’t fully understand, nor does he want to.\nOnce Kim Dokja makes it to the end of the written story, he technically doesn’t need Yoo Joonghyuk to keep him safe from ludicrous random events. Lee Seolhwa and Anna Croft are both alive and well, even if neither is getting back together with Yoo Joonghyuk. \nHe knows the fate of this FL—her powers are revealed to the world, and though she doesn’t die, she ends up being trapped as a figurehead for a religious sect. He’s worked hard to keep it from happening, but there is still no way to know if his preventative measures were successful. Even if Kim Dokja has stopped it now, it doesn’t mean he’s safe forever, either.\nAn end he does not know comes ever closer. \n“If you’re sure about leaving, you can come with me to the Southern Isles,” the Witch says. \nKim Dokja mulls over the thought. “And if I do, you’ll help me back to my world?” \n“If it’s possible, I can figure it out. If it’s impossible, well, at least you’ll be useful research material,” the Witch answers honestly. As if remembering something distasteful, she wrinkles her nose. “The knight gets left behind, though. He and I don’t exactly get along.” \n“I know your reputation. You don’t get along with most people.”  \n“Oi!” He narrowly dodges the scroll thrown at him. \nThis is what he came for.\nBy morning, Yoo Joonghyuk will awaken to an empty, abandoned home and the rest of his fee paid, plus a little bit more. The Witch never stays in one place for too long, and now that Kim Dokja has revealed her location, it only makes sense that she’ll move on, taking him with her as per his request. \nHe thinks about Yoo Joonghyuk asleep in the bed, what he might feel when waking up… And promptly forces himself to stop.\nIs he a fool? \nYoo Joonghyuk is a fictional character. What the hell is he thinking? Just because he got fucked within an inch of his life multiple times, he’s considering leaving behind his entire life for a world that he doesn’t know will exist past the written ending? Just because this ‘Yoo Joonghyuk’ character makes his heart flutter a bit? \n\"I'm ready now.\"\n\"Are you really not going to say anything to that bastard before we go?\" The Witch asks, and Kim Dokja doesn't know what expression is on his face for her to ask him this. \n“Why would I—” \n“— Sorceress-nim , Sorceress-nim!” A fluffy white creature bursts through the door, screeching as it flies around the room, “We’re under attack!!” \nRising from her seat, the Witch clicks her tongue. \n“Stay here,” she points at him, before following the creature out of the room. \nThe door shuts behind her with a click, and Kim Dokja is left alone in her spacious study. If he looks out the window, he can see the grounds teeming with activity. It’s obvious to Kim Dokja who’s organizing the attack. It would probably be safest for him to remain here, in one of the most protected rooms of the Witch’s mansion—but the thought of Yoo Joonghyuk passed out in the bed they shared won’t leave his mind. \nShe  did tell him to stay here… He presses his lips together. As much as she resembles her creator, the Witch is not Han Sooyoung.\nHan Sooyoung knows Kim Dokja isn't prone to behaving himself.\n\n\n\n\n■■■\n\n\n\n\nKim Dokja runs back to their room, only to find out his fears have become reality: \nAsmodeus is already there. \nYoo Joonghyuk’s handsome face is covered in bruises, his left eye swelling at the brow and blood dripping from a wound covered by his hair. \nBefore Kim Dokja knows it, he’s standing in front of Yoo Joonghyuk, holding a bleeding palm out in front of him and a dagger in the other hand like a threat. Asmodeus glances down at the blood, but isn’t fazed by it. \nBlessed blood or not, Kim Dokja hardly stands a chance against him in a fight. \n“How the hell are you awake...?” Kim Dokja’s eyes dart between Asmodeus and Yoo Joonghyuk, becoming more frantic as he says, ”Nevermind that,  get out of here, idiot.” \nAsmodeus steps forward. Kim Dokja brandishes his cut palm towards him, “We had a deal, Asmodeus.”\nAsmodeus pauses, before a slow smile curls his lips. He leans forward, reaching towards Kim Dokja.\n“When I saw you, I wanted to ask: what is it like in the world that you’re from?” \nPale hands grab him by the neck, lifting him so that he’s face to face with Asmodeus’ sneer. Kim Dokja kicks his legs, but he can’t break free of Asmodeus’ stubborn hold. Smoke rises from where Kim Dokja's blood touches Asmodeus, but it isn't enough to stop him. \n“But then I realized, like your offer to kill the Witch— I’d rather see it for myself.”\nAs if Kim Dokja is no more than a bug, Asmodeus unceremoniously swings Kim Dokja into an elaborate wooden dresser next to them. Kim Dokja screws his eyes shut at the spike of debilitating pain from his ribs cracking. \nStumbling forward, Yoo Joonghyuk thrusts his sword towards Asmodeus, but Asmodeus easily side steps and grabs Yoo Joonghyuk by the wrist.\n“Hm…” Kim Dokja hates how the demon king sounds genuinely concerned. “I knew you seemed a bit… different, Sir Joonghyuk.” \nWith a swift snap, Asmodeus breaks Yoo Joonghyuk’s wrist. The sword falls out of Yoo Joonghyuk’s hand and clatters to the floor.\n No, Kim Dokja thinks, still wheezing from the wind being knocked out of him. \nWith wild eyes, Asmodeus punches Yoo Joonghyuk’s stomach and sends him flying back into the wall. The wall shakes under the force of impact, and Asmodeus walks forward into the dust, dirt crunching under his pristine white boots.\nFrom the ground, he grabs Yoo Joonghyuk by the hair and yanks him up onto his knees. \n“Did Kim Dokja do this to you? Is that why he came running to save you?” \nIn comparison to Yoo Joonghyuk, Asmodeus’ motions are hard to follow with the human eye. Asmodeus beats Yoo Joonghyuk up like a ragdoll, fist after fist. He picks him up only to slam him back down, laughing wildly, “How  tragic.” \nYoo Joonghyuk spits at him.\n“I’ll kill you,” Yoo Joonghyuk says, fury in his eyes and snarling despite getting beat up within an inch of his life. \n“I don’t think so,” Asmodeus says, taking the sword from Yoo Joonghyuk’s clumsy hands. “I really,  really  don’t think so.”\nKim Dokja lets out a wordless shout as Asmodeus buries the sword into Yoo Joonghyuk’s stomach. It is as if Kim Dokja can hear the blade cutting through flesh, ripping through Yoo Joonghyuk to protrude out his back. \nYoo Joonghyuk chokes, his eyes going wide.\n\"No!\" Kim Dokja gasps, lurching forward onto his hands and knees. One of his shaking arms give out, bloodied palm slipping on the hard floor as he can only watch in horror.\n\"You said I couldn't kill him. How do you feel about being wrong?\" Asmodeus grabs Yoo Joonghyuk by the jaw, jerking him around. \n\"Die like a dog, Yoo Joonghyuk.\" \nThe wall crumbles on top of Yoo Joonghyuk with the force of Asmodeus' throw. The Witch, who went away to check the status of her defenses, blows into the room with a furious screech.\n“My fucking  house! You wanna die that badly, huh?!” \nBefore Asmodeus can properly finish Yoo Joonghyuk off, he dodges a dark blast of fire. He seems more monster than man as he turns on the Witch. With Asmodeus distracted, Kim Dokja crawls to Yoo Joonghyuk’s side. \nHis vision blurs, his chest hurting with how hard his heart is racing. \nKim Dokja is so focused on his task, he ignores how he hurts his hands by digging through rubble. Yoo Joonghyuk’s eyes are closed, but he’s not unconscious. He groans, his brows furrowed with pain. Kim Dokja swallows, his hands pressing into the open wound in Yoo Joonghyuk’s stomach as their blood intermingles. \nThis wasn’t supposed to turn out this way. Kim Dokja doesn’t know how his plans became so skewed. \n(But he does.  He did this. Kim Dokja changed the plot like he’d wanted to all along.)\nYoo Joonghyuk won’t die, will he? He’s faced worse fights, but he was never drugged by the Saintess in the novel. Asmodeus has never gotten a direct hit like this. \nThis fight was never written in the first place, so how could Kim Dokja truly know of Yoo Joonghyuk’s safety? What the fuck happens to the novel if the protagonist dies? Is that enough to break Kim Dokja out of the cycle of the novel and escape back to his world, or does the world disappear? Does it continue? \nIf Kim Dokja can’t escape, would this world be worth existing in without Yoo Joonghyuk? \nHis mind and heart race with the pressure of trying to find a solution. He tries to remember everything he’s read from the novel, trying to find the spare detail lost between the lines, the solution hidden in the text. Even if he caused it, even if it’s his fault, he couldn’t have planned for something he didn’t know would happen. \nThe Witch isn’t a healer. Kim Dokja doesn’t have any poultices to give him. There isn’t a trick hidden somewhere up his sleeve. \nThe only thing he has is… his blood. \nThe problem is that Kim Dokja doesn’t know how much blood he would have to give Yoo Joonghyuk for an injury of this degree. WOS never went into detail about the efficacy, only that the FL fed Yoo Joonghyuk blood from a cut on her palm at the beginning and healed some of his cuts. \nHe thinks. He  thinks.\nIf he gives Yoo Joonghyuk too little blood, Yoo Joonghyuk will die. If he gives Yoo Joonghyuk too much blood, then Kim Dokja isn’t sure his body could handle the strain. He could very well die trying to save him. \nKim Dokja shouldn’t be considering this. Kim Dokja doesn’t  want Yoo Joonghyuk to die, but Yoo Joonghyuk is fictional, this isn’t real—\n—Yoo Joonghyuk coughs. Blood drips from the corner of his mouth, his hand sluggishly raising to touch Kim Dokja’s cheek. \n“Dokja,” Yoo Joonghyuk grits out. “Run.”\nKim Dokja freezes. Clarity hits, a strange calm washes over him, and Kim Dokja realizes:  oh .\nThere is no world, fictional or otherwise, that Kim Dokja could ever let Yoo Joonghyuk die.\nIf the plot expects him to live a healthy, long life as a Saintess afterwards… then he should just not live. Kim Dokja brings Yoo Joonghyuk’s sword to his neck. Yoo Joonghyuk’s eyes go wide with horror, his body too broken to respond in time. With the last of his strength, Kim Dokja brings Yoo Joonghyuk’s parted mouth to the flowing wound. \n“No—” Yoo Joonghyuk struggles, but Kim Dokja’s blood is too addictive to stop once he’s started.\n“Shut up and let me save you,” Kim Dokja laughs. “Stubborn bastard.” \nFor the first time since arriving, Kim Dokja feels no pain. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nKim Dokja wakes up with empty arms, his hands pressed to his neck, trying to stop the flow of a wound that doesn’t exist. His pale skin is unmarred, unmarked, only clad in the thin, sweat-drenched t-shirt he’d fallen asleep in. A grogginess remains in his bones, but according to his phone, he’s been asleep for nearly fourteen hours. \nIn those last moments, color had returned to Yoo Joonghyuk’s face. \nThe protagonist’s stricken expression burned itself into Kim Dokja’s memory, leaving Kim Dokja with a troublesome question and no answer. \nBeyond his cheap curtains, the sun rises over the horizon and Seoul shuffles awake. Car engines rumbling across busy streets, trains rattling along its tracks nearby, a dog barks on their morning walk—\n\n\n\n\n\n\nLife returns to normal. \nSo normal, in fact, that Kim Dokja doesn't know what to do with himself. \nHis finger hovers over the  Next Chapter  button, but like a coward, Kim Dokja never presses down. It makes him a little nauseous to think about reading the next arcs of the story he’d lived. Instead, he closes the tab, locks his phone, and goes on with his day. \nHe doesn't tell Han Sooyoung about his adventure, regardless of how real it felt. He doesn't know where to begin, how to get her to believe him, how to feel about...\nWind flowing through his hair as he travels horseback across a kingdom. Someone’s hot touch on his body, their desperate lips on his. A blade pressed to his neck, the cold kiss against skin. \nHe's torn between wanting to shake off the weird dream that lasted for far longer than feels correct, and desperate to remember it as clearly as he possibly can. More than one person notices he's been in a daze, not quite the same even when he's with his friends (all three of them). \nUntil one day, he and Jung Heewon squeeze out of a full train compartment into the station, and he accidentally bumps into a broad, firm chest. Hands grab his shoulders to steady him. They're long, thick fingers with neatly trimmed nails, riddled with scars.\n\"Excuse me—\" Kim Dokja looks up, only to balk. \nStill in full mercenary regalia, Yoo Joonghyuk is looking down at him. It can't possibly be Yoo Joonghyuk, who is a  fictional character, and yet here he stands in front of Kim Dokja in all his handsome and terrifying glory. \n\"You.\" Yoo Joonghyuk says. \nHelp, even his  voice is the same. \nKim Dokja isn't sure he's closed his mouth since this interaction started. From the side, Jung Heewon whistles, her eyes darting from where Yoo Joonghyuk's hands still grab onto Kim Dokja's shoulders to the very, very real sword at his hip.\n\"Look at that face. Are you a gangster or a cosplayer?\"\nAs if she’s irrelevant, he continues to stare at Kim Dokja and ignores her question. A bad move on Yoo Joonghyuk's part, truly. Jung Heewon has always been a little overprotective of him, and she bristles at being ignored.\n\"Hey,\" she says. “Do you know this guy?” \n\"We have unfinished business,\" Yoo Joonghyuk answers instead, looking like he isn't sure if he wants to kiss Kim Dokja or hit him. Kim Dokja's heart threatens to beat out of his chest, a mix between hope and horror churning inside him. \nEither of those would be fine with him, Kim Dokja realizes.\n\"What  business  do you have with my friend here?\" Jung Heewon crosses her arms. \nKim Dokja swallows, eyes bewildered, but there's a small smile playing on his lips. \n\"I owe him money.\"\n "
}