{
    "id": "37203193",
    "url": "https://archiveofourown.org/works/37203193?view_full_work=true",
    "author": [
        "adelfie"
    ],
    "title": "wrong number",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "Batman - All Media Types"
    ],
    "relationships": [
        "Tim Drake & Bruce Wayne",
        "Tim Drake & Alfred Pennyworth",
        "Ace the Bat-Hound & Tim Drake"
    ],
    "characters": [
        "Tim Drake",
        "Alfred Pennyworth",
        "Bruce Wayne",
        "Dick Grayson",
        "Jason Todd"
    ],
    "additional_tags": [
        "Alternate Universe - Canon Divergence",
        "Tim Drake-centric",
        "Fluff",
        "Angst",
        "Hurt/Comfort",
        "Emotional Hurt/Comfort",
        "Batfamily (DCU)",
        "Batfamily (DCU) Feels",
        "Bruce Wayne is a Good Parent",
        "Tim Drake Needs a Hug",
        "Tim Drake Gets a Hug",
        "Sick Tim Drake",
        "Bad Parents Jack and Janet Drake",
        "Child Neglect",
        "Protective Bruce Wayne",
        "Touch-Starved",
        "Tooth-Rotting Fluff",
        "Baby Tim Drake",
        "Cuddling & Snuggling",
        "Sleepy Cuddles",
        "Kid Tim Drake",
        "Sickfic",
        "Tim Drake Joins the Batfamily Early"
    ],
    "language": "English",
    "series": "",
    "published": "2022-02-18",
    "completed": null,
    "words": "6,423",
    "chapters": "1/1",
    "comments": "417",
    "kudos": "16,077",
    "bookmarks": "2,879",
    "hits": "95,223",
    "summary": "<p>There’s a few rings, then the phone picks up.</p>\n<p>“Wayne Residence.”</p>\n<p><i>That’s funny,</i> Tim thinks, <i>Mrs. Mac doesn’t sound like herself.</i></p>\n<p>--<br>On a hot July evening while home alone, eight-year-old Tim gets a fever. He means to ask Mrs. Mac for help — but ends up accidentally calling Alfred Pennyworth. Somehow, even in sickness, he wins all the hearts of the Wayne family in one fell swoop.</p>",
    "notes": "<p>this fandom has become my weakness. good papa bruce and good grandpa alfred looking out for baby bats? batbros looking out for each other? the angst and the fluff? yep, that's my heart. there it goes. 💖🦇</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>💖 find me here!<br><a href=\"https://adelfie.tumblr.com/\" rel=\"nofollow\">tumblr</a><br><a href=\"https://www.instagram.com/adelfie.draws/\" rel=\"nofollow\">insta</a><br><a href=\"https://twitter.com/adelfiecakes\" rel=\"nofollow\">twitter</a></p>\n<p>💖<br>check out these <a href=\"https://www.tumblr.com/blog/view/adelfie/694839290284408832?source=share\" rel=\"nofollow\"><b>fic covers </b></a> made by Krow ( <a href=\"https://archiveofourown.org/users/TheyReapWhatWeSow\" rel=\"nofollow\"><b>ao3</b></a> | <a href=\"https://they-reap-what-we-sow.tumblr.com/\" rel=\"nofollow\"><b>tumblr</b></a> )</p>",
    "text": "On the morning of his parents’ departure to their dig site in Greenland, the Drake Manor bustling with an unexpected show of activity, Tim wakes up with a chill in his bones that even his oversized sweater and thick wool socks can’t melt away.\nNot good, Tim acknowledges drowsily, probably far too solemn for an eight-year-old. Immune system, foiled again.\nHeavy footsteps move up and down the main flight of stairs, and along with them, unfamiliar voices float through his bedroom door. Over the commotion, his mother is shouting orders at her personal assistants, as usual.\n“Careful with those bags! That is genuine leopard fur you are manhandling, Francesca! Don’t fold it like that! It can’t be folded like that!”\nIt’s not supposed to be funny, but Tim almost giggles. All he can manage is a weak cough, which causes a sharp pain in the back of his throat. From somewhere else in the house, he can hear his father slamming doors and spitting curses at some poor employee, clearly on the phone.\n“— not acceptable, do you know who I am? I’m Jack Drake, the founder and head of Drake Archaeological Consulting, one of the richest in Bristol Township — I can end your career, do you hear me — no, I want my seats closer to the window. Really? Well then, you can expect a lawsuit—”\nEyes still closed and face half-buried in his pillow, Tim thinks he faintly hears the rumble of the moving van outside. He needs to get up soon, or his mother will —\nHis bedroom door slams open.\n“Timothy, you’re still sleeping? For goodness’ sake,” his mother chirps. “Don’t you want to see us off?”\nTim wants to say that he does, but what actually comes out is a croaky whine. He can’t help it. He’s so cold. He curls his arms around himself under the rumpled gray comforter, but it doesn’t take away the shivers. He needs more layers.\nHe hears his mother sigh. “I’m disappointed, Tim. You’re old enough to get yourself out of a bed on time.”\nTim takes inventory of his body. His head? Heavy. His stomach? Sore. His limbs? Freezing. The last thing he wants is to get up.\n“Timothy.”\n“Mom, I can’t,” Tim mumbles into his pillow. “All systems are down.”\nThat at least makes his mother laugh, but then suddenly the comforter is being pulled off of his body, the loss of what little heat he had stabbing into him like icicles. Tim snaps his body into a ball instinctively.\n“Come on. Up, up,” his mother says loudly, her voice piercing at his head as she moves towards the window to open it, letting in a summer breeze that gives Tim goosebumps. Sweet birds sing in the distance. “You’ve already missed breakfast, but you won’t be missing lunch. No child of mine lazes around, even if it is summer vacation.”\nFearing that his mother will shout some more, Tim forces his arms to cooperate and pushes himself up woozily. Without missing a beat, his mother takes a tight grip of his upper arm, the long red nails of her thumb and middle finger meeting together, and pulls him out of bed. Tim stumbles to his feet.\n“Good,” his mother says, sounding satisfied. She squeezes him around his shoulders in a hug. “You’re really a handful, Tim.”\nTim wants to stay in his mother’s arms — or rather, arm, singular — but in the next second he’s being pushed out of his room and into the hallway bathroom.\n“I feel kinda weird, though.”\nHis mother’s eyebrows furrow as she takes his face in for a moment, her eyes searching, but then her phone chimes off from her pocket, breaking her concentration early. Distractedly, she says, “You do look a bit washed out. You can thank your father for those ridiculous genes. So little melanin.”\nTim tugs his sweater sleeves over his hands for more warmth. “I think I’m sick.”\nUnconcerned, his mother shoots back a text message on her phone. “Join us for lunch when you’ve freshened up. You’ll walk it off after you get some food in you.”\n \n~~~\n \nTim throws up after getting some food in him.\nLuckily, he’s able to hold out until they all finish lunch and after his parents and the personal assistants are outside, loading the final bags of luggage and themselves into their respective vehicles. Tim raises his small hand to wave goodbye to his parents, as their trips are usually months long. And then, the moment the moving van and his parents’ car disappears, Tim closes the door of the empty Drake Manor, runs to the bathroom, and barely makes it to the toilet. His parents wouldn’t have been very happy with him if he’d messed up the welcome mat.\nHaving his body reject something so violently freaks Tim out a little. Despite his analytic mind, as he heaves up his lunch and probably the day before’s dinner, he can’t hold his tears back. A few minutes later, when there’s nothing left in him, he flushes.\nTim leans on the sink cabinet, sniffling. He’s glad his father isn’t here. Jack Drake would tell him to stop being such a baby. He’s going to be in third grade next year. He needs to be stronger.\nSlowly, minding his sore stomach, Tim turns around and washes his face. By the time he’s done rinsing his mouth with mouthwash, his head is fully throbbing on top of being as heavy as a block of solid ice.\nHe barely manages to walk up the stairs to his room collapsing. He’s definitely sick — if there was any doubt before, it’s long gone. He falls back into his bed in a heap, dissolving under the comforter.\nTim doesn’t feel like a lot of time passes, but the next time he opens his eyes the summer sun has dipped in the sky, bathing his bedroom in bright orange light. Crickets chirp from the trees and bushes.\nTim’s teeth chatter. The window is still open, and even though it’s hotter outside than it is inside, the draft feels like it’s in the middle of December instead of July. Tim stuffs his hands under his arms and rubs his socked feet together, but nothing wants to warm up. He has half a mind to go to the thermostat in the basement and turn on the heater, but his entire body protests preemptively at the idea of getting up. \nMinutes pass.\nEverything hurts.\nHe’s so, so cold.\nWhat he needs is more blankets. Why hadn’t he gone and grabbed more blankets from the storage closet when he was coming back to his room from lunch? Tim groans, lamenting the missed opportunity. If he moves now, he’s only going to exacerbate his stomachache and his headache. Not to mention his fingers and toes are too icy to even move properly. Calling his parents would be pointless — they’d be on a plane by now — and there’s no housekeeping staff coming in today.\nWait.\n\nMrs. Mac.\n\nAt the thought of the housekeeper who can whip him up the best hot chocolate in the world whenever, Tim feels the tiniest bit better.\nToday isn’t one of her two days that she comes into Drake Manor to keep it in shape, but Tim has no doubt that she’ll be more than willing to help if he asks. The kind, winter-haired woman is probably the only adult he knows who likes him for him. He doesn’t have to be a perfect son to win her smiles and hugs. From his earliest memories, Mrs. Mac’s always given them to him freely. Well, she’s an employee, so technically not freely, but still. If Tim asks really nicely, she’ll drive over to bundle him up in more blankets, won’t she? And maybe, if he’s extra polite, she’ll… stay with him. Being lonely is already bad, but being lonely and sick? No fun at all.\nTim moves to grab his phone. His body doesn’t like that.\nEverything goes fuzzy for a few seconds as Tim cranes his neck to aim his cold fingers around his cell phone — the one his father got for him as an apology after forgetting to pick him up from school during a winter storm a few months ago.\nWhen Tim brings it to his face, his eyes water at the brightness, and his fingers fumble at the screen, clumsily scrolling down the list of contacts he has in his phone. It’s a lengthy list anyone else might have been proud of, but there’s a level of shame to it — thanks to his odd habit for sleuthing and harvesting information, Tim’s got the personal numbers of people who don’t even know he exists.\nLike Bruce Wayne and his family.\nLast year, while Tim was eating ice cream and watching reporter footage of Batman and Robin fighting some goons, he suddenly realized that the Dick Grayson was Robin. And consequently, he figured out that Bruce Wayne was Batman. And that Barbara Gordon was Batgirl. And their dog, Ace, was Bat-Hound. And that Alfred Pennyworth was either the most oblivious butler in the world, or he was in on the secret as well.\nAnd then Tim ended up finding a lot of things he probably shouldn’t have, like adoption papers, school grades, medical histories…\nAnyway, he’s not supposed to have their numbers.\nBut he does.\nHe’s probably bad for that.\nThe thing is, he’s never going to actually need them. But having them in his phone makes Tim feel like he has really cool friends, and that makes him feel less lonely when he’s left home alone.\nTim tries to find Mrs. Mac’s name. He blinks wearily, the numbers blurring — thanks to his own exhaustion or just his shaking hands, he’s not sure — and presses the green call button.\nHe puts his cell phone on speaker so he doesn’t have to hold it with his cramping fingers, and waits. He closes his eyes, feeling sleepier and sleepier.\nThere’s a few rings, then the phone picks up.\n“Wayne Residence.”\nThat’s funny, Tim thinks, Mrs. Mac doesn’t sound like herself.\nAlso, did she just say Wayne Residence? That’s… weird. Wayne. The name rhymes with rain. And pain. And insane. Wait, he knows a Wayne, doesn’t he? Tim tries to open his eyes to refocus, but his eyelids are too heavy. Who is he talking to, again? He called Mrs. Mac, right?\n“Hello?” Mrs. Mac’s voice sounds too deep. And also too British.\n“Hi,” Tim says in a small voice. “Can you help me?”\nThere’s a pause on the other end. Then the accented voice speaks in the same poised manner as before.\n“May I ask who is speaking?”\n“Um. Me. Tim.”\n“Tim,” the voice repeats, confusion well-masked by decorum. “Apologies, but have we met before?”\nDoes Mrs. Mac not remember him? Tim sneezes, which hurts his already hurting head, and then he sniffs pitifully.\n“Timothy Drake,” he says, but his aching throat won’t allow him to be much louder than a whisper. “I’m at the house. It’s, um, if you don’t mind… I need another blanket. Maybe like three, actually. I thought… I thought in case you weren’t busy, you could maybe help me, please?”\nGosh, what if Mrs. Mac says no? Tim didn’t think of that before calling. Mrs. Mac is an employee, after all. He’s not her family and she doesn’t owe him anything.\nI shouldn’t have called her on her day off, Tim thinks in horror. It’s probably unprofessional.\n“I know you don’t have to — but my parents — well, it’s just that they’re gone right now, and, um. I’m really cold, and I can’t — everything hurts really bad and I can’t do it on my own — please, um, if you can help me — ”\nTim tastes saltwater on his lips and steadies his breathing. He wants to wipe his face but can’t feel where his hand is. He can’t even feel himself holding the phone.\n“I see,” says the voice, but it’s taken on a tick of alarm. There’s a murmur from somewhere else, and there’s a muffle, like they’re talking to someone else, and then the voice returns, addressing him. “Timothy, may I ask who is with you?”\nTim hesitates. Mrs. Mac would know that no one is. Who is he talking to? Should he ask? He can barely think, he’s just so cold.\nTim’s voice finally gives out. “Please… I just need more blankets.”\nAnything after that is lost to Tim’s ears, as he blisslessly slips into unconsciousness, wracked with terrible shivers and fatigue.\n \n~~~\n \nAlfred is not inexperienced when it comes to tending to sick children, and he likes to think that he can recognize the early signs of illness. The child on the other end of the phone, however, sounds delirious with fever. There is hardly anything early about those signs. However, it is no matter of his to be personally concerned about. Timothy Drake is not under his guardianship, care, or service.\nAnd yet Alfred’s heart seizes in sympathy for the child as he listens to him desperately request for more blankets through the phone. He can feel the young boy’s pain from the rasp in his voice.\nFrom the begging.\nAlfred takes a step backwards, as if putting distance between him and the pleading child, which is silly, as the landline is still to his ear. Bruce, at his desk on the other side of the study, raises a level gaze from his laptop. Alfred slightly parts the phone from his ear for a moment.\n“It seems to be Timothy Drake, sir. A wrong number, I presume.”\nBruce gives a slow nod, seeming to absorb that rather quickly — after all, why would the very young Drake heir be calling them? — before returning to his work.\nThe Drakes announced they would be taking a trip abroad in a recent gala, so the news about the boy’s parents not being home isn’t surprising. It’s not in Alfred’s habit to think about the health of children other than his own — that is, Bruce, Dick, and Jason’s — but in general, if socialite parents leave the country without their sons or daughters, typically said sons or daughters are left under some form of guardianship.\nAnd yet, if Timothy is suffering from such a high fever that he’s asking a practical stranger for help, then… well. Alfred bristles at the inattention of the nanny the Drakes must have hired. A caretaker would be at the boy’s side. The boy wouldn’t feel the need to call for help like this.\n“Timothy, may I ask who is with you?”\nTimothy’s voice cracks, barely audible, beseeching, instead of answering the question. Then silence. The phone hasn’t been hung up. Alfred can only hear the sound of faint shuddering.\nSlowly, Alfred puts the phone down. He’s not one to take on excess worry for those outside his family — the Wayne family generates enough for him with their nighttime escapades — but the poor child is suffering.\nHe stares at the wall in front of him, his worry slowly taking on the form of something bigger.\n“Master Bruce,” Alfred says, his tone prim and proper as always. Bruce’s head lifts from his work. “I must slip away for a moment. I am thinking of doing something perhaps quite trivial.”\nBruce’s stare sharpens, his attention is no longer divided. “What is it?”\n“I am worried about Timothy Drake. He seems to be unwell. Feverish,” Alfred states calmly, despite his slightly elevated heart rate. “His parents are away, and I’d like to meet the nanny. Or babysitter. It wouldn’t be very long.”\n“If you’re worried, Alfred, then it’s not trivial, regardless of the results,” Bruce says, his eyes sharp. “If you need me to run a background check, let me know their name.”\nAlfred smiles. “Very good, sir. This time it shall be me on a mission and you on the Batcomputer. I do enjoy it when the tables are turned.”\n \n~~~\n \nNo one answers the front door, which is the first odd thing Alfred notices about the Drake Manor. When he knocks again, it’s purely for show. Then, with ease and grace, he picks the lock with a sharp pin he hid under his wrist sleeve and with a pop, the door swings open, the other set of locks untouched.\nCareless security, Alfred notes. Whoever is running this place clearly has no training on the basics of housekeeping.\nAlfred takes up the stairs, his motions silent as he listens sharply. A concerning sound — a muffled keen — directs him down a hallway, and towards a bedroom with a partly open door.\n“Timothy Drake?” Alfred calls. “Timothy?”\nHe steps into the bedroom.\nAlfred does not find the Timothy Drake he’s accustomed to seeing at Bruce’s galas — the taciturn young heir to the Drake fortune, with curious eyes and careful, polite expressions.\nNo. He finds a lump of a shivering, crying, unconscious child, his hands balled into fists under his stomach as he sleeps fitfully.\n“Oh, my,” Alfred says, surveying the room.\nThere’s no bowl of water, or a washcloth, on the nightstand besides him. There’s no thermometer or medicine in sight, either. No other noise within the manor — all the evidence slowly but steadily strengthens the suspicion in his gut.\nThere is no caretaker.\nThere is a very young child with a fever alone in an empty house with laughable security, and there is no caretaker.\nTimothy whines weakly in his sleep, and in a sudden rush of parental instinct, Alfred reaches out to feel the boy’s forehead. It burns. Anger floods through Alfred as he pulls his hand back.\nSomething must be done.\nSo Alfred decides. He lifts the sleeping child, blanket and all, into his arms. The boy’s head rolls on his collarbone, the heat of his forehead pressing into his skin. He clutches at Alfred’s freshly-ironed shirt in his sleep, mumbling brokenly.\n“Mrs. Mac… you smell good…”\nAlfred takes one hand to tap the comms in his ear. “Sir.”\nBruce’s voice filters through not a moment later. “Alfred. Is everything alright?”\n“Quite the contrary,” Alfred says, and it’s all his can do to keep the fury out of his voice.\nA sharp pause, then a stern, “What’s wrong?” clips through, more Batman than Bruce Wayne.\nAlfred glances down at Timothy Drake, who is flushed in the cheeks and nose, eyebrows pressing towards each other in pain.\n“I found the boy alone, Master Bruce. There was never a babysitter, I’m afraid.”\nAnother pause. “How can that be? The Drakes just… left him alone?”\n“It’s worse than that, it seems,” Alfred says. “He needs medical attention if he’s to get any better. He’s very sick.”\n“I can call the Drakes and let them know the situation.”\n“The situation, sir?”\nBruce doesn’t hesitate. “That he’s going to be staying with us until they return.”\n“Ah. You read my mind.”\n \n~~~\n \nAs Tim floats in and out of consciousness, he registers someone’s hand on his overheating forehead, housewarming noises drifting around him, and a heavy, cozy, thing pressing down on his legs. He opens his eyes a crack. The wrinkled face of an elderly man with silver hair and a slightly tousled dress shirt under his waistcoat comes into view, preparing a tray on the nightstand.\nHis face is… familiar.\nTim scrunches up his forehead in confusion, trying to think.\n“What happened?” he mumbles, and to his surprise, the sharp pain in the back of his throat has dulled considerably.\n“You called for more blankets, young sir,” the man explains in a cordial British accent.\nBlankets.\nIt hits Tim then, that he’s no longer cold. He glances down, and sees that he’s been covered in a pile of blankets, the thinner ones closer to his body than the thicker ones. His limbs are no longer freezing, and with the realization that his head no longer throbbing either, he could cry happy tears.\nBut then he sees something else.\nThere, over his legs, over all the blankets, is a giant dog.\nTim’s eyes widen at the snoozing mass of black and brown fur, the large snout, and the pointed ears. German Shepherd, Tim identifies, and tries to recall everything he’s ever read about big scary dogs and how not to provoke them.\nBut then he stops, because hello? Whose dog is this?\nAnd this isn’t his bed. Or his room. He looks around, not recognizing the cream colors of the furniture, the gold door handles, or the smell of something delicious coming from out the door, in the hallway. Through the large window in the room, he sees a view of the grassy hills of Bristol that he’s never seen from anywhere in the Drake Manor.\n“How are you feeling?” asks the man, arranging something bread-like and thin on a small plate on the tray. “If you’re in need of some ibuprofen, we have some freshly baked biscuits to line your stomach.”\nIt all comes back to Tim then — the chills, the throw up, the call —\nOh no. The call.\nHe hadn’t called Mrs. Mac after all. That voice on the phone — it was Alfred Pennyworth’s! Bruce Wayne’s butler! Batman’s butler!\n“Mr. Pennyworth,” Tim gasps.\n“Feel free to call me Alfred, young sir.”\nAnd now he was in — the Wayne Manor?\n“No!” With all his might, Tim pushes himself into a sitting position. The dog at his feet jolts awake, rising to attention with a wet snort. Panicking, Tim jerks his legs inward, scooting backwards into the headboard. Ace, he remembers, the Bat-Hound. He won’t hurt you. But he’s too disoriented to relax.\n“Very well then, if you feel strongly about it.”\nTim shakes his head, heart racing.\n“No, I mean, I didn’t mean to call, and I’m sorry, I meant to talk to Mrs. Mac and I — I guess I must have called you by accident. I’m so sorry. I promise I didn’t mean to.”\n“Don’t mind it at all. It’s quite alright.”\n“I’m sorry,” Tim repeats, mortified. When his parents find out he dialed the wrong number for help, they’re going to be so completely disappointed in Tim for embarrassing their name in the Wayne Manor.\nAlfred lowers the unclaimed plate of biscuits and reaches a cool hand on Tim’s forehead. Then his cheek. Tim realizes he’s leaning into the comforting physical touch only after Alfred pulls away.\n“Oh, child. You’re still quite ill,” the butler murmurs in concern, then his head turns abruptly towards the German Shepherd who’s begun to nose the plate. “Ace, those are not for you.”\nAce backs away from the biscuits immediately, ears flopping down in shame. Tim’s never seen a dog look despondent before.\nAlfred makes a tsk sound, chiding Ace. “No need to be that way. You already had a hearty dinner. These are for our guest.”\nThat gets Ace to perk up, looking at Tim with interest.\nWait, I’m not good with animals, Tim tries to object, but before he opens his mouth, Ace is bounding up to him across the bed, tail wagging.\nFlinching, Tim squeezes his eyes shut and prepares to become a doggy chew toy. Instead, he feels a hot puff on the side of his face. When he opens his eyes, Ace is giving him exploratory doggy sniffs, like he’s not sure what to make of Tim. His big brown eyes are curious when he smells the fever on him. And then a pink tongue darts out and the scariest canine Tim’s ever seen gives him a friendly kiss.\n“Oh,” is all Tim has to say, nonplussed. “You’re… not going to bite me.”\nAce pauses, tilts his head in an affronted way, and proceeds to further kiss at Tim’s face, suddenly doting on him like he’s a puppy. It’s warm, and it tickles. Tim squeals, laughing.\n“Ace quite likes children. But do feel free to push him away if he’s a nuisance,” Alfred informs him.\nHesitantly, Tim reaches his fingers out to scratch at Ace’s chest. Ace’s tail thumps on top of the blankets. Tim smiles. Then guilt consumes him as he remembers where he is.\n“I should go,” Tim says in a rush, dropping his hands. The longer he’s an inconvenience, the more upset his parents will be when they find out. He looks up in time to see Alfred’s expression turn from pleasantly professional to dismayed.\n“Timothy, young sir, is that — is that quite safe?” But before Tim can even wonder what Alfred means, someone steps into the room, filling the open doorway of the guest bedroom.\n“Is he awake, Alfred?”\n“Yes, Master Bruce.”\nAnd then Bruce Wayne walks into the room.\nAce perks up and bounds off the bed to Bruce’s side. The man, who Tim normally only sees at formal events in a tux or at night in his Batman gear, stands before him now in a t-shirt and sweatpants, scratching behind Ace’s ears. Tim stares, slack-jawed. He didn’t think Batman could look so normal.\n“Hello,” Bruce greets Tim with a professional smile. “Tim, right? It’s nice to meet you outside of those stuffy galas. Though I’m sorry it had to be because you’re sick.”\nIt’s official, Tim thinks. Bruce Wayne knows I’m a total dummy.\n“Um. Yes. It’s nice to meet you too, Mr. Wayne,” Tim says, his voice coming out small. “I’m really sorry about this.”\nBruce shakes his head. “Please don’t be.”\n“I don’t usually call butlers by accident.”\n“A good thing, then,” Alfred jokes from the side, “You would give them all quite a fright.”\n“I’m gonna move and change my name,” Tim says miserably.\nSurprised laughter ensues from the adults.\n“Hopefully not,” Bruce says, smiling for real now. “Looks like you already made friends with Ace.”\n“Oh — yeah, he’s nice.”\n“Well. Not to everyone, if we’re being honest. Ace is a good judge of character.”\nAce woofs in agreement, and Tim longs for the dog’s warmth next to him.\n“Um. Mr. Wayne?” Tim begins with a deep breath, “I’m really sorry about accidentally calling Alfred and making him come get me and bring me here.” Then he pushes the blankets off his legs and slips out of the bed carefully. “I’m really sorry. Um, again. And thank you for everything. I’ll get going now. I can make the bed before I go, if you want.”\nTim pulls the covers back up and adjusts the crumpled pillows. When he glances over his shoulder, he doesn’t understand the utterly blank looks on Alfred and Bruce. Tim freezes. Is he forgetting something? Is he doing something wrong?\n“Oh,” Tim says, staring at the rumpled bed. “Right. The blankets and stuff have to be washed. Sorry. I… I can help with the laundry, then.”\nBruce recovers from his confusion first.\n“What? No. You don’t have to do that,” Bruce says. “Tim, you don’t have to make the bed or do laundry. You don’t owe us anything.”\nTim acquiesces, stepping away from the bed and fighting off a wave of sudden exhaustion. “So what you’re saying is that I can just go?”\nA crease forms between Bruce’s eyebrows, and he quickly exchanges looks with Alfred. “It’s getting late, and you’re not well.”\n“What?” Tim blinks tiredly, trying to process Bruce’s words. His eyelids close on their own, too heavy to keep open. He feels himself swaying.\nThere’s a grunt, and then Tim opens his eyes a crack just as Bruce strides forward, arms shooting out to steady him by the shoulders. As Bruce kneels down to meet him at eye-level, Tim peers into his clear blue eyes.\n“Alfred, I think he’s burning up again,” Bruce says, alarm in his tone.\nAlfred’s voice comes from somewhere behind them, too loud for Tim’s head. “I have the thermometer, Master Bruce.”\n“It’s, um, not that bad,” Tim tells them as the cool touch of the thermometer is pressed against his temple. “I can just go home and rest.”\nThere’s a beep. “One hundred and one, sir. The boy is in no shape to go anywhere, if you don’t mind my two cents.”\nTim frowns.\n“Well, you heard Alfred,” Bruce says to him. “I tried calling your parents, but they’re on their flight. So we can leave them a voicemail to let them know you’ll be bunking here for the night—”\n“No,” Tim protests. “I can go home. I’ll be fine.”\nBruce considers him. “Tim, was anyone hired to look after you?”\nThe question is asked all too casually for the way it cuts into Tim like a knife and silences the room. Tim stiffens, suddenly feeling all eyes in the room on him — even Ace’s.\n“I don’t…” he trails off, and slowly, his face begins to burn.\nBruce’s expression softens immediately.\nHe glances at Alfred meaningfully, and the butler clears his throat, clicking his tongue to get Ace’s attention. “Well, it’s about time I take Ace on his evening walk. Come on, boy.”\nThey leave the room. It’s a not-so-subtle way of giving him privacy, Tim can tell. He clutches his hands together, staring down at his socked toes.\n“Mrs. Mac usually looks after me,” Tim mumbles.\n“Mrs. Mac,” Bruce says with all the patience in the world. “Your nanny?”\n“No, she’s, um, the housekeeper.”\nA pensiveness passes over Bruce’s face. “And yet you tried to call her, which means she wasn’t with you. Was she not working today?”\nTim wishes he weren’t discussing his embarrassing home life with Gotham’s best detective. “Um. Yeah. It’s her day off.”\n“So who was supposed to be looking after you today?”\n“I’m big enough to take care of myself,” Tim argues, voice strangled.\nSomething barely perceptible falls across Bruce’s face, but Tim doesn’t want to read into what he really thinks of him. Accidentally calling Alfred instead of Mrs. Mac and waking up in the Wayne Manor is enough torture for one day.\nFor a moment, they both stand in silence. Tim notices Bruce’s hands on his shoulders, which are gently helping him stay balanced.\nBruce is warm, Tim realizes. Even though he’s sick and everything around him should feel cold, people and dogs are warm and he… he likes that.\nFollowing Tim’s gaze, Bruce misunderstands, apologetically pulling away.\nTim doesn’t see it coming when he crumples.\nThanks to his fever-sluggish reaction time, the floor rushes up alarmingly to meet him. Then something soft catches him, and Tim’s face fits into a shoulder, the back of his knees caught over one of Bruce’s thighs.\n“Whoa,” he hears Bruce say. “Hey, there, chum.” Tim can feel the vibrations of Bruce’s voice. “I take that to mean we’ve reached an agreement, then?”\nAgreement? What agreement? Tim struggles to put his thoughts together, but he’s already half-dreaming. All Tim knows is that he’s definitely not agreeing with Batman on something.\n“No,” Tim attempts, voice muffling against Bruce’s shirt.\n“No?”\nTim clears his throat. “No, it’s okay. I can,” — what’s the point I’m trying to make, again? Oh, right — “take care of myself.”\n“That’s admirable,” Bruce says nicely, like he doesn’t believe him.\nTim shakes his head against Bruce’s shoulder, words slurring. “No, I really can, an’ plus you need t’ do Batman stuff, an’ I dun wanna bother you guys.”\nBruce’s body tenses. Tim doesn’t get it. The flu takes him out every year, like clockwork. His parents used to stick around to help, but they sometimes get busy, and so he’s always taken care of himself. He’s good at figuring it out, usually. This isn’t the best example, but —\n“What did you just say?”\nTim registers what he’s just done as Bruce’s voice rings in his ears. Dread pools in his gut. His headache doubles in intensity. His eyes snap open. His body drops a few degrees all at once.\nHe called Bruce Batman.\nNo.\nNo, no, no.\nHe didn’t mean to do that. He never meant to spill their secret, even to any of them.\nTim forces himself out of Bruce’s grip just in time to see the man’s shock masking into something blank — is it distrust? Tim stumbles back, finding it hard to breathe.\n“I’m sorry, Mr. Wayne,” he blurts pathetically. “I didn’t mean to — I found out last year about Dick and you and Barbara Gordon and Ace but I — I didn’t tell anyone. I would never tell anyone. It’s just — I’m good at keeping secrets. I promise. I don’t even have anyone I could tell, anyway, there’s never anyone home — and Gotham needs a Batman, so I wouldn’t, I’m —”\nIt’s clear that Tim’s made a mess of things. Bruce’s expression is frozen in neutrality.\nHe hates me, Tim realizes miserably, taking more steps backwards.\n“I should go,” he cries out, then turns on his heel and runs.\nHe doesn’t want to keep looking at Bruce and feeling his coldness. It was so much better when Bruce was hugging him, ushering him into his arms. Tim should have just played the part of a sick boy who needed help. Bruce was so warm, and now Tim’s ruined that.\n“Tim!” he hears Bruce shout from behind him. “Tim, wait!”\nBut he’s too upset with himself to wait. With a pounding headache and a fatigued body, he turns down a hallway, looking for stairs. He doesn’t know the Wayne Manor like he knows the Drake Manor, obviously, but he figures the grand staircase leads down to the foyer, which leads to the front door. And he can just run back to his place on foot. Even if the sun’s gone down completely, it’s not far.\nHe turns down another hallway and — yes! There it is, the top of a large curving staircase, recognizable from some of the formal events that Tim’s attended in the past. His legs pump underneath him, feet numb. The world spins, stars popping in and out of his vision, and his knees feel weak. He gets to the first step.\nBut instead of taking the first step, Tim’s vision goes white, and he doesn’t even have time to grab the railing as he pitches forward.\n“Tim!”\nStrong arms wrap around his midsection and in a sense of déjà vu, Tim lands against a warm body.\n“Tim. Tim? Are you okay?”\nBruce doesn’t sound like he hates him. Tim doesn’t deserve the kindness. When the tears come, he’s at least glad he gets to hide his face into Bruce’s shoulder.\n“Oh, sweetheart,” Bruce murmurs. “It’s okay. Nothing’s so bad. Everything’s okay.”\nTim never should have looked into all of their secret identities. He should have just left them alone and not thought about it. His breathing becomes out of control as he tries and fails to hold back his sobs. Bruce makes gentle shushing noises, patting his back.\n“I won’t tell anyone,” Tim promises between hitching breaths, angry with himself for crying, which only makes his shudders worse. But he needs to tell Batman that his identity isn’t compromised. “I haven’t told anyone since I found out last year all on my own, I promise.”\n“Last year,” Bruce repeats slowly, not ceasing in rubbing Tim’s back, easing his breaths. “That’s… Tim, how old are you?”\n“Eight,” Tim whispers. He lets Bruce make sense of that. For a few seconds, Tim’s hiccups are the only sound. Then he blurts, “Am I in trouble?”\n“No.”\n“Do you hate me?”\nImmediately, Bruce holds him tighter. “No.”\n“You’re not mad?”\n“No, Tim, sweetheart,” Bruce says gently. “I’m not mad. I think you’re a very intelligent, brave kid.” A pause. “We’re going to have to lock you up in the Batcave forever, though.”\nTim pulls back, then lets out a choked laugh when he sees the corners of Bruce’s mouth teasing up.\n“I also think,” Bruce says, wiping away the last of Tim’s tears with his thumbs. “That this very intelligent, brave kid needs to get to bed. What do you think?”\nTim nods, agreeing finally, and when Bruce lifts him off the floor, he clings to him. He’s carried down the hallway. He’s carefully tucked into a bed. A washcloth is placed on his forehead.\nTim lets himself drift.\n \n~~~\n \nTim wakes up hazily, with Ace pressed into his left side, and someone much bigger on his right side. But Tim’s so comfortable he can’t open his eyelids all the way to see who it is. He can only hear voices.\n“Aw. Poor Timmy,” someone whispers. A kid, probably older than him.\n“Uh, who?” Another kid, younger, not at all whispering.\n“Timothy Drake,” replies Bruce’s voice, much closer. “His fever’s just broken, but keep your voices low.”\n“We will.” A scuffle, then two pairs of feet moving towards the bed. “Dude! We’re s’posed to maintain an Alfred-approved distance, in case you forgot.”\n“Ha! I won’t get sick. ”\n“You don’t get to decide, Jay-jay. It’s your immune system.”\n“Shut up, Dickwing.”\nA theatrically dramatic gasp. “Dad, did you hear him just say that to me? The nerve. The audacity—”\n“Boys.”\nThe obedient hush that follows doesn’t last very long.\n“Uh… so where did he come from?”\n“He’s the neighbor’s kid, Little Wing,” the other kid answers.\n“Which neighbor’s kid?”\n“The rich ones.”\n“That doesn’t narrow it down.”\n“Anyway, I brought Zitka. I thought Tim might need her.”\n“That’s considerate of you, chum.” There’s a weight dipping on the bed, and then there’s something soft and stuffed and elephant-shaped being dropped onto Tim’s hands. “I think he’ll appreciate the gesture when he wakes up.”\n“Um, B?” the younger kid asks. “Is he gonna live with us now?”\nThere’s a careful, considering pause.\n“I think so, if there’s no one to watch over him while his parents are away,” comes Bruce’s voice.\nTim’s heart swells, surprising himself. If he stays here, then… will he get to stay warm like this?\n“Huh. Cool.”\nBruce’s laughter is like a cozy blanket. “I’m glad you think so, Jaybird.”\nTim feels himself being pulled under by exhaustion again, his fingers curling around the soft huggable thing in his arms. The next time he wakes up, he’s going to introduce himself. He’s excited to meet Dick and Jason.\n \n~~~\n \nWhen Alfred steps into the guest bedroom where the young Drake sleeps off the last of his fever, he finds a sight:\nBruce is snoozing softly one one side of the bed. Dick’s on the other side, wrapped in one of Bruce’s hoodies. Jason and Ace sprawled out across the foot of the bed. Between all of them is Tim, curled up with Zitka in his arms, pressed in warmly on every side, his sleeping face smooth with restfulness.\nAlfred smiles. All things aside, he’s quite glad Tim called the wrong number."
}