{
    "id": "3782125",
    "url": "https://archiveofourown.org/works/3782125?view_full_work=true",
    "author": [
        "SailorChibi"
    ],
    "title": "hold the things you wanna say",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Iron Man (Movies)",
        "Marvel Cinematic Universe",
        "The Avengers (Marvel Movies)"
    ],
    "relationships": [
        "Steve Rogers/Tony Stark"
    ],
    "characters": [
        "Tony Stark",
        "Steve Rogers",
        "Howard Stark",
        "Jarvis (Iron Man movies)",
        "Natasha Romanova",
        "Clint Barton",
        "Phil Coulson",
        "Thor (Marvel)",
        "Bruce Banner"
    ],
    "additional_tags": [
        "Howard Stark's A+ Parenting",
        "Howard Stark's Bad Parenting",
        "Tony Needs a Hug",
        "Tony Stark Needs a Hug",
        "Implied/Referenced Child Abuse",
        "Past Child Abuse",
        "Punching",
        "Abuse",
        "Verbal Abuse",
        "migraines",
        "Tony Feels",
        "Tony Stark Feels",
        "BAMF Steve Rogers",
        "BAMF Phil Coulson",
        "Hurt/Comfort",
        "Emotional Hurt/Comfort",
        "Platonic Cuddling",
        "Team Bonding",
        "tony is not a consultant",
        "Cuddling",
        "Love Confessions",
        "Tony Stark Has Daddy Issues",
        "Tony Angst",
        "Tony Stark Has A Heart",
        "compliments",
        "the team really does need tony",
        "Time Travel",
        "hand wavy time travel",
        "Protective Steve Rogers",
        "Protective Avengers",
        "Panic Attacks",
        "Comfort",
        "Fluff",
        "all the feels"
    ],
    "language": "English",
    "series": "",
    "published": "2015-04-19",
    "completed": null,
    "words": "6,316",
    "chapters": "1/1",
    "comments": "276",
    "kudos": "16,857",
    "bookmarks": "3,222",
    "hits": "240,553",
    "summary": "<p>Tony is still a consultant, and between SI, the team and SHIELD he's overworked and exhausted. That's okay.</p>\n<p>He and Steve have been having sex for weeks but that's all it is, just sex, and Tony wants more but he'll never get it and that's okay. Really.</p>\n<p>What's <i>not</i> okay is the fact that Howard Stark has somehow appeared in the future and is the same as always. </p>\n<p>This is definitely going to fuck up his schedule.</p>",
    "notes": "<p>I like the trope where Tony thinks he's a consultant and is massively overworked because of it, and then the others find out about it. But I wanted to switch it up a bit and add in a) a shaky relationship/hate sex with Steve and b) Howard because why not. I'm really stressed right now so this wasn't written as quickly as I wanted, and it's probably not as good as I thought it would be either... but there's so much Tony hate going in the fandom right now I had to finish it.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Here is my <a href=\"https://tsuki-chibi.tumblr.com/\" rel=\"nofollow\">tumblr</a>. You know you want to follow me.</p>",
    "text": "Between Pepper and Stark Industries, Fury and SHIELD, and his own, personal projects, Tony's to do list had over a hundred items on it. He rested his chin on his hands and stared at the list, which JARVIS had helpfully color coded into urgent (bright red), high priority (blue), moderate (green), and can wait (yellow). Right now the screen was awash in red and blue, and the green and yellow were sorely lacking. He watched in growing disbelief as his email pinged, and then a previously green item turned into blue and shot up the list.\n\"J, you have got to be kidding me,\" he croaked, his throat aching a little. \"Didn't I finish like half of this list just yesterday? Why is it so long now?\"\n\"I'm afraid Miss Potts has been sending you a number of emails, Sir,\" JARVIS replied. \"Director Fury has also sent you three different emails, and attempted to contact you repeatedly by phone. Every hour you delay in sending him a response, he adds another item onto your list.\"\n\"Of fucking course he does,\" Tony muttered, fighting off the urge to start laughing hysterically. He was pretty sure that he wouldn't be able to stop laughing if he started, and this to do list wasn't going to finish itself. Hell, he wasn't sure he was even capable of finishing it. Not with the rate that things were piling up. \nHe pushed away from the desk, turning his back on the holographic screen like that would somehow make it all go away. It didn't work. It was all still there, hovering right behind him. Sometimes it was so damned tempting to just tell Fury to go fuck himself. To be done with whoring himself out to SHIELD just so that he could stay on as a consultant to the Avengers. But then again, that would mean giving up the team, and Tony would rather work himself into a heart attack before he let that happen.\nThe team might not be crazy about having him around, but without them Tony really would lose it. And it felt like he was barely clinging to reality as it was. He scrubbed his fingers through his hair, not caring that he'd probably just smeared grease in, and started to turn back to face the list. At that moment, though, the workshop door swung open and Steve strode in. Immediately Tony waved a hand, sending his list away and retrieving some specs for the latest suit.\n\"Tony, don't you ever look at your email?\" Steve asked, not bothering to say hello. So he wasn't here for a quick fuck, then. Pity, Tony could've used the break. \"Fury's been trying to contact you.\"\n\"I know,\" Tony said wearily, feeling the beginnings of what promised to be a spectacular migraine building behind his eyes. He groped around behind him, finding the handy bottle of painkillers he kept in the shop, and downed a couple dry. At the very least, it would put off the inevitable for a little while longer.\nSteve was still frowning at him. \"Then don't you think you should take a minute to read one of the messages?\" he asked, voice full of the kind of disapproval that only Captain America was capable of.\n\"I'd love to, Cap, but I have more important things on my plate than to worry about the newest update for the Helicarrier,\" Tony replied in a flash of rare honesty. It wasn't that he minded working for SHIELD. At least Fury had stopped trying to get him to create weapons. Now most of the things he commissioned were for safety: comms upgrades, helicarrier updates, a faster quinjet. But when it started interfering with the other seventy things on his list, that's when it started being a problem.\n\"This is about more than just the helicarrier.\"\n\"Then what is it? SHIELD R&amp;D fucked up those new comms I gave them? That would be -\"\n\"It's... your father,\" Steve cut in, and Tony blinked at him, shocked into silence. The last time he'd heard those words, he'd been a student at MIT and Obadiah Stane was calling to tell him about the accident that had killed Howard and Maria Stark. He still remembered how cold he'd gone after hearing them, like he wanted to be sick but his body couldn't figure out how to make that happen. The same feeling was creeping up on him now, but it was accompanied by the knife sharp edge of panic that he was intimately familiar with.\n\"My father?\" he said abruptly, realizing that he'd been silent for nearly a minute and that Steve was looking increasingly concerned. \"I'm not sure what year you think it is, but my father died -\"\n\"That's just thing, Tony,\" Steve said, interrupting again, but this time there was no heat behind it. \"There was... I don't know exactly what happened, but apparently there's a sixty-year-old Howard Stark on the helicarrier right now. That's why Fury has been trying to get into contact with you.\"\nA dull roaring filled Tony's ears. He could see Steve's lips moving, but none of the words were registering. It took everything he had to keep from falling to the ground and curling up into a ball until the whole world just went away, but this was more than he could handle. Even though it was probably a monumentally bad idea to be mixing medications, he groped around on the desk until his shaking fingers located his Xanax. He popped one into his mouth and just sat there, feeling cold and shaky, while it dissolved on his tongue. The taste was disgusting, but the chemicals went a long way towards making him feel like he could breathe.\n\"Tony? Are you okay?\" Steve gripped his shoulder. The touch, much as Tony wanted to swat it away because he couldn't deal with this right now, actually helped him to ground him. The room stopped spinning, letting him focus on Steve's worried blue eyes.\n\"I'm fine,\" Tony said, hearing himself speak as though from a distance.\n\"You don't look fine. You're white.\"\n\"It's 'cause I don't have time to lay in the sun anymore,\" Tony said, trying for a joke and knowing that he was falling dead flat. Dead, like his father was supposed to be. A laugh bubbled up in his chest, but he forced it back down. \n\"Right,\" Steve said, not looking convinced. \"Fury wants to see you.\"\n\"And we should always do what Fury wants, right?\" Tony stood up, proud when his knees didn't buckle underneath him like he suspected they might. He finally pushed Steve's hand away, making it to the door under his own control. \nMost of the journey to SHIELD was a blur to him. He was vaguely aware that Steve, Bruce and Thor were making the trip with him, and that Natasha and Clint met up with them at SHIELD, but none of that seemed to matter. Tony stared straight ahead the entire time and only really felt like he jolted back into life when Coulson's face suddenly appeared in front of him. He jerked back, knocking into Steve, who steadied him. Coulson didn't say anything, just looked at Tony in a way that felt way too intimate.\n\"Director Fury thinks it's best if Howard Stark is told as little about the future as possible,\" Coulson said. He was speaking slowly and carefully, enunciating each word like Tony was a kid. \"Howard is the only one who can give us information about how he got here. But he's refusing to cooperate until he speaks with Captain America and you.\"\nTony found it hard to believe that his father actually wanted to speak to him. That had to be a mistake. \"How did he get here?\" he asked.\n\"We're not sure,\" Coulson admitted, not looking very happy about that. \"He walked into SHIELD this morning out of the blue. It's taken this long to confirm that he is who he says he is, and not an imposter or a clone. He refuses to admit how long he's been in the future for.\"\n\"So you don't even know what he knows.\"\n\"No.\"\n\"Well then, I can tell you that your plan to keep him in the dark is already a failure,\" Tony said flatly. \n\"Just do what you can, Stark. We're sending you in first.\"\n\"Are you sure you're okay with this?\" Bruce asked in an undertone, placing a hand on Tony's arm. It was so unusual for Bruce to be the one to reach out and initiate touch that, for a moment, Tony just stared blankly at him. Bruce tried to smile. \"You don't have to talk to him if you don't want to. No one would blame you. I'm sure SHIELD can figure out some way to send him back. We could call in Reed or Doctor Foster, or maybe Thor's father could do it.\"\n\"Aye,\" Thor said, nodding, looking worried. \"I have sensed no unusual magic in the city in the past twenty-four hours, but that does not mean something has not occurred.\"\n\"It's fine,\" Tony replied, waving them off. He avoided looking at Steve. They weren't any closer, weren't even really friends even though they'd had sex a bunch of times over the past couple months, but if anyone would be able to read him right then it was Steve. And this was not a time when Tony wanted anyone to be able to see past his mask. He did his best to summon it up, painting his infamous, cocky smile across his face as he followed Coulson down the hall and to a door. Coulson swiped his card, the reader on the door flashed blue, and then the door swung open.\nHoward Stark glanced up. He was sitting at a table in the middle of the room, which was sparsely decorated with a couch, a mini refrigerator, and a couple of chairs around said table. Tony stepped inside, forcing himself to keep from flinching when the door swung shut behind him. His father didn't really look that different than he remembered. There was a lot of grey in Howard's hair, particularly around his temples, although his moustache was still dark. Wrinkles lined his forehead and around his eyes and mouth, but instead of making him look old, they just gave him a more dignified appearance. More telling were the dark furrows under his eyes, from lack of sleep and alcohol.\nTony's stomach flipped when he spotted the glass on the table. It was empty except for a little bit of amber liquid at the bottom. One guess as to what had been in it, and he had to wonder just how much Howard had drunk already. He stayed quiet, not wanting to be the first one to speak, just watching as Howard stood up and walked over to the mini-fridge. There was a small cabinet beside it. Howard took out a mostly empty bottle of whiskey and poured a good helping into the glass. He didn't offer Tony any, not that Tony would have taken it.\nFinally, Howard spoke. \"I read about how you recently quit drinking.\"\n\"Um, yeah,\" Tony said, a little rattled by the odd topic of conversation. \"I couldn't really... it was interfering with my work.\"\n\"Your work,\" Howard echoed. \"And what kind of work would that be? Certainly can't be the company I built from the ground up, seeing as how you made someone else CEO. And not just anyone. A woman.\" He practically spat the word out, eyes bright with anger as he sipped from his glass.\n\"Pepper's amazing as a CEO. She's taken the company places that I couldn't have.\"\nHoward snorted, sinking back down into his seat and eyeing Tony critically. He had the same unique expression that was burned into Tony's memory, a look that said what Howard was seeing was not measuring up to what he wanted. \"Figures. I always knew that you would turn out to be useless in the end. There was a time when I thought you had the potential to be my greatest creation, but the future has shown me that everything I ever thought about you was right.\"\n\"I've been sleeping with your greatest creation.\" The words slipped out before Tony could stop them. \nHoward's expression was priceless.\n\"Don't worry,\" Tony added with a bitter laugh. \"He hates me just as much as the rest of the team does. I'm good for sex and not much else, isn't that right?\" He shook his head. \"I'm as disappointing to them as I am to you. Frankly I'm not sure why they haven't bothered replacing me yet. What little I can do isn't worth them having to be subjected to me, especially when there are better options out there.\n\"I tried to prove myself as worthy, but seeing you...\" He forced himself to smile. \"No matter how many projects I do, no matter how many improvements I make or how many new gadgets I hand out or how much money I spend, it reminds me that it's pointless. I'm not enough. I never will be.\"\nSaying it out loud actually felt good. He'd struggled to live up to Howard's expectations for years without getting anywhere, always knowing that he would never be good enough. This was like a moment of clarity. Now he was going through the same thing with the Avengers and Tony was just... \n\"I am just so damn tired of it all. I don't want to care anymore. I just want to stop.\"\nIf he hadn't been so exhausted, Tony might've been able to dodge the back of Howard's hand. Or maybe not. God knows he never had when he was a kid. It was still a familiar sensation, a shockingly loud sound followed by a wave of heat underscored by a sharp sting. His head snapped to the side as he staggered back into the wall, the room fuzzing over before it swam slowly back into focus.\n\"You are not worth of the name of Stark!\" Howard was yelling at him. \"You're not building weapons anymore. You're driving everything I built into the ground! If I'd known you were going to -\"\nTony didn't even know when Steve came into the room. It seemed like one second he wasn't there and the next second he was, swinging his arm back and punching Howard in the face. The force of the blow knocked Howard off his feet, sending him sprawling backwards on the ground. Steve moved closer, crowding him, with Thor and Natasha flanking him on either side - and when they hell had they gotten there?\n\"Tony. Tony, come on, man.\" Clint's hand touched his shoulder, then an arm was wrapped around his waist, and Tony was being half-carried half-helped out of the room. Coulson met them at the door. He studied Tony briefly, then carefully took Tony's chin and tipped his head so that he could see the side of Tony's face. Anger flickered across his expression.\n\"Take him to Bruce,\" he said finally.\n\"What? Why?\" Tony said, trying to pull away from Clint. His head was spinning and his cheek was hot and throbbing. Howard hadn't pulled the backhand, that was for sure. He just wanted to go home and put some ice on it and then hide in his bed for a month.\n\"Bruce will make sure you don't have a concussion,\" Clint said, trying to tug him along.\n\"I don't,\" Tony said, confused, digging his heels in. \"I can tell. He didn't hit me hard enough this time.\"\nCoulson and Clint exchanged looks. \n\"Humor me,\" Clint said after a moment's pause, and there was something wrong with his smile, but Tony couldn't put his finger on what it was. He let Clint lead him away from the room, not wanting to be anywhere near Howard anyway, and down towards the helicarrier's medical bays.\nBruce was waiting for them there. There was a faint green tinge to his flesh, but he looked like he was in control. He was already holding an ice pack, which he pressed to Tony's cheek as soon as Tony was within reach. Tony sucked in a sharp breath at the icy bite but sank into it, closing his eyes and letting the cold ease the pain. He brought his hand up to take it from Bruce, adjusting the pack until it covered his whole cheek.\nHaving his eyes shut reminded him all over again how tired he was. He might have been swaying; someone pressed a chair against the back of his legs and he sat down. The change in position made him feel a little nauseous, and he breathed through his mouth to keep from throwing up. It didn't really help, because he could still taste bile at the back of his throat. He sat like that for a long time, just breathing.\nClint and Bruce were whispering in hushed tones somewhere over to his left when he finally let his hand drop. The ice pack was more water now than ice, and his fingers were cold. Bruce looked at him immediately.\n\"Are you okay? Does your jaw feel broken?\"\n\"S'fine,\" Tony replied, carefully screwing his face up to prove his theory. It hurt, and he probably already had the start of a nice bruise, but it was no worse than what he usually got during an Avenger fight. Less, even, because Howard didn't hit as hard as a desperate man trying to conquer New York.\n\"That wasn't fine,\" Clint said, but Bruce shot him a look and he went quiet.\nTony ignored them both and got to his feet. The room spun a little bit; he felt dizzy, but he had enough experience with pretending he was sober while drunk that he covered it. \"Bathroom?\"\n\"Down the hall to your right,\" Bruce said. \"Do you need help?\"\n\"To pee? I think after over forty years of experience, I got it,\" Tony muttered. \nHe waited until the two of them weren't paying attention and then took a left. The helicarrier was as familiar to him as anyone, considering he'd gone over the blueprints enough times. He walked until he was at the nearest exit and then activated the bracelets for the suit. There was no way he was capable of piloting it on his own, but it wouldn't be the first time JARVIS had gotten him home safely and it probably wouldn't be the last.\nWhen he saw the familiar red and gold armor coming, he opened the door and let it lock into place around him. Having the suit around him again was a relief. Tony could say without an ounce of doubt that the suit was the one good thing he'd accomplished in his life. He relaxed, letting JARVIS take control and lift off. The suit flew through the air towards the tower, which rose above New York like an eyesore.\n\"Block all incoming calls, J. I don't want to hear from anyone right now.\"\n\"Understood, Sir,\" JARVIS's voice said. \"I am detecting an unusual rise in your blood pressure, and your heart rate is accelerated. Your body temperature is low, and there is a swelling -\"\n\"I got it, J,\" Tony mumbled. Not a concussion, but shock, maybe. He was still a little cold and dizzy. But he felt better the further away from the helicarrier that he got. Maybe if he could just sleep for a little while, this would all turn out to be nothing more than a bad dream.\nHe landed on the platform and stumbled as the suit fell away from him. Without the armor's support, his legs felt weak. He braced himself against the wall as he staggered into his bedroom. He couldn't remember the last time he'd actually slept in his bed. When he had a minute or two to sleep, he usually crashed on the couch that was down in his workshop.\nActually, the last time he'd been in a bed, it was Steve's. It was one of only a handful of times that sex hadn't just been a quick, dirty fuck in the workshop where no one would catch them, and Tony had spent the whole time barely daring to breathe for fear that Steve would suddenly realize what he was doing and kick Tony's ass out the door. Being in Steve's bed was too close to what he really wanted and was never going to get, so he never stayed long. Practically before the sweat had finished cooling, he was dressed and out the door.\nFalling face first onto his own bed turned out to be a stupid move, because it made the pain in his cheek flare up even worse. Now that he was actually on the bed, and remembering just why he'd paid out over $20,000 for his mattress in the first place, moving seemed like way too much effort. Tony grumbled a complaint and managed to turn his head just enough so that his cheek wasn't against the pillow and he wouldn't suffocate, and then he passed out.\nNormally he woke up violently, or at least unpleasantly, snapping out of a nightmare (or, more rarely, just jerking awake out of a sleep so deep it was just blackness when he pushed himself to the limit) to the sound of JARVIS calmly reciting the date, time, location, weather, etc... until his heart stopped racing and he could breathe without panting too hard. \nThis time, it was different. For maybe the first time since he was a little kid and Jarvis - the real Jarvis - or Aunt Peggy used to lay down beside him while he napped, Tony woke up slowly. He was warm and comfortable, the upper portion of his body cradled against something firm but giving. He could hear a rhythmic beating beneath his ear, and the sounds of people breathing around him.\nHe wasn't sure whether to be disgusted or not that he recognized Steve just by the scent. It definitely wasn't a good thing that his body had apparently decided that Steve was safe enough to sleep through the man climbing into bed with him. That was dangerous. It was even worse because Tony was 99% sure the rest of the Avengers were piled around them, and not just because it meant that the whole encounter with Howard hadn't been a dream. Evidently JARVIS hadn't taken the order to ban all calls to include locking the door.\nIt was tempting to just go back to sleep and hope that they would all be gone when he woke up, but Steve shifted a little - and how the hell had he ended up lying on Steve? - and the movement jarred Tony's head. He flinched, hissing through gritted teeth as pain radiated across his cheek and up into his head, where that beauty of a migraine was definitely now in full progress.\n\"Shit,\" Steve said, his voice right next to Tony's ear. \"Sorry, Tony. Did I hit your face?\"\nTony winced again and groped around until he could clumsily press a hand to Steve's mouth. Then he pointed to his nightstand, because if they were going to invade his room then they could at least be useful. Natasha was closest. She pulled open the top drawer and, after a moment's pause, pulled out the bottle of painkillers he kept there. Bruce leaned over her shoulder to look at them.\n\"Those are very strong,\" he observed quietly. \"I didn't know you get migraines.\"\nIn lieu of speaking, Tony gave him a thumbs up and then made grabby hands at the medication. Natasha passed it over without comment. He expertly popped the top and downed three of them dry. It would take a little while for them to kick in, and even then it was up for debate as to whether or not it would work. He leaned back, intending to relax against the pillows and pretend nothing was out of the ordinary, but Steve's arm ruined that by hooking around his shoulders and guiding him back down against Steve's chest.\nAnd then he started rubbing Tony's head, using his fingertips to very lightly exert pressure against his temple and scalp and the base of his head. Tension Tony didn't even know existed bled away under those magical hands and he melted, closing his eyes in bliss. The option of going back to sleep was out the window now. He didn't want to miss a single second of this. It would be something he could remember the next time he got a migraine and had to suffer through alone.\nIt got even better after someone - Tony couldn't see who, but he suspected it was Clint given the calluses on the fingers - started massaging his feet. If he could've purred, he would have. He had no idea what was going on or why it was happening, but it felt amazing. He was torn between demanding to know why they were all in his bedroom and just staying quiet so that no one would leave.\nSadly, curiosity won out when he heard the tell-tale sound of a crinkling wrapper. \"That better be food and not a condom.\"\nNatasha snorted. \"Would you really protest if it was a condom?\"\n\"I'd be pissed that you hadn't waited until I don't have the most cliché excuse in the book plaguing me,\" Tony shot back. \n\"It is not a condom,\" Thor said, sounding far too amused. \"It is Doritos. Would you like some?\"\n\"I'm good, big guy.\" The combination of medication, foot and head rub was doing wonders, but Tony didn't want to push his luck. He'd spent more than a few hours throwing up from migraines to be seduced by food. \"But that still doesn't explain why you're all here eating in my bed.\"\n\"We're here because you're an idiot,\" Natasha said sweetly, and apparently she felt he was suitably recovered, because she punched him in the shoulder hard enough that he squeaked. \"We heard what you said to your father.\"\n\"Did you now?\" Tony said, not sure how that really explained anything. His memories were a little fuzzy, but he couldn't remember anything that would give the Avengers a reason to be here. He decided to test the waters, venturing, \"He really didn't hit me that hard. I don't have a concussion. I'm not going to fall asleep and not wake up.\"\n\"That's not what I meant. 'He hates me just as much as the rest of the team does,\" Natasha quoted. \"Along with, 'I'm as disappointing to them as I am to you.' And my personal favorite, 'I'm not sure why they haven't bothered replacing me yet'.\"\nTony was suddenly cold from head to toe, even though he was right in the middle of a bunch of warm bodies. He tried not to squirm, but that was hard. Because he was vulnerable here, and he could feel their eyes on him even though he was very carefully not looking, face conveniently hidden against Steve's chest. If he didn't look, maybe they wouldn't confirm that it was true and kick him off the team.\nWhen Natasha touched him again, he was expecting another punch. Instead, she scooted close enough that she was essentially spooning him. \"I never apologized to you for what I wrote in my initial report. I was wrong,\" she admitted in a low voice. \"Tony Stark is definitely recommended. Tony Stark is needed more than Iron Man.\"\nHe snorted at that and Clint pinched his toes hard. \"She's right, man. And before you say anything, it's not just for your money. I spent years living hand to mouth on the streets. Sure it's great living in luxury, but I don't need it. What I do need is someone to catch me when I jump off an exploding building. I doubt War Machine would keep as close an eye on my ass as you do.\"\n\"It's just such a pretty ass,\" Tony mumbled, because he couldn't think of anything else to say. \n\"Damn straight,\" Clint said, and Tony didn't have to look to know he was preening.\n\"You are a fine warrior,\" said Thor. \"I would hesitate to go into battle with any other Man of Iron, no matter what strengths they boasted. To me, you have long since proven your worth. I am honored to share a home with you and to fight beside you in battle.\"\nBut it was Bruce who reached out and snagged Tony's hand that hit the deepest, because that was something Bruce never would have done a year ago. Back then Bruce had held himself off from everyone, not wanting to get close, both for the protection of other people and himself. And this wasn't just a casual touch to the arm, either. Tony swallowed hard, throat aching, and curled their fingers together. Bruce squeezed his hand hard.\n\"Your father's gone,\" Bruce said softly. \"After Steve punched him in the face, it seemed he miraculously remembered how to return to the past.\"\n\"You... oh my god, you did,\" Tony said, torn between amusement and horrified. \nSteve huffed. \"He hit you, Tony. I don't like bullies. I never have. He's lucky that I only did it once.\" He sounded angry and sad, a peculiar combination that made Tony's stomach flip over.\nNatasha sat up, skating her fingers briefly down Tony's side. \"We're going to have a movie night in the communal living room tonight,\" she said decisively. \"Pepper, Phil, Rhodey, Jane and Darcy are joining us. We'll keep the lights down and the sound low, but you're coming.\"\n\"What if I don't want to?\"\n\"I didn't ask,\" she replied, sliding off the bed. Bruce squeezed Tony's hand and then let go. Tony opened his eyes finally and tipped his head to the watch the four of them go, fully expecting Steve to join them. But he didn't.\n\"They're not very subtle,\" Tony said, keeping his gaze fixated on the door even after the room was empty. His throat was kind of tight and his eyes were burning a little. What they'd said... it couldn't be true. Could it?\"\nSteve's hand caught the uninjured side of his face, bring his head back around until they were looking at each other. \n\"I'm sorry.\"\n\"What?\" Tony blinked, bewildered.\n\"All those times I brought up Howard... Fury indicated to me that you two had a bad relationship, but I didn't know it was like... that.\"\nTony winced. \"It wasn't a big deal.\"\n\"He hit you -\"\n\"Yeah, yeah, I know. But it wasn't... it was only when he drank, and most of the time it was just once or twice,\" Tony said, deciding that Steve never needed to know about the handful of times when it had gone a lot further. Those memories would go to the grave with him.\n\"That doesn't make it okay. I wish I'd been there.\"\n\"I don't know that you could've made a difference.\"\n\"I would have,\" Steve said with such certainty that Tony had to smile. Steve's eyes softened, the corner of his lips quirking up into something gentle. \"You were wrong, you know.\"\n\"About what?\"\n\"I don't hate you. And it was never just about sex for me. You were always the one who ran away, Tony. You never wanted to go out with me or do anything but have sex in the workshop. The couple of times I managed to coax you into bed with me, you left right after. So I thought... you didn't want anything else. It wasn't because I hate you.\"\nTony stared at him. \"I thought...\"\n\"That you weren't worthy of me?\" Steve asked. \"That's what you meant, isn't it? Not just the team, but me too. That's bull shit. You're one of the best men I've ever met.\"\n\"Okay, now I know I'm dreaming,\" Tony said. Clearly he had a concussion after all and this was the product of a grievous head wound, because it would never happen in real life.\n\"You're awake, and I'm telling you the truth. You are kind, and generous, and you love so much but you never show it. And I couldn't understand why until I saw Howard again, but now I think I get it.\" Steve tried to smile but failed, grimacing instead. \"He was right. You're not his greatest creation. You're a thousand times better than anything Howard Stark could've come up with.\"\nTony was ashamed of the way that the room blurred. No amount of blinking was enough to keep the tears at bay. \"Steve, that's -\"\n\"I know you don't believe me. That's okay. Someday I'll prove it to you. Until then, just know that I don't hate you. I love you, Tony.\" \nA shocked inhale was all Tony was capable of before Steve kissed him. It was easily the least passionate kiss they'd ever shared, all soft and sweet, lips lightly sliding together, but it was the one that affected Tony the most. He hadn't been kissed like that since Pepper: a kiss with no intent, but so much meaning it was scary. He shivered when Steve kissed the corner of his mouth, overwhelmed.\n\"I don't get it,\" he said quietly. \"Why me?\"\nSteve smiled. \"There's no one specific reason. It's lots of things. The way you look when you get your first sip of coffee in the morning. How you treat your robots like they're your kids. How cute you are when you need sleep but don't want to admit it. The way you try to so hard and no one notices, but you keep trying, even when it's burning you out.\" He rubbed his thumb under Tony's eye to wipe away a tear.\n\"I... um...\" Tony swallowed hard. He'd been half in love with Captain America since before he knew what love was, and that hadn't changed after he met Steve Rogers. But he had never, not even in his most well kept, secret fantasies, imagined that Steve would feel the same. Suddenly all those times he'd jumped up from the couch after sex to keep working, or turned Steve's offer of a hamburger or a movie down, or slipped out after sex in bed, seemed like such wasted opportunities.\n\"Your father's an idiot,\" Steve told him, and then he kissed Tony again. \"And so are you, a little, but we'll work on that. Now come on. I heard a rumor that there was going to be melted chocolate with the popcorn.\"\n\"Yeah, okay,\" Tony said quietly, sitting up. His head didn't ache quite so badly, and the room wasn't spinning anymore, but he snagged his bottle of pills and slipped them into his pocket just in case. \"Steve?\"\n\"Yeah?\"\n\"Iloveyoutoo.\"\nThe words came out in such a jumbled mess that Tony wasn't sure Steve would understand, but the brilliant smile and deep kiss he received suggested Steve had gotten the message. Tony felt dazed for an entirely different reason as they took the elevator to the communal floor. This was the first time ever that they were holding hands in front of their teammates, and here Steve was still grinning like a loon, and Tony was... happy.\nCoulson met them as soon as the doors opened. He shoved a file into Tony's face. \"Here.\"\n\"What is it?\" Tony asked warily. \n\"It's an official statement saying that you're an Avenger,\" Coulson said, flipping the top of the file open. \"I did a little investigating and had a talk with Director Fury. It seems that your status was never changed from that of a consultant after the Battle of New York. An oversight, it seems. I took it upon myself to make sure that it was corrected.\" His smile was bland, but his eyes were cold and sharp and Tony would've given his whole fortune up to have been a fly on the wall for that conversation.\n\"Thank you,\" Tony said, slowly taking the file from him. He looked at the top page, hardly able to believe it. This had started out as the worst day of his life, and now it was easily the best.\nCoulson just nodded. \"And Tony, the next time you have so much work that you don't even have time to sleep, tell someone. Now that your status has been changed SHIELD won't be piling so much work on you, but still. It's a lot for one genius to take.\"\n\"I was fully capable of -\"\n\"Save it,\" Coulson said, holding a hand up and rolling his eyes. \"I've heard it all from every agent I've ever met. I'll tell you what I told them. You're part of a team. There's no shame in asking for help.\"\nSpeechless, Tony just nodded. Steve wrapped an arm around his shoulders and gently led him over to a chair, where he sat down and then pulled Tony into his lap. Pepper and Rhodey were already in the room, but both of them knew better than to approach right then. Rhodey just gave him a smile and Pepper winked. \nTony didn't protest, too preoccupied with the file. As far as he knew no one else had gotten anything so official, when they joined the team, which made it seem a little silly. But he didn't care. It was real, proof positive that he was actually an Avenger, and not just because they needed him but - somehow - because they wanted him.\nIf anyone noticed him hiding his face against Steve as the movie started, he hoped they blamed it on the lights. His reputation would be destroyed if word got out that Tony Stark had cried twice in the same day. He was pretty sure Steve knew, but Steve just hugged him even tighter and kissed the top of his head. Tony sniffed and hugged him back, clutching the file against him with one hand."
}