{
    "id": "3792991",
    "url": "https://archiveofourown.org/works/3792991?view_full_work=true",
    "author": [],
    "title": "not so daring",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Daredevil (TV)"
    ],
    "relationships": [
        "Matt Murdock/Franklin \"Foggy\" Nelson"
    ],
    "characters": [
        "Karen Page"
    ],
    "additional_tags": [
        "Friends to Lovers",
        "Demisexual Matt Murdock"
    ],
    "language": "English",
    "series": "",
    "published": "2015-04-21",
    "completed": null,
    "words": "5,874",
    "chapters": "1/1",
    "comments": "236",
    "kudos": "14,242",
    "bookmarks": "2,259",
    "hits": "121,658",
    "summary": "<p>\"Foggy, you need to calm down, this isn’t a big deal, it was in college, it’s not like you’re still in love with me.”</p>\n<p>As soon as Foggy says, “Uh-huh,” he knows he’s fucked. His voice cracks in the middle of it so even without Matt’s freaky heartbeat-lie-detector skills he’d be able to tell Foggy is a dirty liar.</p>\n<p>Foggy wishes for another alien invasion as Matt’s eyes grow wide behind his glasses.</p>\n<p>“Oh,” Matt says.</p>",
    "notes": "",
    "text": "Foggy isn’t paying attention when Karen tells Matt about it.\nFoggy isn’t really paying attention to anything that isn’t his intense game of Candy Crush, and he’s swearing wholeheartedly at the screen when he walks into the next room to find Karen looking mortified and Matt looking confused and both of them staring right at him.\n“Motherfucking candy fuckers can’t even get it right, I pushed the button! Guys, we have to file a lawsuit against whatever evil masterminds make these shoddy cellphone keys that don’t-” He stops as he looks up and sees his friends’ expressions, pausing the game as an afterthought.\n“What’d I miss? Did something happen? If New York is getting rained on by freaky-headed aliens again I swear to god-”\nKaren has her hands over her mouth, her eyes wide and apologetic as she blurts, “Foggy, I am so sorry, I thought he knew!”\nFoggy has his mouth open to ask what the hell are you talking about when Matt says, “When were you in love with me,” bewildered and surprised and all kinds of confused.\nAt first Foggy thinks this is just a weird dream and pinches himself to prove it. Then he says, “Ow,” kind of absently, and shakes the hand he just pinched.\nThey continue to stare at him like he’s a bomb about to go off, and Foggy clears his throat. “Excuse me?” he manages. His voice doesn’t shake, he’s proud of that, he expected that if this ever came into light then his voice would start breaking like he was fifteen all over again.\nHe meets Karen’s eyes, who squeaks and starts apologizing again. “I just, we were talking and I mentioned it and Matt got all confused and then I got all confused because I thought he knew you didn’t tell me not to tell him I really did think he knew I’m so sorry,” she says in a rush, muffled by her hands.\n“Right,” Foggy says faintly. Even though he knows it wouldn’t matter, he can’t bring himself to meet Matt’s eyes. “Okay. I. Am going to go- somewhere. Out the door. And onto the street! And then, I’m gonna, well, who even knows, Hell’s Kitchen is a plethora of, of places to go and things to see. You guys know I’ve never been to that place that ties your ankle and then throws you around in the air, always wanted to do that, I’m gonna go do that-”\nHe’s halfway to the door when Matt stops him with a hand on his arm. “Foggy.”\n“Nope,” Foggy says, shrugging him off. “Nope-”\n“Foggy-” Matt moves in front of him, blocks the doorway every time Foggy makes a desperate attempt to get past him. It’s futile, he knows, he’s heard everything the man in the black mask- Daredevil, now, in the red suit- has done, and Foggy doesn’t stand a chance.\n“I swear to god, I will get to the street via jumping out that window if you don’t let me through right now, Murdock,” Foggy says, a laugh in his voice that wasn’t there before.\n“I’d stop you,” Matt says. He puts a hand on Foggy’s shoulder, drops it when Foggy winces. “I- Foggy, this isn’t a big deal.”\nThe laugh bursts out of him. “Yeah! Yeah, right.” He tries to make another break past him but Matt blocks him easily, giving Foggy a look that clearly says really?\nFoggy waves towards the door, towards sweet, sweet freedom only three feet away. “Come on!”\n“You’re freaking out.”\n“I am not!”\n“You are. Foggy, you need to calm down, this isn’t a big deal, it was in college, it’s not like you’re still in love with me.”\nAs soon as Foggy says, “Uh-huh,” he knows he’s fucked. His voice cracks in the middle of it so even without Matt’s freaky heartbeat-lie-detector skills he’d be able to tell Foggy is a dirty liar.\nFoggy wishes for another alien invasion as Matt’s eyes grow wide behind his glasses.\n“Oh,” Matt says.\nIt’s telling how surprised he is that he lets Foggy go through the door this time. Foggy tries not to let that get to him.\n \n-\n \nKaren calls him until he picks up.\n“I’m so sorry, Foggy,” she says, so fast Foggy has to work to sort the words out. “You just, back at the bar, you said it so casually and you guys are so open about everything else-”\nFoggy laughs at that, remembering Matt bloody and maskless on the couch as Foggy stared down at him.\n“-so I assumed he’d already know,” she finishes. “I am so, so sorry.”\n“Ah, it’s fine,” Foggy says. He pauses. “Well, no, it’s not fine, it’s probably the least fine thing to happen in the history of the entire world and every alternate universe, but I won’t hold you to it. After I finish sulking. During which I will resent you to the point of burning. Like, hellfire levels of burning, here. But then I’ll get over it.”\n“Are you drunk?”\n“You’re a wonderful secretary, y’know that, Karen? Should put your name on the door next to ours.”\n“Foggy, where are you?”\nFoggy lets his head rest on the bar, then regrets it. There are substances sticking to it that he doesn’t want to identify. He lifts his head, starts scrubbing at the place that touched the bar. “I’m on the road to being thoroughly inebriated. That, Karen, is where I am.”\n“I could come and get you? We don’t have to tell Matt.”\n“Ugh, he’s probably all concerned, doing that concerned frown at you right now. You know the one, with the little dent in between his eyebrows. Fuck that dent. I love that damn dent, he looks like a woodchuck.”\nFoggy doesn’t even know what he means by that, but he means it hard.\n“He’s not with me.”\n“What?”\n“He wanted to let you cool down, but about an hour ago he left to look for you.”\n“Shit,” Foggy says, and hangs up. He doesn’t know, exactly, how Daredevil finds people, but he knows he’s good at it.\nHe’s speedwalking through an alley when Matt jumps at him from above and lands a foot in front of him, making Foggy yelp and scramble backwards.\n“What the HELL,” Foggy barks. “You can’t just go- backflipping off of roofs without your Daredevil getup, people will put two and two together-”\n“Foggy. Buddy,” Matt tries, but Foggy blocks his ears and starts walking in circles around the alley, singing as loud as he can.\nMatt watches this for a while, that stupid worried frown on his face, and when Foggy steps on a slippery piece of cardboard and nearly topples over because of it, Matty grabs him and steadies him.\n“Stop it,” Foggy sighs, brushing Matty’s hand off. He groans when Matty gets that look, that kicked puppy concerned look. “Don’t do that, don’t do face things at me. You know I can’t handle the face things, Murdock.”\n“Sorry,” Matt says. “Foggy, you gotta- go home. Sober up. Everything will be better in the morning.”\nFoggy turns his gaze on him. “I’m glaring at you.”\n“I assumed, yeah.”\n“Hey,” Foggy says. “Hey, can you see me glaring at you?”\n“No, I told you. Just shapes, where things are.”\n“So you can’t tell what face I’m making.”\n“No.”\nFoggy pulls the silliest face he can accomplish. “You can’t see this?”\n“No, Foggy.”\n“You’re missing out. I got detention for a week for making this face at my seventh grade maths teacher,” Foggy tells him, and leans against the side of the alley, trying not to think about how many germs he’s probably picking up by doing it. God help him, he loves this city, but sometimes he feels like he should go around in a big plastic bubble so he doesn’t catch hepatitis. “You really didn’t know, huh?”\n“I didn’t know.”\n“Yeah,” Foggy sighs. He tips his head up, pushes it against the alley wall. “I didn’t think so, up until you told me about the whole vigilante thing and how you can kind of not really see and also tell when people are lying because of the heartbeat thing. Thought you knew, after that. After all, I can’t lie to you, right, buddy?”\nHe says the last bit of it with the last dregs of resentment he’s still clinging to, and Matt flinches, this small thing that makes victory roar in Foggy’s chest before it gets replaced by guilt.\n“I knew- that you were attracted to me,” Matt admits. “But a lot of people are attracted to me.”\n“Oh, god, you poor soul.”\n“I’m not-” Matt hunches. Foggy hasn’t seen him look this uncomfortable in years. “I’m sorry you thought you couldn’t tell me.”\nFoggy spreads his arms. “Well, look where it got us! You’re letting me down all awkwardly and then we’re gonna go and be awkward forever, because no matter how much we don’t talk about it, it’s always gonna come up sometime.”\n“We can move past this, Foggy.”\n“Yeahhhh, I don’t think so, buddy,” Foggy says. “’Cause I’ve been trying to get over you since I met you, and it hasn’t worked so far. See, this is why I didn’t want you to know- you’re going to get all guilty about not feeling the same way, and you’re gonna apologize all the time, which will only make things worse. And we’ll say we’re gonna pretend like nothing ever happened, but you’re all with the guilt, man! You’re like a guilt machine, you churn it out like- like a churning thing, butter or whatever. So you’re gonna feel bad about it and it’s gonna eat you up inside until finally you say you can’t do this to me anymore and then we’re gonna go our separate ways all because I can’t get over my big gay crush on you!”\nHe yells the last bit, nods to a few people walking past who look at him funny. Then he looks at Matt, who is all big, miserable kitten eyes and hunched shoulders.\n“Don’t say that doesn’t sound like something you’d do,” Foggy says when Matt opens his mouth. “The guilt thing. Don’t say it’s not going to suck every time you remember about it and know you can’t feel the same way and feel oh-sooooo-bad about poor Foggy, pining away over you.”\nMatt swallows. “Foggy,” he says, and then stops. “I don’t- I don’t feel the same way, not like that, but I still- I still love you. As a friend. And I don’t want to lose you.”\n“Yeah,” Foggy mutters, his throat closing up. He waits until it lessens, says, “I don’t want to lose you either. Which was why I wasn’t going to tell you.”\nMatt sets his jaw. “Things can still say the same.”\n“Yeah, until you get all Catholic on me and say you can’t put me through it anymore.”\n“I- might,” Matt admits.\nFoggy sighs, elongating it out until it turns into a yell. “Okay. Fine, let’s just do this. Let’s pretend nothing ever happened. See how long that lasts.”\n“Okay,” Matt says.\nFoggy sighs again. “Jesus. You look like you just realized you have to strangle everyone you ever loved to save Hell’s Kitchen. Hey, that might happen. Weird shit happens with you superheroes. Come on, help me back to my place and feed me water like you always do.”\nHe slings an arm over Matt’s shoulder, is grateful when Matt doesn’t stiffen. But then again, Matt kind of can’t get any more rigid than he is right now, and Foggy shakes him, just a little. “Nothing happened, remember? This isn’t going to work if you don’t roll with it.”\nMatt nods, lips pinching. “Foggy.”\n“Yes, my fellow heterosexual?”\nThat gets him a small smile, one that vanishes as soon as it appears. “If- if I could love you like that, I would. I’m so sorry I can’t.”\nFoggy lets his gaze linger on his best friend’s face, the miserable set of his frown, his eyebrows, the downturn of his mouth. Then he looks away, claps him on the shoulder. “Yeah, I know you are, buddy. But hey, can’t help what gender you’re attracted to.”\n“Right,” Matt says. Then he goes all stiff and silent again, and Foggy has to keep up a running commentary all the way home.\n \n-\n \nThings, predictably, are awkward for the next few days. Karen dances around the two of them until Foggy yells at her about it, shocking all three of them and causing Foggy to buy Karen some apology cupcakes from the place downstairs.\nFoggy and Matt are more or less normal after Matt stops looking like he wants to apologize for being straight every time Foggy walks into the room. They still touch the same amount as usual, the occasional back-pat and the absent hand on each other when they want to get each others attention. Foggy still finds himself leading Matt places, a habit he can’t seem to shake even after he found out Matt could navigate fine without the cane and could also beat up a dozen guys on his own with no weapons.\nThey still have the same old conversations, jokes, arguments, but sometimes there’s this air that Foggy can’t shake, like when a woman flirts with Matt and Matt hesitates with the knowledge of Foggy beside him before responding.\n“I could stop, if you want,” Matt tells him once, and Foggy sighs.\n“I’m not gonna stop you flirting with hot chicks, man.”\n“But it- doesn’t it-”\n“Hurt? Well, yeah, but most of it’s ‘cause of the tragedy that is you somehow pulling all these beautiful women and not having the sight to appreciate it.”\n“Okay,” Matt says, and Foggy’s getting better at this, at lying without actually lying.\n \n-\n \nFoggy meets Claire about three months after The Thing is revealed when he gets a call from an unknown number.\n“Hello, this is Foggy Nelson.”\n“Matt needs someone to take care of him and I have work in 45 minutes.”\nFoggy pauses. “May I ask who this is?”\nA sigh. “It’s Claire, Matt said he told you about me?”\n“Oh,” Foggy says. “Right, the nurse.”\n“The nurse,” Claire confirms. “Can you pick him up or not, I really have to go soon. I’d leave him to sleep it off, but he’s on painkillers and god knows what he’ll do on them. I don’t want him going out to stop a mugging and falling on his own face because of the pills.”\n“Sure, I can come and get him. Hey, how bad is it this time?”\n“Not too bad. Don’t put any weight on his ribs, though. And do me a favour and don’t let him go out and fight crime for a few days so he doesn’t rip his new stitches again.”\n“Awesome,” Foggy sighs. “Okay, I’ll be there in ten.”\nShe hangs up without a goodbye, but Foggy doesn’t take it personally. He guesses she has a lot on her mind. His phone lights up a second later with her address.\nShe blinks at him when he shows up at her door with a muffin, and looks down at it when he pushes it into her hands.\n“To eat on the road,” he tells her, and her mouth quirks up. “I have an aunt who’s a nurse, she was always complaining she never had time to eat.”\n“Tell your aunt to keep granola bars in her scrub pockets and eat while she walks,” Claire tells him. She opens the door further to let him in.\nFoggy walks in to see Matt on the couch, asleep, shirtless and bandaged in multiple places. He doesn’t realize he’s making a face until Claire says, “He can take worse, believe me.”\n“I’m just,” Foggy says. “I’m not used to seeing him- all beat up like this. But hey, I suppose he’s beat up all the time, just covers it with his clothes.”\nIt doesn’t sit well with him, the new knowledge that his best friend is most likely in pain all the time due to constantly going out and getting hit, or stabbed, and a further colourful of array of hurt.\n“I actually got him to take some painkillers this time,” Claire says where she’s shrugging into her jacket. As she ties up her hair with elastic, she says, “He might be a little loopy on the way home. Get him in bed and he should be up and being stubborn again in six hours. Good luck getting him to take more painkillers.”\n“I’m very surprised he took these ones,” Foggy says. He walks over, crouches down to Matt and flicks him in the forehead.\nMatt groans, rolls his head sluggishly towards Foggy. His face lights up when he sees- or, notices him, grinning in a way that makes Foggy’s stomach clench up.\n“Foggy,” he murmurs, and then reaches out to fondle Foggy’s ear and pat him in the cheek way too hard.\n“Okay,” Foggy says, standing up and trying to get him into a sitting position. “C’mon, buddy, we’re gonna do that walking thing. Can you do the walking thing?”\nMatt groans again as he stumbles to his feet, leaning on Foggy for support. “Where’s- where- Foggy?”\n“You’re at Claire’s,” Foggy tells him. “But she has to go to work and you’re eight kinds of loopy right now, so I’m taking you back to my place so I can make sure you don’t fall out a window.”\nMatt blinks up at him, and then his lips spread in that drugged-up smile again. “Foggy,” he says, and then sways forwards to rub his head against Foggy’s shoulder. “Always takin’ care of me.”\n“It’s not like you need it, what with the crazy crime fighting skills,” Foggy points out. “Come on.”\n“Mrgh,” Matt says, and follows Foggy to the car with the help of Foggy’s hand on his arm.\nMatt leans his head on Foggy’s shoulder the whole way home, and then tries to do it the whole way up to Matt’s apartment, but his head slips off a few times. Foggy may or may not take pictures and snapchat them to Claire, warning her via captions not to get the wrong idea.\n“Do you want me to tuck you in,” Foggy asks when Matty gets into his bed, and Matty shakes his head, shoves a hand through his hair so it sticks up.\n“Nuh,” he says. He keeps making movements with his face, weird ones that Foggy thinks are so he can hear better. “Hey, Foggy.”\n“Yeah, buddy?”\nMatt sighs, lolls his head to look at him. “’M real sorry I can’t love you like you love me.”\nFoggy’s throat clicks and he wonders if Matty can hear that when he’s this whacked out on painkillers. “I told you, it’s fine.”\n“’S not,” Matt insists, and before Foggy can stop him, Matt’s using his strength and weird fighting skills to grab Foggy’s arm and somehow use his legs to get Foggy so he’s lying next to Matt on the bed.\nFoggy draws in a thin breath when Matt gets up on his elbows and leans over Foggy, blinking down at him. “’S not okay,” Matt repeats. “You’re sad, I’ve been making you sad. I never want to make you sad, you deserve to be happy. Y’ deserve to be happy, Foggy.”\n“I am happy,” Foggy says loudly to distract himself from the fact that Matt is leaning over him, close enough to kiss. “Stop with the guilting!”\n“Foggy,” Matt says, sounding sad and distant as his hand lifts to touch Foggy’s face. They did this once before, in college, Matt running his hands over Foggy’s face to get a feel for his features. It was the start of this whole thing, for Foggy, the whole being in love with Matt thing, and Foggy has lost count of how many times he’s jerked off to the memory of Matt’s hands on his skin, feeling his way across Foggy’s face.\nFoggy draws a thin breath in and then he’s pushing Matt’s hand away, getting up off the bed and telling Matt he should sleep.\n“I’ll be watching the door,” he warns him. “So don’t try any ninja crap.”\n“’S not ninjaing,” Matt protests as the door closes.\n \n-\n \nSometimes Foggy wishes for the simplicity of their college friendship- the drunken nights on the town, the wistful plans for the future, sharing cheap noodles and personal space and occasionally beds, staying up studying and then crashing the next day.\nTheir friendship has changed, first because of Daredevil and now because of what they’ve taken to calling The Thing, capitalized even though Foggy’s pretty sure neither of them have ever wrote it down.\nKaren’s in on it, the only other one who knows about The Thing. She tries to talk to them about it sometimes- Foggy always refuses to listen, but he thinks she’s been talking about it with Matt when he’s not around.\nIt makes him cringe, thinking about what they might be saying. And he knows it’s about him, because every time it happens, Matt shoots him these looks that Foggy can’t decipher and doesn’t know what to do with. Which is stupid, anyway, since Matt can’t even see Foggy, just a vague Foggy Nelson-ish shape, so there’s really no reason for Matt to be giving him any looks at all.\n \n-\n \nFoggy gets kidnapped about seven months after The Thing gets revealed, and he’s more pissed off about it than anything.\n“Not just any bad guys,” Foggy hisses as Matt unties his hands. “Incompetent bad guys. I nearly untied this knot myself just sitting here!”\nHe flexes his hands when the ropes finally fall free. “Ugh, thank you. That shit chafed worse than that awful watch-”\nMatt stands up and roundhouse kicks a guy in the face who Foggy hadn’t even seen coming at them.\n“-you got me for graduation, you know the one, it was terrible,” he continues as Matt gets the guy down on the ground. There’s blood coming out of his head, but Foggy can’t see where from exactly. “That watch stopped me from nearly scoring with so many girls, it was that terrible, gaudy as hell, what was I thinking letting a blind dude pick out a watch for me-”\nMatt takes down what Foggy assumes to be the last of the bad guys, but he thought that three bad guys ago.\n“Are you okay,” Matt asks as he’s untying Foggy’s legs. “Did they hurt you?”\n“I can’t believe they knocked me out in my own house,” Foggy continues. “It’s so- cliché, and boring, what, I couldn’t even get a car chase out of my experience as hostage-”\n“Breathe,” Matt tells him, and Foggy realizes that he’s hyperventilating. “Breathe with me, Foggy, it’s okay, I’m right here, I got you.”\n“Yeah,” Foggy rasps. He gasps in a breath, then another, and Matt takes his hand and presses it to his own chest.\n“Breathe with me.”\nThey stay there like that, surrounded with bloodied thugs, Matt’s hand pressing over Foggy’s, which presses into Matt’s chest as it rises and falls.\nWhen his breathing is more or less back to normal, Foggy tells Matt he’s fine apart from a headache, and Matt leads them out of wherever the hell they are, Foggy doesn’t even know, they put a bag on his head. A bag. Like in the movies.\nMatt doesn’t even change, just gets them back to his place to wipe the blood off of Foggy’s face no matter how much Foggy tells him he’s fine, really, he can apply cotton swabs to his face without incident.\nBut Matt stays, taking his mask off when he’s finished, and then he sits there on his couch, white-knuckling the mask in his hands.\n“Hey,” Foggy says. He knocks their shoulders together. “You know I’m fine, right? Just a few bumps and bruises.”\n“They took you,” Matt says, with such intensity that it makes Foggy startle a little bit. “They took you-”\n“My fault for getting involved,” Foggy tries. “Everyone was all, Foggy, don’t talk to the Emmerson witness, they’ll put a hit on you, but did I listen? Noooo-”\n“They shouldn’t have ever fucking touched you,” Matt grits out, shaking now, tiny tremors working their way through his frame. “The one thing- the one thing I promised myself when I put on the mask the first time was that I’d never let them get to you. And I can’t even save you.”\n“You did save me!” Foggy squeezes Matt’s shoulders, tries to get him to look at him before realizing for the millionth time, oh, right, blind. He wonders sometimes if he’s ever going to stop having that realization. “Foggy Nelson, safe and sound! All thanks to our friendly neighbourhood Daredev-”\nThe last part gets cut off by Matt’s open mouth on his.\nIt’s not long, just a few seconds, but Foggy’s brain blanks out entirely. There’s a cut on Foggy’s lip that he hadn’t noticed until just now, and it makes their kiss taste like copper as their mouths move against each other.\nMatt’s hands come up to frame Foggy’s face, hands still shaking, fingers pressing almost too hard.\nThe door opens as their tongues meet, and they jerk apart as Karen storms in, saying, “Foggy, thank god you’re okay, this woman named Claire called and told me-”\nShe trails off, handbag dropping unnoticed to the floor when she takes in the cut-off kiss and Matt’s costume, the mask in his lap where he dropped it to kiss Foggy.\n“I,” Karen says. She wavers on the spot. “What- you-”\n“Close the door, please,” Matt says, strained.\nKaren does, and then comes to sit on the floor as Matt explains the whole Daredevil thing. Foggy offers to go and make tea during this, and spends the next ten minutes sitting on the floor with his head in his hands.\n \n-\n \nFoggy goes home, calls in sick to work for three days and then turns up like nothing happened, because that’s what they do, pretend like everything’s normal and Foggy isn’t desperately in love with his straight best friend. This is what they do.\nBoth Karen and Matt look worried, but Foggy wisely ignores it and goes into his office to start in on the paperwork he’s missed out on.\nKaren and Matt make attempts to talk to him, but Foggy says he’s really very busy and can’t talk right now and takes a long lunch break so he can hide in the bathroom and have a panic attack.\nWhich he regrets as soon as he walks out, because Matt’s looking the kind of tense that lets Foggy know that he definitely heard.\n“I’m fine,” Foggy says when Matt opens his mouth. “I’m dealing. I? Am totally dealing, I am the deal master, master of the deals. And dealing with things.”\nMatt snorts. “Right. Because denial works so well.”\n“Worked for us so far,” Foggy says, and imagines the spike in his heartbeat as it happens.\nMatt’s jaw works, his shoulders go tight. “Foggy-”\n“Do you want doughnuts? Because I would kill a man for a good glazed chocolate-”\n“Foggy,” Matt talks over him. “We need to talk.”\n“No, we don’t,” Foggy says, and starts to leave, opens his mouth to say he’ll get Matt a doughnut as well, except he doesn’t get to say anything because Matt is kissing him.\nFoggy kisses back for a second, unable to stop himself, unable to pull away from something he’s been wanting for so long he thinks it’s pretty much imprinted on his soul, but then everything rushes back and he shoves Matt away.\n“Don’t,” he snarls, and is mortified to discover that he’s close to tears. He swallows, sucks in a breath, hopes Matt doesn’t hear whatever indicators he’s making about the close to tears thing. “Don’t, don’t you dare, you can’t just-”\n“Foggy,” Matt says desperately. “What if I could- love you like that?”\n“Oh my god, don’t do this,” Foggy says, rubbing his hands down his face. “Just, do not, okay? I get that you’re sad about making me sad but holy SHIT do not do this, it’s a bad road to go down-”\n“Hear me out,” Matt says. “Please?”\nFoggy sighs. “I’m glaring at you.”\nMatt nods, and then his hands drop to his sides. His mouth opens, and nothing comes out for a second. Foggy waits, arms crossed.\n“I,” Matt says, and then clears his throat. “Since you told me-”\n“Karen told you, I got dragged along in this.”\n“Since I found out,” Matt says. “I’ve been- thinking. About us. Mostly about you. And about how sexuality is fluid, and-”\n“Matt, come on-”\n“Karen gave me some books to read-”\n“This is so embarrassing.”\n“-which helped me realize I’m demisexual.”\n“Wait, what?”\n“Demisexual,” Matt says. “It’s-”\n“I know what it is, Matt.”\n“Right, good, but that’s, that isn’t the point, the point is that I never considered the possibility that I could love you like that,” Matt blurts. “And I didn’t think I could. But, but since you told me, I’ve been thinking, and I tried to get myself to feel the same way, and I tried so hard to force it, but then Karen told me something and I realized- Foggy, I think I’m already in love with you. I think I was before I found out you were in love with me-”\n“Crap, yeah, I can’t do this,” Foggy says, and tries to shoulder his way past him to the door, why does he always let Matt stand in front of the door, but Matt gets in the way, grabs his shoulders.\n“I think I’ve been in love with you for years,” Matt says. “I just didn’t realize because I didn’t think I could feel like this for a man.”\nFoggy chews furiously on his cheek so he doesn’t start crying. “Matt. I appreciate what you’re trying to do, but trust me, you are not in love with me. You’re in friend love with me, which is a whole other and completely valid thing, and it’s not your fault that you can’t love me the way I- the way I want you to.”\n“But-”\n“Don’t do this,” Foggy pleads. “Don’t- god, do you know how much it’d hurt if I actually believed you and we got together and you broke up with me somewhere along the line because you finally gave in to the fact that you aren’t in love with me? Or, god forbid, you stayed just because you didn’t want to lose me as a friend! You would do that, Matt, don’t say you wouldn’t.”\nMatt shakes his head. “I wouldn’t.”\n“You would.”\n“I wouldn’t, I respect you too much.”\nFoggy makes a noise of frustration through his teeth. “YOU ARE NOT IN LOVE WITH ME.”\n“I am,” Matt says determinedly. “I’ve put a lot of thought into it.”\n“Oh, you’ve put a lot of thought into it!”\n“Don’t you trust me?”\n“I trust you with everything, asshole,” Foggy snaps. “But I also trust the fact that you’d feel so bad about not being able to love me back that you’d- convince yourself you were in love with me, that you have been for years.”\n“And I’m telling you I wouldn’t! If it makes you feel better I’ll get a lie detector-”\n“A lie detector, fuck off, you can probably- control your heart rate or some shit to fake it-”\n“How the hell would I be able to do that?”\n“You’re blind and you fight crime, I don’t know what else you can do! Can you fly? Can you set fires with your mind? I just don’t know!”\n“What will it take for you to believe me, Foggy?”\nFoggy draws a shaky breath, lets it out even more shakily. “I don’t know.”\n“Tell me and I’ll do it.”\n“I said I don’t know, jeez,” Foggy says weakly. He rakes his hands through his hair, sighs loudly. “Stop staring at me! What do you even want, Matt?”\n“You,” Matt says instantly. “Your friendship, and in the last several months I’ve realized I also want a relationship. Why is that so hard for you to believe?”\n“Because I know you,” Foggy says. “Also, you are way out of my league.”\nMatt frowns. “That’s not true.”\n“You’re blind, what would you know?”\n“I know you’re kind. I know you’re funny, and loyal, and you try to cheer people up even if you don’t know them or why they’re sad. I know you’re witty, and generous, and selfless, and hardworking, and you’ve stuck by me through everything. I know you’re the best friend I’ve ever had, and that I love you, and that I’m in love with you, and I know that in time you’ll believe it. And when you do, I’m going to be there waiting for you.”\nFoggy stares, trying to find something, anything to respond with. Finally, he goes with, “With how our luck’s been recently, it’ll be five seconds before I die dramatically in your arms.”\n“Don’t say that.”\n“It’d be very poetic, you’d scream my name into the sky and vow revenge-”\n“Foggy,” Matt says with a hint of a smile, and Foggy sighs.\n“I’ll consider your proposal, Mr Murdock.”\n“That’s all I ask, Mr Nelson,” Matt says, and the bastard walks off grinning.\n \n-\n \nMatt is quietly persistent about it, tossing in ‘love you’s and getting the occasional kiss in, but Foggy doesn’t believe, not really, until Matt has a run-in with a beam that gives him his sight back for half an hour.\nFoggy is all but vibrating on the spot when Claire tells him this, and also tells him that the first thing Matt did when he found out is head to Foggy’s place.\n“Great,” Foggy croaks. “I’ll just, uh. Wait for that then.”\nHe hangs up and goes to the mirror, stares at his reflection for a while and then combs his hair when he realizes he has no idea how to make himself look better other than brushing his hair. Then he goes back to the lounge, picks up a book and pretends like he isn’t glancing up at the door every ten seconds. When the knock finally comes, Foggy doesn’t even bother with a bookmark since he wasn’t really reading anyway.\nHe unlocks the door, opens it and there’s Matt, whose face utterly transforms when he sees Foggy. He was already smiling when the door opened, but- god. God.\n“Hi, Foggy,” Matt breathes, and fuck, Foggy didn’t even know that look existed, that anyone could have that much love poured into one expression.\nShit, Foggy thinks distantly. “You love me.”\nMatt keeps staring at him, grinning hard. “Very much, yeah.”\n“Huh,” Foggy says. “Well, that’s- okay, then. Do you want to go look at more things or-”\n“I’d look at you forever if I could,” Matt says, and Foggy swears under his breath before dragging him in to kiss him.\n“You kept your eyes open during that, didn’t you,” he says when he pulls back.\n“Yeah.”\n“Fair ‘nuff,” Foggy says.\n“I love you,” Matt tells him, and Foggy rolls his eyes, says, “Yeah, yeah, you too, now c’mere.”"
}