{
    "id": "38023123",
    "url": "https://archiveofourown.org/works/38023123?view_full_work=true",
    "author": [
        "Vamillepudding"
    ],
    "title": "The French Mistake",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "Batman - All Media Types"
    ],
    "relationships": [
        "Tim Drake & Bruce Wayne",
        "Dick Grayson & Bruce Wayne",
        "Jason Todd & Bruce Wayne",
        "Bruce Wayne & Damian Wayne"
    ],
    "characters": [
        "Bruce Wayne",
        "Tim Drake",
        "Jason Todd",
        "Dick Grayson",
        "Damian Wayne",
        "Alfred Pennyworth"
    ],
    "additional_tags": [
        "Alternate Universe",
        "Dimension Travel",
        "Bruce Wayne is a Good Parent",
        "Bruce Wayne is a Bad Parent",
        "Child Abuse",
        "Hurt/Comfort",
        "Tim Drake Needs a Hug",
        "Dick Grayson Needs a Hug",
        "Everyone Needs A Hug"
    ],
    "language": "English",
    "series": "Part 1 of The French Mistake(s)",
    "published": "2022-03-28",
    "completed": "2022-04-04",
    "words": "27,791",
    "chapters": "3/3",
    "comments": "826",
    "kudos": "14,706",
    "bookmarks": "4,047",
    "hits": "111,921",
    "summary": "<p>The universe Bruce wakes up in has superheroes, aliens and, somewhat more strangely, it also has four children living in Wayne Manor. </p>\n<p>Bruce Wayne is almost forty. He's been an innovator, a philanthropist and GQ's Most Wanted twelve years counting. He doesn't <i>remember</i> being a dad. But now that he is, he's going to be the best dad one could possibly be.</p>\n<p>Or: Batman is a dick. AU-Bruce saves the day.</p>",
    "notes": "<p>Very excited about this fic! Thanks as always to <a href=\"https://archiveofourown.org/users/cynassa\" rel=\"nofollow\">cynassa</a> who bravely endured me talking about Tim so much!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>Only one more chapter to go! I hope you enjoyed this. Let me know what you thought!</p>\n<p>Final chapter! Enjoy.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>And then Bruce takes his kids to see the Grand Canyon and Tim gets an ice cream cake and everybody finishes high school and Batman can suck it.</p>\n<p>Thanks for reading!</p>\n<p>Thanks for reading! I'd love to hear what you thought.</p>",
    "text": "Bruce wakes up not to the sound of his alarm, but to somebody poking his thigh repeatedly with a sharp blade. It’s not forceful enough to actually injure, but it hurts, though not as much as his chest. Why does his chest hurt?\n“Is he awake?”\nI’m awake, Bruce wants to say, but nothing comes out of his mouth.\n“I think he’s still asleep.” That’s a different voice, also masculine, deeper and significantly older than the first. “Stop bothering him, Damian.”\n“If Father wanted me to stop bothering him, he can tell me himself.” \nFather?\n“Alright,” somebody says, and, oh, that’s a third voice, “I’m out of here. Don’t call me again unless he's literally dying.”\n“He was,” says the first voice, “literally dying, Jason. It’s only thanks to Tim that he survived.”\n“Anyone can jump in front of a bullet,” says the kid who’s called Damian. He sounds disdainful. “I would jump in front of many bullets for Father.”\n“This,” Jason says, “is exactly why I don’t answer Bruce’s calls, in case you were wondering.”\n“Jason,” the first person says, sounding weary, “you don’t answer Bruce’s calls because you don’t want him to lecture you on what body parts are and are not acceptable to leave in front of a police station.” \n“Which body parts are acceptable?”\n“None of them,” the first person says at the same time that Damian says, “It depends.”\nDepends on what, Bruce wants to ask, but he’s already falling back asleep, and besides, there’s a much more important question on the tip of his tongue. \nWhatever happened to him, and whatever caused this apparent amnesia he is experiencing – how many kids did he forget having?\n*\nThe next time he wakes up, he is alone. The room no longer smells like disinfectant and death, so it’s safe to say that he left the hospital, and indeed, when he opens his eyes he finds that he is in his bedroom at the manor. There’s something wrong with it, though. The furniture is all the same, but the walls are bare, and so is the night stand next to his bed. Was the earlier conversation a fever dream? A hallucination? It must have been, because surely, if he really does have a gaggle of children he cannot remember, he would have put up pictures of them. \nBruce reaches for his phone, types in the passcode – and frowns. \nWrong passcode. \nAmnesia, he thinks again, and definitely affecting several years, if not decades, of his life. That’s the only explanation for this newfound family, and it would also explain why he changed his phone’s passcode.\nBut Bruce has always enjoyed puzzles, and he likes to think he’s quite good at them, too. And he doesn’t need to know his passcode in order to check the time and, more importantly, the date. \nIt's 11:23 am, June 7th. It was June 6th when he went to bed. \nThe year is the same. \nTwelve hours. He has missed twelve hours. \nFor lack of anything better to do, Bruce tries the passcode again. Still wrong. \nHis thoughts are interrupted when the door opens, and a dark-haired boy walks in. Blue eyes, pale, doesn’t look older than fourteen, but carries himself like an adult. Damian? \nThe boy startles when Bruce shifts, clearly surprised to see him awake. His eyes flit uncertainly to the door.\n“Good morning,” Bruce says before the kid can bolt. \n“Bruce,” the kid says, and Bruce knows that whoever this is, it’s not one of the people who were at his hospital bed last night. “I-“ He sways, suddenly, and as he does, Bruce remembers something else from last night. \n“Did you take a bullet for me?” he asks, and gets his answer when Tim straightens, his expression smoothing out until his face reveals nothing. \n“The mission required it.”\n“Sure,” Bruce says carefully, keeping his tone even, both to soothe and to hide that he has no idea what mission Tim is referring to. “I’m just surprised to see you walking around.” \nAt this, Tim, if possible, stills even more, doing his best impression of a statue. “I wrote my report as soon as we returned to the Cave yesterday, and it’s a Sunday. I don’t have a meeting at Wayne Enterprises until tomorrow.”\n“Sure,” Bruce repeats. It occurs to him that Tim is standing as far away from him as possible, close enough to the door that it wouldn’t take more than a step to leave. Slowly, making sure that Tim can track each movement, he lifts a hand and makes a wavey motion that he’s seen people do on TV. “Come sit with me.”\nTim comes, his suspicion obvious. Following Bruce’s encouraging nod, he sits down on the very edge of the bed. Bruce hides his smile. He remembers being a teenager, remembers a time when every second spent at home and talking to Alfred came close to torture. At least one of his children must be the same. \n“All I meant,” he says, “is that you were shot less than a day ago. You should be on bedrest, not sneaking around.” And, since Tim is still eerily silent, still holds himself eerily motionless, he adds, “I’m worried about you, son.”\nTim’s head snaps around comically fast. Several seconds pass as he stares at Bruce, who makes sure to smile back supportively. His smile falls when Tim stands up. \n“Nightwing,” he says, and it takes Bruce a moment to realise Tim is talking into an earpiece. “Come back to the manor immediately. We need to check Batman for head trauma.”\n*\nBruce lets them run several scans, allows them to draw his blood for a toxin check, correctly answers all questions about his name, the date and the current president, and in between he keeps asking after their wellbeing and whether Damian needs any help with his homework and if Tim is sure he doesn’t want to go back to bed. He also, very subtly, examines his surroundings as though seeing the Batcave for the very first time. \n“Amnesia,” Dick declares once they have distracted Bruce (in other words, gave him today’s crossword) and have gathered out of earshot. “It must be.”\n“He got all our questions right,” Tim protests. Dick already opens his mouth to object, but then help comes from an unexpected corner. \n“Ten minutes ago, that man recommended an “educational, yet spirited” animated movie to me.” The air quotes are audible, even though Damian has not actually moved. “Amnesia does not create new memories. Father would never stoop so low as to watch television.”\n“Or at least admit to it,” Dick says. He taps his finger against his lip, which Tim knows Dick stole from a tv show about detectives. It’s not a very good show. As soon as Tim has finished season seventeen, he plans to send a stern letter to the producers detailing all the plotholes. \n“Mind control,” Damian suggests, as if they haven’t checked for that like, seven times already. \n“Midlife-crisis,” Tim offers.\n“An evil doppelganger,” Dick says. Tim has to admit it’s the most plausible theory so far.\n“Boys,” Bruce calls out, and all three of them freeze. But his eyes aren’t shooting lasers, and he isn’t throwing knives at them. Instead, he holds up the crossword. “Ten-letter word for dubious, starts with s?” \nTim narrows his eyes at him. “Suspicious.”\n“That’s the one,” Bruce says, scribbling it down. “Good job, buddy. Want to come help me with the rest?”\nAnd- \nClearly there is something wrong with Bruce, and clearly somebody should, at some point, take care of this, and clearly that somebody is going to be Tim. \nBut Tim likes crosswords, and Bruce has never asked for help before. \nHe ignores the disbelieving looks Damian and Dick are shooting him, and walks over.\n*\nDick Grayson, Jason Todd, Tim Drake and Damian Wayne. Those are his sons. Those four boys are Bruce’s sons. He has found adoption papers for two of them, and he thinks he might have kidnapped Tim because he distinctly remembers the Drakes to be his next-door neighbours, and he has found absolutely nothing on where Damian came from, but it doesn’t matter, because overnight, Bruce has turned from not-a-father into a father-of-four, and he could not be happier. \nWhile he has been snooping around the whole day to find out more information on his children, his children have happily embraced his distraction to do some snooping of their own. Bruce doesn’t mind. He wishes Dick didn’t pretend to hug him in order to take some of his hair. If Dick wants a hug, he can just ask for it, and if he wants Bruce’s hair, he can just ask for that, too. Bruce is fairly sure he would give his firstborn (his firstborn!) just about anything right now. \nHowever, besides being a father (a father!), he is also a reasonable man. He knows this can’t go on, and the boys are definitely getting suspicious – at least, three of them are. He hasn’t seen Jason yet, and since his phone is still locked, he has no chance of calling him, either. How often does he normally call Jason? Once a day? Every two days? Maybe Jason will call on his own, and then Bruce can answer. He keeps his phone close, just in case. \nThat’s a problem for later, though, or at least for whenever Jason calls. For now, he needs to confide to somebody. And since he is an adult, and this is an adult problem, he confides to the one person in the house who is a) also an adult, and b) familiar to Bruce. Even though the last time he checked, that person had also died more than five years ago.\n“Coffee, Master Bruce?”\n“Tea, if you don’t mind,” Bruce says as he takes a seat. Something is frying on the stove, and the whole kitchen smells heavenly. “Need a hand with that, Alfred?”\nAlfred looks, for lack of a better word, alarmed. Bruce has missed him so much he can’t breathe. “I thought we had mutually agreed to each stick to our own jobs after the last meatball incident, sir.”\nAh. Bruce winces at the empty gap that is where surely his memory of any such incident should be. Maybe he hallucinated Alfred dying. Maybe this is a nervous breakdown. It must be. \nHe takes a sip of the steaming tea Alfred has poured for him, swallows down the pain and says, “That’s actually what I came to talk to you about.”\n“Meatballs, Master Bruce?”\n“More or less,” Bruce says, and then he figures, screw it, there is no good way to say this, so he might as well just go for it. “I’ve forgotten the existence of my sons and I’m worried it’s turned me into a bad father.”\nAt the first part of that sentence, Alfred had seemed unperturbed, but at the second part, his eyebrows shoot up. He is exactly like Bruce remembers.\n“Am I a bad father?” Bruce asks desperately.\nAlfred clears his throat. “If you don’t mind me saying, sir – you’ve certainly never worried about it before.” \nThat’s not an answer, and Bruce recognises it for the evasion it is. He buries his face in his hands, tea forgotten, and mutters, “How am I supposed to raise four children when I can’t even remember their birthdays?”\n“Mine is July 19th,” Tim says, entering the kitchen and plopping down on a seat that’s, though still out of Bruce’s reach, not as far away as it could be. Bruce counts this as progress. “Also, I’ve- what are you doing?”\nWrong password.\nBruce stares dejectedly at his phone. “I thought your birthday might be the code, but it’s not.”\n“Give it here.” Once Bruce has placed the phone in Tim’s hand, he quickly types in four numbers and hands it back to him. “Whose birthday is it?” Bruce asks. \nTim snorts. “Nobody’s. It’s the day your parents died.”\n“What,” Bruce says.\nTim gives a delicate shrug, faux-casual, but Bruce doesn’t miss how he shifts himself just a little bit more out of reach. “I’m not really supposed to know about it, but my theory is that you use it to remind yourself that pain never stops. Actually,” he quickly says before Bruce can react, “this is great stuff, because it confirms my theory.”\n“Your theory,” Bruce repeats flatly.\nHis son (his son!) nods three times in quick succession. “You know all the basic information, like the date or the president, but you’ve also gained a new knowledge in some areas while lost it in others. Losing information can just be memory loss, but why would you be familiar with a movie that’s only just been released? Why are you drinking tea instead of coffee?” Tim points at his cup almost accusingly. “And your passcode – why would you forget that? All your bloodwork came back clear, so first we thought that maybe you’re a clone, but that doesn’t explain your selective memory. Dick suggested time travel, but earlier you looked like you’ve never even seen the Batcave before – and I think that you haven’t. I think that you’re Bruce Wayne from an alternate universe. A universe where Bruce never became Batman, and definitely one where he never had a Robin. Also, apparently, one where he doesn’t like coffee.” Tim has said all of this in a rush and now takes a deep breath, his eyes gleaming. \nBruce is happy that Tim is so obviously pleased about his theory, but he also has to ask. “Tim,” he says slowly, “you’ve had a long day, and you’re still suffering from a significant injury. Do you think perhaps you’ve just had a nightmare, son?”\nTim does not look contrite. Tim looks like he cannot believe what Bruce just said. “Oh my god,” he says, “Batman is gaslighting me. Alfred?”\n“On it, Master Timothy.”\nThe last thing Bruce feels is a syringe in his neck.\n*\nThe powerpoint has 493 slides and is titled WHY YOU ARE IN A DIFFERENT TIMELINE (AND I’M NOT CRAZY). It has thirty-three slides less than the powerpoint Tim made earlier this afternoon for Dick and Damian, titled WHY BRUCE IS FROM A DIFFERENT TIMELINE (AND I’M NOT CRAZY). He thinks Jason would have appreciated it, maybe, but Jason is not answering anyone’s calls. Again. \nTherefore, this all depends on Tim. \nAgain. \nTo be fair, Dick had believed him at around slide no. 100, or at least he pretended to in order to get Tim to stop, and Damian, for the first time ever, didn’t even oppose him in the first place. He seems, also for the first time ever, to believe him and Tim to be on the same side – them against this strange man in their house, them for getting the real Bruce back home. \n“I don’t know how to get him home,” Tim had said, trying and mostly failing to be reassuring, “but we’ll figure it out.”\nThat had been an hour ago, before Tim confronted Bruce in the kitchen, before they had to sedate Bruce and tie him to a chair. The real Bruce would be furious with them, with all of them, but especially with Tim. \nOther Timeline Bruce is starting to come to, eyelashes fluttering, and Tim nervously flexes his fingers. \n“Look,” he says, “I know you’re probably like, super mad, but-“\nBruce does not appear to be listening, his eyes fixed on the screen behind Tim, where the title of the powerpoint presentation can be seen. From behind Bruce, Dick gives him an encouraging thumbs up. Tim wishes Dick would stand by his side, but somebody has to stay close to Bruce in case anything goes wrong. \n“So,” Tim says, clearing his throat, “I’ll try to make it quick-“ – Dick snorts – “and if you have any questions, feel free to interrupt. So. Um.”\nThis is so weird. Tim is normally fairly good at public speaking, but somehow, right now, Bruce’s gaze on him feels heavier than usual. More likely to judge. Maybe because he knows what to expect from Real Bruce, what sort of behaviour is more or less likely to disappoint, but this Bruce is an unknown variable. It’s way easier to get something wrong, to mess up, and then Tim will-\n“Hey,” Bruce says, cutting through his thoughts. “Relax, kiddo. It looks like you’ve put a lot of work into this presentation, right?”\nTim frowns. He supposes he has, though it hasn’t been more effort than normal.\n“Well, I’m excited to hear it.”\n“Um,” Tim says, because maybe Bruce hasn’t understood what’s going on. Maybe this Bruce is stupid. “We tied you to a chair.”\n“And very effectively, too. I can’t move my arms at all. Who did the knotwork? Was it you?”\n“It was me,” Dick pipes up from behind him. Bruce tries and fails to turn around, but he smiles anyway.\n“Well done. Excellent job.”\nDick freezes for a second, before beaming as widely as Tim has ever seen him. \nThe distraction actually did a good job calming his nerves, and thus he starts his presentation. Throughout it all, Bruce is attentive and even interested, nodding at times as though to underline the point he’s making. He sits through all the 493 slides without complaining once, and when Tim is finished, he says, “Alright, I believe you.”\nThis makes Tim pause. “Really?”\n“You made a convincing argument,” Bruce says and then looks Tim in the eyes, face serious, as he says, “But I feel like I should point out, just to be on the same page, that you didn’t need to go through all this trouble. I would have believed you no matter what.”\nThat is obviously bullshit, because Bruce had literally questioned him like, two hours ago. “You literally questioned me like, two hours ago,” Tim says. “You told me it was a nightmare.”\n“Because you’re a child who got shot yesterday.” Bruce’s voice is calm, patient. “But you’re right, I did question you, and I was wrong. For that, I apologise.”\nTim stares at him, and continues staring until he feels like his heart is beating fast enough that it’s going to jump out of his chest. Blood is rushing in his ears, and he is pretty sure he couldn’t talk right now even if he wanted to, because Bruce has never apologised to him before. Not once. \nIf he was still unsure whether his theory is correct, then this would be the moment that convinced him. \n“I do have one question, actually,” Bruce says, and Tim, still feeling like his world has just fundamentally shifted, nods at him. “Who’s Batman?”\n*\nBruce has, apparently, swapped places with himself from an alternate timeline. Not actual places, just their consciousness, since his body has well over a hundred scars he does not remember, as well as a knife wound in his chest that he is still recovering from. Dick told him that once Tim took that bullet for him, Bruce got stabbed. \nWell. \nWhat he said, specifically, is, once Red Robin took that bullet for him, Batman got stabbed. \nBecause in this timeline, Bruce is a superhero. \n“Not a superhero,” Dick corrects him wearily, and not for the first time. “A vigilante.”\nBruce is a superhero, and he has a nemesis, like Captain America and Hydra. \n“You are not like Captain America”, Dick says. “Captain America has super strength. If anything, Superman is Captain America.”\nBruce has entered a world where men call themselves Superman or dress as giant bats, and they also get their children to fight for them. It’s that point that grates on him the most. He could not care less what an alternate version of him does with his time, and if he wants to become a superhero, why not, Bruce himself once considered joining the cops before he realised that would mean carrying a gun. But.\nBut. \nRed Robin took a bullet for him. \n“And Tim,” he asks, keeping his tone quiet even though Tim and Damian had left him and Dick alone for this discussion, “is my…sidekick?” \nAnd then Dick says, “Oh, no.”\nHe says, “Tim hasn’t been your sidekick in more than a year.”\nHe says, “We gave that role to Damian.” \nDamian. Who recently celebrated his tenth birthday. (Bruce needs to get him a present.)\n(Bruce needs to get all of them presents. There are so many birthdays he missed.) \nDamian, who, when pestered enough, showed him his math homework. They’ve only just started with decimals in school. \nBruce made a kid who barely knows what decimals are his sidekick. \nWeary, because at this point, he can’t be anything but, he asks, “What about you?” \nDick tilts his head, confused, before it dawns on him. He beams. “I’m Nightwing. I was the first Robin, actually, but that’s a long time ago now.” He launches into a story about one of their first adventures together, and Bruce tries to listen, he really does. But all he can think of is, how old was Dick when that happened? Did he know what decimals are? \nWhat on earth possessed him to make not just one, but three kids into mini-superheros and allow them to fight criminals? \nWait. \nHe doesn’t have three kids. He has four. \nHe waits until Dick has finished, and gently interrupts him before he can start the next story. “What about Jason?”\nHe doesn’t think he imagines the way Dick pales. “Jason? What about him?”\n“Was he Robin, too?”\nDick scratches his neck, evidently uncomfortable. He doesn’t meet Bruce’s eyes as he says, “Yeah. Jason was Robin, too.”\n*\nJason is busy hacking through a guy’s neck with a saw when the call comes. He ignores it, set on finishing this job before he can go home and sleep for a week, but then somebody says, “Red Hood” right into his earpiece, on a comm line that nobody should have. Then again, Tim has never much cared about that. \n“I’m kind of in the middle of something,” he says and curses when some blood splatters on his mask. Getting blood stains out of clothes sucks. “Don’t hack my comm again.” \n“You’d have an easier time of it if you used a bone cutter,” Tim tells him obnoxiously, confirming that he’s hacked the cameras, too, like the little creep he is. Jason snorts. \n“Don’t let the big bat hear you say that.”\nThere’s a brief silence at the other end of the line. Jason uses it to finish up and putting the severed head in a bag. A jute bag, because he cares about the environment. He’s not an asshole. \n“Have you talked to him recently?” Tim finally asks, sounding oddly uncertain.\nJason snorts again. “You know I haven’t.” \n“You should. He’s- I think it’s best if you come to the manor. See for yourself.” \nJason shoulders the bag, delivers a kick to the headless body at his feet, and says, “You’re going to have to do better than that, replacement” before dropping his earpiece in a puddle. He is getting angry again, the kind of angry that makes him want to pick up the saw again and cut off a few more body parts. He knows when he’s being manipulated, but you’d think that Tim would at least try. He’s so earnest in everything else, but he can’t even bother to properly lie to Jason? Does he think Jason is an idiot? \nNo, Tim is smarter than that. This has to be part of a ploy. Reversed psychology or something. Well, Jason is not going to play into it. He’s staying as far away from the manor as possible, and the next time Tim hacks his comm, he’s going to have another thing coming. \nLess than twelve hours after the call, there’s a knock at his door. The door of his safehouse. The safehouse that nobody knows about.\nOf course.\nJason has his gun out before he can fully think it through. This time, he promises himself, there’s going to be blood to pay, and Tim won’t- \nIt's not Tim standing outside his door. \nIt’s Bruce, wearing a hoodie that says Superman and a hopeful expression on his face. Somehow, it’s the stupid hoodie that makes Jason not slam the door immediately.\n“Jason,” Bruce says, and it is Bruce talking, not Batman. For a blissful and also crazy weird second, it’s like his dad is back. \nThen Bruce asks, “Is that blood on your shirt?” and the spell is gone.\n“What if it is?” Jason demands. “Going to arrest me? I have a gun here that says otherwise.”\nBruce blinks. “Do you have a licence for that?” he asks, before chuckling. \nChuckling.\nBruce just chuckled. \n“Sorry, I keep forgetting – you’re all superheroes. You probably don’t need a licence. Still, though, are you injured?”\n“Am I- what?” Jason asks slowly. His mind is still stuck on the superhero thing. \nBruce shoulders his way in, just shoving past Jason, who is too confused to do anything but let him pass. He makes his way into the bathroom, Jason following, and starts opening cupboards. “Where do you keep your first aid kit?”\n“Bottom drawer,” Jason says. What is happening?\nBruce opens the bottom drawer, makes a sort of aha noise upon successfully spotting the first aid kit, and motions for Jason to take off his shirt. Jason complies on instinct. \nThe next few minutes pass in a rush: Bruce shaking his head at the stab wound and Jason’s poor attempt at bandaging it, Bruce looking wide-eyed at the many scars that mottle Jason’s torso, Bruce disinfecting the wound and rewrapping the bandage, Bruce ruffling Jason’s hair and telling him that he should go to bed and Bruce will be back soon with ice cream.\nAt this point, Jason is more or less convinced that this is a fever dream. \nHe goes to bed.\n*\nTwo out of four children are currently injured, and while one is safe in the manor, the other is, well, more or less safe in a rundown house in downtown Gotham. Since Bruce himself is currently also in said rundown house, and is therefore several miles away from the manor and his other injured child, he calls Dick and tells him to stuff Tim and Damian into one of the cars and come here. \n“Get ice cream on the way,” he says. “As much as you want, and make sure there’s enough for Jason, too.”\n“Wait a minute,” Dick says. “The address you just gave me – is that Jason’s address?”\n“I’ll see you soon,” Bruce says and hangs up, but not before adding an, “I love you”. Verbal affirmations of love and cherishment are important. \nDuring the time it takes for Dick to manage his brothers and acquire ice cream, Bruce walks around the house – safehouse – and takes a note of everything that’s missing. There’s a microwave, but no kettle. There is only one towel. There is toothpaste, but only the cheap kind. There is a lot of instant ramen in the cupboards. Bruce frowns at all of this and is still busy writing out a grocery list when the door opens. \nHe doesn’t miss that nobody rang the bell. \nDamian straightens, his hand casually falling to his pocket like he is not putting away a lock pick. Behind him, Tim and Dick are carrying five cones of ice cream between them. Tim has evidently practiced better self-restraint than Dick, who is halfway through eating his own ice cream and, since he needs both hands and can’t wipe his mouth, has chocolate all over his face. \n“Did Todd kidnap you?” Damian demands. He glances from Bruce, to Jason’s sleeping form on the bed, to Dick, his gaze turning accusing. “You said Todd kidnapped him.”\n“Possibly. I said possibly kidnapped him. If I had been one hundred per cent positive, would I have stopped for ice cream first?”\nDamian scoffs and turns to Tim. “Drake. Prove that you’re not completely useless and hand me my cone.”\nEven from where he is sitting at Jason’s bedside, Bruce can see Tim’s shoulders tensing, can see him reading himself for a retort. It’s easy enough to guess how this might go on: Tim will retaliate, Damian won’t let the insult stand, at some point somebody is getting an ice cream cone shoved in their face, and all of this would be very healthy sibling fighting if not for the fact that for the three days Bruce has been in this timeline, he has already seen the malicious nature to it. \nOne way or another, this stops now. \n“Damian,” he says, more sharply than he ever has. Both Damian and Tim come to attention. Dick, looking uncomfortable, subtly tries to wipe his mouth on his t-shirt. “Apologise to your brother.”\nDamian sneers. “Drake is not my brother. He-“\n“Damian.”\n“As the blood son, I-“\nBruce crosses his arms and waits. He can be very patient when he needs to be, and right now, he knows that if Damian goes for the waiting game, that’s a game that Bruce is going to win. \nA minute passes, maybe more. The silence grows tenser with each second, and so does the unhappy look on Dick’s face. But he’s not going to interfere, and that’s all that matters.\nFinally, Damian breaks eye contact. He mumbles something, too quiet to make out, but Bruce distinctly hears a “sorry”, and that’s enough. \n“Come here,” he says. In the background, Tim is staring at him like he’s grown a second head, and Bruce is going to deal with that in a moment, but for now, he needs to make sure his lesson sticks. \nDamian reluctantly sits down next to him on the bed. It is clear to Bruce that what they need to discuss is not going to work with people listening in. He wants Damian relaxed, not on edge, or at least not more on edge than he already is. Jason is still asleep, but as for the others- \n“Take a walk.”\n“Excuse me?” Dick says, but Tim, a resigned look on his face, turns and is out the door within seconds of the request. Dick looks from him to Bruce, unsure, before cursing and going after Tim. The door shuts behind them, leaving Bruce and Damian to privacy, or at least to as much privacy as they’re going to get. \n“Damian,” he says, “I’m going to tell you something that I haven’t told any of the others. Can you keep a secret?”\nDamian nods stiffly. Bruce hadn’t expected anything less. \n“Four days ago,” he says into the quiet of the room, “I had no children. This didn’t make me upset. It wasn’t that I actively chose not to have kids, it’s just that the timing never quite worked out. That’s just how it goes, sometimes. I didn’t mind. There are bigger problems in the world than not being a parent. But when I woke up in this universe, and realised that not only am I a father, but that I’m a father of four, I could not have been happier. When I grew up, I always wanted siblings. I was overjoyed by the fact that my children would grow up to have not just me, but each other.” \nHe pauses, making sure that Damian is looking at him, before continuing. “I’m a father of four, not a father of one. Blood doesn’t matter, paperwork doesn’t matter. I don’t care if we ever drew up official adoption paperwork, or if the other version of me kidnapped his neighbour’s kid-“\n“What?”\n“-my point is that what matters is what’s in the heart. And I, for one, know that I love all of you equally. Do you understand?”\nThis silence is even longer than the last. Eventually, though, Damian bows his head. “You love us,” he says. “I will guard this secret with my life.”\n“Um,” Bruce says. \n“I will also,” Damian says seriously, “live your failed dream for you.”\nFailed dream, Bruce mouths to himself. \n“I will bond with my – siblings, and when you die, we will light the funeral pyre together.”\n“Oh,” Bruce says weakly. “Great. Thank you, chum.”\n“You are welcome,” Damian tells him.\nThe moment is broken when Jason stirs on the bed. He winces as he sits up, his wound presumably pulling at the movement, and Bruce hopes he doesn’t rip any stitches. His frown gets more pronounced when he spots Damian. \n“What’s he doing here?”\n“Bonding with you,” Damian announces. “We have brought you ice cream. Where is it?”\nLong melted by now, Bruce thinks. He stands, clapping Damian on the shoulder and reaching over to pat Jason on the head. Jason looks alarmed. “I’ll find your brothers and get some real food. We can have dessert afterwards. Pizza okay? I won’t tell Alfred if you won’t.” Neither of them reply immediately, which Bruce takes as agreement. He nods at them. “Jason, watch your little brother, make sure he doesn’t run off. Damian, watch your big brother, make sure he doesn’t aggravate his wound. I’m trusting you both with this.” \nThe last he hears before the door closes behind them is Jason’s “I’m not a babysitter”. He smiles to himself. Kids.\nUnfortunately, while two of his kids are now busy with the task of babysitting each other, his other two kids are nowhere to be found. Bruce is in – Crime Alley? He thinks they call it Crime Alley here, and from all he’s heard, it is not a safe neighbourhood for two children to be in, even if one of those children is in his mid-twenties and both of them are superheroes. \nHe tries calling, but they don’t answer, so it looks like he’s going to have to find them on foot. While he walks through the streets, he scrolls through his text messages, something he is finally able to do now that he knows the passcode. Dick texts him the most, but even that chat is suspiciously short, and the others are even worse. From what Bruce can tell, if his kids text him at all, he rarely replies. One time, Tim texted to ask if it was okay to spend the weekend at the manor, and Bruce left him on read for twelve hours, after which Tim texted again to say that it’s fine and he’s sorry for asking. Bruce left him on read again. \nHe has just realised that he took a wrong turn and landed in an alley that’s a dead end, when he hears steps behind him. The steps have a menacing quality to them. \n“Turn around with your hands up.”\nBruce, for lack of anything better to do, turns around with his hands up. A man is pointing a gun at him, his hands shaking, his eyes bloodshot. “Hand over your purse and your phone.”\n“You can have my purse,” Bruce tells him, “but my phone is off-limits.” He knows, realistically, that he can just buy a new phone and reprogram his kids’ numbers. But that would take a while, and also, right now, two of his children are still missing. What if they call because they need his help?\n“Purse and phone, now,” the man barks. “Get a move on.” \n“Okay,” Bruce says, “alright. Let me just-“ He makes a show of patting down his pockets, frowning, patting them again. “I’m sure I have it here somewhere- maybe it’s in the other pocket-“\n“Hands back up,” the man says, approaching him with unsteady steps. “I’ll look for them myself. You move, I blow your brains out.”\n“I don’t think so,” Bruce says. The mugger is close enough to reach now, and Bruce is on him immediately, forcing the arm that’s holding the gun up in the air, so that the resounding shot is fired into the sky. He takes the weapon from him, turns the safety back on, and hits the man across the face with it, all in one swift motion and hard enough that the man sags. Bruce checks that he’s breathing before taking out his phone and calling the police. He leaves the gun with the mugger, but only after he’s removed the bullets. \nHe doesn’t wait for the police to arrive, instead resuming his search. He walks past several abandoned hair salons that are clearly a front for money laundering, ignores a bunch of men playing poker on the street using cut-off fingers instead of chips, and the streets are already looking slightly more cared-for and not as likely to be the background scene for a horror movie, when he hears voices. \n“-didn’t mean it,” Dick says. “I told you.”\n“He never means it.” That’s Tim’s voice. Bruce fastens his steps. “He never means it, and therefore he's never in the wrong, and as soon as they were alone, he probably told Bruce that I was, was provoking him or something, which is obviously crazy because why would I do that when I know that there’s no point, and-“ \n“Boys.” They both flinch, turning to face Bruce from where he’s just crossed a corner. They are leaning against a wall, Tim with his arms crossed, Dick radiating guilt with every muscle in his body. “Got room for one more?”\nThey part, and Bruce joins them at the wall, his upper right arm pressing warmly against Tim’s shoulder, the other pressed against Dick’s. He thinks this conversation might work better with no eye contact. \n“I’m sorry,” Tim says. The words sound practiced. “I know he’s younger, I know he was raised by assassins and doesn’t know any better, and I didn’t mean to cause a scene.”\nBruce mentally notes raised by assassins as things to look into more closely in the future, and puts an arm around them both. Dick melts into the touch immediately, but Tim tenses, like he’s unsure what is happening. \n“The reason I sent you out of that house,” he says, “is because some things need to be said without witnesses. What I talked about with Damian is between me and him, just like this conversation is between me and you two. But I am going to tell you the same thing I told him: You are siblings, not enemies. I expect you to act as such.”\nDick winces, and Tim extricates himself from Bruce’s grip, just slipping out under it and putting some space between them. “I know,” Tim says. “I’ll do better.”\n“Damian will do better,” Bruce gently corrects. “He is going to improve his behaviour, and when he does, I would like you to encourage him. In the meantime, I need you to know that neither did you cause a scene, nor would I be upset with you if you did. You can cause as many scenes as you like. It’s what your teenage years are for.”\nTim opens his mouth and closes it, lost for words, but that’s okay. Rome wasn’t built in a day. \nBruce smiles at his boys. “Pizza?” \nOn the way back, they walk past an alley that is encircled by several police cars. Even though he’s in civilian clothes right now, Bruce can tell that Dick still wants to take a look, so he says, “Don’t worry about it. Just a mugger. They’re arresting him now.”\n“How do you know it’s a mugger?” Tim asks suspiciously. \n“I got a little distracted when I was searching for you. But I took care of it.”\nDick grips his shoulder, hard enough to bruise. “What do you mean?”\n“What I said.”\n“But-“ Dick looks around and lowers his voice. “But you’re a civilian,” he hisses. “Just a civilian.”\n“Dick,” Bruce says patiently, “I may be from an alternate timeline with no people running around in masks, but we have crime too. My parents were killed in a robbery when I was eight. That’s forty years ago. Plenty of time to learn how to defend myself.”\n“But,” Dick says again, and stops, like he has run out of things to say. \n“Not here,” Tim says, pointedly nodding towards the police cars. “We can discuss it when we’re home.” \n“I just,” Dick says, and to Bruce’s surprise, Tim, who has never once initiated touch since he’s woken up in this universe, lays a hand on Dick’s shoulder. \n“Dick. I get it. But this isn’t the time or the place.”\nDick breathes in shakily. Nods. Breathes again. “Alright,” he says. “Yeah, alright. Let’s get pizza.”\n*\nFive days after Tim was shot and Bruce woke up all wrong, Tim enters the kitchen to find Bruce already up. This in itself is not that strange; Real Bruce is a late sleeper, but that’s mostly because he spends his nights on patrol. Without that, there is no real reason for him to be up until four in the morning. \nWhat is surprising, however, is that Bruce is a. in a suit and b. making sandwiches. Alfred is nowhere to be seen. \nTim rubs his eyes and blinks, but the picture says the same. Bruce, spotting him, waves at him with a buttery knife. “Morning,” he says. “You mentioned last night that you’d be going back to school today.”\nTim is fairly certain he has said nothing of the sort. If he recalls correctly, what he said yesterday is, I’m well on my way to recovery, so there is no reason why I shouldn’t work tomorrow. Bruce must have interpreted work as school. Not an unreasonable assumption to make, considering the circumstances, but one Tim must correct nevertheless. Except-\n“Are you…making me lunch?”\n“I’ve made lunch for Damian for the past few days,” Bruce says, going back to spreading peanut butter on toast, “and since you feel better now, I’m making lunch for you, too.”\n“And Alfred….”\n“Left me to my task. He understands this is something a father needs to do for his boys.” Bruce smiles, finishes the sandwich, and moves on to the next. \nThere is something stuck in Tim’s throat, something that no amount of convulsive swallowing will remove. His boys. Tim knows, has always known, that before Jason’s death, Dick and Jason had a different relationship with Bruce, a relationship that’s in no way comparable to Bruce’s relationship with Tim. But still, to hear him say it like this – to hear Tim included – makes him feel weird, like his skin is all itchy.\nStill, though. Bruce’s mistake is understandable, but still a mistake. \nTim clears his throat, trying to get rid off the lump. “I don’t- I dropped out of high school, actually.”\nThe hand holding the knife stills, but only for a second. “Oh?” Bruce says, clearly aiming for a neutral tone. \n“Last year. You- our- Batman died. Dick took over the vigilante thing, but there was still Wayne Enterprises to consider. Jason is still legally dead, Dick was stressed out enough already in between being Batman and raising Damian, and Damian was too young. I stepped up.”\nBruce has given up all pretence of preparing lunch and instead gives Tim a strange look. “You’ve taken over Wayne Enterprises.”\n“Yes, sir,” Tim says, wondering if he’s about to be told what in inadequate choice he is. \n“You’ve become CEO at, what, thirteen-“\n“Sixteen. I’m almost seventeen now,” Tim adds helpfully. \n“-you’ve become CEO of my company, and you dropped out of high school for it?”\nTim nods.\nThere’s a clash as the knife lands on the counter. Bruce is on him in two steps, and the next thing Tim knows, he’s being pressed very tightly against Bruce’s body. Hugged? Is he being hugged? Is that what this is? \nBruce doesn’t say anything, just holds him close, and after a few seconds, Tim relaxes. His skin has stopped itching, and he thinks he could grow to enjoy this feeling. Dick has hugged him many times, but the closest Jason came to him is when he almost beat him to death, Damian has made his feelings clear, and Bruce – Real Bruce – has sometimes clapped him firmly on the shoulder, but he’s never done this. \nBruce’s next words send an icy shower through him.\n“You’re quitting,” he says as he pulls away. \n“What?” Tim says. “No, I’m not.”\n“Yes, you are. I’m not dead now, am I?”\nTim takes a second to consider this. “True,” he concedes, “but you- Batman wasn’t dead for the last year or so, either. He seemed fine with letting me continue my work. I don’t think he liked his job very much.”\n“You’re sixteen,” Bruce says, like that explains everything. “I’m an adult. If I don’t like my job, I can get a different one. That’s how it works.”\n“But-“\n“Luckily,” he says, “I’m not Batman, and I do actually enjoy what I do. So I’m taking back over as CEO, which I would have done anyway, and you’re officially fired. What’s your school? Gotham Academy?” Bruce waits for Tim’s reluctant nod before getting out his phone.\n“What are you doing?” Tim demands, alarmed. \n“Getting you back enrolled.” \nThis is crazy. Does Bruce realise how crazy this is? “Do you realise how crazy this is?” Tim asks, just to be sure. \nBruce is, for some reason, frowning down at his screen. “This school’s website says their extracurricular activities are mostly focused on sports. This is unacceptable.”\n“I can do sports,” Tim offers, even though he would really prefer not to. He trains literally every day, and he gets even more exercise at night. He doubts that being on the rowing team would change much.\n“Do you want to do sports?” Bruce counters, and Tim has no good reply to that. Luckily, Bruce isn’t waiting for one. Only about a minute after firing Tim, he is on the phone with the headmaster. Tim takes that opportunity to leave, but only after Bruce has just made a reference to yesterday’s PTA meeting. For an insane second there, it sounded like Bruce had joined the PTA, and Tim doesn’t plan to stick around and find out if that’s true.\n*\n The bare walls of his bedroom are slowly driving Bruce insane. After two weeks in this timeline, he has learned many things about his children and, based on that, reached his own conclusions about his counterpart. He has opinions on that, of course he does, but hasn’t voiced them for now. He reminds himself frequently that he does not know if, or when, he will return to his own universe, that it could be tomorrow or next month, and that the only thing he can do in the meantime is to be the best dad possible and to also not ruin his children’s relationship with their existing dad, no matter what he might think of him.\nSo he makes them packed lunches, he ruffles their hair and tells them how proud he is, he listens to their stories and asks them to call if they’ll be home late. He does all that, and he keeps his mouth shut. \nBut the walls. \nWhere are all the pictures, he wants to ask his counterpart. Where are the photographs that show his kids, growing up or already grown? Where are the pictures they drew, in school or at home, with clumsy fingers or more skilled? Where are the photos that they took themselves? Where are the mismatched vases that they made, the table mats, the pasta necklaces? The essays and tests and report cards, what about them? What did his counterpart do with those? \nEvery morning he wakes up, not to an alarm, but to his inner clock, finely tuned to wake him six o’clock every day without fail. And every morning the first thing he sees are the empty walls. \nEnough.\nHe corners Damian first, because he already knows that his youngest son takes art classes, and also because he is sure that his other kids would be much more suspicious. \nThen again, Damian is frowning at him as soon as he says, “Can I have a moment of your time, buddy?”, so maybe that guess was wrong.\nHe leads them into the kitchen, where he has asked Alfred to prepare hot chocolate and cookies as both a snack and a bribe. A part of him still cannot quite believe that he can ask Alfred to do things again, that Alfred is really alive and breathing. It makes his eyes sting every time he thinks about it.\nDamian ignores the cookies, but he does take a small sip of the hot chocolate, so that’s a win for step one of the plan: make Damian comfortable. \nNow comes step two. \n“Say, I don’t know all that much about art,” Bruce says. “But a little birdie told me that I have a veritable expert right here in the manor.”\n“Dr- Timothy sold me out?” Damian growls. He looks murderous, but he’s also at least attempted to use Tim’s first name, so that’s progress. Even so-\n“Tim hasn’t said a word.” And Bruce really should have known better than to use a bird metaphor in a house full of boys who either currently go, or used to go, by some version of the name Robin. “As a matter of fact, I talked to your teacher.”\n“Why?”\nBruce falters. “It was parent-teacher conference last night. I thought you knew about that.”\n“I did. I was unaware that you also knew.” Damian seems disgruntled by this discovery. His bad mood is hard to take seriously, though, when he has a milk moustache on his upper lip. \nOf course he knows, Bruce wants to say, but hesitates. That’s not the point here. He can talk to Damian about just how involved Bruce has become in his school at some later time. “I talked to your art teacher,” he tries again, attempting to get them back on track. “She showed me your last project, and I thought it was really good. She wouldn’t let me take it home with me because it hasn’t been graded yet, so I figured I’d ask you to make me a new one, just for me.”\nDamian cocks his head, like a cat. “You wish me to make you a painting with potato printing?”\n“Yes?” \n“No,” Damian snaps, as fierce as though Bruce has just told him he’s thinking of replacing Damian with a better-mannered lamp. “This ‘potato printing’ is beneath me, and it was demeaning of that teacher to force us to do a task meant for toddlers. I think it is some form of psychological torture designed to break my will,” he confesses to Bruce, glancing around in paranoia. Bruce, for lack of a better reaction, nods along. “I will make you a better picture,” Damian decides. “A real one. Not using vegetables. What’s your favourite animal?”\n“I’ve always been partial to anteaters,” Bruce says. “Their noses make me laugh. They’re so long.”\nNever has he ever seen Damian look at him with such obvious judgement. “Anteaters,” he repeats in disgust. “Fine. I will draw you anteaters.”\n“I can’t wait, buddy,” Bruce tells him, and means it.\nHe doesn’t have to decide which of his kids to approach next, because they approach him first, specifically: Tim. He knocks on Bruce’s office, well, one of his seventeen offices, after school, and takes a seat at the desk, back ramrod straight. Bruce signs a document, recaps the pen, and takes off his half-moon glasses before giving Tim his full attention. \nAt first, he thinks his son is here to have another conversation about high school, or to be more precise, another conversation on why high school is unnecessary. Bruce doesn’t particularly mind. He has zero experience with raising teenagers, but he does think this is a healthy stage of their development. And since Tim is apparently sixteen and not, as he’d previously assumed, in his early teens, he’s exactly at that age where kids are most likely to question authority. Of course Tim thinks high school is stupid. Of course Tim wants to drop out. Of course Tim is presumably one provocation away from getting a piercing and threatening to go sleep under a bridge just to provoke Bruce. Bruce’s job is to keep him away from sketchy piercing parlours and to make sure he graduates, and anything else he can bring up when Tim has children of his own. \n“What’s up?” he asks once it becomes clear that Tim has no intention of speaking first. \nTim’s eyes flit around the room, focusing on anything but Bruce. “Damian says you asked for a drawing.” \n“I did,” Bruce says. \n“And Dick mentioned that you said something about the walls in your bedroom?”\n“I did.” Bruce hadn’t realised Dick had picked up on that. It had been a throwaway comment, more to himself than to his son. \n“He didn’t really get it- he asked if I knew what you meant. And I did. I do. The walls in my parents’ house weren’t bare, we always had lots of expensive art. But my friends’ houses always had plenty of family photos. I mean, we had a family portrait, but that’s only one, and when I was seven my mom put it in the garage because we redecorated and it didn’t fit the colour scheme anymore. So.”\n“I see,” Bruce says, even though he doesn’t. All he knows is that Janet and Jack Drake sound like assholes, and now he’s glad that in his own timeline, he didn’t agree to do a business deal with them. \n“So,” Tim says, more forcefully, “I wanted to offer- I’m not very good at drawing, but I still have my old camera around somewhere, from when I used to take photos of Batman and Robin. I could take pictures of everybody. So that you’d have something to put up your walls.”\n“Oh. Oh.” \n“Or not,” Tim says quickly. “It was stupid. Batman always said that anything can be used as evidence, especially personal stuff, and we should keep that in mind.”\n“Tim,” Bruce says, and Tim finally looks at him. “I would be honoured. But I have a condition. Tomorrow, or whenever you’re free, we go to a store, and you help me pick out a camera of my own. In turn for your help, you can pick out whatever you want in that shop.”\n“But- why do you want a camera? I told you. I can take pictures.”\n“And I can’t wait to see them. But you forgot something very important. If you’re the one taking the pictures, who takes pictures of you?” When Tim frowns, about to protest, Bruce says, “It’s not just about filling my walls. It’s about filling my walls with things that remind me of the people I love. You’re a part of that.” \nTim looks like he has trouble processing this, but he doesn’t outright object, and the next day, he goes camera-shopping with Bruce. The day after, Bruce wakes up to two new additions to his wall. First is a beautifully drawn picture of an anteater family. He counts five of them, one significantly larger than the rest. \nThe other is a selfie, obviously taken with a phone and not with the camera he’s bought Tim, printed out hastily and put up while he was still asleep. It shows his four kids, smiling or scowling or making silly faces. Bruce’s answering smile is so wide that it hurts his cheeks. Take that, Batman, he thinks. 1:0.\n*\nSomewhere far away, in a very different Gotham, Batman resists the urge to punch a wall. They don’t have magic here. They don’t even have particularly bad crime statistics here. Everybody is more excited about the latest iPhone than about stabbing someone forty-one times with a steak knife just because they took the last soda, which is what happened in Batman’s Gotham two weeks ago. \nSimply put, there is no way for Batman to get home on his own. \nHe is sure that Red Robin is already working on a solution, and he trusts Nightwing to keep everyone in line while he’s gone. But he doesn’t know how long it will take Red Robin. Last time it took him a year. \nBatman cannot wait a year. He can’t stay in a universe where his counterpart is signed up for three different yoga classes. \nSo he goes to the only person who might be able to help. \nHe goes to Drake Manor next door.\nBATMAN HAS LEFT US FLYING BLIND (more on page seven)\nGONE BATTY? WHERE HAS BATMAN GONE?\nBREAKING NEWS: GOTHAM IS HAVING A BAT TIME WITHOUT ITS FAVOURITE VIGILANTE\nFor nearly three weeks, Gotham has stayed vigilante-free, as the vigilantes in question have either been taken to a different timeline (Batman) or gone on an impromptu vacation to watch the person who has taken his place (not Batman). For nearly three weeks, it’s worked. Batman and Robin have never truly been able to stop most crimes that happen, anyway. It’s not so much about stopping them as it’s about prevention. Batman works on a system based in large parts on fear and shadows. \nFor nearly three weeks, nobody even notices that Batman is gone. \nThen, there’s an explosion in an old industrial building in Crime Alley that’s turned out to not be as abandoned as everyone assumed, and everyone is on high alert. \nWell.\nEveryone meaning Dick, Tim and Damian. Jason is out doing his own thing, like killing people with a chainsaw while laughing like a maniac, and Bruce has his half-moon glasses on and keeps nodding off in his armchair while the news is playing in the background.\nThe news, where the anchor just showed footage of the explosion. \n“To the Cave,” Dick says as everyone stands up at once. “Robin, you’re with me. We’ll work on getting people out of there. Red Robin, you see if you can get any details on what happened, who’s responsible. No going anywhere before you check in.” \n“Got it,” Damian and Tim say simultaneously, and leave. Dick is already on the go as well, but turns at the door, torn. The man napping in the armchair is not Batman. He knows this. He does not expect a civilian Bruce to put on a cape, not without training, not like this. But- \n“Hey. Hey, Bruce, wake up.” \nBruce blinks sleepily up at him, but the minute he catches sight of Dick’s face, he sobers, instantly alert. “What’s happened?”\n“Explosion downtown. We’re going out now to take care of it.”\n“What?” Bruce says, voice sharp. “Who’s we?”\nDick has no time for this. He puts a hand on Bruce’s shoulder. “We should be back by morning. You can ask Agent A – Alfred for the details. For now, just don’t go out under any circumstances. We’ll see you tomorrow.” And, because Bruce has a look on his face like his whole world is falling apart and Dick feels bad about it, he does, he adds, “Don’t worry.”\nIt's not enough, he knows it’s not, but that’s just the way it’s going to have to be for now.\n“What took so long?” Tim asks when Dick finally arrives in the Batcave. \n“Nothing,” Dick says shortly. They have other matters to attend to. \nFor the rest of the night, they’re busy. Nightwing and Robin start a rescue mission that takes several hours, and Red Robin’s investigation is interrupted by Scarecrow, not because he has something to do with it, just because he heard about the explosion and thought he could join in on the fun and chaos. It’s not great, it’s not the cleanest operation they’ve ever done, but in the end, it works, everyone is safe, and Red Robin has made an arrest.\nBruce is waiting for them when they get home. He must have stayed up all night, deep circles under his eyes that are dark enough to rival Tim’s, and he looks wrecked. \n“Is everyone safe?” he asks. “They didn’t say so on the news. Is everyone okay?”\nIt’s at the same time very similar to and very different from Batman asking them for a report at the end of a mission, asking if they’re injured to plan the next mission accordingly, to figure out who needs more additional training, who should be scolded and/or benched. \nWell. \nDick suspects that that last part is still going to hold true. \n“Everyone is fine,” he says. “Damian, Tim, upstairs. Now.”\n“I don’t answer to you,” Damian sneers, but Tim, glancing between Dick and Bruce, seems to realise that something is about to go down, because he takes Damian’s hand – Bruce’s bonding exercises have either worked in a spectacular fashion, or Tim has gotten a hit on the head tonight after all – and leads him out of the Cave. \nDick crosses his arms, chin held high as he faces Bruce. “Let’s hear it.”\n“What you did tonight was reckless,” Bruce says. He says it calmly, no anger bleeding into his tone at all, and that makes it worse. “I realise I’m new to this universe. I realise I have no idea what it’s like to put on a cape and go out fighting crime. I don’t know much about your supervillains, and what they might do if there were no more superheroes. I acknowledge this. I also acknowledge that you’re an adult, and that I can’t tell you what to do. But tonight, you put not just yourself in danger, but you dragged your brothers into it, too. That’s unacceptable.”\n“They chose this life,” Dick counters. He’s trying to emulate Bruce’s calm, but he’s not succeeding. This reminds him too much of his arguments with the other Bruce, the screaming matches that threatened to bring down the manor around them. “They want this life. I’m not taking that choice away from them.”\n“Damian is ten years old, Dick. Ten. If we let him, he’d choose to not go to school and only eat candy for dinner every day, too. That’s why we don’t allow children to make these decisions until they’re old enough to be sensible about it.”\n“Tim chose not to go to school, and you seemed fine with it,” Dick says. Bruce flinches, and he doesn’t know why, until Bruce says: \n“I was not fine with it. I enrolled him back as soon as I realised he had dropped out.” \nOh. Right. Wrong Bruce. Dick feels like he’s standing in a deep fog, with everything moving more slowly around him, slightly out of synch.\n“Are you firing me?” he asks. His tongue feels numb. \n“What?”\n\nYou’re fired, Dick. Get out of my Cave.\n\nHe's Nightwing now, though, he reminds himself. Batman can’t fire him, can’t-\n“Dick? Are you okay, son?”\nIt's unfair, Dick thinks. He’s trying so hard, he’s been trying so hard. He wants to do a good job at being Nightwing, to prove to Batman that he is devoted, he is-\nAnything less than total devotion to this cause is simply wasting my time.\n- but he wants to be a good brother, too. He tried with Jason, and he failed, and he tried again with Tim, and he failed that, too, and if Bruce is saying he can’t even be a good brother to Damian now, then what is Dick doing? What’s the point of him then? \n“Breathe, Dick.” Someone is touching him. Batman. “You’re okay. You’re fine.” No, not Batman. Bruce. \nDick breathes, and soon enough, the world comes into focus again. They’re still in the Batcave, but the man in front of him is not the same man who fired him all those years ago. \n“Look at me,” Bruce demands quietly, and Dick does. This Bruce’s eyes are the exact same shade of blue as the other’s – of course they are, since they only swapped consciousnesses. But they still look different, somehow. Dick just can’t put his finger on why. “I’m upset, and I wish you would see my side of it. But I’m sorry if I made you uncomfortable just now. I never mean to make you feel inadequate, Dick. It’s not about that. I just don’t understand how someone as big-hearted as you can seriously justify allowing children to fight crime.”\nDick breathes in shakily, breathes back out, and reminds himself that this is not Batman. Different timelines, different men. “I was sixteen when I became Robin. And I know how that sounds, I know it sounds bad, but at that point I’d been training for several years. I was prepared, I was ready.”\n“Okay.” Bruce nods. “I can see how that would seem okay. Did the others train for several years, too?” He sounds like he already knows the answer, but he can’t possibly, not when until this moment, Dick never even thought about this himself. \n“Jason was trained by Batman for six months. He was-“ He hesitates. “He was twelve. Both when Batman found him, and when he started as Robin.”\n“Okay,” Bruce repeats. “And Tim? Did he get six months of training, too?”\nDick hesitates once more. “Yes,” he says reluctantly. \n“But?”\n“He wasn’t trained by you. Batman trained him for only a few weeks before sending him abroad to complete his training elsewhere.”\n“I see,” Bruce says. He does not sound like he sees. “What about Damian?”\nDick swallows convulsively. He’s not stupid, he knows that so far, Bruce, even though he gave no outward indication of it, has been silently judging his other universe’s counterpart for these choices. But Damian is not a choice Bruce made for himself. \n“I was the one to ask Damian to be Robin,” he says quietly. “He was nine. It happened last year when we thought Batman had died and I took up the role of Batman for myself.” \n“Dick-“ Bruce starts, but Dick is on a roll now. He has to say this, has to confess all his sins, before he loses courage.\n“Damian was trained,” he says, “better trained than any of us, probably. He’s spent the majority of his life with the League of Assassins. And then he came here, and you didn’t like him, and he lashed out in return. You were the only one he respected, and it was so obvious that you didn’t want him there. He needed a father. When his father died, I thought that if he couldn’t have that, if he couldn’t have you, he could have the next-best thing. So I made him Robin, to give him a purpose, to ground him. It worked. But there’s always a price, and that price was Tim. He still hasn’t quite forgiven me, I think. Not for taking Robin away from him, and not for not believing him about Batman being alive, either. I gained one little brother last year and lost another one. That’s two little brothers I’ve lost, now.”\nDick bows his head, ready to await judgement.\nBruce hugs him. \n“I’m sorry,” he says, his voice a rambling baritone that soothes Dick’s nerves as much as the hug does. “I’m so sorry that you were in that position. That you had to make these choices. That I wasn’t there to take that burden away from you.”\n“You were dead,” Dick mumbles into Bruce’s neck. “And also in a different timeline. It wasn’t your fault.”\n“Doesn’t matter,” Bruce says. “I’m still sorry. For all of it. For everything my counterpart did or failed to do, and for every moment I spent in that other timeline, not even knowing that I had sons, unaware that they needed me. I wish I could have been there for all of you.”\nDick is crying, he realises suddenly. Tears are streaming down his face and he hadn’t even noticed. “It’s okay,” he says, and means it. “You’re here now.”\n*\nBruce thinks long and hard about the best way to go about this, and in the end, he decides that there is really only one thing that might have a chance of working. So he’s going to try that, and he’s going to do his humanly best to not screw this up.\nAfter he calls a family meeting in the dining room, it’s not a big surprise that Damian is the one to arrive first. What does surprise him is that Jason is second, followed immediately by Tim, who looks very pleased with himself. He also has what might be a developing bruise on his face, but that must be only a small setback in what is otherwise undoubtedly joy over having not just gotten Jason to attend, but to having also won one week of pretend sick leave in school, signed by Bruce as the promised reward for his victory.\nDick is last. He slinks into the room like a man ready to face the executioner. Of course, he’s also the only one of Bruce’s children who knows, or at least suspects, what is about to go down, so maybe that’s not that surprising.\nBruce waits until everybody is seated, then closes the doors. Everyone visibly starts. For the past few weeks, Bruce has made it a point of always leaving his office door open, making sure that he’s available at all times. Now, he hasn’t actually locked them in, but just the act of shutting the door seems to be enough to make everybody tense.\nTaking a deep breath, Bruce turns back to face them – these four boys, his four children, the sons he never knew about and who have, in a few short weeks, become the most important thing in his life.\nHe hopes they don’t start hating him after this.\n“Before we begin, I would like to remind you all of one simple fact. I am not Batman, I have never been Batman, and I do not intend to ever become Batman. I realise that in some people’s eyes, this may make me seem like the weaker version. I understand if that’s what you think, too. But I want you to remember that what I’m about to do is something Batman would never manage. I’m not going to use my authority as your guardian or boss to command something. I’m going to make a request.”\n“Go on,” Jason says, though his uncertain look betrays his faux-confident tone. “Just say it.”\nBruce makes sure to look each of them in the eye once, before saying, to the room at large: “I would like you all to give up being vigilantes.”\n“What,” Jason says, “the fuck.”\n“Language,” Dick says automatically, but he sounds tired more than anything. He’s sounded tired since talking to Bruce yesterday.\n“Don’t language me, asshole. Did you hear what he just said?”\n“There’s a but coming,” Tim says suddenly, ignoring his brothers’ argument and instead looking directly at Bruce. “Isn’t there?”\n“There is,” Bruce confirms, and Jason and Dick fall silent. “Like I said, it’s only a request. However, I’m fully aware that not only are two of you over eighteen, but I am also an impostor in this world. I have no legal authority over any of you. Even if I did, I doubt that I could stop you. Ultimately, you may do what you like. What I’m asking of you,” he says, “is to let me present my case. Hear me out at least before you condemn my words.”\nSlowly, reluctantly, they nod, all of them except Damian, who has yet to speak up or even move. But Bruce would be a fool to think that this means his youngest son isn’t listening to every word he says.\nHe sighs. He has thought long and hard about the best way to go about this, and in the end, he decided that there was really only one thing that might have a chance of working.\nTell the truth.\nSo he does.\n“I look at you,” he says quietly, “and I see children. I see children who have been groomed into joining a war that is not their own, children who feel like their lives are immutably tied to the cause. I see a child who has died, and I see three others who would be willing to do the same. And it makes me angry with my counterpart, but most of all, it makes me sad. I look at all of you, and I feel like my heart is breaking. I’ve only just gained four children. Perhaps it’s selfish, but I’m not ready to lose any of you so soon. Not because of a pointless war that some ill-adjusted version of myself has started.”It’s out there now. Words that can’t be taken back, not that Bruce would want to. He means what he said.\nThere’s a horrible screeching noise as Jason’s chair gets pushed back, scraping over the hardwood floor and falling to the ground as Jason carelessly stands up and storms out, not looking back once. The entire thing has taken less than five seconds.\nDick moves as if to go after him, but Bruce holds up a hand. “Leave him for now. Give him time to calm down.”\nDick slumps back into his chair, clearly lost now that his task has been taken from him. His hands twitch, his eyes glancing between his brothers like he wants to reach out for either or both. But where the Dick Bruce has gotten to know so far would have not hesitated in initiating physical contact, this new, silent Dick who has emerged after yesterday’s talk keeps his hands to himself. It makes Bruce want to reach out himself, but it’s not the time for that. Not yet. \n“What I propose,” he says, “is a compromise.”\nTim’s head snaps up at that, blue eyes nailing Bruce down with a piercing stare. “What kind of compromise?”\n“Compromises are for the weak,” Damian sneers. “Waynes do not compromise.” \n“Red Robin and Robin,” Bruce says, noting their surprise at his use of their codenames, “are restricted to the Batcave until they are eighteen, or until a major crisis breaks out. In the Batcave, they are allowed to help out over the comms, or in any other fashion they deem fitting, so long as they stay within the parameters of the Cave.”\n“Unacceptable. I turn eighteen in eight years.” \nBruce is not an idiot. He had expected protests, and he had expected them most from Damian. Damian, who has been groomed since birth. He’s not proud of it, but the strategy he's thought up includes some manipulation of his own. \n“That is eight years more to train,” he says, and feels Damian’s gaze sharpen. “Eight years to become stronger, faster, better. And you’re forgetting something. You’re not just Robin. You’re a Wayne, too. You need to keep up the family image,” says Bruce, who could not care less about the family image. “That requires education, good grades, having a functioning social life, attending charity galas with me or your brothers. This is a duty you can’t just shirk, and it’s going to require a lot of your attention. I expect you to give it your all.”\nHe knows he’s found the magic words when Damian nods sharply. “That,” his youngest son says, “is acceptable. I will train, and I will represent the family. You can count on me.”\n“Always knew I could, buddy,” Bruce says, allowing himself to smile, just a little, as Damian slips out of a chair and leaves. But the battle is not yet won. He’s got one down, three to go. \n“What about Red Hood and Nightwing?” Tim asks, as the door falls shut behind Damian. “You haven’t mentioned them.”\nBruce makes himself shrug, trying to appear casual. “They’re adults. I meant what I said earlier. I can’t tell you guys what to do, Jason and Dick least of all. I respect that.”\n“You really mean that, don’t you,” Dick says. “That you can’t tell us what to do. That you’ll accept whatever we choose.”\n“I really mean that,” Bruce confirms. For some reason, this makes his son deflate. “Dick? What’s wrong?”\nDick smiles ruefully. “When I was fired as Robin, I left. Bruce never called me even once. It’s like once he took away the cape, he was done with me, too. Like the cape was all that mattered.” \n“That’s not true,” Tim says, even though he sounds unsure himself. “He wouldn’t- he really didn’t call?”\n“Not once.”\nTim is chewing on his lip, a nervous habit that Bruce has never seen on him before today. “He must have been busy,” he says. “Like- maybe he was working really hard, and it all got too much, and he just forgot. Parents do that sometimes.”\n“Maybe,” Dick agrees. \nBruce surprises himself by how forceful his “No” is. He hadn’t meant it to come out like that, but- “Parents do not forget to call. Not good parents, anyway.” He thinks of Dick, moving out and waiting for a call that never came, and then he thinks of Timothy Drake, not the one sitting opposite him at the ridiculously large dining table, but the one from his own universe, the quiet, well-mannered child he’s seen at galas sometimes, never making trouble for his parents and being scolded anyway. His heart aches not just for Dick and Tim, suddenly, but for that other Tim, too. For one brief, insane second, he wonders if it would be possible to return to his timeline just to collect that Tim, and then return to this one. \n“I’m going after Jason,” Dick says suddenly, standing up with enough force that the table shakes. “He needs me.” He looks at Bruce with his jaw clenched, like he’s daring him to disagree. \nBruce isn’t going to. “Go. I trust your judgement on this.” \n“Oh.” Dick blinks. “Okay. Bruce?”\n“Yes?” \n“I’ll talk to him, but I don’t think he’s going to stop being Red Hood. I won’t convince him otherwise. It's his choice.” \n“Of course,” Bruce agrees readily. “I wouldn’t have expected anything less from you. You’re a good brother, Dick.”\nDick blinks again, more rapidly this time, eyes suspiciously wet. He nods, and with that, he’s gone.\nTim is the only one left now. He is, as always, sitting ramrod straight, and he’s steepled his fingers in front of his chin, solemnly gazing at Bruce. It makes him look like a tiny adult, which in turn almost makes Bruce smile, at least until he remembers that two weeks ago, Tim was CEO of a company. No doubt that in Tim’s mind, he is an adult. This won’t make the following conversation any easier.\n“Tim-“\n“You don’t need to bother. I’ll stop being Red Robin.” Tim gives him a sincere-looking smile. \nAt the sight of that smile, Bruce’s heart stops for a beat. \nNot noticing this, but picking up on his silence, Tim adds, his voice dripping with reassurance, “You’ve made some good points. I know you’re just worried about us. You convinced Damian, but Jason and Dick are in too deep, so there’s no chance with these two. But you don’t have to worry about me, because I’ll stop. It’s no problem.”\n“So,” Bruce says, once his heart has picked up its rhythm again and Tim’s smile begins to falter in the wake of Bruce’s unresponsiveness, “you just lied to my face several times, and I would like to know why.”\nIf he hadn’t been looking out for it, Bruce would have missed the split-second freeze before Tim’s mask is back in place. “Lie?” he repeats, still in that weird voice. “I didn’t lie. But I understand that we are, if you think about, complete strangers, so you might not trust me yet. That’s okay. I will work hard to-“\n“Stop it,” Bruce says. “This routine might have worked on Batman, but I’m not a moron. So you get a choice. You either tell me the truth, or I’m going to handcuff myself to you to physically stop you from leaving this house without a chaperon. What’s it going to be?”\nTim narrows his eyes. “I know how to pick locks.”\nBruce nearly sighs with relief. Defiant is good. Defiant is miles better than the smiling stranger Tim just turned into. “Well, you may know how to pick locks, but I’m bigger and faster than you. You run, I’ll catch you.”\nThey’re caught at a standstill, each eying the other with suspicion, trying to guess at a bluff. But Bruce isn’t bluffing, and so eventually, Tim looks down. “My entire life,” he says, “has revolved around Batman. I was obsessed with Batman and Robin when I was a kid – I used to follow them around at night, taking photos, and sometimes, I used to sneak onto the grounds of Wayne Manor and look through the windows, just trying to catch a glimpse of them eating dinner or watching a movie. I never wanted to become Robin, it wasn’t like that. I just wanted- I just liked the idea of it. Of being a family. – Don’t say it,” Tim says, catching Bruce opening his mouth. “I know what you’re going to say, and you’re wrong. You don’t know this, but some time ago, my dad found out about the whole vigilante thing, and told me to give it up. I did, and it was the most miserable time of my life. And now that my dad is dead – if I give up Red Robin, what then? What do I have left? All my friends are superheroes, and apparently when Dick left, you didn’t even call, and I know I’m back at school but I have no interest in going to college, and I don’t- I can’t- I’m not ready to leave this yet. I’m sorry, but I’m just not.” \n“Are you done?” Bruce asks and, when Tim nods, he puts his hands on his shoulders. His hands are big, and Tim is so small, and he kind of feels like one wrong move could crush him. “You didn’t want me to say it, but I’m going to say it anyway, because you need to hear it. You do have family. Your family is right here at the manor. And I can promise you that no matter where you are, no matter what you decide to do with your life, as long as you’re more than ten miles away, I’m going to call. If you don’t believe me, just ask Jason.”\nTim lets out a small, shaky laugh. “I don’t need to. He complained about it on the way here. Every day, really?”\n“There you go, then.” Bruce allows himself a smile. “Every day. I’ll do it more often if you like. Twice a day. I can call you during work hours, too, every time I step out for a cigarette.”\n“But – you don’t smoke.”\n“No, but my employees don’t know that. I’ll tell them I’m a chain smoker and call you every hour.”\nTim laughs again, and really, that’s all Bruce ever wanted. To make his children happy. “I appreciate it,” Tim says. “I really do. But-“\n“But your argument still stands. Okay. Let me present you with another reason then: Damian.”\nTim cocks his head. “Damian?”\n“He just agreed not to put on a cape until he’s eighteen. If the same rules don’t apply to you, too, he’s going to find that very unfair indeed. Besides, big brothers should lead by example, don’t you think?”\n“I want you to know that I realise what you’re doing,” Tim announces. “This is textbook manipulation.”\n“Well? Is it working?”\n“A little,” Tim admits. “Fine. I turn eighteen next summer. That’s only one more year.”\nBruce is overwhelmed by the sudden urge to ruffle Tim’s hair. He does, and Tim doesn’t even look annoyed, just blinks slowly, like he doesn’t quite understand what’s happening. “Thank you, son. A very mature choice to make.”\nThey’re already on their way out when Tim asks, “Wait, does this mean I can’t help out the Teen Titans anymore, either?”\nThe what?\n*\nIt's a quarter to seven, which means Conner and Bart are supposed to arrive in exactly fifteen minutes. Tim’s palms are sweaty. He wipes them on his jeans, to no avail. \nThe only good thing, he reflects, is that when Damian heard Tim is having friends over, he decided not to be outdone and announced the next day that he’d also be spending the evening at a friend’s place, which means he, at least, won’t be here tonight. For someone who has never expressed an interest in making friends thus far, Damian sure moves quickly. Tim is a little impressed. Bruce, naturally, was thrilled, either not realising that his youngest son has turned befriending people into a competition, or not caring. \nWhat Damian had not known at the time is that of course, Tim had not invited Conner and Bart willingly. He’s not that insane. Even if the old Bruce hadn’t been ridiculously paranoid over having strangers in the house, Tim still would have preferred to keep his friends as far away from his family as possible, and now more than ever. Jason is home much more frequently than he used to, and Dick must have lied to his workplace about being on parent leave or something, since he’s always here. It doesn’t matter that they’re both clearly upset about the No Cape suggestion. They still keep drifting into Bruce’s general vicinity every day, like they can’t help it. It’s a little pathetic, to be honest, but Tim gets it. Bruce keeps ruffling his hair for some reason, and it’s somehow the nicest thing Tim has ever felt. Crazy. \nBruce also ruffled his hair after finding out about the Teen Titans. He’d gotten all weird and quiet for a few seconds, but in the end, he’d just made a humming noise before asking Tim if he would like to invite any of his little friends over for dinner. Tim, thinking fast, had announced that they’re all suffering a bout of bubonic plague and can’t leave the house right now, or in the foreseeable future. \n“The bubonic plague has been eradicated,” Bruce had said.\n“Not in this universe,” Tim had replied. Unfortunately, mysteriously, Bruce seems to be able to tell whenever Tim is lying to him, so he’d called bullshit and told Tim that of course he doesn’t have to invite anyone if he doesn’t feel comfortable with it, but that Bruce would love to get to know this part of his life, too. What was Tim going to do? Tell him no? \n“Are you brooding?” Jason asks, stepping out from the shadows of the drawing room Tim had been using for his freak-out. \n“Jesus,” Tim says, waiting for his heartbeat to slow down. “How long were you standing there?”\n“Like, ten seconds? I’m sneaking back in because this is the only room that’s got a fire escape, and I wanted a quick smoke. Why, how long were you in here?”\n“Not long,” Tim says quickly, and Jason snorts.\n“Listen, Replacement, before you feel too sorry for yourself, keep in mind that Bruce asked me to bring over my friends, next. I didn’t know how to explain to him that most of my friends are criminals.” \n“Are you guys brooding?” Dick asks, entering through the window. “Why are the lights off?”\n“Tim is having a fit of teenage angst,” Jason says. That traitor. “I’ve been trying to tell him that he’s got nothing to be worried about. Bruce is literally the nicest guy I’ve ever met. He’s so nice it freaks me out a little. There is no way tonight can go wrong. Although-“\nTim doesn’t stick around to find out what Jason is going to say. He slams the door, then slams it again for good measure, then silently apologises to Alfred, and he’s only taken two steps into the hallway when he runs into Bruce. Literally. \n“Sorry, chum,” Bruce says, holding out a hand to help Tim up. “Didn’t see you there. I just need to- give me one second.” Bruce finishes typing something on his phone, smiles briefly, before putting it away and giving Tim his full attention. “I was just on my way downstairs. Have you seen your brothers?”\n“No,” Tim says, at the same time that someone slams against the door of the room he just exited. They must’ve figured out that he removed the doorhandle. “I’ve no idea where they are.”\nBruce’s sigh is drowned out by the doorbell ringing. “Teamwork. Would you like to free your brothers or go greet your guests?”\n“No need to free them,” Tim calls out, already on the stairs, “I’ve been reliably informed that there’s a fire escape.” \nWhen he arrives in the entry hall, Alfred walks past him with a leather jacket and Conner, now only dressed in a t-shirt, is visibly fidgeting. He is also alone.  Why is he alone? \n“Why are you alone?” Tim demands. \nConner scowls. “Bart was here when we arrived thirty seconds ago. He left to ‘take care of something’. Said to get started without him.” \n“Are they here?” Bruce asks, joining them. “Tim, did you tell them that- oh.” Bruce stops in his tracks when he sees Conner and, presumably, nobody else. He gets a weird, constipated look on his face. \n“I invited more people,” Tim says, feeling oddly defensive. “But Cassie is busy and Bart apparently just ditched us.” He stops just short of insisting that he swears he has more than one friend, because that would perhaps be a little too pathetic. \n“Sir.” Conner sticks out his hand. Before inviting them, Tim gave all his friends a quick summary of the situation, aka, told them that Batman got replaced with a nicer and capeless version of himself, that he really wants to parent Tim, and that he forced Tim into this dinner with a mixture of kindness and guilt. Bart thought this was hilarious, but Conner had seemed thoughtful. Probably he’s thinking how to replace Superman, Tim thinks a little spitefully. \nBruce shakes his hand easily and invites them into the dining room, where Alfred has put the pizza they ordered half an hour ago. This was a fascinating fight to witness: Alfred had insisted on cooking, whereas Bruce had insisted that growing boys would prefer pizza to a five-course meal. When Alfred had then insisted on making the pizza from scratch, Bruce had said, “It’s about the principle of it, Alfred. Trust me.” As a result, Alfred has the evening off, effective immediately as soon as the guests arrive, and Bruce, who always acts a little weird when Alfred is around, had been a mixture of happy and guilty. \nAs he’s just about to walk through the door, Jason, having apparently freed himself from his interim prison, pounces on him, or at least he tries to. Tim likes to think that he would have moved out of the way with ease and grace, but he doesn’t get the chance, because Conner, too quick for the human eye to notice, is suddenly there, acting as a human or, well, alien shield between Tim and his murderous brother. \n“Let me through,” Jason snarls. “Someone is begging to get a good beating.”\n“Stop,” Conner says, and, miraculously, Jason stops. It takes Tim a second to realise that this is because Conner has a tight grip on his wrist. He can almost hear the bones grinding, ready to break. \n“Boys,” Bruce says loudly. “Stop squabbling. You can apologise to each other later. Jason, where’s Dick?”\n“Here,” Dick says, a bit sheepish as he comes in after them and flops down on a seat next to Bruce. “Sorry I’m late.”\n“I locked him in the room again,” Jason announces. Bruce invitingly pats the chair on his other side. He scowls and sits down next to Dick. \nTim takes the chair that Jason scorned, if only so that Conner can’t. Not that it helps any. Bruce is still staring at Conner for some reason, and the staring has only increased over the course of the past sixty seconds. \nConner, clearly uncomfortable, waits until Bruce is occupied by asking Dick if he wants to help him build a treehouse tomorrow, before leaning in and saying quietly, right by Tim’s ear, so that only Tim can hear him: “Do I have something on my face?”\n“I think he’s just happy I have a friend,” Tim says insincerely. “Don’t mind him.” \nBut it’s hard not to. Bruce’s eyes seem to track every one of Conner’s movements. \nIt's when Tim’s arm brushes against Conner’s by accident that he suddenly realises what’s happening – or, apparently, what Bruce thinks is happening. \nIn Bruce’s defence, it’s not that crazy an assumption. Tim knows a lot of people have remarked on how close Red Robin and Superboy are. A little too close, some would say – some have said. They’re wrong, of course. He and Conner are friends, nothing more. But does it really matter if Bruce clearly thinks otherwise? \n“So, Conner,” Bruce says, and both Tim and Conner startle a little because this is the first time Bruce has directly addressed him. “Does your – do your parents know about this side of your life?”\nConner stiffens, presumably because he has no parents, and Tim also stiffens, because what the hell. \n“What the hell, B,” Jason says, for once having Tim’s back. \n“Jason, eat your greens,” Bruce says without glancing over at him. Jason, who has piled several pieces of bacon and sausage pizza on top of each other and who has absolutely zero greens, spitefully eats a piece of sausage. \n“I don’t have much contact with my family, sir,” Conner answers diplomatically. Tim is impressed. Conner must really be trying hard to be nice to this alternate universe version of Bruce. \nBruce frowns harder. “I’m sorry to hear that. Family is important, and boys like you – well, or Tim, I suppose – need a strong role model to show them what really matters in life. It’s easy to enter the wrong path at your age.”\nConner stiffens again, and this time Tim knows it’s because he’s heard Tim’s heartbeat speed up. He tries to take in slow, measured breaths, but it’s not really working. Wrong path, Bruce said. Is that what he thinks? That this is wrong? He wouldn’t be the first in Tim’s life to say so. But-\nBut Tim had kind of assumed Bruce would be different. \nDick, picking up on the tension but misreading it with the earnestness of someone who has never doubted their sexuality even once, says, “Stop intimidating Conner, Bruce. It’s weird.”\n“I’m not intimidated,” Conner says immediately. “Sir.” \nJason, also picking up on the tension and reading it correctly, announces to the room at large: “I’ve sucked dick.”\nDick looks disgusted, but that might be more because of Jason’s unfortunate phrasing. Tim is more concerned with Bruce’s reaction. Bruce looks – well. \nA bit confused, a bit worried, but mostly encouraging. “Exploring and embracing one’s sexuality is important,” he says. “But-“\n“But don’t do it in public?” Jason interrupts. His eyes have that murderous glint again. Conner shifts in his seat. “But don’t talk about it?”\n“But please do it safely,” Bruce says. \n“I’ve sucked dick, too,” Dick says suddenly. They all turn to look at him, and he shrugs. “What? Jason doesn’t have a monopoly on being gay.”\n“You’re not gay,” Tim says, feeling a headache forming behind his eyes. \n“I’m not gay, either,” Jason says. “What, does sucking dick make you gay now? That’s homophobic.”\n“It is a little bit,” Dick agrees. “It’s not always about sex, Tim.”\n“Yeah, Tim,” Jason says, “God. Get it together.”\nBruce appears to be getting a headache too, judging from the way he pinches his nose. “Everyone out.”\nSilence. \n“What?” Jason asks with uncharacteristic uncertainty. “What did you just say?”\n“Leave. Go find us some dessert and pick a movie to watch. And find me some aspirin while you’re at it. – Hold on. Not you two.” Bruce points first at Tim and then at Conner. They both freeze. “Alright,” Bruce says when Dick has dragged a protesting Jason out of the room, “you’re going to be explaining some things.”\n“You can’t kick me out,” Tim blurts out. Next to him, Conner goes rigid, inching his chair a little closer like he’s ready to jump into action. “We aren’t even dating, and apparently I’m the only one of your sons who hasn’t sucked dick yet, so it would be really unfair of you to do this when I’m not even acting gay.”\n“If you do kick him out,” Conner adds, voice low and threatening, “you will go up against the Teen Titans, and you will lose.”\nBruce sighs. “Nobody is getting kicked out. That’s not what’s happening here.”\nTim hesitates. “I really am gay, though,” he says. “I’m just not acting on it. I just want you to know all the facts before making any final decisions.”\n“There are no facts that could make me kick you out,” Bruce says, and for a minute there, he almost sounds like Batman with how certain he is, how clear his voice rings out into the room, like the world will revolve around his words just because they’re his words. “Not a single thing will make me change my mind about you.\nThat’s my decision.”\n“So you’re not – mad?”\n“Tim.” Bruce reaches out across the table, and Tim reluctantly places his hand in Bruce’s. The warm skin contact actually makes him feel a bit calmer. “It’s your choice how to spend your life, how much or little you want to explore your sexuality. I said this to Jason earlier, and I’ll say it again to you, as often as you need to hear it. I just need you to know that I will never be mad because you’re gay.”\n“Oh,” Tim says, feeling weirdly exhausted by this conversation, like he has run a marathon, or like he’s gotten kidnapped again and had to free himself because Batman called it good practice. “That’s- wait. So why were you glaring at Conner?”\nTo his surprise, it’s Conner who speaks up. “It’s because I’m a clone.”\nBruce’s smile fades away into a frown, and Tim feels himself freeze again, an instinctive reaction to seeing Batman be visibly unhappy with him. Maybe some day, he will be able to train himself out of this. “You’re a clone? Your universe clones people?”\n“Your universe doesn’t?”\n“I think my universe stopped at cloning sheep,” Bruce says, tapping his lip thoughtfully. “So you’re Superman’s clone. Alright. Do you live with him?”\n“Conner lives at Titans Tower,” Tim interrupts, eager to contribute to the conversation and especially eager to talk about how Superman has, honestly, been kind of a dick to Conner. “Superman doesn’t talk to him.”\nConner kicks Tim under the table, but he does it gently, because Tim’s leg doesn’t break. “I share DNA with Superman and Lex Luthor,” he explains. “It has been hard for him to interact with me without seeing his archnemesis.”\n“His archnemesis? Superman has an archnemesis? Do I have an archnemesis? Wait, do you kids have an archnemesis?”\n“Evil,” Conner says at the same time that Tim says, “Jason” and, considering for a second: “Shellfish.”\n“But,” Bruce says, getting back on track, “in that case, who pays for your education?”\n“I have an eidetic memory,” Conner says. “I don’t need education.”\n“I basically have an eidetic memory too,” Tim says quickly. “Right, Conner?” \n“Hm,” Conner says doubtfully. \nMomentarily distracted, Bruce says, “Tim, you’re failing physics.”\n“Because I fall asleep in class, not because I can’t do the tasks.”\n“Do you need help with physics?” Conner asks, concerned. “I can help.”\n“I don’t need help, I need- Bruce? What are you doing?”\nBruce is on his phone again. His fingers are so large that he keeps hitting the wrong keys, so typing always takes him ages. “I’m just checking something,” he says. “Don’t mind me, I can multitask.”\nBruce really can’t. One time, Tim saw him trying to fry an egg while making tea, and he somehow managed to burn both. Another time, just the other day, he promised to give Tim a lift to school, and he did, but they were also halfway to Metropolis before Bruce realised that Tim had been strategically asking questions to distract him from taking the correct turn or reading the road signs.\n“I just need to- here we go. All done.” \n“Done what?” Tim asks, and Bruce smiles sunnily. \n“Just rearranged Wayne Enterprise’s financing a little. I also got you a physics tutor. And I texted Alfred to never serve shellfish, ever.”\nBefore Tim can reply, there is a knock at the front door. It shouldn’t be audible from the dining room, but it is, because it sounded like someone took a sledgehammer to it. Is Wayne Manor under attack, or is Jason acting out? Could be either, could be both. \n“Stay here,” Bruce commands, and leaves.\nConner and Tim exchange a glance and follow him. They come running into the foyer at the same time as Bruce, just in time to see the massive oak door vibrate again and then splitter as someone punches a hole through it. \nIt's Superman.\n*\nMany things are different in this universe, but even more things are the same. Bruce still lives in Gotham, for example, and for another instance, Gotham is still objectively a place nobody should live in. There are many similarities.\nAnother similarity is that both universes have a Clark Kent. Only Bruce’s Clark Kent does not, to his knowledge, fly around in a cape. \nBruce is one hundred per cent sure that he is not supposed to know Superman’s secret identity. All his children are hyper-aware of his ignorance regarding this world’s superheroes, and all the files on the Batcomputer are password-protected. \nLuckily, once he figured out his phone’s password, he was able to figure out all the other ones, too. \nSo Bruce has done a little reading. Well, a lot of reading. It’s not stalking if he’s stalking himself, he reasons, and it’s also not stalking if he’s stalking his children. He’s already befriended all of them on Instagram, it’s not like he doesn’t see what they’re up to anyway. \nIt's especially not stalking, he has decided, if he’s stalking potential threats to his family. \nThe Justice League made number one of that list. \nBruce is not sure why he’s still funding them, exactly. But he would have been willing to let it slide, perhaps. He has a lot of money, after all. \nWould have been willing. \nUntil he found out about the Teen Titans. \nKnowing that some version of himself, however twisted that version might be, turned all his children into vigilantes is bad enough, but at least in this case he quite literally only has himself to be angry with. But the Teen Titans are a colossal screw-up that has multiple adults not just involved, but directly responsible, and it seems that so far, nobody has done anything about it. The Justice League encouraged it, even. \nWhich is why earlier this evening, he sent out an email announcing that he’s cutting all funding for the League, effective immediately, and putting the money into a trust fund for all the Teen Titans instead. \nThis was Bruce being nice. It was Bruce knowing about the Teen Titans as a general concept, from the files on the Batcomputer, from the internet, and from Tim. But his research had been mostly focused on the Justice League. He hadn’t really paid attention to this other team, besides knowing that they’re all child soldiers supported by a bunch of people in their thirties and forties.\nThen he found out that not only is Clark Kent’s son part of that team, but he also doesn’t have the grace to at least talk to said son. \nSo Bruce stopped being nice. \nIn his second email, he pleasantly informed the League that he’s calling CPS on them.\nJudging by the fist-shaped hole in his door, he assumes that Superman checked his email. \nSuperman steps through the destroyed door – literally steps through it, and destroys it more in the process. He looks weird without his glasses. \n“Red Robin, Superboy,” he snaps, “get away from him. He might be mind-controlled.”\n“We went over this,” Tim says, sounding long-suffering. “He’s not. Trust me, we checked.”\n“A clone, then,” Superman says, disdain dripping from every word. From the periphery of his vision, Bruce can see Conner flinching. \n“Actually,” Bruce says, taking a step forward and subtly angling his body so that he’s standing in front of the boys, shielding them, “I’m not a clone, either. I’m just a good father.”\n“A good-“ Superman stops, considering. “Amnesia?” he guesses. \n“Alternate universe,” Tim corrects. “I’m working on it.”\n“Work harder,” Superman says, and this time Tim is the one who flinches. “We’ve all seen the headlines, even before those ridiculous emails. Gotham needs Batman.”\n“The Justice League needs my money, you mean.” Bruce’s smile is sharp and unpleasant. “But that’s not happening any longer. Now get out of my house before I call the police.”\nSuperman shakes his head in disbelief. “The police. That other universe really must be something. Fine. Superboy, you stay here and keep an eye on things. Red Robin, you’re with me.”\nBruce makes sure to keep Tim behind him, ready to tell Superman that he wasn’t kidding about calling the cops, but Tim speaks up first. \n“Do I have to?” he asks. \n“No,” Bruce says immediately. \n“Yes,” Superman says, incredulous. “I wasn’t asking. You will report your progress on solving this issue to the League. You should have alerted us as soon as the situation arose, but it’s too late now. Batman can discipline you when he gets back.”\n“No offence,” Tim says, “but I don’t really see what you can do to help. When Batman got stuck in the timestream, I wasn’t getting any help from your corner, either. I think I’ll take my chances.”\n“Bruce,” Superman says, having apparently decided to stop bothering with Tim and instead looking straight at him, “I understand that you are new to this world. But no matter what these two-“ He nods towards Tim and Conner. “-have told you, you are still a version of the world’s greatest detective. Don’t believe what anyone tells you. Try and see the facts.”\n“The facts are perfectly clear,” Bruce says. “The facts are that if you don’t leave right this second, I’m going to the press and I’ll reveal more than just my secret love of baked goods, Clark.” \nSuperman goes pale. “You wouldn’t,” he says. “If my identity gets revealed, so does yours. You’re bluffing.”\n“I might be,” Bruce agrees. “But can you really afford to stick around and find out for sure?”\n“This isn’t over,” Superman snaps, but it is. It really is. \nBruce exhales deeply once Superman is gone again. He will have to fix the door before Alfred gets back. But first, he needs to talk to Tim and Conner and, eventually, to Dick and Jason, too. He needs to-\n“Wow,” says someone, a teenager who was definitely not in the foyer two seconds ago, “I got distracted somewhere in East Asia and completely lost track of time. Seems like I missed a lot. Did I just run past Superman outside?” \nTim says, “I told you I invited more people.”\n*\nThe Tim Drake of this universe has failed Batman. He’s weak. He hasn’t suffered like the other one has. It makes him useless for Batman’s purpose. \nHe has not even attempted to track down this universe’s Dick Grayson or Jason Todd. They are of no use to him as civilians. \nSo instead, Batman is holed up in the manor, and he waits. He waits for Red Robin to hurry up. As soon as he’s back, they can have a conversation about what timing is and is not acceptable for a rescue mission.\nAs soon as he’s back.\nJason has moved back into the manor. He claims he did it to make sure Bruce doesn’t give his room to yet another child – there is one more now than there was a week ago, and at this rate, they’ll have run out of rooms by Christmas – but really, he doesn’t much care if Tim’s boyfriend lives with them now or if Bruce wants to adopt a million more kids. \nIf he’s completely honest with himself, he moved back in because he likes being around this Bruce. \nThis Bruce has not given him any indication that he cares about anything more than his children. And the thing is- the thing is that, look, Jason is aware that this Bruce is no vigilante, that he’s never fought crime on Gotham’s streets at night, and that he doesn’t really know this life. But he still feels like if he got killed by a clinically insane clown again, this Bruce would stop at nothing to avenge him. \nThey’re not completely different, this Bruce and the Bruce Jason grew up with. But this Bruce keeps his darkness contained, letting it out in only very specific situations, like when someone is threatening his kids. \nJason can take care of himself, but he still likes knowing that if he was beaten to death with a pipe for a second time, his new dad would at the very least invite his siblings to the funeral. \nMoving back in has come at a cost, though. Namely, he has to deal with being the only one of his family who is not wilfully blind to that the Replacement is clearly up to something. Some days, Jason thinks he’s going crazy with how obvious it is. How can nobody notice? \n“He literally excused himself from dinner yesterday to work on a project,” he tells Dick at breakfast, eyes wild. \nDick has not moved back in, Jason knows. What he does not know is why, then, he is somehow still always here. \n“I think it’s great that he’s taking school more seriously,” Dick tells him blithely. “Hey, are you eating that?”\n“Yeth,” Jason says after shoving the entire waffle into his mouth at once to prevent his idiot brother from taking it. \n“Anyway, I think you’re being a little paranoid. Leave the kid alone. When I went to check on him yesterday, he was at his desk doing homework. What’s your problem?” \nMy problem, Jason thinks, is that Tim doesn’t do homework. He hates school. Which Jason thinks is a bit rich of him, figuratively and literally, because going to school is a privilege that was ripped from Jason when he died at sixteen, and the least Tim could do is to show up to his English Lit class on time. But he doesn’t say any of that, partly because he’s aware that he sounds like jealous and spiteful, and partly because the Replacement has just entered the dining room, followed by Superboy, who holds himself like a bodyguard. Well, like Tim’s bodyguard. \n“Tim,” Dick says happily, “come sit with us.”\n“No time,” Tim says, “I’m kind of in the middle of something.” He makes a beeline for the plate with waffles that Alfred has deposited on the table earlier, frowning when Jason pulls it out of his reach. \n“In the middle of what?” he demands. \n“Decapitating someone and putting their head in a duffle bag,” Tim says. “Oh, wait, that’s you. Give me a waffle.”\n“Not until you tell me what you’re up to, holed up in that room all the time.”\n“Homework,” Tim says, obviously lying. \nDick has never looked more smug. See, his face seems to say, see, didn’t I tell you? But that’s why Dick is the one who got his tongue stuck to a pole one time, and yes, Jason also got his tongue stuck to a pole, but he did it on a dare. Dick did it to see what happens. There’s a difference. \n“You’re not getting food until you cut the crap,” Jason says, then curses suddenly and violently when Conner twists his arm to take the plate away and hold it out to Tim. Tim selects a waffle and nods at his boyfriend, who returns the plate to the table and follows Tim out of the room, throwing them all a suspicious look. \n“Let’s go,” Tim says, voice muffled, just before he rounds the corner, “if I can get the others off my back for a little longer, I can finish this by the end of the week.”\n“Did you hear that,” Jason hisses.\n“I heard you harassing your little brother,” Dick says primly, and refuses to talk any longer about Jason’s completely valid concerns. \nBut Tim is up to something. Jason knows he is. And he’s going to get to the bottom of it if it kills him (again).\n*\n“Pass the remote, Replacement.”\n“If you call me Replacement one more time-“\n“Timothy, if you pass the remote to me, I will reward you generously.”\n“Tim. Timmy. Timtam. Give it to me. Give it to your favourite big brother. Come on.”\n“It is my turn to pick the movie, and I am not going to let any of your vultures take that from me. Especially not since I was going to skip movie night in the first place, if you hadn’t dragged me from my room.”\n“Yes, because we all suspect you’re building a bomb in there. What? Don’t look at me like that, Dick, it's not harassment if it’s true.”\nBruce smiles to himself as he walks past the television room. His children are going to be arguing for a while longer, so there is plenty of time left before the movie starts.\nIn the kitchen, Alfred is making popcorn, though he turns at Bruce’s approach. “Sir?”\n“They’re still arguing.”\n“Ah.” Alfred returns to his task and Bruce, content to just watch for a while, sits down at the massive kitchen island and props his chin up on his folded hands. He feels like a teenager again, watching Alfred cook for him and having his offers of help firmly, but politely declined. The Alfred from his universe had never let him help, not once. Bruce hadn’t known how to fry an egg until he was twenty-five.\nHe hadn’t known how to cook anything until he was twenty-five. He’d had to teach himself. \n“Alfred,” he says, and stops, unsure what to say. \nAlfred faces him again, his face kind. His wrinkles are deeper than Bruce remembers from his Alfred, but then again, the last time he saw Alfred was over twenty years ago. \n“Master Bruce?”\nBruce shakes his head. “I’m sorry, it’s nothing. Please continue.”\nAlfred does. The corn has started popping in the pan, an unrhythmic plop-plop-plop that sounds like it’s hailing. Trusting that this spectacle is going to continue on for a while, Alfred turns to another pot, where he’s been preparing hot chocolate. He stirs, each movement practiced and calm, and his voice is calm, too, when he asks, “If you don’t mind me asking – how did I die? In your universe?”\nEvery muscle in Bruce’s body tenses. But somehow, he can still speak, even though by all rights he should have been rendered mute by the question. \n“Accident,” he says. “It wasn’t anybody’s fault. Just an unfortunate combination of circumstances.”\n“That,” Alfred says, “is most often the case, I’ve found.” He stirs some more. The popcorn continues plop-plop-plopping. \n“Alfred,” Bruce starts again. “I-“ He stops when Alfred sets down a steaming mug of hot chocolate in front of him. “What is this?”\n“A cure for ailments of the heart.” \nPlop-plop-plop.\n“I miss you,” Bruce says suddenly. “You’re right in front of me, and I still miss you. Do you think that’s odd, Alfred?”\n“Wherever my counterpart is now,” Alfred says, the wrinkles on his face deepening as he smiles wistfully, “I’m sure he misses you, too, sir.”\n*\nTim is not, unlike what Jason seems to think, completely oblivious. He knows that for the past couple of weeks, Jason has been tailing him, stalking him, for lack of a better word, and the irony of it makes him laugh. Who would have thought, once upon a time, that their roles would end up being reversed? These days he can barely round a corner without running to Jason, who will stand there with his arms crossed and his eyes narrowed, and it would drive Tim crazy. He’d surely assume that Jason is out to ruin his plans, not on purpose, but because Jason is, to be honest, the most unreliable and unstable person Tim knows. \nSo, yeah, Tim knows that Jason thinks he’s up to something, and he’d probably be worried about him ruining everything.\nIf it weren’t for the fact that he has already finished the antidote last week. \nThe thing is that once you understand how the multiverse works, it’s not that hard to figure out the rest. All he needed to do was to figure out the blueprints of a time machine, combine that with the blueprints of a submarine, then steal a probe of Bruce’s blood, and then- \nIt doesn’t matter. Tim figured it out, is the point, and it wasn’t that hard, because he really was not lying to Bruce when he said that his issue with physics is not that he doesn’t understand. So he built the machine, and the result of his efforts is a small vial with a clear fluid inside. Harmless to anybody who drinks it except people whose consciousness is stuck in another universe. Bruce can mix it in orange juice, tea, soup, or he can even just drink it undiluted. As soon as he finishes it, his consciousness will be swapped with Batman’s consciousness, and everyone will be back in their original universe. \nThe vial has sat in the drawer of his desk, untouched, for several days now. \nHe hasn’t told anyone about it, not even Conner. Conner knows what he was working on, but Tim hasn’t told him that he’s done. Conner assumes that Tim hit a snag, that he’s been taking a break to figure out what the problem is, and Tim hasn’t corrected him. Worse, he’s told Bart to distract Conner by taking him on a Teen Titans mission. \nTim feels sort of bad about that. He knows that Bruce wishes all of them would quit, not just his own kids, but all of the Teen Titans, too. But he also knows that Conner and Bart aren’t going to, and he suspects that Bruce, who told Conner that he’s welcome in the manor every time and offered to sue Superman for paternity rights, knows it, too, even though he doesn’t want to admit it. \nSo Conner has been gone from the manor for a few days, everyone else thinks he’s working on a school project, and Jason thinks he’s building nuclear weapons. \nTo distract himself, he goes on a rowing trip with his family. \nSummer vacation starts next week, and Bruce has been talking about going on a holiday, just them and Alfred, somewhere warm and sunny. \nIt’s warm and sunny today, and it’s even hotter in the car. They had to split into two groups, and Tim  rides with Dick and Jason, and they fight over who gets to drive the entire time it takes them to get to the lake, getting lost two times in the process, and when they finally arrive, Bruce and Damian are already there, wearing lifejackets and setting up the two boats.\n“Dami and I were getting worried about you,” Bruce says, eyes twinkling, as he hands them paddles. “We thought you had gotten lost.”\n“We know you got lost,” Damian corrects, “but Father told me to be nice about it. Timothy, I wish us to share a boat. You may try to regain your sense of navigation.”\n“Oh, um, sure,” Tim says, surprised. It doesn’t take long for him to realise the reasoning behind Damian’s suggestion. They’ve been rowing for approximately five minutes when behind them, Dick and Jason’s argument, continued on straight from the car, gets louder, drowning out Bruce’s soothing rumble, and two minutes after that, there is a huge splash. \n“Should we check on them?” Tim asks. \n“They will be fine,” Damian decides, and continues rowing. \nBruce, Dick and Jason’s boat gets overturned three more times. After the second time, they lose one of the paddles. Bruce gives one of his to Jason, who promptly starts using it to start an impromptu sword fight with Dick. They all land in the water again, and lose two more paddles. Tim hasn’t laughed this hard in a really long time. \nStill, it’s nice. Bruce made them all put on sunscreen earlier, but it’s still so hot that Tim’s nose gets sunburned anyway, which he only realises when they take a picture together and he looks like a lobster on it. But that’s okay, because Jason, Bruce and Dick all look like the thing from the lake, completely swamped. Only Damian looks okay in the photo. \nAfter the guy who rented the boats to them has finished scolding Bruce for losing so many paddles and not keeping his kids in check, they all go out for burgers. Just before entering the restaurant, Tim stops, falling to the back of the group and letting them enter before him. He doesn’t follow them in. \nBruce, noticing, has let himself fall back, too, and now he gives Tim a quizzical look. \n“What’s up, champ? That sunburn bothering you?”\n“It’s fine,” Tim says, hands flying up to probe at his face automatically. He doesn’t explain. \nBruce waits for a few seconds and then smiles. “Your birthday is coming up,” he says. “Two more weeks, right?”\nTim has to think about it for a moment. “Yes,” he says then. “I think so.”\nBruce laughs and reaches out to ruffle his hair. “Forgot about it, did you? Well, it’s of no consequence. Seventeen is a big number. We’ll have to do something nice. What did you do last year?”\n“Oh,” Tim says, feeling supremely awkward, “well. I had a lot going on at the time, so it kind of slipped my mind. Bart and Conner planned this surprise party with all of the Teen Titans, but then we got this hologram message from the future, about how one family member would betray us all, so I spent like, the entire day dealing with that crisis.”\n“Oh,” Bruce echoes. “That sounds-“\n“And then,” Tim says, on a roll now, “after, like, two days of fearing that one of the people I trust most in the world would poison us all in our sleep, it turned out that it was all a hoax. It was Batman’s birthday gift to me.”\n“Batman’s birthday gift to you was…trust issues?”\n“He said it was to test my detective skills,” Tim says, and he’s surprised by how bitter he sounds. He hadn’t been this bitter at the time, he thinks. Just, well. He’d been happy about that surprise party, back then, and he’d maybe been a little upset that they had to cancel it all to investigate a case that turned out to be an elaborate prank. They didn’t even get to eat the cake. \nBruce is silent for several seconds before slinging an arm around his shoulders and pulling him in tight as he steers them in the direction of the restaurant. “Luckily, I love throwing birthday parties,” he says. Tim knows that he is keeping his tone deliberately light, but he doesn’t mind. “Do you like ice cream cake? I always wanted ice cream cake when I was a kid. Alfred hated it.”\n“Ice cream cake sounds nice,” Tim offers politely. He doesn’t particularly care for sweets, but it’s not about that. It hadn’t been about that at his last birthday either. \n“And we’ll have to get you a party hat,” Bruce is continuing, “and, hey, do you want a bouncy castle?”\n“I’m turning seventeen, not seven,” Tim reminds him. Bruce laughs and ruffles his hair again like Tim has said something hilarious, and Tim melts into the touch because he’s weak like that. \n“Right you are, buddy,” he says. “Well, is seventeen too old for gifts, too? I thought not,” he says when Tim shakes his head. “What do you want?”\n“A tattoo,” Tim says promptly. “And a gun.”\nBruce laughs again, eyes sparkling with fondness, and he doesn’t let go of Tim all the way until they are seated with the others. \nTim is going to really miss this.\n*\nThey’ve developed a routine of sorts, during the first week of summer holidays. Bruce will wake up first, because he’s always been an early riser. He will have an early breakfast with Alfred, then do his morning yoga in what he and his parents have always called the “garden” even though it has approximately the size of a mid-sized town, and by the time he goes back inside, sweat dripping from his brow, Damian will be up, too. He will have a small second breakfast with his youngest son before driving him to the art class he’s taking at a local community centre, and when he gets back from that, Dick and Jason will already be halfway through the first argument of the day. It’s nice, sitting down at the kitchen island with a small third breakfast and letting their voices wash over him. \nFinally, Dick will leave to give Damian a ride home or, usually, get distracted on the way back and make a detour to go get ice cream together, and Jason will be off to his room, where he will blast music loud enough to be heard in every single room of the manor. “It’s a phase,” Bruce had told Alfred just yesterday. “He’s testing me. He’ll get over it.”\n“If you say so, sir,” Alfred had agreed, but he’d sounded doubtful about it. \nAnd finally, awoken by the sound of persistent screaming (Jason’s taste in music leaves much to be desired), Tim will wake up, stumble into the kitchen, and Bruce will have an even smaller fourth breakfast while his son works his way through two pots of coffee. \nIt's nice, all of it. Bruce likes having all his kids home. He’ll take them all on a real vacation soon. To the beach, maybe. All children should spend time at the beach at least once a year. Skiing is nice, too, but that’s more of a winter activity. He can still take them skiing for Christmas. Or maybe it’s better to celebrate Christmas at home, and they can go over New Year’s. He’ll figure it out. \nThe music has started five minutes ago and, right on time, Tim arrives in the kitchen. Alfred sets down a plate with bacon and eggs in front of him, a smaller plate with cut-up fruit in front of Bruce, and pours Tim coffee and Bruce a glass of freshly pressed orange juice. \n“Trade you a piece of mango for a piece of bacon,” Bruce whispers conspiratorially as soon as Alfred’s back is turned, holding out his fork. Tim allows him to steal some bacon and accepts a piece of pineapple in return, but his heart doesn’t seem to be in it. Perhaps he didn’t sleep well. \n“Alfred,” he says, “are you going grocery shopping today?”\nAlfred puts the last plate in the dishwasher, turns it on and, as the faint rumbling starts, says, “I’m just about to leave, Master Bruce. Any special requests?”\n“Chocolate,” Bruce says. “Tim isn’t feeling well. Chocolate will do the trick.”\n“Wise words, sir,” Alfred says, taking out the grocery list to write down chocolate. “I do believe you missed your true calling as a doctor.” \n“I’m feeling fine,” Tim says, once Alfred is gone. “You didn’t have to do that.”\n“Technically, Alfred is doing it,” Bruce says. “I’m just paying the grocery bill. And the dentist bill later on.”\nIt makes Tim smile, but weakly, like he’s only going through the motions for Bruce’s sake. \n“Iced tea,” he decides. “It’s too hot for anything else. None of that coffee nonsense today. And then we’ll go do something fun afterwards. How do you feel about going to the pool?”\nHe stands, rummaging around in the fridge in search of the iced tea he knows for a fact Alfred prepared earlier this morning. When he finally finds it, he pours a glass for Tim and puts a pink umbrella in it to lighten his mood. Tim smiles at it as Bruce presents it to him, but again, it seems pale. \n“Thanks,” he says. \nBruce nods and eats more fruit and steals another piece of bacon. He’ll need more protein if they really are going to the pool. He should text Dick, tell him to gather up Damian and meet them there. He can bring their swimming clothes. \n“Bruce,” Tim says, just as Bruce lifts the glass of juice to his mouth. Bruce immediately sets it back down, concerned. \n“Yes?”\nTim’s eyes are glued to the glass. “Nothing,” he says. “Sorry.”\nBruce glances from the juice to the iced tea. “Would you like to swap?” he asks. “Sorry, I didn’t even ask if you wanted juice instead.”\n“Iced tea is fine,” Tim says, and quietly repeats, “Sorry.” Bruce doesn’t know what he’s sorry for, but he hesitates to ask. In his experience, it’s not always good to push. Tim will come to him when he’s ready. \nThey eat in silence for a while, Tim more solemn than usual, and Bruce worrying about Tim being worried. Maybe, he thinks, it’s boy troubles. “Conner hasn’t come to visit in a while,” he says casually. \n“He’s on a mission with Impul- with Bart.”\n“Are Conner and Bart close?” Bruce asks, aiming for casual again. Judging by the look Tim gives him, he's not very successful at it.\n“Conner and Bart are friends. Conner and I are also friends.”\n“Sure,” Bruce says. “You should invite him over again. I meant it when I said Conner could stay with us any time.”\nTim swallows audibly. “I know,” he says. “I appreciate it.”\n“Any time, kiddo,” Bruce says, and wonders why Tim looks so sad. He lifts his juice to his mouth to hide the downward tilt of his lips, not wanting to concern Tim. Tim has enough on his plate as it is without Bruce to-\n“Stop!”\nBruce freezes. “What is it?”\nTim has gone deathly pale. “I need to tell you something.” \nFinally, Bruce thinks. \n“I’m listening,” he says. “Whenever you’re ready, buddy.” To underline his words, he puts one supportive hand on Tim’s bony shoulders. \nTim opens his mouth, but no sound comes out. He finally takes a sip of his iced tea, possibly to gather courage, possibly to stall. That’s okay. Bruce can wait. He uses the brief respite to take a sip of orange juice, half-wondering if he should have made some iced tea for himself, too. \n“I- did you drink that?” Tim asks suddenly, eyes wide. \nBruce sets the glass down. It’s still almost full, and at the sight of it, Tim slumps in relief. The words come rushing out of him now, tumbling over each other in haste. “I figured it out,” he says, “but then I wasn’t sure, but then you kept talking about that vacation, and my birthday, and you were being so nice, and suddenly I felt really bad because I realised I was actually being so unfair to you, you have this entire life to get back to and here I am, tying you down with making me packed lunches and sending me to school, and I’m just taking that choice away from you, I mean, you didn’t have any kids in your world, there’s probably a reason for that, right? So I- I just-“\n“Breathe,” Bruce advises him. “Take deep breaths, now.”\nTim takes a deep breath and looks him dead in the eye. “So earlier when you weren’t looking, I slipped something in your drink.”\nAh, Bruce thinks. \nTim doesn’t have to explain any further. Bruce can guess well enough. \nHe looks from Tim, to the glass of juice, and back to Tim. “So what now?” he asks. Calm. He sounds calm. \nHe does not feel calm. \n“I don’t know,” Tim says, sounding panicked. “You only took a sip of it, so it shouldn’t – or maybe it’s gone wrong. Maybe it never worked in the first place, maybe I screwed it up. I’m so sorry, Bruce.”\n“You didn’t screw up anything,” Bruce says. “In fact, I’m sure that you got it exactly right.”\n“Then why isn’t it working?”\nBruce thoughtfully regards the glass. “Maybe I need to drink it all,” he says. “I’ll just-“\nTim catches his wrist. “Stop,” he says again. “What are you doing?”\n“This is important to you,” Bruce says. “So it’s important to me, too.”\n“But I basically roofied you,” Tim protests. \n“Tim,” Bruce says, “it doesn’t matter what you do. I’ll always be on your side. I’ll always have your back. So let’s-“\nHe gets cut off mid-sentence. \n“-figure this out together,” he says to an empty kitchen.\n*\nFinally.\nBetween one blink and the next, Batman has been transported from the bedroom to the kitchen. He knows what this means. \nHe takes a second to inspect his surroundings. It wouldn’t do to make a mistake now. The curtains are drawn, probably to keep out the heat, and the calendar on the wall tells him it’s mid-July, same as the universe he just left. There is also Tim, dressed in shorts and a t-shirt and staring at him, fiddling with his hands like he’s nervous about something. \n“Bruce?” he asks tentatively. \n“Red Robin,” Batman says in greeting. “Took you long enough.”\nTim slumps. “I’m sorry,” he says. “I wasn’t sure which timeline you’d been transported to, so I first had to find your coordinates, which-“\n“Don’t make excuses,” Batman says. “Be better next time. Where are the others?”\n“Jason is in his room, and Dick and Damian-“ Tim stops as animated voices suddenly drift in from the direction of the foyer. “-just arrived.”\nHis room, Batman thinks. He’s been gone for several weeks. Did Jason move back in? Something to think about later. \n“Timothy,” Damian calls out before he’s even entered the kitchen, “you must give me a lift tomorrow. Grayson embarrassed me.”\n“Uh, guys-“\n“I didn’t embarrass him,” Dick says, coming in and immediately making a beeline towards the fridge, “all I did was-“\n“Guys-“\n“-you pinched my cheek. In front of everybody.”\n“Seriously, just-“\n“Enough,” Batman thunders, and instantly, everybody falls silent. He notes that Dick and Damian have snapped to attention. Good. “Nightwing,” he says, “you’re accompanying me to the Cave. I want to hear about your patrol routes during my absence. Robin, Red Robin, I expect to see you in the training room. No more slacking off, and no more-“ He nods towards the iced tea that’s sitting in front of Tim. “-indulgences.” \nTim nods, while the others appear to be frozen still. It doesn’t matter. Now that Batman is back, he has more than enough time to restore order to this house.\n*\nThe last few weeks have felt, at times, like a fever dream. Like something from Jason’s deepest, most secret desires. A family that only argues about who ate the last cereal instead of who made what mistakes on patrol. A father who genuinely cares. \nOther times, it’s felt almost like a cruel joke. This is what they could have had, had they only been born in a different timeline. \nFever dream or joke, whatever it is, it’s over now. It’s been over for days. On Wednesday morning, Jason came downstairs to find Damian and Tim training, and when he, following a hunch, went further downstairs to the Cave, he found Batman shouting at Dick. \nNot Bruce. Batman. \nThe worst thing is that Dick has just taken it. For as long as Jason can remember, Batman and Dick have gotten into screaming matches loud enough to be heard three houses over. It’s not been pleasant, exactly, but at least he always got the impression that Dick could hold his own. He still follows Batman where it counts, yes, but he also made it pretty clear when he disagreed with Batman’s methods. \nThat is not what Jason saw this time. \nThis time, Batman shouted while Dick just stood there, head bowed, fists clenched, like he actually agreed. \nJason didn’t stick around to see the rest. He can guess. \nSo he packed up his shit, and he returned to one of his safehouses, and he’s spent the days since then obsessively checking the news for any Batman and Robin sightings, and obsessively checking his phone for any news directly from his family. There are plenty of Batman sightings but, somehow, no Robin ones. \nHis phone stays silent. The family group chat, wherein just a few days ago Bruce had sent a clip of one cat licking another cat’s ears, and which is usually spammed by Dick at least once every hour, does not have a single new message added to it. It’s eery. \nIf Jason is honest with himself, which admittedly does not happen a whole lot, he can admit that he always knew they would have to return Bruce to his own universe eventually. That he was here in the first place was a fluke, and while Jason personally would have been happy to leave Batman stuck in another timeline, it’s clear that his siblings would disagree. \nBut. \nBruce had seemed so sure that he was going to stay for a while. He kept telling Jason to go to night school, get his diploma, and then go to college afterwards if he wants. He kept talking about what they should do for everyone’s birthdays, for Christmas, which weekend they should take off to go see the Grand Canyon. Those are not plans made by someone who plans to leave immediately. \nHe hasn’t even said goodbye, is the worst thing. Jason had been in his room listening to music, and when he stopped, Bruce had just been gone. He still doesn’t know how it happened – randomly, like it did the first time around? Or did Batman figure it out in the other universe and switched them back? Or – or did Bruce figure it out, somehow, and switched himself back on purpose? \nJason doesn’t know, and it’s driving him crazy. \nOn Saturday, he gets a phone call. \n“I am coming over,” Tim announces. “Which safehouse are you at? Wait, don’t tell me. The one next to the laundromat where they killed those folks by putting them in a washing machine last month?” \n“Yes,” Jason admits reluctantly. Gotham is so messed up. Then Tim’s words catch up with him. “Wait, what? Don’t come over.”\n“Too late,” Tim says and rings the bell, which doesn’t seem possible unless Tim has developed superhuman speech.\nThe mystery gets solved when Jason opens the door just in time to see Tim nodding towards Bart, who waves back before taking off. \nInside, Tim inspects every available surface, obviously searching for one that doesn’t have dried blood on it. He won’t find one, Jason knows, and indeed, Tim gives up eventually and just sits down on the couch. “You’re disgusting,” he declares. \n“My place may have a little blood problem,” Jason says, “but at least I’ve never broken an ankle tripping over all my shit because I’m chronically incapable of cleaning up.”\n“I’m not incapable of cleaning up, there’s an order to it, and I tripped over a rugby ball you had left there, going into my room without permission, and also I didn’t even break it.”\n“For someone who didn’t break it,” Jason says, “you sure cried about it like a little-“ He falters. “Wimp,” he says. \n“Nice save,” Tim says sarcastically. “And I didn’t cry, I- wait. Stop it. You’re doing it again.”\n“Doing what? I’m not doing anything.”\n“You’re riling me up because you want me to leave. That’s not going to work. You literally cannot do or say anything that would make your company less pleasant than staying in the manor right now.” Tim says it like a joke, but Jason doesn’t think it is, somehow. For the first time since Tim arrived, he really looks at him, and he finds he doesn’t like what he sees. \nIf Tim can look this defeated, he thinks, then what about Damian, who is younger? What about Dick, who Jason left alone in the middle of getting screamed at? \n“How’s the old man?” Jason asks, trying to find even footing again before this conversation gets away from him. \n“He’s-“ Tim’s breath hitches. Jason, alarmed, rests a hand on his shoulder in what he meant to be a supportive gesture the way he’s seen Bruce do, and what came out forceful enough to bruise. He wonders if Tim is going to cry. That would suck, like, so much. “He’s Batman,” Tim finally says. “That’s all there is to say, really.”\n“Yeah.”\nFor a while, neither of them says anything. Tim picks at the blood stains on the couch, and Jason tries again with the hand clap, doing a marginally better job this time. \nFinally, because if he doesn’t ask this he’s going to actually go insane, he says, “Did Bruce say anything to you before he left? I mean- did he say goodbye? Or, you know, something else. Or whatever. It’s cool.”\n“He said he’s on my side,” Tim says, smiling faintly with the memory. “Which was really nice of him, considering I’d just roofied him. He also-“\n“Stop, wait, stop, go back. You what?”\n“Oh,” Tim says, sitting up straighter and inching away from Jason a bit, “I sent him back to his universe.”\n“What.”\n“It was clear that none of you were going to do anything about it,” Tim says defensively, “and Batman couldn’t do it himself since that other universe didn’t have the right technology for it, so I had to step up and get him back. And I did.”\n“Stand up,” Jason demands. \n“What? Why?” \n“Just do it,” Jason says. \nTim stands up, clearly suspicious. Jason stands too. “Hey, quick question,” he says. “Do you actively try to be an asshole, or does it just come naturally?”\n“I-“\nJason cuts off his answer by sucker punching him. \n“Jesus Christ,” Tim yells as he goes down, “what the fuck-“\n“Language,” Jason snaps. “Get back up.”\n“I’m not getting back up if you’re just going to punch me again,” Tim says.\n“I won’t,” Jason says. “Come on.”\nTim has only just gotten back on his feet when Jason punches him again. \n“How dare you,” he says, his whole body vibrating with anger. “How can you just stand there, in my house, and tell me that you replaced our dad with an abusive sociopath because none of us had the guts to do it ourselves?”\n“I-“\n“Stop it,” Jason yells. “Stop evading. Stop lying. Just tell me- what did you expect would happen? Did you really think that Batman would return and he’d play house with us just because Bruce did? Are you seriously that delusional?”\n“Of course not,” Tim yells back. “But Bruce was stuck here. He didn’t choose this life, he was literally forced into it.”\n“Like you forced Batman to make you Robin?” Jason sneers. \nAnd suddenly, it’s like all the anger over being attacked just leaves Tim. He sounds perfectly calm when he says, “Yes. Exactly like that. Batman didn’t really want me. And Bruce didn’t really want us. It would’ve been unfair to make him stay here forever.”\n“No, you know what’s unfair? Putting words in his mouth. Making an assumption based on one man’s character because you just so happen to know an alternate version of him. Did you ask Bruce what he wanted? Of course you didn’t,” he says when Tim mutely shakes his head. “Because you already know best. You’re just like Batman.”\nTim flinches, harder than he did when Jason hit him. “I’m sorry,” he says quietly. “I really am. I- I was so nervous that Bruce would actually drink that glass. Every time he came near it, I kept wanting to take it away, to pour it all down the drain. But I also kept thinking, maybe this is for the best. Maybe I’m doing him a favour. I guess we’ll never know now. I’m sorry.” \nTim falls silent, but Jason’s mind is already working, stuck on what his little brother just said. I guess we’ll never know now. \nI guess we’ll never know now.\nI guess we’ll never-\n“Does it only work with switching consciousnesses?” he asks abruptly. “Or could you also send someone over entirely?”\n“Send someone over entirely, I guess,” Tim says. “Why-“\n“Do it. Send us over there. Let’s go talk to Bruce.” Jason offers Tim a hand up from the floor. Tim stares at it for several seconds, eyes flitting from the proffered hand to Jason’s face. \nHe takes it. \n“Alright,” he agrees. “Let’s talk to Bruce.”\n*\nDick is tired. He has never been this tired in his life. He came close a few times: When Bruce fired him as Robin. When Jason died. When Bruce died. For as long as he can remember, his life has fallen apart, restructured itself, and fallen apart again, in a never-ending cycle. This time it’s fallen apart not because Batman died, but because Batman returned. \nWhat’s worst, he thinks, is that he feels so guilty. When Tim brought Batman back last year, he’d been ecstatic to have him back, relieved to not have to shoulder the burden of Batman and raising Damian anymore. There is none of that now. There should be, but there isn’t. \nBatman thinks Dick failed. \nThe list of accusations is too long to count, so Dick hasn’t bothered. He’s let it all wash over him, has accepted the lecture on why he isn’t good enough, all the while thinking, who is going to kiss Damian goodnight now? Who is going to make sure Tim goes to school? Who is going to talk to Jason without yelling? \nDick. \nBut Dick has already tried to do all of that last time, and while he does a good job of being a big brother, he has to admit he didn’t do a great job at being a dad. He’s still going to try, because someone has to. \nBut a tiny, selfish part of him wonders why it can’t be Batman who tries for once. It’s Batman who adopted all of these kids. Why does it have to be Dick who makes sure this family doesn’t fall apart? \nHe's on his way to the Cave, where he’s supposed to be writing up detailed mission reports not of any actual missions, but on life at the manor these past few weeks, when he walks past the calendar that’s hanging in the kitchen. \nBefore Bruce, that calendar hadn’t held too much information. Some birthdays, if they remembered to note them down, Damian’s occasional dentist appointment, a gala Batman needed to attend as Bruce Wayne. But Bruce had been weirdly obsessed with that calendar. He’d insisted on putting down everything. Every appointment, every family activity, even mealtimes. Family Dinner: 7 pm is scrawled across every single day. \nLooking at it now, Dick immediately takes note of two things. First, Damian’s art class is doing an exhibition tonight. Second, it’s Tim’s birthday tomorrow.\nIn the Batcave, Batman is at the Batcomputer, evidently hacking into police files. “July 11th,” he says without turning around. “Where were you?”\n“I’m not sure,” Dick says. “Can I talk to you for a second?”\n“There was an armed robbery. In Nightwing’s domain. Where were you?” \nDick thinks back. “Parent-teacher’s night for Tim’s class, just before the holidays started,” he says as it comes back to him. “Bruce- I mean, the other you, went to talk to Tim’s teachers, and we all went out for pancakes afterwards to celebrate that Tim isn’t failing physics anymore.” \n“There was an armed robbery,” Batman repeats. “In Nightwing’s domain.”\n“And it was parent-teacher’s night for Tim’s class,” Dick repeats. \nAt this, Batman does turn around. He is scowling. “Red Robin is a vigilante. Tim Drake is CEO of Wayne Enterprises. What is he doing in high school?”\n“Getting his diploma, I suppose,” Dick snaps before he can stop himself. “Look, can we not do this right now? I wanted to talk to you about something.”\n“I will talk to Red Robin about this,” Batman says, no longer listening. He types something, then asks, “Where were you on June 29th?”\nSensing that this isn’t going anywhere, Dick decides to ignore him. “Damian’s art class has an exhibition tonight at eight,” he says. “Their teacher rented a room at Gotham Gallery for it. I’m going, obviously, but I just wanted to ask- well, I just think it’d be nice for Damian if you could come, too.”\n“June 29th. Another robbery in Nightwing’s domain.”\n“Did you hear what I said?”\n“I heard you.”\n“Well? Are you coming?”\n“I don’t have time to attend the school events of a fifth grader. Neither should you or Robin. I expected better from you both.”\n“Damian,” Dick says slowly, “is ten years old.”\n“He is Robin.”\nDick laughs. It comes out slightly hysterical. He is feeling slightly hysterical. “This is pointless,” he realises. “I don’t know why I bothered. By the way, it’s Tim’s birthday tomorrow. He’s turning seventeen. Did you know that? Do you care? What do you think we should get him as a gift? Should we bake him a cake? Or is cake too much of an indulgence for a seventeen-year-old?”\n“You are forgetting yourself.”\n“I don’t think I am. I think I’ve never seen things more clearly, actually.” Dick laughs again. The absurdity of the situation hits him all at once. “We’re not your kids, we’re your soldiers. I can’t believe I never realised this before.”\n“Nightwing, take a walk,” Batman orders sharply. “Come back when you’ve composed yourself.” \n“You know what the funny thing is? You almost got me to be just like you. I thought I was, when I made Damian Robin. I thought I was doomed to repeat your mistakes, over and over again. But then I realised that I don’t have to. That if I do something wrong, I can make up for it. I can try again, try to get it right this time around. Have you ever done that? Just once? I don’t think you have. I think you just wait until the next kid comes around. The next blank slate who can be turned into Robin.”\n“Enough.” Batman stands, and for one crazy moment, Dick thinks Batman is going to hit him. But Batman just points at the door. “Leave, or I’ll make you.”\n“Fuck you,” Dick says. “Just, seriously, go fuck yourself. I don’t care. I’m done.” Every instinct in him is screaming not to turn his back on Batman, but he does. \nHe's only taken three steps when he runs into a broad chest. Batman. \nNo, not Batman. \nBruce.\n*\nBruce has never thought about how big his house is. How ridiculous it is for a single person to live in a manor. There is nothing but space here, nothing but empty rooms, nothing but silence except for his own footsteps. \nHe tries to take time off work, only to realise that in his absence, his counterpart has already informed Wayne Enterprises that he’s going on an extended sabbatical. All for the better. This way, Bruce can quite literally spend all his time brooding. \nThe first thing he does, when he realises what happened, is to look up Dick and Jason. He finds nothing on Dick, but there is an article about Jason, just a photo of all the high school graduates from some local school, with Jason, who towers over most of his classmates, standing in the last row, third from left and smiling into the camera. \nTim, he doesn’t have to google. He knows he’s just a house over, no more than a mile away. That makes it worse, somehow. \nDamian, he doesn’t have to google either. In this universe, Bruce has never slept with Damian’s mother, so Damian does not exist. \nBruce thinks about going to see Tim, at least, but he doesn’t even finish the thought before realising that there’s no way he could. Not only would it break his heart, but it is also just plainly creepy, visiting an almost-seventeen-year-old who doesn’t know him. \nAlmost seventeen.\nHe's going to miss Tim’s birthday, and Damian’s exhibition, and the rugby game Jason wanted to go see with him even though neither of them care about rugby, and his weekly midnight milkshake with Dick. Instead, his counterpart is going to get to do all of that with them, and the worst thing, the absolute worst thing, is that Bruce knows, deep down, from all he knows about Batman, that his counterpart isn’t going to bother. \nHe wonders how long it’s going to take before Tim and Damian go back to being vigilantes. How long until Tim drops out of school, until Damian drops out of school. Until Jason moves back out. \nHe is so busy brooding that he almost misses the sound of the key clicking inside the lock. Almost.\n“I can’t believe that worked,” someone says, just as Bruce has gripped a vase to use as a potential weapon. “Same locks. That doesn’t seem very safe.”\n“To be fair, it’s not like people regularly jump in between timelines just to rob themselves,” says a second voice. \nBruce knows both of these voices.\nHe drops the vase.\nFootsteps, but not his own this time. Two sets, one slightly heavier than the other. \nBruce doesn’t wait for them to reach them. He meets them halfway. Just as they round the corner, he pulls both of them into a hug, not giving them time to breathe, to say anything, to do anything but hug him back.\nSomehow, Tim and Jason have come to his universe, and they’ve come to see him. “Bruce,” comes Tim’s slightly choked voice, “let me go- you’re strangling me-“\nBruce pulls back, but only slightly, just enough to ease up. “Let me enjoy this,” he mumbles into their hair. “Just a moment longer.”\nHe's not sure, but he thinks Jason just hissed, See?\n“Alright,” he says when he finally feels ready to let them go. “Out with it. What’s the bad news?”\n“There aren’t any,” Tim says at the same time that Jason says, “We want you to come back because we hate Batman.”\nBruce’s mouth drops open. \n“I’m serious,” Jason says. “Batman sucks. And you don’t suck, so we want you back. You have to come home with us.” And, when Bruce doesn’t immediately reply, he adds a quiet, devastating, “Please, Bruce.”\nTim, unaware of the many conflicting emotions raging inside Bruce right now, elbows his brother and says, “That’s not- we’re not guilt-tripping you. I swear we’re not. Any choice you make is fine. We just wanted- I guess we just wanted you to know that you can come home with us. If you wanted to.”\nJason nods rapidly, looking more desperate than Bruce has ever seen him. “Please,” he says again. \nBruce’s heart is breaking, breaking, breaking. \n“Ah, children,” he says quietly. “I’m sorry for leaving you like that.”\nTim rubs the back of his neck. “I’m sorry,” he says. “I thought I was doing you a favour.”\n“I know,” Bruce says simply, and Tim’s eyes widen in surprise. “You said so already when I drank that juice. You said that you knew I didn’t have any kids in this universe, and that there must be a reason. Isn’t that right?”\n“Yeah,” Tim admits. \n“Well, you’re right. There is a reason. I’ve always thought myself to be pretty indifferent to children. Had the right partner come alone, I would’ve been open, but she never did, so it’s never even been a consideration. Deep down, I always suspected that I might not make the best father. But when I woke up in your universe and realised I had not just one child, but four, all that indifference and all of those worries just fell away, just like that. Suddenly, there was nothing more important than you kids. And it’s been killing me, knowing that I’m just standing in for somebody else, somebody who puts you in danger and doesn’t care for your wellbeing, somebody who wears my face while telling you you’re inadequate.” Bruce stops, breathes for a moment. “As far as I’m concerned, you’re my kids. Mine. Not Batman’s. I can appreciate you trying to give me a choice, but to be honest, my choice was made the minute I woke up in that bed and heard your voices.” \n“So you’re coming with us?” Jason demands. \nBruce nods. “I’m coming with you. But first, let me pack a suitcase. If I’m taking Batman’s place, I want to do it in my own clothes this time.”\n*\nThey end up bringing three suitcases and a yoga mat. Bruce is carrying two suitcases, Jason is carrying one, and Tim was allowed to carry the yoga mat. He feels vaguely insulted, but mostly, he feels really, breathtakingly, burst-to-the-brims happy. He keeps glancing at Bruce from the side as they walk through the hallways of the manor – well, both manors –, worried that if he blinks or looks away, Bruce is going to just disappear. But he doesn’t. He stays, and every time he catches Tim looking, he smiles at him. \nJason must be happy too, Tim thinks. He, too, glances at Bruce a lot. \nBruce is staying. Batman is still here, and they can’t exactly send him back to the other universe, which means they have two Bruce Waynes now and they will have to figure something out, but none of that matters right now, because Bruce is staying, and that’s the most important part. Tim thinks he can take a hundred punches to the face for that. \n“How did you get that black eye?” Bruce had asked earlier during packing, and Tim had shrugged. \n“Slight disagreement between brothers,” he’d replied. “We’re fine now.”\n“If you say so,” Bruce had said, clearly doubtful, but willing to let it slide. \n“I can’t wait to see Dickie’s face,” Jason says now, after they’ve finished putting Bruce’s things into his bedroom. “What do you think he’s going to say?” \nEver since they arrived back in this timeline, Bruce hasn’t said all that much. His eyes have a faraway look in them, like he’s thinking about something else entirely. “I think-“ He stops, suddenly, head tilted slightly. “Let’s go.”“Go where?” Jason asks, but Bruce is already walking through the hallways at a brisk pace. “Bruce! Go where?”\nTim swallows. He knows what Bruce heard. “Dick is shouting,” he says. “Down in the Cave.” \nJason’s hesitation only lasts a second before he nods and starts jogging to catch up with Bruce. “Hey, Bruce! Wait up!”\nBruce doesn’t wait up. By the time he reaches the grandfather clock in the main study, Tim and Jason have to run to keep up with him. “What’s the code?” Bruce asks, voice unusually sharp. \nTim and Jason both wince. \n“What?” Bruce asks impatiently. “I saw you kids open this entrance by resetting the time, but I didn’t see the numbers. Is it the day of someone else’s gruesome murder? What is it?”\n“Ten-forty-eight,” Tim says. “That’s the time your-“\n“Of course,” Bruce says as he moves the hands to 10:48, the time his parents died. “Of course it is.”\nThe shouting gets louder as they enter the Cave, loud enough to make out some words. They’re arguing about Damian, Tim thinks, and, with a sinking feeling, realises that no, now they stopped to argue about him instead. It makes his breathing go all funny, listening to two people argue about his birthday, of all things, about the way he’d behaved at that last gala, about his C in English, about whether hiring a new nanny is really worth it if he’s old enough to take care of himself-\n“Hey,” Jason says, flicking his fingers against Tim’s face and bringing him back to reality. “Don’t space out.”\n“I’m not spacing out,” Tim says, but he says it absently, because now that he’s tuned back in, he can hear Dick yelling-\n“I think you just wait until the next kid comes around. The next blank slate who can be turned into Robin.”\nJason is frozen to the spot, and this time it’s Tim who flicks his fingers against his face. “Don’t space out,” he says, and, realising something is wrong- “Where’s Bruce?”\n“Enough.” That’s the growling voice of Batman, ringing through the Cave like a gunshot. “Leave, or I’ll make you.”\n“Fuck you,” Dick says, just as they enter the main area of the Cave. Batman and Dick are facing each other, but Dick turns to leave, now, tenser than Tim has ever seen him. Angrier, too. “Just, seriously, go fuck yourself. I don’t care. I’m done.” \nBruce steps out of the shadows just as Dick goes to leave. It is, Tim reflects, a very Batman-like thing to do. \nDick freezes at the sight of Bruce. \nSo does Batman. \n“Bruce?” Dick asks, shocked. “What are you doing here? Why aren’t you back in your own universe?”\n“Your brothers reminded me of something important,” Bruce says, lips quirking upwards. \n“What?”\n“That all the people I care about are in this universe.”\nDick hugs him, then, and Tim is torn between the urge to step forward and join in, and to keep his distance and avert his eyes, because this moment feels too intimate somehow. \nIt turns out he needn’t have worried, because Batman seems to have regained his composure. “Nightwing, step away,” he growls. “Now.”\nIt's pretty clear to Tim that Dick intends to do no such thing, but then Bruce is shoving him away – no, shoving him behind him. And as Batman takes one threatening step forward, Tim realises that Jason just stepped in front of him, too. Bruce is shielding Dick, and Jason is shielding Tim, and it’s ridiculous because neither of them need protection since they can handle themselves, but it still makes Tim’s eyes prickle. \nIt's only later that he thinks about it and knows: he knew they could protect themselves, he didn't know that Batman wouldn't hurt them. He still isn't sure. \n“Get away from him,” Batman demands. It is unclear whether he is talking to Bruce or to Dick, until he says, “You are a danger to this universe. You have managed to compromise Nightwing and the others. I don’t know what method you used, but rest assured that I will find out, and I will make you pay.”\n“My method,” Bruce says, “is called parenting. You should try it sometime.”\nBatman takes another step forward. And suddenly Tim can see it all play out in his mind. He knows exactly what’s going to happen. \nBatman has two priorities right now: get Dick away, and subdue Bruce. Since talking has not worked, and Bruce is shielding Dick, Batman will have to act on the second agenda in order to complete the first. He is going to attack Bruce. \nBruce will put up a fight. By now, Tim has learned not to underestimate him. So Bruce will fight. \nBut in the end, Batman is more skilled, more experienced. He may not be wearing his armour, but Bruce is still no match for him. It's going to be quick and brutal, and by the end of it, Bruce will end up locked in a cell, likely injured, highly guarded, until Batman figures out what to do with him. Tim can see it all.\nBut nobody sees him. They aren’t paying attention to him at all. Batman is slowly approaching, Bruce is trying to keep Dick behind him, and Jason- \nJason is looking straight at Tim, eyes narrowed. Then he nods. And then he flicks Tim’s face.\n“This is your last chance,” Batman says. Then he seems to sense something, years of fighting crime having honed his instincts, and he turns his head slightly, but it’s too late. \nTim’s plan had been to put himself between Bruce and Batman, catching the first and maybe second hit while Dick realises what’s going on and gets Bruce to safety. \nThat, it turns out, is not Jason’s plan.\nJason has taken out his gun and shot Batman in the thigh. \nBatman, to his credit, doesn’t go down. He merely grimaces, but remains standing, eyes going from Jason, to Dick, and finally settling on Tim. “Red Robin,” he snaps. “Don’t just stand there. Help.”\nTim crosses his arms and doesn’t move. “My name,” he says, “is Tim.”\n*\nMetropolis is too bright. Batman needs darkness, needs the shadows, needs Gotham. But it has been made clear by the impostor that Gotham is off-limits. That Wayne Manor is off-limits. Batman’s life has been stolen from him by someone who wears his face and bears his name, and he has had no choice but to let this happen, because with an injury like that, it’s best to retreat. \nHe cannot believe Jason shot him. \nHe cannot believe his children would turn on him like that. Nightwing, perhaps. He’s always been weak, eager to please. Jason, maybe, at least the Jayson that returned from the dead. \nBut Red Robin and Robin. Their betrayal, Batman had not expected. \nFollowing a strange impulse, he pulls out his phone. His actual phone; the one thing the impostor has not been able to take from him. His thigh hurts as he has to stretch to get it from the couch table – Ikea, he notes sourly. Clark has abysmal taste –, but he manages. \nHe pulls up the group chat without thinking. There have not been any new messages in several days; no doubt they created another as soon as Batman was out the door, flown away to safety by Superman. \nHe scrolls up, past cat videos and strings of emojis, some of which the impostor has sent, until he reaches the first photograph. It’s the five of them, standing in front of a lake and smiling widely, except that it’s not the five of them, because that person on the picture is not Batman. \nBruce Wayne looks happier, he thinks. Happier than Batman can ever remember himself being. \nHe closes the chat, puts away the phone, and leans back. As he does, his eyes fall on the calendar in the kitchen. July 19th. Something in his memory shifts, ready to be acknowledged, but as much as he thinks about it, he can’t remember why today’s date would ring a bell.\nHe supposes that if he cannot recall, it can’t be that important."
}