{
    "id": "38084926",
    "url": "https://archiveofourown.org/works/38084926?view_full_work=true",
    "author": [
        "TheResurrectionist"
    ],
    "title": "blinding lights",
    "rating": "Not Rated",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "Batman - All Media Types"
    ],
    "relationships": [
        "Bruce Wayne & the guys who kidnap him all the time",
        "Bruce Wayne & His Kids",
        "Clark Kent/Bruce Wayne"
    ],
    "characters": [
        "Bruce Wayne",
        "OC Henchmen",
        "Clark Kent",
        "Dick Grayson",
        "Jason Todd"
    ],
    "additional_tags": [
        "Crack",
        "Crack Treated Seriously",
        "Based on a Tumblr Post",
        "POV Outsider",
        "Bruce Wayne is Brucie Wayne",
        "Bruce Wayne is a Good Parent",
        "Secret Identity",
        "Kidnapping",
        "Enemies to Friends",
        "worried people being overprotective of one of the secretly most competent men ever",
        "no beta we die like jason todd",
        "Unresolved Romantic Tension",
        "Unresolved Sexual Tension",
        "one of them's with jerry and one's with clark",
        "you gotta guess",
        "Secret Identity Fail",
        "Protective Clark Kent",
        "jerry looks just like his counterpart in world war z fyi",
        "which means clark is beefing with brad pitt",
        "Knives",
        "this is such shitty crack i'm sorry y'all"
    ],
    "language": "English",
    "series": "Part 2 of kidnapping bruce wayne 'versePart 4 of DC outsider POV",
    "published": "2022-03-31",
    "completed": "2022-04-08",
    "words": "6,587",
    "chapters": "3/3",
    "comments": "338",
    "kudos": "6,601",
    "bookmarks": "589",
    "hits": "36,824",
    "summary": "<p>\n<em>“It’s legit. Contract security for an event.”</em>\n</p>\n<p><em>At the word </em>legit,<em> the entire room cringed back in distaste. Jerry held up his hands, heading off the inevitable protests before they could start. </em></p>\n<p>\n<em>“I know. I know we said we weren’t doing any legit jobs. But this one is special.”</em>\n</p>\n<p>\n<em>“Who’s the client?” Jimmy asked, perceptive as ever. Jerry fought to keep himself from smiling, lowering his hands. </em>\n</p>\n<p>\n<em>“Bruce Wayne.”</em>\n</p>",
    "notes": "<p>Thanks to everyone who commented and shared the first fic! Decided to give this trope/idea some more screen time, since it's hilarious. \"turn the beat around\" is recommended, but not required to read this.</p>\n<p>I'm planning on getting those next two chapters out ASAP. Hope you enjoy!</p>\n<p>Thanks for all the awesome comments y'all! I appreciate them so much. </p>\n<p>Here's the next chapter. Third part is written but needs a little editing love :) hoping to get that out ASAP.</p>\n<p>For this next part, I think it's 100 times funnier if you remember that: <br>a) the boys are trying to protect Batman himself from death threats &amp; kidnapping attempts, and are really only there for plausible deniability <br>b) Clark is absolutely furious with Bruce's lack of security and can't do shit about it, because Superman doesn't know Bruce Wayne, and Bruce wants to keep it that way <br>c) only Bruce and Clark know this</p>\n<p>Last chapter! Thanks for sticking with it, folks. Hoping to maybe do more with this 'verse soon.</p>\n<p>Another fun reminder:<br>a) Clark can hear everything they're saying outside the massage room<br>b) Bruce can't<br>c) none of what they said really registers with him until he's home later</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>That’s all for now! </p>\n<p>Liked it? Leave me a comment and let me know what you thought :)</p>",
    "text": "“So,” Wayne said, wincing as Bill tightened the cuffs around his wrists, “No zip ties today?”\n“Yeah,” Jerry had already apologized three times for the metal handcuffs, and would likely continue for the duration of this kidnapping, “Client was real specific. Sorry, Mr. Wayne.”\nHe’d even blindfolded Wayne before he’d cuffed him this time, knowing that one look of pain in those blue eyes would have been their undoing. \n“Any discomfort?” Bill asked, manipulating the cuffs gently. He’d spent hours the previous day taping up the insides of the cuffs with soft tape, trying to blunt the edges as much as possible. \nThe new kid was sweet. And Jerry couldn’t really blame him. \n“Usually, with handcuffs, that’s the idea,” Wayne said salaciously, wiggling his eyebrows behind the blindfold. \nJerry groaned, holding up a finger only Bill could see. “What did I say about  Fifty Shades of Grey jokes?”\nWayne’s shoulders drooped. “That they’re culturally outdated?”\n“They’re  inappropriate,” Jerry said, but the words had little bite to them. He nodded at Bill, who was blushing a bright red, “Look, you’re corrupting poor Bill.”\nWayne turned dutifully toward Bill, frowning into the blindfold. “I apologize, Bill. I didn’t mean to make you feel uncomfortable.”\nBill shot Jerry a dirty look, tapping Wayne’s shoulder in reassurance. “Don’t worry about it, Mr. Wayne. I’m not uncomfortable.”\n“Good,” Wayne said, genuinely serious, “The power imbalances in a kidnapping really sneak up on me sometimes, you know?”\n“Yeah,” Jerry said, signing at Bill to start clearing their way to the van. Luckily, they’d managed to nab Wayne in between his yoga and “flow” classes -- whatever the hell that was -- and they weren’t far. “Let’s go.”\nWayne greeted all the boys as he clambered into the van, waving his cuffed hands in the direction of their voices. Everyone immediately perked up, helping the billionaire sit down and asking him excited questions about his day. \nIt had been almost two months since his last kidnapping, and Jerry could tell they’d been missing the man. He settled in behind Craig’s seat, tapping it twice to let him know they were clear. \n“Safehouse,” he said. Craig nodded, turning over the engine. “You got the food, right?”\n“The gluten free pasta?” Craig clarified, cranking the wheel and steering them out of the parking lot. “Yeah. Shit was like twenty fuckin’ bucks.”\nJerry caught his eyes in the mirror in warning. Craig shrugged, looking back at the road. \n“--and then, well, I guess her whole class was mostly Shavasana?” Wayne was saying to Bill, Dillon and Jimmy, who looked enraptured, “And we all paid for a flow class, so everyone was just  baffled.” \n“Did people leave?” Dillon asked, scandalized, “I would have.”\nDillon wouldn’t know a yoga pose if it hit him over the head, but Jerry relented, staying silent. \n“That’s the crazy thing,” Wayne continued, oblivious to the captive audience he’d created. Even Craig was listening. “Once we laid there for about twenty minutes, I swear something in my back cracked. She said it was my chakra releasing, but I’m pretty sure it was just my slipped disc finally settling back into place.”\nJimmy looked more than a little mischievous, leaning forward on his heels. “Hey, Jerry’s back bugs him sometimes. Maybe we could all try it out back at the house?”\nJerry shot him a dirty look, too. Wayne, again oblivious to the exchange over his head, perked up even further. \n“I'd love to,” he smiled, turning toward Jerry with unerring ease, “You won’t regret it! I promise. I might even have some essential oil in my bag, if you grabbed it.”\nJerry looked at Bill, who nodded, holding up the small backpack Wayne had with him in the parking lot. \n“We did.”\n “Amazing,” Wayne said, and Jerry couldn’t help but smile along with him. “Have you ever heard of mindfulness?”\nTwo hours of measured breathing, stretching, and lying flat on the cold ass ground of the safehouse later, Jerry was ever so slightly starting to see the appeal of yoga. \nNext to him, Craig was snoring in corpse pose -- a term they’d been delighted to learn -- while the rest of the boys were somewhere between awake and asleep around the room, trying to follow Wayne’s instructions.\nWayne had walked them through a variety of basic forms, using his bound hands to carefully rub peppermint oil into their temples as they “meditated.” Now, he was seated at the “front” of the room, legs folded underneath him as he drew their session to an end. \n“--and we come back to our bodies slowly, feeling the breath in our lungs expand and contract…”\nJerry elbowed Craig in the ribs, waking him. The driver sent him a glare before lifting his head, spotting Wayne and then settling back down. \n“--knowing that the day ahead of us has many trials, but that you are centered, that you are strong. That you are mindful.” Wayne said, ending his class with a nod of his head. “Thank you for joining me today.  Namaste.”\n“Namaste.” the room chorused. As one, they sat up, joints creaking and muscles stretching. \nJerry groaned in pure relief as his back didn’t ache on the way up, pressing his palms into his thighs. Wayne crawled to his side in an instant, eager. \n“Feeling better?”\n“Yes,” Jerry admitted, getting an amused look from Craig for his trouble, “Thank you for teaching us. You didn’t have to do that.”\n“What else were we going to do?” Wayne asked, one shoulder rising and falling. “Which reminds me. Do we need a proof of life photo? It’s been a few hours, hasn’t it?”\nJerry rubbed a hand across his face, blowing out a breath. “Yeah, I guess we do.”\n“Good. We can talk in the other room.” Wayne said. Jerry raised an eyebrow, grabbing his elbow and leading him. \nOnce they were out of earshot of the boys, he dropped the hand. Wayne knew the way by now. \n“What did you want to talk about?”\nWayne smiled -- too bright, too many teeth, too  pointed -- and Jerry felt his heart stutter.\nThey dropped Wayne off with little fanfare after the ransom was paid, depositing him in the parking lot they’d snatched him from as Craig made yet another terrible joke about roundtrip service. \nBack at the safehouse, the boys gathered slowly in the kitchen, waiting for instructions on their payouts. The gluten free pasta box sat abandoned on the table, unopened. \n“Hey! Boys!” Jerry shouted, defaulting to his military voice when everyone wasn’t immediately present, “School circle, kitchen. Now!”\nHis laggers appeared in the kitchen shortly, taking their seats. Jerry crossed his arms, leaning against the counter. \n“Quick update before I pass out the info,” he said, “We got offered a new job. It’s time sensitive, so we need to make a decision  today  if we wanna take it.”\nJimmy raised an eyebrow. Bill looked curious. Dillon was clearly distracted, looking out the tiny window and probably mooning over Wayne still. \n“What kind of job?” Craig asked, lips twitching, “Because I’m not doing kids again. That was so fucked up.”\nThe boys, as one, nodded.  No kids.  \n“Not a nab,” Jerry clarified, “It’s legit. Contract security for an event.”\nAt the word  legit, the entire room cringed back in distaste. Jerry held up his hands, heading off the inevitable protests before they could start. \n“I know. I  know we said we weren’t doing any legit jobs. But this one is special.”\n“Who’s the client?” Jimmy asked, perceptive as ever. Jerry fought to keep himself from smiling, lowering his hands. \n“Bruce Wayne.”\nThe protests were immediately replaced by enthusiastic acceptance. \n“Oh, why didn’t you fucking say so?” Jimmy said, shaking his head. “Yeah, I’m in.”\n“Security for Wayne?” Dillon asked. At Jerry’s nod, he grinned. “I’m in.”\n“Oh, I’m in. I’m so in.” Bill said, excited. “Do you think we get to see his fancy house?”\n“No, it’s at some party downtown,” Jerry said, ignoring his dejected look and turning to Craig. “Well?”\nThe driver shrugged. “Protection for him?” he seemed to think about it, “Yeah, fuck it. I’m in.”\n“Good,” Jerry said, pleased it’d been that easy. “Brush up on your hand to hand before tomorrow night,” he finished, uncrossing his arms and turning toward the door. \n“Hand to hand?” Dillon asked, baffled. Jerry paused in the doorway. \n“Wayne doesn’t want guns. And what the client wants, they get.” Jerry winked at Jimmy, who looked absolutely devastated by this revelation. “Checks are on the corkboard. See you boys tomorrow.”\nThe room exploded into discussion behind him. Jerry headed out the back door, smiling to himself. \nThey showed up to the address Wayne sent just before 8 PM, parking quietly next to the loading dock behind the hotel’s event hall. \nEven if the job was legit, old habits died hard -- and Jerry caught both himself and Craig craning their necks looking for witnesses as they filed out of the van. \nThey were sans guns, as requested. To compensate, every single man carried at least three knives, a holdout grenade, and several pairs of flexicuffs.\nJerry hadn’t questioned the extra gear, but his expression as they unloaded the van must have been obvious. \n“Wayne gets kidnapped a lot,” Craig said, matter of fact as he pulled out what looked like a portable command station, “Boys just wanted to be prepared.”\nJerry neglected to add that at least 50% of those kidnappings were theirs. That number was surprisingly low, considering how often they kidnapped Wayne. \n“Dillon wanted to bring a machete,” Jimmy added, grabbing a handle and helping Craig drop the crate on the asphalt, “But we figured it was a fancy party like you said, so he left it at the house.”\nDillon was keeping watch by the door, shoulders drooping in obvious disappointment. \nJerry shook his head, counting his lucky stars they’d at least all worn black. Wayne hadn’t exactly given them a dress code, but black blended -- especially in a crowd. \nLarge bladed weapons didn’t, however. \n“Earpieces.” he murmured when the gear was nestled against the far wall of the loading dock. Craig pulled out the case, distributing the ear tips among the boys, then the wrist mics. \nBill looked excited as he put in his earpiece, turning to Dillon with a shit-eating grin. \n“Like the fuckin’ Secret Service, huh?”\nDillon shrugged, putting his own earpiece in. “Sure, Bill.”\nJimmy took his silently, glancing at Craig, who looked at Jerry. Jerry shrugged, feeling the awkward tension of the word  legit hanging over them like a shroud. \n“Craig and I are gonna prep with Wayne,” he announced, straightening the cuffs of his dress shirt, “Set up the tech and listen for your assignments. We’ll be back soon.”\nHe turned to leave, but the group didn’t disperse immediately. Locking eyes with Craig, Jerry paused, considering. \n“Wayne,” he sighed, like it was a curse. Maybe it was. “Wayne -- he’s a good guy, right? Always did right by us?”\nThe boys nodded, expressions serious. \n“So he asked us for a favor,” Jerry said, rubbing his hands together, “We’re gonna do this job, and it’s gonna be fucking airtight, okay? No fucking around. No falling asleep, no getting distracted.” He made eye contact with each and every man. “Am I clear?”\n“Yes sir!” \n“Great,” Jerry said, clapping Craig on the back. “Let’s go.”\nWayne was, predictably, in the middle of something when they arrived at his suite. He met them at the door with his cellphone crammed between his ear and shoulder, gesturing wildly for them to come in. \n“--no, I don’t have a comment on that--” he said into the phone, mouthing  water?  at Jerry and Craig, who both shook their heads. He then gestured at the wet bar, mouthing something that looked like  vodka?  \nSomewhat reluctantly, they both shook their heads again. \n“--she said  what? No, I wasn’t even in the country at the time, are you kidding me--”\nThe suite was beyond extravagant. Craig sat on the obnoxiously satin-y sofa first, glancing at Jerry as Wayne began making his own drink one-handed. \n“--well, I don’t know what to tell you, Clark, maybe you should vet your sources a little better--” Wayne put a hand over the receiver, looking at Jerry and Craig, “Are you  sure you don’t want anything? I have whiskey.”\n“Probably shouldn’t drink on the job, sir,” Jerry said, speaking for both of them. Wayne grimaced, uncovering his phone and going back to his conversation. \n“Anyway, Clark, I have to go. Don’t call me again. I mean that. Bye!”\nWayne threw the cellphone across the room. Jerry frowned, not sure he’d seen the man end the call before he’d chucked the phone. \n“Wonderful,” he said, spinning around and clapping his hands together. “You’re on time. I’m late, so I’m rolling with it. How’s the schedule looking?”\nJerry felt his frown deepen, struggling to keep his expression neutral. “You uh…didn’t give us a schedule yet, sir.”\n“Right,” Wayne said, pausing. He pushed a hand through his hair, ruining the style. There were dark circles under his eyes, half-concealed by what looked like makeup. “What  did I give you?”\n“Time and location of event.” Jerry summarized, “That’s…about it. Sir.”\n“Hm.”\nWayne turned around, suddenly remembering his half-poured drink. He snatched it off the wet bar, joining Craig on the couch. Jerry continued to stand, shifting awkwardly. \n“I didn’t mean to leave you in the dark,” he said, looking genuinely regretful, “Lots of moving pieces right now. You understand, of course.”\nIn a way, Jerry could. He nodded, trying to be encouraging. Having more than one line of thought at once was probably a lot for the poor man. \n“Tonight’s event is a…well, it’s boring charity nonsense,” Wayne waved a hand at the door, looking irritated at the general direction of the event hall, “Dinner, an auction, the usual. They’re giving me a ridiculous award for donating money I already promised I’d give them ten years ago. It’s meaningless, really.”\nJerry didn’t ask who  they were. If it was important, they’d find out. \n“But I have to give a speech,” Wayne said, taking a swig from his glass. He made a face, swallowing harshly. “And that speech has to happen no matter what, or they don’t get the money.”\nIt was Craig’s turn to frown. \n“I know, but it’s a condition of the trust,” Wayne said, sensing their apprehension and waving it away again with startling perceptiveness, “And the money goes where it’s needed. This year, it’s homeless youth shelters. Admirable, right?”\nCraig and Jerry nodded. Yeah, that sounded fine. \n“So,” Wayne held up his glass, toasting them with a tired smile, “I hired you because I know you can get me on that stage by 10 PM.”\n“Of course, sir.” Jerry said, exchanging a look with Craig. They could do that. Package ferrying was even simpler than security, really. \n“And because you had a pretty high chance of being the ones who were going to kidnap me and prevent my speech in the first place,” Wayne added, deceptively light, “Which -- no hard feelings. Money is money. I just figured you’d rather take mine, this time.”\nJerry’s eyes narrowed, a burst of protective anger flitting through him. “Doesn’t mean someone else won’t try.”\n\n Or wouldn’t have tried already, before we even showed up… \n\n“I know. But I trust you,” Wayne said. And  oh,  that expression nearly cracked Jerry’s heart -- wide-eyed naivete with an edge of fondness he knew was their fault. “You’re  good at what you do. And you won’t hurt me. Not without warning me first, at least.”\nJerry felt a wave of revulsion at the thought of actually harming Wayne. He glanced at Craig, who was clearly thinking along similar lines. \n“We’ll get you on that stage, sir. On  time,” he stressed, crossing his arms. “And intact.”\nWayne smiled up at him, full of sunshine and foolish trust. “Mostly intact, I hope.”\n“Can’t account for papercuts,” Jerry bit back, grinning slightly. Craig raised an eyebrow in his peripheral vision, looking back and forth between the two of them. “Sir.”\nWayne’s smile widened, revealing a blinding flash of white teeth. \n“Then I put myself in your very capable hands…Sergeant?”\nSo he’d done his research. Jerry fought the urge to blush, nodding at the old title. \n“Sergeant works.”\nWayne opened his mouth to say something, only to be interrupted by a ringtone that sounded suspiciously like  Baby Shark. He put up a finger, standing up and walking toward the corner where he’d launched his cellphone earlier. \n“I really thought I threw it hard enough this time,” he muttered, accepting the call. “Clark? No, I don’t care what you heard -- because it’s not  relevant, okay? Leave me alone, I’m working, for christ’s sake--”\nJerry and Craig watched as Wayne threw the cellphone back into the corner, rejoining them on the couch. \n“If a ridiculous horse of a man shows up claiming to be from the  Daily Planet,” he said to them, “I do  not want to speak with him.”\n“Sure,” Jerry said, agreeing easily.  No horse men. “Any other persons we should be aware of?”\nWayne cracked his knuckles, grinning at them. \n“You have a pen and paper?”\nThe boys joined them up in the suite a half hour later, dragging the crates of gear with them through the lavish halls. \nThey’d already ran into one ragtag kidnapping group in the service elevator, apparently, and had escorted them out of the building under threat of grenade and several knives. \nDillon and Bill couldn’t have been prouder. Jimmy was cool as always, letting them have their moment as they recounted the (slightly embellished) story to Wayne, Craig and Jerry excitedly, complete with reenactments. \nWayne watched with rapt attention, applauding politely at the end. With a sigh Jerry almost didn’t catch, he turned back to their earlier conversation, beginning again.\n“--So  that mafia isn’t really happy with me, but they’re in Metropolis tonight. Or at least I think they are--”\nJerry noted the fourth possible death threat down on his pad in as much detail as he could, struggling to follow Wayne’s train of thought without interrupting. \n“--and then Salvatore, you know how his men are. I bit one of them once when they tried to take me. I couldn’t help myself. He put his hand over my mouth and he didn’t even  flinch when I licked him, so of course I had to try--”\nCraig waved the boys into the suite’s kitchen, clearly thrilled by this turn of story. He lounged on the satin couch, watching their conversation with a half-filled snifter of brandy. \n“--so, they could show up.” Wayne summarized, waving a hand, “Oh, and Lex Luthor might send me some of his awful gin, which might as well count as a death threat. Can’t believe he makes that himself.” Wayne cut off with a grimace, “He really shouldn’t.”\nJerry dutifully took notes, scribbling  Luthor -- gin??? check packages as Wayne trailed off. \n“Is that it?”\nThe previously abandoned and twice-thrown cell phone chimed again from the corner. Wayne sighed, not bothering to get up. \n“Did I mention the  Daily Planet reporter?” he asked. \n“The horse man,” Jerry said, somehow managing a straight face. \n“That’s him,” Wayne replied, putting his head in his hands as the phone kept ringing. “Can someone throw that out the window, please?”\nSweet, innocent Dillon stepped toward the double-paned windows, frowning as he put a hand up to the glass. “I don’t think these open this high up, Mr. Wayne sir.”\n“The ice bucket, then.”\nEyes wide, Dillon carefully picked up the phone, took off the lid, and sat it in the half-full ice bucket. A second later, he replaced the lid, looking sheepish. \nWayne moaned in ecstatic relief as the ringing died with a gurgle. \n“You’re my favorite, Dillon.”\nDillon blushed bright red, looking anywhere but at Wayne. “You’re uh, welcome, sir.”\n“Time?” Jerry asked Craig. The driver glanced down at his watch. \n“One hour.” \nAs if on command, the lights in the suite cut out, plunging them into near-darkness. \nThe room went silent. There was a long pause. \n“...Well,  shit,” Jimmy said, apt as ever.\n\n Okay, first--second?--attempt of the night, Stay cool.  \n\nJerry cursed quietly under his breath, pulling out his knife and taser. He faced the suite entrance, holding one in either hand. \n Fuck, fuck fucking fuck…  \n“Think Salvatore’s guys had a 9 PM grab?” Craig joked, standing and unsheathing his knife next to him. “Shit, those guys are punctual for mobsters.”\n“Get Wayne in the bedroom,” Jerry told Dillon and Bill over his shoulder, “Barricade the door. Jimmy, you’re with us.”\nWayne was shuffled unceremoniously into the bedroom. Jimmy took up a defensive position behind it, flanking Craig and Jerry, knives in either hand. \n“Could’ve used a gun right now,” the sharpshooter said mournfully, looking at his hands, “Salvatore’s guys definitely got nice rifles, sir.”\n“I told you to brush up on your hand to hand,” Jerry muttered, but it was beside the point, now. “Try to keep it close quarters. This much furniture, they’ll have a hard time staying mobile. Use that against them.”\nAt thirty seconds on the dot, six men filtered into the room through the main door, guns aimed at the floor. Jerry signed quickly at Jimmy and Craig, lurching forward. \n\n Go go go go gogogogogogo----- \n\nJimmy’s knife went through the first goon’s eye, knocking him down with a horrible squelching sound. Jerry didn’t stop to watch, leaping over his body and pinning the second man in the shoulder with his knife, cursing when he felt body armor under his fingers. \n“Heads up!” he yelled out to Craig and Jimmy, pinning the man in between his elbow and slamming his head into the wall. “They got armor!”\nSomebody knew Wayne would have protection. They’d dressed for it, even. \nNext to him, Craig brained his goon with the butt of his knife, grinning savagely at Jerry as the man collapsed. Three down, three to go. \nThe other half of the insurgent party wasn’t nearly as confident as their leaders. Jerry, Jimmy and Craig took them down with minimal bloodshed, leaving them unconscious on the thick carpet. \nJerry handed over his flexicuffs to the other two, letting them handle the restraints. Breathing heavily, he stumbled to the bedroom door, knocking their all clear code. \nA moment later, Wayne poked his head out, flanked by Bill and Dillon. \n“Are they alive?” he asked, spotting the blood on the carpet. Jerry nodded, then paused. \n“Jimmy?”\nJimmy spared a glance at his first victim, sprawled near the wet bar. “Yeah, he’ll live. Might lose the eye though.”\nWayne looked mildly nauseous at that announcement. Jerry made an executive decision, sliding his knife back into his belt. \n“Time to move. Location isn’t secure any more.” He turned to Wayne, watching in the corner of his eye as Jimmy and Bill grabbed the crate, “Do you have a backup?”\n“Well,” Wayne said. \nThe hotel spa was fairly secure, all things considered. It had one entrance and exit, no windows, and the faint smell of lavender permeating every surface. \nThe woman behind the desk left with little urging, disengaging from the knife-wielding group with a sigh that spoke of true Gotham experience. She greeted Wayne on her way out, who seemed briefly thrilled to be remembered. \nCraig set them up in the massage room, glancing at his watch as he directed Jimmy and Bill into the corner. \n“Thirty minutes,” he told Jerry, grimacing. “What’s the extraction plan?”\n“Up three flights and two hallways over,” Jerry said, having memorized the layout as they’d descended from the suite. “Should take less than a minute to get there if we hurry.”\n“Sounds tight.”\nJerry grimaced. “Yeah...”\nWayne laid himself across one of the massage tables, beckoning Bill and Dillon to join him. At a sharp look from Jerry, they declined, standing watch on either side of the billionaire. \nNear the entrance, Jimmy clicked his tongue. \n“Got incoming, Sarge.”\nJerry sighed, waving Jimmy forward. “Bill, Dillon--”\n“Got it, sir,” Dillon said, ushering Wayne off the bed and into the massage room corner. “Mr. Wayne, if you would just, uh, crouch here--”\n“Bruce!”\nJerry raised his eyebrows as a ridiculously tall man entered the spa, pushing the doors back and heading toward them with single-minded intent. \nThe man was unremarkable save for his bulk -- somewhere over six foot, dark hair, thick glasses, cheap suit. He had a press ID around his neck, the tag flopping limply as he walked toward them. \nWayne let out a dramatic sigh, stepping out from behind Bill and Dillon with an eye roll that could have crippled empires. \n“Clark.”\nJerry winced internally.  This is the horse reporter, then,  he thought, readying himself for another fight.  \n“Excuse me sir,” Craig said, putting a hand out with the kind of authority Jerry wished he could muster, “I’m going to have to ask you to leave.”\n Clark looked at Wayne over Craig’s hand, sparing Jerry a brief glance. \n“What the  hell are you doing?” he asked, then seemed to lose a little steam, clocking Jerry’s hand drifting closer to his belt. “Bruce…”\nWayne rolled his eyes a second time. “Breaking out the curse words, are we?”\nBehind him, Bill made a face -- probably reacting to the casual use of the man’s name. \n“You stopped answering your phone,” Clark said, eyes flashing behind his thick glasses, “I was  worried. I heard--” he cut off, glancing at Jerry again. Nervous?  \n“You  heard  lovely Dillon here depositing my phone in the ice bucket,” Wayne said, waving a hand over his shoulder at Dillon, who was blushing again, “Which should have been a clue that  I don’t want to talk to you right now.” \nJerry was missing a lot of history here -- it was obvious. He shifted on the balls of his feet, feeling the muscles in his calves clench. Something wasn’t what it seemed here, but Wayne didn’t seem keen on elaborating for their benefit. \n“Don’t do this,” Clark said, looking at Wayne desperately, fists clenching at his sides, “I -- ”\n“Hey,” Craig said, waving at the man, “Yoo hoo! Dipshit? He said he doesn’t wanna fuckin’ talk to you, man.”\n“Yeah.” Bill said quietly. Jimmy and Dillon both nodded in agreement.\n“Get outta here.”\n“Yeah.”\nBut something in the man’s eyes must have moved Wayne, because he relented with a cut off sigh. He muttered something too quiet to catch, clearly directed at Clark. \n“Give us a moment?” he turned to Jerry, edging dangerously toward  puppy eyes, “Please?”\n“You said he was a threat.” Jerry said. It wasn’t really a question. \nWayne shook his head. \n“To my sanity, maybe.” the billionaire shrugged, “He won’t hurt me. I know he won’t.”\n\n God fucking… \n\n“Alright.” Jerry glanced at Craig, who mouthed  twenty minutes at him. “You can have the room. We’ll be right outside if you need us.”\nWayne smiled, the softest one he'd seen all night. “Of course, Sergeant.”\n“You’ll shout if you need  anything, ” Jerry said, pointing at him, “Got me?”\n“I--yes. Yes. Thank you.” \nWith a strange kind of familiarity, Wayne snagged Clark by the collar and pulled him into the massage room, closing the door behind them. \nJerry put his head in his hands, breathing out slowly through his nose. \n“Dillon, Jimmy, Bill. Go sweep the main hall. Set up after that between there and the spa,” he directed, turning to Craig. “Craig and I will stay here for the extraction.”\n“Sir.”\nThere’d been yelling, at first -- plenty of it. But that had quickly devolved into…whatever was happening on the other side of the door. \nJerry stood against the massage room entrance, crossing his arms in front of him and trying desperately to ignore his burning face. \nAcross from him, Craig checked his watch, raising an eyebrow as a decidedly  un-muffled groan vibrated through the door. \n\n “Clark--” \n\nThe groan was followed by a series of unmistakable thumps, and what sounded like plastic hitting the floor. Jerry winced, embarrassment flooding through him. \nCraig caught his gaze, then shrugged. \n“Good for him, you know?” he said to Jerry, leaning back against the wall. “Guy was kinda hot under the glasses.”\n I can’t believe I’m doing this,  Jerry thought as the door bumped under his shoulders,  If anyone walks down here...  \n“Time?” he asked, instead of laying into Craig for something out of their control. \n“Ten minutes until he’s needed,” Craig responded, tapping his earpiece, “Boys are sweeping the main hall right now. Said the event chairs were getting antsy for Wayne and wanted an update.”\nJerry sighed. “What did you tell them Wayne was doing?” he asked, already regretting the question. The smile he got was almost feral. \n“Last minute interview,” Craig said, devilishly amused, “Off the record, of course.”\nThere was another groan from the massage room. Jerry felt the flush in his cheeks rise even higher, wondering when he became such a prude. \nMaybe it was just Wayne. Despite flirting with every person he saw, and making some of the most salacious jokes Jerry had heard outside of the service, the billionaire seemed almost…innocent, somehow. \nLetting his charge get railed in the massage room of an abandoned spa while he kept watch was the last thing Jerry had expected. The jokes, yes -- but not the follow through. \nCraig was watching him like he knew exactly what Jerry was thinking. He probably did. Jerry flipped him off, feeling off-kilter. \n“Yeah, yeah,” the other man said, shaking his head, “But think about it this way: we can always shoot him later if he breaks Wayne’s heart.” \nJerry frowned. “We’re not shooting anyone,” he said, then thought about it. Well, they would eventually, in all likelihood. But shooting some random reporter…\n“Or we could delete all his articles from his computer,” Craig said, looking thoughtful. He pulled one of his Ka-Bars from his sleeve, flipping it, “Threaten his parents? Leak his search history?”\nJerry considered this. He tilted his head, working through the scenarios. \n“We should talk to him before he leaves no matter what,” he said, Craig nodding along as he looked down at his knife, “Might be trying to publish something about Wayne, you never know.”\n“He’d better not,” Craig growled, suddenly vicious, “Fuckin’ reporters.”\nJerry cracked a smile, not even flinching this time as the door shook under his hand. Inside, he could just pick out the reporter’s voice. He desperately attempted to tune out the dirty words, trying for Wayne’s sake -- and his own -- to remain professional. \nIt didn’t last long. \n“Fuckin’  reporters,” he said to Craig, wiggling his eyebrows to indicate the joke, “I think Wayne agrees, too.”\nThe other man chuckled, shaken out of his bloodlust. “You got that right, sir.”\nInside the closet, the moaning had increased in tempo, tiny gasps that flooded the hallway despite their best efforts. \n“Time?” he asked Craig. The other man glanced at his watch. \n“Five minutes.”\n“Hey! Wrap it up!” Jerry said, banging a fist on the door, “We gotta move soon, Mr. Wayne.”\nThere was a muffled groan, and then the sound of clothing shifting. Craig wiggled his eyebrows at Jerry, his earlier good humor returning. \n\"That was quick,\" he said, shaking his head with a sad smile, \"Poor guy. Wayne probably got a hand around him and he--\"\n\"Craig.\" Jerry hissed. Wayne could probably hear them, now that he wasn't--well. \nCraig rolled his eyes.\n\"Ugh, fine.\"\nJerry tried not to imagine what was occurring in the ensuing silence, turning back to face the hallway. \n\n Please don’t be naked please don’t be naked please don’t be naked… \n\nThirty seconds later, the door creaked open, revealing a mussed head of hair and kiss-reddened lips. \n“Jerry,” Wayne said, pulling his shirt up on his shoulder. He looked equally delighted and dazed, leaning heavily against the door jamb, “Can one of your fine men escort my guest back to the press table?”\nThere was an indignant squawk from somewhere in the massage room. \n“Absolutely, sir.”\nJerry purposefully avoided looking at the man’s neck, awash in fresh marks that would undoubtedly bruise. He glanced at Craig, who nodded, tapping his earpiece and speaking into his wrist mic. \n“They’ll be down in a moment, sir,” Craig said, shifting against the wall, “Why don’t you visit the restroom before we head back? Freshen up a little before your speech?”\nWayne took the suggestion with surprising grace, winking at Jerry before turning and following Craig down the hallway. \nThere was a soft cough from inside the massage room. Jerry waited the reporter out, slipping his flashlight from his pocket. \nSure enough, a few moments later, Clark shuffled out, only slightly less disheveled than Wayne. \n“Um. Hi?” he said, hands twitching at his sides. His shirt was misbuttoned, but the reporter didn’t seem to notice. Like Wayne, his hair was a mess. But unlike Wayne, Jerry didn’t care what he looked like walking back into the hall. \n“ID,” he said, holding a hand out. Looking baffled, the reporter reached into his shirt pocket, handing over the press ID. \nJerry pulled his flashlight up, flicking it into the man’s eyes as he compared the photo. “Clark Joseph Kent?”\n“That’s me,” Clark --  Kent -- said, wincing. His eyes were a vivid blue under the glasses. “Uh, sir.”\n“When was the last time you had an STD test?”\n“I--what?”\nJerry flicked off the flashlight, still holding onto the ID. “Answer the question.”\n“Uh,” Kent, eloquent like most reporters were when Jerry cornered them, “Um. A few months ago?”\n“You’re getting tested tomorrow morning,” Jerry informed him. Kent opened his mouth, likely to protest, and he continued on, “You will send the results to this address--”\nHe handed Kent a business card with their temporary email and phone number. The reporter took it, frowning, and put it in his pocket. \n“--and you will be retested in six weeks,” Jerry finished, “Send those results as well. Any questions?”\nKent opened his mouth, and Jerry ignored him again. \n“Now. You’re going to go back to your table, and you will  stay there,” he said, holding up a hand when the reporter protested, “You will not speak to Mr. Wayne for the rest of the night. You will not publish  anything about what occurred here.”\n“Yes sir,” Kent said, jaw clenching. God, another young and fiery type. Jerry rolled his eyes internally. \n“If I find out you spoke to anyone about Mr. Wayne, published anything about Mr. Wayne, or intend to publish information about Mr. Wayne, I  will find you,” he emphasized, “You don’t want me to find you. Understand?”\n“I understand.” Kent said, through gritted teeth. Jerry smiled. \n“Good boy. Run along now.”\n“W-what about my ID?”\nJerry raised an eyebrow, tucking the press pass into his pocket. \n“What ID?” he asked, expressionless. \nAnger rose as a blush in Kent’s cheeks, high and furious. After a long moment -- and a glance at the hallway Craig and Wayne had disappeared down -- he turned on his heel, heading for the exit. \nJerry waited until he was out of sight to relax. He tapped his earpiece, connecting with Craig’s comm. \n“We have to move,” he reminded him. There was an exasperated noise on the other end of the comm -- Craig’s voice -- followed by an amused laugh -- Wayne’s -- and the sound of water running. \n“How many fuckin’ hickeys do you even have, sir?!” \nWayne made it with ten seconds to spare, neck and collar bared unrepentantly to the world as he climbed the stage. With a lurid bruise across his adam’s apple, he accepted his award with flawless charm, to much applause. \nJerry breathed a sigh of relief as the speech ended, flanking Craig as they shepherded Wayne off the stage and toward his dedicated table. A mostly-full table, he realized once they were nearly seated. \nThe two boys at the table -- Wayne’s children -- looked up at him in mild astonishment. They seemed surprised to see him at all, which was…troubling.\nJerry stood behind Wayne’s chair, keeping watch as the boys and Craig circled out around the table, taking positions up against the nearby walls. With practiced ease, they disappeared into the low light of the event hall, blending into the shadows. \nAt the table, the second youngest -- Jason? -- had his gaze fastened on the bruise on Wayne’s neck, lips twitching. \n“Plausible deniability?” he asked, with a suggestive wiggle of his eyebrows. \nThe older boy -- Dick, then --  smacked him on the arm. “Jason.”\n“What? Seems like a good excuse to me--”\nWayne sat next to his children, a happy smile curving his lips. He was vibrating in his seat a little, like a great weight had been lifted off his shoulders. \n“Clark and I had a… discussion. ”\nJerry wasn’t ready for both boys to snap to full attention, eyes widening. Dick choked on the water he was drinking, setting the cup down with an unsteady hand. \n“No,” Jason said, shocked, “Are you serious?”\n“Wow,” Dick clapped a hand on Wayne’s shoulder, still wiping water off his face with the other, “You sure chose the right time to…discuss.”\n“The death threats were null once I gave my speech,” Wayne said, waving off the situation with an ease only a billionaire could muster, “The money’s already on the way.”\nAcross the room, Jerry spotted Kent at the press table, also vibrating in his seat and looking a half-second away from getting up and walking over.\n\n Oh, fucking try me, horse man. \n\nJerry crossed his arms, staring down the reporter with all of the implicit threat he could channel. The reporter blinked rapidly, turning away from Wayne’s table and Jerry’s gaze. \nHe was clearly missing something there. Usually, that would bother Jerry, but tonight? He’d just chalk it up to Wayne’s particular brand of weirdness.\n Horse men. Jesus…  \nJerry was pulled from his thoughts by a smooth hand around his wrist, tugging gently. \n“Sergeant, you don’t have to stay, now,” Wayne said, looking up at him with those wide blue eyes, earnest, “I only paid you for the speech.”\nNext to him, Craig shifted, holding onto the hilt of his Ka-Bar where it disappeared into his belt. \n“We’re staying, Mr. Wayne.”\nWayne relented, releasing his wrist with a soft smile. “Thank you.”\n“You’re welcome.” Jerry said genuinely. Across the room, Kent was staring at them again, still blinking strangely. He gestured with his chin, “That reporter gives you any more trouble, you let us know.”\nWayne muttered something that sounded a lot like  oh I hope he does, which Jerry politely ignored. The billionaire turned back to his kids with a wink, diving back into the conversation he’d abandoned. \nCraig caught his eye, smirking slightly. He nodded his head toward the press table. \nJerry turned, spotting Kent turning an alarming shade of red as he gripped his silverware. He laughed softly into his hand, turning to his second. \n“Thought he was gonna punch me earlier when you were in the bathroom,” he said to Craig, “He was sure thinkin’ about it.”\n“Well, you’re over here being a real  gentleman,” Craig said, wiggling his eyebrows, “Of course he’s jealous. You gotta decent enough mug for it, too, boss.”\nJerry smacked him, unwilling to take the compliment. “Shut up.”\n“You do!” Craig said, joshing him with a faint blush on his cheeks that Jerry hadn’t seen before, “Sir.” \n“I don’t pay you to kiss my ass,” he growled, but he was smiling, too. \n“Yeah, yeah…”\n\n\n\nThe End"
}