{
    "id": "392041",
    "url": "https://archiveofourown.org/works/392041?view_full_work=true",
    "author": [
        "Faith Wood (faithwood)"
    ],
    "title": "Who Shagged Harry Potter?",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Harry Potter - J. K. Rowling"
    ],
    "relationships": [
        "Draco Malfoy/Harry Potter"
    ],
    "characters": [
        "Draco Malfoy",
        "Harry Potter",
        "Blaise Zabini",
        "Theodore Nott",
        "Gregory Goyle"
    ],
    "additional_tags": [
        "Smut",
        "Humor",
        "Hogwarts Eighth Year"
    ],
    "language": "English",
    "series": "",
    "published": "2012-04-26",
    "completed": null,
    "words": "6,464",
    "chapters": "1/1",
    "comments": "198",
    "kudos": "28,105",
    "bookmarks": "3,518",
    "hits": "360,201",
    "summary": "<p>One beautiful sunny Sunday the Slytherins wake up after a raunchy night only to discover a very naked Harry Potter sleeping in their dormitory. Naturally, they ask themselves a logical question: Who the hell shagged him?</p>",
    "notes": "",
    "text": "\"Fuck,\" was the first thing that came out of Draco's mouth when he woke up. After that, his curses turned to pathetic groans as he attempted in vain to shield his face from the harsh light of the morning sun. He tried to bury his head in the pillows but that proved to be impossible since he was lying on the hard floor. \nJudging by the way his head hurt and the way his body felt stiff and shivery, Draco concluded that last night had been a spectacular experience. One that he did not remember, but all the signs indicated he had gotten drunk enough to pass out on the floor in the middle of the Slytherin boys' dormitory, so it must have been fun. \nUnsticking his cheek from the floor and shedding a blanket that had been inexplicably tossed over him, he got up on his hands and knees and then slowly stood up, swaying dangerously for a moment but remaining miraculously upright. \nPleased, he looked around the room to see how the others had fared. \nBlaise, the lucky bastard, was sleeping on the bed, though he did not appear to be comfortable in his position; his head hung down, his mouth was wide open, and he snored uncharacteristically as though trying to make up for years of not snoring. He was fully dressed, lying backwards on the bed, his booted feet resting on his pillow. \nGreg was sleeping in a chair next to a row of books stacked on a shelf above him. There was an open book in his lap and, thinking it unlikely that Greg had actually been reading, or Merlin forbid, studying, Draco guessed that at some point a book had fallen on his head, successfully knocking him unconscious. \nA little to Greg's left, Theodore Nott lay sprawled over his trunk in a no-one-will-rob-me-because-I'm-protecting-my-belongings position. He had either collapsed there in his drunken state, or he‘d been viciously murdered during the night and left there to rot. \nShrugging, Draco took a deep breath, determined to relieve the pain in his head and his general suffering by making everyone else suffer as well. \n\"Splendid night!\" he cried loudly. \"Wasn't it?\" His booming voice created an uproar at once. \nBlaise fell off his bed and Theo demonstrated he was in fact alive by jumping up and looking wildly around. Greg didn't move a muscle but kept on sleeping. \n\"Bloody hell,\" Blaise groaned, picking himself up from the floor. He grabbed a random bedpost and swayed, looking very green in the face. Draco quickly edged away in case Blaise decided to hurl. \n\"Splendid? You actually remember it?\" Theo asked, rubbing his head but looking much too composed for someone who had spent the night tossed over his trunk. \n\"Some of it,\" Draco said curtly, albeit untruthfully. \n\"Yeah, me too,\" Nott agreed nonchalantly. \n\"Well then, maybe you two can explain this,\" Blaise whispered, looking wide-eyed, still grabbing the post of Crabbe's bed. \n\"You got drunk and now you'll vomit. What's there to explain?\" Draco grumbled, wrinkling his nose and edging even farther away. \nTheo, however, came closer, cocking his head and then gasping as his eyebrows disappeared into his hairline. Which was a feat considering Theo's forehead was very high indeed. \n\"Sweet Merlin,\" he said, whistling quietly under his breath and moving to stand next to Blaise. They both stared into Crabbe's bed with twin expressions of sheer wonder. \nUnnerved but curious, Draco walked closer and moved the bed's curtains that obstructed his view, promptly wishing he hadn't done that. His body responded violently; all of his blood rushing south, as his gaze swept over the person sleeping soundly on the bed in front of him. \nHarry Potter lay peacefully; wild black hair contrasting with the white pillows, black lashes touching his pale cheeks, his chest — his naked chest — rising and falling slowly as he slept. The sheet was placed strategically, covering his right thigh and his crotch, while everything else lay exposed to Draco's feasting eyes, including Potter's flat stomach, one jutting hipbone, and a long, muscled leg, leaving no room for doubt that he was quite naked. \nDraco blinked several times, shocked anew every time he opened his eyes fully again. \n\"What is he doing here?\" he managed to ask after what seemed like hours. \n\"Sleeping,\" Nott said dryly. \"The question is: Why is he here?\" \n\"No, the question is: Why is he naked?\" Blaise added, his gaze fixed — in an inappropriate manner, in Draco's opinion — on Potter's edible hipbone. \nDraco bit his lip. \"Actually, the most interesting question is: Who got him naked?\" he murmured, not even daring to hope he had been the one participating in the undressing of Harry Potter. \n\"Well it wasn't me!\" Nott said promptly, automatically sounding guilty. \"I'm straight. Unlike you two.\" Though that was a good point. \n\"Hey! He's not my type,\" Blaise said defensively. \"Well, at least he wasn't until now,\" he added with a leer. Potter stirred, and they all held their breaths for a moment, but Potter turned his head — his leg twitching, revealing even more skin and just a hint of the dark hair of his crotch — and then continued his rhythmic breathing. \nThe three of them exhaled together, and Blaise's gaze shifted bravely; he was eying the sheet that covered Potter with an expression that suggested he would very much like to rip the sheet away. \nToo busy glaring at Blaise, Draco hadn't noticed that Theo was looking at him expectantly. \nStartled, Draco crossed his hands over his chest, realizing too late that this move looked defensive. \"He's not my type either,\" he hurried to say. Blaise and Theo exchanged looks that indicated they didn't believe him, so Draco quickly thought of something else. \"We hate each other! Potter hates me more than anyone,\" he reminded them crossly. \"He wouldn't let me shag him. So clearly, I didn't do it.\" Draco sniffed, not really managing to hide the regret in his voice. \n\"I didn't do it either!\" cried Greg suddenly, standing up quickly, looking frightened. Then he frowned in confusion and asked, \"Did what?\" \n\"Shagged Harry Potter,\" Theo explained, helpfully pointing at Potter with his thumb. \nGreg walked over slowly and stood next to Theo, carefully examining the naked man on the bed. \"I don’t think I did it,\" he said finally. \"I never get laid,\" he added with a wistful smile. And after a pause, he asked hopefully, \"Do you think I might have done it?\" \nBlaise rubbed his temples, ignoring Greg completely. \"Do you know what this means? We're all in trouble now. We could get expelled for this. He'll say that a bunch of evil Slytherins abducted him, got him drunk, and took advantage of him.\" \n\"Well that's probably what happened,\" Draco reasoned. \n\"Exactly! This is not good.\" Blaise shook his head in distress. \"And it's all your fault,\" he informed a startled Nott. \"Oh don't look so shocked! You're the one who said that we should invite people from other houses to our secret party. In the spirit of . . . sucking up.\" \nNott spluttered. \"I said in the spirit of interhouse unity —\" \n\"Same thing.\" \n\"— and I didn't say we should invite him. I meant that pretty Ravenclaw girl, or that pretty Gryffindor girl, not Potter.\" \n\"Stop overemphasizing that you're straight!\" Blaise snapped. \"It makes you look guilty. And who the hell invited Potter if not you?\" \nDraco shuffled his feet and looked away. When he looked back, three pairs of eyes were staring at him in disbelief. Or in Greg's case, blank confusion. \n\"Well I thought you meant Potter,\" Draco said defensively. \"I thought we should get on his good side. Considering he's the saviour and all that.\" \n\"When you say get on his good side, you mean get in his pants?\" Theo sneered. \n\"That is his good side,\" Blaise commented, as he succumbed to the temptation and lifted Potter's sheet, staring unashamedly at his crotch. \n\"Oh my, someone's happy to see us,\" Theo added, much to Draco's annoyance. He was standing in the wrong bloody place; his view was still obscured by the sheet. \n\"Stop ogling him!\" Draco whispered furiously. \"It's . . . It's rude.\" \nBlaise released the sheet and smirked in Draco's direction. \"Well someone's jealous. That settles it then. Clearly you shagged him,\" Blaise concluded and Theo nodded quickly in agreement. \n\"What? No! You're forgetting that I'm Potter's . . . arch-nemesis.\" Blaise and Nott looked doubtful, so Draco opted for diversionary tactics. \"I bet Greg did it! He practically confessed!\" \n\"Hmm, now that I thought about it,\" Greg said, \"I wasn't at the party. Because I wasn't invited.\" \nDraco scrunched up his face in confusion. \"Of course you were invited, Greg. All Slytherins had been invited. We distributed the invitations on Friday evening. The house-elves wouldn't screw up. They had orders to put them in a bunch of chocolate muffins and hand them out to the right people.\" Draco thought about that some more and then sighed. \"Oh right.\" \nGreg sniffed. \"Did they have to be the chocolate ones?\" \n\"They were stuffed with parchment. How could you not notice and eat yours?\" Blaise looked amazed. \n\"It was a bit funny. I thought it was stale.\" \n\"But then why would you —\" \n\"Oh who cares about Goyle?\" Theo growled. \"Draco shagged Potter. It's obvious.\" \nDraco suppressed a sudden desire to believe that was true. After all, he had been secretly — \n\"He's been crushing on Potter for years!\" \n— or not so secretly, crushing on Potter for years. But on the other hand, if he had shagged Potter, then why would he have slept on the floor? Surely he would have slept on the bed with him, wrapped around Potter's naked body, his cock pressed snugly against Potter's ar—\n\"You're right, Nott. I think we should leave and let Draco clean up his mess. Or make a bigger mess, if he wants to,\" Blaise said suddenly, already moving away. \n\"No!\" Draco panicked. \"It wasn't me! Fine, I am crushing on him, but if I'd shagged him, I'd remember it,\" he said firmly. A helpful memory flashed in Draco's mind. \"I know who it was!\" he exclaimed victoriously. \"There was a guy there who drank way too much. Remember the crazy sod? He took off his shirt and danced on the table, and then he tried to do a lap dance for Potter. But Potter ran away.\" Draco snickered, remembering that quite clearly now. Potter had looked perplexed and slightly terrified. \nTheo frowned and gave Draco a disbelieving look. \"That was you.\" \nScandalised, Draco opened his mouth to deny that, but then he remembered someone begging him to put his shirt back on and someone else attempting to shove Galleons down his pants. \"Oh,\" he said miserably. \"But see, Potter ran away,\" he added, feeling even more miserable after that realization. \n\"Everyone ran away.\" Blaise waved his hand dismissively, but then his eyes narrowed and he cocked his head, looking at Theo. \"Except Nott. Who was snogging Daphne Greengrass' little brother on the sofa,\" he said accusingly. \"Straight, my arse.\" \nTheo looked gobsmacked, but Draco shook his head. \"Daphne has a sister not a brother. Astoria is a girl.\" \nBlaise's eyes widened and his mouth formed a perfect o. \"Are you sure? Because that's one fine bloke.\"\n\"Not so fine girl though. Trust me,\" Draco said confidently. \"I learned that the hard way.\" \nTheo threw his hands up in the air, clearly insulted on behalf of his girlfriend. \"I’ve had enough of this. One of you two did it, not me, and I have better things to do.\" He walked to the door demonstratively. \n\"It's Sunday!\" Blaise hissed after him. \n\"Oh leave him alone,\" Draco said grumpily. \"He wants to go and check if Astoria has a penis or not.\" \nThe door slammed shut with a bang. \n\"Well then I'm leaving too,\" Blaise said with a whine. \n\"Oh no you're not!\" Draco growled, grabbing Blaise's shirt. \"You're not leaving me to deal with this alone. We still don't know who did it. Maybe we both shagged him.\" Draco bared his teeth, incredibly annoyed at his own thoughts. \n\"Maybe we did, but the evidence incriminates only one person,\" Blaise said in a silky voice, batting his eyelashes. \"Because out of the two of us — I'm not the one wearing Potter's shirt.\" \nDraco gasped in shock, at the same time horrified and hopeful. He released Blaise and looked down at the fancy white shirt he was wearing. It was unbuttoned and wrinkled . . . and definitely one of Draco's. \nOh bugger. \nDraco raised his head and lunged at Blaise, but it was too late. Blaise had taken advantage of Draco's distraction and leapt for the door, running away like the coward he was. \nDistressed, Draco buried his head in his hands, peeking at Greg who was still standing beside Potter, looking worried but apparently not planning to run. Good Greg. \n\"We need a plan,\" Draco said determinedly. \nGreg nodded and looked expectant. \n\"Right.\" Draco cleared his throat, thinking hard. \"Potter will wake up and start shrieking about how we abducted him and took advantage of his poor innocent person. I could Stun him or Obliviate him, but both of those things are just temporary solutions because everyone, including him, will probably guess where he spent the night. And the entire Slytherin House, me included, will still have to pay for this.\" Draco sighed, pondering his options. Potter probably wouldn't remember anything anyway; he wouldn't sleep with a Slytherin while sober. And as far as Draco knew, Potter wasn't even gay. \nThough, as far as Potter knew, Draco wasn't gay either. \nA sudden flash of inspiration struck him. What if he turned the tables on Potter? \nDraco looked at the naked Gryffindor, still sleeping innocently, blissfully unaware of his surroundings. And then Draco grinned, forming a wicked plan. \"What if . . . I start shrieking before he does? What if I accuse him of having taken advantage of poor little me? I could make him feel guilty. He's daft — he'll fall for that. I just have to . . . er . . . take off my clothes and get into bed with him.\" Draco sneaked a glance in Greg's direction. \nGreg was frowning, but as he caught Draco's gaze his expression cleared. \"Excellent plan!\" he said encouragingly, which promptly caused Draco to deflate, suspecting this was in fact a wretched plan.\nHowever, it was all he had. And well, the plan certainly had advantages. \n\"You can leave now,\" he told Greg, who looked terribly relieved. He ran for the door so quickly his large body was no more than a blur as it rushed out of the room. \nLeft alone with a naked Potter, Draco took a shuddering breath. There was no way this could end well, no matter what Draco did, so he might as well do what he wanted. With that in mind, Draco slowly took off his clothes and sneaked quietly towards the bed. Carefully, he sat down and lowered himself next to Potter, setting his wand under the pillow, in the likely event he would need it. \nPotter was warm and he smelled nice, and Draco edged closer, placing one hand on Potter's chest and nestling his head in the crook of Potter's neck. Knowing that Potter would probably hex him silly when he woke up, Draco still grinned widely out of sheer joy he was somewhere he had never believed he'd be. He trailed his hand over Potter's skin, placed a small kiss on his neck, inwardly rehearsing his Sweet-Merlin-what-are-you-doing-in-my-bed-you-bastard speech. \nEnjoying the skin to skin contact and gasping quietly as his cock pressed against Potter's thigh, Draco bit his lip, drawing circles over the hard chest, pleased when the dark delicious looking nipples peaked under his light touch. \nHis hand sneaked lower, towards the sheet that covered Potter's private parts, and he grabbed it carefully, too curious to let the chance slip by. He held his breath as he lifted the sheet, but in that moment Potter stirred, grumbling something. Draco let go quickly, determined to look as though he was sleeping. \nPotter shifted and grunted, and then moved his hands, startling Draco who had suddenly found himself wrapped firmly into Potter's embrace. Panicking, he realised his wand was out of reach. \nAnd then Potter's hands were everywhere. They were caressing Draco's back and snuggling lower to knead Draco's behind. Then they were in his hair, trailing over his neck and shoulders, effectively trapping Draco as well as leaving him breathless. \n\"Mmm,\" Potter murmured, nuzzling Draco's hair. \nDraco was frozen in shock, reminding himself futilely that this was a good time to start shrieking. For all Draco knew, Potter had a girlfriend and he thought he had woken up next to her. There was no telling what he would do when he realised he was snuggling Draco Malfoy. \nHe opened his mouth, but Potter knocked his breath out of him by turning them around so he ended up on top of Draco. His dark head was buried in the crook of Draco's neck, and his lips descended on Draco's pulse point as he purred a soft \"Morning.\" \nDraco tried to yell his originally planned \"What the fuck are you doing in my bed, Potter?\" accusation, and to his credit, he did manage to say both fuck and Potter, but he feared that this did not convey his intentions well. \nPotter was sleepily sucking and licking Draco's neck, edging up towards his jaw, and any second now, he would open his eyes and realise who he was kissing, so this was Draco's last chance. \nHe tried to open his mouth to say something, but Potter was already peppering kisses over Draco's jaw, cheek, and the corner of his mouth, and Draco just couldn't stop him. And then Potter opened his eyes and stared down at Draco with an impossibly green gaze. \nDraco held his breath, giving up on his crazy plan and lying still in his horror, simply waiting for the inventible explosion. \nBut it never came. It took Draco awhile, but it finally dawned on him that Potter did not look upset. On the contrary, he looked . . . flirty. \n\"Some night,\" Potter commented, grinning widely. \nDraco's mouth was still open but he had no idea what to say to that. \n\"I never knew you were so . . . flexible,\" Potter continued, pressing his lower body to Draco's, making their erections touch. \nDraco gasped, his hips rising to meet Potter's and his hands grabbing Potter's arse, driven there by fear that Potter would decide to move away, which would result in Draco's imminent death. \nIt was hard to retain any semblance of coherence, but Draco's mind bravely struggled to understand what was happening. Apparently he had shagged Potter last night, but try as he might he couldn't remember it. Though, at this point, that actually seemed irrelevant. \n\"You're just full of surprises,\" Potter purred with an unpotterish expression, making Draco wonder whether he was actually dreaming. Or he was dead and this was in fact heaven. Or hell, depending on what happened next. \nPotter's hips were circling; their erections rubbing together in a way that made Draco lose his breath as well his mind. And then Potter was kissing him, his tongue sliding in and out of Draco's mouth, his hands grabbing Draco's wrists and pinning them to the pillow, and Draco concluded it didn't matter if he was dead, because he would probably die now anyway. \nAfter a long moment during which Draco's toes curled in pleasure and his body melted into a boneless heap, Potter moved away, breathing shallowly and looking down at Draco with dark eyes, his pupils dilated and his arousal clear in his expression. \n\"We need lube,\" he declared unexpectedly, but very practically, and Draco couldn't agree more. His cock was aching and his entire body was strung like a bow, demanding to be relieved of its tension. \"I need my wand,\" Potter added and Draco looked around frantically, having no idea where Potter's wand was. Instead, he reached beneath the pillow and took out his, handing it to Potter. \nIt was a second later that he realised what he’d done. He had just handed Potter a weapon, leaving himself defenceless. Which was nothing short of idiotic. Potter apparently thought so too because he took Draco's wand with a peculiar expression, looking as surprised as Draco felt. \n\"I . . .\" Draco gasped, frightened. Potter would now hex him, because clearly this was all a ruse to see how far Draco would go. Potter would yell Draco's own special you-evil-bastard speech and hex him into next week.\nDraco closed his eyes as Potter waved his wand and cried, \"Accio lube!\" \nIncredible relief washing over him, Draco's eyes snapped open just as a dozen bottles and tubes flew out of drawers and landed onto the bed next to them. \nPotter stared at the wide assortment and commented ruefully, \"I always knew Slytherins were wankers.\" \n\"They're all Blaise's,\" Draco said quickly. \"Especially that one,\" he lied as Potter took a pink bottle, raising his eyebrow teasingly. \nPotter merely grinned, uncorking the bottle. \"So, Draco, tell me. Do you remember what happened last night?\" he asked conversationally, straddling Draco's thighs and rubbing the lube between his fingers. \nDraco processed the question slowly; he was too busy staring at Potter's naked body. Or more accurately, at Potter's jutting cock that was hard and leaking, and beyond any doubt the most perfect thing Draco had seen in his entire life. But considering Draco's memories were currently limited, that might have been an overstatement. \"Er . . . vaguely,\" Draco claimed, licking his lips and gulping, and then forcing himself to look away from Potter's cock. Instead, he stared, amazed, at Potter's wet fingers. \n\"Oh?\" Potter asked, though it was more of a moan, because at that moment he lifted his hips and snuck a hand behind his own balls, his fingers disappearing behind him. \nDraco whimpered, staring incredulously as Potter's hand moved rhythmically; the minute twitches of his hips and tiny gasps were the only indications that he was currently finger-fucking himself. Which was horrible because Draco desperately wanted to see it, but the angle was all wrong. \nPotter's voice was steady as he spoke. \"I remember everything. Want to hear about it?\" \nDraco nodded, unable to speak or tear his gaze away from Potter's hand. Potter moved it a little, graciously giving Draco a better view, and Draco could now see that Potter had two fingers up his arse. He moved them leisurely, sweat shining on his stomach and his breathing speeding up as his hand moved faster. \n\"Well,\" Potter began, sounding as though they were in fact chatting over afternoon tea, \"first, I almost choked on my chocolate muffin on Friday.\" Potter laughed, then moaned as he took the fingers out of his arse. Then Draco almost choked on his own tongue as Potter's slick hand gripped Draco's cock, rubbing it slowly, with sure up and down strokes. \"And then, I realised that there was a piece of parchment stuffed in there, inviting me to a Slytherin party. Do you know what I thought?\" Potter asked, edging closer, now straddling Draco's hips. \n\"Oh sweet Merlin!\" Draco cried as Potter grabbed Draco's cock firmly and unceremoniously lowered himself onto it, groaning in obvious content as he did so. \nPotter drew a shuddering breath, but he managed to laugh nonetheless. \"Well, I wasn't that surprised.\" \nDraco moaned, his hands gripping Potter's hips because they needed to grip something. He felt like he would drown in this incredible feeling of heat and in the knowledge that he was inside Harry Potter. A frightfully tight Harry Potter. \n\"I was just mildly curious,\" Potter continued, surprising Draco who’d lost the thread of the conversation. Not that he’d had it in the first place, but he was feeling less and less interested in talking and more interested in fucking. But Potter had no intention of stopping either. \"So I decided to go and see what the Slytherins wanted.\" Potter's voice cracked in the end, and he dug his nails into Draco's stomach as he rose and then lowered his hips, adjusting to the feeling. \"I was curious to know whether you planned to do something devious.\" Potter was circling his hips now, making Draco's cock slip out of him a little before it was pulled back in. It was torture, but delicious torture that made Draco bite his lip and clutch Potter's hips as he tried to thrust upwards. But that was a vain attempt since Potter's hands and thighs held him firmly down, not allowing Draco to take control of their coupling. \"It turned out, you did plan something devious. Half of the Slytherin House tried to molest me. However, you kept threatening to hex them all. Which was cute, but very annoying.\" Potter clenched his inner muscles, making Draco cry out loudly as he arched and twisted helplessly on the bed. \n\"It was an educational night.\" Potter kept moving, speeding up now, but still just circling his hips, not thrusting. \"I found out Slytherins can't hold their liquor very well. But they can be very hospitable. Even go as far as to let me sleep in Crabbe's bed so I wouldn't be caught getting back to the Gryffindor Tower. But not hospitable enough to lend me pyjamas.\" \nPotter paused to moan, and Draco could do little but moan with him. Potter's eyes were completely black now, and he was clearly struggling for every breath he took. Sweat glistened on his forehead and his dark hair fell forward, as his hips continued to torture Draco. Potter's muscles flexed and shivered with the effort it took to hold Draco's writhing body pinned to the bed. \nAmazingly, Potter kept talking. \"In fact, Nott went as far as to throw himself over his trunk in fear that I'll take his pyjamas from him. So I took off my clothes and decided to sleep naked. Which was not a good decision since you took that as an invitation to try and sneak into my bed. Several times. Until I Stunned you.\" \nDraco whimpered, in part because he needed to come desperately and Potter was so fucking slow, and in part because somewhere in the back of his mind he had realised that he hadn't really shagged Potter yesterday. This meant that Potter was perfectly aware that Draco had just randomly snuck into his bed and tried to pretend they had shagged. Meaning his earlier conclusion that Potter was trying to kill him wasn't as crazy as it seemed. \n\"After that,\" Potter gasped, his speech interrupted with loud moans that sent fire through Draco's body, despite his distress. \"I fell asleep and I've slept peacefully until someone began cursing and woke me up.\" Potter stopped rolling his hips and he began to rise up and down, finally riding Draco's cock. \"And I almost revealed that I was awake, but I'm really glad I hadn't because then I wouldn't have overheard a very interesting conversation.\" Potter sped up his moves, making Draco's entire body quiver in need. \"And I wouldn't have found out that your advances yesterday weren't the result of too much alcohol, as I’d thought, but apparently — oh! — you‘ve been crushing on me for years.\" Potter laughed breathlessly, and Draco groaned: in anguish because Potter had heard Draco's confession; and pleasure, because Potter began to ride him in earnest. Potter was jumping now, pushing down and arching his spine, the muscles in his stomach and thighs contracting as he impaled himself ruthlessly on Draco's cock. \nDraco was lost; every thought slipped from his mind as his orgasm rushed forward, rippling though his body. He arched upwards, finally allowed to thrust as much as he wished. His hips jerked and his lips parted to utter a scream of pleasure. His orgasm seemed to last for hours, and his body went limp from the exertion, though it still quivered as Potter clenched around him, massaging his softening cock until it became too much. \nMercifully, Potter finally stopped, letting Draco's cock slip out of him. Then he shifted, lowering his sweaty body on top of Draco and nudging Draco's thighs apart to lie between them. \nAfter a couple of breathless, dizzy moments, Draco finally found his voice as well as his brains. \n\"Actually . . . er . . . you misunderstood. I said I had been trying to crush you for years. Obviously. Because we hate each other and I am evil,\" he said lamely, embarrassment washing over him. He had managed to make a complete fool of himself in front of Potter. His crush was revealed and . . . \nAnd they just had some fabulous sex. \nDraco frowned. Now that he thought about it, this was an odd but an interesting turn of events. But no matter how interesting it was, it still made Draco feel worried because it made no sense. Maybe Potter had a strange plan that would eventually drive Draco insane. In that case, the process had already begun. \nHowever, as Draco braved opening his eyes and looked at Potter, the concern for his sanity was quickly pushed aside only to be replaced by another problem. \nThere was tension in Potter's expression and his eyes were still dark and fixed hungrily on Draco. Furthermore, a warm hardness was nudging against Draco's thighs. Gulping, Draco realised that Potter hadn't come. And it certainly didn't seem likely that Potter planned to take care of his problem himself, as indicated by the fact that he was rubbing lube between his fingers again. \n\"You can try to crush me later. It sounds fun,\" Potter murmured in a scratchy voice, but Draco had already forgotten what they were talking about. There were more important things to worry about as Potter's hand lowered down and nudged between Draco's arse cheeks. Slightly alarmed, Draco tried to close his thighs, but that was impossible with Potter lying between them. A single finger pressed against Draco's entrance, and then pushed inside slowly. \nDraco squirmed at the feeling, whimpering when Potter didn't budge but kept pushing until his finger was firmly embedded inside Draco's arse. \nPotter was staring at him, his expression almost frightening in its intensity. \n\"Are you mad at me?\" Draco gasped, still squirming and writhing beneath Potter. He didn't want this if Potter was mad. Well, all right, he did, but this was the last thread of his dignity. Crushing or not, he couldn't just let Potter do to him what he wished. \n\"Do I look mad?\" Potter licked his lips, staring down at Draco as his finger moved in and out of Draco's hole. \n\"Actually, yes, you rather do.\" \nPotter laughed, his white teeth flashing and eyes gleaming wickedly. \"This is not my angry expression. This is my Oh God I'm so hard I can't believe how much I'm going to fuck you right now expression. You should learn the difference. For future references.\" \nDraco's breath hitched, but he wasn't sure whether because Potter had added another finger and was now stretching Draco properly, or because Potter promised he would fuck him now. Maybe it was because Potter had mentioned future references. That would indicate there would be a repeat of this. Which was incredible and very much desired, but ultimately impossible if one was being a realist. \n\"Don't you hate me?\" Draco asked, fighting to be reasonable, but still pushing back on Potter's fingers since their presence inside him was starting to feel nice. More than nice. It made Draco want to purr, so purr he did, clenching around them and trying to pull them deeper inside. \nPotter's lips twitched as he angled carefully, brushing against Draco's prostate, making him gasp much too loudly, in a too high-pitched tone. \n\"I stopped hating you somewhere around the time I discovered you can't really dance — oh, but it didn't stop you from trying.\" \nDraco groaned in distress as Potter removed his fingers and reached down to slick his cock. Heat rushed to Draco cheeks as he remembered his little dance performance. \n\"You ran away when I began dancing,\" Draco pointed out as Potter lowered his body on top of him, their chests pressing together; sweaty skin against sweaty skin. \nPotter's lips were close to Draco's and his breath was hot when he said with a quiet laugh, \"I think that's understandable.\" Then, his eyes big and serious, he added, \"But I don't plan to run anymore.\" Slowly he lowered his lips to Draco's for a gentle kiss. \nDraco relaxed and hummed contently, melting into the soft kiss, and then, shocked, he gasped into Potter's mouth as the warm slick head of Potter's cock nudged against his entrance. Potter pushed his tongue into Draco's mouth, at the same time pushing his cock inside Draco's arse. He entered him in one slow but sure stroke, stretching Draco impossibly as though keen to split him in half. \nDraco tore his mouth away from Potter's to breathe in some desperately needed air, trying to collect his thoughts and decide if he wanted Potter to stop this now or never. Instead of contemplating the problem further, he wrapped his arms and legs around Potter's body, squeezing him none-too-gently and preventing him from moving. \n\"Wait!\" he gasped, knowing he wanted to ask something important, but the thought kept slipping away from him. Potter clenched his jaw and stretched his lips into a smile, clearly attempting to appear patient and encouraging. Which was rather cute and it served to jog Draco's memory, because Potter's general cuteness was one of the important reasons Draco had to ask this question. \"Are we . . . are we dating?\" he breathed. \nPotter's brow furrowed and he looked taken aback for a moment before he gave Draco a genuine smile. \"I think we better should.\" \n\"Oh. All right then. Carry on.\" Draco released Potter from his death grip, allowing him to move. \nPotter looked at him disbelievingly. \n\"I have standards,\" Draco sniffed with an air dignity. \n\"Could've fooled me,\" Potter grumbled, nonetheless smiling as he began to thrust shallowly. \n\"And I'm durable,\" Draco growled, now annoyed with Potter's slowness. \nThere was a glint in Potter's eyes as he said, \"If you say so.\" \nAnd then he slammed into Draco with all his might, and continued pounding inside of him, his thrusts deep and fast. Crying out and throwing his head back, Draco bent his knees and wrapped them more firmly around Potter's body. Then he reached up to grip the headboard, tying to find some leverage to push back, determined not to be outdone. He rolled his hips and drove down on Potter's cock, pulling Potter closer with his legs and cursing loudly, simply because it felt good to curse at a time like this. \nAmazing though this was, Draco was beginning to fear he would truly fall apart beneath Potter's relentless pounding, but soon enough Potter's body went rigid and he grunted, his eyes shut tightly and his bottom lip trapped between his teeth, as he tried to prevent himself from crying out too loudly. His body convulsed, and an uncomfortable wetness filled Draco's arse before Potter shivered and collapsed heavily on top of him. \nBreathing shallowly, Draco lowered his stiff arms and legs, stretching them for a moment and then burying his hands into Potter's unruly hair, stroking the silky locks. \nHe really wanted to shove Potter away because the git was impossibly heavy, but somehow he couldn't bring himself to do that. Even less so after he remembered something. \n\"You covered me with a blanket after you'd Stunned me,\" he murmured. \nPotter made no response and Draco would have believed he had fallen asleep, but he could feel Potter smiling against his chest, and though Draco couldn't see it, he imagined that Potter was blushing. \n\"If you wanted to be nice, you could have carried me or Levitated me onto the bed,\" Draco added grumpily. \nPotter raised his head and blinked at him incredulously. \"No need to thank me or anything.\" \n\"Good,\" Draco asserted. \n\"Git.\" Potter rolled his eyes. \"I was drunk and barely standing. And one should never use magic when drunk.\" \nDraco spluttered. \"You had no problem with Stunning me!\" \nColour rose into Potter's cheeks. \"I panicked. You were . . . insistent and well, it was sort of an accident. I didn't want to make things worse by dropping you on your head or something.\" \n\"Oh, you panicked. Were you scared?\" \nPotter bit his lip in a way that made Draco feel compelled to smile as well as giving him the sudden urge to call Potter Harry. \"Um. I was worried I would take advantage of you while you were drunk. I've Stunned you for your own safety.\" \n\"My hero,\" Draco commented dryly, inwardly pleased that Potter had done this, and that nothing happened yesterday, since that would mean Draco wouldn't remember their first time. \nPotter smiled and pressed a quick kiss to Draco's lips before his expression turned pensive. \"Did you know that while we were partying, Goyle was here reading poetry?\" \nDraco's eyebrows shot up in genuine surprise. \"I find that revelation slightly terrifying.\" \nPotter nodded in agreement, and then looked at Draco coyly. \"I find a lot of last night's revelations terrifying.\" \nDraco was inclined to agree, but he wasn't inclined to confess that. Instead, he concentrated on the less terrifying and more comforting revelations. \"At least I no longer have to ponder the mystery of who shagged Harry Potter.\" Draco wrapped his hands around Potter's back, pulling him closer. \"I didn't care much for that.\" \nPotter's gaze was now entirely too warm and Draco had to look away and clear his throat. \nPotter snuggled closer, in an annoying manner that still made Draco's spent cock twitch and his stomach flip. \"I have another mystery for you,\" Potter purred. \"Maybe you'll like this one better?\" The tone of Potter's voice indicated he might be right. \n\"Oh?\" Draco gasped as Potter bent his head and began to nibble Draco's collarbone. \n\"Mmm-hmm. The question is: How long will it take for Draco Malfoy and Harry Potter to spend all of this lube?\" \nDraco swallowed and eyed the heap of tubes and bottles beside them. Intrigued, he picked up his disregarded wand and waved it at the door, murmuring a strong locking charm. \n\"I think we should stay here until we find the answer to this interesting mystery,\" he declared. \nPotter laughed and then blindly picked up a tube from the heap. After detangling himself from Draco, he sat up on the bed, grinning in a way that should have been illegal. \"Well, then. First things first.\" He settled himself, leaning on the pillows and Draco was forced to wonder what he had gotten himself into when Potter waggled his eyebrows and declared, \"I'm ready for my lap dance.\""
}