{
    "id": "39267930",
    "url": "https://archiveofourown.org/works/39267930?view_full_work=true",
    "author": [
        "CurrentlyCaffeinated"
    ],
    "title": "They Get A Sorry But I Get A Hate Crime",
    "rating": "Not Rated",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Midoriya Izuku/Shinsou Hitoshi",
        "Aizawa Shouta | Eraserhead/Yamada Hizashi | Present Mic"
    ],
    "characters": [],
    "additional_tags": [
        "Midoriya Izuku Has a Healing Quirk",
        "Midoriya Izuku is a Little Shit",
        "Midoriya Izuku Has a Quirk",
        "Vigilante Midoriya Izuku",
        "Insomniac Shinsou Hitoshi",
        "Aizawa Shouta | Eraserhead Training Shinsou Hitoshi",
        "Shinsou Hitoshi is a Little Shit",
        "Shinsou Hitoshi is a Dork",
        "Midoriya Izuku is a Ray of Sunshine",
        "Healer Midoriya Izuku",
        "Aizawa Shouta | Eraserhead is So Done",
        "Parental Aizawa Shouta | Eraserhead",
        "Established Aizawa Shouta | Eraserhead/Yamada Hizashi | Present Mic",
        "Underground Healer Midoriya"
    ],
    "language": "English",
    "series": "Part 5 of The Multiverse's Centered On Midoriya",
    "published": "2022-05-28",
    "completed": null,
    "words": "6,757",
    "chapters": "1/1",
    "comments": "94",
    "kudos": "8,412",
    "bookmarks": "1,600",
    "hits": "49,525",
    "summary": "<p>Healing quirks are uncommon. Especially the kinds that are powerful enough for the rough style of life you find in either the underground or heroic’s industry. Recovery girl for example, is a one in a million kind of person. Her quirk is a godsend for those who constantly face life-threatening dangers. The HPSC makes it a point to prioritize all healing quirks, snatching up the one’s strong enough or fast tracking those the weaker ones you find in the high end hero wards and hospitals. Healer’s who stick to the underground are rare. After all, why spend time in the shitty and violent underground when you could be paid top dollar at a nice hospital and get the HPSC approved security to keep you safe? </p>\n<p>So there is only one explicitly stated rule in the underground: </p>\n<p>Keep Your Hands Off The Healer.</p>\n<p>Midoriya Izuku was born with a healing quirk, a rather unusual one he likes to call \"No Pain, No Gain\", so what happens if he decides to stick to the shadows instead of the light with this kind of quirk? How will this affect the story line?</p>\n<p>A simple oneshot I wrote in a single night, enjoy :)</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a>.)</p>\n<p>For those of you who come across tiktok recommendations of my works, please let it be forewarned that- No, CaptainCoffussy isn’t some random person acting like me, and yes my name is CaptainCoffussy on tiktok dont @ me.</p>",
    "text": "\nDark alleyways and downtown areas, all falling apart at the seams and colored with the vibrancy of the people who live there and the art that’s painted onto walls of abandoned buildings. It's a place where the people have their own rules and the law stays as far as possible away, deeming it too ‘violent’ and ‘dangerous’ to save. The heroes themselves stick to the brighter, richer, \n\nnicer \n\nneighborhoods and the resident’s of this area don’t mind.\n\n \n\nAfter all, they’ve done just fine without any interference.\n\n \n\nKeep to yourself, don’t tread on what’s not your business, and no matter what happens keep your nose out of the underground’s dealings. Criminals, vigilante’s, villains, under’s, morally gray civilians, you name it. They all live here, the downtown of Musutafu, and they coexist in a strange form of harmony that’s reliant on the implicit rules that whisper in ears and haunt the lives of those who break them. Of course, there are some who break these rules, and suffer the consequences but there is one rule that no one in their right mind has ever broken.\n\n \n\nHealing quirks are uncommon. Especially the kinds that are powerful enough for the rough style of life you find in either the underground or heroic’s industry. Recovery girl for example, is a one in a million kind of person. Her quirk is a godsend for those who constantly face life-threatening dangers. The HPSC makes it a point to prioritize all healing quirks, snatching up the one’s strong enough or fast tracking those the weaker ones you find in the high end hero wards and hospitals. Healer’s who stick to the underground are \n\nrare\n\n. After all, why spend time in the shitty and violent underground when you could be paid top dollar at a nice hospital and get the HPSC approved security to keep you safe? \n\n \n\nSo there is only one explicitly stated rule in the underground: \n\n \n\nKeep Your Hands Off The Healer.\n\n \n\nThe last time someone disobeyed that rule? Well, let's just say not even Tartarus will keep you safe from the consequences.\n\n \n\n.\n\n\n.\n\n\n.\n\n\n.\n\n \n\n“Stop,” Shouta all but barked into his com’s, holding up a hand to keep his intern still while he waited for Joke to come to a stop on the rooftop next to their own, “disengage.”\n\n \n\n“Eraserhead,” he heard come from behind him, Hypno’s voice a smooth drawl despite the obvious confusion in it, “why are we stopping? The villains right there?”\n\n \n\nWith a heavy sigh, he gestured for Shinsou to get closer before he spoke, pitching his voice into a low murmur.\n\n \n\n“Here’s your lesson on the only explicit rule of the underground,” he said, the sharpness of his voice carrying the weight of the importance of his words, “healers are untouchable.”\n\n \n\n“Healers?” Shinsou hedged, his voice pitched into a similar whisper.\n\n \n\n“Healers are rare, Hypno. Even in our industry there’s only a handful capable enough to handle healing outside of a hospital environment. For the underground that doesn’t have the luxury of the HPSC’s stalking tendencies to find and hide away their healers, it’s even more uncommon to see one.” He shifted a bit to get comfortable, cursing himself for being too slow to catch the guy they were after before they reached this area.\n\n \n\n“I don’t have the time to get into the other relevant information such as why we stopped here even though there looks to be nowhere for the villain to go, but the short answer is that this is neutral territory \n\nbecause \n\nthere’s a healer here. The underground protects their healers by declaring them a ‘no go’. They are not allowed to be harmed or coerced in any way. Some prisoners in Tartarus are there because they stepped out of line with a healer.”\n\n \n\n“So then the person who overlooks this area…”\n\n \n\n“Is a healer, yes,” he looked up, hearing a small scuff from above him, “and you’re about to see them.”\n\n \n\nOn the tallest building nearby was a person. Their body obscured by the oversized jacket and loose pants that were dark black with bright green highlights that seemed to actually glow. Actually, as the figure got closer- jumping off the roof and onto the next before meandering their way over to where the villain they had been currently chasing sat- he realized that his clothes \n\nwere \n\nglowing. He also realized his original guess had been correct, he knew exactly who this was. \n\n \n\n“Is that a kitsune mask?”\n\n \n\n“Yes,” he whispered back to Shinsou, keeping his eyes on the healer, “His alias is Kitsune, nicknamed Kit by a few of his more regular clients, but his title is ‘The Sukunahikona’.”\n\n \n\n“What?” Shinsou shifted, leaning closer a bit to get a better look at the figure. “Like the deity? \n\nThat \n\nSukunahikona?”\n\n \n\n“Exactly that,” he murmured back.\n\n \n\n“Well,” Shinsou started, an edge to his voice that Shouta knew all too well, “they certainly got the height for it, or well, lack of it.”\n\n \n\n“Brat,” he griped, shoving down the urge to smile as he kept an eye on the interaction in front of them.\n\n \n\n“Eraser,” he heard over the coms, “I’ve got access to the nearby security cameras, sending you the audio feed now.”\n\n \n\n“Got it,” he responded back before falling silent as he heard the tell tale beep of a line being connected.\n\n \n\n“Kitsune,” he heard the man they had been chasing rush out, watching the man shift in real time, “Sorry to randomly drop in like this.”\n\n \n\n“Oh so they get a sorry,” Shinsou griped, “but when he ruins my suit I get a ‘take that you overgrown shit-stain’, this is a hate crime.”\n\n \n\n“Hush,” he hissed, as funny as his intern was, this was \n\nnot the time\n\n.\n\n \n\n“So you say,” came a robotic-like voice, it sounded androgynous and vaguely artificial in a way that had goosebumps rising on his arms.\n\n \n\n“Um,” he heard Shinsou pipe up behind him and sighed under his breath, wondering what he might say but also regretting letting him continue, “why is he holding a bat?”\n\n \n\n“Oh,” Shouta realized, he had forgotten exactly what Kitsune’s quirk was for a second, “well at least the natural law of karma still works on this godforsaken planet.”\n\n \n\n“What-”\n\n \n\n“Just watch.”\n\n \n\n“So how did you manage this,” Kitsune vaguely gestured to the rather large gash on the man’s arm, his Kitsune mask letting out a puff of steam from the mouth as the green glowing eyes seemed to focus on the wound, “you’re not the type to get into high stakes scenarios.”\n\n \n\n“I, uh,” the villain stammered, looking down at the ground now before mumbling, “I tripped while running away from Eraserhead and his brat intern.”\n\n \n\n“\n\nBrat\n\n?” Shinsou hissed before Shouta, not so kindly, shoved him for the volume.\n\n \n\n“Koichiro,” Kitsune sighed, “how in hell did you manage to get on Eraserhead's shit list?”\n\n \n\n“I forgot he shifted his patrol route,” the villain- Koichiro apparently- grumbled, “can we please move past this?”\n\n \n\nWith a heavy sigh, Kitsune raised their bat and twirled it around in an elaborate trick before grabbing the base in a secure grip.\n\n \n\n“Bite some cloth,” Kitsune ordered flatly, “you’re in for a real treat.”\n\n \n\nWithout further stalling, Kitsune raised and swung the bat in a solid movement, the distinct sound of metal hitting flesh \n\nhard \n\nechoing loudly in the air. Shinsou let out a choked garble of sounds, obviously holding back the numerous thoughts such a sight would cause. Koichiro slammed back into the brick wall of the building he had sat next to and Kitsune reeled back for another swing. With another painful metallic thunk, they dropped the bat carelessly onto the ground before kneeling over the limp body they had just produced. Reaching, they placed a hand onto the man’s bicep. The limb produced a neon green glow that slowly enveloped the villain. Seeping into the body. Not long after the green subsided and the body jerked a bit before going still and Kitsune stood back up. The large gash and other wounds- caused by a metal baseball bat- all missing from where they had been previously.\n\n \n\n“Now Eraser,” he heard over the coms and he sighed, he should have known they would notice, “I believe you know my rules.”\n\n \n\n“Yes,” he sighed, fully sitting down now instead of the crouch he was in before, “I’ll wait.”\n\n \n\n“Good,” Kitsune chirped, another steam puff floating away from him, “don’t forget to let your devil child know as well.”\n\n \n\n“Sure,” he smirked, ignoring the squawk from behind him, “now go do whatever else it is you do, Kit.”\n\n \n\n“I’ll have you know that at least my hobbies are respectable,” he heard Kitsune grumble, the voice wobbling harshly as it tried to convey emotion through the artificial tone, “unlike you who wiggles around in a sleeping bag all day.”\n\n \n\n“I would ask how you know about that,” he grouched, “but I have a pretty good idea already on how.”\n\n \n\n“Tell your husband I say hello,” Kitsune, the little shit they are, said, “I haven’t seen him since he got caught up in the south side.”\n\n \n\n“Yea,” he flatly responded, remembering the dazed expression his husband had come home with that day, “I wonder why.”\n\n \n\n“It’s not my fault my quirk works like this,” they giggled, “No pain, no gain am I right?”\n\n \n\n“Ugh,” he scoffed, ignoring the cackles he heard over the end before the healer picked up their bat.\n\n \n\nKitsune turned then, bat slung over their shoulder as they raised their other hand. Giving the two of them a cheeky wave before he disappeared into the alleyways.\n\n \n\n“So,” Shinsou piped up from where he was silently watching over the alleys, “Kitsune’s quirk heals but only after they what? Knock out their patient?”\n\n \n\n“No,” he corrected, “their quirk, as stated by them, is essentially the physical manifestation of no pain no gain. They have to injure their patient before they heal them. Apparently, the more injured you are the more they have to injure you in return because their quirk only heals as much as they damage.”\n\n \n\n“Ow,” Shinsou shuddered, “okay yea no thanks, wait… You said their \n\nregular \n\nclients nicknamed them kit. You called them kit.”\n\n \n\n“Kitsune’s rules state that the chase can only start once their patient has woken up,” he bulldozed over the question, ignoring the absolute glee and horror that had crossed Shinsou’s face, “So be ready to engage Hypno, he’ll wake in another minute.”\n\n \n\n“Oh my god.”\n\n \n\n“Shut up.”\n\n \n\n“\n\nOh my god-\n\n”\n\n \n\n“\n\nShut\n\n.”\n\n \n\n.\n\n\n.\n\n\n.\n\n\n.\n\n \n\n“Oh I’m sorry,” Hitoshi apologized, wincing at the rather large coffee stain on the stranger he had just bumped into, “really, I should’ve been paying better attention.”\n\n \n\nGod he just wanted the ground to swallow him whole. He had come to this café for two reasons. One, it had cats. Two, he had been up until 4 in the morning chasing Koichiro down with Aizawa-sensei- or just Aizawa now, considering he had graduated a month- and had been struck with a bout of insomnia at the same time. Unsurprisingly, he was running on fumes at the moment and coffee and cats seemed like a good idea. Now that he was frantically looking around for some napkins, the stranger in front of him flailing around as he spouted his own bout of apologies, he was starting to doubt it.\n\n \n\nActually nah, he would’ve still come here if he knew this was going to happen.\n\n \n\nWide green eyes nervously flicked up and down from his own eyes to the floor. Sun-kissed skin covered in thousands of freckles framing them in a way that added just the right amount of \n\nsoft\n\n to his facial structure, decorating the roundest cheeks. Which, it was unfair for someone so cute and soft looking to have a jawline that sharp. What made the image a hundred times worse, or better depending on what part of his brain you focused on, was the emerald green curls that looked like a cloud on the stranger's head. Every time they made a slight movement the curls bounced and bobbed and it was adorable. How \n\nunfair\n\n.\n\n \n\n“No really it’s fine! I wasn’t really paying attention myself,” the stranger rambled, still flustered and flailing as they apologized for a mistake Hitoshi made, “so you don’t have to apologize for anything, really! I’ll just go-”\n\n \n\n“Let me buy you a coffee,” he immediately said, his own filter fucking right off when he needed it most, “It was my fault after all, let me get you one as an apology.”\n\n \n\n“I- I-” The stranger stammered, cheeks dusting a slight pink as they wringed their hands. “Okay?”\n\n \n\n“\n\nPerfect\n\n,” he all but purred, content with approval as he gestured towards the booth he had just been heading to, “sit down and I’ll go grab it, any preference?”\n\n \n\n“A gingerbread iced coffee with cream and an extra shot of espresso?” They hedged, nervous and shy. \n\n \n\n“Got it,” he smiled, “and a name to use for it?”\n\n \n\n“Oh! Midoriya Izuku,” Midoriya quickly responded, a small smile on his own face, “and you’re…”\n\n \n\n“Shinsou, Shinsou Hitoshi,” he responded, giving Midoriya a final nod before escaping to the counter to order the drink. Ignoring the way his brain was blaring warning signals in his mind.\n\n \n\nHe knew he could be snarky and sarcastic when it came to the front he pulls up when flustered, but \n\nflirty\n\n? Since when does he get flirty? He’s not Kaminari for crying out loud!\n\n \n\n(He resolutely ignores the way he can feel Midoriya's stare on his back, pretending it doesn’t affect him even as he stands just a little bit straighter.)\n\n \n\nAfter waiting a few minutes, he walked back over to the booth with two coffees in hand. His own coffee had been spilled all over the tiles, much to the workers displeasure.\n\n \n\n“Here,” he said once close enough, sliding the drink Midoriya asked for in front of him as he slid into the other side of the booth, “as ordered.”\n\n \n\n“Thank you,” Midoriya breathed, latching onto the drink like a man dying of thirst in the desert.\n\n \n\n“Let me guess,” he drawled, eyes roaming the freckled face of his new coffee companion for the day, “rough night?”\n\n \n\nIt sure looked like it, especially with how deep the eyebags on Midoriya's face looked.\n\n \n\n“You could say that,” Midoriya laughed, still a bit nervous but relaxing slightly, “insomnia’s a bitch.”\n\n \n\n“That it is,” he nodded solemnly, raising a hand to give a mock salute, “good luck soldier, that’s not a fight easily won.”\n\n \n\nMidoriya snorted, the sound muffled by the hand he had brought up to cover the lower half of his face, before he let out a few giggles.\n\n \n\nThe rest of their afternoon passed just like that, with casual conversation and a few jokes here and there. The longer they got to speak the more attractive Midoriya got, except, it wasn’t his looks that attracted him. No, it was Midoriya as a person that he was focused on now. He started out shy and nervous but the more they talked the more he came out of his shell until he started to go on full tangents. More than one of which were about specific heroes Midoriya looked up too. He had to bite back a smirk when he heard about how Eraserhead, an underground hero that's usually not even heard of let alone known to the extent Midoriya knows, was the man’s favorite hero. Midoriya was sweet but he also had a snarky side to him that came out every now and then to bite back at some of his statements. Hitoshi was living for it, the small smile he had from the beginning only grew in size the longer they spoke. \n\n \n\nUnfortunately, as time passed Hitoshi could only ignore the consistent buzzing of his phone a couple of times before Midoriya noticed.\n\n \n\n“Um,” Midoriya glanced at the place where his phone had been flipped down on the table, it was currently doing its best to vibrate right off onto the floor, “your phone?”\n\n \n\n“Ah,” with a quick movement, he flipped his phone over, checked the name, then swiped end before turning it back over again, “sorry about that, continue.”\n\n \n\n“I,” Midoriya started, his eyes stuck to where his phone had started vibrating again, “that seems important?”\n\n \n\n“No not really,” he shrugged, “just an acquaintance.”\n\n \n\n“An acquaintance that seems to be extremely persistent,” Midoriya drawled, staring at the phone pointedly, “I don’t mind if you answer it.”\n\n \n\nWith a dramatic sigh, which earned him a snort, he flipped his phone over once more and answered the call. Making sure to keep a relatively safe distance between his ear and the phone before he spoke.\n\n \n\n“Hello?”\n\n \n\n“HIIIIIIIIIIIITTTTTOOOOOOOOOSSSSSSHHHHHHHHHIIIIIII! You’re so mean! I’ve been calling for ages!”\n\n \n\nMidoriya winced in front of him, rubbing at his ear sympathetically as he moved the phone even further away from his own.\n\n \n\n“I know,” he responded flatly.\n\n \n\nA gasp rang clear through the phone, “have you been ignoring me?!?”\n\n \n\n“Absolutely,” he easily returned, ignoring the squawk he received to watch as Midoriya muffled his giggles with a hand.\n\n \n\n“So rude! Here I was being a good friend and all and intending to-”\n\n \n\n“Intending’s a big word for you.”\n\n \n\n“-\n\nhush\n\n, invite you over to the squads movie night and yet here you are being so rude!”\n\n \n\n“Since when was I a part of a squad?”\n\n \n\n“You’re an honorary member of course,” Kaminari returned easily, “since you never explicitly stated whether you were a part of the Todosquad or the Bakusquad you kinda just got a position in both.”\n\n \n\n“Take it back,” he immediately responded, “rescind the offer, I refuse.”\n\n \n\n“No take backsies,” the absolute child refuted, “stuck with us for life! As Eijirou would say, ‘best bro’s for lifesies’”\n\n \n\nThis time Midoriya couldn’t quite hold back the cackle he made, tossing a hand over his mouth in a hurry to silence himself.\n\n \n\n“Hitoshi,” he heard Kaminari say through the phone, dreading the obvious grin in his tone, “are you on a date?”\n\n \n\nImmediately Midoriya flushed a bright neon red that had him thinking of strawberries.\n\n \n\n“Yes,” he said back, ignoring the wide eyed stare he got to instead focus on how impossible it seemed for Midoriya to get even redder despite the physical evidence in front of him, “now if you excuse me I’d like to get back to it.”\n\n \n\n“I \n\nexpect \n\ndetails, you hear me Hitoshi? I want all the details when you-”\n\n \n\nWith swift movement, he brought the phone away from his ear and tapped the bright red button to end the call. Placing the phone back down on the table in front of him before he looked back up at Midoriya. The same Midoriya who looked about 2 seconds away from having steam blow out of his ears.\n\n \n\n“Sorry,” he started with, nervously scratching at the back of his neck, “while I would 100% love for this to be a date, I understand if you wouldn’t like tha-”\n\n \n\n“Yes,” Midoriya rushed out, eyes staring determinedly at the table as he rushed the words out of his mouth, “I, I would really like that.”\n\n \n\n“Oh,” he breathed, a sense of relief washing over him, “then you should call me Hitoshi.”\n\n \n\n“Izuku then,” Izuku smiled, “it's only fair.”\n\n \n\n.\n\n\n.\n\n\n.\n\n\n.\n\n \n\nThe first time Shouta had ever met Kitsune, it had been when the Kit had just started out. The Kitsune mask had been just a regular black medical mask and they had dressed in dark fitted clothing, the only similarity in sight being the baseball bat they clearly favored. They had a young, very young, voice that was more on the masculine scale with no artificial voice changer in sight. They were making quite a name for themselves, though they hadn’t received a title yet, and already had a ‘no go’ brand in the underground. \n\n \n\nHe had, admittedly, been a bit too reckless that night. His focus having been distracted by the injuries his husband had sustained on a raid the night before that had him in the hospital. So it came as no surprise that a criminal had caught him off guard. Unsurprising but startling. It really was just a minor wound- in his opinion- as the blade he had been stabbed with was hardly that long. Sure he may have had a concussion too from the criminals partner that had used his distracted state, due to the stabbing, to slam him into a wall but had managed to get them tied up securely enough to call Tsukauchi to send retrieval cops.\n\n \n\nKit had plopped down from a roof then and walked over, fussing over his state while he kinda just stared blankly at him. When the Kit had asked if he had called an ambulance, and while he understood now that it might have been a good idea to do so past him decidedly did \n\nnot\n\n, he had responded with- and he’s not proud of this- ‘tis but a flesh wound’.\n\n \n\n“Right,” Kitsune stated flatly, eyeing the knife still poking out of his right thigh with wary resignation that came from dealing with numerous patients who were hyped up on adrenaline, “yea I don’t think the knife in your thigh agrees.”\n\n \n\n“Eh,” he responded, his head snapping down to look without much thought to the weird fuzz he felt in his brain, “just a small stabbing.”\n\n \n\n“...being stabbed in no way can be considered \n\nsmall\n\n.”\n\n \n\n“The knife was small,” he retorted immediately, “ergo small stabbing.”\n\n \n\n“What the fuck,” Kitsune had muttered to themselves before they had sighed and moved to grab his bat.\n\n \n\nShouta, who was still high off of the brain's version of painkiller and energy drink combo, blinked slowly at the sight.\n\n \n\n“Don’t worry,” Kitsune said, eyes crinkling like they do when someone smiles, “I’ll just provide you with a small nap.”\n\n \n\n“A nap sounds nice,” he said, then everything after that was black.\n\n \n\nSo yea, the first time he had met Kitsune was an experience to say the least.\n\n \n\n.\n\n\n.\n\n\n.\n\n\n.\n\n \n\n“This was not how I expected to meet you,” Hypno said as he stared up at him from the ground, “honest.”\n\n \n\n“Somehow,” Izuku sighed, face palming as he slowly shook his head in exasperation, “I should've known you would take after your mentor.”\n\n \n\n“What?” Hypno questioned, his head wobbling around from the, no doubt, concussion he had received. \n\n \n\n“Stab wound and everything,” he sighed, gesturing to the knife sticking out of Hypno’s left thigh. \n\n \n\nNot the same one Eraser had received his in but close enough.\n\n \n\n“Hey,” Hypno whined, “it’s not that deep. I’m fine.”\n\n \n\n“God, you even sound the same while injured.”\n\n \n\n“It’s not really an injury per say-”\n\n \n\n“There. Is. A. Knife. In. Your. Thigh.” Izuku punctuated each word with a tap of his bat on the ground. “That counts as an injury Hypno, you’ve just been stabbed.”\n\n \n\n“Oh no,” Hypno mumbled a bit deliriously, “\n\nI’m allergic\n\n.”\n\n \n\n“Okay,” Kitsune sighed, “nap time it is.”\n\n \n\n“Oh I love naps-”\n\n \n\nWith a swift swing, Izuku knocked Hypno out with a single blow.\n\n \n\n.\n\n\n.\n\n\n.\n\n\n.\n\n \n\n“So,” he heard Aizawa drawl behind him from where he was giving an incident report to Tsukauchi, the detective himself studiously ignoring the interruption as he worked on quieting his laughter, “I heard you had a run in with Kitsune?”\n\n \n\n“No,” he denied, “I met god.”\n\n \n\n“Unfortunately,” Aizawa said, the smirk in his voice had him groaning into the desk he had face planted in, “I know you didn’t meet god because you would have an injury from the resulting throw down. In fact, your \n\nsuspiciously \n\ninjury free for someone Tsukauchi found passed out on a rooftop.”\n\n \n\n“Ugh,” he groaned.\n\n \n\n“So,” he heard Aizawa continue, “how was your first time?”\n\n \n\n“I can’t remember,” he sighed, “everything blank after I was told it was-” he stopped midway and snapped his jaw closed.\n\n \n\n“What,” Aizawa, the menace and sadist he is, asked, “did Kitsune say? You’ll have to tell Tsukauchi after all.”\n\n \n\nTsukauchi, the betrayer, looked like he was living for this.\n\n \n\n“He’s right,” the man said, “I’ll need it for the report.”\n\n \n\n“I hate you,” Hitoshi seethed, “I loathe the very air you breathe.”\n\n \n\n“So?” Aizawa raised an eyebrow. “What did he say?”\n\n \n\n“After I,” he hesitated before groaning into his hands, “after he told me I got stabbed in the thigh and I said ‘Oh no, I’m allergic’, he said ‘okay, nap time it is’.”\n\n \n\nHonestly, it was rude to cackle at your protégé like that after he just got stabbed. Yes, he was ignoring the fact that he was healed already, he still has the mental trauma damnit. \n\n \n\n“At least try to muffle them,” he snapped, not really angry but still offended, “what if I was scarred forever because I was \n\nstabbed\n\n?”\n\n \n\n“Somehow, I doubt you are.”\n\n \n\n“You never know.”\n\n \n\n“I do-” Aizawa stopped suddenly and turned to face Tsukauchi, changing the subject to whatever case he had been working on previously but Hitoshi could see the story unfolding before him.\n\n \n\n“Spill,” he demanded.\n\n \n\n“No.”\n\n \n\n“I spilled, that means you spill. Now spill.”\n\n \n\n“\n\nNo\n\n.”\n\n \n\n“‘Tis but a flesh wound’ Eraser had stated, in return Kitsune had said ‘yea I don’t think the knife sticking out of your thigh agrees’,” Tsukauchi started to recite, a paper he had been shuffling around to look for now firmly in his hands, “‘Eh, just a small stabbing’ Eraser had replied-”\n\n \n\n“Tsukauchi,” Aizawa hissed even as Hitoshi launched up from his seat.\n\n \n\n“That's why they said I was just like you,” he gasped before realizing what he said. \n\n \n\nInstantly, Tsukauchi started cackling. Actual tears started to stream down his face as he tried to wipe them away. Aizawa had frozen still before slumping into the nearby chair with a loud and dramatic groan.\n\n \n\n“\n\nOh my god\n\n,” Tsukauchi had whispered hysterically, “\n\nthat's too fucking funny\n\n.”\n\n \n\n“\nShut\n,” he and Aizawa hissed in unison, one with bright glowing red eyes and the other with a voice heavy with laced quirk intent.\n\n \n\n.\n\n\n.\n\n\n.\n\n\n.\n\n \n\nIzuku had started dating Hitoshi, and boy was it still weird yet nice to think about, 3 months ago. Within that time, he had come to several revelations.\n\n \n\nFirst and foremost, Hitoshi was definitely Hypno. The hero he had knocked out recently because they had been in the same delirious haze their mentor had been the first time he had met the man. Honestly, the two were a little too similar for supposedly not being blood related. The second most important discovery was, based on the phone call he had taken on their first ‘date’, a graduate of UA highschool. A class A graduate at that. Which means he had been in Bakugo’s class.\n\n \n\nWhy is this relevant you ask? Well, he was currently debating on what kind of outfit to wear to the class A reunion because Hitoshi- sweet Hitoshi- had asked him to come with. Stating something along the lines of how he wanted to show his friends who he was dating and spend more time with him. It was sweet, incredibly so, but now he was faced with a dilemma. Either he goes flashy- a nice outfit he had picked out that he knew Hitoshi would love- or something to help him blend in and avoid the blonde’s gaze.\n\n \n\nThey hadn’t really spoken since his first year of middle school. His Mom had arranged for them to move after their discovery of his quirk- something they had never discovered previously due to his quirkless ‘diagnosis’ and the fact that he had been adamant against hurting people- to prevent the usual series of events healers go through. Which was chalked up to what he and his Mom called the ‘HPSC Stalker Protocol’. His Mom had firmly stated that she would not tolerate having her precious baby kidnapped for a corrupt organization's whims and had called up his Dad to get the ball rolling so they could hide his quirk from pry eyes.\n\n \n\nApparently, ‘work in America’ really meant ‘intelligence agency needed a long term position filled to gather intel on a big bad’. Who knew.\n\n \n\nShaking his head to ignore those thoughts, Izuku picked up his phone and swiped through his contacts until he reached ‘Mad Hatter With A Wrench’.\n\n \n\n-\n\n\nMad Hatter With A Wrench\n\n \n\nRepressedAngerIssues:\n Hey quick question\n\n \n\nRepressedAngerIssue\n: Also did you change my name again???\n\n \n\nMadHatterWithAWrench\n: Go ahead and lay it on me! (of course)\n\n \n\nRepressedAngerIssues\n: (Of course you did (⇀‸↼‶)) Flashy outfit or blend in\n\n \n\nMadHatterWithAWrench\n: Is this about the party? I say go flashy!\n\n \n\nRepressedAngerIssues\n: But what about bomb bitch?\n\n \n\nMadHatterWithAWrench\n: Slay so hard he keels over from a heart attack due to the sheer power of mesh slits\n\n \n\nRepressedAngerIssues\n: \n\nMei\n\n\n \n\n-\n\n \n\nWith sigh, and a begrudgingly fond smile, Izuku reached into his closet and grabbed out the outfit he had planned to use at some point on a date with Hitoshi.\n\n \n\n.\n\n\n.\n\n\n.\n\n\n.\n\n \n\nHitoshi had started dating Izuku 3 months ago and he was still riding that high. Though, he had noticed some things that he had decided early on to accept as easily as he did everything else about his boyfriend.\n\n \n\nFirst revelation was, he’s like 99% sure Izuku was actually Kitsune. After the initial quirk sharing moment one does after a bit of dating- like the post-quirk version of 21 questions- where Izuku had merely said he had a healing quirk with a rather extreme drawback and then proceeded to expertly derail that conversation he had a sneaking suspicion. It was somewhat confirmed that night when he was knocked out because Kitsune, despite the artificial voice, had used the same verbiage and gestures Izu did when trying to get him to take a nap.\n\n \n\nWas he going to say anything that would risk his identity reaching the police? Absolutely not. \n\n \n\nAs Aizawa always said, under’s were just vigilante’s with a license. He operates on the undergrounds rules as much as the people in the underground do.\n\n \n\nSecond revelation was his boyfriend had a horrible sense of fashion that relied on cringy t-shirts and hoodies that made people take a second glance because ‘\n\nno way it actually said that\n\n’. Honestly, his alias and underground persona dressed up in badass streetwear but \n\nIzuku \n\nchose shirts like his pajama top which was just a wite t-shirt with “pajamas” printed on it?\n\n \n\nSo, when he had looked up from the ‘I’m here’ text Izuku had sent him as he waited at the street light near where the party was going to be, he had crashed into error codes at what he saw.\n\n \n\n“Oh,” he said, sounding breathless to his own ears, “\n\noh\n\n.”\n\n \n\n“What?” Izuku asked, his eyes sparkling in a way that betrayed the innocence he was trying to portray. \n\n \n\n“Don’t give me that,” he rushed out, eyes scanning the outfit Izuku wore with an intense focus,  “you look good.”\n\n \n\n“Why thank you,” Izuku smiled genuinely, “I know I normally wear those t-shirts and hoodies you hate-”\n\n \n\n“The last one said ‘Pink Fold-Up Table’ for no reason.”\n\n \n\n“-but I got this outfit to surprise you,” he easily ignored the jab and gave a little spin to show the outfit off easily, “I’m glad you like it.”\n\n \n\n“Very much so,” he agreed, “you ready?”\n\n \n\n“Lead the way,” Izuku chirped, hooking his arm around his own as they walked towards the karaoke joint Kaminari had picked out.\n\n \n\nThey had reached the door, already hearing the obnoxious sounds of UA’s ‘golden graduates’ class as they partied it up inside, when Izuku had casually said:\n\n \n\n“Oh and I also knew Bakugo back when we were kids,” he nonchalantly mentioned as Hitoshi went to open the door, “and he hated my guts so don’t mind the bluster.”\n\n \n\n“What-”\n\n \n\n“Come on!”\n\n \n\n“Wait Izu, what did you just say?!?”\n\n \n\nSure enough, the moment they had stepped into the room- Izuku’s hand firmly encased in his own- they had a solid 10 seconds of peace before all hell broke loose.\n\n \n\nFirst one to break it had been Jirou, who looked Izu up and down before shouting with a smirk, “Damn, I might be lesbian but even I can tell he’s attracive as all hell. Nice game.”\n\n \n\nThis had led to a sharp grin spreading across Izu’s face even as Ashido squealed, jumping up and down in her seat as she pointed towards him with a gasp.\n\n \n\n“Hitoshi!” She shouted with Kaminari. “You brought your man!”\n\n \n\n“Deku?!?” Was the next and final shout to reach their ears, causing him to send a sharp glare in Bakugo’s direction because that had sounded suspiciously close to-\n\n \n\n“Kacchan,” Izuku said sweetly, his eyes shading a sharp vibrant green that almost seemed to glow and yep, he was definitely Kitsune, “It’s good to see you!”\n\n \n\n“Ka-” Kaminari coughed, disbelieving and wide eyes staring at Izuku before he turned to Bakugo, the rest of the Bakusquad all collectively losing their shit with laughter, “\n\nKacchan\n\n?”\n\n \n\n“Bro,” Kirishima started, trying to get words out between his cackles, “why didn’t you tell us you had an old friend? Such a c- \n\ncute \n\nnickname too.”\n\n \n\n“SHUT IT,” Bakugo screeched, surprisingly gentle hands removing Kirishima’s arms from around him as he glared like a petulant child, “STOP SAYING IT!”\n\n \n\n“Oh,” he idly commented as he brought Izuku to sit with him in the booth the Todosquad had taken up residence on, “good to know you two got your shit together then.”\n\n \n\n“HAAAH?” Bakugo snapped, though the raised eyebrow he gave was surprisingly serious.\n\n \n\n“You know,” he gestured vaguely to the way Kirishima was hanging off of him slightly, “the whole horrific pining you two had going on in third year?”\n\n \n\nHonestly, he couldn’t tell if it was more disturbing to realize Bakugo could blush or that he could have feelings like a regular human. After looking at him screeching like a small and very angry dog with a blush deep enough to be seen from the very back of the room, he decided it was both. Both were equally as disturbing.\n\n \n\nWith Kirishima’s special privileges as the key to the deeply constipated Pomeranian's heart, they managed to get everything under control enough to enjoy the rest of the night without too much bluster. It had been, admittedly, fun to spend some time with the casual chaos Class A always seemed to have surrounding them. They hadn’t even needed to stop for a random villain attack as they were so prone to attracting so it was a success overall. Sure, he was teased the entire time but Izuku had been there so he hadn’t minded half as much as he would. The way Izu would blush each time someone brought up their relationship had been \n\nvery \n\nentertaining.\n\n \n\nThey left the building and leisurely made their way towards the train station. His hand wrapped around Izu’s shoulders as he buried himself into Hitoshi’s side. Leeching off his warmth as the chill of the night air whipped past them. It was a comfortable silence, just them basking in each other's presence as they winded down from the social behavioral zoo Class A interactions were.\n\n \n\nIt wasn’t until he could see the train station that he spoke up, deliberately making his tone casual even as he felt a smirk spreading across his face.\n\n \n\n“You’ll take a break from the Kit activities tonight right? This must’ve been exhausting after all.”\n\n \n\n“Yea,” Izuku mumbled, rubbing his eyes, “I probably should. It won’t do me any good to go out while tired. I might have a… Hitoshi.”\n\n \n\n“Izuku.”\n\n \n\n“You sly bastard,” Izuku giggled, but there was a tense line to his shoulders that gave away his anxiety.\n\n \n\n“I am,” he agreed, scrambling for the right words to use before he gave up, blunt was his best form of communication after all, “and I don’t plan on ending up in a ditch just to be an ass Izuku. I lo- like you a lot and would rather keep my boyfriend out of custody.”\n\n \n\nIzuku’s shoulders relaxed then, slumping further into his side before he spoke up again, “thank you.”\n\n \n\n“Of course,” he agreed, “I worship the ground you walk on Izu. keeping your alias a secret is literally bare minimum compared to what I’d do for you.”\n\n \n\n“Bold words from someone who said they were allergic to being stabbed,” Izuku quipped.\n\n \n\n“Oh god,” he realized with a jolt, “of fuck that \n\nwas \n\nyou.”\n\n \n\n“I thought we established this?”\n\n \n\n“We did but I’ve partially blocked that memory out because of the sheer embarrassment I had. Nap time? Really Izu? What am I, 5???”\n\n \n\n“Acted like it,” Izuku sighed dramatically, “saying your fine after being stabbed. You’re exactly like Eraser in that sense.”\n\n \n\n“That's \n\noffensive\n\n.”\n\n \n\n.\n\n\n.\n\n\n.\n\n\n.\n\n \n\n(2 years later)\n\n \n\n“Kitsune,” Shouta greeted, curious as to why the healer was getting this close. He doesn’t remember getting stabbed at any point tonight.\n\n \n\n“Eraser,” Kitsune greeted back with a puff of steam, “how’s your boy doing?”\n\n \n\nThat was another development he loathed. After a particularly bad encounter back when Hypno was his intern and not a fellow experienced colleague, he had accidentally let it known that he saw Hitoshi as a son. It had ended with a lot of tears and agreements but unsurprisingly Kitsune- who had shown up in record time and healed Hitoshi immediately and without the usual dramatics- had latched onto that and now uses it to mercilessly tease him.\n\n \n\n“He’s fine,” he grouched, narrowing his eyes, “you know that already stop asking.”\n\n \n\nKitsune did know, he knew that. Hitoshi had been oddly close with the healer. Close enough that when asked Hitoshi had said ‘yes I do know his real name and no I won’t share’. Understandable as he would do the same.\n\n \n\nSometimes he knew deep down the only thing that made him different from the others in the underground was the plastic rectangle shoved into his utility belt in case he was mistaken as a rather aggressive homeless person who took the law into their hands again.\n\n \n\n“True,” Kitsune cackled and he sighed, begrudgingly fond of the healer despite it all.\n\n \n\n“Awe,” a familiar voice pouted, “having fun without me?”\n\n \n\nHitoshi, Hypno in costume, said as he lifted himself over the ledge of the roof. Walking over to join the two of them with his mask hanging from his neck.\n\n \n\n“As much fun as it was to teach your hell class.”\n\n \n\n“So a blast from the past?”\n\n \n\n“I would give my other leg up if it meant never having to deal with all of you in a contained area ever again.”\n\n \n\n“You love us,” Hitoshi cooed, “don’t lie.”\n\n \n\n“As much fun as this is to watch,” Kitsune chirped, “I’m pretty sure your break is up ‘Raser.”\n\n \n\n“Fuck,” he sighed, slumping even further, “god I need sleep.”\n\n \n\n“Oh?” Kitsune said, his voice shading a bit sharp. “Do I need to remind you what happened the last time you were out while exhausted?”\n\n \n\n“Don’t you dare.”\n\n \n\n“Hitoshi,” Kitsune cheerfully called, the one in question turning almost immediately in response, “your phone darling?”\n\n \n\n“Oh my god,” he stared incredulously, “please tell me my brain is wrong and \n\nyou did not just say that\n\n.”\n\n \n\n“Of course sweetheart,” the devil in the form of a brat responded, easily handing over his phone.\n\n \n\n“I refuse, I \n\nrefuse \n\nto have any knowledge about this. Someone put me into a coma.”\n\n \n\n“Thank you honey,” Kitsune said, then a hand raised and grabbed at his mask, lifting it up until it came off and he just blatantly stared at the healers face, \n\n\n“Hello? Yamada-san? Oh I’m sorry, \n\nHizashi\n\n, yea I’m calling because Shouta seems to be a bit tired tonight and you know how dangerous that is.”\n\n \n\n“I’m having a fucking fever dream,” he whispered to himself, staring at the face of the boyfriend to the man who he sees as his own son.\n\n \n\n“Of course! I’ll send you the location now, have a good night Hizashi.”\n\n \n\nWith a click, Midoriya Izuku ended the phone call he had just made to his husband with a cheeky smirk sent his way. Vaguely he registered Hitoshi pressing the off button for the camera he had installed on his suit but he was too busy having a crisis to fully notice.\n\n \n\n“Well Shouta,” Izuku, the boyfriend of his son, the one they knew as a support industry engineer who partnered with Hatsume from UA, the fucking face behind Kitsune’s mask, chirped, “Its a pleasure to formally meet you in gear but out of mask.”\n\n \n\n“I,” he started, turning his head up to look at the stars that couldn’t be seen past the light pollution anyways, “need a goddamn vacation.”\n\n \n\nIn the background to his agony, the cackles of the two shits he can’t believe he cares about echoed loudly into the night.\n\n\n\n"
}