{
    "id": "39346095",
    "url": "https://archiveofourown.org/works/39346095?view_full_work=true",
    "author": [
        "gr0gu"
    ],
    "title": "Turn Your Back on Mother Nature",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Stranger Things (TV 2016)"
    ],
    "relationships": [
        "Steve Harrington/Eddie Munson",
        "Robin Buckley & Steve Harrington"
    ],
    "characters": [
        "Steve Harrington",
        "Eddie Munson",
        "Robin Buckley"
    ],
    "additional_tags": [
        "Canon Compliant",
        "Period-Typical Homophobia",
        "Sharing a Bed",
        "Saving the World",
        "Steve Harrington Being an Idiot",
        "the three 'S'es",
        "Internalized Homophobia",
        "Gay Eddie Munson",
        "Drinking and Smoking",
        "Bisexual Steve Harrington",
        "Tending to Wounds",
        "Drunken Confessions",
        "Coming Out",
        "Fluff",
        "Sleepy Cuddles",
        "Making Out",
        "Sexual Identity",
        "Sharing Clothes",
        "all the love languages",
        "Happy Ending",
        "Bonus Chapter",
        "D&D",
        "Love Confessions",
        "First Time",
        "giggly sex",
        "Friends to Lovers",
        "Hurt/Comfort",
        "Food as a Metaphor for Love",
        "Getting Together",
        "Fix-It"
    ],
    "language": "English",
    "series": "",
    "published": "2022-05-31",
    "completed": "2022-06-30",
    "words": "16,996",
    "chapters": "4/4",
    "comments": "571",
    "kudos": "16,006",
    "bookmarks": "2,232",
    "hits": "186,866",
    "summary": "<p>It wasn't supposed to go like this.</p>\n<p>Steve was supposed to work with Robin at the Family Video, flirt with the many <em>many</em> girls who came to browse the expansive selection of VHSes, go on some dates, and hopefully find The One.</p>\n<p>It was supposed to be a notably upside-down free year.</p>\n<p>And, hey, for what it's worth? He wasn't supposed to be pinned down on a mattress by Eddie Munson either. </p>\n<p>And he certainly wasn't supposed to be enjoying it.</p>\n<p>But that's getting a bit ahead of things…</p>\n<p>Something in Steve shifts at this. The protective part of his personality gets flipped on like a switch and his mind starts racing to find a solution. He remembers the sleepless nights he had after his first encounter, and how the only reason he started to be able to sleep again was to go to where things had happened one-by-one. To confirm to himself that it was gone. And sure, swimming to the bottom of Lover’s Lake isn’t very plausible, but Steve has another idea.</p>\n<p>“Do you trust me?” Steve asks. Eddie nods. “Then follow me.”</p>\n<p>\"Steve… are you alright?\" She asks, concern lacing her voice. He must look worse than he thought. There is a long pause as she makes her way behind the desk to sit in the chair next to him. She’s frowning and giving him a look that she usually reserves for serious moments.</p>\n<p>He takes a stuttering deep breath, \"I don't know - I think I'm having, like, a crisis or something.\"</p>\n<p>“What was that?” Dustin asks. He’s got this look on his face, something like giddy incredulity. He puts his fork back down into the bowl.</p>\n<p>“I dunno what you’re talking about,” Steve brushes off. He sits back down on the couch and tries to bite back any expression that would give him away.</p>\n<p>“I think he’s talking about the fact that Eddie just kissed you,” Lucas adds. Steve coughs, caught off guard.</p>\n<p>“Yeah,” Dustin confirms, “<em>that</em>,” he agrees.</p>",
    "notes": "<p>Steve Harrington and Eddie Munson do something so evil to my queer rural small town America brain. Happy Pride!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>See you soon with the next update !</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>Hello my darling doves! Thank you for sticking with me and I hope you enjoy this final chapter. I'm working on a new fic that should be up in a few days that I'm really excited for. It's a bit more of a character study of both Eddie and Steve, which is something I really enjoy writing. I hope you'll be looking forward to it.</p>\n<p>Come yell at me on <a href=\"https://scifisblog.tumblr.com/\" rel=\"nofollow\">tumblr</a> if you'd like!</p>\n<p>EDIT: You can read my next work, <em>Hunt the Freak, Right?</em> <a href=\"https://archiveofourown.org/works/39755454/chapters/99531444\" rel=\"nofollow\">HERE</a></p>\n<p>DOUBLE EDIT: there's a bonus chapter up now!</p>\n<p>Before we begin:<br>- If you are completely content with where this story originally left off, so am I! There is absolutely no need to read this chapter if you don’t want to. Sorry if it messes up your bookmarks.<br>- With the impending doom that is vol.2, real life events in the US being pretty shitty at the moment, and it being my birthday, I decided I would indulge those of you who were looking for more to this story.<br>- The support on this fic has been absolutely mind blowing, and I cannot stress to you just how much I appreciate all the love I have received.<br></p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">more notes</a>.)\n</p>\n<p>Love you all to the moon and back.</p>\n<p>If you liked this, thank my friend Gabby. If you didn't like it, blame her too.</p>\n<p>You can find my Tumblr <a href=\"https://scifisblog.tumblr.com/\" rel=\"nofollow\">HERE</a> and my next fic <a href=\"https://archiveofourown.org/works/39755454/chapters/99531444\" rel=\"nofollow\">HERE</a></p>",
    "text": "Vecna being defeated wasn’t an easy task. Steve’s bloodied and demo-bat eaten torso was evidence of that. But they did it. Somehow, they did it. Again.\nHopper's cabin is in shambles, but the gang decided to head there for the night, not yet ready to face their own families after the events of the evening. It takes them all less than thirty minutes to clean the place up.\nThe kids joined by Argyle all pile on the couch and recliner, Nancy and Jonathan head for El's old room, Joyce and Hopper are trying to make some kind of meal with the non perishables, and Steve, Eddie and Robin sit awkwardly on what can only be Hopper's very own bed - located off of the living room.\n\"Where are they going?\" Dustin asks, gesturing to the pair headed for the other room.\nSteve rolls his eyes and Mike shrugs. Chatter resumes.\nSteve couldn't help but be self-loathing, thinking that they were probably going to reunite and Nancy was going to pretend what happened between them never existed. Which is fair really. Nancy and Jonathan always clicked more than them anyway. It still felt like salt in the wound.\nAs if on cue, Steve feels his side twinge with pain.\n“Shit.” Steve hisses and clenches his side.\n“Crap,” Robin moves to face him, “you okay, Steve?” she asks.\nSteve hisses and moves his vest - Eddie’s vest - out of the way. His makeshift bandages are soaked through with black and red goo.\n“I’ll be right back.” Robin says, her voice up an octave or two.\n“That bad, huh?” He asks Eddie, who is blinking at the wound.\nEddie clears his throat, “What - uh - nah. I’m sure everything is fine.” he tries to reassure. It doesn’t, and Steve just scoffs, wincing with immediate regret.\nHe shifts so he’s laying fully on the mattress, his back pressed into the less than soft surface. Eddie is still sitting on the edge of the bed, staring down at his stomach.\n“Take a picture, it’ll last longer.” Steve jokes. It doesn’t land.\nRobin returns in record time, and plops a surprisingly expansive amount of first-aid materials on the threadbare surface beside him. She rustles to take her soiled button-up off before beginning to sort the bandages and medicine, picking the things she will be using.\n“Eddie, can you get me a bowl of warm water and a washcloth please?” She asks. It’s less of a request and more of a demand. Eddie scrambles off the bed and heads to the kitchen.\n“Steve, this is going to hurt.” Robin warns him.\n“Well, it can’t be much worse than when it happened in the first pla-” He cuts off his own comment with a tiny pained groan. The bandage was half stuck to the freshly scabbing wound. Much or the surface that was beginning to heal was ripped off with the fabric.\n“How bad is it?” \nSilence.\n“Rob-” \n“I’m sure it’s not as bad as it looks?” Her voice curves up at the end of the sentence.\nWell that’s not reassuring.\n“Take one of these.” She says, handing him a bottle of ibuprofen. Steve opens the bottle and dry-swallows two.\nEddie returns with a chipped pyrex bowl full of water and a ratty green wash-cloth.\n“This is the best I could do.” He informs.\nRobin nods, “That’ll be fine, start cleaning the wounds while I go wash my hands.”\nSo, then it's just Eddie standing there looking down at Steve for a minute as he blinks up at him. Steve moves to sit up, but Eddie puts a firm hand on his chest and stops him.\n\"Just lay still.\" He says. Steve nods.\nSteve watches Eddie submerge the cloth into the bowl of visibly warm water. He waits a minute before lifting the cloth and wringing the excess liquid out. The bowl is balancing on the mattress next to Steve's thigh.\nSlowly, Eddie lowers the cloth to his torso.\nSteve immediately winces, his upper half surging forward. He doesn't get far before Eddie’s hand presses firmly on his chest and pins him down to the bed. Which, okay, yeah that's probably fair.\n\"It's gonna hurt, but you need to try to stay still, man.\" Eddie says. If Steve wasn't mistaken, there was genuine remorse behind the words. \"You're lucky. I think it’s mostly old blood.\"\nThe next attempt to wipe away the blood was gentler. Smooth rhythmic passes of the washcloth warmed Steve's stomach that had only been covered by a vest and bandage for several hours. It feels nice. That is, until Eddie moves toward the center of the bite.\n\"Shit!\" Steve hisses.\nEddie slams him back down to the bed, his hand pressing firmly into Steve’s hairy chest once again.\nAnd, okay, yeah, maybe Steve didn't mind the sensation as much as he thought he should, but really he was more focused on the pulsating pain coming from his abdomen. He decidedly was not feeling butterflies in his stomach as a result of the man above him. This was a natural reaction to pain.\nEddie then moves to the cut around Steve's neck. Tentatively, Eddie brushes away and debris from the cut. Steve feels warmth rush to his cheeks and looks away from the other man.\n\"Almost done,\" Eddie assures, \"just one last rinse.\" His voice is firm, but almost sweet.\nRobin comes back moments later with freshly scrubbed hands and a headband holding her short hair out of her face.\n\"Looks good.\" She assesses.\nEddie nods, and leaves to discard the cloudy red water.\n\"You're lucky. I don't think these are infected,\" Robin says, trying to lighten the mood, \"but they're going to leave some gnarly scars behind.\"\nSteve closes his eyes and sighs.\n\"Do what you've gotta do.\" He says. So, Robin does.\nFive minutes later Steve has a fresh coat of antibiotic ointment and new actual bandages wrapped around his stomach. A few other bandages litter his body, but the worst ones still ache.\nEddie comes over with a plate of rice and beans for each of them.\n\"Figured we should try to eat something.\" He says, in a hollow way, that Steve doesn't know if he's heard before.\nBeans and rice have never tasted so good. Steve shovels down large spoonfuls, pausing to drink some water, and pacing himself so he doesn't get sick. He's learned his lesson from his previous close encounters, and almost warns Eddie, but the other is only nibbling his food.\nEveryone has something to eat, and Hopper's small home is filled with the smell of food, sweat, and dirt. The sound of the television playing a copy of Robin Hood faintly lingers in the air. At some point, Nancy and Jonathan join the rest of them and find themselves two bowls of soup.\n\"I nicked each of us a piece.\" Eddie says after returning from the kitchen. Discarded from his plate is his remaining food, replaced with three pieces of spam on it, and Steve eats his so fast he feels like tears could fall from his eyes. He groans loudly.\n\"You just made my day.\" He says, only half joking.\nEddie chuckles and eats his own piece almost as quickly, Robin isn't far behind.\nJonathan and Will volunteer to do the dishes while everyone tries to get ready for bed.\n\"The girls can share El's room. I've got some sleeping bags in the closet,\" Hopper offers, \"I don't mind sleeping in the chair if a few people want to pile on my bed,\" he gives a very injured Steve a pointed look, \"the couch pulls out if you kids want to use it, and there's an two air mattresses for the rest of you.\" \nThere's way too many people to try and fit in the house, especially now that they're not so little anymore. But, they find a way to make it work. \nCrammed like sardines, the boys fall asleep on the pull out couch. Jonathan and Joyce use the two air mattresses, Hopper uses the chair, Argyle snags a sleeping bag, Robin, Nancy, Max, and El use her room, and that leaves Eddie and Steve to share the bed. Which pretty much just means them shifting from an upright to horizontal position.\nNobody is bold enough to turn off all the lights.\nThey position themselves facing opposite directions of the mattress. After Steve's face gets smacked a few times by Eddie's socked feet, he falls asleep.\n---\nA squeak of a spring and the click of a door knob shakes Steve abruptly awake from a dreamless sleep. He surges upright and finds that he's alone in the bed. Quickly scanning the room, Steve can't find Eddie anywhere. Everyone else seems to be asleep, likely their bodies gave up on them despite their anxieties, and the bathroom door is ajar.\nThere being only one door to enter the cabin, Steve shuffles onto his feet and pads over to where he assumes Eddie must have exited. Slowly, Steve opens the door and steps out onto the front porch, barefoot. He closes the door silently.\n\"Hey,\" he whispers.\nEddie jolts, \"Jesus Christ.\" He says, startled.\nSteve chuckles, \"Sorry man.\"\nSteve moves to sit down next to Eddie, who slides over to give him some space on the stoop. Steve looks out into the dark woods, only a slight illumination comes from the windows of Hop's place. A plume of smoke falls into his line of vision.\nGlancing over at the man next to him, he finds the source. \n\"You hogging that all for yourself?\" Steve asks, gesturing to the joint in Eddie’s left hand.\nEddie scoffs, \"I was planning on it, yeah.\" He passes it over to Steve anyway.\nSteve takes a long and steady hit. He hadn't smoked in a while, but it's not like he forgot how. He inhales the smoke for a few moments and breathes out a wispy stream. His shoulders release tension almost immediately.\nHe hands the joint back to Eddie. \"Reefer Rick must have the good stuff,\" he jokes, his voice sounds scratchy to his own ears, \"thanks.\"\nEddie nods and lets off a shallow puff. \"Couldn't sleep.\" He explains.\nSteve hums.\n\"Don't know how I seem to be the only one losing my mind over this-\"\nSteve cuts him off, \"Hey - no,\" he nudges Eddie’s shoulder with his own, \"we've all had at least one or two rounds with this bullshit before. You're handling it better than I was the first time, let me tell ya'.\" \nEddie rolls his eyes and passes the now half-smoked joint back over to Steve, who takes another pull.\n\"I'm serious!\" He says, giggling a bit.\nEddie sighs, \"Well I guess that counts for something…\" It's silent for a beat, besides the faint sounds of wildlife in the far off distance.\n\"You're, like, really good at guitar by the way.\" Steve tells him. He doesn't know why he said that.\nEddie laughs a full laugh at that. He shoves Steve's arm and smiles. Some part of Steve feels like he won something with Eddie’s response.\n\"Yeah, well, at least I managed to do something besides run away in the end.\" Eddie says.\nSteve frowns, \"I mean, you're clearly talented enough to learn how to play Nancy's favorite song in record time. Don't sell yourself short, man.\" \nThe joint is passed between them again.\nSteve feels the pain in his side slowly fade to the background. Only a dull ache.\n“I can’t believe I have to go back to school after this,” Eddie says. He sounds exasperated, and Steve doesn’t blame him. “I mean, how the hell am I supposed to pass Ms. O’Donnell’s class when all I can think about is the fact that our shitty small town is directly tied to a supernatural underworld?”\nSteve scoffs, “Yeah man, tell me about it. I would’ve failed O’Donnell if it weren’t for Nance helping me out, and even then it was pretty brutal.”\n“Ah yes, Nancy Wheeler,” Eddie says in a tone that Steve isn’t sure he likes. There’s another silence.\n“Well y’know, she’s a good friend and really smart.” Steve explains, “And at the time we were dating, so…” the pause is awkward. “Anyway, since Dustin is glued to you these days, I’m sure he could make a special emergency call to his girlfriend to change your grade.”\nEddie looks at him with a raised brow.\n“What, the little twerp didn’t tell you? The kid was failing Latin and Suzie hacked into the system or something. She’s crazy smart.” Steve explains\nEddie breathes out a laugh, “And why doesn’t that surprise me?”\nThey both laugh in agreement before the sound drifts off into the night.\n\"What would your song have been? If Vecna took over your mind.\" Eddie asks, seemingly to fill the void.\nSteve laughs, \"I dunno. Hadn't really thought about it.\"\nHe racks his brain for something when Eddie snaps him out of his thoughts. \"Mine would probably be Sanctuary,\" he waits for Steve's reaction. When he gets none he continues, \"by Iron Maiden? Never heard of it?\"\nSteve shakes his head and chuckles.\n\"Jesus, what's yours then?\" \n\"Everybody Wants to Rule the World.\" Steve admits.\nEddie blinks at him. \"Tears For Fears?\" He chides.\nSteve mocks offense, \"Shut up, like you're any better with your metalhead crap-\"\n\"No, it's not- it's just-\" Eddie giggles, \"it's cute is all.\" \n\"C'mon man, don't be an asshole,\" Steve groans.\n\"There's nothing wrong with being cute, Stevie.\" Eddie says in a placating tone\nAnd Steve's too high and in too much pain for this, because when he sees the way Eddie's big glassy brown eyes look over at him he has the urge to reach out towards the other man. To bring him closer somehow. The feeling in his stomach goes from something light to something rotten at the thought.\nAbruptly Steve stands up. He stumbles for a brief moment.\n\"I'm gonna head back in.\" He gestures to the front door, \"you should too.\"\n\"Yeah.\" Eddie agrees. He stays sitting down.\nSteve heads back in, closing the door behind him. He's only been laying on the bed for a few minutes when he feels the surface shift next to him. Steve feels a flat pressure press against his back. After a moment he realizes it's Eddie mirroring his position and facing outward. Steve relaxes a bit into the touch.\nThey fall asleep in tandem. Back to back. And if they wake up with intertwined legs nobody says anything. Not even Robin, who just gives Steve a curious glance.\nSteve manages to get three days off from Family Video to nurse his wounds back to health. Apparently it would 'scare the customers' to see a big red scab around his neck, and honestly? He'll take it. Robin is covering most of his shifts, meaning she's the only one working in the store most of the time. He feels bad, but he manages to get out of the house and drive her home everyday. She says she doesn't mind covering, but that it's more boring without him, and Steve appreciates that he's missed in some capacity.\nThe days pass by in a series of blurs. Besides his trips out to take Robin home, he's alone. His parents are both out of town on business as usual, and they haven't even bothered to call and check in with how he's been doing. The novelty of being home alone wore off on Steve when he was still a child. Now it's just expected.\nAfter redressing his injuries every morning he barely had the motivation to eat. Typically he would make a pot of coffee and eat an orange, not bothering to even make himself some eggs. By lunchtime Steve would have a bit more energy and make an actual meal. He got good at cooking being alone so often, and he's glad he had managed to pick up at least some skill over the years.\nHenderson had lent him his bind-up copy of The Lord of the Rings trilogy after discovering Steve had never read it, or the prequel, and the book had been occupying most of his time at home. He was enjoying it more than any of the shit they had to read in High School, but he was a little lost sometimes.\nAfter taking a shower in the evening, Steve would replace his bandages. He hated doing it because of how tender his skin was, but he didn't dare risk getting an infection. After this, Steve ate a bowl of cereal and would go to bed.\nA total of five days since the demo-bat incident is all it took for the slit around his neck to heal into a thin pink line. Steve hoped it would continue to fade with time. The gashes in his abdomen were scarring and still had thick scabs in the deeper areas. Those, Steve was sure, would not be leaving any time soon.\n---\nThe Beemer pulls into the parking lot next to the video store and Steve has never been so happy to start a shift in his life. He's working noon to seven with Robin today - their usual - and he's glad to be getting back to some semblance of a routine.\nRobin got dropped off at the store by her mother today, so she's already behind the counter when the bell above the door announces Steve's entrance.\nShe whips her head around at the sound and a grin breaks out on her face at the sight of him.\n\"Good to see you back in uniform Harrington,\" She says, her weird way of letting him know she's glad he's back.\nSteve rolls his eyes, \"Yeah, yeah,\" he shuffles over to where she's standing and picks up a pile of VHS cases to reshelve, \"it's good to see you too Buckley.\"\nHe puts back copies of Teen Wolf, E.T, Sixteen Candles, Some Like it Hot, Badlands, Snow White, and Back to the Future before the first customer comes in. Heading back to the counter, Steve puts on his best smile to try and win over whoever walked in.\nWhen he gets to the front of the store, there's a girl he's seen around before glancing at the 'New Arrivals' display. She pops a bubble of bubble-gum in her mouth as he approaches.\n\"Need help with anything?\" He asks in the most customer-first tone he can muster. \nThe woman tucks a loose curl behind her ear and smiles before turning her head towards him. Abruptly, her smile falls.\n\"Oh- uhm.\" She stutters, her eyes dropping down from Steve's eyes to his neck and back up again, \"No, I think I'm good! Thank you though.\" She says quickly, grabbing the first movie she can get her hands on. Steve feels a twinge of shame spread through his bones, and he rubs his arm awkwardly.\n\"Yeah, sure.\" He says. \nHe watches as the girl walks up to the counter and places her choice on the flat surface. Robin scans the code into the girl's account, gives her a printed receipt with the due date, reminds her of the late policy, and wishes her a good day. Steve's still standing dumbly at the front of the store.\nHe shakes his head and walks over to Robin who has a confused look on her face.\n\"Maria Laurence checking out Making Contact?\" She asks in a skeptical tone.\nSteve sighs, \"Yeah, uh, that one might be on me.\" He admits. \"Guess Keith was right about customers not being too keen on getting recommendations from someone who looks like they tried to off themself.\" He gestures to his neck and Robin frowns.\n\"That's not fair, even if you did, which you didn't, people shouldn't give you the cold shoulder for it.\" Robin sounds more frustrated than Steve would expect from her.\n\"Rob, it's fine,\" he tries to reassure.\nShe scowls at him, \"But it's not Steve- you practically saved the world and have the marks to show for it, and people have been complete dicks about it.\" \nSteve only shrugs, \"Yeah, well, it's Hawkins. People are assholes. What's new.\" He sighs, and hoists himself up to sit on the counter, waiting for the next customer.\n---\nAfter their break more customers flow in steadily. People come in after school and work to pick up something to watch with their friends and families, and that means a steady stream of people asking for recommendations or help finding a specific title.\nToday, Robin offers to work the floor while Steve man's the register. He appreciates it after his awkward encounters during the morning. \nFor the most part he can pull out the charm enough to get people to ignore his injuries. There's a woman in her mid-fifties who stops in and feels compelled to tell him that the Lord can guide him to salvation and all that unprompted religious crap that people in the middle of nowhere seem to be pedaling extra hard after the incidents that keep happening. Steve just nods, bites his tongue, and clenches his fist so hard his nails leave little crescent indentations pressed into his palm.\nHe's fucking exhausted to say the least. So, when Eddie walks in an hour before his shift ends he feels a flood of relief at the sight of a familiar face.\nSteve abandons his post and walks over to where Eddie is awkwardly shuffling around.\n\"What's up, Munson?\" He greets. A tentative smile breaks out in his face. It falls when Eddie turns towards him looking exhausted.\n\"Jesus, man. And I thought I looked bad.\" He says before he can stop himself.\nEddie smiles a bit anyways, \"You do,\" he retorts. Steve scoffs. \"Just needed to have a distraction I guess.\" Eddie says, fluttering through the rows of movies. Steve follows closely behind him.\n\"So do you, like, need help finding something, or?\" Steve questions.\nEddie pauses and turns towards Steve again. His eyes are sunken into his face a bit and he looks like he hasn't been eating. Steve's been there before.\n\"How did you… just like,\" Eddie flails his hands lamely, looking over his shoulder to make sure nobody else is near, \"go back to normal?\" He finishes. Something in Steve twists at the vulnerability he hears in Eddie’s tone. Eddie picks at the sleeve of his jacket.\n\"You kinda don't, man.\" He knows it's not what his friend wants to hear, but it's the truth. And part of Steve wishes he had someone be honest with him about all the bullshit that happens after the storm. That the nightmares have nightmares.\nEddie lets out a shaky breath and closes his eyes.\nThere's a small beat of silence in the shop. Robin just finished helping a customer and it's just the three of them left in the store. The evening rush has ended.\n\"I can't even sleep,\" Eddie confesses, \"it's, like, I close my eyes and I'm in that soulless upside-down version of our world where there's something coming for us around every corner. That or someone is getting disjointed and mutilated limb by limb fifteen feet in the air where there's no way I can save them.\" \nSteve hears something in Eddie’s voice that's pleading. Begging for someone to tell him how to fix this, or how to move on. And Steve wishes he could give him an easy answer.\n\"You did - save them. In the end I mean,\" Steve corrects, \"Nancy and Will. You pulled them back to reality when nobody else could, Eddie, that's something.\" \nEddie opens his eyes and looks at Steve again.\nSteve continues, \"You want my honest answer? How to get a good night's sleep after this?\"\nEddie nods frantically.\n\"You get shitfaced and pass out. Then when you wake up you hope that it won't happen again, even though at this point you're pretty sure that it will.\" Steve admits. He’s only half joking.\nEddie shuffles from foot to foot. \"I can't even go back home. My uncle's trailer, it's…\" he trails off.\nSteve had not thought about that. For him the closest it got to his home was his pool in the backyard, which he confronted when he was ready. But with Eddie? It literally ripped a hole into the ceiling of his life.\n\"Yeah… Shit.\" Steve says dumbly. Eddie nods.\nSomething in Steve shifts at this. The protective part of his personality gets flipped on like a switch and his mind starts racing to find a solution. He remembers the sleepless nights he had after his first encounter, and how the only reason he started to be able to sleep again was to go to where things had happened one-by-one. To confirm to himself that it was gone. And sure, swimming to the bottom of Lover’s Lake isn’t very plausible, but Steve has another idea.\n“Do you trust me?” Steve asks. Eddie nods. “Then follow me.” \nSteve walks back up to the counter where Robin is sitting. “I’ve gotta ask a favor.” Steve says under his breath. Robin raises a brow. Steve leans on the counter a bit. “Cover for my last hour and I’ll open tomorrow?” He asks, gesturing with his head to Eddie standing behind him.\nRobin rolls her eyes, “You’re lucky I like you, Harrington.” she says.\nSteve grins at her, “Love you too, Robin.” he says sweetly. She rolls her eyes again.\nHe turns his attention back to Eddie who’s still standing behind him awkwardly. Steve claps his shoulder and guides him to the door, out to the parking lot, and into his car. \n“Where are we going?” Eddie asks.\nSteve shifts into gear and looks over to him, “To get drunk.” \n---\nA stop at a gas station that Steve knows still doesn’t card to pick up some beer and snacks later and they’re on their way to a place Steve could find blindfolded. It’s probably a fifteen minute drive, and the entire time Steve and Eddie argue over the music.\n“Dude, I’m not listening to Black Sabbath or whoever this is!” Steve says between laughs as he turns the dial on the radio.\n“It’s Def Leppard.” Eddie corrects, sounding almost scandalized, “And, yeah? Well, I’m not listening to The Cure,” Eddie responds, lunging forward to reach the radio. And okay Steve agrees with that, so he lets Eddie turn the knob again. It’s a lot of static and classical music for a moment before he looks over to see Eddie rummaging through the center console to find a cassette he deems worthy, clearly having given up on the local stations.\n“This’ll do.” Eddie announces and pops the tape into the deck. \nIt’s Queen, The Game to be specific, and they only get halfway through “Dragon Attack” before Steve pulls off the side of the road and cuts the song short. They’re here.\nEddie looks like a deer in headlights. \nSteve pops the trunk, “We’ll be fine.” Steve reassures as the pair step out of his car. He heads to the back and reaches inside, pulling out his coveted nail covered bat. “But just in case…”\nEddie only stares at the weapon before nodding.\nSo, with a brown paper bag full of beer and snacks in one hand and his bat in the other, Steve leads the way through the woods to get to Skull Rock. Keeping an eye on Eddie to make sure he’s not about to freak out - or get lost - he crunches his way through the dead leaves and brambles.\n“You take everyone here on the first date?” Eddie asks, his voice a mix of sarcasm, anxiety, and something else.\nSteve laughs as the three large boulders come into view. His cheeks color a bit too, because, yeah, maybe the implication of going to Skull Rock with another guy is just now hitting him. But really what are the chances someone else would come out here so soon after a string of murders? \nHe plays along, “No. Only the ones who experience severe trauma.” he says. He hears Eddie chuckle and counts it as a good sign.\n\"So, why exactly are we here?\" \nSteve sets down what he's carrying and lets out a deep breath. \"It helps… going back to somewhere that something happened.\" Steve explains after he sits down. \"With someone, usually. It's kinda brutal alone.\" \nEddie hums, but still looks uneasy. Steve unloads the bag next to him pulling out two forty ounce beers, a bag of Lays potato chips, and a can of Pringles. He hands one of the beverages up to the other man. Eddie takes it and slides his back down the side of the rock to sit on the ground next to Steve. Eddie unscrews the metal cap of his drink and flicks it off the top. It clanks against the far rock. He takes a long chug of the forty and Steve watches as he winces at the taste of the malt liquor. Steve slowly opens his own bottle and takes a sip. It’s not exactly his beverage of choice, but it’ll get the job done, and he has to drive home so he’s not planning on getting hammered or anything.\nIt’s quiet for a moment, and Steve feels like he has to break the ice. “So, how’s English going?” he asks. Eddie scoffs, “Well, I took your tip on asking Dustin for help and he managed to get Suzie to bump my grade from an F to a D, so all in all? Things are looking up for me academically.” Eddie says. Steve smiles at this even though he knows Eddie is exaggerating a bit.\n“Mhm, and now that you’re gonna graduate, do you have any plans?” Steve questions. He opens the can of pringles and pops one into his mouth, chewing softly.\nEddie takes a small sip of his beer before answering, “You’re really gonna make me contemplate my future right now, Steve?” he retorts. Steve feels a giggle erupt from his chest and he is not anywhere even close to being drunk to justify it. Eddie smiles lopsidedly and looks over at him, “Haven’t really thought about it, what with the whole failing two times and being a drug dealer thing.” He answers. Steve looks away and rests his head on the boulder behind him.\n“Yeah, well, I went from being King Steve to a burnout babysitter who works at a Family Video after his Schoops Ahoy gig quite literally went up in flames-” Steve remembers he doesn’t have to lie about the Star Court situation with Eddie, but doesn’t care enough to correct himself, “The point is, you’re talking to the expert in things not going to plan, man.” He looks over at Eddie who is still smiling at him, “Just spitball something. What does Eddie Munson want to do when he’s done with school?” he asks again.\nEddie takes another sip of his 40 and stretches his legs out so they’re flat on the ground in front of him. He seems to think for a moment. “I dunno,” he starts, “I guess the dream would be to open a game store, maybe sell books and shit too.” he shrugs. “There’s no way I’d have enough money to open one up though, so I’d have to work my ass off for a few years. But, yeah, that’s the goal I guess.” \nSteve hums. It suits Eddie, he thinks. He can picture it in his head: the messy stacks of books, board games, and electronics cluttering a small storefront, with a table set up for him and his little pack of nerd friends to play D&amp;D together. It makes sense, and he says just as much.\n“Well, what about you then? Can’t imagine you want to be working at Family Video the rest of your life.” Eddie says.\nSteve nods and rests his chin on his knees, “Yeah.” he agrees. “S’just I don’t really know what I want? Don’t know that I ever have if I’m honest.” He shrugs. “Like, my whole life my parents had these expectations for me to get straight As, go to a semi-decent college, and then take over their firm. And then kids at school expected me to be some Playboy who was on all the sports teams and went to a party every night - and I really wasn’t ever either of those guys.” Steve explains. “So, yeah, I guess I don't really know what I want. I’m still tryin’ to figure that out.”\nEddie looks at him kinda funny for a moment but before Steve can pretend he didn’t share any of that with someone else, Eddie stands up abruptly. One hand holds his beer and the other one reaches out towards Steve to pull him upwards to his feet. Steve raises a brow once he’s upright, and Eddie only drops his hand and leads him out from under the rock formation. Steve watches as the other man hops from smaller rocks to bigger ones, then up the side of the largest boulder before sitting atop its large surface. “You coming, Harrington?” He asks. Steve shakes his head in bewilderment before mimicking Eddie’s previous movements. \nIn all his trips to Skull Rock he had never climbed to the top of it. The view was beautiful, the sun was setting far off beyond the trees and a warm orange glow bounced off the green leaves that were beginning to grow.\n“I figured out how to get up here when I was waiting for you guys the other day.” Eddie says. He gets comfortable and leans back on his elbows.\nSteve does the same and looks out at the woods in front of them. \"It's nice.\" Steve notes. Eddie hums. They drink in silence for a few minutes. His watch reads 7:45, and Steve determines that they probably have less than half an hour before it gets too dark to find their way back to his car. \nSteve turns his head to face Eddie who is getting to around the halfway point of his beer. He watches as he picks at the cheap label and taps his foot to an imagined beat. Eddie catches the glance and smiles. “Thanks for putting up with me.” Eddie says. Steve furrows his brow, “Of course, any time.” He says, and he means it. After the stuff back when he was seventeen, he wished he had someone to hang out with who wasn’t a literal child or his ex. That’s one of the many reasons why he was so glad to finally meet Robin.\n“Where did you go after this shit happened to you the first time?” Eddie asks.\nIt’s Steve’s turn to take a large gulp of his drink. He screws the cap back on and sets it to the side. “My backyard. Well, the pool I guess.” he answers. Eddie looks confused. “Remember when Barb Holland went missing?” he asks. Eddie nods. “Yeah, well, that was the first kill that we know of. She got dragged into my pool and disappeared. Ate Nancy alive just thinking about it because she was with me that night, and I don’t blame her, but I guess instead of bringing us together it pushed us apart… For good.” Steve explains.\n“That’s pretty shitty.” Eddie says.\nSteve sighs deep through his mouth. “Yeah, I guess I don’t really blame her though. I just wish she went about it differently instead of calling the idea of me being in love with her bullshit.” He does air quotes around the last word.\nEddie’s eyes grow wide, “Jesus, that’s brutal.”\nSteve snorts. “Yeah, you’re tellin’ me.” He pauses for a second. “Anyway. After everything happened I went to the edge of my pool and just sat there for probably half an hour. I felt like I couldn’t move, like my arms were being held down by ten pound weights and I couldn’t catch my breath. Kinda sucked facing something like that alone.” Steve says. He remembers the rush of anxiety and dread he was facing and shakes his head to brush it off.\nEddie hums, “Well, thanks for not abandoning me.” Steve laughs. \n“I haven’t been able to be outside for too long or fall asleep for more than an hour since it happened. I feel like I’m paranoid as shit.” Eddie says. “If I’m honest? I’m surprised I haven’t flaked yet.” Eddie confesses. Steve catches that Eddie's beer is almost gone.\nSteve frowns and looks him in the eye. And okay, Steve doesn’t know how they got this close but he can see the way Eddie’s eyes look like amber in the sun and he can’t seem to break contact. “I think you don’t give yourself enough credit. Pretty sure we determined that you don’t always run in the face of something that’s scary…” Steve finds himself saying softly. It’s like a secret shared between them. For some reason Eddie’s eyes flicker down to Steve’s neck and Steve reaches up to rub at it self-consciously. Steve watches as Eddie tentatively reaches out to stop his movements. He feels calloused fingertips pull his hand down, then the feather-light touch of a finger tracing the pink mark. It’s gentle in a way that Steve hasn’t been touched in so so long. His eyelids flutter closed and he swallows deeply, trying to ignore the feeling in his stomach that can only be described as butterflies. Just as soon as the touch is there, it’s gone.\n“I think the scars just make you look cooler dude.” Eddie decides. Steve opens his eyes and sees him lying flat on his back staring off into the sky.\nSteve clears his throat, “Yeah, well, apparently it’s not good for business. You’d never believe the woman who came in today saying that if only I accepted Jesus as my Lord and Savior would I see the light of Heaven or some crap like that.” He joked. Eddie scoffs, “Yup I get that a lot. They think I'm a Devil worshiper and a fairy.”\nSteve frowns because Eddie didn’t seem like the type of person to hate gay people, but before he can contemplate that thought any further Eddie says, “They’re right though. Well, about the queer part at least.” And Eddie says it so casually and with such a jovial voice that Steve knows he didn’t mean to actually tell him that.\nAnd okay, yeah, Steve is totally fine with this, he’s fine with Robin - right? Robin is probably his best actual friend that he has ever had and her being a lesbian or whatever is chill, if anything it makes her more relatable. So, Steve doesn’t know why he feels like he got smacked sober just now at the revelation that Eddie Munson is definitely, one-hundred percent, without a doubt, into guys. \nJust as Steve is processing this new information Eddie seems to catch up with what he said because he sits upright abruptly. Steve sees this out of the corner of his eye and he's trying to figure out a way to tell Eddie that it’s cool, but he feels anything but cool right now at the realization that Eddie is into dudes, and he doesn’t know why this is tripping him up so much. And now it’s been a whole twenty seconds of him just sitting here, but he can’t exactly tell him that \"My best friend is a lesbian, so don’t worry!\", because that would be a complete violation of Robin’s trust. And now Eddie is standing up with this manic look on his face and Steve just acts on instinct and grabs the end of Eddie’s pant leg before he can move. Eddie freezes on the spot.\n\"You're not the first gay person I've met Eddie... Sit down before you hurt yourself.\" Is what he goes with.\nHe watches as Eddie just kind of flounders until he realizes that Steve is not going to do something violent like push him off the boulder or hit him. Steve winces at the thought that he might come across that way. He doesn’t let go until Eddie sits back down. Sure, okay, that diffused the immediate situation, but now it's awkward as hell because it’s silent and all Steve is thinking about is guys and guys being into other guys. Steve sorta gets it if he’s being honest. Maybe he’s more drunk than he thought.\nThe sun is low in the horizon now and Steve stands up with a stretch. “We should get going.” He suggests. Eddie follows his lead, stumbling a bit, but catching his balance. “Yeah.” he agrees.\nGoing down is easier than climbing up the rock formation. The pair (mostly Eddie) stumble a few times, but they make it down no problem. Steve feels good enough to drive, so he packs up all their stuff and leads Eddie back to the car. The cassette starts playing where it left off and Steve turns the volume down so it is just a low hum. Eddie is noticeably uncomfortable and Steve doesn’t really know how to put him at ease.\n“Do you like Chinese food?” Steve asks.\nEddie looks at him, clearly buzzed but not fully drunk, “Yeah… Yeah, that sounds good.” he answers.\nSteve puts on an easy smile and puts his car into gear, “Alright. There’s this place down the road from my house, it’s pretty good-”\n“Your house?” Eddie asks, confusion lacing his voice.\nSteve looks away from the road for a moment to give him a look, “Yeah. Did you think I was just gonna drop you back off at your place after you told me you haven’t been able to sleep for days?” Steve asks, looking back to the road. He doesn’t let Eddie respond. “No, man, we’re gonna eat some fried food and watch a shitty movie and hopefully you’ll get some rest.” Steve says. \n“Okay, thanks.” Eddie says, finally sounding back to his usual self.\n---\nThey’re back at Steve’s home, and after Eddie is done ogling over the size of the place, they funnel into the living room with a bag of scorching hot takeout. Steve grabbed a pile of blankets from the linen closet and piled a bunch of pillows on the ground in front of the couch. It's easier to clean a mess or a spill off of some blankets than his mother’s finely upholstered furniture. Steve's learned that the hard way.\nEddie is in the kitchen looking through the cabinets and the fridge. He brings over two wine coolers with the caps already popped off. He hands Steve one and plops down in the middle of the mass of pillows and blankets. He begins sorting through the paper cartons of food. Steve walks over to the shelf of movies next to the television. He puts in a copy of Ariplane! and joins his friend in stuffing his face with food.\nEddie looks up at the screen mid bite of beef lo mein. “Nice.” He approves, a noodle still hanging out of his mouth. Steve just smiles to himself.\nAt some point during the movie they finish eating. Steve gathers up their half eaten food and garbage and takes it to the kitchen. Eddie offers to help, but he brushes off the offer. After putting away the food into the fridge, Steve grabs two clean glasses and fills them with tap water.\nOn the way back into the living room he sets them on an end table. When he looks over to where he was sitting, he sees Eddie blink slowly a few times, trying to fight off sleep. He slides back under his quilt and leans back against the foot of the couch.\nTen more minutes pass and Steve feels a soft pressure on his shoulder. It’s Eddie. Or, rather, Eddie’s head. He’s clearly half asleep right now, but Steve’s face flushes nonetheless. The movie is getting near the end and Steve tries to just focus on that.\nBut something in his chest is screaming at him to bring the other man closer to him, and despite everything in his head telling him that it’s a bad idea, he does.\nSlowly, Steve lifts his left arm, sliding it up and over Eddie. He brushes his fingers through Eddie’s hair and guides the other man's head to his shoulder between his neck and clavicle. He feels his heart pound as Eddie tenses before nestling into his shoulder. Fuck. Yeah. Okay. Steve decidedly doesn't not like the way this feels. He runs his hand through Eddie's hair again and rubs his scalp. A soft noise comes from Eddie who is still half asleep, and if it wasn't for their proximity Steve wouldn't have even heard it. But they're close and he does, and the sound makes something erupt inside Steve for the second time that night.\nHe rubs a little harder and gently massages his head. Eddie's hand grips Steve's thigh as Steve hears Eddie let out a small groan. He promptly decides he needs to stop before he does something really fucking stupid, but he has to ignore how much every inch of his body is screaming at him to keep getting closer to the other man who is quite literally right next to him. He gently lowers his hand from Eddie's head and rests it over his shoulders. The grip on his thigh loosens, but the hand stays. Steve thinks about just exactly where Eddie's hand is and closes his eyes abruptly to rid the thought. \nHe's just drunk and tired.\nA few moments later, soft heavy breaths of sleep come from Eddie’s lips. Steve desperately wishes that sleep would take him over too.\nIt's the second time Steve falls asleep next to Eddie and the first time that he wakes up alone.\nAs he sits up he feels his neck crack from the position he fell asleep in. Steve can hear the shower running down the hall and assumes that’s where Eddie must be. His eyes feel grimy and he rubs them a few times. Then, opening them, he sees the clock above the television reads quarter after eleven in the morning. A bolt of anxiety runs through him at the realization that if he doesn’t start getting ready right now he’ll be late for work.\nStanding upright, Steve feels prickly around the edges. He grabs one of the glasses of water from the table and chugs the entire thing. He sets the empty cup back down and moves to the stairs to get to his room, still feeling a bit dizzy as he scales them. \nIn his room, Steve pulls off his shirt, jeans, and underwear from the night before. Lines are indented into his skin from the fact that he fell asleep in such a coarse material. Sorting through his dresser, he picks out a plain brown turtleneck and puts it on, hoping it will cover any visible injuries. He pulls on a fresh pair of briefs and blue jeans, rethreading his belt through the loops and fastening it with ease. He tosses the worn clothes into an empty laundry basket and heads back downstairs.\nWhen he enters the kitchen he immediately starts a pot of coffee. He then notices that the shower is no longer running and assumes that Eddie will be joining him shortly. So, he puts four slices of toast in the toaster and cracks two eggs into a frying pan. He decides to make them sunny-side up after they yolks manage to stay in one piece. The pan sizzles and Steve lets the smell of breakfast fill the room. It puts him at ease. While the eggs are cooking, he packs a meal for his breaktime at work. Today he makes a sandwich and puts a second one into the refrigerator for Eddie if he wants it later. \nThe bread pops from the toaster and Steve lightly butters each slice. He pulls out two plates and puts two pieces on each one. When the eggs are done, he carefully puts one on each plate, only breaking the yolk on one that he decides will be his own. Just as he’s pouring two mugs of coffee, he hears Eddie emerge from the bathroom.\n“I’m in the kitchen!” Steve shouts, but not too loud as to aggravate his own slight headache. He hears soft footsteps nearing his position and when he looks up he sees the other man. Steve has to set down the glass carafe before he drops it. Eddie is wearing Steve’s clothes.\nIt’s one of Steve’s many crewnecks - a black one because of course it is - paired with a pair of grey sweat shorts cinched in at the waist by the drawstrings. Steve’s eyes track down to Eddie’s bony yet muscular legs that are covered in fine dark hairs and littered with small tattoos. He swallows deeply and looks back up to Eddie’s face. His hair is still damp and drying into curly tendrils. Steve’s face heats.\n“Breakfast.” is all Steve says, picking up his plate and coffee and walking to the dining table. Eddie follows him with his own plate of food and sits down across from Steve. He feels Eddie’s long limbs extend under the table and lightly brush against his ankle. His heart seems to skip a beat.\n“I hope it’s okay that I borrowed some clothes. Didn’t mean to go snooping or anything…” Eddie drifts off, clearly unsure if this was overstepping based on Steve’s unwarranted reaction. “Of course.” Steve says. He manages to look over at Eddie who is taking a bite of toast and leaning his elbow on the surface in front of him. He’s smiling to himself, and Steve finds that he likes the sight. Eddie tucks a strand of hair behind his hair and looks up - catching Steve staring.\n“Thanks for breakfast.” Eddie says. Steve smiles, nods, and goes back to eating his own meal. He is trying to be normal about this. Whatever this is. Eddie looking soft around the edges by wearing his clothes and smelling like him should not be making him blush like a schoolgirl. It wasn’t normal.\nSteve eats his breakfast for a moment, his mind racing. “You should stay,” Steve says before he can stop himself. Eddie lets another small smile show on his face and tilts his head to look at Steve curiously. “Today, I mean. Y’know - It’ll just be easier, right? I’ve gotta leave in, like, five minutes to get to work and you’ll have the place to yourself to do whatever it is that occupies Eddie Munson’s free time.” Steve says, trying to keep his tone casual. He can feel the other man’s eyes on him as he takes a long sip from his mug.\n“Yeah, that sounds nice.” Eddie says softly. His mouth is still scratchy from waking up and Steve has to shove a piece of toast in his mouth before he says something stupid.\nAfter eating his breakfast at a rapid pace, Steve takes his plate and mug to the sink and rinses them. He then walks to the bathroom where he brushes his teeth, tries to do something with his hair, and puts on some deodorant, before returning back to the kitchen.\n“I get back around quarter after seven,” Steve says, “There’s a sandwich for you in the fridge if you want.” Steve says. Eddie swallows the mouthful of food he is chewing, “You made me lunch?” Eddie asks, almost incredulous. Steve shrugs, “I mean… Yeah?” he says.\n“Okay.” Eddie says, smiling for the umpteenth time that morning, “Thanks.”\nSteve nods. “I meant to ask, did you sleep well last night?” Steve asks.\n“Like a baby.” Eddie answers into the brim of his mug before taking a drink.\n---\nThe Family Video parking lot is empty when Steve arrives. His watch reads 11:55, and Steve is glad he decided to drive a little faster on the back roads than he normally would have. He grabs his vest from the back seat, steps out of the car, and slides it on.\nAfter unlocking the door, he flips the sign from ‘closed’ to ‘welcome’. It is usually a while before any customers really come in, and he uses this time to make sure everything got done from the night before. After turning on the computer at the register and restocking the candy on the desk, Steve is only left with his thoughts to occupy his time - and frankly he has never wished for some annoying teenage kid to break through the front doors announcing an end-of-the-world level event more than right now. Because Steve Harrington is having some thoughts that he can’t really explain, and ones that he certainly cannot ignore.\nIt’s just - when he was drunk and high around Eddie he could explain away what he was experiencing. His heart would skip a beat when Eddie looked at him a little too long or when he would touch him and he’d find himself wanting to get a smile or a laugh out of the other guy. It was normal to be flustered under those circumstances, to loosen up a bit. But this morning… This morning was something real, and if that was real, didn’t that make everything else real too?\nSteve feels his throat become dry at the thought. He sits down on the stool behind the counter and tries to ignore the slight tremor in his hands.\nThe front door jingles as a middle aged man enters the store. “Do y’all have Star Wars?” the man asks. Steve nods, exiting from behind the desk and leading the customer to the Sci-Fi section of the store. He points to the three franchise films on the shelf. Steve watches as the man grabs a copy of each movie before following Steve back up to the register. He gets the man the movies he wants and watches him go to his car.\nThen it’s quiet again. Steve looks at his watch which blinks back 12:45. Only fifteen minutes until Robin would be there.\nEvidently, it’s not quick enough because Steve’s head is bombarded with a myriad of thoughts.\nIf Steve felt whatever it was that he was feeling for Eddie it didn’t make sense, because he wasn’t gay. He liked women. Notoriously, one might add. He was in love with Nancy for as long as they were together. He dated and hooked up with girls throughout high school, and he even had a crush on Robin until he found out she was definitely off the market. He liked the way it felt. A lot. It wasn’t just women he had been with though. He had had celebrity crushes since he was growing up, Farrah Fawcett being just the tip of the iceberg. \nWith Eddie though… He couldn’t say that he didn’t recognize the reactions his body was having towards him. A flutter in his stomach and a blush on his cheeks aren’t something that he feels for someone he only sees as a friend. He feels his eyes begin to sting a bit and he closes them, afraid of what might happen if he doesn’t.\nDamn Eddie Munson, with his stupid smile, and his stupid hair, and his stupid laugh, and his stupid calloused fingers.\nThe jingle of the front door snaps Steve out of his spiral. Robin is finally here.\n\"I like boobies.\" Are the first words that come out of Steve's mouth when Robin fully enters the store. She gives him a look. \"Well good afternoon to you too, Harrington.\" She says, laughing. She halts at the counter when she looks at Steve.\n\"Steve… are you alright?\" She asks, concern lacing her voice. He must look worse than he thought. There is a long pause as she makes her way behind the desk to sit in the chair next to him. She’s frowning and giving him a look that she usually reserves for serious moments. He takes a stuttering deep breath, \"I don't know - I think I'm having, like, a crisis or something.\" He can hear his heart drumming with dread, and avoids his friend's gaze.\nRobin puts a kind palm over his hand which is still shaking a bit. Steve feels like he's able to breathe a tad better at the contact. \"Steve,\" She tries again, \"we've been through Hell and back. Twice. You can trust me, okay?\" She says.\nSteve knows that if he tells Robin this she won't hate him. She's probably the only person in all of Hawkins, Indiana that he knows for a fact won't judge him for this. For whatever he was feeling. Is feeling. But if he says it out loud, then it's real. Shit, she probably felt the same way he does right now when she was telling him that she liked girls for the first time - except maybe a little more high. But when he thinks about opening his mouth to speak, he doesn't know what to say.\nSo, he starts with the facts - maybe the hardest one to admit.\n\"I think I maybe want to, like, kiss Eddie.\" He says. It's frantic, like ripping off a band-aid, and he hates the way his voice sounds so raw. He can't look at her.\nRobin's hand tenses on his own for only a second \"Okay…\" She says, \"that is not what I was expecting, but okay.\" She says in a soothing tone that doesn't quite hide her shock.\n\"I'm not gay.\" Is the second thing he says.\nRobin shifts so she's leaning against the counter facing him. Her hand stays covering his and she thumbs over his knuckles. \"You know…\" She pauses, \"it's okay if you were, Steve. It wouldn't change anything. You're still you, as annoying as that may be.\"\nSteve scoffs a little bit, squeezing her hand back. \"It's not… It's not like that though.\" He chances a glance up at Robin who is looking at him with wide gentle eyes. \"I just- I like girls. And I also think I maybe kinda like him too.\" He knows he sounds like a moron saying this out loud, not having the right words to convey what he's feeling. \"Alright.\" Robin says, like that's the end of the matter. Steve furrows his brow and looks at her, \"Alright?\" He repeats, dubious.\nRobin moves to make eye contact. \"What about you having a,” she pauses, flailing her arms a bit, trying to find her words, “thing for Eddie means you can't also have a thing for girls?\" Robin asks him. Steve feels like he's gotten hit with a ton of bricks. \"I don't think you can, like, like both?\" He says. It's more of a question, and it sounds unconvincing to even himself.\n\"But you do, Steve.\" Robin says gently, \"you can't not be attracted to girls and guys if you are.\" She finishes as if it's that simple. And when she puts it like that, maybe it is.\n\"Shit.\" Steve says, voice somehow heavy with both anxiety and relief. Robin chuckles, \"Yeah.\" She agrees. Robin jostles his arm with her elbow, \"Eddie Munson though? Really?\" She asks in a teasing tone.\nSteve laughs a real laugh at this, \"I know,\" he groans, \"but I don't wanna hear it from Ms. head-over-heels for Tammy Thompson.\" Robin smacks his knee gently and points a finger at him, \"That was a year ago!\" She justifies. Steve joins in the laughter. His shoulders feel a little lighter.\n---\nIt’s just before two-thirty when Steve is checking out a copy of Better Off Dead for someone when he comes to terms with something.\nJohn Cusack is kind of… hot?\nThe realization makes him stutter his way through the rest of the transaction. Bumbling about the return policy and due date.\nWeirdly, it solidifies something inside him. That it’s not just Eddie. He spends the rest of his time before his and Robin’s break scanning the shelves to see if there are any other actors that he finds attractive. The list is small, only a couple, but it's not non-existent. He decides he just never knew to look before.\n---\nHe has a bite of his salami and cheese sandwich between his cheeks when Robin enters the back room.\nShe has a conspiratorial look on her face, \"So, do you think Eddie likes you too?\" Robin asks. Steve nearly chokes. He reaches for his water bottle and swallows a large amount of liquid, his face flushing in the meantime. \nAnd, yeah, Steve knows Eddie is queer, but that's about it. \"Jesus, Robin.\" He says, clearing his throat.\n\"What?\" Robin says dramatically, \"you don't have a problem talking about this stuff when it's some random chick you're trying to pick up.\" She states matter-of-factly. \nSteve pauses for a minute, “I mean, I don’t think he hates me or anything.” he mutters. Robin rolls her eyes, opening her metal lunchbox and pulling out a bag of grapes. She pops one in her mouth and chews. “Okay, but has anything happened between you two? Something that made you realize you like him?” She asks.\nSteve feels his face turn crimson. “I think he sort of, like, flirts with me? But I also think that might just be his personality.” Robin hums, “Welcome to my life.”\nHe eats a bit more of his sandwich deciding how much he could tell Robin without betraying Eddie’s trust. “He fell asleep next to me last night.” he starts.\n“Like at Chief Hopper’s place?” she asks. Steve rubs his palms over his eyes at the memory, embarrassed, “Yeah, but he kind of just fell asleep on my shoulder this time. And then when I woke up he was taking a shower and when he came out he was smelling like my cologne and dressed in my clothes and I quite literally had to leave the room because it was so overwhelming.” He complains. Robin only laughs. He shoots her an offended look.\n“I’m sorry, I’m sorry, it’s just-” she chuckles again, “it’s just so refreshing to see you being the one having a crush for once.” Steve sighs.\n“What am I supposed to do though? I’m gonna go home and he’s just going to be there and-” Robin cuts him off, “He’s going to be there? At your house?’ her face is confused. “Yeah, I told him he could stay if he wanted, and he said sure.”\nRobin looks at him like he is an idiot. “I think you should tell him how you feel, Steve. With all the near-death experiences we’ve had the past few years, I’d say you deserve to be with someone who makes you happy.” She says. Steve’s heart thuds in his chest at the mere thought.\n“You should ask out Vickie too, then,” he says. He realizes it’s not exactly fair because he knows for a fact that Eddie likes men, but he’s almost certain Vickie likes Robin. He just wants her to be happy too, she’s one of the best people he has ever met.\n“Y’know? Maybe I will.”\n---\nThe ride home is agony.\nHe drops Robin off at her house which is a few roads down from his own. She wishes him luck which he shakes off. Steve makes it back to his house no more than ten minutes later. He has been sitting in the driveway for five minutes or so, and contemplates driving down the road and back just to kill more time. \nInstead, Steve slides out of his vest and throws it in the back seat. He taps his fingers on the steering wheel a few times before taking a deep breath and hopping out of the car.\nHe takes extra long opening the door, wanting to make his presence known without startling Eddie too much. Steve toes his shoes off in the main entry and hears some shuffling in the living room. He goes to investigate the sound. \nEddie is sitting on the couch reading his copy - well, technically Dustin’s copy - of Lord of the Rings. His feet are tapping against the coffee table. All the blankets and pillows that were used the night before are nicely folded and sitting on a recliner. \nSteve clears his throat and Eddie jumps.\n“Christ, Harrington!” He says, startled. Steve smiles, his earlier attempts to warn Eddie were clearly to no avail. “Warn a guy next time.” Eddie says, still recovering. Steve laughs, “It’s my house.” he says, moving a step or two further into the room.\n“You’re ten minutes late,” Eddie notes, pointing at the clock and trying to sound casual, “almost sent out a search party for you.” Eddie sets the book down and stands up, revealing his legs from beneath a knitted blanket. Steve drags his eyes up and down Eddie’s body. He notices that Eddie clocks this, and sees him shift back and forth on his feet.\nHe takes a small step towards the other man, “If I didn’t know any better, I’d say you sounded worried about me, Munson.” He says, sounding braver than he feels.\n“Well, yeah,” Eddie says. Steve takes another step forward, their feet now almost touching. “Steve…” he breathes, “What are you doing,” Eddie asks softly. His eyes are wide and blink back at Steve.\nThere’s a strand of Eddie’s hair that has gone awry. Steve reaches up to put it back in place. They’re close, and Steve relishes in the fact that a pink flush forms over the apples of Eddie’s cheeks. “You’re driving me crazy, man.” Steve murmurs. Steve leaves his hand resting on the side of his face.\n“I…” Eddie says breathily, he is uncharacteristically unsure of what to say. Steve doesn’t know if he has heard another man sound like this before. He finds that it sends sparks down his spine.\nSlowly, with more than enough time for the other man to pull away, Steve begins to lean his head forward. His eyes flicker down to Eddie’s lips, then back up again, as if asking permission. He knows he has it when Eddie replicates his movements. Their noses touch for a moment. Steve rests his left hand on Eddie’s neck, and then closes the distance between them.\nThe kiss is chaste. Steve squeezes his eyes shut and bathes in the way that Eddie’s lips feel on his. They slot together perfectly, and Steve feels like he might cry when Eddie suddenly pulls away.\nHe takes a deep breath before opening his eyes.\nEddie is staring back at him like he's not sure what just happened.\n“Shit,” Steve says, full of regret. He feels shame grow in the pit of his stomach and almost backs away, but Eddie runs a tentative hand from Steve’s chest to his shoulder and it stops him in his tracks.\n“That was…” Eddie drifts off sounding mystified. His hand falls back to his side.\n“You’re…?” Eddie asks, his eyes somehow gesturing between the two of them. \nSteve knows what he’s asking.\nHe nods his head.\nSuddenly, Eddie grips the sides of Steve’s face, his hands fanned out, bracketing him. Steve feels the cold press of his rings into his flesh and it gives him a shiver. He’s kissing deeply, and hard. Steve almost stumbles backwards, but he balls his fists into the sides of Eddie’s crewneck and manages to keep his balance. He closes his eyes belatedly and kisses back. \nSteve is leading Eddie over towards the couch. They’re a mess of limbs, and Steve feels Eddie switch their positions before Steve is unceremoniously pushed down onto a cushion. Eddie stares down at him, his eyes flickering to different points on his body. Steve’s fully clothed, but he has never felt more exposed. He runs his hand through his messed up hair. \n“Jesus, you’re really a sight for sore eyes, huh, Harrington?\" Eddie says, his voice scratchy. Eddie lowers himself onto Steve’s lap, straddling his legs. His right hand is still on Steve’s face, his left on his chest. Steve moves his hands to Eddie’s waist. “You’re not so bad yourself, Eds.” Steve says, looking up at him. Eddie lowers his face down to Steve’s own, their noses brushing, “Eds?” he teases. Steve rolls his eyes and kisses him again.\nKissing Eddie feels natural, but, at the same time, like nothing he has ever done before. Eddie is firm with his actions, biting Steve’s lip and gripping his biceps tightly. Steve is decidedly into it, but he’s not really sure what to do with a guy. What he’s doing right now isn’t that different from what he normally does, so he slides his hands down Eddie’s back down to his ass, squeezing.\n“Fuck,” Eddie mutters against his lips. It’s the first time Steve has heard him say that, and it makes his stomach flip-flop with arousal. “Good?” Steve asks. Eddie nods “Good.” he affirms, grinding his hips down against Steve.\nPleasure immediately strikes him, and all he cares about is touching as much of Eddie as he can. He breaks apart from the kiss. \"Can I take this off?\" Steve asks, tugging on his own top that Eddie is wearing. \"I'll show you mine if you show me yours,\" Eddie jokes, moving his hands to the hem of Steve's turtleneck.\nSteve lifts his arms and the garment only gets stuck on his head for a minute before Eddie throws it on the ground behind him. Steve is a bit gentler, and he pulls Eddie’s off slowly. Steve looks at Eddie’s torso bare for the first time. Tattoos are scattered here and there and there’s a trail of hair leading below the drawstrings of his shorts. Steve swallows, “God, you’re-” he stops in his tracks when he feels Eddie’s fingers on his neck, sliding over the scar there like he did just the night before. He follows Eddie’s hand with his eyes, moving from his neck, through the hair on his chest, and down to the puffy marks on his stomach.\nSteve wonders if this is what it is supposed to be like.\nWhen you’re with someone you feel for so much that just a touch from them can set you ablaze.\nFor Steve, there is a push and pull inside of him thinking that he should be self-conscious, but he finds that right now he is more confident than ever. He wants this. When Eddie kisses him and he feels something of the other man sink deep into his bones. A bite of teeth on his lower lip. A scrape of fingers on his scalp. A gentle kiss to his clavicle.\nMaybe he’ll never be the same after this.\nA high pitched ring breaks him from his thoughts and makes him jump.\nEddie, still on his lap, groans in annoyance. “Shit.” He says, sighing and ripping himself off of Steve. Steve notices the bulge in the front of his shorts and tries to hide the grin on his face because he did that.\n“I put a goddamn frozen pizza in the oven for when you got home.” Eddie almost wines, padding over to the kitchen in nothing but his bottoms. Steve’s just sitting there a little hard in his jeans for a moment. Quickly, he grabs his shirt and puts it back on.\nWhen he gets to the kitchen Eddie is pulling the pizza from the oven and setting it on the stovetop to cool. Steve walks up to him and wants to bring him close, before remembering that he can now. He slides his arms around Eddie’s waist and tucks his chin on Eddie's bare shoulder.\n\"Hey,\" he says softly. Eddie’s back presses into his chest, “Hi.” Eddie says, leaning his head against Steve’s own. They stand together swaying back and forth for a moment before Steve’s stomach rumbles.\nEddie laughs, “Oh my god, I felt that.” he breaks from Steve’s grasp and moves to the cabinets looking for dining wear. Steve finds the pizza cutter and slices it into eight pieces. They each take a few and put them on their plates\nThey’re back on the couch now. Steve’s legs are stretched out and resting on the coffee table in front of them. Eddie is sitting criss-cross applesauce, leaning against the armrest instead of the back of the couch. He finally put his crewneck back on. Steve can feel him boring holes into his head. He finishes his first slice before looking over at him.\n“So, are we going to, like, talk about it?” Eddie asks carefully. Steve tilts his head. “About the, uh, kissing thing?” Eddie clarifies, picking at the pepperoni on his plate.\nSteve frowns, “Was it… not good?” Steve asks, confused. Eddie lets out a baffled laugh, “No, it was, uhm, definitely good. It’s just,” Eddie pauses, “Like, was that a one time thing, or?” he asks. Steve sets down his plate of food, “I sure hope it wasn’t a one time thing,” he says, turning towards the man next to him.\n“Right, it’s just, y’know I’ve been with some other guys before and they usually just pretend they don’t know who I am the next day.” Eddie explains. Steve finds himself growing angry after hearing this, “Well that’s pretty awful of them.” he says. Eddie nods, “So, if you weren’t as into that as I was you should probably tell me now and I can, like, go, or whatever.”\nSteve gives him a look, “If that dumb timer never went off and we hadn’t stopped I probably would have come in my pants, Eddie,” Steve says simply, “I was definitely just as into it as you were.” Eddie freezes and blinks at him, “R-right.” he says, clearing his throat. “And I for sure don’t want to forget you even exist,” Steve says in a tone that is almost scolding. He doesn’t add that he’s not sure he even could if he wanted to. “Probably the opposite actually.” He finishes.\nEddie looks at his face and scans it to see if he’s lying. Steve reaches out and presses his palm over his bony knee. “I’m kinda into you, man.” Steve says, “If that wasn’t obvious.” He’s nervous saying it out loud.\nEddie leans his head to the left, letting the side of it rest against the couch. He’s staring at Steve in a way nobody really has before, “I can’t believe Steve the Hair Harrington likes guys.” He says dumbly. Steve rolls his eyes, “Ugh, don’t make me change my mind,” he says sarcastically, he looks over at Eddie, “Girls too though, I like, uhm, both.” He says.\n“Cool,” Eddie says, placing his own hand tentatively over Steve’s, “I might have a thing for you too, by the way.” Eddie adds. Steve grins at this, “Yeah?” he asks. “Mhm,” Eddie confirms, “I don’t know if you’ve been made aware of this, but you’re kind of the hottest guy in town.” he stage whispers. Steve honest to God blushes at this. “Gosh, you’re a loser.” he says. “Yeah, but a loser who bagged Steve Harrington.” Eddie amends, pointing at him. He picks up his pizza and takes another bite, Steve watches him struggle to chew with his mouth closed because of how big his smile is.\n“I, uhm,” Steve starts, not having formulated his thoughts fully, “I only want to be seeing you? If that’s okay. And, you me? If we’re going to keep doing this?” he doesn't even know if what he said makes any sense. He can tell his voice is up an octave.\n“Are you asking me to go steady, Harrington?” Eddie asks, only half teasing.\n“Yeah,” Steve says. “I’ve had some not-so-great experiences in the past. So, if that’s okay with you, I’d like that…” he drifts off.\nThe other man stretches his legs out so they’re resting in his lap, “Yeah, I think I could get used to this.” Eddie says, like he can’t believe his luck.\n---\nAll that’s left on their plates are crumbs and some too burnt pieces of crust. Eddie has been reading aloud from where Steve left off in his book for a while now. Steve’s head is on his lap and he watches in amusement when Eddie does the characters in different voices.\nIt has been a few hours now and they get to a slower point in the book. Steve finds his mind wandering a bit and he starts humming a little tune to himself. He can’t bring himself to ask Eddie to stop for the night.\nAs if sensing this, Eddie lowers the book, holding the page with his thumb. “Tears for Fears again?” Eddie asks in an amused tone. Steve didn’t even realize what song it was until Eddie pointed it out. “It wouldn’t be on the radio so much if it wasn’t a good song.” He defends, laughing all the same.\nEddie opens his mouth mimicking the voices of the band in an exaggerated way. He sings obnoxiously to the tune that Steve was previously humming. He begs Eddie to stop and he does. They’re both laughing now.\nEddie places the bookmark between the pages and leans over Steve, giving him a gentle kiss on his forehead, “There’s nothing wrong with being cute, Stevie.” Steve groans and turns his face to hide it in the fabric of Eddie’s shirt, flipping him the bird. \nAnd yeah, it wasn't supposed to go like this.\nSteve was supposed to work with Robin at the Family Video, flirt with the many many girls who came to browse the expansive selection of VHSes, go on some dates, and hopefully find The One.\nIt was supposed to be a notably upside-down free year.\nAnd, hey, for what it's worth? Maybe - despite everything - he did find The One after all.\nIt's been a week since Eddie and Steve got together. Actually, make that almost two. Time flies when you're in love. And Steve definitely is.\nHe's been trying to keep how he feels as close to his chest as possible, but, more often than not, he can't help but think he's wearing it on his sleeve. \nIt comes spilling out when he sees Eddie's toothy grins, when he does outlandish hand gestures, or when Eddie’s voice pitches up when he's excited about something.\nSteve has been happy. Truly happy. And God, it feels good.\nWhen the pair are in public they get a lot of stares. Mostly it's because people wonder why Steve Harrington is hanging out with an alleged serial killer, and vice versa. But sometimes Steve is afraid people will know. About them.\nThem.\nIt feels good enough that Steve doesn't really care about the sideways looks.\nOf course, they're not out to anyone except for Robin, who is now seeing the ever wonderful Vickie. They keep the PDA to wanton glances, lingering touches, and sitting a bit too close to one another, but they don't care in the slightest.\nHe talked with Eddie about this, and they both agreed that if they were to ever even think of showing even an ounce of affection in public it would not be in a town like Hawkins. And it's bittersweet, because Steve wishes that they could. He deserves this, and so does Eddie. But it also rings as a promise of a future together, and, for now, that's all he needs.\nSteve is currently driving a car load of kids to the Byers' new place. Well, their old place. He's got Lucas, Dustin, and Mike packed in and bickering about some random sci-fi flick he's never heard of - despite literally working in a video store. It's chaotic, but the mundane kind of chaotic that he has missed.\nEddie’s meeting them there with Max. They've been getting along pretty well since shit hit the fan. Max has even started to play the guitar thanks to Eddie’s impromptu lessons that he has been giving her. The rest of the party is already there.\nHopper and Joyce finally got their heads out of their asses and are on a date. Jonathan is helping Nancy with a project that will hopefully get her at least a partial scholarship to her dream school, and she's helping him with more applications to colleges in New York City.\nSo, Eddie and Steve are chaperoning tonight. And now that the gang's back together again, Steve can't even find it in himself to mind. What he does mind though, are the teens screaming in his car over the music. The conversation has shifted to the future events of this evening. He turns the radio off.\n\"Could you three just be quiet for two seconds?\" He yells, exasperated. Dustin audibly sighs and turns to face Steve, after previously being half in the back seat arguing adamantly with Lucas and Mike.\n\"We're trying to decide what type of campaign Eddie is running this time - it's the first one with everyone playing. Even El and Max.\" Dustin explains. Steve pretends like he doesn't care, \"Well, you'll all find out in a few minutes. Christ.\" He exhales.\n\"Well, you didn't have to drive us. We have bikes you know,\" Mike chimes in. Steve pointedly rolls his eyes in the rearview mirror, making eye contact with the kid, \"And have someone go missing? Nah. I'd rather not have another heart attack before I'm twenty-five. Thanks.\" He says. Looking back at the road, Steve takes the last turn.\nLucas scoffs, \"We can handle ourselves, Steve.\" It's blunt, but he can tell it's just his way of saying you don't always have to worry about us. Steve nods, \"And I don't doubt that, but how about we just accept the fact that old man Steve here is gonna be driving you little gremlins around until one of y'all get your license.\" \nThat seems to shut them up.\n---\nThe lights are on in the Byers household and before even stepping inside, Steve can hear at least two different conversations happening at once. Eddie's car is in the driveway, so that means they're the last to arrive. This doesn't go unnoticed by Dustin, who makes a smart remark about Steve being a slow driver.\nOnce inside, the trio make a beeline to the living room. Steve follows in a few steps behind after toeing off his shoes.\nNow through the threshold, he sees a familiar mop of dark hair at one end of an unnecessarily long coffee table. El, Max, Will, and the rest funnel in around the surface, sitting on old pillows. Eddie looks up and his gaze lands on Steve. He smiles lopsidedly at him.\n\"Well look who decided to show up.\" Eddie greets, making space for everyone around the table. Steve rolls his eyes, \"Shaddap.\" He says, moving to the couch to sit and observe the game. No way in hell are they roping him into this. He brought a copy of The Hobbit with him that he could pretend to be reading just in case.\nSteve can't help the smile on his face. It's good to see the kids actually get to be kids once in a while.\nThere's junk food and sugary drinks littered on the floor around them, excited small talk, and everyone is safe.\nSteve leans back on the couch and watches the scene below. Max and El are introducing their characters with guidance from Eddie as the DM. El explains her characters' appearance and abilities to the group, they all nod along. Max does the same, but a bit more confident. Then, Eddie begins to set the scene.\n\"Our large group of explorers reach the opening of the cave they have been traveling so far to find,\" Eddie says, using his hands to gesture the true size of the landscape, \"the entrance is vast, and from inside comes a faint sound of water. Not drips, but almost a current of sorts.”\nSteve watches as teens stare at Eddie with wide eyes. “Whoosh, Whoosh,” Eddie imitates, “And from the inside you can see a far off yellow glow,” He pauses, “A small Aquatic Elf girl with long green hair and webbed hands appears at the entry of the cave. She is soaking wet and has a scared look in her eyes. “Help! Come help me, please! The city is under attack!” she pleads.” He clears his throat after using his head voice, “What would you like to do?” he prompts.\nThe kids whisper to one another frantically. “I’ll roll for insight,” Will says. The boy grabs one of his dice and shakes it in his hands before dropping it on the table, “twelve, plus seven - nineteen.” he announces.\nEddie nods, “Will, ever the Wise,” he jokes. It gets a smile out of the boy and Steve finds one growing on his own face at that. “You live up to your name,” Eddie continues, “You notice her shaking a bit. There is a small gash on her leg. Her eyes are moving rapidly between all of you. You believe that she is telling the truth. Her home - wherever this may be - is in serious danger. And she is asking for your help.” Eddie explains. More whispers erupt.\n“Well, we’ve got to go help her,” El says matter-of-factly. \nNobody can seem to argue with that.\n“Is that your decision?” Eddie asks, a grin on his face.\nEveryone nods, “Yes,” Dustin announces.\n“Good,” Eddie cracks his knuckles, “Now the real fun begins.”\n---\nSteve started zoning out at some point.\nHe has read only four or five pages of his book, much preferring the entertainment in front of him for the time being. Steve’s got no clue what’s going on, but it’s nice. He had always picked on them all for their nerdy antics, but maybe he sees the appeal of it. If anything it seems to lead to good strategy techniques, and he could probably stand to gain some of those.\nHe notices the clock on the table reads quarter to seven and stretches his legs, almost kicking Mike in the head with his foot. “Alright, sorry to interrupt,” he begins, most of the kids look over at him in annoyance and Eddie fondly. “But, do y’all want an actual dinner or something?” he asks rhetorically. The kids seem to change the mood directed at him and he receives a chorus of yesses.\n“Alright, Will, come help me find something to make in the kitchen for two seconds, I promise you’ll be right back.” Will nods and follows him to the other room.\n“I think we have some Kraft cheese and macaroni somewhere.” he says sheepishly. Will pulls out three boxes and sets them on the counter. “That’s more than fine,” Steve says, “Tell your mom I’ll bring replacements next time I’m over.” He insists.\nWill nods, “There’s pots under the sink.” he points to a cabinet. “Okay. Thanks, Byers.” Steve dismisses genuinely. The kid nods again and heads back to the living room.\nMaking the food takes less than fifteen minutes. He dishes out even proportions into eight mismatched bowls, then sticks a fork into each one. He carries four out first, not being able to hold more into his hands.\nHeads barely turn to acknowledge him when he comes back into the room, all too enthralled with whatever part of their quest they are on. He starts with the left side, bending down to give a bowl to El, Max, Lucas and Will. They all give him rushed appreciative remarks before he goes back to the kitchen to repeat the process with the next four bowls.\nHe starts with Dustin, then Mike. He moves to the head of the table and bends down to set Eddie’s portion in front of him, being mindful not to place it on any of his things.\nOut of nowhere Steve feels a gentle press of lips against his cheek, “Thanks, babe.” Eddie says.\nSteve freezes, his hand firmly gripping his own bowl so hard he thinks it might break.\nHe turns to look at Eddie who seems to realize what he just did, if his eyes being the size of saucers are any indication.\nThey both blink at one another a few times before they accept their fate and slowly turn towards the kids in front of them.\nDustin is frozen, his forkful of mac and cheese halfway to his mouth. Lucas is looking at them with raised brows and a smirk, but says nothing. El seems unphased. Mike looks confused. Max seems almost knowing. He'd have to ask Eddie about that later. Will is looking at them in a way he can't decipher.\nHe straightens from his hunched position. His face is as red as a tomato. \n“Right,” he says, and tries to escape the situation by moving away, but it's to no avail. \n“What was that?” Dustin asks. He’s got this look on his face, something like giddy incredulity. He puts his fork back down into the bowl.\n“I dunno what you’re talking about,” Steve brushes off. He sits back down on the couch and tries to bite back any expression that would give him away.\n“I think he’s talking about the fact that Eddie just kissed you,” Lucas adds. Steve coughs, caught off guard.\n“Yeah,” Dustin confirms, “that,” he agrees.\nSteve chances a glance at Eddie, who is twisting one of the rings on his finger. It’s a nervous twitch he has - Steve’s picked up on it. And as much as he wishes he could just pretend nothing happened, everyone just saw.\n“You got a problem with that?” Max cuts in. Steve moves his head to look at her. She’s leveling Dustin and Lucas with a severe expression. He feels a sense of pride flood his chest.\n“No-”\n“Of course, not-”\n“Alright,” Steve cutts in, “thanks, Max, but I’ve got this.” he sighs. \nThey had talked about this. About telling The Party about them. It wasn’t really something that they thought they would do any time soon, but they knew that it was hard to keep secrets from a gaggle of nosy teens. They had agreed not to lie if they asked.\n“Eddie and I…” Steve starts. He looks at Eddie who is giving him a reassuring smile. “We’re, like, y’know,” Steve gestures erratically, “together, or, whatever.” he mumbles, before taking a nibble of his food. He’s cool. He’s totally chill about this.\nDustin looks from Steve to Eddie, “Are you serious?” he asks the latter.\nEddie’s stifling a smile, “I know,” he says, “I’m really dating down.”\nSteve rolls his eyes, “Oh, screw off,” he says.\n“Are you happy?” El asks. She’s quiet, less so than a few years ago, but it still takes Steve off guard. He looks at the young girl and tilts his head. “Happier than I’ve been in a long time, I think.” Steve says. “Good.” she says, giving him a small smile. He reciprocates it.\nShe turns to Eddie, “You?” she asks. “Me too.” he agrees.\nIt's quiet for a second.\n“You can’t go yapping about it to people though.” Steve reminds them.\nEl frowns, “Why?” she asks. Steve feels a lump form in his throat.\n“Because this is Hawkins, and we all know what happens to people who are different.” Eddie explains.\nA look of understanding passes over her face. She nods.\n“You can trust us though,” Max says, “we won’t tell anyone, right guys?” she asks.\nEveryone agrees.\nIt's silent for a beat.\n“So,” Eddie regains their attention, “Back to the main event.” he says. In a flourish of exaggerated movements, he sets down a figure of a creature onto the gridded mat in front of him. It earns a chorus of groans from the players.\nSteve returns to his comfortable perch and eats his dinner feeling a little bit lighter.\n---\n“Okay everyone, time to pack up,” Steve announces. He has just come back from the kitchen after doing the dishes. It’s almost ten and all the kids have to be back home in half an hour. Joyce and Hopper were set to be back any minute.\n\"Oh c'mon, we only need like two more hours!\" Will exclaims.\n\"He's right guys,\" Eddie agrees, \"we're at a good spot to pick back up with next weekend.\"\n\"Okay, mom and dad,\" Mike says, his voice laced in sarcasm.\nSteve gawks at this. \"Get in the car or you're walking home.\" He says.\nMike sighs and begins packing up his things, the rest follow.\nLater when it's just Dustin and Steve in the car he brings this up.\n\"Mom and dad,\" Steve scoffs, \"who does he even think he is?\" \n\"Well, you two are very… Parental.\" Dustin unhelpfully notes, \"and I think we all know who mom is.\" He adds. Steve's mouth falls open in shock.\n\"Alright, asshole,\" he pulls into Dustin's driveway, \"out!\" He yells. Dustin lets out a mischievous laugh, but compiles.\nHis house is a few minutes away from the Henderson's, but when he approaches he notices that Eddie’s van is parked outside on the pavement. Steve's brows pinch in confusion. They hadn't made any plans to meet up afterward.\nSteve locks his car and makes his way to the front steps of his house, where he can see Eddie sitting on the cement slab. He stands up when he sees Steve approaching.\n\"Sorry, I hope this is okay.\" Eddie says. He sounds nervous. \"Of course, it's not like anyone else is ever home.\" Steve reassures him. Eddie shuffles awkwardly.\nPulling out his house key, Steve unlocks the front door. The pair step inside and slip out of their sneakers.\n\"I'm sorry about earlier,\" Eddie says. Ah. Steve realizes. \"Hey,\" he brushes Eddie’s hair out of his face and smiles at him, \"don't worry about-\" \"It was reckless.\" Eddie cuts him off. He's more serious that Steve has seen him in a while.\n\"But everything's okay.\" Steve reminds him. He puts his hands on the sides of Eddie’s face to get a good look at him. \"It was bound to happen at some point, and we managed to control the situation.\" His eyes scan the man in front of him. \"It's okay. I promise.\"\nEddie wines and moves his head back a bit, out of Steve's grasp. \"Still, it was stupid of me.\" Eddie mumbles. Steve smiles, \"And I told you, it's fine.\" He leans forward to press a kiss at the corner of Eddie's lips. Eddie seems to snap out of it, and a smile of his own forms.\n\"It's your fault really,\" Eddie claims. Steve raises his brows, \"Oh?\" He asks. \"Mhm,\" Eddie says, kissing Steve on the mouth. He breaks away, \"S'not my fault. You're, like, a seductress or something.\"\nSteve giggles softly and leans into Eddie’s hand that is tangled in his hair. He feels Eddie’s mouth on his neck. \"I don't think we should be doing this in the foyer,\" he notes. Eddie sighs through his nose and pulls back with a wet pop. Grabbing Eddie’s arm, Steve drags him up the stairs to his bedroom.\n\"A bit forward, Harrington.\" Eddie says as he is shoved down onto Steve's mattress.\n\"Oh shut up, you know you like it.\" Steve counters. He kneels on the bed and leans over Eddie, slowly lowering his head to catch his mouth with his own. Eddie is kissing back, immediately biting on his lower lip asking for entrance.\nSteve can't help but think that this will never get old. \nEddie's hands slide up under his shirt and grip his sides. He pulls Steve’s hips down against his own, and rolls up against him. \"Fucking hell,\" Steve gasps, his neck arching. Eddie takes the opportunity to flip their positions, now straddling Steve’s hips from above.\n“Okay princess, what do you want,” Eddie asks, running his fingers through Steve's disheveled hair. Steve rolls his eyes at the pet name, but flushes nonetheless. He raises his brows and gestures between the fronts of their pants with a nod of his head, “I think it’s pretty obvious, Eds.” he says.\nIt’s Eddie's turn to flounder. His hair is falling in his face. “Like,” he hesitates, “all the way?” he asks with a hopeful look in his eyes.\nSteve laughs at his wording, \"Yeah,\" he raises a finger to trace the curve of Eddie’s nose, \"all the way, you dork.\" Eddie grins and Steve can feel it when he leans down and kisses him.\nSteve thinks that Eddie always kisses him with a bit too much teeth. Don't get him wrong, Eddie is good at kissing - great even. But, there's a layer of neediness to it. Steve thinks that it is probably his way of communicating just how badly he wants to be doing this - when they're intimate like this with one another. Eddie is always tentative, but rough, in a way that Steve deeply appreciates. His touches are always reassuring to him somehow. \nLike right now when Eddie gently pulls at Steve's belt before the man below him nods. It's promptly ripped off of him and thrown hard across the room. Steve glances over to where it thuds against the wall, only to have his attention regained by Eddie as he pecks his forehead.\nEddie's long nimble fingers work to unbutton his grey chinos as he sucks on Steve's neck, undoubtedly leaving a mark. His zipper is undone and he raises his hips for Eddie to pull them past his butt and down his thighs, but they get stuck on his ankles. In a last-ditch effort, Eddie balances on his heels and tugs so hard that when they come free he almost falls off the foot of the bed.\nA giggle escapes Steve and he pulls the other man forward by the front of his shirt. He leans back on his right arm and uses his left to caress Eddie’s cheek and pull him in for another deep kiss. \n\"Too many clothes,\" Steve mutters when he breaks for air. He pulls Eddie’s shirt off with no resistance and relishes in the way his necklaces dangle freely between them.\nEddie makes quick work of his own pants and shucks them off his legs. All he's wearing now are boxers and his jewelry, an oddly similar image to the night they got together.\n\"We should probably talk about how we're going to be doing this.\" Eddie says. It's more of a question really.\nSteve has thought about this. About having sex with Eddie. Probably more than he'd like to admit. They had gotten each other off, sure, but this was the first time they were going to go further than that. He's not scared, but he is a little hesitant.\nEddie has been with other men before. He knows what he's doing. And Steve hasn't been self-conscious about that a second they've been together. Every reaction he's gotten out of Eddie leaves him no doubt that what Steve feels for him is nothing if not fully reciprocated. All he knows is that he wants this to be good. For both of them.\n\"I don't know if I'm ready to, uh, \" Steve stumbles over his words a bit, \"you know…\" Steve drifts off.\n\"Get fucked by me?\" Eddie fills in bluntly. He's wearing a smirk when he says it. Steve smiles at the familiarity in his tone. \"Yeah,\" he laughs.\nEddie chuckles too. \"You don't need to be shy, Steve,\" Eddie says, \"I'm good either way.\" \n\"You sure?\" He asks.\nEddie knits his eyebrows together, \"I wouldn't lie about something like this,\" he pauses, \"I'm into both. And honestly? It's with you, so I'm probably not going to be lasting long either way.\" He says plainly, as if he has no idea of the effect the words have on him.\n\"Right,\" Steve says, nodding his head, \"Well, I've got condoms and lube in my nightstand,\" he moves to get them, but Eddie presses him back into the mattress. The weight above him is gone only for a moment before Eddie returns.\nHe sets the items down and tugs at Steve's striped polo. \"I think it's only fair that we're on a level playing field,\" Eddie says. It's lighthearted and Steve knows it, but what surprises him is that he didn't even realize he still had his shirt on. He tugs it off and when he looks down he immediately remembers why he had kept it on as long as he did.\nA once unblemished abdomen is covered in big puffy pink scars.\nThe scabs were long gone. He thought that they'd lighten over time. Maybe at least become level with the rest of his stomach. They're not though, and they probably never will be.\nHe looks up to Eddie whose smile has been unwavering.\n\"Very metal,\" he says, gently running his fingers over the marks. \nSomething in Steve's chest aches at this, and his next words fly out of his mouth before he can even process what he's saying.\n\"I love you.\"\nIt's not a question, or an offhand remark, it's a statement. Unwavering.\nEddie smiles so wide Steve thinks it might split his face in two.\n\"I love you too.\"\nThey're kissing again.\n\"We'll take it slow,\" Eddie says, \"you're not going to hurt me.\" He reassures him. \"And, for future reference?\" Eddie leans down to whisper in his ear, \"I wouldn't be so opposed to it if you did.\"\nSteve blinks up at him, \"Oh?\" He asks. \"Oh.\" Eddie confirms.\n---\nAs predicted, neither of them lasted very long.\nOn another night, with another person, Steve might have even been a bit embarrassed. But right now he's bathing in the afterglow. Eddie is laying on his chest. His head rises and falls with Steve's every breath.\nHe runs his hand through Eddie's hair and twirls it around his fingers. \"We should probably get cleaned up.\" Steve suggests. Eddie hums in agreement. Neither of them make a move to get out of bed.\n\"Just five more minutes,\" Eddie murmurs, tucking his head into his neck.\nAnd, Steve thinks that even if he only has five more minutes on this God forsaken world with Eddie Munson, it would be filled with enough love to last him a lifetime."
}