{
    "id": "393688",
    "url": "https://archiveofourown.org/works/393688?view_full_work=true",
    "author": [
        "ras_elased"
    ],
    "title": "(First Impressions Are) A Work in Progress",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "The Avengers (2012)",
        "Iron Man (Movies)",
        "Captain America (2011)"
    ],
    "relationships": [
        "Steve Rogers/Tony Stark"
    ],
    "characters": [
        "Steve Rogers",
        "Tony Stark",
        "Pepper Potts",
        "Bruce Banner",
        "Clint Barton",
        "Nick Fury",
        "Thor (Marvel)",
        "Natasha Romanov"
    ],
    "additional_tags": [],
    "language": "English",
    "series": "",
    "published": "2012-04-28",
    "completed": null,
    "words": "15,195",
    "chapters": "1/1",
    "comments": "345",
    "kudos": "19,580",
    "bookmarks": "4,297",
    "hits": "275,712",
    "summary": "<p>Tony has a point system for the times he can get Steve to be less than perfect.</p>",
    "notes": "<p>At various points, this fic was also titled: \"The Corruption of Captain America by Tony Stark\", \"Tony's Superpower Is Being An Asshole\", \"Tony Stark Just Needs A Hug Dammit\", \"Steve Is Stubborn And Will Make Tony His BFF If It's The Last Thing He Does\", and \"I Accidentally A Cap Character Study via Tonyfeels\". I feel like that collection of titles gives you an idea of the degeneration of this thing, plot-wise, and also a much better summary of this fic than the actual summary. [This fic influenced/inspired by: 1) <a href=\"http://cap-ironman.livejournal.com/720215.html#cutid1\" rel=\"nofollow\">marielikestodraw's art</a> which I swear is like 50% of the reason I'm in this fandom, 2) <a href=\"https://lermellino.tumblr.com/post/10906370850\" rel=\"nofollow\">this</a> set of gifs of Pepper and Tony which I somehow convinced myself was an actual canon scene in Avengers, and thus became the jumping off point for this entire fic, 3) scenes from the Avengers trailers, and 4) <a href=\"https://youtu.be/oCp9RGGliDQ\" rel=\"nofollow\">NCIS sexual harassment training</a>.] Plot wise, this fic ended up going is a whole different direction than I intended, and also ended up being a hell of a lot less angsty than I envisioned. It's just so hard to write angst when I'm having THIS MUCH FUN playing with my shiny new toys. On that note: Hello glorious new fandom! I brought you a present! ♥</p>\n<p>Acknowledgements: Huge thanks to my betas, zephre and pyrrhical who busted their asses getting this beta'd for me on short notice so I could post before it inevitably gets Jossed next week. You guys are amazing! Any remaining mistakes are mine and probably the result of rushing to post.</p>",
    "text": "Tony has a point system for the times he can get Steve to be less than perfect.\nIt started the moment they met. No, wait—before that. It started with Pepper.\nThey were on Tony's private jet—which hadn't left without him this time, thank you very much; he could be on time when it was something important—and Tony was busy waxing nostalgic about Captain America, because the man is the closest thing Tony's ever had to a hero. Besides himself.\nThen Pepper smiled and said, \"Sounds like you've got a crush.\"\nAnd Tony's eyes snapped wide open, because of course he would—he's always had a thing for the sweet-and-stubborn ones, just look at Pepper—and of course he'd be the last to figure it out—again, look at Pepper. \nAnd, of course, he was never able to stop being himself long enough to hold on to the sweet ones. Yeah—back to Pepper.\nAnd then they'd landed and Tony met a newly-defrosted historical icon, and he'd ruined the whole thing by being just that: himself. And Captain America was his perfect, star-spangled self—except even more so, how was that even possible?—and things had gotten worse.\nFive minutes after they've met, and it's a shouting match. And sure, that's about 95% Tony's fault, because that's what he does, he pushes buttons to see what they do, what gears they grind. The whole \"you're a lab experiment at best\" thing was a low blow, but he's Tony Fucking Stark, and he will not be talked down to, not even by America's golden boy, no matter how blue those eyes are.\nTony's got his armor on, but it's not the shiny metal kind. He smirks, just a little, and keeps his eyes on Rogers. \"Listen up, Rip Van Winkle, I'm gonna give you a bit of a pass because you've been a human popsicle for the last seventy years or so, and maybe you missed the memo: I don't play well with others.\"\nSteve's lips curl into a sneer—a goddamn sneer, from Captain America—and he says, \"Big man in a metal suit. Take that away and what are you?\"\nAnd Steve is looking at him with open disgust, like he wouldn't think twice about crushing Tony under his shiny red boot heel. It's a look Tony's been getting most of his life, it's familiar, but from Captain America it's different. It's the complete opposite of the way Steve had looked at Tony about two seconds after he'd walked into the room, like Tony could pluck down the sun and the moon and use them to fix all of Steve's problems. Tony's never been good with expectations, so the contempt hurts somewhere around an order of magnitude less. Tony puts on his most bullshit innocent expression and answers, \"Uh—genius, billionaire, playboy, philanthropist?\"\nThere's a flicker of disappointment in Steve's still-way-too-blue eyes, and yeah, that's even more familiar than the contempt. They're making progress. \"I was wrong,\" Steve says, voice flat and hard. \"You're nothing like Howard Stark.\"\nThere's a beat, a good fifteen seconds when the room goes completely, deafeningly silent. And then Tony just...leaves. He takes the stairs one at a time, no rush. He's not running away. After all, he got what he wanted: Steve has stopped looking at Tony like he's Howard, and Captain America has stopped being the impossibly perfect hero of Tony's childhood. Tony gets back on his jet, ignores Pepper's eyebrow, and awards himself a mental point for being able to find a chink in Captain America's armor. It's the first of many.\nIt only goes downhill from there. \nThe current score is Tony: 14 and Captain America: 273. Approximately. It's sort of an arbitrary point system.\nAnd that's before they start going on actual missions.\nTheir first mission out is complete and utter chaos. \nHulk is acting like a very large, very green, very angry toddler throwing a very destructive tantrum. Captain America is trying to contain the destruction and fire spreading from the ongoing explosions—not Hulk's fault, at least not the ones due to well-placed bombs—while barking orders at everyone through the comm system. Barton is sort of half-assedly following Roger's orders, and Natasha's not even pretending to listen. She'll probably claim later that her earpiece malfunctioned—Tony designed the system, it doesn't malfunction—and she'll get away with it, because she's a sneaky, brown-nosing liar. Not to mention Steve is still falling for her \"sweet innocent dame\" act and hasn't realized she's probably plotted one hundred ways to kill him in his sleep. Tony is listening, but only so he can do the exact opposite of whatever Rogers says.\n\"Iron Man, see if you can clear out the crowd down at the intersection. We've got to get those fire trucks through.\"\nBut an insistent red blip pops up on Tony's HUD, and JARVIS is, as always, stating the obvious and reiterating the warning flashing in front of Tony's face, along with a countdown until the bomb detonates. Then Steve's voice cuts across JARVIS, saying, \"Iron Man, did you hear me?\"\n\"Aye aye, Cap,\" Tony says, and then heads off in the opposite direction. \nTony pinpoints the target at yet another Starbucks—the terrorists are hipsters, apparently—and punches through some brick and plaster of the outer wall to rip the bomb out. He rockets straight up with the thing ticking away in his hands, JARVIS' voice keeping a running tally of Tony's elevation and speed and the time left before the thing explodes in Tony's hands like the world's worst Fourth of July cherry-bomb accident. Tony tells JARVIS to shut up, because the tension in his AI's voice is starting to make his teeth grind. Then Tony hurls the thing up into the stratosphere before it finally explodes.\nWhen Tony gets back, the fire trucks have arrived, and everything seems mostly under control. Rogers storms up to him, sans cowl, and carrying a cardboard box instead of his shield. There are ashes on his uniform and soot smeared artfully across one cheekbone and his forehead. That just makes Tony hate him a little bit more, because the man can't even get messy without it being perfect.\n\"Iron Man! When I give you an order, I expect you to follow it! If we're going to work together, I need to be able to trust you in the field, not—\"\nAnd Tony just threw a bomb into space without so much as a thank you, so he does not feel like dealing with Rogers' same tired lecture for the fifty-somethingth time. He deliberately slouches back against the wall of a smoldering coffeehouse and starts brushing bits of plaster and cement off of his armor. \"And here I thought you were all about good old American democracy, when really you just want us all to heil you as Mein Cap.\"\nRogers just frowns and furrows his brows like he can't quite puzzle Tony out. \"You know that's not what I meant. Back in the war—\"\n\"Yes, tell us some more stories about the war, Grandpa. Because nobody's sick of hearing about that yet,\" Tony says. The furrow deepens and is accompanied by what, on anyone besides Captain America, might be considered a pout. Somehow that just makes Tony angrier, and he snaps, \"It's all you talk about! Trust me, Capsicle, you're the only person who cares.\"\nAnd now it's definitely a pout, and Tony wants to punch himself because he can see the headlines now: \"Iron Man Worse Than Hitler, Becomes First Person In History To Make Captain America Cry.\" And Tony's horrifying mental news ticker is only made worse when he realizes what Rogers is holding in that box.\n\"Are those...puppies?\"\nSteve looks at the box in his hands, then back at Tony, and sounds more than a little defensive when he says, \"Well I couldn't just leave them in there!\" Tony looks over Steve's shoulder to the smoldering-but-intact pet store next to the burnt out shell of an empty Starbucks, and he sees various cages and aquariums all lined up along the sidewalk. He realizes that while he was flying a bomb up to space, Rogers was rescuing a box of puppies from a burning pet store, and then clearing out the rest of the animals. \nNatasha chooses that moment to pop out of fucking nowhere like the freaky ninja that she is and squeal like a little girl, \"Oh, puppies!\" She then proceeds to babytalk at the furballs while Tony looks at her like she's lost her mind. Then he catches her smirk and his look turns into a glare, because she knows exactly what she's doing, the little suck up, trying to earn brownie points while Rogers takes everything out on Tony, as if everyone else wasn't running around without following orders either.\nSteve takes Natasha's reaction as approval and looks far too damn pleased with himself while also trying not to look pleased with himself, so Tony says, \"Just FYI, the moment Fury finds dog crap in SHIELD headquarters, he's calling Cruella De Vil and they're all getting turned into coats.\"\n~*~\nWhen Barton and Thor finally get themselves kicked out of SHIELD headquarters for yet another poptart-related incident—no puppies involved, thank god, though Tony thinks he might be mentally traumatized by the sight of dozens of the world's most hardcore assassins and Coulson going gooey over a box of yipping fluffballs (it had taken five minutes to adopt them all out, tops, Tony's still not sure how that happened)—Fury decides to just foist everyone off on Tony at the mansion in order to build \"team unity,\" as if they're unruly college freshmen and forced dorm living will magically fix all their deeply ingrained issues.\nThe first thing Tony does is reprogram JARVIS' surveillance module to play Star Spangled Man With A Plan every time Steve walks into a room.\nIf he's going to be forced to endure living with his hero-turned-arch-nemesis, he's going to make damn sure it's not only his sanity that's affected.\n~*~\nEveryone is in the kitchen, fighting about strategy, or team dynamics, or what to have for lunch. Must be a day ending in Y.\nRogers and Thor and Barton are having it out at the kitchen table. Banner is using that super-calm voice of his to try and talk everyone down even as the heart monitor strapped to his wrist warns them he's ten seconds from a Hulk-out, while Natasha just sits in the corner like she's waiting for them all to kill each other so she can loot their bodies. Tony has his feet propped up on the table, watching with bemused detachment, because no matter what they decide he's gonna do whatever the fuck he wants.\nSteve lets out a frustrated growl and says, \"There's just too many Chiefs here, and not enough Indians.\"\nTony says, gleefully, \"By the way, that's not very PC nowadays.\"\nSteve grits his teeth and says, \"Do you ever shut the hell up, Stark?\"\nTony widens his eyes, the picture of shocked dismay. \"Wow. Oh my god, did you just curse? JARVIS, did you get that? Is that recorded for posterity?\"\n\"Unfortunately yes, sir.\" \nTony ignores JARVIS' tone and barrels onward. \"Y'know, nice boys don't use that kind of language, Rogers. You kiss your mother with that mouth?\" Steve's fist clenches against the table, so Tony just grins wide and says, \"Oh, wait, even better, do you kiss Fury's ass with that mouth?\"\nThe plate that gets hurled across the kitchen in true Captain America fashion isn't actually meant for Tony's head. He's seen Steve in action enough times to know Steve's aim would never be that off, but he still dodges as the plate takes out the coffee machine to his left, and oh, that is a low blow, Rogers. Still, Tony makes a mental tally mark in the \"Times Steve Rogers Is Not Captain Perfect\" column.\nAlso, Tony is a genius billionaire with the best fucking former PA on the planet, so he has Pepper work her magic and next thing he knows he's the proud owner of a new coffee machine, all polished steel and chrome. He makes sure he's already in the kitchen drinking his first cup when Steve shuffles in, bed hair and pillow creases and bare feet all adorable in a way that forces Tony to add a point in the too-goddamn-perfect column. Tony waits until Steve reaches for the pot before he says, \"I wouldn't do that if I were you.\"\nSteve frowns at the pot, then at Tony. \"Why not?\"\n\"Biometric sensors. Anybody not on the preprogrammed list gets a fifty-thousand volt shock. I disassembled Darcy's taser to set it up.\"\nSteve eyes the coffee pot. \"And who's on the list?\" he asks, but the dreary tone of his voice says he already knows the answer.\n\"Everyone but you,\" Tony says, then lifts his mug. \"Cheers, Cap,\" he calls over his shoulder as he walks away, taking a delicious sip of coffee-flavored victory.\n~*~\nSteve's the one who starts making them clean up the disastrous aftermath of their missions. He calls it a \"team building exercise.\" Fury calls it \"good PR.\" Tony calls it \"a waste of my valuable time and resources, you fucking boyscout. I pay all your salaries, I'm not your janitor, I could hire a janitor for this, I could hire a hundred janitors, I could buy the city's entire sanitation department\". But he still doesn't get out of it, because when he threatens to take his funding and go home, Fury threatens to bump him back down to consultant status, and this is exactly the reason Tony never plays poker, everyone always knows when he's bluffing.\nSo Tony is using his repulsors to nudge cars and some of the larger chunks of building into a pile for Hulk to smash to tiny bits like a giant green trash compactor, and Steve is literally sweeping the streets with a push broom he borrowed from a nearby convenience store. Steve's got nearly all the smaller debris and glass shards in a neat pile by the gutter, when suddenly he drops the broom handle and takes off. Tony tenses, repulsors powered and ready for another attack, but Steve stops across the street, smiles and bends down to talk to some tiny, 117-year-old blue-haired lady. She smiles back as he picks up the bag of groceries she must have dropped, then he offers his elbow, which she takes in her wrinkled hand. \nAnd then Tony has no choice, he's got to just stop and stare, has to take off his helmet to be sure he's actually seeing this for real, because Steve helps the little old lady cross the street.\nWhen they get to the other curb, she shuffles her way to the third building from the corner with Steve in tow. He says something else that makes her laugh, and then she pats his arm and shakes her head. Tony thinks there would be hair-ruffling if she could reach that high. He helps her up the steps until she gets inside the building, where she takes her bag and pats his arm again, and then Steve is walking back, a small, pleased smile on his face. He sees Tony gawking, and the smile vanishes. \"What?\"\n\"Nothing,\" Tony says, but then Steve is still looking at him, so he adds, \"She's a little young for you, don't you think?\"\nSteve frowns and gets a little wrinkle between his eyebrows, the same one he always gets whenever he's confused by the future, or Tony, or both. \"What?\"\n\"Hey, trust me, I'm not judging,\" Tony says, hands up and palms spread as wide as his grin. \"If you want to go robbing the cradle for your dates, that's your deal.\"\nAnd Steve stops, just freezes in place, and there's a look on his face like he's just now realized into what age group he most closely fits. \n\"No, really, I think it's great,\" Tony says, ever helpful. \"Do you need a wingman? Because I know this great retirement home on 57th and Madison. We could stop by for Bingo night, I could talk up your shuffleboard skills. Do you play shuffleboard?\"\nAnd somewhere along the way, Steve snaps out of it, color returning to his cheeks in an angry flush. He bends down and snatches up the broom handle and doesn't look at Tony as he says, \"Shut up, Stark,\" in his command voice, like that's ever worked on Tony even once.\nTony just gives Steve a jaunty little salute and says, \"Sir, yes sir,\" before going back to repulsor duty. He puts his helmet back on and swears he can hear the gnashing of Rogers' teeth over the open comm link. Tony grins and adds another mark to his column.\n~*~\nTony's never been the type of person who needs to like someone to be attracted to them—just the opposite, in fact, he's far more likely to find someone interesting if they offer him insults instead of flattery—so he doesn't make his attraction to Captain Amazing Tush a secret, doesn't think he could if he wanted to, especially once he sees how uncomfortable it makes Steve. Plus he's pretty sure that aspect of his personality doesn't actually have an off switch. Tony flirts like breathing, innuendos and double entendres tumbling out with every third exhale, so if a few of them get tossed Steve's way then it just means Tony gets to add a point every time Steve turns as red as his boots and curls in on himself like he's forgotten he's not the scrawny 90-pound kid in all of those old photos, like he's forgotten he spends 99% of his time strutting around SHIELD headquarters in skin-tight Kevlar like he owns the place. (Really, if you want to run the numbers, Tony owns the place. Or at least, over half of it. Two-thirds, probably. He should ask Pepper for the exact percentage.)\nSo when Steve catches Tony casually contemplating Steve's ass and looks at Tony with that damn wrinkle between his eyebrows, Steve should really know better by now than to ask, \"What are you doing?\"\n\"Nothing,\" Tony says, and cocks his head, squinting at Steve's backside. \"Just thinking, y'know, a well-aimed repulsor blast might knock loose that stick up your ass.\" He holds out his hand and closes one eye, taking aim and calculating the precise angle and trajectory in his head, then says, \"But it would be a shame to damage such finely crafted government property.\"\nTwenty minutes later, Tony is hauled into Fury's office.\n\"Stark! Explain to me why I just had to have the 'birds and bees in the twenty-first century' talk with a national icon.\" \n\"Uh,\" Tony says. \"Because the serum apparently removed his sense of humor to make room for all those muscles?\"\nFury glares at Tony with his good eye, but Tony still doesn't know if he should be looking at it or the patch. \"He was very professional, and never mentioned you by name, or any specifics, but I know this is your fault.\" Fury smiles, and it is a truly terrifying sight. \"So congratulations, you just landed your team's collective asses in government mandated sexual harassment training.\"\nTony frowns. Natasha's going to kill him. Unless Barton gets to him first. They've been trained to withstand torture, and they've both said they'd rather die than sit through another overly-bureaucratic discussion of \"red light\" and \"yellow light\" situations.\n\"Seriously? Don't you think you're overreacting a bit?\" Tony says. \"Just send out another one of those memos you like so much.\"\nThe smile drops right off Fury's face.\nAfter the seminar, Tony tries to duck out the side door before he winds up getting an arrow in his ass or a knife to the testicles, but Steve blocks his escape, and god, he's got that earnest look on his face. Tony might actually prefer the arrows. Barton and Natasha know it, too, because they slide past him with smug little grins on their faces, the bastards.\n\"Tony, I wanted to apologize,\" Steve says. \"I'm sorry if I got you in trouble with Director Fury. It's just, I'm still figuring out a lot of things, and he said if I have questions—But, anyway, the director explained that a lot has changed since my time, that people are more open about it now, but there's still prejudice, and the seminar made it clear that people in positions of authority—What I'm trying to say is that I know we've had our differences, but I would never use this as an excuse to try to get you taken off the team.\"\nIn answer, Tony just blinks at Steve and thinks, not for the first time, How are you even real? And then, because the alternative is to actually talk about whatever the hell kind of gesture Steve has just made, Tony instead cocks his head and looks Steve up and down, considering. \"Is this the part where you proposition me to keep my job on the team? Because I gotta say, I never would've expected that from you, but if you promise to wear the uniform, I accept. Or at least just the boots.\"\nSteve blushes, crosses his arms over his chest and focuses on a point somewhere over Tony's left shoulder. A muscle in Steve's jaw twitches and he says, \"Yellow light, Stark.\" \n\"Well, damn, I was going for red light. But then I've never been too good with other people's rules. Guess I'll just have to try harder. You know me, always striving for goals, yadda yadda yadda.\"\nAnd then Steve's distant gaze focuses on Tony, and Tony's used to the 1940s stoic embarrassment, but this narrow-eyed, thoughtful stare is new. Steve has got a look like he's bracing for battle, and he opens his mouth and takes a breath, but after a moment no words come out and Steve just sort of deflates and looks down at his shoes. It only lasts a second, and then Steve is back to wearing the mildly annoyed glare that has become his norm for dealing with Tony. \"Just—don't let it affect your work,\" he says, then apparently takes Tony's silence for assent because he nods and walks off, leaving Tony standing in the middle of a SHIELD hallway, feeling guilty, even though he's 98% sure he didn't actually do anything to warrant it. Maybe he'll ask Pepper the next time he sees her.\n~*~\nThe Avengers have an uncanny knack for falling off of things—buildings, planes, the Brooklyn Bridge. Usually Hulk manages to keep them from going splat, because he has giant hands and can jump ten city blocks in under a second. Basically, the guy would make a killing in the NBA fielding rebounds. \nBut sometimes, because Tony and Thor are the only ones who actually can fly, they end up having to catch one of their other moron teammates who's forgotten that they can't. Today is one of those days.\nTony sees the flash of blue and red in the corner of his HUD screen, knows even before JARVIS says it that Steve's gone careening off the top of the skyscraper. Tony's already going after him when trajectories start splashing across the HUD, Tony dividing his attention between the laws of physics and Steve's voice calling for help over the radio. It's only a matter of seconds before Tony's within range.\nAnd then, because Tony's a dick, he makes sure to spin at just the right angle to catch Steve bridal style.\nThe hand not clutching the shield goes around Tony's shoulders, but that only lasts for a moment—one glorious moment in which Tony desperately wishes for some paparazzi with telephoto lenses so this moment will be commemorated forever in tabloid history—before the shock of not-falling wears off and Steve goes as red as his boots. \"Stark!\"\n\"Ah-ah,\" Tony says as he careens around another building, trying to find a route back to the fight that is out of the line of fire. \"Code names only, remember? That was your rule.\" And it's a stupid rule, because it's not like the rest of the world doesn't already know who they all are.\n\"Iron Man, I am not your damsel in distress. Put me down.\"\n\"Don't let Natasha hear you say that. I doubt she'd appreciate your sexist 1940s attitude.\"\n\"Too late,\" Natasha's voice says over the comm link.\n\"Put me down right now!\"\nBut Tony is having way too much fun. \"Is this because of the whole 'gay' thing? Alright, bi, whatever, if you're into labels. Because I assure you, this is totally professional. Though if I happen to grope your ass, I promise it's for safety's sake.\"\n\"Put me down, NOW.\"\nTony rolls his eyes behind his mask. \"Aye aye, Capsicle,\" he says, and drops Captain America ten feet into a dumpster. The force of the drop makes the lid crash shut, but Tony can still hear Steve's disgusted shouts and angry clanging of the shield.\nTony gets his laughter under control long enough to say, \"Thor, buddy, I hate to do this to you, but Rogers needs a lift back to the fight.\"\nThor's voice booms in Tony's ear even though Tony specifically gave him a headset with a volume modulator. \"UNDERSTOOD, MAN OF IRON. WHERE IS THE GOOD CAPTAIN?\"\n\"He's in a dumpster on 4th and Main.\" There's a long pause, and then Tony says, \"I'll buy you a case of strawberry poptarts.\"\n\"AGREED.\"\n~*~\nThey're fighting in the conference room—again—because Steve always turns into a very polite drill sergeant during team meetings. Ever since Fury made Steve the Superhero Hall Monitor he's been trying to fit them all into neat little boxes, to force them into cookie-cutter roles, and Tony's sure it's because Steve thinks it'll make everything easier to deal with, because the world may be crazy and may have turned upside down on him, but this he might actually be able to control, so he's going to hold on to it until he strangles the life out of it.\nTony's been there, he gets it. Or maybe he's just projecting. \nThe problem is it's not working, and Tony's getting really, really fucking sick of being twisted into a shape he doesn't fit.\n\"So sue me. I don't follow orders!\" he shouts, for what feels like the millionth time. \"And in case you haven't noticed, neither does anyone else.\"\n\"Like it or not, Stark, people on this team are depending on you. You have their respect, so you need to be an example, if you would just—\" \n\"I may wear a shiny metal suit, but it doesn't make me a perfect little tin soldier. That's your job.\" Tony punctuates his words with a finger jabbed into the middle of Steve's ridiculously muscled chest. Steve looks down at Tony's finger and pales, and Tony knows he shouldn't, but he can't help himself, like a shark that's smelled blood in the water. \"You take away the suit, and I've still got a gooey genius, billionaire, playboy, philanthropist center. I'm not a robot. Not so sure about you, though.\" Another jab, and Steve's face just—it crumples, like the only thing holding that iron-jawed expression in place all this time was bubble gum and string, and Tony just cut some essential thread. Steve lifts his hand to rub at the spot Tony jabbed, then silently leaves. \nBarton says, \"Stark,\" like the moment for reprimand hasn't already come and gone and then given a lengthy farewell tour. And when Barton thinks you've gone too far, that's probably not a good sign. Tony doesn't award himself any points for that one.\n~*~\nTony doesn't feel guilty—he doesn't, because Steve's comment from their first meeting still stings whenever he thinks about it—but Steve's been avoiding him, avoiding everyone really. Except Captain America never runs from a fight so it's not really \"avoiding\" so much as just keeping to himself whenever he happens to come into contact with anyone else, which basically amounts to moping around the mansion like a kicked puppy. It's really annoying.\nThe thing is, nobody gets under Tony's skin like Steve. Tony tries to categorize it, to blame it on lingering childhood hero worship, to build walls around it. But Tony's never been very good at boundaries, even when those boundaries are created by him.\nSo when Steve shows up in the gym while Tony's getting his ass handed to him on a platter by Barton, Tony decides maybe it will make Steve feel better to knock Tony around the ring for a while, get it out of his system.\n\"Hey Capsicle!\" he goads, leaning over the ropes of the boxing ring, right into Steve's space. He takes a drink from his waterbottle and debates squirting a jet of ice water down Steve's back, then settles for shaking sweat out of his hair and onto Steve. \"Save a punching bag or twelve. Get that perfectly formed ass of yours up here.\"\nSteve doesn't pause in wrapping his hands, and he doesn't look over at Tony. \"Yellow light, Stark,\" he says, but there's no heat in it.\n\"C'mon, Cap. We both know you've been dying to take a swing at me. You'll feel better, I'll feel better, the people who buy SHIELD's never-ending supply of punching bags will feel better. The people who make the punching bags probably won't feel better, though, I think you're single-handedly keeping them in business, so if you feel like it's your civic duty to support American manufacturing, I suppose—\"\nSteve ducks under the ropes and steps into the ring. One corner of Tony's mouth quirks up in victory.\nTony's been going at it for a while, and Steve's fresh and has serumized muscles and stamina, not to mention a longer reach. It's not much of a match up, but Tony buys some time by dodging most of Steve's punches. He's seen Steve run ten miles and fight for hours without being winded, so he has no illusions that he's going to tire the guy out, but it at least saves Tony's ego when he isn't instantly flattened under Steve's fists. But then, Steve is going easy on him, since the few punches that do connect don't even have as much impact as Barton's love taps.\nTony dodges a few more times before he lands a lucky uppercut. Steve's jaw is made of steel so it doesn't do much damage, but it surprises him. His next punches knock Tony around a bit more. After Tony lands a few more lucky punches, he at least knows he's winning in the mutual annoyance competition.\n\"That all you got, Cap?\" Tony says, staying just out of range. \"C'mon, I thought you were a super soldier.\"\nSteve grunts. \"I'm more than just a soldier,\" he says, like they're in the middle of an argument.\nTony shrugs, bobs and weaves. \"Yeah, sure, not likely, but thanks for playing,\" he says—and then the punch happens.\nTony bobs when he should weave, and Steve lands a jab in the middle of his chest—right in his arc reactor. And Tony's designed the thing to withstand the ridiculous G-forces of Iron Man flight, as well as the sometimes crater-inducing collisions involved with just being Iron Man in general. But he never designed it to withstand a direct hit from Captain Fucking America when he's pissed off and means it.\nThe punch jars the socket in his chest, knocking the air from his lungs and Tony knows it's impossible but he swears that for one fraction of a microsecond the arc reactor sputters. Tony immediately falls to his knees and hears two voices shout his name and then Steve is right there in his face, Barton a second later. \"Tony, oh gosh, are you okay? I'm sorry, I didn't mean—\"\nBut Tony's not listening, he's too busy gasping and raking his shirt up over his chest, just to check, to make sure the lights are still on and everyone's home and the thing is still keeping him alive. He puts his hand over the reactor, feels it humming under his palm the way he never really notices in his chest, the same way most people don't notice the steady thud of their heartbeat until they put their hand over their heart.\nHe looks up and Steve and Barton are still looking at him, Steve with another of his perpetual blushes and a worried wrinkle in his forehead, and Barton looking about as anxious as Tony's ever seen him, which is to say: not very. \"I'm fine,\" Tony says, like a reflex. \"Just got the wind knocked out of me.\"\nHe tries to stand but Barton's hand on his shoulder holds him in place. \"Maybe we should stop for the day, Tony.\"\nAnd Tony thinks he should be insulted, except that he kind of agrees with Barton. But what he says is, \"Relax, Barton. I've got the world's best Duracell, I can do this all day.\" He taps his fingers against the reactor and forces a smile before he pulls his shirt back down. Then he turns to Steve, and—\nAnd Steve's face is completely, shockingly white. Even his lips have gone a pale pink-grey. \"Whoa. Cap, are you—\" Tony reaches out because Steve looks like he's about to fall over, but Steve flinches away like Tony's hand is made of hot coals.\nSteve stands, swaying a little on his feet. Tony must have some sort of look on his face, because Steve reaches out like he's going to offer Tony a hand up but the movement gets aborted halfway through. \"Tony, I—I'm sorry.\" There's a hunted look in his eyes, but he says it again, just for good measure. \"I'm so sorry.\"\nAnd then he's gone, and Tony is staring at the empty space where Steve was just standing, and he says, \"What the fuck was that?\"\n~*~\nCaptain America may not run from a fight, but Tony Stark has no compunction about hiding out in his lab when things get weird. \nUnfortunately, that also makes him very easy to find, so it's not a very good hiding place if people are actually, y'know, looking for him.\n\"I read your file,\" Steve says, and Tony nearly kills himself when he jumps a foot in the air and almost falls back down the stairs to his lab.\n\"Jesus, Steve. Don't do that. What is it with you and trying to kill me lately? Have you been waiting out here for me all night? That's really fucking creepy.\"\n\"Oh, uh, I don't have the passcode to get in.\"\n\"Yes, and there is a reason for that. So you'll all leave me the fuck alone when I'm working.\" Although now that Tony thinks about it, with Pepper all the way in Malibu running the company, Tony should really have someone nearby with access, just in case he manages to accidentally blow himself up. Not that that's ever happened. No matter what Pepper says.\n\"I just...I wanted to apologize,\" Steve says, and for once it's Tony's turn to furrow his brow in confusion.\n\"For reading my file, or for being a creepy ninja stalker?\"\n\"Uh, neither—or both, maybe? I wasn't—I did read your file, so I'm sorry about the invasion of your privacy, but I just felt like I needed to know more, about your—\" Steve taps the center of his chest, over his heart, and Steve may not want to say the word but Tony gets the message.\n\"Oh,\" Tony says. He's read his own file, he knows what's there, but he blames his masochistic curiosity when he asks, \"You find out what you needed?\"\nThere's a pause, and then, \"You have diminished lung capacity, because it takes up so much space in your chest,\" Steve recites, but his tone is soft, and not nearly as detached and clinical as Tony's used to hearing when people talk about it. It's about as far from detached as Tony's ever heard from Steve, except for maybe their first meeting, right before Tony fucked everything up. \"You've also got problems with circulation, probably because of your sometimes erratic heartbeat. Boxing is part of your regular physical therapy to combat the muscle and nerve damage caused by the explosion and surgery and—\" 'And torture,' Steve doesn't say, and Tony doesn't either. \"For a while, it made you sick. Really sick.\" Steve looks like he sucked on a lemon, and then maybe the kid selling lemons kicked him in the shin. \"I should never have hit you like that, Tony, I—I don't know what happened, I'd never, not normally—\"\n\"Don't sweat it, Cap,\" Tony says, ready for this conversation to be over. \"You're not the first person to get freaked out by the reactor.\"\n\"No, that's not it. You don't understand,\" Steve says. \"All this time, I thought you were a bully.\"\nTony raises his eyebrows. \"Uh, that's because I am.\"\nFor a moment, Steve looks more confused than Tony's ever seen him, but when he speaks his tone is Steve's typical steadfast certainty. \"No, Tony, you're not.\" The words hang in the air for a moment, get stuck in the space between them, and a part of Tony wants to reach out and cling to them with white knuckles. Then Steve looks away and says, \"But you do seem to enjoy bringing out the worst in me.\" There's a quirk at one side of Steve's mouth, a tiny, chagrined smile. \nTony runs a hand through his hair and takes a deep breath. Must be that diminished lung capacity acting up. \"I've always been a bad influence,\" he says. \"It's a gift.\"\nSteve huffs a laugh at that and shakes his head. When he looks at Tony, there's a definite smile now. \"Yeah, maybe,\" he says, like it's a good thing. And Tony can't take that look, has to say goodnight and run away when Steve looks at him like that, the way that Steve looks at other people who aren't Tony Stark.\n~*~\nThere is a coffee ninja living in Tony's workshop.\nThat's the only logical explanation for why cups of coffee start appearing around the lab—ninjalike. They're waiting for him after he wakes up from falling asleep on his workbench, or after he's been tunnelvisioning his way through a new project for a few hours—or days. He checks Dummy to see if he got drunk and decided to install a coffeemaking subroutine in hopes of making the robot useful. He didn't, but decides it's not a bad idea, so he installs one and very carefully doesn't think about where the coffee comes from—Steve still doesn't have access to the coffeepot, anyway. And after he installs the program, he can never be sure the coffee isn't the work of Dummy, so it would be a waste of his considerable brain power to dwell on it.\n(Steve has the code to Tony's lab, Tony gave it to him for emergencies, but surely Captain America would never be selfish enough to take advantage of that for his own personal use.)\n(Tony awards himself a point anyway.)\n~*~\nTony is busy welding when he looks up and sees Steve standing three feet away. He yelps and drops his blowtorch, which clips the edge of the table, and most of the precariously stacked machinery comes crashing down. Tony throws off his welder's mask and dives for the still burning torch before it can light anything on fire, and Steve dives for the edge of the table, trying to catch what hasn't already fallen. \n\"Oh, geez,\" Steve says, and crouches down to start gathering up bits of scrap metal. \"Tony, I'm so sorry, I just wanted to—Are you okay? Shouldn't you be wearing more than just—\" His cheeks go pink and he drops a couple of items with a clatter. \"I mean, more protective clothing when you do this kind of thing?\"\nTony fumbles the torch off and looks down at himself in his black wife-beater, grease stains and sweat covering his bare arms. He supposes he's probably got some protective gear around the lab somewhere, but it's not anything he really thinks about. \"Uh, I've got gloves?\" he says, holding up his hands as proof.\nSteve just frowns, eyes flicking between Tony and Tony's bare arms and Tony's pile of metal. \"Oh. Okay.\" And then, because the universe hates Tony, the next bit of scrap Steve pulls from the pile is the prototype shield. \"Hey, what's this?\" \n\"Ah. That,\" Tony says, trying to keep his cool as his embarrassment level ratchets up to somewhere around the time his mom discovered his porn stash. \"That's just—it's in its early stages, not sure it'll even work, more just a concept really, kind of a work in progress, what do you want?\" He forces his mouth to clamp shut and grabs the shield and everything else in Steve's arms, then tosses them back on the table, making sure the shield is properly buried under a pile of junk.\n\"Oh, um, I just wanted to check in on you. I wondered what you do down here that eats up so many hours.\"\nTony waits for the punchline, and when it doesn't appear forthcoming, he gives Steve the stink-eye. \"Really?\"\nSteve shrugs. \"Sure. It's what takes up most of your time. I'd like to know what you do.\"\nTony takes off his gloves and grabs a rag to wipe the sweat off his face and neck. Steve is watching him, and actually seems interested, so Tony says, \"I don't know how to describe it, really. It's more of a process. Sometimes I invent new stuff, sometimes I just figure out how things work, then figure out how to fix them and make them better.\"\nSteve gets a funny little smile on his face then, like he's thinking of a private joke, and says, \"Yeah, I think I know something about that.\" And then, after a moment, \"Can you show me?\"\nAnd Tony wants to say, 'Right now?' because he's kind of busy, he'd been in the middle of...something he can't quite remember at the moment, but it had been important at the time. Instead, what he says is, \"Do you like cars?\"\n~*~\nThey get word to suit up before they even know what their mission is or where they're going. Tony's in his lab, the last bolts on the armor screwed into place just as Steve bursts in, already suited up. \"Tony, wait, don't go!\" he shouts.\nTony blinks at him and opens his mouth to say he doesn't even know where to go, but then JARVIS says, \"Sir, Director Fury just forwarded the information about your current mission. It appears there are giant robotic termites eating their way to the roof of Stark Tower.\"\n\"Son of a bitch!\" Tony says and fires his repulsors. Steve grabs hold of him and shouts something about waiting for backup, but then Tony's already in the air and Steve is still holding on, so Tony just puts one arm around his waist and adds an extra burst of speed. \"I'm pretty sure this is a yellow light situation, Cap.\"\nSteve blushes and visibly rallies against the automatic retort Tony can tell is already forming. Instead, he says in that annoyingly formal command tone, \"I was too dismissive before. Added mobility is a tactical advantage in a fight. I think you should—we should—\"\nTony's glad the helmet hides his smirk as he mentally translates that from Cap-speak. \"So you actually like me flying your star-spangled ass around as my back up to keep me from doing anything too reckless, and you think I should keep letting you tag along.\"\n\"Er. Yes,\" Steve says just as Stark Tower comes into view. \"If it's not too much trouble.\"\nTony lowers them down onto the roof with an, \"Aye aye, Cap,\" and adds a bonus slap on Steve's ass for good measure.\nSteve squawks, \"RED LIGHT,\" and Tony laughs so hard he nearly falls off the building and onto a termite the size of a tank.\n~*~\nWhen Steve invites Tony to \"movie night,\" the last thing Tony expects is to be greeted with Disney's version of Greek mythology.\n\"Hercules?\" he says around a mouthful of popcorn. \"That's a kid's show!\"\n\"It was in your Netflix queue,\" Steve says, and damn whoever decided Steve needed a lesson in twenty-first century entertainment systems. He's betting it was Barton. Or Banner. \"Besides, JARVIS said you'd like it.\"\nTony stops plotting how to steal the remote and blinks. \"You talk to JARVIS about me?\"\n\"Er,\" Steve says, cheeks pink. \"Sometimes. When I—He's the only one that seems to know you.\" Steve seems to immediately rethink that comment, then says, \"Well, and also Ms. Potts, but the only time I ever see her is when she's here to yell at you. Not that you listen to her any more than you do me.\" \nTony balks at that. \"I listen to Pepper! She's Pepper! Of course I listen to her!\"\n\"I would beg to differ, sir,\" JARVIS says.\nTony points a threatening finger at the ceiling. \"You can just stop being helpful, before I decide to re-evaluate your smartass-factor.\"\n\"Of course, sir,\" JARVIS says, voice dripping in sarcasm.\n\"And stop feeding Steve lies about me,\" he adds, then grabs the remote from Steve's hand. He makes a mental note to delete anything embarrassing from his queue and flips through until he finds \"Real Steel.\"\n\"A movie about fighting robots, Tony? Really?\"\n\"Shut up and watch the movie,\" Tony says, and shoves the bowl of popcorn into Steve's hands.\nBy the end of the movie Steve is asleep on his end of the couch, his toes wedged under Tony's thigh for warmth. Tony watches him sleep through most of the credits, until he realizes what that heartsick ache in his chest means. He slaps Steve's leg harder than he needs to and says, \"Time for bed, Capsicle.\" He's surprised by his own tone, something he could almost call affectionate. \nJudging by Steve's face he seems confused as well, and Tony half expects the typical frown and clipped response, but after a moment he just offers up a reluctant smile that is quickly followed by a yawn. \nTony wonders how to score that. He thinks he probably needs to revise his scoring system. Because Steve still has his moments when he forgets to be Captain Perfect, but it's different now that they're not constantly at each other's throats. Tony's still not sure of his new footing, and this could become a dangerously slippery slope.\nSteve, oblivious to Tony's internal monologue, rolls off the couch and shuffles off towards his room, mumbling, \"I wouldn't mind a sparring robot.\" His door clicks shut and he leaves Tony to sit in the dark, thinking.\n~*~\nTony decides to take everyone to a strip club. Watching Steve blush his way through the most awkward night of his life is the best way for Tony to regain a bit of his equilibrium around the man, and it's enough of a buddy activity that it won't upset the balance of this weird not-hating-each-other thing they've started.\nIt makes perfect sense, in Tony-logic.\nBarton and Thor are game, unsurprisingly, and Barton drags Banner into it with some of the best reverse psychology Tony's ever seen. Tony expects Natasha to beg off, which is probably exactly why she doesn't. Steve is the last hold out, and Tony is not above taking advantage of Steve's lingering guilt about the Chest Punch Incident. It may be low and underhanded, but Tony is not going to miss out on an opportunity to make Steve as uncomfortable as humanly possible.\nThey fly to Las Vegas, because they can. Tony's got his own jet and everything. He also knows this high class, tastefully sleazy club that he may have frequented a bit before he became Iron Man.\nThey get the VIP room, because he's Tony Fucking Stark, and that meant something in this town even before he became a superhero. \nThor is surrounded by women, and from what Tony's seen the guy hasn't stopped talking all night—from the snippets Tony's caught, Thor's topics of conversation are: flattering the women by saying they're fine examples of Midgardian beauty, stories about battle, Asgardian drinking songs, and of course, Jane, which makes them all coo and gather around in a semi circle. Tony thinks they're moments from braiding each other's hair.\nBarton is on unofficial Hulk-duty, because the last thing they need is for Banner's pulse to skyrocket during a lap dance. But Banner is incredibly zen about the whole thing. Tony wonders if Barton slipped a Valium into his drink. Steve is in the corner making conversation with Natasha, very carefully not looking around the room, but Tony can tell by the blush creeping up from Steve's collar that Steve isn't exactly unaware of their surroundings.\nThere's a sweet brunette in white lingerie feeding Tony olives from empty martini glass number whatever-the-fuck while he lets her pick out girls to send Steve's way—a blonde, a brunette, and a redhead, all in order, and all sent away within moments of their arrival. Tony has no idea what Steve says, but he's betting it's something full of Golden Boy charm, because the redhead actually kisses Steve on the forehead before she goes. With each girl, Steve sends increasingly furious glares Tony's way. Tony just smiles, edging towards the kind of happy, goofy tipsy that he likes but so rarely seems to find. \nWhen the brunette at Tony's shoulder feeds him his last olive, she smiles and says, \"I could give you both a dance, if you like.\"\n\"Oh, no, we're not—Wow, did you really think that we're—?\" And then Tony has to laugh, because the idea is just too preposterous, even if it does strike a little too close to home on Tony's part.\nAnd then, because this is a high-end establishment that understands that women are paying customers too, one of the male dancers makes his way over to Natasha. Steve stands and practically bolts towards the relative safety of the bar. The brunette is saying something else but Tony isn't paying any attention as he stands to follow Steve. He sways a little on his way over, and yeah, okay, definitely more drunk than he'd thought he was.\nHe leans up against the bar for a little added stability, and Steve downs a glass of something brown and says, \"Times like this I really wish I could get drunk.\"\n\"No alcohol, no strippers, explain to me why we brought you along.\" He has to lean in to Steve's space and shout a little to be heard over the music.\nSteve gives him a look. \"Tony, you practically forced me to come through guilt and peer pressure.\"\nThe bartender sets another martini in front of Tony without needing to be told. \"Touché,\" Tony says, and takes another drink. He turns his back to the bar, and Steve's back is to the room, but their shoulders brush when Tony sways.\nSteve watches him for a moment with shrewd eyes, then says, \"You don't enjoy it either, so why did you bring us here?\"\nTony feels his eyes widen in shock. When the hell did Steve learn to read him so easily? He shrugs, but Steve can probably read the lie in that, too. \"I used to like it, a while back.\"\n\"No you didn't,\" Steve says, and Tony decides either Steve is too sober or Tony is too drunk for this conversation. Luckily, Tony is also too drunk to care either way.\n\"You're right, I didn't.\" He emphatically sets his glass back down on the bar. \"But that's not what it's about.\"\n\"It's not?\"\n\"No, see, you gotta keep 'em guessing,\" Tony says sagely, because his drunken wisdom is flawless. \"So you pretend to like the things you don't, and you pretend you don't like the things you do, and then they'll never know where to hit so it hurts.\"\nSteve stares at him for a while, and damn, his eyes just never stop being that perfect shade of blue. Then he gets a smile that doesn't quite sit right on his face and says, \"And all this time, I thought your flashiest armor was the suit.\"\nTony waves his hand in the air. \"I'm like an onion. I've got layers. Oh, wait, you won't get that reference.\"\nSteve just shakes his head and his voice goes almost too soft to hear over the music. \"It's alright, Tony. I understand enough.\"\n~*~\nWhen he gets to the lab, two things are waiting for him: a steaming cup of coffee, and Steve. Tony still refuses to believe the two things are related. Dummy's there, the coffee could have come from the robot.\nSteve is parked in a chair in front of the Iron Man suit, his sketchbook stretched neatly across his chinos, a pencil held in graphite-stained fingers, tip resting on the paper. He's focused so intently he doesn't even hear Tony's entrance. \"I'd ask if you two would like to be left alone, but seeing as this is my lab...\"\nSteve startles a little, then laughs and waves at the sketchbook like it's the only explanation needed. \"No, it's just—After the serum, everything got enhanced.\"\nTony raises one eyebrow. \"Everything?\"\nSteve blushes to the roots of his hair and sputters a moment, but doesn't rise to the bait. \"Even my drawing is better, something about fine motor control. And your armor is so intricate, all the hard lines and the little details you don't notice unless you look really closely or from the right perspective...\" He trails off with a distant, fond look on his face, then looks at Tony and blushes again, somehow even worse than before. \"Er, sorry, I'm rambling.\"\nTony's not like Natasha—he's never been good at wiping his feelings from his expression. Instead, he smirks in that way he does when he's being a mid-level asshole—partially for his own amusement, but mostly because it keeps people from looking too closely and from the right perspective—and says instead, \"So Captain America likes a challenge.\"\nSteve snorts and doesn't look up from his sketchbook. \"I'm friends with you, aren't I?\"\nTony freezes. Steve freezes a moment later, then looks up. \"Oh, I—I didn't mean to presume, I just—\"\nTony snatches up the coffee and downs a large gulp to clear the sudden dryness in his throat. He retreats towards his workbench and waves a dismissive hand over his shoulder. \"No, it's fine, presume away,\" he says, banging around with random bits of machinery and wondering if he should run maintenance on his reactor, because his heart doesn't feel quite right. He shoves aside doodles on a sparring robot, buries them under some other blueprints, then pulls them back out because, sure, why not? It'll keep his mind occupied.\nOnce Tony actually focuses on the machinery and schematics he gets lost in it, doesn't emerge from his tunnel vision until several hours later when his stomach rumbles too loudly to be ignored. By then Steve is gone and there is another steaming cup of coffee and a hot pocket on the workbench next to the drawing Steve was working on. Tony picks it up, feels the weight of the paper, notices that some of the lines are bold and sure, some light and erased and redrawn again. The sketch is a remarkably accurate likeness of Tony in the Iron Man armor, helmet held under one arm and gaze fixed on something off the page, one corner of his mouth turned up in that smirk he uses when he's deflecting, but it doesn't match the look in his eyes, and god, he hopes that Steve can't read that look as well as Tony can read it in himself.\nUnderneath the drawing, Steve has written, \"Still a work in progress, but I'll keep trying until I get it right.\" The corner of the drawing is signed \"Capsicle\" with a little smiley face. \nTony slumps heavily into a chair, his arc reactor working doubletime as it tries to fix whatever the hell is currently happening to Tony's heartbeat. \"I'm so fucked,\" he says.\nDummy just helpfully nudges the plate with the hotpocket closer.\n~*~\nBecause Steve is stubborn and never backs down from anything—even Tony Stark and his laundry list of personality defects—he doesn't let Tony withdraw. He is always around, and his Steve-ness is making it very, very difficult for Tony to repress and go back to hating Cap's guts like he wants. Tony thinks he could award himself some points if he could get Steve to give up, back off, to put some distance there, but Tony's willing to concede that trying to out-stubborn Steve when he's got his mind set on something is exhausting, so Tony's personal goal goes from getting his equilibrium back to just simply keeping his head above water.\nOr, as a more immediate concern, to keep his head out of the jaws of the giant fire-breathing lizard, because Loki has apparently been watching a Godzilla marathon.\nAnd Tony knows what's coming when he sees Steve vault over the edge of Stark Tower, which is good because Steve's already in the air when he calls for Tony. The words barely make it through the comm before Tony catches Steve's hand and uses the momentum to fling Steve right at the head of Godzilla, shield at the ready, working as if they'd planned it and Tony hadn't just acted on instinct. The rest of the Avengers fall in line and they take down the overgrown iguana seamlessly—like a team, and when the fuck did that happen?\nAfter cleaning up the half of Manhattan that Godzilla didn't eat, everyone goes back to the mansion and decides the best way to deal with that kind of day is to get rip-roaring drunk. Two hours later, Barton is purposely losing at beer pong to Banner. Barton never misses at anything, but Banner looks happy and Barton just smiles every time Banner lands a cup so no one really wants to call him out. To everyone's chagrin, Thor drags out the karaoke machine from god knows where. Tony has no idea how he keeps finding the thing when even Tony can't remember where he's hidden it most of the time, but a few more drinks and Tony decides the karaoke machine is the greatest thing in the world. He gets up on their impromptu stage, singing along to a song he doesn't know, and he's obviously rocking out because he's awesome, yes he is. If his adoring fans would just stop shouting at him and trying to drag him down off the stage, they'd realize it, too.\nVaguely, through the dulcet tones of Ricky Martin, Tony thinks he hears someone say, \"Alright, bring in the big guns,\" and he's expecting Pepper to materialize instantaneously from Malibu or, possibly, an actual big gun to shoot him off the stage, but what he gets is Steve trying to hold back a laugh as he approaches the stage.\n\"Steve!\" Tony says, delighted. \"Steve! When did you get here?\"\nSteve bites his bottom lip and grins. \"I've been here the whole time, Tony. I live here.\"\n\"Come up! You should come up and sing!\" And Tony croons, \"Shake your bonbon, shake your bonbon!\" and does a little shimmy, and Steve turns red and hides his face in his hands. \"Steeeeve! Come up and dance with me. You never got to dance, you should dance!\"\nBut Steve just shakes his head and holds out one arm like he's waiting to catch Tony when he falls off the stage. \"Time for bed, Tony.\"\n\"Okay,\" Tony says, and drops the microphone where he stands. He lets Steve pry him down off the stage and wrap an arm around Tony's waist to keep him upright. Steve lifts Tony's arm and drapes it over his way-too-broad shoulders, holding tight to Tony's wrist as Steve walks Tony back towards the bedrooms. Tony goes willingly, despite the fact that the rest of his team has been trying to do that for the past half hour.\n\"How did he—what? How?\" Tony hears Barton ask, and when Tony glances his way (which makes him swerve a little and Steve grips him tighter) Barton and Banner have matching idiotic, gaping expressions. Natasha just raises an eyebrow and snaps her fingers in front of Barton's face and says something that sounds suspiciously like, \"Pay up, bitches.\"\nSteve hauls Tony into his bedroom and lets Tony flop face first into the mattress. \"Ahdoanluchooyunno,\" Tony says into the comforter. \nSteve picks up one of Tony's feet and starts pulling off his shoe. \"What's that?\"\nTony rolls over and ignores the shiver he gets when Steve wraps his hand around Tony's bare ankle and pulls his sock free. Tony glares. \"I said, I don't like you, you know.\"\nSteve pauses, just for a moment, as he tries to wrestle Tony's other shoe off. \"You have a funny way of showing it.\"\n\"That's the problem,\" Tony says, but it comes out more like, \"Thassaproblmem.\" Steve snorts and focuses on Tony's other sock. \"You make it hard for me to hate you,\" Tony says. \"And I've been trying really hard.\"\nSteve raises an eyebrow and gives Tony a look like he's one of the puppies in that cardboard box he rescued. \"So you don't like me because you don't hate me.\"\n\"Exactly!\" Tony says, because Steve gets it! But then Steve just hoists Tony's now-bare feet into the bed and pulls the comforter up over Tony's shoulders, and Steve must not get it because he wouldn't still be being so nice to Tony. Or maybe he would. Because that's just how Steve is. Which is exactly the problem. \"I wish I still hated you,\" he says, and the aren't-you-a-cute-puppy look vanishes from Steve's face, and now he looks like Tony hauled off and kicked one of the puppies from the box. \n\"You drink too much,\" Steve says, but he says it like he cares instead of like he's judging, and then he finishes tucking the covers in around Tony and tells him to get some sleep. When the door clicks shut, Tony rolls to his side and buries his hands in his face and pretends the churn in his stomach is from alcohol and not guilt.\n\"JARVIS,\" Tony says, \"make a personal note. This is why we can't have nice things.\" \nThere's a long pause which Tony knows is more because JARVIS wants to make a point than out of any need for processing time. \"And is Captain Rogers a nice thing, sir?\" \nTony sighs and says the next words mostly to himself. \"Yes. A very nice thing.\" \nAnother pause, which seems to stretch in the dark, and then JARVIS says, \"Note entered, sir.\"\n~*~\nTony's not sure who on the team came up with Bloody Mary Mondays, but right now he feels like erecting a statue in their honor in the front lawn of the mansion. His head is pounding, and he staggers downstairs in Iron Man pajama pants and sunglasses to find a be-celeried drink and a plate of greasy breakfast food already waiting for him. He slides into his seat without looking at anyone, but he already feels a little more human, until a small bottle of hot sauce appears next to his fork, ninjalike, and he has to take a deep breath.\nTimes like this, Tony thinks a lot about that first rocky meeting with Steve. He can call it up in perfect clarity, because Tony's always been good at remembering his failures. \nHe remembers how Steve had written him off as a lost cause moments after their first introduction. He clings to it, because he needs the reminder at times like this. Because Tony has always been the king of bad decisions, but sometimes he'll look at Steve across the battlefield, or across the workshop, or across the kitchen after Steve has made the team breakfast and he wordlessly sets a little bottle of Tabasco next to Tony's eggs without needing to be asked, because he knows how Tony likes his eggs, and Tony will know he's on the verge of making one of the biggest mistakes of his life.\nBecause he can still remember the shouting fest of the first meeting, but now he's starting to remember what set it off, and that's the part that up until now Tony had happily locked away and shoved into the corner of his mind reserved for his social security number and Pepper's birthday. He's been remembering it now, mostly because lately it's been impossible not to.\nTony had strolled off the plane and right into Fury's office with a righteous speech already in his head. Pepper had drafted it. There were a lot of good points about corporate funding and disclosure agreements, because if Tony's company was funding the rescue mission he thought he deserved to know when someone had been rescued. He got as far as, \"Fury, I—\"\n\"You want to see Captain Rogers.\" Fury didn't even look up from his paperwork.\n\"Er, yeah. And if you think—\"\n\"He's upstairs, second door on the right.\"\nTony straightened up, composed himself, and then rabbited out of there half expecting Coulson to pop out of some dark corner and shoot him with a taser while Fury laughed and shouted, \"Just kidding, motherfucker!\" So he was kind of shocked when he reached the top of the stairs and there was Captain America in all his star-spangled glory.\nThey just stared at each other for a long time, Tony drinking in the sight of his hero right there, in the flesh, looking better than Tony could have ever imagined, and then Captain America said, \"Mr. Stark.\" And Tony had seen enough Captain America films—okay, all of them—to know that his voice didn't normally sound like that, all rough and choked, and he was giving Tony a look that Tony was completely sure he had never been on the receiving end of even once in his life.\nTony replied without thinking, \"Captain.\" Then the sound of approaching footsteps knocked him out of his haze, and he turned to see Fury and realized that there hadn't actually been a round of introductions yet. \"Did you tell him about me?\"\n\"Nope,\" Fury said, eying them both with that freaky one-eyed stare.\nThe shuffling of feet brought Tony's attention back to the Captain—not that it had ever really strayed. \"I just knew, I mean—\" and his voice still sounded off, like he was still recovering from whatever emotional whammy had hit him when Tony walked into the room. He shrugged those big, beautiful shoulders and made a vague gesture encompassing Tony's person. \"You're obviously Howard's son.\"\nAnd just like that, Tony could actually feel his hackles go up. His spine stiffened at the mention of his father's name, a Pavlovian reaction that a lifetime of conditioning had ingrained in his DNA. He looked at Steve's far too hopeful, far too earnest smile, then at Steve's outstretched hand. \"Obviously,\" he said, voice edged with ice, and didn't take Steve's hand. The look on Steve's face faltered a little, and Tony hated himself a bit more than usual, but moments later he had viciously stamped that look right off Captain America's perfectly chiseled face, then set about banishing it from ever returning.\nExcept he failed, because that look has been resurfacing. It was gone for a while, but now it's back with a vengeance—not quite the same, not the way Steve had looked when he expected the son of Howard Stark to be the answer to all his problems, but it bears a close enough resemblance to make something painful clench in Tony's chest that has nothing to do with the arc reactor. And now that look is mixed with something else that reminds Tony of himself when he's moments away from dragging out his tools because Dummy's being glitchy again.\nAnd Tony, god help him, doesn't try to make it stop this time. \nAfter that, the scoring system doesn't so much get re-evaluated as reinvented. And if he's honest with himself—which he tries not to be, except when he has no other choice—this thing was always about getting Steve to look at him—at Tony.\n~*~\nTony takes a few bullets to the chestplate saving Steve's back. He feels them slice through the first few layers of metal plating to take out some delicate but not altogether essential electronics, and just thinks that it's gonna be a bitch to fix, but it's better than the alternative.\nLater, he makes it as far as his lab, barely out of his armor before he crashes. He wakes up in the workshop to coffee and aspirin, too exhausted to deny the knowledge that Steve is the coffee ninja. Steve has his back to Tony, just waiting, looking at the suit and tracing his fingers around the holes in the chestplate. Tony hears Pepper's voice in his head, just as sharp and clear as the first time, remembers the exact inflection of her horror as she said, \"Are those bullet holes?\"\nTony downs the coffee and aspirin, his shoulder and ribs aching from the bruises caused by the bullets. \"You know that code is only for emergencies.\"\nSteve sighs. \"This is an emergency, Tony.\" Tony doesn't say anything about all the other times Steve's been in Tony's lab when it wasn't an emergency. Steve turns, finally, to face Tony. \"We need to talk about what happened out there.\"\nTony rolls his eyes and stands, reaching for the chestplate and a ball pein hammer. \"C'mon, Cap. The armor is designed to take all kinds of concussive force. The bullets didn't even make it through the second layer of shielding. We've been up against worse.\"\n\"That's not the point.\" Tony steps back around his workbench, but Steve follows, not letting Tony put any distance between them. \"You've always been reckless in the field, Tony. I'll admit that it's gotten us out of some tight jams, and you're always going to be the first person I turn to when our backs are up against a wall. But I need to be able to depend on you not to take unnecessary risks.\"\n\"It wasn't unnecessary. The serum made you a lot of things, Captain Muscles,\" Tony jabs the the end of his hammer into one of Steve's pecs to drive home his point, \"but bulletproof isn't one of them.\" Then he smiles. \"Myself, on the other hand—\"\n\"I can't focus on the fight if I'm constantly trying to keep you from throwing yourself into the line of fire! You don't have to like me, Tony. But you do have to follow my orders some of the time, especially when it's for your own good.\" \nAnd it should take Tony right back to the beginning, but too much has happened since then. He can't even remember what that was like anymore, so he just smirks and says, \"No, I don't. You just think I do because you're a bossy son of a bitch.\" Then the full weight of Steve's words hits him, and—\"Wait, you still think I don't like you?\"\nSteve gets a pinched look. \"What else am I supposed to think? You said—\" Steve takes a breath, and when he talks again, it's with his command voice, and Tony hates hearing that voice when they're not in battle. \"Nevermind, that's not why I'm here. Listen, Tony, we need to talk about this. Communication between team members is important for—\" \nTony throws his hammer down on the workbench, because he has had it with this bullshit. \"Okay, you wanna know why I don't like you? That. That right there is why I don't like you. You are too damn perfect.\" \nSteve just stares, eyes wide. \"What?\"\n\"Captain America was the gold standard in the Stark household. You've been my hero since before I even knew how to say your name. Dad always wanted me to be like you, and I don't know which of us was more disappointed when I turned out to be more like him.\"\nIt all comes out in an angry rush, and Steve takes a step back, just far enough that Tony feels like he can breathe now, and when the fuck did Steve get so comfortable in Tony's personal space? Tony sucks in a breath and figures he's in for a pound, and all that—he knows that Steve won't let this go until he's wrung everything out of Tony, and Tony is too exhausted to deal with another of Cap's interrogations-disguised-as-team-bonding, so he just lays all his cards out on the table.\n\"The whole world wants me to be Howard Stark, and Howard wanted me to be you, so now nobody's happy,\" Tony says, and he completely fails at keeping the melancholy tone from mixing with his anger. \"But I grew up, grew out of it, figured my father exaggerated. Captain America was just a guy, after all. Nobody's that perfect. But then you are.\" Tony holds up a hand to stop whatever undoubtedly modest protest Steve is about to make. \"Me, I'm just a guy in a suit, with a lot of money and twice as many issues, and my only real talent is being creative at blowing shit up. The only reason I'm on this team is because I'm trying to make up for a lifetime of bad decisions and poor impulse control. But you...You're the real deal. You jump on grenades and save puppies and help little old ladies cross the street, for fuck's sake. Who does that anymore? You're just—you're so—\" Tony makes an eloquent hand gesture encompassing Steve in general, then freezes. \"Oh my god. Are you standing in parade rest?\"\nSteve shifts his stance with an uncomfortable little shuffle. \"Er—\"\nTony sighs, and it's like all his anger gets pushed out along with his breath. \"Y'know what, nevermind. This is my own problem, I'll just—well, no, I won't deal with it, because that's not how I roll. But whatever, it'll be fine.\"\nBut Steve, instead of taking that as the dismissal it is, takes a step closer, back into Tony's space. \"I...I didn't know. That you felt that way.\"\n\"What's there to know?\" Tony says, feeling punchy and off balance. \"My whole life, I wanted to be something better than what I am. When I made the armor, I thought—but you were right. I'm nothing without the suit. Underneath it all, I'm still me. So yeah, I'd take a bullet for you, but it's not because I'm a good person. That's all you, Cap.\"\nThere's a long pause in which Tony just stares at his workbench because he can't bring himself to look at Steve right now, and then Steve says, \"Tony...the suit is nothing without you.\"\nAnd Tony's head snaps up at that, forgetting how close Steve is standing until he he finds those blue eyes up close and a little too personal. But this isn't the usual trying-to-figure-Tony-out stare. There's no furrowed brow, no perpetual blush, no hard, battle-ready set to his jaw. It's just Steve, looking at Tony.\nSteve reaches for Tony's hand and Tony snatches it back. He shuffles out of range and says, \"We're done here,\" but damn it, it comes out sounding more like a question, like he's asking, \"Permission to run the fuck away, Captain?\" Only Tony doesn't wait for an answer, just leaves Steve alone in his lab and makes a hasty exit, because he knows he's not strong enough to leave if Steve asks him to stay.\n~*~\nTony tries to avoid Steve, but it doesn't work because it's hard to avoid a person when said person lives in the same house and has taken to following you around like an overprotective golden retriever.\nSteve's silent looming lasts all of about fifteen minutes before Tony decides it's going to drive him up a fucking wall and tells Steve so. After that they talk, but Tony puts the kibosh on topics of conversation that even skirt the edges of dangerous topics like feelings, so they're mostly stuck with the weather or sports, and there's only so much whining about the Dodgers that Tony can handle in one sitting. It's not awkward, per se, except that—okay, yeah, it's actually pretty awkward, because for three days Steve has clearly been on the verge of saying something very, very meaningful—so meaningful it's about ready to bust out of him—but Tony won't let him say it, so he spends three days trying to tell Tony with his eyes while discussing batting averages and the chances of rain later in the week.\nAfter three days of that, Tony's actually thankful Loki decides to stir up trouble in the form of another failed invasion. Tony guesses it's more an act of boredom than conquest, because Loki's barely even trying anymore, and they lay the smackdown on Loki's forces pretty easily. Afterwards, there's the inevitable debrief. Everyone heads back to the Helicarrier in the quinjet except for Steve and Tony, because Steve refuses to give Tony up as his personal taxi service. They land in what has unofficially become their personal hangar, and Tony takes his helmet off and makes for the door.\n\"When I was twelve, I stole some penny candy from Mr. Taylor's corner store,\" Steve says, out of nowhere. When Tony turns, Steve is facing off to the side, eyes downcast.\n\"Uh,\" Tony says, \"okay?\"\nBut Steve just plows on, still not looking at Tony. \"Bucky was there, and he was the only kid who'd ever treated me like a friend, and I wanted to impress him, so I—\"\n\"And how long was it before you went back there and dropped a few pennies in the jar to pay for it?\" Tony says, and Steve frowns so Tony knows he's right.\nSteve turns to Tony and says, \"After the serum, when I thought Howard and Peggy were—I used to fantasize about using my strength to punch Howard in the face.\"\nTony has to bite his lips between his teeth to keep the amused smile off his face. \"Uh, Cap, aren't these the kind of things you should be unloading on a priest? And nobody would ever mistake me for a priest, so—\"\n\"I still think about it now,\" Steve says, his tone deadly serious and his gaze leveled at Tony. \"But for different reasons.\"\nAnd that takes a little of the air from Tony's lungs. Steve seems to sense his opening and steps forward, pressing his advantage. \"Sometimes I don't want to be Captain America,\" he says, and that revelation hits Tony like a slap to the face. \"I wish I could just...stop. Or that Erskine had chosen someone else. I feel like—I know what it's like, for you, trying to live up to the image of Captain America. After all this time I feel like Captain America's been built up to something too big for me to fit. I feel like every time I don't do everything exactly right, the moment I'm less than perfect, I'm letting the entire nation down.\" Tony's conscience instantly starts flashing the point total for all of the times when he'd gotten Steve to do just that. And if Tony didn't know exactly what a punch in the chest from Captain America felt like, he might use that to describe his reaction to Steve's words. But given that Tony has first hand knowledge, he can definitively say that Steve's words hurt worse than a direct punch from Captain America.\nBut Steve just barrels on, either not noticing Tony's reaction or choosing to push right past it. \"And then I resent everyone who's ever looked up to me, or pinned their expectations on me,\" he says. \"And I shouldn't, but sometimes the only person I give a damn about is you, and I still want to strangle you. And maybe force you to eat some real food, something besides scotch and coffee.\" \nThere's some of that familiar frustrated amusement in Steve's tone, but Steve's face is still impassive and—huh, really a lot closer than it was a moment ago. Tony takes a step back and remembers there's a wall there when his armor clangs against it. \"And I hate this place,\" Steve continues, still advancing. \"It's too loud, too flashy, too fast. The people are too—But then there's you, and you make me like loud and flashy and fast, and you make me want to get back out into the world in a way that none of Fury's speeches about heroes ever managed, and I want—\" His words choke off and one hand comes up to Tony's chestplate, right over the repaired bullet holes, and he pins Tony to the wall like he's expecting Tony to make a break for it. And maybe Tony would, if something in Steve's eyes didn't make Tony's breath catch and turn his legs to rubber. Steve's other hand flattens against the wall next to Tony's head as Steve pushes in close, blue eyes hard as crystal and fixed on Tony. \"I want—\"\n\"Is this a yellow light or red light situation?\" Tony says, the words a bit high pitched and practically exploding out of him without conscious thought. \"Because I've never been able to—\" Steve slides his hand across Tony's chest and down the arm of the armor, over his bicep, his elbow, pressing his palm against Tony's. \"Okay, definitely red light,\" Tony says, breathless. Fuck, why is he even fighting this? It's what he's wanted, more than he could have possibly hoped for, it's everything—but he'll ruin it, fuck it up like he always does, because like he's said before, he has never been able to stop being himself long enough to hold on to the good ones.\nSteve threads their fingers together, shiny leather slipping between articulated metal plates, and says, \"I'm not as good as you think I am.\" There's something raw in his voice, and it sends a shiver down Tony's spine and he thinks, 'Fuck it,' because Steve wants this, and some part of him must secretly like it when Tony drags him down off of his high horse—he had practically admitted as much—which means maybe he'll be able to hold on to this when Tony can't.\nTony opens his eyes—didn't even realize he'd closed them—and looks up into Steve's face. There's something pained in the way his eyes meet Tony's, in the way he's leaning into Tony's space but not touching him, a careful distance everywhere except for the one place they're joined through layers of leather and metal. And then Tony remembers the point that Steve was trying to make, and he gets it.\n\"Oh,\" he says, and then, \"Oh. No, that's not bad. Times change, that's not—that's pretty much the opposite of bad, actually, it's—\"\nSteve's grip on Tony's hand tightens, but otherwise there's no shift in Steve's demeanor. \"There's things—I shouldn't—\"\n\"You should.\" The words come out with a desperate edge, but Tony's always been a bit shameless.\n\"You're my teammate.\" And Tony knows Steve well enough by now to hear all the things under that: You're a man. You're Howard Stark's kid. You're the closest thing I have to a friend, and all my friends are dead.\n\"Are you really expecting me to be the responsible one here? Because I'm pretty sure—\"\n\"Tony.\" And that may be Steve's command voice, but for once Tony doesn't mind, not when Steve's eyes go dark like that. \"You can tell me to stop, if you want.\"\nTony stays silent, mostly because the moment he opens his mouth something like yespleasenow is going to come rushing out.\nSteve leans in, but he stops just centimeters away, like he's rethinking this or maybe just waiting politely for Tony to change his mind, because that is such a Steve thing to do. But Tony can feel Steve's breath on his lips and it's likely to drive him crazy while he waits for Captain America to realign his moral compass. He lets out a breath and says, \"Steve.\" It's meant to be exasperated, but along the way some circuits must get bypassed because what comes out is too full of something—everything—to be Steve's name, like it's another word entirely, and Tony might as well have said the yespleasenow that he's been holding in. But he makes a note to be embarrassed later, because Steve's groan sounds an awful lot like the Steve Rogers version of \"fuck it\" and then his mouth is on Tony's. \nThe press of Steve's lips is soft and chaste and so damn earnest. It's like Tony can feel Steve's wholesomeness bleeding through the place where their mouths touch. Steve's tongue probes at the seam of Tony's lips in a way that from anyone else—anyone else—would be labeled a blatant tease, but from Steve it's a request, because he's so damn courteous like that. And Tony opens up and lets Steve push his way inside, and that's when the kiss turns filthy.\nTony drops his helmet to the floor with a loud clang and then wraps his arm around Steve's waist, pulling his body flush with Tony's. Steve makes a surprised noise and then just melts, body going boneless against the armor. He peels his hand off the wall and cups the back of Tony's head, pulling him close, like Tony isn't already putting the power of a thousand arc reactors into the kiss, like he doesn't have one arm clamped around Steve's back in a death grip. \nTony wants more, now, is practically frantic with his need to taste as much of Steve's mouth as possible, but Steve just kisses him slow and hard and Tony's basically helpless when it comes to giving Steve what he wants. He lets Steve drag his teeth over Tony's bottom lip, digging in and soothing with the glide of his tongue before he pulls back, just far enough to pull in a shaky breath.\nTony's eyes open first, so he gets to see the slow lift of Steve's lashes, has a moment to take in the pink flush of his cheeks and swollen lips, the way his bright blue eyes have gone half-lidded and dark. He sucks in a breath that seems to rattle around all the mechanics in his chest and says, \"Nice boys don't kiss like that.\"\n\"No?\" Steve says, and how can he sound that innocent with the things he was just doing to Tony's mouth? \"So how do they kiss, then?\" Steve's breathing is harsh and all of that Captain America determination is focused like a laser beam on Tony's lips, like he's already plotting how to do it right this time. \n\"How the hell should I know?\" Tony says, then slides his hand down to spread wide over Steve's ass and haul him in for another bruising kiss. Steve gasps into Tony's mouth, part laugh and part shock at Tony's manhandling. Tony presses one leg up between Steve's thighs and Steve lets out an indecent groan in the back of his throat. Steve's hips stutter forward at the contact and his mouth is hot and wet against Tony's, and Tony wishes he was out of the armor, wishes he could feel the hard length of Steve's cock pressing alongside Tony's when Steve gives another roll of his hips.\nTony thinks that Steve could get off like this, both of them fully clothed and Steve grinding up against the suit, oh god, and just the thought of it burns like white-hot sparks behind Tony's eyelids and makes him choke on his own breath. He tightens his hand on Steve's ass and urges him forward, more, then Steve moans high in his throat and his kiss turns a bit messy and wild, tongue pushing in, scraping past Tony's teeth, and suddenly all Tony wants to do is slide to his knees and suck Steve off, sloppy and wet, see if he can get Steve to lose enough of that careful control to pull Tony's hair and fuck his mouth. That's gotta be worth a thousand points, easy.\nAnd then the hangar door opens and Banner's voice says, \"Hey guys, are you—OH MY GOD, MY EYES.\" Then his heart monitor gives a distressing little beep, and he adds, sounding pitiful, \"And my blood pressure!\" \nAnd the last thing any of them need is for Banner to have a mortification-induced Hulk-out so Tony rips his mouth off of Steve's and shouts, \"Easy there, big guy!\"\nSteve just frowns a little and blinks at Tony with a foggy expression, then says, \"Wha? I thought you wanted—\" But then Steve catches sight of Banner with his hands over his eyes and says, \"—Oh, you meant—not me,\" and turns the appropriate shade of pink for someone caught enthusiastically riding Tony's thigh.\nTony's helpless snort of laughter almost drowns out Banner's pained whimper. Banner has one hand still covering his eyes, and the other is flapping about helplessly. \"Oh, don't get your big purple panties in a twist,\" Tony says. \"It's not anything you haven't already seen all the times I have to haul his star-spangled ass around as his personal flying chauffeur.\"\n\"Except your hands weren't ever on his ass,\" Banner groans, the big green drama queen. Tony just squeezes the hand that is still on Steve's ass, and Steve jumps. \"I feel like I just walked in on my parents having sex.\" \nAnd Tony can't pass up an opening like that. His grin is all teeth. \"So, did you need something? Because Mom and Dad are a little busy right now.\"\nSteve pokes him, which he can feel through the armor, how does he even do that? And Banner makes a sound like his brain is dying. \"If anyone cares, Fury's still waiting on you guys for the debrief,\" he says, voice a little thin and reedy. He doesn't wait for an answer, just wanders off mumbling something about needing to bleach his frontal lobe.\nTony opens his mouth to say he's at a debriefing of his own, or will be very shortly, and Steve gives him a quelling look. Tony is disappointed for a moment before he realizes he's dragged Steve's mind into the gutter along with his own, and he awards himself a point. He's pretty sure a new point system for getting Steve to think dirty thoughts is about to become his new favorite game."
}