{
    "id": "39458634",
    "url": "https://archiveofourown.org/works/39458634?view_full_work=true",
    "author": [
        "nondz (pinkjook)"
    ],
    "title": "the affliction of the feeling",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Stranger Things (TV 2016)"
    ],
    "relationships": [
        "Steve Harrington/Eddie Munson",
        "Robin Buckley & Steve Harrington",
        "Jonathan Byers & Steve Harrington & Nancy Wheeler"
    ],
    "characters": [
        "Steve Harrington",
        "Robin Buckley",
        "Eddie Munson",
        "Nancy Wheeler",
        "Jonathan Byers",
        "Argyle (Stranger Things)",
        "The Party (Stranger Things)",
        "Wayne Munson"
    ],
    "additional_tags": [
        "Mutual Pining",
        "black hanky in the back left pocket... eddie munson i know what you are!",
        "Shotgunning",
        "A Frankly Unrealistic Amount of Hanky Code Knowledge for Teens in Indiana",
        "this fic isn't about s&m as much as it's about exploring eddie's BOLD FACED LIE of being a sado top.",
        "Dry Humping",
        "Hand Jobs",
        "Blow Jobs",
        "Getting Together",
        "Steve Harrington Has Moves and Eddie Munson Likes Them."
    ],
    "language": "English",
    "series": "",
    "published": "2022-06-07",
    "completed": "2022-06-20",
    "words": "27,203",
    "chapters": "2/2",
    "comments": "917",
    "kudos": "22,145",
    "bookmarks": "4,724",
    "hits": "224,873",
    "summary": "<p>“Hold on,” Robin interrupts. “Hold on, is this— are you, like. Do you know what masochism is?”</p>\n<p>“I know I act like it sometimes, Robin, but I’m not actually fucking twelve,” Steve says.</p>\n<p>OR: Eddie has a black hanky in his back pocket.</p>\n<p>Eddie is a little bit high but definitely not high enough to be hallucinating.</p>",
    "notes": "<p>hanky code: black hanky (s&amp;m) back left pocket (receiving). mister the freak munson was wearing this in the 80s.. with handcuffs and lube by the bed... now, admittedly, i do not think costuming intended this. HOWEVER. i have accepted this as truth into my heart and i am running away with it.</p>\n<p>eddie munson i know what you are. and i wish you a very happy pride month.</p>\n<p>title from rihanna's s&amp;m because it made me laugh.</p>\n<p>EDIT: upon many MANY replies we have discovered that google, in fact, lied to me, and the hanky in the left pocket means eddie sado tops. upon reflection i think that is the funniest possible thing, in the whole world, that he could have lied about being. i will be addressing this in chapter two &lt;3</p>\n<p>wow. here we are i guess. please enjoy this fuckoff long chapter about eddie munson being in love with steve harrington !</p>\n<p>also, if you haven't been jamming to 'eddie baby' by felix hagan this whole time... where have you been. que that song up RIGHT now</p>",
    "text": "It’s a slow as shit Tuesday afternoon, and Steve is at work thinking about Eddie “the Freak” Munson.\nSteve’s life is such a fucking joke. Of course he’s thinking about Eddie Munson. Of course he is. \nEddie Munson, who is two years older than Steve and still finishing up high school. Eddie fucking Munson, with his long dark hair and his big grin and his long fingers. His big personality. Big enough to fill up an empty room.\nSteve bets, with Eddie inside, no house would ever feel empty. \nEddie’s got big doe eyes. They’re brown with lashes long enough to cast shadows on his cheeks. They’re real pretty. Steve has, on multiple occasions, wondered what they look like when they’re all glossy and wet. Fucked out. \nSteve misses sex, sort of. It’s hard to explain. Steve has sex every other week or so; sometimes with a girl he’s slept with before, sometimes with someone new. He’s not in a dry spell, or anything. No, Steve just misses  good sex. \nSex that makes his heart race, his toes curl. Makes his blood rush. His head spin. \nIt would probably be like that with Eddie. It would be  good with Eddie, Steve knows it. Eddie wouldn’t even have to like him in order to fuck him. Fucking is, actually, probably Steve’s most realistic option; Eddie and him are barely more than friendly acquaintances, and fuck knows Steve doesn’t have the best track record with anything else.\n Fuck, fuck, fuck, Steve thinks sourly, because he’s said the word so many times in his mind that it’s starting to sound funny. \n“Fuck, why won’t Eddie  fuck me, Robin?” Steve bursts, smacking his palm against the counter. \nHis words ring across the empty movie store and are absorbed by the soft VHS covers.\nRobin flicks over to a new page in her magazine. “Because he’s dumb, Steve. Dumber than you are.”\n“What am I doing wrong?” Steve moans. He drops his head down, buries it in his arms. Then he lifts it and drops it again. Then a third time.  Thud, thud, thud,  his brain rattling around in his empty fuckin’ skull, because what is wrong with him?  What is he doing wrong? \nRobin finally sets her magazine aside and leans her arms against Steve’s shoulders. She hunches over him comfortingly, the both of them stacked together behind the family video register. Steve huffs at her and Robin blows in his ear, making him twitch.\n“Eddie just, like, refuses to notice you flirting with him. It’s not you, babe, you’ve been doing great. Flirting up a fucking storm,” Robin says kindly.\n“I blew a popsicle in front of him, Robs,” Steve says, because  that  had been humiliating. He’d really given it his all, too. Put his lips and tongue against the blue, icy tip and then hollowed out his cheeks. It had been a show. He had looked  good. Steve knows he did.\nEddie hadn’t reacted at all. He had just turned around and rummaged through the trunk of his car for a minute, then turned back like nothing had happened.\nIn Steve’s more delusional moments, he comforts himself with the fact— hope— that Eddie had been blushing. Probably. \nThe stupidest thing Steve has  ever  done is blowing that popsicle. And he’s done a lot of dumb fucking shit.\n“I know, babe,” Robin tells him, because that’s their new thing. Her and Steve’s new thing; calling each other  babe. \nIt cracks them up. Nobody else gets it.\nThat just makes it funnier.\n“He’s just scared,” Robin continues. “He’s a self-confessed coward, Steve-o. Of course he’s not gonna make a move on you. Not on King Steve.”\nSteve breathes in very deep, his lungs heaving. Robin heaves with him, still laying on his shoulders, then deflates when he breathes out. \nHe takes another deep breath and lets out a muffled yell into the crook of his arm. \nIt makes him feel a little better.\n“I bet real kings get, like, way more head than I do,” Steve says. “Or at least more money.  And  they get a dead dad, too—  fuck, real kings have it so much better than me.”\n“They don’t have to work at Family Video, either,” Robin says. Her voice is very glum.\nIt’s real nice of Robin, to be melancholy and sullen right alongside Steve. It cements their best-friend status further, adds another tick into the  Steve ‘n’ Robin: Together Forever column.\n“Right?” Steve agrees.\nThey lay in their defeated heap behind the register together. They watch dust drift through the window light. \nWhen a pimple-faced kid stumbles through the door, neither of them move. They chorus: “Welcome to Scoops— wait, shit— welcome to Family Video.”\nThey never fucking get their welcoming spiel right. \nThe kid takes one look at them, stacked together behind the register, and turns bright red. He spins on his heel and leaves immediately. \n“Thank God,” Robin says.\n\n\n\n\n\nSteve’s main problem is that Eddie is sweet.  Majorly sweet; sweeter than coke or skittles or peach cobbler pie. Just genuinely fucking soft hearted.\nDeep down at the core of himself, Steve is a little mean. He’s come to terms with it, mostly because Robin and Nancy are the same way. The three of them are a little too ready to bear their teeth at people who might not completely deserve it.\nEddie’s not like that. Eddie is more like Jonathan, though every time Steve has that thought he crumples it up like paper and tosses it into the furthest corner of his head. It makes his skin itch. \nBut it’s true. Eddie is sweet. It’s just a fact. His hair is permed and he likes Black Sabbath and he’s got thirteen tattoos and he’s  sweet.  \nIt’s been a long time since someone was sweet to Steve. And Eddie is. Sweet to Steve, that is. He gives Steve these shy smiles, hiding his face behind his hair. He talks a mile a minute and calls Steve  Ozzy  whenever they meet up. He touches Steve’s shoulder, his wrist, Eddie’s fingers warm and flitting away quickly. Eddie waves frantically and jogs over to talk whenever they see each other in public. He’s fucking  excited to see Steve.\n“We saved the world together, Ozzy-O,” Eddie says.\n“Rock on,” Steve says back, and then has to throw his arm around Eddie’s shoulders and noogie him, because it’s that or kiss him.\nEddie’s so sweet it makes Steve want to be sweet right back— to put his mouth to Eddie’s collarbone and kiss him there. To tuck his hair behind his silver-studded ears. To drag his lips across Eddie’s cheekbone, his nose, over his forehead. Straighten out his shirt. Smooth out his bracelets.\nThey’re not best friends or anything, but they’re solid. Him and Eddie are new and fresh and  good in a way that Steve can’t help but pick at. There’s so much potential, Steve feels like a newly potted plant. Like there are new places he could stretch out and grow into. New things to become.\nIt’s been a long fucking time since Steve felt like he was  becoming something. \nIt’s a nice feeling.\n \n \nIt’s Thursday. Eddie Munson is in Mike Wheeler’s basement, hidden behind his dorky fucking folder, arms splayed wide and weaving a web of a story. \nSteve is also in Mike Wheeler’s  armpit of a basement— shit, Steve has to take Max out to a park or something, get her to throw a ball around with him, they’re both gonna get, like, jaundice doing this— and watching him. When Eddie grins, Steve’s heart thumps. When he cracks his knuckles before rolling his dice, Steve bites down a smile. Eddie fiddles with his hair. Steve licks his lips.\nIt’s pathetic. Steve is pathetic and he needs to stop. \nBut then, for a moment, Eddie lifts his eyes off his notes. He doesn’t look at Mike or Dustin or Lucas or Will, fresh from California. He doesn’t look at El and Max, huddled in the corner and sharing headphones. Eddie doesn’t look at any of them. Eddie looks at Steve, and Steve looks back. He thinks his eyes must be, like, fucking smoldering or something.\nEddie winks at him, flirty and dramatic and  not at all serious. And then he looks away.\nIt’s fucking  bleak, is what it is.\n“Oh, ouch,” Robin says, dropping onto the couch next to him. She hands him a coke. \nSteve groans and buries his face into her bony shoulder, pressing the cold can to his hot cheeks. Everything he does is embarrassing.  \nRobin pets his hair. “I know, babe.”\n“I’m killing myself,” he tells her. “Like, soon.”\nDustin whips his head up from his nerd notebook. “You’re what?”\nSteve ignores him. Robin does too.\n“If I were you? I would,” Robin tells him. She’s dead serious.  \n“Right?” Steve asks, because  fuck this is so fuckin’ sad.  \n “Not right, you guys, what the fuck!” Dustin cries. \n“Steve, are you good?” Will asks. Steve peeks one eye open and discovers him frowning, concerned. Next to him, Mike Wheeler is staring like he’s not sure whether to be upset or anxious or what. Lucas is nibbling nervously on his lips.\nThe girls keep ignoring them. \nSteve loves them most. \n“Aren’t you playing your nerd game?” He asks, lifting his head from Robin’s shoulder with a scowl. “Focus on that. I’m good. I’m going to kill myself, but I’m good.”\n“Hey, man, come on,” Eddie says. His eyebrows are furrowed together over his gigantic fucking Bambi eyes. Steve wants to, like, lick them. He wants to see them shiny and wet.\nSteve’s brain is so fucking  weird.  \n“Hel-lo  we are having a fucking  conversation  here!” Robin exclaims. She scowls at them, fiercely, and Steve squeezes her tightly in thanks. Robin is  so  the best. Steve, overwhelmed with warmth, kisses her temple.\n“We’re just concerned!” Dustin sputters.\n“Don’t be,” Steve says. “I’m kidding.”\n“I’d never let him do that,” Robin says reassuringly. “Not alone, anyway.”\n“Aw, babe,” Steve says, putting a hand over his heart.\n“We’re a two for one deal, Harrington, and you know it.” Robin rolls her eyes and crosses her arms over her chest. She’s wearing her black jacket with the patches, and new green plaid pants. There’s a silver chain hooked on them. \nShe’s so fucking cool. Steve loves her so much. \nRobin huddles into Steve’s side and Steve wraps his arms around her joyfully. \n“That’s, like,  not reassuring, Robin!” Dustin cries. \nLucas, Will, and Mike gaze at them, bug eyed, and Steve pinches his nose.\nAt the head of the table, Eddie chews on his lip nervously. After a moment, he clutches at his hair, pulling it across his face and twirling it between his fingers. Steve wants to touch Eddie’s hands. Wants to pull them down and then stroke Eddie’s hair back. Wants to soothe all that nervous energy. \nSteve thinks that Eddie would probably let him. Probably. He’s  almost  certain. But almost certain just isn’t fucking good enough. If Eddie would give him just  one  sign, literally  any sign at all—  \nHe doesn’t even have to blow any popsicles. Steve’s done all the heavy lifting. Eddie’s just got to fucking do fucking  anything— \n“What are we talking about?” Nancy asks, stepping delicately into the basement. Jonathan follows at her heels, his hands at her waist and a sort of big-eyed, stunned look on his face. \nSteve’s mouth twitches, despite his frustrated thoughts, because looking at them makes him want to smile. If Eddie makes Steve feel like a blossoming young thing, then Jon and Nance make him feel rooted. Planted deep into the ground. \nJonathan and Nancy being in the basement with them reassures Steve. Just a little. \n“Steve’s talking about killing himself,” Mike immediately snitches.\nIn unison, Steve and Robin groan.\n“It was a joke, Wheeler,” Steve says. “Take a joke. Also, Robin said she was going to, too.” \nRobin huffs. “We’ve got a joint suicide pact, Steve, why would I lie about that?”\n“Okay, woah, what?” Jonathan sputters. \n“Back up,” Nancy agrees.\n“We love you, Steve, don’t kill yourself,” Dustin says. He’s standing at the table fidgeting like he might come over and throw himself on top of Steve. \n“Do not come over here,” Steve warns him.\nDustin comes over anyway.\nHe rounds the table and leaps onto Steve and Robin both, the solid weight of him slamming into Steve’s chest and then settling with a  fwump  onto his legs. Dustin sprawls out on top of them like a too-large cat, and Steve raises his eyes to the ceiling and counts to ten. \nAnd then he breathes in deep and pats Dustin’s head.\n“Okay, first of all, I’m not going to kill myself. If I was going to do that I would’ve already done it. And I’m still here, so.” This reassures precisely no one, so Steve keeps talking. “Also, I don’t want to die. I promise. If I did, Robin would know.”\n“He’s good,” Robin promises. She gives them all a thumbs up and a crooked grin. \nRobin is the realest friend Steve has ever had. Because sure, fine, there have been nights where she’s had to come over and pull a bottle out of his hand. Draw the blinds for the windows that look out at the pool. But Steve’s done the same for her; pulled her inside out of the rain, shaking and crying, because she  thinks her mom knows, Steve, oh God, oh God, what am I going to do? \nRobin is the realest friend Steve’s ever had, and when push comes to shove, like it’s shoving now, Steve knows she’s going to take his secrets to the fuckin’ grave. He’s gonna do the same for her. \n“Hel-lo,  are we  playing  or  not,”  Eddie interrupts. He waves his hands back and forth, like,  look at me! I’m right here!  “Leave Harrington alone. Mike, you’re in the chamber, four enemies around you. Will and Dustin are off to the side, and Lucas is in front with—”\nBarreling on without any further input from the players, Eddie picks up where he left off. Steve tips his chin at him, a silent thanks, and Eddie gazes at him with his big brown eyes. \nAfter a moment, Steve needs to look away, because he wants to go over there. He wants to toss his arm around Eddie’s shoulders and sit on the arm of his chair. Heckle him while he speaks. Brush kisses down his chin. \nJon and Nance come and sit with their backs to the couch. Nancy tosses her legs over Jonathan’s thighs, and Jonathan’s long fingers stroke across them. Robin tucks herself further under Steve’s arm. Eddie stays over at the geek table, effortlessly commanding and entertaining Steve’s feral pack of nerds, and Steve watches him. \nEddie catches him doing it, of course. He meets Steve’s eye and grins like— like sunshine. So bright and stunning. \nAnd then Eddie looks away. Focuses on the kids. His eyes never stick on Steve like Steve’s do on Eddie. \n Yeah, Steve thinks. Pretty fucking bleak.\n \n \n“What I need,” Steve declares, one foot on a movie rack like a historic general, “Is a plan.”\n“For sure,” Robin agrees, mostly ignoring him. She’s focused on painting her nails dark blue; her tongue is poking between her teeth.\n“If I could just figure out what he likes, then I’d be in. I’ve just gotta… I just need to know what  works for him, you know?”\nRobin looks up from her nails. As soon as she does, she paints the brush across the counter and mutters  shit. She wipes at it with her thumb, but it just smears.\nSteve waits patiently.\n“Okay, pause,” Robin says, giving up on wiping the stain away. “You don’t mean you’re gonna, like… Okay. You cannot change yourself for Eddie fucking Munson. You’re better than that.”\n“No, Robin, of course not,” Steve dismisses, although in all honesty he wouldn’t put it past himself. But whatever. “I just mean, like… dressing up a little. You know? If I could just figure out what gets him hot…”\n“You blew a popsicle in front of him, Steve,” Robin reminds him. \nSteve’s cheeks heat. He flaps his hands at her then puts them on his hips. He opens and shuts his mouth four times in a row.\n“And if that didn’t do it, then I don’t think anything can,” Robin says. Her tone is so firm Steve almost expects her to follow it with  the prosecution rests.  \n“Some guys don’t like blowies,” Steve says, sullen and embarrassed. He’s talking out of his ass and Robin knows it.\n“You think  Eddie the freak doesn’t like blowjobs.” Robin’s tone is so incredulous that Steve’s cheeks burn hotter. \n“No, I bet he fucking  loves  them!” Steve presses his lips together and gives a muffled, frustrated yell then tosses his hands up. “Fine. Fine! I’ll give up. I’m pathetic and I  gave oral to a popsicle  to try to seduce him and I’ll just  fucking throw myself off a cliff.” \n“Okay, just for argument’s sake, let’s say Eddie isn’t gay,” Robin declares.\n“Right,” Steve says.\nA long pause comes. Robin taps her fingers against the blue stain on the counter. Steve chews on his lower lip. \n“He’s got to be gay,” Robin finally says. \n“Right?” Steve says again.\n“So then  why isn’t this working?”  Robin massages her temples like she’s got a migraine. There’s nothing Robin hates more than a puzzle that won’t fucking solve. A mystery without any solid clues. “It’s got to just be that he’s stupid. Like, that’s got to be it. Stupid  and a scaredy-cat. So even if he was picking up what you’re putting down, he would ignore it.”\n“Okay, woah,” Steve says. “A little mean.” \nRobin slaps her hand against the counter. “It just doesn’t make  sense!”  \nSteve heaves a deep sigh. He sits down on the ugly, brightly patterned carpet and stares up at Robin.\n“It might,” he starts, “possibly, potentially, be time to come to terms with the fact that he just doesn’t want to fuck me.”\n“No way,” Robin dismisses. “There’s another answer.”\nDrumming his fingers against the bottom of his shoe, Steve frowns. Thinks hard and long about Eddie and what might gag him. Thinks about his showboating, his cool-as-shit clothes, the way he took the nerds under his wing. Thinks about Eddie, repeating senior year three times. Eddie, flushing red and looking away from Steve. Looking away every time.\nHesitantly, Steve says, “Could he be… I don’t know. Embarrassed?”\n“Embarrassed about what?” Robin says.\nSteve shrugs. “Wanting things is humiliating. If you want something, someone can take it away from you.”\n“It’s vulnerable,” Robin muses. She’s quiet for a beat, tapping the heels of her converse against the floor. “Especially if you want something embarrassing.”\n“Fuck off,” Steve says. “Liking me is not embarrassing.”\n“Not that,” Robin says. “You’re a catch.”\n“Thank you.”\n“No, like… you know. The things Eddie likes.” Robin flushes and looks away.\nSteve stares at her. \"No, I don't know. What fucking things?\"\nRobin stares back, wide eyed, like she’s trying to communicate telepathically.\nNormally they kind of can. Talk telepathically, that is. But right now Steve isn’t picking up what she’s trying to put down.\n“Don’t make me say it,” Robin says. Her cheeks are a hot red, her eyes darting around.\nSteve whistles, long and low. “Damn, Buckley. I’m out of the rumor mill, mostly. I’m not keeping up. Did something go around about Eddie?” Because it must have really been something, the way her face is. All red and wide-eyed.\n“It’s, uh. Not a rumor.” Robin tugs at her shirt collar and presses the heels of her hands into her eyes. \n“Explain.”\n“The  hanky,” Robin blurts in a scandalized whisper. She looks around the empty store, at the motionless shelves of tapes, like she thinks a customer might be hiding.\n“The hanky,” Steve repeats, lost. He wracks his brains and comes up empty. But, wait. Hold on. “That’s like the gay bandana system, right?”\n“It’s the fucking hanky code, Steve,” Robin responds. She puts her head down, like she can’t stare at him and have this conversation at the same time.\n“So, Eddie’s gay. There’s our proof. Right?”\n“I mean,” Robin says. “That’s only if he knows what he’s doing.”\nSteve thinks about Eddie, twenty years old. Playing at bars and selling hard drugs out of his trailer. Grinning at Steve like that, knocking his chest against Steve’s shoulder, touching Steve’s bare wrist.\n“No, he definitely knows,” Steve declares.\n“Probably,” Robin says. “I’m, like, ninety percent sure. Eighty-five. Sixty at the lowest.”\n“Great,” Steve says dismissively, because Robin is avoiding something. Steve wants her to get to the fucking point. “Okay. So if we assume Eddie knows about the code and is doing his hanky-thing on purpose… What does his mean?”\nRobin bites her lip. Hesitantly, she says, “back left pocket means receiving.”\nSteve stares at her. “What, you think he’s embarrassed he likes to bottom?” Because that’s, like, not a big deal. Eddie wouldn’t be embarrassed about that— Steve knows he wouldn’t. It’s just practical, to put that preference out there. Makes it easier for everyone involved.\n“I wasn’t fucking done, dingus!” Robin blurts. She rolls her shoulders like she’s about to run a race. \nSteve stares at her, baffled.\n“The  black hanky. You know. The colors mean things. And the black hanky is for. Uh.”\n“It’s for…?” Steve prompts. \nRobin presses her lips together. Winces.\n“Okay, it cannot  possibly be that bad,” Steve says. \n“It’s for S&amp;M!” Robin finally exclaims. “He’s a masochist!”\nSteve stares at her. Robin stares back. \n“And you’ve known this the  whole fucking time?” Steve exclaims right back, throwing his arms up. “You couldn’t have fucking told me? Am I not a good wingman to you, is that it? Is that it? Is this payback for whatever fucking—”\n“Hold on,” Robin interrupts. “Hold on, is this— are you, like. Do you know what masochism is?”\n“I know I act like it sometimes, Robin, but I’m not actually fucking twelve,” Steve says. “It means Eddie wants to get smacked around or whatever.”\nRobin keeps staring at him.\n“And this is all  beside the point  because what Eddie likes during sex is none of my business unless I can get him to  sleep with me!” Steve finishes passionately. \nAfter another pause, Robin nods her head like  respect, dude. “I don’t know why it keeps surprising me that you’ve got hidden depths.”\nSteve shrugs at her. “I like sex,” he says with a wave of his hands. “We, like, all know this. I especially like  good sex. And if that’s what will make it good for Eddie…” Steve trails off. \nIt comes to him like a vision, a daydream so vivid it’s like he lives it: Eddie, beneath him, his skin a hot red. His wide brown eyes glossy. His cheeks glowing pink. Grinning and saying, fuck, Harrington, is that all you got? I can take it. Give me more, give me— Steve—  \nReluctantly, Steve pulls himself out of the fantasy, tucking it away for later when he’s alone in his room. He clears his throat. \n“Anyway,” Steve says. “Game plan, Robin. Come on.”\nBecause knowing what that hanky means does  exactly nothing if Eddie doesn’t want Steve. It does fuck all. \nRobin nibbles her lip thoughtfully, tilting her head from side to side. She hoists herself to sit cross-legged at the register counter, and Steve finally leaves his army-general perch against the shelves. He comes to lean next to her, his shoulder against her knee. \n“Okay, so. You smoke, right?” Robin asks, and Steve knows she’s just thinking out loud, because of course Robin knows he does. Weed, cigarettes. Steve isn’t picky. He’s been cutting down, because recently lung capacity and stamina have seemed  life-savingly important, but he’s never completely quit. \n“Yeah,” Steve says anyway. \n“Well, maybe pretend you don’t,” Robin tells him. \nSteve taps his fingers against his folded arms thoughtfully. “Go on.” \n“Tell Eddie you’ve never smoked before. He would  love to pop that cherry. He would, like, need to. Getting Steve Harrington high for the first time? He wouldn’t be able to resist.” \nNodding, Steve tells her, “I can do that. Then what?” \nRobin is really getting into it, now. Her eyes are all lit up and she’s thinking fast, talking even faster. Improv and scheming are two of Robin’s favorite things. She’s way better at them than Steve. \n“Obviously, you’re telling him this at a kickback where people are already smoking,” Robin says.\n“Obviously,” Steve agrees. “Am I in charge of throwing this party?”\n“I don’t know what other parties you think this is going to happen at,” Robin tells him. “And after you weasel your way over there and are your stupidly endearing self, and take a hit or two of whatever, you’re going to lean on him real cute and ask him what shotgunning is.” \n“Oh that’s good,” Steve says, pleased.\n“I know,” Robin says. “I’m a genius. But after that it’s up to you.”\n“You can lead an Eddie horse to water but you can’t make the Eddie horse thirsty, or whatever,” Steve agrees. \n“Exactly,” Robin says, because her and Steve share a brain. They have for pretty much the entire time they’ve known each other. “Eddie might not have realized that the other stuff was flirting. He might’ve thought you were, I don’t know, making fun of him. Or something. But I  guarantee you he’ll understand if you flirt with him like this. He’ll have seen it before. He’ll take it seriously.” \n“That’s all I need,” Steve says. \nAnd it is all he needs. He knows it. He just needs Eddie to realize what Steve’s asking for, what he’s  propositioning,  and then he’ll be… maybe not in. Maybe Eddie will say no. But he’ll be  done. For better or worse, he’ll be done with the pining and imagining and scheming. \nIt’s like he’s been standing on Eddie’s doorstep, nervous as a kid on his first date, waiting for Eddie. Just waiting and waiting, scuffing his shoes back and forth. With this shotgunning plan, maybe Steve will finally try the door handle and realize it’s locked and walk away instead of doing what he’s been doing, which is standing on the porch and hoping Eddie realizes he’s there. \nOr maybe he'll try the door and discover it's open. Maybe he'll be welcomed inside, be told to take off his shoes, his coat. \n“Well, Robin,” Steve sighs, leaning a little harder on her knee. “Looks like we’ve got a party to plan.”\n \n \nFour days later, Steve’s got everyone at his house— and by everyone, he means Nance, Jonathan, Jonathan’s friend Argyle, Robin, and Eddie. \nRobin, who had crashed at Steve’s the night before, single handedly prevents Steve from tearing his hair out while he sets up. They clean and laugh and shove each other into the pool, giddy and nervous. Or maybe that’s just Steve.\nA kickback in order to seduce a big-eyed curly-haired beauty; Steve’s done this before. It’s going to be totally fine.\nTotally.\nFuck, there is such a horrible precedent here. It’s making Steve lose it, just a little. \nThe sun is setting by the time the others start arriving. The sky is leaking orange like a cracked fanta can, the trees standing dark against the sky. It’s warm out, closer to sweltering than not, and Steve wipes his face with the bottom of his shirt. \nHim and Robin are sitting on the steps to his front porch, knees knocking. She’s got a lime green band-aid on her left shin. \nThere’s the low rumble of Jonathan’s shitty car, then the squealing of his brakes, and Steve tips his head back while smiling. When he hears three doors open, he calls out, “Come on in, Byers and friends.”\n“Steve Harrington!” Nancy calls joyfully, climbing out of Jonathan’s car, snagging Jonathan’s hand, and jogging over. Jonathan keeps pace with her and they almost tackle Steve in greeting.\n“Hey, guys,” Steve says, his throat feeling tight. \nNancy and Jonathan put their heads on either side of Steve’s neck, their arms around him like bands. Steve throws his around them, too, until they’re all holding each other up. \nYears and years, they’ve been in each others’ lives. Drifting together and apart and together and apart. Steve’s stopped worrying about it, stopped questioning it. He has faith, now, that the three of them will drift back together every time. \nSqueezing them a little tighter, Steve murmurs, “Be cool, but I need a favor.” \nThey freeze. Steve can feel the tension creeping up their spines and immediately he adds, “It’s nothing bad! Just, uh.” Steve clears his throat. Presses his cheek to Jonathan’s hair and then to Nancy’s. “Listen, if anyone asks, I’ve never smoked weed before. Alright?”\n“Steve,  what?” Nancy asks, the same moment Jonathan says, “Sure, whatever you need.” \n“Oh, I fucking love you, Byers,” Steve says. And then: “Please, Nance.”\n“Fine,” Nancy says, giving in. “But you’ve got to explain later, Steve, I mean it.”\n“‘Course, babe,” Steve tells her. \nAll three of them squeeze each other tight for another moment. Two, three. Steve only pulls away when he hears another car pull up, another door slam. \nFinally, they unravel from each other, and Nancy greets Robin just as enthusiastically as she greeted Steve, Jonathan hanging back but giving Robin a casual nod. Steve looks out at his driveway and sees Argyle leaning against Jonathan’s car, eyes on the sunset and a dazed smile on his face.  High already, Steve thinks, and snorts. \nArgyle is a fucking riot. Steve loves that guy— anyone who can loosen Jon up even a little is worth his weight in gold. \nBehind him, Jon, Nance, and Robin move inside, talking about something geeky. A news story or something. Steve tunes them out because then there’s Eddie.\nEddie is standing next to his car, staring at Steve and frowning. Steve’s heart thumps. It’s half dread— because fuck why is Eddie frowning  already—  and half excitement. Eddie is here, leather jacket on, jeans ripped across the knee, black boots tied up tight. \nThat black hanky is still hanging out of his back left pocket.\nEddie puts it there every day. He picks it up, tucks it in, and goes out with it every day on purpose. \nThere’s a lot of bravery in that. \nSteve lifts his hand and waves his fingers at Eddie, a sort of sardonic  toodle-oo, and Eddie finally cracks a smile. \nHe comes jogging over, giving Argyle a friendly smack on the arm as he passes. Argyle sways a little then grins, waving at Eddie then leaning back against the car, eyes once again on the sky. \n“Steve fucking Harrington,” Eddie exclaims once he’s close enough. His eyes are glimmering, mischievous and bright. He’s got a bag on his back, black canvas with pins and drawings in white sharpie, that rattles every time he moves. \n“Munson,” Steve greets, then pulls Eddie in for a hug, too. He can’t help it; he’s a hugger. He’s just got to grab and pull and squeeze at people. It’s what he does.\nEddie isn’t used to it yet. That’s fine. Steve is great at wearing people down until they accept his affection. He’s persistent and stubborn and bad at taking hints.\nHe squeezes tighter. He knocks their temples together. \nFinally, Eddie lifts his arms, backpack clinking slightly, and returns the hug. Softly, he places his hands on Steve’s back. Steve can feel his fingers twitch against his spine, out then in, like he wants to pet Steve but isn’t sure he can. Slow and steady, Steve drags one hand up Eddie’s ribs, then cups the back of his neck. Gives a firm squeeze.\nAfter a moment, Steve rocks them gently from side to side. Just a little. Barely any movement at all. Not enough to scare Eddie away.\nEddie fists his hands in the back of Steve’s plain tee. It pulls his collar tight, choking him a little, but Steve doesn’t care. He just holds Eddie tighter. Presses Eddie’s face further into his neck. \nThe tips of their shoes are touching. \nSteve takes one, indulgent deep breath— Eddie smells like cigarettes and weed and sweat, honestly a little rank, but also like cheap cologne and deodorant— before pulling away. \n“Come on in, dude,” he says, grinning so widely his cheeks hurt. “Mi casa and all that shit.” \nEddie stares at him for a moment, his brow furrowed, his hair ruffled. Steve stares back and tries to look cool, or at least friendly. \n“Alright, Harrington,” Eddie says, though Steve doesn’t really know what he means. Eddie continues with more energy, rocking back on his heels and grinning, a little manic looking. Full-up on frenetic energy, the way Robin gets, sometimes. “Show me what a party thrown by King Steve is like.”\n“Probably kind of lame,” Steve warns. “There’s only six of us.”\n“You leave it to me, Harrington,” Eddie says, clapping Steve on the arm. His hand lingers, long-fingered and warm, and Steve’s heart leaps. “I can get any party hoppin’.”\nEddie takes his hand off Steve and hefts the bag on his back up a little higher. It clinks and rattles, and Steve shakes his head. Wonders what Eddie has in there. Wonders how much trouble they’d all be in if they got caught.\nWhatever. It’s not like it would be the first time there was coke or weed or Jim Beam in Steve’s house, at one of Steve’s parties. \nSteve shoves at Eddie’s back and Eddie cackles.\n“Who even says ‘hopping,’ man,” Steve says.\n \n \nJonathan has followed Argyle into the fuckin’ stratosphere, high as all get-out, Nancy shaking her head at them both because weed makes her feel sick. She’s been pounding back her vodka soda, though, so Steve doesn’t feel too bad for her. They’re both sitting with their backs to the couch.\nSteve’s in the only recliner, leaned back and faking like he’s relaxed. He’s not sure it’s working.\nRobin and Eddie are sitting on the floor and passing a blunt back and forth over Argyle’s prone body; the guy is snoring fit to shake the house down, passed out with a bag of chips on his chest. \nSteve wants to be high so fucking bad but of course he isn’t yet. He’s faking weed virginity, so mostly he’s reclining on his makeshift throne, downing vodka lemonades with his arms and legs spread invitingly, and trying to look  interested  and not  desperate.   \nIt’s been a couple hours, two or three, and everyone is settled into the house. In Steve’s experience— of which he has a lot— this is the time that makes or breaks a party. When everyone’s high, or drunk, and a little bit bored. In the headspace where they’re willing to look at a bad idea with rose-colored glasses. Willing to look at a bad idea and think,  that looks fun. Besides, who’s gonna know?  \nThe trick is, of course, throwing out a bad idea. If nothing happens everyone will leave, drunk or high enough to get horny and tired. \nSteve is the king of bad ideas. Of tossing one out then hitting it out of the park.\nHe starts with: “Fuck, it’s hot in here.” \nRobin, who Steve genuinely believes is connected to him telepathically, says: “You know what sounds, like… Really good?” \n“What?” Steve says.\n“Grass. Being on… the grass.” Robin’s eyes are bloodshot. She’s staring at the ceiling like she’s counting the popcorn bumps.\n“Grass,” Jonathan sighs. \n“You’ve got a pool, right, Harrington?” Eddie says. He’s hardly high at all; apparently, he’s got an insanely high tolerance to everything. \n Fuck, this might work, Steve thinks, shocked. He takes a deep breath, meets Nancy’s eyes— more sober than he’d thought— and raises his eyebrows.\nIf Nancy doesn’t want to get in the pool, Steve won’t let anyone get in the pool. Easy as that. End of story. \n What do you think, Nance? He asks silently.\nShe stares back at him for a moment, her brow furrowed, the turn of her mouth sad. But then Jonathan touches her knee, and she covers his hand with hers, and she nods. Fuck it.  \nA bad idea, rose colored glasses. Hook, line, sinker, Steve has this in the  bag.  \nHe’s going to buy Nancy a brand new gun, holy shit. \n“Yeah, Munson,” Steve grins. “I’ve got a pool.” \n“Well let’s go then!” Eddie says, staggering to his feet. \nSteve kicks the footrest of the recliner down just in time for Eddie to stumble over to him and hold out a hand. Steve takes it without hesitating and pulls himself up with too much force, an excuse to bump into Eddie. \n Game time, Harrington,  he thinks to himself.  Keep it moving.\nHe fakes like he’s off-balance, letting Eddie hold him up while everyone else gets moving. They’re all grinning, eyes lidded low, cheeks red. Hair frizzy with alcohol and weed. Jonathan gently kicks Argyle’s side and Argyle wakes up with a jerk and a good-natured  woah, man! \nNancy and Jonathan troop out into the backyard hand in hand, Robin and Argyle following. They slide into an easy conversation, something about conspiracy theories, and Steve shakes his head at them.\nEddie is still, like, holding him up. Even though he’s got to know that Steve doesn’t need it, not really. \nSteve tugs at the bottom of Eddie’s shirt. “We swimming or what?”\nEddie’s eyes are low, and dark, and he sways close to Steve. Just for a moment. Their noses almost brush and Eddie looks intent. Focused. His eyes are twinkling. \nRefusing to move away, Steve meets Eddie’s eye. Keeps himself planted.\n“Yeah, Harrington,” Eddie finally says. “Let’s go swimming.”\nAnd then he throws his head back and laughs, cackles really, and Steve doesn’t get the joke but he smiles too. Eddie bounces on his toes, a weird little dance, and jostles Steve eagerly. He tugs Steve out of the house and into the back yard with an arm over his shoulders. Steve doesn’t fight it. He just goes, easy as anything, and when Eddie Munson throws his shirt off, Steve doesn’t look away. \nEddie empties his pockets out before he jumps in; baggies of weed, of cash, of DnD cards, white pills in bottles. \nWhen Steve sees the pills, he raises his eyebrows. \n“Just in case,” Eddie shrugs. “I don’t know, Jonathan seemed like he might want harder drugs.”\n“He absolutely does not,” Nancy interjects fiercely, from where she’s sitting on Jonathan’s lap in the slatted pool chair. \nEddie just cackles. He shakes his head and his dark curls fall over his bare shoulders. His jeans hang low on his hips; Steve can see his underwear, the thick band of it. He wants to reach out and snap the elastic against Eddie’s hips. Maybe with his teeth.\nInstead of doing that, Steve pulls off his shirt, too. \nHe reaches out to Eddie, presses his palm flat to the slightly concave part of Eddie’s chest. Eddie is a little thin in the arms, carries a little bit of weight in his hips. He looks nice. He looks healthy— Steve, abruptly, realizes he had been worried. \nWorried that Eddie might be too thin, or sickly-pale, or pockmarked with cigarette burns. Maybe it’s stereotyping, maybe Steve should feel bad about it, but he kind of thinks being worried is justifiable. \nEddie Munson is twenty years old and sells hard drugs out of the trailer he shares with his Uncle. That’s just facts. \nThey’re  worrying facts, if Steve is honest. He tries not to think about it too much. \nBecause Eddie is sweet. He’s just— he’s sweet. \nSteve’s hand is still on Eddie’s chest.  Shit, Steve thinks, then does what he had meant to do before, which is shove Eddie into the pool. \nEddie falls with a gigantic splash and a gleeful whoop. He bobs under then back up, sputtering and laughing, his hair hanging in his face. That beautiful large grin crinkling his cheeks. \nLeaping in after him, Steve clears Eddie’s head and lands in the water flat on his back, legs and arms all akimbo. He goes under, the water covering him, and he breathes out slow. Years on the swim team, a year as captain, and it never gets old. \nThe cold of the water, the muffling of noise. It covers him, a tangible and full-body feeling. He loves it. He fucking loves swimming. \nHe hasn’t gone swimming in a long, long time. \nAfter a moment, Steve kicks off the bottom and breaches, breathing in slow. When he opens his eyes, Eddie is right in front of him. \nThey stare at each other for a heartbeat. Two heartbeats. Eddie’s cheeks are pink, his lips are red. A bead of water slides down the edge of his nose. Eddie’s eyelashes are long, and dark, and clumped together. \nSteve kicks closer, wrapping an arm around Eddie’s waist and pressing their naked chests together. Skin on skin in the pool, like this, makes everything a little bit more. Makes Eddie feel warmer than he really is, his skin a little smoother. \n“Wanna play tag?” Steve asks. \n“What?” Eddie asks, and his voice sounds strange. Breathless.\n One tally in the You Rule Column,  Steve thinks.  Eat that, Robin.  \n“Tag,” Steve says again. “Come on. I’ll be it.” \n“You want to… play?” Eddie says hesitantly.\n“Yeah, come on,” Steve says, jostling Eddie a little. The water splashes. Their bare stomachs slide together. “You love games, dude. Let’s play one.”\n“I don’t play  sports games,” Eddie sputters, indignant for some reason. \n Why the fuck not?  Steve thinks, baffled.  Aren’t you like me, don’t you want this? Don’t you want an excuse to touch me all wet and shirtless? Don’t you want to get away with it? \nSteve doesn’t say that. Steve says, “Well, Munson, then tonight’s your night. I’m popping that cherry.”\nEddie stares at him with those big eyes, that smooth pale skin. “Cool.”\nSo they play tag. They race around the pool, shouting and choking on water, shoving each other down, pulling each other up. Skin on skin, cheek to cheek, their legs twined together with their jeans rubbing. \nDimly, Steve registers Robin and Argyle on their backs in the grass, still talking. Notes that Jon and Nance are still wrapped up in each other on the pool chair, playing with each others’ hands and whispering. Giggling. Occasionally glancing over at Steve, making sure he’s alright. \nOnce, Steve holds Eddie under the water for a split-second in order to give them a thumbs-up. Eddie wrestles him off and dunks him under the water a moment later. \nWhen he comes back up, Nancy is shaking her head and Jonathan’s eyes are squinting happily. \nHim and Eddie wrestle and play like puppies or kids, tumbling over each other in the water, shouting about nothing and everything. It’s fun. It’s just— it’s fucking fun. \nThis is something him and Eddie have in common, though they go about it in different ways; they both love to  play. \nBy the time they climb out, they’re shaking and panting and still grappling with each other. Eddie is hanging on Steve’s shoulders like a blanket, his hands skittering across Steve’s chest, and knocking their heads together over and over again. \nSteve tugs him over to the lidded basket where he keeps towels, spinning in Eddie’s arms in order to wrap one around his shoulders. Without hesitation, Eddie does the same to him.\n“Killer fuckin’ party, dude,” Eddie tells him, shivering like a small dog.\nSteve grins at him. “It’s lame as shit, man, but thanks for lying.”\n“Well, yeah, now that you say it,” Eddie agrees. But then he tosses his head back and cackles, big and bold the way Eddie is sometimes. \nThe kids, Mike and Dustin and Lucas, all insist that Eddie is larger than life.  So fucking cool, man, you should see him!  And Steve’s caught glimpses. More than glimpses; Eddie in the Upside Down, bashing monsters to death. Eddie with his guitar, wailing out into the red-tinted night. \nBut, mostly, Steve sees Eddie like he’s been all night: genuine, and sweet to Steve. Hunching his shoulders in and looking up at Steve through his hair. A strange vulnerability to his jokes, like he might be crushed if Steve doesn’t laugh. \nHe’s different, away from the kids. Away from the school. Eddie is different from his Freak Munson persona, the same way Steve is different from King Steve. \nIt’s not that those personas are lies, exactly; Steve knows first hand that it’s impossible to become a different person. King Steve is him, was him, will be him— cocky and energetic and full of life and too worried about what other people think. He is all those things. And, despite what everyone always says— Robin and Dustin and Nancy and even Eddie himself— Steve liked being King Steve. Not all the time, but mostly… yeah.\nKing Steve wasn’t a lie. Eddie “the Freak” Munson isn’t a lie either. \nBut it’s not everything. Steve knows that better than anyone. \nSteve takes a deep breath and thinks,  alright. Phase two. \n“I’ve got a confession, Munson,” Steve murmurs, leaning in slightly closer. It’s hard, because they’re already pressed together so tightly there’s not much empty space left between them, but Steve makes it work. \n“Lay it on me,” Eddie says, still grinning. “You know I’ll take it to my grave, man.” \n“I’ve never smoked up before,” Steve lies. Bold-faced and calm but feeling like his pants are on fire, the same way he did when he was fifteen and told his mom  oh, wow, I have no idea where those whiskey bottles went. I was spring cleaning earlier this week, maybe I moved them?  \n “You’ve  what?” Eddie sputters. His voice is loud and shocked, and Steve plays his part.\nHe waves his hands and shushes Eddie dramatically, eyes darting over to Jon and Nance, their foreheads pressed together, and Robin and Argyle, still in the grass. \n“This is a travesty, this is— this is a  crime, I can’t believe this,” Eddie says, already marching over to where he’d tossed his plastic baggies of shit.\nSure enough, he finds one stuffed with weed, the green buds full and tempting. Tucked into the bag is a grinder and papers for rolling and Steve watches, delighted, as Eddie sets up shop right on the towel basket’s lid.\nHe leans one shoulder against the back of his house, the brick scrubbing at his skin, and basks in his success.  Still got it, Harrington, he thinks smugly.\nQuicker than blinking, Eddie rolls them a fat blunt, perfectly put together and sealed. Steve is more than a little impressed. \n“Alright, here, hold on,” Eddie says. “So, like, okay. I’ll start it and—” He cuts himself off by lighting it, putting it between his teeth, and taking the first drag. He breathes out, long and slow, getting more jittery by the second. “So, okay. Here.”\nEddie steps closer to Steve and holds up his hand so that the blunt is near Steve’s mouth. \n“Breathe in and then hold it,” Eddie tells him. He starts strong but by the end of the sentence his voice is quiet. His doe eyes are wider than usual. Steve bites his lip, half to keep from smiling and half because he wants to kiss Eddie so fuckin’ bad, and that’s the only way he can think to stop himself from doing it. “Count to five real slow and then breathe out. Do, like, the Mississippis.”\nSteve leans forward, parting his lips just a little. He makes sure Eddie sees the flash of his tongue, the white of his teeth.  Please fucking let this be better than the fucking popsicle fiasco, Steve thinks, sending out a prayer to whoever the fuck wants to make it come true. \nHe wraps his lips around the blunt. He takes a pull, counts  one Mississippi, two Mississippi, and then fakes a coughing fit at four seconds. \n“You’re good, dude,” Eddie reassures him, rubbing Steve’s bare shoulder. His nails scratch at Steve, just lightly. Gently. \nSteve breaks out into goosebumps.\nSteve leans into him further, until his head is almost in the crook of Eddie’s neck, still pretending to cough. “Fuck, man,” Steve wheezes, and the hoarseness isn’t fake.\n“Yeah, I know, the first couple tries can take it out of you,” Eddie says kindly.\n“Mhm,” Steve says, watching as Eddie takes a drag, too. His lips curl around the paper, pink and full, and the blunt’s cherry burns red and hot for a moment. \nAfter, Eddie holds it back out to Steve. “Try again,” he says, and his voice is a little lower. A little slower. \nSteve looks up at him through his lashes. Meets his eyes while he wraps his lips around the blunt and takes another hit. He lets himself hold it for the full five seconds, this time, but he forces himself to cough right after. \n“Fuck,” Steve says, once he’s fake-wheezed for long enough, and Eddie licks his lips at the word. \nThey take another hit or two like that, pausing for longer and longer between drags, because Eddie doesn’t want Steve to get too high too quick. It’s sweet of him.\n So fucking sweet,  Steve thinks, a little blurrily. His tolerance isn’t what it used to be.  Strawberry milkshake type sweet. \n“If you were a food, you’d be a strawberry milkshake,” Steve tells Eddie, because why not? He’s supposed to be getting high for the first time. People who get high for the first time say the stupidest shit imaginable. Besides, it’s true. Eddie is a strawberry milkshake and Steve wants to suck him down. \nEddie flushes, one side of his towel falling off his bare shoulder. Steve can see his collarbones and he wants to put his teeth on them. \n“Thanks, I think,” Eddie laughs. He leans until he’s pressed shoulder to shoulder with Steve, both of them leaning against the brick of Steve’s house. \nThey’re still in sight of all the others, but it feels private anyway. Secluded. It’s a little magic, standing under the stars, still dripping from the pool, with Eddie Munson leaning into his space. Looking at Steve with those eyes of his. \n“Got a question for you, Munson,” Steve says, his heart pounding in his chest like it’s going to burst out and run away from him. \n“Shoot, King Steve,” Eddie tells him. His teeth flash in the dark. The blue glow of the pool lights his jaw and cheeks, turning him into something strange. Something beautiful.\n I’m gonna fuck him,  Steve thinks. And then, for the first time:  I’m gonna make him love me.  \nThe thought doesn’t scare him. It lights up something in his stomach instead.\n“Explain shotgunning to me,” Steve says, lazy and calm. \n“Well, it’s like. It’s when you. Like. Okay, so it’s like—” Eddie sputters, whole body rocking with sudden embarrassment. But then he pauses. Narrows his eyes at Steve. \nSteve stares at him, all apple pie innocence. Just a good-ol’ corn-fed Indiana boy who’s never heard of shotgunning, and who  certainly doesn’t know what Eddie’s black hanky means, good Lord, nothing to see here, officer. \n“Well?” Steve prompts, a little arrogant.  Are you calling my bluff or not, Munson? \nEddie stares for another moment, meeting Steve’s eyes with a furrow in his brow. Steve doesn’t look away. He gazes back serenely. \n“I’ll show you,” Eddie finally says. \nSteve strangles back a grin. Kills off the triumphant burst of laughter that wants to explode out of his chest. \n“Thanks, Eddie,” he says. \nEddie freezes with his mouth open. He licks his lips.\n“Fuck it,” Eddie breathes, then raises the blunt. Inhales. Leans into Steve, who meets him with his lips already parted. \nWhen Eddie breathes out, just a whisper away from Steve’s mouth, Steve breathes in smoothly. Effortlessly. \nWithout moving away from Steve, Eddie takes another drag. He holds it in his lungs and Steve can feel his chest expand. As he breathes out, Steve leans in closer, until their open mouths are pressed against each other and their teeth are almost touching. Eddie is tense, keeping his tongue pulled tight toward his throat, but Steve lets himself relax. Lets his tongue slide forward until it’s pressed lightly to Eddie’s bottom lip. \nHe gives it a lick, slow and firm, dragging from one side to the other. \n“You’ve done this before,” Eddie murmurs.\n“Yeah, no shit,” Steve says, and then kisses him. \nHe presses their open mouths together in a tight crush. It’s immediately wet, because Eddie’s not quite kissing him back, is mostly just standing with his lips parted wide, but Steve rolls with it. He wraps his tongue around Eddie’s and gives it a stroke. He presses in closer, feels Eddie’s nose dig into his cheek. \nA muffled noise erupts from Eddie’s throat, and then he’s kissing Steve back. \nEddie drops the blunt onto the ground and surges forward, throwing his arms around Steve’s shoulders. Steve takes it, catches him easily. He wraps his arms around Eddie’s waist in return, sliding his palm up Eddie’s bare back. \nEddie’s mouth is clumsy, too quick and too slow at the same time, and he pulls in and out like he’s not sure what he’s supposed to be doing. \nThat’s fine. Steve likes it, actually. It puts a fire in his stomach, makes his legs tense, thinking about how maybe Eddie’s never done this before— or, if he has, he’s so nervous Steve’s made him forget how to do it.\nEither option is fantastic. \nSteve takes a sharp breath in through his nose and then focuses. Eddie seems fine with the amount of tongue they’re using, so Steve keeps rocking with it— presses in and twirls their tongues together before pulling back, just barely, so that he can get their lips involved too. \nA good kiss has a lot of lip and a little tongue. \nSteve wants to give Eddie a good kiss. \nSo he does: he tips his head back and slides his lips over Eddie’s, sucks Eddie’s bottom lip into his mouth. Smooths his tongue over it in a hot long stroke. Pulls Eddie until he’s flush against Steve, pressing Steve into the wall. \nEddie wraps one of his calves around Steve’s and Steve hitches him upward until Eddie’s crotch is flushed with Steve’s thigh. \nAnd then, there it is: another noise from Eddie. A moan, drawn out and a little breathy.\n“Yeah,” Steve whispers.  “Yeah, just like that.” \nSteve tilts his head and kisses him again, licks in from a new angle. Pulls his tongue back and bites down, so gently, on Eddie’s lip. And then he tilts his head, chin scraping against Eddie’s, sliding his tongue back in. Long and slow strokes where he never pulls away, just keeps kissing and kissing and  kissing Eddie Munson. \nEddie, miraculously, keeps kissing him back.\nSo, like, okay. Eddie is a little bit high but definitely not high enough to be hallucinating. \nHe’s making out with Steve Harrington. Or, if Eddie is honest, Steve Harrington is making out with  him. \nSteve Harrington is hitching him up by the waist, his hands big and warm against Eddie’s bare skin, and gently pulling Eddie down to his thigh. Steve Harrington is sliding their mouths together over and over again, tongue slickly smart against Eddie’s own. One of Steve’s hands trails up Eddie’s side, over his ribs and up his spine, in order to grab him firmly by the back of the neck.\nThen Steve brings his hand to Eddie’s hair and  pulls, slowly. Firmly. Eddie’s knees buckle completely without his permission, and he lands a little more firmly on Steve’s thigh, and he can’t even be embarrassed because he’s too busy moaning into Steve Harrington’s mouth.\n Moaning. Him, Eddie Munson. \nThis is stranger than the monsters. This is stranger than— than— Eddie can’t even find a second thing to compare this to, because Steve is still kissing him and it still feels so fucking  good. Oh, shit, but it feels good, and Eddie tries his best to kiss Steve back just as smartly as Steve is kissing him but he doesn’t think it’s working. He thinks he might be a little bit bad at it. \nHe just can’t  focus.  \nEddie’s made out with people before, kind of. A little. High or drunk off his ass at a party two towns over, trading drugs for cash in someone’s back room or backyard. It was always fine. A way to pass the time.\nIt was never like  this, holy shit. \n“Oh, fuck, Steve,” Eddie says, and his voice comes out strange. A little too high, a little too breathless. It shocks him. It sends some weird jolt through his stomach and hips, like,  that’s me?  \nSteve just laughs and kisses him more. Eddie can feel the huff of hot air, damp and humid, in his open mouth. It makes him shiver.\nEddie shoves his tongue into Steve’s mouth in response, because he wants to— like, fucking— he wants to climb  inside  Steve Harrington, or something. He wants to get as far down Steve’s throat as he can, except that isn’t right, that’s  bad kissing etiquette, and that can’t be enjoyable for Steve. He’s got to make this enjoyable for Steve.  \nPulling his tongue back, Eddie tries to collect himself and goes in again. But that’s not quite right, either; he’s got a bad angle. Their chins knock together and it doesn’t hurt Eddie but maybe it hurts Steve. Shit, Eddie is fucking this up. \nSteve pulls Eddie away from his mouth by his hair. It makes Eddie’s vision go blurry. He winds up gasping into the open air and staring at Steve Harrington’s slick mouth. At his charming smile. \n“Relax,” Steve murmurs. “Relax, Eds, I’ve got you.” \n Eds,  Eddie thinks, baffled.  What the fuck.\nAnd then he just has to kiss Steve Harrington again. Because what the fuck? What the fuck. What the fuck? The whole night has been a fever dream. The whole fucking  week has been— this week where Steve Harrington has been looking at him with focused eyes, has been eating popsicles in genuinely insane ways— Eddie needs to kiss him or he’ll die. He’ll fucking die, that’s what it feels like.\nHe dives back in, mouth already open, tongue already out, and Steve huffs. Turns Eddie’s desperation into something warm and close and  good.  \nEddie wraps his arms around Steve’s waist. Their bare chests are pushed together tight. He almost wishes Steve was wearing a shirt. Just so he could have something to cling to.\nIt’s only  almost  a wish, though, because Steve’s skin is smooth and hot and turning Eddie the  fuck on. \nSuddenly a little bit frantic, Eddie shoves himself into Steve because he’s just not sure what else to  do. But he pushes too hard, or maybe Steve wasn’t braced for it, because Steve’s head knocks back into the brick of his house and Eddie pulls away with a panicked noise. \n“Ow,” Steve says. His hair is ruffled and his lips are wet with spit. Eddie thinks Steve’s got spit down his chin, too, and that’s definitely Eddie’s fault.\n“Oh, shit, I am so sorry,” Eddie says, horrified with himself. And he’s talking about Steve hitting his head, and his apparently awful kissing technique, and also some other third thing he should probably be apologizing for but can’t think of right now.\nSteve stares at him for a moment, just as unreadable as he’s ever been to Eddie, then smiles. It’s a gentle quirk of his lips, understanding and kind. It makes Eddie shake and shiver and want to fucking  die.  \n“It’s fine, man,” Steve tells him.\nEddie’s stomach falls out his ass. \n Man.  Not  Eds  or even  Eddie, like he’d used just a second ago.\n“Hey, woah,” Steve says, and he pulls Eddie back in. His arms are bare and strong, thick in that way Eddie’s been thinking about for weeks, ever since he saw Steve shirtless and ripping a monster apart with his bare hands. “What’s that face for, Munson?’\nEddie stares at him, baffled. Their chests and hips and thighs are pressed tightly together. They’re so close he can feel Steve breathing, the in and out of his bare stomach against Eddie’s own. \n“What, are you embarrassed?” Steve asks. “Because I, like, bonked my head? Dude. Shit happens.”\n“Don’t call me dude right now, Harrington,” Eddie says sourly. \nHe thinks Steve will probably laugh. Snort and shake his head, grinning that grin that’s not quite mean but not quite nice either. It's a hot fucking expression but Eddie doesn't want to see it, not like this. \nExcept Steve doesn’t. Steve looks at him, face calm and thoughtful— hadn’t  that  been a trip and a half, when Eddie first realized that Steve is a  thinker, is an  introspective person— and then Steve nudges their noses together. \n“Baby,” Steve says. Eddie’s heart  thumps. “It’s alright. I promise it’s fine.”\n“Say that again,” Eddie blurts unthinkingly. And then he commits to it, despite the humiliation, because that’s what he  does. Commits to incredibly embarrassing shit and makes it fucking work for him. “Say it… Say it again.”\nSteve Harrington— King  fucking  Steve, basketball star, swim captain, and  monster killer  Steve Harrington, what the fuck is going  on—  seals their mouths together. His lips are plump and soft and confident.\n“Baby,” Steve whispers.\n“Oh,  fuck,” Eddie moans, and then dives back into Steve. \nHe kisses Steve frantically, twisting his head and body, trying to squirm as close as possible. The weed is still buzzing softly under his skin, making Eddie feel hot and slow and tingly. He shoves his arms back around Steve’s waist, low on his back, thinks about trying to grab his ass but decides against it because he can barely focus just doing  this. Just kissing and wiggling against Steve’s body. Just running his tongue against Steve’s. He’s going out of his fucking head with it.\n“You’re such a fucking liar,” Eddie says, gasping, because Steve is, he  is,  and they need to kiss forever, what the fuck is Eddie doing? What the fuck is he even  talking about? \n“Yeah,” Steve agrees, tilting his head and coming back for another kiss. \n“Shotgunning,” Eddie pants, baffled, and squeezes his legs against Steve’s thigh. \nSteve laughs. He pulls away from Eddie’s mouth and starts nibbling at his neck, lips and teeth and tongue, and Eddie wants to fucking— like— cry or something because it feels so good.\nHe bites down hard against Eddie’s neck. Eddie bites his own lip because he feels like he’s going to explode. \n“Well I had to do fucking  something, Munson, you weren’t taking the fucking hint,” Steve tells him. \n“What the fuck are you calling me Munson for,” Eddie says, tipping his head back so Steve can kiss further down his neck.  Go back to Eddie,  Eddie thinks but can’t quite say.  Go back to Eds. Call me baby again, fuck me for even thinking it. \nSteve licks a long stripe up his neck, sweeping Eddie’s still-dripping hair over his shoulder. He sucks Eddie’s earlobe into his mouth, fiddles with his earring with his tongue. \n“Sure, Eddie.” Steve twirls the stud with his teeth and Eddie fucking— has a seizure or something. He  shakes.  “Baby,” Steve says again, and Eddie isn’t, like,  proud  of it but he whines.\n“Ears, huh?” Steve says, dragging his lips up the shell of Eddie’s. Eddie hadn’t even known he would like that, what the fuck is  happening.  “I can work with that.”\nAimlessly, Eddie thinks,  please, yeah, before there’s a sudden sound from behind him and his whole body freezes. \nEverything stops. Eddie’s heart, his lungs. He doesn’t breathe. He doesn’t fucking blink. The brick of Steve’s house and Steve’s stupid pale face swims in front of his eyes.\nThey’re outside. They’re at the party with Argyle and Robin. Jonathan and Nancy.  \nWhat the fuck is Eddie  doing,  what is he doing, what is he doing, what the fuck is  Steve Harrington doing—  \n“Breathe,” Steve murmurs. “Breathe. It’s fine. I can see them, Eds, I’m looking right at all of them, and it’s fine. We’re okay. Take a breath, we’re alright.” \nEddie clutches at Steve’s bare waist and tries to follow his directions.  Breathe,  Steve said, so Eddie does.  We’re alright, Steve told him, and Eddie tries to believe it. \n“What are you doing, Harrington,” Eddie says. His voice is too soft to sound mean. Too confused to sound accusing.\nSteve sighs. Pulls Eddie in for something that’s almost a hug and then starts untangling their limbs. \n“You want pizza?” Steve asks. “I want pizza.” He steps to the side, out from under Eddie’s body, and the night air is suddenly cold against Eddie’s bare chest.\nEddie’s heart drops right down into his stomach acid, where it gets, like, fucking  boiled. That’s the only explanation for why his chest suddenly hurts so bad. For the way his throat suddenly feels tight. \nBut then Steve snags Eddie’s hand, tugging until Eddie’s hand is tucked into the curve of Steve’s bare waist, and suddenly Eddie could fucking fly. Could sing a hundred fucking ballads.\n What are you  doing,  Harrington, Eddie thinks. He doesn’t say it, though. Not again. It hadn’t been the right thing to say— Steve pulled away after. Eddie had fucked up, fucking dumb as shit like he always is. \nHe holds Steve’s waist and tries to feel like he’s not clutching at it. \nMustering every bit of his courage— and Eddie fucking  has it,  he has a  lot  of it, he deals meth on the weekends and he’s fought monsters and he isn’t a  fucking coward— Eddie finally turns around. Looks out at Steve’s yard and the people in it. \nRobin and Argyle are still laying in the grass, off in their own universe, staring at the stars. Eddie glances at them nervously then looks away, trying to breathe normally.\nThe loud thud had, apparently, been Nancy and Jonathan Byers accidentally tipping over a tiny table for drinks next to their chair. No big deal. But they’re  looking  at Eddie: glancing over, then at each other, and back over again. Eddie rolls his shoulders back and straightens his spine before he realizes, wait. No, they’re looking at  Steve. \nSomehow that’s worse. He’s not sure why it’s worse, but it is. \nEddie huddles in a little closer to Steve, tucked just slightly behind his shoulder, his hand still on Steve’s waist. \nLike, sure, Eddie fought monsters with Nancy Wheeler. He had an absolutely horrible fucking two weeks with her and the Party and Robin while he was hunted by the police, and— and whatever. Whatever. That doesn’t really matter. That’s not important right now. Those horrible two weeks aren't important.\nNancy Wheeler and Jonathan Byers are  Steve’s, is what Eddie is trying to get at; they’re Steve’s people. Eddie has no clue what he’s supposed to do right now. How Steve is going to work this. What he’s supposed to say, if he’s supposed to say anything at all. \nMaybe Steve does this all the time, brings guys to his house and kisses them against the wall by his pool where everyone can see. Maybe Steve’s never done this before and they’re both going to get run the fuck out of town. \nEddie doesn’t really think Byers or Nancy would snitch like that. Not really. But he just doesn’t fucking  know. \nAnd then Steve— Steve fucking. He tugs one of Eddie’s arms, then the other, wrapping them around his stomach until they’re walking while Eddie hugs him. Eddie blinks rapidly, feeling struck stupid, like Steve smacked him over the head with something, and then tightens his grip. Rolls with it, because the alternative is letting Steve go and he is  not doing that. He’s stupid but not that fucking stupid, thanks.\n“You guys hungry yet? I’m thinking pizza,” Steve announces when they’re closer. Eddie leans a little over his shoulder. \nByers and Nancy stop pretending not to stare at Steve and just gawk at him outright. \nSteve gives them a beaming smile, beatific and a little smug, and Eddie’s heart twists in his chest like larvae-filled eggs. Or something. \nIt’s gross, is what Eddie means. \n“Pizza,” Nancy Wheeler says, squinting. She’s tapping her fingers on Byers’ leg, a quick rhythm that looks a little irritated. “Were you planning on  pizza  this whole night, or is this an impulse buy? Because it would be really  irresponsible if it were.” Wheeler pauses, then adds as an afterthought, “Financially, I mean.”\nSteve rolls his eyes. Eddie stares between him and Wheeler, baffled. Is he the pizza? Is that what they’re talking about?\n“Yes, this was the plan, Nance. Ask Robin; the whole reason we threw this party was so I could… order pizza.” Steve bares his teeth at her. \n“Okay, relax,” Byers interjects. \nSteve and Nancy both huff. \nEddie chews his lip nervously, wondering if he should let go of Steve and go lay down by Robin and Argyle. \n“Of course it’s fine if you… order pizza, Steve. We would never have a problem with that.” Byers stares up at Steve with Wheeler on his lap, his eyes big and genuine. Steve stares back at him, softening slightly, and Eddie thinks bitterly that Byers has stupid hair. Really fucking stupid. \n“It just would’ve been nice to have known you were going to order it tonight,” Nancy Wheeler says. She throws her hands up, scowling like Steve's purposely... Eddie doesn't know. Kept some big secret from her, maybe. Lied to her or something. But then she seems to catch herself. She blinks a couple times, kind of fast, and then starts laughing— either at Steve or herself, Eddie doesn’t know. \nHe is, like, so fucking confused.\nHe’s even more confused when Steve starts laughing, too. \n“What, you wanted to help me pick the toppings?” Steve says. He’s full of good humor, eyes bright, shoulders relaxed. Eddie wants to fucking bite them, sink his teeth into the meat of him. \nWhat the fuck is wrong with him, holy shit. \n“Yes!” Wheeler wheezes back, overcome with giggles. She’s fucking tearing up and Jonathan starts laughing, too. “I didn’t know you were going to put—” she glances at Eddie. Eddie smiles at her, his Freak Munson  smile, the big and bold and flashy one.  “Anchovies on it!”\nFucking anchovies. Wheeler’s just called him anchovies. \n“Okay, I am at least, like, fucking pineapple,” Eddie complains. \n“You can be whatever you want, Munson,” Steve says, condescending like he is sometimes. “Don’t ever let anyone tell you different.”\n“Not even Nancy,” Byers agrees, and fine.\nFine. \nEddie starts laughing, too.\n \n \nEddie has this weird, vague hope— he’s not calling it a fantasy, or a daydream, because that would be insane— that he’ll get to sit on Steve’s lap while they eat. \nHe doesn’t, of course.\nRobin Buckley beats him to it. \nAfter Steve and Nancy’s weird fucking showdown, Steve goes inside, orders pizza, then drags another pool chair over so that they can sit by Nancy and Byers. He pulls Eddie down next to him and they sit pressed together, their wet jeans rubbing and bare arms brushing, while Wheeler and Byers try to explain something convoluted about… housing development? \nThey’re investigating something. It’s on the edge of town, further out than even the trailer park, and Eddie never wants to see another fucking monster again so he mostly tunes them out. \nIt’s thirty minutes until the pizza guy rings the doorbell. Steve stands to get it and they all shuffle inside, Nancy and Byers going to retrieve Robin and Argyle from their prone positions in the grass. \nEddie just kind of… stands and watches them do it. He’s not really sure what to do with himself.\nDoes he pretend he wasn’t just making out with Steve Harrington?  No idea what you’re all talking about, get off my ass, pass me another slice of pepperoni? Does he brazen it out? \nThey all head inside before Eddie can figure out what to do, which is typical. Eddie panicking and hesitating while life happens around him, passing him by while he’s stuck in one spot. \nHe follows them inside. What the fuck else could he do?\nAnd there’s Steve, in the warm yellow lights of his weirdly empty home, boxes of pizza on the table. Hefting plates down from cabinets. Robin shakes herself and then goes to help him. After a moment, Nancy Wheeler walks over, too, pulling down cups. Finding napkins. \nArgyle is leaning on Byers, grinning, and Byers is shaking his head, looking endeared.\nEddie fidgets. He shifts from foot to foot, tugs on his hair. Wishes, suddenly, to be wearing a shirt. \nThey all grab plates and slices of pizza and troop into the living room. They find their spots again; Wheeler and Byers on the couch, Argyle on the floor, Steve in his recliner. \nHe bites his lip. Hesitates. \nBefore Eddie can muster up the courage to go to Steve, sit on the arm of his chair or— if he’s really fucking bold, if he digs deep and finds that  Freak Munson  energy— on Steve’s lap, Robin swans past him and flops onto Steve. He catches her without so much as blinking.\nHe wraps her up in his arms, still bare-chested, and those puckered scars on his sides glimmer in the living room light. Robin tucks herself in, her shoulder under his armpit, her nose near his neck. Her eyes are still bloodshot. She goes to town on her slice of pizza; she almost finishes it off in two bites. Robin holds the last of the slice out to Steve, who takes a sloppy bite of it. Sauce goes down his chin and Robin cackles, then swipes it off with her fingers. She stares down at her dirty hand, confused, before wiping it on Steve’s jeans. Steve just rolls his eyes at her. \nIt makes Eddie feel… \nIt just makes him feel. That’s all. \nInstead of sitting on Steve’s lap, Eddie sits next to Argyle on the floor. He dodges Steve's eyes by ducking his head and focusing on his pizza; Steve is trying to silently tell him something, but Eddie doesn't want to know. Doesn't want to figure it out. He tries to not stare at Steve and Robin, sprawled out so comfortably he thinks they must sit like this all the time. He doesn’t look at Wheeler and Byers, either, sitting shoulder to shoulder and sharing a plate. It’s balanced between both their knees.\nSomeone, somehow, started a record when they came in. Probably Steve. It skips and scratches, stutters over the same phrase.  And my baby leaves— my baby leaves— my baby leaves. \n“You need to smoke some more, man,” Argyle drawls from Eddie’s left. “You’re making an absolutely tragic fuckin’ face right now.” \nEddie opens his mouth. Shuts it again. \n“Yeah, probably, man,” he sighs. \nBut before Eddie can stand up, go find his weed and his shirt and his dignity, Steve says, “Alright, Robs. You’re the light of my life, but get up. This is Eddie’s spot.” \nEddie freezes. His cheeks get hot, then hotter, until he thinks he must be glowing apple red. The pounding of his heart turns faster, twisting excitedly in his chest like a wriggling puppy. \n Eddie’s spot. Fuck.\nHalf covering his face with his hair, Eddie stares up at Steve and Robin. \nRobin looks high as all hell, eyes red and drooping a little, and she mouths to herself for a moment before gasping. She claps her hands over her cheeks, like she’s mimicking Munch’s  Scream,  and says, “Oh my God! Oh my God, I am so sorry.” And then she’s  diving out of Steve’s lap.\n“Oh, shit, Munson, sorry!” Robin apologizes again, tripping over herself and landing on her ass. She spills pizza onto the carpet and scoops it up, wincing. Dimly, he hears Byers and Nancy snickering.\nEddie watches her, baffled, beating back an odd swelling sensation in his chest. \nSteve grins at Robin, like he’s trying not to all-out laugh, then turns to Eddie. His eyes go liquid, smooth and shiny. “You coming up here?”\nSomehow, Eddie climbs to his feet. It feels like his legs are a bunch of blocks precariously stacked together. Like he could collapse at any moment. He clutches at his plate of pizza like he would a life-raft in the ocean.\n“You don’t actually have to sit on my lap,” Steve murmurs, sweetly and just to Eddie, once he gets close. “I just… You were looking pretty blue.” \n“I was not,” Eddie denies, even though he very definitely was. He’d felt, like, fucking heartbroken about sitting on the floor.\nBefore Steve can argue with him, or change his mind, Eddie flops down on top of him. His arms and legs kind of go everywhere, flailing, but Eddie just makes it into a big show. Just to save face. He’s leaning further and further into the performance, into  Eddie the freak  and he can’t quite stop it. Doesn’t think he  wants to stop it— if he does, he won’t do anything at all. \nSprawled on Steve’s lap, he glances around the room nervously. They’re all ignoring him, too high or drunk to care about anything except eating. Or, at least, they’re pretending like they are.\nEddie picks up his pizza and accidentally squishes the cheese around. Sauce gets on his fingers and he holds up his hand, disgruntled, like  look at this shit. He’s still on Steve’s lap trying to look comfortable. It’s probably not working— he’s holding his spine so stiffly he thinks it might snap. \nFrom behind his shoulder, Steve gives a little huff. Eddie glances back nervously and discovers that Steve’s shaking his head a little, something warm on his face. He reaches out with a napkin and, gently, grabs Eddie by the palm. With one long swipe, he cleans the sauce off Eddie’s fingers.\nAnd then Steve kind of… doesn’t let go of his hand. Which is fine. Better than fine. Great! Eddie is down to hold hands. He's the world's best handholder, or whatever. Or he could be. Or something.\nWhen Steve starts to massage his hand, thumb pressing hard into the meat of Eddie’s palm, Eddie’s spine goes loose. With one last glance around at everyone, Eddie thinks,  fuck it. He tips his head back onto Steve’s shoulder. Tries to relax his abdomen. \nThey are both still, still,  fucking still shirtless. It’s great. It’s the best. \nEddie’s dick is fucking hard. \nIt’s not a surprise, exactly, because that had been the best kiss of his life and  Steve Harrington  is currently shirtless and pressed along his back. It’s just embarrassing, is all. To be hard in front of everyone. He’s shirtless and in wet jeans, so there’s not much  camouflage  happening. It’s not that obvious, not yet, but if he gets harder it’ll be easy to spot. Not that Eddie thinks they’re looking— none of them are, they’re all occupied with their pizza and each other— but  he knows. Eddie knows.\nIt makes his heart race in his chest. Determinedly, Eddie grabs his pizza with his other hand, because like fuck is he making Steve let go of him, and takes huge bites of it. Really hams it up, tries to make it funny, because there’s no  attractive  way to eat food like this. He wishes, distantly, that there were. That Steve would look at him, doing something so normal, and think  wow. But there’s not and he knows it, so Eddie tries to make it entertaining instead. \nHe’s good at entertaining people. At making them look at him. He can make Steve look at him, too.\n“You’re a clown, Munson,” Steve says, smile in his tone, and that’s not  quite what Eddie had been going for, but. Close enough. \nSteve doesn’t let go of Eddie’s hand. Eddie takes, like, great fucking pains to not move away. \nSlow, tight circles are pressed into Eddie’s skin. They’re calm and consistent, and Eddie lets the last of his weight rest fully on Steve. When Steve digs his thumb into Eddie’s palm, getting at some sort of knot, a low throb pulses through Eddie’s hips. It’s like his dick and hands are directly linked. \n“Shit, Harrington,” Eddie murmurs, turning his face into Steve’s shoulder. His nose is almost touching Steve’s neck and Eddie tries not to squirm. He’s overwhelmed by feelings; embarrassment, affection, a strange type of skin hunger that he can’t quite stifle. \nSteve’s bare chest against his back is setting him on fire. He wants more of it. He wants more of it  now. \n“Shit, Harrington,” Eddie says again. And then the words tumble back out of his mouth, like he’s been hit with a truth spell. Irrepressible and vulnerable and so completely  wrong, because Steve hadn’t wanted to talk about it before. Why would he now? \nBut, like an idiot, Eddie murmurs, “What are we doing?”\nSteve straightens up. Eddie can feel his back bend, stiffen, and hates himself.  Fucking idiot,  Eddie thinks.  You’re so fucking stupid, Munson. You’re so fucking stupid.  \nThe thoughts come on so fast they’re like flood water rushing through him, but after the initial flinch Eddie shakes himself.  Shut the fuck up, he thinks. \nWhen Steve responds, he’s so slow and calm about it Eddie almost misses the words. \n“I didn’t answer earlier because I thought you knew,” he tells Eddie. His voice is so fucking warm; Steve is such a warm person. Homey and comforting like a fucking bonfire. “I thought you were teasing me, man. You really don’t get it?”\n“No,” Eddie says, and his voice breaks a little. He clears his throat to try and cover it up, but the damage is done. \nSteve nudges his nose along Eddie’s hair. His lips shove against Eddie’s forehead hard enough that it’s not really a kiss. It can’t really be anything else, either.\n“I’ve been flirting with you for, like, weeks. Eds, I gave a popsicle a blowjob just so you would look at me— and you  didn’t, by the way. It was humiliating.” Steve clunks his cheek against Eddie’s head in a gentle reprimand. “I literally faked weed virginity. Robin had to come up with the plan. I’m such a mess about you, dude.” \nHe just—  says all of this. Here on the recliner with Eddie in his lap, at this lame-ass party where everyone might hear him. Byers and Nancy and Robin and fucking Argyle are, like, three feet away. \nThere's music playing, giving them a little bit of privacy, but still. Still. \nEddie almost wants to laugh. Fuck, but Steve is so fucking brave and he doesn’t even seem to  realize it. Bold as brass tacks, that’s what his Uncle Wayne would say, and Eddie’s never known what the fuck his Uncle Wayne meant by that but maybe now he does.\n“I, uh. Did not know any of that,” Eddie says, a little belatedly. \n“Well, it’s true,” Steve says, and Eddie can feel him shrug against his bare back. \nThis whole night ranks in the  Top Five Fucking Weirdest Nights of Eddie Munson’s Life and it’s not even midnight. It’s, like, ten. \n“Great,” Eddie says, baffled. \nEddie chews his lip and tries to re-process the last few weeks. Tries to re-categorize his and Steve’s interactions in his mind.\nWhen Steve greeted Eddie with his beaming smile, hugging him with his nose pressed to Eddie’s temple, that was because Steve liked him.  Likes him. Steve heckling him at DnD sessions was flirting. Steve staring at him with hooded, dark eyes, wearing Eddie’s vest like it had always belonged to him… Steve, with that blue popsicle in his mouth. Steve fucking Harrington, shoving Dustin off a couch just to sit next to Eddie. \nA sigh from Steve breaks him out of his thoughts. \n“Alright,” Steve says, his tone wry and strange. Full of some dry, gallows humor that Eddie has only heard from him a couple times before. “Lay it on me, man. I promise I won’t get mad.” \n“What?” Eddie says. “Lay what on you?” \nThere’s a moment of hesitation. For the first time the whole fucking night, Eddie gets the impression that Steve is working himself up. Digging deep and planting his feet. \n“Just… whatever it is you need to say. You know.” Steve lets go of his hand and leans to the side a little, so they can see each other's faces fully. Eddie is still on Steve’s lap but, suddenly, Steve feels like he’s on the other side of the room. “You’ve been real quiet, is all I’m saying.”\nEvery thought Eddie’s ever had flies out of his brain. Escapes through his ear holes, or something. He spins in Steve’s lap, overturning his empty pizza plate. He’s not-quite straddling Steve, now, but he can’t register that— he’s caught in a strange panic, a sensation like sand or water slipping through his fingers. Like Steve is slipping away from him. \n“You’ve gotta know I’m obsessed with you,” Eddie blurts. “Like, all the time I’m… I’m thinking about you, you know?”\n“How the fuck would I know that,” Steve sputters. “You barely look at me! I mean, Eds,  Eddie, I am fucking thrilled to hear it, you don’t even know, but— you kept your cards pretty close to your chest, dude.”\nEddie opens and shuts his mouth. Memories rewinding like VHS tape: Steve reaching out, Eddie pulling away. Averting his eyes. Trying not to laugh too loud, too long, at the stupid-funny jokes Steve came out with. Mocking Steve, occasionally, just in case. Just to cover his tracks. \nHe’d just been trying to… Eddie doesn’t have a ton of genuine friends. Lackeys and DnD minions and people he deals to on the odd weekend, sure. But a friend like Steve? So genuine and steadfast and steady?\nEddie had tried so, so hard not to make Steve uncomfortable. Not to fuck up a good thing. Until this moment, he’d been pretty proud of his efforts.\n“Oh, shit,” Eddie says, mentally reviewing all the times he had, apparently, rejected Steve without even knowing. Fuck, but in hindsight some of those accidental rejections had been downright  mean.  \n“I didn’t know, man,” Eddie tells him. He’s desperate for Steve to believe it. “I really didn’t, I swear. I wouldn’t have done… most of the shit I’ve been doing if I did. You’ve gotta believe me.”\n“I believe you,” Steve says. Eddie nervously meets Steve’s eyes, but Steve doesn’t look mad. Doesn’t look resentful or anything. Mostly, he looks relieved, and like he sort of wants to laugh. “I believe you, baby, it’s alright.”\n Baby,  Eddie’s earned back the word  baby.  It’s better than  dude  or  Eddie  or even  Eds. It’s so flattering, so tender, that it makes Eddie shiver. \n“Dudes,” Argyle calls, and immediately Byers, Nancy, and Robin are hissing  shut up, oh my God.  \nSteve and Eddie freeze in perfect unison. \n“What?” Argyle defends. “They just look like they need more weed, dudes, I’m trying to be a  pal  here. Like, you know. Get everyone  vibing.” \n“Wow,” Steve says, and his voice is louder than it’s been. He’s talking to the whole room, his voice defensively wry. “Well, this is just… humiliating. I thought the music was, you know. Loud enough you couldn’t hear us.” \n“We turned it down,” Robin says. “Sorry.” \nOut of the corner of his eye, Eddie sees Steve staring at her. Eddie looks nervously between Byers and Nancy. They’ve got guilty looks on their faces and matching apologetic grins. Argyle looks fucking cooked— eyes red and hair frizzy. \nAt his back, he can feel Steve start shaking. A jolt runs through Eddie and he shifts, concerned, but realizes Steve is only laughing. \n“Of course you fucking turned it down,” Steve says, stomach heaving. Eddie can feel it against his naked side, feels their bare skin brushing.\nHelplessly, Eddie grins. He couldn’t contain it if he tried. \n“Fuck, Argyle— yeah, man,” Eddie says. He shakes his head, still laughing. Steve leans up and forward into Eddie’s side, slinging his arms around Eddie’s waist. He buries his head into Eddie’s shoulder, absolutely cackling. “Give me the fucking blunt.”\nSteve keeps laughing and Robin follows him into hysterics. He rocks Eddie side to side, clinging, and Eddie tips his head back in order to push his forehead against Steve’s temple. \nArgyle holds out two blunts, one half-smoked and the other freshly rolled. “Keep these, dudes,” he tells them. “I’ve got, like, four more rolled.”\nEddie stares at Argyle, baffled, while Byers throws his hands up and Nancy pinches her nose in order to hide her smile.\n“Shit, man,” Eddie says, shaking his head. The motion rubs Steve’s hair against his cheek. “Pizza delivery must pay super fuckin’ good, huh?”\n“It doesn’t, that’s the thing,” Jonathan Byers says. “I don’t know how he fucking does it.” He’s got this look on his face, like he turns this over in his head on sleepless nights. Like an irrational part of him thinks Argyle might be some sort of magic, and able to summon blunts at will. A weed wizard.\n“I grow it, man,” Argyle says. “I thought you knew that.” \n“How the fuck would I know that?” Byers asks, an echo of Steve. \nRobin and Steve keep cackling. Nancy shakes her head and Eddie leans back against Steve, accepting the blunts and the lighter Argyle offers him. \nEddie puts the lit blunt between his teeth. He breathes in. He basks in the hot burning, the slight fuzzing of his limbs, the feeling of Steve’s naked skin pressed against his own. \nSteve’s hands slide across his stomach, calluses catching slightly at the hair on Eddie’s lower belly. His fingers stroke back and forth, just above Eddie’s belt. \n Fuck,  Eddie thinks.  Fuck.  \nHe twists a little. Holds the blunt up to Steve’s mouth.\nSteve grins at him, white toothed and mischievous, his eyes twinkling. He takes the hit like a champ, no coughing in sight. \n Fuck, Eddie thinks for a third time.\n \n \nThe six of them end up sprawled on the floor, puffing and passing. Eddie and Steve hoard their two blunts like gold, refusing to share with Robin.\n“I haven’t smoked in ages,” Steve defends. He passes the blunt to Eddie, out of Robin’s reach.  \n“These were a gift,” Eddie says, leaning away when she tries to snatch it. \nArgyle and Jonathan ignore them. They’re staring up at the ceiling like there’s something cool up there, like it’s not just stucco. \n“Fuck you both,” Robin whines, and Steve cackles. \nThey lock eyes and Steve raises one corner of his mouth, then one eyebrow. Robin shakes her head at him like he’s said something.\n“That was a pathetic joke,” Robin tells Steve. “Genuinely terrible.”\nSteve grins lazily. “It was fucking funny and I’m the funniest person you’ve ever met.”\nEddie watches them in awe. Considers, briefly, that the Upside Down gave them powers, somehow, and that they can communicate telepathically. But, then again, probably not; they’ve been like this for as long as Eddie’s known them. \nSteve and Robin are freaks, they have the freakiest symbiotic relationship Eddie's ever seen. It's majorly funny. \nRobin shoves Steve’s shoulder and Steve tugs her down, smacks three kisses across her forehead, cheek, and chin, and Robin strokes his hair for a moment. And then she turns to Nancy like nothing happened, babbling a blue streak about— the Dewey decimal system?\nWhatever. \nSteve is flat on his back and Eddie wants to be, like, on top of him. But that would be weird probably, so he does the next best thing— he lays down right beside Steve and tosses a leg over Steve’s hips. \nHe shuffles until their legs are twined together, Eddie’s hips pressed flush to Steve’s waist. A lazy, hot throbbing starts back up in Eddie’s hips— a pulse, pulse, pulsing that echoes his heartbeat. \nEddie is so high he feels fuzzy, feels like he’s swimming through air. Every puff of Steve’s breath ripples across him like water.\nIn response to the feeling, Eddie shifts, then shifts again. He restlessly strokes his fingers down Steve’s forearm, and Steve catches his hand. Brings it to his mouth and kisses Eddie’s palm, easy as anything. \nThe feeling of it, Steve’s mouth against Eddie’s hand, buzzes across Eddie. When Steve drags his lips up, toward Eddie’s fingers, a strange noise bubbles up in Eddie’s chest. He swallows it down and watches Steve with wide eyes.\nSteve brushes his mouth up, puts a kiss on each of Eddie’s knuckles. And they’re not… like, they’re not  small  kisses, either. Steve’s teeth scrape slightly, hook on Eddie’s skin, and every so often he bites down. He drags his tongue across the pad of Eddie’s finger and Eddie can’t help it— he moans. It comes out of him,  fu-uck, like he’s been hit. \nIt’s quiet, at least. Hopefully no one heard it but Steve— they’ve got the music back on, turned up loud, and he and Steve are a few feet from everyone else anyway. \nSlowly, Steve rolls so that he’s on his side, too. Eddie’s leg is still hitched over his waist. It pulls their hips tight together. He can feel the metal button of Steve’s jeans low on his stomach. \nEddie shifts, trying to get closer, hoping that Steve doesn’t notice the fact that he’s hard even as he hopes that he  does.  \nThey’re nose to nose. Steve stares at him, pupils blown wide from smoking. His lips are slick and red. Eddie bites his bottom lip and doesn’t look away. Couldn’t if he tried. \n“Hey,” Eddie tells him, because he can’t think of anything better. \nSteve responds by raising his eyebrows up then down very fast, a goofy sort of wiggle paired with a close-mouthed grin. It’s charming. Eddie is fucking charmed. \n“Hey yourself,” Steve says back, sliding closer.\nJust like that, Steve is kissing him again. Kissing Eddie like it’s easy, like he can’t help himself.\nEddie hooks his fingers into Steve’s belt loops and  pulls. He’s too eager, too clumsy, and they more or less crash together, but Steve doesn’t seem to mind. \n“Yeah, baby,” Steve says. He wraps a hand around Eddie’s thigh, which is still hitched over Steve’s hip. \nHe slides his hand over until it’s just under Eddie’s ass and what the  fuck, but that feeling makes Eddie clutch at Steve and shove their chests together. Steve pulls Eddie’s hips up, hand still tucked into the divet between Eddie’s ass and thigh, and holds Eddie tight against his body. At the same time, he slides his tongue against Eddie’s teeth.\n“Oh,  fuck, Steve,” Eddie gasps. Or he tries to, anyway— Steve keeps kissing him.\nIt’s hot and open-mouthed. Steve coaxes him into opening up wider and wider, until his jaw is stretched and almost hurting. It hurts really good, though. Eddie tries to kiss back, shoves his tongue against Steve’s in a slick glide that sends a shower of shivers down his spine. \nHe clutches tight to Steve’s bare back, thinks he’s probably digging his nails in too deep but he can’t fucking stop. Eddie tilts his head back and tries to get a better angle, tries to get Steve’s tongue wrapped all the way around his own. \nIt’s not even kissing so much as it is sliding their tongues together. It feels so, so good— Eddie really likes it, fuck, nobody ever lets him kiss them like this. Nobody  likes  it like he does— it’s usually tolerated for about five minutes before he gets shoved off. Before the other person giggles and says,  nobody ever taught you how to kiss, huh? Let me fix that.  \nPeople don’t  like  kissing like this. It’s slimy and wet and nevermind the fact that it sends Eddie into the stratosphere every time it happens; it’s  gross. Shit, but Steve probably hates it. \n“Sorry,” Eddie says, pulling away and gasping. “Sorry, sorry.” Even while he talks, though, he’s kissing Steve, their lips sliding and hooking on each other. All wet with spit. \n“For what?” Steve says, and then doesn’t let Eddie respond. Doesn’t wait, just uses the hand not holding Eddie by the ass to clutch at his hair. Pulls his head back with a tight grip.\nEddie’s mouth drops again, wholly without his permission, and Steve seals them back together. Flicks his tongue across Eddie’s lips then pulls back slightly, goes back to sliding their lips together with a happy sigh, and Eddie just— just can’t  resist.  \nHe touches Steve’s tongue with his own, begging silently for Steve to open his mouth more. To get closer. For him to grind his tongue against Eddie’s the way he was doing a second ago. \nThere’s a pause, just for a moment, and then Steve  does.  \nAnd it’s even better than before; somehow, Steve moves with more purpose, more focus. He stops pausing to pay attention to Eddie’s lips and instead sucks on Eddie’s tongue. Rubs the side of Eddie’s tongue with his own, slides Eddie’s tongue between his teeth, biting just enough for pressure. Not enough to hurt. \nFuck, it does the  opposite  of hurt. Oh, fuck, oh  fuck.  \nSteve pulls away, just barely, in order to breathe. Their lips are still touching. Eddie is gasping right into his face, panting, every couple breaths almost turning into a whine.\n“You got a thing for tongue, Munson?” Steve murmurs.\n“Shut the fuck up, yes,  fuck, come back here,” Eddie says. \nSteve laughs. Steve laughs and Eddie can feel it against his mouth and something inside him  snaps.  \nHe grabs Steve under his arms and yanks, hard, until Steve tumbles over him, landing hard on Eddie’s chest. One elbow comes down by Eddie’s head, Steve holding himself up. \nEddie sputters and gasps, “kiss me, kiss me  right now—”  \nSteve does. He dives back down and, shit, but he’s got Eddie’s fucking number now doesn’t he? Immediately Steve is kissing him in a way that’s wet and sloppy and so  good, his tongue back in Eddie’s mouth with no build-up, and Eddie can’t help it. He squirms and wraps both of his legs around one of Steve’s, shoving up against Steve’s thigh. \nHe’s just barely coherent enough to hope that Steve’s body is blocking Eddie from the rest of the room, because he can’t stop moving. Can’t stop tightening and relaxing his legs, can’t stop nudging his chin against Steve’s, can’t stop thrusting his tongue back into Steve’s mouth.   \nSteve twists their tongues together. And then it’s like he— like he’s fucking stroking down Eddie’s tongue with his own, up and down and around, and Eddie’s whole body trembles and rocks. \n“You cold, man?” Steve teases in a whisper. His voice is thick and slow and  hot. “You’re shaking.” \nEddie just shakes his head, pulling Steve closer with his legs. His arms are around Steve’s shoulders and he’s clutching at Steve too tight, tight enough to bruise him, but he can’t help it. His hips twitch, then twitch again, until he’s thrusting almost rhythmically against Steve. \nHe’s moving in tiny humping motions because he’s trying so, so hard not to get caught. Not by any of the others in the room— not even by Steve. Like maybe he can steal an orgasm, snatch it out from under everyone’s noses, because he fucking needs it. He needs it, he needs it, he  needs it. \nEddie hasn’t  needed  anything like this since he stopped… sampling his own wares, so to speak. Fuck, he wants an orgasm the way he wanted coke at age fifteen. He’s  twitching with it.\n“Steve,” Eddie gasps, and is shocked by his own voice. He sounds fucking— strung out. \n“Oh,  shit, Eddie,” Steve moans, and for the first time Steve’s hips kick against Eddie’s own. \nImmediately, Eddie thrusts back, locking his legs so tight around Steve that his ankles cross. He’s really, genuinely shaking now, his thighs and knees trembling around Steve’s leg, his abdomen tensing and releasing. \n“Okay,” Steve says. “Okay, okay, hold on— okay.” \n “Do not get off me,” Eddie hisses, but is ignored. \nSteve rolls off him, Eddie’s hands sliding down his bare skin, and Eddie gasps up at the ceiling feeling like he’s just surfaced from the bottom of a lake. His legs are still spasming, so hard it’s visible  fuck his life,  and his pants are still clinging and he’s still shirtless and  everyone can probably see how hard he is  and fuck him,  fuck him, because that doesn’t bring him down from the brink at all. It does the opposite, actually.\nEddie’s always loved when people watch him. Always loved being the center of attention; fuck, he stands up on cafeteria tables yelling about sorcery and sodomy just so people will look at him. Fuck,  fuck, fuck— he wants to touch himself. He’s high as shit and he wants to just— stick his hand down his pants right the fuck now. \nHe doesn’t. He turns his head and looks out at the room instead, and— nobody is looking at him. Argyle is fast asleep, Robin has headphones on. Byers and Nancy are sitting, backs stiff as boards, in front of the television. \nBetween the TV volume and the record still spinning, nobody heard him or Steve. \nThat’s— a relief, actually. A knot of fear that Eddie didn’t know he had loosens, relaxes, dissolves.  \n“Me and Eddie are getting cold,” Steve announces. “We’re gonna go, uh, find shirts. Upstairs.”\nSteve doesn’t wait for anyone to respond. He tugs Eddie up from the floor, wraps an arm around Eddie’s waist. He leans on Steve because his legs are, like, fucking shaking. Steve hustles Eddie out of the room and up the stairs, his chest to Eddie’s back. \n“Move, move, move,” Steve urges. \nAs they tumble toward Steve’s room, Eddie floats back into his body a little bit. While making out with Steve, he… he doesn’t know how to describe it. It was like every part of his body felt good; every part of him was throbbing, pulsing. Everything was so sensitive he didn’t think about his dick at all. Eddie’s going to blame the weed for that, but he’s got the uncomfortable suspicion it might’ve just been Steve. Just Steve Harrington, focused and observant and intent on pushing all his buttons.\nNow that he’s up and moving, he becomes aware of how fucking…  tight his cock feels. He’s so hard it’s like his skin is too small, the grip of his jeans feels like a hand squeezing him just right.  \nEddie is embarrassingly, humiliatingly, toe-curlingly hard. He sticks his hand between his legs because it fucking— it almost  hurts,  and it hurts so good, and he’s got to, he’s  got to. \nHe rubs up and down over his dick like he’s massaging out a muscle, Steve still pushing at his back. \n“Oh, shit, Eddie, are you touching yourself right now?” Steve asks. He slides his hands down Eddie’s chest, over his stomach, catches Eddie’s hand where—  yes—  he’s touching himself.\nA gasp against his neck, a choked-off noise, and suddenly Steve is shoving Eddie into the wall, just feet from his bedroom door. \nEddie’s back slams against it hard. The smooth paint is cold against his naked spine but he doesn’t give a  fuck— he grapples at Steve and hauls him in, smashing their mouths together and grinding against Steve with his chest and hips.\nTheir mouths are once again open, tongues pressed together. Eddie hauls himself against Steve, up and down, up and down, sliding his whole body along Steve’s front. He’s gasping,  oh oh oh oh, and his legs are shaking again, he’s shaking all over. \n“Relax,” Steve says, pulling his mouth off Eddie’s and kissing over his cheek. Sliding his tongue down the line of Eddie’s jaw. “Relax, Eddie, it’s okay— you’re okay, we’ll get you there.”  \nHe fixes his mouth onto Eddie’s neck, right in the middle, and sucks hard. Eddie scrabbles across his shoulders but can’t find a good grip; it feels like his fingers are tingling. Steve gently presses a thigh between Eddie’s legs and Eddie takes what’s on fucking offer. He latches on, desperate, and starts rocking.\nThe roll starts in his abdomen and works down, into his hips, his thighs. Back and forth, up and down— Eddie tries it fucking all. He gets so, so close; he’s shaking again, or maybe still, but he’s definitely shaking  more.  A strange buzzing starts between his ears. His dick is hard and he’s fucking  wet  with it, wet because he’s about to come but he can’t quite  get there. \n“Steve,” he gasps. “Please, man, you’ve got to—”\n“I’ve got to what,  man?”  Steve says. \n“Fuck off, Steve, come on,” Eddie says, dragging himself across Steve’s thigh, against his hips. \nTheir bare chests scrape against each other. Eddie can feel Steve’s nipples against his chest, feel the scratch of his chest hair. Every breath comes out as a moan. Eddie can hear himself but he can’t  stop, and he doesn’t really want to.\nHe feels wild, out of control, like he’s about to shake into pieces. Liquify and then drip down Steve Harrington’s thigh.  Fuck.  \n“Call me something sweeter than ‘man’ and I’ll touch you,” Steve bargains. He bites hard on Eddie’s neck, then drags his tongue up in a long swipe. The spit dries cold against Eddie’s burning skin and Eddie gasps. \nSomething about Steve’s tone— stern but teasing, mean but tender— makes Eddie lose his mind. It feels like a slap, it feels like a kiss. It feels like Eddie is about to fucking  die. \nEddie licks his lips, fumbles for clarity. Tries to find something sweet to say. In the end, all he can say is  Steve. \nHe says it on a moan. Says it soft, says it with his heart in his mouth.\nSteve pulls away from his neck to stare at him. His eyes are dark and make Eddie’s head spin.\n“Fucking strawberry milkshake,” Steve says nonsensically, and Eddie can’t ask him what he means because then Steve starts  touching him.  \nSteve slips his hand down, cupping Eddie hard through his pants in the same moment Steve sucks Eddie’s earlobe into his mouth. He fiddles with the silver stud with his tongue and scrubs the heel of his hand against Eddie’s dick, the friction through his jeans almost hurting.\nEddie’s knees start to shake and shake  hard.  It rattles his teeth. He pulls Steve close and works his hips, and it feels— it feels— it feels like finally scratching a rash. Eddie might be drooling but it doesn’t matter because Steve keeps  touching him. \nSteve is tonguing at his ear. Steve is pressing him against the wall. Steve is pulling Eddie’s hair. Steve is digging in and  rubbing, over and over and over and— \n\n And—  \n\n“Coming, I’m gonna, it’s, oh fuck Steve—” \nEddie’s whole body locks up. His eyes roll back in his head. And then all at once he’s shaking and thrashing because it just feels so  good, it’s pulsing through his hips, his whole body throbbing. He humps up hard against Steve’s hand. Steve presses strongly against him, unmoving, while he does. Eddie shudders his thanks, biting down on Steve’s naked shoulder and drooling. \nHis dick pulses, throbs— and the skin is so tight it’s  squeezing— and come floods Eddie’s jeans. Gets him wet. \nEddie breathes against Steve’s skin, which is slick from Eddie’s mouth. He’s still shaking and he can’t make it stop. He pants, in and out, while Steve holds him up. \n“You alright?” Steve asks him. When Eddie can’t find his tongue, Steve continues, “that looked pretty intense, Eds.”\nEddie wants to say something— hell, he wants to fucking  shake Steve’s hand, because he’s never come that hard in his whole fucking life— but he can’t. His throat goes thick and tight and he can’t do it. \n“Hey, okay,” Steve says, and it’s like he’s responding to Eddie. Like Eddie actually did manage to say something, even though that isn’t true. “Here we go, dude, move your feet a little bit.”\nSteve starts tugging him toward his bedroom door, gently but persistently. He hooks Eddie under his arms, leans Eddie’s chest against his, keeps his thigh between Eddie’s so that Eddie doesn’t tip over. \nWhich, like, is probably good— Eddie can’t feel his feet. His knees bend and wobble like cooked spaghetti. There’s a strange moment where his vision fades in and out, blurring around the edges, and then they’re in Steve’s room. It’s a nightmare of blue and plaid. If Eddie was even five percent more in his body, he would give Steve shit. He will later. \nIn this moment, giving Steve shit feels like an impossible task. An unachievable goal, because all he wants is for Steve to stroke down his back, pet his hair, kiss his face. \nEddie feels fragile. Breakable. And still, somehow, turned on. He’s heavy with the feeling, body turning to lead. \nSteve tips him onto the bed and the sheets are worn down into softness, like Steve’s had the same pair for a long time. Shamelessly, Eddie burrows into them, scrubbing his body across them like a bear rubbing against a tree. Or something.\nHe’s still feeling weird. Obviously. \n“Get down here,” Eddie says, the words coming out slurred, because Steve is just hovering at the side of the bed with his hands on his hips. There is a thoughtful frown on his face. \nA couple fast blinks, like Eddie’s startled him, and then Steve smiles.\nWhen Steve leans down, Eddie grapples his arms across Steve’s bare shoulders and yanks. Steve collapses onto his chest with a startled  oof, and Eddie wheezes with Steve’s weight. But having Steve on top of him brings Eddie back down into his body, just a little. \nAbruptly, he realizes that Steve is still hard. Steve’s not  doing  anything about it, isn’t working his hips or sliding his hands over Eddie. Isn’t pushing, isn’t in any sort of rush. But Steve is hard and Eddie knows it, and suddenly Eddie is  desperate. \nHe’s not even totally sure what he’s desperate for, because nothing about… any of this has been expected. Nothing Steve has done was anything Eddie expected. Fuck, nothing  Eddie’s  done was anything Eddie expected. \nWho knew all it took was a good kiss from Steve Harrington to knock Eddie off balance? Who the fuck knew that Steve Harrington’s tongue on his ear would make Eddie go belly-up, vulnerable and shaking and so fucking turned on he got  dizzy? Who fucking knew? Not Eddie. Certainly not fucking Eddie Munson, and isn’t that a funny joke?\nEddie feels like he  should  have known. It’s hysterical that he didn’t. Eddie snickers into Steve’s bare shoulder and squeezes Steve a little harder. He’s too worldly to not have known; he’s been too many places, done too many things with too many different types of people. How the fuck did Eddie not  know? \nHe feels stupid. He feels like a shook-up coke bottle, fizzing up until he pops. Steve twisted him off and he exploded, sticky and frothing, and now he’s got to settle back down. \nHe feels fucking  enlightened. \n“Lemme blow you,” Eddie says. “Come on, Harrington, let me get you off.  Fuck, sweetheart, let me suck you.” \n“You think I’m gonna say no?” Steve asks, and Eddie can hear the way he’s grinning. “Where do you want me?”\n“Can I— like, on the floor—”\nEddie’s heart tumbles over itself, thudding loudly in his chest, and shit but he sounds fucking incoherent. He’s panting, gasping even though Steve’s not heavy on his chest. \nBefore Eddie can say anything else— say something about Steve, on his back, hands in his own hair, Eddie on his knees in front of the bed, head between Steve’s thighs— Steve is moving. He rolls off Eddie in a smooth rolling tumble, athletic and just… Eddie’s not sure what to call it. It’s almost like he poses, except that’s not quite right. The word is too fake, too  cold, for what Steve does. \nSteve lays back, bare chested and tan from the summer sun. He shines with sweat and the buttery lamp light. His stomach is relaxed, he’s not flexing or faking, not trying to look more muscled than he is. He’s just… on display, relaxed and playful, his knees crooked. Jeans still on. \nDark lashes flutter at Eddie. Steve’s lips are cherry red from kissing, and spread into a slick smile.\n Seduced,  Eddie thinks to himself, turning the word over in his mind with a strange, excited curiosity.  I’m being seduced.  \nHell, Steve’s been seducing him this whole damn night. But it’s more, somehow, watching Steve do it in the private safety of his bedroom. In the quiet comfort of his bed. \nEddie pulls himself up until he’s sitting. Steve doesn’t look away.\nEddie tumbles onto the floor, hitting his knees hard. Steve doesn’t look away.\nEddie wraps his hands around Steve’s ankles and  tugs, pulling Steve to the edge of the bed. He throws Steve’s calves over his shoulders. And still,  still,  Steve doesn’t look away. He props himself up on his elbows and stares down at Eddie, eyes lidded low. Dark and playful but dangerous in a way that makes Eddie think of domesticated wolves. \n What big teeth you have, Harrington, Eddie thinks, and then cackles to himself. \nAbove him, Steve shakes his head and grins. \n“You’ve got the best laugh, man,” Steve says, which startles Eddie for some reason. \nPart of him thought Steve was going to say something like,  I’m getting old up here, Munson, but of course Steve wouldn’t. Steve’s not the kind of guy to rush anyone into anything; not the kind of guy to make Eddie hurry up and blow him. \n“I’m taking your pants off,” Eddie declares, because suddenly he can’t wait another fucking moment. He needs to get his mouth around Steve now, now,  now. Needs that closeness, that vulnerability and trust from Steve. Needs to be the one to… like, fucking possess that trust. To hoard that closeness like a dragon hoarding gold. \nHe needs Steve to keep looking at him.\n“Yeah, please,” Steve responds, but Eddie is already attacking the button of Steve’s jeans, already yanking the still-damp denim down Steve’s thighs. \nDimly, Eddie hears Steve huff a laugh but doesn’t respond. He’s too busy wrestling Steve’s jeans off completely, flinging them over his shoulder and going for his underwear; they’re black and tight, cupping Steve in a way that makes Eddie’s mouth water. \nSteve lifts his hips and Eddie hooks his fingers in the elastic and, just like that, Steve is naked. Naked and lounging, body lush and inviting. Well-earned muscle overlaid with a soft layer, like Steve has been drinking water and eating well. Healthy in a way that makes Eddie feel… \nGrateful, maybe. Wondrous.\nThose pitted scars on Steve’s sides glimmer silver. Eddie wraps a hand around Steve’s waist, covering them. \nEddie meets Steve’s dark eyes, watches Steve’s lips part, and then lowers his head. \nWhen he sucks the head of Steve’s cock into his mouth, Steve goes boneless. His back bows down into the bed, elbows sliding out from under him. He grins up at the ceiling, smiling that lazy confident smile that Eddie likes so much. He doesn’t get to see it often; these days, Steve seems to have a perpetual furrow between his eyebrows. Constant concern on his face.\nIt’s nice, seeing it now. \nEddie puts himself to work, inching his way down Steve’s dick until it hits the back of his tongue. It’s harder than he thought it would be, giving a blowjob, but in some ways it’s easier, too. \nA distant part of Eddie had been apprehensive of the taste, the smell. The feeling of a dick in his mouth. But he shouldn’t have been. It’s easy, doing this: Steve’s skin is warm, and clean, and Eddie likes the stretch of his lips. The weight on his tongue. \nIt does something funny to his head. Blanks him out like a VHS tape played too many times. Everything narrows down to the weight in his mouth and the soft, pleased noises Steve makes. Steve isn’t loud but he’s not quiet, either. He’s just… genuine. \nSteve moans when Eddie rubs his tongue down his dick, sighs when Eddie strokes over his stomach. One of Steve’s hands creeps down and into Eddie’s hair, holding firm and tight. \nEddie hollows his cheeks and sucks, hard, and Steve’s fingers tighten against his scalp until pain zings, electric, down Eddie’s spine. \nWhen Eddie moans, Steve does it again. \nIt feels good enough that Eddie redoubles his efforts,  triples them, because Eddie’s already come and he needs Steve to feel good, too. He wants Steve to shake and moan and feel the same way Eddie felt. Because otherwise it’s not fair, otherwise Eddie hasn’t done his job, and something about that almost makes him feel queasy. \nCautiously, Steve starts to work his hips against Eddie’s mouth. Eddie slides his hands under Steve’s thighs and hoists him in, encouraging the movement. \n“Baby, fuck,” Steve gasps.\nEddie moans. Spit drips down his chin. His lips are tingling with the friction of Steve’s cock, the way it slides in and out. When Steve gives a particularly hard thrust, Eddie almost chokes. It should feel bad, should make him want to sputter and pull off of Steve’s dick, but it doesn’t. It  doesn’t; instead, it makes Eddie gasp through his nose and moan. He shuffles forward until his chest is pressed flat against the mattress, his knees sliding half way under the bed.\nHe likes being down here, on the floor, looking up as Steve gasps and half-laughs his way through the blowjob. Steve is grinning, light and uncomplicated, his eyes on Eddie. His hand is still in Eddie’s hair and gently guiding his head up and down. \nEddie is surrounded, consumed, by Steve: Steve’s legs across his shoulders, holding him down; Steve’s dick in his mouth, heavy and warm; Steve’s hand in his hair, pulling tight and strong.  \nIt’s wonderful. It’s close and comforting, and Eddie fucking  burns with it. Each stroke of Steve against his tongue, each time Steve’s hand clenches tighter in his hair, sends Eddie into dizzy, giddy spirals. He’s panting around Steve’s dick, feeling wet and sticky everywhere. Sweat in his armpits and behind his knees, come still slick around his own dick— which is hard again.\nImpossibly, Steve gets harder against his tongue, and another breathless laugh bursts out of Steve’s chest. It’s a light sound. Uncomplicated, like Steve is sometimes. Steve feels good, his body feels good, and so he’s laughing. Smiling at Eddie. \nFuck, but Eddie didn’t know sex could be like this.\n“Gonna come, baby, fuck you’re so good at this,” Steve says, and pulls Eddie down by the hair.\nEddie gasps and chokes eagerly on Steve’s dick. Next to his nose, Steve’s thighs twitch and shake, his stomach flexing, and Eddie moans at the same time Steve does. \n“Eddie, yeah, fuck— fuck, Eddie,  Eddie,” Steve gasps, and Eddie sucks hard.\nHe bobs his head once, twice, and Steve’s eyes roll back. He pulls Eddie in, heels shoving against Eddie’s back, and then suddenly Eddie can taste him against his tongue. Hot and salty, a little slimy. \nIt’s gross. It’s fucking  hot.  \nOverwhelmed, Eddie sucks Steve harder, swallowing as much as he can and letting the rest drip down his chin. \nGasping, and still half-laughing, Steve pulls Eddie off of his dick by the hair. Eddie goes with a strange noise— it’s not a whine, except maybe it is, because it’s high pitched and needy and Eddie wants so much to be back where he was. Surrounded by Steve, making Steve moan and giggle. Doing good work.\n“That was so fucking good, baby,” Steve tells him. His bare stomach is heaving, in and out. \n“Yeah?” Eddie asks, and he sounds fucking destroyed. Like he just did ten rounds of combat and his hit points are low; all husky and desperate. “You liked it?” \n“Yeah,” Steve agrees. His eyes are dark and shining. Eddie can’t look away from them. “Seems like you did, too, babe.” \n“It was alright,” Eddie grins, shrugging. \n“Just alright?” Steve asks.\nEddie gazes up at Steve, who’s propped himself back up on his elbows, and lets himself beam. He smiles so wide his cheeks hurt. \nSteve smiles back and shakes his head. “You are so…” Steve starts, but doesn’t finish. Instead, Steve sits up, abs contracting and releasing effortlessly, and hunches over Eddie. His legs slide off Eddie’s shoulders but don’t leave Eddie completely; he tucks them around Eddie’s waist instead, locking his ankles.\nEddie stares up at him, still kneeling by the bed, and licks his lips. Softly, Steve’s hand comes down from Eddie’s hair. He swipes his thumb across Eddie’s chin, and the motion is embarrassingly slick. Steve’s thumb digs in, hard, and Eddie feels himself gasp. \nLike his open mouth is an invitation, Steve slides his thumb— now coated in come and spit— between Eddie’s lips. Instinctively, thoughtlessly, Eddie licks it clean.\nIt tastes… fine. Not good, but not that bad, either. \nThe taste isn’t the point.\nThe point is Steve, Steve’s thumb in his mouth, Steve leaning over him; and the point is Eddie, taking what Steve gives to him and wanting more. Always, always more. \nCrashing and receding. Wanting and gorging and then growing hungry again. \n“Hey,” Steve says. His square jaw flexes. “Come back up here.”\nEddie stares at him, motionless, trying to process the words through the buzz in his ears. And then, all at once, Eddie throws himself up onto the bed, on top of Steve. Steve catches him with a barking laugh. \nHe rolls Eddie onto the sheets, so quick and smooth it turns Eddie’s head. Makes him feel like one of those struck-stupid cartoon characters. Big pink hearts whirling around him.\nHe used to glue himself in front of Uncle Wayne’s tiny TV on Saturday mornings, hiding out from his parents back before he went to live with Wayne permanently. The pictures would glitch, cut in and out with bad signal, but he remembers the cartoons. A little cartoon bunny being kissed, and his heart leaping out from his chest. His cheeks glowing red, even though animals with fur can’t blush. \nWhen Steve presses him down and kisses him, Eddie feels just like that stupid fucking rabbit. \n“What’s up, doc,” Eddie blurts against Steve’s mouth. He can’t help it. \nSteve huffs, then sucks a kiss onto the base of Eddie’s jaw. “I’m trying to think of a good way to respond to that,” he tells Eddie. “There’s gotta be a joke in there about  doc  and  cock rhyming, but I’m not smart enough to find it.”\nBefore Eddie can respond to  that—  and Jesus, Harrington is right, if they could pin down that joke it would fucking  kill— before Eddie can say anything, Steve bites down hard on his neck. Like, so hard Eddie can feel the bruising start immediately. \nJust like that, they’re back at it: zero to ten to one-hundred miles per hour, Steve biting his way down his neck and across his collarbones. Tracking down to his nipples, and he fucking bites those, too; these sharp, tiny vampire bites that make Eddie thrust his chest up into Steve’s mouth like a girl in a porno. Except he’s not acting.\nShit,  shit, but he is really not acting.\n“Can’t believe you’re hard again, Eds,” Steve groans, Eddie’s nipple still in his mouth. “That’s so fucking hot, baby.”\nWhen Steve scrapes at it with his teeth, Eddie’s legs kick out against the bed. \n“You want me so bad,” Steve says, and he’s not teasing. He’s not being mean. He sounds fucking baffled. \n“Of course I do,” Eddie gasps. “Fucking— of course I do, Steve,  fuck.” \nAnd then Eddie can’t talk anymore, because Steve is biting across his chest and he’s biting  hard.  Leaving red marks that flush darker with every second that passes. It feels fucking  crazy, is what it feels like. \nIt feels like Eddie’s going out of his mind. \nHe can’t do anything but scrape his fingers down Steve’s back. Eddie’s knees are bent up, Steve laying between them, but his legs keep falling back down. His feet keep sliding because Eddie keeps trying to thrust his hips into Steve.  \nHe notes all this in a vague, passive sort of way. It doesn’t really matter. Nothing matters except for Steve Harrington touching him. Steve biting hard on his nipples, hands clawing down Eddie’s sides. Leaving red marks everywhere. Red bruises and scrapes that Eddie is going to pinch and touch, alone in his bedroom, remembering this. Getting off to the memory. \nSteve bites hard at the soft skin below his belly button and Eddie almost, like, yells. Partly because he’s shocked and partly because it feels… it  feels.  \nEddie can’t tell if it feels good or bad, but he knows he wants more of it. More, more, more of it always. \nSteve puts his hands on Eddie’s jeans, rubbing over Eddie’s cock and saying: “I’m gonna take your pants off, Eds, can’t believe you’ve still got them on—”\nAnd Eddie is responding: “Fuck off, take them off, take them  off, please, Steve I need you to—”\nJust like that, Steve is popping the button and yanking his jeans down. They get stuck on Eddie’s bare feet for a moment but Steve gives a hard tug and they disappear onto Steve’s floor. There’s a moment’s pause, where Steve draws back to stare at him with dark eyes, and then Steve reaches out. He tucks one finger into the elastic of Eddie’s underwear and pulls back. \nWhen he lets go, the elastic  snaps  back onto Eddie’s skin. It’s a sharp and bright feeling, and Eddie’s dick throbs with it. Gets wetter than it already is— he’s still sloppy from his first orgasm, but now he’s, like, fucking soaked. It’s all leaked through his underwear and he can  see  it, the white of his come and the big damp patch. \nSteve can see it, too. \n“You’re a mess,” Steve says, and then he keeps going, like he can’t help it. “Fuck, look at you, Eddie. Shit. You’re all wet. You’re fucking  soaking, baby.” \nEddie gasps, and then moans, and then gasps again because fuck, was that him? But he can’t think about it too hard because his dick is still pulsing, and the pulsing is  good.  His dick has that too-tight feeling, familiar, and Eddie knows that he could fuck up into the thin air and his underwear and feel even better. Maybe even come like that. He’s always been a little bit of a hair-trigger, but he’s never minded. Not when it feels like  this.  \nAnd he can go again, over and over, has spent whole nights working himself raw. Thrusting into his hand. Against his bed. The arm of the couch, a time or two. Just because he could. There were nights where he’d come into the sheets and then into a sock and then all over his belly. \n“Sometime soon you’re going to fuck me,” Steve says, and Eddie makes a keening noise that sounds a little bit like  yeah.  “You’re gonna take all those rings off and fuck me with your fingers, get me ready, and then you’re gonna fuck me with  this.” And Steve clenches his hand around Eddie’s cock, a little mean, but so good.\n“You want me to fuck you, sweetheart?” Eddie says, mostly because he wants Steve to keep talking. He tries to sound suave, put together, but his voice cracks and breaks and he’s mostly gasping for air. He sounds like he’s running. His hips are twisting against Steve’s hand. \n“Yes,” Steve groans, and then he’s removing his hand and yanking Eddie’s underwear down, throwing them off. “I know that’s not your thing, but I figure we can compromise.” He bends down and sucks a bruise into the crease between Eddie’s thigh and his dick, and Eddie’s vision whites out before he can ask Steve what the fuck he means by  that.  \n“Please, Steve,” Eddie says again, because he can’t say anything else. \n“You like that?” Steve asks, and Eddie gasps hard. \nHe might not even need Steve to touch him, not if he keeps talking like this. Eddie’s whole body rolls, up against Steve and then down against the sheets, and it’s like his body is a live-wire. There’s hardly any friction against his dick but he’s rocking like he’s fucking into something anyway and it feels fucking  amazing.\n“You like when I talk to you, Eds?” But it’s not really a question. Steve pinches at Eddie’s thighs, viciously hard, leaving more bruises. It makes Eddie moan, and again it’s high pitched but it’s not embarrassing, because Steve so clearly likes it. \n“Yeah,” Eddie says, voice shaking. “Yeah, sweetheart, I like when you talk to me.” \n“Good,” Steve murmurs. “Yeah, that’s good, ‘cause I like to talk.” He punctuates the sentence with a sharp bite, right next to the base of Eddie’s cock. That place where the skin isn’t quite stomach but isn’t quite anything else. \n“Got a question for you,” Steve continues. “It’s been keeping me up at night, let me tell you.”\n“Shoot,” Eddie says, fisting one hand in Steve’s hair and grabbing tight to the pillow beneath his own head with the other. \n“You like blowjobs, Eds?” \n“What?” Eddie sputters. “Of course I like blowjobs—”\nBut he doesn’t get to say anything else. He chokes on his own tongue because Steve puts his mouth on his dick, a long smooth motion that takes him almost all the way down. Eddie grasps at the pillow, twisting his fingers into the pillowcase and pulling. Without his permission, his body thrashes, like he’s trying to get away even though that’s the last thing he wants. \n“Oh, shit,” Eddie says. “Oh, shit, Steve,  honey, fuck—”\nSteve works his tongue. Sucks at the head. Eddie feels it when he presses against the slit of his dick, can feel Steve’s teeth lightly catch against the crown. His fingers clench, hard, in Steve’s hair.\nAn odd jerking motion, Steve moving his head back slightly, and then Steve grabs Eddie’s hand and removes it from his hair. \n“Sorry, sorry,” Eddie gasps, because shit,  not everyone likes their hair pulled, Munson, and you just pulled it really fucking hard. “Sorry, Steve.” \nThe only response Eddie gets is a peaceable hum, which vibrates up his dick and through his stomach. It makes Eddie’s legs spasm.\nFrom there, everything builds up fast, faster than Eddie can keep track of, never mind control. Steve slides his mouth up, then down, and Eddie writhes. Steve presses him down hard by his hips, that thick strength in his arms holding Eddie  tight, and Eddie revels in it. He bucks and thrusts just so he can feel Steve hold him down. \nAll in all, it’s only a minute, maybe two, before Eddie gets close again. Before he’s whining and gasping and repeating Steve’s name. His dick is throbbing, the skin too tight and too small, and Eddie can feel each pulse. When Steve pulls back and puts his mouth on Eddie’s balls instead, Eddie fucking… there’s a noise Eddie makes, and he can hear it from himself, but it’s so high and strange that he can’t put a word to it. \n“Gonna come, Steve, I’m— again—”\nIt’s just that it feels so good, it feels so  good, and Steve Harrington is sucking him off, Steve Harrington is playing with his fucking balls and before Eddie knows it he’s trying to cross his legs, trying to keep Steve where he is. He thrashes hard against the bed and buries his hands in his own hair, pulling hard. Dimly, he hears something that’s almost a laugh. \nIt doesn’t matter. Eddie’s eyes cross and his mouth drops open, his stomach flexing, and then that  tense  and  release  happens. Everything pulls tight and then lets go in pulsing, orgasmic waves, and before he knows it Eddie is coming wet and hot across Steve’s face. \n“Oh, fuck, oh  shit,” Eddie moans, rocking himself back and forth.\nSteve puts his mouth back on Eddie’s cock and sucks down the last few spurts, soothing him.\nIn the aftermath, Eddie’s body shakes again, legs trembling and stomach heaving. Steve swipes his hand over his face, wiping off Eddie's come, then pulls himself up and lays down. He's a heavy weight that covers Eddie completely. Eddie hauls him closer, wrapping arms around Steve’s waist and twining their legs together.\nThey lay there and breathe, fast at first but then slower, slower. Steve’s breath against Eddie’s neck is calming. Eddie trails his hands up Steve’s back, over those smooth scars of his, and then brushes them back down.\nEddie closes his eyes and lets himself lose track of time.\n \n \nThey glide in and out of sleep, stumble into dreams and then back out of them. Neither of them really passes out, or anything, but for a long stretch of time they lay there together, wrapped around each other like yarn in a bracelet. \nAfter what might be hours and what might only be forty-five minutes, Steve slides off of Eddie. He worms close again immediately, though, so Eddie can’t feel too bad about it. He lifts his arm so Steve can press into his side, nose tucked into Eddie’s neck, and then settles it across Steve’s shoulders.\nFrom where they’re laying, Eddie can see out of Steve's window. The pool is bright and glowing against the night sky, an eerie blue, and in that strange glow he makes out their shirts and shoes, still crumpled on the pool deck. If he squints, Eddie can make out the shape of his black bandana.\nHe stares at it for a moment before he loses it. Eddie cackles, so hard he winds up snorting, and Steve jolts out of his weird almost-meditation. \n“What the fuck?” Steve says, taken aback, and his tone is like,  why the fuck are you doing this. Steve gets that tone every time someone startles him, like he’s trying to save face. He’s seen Steve do it with the kids, with Robin, with Nancy. And now, with him. \nIt’s endearing.\nEddie snickers harder, shoulders shaking, and buries his mouth in the dip between Steve’s pecs. “False advertising.”\n“Explain,” Steve drawls.\nAnd then Eddie’s not laughing anymore.\n“Uh,” he says.\nEddie hesitates, because how can he explain this? Explain flagging to Steve, and why he does it, and what it means? How can he explain to Steve that, for years, Eddie has made himself come to the  idea  of pain, to skin pink and hot and stinging? Rubbed himself until his boxers were wet to the image of teary eyes, to bruises on necks and wrists and hips, and never put together that he wants the pain to be  his?  How can he explain the misinterpretation of his own desire?\nBriefly, for a half of a half second, Eddie tries to make the fantasy— which has always been vague, always filled with faceless men— specific and clear. Solidifies the image in his mind until it’s  Steve.  \nHe imagines making Steve hurt. Imagines making Steve hurt enough tears well up in his eyes, making Steve’s skin burn hot because Eddie’s been hitting him. Giving Steve bruises, the kind that  ache.  \nThe idea makes Eddie want to throw up. It makes him want to apologize and bury himself in Steve’s neck. He’s got the absurd urge to run his hands over Steve’s body, check his flanks and his throat, like maybe Eddie’s thoughts will have re-opened old wounds. \nEddie had nightmares about those marks on Steve’s body. He still does, sometimes. \n Sado top, Eddie thinks to himself, queasy and baffled at his own audacity. He forces himself not to tremble because Steve is fine. Steve is fine. \nEddie’s been flagging as a sado top. What a fucking joke. \n“Hey, hey, woah,” Steve says, his voice close and gentle. Eddie crashes back into his body, back into the present moment. \nSteve is still holding him; their skin is still slick with sweat and come and spit. It’s starting to get sticky. Eddie’s throat is gloriously sore and he’s got bruises on his thighs that throb so  sweetly. \n“You’re alright, Eds, we’re alright,” Steve tells him. “Shit, honey, you don’t have to tell me if you don’t want to. Quit making that face, alright? You’re breakin’ my heart.”\nAnd then Eddie thinks— why the fuck not? They’ve got time. He’s naked and still a little high and, before or above all that, he trusts Steve. Trusts him with his life. Trusts him at his back when there’s monsters swarming and the sky is lit up blue and red. He can fucking trust Steve with this. This is nothing; small fish. A tiny secret that they’ll laugh at together.\n“So, alright, this needs context,” Eddie starts, and his voice shakes at the beginning but is sturdy by the end. He puts on his dungeon master voice; he needs the soothing shield of performance. “You know how I keep a black hanky in my back pocket—”\n“Oh, yeah, the gay bandanas or whatever,” Steve says.\nEddie is so baffled he stops talking. \n“I don’t know, dude, yours seemed pretty accurate.” Beneath his cheek, Steve shrugs. All casual.\nBizarrely, Eddie feels… offended. Hurt. Even though two hours ago he wouldn’t have felt either of those things. \n“I mean, the bottom part was maybe a surprise, but it’s not a big deal. It’s just sex, you know? I wasn’t totally sure about the masochism, but… I think we did pretty well for our first time.”\nEddie pauses. His brow furrows. He tries to make sense of what Steve is saying, but he can’t quite make his thoughts link up in his head. \n“What?” He asks.\n“Yeah, man, Robin explained it to me,” Steve says, and suddenly everything starts to make more sense. “Left pocket means bottom, black hanky is for S&amp;M.” \n“No, Steve, the  right  pocket means bottom,” Eddie corrects, feeling lightheaded. “Mine means I top.” And that he thought he was a sadist, though maybe he’s going to get out of explaining  that mental mixup. If he’s very, very lucky.\nSteve was half-wrong, because Eddie wants to top Steve with a desperation that’s bordering on pathetic, but Steve was half-right, too. Because Eddie loves the bruises throbbing on his thighs, the bite marks stinging on his neck and chest. And he  hates  the idea of hurting Steve.  \n“Oh, cool,” Steve says, continuing the conversation, and Eddie forces himself to focus. \nSteve relaxes contentedly against the sheets, like none of this is a big deal to him. “I’ve never, like, bottomed or whatever, but it seems fun. It was hot talking about it earlier.” \nMaybe it  isn’t a big deal. How the fuck would Eddie know?\nEddie’s always known Steve has more experience with sex than he does, experience enough to treat it with casual appreciation. Like sex is just something fun that Steve does with other people, or with himself. Special, sure, sometimes, but nothing scary. Nothing that Steve hides from or talks around or avoids. Nothing  shameful.  \nIt’s enthralling. The easy confidence Steve has slides through Steve and into Eddie, and Eddie tries to absorb it. \nA cracking yawn half-breaks Steve’s jaw, then, and Eddie glances at the clock. Almost three, and he has to leave early. Uncle Wayne’s recruited him into helping start a garden; two weeks ago, Uncle Wayne had shown up with a raised plant bed and a bunch of seed packets. It’s a little late for it, they’re already a week into June, but it’s not  impossible to start a garden this time of year. Just harder. \n“We should sleep, sweetheart,” Eddie says, and the pet name drops out of his mouth as easily as anything. \nMaybe it should be awkward, but it’s not. Steve  likes him: kissed him in front of all his friends, pulled him into his lap, laid with him on the floor face to face with their toes pressed together. \nSteve's been, just... really good to him. Genuinely good, in a way that is vulnerable and genuine and patient. \n“Oh, honey,” Eddie sighs, overwhelmed and touched.\nFor the first time, Steve’s cheeks flush and Eddie stares, awed. \nSteve clears his throat and looks at Eddie in a way that’s… not shy. Just cautious, maybe. \n“Thanks, by the way,” Steve says. \n“For what?” Eddie asks, baffled, because Steve wouldn’t thank Eddie for sex or orgasms or whatever. \n“Just…” Steve trails off. He licks his lips and then twists. Leans forward until their mouths are pressed together, close-lipped and soft. “For not laughing at me. For being so sweet.” \nEddie pulls back a little, his heart feeling too big for his chest. Like it’s about to burst out and burrow under Steve’s skin, so Steve can keep it forever. “Why would I laugh at you?”\nSteve hesitates, then shrugs. Eddie can feel it, the rise and fall of his shoulders from where he’s tucked against Eddie’s side. He keeps his eyes on Steve’s face, careful, because something here is fragile. Something about  Steve is fragile, suddenly. \nIn the blue nighttime, Steve’s eyes are big and boundlessly dark. Eddie can’t look away from him, from the sudden sheen on them. He reaches out and pulls Steve in hard, pressing their naked bodies together like maybe they could merge if he pulls hard enough. \nIt would be nice to share a body with Steve. To feel him breathing, to feel his heart beating, and to know that he’s safe in a visceral, bloody way.\nThat’s a freak thought. The kind normal people probably don’t have. \nEddie lets himself think it anyway. \n“You wouldn’t,” Steve finally says. “Sorry, I know you wouldn’t.” \n“Never,” Eddie promises. “Alright, Steve? Even if you, I don’t know, ask the stupidest questions ever. I’m not gonna laugh at you for, like,  expressing yourself.” \nThe other words are too big to say, right now, even if Eddie thinks he might mean them, so instead he finishes with: “I like you a lot, sweetheart.”\nSteve beams at him, big and shiny, like maybe he heard the other thing Eddie didn’t say.  \n“Me, too,” Steve tells him.\n“I know,” Eddie grins, nuzzling into Steve’s hair. “You faked weed virginity for me, man.”\n \n \nBefore Eddie leaves, he shakes Steve awake. When Steve rolls over onto his back, eyes blinking open sleepily, Eddie pounces on top of him. Kisses him stupid. Kisses him over and over, with lips and tongue, until Steve laughs and pulls him down. \nThey roll around between the sheets for a while, Steve still naked and Eddie fully-dressed. \nEddie had crept downstairs in just his jeans twenty minutes ago, nervous because he is currently in possession of a fuckoff-amount of hickies and scratches. His jeans ride low and there are some incriminating finger-shaped bruises on his hips. But his shirt had still been out by the pool, along with his shoes and bandana and everything that had been in his pockets. \nOnly Argyle was sleeping in the living room, everyone else bunked down in the many guest rooms at casa Harrington, so. \nIt could have been worse. \n“Steve,” Eddie laughs into Steve’s mouth. He pulls back but can’t find the determination to break the kiss. He dives back, sliding his tongue between Steve’s lips again. \nSteve sucks on it. Kisses him and kisses him and kisses him.\n“You leaving?” Steve murmurs, their lips still mashed together. Eddie can feel them against his skin: the open vowels of the word  you,  the lick of Steve’s tongue on the first syllable of  leaving.  \n“Fuck, never,” Eddie blurts, and Steve laughs. Eddie huffs and shakes his head at himself, feeling young and giddy and stupid. “But yeah. Uncle Wayne’s decided he wants to start a fucking garden, for whatever reason.”\n“A garden?” Steve asks, pulling away with his eyebrows raised. His lips are red and slick. The sun is rising, coming in through the window in shades of gold, the new day turning Steve into something unreal. A Roman statue, or something; he has the nose for it.\n“He’s a crazy old man,” Eddie dismisses. “But yeah. I have to go.” \n“Lemme walk you out,” Steve says, pushing Eddie to the side and climbing out of bed. \nHe’s ass-naked, the span of his back broad, scars on display. His hair is greasy with sweat. He’s got dark hair up his shins and thighs, spanning his crotch and belly. Eddie didn’t get a good look at him last night, not really: it had been too dark by then. \n“Shit, Steve,” Eddie groans. “Put some clothes on, you look too fuckin’ good right now.”\nTurning and looking over his shoulder, Steve grins. Raises his eyebrows. “Yeah?”\n“I wanna lick you everywhere,” Eddie says, and briefly debates just throwing all his clothes off again and fucking Steve on the floor. But then he glimpses the alarm clock and sees the time— 8:20, fuck— and curses. “But I can’t, fuck, damn this garden all the way to hell.” \n“What’s he growing?” Steve asks, casually throwing on a sweatshirt and some tiny fucking green shorts that make Eddie want to push Steve down and climb on top of him. Maybe get Steve to pull his hair again.\n“Eds?”\n“Yeah, what? Sorry,” Eddie responds. “No, it’s just like, tomatoes. Nothing crazy. Come here so I can kiss you.” \nLaughing, Steve comes and wraps his arms around Eddie. His hands slide down Eddie’s spine and tuck into his back pockets. Steve pulls him in by the ass and then they’re kissing more. He isn’t sure which one of them starts it, but after a moment they’re swaying together, side to side, and breathing through their noses. Still kissing.\nEddie pulls away to cup Steve’s jaw. Steve lets him do it, lets Eddie move his head. Scrape his fingers over Steve’s stubble. \n“Fuck, I do not want to leave!” Eddie explodes. \nSteve tosses his head back and cackles.\nHe leaves anyway, of course, because Eddie’s not a petulant child. He’ll go, eat breakfast with Uncle Wayne and then help him plant his old-man garden. And then he’ll come back, and Steve will cook them dinner, and they’ll listen to records. Kiss on the couch. Maybe fuck on the couch.\n“You promise?” Eddie presses.\nThey’re standing in Steve's long driveway, the house behind them silent and sleeping. In the grass, crickets are chirping, coming awake as the sun rises. \nGently, Steve steps forward and presses Eddie into the van. His back is against the driver’s door, the handle digging into his spine. \n“Promise,” Steve says.\nAnd, of course, then they have to kiss again.\nThey make out against the van for a while because Eddie feels like he’ll just… melt and fall apart and  die  if he needs to leave Steve. Even just for half a day. Steve’s hands find Eddie’s hips again, holding him tight, pressing on the bruises already there. It makes Eddie gasp and giggle. He throws his head back, disconnecting their lips, and immediately Steve’s mouth travels to his ear. Latches on. \n“Not fair, Harrington,” Eddie says. “Oh, shit, not fair.” \n“Get outta here, Munson,” Steve tells him, biting a kiss onto his lips one more time before stepping back. \nEddie pouts at him, even though Steve is right. The sun keeps creeping higher into the sky and Uncle Wayne has always been an early riser. “Kicking me out?” \n“Sooner you leave, the sooner you come back,” Steve declares. His hands slip off of Eddie’s waist. “Go on, kid. Scram.”\n“I’m older than you by two years,” Eddie reminds him.  “Kid.” \nSteve just grins at him, toothy and cheerful, and suddenly he looks younger. His hair is flopping into his eyes, the lines between his brow relaxed. “I know, baby. It’s sexy of you.”\n“To be older?” \n“Stop  stalling, Edward Munson.”\n“It’s Edwin, actually,” Eddie corrects.\nMouth dropping open, Steve stares at him for a second before he laughs. His head tips back, his throat exposed and long and golden. “Is it really?”\n“Really, really,” Eddie confirms. \n“Now I'm stalling,” Steve sighs.\nEddie’s mouth quirks without his permission. Automatically, he grabs a strand of his hair and pulls it across his face. Chews the end shyly. \n“I know,” he tells Steve, because they  are stalling, and any longer Eddie is going to get into trouble.\nUncle Wayne’s really been cracking down lately, which Eddie gets, and is sometimes even grateful for. \nHe’s not grateful for it  today,  shit.  \nBehind them, the front door bangs open, shattering the morning quiet and the soft moment. \nEddie leans his head back against his van and groans.\n“Hey! You leaving?” Robin hollers down to them from Steve’s front door, arms folded across her chest.\n“Yeah, Buckley!” Eddie hollers back, and Steve winces. Eddie frowns at him apologetically but Steve just flaps his hands dismissively, taking a couple large steps back.\nGrumpily, Eddie finally turns and unlocks the door to the van, sliding in behind the wheel. \nWhen Eddie rolls down the window to say goodbye to Steve for real, Steve is shaking his head and sighing. “She’s gonna give me so much shit.”\n“Wheeler, too,” Eddie agrees.\n“Fuck, and Jonathan,” Steve groans. “I’ll probably deserve it though.”\n“Hey,” Eddie frowns. Because giving friends shit is fine, they all do it all the time, but something about the way Steve just said Jonathan’s name… there was real dread, there. Just for a moment. And Eddie doesn’t know if it’s just Steve, being self-deprecating like he sometimes is, or if there’s really something to be worried about. Eddie doesn’t know Jonathan Byers very well, after all.\n“You need me and I’m here, sweetheart,” Eddie says, because it’s the only thing he  can say. It’s the only thing that’s true enough. \nSteve stares at him for a moment and then leans in through the window. “I know, Eds,” Steve tells him. He presses a sweet kiss to Eddie’s mouth and Eddie sighs helplessly. \n“Alright,” Eddie says. “Just as long as you know.” \nFinally, Steve backs up, raising a hand and watching as Eddie pulls out. As he reverses, Eddie catches a glimpse of Robin leaping off the front porch and dashing over to Steve, arms waving, as Nancy and Jonathan Byers appear in the door behind her. \nAll of them are grinning, even Steve.\n Especially Steve. \nEddie cackles, tension dissolving into something cheerful and bright, and then flicks his stereo. There’s a tape already in:  Kiss,  and immediately  I Was Made For Lovin’ You comes blaring through his speakers. \nTossing his head back, Eddie sings along and thinks about Steve.\n \n \nUncle Wayne is already awake when Eddie gets back, because of course he is. Eddie loves Uncle Wayne with his whole heart, is immeasurably grateful to the man, but fuck if Uncle Wayne doesn’t  piss him off sometimes. Shit, but Eddie can never sneak anything past him. \nEddie sits in the dirt driveway and drums his fingers against the wheel. Okay. Fine. Okay, he’s just going to have to go in and brazen it out. There’s nothing else for it.\nBesides, Uncle Wayne sat Eddie down when he was sixteen and, in the most awkward display of emotional competency Eddie has  ever  seen, told Eddie:  look, it’s fine. You being the way you are. Alright? You don’t have to keep sneaking that boy through your window.  \nEddie hadn’t even been sneaking him in for sex, was the thing. He’d already started selling, and the guy had wanted ket for a party.\nBut Eddie hadn’t corrected Uncle Wayne, because Uncle Wayne thinking he was a queer was actually better than what he really was, which was a drug dealer. And maybe he was kinda queer. Eddie at sixteen hadn’t exactly been decided yet. \nUncle Wayne found out about the drug dealing three months later anyway, and hadn’t  that been a hell of a fight.\nAnd now here Eddie is, twenty years old with hickies down his neck and no way to hide them. \n“Aw, fuck,” Eddie sighs, and then climbs out of the van. \nThe door slams behind him and he crashes up the trailer steps, lets himself in the door. Uncle Wayne is sitting on the couch, bowl of cereal in hand and one of his many mugs on the coffee table. He’s watching the news.\nThey stare at each other for a minute, Uncle Wayne calm and unmoving, Eddie simultaneously frozen in place and vibrating out of his skin. \n“Milk’s already out, if you want cereal,” Uncle Wayne says, and just like that he can move again. \nEddie rustles through the cabinets to find his Cheerios. He pours himself a bowl, studiously avoiding eye contact with Uncle Wayne. He thinks maybe he’s about to chew right through his bottom lip. \n“Sit down, boy, I’m not gonna bite,” Uncle Wayne tells him.\nEddie sits.\nHe clambers up next to Uncle Wayne on the couch, pretzeled and twisted so that he can hide his face in his knees if he needs to. He tries to focus on the news, on his cereal, but he keeps glancing at Uncle Wayne out of the corner of his eye.\n“Thought you were going to that Harrington kid’s house,” Uncle Wayne says after a while.\nA half-hysterical laugh bursts out of Eddie. “I did,” he cackles, and then shoves a spoon full of cereal into his mouth. He sort of chokes on it, but it’s better than letting himself talk. \n“Big party?” Uncle Wayne asks.\nWhen Eddie glances over at him, his brow is furrowed, the deep and strong lines of his face plain in the sunlight. \n“Uh, no,” Eddie says. “No, there were only five of us. Six including me.” \n“Hm,” Uncle Wayne says. \nIt’s so hot in the trailer, the sun beating in through the windows. It must be hot, because that’s the only reason Eddie’s cheeks are burning. Why his whole body feels like it’s on fire with embarrassment. It’s hot in the trailer, and if Uncle Wayne asks, that’s what he’ll say. \nHe focuses on his cereal. He shovels it down, milk dripping from the corner of his mouth. Eddie swipes it away with the back of his hand and orders himself, frantically:  do not think about coming on Steve’s face.  \n“I know you’re grown, kid, so you don’t have to tell me,” Uncle Wayne says, and the sentence is so out of left-field Eddie turns to look at him. Uncle Wayne’s eyes are twinkling, the pale blue suddenly bright, suddenly playful. He looks like he did years ago, when he still swung Eddie around on his shoulders. Still chased him around in the yard.\nUncle Wayne is trying to hide his smile behind his coffee mug but it’s not working. \n“Tell you what,” Eddie says warily. \n“Who gave you all that?” Uncle Wayne asks, gesturing at Eddie with his mug. His eyes track down Eddie’s neck, linger on his dirty shirt, then come back to his neck. “You look like you lost a fight with an octopus.” \nEddie opens his mouth. Shuts it. Sticks another spoonful of cereal in it, just to buy time. \n“You don’t have to tell me,” Uncle Wayne says, his gruff voice gentle. “But… we used to tell each other things. You remember that?” \nAnd Eddie does remember. He remembers being eight, ten, twelve, and running up to Uncle Wayne every Christmas. Babbling his ear off. Biking down to the trailer with a baseball glove and a stack of books, pestering Uncle Wayne on his day off. Forcing Uncle Wayne to let him help with cars, with the A/C unit, with the squeaky door. The two of them talking and talking and talking.  \nWhen Eddie moved in permanently at thirteen years old, it seemed like divine intervention. A blessing. The best thing that ever happened to him.\nWhen did he start taking Uncle Wayne for granted?\n“Hey now, kid, it’s alright,” Uncle Wayne tells him, and Eddie quickly scrubs a hand across his cheek. It comes away wet, because he’s crying.\nShit, he’s always been such a crybaby. \n“Sorry,” Eddie blusters. “Sorry, I don’t know why I’m crying.”\nUncle Wayne starts, “It’s alright—”\nBut Eddie cuts him off. “I’ve just been, like, I’m sorry I’ve been such a piece of shit to you. And don’t say I haven’t been, okay, I know I have been— failing classes and not taking anything seriously and  selling drugs to minors  out of  your home, and you could’ve gotten in so much trouble for that, but you—”\nEddie stops himself. He takes deep breaths, winding himself down, and scrubs his face again. \n“Just. Thanks,” Eddie says. “Thank you for… keeping me. Even though I made it really hard.”\n“I love you,” Uncle Wayne tells him. “You’re my kid, Eddie. I don’t tell you that enough, but you are. You’re my boy, alright?”\n“Yeah, alright,” Eddie sniffs. “Alright.”\nThey sit in silence for a while. They eat their cereal.\nEddie chases the last three pieces around his bowl with his spoon, watching them spin through the milk. He scrubs his cheek against his shoulder, wiping off the last of his tears, and glances at Uncle Wayne again. \nHe clears his throat. Smacks his lips. Reminds himself that he used to tell Uncle Wayne everything, and besides, Uncle Wayne told him it was fine years and years ago. This is no big deal.\n“So, you know. Uh.” Eddie hesitates and then turns, fully, so that he’s facing Uncle Wayne. He crosses his legs and sets his cereal bowl down. \nUncle Wayne sets his mug down, turns to look at him. He’s got that patient look on his face, the same one he wore when Eddie was nine and explaining DnD to him. \n“Steve Harrington,” Eddie blurts.\nUncle Wayne blinks at him. He frowns. Scrubs a hand across his chin and blinks more.\n“Steve Harrington,” Uncle Wayne repeats. “Hm.” \nEddie fidgets. “You know him?”\n“‘Course I know him,” Uncle Wayne responds, still frowning. “Know his daddy, too.”\n“Oh,” Eddie says, then hesitates. \nUncle Wayne peers at him, his pale eyes piercing Eddie and holding him in place. “He good to you?”\n“Of course he is,” he says, because of course Steve is.\nDespite himself, Eddie flushes. It’s embarrassing, how quickly his response came. His cheeks burn red and he knows it, but he can’t keep it from happening. All he can do is think of Steve.\nSteve and his gentle, strong hands. His broad shoulders, his furrowed brow. The firm set to his mouth that’s always there, even though he’s quick to smile. The kindness that pours out of Steve, like he’s so full of it it just spills out of him. The way he stands in front of Eddie, in front of the kids and Robin and Nancy, every time danger comes knocking. Comes howling at them with teeth. \nHe thinks of Steve, blood down his chin, gaping wounds in his side. Steve wearing his vest. Steve holding him by the waist in the pool. \nSteve, vulnerable in the dark, blushing when Eddie calls him  honey,  calls him  sweetheart.  The incredulous, honest way he’d looked at Eddie, surrounded by friends in his living room, and said  don’t you know? \n“He’s really good to me, Uncle Wayne,” Eddie promises. He ducks his head and grins. “He thinks I’m sweet. How fuckin’ weird is that?” \n“You are sweet,” Uncle Wayne tells him, his eyes soft. “I’m glad that boy knows it.”\n“He’s so… like, it’s crazy, because he’s  Steve, but he’s so…” But Eddie can’t figure out what he wants to say. Something about Steve being a jock, maybe. Something about how Steve acted three years ago, but then, Eddie didn’t know Steve three years ago. None of it is really important anymore, is it? \nAll Eddie knows is Steve now: Steve in the deep blue night, Steve under the red lights of hell. Steve wrapped around him in bed, kissing him with tongue. Holding him tight. \n“Let me just say this, then I’ll drop it,” Uncle Wayne says. His face is serious, lined and stern. He could be carved from stone.\nEddie gulps nervously and prepares to, like, defend Steve’s honor.\n“You listen to me, Edwin, alright?” Uncle Wayne says. “You’re my boy. And if  your boy ever needs a place to stay, he’s welcome here.” \nWhen Uncle Wayne pauses, Eddie stares at him incredulously. His heart is pounding, racing. \n“I don’t know Steve, but I know his daddy. And if you say Steve’s your sweetheart, then he is, and if that makes any trouble for  either one  of you, then you both come here. You come  home.  Got me?”\nEddie feels his eyes well up again.\n“Yeah, Uncle Wayne,” Eddie says. “I got you.” \nAnd then everything boils over until Eddie is sobbing on the couch, hands over his eyes and Uncle Wayne’s arm around his shoulders, just like when he was young. \n“I don’t even know why I’m crying,” he blubbers. “I’m, like, really happy. I’m relieved!”\n“Hush now,” Uncle Wayne tells him, and pulls Eddie in tighter. \nAnd then that’s it: there’s no interrogation, no yelling. Uncle Wayne lets Eddie cry it out, then makes him a cup of coffee. He doesn’t say anything more about the way Eddie’s been used as a chew toy. Doesn’t do anything other than talk about where they’re putting the garden, and how he got one of those raised beds to keep the plants in. \nIt’s a tiny, tiny drop of truth in an ocean of lies. In the huge fucking wave of lies that threatens to drown Eddie every day: lies about his grades, about the bullying, about the drug deals, about the monsters and Chrissy and the hell dimension he’d walked through.\nBut: he told Uncle Wayne about Steve, and it went alright. Maybe, some day, he can tell Uncle Wayne about the other stuff, too. Maybe it can be like it was when Eddie was a kid and all he ever needed was attention from his Uncle Wayne.\nOnce Eddie is a little steadier, Uncle Wayne takes him outside and hands Eddie a bag of dirt. Eddie wheezes and complains but carries it over anyway, Uncle Wayne right behind him.\nIt’s June. It’s warm. Eddie’s got bruises down his neck and chest and thighs. He’s going to see Steve Harrington later, and they’re going to eat dinner and kiss and kiss and  kiss. He’s got dirt on his hands. Tomato seeds in the pocket of his black jeans. \nHe helps Uncle Wayne plant a garden."
}