{
    "id": "39594324",
    "url": "https://archiveofourown.org/works/39594324?view_full_work=true",
    "author": [
        "oaseas"
    ],
    "title": "open up your lovin’ arms (i want some, want some)",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Stranger Things (TV 2016)"
    ],
    "relationships": [
        "Steve Harrington/Eddie Munson",
        "Steve Harrington & Dustin Henderson",
        "Robin Buckley & Steve Harrington",
        "Steve Harrington & Nancy Wheeler"
    ],
    "characters": [
        "Steve Harrington",
        "Eddie Munson",
        "Nancy Wheeler",
        "Robin Buckley",
        "Dustin Henderson"
    ],
    "additional_tags": [
        "Getting Together",
        "First Kiss",
        "Flirting",
        "Alternate Universe - Canon Divergence",
        "Post-Season/Series 04",
        "Bisexual Steve Harrington",
        "Dustin Henderson is the Best",
        "Brotherly Steve Harrington & Dustin Henderson"
    ],
    "language": "English",
    "series": "Part 1 of masterlist of my stranger things works",
    "published": "2022-06-12",
    "completed": null,
    "words": "7,312",
    "chapters": "1/1",
    "comments": "369",
    "kudos": "13,489",
    "bookmarks": "2,194",
    "hits": "83,978",
    "summary": "<p>Dustin's concerned Steve's going to die alone. Steve's concerned Dustin won't ever understand the concept of boundaries. </p>\n<p>Or: Dustin attempts to save Steve's love-life.</p>",
    "notes": "<p>(title from 'you spin me round (like a record)' by Dead or Alive)</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>me last week: idk im neutral abt them</p>\n<p>me at 9am today: hey tam, we've got a problem. </p>\n<p>me at 9pm today: hey tam, i've posted the problem. </p>\n<p>next up - RoNance</p>",
    "text": "After the dust settles and things start to resume their post-Upside-Down norm for the  fourth  time, Dustin starts acting weird. Not in a bad way — in fact, Steve doesn’t even notice at first. Dustin starts hanging around Family Video more often, always lingering by the desk whenever Steve’s deep in conversation with a girl. He starts hovering. He starts staring. \n“Out with it,” Steve eventually says, tired of whatever game Dustin’s playing. “What are you doing here?” \nDustin smiles, innocent. “I just wanted to see you,” he says, looking up with huge eyes like he knows he can make Steve fold. It only works a little bit. \n“Nice try,” Steve says, flatly. He folds his arms across his chest and leans over the desk. “Wanna give it another go?” \n“Fine,” Dustin says. “I’m worried about you.” \nThis pulls Steve up short. It’s an unusual sentiment from Dustin. “Okay,” he contemplates, slowly, drumming his fingers on the countertop. “Would you like to … elaborate on that?” \nDustin, ever-blunt, says, “You’re not doing anything with your life.”\n“Okay, fuck you. Out you go.”\n“No, no, Steve, wait. Okay, I could have been more tactful.” Dustin pleads, raising his hands up as a sign of surrender. “I didn’t mean it  that  way; we’re all very grateful you turned down college to stay here even if you don’t wanna admit it.” Which, okay, how the fuck— “But, I mean you’re … you know,  lonely.”\n“No I’m not,” says Steve, because he isn’t. Yes, sometimes he does watch Robin’s lingering gaze catch on Nancy. Sometimes it cuts to see couples flirting between the shelves. Sometimes he watches Max and Lucas do their back-and-forth and feels maybe a bit bereft, but he’s not  lonely.  \n“Steve, I haven’t seen you go on a date in weeks, maybe even  months!” \n“And why is that your business?” Steve smooths a tired hand down his face. “Seriously, it’s none of your concern what I’m doing with my … with my love life.” \nDustin pillows his arms on the counter, resting his chin on them. Steve wonders when Dustin's growth spurt will really kick in. He won’t be a beanpole, but Steve’s convinced he’ll fill out in his shoulders, probably end up with the football physique Steve never quite achieved himself. \n“What about … Linda? From the diner across town?” \n“Linda is twenty-seven,” Steve says, flatly, “and I’m pretty sure the cook is her baby daddy.” He cocks his hip, biting absently at his thumbnail. “Just because she gives us an extra waffle when we go doesn’t mean I’m gonna hook up with her.”\n“This is more than a hookup, Steve,” says Dustin, offended. “I am helping you look for  love.” \nBefore Steve can so much as snort derisively, someone speaks up.\n“Might be worth letting him help.” \nSteve just about has a heart attack, shooting up ramrod straight and bumping the phone off its hook. “Holy shit,” he curses, hand over his chest like he’s clutching at pearls. “Where the  fuck did you come from, Munson?” \nEddie grins. “I was just standing here at the shelves, Stevie. Not my fault you can’t keep track of your customers.” \nDustin rocks back and forth on his feet. “Eddie!” He cheers, leaning into the gentle side hug Eddie bestows upon him. “You think Steve should listen to me, right?” \n“Sure. You’ve been known to have the occasional good idea.” \nEddie’s not wearing his jackets today. His shirt is plain, a deep navy blue that compliments the pink tinge to his cheeks. The internal heating in Family Video is bust, leaving them all sweating in winter and close to heatstroke in summer. His hair is perfectly curled, his Bambi-brown eyes sweeping up to meet Steve’s gaze. \nSteve wets his lips and looks away. “I don’t need you to hook me up with anyone.” \n“Steve,” Dustin says, carefully, gaze darting to Eddie. He looks a bit apologetic when he says, “I’ve been coming in every day for two weeks. In that time, you’ve hit on no less than seventeen girls, and each and every one of them has either left within minutes or name-dropped their boyfriend several times. You’re striking out.”\nSteve’s humiliated. Shame tickles his gut. He wishes Eddie would just leave so that Dustin’s blunt honesty would only meet Steve’s ears. His shoulders hike up without his permission. \n“C’mon, Henderson.” Like a divine being parting the clouds, Eddie steps in. “Lay off. We just came outta one of the most traumatic weeks of our life. I think it’s only fair Harrington has time to get his shit back together.” \nSteve wonders if it’s worth getting punched to lean across the counter and kiss him. Not that he would want to, just like, you know, as a favour for saving his reputation and feelings. Steve shakes his arms out, suddenly full of restless energy. \n“Okay, but I’m just concerned. I’m worried he’s still not over Nancy.”\n“Dustin,” Steve says, sharply. “C’mon, dude. Not cool. Leave it. I told you that it’s over between us; you gotta take my word on that.” \nEddie eyes him consideringly. His face is a frustratingly blank slate, but the deep amber-brown of his eyes are hypnotising and speak volumes. Unfortunately, Steve's never been a great reader. They spend a beat staring at each other before Steve tugs himself back into the conversation. \n“You could try for Susan Peckley? She’s on the cheer squad, so—”\n“She’s a teenager. No.”\n“Steve,  you’re a teenager.” \nSteve presses his fingers against his temples and massages. “Let me clarify, she’s an  underage teenager. No high schoolers, even if they’re eighteen.” \n“Is that why you won’t kiss Robin?” \nNow the conversation is really over. Steve does his best not to glare at Dustin, because he gets this all comes from a genuine place of love, but it’s difficult. Eddie, ridiculously observant as always, tucks two hands behind Dustin’s back and starts shoving him at the shelves.\n“Alright, pipsqueak,” he says, chidingly. “Why don’t you go find a movie for tomorrow night, alright? Make sure it’s scary, none of this boring zombie shit. Let the adults talk.” \nAnd maybe Dustin’s a little bit perceptive too, because instead of whining he casts Steve an apologetic puppy-eyed look and trudges off to the corner of the store. \n“You’ll have to rent it out under your name,” Steve says. “He’s probably gonna find something R-rated.” \nEddie shrugs. He fiddles with the thin, gold necklace that sits over his shirt. His rings shine a little in the white light of the store, chipped red polish coating his nails. Steve dithers. He has no idea what to say. He feels nervous, always so nervous whenever Eddie is around.  \n“Didn’t realise babysitter was synonymous with brother. Guess it kinda makes sense, given how much the two of you think the sun shines outta each other’s ass.” \n“You can have him,” Steve mutters, exhausted. \nHe slumps forward and pillows his chin on the palm of his hand. This has the unfortunate side effect of bringing him much closer to Eddie. From this angle, glancing up, Steve can see the lightest sprinkle of freckles across Eddie’s cheeks. He pushes down the sudden urge to press his fingers into them. Weird. The summer heat is driving him loopy.\n“I’d want a refund pretty quick,” Eddie murmurs, laughing. His eyes glimmer, mouth twitching with mirth. He shuffles to the side and stoops as well. It’s not a very comfy position for either of them, given their height, but it does bring them back to eye level. “Is he always like that?” \nSteve hums. “Kinda. I guess he’s decided it’s pathetic that I’m single when he’s not, so here we are. I’m worried he’s gonna start matchmaking me with like, Maggie Jones.” At Eddie’s blank look, he tacks on, “You know, about fifty, smokes ten packs of cigarettes a day, hits small children with brooms when they get in her way?” \nA few weeks ago, Steve heard Eddie laugh for the first time. When the rubble had cleared and Steve had been on the brink of death from blood loss for the second time, Eleven had said, exhausted, ‘it’s over.’ Eddie had fallen to his knees with a heavy groan and then burst into hysterics. It had quickly morphed into sobs but really, at that point, his reaction had been more than warranted. \nThe laughter Eddie gives now is lighter, breathier. He presses the palm of his hand into his mouth, like he doesn’t want to admit he thinks Steve is funny. Something smug takes a seat in Steve’s rib cage. Steve Harrington’s still got it, he thinks, and then feels only somewhat pathetic. \n“I dunno, Mrs Maggie Harrington kinda has a ring to it. Plus, she’s got a van, right?”\n“For her several thousand cats, yes,” confirms Steve, unable to help his smile. One of Eddie’s hands rests on the desk between them; Steve reaches out to poke at one of the rings unthinkingly. \n“You could repurpose the van for your toddler squad,” Eddie hums. He turns his hand over and lets Steve slide the ring off. “Henderson loves cats, right? He’d be all for it. All  fur it.” \nSteve slides the ring on. It’s slightly too big for his middle finger, but fits well around his thumb. Eddie’s fingers are wider, he thinks idly, and his hands are a little larger. Eddie makes no move to take the ring back, instead continuing to list off several cat-related puns. \nSteve lets himself watch, chin pillowed. Eddie’s expressive, always swaying into everyone's personal space and going off on tangents that fly over Steve’s head but are entertaining nonetheless. His hair bounces as he does, long lashes dusting his cheeks as he screws his face up in thought. \n“Don’t worry, Stevie, we can get you a girl.” \nI don’t need one, Steve almost says. He hasn’t dated anyone since Nancy, and the handful of dates he’s been on have felt lacklustre. There’s something missing. He doesn’t know what, and he doesn’t know how to find it, but something doesn’t fit. \nSteve worries at his bottom lip. “What about you?” he says, after a bit. “You got a girl?” \nEddie messes with his hair. He runs his fingers through the curls and tugs at a ringlet. “No,” he says. “Between being the town freak and then the town serial killer, I haven’t exactly had time for romance.” He smiles thinly. \nSteve hates it. “Fuck it,” he says, shrugging. He spins the ring around and around. “We can be single together. Maybe we’ll make it a trend, y’know?” \nEddie’s smile smooths out, becoming fuller, warmer. “Singles Club? It’d be what, you, me, Robin. Yeah, listen, that could work. In fact, I motion that we meet every Wednesday to cry about it.” \nSteve ducks his head as he laughs, pressing his fingers into Eddie’s forearm. “I think you’re missing the point, Munson. We’re  happy being single. Being single is the new taken.” \n“You are insane,” Eddie murmurs, patting Steve’s hand. Steve’s fingers tingle like he’s swallowed a can of fizz, so he curls them into his palm, chasing away the feeling. “I better go find the pipsqueak,” Eddie sighs. \nHe disappears into the shelves before Steve can make an excuse for him to stay. When he hangs the closing sign up later that night, the moonlight catches on his thumb. Eddie’s ring, thick black band with little green gems, looks back up at him. \n\n\n\n\n\nDistressingly, Dustin really doesn’t let the matchmaking go. On Sunday, Robin sits in the backroom counting through new stock while Steve mans the counter. Given it’s so early, there’s nothing much to do beyond straighten fliers, snoop through the records, or consider which Star Wars movie should play on loop today. \nSteve fiddles with  The Empire Strikes Back, bored out of his mind. He stares down at the ring on his thumb. Two weeks ago Eddie let him steal it, and Steve keeps meaning to give it back but, well, he gets caught up in whatever Eddie’s talking about, or in listening to him grumble about the record shop refusing to stock heavy metal, or watching him play air guitar, and forgets. It’s easy to forget himself around Eddie. He doesn’t want to know why. \n“Hey, did you see that Keith ordered  porn?  Can we get him fired for this? It’s not even  good  porn. Listen, I’ll read the back cover—” \nSteve pushes the door open to the back room and peers in to see Robin sprawled across the floor, eyes wide and expression disgusted. \n“Rob,” he says, “let’s think this through.”\nRobin looks up at him. “If you’re about to stand up for him…”\nSteve interrupts with a wave of his hand. “No. See, I’m thinking, it’s about time we had a holiday, right? And Keith probably doesn’t want to lose the only position that gives him some power. I say we threaten him into a week off, still paid.” \nRobin’s grin seeps across her mouth slowly. Her eyes darken, devious, impressed. “My, my, the Russians  did change you.” She tosses him the VHS. “Hide it in my locker. Keith’s more likely to check yours than mine. He’s on the close tonight — I cross over with him. Let’s make this happen.” \nSteve’s still laughing when they duck back into the main room twenty minutes later to the sound of the doorbell chiming. Dustin Henderson idles at the doorway, headphones blasting something chaotic and drum-heavy into his ears. Probably the work of Eddie. \n“No Munson means no R-ratings,” Robin reminds Dustin, hands on her hips. \nDustin turns his tape deck off, headphones pooling around his neck. “But Steve’s here,” he whines. \n“Steve can’t hear you,” says Steve, shoving  The Empire Strikes Back  into the TV. “Steve also thinks little kids should know we have  The Dark Crystal back in stock, which is a pretty good movie, even if Kira looks like Tammy Thompson.” \nRobin smacks him. Steve laughs, catching her hand and tugging her in a circle as he croons the national anthem. They’re halfway through the first verse, laughing into each other’s shoulders when Dustin clears his throat and raps on the desk. \nDetangling themselves, Steve rolls his eyes. “Fine, you can hop the counter, but  only ‘cause it’s too early for anyone to see.” He and Robin side-eye each other. Steve grins, malicious, “And only ‘cause we got something to hold over Keith forever.” \nRobin puckers her lips and makes an obscene gesture, so of course that sets them off again. When they finally straighten, Dustin’s standing near the TV, more than a little confused. He teeters on the edge of saying something. Steve watches him shove his hands in his pockets, rip them back out, brush the palms against his pants, and rinse and repeat. \n“Do you not like boys, Robin?” he eventually asks in such a rush that it takes Steve a second to parse. When he does, he freezes. Dustin blinks. “That’s the only other reason I can think of. You know, that you guys wouldn’t be …” He waves his hand between the two of them. “Dating.”\nSteve has a hand around Dustin’s arm before he can think. Not aggressively, or angrily, just a firm grip that he uses to tug Dustin forward. \n“Henderson, I love you, but you’re crossing a line, man. You can’t just toss that shit around — you have no idea what it could do.” \n“I know some people are gay, Steven.” Severely unimpressed, Dustin folds his arms across his chest, dislodging Steve’s grip. Despite the store being empty outside the three of them, Steve and Robin both stoop to hush him. \n“Dustin,” Steve starts, catching the panic that’s beginning to make Robin shake from the corner of his eyes. He reaches out to loop their fingers together and she grabs his hand tightly, palm sweaty. “If you know that, then you know you need to be careful, right? This … this is serious, Henderson.”\nIncredibly, Dustin looks more upset than Robin for a moment. “I’m not,” he starts, loudly. He shuffles closer to hurriedly whisper, “I’m not homophobic! Lady Kalevala likes women.” Dustin looks up at Robin with huge, beseeching eyes. \nSteve hears her suck in a breath. “Who the hell is Lady Kevlar?” To her credit, she sounds only slightly strangulated. \n“Kalevala,” Dustin corrects. Then he tosses his hands up. “Honestly, this is why you should really come to our campaigns,” he mutters. Then he steps closer still until they’re all pressed into a tiny group huddle just behind the desk. “She’s one of the main villains in Eddie’s latest campaign. She likes girls. But!” Dustin raises a finger and says, firmly, “It’s important to note that she isn’t evil  because  she’s gay. She just so happens to like both women  and world domination.” \nSteve feels like he’s been punched in the face. In a way, it’s not really surprising Eddie is cool with the whole gay thing. After all, he’s a social pariah, a reject, and unfortunately, Steve knows a lot of people like Robin are shoved into the same category. \n“Really?” Robin asks, quietly. Her fingers have lost their desperate grip, but Steve doesn’t let go. He thumbs the back of her hand as comfortingly as he can. “He’s uh, he doesn’t care?” \nDustin nods. He shuffles a little and then reaches out only to pause, an aborted, awkward movement. After a moment, his fingers settle lightly around Robin’s forearm. Carefully, he says, “None of us do. It took Mike a bit to come to terms with it, but I think that was ‘cause there was —” He stops. “Actually, I don’t think I should explain why. But listen, we’d all have your back. You know, if you  did like girls.” \nRobin’s laughter is shaky and maybe a tiny bit wet. Steve slides his arm around her waist and she wilts into his side with a hiccup. \n“Christ,” she murmurs. “Jesus Christ, Dustin.” \nDustin hovers, unsure, glancing between the two of them. \n“I like girls,” Robin says, very quietly. \nDustin smiles that gummy little grin that Steve adores. “Cool,” he says. “‘Cause you kinda remind me of Kalevala. Not the evil bit, but she’s super kickass.” \nRobin beams. “C’mere,” she says, tugging Dustin forward. He crashes into the two of them and Steve is quick to wrap an arm around the kid’s back. “You’re alright, Henderson. I think I get why you’re Steve’s favourite.” She runs a hand through his hair, ruffling it. \n“Yeah,” says Steve, simply, because she’s right. Dustin is his favourite. “But hey, now you’re in the know, make sure you don’t go blabbing. And maybe give it a rest about us getting together, ‘cause like…” \n“Never in a million years,” Robin laughs. “I got better taste, y’know.” \nDustin’s resulting laughter only gets louder when Steve whines out an indignant, “Hey!” \n\n\n\n\n\nWith Robin’s coming out, Dustin manages to lay off for a solid three weeks. Then the summer holidays finally bloom on the horizon and with it, a lot of free time for the kids. \n“Steve,” says Dustin on Tuesday, chowing down on an ice pop. The sticky blue syrup drips down the pole to puddle against Dustin’s wrist, dripping onto the floor every now and then. \n“Off the carpet, Henderson,” says Steve. \nDustin sits on the counter. Steve shoves a rag under his wrist with a grumble, fruitlessly trying to keep his hair off his forehead. The aircon is  still fucked, and at the rate he’s going, he’ll be dead of heatstroke before Robin makes it in the door. \n“So I was thinking,” Dustin says. He offers his ice pop to Steve, which,  gross,  and when Steve gently shoves it away, shrugs. “Your loss.” He slurps on the treat for a bit, and then continues. “So I was thinking. Robin's off the table, and you don’t like Linda, you don’t like Meg, Susan, Patty,  or Melanie.” \nSteve is patient. Steve is kind. Steve is not mean to kids. He smiles politely and uses all his willpower to keep from shoving Dustin off the desk. Kid’s barely got any bones as it is — he doesn’t wanna damage what’s left. \nDustin worries at his bottom lip. Steve is abruptly reminded of their conversation with Robin, just a few weeks ago. He narrows his gaze, prodding Dustin’s knee. \n“Out with it, Henderson,” he says. \n“I was just thinking …” Dustin stops. “Listen, it’s … okay, I  know you said you don’t like Nancy. I know you did. But, it’s only... Mike says she and Jonathan broke up, and that they’re both surprisingly okay with it, and that Nancy has her eye on someone.” \nIt’s like being hit by a bus. Steve’s breath catches in his throat and for a brief second, panic floods through him. “It’s not me,” he says, firmly, quickly. The thought that it might be isn’t pleasant. Steve’s not sure when his love for Nancy finally morphed into something more platonic, but he’s certainly just become aware that it has. \n“I know you’re nervous or scared or something about it,” Dustin says, thankfully not recognising Steve’s shortness of breath and sudden near-fainting as alarm. “But Nancy’s cool. She can use a gun really well, she’s  super  smart, and she’s got great hair. You have great hair too, so your kids would  definitely be perfect.” \n“Woah,” Steve cries, pushing himself away from the desk. His palms leave sweaty outlines against the countertop. “Uh uh, no. Dial it back a notch, buddy.  No.  No kids, no Nancy, no … no whatever this is.”\n“But  Steve,” Dustin whines, discarding the remnants of the ice pole onto the cloth. “I really think you should at least talk to her. I even told  her that, and she said yeah, you guys should.” \nOh no, Steve thinks. Oh no. Jesus fucking Christ, no. \n“You guys are meant to get milkshakes after your shift. I said you’d pick her up.” \nWhether from the heat or the horror of the conversation, Steve crumbles. He drops to a squat, gripping the shelves behind the counter for dear life. His head swims, his lips are steadily becoming chewed raw, and he wants to use Dustin’s mop head to clean the floor. \n“You are banned from Family Video,” Steve says, upon resurfacing. “I don’t wanna see you in here for the rest of the summer. Scram.” \n“But you’re gonna see Nancy, right? Because it would be fucked up if you didn’t.” \nThe thing about Dustin is that he’s kind, but he’s so unreasonably and frustratingly stubborn. \n“I love you,” Steve says, measuredly, “but I’m very upset with you. I’ll see Nancy, because we both should finally clear the air, but I want you to seriously stop messing with my love life, okay?” \n“I love you too,” says Dustin. He looks shell shocked and ashamed in equal parts. He clambers off the desk and shuffles on the spot, head ducked. “Sorry Steve,” he mutters. “I just wanted to help.”\nSteve brushes his fingers through the kid’s mop of hair. “I know,” he says, “but you gotta let this one go, okay? Go on. Let me cool off. I’ll see you Thursday for dinner with your Ma, anyway.” \nDustin nods. “Okay,” he says, dejected. “Bye Steve.” \nHe wanders over to the door, forlorn, and for fuck’s sake, Steve really hates the part of him that decided to quasi-adopt the kid, because he’s helpless to stop himself from rounding the desk.\n“Dustin.”\nDustin looks over his shoulder, hand on the door.\nSteve comes to a stop in front of him. “I know you didn’t mean to upset me. I love you, okay, kid? I’ll be over it within a half hour.” \n“Yeah.” Dustin purses his lips. “It was kinda shitty of me, I recognise that. I promise to let it go.” \n“Aw, Dust.” Steve sighs. “C’mere.” Even though it’s hotter than Satan’s ass, Steve scoops Dustin into a hug. It’s sticky and uncomfortable, but still pleasant. \nDustin melts into him instantly, squeezing the life out of Steve. “Sorry,” he says again, muffled against Steve’s shirt. “I’ll ask Ma to make chocolate mousse.” He pulls back, wincing when their skin sticks. \n“Fuck yes.” Steve grins. He pushes open the door and ushers Dustin outside. “I’ll see you Thursday,” he promises, watching Dustin wander off.\nThe rest of the evening passes too quickly for Steve’s liking. He spends forty minutes drafting a dot point speech, feels like a moron, blanks out halfway through  The Neverending Story,  and shuts Family Video half an hour early from panic. It’s not like Keith’s gonna tell him off, given he’s still having a heart attack over the porno scare.\nSteve practices his speech on the way to the Wheelers. He smiles at Nancy when she slides in the car, but they don’t speak until they’re seated in their booth, two vanilla shakes in front of them. \n“Dustin said you wanted to talk?” Nancy rests her hands on the table. She’s got a pretty gold bracelet on, with a little cherry charm. It reminds Steve of Eddie’s guitar, glittering ruby. \n“Uh.” Steve tilts his head. “No, Dustin said  you wanted to … Oh, yeah. Okay, this makes sense.” Steve sucks in a deep breath and thinks of his speech. Then he throws it out the window when he opens his fat mouth. “Cards on the table, I don’t wanna get back together.”\nNancy reels. Her eyes go round. “I didn’t realise that was … an option,” she says, carefully. She tucks a strand of hair behind her ears. She’s wearing a headband. It’s cute. “I don’t want to get back together either. Steve, we had a good time, and I did care for you, but. I don’t think we … I don’t think we were right for each other.”\nIt doesn’t sting the way it used to. Steve smiles. “Yeah,” he says, relieved. “I loved you, but now I love you in a different way. You’re one of my best friends, Nance. I wish we’d had time to sit down and talk about it.” \nNancy smiles. It’s a little sad, but she reaches across the table to squeeze his hand. “You’re one of my best friends too. I think it’s okay that it took us time to get here.” She takes a few gulps of her milkshake. “I guess you know Jonathan and I broke up, then.”\n“Dustin told me.” \n“Figured. He’s pretty good at secrets unless you’re involved.” Nancy still laughs with her whole body, nose wrinkling, eyes half disappearing beneath her bunched cheeks. \n“Luckily I’m a good secret keeper myself,” Steve whispers, glancing furtively around the diner. He splays his fingers on the table and says, “For example, I know Dustin calls Suzie  pumpkin-pie.” \n“No,” Nancy gasps. “Wait, I thought it was Suzie-poo?” \n“That too. I think he’s actually got a list that he cycles through. Snugglepants definitely came up at one point.” \nThey laugh for a little bit. Nancy catches him up on her and Jonathan, on the newspaper, on her college applications and acceptance letters. Finally, with the sun finally dipping over the horizon, the conversation comes to a stop. Steve watches her fiddle with her bracelet. She stares out the window absently, eyes far away.\n“Nance?” Steve touches the back of her hand, gentle. “What’s up?” \nNancy doesn’t quite meet his gaze. She fiddles with her straw, stirring it around the empty glass. Steve waits patiently; Nancy’s one of the few people he’d give all his time for. \n“I suppose Dustin also told you I have my eye on someone?” \n“Yeah, but I didn’t believe him or anything.” \nNancy’s laugh is more of a huff. “Yeah,” she says, quietly. “It’s not entirely a lie.” Now her shoulders fold in, hands dropping to her lap. Steve watches her wilt, concerned. “I don’t have my eye on one person, but…” \n“Nancy.” Steve reaches across the table, palm up. “Whatever it is,” he says, squeezing her hand when she places it in his, “I’m here for you. I have your back. We didn’t go through like, several apocalypse scares for you to not be able to trust me.” \nNancy sucks in a sharp breath. “What I actually said was that I had my eye on  something else.” Her gaze is intense, steely, sharp. “I meant women.” She doesn’t stutter, but her gaze darts left. “I’ve realised that there is a much bigger ocean of fish than I previously anticipated. I’m not a lesbian, but I did some research after Vecna … after it all. Have you heard of bisexuality?” \nIt’s like being sucked through a jet engine. It’s like hurtling towards Earth at a million miles an hour. It’s like the stupid fucking demobats chowing down on his stomach. \n“Steve?” \n“Sorry. Here. Present. Listening.” Steve stumbles over his words, sucking his bottom lip into his mouth. He clasps Nancy’s hand between both of his. “Not  judging,” he says, emphatically. “Very,  very  supportive.” \nThe steel seeps from Nancy’s eyes and spine. She folds halfway across the table with a relieved sigh, smiling just a little. “Okay,” she murmurs, “thank you.” \n“I don’t know what bisexuality means, though.” \n“It means I’m into boys and girls,” Nancy says. “That I don’t really have a preference.” She taps at the table, completely unaware of the revelation that’s unfolding itself in Steve’s mind. Both. You can like both. \n“Of course,” Nancy continues, “it’s all fluid. I’ve found far more men attractive, but there’s the occasional girl, you know? I like the weird ones.” Her lips twitch as she holds back a laugh. “You know, the ones that are unique.” \n“Wow,” Steve says, ignoring visions of Eddie’s hands and Nancy’s smile and every time he’d avert his gaze from shirtless guys in the locker room. “That’s why we didn’t work out, huh? Cuz I’m super normal.” He sighs, morose. “I wasn’t special enough.” \nNancy pats his hand. “Too cookie cutter,” she murmurs, sadly. “Didn’t have a secret passion for photography or own every Weird Al album.” \n“Like Robin,” Steve laughs. “She’s super into him!” He misses Nancy’s panicked look. “Not sure I see the appeal, personally.” \n“Right,” Nancy says, quickly. “So.” \n“So.”\nThey sit in silence for a little bit longer. Then Steve can’t take it anymore and leans over the table. “So, it’s like a thing then, to swing both ways? Bisexuality.” He sounds the word out, tasting it on his tongue, wondering if he’ll go home and look at himself in the mirror and try it on for size. \nNancy tilts her head a little. “Yes. Sexuality is a spectrum. Gender probably is too. I haven’t researched much about that yet, but I think I’d like to when I go to college.” \nSteve nods, pretends he understands what the spectrum is. “Well, it’s cool with me. I won’t go around telling people but uh,” he licks his lips, “I get the feeling you’d be pretty safe with a lot of  us.” He tries to emphasise his meaning, thinking about what Dustin had said to Robin a few weeks ago. \nNancy’s eyes widen, then narrow, then she tilts her head, puppy-like, and levels him with a thousand yard stare. It’s like she’s shifting through his every thought, digging her way down to his soul. Then she smiles. \n“Cool,” she says. “I’m glad I’m safe with  certain people.” She gives him a pointed look he doesn’t understand. He smiles anyway. \nSteve leans back in his seat. “Well, this has been great, seriously, but I do have to get home. I’m opening tomorrow, ‘cause I wanted the afternoon off.” \n“Big plans?” Nancy asks as they head towards the beemer. \n“Nah,” Steve mumbles. “Just seeing Eddie.” He slips into the seat, checks his mirrors, turns the key.\nNancy gives him another one of those looks he doesn’t understand. She squeezes his hand before he clutches the gearstick. “Have fun,” she says. “I hope it goes well.” \n“It will,” he assures her, confused. He feels like there’s a whole conversation going on above his head that he’s somehow still a part of. He has no idea what Nancy’s hinting at, but to admit that would be embarrassing. “I’m just gonna show him the mixtape I made for him.” \nNancy beams. “That’s sweet, Steve. I bet he’ll love it.” \nSteve smiles. “Hopefully.” He chucks the car into reverse. “C’mon, let’s get you home.” \n\n\n\n\n\nThe following evening, Steve raps his knuckles against Eddie’s door. The trailer he and his uncle were moved to is on the opposite end of the park. It’s a lot bigger and brand new, like the government really wanted to apologise for fucking them all over  again. Steve admires the half-dead plant in its vibrant blue pot outside the door while he waits. \n“Give me a cup of water so I can save this pitiful thing,” he says, when Eddie swings the door open.\n“Stevie!” Eddie beams. He falters. “Wait, what are we saving?” He peers out the door, mindless of Steve’s personal space, to glance around the park. \n“The pot plant,” Steve sighs, exasperated. He gently pushes Eddie away to trudge inside. He makes his way to the kitchen and rummages around to find and fill a cup. The water doesn’t sink into the soil which is a problem, but Steve doesn’t know enough about plants to solve it. \n“Um, so is that it? You came all the way over here from Casa Harrington to save my plant from death?” \n“I think it’s probably already dead,” Steve says, consideringly. He pokes the singular leaf on the plant and watches it break off, landing pathetically on the water-logged soil. “Well.” \nEddie snorts. “Alright, get in here before you kill something else.” \nSteve grins, feeling unexpectedly abashed. He bites at his cheek as Eddie prods him towards his bedroom. He leaves his shoes just to the side of the door and flops down on Eddie’s bed, which has been made for once. \n“What can I do for you, my liege?” Eddie plops down beside Steve. He’s wearing navy blue again, and tiny black shorts. Steve’s never seen so much of Eddie's bare legs before. It’s distressingly hard to keep his eyes away from the smooth, summer-tanned skin. \nSteve rummages through his bag to tug out the tape. “Made you this,” he says, waving it about. “I figure, you’ve been educating me for the past few weeks, enough that I know who Ozzy is.” \n“Thank God,” Eddie nods. \n“Now I figure it’s time to show you the wonders of pop.” \nEddie groans, flopping back on his bed. “Stevie,” he whines. His shorts ride a little higher up his thighs. Steve feels his ears burn. “You cannot be serious, Harrington. Isn’t it enough I let you play ABBA in the van?”\n“You fucking love ABBA!” Steve shouts. Offended, he whacks a pillow across Eddie’s face. “Shut the fuck up and put this shit on. I considered each track carefully.” \nEddie tugs the pillow away from his face, gets up, and begrudgingly shoves the tape into the player atop his robe. “Oh yeah?” he says, brushing back his hair. “Order of best to worst?” \nSteve desperately tries to hide his smile but he feels it split his face. “Nah,” he says, smug. “It’s actually in order of songs you’ll hate the most to songs you’ll hate the least. But either way, you’re definitely gonna detest everything you hear tonight.”\nEddie bursts into laughter, hand on his mouth as he folds at the waist. Pride at being able to cause such a reaction surges through Steve.\n“Steve,” Eddie says, shaking his head. “I don’t think you’ve really grasped the concept of a gift. Of course, it’s not your fault, considering you’ve only ever received them, and never actually given one before, my King.” \n“Hey, I do a lot of giving!” Steve cries. Then his face goes pink. “Wait,” he splutters, but Eddie has already lost it again, slipping from the robe as he falls apart. “Oh, fuck off,” Steve huffs. \n“Steve,” Eddie moans, wiping at his eyes. “You're killing me, man. Holy hell.” He settles back down at Steve’s side as the tape starts playing. “If I’m gonna suffer through the next thirty minutes or something, then so will you. God, is this Toni Basil?” \n“Hey Mickey, you're so fine,” Steve crows. “You fucking knew who she was, though!” \nEddie shoves Steve sideways, threatening to choke him out with a pillow. More than once Steve’s fingers graze Eddie’s bare thighs as they tustle, and more than once it sends his heart galloping about his ribcage. His cheeks hurt from how hard he’s smiling, heart and head dizzy with affection. I like you so much, he thinks. It’s much more comfortable to admit to himself than he ever thought possible. I like you, he thinks. I like Eddie Munson. \n“Oh my god,” Eddie sighs. “No, not  Wham!. Steve,  Steve …  come on. Don’t you love me?”\nYeah, Steve thinks. “No,” he says. “Take it like a man, Munson. Wake me up before you go go, baby.” \nEddie rolls his head to the left. His smile is small and exasperated. “Steve,” he murmurs quietly, as if delivering bad news, “I would  never.” \n“Asshole,” Steve chokes out around his laughter. \nEach song passes quicker than the next, bolstered by Eddie’s critique. Steve’s in stitches by the time Rupert Holmes’s  Escape  fades out. The tape wheels stop spinning. \n“Final thoughts?” Steve asks, kicking Eddie’s shin lightly. “C’mon, I saw you getting into that last one. If you like piña coladas and getting caught in the rain!”\nEddie rolls his eyes. “You saw me praying to God, actually. Which, fat lot of good that guy is, given everything that happened to us this year.” \nSteve rolls onto his side, propping his head up on his hand. “You mean you didn’t like bonding with a group of strangers through mortal peril and almost certain death?” \n“That’s the plot of many D&amp;D campaigns,” says Eddie, sagely, “which you would know if you fucking showed up.” He’s grinning, though. He sits up and Steve follows. “I guess it wasn’t all bad. This past year, and the cassette.” Eddie smiles down at his lap. “All things considered, senior year turned out a lot happier than I thought it would. I finally fucking graduated too, Jesus.” He spins the ring on his middle finger round and round. \nSteve’s suddenly aware of the one on his thumb. He’s taken to wearing it every day. At first, he’d convinced himself it was only so he’d be reminded to give it back. Now though, he knows why he never quite wanted to part with it. Still, it’s a little unfair to Eddie.\n“Hey.” Steve slides the ring off his thumb, sad to see it go. “I keep forgetting to hand this back to you. I kinda stole it.” He deposits it in Eddie’s palm. “Sorry.” \nEddie thumbs at the ring, amused. He reaches out and catches Steve’s hand in his, unaware of how Steve’s heart stumbles over its natural rhythm. His hands are warm, big, calloused from years of guitar. Eddie digs his thumb gently into Steve’s where the imprint of the ring still sits. Steve feels caught, like a trout on the end of a line. Their knees are touching. Eddie’s thighs are tantalising. Steve wants wants wants.\n“You didn’t steal it,” says Eddie. “I let you take it. Looked better on you, anyway. Totally badass.” He slides the ring back onto Steve’s thumb. “We need to do anything and everything we can to save you from looking like a prep, Stevie. Being a Wham! fan is bad enough.”\nSteve’s breath catches in his throat. “Shut up,” he says, weakly. He's caught up in how close they’re pressed together.\nSteve’s hand rests in Eddie’s like he’s delicate. No one has ever treated him this gently. When Eddie glances up, Steve realises they’re mere inches apart. This close, Eddie’s eyes are like a kaleidoscope of brown — chestnut, walnut, chocolate, and all the other shades Steve wants to research just to put a name to. They’re so close together. Eddie doesn’t move. His breath is a steady puff against Steve’s skin, neck craned awkwardly. Steve wets his bottom lip and feels something hot and heavy and right settle into his gut. Eddie’s hand is warm against his, and warmer still when Steve tugs it so that they’re holding hands properly, entwined fingers and all. \n“Steve,” Eddie murmurs, cautiously. His eyes are blown wide, stunned, and maybe a little hopeful. \n“I figured it out,” says Steve, blood rushing around his body and to his head so fast he feels dizzy. “Why Dustin’s matchmaking wasn’t working — why it was pissing me off.” \nEddie sucks in a deep breath. Cautiously, he leans forward so their foreheads touch, just so. His hair is soft, smells distantly of smoke, and his breath is warm, so warm. Steve slides his free hand up Eddie’s chest and presses it firmly to the smooth column of Eddie’s neck. His fingers splay against Eddie’s jaw.\n“Dustin kept pointing out all these girls. See, he was kinda on the right track. ‘Cause I like girls and all, but I  really like brown eyes. Brown eyes and curly hair.” Steve can’t tear his gaze away from Eddie’s mouth. “Pretty, too. I like when they wear jewellery, or eyeliner.” Finally, Steve gives in and tugs at one of Eddie’s curls. It's even thicker and softer than he thought it would be. \"I like when they make fun of me, just a little. I like when they bully me for enjoying ABBA, but play it in their car anyway.\"\nEddie sucks in a sharp breath. “Stevie,” he says, voice catching. His gorgeous eyes are wide, pupils blown, completely shocked. “You better not be fucking with me, ‘cause I’ll sic Robin  and Dustin on you— probably Erica, too.” \n“Guess who else fits that description, Munson?” Steve ploughs on. The air is thick with tension, Steve’s heart threatening to fall out of his mouth, his palms kind of sweaty. \"I'll give you a hint,\" he murmurs, feeling reckless and brave and desperate. \"There's only one person who's ever let me blast Waterloo outta their van.\" \nEddie's eyes fall shut like he's steeling himself.\nSteve can't take it any longer. “Eddie,” he implores, quietly. \nEddie opens his eyes. He doesn’t hesitate. He swoops forward that tiny distance, free hand cupping the back of Steve’s neck and finally,  finally kisses him. A gentle, hesitant slide that Steve is soon addicted to. He presses closer, half-falling into Eddie’s lap, and prods until Eddie’s mouth falls open. Their kisses become wetter, quicker, more desperate, until Eddie falls back with a heaving breath.\n“Jesus H Christ,” he gasps, shaking with laughter. “Fuck. They were  not kidding about that Harrington charm.” \n“I didn’t even get to give you a hickey,” Steve complains, grappling to tug Eddie into his lap. “C’mon, man, lemme really give you the Steve Harrington experience.” \nEddie laughs, pink and pliant and pleased. His knees sprawl either side of Steve's lap. “You’re gonna be a handful,” he says. He’s delighted, fingers warm under Steve's shirt, pressed just above the sensitive scars. \n“Yeah,” Steve promises, smiling dopily. His hands drift down to squeeze Eddie's thighs, finally getting to touch purposefully. Eddie squirms a little, face red but self-satisfied.\n\"Thought you'd like these,\" he says. \"I wasn't even sure you were into guys but I figured I'd test the waters. It's hot as fuck, anyway.\" \n\"You're hot as fuck,\" Steve mutters, swooping back in to kiss Eddie again. Eventually, they part, because it really is hot as hell. “Singles Club is cancelled. We just got an upgrade.”\nEddie laughs, big doe eyes gleaming, happy in that way Steve’s starting to associate with himself. “Better seal it with a kiss,” Eddie says, batting his lashes theatrically. \n“C’mere,” Steve says, and he does. "
}