{
    "id": "39684669",
    "url": "https://archiveofourown.org/works/39684669?view_full_work=true",
    "author": [
        "booksandmoviesbreakme"
    ],
    "title": "You keep me together, I'll hold you right back",
    "rating": "Not Rated",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Stranger Things (TV 2016)"
    ],
    "relationships": [
        "Steve Harrington/Eddie Munson",
        "Steve Harrington & Dustin Henderson",
        "Steve Harrington & The Party",
        "Robin Buckley & Steve Harrington"
    ],
    "characters": [
        "Steve Harrington",
        "Eddie Munson",
        "Dustin Henderson",
        "Maxine \"Max\" Mayfield",
        "Robin Buckley",
        "Nancy Wheeler",
        "Lucas Sinclair"
    ],
    "additional_tags": [
        "Hurt Steve Harrington",
        "Bisexual Steve Harrington",
        "Gay Eddie Munson",
        "Stranger Things 4",
        "Post-Stranger Things 4 Vol. 1",
        "Post-Episode: s04e07 The Massacre at Hawkins Lab (Stranger Things)",
        "Hurt/Comfort",
        "Fluff and Angst",
        "Not Beta Read",
        "Steve Harrington Needs a Hug",
        "Protective Steve Harrington",
        "Good Babysitter Steve Harrington",
        "Steve Harrington-centric",
        "Protective Dustin Henderson",
        "Brotherly Steve Harrington & Dustin Henderson",
        "BAMF Maxine \"Max\" Mayfield"
    ],
    "language": "English",
    "series": "",
    "published": "2022-06-16",
    "completed": "2022-06-17",
    "words": "6,538",
    "chapters": "2/2",
    "comments": "63",
    "kudos": "5,912",
    "bookmarks": "743",
    "hits": "46,277",
    "summary": "<p>Steve was never comfortable with others taking care of him. It was why he'd fallen so easily into the babysitter role: he'd held himself together all his life, he'd never had anyone else to do it for him.<br>When Steve, Robin, Eddie, and Nancy make it out of the Upside Down, Steve keeps his bandages wrapped tight and doesn't let anyone see, insisting he's fine, he's fine, he's always fine. He checks on Nancy, makes sure the kids have a place to sleep, and tries to get away to deal with his wounds on his own.<br>But his stubbornness won't stop the Party from helping him when he needs it.</p>\n<p>or<br>I just need content of everyone loving and caring for Steve okay??<br></p>\n<p>The next morning, the Party has to deal with everything they'd ignored the night before.</p>",
    "notes": "<p>Might make this a series of one shots capturing Steve and Eddie development, and just Steve development in general because I love him</p>",
    "text": "Eddie and Robin caught Nancy on the other side, collapsing together on that disgusting mattress, and Steve’s eyes fluttered closed as he sucked in the infected air, trying to calm his beating heart.  The lifesaving powers of ABBA  , he thought to himself.  Who knew ?\nMore surprising was the lifesaving powers of  Eddie . They had exactly one cassette at their disposal when Vecna tried to take Nancy, and that was Max’s, which surely wouldn't work. Aside from that was a collection of metal records in Eddie’s room that each of them knew she would hate. \nThat left Eddie and his guitar. Eddie, and his ability to play any song he’s heard, even if he’d only heard it once. When Robin shouted out Nancy’s favorite song, a fact that even Steve didn’t know, Eddie bolted to his bedroom, coming out with his electric guitar and playing without hesitation. The whole time, Steve had sat transfixed, unsure of where to look: at Nancy, with her white, glazed eyes, or through the hole in the ceiling at Eddie, who’s fingers plucked easily over the strings like it was the most natural thing in the world.\nFor the first time since this whole thing started, he almost looked at peace, and Steve thought it changed his look entirely. In a good way. In a distracting way.\nHe only managed to shake himself out of his thoughts when Nancy came back to him, collapsing to the ground, and Steve was the only one who could catch her.\nNow, Nancy rolled onto her back, chest heaving, tears streaming down her face, while Eddie and Robin backed up to give her space, guitar abandoned on the floor several feel away. The kids shouted around her, Max falling to her knees at her side, whispering something Steve couldn't hear from the other side. The fear on Max's face now, it was almost the same as her expression when she'd almost been Vecna's. A horrible realization of understanding.\nMax and Robin helped Nancy off the mattress while Steve’s vision faded in and out, and he swayed where he stood, clinging to the rope somehow dangling between one dimension and the next. All the adrenaline sapped out of him, and he left with almost nothing at all. He didn’t know whether the wooziness came from the injuries on his torso, or the simple relief that his three companions had made it back safely. He’d never been one to care about himself in these situations. Wasn’t that his job? To care for the rest of them, to keep them safe?\nWhen the stars in front of his eyes cleared away, it was to see Dustin waving aggressively with a grin. “Steve! Get your ass down here before he gets you too! I swear to God, I am  not  coming in after you-”\nSteve rolled his eyes, the kid’s quips bringing him right back down to earth (or, well, whatever you would call earth in the upside down). Gritting his teeth, he grabbed the makeshift rope and pulled himself up, biting down a shout in pain as he nearly passed out.\n Yeah,  he realized all at once.  The headache was definitely coming from the bat bites. \n \"  Come on,\" Dustin teased. \"If Robin could pull her way up that thing, you have no excuse.\"\nRobin punched him in the shoulder, and Steve normally would have thanked her, but he couldn't speak right now, too focused on getting out of here.\nBit by bit, he inched up the rope, until he felt the sickening shift of gravity that sent him plummeting onto the mattress, curling into himself and groaning. The impact ricocheted throughout his body, his bones vibrating and his skin twitching where pieces were missing.\n“Jesus,” Eddie murmured, collapsing to his knees, reaching out like he wanted to touch the bandages. “That probably didn’t help.”\n“No,” Steve gasped out. “It did not.” Wincing, he sat up, catching his breath as he tried to will the pain to go away. It helped a little bit, and he exhaled. If he's learned anything in the past couple of years, it's that you actually can build up a tolerance to pain. “I’m fine.”\n“You are not fine,” Robin said with wide eyes, that familiar panic setting into her voice. It was almost comforting. “You are missing  so much skin .”\nStumbling to his feet, Eddie caught him, and this time his fingers did dig into his back, warm and firm. Steve didn’t have the brain power to process that at the moment. “Skin is only a moderately necessary organ at best. How’s Nance?”\nBut the change in topic only made things worse. The others were so busy helping Nancy into a nearby chair that Dustin, Lucas, and Max didn’t even notice the state of Steve, but when Dustin turned around, his jaw dropped open.\n“Holy  shit . What the hell happened to you?”\n“Shouldn’t you be used to seeing me like this, Henderson?”\n“No,” he said frantically, coming over to take a closer look, and the concern painted all over his face actually made Steve calm down a little bit, made his heart steady in his chest. “You’ve gotten punched a  shit load  of times, but no one has actually managed to stab you.”\n“Yet.”\n“Vecna did not  stab  Steve,” Robin said, moving to help him stand, but he just shook her off. “There were these horrible bat things with rabies-”\n“They didn’t have rabies,” Eddie interjected. “Hopefully.”\n“-and they were, like,  eating  him-”\nRubbing his temples, the mounting concern only made his headache worsen, the pain tormenting his entire body doubling. He always hated when other people worry about him, that he could ever add a burden to the shoulders of these people who already carried so much. It was  his  job to carry them, right? Right?\n“Why does this  always  happen,” Dustin was saying, and Steve had just about had enough.\n“I’m  fine  ,” Steve shouted over the bickering, effectively shutting them up. “You heard Dustin, this happens  literally  every time, and I’m always fine.” Pushing through them, he moved to lower himself in front of Nancy’s chair, but stopped when he realized that bending his torso was a  horrible  idea. He stayed at the awkward half crouch, asking, “You good?”\nDespite the exhaustion tugging at her face, the tears still soaking her cheeks, she managed a weak smile. “I’m alive. My standards aren’t that much higher than that anymore.”\nSteve gave the rest of the group a pointed stare, motioning to his ex girlfriend. “See? Get on this level or you’ll never survive this shit. Come on, we have to get out of here.”\nOn cue, Max pulled a jingling set of keys from her sweatshirt pocket. “Figured we might need these. Let’s go.”\nEyes nearly bugging out of his head, Steve swiped them from her fingers, ignoring her startled, “Hey!”\nHe just held up his finger. “ No . No way is that happening again. All the things we’ve faced, your driving is still the most lethal one. I’m driving.”\nBut then the keys are gone from his hand just as fast as he’d stolen them, Eddie tossing them in the air and catching them. “Cute, but no. Youd; get it if you looked in the mirror, and I won’t have you passing out at the wheel.”\n“I won’t  pass out -”\n“Yeah, yeah,” he said, bumping his shoulder. “You’re a badass monster fighter who can take a punch and handle some missing intestines, we’ll humor you. But I will be humoring you from the  driver’s seat .”\nWithout another word, he jogged from the house toward Max’s mother’s car across the street, leaving the rest of them no choice but to follow. Eddie fell behind the wheel, and Steve guided Nancy to the passenger seat, insisting that she needed the most room, even though Erica had to sit on her lap. In the end, Max sat on Lucas’s lap, Dustin had half of his butt on Robin, and Steve endured the agony of squeezing into the middle.\nHe kept his eyes squeezed shut the entire way, his body stiffened so he wouldn’t jostle around and hit his wounds. They decided to head to Steve’s house, probably one of the one places that would be 1) empty, and 2) not on the cop’s lists of places to search. He tried to imagine the route in his head, not wanting to be that whiny asshole who asks  are we there yet , but his mind had gone completely blank.\nThat is, until they hit a bump, and Dustin’s elbow lodged itself into one of the several holes in Steve’s stomach. He groaned, keeling over, biting down on his lip so hard the metallic taste of blood sprung into his mouth.\n“Sorry,” Dustin hissed, and damn, Steve must look really pathetic, because Dustin normally would have never apologized.\n“Fine, fine,” Steve waved him off.\nThey carried along in silence for a moment, until Dustin murmured, “At least it was an actual  monster  that got the better of you this time, and not, you know, a regular human person.”\nSteve’s eyes flew open, glaring at his friend. “I beat up a  Russian guard , Dustin, I think I’ve-”\nThe car slammed to a halt, and everyone flew forward, and then back against their seats at the impact. A spark of panic flew up Steve’s spine. Was it the cops? Did Eddie see something, would they have to fight, did they-\nNone of the above, apparently. They had just arrived in front of Steve’s dark, deserted house, but Eddie had other priorities. He twisted in his seat, gaping at Steve. “You  what?\" \nPointedly ignoring him, Steve elbowed the pairs on either side of him. “Let me out.”\nThey all stumbled out of the car, and Steve pulled the spare key out from under the matt. He had no clue where his car keys had gone, if they were even in this dimension.\nTrudging to the living room, they all collapsed on the various chairs and sofa, Steve not even bothering to complain about the muck they were getting all over his parent’s expensive furniture. He couldn’t care less. He just took a moment to look at each person individually, at the dullness of their eyes but the color of their skin, the movement of their body.\nThey were all alive. It wasn’t over, not by a long shot, but for now… They were all alive.\nHe felt Eddie's eyes on him, even when Steve pointedly only looked anywhere else, and Steve crossed his arms over the bandages, hiding them from sight. When he managed a glance at the other man, Eddie looked like he wanted to stand, to come over here, but his fingers dug into the armrests of his chair instead, keeping him down.\nThey sat in silence like that for a while, nobody quite knowing what to say. They knew they should discuss next steps, but they didn’t know what they were, and they were all  so, so tired. Erica and Lucas gathered snacks to pile on the coffee table, even though no one ate any of it. Max retrieved an extra Walkman for Nancy from a junk drawer, making a joke about how they could match that sort of fell flat, but Nancy laughed anyway. \nSlowly, the kids started filling the older group in on what they’d missed, on why they’d run away from Lover’s Lake. On the cops, the questioning, on all of their parents breathing down their necks for the first time since they were babies. Robin spoke of Steve getting pulled into the gate, of the rest of them following him before those bats could choke him to death.\n“Well, that’s a relief,” Dustin said. “I knew you wouldn’t be dumb enough to go through Watergate voluntarily.”\n“For the record,” Steve said, eyes closed, “they all did go in voluntarily. I’m the only smart one here.”\nRobin huffed indignantly. “We saved your  life, asshole.”\nGroaning, Steve forced himself out of the armchair that he definitely could have fallen asleep in, moving over to a nearby closet. He gathered up blankets and pillows, throwing them toward the kids. “Go to sleep. I’m going to shower.”\nAs if catching up, Robin looked down at herself, wrinkling her nose. “Yeah. You don’t happen to have another one of those, do you?”\nThey began to move, the kids setting up of the sofas and the older teens heading to the showers, ready to rinse for an hour to try to get off the feel of the Upside Down. Would it even go away? That stickiness to his skin, the particles in his throat? Had he been morphed from the Steve of this dimension to the Steve of the in between?\nSteve took one step onto the stairs toward his bedroom before pain flared up his stomach, wincing at the way his torso bent with the action. Stars swam in front of his eyes as his swayed, and soft hands reached out toward his back, fingertips pressing through the denim jacket he’d forgotten about.\n“Whoa, there,” came Eddie’s voice from behind him. “You okay?”\n“I’m fine,” Steven assured him, even as he felt the rest of the group eyeing him, and then promptly blacked out.\nHe wasn’t out for long, fairly sure he woke up the moment his head connected with someone’s chest. Eddie caught him, hugging around his arms tight and lowering him to the ground. Shouts rang out around them, thumping footsteps shaking the floor as people hurried toward him, crowding around Steve collapsed in Eddie’s lap.\n\"Steve,\" a voice cried out.\n“I’m fine,” he slurred out, his first instinct, insistent on it. They needed to sleep, not worry about him. “I… I…”\nThey ignored him, Robin and Dustin leaning over him, blurry at the edges. Robin’s concern had turned to fear, and Dustin just looked shocked. As if he never expected Steve to fall like this, as if it had never occurred to him to doubt Steve when he said I'm fine. A sort of shame fell into him, that he wasn’t strong enough for them. That he couldn’t stand on his own.’\nSomething skidded to a stop to his left, and Max appeared, bandages and towels and a bottle of alcohol from the liquor cabinet in her arms. She fell to her knees, glancing at Robin. “You have to take that bandage off.”\nHands shaking, Steve could feel it on his skin, Robin frantically untied the material that Nancy had draped around him, now completely soaked through with blood. He thought she might have even gagged, but then he could only focus on the air attacking the hole in his skin.\n“Oh my God,” Dustin said, looking anywhere else but the wound beneath him. “Steve, there’s pieces of you missing, oh my god-”\n“Is it bad?” Steve managed.\n\"Is that a serious question?\"\nThe group got to work, Max pouring a generous amount of liquor onto the towel, clenching her teeth together as she said, \"This is going to sting like a bitch.\"\n\"It already stings like a bitch.\"\nDelicately, Max lowered the alcohol soaked rag to Steve's stomach, and his body convulsed to much that Eddie had to tighten his hold on his shoulder, pinning his arms to his side and holding it down. Steve groaned, head tilting back in Eddie's lap, trying to get away from the pain, to get out of his body, to get anywhere else-\nMax finished cleaning the wounds, and the sharp pain ebbed away, replaced by the relentless ache that he'd become used to the past couple of hours. Hands flew around him, fresh bandages wrapping around him, and he sighed at the contact, relaxing that they were once against covered.\nDustin didn’t know how to help, but he gripped his hand like a lifeline, squeezing anytime Steve jerked in pain. “You’re gonna be okay. It’ll be okay. It hurts like a bitch, but who needs a stomach, anyway?”\nThe worry of his face was too much, the sadness hanging in the air around them, and Steve couldn’t stop the words. “I’m sorry,” he whispered out, tears pricking his eyes, and he would have wiped them away before anyone could see if both his hands weren’t being pinned down.\nDustin looked like the words sent him into a stroke. “Sorry? What? Why are you sorry?”\nSteve just shook his head, and someone pressed down on the bandages, tying them tight, and the agony forced the confession out of him. “This isn’t your job. This is  my job.”\nRealization flickering behind his eyes, Dustin squeezed Steve’s fingers impossibly tight, poking him in the shoulder. “Oh, hell no. This is  everyone’s  job. Don’t you remember, Steve? ‘You die, I die?’ We’re in this together. If you protect us, we protect you. And any time it’s one of our turns to fall apart, the rest of us put them back together. It just happens to be your turn. Do  not  be sorry for that. You’ve helped us together at the seams enough times already.”\nWatery eyes opening to look at Dustin, he managed a smile. \"I'd prefer it if none of us died.\"\n\"Yeah, well, me too, which is why you have to let us patch you up every time you inevitably get your ass kicked.\"\n\"Don't act for a second like you would have won any of the fights I lost-\"\n\"I'm fifteen!\"\nShaking his head, Steve managed to relax further into the person holding him, some of the tension seeping from his shoulders at Dustin's reassurance. He knew it was absurd, knew that they didn't mind, but it still felt unnatural. To have so many people care about him.\nEven more surprising was the soft way that Eddie gazed at him. He leaned over him with furrowed brows, the hair tumbling over his shoulders brushing against Steve’s forehead. His eyes fluttered shut, and somehow, the combination of pain, calm, and Eddie's firm grip made darkness surround him once more.\nHe woke up in a bed, a blanket tucked tight around him and several pillows shoved under his neck and back. Something wet dragged across his cheek, the mattress dipping slightly off to the left, and his head rolled to the side to find Eddie bent over him, a wet rag wiping away streaks of dirt from his face.\nSteve cleared his throat, and Eddie jerked his hand back when he realized Steve was awake, face splitting into that manic grin that Steve had somehow become obsessed with. \"He lives!\"\n\"Barely,\" Steve chokes out, his voice scratchy and barely there. \"How long was I out?\"\n\"An hour or so,\" Eddie murmured, returning to cleaning off Steve's skin as Steve realized that meant the group of them had carried him up the stairs and tucked him into bed. What once would have made him uncomfortably made his heart warm instead. \"The others are sleeping, I said I'd keep an eye on you.\"\nSteve wanted to ask why. To question why Eddie of all people would stay up for him, cleaning away traces of the Upside Down when Steve hadn't had the strength to wash it away himself. But instead, he looked down himself, at the fresh bandages Max and Robin had wrapped around him. Blood had started to seep through, but not nearly as bad as before. And they were clean, despite the rest of Steve's body still being disgusting, and it made him feel a little bit better. A reassurance that they'd made it back to this side, to some sense of normalcy where they could find something as simple as a clean dressing.\n\"Thank you,\" he finally murmured. \"For... you know, everything.\"\nEddie swallowed. \"From what I've heard,\" he said slowly, \"you've more than earned it.. Even though it still kills me inside that you don't completely suck.\" He paused. \"Those kids... They all really love you, you know, Nancy and Robin, too. What this group has, what you've all survived together, it's unlike anything I've ever seen.\"\nSteve managed a smile, and tried to convey all the weird things he was feeling with a simple sentence. \"Welcome to the club, then. It's all downhill from here.\"\n\"I don't know,\" Eddie mused. \"This all started when you were a Junior, yeah? You seemed to have almost... improved with the changes. I remember watching you, the subtle changes with no idea what caused them. Now I know, I guess.\"\n\"Yeah, well, nothing like nearly dying several hundred times to give yourself a little perspective.\"\nEddie collapsed onto the other side of the bed, shoulder a mere inch from Steve's, and Steve shifted until they were pressed together. Eddie sucked in a breath, but otherwise didn't mention it. \"Now that I know you're not going to die in your sleep, I'm getting some shut eye, too. I've got to mentally prepare to almost die again tomorrow.\" Steve laughed, but just ended up coughing. Eddie reached out, fingers brushing over Steve's neck, and he stiffened, a mix of pain and pleasure washing over his skin. \"They got you good on the neck, too. It's starting to bruise, I can't imagine what it'll look like tomorrow. You might want to wear turtlenecks for a little bit, otherwise people will start thinking you're freaky in bed.\"\n\"Who says I'm not?\" The words were out of Steve's delirious mouth before he can fully process them, and he snaps his lips shut, flushing all the way from his forehead down to his mangled neck.\nEddie just looked like he won the jackboots, grinning maniacally. \"Well, I think when this is all over, I'll need to hear more about that. Maybe test a theory or two.\"\nNot knowing it came from, Steve said, \"Let the neck heal. Then we can talk.\" Trying to keep his breathing in check, Steve shifted again, turning slightly onto his side to get more comfortable, and the movement made something slide along his back, grating over the scrapes that had resulted from being dragged over the jagged rock. he looked down again, noticing he still wore Eddie's jean vest, spots on the front darkened and stained with blood. Eddie's eyes flicked down, dragging up over Steve's abdomen, his chest, the lapels of the vest. Something about the way his gaze darkened made Steve want to stay awake forever, to wear this blood riddled vest for the rest of his life.\n“I’m sorry about your jacket,” Steve murmured, eyes fluttering closed. He didn’t have the strength to keep them open anymore. “I’ll get it back to you.”\nEddie just laughed, and Steve wanted to open his eyes to see his face, but he couldn’t. “Keep it, man. It looks hot on you anyway.”\nNormally, that would have made Steve sit bolt upright in bed, eyes wide, but instead his lips just curved up in a smile, a pleasant warmth spreading over his body. “Are you sure you just don’t want it because it’s completely soaked in blood?”\nAnd if Dustin came by in the morning to find that the two boys had curled into each other in their sleep, confused at the way their limbs wound together, well, he'd just blame it on Steve needing some comfort for once, and he wouldn't say a word.\n\nThe gravity of the situation only truly hit Steve when he woke up for the third time, this time to sun streaming through his curtains and a heavy weight on his chest.\n\n\nSomeone must have pulled the now disgusting denim jacket off in his sleep, because Eddie’s head pressed into his completely bare chest, in the one spot that managed to get away unscathed. For a moment, Steve didn’t dare move, enjoying the brief peace and comfort. He didn't find those things all that often.\n\n\nBut then it all crashed in on him, both his injuries and the fact that Eddie still hugged him like a pillow, and he jerked up with a groan. Eddie's eyes blinked open, slow at first, but then humped back, rolling across the bed and falling over the edge, curls flying every which way as he went. Steve just stared, wide eyed, until Eddie’s head popped back up, glaring.\n\n\nA laugh burst from Steve’s lips, and he regretted it immediately, hands flying to his stomach. “Laughing isn’t allowed,” Steve gasped. “New rule.”\n\n\n“No worries,” Eddie grimaced, standing nonchalantly despite his red cheeks. “I don’t think we’re gonna do much laughing today.”\n\n\nThe third thing hit him, then. That they’d been able to take one night, to focus on their exhaustion and pain, but it still wasn’t over. Max and Nancy still had to listen to their songs on repeat, warding Vecna away, and who knows which of them could be next?\n\n\nThey had to make a plan. They had to do \n\nsomething\n\n.\n\n\nSteve took the quickest shower of his life, despite Eddie’s insistence that he should take his time, that there was nothing they could do yet anyway. But he only stayed in long enough to scrub his wounds clean, wiping away the rest of the dirt, before getting out to put on new bandages. Biting his cheek, he tried to reach around his back to wrap the gauze, but something twanged in his neck, and he gave up. Hesitating for only a moment, he wiped away the condensation that had gathered on the mirror during his hot shower, and for the first time since coming back from the Upside Down, looked at the state of himself.\n\n\nIt was horrible. And not just the injuries.\n\n\nSure, the swollen band around his neck made him wince, and the cuts and scrapes all over his face started to scab over. He couldn’t even get started on his torso, swallowing down a shout of pain when he brushed his fingers over one of those gaping holes. Instead, he focused on how terrible the rest of him looked. The sagging of his skin, the emptiness of his eyes, the tight set of his jaw that never seemed to go away. His wet hair flopped around his ears, and a war waged within himself, the need to make himself look presentable and the lack of motivation he had to do it.\n\n\n“Need some help, there, Harrington?”\n\n\nDespite the voice scaring the shit out of him, he didn’t even have the energy to be surprised, just turning slowly to see Eddie leaning against the bathroom doorway, washed and dressed and eyebrows raised high.\n\n\nSteve lowered his hand to the towel still wrapped around his waist, suddenly self conscious. He didn’t really know why, he’d played sports, been in more locker rooms than any one person deserved to be in. He’d \n\nshowered\n\n with his teammates, after all. So why should he care about the way Eddie’s eyes darted down to that sharp V disappearing beneath the hem, dragging up his torso before returning to his face.\n\n\nSteve just stared back. “Don’t you know how to knock?”\n\n\n“The door was open,” he responded dryly.\n\n\nProbably true. Steven never closed the door to the bathroom attached to his room, and he rarely closed any other doors in his house. Most of the time, he was the only one here.\n\n\nEddie took a step forward, the lingering shower steam clouding around his face. “I’ll ask again. Need help?”\n\n\nSighing, Steve reluctantly passed over the bandages, and Eddie smirked, taking them and instructing Steve to lift his arms above his head.\n\n\n“If I could reach above my head,” Steve said pointedly, “I’d be doing this myself.”\n\n\n“Fine. Just lift them a little, so I don’t accidentally bind your wrists to your sides.”\n\n\nSomething about the way he said it, with a cocky smirk and a lifted eyebrow, made Steve flush, and he hoped the general redness of all his wounds covered it up. “Just get it over with.”\n\n\nEddie did, but to Steve, it felt like an eternity. The first thing Steven noticed was that Eddie’s hands were \n\nrough\n\n. Though the skin of his arm had been soft yesterday, the pads of his fingers had formed tough ridges, trained from years of strumming strings. The second thing he noticed was how good it felt when those fingers brushed over his skin, adjusting the bandage, wrapping around his entire back and along his hip, over his stomach and above his belly button.\n\n\nIt came as relief and agony when Eddie’s hands finally fell away, pearly white bandages covering the horrors beneath. How long would he have to do this? How long until holes in your flesh managed to heal?\n\n\n“There,” Eddie murmured. “Good as new.”\n\n\nSteve huffed. “I’ll never be good as new again.”\n\n\nEddie just stared at him, a haunted look flickering in his eyes that Steve wanted to accept, to tame, to cure. “Neither will I.”\n\n\nThey were so close. Eddie had finished the dressings, but he didn’t move away, instead breathing out against Steve’s chin, breath warmer than the shower he'd just stepped out of. Eddie’s eyes glistened in the fluorescent light, a golden brown, and Steve had always liked brown eyes, admiring the simplicity of them. His eyes fell lower, along the curve of his nose, and then to his pink lips, and why was he looking at Eddie’s lips-\n\n\nSteve stepped back, clearing his throat. “We’d better-”\n\n\nEddie held up a finger, seemingly unfazed, his head tilted with a look that said, \n\nah, ah, ah, nice try\n\n. “Wait a minute, aren’t you forgetting something?”\n\n\n“I’m sure I’m forgetting loads of things that aren’t important. The kids-”\n\n\n“Are making breakfast and brainstorming bad ideas that you would just shoot down anyway. But I’m pretty sure they wouldn’t even recognize you in this state.”\n\n\nTurning back to the mirror, Steve registered his hair one more, leaning his head back with a grunt. “What if I just didn’t do it? What if I never did it again?”\n\n\n“Then I have a feeling we wouldn’t get you out of the house, and I have a feeling we’re going to have to go on some ridiculous adventure today.”\n\n\nSteve was just so tired, but he didn’t recognize himself in the mirror, and he needed \n\nsomething. \n\nFor some reason, Eddie understood that, and he plucked the Farrah Fawcett spray from Steve’s array of products, not even commenting on it other than a small huff of a laugh.\n\n\n“You’re Steve ‘the Hair’ Harrington,” Eddie said, tossing him the spray. “That’s one thing the Upside Down can’t take from you. Do your hair.” He paused on his way out, tossing Steve a shirt. “And what have we talked about in regards to your modesty? I’ll see you downstairs.”\n\n\nThe living room had become a disaster area, and for a moment, Steve almost thought he was back in the Upside Down, too much chaos occurring in this normally empty house. He lingered on the stairs, reminded of his spell last night, and shivered in embarrassment.\n\n\nBut then a loud laugh sounded, Dustin yelling something at Max, and he snapped back to reality. Climbing down the stairs hurt a little less than trying to go up them, and he gingerly hopped down from the last one, thankful to be back on solid ground.\n\n\nAnd for the first time since getting back to this dimension, a true smile spread across his face.\n\n\nThe kids wore the same clothes from yesterday, but Robin, Nancy, and Eddie all stole a T-shirt and gym shorts from Steve last night, and the older girls gathered in the kitchen, bickering by the stove. He could hear them from here, grin widening at how natural they acted together, how they actually seemed like friends now.\n\n\n“You’re burning them!” Nancy insisted, trying to pull the pan of eggs from Robin’s grin, but Robin just bumped her away with her hip.\n\n\n“I’m not burning them, they just won’t be \n\nsoggy\n\n.”\n\n\n“No, they’ll be dry-”\n\n\n“At least they won’t give us salmonella! There’s already enough things trying to kill us!”\n\n\nDustin, Lucas, Max, and Erica crowded around the counter, Eddie directing their focus around some sort of map spread over the marble. He looked like Steve imagined he did during that D&amp;D game, directing his club through fake adventures, while he now instructed them through a real one. A smile curved on his lips at how naturally Eddie fit in with them, trying to think back to when he'd actually been a little jealous of the guy.\n\n\n“No,” Dustin shook his head, tugging the paper from Eddie, along with the pencil. “No, \n\nno\n\n, do you want to die? Is that it?”\n\n\nEddie threw his arms in the air, sharing an exasperated glance with Lucas. “I’m pretty sure any plan we come up with will have at least a sixty percent chance of us \n\nall\n\n dying.”\n\n\n“We haven’t survived four years of this shit with that kind of attitude!”\n\n\nSteve arrived at the counter and shoved Dustin aside, inserting himself between Eddie and the kid, his shoulder pressing into the hot skin of Eddie’s. “No, we’ve survived the past four years because of \n\nEl\n\n. Had nothing to do with attitude.”\n\n\n“Steve, I swear to God-”\n\n\nAt the sound of his voice, Robin abandoned the eggs with Nancy, marching over to Steve and pulling him toward her. The spot where he had been touching Eddie felt cold, and she trained her eyes on his stomach. “How are you feeling?”\n\n\nSteve sighed, uncomfortably rubbing the back of his neck. “Peachy.”\n\n\nShe gave him a stern look. “Are you lying?”\n\n\n“Realistically, given the circumstances, I couldn’t ask to feel much better,” Steve said honestly, which seemed to satisfy her.\n\n\nDustin pointed to him. “See? It’s all about the attitude.”\n\n\nSteve rolled his eyes, turning around to point right back. “Let me tell you a little something about \n\nyour\n\n attitude-”\n\n\n“Time to eat!” Nancy interrupted, removing the large pan of eggs from the pan and motioning for them all to go for it.\n\n\n“Feeling okay?” he asked her, eyes flitting over the headphones still perched on her ears, the shadows under her eyes. How much sleep had she gotten? Had she slept alone? That was one thing Steve remained grateful for, that Eddie hadn't left to sleep somewhere else, that he could feel the presence of another human beside him all night.\n\n\nShe just laughed him off, but it came out dark and scattered. “Better than you, at least.”\n\n\n“Glad I can provide a baseline.”\n\n\nSteve ate at the counter, trying to think of next steps, of what to \n\ndo\n\n when they couldn’t reach El or Joyce or Mike or Jonathon. He’d known it was a horrible idea from the start, sending the Byers to the west coast and splitting their group up. The only reason they’d made it this far was because each person managed to play their role, and had \n\nimpeccable\n\n timing while they did it. Now would be around the time that El jumped in, or Joyce made some out of the box connection, and they would \n\nknow what to do\n\n.\n\n\nSteve had no idea what to do.\n\n\nAn elbow nudged him, and Steve came out of his trance to see Eddie holding two plates of food, sliding one over to Steve. “Pretty sure you need to eat something to fill up those massive craters in your stomach.”\n\n\n“I don’t think that’s how it works.”\n\n\nEddie’s cheeks dimpled as he smiled, deep indents along his fair skin, and Steve wanted to kiss them away.\n\n\nSomething crashed inside his brain, a frozen record scratch, and \n\nwhy did he just think that\n\n? But the question was quiet in his brain, overshadowed by \n\nEddie’s lips, Eddie’s hair, Eddie’s head on his chest last night-\n\n\n\n“Couldn’t hurt,” Eddie simply said, interrupting Steve’s thoughts and turning away to eat his own meal.\n\n\nSteve took a bite, realizing Nancy had been a little bit right. They were dry, but maybe that was just the cotton feeling in his mouth taking over.\n\n\n He turned to Eddie, realizing they were alone. The kids, Robin, and Nancy had gone to eat in the living room, abandoning them in the kitchen.\n\n\n\"I have no idea where to go from here,\" he found himself saying out loud. He had no idea why he said it, he normally would never have been caught dead confessing to such a thing. He was supposed to be their leader, these kids... They trusted him.\n\n\nEddie had started to trust him, too, and now Steve was going and screwing it up.\n\n\nBut Eddie's gaze just softened, and God, the crinkles around his eyes just drew Steve in, making him lean forward without even realizing it. \"I don't think any of us know what to do.\"\n\n\n\"You know what I mean,\" Steve sighed, glancing at the kids. His kids, wondering how he would protect them from a monster that could reach directly inside their heads. \"I've never felt this... stuck.\"\n\n\nEddie hesitated a moment, setting his fork down on his now empty plate, before stepping toward Steve. His heart rate spiked, thinking for a moment that Eddie would try to kiss him, but the metal head just wrapped his arms around Steve in a tight, but gentle hug.\n\n\nBut there was no just about it. \nSteve's brain short circuited. He couldn't think of the last time he's been hugged. Robin hated anything more than a fistbump, Dustin would rather die than hug him, and his parents...\n\n\nIt took him a moment, but Steve lifted his arms, snaking them around Eddie's waist. It was thin, and he could feel a sharp hip bone jutting out against his wrist, but Steve couldn't focus on anything other than Eddie's nose buried into his neck, lips brushing over the sensitive skin. He remembered Nancy kissing him there once, biting down and leaving love bites all over, and Steve had just writhed and moaned beneath her, becoming a jumbled mess. He didn't know why he thought of that now, and he shivered, hoping Eddie didn't notice.\n\n\nHe must not have, because several more seconds passed before Eddie pulled away, gripping Steve firmly by the shoulders. \"We'll get those kids through, you and I. If you could do it alone, we sure as hell shouldn't have an issue with both of us.\"\n\n\nThrowing caution to the wind, already missing him in his arms, Steve pulled Eddie back into him, more confident this time. Eddie let out a little squeak of surprise, but didn't argue, holding him back. \n\"We'll get each other through, too,\" Steve whispered into his hair. \"I'll get you through.\"\n\n\nThey had barely separated again before Dustin stormed back into the kitchen, slamming his hands on the counter, too antsy to wait any longer. Eddie and Steve took a step apart from each other, even though they weren't even touching, and why did he feel like he'd been caught in the act. He decided to focus on the way Dustin's gaze kept flitting over to the door, like the cops would ram it down any moment. “We need a plan. Like, now.”\n\n\nAnd plan, they did. Steve would fight his inner demons later, once he's \ntaken care of the ones coming after them in real life. \n"
}