{
    "id": "40119615",
    "url": "https://archiveofourown.org/works/40119615?view_full_work=true",
    "author": [
        "steveharringtoned"
    ],
    "title": "Three Shots",
    "rating": "Not Rated",
    "archive_warnings": [
        "Graphic Depictions Of Violence"
    ],
    "categories": [
        "F/M",
        "M/M"
    ],
    "fandoms": [
        "Stranger Things (TV 2016)"
    ],
    "relationships": [
        "Steve Harrington/Eddie Munson",
        "Steve Harrington & Dustin Henderson",
        "Steve Harrington & Maxine \"Max\" Mayfield",
        "Steve Harrington & Jim \"Chief\" Hopper",
        "Steve Harrington & Mike Wheeler",
        "Robin Buckley & Steve Harrington",
        "Eleven | Jane Hopper & Steve Harrington",
        "Joyce Byers & Steve Harrington",
        "Will Byers & Steve Harrington",
        "Steve Harrington & Lucas Sinclair",
        "Dustin Henderson & Eddie Munson"
    ],
    "characters": [
        "Will Byers",
        "Mike Wheeler",
        "Eleven | Jane Hopper",
        "Maxine \"Max\" Mayfield",
        "Jonathan Byers",
        "Nancy Wheeler",
        "Joyce Byers",
        "Jim \"Chief\" Hopper",
        "Lucas Sinclair",
        "Dustin Henderson",
        "Steve Harrington",
        "Robin Buckley",
        "Eddie Munson"
    ],
    "additional_tags": [
        "Hurt/Comfort",
        "Hurt Steve Harrington",
        "Gun Violence",
        "Good Babysitter Steve Harrington",
        "Steve Harrington-centric",
        "Protective Steve Harrington",
        "Eddie Munson Lives",
        "Post-Vecna (Stranger Things)",
        "Hawkins (Stranger Things)",
        "Alternate Universe - Everyone Lives/Nobody Dies",
        "Temporary Character Death",
        "Steve Harrington & Maxine \"Max\" Mayfield Have a Sibling Relationship"
    ],
    "language": "English",
    "series": "",
    "published": "2022-07-06",
    "completed": "2022-07-07",
    "words": "13,434",
    "chapters": "2/2",
    "comments": "705",
    "kudos": "18,456",
    "bookmarks": "4,137",
    "hits": "137,691",
    "summary": "<p>Three shots ring out.</p>\n<p>Steve hears them before he feels them; a warm, wet pain burning in his torso, intolerably excruciating. </p>\n<p>There’s a bundle of squawks and screams, outbursts of panic and anger, and it’s only when Hopper falls forwards to take Steve up into a slightly rough, protective hold, does he realize that two of those shots have lodged themselves in his own flesh and bone. (Realizes that he’d moved, instinctively, to shield El, despite never having spoken to her, who’d the gun had been so precisely pointed at, aimed for.)</p>\n<p>Steve Harrington watches his own blood pool and trickle over a series of hands pressed against him, small and large, soft and rugged, and for a moment, wants to stay like this. He can’t.</p>",
    "notes": "<p>now with beautiful fanart!<br>https://archiveofourown.org/works/40840851</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>thank you so much for reading!<br>please follow my twitter @barmykawa if you want to hear updates abt my fics &amp; see other silly steddie things!</p>\n<p>UPDATE: the reception to this fic has been INSANE, thank you!</p>",
    "text": "“I can’t believe I just watched you lose so  disastrously to a bunch of fifteen year olds,” \n\n\n\n\nComes Robin’s voice from the backseat, piping up after a calm moment of silence where Steve  wasn’t  being tormented in his own car. A little handful of giggles follow, Dustin, Max, Lucas and  Eddie, all deviously chuckling away at his transgressions. \n\n\n\n\n“Yeah, yeah, laugh it up. It’s not like I’m wasting all my gas driving you guys back home later,” Steve tosses a glare over his shoulder, shutting up only Lucas, who gives him a little polite smile, still twinged with mischief. \n\n\n\n\nEddie grins, rugged and effortlessly attractive in a way that has his stomach turning. “No, she’s right, Stevie, who knew bowling was your weakness?”\n\n\n\n\n“Maybe I was just letting Will win. It’s his birthday, asshole,” \n\n\n\n\n“Bullllllshit! Will didn’t even  win,  Max did!” Dustin protests from his place in the front seat, pointing accusingly. “You put the ball in the gutter  every time!”\n\n\n\n\n“Pipe down, dipshit, you’re distracting me, the driver, remember? Driving you guys around?” Steve scolds, scowling off into space, taking a slightly more aggressive turn than necessary. \n\n\n\n\nWill’s birthday was a pretty big affair, a warm day in May just as they all recovered from the fight against Vecna. They’d just stopped the fourth gate from opening by the skin of their teeth—Hopper’s government friends arriving just in time to stop Jason from helping Vecna kill Max by proxy, leaving her with just the  one broken arm. \n\n\n\n\nEddie had got out of the Hawkin’s Lab hospital pretty recently, after Steve had lugged his sorry half-corpse through the portal in the weak hope that they could do  something— and they did. His heart stopped a few too many times and now they were worried about long term complications, or something, some new technology called a heart monitor—but right now he was lax, leaned back and grinning in the backseat of his car, continuously catching his eye in the rear view mirror.\n\n\n\n\nSteve had a gnarly scar, raised and angry across his throat, one that looked like someone had tried to slit it, or something—but Eddie had said it was pretty sick. Plus, it was a contributor to why they’d been stuck in the hospital together for a couple weeks. Turns out the bats  did have rabies, sort of—at least some kind of sickness, like the flu, or the plague, as Robin had said. \n\n\n\n\n(It was pretty cool having matching scars with Eddie where the bats had taken huge chunks out of their torsos, but no normal person would ever fucking say that, so Steve kept that one to himself.)\n\n\n\n\nSo now they were on the way to some corny, kiddy pizza place, one of the new ones with animal robot mascots and shit, but more excitingly—an arcade. Pizza, plus arcade? Happy kids. Very, very happy kids. \n\n\n\n\nHappy kids who were very excited to get there, who slammed the doors of his car on their way out even as he grumbled in warning to  not do that, ignoring him entirely as they reunited with the other cars in the lot. \n\n\n\n\nJoyce had hitched a ride in Hopper’s new station wagon, Will, El and Mike all stuffed in the back, Jonathan and Nancy pulling up shortly afterwards, ABBA blaring out of the car speakers as they did. \n\n\n\n\nAnd it was nice, he thought, sunglasses slightly askew on his face as he tilted his head up to enjoy the sun, the corners of his eyes crinkling as he took a deep breath in, preparing himself for hyper, angsty teens and the greasy power of pizza. \n\n\n\n\nThen comes a hand on the small of his back—Eddie, friendly, touchy Eddie, who shoots him a smile before chasing on after Dustin. \n\n\n\n\nSteve swallows, trying not to think about the gesture  too hard, before setting off, lagging behind the group a little as a result. And it’s strangely nice, comforting, sort of, watching them all from behind, watching the way they move together, a small, friendly army. Studying the way they’ve healed, grown older, grown together.\n \nThen he realizes it’s sort of creepy, and starts jogging to keep up—when he notices the bracelet.\n \nEl’s bracelet. The little blue one she’s had on her wrist for a while. It’s fallen just a little way from where she’s walking now, just ahead of Steve. \n \nCrouching down, he scoops it up—calling out to her. There’s a pause where she turns back and looks a tad baffled, because it’s not like her and Steve have ever  spoken, really, but they’ve meshed together in the midst of alternate dimension battle, and that’s always sort of been enough.\n \nHe wiggles the bracelet in the air, smiling at her warmly, growing into a grin when her face lights up in recognition, and she jogs a little awkwardly over to his beckoning. \n \nBut it’s when he turns, just at a slightly different angle, adjusting to be able to give it to her, does he see something in the corner of his eye, just behind them. A shift, a form, a man. \n \nIt only takes a glance, an inch of movement for Steve to see  something  thrown, or  drawn  aggressively upwards in the direction of the approaching Eleven, who’s yet to notice. Nobody else  has noticed. \n \nJust Steve. \n \nSteve, who grabs Eleven and tosses the two of them in a completely different direction, a choked apology tumbling out of his mouth as he knocks her to the floor hard enough to leave a nasty bruise. He’s not really sure if he even managed to get it out before he’s standing over her, staring down at the sheer terror and confusion that marks her like a deer in headlights. \n\n\n\n\n\n\n\nThree shots ring out.\n \nSteve hears them before he feels them; a warm, wet pain burning in his torso, intolerably excruciating. \n \nThere’s a bundle of squawks and screams, outbursts of panic and anger, and it’s only when Hopper falls forwards to take Steve up into a slightly rough, protective hold, does he realize that two of those shots have lodged themselves in his own flesh and bone. (Realizes that he’d moved, instinctively, to shield El, despite never having spoken to her, who’d the gun had been so precisely pointed at, aimed for.)\n \nSteve Harrington watches his own blood pool and trickle over a series of hands pressed against him, small and large, soft and rugged, and for a moment, wants to stay like this. He can’t. \n\n\n\n\nBecause then Joyce is running for a phone, and Jonathan has Will pressed against him as if he expects another round, another gun; perhaps a relic of their time in California, something Steve had always meant to ask about but never managed to. Nancy is trying to wrangle Max, who’s shouting and fighting to get away—get to  him, he realizes, vaguely, while Robin pushes past them to do just that, her shaking hands trying to soothe him, one on his face while the other braces her body against the concrete of the pavement he’s begun to bleed out on. \n\n\n\n\nThe kids—he thinks, in a fleeting moment of panic—only to find them all, crowding the gaggle of limbs he’s become, listless and entirely out of his control. Their hands pressed hard enough to scald, so when Steve choked on his own startled sob; he blamed it partly on the pain, another on the mere idea that these kids even know what to do when someone they know is shot in broad daylight. \n\n\n\n\nLucas is looking wildly back and forth between Steve and Max, as if trying to choose who to try and comfort, and Steve wills the dead weight of his tongue to move, to tell him to go to her; any attempt is shushed by Mike, who looks furious. It’s a familiar expression—identical to Nancy’s anger, all contained to the small downward curve of their lip, stuffed into that compact countenance when they know it’s not the time or place to let it run free. \n\n\n\n\nThen there’s Dustin, who’s causing the most trouble for Hopper, practically on top of Steve, periodically shaking him back and forth by the shoulders. He only gets a handful of the constant stream of heartbroken shrieking that comes tumbling from his mouth, a collection of “Don’t do this to me Steve,”s and “Stay awake, you can’t do this,”s, “You can’t do this to me,”s. Tears streaming down round cheeks, one disrupted by a broken handprint of already-drying blood, probably from the one he can no longer feel. \n\n\n\n\nSteve doesn’t remember touching Dustin’s face, searches for it in the occasional blackouts he keeps falling victim to; supposing that it’s just second nature, at this point. To try and comfort him first. But the more he tastes the bitter bile in the back of his throat, the metallic taste of blood in his mouth, trickling down his chin, does that become more difficult to do. \n\n\n\n\n(He wonders, briefly, if this is how Eddie felt. The sickening, feverish guilt of making the kid who practically worships you sob about your possible, impending, looking pretty likely death.)\n\n\n\n\n Then Steve gets to thinking about Eddie, searches for him, in the gaggle of his terrified onlookers, and finds him, uncharacteristically silent with sheer anguish as he hovers, too scared to get too close. For all of the hands pressed to Steve, big and small, he longs, for a second, for the limp, ring-clad fist at Eddie’s side to grasp at him too, and finds himself too far gone to speculate about why that might be. \n\n\n\n\nMaybe he asked, though, he’s not sure he can speak at all—or maybe the look in his eyes was pleading enough; pathetic enough. Because as soon as Eddie chances a glance in his direction, he’s collapsing to his knees by Steve’s side, taking his wrist between two rough palms, lacing their fingers together until the cool metal of his rings has a bloody chuckle oozing out of his mouth. \n\n\n\n\nIt hurts to do, sets a fire of wet, fresh agony alight in his chest, but he wins, really. Eddie meets his eyes, a melancholy fondness growing in them, pooling in the form of tears at their corners, and smiles at him crookedly, setting one of his hands against Steve’s face, thumb brushing beneath one of his eyes. “Cmon, man. You’ve got this.” \n\n\n\n\nSteve’s not sure what he’s got, but if it has Eddie looking at him like that, it must be pretty great. \n\n\n\n\n“You’re Steve  Harrington.  You’re—the most metal guy I know. Bat-wielding, bat-fucking-teeth-shredding  maniac. ” Steve’s not really sure what Eddie’s saying, but that’s comforting in a sense, because Steve isn’t really ever sure what Eddie’s trying to say. \n\n\n\n\n“He’s right,” Comes the bubbling, anxious addition from Robin, who’s lap is cushioning his head, sharing the weight of his enervated body with Hopper. “You’re—you’ve, we’ve, survived  way  , way-way-way-  way  worse than this, Steve, you can’t—it’s. It’s just a couple bullets. It’s—it’s not so bad. You’re gonna be totally fine, cuz if you aren’t, I’m gonna have to pick up your shifts at work too, and that’s gonna totally blow, because, well, think of all—all the babes you’ll miss, and I’ll—I’ll have to organize the tapes according to, to  my  recommendations, and you—you know my movie choices totally suck, you can’t,” She draws in a gasp of air, chest heaving. “You have to be there, you know—you know I’m totally useless under the crushing pressure of responsibility, Steve, I’ll totally get us both fired and I’ll feel  so, so bad,” \n\n\n\n\nIf she wasn’t already crying, she was now, a steady stream of sobs wracking her jittering form as she leaned over him, panicked babbles now just whimpers and cries. Maybe that’s what breaks the real headline to Steve, the breaking news of,  you’re going to die this time.  \n\n\n\n\nBecause Nancy pulls Robin away from him, gathering her into her fierce arms and holding the girl with such a force that it sets Steve’s head spinning—wondering if they had really become that close after Vecna, or if Steve was really, really screwed. It starts to feel like the latter, because then he finds Max at his feet, cradled by Lucas as she grips his shins and cusses him out, and she’s bawling, too. It makes him uneasy; Max hadn’t cried in front of Steve since they’d caught her, saved her from Vecna’s curse at the foot of Billy’s grave—that thought brought a crushing revelation to the drowning attentiveness he had left.\n\n\n\n\nMaybe that’s what this all reminds her of. That’s what Steve is doing to her, here, forcing her to relive that again. He feels sick, his own blood spilling out over his own lips, watching Dustin and Max sobbing over him as his actions force them to experience some of their worst trauma all over again.\n\n\n\n\nThat’s what finally gets him talking again, picking up his tongue from where it lay, dead, in his mouth, dragging it to form the panicked prattle of apologies that he can’t stop once they start; a sorry for Hopper, who he’s collapsed against, bleeding all over, Joyce, who’s shouting at onlookers hysterically, desperate to help him, Robin, who’s not even trying to hide how she feels this situation is going to go, having a full-blown panic attack in Nancy’s arms, who he apologizes to, too, for everything, past and present, to Jonathan, who’s resembling a kicked puppy, the way that had Steve hesitate in feeling resentment for him all those years ago, now just turning a fresh blanket of guilt in his gut, for Will, who’s birthday he’s just absolutely fucking ruined, Mike, for never quite understanding him as much as the other kids, for dying to save his super-powered girlfriend, Dustin, for giving him the rapport of fatherly, brotherly support he’d so desperately needed only to rob away from him now, Lucas, for forever forcing him to join him in being the more mature one of the kids, for leaving him in the Creel House to get near beat to death by Jason while he was out of reach in the upside down, Max, for usurping Billy as her brother, only to leave her in the same way, leaving her more vulnerable to Vecna, should he ever return, to Eddie, for every King-Steve lookalike who’s ever called him shit that makes his stomach turn to hear now, for every member of the godforsaken town who still graffitis his trailer, still throws things at him on the streets despite the Hawkin’s Lab fantastic, government pardon they’d donned as soon as the situation was ‘contained,’ and for not having enough energy to understand why he’d liked wearing his vest jacket so much, or why he’s so needily searching his eyes for the answer now, the light around his vision beginning to fade. \n\n\n\n\nAnd to El. For forcing her to experience someone else dying in her stead, for putting the weight of his life on her shoulders along with the rest of the world, for layering a fresh coating of blood on her hands, giving her another nightmare to live with forever. \n\n\n\n\nThat last apology has Hopper grip him tighter, suddenly, as if he’d decided that Steve couldn’t do that, couldn’t damage his daughter even more than his previous failures already had. Large arms scoop under his, searing, white hot pain climbing him in vines and branches as the newly-reinstated police chief begins bodily dragging him across the pavement towards the small gathering of cars parked at the roadside, ignoring the screams that rub his throat raw, the pain so bad it sinks him into the suffocating darkness of near-unconsciousness multiple times. \n\n\n\n\nThe next time his vision returns, he’s splayed across the backseat of a car he doesn’t recognize, and his words are so heavy in his mouth he can’t shift his tongue to speak. This doesn’t stop him from trying, only to find a hand cradling his face, shushing him. They smell vaguely of flowery perfume and the confusing addition of a faint, cheap men’s cologne. Had he been in a better state of mind, he probably could’ve played the gentle, motherly touches as Joyce—unfortunately, he wasn’t, and instead what came was a strained, pitiful little wheeze. \n\n\n\n\n“Mom?” To be fair to himself, he couldn’t really see, or feel, past the pain—but he felt her stiffen beneath the limp strength of his neck. \n\n\n\n\nA gruff voice is muttering away in the front seat, and part of Steve is sure he can recognize the tone, the vague outline of the body even as it swerves and jolts. Driving with such a force that the three people in the back cradling Steve keep holding too tight, choking a wailing scream out of him, deliriously thrashing with as much force as he can muster before a colorful harmony of strained voices pull him back into place, before he inevitably falls back into the cool darkness of before.\n\n\n\n\n\n\n\n\n There’s Hopper, screaming at Dustin, who’s in the front seat and keeps screaming at  him,  fearless in the face of Steve’s fickle chances of survival as they hurtle their way towards the hospital, having decided the ambulance wouldn’t get to them in time. Now reaching the sixth minute since the undercover American government agent pulled a gun and shot two rounds into Steve before Hopper returned the favor, blowing his brains out on the sun-warmed pavements of Hawkin’s central town plaza, they were swiftly running out of time. The sentiment was all the more urgent whenever Robin would cry out that Steve had fallen asleep again and  wouldn’t wake up, Hopper instructing Eddie, sat between Joyce and Robin with his hands pushing down on Steve’s bleeding torso, to push down harder, use the pain to wake him up again. \n\n\n\n\nEvery blood-curdling scream that came out of the guy’s mouth brought bile to the back of Eddie’s throat, the dry feeling of Steve’s flaking blood between his fingers mingling with the fresh, wet, thick renewal of it from the wounds he’s trying and failing to keep enough pressure on almost enough to have him faint himself. The only things keeping  him  awake is the distressed shrieking of Dustin in the front seat, the white knuckles of Robin, whose fingers are digging into his arm hard enough to draw blood, the firm trust of Hopper and the fear of his disapproval, for he’d pointed at him, hand bloody from Steve’s paling body, and said, “  You, Munson, come with us, now,”  \n\n\n\n\nHe was the chosen one, in all of this. Robin was Steve’s soulmate, in a sense, she could never leave him and fled Nancy’s embrace to do just that. Dustin was similar, though at first Hopper protested, they had no time for arguments, the boy throwing himself into the shotgun of the “borrowed” civilian truck. \nJoyce—he hardly knew the woman, outside of the warm hug she’d given him that one time when he’d given Will a lift home as a new member of Hellfire (Rebranded to Demobat’s Dungeon to avoid persecution) and thanked him, for letting Will play, for being kind to him, as if he  wouldn’t be. She was cradling Steve’s upper body now, uncaring for the blood and gore he shed over her clothes, something he thought impossible for a middle aged mother, who, in his imagination, were all about hating stains and keeping things pristine. \n\n\n\n\nWhich is probably why the faces of his fellow passengers looked so grim when Steve spoke up through his spotty wakefulness to ask after her as if she truly was his mother—a sign that they were on the brink of losing him for good. \n\n\n\n\nSteve’s eyes were rolling back into his skull until all Eddie could see were the whites of them, not the deep, chocolate-brown, puppy-like gaze he was so used to pining after, seeking, and all he could think of was Chrissy, the thud of her body on his floor, the weight of her in his arms when she refused to wake up. \n\n\n\n\n“ Steve.  Steve, man, you gotta stay awake for me,” He pushes his hands down into the blood again, cringing at the feeling of the raw flesh, but when it doesn’t earn him a heart-wrenching cry from the boy splayed across his lap, he falters, going cold all over. “Steve. Steve?  Steve!”  \n\n\n\n\nCasting a hand over his face, Eddie grips him by the chin, trying to rouse some kind of signs of life while Dustin’s crying hikes back up again in the front seat, Robin spewing panicked rambles about what he should and shouldn’t do to wake him, Joyce and Hopper shouting over each other from the opposite ends of the car.\n\n\n\n\nEddie slaps him, then, though he doesn’t really remember doing it, just the burning aftertaste of guilt when those eyes flutter open again, drowning in confusion as they lull up to stare at him. “There we go, that’s it, pretty boy, keep those eyes on me, you got it? Let’s not sleep just yet, Stevie,” He casts one hand through his hair, stroking the side of his face, Joyce mirroring his actions a little more delicately. \n\n\n\n\nSteve just looks entirely too confused for it to be fair, in this situation, the situation  he  put himself in, in the line of fire, like a hero,  again—  but then he starts humming, and Eddie’s throat goes dry, not needing to warn the driver that they were running out of time, running out of  Steve,  and any sense he ever had  left.  \n\n\n\n\nBut then he listens, just a little, amongst the sounds of anguish, at the gentle, rasping tune Steve hums to him, cold, limp hand doing its best to grip the front of his shirt. \n\n\n\n\n\n Hmm, hmm hmmm hmmm. Hmm-hhm hrmm hmm hmmmm. \n\n\n\n\n\n“Oh my god,” And Eddie laughs, then, because Steve had been complaining about missing  the most metal concert ever,  as described by Dustin, and Eddie had fulfilled his promise to play it for him just the other day, a little stoned, a little drunk on his full attention. And now Steve was bleeding out in his lap, trying his very best to hum Metallica’s  Master of the Puppets  to him as he died. \n\n\n\n\n“Eddie,” Steve’s hand flops weakly, an invitation, one he takes readily, looking at a worried Robin briefly before returning his full attention to the man of the hour. “Ed.  Ed— ” \n\n\n\n\nHis throat feels like sandpaper. “Save your strength, Stevie boy, you’re not looking so hot right now,” \n\n\n\n\n“That’s—well that’s, that’s rude,” Comes the bloody giggle, lips and teeth stained with it as he chokes out any quip he can muster. “You don’t think I’m—pretty, Ed? I thought I was,  pretty boy, to—to you,” \n\n\n\n\nSomething settles in his gut, a warmth, yet also a dread. “Come on Stevie, don’t do this to me right now,” He casts another bloody hand through his hair, inexplicably fond. \n\n\n\n\n“Sorry,” It’s so  earnest,  it hurts, and it has Robin shout at Hopper to go  faster.  \n\n\n\n\n “Hey,” Eddie jostles him a little. “We already heard your apologies, Stevie, I don’t think we can take any more.”\n\n\n\n\nJoyce nods silently in agreement, giving Steve’s hand a little squeeze. \n\n\n\n\n“But—your jacket. Ed, Eddie, you, I need to,” He coughs, a handful of blood spilling out of his mouth, down his chin and neck, eyes rolling back again. “It’s, I—folded. In my, table, by—by my bed. I’m sorry, I didn’t get it,” Another wet cough. “Back to you. I meant to.”\n\n\n\n\nHe doesn’t know he’s crying until he feels wet hot tears running over the slightly lopsided bridge of his nose, sniffling a little as he gives Steve another gentle slap to the cheek. “Hey now. It suits you, Stevie. I thought I told you to keep that thing?” \n\n\n\n\nBut he’s gone, lulling back into the intoxicating draught of the unconscious, the whites of his eyes twitching uncomfortably through thick, damp eyelashes, before Robin takes her turn, hitting Steve in a frustrated move of pure distress, gripping his face with both hands, determined. \n\n\n\n\n“Rob?” Steve’s eyes bounce up and down and back, misty and milky and far too distant to be right. “Robin, we gotta—we’re gonna be sooo,” He hiccups. “So, so late for work, Rob, it’s—it’s okay. I’ll tell…! Keith,  Keith, I’ll tell ‘im I… forgot, that I have a car, ‘n he’ll just ‘ave’a go, ‘t me,” \n\n\n\n\n“ Steve,” Robin weeps, bitterly, pressing a firm kiss to his forehead, one of her tears beginning to roll down his face from where it had dropped from her. \n\n\n\n\nHe goes again, for longer this time, pale enough and breathing so shallow that Eddie was sure, for just a moment that he’d died, dedicating his last words to  Keith, of all people—but after Joyce had cried out to Hopper and he cut a corner hard enough to climb the curb, Steve had startled awake again, eyelids heavy and pupils blown wide. \n\n\n\n\n“Dustin, I—I gotta, find Dustin,” His eyes don’t fix on anyone, voice feebly begging to anyone listening. “M’s ‘Ender’sson, she ge’s so, so  worried,  s’mmhm, givin’ mhm a liff’’ome, ‘ome where’s… where’s my  kid, I can’—I can’ fin’d’im,” \n\n\n\n\nSteve’s sobbing, tears mixing with blood, staining his supple face with tracks of agony. “I can’ t find’m,”\n\n\n\n\nOne of his hands grips Eddie’s hard enough to bruise. “Y’gotta—y’gggh. Y’ggh,” And he looks up to meet eyes with Dustin, who’s abandoned his front seat, climbing as much as he can into the back to reach for Steve, reach for  Eddie,  crying hard enough that he can feel it in his  chest, a deep, primal reaction.\n\n\n\n\n“ Steve,”  Dustin eventually manages, leaning over the seat to hold his head, tilt it his way. But Steve looks past him, at first, eyes distant and foggy.  “Steve!”  \n\n\n\n\nThere’s just a second, a fleeting moment, a final one—where those deep, beautiful eyes clear, just long enough to see Dustin. A gentle, fond smile stretches across his face, barely there, as Steve uses the last of his strength to drag his hand over where Dustin’s rests, over his heart, and threads one or two of their fingers together. \n\n\n\n\nJust a second. \n\n\n\n\nBecause Eddie watches, firsthand, as despondent horror grows on Dustin’s face. He feels the last of Steve’s body go limp, head falling back into his lap. \n\n\n\n\n\nFeels as the last of his life leaves him, stretched out across them like a martyr. \n\nThe next time Steve opens his eyes, he’s younger. Everything is, really—his house, carpets softer than the hardwood floors in the foyer now, walls still the gently peach colour they were when he was a kid, reminiscent of the warmer colours of the seventies. There’s a picture hanging there, one that no longer does so—it’s a family portrait, when getting those taken was the trend of the week in Hawkin’s suburbia. \n\n\n\n\n\nSteve can see his murky reflection in the glass of the frame before he looks through it—and fleetingly, he knows he must be about seven, about \n\nmiserable, \n\nthe hand of his father gripping his shoulder just a little too firmly. If he tries, he can still remember the light purple indents, the bruises, left from posing for that stupid, ugly picture, remembers being nine, watching his mother use it as ammunition the third or fourth time Harrington Senior was caught having an affair on a ‘business trip.’ \n\n\n\n\n\nThat’d been when they’d begun to go together every time, after that argument, when nobody had picked up the broken glass from the picture frame and Steve had stayed quiet about the piece he’d accidentally stepped on, the piece he’d pulled out of the flesh of his foot like a ribbon from a gift, bleeding all over the pristine tiles of his en-suite bathroom. When his mother wanted to be certain, at least, that his father was sleeping with a prostitute in the motel room next door. It was less humiliating for her, in that way. \n\n\n\n\n\nBut where Steve is now, the portrait still hangs. So Steve must be seven. \n\n\n\n\n\nHe wonders why, distantly. If he’s dead, why would this be the afterlife? He thinks fleetingly about a debate he had with Nancy one (though nobody could really \n\ndebate \n\nwith Nancy), about how heaven wasn’t real, how she’d said that people who ‘saw the light’ had all just experienced some trick of their dying brain chemistry. \n\n\n\n\n\nMaybe that was this. \n\n\n\n\n\nIt doesn’t really matter, because Steve feels himself grow detached, falling back into the footfalls he’d practiced to be quiet back then, as the Harringtons liked their son to be seen, not heard; though sometimes the first wasn’t applicable, either. \n\n\n\n\n\nSteve Harrington is seven years old. It is the week before Christmas, and Steve Harrington is seven years old, Steve Harrington is home alone for the first time. Steve Harrington is not very good at reading, or math, but he can run faster than most boys in his class, which is why Kelly and Jenny and Tiffany and Shannon all have crushes on him at the moment. \n\n\nSteve Harrington is seven years old, and he’s lost two of his baby teeth, one of which was wobbly, so his dad tied a string to it and the door handle, slamming it until it flew out in a bloody mess, because Harrington men don’t ever do things halfway. \n\n\n\n\n\nSteve Harrington is home alone, he’s seven years old, and he’s scared of the dark. Steve hasn’t slept properly since his parents left on their trip, because Steve is scared of the dark, and has never been on his own for this long before, and Steve is scared. Steve wants to come and live with Tommy H and his family, because Tommy H is also scared of the dark, and they bought him a nightlight instead of locking him in a cupboard for a little while. \n\n\n\n\n\nBut Steve doesn’t know Tommy H’s landline number by heart, doesn’t really get how the phone works, and it is much, much too dark to try and walk to his house now.\n\n\n\n\n\nSteve Harrington is seven years old when he falls down the stairs—it’s not the first time he’s done it, he crawled backwards as a baby. But this time Steve trips at the top of the stairs because he can’t keep his eyes open any longer, and his head hits the bottom step with a sickening \n\ncrack, \n\na crack so loud that for a moment he thinks he’s dead. Steve Harrington is seven when he blacks out worrying about the small pool of blood that empties itself from the head wound, staining his mother’s nice, fluffy carpets. \n\n\n\n\n\nMaybe that’s why they got rid of the carpets, Steve doesn’t really remember. What he does remember is trying to single-handedly care for the first, (not the last) and one of the worst concussions of his life. He remembers throwing up for days, struggling to stay awake, fighting to eat any of the pre-made sandwiches his mother had made with numbers stuck to the white sliced bread so he wouldn’t eat them all in one go. \n\n\n\n\n\nHe remembers crying on that same step that almost killed him when his parents got home on Christmas Eve, screaming about the sick stains, blood stains, but did not so much as tut over the large dip in the side of his head, one Steve can still find with his fingertips if he studies his scalp for long enough.\n\n\n\n\n\nHe remembers forcing himself not to cry when his dad took the Christmas bike wrapped up for little Steve apart piece by piece, scattering it across their garage. Remembers spending Christmas Day trying to rebuild it, believing he had, and trying to ride it to Tommy H’s house, only to discover that mechanics would never really be his thing when the wheel came off after a few pedals, and he still managed to break his little wrist. \n\n\n\n\n\nBut that’s not quite how it goes this time. Seven year old Steve Harrington lies in his halo of sticky, hot blood at the bottom of the stairs, and is convinced that he’s dying. Only this time, the front door opens, and a girl, one much taller and older than him, stands there, a gentle stream of blood dripping from her nose.\n\n\n\n\n\nShe has no hair, which little Steve finds sort of weird, but he can’t really say that, because it’s rude, and Steve gets into trouble when he’s rude. He doesn’t complain when the bald girl crouches by him and frowns, giving the dip in his head a little \n\ntut, \n\nand does her best to carry him to the leather sofas in his living room. \n\n\n\n\n\nSteve thinks she’s sort of strong, because his mother says he’s too heavy to carry these days, but this girl with no hair carried him sorta far, and she didn’t even drop him. \n\n\n\n\n\nBut Steve is too far away now to really remember that this is a memory, entirely warm and content in letting Eleven invade the discomforts of the past and right them, at least for now, bundling him in warm blankets from the laundry closet, the nice ones that he’s not allowed to touch. \n\n\n\n\n\nHe lets himself curl up in her lap, lets the child of the past receive a sense of closure, and distantly sort of understands why he’s here. He supposes it’s meant to be some kind of lesson, a relinquishment, a promise that he’s capable of letting someone else take care of him. And he does, he lets seven year old Steve Harrington be cradled, ignoring the bratty urge to exclaim that he’s way too old for this, when really he never really stopped craving this sort of care, even now. \n\n\n\n\n\n“It will be ok,” The girl with no hair says, putting her hand to his temples with just the tiniest pinch of pressure. It feels a little bit like she’s rifling through his brain, but seven year old Steve doesn’t really mind, he’s hit his head so hard it feels like cotton between his ears anyway. “But you need to wake up. Steve. So you have to… fall asleep.”\n\n\n\n\n\nIt makes no sense. It’s nonsense, little Steve thinks, with a dopey smile. But he’s tired, and the girl with no hair is gently patting his hair like his mother used to do when he was really, really tiny, so he doesn’t really protest. He just wiggles a little until he’s comfortable on the cool leather of the sitting room sofa, gives a weak little sniffle, and lets his heavy eyes fall shut. \n\n\n\n\n \n\nAnd it’s like one of those dreams, where you fall off a tall building, the adrenaline your brain fools itself with startling you awake in a fit of sweats and a racing heart rate. \n\n\n\n\n\nSteve sits up, only to grab his side and \n\nscream, \n\nbecause it burns, red-hot pain, and he can’t move for wires, tubes and stiff white bed sheets, black spots behind his eyes as he fights the urge to pass out from the agony of it all. \n\n\n\n\n\nThe lights flicker, just for a minute, and he uses them as a distraction to take in his surroundings, finding the girl from his dream—\n\nEleven, \n\nso his ‘dream,’ then, at the foot of his bed, trying to subtly wipe the blood from her nose. \n\n\n\n\n\n“They told me not to,” She says earnestly. “But every one is upset. They need to know that you are okay.”\n\n\n\n\n\nSteve just stares, wheezing softly through the oxygen mask strapped to his face. \n\n\n\n\n\nEleven just looks a little guilty. “They need you. I could… feel you. Hiding, in your… head. They need you.”\n\n\n\n\n\nAnd before Steve can protest, she flees, pulling the door nearly-closed behind her without so much as touching it, abandoning him with his foggy thoughts and excruciating pain. \n\n\n\n\n\nHe’s not alone for long—Nancy takes her place in a flurry, Jonathan at her heels in a trance that Steve isn’t sure whether to blame on weed, stress or exhaustion. And she’s chewing him out, he knows that she is—but he’s so fuzzy, so confused, that eventually she stops, and holds his hand in a way that once he would’ve taken as a sign. Now he just struggles to give it a weak squeeze in return, and dares to take Jonathan’s hand, too, from where it awkwardly sits at his bedside, to the boy’s complete shock.\n\n\n\n\n\n“I’m,” His voice is so raw it hurts, at first. “I’m sorry about Will. I know, you… you wanted today to be good for him.”\n\n\n\n\n\nThere’s a serious possibility, Steve thinks, that Jonathan considers socking him in the face. Because he’s wearing an expression similar to the \n\nlast \n\ntime Steve spoke about Will, during their alleyway scuffle, all screwed up like an angry pug. \n\n\n\n\n\nHe doesn’t, though, instead he just grips Steve’s hand hard enough to hurt, and struggles with his words, because the two of them are civil, sure, but this is way out of their comfort zone. “Sure, this, totally… sucks, for a birthday, but I think Will’s day would be way worse if you had let one of his best friends get shot in the head,” \n\n\n\n\n\nNancy hisses \n\nsomething\n\n in a hushed, strained tone, some sort of complaint about his phrasing, but Steve just smiles, chuckling once until he discovers that he’s pretty sure forcing out another one might reopen the surgical stitches that crawl up his chest. \n\n\n\n\n\nThe pair of them go quiet then, hovering over him like they’re worried he might go into hysterics, or shock, or something, and then they seem to make some sort of unconscious decision. Because Nancy presses a kiss to the top of Steve’s head, a rough, fleeting one, and Jonathan gently readjusts Steve’s pillow so it’s under him properly, not at the funny angle it had been in when they arrived, before leaving together. \n\n\n\n\n\nSteve’s not really sure how long they were there for, or how long it is before his next visitor arrives, because he closes his eyes for a little while, rousing to a nurse fiddling with one of the many tubes plugged into him. \n\n\n\n\n\nIt’s Lucas, next. Steve sort of gets the idea that they’re sending them in small groups to avoid his fragile extremities collapsing from exposure, but as the boy sits on the end of his bed and helps him eat a hospital pudding, he also tells him that some of them are worse for wear. \n\n\n\n\n\n“Robin went into shock, sorta, when you died in the car,” Lucas taps the handle of the spoon against the skin of Steve’s forearm, who just listens quietly. “Joyce had to call her parents. They took her home, but they said—they said they’d bring her here as soon as she was more. Y’know?” He makes a vague hand gesture in the way young teenage boys do. \n\n\n\n\n\n“Right,” Steve tries not to feel like the world is crashing down on him. “And, uh, Dustin…?”\n\n\n\n\n\nLucas gives him a grimace that says enough.\n\n\n\n\n\n“Cool. Cool cool cool.” \n\n\n\n\n\nA sympathetic wince twitches onto the younger boy’s face, and they drown a little in the uncomfortable silence for a few minutes, Steve entirely put off of the hospital pudding. \n\n\n\n\n\n“Uh, Steve?”\n\n\n\n\n\nHe lifts his head up to attention as best he can. \n\n\n\n\n\nLucas shifts. “Just, y’know. You said a lotta stuff when you were bleeding out on the pavement.”\n\n\n\n\n\nIt’s his turn to grimace, then. “Jesus, if it was anything—\n\nshitty, \n\njust, ignore it. I can’t pretend I remember much of it, dude.” \n\n\n\n\n\nShaking his head a little frantically, Lucas bites at his lip. “No, no, it wasn’t, \n\nbad, \n\nlike, in the way you’re thinking, you just. It sorta sounded like you were apologizing for all the shit Jason did, like… you had anything to do with that. It was totally out of your control, man, he was a raging psycho.”\n\n\n\n\n\nMouth a little dry, Steve offers a light shrug, too weak to do much more physically. “I just shouldn't have let you, Erica and Max be in that house alone. Not when we knew Jason was on some witch-hunt.” He swallows. “Billy was bad enough. Jason did a fucking number on you, and I shoulda been there, or you shouldn’t have been there. So yeah, I’m sorry,”\n\n\n\n\n\nLucas’ eyebrows raise, pinching in a frustrated line down his forehead. “When Max says your head is just a block of concrete, I usually defend your honor, Steve, but that’s some stupid shit,” \n\n\n\n\n\n“Hey,”\n\n\n\n\n\n“No, hey yourself,” As if to prove a point, Lucas indignantly eats a spoonful of Steve’s hospital pudding. “You know my parents still think of you as the golden boy of Hawkins, right? The hero who saved their son from big bad Billy?”\n\n\n\n\n\nSteve looks incredulous, doubt clouding his sickly-pale face. \n\n\n\n\n\n“I mean it, man, no joke,” Lucas folds his arms. “You were my hero too, back then.”\n\n\n\n\n\n“I \n\nlost—“\n\n\n\n\n\n\n“You took a \n\nplate \n\nto the head. For \n\nme, \n\nSteve. I’d never had someone do something like that for me before.” Lucas clicks his tongue, and for a moment Steve sees where the Sinclair siblings share their authoritative attitude. “Sometimes me and Dustin would meet up just to talk about how cool you were, after it all happened. You got the worst beat down of your life for me, then still went into those stupid tunnels just cuz we were, and then you picked Dustin up and used yourself as a human shield against the demodogs, even when it looked like your face was ready to fall off.”\n\n\n\n\n\nThere’s a pause where Lucas expectantly waits for Steve to argue, but finds himself pleased by the older boy’s exhausted inability to do so. \n\n\n\n\n\n“Jason Carver is a total wack job, but he doesn’t scare me half as much as Billy did. Plus, when he smashed a vase over my head? I was like, \n\nsick, \n\nnow I really feel just like Steve,”\n\n\n\n\n\n“He smashed a \n\nvase \n\nover your head?”\n\n\n\n\n\n“That’s not the point,” Lucas scolds, though humor eats away at his expression. “The point is that if you keep trying to take ceramics to the head to protect me, I’ll never learn how to protect myself, and you’ll get, like, permanent brain damage.”\n\n\n\n\n\n“So stop beating yourself up. Other people do that to you enough,” Lucas taps his arm with a light fist bump. “Okay?”\n\n\n\n\n\nHeaving out a sigh, Steve feels the corners of his eyes crinkle fondly, shifting to give Lucas a proper fist bump. “Fine,” Then a weak smile. “Starting to feel like we need to leave the house with helmets these days though, just in case any stray pottery comes flying.”\n\n\n\n\n\n\n\nSleep came in and out in dregs again, a steady stream of nurses and doctors poking and prodding him, making sure he’s still alive. Then Joyce returns with Will, whose eyes are slightly red rimmed, and doesn’t have a whole lot to say. Which is okay. Steve got the feeling that he had a lot more talking to do later on—and if he knew anything about Will, he knew the kid was tactile. Sensitive, too.\n\n\n\n\n\nSo he used the little strength in his arms to pull him in for a loose hug, ignoring the aches and groans of his gown-clad body for the sake of letting Will cry it all out into his shoulder, ignoring the weird feeling that came with the gentle, sad looks Joyce kept shooting Steve from across the room. He just lets him work it all through, because if Steve learnt anything from the way his dad raised him, not being allowed to cry it all out makes you a major, repressed douchebag in high school, and he’d much rather suffer a wet patch on his shoulder then ever have to envision Will turning out the way \n\nKing Steve \n\nhad. \n\n\n\n\n\n“If I’m not allowed to say sorry,” Under strict instructions from Joyce, “You can pick the music in my car until your next birthday. That sound good?”\n\n\n\n\n\nAnd if the fearful chuckle was any indication, Steve thinks Will was pretty down for that idea. He left soon after, leaving Steve with Joyce for just a few more moments, who pressed a kiss to his forehead, and heart-wrenchingly made him promise to never die in her arms again.\n\n\n\n\n\n\n\nMike is delivered through the door next, Hopper practically tossing him inside, a firm hand wrangling the teenager by the shoulder. \n\n\n\n\n\n“Mike has something to say to you,” Comes the gruff insistence from the police chief, despite the clear displeasure of his fellow visitor.\n\n\n\n\n\nSteve shuffles in his bed a little, trying to get comfortable despite the clear \n\ndiscomfort \n\nof this situation, which only grows when Mike glowers at him with that typical Wheeler rage. \n\n\n\n\n\n“I wanted—I wanted,” He balls his fists at his side. “To say thank you. Even though you’re fucking stupid, and you made everyone go totally batshit insane because you’re an idiot with a goddamn death wish.” \n\n\n\n\n\nIt looks like Hopper is seriously considering smacking him upside the head, but he contains the urge. \n\n\n\n\n\n“Listen, I think you’re a jackass,” Mike says, with his usual teenage boy charm. “But,” He takes a breath. “If—if you hadn’t done what you did, El, would. El probably wouldn’t have—made it.” Mike’s chest heaves a little, and his eyes drop to the floor. “So thank you.” And then he turns on his heel and storms out, slamming the door behind him.\n\n\n\n\n\nHopper settles his hands on his hips, one jutting out a little. “That kid’s gonna be the death of me.”\n\n\n\n\n\nSteve chuckles—only to be met with a sharp glare. He gets the sense that he was set up, somehow, with that one. \n\n\n\n\n\n“Oh no, Harrington, you don’t get to laugh about that one. You died, back there. Your heart \n\nstopped.” \n\nAnd then he stalks over, with all the swagger of a middle aged man in a mood, and drags the chair nearest the bed a little closer with an uncomfortable squeak of the legs on linoleum. \n\n\n\n\n\n“Sorry, Hopper, Sir,” Steve chokes out, bewildered. \n\n\n\n\n\nIf anything, that just makes him more pissed, because then suddenly Hopper points a finger at the thickest of Steve’s bandages, right over where the first shot had hit him dead center in his chest. “You don’t get to apologize,” He swallows, shifting in his chair. “That bullet wound, there, right here?” That finger hovers over the bandages, the man’s brow creasing. “That’s just about level with El’s head. Almost exactly. If you—if you hadn’t,”\n\n\n\n\n\nHopper sets a rough, large hand on Steve’s shoulder, squeezing. “He would’ve shot El straight in the head. Neutralized her in one shot. There’s no coming back from a shot like that, Harrington. We would’ve lost her forever,”\n\n\n\n\n\nVulnerability creeps its way onto Hopper’s expression. He falters. “I would’ve lost her forever. So I don’t want you to apologize,” He stands, uncomfortable, voice thick with the threat of an emotional outburst. “But you can’t scare the shit out of us like that again, Harrington—Steve. You can’t. Are we clear?”\n\n\n\n\n\nNodding a little dopily, Steve is a dangerous mix of ashamed and proud in the wake of Hopper’s confessions. “Yes—yes. Clear.”\n\n\n\n\n\nWatching as Hopper slaps his own thighs and prepares to awkwardly stalk from the room, Steve surprises himself, voice scratching from out his throat just before he’s alone again. “Hopper?”\n\n\n\n\n\n“Yeah, kid?”\n\n\n\n\n\n“Please tell her it’s not her fault. Slander me however you like, I just—don’t let that shit sit on her conscience.”\n\n\n\n\n\nHopper just smiles, and nods silently, watching the relief ease into Steve before taking a swift, calculated exit before any more underlying emotions are brought up to be discussed. (Because for the love of God, that is so not Jim’s strong suit.)\n\n\n\n\n\n\n\nMax is a little harder. Because he’s actually asleep this time, and waking up to find the girl studying him intently is a lot startling, Steve having to swallow down the urge to yelp.\n\n\n\n\n\n“I was making sure you were breathing properly,” She admits, eventually, when Steve’s been silent for long enough. Max then cringes, and rolls her eyes. “Only because your brain can’t afford to be starved of any more oxygen.”\n\n\n\n\n\nSteve coughs, wincing. “Thanks Max,”\n\n\n\n\n\nThen they stew in silence for a while, both of them entirely aware of what’s hanging between them, the elephant in the room. It’s not just awkward, it’s suffocating, and Steve fights to not break the silence, knowing that if he says the wrong thing in a conversation like this with Max, the topic will never be broached ever again. \n\n\n\n\n\n“You’re not Billy,” Steve has to force himself to not quip back a \n\nthank you\n\n to that, again. \n\n\n\n\n\nMax balls her fists. “You’re not Billy, and I don’t want you to be Billy. I’ve never wanted you to be Billy.” \n\n\n\n\n\nSteve just blinks. “Okay,”\n\n\n\n\n\n“Shut up,” She takes a shaky breath. “Just—just listen, okay? You always think you know best but you don’t, so be quiet and listen to me,” As instructed, Steve nods slowly, albeit bewildered. \n\n\n\n\n\n“Billy was my brother. So—so I’m, like, obligated to care about him in a way. He was my brother, Steve. He had no choice. He was awful to me and my friends and \n\nyou, \n\nand then he died and it hurt me because he was my brother, and I couldn’t choose for it not to hurt me if I tried,” Max grips the railing of the bed, refusing to meet Steve’s eyes.\n\n\n\n\n\n“You’re not Billy, because you’re not my brother, but, mostly because you,” A shaky intake of breath. “You’ve chosen. You’ve chosen to care about me, you had the choice and you \n\nchose, \n\nyou protected me when I was just some random girl to you, and you did—you did and you acted in every way that I wanted \n\nBilly \n\nto act like, you acted like you were my brother and I hated you for it because Billy would never choose to do the same even with a goddamn gun to his head,” \n\n\n\n\n\nShe hugs herself, arms loosely gathering around her torso. “And sometimes I speak to you and I wish you were my brother. I imagine that my mom met your dad, that they got married instead of—instead of Billy’s dad, I imagine that you cared about me from the start, looked after me, looked out for me,” \n\n\n\n\n\n“But you aren’t my brother, Billy was. And Billy died and I felt like the worst person in the world for wishing he wasn’t my brother, for wishing that you were, but you haven’t—you haven’t \n\ntaken \n\nhis place.” Max rushes forwards all of a sudden, a fire burning in her eyes with such a ferocity Steve wonders how anyone could hear her speak and not be entirely captivated and a little afraid of the way she does so. “You two aren’t—comparable. But you still act like, how—how I’d want a brother of mine to act, to… to care.”\n\n\n\n\n\nMax furiously wipes away the threat of tears with the sleeve of a jacket she’s borrowed off of Lucas, body shuddering under the weight of her words. “So if you—if you ever fucking \n\ndare \n\npull shit like that again, Steve, I won’t put up with it. If you die I’ll go completely insane and it’ll be your fault. So you can’t. You can’t do that to me, okay? It’s not just Dustin who cares, Steve, you were dying and that’s \n\nnot okay,”\n\n\n\n\n\n\nPromptly bursting into tears, Max falls into the embrace Steve hesitantly offered as her words stumbled into sobs, though stunned, he forces his arms to curl around her, before eventually she clambers onto the bed and curls up in a ball against his chest, arms looped around his neck as full-body, guttural cries tear through her, soothed slowly by the constant rise and fall of Steve’s breath. \n\n\n\n\n\nHe can’t place exactly how long they stayed that way—he only knew that they both fell asleep at some point, exhausted, drained—Max pried away from him when it was later, Hopper gathering her in his arms to take back to his cabin for a much needed sleepover with Eleven. \n\n\n\n\n\nSteve knows he slept most of the night, too, the good pain stuff finally sending him on his merry way, which is what he attributes to feeling someone casting a hand through his hair gently and speaking to him slowly, gently, because when he finally manages to open his eyes, there’s nobody there. \n\n\n\n\n\nWhen Robin returns, though, it’s four in the morning, and she definitely makes herself known. She chucks a large variety of different, brightly coloured sweet packets onto the bed, one of them directly at Steve’s head, smacking him square in the face. \n\n\n\n\n\n“Rob—hey? Ow?” Steve makes sleepy gestures to his wounds, rubbing sleep from his eyes. \n\n\n\n\n\n“You’re the worst person I’ve ever met and I hate you more than ginger beer,”\n\n\n\n\n\n“Ok. I still don’t get why you hate ginger beer, Rob, it’s good,” Steve blanks, watching Robin pace violently back and forth across the small space of his hospital room. “What is all this stuff?”\n\n\n\n\n\nRobin smacks her hands together, making Steve startle a little. “I raided the vending machine with Eddie, he broke it and everything poured out. That’s not the point,”\n\n\n\n\n\n“Wait, Eddie’s here?”\n\n\n\n\n\n“Oh my \n\ngod, \n\nSteve shut up!” Steve shuts up. “Y’know that time when we got stuck in that Russian paradise under the mall—”\n\n\n\n\n\n“I mean, yeah, Rob, that’s pretty hard to forget—”\n\n\n\n\n\nFor his troubles, Steve gets another walloping from a stray bag of sweets, stiff from being in the machine for god knows how long. \n\n\n\n\n\n“We got stuck in there, and you—you did this thing, where you kept going first, kept stepping in front of everyone and I was like, gee, this guy is such a macho man, I bet he wants us to applaud his manly bravery, blehblah,” Making wild hand gestures, Robin suddenly grips the railing of Steve’s bed, shaking it back and forth a little. “But that’s the thing! You weren’t doing it because, like, you wanted to be manly or whatever, you just—you do this thing, where you try and protect everyone like you’re some human shield and it’s so goddamn stupid!”\n\n\n\n\n\nSteve is too scared to speak for the sweet artillery, but he does offer Robin a dopey little facial expression. “Even when actual, armed Russian soldiers with actual guns were trying to kill us, you made Dustin and Erica run away, and then you kept \n\ntalking, \n\nand I only recently realized that you kept talking cuz you knew I can’t shut up unless someone else is speaking all the time. And you kept talking til you annoyed that freaky Russian guy and they dragged you away and they tortured you first because you wouldn’t shut up, and I was sat at home thinking oh my God, that fucking weasel!”\n\n\n\n\n\nRobin throws another sweet packet at him, despite his silence. “You weasel! You did it on purpose, made them take you first because you knew that Dustin would pull it off, you decided to stall them with your stupid face getting a stupid beat down! You kept speaking so they wouldn’t choose \n\nme, \n\nand, and for like—twenty minutes down there I thought you were dead.” She swallows, thickly. “They strapped you against me in that chair and for twenty minutes I was so scared that they’d just strapped your corpse to me because you wouldn’t move or groan when I moved around and I couldn’t feel you breathing!”\n\n\n\n\n\n“I didn’t even like you back then, not til it was all said and done and I realized that oh, Jesus, Steve Harrington is my favorite person in the whole world, how messed up is that? And then you were my best friend, and I love you so fucking much, I, like, don’t think I could go a day without talking to you, Steve, it’s like, being platonically obsessed with you,” \n\n\n\n\n\nRobin makes very little space for breathing in her rant, having to pause just to pant for a second or few. “Then—then Vecna happened, and we were out on Lover’s Lake and you just started getting \n\nnaked \n\nand I was like \n\nshit, \n\nhe’s doing it again! And I annoyed the fuck out of Nance asking her how long you’d been down there every ten seconds because I was so scared, Steve, I was terrified you wouldn’t come back up, that somehow Vecna would get you and you’d drown before we realized,”\n\n\n\n\n\n“Then you came back up,” Robin’s hands are shaking uncontrollably, Steve notices. “And I was so relieved. I was like, shit, he’s put himself in the line of fire and hasn’t—been \n\nmaimed. \n\nAnd I think I cursed you because then you got pulled down and I was so horrified, Steve, not scared to go after you, scared—scared I’d be too late. And we almost were.”\n\n\n\n\n\nShe leans forwards, tracing the scar that spans across his throat. “And today we were too late. Steve, you \n\ndied. \n\nLike, you heart stopped, blue lips \n\ndied. \n\nEddie, he still—he can’t get all of your blood off his hands, and that’s probably why he hasn’t come to see you yet because I think he’s gone through like. Six cigarettes and counting, and maybe he thinks this is karma, because I told him what you were like when \n\nhe \n\ndid this to us, but he’s forgiven because it’s the first strike for him—this is strike what, for you Steve?”\n\n\n\n\n\nRobin puts up her hands. “Let’s count. One, you went back inside the Byers’ place and saved Nancy and Jonathan with a bat from an inter dimensional monster you knew \n\nnothing \n\nabout.” She puts a finger up. “Two—you went along with those stupid kids and almost got eaten by demodogs protecting them. Three—you pushed yourself in the way of Max and those dogs when they almost got in the trailer,”\n\n\n\n\n\n“I think that should count as just one—” Steve gets hit in the face with a packet of Parma Violets. \n\n\n\n\n\n“Four, you went to a showdown with Billy Hargrove, who’d been looking to kick your ass since the school year began. Five, you stepped between him and Lucas and got beat so bad Hopper had to try and fight you to get you to come to the emergency room. Six, you followed those kids into those tunnels. Seven—you picked Dustin up and prepared to get \n\neaten \n\nor \n\nshredded \n\nby those demodogs, and only didn’t because of pure luck, Steve.” Just for the look on his face, a Sherbet Fountain is launched his way. “Eight, you refused to let anyone but you touch that glowing green stuff in the Russian elevator.”\n\n\n\n\n\nRobin takes another breath. “Nine, you got into a fight with an armed Russian. Ten, you held the door while Dustin and Erica got away. Eleven—you got yourself tortured for \n\nme, \n\nand almost definitely nearly \n\ndied. \n\nTwelve—you packed those kids into that car and you drove in your state. Thirteen, you turned \n\naround \n\nand drove back to help them even though it was almost certain death.”\n\n\n\n\n\nSteve tries to argue that Robin was with him for most of this, too, but falls silent when she raises a drumstick lolly in warning. \n\n\n\n\n\n“Fourteen, you totaled Billy Hargrove’s car to save Nancy, Jonathan and the kids. Fifteen, you helped them fight that huge mega monster with fireworks.” Robin stalks over to him, eyes blazing with earnest fondness. “Sixteen, you followed Dustin to Reefer Rick’s house because you trust him, even though it sounded like Eddie was a murderer. Seventeen, you took a shard of glass to the neck for your troubles. Eighteen, you refused to leave Max alone even though Vecna could’ve got you, any of us. Nineteen, you got half naked in that stupid boat on Lover’s Lake and you dove down there. Twenty, you got dragged through the gate.”\n\n\n\n\n\n“Twenty-one, those bats nearly fucking killed you. Twenty-two, you stayed in the Upside Down with Nance because Vecna got her, when you could’ve left her there and been way safer. Twenty-three, you stole and drove a whole mobile home just because Eddie said it was the best move and we needed weapons. Twenty-four, you went into Vecna’s lair first, twenty-five, you almost died just trying to cut me down from those vines. Twenty-six, you fought \n\nVecna \n\nafter all of your goddamn,” She makes a hand gesture to his neck. “Neck trauma. Twenty-seven, you refused to leave Eddie’s body behind, and did CPR with your stupid lifeguard training in the Upside Down when any old monster could’ve come and \n\nate \n\nyou.” \n\n\n\n\n\n“Twenty-eight, you lugged him all the way to Hawkin’s Lab before we even knew you were sick. Twenty-nine, those bat bites? They \n\ndid \n\nmake you sick.”\n\n\n\n\n\nRobin points to his gun wounds. “Thirty. You got shot protecting El. Twice. And then you \n\ndied. \n\nFor real, \n\ndied. \n\nThat’s thirty strikes Steve, not three strikes and you’re out—thirty! Do you realize how insane that is?”\n\n\n\n\n\n“Okay, but some of those should definitely not count. Loads of the rest of you did them too,” Robin hits Steve with a Skor Candy bar. \n\n\n\n\n\n“Yeah. Sure, we did. But we don’t already have a track record for stupid heroics, jackass!” And then she shoves him, then drags him back up again, pulling him into a really, really tight hug. Despite the searing pain in his chest, he reciprocates, shoving his face into her shoulder and closing his eyes. \n\n\n\n\n\nShe wasn’t wrong. Maybe they were a little codependent. His nose wrinkles.\n\n\n\n\n\n“Hey—are you wearing my aftershave?” \n\n\n\n\n\nRobin grins at him. “Yeah, rich boy Steve. I swung by yours, since, y’know, you gave me a key and all—picked you up some essentials. Like your hair products, dingus.”\n\n\n\n\n\nSteve lights up like a Christmas tree. “You’re—”\n\n\n\n\n\n“Your favorite person ever? The best? I know, Steve. And I love you. But if you get to strike thirty-one, don’t be surprised if I give you strike thirty-two when I smack you so hard you fall into the Upside Down.”\n\n\n\n\n\n\n\nOnce firmly admonished by Robin (and then her parents, who still seem to think they’re irrevocably in love) Steve, against the wishes and strict instructions of his doctors, dragged himself out of bed. With one hand holding the metal pole on wheels that attached the main machines and IV bags he was hooked to, Steve limped and wheeled his way through the quiet, artificially lit hospital corridors, searching.\n\n\n\n\n\nIf he knew Eddie, he’d be here. Skulking about somewhere. There was no one else holding down the fort—but no way would they leave Steve alone. Hopper was home with Eleven and Max, Will and Jonathan had gone back with Joyce, Nancy and Mike in tow, and Steve had no doubt that the Sinclairs and Hendersons were a merged family unit for the night. Robin had just been dragged back home. \n\n\n\n\n\nThey wouldn’t leave Steve alone, someone would be holding down the fort.\n\n\n\n\n\nAnd there he was, just outside the hospital doors, smoking as the sunrise just began, the air warm and thick and quiet in the fifth hour of the morning.\n\n\n\n\n\n“Eddie?” His voice is raw, and still a pain to try and use, especially as Steve tries to keep pushing on forwards on limbs that should probably not be in action right now.\n\n\n\n\n\n“Yes, Steve—\n\nSteve?” \n\nEddie whips around, cigarette falling from his fingers, abandoned on the floor as he stumbles over, taking Steve by the arms and balancing out some of his weight. “What the fuck, man, Jesus Christ, you should \n\nnot \n\nbe out here!” \n\n\n\n\n\nYeah, Steve agrees, as his vision clouds a little from the pain. “Robin said you were here.”\n\n\n\n\n\n“Buckley is a meddlesome minx,” Eddie scorns, looping his arms around Steve to take his weight. “We’re going back to your room, now, before you keel over and die \n\nagain.”\n\n\n\n\n\n\n\n“\n\nHey,” Steve grumbles, though he follows Eddie’s lead as they begin to trudge back through the hospital. “You can’t be mad at me. You did this whole, thing, like… a couple months ago. You died on me \n\ntwice \n\nwhile I tried to give you CPR.”\n\n\n\n\n\nEddie chuckles, dragging him round the corner. “What’s the matter, offended the Harrington kiss of life didn’t wake me up, Prince Charming?”\n\n\n\n\n\nFeeling heat around his neck as Eddie jostled with the door handle, Steve resides to just roll his eyes. At the time, the CPR had been entirely practical, when all he was able to worry about was Eddie’s life hanging in the balance, not the fact that technically he was mouth to mouth with another dude.\n\n\n\n\n\nAnother dude, who he enjoyed looking at. Just a bit too much. \n\n\n\n\n\nBut this dude just helps him clamber back onto his bed, though he does falter for a second when Steve’s gown saves little for the imagination—Eddie suddenly finding the ceiling fascinating until Steve is safely sat down and much more modest. \n\n\n\n\n\n“\n\nFor your modesty, man,”\n\n\n\n\n\n\nSteve wishes Eddie had another jacket to throw at him, or something, right about now. \n\n\n\n\n\nHe’s snapped from his thoughts when Eddie takes a seat on the bed beside him, looking pained.\n\n\n\n\n\n“You’ve gotta stop making eyes like that at me man, it’s not fair,” Steve isn’t really sure what that means, this is just his face—and now that same face looks about ten times more confused. “Yes, that face, \n\nSteven\n\n, that face,”\n\n\n\n\n\nSteve grimaces at the use of his full name. “Sorry, dad, when did you get here?”\n\n\n\n\n\nA grin sparks its way onto Eddie’s face, ruffling Steve’s hair. “Sorry, Stevie. You like that better?” His voice is tender, entirely too soft for it to come out of Eddie ‘The Freak’ Munson, yet it does, gently making the hairs on the back of his neck stand on end. \n\n\n\n\n\n“Yeah. That’s better,” Steve looks up at him, mellow and maybe a little smitten, when Eddie suddenly smacks his arm. “Ow,”\n\n\n\n\n\n“Those eyes! Stop making those eyes at me, man, normal people don’t make eyes like that at their very male, very \n\nnot\n\n Nancy Wheeler, \n\nfriends\n\n, Stevie!”\n\n\n\n\n\nOnce again, Steve is just completely lost. “I thought we \n\nwere\n\n friends?”\n\n\n\n\n\nThe stare Eddie gives him is nothing short of utter disbelief. “Y’know, when Max said you had a concrete block for a brain, I defended you, man. You’re not helping your case.”\n\n\n\n\n\n“Why do people keep saying that?”\n\n\n\n\n\nAnother incredulous look from Eddie. “You wanna disagree with Max Mayfield’s authority, Stevie?”\n\n\n\n\n\n“Yeah, no, fair point,” Steve lies back down on his bed, staring over at Eddie from where the other boy still sits upright, one of his eyebrows raised up to his bangs. \n\n\n\n\n\nThey stay like that for a minute or two, maybe even a second longer—before Eddie finally breaks their stasis, shifting until he’s lying beside Steve in the hospital bed, clunky boots hovering just a little above the cool white sheets. \n\n\n\n\n\nWith another little pause for awkwardness to subside, Steve eventually throws caution entirely to the wind—and wriggles down a bit until his head is level with Eddie’s chest, and cushions it there. He can feel the way Eddie withholds his breath for a moment, as if he’s scared that exhaling too heavily will hurt Steve, or scare him away. Ringed fingers creep up his bandaged side in feather-light touches until it flays out across his back like a happy starfish. He feels the light traces of Eddie’s fingertips drawing patterns into the skin of his back, touching the flesh exposed by the gaps in his hospital gown. \n\n\n\n\n\nIt’s tender. It sets Steve alight, again, but not with pain—a sense of need, or the warmth of such a gentle touch from someone so rough around the edges. Eddie smells of cigarette smoke, and vending machine chocolate. \n\n\n\n\n\n“Do you think he’ll, like, come around?” Comes a tentative whisper, Steve gently shifting so their legs can tangle together over the bedsheets. There’s not really enough space for the two of them to lie comfortably, separately—so he makes sure every bit of him has contact with Eddie someplace, somehow. \n\n\n\n\n\n“Mmh? D’you mean Dustin?” Eddie drags his nails up the space between Steve’s shoulder blades, chuckling when it makes him shudder pleasantly. “He’s gonna stay mad for ages. But he’ll come and see you soon. I’ve been tryna wrangle him here, but you know what he’s like. Stubborn as a Minotaur, that kid,”\n\n\n\n\n\n“Yeah,” Steve isn’t really sure what a Minotaur is, but Eddie’s arm is curled around his waist and he’s wound their legs together properly, not in the loose, cowardly way Steve had initiated before. So he doesn’t really mind. \n\n\n\n\n\nFingers finding a lock of Eddie’s hair, Steve absentmindedly twirls it around his index finger, taking more of it to play with when he finds doing so appeals to him. “He loves you, that kid does. You’re like his… deity \n\nslash\n\n dad. You practically broke his heart in that stupid truck earlier,” Falling silent when Steve tugs at one of his messy curls with a tiny bit more force than he had the others, Eddie shuffles a little, readjusting himself. “Uh, y’know—you remember what you were saying, right?”\n\n\n\n\n\nSearching for anything he could recall from the car ride, Steve gives a noncommittal shrug. Eddie presses on. “You got real scary in the end, Stevie. Started talking about how you had to get Dustin home to Mrs Henderson, then you flailed around real crazy like saying you’d lost \n\nyour\n\n kid,” \n\n\n\n\n\nSteve cringes, burying his face in Eddie’s chest. He feels the echo of another chuckle between Eddie’s ribs. “You know what it’s like. With his dad,” Going very, very still when Eddie’s hand settles in the hair at the nape of his neck, Steve tries his best to keep breathing when Eddie begins to lightly fiddle with the softer locks of hair there, the gentler wisps untouched by his various products. “You pretty much gave him everything he’s ever wanted, and then took it away again,” \n\n\n\n\n\n“You’re Steve Harrington the Hero, to those kids. But you can’t keep doing shit like that man. Today, it’s like…” Eddie rests his face on the top of Steve’s head, breathing him in. “It really showed everyone that you’re our glue, dude. You hold the party together, you’re like… our moron leader with a thick head of cement and a serious death wish.” When Steve tries to speak up to protest, Eddie scoffs, and presses his head back down into his chest. Steve doesn’t complain. \n\n\n\n\n\n“Everyone fell apart when the doctors were tryna revive your shit, Stevie. There was a second where they weren’t sure they could. And we all stood there in, like… \n\nhysterics\n\n, hating ourselves for not doing this that or some fucking other.” Eddie drags his fingers through Steve’s hair from the roots to the top of his head, sending ripples of warmth to trickle up his spine. “We almost lost you. \n\nAgain\n\n.”\n\n\n\n\n\nEddie presses his cheek against the top of Steve’s mop of finger-tousled hair, and closes his eyes. “I can’t lose you. We—we can’t. The Party needs you.” Though he doesn’t say it, Steve can hear the \n\nI need you.\n\n\n\n\n\n\nHe shifts, again, moving until he’s lying on Eddie almost entirely, lifting his chin up until they’re practically nose-to-nose, eyes tracing every line of the boy’s face. Steve studies him, admiring every twitch, every jitter, the gleam of his dark eyes and the length of his eyelashes. Marks every breath he takes. Watches those eyelashes bat bashfully, watches Eddie mark him with that look again. The reluctant fondness. \n\n\n\n\n\n“You can’t look at me like that, Stevie.”\n\n\n\n\n\nAn exhale. “Why not?”\n\n\n\n\n\nEddie inhales. “You know why. It’s not fair.”\n\n\n\n\n\n“What,” Steve shifts one of his aching hands until it splays out across the side of Eddie’s neck, fingertips brushing the line of his jaw. “Isn’t fair?”\n\n\n\n\n\nAs he swallows, Steve watches Eddie’s Adam’s apple bob, hesitant, a little uncertain. “This is dangerous territory, Stevie. Friends don’t—do stuff like this. Not with \n\nme\n\n,”\n\n\n\n\n\n“Why not?”\n\n\n\n\n\nEddie looks pained. “You’re lucky you’re hurt, Stevie, otherwise I really wouldn’t spell it out for you.” He swallows, again, and inhales, as if his body is preparing for fight or flight, here, cuddled up in Steve’s hospital bed. “I—I don’t exactly seek the company, of, uh. \n\nMaidens\n\n.”\n\n\n\n\n\nSteve looks blank. “What?”\n\n\n\n\n\n“Jesus Christ. Okay.” Dragging a hand down his face, Eddie flushes, face warm. “I don’t—want to go steady with any old girl, Stevie. In fact—\n\nno\n\n. No girl at all, ever.”\n\n\n\n\n\nAnother blink. “So you’re celibate?—\n\nwait\n\n. Oh. \n\nOh\n\n, no, I get it—\n\nsorry\n\n.” Steve turns an entirely different colour, blood rushing to his face so fast it’s a wonder he doesn’t pass out again. “\n\nShit\n\n, sorry that was a stupid thing to say, the celibate thing, it was just cuz Robin was talking about how some, magazine she saw was talking about how \n\ncelibacy\n\n, is like, the \n\nnew\n\n sex, or some stupid shit, it was just rattling around in my head, y’know, \n\ncement\n\n—“\n\n\n\n\n\nEddie seized his face in both of his hands, the cool metal of his rings pleasant for the heat in Steve’s cheeks. Then he takes a deep breath, and furrows his brow. “You are so fucking stupid. You’re lucky I like you so much.”\n\n\n\n\n\nAnd Steve can’t protest, not at all, because then Eddie pulls him forwards, one hand keeping hold of his chin while the other finds the nape of his neck again, angling himself so when their lips crash together in a clumsy, pleasant conclusion, Steve finds no desire to protest ever again. In fact, he can’t think of much past Eddie, and Eddie’s hands, where they now sit on his back then his neck and journey back and forth between them, careful to shift around the worst of his injuries.\n\n\n\n\n\nSteve, on the other hand, abandons all worries of caution, and practically clambers into Eddie’s lap, straddling him, keening when Eddie presses a kiss into the corner of his mouth, then his chin, then scatters them across his jawline, leaving a trail of light red marks that Steve knows will be proudly bruised the next day, baring his throat to him. \n\n\n\n\n\nHe’s too tired, too high on the opportunity he was given to live again to even consider that this is so new, so strange—Steve Harrington, ladykiller, serial dater and known Casanova is making out with Eddie ‘The Freak’ Munson while he sits in his lap in a hospital bed, of all places, having just asked if he was celibate, not gay, and discovering that Eddie is definitely one of those things, and the other is looking rapidly unlikely in the wake of Eddie’s hands sliding under Steve’s hospital gown. \n\n\n\n\n\nSteve follows his lead until he’s flat on his back, hand searing into the side of Eddie’s face as he fists another in his long, soft hair and drags him down with him, ignoring the dull ache of his wounds for the blazing glory of this, ignoring the protesting creaks of Hawkin Hospital’s low budget bed—\n\n\n\n\n\nBut they can’t really ignore Steve’s hospital room door suddenly swinging open hard enough to collide with the already-scuffed wall beside it, nor can they ignore Dustin, Dustin Henderson—standing there, dumbstruck, holding a slightly wilted bouquet of Get Well Soon flowers. \n\n\n\n\n\nDustin shrieks. Eddie screams. Steve just lies there on his bed like a dead starfish. \n\n\n\n\n\nThen, suddenly, he’s alone in his hospital room again. Eddie vaulted off the bed and left him high and dry, likely to find somewhere private enough to adjust those skinny jeans that really did him no favors in times like this. (In other times? Steve thinks those jeans do him lots of favors.)\n\n\n\n\n\nDustin fled, though for just the stretch of the corridor, because by the time Steve has dragged under his bedsheets again, he’s returned, still gobsmacked, mouth hanging open in the doorway. \n\n\n\n\n\n“Dustin—“\n\n\n\n\n\n“Steve. Steve!” And then he’s clambering onto Steve’s bed, whacking him with the bouquet of flowers that no doubt Mrs Henderson insisted he take with him. \n\n\n\n\n\n“Ow, Dustin,” Steve groans, before seizing the attacking flowers, wiggling them out of the boy’s grip. \n\n\n\n\n\n“You’re a jackass! Is this why you wouldn’t date Robin even though she’s perfect?” Steve grimaces, not entirely sure what he’s being asked there. “You’re such an asshole! Why did you waste my time while I tried to set you up with Robin when if you told me about Eddie I could’ve had you guys married by now!”\n\n\n\n\n\nFlushing, Steve drags a hand down his face, then pops it on Dustin’s shoulder. “It’s—a new thing. Let’s not.”\n\n\n\n\n\n“What are you talking about? You’ve got to go after him Steve!!! Don’t let him slip away!!” Though he definitely missed Dustin’s enthusiasm, Steve’s gunshot wounds were already greatly displeased by his decision to tussle with Eddie just then, now complaining about Dustin shaking him back and forth.\n\n\n\n\n\n“Dustin—Dustin no. I really don’t. He’s gonna come back, he just…” Steve swallows. “Needs a second. Besides, I told him you and me need to talk.”\n\n\n\n\n\nThe kid falls quiet then, staring at him with those big eyes, owlishly. Steve swallows his guilt. “Uh. So—I just. I wanted to say—“ He’s cut off when Dustin suddenly throws his arms around him, arms looped around his neck as he topples them both over, squeezing the air out of Steve.\n\n\n\n\n\n“Please don’t do that again,” He whispers, mumbling into Steve’s ear, and completely obliterates the mature conversation set up he had in mind as he feels his stomach drop.\n\n\n\n\n\n“I won’t apologize for doing it,” Steve ruffles Dustin’s hair, faintly fond as he smells the hair products he uses in the kid’s mop, too. “But I am sorry for screwing you up like that, kid. It’s not fair on you. What kinda heroes are me and Eddie if we keep putting you in total hysterics, right?”\n\n\n\n\n\nDustin screws up his face. “You’re my heroes—the Party’s heroes. But you’re also a huge dickhead. Being a hero doesn’t mean you have to keep dying,” He takes a deep breath. “Sometimes the most heroic thing to do is stay alive,”\n\n\n\n\n\nSteve sits back, a little stunned. “Jeez, how long you been stewing over that one?”\n\n\n\n\n\n“Since I got home,”\n\n\n\n\n\n“Yeah, I can tell.”\n\n\n\n\n\nSilence blankets the two of them, save for the steady beeping of whatever machine Steve is still hooked to—and he gives Dustin a squeeze, again. A reminder he’s still there. \n\n\n\n\n\n“I don’t care that you’re gay, Steve,” Dustin suddenly says, valiantly. \n\n\n\n\n\nBlinking, Steve flicks the back of Dustin’s head. “I’m not gay. I like girls,” Sensing the protest about to spit out of Dustin like venom, Steve instinctively shushes him. “I like girls, and I also like Eddie. I also got shot to death, like, a few hours ago, cut me some slack on the self discovery journey here, Dustin.”\n\n\n\n\n\n“You’re like David Bowie,” \n\n\n\n\n\nSteve just pats his head. “Sure, whatever that means.” He finds that better than questioning him—because eventually Dustin gets comfortable, even if Steve isn’t entirely in a wound-friendly position as he holds him, the younger boy knocking out. Sleeping soundly in a gaggle of limbs on his bed. \n\n\n\n\n\nBy the time Eddie returns, Steve’s eyes are almost too heavy to stay open—but he lifts his hand off of Dustin’s back to beckon him back over, shuffling the two of them a little to the right to offer the pretense of space. They both know that there isn’t any—but Eddie squeezes in anyway, spooning Steve while Dustin continues to toss and turn in the disastrous way he always has done. \n\n\n\n\n\nWhen they wake up, it’s in a tangle of limbs and Steve grumbling about pain, the bemused doctor who came to give him his morning meds just fixing him a look that says all. Dustin scarps down most of his hospital breakfast, Eddie scavenging the leftover bits Dustin doesn’t like, the mushrooms, the beans—while Steve just stares at them both. \n\n\n\n\n\nHe sips his orange juice, trying his best to be pissed off, but as Eddie starts to wrestle Dustin for the last piece of toast on the plate, all he can really muster is irrevocably fond.\n"
}