{
    "id": "40146012",
    "url": "https://archiveofourown.org/works/40146012?view_full_work=true",
    "author": [
        "badpancake"
    ],
    "title": "The One in Which a Time Loop is Fucking Exhausting.",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "Graphic Depictions Of Violence"
    ],
    "categories": [
        "F/F",
        "F/M",
        "M/M",
        "Gen"
    ],
    "fandoms": [
        "Stranger Things (TV 2016)"
    ],
    "relationships": [
        "Steve Harrington/Eddie Munson",
        "Robin Buckley & Steve Harrington",
        "Steve Harrington & The Party",
        "Will Byers & Steve Harrington",
        "Steve Harrington & Jim \"Chief\" Hopper",
        "Eleven | Jane Hopper & Steve Harrington"
    ],
    "characters": [
        "Steve Harrington",
        "Eddie Munson",
        "Robin Buckley",
        "Nancy Wheeler",
        "Dustin Henderson",
        "Jonathan Byers",
        "Will Byers",
        "Maxine \"Max\" Mayfield",
        "Lucas Sinclair",
        "Eleven | Jane Hopper",
        "Jim \"Chief\" Hopper",
        "Joyce Byers"
    ],
    "additional_tags": [
        "Time Loop",
        "Time Travel",
        "Time Travel Fix-It",
        "Steve Harrington Needs a Hug",
        "Steve Harrington-centric",
        "Hurt Steve Harrington",
        "Steve Harrington Has Bad Parents",
        "Bisexual Steve Harrington",
        "Gay Eddie Munson",
        "Angst with a Happy Ending",
        "Angst",
        "Hurt/Comfort",
        "It Gets Worse Before It Gets Better",
        "im so sorry",
        "steve deserves a little sexuality crisis",
        "as a treat",
        "Eventual Happy Ending",
        "steve is sick of this shit",
        "Steve Harrington Has a Crush on Eddie Munson",
        "Eddie Munson Has a Crush on Steve Harrington",
        "it takes a time loop for these fuckers to get together",
        "Steve Harrington Is a Mess",
        "Suicide Attempt",
        "Whump",
        "Canon-Typical Violence",
        "Alternate Universe - Groundhog Day (1993) Fusion",
        "Dyslexic Steve Harrington",
        "Eddie Munson Has ADHD",
        "Steve Harrington is a Sweetheart",
        "Slow Burn",
        "Kinda",
        "BAMF Steve Harrington",
        "Suicidal Thoughts",
        "Steve Harrington Whump",
        "can be read standalone!!",
        "Touch-Starved Steve Harrington",
        "Alternate Universe - Canon Divergence",
        "Protective Steve Harrington",
        "Alternate Universe - Everyone Lives/Nobody Dies",
        "in the end.... eventually",
        "Families of Choice",
        "Vecna Possessing Steve Harrington",
        "Steve Harrington Has Powers",
        "kinda??",
        "i guess we can call it that"
    ],
    "language": "English",
    "series": "Part 1 of Steve Harrington's Unwilling Time Loop Saga",
    "published": "2022-07-07",
    "completed": "2022-07-17",
    "words": "41,496",
    "chapters": "12/12",
    "comments": "3,355",
    "kudos": "19,853",
    "bookmarks": "5,579",
    "hits": "234,241",
    "summary": "<p>It’s the first time in a while that he doesn’t know what comes next. He’s dove into the water hundreds of times. Screamed as his flesh was torn apart, heard Master of Puppets in the distance and held back tears. Felt Max’s cold, small hand in his as she laid in the hospital bed. There are things that <em>always</em> happen, no matter how hard he tries: El doesn’t arrive in time. Eddie dies. Max is put in a coma. </p>\n<p>Steve fails. They lose.</p>\n<p>“Steve, how many loops have you been through?”</p>\n<p>His head is nodding, and his eyes are watery, and Eddie has approached him like a spooked animal.</p>\n<p>“I lost count.”</p>\n<p>AKA: The one where Steve Harrington is stuck in a time loop, and Eddie Munson is really fucking hard to save, or: fuck Volume 2, these bitches are in love.</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>i swear it's not all angst, and, no, we will NOT talk about projecting songs i like onto these characters</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>steve can have a little less than three weeks of happiness, as a treat.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>and, as a little treat to you readers, here are all the chapter titles (in order):</p>\n<p>DÉJÀ VU<br>NEVER ENOUGH<br>THE LONGEST LOOP PT. I<br>PHANTOM AGE<br>FRACTURE LINES<br>EXPLORATION<br>THE FUNERAL<br>LOSS AND LOVE<br>DIFFERENT<br>THE VEST<br>THE LONGEST LOOP PT. II<br>EPILOGUE</p>\n<p>have fun with your speculations to what each chapter holds ;)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p>yeah, steve might not be booksmart, but i love the idea that he can just... read people really well</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">notes</a>.)\n</p>\n<p>pov: i write eddie into my steve and eddie fic??</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">notes</a>.)\n</p>\n<p>and just when he was getting somewhere...</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_8_endnotes\">notes</a>.)\n</p>\n<p>was originally gonna have steve say \"is that a gun in your pants or are you just happy to see me?\" to jason but thought better of it lol</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_9_endnotes\">notes</a>.)\n</p>\n<p>chapter was almost delayed due to staying up until 4am drawing the most cursed interpretations of stranger things characters with my mate lol</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_10_endnotes\">notes</a>.)\n</p>\n<p>fun fact: this was the first chapter that i wrote for this fic!!</p>\n<p>and, they finally kissed ;)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_11_endnotes\">notes</a>.)\n</p>\n<p>one of steve's scrapped taunts was: “you know, we all have fucking daddy issues, henry. and let me tell you, this isn’t the best way to deal with them!”</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_12_endnotes\">notes</a>.)\n</p>\n<p>some fun facts about this fic! </p>\n<p>- steve goes through around a little more than two years worth of loops (or around 236 loops, taking in account The Longest Loop), and the reason why his scars and injuries are appearing now, is because the loop is dying, and steve gets to live normally :)</p>\n<p>- my favourite moments of the fic were the “I want to graduate” speech in “THE FUNERAL”, el asking steve what the flatlining sound means in “THE LONGEST LOOP PT. I”, and hopper validating steve’s trauma in “EPILOGUE”</p>\n<p>- i use the phrase “owl-blind in early sun” which is from one of my favourite poems about a child learning the horrors of death and life after trying to shoot an owl</p>\n<p>- there are a few references to loops that i didn’t write, but steve still experienced, with one of the most brutal being two different loops where the gate is closed on steve’s body as he’s climbing out of it, the same happening to eddie a different time</p>\n<p>- eddie has no dialogue lines in three chapters (“THE LONGEST LOOP PT.I”, “LOSS AND LOVE”, and “DIFFERENT”)</p>\n<p>- i wrote a lot of the things in the chapters in the wrong order, and mix and matched them until i liked the way they flowed </p>\n<p>- the dot point summary for the epilogue was 2,258 words, making it longer than some chapters</p>\n<p>- nearly all of the chapters were written one day before (or finished on!) the day they were posted. for “EPILOGUE” i read through the comments again, and included some of the things people wanted to see :DD</p>\n<p>- i thought of all the chapter names before some things that actually ended up being in the chapters themselves (for example: “THE FUNERAL” originally was ONLY the three different times steve experienced eddie’s funeral. i added the breaks in between them to add more of, well, eddie himself, because it felt important. which then spirally into the “i want to graduate” speech!)</p>\n<p>- the longest chapter was 10,140 words, being “EPILOGUE”, and the shortest was “THE FUNERAL” with 2,162 words</p>\n<p>- the most used words and phrases were:<br>- steve (820)<br>- eddie (385)<br>- time (165)<br>- robin (163)<br>- die/dies/died/dying/death/deaths/dead (137)<br>- hand/hands (131)<br>- upside down (46)<br>- pool/water (45)</p>\n<p>i hope you enjoyed this wild, wild ride! many tears were shed from my end (and from what i’ve read in the comments, from your guys’ end too). i might end up doing a companion fic that explores other character’s povs, but you’ve all been such amazing readers, so i wanted to say THANK YOU! </p>\n<p>i’d love to hear what your favourite parts or chapters were, and if there was something you wanted to see me write in the future!</p>\n<p>edit to add: i'm planning on writing a couple companion fics to this one later in the year!! (some to do with the aftermath of this story itself, for some well needed rest, and the other to do with the loops that steve 'left behind', for more angst ;))</p>\n<p>edit edit: this story can be read as a standalone, but if you want more angst (AKA: exploring people remembering steve's deaths and his parents!), onto the next work you go!</p>",
    "text": "At the end of it all, when the world is cracked open, with a red glow spilling out onto the streets, Steve wants to cry. He’s reassured Dustin that, yes, this was the end. That, yes, they defeated Vecna. But his mind keeps supplying him with the empty space where his body should be, how hard it was to kill even a Demogorgon the first time.\n \nSome things are good. Hopper is alive, which Steve is so fucking happy about because El deserves to have her dad back. The Byers-Hopper family have meshed in such a way that it’s impossible to tell them apart. As he helps them move boxes back into their old house and Hop’s cabin, he feels the reassurance of warm hands on his shoulders, and Steve pretends that it’s not the first time someone’s hugged him in years.\n \nDustin was…distant. Steve knew two days wasn’t enough to accept it, the death. He doesn’t know how he’s meant to help. There’s not exactly a pamphlet detailing how to help your friend/child deal with the death of their friend, who they maybe might have saw getting torn to bits.\n \n(Steve tries not to think about Metallica or Master of Puppets, or the bat bites on his abdomen. He doesn’t deserve to feel this sorrow because he didn’t even know him, pull yourself together, Harrington).\n \nRobin stays over at Vickie’s house. And he’s happy for her, honest, but if his empty halls feel that much more daunting as he wakes up in the morning, he tries not to think about it too much.\n \nIt’s the end of the second day after the battle. He volunteered, he watched Nancy go with Jonathan, he watched Dustin cry. Steve tries not to think about Max in the hospital bed, Lucas by her side, but he fails. Sometimes, in the mornings, he thinks that it’s his fault. If he hadn’t fallen onto the vine, if he hadn’t told Eddie to be the distraction, if he hadn’t done this and that.\n \nIt’s worthless to think about, anyway. People like him didn’t get do-overs (he knows it in the way he and Nancy faded to not talking, or how he’s sitting alone, now, at the edge of the pool).\n \nThe water stares up at him, inviting and cold, whispering. He slips in, feels his jeans stick to his skin, as he sinks to sit on the bottom of the pool. Steve looks up, feels the water rush up his nose, and watches the stars twinkling and messy overhead.\n \nHe breathes. \n \nIt hurts, at first, scratches down his throat, smooth and thin, cold. It feels sharp in a way that he never thought water could feel, until it turns thick and dark, something else being breathed in with the water. Steve tries to open his eyes, because what the fuck just went into my lungs but his vision is hazy at the edges, and he sinks.\n \n— — — \n \nHis hands are by his feet, laces to his sneakers untied, and when the fuck did he get this headache? Steve looks up, sees Robin and Nance and Eddie looking down into the water of Lover’s Lake. He unties his shoes, shucks off his shirt, says some spiel about being swim captain that feels odd on his tongue.\n \nAs a tentacle wraps around his leg and pulls him through the gate, bat-like creatures with tails dragging him across the way, he can’t help thinking that he has the worst case of déjà vu.\n \n— — —\n \nAs he sits by the pool again, slips in with his jeans on, does Steve feel like something was meant to change. If he started having prophetic dreams about the biggest battle they had ever faced, what was it worth if he couldn’t change anything? Maybe he can try again.\n \nMax is in a coma. El was too late. Eddie is dead.\n \nSteve breathes deep, and closes his eyes.\n \n— — —\n \nHe realises that it always starts in the same place. One shoe untied, looking for the gate at the bottom of Lover’s Lake.  It’s the third time he’s been here, and he feels like, maybe, he can change something this time. Save someone.\n \nSteve dives into the water, goes just deep enough that he sees the pulsating red, doesn’t drop his flashlight and swims back up. He freaks them out when he breaks through the water and, hey, if that makes him smile a bit, no one has to know. Yes, there is a gate down there, now please shuffle aside so I can get the fuck up this boat, he wants to say. \n \nAs a tentacle grabs him down and his mind feels like mush inside his head, he feels like this is a bit much for karmic justice.\n \n— — —\n \nNothing changes. And, yeah, maybe Steve was a little foolish for thinking that he could just fix everything with a swoop of his hand, and going up a little early, but he had to try, right? He tries not to think about Dustin crying, or the days he has to spend waiting and waiting.\n \nThe loop always ends two days after the battle, as he slips into the pool. \n \n— — — \n \nSteve can feel the stumble before it happens. They’re hiding underneath Skull Rock and he gets up too fast, way too fucking fast, and the world is spinning and his shoulder is digging uncomfortably into the rock.\n \nThere’s the hurried, hushed whispers of his name under the blue, sometimes red, sky, as he slides down on his back. He can feel something oozing out of his stomach, and he doesn’t want to look, but he has to know, has to see it for himself.\n \n“Okay,” he breathes, because at least he is alive, he had help to deal with these wounds and this fight. He decidedly doesn’t look at Eddie as he realises how deep the teeth sunk, tries not to think of Master of Puppets and self sacrificing metalheads.\n \nWhen they’re walking through the woods, Steve decides that he can bend the rules. Eddie is complimenting him (and he knows now that’s what it was, a proper, not sarcastic, compliment), and Steve uses his future knowledge to sail the conversation smoothly.\n \n“That was a real Ozzy move you pulled back there,” Eddie says, and Steve preens under the praise. He knows this one, he knows what to do, how to make sure the conversation doesn’t end in stilted silence.\n \n“Ozzy Osbourne?” Steve asks, but he knows the answer already.\n \n“You know Black Sabbath? You know Black Sabbath?” There’s an incredulous look, sparkling behind his eyes as he says it.\n \n“Yeah, of course, man. Bit a bat’s head off onstage, right? Where d’you think I got the idea?”\n \nThere’s a barely contained glee in the way that Eddie walks besides him, knocking his shoulder every few seconds. Pre-loop-Steve pushed him away, he remembers, hurting and wanting, but Steve decides that he’s allowed to indulge, allowed to break the mould.\n \nThe conversation lands back to Henderson, it always does, how Eddie was on the receiving end of the hero-worship placed on him by the kid. When he leans forwards to the side of his face, Steve just catches his eye.\n \n“You know he won’t shut up about you either, right?”\n \n“What?” Eddie pauses, steps back.\n \n“Dustin. Every time we’re hanging out, he somehow manages to talk about Eddie Munson, best DM in history, or Eddie Munson, theatrics extraordinaire.” \n \nSteve glances to Eddie with a smile on his face, thinks back to the words that he says every loop, that Steve never returns even though he knows them to be true. \n \n“I was jealous too. It’s not everyday your almost-child is swept away by someone else.”\n \nEddie has pulled a piece of hair to cover his mouth, his other arms crossed around his chest. There’s a faint smile on his face and a hint of something else in his eyes, before his shoulder is bumping Steve’s again. He could get used to this, Steve thinks. \n \n“Well, we could co-parent, you know? I’ve heard a little about your reputation as the kids’ mum, so I guess I’ll take the mantle as their dad.” He smiles as he says it, joking in a way that Steve craves.\n \n“Oh yeah? Well you better be paying child support, cause those fuckers are running me dry.”\n \n“Pay you child support? Did you forget which one of us lives in a trailer?”\n \nThere’s an ease to the unknown, to talking with Eddie. Steve hopes that he never gets tired of this one conversation, no matter how many loops it takes.\n \nThe ‘earthquake’ hits earlier this time (or maybe it just feels like it does because Eddie hasn’t gotten to the part where he starts talking about Nance and him). And when Steve is the first one to crumble to the ground, blood seeping through the bandage, Eddie keeps him stable.\n \nSteve tries to remember everything, this loop. He knows the conversations he was a part of, he knew the vague events. But he had to know everything: what went wrong? Why didn’t they win? Eddie’s hand on his shoulder guiding him up makes Steve want to hurl because he knows, he knows, that Eddie is going to die, this time.\n \n— — — \n \nSteve could almost laugh at the idiocy of it all. After crawling their way through the gate and the Upside Down (no changes, it seemed that small conversations didn’t do anything), he gets to watch Eddie Munson (for the third time) pull on a Mike Myers mask and hotwire a house/van.\n \n“Harrington’s got her, don’t ya big boy?”\n \nThere’s something so calm and warm and alive in his smile as Eddie turns to look back at him, a pooling of something appearing in his chest. His breath is caught, and he zones out for a second as that smile is turned on him, and for a moment, Steve idly wonders if looping time has affected his health. \n \nOr maybe it’s just the bat bites. Again.\n \nWhen he vaults into the driver’s seat, steering in such a careless way because he knows that no one will be on the road, Steve listens to the conversations between everyone. He doesn’t strike up the talk with Nancy about his future (doesn’t think that he’ll be allowed to make it there), and he watches as Lucas and Max have their moment. Eddie has been demoted to please for the love of god stay in the back AWAY from the windows, so Steve doesn’t get a chance to talk to him.\n \nIt hurts a little more than he would’ve thought, to know that pre-loop-Steve didn’t get to know him. \n \nNancy still meets Jason in the gun shop. Eddie stays in the van. Robin sees Vickie kissing her soon-to-be-ex-boyfriend, and Steve places a hand on her shoulder, holds her tight, tells her the same thing that he always did.\n \nWhen they’re back on the road, making their way to a secluded nowhere that Eddie directed him to, Robin catches Steve’s eye in the rearview mirror so he winks at her. Overly exaggerated and not subtle at all, she cracks a half exasperated smile as she turns her head away. If nothing else, Steve’s calling that one a win.\n \n— — — \n \nAfter the battle is done, after Eddie is dead and El didn’t arrive on time and Max is in hospital, Steve finds himself at the back of the Harrington Household. Because this was not a fucked up sense of déjà vu, no, he was going through the battle again and again and—\n \nHe couldn’t save them. (He had to save them, he had to try and save them, they deserved that at least). What was he supposed to do? He wasn’t— he was the worst person to get this power, this chance, to fix things. Steve wasn’t stubborn and smart like Nancy, or powerful like El. He hadn’t been through this horror forever like Will, or equally new to it like Robin and Eddie.\n \nHe was just Steve Harrington: a shitty boyfriend who peaked in high school with a mediocre career as a babysitter.\n \nThis loop feels wasted. He knows that it’s not, there’s no such thing, and if there was, who was policing those ideas? As far as he knew, he was the only person to be stuck in a time loop, like, ever.  He burns conversations and faults into his brain, wills it to remember.\n \nJason and his gang attack at the Creel house. That’s the reason Max doesn’t have her music. El gets ambushed by the government (and, god, can someone give this girl a break?), and the boys are a little late in getting to her. Hopper and Joyce and Murray had things sorted, he thought, and he wasn’t going to strain himself thinking how he would even contact Russia in the first place. Eddie buys them time, but it’s not enough.\n \nOkay. He can do this. Buy more time, figure out how to contact El, make sure Lucas is alert and armed, and plead that Eddie decides not to be a hero.\n \nThe cool blue of his pool tauntingly stares up at him, wind sloshing the water over his toes, as he sits by the edge. The sound of guitar and screeching bats, of the world splitting open, of bones cracking is enough to send him deeper, and deeper, breathing in.\nSteve tries harder. If he’s faster than the bats, then they can’t get him. If he ducks down for thirty seconds, he doesn’t get grabbed by the tentacle, and can still convince the others that he saw a gate. If he helps Robin and Nancy across the Creel house in the Upside Down, they can make it to the door that hides Vecna before getting choked.\n \nHe’s min-maxed his way through the loops, figuring out what wastes time, when he was to wait, how long he needs to wait. There are certain events that happen at certain times (Jason in the gun store, the cops coming to look for the kids, Max being taken) and others that shift and move with him (getting in and out the Upside Down, Nancy being taken, Eddie dying). \n \nThis loop, sixty-four, he dives in the water, waits thirty seconds, comes back up, makes mention of the gate. They all dive down with him, Steve leading, Eddie taking the back, as they break through the pulsating redness that awaits them. \n \nThe only problem with having to wait the thirty seconds, is that the bats are always waiting for them. From all the loops that he’s been through, he hasn’t figured out how not be dragged by the neck, back scraping against the floor of Lover’s Lake in the Upside Down. Steve’s accepted that this is an event that shifts with him.\n \nNancy and Robin hold down a bat and beat it to death. Eddie stakes one through the heart with a broken oar. And Steve does what he always does, what sparks the conversation, and bites the bat.\n \nSee, Steve loves Robin. Truly, he does! She’s been his best friend since working at Scoops, and he wouldn’t trade her for the world. But he’s found that she’s one of the biggest time sinks. As she opens her mouth to ramble about rabies, and Nancy starts to approach him, he rushes them to the gate.\n \nThey follow along, frantic, shell shocked, because this is the first time that they’ve seen these bats, and Steve is bleeding all over the fucking floor. He ignores the slick of blood between his toes, and the taste of it in his mouth, and pushes Robin through the gate. She stumbles and splashes, and Steve hopes that she took a breath before that, because he really does not want to be charged for her murder.\n \nNancy dives in after her without so much of a word, and Steve could kiss her. When all things go to shit, he can count on Nancy Wheeler reading minds. The bats screech. They’re approaching.\n \nSteve reaches for Eddie’s hand behind him. Or, where he thought Eddie’s hand would be. There’s a cold emptiness there, and he wants to cry. He’s never fast enough. No matter how hard he tries.\n \nHe turns, slowly, away from the gate. There are scratches on the ground that he knows belongs to Eddie. Steve closes his eyes, just for a moment, and tries not to hear the voice screaming, fading, towards the treeline. \n \nOkay. Maybe he can’t do this.\n \n— — —\n \nLoop sixty-four: failure, Steve thinks, as he sits by the pool. El didn’t arrive in time, Max was in a coma, and Eddie died early. A real fucking failure, sixty-four. Steve couldn’t even keep Eddie alive for the distraction, and instead that ended in—\n \nHe tries not to think of the unskilled guitar playing, the lack of Robin in the Creel house. Steve slips his head under the water, and doesn’t think of Robin’s wide eyes as she sat, slumped, outside the trailer. He doesn’t think of Dustin’s face, his tears, as they un-barricade the doors. He doesn’t think of the empty coffins that had to be buried. He wishes that he never found annoyance in Robin's rambling, because it's all he wants to hear right now.\n \nHe breathes deep. Time for loop sixty-five.\n \n— — — \n \n“Hey, wait!” Steve says. “What are your favourite songs?”\n \n“What?”\n \n“It’s a valid question! What if Vecna tries to take us, and we don’t know what song to play? We didn’t know Nance’s song, and that could have—” He stops. Nancy always gets released. That’s a constant, something he doesn’t have to worry about. But the kids don’t know that and Nancy doesn’t know that so he needs to shut the fuck up.\n \nSteve finds that Robin likes Boys Don’t Cry, that Eddie likes Master of Puppets. Everybody Wants to Rule the World is Nancy’s, and Dustin’s is (of course) Never Ending Story. Max’s is still Running up that Hill, and it turns out that Lucas has started to key onto her too.\n \nThe loops pass by, and in the moments of waiting, of sitting in the water for thirty seconds, or driving the hot-wired and stolen house/van, he learns the lyrics and the melodies. In his list of songs, a mixtape to save the world, he’s added Should I Stay or Should I Go for Will and Jonathan, and Every Breath You Take for El and Mike.\n \n(“And what’s yours, Stevie?” Eddie asked. “We’ve all had our little kumabaya, so now it’s your turn.”\n \nSteve wants to say that it doesn’t matter. That if he’s going to be taken, to be snapped apart, that it doesn’t matter. Because his deaths don’t stick, so why even bother trying to save him, when he can just try again from the start? \n \nAt first, he gives a bullshit song. But the loops hadn’t made him good at lying, and Robin sees right through him. She doesn’t say it, just raises her eyebrow pointedly, and waits.\n \nHe admits that Gimme! Gimme! Gimme! (A Man After Midnight) is his song. Robin stops for a moment, as if something has clicked in her brain, and Max has one headphone off her ear to nod along to his justification. Something along the lines of who doesn’t like ABBA? and It’s a good song!\n \nAnd Eddie? He’s staring at his hands as if the world has just been ripped apart (not so funny to make that comparison, in hindsight, Steve thinks), but Steve has already steeled himself to learning lyrics and melodies that swirl around his brain, following the fingers on a guitar).\n \n— — — \n \nOnce, when they’re in the woods, they switch partners. Eddie and Robin trail behind, and Steve is with Nancy. They’re talking about the future, and it hits Steve that he might just love her. He knows that she always goes back to Jonathan (a constant, his mind supplies), but he thinks, selfishly, that he’s allowed to admit this to himself, to her. \n \nIt’s not like this loop is even going to stick.\n \n“Nance, I think I still love you.” \n \nThere’s nothing, for a beat. And then another. And another.\n \nThe Upside Down is silent, but not this silent, and he almost wishes that he was back at the pool, that two days would pass so that the loop would finally reset, and he could pretend that he never said that because what the fuck that was awkward.\n \n“Steve.” \n \nHe’s kept walking as if he hasn’t just dropped a dumb amount of emotional turmoil (three years worth, at least. More, if the loops count towards it) onto her. He hums and and doesn’t turn his head because this loop needed to be over.\n \n“Steve, can you just look at me?” It’s not said unkindly. But she’s frustrated and tired, and covered in water and bat blood, and Steve is ignoring her and oh god even if she did like him back, he was being a total dickhole wasn’t he?\n \nSteve turns and she’s standing there, hand on her hip, eyebrows furrowed. He knows what comes next, and he’s never even looped this conversation before.\n \n“I don’t think we would have worked out, anyways,” Steve interrupts, before she can say it again. Before she admits that she never loved him, that they were just bullshit, and nothing more. “Just, you know, if we’re going to die tonight, I want you to know that I love you.”\n \nHe catches Robin’s eye behind him and smiles. Fucking Christ. Really had to put his foot in his mouth there, huh? But Nancy is looking at him different, as if he’s just gifted her a crucial piece of himself in the woods tonight. \n \n“Do you love me like you love Robin?” She asks.\n \nIt’s on loop seventy-two that he realises that he still loves Nancy Wheeler. It’s on loop seventy-two that he realises he isn’t in love with her. The days repeat the same, and nothing changes, and Hawkins is split into pieces, and people are dying, and Steve has realised that he loves Nancy like he loves Robin.\n \n— — — \n \nSteve tries something different, once. He tries to change things from the start, from before he jumps out the boat. His shoes stay tied, and his jumper stays on, and Robin is clutching at the walkie. Nancy is looking at Steve, but he is making sure to look anywhere but her.\n \nFor a moment, he thinks that this is all it will take. That everything would be solved with a little cowardice.\n \nBefore he knows it, he’s been handed Eddie’s vest, slipping it on his shoulders, and the leather jacket is shucked off and thrown to the floor. He dives more gracefully than Steve would have thought. This time, he sits with the girls on the boat, as Nancy is shooting daggers his way, as Robin is holding his hand, as they count.\n \nIt hits thirty seconds and Steve knows that he’s made a mistake. He knows where the gate is, what to look for, how to be fast. Eddie doesn’t even know what he’s getting into, and now thirty seconds has passed and there’s no sign of him.\n \nBut that’s fine! That’s all good. It took pre-loop Steve one minute (maybe more) to find the gate and resurface, it just means that Eddie might get snatched and they might switch places with the bat attack and oh fuck he fucking forgot about the bat attack.\n \nThe sound of his foot tapping against the floor of the boat is probably getting on the nerves of Robin, but as two minutes pass and Eddie doesn’t surface, he makes the decision to dive.\n \nOnce he breaches the gate, slams into the floor of the Upside Down, he isn’t met with Eddie. He’s up on his feet before the bats even get close, and he jumps right back out, and that’s when he see him.\n \nTangled in the underbrush of the ocean, eyes wide and unseeing, floats Eddie. His hands are clasped around his throat, and Steve wants to vomit. He can feel the burning of regret and shame and guilt because why did he have to wait to dive? Steve should have just gone. What would changing the diver achieve? What the fuck did he think he was going to achieve by being a coward? \n \nWhen he resurfaces without Eddie, he gets about three words in before he’s yanked back down by a tentacle.\n \n— — —\n \nThe next loop, he dives straight into the gate. He doesn’t wait the thirty seconds to convince everyone without being grabbed, and he goes straight through. Steve realises that the bats patrol the gates, and when he deviated from the times he had already figured out, he got hurt.\n \nIt’s the shortest loop, is all he can think. It doesn’t hurt more than normal, even though it probably should. He’s used to being dragged, and being eaten, and the feeling of teeth sinking into his skin, but it just lasts so much longer this time.\n \nHis vision fades in and out, and he vaguely registers the feeling of denim underneath his head, the whispering of his name, someone holding his hand. Steve thinks he feels rain on his face, but he’s never seen the weather change in the Upside Down.\n \n— — — \n \nHe dubs it The Shortest Loop. Maybe it’s because he’s started to lose count of the numbers, but he knows that diving straight through leads to imminent death, and that only raises more questions.\n \nSteve makes a list in his mind of Things He Knows For Sure. It starts with the basics, of who always dies or gets hurt, who always lives. After that comes the horrible realisation that accompanies The Shortest Loop: Steve is not invincible. And then that spirals into more questions and more speculation, and he has to right himself again. Things He Knows For Sure. He can do that.\n \nThe loop starts as he unties his first shoe on the boat at Lover’s Lake. It never starts earlier, it never starts later.\n \nSteve is not invincible, and he still feels pain.\n \nEddie always dies. \n \nThe loop ends as he swims in his pool, two days after the battle. \n \nHe pauses. The Shortest Loop proved that he wasn’t invincible, and that the loop didn’t end at the pool. Steve wracks his brain for the answer, and finds it quicker than he would have thought. \n \nThe pool, two days after, where he always loops, is the threshold. He can’t go past that point until he fixes everything. There’s nothing past the events of the pool, because he hasn’t fixed things.\n \nThe loop starts on the boat at Lover’s Lake, so something must happen in the few moments there that are vital to making sure everyone lives.\n \nIf he dies early, the loop resets. \n \n(This one he finds interesting. And if the next loop consists of him dying early to test his theory, he finds solace in the fact that nobody will remember watching him die).\n \n— — — \n \nSomewhere between the death and the…death, Steve realises that he might not be so straight. As he’s walking through the Upside Down, he notices the similarities between the women he’s had a crush on (headstrong, stubborn, sarcastic, could beat him the fuck up) and applies them to guys that he’s been maybe a bit confused about.\n \nThe first loop he dedicates to these thoughts, is filled with imagery of the boys high school locker rooms and the lack of privacy. He can’t pinpoint anyone there, though, until he gets out of the Upside Down, falling through the gate in Eddie’s trailer, and he looks at Max.\n \nThe second loop, he’s so lost in his thoughts of Billy Hargrove and the maybe-crush that he had on him before (and maybe, embarrassingly, even after) he smashed a plate over his head, that he almost misses the way that Eddie leans into his personal space and talks at him.\n \nSteve thinks he did an alright job at pretending he wasn’t just daydreaming about a guy that quite literally gave him an A-grade concussion (and wow, he is going to shake off the reminder of being called pretty boy because— nope. Not now. Not uncovering that).\n \n“You alright up there, Stevie? Shouldn’t be thinking so hard, might strain something.” Eddie says with that dumb fucking smirk and Steve is—\n \nOh.\n \n\nOh.\n\n \n\nOh no.\n\n \nSteve begrudgingly adds curly hair to the list, and then promptly realises that he’s had a crush on every person he’s walking through the Upside Down with.\n \n— — — \n \nEddie is smiling at him again, from the driver’s seat, calling him a stupid pet name that he loves, and Steve realises that he (maybe) wants to kiss him. Somewhere between the loops he speedruns a sexuality crisis, figures out that he might have a little tiny crush on Eddie Munson.\n \nBut Eddie doesn’t know what Steve’s favourite song is, or that he’s jealous of him, too, or that he wants to co-parent Dustin with him, that he dies. He doesn’t know that Steve knows Master of Puppets from memory, or that he’s memorised the patches on his vest.\n \nIf he shifts a tiny bit closer than usual, stays back as the rest of the gang go into the gun shop (“And what if we need a quick getaway? You really want Eddie to drive?”), and talks to Eddie for as long as he can, well. \n \nNobody’s gonna remember that but Steve.\nSteve is astronomically tired. Fuck the Upside Down. Fuck the bat-adjacent bitches. Fuck Vecna. And fuck Eddie Munson for being so hard to save. \n \nIt’s two days after the battle, and he is bone-tired in a way that makes him not want to get up from his bed. Not even to gaze at the pool like he always does, slip under as the loop resets. There’s an angry red ring around his neck, and his wounds are still healing, and fuck the water. If he ever has to swim again it’ll be too soon.\n \n(Yeah, too fucking soon as in, the next loop).\n \nAnd, yeah, maybe this frustration is brought on by going to Eddie’s funeral. A coffin that light, with barley anyone to see him off — it just pissed him off even more. So, instead of going to the pool tonight, he decides to sleep. Maybe it’ll result in being well rested next loop. Steve can only hope.\n \n— — — \n \nWhen he wakes up, it’s…slow. Still. There’s a warmth to the air that he’s never felt before, and why the fuck isn’t he on the boat?\n \nIt’s such a startling realisation, that he’s crossed the imaginary threshold of the end of the loop and then comes the dread. Is this loop sticking? Is that what’s happening? But Max is still in a coma and El couldn’t find her, and he attended Eddie’s funeral yesterday.\n \nHe, quite literally, tumbles out of bed and calls Robin. Then, he slams the phone down because he fucking forgot that she stayed at Vickie’s yesterday. Steve’s sitting on the kitchen counter, sweaty and shirtless, when he realises that he should call the kids.\n \nCheck in on El and Max and Lucas and Will and Mike and Dustin, oh god, Dustin.\n \nHe’s so off-footed by everything, like slipping on ice in socks because, what the fuck does he do now? Steve forces himself back up the stairs to the bathroom and sits under the spray of water, indulges, because, well, who has more time in the world than him?\n \nHalfway through towel-drying his hair does it click. There was never a threshold. He moves things around, gets rid of things from his list of Things He Knows For Sure, and adds in the idea that it’s not just his early death that resets the loop: it’s any of his deaths.\n \nSteve remembers slipping into the pool, feeling the water fill his lungs and the shortness of breath, but he had done it so many times, it had become second nature. Drop Robin off at Vickie’s, call Dustin to wish him goodnight. Leave the lights on in the house. \n \nDrown.\n \nDrown.\n \nDrown.\n \nOh fuck. Steve’s always been the one resetting the loop. He could have stayed in the aftermath of the battle and planed, recuperated and slept. Steve could have waited and had time to mourn and to maybe, possibly, try and tell someone what the fuck is going on. He could have waited. He could have cried. \n \nThe pool is calling to him now, he realises. Because fuck, if he hasn’t messed this up big time. Who was in charge of handing out the superpowers that nobody wanted? Because he sure as hell had some complaints about his. One foot after the other, his body is already making it towards the pool before his doorbell rings.\n \nThe door opens and there stand Hopper, and fuck, what happens in the loops he leaves? Is there a version of Hopper that wakes up every morning that Steve is transported back, who has to find his body? What about those loops where he tried to die to test a theory? Did he just leave a version of Robin and Nancy and Eddie with his cold body as they traversed through the Upside Down?\n \nThe pool suddenly feels much less convenient. \n \n“Hey kid,” Hopper says, and he looks as tired as Steve feels. \n \nHop’s eyes trail the nasty redness of his throat, before they land on his abdomen, and Steve vaguely remembers that he’s not wearing a shirt. There’s a waver to his eyes, a frown appearing deep set in his brows and, actually you know what? The pool is looking mighty attractive right now.\n \n“I wanted to thank you for keeping everyone safe here,” and god is that a lie, “And, I also wanted to check up on you. How is,” Hopper waves a hand in the general direction of Steve and, well, isn’t that a loaded question.\n \n“It’s not every day that you get eaten alive, but I think I’d still rank it underneath getting drugged, weirdly enough.” Okay, so yeah it might not be every day, but it definitely is like, every second day that he gets eaten alive.\n \nHopper is wearing an incredulous expression and, yep, wow, no one really explained their full stories from Star Court, did they? The chief (can he still call him that?) is already pushing his way inside, and Steve lets him in without issue. It’s not like he has plans. Didn’t really think he’d get this far.\n \n“Where are your parents?”\n \n“Uh, away on a business trip, I think. Don’t know if they’ve even seen what’s happened yet.”\n \nSteve leads his way to the kitchen with a small shoes off please as he prepares Hop a cup of tea. He can already tell that this is going to be a long conversation. He can feel the silence approaching before it fully dawns on them, and he watches as Hopper looks around the massive, empty house. \n \nThe kettle is loud as it whistles, and Steve is quick to pour the hot water into the mug. Hopper has meandered his way over to his kitchen island, leaning forward on his arms, and he gives Steve a small smile as he puts the mug in front of him.\n \nSteve knows that Hopper saw it. It’s…kind of hard to miss. But here Hopper is, sitting, pretending that there isn’t splintered wood chips littering the carpet at the end of the hall, where a grandfather clock once stood. There are things that happen in every loop, and Steve is more than happy to let some anger out on the antique clock that his dad liked. \n \n“Come to dinner with us. I’m sure Joyce would love to see you.” Hopper says. \n \nSteve almost wants to ask what the point even is. Because he knows that he’s going to have to reset the loop, eventually. Slip into the pool again. Try harder and faster and save everyone.\n \n(He thinks that he deserves the rest. He’s tired and he’s frustrated, and all he wants is for everyone to be okay. Maybe he can wait. If there’s anyone in the world that has the time to, it’s him).\n \n“I’ll swing by tonight,” Steve says. “How’re Will and El holding up?”\n \nHopper seems to sigh in relief, the conversation flowing into familiar territory. “El’s back to slamming doors with her mind, but I think the kid deserves to have some fun. And Will is,” Hopper clears his throat, takes a sip of the tea, “He’s happy, I think.”\n \nAnd if that isn’t weird, then Steve doesn’t know what is. He knows what survivor’s guilt is, wears it like a vest over his shoulders, so Steve vows to check in on the kids when he visits them. Tonight.\n \n— — — \n \nSteve doesn’t reset the loop, and the dinners become a regular thing. Every couple of days he switches between the cabin in the woods and the Byers house, and laughs and cries and eats dinner with the newly reunited family.\n \nOccasionally, he thinks that he’s intruding. The first time he had thought that, he was halfway to leaving when Will wanted to talk dnd to him, and who was he to say no? So he sat on the floor of Will’s bedroom as he gushed about character sheets, and a new set of dice that Mike had gotten him, and Steve desperately tries not to think of the word’s best DM that should be sitting here, instead of him.\n \nHe doesn’t reset the loop. In between dinners with the Hopper-Byers, he plans and he sketches, and he doesn’t let anyone into his house. Steve is vaguely reminded of how Joyce’s living room looked in 1984, with sketches of tunnels and a demo-dog in the fridge.\n \nSteve dumbs it down for himself and figures that he has three set in (hopefully) not stone events that he has to change: El comes too late, Max is put in a coma, Eddie dies.\n \nIn a previous loop, he had told Lucas to be careful. To make sure that he was always holding the walkman, to make sure the magical Kate Bush was never far away, so that he could save Max if need be. He told him to be careful. That Jason is looking for them, and the group doesn’t have luck on their side.\n \nAnd he had nodded, and Max had floated, and Jason had come in and smashed the walkman anyway. \n \nIn theory, he thinks, Max should be easy to save. He’s in the living room, switching between pacing and sitting, tapping the pencil against his thigh and biting at the end of it. If he’s able to get himself, or Robin, or Nancy, or Eddie to go with Max, then maybe they can fight off Jason, and Lucas can slip the headphones over her ears.\n \nHe wants it to be Eddie. He’ll try it in the next loop — maybe if he can get him far enough away from the Upside Down then he can be safe. \n \nAs he’s about to write it down, a page of plans and what ifs that will come true, and realises that it can’t be Eddie. The only reason that Jason asked questions first and shot later was because it was Lucas there, and he (mildly) trusted him. If Eddie was there then he would no doubt shoot first. Fuck.\n \nNancy would be the best option, he thinks. She’s already angry with Jason, and Steve doesn’t think that the outcome would end too badly. Nance is good with a gun, definitely better than that guy, and she’s practical. She would figure something out.\n \nThis could work.\n \n— — —\n \nA week after the loop is meant to reset, Max dies. \n \nFor real, this time. El is sitting beside her, trying to talk to her, to find her, when the machine connected to Max stops. The sound is long and piercing, and Steve is so close to resetting right there and then.\n \n“What does that mean?” El asks, and Steve thinks he ages more in that moment than in the entirety of the loops. “Steve, what does it mean?”\n \nAnd she’s talking about the long beep and the flat line on the machine, and El is holding Max’s hand still, eyes open and searching. Her voice is wavering, and Steve is standing by the door and he wants to leave and to run and to slip in the pool and to never have to know that Max Mayfield dies a week after the battle.\n \nBut El is there. Looking at him, pleading him, so he crosses the short distance and hugs her. He pulls her close and holds her dearly, faces her away from Max. She’s grasping for something, anything to hold onto, balling up her little fists in the back of his sweater.\n \nHer breath stutters, and her whole body moves with it, and then she’s crying and silent, and they’ve fallen onto their knees on the floor, and Steve is still holding her, and he purses his lips because he needs to comfort her, because El is here and now, and Steve can fix this, he has to fix this, but he catches a glance of Max on the hospital bed, cold and lost, and the dam breaks open.\n \n(Steve’s the one to tell Lucas. He drops El off back at the cabin after telling a nurse, and then he drives straight to the Sinclair’s. When he opens their door, Lucas must see something on his face, because he’s crying at the doorstep, and Steve is holding him up, and nothing is okay. \n \nAt the end of the day, he retreats to the edge of the pool, keeps his legs crossed. He plans and he plans and he hopes that he can find an answer).\n \n— — — \n \nNancy leaves. As in, she drives far enough away from Hawkins that nobody knows where she went. He’s angry, at first, because how could she just leave like that? But then he remembers 1983, and 1984, and 1985, and 1986. Maybe she has the right idea.\n \nOn his nearly daily visit to the Byers for dinner, he bonds with Jonathan. It probably wouldn’t have happened without Nancy (and he realises that so much wouldn’t have happened without her), but as they clean up the plates for the night, they talk.\n \n“I’m sorry, you know.” Steve says. He wonders why he hasn’t said it sooner. “For everything.”\n \nJonathan has his hands in the sink, washing the plates, as he answers, “It’s okay. You’ve changed.”\n \n“I mean, I would hope so, but that still doesn’t make it okay? I never properly apologised for how I treated you in high school.” \n \nHe’s still for a moment in his scrubbing, and he turns to look at Steve. The plate in his hands is definitely dry, but he’s not thinking about that. Instead, he thinks of the hypocrisy of calling Jonathan queer when Steve was the one who liked Eddie.\n \n“Thank you.” Jonathan says, like it’s the easiest thing in the world. \n \nAnd the kitchen is a little too quiet, and this is a little too sentimental, and Steve has never been good at sentimental, he thinks, so he places the plate down, and picks up the next one.\n \n“Still not apologising for the camera, man. Shit was creepy.”\n \nFor all his faults, Jonathan looks sheepish as he leans against the kitchen counter. He’s scratching behind his neck and Steve can feel the embarrassment falling off him in waves.\n \n“Yeah, no, I definitely deserved that one.”\n \nThe next time they have dinner, they joke around and laugh and smile, and Steve questions why he didn’t apologise sooner. Even if not for himself, but for Will.\n \n“You have to let me style your hair one time,” Steve says. “It’s the law. You become friends with me and I get full blown access to your hair.”\n \n“And look like you? No thanks, man.” Jonathan says, but he’s smiling, and Will is snickering.\n \n“Oh, don’t think that you escaped this Mr. I Have Not Had a Haircut Apart From a Bowlcut!” \n \nAnd they race around the house, ducking behind doors, and when the fuck did Will get so fast? Jonathan is laughing, and Joyce is smiling, and Hopper has his arm around her waist. When El cracks a smile for the first time since the hospital, Steve thinks this is what a family looks like.\n \n— — — \n \nAmidst the doom and gloom of the, uh, ‘earthquake’, Robin comes out to Dustin. It’s partially accidentally, but partially not. She’s been planning on doing it since, well, getting drugged, but more important things had come up. Steve isn’t lucky enough that the Upside Down didn’t destroy Family Video, so after the town gets back on its legs, they’re scheduled back to work.\n \nRobin has her head on the counter and nobody has come in the whole day because Hawkins kind of becomes a ghost town? Steve is sitting on the counter, facing away from the door and swinging his legs like a child.\n \n“I really like her, Steve. Like really, really like her.” Robin says. Steve finds out that after the loop is meant to end, Robin and Vickie end up ‘hanging out’ more. “Oh god, and she does this thing when she’s talking about something she likes, like, she—”\n \nShe muffles a scream into her arms and bangs her head against the table, and Steve is happy for her.\n \n“I still don’t understand why you don’t just kiss her,” Steve says, just to rile her up.\n \nRobin, head still on the counter, points at him, “Okay, you do not get to lecture me about my love life right now. And what do you mean ‘just kiss her’? Are you forgetting a vital bit of information? Did you forget the whole part where we’re both girls and I am going to be ostracised if I make so much as a wrong move?”\n \n“I don’t know, Rob, from where I’m standing she seems like she’s into you.”\n \n“But that could just be friendly interaction! You know how some girl friendships are, right? You’ve seen the friendly kisses or the closeness that they sit and, okay, you might be a little right, because I really just want to kiss her.”\n \nIt’s a little before that, that Dustin enters the shop. And Steve should have probably heard the bell, and one of them definitely should have been watching the door because, uh? They were talking about kind of sensitive information.\n \nHe’s standing there, mouth open, eyes wide, and Steve, for a second, feels an inkling of fear. He pushes it down steadfast because this is Dustin.\n \nSteve nudges Robin because she is still rambling about how much she loves Vickie, and only after he says her name does she look up from her arms. \n \n“Is that why you two won’t date?” \n \nIt’s said in such understanding that Steve doubles over in laughter and falls off the counter.\n \n— — — \n \nHe bonds with Will in a way that he never thought he would. The dinners turn into breakfasts, and the breakfasts turn into Steve just coming to say hello and then staying the whole day. Sometimes it’s just Jonathan home, and they talk and they laugh. Sometimes it’ll be Hopper and Joyce, and Steve tries not to think too hard on how much he wants them to be his parents, too.\n \nOther times, when Joyce and Hopper have to work, and Jonathan needs to get out, they call him. There’s a hidden understanding, never spoken, that they don’t want to leave Will alone. Especially in that house.\n \nSo, they call Steve, because he’s already spending most of his time there (if not for the food, but to supervise the kids playing dnd), and he’s happy to talk to Will. One time, when Steve arrives at the door, and Hopper places a hand on his shoulder on the way out, Will asks him if it’s alright to like boys.\n \nHe’s said it so earnestly and timid, quiet in a way that Will always is. They’re lying on the living room floor, talking over the movie that Steve brought over. Steve must take a little too long to answer, because suddenly Will is backtracking and spluttering.\n \n“Will. It is.”\n \nThe movie keeps playing, and Steve almost wants this loop to stick. Just so that Will is happy and knows that he’s accepted, or so that he’s friends with Jonathan, or so that Robin is smiling and in love.\n \nInstead, he says “You remember Eddie?”\n \nThey never meet. The California crew is too far away, and Eddie dies too quickly, but Mike had told Will all about Eddie in his letters, and Dustin wouldn’t stop talking about him after the battle.\n \n“Yeah.”\n \n“I like him.” Steve says, and god, it feels so good to be able to tell someone, to speak it into existence, for it to be real and tangible and right in front of him. “And he’s a boy.”\n \n“So you like boys too?”\n \n“Boys and girls. But you don’t have to like both. There are plenty of people who only like boys, or only like girls.”\n \nWill nods, and stays on the floor, and Steve realises that, when he figures everything out, when he gets El here in time, when he saves Max and Eddie, he’s going to have this conversation again. There’s a small part of him that hopes that Eddie is by his side when he does.\n \n— — — \n \nAs the battle starts again, three weeks after the loop is meant to reset, the groups are divided. Nancy came back from her small trip, and the reunion was filled with tears and shouting and hugs, but they only get the night to relax before there are things spilling out of the gates spanning Hawkins.\n \nHe’s at the Byers for dinner, and he’s washing the dishes when he hears it. Like a stampede rushing past them, chittering and screeching, the flaps of wings, and the pounding of feet across asphalt and grass. \n \nWill feels it before anyone else, eyebrows burrowed and looking around frantically for something to appear, and then Hopper is holstering his gun, and Joyce has rushed to Will and Jonathan, El is holding Will’s hand and Steve has grabbed the bat that lays at the door.\n \nOnce the stampede has passed, and the chittering is quieter, El opens the door. They all stalk out slowly and with unsteady feet, and watch as a wave of storm covers their heads. Steve can hear the breathing of everyone here, and as he looks towards the sky, he can see a swarm of bats.\n \nSteve thinks he might be sick.\n \nHe’s so busy looking at the sky that he doesn’t notice the Demogorgon barrel towards Joyce. It’s faster and taller and stronger than he remembers it from his memory of 1983, and as El goes to throw the monster off of her, she’s distracted by the bats that dive from above.\n \nThe Demogorgon’s mouth opens, and Hopper is trying to help El, and Will is standing beside Jonathan, shocked and watching. He sees the way that the monster’s teeth sinks into Joyce, and the way it gets tired of her lack of fighting back. Steve hears the sound of her spine cracking against the road as it throws her away, bored.\n \nWill screams and runs towards her, but Jonathan is pulling him back, a haunted look in his eyes, as Hopper screams at them to get to the house. Steve watches Jonathan pull El and Will through the door, and he watches Hopper go to follow, and it’s then that he realises that he needs to fix this.\n \nHopper has holstered his gun back at his side, and Steve takes it, doesn’t stop to hear the cries of the Byers’, or the way that Hopper has turned with wide eyes, and turns the weapon on himself. \n \nThe loop resets, and he’s never felt happier at the prospect of swimming.\nWhen Steve was younger, he used to cry at the thought of growing old. He never wanted to grow up, told his dad as much, but that only earned him a harsh tug on his ear as he was lead into the basement. He sat and he waited, and when his dad descended the stairs again, Steve assured him that he had changed his mind.\n \nSteve stopped keeping count of the loops as they hit three digit numbers, crying and celebrating and cursing his younger self for somehow inflicting a never ending series of events that weighed on his shoulders. Time moves like muddy water and black blood, and Steve is ageing and ageing and never showing it.\n \n“You want me to what?”\n \nNancy stays stubborn every loop. \n \n“Nance, think about it. Jason is still trying to hunt down the kids and you saw how deranged he was at the gun store. Lucas is only going to be focussed on Max, and he probably won’t even notice if Jason is there until it’s too late!”\n \n“Steve, we have bigger things to worry about than Jason—”\n \n“Yes, we do, Nancy. But if Jason hurts Lucas, then who is going to bring her out of Vecna’s control?”\n \nShe huffs and breathes through her nose. Steve has to try. He had weeks to plan this out, this idea of how to save Max, how to come a step closer to bringing El back in time, a step closer to saving Eddie.\n \nThe grassy hilltop provides so sense of privacy, and he’s sure that the rest of the group is listening in on him. Out of the corner of his eye, he can see the bottles that Robin is meant to be filling sitting on the floor, and Dustin and Eddie huddled near each other, looking.\n \n“Okay.” Nancy concedes. “Okay, fine. We’ll do it your way,” \n \nHe almost crumples with relief right there and then, smiles and nods and makes his way over to the outside of the van, calling everyone over.\n \n“We’ve had a change of plans,” He says. “Nancy will go with Lucas and Max into the Creel house to keep them safe.”\n \n“But we need her in the Upside Down!” Robin says.\n \n“We’re forgetting about Jason. Yes, we have actual monsters to battle, but we shouldn’t just disregard that he’s been hunting the Hellfire Club members ever since Chrissy died.” \n \nLucas seems to understand what Steve is trying to say. “And I just betrayed him by leaving him to warn you guys.”\n \n“Exactly.”\n \n“Jesus H. Christ.” Eddie mumbles.\n \n“Everything else stays the same. No one moves onto the next stage until everyone is signalled and confirmed. No deviation, no changes.” Says Nancy.\n \nSteve thinks it’s a little funny. Because if he’s right, if this plan works, then everything has been changed, and he’s deviated so much from what was meant to happen. He thinks it’s a little less funny when he remembers who dies.\n \n— — — \n \nEl still doesn’t arrive in time, and Eddie still dies, but Max is alive, oh god, she’s alive.\n \nHer arm is in a cast, and she has nightmares every other night, but she’s alive and not in the hospital, and he doesn’t have to watch her die in a week. Steve’s plan worked. Nancy found him, after the battle, and told him that he was right.\n \nAs Max was taken by Vecna, and Lucas was talking to her in hurried, hushed tones, Nancy stayed quiet. She stood by the door of the attic, gun in hand, not saying a single word. Jason had burst through the door, and before he even realised what was happening, Nancy was pressing the sawed off shotgun to the middle of his back.\n \nShe walked him to the front door of the house, down the stairs and past the grandfathers clock, when she had knocked him out, cold.\n \nLucas had put the headphones on Max as she started lifting, and just has her arm bent backwards, she had fallen into a heap on the floor. It must have been just enough time for El to weaken Vecna, and for Hopper and Joyce to fuck up the monsters in Russia, because as Robin and Steve were released from the grasps of the house, greedily taking in air, they had ‘killed’ Vecna.\n \nVecna fell out of the house, just as he always did when Nancy was there, back hitting the pavement of the Upside Down, and just as Steve and Robin had vaulted down the stairs, he was gone.\n \nHawkins hadn’t split open. There was no earthquake to be found, no gates spanning across houses and streets. Max didn’t die, and it made all the difference. \n \n(With every action he takes there comes a cost. Max was no longer in a coma, but every time El tries to use her powers, they stutter and shake. Whatever she saw in Max’s head, whatever Vecna said to her, El doesn’t try and go into people minds again).\n \nEventually, he makes a different plan. In between the space at the end of the battle and the start of the pool. Nancy goes with Lucas and Max, because he knows that works, keeps that part the same. Now, he just needs to find a way to contact El. \n \nMaybe, if they ditch the gate in Lover’s Lake completely, they’ll be able to contact the Byers and Mike in Cali. Maybe that’s the reason the loop starts when he’s just about to dive in. The timeline of events on El’s end of things is still iffy, but he thinks that this (maybe) possibly could work.\n \nAnd, if El arrives in time, and Max is already saved, well. Then Eddie should live.\n \n— — —\n \n“Hey, maybe we should try and contact El again? This is kind of her area of expertise.”\n \nNancy looks at him like he’s grown a second head. “Their phone is busy, remember? We tried calling them already.”\n \nOh fuck.\n \n“Anyway, if there’s a gate down here, we need to know.”\n \nSteve sometimes forgets that there are things that happen before the loop even starts. He’s been living through the same three(ish) days for so long (plus that one time he lived through three weeks, but he does not want to think about that), that he forgot that they already tried to call them.\n \n“Hey? Harrington? You good up there?”\n \nEddie waves a hand in front of his face, and Steve realises that he’s wasted fifteen seconds. So he starts to take off his shirt. As his hands break through the water, he catches the tail end of Eddie saying something along the lines of I don’t usually have that affect on people, before his head is submerged. \n \nHe doesn’t have the time to take off his shoes, and as he steps on the bat, pulling and pulling at its tail, he questions why he ever took his shoes off in the first place.\n \n— — —\n \nWhen Nancy’s eyes start to roll back, and everyone else has made it safely through the gate, he feigns panic. He shouts her name once or twice, holds onto her shoulders, and watches as everyone above him scrambles to find a tape that isn’t there.\n \nIn all of the loops, he’s never tried to snap her out of it. She always makes it out because Vecna wants her to know what happened, to find El and tell her what happened. But El already knows, and Nancy never ends up telling her anyway, so what’s the harm in trying?\n \n“Help me make the most of freedom and of pleasure,” Steve rushes out. Breathes, imagines the tempo in his head, “Nothing ever last forever, everybody wants to rule the world.” \n \nHe keeps going, and he ignores the shouting overhead, or the panic in his voice, even though he knows she makes it, and sings. There’s a tumble and a thump! and Steve turns, still singing, and finds Eddie playing the chords to the song, switching between the lead lines when Steve finishes each verse.\n \n“So glad we’ve almost made it, so sad they had to fade it,” and he breathes in and he holds her shoulders and her eyes are open and wide and she breathes deep.\n \nIt’s the first time that he’s broken Nancy out of the trance. Steve and Eddie boost her up, and then Eddie is falling on the mattress, with following him shortly after. As they reconvene in the right side up, Nancy connects the dots anyway. She figures out that Henry and One and Vecna are all the same person, without having to go through…whatever she saw. \n \n“Didn’t know you had such a pretty voice,” Eddie says, as Steve’s driving the van. “I think I might just recruit you as Corroded Coffin’s backup singer.” \n \nHis smile is so wide and his arm is resting on Steve’s shoulder and Steve feels like he’s going to combust. \n \n— — — \n \nSteve is the distraction, this time. He feigns weakness at his bat bites, and spins a tale of how he’ll only slow them down. When he’s in the trailer for the first time, alone, with Dustin, he sees the bats swarm through the vents. He ushers Dustin up the gate, and he’s hit with a memory of lifting the kid out of the tunnels under Hawkins.\n \nAs he sees him fall and make his way to safety, Steve realises how clear the choice is. How easy it is to decide. And he knows that Eddie chooses it every time. As Steve is cutting the link between him and Dustin, peddling as fast as he can, he knows that it doesn’t matter who he sends. \n \nThe distraction will always die.\n \n— — —\n \nSteve realises after so many loops, after dying and dying and, yep, you guessed it, dying again, that Max isn’t the only one cursed. They all carry a weight with them. It comes in the form of misplaced words, or Barb, or fathers, or Billy. It weighs them down and sets them up, fails to anchor them.\n \nWith convincing and pleading, he manages to come up with a half-baked plan: strength in numbers. If they all overwhelm Vecna, and El is piggybacking across Max’s mind, then surely it’s enough.\n \nIt warps and it forms, and the plan reveals itself as a quick succession of death. Gruesome and loud, ringing in his ears are the sounds of bones and screaming, and shouting lyrics, because Nancy always made it out, Vecna always let her go, he never had to worry about her. And Robin is throwing the Molotov’s, but Vecna is just smiling and laughing and he’s somehow become stronger.\n \nHe pleads to be taken next, and as he watches Max float up into the air, as he feels the thump of Nancy’s body on the ground, he knows that no one is listening.\n \nThe axe comes down on the vines connecting to Vecna, but as soon as he cuts one down, they’re coming back tenfold. But he swings and he swings as Dustin lifts, and he vomits as Robin’s jaw bends, eyesight blackening at the edges as he desperately holds on to Lucas as his eyes roll back.\n \nHe’s hyperventilating, and he needs to die, because there are bodies that litter the ground, and he was meant to save them why can’t he save them.\n \nEddie is trying to kill Vecna, grabbing Nancy’s gun and shooting and shooting and shooting, but Steve has fucked everything up. Did they leave too early? Had Hopper and Joyce not killed their monsters yet? Could they not do this without Eleven?\n \nSteve grabs him by his shoulder the monster cackles. He pushes him out the door, slots the axe to keep it closed as he hears Eddie scream.\n \n“Take me! Come on you fucker,  just take me!” He’s pleading and his voice is raw and he’s crying and this loop needs to be over, he needs everything to be alright again. Take me not him, he wants to say, please not him, please take me.\n \n— — —\n \n“You really think that anyone could love you?” Nancy spits. “You’re bullshit, Steve. You don’t take anything seriously. How could anyone ever love you?”\n \nSteve knows that it’s just Vecna playing into his fears, the weight he carries, but it doesn’t hurt any less. It’s the Halloween of 1984, and he’s spilled alcohol all over Nancy’s shirt. \n \nThe scene changes and moulds and he’s standing outside the Byers house, knows that the kids are behind him. He watches Billy get out from the car and it hurts. As Not-Billy approaches him and says the same things, voice sharper, eyes bluer, he wonders what type of person Billy would have become if he was ever given the chance.\n \nBilly’s face is turning softer at the edges, and the woods behind him start to dissipate into bright fluorescent lights, his head throbbing, and the smell of vomit clinging to him. Vecna shows him Robin. The bathroom. The confession. Easy acceptance. He knows what’s happening, but he hears the words come out of her mouth, in the same tone that she uses, the same smile that she has and he breaks.\n \n“Fuck you.” He says. “Fuck you and your mind games, Henry.”\n \nSaying Vecna’s proper name must snap something in him because Steve’s thrown back, and he’s hitting a wall, and his face is being grabbed, claws sharp and digging into his face. This is for the loop, he thinks. If he dies the loop resets. He just needs to die.\n \n— — —\n \n“Robin, I’m having a crisis.” Okay, well, that’s one way to start off this conversation.\n \nSteve sings to Nancy in every loop, and he tells himself that it’s so everything can move quicker, and miss Jason at the gun store by a couple minutes, but really, he thinks the truth takes the form of a smile and the warmth of a hand.\n \n“I think we’re all in the middle of a crisis, Steve.”\n \nThey’re making the Molotovs, and normally, this is the part where Robin confides in him the fears that she’s having, but Steve is kind of speed running his sexuality crisis (for the second time). \n \n“No,” He says. “I’m having a crisis.”\n \nHe puts emphasis on the word and mumbles it slightly, leaning closer to her so she understands.\n \n“Oh my god.” \n \nHe sits back in his chair nods his head in an exasperated manner.\n \n“Oh my god.”\n \nRobin has put down the equipment, and is staring straight at him, and he doesn’t even have to say anything more, because she’s already on top of things.\n \n“I knew I felt tension when he called you ‘big boy’!” \n \n“Robin!”\n \n“And when we were in the Upside Down and he gave you his vest or when you guys played the song together for Nancy, Steve, oh my god. How did I not realise? How have you never been on my radar?”\n \n“Yeah, well, it’s not like anything’s going to come out of this anyway so.”\n \nRobin is sitting back in her seat, legs crossed underneath her. She has that giddy smile that she wore when she saw the music box in Nancy’s room, and he can feel the cogs turning in her head. \n \n“What do you like about him?”\n \nSteve almost tells her about the list. About how Nancy and Billy and Robin and Eddie had all these things in common, about how he most definitely had a type, but he thinks that she’s already figured that one out, too.\n \nSo, instead, he says, “I like his hands.”\n \nAnd Robin squeals so loud that everyone turns back to look at him, and his face is red and splotchy. He can feel it disappearing down his neck and chest, but he’ll blame it on the bat bites if anyone asks. \n“I have this terrible feeling that it might not work out for us, this time.”\n \nIt’s said in every repeat of the conversation, whispered and vulnerable. Pre-loop Steve reassured her and brushed off her comment, because, they always made it out. They had lost and they had hurt and people had died, but they always made it out.\n \nSome events and feelings fade into the background. Steve doesn’t mean to ignore them, or to forget them, but he’s fallen into a sort of routine. He says the same things that pre-loop Steve would say, changes some instances to pledge reassurance and comfort. Plans are altered and weapons are made sturdier, and he counts the seconds as he dives, but he tries to keep the conversations as happy as they always were.\n \nWhen he was younger, he used to be admonished for being stupid. His father would turn to him with a heavy hand when Steve pretended to be oblivious to the sorrow at the dinner table, made jokes with his mother. Tommy H. and Carol would laugh when he was obnoxiously obtuse. Dustin would launch into a speech about how Steve just had to be taught about dnd as he pretended to not know what a d20 was. Robin would sigh in fond exasperation when he would get her to explain things slowly and clearly.\n \nSteve wasn’t dumb. He felt the tension at the dinner table, the watery eyes of his mother, and the way his father clutched his cutlery. He could see and he could feel the pressure building up until reaching it’s precipice: exploding and tumbling and hurting everything in its wake.\n \nYou pick things up early, as a child. Steve takes his shoes off before he steps on the carpet, because his mother hated cleaning the mud out of the thick strands. He makes his tea before his toast, so that there’s time for it to cool before he drinks. And when he feels like there’s going to be that explosion, bottle necked and ready to burst, Steve pretends to be dumb.\n \nIt works out most times. \n \nPre-loop Steve had raised a cheers to killing Vecna-slash-Henry-slash-One when Robin had confided in him. She had laughed a watery laugh and they had clinked the half-finished Molotovs to each other. And he had done it again and again and again, every loop. \n \nThis time, when the words start to tumble out of her mouth, he feels that she might be right.\n \nHe thinks back to loops ago, when he told Robin his feelings about Eddie. Almost caves and tells her again, just to see her smile. But Steve hasn’t gotten any closer to fixing things. He can feel the explosion coming on. \n \n“I’ve been living the same few days, over and over again. I know who dies and who survives, and I haven’t been able to stop it.” Robin’s hands have stilled, but Steve continues, steamrolling over emotions bottled and captured and waiting to combust. “And every time something goes to shit, and I can’t fix it—”\n \n“That’s not funny, Steve—”\n \n“— I have to die, and I have to wake up on that fucking boat above Lover’s Lake—”\n \n“I don’t understand—”\n \n“—dive in, choke, be mauled by demon bats—”\n \n“What do you mean—”\n \n“— and then I fuck everything up again! Do you know how it feels to watch the people you love die because of something that you suggested?”\n \nThere’s a pause. A breath. Steve vaguely registers that he’s crying, dirt and blood mixed with tears, as they roll down his face. He uses the rough edge of the new jacket to wipe them away angrily. \n \n“You’re right. It doesn’t work out, and I am so fucking tired, Robin.”\n \nCold hands press themselves against the side of his head, and he’s staring at her face. He blinks and pulls his eyebrows together, and he lays his hands on hers. Robin is staring at him, and Steve can hear the sounds of the Sinclair siblings bickering, and Dustin and Eddie roughhousing, and Nancy and Max shooting. \n \nRobin is staring at him, and her breathing is slow, so he focusses on that. He closes his eyes and takes a deep breath that stutters out of his chest. When he opens them again, and he makes a face that his father would hate, Steve’s pulled close until he forgets where he starts and Robin ends.\n \n— — — \n \nLater, before they’re going over their plans, but after Steve has spilled his guts out, Eddie approaches him. It almost makes Steve panic because the last proper conversation they have, no matter how many times he tried to change it, was in the van before the plans are finalised.\n \nAfter that? Steve tells him not to be a hero, but Eddie has never been one to follow the rules.\n \n“Hey, you holding up alright?” Steve says.\n \n“I feel like I should be asking you that.”\n \n“What do you mean?”\n \nEddie sits next to him, where Robin was once sitting, and Steve remembers that he just cried in an open field, right in front of the whole group to see. Great. Amazing. Wonderful, even. Eddie is still staring at him, playing with a patch on his jacket that is coming up at the edges.\n \n“Nothing, Harrington. Just,” he swallows. “You just looked like you could talk with someone.”\n \nSteve is good at reading people. He can walk into a room and categorise the emotions presents on everyone’s faces, can decide to be dumb to lift the mood. Steve Harrington is good at reading people, knowing what they need from him, what they want from him. Yet, when Eddie looks at him like that, eyes focussed and soft, hand hovering in the space between them, he doesn’t know what to think.\n \n“Everything’s going to be alright, okay?” Steve says. Tries not to think of the emotions welling up in his chest, or his need to hold Eddie’s hand. The lie tastes like ash in his mouth, sitting heavy on his tongue. \n \nSteve braves the short distance, the wide expanse of space separating them, clutching Eddie’s hands in his own. His rings are cold against his palm, but Steve is so, so warm. He wishes that he could stay in this moment forever, after the bonding, before the death. The in-between.\n \n“Nothing is going to happen to anyone. Nothing is going to happen to you.” Steve wills it to be true,  pleads and hopes and begs.\n \nWhen Nancy opens the door to the van, goes over the altered plan once more, Steve catches Robin’s eyes. There’s a sort of hollowness to them, as if she knows what’s about to happen. When they tumble through the gate into the Upside Down, after Steve has told Eddie not to be a hero, and he’s left alone with Robin to walk to the Creel house, she speaks.\n \n“It’s Eddie, isn’t it?” Robin says. There’s the unspoken words that he can hear in her tone of voice. You love him, and he dies, and I’m sorry. \n \nSteve nods, and keeps walking.\n \n— — — \n \nWhen the loop is near-complete, and the battle is over. When El doesn’t arrive in time, and Eddie dies, and Max is alive, Robin stays with Steve. Every other loop he’s seen her scramble to Vickie like a lifeline, watched them smile and laugh and hug. \n \nThe first night, after everyone has explained their side of the story, and Dustin has cried in exhaustion and loss, and Nancy has ushered the kids home, Robin holds his hand in the kitchen and cries. \n \n“Promise me,” She says. “Promise me that the next time you go through this, you tell me.”\n \nHe wants to tell her that it won’t make a difference. That he needs to figure out how to save everyone else before he can even think of saving himself. Instead, he settles for, “You won’t believe me.”\n \nSteve doesn’t think that he’s ever seen her cry. Proper tears, that is. She’s laughed at him when he gets the names of streets or celebrities wrong, rolled around on the floor clutching her stomach when he tells her about his date-gone-wrong. He doesn’t think that he even remembers her crying when they were tortured by the Russians. \n \n“I will always believe you, Steve. No matter what.”\n \nRobin holds onto his hand, never seems to let go, for the passing of the two days before he resets the loop. He waits until she passes out from sheer exhaustion, carries her and places her into his bed, tucks her in. The main light is turned off, but he keeps the hallway and bedsit lights on, spilling warmth into the room. \n \nWhen the moon is hung high, and the stars are winking at him above, he slips off his socks and walks into the woods. Away from the Hopper cabin (they’ve been through enough, only just starting to realise what normal is), far enough away from Robin. He wanders until his toes touch something other than dead leaves and sharp sticks, eyes meeting the cliff of the quarry.\n \nNext loop, he promises. Next loop, he’ll tell Robin.\n \n— — —\n \nWhen Steve comes to, he doesn’t take off his shoes. Hasn’t taken off his shoes since he first realised that running through the Upside Down and dismembering bat-like creatures was so much easier when he had a buffer. He thinks that it’s a good enough reason to keep his shoes on, but it doesn’t mean that he enjoys the feeling of wet socks any better.\n \nAs Steve’s reached his hands towards his sweater, he’s struck with the thought of why do I even take this off? Because if he can keep his shoes without altering anything significant enough to fuck up his half-baked plans, then surely he can keep his shirt, too.\n \nThere’s a slight bit of resistance as he swims through the water, but not enough to justify leaving his shirt behind. It’s not something that he noticed at first, but the Upside Down is freezing. The shirt will (hopefully) help with that.\n \nHe comes back up and tells them about the gate, and they all swim down together. When he breaks through and gets dragged by the neck by a bat, he realises that the world seems to fucking hate him. Steve’s not even mad about the bat attack at this point — it happens regularly enough that he’s figured out that slipping his fingers underneath the tail is a sure way to get his fingers broken, and that the easiest way to deal with them is to run like hell.\n \n…Which isn’t an option when nobody knows what’s on the other side of the gate, but him.\n \nAnyway: the world hates Steve Harrington, because as he’s dragged across the ground, road rash and scratches making themselves known, he can feel the yellow threads of his sweater weaving themselves inside of him.\n \nEddie stakes a bat, Robin and Nancy beat them with oars, and Steve bites and swings and spits black blood onto the floor.\n \nSkull Rock is always a nice little sanctuary, Steve thinks. Close enough that they can all run to it without problem, with enough shelter to hide from the flying monster overhead. \n \n“Shit.” Is the first thing that Nancy says once she gets a proper look at him.\n \n“You okay, man?” Eddie asks.\n \n“Yeah. You’d think I’d get used to being beat up every year.” Steve jokes, but the sweater bits in his cuts hurt a lot more than he thought they would. “How am I looking? Still got all my best features in tact?”\n \nSteve does a little spin in place which, okay, maybe not the best idea when he’s suffering a little bit of blood loss and missing-a-pound-of-flesh syndrome. His feet are unsteady in his wet shoes, and he stumbles into Eddie a bit.\n \n“Woah there, big boy. Maybe you should sit down for a moment.”\n \nHe slips down the rock, again, feels a warmth in his cheeks that has become common when talking to Eddie. The sweater he’s wearing is hanging on by threads at his arms and his shoulders, and Steve tries not to think about the cool air on his back.\n \n“How’s about we get this off you?” And Eddie doesn’t wait for a reply as he starts to peel back the fabric sticking to Steve’s skin. \n \nThere’s a gasp from Robin, and Nancy is covering her mouth, and he knows that the bites probably look a lot worse when they’re intertwined with yellow. The shirt has already started to stick in some places where the blood has rapidly dried, but Eddie is gentle as he eases it off.\n \nHe knows that he should be worried about the change: the fabric in his wounds. But all he can think about are Eddie’s hands on his shoulders, and Eddie’s hands on his waist, and Eddie’s hands as they lift the sweater off Steve.\n \nThe shirt is demoted to being a bandage, no more Nancy Wheeler ripping the edges of her shirt apart to mend Steve back together. There’s a recollection, somewhere in the back of his brain, as Eddie wraps the shirt around his middle, that this was originally Steve and her. \n \nWhen he finishes his hard work, nods once and looks back up to Steve, Eddie’s face is awfully close. Their breath is mingling together and it spans across Steve’s cheeks. Eddie’s eyes are such a deep brown that he almost gets lost in them, searching and searching, finding echoes of something that Steve feels deep inside. \n \nHe glances down, unknowingly, accidentally, at Eddie’s lips for a moment, before meeting his eyes again. Steve breathes out, almost leans forwards, before they both lean back, Eddie getting to his feet. He’s is looking anywhere but Steve’s face, but he still offers a hand, warm and safe and calloused, pulling him up.\n \nEddie still gives him his vest. He doesn’t throw it at him in what Steve thinks was an attempt to break the tension between Nancy and himself, but as they’re setting off to go, he lingers behind, shrugging it off his shoulders, delicately placing it over Steve’s. There’s a moment, a pause, where they stop to look at each other under the cover of Skull Rock, and Steve wishes that he could just hold his hand again.\n \nAnd then Eddie is patting his shoulder and running back to the group, and Steve is so fucked.\n \n— — —\n \nHe does end up telling Robin about the loop. Steve contemplates not doing it, reverting back to Dumb Steve Harrington Who Doesn’t Understand Anything As For The Happiness Of Others, but he realises that it’ll get him nowhere. He mourns the loss of conversation with Eddie, walking in the Upside Down and sharing stories, but he figures if he fixes things, he can have all the time in the world to talk to him.\n \n“So you’re telling me that you’ve been through this how many times?”\n \n“At least a hundred?”\n \n“At least—” Robin huffs. “And they last, what, three days? Steve, that would meant that you’ve spent nearly a year going through this! You only just told me last loop?” \n \n“Yeah? I thought I went over this already.”\n \nRobin has stopped, clutching onto Steve’s shoulders and shaking him as hard as someone with her size and strength possibly could. “You have just dropped the fact that my best friend has been seeing everyone die, dying himself, and has been this for years and you’re acting like it’s not a big deal! What the hell Steve?”\n \nHe feels his head swim, and his body tense.\n \n“Robin, you’re kinda—”\n \n“Shit! Sorry!”\n \nShe lets go of him quickly, still standing there, hands on her hips in a way that remind Steve of himself when he’s reprimanding Dustin in what Robin calls the Disappointed Mum Stance. He tells her about the plan of how to save Max, how he knows that it works already. He tells her about how the Upside Down is stuck in the past, how they won’t find guns at Nancy’s house, how there’s a gate at every victim.\n \n“Got any ideas for me?” Steve asks.\n \nThey’ve started walking again, catching up to where Eddie and Nancy are talking about…something. Robin clasps her hands together and presses them to her lips, thinking. \n \n“If you need to save time so that you can contact El early, what if you cut out the middleman?”\n \n“What?”\n \n“You just explained everything about the Upside Down being stuck back in time. We’re wasting time going to Nancy’s, because we could be going straight to Eddie’s, right?”\n \n“But what’s the plan there? I need something tangible to be able to explain why I suddenly just know all of this info, otherwise they’re not going to believe me. And we’re also completely forgetting that we’re gonna need the bikes, anyway.”\n \nRobin pauses. “Right. Okay. Well, the loops don’t have a limit. Steve, what if you spent some days searching the Upside Down?”\n \nIt’s like a lightbulb going off in his brain. “I could try and find something at Skull Rock that explains the time difference.”\n \n“And you could search the nearby houses for bikes.”\n \nWhen things go to shit at the end of the loop, Steve doesn’t feel the bleak sense of loss and monotony. There’s determination and anger and hope. As the night ends, and he goes to slip in the pool, Robin stays by his side.\nSteve keeps the shoes and ditches the shirt. He dives and as he reaches the gate, about to pass through, he’s reminded of when he last did this. How he had rushed in head first, patrolling bats finding him quickly. It takes thirty seconds to ‘search’ for the gate. Ten seconds to come back up. One minute for everyone to dive down. The bats still attack him when they all go through together. \n \nThese are things that Steve knows. So he uses a couple loops finding the shortest amount of time he can wait before he’s in the Upside Down, again.\n \nHe doesn’t give himself time to breathe, or even properly search the sky before he’s running and running and running. The socks in his shoes squelch under pressure and speed, but he keeps going until the trees provide him with shade, and he can see the beginnings of Skull Rock. He doesn’t think of Eddie and Robin and Nancy at the surface, waiting for him. He doesn’t think about the end of the loop.\n \nTelling Robin about what Steve’s been going through was probably the best decision that he’s made in his life. Their plan had three parts, easy enough to follow in theory, but really time consuming in practice:\n \n \n1 and 3 were easy enough, Steve thought. Robin had proved that she believed him every loop, no matter how outlandish or frazzled he had been when explaining to her. Yes, it would take some time to find a place that had at least two bikes, but time was really all Steve had going for him. Trying to find evidence of 1983 in the Upside Down and then convincing the group of what was happening? Hard. Very, very hard.\n \nSteve started at Skull Rock. Took the same path that they always take, through the woods that bracket the empty lake, and opened his mind. The closest buildings were Reefer Rick’s, and the boat shed that Eddie was hiding in. After that, he guessed that the Byers’ was probably the best bet.\n \nThe other problem with trying to find the bikes, was that pre-loop Steve would also have to have known that they were there. He couldn’t go rocking up into some random person’s house and just excuse how exactly Steve knew the place would have everything they needed.\n \nHe checks the house first. There isn’t much to be seen: cans of food, bottled water, a bong on the couch. The floorboards creek as he makes it down the hallway, checking each and every room for anything that could be useful. Nothing.\n \nThe good thing about the loops, and the Upside Down, was that property damage wasn’t a thing that existed. Steve takes a page out of Robin’s book and throws an elbow into the window of the boat shed, and pretends that he doesn’t feel a little elated at watching the glass shatter.\n \nClearing his throat and keeping quiet, he slips his hand through the gap and opens the door (a rather annoying feat, considering that he has nothing to protect his arms). Most of the things have stayed the same — which is no surprise considering that Rick is constantly in and out of the system. The blue tarp is still covering the boat, the oars still pressed up against the walls.\n \nSteve turns the insides of the boat shed inside out and upside down. The tables hold nothing of value, apart from a couple tools. He makes mental note of them, and moves on. There’s a multitude of literal trash that he finds. A baggie of something underneath the tarp hiding the boat, and a couple empty beer bottles. In some twisted way, it makes him yearn for when Eddie pressing the sharp shards of broken glass against his throat was his biggest fear of the year.\n \nThen, in the corner of the room, he spots it.\n \nHidden away from view, bundled up in tarp, are three bikes. Steve checks the tires for punctures and  other problems, goes for a short joyride around the perimeter of the lake on each bike to ensure their sturdiness. Once he knows that the bikes are good enough, will last the ride to Eddie’s trailer, he devises a series of plans.\n \nThere’s only three bikes, so one of them is going to have to buddy up. Robin is the lightest, and Steve is the most athletic, so it makes sense for her to go on the back of his bike. Plus, it’ll give him more time to fill her in on the loop, after their conversation in the woods.\n \nNow? Well, now he just has to figure out how to convince them they’re in 1983.\n \n— — — \n \n“There has to have been something that told us it was ’83 in there, apart from from Nancy’s diary.” Steve says. He’s opted to stay back in van while the rest of the group go into the gun store. Eddie is sitting on the seat at the back of the van, laying on his stomach and kicking his feet in the air, flipping through a magazine.\n \n“Well, I don’t know much about the logistics of the Upside Down, but I’ve had this weird feeling ever since you dove into the water.” He stops flicking through the mag for a second to catch Steve’s eyes. “Like something was gonna happen to you.”\n \nSteve is leaning against the wall, eyebrow cocked. He pointedly waves his hands around his stomach where the makeshift bandage is being partly covered by Eddie’s vest, “Yeah, well something did happen.”\n \n“No, I mean, like.” Eddie rolls his eyes. “Something not Vecna or Upside Down related. I don’t know. It’s weird. I’m weird.”\n \nFor a second, Steve almost thinks he knows about the loop. As soon as he turns (to tell Eddie? To ask him what he means?), his focus is already back on the magazine.\n \nSteve sighs and lifts Eddie’s legs up, sitting down on the couch, “Skive over, leave some space for the rest of us.”\n \nHe flails a little, centre of balance shifted, before Steve plops his legs back down on his lap. Steve plucks a magazine out of the compartment near his head, flips through the pages and pretends that the words stay still long enough for him to read them.\n \n(It’s definitely not to hide is red face, or the dumb smile that’s plastered across it as Eddie glances back at him).\n \n— — —\n \nEven though he knows it doesn’t keep, it still hurts to betray his friends like this. He dives through the gate, misses the bats, grabs a bike from the boat shed and rides to Eddie’s as fast as he can. Steve knows that by the time he gets to his location, to Skull Rock in regular Hawkins, that the cops have already taken the kids away.\n \nHe slows down the bike as he creeps through the underbrush, ditching the bike in a pile in the bushes. The cops are still there, but Steve knows the ways that they move, now. He can see the empty boat floating on Lover’s Lake, and tries not to think too hard on what that means for his friends.\n \nThe first cop is easy to get by — he’s easily distracted by the small sounds of the forest, and a small rock thrown against the furthest tree from Steve’s destination is enough to lead the officer away. From there, he rushes to the clearing, stopping and ducking as flashlights swing across the forest.\n \n“And why’d Powell even say the kids name?” Cop 1 has a thick accent, muggy and tired in the night. “It’s just gonna make it harder for us to find ‘im.”\n \n“Or get the public to beat him up.” His partner, Cop 2, is quiet, standing where Eddie’s watch and bottle of water were discarded. \n \n“Who d’you think did it? ‘Cause I’m not buying the whole ‘the kid lifting people into the air with his demonic powers’ schtick.”\n \nSteve pulls himself further down as Cop 2’s flashlight shines where his face was previously. “Doesn’t matter who we think it is, I guess.”\n \nHe waits, feeling the cool of the air flow over his bare shoulders, Cop 2 getting up from his crouching position and beckoning his partner over. They take photos of the items on the ground before stalking off towards the gaggle of cops congregating by the road. As soon as they’re far enough away, Steve is running to the boulders.\n \nSkull Rock at night looks just how he remembered it to. There’s trash littering the floor, something that wasn’t present in the Upside Down, but not strong enough as evidence to convince the likes of Nancy.\n \nHis heart is beating in his throat, and it’s only then that he gives himself time to breathe. Steve lowers himself onto the ground, leaves undoubtedly sticking to his wet hair, and gazes up at the underside of the rock, at the night sky. \n \nHe remembers doing this when he was in high school (and before that, too. When his dad was a little too loud, or his mum a little too quiet). There were times when he was alone here, other times not so much. Once, a girl had said that he was like the sun. Bright and blinding, so beautiful to see if only for a moment. \n \n(“And what do you see when you look at me?” He had asked, young, with too much teeth to his smile.\n \n\nShe had huffed, as if it was the most obvious thing in the world. “I see you burning at both ends.”)\n\n \nAs he gazes up at the sky, stars twinkling and dying, he can see the similarity.\n \nSteve’s eyes linger on the sky for a moment longer, letting himself have this, before they follow the grooves of the rock. Carved into a crude heart with an arrow through it, is TH + CP. Tommy H. and Carol Perkins. Tommy and Carol who only came to Skull Rock after Barb had disappeared. After the time stuck in the Upside Down.\n \n— — —\n \nBetween the loops, as he tries to figure out the perfect way to convince the group (Nancy. How to convince Nancy) about the time jump, he talks to Eddie in the van. Steve brings up different topics of conversations every time, and neither of them were bothered about the abrupt change in subject. \n \nMost of the time, they try and think of what they’re going to do after all of this shit. Steve tries not to think of the three weeks, or the lack of Eddie in them. \n \n“I just don’t even know if I want to go to graduation, man.” Eddie says. “Everyone there is going to think I killed Chrissy.”\n \nIt’s hard to relate to someone’s struggles of having someone die in their house. Steve would know. The first time he had gone into his pool since Barb had disappeared, died in it, was when he had first reset the loop. There’s fear and there’s guilt, and then, there’s something else.\n \n“Do you sometimes wish she had died somewhere else?” Steve asks.\n \n“No! Of course not!” Eddie is staring at him with something akin to fear. Not afraid of him, Steve decides, but like he’s been seen. \n \n“You remember Barb?”\n \n“The one who died to that chemical leak?”\n \nSteve cringes. Right. “Not so much of a chemical leak, and more of a getting-dragged-into-the-Upside-Down in my pool.”\n \n“Oh, so you—”\n \n“Yeah.”\n \nThey stay sitting on the couch, in the quiet of the van, Steve not looking at Eddie to give him the minute amount of privacy that he can offer him as he figures it out. The conversation feels heavy on the air, but Steve feels like it’s necessary.\n \nThere’s a series of things that happen within the loops that he’s collated and ordered and promised to do in the loop that sticks. Coming out to Robin, comforting El, apologising to Jonathan. Helping Will with his sexuality crisis, talking to Hopper. Steve decides that this conversation with Eddie is something bound to be repeated.\n \n“Is it bad to say that I’m glad someone else has been through this?” Eddie questions, voice small, hesitant, backtracking almost immediately. “Not that I wanted Barb to die, or for her to die at your house, man, just.”\n \n“No it’s— it’s nice to have someone else who understands. I mean, yeah, it’s a super fucked up situation that no one should have to understand. But, I feel like I can say those things about wishing for her to have been somewhere else and you don’t look at me like I’m crazy. Or selfish.”\n \n“I get it. Really, I do. It’s the only thing I’ve been thinking about since it happened. What if I refused to sell her the harder shit? Or just told her I’d bring it to her the next day?”\n \nSteve finds that they have a lot more in common than he once thought. \n \n“Well, you’re not alone. So when you feel like you need to get out of there because,” because you saw Chrissy die in your living room, “If you feel like you need to get out, you call me. Doesn’t matter if it’s the morning, or the middle of the night. You call me. Got it?”\n \n“Got it.” Eddie repeats, before his face is pulling back into a smile, and he’s leaning back into Steve’s personal space. “Didn’t know that you were so demanding, Stevie. Got me all hot and bothered underneath my collar here.” \n \nSteve rolls his eyes so hard it almost hurts. He finds that Eddie has a knack for turning even the most weighing conversations light. “Don’t act like you don’t like it.”\n \nHe gasps, pretends to hold a microphone in his hand. “Scandalous! Is the Steve Harrington flirting with Eddie ‘The Freak’ Munson?”\n \nThe ‘microphone’ is shoved in his face, and Steve leans in. “And if I were?”\n \nHe pauses. Eddie’s hand falls from where it was clutched near Steve’s mouth to settle on his thigh, fingers playing with the edge of the borrowed vest. “I wouldn’t be complaining.”\n \n— — —\n \nThe next time he goes through the loop, and Robin is about to mention the police station, Steve comments. He’s been through the loops, found the bikes, the carving of the heart, the perfect words to say and when to say them.\n \n“Hey, this is missing something.”\n \n“Steve, what do you mean?” Nancy says, exasperated.\n \nHe walks around the rock to where the heart was meant to be. “Right here! It was meant to be right here, I don’t—”\n \n“Something you wanna share with the class, Stevie?”\n \nFingers are tracing the smooth edge of the rock as he speaks, “Tommy and Carol’s names should be here.”\n \n“You probably just missed it. I mean, it’s a big rock, you’re probably just in the wrong spot.” Nance replied.\n \nBut Steve is already shaking his head and turning back to them, “No, Nance. We were just here, back in normal Hawkins, and I saw it. It has to mean something—”\n \nShe sighs, “Steve—”\n \n“No. No, Harrington’s right. The Upside Down is exactly the same as Hawkins, right Robin?”  She nods. It’s Eddie that comes to his rescue, pointing to the ground. “Then my shit should be here. The water canister, and my watch. They should be right here.”\n \nRobin is the one who says the answer. Steve finds that Nance is more likely to believe her over him in this situation.\n \n“What if we’re in Hawkins but not our Hawkins? We could be— Nance, when was the first time a gate opened?” \n \nSteve can practically hear the cogs turning in Nancy’s brain. “1983. When Will disappeared.” He holds his breath, waits for her to figure out the reason for the gates. “We went through the gate in Lover’s Lake, right where Patrick died. Vecna must be making openings at every victim. We have to get to Eddie’s trailer!”\n \nThey bicker for a few seconds, trying to come up with the best way to get to the other side of town. Steve brings up bikes, and it’s Eddie’s idea to go to Reefer Rick’s, guessing that he had always had bikes for when he was still mates with his neighbours. Steve elbows the window, reaches in and unlocks the door. From there, the tarp is discarded, and the three bikes are wheeled outside.\n \nAll they needed was a little push in the right direction. Steve didn’t even have to shove anything in their face, just lead them to the answers.\n \n“Okay, so there’s only three bikes so I think that R—”\n \n“Steve. You’re injured. It’s a long way to Eddie’s trailer, so you’re going to have to be a passenger.”\n \nHe has never felt so betrayed by Nancy in his life. Okay, yeah, he was a little beat up, and some of his body was… a little bit missing, maybe eaten. And, yeah, fine, he still felt the sloshing of water in his lungs, or the piercing headache from metal and force of a weapon, but that was besides the point!\n \n(It’s starting to catch up to him, he realises. There are sharp pains in his the soles of his feet that shouldn’t exist because he wore shoes this time. There’s an ache in his fingers when he clenches his fists. Maybe there’s more to this loop than he had realised. A lingering of pain that has been stalled for far too long).\n \nIn the end, he’s riding on the back of Eddie’s bike, clutching onto the edge of the seat. They make it to Eddie’s trailer, and Nancy doesn’t get taken, and this time they tie bedsheets from their end of gate. Steve is the first one to go through, pulling the mattress in place from his side as he helps everyone through.\n \nWhen things go back to ‘normal’, with Max surviving and El not arriving in time, and Eddie dying, Steve doesn’t take the time to think too hard on it. Because he has saved so much time. Maybe, just maybe, and there’s the giddy feeling of hope bubbling up his chest as he slips in the water, he’s saved enough time to be able to contact El.\nIt’s not. Enough time saved, that is, to contact El. By the time that they’re flipping into Eddie’s trailer, and Steve’s rushed to the phone to try and call the Byers’ household, the phone is still busy. The hope has been crushed and bled dry, dissipating into water in his chest.\n \n(He doesn’t know why he thought it would work. The Byers’ phone was busy before they went down, there would be no reason for them to pick up after. Maybe it was foolhardy want, need, for this all to be over. For him to be a step closer to fixing things, a step closer to Eddie surviving).\n \n— — —\n \nPre-loop Steve had come for Dustin’s sake. He had stood there, looking at the coffin as it was lowered, and Steve had rested a hand on his shoulder, on the too-big suit that bracketed his shoulders. It was a short affair. Wayne Munson hadn’t said any words, staring silently as Eddie was put to rest.\n \nAfter, Dustin had approached Wayne, limping and tearful, and talked. Steve waited for him, a sick feeling in his chest as he watched the government personnel slowly file out into their slick black cars, faces blank. He remembers cursing them in his head. Looking at the way that they had so easily shifted blame, accountability, the way that they hadn’t even looked at Wayne or Dustin or the Hellfire Club.\n \nMike had missed it. Too far away to have come back in time, not even knowing until he had stepped onto Hawkins soil and convened with Dustin and Lucas. He had come with such a wide smile, because they had won, and El was able to stop Vecna, and Hopper was alive, and Nancy was okay. Steve had to watch as that smile had crumbled, the way that he shook his head, holding his head in his hands.\n \nThey had never liked each other, not fully. Maybe there was resentment from Mike for how Steve used to be, dickhole-ish and arrogant. But when he had watched him, eyes red and bottom lip quivering, Steve had pulled him close in his arms. \n \n(He remembers how hard Mike had clutched Steve’s shirt. There was a mess of arms and warmth as Jonathan and Will and Dustin and Lucas and El had held them all, together, close, on the pavement).\n \n— — —\n \nSteve is the distraction with Eddie, once. Dustin had protested, but one look from Steve, hands on his hips, and he had followed Lucas and Max into the Creel House. Nancy had gone with Robin, and yeah, maybe it was morbid curiosity of the want to know what happened, to see, to feel, to be there in the last moments.\n \n“You ready for the most metal concert of your life, Stevie?” \n \nHe knew that Eddie was going to die. But there was a smile on his face, a glee unmatched by anything that he had ever seen, just at the prospect of helping, of saving the town who hated him, and it made Steve want to crumble.\n \n“Fuck yeah.”\n \nThey had lugged the amp up atop of the trailer, battery powered and max volume, Eddie had shredded. Steve kept count of the time, cheering and whistling. And when they only had seconds left before the bats arrived, they stumbled down the roof, clutching to the wire gate, out of breath and relieved.\n \nThere was a shine in his eyes that said we did it, and holy shit, and we’re alive. They had stood there, indulging, before Steve was reminded of the vents. But it was too late.\n \nWith no Dustin to boost up, they both run. Maybe it’s the terrified need to protect the girls in the house. Or the need to buy more time for the group not in the Upside Down. Or maybe it’s looking up at the gate and realising that the bats could fly through easily, that makes them bait the monsters.\n \nThey grab the bikes, going as fast as they can, looking back and looking forwards, stumbling and tumbling, before running again. Steve knows what happens next. Has lived through it, once, has known Eddie to die to it nearly every time.\n \nThe bats swarm. There’s a void of screeching and impossibly sharp fangs, tails whipping around at every each turn. Eddie brandishes his shield and spear, stabbing and ducking and crouching. They’re back to back when he says it, shouting over the noise, needing to be heard.\n \n“If I’m gonna die, Harrington—”\n \n“You’re not going to die!” It’s a reflex. A promise. A need.\n \n“Well our chances are looking pretty fucking slim right now!”\n \nA bat breaks off from the mass, tail reaching to drag Eddie back, but Steve is there to grab it and hurl it back to its group with a shout.\n \n“I want to graduate!” Eddie shouts. “I want to have an apartment with two cats, I want to play another campaign! I want to tell my Uncle that I love him, and I want to fall in love!” \n \nThe bats tunnel at the top, trapping what little light existed in this world. \n \nEddie turns to him, smile slight, eyes wavering as he closes them, weapons discarded. “Your turn, Steve.”\n \nIt’s the first time that Eddie has used his name. Not Stevie, or Harrington, or any other nicknames. Just Steve. It hurts that much more, to be called his name, seen and hiding, in the moments before. He brings Eddie close, throwing his spear, watches as it disappears into the sea of monsters. Steve tucks Eddie’s head into his shoulder as he shouts and he pleads and begs. \n \n“I want to see Robin happy, I want to prove my dad wrong. I want to swim in my pool, I want to sleep a full night!” His voice breaks and he knows that he’s crying. Can feel the tears roll off leather jackets and soak into denim vests. “I want to live!”\n \nThey’ve meshed so close together, bats closing in closer and closer before Steve can feel the beginnings of teeth gnawing on his ankle, or the sharp flap of claws. They hold each other as tails are wrapped around their necks, fingers bruising and hurting and holding, as they’re ripped apart.\n \nHe is the distraction with Eddie, once. They die alone, together, alone.\n \n— — —\n \nDuring The Longest Loop, there were two funerals. The one that Steve hadn’t gone to, constructed by suits to create easy getaways and conclusions for the families who laid wrecked and mourning. He had been through it once before, tired and hurt, and he didn’t want to go through it again.\n \nThe second funeral was Dustin’s idea. He had grown closer to Eddie’s uncle after his death, talking and sharing stories, reminiscing on the person he had been — the real person. Not the carefully moulded version that was presented to the public. Wayne had mentioned how he wanted a proper send off, say his goodbyes in peace.\n \nIt was more of a farewell party, if anything. At first, they had wanted to hold it at the Munson trailer, but had soon found that is was bordered off with yellow tape, people standing watch at all hour of the day. In the end, it was decided to be held at Steve’s house. \n \nThey had ordered pizza and sat outside under the night sky, and one by one they had told their stories about Eddie. The had laughed and they had cried, bringing trinkets and post-it notes, dice and love to a fire pit by the pool. And once they were all done, laid bare and open, wanting and finished, each item had been tossed into the fire.\n \nSteve had heard about the way he would conduct Hellfire meets, his frantic and overly dramatic way of monologuing, smiling and laughing when his monstrous creations were defeated. He had learned of the time Eddie had cared for Wayne when he was sick, and the way that he opened his arms and his home to his friends.\n \nWayne had brought a handful of sticky notes from his trailer, scrawled and etched with Eddie’s handwriting. Simple things like “don’t forget to buy milk, fucker”, and “HELLFIRE MEET AT 5PM. DON’T BE LATE”, and “english test on monday :(”. There were the ramblings of lyrics, and misspelled words (“buy graduition garduation school ceremony clothes”), and it was just so Eddie that it made Steve want to cry.\n \nIt was cathartic, in a way. \n \nSteve remembers the way that everyone filed out of his house, some staying in guest rooms and sleeping bags in the living room, and the way that he had stayed outside by the pit. He almost wanted to give up. To stay in this version of the loop forever, where people had gained closure, and told their stories, not knowing the truth, yes, but healing nonetheless. \n \nWith no one to witness by the trees of the woods and the burning stars, he had thrown one of Eddie’s pins into the fire, and with it, a promise to save him.\n \n— — —\n \nSteve asks for Eddie’s vest before it’s thrown in his face. He uses the exact words that are normally said to him (“For my modesty?”). There’s a part of him that revels in the way that Eddie’s face flushes under the red-blue of the sky. Feels content at the way hands or on his, guiding his arms through the denim.\n \n“It looks better on you, anyway.” He had said, turning his face away, straightening the collar, hand brushing the back of Steve’s neck.\n \n“Mhmmm. Maybe I should keep it, then?”\n \n“You have a habit of stealing from the poor, Stevie?”\n \n“Only from you, Eddie.”\n \n— — —\n \nHis funeral is a constant. It’s a rushed amalgamation of government suits trying to push blame of the Vecna victims onto his dead body, brandishing him as a murderer to his grave. Steve lives through Eddie’s funeral three times: before the loop existed, in The Longest Loop, and now.\n \nAfter the failed attempt at contacting El, Steve stops trying. Just for a couple loops, resting, thinking, planning. He stops and lets things happen, a voice in the back of his head telling him this is how it was always meant to be. El is too late, Max is in a coma, and Eddie dies. \n \n(Somehow, between the fractures of guilt filling him in at the seams, he’s happy that Jason died this loop. Steve can’t imagine the shit show that would have occurred if he had been here, watching these people grieve).\n \nSteve watches the silent tears of Wayne Munson as the empty coffin is lowered, ugly and raw, watches as Dustin places a Hellfire t-shirt on the wood. This time, the third time that Steve has attended Eddie’s funeral, he approaches Wayne.\n \n“Eddie meant a lot to,” Me. He wants to say. “A lot of people. I know that he didn’t do what they’re saying he did, Mr Munson.”\n \nWayne nods, turning to look Steve. “You knew my boy well?”\n \nHe must find something within his eyes, see the distress and the days, the conversations that don’t exist anymore, knowledge that he should not have, because Steve is being pulled in close, arms around his shoulders. \n \nMaybe he doesn’t deserve this. To cry over someone that he isn’t meant to know, to be able to seek comfort in others. There’s a blossoming of guilt, building and building. Steve can feel it in the way his hands shake, or the way his teeth ache in sorrow as he rests his head on Wayne’s shoulder and weeps.\n \n— — —\n \n“How did you know Eddie?” \n \nLater, Dustin questions him. They had escaped to the empty halls of Steve’s house, sitting on the couch in the living room and, where Steve had held the kid until his breathing had evened out, and his eyes were drier.\n \n“He never mentioned you, and every time I brought you up, Steve, he would be so weirded out at how you were no longer an asshole.”\n \n“Hey, that feels a little unfair! I wasn’t even a dick to him!”\n \nDustin levels him with a look that Steve swears he has used on the kids before. He almost wants to dodge the question, or tell the teen about the loops and the impossible task of saving everyone that has been placed upon his shoulders, and his alone. \n \n(He remembers the haunted look in Robin’s eyes as he had slipped into the pool. Steve decides that the kid’s been through enough).\n \n“Trauma pulls people together. Going through all that shit with him in the Upside Down, and getting to know who he was, only for him to die?” Steve breathes. “It’s a lot.”\n \nHe’s known Eddie for so long, so little, of time, that it feels disingenuous. When Dustin starts telling Steve about him — stories of campaigns and lunch monologues and fake monsters — the overwhelming feeling of nothing that happened was real starts to take over.\nSteve tries to talk with El. He knows he has to contact her, knows that her early arrival will save Eddie. But details are hazy on her end — a teenager with guilt and mourning and acceptance that her dad is actually alive after holding a funeral for him, isn’t exactly in the best headspace to relive some trauma for a guy she barley knows.\n \nIn between it all, in between the lying and the planning, Steve spends time with people. \n \n— — —\n \nIt’s easy to convince the group to let him go with Erica. Something whispered about protecting her, and Jason’s goonies on the loose, and in no time Steve is sitting on the edge of a playground. He knows (partially) how this plays out. Someone spots Erica or the lights on in the house, tells the basketball team about it, and then go to beat the shit out of some kids. Real great moral compass they’ve got there, huh?\n \nHe doesn’t know how he missed it (how anyone missed it, how it was never mentioned or helped), but Erica is shaking. Her hands are tight around her flashlight and her walkie, and when she lets go, there’s a quiver to her hands.\n \nSteve decides not to say anything. Without having gone through this before, without being able to see outcomes and plan responses, he knows that it’s not what she wants. She doesn’t want to be held tight and close, she doesn’t want it to be mentioned. Instead, Steve lets it go. Promises himself that when this is all over, he’ll talk and he’ll joke and make sure she’s alright.\n \nSteve spots him before Erica does. There really should be no reason to worry about him — he’s just some guy taking a walk at night — but there’s a gut feeling throughout Steve’s body that tells him that this is the one. Maybe it’s in the way that he pauses in the middle of the street, looking. Or the way that his face crumples into a sneer.\n \n“I’ve got a bad feeling about this.” Steve says. \n \nAs it turns out, Steve has gotten better at fighting. When the one with the cap, he doesn’t bother to know his name, doesn’t think he wants to, races out and starts to chase them, Steve blocks the space between the youngest Sinclair and the jock.\n \n“Erica, call a code red.” She’s running. Fumbling with the walkie as she stays behind Steve.\n \n“Oh how the mighty have fallen! Didn’t know that you hung out with little girls, King Steve.” \n \nMaybe it’s the nickname that does it. Or the bone-ache in his fingers, his lungs, his neck. Maybe it’s the anger at the jock for being part of the witch-hunt, or anger at the world for making Steve go through this shitshow. He doesn’t know what it is (tries not to think about it too hard), and throws the first punch.\n \nThe jock swing wide. His punches are sloppy, not precise, and it’s clear that he’s never been in a real fight. Steve uses his elbow to throw it into the goon’s face, not bothering to hide the satisfaction that the resounding crunch! gives when his blow lands.\n \nSteve’s first thought as the jock is pushed back, is that he is so much easier to fight than a Demogorgon.\n \nHe stumbles, nearly falls down if not for the metal bars of the playground keeping him up. He tries to punch again, arms weighing down and heavy, sinking. And Steve is standing there, ring around his neck, pound of flesh missing, with no more injuries to add to the count.\n \nThere’s a mess of red dripping to the floor, and Steve is a little more fucked up than usual, a little more angry, a little less patient. \n \nHis voice is low as he crouches to meet to meet the basketball player’s eyes. “You’re gonna go back to Jason, and you’re going to tell him to call of this witch-hunt.”\n \n“But—” Erica kicks the jock in the knee. Steve would be lying if he said he didn’t feel a little proud.\n \n“No. You are going to talk to him, and say that he was wrong, and make him apologise.” \n \nThe jock’s eyes swing down to the red around Steve’s neck, the dirt and the blood still fresh near his forehead. He nods. Steve sighs, stands up, watches as the high schooler scrambles his way down the street, into the dark.\n \n“We make a pretty good team, hey?” Steve is smiling, now. He’s changed something. Erica doesn’t get beat up or pinned down, this time. He changed something.\n \n“Don’t think this means that I’m gonna hang out with you, nerd.” \n \n— — —\n \n“I would pray that something would happen to him.”\n \nJust like Eddie’s funeral, it feels like an intrusion. Like he isn’t meant to be here. Max speaks about Billy in a way that makes Steve want to stop the plan — to slip on her headphones and let her cry and hold her until she sleeps.\n \nBut he sits, quiet, hears the private stories of a Billy.\n \n“Did he do this to you? The freak?” \n \nJason is as clueless as ever. He sees a girl in front of an altar, and Steve Harrington with an angry wound around his neck, and concludes that Eddie is the one who orchestrated everything. Despite him not even being present.\n \n“You do not want to be here, man. You need to leave.” \n \nThere’s an edge to his voice that he hopes will convince him to go. He knows, from experience, that it won’t work. When Nancy and Jonathan had tried the same thing on him, he had all but rushed in head first and, well. Look at where he is now. Jason stalks into the room, on the outskirts, feet steady.\n \nSteve has his hands up in what he hopes is a placating motion, stepping around Max so that she’s out of the range of fire. When he’s close enough, can see the way that Jason’s eyes are sharp, and the tired disposition of his frown, Steve knows that he’s made a mistake.\n \nUnlike the jock with the hate, Jason has been in a fight before. And probably won more fights than Steve has (do inter-dimensional monsters partially defeated by superpowered teenagers count as fights that he’s won?). His punches are quick and powerful, and when he pushes his shoulder into Steve’s chest, he’s reminded of blonde curls and a plate smashing over his head and a voice telling him to plant his feet.\n \nMax starts rising. It’s horrifying in a way that he wouldn’t be able to comprehend if he hadn’t seen it happen before. Jason is stunned, for a second, and that’s all it takes before Steve has kicked his gun away from him and slammed his knee into the jock’s chest.\n \nShe’s just started to float to a height impossible to reach, when Steve has slammed the headphones down on Max’s ears, played the tape, and hoped that he did this right. When her arms snaps, he wonders how Lucas had even managed to smile after the battle.\n \nSteve holds his breath as she stays still, the faint playing of Kate Bush echoing throughout the blue-lit room, Jason in a heap in the corner. He counts the seconds before Max is falling, landing on her ankle weird, and Steve pressing her head into his shoulder.\n \n— — —\n \nHe spends most of his time with Eddie. Before, he would make an excuse as to why he did it (something along the lines of he dies, and I want to know him before he goes or he deserves to be listened to or this is for Dustin). Now, after hundreds of deaths, and more injuries to count, he can admit it’s because he likes him.\n \nSteve talks to him in the woods, in the van, tries (and fails) to flirt with him. There will be times when he catches a flush on Eddie’s cheeks, or when it’s mirrored onto Steve’s. Once, when Eddie was explaining how he learnt how to hotwire cars, and Steve had waited for him to say the line that he realised he loved, Eddie had leaned in and kissed his cheek.\n \nRobin had groaned. Said something like get a room, losers, and later complained that he got kissed (albeit, on the cheek) by a guy before she did with a girl.\n \nAnd, yeah, nothing dramatic changes. El is still too late, and Max is alive, and Eddie is dead, and Steve is slipping into the pool at the end of the loop. But something had changed between them, because every loop thereafter, it had happens again.\n \n— — —\n \nRobin, Steve decides, is the best person to ever exist. Each loop he tells her, and each loop she’s worried, and each loop they come up with new plans.\n \n(“Okay so what if you tried to contact El before you do—”\n \n\n“Tried that.”\n\n \n\n“Then… could you contact Suzie’s hou—”\n\n \n\n“They’re already gone by the time we can call them.”\n\n \n\n“What if you—”)\n\n \nThe plans don’t work, most of the time. But it’s nice to know that he has someone on his side. Occasionally, Steve will tell her of moments from The Longest Loop. Of the way her and Vickie grew closer, or the way that she was happy. He almost wants to tell her about Will, but decides that it isn’t his secret to tell. Even if she won’t remember.\n \nHe doesn’t know what loop it is, somewhere between a failed plan and a messy death, that Robin stops listening as they make their weapons outside the van. They’re brainstorming, again, trying to think of a way for Steve to talk to El once she comes back to Hawkins, before he resets the loop.\n \nHer fingers reach out so slowly that it stops Steve in his rambling. “What are you doing?”\n \nShe doesn’t say anything. Her fingers are brushing against his hairline, cool palms on the sides of cheeks, and he’s reminded of the first time he told her about the his dilemma.\n \n“In The Longest Loop, how did you say you died?”\n \nHe sighs. “Robin you know this, I used Hop’s gun and—”\n \n“Shot yourself.”\n \nJust as soon as her fingers were on his forehead, she’s vacated them to pull his hands towards her face. She eyes them suspiciously, and Steve isn’t afraid to admit when he’s fucking confused.\n \n“Mind clueing me in on what’s happening here?”\n \nRobin is pulling him towards the mirrors of the van, pushing him until he can see his face clearly. The first thing he notices, is that he looks… tired. And not just trying-to-save-the-person-you-maybe-might-have-a-crush-on-because-they-won’t-stop-dying-and-you’re-in-a-timeloop tired. there’s an ache to the way that he moves that he didn’t notice before, a crease between his eyebrows that didn’t exist pre-loop.\n \nIt’s the first time that Steve’s seen himself in a mirror in years.\n \nRobin is still hovering. She’s looking at a spot on his forehead, slightly paler that the rest, devoid of freckles or moles. Right near his hairline, where Robin had placed her fingers, is a pale, crescent shaped mark and—\n \n“Oh.”\n \nSteve thinks he knows why Robin asked about his death, now. He looks down to his fingers, sees the way that they bend slightly, redness and bruising near his knuckles. It only happened once, he wants to say. And not even in this loop — so why? \n \nThere’s a memory of shoving his fingers underneath the tail of the bat, being dragged away, feeling the snap of his bones. It only happened once. It happened ages ago.\n \nHe always knows what to do. When they were running away from the Russians under the mall he had held the door shut, lead the kids to safety. Screeches and lights were flickering and he could have just gone to his car, but he still raced in and gained the moniker of Monster Hunter when he had seen the Demogorgon. He had lifted kids out of the tunnels, too-light, so small, braced himself for death.\n \nWhen he turns to Robin, he’s lost. His fingers are bent, there’s a crescent shaped scar on his forehead, and it feels like there’s water in his lungs. For the first time in years, he doesn’t know what he’s supposed to do.\n \n“I think we need to find a way to stop this loop, Steve. Fast.”\n \n— — —\n \nHe stops resetting the loop early. He doesn’t let it run so far that the second battle starts, no, can’t bare to watch Joyce get flung across the street, to hear Will cry. His deaths and his injuries are catching up to him, and Steve? He’s lost. \n \nOne day, when Robin has stayed over to try and help him figure everything out. They catalogue his hurt. They make a list of injuries and scars that should be appearing Steve’s skin. \n \nHe has bite marks, uneven and puckered, in places apart from his stomach, from when he was the distraction. His bones shift underneath his skin in a way that hurts, when pushed too far (thanks, Vecna!). There are scratches and cuts on the bottom of his feet, days and days of running without shoes in the Upside Down making themselves known.\n \nThere is a story, messy and incomplete, etched into his self, ever-shifting and yearning for a moment of respite. Somehow, seeing everything laid out on his skin, the pain and the death and the years, hurts more than the injuries themselves.\n \n— — —\n \nHe hugs Hopper. It’s nearly a week from where he normally resets the loop, and a couple days before Max usually dies. But Max is alive this time, and Steve is trying not to die as much, now that he’s started to feel things catch up to him. \n \nWhen he reaches the cabin in the woods, and Hopper opens the door with tight eyebrows, slowly, cautiously, and Steve has stepped through the threshold into the warmth of and homeyness of the building, Steve hugs him.\n \nHe thanks him for what he did at the mall. He thanks him for killing the monsters in Russia. He thanks him for anything and everything that he’s done for the town and for Joyce and for the kids. (Silently, he thanks him for taking him in, and for looking out for him. For being more of a father than his dad ever was).\n \nSteve’s never seen Hopper cry. Pretends that the wetness on his shoulder is something else. When El comes out of her bedroom, tired and sleep-rattled in the morning sun, she takes one look at Steve and Hopper and joins their hug.\n \nThere’s a bond that forms between him and the girl. Something that he could have cried over because he’s so close to figuring everything out, so fucking close. He knows that the loops are endless, that he can have as many chances as he wants, but Steve finds that he doesn’t want to die, anymore.\n“You’re different.”\n \nIt’s said exactly two weeks and three days from when he normally resets the loop. Steve doesn’t know what’s changed, what has become different, in that amount of time, but as he sits in the Hopper cabin, El blindfolded front of him, TV playing static, she speaks.\n \nMaybe it’s because she saw him hug Hopper. Saw them cry and thank each other, holding on to the little amount of normalcy that existed. He’s been trying to talk to her, properly try and figure out what had happened. \n \nShe’s staring at him. Steve’s sat on the couch in the living room, and El was sat on the floor. Her eyes trail across his face, searching and finding the world weariness, the phantom age that he knows he doesn’t show on his face, the injuries that he knows he does. \n \n“We lose, don’t we?” She said, both questioning and not. \n \nSteve doesn’t answer, doesn’t know how to possibly answer that question, because things have only just started to turn back to normal for her. All this time hasn’t made him good with words, so he just slips down onto the floor and rests his hands on her shoulders.\n \nEl cries. As they sit there in the barely put together cabin, sunlight leaking through the roof, she weeps. She cries and she cries, and Steve holds her, for as long as she needs it. He has so many questions to ask her, to try and fix things, to try and understand. But, for now, he thinks that the comfort is more important.\n \n— — —\n \nSteve and Robin stay over at the Hopper cabin, one night, to explain everything to El, to try and brainstorm and learn how to fix things. \n \n“I’m stuck in a time loop.”\n \n“A what?”\n \n“It’s like,” Steve tries to think. How is he meant to explain what’s been happening to him in a child-friendly way that still communicates what he’s actually been through? Robin gestures towards his watch, and he thinks he gets the ideas. He takes it off, shuffles closer to El so that she can see the face clearly.\n \n“You see this hand moving? Yeah, the big one.” He turns the dial on the side of his watch until the big hand reaches back around to where it started. “That’s how we normally go through things, right?”\n \n“Okay.” El nods.\n \nSteve twists the dial the other way, watches as the hand moves backwards. “Now, this is how time moves for me, when I die. Backwards. \n \nRobin chimes in, “El, you see the little hand? That would be us. It moves back into place as well.”\n \n“And that’s how this happened?” El points to his neck, his forehead, his fingers.\n \n“Yes.”\n \n“I saw you.” She says. “In your head. You were hurt.”\n \nRobin makes a confused face, eyebrows scrunched and head tilted, but Steve hopes that she didn’t see the deaths. He pleads against all else that she didn’t see the three weeks  after, or Max. \n \n“Is that why you said I was ‘different’?”\n \n“You are different.” El frowns. She makes an aborted movement to reach her hand out towards his neck. There’s more that she wants to say, Steve knows it. Her hands fall to her lap, and the watch is placed back on his wrist, and the conversation ends.\n \n— — —\n \nHopper lets him sleep on the couch for the next couple of weeks. Robin makes the trek every morning, opting to stay with Vickie for the meantime. He doesn’t question when he wakes up in the morning to Steve making pancakes, or when the lights are kept on at night. They have to shift by each other in the hallways, cramped and close, and it feels more like a home than the Harrington Household ever has.\n \nWhen the (not former anymore) Chief goes to work, he and El brainstorm. \n \nShe wants to know everything that happens, tries to help out how Robin did. But Steve is wary in telling her particular things: about turning Hopper’s weapon on himself, or Robin covered bat carcasses, staring straight ahead, unseeing. He decidedly does not tell her about shouting into the void about the future, or what happens when a gate closes on your own body.\n \n“You haven’t met him yet, but you are gonna love Eddie.” Steve decides to tell her about the good, instead. And if Robin is giving him a certain stare, eyebrow raised, he choses to ignore it. “He played dnd with Mike, and he had all these cool tattoos—”\n \n“Like me?” El’s pointing towards her wrist, tapping it with two fingers. She says it with such earnest inquisition that it breaks his heart a little bit. For a second he’s reminded of the sickly fluorescent lights of the hospital, dull-sharp sounds of his own voice failing.\n \n“He choses them himself. Eddie once told me that he actually designed some of them himself.”\n \nThe kid’s eyes have lit up and she’s rushing back to her bedroom in a flash before she’s reappeared with a notebook. She flips through the pages, landing on the thing she wants to show Steve, and shoves the paper under his nose. Robin has leaned over Steve, draping herself over his shoulder to get a better look at it.\n \nIt’s a drawing of a girl. She has one hand on her hip, the other raised in a fist in the air. It’s just a little stick figure drawing, messily scrawled onto the underside of what Steve thinks is a letter, but by the billowing cape behind her, he knows exactly who this is meant to be.\n \n“A superhero.” He says. Steve knows what she thought of herself, heard the story from Will as he asked for advice. When El breaks out into a toothy grin, he hopes that she’s changed her mind.\n \n— — —\n \n“They did what?” \n \nSteve decides that most children suck. El tells him about California, and how she had been arrested and then transferred to Project Nina, how she had learnt about Vecna-slash-Henry-slash-One. She tells Steve about what had happened in Max’s mind, how Brenner was dead. El tells him the number that Owens had phoned on, and Steve all but shouts because this is what he’s been waiting for.\n \nAnd through all of that, El seemed fine. She talked about the horrors of the experimentation, or remembering, or living through her years in the Hawkins Lab again. She says it all with a straight face, stating what had happened as fact. \n \nWhat seems to get her, though, is the mention of one girl: Angela. \n \n“I hit her face with a roller-skate.”\n \n“Good!” Robin says. She lifts her hand up in the air, and El looks at it for a moment, before a toothy grin breaks out on her face and she’s jumping to slap Rob’s hand with her own.\n \nSteve has been pacing around the room as El recounted her story of Angela and the way that they had lead her onto the rink, humiliated and bullied her. “You did everything right, El. You asked her to apologise, but she didn’t. I’m sure Hop would agree with me here.”\n \nEl turns to him, standing next to Robin on the other side of the room. Her face turns so that she’s looking anywhere but his face, and he’s reminded of how he’d react when he was in trouble with his father. \n \n“You…have told him. Right, El?”\n \nShe shakes her head. \n \n“I’m just gonna,” Steve points his thumb behind him to the door. “I will be right back.”\n \nSee, the good thing about the loops, is that Steve can say that he’s been cigarette-free for a good couple years. He hasn’t really had the time (as ironic as it is) to sit around and smoke. But as El talks about her past week, he thinks he deserves it.\n \n— — —\n \nSteve tells them about the start of the loop: the importance that he thinks it holds. They compile a plan surrounding it, using the bits and pieces that Steve has, sewing them together in a collaged mess with El’s. Robin simplifies it, makes it easier to remember, before Steve is marking it into his memory.\n \n \n“We’re gonna need to be able to convince Dustin.” Steve says. “Kid barely listens to me when I have evidence — there’s no way that he’d just believe me.”\n \n“Then we call him now. Try and set something up for when you reset.”\n \n— — —\n \n“Is this some kind of joke?”\n \nSteve, for what feels like the millionth time, decides that Robin is godsend. She believe him so sparingly, so easily, every loop, and he can’t begin to think how much longer he would have spent if she didn’t put her trust in him as soon as he opened his mouth.\n \nDustin freaks out (understandably). Robin, El and Steve are huddled around a walkie as they sit in the middle of Hopper’s living room. As the kid’s static-y voice filters through the device, Steve feels a fond exasperation at the suspicion in Dustin’s voice.\n \n“Not a joke, trust me. And if it is, I’m the one getting the short end of the stick.” Steve says. “Look, it doesn’t matter if you believe me now. I just need to know if there was something that I could say or do to convince you when I… reset.”\n \nEl nods, adding, “Friends don’t lie.”\n \nThere’s a pause as Robin leans her back against the couch, feet crossed in front of her. El is staring pointedly at the radio, as if she can magic up a solution (Steve wouldn’t put it past her. If he gets time looping, and she already has mind-move-y powers, he wouldn’t be surprised if she could create a solution out of thin air).\n \n“Dustin?”\n \n“I’m thinking!” Steve taps his fingers against his thighs, leg moving in place as he waits. “Just, speak how you were speaking now.”\n \n“What is that even supposed to mean?”\n \n“I don’t know! You sound… tired. Older. It’s not— even when Max was lifting up into the air, you had this, lightness about you. I’ve been trying to search for it ever since you came back through the gate, but.”\n \nRobin has shifted closer, hand resting on his back. She rubs small circles into his shoulder blade, and he can feel the cool angles of her rings give a slight pressure as she does. El has stopped staring at the walkie, and is instead staring at the pale crescent near his hairline. \n \nSteve wants to cry. He’s lost so much time in this repeating cycle, and sometimes he forgets that he isn’t invincible. There’s a dampness to his eyelashes as he blinks it all away, wills his past-future deaths to be still, if only for a moment. Speak like he does now. With authority. With Exhaustion. With hope.\n \n(It won’t be enough, and he knows it. It never is).\n \n“Dustin, I don’t think that that’s going to work.” Robin’s hand on his shoulder feels like an anchor. After all of this is over, he’s never going to stop telling her how much he loves her.\n \n“Then just tell me something that happens in the next thirty seconds as you start your loop. There literally isn’t anything more convincing than predicting the future.”\n \n“Steve doesn’t have thirty second to spare.” Robin says.\n \nIt feels as if time is moving thick in the air, everyone paused and frozen in this moment. El has adopted Steve’s habits, fingers drumming against her legs as she frowns and tilts her head. Robin’s hands are clutched around the walkie as if it’s the only thing to save her. Steve decides that it might as well be.\n \nIt feels useless. The loop is slowly dying, bursting at the seams of stress and the fatal projections of failure, with no one left to believe him. Steve shifts his legs underneath him, tries to get comfortable, and he’s reminded of the newfound crookedness to his limbs that makes him want to cry. \n \nIt hurts. But he is so close.\n \n“What if Steve tells you something that he couldn’t possibly know? There has to be something that would be impossible for him to know?” Robin is frantic in her speech, time moving normally.\n \nThere’s a moment of static that Steve recognises as Dustin thinking. “In 1983 I offered Nancy a slice of sausage and pepperoni pizza while she was on the phone with her friend.”\n \nBetween the exhaustion and the relief, there’s a laugh and a cry. Sitting next to Robin and El, huddled in Hopper’s cabin, it feels safe. Before Will had been taken, and Barb had died, and being beaten and tortured. In the mundane before, Dustin had offered Nancy a slice of pizza.\n \n— — —\n \nHopper find them asleep on the couch. Steve wakes almost immediately — the sound of the door opening jump starting his brain as he watches Hop hang his hat on the hooks by the door. The man doesn’t say anything, but takes one look at the way that they’re huddled, El tucked into his arms, uncomfortably squeezed together in front of the TV, and joins them.\n \nThere’s more sharp edges and limbs than Hopper used to have, Steve thinks, but there is still something so warm about the way that he crosses the room and drapes a blanket over them. And maybe, when Hop looks into his sleep bleary eyes, owl-blind in early sun, he sees something older, something different.\n \nSteve knows that in the morning he’ll be slipping back to his own house — the pool calling and yearning for him to slip under. As Hopper exits the room, closing the door with a softness that Steve has never known, he makes a promise, to no one and everyone.\n \n“I am going to fix this.”\nComing back sucks. It feels like being pushed against the thresholds of his own brain, a pounding headache that not even a hangover, or Jonathan, or Billy, or the Russians could create. There’s the recollection of his senses — arms on boat, the smell of Eddie’s hair, Robin’s foot bouncing. His hands are halfway to untying his shoelaces when he does them back up, tighter, and grabs the radio out of Robin’s hand.\n \n“Dustin,” he says. He doesn’t do anything to his voice, just hopes to all hells that Dustin will believe him and hear the exhaustion, hear the age, in his voice. “I am stuck in a time loop. You offered Nancy a slice of sausage and pepperoni pizza in 1983 before Will disappeared. You need to listen to everything I say.”\n \nEddie is looking at him with wide eyes, and it’s the first time that Steve realises that Eddie must be having the worst week, and it’s probably about to get a lot worse. He’s wasted five seconds already. It takes a full minute for all of them to breach the gate. One minute and forty seconds is all it takes for the bats to appear, to wait for them.\n \nHe breathes deep for a second before pressing the button again, “Dustin? I said that—”\n \n“What do you need me to do?”\n \nSteve could almost cry. Because the kid listens for once, and he loved stubbornness, he did, really, but when he has to live through the same arguments every single day, it gets a bit tiring. Fifteen seconds. He leans his head back, clutches the side of the boat and says only what he needs to, for now, says what he knows will keep them safe.\n \n“The cops will be here in five minutes. Your parents are looking for you. Book it to Eddie’s trailer, where Lucas and Max will break through the gate in the ceiling and tie together bedsheets, and Dustin will call Sam Owens and tell him everything that has happened. We will meet you through the gate.”\n \nSteve stops talking and puts down the walkie. He knows that it never survives, even if he wraps it in Eddie’s plastic bag, so he tunes out the faint sound of static as he watches the kids’ lights leave the trees. Fifteen seconds gone.\n \nEddie is still wide eyed, but his hands are shaking, so Steve reaches for them. That only makes his eyes widen more, and Steve has to remember that Eddie has, technically, only known him for a couple days. There’s a moment mourned for the time spent (lost?) in this loop, before Nancy is clearing her throat and asking what to do.\n \nThere’s a set determination in her eyes and he wonders if she can see it. The way that he holds his shoulders lower, less headstrong, more calculated, the way that his eyes don’t waver. He wonders if she can guess that he’s done this before: the dive, the fight, the death. \n \nIt’s the only explanation he can come up with as she nods along to his words, that, yes, there is a gate down there. And, yes, they are going through it. The kids will be fine without them, and they need to be wary of the bat-adjacent animals that will be waiting for them once someone breaks through. He warns them of the long tails and the razor sharp teeth. Twenty seconds.\n \n“Once you break through the threshold, you run like hell. Don’t look back, don’t try and be a hero,” the words taste like ash in his mouth. “You get to the treeline, and hide at Skull Rock. Wait for us all to regroup there. We then go to the shed of Reefer Rick’s place, we get the three bikes, yes I know, only three, and we go to Eddie’s trailer. There will be a gate there that we go through to get back, and we’ll see the kids there. Do you understand?”\n \nNancy is strong in her nod, face set, and that spurs Robin to be more confident. Steve is still holding Eddie’s hand, so he gives it a squeeze, tries to say I’m sorry, I tried, I’ll save you this time, I think I’m in love with you, but settles for reassurance. Twenty-five. \n \nHe takes off his sweater, dives down first, and it’s the familiar cool of the water again: a constant. He always has to dive, and he always has to die. Steve’s the first one to breach the gate, and he pulls the waiting arms of Robin and Nancy as they break through. He watches them catch their breath before he’s already pushing them to go, but Steve waits, and god, he hopes that he’s done this right.\n \nThe bats circle a minute away, but he isn’t afraid. There’s a pain in his stomach that he knows will never fade, and a ring around his neck that he’s sure is burning red, but that doesn’t happen this loop. And there won’t be a next time. He holds his breath, sees the girls enter the treeline.\n \nEddie’s hand breaks through the gate and Steve lifts him out, stumbling and nearly falling on a pulsing, black vine. Steve could almost cry but this wasn’t even the hard part, so they run and they run, until they see Skull Rock.\n \n— — — \n \nBy the time they stumble out into the cramped space of Eddie’s trailer, Steve is watching Robin flop onto the mattress surrounded by Dustin, Lucas, and Max. Steve lends a hand up to Nancy, and sighs in relief when she makes it through, closes his eyes and rubs his brow before offering a leg up to Eddie.\n \nThe image of Nance floating is burned into his retinas, but the thought is swatted away when Eddie playfully pushes his head down to gain height on the rope.\n \n“Hey! Watch the goods, Munson. I’m the only thing holding you up right now, remember?”\n \nEddie smiles in such a way that is just so Eddie, before letting go of Steve’s head in favour of grabbing the rope. “As if you’d let me fall.”\n \n(Steve almost wants to step back, just to watch him flounder and fall on his ass, because he knows that with all the fanfare and theatrics, comes a surprising amount of mis-coordination. But then he hears the screech of something outside, and his mind is supplied with hurried Metallica and the open vents and, holy shit, he needs to get out of here).\n \nAs he climbs the rope, he sees Dustin already on the phone, and he knows that this time El has been contacted, that she knows about Vecna/Henry/One, and she knows that Mike, Will, Jonathan and Argyle are on their way.  Owens has been informed about Brenner, and the way that he turns on them, and the military personnel and being hunted. \n \nSteve’s not religious (and if he did somehow find faith, he’d scream at god why the fuck have you been killing my friends) but in the split second that Dustin nods at him and they pile out of the trailer towards his big, empty, house, Steve thanks god for Sam Owens.\n \n— — — \n \nHe tells them what happens (what has already happened? What is about to happen?). \n \nThere’s a disbelieving glare from Lucas as he crosses his legs on the couch, but Nancy and Robin and Eddie and Dustin are silent as Steve mentions the important parts, the parts that don’t hurt: El, Will, Mike, and Jonathan don’t arrive in time. Argyle… is someone they meet. El slips into Max’s mind to fight Vecna from California. Hopper is alive. Joyce is breaking him out of prison in Russia. \n \nHe watches as everyone digests, almost laughs at the way Eddie questions everything. “Hopper who died in the mall fire?” which turns into “You got tortured by Russians?” which turns into “You’ve been killing monsters since ‘83?!”\n \nSteve continues, sighs as they move closer to the hurt, the festering wounds. They lose. In two days everyone is in Hawkins. They get peace for three weeks before Vecna comes back, and they lose again.\n \nEddie is fidgeting at Steve’s side, sitting so close that they brush thighs. He wants to focus on that, wishes that he could focus on the warmth, and the beating of his heart because Steve is going to save him this time. But he can’t. Steve can’t look at him as he states what happens, the parts that hurt, but not as bad as what comes next, because it has to come next, he knows it will, even without experiencing through this loop yet.\n \n“Who dies?”\n \nIt’s Nancy that asks the question, because she’s being pragmatic, she’s being practical, she’s trying to asses the damage and try and figure out a way to save everyone. Steve glances up from his hands to see that everyone is staring, that Lucas is looking at Max, that Dustin is looking at Eddie, that Eddie is looking at him.\n \n“Max dies,” he swallows. Watches Lucas tilt his head back and sway in a way Steve knows is to quell tears. “Our plan fails and Vecna gets her. El brings her back, but she doesn’t survive the three weeks after.”\n \nSteve waits. He watches as she processes through the Kate Bush ringing in her ears, and he prays to any god that this doesn’t fuck up her favourite song. He watches the cold resignation, fear maybe, as she stares at Lucas’s hand around hers.\n \n“And,” Steve chokes. He looks at Eddie and then looks away because he can’t, he can’t look at him because his face is there, innuendo’s and black bandanas, black blood mixing with red. Steve sees the way Robin looks at him, watches the way that Eddie stills in his fidgeting and vague attempts to comfort Max before they catch eyes. “Eddie dies. In the Upside Down. Buying us time.”\n \nEddie doesn’t cry. He doesn’t move. Instead he stops moving, leg stilled next to Steve’s on the couch. There’s a sense of finality in the words that Steve says, and now he wishes that he hadn’t said them at all. \n \n“How do you restart the loop?” Eddie asks. His eyes aren’t focussed on himself, and Steve just wants to hold him, wants to tell him that he can fix this he just needs more time. “You said that the longest loop was three weeks, and the shortest was—”\n \n“Three minutes. Steve, please tell me that you can just snap your fingers and restart?” There’s a pleading tone in the way that Nancy says his name, like she knows what’s coming.\n \nHe glances to the pool in the backyard, blue glow seemingly illuminating the woods, taunting him, “I thought it was just the days of the fight. The loop. It always starts when I’m about to dive into Lover’s Lake, and it always stopped when—” He looks at the faces of the kids around them (barely kids anymore, teenagers, young adults, they hadn’t ever gotten to be kids, really), as he continues. “It always ends when I die.”\n \nThere’s staring and there’s silence, and he wants to take it back, feels the hot legs of shame prickle his skin, like spiders crawling across his back. Eddie is looking at him, eyes wide and glazed, as his eyebrows furrow in silent question. Steve thinks he knows what he’s asking, glances at the pool, and nods.\n \nDustin is too smart for his own good, Steve decides. He questions when these kids had to grow up so fast, thinks back to what he was doing at their age. As Dustin is staring down at the walkie clutched in his hands, he walks across the room to burrow into Steve’s side. He can feel tears start to well up inside of him, but just rubs Dustin’s arm and pulls him close.\n \n“That’s three deaths then, right? And you- you found a way to stop yours from happening, from getting taken by Vecna or the Upside Down? So, we can— we can do this! You’re—”\n \n“Robin.” He whispers it, watches the frantic way her eyes move around the room and she waves her arms, as if trying to summon something to save them. She’s always worried about him, whenever he tells her. They just never had an audience. Max is staring straight ahead, Lucas beside her. Steve avoids Eddie’s eyes as Nancy purses her lips and looks at Robin, breath stuttering.\n \n“—Right here, so that has to count for something—!”\n \n“Robin.” \n \n“—And, if you could get away from that, that thing, then maybe there’s a way to—”\n \n“Robin!” Her mouth shuts with a click. \n \nHe can hear the hum of the pool, the shuffling of feet on the white carpet, a faint echoing of Kate Bush. Steve looks at her, at the way that she’s clasped her hands in front of her, at the way that Eddie is staring at his face. \n \nHis words are spat and punctuated in a way that makes his voice waver, “It wasn’t Vecna or the Upside Down, most of the time it was me. If I die, the loop resets and I get another chance at saving everyone, and nobody has to—”\n \nRemember. Nobody has to live with the guilt. He doesn’t have to watch Lucas lose himself. He doesn’t have to watch El burn out. He doesn’t have to see the way Will and Jonathan rush to the body of Joyce, or the way that Hopper screams. He doesn’t have to see Robin jump at a ticking clock, or Nancy leave. He doesn’t have to watch Dustin and Wayne and Mike cry over an empty coffin because they couldn’t even bring his body back. \n \nIf Steve dies, then he can fix things.\n \nIt’s the first time in a while that he doesn’t know what comes next. He’s dove into the water hundreds of times. Screamed as his flesh was torn apart, heard Master of Puppets in the distance and held back tears. Felt Max’s cold, small hand in his as she laid in the hospital bed. There are things that always happen, no matter how hard he tries: El doesn’t arrive in time. Eddie dies. Max is put in a coma. \n \nSteve fails. They lose.\n \n“Steve, how many loops have you been through?”\n \nHis head is nodding, and his eyes are watery, and Eddie has approached him like a spooked animal.\n \n“I lost count.”\n \n— — —\n \nHe’s sitting by the pool when Eddie finds him. Waiting is always the worst part. In one loop, he manages to stop them from fighting, from entering the gate by saying that there was nothing. They convened back at the Harrington household, stumped for ideas, when Max started lifting. It happened at the same time as when she was normally in the Creel House. That’s when he realised that Max had been marked, and Vecna wasn’t taking another victim until he had her.\n \nMax has her headphones on and he tells her not to take them off. Vecna will try again, but El and her crew have gotten here in time before, Steve just hopes that him talking about their deaths doesn’t fuck them over.\n \nHis toes brush the cool blue of the water sending ripples throughout the surface. Steve wonders if his deaths counts as just the one, or. Or more. \n \n“Steve.” \n \nA hand is placed on his thigh, hesitantly, and he wants to melt. Instead, he looks to Eddie, to the way he’s searching his eyes for something. Steve hopes that he can give it to him, whatever he’s looking for.\n \n“It’s going to be alright, okay? Nothing is going to happen to anyone. Nothing is going to happen to you.” Steve says. He hopes it’s true. Because he’s said it before and he had been so, so, wrong, and he doesn’t want to think about Eddie in the swarm of bats, buried and eaten, or his screams to let him in the room, to face off Vecna, or when he gets them out just for the gate to close on—\n \n“Hey, what’s going on in that pretty little head of yours?”\n \nSteve swallows. “Eddie, I need you to know that I have been stuck in this- in this, for so fucking long. I’ve had time to think and to fight and to die—”\n \nEddie flinches at the reminder. Steve tries to forget it, but he can feel the tail around his neck, the snapping of his bones, the water in his lungs, the gun to his head. He doesn’t think that the feeling of death is something that he can soon forget.\n \n“I care about you.” He says, closes his eyes, feels the tears start to build up. “A lot. And I know that you have only known me for maybe a week? But I’ve known you, learnt so much about you in this hell, and I needed you to know that I—”\n \nThe words are stuck in his throat, and he’s faintly reminded of the sensation of drowning. But Eddie’s hands are on his, reaching for the sides of his face before the only thing that Steve can think is Eddie Eddie Eddie.\n \nThey’re both still wet from their trip to the Upside Down, shivering in the backyard of his house, but everything is right and just, because he can feel the clumsy warmth and softness of lips on his, and he has the foresight to get his legs out from the pool before he falls in. They pull apart, barely, just enough to speak, foreheads resting on each other.\n \n“I care about you a lot, too. Probably more than I should considering I’m not the one repeating the same couple days but,” Eddie cuts himself off, and there’s the faint flush that Steve knew he saw in the first few loops. “I don’t give my vest to just anyone, you know?”\n \nHe short-circuits. There are things that always happen, no matter how hard he tries: Nancy cries into Jonathan’s shoulder. Robin crushes on Vickie. Eddie gives Steve his vest (and more recently, he reminds himself, Eddie kisses him on the cheek).\n \nEddie always gives Steve his vest. In every loop. In every scenario. The shortest and the longest loop, and everything in-between. And Steve is crying and holding him close because Eddie always gives Steve his vest, and he doesn’t give his vest to just anyone.\n \nHe chuckles a wet laugh and wipes his eyes with the back of his hand. “I’m a fucking idiot.”\n \n“S’been established, Stevie.”\n \n“Oh, shut up. You don’t even know what I’m talking about,” he groans, flops to the tiles surrounding his pool, holding Eddie Munson’s hand. \n \nThere’s a beat of silence as they stare at each other, smiling, eyes wide, taking everything in under the moonlight. There’s a muffled talking inside the house, voices of his friends, and Steve lets himself think, can feel the tug of denim at his shoulders, patches and pins uneven against the flooring, for a moment, that everything will be alright.\nSteve decides that it’s not the wait that’s the worst part. Instead, it’s the thoughts, the questions, that accompany it. Something in the back of his mind is supplying him with how much easier this was before everyone had known, before he had been subjected to the prodding questions of the future-past that doesn’t, and will never, exist again.\n \nThere are things that are easier, though. Like the way that he and Eddie retreat back up the stairs at the end of the night. When Steve had taken his shirt off, eyelids heavy and needing sleep, Eddie had found something there that had him crossing the room, tracing fingertips across lines that Steve couldn’t see.\n \n“Do they hurt?” He had asked.\n \nThe days had not been kind to Steve’s skin, and with every passing minute, there were new scars and bruises that had appeared, fading in slowly. He had joked, looked to Dustin and Nancy for frantic reassurance, about getting hurt every year. They hadn’t found it as funny as he had.\n \nIn the morning, after he had explained away his troubles, they had carted him off to the hospital. Steve was steadfast in his annoyance because it was fine, he was fine, they had bigger things to worry about than him. Nancy had given him a quick glare, furious and heated, as she drove.\n \nThey hadn’t been able to take Eddie with them, too afraid of him being seen in the public place, and Steve was solid in the way that he wanted all the kids to stay hidden. He had appointed Robin as the on in charge as he was dragged away from his own house, and hoped that they didn’t break anything.\n \nThe doctors had looked at him funny when he had arrived, and it took all of his energy not to laugh. Nancy was short in her words, dropping the name Dr. Sam Owens every once in a while when they took too long to see to Steve. It seemed to do the job well, because before they could even sit down in the waiting room, he was being whisked away into a cold, secluded room.\n \nNancy had gone with him, not trusting him to actually get the help he needed, which, ouch? He had taken off his shirt, and they had pressed a stethoscope to his chest and told him breathe. Then, as they were left in the room, the nice doctor leaving with a clipboard of notes and a tightly pinched brow, they had waited.\n \n“What happened, Steve?” Nancy had asked. \n \nShe was strong, always had been. There was a determination about her, something that had made Steve so attracted to her in the first place. As her eyes flicked from his stomach, his neck, his face, her voice wobbled.\n \n“I don’t know I just,” He had sighed. The hospital bed was far from comfortable, and yet he still sunk into the plastic-y sheets when he caught her gaze. “Tried to fix things.”\n \nSteve knew it wasn’t the answer she wanted. He didn’t know what she wanted him to tell her, either, but the door to conversation closed, and they were silent as they waited for the doctor to come back. It felt like both the beginning and the end of something, new and old.\n \nThe news was not good. It’s not bad, either, but as the nice doctor entered the room again, clipboard clutched tightly in her hands, she stated how amazed she was that Steve was alive. She didn’t ask questions about the scars and injuries, and Steve silently thanked Nancy for throwing Owens’ name around.\n \nSteve’s told that his body is going into overdrive trying to fix everything, and that’s the reason why he’s so tired. When Nancy asked if there’s anything that they can do to help Steve, the doctor handed her a bottle of pain killers and sent them on their way. \n \n“Stevie? Do they hurt?” Eddie whispers.\n \nAlways, Steve wants to say. He breathes deep as they lie next to each other in bed, Steve facing away from Eddie. There’s a rattle to his lungs, as he does it, a cold sharpness occasionally blossoming in his chest. Steve lets the feeling of fingers tracing every impossible line lull him to sleep.\n \n— — —\n \nThe house is stocked with enough food, enough space, for everyone to settle comfortably, as they wait for the pizza van holding five people to slip into his driveway. The one thing that the house is not stocked with, however, is size appropriate clothing.\n \n“I am not wearing this.”\n \nOr style appropriate clothing, either, apparently.\n \n“Eddie, you’ve been wearing the same thing for like, a week. You were literally just complaining about the dirt and the smell.”\n \nHe whips around, brown curls moving with him as he marches towards Steve. “And when you said I could borrow your clothes, I thought you had something less—” He waves the blue polo around in his hands, making a sound in the back of his throat.\n \n“Preppy?”\n \n“Exactly!”\n \nSteve is torturing him, a little bit. He does have shirts in colours closer to what Eddie normally wears, things that aren’t just polo shirts perfectly ironed and folded. And if you reminded him of the phase he went through four years ago, of the black crumpled and soft shirts that are stuffed to the back of his closet, well. He’s gonna deny it.\n \nThere’s something funny in the way that Eddie paces the room, glaring at the blue collared shirt in his hands as if it’s personally offended him (it probably has, Steve decides). He runs his hands through his hair and puts on a performative sigh, tone teasing, as he speaks.\n \n“You know, if you’re not gonna wear it, we should just give it to Robin. Cause you know she’s been complaining about having to wear mum’s clo—”\n \n“No!” Eddie clears his throat, clutching the fabric to his chest. “No, I’ll wear the shirt.”\n \nHe slips the polo on easily, before throwing the Hellfire shirt at Steve’s face. He catches it, pretends to hurl as he smells it, holding it as far away from his body as he can. Eddie’s face is less than amused as Steve cackles out of the room.\n \nWhen they descend the stairs, the kids watching whatever shitty movies he had on hand, they do a double take so comical that Steve has to hang on to the railing for support as he laughs. The sound draws Robin out of the kitchen from where she was speaking to Nancy, before she’s stopped in place.\n \n“There is no way—”\n \n“Buckley, if you say another word, I am going to throttle you.”\n \nRobin’s face has become impossibly red as she tries to hold in a laugh, and as she looks away from Eddie, makes eye contact with Steve as he sits on the stairs, out of breath, she breaks. And as soon as it’s happened, Eddie is vaulting over the couch and chasing Robin around the house.\n \nThe kids cheer and whoop and chant, movie playing and forgotten on the TV behind them. Max is cheering for Robin, while Dustin and Lucas are shouting at Eddie to hurry up and catch her. Steve watches with fond exasperation as they round opposite ends of the couch, before Eddie ducks to one side, faking Robin out, and tackles her to the ground.\n \nThey both fall onto their backs on the carpet, out of breath, yet laughing, and Steve finds that the house feels so incredibly warm.\n \n(Later, when they’re changing into their pyjamas, and Eddie is rummaging through Steve’s chest of draws to find an appropriate shirt to sleep in, he finds it. A black shirt with a band that Steve privately listens to, on a mixtape called guilty pleasures. \n \nEddie shoves the shirt to Steve’s chest, pulling them both to the bed, a joking sense of hurt as he shouted how could you betray me like this, Stevie?! laughing and smiling).\n \n— — —\n \nHe’s showered and he’s scrubbed and yet they he still doesn’t feel clean enough. The Upside Down reveals itself in the form of grime on his skin, and the loops are still ever present whenever he looks in the mirror. \n \nEddie is softer, somehow, than he imagined. All Steve’s loops and knowledge couldn’t account for the horrible bedhead in the morning, or the deep rumble to his chest as he laughed. There is something in Eddie’s eyes that makes Steve fall a little in love with him, under the lights of his bedroom.\n \nIf it were at any other time, situation, he would have called this mundane, but there’s a worry, bigger than that of the impending doom of Vecna, that he’ll grow old and watch people die, and when he finally goes, peacefully, happy, content — that Steve will end right back at the start. At Lover’s Lake, untying his shoes. \n \nAnd, you know, Steve’s not one to tell people things. Spent nearly a year dying before he had pushed his burden onto someone else, found help. So he has no intention of ever telling the group this fear of his, lets them worry about one thing at a time.\n \nEddie, however, is a lot more perceptive than Steve thought.\n \n“I could practically hear the cogs turning in your brain all day.” \n \nIt happens in the safety of his bedroom, as they’re lying on the bed together, adjusting to the newfound way. Steve learns more about Eddie in the days spent with him now than he ever did in the loops. They stay away from the serious topics, most days, instead talking about their favourite colours (yellow, for Steve, blue, for Eddie), or high school drama. They barely get the time to speak alone, the group clinging to Steve every chance that they got, as if he’d disappear.\n \n“What if it resets when I die? Truly die.”\n \nAs Eddie gives him comfort, Steve tries not to think too hard about the logistics of time and death and second chances. \n \nThere’s nothing that can be said to fix the fear. Steve knows it, and he knows that Eddie knows it. Sees it in the way that his face all but falls, and his arms are wrapping themselves around Steve, shyness and adjusting be damned. Their legs are tangled together, Eddie resting his chin atop Steve’s head. \n \n(Vaguely, selfishly, Steve thinks he won’t mind coming back, if only to experience this a thousand times over).\n \n— — —\n \nThere is one phone call to the house in the time that they stay waiting for El. It halts everyone in their actions, before Steve is taking long strides towards the ringing.\n \n“Hello! This is Steve speaking.” He says, Eddie leaning on the wall next to him, mouthing so polite, and pretending to swoon. Steve rolls his eyes and swats him away.\n \n“Hi Steve, I was just wondering if you knew had any idea where the kids were?” Mrs. Wheeler says from the other side. “We haven’t seen them in a while, and we’re all a bit worried, what with the Munson boy on the loose.”\n \nSteve frowns, sees Eddie stop his teasing, eyes downcast. \n \nThey had a plan for this. Nancy had insisted on it, after hearing Steve mention how peoples respective parents had sent the police after them. The kids had stayed over at the Harrington Household because they wanted to be near each other, scared of what might happen if they weren’t. Dustin and Lucas had chimed in, said to drop hints of Will going missing when they weren’t all together.\n \nThe plan goes out the window when he hears the ease in which Karen Wheeler blames Eddie, her nonchalant attitude towards her missing kids.\n \n“Yeah, you know what, Karen? I actually haven’t seen them. Maybe you should listen to your kids more often. Might do you some good in the future.” \n \n— — —\n \nWhen, what Steve has dubbed The Cali Gang, arrive, the door is opened and they are all ushered in quickly. \n \n“You have no idea how happy I am to see you guys.” He breathes. Mike gives him a questioning look, but Jonathan is looking towards Steve’s face, and his exposed arms.\n \n“Steve, you okay, man? You look kinda—”\n \n“Fucked up? Yeah, I know.” \n \nHe places a comforting hand on Will’s shoulder, knows that he can feel Vecna now that he’s in Hawkins, and he hugs El tight as she enters the house. Steve gives Argyle a little wave, introduces himself, and says that he already knows his name (which earns him a whoa have we met before, dude?).\n \nSteve sits them down in the living room, lets them get their greeting out of the way. When he’s about to explain everything, again, Mike is already speaking.\n \n“What’s he doing here? How did he even get roped into this?” \n \nHe doesn’t know which is more baffling to Mike: that Eddie Munson is somehow part of the fucked up group of monster slayers, or that he’s wearing Steve’s clothes.\n \nDustin is the first to answer, shaking his head at the other Hellfire member. “Oh, buddy, you have missed so much.”\n \n— — —\n \nThey go back to Eddie’s trailer. They’ve split into groups, because Steve knows, he knows, who is safe and who isn’t. When he had proposed it, there had been pushback from the kids, from Jonathan, before he was reminding them of what he had lived through.\n \nSteve has been reunited with his bat and it feels like destiny. He gives it an experimental twirl and swing, and it feels right.\n \nBy now, the morning of the battle, Hopper and Joyce have killed their monsters, weakened the hive mind. Steve, El, Will, Mike, and Eddie are to go to Vecna’s lair in the Upside Down. Jonathan, Dustin, Argyle, Nancy, Max and Lucas stay in Hawkins. \n \nHe hammers in the importance of staying alert, not just to the crew who’re going through the gate, but to those that stay behind. You are all being hunted by Jason Carver, who has a gun, and the town on his side, he had said. Do not take this lightly.\n \nThey set up the distraction. It was something that he could’t forget, existence of uncovered vents and screaming into nothing, at the front of his brain. The distraction always died. But he had a plan, this time.\n \nEddie’s guitar amp is carried out, lead just long enough to traverse the space between worlds. Robin will play the guitar from the other side of the gate, and the others will keep protect everyone. From the Upside Down, Steve and Eddie cut through the chainlink fence, layering it over the gate, nailing it into the roof. A barrier. A safety net.\n \nThey walk towards the Creel House. The messy sound of chords are filtering through the air, and Steve knows that the monsters in Russia are dead, by the way that a handful bats fall to the ground, weak in their flying.\n \n“You’re not going to die, this time.” Steve says.\n \n“I won’t let you die for me.” Eddie replies.\n \n— — —\n \nWhen they finally get there, Steve takes the lead, showing where they have to step. The vines are always in the same place, shifting only ever so slightly. Will is by his side, predicting the movements before they even happen, connected, still, to the monster. When they reach the room, opening and waiting, Vecna is standing there. \n \nHis eyes reach El’s and he looks determined: he wants her to be here. Has always wanted her to be here. But as the group stalk into the room, positioning themselves as best they can, the monster looks at Steve.\n \n“You!”\n \nSteve is thrown back into the wall. But he’s had worse. He’s been eaten and drowned, burned, punched, concussed, drugged, shot. A little bit of air hockey isn’t going to kill him. And if it did? He would come right back. And he would know, and anticipate. Even if it took years, even if it took forever.\n \nAs Vecna is distracted, they approach him and do what they failed to every loop. Will and Mike throw the Molotovs, and Eddie fends off the vines. El holds the monster of a man in place, screaming and fighting. The hand of Vecna moves, lifts ever so slowly, and he is closing his eyes, before Steve can even feel his own roll back.\n \n— — —\n \nVecna doesn’t bother with showing him the party this time. He doesn’t pretend to be Nancy or Billy or Robin. Instead, he’s there, standing in the middle of his mind, a void of black stretching endlessly into the distance.\n \n“Been a while, hasn’t it, Henry?”\n \nAnd maybe he shouldn’t be taunting him. Because Steve Harrington is mundane and boring, and doesn’t have psychic powers, or the height and sharpness that this monster has. But he’s seen what he’s done, felt it first hand, watched him destroy towns and families, watched as it destroyed himself.\n \nHe rushes at him, ducks under the arm that Vecna has reached out to grab him with, and as he turns to land a blow to his face, the scene has changed. Steve is standing in the middle of a tornado of bats, watching them fall to the ground, hearing the familiar cries of Eddie. If this is what’s supposed to make him break, if this is what Vecna is showing him, he’ll have to try a lot fucking harder.\n \nSteve turns around, looking, searching, for the man to appear out of the shadows, break away from the memory that he’s constructed. \n \n“You’re pathetic!” He shouts, holds his fists up to his chest, and looks around him. “Preying on these vulnerable kids — what, can’t even fight an adult?” \n \nHe turns around at the rustling of leaves: nothing. Steve feels his heart hammering in his chest because this is it. This has to be it. His breathing is uneven, but his feet are solid on the ground.\n \n“And now you’re hiding!” Steve’s voice is raw and loud in the silence of the mind space.  He lowers his fists from his face, spins in a circle and waves his arms at his body. “Too scared of poor, broken, Steve Harrington, to even show yourself!”\n \nThere’s an animalistic growl that sends him crashing, wind knocked out of his lungs as his back hits a trailer. Gotcha. Steve can feel something wrong in his chest, but it’s not any worse than what he already is. Vecna — Henry — approaches him, and Steve has never felt more alive.\n \nHe goes to grab something, anything, to use as a weapon, but his head is disoriented as the trailer park morphs and stretches, forms the outside of his house, by the pool. This place that holds his best and his worst memories, killing him and breathing life into him at the same time. This place that started it all.\n \n“You have ruined everything.” \n \nThe monster, the man, stalks, to where Steve is crumpled on the ground. His voice is low and loud and seething. A hand is unfurled as it lowers and reaches Steve’s head. He looks up to it, knows what this means, what his body is doing in the Upside Down. Has seen it happen, before, heard it, felt it.\n \nI was so close, he thinks. I did everything right. \n \nThe monster closes his eyes, tilts his head down. “And now, I will ruin you.”\n \nThere’s a ringing in his ears as the words are spoken. The hand is hovering above his face, fingers sprawled out, caging his head. Steve matches Henry’s gaze, sees the boy within the monster, acknowledges them to be one. \n \n“There’s nothing left for you to take.”\n \nSteve slams his forehead into Henry’s, watches as he stumbles back. He doesn’t waste time. Steve scrambles to his feet and launches himself at the prone body of the monster. His fingers find themselves latching on to anything — flesh and blood caking themselves underneath his nails.\n \nThere is a roar, and Steve is pushed back. His body slams into the tiles by the pool, but he is tired and he is angry and he is done. Steve runs at the monster, ducks low enough to wrap his arm around his stomach, uses momentum to pull them both into the water. The familiar sensation of the pool is shocking and wonderful and horrifying, as he keeps his hands around Henry’s neck.\n \nSteve is afraid. He tightens his grip on the man’s neck, pays no attention to the shifting skin underneath his fingers, or the blurry vision as he dips underwater. There are hands and claws and vines reaching for Steve’s wrists and forearms, but he doesn’t stop.\n \nThere has been something building inside of him, growing and festering as he died and lived and died again. Steve surfaces for air, keeps his hands under the water. He does not let go. He does not think. He does not feel. There is blood pooling from his forearms, and Steve is afraid, yes, scared out of his fucking mind. \n \nHe does not want to go back. He does not want to wake up on the boat and relive, retell, die again, just to reset and fail. Steve wants hug Hopper. Make Robin laugh, comfort Will. Apologise to so many people. Steve wants to tell Eddie that he loves him. \n \nHis hands are impossibly tight around Henry’s neck, pressing as much of his weight on top of him as he can. The blood pounding in his ears is loud and hot and he is furious.\n \n“See how it feels!” He shouts. There is a thrashing of a body beneath him, the scene in front of him trying to flicker in and out of something else, anything else. Steve’s vision is watery and red and dimming. “Look at what you’ve made me become!”\n \n— — —\n \nWhen he comes to, and he’s still standing on solid ground, Steve knows that it’s over. He takes greedy breathes of thick air, blinking rapidly. The body of Vecna is burning, unmoving, and El is on her knees, blood dripping from her nose. Will and Mike are by her, arms on her shoulder, side by side. \n \nThe body sizzles, but it’s still intact. And, he has to make sure, has to make sure that this loop sticks, make sure that Max is alright, make sure that Eddie is alive.\n \nSteve picks the bat off the floor, scraping the floorboards. He swings. The bat lands where the burnt and mangled face of Vecna is. It hits wish a wet slush!, sticks to the mass on the ground. He puts his foot down on the body, wrenches the bat out again. And he swings. Again and again and again.\n \nWhen it has lost all meaning, and the mass on the floor looks less like a man and more like nothing at all, Steve feels safe.\n \n“Oh god, you’re okay.” Eddie’s arms are wrapped around him, and the bat is discarded to the floor for a second. Steve has clutches handfuls of Eddie’s shirt, breathes deep and slow, because they’re all alive.\n \nThey traverse back to the gate at the trailer. The bodies of the bats are piled high within the small space, but none move. Not even a twitch. The way is cleared by the flick of a hand, courtesy of El, and before Steve even knows it, he’s giving a leg up to the kids, and he’s holding Eddie’s hand, landed on the weirdly stained mattress.\n \nHe can see Max smiling, and El crying, and Eddie breathing, and for the first time in a long while, Steve knows that he won’t be slipping into his pool at the end of the night. \nThere’s a lot that happens. In the after.\n \nHopper and Joyce arrive in Hawkins, and the situation is quickly explained when nobody is surprised as Hopper being alive. El still clings to Hopper, and they barely let go throughout the talk, but when the final words have come out of Steve’s mouth, and he’s feeling more than a little drained, Hopper is opening his arms wider for him.\n \nThe government sets Eddie and Wayne up with a new apartment. It’s nicer, a lot less Gate Into Hell-Esque, and that’s really all they wanted. The cover story for the murders, to clear Eddie’s name (as well as to excuse the phantom scars that appear on Steve as time passes), was flimsy. But the town of Hawkins had wanted peace. \n \nThe people had accepted that a serial killer from out of town was inspired by the Victor Creel Murders, and started targeting high school students as they were isolated. Eddie Munson had been held hostage, as he had witnessed one of the murders, until one Steve Harrington had come across him.\n\n(Steve had begged to keep the names of the kids’ out of it. Pleaded for them to have a normal life. When words didn’t work, he had flashed his last name with distaste, and that had shut up the people creating the cover story real quick).\n \nThey say that Hopper was undercover. This lie is easier to maintain. Maybe it’s because of the way that his eyes are sometimes hollow, or the way that Joyce holds him a little tighter, some days. Occasionally, Steve thinks that it’s Hopper’s cover story that makes the serial killer one more believable.\n \n— — —\n \nThe first night is hard. So is the second and the third, and every night thereafter. But the first night is hard. \n\nSteve and Eddie had huddled together, clinging on and never letting go, during the night. They had stumbled their way up to Steve’s bathroom, hopping into the shower, letting the warmth of the water bring them alive again. It’s intimate in a way that he hadn’t thought of, to take a shower with another person.\n \nThey fall into bed, keeping the lights on, in each other’s arms. Eddie’s hair is still damp from his quick fight with the hairdryer, but Steve doesn’t think that he minds.\n \n“How’re you feeling, Stevie?” Eddie asks.\n \n“Exhausted.” He responds. “Scared.”\n \n“What are you scared of?”\n \nIt gets caught in his throat in a way that hurts, and he almost doesn’t want to speak the thought into existence. There’s a fear that feeds on imagination, of repetition and structure that he hopes had died when everyone else had lived. \n \n“It’s stupid.”\n \nEddie shifts so that he’s looking straight at Steve. He reaches a hand to put on Steve’s cheek, brushes his thumb underneath his eye. “It can’t be stupid if you’re this worried about it.”\n \nSteve reaches his hand up from under the covers to hold Eddie’s hand in place. “I don’t want to go to sleep. I’m scared that I’ll wake up and— I’ll be back on the boat, again.”\n \n“I’ll be right here. I’m not going anywhere. Okay?” Eddie says it like a promise. \n \n“Okay.” Steve breathes.\n \n— — —\n \nBetween the mess and the tears and the explanations, Steve pulls El aside. He rests his hands on her shoulders, makes sure that they’re at the same level, because there is something that he needs to know, needs to make sure that this one thing didn’t get fucked up.\n \n“Is Brenner dead?”\n \nEl is looking at him with exhaustion and surprise. At first he thinks it’s because of the question, before he realises that for her, this is the, maybe, the second conversation that they’ve had, in her lifetime. \n \nStill, she nods her head, doesn’t elaborate further. She’s no longer looking at her face, and Steve knows that the man was a piece of shit, someone who deserved to die. But he also knows how guilt works. Nothing is ever truly black and white, no matter how much he wants them to be.\n \nThey don’t say anything more on Brenner. Steve is more than happy to watch as his name and his face fade from view. No one mentions the man until Sam Owens is on the phone, telling Hopper that El is allowed to go outside — to live like a teenager, for the first time in her life.\n \n— — —\n \nThere are so many conversations that Steve has to redo, from within the loops. The first, the easiest, one to have, is with Will.\n \nThe Byers stay with him for a while. They still move back into Hawkins, but as all of their furniture and property is being transported over from California, he opens his home to them. The Harrington House has a mismatched set of people within it: with the Byers and Hopper and El and Eddie being present so much of the time.\n \nAnd maybe it’s because they’re not subtle about it, that makes it so easy to have the conversation with Will. Steve has taken over cooking duties after Jonathan had sent him a look over Joyce’s head at her offer to help with food. \n \nSteve and Eddie dance around each other, in sync more than anyone else in the house. When they’re together by the counter, knocking hips into each other, Steve can feel a faint flush build up on his cheeks. This is all he’s ever wanted.\n \nThey’re not subtle, and Will is not blind. When he walks into the kitchen, and Eddie has wrapped his arms around Steve, resting his chin on his shoulder, it’s hard to see it as anything than what it is.\n \n“Are you guys together?”\n \nNeither of them jump back. Eddie shifts so that they can both face Will, but he leaves his hand around Steve’s waist. \n \n“Yeah,” Steve replies.\n \nWill struggles within the doorway to the kitchen, wanting to say everything and nothing at all. Eddie and Steve wait, patient, because they have all the time in the world, and this is something important.\n \n“And it’s okay? Being two boys?”\n \nThere’s a hopefulness to his voice, something light. Steve remembers the last time this had happened, lying on the floor, movie forgotten. It’s the same, and different, and changed, all at once. \n \n“Of course,” Eddie says. “And if anyone tells you different, you can come to us, okay?”\n \nIt’s a promise, and reassurance. Acceptance. As Will nods his head, a smile on his face, Eddie and Steve break off from each other to hold him close. \n \n— — —\n \nSteve knows that he’s been round Eddie’s apartment too consistently, when the first thing out of Wayne Munson’s mouth is “Here for Eddie again, Steve?”\n \nWhen they’re in the car together, Steve asks if Eddie’s uncle knows about the two of them being together. \n \n“I mean, I haven’t explicitly told him, but he knows that I’m gay. He can figure out the context clues, I’m sure.”\n \nIt’s hard trying to navigate this new relationship. Yes, there are some aspects that come naturally. Picking up Eddie from his house, inviting him over for dinner. When they want to do nothing but lie together in bed, Steve finds it easy.\n \nIt’s one of those days, again. A movie has been put on in the background, one of those Star Wars movies that Dustin has been pleading for him to watch, but not for them to pay attention to it, just for the background noise.\n \nEddie is sitting on the floor, with his back to Steve, who is up on the couch. He rakes fingers through Eddie’s curls, separates his hair into sections to gives him loose braids. Steve finds things like this easy — being together.\n \nBut there are other things, like what a different version, a different loop of Eddie, had told him, that sometimes makes it hard.\n \n“Sometimes I feel like I’m being unfair,” Steve says, quietly. “I know all these things about you that you haven’t actually told me.”\n \n“Steve,” Eddie says, waves his hands around the back of his head to disconnect Steve’s hands from his hair. “If I trusted you enough to tell you in those loops, then I would trust you now. No matter what I told you.”\n \n“I didn’t,” Steve breathes, rewords the sentence in his head. “I want you to know that I never kissed you. In the loop.”\n \n“Then I’m happy we can experience it together, now.” He reaches a hand up to guide Steve down to his level. Eddie’s hands frame the sides of his face, as he closes his eyes and draws him in. It’s as soft as it was the first time, by the pool. Warm.\n \nEddie breaks away first, turns back around to face the TV. He swipes his hair back over his shoulders, a clear invitation, that Steve takes, to finish the braid. And if there’s a giddy smile on Steve’s face, warm and flushed? Nobody has to know.\n \n— — —\n \nSteve and Hopper bond, again. Maybe it’s over the shared trauma of being tortured by Russians, or another one of the constants: that Hop will always make sure Steve is alright. He ends up learning a lot more of what happened in Russia, and in turn, Hop learns a lot more about the time loops.\n \nThe couch feels uncomfortably small as the conversation wrenches something ugly out of Steve. \n \n“I feel like I shouldn’t be this torn up about it, y’know? It technically didn’t even happen!”\n \nHop closes his eyes, brings a hand up to his mouth. Amidst the blur of his own tears, and the shakiness of his breathing, Steve watches as Hopper opens his arms. He shuffles close until his hands are rubbing circles into Steve’s back.\n \n“Everyone is alive. I’m alive. Why does it still feel so—” A sob breaches through his mouth and he feels like he can’t breathe. “Why does it still hurt?”\n \nHe doesn’t know why he’s crying. They won. The monsters were dead. Max and Eddie were alive. But as he’s held, Steve presses his face into Hopper’s shoulder, feels the tears, hot and ugly, roll down his cheeks.\n \n“It’ll take time to heal.” Hopper whispers. “I’ve been meaning to talk to you since before Starcourt, but, we all know how that turned out.” \n \nThey choke out a laugh together, and Steve finds comfort in the way that Hop’s chest rumbles when he talks. He wipes his tears on the corner of his sweater cuffs, and neither of them acknowledge the wetness of their eyes.\n \n“What about?” Steve asks.\n \n“Nothing. Everything. I don’t think I ever properly talked to you about all the Upside Down shit before and—” Hopper sighs. “You’re just a kid. You were pushed into taking care of all the children, protecting them from these monsters. But you’re just a kid.”\n \nSteve’s breathing is patchy and uneven as Hopper talks. He closes his eyes, lets the tears soak into his shirt. He presses his lips together in a need to be quiet. \n \n“What you went through, what you sacrificed so everyone could be alive today, I know it wasn’t easy. I need you to know that we are here for you— that I’m here for you.”\n \nHe clutches at the back of Hopper’s shirt, holding on, pleading. Steve breathes in deep and tries to hold it there before it’s stuttering out of his chest, eyebrows pulled together. \n \n“I felt what is was like to die, Hop. I— I died so many times.”\n \n“It’s all over, kid. You can rest now.”\n \n“But it’s never just over!” Steve blink harsh and fast, uses his fists to scrub away his tears. \"Every year there’s a new monster, and every year I get hurt. What happens next year? I can’t— I don’t think I can do this again.” \n \n“I don’t know.” The admission is quiet. Hopper’s hands are still rubbing circles into Steve’s back, arms warm around him. “But, for now, you rest, okay? You don’t have to keep it all to yourself. Let us ease the load.”\n \nSteve presses forehead deeper into Hop’s shoulder, sob ripping through his throat. It is raw and it is loud and it is ugly. He feels exhausted in a way that weighs on his bones, and yet he still has more tears to shed.\n \n“It’s okay. You’re gonna be okay, kid.” Hopper whispers. “You’re gonna be okay.”\n \n— — —\n \nNancy still leaves. But something is different this time, a change that felt like a long time coming, for everyone involved. When Steve is on his way to the Byers’ place for dinner, he spots Nancy driving away in her car, Jonathan smoking on the steps of the house.\n \n“You alright?” Steve asks.\n \nJonathan looks— not surprised. Not sad. “Nance and I broke up.”\n \n“Oh.” He pauses, sits down next to the Byers’ boy on the steps. “I’m sorry?”\n \n“No! No, we. I don’t think we were that good for each other.” He looks relieved. Jonathan turns to Steve for a moment before looking away. “I’m sorry, by the way. I don’t think I ever apologised for sleeping with her while you guys were still—”\n \n“It’s okay.” It feels like a reversal of what happened during the loops. “I mean, I was kinda an asshole to you all throughout high school, so.”\n \n“But I still shouldn’t have done it. Or the—” He lowers his voice, looks drops his head a bit. “The pictures.”\n \nIt feels good, Steve realises. To be the one on the receiving end of the apology. It’s not something that he’s accustomed to, and he realises that he’s been staring at his shoes without answering Jonathan.\n \n“Thank you,” Steve says, means it. “And I’m sorry for what I said about your family. About them being a disgrace.”\n \n“You were angry.” Jonathan dismisses.\n \n“Doesn’t make it right.”\n \nIt feels like the mess between them has been cleared. Their apologies hang in the air, something long overdue, something that they both needed. It feels like the start of a friendship.\n \nWhen they’re sitting at the dinner table, and Steve has helped Joyce cook, everyone talks. Hopper is sat at the head of the table, with Joyce by his side. Will is recounting something from Eddie’s newest campaign, El listening intently, and Jonathan laughing. It feels like a family. Steve feels like he belongs.\n \n(He tells Jonathan about The Mixtape to Save the World, when they’re clearing the dishes. Steve lists off everyone’s favourite songs by memory, adding in his speculation for what he thought each of the the Cali Crew’s songs would be. \n \nIn the days that come after, Steve finds that Jonathan has a knack for creating tapes in such a way that tells a story. The songs flow and bond and mesh together, pop turning to alt turning to rock. The copies are spread throughout the group, and if it’s the only thing Steve listens to for weeks, he doesn’t tell anyone). \n \n— — —\n \nSteve tries to give Eddie back the vest. He tries, really, he does! But Eddie is having none of it. Steve had ‘accidentally’ forgotten it once, at Eddie’s new apartment, and the next day it was back on his chair, staring up at him.\n \nWhen he had asked why Eddie was so adamant about him having it, all he had said was “If it happened in every loop, then surely that’s a sign that you’re meant to have it.”\n \n“Oh that is such bull, and you know it—”\n \n“Hey! Is that any way to speak to your elders, Stevie?”\n \nSteve pauses. Thinks. It’s like a lightbulb going off in his head as he says it. “Y’know, technically I’m older than you now. So really, you should be listening to me.”\n \nIt’s getting easier to joke about the loop as time passes. What doesn’t get easier, though, is talking to his father. Ever the elusive man, Mr Harrington doesn’t bother to call Steve, even when he’s on the news for being ‘attacked by a serial killer’. The only acknowledgement he gets, is when, one morning, he’s sent a new watch. He sells it for cash and buys a graduation gift, instead.\n \nWhen his dad finally decides to call, it’s not a simple hey how are you? I haven’t talked to you in months or  I saw you were attacked on the news, wanted to see that you weren’t dead. Instead, it’s to say:\n \n“The neighbours said they saw that Eddie Munson spotted near the house. I better not be hearing that you invited him in, Steven.”\n \nIt’s infuriating. And Steve is tired.\n \n“I did actually. And you know what, dad? You can go fuck yourself. I’d ask if you could say hi to mum for me, but I actually don’t think I give a shit.” \n \nHe slams the phone down on the receiver, and pulls his money from the bank account his dad had set up for him. Steve’s not worried about being kicked out of the house; his father too swept up in appearances to do so. \n \n(In the back of his mind, he realises that they had never truly been his parents. When he says the words, thinks of family and mum and dad, he doesn’t think of the Harrington’s in their too big, too cold house. He thinks of Joyce and Hopper, Robin and Jonathan. The kids. He thinks of Eddie).\n \nSo, it’s a little to do with fucking with his father, and a lot to do with making Eddie and the kids happy, when the house becomes a regular dnd den. With Eddie graduating later in the year (and, god, it really was his year, huh?), Hellfire meets had been moved to Steve’s house so that they could continue after he left.\n \nIt’s good, for a while.\n \nJason Carver is still convinced that Eddie is the murderer — a vessel for Satan to destroy the world of the good Christian man, or some shit. It seemed that the government branch allocated to coming up with cover stories forgot the part where he had seen Patrick’s body lift into the air above the lake.\n \nEddie had mentioned how Jason would stare at him in school, in the cafeteria, in classes. But there were so many people to witness any threat he would make, that he never made a move. But Steve and Eddie aren’t that lucky.\n \n“Hey, Stevie,” Eddie says during a break in the campaign, “You mind rushing down the store to grab some snacks and soda? They kinda picked your fridge clean.”\n \nSteve sighs but lifts himself from the couch, waves at the group members, who excitedly wave back, before going on a midnight snack run. Those boys are lucky he’s so nice, otherwise, they’d be stuck on tap water for the next few hours.\n \nWhen he gets back, and his front door is cracked ajar, it’s quiet. Way too quiet for a dnd game.\n \nSteve closes his car door softly, creeps towards his open door before he’s in the living room, watching Hellfire Club members clutching to themselves or each other, as Jason carver lifts Eddie off the ground, pressing his back into the wall.\n \nAnd he’s over there in seconds, pulling Jason off, watching as he stumbles back into the room. His eyes are crazed and his jaw is set, and if he wasn’t such a dickhead, Steve might have felt sorry for him. Carver’s swings are sloppy, uncoordinated, and Steve barely has to dodge his strikes.\n \nThe Hellfire Club are silent as they watch Steve punch Jason in the face, and they are silent when he stays on the ground. When he doesn’t get up, and Steve checks his breathing, his pulse, phones the police, only then, do they cheer and shout and grant Steve the title of Honorary Hellfire Member.\n \nJason Carver is charged with assault, and isn’t set to graduate for the year.\n \n— — —\n \nThe kids have (mainly) reverted back to normal. They joke and they laugh, hug Will and El and Max a little tighter when they have to go back home. Steve isn’t blind, maybe a bit oblivious, but not blind, and he knows that things are not just ‘okay’ with them again. The kids are trying to hang on to whatever was left of their normality, which Steve quickly identifies as a coping mechanism he had used one too many times.\n \n(He makes a mental note to talk to each of the kids, individually, as a group. Reassure them that they can have bad days, that they can acknowledge the weight of the world and still be happy).\n \nThis time, he’s been delegated to dropping El off at Hop’s cabin at the end of the night. The party had started a new campaign, Mike insisting that Eddie be the dungeon master. In the back of his mind, Steve is reminded of how the group had brushed Will’s want to play dnd aside. When he sees the kid smile a little wider, laugh a little harder, Steve promises to keep him happy.\n \nEl is still giddy in his front seat, hands clutched around the gifted set of dice given to her as a present from Eddie and Mike. When the car rumbles to a stop, leaves and sticks crunching under his tires, Steve turns and walks her to the door.\n \nThe lights are on in the house, signalling that Hopper had waited for them to come back, and the door is opening to—\n \nA man? \n \nThe man looks at El before his eyes have reached Steve’s, and then he’s promptly shutting the door in his face.\n \n“What the fuck?”\n \nBefore Steve can even turn to ask El who the hell that was, the door is opening again, and Hopper is standing there, an apologetic look on his face. He ushers them in quickly, warmly, closing the door behind him. The man is sitting on the couch, his hands clasped tightly in his lap.\n \n“Steve, this is Dmitri, or,” Hopper huffs a laugh to an inside joke that Steve doesn’t understand. “I call him Enzo.”\n \nDmitri (Enzo?) waves a curt wave to him from the couch, a tight smile on his face. Steve, starstruck and confused, lifts his hand in response. \n \n“Okaaaaaaaaay,” Steve drawls. “Is that meant to mean something to me, or?”\n \nAnd Hopper is smiling again, and El has made her way over to the couch to give Dmitri a high five. Steve studies their interaction, questions why he doesn’t remember this man at all. Not from his knowledge in the loops, and not from anything else either.\n \n“The American has told me a lot about you,” Dmitri says. Steve vaguely registers his thick accent before he’s speaking again. “I did not recognise your face, before.”\n \nIt’s starting to fall into place when Steve looks back at Hopper. Connects the dots between the accent, and the names they call each other, and then there’s a recollection from a past loop, of Hopper telling him that he had help in Russia.\n \n“Oh! You’re the one that helped Hop with all the,” Steve gestures vaguely between the two men. “Thank you.” \n \nThe man on the couch laughs. His grin is sincere, smooth, as he looks at Steve, standing near the door. “You should be thanking, Jim. He is the one who helped us, in the end. If not for him, my son and I would not be here. Really, I should be thanking you.”\n \nHopper is standing, bashful, next to Steve, who has been reeling throughout this entire interaction. Thank Steve? For what? And Hop is looking at the questioning gaze in his eyes, must be a mind reader, because he’s already moved to answer.\n \n“He fought the Demogorgon with me, and he saw El use her powers, so I thought an explanation about your situation was in order.”\n \nSteve catalogues their group. Two potheads, a teen-journalist with a gun, the Chief of Police-slash-best dad, a loving mother, Mike, a girl with superpowers, a sarcastic redhead, a snarky eleven year old, Murray Bauman, a kid with the world’s worst bowl cut, a basketball-nerd mix, a hopeless romantic lesbian, a kid who needs his ego checked, the best dungeon master-slash-boyfriend, and a time travelling babysitter. \n \nHe goes through their group once more. Adds ‘Russian guard turned monster slayer’ to the list.\n \n“Welcome to Hawkins, Dmitri.”\n \n— — —\n \nIt’s not exactly needed, not like they’re being secretive about it, but Steve comes out to Robin. He doesn’t make it a big thing, doesn’t really feel like it is. Maybe it’s because he’s had literal years to come to terms with this, so for him, this has been the norm for a while.\n \nFor Robin? Well. That’s a whole other thing.\n \n“I knew it!” \n \n“Oh, you so did not.”\n \nHe stacks the tapes on the counter, rearranges them in an order that he knows will piss off Robin. Steve watches her pace around the front of the store, before retreating behind the counter when a mother and her child walk in.\n \n“You and Eddie aren’t subtle, by the way.” She whispers. “And I am so mad that you managed to kiss and boy before I kissed a girl!”\n \n“I’ve been telling you, you should just talk to Vickie, Rob.” He’s been saying it from the start, before he even knew that they ended up together. Now that he knows that they do? Steve’s determined to play a little bit of matchmaker.\n \n“No, we are not talking about my love life right now. How did you even figure it out?” Robin is incredulous in her speech, waving her arms around as much as she can without alerting the mother in the PG section of the store.\n \nSteve could say a variety of things. He could mention the loops and how Eddie was at the crux of it all, how afraid he was at fucking everything up. But it feels too heavy, for this. Instead, he gives a half-truth, something that he realised later, something that should have made it clear sooner.\n \nRobin checks out the movie that the customer wanted to rent, and Steve waits until the door has shut behind her before he speaks.\n \n“When you’ve played every sport, you’re kind of in the locker room for along amount of your high school life.” He says, can feel the blush climbing to his face. “And, you know, sometimes you accidentally catch a glance of, uh. Something below the waist.”\n \nRobin gasps in pretend outrage. “Steven!”\n \nHe groans. “Do not Steven, me. You asked!”\n \n“Robin asked what?” \n \nEddie has taken to bothering the both of them at work. And, normally, Steve is grateful for the distraction. But when his face is red and they’re on this specific topic? Robin and Eddie are gonna team up against him.\n \n“I asked how he knew.”\n \nSteve can feel Eddie’s eyes flick across his red face and his hands cover his eyes. There’s a smile to his voice, as he leans against the counter. “The locker room story, right?”\n \n“Oh god.”\n \nAnd then a customer is entering the store, and Steve is racing towards them like a lifeline, spitting his spiel about hi, my name is Steve, how can I help you? as Eddie and Robin are losing it by the counter.\n \nOnce their cackling has died down, and Steve’s face has returned to it’s normal shade, they ask him about the loop. Not the heavy shit that they normally go over, but dumb things. Things that Steve is all too happy to talk about.\n \n“You called me ‘big boy’ once.”\n \n“Eddie did what?” \n \n“Stevie. Babe. Between this and the vest, how did you not know I was flirting with you?” Eddie is sat on top of the counter, legs crossed. He glances back at Steve with wide eyes.\n \n“Well I was kinda more worried about the fact that we were stealing a fucking van, now wasn’t I?”\n \n“We stole a van?” Robin chokes on her water and is sent into a coughing fit.\n \n“I hot-wired it, didn’t I?”\n \n“How do you know how to hot-wire? Do I want to know how you know how to hot-wire?” Steve and Eddie laugh at the spiral that they sent Robin into, before she’s pushing her finger into Steve’s chest and demanding to be told more about the dumb-cute shit that they got up to in the loops.\n \n“Uhhhhhhh, I came out to you once and told you I liked Eddie’s hands?”\n \nThe man in question spins around on the counter to look at Steve, leans in and waggles his fingers at him, a mock-affronted look on his face. “Those better be some PG thoughts, Harrington. You’re on the clock right now!”\n \nSteve picks up the closest magazine, shoves his face into it. He pretends to read the words, watches as they shift along the page. He’s reminded of the time within the van, a time that doesn’t exist, but is mirrored in what happens now.\n \n(After, when Eddie leaves Family Video, there is a break in customer service, Robin asks if Steve was ever tested for dyslexia. She mentions how his eyes had moved along the page, not in the way that one does when reading or skimming paragraphs. \n \nThey go to the library after, Robin reading pages upon pages of definitions, and Steve thinks he understand himself a little better. It’s in the way that he mixes up his words, finds it hard to read. There’s a small part of him that wants to go back to school, now that he knows, just to see who he could have been).\n \n— — —\n \n“I’m bisexual.” Steve instantly backtracks, explains. “As in, I like boys and girls.”\n \n“I know what bisexual means, Steve.” Hopper says. He’s by the kitchen, trying to solo-cook one of Steve’s recipes that El likes. “You seeing anyone right now?”\n \nSteve stops tapping his fingers against the dining table. Things are easy with Hopper. It almost makes him want to cry again. “Yeah, I’m— yeah.”\n \n“You deserve happiness, kid. Don’t let anyone tell you otherwise. And if you find happiness this guy, this boyfriend, of yours, then you go be happy.” \n \nSteve jokes, tries to cover up the wetness of his eyes. “Didn’t know you cared so much, Hop.”\n \n“Yeah, yeah. I don’t have to have The Talk with you, right?” Hop has turned around to face him, one hand on his hip, the other pointing a wooden spoon at him.\n \n“Oh god, no thanks.”\n \n(Later, as Steve leaves the cabin and waves, getting into his car to ride home, Hopper calls out to him, anyway.\n \n“Make sure to use protection!”\n \nSteve swear he hears loud chuckles when he hits his head on the car roof getting in).\n \n— — —\n \nDustin, Steve and Eddie hang out. Steve gets readily taught about anything and everything there is to know about dnd, and they pull out so many things that Steve pretends not to understand. A character sheet, classes, what each dice does. There is so much information, but he soaks it up greedily, a sponge of information.\n \nAnd, y’know, it’s nice for a while. The three of them switch between Steve’s house and Eddie’s apartment, depending on what they want to do. Some days they won’t even be doing anything together — each separately attending to something, all in the same room. It’s nice.\n \nBut Dustin is a nosy fucker, and he can’t seem to keep his mouth shut.\n \nIt’s in on one of those quiet days. Eddie is lying on the couch in Steve’s living room, propping his feet up on the lap of the man in question. Dustin in lying on the floor, comic book held in his outstretched arms.\n \nSteve has been trying to get more into reading after learning about dyslexia. It’s hard to pay attention, but he’s found that when the paragraphs aren’t long, and he holds a ruler under the line he’s reading, it makes it a little bit easier.\n \nDustin sighs dramatically from his place on the floor. Steve ignores it.\n \nHe rubs his free hand, not holding the book, up and down Eddie’s calf on his lap. It’s a soothing motion, back and forth, and when he gets a little distracted from the paragraph he’s reading, he’ll tickle Eddie. That little endeavour earns a swift kick to his book in his hands, making it fall to the floor.\n \nDustin sighs again.\n \nSteve leans down to pick the book up, un-crinkling the pages that had been smooshed against the floor. He sends a playful glare at Eddie, who, without even looking at him, has raised his hand to flip him off.\n \nDustin lets out another sigh.\n \n“Okay. What’s your deal?”\n \nThe kid drops the comic book dramatically so that it lands to cover his face. Steve thinks that he’s spent a little too much time with Eddie. The couch is still warm from where he’d been sitting, so Steve plonks Eddie’s legs back over his lap. He makes note in his mind to call him a human blanket, later.\n \n“Everything’s so boring now.”\n \n“What, without me being a fugitive of the town and wanted for murder?” Eddie snarks.\n \n“No!” Dustin has sat up, and the comic book has fallen to the ground. “You know that is not what I meant.”\n \n“Then, pray tell, what is it that you mean?”\n \nThe kid gets to his feet and starts to pace around the room. It’s something that he probably picked up from Steve. His need to be moving, on his feet, never giving himself a moment to relax. For a second, Steve is worried that this is going to be something serious.\n \n“You don’t go on anymore dates, Steve!”\n \nOkay. So. Not serious.\n \n“Oh my god.” Steve sighs.\n \n“That’s what’s boring? Steve's lack of love life?” Eddie cackles as Steve slaps his legs. \n \n“Yes!” It’s said like it’s the most important thing in the world. As if they weren’t literally fighting monsters from hell maybe a month ago. “You were my free entertainment.”\n \n“I wasn’t that bad, and I did not go on that many dates for me to have been your entertainment.”\n \n“Well, you never go out anymore to even try to date. Like, I knew you liked Nancy, but then she got with Jonathan, and I still don’t understand why you don’t just get with Robin. You guys would be perfect! You already spend most of your time together, anyway.”\n \nEddie is red faced as he holds in his laugh from his end of the couch. Dustin continues in his speech, as if he’s made the biggest revelation known to man.\n \n“And when did you guys get so close? Steve, if I didn’t know any better, I would have thought you guys were dating! No wonder you can’t pick up chicks anymore.”\n \n“Dustin.”\n \nHe looks up from where he’s been pacing in his rant. Looks at the two of them, really looks at them. Dustin sees the way that Eddie has sprawled his legs to rest in Steve’s lap, the comforting hand that has been placed on his calf.\n \n“Oh. You are dating.”\n \nEddie laughs so hard that he rolls off the couch, hitting his face into the carpet as he goes. Steve is sighing in exasperation before he looks back up to the kid, who’s eyes are wide and face is mild horrified, and he breaks, too.\n \n“How long? How did I not know? Why didn’t you guys tells me?!”\n \n“I thought you knew!”\n \n“‘Thought I knew’? Steve, I’ve been talking about how hopeless you are for the last hour!”\n \nEddie speaks out a couple words from his breathless state on the floor. “That is no way to speak your mother, Henderson!”\n \nIt turns out, that in ever scenario, in every situation, Eddie Munson and Steve Harrington get to co-parent Dustin (even if the kid himself is a little slow on the uptake).\n \n— — —\n \n“I’m sorry.” Are the first words out of Nancy’s mouth, as soon as she’s back from her road trip to god knows where. It’s the ass-crack of the morning, and Steve is still blearily rubbing sleep away from his eyes, when he had heard the doorbell ring.\n \n“What’re you sorry for, Nance?” Steve leans against his doorframe, before deciding that this is probably going to be a heavy conversation, and opens the door to herd her inside.\n \nThey make their way to the living room. Nancy sits on the couch across from the TV, and Steve opts to sit next to her. Jonathan had told him about the two of them, after the break up. How there were times when they would fight over things that shouldn’t have been fought over. How, sometimes, Nancy would be so driven, on a one track mind, that she’d disregard everything around her.\n \n(“That’s not to say I was perfect, either!” Jonathan had assured. “I mean, apart from lying to her about the college thing, there were so many times where I just avoided her, didn’t speak to her.”\n \n\nThey were in his bedroom, newly decorated with posters of The Cure and Joy Division as soon as his furniture had arrived from California. Steve was sat on the floor, legs sprawled out in front of him, as he passed the joint back to Jonathan. \n\n \n\nThe Byers’ boy had flopped on his back, bouncing slightly on the bed. Jonathan groaned and covered his face with his hands. \n\n \n\n“Hey, then maybe it’s a good thing? You guys breaking up.” Steve proposed. “I mean, it sucked when Nance broke up with me. But looking back on it, I really don’t think we should have been together.”\n\n \n\nIt was an oversimplification. They had wanted to be together because everyone else wanted them to be together. Maybe, along the way, Steve had convinced himself that it’s what he wanted, too. But in the time apart, he had grown, become better. Now, when he looks at himself in the mirror, he’s proud.\n\n \n\n“You’re probably right.” Jonathan had conceded. “We were still so young when we got together, still trying to figure out who we truly were so. Yeah, you’re probably right, Steve.”)\n\n \n“You apologised to me for being a shit boyfriend, but I never apologised for being a shit girlfriend.” Nancy wrings her hands in her lap, nervous in such a way that Steve has never seen her be. “And, I’ve been thinking, I don’t think either of us were good for each other.”\n \nIt feels like a weight has been lifted off his shoulders. \n \n“Thank god you said it, because I was thinking it.” Steve sighs and slumps back in his seat. “It hurt, y’know, when you and Jonathan—”\n \n“I’m so sorry.” She says. “I mean, I already knew about your parents and the way that your dad—” She stops again, backtracks. “I shouldn’t have sleep with him. It was shitty of me, and I’m sorry.”\n \n“Have you spoke to Jonathan yet?” Steve asks.\n \n“Not yet.”\n \n“I think you should. We’ve been talking lately and—”\n \n“You and Jonathan?”\n \nSteve smiles, laughs slightly at her incredulous expression. “Yes. Me and Jonathan talk now.” He continues. “We talked about a lot of things, but we also talked about you. And I think he probably has a lot that he wants to say to you.”\n \nShe looks slightly put out by this, before she’s nodding her head in understanding. “I think I have a lot to say to him to. To apologise for.”\n \nThe conversation slowly dies out, becomes a little too close to small talk. On one hand, Steve is glad that he dated her. Thinks that she sped up his de-asshole-ification process. But on the other hand, as one of them brings up the weather, he can see them fading back into acquaintances. He thinks that, maybe, it’s better this way.\n \nThere’s a small part of him that will always love her. And Steve’s starting to realise that, that’s okay, too.\n \nEddie comes down the stairs while they’re still talking, sleep addled brain not understanding the situation, before he’s looking back down at Steve’s shirt that he’s wearing, and sighing. It shouldn’t be as funny as it is, and Steve should have guessed that Eddie didn’t care about the others knowing.\n \nHe’s already slipped into the kitchen, no doubt to start making coffee for himself, boiling the water for Steve’s tea, when Nancy has opened her mouth.\n \n“So, Eddie?” She asks, eyebrow cocked. She doesn’t look affronted, maybe a little surprised, shocked, but not disgusted. There is an easiness in the way that she says his name, and Steve didn’t realise the breath he was holding until she speaks.\n \n“Yeah. Eddie.” He agrees.\n \n— — —\n \nBetween the jokes and the movies, Dustin and Steve talk. Properly. It’s short, and it’s sweet, filled with teasing and promises, and it feels like things have started to feel good again.\n \nSteve thanks him for believing him, at the start of this loop. About the short amount of time he took from hearing the words come out of Steve’s mouth before he was making sure that everyone followed Steve’s lead.\n \n(“You were so different.” Dustin has said. “You still are. So different.”\n\n \n\n“What do you mean?”\n\n \n\n“I don’t know it’s hard to try and explain. But the way you talked over the walkie at the lake? It was hard not to believe you with how changed you sounded.”\n\n \n\nIt, weirdly, sends a spike of fear through Steve. Had the loops made him someone else completely? Was he no longer the same person that these people knew? Were they ever going to truly know who he was anymore?\n\n \n\n“I’m still me, aren’t I?” Steve had said. A plead, a beg, a need. The sentence say so much more than he could ever possibly know to articulate. \n\n \n\nAnd Dustin had answered, honest and sincere in a way that Steve had never seen him be. “It’ll take some getting used to, yeah. But you’re still our Steve. Nothing is going to change that.”)\n\n \nHe refuses to tell him about the gruesome deaths, about what had happened to any of them. Steve knows that it’s not something that he has to bear alone, is able to speak to so many people about it. But he decides that it’s not something that Dustin needs to know.\n \nSteve does, however, fuck with him. He uses fake past loop knowledge to tease Dustin, pretending that things happened when they actually didn’t.\n \n“You know, in one of the loops, you tripped over yourself trying to talk to this girl.”\n \n“I did not!”\n \n“Uh, who was there? Me. You totally did.”\n \nSteve makes sure to use his overly exaggerated voice and mannerisms to make sure the kid knows that he’s joking. By the way that they burst into laughter at the end of their pretending, he think Dustin gets the gist.\n \n— — —\n \n“See, and I have another here that I got when I—”\n \nEddie meets El, and Steve was right. They love each other. \n \nWith Hopper’s unofficial adoption of Steve, he had all but demanded to see Eddie when Steve had mentioned who his partner was. It felt weird, at first. Having a father figure who was interested in his love life, let alone his life in general. He had made a phone call to Jonathan, aiming to be short, to get clarification on one question.\n \n“Is it normal for parents to want to meet your partner?”\n \nBecause Steve knew Hopper. He knew the overbearing nature that he had over El and Mike (but Steve doesn’t blame him. Mike can be an ass sometimes), and he thought that, maybe, this interest in Eddie was a Hopper thing.\n \nJonathan had just laughed. Said: “Yes. Tell Eddie that I said good luck with Hop!”\n \nBut as soon as Eddie had walked through the cabin door, before Hopper could even get up from his chair, El was marching towards him and stating that he had to tell her about his tattoos. By the way that Hopper had smiled at them, Steve thinks Eddie earned some points there.\n \nHopper doesn’t even give the shovel talk, just watches the two interact with each other, with El. The one time that Eddie rests his hand on Steve’s thigh, underneath the dinner table, he had received a glare and a hands where I can see them, Munson. But Steve thinks, apart from that, the dinner goes well.\n \nWhen they go to leave, and Steve has helped Hopper clean up (despite the man’s refusal), Eddie has sketched a design out for El. He had laid on his stomach on the living room floor as El described what she wanted, scribbling and erasing as she added more. As Steve goes to tell Eddie that they’re going to go in a couple minutes, his eye catches the final design.\n \nTwo floating hands interlocked at the pinky: a promise.\n \n— — —\n \nTime passes. The scarring and the bruises have slowed to a stop, no more rings around his neck, or mysterious aches in his bones. Steve breathes deep; there no longer feels like there’s water in his lungs. When he wakes up and looks in the mirror, he sees himself staring back, healing.\n \nIt’s Max that catches it. Steve’s stopped by her house to stay for the night, cook for her while her mum works night shift. It’s one of the little changes that have happened in their routine, but a welcome one.\n \nHer eyes are focussed below his hairline, above his left eyebrow. \n \n“No one ever tell you it’s rude to stare?” Steve jokes. \n \nBut Max is already pulling him towards their cramped bathroom, flicking the lights on and shoving him in front of the mirror. \n \n“That’s new, right?” She point toward the spot she was staring at. “It wasn’t there last week.”\n \nSteve looks at his reflection in the mirror, the yellow light casting a sickly glow on his skin. The scar is one that Steve doesn’t recognise at first. It’s both small and large, tiny white lines scattered across his face, from his hairline, to the skin surrounding his eye, his ear. \n \nHe turns his head, uses his fingertips to trace the lines. They’re not jagged or deep, raised or otherwise. They’re even — a tell of a scar from the time loop. But he and Robin had made that list, and he had remembered every injury, every death. \n \nThe light flickers above him. Steve looks more intently at the scars, tries to think why they look so familiar, and he’s turning his head, eyes meeting the almost-faded reminders. Taunting, fists thrown, a plate smashed over his head.\n \nBut it doesn’t make any sense. He knows that he didn’t die there. Steve remembers losing the fight, yes, but not so bad that he would have died. \n \nMax is staring at him, standing in the doorway of the bathroom. Steve decides that this is something that he can deal with, later. He turns off the lights, pats the girl on the shoulder as he leads her to the kitchen to eat.\n \n“It is new, but it’s probably nothing.”\n\n\n“I thought Dustin said they were slowing down?”\n \nSteve fills a glass of water, leans against the sink. “I thought so, too.”\n \nMax pauses from her place at the dinner table, food in front of her. She stares at the cutlery in front of her, eyes not moving away from them. Steve turns towards her fully, eyebrow cocked in question.\n \n“I think we’re starting to remember.”\n \n“What do you mean?” He says it. Thinks he understand before she even has to clarify.\n \n“I spoke to Dustin the other day, and he said he had this dream of,” Max swallows. “He had a dream of you dying to the demobats. In the Upside Down.”\n \nSteve tries to justify it in his mind. The kid had seen the bats before, and he had heard Steve say that he died. Maybe his mind had put two and two together, created a nightmare of what once was, in another loop, another time.\n \n(He knows that he’s lying to himself).\n \n“And Hopper said that he had the most vivid thought the other day. Like a memory.”\n \nShe leaves it open in the air. Max doesn’t have to mention which death it could possibly be, because it can only be two. With the way that she stares at the pale mark on his forehead, Steve thinks he knows which one Hopper remembered.\n \n“Maybe it’s not just the injuries and scars that are coming back,” Steve says, wets his lips. “I wonder if, somehow, you’re all recalling my deaths, too.”\n \nThey don’t mention it, after that. Max and Steve eat dinner at the table, and he asks her how Lucas is doing, in a teasing tone, which she responds with asking how Eddie is doing. By the end of the night, she’s tucked into bed, and Ms Mayfield is walking through the door, thanking him, giving him a quick hug, before he’s making his way back home. \n \n(Eddie proposes the idea that Steve has been looping without knowing it. Dying in the years before, and fixing things without even remembering doing so. Steve recalls the sense of déjà vu he had when he first came to, how he had brushed off what was happening, what he remembered. It doesn’t sound like such a far fetched theory.\n \nThey stay up late one night, making a list called All of Steve Harrington’s Possible Deaths (And The Times He Maybe Saved The World). It’s a lot longer than Eddie liked, and as they fill the blank spaces with possibilities, there is explaining and tears and laughter.\n \nThere are some that they become sure of, as the days pass them by. A plate smashed against his skull, a Demogorgon claw mark on his shoulder. They don’t have an answer, not even a clue of how or why. All they know, is that Steve Harrington holds many nicknames, Unkillable and Hero being some of them.\n \nThe list and the theory is distributed throughout the group. There are names next to each death, a subtle warning that Steve hopes is enough, of what they might remember, in the years to come).\n \n— — —\n \nWhen the weather starts to heat up, the kids come round the Harrington House to use the pool. They’re all shouting and ecstatic, cannonballing and diving into his pool. The water sloshes across the edges, and Steve stays very much away from the cool blue.\n \nHe doesn’t think he’ll be able to swim for a long while. When the kids aren’t using the pool, and he is alone in his house, he doesn’t look outside. Tries not to think about the pool or the lake. On some days, he doesn’t think that he’ll ever be able to swim again.\n \n“Steve! You wanna be on my team?” \n \nIt’s Dustin that asks. His hair is soaked by the water, and his curls are slick against his forehead. Lucas has Max on his shoulders, and the others are starting to pair up. Steve thinks of saying yes, thinks of how cool the water would feel against his skin. But then he’s reminded of slipping under willingly, being pulled at other times.\n \n“Nah, maybe not today.” He says.\n \n“Then you have to be referee!” Dustin shouts, not even missing a beat. He lowers his voice, whisper shouting at Steve from within the pool, arm slung across Eddie next to him. “If you rig it in my favour I’ll get you in Eddie’s good graces.”\n \nEddie gasps hand on his chest, before flopping back into the water. “I cannot believe you’d sell me and my body like this!”\n \nAnd Steve is laughing and coordinating the game, winking not so conspiratorially at Dustin when he wins his match.\n \nWhen the kids have all left, and Eddie and Steve are clearing away cans of soda and wet towels, they talk about it. Steve feels the ugly creatures of shame and embarrassment rear their heads when Eddie asks how he is, how today was. The pool. It’s not an easy conversation. There is fear and there is longing, and something else that Steve can’t name, as he looks to the water.\n \nThere’s a moment, as the conversation dies out, that Eddie confides in him something that not even the loops had told Steve. He talks about high school with distain, about his parents, and the dark thoughts that he had. It’s not an accusation, far from it. It’s a question, an acceptance, reassurance.\n \n“Do you ever stop thinking about it?” Steve had asked.\n \n“It’s not that simple.” Eddie had whispered. “Sometimes I’ll feel so happy, find myself forgetting about it. Other days it comes back full force and I feel like I can’t even breathe.”\n \nSteve thinks he understands. He mentions the ease in which he had slipped into the pool the first time. Had breathed water into his lungs, before he even knew that he was going to live again, have a chance to save everyone.\n \n“It was so easy,” Steve had cried. “They always talk about how people will have a note or a plan but I just… did it.”\n \nThe loop has left more scars than the eye could possibly see. And it will take a while for everything to become normal, for Steve to feel okay again. Eddie holds him close as he cries, and in the morning, when they are less foggy-headed, still exhausted, they schedule an appointment with a psychologist. \n \nIt feels like a step in the right direction.\n \n— — —\n \nEddie is still hesitant about attending graduation. Steve mentions what he had told him in a previous loop, about Chrissy, about how Eddie thought people would see him. Some things shift with him, Steve thinks. Things that always happen, but move as he does. \n \n“Everyone’s going to have their parents and their friends cheering for them, and I’m going to have all these people who hate me.” The words are whispered, private. \n \n“We’re all going to be there,” Steve reassures. “And we’re still going to do everything that an embarrassing family does. We’ll cheer so loud that you won’t be able to hear anything else.”\n \nHe hopes that it says everything he wants to say, hopes that it says we’re your family and we love you and you deserve this. When Eddie turns to him, hands still in their shaking, looking more sure of himself, Steve thinks that his words worked.\n \nRobin is the first one they see walk. She’s polite and smiling, cheeks red underneath the bright lights in the gymnasium, Converse still on her feet. She had complained to Steve about how her mother was trying to force her to wear heels.\n \n(“Robin, sincerely, tell your mother to fuck off. It’s your graduation. You deserve to be comfortable there.”\n \n\n“It was hard enough trying to convince her to let me wear a pantsuit, can you imagine how hard it’s gonna be to tell her I don’t want to wear heels?”\n\n \n\n“Then don’t tell her!”\n\n \n\n“She’s the one driving me there, Steve.”\n\n \n\n“Then give me your shoes and I’ll sneak them to you there. Problem solved!” \n\n \nShe had laughed over the phone and told him he was ridiculous, but the next time she had a shift at Family Video, she was passing a beaten box of Converse over the counter).\n \nShe accepts her diploma, shaking the hand of the principal, before turning towards the bleachers. Her eyes are scanning the crowd before Steve is standing and cheering for her, voice loud and noticeable above all the rest. Robin’s eyes meet his and she waves erratically, all the way to her assigned seat.\n \nWhen Eddie walks across the makeshift stage of the basketball court, strutting and confident in a way that Steve has never seen him be, they cheer. Lucas and Dustin and Mike are all standing up from their seats in the bleachers, whooping and cheering and shouting. Mrs Wheeler gives Mike a look that screams for him to sit down, but he isn’t even looking her way.\n \nRobin is cheering from her place in the crowd, and the other graduates have turned to look at her in question. But she doesn’t stop cheering, clapping and loud, as she watches Eddie. Even Nancy had joined in, raising her arms above her head and bringing her hands together.\n \nMax and Will are more subdued. Happy, and shouting and clapping, laughing at the antics of the Hellfire Club members that sit around them. Steve had even managed to rope Jonathan and Argyle into it, sees and hears them wolf whistle as Eddie kicks the back of his graduation gown upwards.\n \nSteve cheers until his voice is raw and he thinks that he won’t speak for weeks. When Eddie bends at the waist to give the world’s most exaggerated bow, Steve wants to scream you see that right there? That’s my fucking boyfriend!\n \nEddie had bought a suit, his school ceremony clothes as he liked to call them. Steve had admitted that he was a little surprised, thought that he would just rock up in jeans and the vest. For that, he received a very pointed look, and Eddie saying oh, so you don’t want to see me in a suit? \n \nSteve can admit now that he very much enjoys the view.\n \nAs Eddie grabs his diploma, shakes the principal’s hand so hard it looks like the man nearly loses his footing, he promptly flips him off and runs off stage. The crowd — those that know Eddie, those that don’t — cheer and whoop as he races out the gymnasium, teachers trying to grab him as he goes.\n \nLater, when Steve’s voice is croaky and lost, and his cheeks hurt from smiling, he gives Eddie his graduation gift. It’s a simple silver chain bracelet, with a bat (the animal, not the weapon) pendant on it. Steve has the matching one, and when he presents it to Eddie, his eyes are teary. It’s a little morbid, a little fucked, but so are they.\n \nAnd, you know, there’s a lot of things that Steve isn’t familiar with. He’s had to adjust to death meaning resetting time, and the knowledge that there are people who care for him. He’s still learning, even after all these loops, and there are so many things Steve has yet to experience.\n \nBeing picked up by his waist and twirled around is one of those things. Normally, he’s the one doing the lifting, but as Eddie holds him close, warm against his chest, Steve thinks it’s something he could get used to.\n \nAt the end of the night, after the small graduation party to celebrate more than just leaving high school, Corroded Coffin plays a set in celebration. Steve doesn’t know any of the songs apart from Master of Puppets, but he’s cheering and bobbing his head along all the same.\n \nThat is, until Eddie says, “This one’s for a very special someone in the crowd!”\n \nAnd a familiar riff is playing, messy and not as put together as the other songs, a rendition of a song that is very much not rock. But the crowd is shouting along with the singer, jumping up and down as one mass, and Steve loses what little of his voice he has left screaming the lyrics of Gimme! Gimme! Gimme! (A Man After Midnight).\n \n— — —\n \nThere’s a sticky note on the fridge that hurts a little to look at. Steve had told Eddie about shouting wants for the future into the void — the things they thought of first in their last moment. Eddie had listened, quiet, focussed, before scribbling down a list on a fluorescent pink piece of paper.\n \nThe next day, it had found its way onto the front of the fridge, stuck with a magnet of a cat, gifted to him by Robin.\n \n \nThe morning sunlight streams through the crack in the curtains, golden light and warmth pooling by the kitchen counter. Steve decides that it hurts a little less, feels like progress, when he gets to cross things off. Maybe he won’t ever get to put a line through some of them, will never be able to swim in his backyard again. Steve’s starting to realise that, maybe, that’s okay, too.\n \nHe reaches over the mess of dice and music sheets, grabs a blunt pencil from where it had been discarded in favour of sleep. \n \nWhen Eddie rounds the corner, hair sticking up in such a way that deifies gravity, places a kiss to Steve’s lips, they cross out the bottom goal, together.\n \n“How’re you feeling, Stevie?” Eddie asks. \n \n“Happy.” He replies. And for the first time a while, Steve’s starting to believe it."
}