{
    "id": "40154223",
    "url": "https://archiveofourown.org/works/40154223?view_full_work=true",
    "author": [
        "steveharringtoned"
    ],
    "title": "Don’t wanna see no blood, don’t be a macho man",
    "rating": "Not Rated",
    "archive_warnings": [
        "Graphic Depictions Of Violence"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Stranger Things (TV 2016)"
    ],
    "relationships": [
        "Steve Harrington/Eddie Munson",
        "Steve Harrington & Eddie Munson",
        "Steve Harrington & Maxine \"Max\" Mayfield",
        "Steve Harrington & Dustin Henderson",
        "Steve Harrington & Dustin Henderson & Eddie Munson"
    ],
    "characters": [
        "Eddie Munson",
        "Steve Harrington",
        "Steve Harrington's Parents",
        "Steve Harrington's Mother",
        "Dustin Henderson",
        "Jason Carver",
        "Lucas Sinclair",
        "Erica Sinclair",
        "Nancy Wheeler",
        "Maxine \"Max\" Mayfield",
        "Robin Buckley",
        "Billy Hargrove"
    ],
    "additional_tags": [
        "Hurt/Comfort",
        "Angst and Hurt/Comfort",
        "Psychological Torture",
        "Whump",
        "Steve Harrington-centric",
        "Eddie Munson Lives",
        "Hurt Eddie Munson",
        "Hurt Steve Harrington",
        "Eddie Munson-centric",
        "Steve Harrington Whump",
        "Vecna's Curse (Stranger Things)",
        "Vecna Possessing Steve Harrington",
        "Jason Carver Being an Asshole",
        "Brotherly Steve Harrington & Dustin Henderson",
        "Steve Harrington & Maxine \"Max\" Mayfield Have a Sibling Relationship",
        "Protective Eddie Munson",
        "The Upside Down",
        "Alternate Universe - Canon Divergence",
        "Episode: s04e09 The Piggyback (Stranger Things)"
    ],
    "language": "English",
    "series": "",
    "published": "2022-07-08",
    "completed": "2022-07-08",
    "words": "10,426",
    "chapters": "2/2",
    "comments": "202",
    "kudos": "7,553",
    "bookmarks": "1,191",
    "hits": "58,526",
    "summary": "<p>“Steve, that doesn’t make any sense,” </p>\n<p>Aggressively dismissing their protests with repetitive hand gestures, Steve stands from the camper-vans built in seats, speaking in the way he usually did when the kids were trying to put themselves in the line of fire. “Yes, it does. Out of everyone here, I’ve suffered the least.”</p>\n<p>He allows for a pause, just in case anyone argues. They don’t.</p>\n<p>In which Steve is adamantly against using Max as bait for Vecna after everything; going above and beyond to make sure she never has to live through that ever again.</p>\n<p>Even if that means taking her place.</p>\n<p>(He doesn’t anticipate Jason Carver finding them there.)</p>\n<p>((Or the discoveries that come when a demon is rifling through your head for the worst times of your life. Ones you may not even remember.))</p>",
    "notes": "<p>CW: season 4 canon typical descriptions of violence, minor homophobia, alluded to/vague discussions of suicide (not a main character), and general mental distress . this is Vecna’s curse after all </p>\n<p>happy reading! &lt;3</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>I hope you guys enjoyed my silly little canon divergence!</p>\n<p>If you liked this, please check out my other works—or drop me a follow on tiktok @steveharringtoned, or twt @barmykawa &lt;3</p>\n<p>Part two from Eddie’s POV coming soon to you all :-)</p>",
    "text": "\nThey stand there, gathered in their stolen vehicle-slash-home, acting as an audience for the vicious argument currently raging across the awkwardly placed breakfast table. Max, Nancy and Steve. Faces blazing and voices hoarse\n—though Nancy more so argues in defense of her plan, the one she’d so carefully formulated all morning—unlike Steve and Max, who seem just about ready to tussle over one, minute detail of that plan.\n\n \n\n“No. No way,” Steve repeats, again, for what feels like the \n\nbillionth \n\ntime, not even pretending to back down or compromise. \n\n \n\n“You can’t tell me what to do, Steve, it’s the only way this works!” Max slams her hands down on the table-top in a whirlwind of rage, the others still sitting back, watching in a mix of awe and fear. \n\n \n\n“Uh, \n\nyeah, \n\nI can, and I will, and uh, \n\nno, \n\nit’s not,” Hands finding his hips, Steve marks her with the stubbornness of a bull—the two of them going toe to toe is almost always a novelty when they share that common trait; inutterable amounts of will. “Nancy’s plan is brilliant. It’s great, as always,” He butters her up, trying and failing with the Harrington charm. “All I am \n\nsaying\n\n is that we swap some people around.” Making a little rotating gesture with his fingers, his audience looked on expectantly.\n\n \n\n“Oh yeah? And who else is Vecna going to want? You can’t just throw someone else in there and expect him to just take them, that’s shitty, Steve,” Max tosses one of her loose braids over her shoulder as she stares at the gaggle of her friends behind her, making a very obvious facial expression that’s intended to call them to her defense.\n\n \n\nThey stay quiet. Even Nancy has fallen silent, now, drawn into the audience of a Mayfield-Harrington showdown. \n\n \n\nGrimacing, Steve rolls his eyes. “I’m not gonna do that, \n\nduh.\n\n I’ll go instead.”\n\n \n\nThe passive bystanders become ultimately less passive; speaking over one another in a variety of complaints, most of them being \n\nno. \n\n\n \n\nNancy attempts to talk him down, rapidly shaking her head.\n\n \n\n“Steve, that doesn’t make \n\nany \n\nsense,” \n\n \n\nAggressively dismissing their protests with repetitive hand gestures, Steve stands from the camper-vans built in seats, speaking in the way he usually did when the kids were trying to put themselves in the line of fire. “Yes, it does. Out of everyone here, I’ve suffered the least.”\n\n \n\nHe allows for a pause, just in case anyone argues. They don’t.\n\n \n\n“I’ll bait that Vecna creep and when he takes it, he won’t have an easy time of it. We keep playing Kate Bush, I stall him long enough for Nancy, Robin and Erica to set him on fire in the Upside Down. Lucas and Max can blast some tunes on the sound system in the trailer, distract the bats,” Then he turns to the final two, who stare at him expectantly. “Eddie and Dustin, you’ll come with me to the Creel House. If I start floating, there’s no one I trust more than you morons to get me down safely.”\n\n \n\nThe silence stretches out a pause longer, before Max throws down the nearest object (a pen that then bounces away across the space,) and strides over to jab Steve in the chest with an accusatory finger. “That’s fucking stupid. You can’t do that just because you think I can’t handle it. Plus, why would he even take you?”\n\n \n\nSteve sighs, eyes shifting down to her, tired but rimmed with a brotherly fondness. “Simple. I go in there, say I’ll do anything to make your pain stop—I’ll tell him we know he needs four, that Nancy told us so,” He nods in the girl’s direction before pressing on. “I’ll say you’re like a sister to me. A goddamn \n\nannoying\n\n one who likes to \n\nargue \n\nwith me \n\nall \n\nthe \n\ntime\n\n, but still. I’ll tell him that I don’t want you to die. Tell him to take me instead. Let you live.”\n\n \n\nFaltering, Max fumbles for words, brow furrowed so hard Steve wonders how her face doesn't get stuck like that. “That’s \n\ndumb\n\n. He’ll never believe that, he can see into our \n\nminds\n\n, Steve.” \n\n \n\nDefiantly, Steve folds his arms over his chest, though there’s a hint of defensiveness about him. “That’s good. That he can read my mind.” He swallows, thickly. “Because it’s true. He’ll know it’s true, and he’ll take me instead while you stick with Lucas \n\naway \n\nfrom Vecna.”\n\n \n\nIt’s quiet, then. Max looks a mix of shocked and furious, but she doesn’t speak, only stares at him, like he’s some puzzle she can’t figure out. \n\n \n\nSteve makes use of the opportunity. “All in favour of Nancy’s plan, a little re-jigged?”\n\n \n\nAnd Eddie, (he could just kiss him for the relief of it), speaks up for him. “Yeah, man. Sure. Henderson, Harrington and Munson? We’ll be the best bait and switch ever.”\n\n \n\nRobin looks uneasy, but she trusts him, clearly, because she punches his arm. “Whatever, dingus. Me, Nance and Erica will have Henry-slash-Vecna-slash-One begging for mercy,” She loops her arm around Erica’s shoulders, giving the girl a squeeze. “Have you seen her? She’s sneaky. She’ll slip into his lair and he’ll never even know what hit him.” She grins. “And Nance is a total badass. Vecna will be sobbing for forgiveness the second she whips that felony shotgun out.”\n\n \n\n“This is stupid,” Max protests, though quieter, more unsure. \n\n \n\nLucas stands up, putting a hand on her shoulder. “No, it’s not. You’re more vulnerable, he’d take the bait quicker, sure, but… he’d kill you quicker, too. He’s already tried it once, he won’t fail again. Plus, like Steve said, he’s…”\n\n \n\n“A suburbia-born rich boy with daddy’s lovely money?” Eddie pipes up. \n\n \n\nSteve holds a flinch back at that comment, not protesting for the sake of keeping the players in his field.\n\n \n\n“Yeah,” Lucas nods, making a gesture to Max. “See? It’ll work. Besides, it’s not like we’re on the bench, Max, we’re literally gonna be drawing hundreds of deadly bats to Eddie’s Upside Down trailer. This just means that we have, like… a seventy percent chance of death, rather than you having a ninety-eight percent chance.”\n\n \n\nDustin shrugs, “I dunno, that sounds a little too optimistic.” Eddie's shoulder barges him. \n\n \n\nSighing in the way she does when she is \n\ntruly \n\nexhausted by the company she keeps, Nancy stands, arms folding over her army gear, and levels them all with a judgemental stare. “Fine. Now that’s figured out,” She glares at Steve, “Let’s go through it again, new additions included,” \n\n\n\n\n\n\n\n\n\n\nHand grasping Eddie’s as the guy hesitates to push himself off the mattress, Steve yanks him upright with enough force to nearly topple them both over. Clumsily steadying the pair of them, Steve just grins lopsidedly in the direction of his current victim. Eddie smiles back, tired, yet still dimples-and-all.\n\n \n\nHe’s not sure if it’s because he’s about to go toe to toe with Vecna, or maybe something else—something he doesn’t have the time to consider—but as they walk through the forest in the darkness, (trying to make sure nobody spots a wanted murder,) Steve reaches out for his hand.\n\n \n\nEddie takes it, obviously, because he’s earnest and raw and compassionate in a really weird, but warm way; lacing their fingers together and squeezing. “You’re gonna be just swell, Stevie. Me and my baby have got you.”\n\n \n\nFor a second, Steve thinks he means \n\nDustin, \n\nbefore Eddie looks over his shoulder to where his guitar has been slung. Right. \n\n \n\n“You’re sure you can play it?”\n\n \n\n“I can play anything, Stevie,” Eddie brings their linked hands up, pressing a kiss to the back of Steve’s. “Even if it’s god-awful.”\n\n \n\n“Hey—” Steve groans, though doesn’t drop Eddie’s hand. “Tears For Fears are \n\nnot \n\ngod-awful. They’re heartfelt.”\n\n \n\nScoffing, Eddie yanks him to the side a little, chuckling when Steve nearly trips. “I’m shocked you haven’t noticed yet, Stevie, but I’m not a heartfelt kinda guy.”\n\n \n\nNow it’s Steve’s turn to scoff—stopping abruptly to stare into Eddie’s eyes. “You’re a bad liar, Munson. All you’ve done since I’ve met you is be heartfelt,” He looks ahead, then, at where Dustin is half-jogging, their lookout in case some weird Hawkins sucker is \n\nalso \n\ncreeping around in the woods at night. \n\n \n\nEddie doesn’t say anything to that. Just looks stunned, shakes his head and drops Steve’s hand. “You gotta stop shattering my worldview, man,” Is all he offers before he skips on ahead after the younger boy, leaving Steve to stare at the back of his hand, a bit lost. \n\n \n\nHe shakes it off. Steve’s got to be Vecna's bait, deciphering the Munson mystery was for another time.\n\n\n\n\n\n\n\n\nWhich is probably why instead of letting himself hesitate, he gently opens the door, kicking off his shoes on the step and raising his eyebrows at his company until they remember to do the same. \n\n \n\nEddie looks blankly at him for a second, then silently \n\nohhh’s, \n\nunzipping his boots and padding on ahead into the Creel house barefoot. Steve hears the buzz of the lamp Eddie holds fade away into the quiet of the house, flicking the switch to his own and carefully climbing the stairs as he ensures Dustin is ready to take the floor below him.\n\n \n\nThey search—spanning out across the vast, disconcerting space of the Creel House, their lights the only comfort available—yet also their beacons, their scythes as they search for the Reaper. \n\n \n\nSteve has no luck on the second floor, dipping in and out of bedrooms to no avail. He’s just considering abandoning the space entirely when a floorboard creaks nearby, and he turns, panicked—\n\n \n\nEddie presses a hand over Steve’s mouth, miming \n\nshush. \n\nSteve, though unable to stop his heart from racing, relaxes, glancing down at the paper note Eddie lifts, in his chicken scratch: \n\nFound Vecna. \n\n\n \n\nThey silently glide down the staircase together, finding Dustin already waiting, hesitantly hovering in the entryway, his own notepad jittering in shaking hands before he eventually gathers the courage to hold it up.\n\n \n\n\nPhase one?\n\n\n \n\nSteve nods, gives his shoulder a comforting pat, before watching the boy be on his merry way, fleeing the house to meet Robin, Nancy and Erica in the playground on the flip side. \n\n \n\n(And really they had no way of knowing about the dog walker, because who walks their dog past creepy Creel House at this hour?) \n\n \n\nIt leaves Steve and Eddie, side-by-side, waiting by the glowing light of Vecna for Dustin’s next signal. \n\n \n\nIt doesn’t come immediately—so they sit together on a worn old sofa, Eddie’s knees criss-crossed, while Steve’s are at a weird angle, unable to get comfortable under the circumstances. Eddie seems to sense it, too, because he starts scribbling away on his notepad.\n\n \n\n\nHey.\n\n\n \n\nSteve stares, then scribbles back.\n\n \n\n\nHi.\n\n\n \n\nEddie smiles, then, and doodles this time, quickly illustrating a stick-figure replica of himself strumming a guitar. \n\n \n\n\nYou’re gonna be fine. \n\n\n \n\nThe corners of his eyes crinkling, Steve leans against Eddie a little, taking his pen and drawing a replica of himself, clapping, eyes wonky hearts instead of simple dots.\n\n \n\n\nI know, \n\nSteve mouths, resting his hand on top of Eddie’s. \n\n \n\nSomething passes over Eddie’s face, a thought, a want—but then it’s illuminated by artificial, flickering light. Dustin’s torch.\n\n \n\nPushing off from the sofa, Steve tiptoes to the window, taking his torch out to flicker it back to Dustin. He swallows dread that tastes suspiciously like bile, and does his best to smile at Eddie, who continues to look unjustly upset by the whole ordeal. \n\n \n\nHe rises from their previous place, stepping over to Steve, taking both of his hands into his and \n\nsqueezes. \n\nPulling them up to his mouth one at a time, kissing the backs of his palms (for luck, he supposes) and pressing their heads together, jittering with nerves.\n\n \n\nSteve takes a deep breath, knocking their foreheads, before he releases Eddie, eyes brazenly earnest. \n\n \n\nHe takes his bat from where he’s stashed it, in a sling on his back, and scoops the lamp back up again. \n\n \n\nInhale.\n\n \n\nSteve starts crashing his bat against his lamp, screaming and shouting bloody murder as he makes as much noise as he’s capable of with the wound on his throat, anything to try and get some attention. \n\n \n\n“Hey, \n\nasshole, \n\ncome pick on someone your own size!” Crash, crash, crash. Steve hammers the bat into the deformed metal. “You want a real fight, instead of picking on some kids? Come and fucking get me, you overgrown piece of circumcised \n\nforeskin—”\n\n\n \n\nEddie almost laughs at that, and is met with Steve’s scorn, violently shushing him. Vecna can’t know he’s here, too—out of the two, Eddie’s far more easy pickings. \n\n \n\n“I won’t let you hurt Max ever again, jackass. Even if I die trying, I’m gonna fucking kill you,”\n\n \n\nIt’s that line that startles the light into dimming from Steve’s lamp—he turns to Eddie, who’s just as solemn, and follows the stairs up to the attic, chasing the thrumming of the light. \n\n \n\nIt peaks in a collection of displaced furniture, damp and moth-eaten. Steve kneels, like it’s an altar, and \n\nprays, \n\nprays he takes the bait. \n\n\n\n\n\n\n\n\nHe doesn’t. Not at first. Not even when Steve swears and shouts and curses his name and family ten times over. It gets so desperate that Eddie looks just about ready to speak up, to offer himself instead—and then Steve knows he can’t half-ass this.\n\n \n\n“You have to take me,” He grips the hollow wood of the chair next to him. “Please. You have to. Those kids, they’re—they're \n\nmy \n\nkids, y’know? I look after them, they’re like—sometimes it feels like we’re all a family.” Steve gnaws at his lip. “And that’s—it’s all I ever really wanted, when I was younger. A big ol’ family, lots of siblings, younger siblings. People who’d look at me and go \n\nshit, \n\nhe’s so cool, protecting us, like that,”\n\n \n\nSteve falters, taking another violent inhale of breath in through his grit teeth. “Which is why you can’t take Max, she’s—she’s a little shit, but she’s \n\nmy \n\nlittle shit, she’s—my responsibility. So you can’t take her. Please. \n\nPlease,” \n\nHis chest heaves, his head bows. “You need four deaths. For four gates, Henry, Nancy—Nance told us. Let me \n\nhelp \n\nyou.”\n\n \n\n“Because Max, she’s—she’s gonna keep playing her music, and you won’t find her. But me? I’m \n\noffering. \n\nI’m—I’m giving you a free shot here. Take me.”\n\n \n\nThe room remains silent, save for the constant hum of the light by Steve’s head—but then, despite \n\npromising \n\nhe wouldn’t, Eddie deviates from the plan. \n\n \n\n“For fuck’s sake, Steve, it’s not \n\nworking,” \n\nAnd he looks angry, \n\nfurious, \n\nas he storms over to him, shoving hard enough to land Steve unceremoniously on his ass. “What a big surprise though, right? Your hero plot, foiled. The others—they were saying how you’d grown up, but right now? This self-absorbed failure? This is all King Steve,”\n\n \n\n“\n\nEddie,” \n\nSteve’s words get caught in his throat. “I’m—I’m sorry, okay? But you’re—you have to stop speaking, man, or he’ll—”\n\n\n\n\n\n\nThen Eddie’s eyes dive into the back of his skull, mouth falling slack, arms splayed out at his sides, and \n\nGod \n\ndoes Steve wish he stuck with his music lessons. Because as soon as Eddie freezes like that, there’s no time to try and even pretend to save him with some half-assed plan—he begins to levitate, despite Steve’s fighting attempts to drag him back down to the safety of the floor.  \n\n \n\nHe has his arms looped around his legs, trying to pull him back down—when the \n\ncrack \n\ncomes. Eddie’s legs, severing at odd angles, jutting out of his flesh in a garish, horrifying display, his arms swift to follow. And before Steve even has the chance to scream any louder, Eddie’s eyes explode back into his skull, and he drops. Collapses to the floor in a broken pile of limbs at all inclinations, sitting uncomfortably under his skin as Steve gathers him up in his hold. \n\n \n\n“Eddie?” He whispers, to the corpse, the empty eye sockets glaring back at him. “\n\nEddie?” \n\n\n \n\nIt seems that he’d made enough of a fuss in his grief—because he hears the thunderous footfalls of someone climbing the stairs, tries his best to gather Eddie’s maimed body close to his chest, too close for Dustin to see—but it’s too little too late.\n\n \n\nDustin stands in the doorway, takes one look at the scene before him, and shrieks. Shrieks, and shrieks, and wails and howls with agony. \n\n \n\n“What did you \n\ndo?!” \n\nHis voice is hoarse, raw with the salt of his tears. “\n\nYou \n\nkilled him, \n\nSteve, \n\nit was meant to be \n\nyou!”\n\n\n \n\nEyes wide enough to ache, Steve stamours to try and muster some sort of apology, or excuse, or \n\nanything, \n\nbut can’t—he sits there, shaking violently with the ruptured rag doll of Eddie in his arms. \n\n \n\nAnd then Dustin’s head snaps back, his eyes rolling into whites, and Steve really \n\nscreams, \n\nthen, because this is his \n\nworst \n\nnightmare, the most \n\nunforgivable \n\nfailure—he falls to his knees at Dustin’s side, shaking him, sobbing—and then he begins to sing, fighting for his voice to stay vigilant, to stop \n\ncracking. \n\n\n \n\n\n“Turn—\n\nturn, a—\n\nround, \n\nlook at what you… what you see—e,” \n\n \n\nDustin flies upwards, hands and legs spread rigidly. Steve bowls with rage and agony, recalcitrant from his better instincts, grief tearing him apart from the inside like hands \n\npushing \n\nhis ribs open, fisting his heart and \n\ntwisting\n\n it. \n\n \n\nIn some cruel turn of fate, Steve is forced to watch Dustin’s limbs fracture off in unnatural directions, bear witness to the way his jaw cracks away from his face; his eyes, so gentle, so kind, nothing but gaping holes that glare at him accusingly.\n\n \n\nSteve kneels, tears uncontrollably streaming down his face as his mouth hangs open, so bereaved he can’t even \n\nmove, \n\nnot even to try and tell the others—he can’t \n\nmove. \n\nHe’s stuck. And he begs, then, sobbing, for Vecna to just \n\nget it over with, \n\nto take \n\nhim, \n\nplease, \n\nplease, \n\nplease. Please. \n\n \n\nPlease.\n\n \n\nEddie sits up, limbs hanging out of their sockets as he does. Dustin drags himself across the floor by his broken fingertips. \n\n \n\n“\n\nJoin us,” \n\nThey beckon, harmonious, despite the aberrant angle of their jaws, hanging low on their faces. \n\n“Steve.”\n\n\n \n\nFace raw from his own affliction, scratches from his own nails leaving angry, raised lines down his cheeks—Steve scrambles backwards, heaving, panting, panicking. \n\n\n\n\n\n\n\nThen it all clicks into place. \n\n \n\n“This isn’t real—” Steve laughs, laughs at the broken, contorted corpses at his feet. “You took the bait, you son of a—”\n\n \n\nA vine, thick and hot, lashes out from Eddie’s misshapen mouth, curling itself around Steve’s leg and \n\ndragging him, \n\nwhipping his listless body through the Creel House, pulling and pulling until his surroundings are a blur of trees, his arms and legs and neck and face a graveyard of cuts from the rubble of the forest floor, his yells and struggles heard by no one. \n\n \n\nHis descent stops at the shore of Lover’s Lake. \n\n \n\nHe lies there, splayed out, the pulsing sensation of the vine still curling around his appendage. Throbbing, a promise of more. \n\n \n\n\n“Steve,” \n\nAnd there’s Vecna—the mirror image of the description both Max and Nancy had given, all rotten flesh and unnatural anatomy. \n\n“Do you really think,” \n\nThe vine jolts, taking Steve’s body into the shallows. \n\n“I took your \n\nbait? \n\nYou,” \n\nDeep enough that he can’t breathe, water drawn into his nose, his mouth. “\n\nTook,” \n\nAnd then a pause of mercy. Of nothingness. \n\n \n\n\n“Mine.”\n\n\n \n\nSteve is trawled under the water, with even more force than the time before, so recent, yet so distant. As he struggles, he can make out the blinding light of three watchful pairs of eyes above him, three figures on a boat at the surface. \n\n \n\nThey see him. He knows they do. But they do not come for him. \n\n \n\nOnly this time when Steve is dragged through the gate, he doesn’t find himself as flesh for the bats—he’s in a car. A car, submerged in water.\n\n \n\nThe door opens, suddenly—the vine dragging him off of the sodden seats, and he finds himself on tarmac instead, coloured with playground chalk. \n\n \n\nIt’s Hawkin’s Elementary. \n\n \n\nSteve stands, soaked to the bone, beaten and bloody, in the middle of his old preschool playground, shaken, bewildered. Because of all places, why would Vecna bring him here?\n\n \n\nNothing happened in preschool.\n\n \n\n\n“Steve! Steven, baby!” \n\n\n \n\nHead snapping up to the source of the call, Steve notes a woman with a beautiful head of golden-blonde hair, flailing her arms back and forth just in case he hadn’t seen her. \n\n \n\n“Uh—hi?” Noting the absence of the vine around his leg, Steve limps forwards, baffled by the sheer, exhilarating joy on the woman’s face as he approaches. He’s not exactly a sight for sore eyes—but she looks positively delighted. \n\n \n\nShe leans over the fence as he arrives, and suddenly Steve finds that the woman is much, much taller, and he is far, far smaller. \n\n“Oh, Buttercup. Mommy missed you,” \n\nAnd she leans over, tries to scoop him up, eyes empty and confused when he steps back away from her. \n\n \n\n\n“Who are you?” \n\nSteve finds himself saying, passive in his own younger body. \n\n \n\nThe woman’s face crumples. “\n\nDon’t say that, baby. You’re my baby, my baby boy, my son—you’re my son. \n\nMy\n\n son,” \n\nAnd she grabs him, then, looping her arms around his middle and \n\nsqueezing \n\nas he struggles. \n\n \n\nNow that she’s close, close enough to press kisses to the top of his head, to his face, Steve knows who she is. Only from pictures, old photo albums. \n\n \n\nIt’s his aunt. His mother’s sister. Aunt Julie. \n\n \n\nShe died when Steve was a kid. It was one of the many things the Harringtons never spoke about. Steve knows this. But Steve doesn’t remember this at all. Not one bit of it. \n\n \n\n\n“Julie!” \n\nHe knows that voice, no matter how long it’s been since he heard it. His mother storms across the lot, flanked by police officers and men in a hospital-like uniform. \n\n“Put him down!”\n\n\n \n\nHis Aunt Julie doesn’t—she only holds him tighter, one arm curled around his neck too tight, too tight for Steve to breathe around, the flesh of the limb twitching and shifting back and forth from supple skin to thick, hot plant life, the vine coiling around his throat unforgivably. \n\n \n\n\n“He’s mine! He’s my son, you can’t take him! He’s \n\nmine, \n\nmine, mine, mine, mine!” \n\n\n \n\nShe’s screaming, and Steve can hear some of his classmates crying, distantly, before suddenly she seizes up around him, convulsing. Collapsing to the floor, Steve is free for a moment thanks to the tasers of the ward guards, (he remembers that, a hushed argument about the expenses of his Aunt’s \n\nspecial \n\nhospital), before he’s grabbed by his mother, grabbed by the \n\nneck \n\nand thrown backwards.\n\n \n\nHe’s not in the playground anymore. His back collides with a shelf of assorted sweets, and he crumples, sitting on the linoleum floor in a small heap. \n\n \n\nIt’s a supermarket, he thinks, vaguely. \n\n \n\n\n“Stay there. Don’t fucking move from this spot until I come to get you, Steven.” \n\nIt’s his mother. She’s scratching at the back of her hands in the way she does when she wants to pop a pill to take the edge off—clearly, in this memory, that edge is Steve. \n\n“You ungrateful little shit. God, you’re just like her, sometimes? Maybe you deserve each other.” \n\n\n \n\nAnd then she’s flouncing off, and Steve’s alone in the aisle, the aisle that keeps shifting to look a little too much like Starcourt Mall for his liking. Tilting the world to the side on its axis. \n\n \n\n\n“Buttercup,” \n\nSteve’s not sure how long has passed—but it’s dark, \n\ndark, \n\nin the supermarket, the artificial lights above them flickering and dying as his Aunt Julie sprints towards him, body contorted and wrong. He doesn’t have the chance to stand before he’s breathing in something sweet. \n\n \n\nEyes flying open, Steve’s back in the car—splayed out on the backseat, vines fastening him to the vehicle as it sinks. \n\n \n\n\n“It’s okay, Steven,”\n\n Aunt Julie soothes from the driver's seat. \n\n“We’ll be together forever, now. They lied to you, Stevey-bear. They told tall tales. I’m your real mother,”  \n\n\n \n\nSteve sits there, starved for air, feeling the water rise to his knees, to the waist. \n\n“No,”\n\n\n \n\n\n“Yes!” \n\nThe woman punches the shotgun seat, shrieking for a moment before she breathes, calms. \n\n“It’s okay if you don’t understand, Buttercup. I’ll explain it all when we’re far away from here. They said I was too sick to have you, to raise you. No, no, not my baby.”\n\n\n \n\n\n“It’s going to be okay, Steve,”\n\n\n \n\nHer voice contorts, and for a flash Steve sees Vecna, glowering at him from the rear-view mirror, just before his head is submerged in the water, and he remembers, now. \n\n \n\nRemembering Aunt Julie’s funeral. Remembering the gossip, the horrified whispers. \n\nShe’d driven the car into Lover’s Lake, and tried to take poor little Steve with her. \n\n\n \n\n\nI can't imagine how his parents must feel. You can’t control crazy. \n\n\n \n\nNo. Steve doesn’t want to believe it. It’s not real—Vecna’s making it up to distress him. \n\n \n\nBut it seems that Vecna takes that as a challenge, of sorts. Because the window closest to Steve’s submerged head suddenly shatters—he’s dragged, feet first through it, out of the car, out of the water—sprawled out on his back as he’s thrown back to the shore. \n\n \n\nHe can’t feel the sand, though. And when he opens his eyes, he recognizes Joyce Byers’ ceiling, in a haze of pain and confusion. \n\n \n\nThen there’s a weight on his waist, Steve notices, in a pain-addled trance. It only takes one glance for dread to stew in his gut, brothing over until he barely remembers to suck his teeth. \n\n \n\nBecause Billy is straddling him, drawing his arm back to take a swing. And another. And another, and another, and another, and another and another another another another—and Steve remembers that somewhere in the midst of Billy knocking out his teeth, breaking his nose, his jaw, his cheekbones—that Max should’ve stopped him by now. \n\n \n\nHe risks a glance over Billy’s shoulder as it’s in motion to strike again—Max isn’t there. The kids aren’t either. \n\n \n\nJust Vecna. Taunting him, watching as the blood trickling down his throat is too thick to even cry out or scream anymore, studying Steve when he goes from agonized to complacent to passive. \n\n \n\nClearly, that makes the punishment null for Vecna. Because then Billy shifts from himself to the Russian who’d tortured him, then to the \n\nDemogorgon, \n\nand that opens a new pathway of opportunity as Steve is then surrounded, the Demodogs circling him in Joyce’s home. \n\n \n\nVecna leaves enough time for Steve to figure out what’s going to happen to him before it does. \n\n \n\nThey tear into his flesh, and no matter how much he tries to remind himself that this isn’t \n\nreal, \n\nhe can \n\nfeel \n\nit, feel their teeth, feel himself come away—\n\n \n\nAnd he screams, because it’s all he can do. Because Vecna should’ve and could’ve killed him what feels like \n\nhours \n\nago, but he’s toying with him, Steve decides. Torturing him.\n\n \n\nMaybe it’s punishment for his arrogance. For thinking that he wouldn’t have anything Vecna could use, not like this, in this dreamscape of torment. Or maybe Vecna wants to enjoy his final kill. Because the Demodogs fade away, and his fleshy, hooked hand splays out in front of Steve’s face, and he cries. \n\n \n\nHe cries, partly out of relief, partly out of acknowledgement that he’s failed. He’ll die now, when Vecna is still alive, meaning that either Steve has been here for far less time than it feels like, or something has happened to Robin, to Eddie, to Dustin, to Nancy—maybe even Erica or Max or Lucas. Somewhere, something has failed.\n\n \n\nAnd it’s Steve’s fault. They’re all going to die. \n\n \n\nHe closes his eyes, and sobs, bitterly. Waiting for the brutal conclusion to what he can safely call the \n\nworst \n\nexperience of his \n\nlife. \n\n\n \n\n(But part of him is grateful. Part of him feels closure in the fact that he didn’t let Max go through this again. And she’ll never have to.)\n\n\n\n\n\n\n\n\nBut in his closure, comes a sudden \n\nroar. \n\n\n \n\nSteve collapses to the floor. He’s on his knees. He grips his sides, and finds his body repaired, not torn apart in chunks, not drowned or beaten. \n\n \n\nAnd there stands \n\nEleven\n\n. Their girl with \n\nsuper powers. \n\n\n \n\nShe’s \n\nhere. \n\nAnd despite all that had come before, and the daze he sits in now, Steve knows she’s real. He feels it. He senses her, the power she holds \n\nhumming \n\ninside of him as he watches her \n\ntoss \n\nVecna across the red-tinted hells cape the three of them now reside in. \n\n \n\n(He recognizes it, vaguely, from Max’s drawings. The clock, floating, the fragments of Creel House above head.) \n\n \n\nWhile their fight rages on behind him, he scrambles, body coated in the thick, hot red of Vecna’s perdition, to try and get away. His mind feels detached from the rest of them, though, in hindsight, maybe that’s due to the supernatural beings \n\nfighting \n\nin it—\n\n \n\nBut after running so far, he remembers. \n\nEddie. \n\n\n \n\n\n“Eddie!” \n\nSteve’s desperate, now, turning in circles pleading for anything, the sign Max described when they’d saved her at Billy’s grave. “Eddie!”\n\n \n\nAnd he runs, again, because he feels it all he \n\ncan \n\ndo—but then the red thickness around his ankles shifts into the tangle of bedsheets, and Steve is tumbling out of \n\nhis \n\nbed, in \n\nhis \n\nroom—\n\n \n\nThe pool glows, illuminating the dark space in its sickly artificial light. It basks Steve’s father in it, who stands in the doorway, face not quite right, but not quite \n\nwrong \n\neither. \n\n \n\n\n“I always knew\n\n,” He’s crawling closer, almost serpent-like, fingers a little too long, body a little too fluid. “\n\nYou may be my son, but you aren’t my wife’s,\n\n” Then he strikes, viper-like, and grabs Steve’s face, nails sinking into the flesh of his cheeks, drawing blood. \n\n \n\n“\n\nDad,” \n\nSteve chokes, and then his other hand curls around his throat, forcing his head to turn at an unnatural angle—forcing him to look back to his bed. \n\n\n\n\n\n\n\nAnd he’s found Eddie, he supposes. Because Eddie’s there, half dressed, sat upright in Steve’s bed, looking \n\nterrified, \n\nand \n\nangry, \n\nscared for Steve, even more scared for himself. \n\n \n\nOh. \n\nOh. \n\n\n \n\n“Dad—” Steve struggles, failing to fight as the long, clawed fingers curl around his throat, cut into his Adam’s apple until he can’t breathe, let alone speak. \n\n \n\n\n“I always knew there was something \n\nwrong \n\nwith you,” \n\nComes the hiss of uncomfortably hot breath by Steve’s ear. \n\n“Do you even realize, Steve? That this is \n\nwrong?” \n\n \n\nVecna’s voice merges with the dull monotonous strain of his father’s, hissing sweet venom against his face. \n\n“That you’re \n\nwrong? \n\nYou don’t even realize,”\n\n\n \n\nEddie is across the room within the blink of Steve’s fluttering eyelids, marking him with a look of sheer \n\ndisgust. \n\nAnd he approaches, takes Steve by the shoulders, and \n\nshoves. \n\n\n \n\n\n“This willful ignorance,”\n\n\n \n\nAnd then Steve’s back is pressed against \n\nhard \n\nand wet, vines curling around his limbs, bending them at unnatural angles to keep him there, \n\nstuck. \n\n\n \n\n“\n\nIt ends now.”\n\n\n \n\nThe searing pain in his arm that comes with the first \n\ncrack \n\nis different. Steve can \n\nfeel \n\nthe difference. \n\n \n\nBecause it’s \n\nreal. \n\n\n \n\nAnd he \n\nscreams, \n\nthen, uses the very last of life in him to writhe and toss and \n\nbite, \n\nbiting down on one of Vecna’s fingers, stalling him for just a second—a drawn out, agonizing second.\n\n \n\nBut it’s enough. Because across the way, Steve sees it. An opening to a room bathed in blue light, the thrums of \n\nmusic \n\nruminating from it like a heartbeat from a pulse point. \n\n \n\nIt’s enough—because El is able to drop from where Vecna had her stuck, had her \n\nwatching \n\nwhat he was going to do to Steve—and when she drops, she drops \n\nhard, \n\nsending Vecna soaring back, away from Steve. \n\n \n\nBlood is streaming from her nose, her ears, her eyes—but she looks at Steve, and musters the strength to shout:\n\n \n\n\n“Run!”\n\n\n \n\nHe does. \n\n \n\nThe purring hum of an electric guitar draws Steve to his start like a moth to flame, and he begins to run, \n\nrun\n\n like he’s never moved before. \n\n \n\n\n“I wanted to be with you alone,\n\n\n\n\nAnd talk about the weather,”\n\n\n \n\nThe hissing snakes of Vecna’s vines whip after him, Steve narrowly missing the curve of one around his ankle, tears streaming down his face as he throws all of himself into listening. \n\n \n\n“\n\nBut traditions I can trace against the child in your face,\n\n\n\n\nWon't escape my attention,”\n\n\n \n\nListening to Eddie, to \n\nEddie, \n\nEddie playing that cheesy, stupid song that Steve likes too much. \n\n \n\n\n“You keep your distance via the system of touch,\n\n\n\n\nAnd gentle persuasion,”\n\n\n \n\nListening to Eddie sing, voice rough and full of pain, and desperation, neediness strummed through on the growls of his guitar. \n\n \n\n\n“I'm lost in admiration, could I need you this much?\n\n\n\n\nOh, you're wasting my time,”\n\n\n \n\nHe laughs, and sobs, hurling himself over vines and fleshy, vicious obstacles in his path, every burning step getting him \n\ncloser, \n\nhugging the dead, aching weight of his broken arm to his chest. \n\n \n\n\n“You're just, just, just wasting time,”\n\n\n \n\nSteve’s close—he knows he is. So close that when he trips, one stray vine snapping around his ankle, he cries out—and swears by the look on Eddie’s face through the gaping tear in reality that he \n\nheard \n\nhim. \n\n \n\n\n“Something happens and I'm head over heels,”\n\n\n \n\nHe kicks, wrestles, and then brings the vine up to his mouth, contorting his body, and he \n\nbites, \n\ntears through it with his teeth. \n\n \n\n\n“I never find out until I'm head over heels,”\n\n\n \n\nAnd it drops, severed in his lap, Steve \n\ncrawling \n\nto get away, crawling with one arm until he finds his footing again, skin baked in the red of Vecna’s hellscape. \n\n \n\n\n“Something happens and I'm head over heels,”\n\n\n \n\nAll he can do is run. He runs, runs until he feels his ribs are going to skewer him from the inside, runs until his lungs feel like they can no longer expand, runs until all he can taste is his own blood, sweat and tears. \n\n \n\n\n“Ah, don't take my heart, don't break my heart,”\n\n\n \n\nSteve’s close enough now, just wisps away, close enough to see Eddie playing, sobbing over his guitar while his body levitates in the air above him. One of Steve’s arms is pointing the wrong way, and Eddie looks a mess of marred flesh and swollen injury, but he keeps playing. \n\n \n\n\n“Don't, don't, don't throw it away,”\n\n\n\n\n\n\n\n\n\nHis eyes open. \n\n \n\nSteve drops. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Steve?”\n\n\n \n\nYeah, no—Steve is gone, the full Chrissy effect settling into the stiff posture of his body as his back straightens despite his kneeling position. Eddie resists the urge to hurl, forces himself to look away, to escape the temptation to relive what had happened in his trailer. (Though it felt like a lifetime ago, now.)\n\n \n\nHe has to focus, but that’s never been his strong suit, \n\never, \n\nin fact—it’s almost entirely the reason he’s continued to fail school, aided by a hatred from his teachers and a general educational exhaustion. Eddie Munson is good at knowing when it’s time to pack it up and go home.\n\n \n\nWhich is why he’s going against every rule in the Munson Doctrine by still being here, trying to make sure \n\nSteve Harrington \n\nof all people doesn’t become Vecna’s next victim. Vecna, the inter dimensional \n\nmind demon.\n\n\n \n\nEddie’s always been told he’s had one foot in crazy, but this feels beyond \n\ninsane.\n\n\n \n\nNonetheless, he signals Dustin through the window, flashing the torch to indicate the start of phase three—and gets no response.\n\n \n\nEddie trusts Dustin. Trusts him more than anyone else in their little gaggle of monster fighters—he’s one of his best friends, no matter how lame that feels to say to other people. But when he flickers that torch time and time again and gets no response? That’s when Eddie begins to worry.\n\n \n\nSo Eddie turns and looks at Steve, who’s still kneeling (not floating yet, thank god), his eyes rolled back to milky whites instead of the chocolate browns he’s so used to, his body slack yet stiff. \n\n \n\nWills him to tell him what to do here. Because Steve is heroic, Steve dives into lakes headfirst to find supernatural gateways, Steve kills doglike demons with a bat, Steve tears underworld creature apart by the \n\nteeth. \n\nSteve would know what to do. \n\n \n\nBut Steve is busy doing those stupid heroics—and that leaves Eddie. Eddie the Banished, who flees at the first glance of danger—but he hasn’t run yet. Instead, he rushes around trying to make sure everything is ready for when Steve \n\ndoes \n\nbegin to float, not willing to experience a rerun of Chrissy, especially not with Steve.\n\n \n\nEddie still remembers the cutting, childish jealousy that came whenever Dustin would launch off a tangent about how badass Steve was, who at the time Eddie only knew as \n\nKing Steve, \n\nthe same guy who’d lost his girlfriend to Jonathan Byers and had gone fisticuffs with him behind the theatre. \n\n \n\n(That kind of news always sent shockwaves across the little freak community at Hawkins High, Gareth had told him all about it with a blunt between two fingers, definitely more invested than he claimed to be:\n\n \n\n“I’m just saying, it’s \n\ncrazy\n\n. Steve Harrington losing a girl like Nancy Wheeler to Jonathan Byers, of all guys. Either Steve’s losing his touch or maybe guys like us stand a chance,”\n\n \n\nAnd he’d elbowed Eddie when he’d said that, as if Eddie would ever be interested in a girl like Nancy Wheeler, or any straight-laced, flowery-scented \n\ngirl \n\nat all. But Gareth was never intentionally cruel, nor did he really have ill-intentions in conversations like these, so Eddie would always just tune him out. \n\n \n\nTake another hit and blame it on the good stuff.)\n\n \n\nBut King Steve had become \n\nStevie \n\nas soon as Eddie reluctantly followed them all down into the hellscape that was the Upside Down, just to save his life—or maybe, more specifically, Steve had become \n\nStevie\n\n when Eddie’s heart nearly stopped. Over that \n\nbat. \n\nThe bat he’d taken into his mouth and shredded with his \n\nteeth. \n\n\n \n\nThat sort of stuff does things to a guy who’s Hawkin’s given middle name was \n\nThe Freak. \n\nThe kind of thing that had him calling Steve \n\nbig boy, \n\nor getting up in his space, just to see how close he \n\ncould \n\nget before he hit the atmosphere and burnt up into nothingness. \n\n \n\nAnd that kinda thing couldn’t be carried into a place like this. No way. Eddie had bundled up all inappropriate urges for Steve Harrington and left them on the doorstep of Creel House like a fresh little orphan in a cute little basket. \n\n \n\nIn doing so, however, Eddie Munson had unfortunately learnt a few things about himself:\n\n \n \n\nThere was someone climbing the stairs.\n\n \n\nWarily, Eddie assumes it’s Dustin, and calls out to him.\n\n \n \n\nJason Carver slams his way into the attic of the Creel House, shoulders as firm as iron, face as venomous as the tail end of a super pissed off scorpion. Distinctly, Eddie remembers having a nightmare similar to this, being discovered by Chrissy’s boyfriend and suffering the slow, agonizing consequences. \n\n \n\n“\n\nEddie\n\n Munson,” With a flake of humour amongst a sea of fear, Eddie notes just how much Jason Carver speaks like a typical, corny movie villain. “You’ve been a hard guy to find, recently, Munson.”\n\n \n\nHe’s not sure what to do, where to stand—so he settles for positioning himself in front of where Steve kneels, like a child trying to cover a mess they’ve made. “You and your \n\nbuds \n\nhaven’t exactly made—being out and about \n\neasy \n\nfor me.”\n\n \n\nIt looks like Jason’s lip curls to make another spiteful quip about Eddie’s general existence, before he falters. In trying to shelter Steve, he only drew more attention to the other boy in the room—and judging by the expression on their guest’s face, made everything \n\nten \n\ntimes \n\nworse. \n\n\n \n\n“Harrington?” Circling, Jason tries to get a better look at Steve, finding Eddie in his path. \n\n \n\nInstead of going, \n\nHey, Eds, don’t suppose you mind shuffling to the left a little, I wanna get a good peak at Steve, there, \n\nJason Carver bares his teeth, and takes a gun out of his letterman jacket, kindly leveling it at Eddie.\n\n \n\n“Step aside,”\n\n \n\nAnd Eddie, though he does hesitate, stumbles a little to the left—because if he gets \n\nshot, \n\nthere’s nobody to save Steve. And then they’re all fucked anyway. Four deaths? Game over. \n\n \n\nUnfortunately, letting Jason see Steve from the front made any chance of negotiating his way out of this attic alive about a million to one. \n\n \n\n“What have you \n\ndone \n\nto him, devil worshipper?!” Because in hindsight, he supposes he can understand where Jason might’ve got that idea from. Steve Harrington, pretty-faced, straight-laced, golden-boy of the century, kneeling at what looked like an altar, eyes so far back into his head he seemed the loveliest little caricature of a possession victim. \n\n \n\n(Then again, he sort of \n\nwas \n\nthat.) \n\n \n\nBut Eddie, because that’s just who he is, chokes out a pained dismissal, an earnest, “I didn’t do this, Carver, you gotta listen to me,”\n\n \n\nApparently, telling the guy who thinks you murdered his girlfriend to do anything is a really bad idea, because abruptly Eddie gets a kick to the chest, toppling backwards against one of the roof beams. \n\n \n\n“No, you’ve gotta listen to \n\nme, \n\nyou goddamn \n\nfreak. \n\nI know what you are,” (Boy, doesn’t that sound familiar, Eddie thinks, bitter with the irony), “I know about your transpondence with Satan. I know you’re his vessel.”\n\n \n\nTo this, Eddie realizes that the tiny inklings of utter insanity Jason Carver had shown before in his school-wide pep talks and the like had congealed and become one, big, monstrous mega-monopoly of \n\ntotal \n\nblazing \n\nlunacy. \n\n\n \n\n“What have you done to Steve Harrington?! I won’t ask you again, \n\nfreak!” \n\nThe gun gets up and personal in Eddie’s face, now, the butt of it forced into his cheek, Jason Carver spitting with rage. From this close, Eddie can really see the way he shakes with it, with the sheer power a kid gets with a weapon in hand, with any sort of control over life like that.\n\n \n\n“It wasn’t—Jason, \n\nJason, J—\n\nJason, man,” Taking only light gasps of air in through his mouth, Eddie’s hands dig into the wood of the roof support beam behind him, trying to find some semblance of stability. “Man, \n\nman, \n\nI promise you this—\n\nthis\n\n isn’t me, this, the—the. \n\nEverything, \n\nnothing, it wasn’t me, it still isn’t—” He’s cut off by his own cry of pain when Jason grows tired of him talking and cracks the barrel of the gun against his jaw so hard, Eddie marvels over the strength of the bone for resisting a fracture. \n\n \n\nJason’s breath is hot on his face, and Eddie whimpers, whimpers for shame, for fear, for guilt—because if this goes any more sideways, they’re all going to die here. \n\n \n\n“You’re a vile liar, freak. Let me take a guess, we’ll see how right I am,” Metallic-smelling hand gripping Eddie’s face so hard he can barely breathe through his fingers, Jason presses on, a fire blazing in his eyes. “Steve Harrington. You’ve failed school, what, twice, now? So you two would’ve started out together. You’ve known him for a while, but you guys don’t really \n\nrun \n\nin the same \n\ncircles. \n\nHe’s popular, he’s funny, he’s got friends, girls, money, a pretty nice picket-fence future set up on the horizons,” \n\n \n\n“Maybe he’s an asshole to you, maybe you guys butt heads back when he was in school. I don’t remember you guys scuffling, at any point—so maybe you’re a friend of Byers. Freaks stick together, right?” The tip of the gun is dragged down Eddie’s temple, rendering him entirely too terrified to move. \n\n \n\n“Let’s say you’ve been planning this for a while. Nancy Wheeler picks him out—seduces him, makes him the perfect target for you and your cult. Byers kicks him when he’s down,” The way Jason paints the picture—it’s grandiose, but Eddie can see it, in a way. \n\n \n\nThe way that you ‘understand’ a five year old thinking that money \n\nactually \n\ngrows on trees for a while until someone explains that it was a joke. \n\n \n\n“You did something to him, you and your cult, over thanksgiving. He came back \n\nbroken. \n\nNancy Wheelers your temptress, and when he wouldn’t join you, you all did something,” The gun is glued to his temple. “I don’t know what. But he hasn’t been the same. He was the \n\nstar, \n\nMunson. We all wanted to be like him.”\n\n \n\nAnd that makes sense, too. Jason, idolizing Steve—he’s older, and once would’ve been Jason’s senior, the captain of his basketball team when Jason was a freshman and bench warming. Guys like Jason would’ve given anything to get a piece of \n\nKing Steve. \n\n\n \n\n“What, you think—you think we did something to him, just—just because, ‘cause he came back and realized he’d been a—an A-grade, grade \n\nasshole,” \n\nIt comes out a little shaky when his jaw won’t move the way he wants it to. \n\n \n\nJason doesn’t like that. No, Jason wraps his hand around Eddie’s throat and squeezes. “I’m talking, \n\nfreak. \n\nShut your goddamn mouth before I blow it wide open,” And then the gun sits on Eddie’s bottom lip, and he struggles for just a second until Jason forces it against his teeth, and he realizes then that he’s \n\ncrying, \n\nhe’s dry-heaving and trembling hard enough to hurt. \n\n \n\n“Whatever you’ve done to him, it’s all—all been leading up to this, hasn’t it? You took Chrissy, then Fred, Patrick… all of this, he’s your true sacrifice, isn’t he?” There’s a wildness to Jason’s eyes, something so out of reach that Eddie is \n\nfrightened, \n\nbecause he leaves no door open to empathize with him, let alone talk him down. \n\n \n\n(Not that he could with a gun in his mouth.) \n\n \n\n“What \n\nI \n\ndon’t get is why him? Why Steve?” Yet again, he refuses to let Eddie respond, smacking the gun against the front of his teeth hard enough that he can feel his gums \n\nbleed. \n\n“Out of all the guys, he was one of the better ones to you \n\nfreaks. \n\nIf you were doing it because you \n\nhated\n\n him, had some vendetta, it makes no sense. There are people who’ve called you worse, \n\nMunson.” \n\n\n \n\nDread drips like sweat down the dampness of his neck, and as soon as Eddie understands where Jason is going with this, and the guy seems to see that, feed on it. “You must be in love with him, \n\nfreak.” \n\nEddie knows what word he really wants to use. “Maybe this is what you think \n\nlove \n\nis. Sending him to be with your \n\nDevil \n\nin hell for eternity,” He raises his voice, then, taking Eddie across to where Steve kneels by the neck, drawing the gun from out of his mouth to press against the back of his head, military style. \n\n \n\n“Wake him up.”\n\n \n\nSteve’s milky white eyes glare back at them. \n\n \n\n“I can’t,” Jason grabs a fist of Eddie’s hair and \n\nsnaps \n\nhis head back against the butt of the gun. Not the answer he wanted, clearly. “If—If I do, if I wake him up \n\nnow, \n\nmore people will die,”\n\n \n\nJason clicks his tongue. “\n\nNo, \n\nMunson, if you don’t wake him up, \n\nyou \n\ndie. For Chrissy, for Patrick, for Steve. I’ll blow your fucking brains out right here by his goddamn body.” \n\n\n\n\n\n\n\nIt’s at that moment that Steve decides \n\nnow \n\nhe has to start levitating. \n\n \n\nAnd despite his fear, despite the body-numbing, mouth-bleeding \n\nterror, \n\nit’s exactly what Eddie needs.\n\n \n\nWhile Jason’s head snaps to marvel at Steve’s body beginning to lift, Eddie swerves out of his line of fire before turning and \n\ntackling \n\nhim to the floor. He takes his wrists and straddles him, going for the gun—it’s the only thing Eddie really succeeds at, tossing it across the room.\n\n \n\nIn doing so, he leaves himself open for Jason to roll them over, smacking Eddie’s head against the floor once, twice—he loses count after the fourth or fifth, and Jason loses interest, deciding that fists are much more exciting instead. Eddie can see Steve, though blurred and tinged with the red of his own blood running into his eyes—lifting higher, higher, limbs falling stiff out behind him. \n\n \n\nNot that it matters—Eddie was never a fighter. Eddie never started fights, they sought him out and beat him down, it was never fair, or even, just someone deciding they didn’t like him, the \n\nfreak, \n\ndeciding that his mere existence had earned him the taste of his own blood, earned him a crooked nose that was now entirely facing the wrong way. \n\n \n\nJason had definitely decided this was the case—he sits on Eddie’s chest and tears out handfuls of hair, swings and swings and swings until Eddie can’t see, can’t hear anything but his panting cries that this was all for \n\nChrissy, \n\nbut if Eddie knew anything about Chrissy, kind, gentle Chrissy—she wouldn’t have wanted this whether Eddie murdered her or not. \n\n \n\nWhen he’s certain that Eddie’s in no state to follow after him, Jason stands, and barrages him with kicks in his side, gives his fists a rest—he doesn’t stop, not until he can hear the crack of Eddie’s ribs, until his cries of pains subside into muted whimpers. \n\n \n\nEddie can’t move. He’s a little sure that he might be missing one or two teeth, too. There’s blood coming from his nose in gushing waves, a wound on his head that’s blinding him as it streams down his face. \n\n \n\nHis fingers aren’t broken, at least. Jason didn’t get there yet. \n\n \n\nIt’s dwelling upon Jason when Eddie comes to the horrifying comprehension that Jason is gone. And Eddie can’t follow after him.\n\n \n\nThe cool metal of the gun against the back of his head confirms his worst suspicions. \n\n \n\n“Jason. \n\nJason,” \n\nEddie spits out one of his teeth, dry heaving over the floorboards of the attic. He knows it’s useless, begging for his life—Jason decided that he wanted Eddie dead as soon as Chrissy’s body was found in his trailer. But he can’t help it, nor can he help sobbing, sobbing bitterly because he can’t believe this is how it all ends, how Nancy’s plan is totally ruined, because Eddie’s brains are about to decorate the floor in the Creel House and nobody will save Steve, and Hawkins will fall. \n\n \n\nJason gives him no comfort into the hands of death. Instead, he kneels, picks Eddie up by the hair and laughs, cruelly, into his ear, and clicks the safety off. “See you in hell, \n\nfreak,”\n\n\n \n\nAnd there’s a crack, an ugly, gruesome crack. It doesn’t sound much like a gunshot, but Eddie supposes it might sound different when it’s lodged in his brain. \n\n \n\nA handful of seconds pass.\n\n \n\nEddie’s not dead. Jason Carver collapses in a heap next to him. \n\n \n\n“Eddie!” With the last of his strength, he rolls over onto his back, coughing up a mouthful of blood. \n\n \n\nHe could cry for joy. It’s \n\nDustin. \n\nWorse for wear, but \n\nDustin. \n\nGrinning, bruised and definitely beaten (by one of Jason’s friends, no doubt, he thinks, sick to his stomach) holding Steve’s nail bat like the Olympic torch. \n\n \n\nHis other hand is stuck out, an offering. Urgent—as he notices Steve, poor Steve, convulsing in the air, the time he has left slim, yet crucial—for all of them. \n\n \n\nSteve’s arm breaks. \n\n \n\nThey’re out of time.\n\n \n\nTaking it, Eddie stands, choking back the urge to throw up his insides—and takes his guitar, standing at the foot of Steve’s hovering body, and uses whatever last life he has left kicking in him to play that stupid, corny song he likes. \n\n \n\nHe sings, though his voice is raw and pain litters his every word. He strums his guitar though his fingers shake and he thinks his shoulder might not be in its socket. \n\n \n\nEddie plays for every person Vecna killed, for every injury inflicted on the kids since this all begun, for Nancy Wheeler and her felony shotgun, for Robin Buckley and her clumsy charm, for Max Mayfield and her admirable stubborn fire, for Lucas Sinclair for his deep compassion, for Erica Sinclair and her wits, her bravery despite her age. Eddie plays for Dustin, who can barely stand, but does so, stands \n\nwith \n\nhim, keeping him upright, his light in the darkness, his best friend. \n\n \n\nEddie plays for Steve, \n\nswears \n\nhe can hear his voice, his anguish—and Eddie plays harder, plays until tears are running rampant down his face, til he can barely breathe for pain and love and relief and fear. \n\n \n\nPlays for Steve and his stupid, lopsided smile, plays for Steve and his perfectly mussed hair, plays for Steve and his earnest affection, Steve and his moronic bravery, Steve and his utter dedication to protecting them all. \n\n \n\nAnd Eddie knows that if this isn’t enough—if they lose, now, that they would’ve fought as hard as they could. Steve, Eddie and Dustin, together, on the dusk of their final day, bleeding together, dying together. \n\n \n\nEddie thinks that if he should die, there are no better people for him to die with. \n\n \n\nHe pushes that sentiment into the rasp of his voice, contorts his body to force it to keep \n\nplaying, \n\nrefuses to fall, now, though he can feel death clambering at him, clawing. \n\n \n\nEddie plays for Steve. Plays with more heart than he’s ever had. \n\n\n\n\n\n\n\nSteve drops. \n\n\nEddie follows suit. \n\n\n\n\n\n\n\n\n\n\nThe hospital only had pink left for Steve’s cast. Eddie thinks it’s cute, Dustin thinks it’s funny. \nThe three of them are in the same wing of Hawkin’s medical for a couple days, with Eddie and Dustin’s ribs both a sorry state, though Eddie much worse for wear. He supposes that Dustin must take after Steve that way—he managed to fend of Jason’s sadistic friend far better than Eddie did Jason, and it’s evident. Evident in the way that boot prints climb up his side and his back, evident in the way that the nurse saw the break of Eddie’s nose and said if Jason had hit any harder it might’ve killed him for good. Evident in the severe shoulder injury they say he might never fully recover from, evident in the minor fracture of his jaw and the severe concussion that knocked him out in the attic, leaving Dustin with his two favorite, older male friends completely unconscious at his side. \nHawkins Lab were quick with Eddie’s government pardon—they brought it into the hospital with the three of them, in fact, confirmation of another killer, some made up serial murderer from Europe, as opposed to an alternate dimension. \nEddie’s grateful for that. He doesn’t really fancy being cuffed to a hospital bed, it’d be a bit on the nose and it’s not how he likes it to go, typically. \n(Steve had laughed at that, the first time he made the joke. Dustin had just scrunched up his face and looked confused.)\nPhysically, Steve got off the best of the three of them. Mentally, not so much. The entire stay at the hospital he refused sleep, the doctors hooking him on the real good stuff without mentioning it until he couldn’t keep his eyes open any longer. \nIt didn’t work, though. Vecna’s curse clearly triumphs over all human drugs, because Steve had a couple hours of shut eye until he woke up in complete, screaming, sobbing hysterics. \nEddie had clambered into his bed, after that. Had curled up like a wounded dog at his side and listened, casting a hand through his hair as Steve whispered every last horror he’d been shown from start to finish, Eddie unsure whether to be flattered or sickened by his repeated guest appearances. \nEddie listens, and realizes that he’d take another life-threatening beating from Jason before having to go through something like that, the way Steve viscerally describes it, sometimes having to pause just to stop himself from heaving again. \n(It doesn’t help dissuade Eddie from thinking, just maybe, that Steve might be the most fucking badass guy in the universe.)\nMax is one of the first kids to visit, or maybe they gave her a chance to come and see Steve alone. Either way, Eddie wakes up in the early morning and she’s there, a nasty wound on her neck almost identical to Steve’s, whispering away in hushed voices as Dustin snores lowly and Eddie tries to keep his breath even. \nSteve talks through what he saw with her. He sounds a little less aggrieved, but he also can’t bring himself to go into as much detail as he did with Eddie. \nEddie feels bad when he’s pleased by that. Mostly because he knows that Steve is trying to spare her, she’s already had her time with Vecna, she doesn’t need the additional nightmare fuel of Steve’s more… elongated experience. \nNancy, Robin, Lucas and Erica come together as a unit. They explain their end of things—the vines that had almost killed the girls, Lucas speaking of the bat that had almost killed Max, showing off his own gnarly scar he got from saving her. Robin speaks in colour and depth about how amazing Nancy’s kill shots were, then gushes about Erica and her total vicious destruction of Vecna’s physical form. \nSteve catches Eddie’s eye across the room, and finds himself met with the same fondness for their guests. \nThe girl with superpowers comes to make sure that Steve is alive. Their conversation is a bit stilted, no doubt because from what Steve had said, this girl had seen a little too far into his brain—but he gives her a hug nonetheless, thanks her for saving the day. For saving him. \nEddie could feel jealous about that, but he doesn’t—because Steve had climbed into his bed, in the middle of the night, wordlessly lying beside him for a while. Then he can’t stop talking, mumbling thank you’s and sorry’s, Eddie finally discerning the strange tinge of Steve’s expressions as guilt. Guilt every time he sees his sling, the bandages around his head, the bandages around his middle. \nEddie calls him stupid. They kiss.\n \n(Not quite in that order.)\n \nDustin goes home, first. Mrs Henderson comes in and fusses over the lot of them, cries, and kisses all three of them on the head until Dustin is so mortified he flees the building entirely. \nEddie is discharged alongside Steve by lunchtime.\nSteve can’t drive, so they walk—it’s a long trek, but Eddie feels like they need the air and the space, the time to just be side by side without the threat of death. They’re quiet, and it’s nice, comfortable—their hands are linked and Eddie is thinking about the stupid guilt on Steve’s stupid face and that’s when he calls him stupid, out of the blue. \nSteve takes it well—he’s heard it before, mostly because it’s true. He is stupid. Eddie finds it charming. \nThey argue playfully, taunting each other until they’re both so worked up they decide that no guilt is allowed for either of them, and Steve lasts not even five seconds before he tries to refute that again—\nSo, naturally, Eddie pins him up against a tree and kisses him. Kisses him in the middle of the forest, bathed in midday light yet also the cool shelter of the thick wildlife above them.\nSteve takes a minute to reciprocate, but Eddie doesn’t take it personally—Steve is sometimes a bit slow on the uptake, even when the uptake is another boy trying to make out with him against a tree. Nonetheless, they get there, and they kiss until Eddie is groaning in pain from his broken and bruised ribs, and Steve is about ninety percent sure that if they continue he’s going to pop some stitches the hospital did their best sewing in over the demobat flesh wounds. \nWhen they reach Eddie’s trailer, Steve waits outside. \nEddie reunites with his Uncle Wayne—who’s clearly been told to expect him, a suitcase by the door as he sits, stone-faced on the sofa, warmth flooding the lines of age and easing them into pure, unadulterated relief when his nephew finally returns. \nInsults fly readily at him, bouncing off of him like the waxy layer on a leaf against rainwater. Eddie is just grinning, crying, and then hugging his old man, who promises he never doubted him, not even for a second—and Eddie believes him, because Nancy Wheeler had told him all about his Uncle Wayne adamantly defending him like his own. \n \n“You are my own,” He’d said, before making a remark about how Steve was probably going to keel over if Eddie left him outside for much longer.\n(Eddie invites Steve inside.)\n \nThey sleep together in the trailer, in Eddie’a bed, a tangle of sore limbs and injured sides, concussed and high on the good stuff Hawkins sent them home with. It’s tender, just a night of lying there in silence with each other, basking in the aftermath of their trauma, their fear. \nEddie tells Steve he don’t think he’ll ever be okay. Steve says he doesn’t think he will be either. \nMaybe they’ll heal together. Maybe they’ll crash and burn, self destruct. \nEddie doesn’t think he minds—so long as they do it together. "
}