{
    "id": "40571238",
    "url": "https://archiveofourown.org/works/40571238?view_full_work=true",
    "author": [
        "BoredomBeckons"
    ],
    "title": "Paranoia",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [],
    "fandoms": [
        "Batman - All Media Types",
        "Justice League - All Media Types"
    ],
    "relationships": [
        "Dick Grayson & Bruce Wayne"
    ],
    "characters": [
        "Dick Grayson",
        "Bruce Wayne",
        "Clark Kent",
        "Diana (Wonder Woman)",
        "Hal Jordan (Green Lantern)",
        "Hawkgirl (DCU)",
        "Arthur Curry (DCU)",
        "Barry Allen",
        "Oliver Queen",
        "Dinah Lance",
        "Alfred Pennyworth",
        "Victor Stone",
        "J'onn J'onzz",
        "Tim Drake",
        "Barbara Gordon",
        "Damian Wayne",
        "Titus | Damian Wayne's Dog",
        "Ace the Bat-Hound",
        "Jarro (DCU)"
    ],
    "additional_tags": [
        "Miscommunication",
        "Hijinks & Shenanigans",
        "It's Not Paranoia If They're Really Out To Get You",
        "Secret Identity",
        "Troll Bruce Wayne",
        "Bruce Wayne is a Good Parent",
        "Bruce Wayne is Batman",
        "Dick Grayson is Nightwing",
        "Home Alone Inspired Shenanigans",
        "Batfamily Meets Justice League"
    ],
    "language": "English",
    "series": "",
    "published": "2022-07-26",
    "completed": "2023-10-22",
    "words": "21,646",
    "chapters": "14/14",
    "comments": "1,526",
    "kudos": "11,219",
    "bookmarks": "2,245",
    "hits": "127,741",
    "summary": "<p>Batman trusts the newest Justice League recruit almost instantly.</p>\n<p>This is so out of character, it makes the rest of the team suspicious.</p>\n<p>Who is this Nightwing, and what is he up to?</p>\n<p>Bruce Wayne was having a party</p>",
    "notes": "<p>For the purposes of this fic, Dick was never Robin. Batman trained him but never let him fight as a child.<br>He created the Nightwing persona once he was an adult and that was his first hero identity.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p>Sorry for the wait. I'm job hunting and it's draining all my energy</p>\n<p>Hope you enjoy the chapter</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">notes</a>.)\n</p>\n<p>Why a teapot? Because no one gets suspicious when a butler reaches for a teapot.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_8_endnotes\">notes</a>.)\n</p>\n<p>Giving Jason a happy life free of murder clowns is my favourite use of fanfiction and I will do it every chance I get</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_9_endnotes\">notes</a>.)\n</p>\n<p>Writing shenanigans is harder than I thought.</p>\n<p>Halloween spirits, send me inspiration!!</p>\n<p>Since several people have mentioned it, I'm adding a note; he can't use Alfred the cat because Alfred the cat is hiding and refusing to get involved in the shenanigans</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_10_endnotes\">notes</a>.)\n</p>\n<p>When I first started writing this I had no idea of where it was going beyond Bruce and Dick dealing with the League and their misassumptions, now I’m just embracing the chaos and dragging all sorts of Batfamily members out of the woodworks. What year is this set? Who knows? What universe? Who cares? Who else will show up? I'll be just as surprised as you to find out.</p>\n<p>I have no plan and I’m sticking to it.</p>\n<p>Sorry for the long wait. Winter sucks the life out of me.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_11_endnotes\">notes</a>.)\n</p>\n<p>Once again, sorry for the wait. I've had zero motivation recently.<br>Currently sick with covid and making the most of being basically bedridden to finally write a new chapter.<br>Had to reread the last few chapters to remember where everyone was and what the heck they were doing.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_12_endnotes\">notes</a>.)\n</p>\n<p>Edging ever closer to the end of this madness :)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_13_endnotes\">notes</a>.)\n</p>\n<p>I had planned to do one big final chapter but decided to split it in two and post this part now rather than keep you waiting. I have about half of the next bit ready to go so fingers crossed the final chapter shouldn't be too far away.</p>\n<p>There were way too many characters to keep track of in this scene lol. I wrote the whole thing then realised I had forgotten people and had to go back and add them.</p>\n<p>I have no idea if my descriptions of powers are accurate. Just loosely going by what Wikipedia says and whatever fits the story.</p>\n<p>Sorry for any spelling / grammar errors. I try to proofread but there always seems to be more I've missed.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_14_endnotes\">notes</a>.)\n</p>\n<p>I've had this mostly finished for a while now but wasn't quite sure if I was happy with it, I have accepted now that this is as good as it's going to get. My brain has officially gone on strike and won't come up with anything else. I hope you all enjoyed it at least. Let me know if I forgot any characters, I was struggling to keep track by the end.</p>\n<p>Sorry to anyone who's comments I didn't respond to. Sometimes I'm just not in the right headspace to reply and then suddenly it's a month later and I think, well if I respond now it will be weird.</p>\n<p>Please know that I have read and appreciated every one of them. Thank you so much for sticking with me.</p>\n<p>I hope you liked the little Alfred, Diana twist. A combination of the Pennyworth series and WW 1984 planted the idea of them meeting when Alfred was younger in my brain and I had to use it.</p>",
    "text": "“So, what’s the emergency?” Green Lantern demanded, looking around at the other confused faces in the room and then back to Flash who was pacing nervously at the front. At least that’s what Lantern assumed the red blur flickering back and forth was.\nThe speedster came to a stop, facing the room with a worried expression on his face. Hands wringing in agitation.\n“We have a problem,” he revealed at last. “With Nightwing. I don’t know if we can trust him.”\nA distressed murmur spread through the room. Nightwing was the newest recruit to the Justice League, having only been sworn in last week, and everyone’s experience with the young man so far had been pleasant. He had been good natured and cordial in dealing with the other heroes and efficient and competent in performing his duties. The idea that he might not be what he seemed was distressing to everyone.\n“What’s the problem?” Wonder Woman asked, cutting to the chase.\n“Shouldn’t Batman be here?” Superman asked, taking note of the Gothamites absence. If there were an urgent issue with a new team member it would make sense that their most security-oriented member be present.\n“That’s part of the problem,” Flash told them, looking even more nervous than before.\nEveryone sat up straighter, suddenly far more alert. “Has something happened? Is Batman alright?”\n“He’s fine…sort of…for now…I guess…I don’t know really…I just…”\n“Flash!” Black Canary snapped. “What happened?”\nFlash took a deep steadying breath. “Last night Nightwing showed up for his first monitor duty with Batman,” he began to explain. Everyone nodded in acknowledgement, having known that the session was scheduled, where the Bat would give the new recruit some initial training in operating the systems and a lecture on the importance of the task despite how tedious it was. They’d all been there.\n“and?”\n“Nightwing showed up five minutes late.”\nSeveral members of the team winced. Showing up late to monitor duty was a cardinal sin in Batman’s books especially for your first day.\n“Bet he got an earful for that,” Green arrow whistled in sympathy.\n“That’s just the thing,” Flash told them, pacing once more, this time at a normal human speed. “Bat’s didn’t even mention it. Just told him to take a seat. Like he didn’t mind.”\nSeveral sets of eyes widened in surprise. “Wow, he must have been in a really good mood,” Aquaman noted earning nods of agreement from the others.\n“That’s not all though.”\n“I’d hope not,” Green Lantern muttered. Several people shot him warning looks for the attitude but no one disagreed. Flash ought to have a better reason than that to call an emergency meeting.\n“Nightwing, he wasn’t just late…he brought Starbucks with him. Coffee and doughnuts.”\n“He brought food and drink? Into the monitor room?”\n“And Batman let him?”\nNow everyone was looking a little shell shocked.\n“Didn’t say a word about it.”\n“Damn.”\n“Maybe Bat’s got laid recently?” Green Arrow joked, earning a few laughs and a smack to the back of his head from Black Canary.\n“It gets worse.”\n“Worse?” Martian Manhunter prompted.\n“Flash, get to the damn point.” Green Lantern also prompted, far more impatiently.\n“He brought the Starbucks for everyone. A latte for himself, a tea for me, and a coffee which he handed to Batman. Just offered it to him right there in the monitor room,” Flash hissed, face pale with shock at the memory, “and Batman…he…he drank it!”\nA hush fell over the room as everyone took a moment to process that information before the panic set in.\nSuperman was out of his seat and hovering in distressed little circles. Wonder woman was grasping the edge of the table in front of her hard enough to dent it and everyone else was in frantic conversation about how impossible that was.\nBatman, accepting an unsolicited drink from a new recruit who hasn’t even cleared the probation period yet? Preposterous. It was unheard of. Heck, Batman still wouldn’t accept food from some of the people in that room even now, and they’d known him for years. Though in the case of Black Canary and Aquaman specifically that was more due to their lack of cooking skills than Batman’s paranoia.\n“Flash, you were right to call us,” Superman declared. “Clearly something isn’t right.”\n“He must have done something to him right?” Lantern asked, “Must have known that of everyone on the team Batman would be the most likely to discover if he was up to no good, so he’s done something to neutralise him?”\n“Mind control?” Black Canary suggested.\n“Hypnosis?”\n“Maybe he’s not even Batman anymore? What if Nightwing replaced him with a copy?”\n“What if Batman isn’t the only one? If he got to him, then he could have gotten to any one of us and we might not even know. There could be a Nightwing sleeper spy here right now!”\nThe room was quickly descending into hysteria with every new theory.\n“Everyone, calm down!” Aquaman snapped, realising that someone needed to be the voice of reason right now and for some damn reason it looked like it would have to be him for once. “Obviously something freaky is going on and we need to tread carefully but let’s not panic, ok? We need a plan, and since our main strategist is clearly compromised, we are going to have to figure this out without him.”\n“What do we do? What do we do?”\n“Nothing,” Wonder Woman decided, earning frustrated glares from multiples sides. “We need to understand the threat better first,” she continued, “I say we act normal and monitor them both for further evidence that something is amiss. Then when we have more data, we gather together once more and decide how to proceed.”\nIt was a solid plan. Or at least the best plan any of them could come up with at that time, so they all agreed to go along with it.\n“Just make sure to act natural,” Superman told everyone. “We don’t want Nightwing to know we are on to him.”\n…\n\n Several days later in the Batcave. \n\n“The team are acting weird,” Bruce announced as soon as Dick arrived, having been summoned to the manor by his old mentor.\n“Oh, thank God you think so too, I thought I was going crazy.”\n“What have you noticed?”\n“They’ve been watching me like hawks. All of them. Not just Hawkgirl. In fact, she’s been the least hawklike of the lot recently.”\n“Have they given any indication why?”\n“No. Everything was fine one day and then weird the next. Like I was on trial or something.”\n“I’ve experienced the same. The team have been unusually cagey with me lately. Refusing to share information. Cutting me out of meetings. Some members of the League have begun avoiding me and others seem to never leave me alone.”\nSuperman in particular had been on him like a rash; acting nervous and unsure like he was treading on eggshells but refusing to admit anything was wrong when pressed.\n“Do you think something has happened to them?”\n“It’s unsure at this point. We should keep monitoring them for signs of unusual behaviour until we can determine the cause.”\nDick nodded. “Sounds like a plan.”\n“He called him B!” Green Arrow screeched.\nMartian Manhunter firmly patted Black Canary on the back after her gasp caused her to inhale a spoonful of cereal.\n“What?” The woman spluttered when she could breathe again.\n“B!” Green Arrow repeated. “They were sat side by side in the meeting room and when Nightwing stood up to leave he said ‘Bye B’ and Batman said ‘bye’ like it was normal. B! B! Can you even imagine calling Batman B? Who does that? And how?”\n“How long has this been going on?” Martian Manhunter demanded.\n“Who freaking knows at this point? We’re in crazy town. I just don’t…” Green Arrow paused, attention switching to his wife who had stopped choking and was now pouring a new bowl. “Since when do we keep cereal on the Watchtower?”\nBlack Canary shrugged and was about to take another bite when Martian Manhunter reached across with a frown and picked up the box from the counter, twisting it around for the other two to see the front where Nightwing was scrawled in sharpie.\n“Don’t eat that!” Green Arrow screamed in panic, not that he needed to since Black Canary was already launching the bowl across the room; porcelain, milk, and cheerios’ splattering against the wall.\n“How much did you eat?!” He demanded.\n“Just a bowl,” Black Canary insisted. “It was just one bowl. Oh God. Do you think it was poisoned?”\n“Or drugged. Maybe that’s how he gets you? Did Batman eat the cereal? Does Batman eat?”\n“What’s going on in here?” Flash demanded, appearing in the hallway. “I heard screaming.”\n“Canary ate Nightwing’s drugged cereal!”\n“We don’t know that it’s drugged.” Martian Manhunter tried to reason.\n“Right! Flash, you’re a CSI,” Green Arrow remembered, grabbing the box from Martian Manhunters hand and holding it out towards the speedster. “Analyse this. Find out what he did to it!”\nFlash took the box as if he was being handed a bomb, “I’m on it!”\n…\n“They hate me!” Dick sulked, dropping down into the second computer seat in the Batcave. “They stole all my cereal.”\nBatman turned away from the screens and frowned at his son. “What?”\n“My cereal. They stole it all. Three boxes.”\n“When?”\n“Yesterday. It was weird.”\n“Weird how?”\n“They didn’t just throw it away. They removed it from the watchtower in a biohazard container.”\n“Bio…what?” Dick would have laughed at how baffled the other man looked if he wasn’t so annoyed.\n“When I found that all my cereal was gone, I checked the security cameras in the tower to see who might have taken it and saw Flash placing all the boxes in one of those bio containers for transporting radioactive substances.”\n“What the hell?”\n“I know right.”\n“Do you think someone tampered with it?”\n“You think they are trying to poison me?”\nThe two shared a matching look of concern. If that were the case then maybe Flash was trying to protect Nightwing by removing it. Or maybe he was in on it and then chickened out?\n“Why would they do that?” Nightwing whispered in distress.\n“I don’t know,” Bruce replied equally disturbed, “but I’m going to find out.”\n“Oooohh, what does this button do?” an over excited voice echoed through the lab.\n“Mr Wayne please don’t touch that,” a harried sounding Mr Dickenson pleaded, further adding to Barry’s confusion and drawing him away from his workstation. His boss never came down to the lab; just waited until the reports arrived on his desk upstairs.\n“So many buttons. Oh, shiny.”\n“Mr Wayne, please!”\n“Sir?” Barry questioned stepping forward and moving a bottle of corrosive chemicals out of the stranger’s grabby reach, causing him to pout.\n“Mr Allen, just who I wanted to see,” Mr Dickenson grinned, tension draining from his whole body, “Mr Wayne here has just very generously donated a large portion of funds to our department to update our equipment and has requested a tour of the facilities. Show him around, would you?”\n“Wait Sir, I’m a little busy today and I can’t…aaaand he’s gone.”\nBarry let out a huff, looking between the door swinging on its hinges and the grinning man in a business suit now spinning himself in circles on the labs only swivel stool.\n“Where is Abby’s lab?” the man, Mr Wayne apparently, asked. “Can we go see her?”\nBarry frowned, his usually fast brain grinding to a stop. “That’s NCIS,” he pointed out.\nWayne blinked, pausing his spinning. “What are you then?”\n“CSI.”\n“So, no Abby?” How could a grown man look so adorably disappointed?\n“No. She’s… that’s a tv show. You know that’s not real right?”\nWayne was already on his phone, looking up CSI apparently. “Oh, I get it. Can you introduce me to Grissom?”\nSo began the longest afternoon of Barry’s life.\n…\n“You look like crap,” Green Lantern very bluntly pointed out.\nLantern was a jerk Flash decided. Had he always been a jerk or was it a new development?\nDoesn’t matter. He’s a jerk now.\n“Screw you.”\nGreen Lanterns eyes went wide as saucers.\n“What’s up with you?”\n“Nothing…I just…had a rough day.”\n“Want to talk about it?”\n“No.”\nMore team members were beginning to arrive so Flash forced himself to sit upright and grabbed a pot of coffee, pouring a generous cup, or three for himself.\n“Did you get the analysis done on the cereal?” Black Canary asked, taking the seat beside him.\nFlash sighed and nodded. Thankfully he had already run the analysis before his unwelcome guest arrived today. Too tired to read it aloud Flash just passed his laptop over to Cyborg to look at, trusting that he could relay the results to the rest of them.\n“Analysis shows the cereal was untampered with,” Cyborg surmised from the test results, reinforcing the conclusion Barry had already made. “However,” Cyborg continued, making the speedster look up in confusion, “Flash, are you aware that this laptop has recently been accessed by a remote scanner?”\n“What?”\n“They covered their tracks well, but I am detecting evidence that would indicate the contents of this laptop were hacked and then downloaded to an external device.”\n“What? When? Why?” What the heck? How had Barry not noticed something like that?\n“From what I can see it must have been earlier today.”\n“That’s impossible. The only people who were anywhere near this laptop today were me and…”\n“And who?”\n“Well, there was this guy, Bruce Wayne.”\n“Billionaire, businessman, playboy, philanthropist,” Cyborg supplied instantly after scanning the web for information on Bruce Wayne.\n“He donated some money to my bosses so they asked me to show him around my lab, he was there all afternoon.”\n“And he had access to your laptop?”\n“Well yeah, but he couldn’t have…he was an idiot!”\n“Maybe that’s just what he wanted you to think!” Green Lantern suggested.\n“You think he was a spy?”\n“Looking for what?”\n“The cereal report!” Black Canary cried out, eyes going wide.\nSeveral people gasped.\n\"But how would he know about...\"\n“I just ran a scan of the watchtower security systems, it appears that Nightwing accessed the security footage of the canteen yesterday and saw Flash removing the cereal boxes for analysis,” Cyborg told them, cutting Flash off.\n“So, he knew we were testing it? What if there was something wrong with the cereal and this Bruce Wayne swapped the report? You think he works for Nightwing?” Black Canary theorised.\nGreen Lantern leaned forward; his expression intense. “Flash, what was this Wayne guy like? Describe him.”\n“I don’t know, he was…hyperactive I guess, dark haired, fairly attractive, smiled a lot, kind of funny, seemed nice enough, if a bit stupid.”\n“And we know that the stupid part was an act,” Green Lantern reminded them, “and if he was after the cereal report then…hear me out…what if Bruce Wayne is Nightwing?”\n…\n“Analysis shows that the cereal was untampered with,” Bruce read aloud.\n“Then why did they steal my Cheerios?” Dick demanded, “and my Froot Loops,” his face twisted into one of anguish, tears gathering at the corners of his eyes, “and my Lucky Charms.”\nBruce could only offer silent commiseration, holding his son close and rubbing his back gently as the young man cried into his shoulder.\n“He changed the fuck or die contract!”\n“He, they, what?” Flash flailed around in confusion and Hawkgirl reached out to steady him in concern. Everyone was staring at Aquaman and Cyborg who had just rushed in to the room.\n“Come again?” Green arrow requested.\nAquaman took the lead in explaining.\n“You remember that form Batman made us each fill out when we first started working together? The one that says in the event that one of us is put in a situation that will cause us to die unless someone else has sex with us…”\n“Still not sure why we need a contingency for that.” Green Arrow muttered.\n“Your chances of being caught in a fuck or die scenario are low,” Superman stated in a peppy voice like he was filming a commercial, “but never zero.”\nFlash sniggered and high fived him.\n“…and if in that scenario we are put in a state where we are not able to give consent,” Aquaman continued ignoring the interruptions, “the form will act as pre written consent that the team are allowed to do whatever they need to do.”\n“Yeah, we remember it.”\n“Most awkward paperwork I’ve ever had to fill out.”\n“Well do you remember the part where you can specify if you want specific team members excluded from this consent.”\n“Yeah, we all left it blank. Obviously.”\n“I considered putting Batman,” Flash admitted, “Cos he scares me. But when I thought about it, I figured I’d rather get it on with Batman than die.”\n“I put him as my first choice,” Green Lantern countered raising an eyebrow when everyone turned to look at him. “What? It’s never going to happen, and he’s the only one who read those things. If he was going to make me uncomfortable by forcing me to fill that form out, I figured I might as well return the favour.”\n“Never zero,” Superman repeated.\n“Batman altered his, this morning,” Cyborg explained, returning them to the subject at hand.\n“How do you know that?” Lantern asked, “Were you just reading through our emergency sex paperwork for fun? Doing some light reading?”\n“A notice of the update was included in the teams daily key notes, as required by protocol 18-G.”\n“Oh, come on. Nobody reads those.”\n“What was the change?” Superman asked.\nAquaman pulled up the document in question and cleared his throat before reading aloud,\n“I Batman, being of sound body and mind, hereby declare, that in the event that I am by whatever means; be they chemical, magical or otherwise forced into a life-threatening state whereby my only chance of survival requires my engaging in acts of a…you know what, I’m just gona skip ahead.”\n“Thank the Lord.”\n“I extend this consent to all members of the Justice League, excluding those listed below; trusting that the persons involved will act responsibly within the bounds of good reason, and exhaust every other possible course of action before resorting to this one.”\n“Get to the point!”\n“I’m at the point,” Aquaman snapped back, “Here in the exclusion section we have the Bat’s latest amendment. Persons who may not engage in sexual intercourse with me, even for the purpose of saving my life: Nightwing. (This decision is absolute. In the event that Nightwing is the only available person, please be aware that I would rather be left to die) I trust that this wish will be respected.”\n“What does it mean?” Flash asked sounding bewildered.\nAll heads turned to Flash, faces incredulous. “Seriously,” Green Arrow shrieked, “It means he doesn’t want Nightwing to…”\n“I know what it means literally!” Flash snarled. “What I meant is, Nightwing has been getting dangerously close to Batman right? Crossing barriers in the Bat’s usual defences like they aren’t even there. And now, out of nowhere we get a notice that of all the members of the League, Nightwing is the only one who isn’t allowed to get jiggy with Batman even if he’ll die otherwise. That’s weird right?”\n“Yeah. That is weird!” Black Canary agreed siting up taller. “What gives?”\n“What if,” Superman suggested, eyes wide, “it’s a message. If Batman has broken free of Nightwing’s influence just enough to send us a secret signal to let us know that Nightwing can’t be trusted.”\n“Or maybe Nightwing is the one who changed the form,” Hawkgirl cut in, her strategists mind working. “Maybe he’s planning to kill Batman and disguise it as one of these Fuck or Die scenarios and has changed the form to cover up why he didn’t help save our teammate.”\nSuperman shrieked in horror and covered his mouth whilst around him the others looked equally disturbed.\nOddly it was Green Arrow that talked them down. “I hate to interrupt guys but, I do have an alternate explanation.”\n“You do?” Superman asked hopefully.\n“Ok, hear me out.” Arrow urged them, “We’re still investigating the possibility that Nightwing is Bruce Wayne right?”\nThey all nodded.\n“Well, Wayne has a…reputation. It’s possible that this change to the form is because Batman knows about Nightwing’s identity and doesn’t trust him to be…you know…clean.”\nThe suggestion hung in the air before everyone cringed.\n“Eww.”\n…\nThe first notice had come in an hour ago and the rest had steadily followed.\nBruce stared at the screen with mixed emotions. On the one hand; he was relieved to see his teammates absolutely did not want to have sex with his son. On the other hand; ‘what the fuck?’\nNext to him Dick was slumped in his chair looking despondent, “The cereal thing was bad enough. This is just hurtful!”\nBruce Wayne was having a party.\nHal Jordan was in disguise. The rest of the League had decided to keep some distance for now. Observe Nightwing on duty and see if he did anything suspicious. More than he already had. Hal didn’t like that plan. He was a man of action. He wanted results. It was obvious that the Wayne guy was Nightwing and Nightwing was up to something big if he’d already gotten to Batman.\nSo here Hal was, dressed as a server, mingling with the crowds at this fancy event, handing out flutes of champagne and slowly edging towards Gotham’s richest man.\n…\nBruce Wayne was having a party.\nDiana Prince was in disguise. Despite telling the others to stay calm Diana was highly disturbed by the recent events involving Nightwing and Batman. She was concerned for their mysterious teammate. To avoid detection, she had dressed herself as what she had been helpfully informed was a ‘gold digger’. To support the disguise, she had then attached herself to the only man in the room actually wearing gold all over his person.\nSo here Diana was, dressed in the most ridiculous sparkly pink dress she could find, wearing a platinum blonde wig and giggling on the arm of the most obnoxious man she had ever met, as they moved across the room towards the object of her scrutiny.\n…\nBruce Wayne was having a party.\nBarry Allen was in disguise. Everyone else may be willing to take their time and wait things out but Barry lived for speed and delt with his problems quickly when they arose. Whether he was Nightwing or not, Bruce Wayne had annoyed the heck out of Barry the other day and had officially made himself one of the speedsters most hated enemies.\nSo here Barry was, dressed as a caterer, setting out plates of food along the most beautiful buffet he had ever seen. Sneaking bites quicker than the normal eye could see and contemplating how fast he would have to throw a canapé for it to hit the prince of Gotham in the face from across the room.\n…\nBruce Wayne was having a party.\nJ'onn J'onzz was in disguise. Despite voting to take their investigation slowly, he couldn’t shake the unease that had been building in him since the first suspicions about Nightwing had surfaced. If the League was truly compromised, if Batman was compromised, it could spell disaster for them all. Reaching out with his psychic abilities J’onn was both surprised and not to find a mental barrier in place around Bruce Wayne’s thoughts, preventing him from digging deeper. If that wasn’t proof that the man was more than he seemed, then what was? With his mental abilities of little use, J’onn vowed to keep watch over Wayne the human way. With eyes and ears.\nSo here J’onn was, shifted into the form of a beautiful woman, hanging on Bruce Wayne’s left arm whist another woman hung on his right, prepared to spring into action at the first sign of suspicious behaviour, desperately ignoring the hand creeping down towards his backside.\n…\nBruce Wayne was having a party.\nArthur Curry was in disguise. Batman had offered Arthur advice in his role as King many times as both his friend and colleague; if he was in trouble, then helping him was not just personal, it was for the good of Atlantis. Arthur could not accept the plan to just sit by and see how things went, he had his people to protect. As the king of the sea Arthur had picked up several languages over the years, and with cash recovered from more than a few shipwrecks he was fairly land-wealthy, so it wasn’t hard to pose as a foreign businessman.\nSo here Arthur was, dressed in what he was certain was very fashionable land attire. He had even caught the attention of a pretty blonde woman in a pink dress that glittered like sunken treasure. She seemed to like him, so even if he failed to learn anything new about Nightwing this night might still go well.\n…\nBruce Wayne was having a party.\nClark Kent wishes he was in disguise. He was here in an official capacity, reporting for the Daily Planet. It was times like this Clark regretted not following Batman’s example and keeping his civilian identity a secret from the rest of the team. If Bruce Wayne really is Nightwing then Nightwing would no doubt spot Clark as soon as he saw him. Nevertheless, Clark couldn’t deny he was glad for the opportunity to be here tonight, keeping an eye on the potential threat in the League. Batman was his good friend and Clark was determined to protect him.\nSo here he was, hiding in the corner, ducking behind the other reporters as much as possible trying to stay out of sight whilst using his super senses to covertly watch and listen in on Bruce Wayne.\n…\nBruce Wayne was having a party.\nOliver Queen and Dinah Lance didn't need to be in disguise, they were invited. Of-course they were. In the past they would turn down invitations from the famous playboy, but not tonight, not now they knew his secret. The others may have decided to stay back, play it safe with their investigation, but it would have been foolish of them not to take such a great opportunity to spy on Nightwing. He obviously couldn’t be trusted. Trying to poison people with cereal! Manipulating Batman!\nSo here they were, dressed to the nines and making their way around the room, keeping close tabs on the man who until recently they had thought was nothing but a fool and now knew to be a criminal genius!\n…\nBruce Wayne was having a party.\nVictor Stone and Shiera Hall couldn’t wear disguises, for obvious reasons. Plus, they had watch duty tonight. Both agreed however that Bruce Wayne, Nightwing, was trouble. Someone needed to keep an eye on him and if the rest of the League wasn’t going to take this threat seriously then it was up to them.\nSo here they were, in orbit, watching the Wayne Manor ballroom through the feed Victor had hacked on the Watchtowers security screens.\n…\nBruce Wayne was having a mental breakdown.\n\n‘What are they all doing here???’\n\nThe watchtower meeting room was deathly quiet.\nGreen Lantern, who had started sneaking sips of champagne after the fifteenth rich snob had talked down to him and kept going all night, was feeling rough. Even the glow of his own suit was giving him a headache.\nFlash had a stomach ache from too much food. A problem he had never encountered before or previously believed possible, but damn rich people food was rich. So much butter.\nGreen Arrow and Black Canary were both half asleep. They had muttered something about an after party before laying their heads down on the desk side by side and closing their eyes.\nAquaman and Wonder Woman couldn’t meet each other’s eyes.\nMartian Manhunter couldn’t meet anyone’s eyes.\nCyborg and Hawkgirl were the only ones looking normal, if a little irritated, feeling betrayed that they hadn’t been involved in the previous day’s events.\nSuperman wasn’t even there, citing work trouble. Apparently, the Daily Planet wasn’t impressed that they were the only newspaper whose reporter on scene had ‘ducked out’ of the party before the action started.\n“So,” Cyborg started, looking around the sorry bunch, “I think it’s safe to say Nightwing is on to us.”\n…\nBruce stared at the newspaper, his skull thumping violently.\n\n‘Majority of Justice League show up to help when band of criminal’s attack benefit at Wayne Manor. Rumours abound over Wayne’s connection to the heroes.’\n\nAs headlines went it wasn’t the worst he’d ever woken up to, but it sure as shit wasn’t good.\nIt was before noon and Alfred had poured Bruce a glass of scotch without being asked, a testament to just how visibly stressed Bruce currently was.\nAlfred had also poured himself a glass which was an even more dire sign.\n“Soooo,” Dick sing-songed, leaning his elbows on the dining room table and peering across at Bruce with wide eyes, “what was it like making-out with Martian Manhunter?”\n“Shut up,” Bruce groaned despondently, pinching his nose to stave off the headache. It did not work.\n“What base did you get to?”\n“Shut up.”\n“Was there tongue?”\n“Shut…ugh…” he huffed, giving up as the young man began cackling manically.\n“I just can’t believe you would…”\n“I thought he would give up sooner,” Bruce tried to defend, only making Dick laugh harder. “He was supposed to back down and leave.”\n“We’ll have to update the Batcave files,” Alfred chuckled between sips of his drink, “Martian Manhunter, talents; flight, shapeshifting, telepathy, gay chicken.”\nDick laughed even harder and even Bruce let out a reluctant snort.\n“Just one more question B,” Dick leaned closer, eyes wide once more, evil grin fixed in place, “If the robbers hadn’t shown up when they did, how far would you have gone with him?”\nAlfred’s eyebrow raised in a way that perfectly conveyed both intrigue and judgement, showing that he was equally interested in the answer.\n“Dick,” Bruce said.\nA few seconds passed with no further elaboration and Dick frowned, waving his hand in a go on motion, “Yeah? What?”\nBruce said nothing more, just stared challengingly.\nThe younger man blanched, “Wait, are you saying my name or are you calling me a Dick?”\nAlfred snorted again and downed the rest of his drink. “He’s answering the question.”\n“He’s...” Dicks jaw dropped, “Wait! Wha…”\n“Shut up,” Bruce snapped harshly.\n“Hey, you’re the one who…”\n“No seriously, shut up.” Bruce shot from his seat, all at once fully alert, body tense and eyes scanning the window.\nDick and Alfred followed his example, both dropping into defensive stances. Dick pulling a baton from inside his jacket and Alfred pulling a small blade from wherever he conceals it. Even Bruce hadn’t quite figured that out despite years of trying.\nNothing moved. Even the air seemed to fall still.\n“Show yourself!” Bruce demanded.\nThe silence stretched on as the three waited, priming for a fight.\nA hand reached through the open patio door and pushed the curtain aside.\nSuperman stepped into the room.\nIn explanation for his being there the Kryptonian offered just one word.\n“Nightwing.”\nThis would have been shocking enough on its own, but he was staring right at Bruce when he said it.\nThe three occupants of the manor all shared matching looks of confusion.\n“What!?”\n“But why a teapot?” Dick asked for the third time, sounding utterly baffled.\n“Why not a teapot?” Alfred demanded.\nDick shrugged helplessly, “Isn’t that bad for the tea though?”\n“It’s a small lead compartment, tucked into the lid and encased in a layer of porcelain. Nothing hazardous was ever in contact with the tea!” Alfred dismissed, sounding offended that the quality of his tea had ever been in question.\n“Mbpbfh,” Superman said, struggling against the restraints holding him.\nHe’d got as far as saying; “I know you are Nightwing,” and stepping threateningly towards Bruce before a 350-year-old bone china teapot was launched at his head. A 350-year-old bone china teapot that apparently contained a concealed shard of kryptonite.\nNow here Superman was, bound using reinforced chains to a reinforced chair which was bolted to a reinforced floor in a reinforced and lead lined room, lit with red sun lamps, wearing manacles fitted with blue kryptonite.\n“This feels like overkill,” Dick commented, glancing around.\n“Better to overkill than underestimate,” Bruce retorted, returning at last with the Superman proof noise cancelling headphones he had gone to collect.\n“Does he even need those?” Dick asked, “With the blue kryptonite won’t regular headphones work?”\nBruce levelled him with an unimpressed stare. “What did I just say?”\nDick rolled his eyes.\n“Now,” Bruce began, turning towards their captive, “Tell me what you think you know.” He removed the gag.\n“We know everything!” Superman snarled.\n“We?”\n“The League. You haven’t got anyone fooled Nightwing! We know all about your plot and what you’ve done to Batman!”\nFrom the position he had moved to, just behind the bound Kryptonian, Dick pulled a face, waving his hand around in outrage at the repeated misuse of his moniker. ‘What the heck?’ he mouthed silently.\nBruce tilted his head to the side, “And what exactly have I done to Batman?” he asked, going along with the mistake for now.\n“Mind controlling him! Manipulating him with your coffee and your cereal.”\n‘What!?’ Dick mouthed again, waving his arms in a large circle to signal he was silently shouting it.\n“Hugging him!” Superman continued, “Calling him B!”\nBruce had to fight not to laugh. “Am I not allowed to do that?”\n“No!” Superman snapped, “That’s where you slipped up.” He was grinning now. Looking smug. “You thought you were so smart. Thinking that if Batman appeared to trust you that the rest of us would too. But Batman never trusts anyone that fast! That’s how we knew you had done something to him! We’ve been monitoring you this whole time!”\nBruce pinched his nose, torn between amused and exasperated.\n“It seems you’ve been outsmarted Master Wayne,” Alfred commented in his usual deadpan, only Bruce and Dick could recognise the humour in his tone.\n“That’s right!” Superman jeered. “Your plan failed.”\n“Awfully cocky for someone powerless and tied to a chair, aren’t you?” Bruce couldn’t help noting.\nSuperman’s face dropped for a moment then he seemed to rally himself. “It doesn’t matter. The rest of the team will notice I’m missing any moment now and then they’ll come for you. You may as well give up now. You’re finished!”\nShaking his head in disbelief Bruce placed the headphones over Superman’s ears and replaced the gag, gesturing for Dick and Alfred to follow him out of the room.\nOnce outside he locked the door and turned to face the others.\n“What the fuck?”\n“Indeed Sir,” Alfred agreed.\n“Oh my God B,” Dick howled, “This is so funny. You’re so paranoid, that you not being paranoid has made them paranoid!”\n“I am not paranoid.”\nDick gestured towards the ten-inch-thick door of the overkill room. “Exhibit A,” he declared.\n“I’m cautious,” Bruce argued petulantly.\n“Whatever the case,” Alfred reasoned, getting them back on track, “the Justice League are currently under the impression that you are One; Nightwing, and Two; plotting against them,”\nDicks eyes went wide with renewed outrage, “Yeah! They think you’re me! How did that happen? Why do they think I’m some old guy?”\n“Hey!”\n“I am clearly spritely and youthful. No way could they think some ancient relic like you is Nightwing. If you tried to do half my stunts, you’d break a hip or something.”\n“I do plenty of my own stunts thank you very much, and I am not even close to being old. I am in the prime of…”\n“As someone who is actually old and in bloody good shape in spite of it,” Alfred cut in sharply, “You are both welcome to fuck off.”\nBoth froze in place.\nDick had a hand over his mouth scandalised. “Alfred swore,” he whispered.\nBruce just gaped, unable to process it.\nRolling his eyes Alfred once again took charge of returning them to the subject at hand.\n“Given the circumstances I feel it may be time to finally abandon the secret identities and tell the Justice League the truth to clear up these misunderstandings.”\nDick nodded in agreement and Bruce was about to do the same when a sly smile spread over his lips.\n“We could do that,” he said, “Or…\nPause for suspense.\n“…we could fuck with them.”\n…\nThe screens in the Watchtower flicked on without warning.\nThe sorry gathering of heroes, half embarrassed, half hungover and all full of regret from the night before looked up in confusion. That confusion quickly shifted to horror at what they saw. There on the screen was a smirking Bruce Wayne.\nSmartly dressed in a grey three-piece suit he looked like he was heading to work, or a fundraiser, or a tv interview. Not a hair out of place. Nothing that would lead anyone to suspect he was anything less than the sweet, charming guy the public thought he was.\nNothing but the escrima stick casually propped against his shoulder.\nOh, and of course Superman and Batman, both bound and gagged behind him.\n“Justice League!” Bruce greeted with a wide smile. “Your move.”\nThe screen went blank.\nThe Justice League lost their collective shit.\nFlash stood at the front of the room, head high, shoulders back, eyes sharp. He looked over the team before him, like a General, surveying his troops.\nWhy or how he had been elected as leader of the Justice League in the face of this crisis was a mystery even he couldn’t answer. Frankly he didn’t want the job and felt woefully underqualified. Nevertheless, here he was.\nAround the room, various members of the League were watching him attentively, waiting for him to speak, others were glaring at him in anger, tied to their chairs in much the same way Superman and Batman had been on Wayne’s broadcast. Wonder Woman in particular was struggling violently against her bonds. Only the gag in her mouth holding back what prior to the gag being procured, had been an angry and creatively threatening tirade.\nIn another world, with Batman and Superman in enemy hands, Wonder Woman would be the obvious choice to step up and lead the rest of them. In this world, the Amazonian’s plan had boiled down to charging into Wayne Manor; guns, battle axes, and superpowers blazing.\nGiven that Wayne had somehow overpowered their strongest member and outsmarted their strategist, Flash didn’t think that was a particularly promising course of action. Which is exactly why he had taken it upon himself to put the brakes on it.\nFortunately, Green Lantern, Black Canary, Cyborg and Martian Manhunter had agreed with him.\nUnfortunately, Green Arrow, Hawkgirl and Aquaman had agreed with Wonder Woman. Which is why they were also tied to chairs.\n“Alright,” Flash declared, taking a deep breath and rallying himself “Here’s what we’re going to do…”\n…\n“How are we looking?” Bruce asked, wandering over to look at what his second youngest son was doing.\n“Good,” Tim assured him, flicking a switch on the control panel he was fiddling with. An array of lasers spread across the cave tunnel. Tim picked up a spare batarang and flung it into the lasers triggering a spray of darts to erupt from the walls of the tunnel.\nDick who had been trailing after Bruce, flinched back in alarm, “What the…?”\n“When did you install that?” Bruce asked, glancing around the cave in confusion, wondering what other modifications had been made without his knowledge.\nTim shrugged. “Well, since you won’t let me patrol yet, I had some free time.” He opened a file on the data pad he was holding and handed it to Bruce. “Here’s a list of all the security traps I’ve currently armed. Don’t get caught in them.”\nDick leaned over Bruce’s shoulder to look as he scanned the pad, both of them going wide eyed as they got further down the list.\n“How did you even come up with half this stuff?”\nTim grinned, already moving towards another cave tunnel where another lethal security system was installed. “Home alone was my favourite movie growing up. Since I myself was frequently left home alone. At a certain point I started inventing my own ideas for how I would fight off an attack if I ever needed to. I got pretty creative.”\nIn the next tunnel, another set of lasers, and another batarang, triggered a spray of fluid from sprinklers overhead which was definitely not water, based on the way it sizzled as it hit the ground.\n“Observing the various rouges in Gotham also gave me some fantastic ideas,” Tim admitted cheerfully. “The Toymaker in particular was a great inspiration.”\nBruce and Dick looked equally alarmed.\n“I’m so glad you’re on our side,” Bruce confessed, “You would be a dangerous villain.”\nTim scoffed. “I figured out your identities back when you didn’t even know I existed. I would have destroyed you and you never would have seen me coming.”\nAs the boy moved on to his next trap, Dick grabbed Bruce by the arm and pulled him in close to whisper, “Tim is very scary. As a contingency so he stays good and not evil, I would like to request that you be very extra nice to him.”\nBruce nodded solemnly in agreement.\n“Hey Bruce,” Tim called, waving him over.\n“Yes, my favourite child?”\n“Not that nice!” Dick screeched.\n“Master Wayne,” Alfred interrupted. “Mr Kent is becoming restless.”\n“Mr Kent is becoming restless,” Dick parroted in a singsong voice, glaring at the butler who merely shot him an unimpressed look in return.\n“Dick, stop that,” Bruce told him.\nThe younger man huffed and crossed his arms. “I just don’t see why he gets to be Batman,” he complained for the hundredth time, scowling at the butler who hours after their broadcast to the League, was still fully kitted out in the armoured uniform and clearly loving it. \n“Because Jason isn’t here,” Bruce stated as if it was obvious, only making Dick scowl harder.\n“Jay’s going to be so pissed he missed this,” Tim chuckled.\n“Well, that’s what he gets for insisting on going to England to study instead of going to Gotham University like I wanted.” It was an old argument and everyone was happy to ignore Bruce even as he continued to mutter about betrayal and just desserts.\nAlfred turned back to Dick, “If Bruce can be Nightwing then I can be Batman,” he insisted haughtily.\n“He can’t be Nightwing!”\n“Uh, Guys!” Barbara called from where she was monitoring the screens at the Batcomputer. “We have a problem.”\n“What problem?”\n“Cyborg found the secondary security system I’d been watching the League on after they locked me out of the Watchtowers primary system.”\n“What secondary system?” Bruce demanded.\n“Don’t worry about it.”\n“I have no control over you people, do I?”\n“None at all. But it’s adorable that you thought you did,” Tim replied.\n“The point is, the feed that I have been watching to monitor the League was switched to a recorded loop.”\n“When?”\n“About half an hour ago.”\nThey all startled in alarm.\n“Sensors show incoming,” Alfred announced, pointing to the outside security feed readouts.\n“Oh damn,”\n“Are we ready?” Bruce asked Tim.\n“Almost. I just have to arm the final tunnel.”\nWith that, Tim walked over to where Damian was practicing katanas on the cave training mats and picked the youngest Wayne up by his armpits, walking with him suspended in the air, he set the now scowling boy at the last cave entrance.\n“Ok, now we’re ready.”\n“Crazy whacky inflatable arm flailing tube man!”\n\n“Crazy whacky inflatable arm flailing tube man!”\n\n\n“Crazy Whacky Inflatable Arm Flailing Tube Man!”\n\n\n“CRAZY WHACKY INFLATABLE ARM FLAILING TUBE MAN!”\n\nThe announcement blared from speakers around Wayne Manor getting gradually louder and more erratic each time. Half the Justice League were stopped just outside the gates, surveying the perimeter to test for a way in.\n“What the hell is that about??” Flash demanded looking around in panic.\nGreen Lantern hovered just above him, eyes fixed on the lawn in front of the Manor. “I think it may have something to do with the army of Crazy Whacky Inflatable Arm Flailing Tube Men.”\nA chorus of disbelief went up from the flightless members of the team whose only view at that time was the drab grey stone of the outer wall. The various flight enabled members each provided a bunk up so the others could see.\n“Oh my God!” Flash gasped, balancing on Martian Manhunters shoulders, “It’s us.”\nAnd it was.\nA dozen Crazy Whacky Inflatable Arm Flailing Tube Men each designed to look like a different member of the Justice League, flopping and flailing about just in front of the main entrance of the house. A heavy fog of smoke twirled around the things, obscuring the ground from view, and spinning laser lights shot out from the centre of the display in a rainbow of colours.\n“Are we meant to fight them?” Green Arrow wondered from the crow’s nest construct Green Lantern had created to lift him, aiming an arrow at the Batman Crazy Whacky Inflatable Arm Flailing Tube Man and letting it fly. The arrow hit the shoulder, but the Crazy Whacky Inflatable Arm Flailing Tube Batman continued to flail.\n“We should find another way in,” Hawkgirl declared, frowning at chaotic bonanza of movement and lights. “There are probably traps hidden between them.”\n…\nDown in the cave Bruce turned to Tim with a questioning look. “What traps are hidden in the tube men?”\n“Crazy Whacky Inflatable Arm Flailing Tube Men,” Dick corrected.\nBruce glared in defiance, refusing to repeat it.\n“There aren’t any,” Tim replied monitoring the cameras where Cyborg and Wonder Woman were approaching the first tunnel at the far side of the Manors grounds. “I just thought they were funny.”\n“So, they could just walk through them?”\n“Yep.”\n“And once inside the Manor they would have a straight path to the cave?”\nThere was a thread of underwhelmed disapproval in his tone, Bruce clearly thinking he’d set his expectations too high.\nTim smiled, a slow sly sinister sort of thing, “I never said that.”\nDick took one look at that smile and inched away from the boy in alarm. “Hey Timbo, have I ever told you you’re my favourite brother? Because you are. I love you. You’re the best. I just want you to know that. Never forget it ok? Whatever happens just remember that you’re my favourite. And I’m yours. Right? Right? I’m your favourite? Your pal. You would never do anything to…”\nBarbara leaned over and smacked Dick in the head to shut him up, earning herself a grunt of thanks from Bruce.\nOn the cameras Wonder Woman and Cyborg crossed the threshold into the tunnel. Tim flicked a switch causing an armoured door to shut behind them, trapping them inside.\n“Show time.”\n…\nWonder Woman span around in alarm as their exit closed off. She snarled with rage at realising they had been caught off guard.\n“That’s not good,” Cyborg murmured poking at the slab of metal.\n“You think?”\nThey faced the dark tunnel apprehensively. Cyborg’s night vision capabilities providing very little help.\n“Onwards I suppose.”\nIn the weeks since Bruce Wayne’s visit to Barry’s lab for his brazen cereal report heist which had first piqued the team’s suspicions of him, they had been covertly surveying Wayne Manor trying to determine what secrets the man might be hiding. Covertly surveying of course meant Superman hovering overhead and taking a look.\nIt was through this they had discovered the tunnels. A series of pathways underground, some of them starting several miles away, all linking back to a cavern deep under the house. A heavy coating of lead prevented the Kryptonian from seeing inside and given that they had been previously trying not to arouse Wayne's suspicions, they hadn’t yet had a chance to investigate properly. Among themselves the team had been calling it the Wing-Cave.\nNo doubt the central hub for Nightwing's evil schemes.\nAnd where he was currently holding Superman and Batman.\n“Onwards.” Wonder Woman agreed.\n…\nDeep in the Wing-Cave Barbara cracked her knuckles and began typing, setting the next phase into motion.\n“Light’s.”\nAll along the tunnel lasers emerged from the walls, spinning and flashing in every colour and direction.\n“Camera.”\nThe security feed switched to show the two captives making their way towards them from several angles.\n“Action.”\nWonder Woman hissed in frustration, squinting against the lights flashing around them, making it almost impossible to see ahead. “What the?”\n“We are definitely walking into a trap,” Cyborg muttered.\n“Really?” Wonder Woman replied sarcastically. Irritation in every syllable.\n“Yep.”\n“I hate you.”\n“Sure.”\n“I wish I’d been paired with J’onn.”\nCyborg smirked. “Not Arthur?”\n“Shut up!”\n“Didn’t feel like getting all wet and…”\n“Shut up.”\n“I’m just saying you could…”\n“Victor shut up! Can’t you hear that?”\nSomewhere behind the flickering lights a whooshing sound could be heard as a bladed fan spanning the entire cross section of the tunnel switched on. Which would have been worrying enough, if the metal door behind them wasn’t rapidly moving inwards, driving them towards it.\n…\n“Uh, we’re not going to actually hurt them, right?” Dick wondered, leaning over Barbara’s shoulder to watch the scary crazy death trap on the camera feed with concern.\n“They’ll be fine.” Bruce assured him from the other desk, “At least long enough for me to lecture them about using their teammates real names whilst trapped in an enemies lair and certain to be under surveillance.”\n“Clearly the security seminar you hosted didn’t make an impression.” Alfred observed, quickly being cut off by Dick who was still bitter about the Batman thing.\n“It’s weird that you’re calling our headquarters a lair.”\nBarbara glanced around them and then back and Dick in disbelief, “If this isn’t a lair then what is?”\n“It’s a perfectly functional base of operations,” Bruce argued.\n“Ok Dr Evil.”\n“God damn it!”\n“What?”\n“I should have asked Selina if I could borrow one of her cats for when the team makes it inside. For my evil entrance.”\nHe span his chair towards them and mimed stroking a cat, a wide evil smirk in place. “Welcome Justice League, mwah ha ha.”\nDick bit his hand to hold in his laughter. Barbara rolled her eyes. “Just use one of the dogs.”\n“The dogs are busy.”\n“With what?”\n…\nOut in Manor gardens Green Arrow let out a deafening screech as he fled for his life. “Good dogs, good dogs, good dogs!”\nFloating above, Green Lantern watched him run in circles, German Shepherd and Great Dane hot on his heels. “You’re doing great buddy. Keep running. I think they are getting tired.”\n“I suddenly understand how Charlie and Grandpa Joe felt in the fizzy-lifting-juice room,” Cyborg bemoaned as the moving metal door at their back pushed them closer and closer to the spinning blades. “The fan. The fear. The gassiness.”\n“The what room?” Wonder Woman demanded, “Who?”\n“Nothing. Nevermind.”\n“No! If your friends have survived situations like this before then you must tell me, how did this Charlie and your grandfather escape?” She dug her heels into the dirt, trying to push back against the door with no success.\n“He wasn’t my…”\n“How!?” she demanded.\n“By burping.”\nWonder Woman almost fell forward into the blades as she twisted to look at him in bafflement, “What?”\n“I told you it wasn’t relevant,” he snapped back. “It was a very different situation.” He decided not to mention it was also fictional, fearing that she might kill him before the blades did.\n“Then why mention it?”\n“I was just making an observation!”\n“Observe a way out of here!” she snarled. There was now less than a metre between them and the fan which was spinning at an alarming speed, almost a blur before their eyes.\nCyborg winced as the door shoved them forward again. The air from the fan was causing Wonder Woman’s hair to whip around, smacking him in the face and he was oddly enraged by this annoyance as he was staring down certain death.\n“Are you sure you cannot shoot it?” Wonder Woman asked. Since becoming trapped they had been running over options to disable the fan. Cyborg had already considered and dismissed the idea of blasting the thing.\n“I’m sure. In this enclosed space we would just bring the tunnel down around us. Call me crazy but I’d rather be fricasseed than buried alive.”\nWonder Woman huffed in anger, seeing no other options available she closed her eyes and raised her sword.\n“Diana no!” Cyborg cried out. “It will take your arm off.”\n“Then you will go on to save our comrades!” she declared and lunged forward. “For the Justice League!!!!”\n“Noooo!”\n…\n“Wow!” Barbara gasped, watching the screens in wonder. “That was so brave. She is awesome.” Around her Tim, Bruce, Dick and Alfred gave hums of agreement.\n…\nBack in the tunnel an angry hissing noise filled the space and Wonder Woman retracted her sword, the tattered remains of the fan still attached to the spinning central hub fluttered before her.\nAlthough the door continued to push forward, the two heroes paid it no mind, stepping safely through the freshly made gap to the other side of the fan.\n“Rubber,” Cyborg muttered tilting his head to inspect the damage. “It was made of rubber.” He let out a giggle of relief.\nWonder Woman was far less amused. In fact, she looked downright murderous. “I’m going to destroy him,” she hissed, facing back into the tunnel and breaking into a run intent on finding Bruce Wayne and exacting justice for the humiliation she had just suffered. Cyborg jogged along behind her still high on the thrill of not being dead.\n…\nTim turned to Bruce with an amused smirk. “I would hate to be you right now.”\n“Me?” Bruce questioned, for the first time looking a little uncertain, “These traps were all your idea.”\n“Good luck convincing her of that,” the boy chuckled rising to his feet. “Now, if you’ll excuse me.”\n“Where are you going?” Dick asked.\nTim just smiled as he walked away. “I’m going to get some fresh air.”\n…\n“Crazy whacky inflatable arm flailing tube man!”\n\n“Crazy whacky inflatable arm flailing tube man!”\n\n\n“Crazy Whacky Inflatable Arm Flailing Tube Man!”\n\nGreen arrow breathed a sigh of relief. The dogs were no longer chasing him, the canines apparently unwilling to follow him into the smoky, strobe-light-y, inflatable, flailing jungle. Honestly, he hadn’t wanted to go into it either, but after a full half hour of sprinting in circles with the dogs hot on his heels he was exhausted and it was all he could think of.\nGreen Lantern had been no help at all, claiming that he was allergic to dogs and therefore didn’t want to risk getting dog fur on his constructs. Arrow didn’t even have words for how stupid that was, and even if he did, he wouldn’t have been able to speak through how out of breath he was.\nA cry for help from Black Canary on the other side of the house had drawn the Lantern away at last, sparing Arrow from his useless commentary and distracting the dogs long enough for him to duck into crazy whacky inflatable arm flailing tube hell.\nHe stepped carefully through the smoke, breathing shallowly to avoid inhaling too much of the potentially toxic and oddly popcorn scented fumes, wary of potential booby traps as he went.\nEvery movement that didn’t trigger some sort of attack just made him more anxious, certain that the next step would be the one to bring disaster. Yet slowly but surely, he crept closer to the house. Soon enough Green Arrow found himself pushing forward the front door and entering Wayne Manor.\n“Huh,” he grinned. “That wasn’t so hard.”\n…\nBlack Canary stood over Green Lantern looking unimpressed. “You were no help at all.”\nLantern just groaned and stumbled to his feet. “WHAT?”\n“I said you were no help at all.”\n“WHAT?” he repeated, head still ringing from the scream that had knocked him out of the sky.\n“I SAID…oh forget it…”\n“WHA…ooof…” he groaned as she shoved past him.\n“Where did they go?” Canary wondered aloud, looking around for the masked figures she had seen.\nThey were in the middle of an ornate garden, amidst a wild array of flower displays, shrubberies, and statues. Around them there were many places to hide, too many. Canary had been exploring the path looking for a route round to the other side of the manor when someone had snuck up behind her tapping her shoulder with a stick then darting away. When she had spun about and tried to follow them another figure had swept her feet from under her and taken off as well. Yet another masked assailant had then sprayed her with a hose. It was the shock of cold water that had caused her to call for assistance, summoning the Lantern who arrived just in time to get caught in her Canary scream.\nThe three attackers were now nowhere to be seen.\nShaking his head to clear it Lantern blinked away the spots in his vision and followed Canary on foot, too dizzy to fly right now. “What were you screaming at?”\nShe turned to glare at him. “You didn’t see them?”\n“See who?”\n“The…” she paused, uncertain how to explain it since she wasn’t sure who exactly she had seen, “…masked people.”\n“Where?” he asked, glancing around.\nCanary rolled her eyes. “Idiot,” she muttered, just loud enough for Lanterns recovering ears to hear.\n“Cow!” Green Lantern shouted.\nShe swung round to face him. “Excuse me??”\nLantern wasn’t looking at her, he was already moving, face panicked, glancing back over his shoulder as he went. “COW!” he screamed, breaking into a sprint.\nBlack Canary glanced back towards where he was looking and felt her jaw drop, her feet moving faster than her brain already had her following Green Lantern as fast as possible away from the freaking cow that was charging them.\n“Why is there a cow?”\n“I don’t know why there’s a cow! Just run.”\nThey ran.\n“Oh, damn I need to do more cardio,” Lantern panted, regretting all of the League training sessions he had skipped or half assed, figuring that in a battle the ring would do most of the work. “I am so out of shape.”\n“Can’t you fly?” Canary asked.\n“After you scrambled my brain? I’m surprised I can even walk straight.”\nHe may have spoke too soon as a new wave of dizziness caused him to veer sideways into a hedge. Canary led the cow to one side then circled back to him. The cow turned ready to charge as she helped the Lantern to his feet. “Let’s go.”\n“Where?”\nA few feet along from them there was a small gap in the hedge, large enough for a person but hopefully too small for a cow. “There!” she ordered and pulled him towards it.\n…\nDown in the cave a new screen switched on, allowing Barbra, Bruce, Alfred, and Dick a bird’s eye view of the Wayne Family maze which Green Lantern and Black Canary had just entered.\nAs they watched, the gap the two had just passed through closed behind them as the hedges shifted, controlled by some underground mechanism.\n“What the hell?” Bruce muttered.\nHe was pleased to see Dick and Barbara looked equally shocked. At least he wasn’t the only member of this family who was out of the loop on all the manor’s tricks and traps.\n“Tim installed that?” Dick wondered.\n“That’s amazing,” Barbara breathed, watching as the two heroes moved further into the maze, hedges shifting ahead of them, herding them towards the centre.\nAlfred grinned proudly. “Actually, this one was mine.”\n“Who’s controlling them?” Bruce asked, since he could clearly see no one there in the control centre with him was doing it.\n“Master Jason,” Alfred informed him with a satisfied smile. “It seemed unfair to leave him out of all the fun.”\n…\nBack in the garden Tim, Stephanie, and Cassandra gathered to watch the hedge maze close on Canary and Lantern, stopping to give Bat-Cow pets for her good work. “That was so much fun,” Stephanie cheered spinning around in in her purple costume.\nCassandra, decked out in black and Tim in red both grinned back at her. “I understand why Bruce doesn’t want us crimefighting yet, but this is great,” Tim declared, excited that his Red Robin persona was finally getting its debut. The girls looked equally delighted to take their vigilante costumes for a spin at last. Even if it was just to mess with the Justice League.\n\n…\n\nDeep below the manor Superman’s investigations had identified an underwater tunnel leading from Gotham-bay right up into the Wing-cave. As the others had been approaching the villains lair by land, Aquaman had been navigating this tunnel alone, working his way through a series of obstacles including harpoons, nets, and one very strange starfish who had proven oddly immune to his control. The creature had kept him busy for a full hour before disappearing into a side tunnel too small for him to follow leaving the king of the oceans to press onward.\nFinally, after these many trials, Aquaman emerged into a carved circular pool within a dark cavern. Secured to the edges of the pool, he could almost make out the silhouettes of several water vehicles including a speed boat and a jet ski. A door leading to another cavern was visible on the far wall so Aquaman swam to the edge and was about to climb out and go exploring when a loud shriek filled the air and he was being slammed back into pool in a tidal wave of soapsuds and one very shocked Green Arrow.\nThe two struggled to separate their tangled limbs from one another and surfaced again, both spluttering, Arrow due to the unexpected dip, coughing up water and gasping for breath, and Aquaman in outrage at the chemicals that had just been dumped in the previously clean water. Actually…well it was Gotham water so maybe clean was a stretch…but it had at least been soap-free until then.\n“What was that?” he demanded. “Where did you come from?”\nGreen Arrow still looked extremely dazed. “I don’t…I don’t know…the stairs…I…what?”\nAfter entering the house Arrow had found his way to a cellar area to the back of the manor where a stone staircase led down into what he assumed was the cave below, three steps in, the stone steps had shifted to lay flat forming a slide. A pipe had then opened at the top releasing a mixture of water and washing liquid turning the whole thing into a slip-n-slide that led right down into the very pool Aquaman had just emerged from.\n…\nIn the control room Dick high-fived the newly arrived Jarro on one of his star points then grinned at Tim and the girls who had returned from the garden. He nodded to the screen which had shown Green Arrows epic slide.\n“I can see you were also heavily inspired by Scooby Doo,” he noted, impressed and amused.\nTim shook his head, frowning in confusion. “Never seen Scooby-Doo. I didn’t even know those stairs were there.”\nBruce grinned, pleased that he still had a few tricks of his own to surprise the kids. “Those were my idea. I put them in years ago. Took forever to get the mechanism right.”\nBruce’s proud moment went unheard as Dick, Cass, Jarro, Barbara, and Steph all crowded Tim in outrage, “You’ve never seen Scooby-Doo??”\n“Not possible!”\n“We need to fix this immediately.”\n“Movie night!”\n“We should do a marathon!”\n“Perhaps we ought to focus on the current goings on before we start planning movie nights,” Alfred cut in, bringing them once again to the matter at hand.\nJust as Aquaman and Green Arrow were preparing to climb out of the pool again, the butler hit a switch, causing the pool itself to spin like a washing machine drum, sweeping the two men up in a whirlpool.\n“I love this house,” Dick cheered.\n\"I love this lair,\" Barbara corrected.\nThe student common room at the UCL Faculty of Arts &amp; Humanities held a wide range of entertainment options. There was the pool table, the foosball table, the ping-pong table, the beer-pong table (unofficially), and of course the TV, wired up with a fairly standard gaming system.\nIt was this TV that a large congregation of students were gathered about one rainy evening.\nOne of the International students, an American by the name of Jason Todd-Wayne had commandeered the screen, claiming to have a test copy of a new game his father’s company was thinking of developing as they branched out into the entertainment industry. He’d been asked to play and review it. With nothing better to do in this lousy weather, the students were transfixed.\nAt first glance it looked like a cross between Pac-Man and classic Mario, showing a birds-eye image of a maze with two icons simply labelled as Green and Black moving through it. What made this game different however, was that instead of controlling the icons, the player was controlling the maze, trying to drive them into the centre.\n“Move that one,” someone shouted pointing at the screen, “Cut Green off before it goes right.”\n“Forget Green, Black is almost to the edge, You need to move that hedge at the top and then shut off that path to the left to drive it back in.”\nJasons fingers sped over the controllers, cutting off Greens escape and then quickly rushing to block Black too. It was a close call with Black almost making it to freedom.\nWith no other choice, Black moved in along the path set out for it, with Jason shutting off exits before it arrived at them, herding it inwards to a dead end where he was hoping to trap it while he dealt with Green. As Black reached the end however, a red button appeared on the screen with a command option.\n*Press button? Yes / No *\n“Yes!” Several people shouted at once. Jason grinned. Can’t argue with that.\nHe pressed the button.\n*Water sprinklers activated*\nSpurts of blue erupted from the hedges, spraying Black who appeared to jump up and down then run back along the route it had come from, zig-zagging away. Jason cackled even as several others complained about how Black was getting away.\n“What the fuck is that?” Following the pointing finger, they all looked to the top of the screen where the mazes front entrance was, only to see a new piece enter the game.\n“Is that a bull?”\n“I think it’s meant to be a cow,” Jason laughed.\n“Why is there a cow?”\n“Is it meant to help us or is it another piece that needs to go to the middle?”\nThey all watched as Green ran into the same branch as Cow only to turn around and run as Cow started chasing it.\nSeveral people laughed.\n“This game is weird man.”\n“But fun,” Jason argued.\n“Yeah. It’s pretty fun.”\nWith Cow chasing Green it was easy to guide it inwards to the centre, so Jason focused more energy on Black who kept trying to double back on itself.\n“Turn that one. The one in the middle. Twist it. That will put them both on the same path.”\nJason grinned and twisted the hedge in question cutting off Blacks exit and opening a path into where Green and Cow were. Once they crossed into Blacks section, they were in the final stretch. Students all around Jason called out commands as he led the two icons along his chosen route. With both icons now moving together he moved hedges rapidly, fingers speeding over the controller.\nAlmost there…\nHe shut the last hedge behind them so Cow couldn’t follow, trapping the icons in the centre of the maze.\nFor a moment nothing happened, then…\n“What’s that?”\nA new White icon had appeared in the centre with Black and Green, the three circling one another.\n*Boss Battle in Progress* the screen declared.\nA series of pixilated lightning bolts shot in every direction before the screen went blank then flashed.\n*Winner*\nA cheer went up around the room, several people clapping Jason on the back.\n“Let’s play again.”\n“Can I try?”\n“Are there other levels?”\nJason stood up, holding his hands up in a sign of apology, “Sorry guys, that was a one-time trial I’m afraid.”\n“What? What kind of game is that, that you can only play once?”\n“It’s really early stages. I promise to get you all a copy of the finished product.”\nSeveral people were still grumbling protests as he packed his things away, annoyed that they now had to find something else to do. A small group did approach him as he reached the door however, with few pages of notes on suggested improvements to the game. Jason smiled and promised to pass them on to his dad. Looks like Wayne enterprises really would be branching out into entertainment after all.\nWith a final nod of thanks, he quickly retreated up to his dorm room, he had some live footage to watch.\n…\n\nMinutes ago, in Gotham\n\n“Captain Marvel,” Black Canary cried out as the caped hero descended into the centre of the moving maze they had been trapped in. “Thank goodness you’re here.”\n“We could really use your help buddy,” Green Lantern agreed, “There’s some weird stuff going on around here. We don’t have time to explain it all but…”\n“Oh, don’t worry…” Marvel grinned, interrupting him, “Mr Wayne has already explained everything.”\nBlack Canary gasped in outrage. “You’re working for him?”\n“Why?” Lantern asked.\nThe caped hero shrugged nonchalantly. “He offered me wealth and power. Seemed like a pretty sweet deal.”\nIn reality Bruce had been surprised to realise the League hadn’t recruited Captain Marvel to their side. So of course, he’d called Billy, explained everything and offered him a chance to mess with the Justice League. He’d flown right over.\n“You traitor!”\nMarvel grinned wider, circling above them. “It’s a dog-eat-dog world Lantern. And you’re about to get eaten.”\nWith that he aimed a blast of lightning directly at the ground beneath the pair, opening a trap door, sending them down, down, down.\n…\n\nBack to present\n\n“I hate you,” Green lantern groaned from his spot in the foam cushion pool.\n“What?” Black Canary asked groggily.\n“I HATE YOU.”\n“WHAT?”\n“Oh, forget it,” he muttered, leaning back into the soft pit.\nRight before he blasted the ground Black Canary had tried to take down Captain Marvel with a sonic scream. Unfortunately, she had started it just as the trap door opened sending them careening into the cave below, the open cavern had reflected the scream in every direction, including back at them, meaning Green Lantern was hit for the second time today and Black Canary was hit for the first time ever.\nThe two-lay panting in distress, trying to bury their heads in the foam pit as the echoes continued to bounce around the vast cavern.\nFurther into the cave the reverberating scream travelled down into the tunnels causing Wonder Woman and Cyborg to cover their ears in alarm. In the lower caverns, Aquaman and Green Arrow who had finally dragged themselves free of the whirlpool, dived back in to escape the sound.\nSuperman who was still tied to a chair in the overkill room with his noise cancelling headphones was blissfully unaware of anything going on, not even Martian Manhunter clutching his head and vomiting three feet in front of him.\nAt their various stations the batfamily, each prepared with their own set of Canary proof earplugs were equally unaffected, smiling happily as they welcomed Captain Marvel to the cave. The hero looked around with an appropriate level of wonder as he flew down to the command centre.\n“Welcome to the lair,” Barbara greeted, popping her earplugs out now the echoes had faded.\n“Very cool lair.” Captain Marvel touched down, his eyes immediately catching sight of a fridge and rushing over to help himself to snacks.\nBruce frowned disapprovingly as the man-boy all but inhaled two snack bars, “Chew your food. You’ll make yourself sick like that.”\nAround him several of the batkids laughed. “Dad mode activated.”\nCaptain Marvel grinned at them, “Well, my name is Batson,” he mused, rooting through the fridge again, this time pulling out a Tupperware container and a plastic fork conveniently stored alongside it.\nDick jumped forward and covered Bruce’s ears. “Shush,” he hissed, “Don’t tell him that. He’ll get ideas.”\n“What’s the returns policy at the orphanage? I want a refund.”\n“You didn’t get any of us from an orphanage.”\n“Technicalities,” Bruce dismissed shrugging out of his eldest’s hold. “Anyway, Alfred is Batman right now. So, he can adopt Marvel as his bat son Batson.”\n“Who’s Alfred?”\n“The guy who cooked that risotto you’re eating.” Tim explained.\n“Oh? Then I totally accept.”\n“I’m glad the food meets your approval Master Batson,” Alfred said, stepping onto the platform, having completed his sweep of the tunnel entrances, “Can I get you anything else?”\n“Stop butlering when you’re supposed to be Batmaning,” Bruce complained, earning himself a pretty impressive bat-glare from the older man.\nDick smirked at Alfred being admonished, “I wouldn’t need to be reminded,” he said, “that’s why I should have been Batman.”\n“Dick, buddy, sweetheart, son, let it go.”\n…\n“Poison darts,” Cyborg read aloud from the labels over each tunnel branching off the cavern they had come to. “Acid rain, flamethrowers, pendulums of death? Jesus what is this place?”\n“Gremlin.”\n“What?”\nWonder Woman pointed to the last tunnel.\n“Gremlin,” Cyborg read, “Hu.”\n“What is a Gremlin?”\nCyborg paused, thinking it over for a moment, “Uh, it’s a little monster I guess, violent, angry, chaotic. Lives to cause trouble.”\n“Odd, I’ve never encountered one of these creatures.”\n“They’re not real. They’re just a story. Folktales.”\n“Then what is in that tunnel?”\n“I dread to think.”\nBruce Wayne was a criminal genius.\nIt seems he knew all their weaknesses.\nKnew exactly what to do to trap them. To trick them.\n“How stupid can you be,” Flash had scoffed once during a Justice League movie night as the hero on screen made a fatal mistake, “Everyone knows you should never press a Big Red Button, that’s just asking for trouble.”\nWayne had known.\nNightwing hadn’t been present that day. It had happened long before he joined. But somehow, he had known.\nHad known that Flash would never be tempted by a Big Red Button.\nWould never fall for such an obvious trap.\n“Flash no! Don’t press it,” Hawkgirl had cried out in warning as she saw him reaching for the device. It had taken them just under an hour to find a route into the house. Another half hour quietly sneaking through rooms trying to find a route down into the caves below. That’s when they had stumbled on this. This devious room.\n“Don’t be ridiculous,” Flash had grinned back at her over his shoulder. “It’s purple! Nothing bad ever came from pushing a Big Purple Button!”\nNow he was trapped.\nHawkgirl circled her friend in agitation.\nThe wall of screens before Flash flickered in a cacophony of light. Speakers on the walls let out a vicious hum making Hawkgirl’s head hurt.\nFlash stared forward, jaw slack, eyes fixed, not blinking, not moving, not reacting to any of her attempts to reach him. Caught in a hypnotic trance.\nDucking her head to shield her eyes from the screens lest she be caught too, Hawkgirl cursed Bruce Wayne as she moved about the room, trying to find a switch or some other means to turn off the screens. Her first thought had been to simply pick up Flash and carry him from the room, but who knows what damage might be done to his psyche if this strange brainwashing device was interrupted incorrectly. Flash might be lost forever.\nMinutes passed with Flash frozen in place and no luck finding a switch, when Hawkgirl looked to her friend and saw the strange movements he was now making. Though his eyes didn’t move from the screen, his face was contorting violently, his body was twitching, feet shuffling on the spot, hands gesturing wildly, lifting up and down, often rising to touch his face then dropping again.\nHawkgirl watched for several moments as Flash went through each of these motion’s multiple times. It was clear what was happening. He was trying to break free!\nShe had had enough. There was no obvious way to turn off the screens and she dare not touch the fitting speedster. That left one option. With a mighty battle cry the warrior heaved her weapon into the air and swung it with all her might towards the wall of light.\nFrom the corner of her eye, she saw Flash lunge forward, feet moving in superspeed to intercept her attack. Clearly there was an inbuilt layer in the hypnosis that forced its victims to protect it.\nJust further evidence of Bruce Waynes diabolical genius.\nIt was no use however. Flash had speed but Hawkgirl had strength. She brushed him away.\nThe axe hit home with a crash of glass and sparks. The room they were standing in, previously covered in the eerie blue glow of the screens, went dark. Blessed silence filled the space, broken now only by Hawkgirl’s heavy breathing, as the sharp hum from the speakers cut off.\nFlash, at last turned to look at her, though his eyes remained glassy and confused.\n“What? Wh…”\n“It’s ok, my friend. You are free.”\n“Free?” Flash shook his head to clear the last of the confusion, “What…why did you do that?” he demanded.\n“You were trapped in a…”\n“That was the last episode!” he interrupted with an anguished cry, eyes filling with tears. “I was so close to finding out who was behind everything!”\nHawkgirl took a step back startled by this outburst.\n“What are you talking about?”\nFlash gestured to the screens; pain reflected on his face at the crater of glass in the middle of them. “The last episode, ‘Everything Happens for a Reason’ It’s only the best show ever! I just binge watched the whole thing at 800 x speed and I was just about to find out the reason when you…you…” he gestured to the destruction before them.\nHawkgirl stared back feeling equally outraged. “You…were watching television?” she hissed.\n“At 800 x speed,” Flash repeated enthusiastically. “Do you know what that means? To be able to speed up shows to a pace that’s comfortable for me without compromising sound or picture quality? It’s a game changer!”\n“You were watching television.” Hawkgirl screeched again, outraged. “Our friends are held captive; we are lost in a villains lair and you stopped to watch a stupid show!?”\n“It isn’t stupid! It’s…”\nHawkgirl raised her axe threateningly and snarled.\nFlash took a step back in alarm and raised his hands in surrender, “But I get your point. Sorry.”\n“Find us a route down to the caves. Now!”\nFlash sped out of the room and Hawkgirl took the time to close her eyes and count to ten, calming the rage boiling inside her. After ten seconds she was feeling decidedly less murderous, just in time for Flash’s return.\n“Found a staircase behind a clock.”\n“Lead the way.”\n…\n“Hold on my friend,” Martian Manhunter coaxed, fiddling with the shackles binding Superman to the chair. “We’re getting you out of here.”\nThe Martian’s head was still ringing from the sonic scream that just shook the cave systems and he blinked against the flashing lights behind his eyes.\nSuperman struggled frantically against the hands touching him, feet kicking uselessly in place. When his first wrist was freed, he took the opportunity to pull off the headphones and eye mask blocking his senses. Then spat the gag from his mouth. “Oh, it’s you,” he grunted, blinking at the green man.\nMartian Manhunter looked up from where he was untying the second hand and flinched back from the glare being aimed at him.\n“What is the matter?”\n“Why didn’t you take the blindfold off before you started grabbing at me?”\n“I was untying you.”\n“But why didn’t you take the mask and headphones off first?!”\n“What for?”\n“So, I would know it was you.” Superman growled. “Do you know how stressful that was? I thought it was one of Nightwing’s people.”\n“Why would one of them be untying you?”\n“I don’t know! To take me to another cell deeper inside this hell hole where they can torment me further.”\nMartian Manhunter crouched before him, face open and concerned. “Torment you further? What have they done to you?”\n“Well…nothing yet,” Superman admitted breaking eye contact, “But, they could have been starting now and you…uh forget it. Just get me out of here already.”\n“Why are you angry with me?” Martin Manhunter demanded, echoing Superman’s frustration back at him. He yanked at the ankle shackles. “I’m here to rescue you.”\n“I’ve had a very stressful day, ok?”\n“We all have.”\n“Just get me out of here.”\n“I was trying until you started berating me,” the Martian grumbled, returning to his task.\nFinally, Superman was free, save for a band around his left wrist which kept a chunk of blue kryptonite pressed to his skin, dulling his powers. Despite their best efforts, nether alien was able to remove it.\nIn the quiet of the room, Martian Manhunter caught Superman up on the rescue plan that was underway. “The League have the place surrounded,” he assured the other. “We will soon have Nightwing and his minions apprehended.”\nPhasing through the door to open it from the outside, setting Superman free, Martian Manhunter glanced down the hall looking for any other holding cells. “Where are they keeping Batman?”\nSuperman pushed out of the overkill room with a wide-eyed look of alarm on his face. “They have Batman?!”\n…\nGreen Arrow floated on his back, letting the whirlpool drag him in circles. He gazed up at the cave roof in a daze, mind reduced to jelly by the combination of the sonic scream, multiple dips underwater, and the constant spinning. “I think I might be Atlantean,” he muttered, “This is my home now. I am one with the water. The water is I.”\nFrom the other side of the pool Aquaman glared at him in irritation. “I am going to drown you.”\n“You cannot drown the water.”\nEyes fixed on the tunnel in front of him to ensure another slippy slide of doom wasn’t about to smack him in the face Aquaman concentrated his energy on the water surrounding them and lifted himself and Green Arrow out of the pool, depositing them on the rocky edge of the cave. Once out Green Arrow flopped about like a fish in a panic and tried to wriggle back over into the pool until Aquaman kicked him in the ribs far more gently than he wanted to.\n“You are a land dweller. Stand.”\n“Stand?” Sitting upright Green Arrow grasped at his own legs in astonishment, “Leg’s! I have legs,” he cried, then gasped. “I have to kiss the prince before the sea-witch steals my voice!”\nAquaman wasn’t sure what the other man was talking about but keen to get them moving he decided to roll with it. “The prince is this way,” he coaxed beginning to walk into the tunnel leading out of there. “Follow me.”\nGreen Arrow climbed onto shaking feet and stumbled behind him. “Sha-la-la-la don’t be shy, hey do you know a Jamaican crab?”\n…\n“Get your hand out of my face.”\n“Get your foot out of my crotch.”\n“I am nowhere near your…”\n“Damn it my legs are stuck.”\n“Stop trying to walk. Crawl up. Try to balance on the top and roll towards the edge.”\n“What do you think I’m trying to do?” Black Canary demanded. She grabbed the nearest foam block and flung it somewhere in the direction of Green Lantern. “Can’t you build a construct to get us out of here? Stairs? A rope?”\n“After you banshee blasted me twice in as many hours? You’re lucky I haven’t vomited all over you!”\n“Ugh, these foam blocks are like quicksand. It’s like they are dragging me back in.”\n“I think this is a black hole of foam,” Green Lantern grunted as he got close to the edge and the wall of foam before him toppled sending him sliding back to the middle.\nJust outside the pit, a dark patch of shadow moved ominously. With a soft thud the end of a rope landed between the two trapped heroes, its other end extending out into the darkness, disappearing beyond sight. Black Canary and Green Lantern eyed it wearily.\n“Do we…”\n“Just go for it,” Black Canary decided, grabbing the rope and dragging herself towards the edge, “Even if this is a trap, at least we will be back on solid ground again.”\nGreen Lantern shrugged and grabbed the rope as well, following behind her.\n…\n“Hey! You’re electric too, right?” Captain Marvel grinned, floating down to land on the metal platform where a young boy was crouching dressed in yellow.\nThe boy turned to face him, grinning wildly. “You’re Captain Marvel,” he noted excitedly. “I’m Signal.”\n“Billy,” Marvel introduced holding up his hand for a high five.\n“Duke,” the other boy responded. “And, to answer your question, I’m not electric, though I can redistribute light energy.” He met the high five with his own hand and added a jolt of energy as he did.\nMarvel laughed at the zap that ran up his arm. “Close enough,” he grinned, pointing to the yellow bolt on his own costume. “We can be lightning buddies.”\n“Yeah,” Duke cheered in response.\nBelow their feet the metal platform rattled and from the staircase leading up to the house a new figure arrived. Dressed in red with a lightning bold motif in the middle.\nCaptain Marvel and Signal shared a mischievous grin then both cried out, “Lightning buddies!” and promptly blasted Flash off the platform into a net below.\n…\n“Yelp, yelp, gob, yulp.”\nWonder Woman jumped back, her eyes wide and sword drawn, ready to face any adversary that dared challenge her. From the dark tunnel in front of her a creature emerged. It peered up with its beady little eyes.\n“Is this the gremlin?” she asked.\nCyborg leaned to peer around her at the fearsome opponent she held at sword point. He raised his eyebrows judgmentally.\n“That is clearly a turkey.”\nGritting her teeth in frustration Wonder Woman twisted to snarl at him over her shoulder. “I know what it looks like but I know nothing of these gremlin creatures. They may be able to change shape.”\n“I told you gremlins are not real.”\n“And yet this tunnel supposedly houses one. Now are you certain it is not this creature?”\n“Yes, I am sure the turkey is not a…”\n“Tchh.”\nCyborg and Wonder Woman both froze at the sound which had inexplicably come from behind them.\nAs one they turned, looking back into the darkness they had just come from to find another small creature standing. This one was not a turkey. It was short, masked, wore a sinister smile, and carried a very sharp looking katana. It almost looked like a child. If not for the unsettling aura around it.\n“You dare threaten Jerry?!” the creature challenged, stepping closer.\n“Gremlin,” Cyborg whispered.\nWonder Woman glanced towards him, “What?”\nThe question fell on empty air. Cyborg had already turned once again and began to run, past the turkey, deeper into the cave tunnel. “GREMLIN!”\n“Haayaahhh,” the gremlin roared in an angry battle cry, charging at the Amazonian.\nAs a warrior Wonder Woman believed in facing opponents head on. As a tactician she knew better than to face an unknown assailant alone in closed quarters. She didn’t know what the gremlin could do, but she knew she couldn’t fight properly in this closed tunnel. The gremlin, it seemed had no such limitations.\nIn the interests of strategy, she followed Cyborg’s lead. She dodged past the turkey. She ran.\n…\nDown the metal staircase behind the grandfather clock, Hawkgirl made her descent. At first she was frustrated when Flash sped ahead of her but soon her limitation became an advantage as the speedster ran into trouble in the form of Captain Marvel and an unidentified figure in yellow.\nHawkgirl observed their assault on her teammate from her vantagepoint higher up the staircase. She felt less sympathy for Flash as he toppled down to the cave below than she would have earlier before he stopped in the middle of their recue operation to watch tv.\nDucking to be sure the two assailants below didn’t spot her, Hawkgirl hid in the shadows of the cave until the coast was clear then dived over the railing and extended her wings, gliding down the back of a life-sized t-rex figurine and making her way through the darkness to the centre of the cave where she could hear voices.\n…\n“Batman!”\nSuperman gasped in shock at seeing his fearsome teammate in such a vulnerable position.\nWith Superman’s powers still being repressed it had taken the two aliens several minutes of searching to find their still captive teammate, all the while doing their best to avoid whatever cameras or alarms Wayne was likely to have in place. They had eventually found the vigilante in much the same position Superman had been in, tied to a chair, bound, gagged, ears plugged, unable to move.\nWith a pointed look towards Martian Manhunter, Superman reached out to first remove the blindfold and headphones speaking gently to their teammate. “Batman, it’s us, we’re here to get you out.”\nMartian Manhunter rolled his eyes and began working on the shackles.\n“Batman, what happened?” Superman asked as he pulled the gag away, “How did Wayne capture you?”\n“He set a trap,” the vigilante explained in his familiar gravely tones. If there was any slight difference from usual in his tone or pitch then the two aliens each simply put it down to their own altered hearing; Superman from the kryptonite and Martian Manhunter from the Canary scream that had echoed the walls a short time ago. “He tricked me,” Batman continued, ducking his head in shame, “I thought I could trust him but he was...”\n“Shhh,” Superman cut him off, “It’s not your fault. He was a skilled manipulator. Almost fooled us all.”\nBut didn’t, The Kryptonian smirked internally, pleased with himself that for once it was Batman who had been caught out, while the rest of them saw through Nightwing’s charade. The vigilante must be livid. There would be time to gloat later though. For now they had a criminal mastermind to deal with.\n“Can you stand?” Martian Manhunter asked as the other man was freed.\nBatman responded by neatly leaping to his feet, rolling his shoulders to ease any tension and starting towards the door. “Come on,” he ordered, taking charge. “I know what Wayne is planning, we need to move fast.”\n…\nIn the main chamber the rest of the Batfamily and guests, were poised and ready, cameras had been shut down. Weapons were in hand. They formed a circle around the edge of the main platform, watching every entrance. Waiting.\nOne by one the Justice League appeared, emerging from doorways, and tunnels, and stairwells, and alcoves. Flash, after much struggling, wrestled his way out of his net and dropped down to the floor.\nIn the middle of the platform Bruce Wayne stood, arms outstretched and smile wide.\n“Welcome,” he greeted, nodding to each hero in turn. “Welcome to my humble abode. I’m so glad you all finally made it. Now, let’s get this party started, shall we?”\nBruce Wayne was having the time of his life.\nHe couldn’t remember when he’d last had this much fun.\nAll around him he could see his kids playing happily. Working together. Laughing and joking.\nTormenting the shit out of the Justice League.\nIt was a good day.\nBruce himself squared off against Martian Manhunter, the two of them locked in a battle of mind and body; the alien trying to bombard Bruce’s mental barriers in between punches. Bruce could feel it tingling in his temples and knew he wouldn’t be able to hold him off forever but for now it was easy enough to push back.\nOver by the cave’s gym, a still groggy Superman was teamed up with Batman to fight Dick. Since the League still believed Bruce was Nightwing the younger man had needed a different disguise for the showdown, which is why he was now wearing an atrocious costume that looked like disco fever gone wrong with its gold details and high collar in electric blue. The fashion monstrosity had been his original Nightwing design before the rest of the family had vetoed it and talked him into the simpler black and blue costume he finally settled on.\nSuperman, bless his heart, was still weak from the red sun lamps and blue kryptonite exposure. Despite trying his best to join in the fight he was hanging back a lot and relying heavily on Batman to fight off their opponent. Unfortunately for him Batman was the one keeping him weak, with a shard of blue kryptonite in the pocket of his utility belt. The trusting hero didn’t suspect for a moment that he was being duped by his most trusted ally.\nIt wasn’t surprising he was fooled; Dick and Alfred were putting on a good show; mostly because Dick was not holding back much, instead making Alfred work for it. “If he wants to be Batman then he can earn it!” he’d declared earlier, to which Alfred had smugly responded “Bring it on!”\nThe older man was admirably holding his own.\nDown in the lower levels, Jarro and Aquaman were circling like sharks, each sizing the other up. Aquaman was struggling to understand the little star. Based on its appearance he tried to use his ability to control sea life, convinced that the thing must belong to his domain, but it responded by releasing a spray of spores that latched onto his face and chest, trying in turn to control him. The two were equally matched, their wills each fighting for control.\nIt was unclear at this point if Wonder Woman and Damian were fighting or playing, both of them clashing swords in a violent barrage and laughing manically like a pair of demons. “You are a fine opponent,” the warrior praised, parrying Damian’s strike. “You are adequate,” this child responded earning an enraged battle cry as Wonder Woman charged him. Only Bruce's conviction that Diana wouldn’t hurt a child kept him from abandoning his own fight and running over to intervene.\nSo far, Hawkgirl staying out of the fighting. The warrior in her conceding this once to the strategist. Observing the chaos from above and awaiting her moment to strike, her keen eyes were trained on Wayne; the mastermind behind all of this trouble. Unbeknownst to her as she held her vigil she was also being watched. Cameras throughout the cave tracked her location. From his dorm room Jason scanned through Tim's list of traps, smiling like a Cheshire cat when he found the perfect one. Now he just needed to wait for his moment.\n \nCyborg, who had fled from the gremlin otherwise known as Damian, now found himself facing off against a laughing Captain Marvel who was currently trying to pitch a case for switching allegiance. “Mr Wayne provides full dental cover to all minions. You get access to all his tech. Imagine the upgrades you could get? There’s a company car. You could have a Merc. Or a Bently. Or a mini-van. Snacks are provided. Unlimited tea and coffee. Plus, if I’m the one to get you to turn I get a cash bonus!” Through all of this he floated in the air calmly dodging every attack a panting Cyborg tried to hit him with and occasionally zapping the man back a few feet. “Did I mention the holiday entitlement? Two weeks a year and unlimited PTO for injuries sustained on the job. Which is important because evil goon is a high-risk occupation.”\nThanks to his ability to move faster than light Duke was running rings around Flash which was clearly driving the speedster nuts as he dashed around the room trying to grab the younger man only to find him gone before he could tighten his grip every time. “Stay still damn it!” he snarled. Duke waved from his perch on top of the dinosaur. Flash ran up the tail but by the time he got there he was alone. From his new position on the metal staircase Duke grinned. “Make me, slowpoke.”\nOn the rotating platform to the centre of the cave Cassandra danced around Black Canary, perfectly merging her ballet and combat skills to keep the older woman on her toes. Still disorientated from being blasted by her own scream earlier, Canary knew better than to try that attack again within the confines of the cave so was limited to martial arts and it was becoming clear the younger woman had the advantage. Canary watched as Cassandra flipped up onto the hood of the car then cartwheeled over the roof only to sprint back down and launch towards her without warning. She barely avoided a foot to the face in time.\n“Missed me,” Barbara teased cartwheeling past Green Arrow. She frisbeed a clay pigeon towards his head and watched it shatter as an arrow hit it. “Missed me too,” Stephanie shrieked mimicking the other girl’s motion and throwing a glitter bath bomb that burst into dust as it was struck leaving all three of them in a cloud of strawberry scented bicarbonate powder. The two girls darted around the man, taking turns throwing projectiles to draw fire as he rapidly shot them away.\nTim and Green Lantern were caught in a stalemate. The boy sat calmly inside a green cage, finger on the button of a device that would tip ta vat of yellow liquid over the lanterns head temporarily neutralising him. Not because it was yellow; that was an old lantern tale to scare new recruits, just because it was highly toxic. Tim had emptied over nine hundred glow sticks to fill the vat. He could have just ordered the liquid in bulk, but methodically opening and draining the glow sticks one by one had made him feel like a true evil villain, which had been a fun way to spend a weekend.\nThere were also water guns filled with the same liquid set to fire automatically from all sides when the vat tipped so Lantern couldn’t even construct an umbrella to shield himself.\n“Drop the button.”\n“Let me go.”\n“Drop the button.”\n“Release me fiend.”\n“Drop the button.”\n“Free me from this prison!”\n“Are you always this dramatic?”\n“It runs in the family,” Tim nodded. “You cannot hold me forever. I shall escape these bonds!” he cried, sitting perfectly still in his cage, making no effort to escape.\nIn the midst of the chaos the giant wall of screens above the computer terminal switched on to reveal Jason wearing a Jigsaw mask.\n“Welcome,” he greeted. “Isn’t it nice you could all be here to play our game? Now for some added tension, lets add a countdown!”\nOn the screen a large 10 appeared in red.\nAt almost that exact moment something drastic happened.\nFlash switched sides.\nOne moment he was fighting Duke, next he was helping Barbara and Stephanie, knocking arrows out of the air.\n“What are you doing?” Arrow demanded.\nFlash grinned, “I’ve seen the light. Marvel is right. Villainy is the way to go.”\nWhat he’d actually seen was a short video at super-speed, roughly explaining the truth of what was going on and offering him a chance to join the prank, shown to him via a headset Duke had quickly slipped over his eyes.\nWith an ominous click the countdown dropped to 9.\nHawkgirl swooped overhead the group. Flying as close to the top of the cave as she could manage without hitting the stalactites. She raised her mace,\nMany miles away in a dorm room Jason pressed a button.\nHis moment had come.\nThere was no visible reaction in the cave. Not at first. Except for Superman who winced and rubbed his ears, confused by the strange sound being picked up by what little of his super-hearing remained in his weakened state. Then came the bats.\nThe winged creatures appeared in a swarm. Seeming to bleed out of the darkness from every corner. Several of those fighting paused for a moment to shriek in alarm. Strategically placed speakers transmitted a carefully chosen frequency, guiding the bats through the space until they converged on a panicked Hawkgirl, knocking her out of the air and down into the same net Flash had escaped earlier.\nThe large screen clicked again.\n8\nFlash stole Arrow’s bow, hanging it from the dinosaur’s mouth, effectively knocking the marksman out of the fight.\nBarbara and Stephanie each produced some rope and lassoed Arrows shoulders then started tying him up like a maypole, ducking and skipping in opposite directions around him with their two ends as Flash cheered them on.\n7\nAcross the room Jarro gave an extra push and Aquaman’s willpower failed, leaving him in the alien starfish’s control.\nAquaman now a reluctant helper to team Wayne, followed Jarro’s lead as together they went to help Cassandra against Black Canary.\n6\nDuke, now unoccupied charged at Green Lantern, pushing him out from under the glowstick vat and blasted him with energy, causing his construct to fail releasing Tim. The effort of shielding against the onslaught quickly caused the Lantern to lose energy and his ring gave out, suit dulling and eventually fading away to reveal his civilian clothes below.\n5\nCyborg blinked, eyes scanning the urgent email he’d just received from someone called RedR. It contained roughly the same information Flash had been shown.\n“So,” he said powering down the guns he had been loading to fire at Captain Marvel, “Tell me more about this dental plan.”\n4\nBlack Canary screamed at the top of her lungs, frustrated beyond belief at her predicament. The sound was muffled and harmless since she was now trapped beneath Jarro who had simply grown to eight feet tall and flopped down on top of her. Aquaman sat comfortably on Jarro’s back and Casandra amused herself cartwheeling around the five points of her alien brother’s body.\n3\nAfter an epic battle of wills Martian Manhunter finally managed to push through Bruce Wayne's mental barriers. What he saw was surprising.\nNo maliciousness. No evil intent. Just feelings of humour. Affection. Some exasperation.\nThe exact nature of what was going on was still unclear but Manhunter was now sure they had misjudged the situation. With a curious head tilt, he stepped back from Wayne and shrugged, abandoning the fight.\n2\nHer sword skills tested vigorously for the first time in far longer than she had realised, Wonder Woman began to tire. One by one as their opponents either switched sides or were defeated the Wayne children came to join Damian in his fight, surrounding the warrior princess and forcing her to defend herself from every side. She snarled and kicked and swung her sword viciously, now facing the added challenge of both Flash and Cyborg helping the Wayne's to take her down. It was all over when the lasso of truth was snatched from its place at her belt and used to bind her arms to her side uselessly.\n“You were a good opponent,” Damian complimented. “More than adequate.”\n“I’m going to eat your turkey,” She promised darkly.\n1\nSuperman grunted with exertion, his fists raised to defend against Dick’s incoming roundhouse kick, batting the attack away even as he stumbled back. They had fought hard and Superman was sad to see that all around him his team was either losing or turning on him. This isn’t how he thought things would go. With a resigned shake of his head he turned to Batman, giving him their customary smirk. If nothing else, he was glad he would go out fighting beside his friend. “Looks like it’s just us now.”\nHe watched with sinking horror as Batman turned about face, exposing his back to their opponent and shaking his head in regret. “No, my friend. It’s just you.”\n0\nSuperman fell. There was no more fight left in him.\nAcross the cave the Wayne's helped their fallen opponents back up (or down in Hawkgirl’s case) and gathered them in the centre of the training mats around the despondent looking Superman.\n“Okay,” Dick pouted crossing his arms. “We made Superman look like a kicked puppy. We are officially villains.”\n“Aww, I feel guilty now,” Stephanie sulked, accepting a hug from Cass.\n“I blame Drake,” Damian added. “This was his plan.”\n“Hey!”\n“I thought it was Bruce's plan?” Duke said.\nOn the screen above them Jason removed his mask and nodded. “Yeah, blame Bruce. Totally his doing.”\nBruce hung his head, wanting to deny it, but he caught sight of Superman’s face and felt a pang of guilt.\nThe confused Justice League watched the group bicker, still a little on edge but sensing that something had shifted in the air. Whatever urgency had filled them during the fight was gone and as one they seemed to understand the danger had passed, if there had ever been any danger to begin with, although even the ones who had been partially let in on the deception weren’t totally sure of the details.\n“Ok, time out,” Green Lantern said, feeling naked in his jeans and t-shirt, his ring still out of juice. “What the heck is going on?!”\nFlash raised his hand in the air, bouncing on his toes in excitement. “Oh, I know I know.”\n“I doubt that,” Bat-fred muttered, making the speedster pout. Feeling guilty the old butler then made up for it by pulling a snack bar out of his utility belt and tossing it over.\n“Ist—suf—prnk” Flash explained around a mouthful of oats and honey.\n“What?” Lantern demanded.\nCyborg rolled his eyes and stepped up, roughly summarising the email he had received. “It’s a prank. Nightwing is an old associate of Batman’s. That’s why he trusted him so quickly. When they found out about our suspicions, they decided to mess with us.”\nA few of the team glanced towards Bruce who was standing with his hands in his suit pockets.\nGreen Arrow looked furious, “Are you kidding me? After everything we went through, this whole ordeal was just Nightwing pranking us?”\n“No.” Bruce smiled, “This was Batman pranking you.”\nAll attention turned to Alfred.\nBlack Canary shook her head, “Batman doesn’t have enough of a sense of humour to be the ringleader of this.”\n“I do,” Bruce argued.\n“Well obviously you do Nightwing, which is how we know this is your doing.”\nAcross from them Dick groaned in frustration, burying his face in his hands and screaming quietly into his palms. “I’m not that old! Why do you think I’m old??”\nBruce shook his head. “That’s Nightwing,” he said pointing at Dick. “I’m Batman.”\n“You’re Nightwing?” Flash asked Dick, at the same time Aquaman firmly told Bruce, “You are not Batman.”\n“I am,” they both responded.\n“This is Batman,” Green Lantern insisted, pointing at Alfred.\n“Alfred, take off the mask please?” Bruce pleaded, tired of talking in circles.\nAround him the League members all gasped. “Dude, you can’t just reveal Batman’s name like that! That’s like rule number one.”\n“It’s quite alright,” Alfred assured them, letting his British accent through once more. He pulled the mask free with a flourish, the performer in him demanding no less. “I believe it is time to come clean.”\nThe sight of the greying older gentleman made many of the League pause for a moment before Wonder Woman let out a sharp gasp.\n“Alfie?”\nAlfred turned to her with a smile and stepped forward, wrapping the warrior woman in a hug which she easily returned.\n“Hello Miss Prince. It’s been far too long.”\nThis unexpected exchanged shocked not only the League but the entire Bat family as well. Bruce’s head rapidly turned left and right looking between his butler and his teammate, jaw on the floor.\n“You two know each other?”\n“We worked together once, many years ago,” Wonder Woman explained.\n“When I was a far younger man.”\nBruce damn near choked on his own tongue. Not once in all the time that he had been working with the Justice League had Alfred mentioned knowing Wonder Woman.\nThough to be fair Alfred had never said much of anything about his own mysterious past.\nRegardless, never let it be said Bruce wouldn’t seize every opportunity.\n“Miss Prince, Wonder Woman, ma’am, Your Highness, please I beg you; tell me everything you remember about young Alfred. I need to hear this like I need air.” The Amazonian rolled her eyes and gave Alfred a conspiratorial look that just made Bruce more determined. “I will pay you a million dollars to tell me everything,” Bruce tried, “Two million. Please?”\nThe pleas fell on deaf ears it seemed.\n“If I had known you were in Gotham,” Wonder Woman addressed Alfred with confidence, “I would have immediately known you were Batman. Now that I do know it seems so obvious, from what I remember of you it couldn’t have been anyone else.”\n“Oh, come on!” Bruce whined.\nThe Bat-family were now even more curious, clambering around Alfred demanding information.\nWhatever concerns the rest of the League had over Alfred’s age were dispelled by Wonder Woman’s assurances. There was no question in any of their minds now that he was the real Batman. The shock of learning Batman's identity at last seemed to have chased away their anger at being tricked.\nFlash ran forward to stand before the man, his eyes wide with amazement. “Woah, Batman, you are way older than I was expecting. That is so badass and awesome. How are you so fit?  Oh, wait, Barry Allen,” he introduced himself, quickly remembering his manners. “Nice to finally officially meet you.”\n“Alfred Pennyworth,” Alfred greeted, “At your service.”\n“So, you’re British?” Green Lantern asked, pushing Flash aside to get closer to the man. “No way. In all the years we’ve worked together I never would have guessed you were British! Changing your accent is such a top tier secret identify move. I wish I could do that.”\n“He’s not Batman,” Bruce repeated again. He was ignored by everyone.\nAround him his multitude of children were fighting back laughter. Traitors.\n“I’m a trained actor,” Alfred was explaining as king of the traitors. “And I of course learned more than a few tricks during my time in the secret service.”\n“You’re a spy? Like an actual spy? Like James Bond?”\n“In another life I was. In the Queens Service.”\nHawkgirl was nodding in understanding. “That…makes perfect sense. Of course, you would have a background in espionage.”\n“Absolutely,” Green Lantern was nodding. “I just knew you would have some cool backstory like that Spooky.”\nAquaman seemed equally assured. “It is no wonder you have proven such a reliable advisor to me in my role as King. It seems so obvious now that you had prior experience with royalty.”\nBruce stood rooted to the spot, jaw hanging open, unable to believe what was happening. “Alfred,” he pleaded.\nThe older man ignored him, happily regaling the League with the tale of how he Alfred Pennyworth became Batman.\nBruce glanced towards his children, eyes pleading for help, but found none.\n“And then I crossed over to the states,” Alfred was saying, “and found my way to Gotham.”\n“This is amazing,” Stephanie whispered practically vibrating with delight.\nStepping forward to join the gathering crowd of Justice Leaguers Superman looked deeply relieved. “You didn’t betray me,” he laughed in relief. “It was just a joke. Oh, I’m going to be so mad at you later but right now I’m so happy.” He clasped Alfred’s hand firmly. His grin widened as something else occurred to him, “It was you who knocked me out in the dining room. That’s such a relief. Now that I know you’re Batman I don’t feel so bad about it.”\nAlfred smiled back at him. “I’m glad you brought that up Mr Kent, because based on everyone’s performance here today I think a new League training regime is in order. You should all be better prepared for such attacks.”\nThe team all groaned but didn’t protest.\n“Great, he’s still a hardass!” Black Canary complained.\n“Alfred,” Bruce tried again. The kids were outright laughing at him by now, drawing the team’s attention to them.\n“You trained all these younglings to fight?” Wonder Woman asked Alfred.\n“Indeed. I felt it best they be prepared to fight if needs be, given the state of the world.”\nShe nodded in understanding.\n“All except Brucie, that is,” Alfred clarified, gesturing to Bruce with a smug grin. “The dear boy never had the stomach for fighting. He’s too much of a sensitive soul. And frankly he’s always been a little clumsy.”\nThe kids were clinging to one another crying with laughter.\nBruce had never felt so betrayed. “How is this happening?”\n“Father makes himself useful in other ways,” Damian piped up, smiling wickedly. “He sometimes helps Batman bandage his wounds after patrol.”\n“And he cleans the Batmobile,” Tim added biting his lip.\n“And takes care of the pets.”\n“And the kids,” Alfred added, throwing Bruce a bone. “Bruce is a very good Father.”\nThe Leaguers all took the time to stop and look closely at the gaggle of children surrounding them, for the first time looking a little impressed with Bruce.\n“These are all your children?” Aquaman asked, “Impressive, seven younglings. A mighty brood.”\n“Nine,” Bruce corrected quickly.\n“Hu?”\n“I have nine kids,” he then turned and re did the count, naming each child in turn, including Jason on the screen. “In total, counting biologically, legally, and spiritually.”\n“You—counted the starfish?”\n“His name is Jarro and he’s my son. I’ll thank you to be respectful.”\n“He’s your son? That—”\n“Arthur,” Bruce snarled. “He’s my son. Watch what you say.”\n“What about the dogs?” Flash ventured, sounding unsure “Are they…”\n“They are pets.” Bruce cut in with an eye roll. As if it were obvious. “As are the cats, the turkey, the cow—”\n“And the elephant,” Dick added.\n“Elephant?” Black Canary squealed; everyone was now glancing around in horror as if they all might somehow have overlooked the presence of an entire elephant in the room.\n“She lives at the zoo,” Bruce explained.\n“Of course, she does.” Green Lantern snarked, “but the starfish is family and the cow lives in the house.” Bruce’s calm nod just riled him up further. He glanced around at the strange assortment of people. Then at the cave. The dinosaur. The giant penny. Batman.\n“This is ridiculous. I feel like I’ve just walked into the Addams Family.”\nThe Lantern recoiled in alarm as every member of the Bat-family, in total synchronicity raised one hand and snapped their fingers twice. Even Jarro neatly flicked one of his star points in time with the rest.\nHe wasn’t scared. Lanterns didn’t get scared. He was justifiably concerned. He was also very relieved to see the rest of the League looked equally disturbed by this display.\nFlash leaned forward, morbidly fascinated. “Addams family,” he tested.\nThey did it again.\n“Holy shit. Addams…”\nSuperman slapped a hand over Flash’s mouth to silence the speedster. “Stop,” he snarled in warning.\nWith a chuckle Alfred beckoned everyone to follow him, moving towards the metal staircase. “Come. Now that everything is mostly cleared up, we should all convene upstairs. Timothy, please turn off all of the traps? Barbara if you would kindly bring the performance reports for each of our guests, we still need to discuss all the ways they could stand to improve. It may take a while.”\n“You really are a good actor,” Green Arrow whistled. “How do you sound so polite when you’re insulting us right now? Usually, you sound like a miserable bastard.”\n“Don’t push your luck, Arrow!” Alfred snarled in a perfect imitation of Bruce in full Batman mode.\nGreen Arrow shrieked and jumped back, face white. “Sorry.”\nAll of the bat-kids were staring at Alfred in horror.\n“What the fuck?” Cassandra whispered. All of the shocked faces turned on her.\n“Cassie don’t swear,” Bruce pleaded. “My heart has already suffered enough today.”\n“Given the quantity of guests and the fact that I will be too busy discussing the new training regime to cook, I will on this singular occasion allow the purchase of fast-food,” Alfred stated, his voice dripping with disapproval.\nThe kids all hollered in excitement, unable to believe what they were hearing. A chant of ‘Pizza, Pizza, Pizza’ echoed through the cave as they ascended to the manor above, both bat-kid’s and Leaguers alike joining in.\nThe image of Jason on the bat-computer monitor frowned in annoyance at the now empty cave. “I guess I’ll just hang up then,” he muttered. “No pizza for Jason.”\nHis phone pinged in his pocket, a notification popping up.\n“Confirmation of pizza order to UCL dormitory. Anticipated delivery time 30min.”\nJason grinned and sent a text to Bruce.\n*Thanks dad*\nThe response was immediate.\n*I’ve ordered 20. Share with your friends*\nJason shoved his feet into shoes and headed back down to the common room. He’d tell everyone the pizzas were a thank you for their feedback on the maze game. As he descended the stairs he sent off one final text to Bruce.\n*You’re still my favourite Batman*\n…\nUp in the Manor Bruce watched as all the League members gathered around Alfred, eager to learn more about the Batman.\n“I regret everything,” he sulked.\nThe sofa he was sat on slumped slightly as Martian Manhunter plonked beside him holding a bag of oreo’s. He accepted one from the packet when offered.\n*It is good to finally meet you Batman* the Martian said, projecting the words into his mind.\nBruce smiled, feeling a deep relief that at least one of his friends knew the truth. *You too J’onn*\n*Though I suppose after that party we already know one another intimately*\nBruce immediately shut off his mind, blushing furiously.\n“I was maintaining my cover,” he defended out loud.\nManhunter smirked. “So was I.”\n“Three million,” Bruce called out to Wonder Woman as she passed by, still trying to negotiate for information on Alfred.\n“No.”\n“You can have my car,” he offered, “My house. One of my children. Pick your favourite.”\n“The young one is a menace.”\n“Not that one then. You can have Jason. Jason is great. He loves you. You’ll love him.”\n“I want the turkey. Preferably roasted.”\n“The young one would roast us both.”\n“Take it or leave it.”\nBruce scowled. “Fine, keep your secrets.”\n…\nThe next few hours were a chaotic mess.\nAround the dining room table ‘Batman’ grilled the League on every poor decision they had made over the last few weeks, with each of the kids chiming on with their own comments and suggestions for improvement. Damian and Tim, in a rare moment of synchronicity were particularly scathing in their criticisms.\n“It was so obviously a trap,” Tim was saying to a bashful looking Cyborg, “It couldn’t have been more obvious of a trap if I had placed a flashing sign above the door that said TRAP. And you just walked in.”\n“And your sword fighting needs work,” Damian added, eyes fixed on Wonder Woman.\n“I was going easy on you, child.”\n“Ha! A likely story. I demand a rematch.”\n“Sit down, both of you!” Alfred snarled in his Batman voice which was still creeping all of the kids out. “Wonder Woman your training regime will include sword fighting practice, I am sure we can arrange a duel with young Damian another time. For now, we need to discuss the flagrant and reckless use of civilian names whilst in the field.”\n“Speaking of civilian names,” Superman cut in. “Maybe we should all switch to using them now? Since we’re all friends here.”\n“Indeed, Mister Kent.” Alfred agreed projecting the air of an annoyed school teacher, “Now, everyone turn to page 24 of the report.”\nA number of the League grumbled in protest but did as told, as Alfred moved on to his third lecture of the night.\n…\nBruce watched on, amused that his team was being berated by his butler and his children and mildly relieved that since Alfred was chairing the meeting he could just sit back and relax. Although he was still frustrated that they didn’t believe he was Batman.\nJ’onn kept up a running commentary of sarcastic quips, projected into his mind all the while, which went a long way to softening the blow.\n*I realise the team don’t posses my ability to shapeshift, but even accounting for that limitation their disguises during the party were truly horrendous.* he chuckled during the espionage portion of the lecture.\n*Your disguise still didn’t stop me recognising you.* Bruce pointed out.\n*Did you recognise me before or after you put your hand on my—*\n*Before. And we will never speak of it again*\nA rumble of laughter filled his head.\n…\nOutside the manor some seriously confused looking delivery guys from a half dozen pizza joints began to arrive all around the same time, each juggling towers of boxes.\n“You think they are having a party in there?” a kid in a Pizza Hut uniform asked another dressed in Dominoes red and blue. Both looked up at the big house. There weren’t many lights on, no music, no cars parked anywhere in sight, aside from their own.\nAnother car pulled up the drive with another stack of boxes, this one from a small local place.\nA blonde girl came out of the house to collect it, handing over the same $300 tip the other drivers had already received, then disappeared back inside.\n“Must be,” Dominoes replied. “They’d need a hundred people to eat all of those.”\n…\nBarry, finished off two thirds of the pizzas on his own.\nClark, Shiera, and Diana between them ate half of the last third. The rest were shared between everyone else.\n“Man, that was good,” the speedster declared, letting out a loud belch. “Thanks Wayne.”\n“Don’t mention it,” Bruce scoffed.\nOnce the lectures had finally ended, the team had stuck around to get to know the family.\nDespite his initial frustration Bruce was getting used to not being Batman, it was refreshing actually, like having a second chance at a first impression. He wasn’t too proud to admit he hadn’t been the friendliest person on the team since joining. Many of the League had learned to keep their distance from him, often walking on eggshells.\nMaybe he was a little paranoid after all?\nNow they were speaking to him as Bruce rather than Batman. It was nice.\n“Hey Brucie,” Hal called out “Batman says I’m not allowed to drive the Batmobile.”\n“Understandable.” Bruce replied, “What about it?”\n“Well,” the Lantern grinned, “I’m guessing you’ve got a few nice rides of your own. You rich guys aways do, right?”\n“I might,” Bruce shrugged, thinking of the Lambourgini and the Corvette in his garage.\n“So?”\n“So what?”\n“So, you gonna let me drive one?”\n“I might,” Bruce repeated with a smirk.\n…\nThings settled down as it grew later.\nBruce broke out the good scotch and lounged in his favourite chair watching Barbara play J’onn at chess with Dick waiting to play the winner.\nSomewhere several rooms away loud bangs could be heard every so often, interspersed with cursing. Duke was trying to teach Captain Marvel a trick where you light a lightbulb with your fingertips. Billy had exploded twenty lightbulbs so far and Barry kept running off to fetch more.\nAlfred, Damian, Shiera, and Diana had retreated back down to the cave to begin putting together a combat training regime, the later three all too impatient to wait and the former too conscientious to leave them without supervision.\nTim, Victor, Oliver, Stephanie, Cassandra, and Dinah were playing Mario Kart on the big screen in the cinema room. Tim and Victor were easily dominating the game but the others had united against them and were gaining ground.\nHal was cuddled up in front of the fire with the dogs and Alfred the cat who had emerged from whatever hiding place he had been holed up in all day.\nTo Bruce's bemusement Arthur and Jarro were arguing about politics, with the young starfish like creature expressing some strong views about current events and not backing down to the opinionated king.\nBruce gasped as a hand landed on his shoulder unexpectedly and a cheerful bark of laughter sounded behind him.\n“Well look at that. I scared Batman,” Clark grinned walking around and dropping into the seat opposite him.\n“Batman?” Bruce asked, playing innocent. “I think he’s downstairs.”\nClark shook his head and smiled. “The effects of the Kryptonite and red sunlamp finally wore off,” he said, “Now that my powers are back, and I’m not distracted by paranoia, I can see things little clearer. Alfred's a good actor but he’s not Batman.”\nWell, Bruce couldn’t exactly argue with that could he?\n“I’m glad you know,” he admitted.\n“I’m still mad at you,” Clark told him sternly.\n“I know.”\n“Like, so fucking mad!”\n“Yeah.”\n“You screwed with all of us.”\n“I did.”\n“You made me think I’d been captured by an evil villain.”\n“Yeah.”\n“You made me think you had betrayed me!”\n“Technically Alfred…”\n“Bruce!”\n“I’m sorry.”\n“You’d better be!”\nThe two stared at one another for a long while, Clark looking angry and Bruce contrite before both couldn’t keep it up any longer and burst out laughing.\n“I can’t believe you did all this,” Clark chuckled. “The mind games. The traps. Pretending to be Nightwing. You were such a troll.”\n“You made it so easy though,” Bruce teased.\n“And what’s with all the kids? Mr. I work alone.”\n“I never said I lived alone though, did I?”\nClark snorted. “Fair point.”\n“What do you think of Alfred?” Bruce wondered. Since most of the team still thought the older man was Batman.\n“Terrifying. I can see how you turned into…well…you.”\n“I’m not sure if that was a compliment or an insult.”\n“Both? Neither?” Clark shrugged. “What do you think his connection to Diana is?”\nBruce sat forward, eyes keen. “I have no idea but I am dying to know.”\n“Well,” Clark grinned, leaning forward as well. “I’m an investigative reporter you’re the world’s greatest detective. I think between the pair of us we could find something.”\nBruce lit up with excitement. “We should get Tim and Victor involved too. Between them they can hack anything.”\n“And J’onn, with his powers he might be able to sense something from one of them?”\n“Yes. And my son Jason is in London right now. Maybe he can track down something there?”\n“Mr Wayne,” Clark told him, pouring himself a glass and raising it to clink against Bruce's, “This sounds like the beginnings of a scheme.”\n“It’ll be nice to be back on the same side again.” Bruce agreed.\n“I was always on your side.” Clark pointed out. “You were the one who schemed against me.”\n“You started it.”\n“Did not.”\n“You were stalking my son. And acting weird.”\n“You were acting out of character. We were justifiably concerned. You were the one who took advantage of our concern and pretended to be a supervillain.”\n“I was pretty convincing, wasn’t I?”\n“Yes, locking me in a sensory deprivation room for hours was very convincing,” Clark’s face was stern but his small smile betrayed that all was forgiven.\n“You are going to guilt trip me about this forever, aren’t you?\n“You make it so easy.”\nWith that Clark tipped his glass back and emptied it before going for a refill.\nBruce grinned watching the kryptonian chug his $3000 whiskey like water, probably completely unaware of its cost.\nIt was shocking to think that just a few weeks ago he had been determinedly concealing his secret identity, unwilling to trust his team with that last part of himself despite knowing deep down that he could. Now thanks to a simple misunderstanding that whole team was in his house, laughing and interacting with him, Alfred, his children, his pets. Fitting into the other side of his life like it was inevitable they would.\nIt felt like a page had been turned. One that was long overdue.\nIt felt like family, friendship, and trust.\nIt felt like a beginning.\n…\n\nBonus\n\nThree days later Bruce began receiving notices that the team had amended their Fuck or Die contracts again. Nightwing was no longer excluded.\nBruce stared at the screen blankly for a few minutes then called Alfred. “You want to be Batman?” he decided already fleeing the cave. ”You can handle the paperwork.”"
}