{
    "id": "4061386",
    "url": "https://archiveofourown.org/works/4061386?view_full_work=true",
    "author": [
        "saltyfeathers"
    ],
    "title": "Professional Couple Only",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Supernatural"
    ],
    "relationships": [
        "Castiel/Dean Winchester"
    ],
    "characters": [
        "Dean Winchester",
        "Castiel",
        "Sam Winchester"
    ],
    "additional_tags": [
        "Fake/Pretend Relationship",
        "Case Fic",
        "Post-Series",
        "Post-Season/Series 10",
        "Fluff",
        "Bottom Dean",
        "Top Castiel",
        "only a lil bit of angst promise",
        "sassmaster cas"
    ],
    "language": "English",
    "series": "",
    "published": "2015-06-02",
    "completed": null,
    "words": "37,153",
    "chapters": "1/1",
    "comments": "765",
    "kudos": "16,038",
    "bookmarks": "3,627",
    "hits": "203,380",
    "summary": "<p>There's a haunted apartment building in Vermont, and the ad says \"Professional couple only\". Dean and Cas rise to the occasion.</p>",
    "notes": "<p>[sweats] ok so this was something i wrote while taking a break from writing dcbb, and it DEFINITELY wasn't supposed to end up being almost 40k but heyo lesson learned. </p>\n<p>anyway, this is post s10 minus all the stuff about \"\"\"The Darkness\"\"\" in the finale, since the majority of this was written before 10.23 aired. this is also post mark of cain and permanent fallen cas. if u like, feel free 2 fill in the blanks with ur own headcanons for how those two events shook out.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>[audience boos + throws tomatoes] yeah i know it's a cheesy ending thiS IS A FAKE BOYFRIENDS FIC OK the trope demands it what do u want from me //excuses</p>",
    "text": "“Professional couple only” the ad said, and normally, this is the point where Dean would shrug and call up some other hunters to do the job- he knows at least a few couples who hunt together. A haunted apartment building would be a walk in the park for them.\nBut when he explains this to Cas over burgers at a roadside diner somewhere in Iowa, Cas frowns slightly. “You two impersonate FBI agents all the time,” he says, glancing between Sam and Dean. “A ‘professional couple’ is probably much easier, and no doubt less illegal to impersonate.”\nSam raises his eyebrows in amusement across the table while Dean makes a pained face.\n“We’ve gotten mistaken as a couple enough to last us a lifetime, thanks,” Dean says dismissively around a mouthful of burger.\n“As if I would date that,” Sam says, nose wrinkling in distaste as he watches Dean chew. Ignoring Dean’s offended expression and hand on his heart, he drops his eyes back to his laptop screen.\nCas shrugs. “I’ll do it,” he says.\nDean and Sam both turn to stare at him.\n“Do what?” Dean asks, a sense of impending doom slowly settling in overhead.\n“Date you,” Cas says, looking right at him. “For the duration of the hunt,” he amends, as Dean feels his face heat.\nOn his side of the booth, Sam makes a noise that sounds like he’s desperately trying to cover up a laugh. Dean kicks him hard under the table, and Sam coughs loudly.\n“Sorry,” he says, obviously not sorry. Dean wants to deck him.\nDean turns back to look at Cas.\n“No,” he says firmly, as if that somehow settles it. He takes a sip of coffee, wondering if it’s possible to drown himself in his mug.\n“Why not?” Cas asks.\nDean puts down his mug and rubs a hand over his brow.\n“Because it’s weird?” He finally comes up with. His face is flaming, and judging by the grin on Sam’s own face, it’s completely obvious.\n“Dean, if you’re uncomfortable with same sex relations, I can assure you-” Cas starts, and Sam legitimately laughs out loud as Dean sighs heavily, holding out a hand to shut Cas up.\n“It’s definitely not about that,” he snaps, annoyed that he can’t actually come up with a reason why this is a terrible idea. \nCas is looking at him with solemn eyes.\n“People are dying, Dean,” he says. “We have no real idea what’s going on, and without my grace to aid us, this may be our only way to put a stop to it.”\nFor fuck’s sake, Dean thinks. Of course when Cas puts it like that he just feels like an asshole for saying no.  He catches Sam’s eye across the table, and Sam watches him carefully, no trace of his previous mirth there.\nDean sighs again, this time in defeat.\n“Fine,” he grouses, stomach squirming. He claps Cas on the shoulder. “Let’s go buy a haunted apartment in Vermont… honey.”\n***\nThey drive back to Kansas first, arriving at the bunker in the early morning. All Dean wants is to conk out for the next four hours, but instead, he shuffles into his bedroom and starts repacking his duffel with clean clothes. They called the landlord from the car, setting up an appointment two days from now. When she mentioned for them to email her their references, Dean almost hung up right then and there, but managed to smile through the inanity of it all. It’s easy enough to make sure all the “references” route back to Sam, and Sam promises to give him and Cas glowing reviews.\n“I promise,” Sam says, adopting a terrible accent and fluttering his eyelashes, “Those two boys were the nicest, gayest couple I’ve ever seen. They just loved to hold hands. That one taller fella was also big into PDA. There was nothing he liked more than laying a big wet one on his boyfriend for the whole world to-”\n“I’m going to murder you,” Dean says. “I’m literally going to shove you out of this moving car while we’re doing 70 on the freeway and I’m going to stop, back up over you, and then run you over again.”\nSam rubs tears of amusement out of his eyes.\n“Sorry,” he says, (again, not sounding so sorry), “It’s not every day I get to watch my overcompensating, macho brother squirm this much.”\nDean glances up at the rear view mirror, making sure Cas is still zonked out in the backseat.\n“I already said it wasn’t about that,” he says, suddenly not in the mood for joking anymore. This really is a terrible idea, but there’s no way he’d ever tell Cas the real reason why.\n“I know,” Sam says, serious again. “I figured you’d rather me rib you than actually try and talk to you about it, god forbid.”\n“Well, you’re only sort of right,” Dean says, reaching to snap on the radio. He keeps it low enough not to wake Cas, but definitely loud enough to deter conversation. “I’d rather not talk about it at all.”\n***\nSam, the lucky bastard, has the luxury of sleeping on their long ass haul to Vermont, passed out in the back seat with his duffel bag as his pillow. Cas sits in the passenger seat, notebook in hand.\n“I didn’t realize there’d be an interview,” he says, idly clicking his pen.\n“Yeah, well, it’s to stop people from doing exactly what we’re doing,” Dean says. “To make sure we’re really a-” he stumbles over the word for a moment, but forces himself to get his head in the game. “couple,” he finishes, swallowing. He may as well get used to it for the time being.\nAfter clearing his throat, Dean says, “It shouldn’t be too hard to tweak our backstory. We have known each other for a long time. We should probably just… leave out the part where you rescued me from hell.”\n“And the apocalypse,” Cas adds.\n“And the war in heaven,” Dean continues.\n“And the leviathans.”\n“Okay, okay,” Dean acquiesces, “Maybe it’ll take a lot of tweaking.”\nHe drums his fingers on the steering wheel as he underthinks. He’s settled on the simple principle of trying not to overthink this whole thing. He just wants to do the job and get it done. So what if he’s pretending to date Cas? They’ve been through tons of shit together, it can’t be that hard to fake an attraction towards the guy.\nHe glances at Cas out of the corner of his eye, struck by the way the sun highlights his profile.\nYeah, that’s a real fake attraction you got going there, buddy, Dean tells himself, gritting his teeth. The fakest.\nHe turns on the radio low, hoping it’ll distract him from the task at hand, but no dice. Deciding to bite the bullet, he gives in and says, “You really don’t find anything weird about this?” he gestures between the two of them. “About us doing this?”\nCas shrugs. “I guess I don’t have the same hang-ups as you do about this,” he says calmly, clicking his pen again. “It’s just another hunt.”\n“Right, yeah, I get that,” Dean says, even though he totally doesn’t. He decides to pick at the wound once more, “It’s just… do you really think we can pull this off? I don’t even know if I can be a good fake boyfriend to be honest.”\n“Well can I fake being in love with you?” Cas says wryly, as if he’s sharing some kind of inside joke with himself. “We’ll just have to do our best.”\nThat’s a fun context to put the L-word in. Dean needs a beer.  \n“For the hunt,” Dean says sardonically, as if he’s making a toast. “This damn ghost better be one for the ages.”\nCas taps his pen against the notebook.\n“To even get to the ghost we need that backstory,” he tells Dean. “So where would you like to start?”\n***\nThe Official (Totally Fake) Epic Love Story of Dean and Castiel started on September 18th, 2008 (not that their future landlord needs to know the exact date,  but what the fuck, Cas supplied it so they may as well write it down).\n“Ew, did you really just call our love story ‘epic’?” Dean asks, wrinkling his nose. “Don’t tell the landlord that during the interview.”\nCas underlines the word “epic” on the first page of his notebook, Dean assumes, just to annoy him.\n“Okay, so we got the time, what about the place?” Dean asks. “Where did we meet on September 18th, 2008?”\n“Hell,” Cas says promptly.\n“The fake story, Cas.”\nCas grumbles. “I don’t like changing our story,” he says. “It feels disingenuous.”\nDean rolls his eyes. “Making up a fake story isn’t going to change the real one, dumbass. We can’t just walk in there and start spouting hell-talk. It upsets the normal people.”\n“And of course,” Cas says neutrally, “Our real story isn’t a love story.”\n“… true,” Dean says after a moment’s hesitation. He’s looking at Cas, but as soon as Cas catches him looking, he suddenly becomes very interested in staring out the windshield. \n“Our story is one of friendship and faith and devotion,” he says, looking out the passenger side window. “And family,” he adds after a moment, almost shyly.\nAnd those are all very nice things, and things Dean treasures dearly, that’s true. But it also somehow seems inadequate to describe what he feels for Cas.\nDean nods along, knowing he could probably say something very after school special here, but catches himself at the last second.\n“Our story is also how you suck at vacuuming,” he says instead, “And how you always watch the history channel just so you can point out when they’re wrong.”\nCas snaps his gaze back to Dean’s and narrows his eyes in an ‘oh so THAT’S how you’re gonna play this’ look.\n“Interesting,” he muses, “Because I thought our story was about how you always steal the last piece of pizza without asking if anyone else wants it.”\nDean shrugs, unperturbed. “Sorry Cas, but as a former angel of the lord I figured you’d understand survival of the fittest.”\n“I wasn’t aware hoarding the last piece of pizza was considered ‘fit’.”\n“Maybe not, but it is awesome.” He raises his eyebrows at Cas. “You’re welcome to fight me on that, but I’d think twice about it.”\n“You just said it yourself, Dean, I’m a former angel of the lord. It’s you who should be thinking twice about fighting me.”\n“No worries, darlin’,” Dean drawls, “We’ll have plenty of time to settle just who should be thinking twice about fighting who in Vermont.”\n“I’ll hold you to that,” Cas says, “… dear.”\nDean’s been calling Cas pet names partly as a joke and partly to get in character for this whole charade, but hearing Cas offer him one in return is so bizarre that he laughs loud enough to wake Sam up in the backseat.\n“Wuzgoin’on?” he mumbles, face completely obscured by his hair.\n“Nothing,” Dean grins at him in the rear view mirror, “Mom and Dad are just exchanging playful banter.”\n***\nThey switch off driving in Springfield, Illinois, and Dean pretends- as he always does- to be grumpy when he hands the keys off to Cas, but really, he’s tired as fuck and the lines on the road were starting to waver so he reigns in the usual complaining. As they pass each other in front of the car, Cas briefly rests his hand on Dean’s shoulder in a simple, comforting gesture, and Dean swears it buzzes for the next twenty miles.\nThey continue to work on their backstory, but it’s proving to be more difficult than Dean thought. He suggests everything from meeting in a coffee shop to accidentally receiving each other’s mail, but no matter what he suggests, Cas shoots him down.\n“Maybe something symbolic,” Cas thinks out loud, arm resting casually on the steering wheel. “What place on earth would you liken to hell?”\n“This car ride,” Dean mumbles petulantly, before sighing and saying, “Fuck, Cas, I dunno. Who cares.”\nCas glances at him.\n“You’re very tired,” he observes.\n“Oh, am I?” Dean says sarcastically, “I’ve just been awake for the past 48 hours. I didn’t realize.”\n“Do you want to stop at a motel?” Cas asks. “Our appointment isn’t until Wednesday. We have time.”\nDean slumps down in his seat, waving a hand vaguely. “Yeah, sure. Whatever.”\nHe doesn’t mean to be so up and down on Cas, and he thinks he’ll be better after actually getting some sleep, but this whole endeavor is kind of wigging him out. He’s trying not to overthink it, and he’s trying to be cool about it, but it’s hard. Fake dating the person you probably-maybe want to be real dating is a pretty tricky situation.\nWhen they pass the nearest road sign, Cas squints at it before saying, “Ashland is 100 miles away. Is that okay?”\n“Sounds good, chief,” Dean says, closing his eyes and running a hand down his face. It’s quiet for a few minutes in the car, the only sound the engine rumbling under them. Dean imagines what it’s going to be like, house hunting with Cas. Potentially picking out drapes with Cas. What the fuck.\n“Dean,” Cas says quietly, “If you’re really this uncomfortable, I’m sure we could find another way.”\nDean doesn’t open his eyes.\n“It’s fine, Cas,” he says.\n“Are you su-”\n“Yes,” Dean says. “I’m sure. A little late for cold feet, don’t you think? We’re about to move in together.”\n“Shut up,” Cas says, though he offers a reconciliatory huff of laughter and Dean actually cracks a smile.\nThey lapse back into silence again until Dean has an idea.\n“Maybe we don’t have to change our story,” he says.\n“What?”\nDean sits up, grabbing the notepad and pen off the seat beside him.\n“Maybe we can turn it into a love story,” he says, and it’s only after he’s started writing that he realizes what he’s said. He thinks the tips of ears turn pink, but if Cas notices, he doesn’t say anything.\n***\nThe motel in Ashland is unsurprisingly underwhelming, and Sam is the only one grumbling about the “executive decision” made while he was conked out to stop for the night.\n“Yeah, well, the big boys were doing actual work while you were snoozing,” Dean says, “So you don’t get a vote.”\n“You guys were writing a self-insert love story,” Sam gripes as they make their way to their room. “I was the one who did all the research on this case in the first place.”\nDean turns around so he can roll his eyes at Cas, and Cas just raises an eyebrow in reply.\nNone of it means anything, because five minutes after they get in the room, Sam sprawls on the bed nearest the door, once again dead to the world. Dean scoffs, tempted to throw a pillow at his brother’s head.\n“Guess we’re sharing tonight,” he says as neutrally as possible. Then, he tacks on weakly, “It’ll be good practice, I guess. Sleep together before we…” he trails off. “Sleep together. Or. Pretend to.” he finishes lamely.\nEmbarrassed, he pulls off his shirt and grabs his toiletry bag out of his duffel.\n“I’m going to shower,” he announces, heading into the bathroom before Cas has a chance to respond. He closes the door behind him, turning the shower on before he brushes his teeth to give it a minute to warm up. In old motels like these, the warm water tends to take its time.\nHe stares at himself in the rapidly fogging mirror.\n“C’mon, Dean,” he says to his reflection. “It’s just a job.” A job that leaves dangerous ideas lingering in the margins. A job that dredges up feelings Dean thought he had under control. But all in all, just a job. He’s playing a part. Simple.\nHe steps into the shower once it’s warmed up, allowing the day’s travel to wash off him. He uses the cheap complimentary shampoo and soap, at first ignoring how his dick perks up in interest as he runs soapy hands over his chest, coaxing his nipples to harden beneath his ministrations. Naturally, his first thought is ordering himself not to think about Cas, which then leads to him thinking about Cas.\nBeing around Cas always seems to leave him on simmer at least, some kind of lowkey arousal that sits warm and content in his belly. It started a long time ago, before the apocalypse even, but he’s always done his best to ignore it. Not ignore it as in not jerk off to it because he’s done that more times than he can count, but ignore that every time he comes with Cas’ name on his lips, he’d much rather Cas was the one to hear it instead of the bare walls of a skeevy motel bathroom.\nAnd now, the bullshit domestic fantasies have started to wiggle their way in. It got bad enough once Cas fell permanently and came to live with them in the bunker, but this? Actually buying an apartment together, even if it’s only temporary? His knees are weak with it. He can’t believe it. He’s going to be playing house with Castiel, former angel of the fucking lord.\nEven thinking about it sends little sparks sputtering through him, and his soapy palm closes around his eager dick in response. He gives his dick a couple pulls, imagines him and Cas actually sharing a bed together. Not like in motels like these where when they share, there’s a very firmly drawn line down the center that neither of them are allowed to cross, but the kind of bed sharing where Dean can follow the body heat to his heart’s content, can slip an arm around Cas and kiss the back of his neck whenever he wants.        \nHe presses his free palm to the shower wall, swallowing every noise that threatens to burst out of him when he thinks of Cas’ hand in place of his own. As a kid who grew up in motel rooms and was thus stuck with dealing with his sexual awakening in said motel rooms shared with his brother and father, he’s long since learned the art of quietly jacking himself off. He’s certainly not perfect, has slipped up more than once and had it lead to an awkward conversation or two. There was even that time back when Cas was still an angel a couple years ago and he had said Cas’ name a little too loud while in the moment. Five minutes later, once all the evidence had been neatly discarded and Dean was in the middle of cracking open a beer, Cas had appeared in all his rumpledness, asking why Dean had called for him. His genius response at the time had been, “I didn’t,” with a guilty glance towards the garbage can where he had thrown the tissues he used to clean himself up.\nSince then, though, he’s been extra careful. With Cas’ mojo gone at least the danger of Cas popping up at random intervals has disappeared, but the guy has ears. And eyes. He’s pretty savvy, so Dean tries to be discrete.\nHe’s not after anything special tonight. This is more of a necessity than anything, because the last thing Dean needs when platonically sharing a bed with Cas is to wake up in the morning with a raging hard-on tenting the goddam covers. It’s almost perfunctory, the way he jacks himself, a simple flick of the wrist and a fondle of the balls. The orgasm is definitely not the most satisfying he’s ever had, but it takes the edge off, and that should hopefully get him through the night. He stands under the spray for another minute or so, making sure all the jizz has washed down the drain because the last thing he needs is for Cas to slip in the shower because Dean doesn’t know how to clean up after himself. He makes sure to leave Cas a couple minutes of hot water as well, cause he’s just such a swell guy. He towels off, wraps it around his waist, and gathers his clothes in a pile. He exits the bathroom, only to find Cas already asleep on the side of their bed closest to the wall, and Dean rolls his eyes fondly.\nAfter searching through his duffel for a moment he comes up with some cotton pajama pants and simple white t-shirt, and quickly slips them on, hanging his towel up on the rack behind the bathroom door. Not too long after they wrapped up the Mark of Cain business, Dean started actually sleeping in honest to god pajamas. After an adjustment period of feeling weird without his lower half being wrapped in denim at all times, he actually started to enjoy it. It helps him disassociate from the shit he sometimes has to do during the day, and he thinks that it’s even helped the nightmares ease off a bit.\nCas, on the other hand, has passed out in his clothes on top of the covers. Dean considers waking him up to tell him to at least change, but instead he just ends up sliding into bed, fighting momentarily with the covers Cas is sleeping on top of. He can just make out Cas’ outline in the dark of the room, and thinks about how he’s told himself over and over that this is enough. That he can live with just this and he’ll be happy.\nThen, apparently he pulls the covers too hard because he feels a hand swat at his face and an irritated, gravelly voice from beside him say, “stop stealing the covers, Dean.”\nDean sputters in indignation and hisses across the bed, “You’re the one on the covers you fuckin’ doofus!”\nThere’s an annoyed sigh, and Cas shimmies up toward his pillow, pulling at the covers until he manages to slide under them like a normal person, grumbling in quiet Enochian the whole time.\n“You better not be cursing me out in a language I can’t understand,” Dean warns from his side of the bed.\nCas’ response is, unsurprisingly, exasperated and in Enochian. He ends it with a prickly, “Shut up and go to sleep, Dean.” Which almost makes Dean laugh because as annoying as Cas can be when he’s unceremoniously woken up, his irritation is also often hilarious.\n“Our first night sleeping together and you’re already nagging me I can’t believe it,” Dean says, amused, keeping his voice low so he doesn’t wake Sam too. “Are you gonna banish me to the couch?”\n“No,” Cas says, and Dean can picture his eyes narrowing in the dark. “I’m just going to physically knock you out of this bed. You can sleep wherever you want after that.”\n“That doesn’t sound like something a loving boyfriend would say,” he tsks. It’s so much easier to lie here in the dark and joke about it. He tries not to worry about the actual sleeping arrangements they’re going to decide on once they get the apartment.\n“You’re right,” Cas says, “It’s something an annoyed boyfriend would say.”\n“I love you too, babe,” Dean says, and it’s supposed to be a glib joke but even he can hear the way his voice wavers.   \nCas is silent for a minute before saying a quiet, “Goodnight, Dean.” Thanks to the slight jostling of the bed, Dean knows that Cas rolls over almost immediately, putting his back to him.\nHe stares at the ceiling and tries to remind himself that he’s a professional, goddammit (or as professional as a hunter can ever get, at least). He’s used to playing a part. He’s good at playing a part.\nJust play the part, he tells himself.  \n***\nHe wakes up in the morning and the very first thing he notices is that he doesn’t have morning wood, which is great. He praises himself for his forethought in the shower last night.\nThe next thing he notices is that he’s lying in a wet spot. When he opens his eyes, he finds himself turned towards Cas, head on the inner corner of his pillow. Cas is turned away from him again, still seemingly asleep. In the bathroom, Dean can hear Sam brushing his teeth.\nHe sits up, rubbing at his eyes. It’s gross, but he assumes he just fucking drooled all over the place in the night. However, when he moves to rub any –ew- dried drool off his cheek, he’s surprised to find there isn’t any there which is… weird. And then he looks back down at his pillow and where he was lying on it- aka pretty damn close to the person he’s currently sharing a bed with- and he finds his suspicious gaze landing on Cas.\nOn a hunch (a hunter’s hunch, no less) he grabs the pillow that Cas is currently sleeping on and drags it out from under him. Cas makes a sound like an angry cat, but Dean ignores him as he examines the pillow, and sure enough, it won’t take a montage from a procedural drama to figure out that the drool on Cas’ pillow is the same as the drool on Dean’s.\nDean makes a sound that could probably be described as “deeply offended” and starts hammering Cas with his own pillow.\n“You drooled on my pillow you piece of shit!” Dean yells, punctuating each word with a smack of the pillow.\nSam chooses this moment to stick his head out of the bathroom to see what all the commotion is about, toothbrush in hand and toothpaste all over his mouth.\n“Hey,” he says, “what the fuck’s-”\nHe’s interrupted when Cas- who Dean honestly thought he’d just beat into submission with the pillow- sits up, steals his pillow, and wacks Dean hard enough with it that he literally careens off the mattress and into the space between the two beds.\nThere’s about three seconds of silence, and then Cas casually says from his perch on the bed, “I warned you.”\n“… Okay then,” Sam says curtly from the doorway, stepping back into the bathroom. He shuts the door behind him this time.\nOnce he actually catches his breath, Dean rolls over onto his back, once again stuck staring at the motel ceiling. Cas’ head pops over the side of the bed and he watches Dean carefully.\n“Sorry,” he says, “Sometimes I forget I’m still a little bit too strong for you.” He offers a hand down to help Dean up, but Dean doesn’t miss the shadow of a smirk on his face. His hair looks like he just stuck his finger in a wall socket, and Dean wants to run his fingers through it.\n“Fuck you,” Dean bites, but he takes the hand anyway, using it to pull himself up. He certainly won’t forget the first time he watched Cas as a human take Sam down in about three seconds in an arm wrestling match. It was absolutely hilarious until Cas managed to beat Dean even faster. They’re not sure if Jimmy was a closet superman or if whatever residual grace is leftover in Cas helps him out, but either way, it’s gotten them out of some sticky situations in the past (and is also great for vacuuming under heavy furniture).\nDean’s thought about alternative uses for that strength before, but has kept it confined mostly to showers and when he’s alone behind a locked door.\nHe trundles over to his duffel, dusting himself off with as much dignity as he can muster, grabbing a clean shirt and his jeans from yesterday.\n“I’m going to get breakfast,” he says over his shoulder, “You comin’?” He turns around when Cas doesn’t answer, only to find him asleep again on what looks like Dean’s pillow. He chuckles while simultaneously trying to ignore the fondness blossoming in his chest.\n“I’ll come,” Sam says as he walks out of the bathroom, “As long you’re done with pillow fights for the time being.”\n“You keep that tone up little bro and I’ll sic Cas on you.” They both turn to where Cas is still snoozing, looking way too unassuming. “He’s lethal with a pillow.”\n“I’ll keep that in mind,” Sam snorts as he heads out the door.\nDean grabs the Impala’s keys off the desk and is just about to follow suit when Cas calls out from behind him, “Coffee, please. A lot.”\n“I know your order,” Dean says, “Be back soon.”\n***\nAs they’re waiting for coffee and breakfast sandwiches at a local café, Sam keeps sending furtive looks Dean’s way, and Dean’s been steadfastly ignoring them for the better part of twenty minutes. Between the drive here and the actual waiting time, he feels like he deserves some kind of award for once again refraining from kicking Sam out of his car.\nFinally, when Sam starts adding smugness to the looks, Dean snaps.\n“What, Sam?” He snaps. “Take a fucking picture, Jesus.”\nSam shrugs high enough that he practically touches his ears, and it’s literally the most obvious tell in the world. Dean rolls his eyes.\n“Nothing,” Sam says. “Nothing at all.”\n“You can walk back to the motel,” Dean threatens. \nSam runs a hand through his hair, obviously deciding on whether to actually say anything or not. Eventually, he cracks.\n“I’ve just been… thinking,” he says.\n“Thinking,” Dean echoes.\n“Yeah, thinking.”\nThey stare at each other in silence until Dean says, very slowly, “Thinking what, Sam?”\nSam keeps a very straight face as he says, “Well, y’know. I just thought it was weird that when we took this case we didn’t bother considering all the options.”\nDean exhales, trying to stay relaxed enough not to alarm the other early morning customers.\n“All the options,” Dean repeats.\nSam shrugs again. “Yeah,” he says simply.\nDean shakes his head. “Sorry, Sam, if you’ve finally decided you fake wanna get with this-” he gestures to himself, “that ship has sailed.”\nSam makes a face. “Ew. No.” He shakes himself, as if trying to get rid of an ugly mental picture. “No, what I was saying was…” and that tone starts revealing itself again, the one Sam adopts when he’s about to be a little shit that Dean hates. “If you don’t want to fake date Cas, then, whatever. I could always step in. I’d have no problem fake dating Cas.”\nRecord scratch.\nDean jerks so hard at that suggestion that he sends the salt shaker on their table flying halfway across the restaurant before he manages to get himself under control. He gapes at Sam for a full ten seconds before going to retrieve the (thankfully unopened) shaker, fully aware that there’s more than one pair of eyes on the guy who just hulked out at like 7 in the morning in a local coffee shop. He slides back into his seat, making sure to put the shaker on the far side of the table. He coughs awkwardly.\n“Um. Yeah.” he stammers. “Well, whatever. It’s fine. Cas and I- Cas and I have already worked out… some stuff. Y’know. Our story and everything. So it wouldn’t even… make sense really… In fact I think… I think we’ve got it covered, frankly, so… Yeah.” He clears his throat.\nSam stares at him in disbelief.\n“Wow,” he says, nodding. “Just wow.”\nSomeone behind the counter calls their order number, and Dean practically jumps at the chance to go get it. As he’s getting up his foot catches on the corner of their booth and he almost face plants in the middle of the aisle, but manages to catch himself at the last second. He moves his ass away as fast as possible, Sam’s muttered, “Jesus Christ, Dean,” following him all the way up to the counter. He’s flustered enough that when the girl tells him to enjoy his sandwich he replies with “You too”.\nHe lets Sam drive back to the motel only so he can glare at him the whole time without worrying about crashing into a lamppost.\n***\nBy the time they get on the road again, Dean’s calmed himself down to maybe 150% power, and the speed and gusto with which he’s inhaling coffee probably isn’t helping much. Sam keeps looking at him weird from the passenger seat, and Cas stares out the back window pensively, like he’s in some kind of sad music video or something.\nBoyfriend, Dean thinks, because he’s trying to get used to the idea. Cas is my boyfriend. My fake boyfriend. But of course he won’t introduce Cas as his “fake boyfriend”. As far as their soon-to-be landlord is concerned, Cas and Dean are boyfriends. Real, bona fide, probably-have-sex-at-least-twice-a-week-and-bicker-over-stupid-shit boyfriends. Even the idea of someone looking at the two of them and thinking that is… Dean glances at Cas in the rear view mirror.\nOverwhelming, is the word he’s looking for.\n“I can hear you overthinking from here,” Sam mutters. “You need to chill, Dean. It’s just a fucking job.”\nDean scoffs. “You’re the one who’s been giving me shit about this job since we decided it was a good idea.”\n“None of our ideas are ever good,” Sam says, which, well, true. He glances in the rear view mirror to make sure Cas’ attention is still elsewhere and then says, “Hey, think of it as a trial run. Y’know, thirty day money back guarantee?”\nDean feels his eyes widen and his pulse spike.\n“W-what?” he stammers. “I don’t even know what you’re talking  abou- y’know what, Sam? Fuck you.”\nSam puts his hands up in surrender. “It was just a suggestion,” he says.\n“What’s just a suggestion?” Cas asks from the backseat, and Dean’s brain stops working for a second, before restarting with a cough and the sound of a bolt falling out of place somewhere.\n“How long it would take you to butt into our conversation,” Dean retorts.\nSam rolls his eyes. “Just figuring out the fastest way to get to Vermont,” he tells Cas, throwing a bitchy look Dean’s way.\n“We agreed taking I-90 was the fastest, didn’t we?” Cas asks, somewhat confused. It still throws Dean, sometimes, how familiar Cas has become with the roads crossing America.\n“It is, and we did,” Sam says pointedly. “Dean’s just being his usual difficult self and trying to take the long way round.” \n“For fuck’s sake, Sam,” he grumbles. Before Cas can start chirping at him about I-90, he holds up a hand. “I got it, Cas,” he says. “I-90 it is.” He glares daggers at Sam, who ignores him. Dean glances at the clock on the dashboard and grits his teeth.\n“Amazing,” he says, “Only another eight hours to go.”\n***\nFinally, they make it to Highbury, Vermont. Population just over 2000. Quaint. Homey. And apparently pretty damn haunted.  They grab dinner at a local Italian joint, settling themselves into a booth as far as possible away from the dinner rush.\nDean’s about to slide in next to Sam, mostly because he’s still wigged from the car ride and has apparently regressed back to a sixth grade mentality, but Sam raises an eyebrow high enough that he relents, taking his usual seat next to Cas and trying not to be a grumpy asshole about it (usually that’s Cas’ shtick, though Dean’s hardly a stranger to being both grumpy and an asshole). \n“Now that we’re in town, you can pretty much consider this the beginning of your cover,” Sam says. He waves a sloppy hand between Dean and Cas. “I now pronounce you boyfriends, or whatever.”\n“Wow, that was real heartfelt, Sam. Remind me not to ask you to make a toast at the wedding.”\n“I don’t think this charade will have to go as far as marriage,” Cas says solemnly, though there’s a lilting undercurrent in his tone that’s become a tell for Cas’ sarcasm in the past few years.\n“Not ready for an old ball and chain, huh?” Dean asks, boffing Cas on the shoulder and trying to keep it casual. “Smart.”\nCas shakes his head. “I don’t understand that idiom,” he muses. “My understanding of marriage is that you’re supposed to love the person you’re betrothed to. Referring to your significant other as a ‘ball and chain’ seems unreasonably harsh.”\nDean snorts. “Well if it makes you feel any better my only ball and chain here is sitting right across from us, and we’re probably not getting married any time soon.”\nSam looks like he’s about to kick him under the table, but Dean’s shins are saved by the arrival of their waitress. She’s a young woman, cheery and college aged. After she greets them and takes their orders, she pauses for a moment before saying, “I have to say, I haven’t seen you folks around here before. Just passing through? Or sticking around a while?”\nIt’s a simple question. One Dean’s answered in many a roadside diner to many a charming waitress. But with their current… situation, he finds himself struck mute, mouth half falling open in what probably isn’t his best look ever.\nInstead, it’s Cas who takes the reigns. “Renting an apartment, actually,” he smiles at her like he doesn’t have a trouble in the world. “It’s a lovely place to settle.”\n“Oh, awesome!” The waitress says. “Welcome to town, guys. I’ll have your order out in a jiffy.”\nAnd that’s it. Frogs didn’t rain from the sky. Volcanos didn’t erupt. Cas didn’t even bother specifying who was doing the renting. Christ, Dean’s heart is beating.\nSmirking slightly at the whole scene, Sam stands up.\n“Gotta hit the head,” he says. “Be right back.”\nAs soon as he lumbers off, Cas turns his gaze on Dean.\n“You’re still having trouble with this,” he states. “You and I.”\nDean opens his mouth to disagree, but cuts out halfway through because there is really no way to play off the failure of his vocal cords just now. “Yeah,” he admits. “I guess I am.”\nCas nods, and Dean swears a flash of hurt crosses his face, but it’s too quick for him to be sure. “I can do the talking from now on,” Cas says, “If you think it’ll help.”\nDean waves him off.\n“It’s fine,” he says. “We’ll both just… do a normal amount of talking. Like normal people. Who just happen to be… dating.”\nCas stares at him reproachfully.\n“Speaking of, you’re allowed to talk to me, Dean,” Cas says. “If you’re nervous or if you’re getting cold feet, it doesn’t matter. You can tell me.”\n“Yeah, well, we all know me,” Dean says weakly, “I’m just a chatty Cathy.”\nCas sighs, scrubbing a hand over his jaw. It’s a habit he picked up from Dean. “Since I fell permanently, I’ve tried my best to be forthcoming,” he says. “Years of watching you and Sam lie to each other coupled with my own various deceptions,” he grimaces. “It was enough to make me want to at least try to be more honest in all aspects of my life.”\n“I know, Cas,” Dean says, because he really does. Everything from “that shirt is very ugly, Sam” to something as terrifying as “I’m not sure I’ll ever be able to explain how much you mean to me, Dean”. Cas has spent the last couple years really not pulling any punches, and for the most part, Dean’s been grateful for the bluntness. Not to mention that he also finds it endearing, and he’s liable to fall in love at least a little bit when someone else insults Sam’s shirts as often as he does.\n“No, you don’t,” Cas says. “Because there’s something I’ve failed to mention for a very long time.”\nDean swallows hard, and he can hear the blood pounding in his ears.\n“Uh, Cas,” he says, gesturing around at the restaurant, “are you sure this is the place to um,” he clears his suddenly very dry throat, “the place to… get shit off your chest?” he finishes lamely.\n“What I have to say won’t change no matter the setting we’re in,” Cas says determinedly, and Dean’s heart thuds dully against his rib cage.\nHe thinks about getting rid of the Mark of Cain, and Cas’ subsequent fall. He thinks about how Cas held him through the former, and how he did his absolute best to hold Cas through the latter. For probably too long, they traded off sitting at each other’s bedsides, more stubborn than either of them had any right to be. Things were intense for a while, and Dean remembers thinking at the time that maybe it was all going to culminate in… something. But then he got better and Cas got better, and they had backed off the precipice, no longer held together by the end of the world or the promise of the end of one of their lives. They just became Cas and Dean, and learning how to relate to each other as simply people instead of soldiers or hunters or angels or righteous men turned out to be a lot harder (and easier) than Dean expected.\nFor example, Cas left his dirty socks everywhere. Hardly a crime by any standard, but it sure as hell annoyed Dean.\nBut, more importantly, before Cas decided to go all out with his always honest shtick, he spent a long time telling nobody anything, and would lock himself in his room for days. That particular rough patch lead to Dean saying some things he still regrets to this day, and culminated in Cas slamming the door of the bunker behind him as he disappeared for two weeks without so much as a phone call.\nDean either remembers moments from those weeks crystal clearly or not at all. He remembers the anger that surged through him for those first two days, anger he swore to himself was just leftover remnants of the Mark of Cain, even though even then he knew it was nothing more than an excuse. The anger faded into sick fear fast enough, and he spent the remaining days before Cas returned mourning something he had never had, trying to sort out the relentless waves of emotion that crashed through him without end. The only half-clear memory he has of that time is getting stupidly drunk one night and unloading some kind of epic, slurred speech to Sam that he’s sure would only embarrass himself if he remembered it in its entirety. It’s probably because of that speech (not that Dean’s asked or Sam has mentioned) that Sam’s been so incredibly annoying about him and Cas for the past months.\nThe only reason Dean never chased after Cas after that initial blowout was because Sam begged him to just back off for a while. He gave Dean the whole speech about Cas being in charge of himself, and probably even dropped everyone’s favorite buzzword, free will, into the mix a couple times. To this day, Dean’s still not sure if not going after Cas was the right decision. Despite the conflict between them long being resolved, Dean still finds himself some nights staring up at his bedroom ceiling and wondering.\nIt would have made sense, maybe, when Cas finally came home at the end of two of the longest weeks of Dean’s life, that something would finally happen.  Dean remembers the way his pulse jumped- much like it currently has as they sit in a restaurant in Highbury, Vermont- as the door opened and he spotted the familiar shape of Cas at the top of the bunker’s stairs, looking windblown and unkempt but alive and here, which were pretty high on Dean’s priority list.\nThey made eye contact, Cas from his perch by the door and Dean down below in the library. Neither of them said a thing. Dean watched like a hawk as Cas made his way down the stairs, the trench coat he left wearing nowhere in sight.\nHe came to a stop in front of Dean, leaving a socially acceptable amount of space between them. His tentative smile was exhausted but genuine when he said, “Hello, Dean,” and Dean made a noise that could probably be described as a whimper and dragged Cas into his arms, reminding him of a certain riverbank in Purgatory.\nIf there was ever a time for a something to happen, that was probably it. And it almost did, too. Dean had his arms around Cas and Cas was hugging him just as tightly back, and he could feel Cas’ scruff rasping against his neck and ear and Cas’ hair was tickling his nose. His hands trailed lower, coming to rest in the much more intimate space of Cas’ lower back, and he briefly pressed his lips to Cas’ shoulder, mouth burning through the plaid.\n“I’m sorry,” Dean mumbled into his shoulder. “Cas, I’m so-”\nCas shushed him, and Dean shuddered as Cas started trailing fingers through Dean’s hair.\n“I’m sorry too,” Cas murmured. “I shouldn’t have pulled away like that.”\nDean straightened up at that, pulling back to look Cas in the eye though his hands merely moved to Cas’ hips.\n“Hey, no,” he said. “I wasn’t fair, Cas. I was impatient and I didn’t want to wait and I got angry. I was afraid…” he swallowed. “I was afraid you were regretting your decision.”\nCas cocked his head.\n“To become human?” he clarified. At Dean’s nod, he continued, “Dean, this isn’t my first time falling. I knew what I was signing up for, and it was my choice.”\n“I know but-”\nCas shushed him again, this time pressing the pad of his thumb to Dean’s lip. “I should have communicated my distress better, and perhaps you weren’t as patient as you could have been,” he allowed. After a moment, he added, “I’m sorry for walking out on you. If it had been the other way around, I would have hated it.”\nDean let out a breath he didn’t realize he’d been holding, and found himself falling forward into Cas, bumping their foreheads together. For a moment, he just breathed in the space between them, listening to Cas’ steady rhythm.\nThe sound of the front door opening jarred them both to action, Dean taking a good three steps away, feeling like he’d just been electrocuted, while Cas’ head whipped around to greet—Sam, as it turned out, who was just back from town.\nThe somewhat less emotionally charged, but no less happy reunion that took place between Sam and Cas was enough to effectively kill the moment, but ever since then, Dean’s wondered when and if they’d ever get that something after all.  \nAnd now of all places, Dean wonders if it’s gonna fucking happen in the middle of a fake Italian restaurant while he’s fake pretending to be Cas’ boyfriend.\n“Dean, I-” Cas says—\nAnd then Sam slides back into the booth, and Dean has no idea if he wants to kill or kiss his cockblocking baby brother. Sam must have taken a goddam class on significantly timed entrances or something.\n“No drinks yet?” Sam asks.\nOut of the corner of his eye, Dean watches Cas’ jaw clench.\n“No, Sam,” Cas says stiffly. “The waitress has not brought our drinks yet.”\nDean’s feeling more than a little lightheaded at the moment, so his snort of laughter very quickly snowballs into full blown, tear-wiping laughter. People at nearby tables turn to look at him, but Dean doesn’t care. He laughs his jitters out, laughs his nerves out, literally laughs until he’s gasping for breath and Sam and Cas are staring at him with equal parts concern and annoyance.\nOnce he finally gets himself under control, Dean wipes one more tear out of his eye.\n“No drinks yet, Sammy,” he says, chuckling.\n***\nOnce they get their food, things return to relative normality. Dean drinks beer and Cas carefully examines his garlic bread before taking a bite. The days of everything tasting like molecules are long over for Cas, but he can still be a picky bastard when he wants to be.\nSam’s more focused on his laptop and notes than his (ew) vegetable lasagne because Dean decided to swallow his pride and ask Sam to go over the case again, since (and not that he mentioned this part) he’s been kind of occupied the last couple days with the practical (fake boyfriends) side of their plan instead of the research part. Sam had rolled his eyes but bless his heart had also pulled out his laptop as he was doing so.   \n“So this building-the Painter building- you’re going to be renting in was built in the early 1900s,” he explains. “Very. Um. Rustic, from what I can tell. There’s been a renovation or two to add things like air conditioning and electricity over the years, but for the most part, the building remains unchanged.”   \n“Which means there could be about a million things littered around that place that could belong to our ghost,” Dean finishes, taking another pull of beer.\n“I only assume it’s a ghost,” Sam says. “Can’t be sure yet. There’s no evidence of ectoplasm and the place wasn’t built on any kind of burial ground that I can find.”\n“Well I mean, what are our other options?” Dean asks.\n“Pretty much whatever you can think of, though I do agree that it’s probably a ghost,” Cas says unhelpfully as he finally takes a bite of the garlic bread. He grimaces for a moment as if expecting to hate it, but he’s obviously pleasantly surprised at the taste and seems to genuinely enjoy it.\nSomething shifts in Dean and he jokes, “That better not be better than my garlic bread.”\nCas’ gaze flits to him as he swallows. “Of course not,” he says, and Dean suddenly feels too warm.\n“Yeah, well… good,” he says lamely, grabbing his beer for another sip as an excuse to take his eyes off Cas. He’s had a lot more time in the past months to work in the kitchen, honing his cooking skills to something actually halfway decent. Growing up cooking for Sam all the time had given him the creativity he needed, and his year at Lisa’s had filled in whatever he blanks he hadn’t already filled, and the bunker and lack of world ending catastrophe finally gave him the means. Ever since they found the bunker, really, the domesticity has been leaking into Dean, slowly but surely. Cooking for Sam as a kid had been about making sure his little brother didn’t starve, but cooking for Sam (and Cas, and whoever else decides to stop by) as an adult is more than a necessity. It’s something Dean genuinely wants to do. Maybe the reason he always romanticized family dinners was because he never got to have one (if he did, he certainly can’t remember), but either way, nothing quite beats that feeling of sitting down to a supper and providing for his family. Not much warms him more than seeing Cas or Sam truly enjoy something he made.\nSam is looking at the two of them with learned patience, like a teacher waiting for their class to finally get with the program and shut the hell up. When they both turn back to look at him, Sam continues like there was no interruption.\n“So I’ll scout the town out tomorrow while you two are signing the papers, ask some questions,” he says. He leans forward, dropping his voice just a little. “All the other falsified papers are good to go, so make sure you bring those with you to the appointment.”\n“Yes sir,” Dean says.\nSam rolls his eyes and glances at Cas.\n“Cas, make sure you bring them with you to the appointment,” he amends. At Cas’ nod, he continues again at a normal volume. “The bottom floor of the building used to be a general store, but they converted it in the 30s. The murders that have taken place in the building have been scattered, to say the least. No real pattern that I can find.” He glances at his notepad. “Some men died during the initial building. Then, murders in 1910, 1915, 1917, 1927, 1931, etc. Just random years and different methods of murder. Some were drowned, some had heart attacks, electrocution, stabbings, slit wrists, falling out windows, all kinds of different ways.”\n“Some of those sound like accidents, y’know,” Dean says. “Sometimes people just die.”\n“In a small apartment building in a town like this?” Sam asks. “Not that many people. Besides, there have been a few occasions of people having literal, gaping holes in their chests. That’s definitely no accident.”\n“Hearts missing?” Dean asks.\nSam shakes his head.\nDean taps a finger on the table in contemplation.\n“Okay so we got a lot of bad ju ju,” he concludes. “We don’t know much else, but we know that.” He looks at Cas. “You ready to fight some ghoulies?”\nCas nods solemnly with a mouth full of garlic bread.\n***\nThey spend the night in a motel on the edge of town that Sam’s going to be staying in while he plays FBI for the duration. Dean spends a second night in a row curled up in a bed next to Cas that’s simultaneously too big and too small. They manage to avoid any more pillow mishaps, but at some point during the night, Dean does wake up to find Cas’ fingertips just barely brushing against his arm. He doesn’t bother rolling away, but by the morning they’re long gone.\nSince “Professional” was firmly stated in the ad, Dean and Cas do their best to dress for the part. Dean finds himself in a forest green sweater and dark blue jeans, while Cas steps out of the bathroom in a sleek navy button down with the sleeves rolled up to the elbows and black jeans that fit really… really well. Dean tries not to stare, but one glance is more than enough to get his dick interested.\n“Look at you,” Dean says, practically feeling his pupils dilate. “You clean up nice.”\n“Yes,” Cas says vaguely, plucking at his stylishly untucked shirt. “The man at the department store said it was very ‘on-trend’.”\nDean snorts, dropping his eyes for a moment as he stares at Cas’ casual brown oxfords. “Yeah,” he says, swallowing, “Naturally.”\nSam barges in then with a tray of coffee held in his hand. When he spots Dean and Cas in their new get ups, he grins. “Looking good,” he says, deeply amused. “That’s definitely how professionals dress on their days off.”\n“Oh, shut up,” Dean says, grabbing both his and Cas’ coffees. He hands it back to Cas, and as Cas takes the coffee, their fingers momentarily brush and Dean’s left thinking about how Cas’ fingers felt against his arm in the middle of the night.\nSam rifles through his bag, digging out the papers they need. “Okay,” he says, handing them off to Cas, “Everything has already been finalized over the phone. You two just need to show up and sign on the dotted line. And, obviously,” he hands Dean and Cas two new ID’s. “Your new names.”\nDean is now Leo Stark, and Cas of all people is Steve Winchester.\nDean definitely (definitely) doesn’t mind lending Cas his last name, but he was actually more concerned with Cas’ first choice, since Steve was what he went by when he became human after the angels fell and, frankly, didn’t have a great time. And it was almost entirely Dean’s fault.\nAs they drive back into town, Dean itches absently at his forearm where the Mark of Cain used to be, only because it’s become something of a habit. \n“Hey,” he says, “Are you sure about the Steve thing?”\nCas looks at him balefully.  “We’ve already been over this, Dean, and it’s far too late to change it now.”\n“I know, but…” Dean trails off. This is more about his own stubborn guilt than anything. “You just had such a rough go with that name, I figured you’d choose something… I dunno. A joke. A musician. Or something that’s important.”\n“What, you mean like a man who flies around in a mechanically improbable suit that’s not even made of iron?”\n“Okay, first of all, Tony Stark is awesome. Second, shut up.”\nCas looks down at his lap for a moment before turning to look at Dean again.\n“I chose this first name because it’s practical and I was once used to responding to it. I chose it for convenience.” His expression softens. “It was the surname I chose that holds meaning for me.”\nDean’s stomach flips, but in a good way. That fluttery sensation in his fingertips is probably just caffeine, though. Maybe.\n“I’ve told you before we can get your name changed,” Dean says, trying to keep his tone from dripping too much sentimentality all over Cas. “I mean, probably not legally. But close enough that as far as anyone will ever know, you’re a Winchester.”\n“Thank you,” Cas says. “As it always has, the gesture means a lot.”\nDean claps him on the shoulder. “My name is your name, Cas.”\n***\nHighbury is pretty homey, as far as homey goes. Quaint main street with red bricked, squat buildings that sport cheerful, handmade signs. Trees that are probably very pretty whenever it’s not the dead of November line the center of the road dividers, and the small downtown area is full of twinkle lights and colorful banners welcoming you to downtown Highbury.\nTheir building is next to an old stone bridge leading out of town, under which flows a happily burbling creek. It’s similar to the rest of the older buildings in town, and absolute prime location. Dean whistles lowly as he pulls into the sparsely populated tenant parking lot out front (all arranged in attractive, tourist-town diagonal lines along the front of the building), leaning forward to glance out the windshield at the place.\n“This is so…” he says, and then stops because he can’t quite think of the right word.\n“Picturesque?” Cas supplies.\n“I was gonna say it feels like the inside of a snowglobe, but I guess that’ll do, too.”\n“Well then let’s shake things up,” Cas says, grinning, and Dean groans because he walked right into that one. \nTheir landlord is a cheerful, nosy blond woman named Helen who almost aggressively forces onto them a plate of lemon squares before they’ve even stepped over the threshold.\n“Steve and Leo, right?” she bubbles, already bustling around to take their coats and hang them up in the nearby closet.\n“That’s us,” Dean says, trying to keep it casual. His palms are sweating.\n“Nice to meet you,” Cas smiles. “Highbury is a lovely town.”\n“Isn’t it?” Helen gushes, “I’m just so happy to finally fill this apartment,” she chatters, ushering them over to the kitchen counter where there’s a single paper waiting with a pen lying next to it. Dean’s brain tries to categorize it as ominous, but he tells it to shut up. They still have to have this “meeting” or whatever to prove that they’re suitable candidates, even though Sam told them it was more of a formality than anything.\nThe apartment building itself is squat and red bricked and blatantly old. As Sam said, it’s definitely rustic. Based on the size of the place, Dean imagines there are maybe fifteen apartments at most, and that’s being generous. The inside is all scuffed wood floors and peeling paint, the furniture not dusty, per say, but dated (hell, the fact that the place came furnished at all was a win for them). The kitchen and living room share the same space, and Dean assumes the hallway off to the left is where the bedroom and bathroom are. He doesn’t know a lot about apartments or the housing market, but he’s pretty sure that under non-haunted circumstances, this thing could fetch a pretty penny.\n“The last person who lived here died, didn’t they?” Dean asks, starting slow. When Helen’s smile slips off her face, he adds quickly, “We’re not gonna back out or whatever. Just curious.”\nThat doesn’t seem to appease her much, but Dean assumes she must have some kind of landlord-y obligation to answer their question because she sighs and says, “Yes, that’s true. It was very unfortunate.”\n“It happened, what, six months ago?” Dean asks. “So you’ve been trying to unload this apartment since then?”\nHelen nods. “But I assure you, anything that, um. Needed to be replaced was replaced.”\nCas, who’s off examining the living room, meets Dean’s eye knowingly. The last death in here, as far as they could tell from the vague newspaper headlines, was pretty messy. The tenant himself was an apparently non-descript guy, something inoffensive like a desk clerk at a car rental place or something. Hardly a dude with a lot of enemies or a lot of secrets that would put him at risk for a death so gruesome.\n“This building’s had some pretty bad luck over the years, huh?” Dean asks. “Lots of… accidents.”\n“I suppose,” Helen says, her smile much less genuine than before. She bustles forward into the living room, taking a seat in the arm chair. “If you don’t mind,” she addresses both Dean and Cas, “We should probably get started.”\nDean relents for now, heading into the living room to join Cas on the couch. He’s about to sit on the opposite end, then realizes that’s probably weird to sit so far away from a significant other? He thinks? He ends up doing a weird little shuffle thing while Cas and Helen stare at him strangely, then overshoots by parking himself probably too close to Cas, but there’s no way he’s moving now.\nHelen tries to plaster a smile back on, and Dean feels kind of like a dick for grilling her within the first five minutes of meeting her. “So,” she says, glancing between the two of them, “Tell me a little bit about yourselves.”\nDean and Cas exchange a look, and Dean clears his throat. Time to pony up.\n\"We, uh, met almost eight years ago,\" he says. \"C- Steve pulled me out of a, um... tight spot. We worked together for a while, er, some diplomatic work. International, I guess you could say.\" Interdimentional, but whatever. Close enough. \"Then we... stopped working together for a while, and... started... again?\"\nYeah, okay, he's going down in flames here. He thought he could do this, but maybe he overestimated himself. He glances at Cas for help, and Cas nods slightly.\n\"You know what?\" Dean smiles at Helen, feeling the corners of his mouth trembling slightly as they struggle to hold the expression in place. \"I'm terrible at telling stories. Steve can tell it way better than I can.\" He's about to pat Cas on the shoulder and then halfway through the gesture thinks, oh god that would be a weird thing for couples to do, wouldn't it? Slapping arms is a buddy thing, like we're fucking buddies who do buddy stuff shit shit shit and amidst his own internal existential crisis, some wires obviously get crossed because instead of thumping Cas on the shoulder he's reaching for his hand instead.\nWhen Dean's hand brushes Cas' palm he immediately allows Dean to lace their fingers together, almost as if the gesture is automatic. Cas does squeeze his hand, Dean assumes, to ask what the fuck he's doing, or maybe, why is your hand so sweaty, but Dean just keeps that stupid fucking smile plastered on his face and says, \"go on, then.\"\nHelen, for what it's worth, indulges them despite the fact they probably look like teenagers fumbling for their first above-clothes grope. She must be really relieved to have moved on from the haunted apartment spiel.\n“What Leo is trying to say,” Cas swoops in smoothly (Dean can hear the additional wryness in his voice even if no one else ever could), “is that we’ve been through a lot and we’re ready to settle down.”\nWell, that certainly condenses the story. Dean’s glad he spent so much fucking time sweating over it.\nHelen nods, her smile returning to a more genuine curve.\n“That’s so nice to hear that someone made it,” she says, and Cas squeezes Dean’s hand again.\n“With both of us working from home and living in a small town like this, it’ll be a welcome change of pace,” Cas says, his own voice turning content, reverent even, not a trace or sarcasm in sight, “We used to be on the road a lot.”\nGod, they’d talked this out (minus a few small embellishments on Cas’ part) but Dean didn’t quite realize just how weird this would be, listening to Cas talk about them settling down together. Well, Steve and Leo settling down together, but either way, it throws him. He knew it would be weird to some degree, but he definitely underestimated the strange, stunned pleasure that curls in him at the thought. Back when Cas was still an angel he never ever dared to even think Cas and domesticity in the same sentence, but Cas has taken to humanity with aplomb give or take an existential crisis or two. Dean loves watching Cas be so present, loves watching him garden and read and even bitch endlessly about whatever historical inaccuracies have been ingrained into pop culture’s collective memory. Cas is such a visceral presence. Quiet and unassuming a lot of the time, but underneath it all he’s a live wire. Nothing gets Dean weaker in the knee than when Cas Classic comes out to play, carrying all that intensity of the first night he and Dean met in that barn showering down around him like sparks. There may not be much of a light show anymore, (unless Cas actually decided to rig one up one day, which Dean would definitely not put by him) but his eyes still flash in exactly the same way.\n“This is a nice town you boys picked,” Helen says, breaking Dean out of (not his first) reverie where he thinks about just how much Cas means to him.\nThere’s no point in beating around the bush. Dean lo-\n“It is,” Cas says warmly, interrupting Dean mid-thought. “We’re happy to be here and excited to get settled.”\nHelen nods, obviously satisfied. She stands up, delicately flattening her bright yellow sweater. “Let’s not drag this out any longer, then,” she says, back to her cheerful self, “Of course you two were going to get the place.”\nDean and Cas stand to follow her, and Dean drops Cas’ hand.\n“Sorry,” he mumbles, wiping his palm on his thigh. Shit, his hand was really clammy.\n“Don’t apologize,” Cas says quietly, “I think that’s what sold her.” He leads Dean into the kitchen where they both sign the paper, and Dean feels like he’s having an out of body experience as he watches himself sign a co-lease with another man’s name. Cas signs after him, and then Helen waves the paper around happily.\n“Congratulations, gentlemen!” she chirps as they walk her to the door. “Welcome to your new home.”\nCas thanks her as she leaves, and as soon as he shuts the door Dean collapses back against it, closing his eyes and scrubbing a hand down his face.\n“Holy shit,” he groans, “That was exhausting.”\nHe listens as Cas opens the front closet again, and shuts it with a touch too much force.\n“I apologize that this fake relationship has already become so taxing for you,” Cas says, not without bite.\nDean cracks open an eye to stare at him. “Whoa. Are you mad at me?”\n“No,” Cas says passive aggressively.\n“Okay, that sounded a lot like a ‘yes’”.\nCas takes a deep breath, the lines in his face smoothing out. “I’m not,” he promises Dean, and even though Dean doesn’t completely buy it, he’s willing to put it aside for now. “We should go grab our things from the car.”\nThey do exactly that, peering furtively around as they lug more salt back up the stairs than any couple could ever need.\n“If anyone asks, we’re just into freaky sex stuff,” Dean says, and Cas rolls his eyes.\n“What kind of freaky sex stuff could we possibly be into with fifty pounds of salt?” Cas asks.\n“Okay, okay,” Dean amends. “We tell them we just drink a lot of tequila then.”\nThey bring up the iron rods and the shotguns and the salt rounds, and Cas even brings in some kind of purifying incense that he seems convinced will calm any wayward spirits down for a while. Sam and Dean were never big on using incense during hunts (it was a little too witchy for Dean’s taste) but Cas is in tune with nature or whatever, and he’s told Dean more than once that all the purifying properties of things like sage and rosemary and jasmine are just as good at dispelling evil as they are at creating it. According to him, it’s all about how you use it.\nFinally, they bring up duffel bags full of clothes, and Dean drops his on the floor of the living room with a sigh, collapsing onto the couch again.\n“I know I sound like a broken record, but this is so weird,” Dean says. “Like, if you had told me ten years ago that I’d be playing gay house with a former angel of the lord, I think I would’ve shot you just on principle.”\nCas offers a slight huff of laughter as he says, “A lot can change in ten years.”\nDean thinks about where Cas was ten years ago and where he was ten years ago. Cas would’ve been doing who knows what up in heaven, strumming a harp, fighting a war, singing hallelujahs maybe. As for him, ten years ago was 2006. He hadn’t even sold his soul yet.\n“Yeah,” he says, half in awe. “Time sure flies.”\nCas disappears down the hallway for a moment, and Dean realizes belatedly he hasn’t even seen the bathroom or the bedroom of his new apartment yet. Before he goes, however, he quickly checks under the cushions, but it interrupted by Cas.\n“We’re going to have to go buy sheets for the bed,” Cas says as he returns to the living room, “Toilet paper, towels, soap, things like that.” When he sees Dean fiddling with the couch cushion, he asks, “What are you doing?”\nDean puts the cushion back in place in defeat. “Checking for a pull-out.”\nCas just looks at him.\nDean shrugs defensively. “What? We don’t have to be a couple when no one’s watching, you know.”\nCas rolls his eyes, letting out an annoyed breath.\n“No offense, Dean, but can you pull your head out of your ass for like two seconds?”\n“What?!” Dean squawks indignantly.\n“First of all, your back couldn’t handle a pull-out bed, and it definitely couldn’t handle the couch. Second of all, we’ve shared a bed for the past two nights and multiple times before that. I know you have reservations about the way we’re handling this hunt, but you need to relax, Dean.”\nDean stands up, taking a long, low breath and trying to calm himself. “I know,” he says. “Sorry, I’m just…” he licks his lips. “Sorry.”\nHe brushes by Cas to grab his jacket out of the closet, wondering idly if he should just go without it in the November chill. It might freeze him to death and save him from the inevitable shitshow this is going to turn into.\nHe’s just shrugged it on when Cas lays a hand on his upper arm.\n“I know this has the potential to be… awkward,” Cas says, a distinct note of discomfort in his voice, and Dean feels his eyes widen slightly. Is he really going to start the feelings talk right here right now? Dean thought the diner was a one off, but maybe he was wrong. He thinks of every single time something seemed like it was going to happen between them and didn’t.\nCas seems to steel himself. “But as you said, this is merely a cover. We’re being practical. Professional.”\nDean’s never done a professional thing in his life, but he nods along anyway, ignoring the way his stomach clenches and how tension seems to hover between them like a particularly dense layer of fog.\n“Yeah,” he agrees, swallowing, “Practical. Professional. Sounds like a Winchester plan of action.”\n***\nAccording to Sam’s text, he’s still kicking around town talking to locals and flashing his badge, so Dean and Cas head out to the Bed Bath and Beyond down Route 7 with list in hand. The car ride doesn’t do much to dissipate the tension in the air between them as they talk only briefly about other things to add to the list. The dull colors of late autumn pass by outside the Impala’s windows and Cas stares determinedly at them, as if trying to will the leaves to drop through the weight of his stare alone.\nOnce they actually head into the store, though, things instantly take a turn for the better. Cas is infinitely fascinated by stores like these, and Dean’s not far behind in that department, despite knowing all the As Seen on TV gadgets are more of a scam than anything. Unfortunately, Cas had to learn that the hard way a couple months ago when he was pressured by late night tv into ordering a slap chop. Long story short, he almost ended up slap chopping a fingertip off that Dean then had to sew back on with a needle and thread. Cas’ finger healed fully, but the slap chop didn’t fare nearly as well when Dean chucked it into the garbage.\nCas does love his snuggie though, because Dean’s life is a joke. (He managed to talk him out of the leopard print one, at least.)\nAs they walk through the store, things between them settle, and soon enough they’re back to their normal, bickering selves.\n“I’m telling you, Dean, we should get the light blue.”\n“No, Cas, we should get the dark brown.”\n“How do you know brown sheets will match?”\n“Jesus, Cas, it’s brown. It’s a neutral, it goes with everything.”\n“Well I think the blue would look nicer.”\nDean slouches against the wall of sheets covered in plastic. “Oh my god. Okay, look, interior decorating tip number one, always get dark sheets if you have the option.”\n“Oh, I didn’t realize you were an interior decorator on the side. You should have told me.”\n“Dark sheets don’t show stains, Cas. You so much as drool wrong on light sheets and you’re fucked.”\nCas narrows his eyes, as if trying to suss Dean out. “This isn’t about drool,” he parses, “You want to eat in bed, don’t you?”\n“… No.”\n“Dean Winchester, so help me if the only reason you want dark sheets is so you can eat in our bed-”\n“Okay, maybe that’s a part of it, but-”\n“-We’re getting the blue-”\n“-What I said about stains still stands, and we all know how you are about drool-”\nCas hits him with the plastic bag of sheets. Not hard or anything, but enough that Dean’s eyebrows rise.\n“Okay, one, I’m not getting into another pillow fight with you. I admit I learned my lesson last time. And two, I’m not getting into a pillow fight with you in Bed Bath and Beyond. Jesus.”\nCas taps him this time, lighter.\n“So I win, then,” he says, clutching his precious blue sheets a little tighter.\nWhat happens next Dean is firmly against calling a pillow fight. More like a brief sheet scuffle.\nAs it stands, they end up buying both pairs of sheets.\n***\nThey meet Sam back at the motel, and when he offers them some of his leftover pizza, his eyebrows draw together in legitimate concern when Dean declines.\n“What’s wrong with you?” he asks immediately. He looks to Cas. “Have you let him out of your site today?” he stands up. “I’m getting the holy water and silver.”\nDean rolls his eyes and holds out a hand. “Would you calm your tall ass down please? We’re going to the grocery store after this and I’m going to make some real food back at the apartment.”\nSam sits down, a shit-eating grin spreading across his face.\n“Oh, of course,” he says, folding his hands together. “To celebrate.”\nDean reaches over to pick up a limp piece of pizza, frowning at it.\n“To save ourselves from eating cardboard,” he corrects. “I could cook better pizza than this in like ten minutes.”\n“Wine?” Sam asks, holding up a fake bottle in one hand, “Or champagne?” he holds up the other.\n“How about the chardonn-knock you the fuck out?” Dean asks. “I hear it’s free and very crisp.”\nSam grabs a cold piece of pizza and chomps into it, obviously very pleased with himself. Dean turns around to plead at Cas.\n“You just gonna stand there? You’re my fake boyfriend. Defend my honor.”\nCas doesn’t even look up from his phone. “No,” he says in a very bored voice.\n“Wow. Rude.”\n“Are we going to discuss the case or not?” Cas asks, slipping his phone into his pocket. “I’m very hungry and want to leave.”\n“Sheesh Cas, tell us how you really feel. You’ll be lucky if I cook you ramen with an attitude like that.”\nCas sits in the chair waiting at the desk and stares at Dean balefully, almost petulantly.\n“Oh my god,” Dean says, this time turning to Sam for help. Sam just shrugs.\n“Your fake lovers’ quarrel, not mine,” he says. He squares his laptop in front of him. “Are we gonna do the debriefing thing or not?” Before either Dean or Cas can answer, he grimaces at the notepad beside him and says, “Not like it’s gonna take long.”\n“That means it’s either good news or bad news but judging from our entire life I’m guessing it’s bad,” Dean says.\nSam nods. “Yep.” I spent all afternoon talking to people all around town.”\n“What, and got nothing?” Dean asks.\nSam huffs. “Exactly the opposite, actually. Too much. I’ve got pages of stories and anecdotes and he-said-she-said going back literally hundreds of years. Seems like this is the kind of town where everyone had a great great grandfather who had some kind of ghost story that had been passed down through their family for generations, blah blah.”\n“Yeah, join the club,” Dean says. “What about our building specifically?”\nSam shrugs, flipping through his notebook. “Same,” he says. “Tons of stuff.”\n“So now it’s just a matter of sorting fact from fiction,” Cas finally chimes in, and Dean turns to him with a raised eyebrow.\n“I’m headed to the library tomorrow morning,” Sam says. “You guys coming?”\n“Didn’t we already agree that the new guys in town hanging out with the FBI agent who also just got into town look weird?”\n“Uh, not that I recall,” Sam says. “Sounds like you’re just trying to get out of doing research.”\nDean waves a hand vaguely. “Pssssshaw,” he scoffs. “That doesn’t sound like me at all.” Truthfully, there are some things at the apartment Dean wants to get in order. Figuring out what goes in which cupboards, what color towels to get for the bathroom, deciding if they want to move the furniture around or not… Y’know. Stuff that’s completely necessary for the case they’re working.\n“Uh huh,” Sam says, sounding thoroughly unimpressed.\n“And the history of the place?” Cas asks. “Did you find out anything pertinent?”\n“Nope,” Sam says. “Aside from all the bizarre deaths, this place is pretty boring, history-wise. I’ll dig into it more tomorrow at the library, but I can’t guarantee I’ll find anything.”\nDean glances at his watch.\n“Alright, well, we better go then,” he says, standing up and grabbing his jacket, glancing at Cas. “You good?”\nCas nods, and as they head toward the door, Sam says, “You got dinner reservations or something?”\n“I already told you we’re eating in tonight,” Dean says over his shoulder. “Nah, Sammy, tonight we’re meeting the neighbors.”\n***\nThey’re in the baking aisle of the grocery store when Dean glances around to make sure they’re alone and says, “So, like, we haven’t actually talked about… how we’re supposed to act. As a couple.”\nCas peers at a jar of maraschino cherries where they sit on a shelf like they hold the secrets of the universe. “We seem to be doing just fine so far.”\nFine is an interesting word to describe their situation, given that Dean’s palms have been sweating at an alarming rate all day.\n“Helen seemed to believe us,” Cas says, half his attention still on the merchandise.\n“Yeah, well, we’re paying Helen, and Helen is desperate to sell that place,” Dean says. “She might be willing to overlook how twitchy her two newest tenants are.”\n“So?” Cas asks. “As long as Helen buys it, why does it matter what anyone else thinks?”\nDean half rolls his eyes. “That’s the whole point of cover in the first place,” he says. “We’re lying low, which means we want everyone to buy this. Us.” He gestures between them.\nCas puts the sprinkles he was just examining back on the shelf and finally turns to look at Dean, frustrated.\n“I don’t know if you’ve noticed, but I’m playing my part just fine,” Cas says smoothly. He steps into Dean’s space before Dean even has a chance to register the movement, pinching his lapel between two fingers and straightening his jacket. He pats Dean on the chest and steps away, blasé as anything.\nDean’s ears are ringing.\n“We still need bread and orange juice,” Cas says, like nothing just happened, and starts walking down the aisle.\nDean blinks and snaps out of it, hurrying after Cas with hot cheeks.\n***\nThey eat dinner and then they talk to the neighbors. They hear what Dean assumes is just the same-but-slightly-different stories from the ones Sam heard earlier today. They talk to the slightly aloof middle aged couple across the hall, and the most they get from them is that the building has a reputation for cold spots, but the couple next to them more than makes up for that.\nSandy and Dave are exuberant almost to the point of nausea, and Dean does his best to smile along while Cas looks slightly perplexed at best. Over (too much) wine, Sandy tells them the story of the “horrifying vision” she had a couple years ago while Dave was off on a business trip to Ohio.\n“So there I was,” she exclaims, face red and bob haircut bouncing with even the slightest movement, “Sealing up some chopped veggies for Cici Carter’s Fourth of July Annual Summer Blowout Bonanza, and I-” she falters here for a moment, searching for words, “I wouldn’t say I heard anything, exactly, but I felt it, I guess. It was like I was being watched. Spooky.” She shivers, and Dave puts an arm around her. Stuck on the loveseat, Dean and Cas’ knees knock together. “I turned around and I swear on my mother’s grave that I saw a man standing in my kitchen.” She leans forward, “A man covered in blood. But before I even had a chance to scream, he vanished!” She snaps her fingers. “Just like that.”\nDean feels his eyes widen slightly. “Whoa…” he says, playing along, and that’s probably the alcohol talking. “And you think… you really think it was a ghost?!” \nSandy nods solemnly. “I never believed in all that paranormal nonsense until we moved in here,” she says seriously. “Things get lost, or moved around even though nobody touched them. Lights turn on and off when no one’s in the room. Sometimes I swear I can hear footsteps walking down the hallway in the middle of the night even though we’re both in bed.”\nDean leans forward as well, using Cas’ knee to brace himself. “Do you have any idea what could be going on?” he asks. “I mean, d’you think it could be someone who used to live in this building? Who died here, maybe?”\nSandy takes another sip- gulp, more like- of wine. “Oooooh dear, I don’t know,” she says, shaking her head. “These things give me the heebie jeebies. I try not to think about them too much.”\n“Have you considered moving away?” Cas asks. He’s had less wine than Dean, but there’s still a pink tinge to his cheeks, and his hair, in the span of a couple hours, has somehow become even messier than usual. His eyes are strangely intense.\n“Oh, of course,” Sandy says. “Everyone who lives here has considered it at some point or another. Some people have gone, of course, bless them. But the rent is just so gosh darn cheap. And, really, what’s a couple lost house keys in the grand scheme of things?”\nDean exchanges a glance with Cas, and then says quietly, “Did you know the person who lived in our apartment before us?”   \nAt that, both Sandy and Dave go very still. Dean clears his throat awkwardly. “Uh, sorry,” he says roughly, “I didn’t mean to pry or anything.”\n“No, no hon that’s not- it’s fine,” she assures him, reaching over and patting his knee. “We didn’t know them very well. He was a younger man, I think. Kept to himself for the most part.” She swallows, obviously uncomfortable.\n“We walked by the crime scene before we knew… just how messy it was,” Dave finishes. “There was blood everywhere.”\n“I’m sorry,” Dean says, and Sandy tries to smile at him.\n“It’s fine, dear,” she says. “It’s just fine. Unfortunate accidents happen all the time.”\nThrough the haze of alcohol, Dean thinks, shit, these poor bastards don’t even realize. They haven’t connected the murders to the other signs of ghost activity. He takes his hand off Cas’ knee, leaning back into the couch and shoving a hand into his pocket, fumbling the protective hex bag there. Cas asks another question that Dean doesn’t pay attention to, trying to hide his arm behind Cas as he works the hex bag in between the couch cushions. The last thing they need is any of their new neighbors dying and having police swarming all over the place, taking names and asking questions. \nWhen they spoke (very briefly) to the couple across the hall earlier, he had managed to stick a protective bag into the bowl of plastic fruit on their counter, but he got such a strong we don’t take kindly to your folk round here vibe from them that he almost took it back just on principle.\nIt’s later than they realize when they head back to their own apartment, Sandy begging them to stop by and visit them again soon. As Cas fumbles with his key at the lock, Dean leans in close and whispers to him, “Look at us, bein’ all neighborly and shit.”\nCas chuckles as the lock clicks and the door swings open. Dean practically stumbles in, throwing an arm around Cas to steady himself.\n“Right,” Cas confirms, “We should definitely go to bed.”\n“The same bed,” Dean says solemnly, then laughs.\nDean lazily shucks his shirt, sloppily fumbling at the button on his jeans while Cas does the same on the other side of the bed. He digs around in his duffel for a pair of sweat pants, yanking them on and collapsing into bed (freshly adorned with their light blue sheets). Cas doesn’t even bother putting on pants, instead opting to sleep in just boxers, and Dean takes a hazy to moment to think, not fair. \n“Well, happy one day anniversary,” Dean says once they’ve got the lights turned out and they’re both comfortably under the sheets. The doorway and window sills are lined with salt, and in the morning they have to paint sigils on the walls. “Here’s to many more.”\nIt feels strange but good to know that they’re sleeping on sheets they cared enough about to fight over.\n***\nThe next morning, they paint the sigils on the wall of their bedroom. The paint they’re using is similar to the already crème walls, since anything brighter would look strange when they paint over again after the hunt is finished. It’s likely they over-sigil instead of under-sigil, but Dean figures if they have the time, they may as well. Better now than whenever they find this thing and potentially get caught with their pants down. As the years go by, Dean, Sam, and now Cas all have to minimize the amount of times they can get thrown into walls by ghoulies before something snaps that can’t be fixed by dental floss and cheap whiskey. (Not that he particularly liked getting thrown into walls when he was 20, but he sure as hell came to like it a lot less the older he got.)\nThey paint in silence, mostly to concentrate on the sigils they’re trying to ink correctly. Cas only threw on a t-shirt after rolling out of bed, and he looks more like a stray mutt that got loose in an art studio than an actual human being as he frowns at his phone screen where he keeps pictures of all the sigils he hasn’t memorized yet. He has a streak of paint on his cheek that Dean’s not entirely sure he’s noticed yet, and he silently wonders how long it’ll take Cas to realize.\nHe focuses back on his own sigil, a jagged one that’s supposed to ward off mermaids or something, (yeah, okay, but Dean’s not taking any chances) and when he raises his brush back to the wall he finds that he also didn’t escape this art project unscathed. Just under the crook of his right elbow is a strip of paint that he doesn’t remember noticing, and he feels himself swallow as he stares at the vague 7-shape it makes on his arm.\n“Dean?” Cas asks, obviously having noticed him go stock-still. When he doesn’t reply, Cas puts his brush down and tosses his phone onto the bed as he steps over into Dean’s space. “What’s wrong?” he asks, but as soon as he follows Dean’s gaze to the paint splotch on his arm, his mouth thins in understanding.\n“Dean-” he starts, but Dean brushes him off, turning slightly away from him.\n“It’s fine,” he mumbles, “I’m just being stupid.”\nIt’s been over a year since they’ve gotten rid of the Mark, but Dean still swears he can feel it burning under his skin, sometimes. Anytime he gets angry- like, well and truly and genuinely angry- there’s always a part of him waiting for some kind of spark to catch, and it’s the Mark that he wants to strike that match against. He doesn’t think it’s ever going to go away completely, now just as much a part of him as the scar tissue in his fingers from that salt’n’burn way back in ‘98 or the way the freckles on his face darken in the summer. Some days he looks down at his arm and still expects to see it there, just as red and charred and mean as the first time he ever saw it.\nIt’s long gone, but not really. Dean still carries the shit he did under its influence, the fights with Sam and the punches he threw at Cas, the innocent people he hurt and the lives he ruined. He’s tried to keep on trucking, working through the stuff he can, trying to live under the weight of the stuff he can’t. Things are probably about as back to normal as they’re ever gonna get, but he still catches flashes of black in the mirror sometimes.\n“It’s okay,” Cas says softly, reaching out. He curls a careful palm around Dean’s elbow, sliding his hand down to cover the paint splotch.\nDean tries to take his arm back, but Cas has always had a firm grip. \n“Not really,” Dean says, harsher than he means to. “I just got tripped up by a paint stroke.”\nCas slides his palm down the rest of Dean’s forearm, the paint streak gone. Dean tries not to roll his eyes. Cas can still do what most people would refer to as parlor tricks, just little tiny things like managing to get that last, impossible squeeze out of the tube of toothpaste or knowing just the right moment to stop the microwave so that the leftovers are perfectly heated up. Similar to the not-superman-but-still-pretty-damn-strong theory, they’re not sure if it’s holdover from Cas’ grace, or if human Cas is just naturally a little more in tune with the world around him.\nApparently, this specific brand of parlor tricks is also helpful in removing the paint color egg shell from arms, and Dean feels like an idiot for getting caught up in the first place.\n“It’ll take time,” Cas says quietly. “Just give it time.” He keeps his hand on Dean’s arm for a moment longer, before allowing it to fall away and stepping back, eyes still trained on his face.\n“Yeah,” Dean says gruffly. “I know.” He’s miles ahead from where he was at this time last year, at least. When he was having nightmares every time he closed his eyes and would wake up sobbing in the pervading darkness of his room.\n“You’re here now,” Cas says, gently but firmly. “And I’m not letting you go, ever again.” The words aren’t funny, but the fact that Cas is saying them with three day old stubble and hair that looks like a bird’s nest is. His t-shirt is too big for him and the boxers are just the cherry on top of this whole dumb cake. Dean actually lets out something that wants to be a giggle. Maybe it’s the paint fumes messing with his head.\n“Are you- laughing?” Cas asks, obviously confused. Potentially even offended that Dean is terrible at receiving his particular brand of declarations.\nDean clears his throat.\n“Sorry,” he says, bending down to pick up his brush again. It’s really not that funny, but it kind of is. Him and Cas discussing the darkness that’s plagued their lives for as long as they’ve lived, as they paint the walls of their shared bedroom in the apartment they apparently now live in.\nIn their pajamas.\n“Our lives are fucked, dude,” he says, chuckling. “I mean, this is the most normal we’ve ever been probably, and that’s what’s so fucked about it.”\n“We are still hunting something,” Cas says slowly, “And we did just stick protective hex bags in all our neighbor’s apartments last night.”\nDean snorts laughter.\n“That’s what I mean,” he says. “Like, this is as close to normal as we’re ever gonna get. You with the magic tricks. Me with the Mark bullshit.” He gestures at the sigils drying on the wall beside them. “All that nasty business.” He shrugs. “I think I’m having an epiphany.”\nCas looks at him, brows raised.\n“Was that the epiphany?” he asks, a little baffled, “That we’re never going to be normal people? I thought that was something we’d established a species-change and a half ago.”\n“What? No,” Dean says, waving him off. “The epiphany part was that this is a good thing. This- this weird, strange, half-domestic-half-hunting thing. Like.” Dean grins, gesturing around them. “Look at us. Standing in a home that doesn’t also double as the secret clubhouse of a secret society of dudes doing secret things.”\n“You love that it’s a secret clubhouse of a secret society of dudes doing secret things, though,” Cas says.\n“Yes,” Dean says. “And that will always be very, very cool.” He holds up his paint roller. “But this will also always be very cool.”\nFondness creeps into Cas’ eyes as he cocks his head slightly and looks Dean up and down.\n“Yes,” he says. “I think it will be. Very cool, that is.”\nDean thought he learned his lesson with the pillows, and then he thought he learned his lesson with the sheets. But now he tests the waters again because he’s feeling buoyant for reasons he can’t exactly explain but he’s sure are related to the epiphany he just had, and reaches forward to wipe a long streak of eggshell down the front of Cas’ shirt with his roller.\nCas doesn’t move, but stares at Dean with wide eyes. Dean stares right back.\n“Why’d you do that?” he asks.\nDean steps forward, the newspaper they’d laid crackling under his feet. He holds his roller out in front of him.\n“Because I can?”\nCas takes a step away.\n“Dean,” he says measuredly, and Dean knows he’s only trying to sound like the voice of reason because he doesn’t currently have a weapon/paintbrush with which to fight back.\n“Cas,” he says back in the same tone of voice, advancing slowly with the roller.\n“Dean,” Cas says again, more urgently this time. His foot bumps against the paint tray where he dropped his brush earlier, and holds both hands in the air as he bends down to pick it up. It’s way less threatening than the paint roller, and Dean smirks.\n“C’mon, babe,” he says jokingly, gesturing with the roller, “Get over here and lay one on me.”\nCas holds the paintbrush out, giving it a couple half-hearted waves.\nDean feels his smirk slip into something more predatory as he advances. Cas must see the glint in his eye, because he blinks, and then in the next second he’s tearing out of the room and the chase is on.\nDean follows, practically falling flat on his face as he slips in the salt laid across the doorway. He slides into the wall opposite, using the momentum he has to push himself off and charge down the hallway. Cas is standing on the opposite side of the couch, looking awfully naked in his boxers and now dirty shirt.\n“This is not a productive use of our time, Dean,” he warns.\n“You only say that because you got the short end of the stick,” Dean says, nodding to the paintbrush he’s holding. “Literally.”\n“Dean,” Cas repeats, and Dean tries not to think about how often Cas says his name, how much he likes Cas saying his name.\nCas gives himself away though, his mouth turning up just barely at the corners. Cas always likes to think he’s some stoic badass, but Dean’s known him for long enough that he can read him like a book. The smallest curl of Cas’ lips is just as obvious to Dean now as raucous laughter from someone else.\n“You think you can take me?” Dean asks, raising an eyebrow. A weird tension has erupted between them, despite being almost across the room from each other. It feels like a challenge.\nCas lets his expression slide into a lazy smirk. “I’m two for two already,” he says, twirling the brush expertly between his fingers. “I’m happy to make it three for three.”\nDean beckons Cas forward with a curl of his finger, “Well then, time to shine, clementine. Show me what you got.”\nCas flicks paint at him.\nFrom across the room.\nAnd grins.\nDean feels a spot of white land on his cheek.\n“You little shit,” he says. “That’s cheating.”\n“You only say that because you got the inefficient end of the stick,” Cas says, dry as a bone, and flicks more paint at him.\n“Hey, HEY!” Dean yells, holding his hands in front of his face. “That shit could be toxic! How would you feel if I swallowed some and died all because you were too chickenshit to face me head on?”\n“I would be very sad, Dean,” Cas says somberly, “Then I would find a way to break into heaven and kick your ass for being stupid enough to swallow toxic paint,” he continues, much less somberly. He flicks some more paint. “I was a strategist in heaven, if you’ll recall. I’m strategizing.”\n“While there’s nothing I love more than watching my boyfriend utilize his celestial skillset to flick paint at me while hiding behind the couch, I think I’m just gonna take matters into my own hands,” Dean decides, advancing again.\n“No, Dean,” Cas says. “Don’t.”\n“Or what, you’ll throw your brush at me?”\nHe sprints forward, prepared to paint role Cas into next week if he has to. He vaults over the couch and Cas makes a break for it, and Cas is pretty quick but Dean, perhaps for the first time ever, is quicker. He manages to paint a wide, if somewhat messy stripe all the way from Cas’ ass to his shoulders, and when Cas turns around, resigned expression and all, Dean doesn’t shy away from Cabbage Patching over to him, grinning right up close.\n“What was that about three for three?” he asks, cupping his ear and leaning in.\n“You’re insufferable,” Cas says, half-annoyed and half-fond, his breath warm against Dean’s cheek. Dean feels his eyelids flutter.\n“No, I’m a winner,” Dean corrects, pulling away and trying to regain his bearings. “But that does sound like something a sore loser would say.”  \n“I’m not sore,” Cas says sorely. “And I’m also not a loser. I’ve won the last two.”\nDean blanches. “What, the pillow fight and the sheet thing? That doesn’t count. We never agreed that that counted.”\nCas looks at Dean, assessing.\n“That sounds like something a sore loser would say,” he says lightly.\nDean oscillates between tackling Cas and yanking him in by his paint covered t-shirt to probably do something to Cas’ mouth with his mouth. Instead, he settles on leaning forward and pointing a finger in Cas’ face, because Cas hates being pointed at. He finds it condescending, or something.\n“Fine,” Dean says, “I’ll give you this one-”\n“Two.”\nDean grits his teeth. “Fine. I’ll give you these two. But I’m gonna even the score eventually.”\nCas leans forward as well, wrapping a hand slowly and deliberately around Dean’s pointed finger.\n“I look forward to it,” he says, literally pumping his fist once on Dean’s finger before pulling off with what Dean would almost describe (with very sweaty palms and very tight pants) as a leer. His brain makes the same sound as a car engine does when something is very wrong with it, and his throat goes dry.\nWithout another word, Cas turns around and starts walking back toward their room, while Dean stands there like King Midas just grabbed his ass and turned him into gold.\nOnce Cas disappears down the hallway he calls back, “I’m not finishing these sigils on my own, by the way.”\nHe snaps out of paralysis, and heads towards the bedroom.\n“Just so you know, your ass looks like a two lane road,” he says belligerently, loud enough for Cas to hear.\n“How nice of you to notice,” Cas says mildly as Dean walks into the room. Luckily, he doesn’t bother dropping any of the dozen “drive me” or “ride me” puns that were most definitely at his disposal.\nThey finish painting the rest of the sigils, and when they step back to admire their work Dean nods in satisfaction.\n“Look at us go,” he says. And Dean looks at Cas, standing beside him, always smiling more with his eyes than his mouth, and thinks, I’m not letting you go, either.\n***\nTwenty minutes later there’s a knock on the door, and long term habit has Dean shoving his gun into the back of his waistband and keeping a hand at the ready just in case. Cas hovers warily just behind him, still in his goddam boxers.\n“Really?” Dean hisses at him, before rolling his eyes and opening the door to reveal Sandy from down the hall, jacket in her hand looking strangely like the one Dean swore he wore back to the apartment last night.\nWhen she gets a proper look at both of them, her eyes widen almost comically.\n“Um,” she says, and Dean’s suddenly self-conscious of all the paint Cas fucking flicked at him earlier. “If this is a bad time…”\n“What, no of course not.”\nAnd then Dean actually realizes what she means, and wonders how quickly his face can turn red. Him and Cas, a couple who just moved into a new apartment, at least one of them in a state of semi-undress (Dean glares at the boxers again), while they’re both covered in dried white stuff. He shoots a glance at Cas, and that probably doesn’t make them look any more innocent. Cas, as usual, looks like someone forgot to iron him this morning, hair sticking up in all kinds of weird places.\n“Oh!” Dean says, forcing a laugh, “No, god, um,” he gestures to Cas, “We were painting, I, uh. I swear. Eggshell, it’s called. Y’know, cause, um, white.” He points to the mess on Cas’ torso and knows he’s cringing. His face must be the color of a firetruck. “Just covering up some chips in the paint.” He smiles weakly.\nSandy clears her throat, working up a way more convincing smile than Dean’s.\n“No worries!” she says, holding out Dean’s coat. “I think the wine left this behind last night.”\n“Right,” Dean takes it. “Thanks a lot for bringing it by.”\nSandy’s expression turns sheepish. “I have to admit,” she says, “I did have another reason for stopping by.\n“Did you?” Dean asks, probably not hiding his lack of enthusiasm very well. It’s all in the teeth. He keeps them too closely gritted sometimes.\n“It’s just that, I know today is only your second day, but there’s an old dance hall in town and they put on a get together every month for what I guess you’d call our neighborhood watch,” she explains, “It’s definitely something of a tradition in town, but it’ll also allow you boys to get to know everyone.” She leans in like she’s about to tell them a secret, “Not much goes on around here, as I’m sure you already know. Gives us a good chance to get gussied up.”\n“… Oh.” Dean says. “So it’s… a formal thing?”\nSandy shrugs. “There’s refreshments. There’s dancing. You certainly don’t have to show up in a tux. Though I will say Dave usually wears a tie. It starts at 7 tonight, five a person at the door.”\nOh, shit, Dean doesn’t want to deal with this. But there’s no way he can just pass up a lead like this when it practically falls into their paint-covered laps.  He shoots a look at Cas, who simply shrugs one shoulder in return.\n“Why not,” Dean says. “I’m sure it’ll be a blast.”\n“Oh, that’s wonderful!” Sandy says, and her genuine delight does actually ease Dean’s reluctance slightly. She leans in again, her tone turning almost cheeky. “And may I just say, that you two make such a handsome pair,” she says. “The town is already a titter and everyone is very excited to meet you.”\n“Sounds like fun,” Dean says, then pretends to check his watch before he realizes he hasn’t put his watch on today. “We’ll see you and everyone tonight then.”\n“Bye bye!” she says, heading off back down the hall.\nDean closes the door.\n“Shit,” he sighs.\n“This could be a lead, Dean,” Cas says. “Surely Sandy and Dave invited us in case we’d like to talk to anyone about the hauntings.”\n“Oh, I know that,” Dean says. “That’s not what I’m worried about.”\n“Okay, so what are you worried about?” Cas asks.         \n***\nFancy shit.\nAnd even though he loves those tiny little cocktail weenies, he has horrible luck with dropping them and staining nice clothes, and getting stains out of nice clothes in laundromats was always a bitch and a half.  At least now they have the bunker (and their apartment, Dean has to keep reminding himself), any weenie related mishaps can be fixed relatively quickly, and Dean’s even carrying a stain remover stick in his pocket like an almost responsible adult. But he still feels weird at these things, uncomfortable in his own skin. This upper-middle class town pto stuff was never his life and he’ll never quite fit in. He’s not bad enough to blow their cover or anything, but most times when him and Sam had to show up to things like this, it was like people could smell on them that they weren’t quite up to snuff.\nCas, though. Cas is from a different world, and sometimes Dean forgets that, especially now that he’s- for the most part- just like any other human. Cas knows how to walk and how to talk, all that soldier shit heaven crammed into him however many million years ago when they put him together still clunking around somewhere in there. Dean was raised a solider as well, but not one who walked with his back straight.\nThey did their best with the clothes, but like the interview shit the other day they were kind of flying by the seat of their pants. Cas ends up wearing a black vest over a striped navy and white dress shirt, a black tie nearly knotted at his neck. (They’re long past the point of Dean needing to tie Cas’ ties for him, but tonight Cas had grumbled with the fabric until Dean finally got tired of hearing it and reached around Cas’ neck to tie it himself.) He’s wearing the same black jeans from the interview and his black FBI shoes. Dean attempted not to drool over Cas quite so much this time, but vests seem to like Cas’ broad frame, and Cas seems to like rolling up his sleeves, so Dean works with what he’s got.\nDean, on the other hand, isn’t sure if he’s once again drawn the short end of the stick or not. He’s in plaid, which he likes, but he’s also wearing suspenders and a bow tie, which he doesn’t like near as much. But it had been the fastest outfit he could throw together in the store (since they found themselves running late because Dean had to yell at Cas about putting a comb through his hair), and it was the fasted “nice” outfit he could grab. The lighter blue in the plaid goes nicely (he thinks) with the navy of the suspenders and pants and bow tie. He didn’t actually think about how he and Cas kind of matched until after they had parked, and then he groaned because he sighed up to date Cas, not take him to prom.\nWhen Cas asks what he’s grumbling about, Dean explains the wardrobe malfunction and Cas looks desperately like he’s trying to keep a straight face.\n“Would you like me to go home and change?” he asks, quirking a brow. “I’m sure we’re going to be the talk of the town because we both wore shades of blue tonight.”\n“You’re a dick.”\n“You’re the one who doesn’t want to take me to prom. Me. Your boyfriend. To prom.”\n“Cas, you didn’t even go to high school.”\n“They say it’s supposed to be the best years of your life.”\n“They lied.”\n“Who is ‘they’, anyway?” Cas muses as they head toward the building. Dean can hear the music drifting through the walls. “And why does their opinion matter so much more than everyone else’s?”\n“Maybe you can write a paper on it for sixth period English,” Dean says.\n“Perhaps I will,” Cas says. “Though I’d argue this type of paper is best suited for philosophy.”\nDean shakes his head. “Always such a stickler.”\nOnce they get to the door Dean expects someone to be waiting to take their entrance fee, or at least someone to bustle outside with a moneybox, but there’s simply a lone can sitting on a table with a sign that reads: HIGHBURY NEIGHBORHOOD WATCH MONTHLY ROUND-UP: $5.\n“Are these people idiots or just naïve?” Dean wonders out loud as he stuffs a couple fives into the can.\n“Maybe they’re more afraid of the kind of people who can’t steal their money,” Cas says knowingly.\nDean turns to look at him. “What?” Then, he realizes, “Oh, ghosts, yeah.” They’ve pretty much decided by now they’re dealing with a ghost (or ghosts), mostly because it helps them narrow the suspect pool.\n“This town is actually quite peaceful,” Cas says, “Barring the occasional supernatural homicide, of course.”\nThey head inside, and Dean immediately feels weird. This isn’t the higher end shindig he thought it was gonna be, but it still makes his palms sweat regardless. Him and Sam cornered a couple vamps in an abandoned dance hall in Texas years ago, but Dean’s never been inside one that’s still in use. It looks almost like a barn minus the hayloft with its vaulted ceiling and wooden floors. There’s old jazz playing from speakers in the corners, and about half the people here are swishing around on the dance floor.\n“What year is it?” Dean says to no one in particular. Some of the women here are actually wearing poodle skirts. There’s a couple dudes smoking pipes over in the corner.\nDean and Cas walk over to the side of the room that isn’t currently being used as a dance floor, taking two seats at an empty table.\n“This is fuckin’ weird,” Dean says, no preamble.\nCas, watching the people dancing, says, “Sandy did say there wasn’t much to do around here.”\n“I thought she just meant people play a lot of videogames instead,” Dean says, “I feel like everything should be in black and white.”\nAs if her ears were burning, Sandy and Dave emerge from the crowd, taking the empty seats beside them.\n“Welcome!” Sandy grins, at least wearing modern day clothing. “I’m so happy you two made it.”\n“Happy to be here,” Dean lies.\nThey make small talk for a while, and their table slowly fills up. Sandy and Dave keep calling out to people walking by, introducing them to Dean and Cas. Some sit down to talk, and both Dean and Cas spend the next half hour or so having the same conversations over and over again. Every time he introduces Cas as his boyfriend, his cheeks heat, but he eventually gets better at it. All he can say is that he’s glad as hell this case is in a blue state, and even then he’s seen some not-so-friendly glances from a couple people that have steered clear of their table. Obviously word is getting around.\nEventually, they seem to have settled what Dean assumes is the “core” group of the neighborhood watch in all available seats. Dean’s actually not one hundred percent sure what neighborhood watches do other than having meetings, even though he was in one back when he lived with Lisa and Ben. Put up signs, maybe? Either way, he kind of expects everyone to say, “the greater good” in sync at least once, and is disappointed when they don’t. At one point he leans over to Cas and mumbles, “We’re in fucking Sandford, Sergeant Angel.” Cas shoots him a quick grin before being pulled into conversation again, and Dean turns back around to listen to a story he hasn’t been paying attention to at all.\nA couple minutes later, a guy whose name Dean can’t remember asks from across the table if they’ve met the “Ghost of Painter Building” yet, and every conversation around them grinds to an abrupt halt as Sandy glares at him, like he stole her thunder or something. Dean thinks she introduced the guy as her brother, which would explain why he seems to know where he and Cas live. Everyone is suddenly staring at him and Cas, and one woman says, “You live in the Painter building?”\n“Sure do,” Dean says, somewhat awkwardly.\n“Seen anything strange yet?” Someone else asks.\n“Not really,” Cas says.\nEveryone kind of looks at each other, and Dean senses some tension at the table. Out on the dance floor, couples continue to twirl, unaware. He assumes the Painter building has long been a source of debate, especially since a neighborhood watch is technically supposed to help people, and the people in this neighborhood keep dying “accidentally”.\nFinally, a blond woman a couple seats down from Dean sighs and says, “We need to do something about that place.”\n“There’s nothing to be done,” a guy says from across the table. “We’ve been over this a million times, Janet.”\nJanet’s eyes flash. “There’s something going on in that building,” she says, shooting an almost apologetic look first at Sandy and Dave, then Dean and Cas. “There must be someone we can call or s-”\n“Who you gonna call? Really?” the guy asks in disbelief. “What, professional ghost hunters?” He snorts.\nDean and Cas exchange a look.\nThis all sounds like ground that has been tread before, and Dean doesn’t know if it’s hilarious or sad that these people (most of them, anyway) still have no idea what’s going on, or will even admit that what’s right in front of their eyes is real.\nDean likes this Janet lady, though. She might have something to say. While he waits for the fight to blow over, Dean shoots off a text to Sam with updates. Sam had practically snorted coffee out his nose when Dean told him this morning where they were gonna be tonight, but even he had to admit that it could lead to some good info. Dean ends his text with a suck on that, and hits send with a smirk.\nOnce the hubbub has died down and tempers have simmered and the table has moved onto other topics, Dean taps Cas on the shoulder, letting him know he’s going to be back in a minute. He takes the seat next to Janet that’s just been vacated, holding out a hand.\n“Hey,” he says, “We got introduced from across the table earlier. I’m Leo.”\nJanet takes his hand and re-introduces herself.\n“I hope I didn’t freak you out with that Painter talk,” she apologizes. “I’m just… I don’t know. Paranoid, I guess.”\n“I gotta say, I’m more interested in that place than freaked out,” Dean says. “Have you ever seen anything yourself?”\nShe hesitates.\n“You wouldn’t believe me.”\nOh man, if Dean had a nickel.\n“Try me,” he says.\nShe sighs. “I lived there. For six months. After that I couldn’t take it anymore, and moved somewhere more expensive across town.”\n“And by ‘it’ you mean… ghosts?” Dean prompts.\nShe half-laughs, probably more out of discomfort than anything. “It sounds so dumb,” she says self-consciously. “Even just saying the word out loud. Shit.”\nDean shakes his head. “Nah,” he says. “Hey, some of the shit me and Steve have seen?” he jerks his thumb over his shoulder at Cas. “Nothing compared to that, I promise.”\nShe swallows, tucking a stray strand of hair behind her ear.\n“Every town has some sort of haunted spot,” she says. “Something the locals always tell stories about. The house on the hill the kids are always warned against going near. The witch who lives at the end of the road. Whatever. It’s all fake, all weird. Like a creepy reverse Santa Clause or tooth fairy.” She glances ruefully at Dean. “The Painter Building is haunted. Not cutesy haunted like Casper or kitschy haunted like bad pipes that gurgle in the night, but seriously pissed off haunted. Helen even changed it so that no one person could rent anymore. That’s why she wanted couples only, so they could at least keep an eye on each other.”\n“Cold spots?” Dean asks. “Shit moving around on its own?”\n“Freezing room,” Janet corrects, “and shit getting thrown around like it just got caught in a tornado.”\nOkay. Probably not a poltergeist. Probably not the ghost of anyone deceased in the last couple decades. It takes a long time for a spirit to build up that kind of thunder.\n“I almost died probably three or four separate times?” she guesses. “My ceiling fan detached and crashed about a foot away from me. A steak knife flew across the kitchen, close enough that it sheared off a chunk of hair. Some invisible force almost pushed me off my balcony.” She nods in affirmation. “Any of those events separately I could maybe explain away. But that’s only the tip of the iceberg. I’ve seen shadowy figures standing behind me in mirrors, and when I turn around they’re gone. I’ve seen them in my kitchen. In my bed, once.” She shudders. “I slept at a friend’s house for a week after that.”\nDean lets out a breath. Pissed off is a pretty generous way of describing that.\n“So much for not freaking me out,” he jokes. Then, more seriously, “I’m glad you got out.”\n“And I’m sorry you got in,” she says, grimacing. A shadow crosses her face. “Most of the neighborhood watch just thinks I’m crazy,” she says. “But they do have a point. I don’t even know how we’d go about fixing whatever the hell is wrong with that place.”\nThere’s no way Dean’s going to ruin this woman’s life by confirming that everything she just said definitely does not make her crazy. Instead, he just keeps his eyes on the prize.\n“Humor me here,” he says, “But, assuming this ghost is real, do you have any idea who it could be? Like, who died first, y’know? Who started the chain?”\nJanet swallows, looking at him a little strangely. This always happens near the end of an interrogation, when the witnesses start realizing they’re getting asked probably-not-department-mandated questions. Apparently it goes for new neighbors as well.\n“I don’t know much,” she admits. “There was a fire back in the 70s that ate up a lot of old records in the town hall. I didn’t look much further into things than figuring out the land under the Painter Building- way before the building itself was around- was the center of some kind of property dispute? And I mean this was way back in the day. I only know because the building was named after one of the guys who owned some of the nearby land.”\n“This guy, Painter?” Dean asks, “When was he around?”\n“Before the war.”\n“Number one or number two?”\n“Revolutionary,” she says.\nDean does a double take. “Uh, as in declaration of independence, no taxation without representation, that war?”\nJanet nods, and Dean thinks, oh shit.\n“Well, thanks for the history lesson,” he says out loud, trying not to sound freaked out- look at that, she succeeded after all. He’s never actually fought a two hundred fifty year old ghost before, and they’ve taken way bigger fish than that, but it’s still the kind of info that threatens a migraine and begs for alcohol to temper. His chair scrapes when he stands up. “I’m sure I’ll see you around.”\n“Not at your place,” Janet says dryly, and Dean manages a smile.\nWhen he gets back to Cas, he doesn’t even sit down. He just presses a firm hand into his shoulder, bending down so his mouth is by Cas’ ear.\n“We gotta talk,” he says lowly. In the background, Dean vaguely notices the music change into something slower, more romantic. The lights dim slightly. A bunch of people stand up all at once, and Dean straightens up in surprise. He watches as husbands all around him hold out a hand to their wives, and then the joined couples head towards the dance floor.\nOh, shit, he thinks for the second time in two minutes.\nSandy and Dave walk by, but stop when they get to Dean and Cas.\n“Whenever the lights go down, that’s supposed to be a call to everyone to make their way onto the dance floor,” she says pointedly. “Those that didn’t come with partners pair up, and those that did, well,” she pats Dave on the arm. With her other hand, she reaches out to tap Cas on the elbow. “See you boys out there,” she says cheerily, and then they’re whisking away.\nDean watches them go, and he’s pretty sure his mouth has fallen open.\n“No way in fucking hell,” he says. After a second, he looks down at Cas, scandalized, as if expecting Cas to agree.\nCas, of course, just shrugs.\n“You said you wanted to talk to me,” he says. “No one’s going to interrupt us on the dance floor.”\nDean pinches the bridge of his nose.\n“Dancing isn’t really my thing,” he says, which is maybe the understatement of the century.\n“Sandy seems very intent on integrating us into town life,” Cas says knowingly. “Maybe we should indulge her.”\n“We’re not integrating into anything,” Dean snaps, to remind himself more than Cas. Cas only stares at him until Dean relents with an eye roll. “Fine.”\nCas stands up and holds out a hand, glancing around to make sure there’s no one listening.\n“Dean Winchester, may I have this dance?” he asks. He’s making fun of Dean, but he’s smiling as well. He wiggles his fingers a little bit.\nDean sighs dramatically, but by this point it’s not for much more than keeping up appearances. Cas leads him out onto the dance floor. Dean pulls at his bow tie. “I feel like a dancing monkey,” he mumbles.\nCas ignores him, and when they reach an appropriately empty spot, Cas stops, leaving only a couple inches between them.\n“For what it’s worth,” he says, “I know how to dance.”\nDean snorts. “Yeah, I’m guessing you learned how to dance from the guy who invented dancing in the first place.”\nCas turns their palms so that they’re simply folded around each other, stepping closer and putting his other hand on Dean’s waist. Almost automatically, Dean puts a hand on Cas’ back.\n“Not quite,” Cas says, quieter now that they’re so close. His eyes are dark in the dim light, and they’ve taken on a strange, liquid quality. “I’ve taken no formal lessons. Just… observed.”\nThey start swaying on the spot, and admittedly, Dean feels like kind of a dumbass.\n“Don’t like… dip me,” he feels the need to say. “Or throw me into the air or whatever.”\nCas laughs, and it feels like a private, intimate thing. There’s hardly a breath between them as The Flamingos sing in the background about only having eyes for you.\n“I think the music choice restricts me in that area,” Cas assures him. His hand is so warm against Dean’s waist. “I promise to save my ‘moves’ for another time.”\nDean quirks an eyebrow. “Your ‘moves’?” he asks, amused. Then, less sure, “‘another time?’”\nCas doesn’t reply, just watches him intently. He’s so soft in this lighting. Dean’s heart twists in his chest, swaying along to the music regardless.\nThey’re teetering again. Always teetering, the two of them.\nThere’s almost no space between them. It would be so easy to sway in, to finally let the current take him. He drops his gaze to Cas’ mouth briefly, then loses his nerve and drops it further. He stares firmly at Cas’ chest.\n“Dean,” Cas says.\nHe waits until Dean finally looks up at him. They’re staring at each other, and Dean thinks, now, finally. Something.\nAnd then the song ends, and the sound of a room full of dress shoes taking a couple steps back reminds him of exactly where they are. Some people clap, and Dean rolls his eyes, feeling the tension between him and Cas ebbing away again, diluting among the crowd. He steps away from Cas, dropping both his hands back to his sides. Across the room, he makes eye contact with Sandy, who winks. He smiles weakly back.\n“You wanted to talk to me,” Cas says. “I assume it wasn’t about dancing technique.”\nDean coughs. “Yeah, I… got distracted,” he says. He glances around. “Look, you think we can just go? I got some info and I doubt we’ll get much more from this crowd.”\nCas nods. “I suppose,” he says. “The man I was talking to had a lot to say about gardening, which I appreciate, but was less than helpful when it came to our case.”\n“Awesome,” Dean says, meeting Sandy’s eye one last time and waving. For good measure, he puts an arm around Cas. “Let’s go.”\n***\nOn the way home, Dean fills Cas in on their potentially great-great-great-great-great pal, Painter. Cas texts Sam with the details, and Sam promises to dig up what he can.\nDean’s just locked the apartment door behind them when a tingle goes down his spine.\n“Hey,” he says to Cas, who’s a couple steps ahead, “You feel t-” And then he’s flung halfway across the room, falling painfully on his side. As he struggles to sit up, he sees Cas slumped against the back of the door, grimacing in pain.\nTamping down on the panic mode he always wants to fall into whenever he sees Cas-as-a-human-aka-fragile get hurt, Dean scrambles to the coffee table where he put an iron crow bar just earlier today. They put salt all around the apartment, so Dean grabs the box there and tosses it in Cas’ direction.\nYeah, protective hex bags aren’t gonna do a damn thing against this ghost.\nDean scans the room carefully, but nothing else seems to be out of place. He takes a step forward, and is about to order Cas into the bedroom where he at least hopes the amount of sigils in there will ward it off for now, when he gets tossed again, this time down the dark hallway.\n“Dean!” he hears Cas shout out in panic.\nDean lands on his face and hears something crack in his nose as it hits off the wood flooring. He’s voting for carpet next time.\nHe rolls over with a groan, head pounding and at least a couple ribs bruised from that first hit. When he looks up, there’s a dark figure walking down the hallway toward him. Dean can feel the rage emanating off this thing, and imagines feeling that way for over two centuries.\nIf things with the Mark had gone differently…\nNo time for that line of thinking. Dean tightens his grip on the handle of the crow bar as the thing gets closer. Dean times his swing for when it’s just close enough to him, and as he fights from the floor, he watches as an entire box of salt is upended over its head from behind. It disappears along with the shower of salt, and all that’s left is Cas standing there, empty box in his hand.\n“That’s a little overkill, don’t you think? We only have six million more boxes,” Dean tries to joke, but his vision is swimming a little and his breathing is tight.\nCas bends down in front of Dean, and it looks like there are two of him instead of one, but at least neither of them is bleeding anywhere Dean can see. Both Cas’ reach out to him, but only one pair of hands cup his face.\n“Look at me, Dean,” Cas orders. Dean blinks sluggishly and obeys. Cas first probes carefully at his nose, making Dean wince. Cas murmurs an apology, then just looks into his eyes for a moment.\n“No concussion,” he decides, voice somehow both relieved and tight with worry, “But you need to rest.” He grabs Dean’s arm and hauls him up gently, bringing him into their room. “The sigils will work,” Cas assures him as he helps Dean get in bed, “For another week, maybe.”\n“Oh, great,” Dean says, his injured noise making him sound like he has a head cold.\n“We’ll have it figured out by then,” Cas says firmly, then exits the room.\n“Cas!” Dean hisses. “Cas!” What kind of fucking moron just leaves the one safe zone when there’s an old ass ghost jonesing for a fight just outside?\nCas is back in literally twenty seconds, a damp washcloth in hand. Dean glares at him.\n“Really?” he snaps.\n“Really,” Cas says, sitting on the edge of the bed. He cradles the back of Dean’s head gently as he wipes the blood from his nose away. “Take your shirt off,” he commands next, and normally Dean would complain but he just shrugs out of it tonight, fighting with the fucking suspenders until Cas silently unclips them from his belt loops. He wriggles out of his pants as well because he’s too tired to care, and sits up, sheets pooling at his waist as Cas once again checks out his injuries.\n“I think it’s just bruising,” Cas says, and his fingers on Dean’s side make him think of Cas’ hand on Dean’s waist as they danced earlier. “Maybe don’t sleep on this side tonight.”\n“Thanks, doc,” Dean says. “What about you?”\n“My injuries are superficial,” Cas says, turning off the light and walking around to his side of the bed, shucking clothes as he goes. It’s decidedly unsexy, but Dean finds himself entranced anyway. Also, it’s kind of funny to watch two (now one and a half) Cas’ stripping.\nCas slides into bed, and Dean realizes that not sleeping on the side with the bruises means he has to sleep on the side that ends up with him staring at Cas all night. Cas rolls over so he’s facing Dean, watching him carefully.\n“Don’t you think it’s a little weird that we’re still sleeping in a bedroom in a haunted apartment with a ghost that wants to kill us?” he asks.\n“Wouldn’t it be less weird now that the ghost is here?” Cas asks. “Now it’s just a simple case again.”\nThis was never just a simple case, Dean doesn’t say. Instead, he says, “Yeah, we’ll see.”\nSilence falls between them for a moment, but Cas doesn’t seem interested in turning away like Dean expects him to. Dean can just barely see him blinking in the dark, the moonlight coming in through the window barely washing over his features.\n“Sometimes I wish I was still an angel,” Cas says quietly. “Not because I miss it, but because I could heal you with a simple touch. I could burn that ghost out by merely looking at it, and then none of this would have happened.”\nDean swallows. It had taken weeks for Cas to finally come around after falling. Not that Dean was surprised, since he’s pretty sure species-changes rank pretty high on the “most stressful things ever” list. But he had adjusted eventually, learning how to carve out his own small space in the world like all people do. He likes gardening and stray cats that make Dean sneeze. He likes fabric softener and the Food Network and the Discovery Channel. Earlier this year, he and Dean had watched Shark Week together, curled up on separate ends of the couch for hours at a time, drinking beers and bickering over which shark was best.\nSometimes, he still gets that faraway look in his eyes, and Dean can relate, to an extent. Cas is mourning a part of himself, something that’s gone and never coming back, no matter how many stray cats he pets or how many flowers he plants in the springtime. Dean wasn’t in hell for near as long as Cas had been an angel, but he knows what it’s like to leave something of yourself behind. It’s not something that ever goes away, really, and the emptiness where that piece used to be can’t be filled up by food or beer or sex or even love. Not that Dean’s an expert in coping or grief by any means necessary, (though really, he should be by now with all the people he’s lost) but he did what he could to help Cas through. Tried to explain that though the emptiness was there, it wasn’t the only thing that was there.\n“You’re more than what you’re not, Cas,” Dean had promised.\nAnd he’s stuck to that promise as well as he can. He doesn’t let himself wish for Cas’ mojo anymore. He doesn’t let himself dwell on how Cas used to be able to drop in at a moment’s notice to save the day. When him or Sam get smacked around by their monster of the week, he doesn’t think about how Cas healed him way back when in Lucifer’s Crypt with a hand cupping his cheek.  \nCas has expressed similar regrets before, and Dean refuses to take the bait, like always.\n“The only reason I’d want you to be an angel again is so you could read my mind and know for sure that I don’t care about any of that shit, Cas,” Dean says. “We do how we always do, regardless of a bumped head or a bloody nose.”\n“One day it’s going to be more than that,” Cas says, not as if he wants to contradict Dean, but like he’s stating a sad, inevitable truth of the universe. Which he is.\n“Well, it’s not going to be today,” Is all Dean can offer, because he’s more than aware of this fact as well. So maybe he lied. Maybe he’d want Cas to be an angel again if it meant Cas being able to heal himself, in case it ever came down to it. But that train left the station a long time ago, so Dean does what he always does, and deals.\nDealing, of course, meaning that, not for the first time, Dean wonders what his life- and Cas’, and Sam’s- would be like if their lives weren’t always hanging by one thread or another. If possible death didn’t wait for them around every corner and down every dark alleyway.\nHis epiphany from earlier today nags at him. Yeah, maybe Cas could pass as a legit street magician in Vegas. Maybe Dean still sees black eyes when he looks in the mirror. Maybe they’ll never live that white picket fence life that Dean fantasized about for years. Really, it’s just not feasible.\nBut normality is relative, isn’t it? Dean doesn’t want to have climb into bed every night, thankful that Cas just managed to survive the hunt of the day by the skin of his teeth. As the years have gone on, and the family around Dean has dwindled low enough to count on one hand, he’s found his priorities shifting and re-shifting. It was always about keeping his family together, but then it was about keeping himself together so he could keep the world together. Then for a long time, it was just about the world, and everyone stopped caring about Dean’s little family. They kept it together with shoestring and twine, escaping with barely an inch of wiggle room. But then the world kept spinning, because it didn’t care. It kept taking people away that Dean loved, and he slowly stopped being about the world again. This hunk of rock will keep spinning, he promised himself. Someone will always save it, but they sure as hell won’t save you and your own. \nSo that’s what they tried to do. After heaven and hell got sealed back up like they finally belonged, Dean and Sam and Cas set out to save themselves, and save others and their own.\nThat’s not so bad, Dean thinks. There’s nothing much warmer, or safer, or more normal than the three of them in the Impala, the taste of the interstate in the air and the rumble of the engine below.\nActually, Dean concedes, this here, Cas warm and safe and normal beside him might give the Impala a run for her money (not that Dean would ever tell her that).\nHe falls asleep warm.\n***\nDean wakes early the next morning, and to his very great surprise, Cas isn’t beside him. Dean can probably count on one hand the amount of times Cas has ever willingly gotten up before 10am of his own volition, and when he glances at his phone and realizes it’s not even 7 yet, he can feel the question marks hovering over him like those cartoon birds people hallucinate when they get hit on the head.\nSaid question marks turn to exclamation points when he can’t find Cas anywhere in the apartment, and then bolded exclamation points when he notices Cas’ coat is gone. He grabs his own jacket and shoves on his boots, tromping down the stairs and feeling strangely weird about waking up with an empty spot next to him instead of the human version of a grumpy dumpster cat.\nThe Impala hasn’t moved, and Dean searches around for a while before spotting Cas kneeling by the river behind their building, staring out at it. For about three seconds Dean gets hurled back into the greys and browns of purgatory, the relief he felt thrumming through his teeth and his fingertips and his ribcage at the sight of Cas, dirty and rumpled and alive, crouched by the river that they would eventually use to help guide them home.\nHe shakes his head, because this isn’t purgatory. This isn’t live or die. This is just Cas by a river in a small town in Vermont. Dean knows Cas knows he’s here, but he doesn’t say anything. Dean walks up beside him, standing slightly behind him. Cas’ breath puffs out of him in small white clouds. It’s frigid out this morning, the world frosty. \n“I woke up and you weren’t there,” Dean says stupidly, like Cas should’ve left a note or something.\nCas doesn’t look up at him, just drapes an arm over his knee and lets it swing against his shin. The casualness with which he moves still startles Dean sometimes, despite the fact that even for a long time before Cas fell he was exhibiting a human tick here, a human quirk there.\nAnd before he fell, of course, Cas was star stuff, asteroid dust, God’s dandruff, whatever. The cosmos poured into a jar, taking the shape of whatever container it occupies. Even though Dean may not always have seen it, Cas has always flowed.\n “I should have left a note,” Cas says, “Sorry.”\nDean says, “Oh,” because being on the same wavelength with Cas is weird. He sighs and stretches, the cold air making his eyes water. “What are you doing out here so early? I didn’t even know you were aware there was a 7 in the morning.”\n“I woke up… agitated,” Cas says. “I came out here to walk it off.”\n“What, did I kick you in my sleep or something?” Dean asks, even though he’s really saying “what’s wrong?”\nCas turns back to look up at him, but doesn’t say anything. Finally, Dean gives in and scuffs his boot on the ground, then parks himself next to Cas, freezing his damn ass off.\n“You’re very warm,” Cas tells him, like he’s talking about the weather. “It was strange waking up to.”\nDean bites the inside of his cheek for a moment.\n“Weren’t you the one who said this didn’t matter because we’ve already done this a million times before?” he asks.\n“I was,” Cas agrees, “And we have. I didn’t realize it would be… different.”\n“Different how?”\nCas definitely knows the answer to this question, and Dean probably knows the answer to this question, but neither of them answer it.\nThey sit together and watch the frozen river sludge its way to its destination.\n***\nThey meet up with Sam again at the Italian place, and he comes prepared. He lays a crapload of old photocopies of various records from the town hall on the table in front of them, watching Dean pointedly. There’s a lot to sift through, but there’s still a bunch he couldn’t get his hands on because of the fire back in the 70s.\n“Thought it wasn’t a good idea we meet up while you two are working on your whole… charade,” Sam says innocently.\n“Yeah, well, this ghost is pissed and we need all hands on deck. Easier to do research over tortellini than the phone.”\n“Oh, now you wanna do research.”\n“No, now I wanna deck you.” Dean dramatically picks up his menu and starts turning pages. “But far be it from me to make a scene in a wholesome family restaurant.”\nSam smirks at Cas, “Guess you’re a good influence on him.”\n“Shut up,” Dean says.\n“Actually,” Cas says, “If you recall, it was Dean who convinced me to rebel against the entirety of heaven and everything I’ve ever known to help you two stop the apocalypse. If anything, Dean has been a good influence on me.”\nSilence falls over the table, Sam grinning like the cat who just the cream, and Dean staring fixedly at the salt and pepper shakers while his cheeks redden. Cas stares out the window, blasé as ever. As if rebelling against the entire host of heaven based on faith in one human is just a normal thing to do.  \n“Aw,” Sam says, grinning at the two of them.\nDean shakes the salt shaker at his brother, covering Sam in little white beads.\n“Away, demon,” he says flatly.\nSam flicks a grain of salt off his shoulder, but doesn’t stop grinning.\nAt that same moment, a friendly voice says, “well, hello there, gentlemen!” and it’s the same waitress from last time, smiling brightly at them. “Welcome back!”\n“Hello again,” Cas says, smiling gently, while Dean gruffly nods and Sam continues to pick salt off himself.\n“Have you two settled in yet?” the waitress asks as she pours water into their glasses, glancing between Dean and Cas. Her question is obviously an innocent one, but Dean finds himself caught off guard that somehow she managed to suss out it was him and Cas doing the renting. The implication that the two of them give off the impression of being together is terrifying, despite the fact that was exactly what they were going for. Dean’s palms start to sweat.\n“Who says it was us doing the renting?” Dean asks a little too aggressively, and immediately feels bad because the waitress’ face turns a deep red, and she tucks a strand of mortified hair behind her ear.\n“Oh my god,” she says, “I’m so sorry, I didn’t mean to presume- I just thought the two of you-” she swallows, “God, sorry, I shouldn’t have- shouldn’t have assumed.”\nDean gets twin kicks from Sam and Cas under the table, and tries to plaster a reconciliatory smile on his face. He clears his throat.\n“Hey, don’t worry about it,” he says, much softer. He takes a deep breath, glancing at Cas beside him, who’s watching him patiently. “You were right, but we were kinda planning on taking that part slow. New place new town, y’know?”\nThe waitress nods furiously. “Gosh, no, of course,” she says, still deeply embarrassed. She shakes her head slightly, digging in her apron for a notebook, fumbling it as she pulls it out and flips it open.\nShe takes their orders after that, Dean trying to be as not-gruff as possible when he tells her he wants the cannelloni. Cas taps his toe to Dean’s shin much lighter this time, just briefly, and Dean catches himself staring into the middle distance as Sam orders something with the word “parmesan” in it.\nAfter she leaves, Dean watches her duck desperately back into the kitchen and he feels like even more of an ass. Across the table, Sam shakes his head.\n“You really need to chill,” he says. “Holy crap.”  \nInstead of arguing, Dean just says, “Trust me, I know,” and stares down determinedly at the town hall records. His chest unclenches just a little when Cas’ foot gently bumps into his own and stays there for the duration of their meal.\n***\nThe records turn out to be useless, which, no surprise there. Once their waitress comes back with their check, she hovers briefly, biting her lip. She looks at Dean again.\n“Um, I just wanted to say,” she says nervously, “Highbury isn’t perfect or anything, but it is nice.” She shoves both her hands in her pockets, and looks down at her feet for a moment, as if gathering her nerve. When she looks back up, her whole face has changed. It’s gone soft and reverent, and she smiles like she’s thinking the happiest thoughts in the universe. She says, “My girlfriend and I love it here, and I think you will too.”\nBefore Dean can say anything to that, she nods at all of them and wishes them a good night, and then takes her leave. As she walks away, Dean sees her slip her phone out of her apron and start typing away. It’s not too difficult to guess who she’s texting.\nDean looks at Cas, and Cas is looking right back at him. Obviously their waitress wasn’t the only one feeling soft and reverent tonight, and Cas’ gaze makes Dean’s chest tight.\n“That actually was really sweet,” Sam says seriously as he slides out of the booth. “Guess she decided you weren’t a heathen after all, Dean.”\n“It really was,” Dean finds himself agreeing as he digs out his wallet. He makes sure to leave a very generous tip.\nCas says he has to go to the bathroom, so Dean and Sam head out to the Impala, freezing their asses off between the restaurant and their parking spot. Once they’re inside with the heat cranked and Dean’s still rubbing his hands together to try and generate some friction, he peers inside the diner and notices Cas speaking to their waitress. They’re off to the side, and his head is down like they’re keeping their voices low.\n“Bathroom my ass,” Dean says.\nHe waits until they drop Sam back off at his motel, and on the deserted stretch of highway back to town, he pulls off on the shoulder of the road, the engine clicking in the sudden silence. He stares out the windshield as he says, “I saw you talking to that waitress back at the diner. What’s up?” He’s not sure why he felt the need to pull the car over for this conversation, but since he did, he lets his gaze swivel towards Cas and hold. In the dark, Cas looks almost ethereal. Dean feels the stirrings of lightning under his fingernails.\nCas turns towards him, and a shaft of moonlight plays over his face, washing out his color. His eyes go arctic blue, just like they do in bright sunlight. It’s just Dean’s mind playing tricks on him, but this looks like Cas the angel, not Cas the human. Not that it ever seems to matter, because Cas will always be Cas and Cas will always be it for Dean, no matter his species, no matter how hot his own face gets when he thinks about it all too hard.\nBut for what it’s worth, Cas the angel had never rocked third day stubble.\n“I was just curious,” Cas says thoughtfully, though his words carry a very specific kind of weight. “I asked her what led her to believe that we were together, under the guise of us still wanting to keep things ‘low profile’.”\n“And?” Dean asks, suddenly nervous. His entire relationship with Cas flashes before his eyes, and he wonders if everyone’s been able to see it all this time. If he’s worn it as plain as the clothes on his back, as obvious as the handprint on his shoulder.\nCas tilts his head, a small smile pulling at his lips.\n“She said it was how we looked at each other,” he says, “how we moved around each other, like it was the most natural thing in the world. How you put an arm across the top of the bench and your fingertips were mere inches from the back of my neck, and we were both intimately aware of that fact. How I stole a bite of your food without asking and you only half rolled your eyes, and fondly…” his smile turns mischievous. “How you checked out my ass when I got up to use the washroom before we left.”\nDean makes a strange sound in the back of his throat. “There’s no way she said all that,” he says hoarsely, his heart fluttering against his ribcage. He doesn’t deny any of it, though.\n“I may have embellished slightly,” Cas says, deadpan.\nDean watches him for a long time, unsure of what to say. So eventually, he just nods and says “okay” and then starts the car again.\nOn the way home, Cas puts his arm across the back of the seat, and his fingertips ever so gently brush the nape of Dean’s neck.\n***\nThey spend the next couple of days skirting around the Painter building, trying not to get their faces ripped off by any pissed ghosts. Technically, ghosts are just as powerful during the day as they are at night, but any serious activity in the daylight is unlikely. Ghosts do have a penchant for the dramatic, after all. Especially ones that have stuck around for as (potentially) long as this one has.\nThey talk to the people on the other floors, and other than a handful of stories similar to what they’ve already heard, they find nothing new. But from what they gather, no serious incidents have occurred lately, which both relieve and worry Dean and Cas.\n“It could be gearing up for something big,” Dean says, back in their apartment. “Quiet before the storm kind of thing.”\n“It could also just be focused on us,” Cas says. “It might see us as more of a threat.”\nThey’ve since painted sigils all around the apartment, and it seems to have worked to an extent. Dean swears he’s lost his razor and Cas is missing a shoe, but other than that they haven’t had a visit from the ghost since the first night.\nBetween research sessions with Sam, they think that this guy Painter must be the ghost. Thanks to Sam sweet talking a librarian from the next town over who apparently holds some kind of grudge against Highbury’s library, they managed to gather at least a little bit of intel on their guy. Back in the early 1700s, when land was still being settled and towns still being formed, there was a big disagreement in this county who, exactly, would have the village center on their land. Apparently, it was a wildly competitive race, with potential owners fighting and trying to off each other at every turn. There was a ton of backstabbing, a ton of in-fighting, and a ton of threats that may or may not have ended up turning out to be legitimate.\nPainter won the land in the end, and his hands were probably the dirtiest. Not long after winning the land, he too mysteriously vanished, most likely murdered by those he had wronged.\nThe only problem, of course, is that’s where the trail goes cold. And even if they knew where he was buried, there would be nothing to dig up because a body that old would have completely decomposed by now. Generally, Sam and Dean have found over the years that if a spirit is attached to a body, that body has to be reasonably intact for it to happen.  \n“There has to be something,” Dean says, dragging a hand down his face. “Something that got passed down through the family, or a lock of hair, or a goddam toenail. Ghosts can’t exist without being tied to something.”\n“Painter had no siblings, no nieces or nephews. No children, no wife. He was the last of his line,” Cas says. “He wouldn’t have had anyone to pass anything down to.”\n“No official children,” Dean says, “That doesn’t mean he didn’t have ‘em.”\nCas is silent for a moment before saying slowly, “What about something more intangible?” He looks pointedly around the room. “This building carries his name, after all. And as far as the research says, there were no suspicious deaths here before the building was built.”\n“Could be something,” Dean agrees, “But it could also just be the fact that it’s hard as hell to find records of anything that old and that obscure.”\nCas glances out the window at the darkening sky, sighing.\n“Whatever it is,” he says, “We need to hurry up and find it.”\nPerhaps ominously, a knock on the door punctuates Cas’ statement. Sam’s officially Not Allowed at the apartment, just in case, so it’s definitely someone they probably don’t want to see. Dean looks nervously around the room, not wanting anything to potentially raise any eyebrows. All the painted sigils are hidden behind furniture at least, but Dean grabs the crow bar on the table, sliding it under the couch and just out of the sight.\n“Just a second!” he yells towards the door as he waves at Cas to help him grab the boxes of salt they had on the table, shoving them into a still-empty cupboard in the kitchen.\n“Go close the bedroom door,” he tells Cas, another precaution. The sigils are way more obvious in there, and they still have salt lining the windows and doorway.\nCas disappears down the hallway and Dean opens the door to find Helen on the other side. She’s not near as perfectly coiffed as she was a couple days ago, and though she looks like she’s trying to cover up some severe exhaustion, Dean can still see the bags under her eyes.\n“Leo!” she greets, and there’s a slight pull to her voice, “How are you tonight?” Her eyes flick over his shoulder, glancing into the apartment.\n“Hey, Helen, we’re good. What can I do for you?” He steps back to give himself some room, but Helen misinterprets it as an invitation, smiling at him as she walks in.\n“The place looks great,” she says, looking around, “Didn’t take you long to settle in at all.”\n“It didn’t,” Cas says, emerging from the hallway as he joins the conversation. “How are you, Helen?”\n“I’m excellent, thank you,” she says, and Dean feels his expression turn doubtful. “I just wanted to check in on you two, make sure you were adjusting okay. Did you have any questions? Was there anything you needed?”\nDean glances at Cas.\n“I think we’re good,” he says, “Thanks. We went to that monthly neighborhood watch thingy the other day and everyone-” Bit of an exaggeration, but whatever- “was really, uh, welcoming.”\n“Oh,” Helen says, tone cooling. She nods, as if in understanding. “Let me guess,” she says, “Sandy and Dave?”\n“They invited us, yes,” Cas begins, and he’s about to say something else but Helen cuts him off.\n“You’ve gotta be careful with that lot,” she warns the two of them, and Dean feels his eyebrows rise when he sees a genuine spike of malice behind her eyes. “They’re not good for much more than fear mongering and trouble stirring.”\nDean thinks about everything Janet and the other residents of the Painter building have told him.\n“Huh,” he says innocently, “They seemed a little argumentative, maybe. I mean, to me, politics is mostly squabbling anyway, but they had good intentions as far as I saw.”\nHelen’s mouth twists slightly.\n“I don’t want to overburden you with our town’s silly little disagreements in your first week here,” she says, with somewhat forced sweetness. She keeps trying to get a better look at the apartment, and Dean thinks, yeah, definitely scoping the place out.\nHe shouldn’t be surprised, honestly. Evil landlord is right up there with mustache twirling villain. Isn’t there some kind of urban legend about the little old landlady who spikes people’s drinks with cyanide? Dean’ll have to write this one down for the Men of Letters’ playbooks for sure.\nDean holds up his hands genially. “Hey,” he says, “No worries. We’re still learning the lay of the land, right babe?” He shoots Cas a tiny, significant look, but all it takes is a blink in return and Dean knows Cas is in on it.\n“Right,” he says, tensing up just slightly.\nHelen nods, seeming to feel the tension in the room that just ratcheted up.\n“I’m sorry to intrude like this,” she apologizes, “I didn’t want to interrupt you if you were working.”\n“Uhh…” Dean was expecting some kind of pointed remark that would lead to an inevitable showdown where he and Cas get the info they need from her to gank the ghost and get the fuck outta dodge, but apparently his brain is moving way faster than the rest of this conversation. “Nnnnno,” he says awkwardly. “You didn’t.” He throws a confused glance Cas’ way, and Cas shrugs slightly.\n“I have to admit,” Helen says, “I had an ulterior motive for visiting tonight.”\nOh, okay, this is it. Dean flexes his fingers. She’s just a little late on the delivery is all.\n“I was hoping to get my plate back,” she says. “From the lemon squares?”\nFor two seconds Dean is convinced that “lemon squares” is a code word that’ll like, sic a ghost on them or something, and then he remembers that the first day they moved in she actually gave them lemon squares.\n“… oh,” he says after a long pause. Somewhere out there in the universe, a record is scratching dramatically. “Uh… Yeah. I’ll grab it for you.”\nHe takes the clean plate out of the dishwasher (the squares themselves were actually really really good) and brings it out to her.\n“Thanks,” he says to her, almost making it sound like a question. “They were great.” Is he complimenting an evil or just nosy landlord’s baking?\nHelen smiles tiredly at them. “I hate to intrude,” she says again. “I really hope I didn’t interrupt anything.”\nSince she seems so worried, Dean plasters on a fake smile and puts an arm around Cas. “Are you kidding?” he says. “After nine years together I’m still convinced this guy just plays Minesweeper all day.”\nHelen’s brows briefly draw together and at the same time, out of her view, Cas pinches the back of Dean’s arm, hard.\n“Leo’s not so great with numbers,” Cas says smoothly, “Honestly, sometimes I think he mistakes my spreadsheets for a computer game.”\nDean’s about to protest, but Cas snakes an arm around his waist and keeps a grip tight enough to let Dean know to keep his mouth shut.\n“Thanks for stopping by, Helen,” he says, dragging Dean forwards with him as he ushers her towards the door. “It was kind of you to check up on us.”\n“Okay, well, let me know if you need anything else!” she says, and there’s still that slightly off-note to her voice that registers strangely to Dean.\n“Good night,” Cas says, and then he’s closing the door.\n“Dude, what the hell was that?” Dean snaps, rubbing his arm.\nCas holds out a hand, ear pressed to the door. After a moment, he glares at Dean.\n“Nine years?” he asks, “Really? Because a couple of days ago, it was eight years.”\nDean rewinds the conversation, mentally smacking himself over the head.\n“Oh, shit,” he says. “You think she noticed?”\n“She noticed,” Cas says flatly.\n“Well. Ugh. Fuck, Cas, I was a little too busy thinking we were about to get torn apart by her or her pet ghosts or whatever. Tell me you weren’t getting that super sketchy vibe too?”\n“Of course I was, Dean. But it’s going to be more difficult to get information from her because now she knows something’s up.”\nDean throws his hands up in the air, more annoyed at himself than Cas, “We can go make out in front of her right now, Cas, huh? How about that? Maybe that’ll bring her back over to our side.” As he speaks, he knows his eyes involuntarily flicker down to Cas’ mouth. He swallows.\nCas watches him darkly, and Dean feels that familiar electric magnetism pulsing between them again, like it tends to do. The air practically vibrates with it. Without him even realizing, Cas has backed him up against the door, standing less than a foot away.\n“You think that’ll convince her?” he asks, voice low, almost suggestive. Dean’s heart picks up the pace.\n“Maybe it’s not her that needs to be convinced,” Dean says quietly.\nFor a brief second, Cas pulls back slightly, blinking at him owlishly in the semi-darkness of the apartment. Then, his gaze narrows in on Dean’s, intent clear. He leans in, and when their mouths are inches from touching, the lights suddenly flicker, and the lamp over in the corner blows out with a bright spattering of sparks.\nDean’s immediately heading for the couch to grab the crowbar, but Cas grabs his arm before he can go any further.\n“Wait, Dean,” he says, and sounds more frustrated than anything else.\nDean tries to pull away, “Dude, we have company,” he says, panicked, gesturing at the lamp.\nCas rolls his eyes.\n“It wasn’t the ghost, Dean. It was my mistake.”\nDean stops pulling away from Cas, but Cas still holds onto his arm.\n“What?” he asks, confused.\nCas sighs. “Consider it part of my ‘magic tricks’,” he says, sounding put out. “It happens sometimes.”\nDean stares at him.\n“You just been randomly blowing fuses for over a year?” he asks. “And have somehow failed to mention this?” He thinks back to tiny little things that have happened since Cas fell. The lights in the bunker flickering once or twice, his new alarm clock fizzing out after only a week, the bulb in the fridge that stopped working.\nCas shrugs. “It took me a while to figure out I was even the cause of it, and then I just… dealt with it,” he says.\nDean continues to stare at him. Finally, he huffs a laugh. Cas lets go of his arm, and the tension dissipates.\n“Y’know, if we paid an electric bill for the bunker, I’d send it to you,” he says.\n“I would just use our money to pay it, but I appreciate the gesture,” Cas says.\nDean snorts. “You and sparks,” he says fondly, “Ever since first meeting in that barn. Always a flair for the dramatic.”\n“I tried to keep it as low-key as possible,” Cas assures him dryly. “I know how you are about surprises.”\n***\nThey invite Helen to dinner. Since they aren’t quite 100% convinced yet that she’s an evil hellbeast or witch or ghost or whatever, they have to lie low on the threats for now, and see if she’ll give anything up either by accident or involuntarily.\nIf she’s not a hellbeast at all, then their only goal is to prove to her just how A-grade-farm-fed legitimately her two newest tenants actually are in a relationship.\nDean’s much more afraid of the second option, mostly because he has way less experience with it.\nThey both stand behind the door in the silence after her first knock. She’s exactly on time.\nDean takes a deep breath. “Ready to play?” he asks, straightening his sweater nervously. He honestly never thought he’d see the day where both him and Cas were wearing sweaters.\nCas nods, stepping fractionally closer to Dean. The warmth he brings with him relaxes Dean, and the hand on his lower back is startling at first, but Dean quickly finds himself leaning into it.\nThis is good, he thinks. Helen’ll eat this up.\nThey had discussed earlier in the night how exactly to play their cool-not-cool game.\n“What do normal couples do?” Cas had asked, arms crossed, like he knew this was a futile endeavor. (It is, because Dean and Cas have never been anything other than Dean and Cas.)\n“Shit, I don’t know,” Dean had said, and that was very quickly the end of that.\nDean barely has time to register how nice Cas’ hand feels right where it is before Cas is opening the door and inviting Helen inside with a smile. She still looks exhausted, like she’s been up all night doing landlordy (or evil) things. Obviously oblivious to their suspicions, she graciously offers up a large bowlful of Caesar salad.\n“For the lasagne,” she says. “You said you were making lasagne, right?” \n“Uh. Yeah, of course,” Dean says, deciding to be polite and resist stating that putting that much meat and cheese next to that much greenery is just unholy. (He catches a whiff of the dressing as he puts it in the fridge, and maybe that changes his mind. A little. In fact, Dean may have come around to the fact in the past few years that not all green things are terrible, but he knows that if he doesn’t hold this grudge against salad until the day he dies, Sam will become absolutely impossible to deal with.)\nCas walks her into the living room, offering her wine. As Dean lurks in the kitchen, he listens to Cas smoothly cajole her into a glass. He really is slick when he wants to be. Dean pulls three glasses out of the cupboard (they had to go buy a matching one today for the occasion) and waits against the counter for Cas to walk in.\n“Smooth,” he says quietly, and the corner of Cas’ mouth ticks up.\n“I figured alcohol may loosen her tongue a bit,” he shrugs, taking the wine (another purchase from today) and filling each glass about halfway. He lightly bumps Dean’s hip with his own. “We shouldn’t linger too long.”\n“Yeah,” Dean says, “She might think we’re up to something.”\nHe gets a soft laugh for that, and Dean can’t help but smile.\nThey keep the topics neutral for the majority of before dinner conversation. The smell of lasagne starts to waft through the apartment, and soon enough Helen is sniffing at the air, obviously excited.\n“That smells delicious,” she says, “Goodness, maybe you should have been making me the lemon bars.”\nDean’s about to laugh and brush her off, but before he can Cas steps in, putting a hand on Dean’s knee. Dean’s suddenly so focused on that point of contact that he barely hears Cas say, “He really is, though sometimes he’s too modest to admit it.” He looks at Helen as if he’s sharing a secret with her, “He loves to remind me all the time, though. It’s how he gets me to always do the less exciting chores.”\nHelen laughs, and Dean wonders if there’s an award for best fake boyfriend out there because Cas would probably get it. He lays it on thick, but it never comes off like he is. He sings Dean’s praises and shares sly looks with Dean and touches him in all the ways that make Dean warm. Dean does his best to keep up, and with the way Cas keeps looking at him and the way Helen is looking at the two of them, he thinks he might actually be making this work.\nWhen the timer dings to say that the lasagne is fully cooked, Dean presses a hand to Cas’ shoulder as he gets up.\n“I’ve got it,” he says warmly. Then, to Helen, “We don’t actually have a dining room table, or a dining room for that matter.” He scratches the back of his neck awkwardly, “Would you mind just eating here for tonight?”\nHelen, who’s already on her third glass of wine, says, “Of course not, dear! Please, I’m very eager to try it.”\n“Okay, then,” Dean smiles, first at her, then at Cas. “I’ll bring it right out.” And maybe it’s because everyone is so eager to eat what he’s made, or because he’s just pretty happy in general right now, or because he’s not thinking at all, but Dean leans down and pecks Cas on the lips, just because he thinks he should.\nThe press of lips is brief, chaste, hardly something inappropriate for current company. It’s the exact kind of thing a “normal” couple would do, Dean’s almost positive. Of course, they’re not normal. And Dean just kissed Cas. His throat tightens and his lips tingle and his face flushes. A moment of wordless communication passes between them, Cas’ eyes wide and glued to his, mouth slightly parted, and Dean has to be the one to pull away before this starts to look weird. He escapes to the kitchen and grabs the lip of the counter, silently freaking out. Out in the living room, he hears the conversation start up again, haltingly on Cas’ side.\nHe slumps against the counter, prepared to really flip out, and then another ding! from the impatient oven timer interrupts his thoughts. He scrambles to get it out before the cheese browns too much on top, and as he’s doling pieces out onto the nicest plates they could find on short notice, he keeps thinking about Cas’ lips on his own.\nWe’re just playing the part, he tells himself feebly. He feels almost slightly nauseous, nerves ringing. Maybe he’s been thinking about the something happening between them for so long he forgot what would actually get done once said something happened. All because he slipped up on a case.\nOh, fuck.\n“Leo, you need any help in there?” Cas calls, and Dean rolls his eyes at the pointed use of his fake name.\n“I’m good, thanks,” he calls back, trying not to sound too choked as he takes a few deep breathes. He’s fine. He’s cool. He’s collected. Partners kiss each other all the time, and him and Cas are supposed to be playing partners. Easy as that.\nPredictably, Cas ignores him. When Dean feels a soft hand on his waist, he almost upends three plates of lasagne onto Cas’ torso, and only manages to right himself because Cas steadies him with an palm cupped around his elbow.\n“Should I just start wearing a rain poncho all the time?” Cas asks, teasing. Closer to Dean than he should be. “First the paint, now this.”\nDean pulls out of his grip. “What do you think ‘I’m good, thanks’ means?” he hisses. “We can’t keep holing up in here or she’s gonna think it’s weird.”\nCas raises an astute eyebrow. He’s not an idiot. He can read the embarrassment on Dean’s face like his every emotion is spelled out in flashing lights above his head.\n“I highly doubt a couple taking a moment’s reprise from entertaining will send up any alarm bells, Dean.”\n“What happened to not lingering?”\nCas gives him a look. “I came in here to make sure you were… okay,” he finishes, even though Dean suspects that’s not the word he wanted to use.\nDean backs down, setting the plates of lasagne back on the counter.\n“Yeah,” he says awkwardly, folding his arms across his chest. “Sorry about that. I kind of sprung it on you. I wasn’t thinking and-”\nCas’ face works through multiple expressions for a moment, finally seeming to settle on faintly amused. He puts a solid hand on Dean’s arm. “It’s fine, Dean,” he assures him. Before Dean can say anything, Cas is right up in his space, putting his hands on either side of the counter, bracketing him. He leans forward, slotting his mouth against Dean’s, sweet and warm and much less chaste than the last one. It takes Dean’s brain maybe a second and a half to catch up with his lips, and then just as he’s finally kissingCasbackholyshit Cas pulls away, smirking at him.\n“Now we’re even,” he says archly, leaning around Dean to grab the salad bowl off the counter. Without another word, he brings it out into the living room.\nDean gives himself exactly ten seconds to punch the air and run a hand down his face, making sure it didn’t just melt off or something and this isn’t some kind of dying death wish dream. When his face doesn’t fall to the floor, he grabs the lasagne and follows Cas back out to the living room, probably looking like he got run over by a truck full of Valentine’s Day merchandise in the last couple minutes.\nDinner goes well, and Dean and Cas subtly continue to interrogate Helen, though by the time they’ve all finished the bottle of wine and are happily cracking open a new one, she hardly needs any prodding to talk. Every once in a while she’ll wince when Dean and Cas mention certain murders in the building over the years, but get absolutely no reaction at the mention of Connor Painter or the origins of the town.\nAt the end of the night, as they’re carefully walking a somewhat unbalanced Helen to the door, she turns around to grasp each of their hands separately.\n“Thank you,” she slurs, “t’you so much. Y’er both so…” she hiccups. “Delightful.” She grabs Cas’ hand and grabs Dean’s hand, and then puts them on top of each other. “Y’love each other s’much,” she smiles, “It gives hope to t’rest of us.” She turns to go, using the doorframe to guide herself out into the hallway, and after a moment of stunned silence, Cas mumbles, “I’ll make sure she gets upstairs okay,”, grabs the keys, and closes the door behind him.\nDean stares at the back of the door for a solid thirty seconds, before he robotically collects the plates from the living room table and brings them back into the kitchen. He scrubs them by hand instead of putting them into the dishwasher, needing something to do with his hands as his brain fizzes and pops, about as useless as a crumpled tissue.\nHe doesn’t even register the sound of the apartment door opening, and then Cas is back, suddenly at his side and wordlessly drying the wet plates and silverware.\nDean can feel the tension mounting between them, like a storm about to break. Cas has been fairly non-chalant about this whole thing, but Dean kissing Cas by accident and then Cas kissing Dean and Dean kissing back? That’s a whole other can of worms. Sure, Dean felt like he could lift an entire car over his head in the moments after said kiss, but that hardly translates to the real world. He has to keep reminding himself that none of this is real. That, yeah, maybe there’s something between him and Cas, and that’s okay, but acting on that something? That’s dangerous. It’s been fun playing house, and Dean’s not dense enough to pretend that he doesn’t like it, that he doesn’t like it with Cas. But their reality is so far removed from this. He tried to bridge it with the speech about normal being relative, but it all suddenly feels like such bullshit he doesn’t know what to do.\nThe longer the silence goes between them, the clumsier Dean’s washing becomes. Eventually, Cas has to put the plate he’s trying to dry down with a sigh.\n“There’s an entire noodle still stuck to this plate,” he says patiently to Dean.\nInstead of replying like a normal (there’s that word again) person, Dean puts the knife he was just trying to clean down with a clatter, dropping his head and gripping the counter with both hands.\n“This is bad news, Cas,” is all he can say. Despite his reasoning for putting an end to this being totally stalwart and true (it is, he’s positive, because he doesn’t know how to think about things any other way), it’s also surprisingly hard to put into words. Maybe because there’s a million reasons it would never work between them. Maybe because there’s zero.\nDean’s good with the flirting, with the unsaid stuff. Bad with the cliff these things are always, inevitably heading towards. That’s why, initially, he didn’t even want to take the case.\nHe tries not to think about how him and Cas sailed off that cliff a long long time ago, and are somehow still going.\nBeside him, Cas stills. He doesn’t look at Dean, because suddenly this isn’t a joke anymore. His jaw tenses, and he very slowly puts his plate down on the counter. He doesn’t say anything, just walks out of the kitchen. The front door opens and shuts- it doesn’t slam, it just shuts with the same click it always does- and Dean is standing alone in the apartment.\nFor thirty seconds he debates with himself, mostly repeating with Cas or without Cas because that’s the best his brain can come up with at the moment. Once he decides with Cas, as if it were ever a question, he curses, grabbing their keys from the hook by the door and heading out into the hallway.\nHe’s just about to head down the stairs and look for Cas in the parking lot, when he hears a shrill scream from somewhere above him. Hunter’s instinct kicking in, he turns around and pounds up the stairs, following a second scream to the apartment in the corner of the fourth floor where he knows Helen lives.\n“Helen!” he shouts, throwing himself against the door. “Helen, hang on!”\nOn his third try, the door bursts open and he stumbles directly into the middle of a hurricane. Papers, tissues, glasses, even a chair are swirling around the room at a nauseous rate, wind blowing fast enough that Dean can barely catch a breath. In the middle of the chaos, Helen is slumped on the floor, arms covering her head. Dean runs to her, dodging the errant chair along the way. A couple pieces of paper catch him across the face, and he can feel them slice at his cheeks and forehead. Once he arrives at her side, he bends down, pressing a hand to her back. He tries to pull her up, to escape the room with her, but she’s become dead weight, impossible to lift.\n“Helen, c’mon,” Dean says loudly to her, “You gotta work with me here.”\nHe doesn’t even think she can hear him with all the wind surrounding them, and Dean despairs as he searches the room urgently, trying to find some way of switching everything way off. In a shadowy corner of the room, he spies the same dark figure he saw in his and Cas’ apartment earlier in the week, watching him malevolently. He’s about to get up to try and grab salt, iron, anything that’ll slow it down, but as he stands the chair that’s still flying through the air changes direction completely and whirls towards him, forcing him to dive to the ground again to avoid being hit.  Once he’s on the ground, he has to roll out of the way as a set of steak knives aim for him, just barely missing them as they dig into the carpet next to him with loud thunks. The figure continues to stare at him, and it seems to bristle with indignation as it sends a couch cushion flying hard enough at Dean that he actually gets major airtime as he’s knocked backward into the wall.\nAnd then, an iron bar is coming down fast and swift between the figure, forcing it to disassemble.\nEverything stops.\nPapers flutter back to the floor. Silverware falls with a thud and a clatter. The chair scrapes the tile in the kitchen.\nStanding where the figure just was is Cas, breathing hard, iron pipe from their apartment in hand. He scrambles over to Dean, putting one hand on his neck and the other on his shoulder.\n“Are you okay?” he asks brusquely, searching Dean’s face. Underneath the gruffness, Dean can hear the worry clear as day.\n“M’fine,” Dean grumbles, shoving at the cushion where it’s landed beside him. Other than having the breath knocked out of him and a face that stings, he actually is.\nCas gives him a hard look before retreating and checking on Helen, speaking to her in quiet tones. One step at a time, she unfurls, and soon Cas is leading her down the hall and into her bedroom.\nAs Cas obviously has The Talk with her- or a version of it, at least, since Dean has no idea what the deal with their cover is anymore- Dean attempts to clean up the apartment as best he can. He puts the chair rightside up again, reassembles the couch, slots the steak knives back into their block on the kitchen counter. He has no idea what to do about all the papers, and just ends up gathering them in one big pile and leaving them on the coffee table. Cas still isn’t out of her room yet, so Dean paces up and down twiddling his thumbs.\nEventually, Cas emerges from the room with Helen, pale faced and twitchy, in tow.\n“Helen is going to sleep in our apartment tonight,” Cas informs Dean, and Dean just nods, grabbing her keys from the counter and following them back downstairs. Once they enter the apartment, Cas tries to lead Helen to their bedroom, but she pulls back. She’s still obviously a little inebriated, but Dean knows that a tangle with a spirit like that goes a long way to sobering you up.\n“I’ll take the couch,” she says, and when Cas looks like he’s about to argue, she holds up a hand. “Please don’t let me intrude on you anymore. I just need somewhere to rest.”\nThey get her settled on the couch- which, surprise! Is a pull-out- and before they can even offer her a blanket, Helen has passed out on the mattress, obviously exhausted. Cas grabs a blanket from the Impala to lay over her, and according to him there were more than a couple tenants poking their heads out of their apartments on his way out and back.\nAs they settle into bed, Dean asks, “D’you think we should be worried? About the other tenants?”\nCas shakes his head. “These recent attacks have been violent, but don’t seem to occur in rapid succession. For tonight, everyone should be okay.”\n“We’re running out of time for this,” Dean says. “We gotta figure out what the hell to salt’n’burn and hurry.”\n“We do,” Cas says, and then rolls over, effectively ending the conversation. Dean knows a cold shoulder when he sees one. He lies there in the dark, staring at the ceiling. He’s not thinking about this dumb fucking case. He’s not thinking about what an actual, true blue domestic life would feel like. He’s just thinking about Cas. Working cases with Cas, living in a house with a white picket fence with Cas, it doesn’t matter. Only Cas does.\n“I was going after you,” he admits a couple minutes later. Cas doesn’t roll back over, but Dean can see how the lines of his back go taught. “I got side-tracked by our buddy with violent tendencies upstairs, but I was on my way to you,” he says.\nCas very slowly rolls over to look at Dean in the dark.\n“I was,” Dean insists, though he knows Cas already believes him. He hesitates for a moment, then forces himself to swallow it as he cups a palm to Cas’ cheek. Cas doesn’t turn away, which is good. “I shouldn’t have let you go all those months ago,” he says. “I shouldn’t have let you just walk out of the bunker.” He lets out a breath. “And tonight, I wasn’t going to let you go. Not again.”\n“Not even if it’s bad news?” Cas asks, with somewhat of a wry undertone.\n“Fuck, Cas, honestly, I don’t care what kind of news it is. I just want to read it.”\nCas watches him for a long time without saying anything. Dean’s head spins in about a thousand different directions, convinced that they’re finally out of gas, they’re going down.\nAnd then, almost casually, Cas says, “Frankly, Dean, not having to hide my feelings for you has been very… refreshing.”\nAnd then Dean says, “What?”\nAnd then Cas says, “I love you,”\nAnd then Dean says, “What?” and then stammers out, because he’s a jackass sometimes, “like… fake-boyfriends fake-love?”\nAnd Cas glares at him and says, “Don’t play dumb.”\nAnd Dean sighs, and processes that, and churns it through all the cogs in his brain. What said brain comes up with in response is, “I love you, too. Like, not fake-wise. For real… sies.”\nSometimes he’s not so hot on the ‘playing’ part of playing dumb, but fuck it, he’ll give himself a pass this time because it has been a crazy kinda day, week, year, life, etc.\n“For realsies,” Cas says, and Dean knows he’s never ever gonna hear the end of this one.\n“You can always focus on the other half of that sentence,” he grumbles.\n“Oh, I am,” Cas assures him, moving closer. Dean closes the distance between them, hesitantly at first, because there’s no pretense this time, however thin. This isn’t “Leo” and “Steve” kissing, it’s Dean and Cas, and as Dean puts a hand on Cas’ cheek, he can feel the difference.\nWhen they pull back to breathe, Dean can feel the awe on his face as he says, “This was probably a long time coming.”\n“That is an astute observation, Dean,” Cas says dryly before pulling him back in.\n“Hey, I mean it,” he says, putting a hand on Cas’ chest to hold him in place, because Cas can be pretty fucking single minded when he wants to be. Which is… well, which is pretty fucking great a lot of the time, but a pain in the ass at least a strong some of the time.\nCas has gotten better at talking about feelings and emotions and junk in the past months, but he’s still the guy who preferred to dramatically flap off in the middle of a sentence when he decided he didn’t like the way the conversation winds were blowing, and there are still shades of that in him (not that Dean’s any better, really, but with his lack of wings, the most dramatically he can leave a conversation he doesn’t like is by stomping loudly away and maybe slamming a door. Cas could literally whip himself away to the opposite side of the galaxy in no time if he didn’t like how someone was dissing petunias or whatever).\nSo Dean gets it. Cas is very go big or go home. Guy comes from a family that tried to start the apocalypse because god’s kids were all more sensitive than a stubbed toe and thought gullible was written on the ceiling even though they live in the sky. He gets it. Dean’s been a slave to his own upbringing for literally his entire life.\nBut Cas also likes helping baby birds and sitting at the pond to watch the ducks swim around. He likes to watch Dean cook and steal bits and pieces when he thinks Dean isn’t looking, even though he totally is, because his eyes have been glued to Cas since day one in that barn.\n“Like… I feel like you should know I feel like I’m gonna throw up right now,” Dean says, ever the romantic. “My stomach is… I dunno. Fluttering? Like when you blink really fast and your eyelashes do the thing. That’s how I feel… right now,” he finishes lamely.\nCas looks at him for a couple seconds before saying a definitive, “Hm.”\n“That’s always a good sound,” Dean fires back, jittery.\n“Do you know how long I’ve loved you?” Cas asks in return, “Because I don’t,” and Dean thinks, oh shit, we’re going big, “But when I was an infinite, celestial being I had an almost-perfect grasp of time, down to the tiniest nanosecond. I knew exactly when the sun would set every night, and I knew when it would rise in the morning. I knew the moment the tide would start to recede from the shore. I could calculate the exact moment I found you in the pit, and the exact moment your head broke the surface after climbing out of your own grave in Pontiac, Illinois.” He cocks his head slightly. “But I’ll never be able to pinpoint the moment I fell in love with you.” Beneath the covers, he grabs Dean’s hand. “Every time I thought I’d figured it out, I remembered a time before that, and then a time before that. Eventually I came to the conclusion that ever since we’ve met, you’ve been happening all around me. Happening to me. It’s absurd to think a shell won’t get wet if you drop it in the ocean. You’re my ocean, Dean.”\nDean blinks.\nThen he blinks again.\nThen he blinks one more time.\nHe takes a shaky breath, and he thinks he means to say something profound and inspiring, or at least acknowledge that the depth of his love for Cas is indescribable and infinite and something he feels in his very core, but this has been a very trying conversation and his higher brain functions are still processing pretty much everything that’s happened in the past eight years between the two of them, so his brain to mouth filter is a little bit stuck when he says “I still can’t believe you made me crawl out of my own fucking grave.”\nDean and Cas look at each other a lot, but there has been an excessive amount of looking lately and this conversation is no exception.\nCas looks at him, and looks at him, and looks at him some more. Almost like he’s chewing on those words just as much as Dean has been chewing on his.\nFinally, he says, slightly exasperated as if Dean called him just as he’s next in line at the grocery store to ask him to grab one more thing, “I just pulled you from hell, Dean. Forgive me if my aim was shaky.”\nDean actually chuckles.\n“An epic love story,” he snorts, laughing into Cas’ shoulder now, “and my date couldn’t even walk me to my front door.”\nCas squeezes his hand, pressing his lips to the spot just below Dean’s ear.\n“To be fair,” he murmurs, “You didn’t have a front door at the time. A front bumper, maybe.”\nDean and Cas can’t seem to do anything the normal way, so it’s almost unsurprising when a yell and a crash from the living room interrupt their first makeout session ever, and Dean silently wonders as they stumble out of bed and towards their various weapons of choice if asshole ghosts ever get lessons in cockblocking.\nThey charge down the hall, tripping over their own feet and each other’s, ghostbusters-lite to the max. There are more important things happening right now, but Dean really hopes his erection chills out. Last thing he wants is to fight an undead spirit while he’s sporting a raging chubby.\nWhat he’s not expecting is to see Sam standing in the middle of their living room, chanting in a language Dean’s too distracted to decode, while the ghost of Connor Painter screams and writhes in the air, flames licking at his torso. Dean can just barely see Helen’s blond head peeking over the couch as she cowers, hands over her head once more tonight. The room itself is in chaos, wind whipping around and the sigils painted behind the couch glowing fiercely, bright light eeking out from behind the cushions. Sam’s hair is blowing into his face, obscuring his vision, but he reads on, shouting over the din. When he spots Dean and Cas across the room, his words falter for a moment as he takes a second to roll exasperated eyes, and then continues on smoothly.\nDean and Cas share a glance , wherein Dean says “What the f-” and Cas says, “I don’t know,” and then Sam’s chanting speeds up, along with the winds, but somehow he manages to keep his feet as Dean and Cas get sent flying into the nearest wall, one of Cas’ flailing elbows accidentally sinking into Dean’s stomach. Dean grunts, while Cas sends him an apologetic look.\n“This is what I love,” Dean says flatly after regaining his breath. The room continues to flip into chaos in front of them. “Getting magically stuck to walls. There is nothing I love more than getting magically stuck to walls like some kind of fly made out of super glue. It’s not a hunt unless at least one Winchester has been magically stuck to at least one wall.”\n“I’m going to elbow you in the stomach again,” Cas says from beside him. “On purpose this time.”\n“Try me, pal. In case you’ve forgotten, we’re both magically stuck to a wall.”\nThe room lights up in orange as the flames climb higher on Painter’s body.\n“I’m very aware of our situation, Dean. As you just pointed out, we’re both in the same boat.”\n“Well then good luck elbowing me, doofus.”\nCas glares at him.\nIn the background, there’s a ghostly howl from Painter.\n“I didn’t specify when, exactly, this elbow was going to happen.”\nDean rolls his eyes. “Oh, big man. Talks the talk but can he walk the walk?”\n“If this is you challenging me to a fight, Dean, I’d tread carefully.” He smirks. “I’m still winning, you know.”\nA thrill shoots through Dean, and he quirks an eyebrow. “Well, consider this me finally evening the score.”\n“That sounds like someone who already thinks he’s won,” Cas mock-muses. “But last I checked, the ‘gloves’ have yet to come off.”\nDean swallows. Okay, so maybe they weren’t exactly talking about a good old gentlemanly round of fisticuffs. Cas got the hang of fingerquotes a long time ago so it’s not like he doesn’t know what he’s doing.\n“Are you fucking kidding me?” Sam yells from across the room. The wind has died down enough that he can obviously hear their conversation.\n“We’re magically stuck to a wall, Sam!” Dean barks, his face hot, “What the fuck do you expect us to do, play cards?”\n“You could help with the hunt we’re currently in the middle of,” Sam snaps as he throws a handful of some kind of powder into a bowl. It bursts into a bright white cloud and Painter howls again.\n“What do the words ‘magically stuck to a wall’ mean to you, Sam?” Dean asks. “Besides,” he says dismissively, “you’re doing just fine on your own.”\nWith one final pinch of some kind of red powder, Sam sends Painter whirling into the kind of ghost-y black hole that one probably doesn’t pull themselves out of without a considerable amount of effort and maybe a tank or two. The cacophony in the room dies down, and Dean and Cas thump to the floor as Painter’s hold on them drops. Cas helps him up with an offered hand, his thumb lingering briefly on Dean’s second knuckle.\nSam groans.\n“I called both of you like fifty times, thinking you were dead or something, but no! No, instead you were so busy making moony eyes at each other you may as well have been in outer-fucking-space!”\nDean sputters, red-faced, “That is not- that is- completely untrue and unfounded, if I do say so myself.” He makes a face and elbows Cas, who immediately stands ramrod straight and says robotically, “Yes, that is untrue. Unfounded, even.”\nSam glares between the two of them, muttering under his breath. It’s not like Dean can give we were busy confessing our undying love for each other in the bed we were supposed to be fake-sharing as an excuse for not picking up his phone, so he leaves his pathetic non-alibi as is. Either way, it probably wouldn’t do much to ease the bitchy look on Sam’s face.\nA sound that could maybe be used to describe a very confused kitten occurs on the couch, and Dean and Cas both say, “Helen,” at the same time, and rush over, Sam right behind them.\nShe’s sitting up now. Her hair looks like it went five rounds with a blender and lost, and there’s still a trace of alcohol in the wide, deer-in-the-headlights way she’s looking at them.\n“Um,” she says meekly, words rasping out of her throat, “I don’t think you’re going to get your security deposit back.”\n And then she falls forward, fainting into Sam’s bewildered arms.\n***\n“Wait, I’m sorry, I think you need to say that again.”\n“I wouldn’t have to say it again if you had actually picked up your fucking phone.”\n“Sam.”\n“Dean.”\n“Sam.”\n“Dean.”\n“Cas,” Cas interjects flatly.\nDean throws up his hands in defeat. “Okay, jesus! I should have picked up my phone. My fucking bad. Now can we talk about how you just sent an old ass ghost to fucking purgatory?” He turns to Cas. “And you’re not allowed to watch Shrek anymore.”\nSam blinks slowly at him.\n“You just spelled it out, like, right there. I sent a ghost to purgatory.”\nDean’s mouth twitches, and then he turns to Cas, who’s perched on the other end of the bed Dean’s sitting on. After finally calming Helen down properly and assuring her there would be no more indoor tornados tonight, they hightailed it back to Sam’s hotel to debrief.\n“Yeah, but, do ghosts even go to purgatory after they flame out?” Dean asks. He may have spent a year there, but Cas is still resident expert. “I don’t remember ever meeting a ghost there.”\nCas shrugs one shoulder. “With all the stress put on the various dimensions in the last decade or so, I’m sure it’s possible. The lines are much blurrier than they used to be.”\n“I wasn’t sure a salt’n’burn would be enough, honestly,” Sam says. “I found some copies of old letters written between Painter’s enemies where they talked about ganging up on him, taking him out of the running for village center, and they seemed to agree that the best place to dump the body was in Otter Creek, which is the creek running right by your apartment building, by the way.” He runs a hand through his hair. “No way we’d ever find every last bit of him after all this time, even if the sediment at the bottom preserved him. Besides, I think by a quarter century later, burning his remains may not even work. He was pretty strong.”\n“Huh,” Dean says. “So was it these dudes that killed him, then? And he’s out for revenge or something?”\n“That seems to be the case,” Sam says. “I assume he attacks anyone he thinks would be a threat.”\nDean waggles his eyebrows at Cas.\n“Hear that, Cas? We’re scary enough to threaten a 250-year old ghost. That’s pretty badass.”\n“Dean, I’m much older than 250.”\n“Ugh, which probably explains why you’re such a buzzkill all the time, grandpa.”\n“You weren’t calling me grandpa when we were-”\nSam clears his throat pointedly.\n“Please don’t finish that sentence,” he says.\n“But I was just going to say-”\nSam holds up a hand.\n“Don’t.”\n“So wait,” Dean says, “Why would he attack Helen, then? In her own apartment?”\n“Guilt by association, probably,” Sam says. “According to him, she was probably fraternizing with the enemy.” His expression turns quizzical. “Which reminds me, why did you two have her over for supper?”\nDean says “uhhhhhhhhhhhhhhh” for way too long, so Cas steps in.\n“We thought she was a suspect,” he says, and Dean thinks, okay, so he’s not going to- “And also to prove to her that Dean and I were a legitimate couple, because we were worried we had slipped up.”\nHe did.\nDean sighs, and Sam’s visibly biting his lip to keep from laughing, all his previous ire forgotten.\n“Oh,” he says, snorting, “I’m sure you two were very convincing.”\n“Shut your face, Sasquatch,” Dean says. “And tell us how you figured all of this out. I thought you were having trouble finding records that old.”\nApparently it’s Sam’s turn to go red, and Dean immediately prepares himself to rip on his favorite little brother.\n“Well remember that librarian?” Sam shakes his hair awkwardly, clearing his throat. “From the library over in Sanex? She had some… uh… other pertinent info that she was willing to part with.” He rubs the back of his neck, and Dean laughs in delight.\n“Sammy, you sly dog,” he crows. He slaps Cas on the shoulder. “Looks like we weren’t the only ones shacking up this week, babe.”\n“Eugh, Dean,” Sam makes a face, obviously (hopefully) taking the joke as a joke, but completely missing the part where the pet name that just slipped out of his mouth was very much accidental and very much not part of the joke. He looks straight ahead, trying not to give himself away, but he can see Cas out of the corner of his eye staring at him, surprised. The surprise very quickly melts into affectionate amusement as Cas says, “Yes, Dean,” very pointedly, “‘Ugh.’”\nDean stands up. “Okay, that’s it,” he declares, “I’ve had enough of this abuse. I’m heading back to the apartment to clean up.”\nSam’s eyes practically bug out of his head.\n“You’re going to clean up after a hunt?” he asks, aghast. “It’s like I don’t even know you.”\n“We always clean up after a hunt you big dumb lug.”\n“Bodies, yeah. Not overturned furniture.”\n“I’ll overturn you,” Dean snaps, before grabbing his coat and heading for the door.\n“Aw,” Sam says cutely, and Dean flips him off over his shoulder.\n***\n“I’m a suburban menace,” Dean announces to the room at large, which currently only consists of Cas. “I’m a fucking domestic goddess.”\n“We’re not in the suburbs, and you missed a spot over there,” Cas says mildly, pointing to the spot Dean did, in fact, miss.\nDean tsks loudly as he goes and sweeps the last of the dirt he missed. Where the hell Painter found dirt to scatter, Dean’ll never know. “Honestly, Cas, once a buzzkill, always a buzzkill.”\n“Maybe if you were better at sweeping I wouldn’t be such a buzzkill,” he says wryly.\n“I’ll fucking sweep you,” Dean warns.\n “Is that a threat or a proposition?”\n“I’ll proposition… you… wait. Fuck. Disregard that sentence.”\n“I was quite curious as to where that was going, actually,” Cas says archly. “We never got to finish our conversation earlier… you know. The conversation we were having. In bed. The conversation we had in the bed we were sharing.”\n“The poison?” Dean asks. “The poison for Kuzco?”\nIt took them the better part of the night to put the apartment back in working order, but it looks almost as good as new. A bit of plaster where Dean’s head dented the wall last night after he was magically stuck to it and a fresh coat of paint over all the sigils, and maybe, despite Helen’s dire predictions, they can get their security deposit back. \nThey’ve worked in silence for the most part, but Dean’s pretty sure they’ve just been trading loaded glances when they don’t think the other is looking.\nFinally, when they’re done and the sky outside is gray with both impending morning and snow, they collapse side by side on the couch, knees knocking. Dean looks around their now clean apartment, satisfied, and drops an arm along the back of the couch.\n“Y’know,” he says, surveying the place. “It wasn’t ours for long, but it was ours.”\nWhen he glances over at Cas, Cas is staring right back at him, and it takes maybe a total of three seconds for Cas to fist his hands in the front of Dean’s plaid, yanking him in and kissing him hot and heady. Dean feels like he just got launched into space, and scrabbles for purchase as he struggles to keep up, because Cas seems intent on taking him on the ride of his fucking life.\nBut because Dean Winchester is Dean Winchester, he feels the need to clarify that he’s probably going to be one of the fuller luggage carts at the airport before he falls ass over teakettle into something he’s never going to be able to unass or unteakettle.\n“Cas, wait, wait,” he mushes against Cas’ mouth, because Cas, apparently, is an eager beaver, both in his voracious approach to kissing and his apparent disinterest in caveats. He pulls back just barely, watching Dean with that classic Cas combo of exasperation and impatience. \n“What, Dean?” he asks. Suddenly, his brows pull together and his voice goes a little unsure. “Do you not want to do this?”\nDean does a double take.\n“What? Shit, no, Cas. I mean, yes! Yes, clearly I want to do this, holy shit. I thought I made that pretty obvious.”\nCas’ expression clears. “Then let’s get to it,” he says promptly, leaning in again.\nDean literally puts an entire hand on Cas’ face.\n“Listen up, Romeo,” he says, “I gotta say something first.”\nCas makes such a disgruntled face that Dean almost laughs, but he knows this clarification is really important because if he didn’t make it and Cas regretted it later he’d be kicking his own ass into the stratosphere for it.\n“Please say what you need to say, Dean. I want to be kissing you.”\nDean takes a deep breath and the plunge, “Okay, like, look, I don’t want to scare you away or whatever,” and uh oh, here’s Dean the party pooper, here to poop on all parties involved, “I just need you to know, like, that shit you said to me last night?” He raises his eyebrows, as if that’s all the road signs Cas needs, “I’ll never be able to. I dunno. Express myself like that. You said it like a fucking magician pulling a rabbit out of a hat, and I just can’t do that. I can’t be that. I’m not… Flowery. Or pretty. Or even nice, half the time.”\nCas pulls back just slightly.\n“Oh,” he says dryly. “Well, in that case, I guess I’m calling this whole thing off.” He sits back on his haunches, resting his hands on his thighs as if to say, well, I tried. “Guess I’ll go pull someone else out of hell and start another epic love story with them, then.” He puts a finger on his chin, mock-thinking. “Maybe an English teacher this time? Someone good with words.” \n“You are such a sarcastic little asshole.”\nCas kisses him again, softer this time.\n“You need to stop with the qualifiers,” he instructs quietly. “I’ve known you for so long, Dean. You may still believe them, but I never have and I never will and there is literally nothing you can say at this point to ‘scare me away’.” His mouth quirks, “Though, for the record, you are very pretty.”\nDean leans forward this time, capturing Cas’ mouth with his own.\n“I can give you all I got, Cas,” he promises. “I dunno if it’ll be enough.”\n“It’ll always be enough,” Cas assures him, lifting a hand to fit Dean’s cheek. His thumb traces gently over the seam of Dean’s lips, and Dean opens his mouth slightly, pressing a kiss there. Cas’ whole expression softens, and when he kisses Dean again, it’s like the tide has gone out again, the heat ebbing, but the ocean remains as vast, as wide, as deep as it always has been and always will be.\n***\nThe tide comes in eventually. It is a cyclical phenomenon, after all.\nCas works his fingers into Dean right there on their comes-with-the-place couch (that twenty minute interlude where they practically sprinted to the drug store down the road to buy lube maybe wasn’t the most subtle, but it was the quickest way to penetration town, and Dean’s fucking glad his GPS doesn’t have to recalculate a route) and Dean keens into it, barely able to form coherent thoughts, let alone a sentence.\n“So, does fake-fingering you mean I get to fake-fuck you?” Cas asks, voice still wry but Dean can see how quick his breathing has gotten. Cas may be Mr. Smooth, but sticking your fingers into a dude’s ass for the first time would probably be an overwhelming sensation for pretty much anyone.   \n“You can fake-do whatever you want to me, Cas, just do it now.”\nCas’ fingers still in Dean, and just when Dean’s about to crack open an eye and ask what the hell, he finds Cas staring at him so reverently that his body has to work double time just to get enough blood back to his face so he can flush.\n“I think I’d like to do it for real,” Cas says quietly, leaning his forehead against Dean’s.\nDean swallows. “It’s always been real,” he says. Of course it has. They’d just been fucking around before, but dropping the joke sharpens the reality of this, of them.\nCas pulls back to search Dean’s face, and almost seemingly unconsciously starts to slowly work in Dean again. This is an incredibly important moment, and Dean’s definitely going to remember this forever, but it’s awfully hard to concentrate when Cas’ fingers idly brush over his prostate and an involuntary whine is pulled from him like a parachute’s rip cord. Cas’ eyes snap back to his at the sound, and his face suddenly splits into a grin so wide it cracks open a similarly sized crevice in Dean’s chest. He surges forward to seal his mouth to Dean’s, fingers working with a renewed fervor. He carefully inserts a third finger, and Dean hisses through the burn, then relaxes into it.\n“That was definitely real,” Cas murmurs into his ear, laughing into the crevice between Dean’s neck and shoulder.\n“Guess the jig is up,” Dean says breathlessly. Then, just because he can, “You got me, darlin’.”\nCas shudders on top of him, leaving a hot trail of kisses down the side of Dean’s neck as he readjusts Dean’s leg where it lays over the top of the couch, hefting it over his shoulder- “Careful, Cas, jesus. I’m not a rag doll. People don’t bend that way.”- His other leg is dangling off the couch, foot pressed flat to the floor to get the best leverage possible so he can fuck himself back onto Cas’ fingers.\n“I feel bad about this couch,” Cas says idly as Dean writhes beneath him.\n“Do you-ah- really?” Dean asks, voice catching when Cas twists his fingers just so.\nCas smirks.\n“No.” He reconsiders. “Although we probably could have put down a blanket, at least.”\n“Glad someone’s thinking about the- nnnngh- practical things.”\n“You’d be surprised, Dean Winchester,” Cas says mischievously. “My mind works in mysterious ways. For instance, I’m currently thinking about the way you look beneath me, flushed from head to toe and completely unabashed, and I salivate at the thought of what’s to come-”\n“Who the fuck told you that you could talk like that?”\n“But I’m also thinking about your hands, and your eyes, and your back, and your kneecaps.” He kisses Dean lightly, chastely. “Your lips. Your freckles. Your toes and your ears and your knuckles and your stomach.” He kisses Dean again, quirking his fingers until he finds Dean’s prostate for a second time and massages it with the pad of his finger. Stars burst in front of Dean’s eyes and he whimpers, lit up from the inside like a Christmas tree. Tears form at the corner of his eyes, hot and itchy and overwhelming. “I’m thinking about how much every part of you means to every part of me, and I am…” he kisses Dean for a third time, long and languid and slow, and Dean’s gut simmers, revelling.  “Well, I’m speechless.”\n“Are you sure?” Dean teases. “Tell that to the dictionary you just-” Cas’ fingers slide slowly out of Dean, and the empty feeling they leave behind isn’t a pleasant one. “Hey! I wasn’t done with those.”\nCas raises an eyebrow at him.\n“I was thinking we could replace those with something a little more… substantial,” Cas offers suggestively. His brow furrows as he shakes the hand that was just inside Dean, holding his wrist with a grimace. “And an appendage less susceptible to cramping,” he adds, frowning at his own hand. Dean watches the way the early morning light glints off Cas’ still-lubed up fingers and thinks, holy shit those were just inside me.\nHe can feel Cas’ dick, hard and leaking where it presses insistently into his hip, and he has to swallow a large, sudden excess of saliva as his mouth starts to water. He was so distracted by Cas’ fingers that he didn’t even bother thinking about the second course, and now that it’s here staring him in the face he finds he’s more than ready, finds that his empty ass literally aches for something to clench against. He drags his hands up and down Cas’ naked back, hoping that’s encouragement enough for him to continue. Instead, Cas leans forward, pressing their mouths together again, hot and insistent and wet.\n“Tell me,” he orders softly. “Tell me what you want.”\nDean rolls his eyes. “Yeah, Cas, shit, put the thing in the thing.”\nCas pulls back and eyes him.\n“I am going to insert my penis into your rear end now, Dean Winchester.”\n“Shut up, smartass. And don’t forget the lube.”\nCas slicks himself up, and when Dean offers a hand, Cas bats him away.\n“I think it may be better if I do it,” Cas informs him in the tone of voice that is supposed to convey complete composure, but instead conveys complete internal upheaval. “I don’t think I’ll last if you do it.”\nDean looks down at his own aching dick, leaking precome at the head, and says, “You may have a point there. Maybe we should have saved the triple X stuff for romp numbers two through infinity.”\nOoh, infinity. Now there’s a scary word. Less scary when applied to Cas, though.\nCas sits back on his haunches, slick dick bobbing, aching at the ready. Dean feels like he’s being saluted.\n“You want to wait?” Cas asks, and the thing is, Dean knows he would. If he called red-light on this whole sexcapade right now, Cas would probably just nod in complete understanding and jerk himself off, kissing Dean when he finished for being such a good sport.\n“That’s not what I said,” Dean clarifies. “I really want you to stick your penis into my rear end, Castiel.”\n“My fake-penis into your fake-rear end?”\n“Your real dick into my real asshole.”\nSo Cas goes ahead and does exactly that. He holds Dean’s hand through it and whispers encouragement into his ear, and somehow they both manage to last a not-so-respectable couple minutes, probably because the initial discomfort manages to deflate the roaring arousal in Dean’s stomach at least a bit, and Cas is so focused on not hurting Dean that he almost forgets to tell Dean exactly how good he feels, wrapped up in him. Cas repeats something about the ocean, and those tears that were threatening finally fall in quick, twin falls down the side of Dean’s face.\nCas puts his hands on either side of Dean’s face and says, “I love you,” and Dean manages to choke out a very undignified “I love you too,” right back, because he really really does.\n***\nAs they drive home to Kansas, security deposit in hand and Helen’s “for emergencies” cell number in their pockets, Dean watches Sam in the passenger seat pull out his wallet, grab a twenty, pass it to his other hand, then put it back in his wallet with a small, satisfied smirk.\nHe glances in the rear view mirror, but Cas is still conked out in the backseat, unable to offer any insights.\n“What was that,” he asks Sam warily, keeping his eyes on the road.\nSam shrugs the most unconvincing shrug Dean’s ever seen, and he once had Sam try to deny there was an iPod jack in his car while he was literally staring at an iPod jack in his car, put there by Sam.\n“Sam, why did you just do that,” he pushes.\n“Do what?” Sam asks innocently. He’s just playing with Dean now.\n“Sam so help me god-”\n“I was just cashing in on a bet,” Sam interrupts, the smirk doing its best to slide back onto his face. Sam fights valiantly, though.\n“A bet? With… yourself?”\n“Uh huh.” And there’s the smirk.\n“Pray tell what was this bet.”\nSam’s eyes flick up to the rear view mirror and then back.\n“Honestly,” he says, laughter in his voice, “You two are so transparent you may as well be cling wrap.”\nDean could say a lot of things in response.\n“No,” he says instead.\nSam gives him a very dramatic look.\n“Dean, there were a million other ways we could have tackled this case,” he says. “But you and Cas somehow talked yourselves into the most unlikely cover by posing as a couple. And then you took like ten times longer than normal to solve a simple salt and burn. And I’m also pretty sure you completely forgot I was working the case. And maybe you forgot there was a case, period.”\n“Well, shit, Sam, you’re just making me sound like one goddam great hunter right now.”\n“You are a great hunter.” Sam smirks. “And also, I just won twenty bucks from myself.”\n***\nThe Official (Totally Not Fake) Epic Love Story of Dean and Castiel started on September 18th, 2008, though it wasn’t named as such until more than eight years later on the way to a dumb hunt in a small city in Vermont. They bickered over the name and they bickered over what details to change and what details to keep in. They snapped at each other over bad suggestions and got way too into the backstory for a case that barely required a frontstory, but since they’re Dean and Cas, they did it the goddam hardest way.\nThey barely knew what they were doing, stumbling into something they’d been stumbling into for the past eight years. They said the wrong things and touched at inappropriate times and forgot important details they should have remembered, pretty much like any normal couple does. They painted sigils on bedroom walls and hid hexbags in apartments that weren’t theirs and sent a 250 year old ghost packing to purgatory, pretty much not like any normal couple.\nThey had no idea what they were doing, because if they’re being honest, they’ve never known what they’re doing. No one stumbles on purpose, but at least they ended up stumbling into each other.\nFrom the beginning, this whole thing was a crapshoot, a gambit, a roll of the dice. They had no idea what they would roll, but they rolled, regardless. Took a chance and a plunge directly into unknown waters.\nYou could probably say they were making it up as they go. \n "
}