{
    "id": "406485",
    "url": "https://archiveofourown.org/works/406485?view_full_work=true",
    "author": [
        "lielabell"
    ],
    "title": "Things To Do On The Dates You Aren't Having",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Teen Wolf (TV)"
    ],
    "relationships": [
        "Derek Hale/Stiles Stilinski"
    ],
    "characters": [
        "Derek Hale",
        "Stiles Stilinski",
        "Scott McCall",
        "Allison Argent",
        "Lydia Martin",
        "Jackson Whittemore"
    ],
    "additional_tags": [
        "Emotionally Constipated Boys",
        "Misunderstanding",
        "Use your words Derek",
        "Happy Ending",
        "Twisted and Fluffy Feelings",
        "Lydia is a BAMF",
        "Allison is a Disney Princess",
        "Jackson is a jackass",
        "Stiles is not Bella Swan"
    ],
    "language": "English",
    "series": "",
    "published": "2012-05-17",
    "completed": null,
    "words": "5,557",
    "chapters": "1/1",
    "comments": "238",
    "kudos": "15,826",
    "bookmarks": "2,996",
    "hits": "225,681",
    "summary": "<p>\"So are we dating now or what?\" Stiles asks the third time he finds himself doing the obligatory postcoital cuddling with a certain sour wolf.</p>",
    "notes": "<p>Now in <a href=\"http://teen-wolf-pack.diary.ru/p180273583.htm\" rel=\"nofollow\">Russian</a>! Thanks to tupoy_olen! :D<br>And <a href=\"https://archiveofourown.org/works/504466\" rel=\"nofollow\">Podfic</a>! Thanks to <a href=\"https://archiveofourown.org/users/Rhea/pseuds/Rhea\" rel=\"nofollow\">Rhea</a>! &lt;3</p>\n<p>OMG! NOW IN <a href=\"https://lielabell.tumblr.com/post/71117833860/stereksecretsanta-things-to-do-on-the-dates-you\" rel=\"nofollow\">GIF FORM!</a></p>",
    "text": "\"So are we dating now or what?\" Stiles asks the third time he finds himself doing the obligatory postcoital cuddling with a certain sour wolf.\nSaid sour wolf scowls. \"Or what,\" he growls and Stiles automatically deducts fifteen minutes off of their afterglow allotment. \n\"Don't get snappish on me,\" he mutters as he as rubs his face against Derek's ridiculously well defined pecs. \"I'm not worried about you still respecting me in the morning, I already know you won't.\"\nDerek growls a little more, a pleasant rumble in the ear Stiles has pressed against his chest, and skims a hand over the back of Stiles head in a half-hearted cuff.\n\"Alright, alright. I'm shutting up,\" Stiles says with a yawn. And he does. For the next forty-five minutes, he does. Until he feels Derek's body relax against him, hears Derek's soft snores in his ears. \"Just for the record,\" he tells the sleeping Alpha, \"I think we kind of are.\"\nThen he's up and out of the bed, dressing a little faster than normal because it's always awkward getting caught with your jeans around your knees. Five minutes later he's in his Jeep, cruising down the road back into town, music blaring out his windows and a smile the size of Texas plastered on his face.\n*\n\"What's up with you and Derek?\" Scott asks him a couple of weeks later, his eyes narrowed in that way they get when he thinks someone is pulling a fast one on him.\n\"Nothing,\" Stiles replies, because they still aren't officially dating or whatever. Just hanging out four nights a week and having sex whenever they can. Which is fine with Stiles, more than fine actually. He's not the sort who needs things pinned down or anything. And Derek is sort of the opposite of a romantic guy. God, Derek's version of romance probably involves dead woodland creatures or something equally horrific. Stiles smiles to himself at the thought of Derek leaving the remains of Bambi's mother on his doorstep and then has to blink his way back to reality when he realizes that Scott is shaking his shoulder. \"What?\" he asks, forcing himself to focus on his friend.\nScott snorts. \"Yeah, nothing,\" he says, shaking his head. \"Just watch it or that nothing is going to bite your face off next full moon.\"\nStiles rolls his eyes. \"Did you do your Chem homework?\" he asks, changing the subject to something less likely to end in Scott mocking him for all he's worth.\n*\nAllison sort of chews on her bottom lip a bit and stares at Stiles like she's trying to see into his mind. Which is kind of freaky and way out of character for her. \n\"You okay?\" he ask, because he has some manners and knows better than to just come out with a 'what the hell is your problem' like he would if it were Scott. Or Jackson. Or Lydia. Huh. Maybe it's not manners. Maybe it's just Allison and her almost too sweet to be real face.\nShe blushes, because she's really a Disney Princess. \"I was just going to ask you that,\" she says with a laugh. \n\"Oh. Alright.\" Stiles sticks the cap of his highlighter into his mouth and turns back to his text. \nAllison laughs again, tucking a strand of hair behind her ear. \"So, are you?\"\n\"Am I what?\"\n\"Okay.\" she chews on her lip again. \"With, um, Derek. That is.\"\nStiles just blinks at her. \"Um,\" he trails off, not really knowing what to say. Sure, he gets that she's not pure as the driven snow or anything, Scott has made that point perfectly clear, but she's still... well... a Disney Princess and talking to her about the fabulously aggressive kinky werewolf sex he's been having just doesn't seem right.\n\"I mean, you don't have to tell me if you don't want to, but,\" she ducks her head a little, looking bashful and hopeful at the same time. \"I just, it would be cool if you wanted to.\"\n\"Uh.\" Stiles still can't think of anything to say. \"Yes?\" he finally manages to choke out. Because, yeah, things are just fine between him and Derek. Just fine in that hot-damn-I-came-five-times-last-weekend sort of way.\n\"Oh good!\" Allison practically bounces in her seat and unleashes one of those sunshine smiles of hers. \"Um, if you want, you can totally talk to me about, you know,\" she does a quick glance around the quad, her eyes narrowing \"stuff. Because I don't really have anyone else to talk to about stuff that happens with Scott, um, during his special time of the month. For reasons. But you, well, you will be dealing with the same sorts of stuff. So, yeah. We should really talk about it together.\" \nShe looks so damn pleased that Stiles can't even bother to set her straight because he has a feeling that if he does, it will make her cry or something. And it's not nice to make sweet girls like Allison cry, never mind the fact that she's wicked awesome with a bow and could probably kill him with her bare hands if she wanted to. So Stiles just sorta smiles back at her and wonders how the hell he became her gay best friend.\n\"Oh, and don't worry about that not officially dating yet thing,\" she says breezily. \"I'm sure Derek will get over that sooner or later. And even if he doesn't, we all know you're together. So it's no big deal, right?\"\n\"Right,\" Stiles repeats, chewing a bit on the highlighter cap. He's not worried. He's never been worried. Not about that, anyway. Thing is, he's starting to think that maybe he ought to worry after all. \n*\n\"So, you and Derek have been dating for, what, three months now?\" Lydia asks as she spreads lip gloss on her lips in a way that shouldn't be distracting to a guy who sucks as much dick as Stiles does. Shouldn't be, but it is. \n\"What?\" he asks, feeling that same old dazed feeling he gets whenever he looks at Lydia's mouth for too long. \nShe rolls her eyes and snaps her fingers in front of his face. \"You and Derek. You've been dating for three months now, right? I mean,\" she wrinkles her nose, \"that's how long you've been reeking of him anyway.\"\nStiles lifts his shoulder. \"I guess so. Um, except we aren't dating.\"\n\"Yes you are.\"\nNow it's Stiles turn to roll his eyes. \"Dude, fucking someone doesn't not equal having a relationship with them. I thought you knew that.\"\n\"Don't be a dick,\" she shoots back. \"And, whatever, you two are so not just fuck buddies. You cuddle. Non-stop. That is so not fuck buddy behavior.\"\n\"I'll take your word for it,\" Stiles says grumpily, because he really doesn't like talking about his and Derek's not-relationship. Which is kind of ironic, because thanks to Allison he's talking about it all the damn time. But Lydia is not Allison. Stiles can say no to Lydia. Stiles can tell her to fuck off and mind her own business. Except Stiles does no such thing and instead ends up talking to Lydia for the better part of an hour about the perfect, romantic Valentine's date that he and Derek most assuredly are not going to go on. \nBecause Derek hasn't asked him on any dates, not once in the three months they've been whatever they are to each other. And something tells him that Valentine's Day isn't going to be the magical exception to the Derek-isn't-dating-Stiles rule.\nWhich is fine. Perfectly fine. After all, the sex is awesome. And Stiles is a guy. Guys don't need all that hearts and flowers bullshit. Ask anyone.\nAnyone except Stiles, that is.\n*\nJackson is leaning against the locker next to Stiles's and smirking at him, which isn't new. Isn't new at all. But Stiles hasn't done anything particularly stupid recently, so he can't figure out what, exactly, Jackson is smirking for. It's not his typical I'm-better-than-you-are smirk, anyway, and the not knowing is starting to bother him. \n\"What the hell is your problem?\" he snaps as he spins the combo out on his lock. \nJackson laughs, meanly because everything Jackson does has a bit of a nasty edge to it. \"I don't have a problem,\" he says with that stupid smirk still in place. \"You might though.\"\n\"No, I'm pretty sure you're the one with the problem.\"\n\"Oh am I?\" And there goes an eyebrow lifting up to join the smirk. God damn it. \nStiles scowls at him and shoves things into his locker faster. \"Fuck off.\"\nJackson raises his hands in a no-harm-no-foul gesture. \"Look, dude, I'm just trying to do you a solid. I mean, I would want to know if someone I was trading bodily fluids with was seeing a little something something on the side.\"\n\"Fuck off,\" Stiles manages to say again, even though it feels like the world has suddenly stopped spinning and his stomach is made out of lead.\n\"Fine, then. I will.\" Jackson pushes off the lockers, a smug look coming onto his face. \"See you around, Stiles,\" he says, clapping Stiles on the shoulder like they are friends instead of frienemies . \"Or, you know, not. There won't be much room for you in the pack if some other bitch takes your place.\"\nStiles ought to say something back, something clever and cutting that will knock that smug look right off of Jackson's face. But all Stiles can do is stare into his locker with eyes that don't see anything except the scowl that is so frequently on his sour wolf's face.\n*\n\"What do you mean you're busy?\" Derek growls into the phone and Stiles can't help but tighten his grip on it. \n\"Exactly what I said. I'm busy. So, um, I can't see you tonight.\"\nDerek makes a frustrated noise. \"Busy doing what?\"\n\"Things.\" Stiles runs a palm over the back of his head. \"You know, boring stuff that people still have to do. Like homework and chores and things.\"\n\"Right.\" Derek does not sound amused. \"You have to do homework. And chores. And so you are busy. And can't see me.\"\nStiles swallows. \"Um, yeah. You got it. So, um, maybe tomorrow, alright?\" Except he already knows that won't be happening. And Derek seems to know too, because he's growling into the phone again. \"Look, I've got to go,\" Stiles says in a rush. \n\"Right. Because you have a busy night of things to get to.\" Derek's voice is tight with anger and Stiles gets it, he does. No one likes losing their access to easy sex. But Stiles just isn't in the mood anymore. Hasn't been for awhile. And Derek... well Derek's not lacking for company. \n\"Exactly,\" Stiles says. \"Later.\" And then he hangs up the phone before Derek can say anything else. He lets out a particularly emo sigh and then slips the phone into his back pocket. \"Right,\" he says aloud. \"Wonderful. Alone again, naturally.\" And he throws himself onto his bed to sulk. Because that's what you do when your end things with your preternatural not-boyfriend. You lay in your bed and you sulk. Just ask Bella Swan.\nOh god. Did he just compare himself to Bella Swan? Stiles pulls a pillow over his head. \"Someone needs to kill me now,\" he says to his empty room. \n\"If you're looking for someone to do the job, I might be willing to help out.\"\nStiles yelps, tossing his pillow as he scrambles up on his bed. \"Derek, I told you I was busy!\"\nDerek's eyes are half-lidded as he rubs his lower lip. \"Oh, yeah. I can see that. Super busy here.\" \nGod damn it. This is not how things are supposed to go. Derek is supposed to just... Stiles isn't sure what Derek is supposed to do, but standing there leaning up against his door frame isn't it. \"What, were you outside my house when you called?\" he asks when he can't take the intense staring any more.\n\"Yes,\" Derek says with no further explanation. \n\"Oh. Were you just in the area?\" Stiles doesn’t add that Derek’s got no call to be in the area because he’s been avoiding Derek for the better part of a week, but then he doesn’t have to because, from the look on his face, Derek’s already got the message. \nDerek's eyes narrow and his lip curls. \"No, I was not just in the area. I came here to see you, Stiles. Like I do every Friday night. It's kinda of a standing date.\"\n\"It's not date,\" Stiles snaps back. \"It's never a date. Because we. Aren't. Dating.\"\nDerek lets out a howl at that, his hands balling up into fists like he can't believe that Stiles had the gall to snap back at him. And just like that it's all too much. \n\"You should go,\" Stiles says softly. \"I don't want you here.\"\n\"Yes,\" Derek says just as softly. \"I can see that.\" He gives Stiles a long, hard look, that familiar scowl of his back in place. Then he nods sharply, turns on his heel and leaves. \nStiles does not, no matter what anyone might say, cry himself to sleep.\n*\n“Dude!” Scott slams into Stiles room like it’s his own. “Did you break up with Derek?”\nStiles sighs as he looks up from his computer. “Kind of hard to break up with someone you aren’t dating.”\n\"Dude! What the hell!\" Scott crosses the room faster than Stiles can track and slaps the back of Stiles's head. \"Why would you do that?\"\n\"That hurt!\" Stiles rubs the back of his head, scowling at Scott for all he's worth. \nScott makes a face at him. \"It was supposed to, you twat.\" He lets out the most put upon sigh in the history of the world. \"Seriously? I can't believe you dumped Derek. He's, like, ten times higher up the food chain than you are. I love you, man, but you are never going to score with someone that hot again, male or female.\"\nStiles closes his eyes. \"Shut up.\"\n\"No. I'm not going to, because you are my best friend and best friends tell each other when they are making massive, massive mistakes.\"\n\"I'm not making a mistake, Scott.\" Stiles turns back to his computer because right now trolling around on tumblr is definitely a better life choice than having this conversation. \nScott lets out an exasperated noise. \"Dude, seriously? Are you really that out of it that you can't see how great a thing you had going with him?\"\nStiles wants to yell and scream and punch things. But instead he just takes a deep breath and says quietly, \"Ask me again if I'm making a mistake. And then listen, really listen, to my answer.\" \nScott shifts awkwardly where he stands, then lets out a breath and says, \"Did you make a mistake, Stiles?\"\n\"No,\" Stiles says in a voice empty of all emotion. \"I didn't. I made a good decision. Yes, it hurts because I really liked Derek a lot. But things weren't working out and this is for the best.\" He runs a hand down his face and sighs. \"Did I lie to you?\"\n\"No.\" Scott sounds pained. \"You believe it. You really believe it. God, you are even stupider than I thought.\"\n\"And you just pushed past the best friend line. Please leave.\"\nFor a moment it seems like Scott's not going to, the way he's standing there with his shoulders hunched and a mulish expression on his face. Then he shakes his head, shoulders slumping, and heads for the door. \"Call me when your brain starts working again,\" he says as he exits.\nStiles flips him off and leaves it at that.\n*\n\"Um, are you alright?\" Allison asks, her face concerned and her hands twisted up together in her lap.\n\"Yeah, sure,\" Stiles says because telling the truth won't help anyone here. \n\"Because you don't look alright,\" Allison continues like he didn't say anything at all. \"And you aren't acting alright. And I'm worried about you. We all are.\"\nStiles doesn't ask who that 'we' includes because he doesn't want to know. \"I'm fine.\"\nAllison's teeth bite into her lower lip. \"Do you want to talk about it?\" she offers hesitantly. And hell no he doesn't want to talk about it. Why in the name of god would anyone want to talk about it, let alone an emotionally constipated teenage boy? But Allison is doing that wounded puppy look and Stiles finds himself nodding anyway.\n\"Just, not here,\" he says because the last thing he needs is for it to get around the school that he was crying in his soup over his not-breakup with his not-boyfriend.\nAllison nods, her eyes wide with compassion. “I understand completely.” She places a hand over Stiles's and squeezes slightly. “How about my place, after school?” \nStiles nods, then winces as a thought crosses his mind. “Um, don’t take this the wrong way, but can you not tell Scott or Jackson about this? I mean, I know you won’t tell Jackson because you know how things are between us, but don’t tell Scott either. He’s...” Stiles trails off with a shake of the head. \n“Don’t worry, I won’t tell him. I know how good he is at being emotionally sensitive.”\nStiles snorts at the fact that she actually said the words ‘emotionally sensitive,’ let alone in reference to Scott. She laughs a little at that and Stiles can’t help but join her. \n“It’s good,” Allison says when they’ve calmed down.\n“What is?”\nShe lifts a shoulder. “That you’re still able to laugh. I, uh, wasn’t. When things went bad with Scott, that is.”\nStiles nods. “Well, you and Scott. You’re a forever kind of love, aren’t you? Me and Derek,” he shrugs. “Not so much.”\n“Don’t say that,” Allison pleads, her hand squeezing Stiles's again. \nStiles shrugs, but doesn’t say anything. Because Allison really is a Disney Princess, even if Stiles is not.\n*\n“I heard about your little relationship powwow with Allison,” Lydia says, slapping her tray down in front of Stiles. She plops down on the bench and fluffs her hair. \nStiles swallows a bite of P.B. and J. and carefully sets the rest of the sandwich down. “Please don’t tell me that you are looking to be part of round two. Because I’ve had as much strictly friends female bonding as I can take.”\nLydia gives him her bitch please face. “Don’t be stupid,” she says as she peels the lid off of a chocolate pudding. She licks it clean a little more graphically than Stiles is comfortable with and then smirks at him. “I’m not the sort of girl who cries over lost loves. I’m the sort who gets even. And right now I’m think you need that second sort much more than the first. Am I right?” Stiles nods and she preens. “Of course I’m right. Anyway, here’s the deal.” \nShe places both of her hands on the table and leans forward. “You and Derek? Happy little couple. Everything is lovely and wonderful and the world is decorated with rainbows or whatever. Or at least that’s what the other three idiots I hang out with seem to think. Me? Not so much. Because you and Derek, you never do anything together.” Stiles opens his mouth to protest that, but she cuts him off with an upheld finger. “You snuggle on the couch, in Derek’s house, you play video games, in Derek’s house, you eat dinner together, in Derek’s house, you fuck a lot, in Derek’s house. Are you sensing a pattern here?”\nStiles scowls at her. “We went for walks a lot too,” he mutters.\n“Oh, yeah. Good point. You walked together. In the woods behind Derek’s house. Where no one could see you at all. Because that’s the stuff that dream dates are made of.” \nStiles shifts in his seat. “Dude, I didn’t need a dream date. I just a needed a date.”\n“Exactly,” Lydia says with a head nod. “And you didn’t get it, did you?”\n“No.”\n“And that’s why you dumped his sorry ass, isn’t it?”\n“No.”\nLydia blinks at that. “What?”\nStiles stares moodily at his chocolate milk for a moment and then sighs and shakes his head. “Okay, yeah, it had something to do with it. But that’s not why I, uh, ended things.”\nLydia waits for him to continue and when he doesn’t, she make a tell-me-more hand motion and says, “And?”\n“And, well,” Stiles bites at his lower lip. “Look, I knew he was messing around with someone else alright. I could handle it just being about the sex. I mean, it’s not exactly fun knowing that someone you care about is just in it for the happy times, but I could deal with that. Him sleeping around? Not so much.”\nLydia holds up a hand. “Wait. You are saying that Derek was cheating on you?”\n“No!” Stiles scowls at her. “We weren’t dating. How many times do I have to say it? We. Weren’t. Dating. And so, no, he wasn’t cheating on me because you can’t cheat on someone you aren’t with.”\n“You do realize that you are the only person who thinks that the two of you weren’t dating, right?” Lydia dips her spoon into the chocolate pudding and does that overly graphic licking thing again.\nStiles averts his eyes. “Um, that’s not true.”\n“Yeah, it is.”\nHe shakes his head. “No, it’s not. Derek, uh, look can’t you just take my word here?”\n“No.”\nStiles makes a face. “Fine. I asked him about it. If we were dating or not. And he said not. Every single time I asked, he said no. So,” Stiles shrugs, “I stopped asking. He made his feelings clear enough, after all, and I wasn’t going to just keep pushing the issue. It was just sex. That’s all. And, like I said, I was sorta okay with that because sex with Derek is, god, just the most amazing thing in the universe is all. Yeah, it sucked that he wasn’t as into me as I was into him, but that’s life. And, really, who can blame him. I mean, have you looked at Derek lately? He’s the whole enchilada. And I’m just a side of chips.” \n“Don’t be so hard on yourself,” Lydia says, her eyes going limpid. “You are at least refried beans.”\nStiles crumples up his napkin and chucks it at her. “Fuck you and the horse you rode in on,” he laughs. But she doesn’t laugh with him. \n“I’m sorry,” she says instead, “I didn’t know. About what he said, or that he was fucking around or any of it.”\n“Yeah, well,” Stiles shrugs. “What can you do?”\nShe brushes her hair off her face, suddenly looking serious for the first time since she sat herself down. “How did you find out. Did he tell you? Or?”\n“Jackson told me,” Stiles admits. “He, uh, saw it go down and then tried to warn me about it. But he was such a fucking dick that I ignored him at first.” Stiles takes a sip of his chocolate milk. “But, well, once I knew what to look for, the signs were totally there. So yeah. There you have it.”\n“Jackson,” Lydia repeat, slowly. “Jackson is the one that told you what was going on?”\n“Yup,” Stiles confirms. “I guess I should thank him for it, but that guy’s seriously the biggest tool I know. No offence.”\n“None taken.” She looks thoughtful for a moment, then tosses her head and smiles winningly at him. “Enough of the sob story, sweetie. Let your Auntie Lydia tell you how you are going to make the Big Bad Wolf suffer for his crimes.” \nStiles laughs again and shakes his head. “I don’t want him to suffer for anything. But I wouldn’t mind hearing what you’ve got up your sleeve anyway. Something tells me that you are going to lead me down the path that rocks.” \n*\n“You have got to take him back,” Jackson says by way of greeting, his eyes all crazy and his normally perfect hair mussed.\nStyles slowly closes his locker before turning towards Jackson, a frown in place. “Take who back?” he asks just to be an ass. \n“Derek,” Jackson replies, panic clear in his voice. “Dude’s gone totally mental.”\n“Yeah, not my problem.” Stiles hitches his backpack onto his shoulder and turns to walk away, but is stopped by Jackson’s hand on his arm. “What?”\nJackson swallows nervously. “I lied,” he says, his voice little more than a hiss. “About it all. There was no other person. There never was. So, just, take him back, alright?”\nStiles shrugs off his hand. “Nice try, but it isn’t going to work.”\n“Please.”\n“No.” Stiles starts walking, hoping Jackson gets the hint, but of course he doesn’t. No, Jackson just hurries along at his side, babbling about mistakes till Stiles wants to punch him in the face just to get him to shut up. “I’m seeing someone new, someone who actually manages to make me happy,” he says, which is a total fucking lie, but Stiles doesn’t care. Jackson is too messed up right now to tell anyway. “And even if I wasn’t, I still wouldn’t want him. Because he doesn't want me. Not really. And I’m sorry, but I’m no one’s consolation prize.”\nJackson snorts. “Sorry to ruin your Hallmark moment, but that’s ass.”\n“Yeah, well I don’t care what you think.” He reaches out to open the door to the bathroom when he is suddenly up close and personal with an increasingly desperate looking Jackson. “Dude, let go of me!” He tries to shove the other boy off, but unfortunately Jackson is a freaking werewolf and so the shoving does nothing at all.\n“He’s going to kill me,” Jackson says, his voice a harsh whisper in Stiles ear. “He found out, somehow. And he’s going to kill me. Dude, and I was just having a little fun. Sure, it was a little fun at his expense, but nothing to go all crazy as shit over. I swear to god, I thought he was going to rip off my balls.”\n“And I’m very, very sorry for you, but, like I said, not my problem.” Stiles glances down the hall, trying to catch someone’s eye. “A little help here,” he calls, but no one wants to play good samaritan at all.\n“Just, talk to him. Please.” Jackson fingers dig into his arms. “Please, Stiles. It was a dick move, telling you what I did, but I don’t deserve to die for it.”\n“Funny,” Stiles says as the warning bell rings, “I think you do.”\n*\nBut he doesn’t. He really doesn’t. And that’s why Stiles is standing in his bedroom, staring at his phone, trying to work up the courage to dial Derek’s number.\n“You aren’t my consolation prize.”\nStiles whirls around staring open mouthed at his window where, of course, Derek is standing. Like it’s perfectly normal to scale your ex-not-boyfriend’s wall and then climb into his room uninvited. “Dude.”\n“You’re not.” \nDerek’s eyes are red and his fingers end in claws, so Stiles doesn’t say what he really wants to, which happens to be get the fuck out. Instead he goes with the much less likely to be rage inducing, “What?”\nDerek shifts his weight from one foot to the other, looking desperately uncomfortable. “A consolation prize.”\nBecause that clears things up. Stiles barely manages not to roll his eyes. “Oh.”\n“And I wasn’t cheating on you.”\nStiles does roll his eyes at that. “Yeah, I know.”\n“No, you don’t.” Derek takes a step closer, one hand reaching out almost as if he wants to touch Stiles and Stiles can’t help but flinch back. Derek’s eyes widen at that and his hand drops, fingers curling into fists. “I didn’t cheat on you,” he repeats, his voice a low growl. “And not just technically the way you are telling everyone I didn’t. Because, fuck that. Of course we were together enough for it to have been cheating if I had been fucking someone else.”\n“Oh.”\n“Yeah, oh.” Derek takes a deep breath. “And that’s another thing. We were dating. We were. Even if it was just a shitty type of dating where we just hung around the house and had sex alot. We were still together. It was still important. At least it was to me.”\n“Derek,” Stiles starts, but he stops when Derek shakes his head.\n“No, let me finish. Then you can talk. Or not. Whatever. Just,” he shakes his head again. “Let me finish, okay?”\nStiles nods. “Okay.”\nDerek flexes his hands, then nods. “Right. Like I was saying, we were together. A couple. Boyfriends, if you have to label it. Even if I was a crap one half the time and more likely to bite your head off then tell you how much you meant to me. And,” he takes a steadying breath. “I’m sorry about that. That I never told you. I wish I had. I wish to god I had. Because you were my,” he trails off with a strangled sound, “Being with you made me happier than I’ve ever been in my life. It’s stupid for me to say that now. It’s stupid and it doesn’t even mean anything because how can you even believe me, when I never so much as told you I liked you when we were together?” He lets out a broken laugh. “But I couldn’t let you go on thinking that what we were didn’t matter. That you didn’t matter. Because it did. You do.” \nHe licks his lips and takes another deep breath. “And I’m happy for you,” Derek grits out, sounding exactly the opposite of happy. “Happy that you’ve found someone new. That they make you happy,” he practically chokes on the word. “You deserve to be with someone who can tell you how they feel, who doesn’t make you second guess yourself. So yeah.” Derek’s shoulders hunch forward like he’s expecting a blow. “There. I’ve said what I wanted to say. Your turn now.”\n“Derek,” Stiles’s heart is beating so fast he’s surprised it doesn’t explode and he’s smiling, he knows he is, and probably looks like a maniac, but he can’t find it in him to care. “You are a fucking idiot, you know that?”\nDerek’s eyes widen, hurt flashing across his face. Then he squares his shoulders and nods. Clearly he’s planning on taking this like a man, or whatever. \nStiles laughs, one of the raucous ones that makes people turn and stare. “You are the stupidest fucker I’ve ever met. Seriously? You think there’s someone else? That there could ever be someone else? Are you really that dense? I mean, the whole rest of the world can tell that I’m ass over elbows for you and you think I’ve moved on?”\n“There’s no one else?” Derek ask, his voice so hopeful that it makes Stiles ache inside. \n“Get you stupid face over here.” Stiles gestures to him and Derek crosses the room faster than Stiles's human eyes can process. “Closer,” he says, taking hold of Derek’s jacket and yanking the man into his personal space. He reaches up and cups a hand behind Derek’s head, pulling it down towards his neck. “Take a good, long sniff and and tell me yourself if there’s someone new.”\nOne of Derek’s hands fists in the back of Stiles’s shirt, tugging him closer until they are pressed chest to chest. The other hand strokes along Stiles's jaw before pushing at his face, angling his head away so that Stiles's neck is one long arc. Derek buries his nose in the crook of Stiles's neck, inhales deeply and then lets out a sharp, satisfied howl.\n“Mine,” he growls a second before he bites down. \nStiles's legs go weak and he practically swoons, which is really way too girly for him to even admit to himself, but still. That’s what happens. It’s hard not to swoon when your super sexy boyfriend-after-all is doing absolutely filthy things to your neck. Ask anyone.\n*\n“So, then, we’re back together right?” Stiles asks three hours later as he snuggles up against Derek’s chest in postcoital bliss. \n“Of course we are,” Derek growls, his arms tightening possessively around Stiles's body. \nStiles pokes him in his side. “Don’t go all sour wolf on me,” he teases, turning his head far enough to press a kiss to one of Derek’s ridiculously perfect pecs. “I just want to make sure there are no future misunderstandings is all.”\nDerek growls again, that old familiar rumbling in his chest that never fails to make Stiles's heart skip a beat. “What part of mine didn’t you understand?”\n“Oh, no part in particular,” Stiles says happily. “Just wanted to hear it again, is all.”\n“Mine.” This time Derek’s growl is almost a purr. “Mine.” He presses a kiss into Stiles’s hair. “Mine.” He nips at Stiles’s neck. “Any questions?”\n“None whatsoever,” Stiles reassures him. “And, just for the record, you’re mine as well.” \n“Good,” Derek says sleepily. “Now shut the fuck up already and go to sleep.”"
}