{
    "id": "4064119",
    "url": "https://archiveofourown.org/works/4064119?view_full_work=true",
    "author": [
        "Sena"
    ],
    "title": "Sparked Up Like a Book of Matches",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Marvel Cinematic Universe",
        "The Avengers (Marvel Movies)",
        "Captain America (Movies)"
    ],
    "relationships": [
        "James \"Bucky\" Barnes/Steve Rogers"
    ],
    "characters": [
        "James \"Bucky\" Barnes",
        "Steve Rogers",
        "Sam Wilson (Marvel)",
        "Natasha Romanov",
        "Tony Stark",
        "Clint Barton",
        "Pepper Potts",
        "Peggy Carter"
    ],
    "additional_tags": [
        "Post-Captain America: The Winter Soldier",
        "Canon-Typical Violence",
        "Mental Health Issues",
        "Post-Traumatic Stress Disorder - PTSD",
        "Tony Stark Has A Heart",
        "Steve Angst",
        "Bucky Barnes Has Issues",
        "BAMF Natasha",
        "Sam Wilson is a Gift",
        "Sam Wilson Is a Good Bro",
        "Clint Barton Is a Good Bro"
    ],
    "language": "English",
    "series": "",
    "published": "2015-06-03",
    "completed": null,
    "words": "26,734",
    "chapters": "1/1",
    "comments": "735",
    "kudos": "15,517",
    "bookmarks": "6,032",
    "hits": "192,187",
    "summary": "<p>Steve lives in Stark Tower and doesn't have much to do when he's not going after Hydra strongholds. He attends charity events to make Pepper happy. He goes hiking with Sam. He hangs out with Clint in Bed-Stuy and watches Dog Cops. Sometimes Tony gives him super alcohol in a sippy cup. Sometimes he sees Bucky out of the corner of his eye and wonders if it's real or if he's starting to lose his mind.</p>\n<p>Alternately, the one with terrible jokes, a foot chase through the Lower East Side, and a tiny little robot named Shitcan.</p>",
    "notes": "<p>This was 95% complete before <i>Age of Ultron</i> came out, but then life happened. I considered rewriting it to be MCU canon compliant, but life happened again. It's not an AU, but it also doesn't take anything from <i>Age of Ultron</i> into account.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
    "text": "\"Five days,\" Steve says as he gazes across the lights of the city. He rests his arms on the railing in front of him, rests his chin on his arms.\nSam says, \"Okay,\" in a tone that conveys that he doesn't know what he's saying okay to.\n\"I went to that lunch with Pepper today, the one for the charity that gets medicine to kids who need it, and I was talking to one of the doctors and she told me five days, now, that's all it takes to cure scarlet fever. One pill, once a day, for five days, and you're fine.\" As the doctor had talked to him, Steve had seen Bucky out of the corner of his eye but when he turned, no one had been there. He doesn't mention that part to Sam.\n\"Yeah, they're called antibiotics,\" Sam says. \"What, they didn't have...\" his voice trails off and he sits next to Steve on the bench and sighs. \"They didn't have antibiotics in the 40s?\"\n\"We did in the military,\" Steve says. \"They couldn't give you much in case it shut down your kidneys, but if the choice was that or losing your leg, well.\" He shrugs. \"Must have been '26 or '27 when I got sick, though. Maybe the Germans had something by then, but we didn't. You ever have scarlet fever?\"\nSam shakes his head.\n\"It starts in your throat, like an itch, and as your fever starts to climb, your tongue swells up and turns white and that's when they know, really, even before the rash, that it's scarlet fever. You can't swallow, it hurts so much. You're freezing and your joints ache and your fever keeps spiking and you start to hallucinate. I, uh, I thought things were crawling on me and there were voices that I didn't recognize whispering things that didn't make any sense. My mom had to fight me just to get me to drink broth, but I threw it up most of the time, anyway. Then I got pneumonia from being so worn down from the scarlet fever and I was so lucky, Sam. Nobody seems to understand how I lucky I was to make it through. Talking to people today, to make them understand I'd have to tell them I survived bird flu only to fall sick with Ebola.\"\nSam lets out a long, concerned breath.\n\"And once I was better, once I survived, we didn't even know it but the worst part was happening under the surface. I looked healthy, but scarlet fever messes with your body's immune responses, and my body started attacking itself. I was fine and then my stomach started to hurt, my ankles started to swell, then my knees, then my hips. I got another rash, curved like snake scales. It hid it from my mother as long as I could, but I couldn't hide the way I couldn't ever catch my breath anymore, and she caught me pressing on my breastbone more than once, trying to stop the pain.\" He laughs, short and sharp. \"I thought I was being so brave. I thought I was protecting her, that I had to because I was the man of the house. I was eight.\"\nSam shrugs. \"Eight's a good age to get a job down at the factory.\" He pauses. \"Please don't tell me that you got a job in a factory when you were eight because I'm going to feel like an asshole.\"\n\"I wasn't supposed to make it to twelve,\" Steve tells him. \"Then I wasn't supposed to make it to eighteen. Wasn't supposed to make it to twenty five.\"\n\"And look at you, now,\" Sam says.\nSteve nods and gazes out towards the darkness of the East River and the lights of Queens beyond it. \"I wouldn't have made it to thirty. I barely made it to twenty five. My valves just didn't work right, had been too damaged, my heart muscle had been too damaged to ever work right. It was just a matter of time before it gave out. And now nobody even knows what rheumatic fever is anymore because if you get scarlet fever, they give you pills for less than a week and you're fine.\"\nSam's silent for a moment, then he says, \"That's a good thing, Steve. Like, I'm sorry you had to go through that, but--\"\n\"I'm not angry about it,\" Steve says. \"Thank God there's a cure. Thank God for antibiotics and vaccines. I'm not angry about it, I just keep wondering, you know. What would I have been like if it hadn't taken me down like that? What if my heart had pumped enough blood and oxygen to let me grow like other guys? How tall would I have been? Would I have loved art as much as I did if I'd had the ability to play stickball instead? Would I have scrapped as hard and as often? I mean, I'm no fan of talk therapy, but I'm self-aware enough to know I did it to prove a point, to prove that even though I looked small, I wasn't small.\"\n\"You mean Captain America wasn't too good for something as ungentlemanly as fisticuffs in a back alley?\"\nSteve laughs and leans back, laughs long and hard, then slumps against Sam's side and actually says, \"Whew,\" which sets Sam to laughing.\n\"I always thought that was bullshit,\" Sam says after a while.\n\"Hmm?\"\n\"The whole thing where you got 4F'd over and over again because you weren't fit enough to serve. I figured it was wartime, they'd take anybody they could get, but they really wouldn't take you, would they? They're lucky you survived basic.\"\nSteve laughs and says, \"I'm lucky I survived basic. All that jogging should have given me a heart attack.\"\n***\nHe remembers the night Bucky had left for basic training, how angry and jealous and guilty it had made him feel knowing his best friend was heading off to fight without him. He remembers Bucky coming home on leave after, remembers not recognizing him at first. His posture had changed enough that Steve hadn't even noticed him out of the corner of his eye. That had never happened before. He'd been so attuned to Bucky for so long that just a glimpse of him in a crowd had been enough, but Bucky'd been in his line of sight for a good thirty seconds before it even occurred to Steve who he was.\nHe'd always walked with swagger, but now he walked with confidence. Even the way he stood when he was relaxed was controlled, like he couldn't make himself slouch even if he wanted to, like he didn't know the meaning of the word sloppy. He never made a big deal of it, especially in front of Steve, but man had Bucky ever been proud of himself. He deserved to be. He'd left a bum, a good-for-nothing who'd maybe scrape by working the dock yards but never make anything of himself, and he came back PFC Barnes, a guy who was starting at the bottom, sure, but had potential.\nHe came back eleven months later with chevrons on his sleeve, the respect of the men who called him sergeant, and nightmares he never talked about. When he put his hat on and turned that soft grin on Steve, he was as handsome as Gary Cooper.\nSteve remembers shipping off to basic knowing he'd never look like Gary Cooper, but aching with the need to do something, to make a difference.\n\"Window dressing,\" Steve says, gazing up at the ceiling of Tony's lab. It's rotating gently. Or maybe he's rotating. Or maybe he's imagining it. The cement floor is the most comfortable thing he's ever lain on.\nTony leans across the counter and looks down at him. He says, \"Interesting.\"\nSteve waves his hand and says, \"Wanted to make a difference and what was I? Window dressing. Nothing but hot air. So much bullshit.\"\nTony says, \"Dum-e, are you writing this down? Never mind. JARVIS, are you recording--\"\nSteve says, \"Every guy over there knew it was bullshit. Every guy over there knew we couldn't tell the truth, not if we wanted everybody at home to stay sane. They couldn't ever know what it was like to watch your friends die. They couldn't know that we were outmanned, outgunned, undersupplied, that we were never happy, just pants-shitting terrified or bored out of our goddamn minds, no in between.\"\nTony says, \"Did you just say pants-shitting?\"\n\"And I was the symbol of that lie,\" Steve tells him. \"I was the face of it. Every guy looked at me and knew what I was, what a damn dirty lie I was telling. Sure, maybe they knew we had to tell it, but I wanted to make a difference and I ended up as a shill.\"\nTony says, \"Do you mind if I do some blood work, run a couple of labs, maybe, because this super-alcohol is apparently more potent than I expected.\"\n\"I'm not that drunk,\" Steve says, and he's not. He's just nice and drunk.\n\"You might think so, but may I remind you that you just said pants-shitting.\"\nSteve says, \"What do you call the feeling you've got when your rifle's frozen so all it's good for is bashing Krauts in the head and there's a guy you knew from basic rotting half in and half out of a foxhole ten feet away from you and you can't hear yourself think because the bombardment's not stopping, hasn't stopped for hours, and your ears are ringing and your second lieutenant's started laughing and nobody knows how to get him to stop short of shooting him and each explosion is just a little bit closer to your location but you can't run because you're dug in and it's freezing. Each explosion is getting closer and there's nothing you can do and you can't even shoot your fucking gun until it thaws and you know you're not going to see dawn, and what do you call that? What do you call that feeling, Tony?\"\nTony says, \"Pants-shitting dread.\"\nSteve sits up and gives him a wide-eyed grin and two thumbs up, says, \"Buy war bonds for our boys on the front lines. If you want 'em home by Christmas, help 'em sock ol' Adolph in the jaw!\"\nTony says, \"I'm simultaneously relieved and horrified that you're this cynical.\"\nSteve lies back down on the cement floor of Tony's lab and says, \"It was a lie I had to tell. A lie for the greater good. I don't regret the lies I told, but they were lies just the same. Can you make super beer? This stuff tastes like rubbing alcohol.\"\n\"It kind of is,\" Tony admits. \"Not entirely, not chemically, but roughly similar to, well. Details. Super beer, I'll look into it.\"\nSteve dozes for a while and enjoys the way the super alcohol makes him feel like he can't help but smile.\nHe wakes to whispered voices, Tony saying, \"No, no I didn't, it wasn't me, turns out that he's just really vulnerable to Skinnygirl margaritas--\"\nPepper's whispering back, \"I can't believe you!\" and, \"Human testing!\" in between other words that are actually too quiet for Steve to understand.\nSteve says, \"If it makes you feel any better, this isn't the first time I've been a Stark Industries guinea pig and it's always turned out fine so far.\"\nPepper says, \"Don't give me that triumphant look. Drunken nostalgia is not the same as informed consent.\" She comes around the corner and gazes down at Steve. She says, \"I'll do my best to reign him in from this side, and if you could also make sure he gives you all the necessary information before you agree to let him experiment on you, that would be fantastic.\"\nSteve gives her the thumbs up and thinks that she's got really nice stems, but he keeps that to himself because he's a gentleman.\nTony says, \"I'm sorry my dad irradiated your balls without having you sign a proper consent form.\"\nSteve laughs and says, \"I actually belonged to the United States government at that point so my consent was irrelevant, but thank you anyway.\" He reaches out and picks up the bottle of super alcohol, then squirts a little bit in his mouth. He's finding that if he takes a drink of it every twenty minutes or so, then he doesn't get any drunker but he doesn't sober up.\nPepper says, \"You gave him alcohol in a sippy cup?\"\nTony says, \"What? It's practical.\"\nSteve picks up the plastic bottle Tony had given him. It's got Mickey Mouse playing a guitar on it, which Steve doesn't mind even if he's more of a Donald Duck kind of guy.\nSteve says, \"Hey, JARVIS? Could you put all the Donald Duck cartoon shorts into my to-watch queue?\"\n\"Of course, Captain Rogers,\" JARVIS says.\nBucky'd done a great Donald Duck impersonation, muttering, \"What's the big idea?\" under his breath and adding in actual curses when he really needed to make Steve laugh, and once he got Steve to laugh he'd act offended, demanding, \"Oh, a wise guy, huh?\" and push himself into Steve's space and he'd crack a smile and he was so handsome it hurt Steve inside just to look at him. Sometimes he'd pull away and sometimes he'd let Steve kiss him and sometimes he'd kiss back and tangle his fingers in Steve's hair and they'd end up wrapped around each other in Steve's narrow bed, panting and kissing and touching everywhere.\n\"You have a to-watch queue?\" Tony asks him.\nSteve says, \"No. Technology too scary. Must burn it with fire.\"\nTony says, \"Okay. Apparently super alcohol turns him into Captain Sassypants, which I'm actually really okay with. Did I mention that he used the phrase pants-shitting in a sentence earlier? As an adjective, not as a noun, though, okay, I suppose that would be pants-shitter, not pants-shitting--\"\nSteve gets up and leaves Tony's lab with a wave to both him and Pepper, Mickey Mouse bottle of super alcohol in hand. He holds it up to the light and gives it a shake and, yeah, he thinks if he downs the rest of it when he gets back to his rooms that he'll be just drunk enough to watch Donald Duck shorts and cry himself to sleep.\n***\n\"I never kissed him,\" Steve says as he and Peggy sit on cushioned deck chairs in the middle of a manicured lawn. They're in the shade of two oak trees. She's wrapped in a wool cardigan and draped with blankets to keep the chill from her bones. Her wheelchair is just behind her deck chair. Her private nurse is sitting twenty yards away reading a book.\nPeggy laughs, brittle and so much older than he expects, even now that he's gotten used to her having gone on without him. It's still her voice, though, when she says, \"You're an awful liar, Steve.\"\nHe smiles softly to himself. He's an amazing liar. \"I never kissed him during the war. He enlisted right after Pearl Harbor and the last time I kissed him was a month earlier. I wanted to kiss him so many times but he hated it and I was losing him and I was too scared to do anything to make him run away from me any faster.\"\nPeggy sighs and reaches out to take his hand. Her skin is so soft, so thin, delicate as butterfly wings. She says, \"Have you told me this before?\"\nSteve shakes his head.\n\"It's all right. I know my mind sometimes wanders. Living to be this old is a blessing despite the complications. Have you told me about Bucky before?\"\nSteve says, \"Honestly, no. I thought it wouldn't be fair.\"\nShe laughs again and says, \"It hurt so terribly when you died, but I did manage to pick myself up and move on despite the heartache. You needn't hide things from me to spare my feelings.\"\nHe says, \"I thought it wouldn't be fair to trust you with something just because I knew you'd forget it. That'd make me a terrible friend, confiding in you while relying on your memory to erase my words.\" He gives her hand a squeeze. \"Not much to tell, anyway. I was stuck on him and he wasn't stuck on me. I thought I was over it, but I guess I'm not.\"\nPeggy squeezes back and says, \"You never really are, when it's love.\"\n***\nSteve lives in Stark tower, now. He doesn't like it, really, but it's better than anywhere else. It's better than living in an apartment and putting everyone else on the block at risk. It's better than going to live by himself in a cabin somewhere; months in Europe during the war notwithstanding, Steve's never been anything but a city boy.\nHe lives in Stark tower and he has his own floor. He has a library and a study, a gymnasium, an art studio with natural light, a giant kitchen with a pantry bigger than the cold water flat he'd grown up in.\nHe spends a lot of time in Tony's lab, leaning on a wall somewhere out of the way. Steve can't bear the thought of being alone and Tony doesn't ever seem to mind the company. Sometimes he heads over to Bed-Stuy to see if Clint's still alive. He always is. He's usually hungover.\n\"How many times have you broken your nose?\" Steve asks as he aligns his thumbs along the length of it.\n\"Don't know. Lots. Son of a bitch,\" Clint groans when Steve pops his nose back into place. He rolls off the couch and stretches out on the floor and says, \"You could have warned me.\"\nSteve says, \"Was there another reason you thought I was touching your nose like that?\"\nClint says, \"No. Stop being an asshole. I'm hungover, okay?\"\n\"Did you get drunk before or after you got your ass kicked?\"\nClint says, \"You think this is bad, you should see the other guys.\"\nSteve says, \"You want pizza or Chinese takeout?\"\nUnsurprisingly, Clint says, \"Pizza.\"\nThey eat pizza and watch Dog Cops and talk about work and when Clint mentions that Bobbi from SHEILD is his ex-wife, Steve chokes on his pepperoni.\n\"Easy there, buddy,\" Clint says, pounding him on the back.\nSteve thinks, But I flirted with her! He'd done it badly, but still. He thinks, Bobbi was married? To YOU? He says, \"Uh, I just, uh, it caught me off guard. Kind of hard to picture.\"\nClint says, \"Because she's out of my league or because I usually date guys?\"\nThankfully, Steve's busy recovering from choking or he'd start choking again. He says, \"She's not out of your league.\"\nClint laughs and says, \"Of course she is! I just knew it years before she figured it out is all. Oh, shit, rewind, who the hell is Sgt. Doberman chasing and why doesn't he have backup?\"\nSteve doesn't ask about the usually dates guys thing.\nIt's not that there weren't any queers back in the 40s because there were, and more than a few had lived in Steve's neighborhood. It's not that he thinks there's anything wrong with it. It's not that he's ashamed. It's just that it's not part of the dancing monkey lie he's still telling, even now after everything's fallen apart. It's just that his whole life it's never been the kind of truth that you told.\nHe wonders what would happen if he told the truth. He never wanted to sock Adolph Hitler in the jaw, he just wanted to stop a bully. He never wanted to kill anyone, but he has, a lot of them. Norman Rockwell might have painted it gentle and sweet, but war was never that. You went in knowing you were going to take human lives and you walked out because you were faster or stronger or luckier than the people trying to kill you back.\nHe wonders what would happen if people knew he'd earned two dollars a day drawing dirty comics for a living because the only thing he could do was draw and nobody was willing to pay him to create high art. He wonders what would happen if they knew he went to communist rallies sometimes because the people running them were his neighbors and his friends. He wonders what would happen if they knew that he'd been in love with Bucky Barnes. He wonders what they'd think if they knew the only times he'd had sex were because Bucky had taken pity on him and given Steve more than you could ask of any friend.\n***\nSam says, \"You don't have to talk about it.\"\nSteve nods. He knows that.\n\"You don't have to talk at all. In fact, we don't even have to sit here. This isn't a therapy session, this is just two buddies talking because you said you needed to, but we can call it off and go for a run or jump off a building or invade a small country, you know, whatever you're in the mood for.\"\nSteve says, \"I should talk about it, though, right?\"\nSam shrugs.\n\"That's what people do. They talk about the wars they've been in. They...work things out.\"\nSam says, \"Some of them do, yeah.\"\nSteve nods. He's sitting in Sam's office at the VA hospital in Brooklyn. It's small and it smells like a hospital. He's staring at the diploma above Sam's head. He doesn't have to work at the VA anymore; he's an Avenger with a salary and his own floor in Stark tower but he won't give it up. Steve says, \"Why social work?\"\nSam shrugs. \"Wanted to give back, seemed like a good way to do it. You know this story.\"\nSteve says, \"I don't think I'm ready to talk about it.\"\nSam says, \"You want to invade Staten Island instead?\"\nSteve says, \"No. Maybe we could get something to eat. Are you hungry?\"\n\"I could eat. There's a cafe a few blocks from here, serves great food plus the best gelato you've ever had.\"\nSteve says, \"I don't think I've ever had gelato.\"\nSam says, \"Yeah, just let me get my coat.\"\nSteve gets a mix of chocolate and hazelnut gelato at Sam's suggestion. It's good, but he has had ice cream before. Bucky had nicked Good Humor bars out of the ice chest at Hader's Grocery more than once when Mrs. Hader wasn't looking. Steve never did, but he did find a quarter on the street once and he and Bucky split a chocolate malt and a strawberry sundae and ate until they thought they'd be sick.\nOverseas, he'd had more ice cream than he could ever want. It raised the morale, or so he'd been told, to stuff the boys full of ice cream and chocolate. It wasn't something anybody'd ever complained about, especially compared to the rations they'd had to cart with them while on the front lines. The American GIs had eaten so much ice cream that Mussolini had banned it in Italy to keep anyone from getting the wrong idea.\nThey're walking on a trail they usually run and the wind cuts cold across the bay. Steve doesn't shiver. He's cold but he's been colder. Sam burrows into his coat but doesn't give up on the gelato. He's probably been colder, too.\nSteve says, \"We used to dig for clams on this beach.\"\nSam says, \"Eating anything that comes into contact with this water is fucking nasty, dude.\"\nSteve smiles and eats his gelato. He says, \"I'm not cracking up.\"\n\"Okay.\"\n\"You look at me like I'm cracking up, so I'm just letting you know that I'm not.\"\n\"I don't think you're cracking up, Steve. I think you're in pain. Maybe I'm not the right person to talk to, you know?\"\nSteve says, \"You're all I've got.\"\nSam nods. He finishes his gelato and tosses the cup towards the trash, then raises his arms in victory when he makes the shot. He says, \"I know a guy. He's really good. He deals with some heavy shit, man, not my level of touchy-feely functional PTSD, but some heavy fucking shit. He handles combat sexual assault, hostages who've been tortured, fucking prisoner of war shit. Like, if you're not telling me whatever you're not telling me because you think I can't handle it, that's fair because maybe I can't. Maybe you need to talk to somebody who's not your friend. Maybe--\"\nSteve says, \"I'm gay.\"\nSam says, \"Huh.\"\n\"I was in love with Bucky. He never loved me, not like that, but I loved him so much I couldn't breathe and I'm starting to see him everywhere. I know he's out there, but I'm seeing him everywhere, Sam. I see him in every crowd. I see him out of the corner of my eye fifteen times a day. Maybe I am cracking up.\"\nSam says, \"See him out of the corner of your eye like you're hallucinating him or see him out of the corner of your eye like maybe a super spy assassin's stalking your every move?\"\nSteve says, \"I don't know. I want it to be him, but I don't think it can be. He wouldn't let me see him, would he?\"\nSam says, \"Fuck if I know. Have you told anyone else about this?\"\nSteve laughs mirthlessly. \"Didn't want to ruin the Captain America image.\"\nSam sighs and says, \"Fuck that. And you know what I mean. You call Natasha and tell her you're seeing the Winter Soldier everywhere?\"\nSteve shakes his head. He's not seeing the Winter Soldier, he's seeing Bucky, but he's too tired to argue semantics. Either way, the answer is no.\n***\nThe thing about Donald Duck is that he's an optimist. No matter how much shit life throws his way, no matter how many times he fails, no matter how many times he loses his temper, he never gives up. He believes that there's good in the world and he believes that he'll find it.\nThere are dozens of Donald Duck cartoon shorts that Steve's never seen. They don't make them anymore because nobody makes cartoon shorts anymore, but they'd made them for decades after Steve's crash into the ocean. In one of the shorts he's never seen, Donald buys a box of pills that changes his voice from the nearly unintelligible squawk he's known for to a smooth, sophisticated tone. Donald's new voice helps him succeed in the world, but when he runs out of pills he goes back to being the hopeful failure he'd been before the miracle of modern science changed him. Steve wonders if that should seem as important to him as it does.\n***\nSteve starts taking art classes again. He knows Sam suggests it because he's worried and he wants something to get Steve out of his own head all the time, but it's a good idea. It's nice to draw again, to have assignments and things to work on.\nOne day, Steve walks out of the art building and into the sunshine and Bucky's right there leaning on a parking meter not half a block away.\nSteve stops and doesn't know what to do, to say. He wraps his arms around himself like he's cold. He ignores the lady beside him cursing him for stopping in the middle of the walk. He makes himself move towards Bucky and he stops five feet away. He says, \"Hey, Buck.\"\nBucky says, \"Why didn't you ever send anyone after me?\"\nSteve doesn't say it's because he was afraid he was going crazy. He tells another truth. \"Because you deserve not to be hunted.\"\nBucky seems to think about that for a while. He says, \"Come on, then,\" and turns to run.\nSteve keeps up, but barely. Bucky's fast and he knows the terrain, knows every fire escape and roof to cut across, knows which alleys they can duck through and which ones are blocked off. By the time Bucky stops, they're on the roof of a five-story building on Eldridge just south of Canal Street. Bucky's breathing hard but he's smiling as he leans forward to rest his hands on his knees. He says, \"That should have Stark pissing down his pant leg, huh?\"\nSteve's worn out. He has to brace himself as he catches his breath, too. He says, \"Stark?\"\n\"You think he caught all of that or you think we lost his surveillance boys around Delancey? I think we lost 'em at Delancey.\"\nSteve should maybe be surprised that Tony's got him under surveillance, but he's not. He's also not surprised when Bucky rushes to the ledge and jumps. He knows what Bucky's doing even before he hears his feet on the fire escape. He walks to the ledge and looks down, and once the landing's clear, he jumps and follows Bucky into a bare apartment.\nThere's a bedroll in the corner and a metal trunk pushed against one wall, but no other furniture.\nSteve says, \"This is cozy.\"\nBucky leans against the wall and stares at him.\nSteve says, \"You bring me here to kill me?\"\nBucky shakes his head.\n\"That's a relief.\"\n\"You trust me?\"\nSteve shrugs. \"Have to, don't I? The only other option is to treat you like an enemy and I don't want to do that. I'd rather trust you. Better a sucker than a lousy friend.\"\nBucky smiles just a tiny bit. His mouth barely turns up, but his eyes crinkle around the corners. Then his smile fades and he says, \"Better a lousy friend than a dead one.\"\nSteve shrugs again. He's never going to be cynical enough to give up on people. He's made his peace with that.\nBucky says, \"Did they tell you about the Dodgers, yet?\"\nSteve nods. It's when he and Clint had become friends, actually. Clint had said, You might want to sit down. Fuck. There's no easy way to tell you this so I'm just going to say it. Walter O'Malley moved the Dodgers from Brooklyn to Los Angeles in 1957. I'm really sorry, man. You need to hug it out?\nBucky says, \"Fucking O'Malley.\"\nSteve says, \"It seems like he didn't really have a choice.\"\nBucky says, \"You've always got a choice.\" He looks down at his hands. He's wearing leather gloves and a long-sleeved jacket. He says, \"What happened to Shirley Taggart?\"\n\"Went upstate to live with her aunt,\" Steve says. When Bucky just looks at him, he says, \"She got knocked up. Her folks sent her away so nobody'd find out.\"\n\"Was it mine?\" Bucky asks.\nSteve says, \"I don't know. You took her out sometimes, but you weren't a steady thing. You never actually told me which girls you made time with and which ones you didn't.\"\n\"I think I asked her to marry me. I mean, I remember doing it, but sometimes I remember things that never happened. But I think I did.\" He sits down on the trunk and says, \"I don't think the baby was mine, but I wanted...\"\nSteve remembers Shirley Taggart and her gentle brown eyes and the way she'd always slip Steve extra helpings on the rare occasions he could afford to eat at the diner down the block. He says, \"You wanted to take care of her.\"\nBucky shakes his head and says, \"I think I wanted to be normal.\"\nSteve stuffs his hands in his pockets. He doesn't know what to say.\nBucky says, \"It was never personal. Stevie. You know it was never about you, right?\"\nSteve can't quite catch his breath. The room seems too small all of a sudden, too hot and cramped. He sits down on the window ledge and tries to breathe.\nBucky says, \"Did we kill a whore in Toulouse?\"\nSteve jerks his head up and just stares for a moment. \"What?\"\n\"Did we share a whore in Toulouse and then kill her to keep her quiet?\"\nSteve says, \"No!\" He shakes his head and he can't, he doesn't, \"What?\"\nBucky says, \"Okay. Okay, that helps. They're hard to pick out, the fake memories, but it helps knowing that one's implanted. I think maybe I can see the pattern, now.\"\n***\n\"Damnit,\" Sam says, leaning forward with his hands on his knees. \"I'm not sparring with you ever again. At least Nat never gives me the impression that I might stand a chance. She just comes in to whoop my ass, whoops my ass, and that's the end of it. You, though--\" He presses one hand to his stomach and says. \"I'm gonna puke.\"\n\"No puking in the gym,\" Tony says, sliding over to to the mat on a rolling chair. \"If you have to puke, puke over there near the drain. Easier to hose down. So, Steve, what's up?\"\nSteve ignores him because when Tony gets that look in his eye, it means he just invented super alcohol or just accidentally bought racy photographs possibly of Eleanor Roosevelt and wants to know if Steve can verify their authenticity since he was actually there.\n(\"I was never! Mrs. Roosevelt was an honorable woman and you, I can't even, if you're for one second suggesting that I would even think of disrespecting a woman of her calibre, my God, Tony!\"\n\"Calm your moobs, Cap. I just meant there as in you existed in the time period and may have actually seen her in person, not there as in you were the one slipping her the D train. Which, okay, obvious, seeing as she was a lesbian. Or, well, bisexual. I should call her bisexual, right? I mean, I don't know for sure that she was never attracted to FDR. I wouldn't have fucked him, but to each their own. Did you guys really not know at the time that she was having an affair with Amelia Earhart?\"\nSteve had searched Tony's face, looking for the telltale glint in his eye that meant he was full of shit. There wasn't one. Steve'd had to sit down.\n\"I take it the look of utter shock on your face means that it wasn't common knowledge. Do you need some super alcohol? I've been tweaking the recipe a bit. Don't tell Pepper.\")\n\"I didn't hit you that hard,\" Steve says in his own defense. He finally looks over at Tony. \"I didn't hit him that hard. You were watching. I pulled every punch.\"\nSam makes a rude gesture and says, \"Imagine that I don't need one arm to keep me upright and that I'm saluting you with two fingers right now.\"\n\"So, Steve,\" Tony says again. \"Do you know Ashley from human resources? I don't. But I've been assured that she's a very lovely girl.\"\nSteve says, \"I'm not interested, but tell Pepper I appreciate the thought.\"\n\"I feel a little bit like a pimp. A pimp by proxy. Because Pepper's the pimp. She's kind of, I don't know, I'm not saying you have to give Ashley the ride of her life, but she's apparently very patriotic and exuberant and--\"\nSam clears his throat and gives a tiny shake of his head.\nSteve says, \"I saw that.\"\nTony looks between them, then says, \"Captain Rogers, do you have a sweetheart?\"\nSteve rolls his eyes and starts unwrapping the tape around his knuckles.\n\"Sam, Captain Rogers has a sweetheart and you didn't tell me.\"\nSam says, \"Didn't know he was your type.\"\n\"I gave you wings, Sam. I invented your wings, which means they were my wings, and then I quite literally gave them to you, and you mock me?\" He looks at Steve and says, \"He's mocking me for being concerned about the state of your happiness. And he's not telling me about your new lady friend. What's her name? What does she do for a living? How does she feel about the sixty year age gap?\"\nSteve ignores him and says, \"Hey, Natasha.\"\nShe says, \"Hey,\" casually as she walks into the room with a purposeful stride. She stops when she sees Sam and raises one eyebrow. \"What did he do to you?\"\n\"Gave me that old, Let's spar like buddies, one on one, mano a mano, fair fight, bullshit,\" Sam says. He rolls onto his back, arms and legs splayed as he struggles to catch his breath. \"You're an asshole, Steve.\"\nNatasha's lips purse as she struggles to fight a smile. Then she gets ahold of herself and says, \"I've got intel on a Hydra base off the coast of Edgeoya. We can make it in six hours if we leave now.\"\nSam says, \"Edgeoya. That's not a real place. You just made that up. Where the hell is that?\"\n\"It's in the Svalbard archipelago,\" Natasha says, as if that's obvious.\nSam looks over at Steve and mouths, \"Svalbard?\"\nSteve mouths back, \"Norway.\"\nTony says, \"And you with your master's degree, Sam.\" He tisks and shakes his head. \"What is the American educational system coming to?\"\nNatasha says, \"Name one other island in the Svalbard archipelago,\" as she walks past Tony, swiping through something on her phone.\nTony says, \"I'm a scientist. The Svalbard peninsula--\"\n\"Archipelago,\" Sam corrects.\n\"The Svalbard archipelago is of no scientific value, therefore I forgot about it. Not important. Doesn't matter.\"\n\"Weak,\" Sam says, rolling up from the mat. \"Even for you.\"\nSteve walks behind them so they can't see him rolling his eyes.\n***\nSteve stands with his hands on his knees, catching his breath. Behind him is the roar of the Hydra base, burning. In front of him is the sea ice. The creak of it is faint beneath the overwhelming sounds of destruction, but his ears are tuned to hear it. It's familiar. He remembers. He hadn't been conscious those lost seventy years, but still, somehow, he recognizes the sound.\n\"You okay?\" Natasha asks with practiced casualness. It might be actual casualness. She might just be asking if he got hurt during the takedown. She's so good that he can't always tell what's real or not if she doesn't want him to.\nSteve says, \"I'm good.\" He doesn't say, Bucky asked if we had sex with and then murdered a prostitute in Toulouse. That's a memory they put in his head. Me and him just hanging out, being guys, murdering prostitutes. He doesn't say, I've been seeing Bucky around every corner, lately, and I thought I was losing my mind but it's really him. It's really him and he's there wherever I go and I know he's not my Bucky, not the one I lost, but I'm not the Steve I was, either.\nNatasha says, \"How're your ribs?\"\nSteve blinks and looks down, presses one hand to his aching side and takes a deep breath and says, \"A couple of them are broken.\"\n\"Going to see Dr. Yee broken or Steve's a stoic idiot broken?\"\n\"I'll be fine.\"\n\"You been to the arctic since they pulled you out?\"\nHe shakes his head.\n\"Is it weird?\"\n\"A little bit.\"\n\"Wanna get Thai when we get back?\"\nClint walks past them, fiddling with a metal tip on one of his arrows. He says, \"Pizza. And beer. Stark's buying.\"\n***\nSteve never knows how to describe the time he was in the sea ice. The time he was asleep isn't quite right because he wasn't asleep. He didn't dream. He didn't stir. The time he was in suspended animation sounds ridiculous. The time he was unaware. The time he was gone. All those years that disappeared around him between the time he'd thought he was going to die until the time he'd opened his eyes and known that something was very wrong.\nHis first thought was that the Nazis had him, that they'd been the ones to set up the recovery room that was so, so close but wrong in the important details. The baseball game on the radio had been the clumsiest mistake, but there had been more. The lamp at his bedside had been on even though sunlight streamed through giant windows; who would waste electricity like that with a war on? There hadn't been any voices coming from the street. He hadn't been able to smell anything but clean air. The moment he sat up, his stomach had been filled with dread. The woman with her strange, loose curls and odd makeup had confirmed it for him, that he was somewhere that was supposed to be America, was supposed to be New York, that might look convincing to someone who'd never been there, but not to him.\nAnd he'd been wrong. He'd been in New York. He'd been in Times Square, sanitized and lit up with more lights than he'd been able to imagine, but that had been the Knickerbocker right there, and Steve had known what Fury told him was true. He'd been asleep. It's not the right word, but it's the closest he's got. It'll do.\n***\nBucky finds him on his morning runs sometimes. He finds Steve at church. Steve had stopped going to Mass regularly after his mom died, but he finds it reassuring in this strange new world, even if they do say most of it in English now, even if Bucky drapes his arms over the back of the pew in front of them and doesn't ever kneel or pray.\nBucky finds Steve in the corner market and he finds Steve having coffee and sketching in the park and he finds Steve walking the streets of Brooklyn hoping for Bucky to find him.\nSteve never gives him any sensitive information, but he'll tell Bucky things after the fact. He'll say, \"We cleared out a Hydra base in Ohio last week,\" and Bucky will nod and sometimes he'll say, \"Good.\"\nSometimes Bucky's silent and wary, skittish like a colt.\nSometimes Bucky's overflowing with questions. Do you hate the pop tabs on the new beer cans as much as I do? Who had the wooden leg, Sister Mary Anna or Sister Mary Petra? What does cyberpunk mean? No, seriously, what did they give you to make you grow so big?\nThey're in a cafe on Myrtle Avenue, of all places. Steve had gotten jumped in the alley behind it more than once. Paying five dollars for a cup of coffee might hurt more than the beatings.\nBucky says, \"Do you live in that high rise because I can't get to you there?\"\nSteve blinks at him. He says, \"What?\"\n\"I don't know how to bypass the security systems. I've tried, but I haven't be able to, yet. I realized maybe that's why you stay there, because I can't get in.\"\nSteve says, \"You can just walk in the front door, Buck.\"\nBucky looks at him suspiciously.\n\"I mean it. You can visit me any time you want.\"\n\"Ninety stories in the air,\" Bucky says, shaking his head. \"Even the lobby's weaponized.\"\nSteve says, \"Do you need a place to stay?\"\n\"I stay wherever I want.\"\nSteve says, \"I know, but do you ever. Do you ever need a safe place? Somewhere you can sleep while someone else stays awake to keep watch?\"\nBucky shrugs and breaks his scone into pieces, then reaches over and tucks what's left of Steve's muffin into his jacket pocket.\n***\nThe peak of Bucky's eyelid isn't centered above his pupil like most everyone else's. The peak of Bucky's eyelid is closer in towards the nose. It makes his eyes seem turned down at the edges, makes him look sloe eyed and like he just tumbled out of bed or like he's about to tumble into it. His eyebrows are strong and straight, the brow bones prominent, adding another layer of shadow to his eyes.\nYou can see just a hint of where he'd had his nose broken, but not much. There's a tiny bump on the left side, but other than that his nose is straight and broad. His lower lip is just a tiny bit thicker than his upper lip and it's nearly a straight line, just the slightest curve at the corners of his mouth and where it curls under in the center, creating another shadow. His upper lip is two gentle swells above.\nHis cheekbones come up high at a sharp angle, making a point where they intersect with his downward sloping eyes. He has just the slightest cleft in his chin, which is easiest to see when he's clean-shaven.\nSteve was fifteen when he realized that Bucky made him feel sick to his stomach. He didn't know why. He just knew that every time Bucky laughed and slung his arm around Steve's shoulders, he wanted to throw up or maybe just cry. He did cry sometimes, feeling foolish and petty and embarrassed and so angry with himself for not being able to stop the tears before they started. Sometimes when Bucky'd go off with a girl, Steve would crawl into bed and just ache in his chest and his throat until he either fought his way through it or gave in to the tears. It was stupid of him to be jealous. It wasn't Bucky's fault Steve didn't have a girl, after all.\nSteve thinks he probably should have figured it out before sixteen, but he'd been a late bloomer.\nBucky was sprawled on the fire escape in pants and a white undershirt with the sleeves rolled up because it was September, sure, but it was a hot one, hot as any summer day. His feet were bare and he was smoking and he'd started working full time at the factory a few months earlier and Steve noticed the definition in his arms, the way his body was starting to look like a man's. Steve was sitting on the windowsill watching Bucky smoke, watching his body uncoil after a day of hard physical work.\nInside, Bucky's parents were squabbling the way they always did; not even a fight, just constant background noise. Bucky's sisters were saying rhymes and playing cat's cradle and Steve followed the angle of Bucky's jawline with his eyes and wondered what it would be like to kiss him right there in the hollow of his jaw beneath his ear, and he understood. He hadn't known before that that's the way he was, but he hadn't been surprised, either.\n***\n\"Tell me a joke, something, anything,\" Sam says with a weary sigh as they wait with no sign of action for yet another hour.\nSteve says, \"Little Audrey was playing with matches when her mama caught her and gave her a whooping. 'Don't you ever play with matches again,' her mama said. When Mama wasn't looking, Little Audrey started playing with matches again, the curtains caught fire, the walls caught fire, and in no time at all, their entire house had burned down, nothing but ashes. Sitting outside, wrapped in blankets on their neighbor's porch on the other side of the street, her mama said, 'If you think I gave you a whooping earlier, you just wait until your father gets home and sees what you've done.' But Little Audrey just laughed and laughed since she knew her father had gotten home an hour earlier and gone right upstairs to take a nap.\"\nSam's silent for a very long time.\nAfter a while, Clint's voice comes over the coms, saying, \"That's the most fucked up one, yet.\" He sounds like he's laughing so hard, he might cry.\nSam says, \"I'm going to have nightmares. Is that what you wanted? You want me to have nightmares?\"\nSteve says, \"It's a joke!\"\nNatasha's voice comes over coms, next. \"His jokes are all really fucked up, Sam. That's not the most disturbing one I've ever heard.\"\nSteve says, \"Little Audrey jokes are hilarious.\"\nSam says, \"There are more? There are more stories about Little Audrey the sociopath?\"\nNatasha says, \"Make him tell you the one about the cannibals.\"\nSam says, \"No! What is wrong with you?\"\nSteve huffs. It's not his fault Sam doesn't have a sense of humor.\n\"I think it's a Great Depression thing,\" Natasha says. \"Dark times, dark humor. Actually, his jokes remind me of a lot of Russian humor. Not the state sponsored stuff, but the jokes people tell each other in bars. The punchline's usually somebody dying in some awful way. They're pretty funny.\"\nClint says, \"What do you call a dog with iron balls and no hind legs?\"\nSam says, \"Please don't tell me.\"\nClint says, \"Sparky!\" and the tears of laughter are evident in his voice. \"Because his iron balls are dragging on the sidewalk. Get it? Sparky!\"\nSam says, \"All of you need Jesus.\"\n***\nSteve hates getting shot. He doesn't care how many vital organs the bullet missed or how quickly he heals, getting shot really hurts. Plus, he'd really liked that hoodie; it's hard to find shirts that fit at both his shoulders and his waist.\nApparently, he says as much to Natasha as she's helping him out of the elevator into the lobby of his floor of Stark tower. She laughs and says, \"Poor Steve. Finding shirts that fit you must be a trial.\"\nSteve says, \"I have a lobby. Whoa. Spinning lobby. Okay. Maybe I'm just going to take a nap here.\"\nNatasha doesn't let him lie down on the marble floor of the goddamn lobby, just urges him on towards his living quarters, laughing at how loopy he is. He knows he's loopy. He thinks he's allowed to be goddamn loopy since he just got goddamn shot and getting shot really goddamn hurts.\nNatasha says, \"Say goddamn one more time, I dare you,\" because apparently he's even loopy enough to say the things he's thinking out loud.\nSteve says, \"Moobs.\"\nNatasha laughs hard and hauls him into the media room and towards the couch, and then she drops him. She drops him and steps away and he doesn't fall, but he does have to lean against the entertainment center, a combination of the pain and the heavy painkillers they'd given him making him weak and groggy.\nSteve says, \"Nat, don't,\" even as he sees her drawing her guns. He slides down the wall and grimaces at the pain that shoots through his shoulder and down his spine. He says, \"Both of you stand down,\" though he can't say it as loud as he wants because the pain makes him a little breathless.\nFinally, he catches his breath and pushes against the wall enough to turn. Natasha's standing two feet away from him, breathing slow through her nose the way she does when she's terrified. She has both guns up and she's pointing them at Bucky's face. Bucky's got a gun, too, pointed right between Natasha's eyes.\nSteve says, \"Please don't shoot each other.\"\nNatasha says, \"How the hell did you get past security?\"\nBucky says, \"I walked in the front door.\"\nSteve says, \"It's okay, Tasha. It's okay. I promise.\"\nNatasha takes in one more deep breath through her nose, then takes her fingers off the triggers.\nBucky hesitates for a long moment before he lowers his gun. Then he takes long strides forward, past Natasha like he's not even concerned about her anymore, and kneels in front of Steve. He pulls gently at the scrub top they'd given Steve to replace his destroyed t-shirt and hoodie.\n\"I'm fine,\" Steve tells him. \"I just got shot a little bit.\"\nBucky frowns and touches the edge of the gauze covering the entrance wound in Steve's shoulder. \"Field dressing?\" he asks.\nSteve says, \"What?\"\nNatasha says, \"No. We just came from medical. The bullet penetrated the chest wall, avoiding all major arteries, the lungs, trachea, diaphragm, and heart. It exited just to the right of his fourth and fifth thoracic vertebra but there's no spinal damage. He's been under observation for hours and should still be in medical but he does this thing where as soon as he can stand upright for more than ten seconds at a time, he checks himself out because he doesn't want to be a bother.\"\nSteve says, \"What if somebody came in and was hurt worse than me and needed the bed? What if it was a baby? Tash, what if a baby came in and they couldn't save it because of me?\"\n\"It's not blood loss making him this stupid, by the way,\" Natasha says. \"They had to pump him full of rhinoceros tranquilizers for the pain.\"\nSteve says, \"I'm not a rhinoceros. Jeez. Hey, Buck.\"\nBucky says, \"Hey.\" His hand hovers over the dressing for another moment like he wants to peel it back and see how the wound's been treated himself. He doesn't.\nNatasha says, \"If you get his right side, I'll get his left, and we can get him onto the couch.\"\nSteve says, \"I can do it myself,\" but he really can't. He's sweating by the time they get him into a comfortable position and he thinks maybe he could have stayed in medical for just a little longer. As long as he wasn't being an inconvenience, maybe he could have just curled up in a corner out of the way and taken a nap.\nNatasha says, \"Maybe you can just take a nap right here.\"\nSteve says, \"Okay,\" and then reaches out to curl his fingers around the hem of Bucky's shirt. He'd meant to take Bucky's hand, but his coordination isn't the best. He says, \"Don't leave before I wake up. Promise?\"\nBucky says, \"I promise.\"\nSteve sleeps. He wakes for a little bit when Doctor Yee comes to check on him. He considers apologizing for the former Hydra assassin squatting on the coffee table and watching her work as he dangles a loaded gun from his fingers, but she doesn't seem concerned. She'd worked for Shield before and she patches up Avengers, now, so he supposes she's used to assassins just hanging around all the time.\nHe wakes up again to the sound of Bucky's laughter. The television's turned low, but Steve still recognizes the chase scene music from Dog Cops.\n\"Dog Cops?\" Steve asks. \"Really?\"\nBucky says, \"I kind of got hooked watching it through Clint's window all the time.\"\nSteve says, \"Why were you doing that?\"\n\"Because you were there,\" Bucky tells him. He smiles around the lollipop stick in his mouth, then takes it out and says, \"Oh, you need your medication. Open up.\"\nSteve says, \"What?\" which is really all Bucky needs to put the lollipop in his mouth. It's wet with Bucky's spit and it's got that artificial watermelon flavor that Steve secretly loves.\n\"Today I learned that when they need to give people rhinoceros tranquilizers, they dose lollipops. Doctor Yee makes them herself. Do they really give you drugs made for rhinoceroses?\"\nSteve says, \"You took my painkillers?\" around the lollipop in his mouth.\nBucky smiles at him and it's a soft, easy smile. His eyes are unfocused and he's more relaxed than Steve's seen him in decades.\n\"You're high as a kite right now, aren't you?\"\n\"It's pretty good shit,\" Bucky says, then laughs and slides down to rest his head against Steve's shoulder. \"You're also supposed to have a light, nourishing meal, but there's no food in your kitchen except for boxes of MREs and I don't think they count as light or nourishing.\"\nSteve says, \"I'm still a pretty bad cook. Usually I just have JARVIS bring me something.\"\nBucky sits up and the tension has returned to his body. He says, \"Oh.\"\nThe painkiller lollipop's starting to take effect and Steve can feel an ease in the throb of his shoulder along with the sensation of sinking further into the couch. He reaches out to touch the small of Bucky's back.\n\"Is, uh. Is JARVIS your boyfriend?\" Bucky asks.\n\"No. That would be weird. He doesn't even have a body. I don't think he does. JARVIS, do you have a body?\"\n\"Not in the traditional sense, no,\" JARVIS replies.\nBucky swivels and looks around the room with wide eyes.\n\"He's a computer,\" Steve says. \"Or, um, a program or, uh, I don't actually understand it. JARVIS, what are you, exactly?\"\n\"A multifunctional software program imbued with state of the art artificial intelligence technology, sir.\"\nBucky stands and turns in a circle, gazing up at the ceiling. He says, \"Open the pod bay doors, HAL.\"\n\"Very similar, yes, though much less homicidal, I assure you.\"\nBucky says, \"I am totally freaking out right now.\"\nSteve asks JARVIS to have the kitchen deliver Doctor Yee approved meals for both of them and Bucky crawls underneath the dining room table to hide.\n\"He can't actually see you,\" Steve tells him.\nBucky pulls his knees to his chest and glares at the floor. The member of the kitchen staff who brings the food up doesn't even notice that he's there, which is probably for the best.\nBy the time the food gets there, the painkillers have kicked in and Steve's not coordinated enough to hold a spoon. Thankfully, that's also around the same time that Bucky's dose of painkillers wears off and he's willing to come out from underneath the table.\nBucky helps Steve sit up and then feeds him spoonfuls of red lentil soup.\n\"You don't have to,\" Steve says.\n\"Shut up and let me take care of you.\"\n\"Why would you even want to? After what I did, how could you want to?\"\n\"Is this the part where you beat yourself up for not just magically knowing that I'd been dosed with Hydra super soldier serum that let me survive a three hundred foot drop onto razor sharp ice and jagged rocks? Because we can skip that part.\"\nSteve turns his head to the side and curls in on himself as much as he can without jarring his shoulder.\n\"Are you refusing to eat, now?\"\n\"No, just woozy. You eat yours. I'll be okay in a bit.\" Steve keeps his eyes closed and breathes through the waves of nausea. The painkillers they give him aren't actually meant for rhinoceroses, they're just meant for him. It's another case of him being a human guinea pig, but the alternative is not having any options for pain relief at all. Steve can tough a lot of things out, but he's dealt with bullet wounds both with and without pain medications, and with is better, even if they do make him dizzy and sick to his stomach.\nWhen the drowsiness comes, he lets it take him. He doesn't think he's ever fully asleep, but he's more out of it than in, just vaguely aware of what's going on around him. He hears Bucky asking if he's hungry, but he just shakes his head and doesn't even try to wake. Dog Cops comes back on, then the next thing he's aware of is Katherine Hepburn saying, \"You know, Norman, you really are the sweetest man in the world, but I'm the only one who knows it.\" He doesn't recognize the line, but by God he knows her voice and he opens his eyes to see what movie it is, but he's facing the back of the couch and the TV's behind him. He closes his eyes again and lets it go for the time being. He'll ask JARVIS about it later.\nIt's dark outside when he pushes himself up into a sitting position. He winces at the throbbing pain that shoots through him. He takes a deep breath, then another, letting the pain go. He looks around and says, \"Bucky?\"\nBucky says, \"Here,\" from the windowsill. He's sitting on the wide ledge with his knees pulled to his chest, silhouetted by the light of the city. He says, \"JARVIS, you wanna turn the lights up, like, thirty percent?\"\n\"Of course, Sergeant Barnes,\" JARVIS says.\nSteve says, \"Not scared of him anymore?\"\nBucky says, \"Me and JARVIS got to be old friends while you were passed out. Turns out if you ask a question while you're talking to yourself, he answers.\"\nSteve laughs as the lights slowly warm to a gentle glow. \"Do I want to know what the question was?\"\n\"I just couldn't find the john. How do you feel?\"\n\"Like I got shot.\"\nBucky moves so quickly that Steve doesn't even register the movement at first. He sits on the arm of the couch and pushes down the collar of the scrubs to look at the bandage on Steve's chest. \"You haven't bled through it,\" he says. \"Lean forward and I'll check the back.\"\nSteve takes a deep breath, then leans forward as he lets it out. He grits his teeth against the pain and tries to think about Bucky's fingers gentle against his skin as he quickly skims the scrub top up to look at the bandage over the exit wound.\n\"Good,\" Bucky says, letting go. \"You need to hit the head? I can lead you there and everything, now, got the whole layout down.\"\nSteve says, \"I can make it on my own,\" and he can. He manages to stand up and walk to the bathroom without stopping. He does have to lean against the bathroom counter once he's got the door closed and blink his eyes against the tears of pain, but he's fine. He even washes his hands afterwards. He'd feel like celebrating once he makes it back to the couch, but mostly he's just focused on not throwing up.\nBucky says, \"On a scale from one to ten, how excruciating was that for you?\"\nSteve says, \"Seventeen.\"\nBucky says, \"Yeah, that's what I thought. Open up.\"\nSteve doesn't even argue when Bucky pops another painkiller lollipop into his mouth. He situates it between his cheek and gum and waits, breathing slowly, for it to kick in. After a few minutes, he sighs.\n\"You wanna head back to medical?\" Bucky asks him.\nSteve shakes his head. \"I hate being sick.\"\n\"You're not sick, jackass, you got shot.\"\nSteve says, \"I hate getting shot, too.\"\nBucky says, \"No kidding.\"\n\"It really hurts,\" Steve whispers, then closes his eyes as guilt washes over him. He got shot, sure, but Bucky fell three hundred feet and got his arm ripped off in the process.\nBucky says, \"Just because somebody else experienced pain worse than yours doesn't mean the pain you're experiencing isn't valid. What you're going through right now is real, your pain is real, and comparing it to someone else's pain doesn't do anything but keep you from healing the way you should.\"\nSteve says, \"You sound like Sam.\"\n\"I have his office bugged. He's a really good counselor. I think I've learned a lot.\"\nSteve opens his eyes. He says, \"Bucky.\"\n\"What?\"\n\"You can't bug people's offices.\"\n\"Of course I can. It's pretty easy, actually. I can show you.\"\nSteve closes his eyes. The conversation about the moral and ethical implications of bugging a social worker's office and listening in on counseling sessions is going to have to wait until he's back up to full strength.\n***\nBucky comes and goes as he pleases. Sometimes he finds Steve on his walks and sometimes he sits down next to Steve in church and proceeds to eat a tuna fish sandwich and play with his phone instead of listening to the sermon, but mostly he just shows up at Steve's whatever time of the day or night he feels like showing up.\nWhen Steve gets home one night after a day that had started with physical therapy, gone through a flight to Washington to meet with a Senate subcommittee, and ended with a foiled Hydra plot to blow up said Senate subcommittee, he pushes open his bedroom door to find Bucky asleep in his bed.\nOnly, he's not really asleep. He had been asleep, but when Steve pushes the door open, he can see the coiled tension in Bucky's shoulders and he knows without asking that the hand Bucky has beneath his pillow is holding a knife.\nHe says, \"It's just me, Buck.\"\nIt takes a few moments for Bucky to relax.\n\"So, you know that rush of adrenaline you get when you're running your ass off to get out of the path of a self-destruct sequence?\" Steve asks him.\nBucky laughs softly and relaxes even more. His hand releases the weapon underneath the pillow. He says, \"Actually, yes.\"\n\"Gone through me and out the other side, now I'm wiped.\" Steve toes off his shoes and strips down to his t-shirt and shorts. \"Shove over.\"\nBucky shoves over and Steve slides into his bed. It's too soft and too big and he'd have returned it, only he didn't want to cause a fuss. What was he supposed to do? Ask for a raw cotton mattress like the one he'd grown up sleeping on? This one has coiled inner springs and memory foam and an embroidered brocade cover, and it's big enough that Bucky didn't even have to shove over, not really. The two of them fit in it side by side without even touching.\nSteve sleeps hard and doesn't dream. When he wakes, he smiles and rolls onto his side and is startled when he realizes that he's not back in the cold water flat he and Bucky'd shared so long ago. It's the smell, the smell of Bucky and the smell of the raisin quick bread coming in from the kitchen, the same recipe that he and Bucky had made countless mornings, the same recipe Steve's mom had made for them. With five ingredients, plus boiling water, not even Bucky could screw it up.\nSteve shuffles into the kitchen, yawning, and Bucky's sitting there at the kitchen table with a cup of coffee and a slice of bread that's still steaming.\n\"There's butter,\" Steve says. He rubs a hand over his face and yawns again.\nBucky says, \"I didn't want to waste it.\"\n\"Oh, wasting food's what the twenty-first century's all about,\" Steve says. He breaks off a piece of the sweet, sticky bread. Bucky's made it with chopped dates and golden raisins. They'd never been able to afford both at once before. He puts butter on his piece, then sets the dish next to Bucky's plate and they eat in silence. Steve's still waking up. Bucky's reading the newspaper. His arm is metal all the way up, even past the shoulder joint. Steve can't see where it attaches to Bucky's body beneath his rumpled t-shirt, but he can imagine. There's a red star on his shoulder, like a tattoo on metal skin. Steve knows the color and the imagery is supposed to provoke horror in him, but he'd slept through the Cold War. When people talk about Mother Russia, all he knows is what he's read. He doesn't have any emotions attached to Russia or communism at all.\nThe aesthetics of Bucky's arm appeal to him. He's fascinated with how it simultaneously looks like a real arm while looking nothing like a real arm at all. He's fascinated with the way the components move and slide against each other as Bucky turns a page in the newspaper.\nAfter a moment, Bucky looks up at him, looks down at his metal arm, then looks back up at Steve.\n\"Sorry,\" Steve says, looking away.\n\"It's all right. Your arms don't look the way they used to, either.\"\nSteve laughs and flexes his hands, nodding. Sometimes he's still surprised by how tall he is. Sometimes the width of his own palm seems impossible. He still doesn't know how to pick a big enough shirt just by looking at his choices.\nPart of him wants to ask what the last thing Bucky remembers is. He wants to know if Bucky remembers everything, anything, if he trusts his memories, if he remembers the war. Did you really trust me or did you just put your trust in me because you knew the men needed someone to believe in? Do you remember the months we fought shoulder to shoulder, the same height for the first time in our lives? Do you remember the Commandos? Do you remember falling? Do you really not hate me for letting you die?\nBucky remembers how to make raisin quick bread, at least, remembers how to stir the batter just right so the loaf doesn't come out tough despite being mostly just flour and water. Steve hadn't even remembered the recipe until he'd woken up smelling it. He doesn't cook, really. It's just him, after all, and besides, he wouldn't even know where to begin.\nThere are cooking shows on television, hundreds of them, channels devoted to nothing but cooking, and Steve can't bear to watch a single one. They throw away onion tops, throw away egg yolks, throw away pork fat. It's obscene.\n\"What do you think they do with the food they cook?\" Bucky asks as both of them sit in front of the TV in horror, watching a man throw away enough vegetable peels and tops to make soup stock for six people. \"Like, they put the dish that they just prepared into the oven, but then they pull one out that they cooked already so you can see what it's going to look like without having to wait. What do you think they do with the dish they prepared? Do they cook it and feed it to somebody? Do they just throw it in the trash?\"\n\"They have to cook it,\" Steve says. He looks over at Bucky. \"Don't they?\"\nBucky says, \"Hell if I know. God, I'm glad you weren't awake for the eighties. If you think we're living in a world of excess now, the eighties would have killed you.\"\n\"What do you remember?\" Steve asks.\n\"About the eighties? Shoulder pads and cocaine, mostly. And killing the prime minister of Sweden.\"\nSteve presses two fingers to the spot above his right eyebrow where his headaches always start and wishes he hadn't asked.\n***\nSteve's nightlife consists mostly of benefit galas that he shows up to whenever Pepper asks. He has a selection of suits and Pepper always sends him a note the morning of so he knows which one to wear. Black wool suit, white shirt, white pocket square, Bruno Magli oxfords, gray/black/white tie of your choosing. Gala is to benefit elementary science programs. Speakers can be long-winded, recommend packing a granola bar to get you through.\nHe takes Pepper to the science gala and is thankful for the granola bar and doesn't mention the true cost of human testing even once, even though he wants to just to be contrary. The people at the benefit gala are nice people, though, and they don't deserve him being difficult just because they mention once or twice that he's the result of the world's best science experiment.\nHe thinks Bruce should have come with them, not because he'd enjoy it, particularly, but just because nobody dares to mention how great they think Steve the Science Experiment is when Bruce is around.\nWhen Steve gets home, Bucky's there, sitting on the edge of his bed. Steve smiles and says, \"How do you politely mention to people that referring to you as an experiment to your face is kind of rude?\"\nBucky just looks at him with wary eyes\nSteve starts getting undressed and says, \"Yeah, you're right, better not to say anything at all and just suck it up. Are you hungry? I had about five hundred canapes once they actually started bringing food around, mostly these shrimp cucumber things with a little curried cream cheese. They were good. Anyway, I ate already, but if you're hungry I can make you something.\"\nBucky just watches him.\nSteve hangs up his suit and pulls on track pants and a t-shirt and says, \"Heating up the beef stew from an MRE totally counts as cooking, you can ask anyone.\"\nBucky just watches him and doesn't say anything, so Steve brushes his teeth and washes his face and climbs into bed. Eventually, Bucky lies down next to him, though he doesn't get under the covers.\nWhen Steve wakes in the morning, Bucky's not in bed. Steve finds him sitting in the hallway in the spot with sightlines to the living room, kitchen, and doors leading to the lobby. Steve's sat in that exact spot more than once. It's a good spot to sit in when you're having a bad night.\nSteve crouches down far enough away to make it obvious that he's not trying to box Bucky in. He says, \"Did you sleep at all last night?\"\nBucky looks at him and his eyes are wild and bloodshot, strained with exhaustion. He says, \"What is this place?\"\nSteve reaches for him and Bucky bounds to his feet, is down the hall and into the kitchen before Steve can even stand. \"Buck?\" he asks softly, making his way slowly down the hall.\n\"Is this intel accurate?\" Bucky demands, looking over his shoulder at Steve. He's standing next to the kitchen window. \"Is it an illusion, or are we nine hundred and eighty-three feet in the air?\"\n\"It's a long way down,\" Steve tells him. \"I've never asked the exact distance.\"\n\"What is this place?\"\n\"It's my apartment, Buck.\"\n\"Why did you bring me here?\"\n\"I didn't.\"\n\"Why am I here?\" Bucky stalks towards him. \"Who the hell are you?\"\n\"Bucky.\"\n\"Who the hell is that?\" he asks, stepping closer. \"That name's in my head, why the hell is that name always in my goddamn head?\"\n\"It's your name, Buck,\" Steve says, slowly raising his hands, palm out, to show Bucky he means no harm.\n\"No, it's not!\" Bucky shouts, hitting a chair so hard that it splinters. \"Who are you? Why are you in my head?\"\n\"My name is Steve Rogers, I'm your friend.\"\nBucky shakes his head. He keeps shaking his head and he closes his eyes and he says, \"No, no, no, no, no.\"\n\"My name is Steve and your name--\"\nBucky reaches out for him, grabs him by the wrist and yanks him close and whispers, \"Don't say those words. They'll punish you if they hear you say those words.\"\n\"What words, Bucky?\"\n\"Don't,\" Bucky whispers. \"Don't say that word. Make them think you've forgotten it. Forget it before they can punish you for remembering.\"\n\"Nobody's going to hurt me, Buck. Nobody's going to hurt you, either, not anymore.\"\n\"They will,\" Bucky says, tipping his head down to rest his forehead against Steve's shoulder. His grip is still strong around Steve's wrist. Steve can withstand a lot, but if Bucky squeezes his left hand, he'll shatter Steve's bones. \"They'll make you forget so it's best to forget on your own. Make yourself forget so they won't be angry. Make yourself forget so they won't take it from you. It's so much worse when they have to take it from you.\"\nSlowly, Steve puts his hand over Bucky's and eases his fingers loose. Slowly, he touches the side of Bucky's face. He says, \"You're safe here.\"\nBucky shakes his head.\n\"You're safe here, Buck, I promise you.\"\nBucky shoves away from him and runs, kicks open the door to the stairs instead of taking the elevator and Steve lets him go. He sits down on the top step and listens to Bucky crashing and slamming his way down ninety-seven flights. He rests his elbows on his knees and lets his head hang forward and he says, \"JARVIS?\"\n\"Yes, Captain Rogers?\"\n\"There's been some damage to the northeast stairwell.\"\n\"I'm aware of that and of the fact that it seems to be an ongoing situation.\"\n\"Okay. Um. Maybe don't send a repair crew until the person in the stairwell's gone.\"\n\"Would you like me to revoke Sergeant Barnes' access to your living quarters?\"\nSteve rubs his hand over his face and thinks about it, then says, \"No. No, it's okay, he can come and go any time he wants.\"\n***\nSteve had learned pretty damn quick on the front that he couldn't afford to be human. He had to be a hero for all the other guys. He had to be a symbol. He had to seem untouchable and without flaw to give them something to believe in, to help them fight without being overwhelmed with fear. They were good men, strong men, and Steve had owed them that much.\nBucky'd never fallen for it. Bucky'd been the only person on earth who hadn't fallen for it. Bucky'd been the only person who gave Steve permission to be human, and when Bucky died, Steve had grieved for his friend, but there'd been a mean part inside him that had selfishly grieved for the loss of the scrawny kid from Brooklyn who'd only survived in Bucky's memories. Once Bucky was gone, no one ever saw him as human again. The mean part of him had been furious with Bucky for that.\n***\nClint says, \"Ow,\" and reaches out, fingers wiggling, as if willing the beer can to slide across the table at him.\nSteve picks the can up and gives it a shake, showing that it's empty.\nClint sighs and says, \"Ow,\" again.\nSteve gets him another beer from the fridge, plus one for himself.\nClint says, \"Sure, drink my beer even though you can't get drunk, that's fine.\"\nSteve says, \"It's my beer. I bought it.\"\nClint says. \"Oh. Thanks for the beer,\" and lifts the can in salute. Then he winces. His nose isn't broken this time, but he's got a deep cut across his temple, held shut with a butterfly bandage, bruising around the edges. He's also got cracked ribs and a broken ankle.\nSteve doesn't ask how Clint got hurt. The guys he fought will either come crashing into Clint's apartment looking for him or they won't. Steve half hopes that they do. He could use the simplicity of a fight.\nClint doesn't have any quit in him. That's what Steve's mother used to say to him in exasperation when he'd come home with a bloody nose or torn clothes because he'd refused to back down from yet another fight.\n\"Don't you have any quit in you?\" she'd ask as she patched him up. \"Don't you know when to run?\"\n\"Only cowards run from bullies,\" Steve would reply, and she'd sigh and shake her head and drop it because he was just as stubborn and pig-headed as his father, too brave by half and unable to understand the meaning of the word surrender.\nClint doesn't have any quit in him, either. Steve likes that about him. He doesn't use words like honor or justice, but the result's the same.\nClint fast forwards through the commercials, then curses when he overshoots and rewinds past the beginning of Dog Cops back into the commercials. They watch a smiling woman talk about keeping her toilets sparkling clean for a while.\nSteve says, \"Did you always know you liked men?\"\nClint says, \"Did you?\"\nSteve shakes his head and says, \"Not until I was sixteen, no.\"\nClint chokes on his beer and some of it comes out of his nose and he ends up pressing the heel of his hand to his forehead and saying, \"Ow, ow, fuck, I was joking, you asshole. That was a joke, you were supposed to get all defensive and then I was going to laugh at how weird and uncomfortable it made you.\"\nSteve says, \"Oh. Sorry.\"\nClint rubs his nose and wipes his face on the shoulder of his shirt, then says, \"Are we going to have a heart to heart chat right now?\"\nSteve says, \"Do we have to? Because I'd really rather not, if that's possible.\"\nClint says, \"Not talking about feelings is one of my specialties.\"\nSteve holds up his beer and says, \"Mine, too.\"\nThey clink their cans together and go back to watching TV in silence and never talk about it again, which is nice. Steve likes that Clint can know without having to make some kind of big deal about it. He likes the way Clint just lets him exist.\n***\n\"Why are you always in my gym?\" Tony asks, walking in with a towel around his neck and a squeeze bottle of something green in his hand. \"You have your own. Every one of you has your very own gym personalized for your specific needs and yet you're always here in mine. How do you even have access to my gym?\"\nSam says, \"Your gym's cooler, plus you've always got super secret gadgets lying around.\" Then he doesn't say anything because Natasha kicks him in the head.\n\"Sorry,\" she says. She doesn't mean it and nobody pretends that she does.\nSam gets back up and shakes his head to clear it. \"That's why I wear the extra padded head guard.\" He bounces on his feet and raises his hands. \"You want a chance at her?\"\n\"No, nope, I'm aware of what she's capable of and have no need to experience it for myself.\"\nNatasha says, \"Remember the first time you saw me fight and I knocked Happy on his ass? That's, like, my favorite memory of you and me.\"\nTony says, \"You leave Happy alone. You know he's terrified of you. He spent the entire Christmas party hiding in the cloak room because you were leering at him.\"\nNatasha says, \"I didn't even see Happy at the Christmas party.\"\nTony nods and says, \"Probably because he spent the whole time hiding from you in the cloak room. Hey, Cap, good morning, what's up? You're talkative today.\"\nSteve looks over at him and doesn't rise to the bait, just keeps running.\n\"You didn't mess with any of the presets, did you?\" Tony asks as he steps up onto the treadmill next to the one Steve's on. \"Because that's Pepper's treadmill and she's got presets and she doesn't like them messed with. That's her treadmill, and this one's mine, and that one over there is Rhodey's even though he's never actually used it but still, you know, it's the thought that counts.\"\nSteve says, \"I didn't mess with her presets.\"\n\"Okay. You seem grumpy.\"\nSteve says, \"I'm fine.\"\n\"No, no, there's definitely a grumpy old man running on Pepper's treadmill right now, how far have you gone? Fourteen miles and you haven't even broken a sweat. Okay. I am feeling in no way competitive with a man in his late 90s. Did you have a fight with your girlfriend? Is that why you're grumpy?\"\nNatasha turns and asks, \"You have a girlfriend?\" She doesn't see Sam's punch coming, but she still raises her arm to block it then uses his own momentum against him, yanking him forward and flipping him over onto his back.\nSteve can't help it, he starts to laugh.\n\"Oh, that's funny?\" Sam asks as he gazes up at the ceiling of the gym. \"You've been a sourpuss all day, you barely even talked at lunch, but now that she just whooped my ass you're laughing?\"\n\"In his defense, it was a classic Natasha move,\" Tony says. \"A classic Natasha takedown is always fun to watch.\"\n\"Glad I could amuse you boys,\" Natasha says as she helps Sam to his feet. \"So tell me about your girlfriend.\"\n\"I don't have a girlfriend. Tony's been imagining things.\"\n\"Is it a, uh, a,\" Sam wiggles his left shoulder a couple times, \"thing?\"\nNatasha looks from Sam to Steve, then clucks her tongue.\nTony says, \"What just happened?\"\nNatasha crosses her arms over her chest and but she's not mad. She smiles at Steve like she's proud of him, then shakes her head. \"I should have known.\"\nTony says, \"Known what? This is still my gym, I'll have you know. This is my tower.\"\n\"It's actually held in trust by The Avengers Foundation,\" Natasha says.\nTony says, \"Details.\" He says, \"Sam, we've had this conversation before about your cruelty in not telling me about Captain Roger's sweetheart.\"\nSam says, \"Captain America or Steve Rogers, but don't mix the two. If you want to address him by rank, it would be General Rogers, though he's retired.\"\nTony says, \"Fine. It's cruel of you to talk about General Rogers' sweetheart in front of me.\"\nSteve says, \"I don't have a sweetheart.\"\n\"Yeah?\" Tony asks. \"What's this, then?\" He shrugs his left shoulder in imitation of Sam.\nNatasha says, \"You're a genius, Stark. You can figure it out.\"\nTony says, \"You're my least favorite Avenger, just so you know.\"\nNatasha smiles and says, \"I'm your second favorite, after Bruce. We're all your second favorite, after Bruce.\"\n\"Your understanding of my psyche is deeply disconcerting,\" Tony says.\n\"Oh, please, I just know the obvious things. I'm not touching the depths of your psyche with a ten foot pole.\"\n\"That's probably for the best. It's a scary place. Tell me the truth, whose psyche is scarier, mine or General Rogers over here?\"\nNatasha says, \"You're equally twisted, just in different ways. Compared to some of the psyches I've dealt with in my life, though, you're both children's playgrounds.\"\nTony says, \"That's a relief, actually, though I, oh. Oh! The shoulder thing, that's the Cold Shoulder, Sergeant Barnes.\" He looks at Sam. \"Master Sergeant? Sergeant Major?\"\n\"Officially he's still listed as killed in action,\" Sam says. \"Though once it's known that he was actually missing and a POW this whole time, well. Promotions are a definite possibility.\"\n\"Gunnery Sergeant?\" Tony asks hopefully.\nSam shakes his head. \"That's the Marines.\"\n\"Damn. I wanted to be able to call him Gunny. Are you sad because you haven't found him, yet? Because I told you I'd bankroll the whole thing. I've got connections, though, granted, a lot of those are really powerful assholes who are keeping in my good graces in the hopes that one day I'll start making weapons again, but they're still connections. JARVIS calls you Captain Rogers.\"\n\"JARVIS calls me Captain Rogers because I didn't do anything but not die to earn the rank of General, so I asked him just to use civilian address, but any time he calls me Mister Rogers, people laugh.\"\n\"It's a good laugh,\" Sam says. \"It's a happy, nostalgic laugh. The first time he called Steve Mister Rogers in front of me, he was legit wearing a cardigan and tying his shoes. It was amazing. Clint actually got him to talk about being a good neighbor. I thought I might die of happiness.\"\nTony says, \"That's one of the most beautiful things I've ever heard. Seriously, I can make some calls, we can get you leads, anywhere he is in the world, we'll find him.\"\nSteve says, \"He's in Manhattan.\"\nTony says, \"Still? Not that I, uh, knew he was in Manhattan in the first place.\"\nSteve says, \"Of course you didn't.\"\nTony says, \"Is that why you're grumpy? Because you and Gunny aren't having a beautiful day in the neighborhood?\"\nSteve says, \"I've seen several episodes of Mister Rogers, and it's an honor to be compared to a man who was so wise, so gentle, and so dedicated to affirming the value of every human life.\"\nTony opens his mouth to say something smart, then closes it again. He nods. He says, \"Yeah. Even I don't have anything shitty to say about Mister Rogers.\"\n***\n\"Up,\" Natasha says as they leave the gym, and Steve pauses long enough for her to jump up onto his shoulders.\n\"You never let me ride on your shoulders,\" Sam says as they walk down the corridor.\nSteve shrugs, though the motion's mostly obscured by Natasha's thighs. He says, \"She likes to feel tall.\"\n\"And you never told me that you were dating Bucky Barnes,\" Natasha says, winding her fingers through his hair to help keep her balance.\n\"It's not dating,\" Steve says. \"And it's not a secret, I just don't want to talk about it. You always want me to talk about it.\"\nNatasha laughs and says, \"When do I ever want to talk about anything?\"\nSteve thinks about that, then says, \"Okay, good point.\"\n\"If it's not dating, is it just fucking?\" she asks.\n\"See? Now you're talking about it.\"\n\"I'm a spy. I snoop. It's what I do. Think of it as an interrogation, not as a chat about your feelings.\"\nSteve thinks it probably says something about him that the idea of an interrogation makes him more comfortable. He says, \"I had a thing for him when we were kids but we were just friends then and we're just friends now.\"\nNatasha says, \"Ooh, I wish I had a dollar for every time somebody says Captain America doesn't lie.\"\nSam laughs at that and Steve shoots him a dirty look. Sam looks back at him with a smile and shrugs.\nShe tugs on his hair and says, \"You don't have to tell me anything you don't want to.\"\nSteve says, \"I don't even know what the truth is, to be honest.\"\nNatasha says, \"That happens sometimes.\" Then she lifts her hand up to give Clint a high five from where he's reaching down through an air duct. She says, \"It's okay if you don't know what's going on or how you feel.\"\nSteve says, \"And you're talking about it again.\"\n\"I'm just saying that you're allowed to be human.\"\nSteve squeezes her ankle gently in thanks and she rubs his scalp and Sam says, \"Do either one of you know when I started thinking of people shimmying around in air ducts as normal? Because I just realized that I think people hanging out in air ducts is normal.\"\nNatasha says, \"Think about who you're having this conversation with, then think about the fact that you talk to birds and fly using a jet pack with wings, then define normal.\"\nSam says, \"I don't talk to birds. I mean, okay, sometimes I talk to them like you'd talk to plants but it's not like I think I'm really communicating with them. I just talk to them.\"\nNatasha says, \"Mmm-hmm,\" and skritches her fingers across Steve's scalp.\nSam says, \"I see your point.\"\n***\nSteve sits up that night, gazing out his kitchen window, nine hundred and eighty-three feet in the air. He wonders if he should take Tony up on his offer, use all of Stark's resources to track Bucky down and make sure he's all right. He thinks about what would happen if Bucky knew Steve was tracking him. He wishes he could get drunk.\nHe calls Tony and asks if he happens to have a bottle of super alcohol just lying around.\n\"Just lying around?\" Tony asks. \"No. In a secured location behind lock and key and cryptography? Yes. Jesus, could you imagine what would happen if a normal human being got their hands on it? I think, well, it's not like I haven't been sued before, but leaving that just lying around is a recipe for death and disaster, why do you ask? Oh, are you and Major Assassin going to mix cocktails and talk about life before the war? Is Ken Burns going to be filming? Did you end up finding a sweetheart? Because I gotta warn you, Cap, you can't let her have a sip of your martini or you'll have one dead sweetheart on your hands and, oh, I'm an asshole, Agent Carter's in a goddamn hospice and I'm such a fucking asshole sometimes, just come down to the lab and punch me in the face, okay? Only don't hit me too hard, Pepper will get upset and, you know, I'm so attractive that there are people who might actually weep if I get bruised and--\"\n\"I just want to sit in the dark and get drunk by myself,\" Steve says wearily.\nTony says, \"Yeah, okay,\" and five minutes later, the elevator in Steve's lobby dings and then there's a weak rapping on his front door. He opens the door to find a wheeled bot the height of his kneecaps holding a cup with Donald Duck on it in one claw, the other claw still making a knocking motion even though the door's no longer there for it to knock against. It takes a moment to stop knocking. It slowly moves its arm to grasp at the note taped to its chest, takes several tries to grasp it, then holds it up for Steve. Steve has to tug on it a couple times before the bot lets go.\nThe note is in Tony's handwriting. It says, \"Hello, my name is Shitcan. I got my name because I am a shitty little can of a robot that Tony should dismantle but doesn't because he is a generous and loving god. I come bearing booze as a gift from the creator. He requests that if you become inebriated enough to start crying, to please record the event for posterity and send him a copy. He wishes you health, cheers, bottoms up, etc.\"\nSteve says, \"Give me the booze, Shitcan.\"\nAfter several tries and one near-spill, Shitcan does.\n***\n\"It's not that I don't know,\" Steve says. \"I know. I know I'm pathetic, okay? I know I'm pathetic but there's nothing for it. I couldn't change it even if I wanted to. I like being pathetic. I like how much it hurts because it belongs to me. Nothing about me belongs to me anymore, not my sketches or my face or anything, not anything but how much I hurt.\"\nShitcan whirrs at him, jerks forward and reaches out a claw. It lowers and raises the claw like maybe it's patting him on the head. It doesn't seem to notice that Steve's head is actually three feet away.\nSteve says. \"I know. I'm being maudlin. I'm overly dramatic. I know. You're right.\" He takes a sip of super alcohol from the Donald Duck sippy cup. He says, \"I don't know what else to do but wait for him. He was it for me and it's not that I didn't try to get over it. I did. I told myself a hundred times that I was through making him take care of me, and I did it, too. I never asked him for it, not once, not since the day I realized how much he'd sacrifice just to make me happy.\"\nShitcan whirrs and trills and rolls forward, coming to a jerky stop just inches from his head. It reaches out one claw and clumsily pats his cheekbone.\nSteve says, \"He gave me everything I ever wanted and I didn't even care what he was giving up. I just took it. I took and I took and I took and he never complained because the thing they don't tell you? The thing no one knows anymore is that Bucky was always the good one. I was the troublemaker. I was the greedy little shit who was never satisfied. Bucky just gave everything he had to anyone who wanted it, and he had the damn bad luck of being friends with me.\"\nSteve rolls his head to the side and looks at the bot's cylindrical body. The words, Miss Calculation 2012, are written in permanent marker on a piece of masking tape stuck diagonally across its front like the kind of sash beauty contestants wear.\nSteve says, \"I'm going to to better this time, though. I'm doing better. I'm not asking him for anything. I'm going to be a good friend for once. I'm going to be the kind of guy who deserves a friend like Bucky.\"\nShitcan rolls backwards, then turns and rolls away from him.\nSteve sighs and stretches out on his back again. His kitchen floor isn't as comfortable as the floor in Tony's lab, but it's close. The super alcohol tastes a little bit like limes this time around. He wonders if Tony can make any that tastes like artificial watermelon.\nSteve shivers and curls up on his side and listens to the whirr of Shitcan's motor as it makes a slow circuit of the kitchen. He listens as it rolls down the hallway and trills softly to itself. He listens to the crash coming from the bathroom but doesn't get up to investigate. He finishes the last of the super alcohol and rolls onto his back as he watches Shitcan come into the kitchen pulling a towel behind it that's twice as long as Shitcan is tall.\nShitcan whirrs and rolls towards him, not coming to a stop until it collides rather forcefully with Steve's forearm. Then Shitcan raises its arms and turns and a couple inches of the towel it had been dragging behind it drape over Steve's arm and hip. Shitcan reaches out and pats his ribcage, then rolls back, getting its wheels stuck in the towel.\nSteve sits up and carefully disentangles Shitcan's wheels from the towel, then tugs the towel over himself. It only goes from his shoulders to mid-thigh, but it's the thought that counts. He says, \"Thanks, Shitcan, you're the best.\"\nShitcan trills happily and settles down next to him.\n***\nSteve wakes up around four o'clock in the morning on his kitchen floor with a crick in his neck and a small robot watching him intently. Shitcan doesn't have a face, really, or eyes, but still, it's watching him. Steve can tell. Steve says, \"Morning,\" and groans as he sits up.\nShitcan beeps at him and follows along behind as Steve heads to the gym where he does pushups and chinups and burpees until his blood is pumping. Shitcan follows him back to the kitchen where he eats a beef stew MRE cold out of the pack while leaning against the counter. He eats the blueberry cobbler, too, but leaves the rest of the components for later.\nHe looks at the Donald Duck sippy cup lying on its side in the middle of the floor as he eats. He's tired. Physically he's fine, physically he's great, but he's so goddamn tired.\nHe says, \"Probably time for you to head back to the lab, huh?\"\nShitcan beeps at him and reaches for the sippy cup. After a couple minutes of watching Shitcan attempt to grab and then chase the rolling sippy cup around the kitchen floor, Steve kneels down, picks the sippy cup up, and holds it out. Shitcan takes it carefully and trills at him. Steve says, \"You're welcome,\" and heads for the elevators in the lobby.\nHe doesn't expect Tony to be in his lab at five o'clock in the morning, but JARVIS lets him in and there's rock music blaring and Tony's surrounded by floating windows filled with text.\n\"You're up early,\" Steve says.\nTony says, \"What? Oh. Right. Because I totally slept last night. What do you know about twistor theory?\"\nSteve says, \"Um.\"\nTony waves his hand dismissively. \"Never mind, stupid question.\" He goes back to reading and ignoring Steve completely.\n\"Brought your cup back,\" Steve says, holding it up. \"And your robot.\" He looks over his shoulder to where Dum-e is fawning over Shitcan like a child, like maybe Dum-e's his mother. He watches them interact and listens to Shitcan's soft trills that sound a lot like a smaller version of the noises Dum-e makes, and he turns to Tony with wide eyes.\nTony's not paying attention, absorbed in whatever he's reading.\nSteve says, \"Tony, are your robots alive?\"\nTony says, \"Don't be ridiculous.\"\nSteve says, \"Tony,\" and looks back over his shoulder.\nTony says, \"They're programmed to do that.\"\nSteve says, \"You programmed them to be a family?\"\nTony shrugs. \"I programmed them to perform maintenance on one another when necessary, it morphed into this..preening and caretaking and whatever. They probably saw it on TV.\"\nSteve says, \"They're imitating something they saw on television. Because robots can do that. Because robots watch television in their spare time.\"\nTony looks up at him and pulls his glasses down. He says, \"Were my robots sapient, that would indicate that they are much more intelligent than most forms of life on earth, which is impossible. Robots can only do what they're programmed to do. Artificial intelligence can only do what it's programmed to do.\"\nSteve says, \"You programmed them to learn.\"\nTony's smile is tight. He says, \"If I had sapient robots, that would be of great interest to the United States government. They would want to decommission the technology until they understood it and, let's be honest, with maybe three exceptions, everyone who works for the United States government is a fucking idiot. I'm talking bottom of the fucking barrel, here. There are quote-unquote scientists working for the United States government who legitimately believe the Earth is four-thousand years old. Those people are not laying a hand on anything I've invented. Ever. And there's no reason for them to because the idea of a sapient robot is ridiculous. Science fiction. Campfire stories of the day the singularity happens and technology enslaves us all. Besides, it was an accident.\"\nSteve raises his eyebrows.\nTony shrugs. \"You ever have anybody tell you that you're too smart for your own good? Now you know what they mean. How was your night of drunken misery?\"\n\"Good,\" Steve says, holding out the Donald Duck cup. \"It was good, thanks.\"\n\"You and the BFF have a fight?\" Tony asks.\nSteve says, \"No. He has days that are worse than others, though, and there's nothing I can do.\"\nTony says, \"If he ever swings by to visit, have him stop down here. I'm not really into wet work, no, that's murder, isn't it? I'm definitely not into wet work, also not into squishy flesh engineering, bodies, hey, biology, that's a term. Wet ware? Anyway, I'm much more of a metal and polymers kind of guy, but this whole...thing,\" he circles his hand over his chest quickly, \"I kind of learned more than I ever wanted to about biomechatronics so that I didn't just keel over and die, so it's kind of a personal interest. And his arm, well, if it can do what you say it can do--\"\n\"It can,\" Steve says.\nTony says, \"I really hate it when people are better than me, and whoever made that arm is better than me. For now. I mean, half an hour after I get a look at it, I'll be leaps and bounds ahead of the competition but until then, ugh, second best. Or third, damnit, third, whoever made that arm, my buddy Hugh from MIT, and then me. Not that Hugh and I were ever really buddies. He's a real outdoorsy kind of guy, heathy living and rock climbing and not at all into casual sex and cocaine, which were two of my favorite things when I wasn't in the lab, or, well, two of my favorite things even when I was in the lab, but that's not. Anyway. Third place, Steve. The bronze medal. I don't want a bronze medal and, well, fine, I'll take the fucking bronze medal but that arm, can you imagine prosthetics that actually worked with the body? Can you imagine prosthetics that function like flesh and blood limbs? I've seen the footage. The way he reaches for things he's not looking at? He's got delicate sensations that register in his brain. Can you imagine the way people's lives would change for the better if we could use that technology for healing instead of, oh, creating super assassins?\"\nSteve says, \"I can imagine.\" He doesn't ask about Tony saying, If he ever swings by to visit. Tony doesn't know that Bucky's been to the tower. He doesn't know that Bucky has unrestricted access to Steve's floor. He doesn't know that Bucky'd smashed his way down ninety floors and ripped a few metal railings right out of concrete on his way. He doesn't know because JARVIS hasn't told him. And JARVIS hasn't told him because JARVIS runs the tower on his own, makes his own decisions, is so much more than the complex computer program Steve had been told he was.\nSteve says, \"I have a file with a lot of information about the medical procedures performed on him. Most if it's in Russian, though.\"\nTony waves his hand and says, \"JARVIS can translate it and highlight the important parts.\"\n\"JARVIS hasn't seen it. It's on paper.\"\nTony looks disgusted.\nSteve says, \"It's sensitive as hell, Tony. It's the kind of information we don't want the bad guys to have. I'll give it to you as long as you promise you won't upload it anywhere. It's nastier than anything Tasha released in the SHIELD files. It's all laid out, exactly what they did to him, exactly what you need to do to a person to completely unmake them and remake them into anything you want. If there's one thing I've learned in my life, it's that people will always be obsessed with creating super soldiers. Me, Bucky, Bruce, Natasha, we're the ones who got lucky, the ones who still exist, who didn't go completely insane or mutate into inhuman monsters or die in the attempt. You can read the files, but you keep them in your head the same way Erskine kept the serum in his. You know damn well there are people who'd be chomping at the bit to try to remake anyone they could get their hands on just to see what would happen, who'd accept a ninety-nine percent failure rate if that meant that the one out of a hundred who survived was a soldier like me or Bucky or Bruce.\"\n\"What did they do to Natasha?\" Tony asks softly.\n\"Don't know. Never asked her. Don't know if she knows, either, but it was something. I mean, she's good, naturally she's just good, but you know as well as I do that there's something more to it.\"\nTony nods and says, \"Yeah. Okay. I can read the files?\"\nSteve says, \"My Russian isn't great, but I'll help translate all I can.\"\nTony waves his hand and says, \"The eighties were all about anti-communist propaganda and hating anything Russian and I enjoyed pissing people off, so I learned it in my spare time.\"\nSteve says, \"In your spare time, in between getting your first doctorate when you were still a teenager and creating robotics more advanced than any adult could dream of at the time, you learned an incredibly complex language. With all the free time you had back then.\"\nTony shrugs.\nSteve gets the file Natasha had given him.\nTwo hours later, the files are locked in the biometric, encrypted safe where Tony keeps the super alcohol, Steve's Donald Duck sippy cup is full, and Tony's slumped in the far corner of his lab with a glass of scotch in his hand.\n\"You want to talk about it?\" Steve asks softly.\nTony says, \"Nope,\" and takes a sip of scotch. He says, \"Jesus.\"\nSteve says, \"Yeah.\"\nTony says, \"Eventually I'm going to tease out the threads having to do with prosthetics and send the information to my buddy Hugh, but, uh, Jesus. The rest of that. Erasing a person's mind. How is he not insane?\"\nSteve says, \"I don't know if he is or not, and I'm probably a bad one to judge.\"\nTony says, \"You want to help me tinker around with the newest green power source I'm working on? It's got some bugs to work out. We definitely shouldn't work on it while drunk considering that it could explode. It's little, it's just a prototype, probably won't destroy more than the reinforced steel and concrete lab where I'm working on it. Probably. You wanna go poke it with me so we don't have to think about really awful fucking people doing really awful fucking things to people's brains?\"\nSteve takes a hefty sip of his super alcohol and says, \"Lead the way.\"\n***\nSteve hasn't had a hangover since 1943, so it takes him a while to figure out why he feels so fucking wrecked. He sits up and rests his head in his hands, taking deep breaths. He has to piss so bad it's painful, but he's not sure he can make it without falling over.\nHe makes it. He pisses for what feels like fifteen minutes. He turns the shower on and sits beneath the spray. He leans against the wall and moans softly, feeling sorry for himself.\nThe shower doesn't help. Giant glasses of water don't help. There's only one thing for it. He needs chicken soup. Not the kind out of a can, but real chicken soup with matzo balls in it.\nThere aren't half as many delis in New York as there had been when he'd been growing up. There are a lot more types of restaurants than he ever could have imagined. Just walking down one block, he can eat food from Japan, from Ethiopia, from Argentina. It's not that he wishes there weren't so many options anymore, but for as good as all the new food is, it's not what he needs when he needs food that gives him as much comfort as it does sustenance.\nThere are still good delis, though, even though they're not on every block anymore. Most of the ones that have survived are huge and crowded every moment of the day, just as much an experience as a place to eat. There's a quiet one twenty minutes from the tower, though, and Steve keeps himself moving with the thought of the thick tomato slices and half-sour pickles he's going to order on the side.\nThe matzo ball soup cures his hangover just as well in the new millennium as it had in the last, and after he's finished, he gets a loaf of chocolate babka to go and breaks off pieces of it to eat as he walks back home. He's thinking about texting Natasha and begging her for a Hydra base to rip to pieces when he sees a flash of sunlight on metal out of the corner of his eye. When he turns, there's nothing there, but it had been Bucky, he's sure of it. He didn't even know that he'd been holding the fear that Bucky was gone for good until the tension in his chest loosens and he breathes a little easier the rest of his walk home.\n***\n\"Question,\" Sam says. He's breathing hard, but not so hard that he can't still carry on a conversation. They're running side by side because Steve's already run ten miles and these are his cool down laps. He uses Sam's workout as his cool down a lot, but neither one of them ever mentions it. Sam says, \"I know you don't like talking about stuff so if you don't want to get into it, you can just tell me to go fuck myself and I'll shut up.\"\nSteve says, \"Okay.\" He's pretty sure from the intro that he knows where Sam's heading.\n\"Hypothetically, if there was a guy who was interested in dating you, would you give it a shot?\"\nSteve looks over at him with one eyebrow raised. He was expecting a question about Bucky.\nSam rolls his eyes and says, \"It's not me. It's hypothetical.\"\nSteve says, \"Uh-huh.\"\nSam says, \"I maybe have a guy in mind. I don't know. The whole matchmaker thing feels weird, but you guys could be good together. Didn't know if it was something you were interested in.\"\nSteve thinks for a while. He doesn't know, either. He says, \"Can I get back to you on that?\"\n\"Of course. I just didn't know if you wanted to give dating a shot or if you were still trying to get things with Barnes to work out.\"\nSteve laughs bitterly and shakes his head. \"Not much chance of that.\"\n\"I'm sorry,\" Sam says, and because he's a good friend, he means it.\nSteve nods and focuses on the way his feet hit the pavement and says, \"Thanks.\"\n***\nSteve wakes up at two o'clock in the morning. It might have been a dream or he might have heard a noise or his body might have just decided it was time to wake up for no reason at all. He sits up and swings his legs over the side of the bed, stays there for a moment before getting up to get a drink of water.\nHe pads barefoot into the kitchen and reaches for the glass by the sink.\n\"I had beer made out of apricots today,\" Bucky says.\nSteve closes his eyes against the surprise of it, then lets out a shaky breath. \"Buck,\" he says, \"you're going to have to start leaving a light on.\"\n\"Did I scare you?\"\n\"No. No, I pretty much always expect there to be somebody sitting in the dark at my kitchen table with a gun.\"\n\"I don't have the gun because of you.\"\n\"I know, Buck.\"\n\"Don't handle me.\"\n\"I'm not--\"\n\"You say my name a lot when you're trying to handle me. Like you're talking to a wild animal. Like you think saying my name will keep me calm.\"\n\"Will it?\" Steve asks.\nBucky doesn't respond.\nSteve reaches out and puts his hand on the light switch. \"I'm going to turn the light on, okay?\"\n\"You don't have to talk to me like I'm feral.\"\nSteve thinks he might. He turns the light on, then turns around slowly. Bucky's sitting at the table with a bottle of beer in his hand.\nBucky says, \"There's more in the fridge. It's made with apricots. And not like the hooch Jenny Keane used to make with old fruit and molasses, but real beer. It's damn good.\"\nSteve takes a beer out of the fridge and twists the cap off, then sits down across the table from Bucky. He says, \"The food's better, now. Beer, too.\" He tips the neck of his bottle against Bucky's, says, \"Cheers,\" before taking a swig. It is good.\nIt's the kind of beer he's supposed to be too manly to enjoy, but that kind of thinking's a load of horseshit. He's supposed to be too manly to enjoy lots of things, like long showers and supermarkets and toothbrushes with seven different kinds of bristles and a tongue scraper on the back. He's not actually too manly to enjoy any of those things since enjoying those things has shit to do with who he is and everything to do with knowing what it's like to live without them. He'll take hot running water and refrigerated deli cases and dental hygiene any day of the goddamn week.\nHe'll take lush, fruity beer that's not even close to turning to vinegar any day of the week, too.\n\"They fucked with me,\" Bucky says after a while. \"I spent months thinking that modern beer was as weak as water before I realized that they fucked with me. They fucked with me somehow to make it so I can't get drunk. It's a hell of a thing.\"\nSteve smiles wryly and nods. He says, \"Yeah. I drank half a crate of whiskey the day you died, but it didn't do me any good.\"\n\"They do it on purpose?\" Bucky asks, picking at the beer label with his thumb. \"They do it to us on purpose or is it an accidental side effect like the dreams?\"\nSteve doesn't think it's the time to mention super alcohol. \"It's a side effect. What kind of dreams are you having?\"\nBucky shrugs. \"Makes sense, I guess. I always thought maybe I was dead. How did I...? No, never mind. It's probably best if I don't remember dying.\"\nSteve says, \"Buck, you didn't. I thought you died. We all thought you died, but you didn't. You're still alive.\"\nBucky seems to think about that for a while, then shakes his head. \"No. I think you were right the first time and I'm a ghost. It makes sense. A lot of things make sense if I just accept that I've been dead for a long time.\"\n\"If you're dead, how are you getting high on my painkiller lollipops?\" Steve asks. \"Don't think I haven't noticed them going missing.\"\nBucky scratches the back of his head. \"Maybe I'm not taking them for me.\"\n\"Maybe they'd kill anyone but the two of us, so you'd better be taking them for you.\"\n\"They help me sleep.\"\n\"The dead don't sleep, Buck. And you have to stop stealing my meds. It's illegal.\"\nBucky shrugs.\n\"Unethical?\"\nBucky shrugs again.\n\"Doctor Yee could probably make something for you if you need help sleeping.\"\n\"I don't really like doctors. Are you in love with Sam?\"\nSteve puts his beer down and says, \"No. Why?\"\n\"Seems like it sometimes. You talk a lot but you never do it over the phone or in his office so I can't ever hear what you say.\"\n\"You promised you'd stop bugging his office.\"\n\"I don't listen to him talk to his clients. But what if he talks to you there? You always go running or hiking when you talk and I can't hear what you're saying.\"\n\"You don't have to spy on my conversations, Buck. Not with Sam. Not with anybody. You want to know something, you just ask me.\"\n\"How do I make you laugh?\"\nSteve shakes his head, not understanding.\n\"I remember. I remember that I always wanted to make you laugh. I knew if I could get you to laugh, you might kiss me, and I always wanted you to kiss me. But I don't know how to make you laugh anymore.\"\n\"You wanna kiss me, Buck?\" Steve asks, heart beating in his throat.\n\"Yes, but I have to make you laugh, first.\"\n\"You really don't.\" Steve reaches out and tucks a strand of hair behind Bucky's ear. \"If you want to kiss me, you can just kiss me.\"\nBucky kisses him. It's a tentative kiss at first, a gentle press of lips. Then Bucky grabs him by the shoulders and yanks him closer and kisses him hard. He kisses Steve and winds his fingers through Steve's hair and Steve has to pull back to take a deep breath.\n\"I'm not crazy,\" Bucky says against his mouth.\nSteve says, \"Okay.\"\n\"I'm fucked up but I'm not crazy, okay? I know there's stuff wrong with me but I know what I'm doing. I can make my own choices.\"\nSteve holds Bucky close to him. He says, \"Okay. You know we weren't like this before, though, don't you? Not really.\"\nBucky says, \"We should have been,\" and kisses him again.\n***\n\"We really never did this before?\" Bucky asks. He kisses the nape of Steve's neck, kisses along the curve of his shoulder.\nSteve says, \"Nnng.\" He's got beard burn, rug burn, bruises, and what is very possibly a sprained elbow. He smiles happily and lets himself melt into the mattress as Bucky licks the sweat from his skin.\n\"If we never did this before, there's somebody at Hydra with one hell of a perverted imagination,\" Bucky says. Then he says, \"Well, okay, maybe that's no surprise, but somebody spent a hell of a lot of time implanting memories of me putting my dick in your mouth.\"\n\"We did that,\" Steve says and he doesn't feel like going into the whole thing, doesn't feel like explaining how pathetic he'd been and how Bucky'd given in out of friendship and pity. He says, \"We just didn't talk about it,\" because that's true even if it's not the whole truth.\nBucky pushes at Steve's shoulder, lifts it and pushes and Steve finally cooperates and rolls over onto his back. Bucky straddles his hips, sits on the tops of his thighs.\n\"I'm down for the count, buddy,\" Steve says, though maybe. Maybe he could go again. He's not sure. He's never tested the limits of his new body, not with another person, not like this. He runs his hands up the outsides of Bucky's thighs and thinks about it.\nBucky says, \"I'm just going to keep touching you, okay?\"\nSteve nods and says, \"Okay.\" Then he laughs and tries to twist away because he's ticklish.\n\"I think,\" Bucky says. \"I think everything I remember is real. The sex we had, anyway, I think the things I remember are all things that happened. The first time we kissed was in your place, the one on 53rd with the bathtub in the kitchen. I was drunk. Not that drunk, but drunk enough that my dad would have given me a whipping if he'd smelled it on me, so I went to sleep it off at your place. And your mom worked the night shift so we were alone. And we were laughing about that damn cat howling in the alley and then you kissed me. That's how it happened, right? I'm remembering it right, aren't I?\"\nSteve nods and says, \"Yeah.\" He'd been so scared. In the moment after he realized what he'd done, he'd been terrified. Then Bucky'd touched his face and said, It's okay, Stevie. You're okay. Go to sleep. He hadn't been mad at all, but he had gone to sleep on the sofa in the parlor instead of in Steve's bed the way they'd always shared before. Steve had understood.\nBucky pins Steve's wrists down and leans over him and grins and says, \"And then one night you let me put it in you. It was practically a blizzard outside and we'd been going at it for hours and instead of finishing me off with your hand or your mouth, you rolled over and told me I could put it in if I wanted to and, God, did I want to.\"\nSteve nods and takes a shaky breath because remembering it sends a spike of pleasure through him even now.\n\"I told myself that it was practically like being with a girl because you were so much smaller than me, but that was a lie. It wasn't anything like it was with girls, not even then. Definitely not now.\" Bucky lets go of Steve's wrists and runs his hands down Steve's forearms, over his biceps, thumbs Steve's nipples. He leans in for another kiss.\nThey'd kissed for days back in Steve's old apartment. They'd kissed until they were breathless. Bucky'd say, \"Soft and pretty as a girl, Stevie,\" and run his hand over the curve of Steve's ass and Steve hadn't minded. He'd known that Bucky was pretending he was a girl more often than not, so it didn't hurt when Bucky said it.\nBucky'd been so kind to him before, but Bucky doesn't kiss him like he's being kind, now. Now he kisses like he's desperate with need. Now his touch is rough and he holds on tight enough to bruise and he kisses Steve like he'll shake apart if he has to stop. Steve doesn't mind any of it, kisses back just the same, holds on just as tight.\nTurns out, Steve can go again. His muscles are trembling, but he keeps going and when Bucky whispers, \"Fuck me,\" Steve does it, and when Bucky says, \"I love you,\" Steve believes him.\nIt's hours later, days later, when they finally both give up and admit they have to rest. They lie facing one another on Steve's rumpled bed, sticky and smelling awful and Steve's never been so happy. \"Stay,\" Steve whispers. He closes his eyes to give himself courage. \"Stay here with me. Live here with me.\"\nBucky doesn't say anything.\nSteve takes a deep breath and tries not to feel hurt by the rejection. He'd known even before he said it that Bucky wouldn't want to. He'd known, but he'd let himself hope the way he always does because he's a sucker who never learns.\nBucky says, \"You won't mind?\"\nSteve opens his eyes. \"Why would I mind? I want you here, Buck.\"\n\"Even with,\" Bucky says. He smiles sadly. \"Even after all the stuff I did? Even with the way I am?\"\nSteve nods and curls their fingers together. \"I want you to stay with me. I want. I'd like for you to share my bed, too, but you don't have to. You can have your own room, your own space, anything you want.\"\nBucky says, \"But I can sleep in here with you if I want? We can have more sex if I want?\"\n\"Yeah,\" Steve whispers.\nBucky grins at him and says, \"Cool.\"\n***\nIn the morning, Bucky's sitting in the hallway, in the spot with the best sight lines. He's showered, his hair still damp, and he's holding a steaming cup of tea. He doesn't look in Steve's direction, but he says, \"It really does make more sense if I'm dead, you know.\"\nSteve says, \"Never knew you to believe in ghosts.\"\nBucky shrugs. He looks down at his tea. He says, \"Maybe we're both dead and this is heaven.\"\nSteve considers it. He says, \"If we were in heaven, we'd be back in Brooklyn playing for the Dodgers.\"\nBucky looks tired and a little sad when he turns his head. He smiles at Steve, lopsided, like he's making an effort.\nSteve sits down next to him and leans in for a kiss. Bucky's mouth is hot from the tea.\nBucky says, \"You think I'm sitting here because I'm crazy.\"\nSteve says, \"It's a good spot to sit. I sit here, too, sometimes.\"\nBucky nods. When Steve moves to put his arm around Bucky's shoulders, Bucky lets him. They sit in comfortable silence for a while and Bucky finishes his tea. He sets the cup down, then picks it back up. He runs his finger over the rim. He says, \"This is real?\"\n\"Of course it's real. It's right there in your hands.\nBucky sighs. He says, \"I can feel it in my hands. I can feel the floor beneath me. I can hear the refrigerator humming. That doesn't mean it's real.\"\nSteve turns and kisses Bucky's temple. \"I promise you it's real.\"\n\"How do I know?\"\nSteve takes Bucky's hand and holds it to his chest as it rises and falls. \"Can you feel me breathing?\"\nBucky nods. He slides his hand up to Steve's neck and feels his pulse. He rubs Steve's earlobe between his thumb and forefinger. He lets out a shaky breath and nods. He says, \"You're real.\"\nSteve says, \"Yeah.\"\nBucky nods. He says, \"It's okay, then. It's okay because even if I'm not real anymore, you are.\"\n\"Buck,\"\n\"It's not bad, Stevie. It's not bad being this way. Everybody makes it out to be something awful, but it's not bad at all.\"\n\"What way are you talking about?\"\n\"Being dead. It's okay. I was so afraid of it. I was so fucking scared to die, but I don't know why, now. There's nothing to be afraid of.\"\n\"You're not dead.\"\n\"But I have to be. It's the only option, you see? Nobody could live through the stuff I went through. Nobody could come out the other side still alive, but I came out the other side, so I have to be dead. It's logic, that's all.\"\n\"Come here, you idiot,\" Steve says, pulling Bucky close. He holds him tight and feels the expansion of Bucky's chest every time he takes a breath. He says, \"If you're dead, how the hell am I holding on to you? The things they did to you, Jesus, you're right, nobody else could have lived through those horrible things, but you did. You escaped.\"\nBucky whispers, \"I won.\"\n\"You won.\"\nBucky asks, \"I really made it?\"\n\"Swear on a stack of bibles, Buck, you made it.\"\nBucky nods and presses closer to him. They hold each other for a long time. \"I'm sorry,\" Bucky whispers against his throat. \"I'm sorry I'm broken.\"\nSteve strokes his back and says, \"You're not.\"\n\"I am, but I'm putting myself back together. I'm trying, I swear that I am.\"\n\"You're perfect,\" Steve tells him.\n\"Nobody's perfect.\"\n\"You're perfect for me,\" Steve says.\n\"Yeah, well, you're a disaster so I don't know what that says about me.\"\nSteve laughs and nuzzles against Bucky's hair. \"And here I was hoping that nobody'd noticed.\"\n\"They can see that you're a fucking disaster from space, Rogers.\"\nSteve smiles bitterly and rubs Bucky back and kind of wishes that were true.\n***\nSteve has an appointment with his accountant on Tuesday morning. He has a lot of money, now. He has back pay and the interest owed on his back pay, not to mention royalties from every Captain America movie and comic book and action figure that nobody'd bothered to get permission for back when everyone thought he was dead. He's got so much money, it makes him want to throw up. His accountant is named Vivian and she's vicious to him. She won't let him just hand it all over to someone else to deal with, not even her. She makes sure he knows where every cent of it goes, she makes sure that no one can spend any of it without his express permission. She also know how much stress it causes him so she keeps their appointments short. He has a feeling that Vivian could make him spend days and days every month dealing with his money, but she keeps every appointment under three hours just to spare him the agony. He likes Vivian a lot.\nHe likes Vivian a lot, but even a two hour meeting sets his teeth on edge. Afterwards, he stands beneath one of the trees in the two-story atrium near the middle of Stark Tower and reminds himself to breathe. The light slants diagonally in from above and during the afternoon, the conference room where he and Vivian always meet is dappled with light and the shadows from the river birch. It's pretty. He stands watching the changing shadows for a while and tries not to think about the fact that he has investments and a retirement plan.\nHe thinks about sitting on the sundeck for a while. It's bright and airy and filled with citrus trees because for as obsessed with technology as he is, Tony also has a vibrant love of light and the natural world. Steve would sit on the sundeck just for fifteen minutes or so, but he can see through the floor-to-ceiling windows and the deck's already occupied. Dr. Banner's talking to Pepper Potts and a group of well dressed people that Steve doesn't know. They're lounging on the sundeck's chairs, having hors d'oeuvres and drinking afternoon cocktails and laughing and Steve doesn't want to intrude. Maybe he'll just work off his nerves by punching the heavy bag in his gym, instead.\nWhen he turns to go, Tony's right there, standing with his arms crossed. \"You want to tell me about the Hydra assassin you've got living in my tower not four floors away from the woman I love?\" Tony asks.\n\"You want to tell me about the potential rage monster having lunch with the woman you love as we speak?\" Steve asks.\nTony looks over his shoulder to where Bruce and Pepper are talking happily, Bruce gesturing wildly as he speaks. He says, \"Point taken. But he's my rage monster.\"\n\"And Bucky's mine. If you don't want him here, that's fine. We can be out of your hair by tonight.\"\nTony sighs and says, \"I'd really worked myself up into what I thought was going to be a fit of righteous anger, but it's gone, now. Damnit. If you could stop being logical and pointing out the flaws in my own logic, that would be awesome. Besides, where would you go? That little place on Delancey and...what's the cross street, again?\"\nSteve says, \"Just because your surveillance lost us at Delancey doesn't mean we stopped at Delancey.\"\nTony points what looks mostly like a pen but probably isn't in Steve's direction, then twirls it through his fingers. He says, \"I have no idea what you're talking about.\"\n\"Of course you don't.\"\nTony sighs. \"All right. So we're adding one Hydra assassin--.\"\n\"Former Hydra, former assassin,\" Steve says.\nTony says, \"I'll give you former Hydra, I retain the possibility of current assassin. We have one ex-KGB ghost added to our ragtag band of--\"\n\"Maybe don't call him a ghost when he can hear you,\" Steve says. \"He kind of has this existence...thing. He's mostly convinced he's dead. I'm working on it.\"\nTony says, \"All right. Honestly, he's probably going to be a good fit. Some well-adjusted, corn-fed Iowa boy named Brad would just not gel with this team.\"\n\"I'm from Iowa,\" Clint says from the rafters above them.\nTony closes his eyes and breathes, very purposefully not showing that he was startled.\n\"He also said well-adjusted,\" Steve says, glancing up.\nClint's sitting on one beam, resting his arms and chin on another a little higher up. He says, \"I'm plenty well-adjusted.\"\n\"You're sitting in the rafters staring at us.\"\n\"I'm keeping an eye out. It's what I do.\"\n\"You're keeping an eye out just in case we get attacked in my atrium?\" Tony asks.\nClint says, \"It's not outside the realm of possibility.\"\nTony seems to think about that for a moment, then nods as he concedes the point. Then he turns back to Steve and says, \"What are the chances I could get a look at his--\"\nSteve says, \"At this point, he's liable to pull out your arc reactor and your heart if you try to touch his arm.\"\nTony says, \"Good to know. Does he let you touch his arm?\"\nSteve nods.\n\"I don't suppose you could give me basic specs on it or anything.\"\n\"It's made of some sort of metal,\" Steve tells him.\n\"Okay, I get that you're not the most mechanically inclined person, but the fact that I know how the arm was connected without also knowing how the arm was made, well, slightly maddening, so if you could tell me just one thing about it, maybe, just one detail--\"\nSteve says, \"Sometimes, he uses it to jerk me off.\"\nTony blinks at him. Tony says, \"So. We're having sashimi for lunch if you'd care to join us. You, too, Brad.\"\nSteve glances up to where Clint's sitting. He's laughing silently, tears leaking from his eyes. He gives Steve the thumbs up.\nTony says, \"I've been told the chef has prepared some particularly fine bluefin, which happens to be my favorite, so if you'll excuse me.\" He turns to go, then stops and sighs wearily. He turns back around. He says, \"You could have just told me. You didn't have to go around whispering with Sam and Natasha behind my back. Did you just not want to tell me or did you think I'd be some giant asshole about it or, I don't know. Am I not trustworthy enough?\"\nSteve shrugs. What's he supposed to say? That he's a multi-millionaire now but he still doesn't trust rich people?\nTony shakes his head and says, \"They whys don't matter. It's fine. It's fine. Water under the bridge and my feelings aren't hurt, honestly they're not because this is not about me, this is about the fact that you are with your fucking, Jesus, is he your childhood sweetheart? Oh, my God, he is, isn't he? Seventy fucking years of ice and torture and war and you got back together with your fucking childhood sweetheart and the me I was ten years ago would be throwing up all over the me I am right now, but I don't give a shit. I'm a changed man. I have a purpose, I have love, and you deserve that too and you've been so fucking lonely and, Jesus, I'm going to hug you, now. Don't tense up, I know you're not a huggy kind of guy but I'm coming in. Here I come, hugging an old man because I'm a little teary eyed right now that he's found love with another old man who wears a shocking amount of leather so, yeah, maybe I should have seen that one coming.\"\nSteve thinks he's just going to endure Tony's hug, but he finds himself returning it, finds the tension in his shoulders and down his spine disappearing and he smiles and he feels good. It's hard to remember the last time he just felt happy.\nTony pulls back after just a little bit too long, which is par for the course when Tony hugs anyone. His eyes actually look a little shiny and he rubs at them, then says, \"Seriously. Really great sushi. There's some sake which, okay, won't make a dent in you, Cap, but Clint, come on, sake bombs at lunchtime, huh? Huh?\"\nClint says, \"Oh, man, the last time I had sake was not good. I'm going to pass, but I will have some of that Scotch you were telling me about yesterday.\"\nTony says, \"Um, that's a very rare, very exquisite--\"\nClint says, \"I'm sitting up here on my day off watching out for the safety of you and the woman you love just because I care.\"\nTony says, \"Fine. All right, jeez, tomorrow we'll have the Scotch. We'll make it a thing. Whiskey Wednesday. You're invited, too, Cap. As is your boyfriend. Partner? Life-mate? Do you have a preferred term?\"\nSteve says, \"You can just call him Bucky.\"\nTony nods and says, \"Okay. Tomorrow, whiskey, don't be late.\"\nOnce Tony's walked through the atrium doors into the sunny enclosed patio, Steve looks up at Clint and says, \"Bucky and I are making tacos for lunch if you want to join us.\"\nClint says, \"Only if it won't be an imposition. I don't want to be a third wheel or anything.\"\nSteve says, \"Nah, you won't be, besides I think he wants to meet you after watching you through your windows for so long.\" He purses his lips. \"Not in a creepy way. He was stalking me, not you, so he only watched through your windows when I was visiting. That's still creepy, isn't it?\"\nClint drops down from the rafters and says, \"I've known creepier. Besides, a guy'd have to be really, really creepy to make me skip out on free food.\"\n***\n\"Why didn't I want to love you before?\" Bucky asks softly as he trails his fingers over Steve's chest. They're made of metal, but the movements are so precise, his touch is so gentle, they might as well be flesh and blood.\nSteve says, \"It's not that you didn't want to, you just didn't. You were kind to me, though. You knew how I felt about you and you took pity on me.\"\nBucky seems to think about that for a moment, then he shakes his head. He says, \"Nope.\"\n\"I promise you,\" Steve says. \"You really were kind.\"\n\"It wasn't pity,\" Bucky says. \"I think I let you think it was pity. That's fucked up. I was fucked up. That's kind of refreshing.\" He pushes himself up and straddles Steve's hips, grins down at him huge and happy. \"I was fucked up even then.\"\nSteve says, \"What?\"\n\"I knew you were in love with me. And I was in love with you. I remember lying there next to you, sick with it. Sick with the shame of loving you. Sick with the guilt of being too afraid to admit it. Sick with the shame of knowing that I was such a fucking coward that I just let you believe a lie, such a coward that I couldn't do one tiny little thing, whisper one single word to let you know it wasn't pity and that you weren't the only one.\"\nSteve takes a shaky breath, then another. He shakes his head. He says, \"It wasn't like that.\"\nBucky's flesh and blood fingers are tender against his cheek, his metal fingers gentle in Steve's hair. He says, \"Seems such a stupid thing to be afraid of. I don't remember why, I just know that I was. I'm not, now. You're the prettiest damn thing I've ever seen.\"\nSteve pushes Bucky off him and jumps up, striding across the room. He yanks the bedroom door open hard enough to rip it off its hinges and he doesn't even care. He can't breathe. He's having an asthma attack. No, that's not right. He can get air in just fine, he's just breathing too quick, too shallow. He nearly punches a hole in the wall but swerves at the last moment, kicks open the door to his gymnasium and pummels the hell out of the closest heavy bag. Once he's knocked it off its chain, he straddles it and just keeps punching, knuckles getting bloody, sand flying.\nHe's still shaking and his hands are bleeding and he wants to scream but he can breathe, at least. His breath is coming hard from the exertion, but it's not the panicked, shallow gasping from before. He rests his palms on the floor and hangs his head down. The whole time? Bucky'd let him suffer the whole goddamn time?\n\"Hey,\" Bucky says softly from the doorway, clearly hanging back out of Steve's range. He wraps his arms around himself.\n\"Hey, Buck,\" Steve says like he hadn't just lost his mind.\n\"Are you mad because I just called you pretty or because he never told you he loved you?\"\n\"Never told me,\" Steve says as he tries to catch his breath. He looks up. \"He?\"\nBucky shrugs. \"He's me, kind of, but not really. I don't know. I remember things but not like they're my memories, sometimes. I'm sorry, if that means anything. If I could go back and change things, I would. Would that have made a difference? Would we have stayed together if he'd told you the truth or would things have just turned out the same way?\"\n\"I don't know.\"\nBucky takes a step into the gym, then another. He says, \"Can I look at your hands?\"\nSteve nods and holds them up. Bucky straddles the other end of the heavy bag, which is smeared with Steve's blood. When he runs gentle fingers over the back of Steve's right hand, Steve winces.\n\"Broken,\" Bucky says softly. \"The third metacarpal, right below the joint.\"\nSteve nods. He can feel the throbbing ache of it. \"Can you splint it?\"\n\"If it doesn't heal right, they'll just have to rebreak it.\"\n\"I don't care. I can't handle medical right now.\"\nBucky says, \"Okay,\" and helps Steve up. He washes the blood away, washes the sand out of the gashes and scrapes, then splints and ices Steve's broken hand. They sit in silence at the kitchen table for a long time, Bucky rolling and unrolling a strip of gauze, Steve just looking down at the pulp of his knuckles.\nBucky takes a deep breath, then says, \"I don't know what to say. Maybe. Goddamn it. Maybe you really should be with Sam instead of me. Maybe it would be better for you and I've just been selfish this whole time worrying about it.\"\nSteve looks up at him and manages a weary smile. \"Don't be stupid. There's never been anybody for me but you.\"\n\"I'm not him,\" Bucky says, staring down at the gauze he's rolling and unrolling. \"I'm not ever going to be him again. Not the way you remember him.\"\n\"I'm not the Steve I was before, either. I mean, Jesus, I joined the Army, grew a foot, gained a hundred and fifty pounds, killed a lot of people, watched you die, tried to kill myself, woke up in this crazy time and fought aliens coming down through a hole in the sky, and that's just for starters.\" When Bucky looks up at him with sharp, demanding eyes, he realizes what he said. \"It wasn't,\" he starts. \"I wasn't looking to die. I just wasn't avoiding it, either.\"\nBucky nods like he understands. Maybe he does. He scratches the back of his neck. He says, \"I'm still really bad at talking about stuff. I was going to offer a blow job to help you feel better, but that's probably bad timing, right?\"\n\"Yeah,\" Steve says.\nBucky sighs. \"See, I was just happy that he wasn't the total goddamn saint everybody always makes him out to be, that maybe I didn't actually fall that far from what he was, and I didn't even think about how it might hurt you.\"\n\"On the plus side, you didn't kill anybody.\"\nBucky says, \"Even I know that's a really low bar.\"\n\"You didn't spy on anyone?\"\nBucky smiles a fake, too bright smile.\n\"Buck. Come on.\"\n\"I didn't spy on anyone today.\"\n\"But?\"\n\"You want some elephant tranquilizer lollipops for the pain in your hand?\"\n\"Do I have any left or did you use them all?\"\n\"I left you one.\"\nSteve thinks about it, then shakes his head. A boxer's fracture is a completely different animal than a gunshot wound. He can live without painkillers.\n\"Come to bed, then.\"\nSteve shakes his head. \"I'm not really in the mood.\"\n\"And I'm not just a walking fuck machine, so come to bed and rest your goddamn hand.\"\nSteve lies in bed with his broken hand curled against his chest. Bucky lies next to him and strokes his hair. He says, \"If I break off just a tiny little bit of painkiller, will you take it?\"\n\"I'm fine.\"\n\"Just because you can stand the pain doesn't mean you have to. Will you do it for me? So I don't have to watch you tough it out?\"\nSteve says, \"Okay,\" because how is he supposed to fight something like that?\nThe tiny sliver of lollipop tastes like fake watermelon and he tucks it between his cheek and gum to let it seep into his bloodstream. In a couple of minutes the throb in his hand turns into a vague ache and he starts to feel drowsy.\n\"I'm sorry he hurt you,\" Bucky whispers, stroking Steve's hair. It's nice and Steve closes his eyes so he can just enjoy it. \"I don't think he knew how much pain you were in. I don't think he would have stayed silent if he'd known you hurt as much as he did. I think he would have hated himself even more if he'd known.\"\n\"Buck,\" Steve whispers, because he's not making it any better.\n\"I don't hate myself,\" Bucky tells him. \"And I'm not afraid to tell you I like you. I like you better than anyone I've ever known. I know that doesn't count for much since I'm not exactly a prince, since I've killed most of the people I've known. I know the way I love you now is stunted and flawed and I'm pretty defective and even if he wasn't a saint, I'm not even close. But I wish I could make you feel the way I feel when I'm with you.\"\nSteve manages a smile and says, \"You want me to feel the need to plant surveillance equipment in the homes of everyone you come into contact with?\"\n\"You're not going to let the surveillance thing go, are you?\"\n\"Nope.\"\n\"Well, you don't just make me want to spy on people, I'll have you know. I also really like coming on your face.\"\nSteve laughs and something in his chest loosens. If Bucky's teasing him, then they'll be okay. Even if he's not the Bucky he used to be and Steve's not the Steve he used to be, if they still say affectionately shitty things to each other, then they have to have kept at least some of the important parts of who they'd been.\nSteve says, \"Yeah, you always did like that. You wanna do it right now?\"\nBucky says, \"When you wake up, maybe.\"\n\"I'm still awake.\"\n\"You're on elephant seal tranquilizers.\"\n\"Just cuz I'm a little sleepy doesn't mean you can't come on my face. I'll just lie here and look pretty and you can do all the work.\"\n\"Tempting, but Sam says any time consent's not totally clear, you need to just step away because it's your responsibility not to turn a maybe into an assault.\"\nSteve opens one eye and raises one eyebrow.\n\"I told you, I learned a lot listening to his sessions.\"\nSteve closes his eyes and says, \"Sam's a cockblock,\" but he doesn't mind just dozing and having Bucky touch his hair. Even with the broken hand, it's the most restful sleep he's gotten in years.\n***\nWhen Tony asks if he wants to blow up Hydra bases with them, Bucky says, \"Are you sure? Because I really fucking do, but I'm not exactly cleared for combat.\"\nTony says, \"I'm a nerd in a robot suit with absolutely zero military training unless you count getting drunk with the Joint Chiefs of Staff, what the hell makes you think I've ever been cleared for combat?\"\nWhen they go in, Bucky's so damn good. He's startlingly good. Steve had known, of course, had known intellectually that Bucky would be good at what he did, but he hadn't been prepared to watch it as it happened.\n\"What?\" Bucky asks as they relax in the quinjet on their way home. Natasha's flying, Clint's sitting in the co-pilot's seat, Sam's nursing a black eye, and Steve's sitting strapped in and silent while Bucky cleans his guns.\nSteve says, \"Nothing.\"\nSam says, \"It's like, no, okay, you know what it is? It's like there are two Natashas, now. Two of them, Steve. Only this one likes blowing things up even more than the first Natasha.\"\nSteve nods. That's a good way to put it. Bucky had been exactly what he'd expected him to be in the field, efficient and quick-thinking, silent, three steps ahead of everyone else, and really, really fond of grenades. He'd been expecting it, but he somehow still hadn't been ready for it.\nBucky says, \"How do you know she's the first Natasha? She could be the second Natasha, or even the third.\"\nNatasha says something sharp in Russian and Bucky laughs and says, \"Okay, okay.\"\nSam looks at Steve, like maybe Steve can translate; he can't so he just shrugs. Sam looks at Bucky. Bucky looks back at Sam. He lays his hands in his lap and waits calmly. Sam blinks and looks away first and says, \"Yeah, no, I don't have the patience for staring contests with regular people, let alone super soldiers.\"\nBucky goes back to cleaning his guns.\nNatasha sighs and says, \"Everyone wave at Tony or he's going to keep circling us and it's getting annoying, like a gnat flying next to your ear.\"\nSteve looks up and out the quinjet's front windows, then waves at Tony. Sam and Clint and Bucky all wave at Tony. Natasha gives Tony a weary smile. Tony waves at them, then breaks off to fly back home at a lower altitude.\nSteve's not sure if Tony actually makes it home hours before they do to assemble the gifts himself or if he just organizes everything with JARVIS. The woman in a gray pantsuit waiting for them in the lobby looks slightly apologetic when she says, \"It's a collection of housewarming gifts courtesy of Mister Stark. You can return anything you don't want.\"\nBucky opens the closest of many, many wrapped presents in the lobby of their floor and says, \"A jar of honey, just what I always wanted.\"\nThe woman says, \"That one's traditional. It symbolizes a wish for you to always enjoy the sweetness of life.\"\nSteve says, \"They're all great, thank you. I'll let Tony know how much we love everything.\"\nShe smiles and nods and heads towards the elevators like she's never wanted to get out of someplace faster.\nSteve says, \"Did she seem in a hurry to get gone to you?\"\nBucky says, \"She was probably dying of embarrassment just thinking about having to see Captain America's face when he opened up the basket full of sex toys.\"\nSteve says, \"Huh?\" and turns around.\nBucky's got a wicker basket in his hands, the paper ripped off from around it, exposing the lube, dildos, and other assorted sex toys nestled neatly in mounds of shredded tissue paper.\nSteve says, \"Did you know that sex was invented in the 1970s?\"\nBucky says, \"You don't say.\"\n\"Nobody before 1975 had ever heard of fucking. Ever.\"\nBucky looks down at the basket and says, \"That's probably why I'm looking at these objects with such confusion.\" He pokes a silicone dildo. \"What sort of whisk is this, anyway?\"\nSteve looks at the pile of gifts in the lobby and thinks about having to open every single one of them. Then he thinks about taking a hot shower. He says, \"I'm going to take a shower, you coming?\"\n\"Can I bring the whisk?\"\nSteve says, \"Bring two.\"\nBucky grins at him and snaps off a salute before saying, \"Yes, sir.\"\n***\n\"You've been suspiciously quiet for a while,\" Tony says over the com on their next op. \"Are you making out?\"\nSteve rolls his eyes and is about to answer when Clint says, \"Are you talking to Steve and Bucky right now or to me, Sam, and Tasha?\"\n\"Why would you be making out with Sam and Natasha?\" Tony asks.\nClint says, \"Well, they're both attractive people. I'm a mildly attractive person. We've formed bonds that could have conceivably pushed our relationships past something purely platonic and into the realm of the sensual.\"\nSam says, \"Oh, my God, do not laugh at that. Tasha, no, do not encourage him by laughing you're just going to make it worse.\"\nTony says, \"I'm listening.\"\nBucky says, \"Wouldn't your boyfriend get mad if he found out you were making out with other people, or is that a thing you guys are okay with? People are okay with that stuff now, right?\"\nAfter a moment of silence, Clint says, \"Which one of us are you referring to?\"\n\"You,\" Bucky says. \"I don't think Natasha's guy really counts as a boyfriend, and Sam hasn't worked up the nerve to ask out whoever Robin is, yet.\"\nClint laughs, Natasha sucks in air through her teeth, and Sam says, \"How do you know that?\"\nSteve has never heard a more annoyed sigh come from anyone than the sigh that Bucky lets out before he says, \"Jesus Christ, I'm a fucking spy. What is wrong with you people? Do you think the tracking devices and mini cameras and bugs get into your houses on their own? Sam talks to himself when he's trying to psych himself up and then he doesn't even do anything, just stands there in his office rehearsing, saying, 'Oh, hey, Robin, what's up? You seen the new Batman movie, yet?' and then calling himself stupid for only coming up with stupid lines which, by the way, is no way to talk to yourself. Treat yourself with as much care as you'd treat any other loved one. You taught me that.\"\nSam says, \"I...\"\nSteve rubs the spot over his right eyebrow.\nSam says, \"When did I teach you that?\" He gasps. \"Do you have my goddamn office bugged? Are you listening to my counseling sessions?\"\n\"Not anymore because Steve won't let me, but I learned a lot,\" Bucky says. \"You're a really good therapist.\"\nSteve says, \"This is maybe not the time for this conversation.\"\nSam says, \"Do you know what fucking professional confidentiality fucking means?\"\nBucky says, \"Since I'm either just legally or possibly actually really dead, can't you just pretend you have a ghost haunting your office? Would you be mad at a ghost who learned how to be a better person by listening to the advice you gave other people? Also, is Robin a boy or a girl? Am I allowed to ask that? I know there's a whole big thing these days about trying not to just assume people's gender, so am I allowed to ask if people prefer boys or girls or is that a thing that I should just let people tell me on their own?\"\nTony says, \"Cap, your life partner is my new favorite person on the planet.\"\nBucky grins at Steve and Steve shakes his head and mouths, No, but he smiles despite himself when Bucky says, \"Thanks, Tony, and I'm pretty fond of you after all the sex toys you gave us as housewarming gifts.\"\n\"I do hope you weren't shocked,\" Tony says.\nBucky says, \"No, we only use the waterproof ones in the tub, but thanks for thinking about our safety.\"\nSam says, \"What?\"\nClint says, \"Aw, imagination, no.\"\nNatasha says, \"If you boys are finished gossiping, you might want to pay attention to the shadow at the base of the tree just to my ten.\"\nSteve sees the movement, too. He says, \"Get ready to move on my count.\"\nHe counts. They go. The fighting's brutal. They're fighting soldiers this time, no middle management or scientists to run around surrendering left and right. They're fighting soldiers who aren't entirely human. Steve still has to give them a chance. Once they take the communications tower, he broadcasts over every channel. \"This is Steve Rogers. I'm here to tell you that you are no longer under the control of Hydra. Anyone who surrenders to us will not be harmed. Please, let us help you.\"\n\"They won't believe you,\" Bucky says softly, rolling one of the tiny grenades he favors between his palms. \"None of them will ever believe that you'll help.\"\nSteve says, \"I still have to offer it.\"\nBucky smiles at him and says, \"I know.\" He bumps their shoulders together and says, \"Come on.\"\nThey run and take cover behind a Humvee before Bucky throws the grenade. The building at the base of the communications tower explodes in shards of glass and metal shrapnel, in chunks of rebar and concrete. The tower itself whines as it starts to lean and then to fall. It feels just like old times.\nIt's a brutal fight, and once it's done, Steve sits on the ground with his back against what had once been the side of a bunker. There's smoke pouring out of the entrance closest to him and people are shouting orders. He holds his hand against the cut low on the left side of his abdomen and grimaces with the pain.\n\"How deep?\" Bucky asks, kneeling down next to him. He's out of breath and his face is blackened with soot.\n\"I've had worse,\" Steve says. It's pretty deep. \"You?\"\nBucky shrugs. He tugs Steve's hand away to look at the wound, whistles through his teeth as he pulls a bandage out of one of his many pockets. \"That's gotta sting a little bit.\"\n\"Barely a scratch,\" Steve tells him. He hisses in pain as Bucky lays the bandage over the wound and applies real pressure.\n\"Big baby,\" Bucky mutters.\n\"What? Did I complain?\"\n\"It's hardly a scratch.\"\n\"That's what I said!\"\nBucky leans in and rests his chin on Steve's shoulder as he keeps pressure on the wound. He says, \"You're going to let Dr. Yee look at it.\"\n\"I really don't need--\"\n\"You're going to let Dr. Yee look at it and then we're getting barbecue for dinner from that place on third, okay?\"\nSteve tips his head to rest against Bucky's. He watches in the distance as Clint makes his way surefootedly across piles of rubble, retrieving his arrows. There's chatter on the coms, Natasha organizing a wave of support crew, Tony and Sam flying patterns of reconnaissance to make sure no one's slipped out of their grasp; Steve ignores it and tries to pick out the scent of Bucky beneath the gunpowder and smoke. He says, \"The one on third with the good potato salad, not the one on third that only has cole slaw.\"\nBucky says, \"Of course the one with the good potato salad. And we're getting a full pan of cornbread. And a pecan pie. And brisket. And you're letting her give you stitches if she thinks you need them.\"\nBucky smells like sweat and blood and just a hint of the leather dressing he uses to keep his gear flexible. Steve closes his eyes wearily and smiles a little bit and says, \"Okay.\""
}