{
    "id": "4129527",
    "url": "https://archiveofourown.org/works/4129527?view_full_work=true",
    "author": [
        "eidheann"
    ],
    "title": "The Green Vial",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Harry Potter - J. K. Rowling"
    ],
    "relationships": [
        "Draco Malfoy/Harry Potter"
    ],
    "characters": [
        "Draco Malfoy",
        "Harry Potter",
        "Pansy Parkinson",
        "Blaise Zabini"
    ],
    "additional_tags": [
        "Post-Hogwarts",
        "Mpreg",
        "Potions Master Draco Malfoy",
        "Pining",
        "Friends to Lovers",
        "Romance",
        "slytherin friendships",
        "Mpreg Draco",
        "Potions",
        "Banter",
        "Harry's questionable taste in music",
        "flangst",
        "Translation Available"
    ],
    "language": "English",
    "series": "",
    "published": "2015-06-14",
    "completed": null,
    "words": "31,240",
    "chapters": "1/1",
    "comments": "313",
    "kudos": "12,830",
    "bookmarks": "2,287",
    "hits": "155,898",
    "summary": "<p>After months of seeing Harry Potter walk into his Apothecary disappointed and hopeless, Draco offers to carry the baby that Harry can't. Now he's just got to hide the fact that he's been half in love with Harry for years.</p>",
    "notes": "<p>Written for 2015 HarryDracoMpreg fest on Livejournal.<br>To say this got away from me would be an understatement. Many thanks to Tryslora, Lauren3210, and Firethesound for the multiple rounds of assistance, brainstorming, hand-holding, and generally just being amazing. capitu, I really hope you enjoy this. &lt;3<br>Translated into Spanish by SolEcito Yanass on ffnet <a href=\"https://m.fanfiction.net/s/13492715/1/El-Vial-Verde-Traducci%C3%B3n\" rel=\"nofollow\">Here.</a> THANK YOU!</p>",
    "text": "The first time Harry Potter walked into his small Apothecary off Margin Alley, Draco couldn't help but reach for the wand he kept just under the counter. He didn't expect Potter to hex him, but the rush of adrenaline that came whenever that messy hair came into view put him on the alert before he had a chance to think.\nPotter looked awkward: uncomfortable but determined in a way Draco had rarely seen before. He marched up to the counter, stubbornly maintaining eye contact, and slapped a prescription down onto it.\nDraco looked, because of course he looked. What could possibly send Harry Potter to Mandragora when Slug and Jiggers was much more conveniently located on Diagon Alley proper, and not tucked off one of the small side streets? And then he blinked, because the prescription was for a Fertility Potion. A male Fertility Potion.\nHe glanced up at Potter again and saw his expression had gone challenging, mulish in a way that was achingly familiar. Draco swallowed. \"You're in luck.\" Draco coughed quietly, trying to clear the tight feeling from his throat and clinging to professionalism like a shield. \"I have one vial left, and they take nearly a week to brew.\"\nPotter seemed to deflate a bit at that, as if the lack of challenge stole his energy. He nodded. \"Thanks, Malfoy.\"\nDraco turned to the shelf that held his prepared potions, finding the green vial between Everlasting Elixirs and Fire Protection Potions. \"You do know that these may interact with other potions? Specifically, you should avoid Dreamless Sleep, Draught of Peace, and Calming Draughts for three days before and after taking this for maximum efficacy.\"\nPotter's brow furrowed. \"My Healer warned me about Dreamless Sleep, but didn't say anything about the rest.\"\nDraco cursed the flush he could feel heating his face and ears. \"Well, those three all work similarly; by... suppressing various functions, emotional or physical. And, er... The fertility potion works best by... er, not suppressing.\" Draco coughed, making a vaguely obscene gesture. \nPotter's face pinked, but he laughed. \"Got it. Thanks, Malfoy.\" \n\"You're welcome. And.... Good luck.\"\nPotter looked almost as surprised by Draco's words as Draco was by the fact he said them, and that surprised expression lingered in Draco's memory even after Potter left the shop.\n ~0~\nDraco collapsed onto the sofa of the flat he shared with Pansy and Blaise when they were between flings, and sighed. He wanted nothing more in that moment than a house elf to come and bring him a large firewhisky.\n\"That you, darling?\" The approaching tap of heels on hardwood followed, and Draco cracked an eye as Pansy entered the room. She made a striking image, with her well-fitted white pantsuit and perfectly straight dark hair and careful makeup. Draco gave a faint smile and she shook her head and sighed. \"Really, you need to be more careful or you'll get wrinkles.\"\nHe rolled his eyes. \"Wrinkles are the least of my worries.\" He leaned in when she sat down beside him, resting his head on her shoulder. \"Bloody Tanner is talking about raising the rents again. As if I wasn't almost paying Diagon prices on that shop already.\"\nPansy tsked quietly. \"You should move to Owl Orders, you know. Much easier to find a lab without needing to worry about whether the location also has a shopfront.\"\nDraco groaned, shaking his head. \"I've already told you, I don't want to.\"\n\"But darling, you hate people. And Tanner has always been a greedy bastard, you could be rid of all your problems in a single go.\"\n\"Then what would I have to complain to you about?\"\nPansy swatted his leg as she stood up and meandered toward the sideboard. \"Because Merlin forbid you run out of things to bitch about. Truly a catastrophe.\"\nDraco stuck his tongue out at her back. \"Where are you off to, all dressed up?\"\n\"Oh, darling, you know Edmund loves me in white.\"\n\"Edmund again? It's been six months, are you going for a record?\" Then he yelped, as Pansy's Stinging Hex caught him on the forearm. \"Ow! You bitch, that left a mark!\"\n\"Mmm. Intended, darling. Keep your claws in, no need to be jealous because one of us is getting fabulous sex.\" She poured a glass of wine, and smiled broadly at Draco.\n\"Is that why you were faking on Monday?\" When Pansy arched an eyebrow at him, he rolled his eyes. \"Oh, please. I've known you long enough to tell when you're actually enjoying something.\" And then in falsetto, \"Oh, Edmund! Yes! Yes! is not it.\"\n\"Relationships are about compromise. I pretend I enjoy him sucking on my toes and I get to peg him after.\"\n\"Ugh! Pansy!\"\nPansy shot him a shark's grin, sipping her wine. \"Don't be a prude, darling. It's not attractive.\"\n\"I'm not going to be able to get it up for a month now that I've got the image of you pegging that twat in my head.\"\n\"Aw, why so glum? You weren't complaining when it was you, as I recall.\"\n\"It was once! And I was drunk!\"\n\"Mmm. And you have such a pretty arse. If only you weren't such a miserable wet blanket, you could be seeing more use of it.\"\nDraco buried his head in his hands. \"I hate you. So much.\"\n\"I love you too, darling. Now, give us a kiss. I'm going to be late.\" She leaned in, bussing him on the cheek, leaving the lingering feel of her lipstick. \"Don't wait up.\"\nShe tossed the Floo powder into the fire, and when the flames turned green, she paused. \"Oh! Blaise Owled. He's in Saint-Tropez the rest of the week, but has a Portkey back Sunday. We're doing dinner at Aconite. Seven.\" Then she stepped into the Floo and whirled away.\nDraco sighed, leaning back against the couch. Pansy was right about one thing, though he would never tell her so. He definitely needed to get laid.\n ~0~\nDraco had almost entirely forgotten about Potter coming into his shop to buy a Fertility Potion. At least that's what he told himself. He remembered to brew a new supply, five vials sitting on his shelf ready to sell, not for Potter, but because he was out. He remembered again when Potter's picture ended up in the Prophet at a fundraiser for Granger's Educational Reform Committee. And again when Blaise had hooked up with Wood, and Pansy had teased him mercilessly about Gryffindor stamina.\nStill, Draco felt completely surprised when Potter walked back into his shop a month later with another prescription and a frown. \"It didn't work.\"\nDraco paused, eyeing Potter carefully. \"I'm sorry.\"\nPotter's gaze focused, and he met Draco's eyes. \"It's not your fault. Both my Healer and Hermione made certain I knew going into this that they couldn't guarantee effectiveness.\"\nDraco blinked, nodding. \"I know...\"\n\"Well, I admit my first instinct was to wonder.\" And when Draco straightened, stung by the implication, Potter held up a hand. \"I didn't say it was logical. You pulled the vial off the shelf and had no idea I was coming. And you didn't go to the Prophet or anything else. Just... Our history, you know?\"\nDraco nodded slightly, unwilling to admit how much Potter's words hurt. \"I suppose I can't blame you. You are back, then?\"\nPotter grimaced. \"Yeah, if you have any in stock. Or do I need to come back in a week?\"\nDraco shook his head, falling back on professionalism. \"No, I try to keep everything that's not extremely perishable on-hand. The only question is if I have the amounts needed for some prescriptions.\"\n\"Just the one. I hope.\" Potter's lips twisted into a grimace and he frowned at the paper still in his hand before sliding it across to Draco. \"I don't know. I kinda thought I'd be lucky, you know?\"\nDraco watched Potter a moment, before turning to fetch the green vial. \"A chance is still a chance. Does your healer have any... suggestions?\"\n\"Besides miraculously becoming a Pureblood? No.\"\nDraco grimaced, but carefully smoothed his expression before turning to place Potter's potion on the counter. He was caught by how... defeated Potter looked. Defeated in a way he'd never seen before. It caused an uncomfortable clench low in his belly. \"A chance is still a chance. You can't give up on the first try.\"\nPotter glanced at him, his expression morphing from shock to a surprised smile. \"No, I can't. Thanks, Malfoy.\"\nDraco found himself smiling back as Potter laid three Galleons on the counter. \"And, no offense? But I hope I don't see you back in here.\"\nPotter laughed. \"I hope I'm not back here for this again, either. Thanks.\"\n ~0~\nBut Potter was back. Draco had been frowning at another rambling letter from Tanner, giving his opinion on everything from the quality of Owl Treats sold at Eeylops to his ongoing feud with Prunhilde Potage, when the door opened and slammed almost immediately after.\nDraco blinked, Potter's face was set in an expression of frustration, and Draco found himself grimacing in sympathy. He wanted to ask, or say something, but he was familiar enough with Potter's particular expression to know anything he said now would cause an explosion of temper. Instead he placed the potion on the counter.\nPotter slammed the prescription and the Galleons down, and stared at the green vial.\nAfter a moment of silence, Potter hissed a breath. \"Thank you, Malfoy.\"\nDraco blinked. \"You're welcome?\"\n\"It's just... hard. It's hard.\"\n\"Hope usually is.\"\nPotter's lips twisted briefly, and he huffed a short laugh. \"Yeah. And no one seems to get that hope is the worst part.\"\n\"How long does it take after? To test, I mean.\" How long do you need to wait to find out? How long does the anticipation grow? How long do you know you'll wait before you come back into my shop for another potion? The questions Draco really want go unasked.\n\"Two weeks to be certain.\"\nDraco nodded slowly. \"And the... your partner?\"\n\"We're not. Charlie's my friend, he's helping me out.\"\nDraco flushed, purposefully not thinking about how his breath loosened at that. \"Oh. And he's not interested in... going the other way?\"\nPotter shook his head. \"No, he lives in Romania. Dragon Tamer. He's not interested in giving up his job for a year, and I wouldn't ask him to.\"\nDraco nodded slowly, and Potter took the vial, staring at it for a moment. \"I thought him being Pureblood would help. I mean, he's my friend; he's gay, single, from a big family. I thought it would help.\"\nDraco nodded again, uncertain what to do with a Potter who apparently needed to spill all his thoughts. Slytherin friendships had never worked like that; anything so painfully personal would only be revealed privately, and only then with the aid of alcohol or Veritaserum. But something in Potter's expression left him wanting to reciprocate, to help if possible. \"Listen. There's a teashop at the end of the Alley. Would you like to...?\"\nBut Potter was already shaking his head, and Draco straightened at the familiar sting of rejection. \"Thanks. No, I mean it. Thanks. I'm expected for lunch. Probably late now, actually. Could we... Sorry.\" He stuck out his hand expectantly. \"Start again? Hi, I'm Harry Potter. Thanks for listening to me babble. Could we do tea later in the week?\"\nDraco glanced between Potter's hand and face, confused. \"Er...\"\n\"Come on. Shake my hand and say yes.\"\nDraco reached out automatically, gripping Potter's square hand. \"Yes?\"\n\"Brilliant. Thursday? About this time?\"\nDraco bit his lip, but nodded as Potter pumped his hand twice. \"I can do Thursday.\"\n\"Thanks. And thanks.\" The smile Potter gave him this time was much less bitter, more genuine, and Draco's breath caught. \"I'll see you Thursday. Meet here, yeah?\"\nDraco nodded again as Potter dropped his hand and grabbed the vial, hurrying out of the shop.\n ~0~\n\"Ugh, Blaise, must you?\" Draco ignored Pansy's whining from the hall with the ease of long practice as he stared blankly into his wardrobe.\nThe sound of his bedroom door opening distracted him, and he turned to frown as Blaise threw himself face down onto Draco's bed with a sigh. He could hear the sounds of Pansy's shoes moving toward the kitchen. \"Are you still drunk?\"\nBlaise rolled over, smiling beatifically at Draco. \"I'm in love.\"\nDraco rolled his eyes. \"Answering yes takes fewer words.\"\nBlaise blew a raspberry and Draco turned back to his wardrobe. \"All right, maybe a little.\" Then he giggled. \nDraco sighed, pulling out one of his standard work robes. Just because it was Thursday and he was going to meet Potter for tea didn't mean it required any dressing up. He'd been to that teashop dozens of times, and it wasn't a date. \nDraco grimaced at the thought.\n\"Aren't you going to ask with whom?\"\nDraco paused, one arm in his robe, and turned to look at Blaise. \"I assumed you'd tell me either way.\"\n\"Oh, you're no fun.\"\n\"I'll show you 'no fun' if you start wanking in my bed again.\"\nBlaise held his hands up in a gesture of innocence. \"It was one time and I was drunk!\"\n\"And you've admitted to being drunk now, and you're in my bed talking about being in love, and I roomed with you in Hogwarts. I'm well familiar with your wanking practices.\" \nDraco busied himself with his buttons and ran his fingers quickly through his hair. When he looked back at Blaise, it was to see him examining Draco closely. \"Why are you nervous?\"\nDraco blinked, schooling his features carefully. \"I'm not nervous. You're drunk. So are you going to tell me who the current target of your affection is before I'm late to open the shop?\"\nBlaise grinned. \"Pansy! Draco's hiding something!\"\nThe swift clip of Pansy's heels answered Blaise's shout, and Draco rubbed his head, willing the impending headache away. \"Bloody hell, Blaise.\"\n\"Draco! Darling!\" Pansy's arm wrapped around his shoulders and she marched him out of his room.\n\"I'm going to murder you slowly and painfully and then I'm going to hide the pieces, Blaise,\" Draco called over his shoulder as Pansy shoved him into one of the chairs in the kitchen.\n\"Talk.\"\nDraco gave her his best no fucking way eyebrow. \"Are you aware of the time?\"\nPansy pulled her wand and pointed at him. \"Are you aware that I don't care? Spill.\"\n\"Yes, do.\" Blaise padded up to them on nearly silent feet, smirking down at Draco.\n\"I'm not hiding anything, you twats. Blaise is merely seeking revenge for my reminding him of the time I caught him wanking in my bed.\"\nPansy clucked, shaking her head. \"Now, darling, you need to do better than that.\"\nDraco glanced between Pansy's impatient expression and Blaise's smug one before shaking his head and shoving Pansy's wand aside. \"Fuck off. If I see either of you here when I get back, I'm hexing the both of you.\"\n\"Touchy touchy.\" Blaise giggled again, and then Pansy reached out to smack his arm. \"Hey!\"\nDraco took advantage of the distraction and dodged around Pansy. \"And now I'm late. Thanks ever so.\"\n\"Wanker!\" Draco ignored Pansy's shout, hurrying into the Floo.\n ~0~\nMornings usually passed slowly, and the waiting in this one made it even worse. Draco had minimal distractions; a scant handful of people entered the shop after the early rush of pre-work shoppers.\nNormally he'd relax on his stool with the Prophet or the newest Tremberly mystery if no inventory or brewing needed doing, but this morning, he couldn't keep focus. He fidgeted around his shop, straightening and re-straightening vials, making lines of dried beetles, and stacking piles of stirrers.\nMostly he asked himself what in Merlin's name possessed him to invite Potter to tea.\nWhen Potter arrived (late, out of breath, and looking harried), Draco was ready to scream. \"Sorry! Sorry! I got held up out the door.\"\nDraco gave a strained smile. \"It's all right. If this is inconvenient....\"\n\"No! No, really. I'm always running behind; Hermione always tells me things start 30 minutes before they do to make sure I show up on time.\"\nDraco nodded slowly. \"I'll remember that, I suppose.\"\nPotter laughed, gesturing at the door. \"Shall we, then? I'm starved.\"\nDraco turned his sign to Closed and followed Potter from the shop, locking it distractedly. \n\"Cassandra's Teashop?\" Potter asked, pointing to the wooden building with colourful awning. \nDraco nodded, sliding his hands into his pockets to hide his fidgeting. \"It's nice. Quiet. Especially this time.\"\nPotter grinned back over his shoulder at Draco as he strode down the street, finally opening the door with a flourish. \"After you, then.\"\nDraco entered the shop, taking a deep breath of the familiar tea and sugar scented air, and smiled. \"Hello, Cass.\"\nCassandra smiled over the counter at Draco, a slight eyebrow twitch the only indication of her surprise when Harry Potter entered after him. \"Hallo. You've not been in for a bit. Your usual?\"\n\"Please.\"\nShe nodded and waved her wand, causing a pot to start steaming, and carrying the smell of bergamot into the air. \"Just a few minutes to steep, love. And for your friend?\"\nPotter smiled. \"Is that Earl Grey?\"\n\"It is, love.\"\n\"One for me as well, please.\"\nShe waved her wand again, and a second pot joined the first. \"Anything else? Your friend there loves my currant buns, but I always preferred chocolate biscuits with my Earl Grey.\"\n\"Chocolate sounds delightful.\"\nShe grinned and nodded. \"Clever fellow, taking the baker's advice.\"\n\"I always trust the baker. I've learned my lessons well.\" Potter laughed, giving an exaggerated wink.\nCassandra cackled, swatting Potter lightly with a towel. \"Oh, you're a charmer. I'll keep my eye on you. Go have a seat, I'll send your tea out when it's ready.\"\nDraco had already made his way to his usual table, and he smirked as Potter sat down across from him. \"If you're hoping for free biscuits, don't. Cass is completely mercenary.\"\nPotter laughed, looking around. \"I'm not. Well, I wouldn't turn them down, but I like her. She's fun. And I like this place, too.\"\nDraco looked around as well, trying to see the teashop with new eyes. It was cluttered with tables and chairs, full of chintzy cushions and doilies. Fairy lights practically covered the bright blue ceiling, and Celestina Warbeck played quietly on the Wireless.\nIt was so twee, he'd nearly turned around and walked right back out the first time he'd come. Only the smell of Cassandra's currant buns had stopped him. Draco shook his head. \"I never would have figured you to go for middle-aged matron in your decorating preferences, but...\"\n\"Oh, ha-bloody-ha. It's cozy!\" Potter's grin went sharper, and something of the familiar spark of rivalry lit his expression as he turned back to Draco. \"Besides, you're the one who brought me here, that says more about your tastes than mine.\"\nDraco found himself smiling back, flush with the feeling. \"Yes, for Cassandra's tea and pastry, not her decor.\"\nA pair of teapots and plates sailed between them, clattering onto the table, and they both turned to look at Cassandra, who was leaning on the counter, her chin in her hand. \"Don't mind me. I don't care what you think about my decorating.\" She grinned at them both, before pulling out a copy of Witch Weekly and flipping it open.\nDraco poured his tea, adding milk and sugar, and noticing Potter doing the same. \"Her biscuits are good, I've just always had a weak spot for currant buns.\"\nPotter smiled at him. \"I had some chocolates once, Muggle, not Honeydukes, and the chocolate was infused with Earl Grey, and ever since then I've not been able to resist chocolate with my tea.\"\nDraco smiled slightly. \"I just... I never understood the appeal, so much. Chocolate, I mean. It's all right.\" He trailed off, as Potter stared at him, gaping. \"What?\"\n\"You had such a sweet tooth in school. Your mum was always sending you treats. You're trying to tell me that you don't like chocolate?\"\nDraco shifted in his seat. \"Why is that so surprising?\"\n\"It's not surprising. I just think you're shitting me.\"\n\"Petits fours come in flavors beyond chocolate.\"\n\"Madness.\"\n\"Just because you have an uncultured palate that only cares about one flavor....\"\nPotter held up a hand, laughing. \"All right, all right. I'm an uncultured swine.\" Still chuckling, Potter took a bite of his biscuit. \"God. This is delicious.\"\nDraco rolled his eyes, bringing his cup to his mouth and closing his eyes to inhale the fragrant steam. After a breath, he took a sip and sighed. \"I always preferred the fruit ones. Mother sent me one, just rarely, always as a treat. It was raspberry and lemon zest with white chocolate. It was my favorite.\"\n\"Ha! See? Chocolate!\"\nDraco laughed. \"Most people don't consider white chocolate to be real chocolate.\"\n\"Oh, it's not. But liking any kind of chocolate makes you less weird.\"\nDraco shook his head, smiling in spite of himself, before finally taking a bite of his pastry. After several moments of silence, broken only by the sounds of their tea, Potter spoke again. \"This is... easier than I expected it to be.\"\nDraco nodded slowly. \"I was wondering if I'd gotten too close to the cauldron fumes when I made the offer, but this has been... nice.\"\n\"Why did you offer?\"\nDraco shrugged uncomfortably. \"You seemed like you needed to vent. Not so much now, granted, but....\" He cursed the flush he could feel burning his cheeks, knowing why Potter was so much more relaxed today. \"But what about you? Why did you come to my shop? Slug and Jiggers is much more convenient.\"\nPotter grimaced slightly. \"And have every reporter filling the papers with the details of my purchase? No thanks.\"\n\"So you thought I was a better option?\" Draco couldn't suppress his surprise. \"With our history, you thought you were safer in my shop?\"\nPotter sighed. \"Who is a reporter going to believe if they don't see it for themselves? You or me?\"\nDraco felt an uncomfortable twist in his belly, and he looked down, picking at his bun. \"Ah. Because the former Death Eater couldn't possibly be a reliable witness.\"\n\"At first? Yeah. But you didn't go to the paper. And you were different, and so I came back and I wanted to come to tea with you.\"\nDraco took another sip of his tea. \"That's... fair.\"\nThe silence this time was awkward and uncomfortable, and Draco cursed Potter for turning the conversation away from the relatively safe argument about sweets.\nFinally, Potter sighed. \"Look. You were a git in school. And I was probably a bit of a git as well. I'm not going to apologize for being cautious. But I'm willing to let the past be the past and move on if you are.\"\nDraco blinked at Potter, taking in the familiar stubborn expression he wore. \"Move on?\"\n\"We were having fun. Hopefully I won't need you in a professional capacity forever.\" And at that, Potter's expression twisted in a grimace. \"But we can still meet up, yeah? Tea at the best tea shop on Margin Alley?\"\n\"Only tea shop on Margin Alley.\" \n\"There you go. So, friends?\" Potter held out his hand again, reaching across the table. \"I'm Harry Potter. Sometimes an arse, though I like to think I grew out of the worst of it, pretty much always late, and loves chocolate.\"\n\"Draco Malfoy.\" Draco reached across, shaking Potter's hand once again. \"Always punctual and couldn't give a fig for chocolate.\"\n\"And a bit of an arse?\"\nDraco shook his head. \"I'm not the one insulting you this afternoon, Potter.\"\nPotter rolled his eyes. \"Bit of an arse. Good to meet you. Do this again in a couple weeks?\"\n\"I... All right.\"\n\"Good. Now I need to dash, I've got a meeting with Hermione that I'm probably late to.\" With that, Potter gulped the last of his tea and pocketed the biscuit. \"I'll owl you next week, yeah?\"\nDraco nodded, though he was fairly certain this tea with Potter would be a one-time thing. \"All right.\"\n\"Thanks for the biscuit, Cass!\" Potter waved briefly before he practically ran out the door.\nAfter a moment's silence, Cass turned to look at Draco. \"So. That's Harry Potter, then?\"\n\"Yes.\"\n\"Huh.\" And she turned back to her magazine, leaving Draco to finish his tea in silence and leave payment on the counter. It was a very odd afternoon.\n ~0~\nDraco found his thoughts turning to Potter more and more over the next week. His flat was mostly empty: when he'd arrived home the evening after tea with Potter, Pansy and Blaise had been gone, leaving only notes behind. Pansy was on a weeklong holiday in Barcelona with Edmund, and Blaise, continuing his trend of bagging Quidditch stars, was in Sofia with Viktor Krum, the newest love of his life.\nFor a few days, it was a relief. Draco wandered the flat in his pants, drank pumpkin juice directly from the jug, and didn't need to fight the dirty scavengers for his ginger biscuits.\nBut without them, he became aware of how quiet his life had become. He exchanged weekly letters with his mother, who was living with his father in genteel exile in Provence. He occasionally dropped in on Millie and Greg in their small cottage near Cornwall, where they oversaw their greenhouses and supplied several Apothecaries (himself included) with ingredients. He sent owls to Theo in Zurich, mostly to forward their chess game. He sent even more infrequent owls to Lovegood, who for some reason wrote him quarterly and babbled about various magical creatures, which he was fairly certain had never existed.\nAnd it felt like it had been so long since both Pansy and Blaise were gone at the same time for more than a day or two, he felt entirely at loose ends by Monday.\nIt didn't help that the lack of his friends meant he had nothing to distract himself from thoughts of Potter. And why he'd invited him to tea. And why Potter had accepted. And most importantly, why it hadn't been bad.\nThe latter point was easy enough to explain. Potter had just gotten the potion, so likely he was still basking in the glow of the recently shagged. Amazing what an orgasm could do to one's outlook.\nHe'd also have been in the safe period of hope, when endorphins outweighed the passage of time and building anxiety. Draco wondered when Potter's thoughts tipped over, when in the two-week wait for results, hope faded.\nDid it change? Did the hope last less and less as each month passed? At what point did it become too much?\nHe wondered what Potter would do then. Adoption was unlikely, even given Potter's heroic history, as he would still be a single parent. But it could happen. Was blood so important to Potter that he'd struggle to give birth to his own child regardless?\nDraco didn't know, and not knowing was driving him mad.\n ~0~\n\"Darling! You've an owl!\" Pansy's voice carried through the flat as he spun in from the Floo.\n\"How was Barcelona?\" He asked, pulling his outer robe off and starting toward his room. \"Also, we need takeaway tonight unless you've gone shopping since you've been back.\"\n\"Draco. Darling.\" Pansy's clipped voice caused him to pause and turn to look at where she was standing at the kitchen table. Her expression was... odd. \"Why are you having tea with Harry Fucking Potter?\"\n\"I'm having tea with Potter?\" Draco was careful to keep his expression blankly surprised and his tone even, even as he mentally cursed Potter sending the promised owl to his home rather than his shop.\nPansy looked at the parchment clutched in her hand. \"Draco, thanks again for tea, I'm still dreaming about Cass's biscuits. Do you think she'd share her recipe? And you really should do something about your chocolate aversion; it can't be healthy. I'm not going to be able to do next week, some things came up and I'll be out of town all week, could we reschedule? Or, I reckon I'll see you in a few weeks anyway. Harry.\" Pansy shot Draco a look. \"Harry? Draco, what the fuck is going on here?\"\nDraco's heart pounded in his chest, but he put ice in his voice. \"Why are you asking? You've read the owl, you obviously know everything there is to know about this situation.\"\n\"No, because I clearly have no idea what you're thinking! Why are you doing this to yourself?\" Pansy slammed the parchment on the table, her expression tight and eyes going glassy. \"This can't end well. Just because you've always wanted to be friends with the fucking Chosen One, what do you think his friends are going to do when they find out?\"\nDraco said nothing, merely continued to watch Pansy. There really wasn't any response; Pansy was saying the things he knew to be true anyway. And while part of him was surprised Potter actually had owled him as promised, he was not surprised about the cancellation.\nPansy stared at Draco another moment before she sighed. \"Darling, please. Whatever Potter is doing, whatever you are doing, be careful. You've never thought clearly where he's involved.\"\nDraco grimaced slightly, uncomfortable with the truth of her words. \"Do you really think he's... what? On some strange undercover mission investigating a Death Eater?\"\nPansy shot him a look. \"Oh, please. Subtle was never something Potter was good at.\" She sighed again, looking back at the scroll. \"And no, I don't really think he's got some... agenda. He's too bloody Gryffindor for that. But, Draco... Whatever he's doing, when he's done with it, when he's moved on... We're going to be the ones left picking up the pieces.\"\nDraco blinked at Pansy. \"Picking up the pieces? What are you even talking about?\"\n\"Draco. You were completely arse over tit for Potter—\"\n\"In Hogwarts.\" Draco interrupted. \"Pansy, that was years ago. This has nothing to do with...\"\n\"Doesn't it? Tea with Potter? Rescheduling another? See you in a few weeks?\"\n\"Merlin! It wasn't a fucking date!\"\n\"Wasn't it?\n\"No!\" Draco shivered at the thought. \"He just.... He wanted to move on from Hogwarts, leave the rivalry behind. We're just... seeing if we can be friends.\"\n\"Oh, Draco.\" Pansy shook her head, her expression sad. \"You can't be friends, not with Potter. You care too much.\"\nHe felt his stomach sink at her words, so he responded the only way he could: \"Fuck off.\"\n ~0~\nHe avoided Pansy, as much as he was able given that they shared a flat, after that. She said nothing about Potter to Blaise when he returned from Bulgaria making Wronski Feint innuendos and wearing a Bulgarian team jersey, but he would often find her eyes on him, her expression sad.\nHe didn't care. He wrote an extra letter to Lovegood, asking about the Heliopaths she'd mentioned in her previous owl, and forwarded his chess game with Theo several moves. He worked, brewed, and visited Flourish and Blotts and picked up the first three Thistlethwaite mysteries he'd heard so much about but never tried himself.\nHe was so very aware of time. When Potter's two-week mark arrived, he nearly sent an owl. Instead, he wrote to Greg and Millie to ensure he had the freshest ingredients needed to brew the first round of antenatal potions.\nThen he waited, though he would deny it if asked. Potter would return to his shop for Potions if nothing else. He'd know in two weeks.\n ~0~\nPotter entered Draco's shop a week ahead of schedule. Draco forced a smile, already reaching for the antenatal potions he'd brewed before Potter's expression registered. He let his hand fall to his side, uncertain what to say to counter Potter's expression.\nAfter a shared silence, Draco sighed. \"You'll keep trying, then?\"\n\"It should have worked by now. Male pregnancy is hard; potions aren't a hundred percent effective, I know. But when the deck is stacked against me to begin with, when I'm not a fucking pureblood, it's... Maybe it's a sign.\"\nDraco shifted uncomfortably. \"Have you looked into surrogacy? Adoption?\"\nPotter grimaced. \"I... None of my female friends are willing or able to carry, not now anyway, and not even being the fucking Chosen One is enough to convince the Ministry to adopt a child to a single man.\" He ran a hand through his hair, leaving the short strands sticking out even more wildly. \"Besides, I wouldn't trust them, even if they did. Because if it's just my status as Chosen One, what happens when they invariably turn against me again? Revoke the adoption?\"\n\"And you aren't willing to wait? For someone else, I mean?\"\nThis time, when Potter looked at him, Draco cringed from the hollowness of the expression. \"I can't. I feel like I've been waiting for the past five years. It's the first thing I think about when I wake up in the morning and the last thing at night.\"\n\"What about me?\"\nThe instant the words are out, Draco closes his mouth with a snap. It wasn't anything he'd been expecting to say, and from the flabbergasted look on Potter's face, not words he'd expected to hear, either.\nHe met Potter's eyes, though; pride making him unwilling to take them back. Pansy was right; he was completely stupid for Potter. But he couldn't stop the little voice in his head, the one shouting that this would give him Potter. For a night, for nine months, forever tied by the life they would create. \n\"Mal—Draco... What?\" Potter shook his head, his expression stunned and wary. \"I can't... You can't...\"\n\"I can. I'm offering.\" He reached blindly behind himself and grabbed a familiar green vial. \"I can take this. And I've a fresh supply of antenatal potions already brewed and ready.\"\nDraco's heart was racing, and he was torn between the equal certainties that this was a horrible idea and that he'd finally be able to prove himself to Potter.\nPotter, who was still shaking his head. \"You can't.... I can't ask you to do this.\"\n\"I'm a Pureblood. I have the potions. We're friends, right?\"\n\"Barely! We've had an hours worth of actual conversation.\"\nDraco blinked, stomach falling into his feet, and set the vial down on the counter. \"Oh.\"\n\"We've barely spoken in years, and I appreciate this, I do, but... What are you even thinking? We're practically strangers.\"\n\"I was thinking this was something I could do to help you. Because I took you seriously when you offered friendship. Obviously I was mistaken.\" Draco gazed steadily at Potter's left shoulder; grateful years of practice leeched any emotion from his voice. \n\"That's not fair, Draco. You have to admit we barely know each other, not really, and this isn't something like... like letting me borrow your owl.\" At Draco's continued silence, he continued, voice almost pleading. \"This is... This is your body for months.\"\n\"I do know what is involved in having a child.\" \n\"And what about your brewing?\" Potter continued, speaking over Draco's comment. \"You'd want to give up your job for a year? This makes no sense.\"\nDraco's jaw ached with the effort of biting back his words. Finally, he breathed again. \"Fine. I understand. Would you like a potion or will you be going?\"\n\"Draco—\"\n\"Because I'm really very busy and don't have time for loitering if you're just seeking to kill time. So take the potion or get out.\"\n\"Draco wait—\"\n\"Get out, Potter. I'm sorry I assumed friendship where there wasn't any, but I'm over it now.\"\n\"Draco—\"\n\"Get out!\" Draco finally dragged his gaze away from Potter's shoulder and met his bewildered gaze, scrambling for his wand and raising it unsteadily. \"Get out, get out, get out!\"\nPotter took a step back, before turning and hurrying out of the shop, leaving nothing but the sound of the bell in the air. Draco waved his wand, flipping the sign to closed and locking the door before grabbing the green vial again. His arm shot back, but he stopped himself before he flung it against the wall. \nPansy had been right. He'd always cared too much where Potter was concerned, unable to help himself when faced with Potter's misery. But Potter had been right as well, it was a stupid plan. Stupid of Draco to expect Potter to really forget their past, to hope that he'd have an actual chance to...\nThe hardest part was that Draco couldn't blame Potter for his denial. What were a few conversations against the weight of their history? Potter would have to be an idiot to take Draco up on his impetuous offer.\nAnd Draco knew, whatever his words, Harry Potter was no idiot. The entire day had been nothing but a mistake.\nShuttering the windows, he stumbled to the Floo. With luck, he'd make it to his room before breaking down. He tossed in the Floo Powder and took a breath to collect himself.\nWhen he whirled into his living room, Pansy and Blaise turned to him with equal expressions of shock from their seats on the couch. Pansy took one look at him, and her expression quickly morphed from surprise to anger to sympathy. \n\"Oh, Draco...\" Her words were all it took, and he could feel his control crack like glass, and tears began seeping down his cheeks. Both Pansy and Blaise were there in an instant, pulling him back to the couch and between them, each holding him tightly as he cried.\n ~0~\nDraco realized he was still clutching the vial when he woke up some time later, still cuddled between Pansy and Blaise. His head was pounding and his eyes felt swollen nearly shut. Silence followed his awakening, and he straightened in his seat, unwilling to look at either of his friends.\n\"Harry Potter is an arse.\" Pansy's words were loud in the silence, and his hand tightened around the vial again before slipping it into his pocket. \"He's an arse, Draco. He's not worth it, whatever it is.\"\nHe said nothing, staring blankly at the fireplace. He heard Blaise sigh behind him, and then there was the comforting weight of his hand on Draco's shoulder. \"Why are you letting Potter do this to you? I thought we'd been through this already.\"\n\"They've apparently been having tea together. Talking, he calls it.\"\nAfter another silence, Blaise gives his shoulder a squeeze before withdrawing. \"Oh, Draco.\"\n\"It was talking. Pansy, it was just talking. I just... assumed we'd become friends. He said we'd become friends.\"\n\"Draco, you know you can't—\"\n\"I know! You've already told me. And you were right. Happy?\" Draco turned to look over his shoulder at Pansy, who looked near tears.\n\"No! I'm not, and I won't be until I string him up by the bollocks.\"\nHe shook his head, even as Blaise's quiet, \"Pansy, leave it,\" silenced his own response.\n\"No! He has to know he can't just walk all over people.\"\n\"He didn't, Pansy. As much as I'd like to say it was, none of this was Potter's fault.\"\n\"He needs to know—\"\n\"Know that he left Draco a crying wreck on the sofa? No, Pansy.\"\n\"I wouldn't tell him that!\"\n\"Enough, it's done. He's gone. Promise me you won't do anything that will make me see him again.\"\nPansy's expression was mulish, but he held her gaze, his expression pleading. \"Fine.\" She huffed a sigh, crossing her arms tightly across her chest. \"But if he goes near you again, I am going to hex his bollocks into earrings.\"\nThey were interrupted by the sound of tapping at the window, and Blaise stood to let the owl inside. It held out its foot, and when Blaise took the scroll, it flew back out again. \nBlaise stared a moment at the parchment before breaking the seal and opening it, eyes travelling quickly down the page. \"It's from Potter.\"\nDraco could feel the blood leaving his face even as Pansy launched herself at Blaise. \"What?\" Pansy screeched, snatching the scroll. \"That bastard. Fucking bastard.\"\n\"What does it say?\"\nPansy glanced between Draco and the parchment before she shook her head. \"No. I'm not doing this. Incendio.\" The parchment flared, and then quickly burnt to ash. \"That fucking bastard can just...\"\n\"Pansy.\" Blaise squeezed her hand, and her mouth snapped shut. \"I think ice cream for dinner tonight.\" \nPansy's eyes lit. \"Yes, exactly the thing. We'll have ice cream and red wine and forget all about Potter.\"\n\"I don't need... My heart's not broken.\"\nBlaise shot Draco a flat look. \"Don't be silly. Of course it is. So we'll have the traditional heartbreak dinner and tomorrow, we'll plan revenge.\"\n\"No. I mean it. Don't. I don't want...\"\n\"It's tradition, Draco.\"\n\"Pansy, please.\" Draco didn't want revenge. He wanted time. Time to lick his wounds. Time to once again forget Harry Potter existed. Time to forget how monumental a cockup he'd had in offering to carry Potter's child.\nPansy sighed. \"Oh, all right. We'll plan, but we won't carry out then. Now shut up, you've used my generosity for the afternoon. I'm getting all the chocolate.\"\nDraco gave a faint smile. \"I'll survive that somehow.\"\nPansy squeezed his hand. \"You'll need to, darling.\" She gave a gentle smile, lower lip trembling. \"Your chocolate is all mine.\"\n ~0~\nThe evening was filled with a half dozen containers of very good ice cream from Fortescue's and several bottles of mediocre red wine from the shop on the corner. They left the Wireless playing quietly in the background until Pansy turned up the volume and began singing along into her spoon somewhere between the third and fourth bottle.\nThey avoided speaking of any subjects that could be considered serious, mostly gossip in response to whoever was on the Wireless at the moment, and when they finally collapsed sometime after midnight, Draco felt the empty ache inside him would actually be bearable.\nHe was less certain when he woke the next morning, collapsed in one of the chairs in the living room, head pounding and mouth dry and swollen with hangover. He stumbled to the kitchen, pulling out a dose of Hangover Potion, and swallowed it quickly, following it with a large glass of water. Pansy and Blaise were still unconscious, so he set aside another two doses and started making tea. \nAs expected, Pansy groaned and covered her face around the time the tea was finished. Draco brought her the dose as well as a large mug of tea with extra sugar, passing her first one, then the other after she grimaced and swallowed the potion down. \nShe sent a bleary glare at where Blaise was still sleeping before slurping loudly at her tea. \"I hope his hangover is as bad as mine.\"\nDraco smiled faintly, wandering back toward the kitchen and his own mug of tea. \"This is Blaise. We'll be lucky if he has any hangover at all.\"\nAfter a sip of his own tea, he looked up to where Pansy was standing, frowning down at him. She stood a moment before sighing and sitting down across from him. \"Fucking Blaise.\"\nHe smiled again. \"If he sleeps much later, you can eat the rest of his ice cream for breakfast.\"\n\"Ugh. I hate pumpkin butterscotch.\"\nDraco waved his wand, summoning the cherry chocolate and then sliding it across to her. He continued to sip his tea as she grabbed the spoon and dug out a cherry. He knew it was only a matter of time before the second part of their tradition began, and he really wasn't looking forward to a day spent talking about Potter.\nHe knew he couldn't avoid it, however. Pansy was positively itching to begin, and only the fact that Blaise was still asleep was holding her tongue.\nThey sat in silence for nearly an hour before Blaise yawned, loud and long, and wandered into the kitchen. He fetched his ice cream, ignoring the potion and tea both, and sat down at the third chair and smiled. \"Good morning.\"\nDraco glanced back and forth between the two of them, Blaise's calm and Pansy's eager bloodthirstiness, and closed his eyes. \"Good morning, Blaise.\"\n\"Are we ready, then?\" Draco had never hated Blaise's inscrutability as much as in those four words.\n\"Yes.\" Pansy's response was hissed in her eagerness. \"I've been planning this for weeks.\"\nDraco flinched, but both Pansy and Blaise ignored it. \"Planning for weeks? So you've moved beyond bollocks? Or are you starting there for tradition's sake?\"\n\"I rather liked using his bollocks for earrings.\"\n\"But you always start with that. You should be more creative.\"\n\"Well you always start with hexing his dick in a knot, if we're talking a lack of creativity.\"\n\"Granted. What do you suggest, then?\"\n\"I could transfigure his nose into a dick. Everyone would see how much of a dickhead he is.\"\nDraco rubbed the lingering headache behind his eyes. This was tradition, yes. Something done every time one of them had their hearts broken. But right now, he just didn't feel up to it.\n\"I liked when you sent the owl to Brian's wife along with the pair of pants. That was classy.\"\n\"It was. At dinner, too.\" Pansy's smile grew, and she turned to Draco. \"What do you think, darling? Maybe a Howler when he's visiting his Weasleys?\"\n\"Pansy, you promised me.\"\nPansy turned to look at Draco, her expression going stubborn. \"He deserves it.\"\n\"You promised.\"\nPansy continued frowning, but Blaise broke in before she could argue. \"I know it's tradition, but I think we can break from this long enough to get some showers. I want some real food, and the Pho shop should be opening soon.\"\n\"That sounds like a wonderful idea.\" Draco broke in before Pansy could dig in her heels purely out of spite. \"Come on, Pans. You know Pho works better for your hangovers than potions.\"\nPansy rolled her eyes. \"Fine. But don't think we're done with this.\" \nWhen the sound of water in the pipes signaled Pansy's shower, Blaise stopped Draco from going into his own room with a hand to the arm. Draco turned to see Blaise regarding him solemnly. \"I can try buffering, but you know Pansy. She'll have her way in this, and I can't say I feel she's in the wrong.\"\nDraco sighed. \"I don't want to think about revenge. I don't want to think about him.\"\nBlaise nodded. \"I understand. But she doesn't. She loves you, and she's always been fiercest in your defense. And... I'm not entirely certain it's not warranted.\"\nDraco frowned. \"What do you mean?\"\n\"What's in your pocket, Draco? You were trying very hard to hide it yesterday, and Pansy didn't notice. But it dug into my hip most of the night.\"\nDraco could feel the blood rush from his face before returning; flooding his cheeks a painful red. \"It.... Nothing, it was just what I had in my hand when I left the shop. I forgot to... I didn't realize I was still holding it.\"\n\"It's a very few potions Potter would need that could send you into your current state. And if Pansy finds out about any of them, nothing would stay her hand.\"\n\"Blaise....\"\nBlaise held up his hand. \"I won't. But it's why I think he might deserve it. Does he know?\"\n\"No. He has no idea.\"\nBlaise nodded. \"He's an idiot. But anything Pansy plans will test that. She's not known for being subtle.\"\n\"He can't know, Blaise.\"\nBlaise sighed. \"I'll do what I can. Go on. I'll entertain Her Highness until you're out and keep her from doing anything too irreparable.\"\n\"Thank you.\"\n ~0~\nPho did nothing to curb Pansy's bloodthirstiness; her plans for vengeance grew progressively more creative as the day wore on. But her mood improved, and she seemed to plot for the simple joy of planning mayhem, and as such was happy to leave Draco mostly out of it.\nThe soup improved his mood as well. The hollow ache of embarrassed rejection lingered, but he thought he'd be able to return to the shop the next day without fear of repeating his earlier loss of control.\nMore importantly, he was confident he'd be able to work. That he'd be able to separate his life and his shop from Potter. He'd recovered from Potter's rejection once before, he just needed to remind himself that life without Potter in it was normal. The previous months had been the anomaly, and not anything he could base his existence or happiness on.\nAnd that night, as he prepared to climb into bed, he held the vial in his hand, staring at it. He'd never really given serious thought to children before Potter. When he was younger, it was simply assumed. He'd marry, have children, and carry on the Malfoy name. The war had shifted his priorities rather abruptly. There was no longer anything worth carrying on, as his parents' exile marked the loss of any importance to the family name. But it had also granted Draco a freedom he'd never thought possible, the freedom to make his own choices as to what he did with his future.\nBut something in Potter's desire... The portion of Draco that had known his mad plan was exactly that: mad, lingered. Because even if the assumed marriage and family of his youth was no longer important, family was. And that part of the almost with Potter ached, as much as the sting of rejection. The split second of hope, not just for Potter, but for a family.\nHe'd been willing to bear a child for that hope, not only for Potter. And that realization hurt.\n ~0~\nPansy hovered as Draco prepared to Floo to his shop the next morning. She reminded him of nothing so much as his mother as they prepared to go to King's Cross Station at the start of each new school year, and he felt a twinge at the months since he'd last seen her.\n\"I think I'm going to see about a Portkey next weekend. Mother has been pestering me for a visit. Something about her beehives.\"\nDraco didn't miss the way Pansy's shoulders seemed to relax ever so slightly at his words. \"That sounds lovely. Give my regards to your mother.\"\n\"And my father?\"\nPansy flipped two fingers. \"You can give him that for me as well.\"\nThey both grinned at the familiarity of the exchange, and Draco tossed the Floo Powder into the flames and spun to his shop.\nHe looked around, surprised that nothing had changed. It felt like he'd been gone more than a day, that there should be a layer of dust to Scourgify, or toppled ingredients to right. The air didn't even smell stale, not really, but memory caused him to feel the closeness of the shop, and he opened the windows along with the shutters.\nWhen he opened the door, however, he saw a piece of folded parchment stuck to it. The charm released as soon as he touched it, and he frowned as he wandered back into the shop and to his stool behind the counter.\nHe didn't have time to look at it, however, as his first customers began trickling into the shop. He pocketed it, hand brushing against the vial still in his pocket as he did so, and he grimaced slightly before throwing himself into dealing with customers.\nHe buried himself so far in his work that he forgot about both items until he surprised himself shortly before lunch. His hip hit the counter and there was a familiar wood on glass clink, and his hand went to the pocket on instinct.\nHe grimaced, pulling the vial and parchment from his pocket and staring at each of them briefly. He placed the potion back on the shelf before unfolding the note.\n\nDraco,\nWhat happened? You didn't answer my owl, and when I stopped by the shop, it was closed. Can we talk?\nHarry\n\nDraco sighed, fingering the corner of the parchment, eyes fixed to the words. He knew he should just Incendio this like Pansy did the last one. Make the separation from Potter a clean break. It hurt now, but it would be better in the long run.\nBut he wanted to hold onto it. He wouldn't respond; he wasn't that much of an idiot. Pansy would hex him blind, and he'd deserve it. Potter was a closed door in his life; it was only the time he needed to realize it had never really opened that caused it to sting so sharply.\nHe laid the parchment across the counter, smoothing the creases. What Pansy never knew couldn't hurt him.\n ~0~\nOf course, Potter couldn't stay gone, and even a quiet weekend in Provence did little to convince Draco that Potter would really stay away. There were no further owls in response to Draco's silence, but when his mental calendar ticked over the day Potter was due for another potion, he was unsurprised when Potter entered the shop.\nDraco glanced up from his book when the door opened, before dropping his eyes quickly again. Potter looked like hell; eyes dark-ringed and hair standing more on end than usual. Draco didn't want to look, because just seeing Potter made his chest ache. Instead he reached blindly, pulling the familiar potion off the shelf and placing it on the counter, staring determinedly at his book.\n\"That's it, then? You're just going to ignore me?\" \nPotter's words were sharp, squeezed through his clenched jaw, and Draco moved a finger to mark a random place on the page before lifting his head again. \"You know the price, I know you have a prescription. I wasn't aware any further exchange was needed.\" He worked to keep the proper amount of distance in his tone, and knew he'd succeeded when Potter's jaw twitched.\n\"Damnit, Draco. What the hell did I do?\"\nDraco said nothing, merely blinked slowly in feigned surprise at the outburst. \"Was there something else you needed?\"\n\"You are an arse.\"\nDraco's own jaw went tight, and he turned his gaze back to the book. \"I thought not. Good day.\"\nPotter made a noise somewhat like a growl, but Draco kept his eyes on the book until the sounds of retreating footsteps ended with the slam of his shop door. Then he closed his eyes and sighed, dropping his head to the counter. \nHe didn't want Potter coming to his shop. He wanted Potter to go to Slug and Jiggers or use a fucking Owl Order or something that didn't leave Draco feeling raw and broken all over again. \nMaybe this time it would work; Potter would get pregnant and Draco could wash his hands of the entire thing.\nHe sighed, sitting up and rubbing his face. When he saw the vial still sitting on his counter, his stomach twisted briefly. He reached out, tracing the side with a finger, feeling the smooth slope of the glass. Driving Potter off was the right choice; Draco couldn't watch him come into his shop every month, not anymore. \nDraco grabbed the vial, putting it back on the shelf in a decisive move. This was for the best.\n ~0~\nDraco was too surprised to maintain his distant expression when his door opened ten minutes later and Potter stomped in, carrying two cups and a white pastry bag. Instead, he stared, mouth gaping.\n\"Now, you're going to shut up, drink your tea and eat your fucking currant bun, and then you're going to tell me what the fuck is going on.\"\nHe blinked at the weight of Potter's determined stare, glancing at the bag and cup Potter set on the counter. \"You really—\"\n\"No. Shut up. Eat. Your mood is shit, and so I'm going to try and improve it as much as possible before I listen to anything coming out of your mouth.\"\nDraco frowned, but the smell of bergamot was tempting. He could always drink the tea and then make Potter leave. He reached for a cup, painfully aware of Potter's lingering stare. \"I can't do this if you're just... watching me.\"\nPotter rolled his eyes, before ripping the bag open to reveal a bun and several biscuits. \"Fine. I'm eating my biscuit. Happy?\" Potter pulled one out and took a large bite.\nDraco sighed. \"What are you doing?\"\n\"Attempting to regulate your blood sugar until you have a setting other than arsehole.\"\n\"What?\"\nPotter sighed. \"Look. I know you can be an arse. But I thought we'd agreed to put Hogwarts behind us. And then you blow up out of fucking nowhere and still have your knickers in a bunch a week later. You ignored my owls, I tried to apologize, but I still don't know what I did, but a week is apparently not enough time for you to get over it.\"\nDraco took a sip of tea, before lowering the cup once again. \"I really don't want to have this discussion with you, Potter.\"\n\"I know. But I'm stubborn, and I don't give up on friendships.\"\nDraco grimaced, grabbing the currant bun and taking a bite. When he was sure he wasn't going to say something he'd regret, he swallowed. \"Merlin save me from Gryffindors.\"\n\"Nope.\" Potter grinned at that, slurping his own tea. \"We're a stubborn bunch, you don't get rid of us that easy.\" He leaned forward, resting his elbows on the counter and munching on another biscuit. \"But seriously, what happened? I don't even know what we were fighting about before you just... exploded at me.\"\nDraco sighed. \"Potter—\"\n\"No. Friends, Draco. I'm not going to let this go because I don't want to step on another landmine and have you blow up again. What got you so upset?\"\nDraco took another bite of his bun, cursing when Potter seemed happy to wait him out. He was torn between the possible lies; there was no way he could stand Potter knowing the truth. But while part of him wanted to make up something, pass it along as a fluke or something separate from Potter, to keep the tentative threads of friendship, the larger part of him, the part that screamed for him to save himself, wanted nothing more than for Potter to be gone.\nIt was much easier to get over Potter when he wasn't having to see the way his nose crinkled when he laughed, or feel the rumble of his voice stir the butterflies that filled his belly when they spoke. \nBut part of him knew he'd never really get over Potter, and making Potter leave was the only choice for his sanity. So he sneered. \"Nothing. I just have better things to do than deal with your constant whining and inability to do anything but complain about your situation.\"\n\"Yeah, okay, still an arsehole. Keep eating.\" Potter stuck a finger in his mouth, sucking off the chocolate, and then took another sip of tea.\n\"Eating is not going to me suddenly decide I want to spend time with you.\"\n\"Why not? You wanted to spend time with me fine before you offered to take the fertility potion. What I don't understand is why me pointing out we've barely gotten to know each other got your knickers in so much of a bunch.\"\nDraco frowned. \"I think you should leave.\"\n\"Because it's a valid argument. This sort of thing would really fuck with your life. All the Healer's appointments, the loss of income, and I don't even know anything about your living situation. Would you lose your flat? Would you need to stay with me? I'm not going to say yes to something that's obviously not something you've thought through.\"\nDraco could feel his shoulders tightening with every word. He knew all of that was true, but the instinct to argue was almost overwhelming. He didn't even know if silence or argument was the better option anymore.\n\"So I talked to Hermione.\" Draco's head shot up at that, and he could feel the blood leaving his face. \"And she told me some stuff. Mostly stuff I knew already, but hadn't really been thinking about like that.\"\nDraco could only stare helplessly. He didn't want Granger knowing about this; it was just the sort of thing he thought she might see through. And it was bad enough Pansy and Blaise knew about his stupid crush on Potter.\n\"Are you getting pressured for kids from your parents, then? That's why you offered?\"\nDraco blinked. \"What?\"\n\"Why you offered. Kids are important in Pureblood families. So, two birds, one stone.\"\nDraco blinked again, uncertain how Granger could possibly have gotten it so wrong. But he was going to take the opportunity he was given.\n\"Er, Mother is very interested in grandchildren?\" Draco hated that the statement came out a question, but Potter's face broke into a relieved grin.\n\"Hermione was always smarter than me. So. I'm not opposed; I just think we should get to know each other better first. Figure out how we'll handle everything.\" And he started ticking off his fingers. \"Your job, my job, which Healer we'll use, living arrangements, any shared custody, inheritance, timing...\"\nDraco held up a hand. \"Wait. Wait. What...?\"\n\"If we're going to do this. We need to get to know each other better first. That's the first thing.\"\n\"If we're going to do this?\"\n\"So I figure, dinner tonight? We can start sorting this out.\"\n\"Sorting this out?\"\nPotter nodded. \"Yeah, I'll meet you here before you close up.\" And then Potter grinned, and Draco's heart thumped. He knew he needed to say no, but when faced with the sheer joy on Potter's face, he found himself nodding along.\nPansy was going to kill him.\n ~0~\nPotter was just as cheery when he came back to Draco's shop shortly after he'd closed the shutters, as he'd been when he left. Draco spared a moment to resent him for that, as he'd been a wreck all day. \"What do you like? Indian? Chinese? Fish and chips and mushy peas?\"\n\"I'm not picky.\"\n\"You save your picky for chocolate, got it.\" Potter grinned at him, and Draco felt his stomach lurch. \"How about... I know a good Italian. Complete hole in the wall, but I could murder an order of their garlic bread. Completely dripping in butter.\"\nDraco's stomach rumbled and Potter laughed. \"Perfect. I'll Side-Along you. There's an Apparition Point just up the street from where we're headed. You'll need to lose the robe, though. It's Muggle.\"\nDraco shrugged, unbuttoning his robes and revealing the white buttondown and black trousers underneath. \"From what you say, I assume there's no worry about being underdressed.\"\n\"That's fine. I don't think I've seen you out of robes since Hogwarts...\" Draco glanced over to where Potter was staring at him, an odd expression on his face. \"Sorry, just seems the oddest thing about this. Ten years ago, I'd be asking Hermione to check me for hexes.\"\nDraco flushed slightly. \"Me wearing trousers is that strange?\"\n\"I think it's the trousers and the dinner, but... You know how when you don't know people that well, you think of them as... like they're this unchanging thing. And seeing you every day in Hogwarts, then not really since, you being in robes and doing Potions is familiar. Probably if we'd met at a Quidditch match as well. But stuff like the tea, or wearing trousers, or things like that.\n\"It's like if I suddenly found out you wore flapping snitch pants or put curlers in your hair like Lockhart used to. I can just feel how off my impressions are, and it really hits me. You know?\"\nDraco stared at Potter a moment before taking a breath and releasing the tight grip he had on his robes. \"It really hits you that I'm someone different from what you expected based on Hogwarts. That I'm a human being, with everything that comes with it.\" He smoothed the creases his grip had left in the fabric, before folding it and shrinking it with a wave of his wand.\n\"Yes.\" Potter's candid response was a surprise, and Draco blinked at the earnestness of his gaze. \"But I'm working on doing better.\" Then he smiled, that smile that made Draco's heart pound even harder, and held out his arm. \"Come on. Lasagne and garlic bread are waiting.\"\n ~0~\nThe restaurant was exactly as Potter had indicated: dimly lit, and looking like every stereotype of an Italian restaurant. Tables were small and crowded close together, covered in a red-checkered tablecloth and with a green bottle covered with drippy wax acting as a candleholder.\nBut the smell of garlic and tomato, as well as Potter's happy inhalation, convinced Draco to keep his mouth shut as they were led to a table.\n\"Everything is good.\" Potter began as he opened a menu. \"Well, all the entrees. Their desserts aren't much to speak of, and their salad is just iceberg. But other than that...\"\nDraco smiled faintly, scanning the menu quickly. \"I'm beginning to sense a theme to your taste in food. Tasty with a side of painfully obvious decor.\"\nPotter lowered his menu and gave a skeptical glance. \"You were the one who took me to Cassandra's, if you remember.\"\n\"You liked it. And you've been more than I have in the past week.\"\n\"Really? I've been once in a week and you're using that as a comparison? It's Tuesday.\"\n\"Care and feeding of Potter: find the most twee cafes in London.\"\n\"Only if they've good food, you berk.\" Potter was grinning when he flipped his menu back up, and Draco smiled in response.\n\"What would you like?\" Draco startled, wondering how the waitress was able to approach unnoticed, or if he'd just been entirely too wrapped up in Potter. Again.\n\"The lasagne for me. And an extra order of the garlic bread. And the house red to share.\"\nDraco's eyebrow twitched as the server turned expectantly to him. \"Er, the bolognaise.\"\n\"And an order of garlic bread.\" Potter broke in when she turned to leave.\n\"Potter—\"\n\"Trust me.\" He turned and smiled brightly at the server. \"Please.\"\n\"That's what, two orders? Three?\"\n\"Trust me, Draco.\" Potter turned his grin on Draco.\nDraco sighed. \"I've never drunk a house red before in my life.\"\n\"That's because you're a huge snob.\" Potter's smile at that turned fond, so Draco only rolled his eyes in response.\n\"Being picky about wine is hardly a bad thing.\"\n\"Not just wine. Sweets, too.\"\n\"Is this turning into another chocolate discussion?\"\nPotter grinned. \"I don't know. Is it?\"\nDraco laughed in spite of himself, feeling some of the lingering tension release in his shoulders and belly. \"What is it with your obsession with my eating of chocolate? More for other people.\"\n\"Yeah, but I'm one of those people who wants to share my joy. I can't relax and enjoy my chocolate if someone else can't have some too.\"\nDraco blinked. \"That makes no sense. Why does your enjoyment hinge on someone else enjoying the exact same thing? You're not going to like your lasagne because I'm eating bolognaise?\"\nPotter laughed. \"Nah. I just wanted to see if you'd fall for it. I just like giving you shit.\"\n\"Why would I fall for it?\" Draco shook his head. \"You make up a bullshit excuse and expect me to, what? Not think?\"\n\"Yeah, a bit.\" Potter's face had gone red with the effort of controlling his mirth, and his eyes sparkled in the dim light. \"You used to. We both did.\"\n\"In Hogwarts. And I thought we'd established we'd outgrown that.\"\n\"Can't blame me for trying.\" Potter shrugged and grinned. \nDraco sighed, but refrained from commenting when their server brought them their wine and a large basket of bread.\nPotter reached for a slice immediately, and Draco noted he'd not been joking when he said it was dripping butter. The smell of garlic and yeast caused his stomach to rumble, and he found himself reaching forward as well.\n\"Merlin, this is good.\" Potter groaned. \"Some days I think about ordering the bread and the wine and just having that for dinner.\"\nDraco took a bite as well, closing his eyes at the first taste. The bread was dense and yeasty, and the sharp bite of garlic cut through the heavy feel of the butter. He chewed slowly, savoring it. \"I hate to say that you're right, Potter, but... you're right, this is amazing.\"\n\"That must have hurt.\"\nDraco chuckled. \"You've no idea.\" He opened his eyes to take another bite, and noticed Potter looking at him oddly. \"What?\"\nPotter shook his head. \"Nothing.\" He took another bite of his bread, and Draco didn't focus on the sheen of butter that clung to his lips, didn't notice the way Potter sucked his fingers after finishing the slice, didn't notice the quiet sighs after each bite.\n ~0~\nDraco returned to his flat, carrying a heavy tin carton of pasta and bread and still feeling full, to find Blaise lounging in Draco's favorite chair. \"Bolognaise if you want some. No Pansy tonight?\"\nBlaise turned a lazy expression on him. \"Edmund. And cheers. Bring me a fork?\"\nDraco snorted, but waved his wand, summoning a fork from the drawer and bringing both to Blaise.\nBlaise sat up, snatching the carton and opening it with a deep sigh. \"Oh, this smells good. Sure you don't want some?\"\n\"Stuffed. That's a half portion.\"\nBlaise shook his head, smiling fondly. \"Muggles.\"\n\"Mm.\" Draco agreed absently, pulling his robes from his pocket and unshrinking them.\n\"And would you mind telling me why you had dinner with Potter tonight after everything?\"\nDraco froze, before turning slowly to look at Blaise. Blaise was twirling the pasta onto his fork, attention focused entirely on that. As the silence stretched, Blaise took a bite, slurping up the lingering strings. After a few quick chews, he glanced up at Draco. \"Hm?\"\n\"I... I don't know why.\" Draco sighed and flopped onto the couch, burying his head in his hands. \"I don't know. He came into the shop and brought me tea and currant buns and told me we were going to be friends and going to go to dinner and I just...\"\nBlaise sighed, and Draco listened to the sound of him taking another bite of pasta. After a moment, he spoke again. \"Well. Do you want Potter?\"\nDraco looked up to find Blaise watching him solemnly. \"What do you mean?\"\n\"Well, we both know you are fucking stupid in love with him. But, ignoring what Pansy will say, do you want him? Family holidays, dinners with the Weasleys, Ministry fundraisers, house and two Crups want him.\"\nDraco laughed, feeling tears welling in his eyes. \"Yes. I offered—\" He shut his mouth with a snap, clenching his jaw so tightly it ached.\n\"You offered...?\"\n\"Oh, Merlin, don't tell Pansy.\"\nBlaise's eyebrows shot up to his hairline. \"Draco. What did you do?\"\n\"I offered to carry for him. Since he can't.\"\nDraco had never seen such a look of shock on Blaise's face before. His jaw dropped, and his eyes widened comically. \"Fuck, Draco. You... Fuck.\" He set the carton on the arm of the chair and rubbed his face with both hands. \"Pansy will murder you if she finds out. Don't laugh, you'd deserve it.\"\nDraco took a breath, stifling the hysterical laughter that had erupted at Blaise's reaction.\n\"Fuck. All right. Fuck. You offered? Like you actually told Potter that you'd carry his child? You didn't just... I don't know, think about it?\"\n\"I actually told Potter that I'd carry his child.\"\n\"Fuck. The potion you had... And the blow-up?\"\n\"He said no.\"\n\"Of course he did. You idiot.\" Blaise picked up the carton and dug out another bite. \n\"Thanks ever so.\"\n\"You were. And you probably know you were, it's why Potter was able to drag you to this Muggle place.\" He waved his fork at the takeaway. \"But that's good. Because now he's thinking about it, thinking about you, and now is on the chase.\"\nDraco shifted uncomfortably. \"He wants to be friends still.\"\n\"Oh? Did he say he wanted to think about the baby thing with you?\" Draco could feel the blood rushing to his cheeks, but Blaise nodded, saving him from having to answer. \"So. Wants to do it, just needing to get through whatever Gryffindor bullshit beforehand. This is in the bag.\"\n\"What do you mean?\"\nThe look Blaise shot him screamed you idiot as loudly as a Sonorus. \"He's a Gryffindor and a Seeker. You're a challenge. A chase. It's only a matter of time before he realizes he actually wants you.\"\n\"I was a Seeker, too.\" Draco countered peevishly.\n\"Ah, but you're a Slytherin. You understand that the points are the important thing. Gryffindors only see the Snitch. And you, Draco, are the shiniest ball of gold in his world right now.\"\n\"It can't be that easy.\"\nBlaise just grinned.\n ~0~\nDraco wasn't entirely certain about Blaise's Quidditch analogy, but the next weeks definitely made him understand the concept of the chase. He'd not been surprised by Potter so often since sixth year.\nPotter had taken to showing up at Draco's shop at random intervals, usually at least three times a week. Sometimes he brought sweets from Cassandra's shop. Sometimes he dragged Draco out for dinner. Potter seemed to have an encyclopedic knowledge of out of the way Muggle shops that looked tiny and dingy but tasted divine.\nThe day Potter brought him a small box of raspberry and lemon petits fours from his mother's favorite patisserie in Paris, he'd had to close his eyes on Potter's eager expression to stop himself from either bursting into tears or reaching across the counter to snog him senseless.\nIt felt very much like being courted, but Draco didn't trust himself enough to think that. No matter what Blaise said.\nAnd Blaise said. Repeatedly. With many knowing looks. Fortunately, he also helped divert Pansy, so Draco was unwilling to comment on the look of perpetual smugness. He simply waited for the other shoe to drop.\n ~0~\nIt was several weeks later that Potter turned their conversations back to children. Draco had avoided it, too uncomfortable to initiate any serious discussions with Potter. But Potter seemed to feel it was time, so charged forward like the Gryffindor he was. \"Have you thought about your job at all?\"\nDraco lowered the garlic bread he'd been about to bite into back to the plate, and wiped his fingers on the napkin before answering. \"I think about my job frequently. Usually during business hours.\"\nPotter raised an eyebrow. \"I spoke to my healer. It's not recommended for anyone to work with potions during pregnancy. The restrictions—\"\n\"I'm aware of the restrictions.\" Draco grimaced, knowing he sounded peevish, but he'd been completely unprepared for Potter to bring this up again. Which made no sense, but he couldn't deny the shaky uncertainty he felt. \n\"So have you thought...?\"\nWhen Potter's words trailed off, Draco frowned at his bread plate. \"Have you thought about talking to your friends?\"\n\"What about my friends?\" Draco glanced up; Potter seemed completely flummoxed by the change of subject.\n\"When do I expect to have them randomly show up to threaten me once they learn your plan to get me up the duff?\"\n\"What are you even talking about?\"\n\"I'm honestly surprised that neither Weasley nor Granger have showed up at my shop accusing me of some dastardly plot. Aurors just happening to drop by looking for illegal potions or ingredients. Sudden owls from my landlord raising my rents again.\"\n\"What? Why?\"\n\"Why what?\"\n\"You can't just swap the order of the questions I asked and ask it back.\" Potter laughed, shaking his head. \"Why do you think you're going to get Aurors? Or Ron and Hermione?\"\n\"Because this is us.\" Draco gestured between them, but when Potter merely stared at him expectantly, he huffed a sigh. \"You expect me to believe your friends are okay with you getting me up the duff?\"\nPotter shifted in his seat, pink rising in his cheeks. \"I don't think they're spending a lot of time thinking about the particulars.\"\nDraco shook his head. \"I was offering to carry for you. No strings. I thought... I thought we'd.... I mean, we'd be friends and I'd hoped you wouldn't cut me off entirely when the child was born, but you came back talking about inheritance and my job and custody, and I don't...\" Draco shut his mouth with a snap, trying to calm his breathing. He clenched his hands tightly in his lap, grateful the table hid at least part of his tension.\nThe silence this time stretched long enough that Draco thought Potter wouldn't answer. He went back to picking at his garlic bread, all appetite gone, and then he startled when Potter finally spoke.\n\"They thought I was crazy at first, yeah.\" Potter's voice was hoarse, and he cleared his throat when Draco looked back up at him. \"But they thought the baby thing was a bit mad to begin with, yeah? Hermione sat me down, gave me books, everything. She wasn't too bad, really.\" Potter gulped his water, words trailing off again as the server arrived with their pasta. \nAfter a moment where both of them poked uncomfortably at their entrees, Potter continued. \"Charlie helped. With you, I mean.\"\n\"Charlie? You mean the one...?\" Draco trailed off, gesturing vaguely.\nPotter chuckled quietly. \"Yeah. Ron's older brother. He's... he's got a way of being determined, he just... He doesn't take a stand often, but when he does he just... gets his way. Dragon Tamer, you know.\" Potter continued, as if that explained anything.\n\"But he took a stand on you. Neville too, oddly enough. Pointed out that Hogwarts was years in the past, that you'd nothing to gain and pretty much everything to lose with this. Ron's still grumbling, but he doesn't really mean it.\"\n\"That's why you came back, then? You said Granger--\"\n\"Hermione,\" Potter broke in. \"She and Ron are getting married in a few months, which will just add to the number of Weasleys, so you might as well get used to calling her Hermione. But, yeah. Mostly she had problems with the baby thing in general. Thought I was too young, or should just wait, maybe for Luna or someone. You were never really an issue, really. \n\"When I told her.... Well, she just rolled her eyes and commented that it made sense. The Pureblood thing, I mean. Kids.\"\nPotter shoved a large bite of fettuccine in his mouth and stared intently at his plate. \"That's... what I wanted to talk to you about, actually. About your shop, I mean. Kids.\"\nDraco frowned. \"Kids.\"\n\"Yeah, like... Like maybe more than one.\" And when Draco's jaw fell in time with his stomach, Potter rushed on. \"We don't have to decide right away. I mean, it just... It's convenient, yeah? Can have a Malfoy, a Potter, and even a Black. So one kid doesn't have to have all that on them, I mean. But... But that means your job, and if we're doing more than one, we really should try to be... closer, I guess. Not a relationship, necessarily, but friends, close friends. Live together and....\" Potter clutched his fork. \"Merlin, please say something so I can shut up.\"\n\"I... I need to...\"\n\"Think! Yes, good. I understand! Completely.\" Potter's face was flushed, but his smile was wide and relieved, and Draco wanted nothing more in that moment than to flee. Instead, he pulled the tattered shards of his control around himself and took a breath, then another. He would finish his wine, then attempt to eat some dinner. He would behave normally until he could make it back to his flat.\nAnd then he'd punch Blaise in his lying face. Because Potter didn't want Draco, he just wanted more kids.\n ~0~\nBlaise laughed, because of course he did. It took days for Draco to tell him about the conversation with Potter. Days spent dodging Pansy's increasingly frantic attempts to hover at him, knowing in that way she always did that Draco had a secret.\nBut Draco couldn't tell Pansy. Pansy would hex him and then hex Potter for good measure. That would lead to explanations Draco knew he couldn't face.\nIt wasn't until she'd dumped Edmund and moved on to Marcel, darling and whatever they got up to that set her off on a corsetry kick, that he had an evening alone with Blaise in the flat.\nAnd so Blaise laughed. \"He wants kids? Multiple?\"\n\"Kids. He doesn't want me, he wants a brood mare.\"\nBlaise shook his head, smirking like a Kneazle in cream. \"He wants to have sex with you. Multiple times. Over the course of years.\"\nDraco just shook his head. He'd tried explaining Potter's hollow expression in Draco's shop. The one in the beginning that must have planted the seed of this plan in his mind. The hollowness, the hopelessness, the need for family. And really, what was some sex with Draco when compared to that?\n ~0~\n\"I'm not moving in with you. Not right now.\" Draco spoke as soon as Potter entered the shop, looking determined and anxious in equal measure. \"We can discuss this again later, but for now, I need my space.\"\nPotter seemed shocked, not that Draco could blame him. They'd met for dinner three times since the last discussion about children, three times where they'd argued almost comfortably about Quidditch and books and Celestina Warbeck. Draco had carefully kept the discussion to safe topics. He knew he would agree to Potter's request, knew he'd agree to anything Potter asked of him, but convincing his heart and head of the inevitable took time.\n\"We're also not going to... to start anything,\" and Draco cursed the painful blush that rose in his cheeks. \"We're not going to start anything until at least May. Greg and Millie supply me most of my ingredients, and they will need time to contact both Hogwarts and St Mungo's to alert them of their increased inventory for the next... while. Before orders are placed for the next school year, I mean. I'm not going to leave them scrambling when I suddenly stop taking orders.\"\nThe smile grew slowly on Potter's face, and his head nodded along to Draco's every word. Draco firmly told his stomach to behave, as it fluttered at the expression of rising joy, and pushed on quickly. He didn't look at Potter again.\n\"I'll also need time to dispose of my current perishable ingredients. I can contact Astoria at Hogwarts; see if her NEWT students need them for their end of year projects. She'll pay me cost. I'll need to give notice on the shop, and find a location where I can maintain a lab and storage so I'll be able to move back into Owl Orders when....\" Draco coughed as his throat closed up on his words. \nThe silence stretched a moment, silence that made him want to scream to break it. Then Potter took a shuffling step forward. \"I want to—I want to be there. I want to help. However you need.\" Draco chanced a glance at Potter, who was so earnest that he immediately dropped his gaze again. \"Healer appointments, Healer Sprigg is the most experienced in St Mungo's with male pregnancies, but if you want to use your own, just let me know.\" \nPotter reached out, grasping one of Draco's frozen hands in his warm ones. \"And inheritance, I don't know, does gender matter with the Malfoys? Firstborn male or something?\"\nDraco nodded, swallowing the lump that rose in his throat at Potter's gentle grip. \"For the Manor, it has to be held by a Malfoy. But there have been instances in the past where there was only a daughter and her husband took the name to inherit. But if there is a boy, the Manor would go to him.\" He pulled his hand away slowly. \"This will need a solicitor. Inheritance, I mean.\"\nPotter nodded again. \"Do you want to use yours?\"\n\"Merlin, no.\" He coughed, glancing skittishly away from Potter's surprise. \"The situation is... unorthodox. I'd rather not use the family solicitor, which would risk my parents finding out, until the situation is... done.\" He attempted a smile. \"They'd publish the banns and insist on a big society wedding.\"\nPotter grimaced at that, and Draco stifled his flinch with a faint smile. \"As you see, leaving the situation for as long as we're able seems the better approach. We can make an appointment with your solicitor whenever you're ready. And your healer as well. I mean, you say Healer... Sprigg was it? is the best at dealing with male pregnancy and—\" \nDraco's words trailed off as Potter pulled him into a tight hug. His breath stuttered, and he resisted the urge to simply collapse into the embrace. Potter was warm, radiating heat even through their clothing, and he smelled faintly of sage, which Draco assumed was his soap or detergent. \nIt ended too quickly. Potter grasped Draco's shoulders and pushed him back far enough to beam at him once again. \"I'll see about making the appointments. And.... Anything you need. Anything at all. Anything I can do.\"\n\"Merlin, Potter. I do know how to use an owl. I'm not pregnant yet.\"\nPotter blushed, and then nodded. \"Right. Right. You. Yeah, I'm just...\"\nDraco sighed. \"Go away, Potter. Make some appointments. And you'd better be on time to them.\"\n\"Appointments. Right. Yeah.\" Potter was grinning and nodding, and it was making Draco want nothing more than to smile back. Instead he began digging for some parchment and a quill. He would need to write to Greg and Millie, and to Astoria, and stress that they were not to say anything to Pansy. \nHe found his favorite quill as he heard the bells on the shop door, and he looked up to see his shop was empty once again. He allowed himself several moments then to close his eyes and focus on his breathing. Potter was going to be the death of him.\n ~0~\nDraco received an owl from Potter later that same day.\n\nDraco,\nI'm sorry! I completely forgot I'm going to be gone the rest of the week with Hermione doing a fundraiser thing in Cardiff. She reminded me by showing up in my flat with the Portkey and asking why I hadn't packed yet. But I've set an appointment at St Mungo's at 11 next Tuesday, and at Blythe and Smithwick 11 on Wednesday. That's a good time for you, right? If you can't, just let me know.\nI promise I'll be on time.\nHow are you?\nHarry\n\nDraco sighed, folding the letter and placing it in the drawer where he still kept Potter's previous owl. He didn't at all believe Potter wouldn't be late, but he was unsurprised that Potter had made the time to schedule the appointments immediately. Possibly with Granger breathing down his neck, Portkey in hand.\nHe shook his head, smiling in spite of himself. The image was so clear; Potter running behind, frantically Firecalling his Solicitor and Healer, Granger tapping her foot in the background. Maybe rolling her eyes. Because after over a decade of friendship, she'd have to be used to this by now.\nHe didn't want to think of what Granger would say. The minute she opened her mouth, the amusing part of the image faded in a wave of recriminations. No matter that Potter had said she wasn't a problem, he couldn't really believe the Golden Trio was at all sanguine about Malfoy becoming part of Potter's life.\nAnd he would be. There would be no avoiding it. There would be a child—children—and even if their custody arrangement was for weekends, or holidays, or every other week, Draco would be there.\nMore, when they were trying for another. And another. Merlin, Draco had tacitly agreed to three. Three wonderful, horrible nights with Potter, and more if the potions didn't work the first time.\nDraco closed his eyes at the ache that brought to his chest. \nThe potions would work. They had to.\n ~0~\nThe following week was hell. Pansy had started dropping hints about all of Marcel's handsome, eligible, and terribly gay friends. Blaise was no help; he'd abandoned Draco to Pansy's tender mercies to return to Sofia and spend the break in the season with Viktor Krum.\nDraco sent his owls to Astoria and to Greg and Millie. He'd decided less information was best, only informing each of his plans to close shop and potentially move to Owl Orders later, and a request to not tell Pansy until things were settled.\nTanner was even easier. The owl informing him of Draco's intention to end his lease in June was answered with a terse Fine, likely the shortest correspondence he'd received from his soon-to-be former landlord.\nThen there was the wait. He realized how much he'd become accustomed to Potter's frequent visits the third day. He was unsurprised, really. Weeks of frequent conversation, even conversation carefully steered away from anything personal, had become Draco's normal. \nThe emptiness of his evenings wouldn't be so stark if he wasn't trying to avoid Pansy. Without alerting her that Draco was avoiding her for anything more than the obvious attempts at matchmaking.\nLuckily, it provided an easy excuse. Pansy didn't do it often; usually only when she was in the throes of an especially exciting new passion was she determined to couple everyone else up. And Draco's aversion to her meddling in his love life was long established. \nSo he was safe. But he needed to avoid the flat, and there was something bittersweet about being in his shop. It left Draco filled with a melancholy, as his future stretched before him, so close to everything he'd most wanted. To have Potter—Harry—and a family. But not together, not really. \nHe spent most of his time checking his brews and beginning to sort what ingredients and supplies he'd keep and what he'd send to Hogwarts. He didn't feel ready to really start packing, though he knew it was inevitable. And soon.\n ~0~\nSt Mungo's was familiar enough to Draco that he found himself traveling to the third floor almost without thought. Of course, he was used to turning left at the lift, visiting the Labs and Apothecary of Potion and Plant Poisoning to drop off orders or pick up units of the more restricted ingredients.\nIt felt decidedly odd to make the right, wandering the pale green hall further into the Ward until he came to the black door marked \"Augustus Emory Ward\" in neat white letters. Draco took a breath and pushed open the door, smiling faintly at the Welcome Witch sitting at the desk. \"Healer Sprigg's office, please. I've an appointment.\"\n\"Healer Sprigg is attending a birth. She should be back in another half hour, or you can reschedule if you like.\"\n\"No, I can wait.\"\nThe Welcome Witch smiled, teeth bright against her dusky skin. \"Excellent. Third door on the left. Make yourself comfortable, and if you need anything, give a shout.\"\n\"Thank you.\" Draco made his way to the indicated door, pushing it open and stepping inside. The room was small; an empty desk with two comfortable chairs on one side and an overlarge Muggle-style rolling chair on the other. The walls were filled with seascapes, matching the window currently displaying a blustery beach with seagrass blowing in the wind. Another door stood closed opposite the first, leading further into the office.\nHe sighed as he settled into one of the chairs. Healer Sprigg being late wouldn't be a problem; it gave Potter time to arrive before she did. Draco spared a moment to wish he'd brought his book, as thirty minutes in an empty room with his thoughts was the least appealing thing he could think of.\nHe'd lost track of time when the door opened behind him, and he startled as Potter rushed in. \"Sorry! Sorry!\"\nDraco turned, taking in Potter's rushed and flustered appearance. \"Healer Sprigg is late.\"\nPotter drooped, grasping the doorframe with one hand. \"Oh, thank Merlin. I could not get bloody Penworthy to shut up.\" At Draco's blank look, Potter flushed, moving into the room and letting the door close behind him. \"The Wizengamot Liason to the Educational Reform Committee. Also known as most of the reason I can never get anywhere on time. At least that's the excuse I'm using.\" He collapsed onto the chair beside Draco and shot him a lazy grin.\n\"Anyway, I'm slightly better at dealing with them than Hermione is, he doesn't ever listen to her at all. Drives her mental. He only ignores me most of the time, which I guess is an improvement. But he always seems to have a stack of parchment needing attention yesterday, even though we see him most days, and I really think he was assigned for his ability to bog everything down all the time.\"\nDraco offered a tentative half-smile of his own. \"You weren't too late this time. And you beat the Healer, that has to count as practically on time for once.\"\nPotter's grin grew. \"See, I knew there was a reason I liked you.\"\nDraco rolled his eyes. \"You like me because I said yes.\"\n\"Draco—\" \nPotter was interrupted when the door opened once again, and Healer Sprigg bustled in. She was tiny; Draco hadn't seen an adult so small since he left Hogwarts, and ancient, with deep lines in her face and her hair bleached fully white. But her grip, when she reached for Draco's hand, was firm. She gave it a firm shake. \"Good morning, I'm Regina Sprigg. You must be Draco; Harry's told me quite a bit about you.\"\nDraco blinked. \"Yes, I am. Thank you.\"\nHealer Sprigg nodded, circling the desk and climbing into the chair; it's large size explained. She pulled out a piece of parchment and a quill and looked to Draco. \"Harry informs me that you're a Potions Master. That makes a great many things easier and more complicated.\"\n\"I'm currently in the process of brewing all the potions I will need for the duration, both antenatal and postnatal.\"\n\"Are you using a Hibiscus base for the antenatal potions? And have you begun the nutrient potions?\"\n\"I am, yes.\"\n\"And you are aware you will need to wait approximately six weeks after completing the brew before you can start taking fertility potions?\"\n\"Yes. We've already discussed,\" Draco glanced briefly at Potter, who was watching him carefully. \"We're not looking to make an attempt until at least May. That gives me time to do the full course of nutrient potions as well.\"\nHealer Sprigg smiled. \"Excellent. Now, I can check you over this afternoon, or if you've had a physical examination in the past six months, I can get the information from your personal Healer. Otherwise, I will need to see you again in.... Let's say a month, so we can determine the best day to start.\"\nDraco flushed. \"Oh, no. I mean, it's been more than six months.\"\nSprigg nodded, hopping down off her chair. \"If you'll step through this door then, please?\"\nDraco glanced at Potter. \"Thank you. Sorry to drag you out of your meetings.\"\nPotter grinned. \"Rescued me from them, you mean. I'll wait. Take you to lunch after, my treat.\"\nDraco nodded slowly, unable to prevent his own smile from growing. \"That sounds fair.\"\nPotter grinned. \"Excellent.\"\n ~0~\nHealer Sprigg was thorough but quick. Her wand waved with an obvious ease of experience that was a relief. And she didn't seem inclined to chitchat, which Draco was also all for.\nAnd in less than five minutes, after a gentle chiding to increase his iron intake, preferably with leafy greens, Draco was once again dressed and ready to meet Potter.\nTaking a steadying breath, he pushed through the door of Sprigg's inner office to find Potter pacing just outside. \"Everything all right?\"\nPotter startled then gave a pained grin. \"Shouldn't I be asking you that?\"\n\"Everything's fine. I'll just need to come back, like she said. Closer to,\" he trailed off at the feeling of blood rushing to his cheeks and gestured vaguely. \"Well. You know.\"\nPotter simply stared at him a moment before finally nodding. \"Yeah. So. Lunch?\" Potter turned and opened the door of Sprigg's office with a flourish, gesturing for Draco to precede him. \"What do you fancy? We're unfortunately in the middle of the lunch rush, but I know of a place just outside the Leaky, Muggle side, I mean, that does good sandwiches.\"\nDraco nodded, beginning to unbutton his robes again. \"That's fine, let me just get this...\"\n\"Everything all right?\" The Welcome Witch eyed the two of them expectantly as they approached her desk.\n\"All right, Penelope.\" Potter smiled. \"We'll need another appointment, but not for another month. Do we make it now, or can we wait?\"\nThe Welcome Witch opened a large book and tapped it with her wand. After a moment, she nodded. \"Healer Sprigg's schedule is flexible enough you can wait, I think. May and June are big baby months, though. Schedules have a way of getting shuffled around then.\"\nDraco finished unbuttoning his robes and slid them off. \"We don't need to wait. Or... I don't. Anything after the second week in May, I'll be able anytime, and likely before then will be mostly packing up. So....\"\nSomething, some emotion, briefly filled Potter's face before it fled and he nodded. \"I'll need to wait, I'm afraid. My calendar is in upheaval, and I usually need at least two weeks to know for certain when I can get out.\" He grimaced. \"I'm not really that busy terribly often. I just never know in advance if it's going to be a busy day or week or completely dead for a month.\"\n\"That's fine. As I said, I'll be open.\" Turning back to the Welcome Witch, he smiled. \"We'll contact you in a few weeks. Thank you.\"\nShe nodded, closing the book. \"Cheer up, Harry. Soon there'll be kids, and you'll find yourself terribly busy all the time.\" She winked at them both. \"I'll see you then. You can Floo or Owl your appointment requests to Healer Regina Sprigg, or you can Firecall through St Mungo's directory. \"\n\"Thank you.\" Draco turned to leave; only realizing after reaching the door that Potter was still standing at the desk. \"Potter?\" and then \"Harry?\"\nPotter jerked, turning his wide-eyed gaze at Draco. \"Sorry! Sorry. I was just. I can't believe....\"\nDraco smiled faintly. \"Yes.\"\nPotter took a breath, hurrying to the door. \"But I think I promised you lunch. Come on.\"\nDraco nodded, folding his robes and shrinking them in the way that had become second nature after being exposed to Potter's addiction to Muggle restaurants. \"Floo to the Leaky?\"\n\"Excellent.\" Potter grinned at Draco, whatever worries he'd had seemingly fled. \"I suggest the Greek Special. It's my favorite.\"\n\"I'll wait and see the menu first, thank you.\" Draco countered, falling back to the familiarity of disagreement. \"Greek Special sounds like you're trying to get me to eat anchovies again.\"\nPotter rolled his eyes as they waited for the lift. \"Perfectly lovely in small doses. You're just a great picky child.\"\n\"It's called having a refined palate.\"\n\"Called having a refined palate, please. You're just afraid of a few little fishies.\"\nDraco frowned, stepping into the lift. \"I am not afraid of anchovies. Or fish in general.\"\nPotter followed, tight on his heels. \"It's okay. You can be afraid.\"\n\"I'm not. Why are we even arguing about this?\"\n\"Because you're too scared to admit—\"\n\"Do you really think I'm going to eat anchovies because you, what? Dare me? Call me a coward? Are you seriously that stuck in Hogwarts?\"\nPotter pouted. \"Well, I tried.\"\n\"Merlin. No anchovies, no chocolate. Why is that such a problem?\"\n\"I don't know. Just seeing if I could get you riled.\"\nDraco frowned as the doors opened and they entered the crowded waiting area. \"Just seeing if you could get me riled?\" He began elbowing his way to the Floo Banks. \"You are the enormous child.\"\n\"Hey!\" Draco ignored Potter's shout from behind him, tossing Powder into the Floo and calling out \"The Leaky Cauldron!\"\n ~0~\nPotter found Draco just outside the Leakey several moments later, leaning against the wall to avoid the passing Muggles. \"Had to get your knickers in a bunch....\"\n\"Oh, shush. I can always go back to my shop.\"\n\"Where you'll eat nothing but currant buns and Earl Grey?\"\n\"I eat more than currant buns and Earl Grey.\" But no matter his protest, he fell in with Potter on the crowded sidewalk. \"I eat more currant buns and Earl Grey when you always seem to bring them to my shop.\"\n\"Oh, really? What do you usually have for lunch?\"\n\"Sometimes I bring lunch from home. Cassandra also does some quiches.\"\n\"So you aren't the type to get distracted and work through lunch?\" Potter shot him a glance. \"Riiight.\"\n\"Oh, and you're not either, Mr I-know-every-takeaway-in-London?\"\nPotter laughed. \"I guess I'm not helping my case by taking you to a sandwich shop?\"\nDraco rolled his eyes. \"Not in the slightest.\"\nPotter grinned. \"Alas.\"\nDraco snorted, and they walked several more minutes in comfortable silence until Potter nudged him toward a blue door. \"In here.\"\nThe shop was full, but not entirely crowded, and was just a counter. \"No seats, unfortunately, but the sandwiches are good. We can go somewhere else to eat.\"\nDraco nodded, staring at the list behind the counter and letting the line inch him forward. \"No anchovies on the Greek Special? I'm shocked.\"\nPotter shouldered him lightly. \"I have it under good authority that they're not for those of refined palates.\"\n\"He can be taught.\"\n\"Git.\" Draco glanced back over his shoulder, certain he was smiling like a sap to meet Potter's own fond smile, belying the insult. \"Who would have thought we'd be here ten years ago?\"\nDraco felt that thing curling in his belly, the one that felt like hope. He turned back, stepping forward in line. \"We weren't. This time ten years ago, I'm fairly certain we were in classes.\"\nPotter jostled him again. \"You know what I meant. I'm glad we tried to actually get to know each other.\"\nDraco swallowed, attempting to will away the painful blush crossing his face, grateful Potter couldn't see. He forced his shoulders back to a more relaxed position from where they'd hunched up nearly to his ears. \"Yes, well. You've made a number of realizations today. Shall we mark it on the calendar?\"\nPotter gave a weak chuckle, and Draco resisted the urge to look back over his shoulder, certain his face was still inexcusably red. \"Yeah. I guess I have.\"\n ~0~\nLunch with Potter had been nonexistent. Draco cursed himself that he'd managed to somehow kill the conversation, but after paying for Draco's sandwich, Potter had given his excuses and left, saying he'd meet Draco at his Solicitor's office the next day.\nDraco had returned to his shop, choked down a quarter of the sandwich, and spent the rest of the day brewing and thinking over the conversation with Potter. When he returned home, he was distracted enough to let Pansy fuss over him. \nThat worried her enough to Firecall his mother, which led to even more awkwardness, as he had to deal with both of their fretting. In fact, the only good thing about spending the evening with his head in the Floo was that it prevented any further attempts at Pansy's matchmaking.\nHe was in a foul mood when he went to bed, and he slept badly, meaning he woke up feeling even worse. And when it came time for him to Floo to Blythe and Smithwick, he'd already taken a potion for the headache caused by his clenched jaw and tight shoulders, not that it had worked.\nIt was all he could do to keep his expression neutral as he spun out of the Floo in the wood-paneled reception area of the office. It was seemingly identical to every other high-level solicitor's office, all wood and leather and glass, and he approached the large desk with some trepidation.\n\"I'm meeting Harry Potter, has he arrived yet?\"\nThe receptionist eyed him across the desk before her lip curled into something that was almost a sneer. \"I'm afraid confidentiality dictates that I cannot discuss anything about our clients, Mr..?\"\nDraco straightened his shoulders, letting some of his headache lend ice to his own words. \"Malfoy. We've an appointment.\"\nHer expression was skeptical, but she tapped her wand against a glass cube. \"Mr Blythe? There's a Mr Malfoy here to see Mr Potter. He says he has an appointment?\"\n\"Send him back, Chandra.\"\nDraco gave a slight smirk as her expression tightened. \"Yes, sir.\" Then she turned back to him. \"If you'll go down the hall, Conference Room B is on the right.\"\n\"Thank you.\"\nThe previously invisible door beside the desk opened automatically at her words, and he started down the hallway, steps muffled by the plush fibers of the maroon runner. He quickly found the room in question; door open and empty save for the man hunched over a stack of parchment on the table. \"Hello?\"\nThe man looked up, and Draco was startled by his resemblance to Blaise, all perfect dark skin and slanted eyes. Then he smiled and stood, holding out his hand. The bright lopsidedness of the grin caused some of the uncanniness to fade, and Draco shook his hand with a smile. \"Mr Malfoy? Good to meet you, I'm Preston Blythe. Mr Potter is running a bit late, as per usual. Would you take a seat?\"\n'Thank you.\"\n\"I've taken the liberty of drawing up an initial draft of the agreement. And I want you to know that Mr Potter has asked me to act for the benefits of any future children, and not as his solicitor in this case. I'm not going to treat this as a divorce-style custody issue.\"\nDraco laughed quietly. \"I'll bear that in mind.\"\nBlythe's smile twisted briefly. \"And you're certain you don't wish to bring your own solicitor in on this? To protect your interests?\"\n\"I promise you I won't be signing anything I haven't read and am certain I understand fully. But—\"\n\"Sorry! Am I late?\"\n\"Almost exactly on time, Mr Potter.\" Blythe's grin was amused as he looked over Draco's shoulder.\n\"Damnit, I thought I was going to make it this time.\" Draco turned to look at where Potter was standing, flushed and smiling. \n\"You're getting closer every time. You'll get there eventually.\"\nDraco snorted, and Potter turned his grin on him. \"I'll believe that when I see it.\"\n\"I'm hurt.\"\n\"You're the one who said you're terminally incapable of being anywhere on time.\" Draco intended the words to come out light, joking, but his headache flared again and he grimaced, and something in Potter's face fell.\n\"I'll make sure something about that is written into our contract.\" Potter smiled again, a bit less bright this time. \"Preston can do that, can't you?\"\n\"I can't include something I know will set you in breach before we even begin.\" Draco turned back to the table in time to catch Blythe's smirk. \"But come, sit. I was just informing Mr Malfoy that I've the initial draft of the contract drawn up, and if you both can look over it, we can get this thing going.\"\nPotter approached the table and took the chair beside Draco, shooting him an apologetic smile. \"I did try.\"\n\"Penworthy again?\"\nPotter sighed. \"No, this one was just me. I forgot to set a Tempus.\"\nDraco sighed, smiling in spite of himself. \"Do you need a Remembrall for your birthday, Potter?\"\nPotter's expression loosened, and he laughed, open and bright. \"As Neville said, they're no good for actually helping you remember what you've forgotten.\"\n\"What would you have forgotten beyond being on time for once?\"\nPotter leaned over in his chair, shouldering Draco, before turning to the pieces of parchment that Prescott had set patiently before each of them.\n\"This is the initial draft. Most of the legalese will be added later. But this gives a brief outline of custody and inheritance. Mr Malfoy, I've used other instances of Pureblood Estates to determine the inheritance portion. I'm assuming the Manor and Vaults are not entailed?\"\n\"The Manor goes to the firstborn male, and if there is none, usually the husband of the firstborn daughter takes the name. If none of that applies, it would go to the nearest male relative. The vaults, however, are at the discretion of the Head of the Family. My father, in this case. Traditionally, the primary goes along with the Manor, but there is nothing specifically requiring that, I believe.\"\n\"So it is fair to say that the name Malfoy only is important to the firstborn and the firstborn son, if they are different?\"\nDraco nodded, and Blythe made a mark on his draft of the contract, a mark that was echoed on both Draco's and Potter's as well.\n\"Have you put any thought as to what last name or last names you're planning on using, otherwise?\"\n\"We've discussed it, but we've not determined anything final, I don't think?\" Potter glanced at Draco. \"Can we just stick with the firstborn being Malfoy for now and amend later as needed?\"\nBlythe nodded, humming under his breath, before he moved on. \"Right. This next bit, each potential child granted a vault and a starting sum of 20,000 Galleons to be managed by Gringotts and held in trust until their graduation from Hogwarts, funds to be taken equally from Mr Potter and Mr Malfoy's vaults, et cetera.\"\n\"What about if they want to go to, I don't know, Beauxbatons or... or Woollongong? Or if they're a Squib and can't go to a magical school at all?\"\nDraco and Blythe both squirmed at the mention of Squibs, but Blythe regrouped quickly. \"Hogwarts or equivalent institution, which should take him or her to their majority,\" he said, making another note on his parchment. \"We will need to include an entirely new section for a Squib,\" he continued, quill continuing to move over the parchment. \"There would need to be allowances for acquiring of Muggle monies, paperwork, certificates, and the like.\n\"Now, any further adjustments to these sections?\" Blythe looked between the two of them.\n\"Make the starting vault 50 for each. The Malfoy vaults can cover the difference, even if Potter's cannot.\"\nPotter sucked in a breath beside him, though Blythe's eyelids barely flickered. \"Very well.\"\n\"You're not going to... put some sort of cap on that? 50,000 is a lot, especially with more than one kid.\"\nDraco glanced at Potter out of the corner of his eye. \"Do you want ten children, Potter?\"\n\"Er, no?\"\n\"Then it won't be a problem.\" He turned to look more carefully at Potter. \"Did you think I worked because I needed the money?\"\nPotter blushed. \"You were talking about selling your materials to Hogwarts at cost. I thought—\"\n\"I'm not giving them away. There's a reason Malfoys have money, Potter.\"\n\"You're giving it away now.\"\nDraco blinked. \"How is it giving it away when it's family?\"\nPotter's jaw worked a moment, as if he were trying for words, before Blythe interrupted. \"As we're not putting requirements on number of offspring, and names are to be determined later, potentially after the first birth, that only leaves custody and guardianship.\"\n\"I want custody to be as equitable as possible.\" Potter said, and Blythe nodded. \"I mean, I'm not saying I'd show up at your doorstep at three in the morning to look at the baby but....\"\nWhen Potter's words trailed off, Draco nudged him. \"You so would. Don't lie, Potter.\" \n\"This is where things would be easier if your solicitor was present as well, Mr Malfoy.\" Blythe smiled slightly. \"It's always easier when I've someone to fight against for this kind of thing. The basic outline I have at present is that all lasting decisions, be it medical, schooling, living location, anything that's not an emergency, will require consent of both parents.\n\"So whether the child or children go to Hogwarts or Woollongong, the choice of their pediatric healer unless they are on an emergency trip to St Mungo's, who is allowed to care for them for an afternoon or more regularly, all of it will need to be done in writing and the agreement signed by both of you.\"\n\"I believe that would be fair.\" Draco nodded.\nBlythe held up a hand. \"This would also include things that occur with friends or family, which also ties in with guardianship. For example, leaving the children alone with your father, Mr Malfoy. Or with Mr Weasley.\"\nDraco glanced at Potter, who shifted slightly in his seat. \"It only means we need to agree in writing before, yeah? Not that we can't.\"\n\"That is correct.\"\n\"Then it seems fair to me. We can hash it out when it comes time to deal with it.\"\nBlythe glanced between the two of them a moment before looking back at his parchment. \"I suggest you decide guardianship now. Not hashed out later. There is a good deal of money involved in the future trusts.\"\n\"Gringotts will continue to control the investments and vaults.\" Draco spoke up. \"An annuity vault of the interest should be made available to the children and their guardians if something happens with us before they reach majority. The main vaults will remain locked until they are 21. Any occasion where funds greater than the annuity stipend are needed will require two signatures, one from an individual representing each of us.\"\nBlythe nodded as his quill scribbled the terms. \"And those individuals?\"\n\"Hermione Granger.\" Potter stated firmly.\nDraco nodded, relieved Potter had picked someone Draco hoped would rely on logic and objectivity. \"Luna Lovegood.\"\nPotter's jaw dropped. \"Luna?\"\nDraco glanced at Potter. \"Why not Luna?\"\n\"I don't... I just... I didn't know you were close to Luna.\"\n\"I'm not, particularly. We owl. But the list of people I could offer that you wouldn't object to is small, and I trust her. She's a bit mad, but she'd do what was best.\"\nBlythe hummed quietly as he wrote. \"Then, the guardianship of the children since we've got management of the trust?\"\nDraco bit his lip, glancing at Potter. Potter shifted in his seat before jutting his chin out stubbornly. \"Andromeda Tonks.\"\nDraco blinked. \"Andromeda Tonks?\"\n\"Your aunt.\"\n\"Yes, I know who Andromeda Tonks is. But...\" Draco trailed off.\n\"She's going to be their aunt as well. She will be able to teach them all the non-shit aspects of Pureblood and Black culture and history. And it'll be an excuse to get over this stupid thing where she and your mum can't talk to each other because of shit that happened thirty years ago.\"\nDraco shifted uncomfortably. He opened his mouth, but really had no idea what to say in response.\n\"I'm not going to budge on this one.\"\n\"Have you even spoken with her about this?\"\n\"Yes.\" \n\"And she agreed?\"\n\"Yes. Well, I may have bullied her into it a bit.\"\n\"You bullied a Black into getting your way?\" Draco could feel his mouth beginning to twitch, but he worked to hold his laughter in. \"You bullied... Oh, Merlin.\" \n\"Stop laughing, you berk. Or I'll do the same to you.\"\nDraco held up his hands in a gesture of surrender, attempting to stifle the laughter. \"Right. Andromeda Tonks it is.\"\n\"I think this is all I need, then. I'll Owl Harry with a final draft for any further revisions in about a week.\" Blythe looked up, holding out his hand to Draco, then Potter. \"It was good to meet you, Mr Malfoy. Mr Potter, have a good day.\"\nDraco made his way down the hallway, rolling his shoulders as he went. He'd managed to ignore his headache for most of the meeting, but as soon as he left the conference room, it and his exhaustion came rushing back.\n\"Draco! Wait up!\"\nDraco grimaced, even as he slowed his steps to allow Potter to catch up as he crossed back into the reception area. He ignored the witch frowning at the both of them, focusing instead on the crystal dish of Floo Powder on the mantelpiece. \n\"Back to work?\"\nDraco rubbed his head, stopping at the fireplace. \"I'm sorry, Potter. But all I want right now is a headache potion and some tea. I'm not at all good for company. Can we discuss last names or living arrangements or whatever else later?\"\n\"Of course! Is there anything I can do?\"\n\"No. I... I'll owl you next week, all right?\nPotter's expression fell briefly, but he nodded. \"Right. We can get the rest of the details after Blythe gets us the papers. Would you like to come for mine for that? I don't imagine your shop is the best place....\"\nWhat Draco really wanted was to get away, but he nodded. \"Fine.\" He reached for a pinch of Floo Powder. He hated leaving Potter standing there looking like a kicked Crup, but... \"I'll see you, Potter.\"\nThe last thing he saw before he spun around in green flames was the faint twist of Potter's lips.\n ~0~\n\"I cannot believe you did that, you infuriating cow.\" Draco didn't even wait for Pansy to step out of the Floo before he began yelling. \"What in Merlin's name were you even thinking? I've fucking told you that I don't want you setting me up with any of your fucking friends.\"\nPansy ignored Draco's outburst, stepping out of the Floo and brushing the lingering traces of ash from her dress. \"Hello, Blaise. How's Quidditch?\"\n\"Delightful!\" Blaise grinned from his position sprawled on the couch, glancing amusedly between Draco and Pansy. \"Interesting evening?\"\n\"Pansy invited me to dinner. And who should I find when I get there but Marcel and Frederic.\"\nBlaise gave an exaggerated tsk and looked to Pansy. \"A set-up? Shocking!\"\n\"He spent all evening flexing at me!\"\n\"Well, darling, he doesn't speak English. And you told him you couldn't speak French. How did you expect him to communicate?\"\n\"Wait, flexing? Like...\" Blaise sat up, raising an arm and patting his bicep. \nPansy sighed. \"Not so much. He was very large in the shoulders. And one time he did that... thing with his arse.\" Pansy gave a demonstrative flutter of her hands.\n\"With his arse, Pansy! Why the hell would you try to set me up with someone who does that thing with their arse in public?\"\n\"Yes, all right, Frederic was a poor choice. I was in a hurry. And you brought some of it on yourself telling him you didn't speak French.\"\n\"Why the fuck were you in a hurry? What made you think that my repeated comments that I don't want you fucking setting me up weren't a good enough reason to not set me the fuck up.\"\n\"You're too tense. Look at you, all bunched up. And you're closing your shop! Why did I have to hear about it from Astoria, of all people?\"\nDraco rolled his eyes. \"I told her not to talk to anyone about it until I had the chance to tell you.\"\nPansy paused, on the edge of another outburst, and peered at him. After a moment she shut her mouth and sighed. \"Why hadn't you told me?\"\n\"Because the only thing you've been able to talk about is setting me up?\"\n\"Now that's petty.\" Blaise broke in, once again sprawled in place. \n\"When hasn't Draco been petty?\" Pansy retorted. \"If I'd known it was causing you to keep things from me, I would have stopped!\"\n\"You are such a horrible liar.\"\n\"I'm a brilliant liar. You've just known me too long.\"\nDraco laughed in spite of himself, ignoring Blaise's Cheshire grin. Pansy prodded him. \"Why are you closing the shop?\"\nDraco sighed. \"I hated the shop and I was just... done. After... after everything. I'm looking for a lab to move to owl orders, but I'm thinking of taking a break for a while in the meantime.\"\nPansy pulled him into an embrace. \"Oh, darling.\"\n\"So now you're up on the state of my shop. Can we agree to not set me up anymore?\"\n\"Only if you promise to get yourself laid.\"\n\"Draco's more than capable of getting himself laid,\" was Blaise's smirking contribution, and Draco resisted the urge to hex him.\n\"Yes, but he doesn't.\"\n\"He's shortly to become a man of leisure. Give him some time.\"\nPansy frowned between the both of them. \"Fine. But I don't promise anything if he doesn't loosen up.\"\n\"Merlin, Pansy, I will murder you.\"\n\"All right! Fine! See if I try to help you ever again.\"\n\"I don't need your help!\" Draco called over his shoulder as he stomped toward his room.\n\"What do you know?\" Draco could hear Pansy rounding on Blaise behind him.\n\"I've been in Sofia!\" Blaise's protest was the perfect balance of innocent and amused, and Draco closed his door behind him on the sound of Pansy's aggravated sigh.\nDraco leaned back against the door. He just hoped this would halt any further attempts at matchmaking. He made a mental note to look harder for a lab to back up his story.\n ~0~\nDraco frowned at the box that he had been filling with dried beetles when he heard a knock on the door of his shop. He'd not bothered to open, knowing that if he procrastinated his packing up, he'd end up not doing it. But the sign was turned to Closed, and beyond a few familiar faces peeking in between the shutters early that morning, there had been nothing to disturb his silent packing.\nA second knock, louder this time, brought his head up, and he crossed to the door with a sigh. And, of course, when he opened it, Potter was standing there bouncing on his heels. \"Hey! I got the paperwork back. Want to get some takeaway and come to mine?\"\nDraco glanced out at the shadows beginning to fill Margin Alley. \"I hadn't realized it was so late.\"\nPotter grinned. \"Is that a yes?\"\nDraco sighed, a smile breaking through. \"What is it tonight? Pasta again?\"\n\"I was thinking curry.\"\n\"Vindaloo and papers from your solicitor.\" Draco rolled his eyes and gestured Potter into his shop and toward the Floo. \"What could possibly go wrong with that combination?\"\n\"You just don't like anything with flavor.\" Potter shot back, leaning against the mantel. \n\"Vindaloo has as much flavor as an Incendio.\"\nPotter grinned. \"Coward. Just Potter's Flat for the Floo, I'm a simple kind of bloke.\"\n\"How do you not have people stumbling in at all hours of the day?\"\n\"I keep my Floo warded unless I'm expecting visitors.\"\n\"The teenagers prank Floo'ing you must keep you up all night every June.\"\nPotter snorted a laugh, tossing in a pinch of Floo Powder. \"You've no idea.\"\n ~0~\nThey'd opened their curries in Potter's cozy living room, side by side on the couch with the paperwork from Blythe spread on the small table before them. Draco had read through each parchment carefully, noting all of the changes that had been included.\n\"What do we do about custody?\"\nDraco glanced to where Potter was nervously forking his rice. \"What do you mean?\"\n\"Well, I know you won't want me showing up at all hours....\"\nDraco grinned slightly. \"I do need some sleep, yes.\"\n\"But I mean... I want to be there.\"\nDraco sighed. \"I know. This... is for you. I've not forgotten. I guess... I guess part of me still thinks of this as you taking the child as soon as it's born and I don't see it again.\"\n\"What? No!\" Potter's expression seemed torn between surprise and denial. \"I would never—\"\n\"I know that.\" Draco rubbed his head. \"But the fact is I'm not a Witch. There's no specific reason for the child to need to stay with me after birth. Except the fact that I'll be available, and your hours are rather... unsettled.\"\n\"Not after the baby comes. Everything is crazy now because Hermione uses me as the Bludger for a lot of these meetings. Once it's closer to time for the baby, I'll be swapping to just staying in the London office. She'll trot me out a few times a year to remind people I'm still there. But for the most part, it'll be regular hours and days.\"\n\"Well, then.\" Draco shrugged slightly. \"No reason at all that you shouldn't—\"\n\"But I want you involved as well.\"\nDraco sighed, leaning back on the couch and closing his eyes. \"I don't know, Potter. What was your arrangement with... Charlie?\"\n\"Er, didn't really have one. Formally, I mean. He was never gonna stick around, and the child would spend half their time with the Weasleys anyway. It was easy that way.\"\n\"Ah.\"\n\"But that's not the case with us. Family is important, and... I mean, with Charlie it was easy. I'm already part of his family. So if Charlie's not there too often, his family is still represented, I guess.\"\nDraco laughed in spite of himself. \"You're not going to try and convince me you want anything to do with my family, Potter.\"\n\"Well, I mean...\" Potter's words trailed off.\n\"Andromeda Tonks for the non-shite aspects of Pureblood and Black history and culture?\"\nPotter sighed. \"There is a difference between what you learn because you're raised with it and what you learn as something that exists. Children should be exposed to both, but not forced to blindly follow the party line. We're talking about your heir, too.\"\n\"I... I know. And if it matters, Father only goes off on The Great Pureblood Agenda when he's had at least half a bottle of wine first.\" \nDraco glanced at Potter out of the corner of his eye, and then began snickering at the expression on Potter's face. \"I'm joking. Mostly.\"\nPotter stuck his tongue out and then grimaced. \"How mostly?\"\n\"My mother is capable of keeping him in line. She doesn't want anyone else ending up in Azkaban on her watch.\"\n\"Your mum is terrifying.\"\nDraco smiled. \"She is.\"\n\"Will she talk to Andromeda?\"\n\"You mean if something happens to the both of us and Andromeda becomes the guardian? Or in general?\"\n\"Yeah?\" Potter grinned slightly, going back to eating.\n\"I don't know. It would depend on how welcome she felt to do so.\"\nPotter sighed, and Draco nudged him lightly. \"Cheer up, Potter. You can't always fix everything with a wave of your hand.\"\n\"I know.\"\nAfter several moments of silence, Draco nudged the parchments further across the table. \"A linked Floo connection? So whoever isn't there can come whenever they'd like?\"\n\"Could do.\"\n\"I just feel a lot of this will come clearer when the time comes. It still feels so strange, like we're discussing something that's not real.\"\nPotter's lips twitched. \"Yeah. All right. I can see that. And if nothing else, the linked Floo is a good idea. In case someone is tired or sick or just needs a moment if nothing else.\"\nDraco nodded.\n\"Have you found a new lab?\"\nDraco blinked at the change in topic. \"Sorry?\"\n\"You were packing. Earlier.\"\n\"Oh. No, not yet. But if I'm going to pack up what I'm sending to Hogwarts and St Mungo's, it makes sense to just do everything.\"\n\"How do you feel about Hogsmeade? I mean, do you want to stay on Margin Alley, specifically?\"\n\"Not specifically, no. It's comfortable there, but I don't think there is anything that would suit currently available. And I'm not going to pay Diagon rents.\" Draco shrugged. \"I've mainly been trying to decide between just finding storage and looking for a lab sometime later when everything is more settled.\"\n\"How do you mean?\"\n\"Well, I'm not going to move back into the Manor.\" Draco shuddered slightly at the memory of rooms, dark and cold and tainted after the war. \"But, what if I decide that a house is better than my flat? Do I then look for a house with lab space available?\"\n\"Ah. This is part of the custody thing, right?\"\nDraco nodded. \"But why were you asking about Hogsmeade?\" \n\"Oh! Seamus has been using an old potions lab just on the far side as a distillery. But he needs more room to keep up his supply, so he's building something back in Kenmare.\"\nDraco blinked. \"Oh. How large of a lab?\"\n\"Not very. Bit bigger than this,\" Potter gestured at the walls around them. \"Smaller than your shop. It's got a bit sectioned off for storage, but it's basically a big stone room.\"\n\"I... Could I see it?\"\nPotter smiled. \"Sure! I mean I'll need to talk to Seamus to find a time. You're free?\"\n\"I am.\"\n\"Great! Just drop by then, shall I?\"\nDraco rolled his eyes. \"You usually do.\"\n ~0~\nThe lab in Hogsmeade was almost perfect. It was still cluttered with Finnigan's supplies, but Draco could see it being just the proper size for a small Owl-order potions business. It was large enough to allow for six cauldrons a side, or to allow space for certain more volatile brews to be sectioned off. There was plenty of ventilation, though the windows high up near the ceiling didn't let in good light. The only fault he could find was the storage area was a bit smaller than he would like.\nAnd he knew himself well enough to know that was just because he tended to hoard ingredients, just in case.\nHe'd paid the deposit that same day, and a day later received an owl from Finnigan saying he'd have his things gone by the end of the week. Potter had strutted around with a proud expression on hearing that, and Draco had teased him for being so easily pleased.\nBut there were worse things Potter could be happy about than finding Draco a new space. And Potter had simply flipped two fingers at Draco and dragged him out for Chinese.\nIt was frightening how normal it all seemed. That Draco's life now revolved around Potter and takeaway.\nAnd that made setting up his appointment with Healer Sprigg surprisingly easy.\n ~0~\nDraco asked himself for the hundredth time what the hell he was doing as he waited in Sprigg's office for the healer to come in and run her tests. Potter was beside him, practically vibrating with nerves and on time for once, just when Draco most wanted him to be late. If Potter had been late, he could have the threatening mental breakdown right here in Sprigg's office, alone.\nBut he couldn't. Because Potter's smile was too bright and his eyes too wide and his knee was bouncing and he seemed ready to leap from his seat at any moment. Though, Draco couldn't tell if he was going to dance for joy or pace from nerves. Likely Potter didn't know either, which was the only thing keeping him in his seat.\nBut Potter being there meant Draco had to be the calm one. Calm after a month of potions, after packing up his shop, of falling harder by the day for Potter's eyes, his voice, his stupid arguments.\nHe was going to sleep with Potter, have sex with Potter, and his heart wasn't ready.\n\"Good afternoon! Today is the big day. Nervous?\" Sprigg bustled into the outer office with a smile and glanced between the two of them. \"Yes, I thought you might be. I'll get this done as quickly as possible then, so as to not prolong the misery.\n\"Mr Malfoy, if you would stand up please, and remove your robe?\" Draco worried a moment that his knees would give out, that he would fall when his legs began shaking, but Sprigg merely smiled patiently at him. \"We only need the robe off, but please unbutton your shirt. I'm going to do the normal run of tests. Want to check your iron as well.\"\nHe was hyperaware of Potter's attention as he removed the robe and unbuttoned his shirt. Sprigg waved her wand at him, lights trailing between the tip and his body. Potter's expression was avid, but anxious. \"Excellent. You are in perfect health, Mr Malfoy, and your iron is back in the normal range. We will need to keep an eye on it, however, should you fall pregnant. Anaemia is especially common in those who have had low iron before pregnancy. So no skipping the spinach any longer.\"\n\"Is it dangerous?\" Potter broke in. \"Anaemia, I mean.\"\nSprigg turned to look at Potter. \"Not really. Like anything else, it can reach dangerous levels, but most pregnancy-related anaemia is an inconvenience more than anything else. Extra weakness or tiredness, at a time already rife with it.\" She gave a faint shrug. \"Now, let's see when we're looking. Mr Malfoy, this will feel a bit odd.\"\nWith that warning, she pointed her wand directly below his navel, and a jet of golden light shot out. Potter's hand reached up, bracing against his back, and he was grateful as the sensation of first shocking cold then warmth hit with the force of a fist and cramped low in his gut.\n\"How does this feel, Mr Malfoy?\"\nDraco managed to inhale through clenched teeth. \"Like I'm going to be—I need the toilet.\"\n\"Hm,\" was all she said in reply, but she twirled her wand briefly. The light linking her wand to his abdomen darkened to bronze. The cramping eased at the change, and he tried another breath. He became aware of Potter's hand, rubbing slowly against his lower back, bleeding heat through his shirt, and attempted to relax. \n\"Well, then.\" Sprigg flicked her wand and the light faded, and she smiled up at Draco. \"Now would be the time. You can take the fertility potion immediately and have intercourse this afternoon or evening. You've not been taking Dreamless Sleep, have you?\"\nDraco stared at her, feeling shellshocked. He'd thought he would have more time. \"I... No, I've not been taking anything.\"\n\"Excellent. Then I wish you both the best. Your best window is in the next 48 hours, or in 30 days. We will be able to test in two weeks to see if the potion was successful. I must warn you; odds are still against wizard pregnancies, even with a pureblood bearer. Conception is never a guarantee.\"\n\"But we should have hope of success in the next few months.\" Draco's voice was weak, and his hands shook, but he could see how Sprigg's words caused dread to flare in Potter's expression.\n\"There is always hope. But yes, probability is in our favor that something will happen within the next several months.\" She smiled up at Draco, and then turned and squeezed Potter's hand. \"I will see you in two weeks. I am hopeful for good news.\"\nPotter smiled at her, eyes glassy and face pale. \"Thank you.\" And then he turned to Draco. \"Thank you.\"\nDraco nodded in reply, throat tight. There wasn't anything else to say, he was doing this for Potter.\n ~0~\nDraco returned to his empty shopfront and looked around for one last time. The only thing remaining was the green vial sitting in the usual place on the shelf. He didn't know why he'd kept it there; the lack of anything else on the shelves made it all the more noticeable. But it seemed fitting, the last thing in his shop being the thing that had brought Potter back into his life, and the thing that closed the shop as well.\nHe reached for it, pocketing it before he could change his mind. Potter was waiting for him in his flat. Draco had asked for a few minutes to collect his things, even though what he really needed to collect was his thoughts, his emotions. Everything felt messy, as if he was coming apart from himself and unraveling like a scarf.\nHe was going to take this potion. He was going to sleep with Potter. In two weeks, he'd be back in Healer Sprigg's office to see if they'd be doing it again in a month.\nThe unreality of the situation hit him full force, and he doubled over, clutching his hair. It was too late to stop; self-preservation always seemed to hit him too late. He didn't have the time to break down, he needed to go before Potter started to wonder, before he came looking for Draco and started asking questions.\nBecause Potter asking questions was the worst thing that could happen right now.\n ~0~\nPotter was anxious when Draco exited his Floo. His smile was weak, his shoulders tight, and his hands kept fisting in nervous rhythm.\nDraco offered a smile, which he knew revealed his tension as well, and Potter's shoulders relaxed. \"I was afraid you weren't gonna come.\"\nDraco blinked. \"What? Why?\"\nPotter took a step forward, reaching out and gripping Draco's arm. \"I don't know. It's not you, I just... You have no idea how much I...\"\n\"I know.\" Draco took a breath, releasing it slowly. \"I know. It's okay. Should we...?\"\nPotter nodded. \"I... Yeah...\" And then he laughed. \"We're quite the pair, aren't we? No need to be nervous, I mean. Have you already taken it?\"\nDraco reached into his pocket, pulling out the vial. Potter nodded, his expression avid as Draco broke the wax seal and uncorked it. Then he seemed to catch himself. \"I'll get you some water to rinse your mouth with.\"\nHe turned quickly, striding from the room. Draco stared at the vial a moment. Part of him was tempted to vanish the contents, for the guarantee he'd do this again next month. But only for a moment. Because this thing with Potter wasn't real, and stretching it out would only hurt more in the long run.\nHe raised the vial and then swallowed the contents in a single gulp, eyes closing and watering at the overwhelming flavor of basil and eucalyptus. \n\"Here.\" He opened his eyes to see Potter standing with a sympathetic smile, holding a glass of water out. \"I know you can't drink it for at least five minutes, but rinsing your mouth helps. The aftertaste doesn't linger, at least.\"\nDraco swallowed again, grimacing at the lingering feel on his tongue. \"Thanks. But I'd rather wait, just in case.\"\nPotter nodded, lowering the glass. \"Erm, bedroom then?\"\nDraco felt heat crawling up his neck, but nodded. \"Yeah. I think... Yeah.\"\nPotter led Draco farther into his flat, into a short hallway, and pushing open the door on the right. He gestured for Draco to enter first, and Draco stepped inside, looking around.\nIt wasn't what he'd expected. But, truthfully, Draco wouldn't have been able to say what he had expected. Only that this wasn't it. \nIt was clean, for one thing. Given Potter's inability to be anywhere on time, and general haphazard attitude in general, he'd expected... something else. Clothes on the floor, a drawer standing open, something. Potter's bed was unmade, but everything else was organized. The bed was large, with dark wood posts and pale blue sheets under a cream and brown duvet. A nightstand stood on the left side, with a paperback opened facedown upon it. A wardrobe stood opposite the bed, and the walls were filled with landscapes, all leaves and clouds moving gently in painted breezes.\nPotter cleared his throat, edging in behind Draco and walking around to his nightstand, placing the glass there before shifting nervously. \"Been a while since I topped, it feels like.\" He gave a faint laugh. \"I never asked. You're sure you're okay with...?\"\n\"Oh, Merlin.\" Draco raised hand to cover his face, though he was certain the blush would be visible anyway. \"Yes, I'm fine with bottoming. It's just... it's been a while, okay?\" He peered through his fingers, focussing on Potter's blush. \"A while for... anything really. Just, blowjobs and handjobs and... Merlin, I need to shut up.\"\nPotter laughed, coming back around the bed to Draco. \"Okay. We're both nervous and awkward, but this is gonna be all right, yeah?\"\nDraco nodded, because Potter was close and he didn't think he had any words left. Potter smiled, leaning in and brushing a brief kiss to Draco's lips. He wrinkled his nose and laughed. \"You still taste like that potion.\"\nDraco found himself laughing as well, and Potter took the opportunity to lean in again. This time the kiss was more. Deeper. Longer. Potter kissed with everything he had, and Draco could only cling and whimper in response as Potter's tongue slid hot and slick into his mouth.\nAnd fuck, it wasn't supposed to be kissing. It was supposed to be sex, and Potter's cock in Draco's arse, and that was it. But Potter's hands were everywhere, and he was kissing Draco like a starving man, and Draco cursed that Potter was once again everything he wanted and nothing he could have.\nBut Draco realized his own hands were wandering, and his cock was already half-hard. And really, it being Potter, how could it be anything else? He grasped Potter's shirt, tugging it from his trousers, and sliding his hands underneath. Potter would always be his biggest weakness, the hole in his defenses, the ache he'd never get over.\nHe concentrated on pretending that this was real. That the desperation in Potter's touch was for Draco, not for the baby he was going to carry. That the quiet moan he gave when Draco's hands slid up his chest was for him. That the gasping breath when he pulled away from the kiss, to drag Draco onto the bed meant... something. Anything.\nThat Draco's heart wasn't breaking with each breath. Because Draco was good at pretending, and because Potter's eagerness made pretending easy.\nHe ignored the ache in his chest, focusing instead on Potter's eager hands slipping into his robes and under his shirt, on Potter's mouth hot on his neck.\n\"Fuck...\" The word was a hiss, and Draco was honestly uncertain which of them had said it. Potter pulled back, breath coming in quick bursts and pupils dilated. Draco reached up, gently pulling Potter's glasses off and closing the arms, turning to place them on the nightstand. When he looked back, Potter was in the midst of pulling his shirt off entirely, and Draco watched avidly.\nPotter was lovely. True, he was thin almost to the point of scrawny, with whipcord muscle across his arms and shoulders, but he had a way of holding Draco's attention... Draco couldn't take his eyes off him. \nThe flush on Potter's face began inching down the pale skin of his chest under Draco's gaze, but he jutted his chin forward in the familiar way he had. \"You too.\"\nDraco blinked, hands reaching up to fumble with the fastenings of his robe. Potter just watched, kneeling on the bed beside him, and Draco had never been so aware of being the focus of Potter's attention. He closed his eyes, working to keep his hands from shaking, to keep working the clasps, until he felt Potter's hands against his.\nHe startled, opening his eyes as Potter pulled back. \"Sorry. Patience was never my strong point.\" Potter gave a lopsided smile, and Draco laughed weakly. \"Here. I'll help.\"\nPotter was much better at opening Draco's robes than Draco had been. He brought his face close to Draco's chest, brows furrowed and the barest hint of tongue visible between his teeth. Draco reached out, running his fingers through Potter's hair before he'd even realized what he was doing. He froze when Potter blinked up at him.\nPotter just smiled, half his lips twisting up in an expression that was almost a leer, and Draco felt the blood throb in his cock, already pressing firmly against his flies. He moved his fingers, tightening them slightly, feeling the softness of Potter's hair. Then he tugged lightly as Potter's eyelids fluttered, and his hands stilled on Draco's chest. Draco pulled him closer, this time taking control of the kiss, delving into Potter's mouth.\nPotter moaned, and Draco found himself moaning in response as he began working the clasps of Draco's robe once again. It opened quickly, and Potter began working the buttons of Draco's shirt. Draco kept his hands in Potter's hair, holding him close, kissing him like he'd never get the chance again. \nThen Potter was pushing Draco, pulling away, and Draco clung for a moment, unwilling to let go. \"Shirt off,\" Potter mumbled between kisses. Draco whimpered, beyond caring how needy it made him sound, and pulled away long enough to wrestle his arms from the knot of shirt and robe Potter had left him in.\nPotter took the opportunity to move as well, toeing off his shoes and shoving his trousers down from his legs. His pants were plain white y-fronts, and Draco rolled forward, mouthing along where Potter's cock was tenting them out.\n\"Fuck!\" Potter grabbed Draco's head briefly, before twining his fingers in Draco's hair. \"Fuck,\" again, this time like a breath. \"Draco.\"\nDraco moaned around the taste of cotton, the beginnings of bitter and salt beginning to seep from the dampening tip. He had a lot of excuses for not taking men home over the past several years, but the primary reason was just that he loved this. The weight of a cock in his mouth, the taste on his tongue, it was in so many ways better than any of the alternatives. And getting head was the same.\nPotter's hips flexed several times before he pulled Draco's head away. \"Come on. I want to fuck you.\"\nDraco blinked up at Potter, at Potter's strained expression. He sat back on his heels and watched as Potter shimmied out of his pants before sliding off the bed and tossing them at the hamper. He looked at Draco and smiled. \"I can't shag you through your trousers.\"\nDraco blinked, still feeling dazed, but then nodded. He unfastened his flies quickly, climbing off the bed and letting them fall to his ankles, before toeing off his shoes and socks and stepping out. Potter climbed back onto the bed and Draco moved to meet him. Then it was the lean press of Potter's body against him as Potter pulled him into another kiss.\nDraco found himself rocking into Potter, his cock catching and then sliding against Potter's hip as he began to leak. Potter moaned, then pushed him back onto the bed. \"My turn,\" was all he said before he leaned down and swallowed Draco's cock in one go.\nDraco thrust up at the sudden warmth, and Potter moaned around him, tongue sliding along the underside. He pulled away too quickly. \"Fuck. Need lube.\"\nDraco laughed as Potter scrambled off the bed and began rummaging in the drawer of his nightstand. Potter shot him a look as he pulled out a white bottle and climbed back on the bed. \"Ha ha.\" He upended the bottle and squeezed, leaving a puddle of clear slick in his hand. \"Keep laughing.\"\nBut his fingers were gentle as he began massaging the slick around Draco's hole, and Draco closed his eyes to attempt to reaccustom himself to the sensation.\nDraco felt the first finger breach him as Potter leaned down again to lick up the underside of his cock. He gasped, bearing down on the intrusion, as Potter began suckling the head of his cock. He wound his fingers back into Potter's hair, nudging him down. Potter chuckled, and the vibration around his cock caused him to moan again. \nAs Potter began a slow suck, Draco spread his legs further, and then Potter was pressing into him with a second finger. At first, the sensation stole his breath, but Potter chose that moment to swallow him down again, twisting his fingers inside him. \n\"Fuck. Like that.\" Draco released Potter's hair, pushing himself up on his elbows to watch. Potter's face: eyes closed, expression rapt, lips stretched wide and rosy around his cock. \nIt was beautiful. Potter was beautiful. And Draco watched; so he'd have this moment, always have this moment, in memory.\nPotter pulled his fingers from Draco's arse, blinking up at him. After another suck, he pulled off Draco's cock as well. \"Ready?\"\nDraco nodded, not trusting his voice.\n\"You're still tight. If you get on your knees, it'll be easier.\"\nDraco quelled his immediate urge to protest. Part of him didn't want to roll over, wanted to see Potter as he slid into him. But Potter was also correct, though not in the way he imagined. It would be easier. Draco wouldn't have to control his expression. Wouldn't need to keep Potter from seeing the love in his face. Wouldn't have to see that Potter didn't share that emotion.\nDraco rolled quickly, grabbing a pillow and shoving it under his chest, before he glanced back briefly at Potter. Potter's expression was pained, and he reached out, running a hand gently along Draco's back. Draco buried his face in the pillow as the hand dipped lower, thumb tracing his rim.\nPotter placed a soft kiss low on his back, and then Draco felt the bed shift as Potter moved, and then began pressing his cock into Draco's arse. \nDraco flinched, because even slicked and loosened, it was tight. Potter shushed him gently, pausing to rub a gentle hand along his flank and press another kiss to his spine. After a few breaths, Potter pulled out slightly and rocked in again, further, deeper, and Draco concentrated on his breathing, on pushing back into the pressure, pressing until he could feel Potter's balls rocking against his own. \n\"So good, so good, so good,\" Potter mumbled against his back as he held there, and Draco closed his eyes, blinking around the tears.\n\"Okay. I'm okay.\" Draco breathed into the pillow, and at another press of lips to his back—\"I'm okay.\"\nPotter didn't reply, but he grasped Draco's hips and began a slow rocking thrust. Draco pressed back into it, moaning quietly as he loosened more and Potter's slide became smoother and easier.\n\"Yeah, like that.\" Potter murmured as he thrust, continually pressing kisses along Draco's spine. The hands that had held his hips into the first thrusts had lightened, sliding along Draco's side before one reached down and around him, grasping his cock in a light grip.\n\"Fuck, harder.\" Draco breathed, rocking forward into the too-light touch.\nPotter gave a pained laugh, but his grip on Draco's cock tightened and Draco let out a loud gasp in response. Potter's thrusts began to speed up, and Draco moved a hand to brace himself as each one knocked him forward.\nIt was better than he'd expected. He'd not really allowed himself to think about the details of shagging Potter. He'd thought about his heart, his soul, but not the physical sensations. And when Potter had commented on the time since he'd last topped, Draco had expected something more tentative. Less sure. Less affectionate.\nBecause it was. Potter moved with surety, but also with caring. He murmured words of praise and pleasure, he covered Draco's back with kisses, and he maintained a rhythm with both his hand and cock that had Draco holding onto his control by a thread.\nIt was perfect, for all its awkward beginnings. Or it would have been if it were real.\nAnd it was that thought that filled Draco's mind when the pressure in his bollocks became too much and he finally crested and spilled with a cry. Potter let out a garbled shout, hands moving back to Draco's hips, and holding him tightly as he gave his own final thrusts.\nHe collapsed on top of Draco, and Draco took the opportunity to bury his face in the pillow until the wetness around his eyes faded. Potter pressed another tired kiss to the back of his shoulder before rolling off, breath loud and fast in the quiet room.\n\"Not where we'd imagined we'd be ten years ago, yeah?\" The smile on Potter's face was audible in the words, breathless and happy.\nDraco gave a faint grunt, for it was what he'd imagined all too often.\n ~0~\nIn the end, they had sex three more times through the afternoon and night. Draco knew it was just to increase their chances of conception, but in the moment, he let himself dream.\nBreakfast the next morning was awkward, simply because he'd not thought there would be a breakfast the next morning. But when he opened his eyes, it was to the smell of coffee and bacon. \nDraco took his time getting dressed, stretching around the feeling of pulling, aching muscles, and made his way slowly out of the bedroom. He could hear Potter singing off-key along with the wireless, and he slowly wandered back down the hall to the living room, following the sound and smell to the small kitchen.\nPotter was wearing a pair of grey trackpants and a white shirt, and appeared to be in the middle of a full fry-up. \n\"Good morning?\" Draco had intended the words to be more certain, but they turned up at the end in question.\nPotter startled, song stopping abruptly as he spun to face Draco. \"Oh! Hi! I'm sorry, I was just...\"\n\"Singing Celestina Warbeck at half-six?\" Draco offered with a slight smirk when Potter's words trailed off. \"I knew your tastes ran middle-aged biddy.\"\nAnd just like that, Potter relaxed, tossing the tea towel at Draco. \"My tastes run to bacon and strong coffee in the mornings, thank you very much. I was going to share with you as well, but if you're set on insulting me, I'll just keep it all to myself.\"\n\"Your hospitality is truly remarkable.\" \nPotter rolled his eyes, heaving a large sigh, and turned back to the hob. \"Just sit down, you great git. I'll get you a plate.\"\nDraco crossed to one of the oak chairs and sat, shifting uncomfortably at the ache. He glanced up to see Potter watching him, a pair of plates in his hands and his cheeks pinked, and he straightened pointedly. Potter gave a quiet noise, almost a cough, before he brought the plates to the small table.\n\"Eat up.\"\nDraco eyed the plate before him, filled with eggs, beans, several rashers of bacon, and a stack of toast. \"You've got to be joking.\"\nPotter blinked up at him, forkful of eggs halfway to his mouth. \"What?\"\n\"You eat like this every morning? On top of all of the takeaway?\"\n\"Not usually. During the week, it's just some coffee and whatever bun looks good at the shop across the street. But weekends, yeah.\"\nDraco shook his head. \"And you're still so...\"\n\"Scrawny?\" Potter grinned. \"Yeah, I know. Can't gain weight if I try.\" His smile faded and he looked down at his plate, randomly forking at the beans. \"Healer Sprigg thought that might have been part of my problem.\"\nDraco took a bite of his eggs. \"Well. We're not worrying about that anymore.\"\nPotter blinked up at him, giving a lopsided smile. \"Yeah. I guess not.\"\n\"I'm surprised you're not in the office today. You seem to always be running ragged.\"\nPotter's cheeks went crimson. \"I, er—I told Hermione I was taking off this morning. I'm due in after lunch. I owled her yesterday afternoon.\"\n\"Oh,\" Draco coughed, and then cast about frantically for a change in subject. \"Up early for a morning off.\"\nPotter smiled. \"Yeah, well. Opportunity for a fry-up. And some Warbeck. If I had a lie-in, I might miss it.\"\nDraco rolled his eyes, reaching for the jam pot. \"I'm missing the shop's early morning rush; I might have been able to avoid getting 'You Charmed the Heart Right Out of Me' stuck in my head.\"\n\"What's in my cauldron full of hot, strong love will make your life complete!\" \nPotter grinned manically as he sang, loudly and as off-key as his earlier humming, and Draco could only stare in horror. \"You did not just...\" And when Potter took a deep breath to continue, Draco threw a toast triangle at him.\n ~0~\nDraco didn't tell anyone he'd spent the night with Potter. When he'd come through the Floo midmorning, Pansy had taken one look at him, and rolled her eyes to the ceiling. \"Finally, you get a good shagging. Thank Merlin. Maybe you can stop walking around with your knickers in a bunch all the time.\"\nHe'd flipped her two fingers and made his way to his room, unsurprised to hear the sound of her heels following. \"Now, darling, tell me everything.\"\n\"Fuck off, Pansy.\" He toed off his shoes before starting on the buttons of his shirt. \"I need a shower.\"\nPansy waved a hand. \"You've nothing I haven't seen before, darling. Let me look at you.\"\nDraco sighed, but continued working his buttons. \"I thought that's what you were doing. And didn't you decide you liked tall and dark again? Maurice, was it? Or have you tossed him over already?\"\n\"Marcel, darling, and you won't put me off that easily.\"\nDraco shook his head, pulling off his shirt and reaching for his socks. \"Your obsession with seeing me naked says nothing good about your current paramour...\"\nPansy peered at him. \"Not a mark? Draco, I'm disappointed. Finally spending a night out and not even a tiny bit of red?\"\nHe shook his head. \"I'm going to go take a shower now.\"\n\"Come on!\"\n\"I'm not discussing this with you.\"\n\"Was he any good? I hope he was good. You were gone all night, I was worried sick.\"\n\"You were not, you're just a pervert.\" Draco called over his shoulder as he walked into the bath.\nPansy gasped, \"How dare you say that?\"\n\"Does your repeated failures in propriety amuse you?\" Draco shut the door in Pansy's face.\n\"I'll get it out of you eventually!\" Pansy's shout carried easily through the door.\nAnd she would. Whether Draco fell pregnant this month or not, it wasn't something he would be able to hide from her forever. And when she found out it was Potter, she would completely murder him.\nHe turned the taps on high, resolved to deal with that when he had to, and not before.\n ~0~\nDraco came to understand Potter's anxiety over the next two weeks. Every ache or cramp or bit of nausea set his mind spinning. Did he sleep badly? Did he get banged about in the Floo? Was it the previous night's curry?\nThinking about it being a baby wasn't something he could even consider. Not really. Even if that was the point of the thing.\nPotter was expectedly solicitous. Draco had found himself at loose ends, with his former shop emptied and key Owled back to Tanner, and he'd taken to spending long mornings in Cassandra's, reading or chatting, and Potter would often stop by as well for lunch or to drag Draco along to see interesting sights or hide from Hermione's ever-present Protean Charm.\nBut Draco was always aware. Potter's eyes lingered on Draco's belly, as if he could simply will a child into existence. It left an awful awkwardness, where Draco was at once exultant in the feeling of almost-courtship, but also the reality that he and Potter had sex and were trying to make a baby.\nAnd so it was with a feeling of unreality that Draco returned to Healer Sprigg's office two weeks later with his shirt open and her waving her wand at him again.\nHe was relieved that this test didn't feel like the previous, only a faint tingle on the edge of his awareness. But at the white glow emanating from low in his abdomen, Potter seemed to crumple in on himself, and Draco felt something in his own stomach sink. \"That's a no, then?\"\n\"I'm sorry, Mr Malfoy.\"\n\"So we try again with another fertility potion in two weeks?\"\n\"Yes, two weeks exactly.\"\nDraco nodded. \"All right.\"\n\"I understand this is hard. It feels like you've been trying for months. But you must bear in mind this is an entirely new circumstance, and you cannot look at it through the lens of past failures.\"\nDraco nodded again, even though Sprigg seemed to have her attention focused directly on Potter. It felt uncomfortably like they had forgotten him entirely, for all Sprigg's wand was still pointed vaguely in the direction of Draco's midsection.\nWhen Potter said nothing, Sprigg sighed. \"I will see you in four weeks, gentlemen.\"\nShe gave Draco's hand a pat as she left, and Draco turned to watch the door close behind her. \"Potter—\"\n\"I'd hoped...\" Potter's words cut across his tentative start. \"I'd hoped this would finally do it.\"\n\"You heard what she said. This is a new—\"\n\"But don't you see? It's not. Not really.\"\n\"Potter...\" Draco trailed off, not really certain what to say to make the hollow expression in Potter's eyes fade.\n\"What's the one thing all these failures have in common? Me.\"\n\"So you know more about male pregnancies than Sprigg?\" Draco buttoned his shirt and forced the words out through the clench of his jaw. He wasn't certain what about the situation set it off, but his temper flared at Potter's show of guilt. \"Because you said she was the best, and it looks like she's been delivering babies long enough to have delivered your parents and grandparents, both.\"\n\"You don't understand.\"\n\"Funny. You said I was the only one who understood how much hope hurt. So either you know more than Sprigg about the likelihood of me conceiving a child, and you are a liar, or you don't and you aren't.\"\n\"Fuck you, Malfoy.\"\n\"Yes, you did that. And you'll do it again.\"\nPotter stood a moment, looking ready to punch him. It was almost a relief from the stupid guilt. Then he shook his head. \"I'm not. I'm not going to do this with you. Not here. I'll see you in two weeks.\"\nDraco blinked. \"Two weeks? What?\"\nBut Potter didn't reply, merely stomped out of Sprigg's office, leaving Draco wondering what exactly had happened.\n ~0~\nOf course Draco discovered why he wouldn't see Potter for two weeks from a special edition of the Prophet. Granger and Weasley's wedding, with a photograph of the two of them, Potter, and a dozen gingers all smiling and waving lay above the fold.\nHe had to admit they all looked happy. The sun was shining on a large, flowering garden behind them, and in some of the pictures further in, he could see a nauseatingly picturesque white gazebo beside a still lake.\nHe resisted the urge to owl Potter, commenting on how far Devon was from London, that he'd drop off without a word beyond \"two weeks,\" leaving Draco standing lost and bewildered in Sprigg's office.\nHe resisted the urge to tell him to come back, just for one dinner, that he'd try his bloody anchovies or Vindaloo or chocolate. \nIn the end, he simply sent an owl offering his congratulations to Weasley and Granger-Weasley, and a gift of a good red wine. He didn't mention Potter at all.\n ~0~\nIt wasn't like he needed Potter to entertain him. He'd just grown accustomed to tripping over him. And without a shop to go to, he found himself at loose ends in a way he didn't know how to deal with. He hated the inactivity; it was what had kept him opening the shop each day, even though he'd hated it.\nAnd the way they'd parted still stung. Draco knew that prodding Potter's guilt was dangerous, but he'd never taken Potter for the type to run away from a fight. \nHe wondered if Potter had started blaming Draco yet.\nIt was mainly for a lack of anything else to do, and the lingering desire to avoid arousing Pansy's curiosity, that he began lingering in Flourish and Blotts, purchasing books on pregnancy and early childhood, and storing them on the mostly empty shelves in the storage of his lab.\nHe also visited the Manor, as empty and dark as the last time, snagging one of the remaining comfortable chairs from his mother's parlor to drag back to the shop with him. With the further addition of a lamp, and the effect was almost cozy.\n ~0~\nHe didn't expect to see Potter until the full two weeks were up. Not after the way he'd gone off, full of unfocussed anger.\nHe really didn't expect to hear Potter banging on the door of the lab three days ahead of schedule, yelling, \"Draco? Are you in there?\"\nHe was surprised enough that he almost didn't answer, but a second knock jerked him up from his seat.\nHe opened the door to find Potter just turning to leave, and he frowned at the sheepish expression. \"Wasn't expecting to see you here.\"\n\"Er, I...\" Potter scrubbed a hand through his hair. \"Can I come in?\"\nDraco stepped back, letting Potter through the door. Potter looked around at the empty work surfaces and frowned. \"I thought you'd be, you know, setting up.\"\n\"For what? It'll be a year before I can start brewing again. It's just easier to keep some things here and away from nosey flatmates.\"\n\"Er, yeah. I kinda bribed the witch in Floo Network Registration for your Floo address. I talked to Blaise.\"\nDraco felt something in his gut grow cold. \"Good thing it wasn't Pansy, then. She's a beast in the mornings.\"\n\"Er, yeah.\" Potter's face darkened in a blush. \"But he said you were avoiding the flat because Pansy keeps trying to set you up. So I came looking.\"\n\"And you found me.\" \n\"Yeah. I stopped by Cassandra's first, since that's where you had been going.\"\n\"I can't exactly maintain a bookshelf at her teashop. I've been researching. Babies, I mean. Baby things.\"\n\"Oh.\" Potter blushed again, shifting uncomfortably, and then, \"Oh.\"\nDraco sighed. \"Out with it. If you're going to tell me not to bother, that you'll just wait for Luna to get back from Argentina or wherever she is or something, just say it.\"\nThe flush in Potter's cheeks grew to spread over his ears and down his neck, but his jaw jutted out in familiar stubbornness. \"No. I wanted to say you were right. You and Sprigg, I mean. This is different and... I reacted badly and then I just left and that was badly done of me.\"\nDraco nodded slowly, and Potter said quickly, \"You were an arse for calling me a liar, though.\"\nDraco rolled his eyes. \"It was deserved.\"\nPotter laughed, \"So, I'm forgiven?\"\n\"I suppose.\"\n\"I told you that you were right. That has to count for something.\"\n\"I can't forgive what you're not sorry for.\"\nPotter rolled his eyes at that. \"That is the biggest lie I've heard out of your mouth since Hogwarts.\" He shook his head. \"And Blaise is weird.\"\nDraco sighed. \"He just got back from Bulgaria. He's been sleeping with Viktor Krum for the past few months. It's left him a bit... happy.\"\n\"I never realized how much he looks like Blythe.\"\nDraco laughed. \"Until he smiles. I almost thought it was some elaborate prank when I walked into his conference room.\"\n\"Good. It wasn't just me.\"\n\"What did he do?\"\n\"Oh, he didn't... It wasn't anything he said, he just... smiled at me. Like he knew something.\"\nDraco concentrated on keeping his expression even. \"That's just Blaise. You'd be surprised at how many secrets he acquired while at Hogwarts with that smile.\"\n\"How many?\"\n\"Even if his mother didn't have a round dozen inheritances now funding her marriage habit, he'd never need to work a day in his life.\"\n\"From Hogwarts?\"\n\"Mostly. It's difficult to tell, he's never stopped.\"\n\"What does he have on you?\" Potter's grin turned sly, and Draco raised an eyebrow in response.\n\"What makes you think he has something on me?\"\n\"He's your roommate.\"\n\"Ah, but he's my friend as well.\"\n\"So what you're saying is I couldn't pay him to spill on you?\"\n\"I do wonder at the state of the Potter vaults if you are willing to be that frivolous with the spending. Should we increase the size of the trust funds?\"\nPotter laughed. \"I take it that's a no. Got it.\"\nDraco smiled as well as Potter hopped up to sit on one of the worktables. \"How was the wedding?\"\n\"Oh, it was great. Really great. Ron and Hermione say thanks, by the way. They didn't expect anything from you.\"\nDraco shrugged. \"It seemed the thing to do. When I found out, I mean.\"\nPotter smiled, nodding. \"Ron didn't even check it for poison or curses first.\"\nDraco laughed. \"That sort of carelessness is going to get him in serious trouble.\"\nPotter rolled his eyes. \"As if you'd do anything that easily caught.\"\n\"Why Potter, that's the nicest thing you've ever said to me.\"\nPotter shook his head, hopping down and crossing to the door. \"Come on, you. I'm hungry.\"\n\"No breakfast at Cassandra's?\"\n\"No, I was too busy looking for a great git.\"\n\"You should have checked the toilets. There are mirrors in there.\"\n\"Well I was going to offer to treat you, but if you're going to be like that, you can pay.\"\n\"You're the hungry one. And the one who first said git.\"\n\"You just used my own words against me?\"\n\"Of course. You make it so easy.\"\nThe sound of Potter's laughter carried even as he walked out the door.\n ~0~\n\"It's kinda ridiculous I should be this nervous.\" Potter scrubbed a hand through his hair and grinned sheepishly as Draco swallowed the potion. \"I mean, after last time.\"\n\"Performance anxiety, Potter?\" Draco grimaced, trying to ignore the tightness in his own shoulders. \"Really? At this stage?\"\nPotter huffed a laugh. \"Yeah, yeah.\" His eyes darted around the room, and the smile faded quickly. \"I...\"\nDraco sighed. \"It's not your fault. Even witches sometimes try for months or years before they get pregnant.\"\nPotter gave a jerky nod, and Draco sighed again.\n\"Do you blame me?\"\n\"What? No!\"\n\"If it's your fault you didn't get pregnant those months you tried, then it's my fault if I'm not getting pregnant now. Merlin, Potter, it's basic logic.\"\n\"You're a twat.\" But he was smiling.\nDraco reached out to shove Potter, but he grabbed Draco's hand, twining their fingers together. \"I thought we'd left violence behind us in Hogwarts.\" Potter laughed. \"You swore those days were long past.\"\nDraco rolled his eyes, ignoring the flush he could feel rising in his cheeks. \"You're the one who always starts with the insults and name calling. Says a lot about your maturity, I must say.\"\nPotter used their clasped hands to pull Draco closer, brushing a brief kiss against his lips. \"Can we just agree we're equally immature and move on to the shagging?\"\nDraco's breath caught in his throat. \"I could be persuaded.\"\nPotter leaned in and pressed a kiss to his jaw, before moving lower and sliding his teeth along Draco's neck. \"Oh, good.\" He released his grip on Draco's hand, to twist his fingers into Draco's hair. \"What were we talking about again?\"\n\"The fact we're both arses to each other?\"\n\"Mmm. Arses. Your arse.\"\n\"Was that supposed to be a come on?\" Draco laughed.\n\"I could sing you some Warbeck. I know what that does to you.\"\nLuckily, a pillow was in easy reach, and he smacked Potter with it, laughing at his shocked expression.\n ~0~\nPotter's bed was comfortable. It wasn't that Draco found that part surprising. It was a bed; a certain level of comfort was to be expected. But the cotton sheets had only an average threadcount. And Draco was used to a half dozen pillows.\nThis bed smelled of Potter. Of sunshine and summer and sweat and the taste of his tongue when he gasped and came deep inside Draco's arse.\nBecause they did this face to face. \nHe didn't know why; Potter hadn't let him roll over when he'd tried. They'd collapsed into bed earlier in the evening, laughing and touching and kissing. Potter had prepared him with the same gentle intensity as he had the previous month, but when Draco had tried to roll, to grab the pillow, Potter had held him fast. Had kissed him. Had rocked and prodded and finally pressed into him, all without releasing that kiss.\nHe felt drunk. He gasped for air, breathing Potter's exhalations, feeling nothing but Potter's bed, Potter's skin, Potter's tongue and cock tethering him to the present.\nAnd after Potter came, he didn't pull out. He ran a hand over Draco's face, a gentle touch, and smiled. There were words in that smile, words Draco didn't understand, didn't trust himself to interpret. He closed his eyes, rocking his still-hard cock into Potter. Potter's breath huffed briefly against his cheek, and he slid from Draco's arse, swallowing his cock instead.\nThere were tears in his eyes when he finally cried out, and he flung his arm across to hide it as he gasped for breath.\nAnd still, Potter kissed him.\n ~0~\nDraco didn't think it was just his imagination that things seemed different after that. Everything seemed different.\nPotter had begun loitering in Draco's empty lab often enough that Draco felt the need to question him on the state of his actual job. It was always brushed off with a \"Hermione knows how to reach me\" and a shrug. And, Merlin save him, he liked Potter's company enough to let it pass.\nHe even dragged Potter with him to the Manor, through the empty halls and back to his mother's parlor to find a chair for him.\nIt was awkward; Potter obviously had no good memories of the Manor, and the dustcovers and darkened corners couldn't have helped, but after an initial moment's strain in his expression, he'd flopped gracelessly onto priceless antiques and expensive reproductions until he declared one the proper fit.\nThey'd hauled it back to Draco's lab, and then Potter had insisted on adding his own books to the shelf, and then it was like he was always there.\nWhich was nice, as Draco soon found the smell of fry grease following him everywhere. He'd thought at first that it was Potter, and his obnoxious addiction to Muggle takeaway, but the smell was always there, before Potter arrived, after he left. Luckily Potter was always willing to go fetch Earl Grey, bergamot being the only thing Draco had found to mask the smell, with minimal fussing.\nSometimes he also brought treats, because Draco found himself dreaming about Cassandra's currant buns at night, while his stomach and mind rebelled at the thought of eating anything else.\nIt felt out of character, but Draco didn't let himself think about why that might be, or the way Potter's expression went from considering to hopeful over the following week. It was enough that Potter was there.\nIt was still Potter, however, and so Draco was unsurprised when he sat alone waiting for Healer Sprigg. He'd known Potter's sloughing off work would catch up with him, and Granger's patience would wear thin. He'd only hoped it wouldn't happen today, when he knew what Sprigg would tell him.\nHe wanted Potter to be there, to hold his hand. Wanted to see the way Potter's face would break into joy, happy not just for a child, but for Draco having the child.\n\"Mr Malfoy?\" Healer Sprigg was suddenly in his field of vision. \"Mr Malfoy, I'm going to need you to calm down. Focus on slowing your breathing.\"\nDraco blinked, suddenly aware that he was almost hyperventilating. Sprigg's hand was firm and cool on his own, and she breathed loudly and deliberately, until Draco was matching her.\n\"Very good. Now, is Harry running late, then?\"\nDraco nodded, swallowing around the dryness in his mouth. \"Yes.\"\nSprigg peered at him, and then smiled. \"Well, let's check you, then. Though judging by your expression, I think we can guess the outcome. In my experience, the parent always knows.\"\n\"Oh, Merlin.\"\nSprigg helped him open his robes, then waved her wand in the familiar pattern. He tried to keep his breathing even, but he could feel his pulse racing as the light around his stomach deepened to a bright golden glow. \nThen his stomach cramped, because Potter wasn't here, he wasn't happy that it was Draco, he was only going to be happy that this had worked and he wouldn't need to shag Draco again until the next one.\n\"Well, Mr Malfoy, congratulations—\"\nHe didn't hear the rest of Sprigg's words, as panic clawed up his throat and through his limbs. He had to go, to get away from Sprigg's professional congratulations; from anywhere Potter would find him until he was able to breathe again.\nHe barely noticed that he crashed into Potter, huffing and out of breath, in the hallway; ignored his surprised shout, focussed entirely on reaching the lifts and the Floo.\nWhen he stumbled across his hearth and into Pansy's surprised grasp, he was messily sick.\n ~0~\nPansy was clutching at his robes and shrieking something about St Mungo's when Blaise's quiet \"Evanesco\" vanished the sick from the floor.\n\"This is not normal, you need to see a Healer!\"\n\"Pansy.\" Blaise rested one heavy hand on Draco's shoulder and one on Pansy's. \"One moment. Breathe. Draco, are you...?\"\nDraco could see the room tint green, and Blaise's words trailed off before Potter's voice carried across the silence. \"Draco? What happened?\"\nPotter's sudden appearance in their flat hit Pansy like an insult to a Hippogriff, and her wand was drawn in an instant. \"Potter! What did you do?\"\nDraco could hear Potter sputtering behind him, and his knees went weak again. Pansy shoved him into Blaise, and she fired off a hex, yelling again. \"You bastard! What did you do to him?\"\n\"Merlin! What the fuck, Parkinson?\" There was a sizzle and pop, as whatever Pansy fired at Potter ricocheted into the wall, leaving the smell of ozone in its wake.\n\"You are such a bastard, coming here after everything you've done!\" There was another sound of a hex hitting the wall and Draco knew Pansy was too upset to shoot straight.\nDraco didn't want to turn, didn't want to look and see Potter's face. He could imagine the expression perfectly: shock mixed with hurt, and some determination starting to creep in. He glanced up at Blaise instead, watching him draw his inscrutability ever closer. Blaise glanced at him briefly. \"You are?\"\nDraco didn't need to ask what Blaise meant. He just nodded. Blaise huffed a sigh, releasing Draco and walking to Pansy. \"Pans. Stop.\"\n\"What? No!\"\n\"Pansy. Please.\" Draco's voice was rough in his throat, and he still couldn't bring himself to turn.\n\"Draco...\" And Merlin save him, she sounded half to tears. \n\"Pansy, Draco needs to handle this.\"\nAnd Draco winced, because Blaise just said the exact wrong thing. \"This? Draco? You've been seeing Potter? Still? After everything?\"\n\"Pansy...\" Draco turned, and it was exactly as he expected. Pansy seemed torn between hurt and rage, Blaise wearing a sheepish wince, and Potter glancing between the three of them, wand half-up and bewildered.\n\"After what everything?\"\nPansy rounded on Potter again, ripping her arm from Blaise's grasp. \"After you broke his heart! Again, you fucking pillock.\"\nPotter's jaw dropped and Draco wished the floor would swallow him whole. Blaise groaned, wrestling Pansy's wand down once more. \"That's quite enough, Pansy. Come on, we're going until you can behave yourself.\"\nBlaise spared them both a glance as he tossed Floo Powder into the hearth. \"You owe me.\" Then they were gone in a puff of green, leaving Draco alone with Potter.\n\"I broke your heart?\" Potter's voice was a tiny, lost thing. \"I...\"\n\"I'm going to be sick.\" Draco turned, dashing through the flat to his toilet. He had no idea if it was the spinning of the Floo, the baby, or the feeling of panic still racing under his skin, but he was grateful for the reprieve his heaving stomach gave. \nHe could stay here, knelt over the toilet as his stomach tried to decide how sick it was going to be. He rested his forehead on the cool porcelain of the seat, clenching his eyes shut. He could salvage this. He would think of something to say, something to make Pansy's words a little less damning.\nHe startled when he felt a warm hand on the back of his neck, and his stomach heaved again in response. \"Shhh. Sorry. I brought you some water. It's cold, might help you go one way or the other.\"\n\"Go away, Potter.\"\n\"No, because I think if I do that, you'll just avoid me again. And I really don't want to do that again with you.\" There was a gentle tug on his shoulder. \"Come on. Have a sip.\"\nHe allowed Potter to pull him upright and press the glass to his mouth, eyes still tightly closed. He spat the first mouthful back into the toilet before taking another sip. All the while, Potter rubbed slow circles on his back. \"Staying down?\"\n\"I'm not sure yet.\"\nPotter hummed quietly. \"You could call me Harry, you know. You've done it before, I've heard you.\" Draco made no reply, only taking another sip of the water. \"It's part of why I thought...\" Potter gave a pained laugh, and Draco found himself glancing over at him in spite of his intentions.\nPotter's lips were twisted in a faint smile, though his forehead was heavily lined. \"I thought you still kinda hated me.\"\nDraco blinked. \"What? Because I call you Potter?\"\n\"I know. After everything, right?\" Potter laughed, staring intently at his thumb, where he ran it along the seam in his trousers. \"But it just feels that way. When we're not together, not talking. When you're not being an arse or rolling your eyes at me or something. I just remember all the times you call me 'Potter' and how much we used to despise each other.\n\"And it hurts, because I've been more than half in love with you since before the first visit to see Sprigg.\"\nDraco blinked, and Potter glanced up briefly, before dropping his gaze again. \"So I was trying to... court you, I guess. Because when I'm around you, I can focus on how much I like you, and hope that maybe you like me just a little bit as well. I mean, I know you do, or I hope you do because, well, baby. And I do like you, I mean, and—\"\n\"Harry.\"\nPotter's mouth shut with a snap, and he glanced back up at Draco. He huffed a soft laugh, this one more relaxed than the previous. \"I need to shut up, don't I?\"\nDraco nodded. \n\"Was Pansy right? I swear, I never meant to—\"\n\"Harry. Shut up.\" Draco gave a faint smile. \"You're such a Gryffindor.\"\n\"What?\"\n\"Listening to the words but not what they mean.\" Draco reached out, grasping Potter—Harry's—hand. \"You needed to have my heart to break it, you great git.\"\n\"And do I?\"\nDraco found he couldn't hold Potter's gaze. \"Why do you think we're having a baby?\"\nPotter tugged him forward, pressing a soft kiss to his forehead. \"So you'll protect me from Pansy?\"\nDraco laughed. \"I'll protect you from Pansy.\"\n\"Good. I'm going to kiss you.\" Potter pressed another kiss to his forehead. \"Just as soon as you've brushed your teeth.\"\n ~0~\nDraco's eyes shot open, and he groaned quietly around the uncomfortable pressure in his back and hips. He could tell by the quality of the light coming in the window that it was somewhere in the hours between \"too early\" and \"too late,\" dark and still in the midnight hours.\nThere was a weak mumble beside him before Harry rolled over, breaths long in sleep. Draco climbed out of bed, knowing he was too awake now to rejoin Harry in slumber.\nHe crossed the room on quiet feet, pushing open the mostly-closed door and continuing into the hall. The faint noises of the house were familiar, even things like the hum of electricity in the kitchen, which he'd been certain when they'd moved in three years ago, would keep him awake every night. \nHe stood at the top of the stairs a moment, pondering going down to the kitchen for some tea. But he shook his head, turning back. He passed his room and the sleeping Harry, and poked his head into the next.\nLyra was sound asleep in her bed, legs tucked underneath her, blonde curls splayed across the pillow, and the stuffed owl she'd been given by Ron and Hermione for her first birthday held in a death grip. He wanted to cross the room, to brush the hair back from her face and try to settle her in a more comfortable position. He resisted, however. He knew that doing so would surely wake her. He didn't want to be stuck dealing with her for the hour it would take to tire herself enough to sleep the rest of the night.\nInstead, he withdrew, crossing the hall to the other room, this one filled with a crib, changing table, and large comfortable rocking chair. He sat down, leaning back and closing his eyes, letting the familiar glide of the chair soothe some of the pain in his back. \nHe'd spent most of a year in this chair. From the last month of his pregnancy, when he couldn't get comfortable enough to sleep lying down through the middle of the night feedings. It was the only thing guaranteed to get little Lyra to sleep, and he and Harry had thanked Lucius and Narcissa repeatedly for the gift.\nIt was the first thing Draco had insisted on moving into this room, even before the crib. On nights like these, when his mind was full and the child in his belly was restless, he returned. The motion of the chair always worked to quiet both, and he soon felt his eyelids begin to droop.\nHe awoke some time later to a gentle touch to his shoulder, and he opened his eyes to blink blearily into Harry's deep green ones. \"Rough night?\"\nDraco smiled faintly. \"Couldn't sleep.\"\nHarry pressed a kiss to his forehead. \"Come on. I've got the kettle on, and we've some currant buns left from yesterday. Go get some tea and I'll handle the Princess.\"\nDraco smiled up at him. \"I love you, too.\""
}