{
    "id": "41396832",
    "url": "https://archiveofourown.org/works/41396832?view_full_work=true",
    "author": [
        "BamSara"
    ],
    "title": "Bytes of Lunacy",
    "rating": "Not Rated",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "Other"
    ],
    "fandoms": [
        "Five Nights at Freddy's"
    ],
    "relationships": [
        "Sun (Five Nights at Freddy's)/Reader",
        "Moon (Five Nights at Freddy's)/Reader",
        "Eclipse (Five Nights at Freddy's)/Reader"
    ],
    "characters": [
        "Sun (Five Nights at Freddy's)",
        "Moon (Five Nights at Freddy's)",
        "Eclipse (Five Nights at Freddy's)",
        "Original Five Nights at Freddy's Character(s)"
    ],
    "additional_tags": [
        "Drabble Collection",
        "Oneshot Prompts Challenge",
        "Fluff",
        "Angst",
        "Hurt/Comfort",
        "Non-Sexual Intimacy",
        "No Pronouns or Descriptors for Reader",
        "Self-Insert yourself",
        "Out-of-Context and Out-of-Order timeline wise in the Solar Lunacy Universe",
        "Blood and Injury",
        "Other Additional Tags to Be Added",
        "I do not consent to having my work uploaded onto lore.fm"
    ],
    "language": "English",
    "series": "",
    "published": "2022-08-31",
    "completed": "2023-06-03",
    "words": "32,113",
    "chapters": "24/24",
    "comments": "963",
    "kudos": "6,623",
    "bookmarks": "590",
    "hits": "96,997",
    "summary": "<p>You return with a steeled one of your own. \"You can't get rid of me that easily.\"</p>\n<p>Red pupils against black eyes drfit to the bandage on your forehead, and you swallow as Moon's gaze lingers in the silence too long to be comfortable.</p>\n<p>\"I can, though.\" Moon's form is unnaturally still, zeroed in on your expression, reading your face, reading your body language. \"I can.\"<br>-------</p>\n<p>Several drabbles / One-shots for the Solar Lunacy universe that I'm dumping here for prompts requested to me on tumblr. No chronological order/Spoilers for Solar Lunacy.</p>\n<p>Moon takes care of a drunk Reader.</p>\n<p>Continuation of the previous drabble. <br>Sun takes care of a hungover Reader.</p>\n<p>With no prior plans made, you are working the evening to night shift at the Pizzaplex's Daycare on Halloween night, so you practice Trick or Treating Safty with Sun and the kids, and witness a sweeter, softer moment with Moon. Also, everyone is forced to wear costumes. Including you, to which you get teased for.</p>\n<p>Sun-Centric, Moon at the end. | Wordcount: 1,763 | A03 Version</p>\n<p>Eclipse-Centric | Wordcount: 1,322</p>\n<p>Slow dancing in the kitchen late at night.</p>\n<p>Reader has a nose bleed and Moon, who does not have good memories of their blood, helps them.</p>\n<p>Spoilers for Solar Lunacy</p>\n<p>TW for injury and injury suturing</p>",
    "notes": "<p>Hello! This fic exists purely to dump all the drabbles I've been writing on tumblr here and there for my other fic, Solar Lunacy and that universe for better organization. These prompts were given to me by folks on tumblr, so I'll have a prompt and a name at the start of each chapter. These aren't in any chronological order and some of these drabbles/oneshots may contain spoilers for Solar Lunacy, so be warned. Thanks for reading!</p>\n<p>Note of context: on tumblr I drew a comic where at the point where the DA is at home with y/n, the maintence man comes along with a stray kitten and offers it to them. The reader is reluctant because they don't know how the DA will react, but the DA (namely Sun) is excited for the kitten, so it's a running joke now</p>\n<p>Note: Spoilers for a future chapter of Solar Lunacy</p>\n<p>Note: MAJOR Spoilers for a future chapter of Solar Lunacy. Drabble can be read stand-alone but more detailed hints can only be picked up if you read SL.</p>\n<p>This written prompt is fluff/domestic shenanigans with Y/N having a habit of poor self-care, but the DA helps that.</p>\n<p>Note: Major Spoilers for Solar Lunacy</p>\n<p>Drunk! Reader x DCA (Moon Centric) Set Post-Fire / DCA is living with Reader. May contain slight spoilers for Solar Lunacy ARC 3.</p>\n<p>NOTE: This one was HIGHLY requested by a lot of people omg. This one-shot is leaning more romantic, contains drinking alcohol and suggestive humor. Moon is caring for a drunken reader.</p>\n<p>Again, this one was very much requested! I'm glad people liked the previous one so much they wanted to see a follow-up with Sun lol</p>\n<p>CW: Drinking mention, (1) puking instance and other typical syptoms of hangover. Nudity mention in a non-sexual situation (you eat soup while a nice hot bath, yay.) and some suggestive humor.</p>\n<p>This was orignally a prompt drabble, but I got carried away so now it's a simple Halloween drabble of it's own without the prompt.</p>\n<p>Set in future ARC 2 (lateish) of Solar Lunacy: The DCA's reputation has improved, Moon has been reinstated as the Daycare Attendant and is doing well so far combatting the virus. Fire has not happened yet.</p>\n<p>NOTE: The reader does have a 'themed' costume but the actaul apperence of the costume is not decribed, so up to however you visualize it</p>\n<p>Set post-fire. Please read or see previous installments about world building. Just a fluffy thingie real quick</p>\n<p>Pre-fire, Solar Lunacy Arc 2. Bit of some jealous Moon in the subtext ;)</p>\n<p>Based off a draft scene I had for Solar Lunacy, so you may see this scene again in a future chapter of SL. (Slight spoilers)</p>\n<p>I pulled another Solar Lunacy bullet draft out for this prompt, so this is more of a SL crumb than it is a stand-alone drabble. Expect to see this scene again in SL, but maybe written better (and a different beginning and ending, some details more fitting, ect)</p>\n<p>Set in the time period where Moon is not yet reinstated as DCA, still has 'glitch issues', Reader is somewhat used to it.</p>\n<p>If confused: Prompt giver is referencing a couple of comics and previous drabbles where reader and DCA have obtained a kitten. The comics are on tumblr if need to find.</p>\n<p>This drabble is Romantic-leaning!</p>\n<p>Taking advantage of the fact that my Sun cannot lie, so he either deflects or avoids the question, while Moon is more blunt. Takes place in ARC 2 (Moon reinstated as DCA, restrictions taken off Sun)</p>\n<p>(Also, consider this a draft crumb for a future chapter of Solar Lunacy, so, spoilers. You may see a similar scene in the actual fic later.)</p>\n<p>Contains some spoilers for ARC 3 (Post-Fire) of Solar Lunacy, so please consider this a crumb! <br>Notes: Contains blood mention, obv, and character exibihiting some subtle signs of PTSD.</p>\n<p>(Maybe some major spoilers for Solar Lunacy, TW for some robot gore, human injury)</p>",
    "text": "\n\"For the prompt list, I liked \"Is that my shirt?\" \"You mean our shirt?\" So many possibilities for fluff, snark, or both :D\" - @autumnday19 on tumblr\n\nYou've gotten used to them going through your things while you're out. A robot clown with no outside world experience left alone in your home while you attend your college courses is bound to get bored and curious while you're gone, so it's not unusual to come home and see Sun alphabetically organizing all the food in the fridge, or Moon picking apart the pieces of your toaster since he's gained the habit of taking apart the pieces of your household appliances and putting them back together again. A little morbid, when you think of it, really. But not unusual behavior.\nThe laundry, however, has become a different issue. \"What are you wearing?\"\nSun looks up from his seat on the floor, legs cross and putting together a jigsaw puzzle on the coffee table. You're not sure where they keep getting new ones. \"Clothes! Isn't it nifty? I think we've gotten used to it.\"\nThe avoidance is blatant. \"No, I mean-\" You furrow your brows, pointing at him. \"Is that my shirt?\"\n\"Our shirt!\" Sun grins, not even looking as he slips a puzzle piece into place. \"Don't worry! I made extra careful not to stretch out the neck with my rays. We have LONG graduated past button ups!\"\nIt looks odd fitting on him, but the audacity of the situation is what makes you blink twice. \"Sun, dude. We went and bought you clothes.\"\nHe gives a short laugh. \"You don't need to ask me to use those, friend! Sharing is caring, you know.\"\nYou cock a brow at him and he just glints at you, watching with mirth as you set the groceries on the table and hang your keys up by the door. \"Sun, cmon. That's my favorite pajama shirt too.\"\n\"Oh, boo hoo. We'll give it back later tonight.\" His tone is playful, teasing, and he busies himself with finishing the puzzle as you walk over. \"Its nice to have different options, but you should try going without one! Why, we didn't wear a shirt for years and we were just fine! I'm sure it's comfy to sleep without one anyway.\"\nHow bold, and how excusy. You blink at him, eyebrows raising to your hairline. \"You don't want to give the shirt back.\"\nNon-chalant, Sun slides the last puzzle piece into place. \"Of course not. Theres a rainbow on it.\"\n\n\"\"...Did you just sniff me?\" (The prompt thing but it’s just sun or moon talking to the kitten)\" - @skelemamabirb on tumblr\n\nIt's when you get up to use the restroom at night do you hear a voice coming in through your living room.\nIt catches your ear one step out of the washroom, and you pause in the hallway. Down the corrridor, you're careful not to step on the wood that creaks or peak too far out of the doorway, still half-asleep and wondering what soft, low sentences are coming from inside your home.\nYou're not scared it's an intruder because the Daycare Attendant would simply Not Allow That (in gentler terms, Sun puts it. Moon is harsher.) and it can't be Gramps because the clock on the wall says it's 2:34 AM and he'd rather suffer through learning how to work a smart phone than do maintence in the middle of the night, so you peer into the hallway. The TV is on, maybe?\nIt's not. There's no light, so it takes some time for your eyes to adjust, the only source of illumination comes from the eyes of your animatronic roomate. Moon's eyes are a cool pale color, a calm white, and it casts a glow over the little moving kitten standing on the sofa in front of him.\nMoon speaks, quietly, softly enough in ways that you know he's been programmed and well practiced in, so you don't hear the exact words until the kitten steps forwards, timid, and it's nose touches the tips of animatronic's extended fingers.\n\"Did you just sniff me?\" His tone is quiet and light, head cocking to the side. Not out of confusion, but he sounded like he was teasing, like talking to a toddler. Moon keeps his hand still. The kitten, still cautious, touches it's nose to his thumb and doesn't flinch when he brushes it over it's head. \"Good girl. We're friends. See?\"\nThe kitten still shakes as Moon's finger runs over it's back, a small, puny thing that's only known the cold and hungry. Then, it falls back. Hair raising slightly and eyes wide. Moon's hand pauses, then falls back to the sofa, unmoving, and waits for the kitten to approuch again.\nYou bite your tongue when he raises his finger slightly, and softly makes a familier noise. \"Pssp pssp pssp pssp. Here. Come here.\"\nSome memories arise in the back of your mind as the kitten judges it's options, staring at the robot's hand with a mixture of caution and curiosity. You run your fingers down your arm and across your wrist, mindlessly.\nYou're about to make your leave, preferably without disturbing them and go back to your room when Moon speaks, this time a little louder. \"It didn't work on you.\"\nYou pause, head turning back towards the sofa. Moon hasn't torn his gaze away from the kitten, but he's aware of your prescenes. Probably from the beginning, given he was a robot and all. Better senses and all that. You softley smile. \"It didn't, but this time you're trying your best not to be scary. That's the difference, right?\"\n\"Hmm.\" Moon makes a low hum, thoughtful . The kitten has found entertainment with the ribbons around his wrist, fears forgotten as the robot twists his hand. A moment, and Moon's head raises up, slowly turning to face you in the doorway.\nA stretched grin is etched across his face, the eye on his darker side dimming to a red. \"You're up late, brat.\"\nYou roll your eyes and wave a hand over your shoulder. \"Don't get started. I'm going back to bed.\"\nSnickering echoes from the living room as you enter the bedroom, cracking the door open an inch so he doesn't have to turn the knob and make a noise when he enters later (because he always does, without fail, if anything to vandalize your notebooks while you slept) and climbs back underneath the covers.\n\n\"Whatever you do, do not make a sound.\" - anon on tumblr\n\n\nRoxy's eyes are missing.\n\nNot just missing. The metal in her face was bent and disfigured, burn marks scarred her chassis and an unsual twitch in her walk. She was hunched, hurt, and her voice cracked with a kind of pain you've never heard from the usually confident wolf in all the time you've worked here.\nYour fingers tremble around the flashlight as your heart races, (What happened? What happend? What's going on? Her too?) and you open your mouth to yell down the corridor. \"Ro-!\"\nA hand comes around your mouth and your pulse skyrockets as your feet are lifted off the ground, an arm wrapping around your midsection as you are dragged-no, carried off struggling and kicking and yelling muffled curses into a metal hand as your assaliant backs away from your original position. In the midst of the choas, you see Roxy's ears twitch, and her muzzle turn towards your direction, but that sight disappers behind a wall as your capturer brings you out of proximity.\nYour grip tightens around the flashlight, and you raise it high-\n-just to have the hand on your mouth dart and catch your wrist. Still, you open your mouth, vision swirling and try to yell, but the sound turns into a almost 'oomf' noise as the arm around your midsection draws away and the opposite hand slaps over your mouth, your own hand clawing at the arm as your pressed firmly against the wall.\nScrew this. You're not going down without a fight, so you thrash, eyes shut tight in the panic.\n\"Hush.\" A familier voice, close to your head and hovering. Your skin prickles and you freeze, the grip around your wrist lightening as your flashlight and your hands pulled to your chest. The voice sounds loud, even in a whisper, and it's nervous.\nSun's rays are shrunken, eyes wide and looking at the spot around the wall's corner. A faint, white pupil is present in his gaze, more evident in the Pizzaplex's dim lights. \"Whatever you do, do not make a sound.\"\nYou take a sharp intake of breathe thanks to the now myriad of questions you have, but the sound of Roxy's footsteps come closer, so you bite your tongue as the Sun's form presses further against you to the wall as if he wanted to block any sense of you from the rest of the world, and watches as the wolf's shadow comes around the corner.\n\n\"You can’t get rid of me that easily. - anon on tumblr\n\nThere's stuffing littering the employee breakroom. A plush Monty is missing it's head. The remains of a Chica toy is shattered somewhere between the corner and under the table. Spilled over paint cans drool black across the tile and reach your shoes.\nMoon hasn't looked at you once since you entered, sitting atop the fridge. His fingers pluck the string and stuffing out from a Bonnie plush. It's missing it's jaw and an arm. You watch as Moon tears out the toy's eye with casual disinterest. \"Go home.\"\nYou ignore him. \"I work here, bozo. I can't leave.\" You approuch, noting how his fingers pause as you get closer. It doesn't matter if paint sticks to your shoes, they were ruined anyway. You'll have to clean up this mess later. \"Freddy said I might find you here.\"\nMetal fingers pry underneath plush Bonnie's other eye, clawed underneath the button, and slowly, maticously, pulls it out by the thread. Moon drops the button to the floor. It lands seamlessly in the paint. \"Go home.\" He repeats, colder this time.\n\"My shift isn't over yet, and you said you'd help me with the posters.\" You refute, and see the metal in his face twitch in annoyance.\nHe plucks at Bonnie's ear, a frown on his expression. \"Go home. Now.\"\nYou return with a steeled one of your own. \"You can't get rid of me that easily.\"\nRed pupils against black eyes drfit to the bandage on your forehead, and you swallow as Moon's gaze lingers in the silence too long to be comfortable.\n\"I can, though.\" Moon's form is unnaturally still, zeroed in on your expression, reading your face, reading your body language. \"I can.\"\nYou steele your face to remain uneffected and hope the animatronic cannot sense the rise in your pulse. There was a reason why you didn't turn on the lights when you walked into the room. \"Do it then. Or come help me with the posters already.\"\nCrimson pupils lock onto yours. He's too still, not animated like before.\n\"I'm scared of the heights, Moon.\" The lump in your throat threatens to break your voice. \"I don't want to use the ladder unless someone I trust is there to catch me.\"\nMoon's glare stays. The fingers that reached the guts of the plushie to pull apart it's stuffing are still.\n\n(You weren't lying, at least. But the fear of heights was the lesser of the two.)\n\n\n(His eyes burn through the bandage like he's trying to dig deeper into the wound.)\n\n\"Don't use the ladder.\" Moon speaks lowly. His wrist tilts and he lets the mutilated plushie fall to the paint with a pitful gloop noise. You resist taking a step back as he drops from the fridge, standing at his full height. There's a moment where he looks at you, red pupils still, and you inwardly note that they haven't changed once since he saw you when Moon steps past you. \"Follow.\"\nHe's out of the room before you can even turn around, so you just follow the black footprints he's left behind, covering them with your own and shut the door behind you.\n\n\"I know \"When did you stop loving me?\" is an angsty one, BUT what if it was actually an overly dramatic lament bc someone didn't get their way?\" - @hella-cute-and-fruity on tumblr\n\nYou're a college student with a hetic, inconsistant schedule job and more stressers in your life that would make a therapist whistle, so you're not exactly the best at self-care, or even regular human maintence. Your eating schedule was flakey at best and the contents of your fridge wasn't anything healthy if just something to pop into the microwave very quickly to save time. Sometimes your apartment would get dirty quickly and with no mental energy or time to clean it up, you just lived a little gross for a while. Don't even get started on your sleep schedule.\nThe Daycare Attendant, you realize, became quite aware of your situation more-so than they already had after their 'permanent moving' into your home, and thus you've been subjected to more life changes in the last week than you'd ever be prepared for.\nSun uses your phone to order healthier groceries and and tsks at the instant-microwave meals in your cabinet. He's gotten into cooking, which is both incredably odd considering he's a robot, but amusing when you walk into the living room and he's watching an a show of middle aged women teaching the viewers how to make veggie pasta.\nMaybe he misses arts and crafts back when he was at the pizzaplex, and just liked to work with his hands. Something hints at you this is a correct assumption because the fruit he cuts for you are star and heart shaped and he likes to take pictures with your phone afterwards. You don't get it, but it makes him happy and keeps his mind occupied elsewhere, so you don't mind.\nMoon cleans up after your mess and threatens you (in a friendly manner, of course. You think.) to go to bed at a proper time or he becomes rather aggitated.\nAny attempts at using your phone underneath the covers will result in a small EMP attack that takes out your phone and the neighbor's Television. You know, because Gramps mentioned that her TV only seems to cut out around the same time every night and nothing he does seems to fix it until morning. Moon holds no remorse, obviously.\nIt's nice. Even if they're a little bit pushy about about it. Honesty, you think these acts are just remants of their care giving programming, the need to feel useful after everything that happened or just trying to busy themselves with the human they're invested in. Maybe a mix of all of those things, but that's to be unpacked later.\nThe exchange wasn't unequel either. You've learned more about robotics in the last 6 months than you'd ever expect to know, for sure, along with some other things. You're an adult, you can keep yourself alive just fine, but it's nice to have the extra support.\nIt does, however, get a touch on your nerves at times.\n\"Moon, c'mon, I'm like, so close to the end-\" You make a lunge for the remote, and it's closer to you than it was before. The animatronic holding it over your head doesn't even blink as you make a grab for it again and your fingers only brush air. \"Dude! The season finale came out today. It's literally the last couple of episodes!\"\n\"Sit.\" Moon states plainly. \"Kitchen table.\"\n\"I'll eat later. It's not like the fridge is going anywhere, Moon. C'mon. Everyone has seen it but me and I'm already getting spoilers on my feed. Just another episode? You two said you've watch it with me anyway.\"\nMoon blinks dully at you, and stuffs the remote underneath his hat. \"No.\"\n\n\"C'monnnnnn\"\n\nFingers find your collar and hook underneath the fabric, and routinly, you are dragged away from your unhealthy habit of binging new series of media to attend to your oh-so-delicate human needs that are far too demanding for your liking. The Daycare Attendant has long become acustomed to your whining.\nThe dinner table chair because your metaphorical prison as Moon lightly pushes towards it, sitting with a slump and a over-the-top dramatic sigh as the animatronic walks through your kitchen. The lights are dimmed, but he still squints at the refridgerator lights that greets him when he opens the door. \"What do you want.\"\nYou resist the urge to snatch his hat and run. \"A robot that doesn't nanny me.\"\nRed eyes and white pupils side eye you, and Moon pulls out a a few items. He speaks deadpan. \"Cry about it.\"\n\"Maybe I will.\" You snark back. He makes a noise somewhat akin to a snort, and you pretend your pinching his head inbetween your fingers from across the room. You raise from your seat, resigining yourself to your fate and getting yourself a drink. It's a sugary soda (caffine free!) that Moon glances at but leaves be. Sun would have polietly recommended water by now.\nIt's almost a funny image: a tall, clown robot standing in front of your microwave in a t-shirt and slippers, just staring at the glass with mild dissassioance until the counter goes down. You duck, popping your head underneath his elbow and his arm raises to allow you. \"So.\" You sip at your drink, and Moon makes a face above you. \"What's on the menu, Starboy?\"\n\"Leftovers.\" A pause. \"That we made this morning.\"\nRight. Sun must have made a meal set during the day for the opposite half to make for you at night. Clever bastard. \"...Can I have the remote now?\"\nMoon, without looking at you, adjusts his hat to sit better on his head.\n\"Bitch.\"\n\"Sit.\" He shoos you to the table. \"And sleep after this. It's late.\"\nVery late, actaully. Around the wee hours of 1AM and half-past god knows what. You'd been so caught up in your favorite show that you just sorta forgot to do everything else for the day, so eating, showering, studying were all at the bottom of the list. Regaurdless, your TV called to you.\nYou heave a dramatic sigh, falling back onto the kitchen chair and resting your elbow on the table, cheek resting in your palm. \"I can't believe you'd treat me like this after all we've been through. Denying me the simple pleasures in life, for shame.\"\nThe microwave counts down to single digits and Moon's fingers hover over the handle. You can't see his face from this angle, but a faint chuckle is in his tone. \"Tragic.\"\n\"Ugh, how could you?\" You sigh again, more dramatically this time, and even go as far as to place the back of your free hand against your forehead and calling back to all the cheesy soap operas you and Sun watch in your free time. \"I feel soooo betrayed. When did you stop loving me?\"\nThe microwave starts beeping and Moon's fingers lock onto the handle, and freeze.\nA couple of beeps ring by. You hand lowers and you raise a brow at the animatronic's still form. You give him a moment, because sometimes the Daycare Attendant stalls sometimes, and you chalk it up to being a robot thing. But the beeping was starting to get annoying. \"Hey, man. The food's done.\"\nAnother two seconds. His fingers move and pop the microwave door open. You can smell heated up veggies and broth from across the room. \"Funny.\"\n\"Yep. I can be a jester too.\"\n\"One episode.\" Moon grabs your dinner with one hand, and pulls the remote out from under his hat with the other. \"To eat your food with. Then sleep. You're lacking.\"\nThe smile on your face comes naturally, and you swipe the remote from his hands. \"Yeah, sure. Like I'd let you boss me around anyways. Come lay with me on the couch and watch it with me. There's aliens in this episode.\"\n\n\"I'll take care of you.\" - Anon prompt request on tumblr\n\nIt hasn't spoken to you since it's awakening.\nIt's (him, them? Did it matter?) face is turned away from you, staring blankly at the opposite wall. From this angle on the couch, you'd think that it's maybe watching the television, except the TC was off and it's eyes were still as the body, unmoving, tense and ridged.\nThe charred arm missing from the elbow down hangs limpy at it's side, while the other three hands it's sporting are clenched into fists, one with claws digging into the fabric of it's pants, tearing the fabric. Not that it'd be noticble among all the other rips. No, out of the mess, the only thing really eye-catching was your dried blood is still caked on it's fingers.\nYou set the phone down on the counter after the hangup, approuching the figure from behind. It's tall. Very tall, actaully, bigger than usual. Metal has shifted into places and melded into size. A part of you would make a transformers joke if you were lighthearted, but there's a weight in your chest that sinks as you get closer. The silience was souring. \"Hey.\"\nThe head moves, slightly. Not enough to look at you but enough for you to catch the movement just barely. It's listening. You don't know what to say. You don't know what to offer. \"I'm....gonna go get you a shirt. And a blanket, and some, uh, rags. To help clean up the-\" You fiddle a gesture with your fingers, looking the animatronic once over. \"Yeah.\"\nThere is gunk and mess slightly rubbing off onto the fabric of your sofa by now from it, but you don't look that much better yourself. Actaully, now that you're closer and not in a panick, it might take an actaul bath to get everything off of the two of you instead of wet rags and baby wipes.\n\"Hey.\" You say, because you don't know this thing, you don't even know it's name, but it's head turns towards you like it knew you better. \"It'll be okay, you can stay here.\"\nBlack eyes with jagged pupils stare into yours. The facial expression is locked into something unreadable.\nYou offer a smile, soft and slight, and reach out a hand. It's gaze sticks unervenly still on your face even as you muster the courage to place your hand gently on it's face plate (careful, The sunrays were sharp and metal edged, the thread from the nightcap was scewed from them peircing through) and patting, once and twice.\nA gesture of comfort in the face of uncertainty, because you've seen this thing tear steel and metal apart like twigs, and you're nothing but flesh and bones. \"You can stay here until we figure it out.\" Your other arms wraps around yourself in nervousness, but your courage is in the fingertips that gently tap alongside the animatronic's face. \"I'll take care of you.\"\nIt looks at you for a moment. Then, the animatronic moves slightly towards you. Your hand flinches back, you freeze, and notice the arm in the lower parts of your vision; a metal hand outstretchd, caught in the fabric of the belly of your T-shirt.\nThe limb and fingers froze when you pulled back, and after a moment, they drop back to the animatronic's side. It's gaze never fautlers.\nYou'll take that answer for whatever it's supposed to mean and step back. \"Stay here. I mean it, don't....don't move from the couch.\" You walk slowly as you talk, backing away in the hallway. You're pretty sure you have spare towels and rags in the bathroom cabinat, and you kinda need a moment to breathe. \"I'll be right back.\"\nIt's head tracks your movements even as you briskly walk into the bathroom and lock the door.\n\n“The amount of drunk that I was has no correlation to the bad decisions I made.” - prompt requested by several persons.\n\nIt started out as a friendly invite from a couple of classmates, a few who's names you remember and some others that you'd hardly recall their faces, but you all faced the same hellish finals together, neck deep in studying and deadlines that the lack of aqqauintance with them didn't so much as matter as the mutual understanding that college was hell, and final exams were the metaphorical boss battle you all had to face against.\nYou pass by the skin of your teeth. Between what was happening outside of classes and your own habit of procastinating, you were close to calling it quits for the semester. But Sun was helpful going over the material for you, and Moon kept you from being distracted, so you pass. Barely, and you're already stressed to the nines, but it's enough.\nSo when your classmate messages the class's group chat (much to the proffessor's charigin) about a group outing at a local bar to celebrate, you agree. You haven't been able to be social lately, and some reprieve was needed. You didn't really drink, and the bar wasn't really your style, but a change of pace was in order. Gramps promises to answer the door for the Attendants if something came up, but they liked to bother him reguardless when you weren't home, so you leave to do a little celebratory socializing.\nAnd that's how you're....here. Drunk and alone.\nTurns out after the first hour, everyone scampered off to go get hitched or call it for the night. It was nice, but a majority of them are dispersed by now or in pockets, save for one classmate (Brittney? Becky? You don't remember) who's actaully chatting it up with the robot bartender.\nShe's twirling her hair around her finger and blantently flirting with the robot in plain view, probably as tipsy as you are. It's a scene you glance over at occasioanlly in amusement while you nurse your own drink. The robot doesn't seem bothered, but then again, you can't tell if it's able to even display emotion like that.\nThough, you did notice it never shooed her away, never charged for her second drink and was currently pouring flavored water into her shot glass while she laughs at some sort of joke it makes that you don't hear.\nKinda funny how far along human and robot relations have come, hasn't it?\nYou sip at your own drink again, finishing it off, and stand up from your chair-\n-and that's a bad idea. The world spins, tilts far left to the side until you grip the side of the counter to pull yourself back down to the chair and wait for the disortion to subside.\nOut of the corner of your eye, the bartender's mechanical eyes flit to you for a split second, then return back to Brenda. (Or Bethany. Who knows.)\nHow embarressing.\nPulling out your phone, you check the time. It's late at night, almost the early hours of the morning. The bar is open for now, but will close soon enough by the time you wait for the tipsy to pass and sobering to start, and to be fair, it just doesn't dawn on you to ask for water when you're a bit too preoccupied trying to not be dizzy.\nWalking home alone like this is...probably not a good idea.\nGramps is in your speedial, along with another number you've put in here fairly recently.\n(You did teach them how to use the phone properly, right? Oh, you'll feel so terrible if you have to wake Gramps up at this hour, the poor old guy.)\n(You can probably make it home by yourself. It's just a ten minute walk.)\n(Maybe you can ask someone here for a ride home. Nevermind. The last remaining of your known classmates are either arguing in the corner, leaving as you watch and Brooklyn's flirts with the robot bartender is becoming more and more riskay by the minute.)\n\"It's late.\"\nYou blink. In your hand, your phone screen says you're in a call. You're finger is still pressing over the spot where you selected the contact. Oops. Did you mean to do that? \"Uh.-\"\nA sound from the speaker thats soft spoken and slow. You press it up against your ear to hear it better amongst the bar's chatter, and a low voice repeats itself. \"You should be sleeping.\"\nYou can't pick up the meaning in his tone. You're too muffled in your own brain to make out the ends of his sentences that you just rock back in your chair and hum in your throat. \"Heya...Hi.\" You start, voice slurring. \"Hi Moon.\"\nThere's a pause on the other end of the call. \"Where are you?\"\n\"Uh, same place. You know.\" You wave your hand off and don't feel stupid that he couldn't see your gesture. \"The uh, bar down the road. The one with the big neon sign in the front. Looks like kinda like ah, a...banana. The thing, curved thing on the front.\"\n\"Okay.\" Moon sounds tired, except robots don't get tired, and that's just what he usually sounds like whenever he's dealing with your shenanigans, or something particularly difficult. Sometimes he says you're difficult, but not in the way that feels mean. \"Stay there.\"\n\"Well, I can't, dumbass I gotta get home at some point. Bar closes soon.\" You huff into the phone. \"Was gonna leave here in a bit, anyways. Just need to sit for a minute.\"\n\"A minute.\" Moon repeats. His voice echoes like he's talking to you from a stairwell.\n\"Yeah-huh. Like, a minute.\" You lean back in your chair confidently, then immediatly lean back towards the counter as the legs started to tip the other direction and forgoe any movement to just lean against the bartop. \"Didn't mean to call you. My finger slipped.\"\nHe hums, and it sounds less than convinced. \"Hmm. How much?\"\n\"How much...what?\" The end of your question is drawled out with your lack of sobriety.\n\"Nevermind.\" Footsteps, air against the phone speaker. Moon speaks plainly. \"Did you have fun?\"\n\"Man, whats with you and the questions?\" You blow air out of your nose, your free hand thumbing minelessly for your shot glass and looking up from the wooden counterop when you feel something different.\nA glass of ice water was set next to you, replacing what little alcohol you had left in your cup. The bartender is on the other side of the room, still talking to your classmate, but you've already seen how it's been replacing her drink with water, and frown at your own. \"Aw, damn.\"\n\"Language.\"\n\"Shut uuuup.\" You groan into the mic, and your head plops down onto the counter, resting. \"I had fun. It was...alright.\"\nMoon makes a noise of aknowledgment, a quiet sound to continue.\n\"I got the lowest score in the class.\" You confess, almost mummbling. There's no one paying attention to you, and the bar was sparspy populated so it's not like you had anything to be embarressed over. Still, your breath comes back up to your face as you rest your head and it smells like vodka. \"I mean, nothing's wrong with that. Still passed though.\"\nHe hmms through the phone. \"We know. You told us.\"\n\"Got ditched.\" A slurred sentence, quickly continued after a moment. \"Not like, ditched ditched. Like....everyone's gettin' ready to leave soon. They've got their own bubbles, m'not in them.\" You slow to a stop, looking around the room. There's even less people now, and with the slow music playing on the speakers, it's a nice vibe. Smelled like cigaratte smoke and alchol though.\nIt's relaxing. You're relaxed. That drink is really settling in, and your legs are feeling like heavy weights and your tongue easy to move when you talk. In fact, you could sit here for a few more hours under the low-lights, listening to soft music, rambling about how college is stupid and how you regret being such a lightweight. Maybe skip out on the drinks, next time. You were starting to feel tired.\n\"Don't tell me that yet.\"\nYou blink, blearily, head shifting to look back down at your phone. \"Hmm?\"\nThere's a small pause on the other end, a silence punctuated only by soft background noises that you can't make out through the call. \"...You've been talking outloud for the past few minutes.\"\nMinutes? It's been seconds, no way. You squint at the phone screen, ignoring the numbers in the corner for the numbers that state how long you've been on call. It's too bright for you, so you put the phone back to your ear. \"S'fine. I mean't to do that.\"\n\"Sure.\" Moon says. \"Anything else?\"\n\"...It's uh, dark enough in here for you.\"\n\"That's nice.\"\n\"Kinda stinks, though.\"\n\"We wouldn't be able to tell.\"\n\"I think my classmate likes robots.\" You speak quieter, which only makes half of your sentence coherent but you continue off the drunken assumption that your rambles were making sense anyway, free hand cupped around your mouth and facing away from the flirting scene like a kindergardener giggling at juicy gossip. Luckly, your classmate is too far to hear you, and if the robot did, then it doesn't show it. \"Like, likes-likes robots. She totally wants to bang it. Her. I think. I think the robots a girl.\"\n\"Uh-huh.\" Moon speaks dully, but you can hear faint amusement. \"Good for her.\"\n\"Can robots do that? Wait, don't answer that.\" You bring down your phone away from your ear to glance back up towards said classmate like you were scared of getting caught gossipping. You were, in a sense, not the best at being subtle, but both the bartender robot and your classmate are now seated at a booth away from the counter, holding their own conversation.\nYou stiffle a small gasp. \"Holy shit, I think they're hitting it off.\"\nMoon does the robot equivlanet of a sigh. \"Don't stare.\"\n\"Right. Rightrightrightright-\" You turn away quickly, curling back into yourself like some child caught in the act. \"I'm not-I'm not staring-Wait, how didja even know I was looking?\"\nThe sound of a car driving past, a door softly opening. \"We know you. You're nosy.\"\n\"You're mean.\" You huff, phone pushed into the space between your ear and neck, using the countertop to rest your head. \"I want to go home.\"\n\"Mmhm.\"\n\"Can robots make out?\" The question is so out-of-the-blue you can almost feel the whiplash you send through the phone. \"Because I think they're about to. Becky, uh. Brianna. I don't know her name. They're like, really getting along. M'not staring by the way. I'm glancing.\"\n\"Okay.\"\n\"Is it like, all robots can do it or just some of them? I don't know if, it's like-uh, like..is that insensitive? Am I offensive?\"\n\"No.\"\n\"If I google it do I get weird pictures or do I get an answer?\"\n\"Both.\"\n\"Can I ask you a question?\" You continue. \"A totally...not weird question. Maybe kinda weird. Not the weirdest thing I've asked you. Anyway, can you-?\"\n\nClick.\n\nYou raise your head, looking down at the phone as it flashes the 'call ended' words before going back to your home screen. In a tipsy gasp, yur mouth drops open. He hung up on you! Why that little-\n\"Ask again when you're sober.\"\nA low voice startles you, and you spin around and almost falll off your chair in the motion.\nMoon stands behind you, phone still in hand but lowering to pocket it in his hoodie. (Plain, simple, the biggest one you could find to fit them. He still wears his star pants and ribbons but at least he took the bells off his slippers.) and glowers down at you with a quiet look. He has the hood pulled up, even with the hat on, and it just makes his eyes glow a little more in the low-lights.\nHis hand raises to the glass of water, now with most of it's ice melted, and slides it across the counter towards you. \"Drink.\"\nYou blink blearily at him, and it's out of synch. \"When did you get here-\"\n\"Drink.\" He repeats, hoisting the glass up to your face until you grumble something innapropriate and snag it from him. You chug it down rather quickly while he waits, and the room never quietens in the few seconds that it takes, but you listen to the conversations out of habit.\nBailey and the bartender robot were definatley gonna start dating or something, and your classmate didn't even look drunk anymore, just a bad flirter. Most of the people in the bar were humans (why would robots come here? They can't drink, and they'd be outnumbered 10 to 1 anyways) save for the other two automations you think are quietly hanging out outside, but it's mostly flesh and blood.\nA quiet 'where did that one come from? the circus?' reaches your ears as soon as you finish the water, dropping the glass down on the table and turning your head to whatever human spoke but Moon inturrupts you. A sleeved arm holds out in front of you. \"Stand up. Here.\"\n\"Don't tell me what to do.\" Comes out slurred and stuffed up, but the world tilts when you lift yourself off the chair, so your hands find his arm and your balance steadies. \"I want to go home.\"\n\"Mmm.\" Moon turns, slowly so you don't get stick, and leads you to the door. \"It's past your bedtime.\"\n\"Dun't have a bedtime.\"\n\"You will tonight.\" You are lead past the remaining patrons, who don't really care about your departure save for the one or two off-hand glances. Moon opens the door with one hand, holding it open, and guides you through. \"Come on.\"\nYour classmate turns your way, and you register her throwing up two thumbs up in your direction with a wide, encouraging smile just as the door shuts behind you. Whoops.\nThe bar's neon light is bannaa shaped because of some island-theme they had back before redesign that never got taken down, but in your shifting vision and the night's dim lights, it kinda looks like a cresent moon. This is something you voice outloud without meaning to, and Moon spares your thoughts with a glance to the sign, and a chuckle before he leads you down the sidewalk.\nWalking is...well, it's taking some bit of effort. Everything felt kinda heavy, your stomach was starting to churn and you needed to use the restroom soon. Maybe you could get home faster if you speed-walked or something, or took a shortcut. You pull away from the guiding arm out for you. \"I can walk.\"\n\"Okay.\" And so Moon lets you pull away, standing straight and watching as you take a few tentive steps. You fumble on your fifth step, but the ground never has a chace to rush towards you. A hand around your shoulders, tight but never lower, presses you back towards the Attendant until your own grip finds his upper arm and dig your fingernails into the sleeve.\nHe's walking before he even asks again. \"Want to try again.\"\nYour nose wrinkles up, and whatever word you had formlated in your mind comes out garbled and incoherent. \"Heuh.\"\n\"....Guess not.\"\nIt's peaceful walking at night. Sometimes cars would pass by on this road, and the bright headlights would make your eyes sting but you never ran into anything. Fireflies start to appear in scarcity as you approuch your apartment, rambling about your classmates and the exam and how the vodka didn't taste at all how the bar marketed to be while your animatronic guide is quiet with the occasional noise of aknowledgement, and very focused on making sure you don't trip on every pebble you see.\n\"This is kinda like...when you escorted me to the doors, back at the pizzaplex.\" You talk outloud again, and there's no sting in your voice when you're drunk. \"You know, ya escorting me.\"\nMoon doesn't look up from the keypad to your apartments, jotting in the number (because just hacking it served you a few complaints from maintenence) and hums. \"It is.\"\nYou are lead through the opened door, and into the stairwell. \"But like, this time you get to come home with me.\"\n\"Every night.\" Moon adds, and finds the door to your apartment without so much as turning on the light in the hallway. It's nearly pitchblack, but you're not scared or bothered by the lack of sight in the slightest. The perks of having a robot friend with night vision means free avoidance of bumping into walls. You hear the clacking of keys, and the door opens. \"Inside-\"\nYou go in before he can finish, using the wall and the kitchen counter to steady you until you make it to the living room and the adjacent hallway. The lights are off for obvious reasons, but the living room lamp is on, so it's just enough light for you to make out your path. The world still tilts, although it's weakening, you barely manage to make it to the bathroom door, yelling out some incoherent 'illbeouutinasecond' before you swing the door shut.\nWhen you come back out, Moon is in the kitchen, and he turns to see you almost plank on the sofa cushions for a rest. You miss, bounce off the edge of the seats and faceplant on the floor instead. \"...oww.\"\nSoft padded footsteps approuch you, and you are unceramounsly yanked up by the back of your shirt until you're placed on the cushions (he lifted you effortlessly and carefully, but you still groan like an elephant at the movement) and turned over until you're facing upwards, sitting back against the cushion on the back arm rest.\nSomething wrapped in a napkin is shoved in front of your face. \"Eat.\"\nYou smell it before you can process seeing it. A plain, peanut butter and jelly sandwich, which you take into your hands, pull away the napkin and take a huge bite before you can say your appreciation properly without a mouthful \"Thhansk.\"\nThere's no response, but a hand comes up to your forehead, brushing back against your scalp and gentle running through your hair. His hand lingers there as Moon crouches besides the couch. The hoodie is gone now, so it's just his hat and t-shirt. You can see his soft smile more clearly. \"You need to go to bed when you're done.\"\nYou talk inbetween bites. \"M'not moving.\"\n\"Then stay here.\" He rises, knuckles brushing across your ear as his hand moves and disappears down the hallway. You're on the last bites of your sandwhich when he reappears with a blanket and pillow in hand, along with a folder you recognize with stars and moons in it's printed pattern.\nThe blanket is tossed over your legs and feet, and the folder is set to the coffee table besides you along with a pen. In your approuching bare-sobreity, you recognize the papers peeking out from the edge. Moon sits down besides the couch, back facing you, and opens up to where he left off presummably before he came and retrieved you.\nHe grades papers while you finish your sandwich and peek nosely over his shoulder. \"You never answered my question.\"\nMoon does not look up from grading his student's papers. \"I haven't.\"\n\"Gimmie answer.\"\n\"Silly.\" He starts, marking an answer wrong and setting that finished paper to the side. His voice never breaks from the calm tone. \"Asking personal questions, gossiping in public like that. Intoxicated.\"\n\"I wasn't the only one.\" You defend, and realize that's not exactly a factor that can play in your favor, so you search your clouded tipsy brain for another answer. \"Look, listen. I was dared to do shots. I don't..., uh, drink. Like ever. M'lightweight. But I'm not a coward.\"\nThe animatronic's head turns towards you on his swivel. \"Bad decision. Probably already tipsy.\"\n\"Hey-\" You warn, pointing a finger in his face. \"The amuont of drunk I was has no corrolations-\" That last word comes out fumbled. You ignore how Moon's smile twitches upwards. \"-no corrolations to the bad decisions I've made.\"\n\"Sure.\" Moon chuckles, onto the next batch of ungraded papers in his folder. \"You make plenty of those.\"\nYou make a notable effort to brush off any of the crumbs on your shirt in his direction. \"You weren't a bad decision.\"\nThe monotonous sound of pen scratching pauses for a moment. Then continues. \"Debatable.\"\n\"Booo.\" You groan, your disagreement echoing in the living room and silence settling between you two only broken by pages turning and pen scratching.\nSinking into the sofa and watching him work becomes a lullaby, and you feel sleep teter at the edge of your mind as the animatronic finishes up the current page, closing the folder and setting it to the side. Moon pushes the folder to the center of the coffee table, left out to finish the rest later, and you puff up your cheeks to blow air at his face when he turns back to you.\nHe doesn't even squint, just stares dully at you until you've finish. \"Thanks for getting me.\"\nHis head tilts. \"Mhmm.\"\nYour cheek presses further into the pillow. Nausea is there, something in the pit of your stomach, but it is long buried by the promise of sleep. \"But for the record, I didn't ask for you to take care of me.\"\nA blurred movement in the corner of your eye. His hand has returned, settled against your head with his thumb gently running over your skin. \"We didn't ask for your permission.\"\n\"....M'gonna be hungover in the morning.\"\n\"Yes.\" Moon grin in a way that's both soft and amused. You wonder if his sunny counterpart would be this teasing too, considering that's who's most likely going to be rubbing your back when you're kneeled over the toilet in the morning. \"You will be very hungover. Go to sleep.\"\nYou mummble something in protest, but your eyes close nonetheless. \"M'sleeping already. Geeze.\"\nYour response is a quiet hum, and the hand brushing against your forehead in slow motions until you start to drift away. That hand lingers, softley, and doesn't return to the pen until the world fades and you are well into slumber.\nYou wake up easy, with sunlight coming in through the blinds of your bedroom window leaving lines of light across your face, it's unlucky enough for you that one cast across your eyes and burns through your eyelids as you come to consiousness.\nEyes shut tight, your hand palms around your surroundings (you feel sheets, a blanket, your pillow) before grabbing the nearest one out from underneath something heavy and throwing it over your face.\nIt's a instictive reaction, quick and you're almost back to slumber when the thought process starts to churn in your mind: you didn't fall asleep in your bed last night, and you don't remember ever walking in here.\nSleep ignores that thought. Nausua, however, beats sleep back with a barbed stick and you sit up quickly, eyes flying open and all but blindlly scrambling upwards, over something gangly on the other side of the mattress and out of the bed.\nThere is a very surprised \"oh dear\" you hear coming from your bedroom as you run but you don't really catch it until you're kneeled over the toilet, eyes starting to wet as a sour feeling starts to boil and-oh, there you go. Yep. You're puking. You are definantly throwing up. Man, this was never pleasant.\nBetween the horrid noises and the inbetween on your still-groggy conciousness, footsteps approuch. You're finished (at least, you hope you are) as a hand comes to brush back across your forehead, and another settles on your back, running up your spine in a comforting rythem. \"Guess you didn't see the bucket by the bed, did you?\"\nTurning your head, you squint at the yellow, smiling gangly thing through wet, blearly eyes. \"Heuh?\"\nSun's smile is soft, brightening the room. \"Good morning!\"\nYou open your mouth to speak, and then immediatly choke on trying to swallow back the rest of the nausea. \"It is-\" You cough, wiping your mouth with your sleeve. \"I-It does not feel like a good morning.\"\n\"Well, we can work on that part.\" He's chipper, though a touch quieter than normal. A sorta-whisper yell under his usual volume, like he was purposly trying to be mindful of the potential headache you might be in route for. \"All done? Do you need a minute.\"\nYou swallow. You feel gross. Terribly gross. \"I'm- I'm done.\"\n\"Okay, now. Uppys-daisy, like so-\" Hands underneath your arms, he lifts you gently into standing position, slowly enough so the movement doesn't make you dizzy. The toilet lid is put down, flushed and Sun lowers you to sit while the world spins. \"Sit here. Good, there you go.\"\nHonestly? You're not even fully awake. \"I feel horrible.\"\nThere's amusement in his voice when Sun steps back. \"Oh, I can tell!\"\n\"Mean.\" You mummble, a soft tissue being pushed into your hand and you using it to wipe your face without missing a beat. \"Rude.\"\nHe scoffs, plucking the tissue and throwing it in the waste basket. \"I think 'rude' would be pulling out my pillow and then almost tripping over me while I was in the middle of a very good book!\"\nYour face scrunches up, only partially because the bathroom light is too bright for your incoming migraine. \"Didn't have to be in the bed.\"\n\"Well, no.\" Sun tosses the tissue, leaning over to start running water in the skin. \"But We like to be close by, and that was the comfiest spot!\" He says, and your retort is silienced by him handing you a toothbrush, and a cap of mouthwash you were too groggy to see him pour. \"Here, now. I don't know the experience but I've heard a lot of little ones complain about the taste.\"\nYou don't reject the offering, grabbing both items and not-complaining when you are guided to standing again so you can lean over the sink. \"You still get sick ones in your classes?\"\n\"Plenty! All the time. Often. They like to eat glitter glue when I'm not looking. Sometimes, parents drop them off with a fever.\" Sun smiles, his hand still resting on your back like he was afraid of you falling backwards. \"We think you should stay home for the day, too.\"\nYou start the process of mouthwash, toothpaste, mouthwash and repeat. \"M'not arguing.\"\n\"Sit tight.\" He bids you to stay, and you see his shape blur out of the corner of your eye out of the bathroom, the door cracked open in his absence.\nIt takes it's few runs but the taste goes away and your mouth feels infinatly cleaner than it did before. A breathe check and you're good to go, like the whole unpleasant experience never even happened. Your appereance, however, was a sight to behold in the mirror.\nYou're dishevielved, starting to feel a little grimy on your skin and still wearing the same clothes from the night before. Except your jacket was missing, and your shoes had been taken off. They never went past that, always lecturing about diginity and privacy if you were caught sleeping with your day clothes on.\nYou didn't mind it, but it's kinda hypocritcal when they're perfectly fine barging in when you're awake though. The nerf gun is probably still sitting loaded on the shower shelf. You can thank Moon for the need of that one.\nYou needed a shower, a change of clothes, and some food in your belly. Seriously. There felt like nothing in your stomach and it was not doing you any good for the hangover you were currently expereincing.\nTurning on your heel, you seek out the door to find the kitchen (maybe stuff some shredded cheese in your mouth or something) but a taller form suddenly appears, blocking the exit. \"Oh, feeling better?\" Sun exclaims, something folded over his arms. You squint at what he's holding; a towel, and more comfortable, clean clothes. \"Feel like coming and sitting at the table? Or would you rather take a shower first instead?\"\nYou think about it for a long, hard moment. You're hungry, but you're also gross. A glance back towards the bathtub is very tempting, but the rumbling in your stomach is also persistant. \"Give me a second. I'm trying to decide between food or hygine.\"\n\"You can have both.\" Sun offers, holding out the offerings of clean clothes and the towel. \"Run a bath and I'll bring it to you, or slide it through the door. Whichever suits your fancy.\"\nYou groan. \"Sounds like you're trying to spoil me.\"\n\"It's in our design!\" His sunrays spin once, and lower with a smile. \"...And we did just watch you upcheck a peanut butter sandwich.\"\nFair enough. You take the clothes and towel into your arms, throwing them on top of the counter and ushering him out with a wave of the hand. \"Okay, get out. Shoo.\"\nHe salutes you in the doorframe. \"Yell if you need me!\"\nThere's pounding in your head when you lean over to turn on the faucet, so your response is a aknowledgment that comes out more like a zombie-fied groan.\nThere's a chuckle as the door softely shuts behind you, but you don't have the energy to call him out for it, and you start to undress. The water fills up to a comfortable level when you're done, tossing the dirty clothing in the corner (oh, Sun hates when you do that) and testing the tempature. It's hot, but just enough that you can comfortably sink into the water.\nYou just kinda....sit there.\nThe hot water is very nice. Muscle aches and preassure in your skull still lightly throbbed, but melted away a bit at the steam. You still felt hungry, dehydrated, and you didn't have the energy just yet to grab the soap and shampoo, but taking a deep breath helps the nausea disppate and help you finally start to wake all the way up.\nAt some point, you take the effort to pour a little body wash into the water around the faucet to hopefully start some bubbles, but they're scarce and don't really do much except make the water a bit cloudy. Welp. At least it smelled nice.\nA knock on the door causes a small twinge of headache pain, but you muster out a answer to the waiting figure on the otherside. \"Come in.\"\nThe door creaks open, two sunrays are peeking through the crack while a robot arm holding a soup bowl and spoon slowly come into view so carefully it's almost comicall. You fight back a snort as Sun's voice rings around the corner. \"Delivery! I'm not looking, promise!\"\n\"Hypocrite.\" You call outloud, and this time you don't hold back the snicker when the door opens wider, Sun fully walking into the bathroom with his head spun all the way around in some freakish 180 degree turn. How does he even walk straight looking backwards?\nHe manages, finding the floor next to the tub and sitting down on the floor mat. \"It's the thought that matters! And I would like to remind you that I am holding some yummy soup that will maybe definatly hit the floor if you decided to use that terrible nerf gun on me!\"\n\"I won't shoot you.\" You snort.\nSun's head rotates back around to his proper position, and smiles at you. \"Oh good. I wouldn't have dropped the soup anyways.\" It's a coy, teasing grin sent your way as the bowl is set on the side of the bath. \"Chicken soup is supposed to be good for this sort of thing. It's cool enough to hold, but still be careful.\"\n\"Yeah yeah-\" You take a hold of the bowl, careful not to drop it in the bath (which, honestly, would have been hilarious) and take a tentive sip from the side, forgoing the spoon. It's hot, but not hot enough for the bowl to burn your hands. The broth and noodles go down very quickly, and you can feel your body start to pick up energy from the promise of something in your stomach. \"Thank you for the soup.\"\nSun nods, pulling out something with his other hand, second hand going to his pants pocket. A glass of water you didn't even notice is set to the side, and your phone is pulled out from the fabric. You don't even ask, but grab and gulp the water in a frenzy of hungover dehydration as the animatronic taps your phone to life. \"You got a missed call while I was making food.\"\n\"Oh, yeah?\" You talk inbetween gulps, returning to your soup. It's nice to sink into the water and just drink from the bowl, really becoming one with the liquid here. \"From who? What was it about?\"\nSun looks up, quizzically. \"Oh! Was I supposed to answer it?\"\nYou slurp a noodle.\"If you want? I really don't mind.\"\n\"Reducing me to an answering machine, I see.\" He grins. You just slurp a noodle again, but this time obnoxiously louder. He taps a few buttons. \"It's from your classmate, Brianna. Looks like she left you a message.\"\n(Oh! So that's what her name was!)\nHe turns the phone towards you, handed out just not over the water so you could reach out to accsess the thread, but you flinch at the screen's brightness that burns your eyes. Your face must have twisted with your headache, because the phone is pulled away and Sun talks quieter, offering. \"May I?\"\nYou mean to say 'yes', but it comes out more like a grumbled zombie groan plagued with the start of a migraine.\n\"There's pain killers in the cabinet. I'll get them for you in a moment.\" Sun smiles, turning the phone back to himself and tapping to the message thread. A second passes where he scans the scree, and his smile stretches awkwardly. \"Ah.\"\nYou blink. \"What?\"\nHis smile turns increasenly more nervous, hesitation in his voice as he starts his sentence off with a awkward laugh. \"She, ah, asked how your-\" Sun pauses like he was inwardly debating on the correct word. \"-adventures with the....'sexy, tall, robot clown' went, last night.\"\nYou almost spit out your soup, swallowing the last gulp hard. \"Oh my god.\"\n\"There's also some more...things she asked.\" Sun puts the phone face down on the floor. \"And I, well, I do not think I can ask those outloud.\"\n\"Oh my god.\" You snort, and almost choke on a noodle so bad you're forced to lean over the side of the bath, set the near-empty bowl on the floor just so you can catch your breathe from the laughter that's bubbling up in your throat. \"Oh my god, ha! That's-that's hilarious. Holy shit!\"\n\"Well, I'm glad you found it funny!\" Sun gasps, hand over his chest ands so shocked that he doesn't even scold you for the profainity. \"I'm disturbed! Offended! You were drunk! What kind of robot do they think we are?!\"\nThe laughter hurts your head, but you don't care at the moment. \"A sexy one!\"\nHe makes a noise that makes you laugh harder, and points accusatory to you. \"You stop that!\"\n\"Okay! Okay-\" You take a deep breathe, calming youself. Partially because you don't want to be flustered yourself, and partially because you didn't want that nausea you've been keeping at bay to steadily creep back up to you. \"Okay. I'm fine. It's fine now. But it's funny.\"\n\"What nosy, personal questions.\" Suns tuts, sliding the phone away from him. \"I think I would have preferred answering your questions from last night instead.\"\nOh, man. You had actaully forgotten about that. \"Hey-\"\n\"Feel any better?\" The change in topic is abrupt, but the shift in his smile from nervous to teasing is just as much whiplash. \"Ready to get out yet? Or would you rather sit here for a while and pick-up where we left off last night?\"\nYour face sours, frowning at him and sinking into the water. \"I'm dying. I'm dying in soup and you're going to mock me while I'm dying.\"\nWithout missing a beat, he stacks the dishes to the side, his other arm reaching back to pull the towel off the counter. \"I'm sure you'd make for a tasty soup, but I'm afraid I'll have to save you for later.\"\nYou groan something incoherent at the joke, but quiet any retort you had ready unless you wanted to be met with the same wit. He helps you stand up, (turning his head away backwards again, though it's more out of respect than actaully avoidance by now) and you're wrapped in the towel and guided out of the tub by the time he picks up the dishes, the dirty clothes you left the corner and moves to the door.\nHe pauses in the doorway with upward turned eyes and a mischivious grin. \"I'll be in the living room, unless you'd like some help-\"\nYou throw the towel at him, to which Sun fake-screams at a super high pitch, dodges the projectile and darts out of view.\nSomething tells you that you were going to get teased about those questions for a long while.\nThe aches and nausea has disapated now that you were clean, relaxed and had something light in your stomach, so it's easier to get dressed in whatever he brought you. Lounge-wear, sweatpants and a t-shirt good enough for a lazy day. You pick up your phone off the tile before you forget it and flip it back over to face the screen.\nIt's still open on your classmate's message thread. Squinting as you turn down the brightness, you glance over the incoming texts and yeesh, oh man. Wow. Yeah, these were some very...interesting questions. But hey, it looks like she score a date with that bartender robot after all! Good for her.\nIt is with your almost horror, however, that Sun has accidently taken a close-up selfie of himself and sent it into the message thread with no further context, probably by accident. Robot fingers weren't the best to work with on touch screen phones. You can already see the chat bubble popping up for your classmate typing.\nProbably best to avoid any misunderstanding. With a quick tap of your fingers, you send two pictures (one of a selfie of you and Sun from a previous date, another one you took of Moon and yourself during a movie night) and in your hungover state, try to give the brief explanation that it was in fact, a friend and roommate who picked you up last night, and that none of her previous questions apply.\nYou even ask her how her night with the bartender went to keep up the solid conversation, but her next message flat out ignores it and is typed in all caps.\nThe message reads: 'YOU HAVE TWO OF THEM??!?? 😳😳😳'\nActaully, you know what? Let's just back out of that message thread and make it a problem to deal with later.\nSun is in the living room just as he said he was, and he meets your gaze just as you flinch from all the light coming in from the balcony glass windows. He looks up at you from the couch, book in hand and meets your scrunched expression with a bright, chipper look. \"You're looking brighter!\"\nYour reponse is a stuck-out tongue and a 'blegh'. \"Where are those painkillers you talked about?\"\n\"Here.\" He sits up, gesturing towards the coffee table so you walk about the sofa. A fresh glass of water and two small ibeprofen sit on a napkin waiting for you.\nYou snag it, downing them quickly and sighing as you place the now half-empty glass back down. \"Great. Soon I'll only be half dying. Let me in. \" With all the grace of a zombie, you flail your arm in Sun's direction until the animatronic, confused, arms are raised and you all but practically plop into his space, both of your legs resting on the rest of the couch. \"Oof.\"\nHe's careful adjusting so you're inbetween his arms and resting on his chest, the book situated in front of you for his viewing while you shimmie your phone back out of your pocket and click on all the notifications you've missed. You bypass a couple of social media links, a news report and a couple of game notifcation as Sun hums. \"How do you feel?\"\n\"Better. Mostly.\" You scroll through your feed with mindless effort. \"Did you add more games on my phone? My notifications are all stacked up.\"\nSun shys in on himself. \"Perhaps.\"\nYou find the one most recently used, and it brings you to a higher level in a mobile game you've ever seen a human person do. \"...Candy crush? You're a robot. It takes no effort to calculate the right move to win.\"\n\"I like the animations! Some of them look like Sundrops and Moondrops, too\"\n\"I'm going to beat your high score.\"\n\"Then I'll watch.\" Sun speaks softely, and he's comfortable to lean into the crook between his torso and his arm, curled up with your phone close to your face on the lowest brightest setting and the shadow of his book protecting you from the light that shines in from the balcony.\nHalloween was a favorite holiday, if you couldn't notice from the absolute takeover scary and pumpkin themed decor had over your neighbors lawns and in the front window of every store you pass by on the drive to work. One of the best holidays, something to look forward to all year, and stores know this, jacking up heavy prices of candy for trick or treaters for the special night.\nFazbear Entertaient is no different. The moment the calender struck October 1st, Halloween decor started appearing in every neon hall and nearly everything was spook themed. Even the band members received 'make-overs' or costume changes to help with the Halloween Spirit.\nChica was a vampire, her hunger for pizza now a thirst for blood! (Or so she likes to loudly proclaim) while Roxy was a werewolf hunter, which, you find terribly ironic but she looks great in the typical lumber-jack style with a trench coat, it almost reminds you of pirate themed aesthetic, but you don't bring that part up.\nFreddy is a wizard. Really. He's a wizard, complete with wizard hat on top of his original top hat and sparkly cape behind him. He looks goofy, but that was the goal, and the kids really love when he waves his 'magical hands', pulls out candy from his cape (which thankfully hid his chest compartment) and handed them out.\nMonty is a zombie, complete with fake painted 'stitches' across his body with new paint that makes some parts slightly discolored from the rest of him. You wouldn't think that he would have liked playing the part, but turns out the Gator actaully likes to jump out and scare people, hands out and threatening to eat little ones as they run, giggling.\nAll their costumes were cute!\nYou, on the other hand, were quite surprised when you clocked in for your shift, and a staffbot rolls up to you with a brown paper bag, shoving it into your hands before giving you a quick thumbs up and rolling away.\nInside, to your exact measurements, is a costume that looks like a space themed fairy-type of thing that looks more like it would be suited for a child who couldn't decide what to dress up as rather than for an employee with unreasonable mangment. It even came with shoes.\n....actaully, you shouldn't be surprised. Ever since your 'promotions, you should have seen things like this coming. You were hoping you could get away with just the bear-ears.\nYou change in the employee break room before heading out, and the Daycare, as always, is very busy when you arrive.\nYou hear them before you see them, children laughing as the Daycare Attendant chases them throughout the jungle gym, dark shapes through the plastic parts until they come rolling out of the tube slides. Even the tykes were in costumes, most of them onsies their parents picked out. Adorable.\nSun's costume change was interesting: a long black cape over his usual clown attire, and two painted devil horns on the appropriate spots on his sunrays. The clown ruffles were missing, and his colorful pants were replaced by puffy black pants, a tight shirt that made his chasis look like a skeleton's ribcage and with long sleeves with bones on the fabric as well.\nThe ribbons on his wrist remain, and so do the shoes with the bells. There's a hood on the back too and something attatched to his hip, but the hood is down because it would never fit around his rays, and the object is obscured behind the cape.\nNo where near as colorful as the animatronic usually liked, but he didn't seemed bothered; the kids were having a hell of a time with his new 'scary' apperence.\nYou take your place at the security desk right as the first parent arrives to come check out their kid, and Sun bounds up right with the toddler in his arms before you even call for him. After formalities, the paperwork (not really nesssasary, since robots can handle all the stuff in their brains anyway, but it makes you feel useful) and waving the two off, he turns to greet you.\nActaully, he gives you a full look-over, hand on cheek and humming. The displeasure on your face is plain, so you know his voice is teasing when he speaks. \"Well, don't you look like a doll-!-\"\n\"Shut it.\" You huff, and amusement flashes across the animatronic's face, and you subconsioudly adjust the straps of the fairy wings you've been tasked to wear with a sour frown. \"I didn't choose the costume.\"\n\"Really! Because I think it suits you very well-\"\nYou wack him with the clipboard, and Sun fakes hurt. \"Boo. What are you supposed to be?\"\nHe grings. \"I have no idea! A demon, I think.\" Sun hunches over, fingers curled to mimick claws and turns from you to yell out towards the gaggle of children who were peering over at you two curiously. \"Maybe the kind that eats little boys and girls that don't brush their teeth!\"\nA small collective gasp, a few giggles, hiding their faces away back into their coloring books as Sun gives them a final lookover and return back to you. \"Whatdya think? Scary enough for ya?\"\n\"Terrifying.\" You smile. \"What am I supposed to be doing today? Aside from checkouts.\" You look towards the children, not many left.Looks like most of them have already been picked up.....That's...earlier, than usual.\"\nSun claps his hands together. \"It's Halloween! Families come to pick up little ones early to start trick or treating! The Daycare will be closing a few hours early tonight!\"\nOh, good. Less human interaction for you then. You sit yourself at the Security desk, eyeing the suspisouly full bowl of Fazbear themed candy that's been placed there. \"Nice. Are these free for the taking?\"\n\"Not quite yet.\" A metal hand clasps onto your shoulder, fingers tapping on your clothes. \"And you know what? I could really use a little fairy helper right now-\"\n\"Sunny-\"\n\"Trick or Treating saftey! Super important! Some of these kiddos are trick or treating for the first time ever tonight, lets do a test run!\" He leans back away from you, giddy and chipper as usual. Pretty sunny guy for being a demon.\nYou raise a brow, hand inching towards the treat bowl. \"So...you want me to play the person at the door?\"\n\"Correct!\" Without missing a beat or moving his gaze, he gently slaps your hand away, and you pout as he continues. \"I'll help encourage them, you just pretend to be 'answering the door' and give one piece of candy when they're ready-don't give anything with peanuts to Lewis, you see that one? Little one, blue dinorsouar onsie, yes. Good, good-and you can have any remaining candy left over!\"\nThat bit caught your attention. \"Can I have some now?\"\n\"It would make the kids sad to see you eating candy when they're only allowed one.\" Sun's lowers, smile softening. \"So no. You cannot.\"\nYour response is a wrinkled nose and a frown. He pats your head in a mock show of empathy and tuts at your impatience.\nThe kids are giddy when Sun gathers them and tells them the rules as you prepare yourself to be the 'door greeter' in this little scenerio. For this, you crouch underneath the security desk where you can't be seen, await for a child to knock on the 'door' (aka, the wood of the desk) before popping up and going about the scenerio. It's silly, and a few onlookers that are leaving peer through the glass at your shenanigans, but you're smiling anyway.\nThe first knock comes, two hits on the wood and you pop out from the behind the desk. \"Hello! And what are you supposed to be!\"\nThe child, a boy with glasses too big for his face and wearing a skeleton onsie, timidly holds out his hands, eyes big and expectant. He has a slight lisp when he talks, excited. \"Trick or Treat!\"\nYou shift your eyes to Sun, and siliently the animatronic returns your knowing gaze. Well, he didn't really answer your question, but it's the enthusiasim that counts. \"Oh my, here you go.\"\nYou place a piece of candy in his palm, and the boy immediatly turns to run off.\n\"Now what do we say?\" Sun calls out to the boy's retreating form, half sticking out of a sliding tube.\nThe other children watch intently as the boy freezes, scuttles back out of the tube and running up to you. \"T-thank you.\"\n\"Veeeery good job!\" Sun praises, and you smile at the child to emphsize his praise. \"Now what do we do?\"\nThe boy answers, his voice joined by the choir of other children answering with him all out of synch. \"Go back to our parents.\"\n\"That's right! You're a very smart bunch of fellas, aren't you?\" Sun, who stands across the length of the room that would consitute a mock distance of the sidewalk to a front door, nods in approval as the candy holding tyke runs up to him, pinching the little one's cheek and cooing. He played the 'parent' while you were the door greeter, and you watched as he clapped and praised the children for following such a good example before ducking back underneath the desk.\nThe animatronic gently presses another child in your direction, and the process repeats.\nIt's cute and silly. They're all very young, more than likely this will be their first Halloween going door to door, and nervous at first when they approuch you, knocking on the desk and looking askew when you come out from hiding. That is, until their good manners and saftey behavior is rewarded with a piece of chocolate or jolly rancher, and their face lights up.\nYou occasionally have to break character as parents arrive to check out their children, the group dwindling little as the candy in your bowl starts to deplete. Some of them are restraining a laugh or smile at your costume, and possibly Sun's, but appreciate the 'practice' before the actaul trick or treating.\nThe next child is the quiet one. A little pigtailed girl that never talks, in an alien themed costume with a Moon plushie that's clutched tightly to her chest.\nThis girl never liked Sun, scared of him, so he doesn't push her too much as he gestures for her to approuch you. \"It's okay, it's just practice! You get a piece of candy for trying!\"\nShe doesn't budge from her spot, notably a distance away from the animatronic. Sun's smile doesn't faulter, but you know it probably sucks for him when this happens. \"The meeting spot can be where the coloring books are, you don't have to come near me, okay?\" His voice is soft, lowered, unlike him like he was borrowing the tone from somewhere else. \"Would you like to try?\"\nShe hesitates, looking back and forth between you and the jester, before approuching in small, timid steps. You try to appear as nonthreatening as possible . You don't even hide this time, just smiling as she approuches the desk. \"Hello, there.\"\nYou see her tense up, and know it's already a failed attempt before her eyes get wet. A knock on the desk isn't even attempted, and the girl takes off, Moon plushie and alien antienna and all, towards the coloring books.\nYou have half a mind to go after to, comfort her somehow, but Sun is by your side quickly, calling out to the toddler instead. \"That's alrighty, starlight! You tried and you were very brave, good job!\" His praise feels esasperated, and the animatronic turns to you, head lowered to whisper so the other children. \"That one's a touch sensitive. Best not to push it.\"\nHe's right, but you still feel a bit guilty. No time to feel it for long, because a gaggle of parents appear at the doorway and your attention is torn away to check out the remaining children to their appopriate gaurdians.\nSun amuses the remainder of the children with cartwheels and handstands that make his cape fly wildly until the children, one by one, are checked out and the Daycare is growing empty.\nThe hours are shorter because of the holiday, so the automated lighting system is supposed to go off earlier than usual. Parents and families are clearing out from the Pizzaplex, save for a few lingering souls, one of which still sits by the coloring area, scribbling on a page underneath one of the toddler tables in quiet contentment.\nYou frown, and pull out your phone. \"The Daycare closes in five minutes.\"\n\"Her father must have forgotten the holiday hour change.\" Sun interjects, quickly gathering up all the little plastic candy wrappers the children threw onto the floor and tossing them into the garbage bin, muttering about keeping the place clean. \"Good fello! Busy quite a lot, I think. He'll show up, no worries.\"\n\"The lights will go out.\" You say, and this time, there's no worry in your voice.\nSun salutes you, saying nothing. But he does tug at your wings as he passes by, and you try to step on his cape to make him trip and fail, causing him to snicker as you stumble.\nAs time would have it, the lights go out at the exact time Naptime is scheduled, but the Daycare is no longer taking check-ins for the holiday and is officially closed. Funny how the shortened hours would eradicate the Naptime schedule from the end of the work day, but there was no time for sleep on Halloween's Eve.\nYou don't flinch anymore when the lights go out, but you still look up from your phone and desk towards the girl that has yet to be picked up. She's not coloring anymore, instead curled up against a giant plushie and picking at the threads from her own plush.\nPoor thing. You consider getting up and going to try and talk to her-\n-but a blur in the corner of your vision comes around to your front, something silver colored and shiny pressing up against your neck. You freeze, instictivly, at the sycth's blade up against your skin.\nA low, familier voice whispers next to your ear. \"Slow down. You'll get sick.\"\nImmediatly your face deadpans, and your hands drop the series of candy that you oh-so-weren't-totally-stealing from the candy bowl. \"I'm an adult, Moon. I can have as much candy as I want.\"\nMoon says nothing, but you can practically hear the grin as the plastic, wobbly blade drags across your neck harmlessly as the animatronic makes a 'scccchhhh' sound to mimick slitting your throat.\n\"Dying. Dying super hard. Blood gushing everywhere right now..\" You jest, and the 'weapon' disappears, allowing you to spin on your heel and take the animatronic in fully. \"....The Grim Reaper?\"\nMoon stands there in costume, the same as what Sun wore, but the hood was up over his hat, and a toy scycnh that's more suited for a child in his grip. That must be what was attatched to their hip you didn't see earlier.\nHe looks...unbothered, and his behavior was playful. But then again, you've known the Daycare Attendant long enough that it was easy to hide a face when your face's default setting is 'smile.' \"Managment really didn't think the whole costume thing through, huh?\"\nHis eyes are white, the one on the darker half of his face darkening to a red hue, only briefly. He holds the scyth up, pulling down one end and releasing it so it wobbled like rubber. \"Try not to look too much into it.\"\n\"As long as you're having fun.\" You offer a smile in comfort, and Moon's response is 'stabbing' you through the gut with the fake sycnh, to which you snatch from him and bonk him with it as he snickers. \"You dolt! There's a kid still here!\"\n\"I know.\" Moon is unaffected by the plastic bonking, unmoving and plain faced as it hits him right between the eyes.\n\"Well?\" You pull your 'weapon' back and glare at him.\nMoon has no pupils at the moment, but you feel his gaze drift up and down your body before meeting your own again.\n\"Moon.\" You stress.\n\"Nice costume.\" He chuckles, fingers coming up to pinch at your wings. The straps press against your skin as he pulls them, humming like one was inspecting a caught butterfly. \"Can't have you flying away though-\"\nYou bonk him again. \"Stop that.\"\n\"Hurtful\" He's snickering. He's mocking you, damn him. \"I let you get away with too much.\"\n\"Okay, now you're just being mean-\"\nHe catches your next hit, your hand in his palm, curled fingers enclosing your own. A frown on your face, you open your mouth to question it before you pause. He's not looking at you, rather, peering off towards the other end of the Daycare, and you follow his vision.\nRight as you look over, you spy pigtails dart back behind one of the cylinder towels. Moon drops your hand, and you keep your voice low when you talk to him so she can't hear. \"You're supposed to be her favorite. I don't know why she hasn't come over to say hi to you, yet.\"\nMoon hums. \"Because the adults are flirting.\"\nYou whip your head back around to him, face hot. \"We are not 'flirting'!\"\nCasually, he adjusts the wings back into proper position. \"Sure.\"\n\"We're not!\"\n\"Okay.\" He taps the corner of his faceplate, near his smile that's been teasing the entire time.\nYou pause, hand coming up to wipe your mouth. He leaves you there while you scrub at the space around your lips furiosuly until you're convinced he only tricked you into thinking you have chocolate around your mouth just so he'd get the last laugh, but he's approuching the girl before you can retort.\nYou huff at him, but settle back into your spot against the security desk, where the light switch remains nearby and you have a full view of the scenerio. You won't need to use it. You only remember it's there for your own memory.\nPulling out your phone, you check the time again and a few messages and emails wishing you a safe and happy halloween from a few stores that want to capatilize on the holiday. More than likley, the father of the child will arrive at his usual time to pick up the girl, which is typically an hour before closing, but due to the shortened hours of the holiday, would be another thirty minutes from now.\nSo you eat candy and pass the time. You don't mind it, helps you organize your notes. Occasioanlly you'll look up from the desk out of habit and see the animatronic sitting criss cross on the floor, hands in his lap with the little girl who's too afraid to interact with anyone else.\nIt's funny, you think, as you pop a smartie in your mouth, that the little girl afraid of everything else's favorite is a robot with a old reputation for blantant murder.\nShe's showing him a drawing you can't see from this distance, and Moon takes it in his hands and says something softley that you can't hear. You smile, and return to your phone and candy. He's come a long way.\nIt's a few minutes later as you close out of all of your tabs do you feel a presence around you. You look up, Moon standing a few feet away, cloak fully closed and hood pulled over so only the bottom half of his face is visible, with the glow of two white eyes staring at you from the dark.\nThe moment you notice him, he shuffles forward, except it's weird. Like penguin walking, in fashion that reminds you that underneath the 'grim reaper' costume, he's still a freaking clown.\nYou raise a brow. \"Wha-\"\nHe cuts you off. \"Trick or Treat.\" You furrow your brows, squinting in confusion, and so he repeats himself again. \"Trick. Or. Treat.\"\nYou're about to jest that robots don't eat candy so you'll have to take trick instead, but a small shape catches your sight. Hands, small and shaky, push out from the bottom of the cloak. The body attactched to them are still hidden by the fabric, but they are cupped and outstretched towards you.\nYou understand instantly. There's not a lot of candy left in the bowl since you've been eating them all, but there's three or four pieces left, which you scoop up and gently plop into the child's palms. \"Bravery gets a reward, doesn't it?\"\nThe child only makes a positive sniffle, but the hands pull back into the cloak and you immediatly hear the sound of a wrapper being torn open.\n\"Thank you.\" Moon grins.\nThen, much to your amusement, you watch as the animatronic quite literally turns on his heel, and waddles all the way back to the designated 'safe zone'. It is, by all accounts, the funniest thing you've seen all night and takes a considerable amount of effort not to laugh at the retreating figure penguining away.\nThe father arrives a few minutes after that, and the girl is very easily presuaded from that point to come out from her hiding. Your suspisions were correct; the father simply didn't realize the Daycare's hours were working on a holiday schedule, and apologized greatly for the trouble. You're the one to reassure him that it's fine, you're going in the daycare all night anyways, and that his daughter caused no trouble.\nMoon does not stand with you at the door. He still has....trouble with older adults sometimes. So he stands as a cloaked silohellte at the far top end of the jungle gym, cloaked in shadow save for his eyes, and his hand when he pulls it out to wave back as the girl waves at him once, and they're gone.\nThere. The Daycare is offically closed and empty. The Pizzaplex in full will be following suit soon, and you can relax.\nThe sound of bells jingle behind you as your lock the exit. \"You're going to stay.\"\nIt's less of a question, more like a statement, but you give him a response as you turn anyways. \"Yeah. I didn't have any Halloween plans, so I agreed to a full evening and night shift. I get bonus pay for it being a holiday.\"\n\"We could do scary things.\" He starts, mischief in his grin. He walks around you in a circle, oddly and dramatic in the fashion that a jester knows best, whipping the other side of your head as you turn to and fro. \"I can show you scary things. Tell stories.\"\n\"I can show you scary things and stories.\" You refute. Pulling out your phone, Youtube and a few streaming services are pinned to your homescreen. \"Never had a horror movie marathon, have you, Starboy?\"\nMoon pauses, and thinks for a long time.\nYou narrow your eyes at the silence. \"If you joke that your life is a horror movie, I'll be disappointed.\"\n\"Not anymore.\" The animatronic spins his head, once, twice, as the wire comes down to attatch. It hooks onto his back, which is hilarious to see because you realize the cloak must have a small hole cut out the back for that to even work.\n\"Our room. Comfortable there.\" His hand extends towards you. \"Feel like flying, fairy?\"\nYour nose wrinkles, taking his hand and scoffing at his amusement. \"Okay, that's it, I'm taking the costume off as soon as we're up there.\"\n\n“It’s gonna rain. We won’t make it in time.” Thinking of the dudes getting caught in the rain 👀 :&gt; - clara-ace on tumblr\n\nSince their...seperation, from the pizzaplex, the Daycare Attendant has been a mixture of feelings towards the outside world.\nThey weren't alien to it, really. It's hard not to know about the outside world when the entire world's internet was inside your head and you had more memory, no matter how damaged it might be, bigger than what would constitute a human brain anyway. The Daycare Attendant is well aware of the outside world, customs and social rules, places and so on.\nExpereinceing these things first hand, however, is a completley different matter entirely.\nYou have been out doing errands for hours longer than you should. The reason: you brought the Daycare Attendant along with you, and Sun is nothing but enthusiastic to interact with every single living being he saw, human or otherwise, which led to some really awkward conversations with humans surprised to see an animatronic act so openly, and the servant robots stare at their robot brethern that seemed to be walking around with much more freedom than they had yet.\n\"Sun, come on!\" You're grabbing his wrist, pulling him away from the pet store window (he lets you, of course. You wouldn't be able to otherwise, but he still makes a pitiful noise as he's torn away from kittens and puppies) and steer him towards the bus stop. \"It's the last run, we're going to miss it if we don't hurry!\"\n\"Do you think it's good idea to take the bus again?\" He asks. \"Got quite a lot of stares on there, very rude! I don't think the bus is very nice.\"\nYou shoot him a look over your shoulder. \"Wasn't that your idea? We took the bus because you don't like riding in the car.\"\n\"I still don't like the car.\"\n\"Then we take the bus!\n\"We've decided we don't like the bus either!\"\nYour hand has fallen from his wrist, but you don't worry about him fallen behind as you walk briskly; his legs were longer, took wide strides, and he's gotten into the habit of hooking fingers into the cease of your hoodie so he doesn't loose you.\nYou briefly joked before that it reminded you of how children hold guiding hands. Sun replied by saying it's more along the lines of keeping a dog on a leash.\nThunder rumbles a bit above you. The clouds are starting to close in. You didn't bring an umbrella, but at least you wore layers today. \"Well, the bus is what's gonna keep us out of the rain. I don't feel like walking home all soaked.\"\n\"Aw, really?\" Sun's voice is teasing. He doesn't appear bothered, or surprised by the sound of an incoming storm. He hasn't since that day on the balcony of your apartment. \"I could act as an awning, if you like!\"\nTo emphsize his point, he cranes over you, arms extended and faceplant pointed downwards with a playful style like it was him and him alone that could protect you from the rain soon to come. A few droplets land on your shoulder, one of his sunrays and drips back down to your nose. \"Stop stalling!\"\n\"Just a jest!\" He laughs, and allows himself to be pulled along further down the street, narrowly avoiding a wide-eyed couple. \"We both have hoodies! Shoes! Smiles! A little rain never hurt anyone!\"\nYou scoff at him, walking at a pace thats just barely under a run. \"And what are you going to do if the sky gets too cloudy that the sun can't be seen?\"\nSun's chuckle sounds from behind you. \"Then you are definatly not taking the bus, even if you catch it. Wouldn't allow it. Don't worry, you'll still have an escort home.\"\n.....Of course. You glance at your phone, squinting at the time as a raindrop plops on the screen. \"It's gonna rain. We're not gonna make it in time.\"\nSun hums. \"I can see that.\"\nBefore you can process what he means, you're yanked back to a halt. He stopped allowing you to pull him, which means the momentum yanks you back the moment he stills, and you lift your head to question his stalling when Sun, smiling as ever, lifts a finger and points it to the street. You follow his gaze.\nThe bus-your bus, judging by the number printed on the side-is turning down the street, past the point where the bus stop would have been around the corner with windows full of people who were sitting dry and calmly out of the incoming downpour.\nAs if on cue, water droplets fall on your face, then more, until the space around you is in a steady, solid rainfall.\nYou visably deflate. \"Great. We missed it.\"\nSun's hands are extended out, water running off his fingers and faceplate. \"And it's not too cloudy too! What a delight!\"\nYou deadpan. \"Sunny...\"\n\"Yes, yes....\" A low chuckle, a metal hand coming around the back of your neck and pulling the hood of your jacket over your head, and around your shoulders so you're pressed against the animatronic's side. \"Best we start walking very quickly, hmm? Don't want you catching cold.\"\n\"Too late.\" You whine, as annoynaly as you can make it. \"Gonna get so sick I'm gonna be sneezing wads all week.\"\n\"Oh, sick? That means I can make you soup! I have a few new recipes I'd like to try.\"\n\"You don't need an excuse to make soup.\"\n\"No, but I do like to have an excuse to feed it to you.\"\nYou walk in pace with him, hands curled into your pockets and clothing pushed all the way up so no water slides down your clothes. Sun is the opposite. He doesn't even try to pull the hood up, not like it would have fit around his sunrays either, but walks rather chipper than what you'd expect a Daytime robot in the rain.\nHe's clearly enjoying the turn of events. Your lips press together in a thin line. Happy for him, it's nice to see him in a good mood. You're just a little bitter about being rained on it as well though. \"If you wanted the same expereince, you could have just stood underneath the shower at home.\"\nSun laughs lightly. Finger tips dance on your arm, his grip pulling you closer. \"I don't think this is quite the same as that! Unless, darling, you'd like to join me in there.\"\nYou whistle. \"Walked into that one, didn't I?\"\nHe nods, and steers you out of the way of a puddle. \"Afraid so.\"\nThe walk is ten minutes, tops, to the apartment complex. But it's double that time because Sun likes to walk slow, and he makes it up for you later when you're peeling off all the soaked layers at the door and he's gathering something warm for you to replace it with.\n\n'#6 “this is the guy?” seems like it could be funny' - Minisculecakes on tumblr\n\nIn retrospect, you kinda saw this coming.\nIt was a new semester in collage so you had a new set of classmates, some of which you recognized and most of which you didn't. The best thing about collage is that there's no need to introduce yourself to your classmates, you're perfectly fine being left to your own devices; most people prefer it that way. So you bring your earbuds when the proffessor isn't talking when writing notes or working on your assignment, usually the universal 'leave me be' sign that everyone tends to respect.\nExcept this one guy. Sits in front of you everyday, always turns around to talk to you at the start of every class and has no quarrels trying to get your attention even when you're clearly just trying to keep unnoticed here.\nYou're friendly to him, polite even, so you don't tell him off when he nudges you to take out your earbuds to ask you what's it like working at the pizzaplex. The jacket must have peaked his interest, and you don't mind giving him a surface level description of your job. You just wish he would be more mindful when you're trying to write the same sentence in your notebook for the last ten minutes.\nHe's fairely easy to avoid outside of class. That is, until the professor assigns a week-long project and assigns team members, to which you and your new classmate pester are now apart of. That's how he gets your phone number for information sharing, and that's how he starts following all of your socials. Cursed be contact scynching.\nThe other two members of your group keeps things proffessional, but this guy was friendlier. Maybe a bit too friendly. He sends you things a little too comfortable for someone having known each other for a week or so. You don't mind making new friends; it would be nice, actaully.\nBut you don't think that's what this guy is looking for. Asking to meet up somewhere to discuss the project without the other members is suspisious enough, but you can't think of a situation where a new potential friend would send you shirtless snapchats asking if 'you're up' at 2AM.\nFunny enough, you recieve this damnable picture in the middle of an overnight shift, and there's a clicking, metal on metal noise as your animatronic coworker hangs upside down from you, slowly spider-maning down on the wire as he looks down at your phone screen.\nMoon makes a noise that's simular to clicking one's tongue in humans. \"Interesting way to spend working hours.\"\nYou look up at him, a that rotates a full spin so it's upright and inches from your own, and deadpan. \"Har har, very funny. It's the person I was talking about earlier. The classmate?\"\nHe hums in aknowldement. You talk casual things sometimes when you're working, telling him about your day and him to you. Moon tells you about how he's remodeled the nap area for his return and complains that the allergy list for the children are outdated, and you tell him about your assignemtns and the classmate that seems to have taken a liking to you, against your will.\nA metal hand lowers, gently grabbing your phone and turning it upright in front of his view. The glow from the screen is comical on his faceplate as red eyes and white pupils scan the picture dully.\nThe phone lowers. Moon's face is twisted into something of a grimence. \"This is the guy?\"\n\"That sounds mean, c'mon.\" You snatch the phone from him, clicking off the image and pocketing the phone. You don't really want to reply, you'll use 'no phones on shift' rule that you made up as an excuse or something. You return to your task at hand; pushing the cleaning cart down the hallway to your next spot. \"He's fine. Overly friendly, but fine.\"\n\"That is not friendly.\" Moon is 'moonwalking' in the air following you, upside down so his legs are upwards while his face is level with you. \"That is flirting.\"\nYou sigh, and it echoes off the walls. \"I know, I know.\"\n\"Do you like it?\" He asks. His tone is half teasing, half serious. \"The attention.\"\nYou send him a look. \"Oh, please.\"\nHe snickers. \"Just a question.\"\n\"I'd prefer he'd keep it proffessional.\" You park the cart, unloading a couple trashbags down a trash chute in the wall. \"I get more than enough attention from a certain Daycare Attendant coworker who's far from a 'proffessional relationship' too-\"\n\"Tell him.\" Moon cuts you off, gently. \"To back off.\"\n\"I did.\" You emphaize your tone with a final heave of a trashbag, shutting the slide door behind it. \"I was really polite about it, and he seemed understanding, you know. At first at least. Still kinda off, though. I don't want to be too harsh about it because then it's going to make the whole project really...awkward.\"\n\"Lie.\" Moon's arms hang down until they grip the edge of the cart, using it as a guide as you begin to push it further down the hallway. His head tilts, faceplate blocking your view. \"Say you're married.\"\nYou deadpan at him. \"Why? And with what ring?\"\nHis expression breaks out into mischivious grin, fingers raising up and going into the fabric of his hat. You stop, pulling back as Moon pulls out a small package from the confines of his hat, and blink at the ringpop thrust in your face.\nYour bewilderment turns to amusement, and snatch it from him. \"Hilarious. How long have you had that stashed in there just waiting for the opurtune moment for a joke?\"\nMoon's head does a full rotation. \"Is that a yes.\"\n\"Moon.\"\n\"A while.\" He lifts off the cart, upwards on the wire until the animatronic lands softely on the carpet besides you. For a tall robot, he doesn't make any noise. Even the bells are quiet when he wants them to be. \"Kids like candy, and magic tricks. I can summon candy at will.\" He raises his hands, wiggling his fingers. \"Magic.\"\nYou tut at him. \"Can Moondrops give kids cavities?\"\n\"Not my problem.\"\n\"It is if the parents complain about it.\"\nMoon's voice starts in rebuttle, but is cut off by the telling sign of buzzing. You pause, hands searching in your clothes for the vibrating phone and bringing it out, squinting at the words on the screen that's a stark contract to the dark lighting in the hallway. Your classmate's name pops up along with the default profile picture. A couple of notifcations tells you he's been trying to text you the last few minutes, asking if you were up for a late night chat about 'homework'.\nYou squint at the audacity of it, and move to let it ring out in your pocket. \"I'm just gonna pretend I never saw it-\"\nMetal fingers over your own, tugging out of your palm. \"Give.\"\nYou tug it right back, careful not to answer the still-ringing phone screen. \"Oh yeah? What do you have planned exactly?\"\nMoon doesn't answer you, but something in his eyes flicker. The phone stops ringing as you furrow you brows, just about to put the device back in your pocket until you notice the screen was still lit. On the device, it shows you were in call, but no audio was coming through the speaker.\n\"Hi.\" Moon talks, seemenly to no one. His tone reminds you a little of how sour he talked when you first met. Friendly, if not in a bit of a sourly threatening type of way. \"It's very late.\"\nYour eyes dart back between the phone screen to the grinning animatronic, and gape.\n\nDid this fucker really just bluetooth answer your phone call-\n\n\"The boyfriend.\" Moon answers to something. Any attempts to hang up on the phone don't work, and the animatronic casually leans away out of reach, grinning, as you whisper yell and swat at his face like there was going to be some secret button that would end the transmission. \"Okay. Goodnight. Bye.\"\nYour phone screen goes dark. Moon's head tilts at a sharp angle, leaning back down as you stare wide eyed at what just transpired.\nMoon, non-chalantly, spins his head in a rotation. \"No more annoyances.\"\nPocketing your phone, you glare at him. \"You didn't-\"\n\"I did.\" Snickering, the wire lifts him up into the air, and he acends very slowly out of smacking distance. \"Now. I escape.\"\nIn the best way a jester could do after such a feat, Moon flies limply like a pinata down the hallway while you half-chase him, yelling while trying to keep the cleaning cart steady while you watch the animatronic chuckle and rotate like a corndog mid-air. \"Oh my god. What did you say?? What did he say?\"\n\"Oh, so sorry.\" He laughs, mimicking a cracking voice. \"My bad. I didn't know. So sorry.\"\nYou feel bad for lying, but you're also laughing too, so you can't feel that bad. \"Oh my god. What if he asks about it later? Do you know how awkward that is-\"\n\"Awkward is calling a classmate at 2AM.\"\n\"Moon, c'mon.\"\n\"Should have said fiance.\" Moon contiues to spin like a corndog. \"Would have been funnier.\"\n\"Moon.\"\n\n“You’re not going to settle for that. Not if I have anything to say about it.” Oooo this one sounds like it could make for some fun shenanigans~ Or something angsty? Honestly this one seems like it could go either way. &lt;3 - feralmoonlight on tumblr\n\n\"What happens to animatronics when they get decommissioned?\" You ask the question on a Thursday afternoon, in the quiet corner near the security desk that Sun leans back on. Children are playing in the jungle gym, and the Daycare Attendant's attention switches to you. You add onto your sentence. \"Like, does it mean you guys just go to a different location then here? Or is there a storage wing or some other location you go to if you're no longer working here.\"\nSun hums, voice chipper as ever. \"What a morbid thing to ask! Wrong too!\"\n\"What? It's a genuine question!\" You lean further across the desk. You highly doubt any children would over hear you at this distance, but your voice is low when you talk still, just in case. \"What? Is it a sensitive topic or something?\"\n\"We are deactivated and dismantled.\" Sun answers, tone much too full of default mirth for something so plainly stated. \"Sometimes, if we are recycled or repurposed, the memory will be wiped and the endoskeleton resuited.\"\nYour face must be some sort of slight surprise or horror, because the Daycare Animatronic's head tilts to you, saying nothing, but with the look of someone who just told a child that santa clause isn't real. You clear your throat, speaking casually. \"Isn't that....illegal?\"\nThe Daycare Attendant's eyes are upturned. \"We're Fazbear Entertainment property! All trademark and copyright rules apply.\"\nYou send him a look. \"Sentient robots have been gaining citizen ship and recognition as intelligence life in a lot of places, you know.\"\n\"I know! What a facinating time we live in, isn't it? We're constnatly living on the progression of history!\"\n\"So....\" You drawl out. \"It's...immoral. To do that, I mean. They can't just-\n\"They can.\" Sun's smile is sharp when it cuts you off.\nYour mouth curls downwards further. \"That's-\"\n\"Killing us?\" Sun chuckles when he says this, hand raising and tapping your nose with his index finger. He rests it there, just on the tip of your nose and grins at you. \"There you go, thinking we're people again. It's silly of you.\"\nSome child screams, and his vision darts momentarily just to confirm that it wasn't a scream of pain but rather one of distress because they got tagged 'it', before turning back to you. You're still staring straight ahead, processing his words even as he taps your nose the way someone would knock on a door to check if anyone was home.\nYour brows have furrowed. \"I don't like it when you say things like that.\"\nSun's two fingers are 'walking' up your nose, your forehead, and back down again, as if to amuse himself. \"Sure, thing. Won't mention it again, sweetheart.\"\n\"What are you going to do if they want to decommission you?\" You don't even register the nickname. \"Why can't they just, I don't know, let you go? Maybe not in this country but...automation rights are a thing now.\"\n\"Bit of a dreamer, aren't you? Moon likes that.\" The fingers 'walk' down to your chin, and Sun taps the bottom in the universal 'cheer up' motion he's done probably hundreds of times by now. \"Nothing we can do. We're robots. We'd be decommissioned.\"\nYou lean away from his hand, just a bit. \"So, you'd just give up? Be a hunk of scrap in a warehouse somewhere.\"\nSun says nothing, he makes a small 'hmm' of aknowledgement, hand still raised, head tilted at an angle.\nYour tension feels heavy, so you smile lightly and bump your knuckles against his own. \"You won't have to settle for that, not if I have anything to say about it.\"\n\"Oh, how bold!\" Metal fingers wrap around your own, a thumb running over the thin skin over your wrist in a mindless, casual carress. \"And how am I supposed to thank my darling savior knight?\"\nYou raise a brow at the tone. \"Sun, I'm serious.\"\n\"Oh, I can tell. I know, I know.\" His face never drops from the light heartedness, a light laugh underlying in his voice. \"We're getting used to hearing your spout your disagreeable, dangerous decisions.\" A thin smile, he watches your own drop. \"Those last few words was a bit of a tongue twister, wasn't it?\"\nYou open your mouth to retort, but you're inturrupted by a child's scream. Both of your gazes instictly dart to the sound's source; a pigtailed child crying while a boy wearing Monty glasses holds a beloved Moon plushie over her head. Sun makes a noise equivalent to a sigh, and lifts himself off the desk. \"Pardon, it's my turn to save the day!\"\nThe hand leaves you, and he all but bounds away to the scene, movement full fo whim and jestering behavior. There's a coldness in your fingers, so you stuff that hand in your pocket and lean back against the security chair, and watch.\n\n20: \"How long did you think that you could hide that?\" - Bittystream on tumblr\n\nTo be fair, you had done an excellent job hiding the limp you had so far.\nIt happened this morning. Routine schedule with a list of tasks and chores that required a cleaning cart's assistance to lug around all the tools and trash, except you got your wheel caught in the small gap at the entrance of the elevator, and your attempt to free it consisted of you pulling and pushing and praying to whatever was out there to dislodge the damn thing while profusly apologizing to the Pizzaplex goers behind you waiting impatiently for use of the elevator while you struggle.\nEventually, you get it dislodged. Yay! Unfortunatly, you twist your ankle when it pops out and you have to do some sort of ninja type of move to prevent from accidently being rolled over on. Only, you were a terrible acrobat, and now your ankle was throbbing and you didn't even have ibeprofen to help with it.\nSo! Power through it. You'll ice it when you get home. These paychecks won't earn themselves.\nYou don't allow yourself to limp because you don't want to get any stares or complaints from the families roaming the pizzaplex, or have any of the animatronics send you a concerned look (which makes you act particularly casual when Freddy comes around to say hi. The last thing you want to do is have the busy bear worry about you.) which means you're gritting your teeth and blowing air through your nose, but faking it until you make it seems to work.\nThat is, until you arrive at the daycare.\nYou bring a cart full of diapers, wipes and other important items for stock, the heavy lifting the last chore for the day but the one you were dreading the most. Sun greets you at the door, and behind him is a chorus of small voices that yell out greetings to you as soon as you walk in.\nFriendly bunch, they are. You're glad the Daycare Attendant has his hands busy with the kids, so if you needed to lean on the desk for a moment, you probably wouldn't look suspisious. Rolling the cart in, you wave to the gaggle of children that sitting on the floor, gathered for story time probably, before wheeling the cart towards the shelves-\nMetal hands come around your shoulders, stopping you in place. \"My, my! You've brought us so many presents!\"\nYou crane your head back. Sun's smile beams down at you, and you smile back. \"Yeah! Hope you like diapers.\"\n\"I sure do! Keeps all the messy bits easy for quick cleaning.\" He jests, and as if on cue a couple of children give a very cute 'eewwwwww' in the background as you snort. Sun's head rotates completely, in full-jester mode. \"Oh, you'll be joining us for story time, won't you? Won't you?\"\nYou wave him off, forcing your face to remain plain and chipper despite the pain that was swelling up your leg at the moment. \"Sorry, no can do. I gotta get these boxes sorted first-\"\n\"Oh, but I think you can, and you will!\" Suddenly, the hands on your shoulders are gripping a little bit tighter. You are all but guided (more like half-dragged) to where the gaggle of children are sitting in a circle and plopped in the middle. \"In fact, you should take over! I've been telling the same fairy tales, all princesses and monsters and bears and rabbits-\" Sun pats you on the back, non-chalant. \"Why don't you tell a story, something new? I'm sure you have it in you friend.\"\nAs nice as it was to be sitting down on the mat where there wasn't a weight constant on your ankle, the several pairs of wide anticipating eyes of children was a little unerving. \"Uh-\"\n\"Good!\" Sun reels back, hands on his hips. In one swift motion, his legs swivel around to start walking towards the cart and boxes, while his head and torso stay facing you and the children. \"I'll take care of these gifts! Better this way, I have a very particular way of organizing things you know.\"\nHe leaves you there, and now you're stuck entertaining children until he's finished.\n...Honestly? Not the worst thing he's done, and there's a sense of reflief since you're not standing anymore, so you'll play right into the game.\nYou tell the children stories about the horrors of what happens if you don't brush your teeth enough, of a boy that ate so many greens he became the strongest being in the world, of a dog that learned how to play basketball, of aliens that crashed into hawaii and made friends and a family there. Anything you can pull off the topc of your head, really, and lucky enough for you; they were eating the stories out of the palm of your hand.\nSun is quicker than you would have been putting away the boxes, and is at the ready for checkout when some of the first parents arrive to pick up their children. You continue to tell the stories even as your audience dwindles, answering questions when they raise their hands and resisting the urge to laugh when a little boy with glasses too big asks you if Santa Clause was an alien.\nSun finishes the stocking rather quickly, and instead retaking his spot, sits cross legged and joins the circle of children easgly waiting to hear your story. He even goes as far as to lightly clap when you're finished with one, the other children joining in just to mimick him. It's actaully really cute.\nThe last boy is checked out by his parents. You wave from your spot on the floor mat, not moving because you don't feel like it and uncaring if you looked a little silly to the mother. Sighing, you let relief out of your lungs as Sun closes and locks the Daycare doors behind them.\nSun literally cartwheels back to you, spinning on one heel before plopping down right in front of you. His height makes him tower over you even as you're both sitting down, and you're currently thinking about an excuse to say or mustering up the strength to stand on that leg again.\nSun leans forwards, head resting in his hands and smiling widly. \"Looks like you've become quite the favorite around here!\"\nYou return the smile, and move to get up. \"Yeah, yeah. Just promote me at this rate and I can take your job all the time-\"\nA hand clasps around your knee and you wince. The preassure is genlte, not huritng, but heavy enough it forces you back down to the ground where you sit and stare at the Daycare Attendant's grip on your leg, and his thoughtful face as he hums. \"And how long did you think you could hide that?\"\nA tug from your leg to free yourself, his grip doesn't budge. You almost pout. \"...hide what?\"\nFingers lessen around your pants leg, trail lower down to your ankle and hook underneath the fabric, pushing it up. There's a definate swollenness to your ankle now, more so than the last time you checked. Sun tuts at the sight of it. \"This, friend.\"\nAw rats, you've been caught. \"It's fine, I'm not a wuss.\"\n\"We never said you were!\" Sun gasps, offended. A pause. \"Well, I never said you were. Still a terrible idea, though.\"\nYour shrug is half-hearted. \"So? I can't exactly slack off, here. I'm already in hot water with managment and bills don't pay themselves.\"\n\"You are very lucky I was programmed with much patience!\" Sun sounds like a mixture of frusteration, exasperation, and affection. It's a comforting tone of voice, so it doesn't alarm you right away until the animatronic's hands are reaching forwards, hooking underneath your knees and against your lower back before you can protest. \"Onwards, to the first aid corner!\"\n\"...Does this mean you've gotten a doctor's license yet?\"\n\"I am not legally required to answer that question!\"\n \n\n\"I'm not going to let anyone hurt you.\" The shear amount of possibilities for this one, it makes me gitty. - saltyfryz on tumblr\n\nThe thing talking to you speaks in a tone of voice that's a mixture of static, robotic mess and horror.\nYour fingers are a little numb, probably from the shock of the last few minutes. Wide eyed and wet faced, you stare back up at it. Moon's hat sits atop your head, and you almost want to pull it down over your face, hide away from the world, back away into the corner and curl up and wish all this stress and mess would go away until you could get your barings in the morning.\nExcept you can't really back away any further, otherwise you'll trip over the parts of mangled animatronic parts you're not sure belonged to who.\nIt's twice your size, with twice the amount of limbs, and smiling at you. \"It's okay.\"\nThat voice sounds familier. You shrink back. The way it stares at you like you're the only thing in the room. A metal arm, not it's own, crunches easily in it's grip. A mindless gesture, like holding a toy.\nThe basement's lights flicker, but for once, the Daycare Attendant doesn't even flinch. It cranes down, the sound of grating metal, and movement that seems like it feels alien to move at all. All twisted like how your jesters usually move, but more coiled like a spider ready to lunge.\n\"It's okay. We're not going to let anyone hurt you.\" It says, and it's voice is calm, then chipper, with a notable cut like radio feedback in the tone. \"It's okay. You're okay.\"\nFor a monster, this thing talks like it's practiced comforting thousands of times, to bring down anxiety and fear. The blood on your shoulder and destroyed room around you contradicts this.\n\"Promise.\" It repeats, sharp teeth in a wide smile like comfort. \"Promise.\"\n\nCould you please do No. 2? \"I'm dying\" \"You're not dying.\" Just imagining moon fed up with Y/N, also LOVE your stories btw, have a great day bam! - unidentified-feral-dumbass on tumblr\n\nSince the coffee maker in the employee's lounge was broken since the start, and you're not entirely sure what they put in the drink at the pizzaplex's own cafe, you've made a habit of getting your morning coffee from the 24/7 gas station you frequent on your way to the pizzaplex whenever you have an early morning or super late night shift.\nThis night, however, you forgot.\nYou got your gas, even got a snack to munch on in the way out after saying hello to the gas station bot, and got all the way to the pizzaplex parking lot and unbuckling seatbelt before realizing you forgot the most important part of your day: the caffine you needed in order to get through the shift.\nWell, you'll just have to go without.\nAnd it sucks.\nYou're tired, a headache is on it's way, your eyes feel droopy. Monty says something in passing about how you're slower than usual, and even Freddy makes an awkward, concerned observation about how sluggish you seem to be and even offers his sofa to you for a nap. You politely decline, of course. The task list isn't going to complete itself.\nMoon is, as expected, rather excited that you walk around work with slow movement like easy prey. So that's why you turn the lights on in the kitchen area as you're mopping so he can't make a sudden grab for you in here.\nSaid animatronic sits at the doorway, where the light and the dark between the kitchen and the adjacent room meet. It blurs over his pants, the contrast making white pupils against black eyes stand out further in the dark. A bit of a danger sign you've started to recognize, but you're basked in the light (as much as it hurts your eyes) and keep a flashlight on you at all times for a reason.\nHis head spins at a slow speed the entire time you're mopping, watching you with rampant attention. \"You're tired.\" He says, and you audibly sigh. \"Come here. Come to sleep.\"\nYou resist the urge to lean on the mop, turning to stare at him with dark circled eyes. \"That is like the fifth time you've said that to me within the hour.\"\n\"You should take a nap.\" He ignores your statement, default wide smile on his face. Sitting criss-crossed on the ground, his fingers pluck at the carpet in mindless behavior, threatening to pull it up like grass. He sways a little when he talks. \"Then I'll stop saying it.\"\nDramatically, and on purpose, you groan into the air of the kitchen loud enough that your voice echoes off the walls. \"Great. Not only am I exhausted-\" Your words make something in the animatronic tick, the sound of claws getting hooked into the carpet, the click of his head turn stopping at an angle. \"-but I'm also getting harrassed by my coworker. I do not have the energy for this.\"\n\"Whiney baby.\" Moon chuckles, voice low and quick at the end. \"I can fix that.\"\nYou don't even look at him, continuing to mop what looks like tomato paste stained on the floor. \"I can complain as much as I want.\"\n\"Moody.\" He comments, amused. \"Cranky.\"\nYour nose wrinkles up as you finish up, picking up the mop bucket an dumping it into the sink. \"Well, yeah I am. I'm dying.\"\nA scoff. \"You're not dying.\"\n\"I'm totally dying here.\" Careful not to get mop water on you, you stash the supplies in the corner of the room for the staffbots later, and thumb around for the small flashlight in your pocket. \"Totally dying.\"\nAs you approuch the doorway, hand hovering over the kitchen's lightswitch to turn it off, Moon's bouncy behavior stills, like a predator getting ready to pounce. \"I can fix that. Come here.\"\nYou flick on the flashlight and point it towards his feet, and the reaction is immediate; the animatronic leaps up, hisses in the motion, and practically scuttles on all fours up the wall as you chase him with the light beam. \"Yeah, yeah. Go back up into the rafters, Starboy.\"\n\n“Pet goes missing” for the SL prompt! IMAGINE THE LITTLE KITTY AW - loserivy on tumblr\n\nThe kitten has been gone for about a day now.\nIt was an accident. Someone left the door open while bringing in groceries (that you had bought) and maybe didn't see something small and quick run out from underneath their feet (there were bags in the way) and didn't notice until a certain animatronic is filling up the kitten's food bowl before scouring the house with special eyes and very much on edge when he cannot find the little friend, no matter how you try to console him.\n(Which isn't long, because you're already putting on your shoes and jacket from when you first noticed the abscene of the newest addition to your home, as fast as you can manage because there's a robot with three limbs out the door ahead of you.)\nWhich brings you here, in the fridged cold of midnight out on the streets, rubbing your hands together and blowing visable breath clouds as your animatronic friend crawls on top of fences and light poles in his search.\nMoon is clad in thrift store sweatpants and a t-shirt while you're bundled to the max, and his lack of need for warmth is something you envy right now. \"She's probably where she stayed before Gramps found her and took her to us.\" You breathe into your hands as you walk, a audible chatter in your teeth. \"We could start there?\"\n\"No. Damp there.\" Moon crawls like a spider, uncaring about his form in the outside world. He misses his wire, but he has no problem getting to high vantage points; something that comes in handy when on the search for a kitten in the dead of night. \"She'll be somewhere warmer. Not on concrete.\"\n\"...Like a exhaust pipe of a car, or a dumpster. Got it.\" You sigh. With this cold, it's worrying for the kitten, fur or not. It doesn't take a scientist to know that Moon too knew this detail. You would only hope that your searching would not end up fruitless. Or worse; tragedy.\nThe roads you walk are empty, save for cars that pass by every twenty minutes or so. The animatronic is probably using infared vision to find her, judging by how quick he scoured the bushes and is now crawling on all fours to look underneath the cars parked on the side of the road. Your frown deepens, worry lines sinking in. \"Hey, don't stress out. She might find her way back home, too.\"\nMoon doesn't look at you, but makes a noise of aknowledgement.\n\"We'll find her. If not tonight, we can put out missing pet posters in the morning.\" Hiking your jacket to cover your neck, you curl into the warmth and look out onto the dark street. It's wet with recent sleet, and the reflection of still lights feel warm in contrast to the air. You sigh, turning back to Moon. \"Maybe if we put a shirt and food out, we can-HEY, Put the car down, Moon! Don't pick that-put it down!\"\nMoon has the backend of a parked car lifted upwards a foot or so off the ground, his head swivels to frown at you in disagreement, but the robot settles back tires back on the pavement quietly and crawls (yes, crawls) on all fours away from the street, onto the sidewalk and up on the fence where he stays crouched. \"Just looking.\"\n\"You're already crawling. It's not hard to crouch a bit more to check under the cars.\" You sniff, and see a runny nose in your future. \"Don't get us arrested.\"\nMoon's gaze is red and focused, darting to and fro as you walk and briefly turning to you as you round the corner, pausing. \"Cold?\" He asks, and continues before you can answer. \"Home. Go.\"\n\"Not a good idea to have you out here by yourself.\" You snort. A puff of air comes out of your nose as you do, and the animatronic's head tilts at the sight. \"Don't want you lifting cars or doing...I don't know, Grand Theft Auto to find the cat.\"\nMoon stands to his full height on the fence, survalience mode returning, scanning. \"Cold's not good for you. Or her.\"\n\"I'll live-.\" Your response is cut off as his hand comes up, signaling to be quiet.\n\"Hush.\" He hums something quiet, coiling into someone's backward, halfway leaning down the side of the fence and calling out into the darkness. \"Pssp pssp pssp pssp pssp.\"\nYou try to look over the fence and into the yard, but the space behind the wood is dark and there's nothing you can make out besides fog and some foliage. \"Moon?\"\n\"Baby.\" He says. You raise a brow and there's a moment of pause before he continues. He wears a comfortable grin. \"Cat baby. Not you, baby.\"\n\"Stop it.\"\n\"No.\"\n\"Is the kitten over there?\" You crane your neck a little further, listening. You don't hear any meowing or anything rustling, and there's a barrier in the way otherwise you'd investigate yourself. \"This is someone's backyard, it's kinda trespassing-\"\n\"Says the trespasser.\" Moon scoffs, and suddenly without warning, leaps from the fence into the darkness.\nYou wait there awkwadly on the sidewalk, curling further into your jacket and listening to the crikets. You're only alone for a few moments though, a blur shoots back into your vision and Moon reappears, crouched atop the wooden fence, gripping for balance with one hand hard enough it splinters the wood; in the other hand something is held close to his chest.\nThe kitten is held to his t-shirt, looking blearly eyed, a little doozy but unharmed. It's mouth opens in a tiny yawn and it's limbs stretch out in Moon's palm, and said animatronic's happy face faulters a little in a deadpan at the realization that he just woke the kitten up from sleep.\n\"The kitten!\" You exclaim, smiling. Moon hops off the fence, careful as the kitten seems to be coming to her senses. Without asking, he pulls open the front of your jacket at the top, unzipping it a bit and putting the kitten at your collarbone. Your arms and hands come up to hold it there, keeping it close to your chest where the warmth is the strongest. She's chilly, but not bone-cold. You sigh in relief. \"She must have found a little shelter back there somewhere.\"\n\"Not enough.\" He zips up your jacket as quick as he undone it, just where the kitten's head sticks out. She looks a bit startled, not alarmed, but a tiny mew sounds out from your neck at the realization of her holders. Moon brings a finger down to brush against her head. \"Home, now.\"\n\"You don't have to tell me twice.\" Spinning on your heel, you start the brisk walk back towards the apartment. Moon is faster besides you than he is behind you, not following along on the fence but hunched over to your side, walking in long strides with you.\nA brisk wind makes you shiver, but you're careful to protect the kitten from the cold's bite. \"She needs a bath. There's muddy gunk on her legs.\" You sigh. \"You know, a hot bath myself wouldn't sound half bad.\"\nMoon moves to your other side, breaking the wind's gust on you and hoisting an arm around your shoulders. Judging by the way he was pacing, he wanted you out of the cold, and probably was going to force you to sleep the second you stepped through the doors. \"Later.\"\n\n“Is somebody jealous?” If you feel like it 🤙 - lucky-peenut on tumblr\n\nHe's the father of one of the children; the boy who's got a obsession with Monty, even shares the same hairstyle and sunglasses as the animatronic, although his parent is a bit duller as you'd expect: Confident guy, cleaned up and usually wearing dull sweaters with dark hair. Used to wear glasses but just wears contacts anymore, and he's got a arm tattoo of a skeleton riding a motocycle under his sleeves hidden by the clothing so it's not an issue at his job.\nYou don't learn this things of free will, by the way. The guy just really likes to talk to you past departure time whenever you're the one checking the kids out at the door. He's a rabbler, that one, and it goes quickly from a refreshing casual conversation to a realization that he was staying at touch over his welcome.\nSun usually comes to your rescure, in the oddest of ways, sometimes.\nSometimes he'll come up behind you, shoo you off to go collect some other child for another parent while he 'verifies' the parent's identity (which you know is bollocks, since the father picks up the same boy every day he's dropped off and the little troublemaker never had an issue recognizing the guy)\nOther times he'll yell something about children knocking over a tower, or throwing ballpit toys or pool noodles, and despite knowning damn well he can handle them well enough, you'll excuse yourself to go take care of the scene without coming off as rude to the customer.\nReally, you don't want to come off rude to a Pizzaplex guest. You're not exactly sure where you're job stands as it is. You're not going to take any risks of a complaint.\nIt takes a little bit longer this time. A child is currently sobbing over a skinned knee they got from rough housing in the pizzaplex while you're at the doors checking out the troublemaker and the twins to their respective parents. The mothers of the twins collect their boys, bid you a good day and leave well enough. The father of the troublemaker, as usual, lingers even after his name is marked off the list.\n\"Gettin' pretty cold out, aint it?\" He says, pulling a small phone out of his pocket and handing it to the boy. His son takes it, and is busy with a mobile game quicker than you can blink. \"Not gonna be much longer until Christmas.\"\nYou smile. Sun is busy comforting the child in the back end of the Daycare, so you'll have to navigate this conversation on your own. \"Yep. Look's like we'll be as busy as ever.\"\nIt's carefully chosen words, and you watch the reaction in his face as you say them. It seems to be the correct choice, because something in his face steels. \"Yeah, yeah. Say, you got any hobbies outside of this place?\"\nA casual, nonformal shrug. \"I spend most of my time here, actaully.\"\n\"Oh, I gotcha.\" He chuckles. \"Getting tired of hanging around robots yet?\"\n\"Not really.\" Still smiling, gotta keep up apperances. \"They're actaully great friends of mine.\"\nSomething shifts in the man's expression. Not in the way that makes you think he'd suddenly think less of you to like hanging around robots, but like he's just unlocked some sort of secret backstory lore for his favorite character in a video game, and you're the npc. \"Oh, really? That's pretty cool of you. You know, I work with a couple robots myself. Over at the office.\" He talks like he's bragging you have something in common. \"Takes out the trash and gets the coffee. Like interns, but you don't have to pay em.\"\nYour smile stretches a bit thin. \"They do good work. My friend Sun might need my help in a moment.\"\nIt's a light excuse, one that doesn't seem likes it's going to work because you don't hear a child crying anymore, and Sun isn't anywhere to be seen from a glance around the Daycare. The father interjects again. \"Oh, yeah. Lanky guy, isn't he?\"\n\"He's probably getting things ready for naptime.\" You turn to step away from the door. \"I should go get the blankets-\"\nYour step away seems to activate something in him. \"Oh, wait! Before you're busy. Didn't mean wanna impose, but would you-?\"\nA flash of yellow, reds and oranges comes into your vision rather quickly in the corner of your eye, and Sun is there (thank god) with a toddler curled up in his arms. She's already sleeping, and he's careful the beads in her hair don't press inbetween where her head rests against his chassis, and talks in a whisper-yell. \"Heelllooooooo, there!\"\nThe father looks a bit startled to seem him for a second before his composure returns, and you try not to look visably relieved. \"Everything under control?\"\n\"You betcha!\" Sun manages to be loud and quiet at the same time, a feat only he can achieve, and turns to the father and his son standing in the doorway. \"I'm sorry, but the Daycare will have it's naptime soon, so we'll be turning off the lights and trying to keep to our inside voices.\" He talks calm, assertive. \"Is there anything else I can help you with before you go?\"\nThis seems to work, the father blows air through his nose in semblance of a sigh, and shrugs. \"Ah, nah. We've got it here.\" He turns to you to say the goodbye, though. \"See you around.\"\nYou and Sun speak in unison as the pair leaves. \"Have a Faztastic day!\"\nThe door shuts behind the man and his son, and you feel the tension leave from your shoulders. Children are already getting into their mats and blankets on their own (save for two that are trying to fit into one sleeping bag so they can nap together, but you don't break them up or else they have nightmares) and you don't see much else for you to do other than to turn the lights off.\nSun holds the sleeping toddler in one arm, a hand coming up to gently cover her ears with the other. \"Bit of a talker, that one.\"\n\"It's not like he's doing anything wrong.\" You shrug, setting your clipboard on the security desk. \"Just chooses the worst time. I mean, like, c'mon. I'm at work here. I can't chat with people at the door.\"\n\"Would you prefer outside the Pizzaplex?\" The animatronic asks. He doesn't look as nervous when you approuch the light switch anymore. Well, usually. \"I'm sure he'd like that.\"\nYou don't reach for the light switch yet; doing so mid conversation would be rude, but you still raise a brow. \"Sounding a little suspisious there, Sunny.\"\n\"Suspisious.\" He repeats, scoffing. \"His intentions are plain as day! And I'm the day! Look at me! I'm telling you. Right now.\"\nIt's playful behavior, and the way he sounds when it's flared up is a little funny, so you cross your arms and lean against the wall next to the light switch. \"Okay? What if I like the attention?\"\nSun's smile thins. \"Oh, we doubt that.\"\n\"But what if you're wrong? Would it be so bad?\" You're teasing him, obviously, that much is clear. You can tell by the look on your friend's face that he's two seconds away from rolling his eyes (or maybe he is already, and you just can't see the pupils) but you're allowed to poke at the Daycare Attendant every now and then. \"Maybe we'll never know because you keep chasing him off.\"\n\"I would gasp right now, dramatic and awful, but the childern are trying to sleep.\" Sun sounds incredbably deadpan. \"And I'm not going to entertain your theatrics-\"\n\"My theatrics?\" You give a short laugh. \"The last time he was doing this, you pretended to fall and break a leg so I could excuse myself to 'repair' you.\"\nSun holds up one finger to you. \"And yet you still came running!\"\n\"...Boo.\"\n\"There will be no 'booing' in the daycare-\"\n\"Oh, boo. You just don't want me to get a date cause you'd miss me.\" You snort.\nSun looks like he's about to say something, then goes quiet, face static. You grin. The girl he's holding hasn't stirred yet, but knowning him, he's probably holding back for her sake to defend himself. He only does so after a moment. \"Teasing and bullying is not allowed in the Daycare either, or do you think you're always excluded from rules?\"\n\"So you would!\" You laugh, and cover your mouth with your hand so it doesn't make so much noise. \"And please, you let me get away with so much-\"\nSun looks esasperated. \"Against our will.\"\n\"What are you, jealous?\" You continue, and miss the visible stillness that takes over the animatronic when you talk. White pupils deadpan at you and you snicker. \"What? Nothing to say? Is somebody jealous?\"\nYou chuckle as the Daycare Attendant stares at you, smiling but silient. It's fun to tease him, but it's about time you let him get back to work before you waste time, and you reach for the light switch, still leaning back agaist the wall. \"Alright, alright. I'm done. Let's get-\"\nA hand reaches out over yours, pressing it against the light switching flipping it off as your fingers are locked underneath it's own. You pause, gaze dropping from the lightswitch and traveling back in front of you towards the animatronic as the lights in the Daycare go out.\nThe switch happens differently each time, but better times like this, it's a blink, and the Daycare Attendant went a far cry from hiding away each time to this; unwaving eyecontact, leaning int a little too close for comfort as colors change and the pressure on your hand feels a touch sharper.\n\"Yes.\" Moon says, deadpan.\nYou blink. \"Uh.\"\n\"Blankets.\" His hand drops from the light switch, from your hand, and adjusts his grip on the still sleeping toddler in his other arm.\nThe small-talk of an animatronic leans away from you, and casually, turns the opposite direction towards the children who were either half-asleep on their mats already, or quite excited to see him. You watch as the animatronic finds a open mat to tuck the toddler into, mummering quiet hushes to the children around him as he busies himself with his duties.\nWell, you might have lost that one. You retrieve the blankets from the supply closet, using your hands to scrub at the warmness in your face when he's not looking.\n \n\n'From the January prompt list: Slow dancing in the kitchen late at night' - unh0ly0bsession on tumblr\n\nYou were expecting Moon when you came home late at night, grocery bag in hands and tired from the day, that'd he'd immediatly nag you to go to sleep and hide the coffee you've bought in a different spot everytime like he always does.\nYou were not expecting Eclipse to basically jumpscare you as soon as you shut the front door behind you, all but materializing in the dark silience in front of you as you jump and almost drop the eggs.\nAfter the initial scare, you sigh, and smile. \"Hi, Eclipse.\"\nEclipse just stands there and stares at you, smiling and hunched a bit to prevent hitting the cieling. Sometimes he talks. Other times, he's quiet, face unchanging, unreadable. This was normal behavior. At least, with this version of him.\nThe open layout from the kitchen to the living room means that with the mainlight turned off, the only visibility you get is from the floor lamp in the living room, and the glow of the animatronic's eyes. They follow you silently as you casually brush past the robot and into the area of the kitchen, setting the bags on the counter and pulling out the items. When it follows you after a beat, you don't look over your shoulder to see your shadow. \"Can you help me put away some of this?\"\nYour response is the quiet, unmoving presence behind you. Eclipse switches are unpredictable since the fire, and how it will behave is also unknown. But you feel comfort in the feeling of one hand pressing against the small of your back-no reason other than just to touch, to be able to make contact- and another hand takes the egg carton you're holding over your shoulder without looking.\nThe fridge opens behind you as you're still unpacking the food from the bags, and frozen items are taken from the counter and put away before you can even grab the maceroni and gesture it towards the cabinet. The positive of having multiplelong arms in a small space makes him a very good household chores, save for the arm still pressed to your back, now slinking up underneath your jacket and pressing against the fabric of your shirt.\nThe physical boundaries are not unfamilier to the glitched version of the Daycare Attendant. You hand him a pack of cookies, and he puts it on top of the fridge where the rest of the treats go, while sharp tipped claws crawl up your skin and up between your shoulder blades and press against the soft points there.\nIt reminds you of how the Daycare Attendant likes to hold the kitten when they are particularly unwell in their mind, except said kitten was fast asleep on the couch surrounded by blankets and pillows-no doubt his own doing- and Eclipse has sought out his favorite comfort since it's coming home.\nThis, too, was normal.\nYou don't know if the transition was triggered or if it happened without a cause, but the groceries are put away, so you shrug off your jacket and lay it on the counter, digging your phone out from the pocket. Idle hands of his no longer busy with what you hand him twitch at his side. A second hand lays on your arm, unmoving, but just there.\nYou're checking the notifcations, angling your phone so he could see the screen if he so chose. \"Gramps called me earlier and told me that you helped him put up the Holiday lights.\" You smile, turning up to face him. Eclipse's faceplate casts a shadow over you, head turning to an angle, to your bright look. \"He said that you went a little overboard, and that his living room looks like it's straight out of a Hallmark movie.\"\nYou do not ask if he was transformed before or after this deed of his, but the slightest of movement in his face, the upturning of his eyes in amusement and pride tells you that he enjoyed it either way. \"Boo. You better help him take those down when the holidays are over. He's old and he might throw his back out!\" You snort. \"Thanks though. He asked me if you eat metal so he knows what the 'cook' for the holiday dinner.\"\nEclipse does not give a verbal response, but fingers tap against your skin, hands rising up to your neck as you continue to scroll through and clear out your notifications. Hair is brushed to the side, the back of your neck exposed, and he drags little scratch lines in your skin in repetivie motions. It feels nice, and you crane your neck for him to have more access. \"I just told him that you don't eat, but you'd probably really like to cook the actaul food with him.\"\nA thumb rubs the space behind your ear, trailing down to your collar. You gave the correct answer it seems.\n\"You're pretty hands-on, tonight.\" You say, swiping through the last of your notifications and putting the phone down on the counter. Turning your head to face the animatronic, who's own head tilts at the motion. \"You alright?\"\nThere's nothing said to confirm or deny, so whether this is because he was feeling maybe-not-so-great or you just so happened to walk in at the perfect time to for his sentimentality. You smile. \"Not a talking night, right? Let me make something to eat, we can watch something on TV together.\"\nIt's very late, so you can think of a couple channels that are airing decent movies around this time. Pulling away from the counter and the hovering animatronic, the touch leaves your skin as you reach for the fridge handle-\nUntil your outstretched hand is captured, gently, within the confines of Eclipse's own. You blink as a larger hand encircles yours, feeling your other come to the same fate, and the second pair of arms he sports has found their way around your torso, one hooking around your midsection and another leaping your heart into your throat as it gathers you up and your feet leave the floor. \"Hey, Eclipse, whoa whoa- careful buddy-\"\nHe is careful, soft faced and soft but firm gripped, with a smoothness in his motions and care in how he holds you, if you were strangers you'd never think that this robot was capable of killing. Except you're not strangers, and Eclipse holds you like a friend, maybe something other than a friend, and sways slightly from side to side in the low light with a low, rythmatic sound coming from within his voicebox.\nIt's quiet and not too much against your ears, but between the hum of the kitchen lights and the way he holds you, you realize it as you realize the dance. Eclipse was humming.\nThe melody isn't familier, but it's slow and soothing, and Eclipse's faceplate meets your forehead as you are slowly spun and danced around the kitchen counter, stepping over the cat bowls and repeating the same, slow steps like he was scared you'd get dizzy.\nYou laugh, and his fingers curl tighter around your own. \"Oh, so it's that kind of sentimental night.\"\nEclipse hums, quiet, and you lean your head forwards until it rests on his chest. The shirt he wears smells like the laundry detergent that Sun picked out, and Moon's bell from his nightcap bounces against your head as the animatronic curls into you, comfortable, and swings you from side to side.\nYou hush at him to be quiet or he'll wake the cat, not to bump into anything, and Eclipse's response is to dip you low, until you're nearly upside down and you're restraining giggles and laughter knowing four arms will keep you from the tile floor.\n\n\"Don't bleed on my carpet\" I can see YN maybe getting a booboo and Sun and or Moon freaking out -thecosmiccherrycoke\n\nNosebleeds sucked. Unpredicatable most of the time, and inconvienent. You don't even feel it happening until droplets of blood splatter on your phone screen as your looking down. So you sigh, stand up from the table and attempt to hold your nose back as you fumble your way to the bathroom.\nThe Daycare Attendant isn't here at the moment, downstairs helping Gramps with something, so it's a bit of a fummble to the bathroom without blood dripping everywhere by yourself.\nThe flow was heavy. You inwardly cringe as you hear a few droplets hit the floor, and holding your head back, you hold out a hand to feel against the wall to guide you, and scold yourself when you realize you just probably smeared blood on the wall as well.\nYou make it to the bathroom, don't even bother turning on the main lights, flicking on only the nightlight that you keep in the outlet under the mirror. Your friend doesn't like it when some rooms are dark, and others are brightly lit. Could cause rapid changes, or a possible Eclipse. You find the toliet paper and bunch it up easy enough with what illumination you have.\nWinter was such a pain sometimes. You were prone to nosebleeds when the air was so dry like this. You should look into getting a humidifier or something.\nA few scrunched up balls of toliet paper shoved up your nose later, the blood isn't showing any sign of stopping, and a pile of bloody tissue is collecting into a pile by the sink. You sigh, head light. That's gonna be annoying to clean up, as well as the rest of the stains. You also made the mistake of wiping your phone onto your shirt without thinking about it before. THAT was going to be one nasty stain to get rid of, if you can even salvage it.\nOn the sixth tissue ball, you hear the front door open. You'd call out if it wasn't for the sneeze you felt rising, and for the sake of now spewing blood and snot all over your bathroom mirror, you put your effort into holding it back.\nThe door shuts, clicks and locks. A few padded footsteps for some paces, then stop. There's a quiet pause as the sneeze subsides, and then the sudden sound of hurried movement through the house, walking quickly over your own path-\nThe door to the bathroom that was cracked open is swung completly outwards, an ridged animatronic grips the doorhandle with a tightens that almost cracks it.\nMoon's smile is strained, eyes as wide as the times nightmares only bring forth, and shrunken pupils scan before they find you.\nA heartbeat passes (and you probably look stupid, tissued-up and stuffy nosed) as the robot blinks, the tension in his form lessens, and gaze softens.\nYou talk stuffy and dry. \"What? What's wrong?\"\nPupils, no longer small, fall down to where blood drips off your chin and onto the bathroom mat. \"Don't bleed on my carpet.\"\n\"YOUR carpet?\" You scoff, and it comes out a bit choked. The last thing you wanted was blood traveling down your sinuses and down your throat. \"Excuse you! My house! My Carpet!\"\n\"Laundry mess.\" He talks low again, and it sounds like teasing. Whatever strain that was in his fave prior has melted away, and the robot leaves the door open as he steps forwards. A hand comes to you without permission, fingers gripping your jaw and positioning your head towards him for a better look.\nMoon doesn't tut at you, but his expression spells the idea. \"You're doing it wrong.\"\nYou've half a mind to sneeze on HIM just to get your space back, and to be annoying on purpose, but the hand on your jaw slides against your skin to the back of your neck, and you feel fingers wrap around there, a few running up into your hair. Your head is promptly pushed to face downwards, another tissue is brought to your nose as you feel the blood rush.\n\"Look down. Not up.\" Moon speaks. Whatever argument you have is muffled by tissue and trying to breathe now that you've been flipped a bit. He presses the tissue to your nostirils, blood soaking through to his fingertips. \"Drain it. Breathe through your mouth.\"\n\"Yeah, okay, Doc.\" You talk, a bit breathy because yeah maybe he had a point there. It's a gross feeling, and it feels awkward, but the blood flow starts to lessen after a minute, and it's nice not having to keep trying from swallowing anything in the sinuses. \"Did you have fun with Gramps?\"\nMoon makes a small sound of aknowledgment. He does not move his hands from your face or the back of your head.\nYou talk to fill the silence. \"Whattya guys do, anyway?\" Raising your hands, you try to replace his own. \"I can do this part myself, by the way.\"\nHe does not let you, that is, until the tissue needs replacing and has no choice but to pull away the old one. \"Magic tricks.\"\n\"Magic tricks?\"\n\"He wanted to learn.\" A quick hand replaces the space of your own with a new tissue. You give up, letting your arms fall to your side. Moon is attentive when it comes to your face, and low-lidded as he wipes the blood stain on your upper lip. \"Be still.\"\nYou stick out your tongue. He pushes it back in with his thumb. \"I said, be still.\"\n\"Whatever.\" It's a bit demeaning, this act. It also feels nice to be cared for in such a gentle manner. Maybe it's his programming, but you know it's just what they like to do. Still, he's slow in movements, and you glance back to the mess you've made on the sink. \"Does the blood not bother you anymore?\"\nMaybe not the best thing to say, and you realize that instantly after it leaves your mouth. Moon's movements pause, if only for a moment. \"No.\"\n\"I can clean up the blood.\"\n\"It's okay.\"\n\"And the mess in the living room.\"\n\"It's fine.\"\n\"I can do this part too, you know, if you're still-\"\nA tighter grip around your face, Moon's smile thins into annoyance. \"Stop. Moving.\"\nFine, sure. You raise your hands up into the air as a mockery of surrender as he runs a rag underneath the sink water and dabs it in places where blood traveled and you did not see. Your faces is scrubbed clean (ratherly harshly, and probably thanks to your commentary) along with your neck and collarbone. He doesn't bother with the stains on your shirt or shirt collar and you take that as inward confirmation that this shirt was done for.\nSo you stand in the process, eyes closed and thinking about what to make for dinner as the animatronic does his work. Finally after a good five minutes of silence, he lets you go. Opening your eyes, Moon steps back, looking you over once more. The blooded rag is tossed into the garbage bin instead of the laundry basket, and he turns from you to gather the tissue paper on the sink and dump those in the trash as well. \"Shirt.\"\n\"Yeah, yeah I know, I know.\" You're pulling the shirt off before he even finished the sentence, running a thick part, unstained part under the water before exiting the bathroom. Might as well use it to clean up the rest if you can't salvage the clothing.\nLuckily for you, the stains on the floor and wall come off with some hard scrubbing and some cleaner you keep under the kitchen sink. You've tossed the ruined shirt into the trash as Moon exits the bathroom, presummably finished cleaning in there, and make eye contact in the hallway.\nHe looks normal, almost default as red eyes and white pupils look over your rather disheviled, shirtless form. But your gaze glances down to his hands, twitchy, stuffed inside of the sweatpants you scored for them at a thrift store, and you know better.\nYou sniff with a clear sinus this time. \"I'm all better now.\"\nMoon's faceplate turns to an sharp angle.\n\"How do you feel?\" You test the waters. The dark of the hallway feels warm, the glow of his unwavering gaze feels warmer. \"Moon-?\"\n\"Fine.\" He cuts you off. The animatronic walks up to you, a hand raised, it comes to your face, his own unchanging. A warm palm presses against your cheek, to your neck, against your pulse.\nDouble checking. It's all it is. Double checking.\n\"Fine.\" He repeats, and his palm drops. \"Go sit.\"\nYou wish you could read his expression. Sometimes you can't. The animatronic turns his back and you do the same to the living room, finding your phone on the coffee table where you've left it. You're screen is still-mid spot where the mobile game left you, so you save your place.\nA moment later, a shirt is thrown over your head, and crinckly package tossed in your lap. Lifting up the frabic, some basic crackers are in front of you. The weight on the sofa shifts as Moon plops down as you're pulling on the shirt, his own form criss-crossing.\nIt is better not to push. Not unless you wanted to trigger an unwanted, stressful change. \"Wanna see this game I'm playing? You take care of digital little cats.\"\nHis head tilts again, this time more of curisoity than something else. You crawl into the lap waiting for you, pulling up the game and positioning the screen so he could watch. No words are said, but comfortability is had, and the two of you settle. Silence is broken only by the sound of the buttons clicking and game music playing.\nMoon chuckles, though, when you capture a cat and that's half-black and white and name is after him.\n \n\n“In too much pain to sleep” from the prompt list could be so soft or so angsty 👀 - kiwiandsprinkles on tumblr\n\nThe hospital sent you home with pain meds and strict instructions to take it easy.\nAll the heavy lifting, the stress, the preperation and repair, and letting an animatronic use you as a crutch every now and then was the very opposite of 'taking it easy.' At night, you don't have adrinaline to dampen the agony, and the pain meds aren't working.\nSo you lay in bed, staring into nothingness as the pain comes in waves, with shaky breathing and waiting for sleep to come knowing it probably won't.\nYour bedroom door creaks open an hour into the agony and silience and you glance over to see the silohette (not Sun, not Eclipse) and find the figure hunched, body just as damaged as you feel, and red pupils flitting around your room in a manner of madness before they settle on you.\nThe Daycare Attendant's sanity is questionable, as is your saftey, still. But you've been through so much, and are in too much pain to care right now. \"Hi, Moon.\"\nThe dark shadow in your doorway doesn't move, nor speak. You don't expect him to. The voicebox is still damaged.\n\"You need to stay-\" Your voice cuts off right before you wince, and you turn in your covers hoping the rustling will cover the sound you make when you flinch. \"You need to stay in the living room.\"\nMoon's figure doesn't move. Small pinprick pupils linger on your form, even as you struggle to sit up, propped by pillows.\n\"Moon.\" You stress, voice a little firmer. \"Living room.\"\nThe animatronic's hands twitch, and you fall silent as the Daycare Attendant takes one step, two steps, into the room. He approuches the bed, and you're too tired to protest. A little closer to you, you see the damage again; the crack in the faceplate, the melted metal in his shoulder, the charred remains of his arm, someone still functional despite the wiring being frayed.\nYou don't question it much anymore. You learned the world doesn't work in some ways like you thought it did, recently.\n\"I need to rest.\" You say, and your words fall into the dark. The animatronic doesn't hear you, or ignores you, as he climbs onto the bed and hovers, sitting cross legged, and the pain you feel is the barrier that keeps you from leaning away.\nBlurred movement in the corner of your eye; his hands raise, forming symbols. Sign lanuage, jerkier than how he's used to speaking so smoothly, with one hand out of place as it only shows the blackened bare of his skeleton frame.\nFingers move, his hands and wrist form words too quickly for your pain riddled mind to follow. \"I don't...\"\nThe movements stop. A pause, and then transform into something more simple. Moon forgoes sentences to spell out a word with letters instead.\n\nHelp. \n\nYour chest hurts worse now. \"I need to rest, Moon. I can't...I can't help you right now.\"\nThe motions are repeated, along with some more you don't understand. Help.\n\"I can't.\" Your words come out croaky, your sentence shudders with a new wave of pain. \"I can't, Moon.\"\nIt's repeated again, once, twice, and with a semblence of irritation in his movements until his hands pause, and fall. The components that allowed him facial expressions are also damaged, so his face is locked into the default smiling expression. Not that it was unusual, but you still wish you could gage something from him. Anything. Just to know what he was thinking.\nThe Moon stares at you in quiet darkness and you're close to resigning for the night, to lay flat on your back, close your eyes and to keep trying to for sleep, though you know it won't come without a cost.\nUntil a skeletal hand brushes up against your neck, carressing upwards until the back of your head is cradled, supporting you. There's movement on the bed; Moon shifts under the covers, body pressing flush against you, and his other arm pulls at your opposite side, pulling you upwards against him further.\nYou wince at the motion, but there's no fighting, no sense to pull away, unless you want to risk hurting yourself further.\nThe skeletal hand comes over your eyes, forcing them closed. They settle there on your eyelids, the other hand going under your pajama shirt, pressing a palm to your skin and petting there, like some sort of comfort.\nMoon smells like lavender laundry detergent and the faintest small of campfire smoke. The pain is still there, and your shot nerves were too, but the silence and the steady press of the animatronic was a welcome distraction from the occasional wave of pain that coursed through you, no matter your exhaustion.\n\"I'm okay.\" You talk into the night. Silence greets you. \"M' be fine. I just need rest.\"\nThe touch around your sides settles into the repeated motions of running up and down your skin. Thin fingers comb through your hair. Moon's faceplate is hovering, crack and red glow, and if the voicebox wasn't an issue you'd pracitically hear his voice telling you to sleep.\nYou curl further in, eyes shut to how hands pull the covers up higher to yourself, and wait for the slumber.\n\nPrompt Drabble: Stitched up wounds 🧵 🩹 - waefer on tumblr\n\nYou weren't exactly the best coordinated or well organized person. Or maybe you were just super unlucky at times, it would explain all the instances of misfortune you've had, small or big injuries that shouldn't have happened but did so like the universe was just trying to spite you.\nSo you're not all that surprised when you stick your hand into the murky water of the kitchen sink to start doing the dishes, feel something a little weird, and pull it back out to see a steak knife hanging from the middle of your hand.\nYou hear Sun dropping the plates behind you on the table before the pain actaully reaches you. \"Oh. Uh. Oops.\"\n\"Oops? You're 'oopsing' right now?\" Sun's form is immediatly to your side, his job of collecting the remaining dishware forgotten as the animatronic grabs your wet wrist. Before he flips over your palm, the knife falls right out of your flesh, bits of blood falling with it, now a dark stain into the dirty water. \"Oh, dear. Oh me oh my.\"\nSun's faceplate turns briefly to the car keys hanging on the hook by the front door, and you're quick to speak up. \"We are not going to urgent care for something as small as this. I'm not footing that bill.\" The animatronic gains a sour look, but you're firm. \"Not happening.\"\nA disapproving pause, but the Sun looks back to your hand.\nThe pain is starting, and your mouth pressing into a line, sucking in a hiss through your teeth as the sting of the water forms a bloody ring around the wound. \"Ah, fuck-\"\n\"We told you-\" He's tutting at you, flipping your palm upwards and holding it firmly with one hand, the other grabbing a paper towl and dabbing the wetness away. \"I think I've told you several times that just throwing knifes into the sink for later was going to bite you!\"\n\"Not my fault!\" You flinch as he brings your hand down underneath the faucet, running clean water over the wound, \"Knives just have it out for me! Remember that time-\" He turns it off, and all but dragging you by the wrist to the bathroom, with your complaining all the while. \"-the time with the rabbit?\"\n\"Not a funny joke!\" Sun sits you down on the closed toliet seat, a firm press on your shoulders as an unspoken 'stay put', turning on his heel and opening the medicine cabinet up. \"Not funny! Very upsetting! And I'll be hearing none of it right now!\"\nThe pain in your hand was spreading, but you're trying to laugh. \"C'mon, it's-\"\n\"Oh, would you look at that! It's our good friend, disinfectant!\" He pulls the bottle out with purpose, a small first aid in his other hand, and holds it in the air with a tense smile. \"Very important to use. Let's make sure that dish water doesn't make anything infected, shall we?\"\nYou cringe in on yourself. \"I think I'll be fine with a band-aid.\"\n\"Please.\" The Sun washes his hands, then lowers himself, setting the supplies to the side as he crouches in front of you. He holds your wrist again, turning it over, and the tutting as blood dribbles out from the small wound, sliding off your skin and dripping to the tile. Not the worst injury you've recieved, but definatly an annoyance. \"I think you'll need a stitch or two. Maybe three. And wouldn't you know that robots tend to have very steady hands.\"\nYou wrinkle your nose as he pulls as he dips the bottle of disinfectant onto a gauze pad, and positions it over the wound. \"Said the robot that was programmed to juggle-aUUUghhh Ow! Ow, fucking. Ow.\"\nSun uses his thumb to press the alcohol pad into your palm with a gentle firmness, and sends you a look when you try to jerk your arm backwards. \"We have four arms! Do not make us use them.\"\n\"Unfair.\" You pout, watching as he pulls the gauze away now tainted with a slight color of red. A bead of wetness swells in your eye at the pain. \"Mean.\"\n\"Hush.\" He speaks, and sounds like his other half coming in underneath his tone. Sun tosses the gauze, pulling out a small kit with one hand and thumbing away the single tear with the other. \"This will hurt a little.\"\nThe pain is evident and not leaving soon, and the blood was no longer dribbling down your palm, so you look away as Sun threads the needle with careful percision, (large fingers are not, he does have steady hands) and lines it up carefully. You flinch at the first stitch.\nHe presses his fingers down onto your wrist, keeping it trapped against your own knee, and uses the thumb of that hand to keep your palm splayed open as the other worked. \"Try not to move.\"\nYou breathe hotly through your nose. \"I'm trying.\"\n\"And you're doing a very good job!\" He's quick, focused. The wonders of expertise. He's not nervous because he's seen you survive worse, so the habit of speech comes naturally to him. \"Good, good. There you go. Open your hand little more.\" A third stitch, and you groan at the realization you'll need a few more, but Sun keeps going.\n\"Almost done.\" Sun comes to the last one. \"You're doing very good, sweetheart.\"\n\"Shut up.\" Your face is both hot in embarressment and in painful discomfort.\n\"Oh, you'd rather we'd be quiet?\" Sun's smile is teasing, but comforting. He's probably trying to be distracting on purpose. \"Cranky.\"\nYou open your mouth to retort, but the final stitch and knot is finished, and you fight to appear stoic at the sensation as Sun wipes the now-closed wound with a disinfected wipe again, pulling out another roll of gauze. \"No more dishwashing for you, I'm afriad. You can leave those things to little-ole me!\"\nHe wraps your hand gingerly, covering the cleaned and sutured wound with bandages to protect it's healing. You don't say anything, but you know he glances up every other second or so to see if you wince if the wrapping is too tight. The wrap is finished, a knot on the back of your hand, and you sigh. \"I can just put a glove over it.\"\n\"How about you not do that?\" The animatronic leans back, gathering the left-over supplies and storing them away back into the medical cabinet. You rise to stand, and he stops you before you can brush past him. \"Hold on! We're not done here!\"\nYou raise a brow, but you see it coming before he starts. Carefully, grabbing the wrist and not the hand, his takes a hold of the injured one, raising it slowly and gently up to his faceplate, leaning downwards until the bandage barely graces his teeth. \"Mwau. It'll heal in no time.\"\nYou laugh. \"That's so corny!\"\n\"And it works! Scientifically proven!\" He chuckles, turning to his side and gesturing for you to walk past him and out of the bathroom like a knight would welcome a charge into their castle. \"Now! Dishes away! Not for you though. I ban you to couch duty.\"\n\"...What's couch duty?\"\nHe winks at you. \"It's the duty you do when you don't do anything.\"\n\"....Boo.\"\n\nFor the prompt thing, may I suggest, \"good morning sleeping beauty\" with moon? I think it'd be really sweet to have y/n finally comfortable enough to sleep near moon and they wake up to see him next to them.(also, hi bam!) - thecrystalauthor on tumblr\n\n \nAdjusting to living with the Daycare Attendant was easy in some ways, odd in others, and in some cases: just weird.\nYou've gotten quite used to a few quirks or theirs, or simple things. Like remembering you're not alone in your apartment anymore when you suddenly hear the TV turn on to the news in the other room or the sound of doors opening and closing. Or the smell of food cooking (burning) when Sun decides to try a new recipe that he may have forgotten that your fridge is not an endless supply of ingredients and you do, actually, have to go to the grocery store to keep supplying his new hobby.\nThere's the whole showering situation. The laundry situation (they don't need clothes, per say, but one of the upsides of being free robots means they can dress however they like now, so their wardrobe is growing) and coming home to see that your furniture has been rearranged for a third time that week because the Daycare Attendant wants everything to look just right.\nThere's also the sleeping situation.\nYou mostly wake up to Sun in the morning. Unless you don't, and it's the middle of the night, and Moon doesn't know the meaning of 'personal bubble.'\nOne evening you wake up with a sore, dry throat, open your eyelids and find two bright red glows casting back down at you. \"What the-\"\nA silicone-coated hand gently, quietly, comes over your lips. You are silenced, though still sending a glare, to the robot that hushes you, hovering inches over your face. Moon sits cross-legged on the bed, tall body hunched over your foam. His T-shirt brushes up against your bare arm. The bell of his hat rests beside your head on your pillow. This was the norm for him.\nYou glare up at him and talk through the fingers on your mouth. \"Whattyadoing.\"\nThe Moon does not respond, but his smile and half-lidded eyes tell you its an obvious answer.\nYou blink through he bleariness and look to the clock. It's about 5AM, not the middle of the night like you thought, but the sun hasn't risen yet. The space behind your curtains is still a blue, purple of a day not born yet. \"How long have you been like this.\"\n\"Only a few moments.\" He talks quietly, voicebox in a whisper. Any louder would disturb you, and he wants you to fall back asleep. \"You were stirring.\"\nYou yawn, and the hand brushes down your chin and to your neck, and lingers there. The bed on your back and warm blankets are lulling, but the ache in your throat is becoming more noticeable as you breathe. \"I need water.\"\n\"I can get it for you.\"\n\"No, it's fine.\" You grab his arm before he moves, and he stays. Though a dulled look comes across his face, he returns to hover above you. \"Give me a minute. I should get up for the day about this time anyway.\"\nMoon's face twitches. Obvious disagreement. But the hand near your neck returns just to brush the hair away from your face. \"You are getting up early?\"\n\"Yeah.\" You yawn, and stretch your legs under the blankets. Any moment now you'll have to bite the tired and sit up. \"Gramps has doctor appointment at 8AM, and we're driving him. Might as well get some stuff done and ready before we go.\"\n\"Hmm.\" His thumb moves to your eyes, and you close them briefly as he thumbs away the sleepy bits in the corner. He does what Sun does all the same, greasy hair and dried drool on your face do not stop him from petting you, for some reason. It's a nice feeling, if not too soothing when you know you need to get up.\nThe Moon clicks dully, pulling at the skin underneath your eyes (dark circles, thin skin with taut veins from sleepless nights and days full of worry and agitation. ) before a soft grin stretches on his face. \"Good morning, sleeping beauty.\"\nYou glare at him, blinking out of synch.\n\"I never tell you good morning.\" He continues, unphased by your less-than-impressed reaction. \"I only tell you Good Night. My turn.\"\nThat was...correct. Moon was the one who followed you to bed, but never the one to wake up with you. That was Sun. You never thought to wonder if they'd prefer to see how it is to switch. \"God, you're corny. I hate 'sleeping beauty.' Makes me cringe.\"\n\"I can use a different name I have for you.\" Moon's smile turns slightly wicked.\n\"Pass.\"\n\"I can try a different way-\"\n\"I'm going back to sleep.\" With one swift motion, you pull the blanket up to your chin and turn away, back to the animatronics. \"Wake me up in an hour.\"\nA low, amused chuckle comes from the static voice box behind you, and the presence on the bed shifts, the weight moving as Moon's head comes down to your face directly. \"I won't.\"\n\"Mean.\"\n\"I'll wake you when the sun rises.\"\nYou blow air out from your nose and onto his face. It swivels, the ball falling with it. \"You're totally preventing me from getting my extra hour of sleep, by the way.\"\n\"A shame.\" Moon hums. The face disappears from your vision, and the darkness of the room is all you have to see. Against your back, you feel the bed shift, and an arm comes up underneath you. The covers are lifted (not like you didn't help with that) and the space behind you is occupied now. Your legs brush up against star-pattern pants, a metal arm secured around your waist. \"We will make it two hours.\"\nYou realize with faint defeat that you never got your water, but you're already lulling back to sleep too late to try. \"Don't make me late.\"\n\"Hush.\" The other hand finds its way over your eyes. Moon's faceplate rests on your head, his t-shirt presses into your back. \"Good morning.\"\n\"G'morning.\" You mumble, shifting backward further into the animatronic, and letting your lingering sleep take you.\n\n\"I just wanted to say. Thank you for protecting me\" - bittysteam on tumblr\n\n \nThe damage to their body was... extensive. Not life-threatening. But extensive.\nYou don't know how you're going to fix this right now, but Gramps has a toolbox in the shed, and there's duct tape underneath your kitchen sink, and Eclipse is very, very patient as he sits numbly on your coach, of few words and more looks, as you pluck out charred wires and plastic out of the hole in his arm to the robot that's probably held together less out of reasonable sense and more out of will and magic that you don't understand.\nThe arm that was torn off has sharp edges in the metal that cut at your fingertips when you try and brush it off, and you don't know if the animatronic feel pain if you were to try and sand it. So, in a comical fashion, you've put an oven mitt over the end of it, taping it to hold its place.\nThe other arms are laying limp, two on the couch, resting with its palm up in your lap. There's fried wiring around the elbow, dents in the forearm where Monty grabbed him, and openings that you can't tell look like they're from wolf claws or the steel of a knife.\nThe sight of them makes the wound under your own bandages ache for a moment, but you swallow back the wet soreness in your throat and continue working. The hospital gave you decent pain meds. You needed to stay on task while they were effective.\n\"Lift, please.\" You talk quietly, fearing that your voice may crack.\nEclipse doesn't respond, eyes locked onto the television. The news is playing, covering the fire. The sound is low so not to bother you. Still, the animatronic shifts his limbs for you, head turned towards the screen.\nThere's melted plastic stuck to his forearm, and you're peeling it off with chipped fingernails and whatever willpower you have left, flicking off the pieces onto the carpet to vacuum up later when you have the energy. Leaning back, you gather the duct tape from the coffee table, pulling out a strip to cover the hole in his shoulder.\nIt's...not what he needs. But it's all you have. All you can do is pick up the pieces and cover up the damage so it doesn't get any worse.\n\"I'm gonna put this over the opening, okay?\" Two long strips are wide enough to cover this 'wound', and it seals the inside of the wiring away. \"So nothing gets in your chassis. Or falls out.\"\nEclipse doesn't make a movement to acknowledge what you said, staring limply with the default smile toward the news broadcaster detailing the company's statement, and it's an estimate of the cost of damages.\nTheir ability to emote is not currently active, just like their voicebox. Not until they are both fixed. You wish they were active. You wish you could get something, a facial expression, a joke, a sentence, anything. You're taping your friend's fingers together like broken bones only theirs were stuck as claws.\nA warmth travels down your face, past your mouth and you don't feel the wetness until it hits your neck. Lips pressed together into a thin line, you rub the tear away. You'll do that on your own time. Not now.\nWhen you blink, you see a shift in the corner of your eye. Eclipse is staring at you now.\nYour tongue feels swollen in your mouth. \"I, uh-\" You busy yourself with his hand, grey-tainted with burned-off paint and scorched sharp points. \"I wanted to say thank you for protecting me. You know-\" You keep your head low. \"Back then.\"\nHe looks at you with black eyes and still pupils. The crack in his faceplate feels like guilt and sorrow in your ribcage.\nYou missed them saying things. You'd be happy for a stupid nickname, even.\nThe fingers you were treating suddenly tense in your grip, and by instinct, you let them go, until they turn and they fold around your own hand. Long, damaged fingers curl into your own, grasping your hand and holding it along with your wrist.\nYou freeze as Eclipse leans down, and his faceplate presses against your forehead. Not barely, but heavily, firmly, resting in your hair.\nHe lingers there as the news broadcast flashes familiar images on the screen, casting different colors on both of you.\nYou only raise a hand to press your fingertips to the bottom of his faceplate pushing him back as you mummer you needed to remove his ruffled collar so you can clean the soot you've spotted hidden underneath it.\nHe lets you, but the hand not using the rag stays in his hold, and his other comes up to palm away a warmth that falls from your face and onto your neck again.\n\nOooo, for the dialogue prompts \"you should have thought about that before you got into a fight\" and \"I only wanted to help\" I love your works! Your art looks like itd taste like sour patch kids, v nice!! ^^ - themagicheartmailman on tumblr\n\nThe world has not yet adjusted to the flood of robots merging with day-to-day society.\nAt least, not in the form they had taken prior. To say that there was some backlash was undercutting it; using arguments of humanity vs machine to its core, despite the clarity that those walking alongside them weren't just AI made to mimic human traits and personality, but sentient beings that develop their own. There's a difference between a chatbot app and your next-door neighbor who just so happens to be made out of metal.\nStill, there is progress as much as there are incidents. A recent ruling states that all robots don't need to look human in order to receive the same amount of respect and rights (which is fantastic for all of Fazbear's line up of robots, considering they were animals in nature and all, in all franchises and pizza plexes across the country) but there were...incidents too, some of them making the news.\nSo when you're out doing some quick shopping for groceries one day and a stranger with a taut face and a sour attitude starts heckling Sun, and that heckling turns to harassment, and thus turns into him reaching for the back of the animatronic's head and pulling at the vulnerable wires there, you clock him.\nHard, actually. Your knuckles hurt like a bitch, but you don't have time to shake the feeling out from your hand because the guy sends one right back and oh, there you go, tumbling in the isle and knocking baking soda and sugar and other cake ingredients off the shelf as the two of you yell profanities and arguments while Sun has a metaphorical loading symbol over his head while he processes the last five seconds.\nNow you're both banned from that store. The other guy is too, thankfully. Still sucks though. You didn't get to check out the ingredients for the cake.\n\"You're a real mess.\" Sun scolds you, dipping the rag back into the warm water, and bringing it back up to your face. He dabs at the dried blood under your eye, careful not to rub too harshly so as to not irritate the darkening skin beneath it. \"Honestly. That could have gone so much worse-\"\n\"Like pulling wires out of your head?\" You interrupt. You're not too keen about the bathroom being turned into a lecture hall, and the lid of the toilet seat being your 'time-out' spot as he tends to you. \"Yeah, sure. I'll just let the stranger rip out what is essentially your brain cords out of your flat skull and be fine with it.\"\nSun shoots you a look. The default smile is strained.\n\"What?\" You hiss in the silent pause, and not because of the sting of your eye. \"All I'm saying is that this-\" A point to your face, \"-is preferable than the other outcome.\"\n\"Our wires are welded in with steel, so I highly doubt a human could rip them out without some sort of power tool.\" Sun tuts. \"You remember Parts n Service.\"\nHe had a point. The machine in Parts n Service did weld his arm back into place at the time, and all the other repairs since then didn't go without some sort of heat tool to make sure everything was properly molded in place. Still, you frown. \"It's still fucked up that he did that, though.\"\n\"Language.\"\n\"We didn't even get the cake mix.\" A light dab on the eye, you bite your tongue as Sun clears the last of the dried blood from the area. \"Shouldn't have banned us. Now we have to go across town to get groceries.\"\nSun pulls back the rag, stained pink and light brown with old blood, dropping it in the sink to be washed later. \"You should have thought about that before getting into a fight.\"\n\"I was only trying to help!\" You defend, continuing as Sun pulls out the disinfectant in a rather knowing manner. The cut underneath your eye from the guy's ring was about to sting like hell. \"And it's not like I was the one who started it!\"\nHe pours a dab of alcohol onto a cotton ball retrieved from the first aid kit, a small puff of white in between large silocone fingers, it's almost comical how he pinches it into place before crouching back down, the cotton ball hovering over your face. \"Hush. This is going to sting.\"\nYour mouth thins at the underlying tone of Moon's voice in his scolding, leaning away from the offending ball. \"You're such a hypocrite.\"\nA hand comes underneath your chin to hold you in place, thumb pressed into your jawline. \"Stop whining.\"\n\"How would you feel, huh?\" You wrinkle your nose as the disinfectant ball comes closer. \"What would you do if someone attacked me like that?\"\nThe cotton ball presses against the cut and you flinch, hard enough that your shoulders hike up and your neck tenses. It stings like hell, searing for a moment before dulling to an aching throb, a hiss in the back of your dry throat.\nThe Daycare Attendant's thumb keeps in place for a second, then pulls it away, expression unreadable. \"The same thing we did the last time someone tried.\"\nYou grit your teeth, pressing your lips into a thin line as the stinging starts to fade.\n\"Though,\" He continues, pulling the cotton ball away and tossing it into the trash. \"While your help is appreciated, It would be very much appreciated if we were to avoid something like that in the future!\" He waves his hands, the bright smile returning, and Sun's fingers go behind your ear, pulling back out a colorful bandage. \"I think it goes without saying that it makes me very sad to see you all hurt. Not fun at all!\"\nYou blow hot air out of your nose in a huff as he applies the sticky bandage. \"Hypocrite.\"\n\"There you are! Right as rain, dandy and peachy.\" Sun pulls back to observe his handiwork, and there's a slight pause. \"Well, not quite. You've still got a bit of a shiner. I don't think I have a medicine for that one.\"\n\"It makes me look cool.\" You jest. \"I look badass.\"\nThe animatronic sighs, heavy and loaded for a robot with no lungs, though his exasperation is evident in his voicebox. \"Pulling my wires, our wires, please, you're constantly on them-\" He's mumbling, quickly. Still talking even as he cradles your head gently by your jawline, and presses his faceplate to the skin above the black eye. \"Afraid that's all I can give.\"\nYou wrinkle your nose, smiling. \"I think a cake would be great too.\"\n\"Thanks to someone-\" He starts, rising from a crouched position and taking your hand to help you stand. \"It looks like we'll be ordering one from the bakery instead.\""
}