{
    "id": "41514324",
    "url": "https://archiveofourown.org/works/41514324?view_full_work=true",
    "author": [
        "VampireFaun"
    ],
    "title": "Thousand Gold Come-And-Go Stew",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "天官赐福 - 墨香铜臭 | Tiān Guān Cì Fú - Mòxiāng Tóngxiù"
    ],
    "relationships": [
        "Hua Cheng/Xie Lian (Tian Guan Ci Fu)"
    ],
    "characters": [
        "Hua Cheng (Tian Guan Ci Fu)",
        "Xie Lian (Tian Guan Ci Fu)",
        "Feng Xin (Tian Guan Ci Fu)",
        "Mu Qing (Tian Guan Ci Fu)",
        "Mei Nianqing",
        "Yin Yu (Tian Guan Ci Fu)"
    ],
    "additional_tags": [
        "the hua cheng memory loss extra i need in my BONES",
        "xie lian voice: oh i know what trope will solve this problem",
        "Mild Angst",
        "Happy Ending",
        "Objectification",
        "Comedy",
        "Humiliation",
        "Master/Pet"
    ],
    "language": "English",
    "series": "",
    "published": "2022-09-05",
    "completed": "2022-09-09",
    "words": "19,617",
    "chapters": "4/4",
    "comments": "1,019",
    "kudos": "16,233",
    "bookmarks": "4,270",
    "hits": "131,567",
    "summary": "<p>When Hua Cheng loses all his memories of Xie Lian, afflicted by a tricky curse, there’s only one way to get them back: Xie Lian has to get Hua Cheng to kiss him.</p>\n<p>It shouldn’t be too difficult, right?</p>\n<p>Xie Lian has a plan.</p>\n<p><br>“Greetings, Chengzhu,” Xie Lian said. “Apologies for the intrusion. Actually, I’ve been gifted to you by the heavens as a…”<br>His voice caught.<br>“I mean, to—”<br>Xie Lian’s cheeks suddenly felt hot, and his palms grew damp under the rope binding his arms together. Beneath Hua Cheng’s piercing stare from above, he lost his cool.<br>“As your,” he stammered. “Um, as—well—if you want, I’ve been sent to you as—I’m here to be your—”</p>",
    "notes": "<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>HELLO EVERYONE!!! WELCOME TO HELL</p>\n<p>THE TITLE OF THIS FIC COMES FROM THIS LINE IN <a href=\"https://eastasiastudent.net/china/classical/li-bai-jiang-jin-jiu/\" rel=\"nofollow\">THIS POEM</a> BY LI BAI:<br>天生我材必有用 / 千金散盡還復來<br>Heaven made me - my abilities must have a purpose / I spend a thousand gold pieces completely, but they'll come back again.</p>\n<p>TWITTER PROMO: <a href=\"https://twitter.com/VampireFaun/status/1566789658213863424?s=20&amp;t=rsFd9H2Nm9Uf2hV5y7NhGw\" rel=\"nofollow\">HERE</a></p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>HELLO EVERYONE IT'S ME, THE KEYBOARD CLOWN!!!! THE RESPONSE TO THE LAST CHAPTER WAS INSANE AND THERE IS NO WAY I CAN ANSWER ALL THE COMMENTS BUT I READ THEM ALL AND THAMK YOU EVERYONE, I GIVE YOU A LITTLE KISS</p>\n<p>NEXT CHAPTER SHOULD BE SOON.........OOOO WHATS GONNA HAPPEN.....</p>\n<p>TWITTER PROMO: <a href=\"https://twitter.com/VampireFaun/status/1567197293559906304?s=20&amp;t=Yj_Uz-8LHl9z2Nqz2UmI0A\" rel=\"nofollow\">HERE</a></p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>.<br>.<br>.<br><a href=\"https://imgur.com/PXaVUue\" rel=\"nofollow\"></a><img src=\"https://i.imgur.com/PXaVUue.png\" title=\"source: imgur.com\"><br>IM SORRY CLASS</p>\n<p>ALSO LOTS OF YOU ARE HAVING ABSOLUTELY BIG BRAIN SHERLOCK HOLMES IDEAS IN THE COMMENTS WHICH I DIDNT EVEN CONSIDER AND ARENT GONNA BE IN THE FIC BUT I RESPECT THE FUCK OUT OF THE FACT THAT YOU ALL STILL HAVE BRAIN CELLS</p>\n<p>FINAL CHAPTER OUT BY MID-AUTUMN FESTIVAL (SATURDAY) OR ELSE, SEE YOU THEN!!!!</p>\n<p>TWITTER PROMO: <a href=\"https://twitter.com/VampireFaun/status/1567581208929861638?s=20&amp;t=TcAJrt9tKTF8ogCCanqvtg\" rel=\"nofollow\">HERE</a></p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>AAAND THAT'S A WRAP!!!!!!! HAPPY MID-AUTUMN FESTIVAL EVERYONE, I'M EARLY!!!!! WOOHOO I HOPE IT LIVED UP TO THE HYPE</p>\n<p>THAMKS FOR ALL YOUR SUPPORT, I CANT BELIEVE THIS ORDEAL IS OVER. IM FREEEE *GETS BURIED UNDER WORK IVE BEEN NEGLECTING* NEVER MIND</p>\n<p>BUT FOR REAL THE AMOUNT OF PEOPLE READING THIS WAS SHOCKING, IT FEELS FUNNY TO IMAGINE LIKE A WHOLE AUDITORIUM FULL OF PEOPLE SITTING PATIENTLY WHILE I NARRATE ABOUT BALLS THROUGH A MEGAPHONE</p>\n<p>ALSO, SINCE IVE HAD PEOPLE ASKING, IF YOU WANT MORE BULLY HUA CHENG I SUPPOSE <a href=\"https://archiveofourown.org/works/35350801\" rel=\"nofollow\">THIS FIC</a> IS SIMILAR IN FLAVOR. IT'S JUST A LITTLE MORE WEIRD</p>\n<p>ANYHOW THAT'S ALL FOR NOW!!! SEE YOU IN THE NEXT ONE</p>\n<p>TWITTER PROMO: <a href=\"https://twitter.com/VampireFaun/status/1568380336865951745\" rel=\"nofollow\">HERE</a></p>\n<p>ALSO I AM WRITING A NOVEL, IF YOU LIKE VAMPIRES COME LOOK <a href=\"https://twitter.com/amaranthmoor/status/1683977437288484864?s=20\" rel=\"nofollow\">HERE</a></p>",
    "text": "Xie Lian blinked up from his position, kneeling on the floor of Paradise Manor’s main hall.\nWith his arms crossed, Hua Cheng stared down at him and raised a brow. It was a long, silent moment before he spoke:\n“And you are?”\nFor a moment, startled by that bored, frigid look from Hua Cheng—the likes of which had only ever been directed at other people—Xie Lian was speechless. Quickly gathering his wits, however, he bowed his head.\n“Greetings, Chengzhu,” Xie Lian said. “Apologies for the intrusion. I’ve been gifted to you by the heavens as a…”\nHis voice caught.\n“I mean, to—”\nXie Lian’s cheeks suddenly felt hot, and his palms grew damp under the rope binding his arms together. Beneath Hua Cheng’s piercing stare from above, he lost his cool.\n“As your,” he stammered. “Um, as—well—if you want, I’ve been sent to you as—I’m here to be your—”\n \n🥮\n \n“ABSOLUTELY NOT!” Feng Xin and Mu Qing shouted together, slapping their hands down on the table.\nXie Lian scrambled for his tea. “Careful, you’ll knock something over—”\n“XIE LIAN!”\n“YOUR HIGHNESS!”\n“I hear you, I hear you, you don’t have to shout!” Xie Lian carefully cleaned off the table. “Why not? It’s just San Lang.”\nFeng Xin held his head. “JUST San Lang? Holy shit, you really don’t get it—”\n“He was only tame around you because it was you,” Mu Qing said sharply. “You have no idea what it’s like to face him when he’s not doting over you. Now that he doesn’t even know who you are, he’ll treat you the same as everyone else.”\n“You guys don’t know him,” Xie Lian insisted. “Whether or not he knows who I am, he’s not an unreasonable person. If I just explain the situation—”\nMu Qing stared at him like he had three heads. “If someone came up to you and said ‘kiss me and you’ll remember we were married,’ would you do it?”\nXie Lian was about to retort, but he was interrupted by a nearby voice:\n“They’re right.”\nThe three turned to see Mei Nianqing set down his cards. Yin Yu, sitting across from him, put down his cards as well.\nMu Qing rolled his eyes. “Welcome to the conversation, Guoshi. Did you win?”\n“Don’t be RUDE, young man! I stopped because I was obviously about to win, so there was no more point. Apologies, Your Highness Yin Yu, I have trouble reining in my skills sometimes.” He swept the remaining cards off the table with sweaty hands. “As I was saying: they’re right, Your Highness. It isn’t that this ghost king of yours simply doesn’t remember you, like those nice stories where you hold his hand or make his favorite food and he says, didn’t you make me this congee when I was sick once?, and everything is all better. It’s like you’ve NEVER met.”\n“Not only that, Your Highness,” Yin Yu added quietly. “The curse affected every ghost in ghost city, too. All he has to do is ask a fellow ghost, and they’ll say you’re lying.”\nXie Lian put his fist to his chin, thinking deeply. “But something must have stayed, even with a curse like this. After all, he rose to power over ghost city for a reason. Wouldn’t he wonder why? There must be a hole in his memory.”\n“Aha, but that’s the tricky thing about this curse!” Mei Nianqing declared. “It’s worse than he doesn’t remember, it’s that all of his memories have rearranged to fit the loss. He might think he rose to power because a heavenly official called him ugly, or because he’s looking for his lost pet. Whatever works best has replaced you. If he has any statues or drawings of you around, they’ll be invisible to him; there’s no trace left at all.”\nXie Lian nodded. “I understand. And it all goes back to normal as long as we kiss?”\n“As long as he kisses you,” Guoshi pointed out. “I know you young people just mash your faces together these days, but there’s a difference when it comes to—”\n“So I just have to make him want to be with me again,” Xie Lian said slowly. “That shouldn’t be so difficult, right? I know what he likes…”\nYin Yu nodded. “But you don’t have much time. When I left, he was already making plans to invade parts of the other territories. If it goes any further, it’ll be troublesome.”\nThey all sat in silence for a few moments, until Xie Lian nodded.\n“Then it’s settled,” he said. “There’s only one thing we can do. Guoshi, I’ll need your help.”\nHe raised his head and smiled, clapping his hands together.\n“You know how to make a cursed shackle, right?”\nFor the second time, Feng Xin and Mu Qing stood up again and shouted together—\n“ABSOLUTELY NOT!”\n \n🥮\n \nNow Xie Lian was getting more and more frazzled, fixed under Hua Cheng’s stare. He’d rushed so much to get to this point that he’d forgotten to think of the right words for it.\n“You’ve been sent as what,” Hua Cheng said. “I’m running out of patience.”\n“As—a gift,” Xie Lian said finally, and smiled. “From the heavenly court. So that you’ll spare the other territories for now.”\nHua Cheng’s brow went higher. “Why would I want something like you.”\nThis was the part that Xie Lian dreaded most. Feeling the last of his face crumble, he took a deep breath and spoke:\n“To…” Xie Lian’s voice cracked. “To serve you in bed?”\n“…”\n“…”\nSlowly, with a clink of silver chains, Hua Cheng sank down to Xie Lian’s eye level. Without its usual warmth, the stare of his one eye was utterly chilling.\n“To serve me in bed,” he repeated.\n“…en,” Xie Lian said, nodding. He could feel the sweat beading on the back of his neck. “That’s right.”\nHua Cheng stared a moment longer. Then—\n“Get lost.”\n“I can—what?”\n“Leave, and tell the heavenly court to send a more convincing assassin next time.” Hua Cheng swiped out with a long black nail, dissolving the ropes binding Xie Lian’s arms, and turned to leave. “You have one hour to be out of the boundaries of ghost city before I kill you. Go before I change my mind.”\nStartled, Xie Lian got to his feet. “But, San L—Chengzhu, I’m really not an assassin!”\n“Then you’re a spy. Scram. I won’t give you any more warnings.”\n“I can do other things. I don’t have to serve you in bed, that’s just what I was sent for. I can also cook, or help with cleaning, or teach you calligraphy. Look!” He raised his neck. “I have a cursed shackle, I’ve been banished; I really don’t have anywhere else to go.”\n“That’s not my problem.”\nXie Lian winced like he’d been stung. He’d always known Hua Cheng didn’t take well to begging—unless, of course, the begging had come from Xie Lian; but Mu Qing had been right. He couldn’t deal with Hua Cheng like he used to anymore. Seeing as an appeal to emotion would be less than useless, Xie Lian switched tactics:\n“You’re spending all your energy on posturing,” he said quickly. “You want to make me leave in order to send a message to the heavens that you won’t negotiate with them.”\nHua Cheng didn’t reply to that, so Xie Lian steeled himself and steadied his voice, continuing:\n“It’s not a bad tactic, but you’re ignoring the advantages of keeping me. One, it looks powerful to own a former heavenly official. Two, it gives you a bargaining chip in case things go wrong. They sent me as a bride, not a hostage; they lose face if I get killed by you. Three, they sent me as a gift to gain your favor, so there’s no agreement made. You can attack whatever you want all the same; who’s going to stop you? If you’re afraid I’m an assassin or a spy, you can lock me away somewhere. My shackle seals my spiritual energy away, so—”\n“So I can do anything I want with you?” Hua Cheng said dangerously.\nIt wasn’t a question; it was a warning.\n“En,” Xie Lian said, without hesitation. “Anything.”\nHua Cheng turned around, giving a humorless smile, and gestured.\n“Then go to the kitchen, Your Highness, and make my evening meal.”\nThe way he’d said Your Highness had been all wrong, making Xie Lian’s heart sink; there was no devotion in it, just disdain. Still, he nodded and bowed.\n“Right away, my Lord!”\n \n🥮\n \nXie Lian hummed as he cooked, lifting the lid off the pot in the kitchen to check his progress.\nSure, Mu Qing had been right; the way Hua Cheng had talked to him was petrifying, arrogant, exactly like he’d always spoken to everyone except Xie Lian. Dealing with Hua Cheng like this was certainly challenging, there was no doubt.\nHowever, Xie Lian hadn’t lost heart. After all, he still had an advantage: he knew exactly what Hua Cheng liked and disliked, what amused him, what bored him. With all that knowledge in his pocket, how hard could it be to work his way back into his favor?\nFor example, he was making Hua Cheng’s favorite meal, a dish Xie Lian had invented and named all by himself: Thousand Gold Come-And-Go Stew. When he’d told Hua Cheng the name, he’d laughed for an entire minute before tasting it, and then set the spoon down to declare: “Gege, you’ve really outdone yourself. This is my favorite dish yet.”\nGiving himself a conspiratorial smile, Xie Lian ladled a generous portion of stew into a bowl. Surely Hua Cheng’s tastes hadn’t changed too much?\nHis bravado lasted until he was in front of the dinner table. He’d shared this table with Hua Cheng more times than he could count. Now, it was set for only one place, and Hua Cheng was waiting.\n“That took you long enough,” he said. He gave a lazy but dangerous look, crossing one leg over the other. “Well? Let’s see it.”\nXie Lian took a deep breath.\nRight. It was Hua Cheng, but it wasn’t his Hua Cheng.\n“Of course, Chengzhu,” he said, setting down the bowl in front of him. “Sorry for the wait, I wanted to make sure it was perfect.”\nHua Cheng only glanced at the bowl before looking back to him. “Oh? What is it?”\n“It’s my own recipe,” Xie Lian replied with a smile. “It’s called Thousand Gold Come-And-Go Stew.”\nHaving said that, he clasped his hands in front of him and waited.\nHua Cheng did not laugh. He didn’t even chuckle. He did smile, but it was a cold smile. “Is that so?”\nFeeling a chill go up his spine, Xie Lian nodded. “En, en.”\n“Taste it.”\nXie Lian blinked. “What?”\n“Taste it,” Hua Cheng said pleasantly. He took up a bit of stew with the spoon, then held it on. “Go on.”\n“I already did, in the kitchen—”\n“You either do it willingly in front of me, or I force it down your throat.”\nThe realization hit Xie Lian like lightning, and then he wilted. “It’s not poisoned…”\nHua Cheng uncrossed his legs to stand—\n“Fine, fine, fine!” Xie Lian said quickly, reaching out. “I understand, it’s reasonable to worry. Look, I’ll try it.”\nTaking the spoon from Hua Cheng, he made a show of putting the whole thing in his mouth, filling his cheeks.\n“Swallow,” Hua Cheng ordered softly. “Chin up, so I can see.”\nFeeling ridiculous, Xie Lian lifted his chin and let his adam’s apple roll once, then twice. The soup was still hot, making him flush as it went down his throat. Once he’d finished, he wiped his mouth off with his wrist and handed back the spoon. “See?”\n“En, I see.”\n“Then why not try some—”\n“You’ve used a poison that only targets ghosts,” Hua Cheng went on. “That’s clever, you’ve thought this through. You clearly aren’t stupid.”\n“It’s really not poisoned…”\n“We’ll see,” said Hua Cheng, and lifted one arm.\nFrom his vambrace, a single silver butterfly peeled off. It fluttered for a moment before settling on the edge of the stew. On the edge of the bowl, it flapped its wings; it was drinking.\nFor a long moment, both of them waited in silence.\n“…”\n“…”\nThe butterfly’s wings slowed, and it fell frozen to the table.\nWhite-hot panic flashed through Xie Lian, and he took a step back, his heart pounding. He hadn’t poisoned the stew, but he’d forgotten to consider the effect of his cooking on anyone or anything that wasn’t Hua Cheng. Having messed up like this, if he had to fight Hua Cheng with a cursed shackle, there was a possibility that he might actually—\nHe spoke quickly. “Chengzhu! I didn’t—I really didn’t poison it!”\n“Don’t worry,” Hua Cheng said calmly, his eye sharp. “You don’t have to say anything.”\nXie Lian’s chest tightened; his hands trembled. “I’m not lying. You can make me drink a truth potion; I can swear on my life that it wasn’t—”\n“I said, you don’t have to say anything.”\nOut of breath, Xie Lian struggled to speak. “Why would I do something so obvious? If I was trying to poison you, why would I be so sloppy? Wouldn’t I know that you’d test it first? You said it yourself—”\n“I know,” Hua Cheng said, raising his voice. “Stop making random excuses. I know it’s not poisoned.”\nXie Lian stopped short. “You know?”\nLifting a finger, Hua Cheng coaxed the butterfly back up. It spun dizzily a few times before returning to his vambrace, melting back in. “I know,” he said. “The butterfly isn’t dead, it just didn’t like the food. It still passed the test.”\nRelief washed over Xie Lian’s whole body, and his legs went weak. “…good. Right, it’s not poisoned. So why not try some, my Lord?”\nIn just a few moments, Xie Lian had gone through a wide range of emotion—from hope, to terror, and now back to hope. Even after all that mess, this was still Hua Cheng’s favorite dish. Would it work?\nWith a disinterested look, Hua Cheng lifted the spoon and took a large portion. Leaning forward, he sipped out of it.\nXie Lian waited with bated breath. Then—\nA full-body shudder went through Hua Cheng, a spasm that made him fold and lean over the side of his chair, and he spat out his mouthful in a fit of coughing.\nNo way.\n\nNo way.\n\n\nAll those times back then when Hua Cheng had said he'\nd liked his cooking, could it be that he’d only been—?\n\n“Are you okay?” Xie Lian fumbled out, reaching out to pat Hua Cheng on the back. “Are you choking? Did you eat it too fast?”\nHua Cheng didn’t say anything. He’d stopped coughing, but he still had his hand over his mouth.\nDrawing a fan out of his sleeve, Xie Lian snapped it open and fanned air into his face. “It’s okay, it’s okay…what’s wrong? You don’t like it?”\nHua Cheng held up a hand, stopping the frantic fanning. Then, he sat up again, steadying himself. “So you’ve never cooked.”\n“I cook all the time…” Red with shame, Xie Lian picked up the bowl and turned to go back to the kitchen. “Is there not enough salt? I can take it back and add more.”\n“More salt?” Hua Cheng said hoarsely, almost in disbelief.\n“Then—then less salt. I’ll add more water to dilute it—”\nHua Cheng stood up. “Stop.”\nXie Lian stopped. He heard the sound of Hua Cheng walking towards him, and stared at the floor until the familiar red robes filled his line of sight.\nHua Cheng loomed over Xie Lian for a moment, then took the bowl. “This isn’t salvageable. I don’t know how you ate it, but you won’t be cooking again.”\n“Okay,” Xie Lian said quietly. “Sorry.”\nHua Cheng watched him for a few moments longer.\nThen, he tilted his head back and started laughing.\nAt the sound, Xie Lian withered further. It wasn’t the warm laugh he usually gave when Xie Lian had done something funny; it was the ice-cold laugh he showed off before he struck someone down. Xie Lian’s lips trembled at the unfriendly sound.\n“I see what this is now,” Hua Cheng sighed. “It’s not your fault. You’re just a pawn, don’t you see?”\n“A pawn?” Xie Lian said weakly.\n“They sent you to make fun of me.” Hua Cheng smirked. “They really did gift you to me as a bride—that is, a bride straight from the underworld. If your cooking is like this, I can’t imagine what your service in bed would look like.”\n“…!”\nThat was too much. The words pierced straight through Xie Lian’s chest. He’d always known his cooking was bad, but—was he also bad in bed? He always followed Hua Cheng’s instructions, doing whatever was asked of him. Hua Cheng was so patient, even when Xie Lian was shy, always teaching him how everything worked. Recently, Xie Lian had even started initiating things on his own, and Hua Cheng had always told him how proud he was. Had that all been fake as well?\nXie Lian couldn’t help it. His eyes filled with tears, and he pressed his lips together, staring at the floor.\nA finger slipped under his chin, lifting it up. With his broken expression, he faced Hua Cheng.\n“Oh,” Hua Cheng said matter-of-factly. “You’re crying.”\n“I’m just tired,” Xie Lian replied.\nIt was true; he was exhausted. He hadn’t slept well since two days ago, when Yin Yu had stopped him at the gates of ghost city and told him what had happened. One whole day had been spent hunting down the monster who’d done it, then another day planning what to do next. He’d barely slept.\n“You’re not crying because you’re tired.” Hua Cheng said, amused. “Are you feeling humiliated?”\n“No. It’s just that you said I wouldn’t be able to cook again.”\nAt that, Hua Cheng raised a brow. “You want to cook again? Why?”\n“I want to try again,” Xie Lian mumbled. “I want to fix it…”\n“You want to fix it,” Hua Cheng echoed, letting go of his chin.\nAs Xie Lian closed his eyes, struggling to contain his feelings, Hua Cheng paced around him, looking him up and down. The clink-clink of his footsteps was crisp in Xie Lian’s ears. For the first time in his life, Xie Lian didn’t find it comforting; it was frightening. He really didn’t know what Hua Cheng would say next.\nFinally, Hua Cheng stopped in front of him. “Fine,” he said. “You can try again.”\nXie Lian opened his eyes and looked up, suddenly hopeful; but his hope faded when he met Hua Cheng’s expression. Xie Lian knew this expression; this was the amused the look Hua Cheng gave any random new toy that he liked, whether it was a gaudy piece of jewelry he’d coax Xie Lian into wearing or a gold foil palace he was about to knock down. It was the look he gave his playthings, not his god. \nRemembering how Hua Cheng treated his playthings when he grew bored of them, Xie Lian swallowed down dread; but for now, at least, Hua Cheng still seemed entertained. Lifting a hand, he let a butterfly flutter out of his sleeve.\n“Follow this,” he said. “It’ll take you to your room. When it’s time to come out again tomorrow, it’ll lead you. Don’t try doing anything else. It’ll keep a close watch on you.”\n“Understood,” Xie Lian said, nodding wearily. “Thank you for your generosity, Chengzhu. Good night.”\n \n🥮\n \nLying in bed, Xie Lian snuck a peek at the butterfly.\nIt sat on the nightstand, glowing faintly, casting silvery light over the edge of the bed.\nDespite the events of the day, at the sight of the small creature, Xie Lian’s heart couldn’t help but melt. He remembered how the butterflies would crowd around him, ticking his cheeks and his eyelashes, settling over his shoulders. Maybe some of that hadn’t changed. Everyone else was so unreasonably afraid of them, but weren’t they cute little creatures at heart?\nXie Lian lifted his hand from the bed, extending a finger towards it.\nThe butterfly didn’t move.\nMaybe it hadn’t seen, Xie Lian thought. He reached his hand a little further, until his finger was right in front of the butterfly.\nIt still didn’t move.\nMaybe it hadn’t understood that it could land on him, Xie Lian thought. He rolled over a little in his bed, reaching out his other hand to try to coax it on, when—\n\nShing!\n\nWith one flap of sharp silver wings, a slice of red flashed across Xie Lian’s finger.\nXie Lian winced, snapping his hand back, and gazed quietly at the cut. As he watched, a drop of blood beaded up and rolled down his hand.\nSmearing it away with a sigh, Xie Lian settled down and tried to sleep.\nFor the first time in two years, Xie Lian woke up hungry the next morning.\nIt took a moment to realize why, before he sat up and remembered his situation: there was a cursed shackle around his neck. What’s more, he hadn’t eaten anything last night except for a spoonful of his rejected stew.\nHis stomach growled, and he felt somewhat pathetic; but something fluttered across his vision, and he looked up, cheered. “Oh, it’s you. Good morning.”\nThe butterfly settled on a bedpost, and Xie Lian smiled at it.\n“Sorry for startling you last night. I like butterflies too much, it was my fault. I’ll ask if I want to touch next time, I won’t just reach for you.”\nIt wasn’t clear whether the butterfly heard or understood, but it fluttered off the bedpost and towards the door.\n“Is it time to go?” Xie Lian scrambled off the bed and followed it, bare feet padding across the ground. “Actually, before we go, can we stop by the kitchen? I’m a little—”\nBut he stopped short, once he came around the bed. There was a meal tray with a few buns and other breakfast foods set out on a table, next to a set of fresh white robes which had been folded neatly into a square. The butterfly settled next to it.\nAs expected, Xie Lian reasoned, this just had to be Hua Cheng’s style: he tended to be impassive, but not cruel—at least, when it concerned those who weren’t his enemy.\nOr maybe he just wanted his new plaything to be active enough to amuse him.\nA bit morose, Xie Lian sat down to eat.\n \n🥮\n \nWhen Xie Lian entered the main hall of paradise manor, following the silvery butterfly, Hua Cheng didn’t even look in his direction. He was already sitting on the divan with one leg crossed over the other, staring out towards the entrance of the hall.\n“There you are,” Hua Cheng said, without turning. “Come.”\nXie Lian walked up to the platform, giving a small bow. “Thank you for the food this morning.”\nHua Cheng didn’t acknowledge the gratitude, merely continuing on: “There’s a few powerful ghosts coming today, hoping to forge an alliances. You’re just here for looks. Don’t say anything.”\n“Understood,” Xie Lian said, despite the twinge of pain in his heart. When would his Hua Cheng ever have been so callous? Nursing his hurt, he walked around the divan to stand behind it.\nAt that, however, Hua Cheng glanced back. “What are you doing?”\n“Me?” Xie Lian pointed at himself. “Just finding a place to stand…”\n“Stand?” Hua Cheng said, with some amusement. “Your Highness, you said it yourself yesterday, very accurately: it looks powerful to have ownership over a former heavenly official. If I own you, do you think you’re going to stand?”\nSpeechless, Xie Lian stared at him. “Then where should I…”\n“Kneel,” Hua Cheng said simply. He picked up a cushion from the divan, tossing it to the floor by his boots. “Here.”\nXie Lian said a silent prayer in his head: San Lang, when you get your memories back, please don’t kill yourself. With that, he obediently came around and knelt by Hua Cheng’s legs. It wasn’t uncomfortable, only strange. He could faintly smell the leather of Hua Cheng’s boots.\nBut Hua Cheng wasn’t done. After a few moments, he looked down and patted his thigh. “Here.”\nStartled, Xie Lian looked up. “Here what?”\n“Put your head here.”\nXie Lian said another silent prayer: San Lang, when you get your memories back and try to kill yourself, at least please survive the attempt. With that, he adjusted his position and laid his head against one powerful, red-clothed thigh. This was actually quite comfortable, all things considered—but he could feel his face crumbling, and it only crumbled further when a delicate hand settled over his head.\n“That wasn’t so bad, was it?” Hua Cheng mocked, running a sharp nail over Xie Lian’s cheek.\nXie Lian shook his head.\n“Good. Nice and quiet,” Hua Cheng said, pleased. Then, he looked up. “Send the first one in.”\n“Yes, Chengzhu!”\n“Right away, Chengzhu!”\nXie Lian kept his ears open and his eyes half-lidded, gazing down at the scene. Anything could be useful, so he had to keep aware.\nThe first ghost was predictably cowed by Hua Cheng petting a god, stuttering and stammering his way through his opening remarks. After that, however, he launched into his proposal: he would take up defense duties in ghost city for a year in exchange for Hua Cheng killing a particularly bothersome priest.\nHua Cheng listened, barely asking any questions, giving a tap of his foot that Xie Lian had long learned to recognize as boredom. The hand that had merely settled on Xie Lian’s head earlier had begun to absentmindedly pet him, much like a fine lady might caress a dog—fingernails tracing through Xie Lian’s hair, back and forth, again and again. Xie Lian was mortified, but he closed his eyes and held still.\n“Why would I need help defending ghost city?” Hua Cheng said finally, interrupting the ghost. His patience was clearly gone.\n“W-well, milord, it isn’t that you don’t already, but I was thinking—”\n“You can go. Wait outside, I’ll have someone send over my decision.”\n“Th-thank you for hearin’ me out, milord! Thank you, thank you—”\n“Get out.”\nThe ghost scrambled out. Once he was gone, Hua Cheng looked over at Xie Lian. Then, without a word—\nHe bent down and wrapped an arm around Xie Lian’s waist, hoisting him up onto his lap.\nXie Lian froze in shock as he was dumped onto the divan. “Sa—Chengzhu?!”\n“Lie across the divan, put your head on my legs,” Hua Cheng said. “It’s easier to reach.”\nSpilled across Hua Cheng, Xie Lian looked up at him in question. At the sight of Hua Cheng’s blank expression, however, he quickly looked down again and tried to settle on his side, crossing his arms beneath him and turning his face turned towards the entrance of the main hall. With his head nestled into the sumptuous robes of Hua Cheng’s lap like this, he couldn’t see what kind of face Hua Cheng was making. “…like this?”\nFrom Hua Cheng’s voice, it was clear he was smirking. “For a heavenly official, you certainly adjust quickly to being a lap pet.”\nAren’t you also adjusting to this situation a little too well? Xie Lian thought helplessly. He didn’t respond, though; there wasn’t anything to say that would make his situation less pathetic.\nRunning a sharp fingernail down the curve of Xie Lian’s cheek, Hua Cheng laughed coolly. “Obedient,” he praised mockingly. “Do you find it so comfortable, being in my lap?”\nXie Lian couldn’t hold back anymore. “A better question: is it comfortable for y—?”\n“Shhh,” Hua Cheng interrupted, then gestured to his attendant. “Bring in the next one.”\nIf the first ghost had merely stammered at the sight of a god at Hua Cheng’s feet, the second one outright went silent with shock at the sight of a god with his head on Hua Cheng’s lap. Still, after a whole ten seconds of silence, he launched into his proposal: if Hua Cheng defeated a rival savage-level ghost for him, he’d send over ten chests of gold.\nWhile he was explaining the details, however, Hua Cheng was clearly distracted with his new pet. He braided a section of Xie Lian’s hair, coiled another section around his finger until it turned wavy, and then directed his attention towards Xie Lian’s hair ribbon. After messing with it a bit, he slowly and gleefully pulled it free, seeming more like a child opening a present than a ghost king. Without the ribbon, Xie Lian’s hair spilled out freely over Hua Cheng’s lap.\nHe’s getting distracted… Xie Lian thought, struggling to keep track of what the ghost was saying while increasingly bold hands played with him; at one point, he had to lift a lock of hair from over his eyes. At the same time, however, a faint feeling of guilt gave him pause.\n\nWhen San Lang still had his memories, was I a distraction for him, too? \n\nThere was many a time during the past year when Hua Cheng had neglected his duties, mostly in order to do things like accompany Xie Lian to the market or spent the afternoon with his head in Xie Lian’s lap as he meditated. Wasn’t that somewhat of a fault?\nFeeling more dejected by the second, Xie Lian barely noticed when Hua Cheng’s hands found his ear, twirling his earring in place—at least, until Hua Cheng spoke, completely ignoring the ghost still speaking:\n“A red coral pearl,” he mused.\nAt that, Xie Lian finally broke the rules. “My Lord,” he whispered. “The guest…”\nHua Cheng didn’t even look up, but he addressed the ghost: “Why would I need ten chests of gold? I have more than ten times that already in wealth.”\nThe ghost dissolved into stammering. “But—but I can also give—”\n“Get out. I’ll send someone with my decision.”\n“Of course, Chengzhu. I await your—”\n“Scram.”\nThe ghost scrammed.\nDespite his position, Xie Lian couldn’t help but scold him a little. “Shouldn’t you have listened? They were important proposals.”\n“Were they?” Hua Cheng said lazily. “Would you have taken either?”\n“No,” Xie Lian admitted.\n“And why is that?”\nAfter a moment’s thought, Xie Lian replied slowly. “The first is too risky. It’s uncertain who this priest really is; if you kill him, ten more priests might replace him to come hunt down ghost city.”\n“And the second?”\n“The second isn’t worth it. You’d be better off making an alliance with the savage-level ghost you’re being asked to hunt down; if a ghost is so powerful that he’s making others worry, he’d make a better ally than a random ghost with a lot of gold—”\nAbruptly, Hua Cheng turned Xie Lian’s head up to face him, holding his chin in a tight grip. With his cheeks pressed together in such a way, Xie Lian could only look up with a ridiculous expression.\n“So you make a good ornament, and you can even use your head,” Hua Cheng said lazily. “I’m bored. What else can you do?”\nXie Lian responded with a voice muffled by the strong grip on his cheeks. “I can…spar?”\n \n🥮\n \nUsually, the one thing that could cheer Xie Lian up was sparring, and today was no exception.\nWhen it was like this, he could pretend everything was the same; Hua Cheng’s fighting style was the same as always—if a little more defensive, due to his unfamiliarity with his opponent—while Xie Lian, of course, knew Hua Cheng’s moves like the back of his hand. The excitement in the air felt the same, too; once Hua Cheng had realized that he had a true opponent in Xie Lian, his eye flared and his movements grew more savage.\nIn fact, they were both getting worked up, building up sweat as they crossed swords in the courtyard, spinning and panting, when—\nHua Cheng left an opening.\nInstinct took over, and Xie Lian was about to swing for it, but he froze.\nWhen they sparred back then, Xie Lian would stop just before hitting a vital point. It wasn’t like Hua Cheng could die from a sword wound, being a ghost, but it would certainly be painful; so Hua Cheng knew to freeze when he knew the strike was coming, trusting Xie Lian to stop on time.\nWith this Hua Cheng, however, there was no such trust. Hua Cheng would definitely keep fighting, and possibly get hurt—what could Xie Lian do?\nBut in the instant that Xie Lian stopped to think, all of a sudden—\nSomething slammed into him at full force. \nThe next thing he remembered was tumbling over and over, colors flying past his vision, grass hitting his robes, and then he was being pressed down to the ground with a sword beneath his chin. When his sight cleared, the only thing he saw was Hua Cheng’s face; it was right above him, so near that he could see his own startled gaze reflected in that one dark eye.\n“You missed your chance,” said Hua Cheng. “Why?”\nXie Lian was still catching his breath. “I wasn’t fast enough—”\n“You were fast enough, but you stopped.”\n“I could’ve hurt you.”\n“I’m a ghost. I wouldn’t die.”\n“It can still hurt.”\n“Who cares?”\nXie Lian was about to respond, but he suddenly couldn’t speak. It was hard not to take note of the position they were in: Hua Cheng’s body was pressing him into the ground, his leg slotted between Xie Lian’s, his sword a hair away from grazing his neck, his sharp eye swallowing any hint of expression in Xie Lian’s face. In a position like this, saying something like I care if you get hurt, it would be…\n“I’m hungry,” Xie Lian blurted out.\nHua Cheng blinked, taken aback.\n \n🥮\n \nDinner that night was awkward.\nHua Cheng had the servants set out a variety of dishes, meats and soups and noodles of all types. It was Xie Lian—trying to avoid any discussion of the prior event—who was contributing to the silence by shoving food as fast as he could into his mouth.\nHua Cheng sat across from him, head propped on one hand, mostly just watching. He wasn’t eating much, or really saying much, either. Every once in a while, he just handed over another dish.\nNodding in thanks, Xie Lian accepted them and kept wolfing them down. After a while, though, he couldn’t keep going; he was full, and after a meal so large, he was also tired. It was only once he was nodding off, almost planting his face into the bowl in front of him, that he suddenly remembered—\n“Wait, I was going to try to make the dish for you again,” he said through a mouthful of rice, then swallowed. “Chengzhu, excuse me. I’ll be right back.”\n“You won’t do anything right now,” Hua Cheng said languidly, his head still propped on his hand. “You’re falling asleep.”\n“I have to try.” Stubborn, Xie Lian hurried to get up.\n“You’ll burn down the manor.”\n“I’ll keep a bucket of water—”\n\nSMACK!\n\nXie Lian had stood up too fast, and his vision hadn’t cleared yet; he’d run straight into the wall instead of the entryway. Rubbing his forehead where he’d smacked it, he winced and corrected his course, when—\nAn arm looped through his, holding him back. “Forget it,” said Hua Cheng. “You must have hit the ground too hard today, don’t go stumbling down the hall. You’re coming with me.”\n“Wait,” Xie Lian said, as he was dragged away. “I still haven’t—”\n“You’ll do that tomorrow.”\nRegaining his footing, Xie Lian nodded and tried to pull his arm free, but Hua Cheng’s grip was strong, and for some reason he wasn’t letting go. With no other choice, Xie Lian let himself be led down the hall. At least he’s well-mannered, he thought. He’s leading me to my room. Except, wasn’t this the wrong way? And why was Hua Cheng walking so quickly—\nHua Cheng nonchalantly kicked the door of his room—their room, where they’d slept together every night before all this happened—and led Xie Lian in.\n“…” Xie Lian glanced up. “My Lord, isn’t this your room—?”\nSuddenly, there was the sound of a soft breath close by; Hua Cheng had leaned over his back, sliding his hands onto his shoulders.\nXie Lian froze.\nSqueezing his shoulders, Hua Cheng whispered in his ear: “Didn’t you say you were here to serve me in bed?”\nXie Lian’s gut twisted, and a barely suppressed shiver went up his back. As always, he was weak to this kind of voice, and he couldn’t help but sound timid as he responded.\n“…en.”\nHua Cheng’s hands slid down from his shoulders, settling at his waist. “Then go get washed up.”\nXie Lian couldn’t believe his ears. He knew that Hua Cheng was insatiable, but could it be that he’d really do it with a near-stranger this early? It wouldn’t be that unusual in a situation with regular people; a new concubine could expect to be fucked into by an eager noble on the night of their arrival. Still, was this really Hua Cheng’s style?\nIn any case, it didn’t matter. This worked to Xie Lian’s advantage; if there was one thing Hua Cheng liked to do during sex, it was kissing. If this could get his memories back, it would be over quickly. Swallowing down his nerves, Xie Lian raised his voice:\n“Yes, my lord.”\nSlipping out of Hua Cheng’s grasp, he went quickly behind the divider in the room, where a tub of hot water was waiting. Glancing behind him self-consciously to make sure the divider hid him well, he shucked off his clothes and stepped into the water.\nHua Cheng had seen him naked lots of times, but really, this felt more like the first time with a stranger…\nIt really was like facing a stranger in more ways than one. Xie Lian had a good idea of what his Hua Cheng liked in bed, but this Hua Cheng was a mystery. There was no telling what Xie Lian would be asked to do, and no telling how patient or gentle Hua Cheng would be with him during the act. It was best not to think about it, Xie Lian reasoned; if he tried to brace himself, he’d get tense, and it could hurt more.\nFeeling shy at his train of thought, Xie Lian scrubbed hard at himself, determined to get clean. If he gave a bad first impression, Hua Cheng wouldn’t want to kiss him at all, and the whole plan could be in jeopardy. He was concentrating on cleaning laboriously between his toes, the water splashing back and forth in the tub, when a voice came—\n“Make sure to dry off completely. I don’t want the bed to be damp.”\nThat was his signal that he was taking too long. “Yes, my lord,” he said quickly, stepping out. After drying off, he slipped a fresh inner robe off the divider and put it on.\nFor a moment, he looked down at himself, feeling stupid.\nThen, he stepped out.\nHua Cheng was lying in bed in his inner robe, his hands behind his head, staring up at the ceiling. “Well?” he said, without looking. “What are you waiting for?”\nTimidly approaching the bed, where he’d slept so often for the past year, Xie Lian felt completely out of place for the first time. Still, he climbed up onto the plush surface and knelt. “I’m ready,” he said. “How…how does my lord want to have me?”\n“Hmmm,” Hua Cheng mused.\nXie Lian waited, his heart beating hard in his ears.\nThen—Hua Cheng turned over onto his front. “Rub my back.”\n“…” Xie Lian almost choked. “What?”\n“My back hurts after sparring. Don’t you know how to do it?”\n“……….”\nFor the third time that day, Xie Lian said a prayer in his head: San Lang, when you get your memories back and kill yourself successfully, at least wait by the door of the underworld so I can get you back. Still, he dutifully rolled up his sleeves and placed his hands on Hua Cheng’s shoulders. His hands were delicate but strong, and he knew how to do this well. In fact, Hua Cheng had often asked for back rubs before, though they inevitably always ended in…\nXie Lian flushed so red all of a sudden that his hands quivered; he tried to keep going, kneading his palms into Hua Cheng’s back, when suddenly—\nHis arm was being seized, and he was flipped onto his back. Hua Cheng stared down at him.\n“Why so shaky?” he said pleasantly. “Did you think you were going to get fucked? Were you scared?”\n“…I wasn’t scared,” Xie Lian said stubbornly.\n“Oh?”\nThickening his face, Xie Lian went on. “It’s not like I haven’t done it before, it’s not a big deal…”\nAt that, Hua Cheng raised a brow. “You’ve done it before.”\nRed-faced, Xie Lian nodded. “I have.”\n“No you haven’t.”\n“What do you mean, I haven’t? Yes I have.”\n“No you haven’t.” Hua Cheng squeezed his cheeks together. “Look at the state of you just from talking about it. I could fry an egg on your face.”\n“I can prove it,” Xie Lian insisted. “I’ve done it lots ways. For example, I’ve…”\nHua Cheng waited patiently.\nXie Lian’s voice wouldn’t come out, no matter how hard he tried. “I’ve…put it…”\n“If I put it in you, you’d cry.”\nYou’ve cried at your climax at least ten times, Xie Lian thought. Feeling woeful, he turned away. “Forget it.”\n“Mn. You’re embarrassed.”\nHad it all been a joke? That would definitely be Hua Cheng’s style, but in this situation, Xie Lian was feeling annoyed. “Why did you tell me to get washed if you weren’t going to—”\n“Two reasons,” said Hua Cheng. “First, because I thought it was funny. Second, because my intention was to use you as a bedwarmer. You’re hot after a dip in the bath, and you’re burning up now that you’re ashamed, so the temperature’s all set.” Two arms clad in black inner robes were suddenly wrapping around Xie Lian, pressing him firmly down to the bed, and he was bundled against Hua Cheng’s chest. “Stop fussing and lie still, don’t move away.”\nIf he got any more humiliated, Xie Lian thought he might catch on fire. To think that he’d once been a crown prince, and now he was being used as a bed stove—it was too much to bear, even for him. It was only tolerable because it was Hua Cheng; thinking about him being cold made Xie Lian’s heart soft.\nStill, he shook his head. “You’re really…”\n“Shhh. I’ll gag you if you keep talking.”\nRelenting, Xie Lian went silent. He closed his eyes.\n“…”\nBut then his eyes snapped open—he’d forgotten something!\nSlipping his hand into his sleeve, he pulled out a small hard candy. Before he could raise his arm, however—\n“Don’t move around. I’ll tie you up.”\n“Just…let me adjust my position.”\n“Mn.”\nSquirming in Hua Cheng’s grip, Xie Lian managed to secretly pop the candy in his mouth. With that, he pressed back against Hua Cheng to reassure him and avoid suspicion—the very image of an obedient bedwarmer—and spoke softly. “That’s better. I’m ready, my lord. Did you want me to sing you something as you fall asleep?”\nFor once, Hua Cheng didn’t say anything, though the muscles of his abdomen seemed to twitch against Xie Lian’s back. Then, a little roughly: “No. Go to sleep.”\n“En, en. Good night.”\nXie Lian waited until Hua Cheng had stopped moving, then swallowed the candy down. After a few moments, he felt a little spiritual energy return, and called out in an array:\n“Hi, everyone. Sorry I—”\n“YOUR HIGHNESS, WHAT THE FUCK!” Feng Xin roared.\nMu Qing sounded tense. “Xie Lian! Where were you?”\n“What’s all this racket, this Guoshi is trying to sleep…”\n“Your Highness, was there a problem?” Yin Yu said. “We got worried when we didn’t hear from you yesterday.”\nFeng Xin kept swearing. “I THOUGHT YOUR FUCKING RIBBON WAS GOING TO STRANGLE ME TO DEATH—”\n“I’m fine, I’m fine!” Xie Lian said hurriedly. “I was just busy.”\n“Just busy?” Mu Qing said in disbelief. “We agreed you’d reach out yesterday. We were about to send someone to come get you. For all we knew, you could’ve been dead.”\n“Shhh…ten more minutes,” Mei Nianqing mumbled.\nXie Lian sighed. “All right, everybody stop. I’m sorry I forgot, but you can scold me later; the spiritual energy candy won’t last long.”\n“Fine,” said Mu Qing. “Did you at least get any closer to getting his memories back?”\n“Well…he let me stay with him, but, as for getting him to kiss me…” Xie Lian’s heart sank a little as he thought over the events of the past two days. “I made him food that he didn’t like, I distracted him from his work, I was too weak when sparring with him, I forgot to make him dinner, and then I annoyed him while he was trying to fall asleep.”\nHe paused, feeling a lump in his throat.\n“I guess I’m not as good as making him happy as I thought.”\n“Xie Lian, for fuck’s sake.” Mu Qing’s eye-roll was practically audible. “If you’re alive it means he doesn’t hate you, and that’s already hard to get. Stop being dramatic.”\nDo you usually make people hate you at first glance? Xie Lian thought, but held his tongue. In any case, another voice interrupted:\n“Ahhh,” Mei Nianqing said groggily, in a tone conveying that he was stroking a non-existent beard. “I see what this is.”\nXie Lian felt a little annoyed. “What?”\n“You think that the only reason he became obsessed with you initially was because you caught him during the parade back in Xianle. In fact—you think that the only reason someone could become so terrifying about you is if you save their life. Absent that, you don’t think the same kind of love is possible.”\nXie Lian’s heart was sunk deep in his stomach. “…is it unreasonable to think that?”\n“Sigh, just as I thought: young people really don’t know anything about love. Fortunately for you, your Guoshi will tell you: back in the time of Wuyong—”\n“Is there any progress, though?” Feng Xin interrupted. “What about that? If you think of something that’s gone well, maybe you can follow that lead.”\n“I don’t know…” Xie Lian mumbled. “Wait! There actually is some good news: I went to bed with him tonight!”\nAll of a sudden, there was dead silence on the other end of the line.\n“…”\n“…”\n“…”\n“…”\n“I mean—n-n-not like that,” Xie Lian said quickly. “We didn’t do—that. He just said that he’d use me as a bedwarmer, and also, he wanted a massage. But we didn’t—”\n“I’m going to sleep,” said Mu Qing, and immediately left the array.\n“Um, I’m, yeah, me too,” Feng Xin fumbled out. “I’m going to bed. To sleep, I mean. Good night, Your Highness, good luck.” Then, he was gone, too.\nYin Yu silently left as well.\nMei Nianqing let out a loud snore into the array, so Xie Lian sighed and left on his own. With that, he was alone in his room again, and he closed his eyes to sleep.\nAs he drifted off, however, he could’ve sworn he felt something flutter past his cheek.\nWhen Xie Lian woke up, there was a precious moment of dreamy amnesia. Surely it had all been a nightmare; he was waking up in Hua Cheng’s arms as usual, and the morning felt cool and sweet. Shouldn’t this be just another morning?\nThen he felt a tickle on his lashes, and he opened his eyes to the sight of the butterfly sentry barely a hair from his eyes, perched on his face.\nSuppressing his shock, Xie Lian held still. He still remembered the burn of a silver wing slicing across his hand the first night, and knew that provoking it while it was so near to his eyes was probably a bad idea.\nThis time, though, nothing happened.\nCarefully slipping his hand out from under Hua Cheng’s arm, Xie Lian nudged the butterfly onto his finger. With a sigh of relief, he watched it flap its wings peacefully. “At least I’m not a bother to you,” he said quietly, then sat up and slipped out of bed.\nRubbing sleep out of his eyes, he glanced over at Hua Cheng; like this, peacefully asleep, he could’ve been the same ghost king he’d shared a beautiful year with. Now, though…\nShaking his head, Xie Lian turned away and headed towards the kitchen.\nHe hadn’t done well the past two days, but there was a chance to fix it. Cooking was a sure way into anyone’s heart; maybe the Thousand Gold Come-And-Go Stew had been too complicated, too hard to rush under pressure. A simple bowl of congee could do just as well.\nThe silver butterfly tracked him as he went, then settled on his shoulder as he worked. Despite his initial wariness, Xie Lian saw it wasn’t standoffish anymore, but he still murmured to it when he started stirring: “Why don’t you perch somewhere else for a second? I don’t want to knock you over.”\nWith a flutter of wings, it flew away.\nThat’s weird, Xie Lian thought absentmindedly, as he peered down into the congee, which for some reason had begun to emit smoke. If I just told it to move, why did it fly away? Before he could look up to see, however—\nSomething much, much heavier settled over his shoulders. Xie Lian froze.\n“I was woken up by the chill this morning,” Hua Cheng said. “Mornings are coldest. I didn’t tell you to leave.”\nPutting down the spoon, Xie Lian hastily tried to turn and bow. “My apologies, Chengzhu. I thought—”\n“Don’t turn around. You’re cooking now, so you can keep cooking. What is it?”\n“Congee,” Xie Lian said, picking his spoon back up. “It’s almost done, do you want some?”\nHua Cheng stepped back, leaning his hip against the counter, and crossed his arms in front of him. He was already dressed in a blood-red outer coat, imposing and smooth; Xie Lian, in an inner robe now stained with soy sauce and oil, felt small in contrast.\n“Well?” Hua Cheng said. “I’m waiting.”\nSnapping out of his haze, Xie Lian quickly scooped some up before holding out the spoon. “Here. Try, try.”\nBut when Hua Cheng made no move to reach out, Xie Lian realized he wanted to be fed directly. Flushing with embarrassment, he lifted the spoon higher. “Here…”\nHua Cheng leaned forward, taking a sip from it, and leaned back to chew.\nThat's  already a bad sign. Since when is congee chewy…\nStill, Xie Lian held onto hope. “Is it…”\nAfter crunching on it for a bit, Hua Cheng swallowed. Then, he shook his head. “It’s not good, Your Highness.”\nXie Lian’s spirits fell. He couldn’t believe he’d failed again. “What’s wrong with it?”\nLeaning over the pot, Hua Cheng gazed down. “The rice isn’t fully cooked. You probably either didn’t stir enough or didn’t heat it enough. Otherwise, the taste would’ve been fine.”\nThen—\nHua Cheng reached into the pot with his hand?!\n“My lord? Why are you mnnghh—”\nTwo slender fingers had been pushed past Xie Lian’s lips, into the hot inside of his mouth.\n“Suck,” Hua Cheng said simply.\nXie Lian stared at him, feeling like something hot and throbbing was sinking down into his stomach.\n“I said suck,” Hua Cheng repeated. “Don’t bite down, just suck like it’s candy.”\nDespite his bewilderment, Xie Lian closed his lips and suckled dutifully. The nails were smooth and sharp against his palate, but the skin of the fingers was soft as it rubbed against his tongue.\n“See?” Hua Cheng said, staring right at him, deadly-sharp. “The ingredients taste fine. It’s only a problem with the rice.”\n“Mm,” Xie Lian agreed. With that, one could reasonably expect that Hua Cheng would pull his hand away—at least, Xie Lian did.\nHe never expected Hua Cheng to suddenly sink them in deeper.\nXie Lian startled, one hand reaching up to grasp Hua Cheng’s arm. “Mmmngh—?!”\n“Shhh,” Hua Cheng said quietly. His one eye was burning. “Don’t fuss. Just finish cleaning off my fingers.”\nWith a clumsy nod, Xie Lian used his tongue as best as he could. Once the taste of spices was gone, he swallowed to show he was done and glanced up, meeting Hua Cheng’s fixed gaze.\nFinally, Hua Cheng pulled his fingers out. “Good,” he said, and turned away. “Meet me at the table. I had the servants set out breakfast. I have a few questions for you.”\n“Yes, Chengzhu—”\nHe was gone.\nIn the moment the door slid shut, Xie Lian stumbled back against the counter, breathing shallowly. He could still taste Hua Cheng on his tongue.\nYou did all that just to make a point about cooking? he thought dryly. San Lang, who knew you’d be this repressed after just a few days without…\n\n \n\n🥮\n\n \n\nTo his credit, Hua Cheng let Xie Lian eat in silence for a few minutes before starting to question him.\n“I’ve looked through my records, but I can’t find anything about you,” Hua Cheng said. “I want to know where you’re from.”\nPractically choking on his food, Xie Lian looked up. “I’m from Xianle. Aren’t you from Xianle?”\nHua Cheng seemed impatient. “Just answer the question.”\n“If you ask questions, I should be able to ask questions. Isn’t it nicer to have a conversation like that? Yes, I’m from Xianle. What about you?”\n“En,” said Hua Cheng. “What were you in Xianle?”\n“I was the crown prince,” said Xie Lian. “I ascended, but descended again to help my kingdom. When that failed, I turned into a banished god. My turn: what’s your purpose as a ghost?”\n“To seek my fate,” said Hua Cheng. “My turn again. Why did Xianle fall?”\n“You…you don’t know?”\n“I was never able to find any records on it. I died before it happened.”\n“It was more than one reason,” said Xie Lian. “First a drought, and then a devastation-level ghost named the White-Clothed Calamity. Do you know about him, at least?”\n“No.”\n“Well, that’s fine. He’s gone now,” said Xie Lian. “My turn again: what do you mean, your purpose is to seek your fate?”\nHua Cheng took a sip of tea, seeming unfazed. “When I was young, I threw myself from a city wall; I was saved by chance when I fell into a passing flower cart. Since then, I’ve known luck was on my side, and I’ve been following my fate wherever it leads me ever since.”\n“That alone gave you the strength to go on?”\nWith a shrug, Hua Cheng leaned back in his chair. “Everyone picks something to follow. Why shouldn’t I follow fate?”\nIt’s like he never needed me in the first place, Xie Lian thought to himself. Even though he tried to convince himself it was just the curse, he still felt bittersweet. “Is that why you’re thinking of invading other territories?”\n“Why not? If I’m strong enough, it’s my right.”\n“But…would that make you happy?”\nHua Cheng stared at him for a long moment, making Xie Lian uncomfortable. Xie Lian turned his gaze back down to his food and mumbled through a large mouthful:\n“Sorry, that was too personal—”\n“What about you?” said Hua Cheng. “What would make you happy?”\nSwallowing his mouthful, Xie Lian sighed wistfully. “There’s someone I’d like to be reunited with. It might be impossible, but…”\nNarrowing his eyes, Hua Cheng interrupted. “It’s impossible. You’re here now; you can forget about things like that.”\nUntil you get bored of me, Xie Lian thought to himself, and nodded.\nThere was an awkward silence while Xie Lian went on eating, letting the odd moment linger in the air. Finally, he looked up. “Do you have any more ghosts coming to meet with you today?”\n“I’m not accepting any today.”\n“Oh?” Xie Lian looked up. “Why not?”\n“I don’t feel like it.”\n“Sa—Chengzhu, you should know it’s important to take requests. They’re good ways to show your power; if the city feels like you aren’t paying attention—”\n“I don’t want to talk about that,” said Hua Cheng. “Talk about something else.”\n“About—what?”\n“I don’t know. Pick something and talk.”\n“…”\n“…”\n \n🥮\n \n“It’s hard to plant a lotus, but not impossible,” Xie Lian said, reaching deep into the bucket in front of him. “It’s all about getting the right consistency of mud. If the dirt is too light, it’ll float away; you want something thick.”\nHua Cheng handed over the sprouted tuber. “But it can’t be planted in the dirt outside?”\n“Not really, since it needs water over the dirt.” Xie Lian took the tuber and pressed it down. “See this? Just make sure it’s nice and buried—” He let out a small noise of effort, as he pressed it down. “Then pour some water over it.”\nPicking up the jug at their side, Hua Cheng let some water flow. “How much?”\n“I’ll tell you when to stop. More, more, more…now! See how the last leaf is peeking over the top of the water?”\n“Oh.”\n “Easy, right? Now you just let it sit in the sun. I made a lot of money planting them and selling them off, back when I was wandering from place to place; they look great in ponds for wealthy households. As long as you’re not afraid to get mud under your fingernails, it’s a good source of money.” Shaking the water off his hands, Xie Lian gave a beaming smile. “It’s also rewarding to see the flowers come up.”\nHua Cheng paused to stare when Xie Lian smiled, almost dazed. “…en.”\n“When it’s sprouted, you can put it in the pond in the courtyard. Then, you can go to ghost city and buy some fish, and it’s a great place for meditation.”\nHua Cheng seemed to snap out of whatever thought he’d been having, and snorted through his nose. “Meditation?”\n“You really should meditate every day. It clears the mind and the senses—ah, thank you.”\nReaching over, Hua Cheng had started to wipe off Xie Lian’s hands with a towel. “I don’t think sitting around like that would do much for me.”\n“Hmm, that’s true,” said Xie Lian. “Then, instead of sitting still, how about movement meditation?”\n \n🥮\n \n“Just like that…move your arm up a little…” Xie Lian moved around Hua Cheng, correcting his form, adjusting it with delicate hands. “There…perfect.” He came to stand in front of him. “Now, just copy exactly what I do.”\nThe two moved together, mirroring each other, flowing through a set of positions. Xie Lian’s movements were practiced, light and airy; Hua Cheng’s were forceful, but deadly with their precision.\n“See?” Xie Lian smiled, as he came to a stop. “Can you feel the way the energy shifts through your body?”\nHua Cheng stopped too, and stared at Xie Lian’s face. He seemed to be doing that a lot. “I felt it this time. It’s faint, but it’s noticeable.”\n“The more you practice, the better you get at it. I’ve noticed that ghosts tend to use energy through brute force, but control is just as important as power. If you do this just a few minutes every day, you’ll gain a finer touch.”\n“Your Highness,” Hua Cheng said, with a dangerous gleam in his eye. “When I have enemies, they aren’t scared away by a finer touch.”\n“Well, if all you want to do is scare enemies, then that’s just fine,” Xie Lian quipped, and then stopped suddenly. His face went pale; he’d accidentally slipped back into the tone he’d used before this incident, whenever Hua Cheng was being unruly—too casual. “…sorry, I’m lecturing. Actually, I’ve been talking nonstop all day, how embarrassing.” Xie Lian wiped sweat from his forehead, setting down the pole in his hands. “If it’s boring, we can stop.”\n“It’s fine.”\nNot only did I mess up breakfast this morning and then interrogate him, I basically got him covered in mud and lectured him all day after that, Xie Lian thought to himself. Wincing, he turned away. “I can go clean for a while. If you have other important things to do—”\n“Don’t move,” Hua Cheng said softly.\nXie Lian froze.\nThere was the usual clink, clink of Hua Cheng slowly approaching.\nThese past days, Xie Lian had learned that he never had any clue what was about to happen next, so he took a deep and steadying breath. Either from the exercise just now or from nerves, a bead of sweat rolled down his neck.\nThen, one hand grasped his shoulder, and another grasped his head, tilting them apart, and—\nSomething hot and wet ran up his neck, ending just beneath his ear\nXie Lian’s eyes were wide-open. “…my lord?”\n“Just curious,” Hua Cheng replied casually. “I’ve never tasted a cursed shackle.”\nThat wasn’t the shackle, that was basically half my neck… Xie Lian thought. Still, he didn’t move until Hua Cheng released him.\n“The servants should have set out dinner for you. Eat, then wait for me in my room.”\n“Yes, my lord.” Xie Lian nodded. “Did you want me to warm up for bed?”\n“No, not yet. First, you’re going to give me a calligraphy lesson.”\nXie Lian was surprised. “Another lesson?”\n“Didn’t you say you could teach me calligraphy?” Hua Cheng turned to go. “Go eat. I’ll have the materials set up when you arrive.\"\n \n🥮\n \nWhen Xie Lian entered the room, Hua Cheng was already there, sitting next to the table with calligraphy supplies laid out. He was clearly feeling impatient, twirling one of the brushes in his hand. His impatience became more noticeable when Xie Lian entered; instead of addressing him without looking like he usually did, Hua Cheng turned and stared. “There you are. Did you get lost?”\n“I didn’t,” Xie Lian said, kneeling down by the table. He set a small pot on the table, then a small bowl with a spoon. “I just spent some time trying to make this again for you. I used less salt this time.”\n“Oh?” Hua Cheng replied lazily. “The Thousand Gold Come-And-Go Stew?”\nXie Lian’s hand, which was just lifting the lid off the pot, hesitated for a second. It must have been really terrible if he even remembers the name, he thought. Still, determined not to be discouraged, he nodded. “That’s right. Won’t you try some?”\nHe was about to reach out and serve a bowl, but before he could, Hua Cheng reached out himself. After measuring out a hefty portion into the bowl, he lifted it to his lips for a taste.\nWith bated breath, Xie Lian watched. “Is it better?”\nHua Cheng swallowed, then tilted his head. “It does have less salt, so it’s not as bad, but there’s still a problem with the vegetables. They were cooked for too long. Next time, you have to make sure they still hold their shape.”\nHis heart sinking, Xie Lian nodded. “I see.”\nTaking up another spoonful, Hua Cheng nodded towards the table. “Sit. I’ve set out the supplies.”\nWas it possible that he could mess up calligraphy too? Given his luck the past few days, Xie Lian thought, it was definitely possible. He was just picking up a brush when he realized he still heard the scraping of the spoon against the bowl, and looked up. “…you don’t have to finish it if it’s bad…”\nHua Cheng set down his bowl; it was empty. “It’s fine, I’m done anyway. Show me your technique.”\nDespite feeling discouraged, Xie Lian waved him along. “Show me how you hold the brush first.”\nFor a while, he lectured Hua Cheng and watched him write. It seemed that whatever Xie Lian had taught him over the previous year had stayed; but when Xie Lian asked who’d taught him last, he named a random calligraphy teacher. What’s more, when Xie Lian asked about the writing on his arm—\n“It’s just lines,” said Hua Cheng. “It doesn’t mean anything.”\nSo Xie Lian just sighed, and continued lecturing.\nAfter a while, Xie Lian was just writing on his own. Hua Cheng had asked to watch how he did it, and so he kept on painting, steadying his wrist with his hand. Hua Cheng stared with his cheek propped on his hand.\nXie Lian glanced over. “…are you learning?”\n“En,” said Hua Cheng. He didn’t seem to be looking at the paper; he seemed to be looking at Xie Lian.\n“Okay,” said Xie Lian, resuming his work. “Then I’ll keep going.”\nOut of the corner of his eye, though, he could sense that Hua Cheng was getting fidgety, twirling a brush, playing with his braid, then adding some incense to the burner at the side.\nDeep in focus, Xie Lian didn’t expect the smoke; so when the new scent tickled his nose, he sneezed:\n“Ha-ch!”\nHua Cheng paused like he’d been startled. One hand twitched.\nXie Lian rubbed his nose. “Sorry, my lord. Where was I ah—!”\nSomething had caught his arm, and then he was tumbling down to the rug. Of course, it just had to have been Hua Cheng who’d pulled him down, and now loomed over him.\n“The ink,” Xie Lian said quickly, glancing to the side. “I dropped the brush, it fell onto the carpet. Quickly, let’s get it before it in—”\nA gentle but firm hand took his chin, turning it back up. Hua Cheng was staring down at him, pinning Xie Lian’s wrist with his other hand.\n“You’re lucky I’m the one they sent you to,” he said, and rubbed a few circles into Xie Lian’s cheek with his thumb. “You’re lucky they didn’t send you to anyone else.”\nResigning himself to being toyed with yet again, Xie Lian laid still and waited.\nHua Cheng leaned closer, his eye gleaming in the candlelight. “A tender little god like you—any other ghost, and you’d be eaten up by now.”\nXie Lian frowned, a bit offended. “It’s not like I can’t fight…”\n“You seem like you’re usually intelligent, so it surprises me when you do something this foolish,” Hua Cheng murmured, clearly amused. “You slept in my arms yesterday; you were there all night. I could’ve done anything. Don’t you realize you could’ve woken up already getting boiled?”\nWith a jolt, Xie Lian realized that Hua Cheng wasn’t just messing around; he was scolding him for being careless—and he was right. Hua Cheng without his memories of Xie Lian was completely unpredictable. Xie Lian had been so fixated on not appearing threatening to him, he’d forgotten that this Hua Cheng could be a threat. Thinking about how irresponsible he’d been, he felt ashamed.\n“Thank you for not harming me while I slept,” he said softly, and meant it. “I wasn’t thinking.”\nBut Hua Cheng raised his brows. “Why are you thanking me? Who says I won’t?”\nA little wary, Xie Lian eyed him. “Wouldn’t you have done it already?”\n“Maybe I just wanted to have fun first.”\n“…are you having fun?” Xie Lian said slowly.\nHua Cheng didn’t answer, only sighed. “Your Highness, Your Highness,” he said, and clicked his tongue. “What should I do with you?”\nDespite the haze that was coming over his mind, Xie Lian took stock of the situation: Hua Cheng was clearly feeling playful. If there was a time to get nearer to a kiss, it would be now. He just had to make himself appealing.\nThickening his face as much as he could, Xie Lian took a deep breath before sacrificing his last scrap of dignity:\n“Since gege took me in,” he whispered, “He can do anything he wants.”\nHua Cheng’s eye lit up, blazing with something absolutely primal.\nXie Lian couldn’t believe it. So you can forget all about me, but you still keep the gege fetish—\nBut any further thoughts were interrupted by Hua Cheng pressing him down harder, barely able to hold himself back. His voice was quivering and low; his look was savage. “Do you know where you’re headed if you say things like that, Your Highness?”\nXie Lian just stared up. “I know.”\n“But I thought Your Highness told me this morning: he’s waiting to be reunited with someone.”\nXie Lian shook his head. “Didn’t you say it yourself? I’m here now, so there’s no need to wait anymore.”\nThat was it. Any last bit of patience was nearly gone; Hua Cheng’s voice was dark. “Beg me to set you free. Go on.”\n“You already gave me that choice. Didn’t I stay?”\n“Beg.”\n“No.”\n“I’m going to devour you.”\n“Fine.”\n“I eat tender little gods who try to cook for me and fall asleep in my bed. I boil them alive.”\n“Now you’re just making fun of me…”\n“If they also ask to sing me lullabies and teach me to grow lotus flowers, I don’t even boil them. I eat them raw while they cry out.”\n“I won’t cry out,” Xie Lian said stubbornly.\nFor a moment, Hua Cheng said nothing. Then, he ran a finger across Xie Lian’s lower lip.\n“No,” he said, gazing down. “You won’t.”\nXie Lian swallowed. Hua Cheng’s gaze followed the movement of his throat as it rolled, before finding Xie Lian’s eyes again.\n“I’m going to let you go,” he said quietly. “When I do, go kneel at the edge of the bed.”\n.\n.\n.\nSlowly, Hua Cheng got up.\nIt took Xie Lian a few moments to register what was about to happen; he stayed on the floor like a starfish, staring up dazed and red-faced. Just now, he’d sounded so confident—he had no idea where the words had come from, like he was the most cunning member of the harem. Could he really follow through?!\nHua Cheng’s voice came, clearly amused. “Are you just going to lie there?”\n“Right, right,” Xie Lian said hurriedly, scrambling up. He gave a few flustered steps past Hua Cheng—\n“Your Highness.”\n“Wh-what?”\nThe amusement in Hua Cheng’s voice turned almost elated. “The bed is over there. You’re going the wrong way.”\nXie Lian blinked, looking around. “Ah—right, right.” He hurried over, then stood next to the bed. What had Hua Cheng said to do next?\nAs it turned out, it didn’t matter. Xie Lian heard the steady clink of Hua Cheng coming up behind him, then two steady hands pushing his shoulders down.\n“Kneel,” said Hua Cheng. “Remember?”\nOn wobbly legs, Xie Lian was pressed down to his knees. They hit the floor with a dull thump.\n“Stay just like this,” Hua Cheng said, and walked off.\nNot knowing whether to laugh or to cry, Xie Lian laid his hands on his knees and waited. He could hear Hua Cheng doing something behind him, and wondered whether he should look. Just as he was turning, however—\nA hand came down on his head and firmly turned it back the other way. “I said, stay.”\n“You didn’t say I couldn’t look…”\n“Give me your hands.”\n“My hands?” Xie Lian glanced down at his hands, then over his shoulder. “How should I—”\nHua Cheng took hold of Xie Lian’s wrists, then pulled them behind his back. Something was wrapped around them tightly. Then, a knot was pulled snug.\nThey’d been bound together.\n“My lord?” Xie Lian said, very softly.\nClink-clink, clink-clink went Hua Cheng’s boots, as he came around Xie Lian. After he’d circled once, satisfied, he sat on the bed and leaned forward. His eye was dark.\nXie Lian stared up, speechless; being tied like this on his knees on the floor was an odd feeling. Without being able to move his arms or use his legs, it was like all his energy was pooling somewhere else, low in his stomach—burning and aching softly.\n“Do you know what I’m going to do with you?”\nRed-faced, Xie Lian glanced up. “It’s not like it’s hard to guess…”\n“Guess.”\n“You’re going to recite the ethics sutra with mmph—!”\nHua Cheng had taken the back of Xie Lian’s head, shoving his face against into his groin. Though he was still clothed, the outline of his cock was hot and hard through the layers.\nXie Lian’s face was pressed in harder and harder by Hua Cheng’s hand, then crushed on both sides by powerful thighs, until he could barely breathe. He gave a muffled plea against the fabric.\n“If you try to be funny again, I’ll smother you like this,” Hua Cheng said. “Understood?”\nWith some effort, Xie Lian nodded.\nPleased, Hua Cheng let go.\nA heavy haze was coming over Xie Lian’s mind. Even when he got air again, he was panting. Without thinking much, he pressed a soft kiss to the straining outline of Hua Cheng’s cock before leaning back.\n“Good,” Hua Cheng breathed. “You learn quickly. Give my boot a kiss, too.”\nXie Lian thought for a moment about refusing. After all, if Hua Cheng got his memories back and remembered this, it wouldn’t be good.\nAnd yet…\nSorry, San Lang, you can blame me for this later. As if he’d never had the thought, Xie Lian bent over, careful not to lose his balance with his hands tied, and kissed the leather of Hua Cheng’s boot. A silver chain was cool against his lips; he lapped it into his mouth and sucked for a second before drawing back again, letting it fall away. A string of saliva remained, connecting his tongue to the metal.\nWhen he looked up again, Hua Cheng’s lips were parted slightly, and his pupil was blown as he stared. “…”\nSuddenly regaining his senses, Xie Lian snapped out of it and smoldered with embarrassment. He turned his head, clumsily wiping his chin on his shoulder, but Hua Cheng took it and turned it back.\n“You weren’t lying,” he mused. “You’ve done this before.”\nXie Lian nodded.\n“With who?” The grip on his chin tightened. “Was it the person you’re waiting to be reunited with?”\nFinding this a bit pathetic, Xie Lian sighed. San Lang, getting jealous of yourself—isn’t this like a dog attacking its own reflection?\nTaking his silence as a refusal to answer, Hua Cheng’s eye narrowed. He didn’t say anything, though, just let go and started pulling off his boots.\nDeep breaths, deep breaths—Xie Lian closed his eyes and tried to control his feelings, as boots were laid aside and fabric rustled in front of him. He really had done this lots of times, but it had been different with Hua Cheng in the past; he’d started off by instructing Xie Lian gently, keeping a friendly tone and making jokes as he showed where to lick and touch.\nThinking about it, Xie Lian smiled with his eyes closed.\n“Is something funny?”\nWith a jolt, Xie Lian opened his eyes just in time to see Hua Cheng take himself out of his clothing.\nHua Cheng’s cock hung out in front of him, swollen and red, veins standing out, barely a breath away from Xie Lian’s face. It was a familiar sight, but Xie Lian still stared.\nWith a soft sigh, Hua Cheng started stroking himself, never moving his gaze from Xie Lian’s lips. With a languid squeeze he pulled back his foreskin, letting it roll down from the head; the precum that had pooled there slowly oozed out.\nIt wasn’t an unfamiliar sight, but this kind of presentation brought on a dull throbbing in Xie Lian’s…\nNever mind that. There was a job to do and memories to restore; Xie Lian had to stay focused. He leaned forward and laid the softest kiss against the leaking tip.\nHua Cheng let out a harsh breath, and the muscles of his abdomen twitched. He squeezed his cock in his hand and pushed the tip against Xie Lian’s lips, letting it catch and rub against the plush surface. Breathing heavier, he milked out his precum and rubbed it in, until it trickled down Xie Lian’s chin.\nThough a little shy, Xie Lian licked it off, tasting salt.\nHua Cheng twitched in his seated position, like the muscles of his hips were begging to move. Instead, he pulled Xie Lian’s face closer and rubbed his cock against his cheek.\nSomeone’s excited, Xie Lian thought, closing one eye as the hot and heavy length tugged his cheek back and forth. “My lord,” he said finally. “Can I suggest something?”\n“Mn.”\n“Can you untie my arms? I can work with my hands, too.”\nHua Cheng seemed unmoved, switching his cock to Xie Lian’s other cheek and continuing to rub against the flushed skin. “If you work with your hands, you won’t work with your tongue.”\nXie Lian stared up earnestly. “I will. You can tie me right back up if you don’t like it.”\nAt those words, Hua Cheng’s face twitched into a grimace, and he squeezed his cock in his fist. Xie Lian felt it throb against his cheek; soon, a trickle of fresh precum oozed down, leaking past his jaw.\n“…”\nAfter a moment’s consideration, leaning over, Hua Cheng took the edge of the ribbon binding Xie Lian’s arms and pulled the knot free.\n“Thank you, my lord,” Xie Lian said with a smile. He’d won the battle now, but he needed to stay free to perform at his best. In order to keep his hands untied, he’d need to be convincing. Reaching up with his now-freed hand, he swiped a finger through the smear of cum on his cheek and put it in his mouth, sucking it clean.\n“Good,” Hua Cheng breathed.\nFeeling encouraged, Xie Lian leaned forward. This was going his way. Surely, if he did a good job at this, Hua Cheng would give him a kiss soon?\nBut it only took one second, and the feeling of Xie Lian wrapping his delicate, sticky fingers around the red-hot base of his cock, for Hua Cheng to grab his wrists and wrench them apart.\n“I changed my mind,” he said. “I’m going to put it down your throat.”\nBewildered, Xie Lian lost his cool demeanor. “But I—I did everything you said?”\n“Lie down.”\nWas it that bad? Just from one touch, was it that bad?!\nAll those times before, when he’d done it with Hua Cheng—were his skills really, truly so terrible that they could barely be tolerated?\nFeeling weak, Xie Lian stopped fighting. Letting his arms go limp, he allowed himself to be placed down on the rug face-up.\nHua Cheng sank to his knees at Xie Lian’s head, taking it between his hands, but paused. “What’s with that look.”\nXie Lian was glum. “What look?”\n“The one on your face.”\n“It’s nothing.”\n“Don’t lie.”\n“I said, it’s nothing!” Xie Lian said, exasperated. “I can’t cook, I can’t do anything, I can’t even do this right, so whatever.”\nA finger stroked his cheek. “If you do a good job here, I’ll let you kneel again.”\n“No, it’s fine. If I’m only good to be a hole, then I’ll be a hole. It doesn’t—”\n“Shhhh,” Hua Cheng coaxed, then giving a quiet laugh. “Don’t be stubborn. You didn’t do anything wrong; I’m the one who’s impatient. Be obedient, kiss where I show you, and I’ll let you up again.”\nXie Lian tried to grasp the meaning; did he mean that Xie Lian was so good at it that Hua Cheng had gotten too riled up? Somehow, he doubted it. But what else could he mean?\nIn any case, this gentle voice seemed so much like his San Lang…\nHua Cheng tapped his cheek. “Well?”\n“En,” Xie Lian said softly.\n“Good,” Hua Cheng murmured. He ran a thumb through the precum on Xie Lian’s chin, then tucked it in his mouth. Xie Lian sucked without thinking. “Don’t think. Just do what I say.”\nXie Lian nodded again, closing his eyes. It was easier not to think.\nThen the thumb was gone, and something soft and hot was being lowered onto Xie Lian’s mouth.\nIn a daze, Xie Lian opened his eyes. He couldn’t see much, but he knew what was on his face, and he knew what Hua Cheng wanted.\n Closing his eyes again, he gave Hua Cheng’s balls a few kisses. They were heavier than expected, nearly smothering his nose and mouth, but they didn’t just hold still; Xie Lian could feel them twitching. Encouraged, Xie Lian nudged up into them and kissed a little more.\nIn response, Hua Cheng pressed down more, giving gentle rubs of the soft skin over his mouth. Tilting his head up, Xie Lian mouthed at it and sucked.\n“See, Your Highness?” Hua Cheng’s voice was low and coaxing. “It comes naturally to you. You were made for this.”\nA plaintive sound came from the back of Xie Lian’s throat. His own cock, which had started to ache, gave a throb; he soothed himself through it by sucking more pointedly.\nAt that, the thighs around Xie Lian’s head tensed, and suddenly Hua Cheng was moving away. Xie Lian kept suckling at the delicate skin of Hua Cheng’s balls until they came away with a soft click.\nThen he was free again, and he was being gently helped back up to his knees. “Good job, Your Highness,” Hua Cheng praised. “You did well.”\nXie Lian could only nod. He was deeply, deeply under, lost in the fog of his own arousal; he could hardly remember why he was doing any of this in the first place, or whose memories were lost, or much of anything else. All he knew is that he’d done a good job, and Hua Cheng was praising him for it. It had been so many days since he’d heard praise in this voice. He was so hungry for it—he hadn’t realized how much he needed it.\nWith a careful touch, Hua Cheng peeled Xie Lian’s robes off his shoulders, letting an alluring hint of his skin show. Satisfied, he settled on the bed. “Now you can use your hands.”\n“Thank you, my lord,” Xie Lian said, and reached forward.\nThe next few minutes were all a blur. Xie Lian let his memory take over his movements; his hands stroked and stroked, milking Hua Cheng’s cock into his mouth, following the familiar patterns that he knew brought Hua Cheng to the edge.\nAbove him, Hua Cheng’s breathing got heavier and heavier. Not only that, his thighs quivered.\nIt quickly became obvious, Xie Lian realized as his mind cleared, that this Hua Cheng had all the same sensitive spots as he had before. The delicate place to be licked just beneath the head, the space behind the balls which Xie Lian massaged with his fingers, the vein on the side where Xie Lian rolled his thumb—all of these reliably made Hua Cheng squirm. Feeling encouraged, Xie Lian pressed on.\nHe’d been right. It was the same. Hua Cheng’s state got more and more pitiful. His thighs weren’t just quivering in intervals now, they were shaking without pause; his stomach was rising and falling, then clenching so hard that it seemed to hurt. Voiced, harsh panting came from above, carrying hints of desperation, and he stared down at Xie Lian with something like confused disbelief. It was obvious that he hadn’t expected this. “Your Highness,” he breathed. “Your Highe—Your Highness—”\nIt was getting to the point where Xie Lian felt bad for him. Hua Cheng was always so vulnerable when he came. Letting go of his cock, Xie Lian felt up for Hua Cheng’s pale hands, and found them waiting, trembling. Clasping them together, intertwining his steady fingers with Hua Cheng’s clammy ones, he sank his mouth down and gave it his all.\nSan Lang, Xie Lian called out in his head, and swallowed around Hua Cheng’s cock.\nWhether it was the wet squeeze of Xie Lian’s throat or the warm press of his hands, that was all it took to send Hua Cheng over the edge. With a choked-off cry and a spasm that Xie Lian felt vibrating through his whole body, Hua Cheng came.\nThe whole time, while he swallowed down what came out, Xie Lian held Hua Cheng’s hands. There was so much of it—every time Xie Lian thought it was over, Hua Cheng’s breath caught and strained, his stomach tightened, his cock throbbed—and yet another spurt of hot cum was pumped into Xie Lian’s mouth, where it was dutifully helped down his throat.\nOnce it was finally over, Xie Lian pulled his mouth off and looked up.\nFrom his head down to his shoulders, Hua Cheng’s skin was flushed deep red, and it seemed shiny. His gaze was hazy. Actually, if Xie Lian didn’t know any better, it almost seemed like—\n“Sa—my lord? Don’t faint, it’s okay. Let me help you.” He tried to pull his hands away, but Hua Cheng had them in a sweat-soaked death grip. “My lord?” Awkwardly trying to stand with his hands trapped, he sighed. “My—”\nHua Cheng suddenly pressed his hands in a bone-crushing squeeze.\n“Sorry,” Xie Lian stammered, quickly getting back down to his knees. “I forgot I wasn’t supposed to move. Sorry—”\nAbruptly, Hua Cheng let go of his hands, but gripped his arms instead. “Don’t kneel again,” he panted. “Don’t.”\n“…what should I do?”\n“Stand up.”\nXie Lian got to his feet. Since Hua Cheng was still sitting on the bed, Xie Lian loomed over him. What’s more, the white inner robes Xie Lian had been wearing, which had been peeled back by Hua Cheng earlier, had sunk all the way down to his waist. The pearly skin of Xie Lian’s shoulders and his chest gleamed in the candlelight.\nReaching up, Hua Cheng took Xie Lian’s waist in his hand and leaned his forehead against the smooth stomach in front of him, breathing hard. He was still quivering.\n“It’s okay,” Xie Lian whispered. He stepped forward, cradling Hua Cheng’s head against him, and ran his fingers through long black hair. “Don’t worry.”\nAlmost inaudibly, Hua Cheng spoke against his skin, seeming weary and lost:\n“What are you?”\nXie Lian thought this was a little funny. “What do you mean, what am I? I’m a god.”\n“A god,” Hua Cheng said slowly, working around it—as though for the first time, he was understanding what the word really meant.\nAfter a moment of contemplation, pressing Xie Lian’s waist between his hands, he kissed the skin of his stomach right above his navel.\nHe’s kissing me, Xie Lian realized with a jolt. It was only a matter of getting him up to his lips. It was fine, though; he’d be patient for now. Memories or not, Hua Cheng was in a vulnerable state.\n“Did you swallow?” Hua Cheng whispered. “I didn’t see.”\n“En.” Xie Lian stroked Hua Cheng’s head, then pressed it against his stomach. “Part of you is in here now. That’s what it means to give an offering to a god.”\n“Mn,” Hua Cheng acknowledged, before kissing the same place again.\nSeeing this kind of familiar worship, Xie Lian felt a twinge on the inside. The feeling pooled in his groin, making everything tight and hot.\nSomething else distracting was happening, though. Hua Cheng had picked something up off the ground and stood up, walking around him.\n“What are you—” Xie Lian stopped in disbelief. “…you’re tying my hands again?”\n Hua Cheng pulled the knot snug. “Mn.”\n“But…”\n“Don’t worry, Your Highness,” he whispered. “I’m just going to give another offering. Let me guide you.”\nHe couldn’t possibly mean he wanted Xie Lian to swallow more, did he? Surely even a ghost king couldn’t recover that fast. Xie Lian tried to look over his shoulder in question, but Hua Cheng was moving him, guiding him to sit on the bed. With some help, Xie Lian was leaned against the pillows.\nDespite having his arms tied behind his back, Xie Lian found this pretty comfortable. The gentleness of Hua Cheng’s movements lulled him, too. After only a second, his eyelids were lowering.\n“Oh?” Hua Cheng smoothed a few hairs back from Xie Lian’s face. “Is His Highness drowsy after his meal?”\nXie Lian’s eyes snapped open. Now he’d really done it, he was falling asleep during sex. “No no, it’s fine,” he said quickly. “I can—”\n“It’s fine.” Hua Cheng reached down with a smile, rubbing Xie Lian’s stomach. “It’s good to rest, it helps with digestion.”\nThe vulgar edge to the words made Xie Lian blush, but the rubbing made him comfortable, so he nodded and nestled in against the pillows.\n“You’re so…” Hua Cheng’s breath shuddered. Clearly, the sight of Xie Lian dozing off with a stomach full of hot cum was going to his head. Reaching out slowly, he took hold of Xie Lian’s hair ribbon and pulled until it fluttered free.\nXie Lian’s hair spilled out, framing his shoulders. He opened his eyes a little, watching Hua Cheng’s sharp, devouring expression. Judging from that look, he was probably getting hard again…\nSo why hadn ’t he kissed him yet?!\nIt was to be expected, right?! Hua Cheng had always told him that it was good etiquette to kiss a lover after they’ve serviced you—unless maybe that was just another tactic from Hua Cheng to get more kisses.\nJust as he had that thought, Hua Cheng leaned forward and pecked his forehead with utmost care. “You don’t have to do anything,” he murmured. “Just lie back.”\nExactly, Xie Lian thought. You’re the one who has to do something. Flushed with hope, he lifted his chin.\nHua Cheng’s hand slipped down to his cheek. His thumb ran over Xie Lian’s lower lip.\nXie Lian waited, his heart pounding.\nBut a complicated look crossed Hua Cheng’s face, and he hesitated. Then—\nHe kissed Xie Lian’s chin, before continuing further down.\nOpening his eyes, Xie Lian gave a look of bewilderment. San Lang, when you forgot me, did you forget about the concept of kisses on the mouth, too?! There was no way, it was impossible to miss, unless—\nHe didn’t want to.\nAnd if Hua Cheng didn’t want to, no matter how much Xie Lian begged—even if Hua Cheng gave the kiss out of pity—it wouldn’t work.\nXie Lian couldn’t help it; he teared up a little, his mind going to the worst possibilities even as Hua Cheng pressed kisses into his jaw. Was this what he was? An annoying, clumsy, unkissable plaything?\nThen why would Hua Cheng be kissing everywhere else on his body???\nTurning his head, he tried to meet Hua Cheng’s gaze. “My lord?”\nWhen Hua Cheng looked up, his movements were slow and syrupy, like he’d just come out of a trance.\nMaybe Hua Cheng just needed encouragement; Xie Lian could kiss him first. “Can I—”\n“No.”\n“I didn’t even say what…”\n“Are you going to ask to do something for me?”\nXie Lian closed his mouth, not daring to answer.\n“If you try asking again, I’ll gag you.”\nXie Lian nodded.\nOne hand crept down, parting Xie Lian’s robes as it went. “You’re a god,” Hua Cheng said, his eye burning. “Take your offerings.”\n“En, en,” Xie Lian said. He was feeling a little dazed by that sentence. Maybe it was best to just let things take their course after all. “What does my lord want to give me?”\nHua Cheng pressed a deep kiss into Xie Lian’s neck, reached down, and gave his groin a squeeze.\nXie Lian jerked in place, straining against his bonds. “That’s—!”\nThat same skilled hand kneaded at his crotch, then crept inside his robes to pull his cock free. Xie Lian felt dizzy. Oh, he was about to—he was about to get—\nHua Cheng stopped kissing his neck to look down. A smile crossed his face. “Still asking to serve me when you’re like this, Your Highness?”\nAs silly as he knew it was, Xie Lian squeezed his eyes shut and turned his head away. Seeing his own swollen, blushing cock, the head plump and already shiny with precum, was one thing, but knowing that this was Hua Cheng’s first time seeing it too, it really—\n“Is it embarrassing?” Hua Cheng laughed in his ear.\n“It is when you stare at it like that…”\n“Don’t worry, Your Highness.”\nXie Lian’s eyes fluttered open, at that. He looked up, his brow furrowed in question.\n“I didn’t take it out just to stare,” Hua Cheng finished with a grin, then wrapped his hand around Xie Lian’s cock and pressed hard.\n“Ah—!” Xie Lian jumped, his thighs tightening. “Wait wait wait, not so fast—”\n“Not so fast?” Hua Cheng mused. “Fine. If that’s what His Highness wants.”\nXie Lian knew instantly that he’d made a terrible mistake, but it didn’t sink in until Hua Cheng started moving his hand.\nSlowly.\nVery slowly.\nXie Lian made a soft complaint in the back of his throat. He couldn’t help it. Hua Cheng’s hand, now slick with precum, stroked the head of Xie Lian’s cock, the touch so gentle that it almost burned. Xie Lian winced.\n“O-ow…”\nContinuing at that torturous pace, Hua Cheng stared at Xie Lian’s face, swallowing every expression. “Does it hurt? Should I make it feel better?”\nXie Lian nodded quickly.\n“Oh.”\n\nWHAT DO YOU MEAN, OH?\n\n“Can you go a little fah—faster—”\n“Why?”\n“You know why…”\nAs if he hadn’t heard anything, Hua Cheng kept up the same punishingly slow pace, up and down, up and down—staring at Xie Lian’s face with something like obsession all the while.\n“It really hurts…” Xie Lian said quietly. His legs had started to tremble.\nHua Cheng wrapped his free arm around Xie Lian’s waist, then leaned in and kissed his collarbone. “Better?”\nIn Xie Lian’s sensitive state, the kiss felt like getting eaten alive, like helplessness and dread all mixed together. He shook his head wildly.\n“No?” Hua Cheng laughed. The pace of his hand didn’t change, but he laid a wet kiss to Xie Lian’s ear. “What about now?”\nA spasm went through Xie Lian’s stomach. He held his breath and strained, trying to come, but of course he couldn’t; he could only force precum to leak helplessly. The fruitless effort made him let out a burst of held breath, before starting to pant.\n“Shhh, shhh. You’ll come, Your Highness, just relax.” Hua Cheng tucked into Xie Lian’s neck, humming and kissing, until Xie Lian could almost feel him in his throat.\nXie Lian’s thighs quivered with the next bout of shivering. It lasted so long that he thought he’d be sick; but he knew that the feeling of him shaking would only make Hua Cheng more excited, and he was right. Deadly fingers found one nipple, stroking languidly, as Hua Cheng’s stare turned even more intense.\nThe intensity of the stare did nothing for the pace of his hand, though. Xie Lian could only stare down, tears in his eyes, as his poor, desperately swollen cock was handled with such cruel restraint.\nHua Cheng sighed, switching his grip and giving one long stroke up, bringing out a dribble of precum. It beaded at the tip, then leaked uselessly down Hua Cheng’s fingers.\n“U-ugh…” Xie Lian whimpered.\nHua Cheng smiled, resuming his tortuously slow pace. “Your Highness, you’re really amazing. You vibrate and make music; you’re like a guqin.”\n“Then pl—ah!”\nOne curious hand had slipped down to his rear, giving a squeeze. “Or maybe a pipa.”\n“Then play faster—f—FUCK!” Xie Lian sobbed.\nChuckling at the swear, Hua Cheng nuzzled him. “Why would I play faster? This is mellow music, to please gods.”\nXie Lian shook his head. “L-liar—”\n“I don’t lie, Your Highness.”\n“Fine! Then I’m not a god, I don’t like that kind of music!” Xie Lian cried out, feeling stupid. “I’m a scrap-collector, just a simple scrap collector!”\nHua Cheng burst out laughing.\nAbout to give up on coming forever, Xie Lian made a despairing face—when all of a sudden, Hua Cheng’s hand suddenly stopped. His thumb pressed down onto the swollen hole at the tip of Xie Lian’s cock.\n“Okay, Your Highness. Are you listening?”\nDetermined not to be bullied again, Xie Lian closed his eyes and didn’t answer.\n“You’re going to finish for me now.”\nXie Lian opened his eyes. “What—”\nThen his cock was being gripped tight by two slick hands—massaging top to bottom, kneading so hard and steady that they would’ve made quick work of a pile of dough.\n“Aren’t you a god?” Hua Cheng breathed in his ear. “Beautiful god. Come.”\nAll words were lost. Xie Lian choked, then saw stars, then came so hard that he blacked out.\n \n🥮\n \nWhen Xie Lian opened his eyes, he was being carefully cleaned off with a towel, lying in bed.\nHis mind was blank. Where was he? What was happening?\n“Hold still,” said a gentle voice.\nHearing that familiar sound, Xie Lian smiled, knowing where he was and who he was with—loving, safe. He reached out for it, wrapping the source in an embrace and pulling him down. So warm, so good.\nThe person who he was embracing let himself be pulled, jerky in his movements, as if he was unfamiliar with it. Xie Lian thought this was silly. Didn’t they hug in bed like this all the time?\nAt last, though, the person, his pretty ghost, let himself be pulled down. Xie Lian draped himself over him, then pressed his head against his chest and smiled.\n“Love you, San Lang,” he mumbled.\nHua Cheng went rigid.\nXie Lian’s eyes snapped open.\n\nFUCK!!!!! HE'D \nFUCKED UP!!!!!!!!\n\nIn the words of an old former friend, he’d called the wrong person. There were only two options now.\nOne, tell Hua Cheng that “San Lang” was the one he was waiting for. If he did that, Hua Cheng would never kiss him.\nTwo, tell Hua Cheng that they’d been married and he’d lost his memories, a story anyone would be insane to believe. If he did that, Hua Cheng would never kiss him, either.\nHua Cheng would never kiss him.\nHua Cheng would never get his memories back.\nIn a panic, Xie Lian sat up. He had to think. He had to get air and think. One quick glance at Hua Cheng in bed beside him to see if maybe it was fine—\nHua Cheng was wearing a devastated expression.\n“Have to get some air,” Xie Lian mumbled, snatched up his robes, tied his belt quickly, charged out the door and down the hall and out into the walled courtyard outside.\n \n🥮\n \nIt was raining a little bit.\nThe rain wasn’t enough to be a downpour, just enough to make the grass in the courtyard slippery. It was therefore no surprise when Xie Lian slipped.\n\nSPLASH!\n\nLuckily, he hadn’t pitched into the small decorative pond; he’d just fallen to his hands and knees in front of it. Rather, the splash had come from…\nRubbing rain out of his eyes, Xie Lian looked to the side and saw a bucket turned over. He’d knocked over the lotus they’d planted.\nXie Lian’s eyes filled with tears.\nStill, he scrambled over and righted it. The tuber had been knocked askew, half the water spilled. Thoughtlessly, he pressed it back down in place, then cupped his hands and started scooping water up from the pond. Little by little, he started filling up the bucket again.\nSuddenly, though, he realized something. Before, the water in the bucket had been chaotic, rippling with raindrops from above. Now, though, it was peaceful and still.\nXie Lian paused, then looked up.\nHua Cheng was standing over him, holding an umbrella over his head.\nBut Hua Cheng’s expression wasn’t stormy; there was only a tender sadness, and he spoke gently:\n“Who’s San Lang?”\nWith his hands covered in mud, Xie Lian stared up. He couldn’t speak; he was afraid he’d burst into tears.\n“Is he the one you want to be reunited with?”\nAfter a moment’s hesitation, Xie Lian gave up. He nodded.\nSlowly, Hua Cheng sank down. The edges of his robes were getting stained, but it didn’t seem to bother him. His gaze was fixed on Xie Lian. “Why didn’t you say anything?”\nXie Lian’s lips wobbled, but he restrained himself. “Because it’s impossible.”\n“What’s impossible?”\nXie Lian couldn’t look at him, shaking his head. He didn’t know what to say anymore. “Because we can’t be together again. It’s impossible.”\nFor a long moment, Hua Cheng pondered. There was a conflicted look in his eye, but he seemed to suppress it and asked quietly: “Why not?”\nAt that, finally, it was impossible to hold back. Tears rolled down Xie Lian’s cheeks, and his voice thickened.\n“Because I’m not good enough to get him back,” Xie Lian wept, wiping his sleeve across his eyes. “I got him once since I got lucky, but I lost him, and now I can’t ever get him back. I wasn’t good enough to get him in the first place, it was all luck all along.”\n“You aren’t good enough?” Hua Cheng murmured, somewhere between pity and amusement. “Your Highness, how aren’t you good enough?”\n“I’m just not,” Xie Lian said, wiping away frustrated tears. “I’m not smart enough, or appealing enough, or skilled enough, or—or anything at all. I can do a few things, but I mostly just got lucky. Why would I deserve someone so good, that kind of devotion? Anyone could’ve done what I did for him, I just got lucky that one time.”\n“So you’ll give up on this person?”\nXie Lian messily wiped at his face, choking back a sob. “It’s—it’s not giving up, it’s setting him free. Don’t you get it?”\nThere was a long silence, punctuated by the patter of the rain on the umbrella. Hua Cheng seemed to be thinking to himself. There was a slump in his shoulders, like he was shouldering some terrible hurt; but his eye still shone, and he smiled sadly.\n“Your Highness,” he said finally, with so much gentleness in his voice that it twisted the heart to hear. “I know I’ve been a bit callous towards you. Still, I hope that you’ll hear what I have to say.”\nEmbarrassed at his outburst, Xie Lian nodded without a word.\n“Of course you’re good enough,” Hua Cheng went on, meeting his gaze. “You’re more than good enough. You’re smart, you’re resourceful, you’re kind. You don’t give up easily. Your insight is sharp, but not enough to make you cold. You’re warm to be around. It’s easy to like you.” He seemed to struggle with something, but kept his voice steady. “Better stated, it’s impossible not to. Actually, I…”\nHis voice lowered, and his grip tightened on the handle of the umbrella.\n“I’m only saying like because I don’t dare to say more.”\nAt that, Xie Lian looked up in surprise. “You—”\n“Don’t,” Hua Cheng interrupted, putting a finger to his lips. Even that movement seemed to pain him, like it was the last thing he wanted to do. “I’m sorry. I didn’t say that to add to your troubles. If you have something to say to your important person, don’t waste it on me.”\nXie Lian blinked at him, startled. When the hand had been moved away, he spoke slowly. “Then why didn’t you…”\n“Kiss you?”\nXie Lian went weak, trembling. He knew that what he heard next would tell him his fate, and he was scared; but what he heard made his chest tighten with another feeling entirely.\n“Because you’d said you had someone else,” Hua Cheng finished. “I know you wanted it, but I didn’t want to take advantage. Really, I think…”\nThe next words seemed to be choked out of an unwilling throat, but they came:\n“Your Highness, if you love someone so much, it must be the purest love in the whole world. I’d never take something so precious from someone—“ He stopped and laughed to himself. “No, that’s not right. I’d take precious things from anyone, just never from you. See what you’ve done to me, Your Highness?” His voice became unsteady with a hint of tears, and the umbrella in his hand trembled. “Just after a few short days?”\nXie Lian was too stunned to speak, so Hua Cheng just kept on going:\n“You can’t give up on the person you love. You have to reunite with him again; I can see you won’t be happy until you do. And you have to be happy, or else—or else—“ The umbrella started trembling so violently that he had to add another hand to steady it, and he laughed helplessly. “Can you tell I want to kill myself for saying this? Still, I can’t keep you trapped. I want to, though. I want to stuff you in a birdcage and keep you to myself forever. I’ve gone crazy. You should really run before I change my mind, Your Highness, there’s something wrong with me—”\n“You’re right,” Xie Lian burst out suddenly. “I shouldn’t give up. I won’t.”\n“…good,” Hua Cheng breathed, though his shoulders trembled. “I didn’t think you would.”\n“You asked who San Lang is.”\n“I’m sure he’s a…” Hua Cheng was trembling with desperation. “A very lucky—”\n“It’s you.”\nDead silence. Raindrops drumming on the roof of a red umbrella.\nHua Cheng stared, dumbfounded, and opened his mouth to speak—but once Xie Lian got started, he couldn’t stop, rambling like crazy.\n“It’s you, it’s you, of course it’s you! It’s always been you,” he blurted out. “I know it won’t make sense, I’ll sound like I’ve gone stupid, but actually, you lost your memories because of a curse, so you don’t remember me at all. Also, nobody around you remembers me, because of the curse—I know it sounds like I’ve gone crazy—also, if there’s anything around you that’s related to me, it’ll look different, and—”\nRealizing how ridiculous it sounded, Xie Lian couldn’t help but tear up in frustration. Facing Hua Cheng’s shocked expression, he went on:\n“And we weren’t just together, we got married!” On that word, the tears overflowed. “You promised never to leave me, and we knew each other for hundreds of years, and you gave me your ashes, I just didn’t bring them because I thought you’d kill me if I—”\nAt that, Hua Cheng, who’d just been staring straight ahead, tried to speak. “Wait, wait, go back,” he fumbled out. \"I—I’m married? To you?”\nSee?” Xie Lian blubbered. “It’s—hic—different when you’re the one who’d actually get stuck with me, right? With my terrible cooking, and my lecturing, and my—”\n“W-w-wait a second.” Hua Cheng looked like he’d just had a plate shattered over his head. “Married as in—”\n“Married as in married, what else is there?” Xie Lian sobbed. “We spent so much time together, eating together, answering prayers together, fixing up my shrine together, having fun in ghost city, everything. We’ve slept in that bed together more times than I can count, and we spent all the important festivals together in the market, eating weird candy, only you would always tell me which ones I shouldn’t eat—”\nHua Cheng looked like he’d just had three plates shattered over his head before getting hit by a hammer. “I got to do all that with you? Together?”\n“We were even planning to see the ghost city fireworks tonight, at the mid-autumn festival.” Xie Lian sniffled, rubbing his eyes with his sleeve. “I know it doesn’t make any sense—”\n“Wait, so when you said that you’d done it before, you meant—”\n“Of course I’ve done it with you, who else would I do it with? You taught me how, we’ve done it so many times, in all sorts of ways, I don’t know!” Xie Lian had gone completely silly, saying anything that appeared in his head without thinking. “Forward, backward, sideways—”\nWith a dazed look on his face, Hua Cheng stared at him, rainwater dripping off his hair.\n“—but now that I spent the whole past few days being a burden, bothering you, ruining your meals, I don’t know if—”\nAll of a sudden, there was something being crammed into Xie Lian’s hand. It was the handle of the umbrella. Xie Lian took hold of it and held it upright in his shock, just in time for Hua Cheng to throw himself in a bow in front of him and shout—\n“I’m sorry!”\nQuickly adjusting the umbrella, Xie Lian blinked. “Huh?!”\n“Please take me back,” Hua Cheng begged, with his face to the ground. “I’ll—I’ll do anything. We’re still married, right? I’m sorry, Your Highness. I know I was rude. I just didn’t know what else to do. I promise I won’t be like that anymore, I’ll treat you like a god, I’ll do anything you want. It’s okay if I can’t ever get my memories of you back, we can just make new ones. Okay? We’ll do all of those things together—”\n“Wait, you…you believe me?” Xie Lian paused, then peered down at him. “San Lang, did hit your head—”\nHua Cheng shook his head and straightened up, his eye soft with fondness. “It’s not about believing you. It’s just that if there’s any chance of what you just said being true, I have to take it.”\nStunned by the words, Xie Lian was speechless for a moment. “You’d really want me?” he whispered finally. “Even without knowing why you loved me in the first place?”\n“I love you now. Isn’t it enough?”\nFor a moment, Xie Lian just looked at him. His heart felt swollen and warm.\nHua Cheng looked back and smiled, tearful.\nThen—\nXie Lian crossed his arms, folding the umbrella in his elbow. His tone changed. “So you’re sorry, are you?”\nHua Cheng opened his mouth, then closed it. “I—”\nReaching out, Xie Lian pinched one cheek and stretched it, scolding him sternly. “You should be sorry, I can’t believe how rude you were. I’m going to teach you manners; I’ve been too soft for too long, this was really unacceptable. Is this really how you treat everyone who isn’t me? Do you think it’s okay to treat guests like that, ah?”\n“Your Highness,” Hua Cheng pleaded, his voice muffled by the stretching. “I’m sorry, Your Highness, I was wrong…”\n“I’m going to find the longest hospitality manual I can, and you’re going to copy it.” Xie Lian stretched his cheek a little more. “Three times.”\nThoroughly scolded, Hua Cheng nodded obediently.\nLetting out a sigh, Xie Lian released his cheek. “Even though I know you won’t, once you get your memories back. I’ll consider you forgiven as long as you come with me to the fireworks tonight.”\nAt that, Hua Cheng’s eyes widened in shock. “I can get my memories back? Your Highness! You know how to break the curse?”\n“…en.”\nHua Cheng’s eye shone so brightly that Xie Lian almost had to look away, and he put his hands on Xie Lian’s shoulders. “Tell me.”\n“…” Xie Lian eyed him guiltily. “Are you sure you want them back now, before going to the festival? We can do it after…”\n“Why wait?”\n“Hmmm. It’s only that, once you remember everything, it might be difficult to get you to come with me…you really want them back right now?”\n“I do,” said Hua Cheng, beaming. “I want to remember as soon as possible. I want to know everything about you.”\nHow could Xie Lian say no to a face like that?\n“All right, but don’t blame yourself,” Xie Lian said. “The way you get them back is by kissing mmmmnh—”\nHua Cheng had thrown himself forward, meeting Xie Lian’s lips with his own. The umbrella went flying.\nBy the time he was done kissing, the rain had slowed to a drizzle, then stopped.\nWith a dreamy smile still on his face, Hua Cheng eased back.\n“…”\nThen, he blinked.\n.\n.\n.\n \n🥮\n \n“San Lang. San Lang? San Lang.” Xie Lian tried to walk, pulling along the dead weight on his leg. “San Lang, San Lang. Come on, we’re going to miss the fireworks. San Lang.”\nHua Cheng was face-down, gripping Xie Lian’s ankle. His voice was muffled by the grass. “Just drag me through the mud.”\n“San Lang, don’t be like this, your clothes are getting all dirty. We’re going to the fireworks, remember? Let’s get changed, quick, quick!”\n“Gege,” Hua Cheng whined.\n“Shhh. Don’t you want moon cakes? Come on!”\n“I don’t deserve it.”\n“Don’t be silly.”\n“Drown me in the pond.”\n“You’re a ghost, you can’t drown…ah, that reminds me.” Xie Lian squatted down, lifting Hua Cheng’s head up. Wiping the mud off that despondent face, he pressed his lips over and kissed, taking some spiritual energy.\n“Mmmn,” Hua Cheng lamented into the kiss.\n“Stop it. Be good and stop getting your robes muddy.” Letting Hua Cheng’s face sink back down, Xie Lian put his fingers to his temple and spoke into the array. “Hey everyone, guess what? Good news! I got his memories back!”\nFeng Xin’s voice boomed first. “Good job, Your Highness! I knew you could do it!”\nMu Qing scoffed. “Great. Just please don’t tell us the details.”\n“…I wasn’t going to…anyway, anyway, there’s just one more thing: Guoshi, can you remove the cursed shackle?”\nGuoshi’s voice drifted in. “Huh? Shackle? Just a second, I’m busy…when I win I’ll take it off! Just one more game, one more—!”\nHua Cheng reached over, clenching his hand around Xie Lian’s ankle and connecting to the array. He snarled into it:\n\n“WHOEVER PUT THE SHACKLE ON HIM, TAKE IT OFF.”\n\nThere was silence.\n“…”\n“…”\n“…”\n“…”\nThen—pop! The delicate black chain dissolved into dust and vanished.\n \n🥮\n \n“Look!” Xie Lian pointed up, dangling his legs off the dock. “I think that one’s a dragon.”\nHua Cheng was draped over him, his head leaned on his shoulder. He sighed.\n“San Lang, are you looking?”\n“I should be dead.”\nXie Lian crammed a mooncake into Hua Cheng’s mouth, then pointed up again. This time, when he spoke, it was an order. “Look at the dragon.”\nHua Cheng looked up.\n“Isn’t it interesting?”\n“Mn.”\n“Chew.”\nRaising a hand to the cake shoved in his mouth, Hua Cheng reluctantly tore off a bite and chewed.\n“You’re going to have fun today,” Xie Lian said, patting his hand.\nAt that, Hua Cheng couldn’t help but laugh. “Do I have a choice?”\n“No.”\n“Oh.”\n“You ordered me around for days, isn’t it my turn?”\nHua Cheng reached around Xie Lian’s waist and squeezed, miserable. “Gege, I’m so sorry…”\n“It’s fine, it’s fine! Aiyah, you’re so dramatic. It wasn’t bad. It was actually cute to see you all standoffish like that.”\nAt that, Hua Cheng lifted his head. “…” He searched out Xie Lian’s eyes, suspicious. “Oh? Did you like that?”\nRealizing he’d said a little too much, Xie Lian shoved a mooncake in his own mouth, stuffing his cheeks with sweet filling and crumbs.\nStill, Hua Cheng was relentless; once he’d caught the hint, he went mischievous, squeezing Xie Lian tighter. “So it wasn’t pretending, when gege went all tender at a little teasing?”\nXie Lian mumbled through a mouthful, embarrassed. “I thought you were supposed to be sorry...”\nHua Cheng seemed to perk up a little. “I am, but I’ve also learned something new about gege.”\n“I’ll make you copy that scroll three times over. I mean it.”\n“En, en.”\nKnowing that he’d opened a dangerous door, Xie Lian gave a shy glance over at Hua Cheng, then finished off his mooncake. “…also, I have a question.”\n“Hm?”\n“It’s about the Thousand Gold Come-And-Go Stew,” Xie Lian said. He sighed. “In the future, it’s best that you don’t lie about liking it; there’s no reason for you to choke down garbage.”\n“Who says I didn’t like it?”\n“You did, remember?”\n“I didn’t,” Hua Cheng said, slotting his chin over Xie Lian’s shoulder. “I only told you how to make it more like what people consider 'good food,' but they’re all trash. It’s still my favorite dish.”\n“But that first night, you clearly didn’t like it…”\n“It had a surprising feel, but I liked it. I even went back for another helping once you'd gone to sleep. Maybe the taste couldn’t be considered traditional, but when I knew that it was made by your hands, I couldn’t help but want more.”\nTouched, Xie Lian met his eyes. “…you really felt like that?”\n“Your Highness, you could’ve told me who you were by the first night,” said Hua Cheng, staring off into the fireworks. “I would’ve done whatever you said, even then. I was terrified of what was happening to me, but I was obsessed with you.”\nFeeling soft inside, Xie Lian blushed and petted his head. They both looked up at the fireworks together, hand in hand.\nXie Lian smiled.\n“Does this mean you aren’t going to boil me?”\n“GEGE!”\n.\n.\n."
}