{
    "id": "42356628",
    "url": "https://archiveofourown.org/works/42356628?view_full_work=true",
    "author": [
        "darkbluedark"
    ],
    "title": "Three's Family",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "F/M",
        "Gen"
    ],
    "fandoms": [
        "Harry Potter - J. K. Rowling"
    ],
    "relationships": [
        "James Potter/Lily Evans Potter",
        "Draco Malfoy & Harry Potter",
        "background Remus Lupin/Sirius Black - Relationship",
        "Sirius Black & James Potter",
        "Harry Potter & James Potter & Lily Evans Potter"
    ],
    "characters": [
        "Harry Potter",
        "Draco Malfoy",
        "James Potter",
        "Lily Evans Potter",
        "Sirius Black",
        "Albus Dumbledore",
        "Dorcas Meadowes"
    ],
    "additional_tags": [
        "Time Travel",
        "Time Travel Fix-It",
        "Fluff and Humor",
        "And Hard Truths",
        "First Wizarding War with Voldemort (Harry Potter)",
        "Marauders Era (Harry Potter)",
        "Found Family",
        "LITERALLY",
        "proposal",
        "not drarry",
        "unless you consider bickering to be foreplay in which case you may consider this pre-slash",
        "Enemies to reluctant allies",
        "Time Travelling Harry Potter"
    ],
    "language": "English",
    "series": "Part 1 of Still Preoccupied... With 1979",
    "published": "2022-10-13",
    "completed": "2022-10-22",
    "words": "19,351",
    "chapters": "5/5",
    "comments": "821",
    "kudos": "26,795",
    "bookmarks": "5,978",
    "hits": "243,791",
    "summary": "<p>It’s May 1979 and the Order has just apprehended a pair of mysterious wizards who look remarkably like a Potter and a Malfoy. Naturally, James Potter and Sirius Black are called in to identify the strangely familiar strangers and determine their backgrounds and loyalties.</p>\n<p>(This would be a lot easier if their captives weren’t convinced everyone they talk to is dead. It would also be easier if they didn’t spend half their bloody time bickering.)</p>\n<p>**</p>\n<p>“Just ask them questions only they would know the answer to,” Malfoy suggests.</p>\n<p>“There’s not a single thing that I know about either of them from the first war that any old Death Eater couldn’t find out.”</p>\n<p>“How is that possible?” Malfoy huffs. “He’s your father!”</p>\n<p>“Am I or am I not <i>famously an orphan?”</i> Potter snarls.</p>\n<p>**</p>\n<p>Русский перевод: https://archiveofourown.org/works/49365862/chapters/124574398<br>中文翻译: https://archiveofourown.org/works/49899721</p>",
    "notes": "<p>The general premise is inspired by justprompts' been waiting a lifetime (to be with you) but it's not necessary to read before this fic</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p>This was originally supposed to be all humor, no feels, so, idrk what happened in this chapter. Not even I saw the proposal coming until I wrote it, but, alas, James Potter will do as James Potter does.</p>\n<p>Anyway, I am determined to keep this fic as light-hearted as possible so Three’s Family will end here. However, if you feel the need for more details about how Harry and Draco will affect the past, you’re in luck because I have something resembling a sequel already half-written. Subscribe to the series for part 2, which will feature a much higher ratio of feels to humor, a depressed Harry adjusting to life without Ron and Hermione, a Regulus/Draco bromance, a marauder-worthy master of death, a jealous Remus, a very barebones description of the horcrux hunt because it’s been done before by others with more enthusiasm than I can bother to muster, a semi-redemption for Peter and a purely-hypothetical redemption for Snape, and some hopefully humorous Harry-shenanigans-centric drinking games.</p>",
    "text": "James and Sirius are already together when they get the summons from Dumbledore. It’s strange because they’re not scheduled for back-up duty tonight, nor are they important enough to the Order to be roped into specialized projects.\nWell, until now. Maybe this is their big break. A chance to prove themselves.\nThey bow out of Pub Night, bidding giddily nervous goodbyes to Lily, Moony, and Wormy, and apparate to the designated safehouse. Dumbledore is already there, along with Moody (James still can’t bring himself to think of the man as Alastor) and McGonagall (ditto about Minerva), which is the second strange thing about tonight because McGonagall is very rarely involved in Order affairs while Hogwarts is in session. James blinks at her, mentally confirms that it’s barely May, and, yes, May is during the school year, and greets her with a puzzled smile.\n“Thank you for coming on such short notice,” Dumbledore says, ushering them inside. They’re at the Devon safehouse, a plain two-storey home mostly filled with bedrooms, medical supplies, and a potions lab. Oh, and its secret dungeons are the securest the Order has.\nJames is suddenly less excited about this mysterious chance to prove himself.\n“Our Hogsmeade patrol responded to a burst of potent magic earlier tonight and happened across a pair of unusual wizards,” Dumbledore explains. “They’re still unconscious at the moment but we are having trouble identifying them.”\nJames blinks and re-assesses the assembled Order members. Two long-time teachers at the only magical school in the Isles and the Head Auror, unable to identify someone? Perhaps they’re foreign wizards, except that wouldn’t explain why James or Sirius would somehow be able to accomplish what their elders can’t.\n“How do you think we can be of assistance?” Sirius asks smoothly while James is still just processing, like an idiot fresh out of school— which, well, he likes to think that a whole year of adulthood is enough to disqualify him from that category, but these days in the Order, it doesn’t always feel that way.\n“We’ve determined that they’re not under the influence of polyjuice, glamours, nor human transfiguration. Usually we can assume unrecognizable wizards might be foreign-born or educated abroad, but they bear none of the usual signs. For one, their shoes and clothes, though somewhat strange-looking, all carry labels of British sellers.”\nJames and Sirius exchange a glance at Dumbledore’s fashion assessment— he’s one to talk— but allow him to continue.\n“Strangest of all, both bear a shocking resemblance to well-established British wizarding families, but neither Minerva nor I can ever recall meeting them.”\nFinally, it starts to make sense. “You think one of them’s a Potter?” he clarifies.\n“And one of them’s a Black?” Sirius adds with audible distaste.\n“Perhaps not a Black but a Malfoy. Alas, you are the most closely related to the Malfoys of anyone else in the Order, so I am going to have to ask you to bear the mantle of Malfoy Expert for us, for the moment.”\nJames doesn’t even have to look to know the kind of grimace Sirius is making at that. But, “fine,” he says, and Dumbledore leads them down the hallway towards the dungeon stairs. \nBehind them, James hears McGonagall decide she’s no longer needed and take her leave. Moody grunts an agreement but is clearly sticking around for back-up around two unknown prisoners.\nTheir steps echo strangely on the damp stone stairs to the dungeons. Sirius descends them almost silently, which makes James all the more self-conscious of every thump he makes. It’s a bit strange how nervous he is, because it’s not even like he knows for sure the prisoner’s a Potter, but his parents just died less than a month ago and anything to do with family is a bit of a touchy subject for him these days.\nThey reach the bottom of the stairs, which turns left into a short hallway between two rows of stone cells. Only one of them appears to be in use, so they all gather in front of a heavy oak door that Dumbledore spells transparent. \nInside are two boys bound to chairs. It’s hard to see their faces, because both their heads are sagging down towards their chests, but honestly, the hair alone is enough to justify Dumbledore’s suspicions. The boy to the left has ink-black hair the exact same length as James’ — the only length his locks have ever deigned to grow out to— and it sticks up at odd angles. The boy on the right is a silky platinum blond, a dead-ringer for the Malfoys.\nThe Potter-haired boy is wearing strange muggle clothes (fine, Dumbledore might have been right about that). Which, yes, Potters generally have no qualms about dabbling in muggle fashion, but these clothes are definitely not fashion. They’re dirty and torn— and charred?!— in places and seem to swamp the boy’s small frame. The Malfoy-looking boy, at least, has robes made of expectedly fine, expensive material, if in a slightly unusual cut. Now that James is looking, though, his robes, too, look a bit big on him, like they might have been well-tailored before he lost a stone or so.\nIt’s utterly bizarre because the boy’s too young and skinny to be Lucius; and the one on the left is clearly not James, although he’s the only known Potter under the age of 87 these days.\n“Blimey,” Sirius whispers. James can only nod dumbly in agreement.\n“Why would anyone try to pose as members of such well-known families?” James mutters. It just doesn’t make sense; it’s a stupid disguise when you could go for non-descript instead, especially when anyone would be suspicious to see a Potter and a Malfoy together, this far into the war...\n“Are they Marked?” Sirius asks.\n“The, well, for lack of a better identifier, the Malfoy boy is. The Potter one isn’t,” Dumbledore says.\nSome tension that James didn’t even realize he was holding in his gut releases at that. Not that the lack of a Dark Mark automatically means he’s not a Death Eater, but, still. Small mercies.\n“Malfoy hair, Malfoy allegiances…” Sirius shrugs. “Looks like a Malfoy to me. Can’t say I’ve heard of any Malfoys disowned in recent memory, though, which Aunt Druella definitely would’ve ferreted out before she let Narcissa get married. So that’s strange.”\nDisowned? James frowns, but he follows the thought. Potters haven’t been very big on disownment of family for, well, living memory, although technically, these days, living memory just boils down to James and his senile Uncle Charlus, who probably isn’t much longer for this world. Still, though, for a kid this young, James would imagine he’d have heard something about a schism in the last few generations, or maybe a child born out of wedlock. Or even a squib. Although maybe he’s the son or grandson of an older Potter squib whose family line they lost track of?\nRegardless. He feels like he should have come up with some kind of idea of who this boy is. “You’re sure they’re not wearing disguises?” he says doubtfully. \n“I checked quite thoroughly.”\nJames frowns and squints harder at the Potter-haired boy. From this angle he can just glimpse the black frames of glasses, which also hints at the accursed Potter eyesight. But wigs and specs are easy enough to fake without magic, aren’t they? Unless Lily was having a go at him again?\n“Have you checked his glasses?” he asks Dumbledore.\n“His glasses?”\n“I mean, are they prescription? If I was a non-Potter trying to pretend to be a Potter, I’d go around in frames filled with regular glass lenses.”\nDumbledore hums thoughtfully. “I found no charms or other spells on them but I’ll admit I did not test their efficacy myself.”\nBefore he’s even made the conscious decision, James has spelled the door open and is walking inside.\n“Prongs!” Sirius hisses.\nJames waves him back absently. “They’re unconscious!” he whisper-yells back. Dumbledore doesn’t protest, so James figures he’s alright to just check those specs real quick.\nHe bends down slightly to tug the glasses off the boy’s face and catches sight of a fresh shiner blooming on the boy’s cheekbone. Ah, well; he’ll only worry about that if the kid turns out not to be a Death Eater after all.\nOne glance through the glasses confirms that they are (1) prescription; (2) of a strong enough prescription to fall within the particular Potter range of visual impairment; and (3) as dirty as the rest of him. James wrinkles his nose and clumsily wedges the frames back onto the boy’s head.\nThe boy seems to stir at the contact to his face, so James wastes no time in high-tailing it back out of the cell and shutting the door behind him. The clang of the lock seems to jolt the boy the rest of the way awake, because his head pops up and James finds himself staring into an eerily recognizable face with incongruously green eyes.\nHis breath catches. Those eyes, they look so familiar but for some reason he can’t place them when they’re set in his own face—\n“Bloody hell,” Sirius murmurs. “He looks just like you, James.”\nJames can only nod.\nThe boy has started struggling against his bonds and looking frantically about the room, swearing vociferously. His gaze lands on the blond boy next to him. “MALFOY!” he yells. “YOU BASTARD!”\n“Well,” Sirius mutters. “As if we had any lingering doubts about that.”\n“MALFOY!” the boy yells again. He looks much less like a boy now that he’s awake and furious, though. Those eyes alone could age him a decade; they look exhausted.\nThe Malfoy boy starts to stir, now, too; his impatient companion scoots his chair slightly to the right to kick at his ankle with one bound leg.\n“Where the fuck are we, Malfoy?”\nMalfoy finally pulls his head up with a grimace and blinks uncomprehendingly at his surroundings. “Potter?” he mutters, sounding genuinely confused.\nJames is also genuinely confused. He thinks a part of him is excited to meet a new, unheard-of Potter, although his familiarity with a Death Eater is slightly concerning. Then again, the familiarity does not seem very friendly, so perhaps there’s hope. James glances at Dumbledore and Sirius, both of whom seem equally content to sit back and see what they can learn by observing them through the door.\n“This thing’s only transparent one-way, right?” James murmurs.\n“Naturally,” says Dumbledore.\nGood. James returns his attention to his strange green-eyed relative, who seems to be on the verge of panic.\n“Where the fuck are Ron and Hermione?” he snarls.\n“I don’t even know where the fuck we are, Potter!” Malfoy returns. “Give me a bloody minute— I don’t remember how we got here.”\n“Oh yeah right, because I’m just tied up in a dungeon somewhere and you and your daddy’s Death Eater buddies had nothing to do with it.”\n“He even sounds like you,” Sirius murmurs.\n“What? No he doesn’t.”\n“He does. Well, his voice sounds like yours. Accent is terribly common, though.”\nJames has no response to that. \nThe Malfoy boy, at least, sounds like the proper rich ponce he’s expected to be. “Honestly, Potter, the last thing I remember is tracking you through Hogwarts to get my wand back.”\nPotter stills, suddenly, and squeezes his eyes shut. “We were in the Room of Requirement?”\n“What in Merlin’s name is the Room of Requirement?”\n“Oh come off it, like you didn’t spend all your free time in there last year fixing your precious vanishing cabinet,” Potter spits.\n“The Room of Hidden Things?”\n“Yeah, whatever.\" Potter's shoulders suddenly tense, and his eyes narrow. \"You jumped me trying to get your wand back,” he accuses.\n“You stole my wand!”\n“Your family was trying to kill me!”\n“I stalled as much as I could,” Malfoy retorts. “Fat lot of good that did me.”\nPotter sighs. “The Room is the last thing I remember,” he says despondently.\n“Me too.”\n“Fuck, but— RON! HERMIONE!” he bellows. Malfoy winces deeply. “RON!! HERMIONE!! ARE YOU HERE?!”\nMalfoy groans. “Shut the fuck up, Potter, I think I hit my head.”\n“—MIONE!!— What?”\n“I think I hit my head,” Malfoy repeats with audible impatience. “You shouting a foot from my ear is not bloody helping!”\n“Oh, god forbid I give you a headache when you’ve gone and gotten us captured,” Potter snarls.\n“Muggle-raised,” Sirius murmurs. \nJames jumps, startled to be pulled out of this strangely riveting melodrama and back into his own surroundings. He finds himself leaning against the door, face and palms pressed to the transparent wood like glass in a window. “What?” he mumbles.\n“He said god forbid. He must be muggle-raised. Can’t really be a Potter.”\n“Could be descended from a squib Potter,” James offers.\n“Have there been any squib Potters in the last century?” Dumbledore asks curiously.\n“Not that I know of, but,” James shrugs. “Can’t figure out how else— who else he could be.”\nNobody seems to have additional thoughts at the moment, so they turn their attentions back to the cell. Malfoy seems to have convinced Potter not to shout for his mysterious companions any longer, but they’re only yelling at each other now instead.\n“As if my father would leave me locked up in a dungeon if we were captured by the Dark Lord’s forces!” Malfoy is protesting.\n“Come off it,” Potter says. “He knows you could’ve identified me back at the Manor and you didn’t. You might as well be a blood traitor now.” He sounds both pitying and vindicated by this. James only feels increasingly more lost.\nMalfoy is swearing profusely under his breath. “No,” he finally decides. “We were obviously both knocked out in an altercation in the Room of Hidden Things. Vince and Greg both think I was hunting you down to turn you over to the Dark Lord. That I didn’t manage it makes me a failure, not a traitor.”\n“Like Voldemort cares about the bloody difference,” Potter mutters.\nJames sucks in a shocked breath. Few people these days are brave enough to say the full name. He glances at Dumbledore, who looks equally surprised at this development.\nMalfoy swears some more.\n“Look, Malfoy,” Potter says wearily. “If Ron and Hermione—” his voice cracks slightly. He tries again. “If they made it out alive, then they’ll be coming for me, and they’ll probably call in the whole Order.”\nJames feels his eyebrows creeping up his forehead. Who does this kid think he is that he and his absolutely unheard-of friends could mobilize the entire Order of the Phoenix at the drop of a hat?\n“Bully for you,” Malfoy mutters.\n“Malfoy,” Potter repeats, more urgently. “I know you hate being a Death Eater. I know you’re not cut out for torturing people and I know you’ve been punished for it.”\n“How do you—?!”\n“Don’t worry about it. Listen. If you help me escape right now, I’ll make the Order take you under their protection.”\nMalfoy sneers, but it doesn’t completely mask his uncertainty. “How do I know you’re not some trap set by my aunt?”\n“How do I know you’re not some trap set by your aunt?”\n“Because the Dark Lord wouldn’t bother? He’d have already killed you himself.”\nPotter hums. “Good point, yeah,” he says. “Dunno why he'd have me taken somewhere else when he had a whole army already in place. Unless he decided to go gallivanting across the country checking again on all the ho— things I stole from him.” He turns pensive while Malfoy gapes. “You’d think by now, actually, he’d have heard of my capture.”\n“Maybe he’s just on his way.”\n“Well yeah, but I’d have felt it.”\n\n”Felt it?”\n\n“Yeah, I get— You know what, don’t worry about it. The point is, this obviously isn’t a trap for me, because why bother, and this is obviously not a trap for you, because nobody would consider using me in any scenario to trick you when I could be much more lucrative turned into Voldemort himself, yeah?”\n“Unless you’re not actually Potter, in which case, it very well could be a trap for me.”\nPotter sighs heavily. “Okay. Erm. Ask me something only I would know then.”\nThere ensues a silence that only grows more awkward the longer it goes on.\n“Bit hard to do when we hate each other and only interact in public, huh,” Potter eventually says, which draws a mean snicker from Sirius.\n“There’s nothing only you’d know that other people don’t,” Malfoy agrees.\n“Okay, well, how about I just start talking and you let me know when you’re convinced?”\n“Alright then,” Malfoy says doubtfully.\nPotter draws in a deep breath. “The first time we met was in Madam Malkin’s and you asked if my parents were both magical and then said the ‘other sort’ shouldn’t be allowed in, and then you saw I was there with Hagrid and insulted him too—”\nMalfoy interrupts with a gasp. “That was you?”\nFor a moment, Potter looks genuinely taken aback. “Who else did you think I was?”\n“I don’t know, some other random boy! Why would they send that oaf Hagrid, of all people, to Diagon Alley with their precious saviour?”\nJames blinks. Saviour? At eleven??\n“See, Malfoy,” Potter says bitterly. “This is why you’re such an arsehole. Ingrained blood purism aside, Hagrid was my first friend and you insulted him right to my face and you were such a stuck-up self-important eleven year-old that you didn’t even bother asking the name of the kid you were talking to.”\n“Or maybe that wasn’t Potter at all and you’re the actual boy I met at Madam Malkin’s posing as him.”\n“Oh, for— fine. D’you really want me to go into the time you tried to crucio me and I almost killed you in that lavatory?”\nMalfoy turns grey in the face and shakes his head, then winces. “No. But Snape was there. Try something else.”\nPotter rolls his eyes dramatically. “Speaking of lavatories, d’you remember when you were hanging out with Crabbe and Goyle in the common room during Christmas Hols second year, and they asked you what you knew about the Heir of Slytherin and then ran off with stomachaches?”\n“What the hell, Potter?” Malfoy asks with narrowed eyes. “How do you know about that? And what does that have to do with lavatories?”\n“It was actually me and Ron under polyjuice that Hermione brewed in Moaning Myrtle’s loo,” Potter says with vicious glee.\n“Absolutely not. No way.”\n“Yes way. You found us wandering aimlessly around the dungeons and brought us into the common room— the password was pureblood, which, eurgh— and then when you said you hoped it would be Hermione who died, Ron got so angry I had to suggest it would be better if the monster killed me instead.”\n“YOU IMPERTINENT, SCHEMING BASTARDS!” Malfoy yells. He starts writhing in his ropes.\nPotter sits back within his bonds, looking extremely pleased with himself. “Of course, you’ve no proof that was really me, either, but if you’re still not convinced, I can continue—”\n“NO, FUCK YOU, POTTER! No one else could possibly possess such disregard for the rules and the hallowed sanctity of the Slytherin common room—”\n“Third year, Hermione punched you in the face and called you a ‘foul, loathsome, evil little cockroach,’” Potter continues with a contented sigh, ignoring Malfoy’s blustering rage. “I remember every detail of that moment, I assure you; it was the best day of my life.”\n“Fine!” Malfoy yells. “Fine, Scarhead, you want to prove your identity? At the beginning of last year, I caught you snooping under your invisibility cloak— eurgh, you really have no respect for other people’s privacy, what the fuck— and then I broke your hand. Where did I leave your invisible, helpless, petrified body to be found?”\nPotter scowls darkly. “The Hogwarts Express, and you know as well as I do it was my nose, and fuck you again for that, you prick.”\n“Seems like you are Potter after all,” Malfoy says with a poisoned-honey smile.\n“Bloody great. Can we get back to the real problem now?” Potter grumbles.\n“Right.” Malfoy huffs out a steadying breath as his eyes rove the walls of their cell. “I don’t recognize these dungeons. Might be some unfortunate group of snatchers too dumb to recognize either of us?”\n“My sodding face is plastered along every free wall in Diagon Alley. It’s not even swollen this time.”\nThis must be at least the third time by now that Potter has suggested the entire wizarding world is supposed to recognize him on sight, and James is getting so dizzy trying to keep up with this absolutely bonkers conversation and also try to process the facts in a way that makes sense because you’d think, if everyone knew who this Potter was, then surely James should know him too?? There’s something not adding up but he can’t figure it out and they just keep talking, he wishes they would just give him a few minutes to think—\n“Yeah,” Malfoy sighs. “Also, anyone desperate enough to be a snatcher wouldn’t have access to an actual dungeon.”\n“Is snatching only for the lower-class, then?” Potter sneers.\n“Usually,” Malfoy answers, ignoring the vitriol in the question. “It’s an opportunity for people to try to worm their way up the Dark Lord’s ranks and into power. But anyone wealthy enough for dungeons has much easier ways of ingratiating themselves with him.”\nPotter frowns in an eerily familiar manner that communicates that he can't argue with the logic, but he's not happy about it. “Alright then. I'm out of ideas.\"\n“Never mind,” Malfoy says. “It doesn’t matter why we’re here. If you can get me out of these ropes I’ll mastermind your escape, since clearly your three Gryffindor brain cells don’t have the capacity.”\n“But we would’ve definitely seen him if he was a Gryffindor?” James protests weakly. Sirius grunts in agreement beside him.\n“Three whole brain cells? That’s practically a compliment from you.” Potter wriggles his arms. “I’m pretty sure if I just dislocate my shoulder a bit—”\n“What?!” Malfoy splutters. “Merlin, Potter, are you insane?”\n“You’ve seen me on the quidditch pitch,” Potter returns cockily. The look on Malfoy's face suggests that Potter’s behaviour on the quidditch pitch does, in fact, support the diagnosis of insanity. “Don’t worry, I’m an old pro at popping it back into the socket— just gotta—” he shifts around on the seat some more and starts straining his shoulders.\n“Dumbledore!” James hisses, pushing himself back and off the door. “Don’t you think it’s time to step in?”\n“Do you think so?” Dumbledore says mildly. “Hmm. Yes, I suppose.” He waves his wand at the door. “Stay out here for now.”\nThe moment Dumbledore walks into the room, both boys freeze. For that first half-second, Malfoy looks haunted by guilt, and Potter, filled with a combination of hope and something sadder and more intense. Then their expressions shift as one into suspicion, and then, for Potter, rage.\n“I don’t know what the fuck you’re hoping to accomplish by impersonating Dumbledore, but I can assure you, it is not doing you any favours,” Potter says coldly. \nJames is shocked by the hatred in his eyes. Also by the immediate assumption that Dumbledore is somehow impersonating himself. Equally strange is the fact that Malfoy is shiftily avoiding eye contact with both of them. James wishes he could see the headmaster’s face from this angle, but he can’t.\n“I can assure you, my boy, that I am impersonating nobody but myself.”\n“Get fucked,” Potter spits.\nSirius makes a sound that James translates as I can’t believe anyone, let alone an imprisoned teenager, had the bollocks to tell Dumbledore to get fucked, and I am both appalled and impressed by it. James makes his own noise in return that means I can’t believe I’m related to someone with the bollocks to tell Dumbledore to get fucked, and I am equally appalled and impressed by it.\nSuddenly, Potter stops glaring at the headmaster and jerks his head to the side, now glaring at a nondescript patch of stone wall. “Ah, shit,” he mutters with feeling. “Should’ve been practicing this whole time.”\n“Forgive me,” Dumbledore says affably, before James can figure out just what Potter was supposed to be practicing. “I only wished to verify that you know who I am. Perhaps a formal introduction would have sufficed. I am Albus Dumbledore, Headmaster of Hogwarts School of Witchcraft and Wizardry.”\n“And I’m the Prince of Wales,” Potter sneers at the wall.\n“May I ask for your name?” Dumbledore inquires politely.\nPotter, from what James can see from the side of his face, scoffs and rolls his eyes but says nothing; it's Malfoy who answers. “Playing that dumb is not a good look for an interrogation,” he says. Potter snorts.\n“You’ll have to pardon me for my rudeness if we’ve met before; it must have slipped my mind,” Dumbledore continues, unruffled.\nMalfoy and Potter both stare disbelievingly at Dumbledore. Potter quickly flicks his eyes away, though, back to the wall, then through a low arc to the right until he’s looking at his fellow prisoner. “What kind of mind-fuckery do they teach you lot to utilize these days?” he whispers.\n“I swear nobody has ever recommended impersonating a dead headmaster and pretending they don’t know who you are,” Malfoy mutters back.\nDumbledore’s head twitches at the mention of dead headmaster, but otherwise he remains calm. “It seems my presence has caused some distress,” he finally remarks. “I do apologize. Perhaps, as a token of my goodwill and hospitality, I can bring a healer to look you over?”\n“Perhaps, as a token of goodwill and hospitality, you can dispel these ropes?” Malfoy snarks.\nJames can practically hear the headmaster's eyes twinkling in response. “Alas, I am not quite confident enough in your loyalties to do that; however, I will ensure that you get prompt medical attention.” He sweeps back out of the room before the boys can respond. \nThe door shuts behind him and Dumbledore joins Sirius and James in their observation once more, although he does shoot a Patronus off somewhere, so maybe a healer really is coming.\n“What the fuck was that,” Potter mutters.\n“I truly have no idea,” Malfoy says.\n“The nerve!”\n“This is not the time for a tantrum!” Malfoy hisses. “We need to figure out who that was, and then hopefully where we are, and then how we’re getting out!”\n“Right, right.” Potter takes several deep breaths. “Okay, well, I can guarantee you no one in the Order would pull something like that, so, we’re looking at your people.”\n“Are you sure? It sure seems like something your lot would do if they were desperate enough?”\n“What is that supposed to mean?” Potter snaps.\n“Well, it’s not like I wasn’t attempting to kill him a year ago,” Malfoy mutters. James sucks in a sharp breath of surprise. How did he miss news of an assassination attempt—?\nPotter makes a disparaging sort of noise with his throat. “I told everyone who asked that you lowered your wand. No; if anyone’s trying torture or taunt you with Dumbledore, it’s your own people. You did fail the task Voldemort gave you.”\n“Fuck,” Malfoy says. Then, after a beat, “how do we know they’re not targeting you?”\n“I’m not the one who’s tormented by the very sight of the man!”\n“Everyone knows you had a bunch of special meetings with him last year,” Malfoy presses. A quick glance at Dumbledore and his raised eyebrows suggests that, on the contrary, not even Dumbledore knows about Potter’s alleged special meetings with him last year. Curious. “There’s all sorts of people who’d be interested in what plans you were making together.”\n“What, they think pretending to be him will make me somehow believe he’s miraculously alive and just spill everything we talked about?”\n“I didn’t say it was a particularly good plan,” Malfoy mutters defensively. “But there are plenty of followers of the Dark Lord stupid enough to try it.”\nPotter glances over with a wicked glint in his eyes and his mouth open, ready to comment—\n“NO, Potter,” Malfoy growls.\nPotter snickers. “Fine. Then who could it be?”\n“Someone either high enough to be trusted with you on the Dark Lord’s orders, or, perhaps, someone looking to rise in the ranks or, perhaps, exact some kind of personal revenge.\"\n“Great, so, anyone.”\n“Not anyone,” Malfoy insists. “Was that or was that not a very convincing imitation of Dumbledore?”\n“What, so like, someone good enough at transfiguration to pull that off? Because you can’t polyjuice into dead people?”\n“Well, I meant someone with decent enough self-control and acting skills, but yes, that too.”\n“Anyone can pretend to be a friendly old grandpa for two minutes, Malfoy,” Potter huffs.\nMalfoy rolls his eyes. “You’ve met my aunt.”\n“Mmm, yeah. Not Bellatrix, then.”\nSirius lets out a long, angry hiss through his teeth. James is struggling to follow his thought process, though. Bellatrix isn’t an aunt. Well, Andromeda has a daughter, but there’s no way Bellatrix would acknowledge Nym as her niece. And also she’s a girl and a Tonks. Except she is a metamorphmagus, so she could look like a boy Malfoy if she wanted, and she could call Bellatrix her aunt if she wanted, but why she would pretend to be a Malfoy is unclear. \nAnd the fact that Bellatrix could be an aunt to a Malfoy in the future through Narcissa is hovering somewhere in the periphery of James’ thoughts but he doesn’t know what to do with that, so maybe there are just other psycho aunts named Bellatrix out there in Voldemort’s forces, who knows?\n“Not any of the Lestranges, really. Not Dolohov, not Macnair, definitely not the Dark Lord himself—”\nPotter shudders. “He would never.”\nMalfoy looks askance at him for that but shrugs and continues. “So someone who’s a good enough actor and good enough at transfiguration, but stupid enough to think this ploy would work.”\n“Pettigrew,” Potter says with a scary sort of intensity. James’ heart stops for what feels like several beats. He can’t mean— “Wait, no, never mind. Whoever that was, he’s also a legilimens, so add that to your list.”\nJames lets out a shuddery breath and exchanges an equally bewildered look with Sirius. They’ll have to hash that out later.\n”He’s a legilimens?!” Malfoy screeches. “Merlin’s saggy Y-fronts, Potter, why didn’t you say something earlier?!”\n“I’m saying it now, aren’t I?” Potter snarls.\n“Well, fuck. Was he good at it? Are you any good at occlumency?”\n“He was very good at it and I’m utter pants, thanks for asking, so really—”\n“We’re fucked.”\n“Well, yeah, except I don’t think he tried it after that first time, so.”\n“What was he looking for?”\n“Meeting Dumbledore.”\n“Yeah, you’re fucked,” Malfoy repeats with a hint of schadenfreude.\n”The point is,” Potter continues around gritted teeth. “Who do you know that’s good at transfiguration—”\n“Or glamours.”\n“—Fine, or glamours, and also good at acting and legilimency, but comes up with absolutely bonkers plans that nobody would ever fall for?”\nThey’re both quiet for several moments.\n“I’d say Snape, but…” Potter starts. \nJames whips his head around to share a wide-eyed look with Sirius. “Snape!” They whisper-shout in tandem.\n“He’d never attempt something so idiotic,” Malfoy says superciliously.\n“Not even just to fuck with me?” Potter pushes. “He’s finally got me prisoner and now he’s got a chance to taunt me with dead people I used to rely on? Don’t tell me he wouldn’t.”\n“He definitely knows at least a dozen potions that could produce a similar effect without having to dress up as the man he notoriously murdered,” Malfoy decides after a minute of thought.\nJames’ blood runs cold. Yeah, Snape’s a right git, and yeah, he’s dangerous with some of the spells he uses, but even the thought of him killing Dumbledore is inconceivable. He shudders.\nExcept, oh yeah, obviously he didn’t kill Dumbledore, because Dumbledore is right here and very much alive, so obviously the prisoners are just off their rockers. Right. Okay.\n“Probably,” Potter sighs. “Well, how do I know we’re not in some kind of potions-induced hallucination anyway? Or that you’re even real?”\n“I’m real, I can assure you.”\n“Yeah but that’s what a hallucination of you would say, too.”\n“Sweet Salazar, Potter, we don’t have time for your drivel. If you’re suffering potions-induced hallucinations, there’s no hope for you but outside rescue, so for the moment, you might as well play along.”\n“Says you.”\n“Are you suggesting you know more about potions and torture methods than I do?”\nPotter lapses back into disgruntled silence.\n“It seems like they really think you’re dead,” Sirius observes.\n“Indeed,” Dumbledore says pensively. “Curiously, the Potter boy does indeed remember meeting me at Hogwarts, although I can’t say I recall the same of him.”\n“I would’ve remembered if he was a student at Hogwarts,” James insists.\n“Same,” says Sirius. “He looks too much like James.”\n“Indeed,” Dumbledore repeats.\n“I’ve got no one,” Malfoy eventually decides.\n“Yeah, me neither,” Potter says glumly.\n“Must be some kind of thestral,” Malfoy muses.\n“What?”\n“Some kind of thestral?” Malfoy repeats. Potter just looks at him blankly. “You know, invisible but powerful, comes out of nowhere when you’re least expecting them, you never see them until it’s too late?”\nPotter’s face flickers with realization and understanding, and then something akin to humour. “A dark horse,” he mutters, mostly to himself.\nThat comment seems to utterly befuddle Malfoy, who declines to respond.\n“Why wouldn’t they transfigure the hand?” Potter eventually asks into the quiet.\n”That’s what you’re concerned about?” Malfoy says scathingly.\nPotter just shrugs. “Could be important. Who knows.”\nJames looks at his companions to see that they are equally mystified about the hand comment. They are distracted, though, by a short muffled conversation upstairs, and then Dorcas descends into the tiny hall of the dungeons. Funnily enough, she looks like she’s just come from a pub night too; she’s wearing stylish clothes and her curly black hair is wrapped up in a colorful scarf. The expression on her face is all business, though.\nDumbledore turns from the cell door to greet her. “We captured two young men earlier this evening who were involved in a mysterious and highly magical event. They’re both conscious now and deeply paranoid, and possibly suffering from some kind of shared delusion that involves my death,” he explains, sounding impressively unaffected by the topic. “The young man on the right claims to have hit his head and is sensitive to loud noise; the one on the left may or may not have dislocated his shoulder attempting to free himself.”\nDorcas nods stoically. “Do you believe them to be dangerous?” She glances at Sirius and James. “Am I going in with backup?”\n“Caution is always wise but I have yet to see them attempt violence. I believe it best, at the moment, not to overwhelm them with new faces,” Dumbledore says.\nThe three of them step back as Dorcas goes in with her medical kit. Both boys’ eyes narrow in suspicion at her but Potters’ flicker with uneasy recognition, as if he can’t quite place her.\n“Hi, my name is Dorcas, and I’m a healer,” Dorcas starts. Potter sucks in a sharp breath but clenches his jaw shut and shakes his head when Malfoy looks questioningly at him. Dorcas hesitates a beat, but continues. “Headmaster Dumbledore called me in to look you over. I promise I’ve taken my Healer Oaths and I mean you no harm. I’m just here to check you for serious injuries and treat them, that’s all.”\nShe points her wand at Malfoy and he tenses, his face contorting into terror tempered only by resignation. It strikes James as the expression of someone who’s been tortured before and is about to be tortured again. He swallows loudly.\nDorcas isn’t torturing him, though, obviously; she hums to herself as her charms flicker back different colors in different parts of his body. “You have a concussion, Mr….?” She starts. Malfoy shakes his head timidly. Dorcas shrugs and turns to rummage around in her kit. “Well. You’re lucky I have the right potions for that on hand; here, start with this, it’s to re-establish the correct levels of chemicals in your brain. This second one will heal any stretching or damage to your brain cells.”\nShe holds the vial up to Malfoy’s lips, which he’s pursing as hard as he can. “I promise it’s just a medical potion,” she says. It changes nothing. Dorcas sighs. “If you were an ordinary patient you’d be allowed to refuse treatment, but at the moment you’re a captive by an active war force so I’m required to ensure your good health or else we all get pulled in front of the ICW when this is all over. So. You can either drink this yourself or I spell it into your stomach, which, I have to warn you, isn’t exactly a pleasant experience for conscious patients.”\nMalfoy’s mouth remains firmly shut. Dorcas taps the vials, one-two, with her wand and Malfoy lets out a choking sound and grimaces. \nDorcas turns to Potter and holds up her wand. He tenses all over for one small millisecond and then starts writhing frantically within the bonds on his chair. He actually manages to pull one arm out of both its socket and the ropes before Dorcas body-binds him. He glares at her with the rest of his body frozen solid.\n“Sorry,” Dorcas says, not sounding sorry at all. “I promise I’m not going to curse you.” She proceeds with the same spells as before, although one lights up orange all over his body and another bursts deep black and red from his forehead. James still can’t see her face, but he could swear the tendons in Dorcas’ neck seem to stand out farther with each spell. Finally, she drops her wand and sighs. “You’re a bit of a mess, huh,” she says kindly. Potter only glares harder at her. “All I’m going to do is reset your shoulder for the moment, but if you’re captive long-term we’re going to have to treat your malnutrition and get that forehead scar looked at.”\nThis, for some reason, sends Malfoy into hysterical giggles. “Get that forehead scar looked at,” he repeats between gasps for air. “Get that forehead scar looked at!”\nDorcas frowns but otherwise ignores him and goes about restoring Potter to rights and re-binding him to the chair. She twirls her wand sharply at the end of the incarcerous and assures him sternly that even dislocating joints won’t get him out of this one, so please don’t try. She then cuts his sleeve away to rub bruise paste along the shoulder, which she explains will reduce the inflammation around the joint. There seems to be a bit of paste left over on her hand when she’s done, which she dabs onto his purpling cheek for good measure. Potter can’t exactly fight it but he does go cross-eyed trying to keep track of the hand approaching his face. Then she repairs his clothing and finites the body-bind; Potter spits invectives at Dorcas until the door slams shut behind her.\n“May I ask what else you discovered about Mr. Potter?” Dumbledore inquires.\nDorcas frowns and looks at James. “Huh,” she says. “He does look like you.”\nJames can only shrug helplessly in reply.\n“Well, he’s got some serious malnutrition going on, and some unusual osteo history. There’s a cut on his forehead that’s both fresh and over a decade old, and both malevolent and protective. So I have no idea what’s going on there— you’d need to call in a specialist— but as far as I can tell it’s not actively progressing and he doesn’t appear to be in any pain from it, so.” She shrugs. “I’m not quite sure what to tell you to do about it.”\nDumbledore strokes his beard pensively. “And they’re not under the influence of behaviour- or perception- altering potions?”\n“No.”\n“Naturally-occurring mental disorders?”\n“None of the most common, at least.”\n “And you didn’t discover any traces of appearance-obscuring magic on either of them, did you?”\n“No,” says Dorcas. “Nor any tracking spells or latent transportation magic, although I assume you already checked for that, too.”\n“Indeed,” Dumbledore affirms. “Well, thank you for your help tonight. Hopefully we will have no further need of healing in the foreseeable future.”\nDorcas nods and walks back out. James returns his attention to the cell. Surprise, surprise: they’re arguing again.\n“—The hell that orange spell was, but if it did something to my entire body it’s probably hard to get rid of,” Potter is saying, sounding on the verge of panic.\n“That was the same medi spell she did on me, you moron. Only there’s something wrong with your entire body, and she said you're malnourished, and frankly it’s already obvious to anyone with eyes that you’re practically starving.”\n“You try living in a fucking tent for a year and see how well you eat, Malfoy!” Potter snarls. “We haven’t all been feasting on the hard work of your house elves this whole time!”\n“Well that’s on you, isn’t it? What’s the point of stealing an elf from my father if you can’t even get it to cook for you?” Malfoy sneers back.\n“DON’T YOU DARE TALK ABOUT DOBBY!” Potter screams. “DOBBY WAS A FREE ELF! HE WAS MY FRIEND AND HE WAS HAPPY AND NOW HE’S DEAD! AND HE DIED RESCUING US FROM YOUR FUCKING MANOR, WHERE YOUR BLOODY AWFUL FAMILY ABUSED HIM FOR YEARS, SO YOU JUST SHUT UP ABOUT DOBBY!”\n“Good Godric,” Sirius murmurs.\n“Salazar's sake,” Malfoy says as well. He looks like he wants to rear back from the tirade but, of course, he isn’t physically able to move like that. Instead, he closes his eyes as if praying desperately for patience. Meanwhile, Potter now looks on the verge of tears, instead of the verge of panic. It’s not exactly an aesthetic improvement.\n“Do the Malfoys have a house-elf named Dobby?” James asks Sirius. It would be nice to know whether literally anything these boys are saying has some basis in reality.\n“Fuck if I know,” Sirius mutters back. “You know I hate all stuffy pureblood elves on principle.”\nJames sighs. It was worth a try.\n“Just,” Potter finally mutters. “Just don’t talk about Dobby. Okay? We still have to figure out how to get out of here anyway.”\n“Yeah, alright,” Malfoy agrees warily. “Did you know that mediwitch?”\n“I know who she’s pretending to be,” Potter says grimly. “Dorcas Meadowes. Died in the first war. Moody said Voldemort himself did her in.”\nJames attempts to process this last tidbit of information and finally reaches the maximum amount of confusion his brain is able to contain at one time. He throws out his hands to each side. “What the fuck is going on?” he whisper-shouts at Dumbledore.\nDumbledore is now stroking his beard and studying the captives thoughtfully. He doesn’t look ready to speak, though, so James turns plaintively to Sirius instead.\nSirius is staring intensely at the two boys, but also glancing between James and Potter with something that looks like mischief. “Y’know,” he says, conversationally. “That Potter bloke really does look a lot like you.”\n“I’ve noticed,” James says dryly.\n“Except for the eyes,” Sirius continues. “Neither you nor your parents nor your Uncle Charlus, for that matter, have green eyes.”\n“Yeah? Potters have the hair and the eyesight but nothing about eye color usually stands out in the family line.”\n“Nope. Not for Potters, anyway. But pretty green eyes like those? You’ve seen them before.”\nJames frowns at Sirius, then frowns at Potter, who’s once again wriggling at his bonds and having a fruitless row with Malfoy. Whenever he glances at the door, James peers at those eyes and remembers that nebulous sense of familiarity. It’s still niggling at the back of his mind, but not getting any clearer.\n“Oh for fuck’s sake,” Sirius huffs. “You spent the majority of your free time years 4-6 trying to list out romantic-sounding comparisons for Evans’ eyes and now you can’t bloody well remember what they look like?”\nJames sucks in too much air all at once and has to cough some of it out. Now that Sirius has pointed it out, though, the revelation is all he can think about. There’s a Potter boy before him with eyes the exact shade of green as Lily Evans’. In fact, they’re even the same almond shape. “D’you reckon that’s what our kids might look like?” he muses.\nHe doesn’t realize he’s said that out loud until Sirius slaps him across the head. “You’re being dense, Prongs. That’s a Potter kid with Evans eyes and a Malfoy kid with an Aunt Bellatrix. They both obviously went to Hogwarts, but none of us, not even Dumbledore, has ever seen them before. They claim to know how and when a lot of people we know will die. Put the pieces together, mate.”\nIt takes an embarrassingly long few minutes for James to accept the premise that Sirius is suggesting. “There’s no way,” he breathes. “That’s really my kid? And Narcissa’s? From the future? Impossible.”\n“Dumbledore?” Sirius prompts.\n“Implausible, but I do so hate to assume that anything is impossible,” Dumbledore offers. “I daresay that much more of what they’ve said makes sense in that context.”\n“No way,” James repeats dumbly.\n“Let me talk to them,” Sirius suggests in the headmaster's direction. “I know the most about both their families and I’m good at winging it. Maybe I can get more information out of them.”\n“I dunno,” James says. “We don’t really know much else about them, do we? Just that they think Dumbledore is dead.”\n“We know Potter’s still involved with, and apparently important to, the Order. And if he’s your kid then I’m definitely his favourite uncle, so he might trust me. And Malfoy’s family is all Death Eaters and he obviously wants to get out, which he probably knows I did better than anyone, so maybe he’ll trust me too.”\nA strange surge of possessiveness sweeps away all of James’ lingering doubts. “If anyone’s going in interrogating someone who might be my kid, it should be me!”\n“Perhaps,” Dumbledore cuts in, still sounding pensive, “you might like to speak with them together.”\nJames and Sirius look at each other, shrug in tandem, and head in.\nPotter’s reaction is instantaneous. As soon as Sirius sidles through the door, James behind his shoulder, Potter’s face contorts into the kind of rage Sirius used to channel when he fought with Regulus in the halls. The kind of rage that’s true anger, yes, but also deep hurt. \nIt’s extremely not reassuring.\n“YOU BASTARDS!” Potter roars. “HOW DARE YOU! IF THIS HAS ANYTHING TO DO WITH BELLATRIX I SWEAR I’LL TEAR HER GUTS OUT WITH MY BARE HANDS! THAT’S A PROMISE!”\n“Whoa there,” James says, raising his hands gently. “We come in peace.”\nPotter does not look at all pacified. He is glaring pure murder at Sirius and can’t seem to look at James at all. James tries not to take it personally.\n“IF THIS IS SOME KIND OF SICK TORTURE FOR YOU PEOPLE—” Potter starts again. He’s cut off by a swish of Sirius’ wand; it’s admittedly a nice relief from the yelling but James doubts it will do anything to gain Potter’s goodwill. He’s still ranting and raving under the silencing charm. Malfoy, for the most part, looks deeply unnerved but is studying both of them intently.\n“Look, we think there’s been some misunderstanding,” James explains diplomatically.\n“And perhaps some magical mischief involved,” Sirius adds.\n“I’m James Potter,” James says, to be polite, and also because he has no guarantee this Malfoy kid will know who he is.\n“And I’m Sirius Black.”\nPotter thrashes so hard his chair screeches back several inches. It’s not promising.\n“And today is May 2, 1979,” James finishes.\nBoth boys stare at them incredulously for a long, still moment. Then Potter resumes his thrashing.\n“You’re barking,” Malfoy finally decides.\nIn response, Sirius casts a verbal ascribo diem. Bright gold letters pop into existence declaring the date May 2, 1979. Sirius twirls his wand to rotate the result, so that the boys can read it properly. \nMalfoy keeps shaking his head as if in a daze. Potter looks utterly unconvinced but at least he’s stopped trying to break his chair.\nSirius is unfazed. He conjures a chair of his own and straddles it backwards to peer intently at Malfoy. “What are the odds you’re Narcissa’s kid?” he asks.\nMalfoy just tilts up his chin. “What’s it to you?”\n“We’re cousins then,” Sirius replies. “First cousins once removed, that would make us. Can’t say I approve of your father but I got along with Narcissa alright when we were young. If you don’t want to be involved with their ilk, I’m happy to give you tips on how to get yourself disowned from a Dark pureblood family.”\nThe Malfoy boy does not appear at all impressed. “This is definitely a trap,” he mutters.\n“Listen,” James butts in. “I swear we’re not Death Eaters. Look: neither of us are Marked, yeah?” He rolls up his sleeves and waits for Sirius to do the same.\n“So you’re snatchers,” Malfoy says in a bored drawl.\n“What the bloody fuck are snatchers?”\nMalfoy doesn’t answer. When he makes no further move to say anything, James breaks the strange silence. “We mean you no harm if you mean us no harm.”\n“We mean you no harm, he says, to the wizards trussed up like turkeys in some dungeon cell,” Malfoy sneers.\nJames just so happens to glance at Potter then, and he could swear he sees the boy mouth something about a peacock. James smirks appreciatively at him, which immediately wipes away any traces of mirth on Potter’s face. Damn.\n“Only until we can establish you’re not a threat,” James soothes. “We’re part of an underground group of witches and wizards fighting against Voldemort’s forces. It sounds like you’re not exactly opposed to our goals, so, I say we can help each other out. When are you from? Or, er, what year was it, when you last checked?”\nInstead of responding, Malfoy just mouths James’ last words silently back at him, looking distinctly dumbfounded.\n“Look,” Sirius sighs. “You two were involved in… something… hugely magical earlier tonight and we just want to know who you are and whether it might be dangerous. We don’t yet know what exactly the phenomenon was. I was hoping maybe you could enlighten us.”\n“So sorry, no idea, can’t help you,” Malfoy says sarcastically. “If that’s all, you might as well let us go.”\nJames eyes Potter, hoping he might be more reasonable, but the boy’s still glaring daggers at him and Sirius. James runs his hand through messy hair and Potter only seems to glare harder at the affectation. \n“Just, it seems like you two can’t have been born yet, and a displacement of two wizards through that much time would certainly answer our questions about the minor magical explosion you caused, and I think at this point we’re willing to be convinced that’s your story, if you’re willing to be convinced as well.”\n“This is the barmiest interrogation I have ever been witness to,” Malfoy mutters.\n“I don’t know how else to prove to you we are who we say we are and, well, the date’s what we say it is.”\n“Take us to Diagon Alley,” Malfoy says imperiously. “Let us see the latest Daily Prophet for ourselves. Well,” he adds after a beat. “Maybe not Potter, because he has a price on his head. But I’m willing to take the risk for both of us.”\nPotter snarls silently but furiously at Malfoy for that suggestion.\n“Okay, obviously we can’t do that. But I think…” James looks back at Potter wistfully. “I think we could find some common ground, if you let us try.”\nMalfoy only looks more bewildered at that. He turns to look at Potter, who has his lips tucked demonstratively inwards and is shaking his head firmly with a fierce glare.\nSirius sighs impatiently. It’s clear they’re not making much headway by talking at them. “Just think it over, yeah? Talk it over, even,” he flicks his wand at the Potter boy, who’s breathing heavily enough to be heard now. “Let us know if you think we can be of mutual assistance to each other.” \nHe swans with attitude back out of the room. James follows him out after one last rueful glance towards the teenager that might be his son.\nThe door closes and they find Dumbledore has conjured a curved sofa for their viewing comfort. It’s plushy and purple, but that’s not why James is eyeing it wearily. It might as well be embroidered with rainbow letters spelling out it’s going to be a long night. James reluctantly takes a seat.\nA minute or so into their vigil, Potter speaks again. “Don’t tell them anything. Not even the year.”\nMalfoy scoffs. “What possible nefarious purposes could they have in mind for which they need you to tell them the blasted year, Potter?”\n“A ransom video? I dunno.”\n“A what?”\n“Oh, honestly,” Potter groans. “You’re such a pureblood twat sometimes.”\nMalfoy smirks. “Only sometimes?”\n“You’re a horrible git the rest.”\n“Well, here I was about to give you some much-needed advice, but I guess if I’m such a horrible git, maybe I’ll just keep it to myself.”\n“Advice? If it’s not about getting us the hell out of here, which it’s in your best interests to divulge anyway, then I don’t give a rat’s arse.”\n“It’s about surviving an interrogation, actually, but fine.”\nPotter glowers at Malfoy, who looks resolutely forward with his nose up in the air. It’s not a great angle for him from James’ point of view, but it seems to annoy Potter, at least.\n“Nothing you can say will suddenly make me a master occlumens, so honestly, it doesn’t matter,” Potter finally decides. He starts jerking at his bonds again. “Our only options are to find a way out of here or last until Ron and Hermione come for me.”\n“How in Merlin’s name are they going to find you in some dumpy dungeon with a bunch of crazies who like to pretend they don’t even know who you are?”\n“They’ll find me,” Potter says with iron faith in his voice. “They’ll come.”\nThey sit in silence for several more minutes, during which Potter keeps tugging determinedly at his ropes and Malfoy half-heartedly attempts the same for a bit, then gives up.\n“Potter,” he starts. “Have you considered that maybe they’re not lying?”\n“Who’s not lying?” Potter asks distractedly, glaring at his lap as he kicks his feet.\n“The— people. Dumbledore, James Potter, Sirius Black.”\nPotter stills and gapes at his companion. “Have you gone barmy?” \n“I just—! Nothing else comes to mind that makes nearly as much sense!”\n“But travelling some, oh, twenty years into the past does?”\n“Considering all the impossible things that happen to you several times a year, Potter? Yeah, actually. Honestly, I’d think you’re due for a mishap in history by now.”\nThere ensues a very expectant silence during which Potter looks interestedly around the very uninteresting dungeon. Stone, a bit of moss, a few cobwebs, some insect carcasses in the corners. Fascinating.\nMalfoy’s jaw drops. “Are you telling me you’ve already had a mishap in history?!”\n“I’m definitely not telling you that.” A beat. “And I wouldn’t exactly call it history seeing as we only went back three hours.”\n”How?!” Malfoy howls. “When? Why? Who’s we?”\n“Erm,” says Potter. “Third year? With Hermione? She had a time-turner. Which, by the way, all have limits in hours for how far back you can go; it’s impossible to travel twenty bloody years—”\n“Who could possibly have given Granger a time-turner?!”\nPotter smirks. “The Ministry and Hogwarts, to let her take more classes, because she’s brilliant. Of course, she brought me along to rescue Sirius, but,” he turns a vicious smile on the other boy, “we also stole a hippogriff.”\nIt takes approximately three seconds for Malfoy, at least, to understand this reference to a hippogriff, even though James feels quite lost and is honestly much more interested in why Sirius needed rescuing. But apparently that is not of highest importance to Malfoy, who breaks into an ugly flush.\n”You let that beast get away?” he splutters. Potter laughs. “You—! Snape was right about you! Just going around breaking laws and stealing off with dangerous creatures wanted by the Ministry and everyone just lets you get away with it because it’s precious Potter—”\n“You’re one to talk about getting away with bullshit, the way your father ran around that year persecuting Hagrid for nothing but your sick pleasure!”\n“My sick pleasure!” Malfoy repeats, shrilly and indignantly. “He brought a murderous ravening beast to a lesson for a bunch of thirteen year-olds! He deserved to be sacked!”\n“Buckbeak wasn’t a murderous ravening beast! You insulted him when Hagrid explicitly told you not to and he barely gave you a scratch!”\n“It nearly tore off my arm! That thing deserved to be executed!”\n“You were healed up in ten minutes,” Potter scoffs. “Bloody Lockhart’s done worse to me and you know it.\"\n\"Just because we don't all go around getting all the bones in our arms vanished—\"\n\"Bet it wasn’t even about your injury, anyway,” he continues loudly. “You just couldn’t bear the humiliation of having screamed like a little girl when something finally knocked you down a peg.”\n“I swear to Salazar, Potter, as soon as I’m out of these ropes I’ll tear your eyeballs out with my fingernails,” Malfoy growls.\nPotter only laughs again. “Struck a nerve, have I?”\n“Fuck’s sake, go back to talking about Sirius,” James mutters under his breath.\nThey don’t. Another silent glare-off ensues and it lasts, impressively, several minutes, until Potter finally looks back at his ropes. He’s not struggling anymore, but staring down at his chest with a strange look on his face. \n“Is he trying to do wandless magic?” Sirius guesses.\n“Just looks a bit constipated to me,” James observes.\nSirius snorts. “That’s how you look when you’re concentrating, Prongs.”\n“Is not!”\n“Is too. Exactly the same. Uncanny, really.”\nJames smacks him upside the head. Sirius only sniggers.\n“New plan,” Potter announces. “Scoot your chair over here and untie me.”\n”You come over here and untie me!”\nPotter rolls his eyes. “You literally just said that as soon as you’re untied you’ll rake my eyes out, or something equally vicious that you’re definitely too squeamish to actually follow through on—”\n“If I’m too squeamish to do it, then there’s no reason I can’t be untied first, then, is there?” Malfoy retorts.\n“Fucking— fine,” Potter huffs. “I’ll untie you, because you’re probably shit at it anyway. Then you untie me, because you know you’ll never make it out of here alone, even if you won’t admit it, and then when we’re good and shot of these fucking dungeons I’ll let you take your best swing at me over Buckbeak, which I’m not at all worried about because neither of us has a wand, pureblood ponces like you have shit form for muggle brawling, and I’m very good at dodging punches.”\n“Salazar’s sake, Potter, that’s how you bargain? You wouldn’t last a day in Slytherin,” Malfoy drawls, but he doesn’t sound exactly opposed to the idea.\nPotter laughs, already kicking his legs and twisting awkwardly. The chair moves about an inch to the right. “Tell that to the Sorting Hat.”\nMalfoy’s brow furrows, and then he gapes horribly. ”You? In Slytherin?”\nPotter laughs again. The chair screeches another two inches over. “I asked it not to though, so it put me in Gryffindor.”\n“Why in Salazar’s castle would you possibly pick Gryffindor over Slytherin?”\n“Well, a certain poncy blond git had just gotten sorted there, hadn’t he? And I couldn’t bear the thought of dealing with your presence all the time. Not after you were so rude to Ron.”\nMalfoy flushes even more unattractively than he had over whatever that hippogriff bit was. “You rejected all of Slytherin House because I was mean to a Weasley on the train?”\nPotter manages several inches on his next scoot. “I don’t like bullies,” he says bitterly.\n“Fuck me,” Malfoy moans. “If it ever gets out I single-handedly pushed the most famous wizard of our age away from Slytherin House, my reputation will never recover.”\nPotter snickers. “I mean, Voldemort sure didn’t help any. But yeah.” He finally manages to close the distance between them and grunts some more as he twists his chair around to get ahold of the ropes around Malfoy.\nJames shoots a worried glance at Dumbledore, who waves an unconcerned hand. “Those ropes cannot be untied nor loosened without magic,” the headmaster says.\nSirius hums in acknowledgement. James turns his eyes back to his probably-son, who fumbles with the ropes fruitlessly for several minutes before Malfoy speaks again.\n“Listen. About the time travel theory.”\n“Not this again!”\n“Oh, could you stop being such a paranoid bastard for one second and hear me out?”\n”Paranoid bastard?” Potter shrieks. “Paranoid bastard? You spend ten months as bloody Undesirable Number One and then talk to me about paranoia! You survive the number of murder attempts I have, and then talk to me about paranoia! Hell, the number of murder attempts by my own professors—!”\n“Alright, alright!” Malfoy interrupts. James realizes he is probably cutting off the circulation in Sirius’ arm, he’s gripping it so hard. Sirius, good mate that he is, hasn’t even complained. “I take it back about the paranoia. You’ve earned it.”\n“Damn well I’ve earned it,” Potter grumbles.\n\"Yes, fine, but that doesn’t mean you’re not paranoid! Honestly, if you keep this up, you’ll end up worse than Mad-Eye Moody.”\n“Mad-Eye kept a lot of people alive,” Potter says fiercely. “But go on, keep insulting my dead and see if I help you out of these ropes.”\n“Bloody hell,” James mumbles. “Is there anyone left who isn’t dead?”\nMalfoy only scoffs with offense. “You have to admit he was insane! He turned a fourteen year old student into a—!”\nJames can’t figure out why Malfoy has suddenly stopped talking. That is, until an enormous, devious smile spreads across Potter’s face. “Say it, Malfoy,” he taunts.\n“You know what he did,” Malfoy mutters.\n“Say it!”\n“Fuck off!”\n“Ferret!” Potter supplies gleefully, and then breaks into gales of full-blown laughter.\n“Fuck you, Potter, I’ll turn you into a ferret!” Malfoy growls, flushing fiercely.\n“Oh, man, I can’t believe you brought that up yourself,” Potter gloats. Malfoy descends into increasingly violent curses and threats. “Talk about the other best day of my life. I’d be wiping tears off my face right now if I wasn’t bloody tied up.”\n“I’ll wipe all the skin off your face if you don’t shut up right now!”\nPotter chortles one last time. “Oh Merlin. What a great memory for these dark times. Anyway, if you’ll recall, the real Moody never turned you into a ferret at all; it was Barty Crouch.”\nThe shock seems to pull Malfoy abruptly out of his sulk. “The Head of International Magical Cooperation?”\nUnsurprisingly, Malfoy only gets angrier when Potter blinks and then guffaws some more. \n“You know, for someone whose personal catchphrase as a kid was ‘my father will hear about this,’ you sure didn’t hear much from him in return. You are drastically underinformed.”\n“Less gloating, more untying, Potter,” Malfoy demands.\n“Alright then,” Potter says happily. “Feel free to just sit there and wonder how the most straight-laced official in the entire Ministry went so wrong.”\nMalfoy lasts an impressive three minutes of Potter silently picking at his ropes before his outburst. “Fine!” he yells. “Since you’re obviously always right in the sodding middle of everything that can possibly go wrong, bloody, explain it to me then.”\nPotter smirks. “Explain what?”\n“Explain what Crouch was doing impersonating a Hogwarts professor!”\nPotter tsks condescendingly. “That’s not how the story came up though, is it?”\n“I swear to Salazar, Potter, I will murder you—”\n“Alright, alright, no need to get all worked up. I’ll explain the Ferret Incident in all its gory detail.”\n“You pompous, condescending, infuriating nitwit!”\n“Damn, Malfoy, tell me how you really feel.”\n“POTTER!”\n“Alright, alright,\" Potter says. For someone tied to a chair in a dungeon (and not the fun kind), he sure appears to be enjoying himself. \"The thing is, Moody that entire year wasn’t Moody at all, but Barty Crouch. Junior.”\nMalfoy scoffs. “He died in Azkaban.”\n“Did he?”\n“Fuck you, Potter, just explain.”\nAfter one last victorious, condescending grin in Malfoy’s direction, Potter finally starts to talk in earnest. He proceeds to tell a story of a mother’s love, a prison break, an unforgiveable, a missing ministry official, a scapegoated house-elf at a World Cup, an attack on an ex-auror, a kidnapping plot, a Triwizard Tournament, a necromancy ritual, and an extrajudicial execution via dementor. \nIt sounds like the kind of story Sirius used to weave to distract hapless new Defense teachers from half a day’s worth of lessons. Frankly, it’s unbelievable, except that Potter’s face is grim and deadly serious throughout the entire retelling.\n“You realize literally all of your stories sound like a four year-old made them up,\" Malfoy drawls. James smirks to himself at the unwitting comparison of Sirius to a four year-old.\n“Blame your Lord, not me.”\n“Circe's tits,” Sirius breathes. “Can we go back to the theory that they’re both just stark raving mad?”\nMalfoy humphs. “What I don’t understand is how you can have lived through, what, seven full years of such ridiculously contrived plots to kill you and yet you refuse to consider the possibility of time travel.”\n“Oh, for fuck’s sake, Malfoy!”\n“Just!” Malfoy insists. “Rationally speaking, what possible advantage would they get out of pretending not to know the Boy Who Lived?”\n“Boy Who Lived?” James whispers. He can practically hear the capitalizations in Malfoy’s voice and it sends ominous goosebumps across his arms.\n“They’re trying to trip us up.” Potter says this as if it should be obvious.\n“They’d do a much better job of tripping us up if they pretended to be those people and also knew who we are,” Malfoy argues. “You’re trying to tell me you’d be less vulnerable to emotional manipulation if all your dead father figures came in and told you they love you and miss you and wanted to hear what you’ve been up to since they died?”\n“You shut the fuck up Malfoy!” Potter snarls, practically in his ear. Malfoy snaps his mouth shut with an audible click.\n“Prongs?” Sirius sounds uncharacteristically timid in the resulting silence.\nJames only shakes his head; it’s all he can acknowledge right now.\n“You realize there’s an easy way to prove their identity?” Malfoy prompts, voice extremely even.\n“By all means, enlighten me,” Potter says sourly.\n“Just ask them questions only they would know the answer to, like we did.”\nExcept for the occasional frustrated curse, Potter is quiet for a few minutes, picking at Malfoy's ropes. “I can’t,” he finally admits. He sounds small and vulnerable in those two words, and James instinctually hates it.\n“What do you mean you can’t?”\n“There’s not a single thing that I know about either of them from the first war that any old Death Eater couldn’t find out.”\n“How is that possible?” Malfoy huffs. “He’s your father!”\n“Am I or am I not famously an orphan?” Potter snarls.\nJames chokes. Sirius suddenly has his wrist in a bone-crushing grip.\n“He’s still your father! And your— whatever Sirius Black was to you; Mother never wanted to get into it,” Malfoy ends on a mutter.\n“My godfather,” Potter whispers. His eyes are unfocused and he sounds ineffably sad. Something sinks inside James’ chest.\nSirius leaps to his feet. “I’m going back in,” he declares. James grabs his arm and pulls him back down onto the couch.\n“Doesn’t mean I know anything about him,” Potter continues.\n“You knew Black, though, right?”\nPotter sighs bitterly. “For two years. And, I repeat, anything he could have told me about my dad, Wormtail could have told the Death Eaters.”\nJames chokes again. All the air in the small dungeon hallway seems to have vanished. Sirius stands abruptly before James can make another grab for his arm and opens the door.\nDamn. Sirius gets like this, sometimes, when he’s worried or upset; he just barges into whatever mad plan he thinks will make things better and usually leaves a trail of chaos and detentions in his wake.\nStill, James would never let him do any of it alone. He slips into the cell after him.\n“So we’re both dead where you’re— erm, when you’re from, then?” Sirius opens, with absolutely no tact.\nOn the bright side, Potter seems at least a little bit curious about the time-travel thing, maybe, because he doesn’t immediately start yelling at them again. Or more likely, judging by the look on his face, he’s very aware of the incriminating position he’s been found in, hands mere centimetres from Malfoy’s ropes. Fortunately for him, Sirius is much too worried about other issues to call him out on that.\n“Yes,” says Malfoy.\n“Malfoy!” Potter hisses.\n“What? If we’re really in our time, everyone already bloody knows that anyway.”\n“They’re just trying to get you comfortable with answering their questions.”\n“Maybe they’ll let us be more comfortable if we do!”\n“Ahem,” Sirius says loudly. “I think we’d very much like to know how we died.”\nJames puts a warning hand on his shoulder. He doesn’t expect it to really help.\nMalfoy studies Sirius suspiciously, then cranes his neck around to an angle that can’t possibly be painless to whisper something in Potter’s ear. Potter twitches and looks at him with incredulous eyebrows raised, and Malfoy whispers something else at him. Potter fights him on it, brows furrowing, but Malfoy keeps hissing insistently back, and then Potter appears to give in.\nAfter a long, contemplative pause, Potter looks back at James and Sirius. It’s suddenly extremely unnerving to be the sole object of his attention. James does not like looking at eyes so similar to Lily’s holding such hurt and suspicion. \nFinally, he speaks. “Peter Pettigrew is a Death Eater.”\n“Fuck,” says Sirius.\n“No,” James protests, though it comes out more as a whimper. “No,” he repeats, but he still can’t make it sound like he means it, because hasn’t Potter dropped enough hints already? But that doesn’t means it’s true, doesn’t mean James has to believe it—\nBut Potter continues to speak, slowly and clearly and surely, his calculating eyes assessing Sirius and James in turns. “When my parents, Lily and James Potter, went into hiding, Pettigrew turned their location over to Voldemort. I was still a baby when he came to the house and personally murdered my parents.” His voice turns hard. “He killed my dad first. His last words were ‘Take Harry and run. Go. I’ll hold him off.'”\nIt takes a moment to register over the thrumming of his gaping dread, but James realizes he finally has a name for this Potter boy. “Harry,” he breathes. It’s just a tiny little nugget of warmth amidst the cruelty spilling from his child’s mouth, but he grabs ahold of it tightly. “My grandpa Henry used to go by Harry as a kid.”\nA flicker of something like doubt wavers behind Harry’s eyes, but he blinks it away and continues. “Voldemort found my mum in the nursery, in front of my crib. She pled for my life; he told her to step aside and she refused. He killed her, and then tried to kill me. For years I thought I was too young when they died to remember anything from that night but a flash of green light. Then I got too close to a dementor, and I heard my parents’ last words.”\nMalfoy lets out a little guilty-sounding “oh,” but he’s ignored. Harry’s gaze lingers on James, who already feels like he’s drowning under the horror of this story, unable to breathe. Sirius, though, manages to suck in a shaky breath, and it seems to finally turn Harry’s attention to him.\n“Sirius Black found me alive in the blown-up nursery, but he abandoned me to go chase after Pettigrew. He was the only one left, you see, who knew that Pettigrew had been my family’s Secret Keeper. But when Sirius finally had him cornered, Pettigrew yelled for all the witnesses to hear that it was Sirius who had betrayed my parents; then he blew up the entire street to fake his death, and slipped away down some sewer pipe. Sirius was just standing there, laughing like a maniac, when the Aurors showed up. Voldemort’s right-hand man, they called him. He spent the next twelve years in Azkaban without trial.”\nAgain, Harry falters; he’s been staring avidly at Sirius the whole time he’s been telling his story and James could swear his entire face has creased with doubt every time Sirius flinched. \nHarry looks at Malfoy for reassurance. Malfoy doesn’t turn back around to whisper to him, but he does say, quietly, “they really don’t look like they’re acting. Or like they knew any of this before.”\n“Yeah,” Harry murmurs.\n“Finish the story,” Sirius demands. His voice sounds odd. James finally tears his eyes away from his son— his orphaned, grown-up son— to look properly at his best mate. Sirius is trembling all over and his eyes are wild; like, ‘fresh onto the Hogwarts Express after a whole summer with Walburga’ wild.\nHarry studies him quietly for a moment, but continues. “Sirius escaped from Azkaban eventually to come after Wormtail, who had been masquerading as a child’s pet. He briefly got ahold of him during a confrontation in which my friends and I and Lupin learned the truth, but Pettigrew got away. He ran off to locate Voldemort and a year later Pettigrew helped him resurrect himself.”\n“Why didn’t I kill him when I had the chance?” Sirius whispers brokenly.\n“I told you not to,” Harry says with a strange note in his voice that James can’t possibly hope to identify. “I didn’t want you to become murderers. I was going to hand him over to the dementors.” He barrels on over Sirius’ angry mutters, now splitting his gaze between Sirius and James again. “He’s dead now, though. I watched it happen. Maybe even made it happen, I think. I’m not sure. He was strangled to death by his own magical hand.”\nJames feels extremely queasy. He can’t quite fathom the depths of what this boy— his boy— has suffered, let alone process Peter’s betrayal, Sirius’ injustice, James’ own untimely murder. His head is spinning and Harry is still just looking at him with Lily’s eyes and worse, James honestly has no idea what Harry’s seeing; he can’t feel his own face enough to guess at his expression.\n“Alright then,” Harry says quietly. “Prove it’s really you.”\n“How?” asks James.\n“I don’t know,” Harry admits. “That’s the problem, isn’t it?”\nJames frowns. The Order has been working off of security questions lately, but it’s not the only system they have in place. He draws his wand and winces at Harry’s flinch. ”Expecto Patronum,” he casts.\nHis ethereal stag leaps out of the wand and canters right up to Harry. The boy fights momentarily against his ties, as if he forgot he was bound and tried to reach out to Prongs. Immobile as he is, all he can do is stare with lips slightly parted and eyes shining.\nWhen the stag finally fades away, Harry blinks rapidly, clears his throat, and turns to Sirius. “Now you,” he demands.\nSirius obliges and his familiar wolf pops out. Harry stares at it in shock which quickly morphs into suspicion.\n“That’s not Padfoot,” he accuses.\n“Of course not.” Sirius sounds as confused as James feels. “It’s Moony.”\nThe suspicion eases, which is nice, but Harry looks even more bewildered than the rest of them. After several speechless seconds, he manages to ask, “why would your Patronus be Moony?”\nSirius shrugs. “He’s mine and I’m his. Always have been.”\nThe longer Harry stares, the uneasier James feels about it. The kid said Remus was still around, didn’t he? And he found out Sirius was innocent? Why wouldn’t he know Sirius’ Patronus is Moony? Why would it be such a surprise??\n“You know your Patronus isn’t always your—” James cuts himself off before he and Sirius manage to incriminate themselves in front of Dumbledore. “I mean, it can represent lots of things. Your inner character, or who you love, or, erm, other things.”\nHarry’s eyes are wide and only growing wider. James could swear he’s mouthing who you love to himself. It’s not doing anything to help the unease in his gut.\n“Fuck,” Sirius says quietly. “You didn’t know about me and Moony?”\n“This is not happening right now,” Malfoy mutters.\nHarry clears his throat and frowns. “I never…”\n“Did he move on?”\n“I don’t…” Harry shakes his head helplessly. “I don’t know anyone he was with when you were alive. But if you two got back together, you never told me.”\n“When I was alive?” Sirius echoes hollowly. “He… after I was dead?”\nHarry looks away and shrugs awkwardly.\n“Was it serious?” \n“Obviously it wasn’t you,” James quips. Sirius punches him quite hard in the stomach for that, but James reckons, upon further thought, that he probably deserved it.\n“Erm, you could say that,” Harry answers, his voice high and uncertain.\n“This is not happening,” Malfoy mutters to himself. “I am not here for this.”\nSirius hunches his shoulders, rests an elbow on one crossed forearm, and pinches his nose. “Just tell me.”\n“He… married and had a kid,” Harry admits. Sirius lets out a noise like he’s been punched. “Although—” Harry starts, sounding desperately uncomfortable, “it’s possible he only got married because of the kid. I mean, it all happened pretty fast, but—”\n“Please stop,” Sirius begs. Harry shuts up immediately, looking guiltily relieved.\n“Did my Patronus change?” Sirius asks, ever softer and more unsure.\n“I don’t know,” Harry admits. “I never saw your Patronus.”\n“I thought you said you knew me for two years?”\n“I mean yeah, but after so long in Azkaban—”\n“He never said that,” Malfoy interrupts loudly. \nBollocks.\nHarry jerks his head up to glance sharply at the back of Malfoy’s head, then even more sharply at Sirius and James, and back. “What?”\n“You said that to me earlier but not to them just now. They’ve been watching us.”\nIt hurts, this time, to see Harry’s eyes narrow in suspicion. He starts struggling with his ropes again. James feels inexplicably devastated, like he’s let his son down, even though all he’s done is follow Order protocol and observe unknown entities for possible signs of their loyalties.\n“Fine then,” Harry says nastily. “Prove you’re who you say you are. Show me the real Prongs and Padfoot.”\nAll James does is glance uncertainly at Sirius, but apparently it’s enough to prove their guilt.\n“You can’t, can you? Because either you’re not really you, or someone else is watching us, even now, and you don’t want them to know.”\n“I—” James runs an anxious hand through his hair, feeling, not for the first time, like the night is spinning rapidly out of his control. “Like I said, we didn’t know who you were—”\n“Fuck off,” Harry spits. “I don’t trust them,” he says to Malfoy.\nThe door opens and Dumbledore enters.\n“Of course,” Harry and Malfoy mutter in tandem. Then they immediately look at each other in mutual disgust.\n“I do apologize for my rudeness, but I won’t deny that I consider the eavesdropping an unfortunate necessity during these uncertain times,” Dumbledore announces without preamble. “Otherwise, I fear, the very act of observation would disturb the observed system, no?”\nJames blinks at Dumbledore with a bemusement echoed by Sirius and Malfoy. Harry doesn’t seem unfamiliar with whatever theory Dumbledore is spouting, but he looks nevertheless unimpressed.\n“So kind of you to make your presence known,” Malfoy drawls after a beat. “Does this mean we’re trusted enough to be informed of your observation?”\n“In a manner of speaking,” Dumbledore says.\n“Okay,” Harry says. “Okay.” He sounds like he’s trying to reassure himself. “I can work with this.” He pins Dumbledore with that same calculating gaze; James shivers with relief not to be subject to it this time. “When you visited Tom Riddle to deliver his Hogwarts letter, how did you prove to him that magic is real?”\nDumbledore’s feathery eyebrows rise, but he otherwise remains composed. After a beat of assessing Harry right back, he answers. “I alerted him to the presence of several objects in his possession which did not, in fact, belong to him.”\nHarry scowls at the answer, narrows his eyes further, and says, after an unnervingly pregnant pause, “did you or did you not set his bed on fire?”\nDumbledore’s lips thin. “I did not,” he finally answers. James lets out a breath of relief only to find that he has reacted too soon. “It was his wardrobe.”\n“What?” Sirius mutters to nobody in particular. “What happened to transfiguring teacups?”\nEveryone else, thankfully, ignores him.\n“And what rune did you hide in your signature when you were writing letters to teenage Grindelwald?” Harry asks.\nAnother trick question, James thinks, but at least a funny one. Or, at least, it would be funny if Dumbledore hadn’t just paled dramatically, and also, James would swear his eyes just flashed. James chokes on air.\n“No way,” Sirius mutters. Once again, he is ignored.\n“The symbol of the deathly hallows, in the window of the A,” Dumbledore says.\n“Half the wizarding world has read that book, Potter,” Malfoy grouses.\nDumbledore twitches something awful. James feels increasingly out of his depth trying to follow this conversation.\n“Like you said, Malfoy. It’s not about the information but their reaction,” Potter mutters back.\nMalfoy looks genuinely impressed before he catches himself and sticks his nose in the air. “About time you acknowledged my superior advice.”\n“I must admit you seem to have me at a disadvantage,” Dumbledore interjects. “You know much about me and yet I know so little about either of you.”\n“Not a nice feeling, is it?” Harry says bitterly. “But maybe if you sit out there spying on us long enough, you’ll hear something useful.”\n“Allll-right,” James butts in. “We aren’t going to be best mates in a night—”\n“Not when you’ve got us tied up in a dungeon,” Malfoy says with sickly sweetness.\n“—But we’ve got to start somewhere,” James continues, undeterred.\n“You could try untying us.”\n“I’ll untie you when I’m convinced you’re convinced we’re on the same side.”\nMalfoy sneers some more but cranes his head around to look at Harry, who’s still sitting perpendicular to Malfoy’s back. Harry sighs and starts throwing his weight around to scoot into a more comfortable place from which to speak quietly with him. Sirius levitates his chair gently into position, which, alas, doesn’t seem to endear him to Harry at all. James backs away from the captives and leans against a wall, gesturing for Sirius and Dumbledore to join him.\nOnce they're content with the space they've been afforded, Harry and Malfoy begin a whispered conversation which quickly devolves into a hushed, but still perfectly audible, shouting match.\n“—Which you’d know if you’d paid attention in Potions at all, Potter.”\n“Oh, you mean if you hadn’t been sabotaging my cauldrons at every possible opportunity? Or do you mean if the class had been taught by someone who wasn’t a traitorous lying Death Eater with a personal grudge against me just because I look like my father?”\n“Sure, blame everyone but yourself! Honestly, it’s a simple fucking brew; any middling dunderhead would be able to tell you how to make it.”\n“Sorry we don’t all grow up with our own private potions labs in the nursery and Potions Masters for godfathers,” Harry snarks.\n“Godfather? Please. Just because all the insane rumours about you in school turned out to be true doesn’t mean that one is.”\n“You say that like I didn’t literally watch you and Parkinson feed straight lies to Rita Skeeter in fourth year.”\n“I’m quite sure you didn’t!”\nHarry snorts. “Give it up Malfoy, I know she’s an animagus. Hermione kept her in a jar that whole summer.”\nAll of a sudden, James finds himself extremely grateful that his animagus form is too large to fit in a jar. From the faintly greenish tinge of Sirius’ cheeks, he is thinking along the same lines.\n“Granger?!” Malfoy chokes. He almost sounds… impressed. “I wouldn’t think she had it in her,” he says faintly.\n“Skeeter finally stopped spreading lies about me all across the front page, didn’t she?”\n“Come off it; you love the attention.”\n“I assure you, Malfoy, I really don’t.”\n“Were you or were you not handing out signed photographs as a second year?”\nHarry splutters indignantly. “I wasn’t! That was entirely a mortifying misunderstanding caused by the unholy trinity of you, Colin, and Lockhart, and I never wanted any part of it!”\n“Please. Nobody gets into as many public death-defying stunts with dragons as you do without a genuine desire for attention,” Malfoy scoffs.\n“I just explained how I was forced into the Triwizard Tournament against my will.”\n“Fine! Then explain the one you rode out of Gringotts!”\nJames’ eyebrows shoot up his forehead and he turns his head to share a glance with Sirius. James’ look is saying who the hell raised my child and let him commit death-defying stunts with dragons and steal them from Gringotts? Alas, he finds no helpful answers in Sirius’ returning look, which only says, definitely Marauder spawn.\n“We didn’t have a choice. We needed something from a vault. I can’t tell you more than that,” Harry warns darkly.\n“Ooh, look at me, I’m Harry Potter and I have top-secret important missions that I can’t tell anyone about! I’m so special I just go around stealing dragons and robbing Gringotts and inciting goblin wars!” Malfoy mocks in a deep voice. “But noo, of course I don’t have some sort of pathological need for attention!”\n“Are you hearing yourself?” Harry exclaims. “You only think I love the attention because that’s all you’ve ever wanted!”\n“I've never needed it, because, unlike you, I don't have some kind of poor abandoned orphan complex where I need everyone else's love and admiration to make up for my lack of parents!\"\n“Oh, please. If you’d tried any harder to be the center of attention you would’ve single-handedly established the Hogwarts Drama Club.”\n“You say that like you weren’t the single biggest source of drama in the whole school for the entire six years you were there!”\n“You say that like you didn’t dress up as a dementor just to ruin a quidditch game!”\n“You say that like you didn’t wait to out yourself as a parselmouth until you were on a literal stage in front of half the school!”\n“Ooh,” Harry croons. “You’re just mad because up ‘til then everyone thought you were the Heir of Slytherin. Were you terribly jealous when they all decided it was me?”\nJames can’t help himself; he’s been trying so hard not to react aloud to the suggestion that his son broke into Gringotts and broke out of it on a dragon but this final insinuation is the last gobstone. He gasps much too sharply and descends into a violent coughing fit. Harry and Malfoy both startle and look at him as if they’d forgotten about his presence. That theory bears out when, after a beat, they backtrack significantly, and with a far lower level of vitriol.\nHarry clears his throat irritably. “So you know how to make the potion?”\n”Yes, and I know it because I’m just naturally gifted at Potions and I bothered to pay attention in class.”\nHarry looks unconvinced. “Snape’s really not your godfather?”\n“For your information, my only godfather is my dead Uncle Regulus,” Malfoy says with lofty airs.\nHarry snorts derisively. “Did your parents know he died robbing Voldemort when they named him honorary godfather, or—?”\nThis time it’s Sirius who can't contain his desperate gasp. He also renews the death grip on James’ wrist. James feels this is quite fair, and lets him.\nOnce again, the boys blink in their direction, Harry even winces apologetically, and then they lower their voices further and bring their heads back together. The next time they’re audible, it’s a sharp, vehement denial from Harry.\n“It’s perfectly safe, I swear,” Malfoy says exasperatedly.\n“I don’t fucking care, nobody’s taking my blood for any sodding potions. Absolutely not.”\n“It’s not Dark Arts, you imbecile, honestly.”\n“Dark Arts!” Harry repeats shrilly. “You want Dark Arts!? Last time anyone took my blood for a potion it produced a terrifying fucking quasi-immortal snake man, so, you’ll forgive me if—”\n“Oh, cry me a river.”\n“Excuse me?”\nJames finds his own hand now gripping Sirius’ wrist with equal fervor. He really, really doesn’t need to learn more about the future any time soon. At this rate, neither of them will make it out of this dungeon with ulnas unscathed.\n“Clearly the Dark Lord doesn’t need any more resurrection, you buffoon, so obviously your one absolutely implausible concern doesn’t apply here.”\n“I’m not letting anyone take my blood, Malfoy, and that’s final,” Harry growls.\n“Well then you’ll just have to take it yourself.”\n“Oh, sure, if I wasn’t bloody well tied up, maybe.”\n“We can untie you,” James blurts out. He earns a sharp look from Dumbledore for that, but ignores it. If this is really his kid, then sod it all, James feels like he should have some say in the matter. He steps forward. “If there’s something you need to do to prove, erm, our theory, then we can untie you. Briefly,\" he adds belatedly. \"Under supervision.\"\n“There you go, Potter,” Malfoy says smugly. “Take your own blood.”\nHarry glowers at the boy. James gets the impression that his own agency in the matter is not exactly the issue at hand, but clearly the opportunity to be freed from his bonds is too tempting to pass up.\n“Fine. We’ll take a paternity potion.”\nAh. Well, that’s a much more reassuring option for ‘potions requiring blood’ than some of the possibilities that had been running through James’ mind. “Right,” he says. “Okay. I’ve still got an in with St. Mungo’s, so I can pop over and borrow one—”\n“No,” says Malfoy. “Either I brew it myself or I supervise the brewing personally.”\n“Isn’t that a bit much?” James asks, running a hand through his hair.\n“Honestly, are all Potters blithering idiots at potions?” Malfoy complains with a roll of his eyes. “It’s extremely difficult to differentiate a properly brewed paternity potion from a false-positive paternity potion, so I’ll have to—”\n“There’s no such thing as a false-positive paternity potion.”\n“Oh Prongs,” Sirius sighs, wrapping a playful arm around his shoulder. “Magic bless you and your loving, Light-aligned family. So naive, so innocent.”\nJames raises a disgruntled, unamused eyebrow. “You’re saying they exist.”\n“Oh, yeah. Bane of the blood supremacist paters, they are. My Grandfather Pollux used to have the house-elves remove all the hemp from all the potions labs on all the Black properties as soon as he heard about a pregnancy in the family.”\n“Blacks,” James mutters. He ignores a condescending snicker from Malfoy.\n“I think it’s a reasonable solution, though, all things considered,” Sirius decides. “Dumbledore?”\n“It may be worthwhile, at this stage, to bring in one of the Order’s most talented brewers, yes,” Dumbledore says with a hint of mystery and mischief. He looks expectantly at James while he says that, which is a bit odd because James is definitely not one of the Order’s most talented brewers; really, that distinction rightfully belongs to—\n“Oh!” he says. He feels his eyes widen. “Oooh! Right. I’ll just. Erm. Bring her over. And we’ll get set up in the lab upstairs?”\nDumbledore nods agreeably. James shoots one expressive look at Sirius, determines he’s at least not any more of a mess than James feels at the moment, and bolts out the door.\nJames vaults over the purple sofa, leaps up three stairs at a time, and blows by Moody, still on watch, with nothing but a, “be right back!”\nSuddenly he is desperate, aching, for Lily’s presence and he honestly can’t wait another second. The utter incredibility of tonight’s events is threatening to overwhelm him and he just needs to be with her, immediately.\nHe disapparates a single step outside of the wardline and arrives on the threshold of their flat. He unspells and throws the door open to find his girlfriend lounging on the couch with a book, nursing a glass of wine, as if their pub night of less than two hours earlier had never happened. James, already struggling with the concept of linear time, gamely decides to just not think about it.\n“Hey Jam,” she says distractedly in greeting.\n“Lils,” he breathes. It comes out somewhere between elated and terrified, and gets Lily’s attention immediately.\n“Jamie?”\nJames strides over and hugs her tight to his chest, buries his face in her long, soft hair. He’s struggling to find words so he just holds on harder instead.\n“James?” Lily tries again. “Everything okay with your impromptu mission?”\n“Erm. Nobody’s hurt? But we need you to come to the safehouse and brew a potion there.”\n“Oh, well, that’s easy enough.”\nJames only nods into the side of her neck because he's not quite ready yet to expound upon the extenuating circumstances.\nLily pats his back. “I’ll need to take a sober-up first, love, so you’re going to have to let me go.”\nThe idea of letting her go has never sounded less appealing. In fact, James is overcome by the urge to ensure he never has to again. Knowing what they become to each other, and also knowing how short their time could be, makes him feel like he has to seize this day, and the future mother of his child, and just hold on.\nIt’s an impulsive decision that will ruin Sirius’ and Remus’ carefully-made plans, but, well, James is no stranger to ruining those anyway. He lets Lily up to rummage through the medicine cabinet and runs to his wardrobe. By the time Lily’s got her boots and cloak on, he’s ready to go as well. They apparate to just outside the wards, leaving, James realizes, a walk of only about 50 meters over dewy dark grass during which to warn Lily about what awaits her.\n“Right, so, just so you know,” he begins, and clears his throat. “You’ll be brewing a paternity potion for one of two wizards we found at the site of a powerful magical phenomenon. Dumbledore originally brought me in to identify him because he’s very obviously a Potter.”\nLily hums uncertainly. “You know that paternity potions can only tell you whether any two people are father and child?”\n“Yeah, I know.” They’ve reached the door to the safe house. James stretches out a hand and stops Lily from going in. The other hand, he runs through his hair. “The thing is, well, we think he’s my son.”\nAfter a long moment of utter shock, Lily’s face crumples, but morphs quickly into indignation. “A child?” She blusters. ”Whose? And, and how? And—”\n“He’s not a child,” James blurts out. “He’s… We think he’s a time traveler.”\nLily blinks owlishly at him. “Ah.” Her face un-crumples and her shoulders drop back down to a normal height, which seems like a good sign. “Maybe we should just go in and see him.”\nJames nods dumbly and follows her in, past an ever-vigilant Moody, to a blue door on the left. Inside the plain but clean potions lab stands Dumbledore along one wall, across from Harry and Malfoy, who are still bound to their chairs. Sirius has both hands planted atop the centre workbench, shoulders thrust forward to loom over a grimly defiant Harry. \n“Black,” Malfoy is saying. “If even Potter says it’s gruesome, you should trust him that you don’t want to know.”\nJames clears his throat to announce their arrival and the row ceases abruptly. Sirius glances guiltily at them and steps back to lean against the wall by Dumbledore.\nLily is stopped dead in the doorway, looking at Harry. James can’t see her face but he can peer over her shoulder and Harry is staring at her like she’s the last thing he’ll see before he dies. His jaws are clenched fiercely together but his eyes are still tearing up and he just looks terribly, hopelessly overcome.\n“Oh,” Lily says softly. “He does look quite a lot like you, doesn’t he?”\n“Except he has your eyes,” James adds in the same tone of voice: reverent.\nLily hums. “He does.” She walks over to crouch before Harry. “I’m Lily. But you probably already knew that.”\n“Draco Malfoy,” Malfoy drawls. “How I’d love to shake your hand, if you’d just untie me…”\n“Yeah, nice try,\" Sirius snorts. \nLily raises an eyebrow. “Pleasure.”\n“This is Harry,” James offers, because it feels a bit wrong to make the boy introduce himself to his own mother.\n“Hi Harry,” Lily says. She lays a careful hand on Harry’s shoulder and his eyelids flutter shut, though not before a few tears leak out. \nJames looks at them in that moment and feels indescribably full, like this is all he’s ever needed in his life: Lily and their son, and their love. Ropes notwithstanding. James is immensely grateful to have weathered the whole instant-suspicion-and-hate phase earlier tonight, to have given these two a chance to greet each other as they deserve.\nHarry opens his eyes. “Hi mum,” he whispers. \n“Oh dear,” Lily sighs. “That’s not how you look at a mum you’ve seen recently, is it?”\nThere’s one tremulous moment in which Harry only stares at her, and then he jerks his head down. It might be enough to hide the tears but it can’t disguise the shaking of his shoulders.\nLily leans in and tucks Harry’s head against her clavicle, cards her fingers gently through that Potter hair. “I’m sorry,” she says. James is dazzled by her ability to empathize, to feel love and loss on behalf of this boy she’s just met; to comfort him when he clearly needs her, regardless of the fact that motherhood is not yet a milestone she has personally crossed. \nShe turns her head towards James, who’s now leaning against the wall next to Padfoot, to support his gooey knees. “Is it really necessary to keep him tied up like this?” Lily asks.\nJames scratches awkwardly at his neck. “Technically, we haven’t completely confirmed he is who he says he is. Nor, for that matter, that we are who we say we are.”\nHarry sucks in a shuddery breath. “If this is a Death Eater trap I’ll destroy every last one of you.”\nSirius barks out a laugh that breaks the tension in the room. \nLily sighs and stands back up. “Paternity potion, then?”\n“Paternity potion,” James confirms.\nLily nods and starts selecting ingredients and laying them out on the worktable. She lights the fire, primes and fills the cauldron, and pulls out a knife.\nMalfoy coughs significantly. “I can’t quite see the worktable from this angle,” he says. He sounds like he’s trying hard and just barely failing to cut down on that trademark Malfoy superciliousness.\nJames finds it rather amusing, to be honest. He transfigures the legs of Malfoy’s chair longer until he can see everything easily. \n“Thank you,” Malfoy says imperiously. Then he side-eyes Harry, whose seat is now several inches lower than his, with a triumphant smirk. James rolls his eyes and transfigures Harry’s chair to the same height. \n“I didn’t realize this was an exhibition,” Lily comments drily. \n“I’m just the impartial assessor who will ensure it’s not a false-positive,” says Malfoy.\n“Ah. In case this is a Death Eater trap.”\n“Indeed.”\n“Well, colour me pretty well concerned that a bunch of teenagers of my own child’s generation are still worried about Death Eaters in— what year are you from, supposedly?”\nMalfoy raises a challenging eyebrow at Harry. Harry glares back at him. James wonders if now is a bad time to ask Lily what random vidyo means.\n“1998,” Malfoy answers.\nLily whistles. “That’s a long time for a community as small as ours to be at war.”\n“There was a period of peace there in between,\" Malfoy says, and shifts uncomfortably in his seat.\nLily nods casually, though her knuckles whiten on the grip of her knife. “Didn’t last though?”\nWhen no one else seems inclined to elaborate, James coughs. “There was some talk of a resurrection.”\nLily nods again with a grimace and drops the subject. She swaps out her knife and starts smushing puffapod beans with the side of the new blade.\n“You’re supposed to cut those up,” Malfoy says sharply.\n“The pickled puffapod beans? Yes, I believe that’s what the standard recipe says, but you’ll release the juice much better by crushing them with the flat side of a silver dagger.”\nHarry, who has seemed benignly uninterested in the rest of the potion-making process so far, suddenly gasps. It echoes loudly in the quiet of the lab, such that all eyes end up on him. “Where did you learn that?”\n“An old friend of mine realized, I think. We used to experiment with potions quite a bit when we were younger, before…” she trails off awkwardly.\nSnivellus, James thinks bitterly. He is nonetheless surprised to hear his son reach the same conclusion.\n“Don’t tell me it was Snape?” Harry asks, sounding absolutely gobsmacked.\nLily glances up at him warily. “It was.\"\nHarry looks like his entire world is crashing down around him; it’s honestly hilarious. James can practically feel Sirius’ amusement wafting off him in waves. \n“You were friends with Snape? But— but why?”\nThey’re interrupted by a ringing peal of laughter from Sirius. “No need for paternity potions,” he guffaws. “That’s definitely your son, Prongs.”\n“We grew up in the same neighborhood,” Lily explains with a sigh, looking more at her cutting board than at Harry. “He’s the one who taught me about magic. He was my best friend.”\n“No,” Harry croaks. “No. No way. No. He’s a bitter old bullying git and a traitor and he called you a mudblood and HE KILLED DUMBLEDORE!” Harry ends on a roar.\nLily inhales sharply at that, eyes flashing. She looks almost desperate for Malfoy to contradict it, but he’s only barely stayed upright in his chair given how hard he just flinched; all he can manage at the moment is a sad shrug.\n“Oh, Sev,” she says mournfully.\n‘Sev,’ Harry mouths incredulously. He looks like he’s going to be sick. \nDefinitely my son, James thinks.\n“We grew apart,” Lily offers in penance. “He got pulled into the Dark Arts and the Death Eaters. It… wasn’t unexpected, I guess, though I was devastated all the same.”\nJames watches Harry struggle and fail to acclimate to the concept that his mum was friends with Snape, and swallows down a surge of belated understanding for Lily that he never quite managed at sixteen. Harry hasn’t explained to them how or when Peter turned, after all. Has he, too, already been pulled into the Death Eaters?\n“So,” Lily says lightly after several awkward minutes of quiet. “How did you two end up here, anyway?”\nMalfoy looks at Harry. Harry looks at Malfoy. Both of them shrug. “There’s all sorts of strange artefacts in the Room of Hidden Things,” Malfoy says eventually. “We probably knocked into something during the fight.”\n“Don’t exactly remember much,” Harry adds, still quite sullen over the Snape revelation.\nLily sprinkles in the last of the dandelion roots, stirs three times each direction, and sets a timer. “Okay, this will simmer for nine minutes.” She sits back down on a stool behind her. “Will you tell me about yourself in the meantime?”\nHarry looks warily at her for a moment, but acquiesces. He starts talking, haltingly, clearly steering around some topics, though James can’t quite identify what they are. Nevertheless, James learns that his son is a Gryffindor (he already knew that, but he’s thrilled to hear it again), he likes treacle tart (classic Mama Evans), he has two best friends (NOT Malfoy, who looks supremely and hilariously offended at Lily’s innocent misunderstanding, given they did arrive here together), he’s a quidditch prodigy (Malfoy looks supremely and hilariously offended at that assertion as well, but, even more hilariously, he can’t deny it), he’s good at Defense Against the Dark Arts (practical! James, as a responsible father-to-be, approves), and he had a snowy owl named Hedwig until about ten months ago (definitely a bit of a bummer; James is relieved when Lily’s timer interrupts that explanation).\nFinally, the potion is ready, and James cuts his finger to let three drops of blood into the cauldron. He then walks over to hand Harry the knife, casually placing himself between Harry and Lily, just in case, and spells off his bindings. \nHarry sighs with the release of the ropes and stands stiffly. He looks at the knife with grim anxiety etched all over his face, turns his palm up as if ready to cut, hesitates, and looks back at Malfoy for some kind of reassurance.\n“Three drops,” Malfoy says evenly.\nHarry nods, holds his hand over the cauldron, grits his teeth, and cuts himself. The blood drips into the potion and turns it a blinding white. Harry steps back a bit, blinking his eyes.\n“Congratulations,” Lily says softly. “It’s a boy.”\nHarry raises his eyebrows at Malfoy, who nods. “That’s a positive.”\nSomething loosens in James’ shoulders. That’s really his son, he thinks. Harry, his son. Funny how it felt so real before and now, having received incontrovertible confirmation, it somehow feels surreal.\nIt only takes a second for Lily to carefully remove the knife from Harry’s grasp, set it down safely on the worktop, and sweep him into a hug. Harry grasps the fabric of her shirt and holds on to her for dear life. Sirius claps James on the shoulder and pushes him forward; he wraps his arms around Lily, sandwiching Harry between them.\nThey stay like that for what feels like hours, though it’s probably only a couple minutes, max, until they’re interrupted by an awkward but insistent throat clearing behind James.\n“Am I just to remain tied up forever, then?” Malfoy drawls.\n“Harry,” Dumbledore calls. “You are willing to vouch for Mr. Malfoy’s loyalties?”\nHarry finally pulls himself away from his parents, looks at Malfoy, then at Dumbledore, and nods. “Yeah,” he says. “He’s a shit Death Eater. I reckon he’s been trying to defect for ages.”\nMalfoy sniffs but he’s clearly too intelligent to refute the point, degrading though its presentation may be. “I’ll have you know I was forced into it to begin with,” he clarifies. “After you got my father arrested,” he adds with some heat.\nHarry glares back at him. “After he got Sirius killed? I’m not sorry.”\nA long, low groan announces Sirius’ reaction to that news. “Killed by fucking Lucy?” he whinges. “Fucking rough.”\n“Erm,” says Harry, scratching at his neck. “Technically he only lured us to the battle? It was really Bellatrix who got the final blow. And the, erm, Veil of Death?”\n“In the Department of Mysteries?” Dumbledore asks with intensity.\n“Now there’s a cluedo solution for the ages,” Lily quips.\nSirius groans again.\nHarry’s shoulders tense. “Yeah. There was a battle there.”\n“Ahem,” Malfoy repeats. “Ropes?”\n“Right-o, cuz,” Sirius says. He waves his wand and Malfoy’s restraints disappear.\nMalfoy immediately springs up to rub at his wrists and ankles and chest, trying in vain to smooth out the wrinkles in his robes. “You didn’t happen to find a wand or two with us, did you?” he asks.\n“I’m afraid not, dear boy,” Dumbledore says sadly.\nMalfoy sighs. “Fucking typical.” He continues to grumble under his breath about something that sounds a whole lot like “Scarhead” and “Potter.”\n“Harry,” says Dumbledore, like a crup with a bone, “what was the purpose of the battle in the Department of Mysteries?”\n“It’s a bit of a long story.\"\n“I think we’d like to hear it,” Lily says. “All of it. Let me just clean up the lab here and then why don’t we sit down and go over everything?” She vanishes the muck on the workstation, rubs the cutting board down, and then turns around to scrub the knives and cauldron out in the sink against the far wall. While she’s thusly occupied, James steps over behind her and kneels down.\n“No way,” Malfoy breathes.\n“This is definitely not how it was supposed to happen,” Harry whispers anxiously.\n“Oh, come on,” Sirius groans. “We had a plan, Prongs! A good plan!”\nJames only looks over his shoulder to give him a sheepish but unrepentant grin.\n“What’s that?” Lily says absently, rinsing the cauldron out. When nobody replies, she finally looks over.\nAnd turns around completely to find James on one knee, ring in hand.\n“Oh.” Her quiet breath of surprise is almost, but not quite, covered up by the clang of the forgotten cauldron falling into the sink.\n“Lily Marie Evans,” James starts, embarrassed to hear his voice is already creaky with emotion. “I’ve seen the future tonight, our future, and he is strong and clever and loyal and wonderful, just like you.” He tears his eyes from Lily’s face, with effort, to smile softly at Harry. He’s wiping at his eyes with the sleeve of his jacket, and James turns back around to find Lily doing the same thing. This small, beautiful congruency fills James’ chest even closer to bursting.\n“Harry’s story was… darker and more awful than I could ever have imagined, but… no matter how dark this war gets, Lily, you will always be the light of my life. And no matter how long or short our lives end up being, and no matter how awful the end, I want you to know it’s all worth it, to fight and even die by your side. Because I found out tonight that I really will die for you, and it only made me more determined to live for you, too, to make sure you know every single day how much I love you. I’ve been waiting to marry you for years, Evans, and I might not have that many years left to wait, and I just refuse to wait any longer.”\nHe pauses for a steadying breath before the big question, but never gets around to answering it. “Of course I will, you daft sod,” Lily answers. James’ beaming smile is unaffected by her irreverent epithet.\n“Just call him an arrogant toerag, why don’t you,” Sirius jeers.\n“That’s enough from the peanut gallery,” Lily shoots back. She cups both hands around James’ face. “James Fleamont Potter, you have been shockingly wise tonight for how much of a toerag you truly were at fifteen.” She crooks a half-smile at Sirius’ triumphant hoots but otherwise ignores him. “I consider myself lucky to know the brave, steadfast, loving man you’ve matured into. And I’ll consider myself even luckier to be your wife.” \nShe leans down to kiss him and James surges up to meet her, to spin her around in his arms, warm, triumphant, ecstatic.\n“Bollocks,” Harry mutters. “It’s official. I've meddled with time. Hermione’s gonna be so mad.”\n“We already know you ruin everything, Potter,” Malfoy snarks, but his watery voice betrays his emotion.\n“I can’t believe I got to witness my parents’ engagement live but had to share it with Malfoy. Of all the absurd things I’ve been through…”\nJames finally pulls back to let out a snort. Trust his own sprog to ruin the moment. \nHe pulls Lily’s hand away from his face and carefully, reverently, slides the ring onto it. It’s an old Potter heirloom, all topaz and rubies, but still elegant. It suits her, he thinks.\nLily kisses him again, then they finally turns to face their motley group of spectators: his teenage son (weird, but good), his best mate (annoying, but good), his headmaster (weird, but fine), and a Malfoy (annoying, but, he guesses, fine). Well, James tells himself, this is what he gets for ignoring Remus and Sirius’ carefully laid plans.\n“Moony’s gonna be so mad he missed this,” Sirius remarks, as though following James’ train of thought. “We were all there together at pub night just hours ago and yet you waited for whatever this is, instead, where he’s not.”\nJames sighs. “I’ll just have to propose again with the original plan, then, won’t I?”\n“Knowing you lot, this is actually the more sensible proposal,” Lily remarks drily, “so maybe I should be glad it happened first.”\n“You wound me!” Sirius cries dramatically. “Oi, Harry, you’ll help us with the re-do, won’t you? We’ll need someone to fill in for Wormtail anyway.”\nHarry flashes him a blinding smile that makes something in James’ chest ache. “Yeah, alright.”\n“Brilliant,” Sirius says. “We need to go out and celebrate!”\nJames instantly agrees; Lily, responsibly, looks to Dumbledore for a dismissal.\n“Congratulations to you both on your engagement,” Dumbledore rumbles, shaking their hands. “And far be it from me to keep you from a much deserved celebration. I daresay we can leave off further well-meaning interrogation of our new allies for later this week. However,” he says to Harry and Malfoy, “I’ll need to see to your temporary living arrangements before you go.”\n“Harry’s coming back with us,” James says at once. “He’s our son and we’ve got a comfy couch and I’m good at transfiguration. Problem solved.”\nHarry looks utterly thrilled by the offer for all of fifteen seconds before Padfoot ruins it.\n“Not tonight!” Sirius interjects with a lascivious cackle. “Not when you two’ll be shagging all night as soon as you get home.”\nHarry turns promptly green in the face. Malfoy sniggers too.\n“You’ll both come home with me,” Sirius insists. He walks over and manouvers himself between the two teens, clapping a long arm over each of their shoulders. Harry looks significantly more comfortable with this arrangement than Malfoy does. \n“Moony and I have a whole empty guest room and it’s got an entire real bed I can duplicate for the night. And then when Prongs and Lily have gotten all the crazy engagement sex out of their system, Haz, you can go live with them, and you, cuz, will stay with me and Moony and we’ll get drunk and bond over the trauma of the House of Black and plot to steal Reg back from the wankers, yeah?”\n“Erm,” says Malfoy.\n“Sounds perfect!” Harry chirps, beaming all the harder at Malfoy for pure spite.\nMalfoy looks imploringly at Harry. “Who’s Moony?” he whispers.\n“Professor Lupin,” Harry whispers back.\n“Professor Lupin!” Sirius crows. “Oh, he’ll love that. Might even make up for the whole missing the Prongs-posal thing. A professor!” He starts shuffling them out the door, repeating “Professor Lupin!” with glee at regular intervals.\nJames wants to linger behind for a quiet moment with his fiancee, but Lily intertwines her pale fingers with his and pulls him towards the door instead. “Come on, let’s go make sure Sirius isn’t corrupting our son,” she says. \nAnd just like that, they're a family of three."
}