{
    "id": "4289208",
    "url": "https://archiveofourown.org/works/4289208?view_full_work=true",
    "author": [
        "dropdeaddream",
        "WhatAreFears"
    ],
    "title": "Not Easily Conquered",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "F/M",
        "M/M"
    ],
    "fandoms": [
        "Captain America (Movies)"
    ],
    "relationships": [
        "James \"Bucky\" Barnes/Steve Rogers",
        "Peggy Carter/Steve Rogers",
        "Clint Barton/Natasha Romanov"
    ],
    "characters": [
        "Steve Rogers",
        "James \"Bucky\" Barnes",
        "Peggy Carter",
        "Natasha Romanov"
    ],
    "additional_tags": [],
    "language": "English",
    "series": "Part 3 of Not Easily Conquered",
    "published": "2015-07-07",
    "completed": "2015-07-07",
    "words": "46,467",
    "chapters": "2/2",
    "comments": "1,290",
    "kudos": "13,749",
    "bookmarks": "2,379",
    "hits": "232,322",
    "summary": "<p>“Ladies and gentlemen of the jury,” Peggy says, “These are the times that try men’s souls.”</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
    "text": " \nThough we are not now that strength which in old days\nMoved Earth and Heaven, that which we are, we are; \nOne equal temper of heroic hearts, \nMade weak by time and fate, but strong in will \nTo strive, to seek, to find, and not to yield. \n—Alfred, Lord Tennyson \n“Ulysses”\n \n\n2008 \n\nGoogle\nAbout 287,000,000 results (0.59 seconds)\nIn the news\nStark Industries to Halt Weapons Production\nCNN - 7 minutes ago\nStark Industries CEO Tony Stark, one hour after his return to the US, announced that Stark Industries will cease production of …\nTony Stark found alive after 3 months of imprisonment by the Ten Rings\nLos Angeles Times - 1 hour ago\nTony Stark is alive\nUSA TODAY - 1 hour ago\n—\n“Our line is cursed,” said Sarah Rogers, often in fits of irritation or exhaustion. “I’ll tell you what with. Chronic loneliness, one. Two: a soft spot for the troublemaking type.”\n“I thought we were the troublemaking type.” Steve remembers saying this vividly: he was twelve years old, and it made Bucky snort out an ungainly laugh from across the kitchen. Then he slapped a hand over his mouth and went back to washing.\n“Only in front of other Irish,” Sarah conceded. Or maybe she said, “Only in front of the Barnes boy,” in the gruff and adoring way she had, the way that implied a soldier’s affection; the Barnes boy.\nSteve thinks a lot now of Sarah Rogers preparing potatoes for dinner, Bucky at her side, their calloused and capable hands warm and pruned from scrubbing. Bucky had a terrible habit of sticking his fingers in the food for a taste. When Sarah turned he would whip them out, grinning his who-me smile. Steve remembers the noise, primarily: Sarah would slap a knife right in the middle of each one that she planned to mash, smack, to test the hardiness of the meat inside. Later, during the war, Bucky would snatch whole potatoes from abandoned kitchens in the ashy smear of their European villages; he would buy them at markets; he would even take them from the mess, if there were any to be had. Bucky only had trench knives — American, Nazi, French, Russian, whatever his sticky fingers could take — but he liked to practice throwing them for lack of other work, and it was the potatoes he used for targets, balanced on fold-up stools or stained fence posts. He usually ate them after, but sometimes presented their eviscerated carcasses to Steve for his dinner instead. Smack, smack, smack: a very quiet decimation.\nSmack, smack, smack. The last of them falls to the floor, clutching at the knife in his belly. He makes atrocious wet and gasping noises. “I’ll ask you one more time,” says Steve. Russian still feels unfamiliar; the consonants click and echo together strangely in his own ears. “Who do you work for?”\nSuddenly the man moves his jaw in an alien way, and bites hard onto nothing. Steve’s hand, braced across his neck, is wet. The agent is foaming at the mouth, gasping and choking: there was a cyanide capsule, Steve realizes, in one of his molars. Livid, Steve takes him by the lapels of his coat. He shakes the agent so violently that his head cracks against the ground, once and then twice. The man chokes and gurgles; then he laughs. “Хайль —“\n“Tell me, goddammit, tell me —“\nBut the man is dead, leaking blood and saliva, staring with pale blank eyes at the dark bunker ceiling. Steve’s chest heaves. He makes a terrible noise and slams his fist into the concrete, where it splinters like fine china under his hand.\n—\nSomeone is following him.\nLviv is a kind place, or at least as kind as any place this far north can be; as he walks down the stone street, a pair of enemy eyes prickling at the back of his neck, the locals remain blankly ignorant. Steve ducks into a fish market after a moment. He tries to catch a glimpse, but all he sees behind him, even in the reflections of windows, are civilians: three families trying to keep their scrabbling kids in line, two young sweethearts, a man frowning at the price of yogurt.\nThe fluorescent lights cast the fish in a strange greenish hue. Steve examines their gaping mouths. Then he looks back to the reflection in the window. First he sees a man in a noncommittal blue jacket, a baseball cap, glasses. His nose is long and aquiline, his jaw defined, and his eyes blue. It takes Steve a moment: he’s looking at himself. His gaze shifts. It could be him — the man at the yogurt. When Steve blinks he’s wandering away, and then gone. Steve sets down the carton of milk he didn’t plan on buying anyway and rounds the corner. Now the man inspects canned goods: cabbage soup, solyanka soup, lamb and rice soup.\n“Don’t buy the rassolnik canned. If you want to try it I know how to make it.”\n“Romanoff.” He should have known. Steve doesn’t turn around: his jaw is grinding, and he feels her small frame press against his shoulder. She slips her arm through his. Still in Russian, she says, “Come on, baby,” and tugs him out of the market and into the nighttime street. The air is chilled and the stars are bright in the sky. He shakes her off.\n“Well?”\n“You hear about Stark?”\n“I can handle what’s going on in my own family, Romanoff, thanks.”\n“You know, you’re never quite as friendly as your file advertises.”\n“I’ve been alive for ninety years,” says Steve. “You’ll have to excuse my childlike sense of wonder. What are you doing here?”\nSomething flickers over her face, smile-like. “Fury wants to speak with you. I’ll fly you out at 0800. Earlier, if you don’t have anything to pack. Which seems likely.”\nHe isn’t sure if he’s being insulted or if he isn’t. “Why didn’t Nick call himself?”\n“I don’t know everything, Rogers.”\n“Sure act like it.”\nRomanoff’s face remains impassive, and a blinding white fury grips Steve’s throat. He hasn’t found a lead in two years, not since the file she left for him: the operatives he finds are in abandoned bunkers, and they eat their cyanide tablets before he can get anything out of them. Desperate, sickish, his temper has turned hair-trigger. Steve curls his hands into fists in his pockets and grinds his jaw until the feeling is gone. “Listen, why don’t you try calling first next time, instead of tailing me? I hear that’s the polite thing.”\n“0800,” Romanoff repeats, and she walks back and away from him, her boots clicking on the sidewalk.\n—\nHe and Agent Romanoff are an odd couple, infamous in their ways: they draw eyes all the way to the elevator, and even inside it. “Sir,” a woman greets, nodding. Her eyes flick to Romanoff and then away. Steve hits the floor number; he smiles back and avoids eye contact. The elevator stops and the agent leaves. A floor, two, and a man gets on. Steve eyes him in the reflection and looks away when his head shifts.\n“This is gonna sound weird.” Steve and Romanoff turn to look at him in snap-to unison, startled. He continues anyway: “But I, ah, I think it’s a real pleasure to meet you, sir.”\n“Nah, that’s not weird. It’s a nice thing to hear.” Steve drags up a smile from somewhere and he offers out his hand when the man turns. “Steve Rogers.”\nThe guy laughs and tilts his head. His nose crinkles up like Steve made a funny joke. His handshake isn’t warm, but a little too hot; he lets go at the right time, but Steve still wants to shake his fingers out after. “Ah, God. My stop was a few floors down,” he admits. “I just wanted to introduce myself.”\n“Nothin’ wrong with that. It’s a pleasure to meet you too.”\n“You know, you’re a hard one to pin down, Colonel. Not around a whole lot, are you?”\n“It’s true,” Steve agrees. “I’m not. Might be a little more now, though.”\n“Is that so?” the guy asks. “Well, you know who to call if you need a tour guide.”\nThe elevator doors open; beside Steve, Romanoff shifts impatiently. “Can’t do that without a name,” Steve points out.\nThe man grins like Steve has made his day. His face is oddly handsomer when he isn’t smiling: he wears the expression strangely, like his skin is stretching too tightly across his skull. “Rumlow, sir,” he says. “Brock Rumlow.”\n“Well, nice meeting you, Rumlow.”\n“Sir,” Rumlow says, and then he turns to Romanoff, and he nods. “Agent.”\n“Commander.”\nFinally Romanoff shoulders them out. Steve keeps pace with her, and glances to her from the corner of his eye. “You didn’t say you knew each other.”\n“We’ve worked together before,” says Romanoff shortly. “He was briefed on today’s meeting.”\n“Why?”\n“In case we need backup.” It’s not a satisfactory answer, and Romanoff must feel how unimpressed Steve is by it, so she says, “Head of Alpha STRIKE, ex-SEAL.” She’s cagey about Rumlow, Steve thinks, so maybe that means she’s like Nick: maybe Romanoff likes people, even though she doesn’t trust them very much. Then she pushes Nick’s door open and Steve is following her inside.\nFury looks up from his desk and the paperwork spread over it. “Sir,” he says.\n“Nick,” Steve replies.\n“Agent Romanoff.” She doesn’t reply, and instead presses a button; it seals the door and dims the lights and starts the projection, which sprouts straight from the conference table to hover, bluish, in midair. Fury swipes three files open. “I’ll get right to it,” he says. “Romanoff’s pinned down who the Soldier could be targeting next. Aamal Malik, nuclear engineer. She’s working on a project right now in Iran that’s gaining a lot of attention. Bad attention.”\n“That’s why she’s a good bet?”\n“That, and her father worked on the Manhattan Project — yeah — Trinity Site. She’s making waves, and she has a history. It makes sense.”\nSteve reaches out to the StarkTech facade and touches thin air. The files shift and bloom, and he sifts through the intel, chewing at the inside of his lip.\nRomanoff says, “Howard Stark kept trying to recruit her for years but she didn’t want involvement. By the time Stark had poisoned Bikini Atoll testing the H bomb, she was doing well for herself, supervising government-funded think tanks unrelated to weaponry. When she was twenty-one in 1966 —“\n“Recruited by NASA,” Steve murmurs. “Christ.” This is a bad history, it’s true. Grudges run deep.\nRomanoff flicks to the next slide, a political map of Europe and the Middle East, and continues. “Malik is currently based out of Tehran. She’s been consulting for an undercover op and it’s a possibility she’s compromised. Her research is crucial and we need to make her safety a priority. She’s wanted by a lot of people. With a little bit of luck, you might find what you’re looking for.”\n“You want us to use a civilian,” says Steve, very flatly, “An innocent civilian, as bait. That’s your game plan.” Romanoff is impassive. Steve turns. “That’s your game plan, Nick?”\n“Captain, frankly,” Fury says, “It’s the best chance you have. At this point it might be the only chance. This intelligence was one in a million. There’s always the possibility he won’t even show.”\nSteve remembers vividly the photograph of Bucky in the file Romanoff procured for him: blue, wasting, hurt. Years now and nothing to show for it. If this is truly his last chance…\nRomanoff looks between them. Then she says, “Captain, you and I will escort her to London, and to Wales. We’ll leave enough breadcrumbs for them to follow and double back to France, where she’ll lay low for a while. After that she’s off our hands.”\nFury and Romanoff both look to Steve. He nods, squeezing his jaw shut. “It’s solid. What’s our route?”\n—\nIn northern Azerbaijan, after the cities and the red deserts, there’s forest for miles; and sometimes, in the early pink morning, fog. Romanoff’s long red hair frizzes because of it — Steve notices this sometimes, at night or at dawn, the tendrils at her temple— but since they boarded the jet for Tehran she’s tied a scarf around her head, and same as always, she coalesces into the crowds.\nIn the backseat Malik works on her equations with sharp brown eyes. An aging woman, her face is wrinkled but incredibly slim; she’s growing old the way that Peggy has, similarly touched by physical frailty. This car is dusty, old, rented. A sedan. Steve felt a little bad about that: how they won’t be taking it back. But Romanoff took care of the plates, and Steve figures that in this line of work that’s the best he can expect. It’s not like Buck didn’t do worse things for him, all those years ago.\nIt was all so hopeful at first. Steve had the file, Steve had the shield. Steve was striking out again into the unknown for a search and rescue: he had felt like himself again, finally buoyed with purpose. Now it’s been two years. Bucky is still gone and Steve has deserted his family the same way Peggy always knew he would. Tearing the world apart hasn’t been particularly hard: he’s angry enough to do it. But his patience is rapidly dwindling. He feels as though he’s been sewn together badly. He feels as though his seams are at once too tight and too loose; either way, the stuffing is coming out.\nHe hates this long drive.\n“What’s your cover?” Romanoff asks him.\n“What’s that?” Steve says. Romanoff sits in the passenger seat, twisted to look at him.\n“Your cover,” she repeats. “You’ve been doing this for two years. Checking in and out of motels, asking for directions…you have to have a cover.”\n“Romanoff, what —“\n“Don’t worry; she’s asleep,” Romanoff stage-whispers. And it’s true: Malik is dozing in the backseat, oblivious. They are, for all intents and purposes, alone. When Steve looks back over to Romanoff, any hint of a smile on her face has been wiped away: her expression is bare and unyielding and reflective again. “So?” she asks.\n“Nick put you up to this?”\n“No. No, I’m just curious.” She tilts her head at him. “You’re not a spy, Rogers. You’re a soldier.”\nI’m a lot of things these days, Steve thinks, but he bites on his tongue for a moment. Then he says, “So you want to know what you’re working with.”\nRomanoff’s small shoulders shrug. “I want to be prepared.”\n“Alright.” It’s not in Steve’s nature to deny a fair reason when he sees one. They’re colleagues now, for better or for worse. She needs to know what she’s dealing with.\nHe has to take a moment to feel it, and to allow the feeling to settle into his shoulders. Nobody really talks to him, but that doesn’t mean that he hasn’t practiced before. When Steve hears his own voice, he fails, for a heartbeat, to recognize it completely. “Well, I just finished grad school. I’m taking a year and touring Europe.”\n“What did you study?”\n“Studio art.” Steve checks the rearview, flips on the turn signal, and changes lanes. “But then I realized I had made a mistake. I ended up in architecture. I’m a lot happier now, and — get this — it pays the bills.”\n“So you’re not traveling with friends or anything? You’re here completely alone?” There’s something flirtatious and fun in Romanoff’s voice, like they’re chatting at a bar.\nSteve shrugs one shoulder in response and quirks his mouth into a smile, self-deprecating. He passes up the slow car in the other lane. She wants to see; he can show her. “Yeah; well, you know. I’m a lonesome kind of guy. People tend to come and go for me. And besides, God, the people you meet traveling…that’s the best part, isn’t it?”\nRomanoff is amused now. It shows in her deep voice. “Tell me about your childhood.”\n“A cat, one brother, white picket fence — I’m from Kansas, but I did school out in Spokane. Jesus, I’m boring; am I boring you?”\nRomanoff is laughing with her bright green eyes. “What’s the saddest thing that ever happened to you?”\n“Max — my cat — he died two years ago, I’d had him since I was a kid. He was a part of the family, you know? That was rough.”\n“Alright,” she grins. “Alright, Rogers. You got me. Okay.”\n“Guess nobody told you that Captain America is a pretty good liar, huh?”\n“No, nobody thought that information was pertinent,” Romanoff replies.\n“Only way I got into the Army in the first place.”\n“I have a question,” says Romanoff.\n“Shoot.”\n“You have this whole secret identity thing figured out, obviously —”\n“Thank you,” says Steve, magnanimous.\n“So if we get stopped or someone wants to talk, what do I say? Who do you want me to be?”\n“How about yourself?” Steve asks, before he realizes he’s asking it.\nRomanoff looks at him for a long moment, and then away, something of a smile on her face. Romanoff is like Steve: she smiles at things that aren’t funny. After a moment she says, “So how much of that was true?”\n“Good lies are always a little bit real.”\n“The cat?”\n“Nah. I was allergic.” Kathryn hadn’t wanted a cat, or else they would have had one: she had plenty of company on the riverbank with tadpoles and small fish and little water beetles. But Bucky always fed the neighbor’s mangy thing, and besides that he caved, sometime in early adolescence, and began feeding all the alleyway strays. And then he would complain about their yowling when he got home, and gripe when they started greeting him by winding around his feet at the door.\nThen stop feedin’ ‘em! Steve had laughed once. Nah, Bucky had said. There was something soft in his eyes then.\nYou know me and skinny, pissy little alley-cats, Bucky told him.\nSteve eyes the horizon. Green: trees and trees. Fog later. “You spend fifteen years wandering the country, no home to speak of, you learn how to blend in,” he says.\nRomanoff is curious. “Are you blending in now?”\nSteve looks to her out of the corner of his eye. “Are you?”\n“I’m not always truthful, but I am always honest. When you’re a spy, home is a malleable concept,” says Romanoff, after a long and thoughtful silence. This is something Steve likes about her, he realizes. So much goes on underneath her eyes. “You have to belong anywhere.”\nSteve thinks of Peggy’s late nights at the office; her quiet, impenetrable distance. It took so much out of her and he never really helped. He hasn’t thought of Romanoff in this context before. “Malleable,” he repeats.\n“And if you can belong anywhere, you have to come from nowhere.” A smile plays at Romanoff’s mouth. She tilts her head against the seat, and she looks to him. “So what is the truth?” she asks.\n—\n\n “This just in, odd reports of an incident in Malibu an hour ago: a security breach, possibly related to Stark Industries research, resulted in violence just off Mulholland highway. Two men in what appear to be metal suits seemed to be in some sort of altercation, although Stark Industries has reported that they were only security guards. A Stark Industries press conference is scheduled for tomorrow to address the event, which will broadcast at 10/9 central. Right now we’ve got Matt with an eyewitness on the scene…Matt?” \n\n\n(News at 9. CNN. Malibu, California.)\n\n \n—\nIt airs at night in English, with Azerbaijani subtitling. Steve sits hunched on the motel bed, huddling close around the small discolored TV. Tony’s pixelated face isn’t entirely discernible, but Steve knows the slant of his shoulders, and they droop. He looks down at his notecards, halting. His friend, Colonel Rhodes, leans over to whisper something to him.\n“The truth is,” Tony says. He glances up; down again. Then he looks out to the press. “The truth is —\" \n—\nOn the first morning of 1945, a HYDRA base deep in the forest of Austria went up in a truly fantastic display of flame and rubble minutes after midnight. Solemnly Falsworth had removed his hat, pressed it to his chest, and, as they stood watching the skeleton of the building crackle and burn and collapse, started to sing: it was Auld Lang Syne. A sudden laugh launched out of Jim’s throat, and then Dugan’s, and then Dernier’s. And then they were all laughing, their eyes blurring and watering, and they were gasping for air and clutching at each other, howling, their stomachs in knots, nearly retching from it. They got a hold of themselves eventually, exhausted and sick, but even then kept chuckling at giddy intervals. Finally Bucky slung an arm around Steve’s shoulder, tugging him close, smelling like woodsmoke, copper, soil; and in that low, crooning voice, he picked up where Falsworth dropped off: Should auld acquaintance be forgot, and never brought to mind?\nIn Russia, close to Rostov, Steve picks up two tiny vodka shooters for himself and Romanoff; an apple juice for Dr. Malik. There are pre-made sandwiches in the refrigerator of the liquor store, so Steve gets those, too, for dinner. It feels wrong not to celebrate the New Year somehow: even in 1968 he toasted the motel television. The cashier asks for his ID: Steve laughs, at giddy intervals, all the way back the motel. When he gets there he shoves down his sandwich and drinks tap water. Cell connection is patchy; Steve can’t call home.\n“Try texting them,” Romanoff suggests. She settles herself on the bed that Dr. Malik’s claimed — she and Steve take turns on the couch, or the floor, and Steve is sitting on his bed for tonight already — and twists the top off her shooter. She sets it down on the bedside table and then pulls out her own phone, tapping off something quick. Steve wonders who it is she texts on New Years Eve. “If it doesn’t send through now it’ll do it later, and you won’t have to keep checking.”\n“Thanks,” Steve says, surprised and touched and glad.\nThey toast at midnight, perfunctorily. Dr. Malik speaks halfway through her sandwich, completely unprompted. “My resolution is to write a book.”\n“Yeah?” asks Steve. He likes Dr. Malik. She’s clever and street-wise, like the kind of people he grew up around. “What about?”\n“Not engineering.” It makes him laugh.\nRomanoff turns to him. She downed her tiny bottle in one go. Steve has too. “Guess I don’t need to ask you for your resolution,” she says.\n“And in the spirit of fairness,” Steve concedes, tipping his empty bottle in salute, “I won’t ask you for yours.”\n \n \n\n2009\n\n\nThe voluntary false-confession phenomenon is another example of abnormality in behavior and cognitive function. A voluntary false confession occurs when a person completely unassociated with a crime, usually a murder, fraudulently claims they were the perpetrator. One explanation of this behavior stems from the psychoanalytic view, which states that false confessions are a manifestation of unconscious, compulsive guilt . . . Several infamous examples include the considerable number of people throughout history who have claimed responsibility for the assassination of President John F. Kennedy, and the smattering of US government agents who have falsely asserted involvement in the Watergate scandal (1972), or implication in the leak of Sergeant James Barnes’ letters (1966). (President Kennedy’s murderer and the perpetrators of the Watergate scandal were apprehended; the identity of the individual who initially sold Sergeant Barnes’ letters to the New York Times, however, has never been identified.) \n\n\n(Frances, Cynthia, and Neal Lerner. Abnormal Psychology: 5th Edition. 2000. Print.) \n\n—\n“Hey,” Steve says, smiling before he even picks up: the service is spotty, and he has to stand out on the little cramped balcony of their hotel room. “How’s my best girl?”\n“I’m almost a senior citizen, Dad,” Kat laughs, but something in her voice is off.\n“Kat,” he says, suddenly tense: “What’s going on?”\nThere’s silence on the other end.\n“Kat,” says Steve, honestly worried now, “Hey. Talk to me.”\n“Mom’s not doing too well.”\nSteve’s heart constricts, and his mind goes white with panic. “What?”\n“I mean it’s nothing really bad,” Kat continues quickly. “She’s actually totally fine, physically. But she really shouldn’t be living alone anymore, and Joe and I, we wish we could be around all the time, you know that. But the kids are nearly done with high school, and I might have a job lined up in Pittsburgh. We’ve all talked about it. She agrees that she should move in somewhere where they can take better care of her.”\nSteve gives a thick, dry laugh. “No she doesn’t.”\n“No, she doesn’t,” Kat sighs. “But Dad, you’re halfway across the world. She’s at least admitting that it’s the practical decision.”\nGuilt wells up inside of him. The truth of it is that he’s left his family just the way Peggy always knew he would, and for a long terrible moment, listening to his daughter breathe on the other line, he wonders how he could do this to them.\n“I don't know when I’ll be back,” he says, and squeezes his eyes shut: he doesn’t want to hear himself betray them. “Kathryn, I’m so sorry.”\nKat’s voice comes out quiet. “I’m not mad at you.”\n“Okay.”\n“I’m not,” Kat insists. “I get it. Well, no — I don’t get it. I have no idea what it feels like for you right now. But I understand, objectively, why you’re doing what you’re doing. I don’t blame you for anything. Sometimes the universe just has really bad timing.”\n“Sometimes it does,” Steve agrees. “Tell your mother that I —“\n“Of course,” says Kat, quiet, and then: “Hey. I love you.”\n“I love you too, sweetheart. Yeah, bye.”\nSteve hangs up the phone and rests his head for a moment in his hands.\n—\nRomanoff squints at him, ignoring the road. A sheer cliff face speeds past on their left and a steep and rocky green mountain rises to their right. Steve tries hard not to look anywhere but straight ahead. The plastic door handle keeps creaking dangerously under his hand, and for one blissful second he jealously imagines the sweet reprieve of retirement. “You really haven’t seen the Bond movies?” Romanoff asks. “Come on, they’re classics.”\n“Keep your eyes on the road. And no, I haven’t.”\nA teasing smile is twisting Romanoff’s mouth. “They’re funny, Rogers.”\n“What’s the good of being a spy if you can’t joke about being a spy?” agrees Dr. Malik.\n“So I take it you’re a big fan of Dr. Strangelove?” Romanoff asks. Her eyes flick to the rearview.\n“Naturally.”\nA bang-pop-wheeze: screeching. Steve lurches forward and grabs the dashboard, his stomach suddenly in his throat. Romanoff is spinning the wheel and slamming on the brakes, but still the cliff is rushing up to meet them.\n“The wheel!” she shouts, and pulls the emergency brake, and Steve dives for it; Romanoff tumbles into the backseat. Air rushes when the back door slams open. Romanoff covers Malik with her body as they crash out, and he sees a flash of blue: she uses Steve’s shield to break their fall. There’s no time left. Steve turns the wheel, and turns it, and it scuds and hits its limit; at the last possible second he gets his feet underneath himself and launches the full weight of his body at the passenger side door. It rips clean off with a shriek and he tumbles out with it, the asphalt sparking under him. The car sails over the edge of the cliff.\nSteve gets up running. He slips on loose gravel. He regains his footing. The road is empty except for Romanoff and Dr. Malik, battered, alive. Dr. Malik’s hijab is slipping at her shoulder and billowing in the wind, a bright flare of red spotting the muted land around them. Steve takes his shield back when Romanoff offers it out and moves to cover them. He searches the mountains: there’s nothing there. There’s nothing anywhere.\n“The shots came from behind,” Malik reminds him. She breathes heavily and clutches her chest. She isn’t bleeding. Steve follows her line of sight. Nothing: more nothing. Enough plants and rocks to hide behind. Some trees. Steve’s heart hammers. He hopes. He takes a step forward, and rocks beneath his feet crunch: it was a mistake.\n“Get down!” yells Romanoff. The two bangs echo across the rock. Steve catches the bullets on his shield instead of in his head by the skin of his teeth, and he drops to cover Malik. Romanoff spins and opens fire, a gun in each hand. She crouches low, expectant. But the fire isn’t returned. Steve lowers his shield a fraction. In that half-second of vulnerability another bullet is fired. It sails over his head by a hair. He feels suddenly unreal, liminal, his body weightless at the confirmation. He’s here. The Soldier is here.\nRomanoff shoots twice and hits nothing. \u2028\u2028“We’re sitting ducks,” Steve says. “We need an out.”\n“Look around you, Rogers,” Romanoff bites. “There is no out.” Steve doesn’t recognize the expression on her face: he’s seen other people wear it before, but never her. It’s wild and harsh. Her eyebrows are drawn and her breath comes fast. Steve realizes that she’s scared. He realizes that somehow she knows too.\nSteve tries to cobble together a plan. The sniper — the Soldier — he’s waiting and hidden, and he’s going to continue waiting: he has them cornered. The Soldier has all the time in the world. There are few situations where they, much less Malik, escape from this alive. Steve can’t try throwing the shield: Malik needs the protection. The distance is too far besides. But a gun is shoved into his belt, loaded.\n“Hold this over you, and don’t let it up,” says Steve, and he shoves his shield into Dr. Malik’s hands. Then he draws his gun.\nAnother bang. Abruptly Dr. Malik screams. The noise is terrible, a howl, and Steve whips around, ducking instinctively. He sees blood. The Soldier shot, impossibly precise, through the palm of her hand. She drops the shield in pain and shock. Steve opens fire in the direction of the shot and Romanoff throws herself on Dr. Malik. “Do you read me?” Natasha is saying, white-knuckling her comm, trying to stem Malik’s bleeding. “This is an H-64, I need Alpha STRIKE ASAP, latitude —“ she continues, but Steve doesn’t hear it at all. A figure all in black, left arm glinting in the sun, is emerging from the trees.\nSteve is arrested in shock and agony for a second too long. The Soldier fires. Steve fires, aware it will go wide. The American bullet is dodged but two people are hit by a Soviet slug: Romanoff and Dr. Malik go down.\n“Romanoff!” Blood spatters across the road. “Romanoff! Natasha!”\nShe’s alive. Gasping, with her hand closed over her abdomen, but alive, even though the sound of her breathing is wet and sticky. There’s so much blood, too much blood — it leaks between her fingers and onto the asphalt, thick, dark. On the ground beneath her Dr. Malik is unconscious or dead, her hijab staining steadily black; Steve doesn’t know where the wound is, or if there is one at all; if it’s really just Natasha’s blood instead. Natasha, whose green eyes blaze from her paper-white face. Her curls hang over her cheeks, frizzing at the temples. “Go,” Natasha grits, and heaves: “Go!”\nSteve breaks into a flat dash. He can see the Soldier: his arm isn’t covered, and the flash of metal gives him away. He runs up into the thicket of trees, and Steve chases, his legs burning at the incline. No, no, no, Steve thinks, and begins to beg, desperate, frantic: please no, please no, please no. He has to scramble to avoid rocks and ice and sometimes uses his hands. Despite the Soldier’s speed Steve is catching up fast. Intellectually and fleetingly he realizes he could shoot, aiming for a knee or a shoulder. He doesn’t. He runs harder. A flaking red star is painted on the Soldier’s left deltoid. Steve is in Leningrad. Steve is near Odessa. Steve is racing Bucky back to their Brooklyn apartment.\nHe comes up hard and tackles the Soldier to the cold ground, and the dry twigs and leaves and frost crackle beneath them.\nThey grapple. Steve is flipped to his back. The Soldier closes the metal hand around Steve’s throat and the back of his head hits the ground with a thud. The metal is colder than Arctic ice; Steve gasps in shock, and then he’s just gasping for air. He hears an odd, low whirring. Steve struggles and kicks. He’s unwilling to use his gun, still in his hand. He drops it to the forest floor. His hands scramble along the Soldier’s cold arm. The plates shift slickly under his hands. He wedges index and middle finger between his own throat and the metal. The shoulder revs and the hand squeezes. Steve is going to pass out.\n“Buck,” he gasps, and suddenly the Soldier goes still.\n“Bucky,” Steve repeats. His heart is stopped in his chest. The sightless goggles of 1954 stare back down at him. The Soldier’s hair, long and lank, brushes Steve’s face. Steve reaches up. The Soldier doesn’t move. Steve pulls off the visor. The eyes he finds are blue-grey, and wild, and huge. Steve hasn’t forgotten their exact color. He’d been afraid for a while that he had. The dark eyebrows are drawn. Steve feels his heart inside of his chest the way he’s felt stab wounds. This is Bucky, looking back at him, here. It’s been sixty-four years. His body is cold. His body is a weapon. They’re both weapons; it doesn’t matter. What matters are his eyes. Bucky is afraid. He’s terrified.\nSteve only knows one word. “Bucky.”\nBut suddenly, inexplicably, his face is wiped clean. The Soldier grabs him by the lapels of Steve’s jacket and slams his head into the ground. In the second before unconsciousness, Steve hears it: “Хайль Ги—“\n—\nThe noise is tinkling and quiet, small pinpricks of sound in the still of the familiar London night: he plucks out a listless tune at the piano with his thick calloused fingers.\n“We gotta be going,” Steve says.\n“Hmm?” Bucky asks. A cigarette is in his mouth. He smiles, and he doesn’t look at Steve. Instead he watches his own fingers trip over the keys. He drawls, “Ju-u-ust a second, Rogers.” The song is familiar. Bucky hums along. At first Steve recognizes it as an old war song: the Battle Hymn of the Republic. But Bucky isn’t singing those words; instead Steve hears the bloody rendition of the same tune that he learned during their brief SSR-sanctioned stint in paratrooper training.\n“Is everybody happy?” Cried the sergeant, looking up\nOur hero feebly answered “yes” and then they stood him up\n He jumped into the icy blast, his static line unhooked —\n“C’mon, Buck,” says Steve, though he doesn’t particularly feel his mouth moving. “I’m tired. I’m so tired my bones hurt. I’m so tired I can’t even stand. Let’s get out of here. There’s nothing here; it’s all gone. Let’s go.”\nThis pub was bombed in a time far away. The stools and chairs and tables are in splinters. Shards of broken glass glint green in the dim yellow light. There might be limbs in here, somewhere. Bodies. Steve remembers this pub. Steve remembers heaving himself over this bar, groping around for the booze; he remembers that chair, he remembers collapsing into it; his vision is blurred, his throat swollen and thick; he feels sick to his stomach; he was sick to his bones…\nThe piano is in tatters. Its wiry guts hang out and the ivory spine is broken. But still it plays. Bucky croons along.\n\nHe counted long, he counted loud, he waited for the shock — he felt the wind, he felt the cold, he felt the awful drop. \n\n“You should’ve gone home,” Steve says. “I never meant to leave you in the war.”\n“You never meant to do a lot of things,” Bucky reminds him.\nThere was blood upon the risers, there were brains upon the chute; intestines were a’dangling from his paratrooper suit. He was a mess, they scraped him up, they poured him from his boots — and he ain’t gonna jump no more. There was a proper way, Buck told him once, to delivering this last refrain. Jesus Christ, how they laughed and elbowed at each other, and finally finished it off with immense dignity, harmonizing impressively:\n\nGory, gory, what a helluva way to die;\nGory, gory, what a helluva way to \n\nSteve blinks awake, Bucky’s low laughter in his ear. A heart monitor beeps, and he fumbles for a moment with his arm, fingers scrambling until he can pull it off; then it flatlines. Someone left the radio in the room on, a sports cast — baseball — and the noises blare together as he stumbles out of the bed and into his clothes, pale with mountain dust and folded on a chair; he pulls them on, and then he stumbles again out into the hall. It must be night, he thinks, and when he finally runs into a nurse —\n“Captain Rogers —“\n“Romanoff — where’s Natasha? Where’s Agent Romanoff? Is she okay?”\n“Sir, she’s fine — sir, she’s alright. I can take you to her, if you want.”\n“Okay,” Steve agrees. He still feels shaken and disoriented from the dream, unsure of where and when he is. For a dizzy moment all he can think of is how much he wants to call Peggy, to see her face, her smile. Then he remembers: Natasha. “Okay. Thank you, ma’am.”\nHer room is down an adjacent long and narrow hall. The pale moonlight streams in through the window and across her hospital gown. When Steve walks in she tries to sit, and then grits her teeth, blanching. Steve reaches to call back the nurse. Natasha says, “No, it’s fine.”\n“How are you feeling?” Steve asks, and sits in the chair by her bed.\n“Like I took a slug to the stomach.” She looks at him with narrowed, sharp eyes, and he feels he’s being dissected and reassembled, like a puzzle. “Don’t stall, Rogers. Ask me.”\nAlright, thinks Steve. Alright. He’s surprised with how quickly fire sparks inside him. “How did you know?” he demands.\n“Know what?”\nSteve makes a sharp noise. “Don’t give me a challenge if you can’t step up to the goddamn plate and bat.”\nNatasha is silent.\n“I fought by Bucky’s side for two years,” Steve says. “That reflex, that style — I’d recognize it anywhere. But back in Leningrad, in the ’50’s, he fought differently. He didn’t have a rifle. You read that report; I know you did. I didn’t have one single goddamn reason to mention the Soldier’s marksmanship. For all we knew he was just a skilled assassin, not a sniper. And that’s the only account of the Winter Soldier in the archives.”\n“So? I don’t understand.”\n“If your knowledge was based on SHIELD intel alone, you wouldn’t have the first idea about his skill with a rifle. But I saw you in the field. You recognized it.”\n“The Winter Soldier has killed over two dozen people in the last fifty years. He must be pretty good with a gun if he shot JFK. I don’t know why you think I know everything, Rogers.”\nThere’s a long silence. Natasha’s green eyes are guileless and blank. Unfortunately, the truth is that no one can trick Steve anymore.\n“You said you didn’t know him,” Steve tells her.\nNatasha replies, “I lied.”\nBefore Steve knows what’s happened he’s standing. He turns and clenches his hands into fists. For one terrifying, harried minute, his vision flashes white. Then the wall and the little plastic chair in the corner come back into focus. He takes a breath. “Natasha,” he says. But he doesn’t know how to follow it up. He turns back. “Natasha,” he tries again, and has to look down when his voice cracks.\n“You’re no good at this.” She’s annoyed. “You should be bargaining with me. You wear your heart on your sleeve. It’s going to get you killed.”\n“Surprised it hasn’t already,” Steve confesses. He saw his eyes; Steve looked into his eyes. He was there — he was right there. Steve touched him: not the Winter Soldier, but James Buchanan Barnes. He knows it inside of his ancient bones. “Please tell me. Natasha.”\n“It was the late ’80’s or early ’90’s. I was young.” Natasha confesses. “I was never told his name. I don’t think anybody knew it. He trained us for a week.”\n“Who’s ‘us’?”\nNatasha shakes her head sharply. “Not relevant.”\n“And that was the only time you saw him.”\n“No,” Natasha says, very quietly. “I saw him once more, years later. They wanted him to train me again. No one has ever come so close to killing me before. He taught me what I know.”\n“Why did you lie?” Steve asks.\nNatasha takes a breath. She doesn’t answer. It was a stupid question, anyway. Steve says, “Before he took me out, he said something. It was hard to hear, but I heard it in Kiev, from an agent last year. It sounded like —“ Steve digs hard into his memory. “Ха — Хай—“\n“Хайль?” asks Natasha.\n“Maybe. What does it mean?”\n“It means to…to salute, but in a way that’s formal. A greeting. Rogers,” she says. She fixes him with her eyes. “I’m not going to do that again. Alright?”\nSteve nods. So he’s alone again. He’s been alone for decades; it doesn’t matter. “Understood.”\n“No, that’s not — Steve. I’m not going to endanger a civilian that way again. She’s in critical condition because she had no idea. That’s not something I’m comfortable with.”\nSteve stares at her for a long minute, speechless. He’s started to recognize times in his life when things are going to change, make-or-break minutes where whatever happens redirects his trajectory in a way there’s no going back from. The day he met Buck, the morning he met Peg; the night he saw Neil Armstrong walk on the moon from a motel in Little Rock. And now this: Romanoff, offering out the olive branch. There’s no going back from this, just as there was no going back from any of that.\n“Understood,” Steve repeats, softer. Natasha tries to shift, and winces. Steve reaches out. “Hey, seriously — let me get a nurse.”\n“That would be useless,” Natasha grumbles, and somehow the mood is lifted. “I hate useless. How about you get my clothes instead?” She quirks a wary smile at him, and he goes to get her things.\n—\nTO: DIRECTOR\nFROM: ██████████ █████, PHD\nACTION: PZV (PHASE-2)\nSTATUS: INITIATED\n11 NOV 63\n\nSUBJECT: Operation successful. The weaponry has been effectively updated and now includes increased mobility and improved strength. Fine motor control increased. Balance has also been improved by injecting ████████ in a manner that reinforces the spinal cord, which will also prevent the extensive tearing that occurred on past missions. (External reports 6A-1 and 6A-2 contain transcript of communication between Colonel William ███████ and Dr █████, detailing Colonel ███████’s consultation, as well as the consultation of Obadiah █████ regarding weapons technology and enemy intel.) \n\n\nRecalibration of Subject █ was then performed by Drs █████ and ████, and initially appeared to be successful. Subject █ was shown its target and the mission objective was explained. Subject █ remained controlled and silent. Following this briefing, Agent Ivan █████████was discussing with Operative ███████ the plan of infiltration. It was mentioned that Subject █, escorted by Agent ██████████,would travel through the cities of ██████, ██████, and ██████, finally crossing the ██ border by making land in the borough of ████████, ███ ████. Subject █ became inexplicably enraged and could not be contained. Subject █ strangled Operative ███████, killing her. Three approaching members of the security team were beaten, dismembered, and choked until dead. Agent ██████████, with the assistance of Dr █████, was finally able to sedate the asset. Subject █ was punished accordingly. The incident will not be repeated. \n\n\nA second recalibration then occurred. The mission debriefing was repeated with no further incident. In light of these developments PHASE-2 has been initiated, now in full effect. Accordingly, Subject █ will be referred to as the operative known as ███ ██████ ███████. It is, without a doubt, our greatest creation. \n\n\nDespite numerous setbacks, the ███ ████ may finally label Project ██████ ███████ a success the likes of which has never before been accomplished. Operation ██████ will continue as planned with same-day extraction occurring 22 Nov 63. \n\nIn Natasha’s neat handwriting on the bottom of the copy of the file: I have translated this to the best of my ability. It is the only document I have been able to recover. It appears to have been declassified within the Red Room exclusively. Even their own agents were kept in the dark.\n—\n“You’re no good to me like this,” Natasha says. “Have you slept?”\n“I get by on catnaps,” Steve tells her.\n“Rogers —“\n“We’re so close,” Steve murmurs. “Jesus, we’re so close — I know it. Natasha, I know it.”\n“Okay.”\n“You have to believe me, I know it, I know we can —“\n“I believe you, Rogers. I said I believe you,” Natasha says, and he can hear the worry in her voice.\nSteve wishes he could scratch at the blacked-out words like a lottery ticket to reveal the truth of it underneath. Natasha rests her hip against the desk, leaning close to see the document again. Her torso presses to his shoulder. She reads it by the single light in the SHIELD office, and then points at the beginning of the second paragraph, her fingernail pressing against the name Agent Ivan █████████. “That’s Ivan Petrovich. You can scratch him off your Most Wanted list; he’s dead now.”\n\u2028“How do you know?”\n“I killed him.”\nSteve blinks. “Is there anyone else you recognize?”\nNatasha points higher on the document where Steve has made an annotation. “There. I think you’re right. It has to be Zola.”\n“What about this guy? — the Colonel. William’s not a Russian name. It doesn’t add up, Natasha. Did the Red Room have any sway over the Americans or the British? It says he consulted.”\n“Not to my knowledge,” Natasha says. “But I don’t think it would be a bad idea to look in the paper archives. See if there’s anything out of the ordinary. Comb through for the names, you might find something useful. Human experimentation was obviously pretty popular for a while.”\n“They keep trying to recreate what Erskine made,” Steve agrees. A terrible desperate itchiness is living now under his skin. It manifests in trembling fingers, but his eyelids droop in spite of it; Jesus, Steve wonders: what’s wrong with me? He taps at his knee and says, “They don’t goddamn learn.”\n“It worked on you.”\n“And it worked on Schmidt, too. And that scientist who wrecked Harlem. I don’t know anymore that it was such a good idea in the first place.”\n“Second verse, same as the first,” she murmurs.\n“Natasha.”\n“What?”\n“How many men,” says Steve, “Do you know named Obadiah?”\n—\nFor miles and miles: the hum of the road and the hum of the bike. The countryside rushes by in muffled whispers; the longer he drives the further away the horizon seems, its vanishing point smudging in the murky navy dusk.\nSHIELD archives sprawl across the country, tucked in rusting midwestern storage sheds and coastal, ivory bank vaults. Accordingly, in blue Iowa, Steve stares down the squinting proprietor of (1-800) U-STORE.\n“I’m here for unit 714A,” Steve says.\nThe guy keeps squinting. Steve reaches for his wallet and slaps his ID to the plastic partition window.\n“No,” says the man darkly, with a voice like creaking floors. “I know who you are.”\nSteve juts his chin. “Great. You gonna let me in?”\n“That honorable discharge you got in ’66?” He works his jaw. “It shouldn’t have been honorable.”\nSteve has nothing to say to that. Still glaring, the man finally pulls up the gate and hands him the key. Steve thinks of it while he searches the rows for his unit, even though he’s long been used to it. He even knows the story: grew up in a dusky town palming over coins for comic books, and then shipped to Vietnam, lottery or enlisted, either way. There was swamp and guts. He painted WAR IS HELL on his own helmet in mud after one of his own was yanked into the sky and strangled in a booby trap. Worse, he came home to see his favorite Howling Commando splashed luridly across the Times, an idol destroyed. Steve knows how it went. There are even entire memoirs about it, where Buck’s letters provide the narrative turning point, and then it descends into disillusion.\nUnit 714A is near the back, pushed up against a high fence and miles and miles of yellow grass and field. The door is old enough to take a little strength to open. Inside are stacks upon stacks of filing cabinets and document boxes. There’s no rhyme or reason to how all of them are organized. Only a select few must know how to navigate this one.\nHelpful.\nAfter half an hour on his knees, nose itching from the dust, Steve unearths a soft brown box. Tucked behind a shelving unit and bent inward all along the left side, it’s labeled SSR —&gt; SHIELD 1944 49. A stillness settles over Steve: the stillness of the moment between the insult and the punch. Reports from that far back aren’t relevant. He needs the 60’s. Still, inexorably, he reaches out. The papers are yellowed and cracked, some water-damaged, most of the ink severely faded. He starts in 1949 and searches through time, unfolding history backwards. The bomb; Okinawa; clean-up in Europe. Steve recognizes Peggy’s handwriting, and then his own. Phillips’ signature, God rest him. 1946: October, September, August…1945. Two documents in. Steve’s hand stills above the dried paper. Mission report. Date, addressed-to, location; target, time, route. Steve remembers the click of every typewriter key. The final section, ADDITIONAL, and in Steve’s writing: Sgt. James Barnes confirmed █KIA.\nHe had typed the letter “M” first. He stared at it and stared. And then, suddenly, he tore the sheet from the typewriter and slammed it to the table; he began to scratch the “M” out with his pen so hard that the ink bled through to the cheap wood underneath, staining it for good. He touches the pad of his finger now to the back of the page: it’s still distorted and raised.\n“Sorry,” says Steve, for the millionth time in his life: but it’s redundant by now, to keep saying sorry, and to still have made no progress. It’s shameful.\nSteve scrubs a hand over his face. He shoves it back in, and keeps flipping through, his fingers stumbling over a Professional and Conduct Record, useful primarily for roll-call. The pages are organized into five columns down: name, serial number, rank, status. Automatically Steve’s eyes skip down the page. Barnes, sir, he thinks distantly, hearing rain splat on a tent one hundred thousand years ago, one hundred thousand miles away. B-A-R- . . .\nBARNES JAMES B      32557038      SGT     MIA\nSteve’s spine begins to prickle.\nIt’s a clerical error. That’s all. Someone was confused, or trying to be kind, or it was filed immediately after; they hadn’t read Steve’s mission report. And then Steve looks back to the top of the page. Red ink is stamped across it. In big letters it reads FINAL P&amp;C RECORD. STRIKE UNITS 1-5 DECOMMISSIONED 45.\nAnd then another note, scribbled in cursive handwriting: Reviewed by SHIELD 1946.\nThat explains it, then, thinks Steve. The SSR was changing hands to SHIELD from ’45 to ’46; of course there are some errors in accounting, and inventory errors too. It was a big changeover. Some confusion is natural.\n“That explains it,” tries Steve again.\nHe finds his own 1954 mission report from Leningrad — Soviet was uncommonly strong, fast, had a metal — what he needs is 1963, and documentation of the President’s assassination; what he needs is a name, Colonel William Maybe-Seven-Letters.\n1968 surfaces first.\nVietnam: covert infiltration. He skims through the body of text quickly. Under STRATEGIC, it references the Alpha Reports: Steve and Bucky wrote those exclusively. They were top-level. Even after 1966 they remained on the syllabi of classes at West Point.\n\nREFER A-2-44.\nFILED BY: SGT BARNES J B, 32557038, MIA 45.\n\nA-2-44. Alpha 2 1944. Steve squeezes his eyes shut, trying to remember. Bucky did write that report. 1944 was the year Steve took a knife to the throat. Something with Morita’s field kit…the brass was angry. They had been in London. Steve had to badger Bucky to get it done, and in turn Bucky badgered Steve to hit the town. And then there was dancing, and the pretty blonde girl Buck had taken home…\nThis young Captain, whoever he was, must have been reading up on how the Commandos toppled those odd labyrinthine HYDRA bases.\nKneeling, Steve holds the 1946 P&amp;C beside the 1968 mission report. It could be a mistake, he rationalizes. Another mistake — Steve would bet anything that the junior agents talk about Buck sometimes, and that when they do, KIA and MIA are interchangeable. It’s not like Steve ever found a body; it’s not like Steve ever looked. (Sorry, sorry, sorry.) He frowns, reading up from the bottom. Finally his eyes find the top of the page.\nTO: COLONEL WILLIAM STRYKER\nFROM: CAPTAIN ALEXANDER PIERCE\n—\n\nThe Norwegian Nobel Committee has decided that the Nobel Peace Prize of 2001 is to be awarded to United States Secretary of State Alexander Pierce for his success in attaining and maintaining peaceful contact with the Russian embassy, and for compassion in both policy and sentiment to the Middle East during times of adversity and crisis. In reaching out with repeated and respectful insistence to fellow political leaders, Secretary Pierce has contributed to the realization of the “fraternity between nations” that Alfred Nobel sought and listed as one of the criteria for the Nobel Peace Prize. \n\n\n(The Nobel Committee. Nobel Peace Prize. 2001. Web.)\n\n—\nThe Memorial Wall, constructed of a smooth and patient grey stone, is so massively long that it follows the curve of the building. The names on it are listed chronologically, not alphabetically; this is so that there is plenty of blank space on the end, and room for more slabs of rock to be added in the future. Eventually, Steve thinks, it’ll bleed out onto the street, and then across the other way, underwater, and they’ll have to start building it into the river.\nThe very first name, in square embossed lettering: James Barnes, 1945. KIA.\nSteve fixes his cap on his head. There’s only one explanation: he’s lost it. Jim is probably having a good laugh at him from beyond the grave. He’s ninety-one years old; it was bound to happen eventually. But still; still. Steve’s eye is sharp for patterns. The two files that mark Bucky as MIA are classified. And Steve’s report from ’45, and this, the memorial wall from ’91…those are open to the public.\nSuddenly, strangely, Steve thinks of Peggy. Invariably, she always said to new recruits, There are three truths: your truth, my truth, and what has really happened.\n“Colonel.”\nSteve jerks and turns. Before him is a man in a finely constructed blue suit pushing up his glasses. His hair is light, and his face is aging handsomely; his nose is long and aquiline, his jaw strong, his eyes clear blue.\n“Alex,” Steve says.\nAlexander Pierce nods to the wall. He smiles in a way that isn’t smiling; Steve doesn’t know how he makes his face work that way. Pierce looks sympathetic and understanding and distant and official all at once. It must be exhausting to maintain. “A day for remembrance?” He asks.\n“Oh, you know. It’s just been a long week, I suppose.” Steve has lived in nuclear winter for six decades. His patience, strung up so precariously inside of him, snaps out loud. Recklessness: this he’s used to. “Actually, it’s convenient that you’re here. Is it right that you knew Colonel William Stryker, back in the war?”\n“My commanding officer,” Pierce replies, and looks to the Memorial Wall. He walks along it, two steps down through the decades, and points. “Here. He was a good man. Died in the line of duty.”\n“Involved in Soviet relations?”\n“Certainly.”\n“How’s that?”\nPierce’s face does something complex and quick, as though he’s had to recalibrate. Then he smiles again. “I’m not sure I know what you mean.”\n“How was he involved in Soviet relations? I understood that he fought in Vietnam.” They stand closer to one another now, mirrored. He and Pierce are the same height.\n“Stryker was involved in remote nuclear operations.”\nYour truth, my truth…\n“And the Red Room,” Steve says.\nSunlight streams in through the massive glass windows and glints along the names on the Memorial Wall. Around them agents walk through the lobby, past the statue of the eagle insignia, around the H. Stark Memorial Fountain, distantly spitting water, flecked in gold. Steve’s heart swallows up his throat, thundering. Sunlight catches Pierce’s glasses, and for a moment his eyes are entirely obscured, white. Then he folds them away into this pocket. His expression does not change.\n“You’re not a good man,” says Steve. “Are you, Alex?”\nPierce is angry. He tamps it down, but Steve sees, for one pure moment, outrage. “I’m a man who knows compromise. I’m a man who is willing to make the difficult decisions. I’m a man who shaped history, Colonel — frankly, unlike you.”\n“Who do you work for?” Pierce laughs in his face, and Steve leans close. “There are two hundred people here. I don’t know if they’re with you or not. I’m not going to do anything.”\n“You’re a good liar,” Pierce says, still chuckling. “You’re a good liar, Colonel Rogers; nobody’s going to deny that. But you weren’t always a good liar.”\n“Who do you work for?” repeats Steve.\n“Our enemies are your enemies. Disorder; war; chaos.”\n“I only have one enemy right now,” Steve says. “I’m looking at him. A guy I thought I could trust. Tell me who you work for.”\n“A good greater than any of us. Look — you know what war is like. You know that war is hell. It’s only a matter of time until a dirty bomb goes off in Moscow or an EMP fries Chicago. But we have a plan — a long-term goal. We can finally achieve peace. Isn’t that what you want? What all of us want?”\nAchieving peace; control over chaos. The words, at first couched in Pierce’s rhetoric, suddenly reveal themselves entirely, and Steve remembers in exact clarity the red flags that hung bloody and torched from bombed-out apartments across Germany and Austria. He thinks of the massive TOD DER LÜGE posters, some hanging on brick buildings, others crushed into the mud underfoot, the pale Nazi fist choking the snake in an infinite fit of righteous fury. Death to lies, after all. What really happened? Хайль: a salutation. And so the truth unspools before Steve: the fleshy, sprawling, cancerous meat of it; and history, finally, has unraveled itself at his feet.\n“How many?” Steve asks.\nPierce smiles, genial, and then it drops from his face. He says, “Well. Everyone, Colonel. It’s everyone.”\nIn a burst of movement Steve grabs Pierce’s head in his palm and cracks it twice against the Memorial Wall. Pierce crumples, bleeding; there’s a commotion, yelling from bystanders, and Steve breaks into a dash across the building to the elevators and the stairwell. He’ll climb the building if he has to — Fury needs to know, and he needs to get out. Steve scales the skinny gray stairs, the door slamming behind him, skipping five and six steps at a time, tenth floor, twelfth, fourteenth, crashing into the walls from the force of his momentum.\nThey burst from the door on the seventeenth floor, five of them. Steve flips one directly over the rail, tumbling down into the stairwell, and shoves another down the immediate flight of stairs, head-first. He slams the head of the third into his knee, but trips over the body; suddenly he’s rushed by another, crashing into the wall. Steve hurls him around and smashes the man’s head into the concrete and blood smears across it. There’s a crackle, and a prolonged hum. Steve hears the noise buzz close to his ear like a wasp, and then the rod crashes against his head, jolting him, spotting his vision white, rattling his teeth, lighting up his spine.\nRumlow stands across him. He flips one of his crackling batons around in his hand.\n“Aw,” he says. “Don’t give me that face. C’mere.”\nRumlow fights like a feral dog: snarling, snapping. He enjoys himself ferociously. He dodges two consecutive punches and grabs Steve’s wrist before he can try to land a third, and then he sticks him with the rod, digging it between his ribs. Steve yells — agony ripples under his skin and his vision whites out. Rumlow laughs out loud, a noise that comes from deep in his throat. “Did that hurt?” he asks. Steve cracks their skulls together. Rumlow reels back but doesn’t release his wrist, and instinctively Steve opens his mouth and bites him. Rumlow is fast. He swings the baton and it cracks Steve across the head: he feels the white pain, and the terrible deep burning, and then he lands on his knees.\nRumlow swings the rod near Steve’s cheek. Steve jerks away, but Rumlow doesn’t strike him with it: instead he holds it close, and tilts his head down to look at him. He kicks a steel-toed boot casually against Steve’s side, twice. “We’re gonna have some fun today, aren’t we?”\nSteve whips his hand out and yanks Rumlow’s ankles out from under him. They grapple on the concrete. Rumlow realizes that Steve is stronger than him, and abruptly he becomes wily, slippery, and he wrestles himself on top and takes a rod in both hands. He slams it against Steve’s throat, yelling in pain: it’s electrocuting him too. For one horrible moment Steve is frozen, not breathing. He feels an incredible white numbness, his limbs jerking, and then he throws Rumlow off of him. Steve slugs Rumlow in the jaw and smashes his head against the ground and stumbles to his feet. He kicks him in the ribs, once, twice.\n“Fuck,” Rumlow gasps.\nSteve grabs Rumlow by the straps of his uniform and hurls him bodily into the wall, furious. He struggles, kicks, but Steve grabs his head and slams it to the wall, hard enough to stun him. Thick black blood drips from his dark hairline down his forehead. He turns his head and spits red onto the concrete. He works his jaw. He spits a tooth too. Then he looks back to Steve and juts up his chin.\nSteve frisks him. Two guns, two knives — boot, thigh — and both the rods.\n“This is easy, Rumlow,” Steve says. “You don’t tell me what you know, I’ll kill you. You do tell me —“\n“You’re really bad at the monologue.”\nSteve inspects Rumlow’s cattle prod. The decades pass, the people change, but the weapons of brutality always stay the same. Buck told him about these: HYDRA really liked sticking their prisoners with them. He finds the switch and it hisses and crackles to life beneath his hand, zinging blue all over.\n“Relax,” Rumlow advises carelessly. “Come on. You ain’t the torturing type.”\n“You know, it’s kinda funny you say that. I haven’t really been feeling myself lately anyway.”\n“Everybody knows it wasn’t you who did any of the real work back in the good old days, sweetheart.”\nSteve is familiar with all kinds of anger: back-alley anger, war-anger, humiliation-anger, revenge-anger. He’s never felt anything particularly like this. The rushing in his ears and the hot itch under his skin threatens suddenly to boil over. This is rage. He almost doesn’t recognize his own voice when the words come out.\n“Where is he.”\n“Who’s that?”\n\u2028Steve sticks him with the rod. Rumlow screams, a sound that Steve hasn’t heard from a grown man since 1945. It tapers off into a wheezing, gasping chuckle. Rumlow’s skin pulls strangely across his skull when he grins, and he tilts his head back against the wall. “Who you mad at, huh?” he asks, panting. “Who you so fuckin’ mad at, big guy?”\n“Don’t you fuck around with me,” Steve says, low. “Where are they keeping him? Russia? Ukraine? Tell me.”\n“I can take pain,” Rumlow says. “You can beat the hell out of me all goddamn day, you’re not getting shit. Go on. Go on, Cap. Go on. Let it out. You’re so pissed you’re gonna burst a vein. I’m right fucking here. Go on.”\n“I know you,” Steve says. “Quit tryin’. You’re all the same, men like you.”\n“And yet we just keep on coming,” Rumlow tells him. “Tell you why.”\n“Spare me.”\n“Cut one head off…”\n“Nothing ever lasts forever, Rumlow.”\n“Yeah,” Rumlow agrees, looking thoughtful. “Nothing except you. And goddamn, did we try. Since 1943, that far back, HYDRA’s been tryin’ to bash your pretty face in. Time’s up, old man. You think I don’t got any back-up coming? Either way, Stevie…you’re shit out of luck.”\nSteve doesn’t know what shows on his face, but it must be something, and that something must be bad: Rumlow’s dark eyes turn pleased.\n“Oh, what?” Rumlow asks. “What’s that, you don’t like me saying that?”\n“Keep your goddamn mouth shut.”\n“You know,” he says, “That was always the funniest part. It was a tight plan, you gotta hand it to whoever came up with it — you really, really do.”\nSteve’s spine goes stiff. Dread tugs inside his belly, at his guts. “What?”\nRumlow gives a shrug and jerks up his chin again. “What?” he echoes, innocent.\nSteve shakes with impotent rage. Rumlow’s eyes glint: he’s so glad to see it. The silence stretches and stretches. “You like to play with your food, don’t you?” Steve asks.\nRumlow’s accent is already New York thick. It wiggles right under Steve’s skin. “Never told another soul this, and I guess I never will, but I think of that one ora—“\nSteve sticks him with the rod again. This time Rumlow grits his teeth and doesn’t make a sound, all the tendons and veins in his neck bulging. He comes up laughing like before. “— that one orange, that one evening —“\nSteve finds that he’s shaking, very finely, all over. “What the hell are you getting at?”\n“Oh, what?” Rumlow spits, disbelieving. “What, you really think that the personal belongings of a national hero got leaked, just like that, no help from the inside? With no involvement from us? You think accidents still happen, in a world like this? You really believe that, you fucking moron?”\nSteve’s throat closes. He feels his fist tighten around the rod.\n“History didn’t wanna cooperate,” Rumlow says, “And so history got changed. And it worked. It really worked. Jesus, they hated you. They hated you then and plenty of people still hate you now. A whole country turned on its own poster boy. How’s that? You should see him now. That just might be the best part. Rub his nose in ‘em; he wouldn’t even recognize his own goddamn —“\nThe hit falls so hard that Rumlow’s face sizzles and then cracks against the wall of the stairwell. Steve drops the rod.\nFor a moment he stands over them, STRIKE Team Alpha, his chest heaving, his vision blurred. Then he turns and runs again up the stairs, faster than before, his heart pounding in his thighs and his temples and his throat. Finally Steve is on Fury’s floor. There’s no time left. He dashes from the stairwell and down the hall to his office. Footsteps echo behind him, further back in the hall; Steve can tell by the heavy sound that the men are armed. He bursts into Fury’s office.\n“Nick —“\nNo one is there. The other STRIKE team is coming up on him, fast.\n“Give it up, Rogers!” One yells, at a muffled distance. “There’s nowhere to go! Don’t be stupid!”\nSteve looks between the dark figures approaching and the wall of Fury’s office, entirely glass, that glances out forty stories above the Potomac.\n“Who, me?” Steve asks.\n—\nHe swims hard and he runs hard; he trades out the wet clothes for dry at a Target, and with a hoodie pulled up over his head takes the back way to the apartment he rents. Jogging up three flights of stairs gives him enough time to plan: he’ll call Nick, Kat, and Peggy in that order, and then he’ll find —\n“Rogers,” Natasha says. Her brows are suddenly drawn, and he watches her quickly catalogue the blood in his hair that he couldn’t quite get out. “Rogers? Why are you—”\n“Don’t move. Give me the gun.”\nNatasha’s eyes are narrowed into slits. She stares at him for a long and breathless moment. “No,” she decides. She pulls her weapon.\nSteve expected this. He warns, “Drop the gun, Romanoff.”\nNatasha steps closer, and her Glock is suddenly pointed directly at his head. She asks, “Where’s Fury?”\n“How do I know that op was legit?”\n\u2028\u2028“What?” \u2028\u2028\n“You show up after two months of radio silence the second everything goes to hell. Were you even really on an operation?”\n“Do you watch the news?”\n“Tell me about the operation.”\nNatasha huffs. “Tony Stark blew up two places starting with an M in alphabetical order.”\n“Is he okay?”\n“Would I be here if he wasn’t?” Her voice is raising. They stare at one another. The moment stretches. Quietly she confesses, “I think I know where they’re keeping the Winter Soldier.”\nBefore Steve realizes what he’s doing he’s slammed her into the door of his apartment, gripping hard at her shoulders. “How,” he says.\n“I pulled a favor.”\n“Romanoff —“\n“I went to the rendezvous point to report the termination of the Stark operation to Fury, but there was no one on the line,” she says, hushed. Her eyes dart between his. “I couldn’t get a hold of Barton or my handler. I stopped by HQ and it was in chaos. I infiltrated but Fury’s office was empty. I checked Pierce’s and it was empty too. So I hacked into his files —“\n“You can do that?”\nNatasha gives him a look. “I hacked into Pierce’s personal files. His email was the usual. But then I found something strange.” Cautiously, slowly, Natasha uses her free hand to reach into the pocket of her jeans and pull out a slip of paper. She unfolds it and holds it up for Steve to read. 38.88° N 77.00° W. “Coordinates. The email was deleted, but I dismantled the hard drive and recovered the contents. It was sent to three separate burner accounts that I didn’t have time to trace. Even if it’s not where they’re keeping him, it’s the only lead we have.”\nSuddenly Natasha becomes very still. She reaches inside her jacket and procures a big plastic bag. Inside of it is a plain brown leather journal, incredibly weathered, paling at the corners in its old age. For a long moment Steve doesn’t recognize it, and then he experiences something abrupt and bizarre. He remembers what it looked like the day it was bought, and he sees it held in a pair of big, capable hands. For a second he even smells their apartment. When he blinks he finds his eyes are wet.\n“Pierce’s office,” she says softly. “They were hiding it in plain sight.” She puts it into his hands because he hasn’t figured out yet how to reach for it. Her hands fold over his so that he won’t drop it, reminding him how to curl his palm and hold his fingers. Then she pulls away.\n“SHIELD’s compromised,” says Steve at length. “Pierce, the STRIKE team, all of them, they’re HYDRA. It was growing inside the Red Room. It’s been here for decades. It’s been here all along.”\nNatasha’s eyes are wide. Suddenly she snaps into action. “You need to change clothes; get a new ride,” she says. “Come on. Right now. Go.”\nThey steal a neighbor’s car.\n“Natasha —“\n“Get in.”\nSo Steve hot-wires the little beat-up sedan as Natasha throws their gear in the back and climbs in. Steve pulls out his phone. Then he jumps about six feet in the air when Natasha’s hand darts out and grabs it from him.\n“Who were you calling?” she asks.\n“What are you —”\nNatasha’s quick hands have Steve’s phone flipped open now, scrolling through his contacts. “J, K, N, P, T. You only have five contacts in your phone? Is the N me or Nick?”\n“Natasha,” says Steve, exasperated.\n“You can’t afford to trust anyone right now,” Natasha tells him. Her voice is abruptly flat and serious. “Director Carter —“\n“— Is my wife, and I gotta make sure she’s safe,” Steve finishes. He holds out his hand.\n“You can’t tell her what’s going on,” Natasha says. She finally hands the phone over. “It’s too dangerous. We need to make a clean getaway, and I wouldn’t doubt that your line is tapped and has been for a while.”\nStill he pulls out of the lot at a regular speed, nothing too suspicious, and calls Peggy’s number. He experiences a minute of pure, undiluted terror when a completely unfamiliar voice picks up.\n“Carter.”\nWait — not completely unfamiliar. Steve nearly pulls his phone away from his face and runs them straight off the road. “Sherry?” \n“Hey, Uncle Steve,” sighs Sharon, on the other line. In the passenger seat Natasha is raising an eyebrow at Steve’s incredulity, but he really can’t help it; Sharon sounds grimly serious in a way he’s never heard from her before. “I’m glad you called: all the numbers in Aunt Peggy’s phone are under fake names. She’s fine, by the way. We’re in a secure location, and Director Fury has been in contact. Expect a call.”\nSteve flounders for a second. Finally he says, “You told me you were going to nursing school. I sent you a congratulations card!”\n“In my defense,” Sharon tells him, after a guilty moment, “I am posing as a nurse.”\n“Oh, my God.” What is this, he’s got a whole family full of spooks now? Thank God Kathryn and Joe’s kids take after their parents and were born with absolutely zero aptitude for intelligence: Steve doesn’t know if he could handle the stress. “Fine. You call if you need me.”\n“Roger,” Sharon says, and hangs up on him.\nSteve scrubs a hand over his face. He drops the cell and it clatters into the plastic barrier between the seats.\n“Everything alright?” Natasha asks, an eyebrow raised.\nSteve is far and beyond not in the mood. “You gonna tell me where we’re going?”\n“We need to lay low and figure out our next move,” Natasha says. “They’re after you, and once somebody notices the state of Pierce’s office, they’re going to be after me. It’s a four hour drive to my safe house.”\n“And where’s the safe house?”\n“Brooklyn.”\nBrooklyn. The great and terrible weight of home.\n—\nThey were the ones who did it, Steve thinks, and somehow it makes the hurt less. Bucky got the draft because the world is sometimes a cruel and unusual place, but his letters weren’t leaked in a similar act of cosmic unluckiness. There was a purpose behind them: it was done to hurt Steve and to fracture the spine of the nation. There was purpose to it. Steve is used to getting hit as punishment. He understands it. All of this, all that happened to Buck, to Steve, to Steve’s family — it wasn’t just misfortune. That’s comforting. It’s better than if it were just misfortune. The waters have been muddied for so very, very long: Steve is relieved, in a way, to finally know the enemy again.\nEventually the steady pound of the midnight pavement beneath them lulls Steve to numbness. He hears it in the whoosh of each passing car, the thrum of the tires: Brooklyn, Brooklyn, Brooklyn. They near up on Newark and Natasha curls up with her legs underneath herself in the passenger seat, her head resting against the back of it; Steve might think she was asleep if he couldn’t feel, very acutely, her eyes on him.\n“What?” he asks, after a while; after he’s come back to himself.\n“Who taught you how to make a disguise?” Natasha asks. Her voice is hoarse and tired and gently amused. “Because that is a completely terrible disguise.”\n“What? No it’s not,” Steve defends, pushing his nonprescription glasses up the bridge of his nose. “It’s been working just fine since 1957.”\n“Well that explains a lot.”\nSteve’s mouth tugs up, entirely against his will. It’s familiar, comfortable, comforting, to be doing something incredibly dangerous in a not-so-legal car with Natasha Romanoff beside him. He must have a look on his face, because Natasha makes a questioning sound.\n“Nah, it’s nothin’,” Steve says, not wanting to lay any cards on the table. They’ve become so close so abruptly, and he likes to think that how well they get along it isn’t just circumstance. But he hasn’t had a friend in so long — not since Jim, really — and childishly, he doesn’t want to risk jinxing it. Anyway, it might cross a boundary. Steve doesn’t want to make Natasha uncomfortable. He glances over at her. She watches the dark highway speed past outside the window, her eyes sightlessly tracking the trees around them, her face half in shadow. It’s an odd face, Steve realizes: of course she’s beautiful, but bare and distracted like this it turns interesting, nearly too symmetrical. He thinks of drawing her here; he wants to paint her the way Van Gogh painted The Potato Eaters, with those protruding and weathered features. Her hands are tucked between her thighs to keep them warm.\n“Hey,” Steve says, quiet.\nShe shakes herself. “Hey yourself. Thanks for not killing me on sight.”\n“Well,” Steve says, “You gave me reason to trust you.”\nNatasha looks at him, her brow furrowed deeply. Steve catalogs the expression the way that he does about the people he cares for: this is the face she makes when something is hugely important to her. She says, “You trust me? Tell me the truth.”\n“Of course.”\n“I was with the Red Room,” says Natasha, frankly. This is the first time he’s ever heard her say the words out loud. “I’ve killed a lot of people. Good people and bad. Mostly good. I lie for a living.”\n“Are you trying to make me not trust you? Because it isn’t really working.”\n“I’m just telling you who I am, Steve,” Natasha says. “And the Red Room is a part of it.”\nBe yourself, Steve had asked her, months ago. He looks over to her and she looks back at him. This is Natasha, he thinks, at her truest: but still she’s not entirely true. No one can ever know her all the way, not even her. This may be as close as he ever gets, and he’s here because she’s allowed it. She trusts him. And still this Natasha, this true-as-she-knows Natasha, is vastly opposite of the Widow’s smooth blankness. She’s invested, concerned, serious. She’s a person, simply. Under Natasha Romanoff is this: the woman who smirks, the woman who curls her feet under herself to keep warm, the woman with her hair hanging down her back and frizzing at the temples. Still Natasha, just more. She’s waiting for something: Steve thinks it might be rejection.\n“I know you were with the Red Room, and I know that you’ve killed good guys, and bad guys. But I also know that you lived through years of pain and torture, and I know that the only thing it did was make you funny and caring and kind. That says more about you than what you did when you weren’t allowed to think for yourself. I mean that. I do. And besides —“ Steve muscles on so that she doesn’t have to answer; he’s been meaning to say this for a while, anyway. “Besides, it’s me you shouldn’t trust. I’m sorry about Odessa. Some friend I am.”\n“Rogers —“\n“No — I’m sorry about Odessa. I should’ve been covering you and I didn’t do my job. I was distracted and reckless. I’ve been distracted and reckless, and I’m — I’m angry, and I’m — I’m compromised, Natasha. You know that, I know that, men on fucking Mars know that —“\nShe’s smiling, dryly.\n“—And it almost got you killed. That’s not excusable.”\nNatasha shifts. “Oh, well, believe it or not, I’ve actually had worse. Besides, I lived. Isn’t that all that matters at the end of the day?”\nSteve frowns. “That’s not all that matters. I was your teammate. It doesn’t matter that you didn’t die, it matters that I wasn’t there for you when I should have been.”\nSteve thinks of Tony and his red suit, the arc reactor embedded in his chest, scaffolding for his broken heart. He thinks of Peggy’s voice on the other line of their late night phone calls, and imagines her smile, wrinkled finely now, and her thin, birdlike shoulders. Guilt curls familiarly inside of him. Is he a deserter? He must be. He left them all, and then he deserted Natasha, too. But his first sin was deserting Bucky in the Alps. Steve wants his selfish cycle to be broken.\n“Steve,” Natasha says. “I knew you were compromised when I went into that op. I understood the risks. I made my choice.”\n“Why?” asks Steve. There’s a beat of silence, and quickly he backtracks. “No, never mind. I’m sorry.”\nNatasha laughs at him, just a little. “It’s fine.” Then she goes thoughtful and quiet again. “I don’t know. I wanted to help you. And I think he’s… Sometimes I thought I could see it in him. Someone else, just underneath the surface, screaming. I remember feeling that way. I think that —“ she huffs a sigh. “So many of us died. And he’s…”\n“Familiar?”\n“Maybe. We’re the only two people who survived that place, you know? That doesn’t mean I trust him, or know him.” Her voice goes far away. “But he gave me bread once when I was hungry and alone. You don’t forget something like that. He taught me some English. I was — there was a task I had to complete, and I thought I would fail. I thought I would break. But he gave me bread, and he said to me, Ты крепка как мрамор.\"\nA strange thing has happened to Natasha’s voice: it has gone flat and blank, like she’s forgotten the right way to use inflection. Steve is silent, and Natasha asks, “Do you know what that means?”\n“You’re made of marble,” Steve translates. Bucky was right, Steve sees it now. Steve could never paint her: he would have to sculpt, and search for her in the slab. He knows what Bucky was thinking of, even, though Bucky probably didn’t realize it himself. A mansion in the south of France; her unbelievable wingspan; the tilt of her ferocious shoulders. Faceless, and therefore many-faced. Just like Natasha. “You are,” says Steve, quiet. “It’s true.”\nNatasha looks at him for a moment and then away. “He was a part of me even though he doesn’t know it. I owe him. You know what I mean. I know you do.”\nThe trust Natasha is offering out between them shakes almost palpably in the still of the night, fragile, like spun glass or a sapling. Steve has had a lot of trouble, since the serum, with gripping delicate things too hard and snapping them. He takes a moment before he answers; he wants to be sure that he knows exactly what he’s going to say.\n“Hey; well. At least we’re too close together.”\n“Yeah,” Natasha agrees. She smiles at him in a very curious and gentle way. “Yeah, I guess we are.”\nAn odd feeling comes over Steve at around four in the morning, once they’ve hit the state: a feeling of home-is-that-way. He hasn’t been here since 1980, but he knows, somehow, where to go, without looking at the street signs or checking a map. The knowledge is deeper than knowledge: it’s a heavy stone of truth that resides gut-deep inside of him, and so all he has to do is follow the love-pull of gravity. Once they’re inside the borough Natasha starts with directions. North, north, north: Steve realizes she’s taking them to Bed-Stuy. The red brick work of Brooklyn buildings are familiar even under streetlights. The graffiti; the smokers; the night crawlers standing for the subway or the bus or a taxi. All these people just waiting to get home.\n“Turn here,” Natasha says, and Steve does. He parks in front of a skinny four-story red brick complex. Steve looks up to see the square black fire escapes spiraling into the night sky and remembers the feeling of sitting in his own, kicking his feet into thin air. He finds that for a moment all the air in his body is caught in his chest. Most of the people in the building must be asleep; a lot of the lights are off. A horn honks a block away. Someone yells. Brooklyn.\n“Rogers,” Natasha says. She’s waiting with her hand on the car door, watching him.\n“Right,” Steve says. “Right, sorry.”\nNatasha picks the outside lock. Inside the complex they jog up to the third floor, and Natasha stops in front of apartment H. The paint on the letter is purple and peeling. The carpet underneath them looks kind of sickly. “This is yours?” Steve asks, disbelieving. But sure enough Natasha has a key, and she greets the happy yellow dog who trots up to them with a cursory pat.\n“For now,” Natasha says, cryptically. There’s an empty pizza box on the coffee table and the dishes are piling up in the sink. There’s a bookshelf filled with DVDs. The dog is butting his head at Steve’s leg, and so he reaches down and pets it. And then Clint Barton, naked as the day he was born, crashes out of the bedroom with a baseball bat held up defensively in both hands.\n“Aw, jeez,” he groans.\n“Barton?” Natasha hisses. She reaches over and flicks on a light. Clint squints and blinks, holding his hand up to shield his eyes.\n“Tasha?” he rasps, too quiet. “The hell?” He doesn’t have his hearing aids in. Steve, who’s never heard anyone shorten Natasha’s name once in his life, does a double-take.\nHe’s also never seen Natasha so furious. “I thought you were de—“ she hisses, but abruptly snaps her mouth shut; maybe Clint can read lips, Steve doesn’t know — Steve wouldn’t doubt it — because Clint’s signing something at her, his hands cutting fast through the air. Steve has no idea what he’s telling her, but it must not be good, because her mouth shunts suddenly into an unimpressed, flat line. “Get dressed,” she finally says, “Go now.”\nClint rolls his eyes and ambles back into the bedroom.\n“You live with — you live here?” asks Steve dumbly.\n“Sometimes,” Natasha tells him, and says, “Quiet: I need to think.”\n—\n“That’s the only explanation I could come up with. Marking him down as MIA…I don’t know, I guess it got them off. I guess they liked knowing something we didn’t.” Steve scrubs his hand over his face; his gut churns sickly. “Anyway, then he started talking about — about Buck, and I lost my temper.”\n“He’s dead?” Natasha asks.\nSteve shrugs one shoulder, meeting her eye.\n“What about Pierce?”\n“I don’t know. I don’t think so. Someone had to tell the STRIKE team to find me; it might have been him.”\nShe nods, absolving the mistake; they can handle it later if they have to.\n“Sergeant Barnes,” Clint mumbles. He still looks ashen over learning the truth about SHIELD, and he’s reacting about the same way to learning about the Soldier. Nervously he fiddles with his hearing aids, jamming them in and fixing the frequencies. At least he’s put on some pants. “Sergeant James Buchanan Barnes. Jesus,” he says. “Jesus Christ, this is fucking insane. You’re both aware of this, right? You know it’s absolute fucking insanity?”\n“It looks to me like we have three choices,” Natasha says. “Either we lay low and try to get more intel, or we run and try to get more intel. Or we can go straight to them before they have time to come to us.”\n“There’s always Fury,” Clint suggests, and Natasha looks to Steve.\n“He’s gone to ground,” Steve says, weighing the options. “I know that he’s with us. He’ll get in contact, eventually.”\n“It was Pierce who sent the Soldier to Odessa, wasn’t it?” Natasha says suddenly. “Fury must have passed it along to him, not knowing.”\n“He wanted us dead,” Steve agrees. Their eyes meet. Pierce has wanted both of them dead now for a very long while.\n“Who signed off on this?” asks Clint. “I mean, how the hell did this happen? How did they stay under the radar for so long?”\nSteve reaches back into his memory. “Peggy authorized…Jesus fucking Christ.”\n“Cap — hey — ”\n“Sorry,” Steve says, scrubbing his hands over his face again. “Sorry. Peggy brought on Pierce, back in ninety-something, before he went to the White House.” Another wave of horror hits him: Pierce worked in the White House. How many more are there? How many congressmen are sleeper agents? Then he thinks of Peggy. Peggy and terrible accident in 1991. “It was Pierce who ordered Stark dead,” he realizes. “He was there, he was there the night that — do you remember Obadiah Stane? Where’s Tony? Is he —“\n“We’ll get in contact,” Natasha says.\n“Jesus,” Steve says. “And Rumlow said they’ve been in the archives since at least the ’60’s. How far back has —“ Zola, Steve realizes. Arnim Zola. That was was the seed. That was where it began. Stark signed the paper; Stark wanted Zola’s brain. Stark got a lot more than that.\n“Operation Paperclip,” Natasha realizes, hollowly, at the same moment he does, and then in a horrible empty way she smiles and says, “Just when you think you’re going straight.”\nClint’s heart is bare on his face when he says, softly, “Tasha,” and Steve can’t stand to see it, and he can’t stand not having anything to do with his hands. “I’ll make coffee,” he says, and leaves them to it.\nClint’s machine, thank God, isn’t one of those fancy things that whirs like Tony’s — Steve can operate computers and cell phones fine, but Tony’s coffee machine is beyond his ability. Steve has worked with Natasha long enough to know that she takes hers with sugar, and remembers from that training mission in ’01 that Clint will drink his however he can get it. Steve takes his time and tries hard not to listen in on their hushed and stilted conversation. He ends up nervously dumping a ton of Coffee Mate into Clint’s mug. He shuffles his feet for a bit and even goes to the length of dampening a paper towel and wiping down Clint’s counters, a leftover habit from keeping house in the 50’s. Steve heads back into the living room and juggles three mugs: Nat unfolds herself from an armchair and takes hers from him, setting it directly down on the coffee table. Steve doesn’t mind; his prop did its job.\n“I’m going to shower,” she says, and leaves for the bathroom.\n“Thanks, Cap,” Clint mumbles, cradling his cup in his hands.\n“Hey, least I can do. Sorry we woke you up,” Steve replies.\nClint shrugs. “S’fine. I don’t sleep all that much anyway. You, though. I mean, if you don’t mind me saying —“\n“I look like hell, I know,” Steve agrees, and adds, “I didn’t know you lived up here.”\nClint shrugs. “Yeah, well. Turns out it’s good to have some secrets, huh?”\nSilence settles. Barton gulps his coffee down and Steve looks into his mug. He thinks of Peggy, and wishes horribly that he could protect her from knowing the truth, even though it’s her right to learn it. He thinks of Bucky, and the coordinates Natasha showed him. DC. Steve has been dismantling Eastern Europe for years now and Bucky was six blocks down the street all along.\nClint keeps fiddling with his left hearing aid, and then he drops his hand, scrubbing it again over his face. “Damn things,” he mumbles, and then looks at Steve. “Sorry.”\n“Yeah, hey, watch your fuckin’ language,” Steve says, and Clint huffs a laugh. Steve asks, “What’s wrong with ‘em?”\n“Nothing unusual. Get all screwed up and I can only hear background noise. Annoying as hell.”\nAfter a moment, Steve breaks the silence. “That’s the ear I used to be deaf in, too.”\n“What?”\n“Yeah, I was…” Steve gestures. “Couldn’t hear really anything in the left one. You know, before. People always had to stand on my other side to talk if they planned on getting me to listen to anything they were saying. My spine was all crooked, too. Didn’t walk quite right. No money for a brace either.”\n“Huh,” Clint says. “I’ll tell you what, Cap: none of that’s on the History Channel.”\n“No?” Steve asks. He can’t say he’s too surprised. “Yeah, well. I guess it wouldn’t be.” He sets his mug on the table. Nat drops something in the shower and swears out loud in Russian. It makes Clint laugh, and then he puts his hand over his face, scrubbing at it, exhausted. “You think she’ll be okay?” asks Steve at length.\n“Yeah,” Clint says. He looks to Steve. He’s aged a little since Steve saw him last. His face is now frank and weathered and worn, but his eyes are kind and sharp. And he’s still a mess around the edges, which is honestly what makes him Clint Barton through and through. Steve is so deeply glad, in that moment, that he can trust him; that they’re friends.\nInto the silence Clint says, “You know how her teeth on the bottom are a little crooked?”\nSteve’s never really thought of it before, but he has noticed. “Yeah.”\n“That’s my favorite thing about her. I mean, I have a lot of favorite things about her, but if you asked me to pick, that’s what I would say.” He nods to himself, and looks down at his hands. “Yeah,” he repeats. “She’ll be okay.”\nNatasha is out of the shower soon after that. She settles beside Steve on the couch, smelling like men’s shampoo. Her hair is wet and pulled back. She catches him looking and quirks her mouth up at him, her knee touching his.\n“So,” Clint says, when nobody speaks. “This is a clusterfuck.”\n“I’m vetoing running,” says Steve. “And I’m vetoing laying low. I’m not gonna ask either of you to come with me, but I’m facing this head-on.”\n“I was figuring you’d say that,” Nat replies.\nSteve looks at his hands. He tries to stop the truth from spilling out, but it does anyway. “I’ve spent my whole life watching him walk away from me,” he admits quietly, because he has: to work every day that Steve was too sick to do, and then to Basic, and then to war — on that train in the Alps, in Leningrad, outside Odessa. “I keep letting him go. It’s not going to happen again. And besides — I have a responsibility. SHIELD is compromised. The longer I wait, the more time HYDRA has to regroup.”\nThere’s a jagged, loud silence in the apartment. Clint and Natasha seem to be having a conversation with their eyes. Steve lets it happen. If they don’t want in he’ll understand. Nat has been through enough in the last two weeks alone. He won’t hold it against her.\n“We got a plan?” Clint finally says.\nSteve breathes out.\n“Steve will go to the HYDRA base,” Natasha says. She reaches into her pocket again and pushes the coordinates across to Clint. “I’ll see what I can do to get into contact with Fury. If we can get him behind us, maybe rally what’s left of SHIELD, we take HQ. With any luck, Pierce is dead, and they’ve spent the last sixteen hours scrambling.”\n“Cap will need back up,” Clint says, nodding at Steve. “I’ll go with you.”\n“Clint —” Steve tries.\nFrankly Clint says, “Look, all due respect, but don’t bullshit a bullshitter. You’re gonna need someone on your six. You can’t storm a HYDRA compound all on your own; that’s just fucking crazy. What are you going to do, just walk inside?”\nFor a moment Steve’s long life stretches out behind him and in front of him like a quivering and taut elastic band. He can almost taste the rain water in the air. What do you plan to do? asks a Peggy of sixty years ago, dripping wet and incredulous. Walk to Austria?\nAnd Steve replies, with an ancient smile at the corner of his mouth: “That’s it exactly.”\n—\n\nInstigator of SHIELD Leak Delivered A Final Call to Arms\n\n\n SHIELD had a black box, and this is what was on it. \n\n\nWASHINGTON, DC — SHIELD, a now-defunct intelligence agency so classified that civilians — and, indeed, this publication — were unaware of it until one hour ago, is a difficult story to keep straight. Like nesting dolls, the agency itself was a secret, and inside of that secret was another: HYDRA, a parasitic, supposedly obsolete organization that was once attached to the Nazi Party. \n\n\nHow much do we believe? How much do we trust? These are two questions that have been circulating with increasing fervency, and indeed with good reason, for the last sixty minutes. This recording of the impassioned facility-wide intercom communication initiated by the woman who opened the floodgates, Natasha Romanoff, serves to provide context and clarity. In the 20 second speech, she entreats fellow SHIELD agents who have not sided with HYDRA to join her in tearing down the corrupt agency. Both recording and full transcript are available below.\n\n\nNATASHA ROMANOFF: My name is Natasha Romanoff. If you know me at all you probably know me as the Black Widow. I understand if you don’t trust me very much. You probably have no real reason to. But I still need you to listen to me, just for a moment. This is…important. \n\n\nHYDRA is in this building. Alexander Pierce was with them; the STRIKE teams too. It’s been growing inside of this agency for a very long time now. The person standing next to you might be lying. They might be a traitor. Those of us who are left are the last front — if there are any of us left. I’m asking you to stand with me today, even if you never do again. Today, fight with me: don’t allow anyone who isn’t SHIELD out of this building. Don’t allow them to hurt the innocent.\n\n\nI know I’m asking for a lot, but I have faith in you; I have faith that you’ll do what’s right. \n\n\nSometimes the old ways have to collapse for the new ways to start working. \n\n\nBecause of the high level of Internet traffic, NYTimes.com may crash. View this article on a mobile platform.\n\n\nClassified SHIELD files still appear to be uploading.\n\n—\nSteve muscles his way into the vaults, killing them as he has to. His own footsteps echo too loudly on the floor and ring all throughout the claustrophobic hall. Everything is steel here, or titanium, or something: his boots thump without any regret or shame or tact. He rounds a corner and sees a man in this hall. He keeps walking.\n“Where is he?”\nThe man fumbles at his comm.\n“Where is he?” Steve repeats, approaching. He smacks the man’s hand away from his gun and grabs him by the collar and shakes him. “Tell me. Where is he.”\nThe agent reaches for his gun again and Steve smashes his head into the wall, dropping him to the ground. The lever on the vault nearest spins open. Inside are a number of agents, another horrible chair, and there, in front of them all, in tactical gear, no mask, his left arm gleaming dully in the light —\n“Bucky,” Steve says.\nThe Soldier raises a Glock and cocks it. His expression flickers.\nSteve swallows. “Bucky,” he tries again, and the Soldier grits his teeth, repositioning his weapon. But still he doesn’t shoot.\nOne of the men behind the Soldier looks incredulous. “You have your orders, Soldier,” he says. “This was supposed to be quick.”\n“Buck,” Steve repeats, low, “You know me.”\n“Shut up,” the Soldier grits out. His eyes are wild. He tightens his grip on the gun. “Shut up!”\n“You have your orders,” the man repeats.\n“Your name,” begins Steve, “Is James —“\nThe agent huffs out a breath. “Jesus Christ,” he says, and pulls his own gun, and points it at Steve.\nThe Soldier’s eyes go wide. He twists the gun out of the handler’s fist, turning his arm until it splinters and breaks — the man screams — and then the Soldier shoots him in the face, once, twice, a familiar reflex from 1944, just to be sure that he’s dead.\nThere’s a moment of stunned silence. Hope explodes inside of Steve’s chest like a C-4: a decimating, painful, blinding kind of hope. A last-ditch hope, a final hope; equal parts desperation and joy.\n“Oh, fuck,” an operative says, and chaos erupts.\nIt takes sixty heart-pouring seconds. Steve only has the chance to take out three of them, the men holding him down. A fourth activates his comm, his voice shaking as he shouts, “Activate code D, activate code —“ but then there’s a knife stabbed into his neck and Steve can’t do anything but watch as the Soldier snarls and drives it in to the handle. It’s an ugly death. The handler’s legs jerk as he dies. He was the last one. The Soldier looks up from where he kneels, blood spattered across his cheek. He stands.\nSteve is struck dumb. He hasn’t seen that face in seventy years. Somehow Steve has forgotten the exact cut of his cheekbones, the precise set of his heavy eyes; the heartbreaking dimple in his chin.\n\u2028The Soldier raises his gun again and turns it on Steve.\n“No,” Steve says, horrified. “No, Buck — no —“\n“I have my orders,” says the Soldier by rote, but something terrible is twisted in his face.\n“You don’t. No you don’t. Bucky. Think about this. Just think about it. Why did you kill your handlers? Why’d you do that?”\nIt’s the wrong thing to say. The Soldier is shaking everywhere, his eyes huge and wild. He grabs Steve by the hair and forces him to his knees. The barrel of the gun digs into the side of Steve’s head and the metal fingers dig into his scalp. Steve isn’t fighting back. He won’t. His arms hang limply by his sides and he’s bleeding from his nose but still he doesn’t move. If he’s executed like this then that’s okay. Natasha will be angry, but she’ll survive; it’s what she does. Peggy has Sharon. Kat has Joe. Nobody needs him anymore: nobody but Buck.\nThe Soldier still hasn’t taken the shot.\n“You were born in 1917. You always wanted to see the Grand Canyon.” The Soldier lets go of Steve’s hair and punches him in the face with the bionic arm. He’s furious. He’s terrified. His fury and terror splits the skin of Steve’s face. “You grew up in Brooklyn.” Steve gets pistol-whipped so hard his head spins. He’s surprised he doesn’t lose any teeth to it. “When I was sick you took care of me. Maybe you don’t remember me like this; that’s okay.” Steve’s vision is blurring and he tries to smile. He says, “I used to be smaller.”\nSteve is backhanded again. He feels more skin high on his cheek break open and bleed, caught in the plating of the Soldier’s left hand.\n“You wrote me letters,” Steve chokes. “Thirteen of them.” This time when he gets hit with the gun he goes down. Metal and salt bursts in his mouth — he’s bitten through his tongue again. The Soldier is shaking, his eyes huge and terrified in his face.\n“You were the first person who ever loved me,” Steve gasps. He didn’t know he could hurt this bad and not die from it. He didn’t know it was possible. “And I was — Buck, I was the first person who ever loved you.”\nThe Soldier’s face flickers. He hauls Steve back up to his knees. And then he steps back and raises the gun.\n“Do it,” Steve finally says. If this is it — then this is it. If it’s him or Bucky, Steve will always choose Bucky: every way, every time. But still the Soldier doesn’t pull the trigger. His chest is heaving and his eyes are wet. There’s a tremor in his right arm. Steve reaches up. He folds both of his hands over the Soldier’s, steadying his aim. The barrel digs cold and hard into Steve’s forehead.\n“Do it,” Steve rasps: he’s realized that what he’s feeling is relief. “Just do it. Kill me. Do it.”\nBut still the Soldier doesn’t move.\n“I can’t do this,” Steve confesses. He looks up at him. Those eyes: those eyes. “God save me, I can’t do this. You kill me now. You do it, Buck. You do what you have to do; I don’t give a damn if it makes me weak. If you gotta kill me, kill me. I don’t wanna live if it means you’re — I don’t wanna live without you anymore, I been doin’ it so long, I been doin’ it so long. I’m so fucking tired, Buck — Jesus, Buck, please, please, I’m so tired. I’m so tired. Just do it. Do it. Do it!” \n“I’m trying,” the Soldier gasps.\nThe air is punched out of Steve’s lungs. “Buck,” he says, gasping. “Buck, I see you; I’ve always seen you, don’t you know? I see you in there, I know you, I know you better than anyone alive. I see you, I know you. I know you’re there. Believe me. Believe me, please.”\nHis finger waivers on the trigger. Steve’s knuckles are white around his hands and the gun.\n“Come home, huh?” pleads Steve on his knees, one eye swelling shut, his knuckles raw and split. His voice cracks clean in two. “Bucky. Come home to me.”\nThe gun clatters to the floor. The building detonates.\n “I worked with some of those people for almost forty years.”\n“I know, Pegs.”\n“Forty years. I recruited Alexander Pierce myself.” \n“I know. I’m — I know. I’m sorry. Jesus, Pegs, I’m so sorry.”\n“You’re sorry?” Peggy’s eyes snap up from the reports and meet his across the breakfast table. “You have nothing to be sorry for. This isn’t your fault. This — bloody hell, Steve, this is —“\n“It’s nobody’s fault,” says Steve sharply. He lowers his voice when a couple beside them looks over. “It’s nobody’s fault. You know that you don’t have to do this, Pegs. You don’t have to sift through the intel. You can leave it.”\n“Nonsense. I don’t leave things unfinished. I’ll leave it when it’s done.” Her jaw is set beneath her papery skin. She looks to him. “But there are some things I can’t take care of, Steve. Not like this. Not anymore.”\nSteve looks into her coppery eyes, sharp and angry. “Understood,” he tells her. He bends his head down and presses his mouth to her wedding ring.\n—\nPierce’s magpie tendencies bit him, in the end. The vault was set up under the guise of any other SHIELD archive, and like any other SHIELD archive, there were documents upon documents kept in the walls: they survived, even when the monstrous chair and the cryotank and the medical equipment in the vault were destroyed. Assembled there are over two thousand files, spanning back for nearly eighty years: the sudden spillage of intel is an embarrassment of riches. It’s Natasha who tells him that he might not want to look at the pictures.\n“And on more thing,” she adds. They gear up together in a motel just outside Kiev: buckle, snap, buckle. “Before we do this — I need to know your line.”\n“I don’t have a line. Not with them.”\nShe studies him for a moment. Honestly curious, she asks, “It was that bad for you? When you lost him?”\n“Men always told me that they knew how I felt, because they had lost someone in the war, too: a brother, or a father, or their friend. I never understood how they could just talk about it that way. Out loud. I was so confused when people told me that. It wasn’t like that, not for me. For me it was like somebody cut off my legs, and I was still expected to stand up and walk. Worse than that: run for my life. And for Buck…” His voice catches in his throat. He finishes tying his boot. He stands. “I don’t have lines, Natasha. Wars end. People die.”\n“Wars end, people die…” She looks to him. “And then the sinners repent?”\n“Someone has to.”\nShe kills men for him: she holds them down and interrogates them, and when they don’t answer her questions, she finishes them off. “Do you know who she is?” Steve asks, and then: “Do you know who I am?” HYDRA always does. But they refuse to answer, and so their necks get snapped.\nNatasha was right about the photographs: Steve loses his lunch at the horror of it, doubled over, his belly cramping and rolling. One is labelled neatly: SUBJECT 0 47. It was taken in black and white, but the corners have started bleeding sepia with age. In it Bucky stands naked, his left arm a stump that ends just under the ball of his shoulder. His skin is stitched together with unmatched neatness and a fat, ugly black thread. Scarring extends onto the sharp line of his collarbone. His body is strapped in muscle, even more muscle than he had during the war. His eyes are huge and filled with horror. Harried. There are bruises and cuts on his face like the kind he had trekking back from Austria. Steve notices now that they’re in a particular pattern, and that they were then, too, all the way back in 1943: ear bleeding, shallow cuts beneath his left eye, a bruise on the same side of his forehead. Injuries from the chair — the thing they put him in. He stares out blankly, and he stares at Steve.\n—\n\nVICE PRESIDENT RODRIGUEZ LINKED TO HYDRA; WHITE HOUSE UNDER INVESTIGATION\n—\n“How did you get out?”\n“Get out of where?”\n“The vault,” Natasha says.\n“I don’t know,” Steve tells her, and at her confused face, says, “I came to outside, in an alley.” He doesn’t tell her how his throat and lungs and ribs ached, how one was fractured: how Bucky could have left him, but instead must have slammed on his chest until he started breathing again. They keep bringing each other back to life, one way or another.\n—\nThe New York Times @nytimes\nMargaret Carter and Nicholas J. Fury: America’s Erased History cnn/dwJIEk\n—\nThe man gags and gasps when Natasha forces two fingers into his mouth. A muffled pop, and she pries out the cyanide capsule, flicking it away. It bursts and spills across the warehouse floor. “Location,” she demands, and Steve stands away, scanning around them. While the HYDRA agent struggles and kicks and then finally screams, Steve paces around, taking stock. Kalashnikovs and C-4 sits in one corner in a heap, their shadows spidering strangely in the low light. A desk is nailed to the ground at another end, out of place; it’s old and wooden. Steve looks back. The agent is dead, and Natasha is rifling through his pockets.\nThere’s nothing on the surface of the desk, and the file cabinet beside it is empty. Steve searches through the drawers. The third down makes a strange noise in the silence, and Steve opens the fourth to tap along the bottom: hollow. He prods around inside until the compartment snicks open. A scrap of white paper is inside. Don’t pull on this thread. \n“Anything?” Nat calls to him.\nFor a moment Steve holds it in his hand, his thumb pressed to the D. Then he turns, offering it out to her. He doesn’t need to explain, anyway: there isn’t a person alive who wouldn’t recognize that fine and looping handwriting, lifted straight from the history books.\n—\nJulia Schmidt @jschmidtty\nOh my god.. reddit/dLfeKI\nJosef Suarez @phdsuarez\nAve Maria Madre de Dios reddit/dLfeKI\nNadine Bell @belliff\nim gonna be sick reddit/dLfeKI\nAnonymous @YourAnonNews\n#AmericaLied reddit/dLfeKI\nCNN @CNN\nReddit user makes #SHIELDgate discovery; “James Barnes is alive” cnn/ef234DL\nStephen Colbert @StephenAtHome\nMaterial is graphic: cnn/ef234DL #SHIELDgate\nHuffington Post @HuffingtonPost\nLee Harvey Oswald was innocent reddit/dLfeKI\nThe New York Times @nytimes\n#JamesBarnes alive, tortured by #HYDRA for decades; confirmed responsible for over two dozen assassinations cnn/ef234DL\n—\nThe instinct, when Bucky plummeted, had been to let go. It was the gut-pull reaction to gravity, the first animal reflex: Steve didn’t want to fall, but his body compelled him to follow. He remembers curling in on himself, clutching at the shell of the train; he remembers wailing against his arm, the wind swallowing up the noise. He finally hauled himself away and tumbled back inside, and then the strangest minutes of his life began: for a quarter of an hour, Steve was the only person on Earth who knew that Bucky was dead. Even though he collapsed against the wall of the boxcar and felt his throat go raw, even though he felt his hands scraping at the floor, he knew that he was also curiously unreal; flickering. In that moment he could do anything. He could have leapt out after him; he could have shot himself in the foot; he could have flown. He gasped and laughed, but Buck wasn’t there to hear it, so he knew the noise he made wasn’t real. He saw the inside of himself then — who he was without Bucky — and what he found was terribly simple.\nHe was nothing at all.\n“Steve,” Natasha calls.\nSteve turns away from the ancient map of Leningrad nailed to the wall, peeling at the edges and stained with water. This is where the trail led them, but it was empty when they arrived: the only other people inside were two dead operatives crumpled on the floor, their necks laying at odd, loose angles.\nNatasha hands the scrap to him, written this time on a napkin. SNAFU. Steve barks out a sharp laugh, pressing his hand to his face. “He’s fine,” Steve croaks, after a moment of damp and nearly hysterical chuckling. “Sorry. God. That means he’s fine.”\n“Situation normal, all fucked up, and he’s fine?”\n“It’s a joke, kind of. It’s — hard to explain.” He used to say it cheerfully, and it was one of those things that only his buddies from the trenches fully knew; Dugan and Gabe understood, and it made them laugh because of the history there, though Steve was always a bit in the dark. Fucked as usual! But the point is that Bucky remembers: Steve’s knees are suddenly faulty. “He remembers,” Steve manages to say, and he has to scrub his hand over his face. “He remembers.”\n“You can’t be sure of that.”\n“Something, Natasha,” Steve insists. “He remembers something.”\n“Does it mean he wants us to follow him?”\n“I don’t know,” Steve murmurs, and rubs his thumb over the indentation of the ink, and feels Natasha’s eyes on him, calculating.\n“This is the second time he’s beat us.”\n“Impatient,” Steve muses. So am I, he thinks.\n—\nFox News @FoxNews\n#JamesBarnes: Traitor?\n—\nTrends\nJFK\n#TheWinterSoldier\n#JamesBarnes\nHoward Stark\nNatasha Romanoff\n#SHIELDgate\nSHIELD\n#RodriguezImpeachment\nMargaret Carter\nNSA\n—\n“Here it is,” Steve says, and spreads them out before her. “You saw the pictures?”\n“I saw the pictures,” Peggy murmurs, and she sifts through the notes, and then she sighs. “You don’t mind me reading these?”\n“Help me, Pegs,” Steve says, and his voice comes out suddenly choked, exhausted. “Help me. I can’t keep carrying it. Peggy, please.”\n“Darling,” Peggy says, deeply concerned, and she reaches across to him; she can’t stand on her own, but Steve knows she wants to. “Darling, hush; darling, look at me, look at me. Steve.”\n“Sorry,” Steve says, and scrubs a hand over his face. “I’m sorry, you’ve got enough, I shouldn’t be — forget that I —“\n“Hush,” Peggy repeats, the way she did after he woke up from those horrible nightmares. She holds one of his hands in hers over the table. “Let me read them.”\nThere are three now. The first two, and a final one: a little note on a brown napkin.\n\nI’m finishing the job — get off my damn back. You should leave it and you know you should leave it, you stubborn fucking mule.\nDon’t kill yourself chasing a dead man.\n\n“He remembers, you see?” Steve asks, desperate to be understood. I’m not crazy, am I? I’m not crazy, he thinks, and begs Peggy, silently: tell me I’m not crazy. “He knows himself, doesn’t he?”\n“He certainly does. Steve,” Peggy says, and now takes both her hands in his. “He does. Steve — you aren’t yourself lately. Look at me. He does: I wouldn’t lie. I believe he does.”\n“How do I make him believe me? He’s not a —” Steve can’t stand to think of Bucky talking about himself that way. “He isn’t a dead man,” Steve says. “I know he’s not.”\n—\nHuffington Post @HuffingtonPost\nBreaking: #SHIELDgate datadump reveals Rogers, Carter protected identity of #TheWinterSoldier; H. Stark also implicated co.uk/eFL\n—\nThe thing is hideous. Steve circles for a moment and catalogues it from each angle. An older model than what was in the vault, but similar: the industrial steel clamps for the arms and legs, the strange fixture for the head, and the stiff leather seat, the wires and straps dangling from the back. Steve flexes his hand at the strap of the shield. He tries to look away and finds that he can’t. The note from this bunker is tucked into a pocket of his uniform: Go home.\nThey hurt him in this chair. They tried to wipe clean his bright mind and his smart mouth; they didn’t care who he was, who had been, who he could have been, who he was to other people — to his mother and his sister and to Steve — and so they made him into a thing, into their thing, into their dog —\nSteve slams the shield into the side of the chair with a noise he’s never heard himself make. The metal moans and collapses, and he does it again, and again, and again. Then he drops the shield and tears at the clamps with his hands, and his hands start to bleed, and he smashes an arm over his leg, and rips the dead wires to shreds with his fingernails. He hears something: panting; ragged, horrible animal yelling. He kicks at it, and smashes at it with his elbows and fists. The noise is him. He bleeds from his knuckles and palms and nail beds, his chest heaving for air. There are footsteps from the door and Steve whirls around: in one movement Natasha jolts back and draws her gun, aiming at him with both hands on the grip, her eyes wary and her body held tight.\n“Twice,” Steve gasps, and his spine goes weak, strings cut. “Twice,” he chokes. He has to brace his hands on his knees; his vision blurs, and when he blinks there are tears on his face, dripping to the floor. “I’ve lost him twice, Natasha,” he says, and starts breathing in, and finds he can’t stop. His chest starts to shudder; he really can’t exhale. “Sorry,” he heaves, his voice very faint. “Oh, sorry. I’m — I’m — I’m fine, it’s alright, look, I’m, I’d never hurt you, I’m —“\n“Steve,” Natasha says, and with fear in her eyes she holsters her Glock and takes two steps forward and grabs at his face. “Steve. Steve.” \nEvery time he goes it carves out a piece of me, he thinks, and bends nearly double, gripping at Natasha’s shoulders so he won’t topple over. Every time he leaves it feels like the Devil himself is scraping out my guts with a melon baller. But he can’t say it; he can’t say anything. All he can do is gasp in air.\n“You’re tired,” Natasha whispers, and collapses with him to the floor when his knees finally give; she knows she can’t catch him, so she doesn’t try. “You need to sleep.”\n“Can’t sleep,” says Steve says, and starts to laugh, just a little. “I haven’t fucking slept since 1945, Natasha. Do you know that? I haven’t slept a night through since 1945.”\n“Stop. Stop. Listen to me,” says Natasha seriously, and lets him put his wet face against the roll of her shoulder, breathing in the leather. She even laces her fingers together over the back of his neck. “Ты крепок как мрамор,” she tells him in a fierce whisper, and tightens her hands at his head when his shoulders begin to shake, defeated. “Listen to me. Listen. Ты крепок как мрамор. You’re made of marble.”\n—\n\n“No — No, Margaret Carter’s not going to trial, and I’ll tell you why: the woman is over ninety years old —“ \n\n“Jack, I just don’t think that’s the whole story. I don’t think that’s the whole story. She’s not going to be prosecuted because she’s a woman, full stop. That’s why she’s not going to be prosecuted. The feminist outcry would be absolutely out of control.” \n\n\n“Speaking of that, actually, Glenn, I wanted to talk about…in the intelligence leak, Colonel Steve Rogers’ personnel file was dumped, along with the personnel files of all SHIELD agents, past and present.” \n\n\n“Yes.” \n\n\n“Well, it turns out that his mother, Sarah Rogers, had ties to the Communist Party of Ireland, and she was a suffragette, pro-abortion.” \n\n\n“Really? Well — I’ll be damned. You know, I can’t say that I’m too surprised.”\n\n\n“And of course his father —“ \n\n\n“Right, of course. Still unknown.” \n\n\n“So what do you make of that?” \n\n\n“Rogers’ mother?” \n\n\n“Yes.” \n\n\n“Rogers clearly has a lot of things to say. He’s always been aggressive and vocal about his lifestyle and his beliefs, and I think it was — I might even say it was just a matter of time until more of these things began to…to emerge from the woodwork.” \n\n\n“What do you mean by “these things”?”\n\n\n“More…indiscretions, more problems, more cover-ups. More inside jobs. And then there’s the matter of Natasha Romanoff —” \n\n\n“Colonel Rogers and his red right hand.” \n\n\n“That’s right, that’s right. Soviet agents, communists, liars, assassins. This is the company that Rogers likes to keep. These are the beds that Rogers sleeps in.” \n\n\n“Glenn, I just want to clarify —“ \n\n\n“The Winter Soldier has killed — and this is the known number — twenty-four people and counting, all of those being prominent Western world leaders, including President John F. Kennedy. He’s a traitor, Jack. He’s absolutely a traitor to the United States of America. And I believe that the guilty party in this situation need to be prosecuted to the full extent of federal law.” \n\n(\"Exposed: The Traitor's Agenda.\" The Glenn Beck Radio Program.TheBlaze. Radio.)\n\n—\nThe Atlantic sits on the newsstand Steve passes walking into the supermarket. On the cover is his shield. Instead of a star in the center there is the bloody red emblem of HYDRA, its tentacles bleeding to the edges of the page. With bitter vitriol, the cover reads: UNITED WE STAND. Steve pulls his ball cap lower over his eyes.\nHe gets what he needs — toothpaste, juice, amaretto for Pegs. DC isn’t a safe place to be for anyone in his family, but he and Natasha burned through Eastern Europe with nothing to show for it; there’s simply nowhere left for them to go. Baron Strücker was their latest lead, a neo-Nazi scientist with an interest in human experimentation. But it was a bust, too: his Serbia facility was barren except for his dead body and twin empty cages. Steve stands in the cereal aisle and looks blankly at the Frosted Cheerios and thinks of the wooden children’s blocks at the floor of one. A B C D, they read, in peeling blue paint. He is sick down to his guts.\nThere’s someone else standing a ways down, looking for cereal too. Except, Steve realizes, he isn’t really looking. The guy stares at the boxes, an angry tick in his jaw, his hands balled into fists. It’s not my business, Steve tells himself, and shifts his grip on his little plastic hand-basket. Not your business, Rogers, he warns himself, but looks at the man again. His hair is buzzed short all over, his back rigid. Not your business, not your fucking business, Steve tries. It’s futile; he’s turning around anyway.\n“Hey, buddy,” he calls, enough to be heard over the supermarket muzak. The guy jumps, his shoulders at his ears, turning. “Hey,” Steve repeats, quieter: “Hey, you okay?”\n“Oh, Christ, dude,” the man says, laughing a little. He gives himself a little shake, and Steve recognizes the way that he has to force the tense surprise out of his muscles. “You scared the shit out of me.”\nSteve walks down to him, smiling, apologetic. “I didn’t mean to, I’m sorry. You just seemed, uh, lost in thought.”\n“I was,” he says, though now they’re talking in code. “Thanks for pulling me out of it.”\n“Hey, it’s no problem,” Steve says, and turns.\n“Wait a minute,” the guy calls. “Want my sunglasses?” He gives a shrug.\nSteve sighs. “That bad, huh?”\n“Your face is plastered on every single news station, man, and all you’ve got on is a hoodie. Not exactly inconspicuous, I’m sorry to break it to you.”\nSteve feels the corner of his mouth tug up: Nat would like this guy. “Believe it or not, I have heard that one before.” He thinks about it for a second. “Only if I can carry your stuff out to your car.”\n“Dude, I walked.”\n“All the better. I guess I could…I don’t know.”\n“Use the company?”\n“Yeah,” Steve says. “So, you actually need cereal?”\nThe guy gives a little shrug. “Not anymore. You?”\n“Not anymore.”\nHis mouth quirks up. “Yeah, I feel you. What else is on your list?”\n“Liquor, actually.”\n“Bad week?”\n“For the wife.”\nThe guy whistles. “Damn, alright. Should’ve known she goes hard. Let’s head over there.” He unhooks his sunglasses from the neck of his shirt, and gives them to Steve. He puts them on, and they walk side by side through the aisles. “Sam, by the way,” the guys says. “Sam Wilson. Pararescue.”\n“Steve Rogers. Special ops,” Steve says, out of politeness, and Sam huffs a laugh. There’s a gap between his teeth. It makes Steve smile, too. “How long you been back?”\n“Three weeks.”\n“Shit.”\n“Yeah,” Sam agrees. “It’s been —“\n“Surreal?”\n“Surreal, disorienting, hellish; man, I don’t even know anymore.”\nSteve bends down and looks for Peggy’s imported brand; she still hates American alcohol to this day, God bless her. “You bought melatonin yet? Helps you sleep through the night, all natural.”\n“Yeah, but it’s…” Sam shrugs, and Steve picks out the right bottle. “Slow going. You know?”\n“I know.”\nSam huffs a laugh, sudden. “God, you got no idea how good it is to hear that.”\n“Well, I’m happy to keep tellin’ it to you, whenever you’ve gotta hear it,” Steve says, truthfully. “God knows I wish I’d had someone there for me.”\n“You guys didn’t have the VA?”\nSteve shrugs. They head back to the self-checkout counters. “It was different then, you know? Even if you went, you didn’t really talk about it. It just wasn’t done.”\n“I’m sorry, man.”\n“Nah, it was what it was. I’m just glad it’s different now. You been going?”\n“Mostly I sit in the back. But yeah.” He shakes his head while he swipes his card and scans his stuff. It’s bottled water, canned beans, a dark chocolate bar. Steve is sad to see it, but he understands, more than anyone, that it takes time. “I was about to ask if you wanted to come tonight, but that’s kind of a dumb question, huh?”\n“I kinda wish I could, to be honest,” Steve tells him, and follows him outside, down the block. “Bad op, this last one.”\n“Yeah?”\n“Kids, I think.”\n“Jesus. Wait — should you be telling me this? I mean, the Black Widow’s not gonna jump out from behind a bush and strangle me? Iron Man’s not gonna fall out of the sky and take me in?”\nSteve laughs, and Sam laughs too, and Steve realizes that that was his plan all along. It makes him glad. This guy is kind. “No, it’s fine. Nat would like you, anyway.”\n“Oh yeah?”\n“Yeah, you both like to point out how shitty my disguises are.”\n“Man, somebody’s got to.”\nSteve laughs again, and Sam grins. “Can I just have a holy-shit moment?” he asks.\n“Go for it.”\n“Holy shit, I made friends with Captain America, and he was totally friends with Gabe Jones. I’m like one person removed from friendship with my childhood hero right now.”\n“I wouldn’t go around shouting that, though,” Steve tells him, wry. “Tony might not come after you, but the NSA will.”\n“Damn,” Sam says, quieter. “You really think it’s gonna come to that?”\nSteve shrugs. Sam turns them now into the suburban part of town. They jog up two flights of stairs. It’s a nice apartment complex. “Honestly? I got no fucking idea. It’s been a real shitshow, especially without —“\nSam fits his key in the lock, and looks back to Steve. “Man, it’s okay,” he says, quiet. “You don’t have to say it.”\n“No, it’s —“ they set their bags on the counter, and Steve helps Sam put away his canned goods. The place is pretty barren, but so is Steve’s, these days. “It’s, I don’t know. I just wish he’d turn up.”\n“We all do.”\n“Not for the same reason.”\n“Hell no, you’re right,” Sam agrees. He gets them water out of plastic cups. “And some people you’re really gonna have to watch out for. It doesn’t look like it’s treating you well, man. My unprofessional, crazy-ass, PTSD-riddled opinion?”\nSteve smiles, wry, and takes the water from him. “Shoot.”\n“You can call someone as much as you like, but you’re not gonna get an answer until they’re ready to pick up the phone.”\nSteve takes a deep, shuddering breath. “I know. I know. I’m just…”\n“Tired?”\nSteve nods.\nSam looks at him, thoughtful. “You got a lot of history in your head, don’t you?”\nHell yes, Steve thinks: so much that he worries he’ll burst from it, the decades inside him, the things he’s seen, the things he’s done, the people he’s known; their faces smudging with time. A lot of history in his head — a lot of things to try and hold on to, but somehow he feels them slipping by, like sand through Kat’s chubby toddler fingers on the beach outside Jim’s house. Steve thinks of all the things he’s losing, and all the things that Bucky may never know again. A lot of history in his head. Why doesn’t he try and share it? Buck’s been telling him to leave it for months. What has he done to reassure him?\n“Hey, you wanna stay for dinner?”\nSteve is jerked out of his thoughts. “Sure, yeah,” he says, but then: “Wait, don’t you have the VA?”\n“Skip tonight. We’ll kick it and watch Master Chef.”\n\"Well, I'm always on the lookout for new recipes.”\nSam laughs. “Man, you’re somethin’.”\n“First, though,” Steve says: “Can I use your phone?”\n—\n\nCorcoran Gallery of Art to open WWII Retrospective Exhibit\n\nAt the Corcoran Gallery of Art, we are proud to announce that we will be debuting a new exhibit this August at the courtesy of an anonymous donation. This retrospective is a multi-media examination of our country during the second World War viewed in the context of the recent intelligence crisis. Pieces will include the photography of Jack Delano, a number of wartime propaganda films, and, for the first time in the history of any exhibition, the original copies of the wartime love letters written by Sergeant James Barnes.\n\n\n(“New in the arts.” The Washington Post. Print.)\n\n—\nAnonymous @YourAnonNews\n@FoxNews #JamesBarnes is a war hero. Shame on you.\n—\nSteve’s phone vibrates; from the shower he doesn’t hear it. The call is from Tony. It vibrates again, now with a text. We fucked up. \nFifty-six seconds pass, and then: GET OUT OF DC. \n—\n\n“Is James Barnes a fugitive, is James Barnes going to be indicted — Tracy, those are the questions that the public wants answers to. What are you hearing right now on the ground?” \n\n“There’s no news yet, Chris, but as you can see, the protestors have already started gathering. There’s been talk of a direct indictment: that is, an indictment without the participation of a grand jury. There’s also the possibility that both indictment and trial may occur in absentia, considering that Barnes has yet to be found by the United States.” \n\n\n“So there is a search occurring.” \n\n\n“That’s what we’re waiting to hear on in this statement, and it may still be days or even weeks before there’s definitive word. Until then, we can look to the protestors, who are clearly very polarized…” \n\n\n(Hardball with Chris Matthews. MSNBC. Television.) \n\n—\nSteve towels his hair dry and there is a knock at the door. He expects Nat, or Sam, and dresses quickly. The neon light of the drugstore at the corner falls blue through the blinds, and there is a knock on the door again. The television is on, a replay of the afternoon’s news. Chris Matthews frowns at the camera, his skin papery and pink. There’s another pound on the door. Suddenly Steve hears his phone; it vibrates itself right off the coffee table and onto the floor, where it continues, muffled against the carpet.\nHe walks to the door and opens it. It isn’t Sam or Natasha or even Kat: instead a woman is before him, flanked by two men who stand in a way that indicates they’re armed beneath their clothes. Steve’s phone is still vibrating on the floor. He shifts his weight: he hasn’t needed a weapon to hurt someone since 1943. “Who are you?”\n“Margot Cagney, FBI,” the woman says. Her voice is sticky with a humid Southern drawl. “This can be very civilized, Captain Rogers.”\n“What can?”\n“May I come in, sir?” Cagney’s hair is blonde and curled. She has a pretty face, though curiously all her features are a little too big for it. Steve can’t quite tell her age. “We have business to discuss and I’d rather not do it on your stoop.”\n“Show me ID.”\nCagney reaches into the back pocket of her plain, practical suit, and flips her badge open.\n“And these guys,” Steve says, nodding to them.\n“Junior agents,” Cagney explains, as they show him their identification. One is shaking like a damn leaf, and his hands are clammy when their fingers brush: Steve grabs the badge to look at it closer. “Formality, you understand.”\n“Formality for what?”\n“May we come in?”\nSteve steps back and lets the three agents inside and shuts and locks the door behind them. His phone is silent now on the floor. “So,” he quips, meanly, “You want a drink?”\n“We’re not going to find the Winter Soldier, are we?”\nCagney sits in the stiff new armchair, crossing her legs. Steve looks back at her. “I don’t know his whereabouts.”\n“Don’t you?”\n“Would I be here if I did?”\n“Worth a try,” Cagney says. She gestures for Steve to sit at the couch beside her, and so he does, looking at the junior agents. They stand by the door.\n“I’m not feeling real hospitable,” Steve says.\n“I’ve been sent by the Bureau to have a conversation with you. Nothing else.”\n“Last time someone tried to have a conversation with me I got stuck six times with an electric baton.”\n“I understand that you’re volatile, Captain Rogers.”\n“Volatile? Have you been watching the news, ma’am?”\nCagney takes a second, looking at her hands. She seems to be rethinking what to say. “I have, Captain Rogers. And the news has shown a country that’s confused and scared. Worse than that, there’s nobody to blame for it — or there are too many, thousands of people across the globe, even in this nation, who will never be caught. Do you understand what I’m saying?”\n“I’m afraid I don’t.”\n“We’re not going to find the Winter Soldier,” Cagney repeats. “You know that. We certainly know that. Nobody will find him unless he wants to be found, and he doesn’t want to be found. He’s been in contact, hasn’t he?”\nThere is a furious tick in Steve’s jaw.\nCagney says, “I see. Well, alright. We won’t find the Winter Soldier. Trying to chase down Natasha Romanoff would be an exercise in futility.”\n“Why would you chase down Natasha Romanoff?”\n“She was never pardoned,” Cagney tells him. “She came to SHIELD under a good word from Nick Fury, but there was never any paperwork. She’s not an American citizen, Captain. There’s a charge for tax evasion, but there’s also a charge for crimes against humanity.”\nSteve scrubs a hand over his face. “What are you getting at?”\n“The administration is in a bad place.”\n“You don’t fucking say.”\n“The vice president was a war criminal,” Cagney continues. “And so was the majority whip. International intelligence has crumbled and every member of the UN is now considered guilty until proven innocent. The scale of this — it’s unconscionable. We’ve never seen this before. You mentioned the news. You’ve been watching the news?”\nSteve nods.\n“Then you know the state of public opinion. It’s only a matter of time until riots, martial law — the National Guard on the doorstep of every civilian family from here to Hawaii.”\n“Unless you want me to slap on the suit and pick up my shield and start making the tour circuit again,” Steve says, “I’m afraid I’m kind of missing your point.”\n\u2028Cagney smiles a desperately bland and ironic kind of smile, ducking her head, and when she looks to him again she’s composed and still. “Do you have a lawyer, Captain Rogers?” Cagney asks, and Steve feels icy dread sink like a stone in his belly.\n“What?”\n“Do you have a lawyer?”\n“No.”\n“Do you have any kind of legal representative who you’d like to call? I’m glad to wait if they have to fly in; I’ve already had dinner.”\n“What the hell are you getting at?”\n“What would you do if I told you that Tony Stark had ties to HYDRA?” Cagney asks.\nSteve scoffs. “Bullshit.”\n“Obadiah Stane was his right hand for years. He was involved. He supplied them with intelligence and weaponry. Stark has been in bed with a lot of bad people. Who’s to say he didn’t profit from HYDRA, too?”\nSteve’s heart is pounding fast and high in his throat. “I won’t hear this.”\n“In 2001, Agent Clint Barton made a call an unexpected call on a routine operation. Instead of taking out one of the Red Room’s deadliest assassins, he took her in. Where do his sympathies lie, Captain Rogers? The Red Room was just another mask that HYDRA wore.”\n“Stop,” Steve hisses. “Shut up. The hell are you doing this for?”\n“How long has your wife known the identity of the Winter Soldier? Why was it kept a secret? Why was there never a rescue mission initiated? Did she have some kind of deal with the Soviets? Or was it with HYDRA itself?”\nSteve realizes he’s standing, towering over her. There’s a sudden click: one of the junior agents has drawn his gun and cocked it. Steve doesn’t spare him a glance. “Get out.”\n“I can’t do that,” Cagney says, and stands too. “Stand down,” she tells her junior agent, though she doesn’t look away from Steve. “Captain Rogers. Please, sit.”\nSteve does. Cagey does, too: across him again. Steve’s hands are tense at his sides. Cagney says, “The law isn’t satisfied and neither are its citizens. We’re not catching the Winter Soldier any time soon. Unless a public figure rises up and takes the blame this nation’s going to fall into chaos. We continue a manhunt for the Winter Soldier until he turns himself in or turns up dead in a ditch somewhere outside Serbia. We try and hunt you down. Best case scenario? You find him. You all escape. For how long? You want to live the rest of your life looking over your shoulder?”\n“Frankly, ma’am, you know fuck-all about my life and just how long I’ve been looking over my shoulder. They still teach McCarthy in your history classes?”\n“We’re arresting them,” Cagney says. “We’re going to find them. And we’re going to take them in.”\nSteve thinks, strangely and suddenly, of Clint Barton saying, You know how her teeth on the bottom are a little crooked? and he asks himself: who am I to take that away? Their little hard-earned place in Brooklyn with their yellow dog and their coffee pot, where they shut themselves away from the world? Steve and Peggy had a place like that in Brooklyn once, a very long time ago, when they were first married. Steve and Bucky even before that. Peggy can fire a gun with impossible precision and keep diplomacy afloat while running operations on the side, but the fact is that even she can’t stave of the entire United States government. Kathryn graduated high school with bloodied knuckles because of Steve. And Bucky: Bucky. After everything he’s done, over and over again, to keep him safe. Steve has been fighting behind a shield now for sixty years. It looks like it’s time to make himself expansive and hard and indestructible: it looks like it’s finally time for him to be the shield, instead.\n“Blame me,” Steve says, and looks up to Cagney. “Lay it all on me. I’ll carry it. Say I did it. All of it. Say whatever you have to say — just don’t touch them.”\nCagney’s brow furrows. “Captain Rogers —“\n“That’s what you wanted, isn’t it? Agent Cagney,” Steve says, quiet. “Come on. You think I don’t know manipulation when I see it?” Cagney’s face goes abruptly blank and stunned. He looks at her for a long moment, and finally he asks: “You really planned this out, didn’t you?”\n“Of course we did,” Cagney says, apologetic. “We’re the federal government.”\n“So what the hell is this?” Steve asks. “A scapegoat? The administration wants a goddamn scapegoat?”\n“If it doesn’t happen then the people of this country will tear it to the ground. There are already insurgent groups growing. Survivalists. Militant communists. Yes, the Ellis administration looks bad. Yes, poll numbers are dropping. Yes, that’s part of why I’m here now. But I’m not a politician, sir. I’m a federal agent. I’ve been to Ukraine; I know an uprising when I see one.”\n“You’re scared.”\n“President Ellis is scared. I’m just doing my job.”\n“You know who else said that?” Steve asks. Cagney shakes her head. “The Nazis,” Steve tells her, “at Nuremberg.” Her face becomes smooth and unreadable. Finally Steve says, “Why me? Why are you offering this deal?”\n“Because HYDRA was right,” Cagney says, and gives him a small, sad smile. “Just enough people hate you. The sensation would satisfy the public and the punishment would satisfy the law. Six for one. You could settle it all.”\nSteve is silent.\n“We’re going to arrest someone,” Cagney tells him, in a gentle way. “A lot of someones, if you don’t turn yourself in.”\n“Do you think I broke the law?” Steve asks her, after a long moment. He feels numb and honestly curious.\n“There’s a case for it.”\n“Show me.”\nAgain she asks: “How long have you been in contact with the Winter Soldier?”\n“I haven’t been,” says Steve, tired.\n“If I search this apartment, will you stand by that?” Steve says nothing. Cagney says, “How many people know you’ve been in contact with him? More than two? Have you harbored him at any point? Would you give him shelter if he asked?”\nSteve stares into her eyes. “Do you sympathize with him?” Cagney continues. “Can you put your hand on the Bible and swear that you never gave him aid or comfort? Can you swear that you never had the intention to?”\n“You know your Constitution.”\n“Article III, section 3, clause 1. My favorite verse at Sunday school. Captain Rogers,” she says, “It’s over. It’s a complicated case: alright. But yes. You broke the law. You’re a traitor. You’re conspiring to aid and abet a war criminal.”\nSteve looks up to her, suddenly so angry he’s shaking. “He isn’t. Don’t you dare. He isn’t that. He’s a man. He did what he had to do.”\n“That’s not what it looks like from where six of the nine justices are standing, after we get him — should he choose to appeal the sentencing, that is. If he’s alive by then at all.”\n“You don’t touch them,” Steve finally says. “You lay a finger on my wife and I’ll burn this country to the ground. You know that I can. You know I will.”\n“You have my word.”\n“You don’t implicate Natasha. In fact, you get her the papers. Make her a citizen. Give her no trouble. Erase anything that says she ever lived anywhere but here. I don’t care that people know her past; you make her legal, natural-born.”\n“We can arrange it.”\n“You don’t touch Clint Barton,” Steve continues. “Or Tony Stark. Pepper Potts. Stark Industries. Leave them out of it. Nick Fury is one of the greatest men I’ve ever known. He stays clean too.”\n“Alright.”\n“And my daughter,” Steve says, but his voice breaks on him. “Don’t contact her, don’t monitor her. Her family. Joseph Morita. Their kids. Don’t touch my daughter. Please. Please, don’t touch my daughter.”\n“We won’t.”\n“You swear.”\n“I swear.” There is sympathy in Cagney’s eyes. Her light brow is drawn.\n“And —“ His breath catches in his chest; for a moment he can’t say the words. “And James Barnes.”\n“That’s the deal.”\n“You never search for him,” Steve says, in a jagged hurt whisper. “If he shows up you turn him away. If he gives himself over you say you can’t prosecute him. If a government agent sees him in a bazaar in Afghanistan or a coffee shop in Russia you turn around and walk in the other fucking direction.” It’s ugly to see a grown man beg this way, tears on his face, mouth twisting. Steve knows; he doesn’t care. “Do you understand me? If you touch him, if you look at him, Agent Cagney — I’ll be waiting for you, each and every one of you, personally, in Hell.”\n“I believe that, Captain Rogers,” Cagney says. Steve thinks he might have scared her. “I believe you.”\nSteve pushes his hand again over his face. “You know,” Steve says, “I remember the last time someone was tried for treason. Sentenced to death in 1952.”\n“It’s not so barbaric anymore.”\nCagney stands. Steve offers up his wrists. “Isn’t it?”\n“Steve Rogers,” Cagney says, and nods to her men: the handcuffs snick open. “You’re under arrest for high treason and conspiracy against the United States of America. You have the right to remain silent. You have the right to an attorney. If you can’t afford an attorney one will be provided for you. You can decide at any time to exercise these rights and remain silent as you see fit. Anything you say can and will be held against you in a federal court of law.”\n—\nIt is, just as Cagney promised, a civilized affair. He can’t be held yet because it’ll take a while to push through the direct indictment; the Bureau told him four days at the most. So he’s processed at headquarters and sent back to his apartment with a chip under his wrist that the serum rejects after fifteen minutes. He puts it in his pocket instead and feels the itch-pull of his skin knitting back together, and he rubs at the raw new place of himself, and days pass: three days. He calls Peggy to say he loves her. He calls Kat to say the same. He doesn’t call Natasha or anyone else, because they’ll figure it out; Tony is stirring something up with the media, so Steve sends a text. It’s covered. Tony replies: better be. He’ll be angry; he’ll be safe.\nOn the fourth night Steve turns out of the bedroom and finds something strange. The window is open.\n“How you been?” says a voice, a voice like Brooklyn at sunset; like the curl of cigarette smoke above base camp in France.\n“Buck.”\n“Don’t hit the light.”\nSteve doesn’t, standing with his fist knuckling white around the kitchen countertop. The dark figure stands from the chair Cagney sat in and Bucky walks to him. His face comes into the light from the hallway. He wears a ball cap and a tattered blue surplus coat and his hair hangs lank down to his shoulders. There’s more beard on his face than during the winter of 1944. Steve feels a rushing in his head, and a strange displacement in time. This is because it simply ceases to exist. It’s 1938, or 1941, or 2009; he doesn’t know, it doesn’t matter. There is a dimple in Bucky’s chin. Steve feels a snap inside himself. Bucky is before him. He grabs at Steve’s neck as if to hold him up, as though one of them might fall, and he cups at it roughly, his own mouth twisting.\n“Hey, you,” Bucky says, rough.\n“God,” Steve gasps, and his knees almost buckle. Bucky’s right hand is big and calloused and familiar, his thick square fingers hot on Steve’s skin. Steve grasps his arm. “Hey. Hey, Buck.”\n“That’s me,” Bucky says, and Steve lets out a hysterical, gasping laugh. “Really me. Or mostly me.”\n“I,” Steve manages. “I —“\n“I know,” Bucky tells him, thickly; and his voice is hurting and cut open, like a bleeding limb in the field waiting for either cauterization or amputation. “Stevie, I know.” Bucky gives him a little shake. Like the nickname, that’s familiar, too: Bucky loving so hard he’s resorted to small acts of passionate violence. “I know.”\nOf course Bucky knows. Of course Bucky knows. Nobody else knows in the world knows what they know; nobody else in this history of the universe has ever experienced the truth between them. When Steve was stabbed in the neck by a Nazi during the war he could feel his body healing. First the vein, which slithered back together, and then a rush of blood so quick to his head that he gasped in a breath from it, dizzy, grateful. After that the tendon knitted over it, and the muscle and the fat. The skin was last — suddenly he had all of himself back in one place, even though it hurt like a chemical wound. This is what Steve feels now when Bucky pulls him tight and close. A vein, tendons; muscle, fat, and skin. Steve feels his own self knitting closed at every place their bodies touch, and after a moment the years mean nothing, nothing at all: and it is an alley in 1923, and they are five years old, and he is whole again.\nWhat’d they do to you, what’d they do to you, Steve wonders, and realizes belatedly the words are spilling right out of his mouth: “What did they do to you? Buck, Jesus —“\n“Nothin’ good,” Bucky croaks. “Nothin’ good.”\n“Are you here?” Steve asks. “Are you really?”\n“You know, I'm not entirely sure,” Bucky says. “Am I?”\n“You are,” Steve tells him, and he feels suddenly liminal and weightless, and terribly, truly real: he’s the only person in the world who knows that Bucky is alive.\nHis right arm is bigger than Steve’s ever felt it, his chest broader, his shoulders harder. Steve fists both hands in Bucky’s hair and knocks his hat right off his head. His left arm is unyielding and alien and hard beneath the jacket, and it holds Steve so close that he’s briefly afraid they’ll break all the bones in each other’s bodies. Bucky’s shoulders shake for a second, and Steve holds him closer; it abates after a moment. His fists curl in the back of Steve’s shirt, twisting the fabric; his fingers dig into Steve’s skin, like he’s dying of hunger and thirst and deprivation all at once.\n“I did something stupid without you,” Steve says, after a second. “I thought you weren’t coming.”\nBucky murmurs, “Hold on, don’t tell me yet. You’re the first real — the first real thing I’ve touched.” So they stay there, mending. Steve doesn’t know for how long. It feels like sixty-five years down to the second. After a time Bucky goes to pull back, but then he can’t make himself. He tilts his face against Steve’s, his stubble scratching. He pulls back more and their cheeks touch, Bucky’s nose at his ear. Then their temples tilt together, and their foreheads, and Bucky’s hands are on Steve’s neck, one warm, one chilled, and their noses are touching, and they inhale and exhale one another. Steve closes his eyes and opens them again and closes them. “Buck,” he says, nearly silent, calling his name. “Bucky.” Bucky touches Steve’s face again, now with a cool metal hand. Steve puts his own hand atop it. The plates shift and move beneath his palm. Finally Steve pulls himself away, because he knows Bucky won’t be able to do it, and he doesn’t want to make Bucky do any more things he doesn’t want to do. Still he can’t go far. He stares and stares at him, and his hand falls on the unyielding roll of Bucky’s left shoulder. The horror hits him in a wave.\nHere he is, miraculous. Here he is, maimed.\n“What?” Bucky asks, feeling the shift.\n“Can I tell you now?”\n“Already know. Bugged the place.”\n“You’re shitting me.”\n“Nope.”\n“Christ,” Steve chuckles. They fall silent again and forget to speak for a second, looking at each other. “Sorry,” says Steve, belatedly.\n“What the hell is going on with you?” Bucky demands, quiet and infuriated and afraid. The tone is so familiar that Steve is left dizzy. “What the hell is going on? Have you lost your goddamn mind? Are you fucking crazy?”\n“Maybe I am,” Steve admits. He chuckles. Wildly, he says, “Jesus — I don’t know. Maybe I am fucking crazy.”\n“What happened to you?” Bucky asks, and his voice does something horrible. “God, what happened to you while I was away? I can’t believe you — Christ,” he breathes, and gives Steve another shake. “How could you, huh? What kind of — I know you, I know you, you aren’t like this, you don’t do this, what happened to you? What did they do to you?” \n“You were gone,” Steve tells him. “You weren’t here. I don’t know. It was so long — everything stopped making sense.” The world is suddenly hyper-focused. Steve hasn’t felt this clear since he stumbled out of the Vita-Ray. “It was muffled. It was — I don’t know. I wasn’t here all the way.”\n“Jesus,” Bucky says. “Jesus, Steve. I got an idea. Alright?” Bucky’s face is twisted, like he’s in pain. Steve hates to see him hurt. He touches at Bucky’s shoulders. He thinks distantly that he’s probably in shock. “I’m getting you out of this, whatever it takes.”\nSteve zooms back to reality. He sets his jaw. “I made my bed in 1966.”\n“No you didn’t. I did that for you.”\n“Don’t you fuckin’ dare,” Steve tells him. “Don’t you dare turn this back on you, Barnes. They had no right —“\n“You’re goddamn right they didn’t.” Bucky breaks away from him, and it hurts Steve like a limb has been torn off. His hand snaps out and he grabs Bucky by the arm and yanks him back.\n“Don’t leave,” he says, his heart pounding in his throat, panicked.\n“Sorry.”\nSteve is shaking. “Don’t leave like that, Buck, I mean it.”\n“I’m sorry, I said,” Bucky insists, and his hands are back on Steve’s neck, and Steve can breathe again.\n“We fight like this, I don’t care. But don’t you pull away.”\n“I’m getting you out of this,” Bucky repeats.\n“No you’re not,” says Steve. “No you’re not.”\n“Rogers —“\n“I stood over your empty grave,” Steve chokes. “You’re not doing shit.”\n“Selfish son of a bitch,” says Bucky, with fondness, with fury. “You stood over my empty grave? They scrambled my brains so bad, some days I forget the year.”\nSteve flinches like he’s been hit. “I didn’t mean —“\n“Oh, Jesus Christ, don’t give me that face,” Bucky says. Steve remembers in a sudden giddy-sick rush why fighting with Bucky was worse than fighting with anyone: they know each other so well that they both remember exactly where to aim, and then dig. That at least hasn’t changed. “You meant it that way, you did: don’t lie. Poor me, poor me, Saint Rogers — well, you had it bad. I had it bad too. So what, huh? At the end of the day it doesn’t matter. So the world chewed us up and spit us back out. So what?”\n“Walk it off.”\n“That’s right,” Bucky tells him, softer. “Walk it off.”\nSteve nods. “How you been?” he echoes, after a second.\n“Ain’t a person alive I haven’t spilled my guts to, and then I keep forgetting my middle name,” Bucky tells him, and grimaces. “So: must be a day that ends in Y.”\n“James Buchanan Barnes.”\n“You don’t have to tell me,” Bucky says. “I’m looking at you; it all stays in place.”\n“God, Buck,” says Steve.\nBucky’s smiling, maybe. “Quit it,” he says. “We’re fighting, remember?”\n“No,” says Steve, stubborn. “Let’s not for a minute.”\n“I don’t know if we got a minute,” Bucky tells him. “They’re coming for you.”\n“How long?”\n“Hour or two.”\n“I’ll stand by it,” Steve says. “I will. You died for me once, I owe you a favor. I’m not running. I don’t want it if we have to run.”\nBucky’s face does something complex and furious. “Where do I even — You’re not doing me a fucking favor,” Bucky snaps. “You know why they picked you? Easy fucking target: you’ve been chomping at the bit to fall on your own sword since the day you were born. You die on me and you might as well put me back in that chair. It’ll be the same. I’ll be the same as then. This long, and you still don’t get it, do you? I’m —,” he says, and his voice is suddenly weak, ragged. He clamps his jaw shut; he won’t say it out loud. “But you know that already, don’t you. You know. You read it all.”\n“I know,” Steve says, his throat tight. “Of course I know.”\n“Then you know that if I’m — if you — there’s nothing in here, if you do that.” He taps at his chest, rueful. “Nothing at all. I’m empty again, like I was all these years.”\n“I can’t let you take the fall for this. I won’t.” \u2028\n“I know,” Bucky says, his mouth a grim, tired line.\nSteve is conflicted. Simply, he hurts inside. “What’re you planning?”\n“Not sure yet. Just an idea. Maybe two. I visited our — our mutual friend.”\n“Natasha.”\n“She loves you a hell of a lot,” Bucky says. “Tried to kill me.”\n“Why?”\n“Slight miscommunication.”\nSteve huffs a laugh. “Well, I’m sure you did something to deserve it. I love her a whole hell of a lot too. Will you tell her? If you see her again?”\n“I didn’t pass love notes for you in the second grade and I ain’t starting now. Wait for me,” Bucky adds, abruptly serious again. In the low half-light of the kitchen he takes Steve’s face in his hands, harshly and purposefully, the way he would before a bad firefight. “Can you wait? Can you wait for me? I’ll come for you.”\nSteve would wait for another hundred years, or until the sun swallows them all up. He nods.\n“Nothing fuckin’ changes,” Buck says, quiet. His eyes search Steve’s. “I leave off for a war and come back to see you baring your throat for the nation again. Huh? You ever learn?”\n“I’m a pretty reliable guy.”\n“Yeah, reliably stupid.”\nSteve touches Bucky’s jaw, suddenly moved. “Missed you,” he manages, like Bucky just came back from a miserable summer in Hartford.\n“I know —“ Bucky starts, and then bites back whatever he was going to say. He looks lost for a second; confused with his own mind. Then he repeats, slowly: “I know. Listen. You keep your head down. You wait.”\n“That’s the plan?”\n“That’s the plan.”\n“Why aren’t you telling me anything else?”\n“Well, I’m a cocky son of a bitch,” Bucky murmurs, and he tilts their heads together again. “I always overplay my odds. You trust me?”\n“Are you fucking kidding me?”\nBucky smiles at him for a fleeting second. It makes Steve’s stomach twist into knots and his old heart creak. Then it drops away. “I gotta leave,” he says.\nSteve clutches at his shoulders for a long second. “I know.”\n“Now; I gotta leave now.” He’s touching Steve the same way, his hands desperate and greedy, at Steve’s face, his neck, his hair. His eyes dart over him, memorizing. Finally he looks at him. “Nothing stupid.”\n“Nothing stupid,” Steve agrees.\nAnd like that Bucky is gone, back out through the window; Steve stands in the kitchen, breathless, unmoored, and waits for the other knock, but suddenly it doesn’t matter anymore. Suddenly his heart is malleable, elastic, young.\n \n\n\n2010\n\n“There’s a level of sympathy —“\n“Of course there is, but —”\n“I think that it’s not erroneous or out of line to say that what Colonel Rogers did was understandable, to a degree.“\n“Understandable? He was part of a massive government cover-up that is just as damaging as the existence of HYDRA inside the White House, if not more. We’re talking years and years of lies, years of missions that were completely eradicated from any record, years of conspiracy — decades, even, if you’re inclined to believe that statement.”\n“To a degree, Martha, that’s my caveat. To a degree, it’s understandable. And you’ve actually brought me to my next point: we’re taking a viewer poll right now — in Colonel Rogers’ initial statement, he refused to comment about how long he has been aware of the Winter Soldier’s identity, and there’s a great deal of speculation that he only recently discovered that, that it was kept secret from him, and perhaps only Margaret Carter was aware of the truth for a number of decades. Where do you stand on that?”\n“Anderson, you said it yourself: there’s really no way for us to know, though the evidence in the intel is certainly incriminating for Director Carter. Do I think Steve Rogers is going to throw his wife under the bus, is that what you’re asking? No, I don’t think he will. He has a long history of shouldering blame.”\n“So you’re saying it’s possible, in your opinion, that Colonel Rogers may commit further crimes, and possibly perjure himself on the stand, in the interests of protecting his wife?”\n“I’m not saying that, I have no way to know that. But I don’t think it’s outside the realm of possibility; I don’t think that Rogers would not…I don’t think he would fail to defend the people close to him.”\n“That’s a lot of double negatives, Martha.”\n“I know, I know, you flustered me, Anderson. That was a pretty ruthless question.”\n“Just as a final note — Martha, outside of your legal expertise, outside of your professional point of view, what do you think of Colonel Rogers’ character? Do you think that this history of taking the fall, and this current trend of potentially covering for his wife, does that speak to a weakness of character to you?”\n“As a lawyer, absolutely. I would never want him as a client.”\n“But past that.”\n“You’re really digging today, aren’t you? …I appreciate that. I appreciate it. No. No, I don’t think that’s a weakness. I have always admired Colonel Rogers, as I’m sure a lot of us have. I think this is a very complicated case, and I think he’s been through more than most of us can ever imagine. I’m not sure yet if there are grounds to be prosecuting him in particular, over any other person involved. I think this is very messy.”\n“Martha, I’m sorry, hold on — hold commercial — thank you, just a second, thank you. Martha, you don’t think — are you saying that you think he shouldn’t be prosecuted?”\n\u2028“Yes.”\n“You sound like you view this as a witch hunt.”\n“That’s because I do, Anderson. That’s because it is. There’s no denying that what Carter and Rogers and SHIELD as a whole did was wrong, and I absolutely believe that someone needs to be prosecuted, but there’s something about this case that’s — that’s odd to me, as a legal professional. I can’t help but remember when Rogers was labelled a communist in the sixties by many people, many hateful people, many ignorant people, and I have to wonder if that’s similar to what’s happening now, if he’s our scapegoat for a second time. I want to see more evidence. I want to be sure that this isn’t the beginning of another blacklist.”\n“But all the evidence is available, Martha. It’s available to the general public.”\n“Exactly. And all that evidence still isn’t enough, it still can’t confirm or deny any of the current allegations. And that’s why I’m — that’s why I’m very wary of this case, and of the people involved, and why I’m very hesitant to choose either side of this debate.”\n“Should Steve Rogers have been indicted?”\n“I…”\n“Martha? Martha, are you still there?”\n“Yes. I’m here. I’m sorry. I think — oh, what the hell. Right?”\n“I’m sorry?”\n“We need to start fighting for the truth. We’ve been cheated and lied to and duped and — and by all means, by all means, Anderson, we should have failed, as a country. For these last couple months we’ve lived in fear and we’ve been on the cusp of something terrible, and I think we’ve all felt that, all the American people. Somebody needs to tell the truth. Stop censoring history. Professionally, personally, I’ll say it. Nobody else is saying it, so I’ll say it. No. No, Steve Rogers shouldn’t have been indicted. Yes: I think that something is very, very wrong.”\n\n(Anderson 360. “Martha Banks: Candid Answers.” CNN. Television.) \n—\nSteve has more time on his hands than he did during the red autumn days of 1954, when Kathryn was in school and Peggy at the office; all four walls here are opaque and milky, and the bed is set inside the corner, and there’s nothing to do but sit against one white wall or another and spread his bare toes against the chilled, smooth floor. Near his foot today he notices a little insignia: it reads STARK INDUSTRIES in sharp, gray letters.\n“Fuck you too, Howard,” Steve murmurs, and tips his head back, and looks at the white all around him. “Fuck you too, you cold-hearted candy-ass sonuvabitch.”\nFuriously, Tony has refused to answer the phone. Cagney has kept her promise: it is perfectly civilized, just as the trial will be civilized, just as the execution will be civilized. Steve can call whoever he likes once a week for thirty minutes at a time until the trial, and he called Tony first, in apology: but there was no answer, and after the third week Steve gave up on him and called his son-in-law instead. Like Peggy, Kat cries when she’s angry, but Joe comes from a long line of those wrongfully imprisoned, and so he is greatly practiced in dignified, silent rage. Anyway, Kat was too upset to come to the phone. Steve thought vividly of her high school graduation, and the scabs on her knuckles. Then the red reminded him of the first dinner with Tony after Howard and Maria were killed: Steve had made pasta, and out of nowhere a spot of crimson was in Tony’s primavera, and then suddenly there was blood in the white sauce and blood all over his hands and blood on the white tablecloth too, and he was cursing and coughing and grabbing at his nose.\n“Get a napkin,” Peggy had snapped, springing up and tipping Tony’s head back and pinching his nose with her fingers. “Bloody buggering Christ, Anthony,” she swore, severely displeased. Steve came back with a paper towel and watched Peggy press it to Tony’s nostrils, soaking dark. “Is there any on you?”\n“Why, you wab some?” Tony managed.\nPeggy smacked him upside the head. “Ow!” Tony yelped, and Peggy told him, “I’ll kick the absolute shite out of you and then I’ll call Mr. Jarvis and tell him, you little bastard.”\n“Blease don’t call Jarvis,” Tony said, but then his brow furrowed terribly, like he hurt everywhere; like his insides hurt, a deep and abiding pain that can’t come from too much cocaine and a bloody nose alone. “Fuck,” he had said, and gasped, “Oh, fuck —“ \n“Oh,” Peggy sighed, and Tony’s shoulders, finally, finally, finally began shaking. “Dear boy,” she murmured. “Alright. Alright. I know, my dear. I know, hush a second, I know.”\n“God, fuck,” Tony gasped, wetly, and for all his posturing and his genius, Steve saw him then for what he really was: a twenty year old kid alone in the world with no one anymore to love him, and fearing that perhaps no one ever really had.\nEventually Peggy really did go to call Mr. Jarvis and so Steve had to go and take her place. “Fuck,” Tony repeated, but Steve knelt in front of him anyway, and took the bloody napkin out of his sturdy, smart mechanic’s hands, shaking today, and dabbed up the blood around his nose — the flow had stopped by then — the same way he had patched up a hundred other hurt kids trying to soldier on. “Does it hurt?” Steve had asked, dipping the end of the napkin in Tony’s glass of water to get the dried flakes away too. “Bad-hurt? Need-a-hospital hurt?”\n“No.”\n“Let me see your eyes.” He hadn’t burst a vein, so Steve said, “Well, either way: President Reagan is disappointed.”\n“Fuck Reagan,” said Tony thickly. “Howard loved him.”\n“Fuck Reagan,” Steve agreed, heartfelt. He added, “That bougie bastard,” and it punched a laugh right out of Tony’s chest.\nSteve thinks of this now, in his cell: he had never been so close to Tony before that dinner, never touched him outside of a few distracted handshakes. Tony has never said what Howard was like behind the closed doors of that mansion, but Steve, over the years, has inferred.\nThe intercom says, “Phone call for SGR,” and Steve jolts. The door is vacuum-sealed and it sits seamless as part of the wall, white too: it sucks open and slides away, and Steve lets four men chain him with heavy magnetic cuffs at his hands and feet, and then he shuffles down the hall between them, his toes stung by the cold of the floor. He picks up the white phone in the clear bulletproof booth at the end of the blue hall and holds it to his ear. “Rogers.”\n“Jane Foster’s team found something in the ocean,” Tony Stark tells him, and Steve viscerally and immediately remembers Peggy’s angry, worried voice: Bloody buggering Christ, Anthony! He almost laughs, but then he realizes what Tony has said.\n“What?”\n“Little blue cube with radiation through the roof: she actually tracked down Banner, can you believe it? Banner —“ \n“It’s what?” \n“It’s radioa—“\n“No, the shape, Jesus. It’s a cube? Leave it in the ocean, you have to leave it in the fucking ocean, Jesus Christ, did you move it? Where was it?”\n“Middle of nowhere, frozen underneath the aurora borealis,” Tony tells him. “Where you would’ve been sleeping with the fishes.”\n“Did you leave it?” Steve demands. “Tony?”\n“Yeah, obviously, we called you first.”\n“Don’t touch it, pull her team out. Get into contact with that guy who dealt with New Mexico —“\n“Yeah, okay, okay, God, obviously.” There’s a moment, a pause. “Yeah,” Tony repeats, but his voice is a little different now in a way Steve can’t pinpoint. Steve begins to wonder if he called about Schmidt’s cube at all. “Hey, speaking of me —“ Steve rolls his eyes, knee-jerk. “How’s that prison cell treating you? The original design was for Gitmo, but then Fury called up and there was a whole issue getting the patent figured out so SHIELD could also —“\n“Tony.”\n“Are the toilets actually vibranium?” Tony asks. “I still don’t know if T’Challa was joking about that when he was talking with the SHIELD architect.”\n“Ton—“\n“Tell me about the intercom system,” Tony interrupts, and something in his voice makes Steve’s skin suddenly prickle, perfectly aware all at once of the guards against the wall. “There’s one facility-wide and one internal for each cell; do you know if the button by yours is to the left or the right? Line’s not tapped, Cap. Say yes for left, or if it’s on the right, say, oh, ‘Help me, Tony-wan Kenobi, you’re my only —”\n“It’s on the right,” Steve says, pinching the bridge of his nose.\n“Great.” There’s a moment of silence, and Tony says, equally irritated and gleeful: “Keep talking. Oh my God, you’re so bad at this.”\n“How’s Miss Potts?” Steve asks.\n“Romanoff’s fine, and I’m —“ Tony moves his mouth away from the phone, and distantly yells, “Still mad at her about Monaco! For the record!”\n“She’s there? Miss Potts is there with you?”\n“Yep,” Tony says, and then, “That two-timing — wonderful, perfect paragon of virtue, I was saying, hey, Barton. Okay, good. Good. What side of the cell is the door on — can you orient yourself?”\n“No, if you’re going in there,” Steve sighs, convincingly, “You have to turn west. Do you know which way west is, Tony?”\nOne of the guards, back at the wall, snorts, and Steve bites down on his grin. Buck, he thinks, you goddamn crazy person. He wonders if Bucky could somehow be listening; he wonders if Bucky would laugh too.\n“Anyone ever tell you you’re kind of a dick?” Tony asks.\n“I can’t believe you graduated from MIT,” Steve replies, keeping up the charade.\n“How many guards outside your door at any given time?”\n“Five or ten minutes, I don’t know. Not very smart of them. Why, do you want to visit?”\n“Well, that’s classified,” says Tony, imperiously. “I’m only looking at specs, just in case — I got the blueprints fine — security in this country has gone to shit, by the way, literally everything is on the internet — but I thought I could get a better idea if I talked to you directly. Also the Red Death stopped by and threatened me with firearms.”\n“Miss Potts?”\n“No, the other one.”\n“Oh,” Steve breathes.\n“Oh,” Tony mocks, equally breathy, and mumbles, “Jesus.”\nIt crashes back on Steve: he’s hotly ashamed that he ever forgot, but he did forget; he somehow forgot entirely. “Tony, I —“\n“I always knew,” Tony says. “Okay, not always. I mean, I always knew it was — accidents like that. Accidents don’t just —“\n“Accidents don’t just happen,” Steve agrees, and echoes Brock Rumlow: “Not in a world like this.”\n“It was actually your wife,” Tony says, after a long, heavy pause, “Who told me. I didn’t hear it on Twitter. Thank God. She got a hold of me one day after the whole clusterfuck and she — she — she bled it all out, that’s what happened, and now I know, so.”\n“Tony.”\n“Five to ten guards, western entrance, comm to the right; is that correct?”\n“Tony, listen to me.”\n“You know, I get it,” Tony says, tightly. “I get it. He’s not the only person alive who went under and woke up with a big hunk of metal surprise-sewn onto his body. We’re both patchwork people.”\n“Well, you’re my people,” Steve says. “So tough shit.”\nFor a moment Tony is silent. Then he says, “This is seriously, seriously not a conversation for right now. Or, you know, preferably ever.”\n“Wait, Tony —“\n“What?”\n“How’s Miss Potts? Really?”\nTony huffs. “Listen, I already said that Romanoff is —“\n“No, really,” Steve repeats, with meaning. “Really, how’s Pepper? Is your girl okay?”\n“She’s — we’re good,” says Tony, thrown; touched. There’s a moment’s pause, and then the line goes abruptly dead. Steve, after a good twenty years of this, can’t even be surprised.\n—\nJulianne Simpson @julisimms\nSo HYDRA isn't a terrorist organization but every brown guy alive was responsible for 9/11\nJulianna Simpson @julisimms\nHYDRA’s acts are literally the DEFINITION of domestic terrorism. Call it what it is @FoxNews @CNN\n—\n“Who is it today?”\n“Lawyer.”\n“Right,” Steve murmurs, and gets to his feet, and after the slow shuffle down two halls and into the private room, he’s seated and cuffed to the hard steel chair. Bernadette Rosenthal, his attorney, nods to the guards: “I’d like a moment alone with my client,” she says, and the men leave. “We’ll be speaking privately,” she adds, and the door sucks shut.\n“Well, good news: jury selection has been moving along well,” Bernadette tells him, shuffling through her briefcase. For a moment all Steve sees across him is her dark head of long styled hair and her sharp red suit. She sits up again, pushing around her papers. “Where’s the camera in this room?”\n“What?”\n“The camera, Rogers: is it behind me?”\nSteve shifts and glances up. “Yeah,” he says, curious.\n“Perfect,” Natasha replies, and in one motion peels off Bernadette’s forehead and eyes and nose and mouth. “Stop making that face. Hi.”\n“Hi,” says Steve, dumbly. “What face?”\n“That one.”\nA smile is pulling at the corner of her mouth. Steve asks, “A guy can miss his best pal, right?”\n“Sweet talk isn’t getting you anywhere,” Nat tells him. “You’re on everybody’s shitlist.”\n“Yours included?”\nNatasha cuts a glance up at him and then turns her dark head back down, flipping through one of her files; the papers inside are all blank; she’s only doing it for the camera. “I need some things from you. Who arrested you?”\n“What are you planning?” Steve asks.\n“Oh, not me,” Nat tells him. “I’m not the mastermind, which is actually kind of insulting. It was the FBI, right? Who took you in?”\n“Agent Cagney — Margot Cagney, and two junior agents.”\n“Get their names?”\n“No, nothing. He said, when he — when he came to me, he said that he went to you. That he went to you, first. That you tried to kill him, Nat, Jesus; what —“\n“He took me by surprise; you know how much I like that.”\n“Stop beating around it, come on.”\nNatasha's eyes narrow. She pauses for a long moment and when she finally speaks Steve finds himself tensing, braced for it; he knows the Black Widow when he sees her. He recognizes the careful emptiness: Natasha becomes a mirror in these moments, a patient and dark reflecting pool. “It’s not him,” she says. “It’s not him anymore. He’s not who you knew.”\n“You think I don’t know that?”\n“No, I think you don’t realize it,” Natasha says. “I think you won’t realize it. How much do you think he remembers? How much do you think he wants to? The last time somebody did something to him without asking he got a metal arm sewn onto his body: how do you think he likes this — you, making his decisions for him?” She’s found where to press. “How do you think I like it?”\n“Natasha,” says Steve, really hurt.\nNatasha freezes, and stares into him, searching. She blinks: once, twice. “I’m — I’m —“ she says, and sighs hard, a sudden breath. “You messed up. Okay?”\n“Okay: I’m sorry.”\n“You’re really bad at apologizing.”\n“I’m sorry he had to leave you,” Steve says. “I’m really sorry, Nat. I’m sorry you had one good thing and he got taken away again and again. Protecting you? Yeah, you’re right, I don’t regret it; I can’t. But I am sorry you were alone. I think about — I don’t know, Natasha. I think about that a lot in here.”\nNatasha is still looking. “I’m sorry he had to leave you, too,” she says, hoarse and low, the tone she takes when Steve has run his mouth and it’s touched and surprised her.\n“You told him yet?”\nNatasha is confused.\n“Barton,” Steve clarifies. “Have you told him?”\nNatasha has a curious smile at the edge of her mouth. “Well. It looks like all my secrets are out now. Officially.”\n“That was never a secret, Natasha,” Steve says. Anyone who Natasha could want to live with that way — it really wasn’t. “Look at me: always late. Don’t waste time. Don’t waste time like I did.”\n“Death row makes you pretty introspective.”\n“Dying man’s wish,” Steve agrees.\n“Now, don’t insult me,” Nat says, smirking. “No one’s dying.”\nSteve wishes he could take her hand. He wonders at how they ever met, he and Natasha: through years and wars and deaths, born decades apart, it seems so strange and serendipitous that they would find one another, that they’d somehow pinpoint each other in the universe; their identical, matching piece.\n—\nSteve jolts upright, gasping.\nHe isn’t sure at first why he has: if there was a noise or a shout or a nightmare. Then he realizes that something has shifted around him outside the cell, and he knows, like he always has, who’s there — who’s waiting. The intercom crackles alive and Steve squeezes his hands on the thin white mattress.\n“Hey,” says Bucky, after a moment.\n“How the hell did you get in here?” Steve demands.\n“Oh, you know.”\n“How are you gonna get out?”\n“Oh,” Bucky says, sounding slightly less sure. “You know.”\n“You’re dumber than a box of rocks, Barnes, I swear before Christ,” Steve tells him, but then he’s standing and walking across the little box to Bucky and pressing his hand to the wall where Bucky’s is, where the intercom button sits. Relief crashes through him. “You breaking me out?”\n“You never did have the slightest fuckin’ touch of subtlety,” Bucky says. “Does this look like a prison break to you? —Well, guess you can’t see me. I’m armed with six knives and dressed like a mailman. Long story.”\n“Well, you done more with less, Buck, I wouldn’t want to insult you,” Steve says, with deeply earnest sarcasm.\nBucky huffs a breath. Steve realizes it’s a chuckle. He can’t see Steve, and so Steve lets his brows draw and twist in pain, and he presses his forehead to the cool wall. He swallows. “Then what are you doing here?” Steve asks him.\n“Debrief. Got sick of doing the work through other people.”\n“You can trust them, Buck.”\n“Sure,” Bucky agrees, though he doesn’t sound convinced. “Look,” he says, “The problem is I don’t know how long it’s going to take, getting what I need to pull this off. And if I’m not fast enough, I’m gonna end up fucking you over. I can’t have that.”\n“Is anyone gonna tell me what’s going on?”\n“You’ll know when you know, but don’t you ever doubt I’m on my way, alright? No matter how long it is, trust me.”\nThere’s a pause. Steve shuts his eyes. “What about you, Buck?” He asks, quietly. “Tell me. Where you stayin’? You eat today?”\n“Bulletproof Barnes, that’s me; same as ever,” Buck says, though the lie is hideous: he never was a very good liar. He scoffs. “Look at you, mother hen.”\n“Raising a kid,” Steve says, and Bucky is quiet. “A daughter in particular, maybe. That’s what did it to me.”\nBucky is still quiet; terribly quiet. “Tell me her name?” he finally asks, hopeful. Splintered.\n“Kathryn,” Steve says, and hears Bucky makes a noise before he tamps it down. “Kathryn Morita.”\nBucky barks a laugh. “No fuckin’ way.”\n“Jim’s kid, yeah, his name is Joe; he’s a good guy; he’s good to her.”\nBucky’s voice sounds thick and terrible: he still cries easy, realizes Steve, and it makes his whole chest hurt like a bruise. There he is, in there. Steve sees him. Steve always will. “What does she do? Take after her old man?”\n“No sir, she teaches biology at Carnegie Mellon. She’s smart as a whip, and she’s boring as hell, Buck, can’t even shoot a gun, and I’m so proud of her — if I think about it too hard it makes me cry, even. Every time, I swear to God.”\n“I know you do; I always knew you would,” Bucky confesses, and Steve laughs, wetly, and presses his palm flat to the wall, his shoulders shaking. “Oh, God,” Bucky says, low and hurting. “Oh, Christ.” It’s hellish that Steve can’t touch him. They missed so much of each other, living parallel for decades: the years between them feel suddenly insurmountable and massive, and if he thinks about it too long, the time they lost, he’ll crumble right to pieces under the weight of it. He doesn’t know how Buck is still standing up.\n“Peggy’s hair, dark hair,” Steve manages. “My eyes.”\n“Your nose?”\nSteve laughs again and has to scrub at his face, sniffing. “Jesus, no. Thank God. She’s going gray.”\n“Is she?”\n“Yeah, and doesn’t even dye it; she doesn’t care. She’s beautiful anyway.”\n“Of course she is: she’s yours,” says Bucky, soft, and they stand in silence for a long, long minute. Steve wants to tell him everything. Everything. Everything that he’s missed, everything he wasn’t here for. He wants Bucky to feel like there wasn’t a minute they didn’t live out side by side, next to each other; but there isn’t time for that. Not now.\n“Carter sent me with pencils and a notebook,” Bucky says finally, and there’s a shuffling. “Check all the pages, huh?”\n“Alright.”\n“Why are the pencils colored?” asks Bucky, in a reluctant and hesitant way.\n“Oh,” Steve says, and realizes that must be a gap for him. “The serum. Fixed that too.” And like it was yesterday Steve remembers it, the first red he ever saw: Peggy’s mouth, hanging open in shock. He thinks of the long tour with the USO and his sweet friends, the chemical smell of their bright makeup when they let him try his hand at it so they could fix their hair at the same time: he remembers the first time he was back in New York after weeks and months waiting for Bucky’s telegrams, the lunch hour between rehearsals he used to steal himself away to the Met. He went, immediately, to find his favorite piece, but his eyes kept getting distracted along the way; there were so many colors around him it made his teeth hurt, his heart pound. Then finally he found it, where it always had been: Oleanders, Van Gogh’s stocky, life-affirming flowers.\nSteve’s knees hit the back of a bench, and he stumbled and sat, one hand over his mouth, mapping his own smile. Steve shook his head, and trembled, and stared in awe at the livid orange-reds, the deep violets; the vibrant, lively greens, which seemed somehow to breathe. Wetness touched his hand, and he knuckled away the tear: around him tourists milled the hall and he laughed under his breath like a crazy person.\n“It’s so strange,” Steve hears himself saying, still touching the blank and sterile white of the cell wall. “I had this picture of you in my head for so long: my whole life, I guess. But I didn’t know, not really. After the serum, when I looked over at you, walkin’ back to camp…” Steve shakes his head. “And there you were, anyway. There you were, all in color.”\nBucky is silent, and Steve’s insides twist. “You remember what my ma used to say?” he says. “Jesus; maybe you don’t. She said — she said before she died, she told me: never try and wish back the dead. And don’t grieve them too hard, either. Then they won’t pass through, and you’ll keep them stuck here forever. Did I do that to you? Is that what I did?” Inside of his chest his lungs shudder. He feels wretched and hurting and the guilt twists in him like a snake or a wire, stabbing him through. “I should’ve reached farther. I should’ve thrown myself out —”\nBucky’s voice is tight. “Don’t say that shit.”\n“I almost did, Buck, and my whole life I didn’t know if I regretted it or not —“\n“Shut up —“\n“I wanted to,” Steve confesses. “I wanted to.”\n“Shut your fucking mouth, Rogers,” Bucky snaps, his voice low and hoarse and hotly furious. Then abruptly it softens. “What about Kathryn then, huh? What about your little girl then?”\n“Kat,” says Steve, in a quiet way. “We call her Kat. You should too.”\nBucky is silent again and Steve digs his fingers into the wall. “Take it,” Bucky says, finally. “And wait. Can you keep waiting for me?”\n“Forever,” says Steve, knee-jerk.\n“Dramatic.” There’s a smile to be heard in Bucky’s voice. “Good to know. But not that long.”\n—\n\nCANNES, France — When I received an invitation to the Cannes Film Festival instead of the usual press pass, I thought it was because I was the punchline of a particularly mean-spirited joke.\n\n\nIn 1966, my father, Lyle Everhart, broke a story that launched his career. Incidentally, it also changed the United States of America. Truthfully, my father was a distant man; he found success in 1966, and that success endured until his death. He had more important work than staying home to raise a family, but despite this, when I was in university studying journalism, I respected my father’s work: when I was hired by Vanity Fair after several years doing freelance, I privately credited Lyle’s tenacious ability to find the truth of any story as the root of my own competence and passion. Now that it has been revealed that my late father was unknowingly complicit in HYDRA’s systematic destruction of the US, I have found myself rethinking what good journalism should mean.\n\n\nOnce I opened the invitation to Cannes, I poured myself a glass of wine and called my close friends and family for advice. “Christine,” my best friend told me, “This is just insulting. You know how this movie is going to paint your dad. You don’t want to see that.” Then she sighed. “You’re going to see it anyway, aren’t you?”\n\n\nShe knows me well. Though I was apprehensive, I was also too curious to let it go. I had to watch “The Informant” from an objective, journalistic viewpoint: I had to know how the public views this situation.\n\n\nI met David Fincher after the red carpet, just before the film’s screening. Despite being a guest, I brought my notebook and pen and kept them tucked into a clutch that I held by my side; I was uncomfortable and nervous in my gown, and I looked it. I was also alone, and I felt increasingly small and childish in the presence of so many Academy Award winners. Mr. Fincher shook my hand and complimented me, which is probably a good foot to start on when one has made a film about your father’s questionable career. “I appreciated the spread you and Annie worked on last year,” he told me, referring to a portrait of his work that Annie Leibovitz and I collaborated to create for Vanity Fair.\n\n\n“It was a pleasure,” I told him. My hands were clammy.\n\n\n“Do you think Jesse was a good choice for Lyle?”\n\n\nJesse Eisenberg does look a lot like my dad did when he was young. I somehow formulated an appropriate response.\n\n\n“Come sit with me,” Mr. Fincher said, and ushered me along with him. “Take out your notebook,” he added, though I don’t know how he knew that I had one. “Take notes during, if you want. I won’t be offended. That would actually be pretty fucking flattering.”\n\n\nI sat with my notebook in my lap for two and half hours and I never wrote a single word. It wasn’t to spurn David Fincher, either, who I am now surprised but pleased to call a friend. The depiction of my father by newcomer Jesse Eisenberg was not outrageous or slanderous. He was a young investigative journalist, hungry for a breakout story the same way all my colleagues and I were at that age. Like many other young journalists, he found a reliable source with a fantastic story to tell, and he chose to tell it, disregarding the consequences. It was surreal to see someone play Lyle on the silver screen, but I found myself too arrested by the film to be upset: I was already immersed at the opening shot of Washington DC at midnight.\n\n\nThere was a great deal of controversy surrounding the decision to screen “The Informant” at the Cannes Film Festival in lieu of other works that are less “Hollywood.” Despite this it performed astoundingly well, working its audience into a tense fervor: the standing ovation endured for ten minutes. I looked over to David during it. He seemed stunned, and when he stood for a bow, the audience roared. It was like being at a Mets game.\n\n\nIn the two minutes it took for this response to start trending, people were already asking the question: Why? What could possibly happen in “The Informant,” a nearly three-hour film, that makes it so resonant with a jury of its peers?\n\n\nTherein, of course, lies the answer. This is my journalistic analysis, in the form of an objective film review: “The Informant” is unavoidably politically relevant, and its release, precipitating the trial of Steve Rogers, asks the world to reassess how media has portrayed America’s most infamous love story. Instead of following James Barnes or Colonel Rogers themselves, “The Informant” crafts the parallel tales of Margaret Carter (Emily Blunt) and a HYDRA sleeper agent known only as “Agent 15” (Matthew Rhys) as he uses his day job to search for — and ultimately uncover — ruinous information in the depth of SHIELD’s archives.\n\n\nPerhaps it is the unflinching critique of American mass media and secret-keeping that veers this film away from both the Bond-like thriller and the now-clichéd Redford Cold War classic. Perhaps it is that Mr. Fincher is the first to explicitly use intelligence from the 2009 SHIELD leak as a plot device in a feature film. Or it may be the devilish, unforgiving use of foreshadowing: the film drops creepy, sparse nods to the events of the future throughout, specifically the eventual collapse of the international intelligence community and the slow crumble of the US government. It could also very well come in part from Emily Blunt’s stony and sympathetic performance; Blunt’s Carter is infused with a kind of tense resolve, and when she finally begins to crack and splinter, the fury and sadness is paralyzing. Even Agent 15’s subplot — his wife and child in the USSR — manages to bolster the narrative.\n\n\n“The Informant” is coasting more than slightly on the coattails of precedent, of course. This film requires no introduction and zero explaining, artistically or otherwise. Even the cinematic trailer, which has been playing in theaters worldwide now for months, reflects this. “It’s been a long, long time,” croons Tina Louise, saccharinely, as increasingly violent images crash across an otherwise silent screen; no explanatory dialogue is provided. Smartly, the film plays on expectation, cultural knowledge, and current tensions. Riskily, it humanizes a dreadful villain, criticizes the impending Rogers trial with immense vitriol, and paints a picture of the Cold War that is at once fictional and nonfictional, believable and fantastic, bleak but human.\n\n\nCaptain America films are hardly a new frontier, and they have been earning disastrous reputations since Steve Rogers himself was a member of the Screen Actors Guild. “I know,” Mr. Fincher told me, when I expressed this at the after-party. “You have no idea how hard it was to pitch this movie. Half of the money for it came from my pocket. I almost made it in my back-fucking-yard. I only got approval because I told the studio that it wasn’t a movie about Captain America at all.”\n\n\nMr. Fincher is right: this film isn’t about Captain America. In a penultimate scene, Howard Stark (a curiously-cast Jon Hamm) finally loses it: “This destroys everything,” he explodes, as Barnes’ letters, leaked as a result of Agent 15’s diligent work, are passed from his hands to Carter’s. Indeed, each turning point in the film involves the letters changing hands: from Agent 15 to a green New York Times reporter, from Stark to Carter, from cubicle to cubicle in the newsroom, from civilian to civilian across the country. “The Informant” isn’t a Captain America movie because it is not about Captain America at all — except, of course, for how it is. While the community around him hurtles into darkness, Steve Rogers is a fixed point, appearing only in one scene: he serves as the letters’ final resting place. The final shot of the film follows a blond head walking for one entire breathless minute through the DC SHIELD facility (now destroyed) in absolute silence. Finally the faceless Rogers reaches an office, opens the door, and steps inside. He draws the blinds on the audience, and then the screen goes dark.\n\n\nFor me, this was the most personal moment in the film. It far outweighed watching an actor portray my deceased father onscreen. I would even hazard to say that this single continuous shot is why the ovation endured: never in cinematic history has an audience been so criticized for simply watching a movie.\n\n\n“It was private,” Mr. Fincher told me. “I mean, you go through this whole process, all of this insanity, politicians throwing a fit, Carter, you know, killing herself as she tries to hold it all together, Stark filing a lawsuit…and at the end of the day you see that it was for nothing. At the end of the day the private became public, and it upended a man’s life. You get caught up in this whole fantastic drama, how big it is, how it’s going to impact the country, how famous or infamous it is, etcetera, etcetera, and you don’t even notice that Rogers isn’t actually in the movie at all. And the last shot, bam: it was bullshit. It was all bullshit. The last shot: this is what matters. One man. And he’s ruined. He’s just ruined. So shame on you. Shame on you for watching. Shame on you for getting off on the spectacle, shame on you for giving me money to see it. Shame on you for following the trial hoping for entertainment.”\n\n\n“And what about Lyle?” I asked Mr. Fincher.\n\n\n“Shame on us for exploiting him, too,” he said. “Journalism and filmmaking, you know, I think it’s kind of similar. We’re not Cronkites and Hitchcocks anymore. We’re not that honest; we’re afraid of it. But with this film — I mean, there’s a spin to everything anymore. But with this one, I tried for honesty.” Then he changed the subject. “Are you glad you came?”\n\n\n“I am.”\n\n\n“Good,” he said. “I had to pull a lot of strings to get you that invitation.”\n\n\n“The Informant” will premiere nationwide next month.\n\n\n(Everhart, Christine. “My night at Cannes.” The New York Times 2 Feb. 2010. Print.)\n\n—\nMy darling,\nPromise me to say precisely what you’re thinking, you ray of absolute sunshine. It’ll be terribly worth it.\n-P\n—\n\n“I am Steve Rogers. In the eyes of this nation I was born as the creation of science and the hero of war. I did not, however, spring fully formed from a thought, to shine a lantern on the path to victory. I was born Steve Rogers, the son of an unwanted immigrant woman whose hard work led only to her slow death.\n\n\n“As a child in Brooklyn I listened to the stories our neighbors told, the stories of heroes who defended the freedom of their nation, many nations, and I hoped then that life might offer me the chance to serve, to protect, to make my own contribution to freedom. Eventually, it did.\n\n\n“I have done whatever I did, alone or as a leader, because of my love for the people I love, for the freedom that they, too, stand for, and not because of any political sentiment.\n\n\n“Having said this, I must address the charge of treason. I do not deny that I planned and participated in the destruction of HYDRA in the United States government. It will be determined by a jury of my peers whether protecting the victims of HYDRA was the right thing to do, and if, by rooting out what I saw as a dangerous corruption at the heart of our nation, I endangered the freedom of its people.”\n\n“Alright. That was just today. Welcome back to Anderson 360: today I have constitutional lawyer Martha Banks, whose commentary on legal issues around the country has been invaluable to our show. We just aired Steve Rogers’ statement to the press, given earlier today before proceedings in United States v. Rogers began. The clip is available on our website, CNN.com.\n“It’s great to have you back, Martha.”\n\u2028\u2028“It’s great to be back, Anderson.”\n“Martha, several weeks ago you came on the show to give us your take on what would become the US v. Rogers case, the opening statements of which were heard today. Now, at the time I asked you about Steve Rogers’ behavior, his tendency to take the blame when protecting others, and you said, and I’m quoting here, “As a lawyer… I would never want him as a client.” In light of his recent, rather moving statement, do you still feel the same?”\n“Absolutely, Anderson. In fact, I feel like sending his lawyer Rosenthal a fruit basket in commiseration.”\n“And why is that, Martha, beyond the, let us say, contentious public reaction?\u2028\n“In a nutshell, Steve Rogers has just burned a lot of legal bridges. While the prosecution still has to convince the jury that what Rogers did was illegal, if they do, it’ll be very difficult for his lawyer to get him off on any lesser charges, make any kind of plea deal.”\n\u2028\u2028“A lesser charge in comparison to what?”\n\u2028\u2028“Treason, Anderson.”\n“That is an extremely serious charge, is it not?”\n\u2028\u2028“It is. I’d like to point out, however, that had the founding fathers not succeeded in establishing a new nation, they too would have been tried for treason, yet we hold them over all other men in our nation for what they did.”\u2028\u2028“Sounds like a bit of a personal bias there, Martha.”\u2028\u2028“Yes. I’m sure you remember our last conversation, but I don’t mind repeating that I think something is wrong here. Rogers has protected our lives and our freedom at the cost of his own, and likely still is. He should have had amnesty from the beginning, just for bringing all of this to light. I think that, disregarding whether or not it is legal for our nation to prosecute Steve Rogers — or, for that matter, Peggy Carter, or Natasha Romanoff — it is absolutely the wrong thing to do.”\n\n(Anderson 360. “Martha Banks: Candid Answers.” CNN. Television.)\n\n—\nThe New York Times @nytimes\nOpening arguments in #USvRogers heard: “Rogers was aware of his wrongdoing,” prosecution says cnn/e234DL\nCNN @CNN\nRomanoff and Stark arrive together early for Rogers trial, first courtroom illustrations released cnn/45eD1\nStephen Colbert @StephenAtHome\n“Do you harbor romantic affection for Sgt Barnes?” “Have you turned on the news in the last 20 years?” #micdrop #USvRogers\n—\n“So,” Sam says, and he eyes the guard behind the partition, “One week in.”\n“One week in,” Steve agrees: nobody else is in the hall, and their voices bounce and echo strangely. He curls his hand around the white plastic phone and shrugs.\n“You nervous yet?”\nSteve wants to ask: is he coming? Are you in on it? Is he still coming for me? “I’m — I don’t know,” says Steve, instead. “I’m something. I’m definitely something.”\n—\nTHE PROSECUTION: Is it true that you were separated from your wife, Margaret Carter, for fourteen years?\nTHE DEFENDANT: That’s right.\nTHE DEFENSE: Objection, relevance.\nTHE COURT: Overruled.\nTHE PROSECUTION: Why?\nTHE DEFENDANT: I don’t know if you noticed, but 1966 wasn’t my best year.\n(laughter)\nTHE PROSECUTION: Let’s pretend I didn’t know that, Col. Rogers.\nTHE DEFENDANT: Not too hard. You were born in ’85? I did my research too; you understand.\nTHE COURT: Order. Order. I don’t want to hold you in contempt, Col. Rogers.\nTHE DEFENDANT: I apologize, ma’am.\nTHE PROSECUTION: Why was 1966 a bad year for you? You understand that this is a bit of blank space in your history. Where were you in 1966? What were you doing for fifteen years with next to no outside contact? Was there truly no outside contact?\nTHE DEFENDANT: Ask the question. Go on. Ask the question, Mr. Alvarez.\nTHE PROSECUTION: For fifteen years you fell off the map with no explanation whatsoever. Did you or did you not make contact with Sgt. James Barnes during that time?\nTHE DEFENDANT: No.\nTHE PROSECUTION: Can you prove that?\nTHE COURT: Order. Order. Order in the court.\nTHE DEFENSE: Objection —\nTHE PROSECUTION: Withdrawn.\n—\nThe New York Times @nytimes\n#TonyStark called as first witness in #USvRogers\nNadine Bell @belliff\n“State your name for the record.” “You know who I am” oh my god #USvRogers\n—\n“Did you harbor the Winter Soldier?” yells the press while Steve shuffles past, flanked by security. “Do you sympathize with the Winter Soldier?” The favorite: “Where is James Barnes? Colonel Rogers,” one woman yells, tireless even at end of day, “Where is James Barnes?” And Steve thinks, me too, sister, and Steve thinks, I’ve been asking that question a hell of a lot longer than you.\n—\nTHE PROSECUTION: How long did you work with SHIELD?\nMS ROMANOFF: That’s available online.\nTHE PROSECUTION: Humor me.\nMS ROMANOFF: I was first contacted in 2001.\nTHE PROSECUTION: That’s nine years.\nMS ROMANOFF: That’s correct.\nTHE PROSECUTION: When did you first meet Col. Rogers?\u2028\nMS ROMANOFF: I met him in 2007.\nTHE PROSECUTION: Did Steve Rogers have any contact with Sgt. James Barnes in the time you have known him?\nMS ROMANOFF: No.\nTHE PROSECUTION: I will remind you that you are under oath.\nTHE COURT: Mr. Alvarez.\n(silence)\nTHE PROSECUTION: Ms. Romanoff?\nMS ROMANOFF: What are you doing?\nTHE PROSECUTION: Ms. Romanoff —\nMS ROMANOFF: Are you trying to arrest me?\nTHE PROSECUTION: Did Steve Rogers have any contact with Sgt. James Barnes in the time you have known him?\nMS ROMANOFF: I already answered that question.\nTHE PROSECUTION: Is it true that you were involved with the Red Room?\nMS ROMANOFF: I was trained with them. Yes.\nTHE PROSECUTION: And HYDRA existed inside the Red Room?\nMS ROMANOFF: I’m having trouble remembering whose trial this is.\nTHE COURT: The witness is right, Mr. Alvarez. Step back.\nTHE PROSECUTION: Steve Rogers had no contact with the Winter Soldier in the last three years, that’s what you’re telling me.\nMS ROMANOFF: Steve Rogers uncovered and annihilated the most dangerous terrorist organization I’ve ever seen. I think he’s had other things to worry about.\nTHE PROSECUTION: No further questioning.\n—\n“Please state your name for the record.”\n“Margaret Carter-Rogers.”\n“Do you solemnly swear that you will tell the truth, the whole truth, and nothing but the truth, under the pains and penalties of perjury?”\n“So help me God.” She won’t look at him, though Steve’s eyes are huge, his chest hurting: he didn’t know, but he should have known; he should have realized. Of course she would be the last and of course they would call on her if they couldn’t have her otherwise. The public hates Peggy more than they hate him: because she’s a woman, because she was once a great liar, because she was pulling the strings all along. She brushes her hair back from her face with her thin hand and still she won’t look at Steve.\n“When were you married to Colonel Rogers?”\n“1947.”\n“How would you describe your marriage?”\nBeside Steve, Bernadette’s body is drawn tight like an elastic band, and she waits to snap for an objection. Peggy is hesitating. “Wonderful, truthfully. A journey. Quite a journey.”\n“Do you love your husband?”\n“Objection,” says Bernadette: “Relevance?”\n“Overruled. I believe Mr. Alvarez is attempting to establish character. You may answer the question, Ms. Carter.”\n“I do, absolutely. I love him most dearly.”\nAlvarez, a sturdy and strong-looking man, is considering what to say next. “When did you first know the true identity of the Winter Soldier? When did you know that he was James Barnes?”\n“1962.”\nThere are gasps as though a gun’s been drawn, a shout: Steve’s blunt nails bite into his palms.\n“When was Howard Stark made aware of the Winter Soldier’s identity?”\n“1962.”\n“Order,” barks the judge.\nSteve knows peripherally that there is the particular look spreading over Alvarez’s face; a shark smelling blood. “Who else knew?”\n“No one.”\n“The pertinent question, it seems, is why,” says Alvarez. “Why didn’t you tell anyone?”\nPeggy sits for a moment, her face astoundingly blank, her dark and clever eyes staring into him. Then she sighs and looks down at her hands, and back up once more. “I suppose it’s the question of the hour,” Peggy says. “I suppose it’s a very important one. I think what you’re really asking me is why I’m not the one on trial today, and here is the reason: the year was 1962. We did not always do things we were proud of. It is known that we did not always do things we were proud of, and if every person who kept a secret during the Cold War was put on trial for their lies, we would be here for centuries. I love my husband in ways I think are difficult to understand. Passionately, deeply, dearly — it’s a forever sort of thing, Mr. Alvarez — and we have, contrary to the insinuations in your questioning, talked far more intimately with one another about these topics than I believe you could ever realize. It tends to happen when you’ve been with one another for so long: there is nothing we don’t share anymore, nothing we don’t know of one another, nothing we can’t forgive one another for.”\n“Is there a point in here, Ms. Carter?”\nPeggy’s eyes narrow. She says, “I lied to my husband in 1962 and I kept lying to him for nearly fifty years. I didn’t do this because I loved him or because I hated him, or because I was jealous of a man long dead. I did this because I was making a sacrifice. I did this because I knew secrets, one secret, that could bring this nation to its knees. More than Howard Stark or President Kennedy or Director Hoover, I held a single responsibility: none of those men could have done their jobs if I wasn’t providing the scaffolding. None of these men could have done their jobs if they weren’t standing on my back and my shoulders while I held the USSR at bay. You seem very shocked and disturbed that I waited so long to tell my husband, but I would like you to consider what he would have done, in 1962, if he had known. My darling,” she says, and looks to Steve, “You know I don’t mean to hurt you when I tell them this.”\n“It’s alright, Pegs,” Steve says, only his voice is very small and choked, and it comes out very quietly.\nPeggy is still looking at him from across the room; an adoring, bittersweet smile is on her face. “What would he have done?” she asks the court. “My husband is a good man, I believe that: a better man than most of us could ever dream of being. He is good in a way that doesn’t go away. But he is an angry man, and sometimes even a vengeful man, and in 1962 he was a lonely man, and lonely, angry, vengeful men aren’t always to be trusted, no matter how good they still are on the inside. If he had known James Barnes was alive he would have torn the world apart to find him. He would have started a war: he would have wanted those powerful men who hurt Sergeant Barnes annihilated. I could not risk the lives of millions of our people, not even for the emotional safekeeping of the dearest person to me in the world. It tore me in two, Mr. Alvarez, though I don’t know how many here can understand just how deeply. I knowingly left a good man to an unspeakable fate, and I knowingly allowed another good man to suffer. There was no other way, and I assure you I exhausted every option.\n“This is the truth: it is a terrible day when you must choose between the innocent and the innocent. Sergeant Barnes and Steve Rogers were innocent, as innocent as soldiers can be, but so were millions of others, in both the USSR and the States. I chose the many, and that choice proceeded to destroy my life, my marriage, and my dearest love. But I would not change it. I would not change that choice, even now, even knowing what it has led to. I saved who I could. I did my job. I am a deserter, yes. I am a liar. I am a spy, a soldier: I am many things. I am not a traitor. I’m trying, now, to tell the truth where I can, though it’s hell to unlearn the secrets.\n“And I still know secrets — yes, even now,” Peggy says, and Steve’s chest does something cold-hot all at once, a shocking, lurching, flipping sensation. “I know a great deal many things, Mr. Alvarez, though I think you hoped I was of both fragile mind and body. But it turns out that people are still telling lies, and those people are no longer me. They’re telling hurtful lies and taking dangerous shortcuts. Does this sound at all familiar to you?”\n“Permission to treat the witness as hostile,” Alvarez says in a rush, and Judge Williams snaps, “Sit down. Director Carter, do you have something to bring before this court?”\n“Thank you,” Peggy says, and she looks to the prosecution, her eyes flinty, furious. “I want you to learn this, Mr. Alvarez: attempts to sensationalize us and our hardships will not do. We may be old, and I may be frail, and we may not be that which we once were: our glory, our accomplishments, our time may be behind us. History must seem very stale to you — to those who weren’t there. History must seem a tome, and we must seem very dusty. That is untrue. History was brutal. History was violent. We may be ancient, outdated; but our spirits, our will — you and men like you, Mr. Alvarez, the cheats, the snakes, the wolves of the world — you will never break that, you will never find it lacking, you will never see us weak or feeble or exhausted of this fight. We will not allow it.\n“There was a man once. I don’t know if he was a good man or a bad man, and in fact I know nothing of who he was: if you can believe it, he was rather before my time. But he said great words, Mr. Alvarez. He said words that endured. ’Tis surprising,’ he said, ‘To see how rapidly a panic will sometimes run through a country. The cunning of the fox is as murderous as the violence of the wolf. I hold up truth to your eyes.’ Do you know who he was?”\n“No.”\n“‘I turn with the warm ardor of a friend to those who have nobly stood, and are yet determined to stand the matter out,’” Peggy quotes, and stares into the people of the court. “‘I call not upon a few, but upon all: not on this state or that state, but on every state: up and help us; lay your shoulders to the wheel; better have too much force than too little, when so great an object is at stake. Let it be told to the future world that in the depth of winter, when nothing but hope and virtue could survive, that the city and the country, alarmed at one common danger, came forth to meet and to repulse it.’\n“Ladies and gentlemen of the jury,” Peggy continues, “‘These are the times that try men’s souls. I thank God that I fear not. I see no real cause for fear. Twice now we have marched back to meet the enemy, and remained out till dark. Let them call me rebel; I feel no concern from it; but I should suffer the misery of devils were I to witness the slain of America. Tyranny,’” she says, and the massive doors of the courtroom are slammed open, boots thundering: Steve turns and hears the din: yelling, shouting, a vicious struggle. Peggy’s voice rings out above it all. “Tyranny, like hell, is not easily conquered.”\n“Listen to this,” Bucky Barnes says, and the file and the tape recorder slam and echo on Judge Williams’ bench. “Proof of conspiracy all the way to the core of this fucking government. He’s free to go.”\n—\nJulia Schmidt @jschmidtty\nholy shit america u ok??? #TruthIsOut\nStephen Colbert @StephenAtHome\n@jschmidtty Honestly? At this point I’d rather have no government than a corrupt one. Things are looking up.\nThe New York Times @nytimes\nWho is president when half the cabinet faces impeachment? Attorney General Montoya is sworn in for the interim nyt/ksiwrU\nCNN @CNN\n“The FBI and CIA are under UN investigation,” says Montoya after emergency swearing-in: “We will persevere” cnn/DJFdse\nHuffington Post @HuffingtonPost\nFuture candidates drastically redefine campaigns: \"All of my correspondences are now available to the public\" says Sanchez, NM\nCol. James Rhodes @IronPatriot\n“There is no easy walk to freedom anywhere.”\nView more in conversation —&gt;\nJanuary Bell @janbella\nRT @IronPatriot #Mandela\nNoah Marshall @nomarsh\nIf rumors are true &amp; @IronPatriot is running for president he has my vote\nThe New York Times @nytimes\n#JamesBarnes granted amnesty, nation in an uproar: “He has done incredible good” says Montoya nyt/LDFedkD\n—\nBucky is gone. Bucky is gone for weeks and a month and then two. He’s there when Steve hugs Natasha fiercely to him outside the courtroom in the bright white sunlight, and between one blink at the next, between the reporters flocking and Natasha’s feet touching the ground again, he’s performed a deft sleight of hand and vanished back into the crowd, and Steve doesn’t see him again: for weeks, and a month, and then two. So he goes to his daughter in Pittsburgh.\n“It’s been a really long time since I’ve seen you,” he tells her, and stands uncomfortably in the doorway of her new and expanded office: there are still boxes unpacked, and textbooks upon medical journals upon novels laying about. “How are you? Let me look at you.”\n“I’m fine, Dad. Look, I’m fine,” she says, and hugs him, and he holds her too tightly: “I gotta breathe,” she complains, but doesn’t let go. She hangs on and on until it’s Steve who’s having trouble. “I got all the brains in this family, didn’t I?” she asks, wetly.\n“You really did,” Steve tells her, and when Kat says he should stay the week, he does. He stays for two, even though she won’t talk about her mother; even though she turns her phone face-down on the table whenever there’s a call from DC. Steve calls back, though: he calls back every night.\n“Do you think she’ll hate me forever?” Peggy asks.\n“She doesn’t hate you,” Steve chides. “Remember when she was sixteen and we couldn’t get through dinner without those bad long silences? And then we just started eating in separate rooms, you in the office, me in the kitchen, Kat at a friend’s?” Peggy is silent. “She might have hated us a little then,” Steve concedes, and lays down on his back in bed. Joe and Kathryn are talking two rooms over; he can hear them. Low, every-day talking: married-talking. “She doesn’t hate you now.”\n“You always were better with her. I’m afraid I —“ Peggy sighs, deeply, in a tired way. “I was never quite cut out for it, was I? Mothering, all of that. I kept trying to make it fit, but it never really did.”\n“No, Pegs, that’s not it,” Steve says, and tells her: “She turned out okay, didn’t she? She’s gonna get tenure soon, I’m sure of it. Husband, two kids; she’s happy.”\n“With very little of my help.”\n“Now that just isn’t true.”\n“I’m just — I’m guilty, I think. Twilight years of my life, all that. Don’t pay me any mind, darling.”\nSteve turns to his side on the bed. “Well, I love you,” he tells her in a quiet tone. “I forgive you. I’m proud of you. I’m so fucking proud of you it makes my teeth hurt. Twists my insides up. I’m proud you’re my wife; I’m proud you’re so brave, even after everything.”\nPeggy is silent for a moment, and finally she says, “Tell her I love her. And Joe. The children, if you see them.”\n“She knows, Pegs, but I’ll tell her anyway,” Steve says, and asks, “Stay on the phone with me?” and he listens to her fall asleep.\n—\n“Stark asked me to move to New York,” Sam tells Steve, when he’s back, and when Steve loops around and asks, “What?” Sam gives a shrug, bracing his hands on his knees and panting.\n“Actually a dude who looked like Samuel L. Jackson came to my door with burgers and said,” and here, Sam imitates Nick’s voice: “Let’s go for a walk. And I said sure, because I thought I was in trouble with the IRS for a second.”\n“Is Samuel L. Jackson the one from Pulp Fiction?”\n“Yeah.”\n“Wow,” Steve says. “He does look like him, doesn’t he?”\n“Like, a weird amount, dude. I can’t believe you never saw this.”\n“You going?” Steve asks, and already knows the answer.\n“You coming?” Sam counters, but he knows the answer to that, too. “Nick Fury needs my help. I don’t know any better reason to get back in. And I guess you don’t know any better reason to stay here, huh?”\n“He’d find me if I was in Timbuktu, Sam.”\n“You think he’s just getting his head on straight?”\nSteve shrugs. “I know he’s out there in the world. I know he’s —“ Steve thinks it sounds ridiculous, maybe childish, but he says it anyway: “I’d know if he wasn’t alright. I’d feel it.”\n“Buy me breakfast,” Sam suggests, clapping him on the shoulder. “And, uh, help me pack.”\n“I knew you were going to rope me into something.”\n—\n“You got some coffee?” asks Bucky, after two months and a week, leaning in the doorframe.\n“I can put a pot on,” Steve tells him, rubbing at his eye: it’s two in the morning. He moves aside to let him in. “You hungry?”\n—\nBucky is asleep before he even lays down on the couch, his boots still on the way he kept them on in trenches and bedrolls and cots: he lays on his back, utterly still, and his left arm hangs so his knuckles touch the carpet, glinting dimly. The quiet presence of him makes the apartment feel full, suddenly somehow lived-in; Steve makes coffee anyway, and washes his three dishes by hand, and sits at the table, and locks the door after a while. Bucky sleeps through, sleeps like a stone, sleeps like the dead. He sleeps like Steve hasn’t seen anyone sleep since 1943 before he had to learn to sleep on the front, where even taking your trousers off to go to bed could mean being the first to die in an ambush. Steve is tired because he hasn’t been resting much either, but he stays awake, scared to close his eyes, even when light creeps up behind the white plastic blinds.\n“Morning,” says Steve from the table, when Bucky wakes and stands and wanders into the kitchen, pouring himself a cup.\n“Morning,” Bucky echoes.\n“Are you back now?”\nCagey, and without looking at him, Bucky says, “You want me to be back?”\n“Don’t you pick a fight with me.”\nBucky’s jaw is flexing: Steve sets his shoulders. “Steve, you’ve got to understand —“\n“You can’t leave,” Steve says, and tries not to sound as desperate and horrified as he is. “You can’t come back and leave, that’s just — that’d just be cruel, Buck.”\nBucky stays quiet.\n“What?” Steve demands.\nBucky shrugs a shoulder, bitter and tight. His mouth twists. “Nothing.”\n“Don’t you fucking —“\n“Look, Rogers —\"\n\"Buck.\" \n\"I didn’t mean to fall asleep. I just came by to say —“\n“Shut the fuck up,” Steve says, panicked. “Shut your fucking mouth. No. No, Buck. I won’t hear it.”\n“Jesus, can’t you — I’m not that person,” Bucky explodes, wheeling on him. “I’m not that person anymore, can you understand? That — chickenshit kid, too scared to say it to your face, that unhinged motherfucker who went ballistic on the Krauts hoping to bleed it out of me — you were looking for that person, it’s that person you —“\n“Don’t you tell me what I want,” Steve snaps, standing. “You don’t know what I want.”\n“Yeah? Fuck you,” Bucky says. “You never did know what was good for you. Just because I wrote you a couple of pretty words, you and the rest of planet Earth thinks it makes up for all the necks I’ve snapped with my bare hands.”\n“Bullshit,” bites Steve.\n“I killed presidents,” Bucky says, and when Steve doesn’t react, he drives the knife in: “Women. Children. In the war —“\nSteve is exasperated. “That was a hundred years ago, Buck; we did what we —“\n“We did what we had to do, is that what you tell yourself, is that how you slept at night? The men I killed had families, lovers, children —“\n“They were bad people,” Steve says. “They were Nazis, Buck; Jesus, what the fuck is wrong with you?”\n“I was bad people,” Bucky hisses. “I was bad people, Rogers. I wasn’t any fucking better than any of them.”\n“You know how many people I’ve killed? Fuck you, too, Barnes,” Steve tells him. Bucky’s eyes go narrow. “Sixty years and you think I haven’t changed too? I had to live without you my whole goddamn life. My whole life, Bucky. I had to wake up and brush my teeth and — and get dressed, and make breakfast every morning, and I had to do it without you — I was without you, Bucky, I was without you for sixty-four goddamn years. It was like walking around sawed in half. I never breathed. And what did I do in between that? I killed people, Buck. I killed who they told me to, and turns out it was HYDRA giving the order all along. You’re no worse than me, why don’t you understand that? It wasn’t you, Bucky!”\nBucky scoffs. “No, you’re right,” he says, pleasant enough, strolling closer to Steve, which means that he’s really and truly furious. “You’re right, Steve, you’re right, there it is, you said it yourself —“\n“Buck —“\n“You said it yourself, all I’m good for is killing,” Bucky says.\n“I didn’t —“\n“And that's all I’ve been good for since I was twenty-six years old. Do you know that? Do you understand what that means? It never bothered you, you can file it away, you can say that we’re good, that they’re bad — you can draw lines in the sand and know you’re on the right side, but I can’t do that, Steve, I can’t; it doesn’t matter who’s good and who's bad to me — I kill a man and all I think about is his family, his mother, his children, Jesus, and I’ve done it so fucking many times, so many times I can’t remember some, so many times I’ve lost fucking count —“\n“Bucky —“\n“I deserved it,” Bucky hisses, his eyes wild. “I deserved it, Steve.”\nSteve feels as though he’s been punched in the gut, or worse. “What?”\n“I deserved it,” Bucky enunciates. Steve nearly doubles over in horror. “What they did to me, I was fucking asking for it. It didn’t start when they got a hold of me. It started so long before that. I was already — Jesus, you know, I don’t remember the war, not the — the specifics, but I remember —“\n“Buck.”\n“No, you listen to this. I was scared,” says Bucky, viciously, “Of myself. I was scared of what I would do — what I would do for you — I should’ve been on a fucking leash, I should still be on a,” he breaks off, his chest heaving. He glance skitters away and then snaps back to Steve. “Why didn’t you kill me?” he demands. “You coward motherfucker,” he chokes, his eyes suddenly wet, and he grabs Steve by the shirt in his desperate sick fury. “Why didn’t you kill me when you had the chance?”\n“Because I’m me,” says Steve, his voice reedy and hurt. “Because you’re you. I’d be killing myself. How do you not know that? All this time, how do you not —?” He swallows hard, but his throat closes up anyway. He confesses, “I died too. When you left me. I died too.”\nBucky grabs, heartbroken, at Steve’s face: he holds it in his hands, one weathered, one cool. “Don’t you say that to me,” he begs. “Don’t you say that.”\n“It’s true,” says Steve, and Bucky’s face does something terrible. “It’s true. And I was ready to, for a while. Off and on for a long time. Especially in that vault with you. I wanted you to kill me. But not anymore. I don’t want to die anymore. I don’t want to die anymore, Bucky. I changed my mind. Didn’t you?”\n“I don’t remember writing them,” Bucky confesses, and here he is, finally, the inside of his person: the gnarled, scarred mess of it, the pulpy interior, open like a wound and picked at like a sore. Here he is, all of him, laid down at Steve’s feet. This is why he was so afraid. Bucky says, “I don’t remember writing one single goddamn word.”\n“Oh God,” says Steve, after a moment: “That’s all?”\nBucky is poleaxed. “What?”\n“That’s all? God, that’s all?” He almost laughs. “I don’t care, Buck, I don’t care — so what, it’s behind us; so what? What do I care? Why would I care? I got you — do I got you?”\n“You got me,” Bucky croaks, shocked. “Wear a guy down. Yeah, you got me. If that’s what you want. Of course you got me; you always got me.”\n“Then I don’t care,” Steve says, and has to sit down again, still close to laughter. “Then I don’t care, Bucky.”\n“Stevie,” Bucky says, in a completely different way. He stumbles back and slumps against the counter, exhausted from arguing. “Jesus Christ.”\n“I don’t care,” Steve repeats, to make sure he truly knows.\n“You’re breakin’ my heart,” Bucky murmurs, terribly raw. “You know that? It breaks my heart just looking at you.”\nSteve watches him, the pull of his jacket across his big shoulders, his dirty boots muddying up Steve’s floor, the dark head of hair, and suddenly he can’t do anything but wonder at it, at all of it: the entirety of his wholly fantastic and stupendously unbelievable life. What did he ever do to deserve all this — him, Steve Rogers, the son of an immigrant and a vanishing man, any other boy in an alleyway with scraped-up knees? Who is he? Who is he but any other man off the street? And to be here, on this unlikely day, looking at Bucky now.\nTime is so funny. Life is so strange.\n“I’ve loved you,” says Steve, “Since the beginning of time, Buck.”\nBucky stares at him, silent and still.\n“You know, I been to all fifty states? I went everywhere you ever told me you wanted to go and then some. I drew a hundred portraits of you, but they hurt too bad, and so I burned them, every one. They never looked right. Maybe it was because I could never do them in color.” Even at the Grand Canyon — holding it out so he might see it, that incredible, lonely, cold desert view, and then feeding it into the fire: watching the paper blacken and smoke and curl.\nBucky lets him speak.\n“And you know, it’s funny: for the longest time I felt like I was looking for something. I think,” Steve says, “That I was looking for the truth. But I couldn’t find it anywhere, and that didn’t make sense. I even dug down deep inside myself, but there was nothing in there, either. I turned into the Tin Man without you: knock on my chest, you heard it echo for miles. So I looked and looked, but no matter where I did, I kept turning up you, finding you, over and over again, each decade of this life. But I think I get it now — I think I finally understand. I don’t know how it took me so long. It’s because you’re the truth, Buck. You’re the truest thing I’ve ever known.”\n“Is that so?” Bucky asks, after a long, long pause.\nSteve shrugs — what can you do? — and says, “It looks like. Sorry. Now I’m done. That’s all I had to say. It was so long and I never said. And then, well. All this time, I never thought I’d —“ and now he’s gasping, shocked by it, his throat closing up. He says, “Oh, Christ. You know, Buck, I never thought I’d get the chance to.”\nBucky leaves his coffee at the counter and turns the chair closest to Steve and sits before him. Their knees wedge together: Steve’s knee, Bucky’s knee, Steve’s knee, Bucky’s knee, and after a moment Bucky reaches out his right index finger and runs it down the bridge of Steve’s big and bumpy nose.\n“Look at that beak,” he says. “You break it a time or twelve?” In one moment Steve is giving a laugh and in the next he goes silent, and Bucky’s hand is on the back of his neck, warm, heavy. For the first time in his entire life Steve reaches up his hand and presses him thumb into the little dimple in Bucky’s chin.\n“I never felt you leave,” he confesses in a whisper, and all of a sudden his vision blurs. “I never felt you die, Buck. You were always there. You were always there. I thought I had lost my mind. I couldn’t shake you. I never shook you. I felt you out there in the world: some part of me. So I spent my whole life looking back. I spent my whole life hoping I’d see you in my rearview. Just a glimpse. Anything. I waited. I’ve been waiting.”\nBucky kisses him, very softly, very quietly, and simple: simple as though it hasn’t been a hundred years in the making. “Sorry,” he mumbles into Steve’s mouth, even as he does it. “M’sorry, I shouldn’t.”\n“Shouldn’t —oh,” Steve realizes, and it makes him laugh; after all this, what a ridiculous thing to say. “Oh, no, Buck.”\n“Got yourself a family.”\n“And now I got you.”\n“You can’t act like it’s so simple.”\n“Watch me, motherfucker,” Steve says, and Bucky gives a laugh that’s wet and bloody as a newborn. “I was so quiet for so long,” Steve tells him, and it hurts again so badly he can’t breathe from it. With Bucky it comes and goes: this tightness in his throat, like pain from a sickness. All he can do is hold on and weather it through. “You never knew. I know you thought I didn’t. It hurt you.”\n“Yeah it hurt me,” Bucky says, and kisses him viciously, and bites; but Steve bends for him, and lets him take whatever he wants. He owes it; he likes it. “Yeah it hurt me,” Bucky repeats, though now he kisses him in a way that says he isn’t so angry anymore. Steve pulls himself away to look, but then he sees it: five, six strands of hair at Bucky’s temple that are unlike any of the others.\nLike Steve, he’s just now beginning to gray.\n“Look at that,” says Steve, pressing his fingers there; and he realizes that he is unspeakably, deliriously relieved. Finally: someone like him. Someone like him, and of course, of course, of course it’s Bucky — who else could it ever be but Bucky? ”Look at that,” he repeats, in wonder. “We match.”\nBucky says, “Of course we match,” and murmurs, “Of course we do.” He looks at Steve’s face: his nose, his chin, his eyes.\n“So,” he says. “What’ve you been up to?”\n“Better take your coat off,” Steve tells him. “Believe it or not, it’s kind of a long story.”\n—\n“Whole shops for organic, fresh-squeezed drinks,” Steve says, and insists, “Quit it, I’m serious. You go in and order one eight ounce cup of lemonade, only it’s not made out of lemons: it’s made out of apples and pineapples and fuckin’ mint, and you pay five dollars for it.”\n“Fuck off.”\n“My hand to God, Buck. You wanna go to the movies? Because you’ll have a fucking heart attack.”\n—\n“Buildings,” Steve says, and gestures, “That hit the clouds in Beijing. Tony — Stark’s son, you met him?”\n“Yeah.”\n“Tony, he built this godawful affront to man smack in Midtown over Grand Central, you won’t believe it, it’s — Christ, it is hideous.”\n“How long’s it been, sixty years?” Bucky asks. “And still: an absolute bonafide snob —“\n“When you see it, Buck —“\n“I bet it’s fine, you just hate — what’s it called, the German one.”\n“It’s not even Bauhaus, Bucky, it’s some kind of post-modernist steel abomination, I can’t believe they even allowed it.”\n“Who’s the mayor anymore, anyway? No, wait, stop,” Bucky says. “Look, it may be scrambled eggs up in here, but I know that look anywhere. I can gather he ain’t a socialist and we’re leaving it at that.”\n—\n“You know what my ma taught me, especially when Hitler started picking off our people overseas? You don’t tell the story, it doesn’t stay alive. It’s a responsibility to tell the story. —Christ, it’s humiliating to talk about, honestly.”\n“Why?”\nBucky thinks for a second, and finally says, “Honestly? Really, honestly?”\n“Yeah.”\n“Not my best work.”\nSteve laughs, and keeps laughing, and has to grab at his stomach. “Oh, Jesus,” he gasps.\n“I’m serious, imagine the first sketchbook you ever bought was on display to the world — what would you be most embarrassed about, the naked ladies or how bad the line work was? I didn’t write them for that. I’m a storyteller; I tell stories. It’s different than —” he waves a hand. “What Gabe was doing. What he did. M’not an artist.”\n“You’re not pissed?”\n“Yeah, I’m pissed,” Bucky says, sobering. “Yeah, I’m fucking furious, Steve, and I’m — Christ, if this was back before, I would’ve absolutely died, I would’ve been…but Jesus. They stuck a fork in my brains and twirled it around like spaghetti; you think I give a shit anymore? It’s just…baffling, is all. I’ve seen ‘em bound up in books. It just doesn’t make sense.” He looks back to Steve. “One thing I ain’t mad about?”\n“Hmm?”\n“You knowing. At least I didn’t have to come back here and stumble all over myself.”\n“Tell you a secret,” Steve says.\n“Hmm.”\n“Carried the photocopies around with me for decades, shoved inside my wallet.” He doesn’t know how to explain it to Bucky: he’d been dead by then for over twenty years, and suddenly it was like he was reaching out to Steve from beyond the grave. He had been, in a way, after all.\n“Where are the originals?” Bucky asks.\n“That museum still,” Steve tells him. “Which is pretty fitting, if you ask me.”\n“Why’s that?” \u2028\n“Well,” Steve says, “I kind of prefer having the real thing.”\n“Huh,” Bucky tells him. “You don’t say.”\n—\n“Dodgers moved to Jersey.”\n\n“What?”\n\n“Nah, I’m fucking with you,” Steve promises, and Bucky collapses back against the couch, relieved.\n“They moved to LA.”\n“What!”\n—\n“The crows happened, right?” asks Bucky. “I remember the crows.”\n“They happened,” Steve agrees. “Didn’t seem real, though.”\n“No,” Bucky sighs. “No, they never did. Sometimes I thought about them, how they’d…” he gestures. “How they’d land and go straight for the eyes, Christ. First time I saw it, it was all I could think about for weeks. Dugan almost lost his dinner.” His brow furrows. “Or Jones. Or maybe that kid…I forgot his name.”\nSteve hums, wordless.\n“Sometimes I’d wake up, think of them, you know, when they pulled me out of —“ Bucky stops. “I thought I was one of them, that I was really laying there dead on my back, crows pecking at my soft parts, that all of it wasn’t…wasn’t real, that I wasn't there, that I really did bite it, that I was just taking my time about dying. And I didn’t know why I was thinking that, was the problem. I couldn’t for the life of me remember why.”\nThere’s a long silence, and Steve turns toward him, and they look at one another. Bucky reaches out and strokes Steve’s eyebrow with his thumb. He drops his hand again.\n“You know what I want?” Bucky asks, after a moment.\n“What’s that, Buck?”\n“A motherfucking shower,” Bucky says, and Steve laughs. He slaps Steve on the leg. “I haven’t showered for real since 1943. Come with me. Cut my hair. Mama’s turning in her grave, God rest her.”\n“God rest her.”\n—\n“Barnes, quit peacocking,” Steve says.\n“Rogers, quit looking,” Bucky replies. He grins at Steve in the reflection.\n—\n“We lived just across town. It was the kind of life where you don’t chain up your bicycle outside.”\n“And you were happy.”\nSteve shrugs. “Yeah. I was happy as I could’ve been. Woke her up every night screaming. But sometimes she woke me up, too, except she was always so quiet: just tossed and turned. She had it bad, but she’d lie to me about it. Maybe that’s how it…we started lying, and it didn’t stop, not for a while.” It’s hard to explain the intricacies of it, even to Bucky; how he and Peggy have grown around each other, like two old vines. Their history isn’t terribly nice, but it is real and true. “We found ways to be happy.”\n“She was good for you,” Bucky decides, satisfied with it. “She is good for you. What was it like, day you got married?”\nSteve sighs, thinking of it, staring at the stucco white ceiling of the apartment. Bucky’s shoulder is hard and warm against his. “Cried. Laughed. She was so — God, stunning, I can’t even tell you, I about fainted at the altar. Her hair was long then, all these curls. Dugan wanted to make the toast, but Morita also wanted to make the toast, so Peggy made Dugan her maid of honor —“\n“Holy fucking Christ —“\n“And Morita was my best man — no, I’m serious, slapped lipstick on him and everything, thank God there wasn’t any press. Oh, God, you would’ve died at the look on his face. But he did it for her, you’re damn right, ‘cept then he got all teary —”\n“Oh my God,” Bucky says, blankly terrified at the thought.\n“‘He’s the only man deserving of you, and even then it’s questionable,’” Steve quotes. “Makeup all over his face. Jesus.”\n—\n“Say it again,\" Bucky says.\n\"I love you bad,\" Steve breathes. \"I love you so bad,\" and Bucky closes his eyes like Steve has spread balm on a wound. \n—\n“They farm rice,” Steve explains. “Do you remember learning that? I’m sure you knew.”\n“Maybe. I don’t know.”\n“In big paddies. I only spoke six words of Vietnamese when I went over, and like hell they were trusting me. There were landmines everywhere, in every village, and at that point nobody knew who had planted them down: us or them. Didn’t matter anyway; people were losing limbs like loose screws. So I started wading in with them, the villagers, and when I stepped on one I’d throw it as far as I could, away from the huts, so it would detonate far out in the fields or the swamps. And they’d feed me at night if I did. One of the women taught me how to make this cake — I’ll show you sometime. Pegs can’t stand it, but I ate it for months after I got stateside.”\n“How long were you there?”\n“Oh, years, I don’t know,” Steve says, and sees the hurt on Bucky’s face, and understands it. “Three, maybe. And then when I came home, she took me back. I was at this rally, and then — wait, Jesus, I haven’t told you how I met Nick, have I?”\n“You got arrested with him, didn’t you,” Bucky says, and Steve laughs and laughs. “Jesus fuck,” says Bucky, stunned. “I’m right, aren’t I?”\n—\n“You know,” Bucky tells him, and passes him the smoke: Marlboros, same as ever, even though they taste different now: harder. “I really wasn’t going to come back.”\nSteve looks to him, and takes a drag. In the cool night air on the step their knees knock together through their jeans.\n“I really wasn’t. I meant what I said, when I left you those notes. No, keep it,” Bucky instructs him, when Steve tries to hand the smoke back. He lights up his own. “What’s it gonna do, kill you? —I really was, I was gonna leave. The plan was I’d get rid of them, all of them, the rest of them. The ones who did that to me, and to those little girls like Natalia. And then I was going to…I don't know,” he admits, and leans back on his elbows. Steve watches his profile, a big lump in his throat. “It was like a broken engine up here. Everything kept screeching around. I wanted quiet. And I knew I’d just…that it’d be worse for you, to see me like this, or like that, or whatever. How I was. How I am.”\n“It’s not.”\n“Shut up, I’m telling a story.”\nSteve smiles a little.\n“So I was gonna put a bullet in my own head, I guess was the plan, or find someone to put me down like a dog. And it almost happened — I almost let her kill me.”\nSteve tries to swallow. “Natasha?” he asks.\n“Yeah,” Bucky says, quietly. “Yeah. But I don’t think she wanted to, not really. And then you had to go and get yourself knee-deep in shit one last time anyway, just to make my life harder.” Bucky puts his hand on Steve’s shoulder, and then wraps his arm around him. He says, “Thanks for that, troublemaker.”\n—\nSteve tells him everything, everything, each moment that he can remember; the days bleed into other days, and then somehow they’ve spent a week cloistered away, eating up what’s in Steve’s pantry and finally ordering for dinner, sitting on the floor, on the couch, sleeping in turns — they can never seem to sleep at the same time, too scared to close their eyes. Someone has to take watch, anyway.\n“How old is that pizza?” asks Natasha, disgusted, and before she’s even done talking Steve has pulled her into a hug, and she gives a surprised oof, the door still open, the precautionary firearm still in Steve’s hand. “Damn, I missed you,” he blurts, surprised by it. He hadn’t even realized how badly until he saw her.\n“Okay, okay,” she says, huffing, but she’s smiling, almost fully; as fully as Natasha ever does. “I get it, Rogers.”\n“How you been? You hungry? We have, uh — canned peaches, I think.”\n“Romanoff,” Bucky says, rounding out of the bathroom.\n“Barnes,” she replies, and Steve stands in silence between them while they look at one another, having a conversation. “We’re going to the supermarket,” she decides abruptly, still looking at him. “Are you coming?”\n“Go ahead,” Bucky says, and turns to Steve. His voice is softer. “Get on, yeah, go ahead. I’ll be right here.”\n“Want anything in particular?”\n“Meat,” Bucky decides. “Fish. Butter. Shit, I want butter. Is butter good in the future?”\n“The real kind’s still good, if you can find it.”\n“Alright: butter,” Bucky says, and waves them off. “Go, get out the door.”\n—\n“Salted or unsalted?” Steve asks.\n“I don’t know, I don’t grocery shop; Steve,” Natasha says, thirty minutes in and thoroughly fed up: “Slow down. What are you doing?”\n“What?”\n“You have to stop living like you’re drowning,” says Natasha. “It’s not worth it to live that way. Like you’re about to let go and slip under any minute. I know, I’ve been there.” Her eyes are green and serious as she stares at him. She says, “Listen to me. It’s not going to crumble around you.”\nSteve stares at her, shocked. Advice you give to someone else, he thinks, is advice you wish you had heard: “It’s not going to crumble around you, either,” he says, and her face goes soft, caring. “But how can I trust it? How?” After all that’s happened?\n“You just do,” Natasha tells him. “You make yourself, Steve. You pretend you trust it, and you keep pretending, and eventually you wake up and it’s true.”\n“You told him,” Steve says, surprised all over again. “Didn’t you?”\n“As if that’s your business,” says Natasha, with her saccharine, annoyed smile, but she can never lie to him. They finish up in silence, check out, and start back to the apartment; eventually Natasha loops her arm through Steve’s, one hand on his elbow and the other resting at his bicep. The night is nice, nearly balmy, and they pass another couple: a family with two children. Immediately Steve remembers Kathryn, and old summer days in Potomac Park.\n“You ever thought about that?” Steve asks, and then worries immediately that he’s put his foot in his mouth. “Or — oh, Christ —“\n“No, it’s — oh,” Nat says, and now she’s laughing at him. “No, I can, is that what you —?”\n“Yeah, God, sorry,” Steve says. “See, this is why I’m not allowed out.”\n“I can,” Natasha says. “It’s not that I can’t. I don’t know — I never really thought about it. I don’t want it. Plus,” she says, grinning, “Can you imagine Barton with children?”\n“Well, now that you say it out loud…”\n“You miss your family, I can see it,” Natasha says bluntly, and now they’re at the door, and she stops, and turns to face him. “You missed me and you didn’t even know it. Go see them. Go out in the world. He’s not leaving now; you should have seen him when…” she sighs, brow furrowing. “He was manic, desperate. Feral. It was ugly. He won’t leave you now that you’re back. Do you know that?”\nSteve looks at her: her hair is different now, cut to her shoulders and straight, and her face is astoundingly plain and open, her eyelashes brown; she isn’t wearing any makeup. She cups her small hand on Steve’s face and reaches up and kisses his cheek out of absolutely nowhere — just because she wanted to.\n“What about you?” Steve asks. “Where are you going?”\n“You know where,” she says. “Same way as Wilson. The FBI is gone, SHIELD is gone: it’s just us now. Nick is making good offers.” She tilts her head. “The world needs protectors. We happen to be qualified.”\n“Protectors, huh?”\n“I mean, it’s not an official name,” Natasha says. Her mouth quirks to accommodate the smile, and she adds, “But I’m sure we’ll think of something.”\n“I’m sure you will.”\n“I’d invite you, but…go see your family, Steve. See your family and then make a decision.”\n“Saw part of it tonight,” he says, and pulls her close again.\n“Stop that,” Natasha murmurs, affectionately. “I’ll see you around,” she says, and her boots click on the sidewalk.\n“I like your necklace!” Steve calls after her. She ignores him entirely, but he knows that she’s smiling anyway. He misses her already; autumnal, perennially liminal Natasha, one of the greater things to come out of this strange, long trek — and he watches after her until she rounds the corner, her red hair out of sight.\n—\n“Oh, wow,” Kathryn says, her voice suddenly weak. “Oh, God.”\n“We didn’t mean to intrude,” Steve says, as Kat stands frozen in the doorway of her nice suburban home, her hand still on the knob, her mouth hanging open. “We thought we’d — you know what, I should have called, I wasn’t even —“\n“Hi,” Kat says, interrupting him, looking at Bucky. She’s stunned, nervous: brave through it all. “My name is Kat,” she says to him. “Kathryn Morita.”\n“James Barnes, miss,” says Bucky, and Kathryn gives a disbelieving laugh. She claps her hand over her mouth, her brow suddenly drawn, and tears spill out of her eyes. She laughs again.\n“Hi,” she repeats, choked. “It’s really, really nice to meet you, James Barnes.”\nThey stand for a moment looking at one another: Bucky’s hands are shaking. Steve has to look up and away, blinking hard. “Oh, come here,” Kat says, in a wet murmur, and she wraps her arms around Bucky’s shoulders, pulling him close. Bucky stands for a moment, and then he puts his right arm around her, and after a moment his left too, holding gently between her shoulder blades. “Hello, Bucky,” Kat says.\n“Hi, Kat,” Bucky replies, and tells her, “It’s really good to meet you too, sweetheart. It’s really good to meet you too.”\n—\n“You’re sure,” Bucky says. “You’re sure.”\n“I’m sure, what, you’re gonna flake out on me now? We’re right outside the door. Hey,” Steve says, and gives Bucky’s shoulders a shake: “It’s just my wife.”\n“It’s just,” Bucky repeats, incredulous, “Your wife. Good Christ. Just your wife could out-shoot, outrun, and outsmart me in 1944. Just your wife is a great lady, Steve, but just your wife and I — look, I’m not sure if you know this, but just your wife and I kinda have a history —“\n“You haven’t talked to her in a century, Buck, you can’t possibly know that. Come on.”\n“I can hear you, you know,” Peggy calls, and Bucky’s eyes become huge and round. He turns from Steve and opens the door and walks inside.\n“Jesus-motherfuck-me-Christ, Carter,” he says, his voice tight, somehow furious: “You scare the living shit out of me, as ever. Begging your pardon, of course.”\n“Sergeant Barnes,” says Peggy mildly. “You’re still quite tall, do you know.”\n“I’ll leave you to it,” Steve says, but they both snap and look to him. “What? You two always talked over my head, those angry, silent talks when you thought I wasn’t looking — yeah, I remember that. Be grateful Stark’s not alive.”\n“Steve,” Peggy scolds.\n“God rest him,” Steve adds, in respect to their friendship. “Look, I’ll be just outside.”\n—\nGoogle\nAbout 287,000,000 results (0.59 seconds)\nIn the news\nStark, Romanoff Spotted in Manhattan\nio9 - 7 minutes ago\nTony Stark was seen speaking with Natasha Romanoff and two other men at a Starbucks in Midtown, prompting rumors that…\nIron Man and Black Widow grab some coffee, confirm superhero brunches are a thing\nBuzzfeedNews - 10 minutes ago\nA superhero coalition may be forming\nThe New York Times - 14 minutes ago\n—\n“Are you terribly happy?” Peggy asks, when Steve lays beside her on the bed, and they turn to face each other the same way they used to sleep: closed parentheses, knees and noses touching. “You look terribly happy.”\n“I’ll be terribly happy if I hear you two aren’t about to smother each other any time soon.”\n“We’re not,” Peggy says. “Do you know how you and Agent Romanoff are the same kind of person, on the inside? So are Barnes and I — the same stuff in our bones, I suppose. Though we were never quite so lucky to be friends as the two of you.”\n“You understand him.”\n“And he understands me, wrinkles and all. We spoke honestly, I think, for the first time ever. I asked his forgiveness.”\n“He forgives you.”\n“I know,” Peggy says, and Steve reaches up and thumbs away a tear from her eye. She smiles at him, rolling her eyes at herself. It makes Steve laugh. She says, “It’s less a matter of forgiving me and more a matter of forgiving himself, anyway. We don’t dislike each other,” she says, and sighs. “We’re just — there are people like you, darling, and then there are people like us. It’s hard for people like us to reconcile the things we’ve done, sometimes. We’re nearly too alike, Barnes and I.” Now she smirks. “You have a type.”\n“Jesus,” Steve complains, laughing.\n“You look wonderful, darling; look at you,” Peggy says, and it makes Steve smile, and duck his head. “Blushing. You are happy.”\n“I’m the luckiest man alive,” Steve tells her. “I’m the luckiest man to ever walk the Earth, look at me, I have everyone I love in one place. Pegs, listen, I have a proposal —“\n“Oh, are you going to drop a ring again? Will I have to crawl around in a park finding it for an hour?”\n“You’re never going to forget that, are you.”\n“Hmm,” Peggy says. “No.”\n“Come with us,” Steve pleads, and takes her hands in his. “Come with us to New York. Set you up wherever, visit you every day — every day, Peggy, I swear to God. Aren’t you tired of this place? There’s nothing for us here. This place is old, it’s dead. If Nick has positions open he’s got something for Sharon: you won’t be missing her. She’ll come with us. Please. It’ll be wonderful. I don’t want to do it without you. I don’t want to do anything without you ever again.”\n“Yes,” Peggy says, smiling. She presses her hand to her mouth, like she did the night they were engaged, when Steve dropped the ring. “Yes, darling, of course — stop, you don’t have to convince me.”\n“But I have a whole speech prepared.”\n“No need to give it,” Peggy tells him.\n“I love you,” says Steve, fervent. “Jesus, I love you.”\n“I can’t believe it,” Peggy murmurs to him, and folds their hands together. “You’re so vibrant, look at you. I have so much time to think, anymore…we’re all, each of us, only passing through. And it’s been so wonderful, Steve; so wonderful to pass through with you.”\n“Pegs,” Steve says. The cold fury that used to live behind her eyes is so far away; she’s thawed out more than even Bucky in the sunlight of redemption, and somehow she’s more catastrophically beautiful now than she ever has been in her life.\n“Tell me,” she says, and closes her thin eyelids, basking: “How does it feel? How does it feel for you now?”\n“Remember being young?” Steve asks, and Peggy’s smile breaks over him like the dawn.\n \n \n\n2012\n\n“Not bad, right?”\n“Not bad, not bad,” Steve laughs, and looks at Sam: he’s tall, striking, smiling. The design of the star is different now: the white pattern spreads down his arms and to the cowl, and red goggles hang around his neck.\n“Suits you,” Fury agrees.\n“One last thing,” Steve says, and shoulders off his bag. “Needs a paint job, maybe,” he admits, and hands off the shield to Sam. “But I thought I’d let you handle that, spruce it up however you want. There. Complete. Damn. You’re looking good, Cap.”\n“Shit,” Sam laughs. “I really am, aren’t I?”\n \n \n\n2013\n\nThe New York Times Best Sellers\nTHIS WEEK COMBINED PRINT &amp; E-BOOK FICTION\n1 INFERNO, by Dan Brown. (Doubleday.) The symbologist Robert Landon, on the run in Florence, must decipher a series of codes created by a Dante-loving scientist.\n2 THE HIT, by David Baldacci. (Grand Central.) The government pitman Will Robie uncovers a serious threat as he attempts to take out a fellow assassin who has gone rogue.\n3 THE LONG WAY AROUND, by Roger Buchanan. (Little, Brown.) The genre- defying story of an amnesiac man unmoored in the 21st century; the winner of the 2013 Pulitzer Prize.\nBooks of the Times Review\n4 EYES WIDE OPEN, by Raine Miller. (Atria.) Demons from the past threaten to destroy the passionate bond of Ethan and Brynne. Book 3 of the Blackstone Affair series.\n \n \n\n2015\n\n“What’s gonna piss Barton off less,” Bucky says, hands on his hips: “If I knock the wall down or leave the hole in it? —No, never mind. I’m knocking it down.”\n“The whole wall?”\n“The whole wall. It’s not like anyone’s living next door, and I’m sick of you trying to cramp all your supplies into that broom closet.”\n“Second bedroom.”\n“Broom closet, Rogers, don’t oversell. And look, the light’s good. North-facing. I’ll block it off from the kitchen a little, but even if you track paint in, the floor’s still this godawful tile; it’ll be fine. Jesus,” Bucky says, and turns to look at Steve. “I’m tearing that up, too, by the way.”\n“The whole wall,” Steve says, considering. “Well, alright. And you already put your fist through it, so that’s a start.”\n“Hah,” Bucky grunts, and reaches for the painting; it’s unharmed, but the hammer is still in the plaster from where he underestimated his left arm a little. “So where do you want this instead?”\n“I’ll leave it upstairs,” Steve says, after a moment. He likes this one: a portrait of a person he’s never known from the back, their sturdy, work-hardened lines. Maybe it is someone he knows, he thinks: maybe it’s everyone he knows, and ever has known. “It’s for Nat, I think. Something there for her when they get back.”\n“Hmm,” Bucky says, and turns to look at him. “Alright. Yeah, she’ll like this. How’s the job?” he asks, and when he passes by Steve to get coffee from this kitchen he squeezes the back of his neck. “Where are they? Serbia?”\n“Somewhere,” Steve agrees. “There was some shitshow at a rally; I think they ran into some enhanced kids, but I’m not sure. She wouldn’t really say.”\n“Kids? Jesus,” Bucky says, and then after a second: “Hey, come over here.”\n“What?”\n“Come over here, I said.”\nSteve falls for it on purpose, but Bucky still kisses him and presses him up against the sink.\n“We got shit to do,” Steve complains, smiling.\n“Yeah?” Bucky’s nose touches his before he pulls away, and then he grins and spans his hands over Steve’s hips, his eyes heavy-lidded and smug. “Well, your fault. You know better than to look at me like that. I’m like a tomcat, Rogers. Feed me once, I’ll just keep on coming back for more.”\n“Jesus,” Steve murmurs, laughing, and he puts his arms around Bucky’s neck.\n—\n“Lilies, how about,” Bucky suggests, looking over Steve’s shoulder. “Roses, roses, roses; that’s all you ever buy her. Maybe a lady wants a change of pace sometimes, Rogers. What’s her favorite?”\n“Lilies,” Steve admits, and Bucky says, “Hah,” and pinches at Steve’s side. “So? Get your girl some lilies, she’ll love them. No, not those — Jesus Christ, you’re hopeless. Here,” he says, and picks an acceptably sized bouquet. “These. Much better.”\nSteve draws her an awful lot these days: Peggy when she was young, Peggy at middle age, Peggy the way she is now; Peggy in her multitudes, Peggy in her singularities. It pours out of him, his love for her, and Bucky lets it — Bucky doesn’t care — Bucky tears up their little apartment to make it their own, and sweats and swears all day over it, and then after he puts his hands on Steve’s neck, one rough, one smooth, and holds him in place so he can kiss him, or talk to him, or tease him however he wants.\nPeggy isn’t getting better and she isn’t getting worse, except for when Steve looks back on months passed, and realizes that she has gotten worse; that she’s forgetting more than she remembers, by and large, and that she sleeps more and more every day, sometimes confusing Kat with Sharon with Jamie, and nearly always, for a moment or two at least, confusing the year. Steve knew inside of himself, the day that Dugan died, that he would outlive them all: even her, maybe even Kathryn. Now it’s happening so quickly. He’s afraid to leave, just in case, even though the doctors keep telling him she has time yet. Time is a funny concept to Steve. It doesn’t really exist anymore.\n“Come in with me today,” Steve says, even though he didn’t expect himself to. “For more than two minutes, I mean.”\n“Alright, yeah,” Bucky tells him, after one second of hesitation. “‘Course. Only had to ask.”\nBucky goes a little wild at the market just the way Steve and Peggy did for a straight year after the war: he wants everything, the sweet thick peaches and the peanut butter with the nuts still in, twelve different kinds of preserves and the best whiskey on the shelf. He gets corn for Steve to shuck because he doesn’t have the first idea about shucking corn, and he buys fat plums and almonds and milk; not the one in the carton, the one in the glass. He buys thick cream from the same local brand even though he thinks the price is obscene, and then of course he has to —\n“I am not paying that much for this tadpole.”\n“If I sell you it for what you’re offering I might as well throw it in the trash.”\n“Kid —,“ Bucky sighs.\nSteve wanders away, and he picks through the fruits and vegetables, the bouquet in one hand. A man is across him, a worker stocking apples. Might make a cake, Steve thinks, as he looks at those and the apricots and the bananas, indecisive. Finally he sees them and knows: fresh, vibrant, round — and he reaches into his back pocket, rifling through the worn wallet for cash.\n“Hey, excuse me,” Steve says, and asks, “How much for that bushel of oranges?”\n—\n\nThis story has been unbelievable and strange, but maybe this is the most unbelievable and strange part of all: I never forgot him, not really. I only told myself that I had. I forgot without forgetting at all.\n\n\nFor decades I hid him deep within a secret part of me, and even though I lost his specifics, his nose, his brow, I somehow knew that he lived safe and far away, and that knowledge alone was my comfort. The shape he took in my mind was something special, and beyond that he was stored in incremental pieces all throughout me anyway: my teeth missed him, and so did my kneecaps, and even my angry hands. My spine knew something was wrong, too — I swear to God it felt the absent rungs. But my memory is four-dimensional and just enough elastic, which is maybe why it worked so well: why I could forget without forgetting, and why it all filtered back so quickly. Now I can tell anyone all about him; I can conjure him up straight from memory. And what a luxury it is, too — what a rich man I am — that I can think of him at all, the blue eyes, the chin, that red little mouth. If I kiss him anywhere he turns bruised and overripe and wanting, alive in my hands: and wouldn’t you like to know. His mean wit will cut you in two. But why would I tell you, of all people? Why would I tell you, when I’ve already spread myself at your feet, butterflied? Don’t read what comes next, I dare you. It’s only for him.\n\n\nToday I can see all the way to the truth I’ll know at the end of the world. \n\n\nListen close. Listen to me when I say it in your ear. Remember it for me, just in case I ever happen to forget it again. I know this one in my spine-bones and somewhere now in the meat of my heart. It’s why the grave couldn’t keep me in, sweetheart. It’s how you even found me again at all. The fact of us is simple arithmetic. Torch me, bury me, break me: it's never going to stick. I’ll always come back from the dead for you. We belonged to each other before we ever belonged to ourselves.\n\n\n(Buchanan, R. “The Long Way Around: Epilogue.” Little, Brown and Company, 2013.)\n\n \n \n \n\n1945\n\n“Hmm,” Bucky says, and in the crackling firelight he studies Jones’ hand. “That don’t make sense.”\n“The black man’s gonna be a millionaire,” Jones guesses.\n“I keep tellin’ you — shut up, shut up — I keep tellin’ you, I can’t read the future, Jones. It’s different than that. And this is just strange, is all. This line here is your heart, and it splits.”\n“What’s that mean?”\n“Aw, he’s eager: two dames,” Morita says. Jones smacks him.\n“You’re gonna marry one lady or the other, but not both, I don’t think.”\n“Cap next,” Dugan says, and chants: “Cap next, Cap next — c’mon —“\n“Fine, fine,” Steve relents, and he scoots closer to Bucky so he can face him, feeling silly and a little drunk. Buck licks chalky nicotine off his middle finger and reaches for Steve’s hand; he turns it palm-up in his own and strokes down the middle of it with the calloused wet finger. Steve watches raptly where their skin touches beneath the grime and sees dried brown blood flecked high on Bucky’s forearm. Suddenly Bucky flicks the thin skin of Steve’s palm with his blunt nail, and laughs at Steve when he yelps.\n“Gettin’ spooked by my witchcraft?” Bucky asks, and his eyes flash, teasing, when he grins up at Steve.\n“Yeah, heretic,” Steve tells him. “I’m fuckin’ terrified.”\n“Mama never let me do this in front of anyone,” Bucky says, just for Steve to hear. “No rules out here, though, are there? No rules in this life. Alright, here we are: this is your headline, and look at that: you’re a stubborn asshole, what surprise.”\nSteve tries to jerk his hand away, rolling his eyes, but Bucky grabs it back fast. “Fine, fine. See, Jones? Not predicting the future, just looking at you, what’s in your bones. It’s all in your bones, huh? Not in the future. Trajectory, like. All I can see is your trajectory.”\nJones makes an unconvinced sound, but Steve is distracted again — Bucky is tracing his index finger down Steve’s palm, and his hand is warm. The callouses catch, catch, catch. “Look at this,” he murmurs. “Yours is different from his, see? Lines up strange, like it’s doubled, side by side. You know what that means?”\n“What?”\n“You’re going to have two great loves in your life.”\nThe boys howl and hoot. “Lady Liberty and Mrs. Justice,” Morita says, still chuckling, and Dugan elbows him: “Fucking Christ, that’s not even good.”\nBut Bucky is concentrating now, and Steve looks at him: in the dim and spitting firelight, his brow is drawn, dark, and his hair arcs over his forehead. He chews at the inside of his lip, and Steve rests their hands heavily together. “This, I got no explanation for,” he says, and grins up, suddenly, at Steve. “Art not a science, huh? That’s what mama always said.”\n“Tell me what it is.” Bucky wants to pass it off as a joke, Steve knows, but underneath he’s truly and desperately serious. “Go on, tell me; I wanna know, Buck.”\n“Here,” Bucky says, “And here. You see that?” Steve does, only barely. “This is your life line, right here. Sometimes it’s strong or bent or jagged or broken, but look at that: you have two.” And he’s right; Steve does. “And halfway down — see? Halfway down, they split right off.”\n“What’s it mean?”\n“Two possibilities, maybe,” Buck says, and strokes two fingers, middle and index, along both. He hums, curious. “Two ways it could go. Two ways your life might go, and then — look at this, see? They meet again. They meet again right there, at the end. So your ending’s the same, whatever it’s gonna be; however you get there. It ends the same both times. Strange. That’s strange, Rogers. I ain’t ever seen it before.”\n“Steve Rogers,” Falsworth proclaims. “Freak of nature, baffling to psychics.”\n“Thanks, Monty,” says Steve, very sincerely, and around them the men laugh. Steve looks across again to Bucky and finds that Bucky is already looking back at him.\n“You’re a real piece of work, you know that?” Bucky teases, fond, his dark eyes glittering and happy in the light of the fire. The night is quiet and chilled, but between them their hands still touch, and where their hands touch, they are warm.\n People aren’t supposed to look back. I’m certainly not going to do it anymore. I’ve finished my war book now.\n— Kurt Vonnegut\nSlaughter-House Five\nDamn, what a long ride. Special thanks to Nora for consulting, to isamai for the invaluable help with the Russian translations throughout this series, and to Sebastien for their lovely cover art, which can be found on tumblr. And thanks most of all to our fantastic, insane, astoundingly enthusiastic readers, who made all of this possible: you really stuck with us until the end of the, well, you know. As always, we've been Ellen and Emily. \n \n2008\n- Natasha’s line, “You have to belong anywhere” references Phil Noto’s Black Widow Issue #3\n- The story behind the song that Bucky sings in Steve’s dream is true; there really are a number of parody versions of the Battle Hymn of the Republic that cropped up during WWI and WWII called \"Blood Upon the Risers.\" There are other parodies of this song as well, including versions that are about public school, private school, and various branches of the military. The version that Bucky sings, originated by paratroopers, can be found here. \n \n2009\n- “Tod der Lüge,” or “death of the lie,” was a Nazi propaganda poster that was actually common in the 1920’s, not the 1940’s. In it, a Nationalist-Socialist hand strangles a snake that is labeled as Marxist-Leninist and “high-finance.” Interestingly, there was a Russian response to this Nazi poster in the 1930’s, which depicted a red hand crushing a fascist snake.\n- For the purposes of this verse, the events of Iron Man 2 occurred in 2009 instead of 2010.\n- Natasha's SHIELDgate speech draws heavily on Gorbachev's speech that dissolved the Soviet Union. In canon, Steve's rallying speech quotes JFK's Cuban Missile Crisis address; Emily thought it would be a good touch to have Natasha's draw from a leader from her country. \n- We had a bit of a dilemma over the name of Vice President Rodriguez. When planning this fic, we had decided to use the fact that the VP is corrupt and working with AIM in Iron Man 3 as an indication that, like every other evil person in this verse, he could also have been working with HYDRA. However, we didn’t remember that his last name was Rodriguez. We decided to stick to the plan after we found out, though in the original drafts his last name was “Walter.” Make of that what you will.\n- Steve meets Sam in the cereal aisle of a grocery store, a reference to Anthony Mackie’s role in The Hurt Locker.\n- Agent Cagney references Article III, section 3, clause 1 of the US Constitution: “Treason against the United States shall consist only in levying War against them, or in adhering to their Enemies, giving them Aid and Comfort. No Person shall be convicted of Treason unless on the Testimony of two Witnesses to the same overt Act, or on Confession in open Court.”\n- When Cagney mentions an uprising in Ukraine, she refers to the 2004 Orange Revolution.\n- Steve’s favorite painting at the Met is Oleanders. Steve seeing it in 1943 (and before) is actually historically inaccurate: the painting was only acquired by the museum in 1997.\n- Oleanders are not life-affirming at all but in fact poisonous.\n- Steve’s fear that he stopped Bucky from passing through into death is an actual belief that existed in the UK during the Industrial Revolution, if not before; it’s mentioned in the 1848 novel Mary Barton.\n \n2010\n- Bernadette Rosenthal was Bucky’s lawyer in 616.\n- Ellen drew heavily from Nelson Mandela’s “Statement from the Dock at the Rivonia Trial” to write Steve’s final press release; later in this section, Rhodey also quotes Mandela on his Twitter handle.\n- This is the version of “It’s Been A Long, Long Time” plays in the trailer for “The Informant.”\n \n1945\n- This is terrible, hand-wavey palm reading for the purposes of the scene.\n- “You’re going to have two great loves in your life” is an homage to Fury."
}