{
    "id": "432705",
    "url": "https://archiveofourown.org/works/432705?view_full_work=true",
    "author": [
        "Annie D (scaramouche)"
    ],
    "title": "Convenient Husbands",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Supernatural"
    ],
    "relationships": [
        "Castiel/Dean Winchester"
    ],
    "characters": [],
    "additional_tags": [
        "Alternate Universe",
        "Friendship",
        "Marriage of Convenience",
        "Soul Bond",
        "First Time",
        "Romantic Comedy",
        "Fluff",
        "Bickering",
        "Flirting",
        "Harvelle's Roadhouse",
        "Wingfic",
        "Interspecies",
        "Telepathic Bond",
        "Creature Castiel",
        "Hunter Dean",
        "Switching"
    ],
    "language": "English",
    "series": "Part 1 of Convenient Husbands",
    "published": "2012-06-13",
    "completed": null,
    "words": "39,283",
    "chapters": "1/1",
    "comments": "658",
    "kudos": "12,999",
    "bookmarks": "4,467",
    "hits": "324,758",
    "summary": "<p>\"It's only temporary, right?\" Dean says. \"Just until you're healed up, and then we'll never have to see each other again. So what do you say, Castiel, do you want to marry me or not?\"</p>",
    "notes": "<p><strong>Also contains</strong>: Non-graphic torture of the main characters, brief death ideation.</p>\n<p>Written for the 2012 SPN/J2 Big Bang. <a href=\"http://chosenfire28.livejournal.com/257548.html\" rel=\"nofollow\">Banners by chosenfire!</a></p>\n<p>There are two podfics for this fic: <a href=\"https://archiveofourown.org/works/511216\" rel=\"nofollow\">one by eridanie</a> and <a href=\"https://archiveofourown.org/works/925159\" rel=\"nofollow\">one by tenoko1</a>.</p>\n<p>This fic's crossposted to my <a href=\"http://scaramouche.dreamwidth.org/tag/fic:+spn+big+bang+2012\" rel=\"nofollow\">dreamwidth journal.</a></p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>- The movie that Dean and Castiel watch at the drive-through is <em>Grave of the Fireflies</em>.<br>- The song playing at their first dance is Def Leppard's <em>Pour Some Sugar on Me</em>.</p>",
    "text": "\n \nThe universe has a terrible sense of humor.\nCastiel doesn’t mean to hope when he hears the heavy wooden doors creak open, but the chances of him getting a visitor here are slim to none. Zachariah rarely uses doors, and he certainly doesn’t wear boots.\nUnfortunately, the human male who’s walked in is a trespasser who’d clearly had no idea what he’d find. He starts with surprise when he sees Castiel. The feeling’s mutual, Castiel thinks.\n“Hey.” The hunter – for surely that is what he is – lowers his shotgun, but the concern on his face hardens into something far less friendly when he sees the sigils on the floor. “Oh.”\n“If you come in here, I will kill you,” Castiel says helpfully. The hunter raises his eyebrows and looks pointedly at the shackles around Castiel’s arms and legs.  That’s just uncalled for, so Castiel dredges up some strength to force his defensive scales to glimmer a threat. “Just thought I’d warn you.”\nThe hunter’s frown deepens, speculative gaze moving up the walls to the ceiling. “What’s a Phoenix doing taking non-human captives? I thought he was all about burning people. Human people, I mean.”\nCastiel closes his eyes. If he concentrates hard enough, he can remember the feel of the sun and sky against his wings. He hasn’t been in here all that long but Zachariah has been so very thorough—\n“Yo, Isaac, you copy?” the hunter says. “Found some cells in the basement, one of ‘em’s occupied.”\n“Excuse me.” Castiel cracks open an eye, and the hunter pauses his talking into a walkie-talkie. “Would you mind leaving?”\nIt’s not that Castiel’s particularly upset about dying. It would be a relief, actually, after all these months tolerating Zachariah’s poor hospitality. Not to mention the decades prior, but Castiel’s not going to linger on that right now. Castiel’s going to think about good things, nice things, the few and the precious that were part of his life, and he’s going to carry them with him to—\n“Dude, he been bleeding you?” The hunter’s annoyingly loud. “Those scars are…”\nCastiel sighs. “What do you want?”\n“Hey, this sucks for everyone,” he says tersely. “Two families have been burned to death –alive, and fuck me if that’s not something to make you sit up and pay attention.”\n“My heart bleeds.”\n“Fuck you.” Disgust twists the hunter’s mouth. “What, were you his competition? That why he put you in here? Disagreement on grazing rights?”\n“You.” Castiel manages to roll over, fixing the hunter with a glare that would have him trembling in his boots if Castiel weren’t as exhausted as his is. “You have no idea what you’re doing, you child. You think you can stop Zachariah with that gun? You think that will so much as make him pause?”\n“His name’s really Zachariah?”\n“Yes, and he’s a Water Phoenix. Do you even know what that is?”\n“Tell me.” The hunter crouches closer, practically pressing his face against the bars in his eagerness. If Castiel were faking, the man’s head would’ve been ripped off. “You know what this guy’s capable of. If you care at all about stopping him from hurting more people, tell me.”\nCastiel looks up into his foolish face. There is fire in his eyes that makes Castiel wonder if he was ever that idealistic. “What’s your name?”\n“Dean Winchester.” It’s too easy on his tongue to be a lie.\n“You kill things like me for a living, Dean Winchester?”\nHe hesitates, but briefly. “Yeah. Your buddy Zach’s on my plate at the moment.”\nCastiel wonders if there’s any meaning in this, or if it’s just his mind trying to grab some last comfort before he shuffles off this earth. Is it worse to die alone and forgotten, or to die in the company of someone who’d be just as content flaying the wings off his back? A third option looms up: perhaps he can die doing one last thing of any weight.\nAt long last Castiel says, “A Water Phoenix is not same as the Phoenix your culture is more familiar with, though their powers manifest in similar ways. What weapon are you using against him?” Dean cautiously pulls out a bullet. “No, that won’t be enough. You need my blood.”\nIt takes what little energy Castiel has left to crawl the few extra inches the shackles allow, stretching a hand towards the bars. Only the tips of his fingers are able to pass through.\n“Give them to me right now.” At the hunter’s unhappy expression, Castiel adds. “Don’t say anything, and don’t thank me. I will be dead soon, and I shall be grateful for it. If you wish to do something in return, then once I’m gone, burn my body. Don’t desecrate it, don’t harvest any part of it. Can you do that?”\n“Yeah.” He rolls the bullets towards Castiel’s fingers, which are still red where the scars have refused to heal over. “Yeah, I can do that.” He watches while Castiel smears blood over the metal, staining them into usefulness. “What’s your name?”\n“Castiel.”\n“For what it’s worth, Castiel—”\n“No.” Castiel takes a slow, rattling breath. “I’ve no patience for that. Just take these and shoot Zachariah in the testicles.” He flicks his thumb, sending the bullets back to their owner. “That was figurative, not literal. You may shoot him anywhere you like.”\nDean accepts the enhanced ammunition, careful not to touch Castiel’s blood when he loads his gun. “I know this isn’t…”\n“Stop talking to me.” Castiel turns away, the hunter’s pity worse to bear than malicious glee. Dean should just go on his way to kill Zachariah and claim his ashes. Castiel would kill Zachariah if he could; the ashes would just be a bonus.\nThe walkie-talkie crackles. “Dean, I got him in my sights. Where the hell are you, man?”\n“I’m coming.”\nMaybe they’ll get Zachariah, maybe they won’t. Either outcome won’t matter to Castiel in the long run, or even in the short run, because his fate is here, against these cold bricks. None of this explains why, when Dean opens the door, Castiel calls out, “Wait.”\nDean glances back.\nHe’s insane, that’s what he is. Castiel is delirious and dying, which is why he says what he does to this man – this hunter – in the prime of his life, who probably has the blood of hundreds of Castiel’s supernatural kin on his hands.\n“You need to shoot him from a distance,” Castiel says. “When he explodes there will be… It will not be safe for you. At least two dozen paces. Farther, if you can help it.”\n“I’ll keep that in mind.” Dean opens his mouth, but then seems to change his mind. “I’m going now.”\nThe door clicks shut, and Castiel’s eyes drift back closed. He is so very tired.\n\n\n\n\n\n“Son of a bitch.”\nDean didn’t expect that to work. He hoped it would, but hoping doesn’t amount to much in a business where the wrong scratch in the dirt could lead to someone going home in a body bag. Yet here they are: he and Isaac standing tall with all limbs intact, while the Fawkes formerly known as Zachariah is downgraded to a scar on the floor.\n“You owe me a drink,” Isaac says shakily. “Quite a chance you took there, Winchester.”\n“Tell me something I don’t know.” Dean lowers his shotgun, and the pair of them slowly approach Zach’s final resting place. That burn in the shape of a body with wings could be considered cool, as long as you didn’t know where it came from. “We should get those ashes before the wind does. Can you handle this? I’ve gotta go back down and finish up.”\n“Your call, man.”\nIsaac’s a decent partner but Dean’ll be glad to get back to the Roadhouse. Maybe he’ll get Jo next time, or Victor will finally stop being a bitch and call him. Ellen has a thing about solo hunts, i.e. only in case of emergencies; Dean can’t blame her for putting that policy in place, but it does get frustrating.\nAwkward partner aside, it’s been an easy hunt – as easy it gets, anyway – following the trail from the victims to the perp who’d been hiding his pathetic ass in a fancy-pants mansion in the hills. Sounds like it could be a firebird of some sort, Ash had told them on the phone. Dean had been excited about that, only to be disappointed by reality: Phoenixes are less the firebirds of the ancient sonnets, and more middle-aged bald dudes in bad suits.\nWell, middle-aged bald dudes and sad, malnourished dudes like Castiel.\nCastiel’s right where Dean left him in the underground cell, curled in on his side. The only difference is that his eyes are wide open and unmoving, with a thin film of gray covering his pupils.\nIt’s pretty damn creepy, except for how it’s also pretty damn sad. Dean’s seen cells like these before, mostly used by Djinn and the occasional demon, though it’s rare to see a creature use it on their own. Humans do shitty things to their fellow beings all the time, but creatures more often than not are happy to flock together against the rest of the world.\nWhatever else happened today, Dean can’t deny that Castiel did him a solid.\nThe lock is picked easily, the rusty door swaying open with a groan.\nDean crouches down next to the body. “Worked like a dream.” The poor bastard’s even sadder up close. He’s not human but he sure looks like one, guy almost down to skin and bones. Zachariah’s death was too easy. “Got him right in the kisser.”\nIt’s a pathetic excuse for a last rite, but Dean has the feeling that Castiel wouldn’t mind.\nThe creature’s skin is cold to the touch when Dean rolls him over on to his back. Dean starts to reach for Castiel’s eyelids, and that’s when Castiel sighs.\n“Shit!” Dean scrambles backward, heart pounding. His gun’s out and ready, but Castiel doesn’t move again. He’s just lying there, making like a corpse and chilling.\nDean creeps close and puts his fingers over Castiel’s mouth.\n“Oh man.” Dean pulls at his walkie-talkie. “Isaac, get your ass down here. Dude’s not dead.”\n\n\n\n\n\n\nCastiel isn’t dead.\nIt’s an interesting turn of events, and if Castiel’s mind can start its higher functions soon, he might be able to figure out how that happened. It takes some effort to open his eyes, and more effort still to wonder if a beige-white room with no windows is better or worse than an old brick cell with no windows.\n“Good, you’re awake.” A young woman comes into view. She touches his forehead, which is a prelude to surprisingly strong psychic fingers forcing their way into Castiel’s mind. “So your name really is Castiel. That’s good to know.”\nCastiel takes stock of his surroundings. The simple room has the feel of a basic medical facility, the bed he’s in cordoned off from the rest of the area by an opaque curtain. There are sigils marked in spray paint around the bed and runes carved into the plaster. Castiel surreptitiously shifts his feet, confirming iron bindings around his ankles.\n“The name’s Pamela,” the psychic says. Her grip is business-like, checking his eyes, his ears, his mouth. “You hang on a moment.” She disappears behind the curtain.\nCastiel is still trying to decide whether it’s worth trying to sit up when Pamela comes in with Dean Winchester sauntering in right behind her. He is as Castiel remembers him: tall, fit, and affecting a grim expression as he takes in Castiel’s pathetic state.\n“Hey,” Dean says. “You feeling better?”\nIt takes an embarrassingly long time for that question to sink into Castiel’s head. “Excuse me?”\n“You’ve stopped bleeding, at least.” Dean’s arms are crossed tight across his chest, his gaze assessing. “For a while we thought it wouldn’t stop. And it didn’t, not until we got you stationary. Was a bit of a tough one, it’s not like anyone here has any experience with firebirds. Pamela wasn’t even sure if we could clean you up with alcohol without the place catching fire, heh. But the bandages seem to be working, at least.”\n“Oh no.” Castiel stares up at him in horror. “I owe my life to a hunter.”\nDean shrugs wryly. “Them’s the breaks.”\n“Definitely a kind of Phoenix,” Pamela says, snapping her gloves off. “Level 3, I think. We can tell Ellen, she’ll be relieved.”\n“Ah.” Castiel sneers at them. “I’m your prisoner now.”\n“What?” Dean’s eye drops to the chain on Castiel’s ankles. “Those are precautions. If you can tell us what you eat, maybe we can—”\n“Human hearts,” Castiel says quickly.\nDean gives him a look.  “Besides that.”\n“Human eyes.”\n“This ain’t Pankot Palace, buddy.” Dean laughs, as though this is funny. “You don’t eat people – even Zachariah didn’t eat people, he was just a sadist that needed to be put down. I read that Phoenixes burn their food before eating it, but I don’t think that’s on the table for you right now. I could get some barbecue, maybe? Super well-done?”\nCastiel stares at Dean for a long moment, utterly perplexed. “I don’t understand what you’re saying. Did you kill Zachariah?”\n“Yeah. Worked just like you said.”\n“So you’re useful for something, then.” Castiel feels a petty jolt at the way Dean starts in surprise. “Good to know.”\n“You know what?” Pamela says loudly. “This is not helping the cosmic order of my infirmary. Castiel? You are not our prisoner, you are a patient, and you are not a special snowflake. I’ve handled tougher creatures than you, and the only reason you’re not in a cell right now is because Dean’s vouched for you.”\nThat doesn’t ease Castiel’s confusion. “Why?”\nDean’s face softens a little. It is possibly the most terrifying thing that Castiel has ever seen. “You saved my life,” he says. “You thought you were going to die, and the last thing you did was save my life.”\n“It was a moment of insanity.”\nDean glances at Pamela. She narrows her eyes – there’s the feel of the same psychic fingers scraping through Castiel’s thoughts – and then says, “Yeah, he’s good. I’ve got to let Ellen know, she’ll want an update. Oh, and Dean? Clean this up.”\nDean waves at her. “Yeah, yeah I got it.”\n“I take it back,” Castiel mutters to Pamela’s departing back. “I’m not the one who’s insane, it’s all of you who are.”\n\n\n\n\n\n\nDean knows what he’s doing. It’s true that he’d had doubts earlier when he’d had to drag Castiel’s sorry ass all the way back to the Roadhouse and Ellen reamed him out for not notifying her until they were already in the compound, but now that Castiel’s awake, Dean’s sure it was the right call.\nLevel 3, Pamela had said. That means Castiel’s angry but not thinking blood-thirsty thoughts that would make him an immediate danger to the Roadhouse. Some creatures can be even more dangerous when they’re weak, figuring that they have nothing to lose. Castiel doesn’t read like that to Dean, though.\nDean gets a wheelchair from the closet. Castiel glares at him the whole time, and it’s a good thing his creepy second eyelids have retracted, leaving the kind of clear blue irises that Hallmark card photographers would cream themselves over.\n“We’re going for a ride,” Dean says. “Just a short one, and I promise to do my best to not give you motion sickness.”\nCastiel stiffens. “Why?”\n“Because it’s boring in here, that’s why.” Dean pulls a corner of the bedsheet away to reveal Castiel’s pale feet, still shackled to the bed frame. Castiel feebly tries to pull away but it’s easy for Dean to reattach one length of chain to the wheelchair, and then stand back. “I can carry you, if you want.”\n“No!”\nDean raises his hands in surrender. He patiently waits through Castiel’s internal conflict, the guy should be smart enough to weigh the pros and cons of refusing to go along with this. Castiel eventually shoves the sheets away, hands shaking with effort when he climbs down into the wheelchair.\nDean takes up station and starts wheeling Castiel. “Here we go.”\nAs soon as they’re past the curtain, Castiel gasps. “What is that? What is – is that a werewolf?”\nThe infirmary isn’t empty, and the sole other patient sits up sharply. “I’m not an it, thanks,” Madison says.\n“Why do you have a werewolf in your premises?” Castiel hisses. “Is this – experimentation, torture—?”\n“She likes the skinmags Pamela leaves around the place.” Dean winks at her. “See, I didn’t make a single joke about lunar cycles or—”\n“You’re in good hands, okay?” Madison tells Castiel kindly. “I know it’s frightening right now, but it’ll be fine.”\n“Madhouse,” Castiel declares. “All of it.” He mutters under his breath all the way to the end of the ward.\nOnce there, Dean pushes the door open and Castiel finally falls silent.\nIt’s a gorgeous day outside. Dean looks up to the conveniently blue sky, and then kicks the ramp so that he can wheel Castiel to the ground. There are no windows in the infirmary for various reasons, but Pamela’s spent the past couple of years setting up a nifty garden back here. It’s hidden from the high-traffic portions of the compound so it’s nice and quiet, which is just the way Pamela and most of her patients like it.\nCastiel’s face is tilted up to the sky when Dean parks the wheelchair about halfway from to chain-link fence. How long had he been in that prison, anyway? His skin’s near bone white, cheeks sunken in and lips cracked dry, but it’s hard to tell what’s his usual look and what’s been forced on him. Still, there’s something to be said for the way his eyes go wide and his fingers, though weak, clutch at the wheelchair’s handrests.\n“What do you want?” Castiel’s voice is a soft croak.\n“Hmm, what?”\nCastiel closes his eyes, looking almost pained. “What. Do you. Want?”\n“I don’t want anything.” Dean splays his weaponless hands out. “Okay, that’s not true. I’m taking a chance with you, Castiel. Eye for an eye, one time only. You get better, you walk, and we’re even. That square with you?”\n“What.” Castiel stares at Dean. “You want to let me go?”\n“Well, not right here. I’ll drive you out, if there’s somewhere you want—”\n“Take out your gun.” Castiel’s hands grab at Dean, weak as kitten paws. “I know you have one, you’re not stupid.”\n“Watch it.” Dean slides away from his reach. There is, in fact, a gun tucked into his pants, loaded with bullets of Phoenix ash that should work as good as blood, but that’s just a precaution. “There’s no need to be touchy—”\n“Stop talking to me like I’m a child.” Castiel’s a pathetic sack of bones, but his impossibly blue eyes cut sharp with anger. “You shouldn’t have interfered. I’m already dead, you’ve just delayed it.” He turns to the fence, searching for something beyond the trees. “Zachariah wasn’t working alone. There are others on his side and they will find me and finish it, and they will be far less kind than a bullet.\nCastiel meets Dean’s gaze, fierce and imploring. “Dean, I’m asking you to be kind.”\n“What?” Dean takes a startled step back. “Geez, no! You survived that hell hole.”\n“Isn’t it your job to fix that?”\nDean inhales sharply, arms tense with the punch he doesn’t send Castiel’s way. For a second Castiel’s eyes are fearful – Dean knows what he sees when Dean looms over him – and then his cool mask is sliding back on. Dean takes a couple of steadying breaths, pushing down the anger that’s clogged at the back of his throat.\n“Not cool,” Dean says. “No.”\nCastiel shivers, tucking his shoulders in to make himself smaller. “It’d be easier.”\n“I’ve been there.” Dean lowers himself to his knees so that their eyelines are level. “I know it’s tempting, but that doesn’t work. Come on, you don’t need me of all people to give you a pep talk, you’re never gonna buy that. But there’s gotta be something out there you want to go back to.”\nCastiel smiles wryly. “You’d think so, wouldn’t you.” Then he frowns, as though just noticing Dean. “How did you deal?”\n“I was lucky.” Dean shrugs. “My brother got better.”\n“Convenient.” Castiel exhales sharply, sagging into the wheelchair as though force of will had been the only thing holding him upright. “It’s only a matter of time before the others find me. I’d taken my leave of my brethren and severed the connection between us, but a tetherless mind is easily found by those who search for it.”\n“Wait,” Dean says. “Bells, ringing. You are a kind of Phoenix, aren’t you?”\n“A Garuda, actually,” Castiel replies wistfully. “Similar and related, but not technically the same species. Zachariah was a cousin, the blood rule applies across the lot of us.” He shakes his head angrily. “We are soldiers of honor, we’ve fought alongside humanity for many centuries and it’s like they’ve forgotten everything. I hope Zachariah screamed when you shot him.”\n“Sadly, he only cursed a lot and called us rude names.” The tips of Dean’s fingers tingle with the forming of an idea. “This all sounds really familiar, we might actually be able to do something with this. How long would it take for you to heal up?”\n\n\n\n\n\n\nThis has to be one of the most insane things Castiel has ever done. Second only to his leaving home, perhaps.\nHe’s starting to hate the wheelchair, so Castiel distracts himself from mean thoughts by listening to Dean’s commentary. This place is called the Roadhouse, which by Dean’s enthusiastic descriptions makes Castiel think he thinks it’s the most interesting place on earth.\n“That’s the name of the whole place,” Dean’s saying above his head. “Med block’s in the back for privacy, on the left there is Bobby’s salvage yard, and coming up here is the main building. Technically the Roadhouse is just Ellen’s bar – that’s out front, maybe you’ll see it later – which was the original building before she expanded. Now we just call the whole compound the Roadhouse.”\n“Where does the werewolf stay?” Castiel asks.\n“Madison? Oh, she doesn’t live here, she just comes by once a month to get Pamela to braid her fur.” Dean’s head snaps around quickly. “Pretend I didn’t say that, I don’t want to get my ass kicked this week.” Then, with a bit more seriousness, “She’s a friend.”\n“How is that possible?” Castiel asks.\nDean snorts. “You just asked for sanctuary from a hunter, Cas. It happens. In her case, me and my brother got tangled up with her on a hunt. Stuff happens, Ellen comes up with a plan, she ends up coming by every month when it’s teeth and claws time.”\nSo although Castiel’s first summation was right – that this is indeed nest of hunters –he couldn’t have guessed that the occasional creature or two may not be unwelcome. That is something to think about. The last time Castiel had any meaningful interaction with humans had been centuries ago, before their paths diverged and hunters took up arms against them.\n“Hey, Dean!” There’s a man pushing a wheelbarrow in the salvage yard, though he’s put it down to watch them go past. “Is that the stray of yours?”\n“Just giving him some fresh air, Bobby!” Dean yells back.\nBobby raises his eyebrows. “He doesn’t look too good!”\n“Yeah, we’re working on that!”\n“Stray?” Castiel echoes later, after a harrowing adventure of getting the wheelchair up two flights of stairs to Dean’s apartment due to Castiel’s refusal to be carried. “Did I hear that correctly?”\n“Not now, Cas.” Panting for breath, Dean tows Castiel the last few feet through the open door and closes it behind them. “Sit tight, I’ll be right back.”\nCastiel looks around. They’re in a sitting area, a TV set up at the wall and chairs arranged in a haphazard manner. A simple kitchen area is on the farther side, mirrored by a well-stocked bookshelf on the other, and between the spaces of the wall are three doors. How much space does one person need?\n“Door in the middle’s for the bathroom,” Dean calls out. “My bedroom’s on the right, the other one used to be my brother’s so that’s yours for now.” He trails off, muttering about blankets.\nCastiel manages to wheel towards a side table to study the framed photographs propped up there. In one, a man and woman, obviously married, are holding a pair of children. Everyone looks happy. In another, Dean and a man Castiel assumes is his brother are sitting on the hood of a black car, seemingly relaxed and contented.\n“Here’s what I got.” Dean returns with a large leather-bound tome that he sets on the coffee table. Castiel’s pleased to find that Dean has some civility, at least, because he snaps on a pair of gloves before opening the old pages. “I was reading up on Phoenixes. Earlier, when we were still trying to confirm what you are. And I saw this thing, this story, and I didn’t pay much attention to it at the time but maybe it’ll be useful.” He angles the book for Castiel to see.\nA few words in, and Castiel stifles a groan.\nCastiel shouldn’t be surprised. This is myth to Dean but history to Castiel, and it’s rather bizarre to hear Dean talk about the old rulers as though they’re characters of fiction.\n“So if these kings could’ve had Phoenixes and Garudas in their army,” Dean says with increasing excitement at his own cleverness, “why can’t we use the same spell to link you and me? It’s a mutual bond, right, going both ways? Heh, both ways. More importantly, you’re off the radar of the bros that want to take you down, and you’ll heal faster. That means you’re out of my hair in no time and hey! We all go home champions.”\nSo. Dean Winchester wants to get this stray out of his hair in no time.\nSurprisingly, Castiel feels calmed by this. He looks into Dean’s hopeful, gormless face, and realizes that this is a man who prefers to think in straight, convenient lines. Of all the options, this is one of the best Castiel could have hoped for.\n“What you’ve described is called a nikah,” Castiel says. “Do you know what that means, Dean?”\n“Gimme a sec, I got my phone—”\n“It means marriage.” Castiel watches that sink into Dean’s head. “The spell you’re talking about is a marriage bond. I suppose your books don’t mention it for diplomatic reasons, but my brethren who’d been in service of human monarchs were technically their concubines, though sex was not a necessary part of the arrangement.”\n“Oh.” Dean is thoughtful. “So it’s like a contract, then?”\n“Yes, actually.” Castiel had only been peripherally involved in the dramatics of that era, preferring to not get involved when his kin directly warred with each other. Raphael had been pleased to marry the great King Solomon, and not only because it gave him ample excuse to hunt and battle Gabriel whenever he wanted. Balthazar had married a Queen somewhere in there, too, though that had been more for recreational purposes.\nThat said, this suggestion is still better than putting Castiel in a box and hoping no one notices.\n“Is that your family?” Castiel gestures at the photos he’d been studying earlier.\n“Huh? Yeah.” Dean smiles. “That’s my brother, Sam. Those are our parents. They died a long time ago.”\n“So, Sam is your closest living relative.” The photo seems recent, taken only a handful of years prior. “What would he think of you getting married to a monster?”\n“What, do you sparkle in sunlight, too?” Dean laughs at some unseen joke. “Look, Sam used to date Madison, so I doubt he’ll get high and mighty on me. It’s only temporary, right? You said yourself that it’s used as a contract. Just until you’re healed up, and then we’ll break it and never have to see each other again. So what do you say, Castiel, do you want to marry me or not?”\nIt’s the strangest proposal Castiel’s ever received. Not that he’s ever been proposed to before, but he knows the theory of it. Anna spoke of tender promises and touches, Balthazar had outrageous flirting in his, and even Raphael’s professional marriage had involved long, careful negotiations of mutual respect.\n“This is,” Castiel says slowly, “terribly unusual.”\n“Great!” Dean nods. “We agree on something.”\nThe worst part of all of this is that Dean is right. He may not know the full extent of what he’s dealing with, but he’s right. This is the best chance Castiel has, for he won’t be able to survive very long inside or outside this hunter’s den without that level of protection. He’d be a fool not to take this.\n“Fine. I’ll marry you. But we need to outline the regulations of the arrangement.”\n“For that,” Dean grabs his cellphone, “I’ll need my lawyer.”\n\n\n\n\n\n\nWhen Sam arrives at the Roadhouse, he bitches at Dean for something like ten minutes straight about due notice and shoving things at him at the last minute and “what do you mean he’s a Garuda, are you messing with me”. By then Ellen’s already been notified of the whole scheme and gotten Castiel into her office to give him the third degree, so that’s where Dean and Sam find him.\n“There you are.” Castiel is doing his best impression of an angry caterpillar, glaring up from a cocoon of blankets on Ellen’s couch. “Hello, you must be the brother.”\nDean looks at Ellen, who shrugs and says, “He said he was cold.”\nSam is nothing if not predictable, his mouth already drooping downwards as he watches Castiel struggle with the blankets to get his too-thin hands around the mug of hot chocolate. Dean shoves Sam forward. “Cas, this is Sam. Sam, Cas.”\n“Hi.” Sam kneels down, which means that Castiel’s now glaring at him instead of the hot chocolate. “I’m—”\n“Yes, Dean just introduced you,” Castiel says. “Is this going to be a day of redundant statements?”\n“Be nice,” Dean warns.\n“It’s okay,” Sam says, unoffended. He leaves Castiel to his chocolate and pulls Dean aside for a conference with Ellen. Dean can already see the excited wheels turning in the great big clunker that’s Sam’s head. “What’d you think?”\n“He does anything funny, we shoot him,” Ellen says. “So no, I don’t trust him, but if this spell does what you say it does, that won’t be a problem.”\nSam pulls out the folders he’d been carrying in his old man’s briefcase. “We can start working out the details and check if there’s anything’s in the fine print. You seriously don’t mind being saddled with a new roommate, Dean?”\n“Can’t be worse than the last one.” Dean grins at Sam’s eye roll.\nIt’s not like Dean’s ever woken up one morning and said to himself, hey, how about getting married to a supernatural creature today, that could be interesting. Yet here he is and that’s exactly what he’s doing.\nActual reasons aside, after they get the terms worked out and Bobby and Jo are called in as witnesses, the whole thing feels hilariously like a shotgun wedding. Here’s Dean and Castiel side by side before Ellen’s desk, waiting while Ellen double-checks her speech. As the boss of the Roadhouse, that gives her the authority to oversee this, though Bobby’s still not convinced about any of this.\n“We still going to have the bit about holding our peace?” Bobby asks.\n“Hey, Dean should get married if he wants to get married,” Jo protests. She pumps her fist in the air supportively. “Rock on.”\n“Yeah, getting married with a goddamn cereal box ring,” Bobby grumps. Said plastic cereal prize ring, grabbed from the pantry, rests on the table next to one of Dean’s silver rings that he’s donating to the cause. “Real classy there, Dean, you’re going to be telling this story for years.”\nCastiel looks up at Dean. “Your family talks a lot.”\n“Not really,” Dean replies.\n“The last I saw, my family liked to attack each other with swords,” Castiel says. He doesn’t seem to notice the awkward silence that follows. “Not all of them. I have some cousins who are quite pleasant, though I have no confirmation they’re still alive.”\nJo clears her throat. “Do you really have wings?”\n“Yes, but they are shredded and useless at the moment.”\nDean grimaces. “I got the guy who did it, does that count as a wedding present?”\nCastiel tilts his head up to shoot Dean an unimpressed side-eye that could knock him to his knees if it were coming from someone taller than four feet. “Of course, Dean. It has always been my goal in life to settle down with a hunter who would offer me an act of violence as a testament to his intentions.”\nDean pats Cas’ shoulder. “That’s the spirit.”\n“Okay, people, we’re going to do this!” Ellen exclaims with a loud clap. “Fix your collar, Dean. Try to look at least halfway decent.”\n“Thank you, Ellen,” Castiel says primly.\nIt’s a pretty straightforward ritual. Ellen opens with a dramatic, “Good evening, everyone, we are gathered here today to observe this union between Dean Winchester and Castiel, under the rites described herein. First up’s the bloodletting. Who’s got the needles?”\nThere’s pricking of thumbs that are to be pressed together, and then the speaking of vows in a language Dean dutifully parrots back. The ritual only asks for ‘tokens’, not rings specifically, but according to Castiel, Dean’s belief is just as important for the ceremony to work. Dean believes weddings aren’t weddings without rings, so rings they shall have.\nDean goes first, sliding the silver piece he’d gotten from some random flea market years ago on to Castiel’s finger. Then it Castiel’s turn – Dean’s orange cereal prize ring is too small to go past his second knuckle, but Castiel insists that it’s fine.\n“Alrighty then.” Dean admires his new piece. “New jewelry, check.”\n“So by the power vested in me,” Ellen says. “I proclaim you married.”\nDean waits. He looks down at Castiel, who stares back up at him in similar expectation. Dean had hoped that the mental bond would be unobtrusive but there should be something at least. Who the hell makes a spell without some fireworks? You’d never know if you cast it right.\nCastiel turns to Ellen skeptically. “Are you really the authority?”\n“Yes, she really is the authority around here,” Dean says. “Was that really the correct ceremony or were you pulling that out of your ass?”\n“I did not pull—”\n“For crying out loud,” Bobby says irritably. “You gotta kiss.”\nDean and Castiel look at each other.\nIt’s unfair to think that Castiel looks like death warmed over, even if he does look like death warmed over. There’s been little improvement since Dean rolled him over in that prison cell, and it’s hardly Castiel’s fault that he has all the appeal of an aged, sun-baked frog.\nExcept his eyes, maybe. Cas’ eyes are a pretty interesting shade of blue that’s sadly muted in the bad lighting of Ellen’s room, but they’d been ridiculous out in sunlight. Anyway, it’s not like Dean’s lack of interest actually matters.\n“No problem.” Dean crouches down, not quite kneeling, and leans in.\nCastiel’s lips are sandpaper dry. That’s not the interesting part; the cool part is as soon as Dean lays one on him, something in Dean’s mind moves, like a window he hadn’t known existed quietly sliding open.\n“Oh.” Dean falls back onto his haunches in surprise. “Oh, okay.”\nIt’s like a sixth sense. Or a seventh sense, whatever. Dean can see Castiel right in front of him but he can also feel him, like a radio set to a frequency only Dean can hear. Castiel is a sack of bones on wheels, but he’s also radiating waves of emotion (resignation, anxiety, fear) along with the white noise of hundreds of whispery thoughts laid over each other.\n“There.” Castiel’s eyes flutter closed. “It’s done.”\nThe mental bond is a new weight at the back of Dean’s mind. This must be kinda like what Pamela and Missouri feel like all the time. He tugs at the bond, jumping when Castiel makes a sound of surprise.\n“So how is it?” Sam asks.\n“Weird.” Dean prods at Castiel’s mind curiously. There’s a give when Castiel allows him to dip in, and it’s easy to rustle around the topmost layer of Castiel’s thoughts. There are no words there, just sensations, and although Dean can’t parse all of them yet, he can clearly see Castiel’s fatigue and relief. Then there’s a tingling sensation when Dean feels Castiel probing at him.\n“Your intentions are as honest as could have been hoped for.” Castiel’s face has lost some of its pinched look. “I am agreeable.”\n“Well then.” Ellen slides the jacket off and tosses it over her chair. “Let’s get out of here, drinks are on me tonight.”\nJo raises a hand. “Doesn’t Dean have to toss a bouquet?”\n“I’ll toss your face!” Dean yells back, though she just laughs at him.\n\n\n\n\n\n\nCastiel hadn’t realized how badly he’d missed having a bond. He takes care not to clutch at this new one too tightly, for Dean is still a human and a stranger, but its presence is a balm.\nThe real surprise is that Dean’s mind is gorgeously vibrant. He is youthful and energetic and everything that Castiel can’t remember ever being, and that’s only what Castiel can see from casually brushing the surface. The moment the bond locked into place Castiel’s entire being seemed to exhale in relief.\nPhysically, Castiel’s now burrowed deep into Sam Winchester’s former bed, but through the bond he can sense Dean’s presence in the outer room. Good humor and affection lolls over Dean’s thoughts as he converses with his brother, and just beneath that are feelings of wrought iron, fierce and protective. Sam is beloved. The strength of it startles Castiel, and he will push no deeper.\nThat’s just fine, though, because Castiel doesn’t need anything else from Dean. It’s enough that the bond is there, which will allow him to focus all his energy on healing.\n“Yo, you in there?” Dean calls out.\nCastiel’s comfortable in his hive of blankets, which is a galaxy away from Zachariah’s cold, hard floor. He doesn’t want to move, and the good thing is, he doesn’t have to.\nNo, I’m not, Castiel thinks at him. I’m just a pile of blankets, pay me no heed.\nDean’s surprise tastes like mint: cool and slightly tangy. Whoa, that was… I can hear your voice in my head. \n\n\nThat’s the idea, Dean.\n\n\n\nDon’t be a smart-ass. Dean’s footsteps approach the bed, and another layer of blankets are added on top of the ones Castiel’s already purloined. It’s different from being able to sense your feelings and knowing where you are. Feelings are kinda like… colors? Sort of? But this is like directly talking to you. Look, no mouths!\nDean is coping well to the mechanics of the link. Castiel had heard that some humans were adept, but he’d found that hard to believe.\n“So me and Sam are gonna go for dinner with the others,” Dean says. “There’s water outside. You know where the bathroom is.”\n\n\nI can manage. Right now all I need is sleep.\n\n\n\n“Sure thing.” Dean is remarkably chipper, almost buoyant in the aftermath of an event he’d never planned. Resilience may be a virtue, and Castiel will honor his part of the bargain.\nThe entire ceremony with Ellen had gone so smoothly that Castiel wonders if this is part of his fevered mind’s attempt to give him hope, and that he is still in the cell of Zachariah’s home. He discards that notion swiftly; there is no faking the new presence thrumming at the edge of his mind, tugging at his thoughts with gentle curiosity.\nCastiel is starting to think that this might actually work out. This endeavor may be worthwhile, and he will be able to fly again one day.\nDean, Castiel calls out.\nDean’s thoughts are on food, but he’s listening. “Yeah?”\nThank you. \nDean’s mind titters, rolling away in attempts to brush off the thanks as unnecessary and unwanted. Castiel pulls back – Dean’s brain is a kaleidoscope of language he doesn’t have the energy to decipher, and for now all he wants to do is sleep.\nSo he does, slipping under as soon as Dean is gone.\n\n\n\n\n\n\nIt’s a slow night in the bar, so Ellen takes a table in the back that’s large enough for the immediate Roadhouse crew. Pamela’s already done setting up Madison for the next couple of days, and is immediately on Dean’s ass for not inviting her to the ceremony.\n“What kind of friend are you?” Pamela tries to grab the plastic ring that Dean’s moved to the cord around his neck, but he quickly tucks it into his shirt. “I miss everything interesting around here.”\n“Head’s up for everyone,” Ellen says. “We’re keeping this under wraps. The fewer people know we’ve got this guy here, the better. So for now we’re restricting this to the Roadhouse and no further. Yes, Bobby, you can tell Rufus when he gets back.”\n“Nice to know this is what it takes to get your ass down here from school,” Dean tells Sam. He moves to ruffle Sam’s hair, laughing when Sam jerks out of the way with a displeased grunt. “Any hot students hitting on you yet?”\n“Totally irrelevant,” Sam replies airily. “What I want to know is what’s going on in your head. Is it – is it like a built-in cellphone? Do you just hear words, or are there images, too?”\n“Well, kinda.” It’s easy to do but hard to describe. Dean can reach out with his mind to find Castiel exactly where he’d left him, sleeping in Sam’s room and practically dead to the world. “I’ve never wondered what it’d be like to have a direct line to someone else’s brain, but so far it’s just… like having a third eye, I guess.”\n“You know, it’s funny.” Jo chuckles under her breath. “I thought if anyone were to marry a supernatural creature, it’d be Sam.”\n“That’s true!” Sam agrees, lifting up his glass to clink against Jo’s. “Dean, you have just made that running joke officially obsolete. For that, I must thank you. Salud!”\nThe Roadhouse is just made up of assholes, apparently, because there’s a chorus of agreement and the wholehearted tossing back of drinks. Dean makes a show of being annoyed, but in no time he’s cracking up and drinking with the best of them.\n\n\n\n\n\n\nCastiel sleeps.\nHe’s vaguely aware of the passing of time, marked by the change of temperature and light beyond the curtains, but for the most part it’s a long, blurry stretch of rest, punctuated by his occasional waking up to get a drink and check the bond.\nNo one barges into the room to demand explanations. None of his kin come screaming for his head. The worst that happens is that Castiel sometimes wakes up to Dean singing loudly in his head, usually about highways and/or roads of various sizes and allegorical meanings.\nCastiel hasn’t been able to sleep like this since he’d broken off the family link, which must have been a couple of centuries ago at least. He’d told himself at the time that he could survive without it, that the pain of having to choose a faction and see his kin turn on each other was too great a price to pay for the inherent security of a bond.\nHe’s not unaware of the irony of who’s now at the other end of this bond.\n“I know you’re awake,” Dean says, during one of the moments in-between when he’s conscious. “You’ve been in there for almost three days. I’m not gonna judge, you do what you gotta do, but this is still my home and you’ve got to be rank under there. I have a shower, you know.”\nNo. Go away. Castiel pulls the blankets tighter, pleased that he’s recovered enough motor control to be able to do that at all.\n“Don’t you need to eat?” Dean’s voice is coming from the foot of the bed, and Castiel can tell that his arms are crossed and he’s trying to glare Castiel out from his nest. “I don’t have any snakes, but we can figure out something if you’ve got any alternatives.”\nSnakes?  Castiel starts in surprise. Ah, you’ve been reading up. Actually, we don’t eat reptiles, we eat the other kind of serpents. Namely, those who call themselves children of The Serpent.\n“Demons? You eat demons?\nYes. Castiel doesn’t resist when Dean probes his mind, checking for truthfulness. But we can go for many years, decades even, without feeding. It won’t be a problem. Castiel lets Dean have some of his older memories, of when Castiel was younger and hunted with Uriel and Anna, flying free across the plains in chase.\nDean blanches. Oh Jesus, you fly.\n\n\nI thought you said you’ve done your research\n\n.\n\n“Could’ve been metaphorical,” Dean retorts. “Most of the really old stories are.”\nNow you know otherwise. What are you doing? \nCastiel’s blanket shelter shifts wildly when Dean grabs handfuls and pulls. Relatively fresh air hits Castiel’s nostrils. “C’mon, you can’t stay in… Holy mother of what the fuck’s your face!”\n“I’m molting.” Castiel peels a scale off his forehead and studies it. “This is a normal part of the healing process.”\nDean’s face is a rictus of horror. “Is that hygienic?”\nCastiel glances around the incongruous human bedroom. “Probably not, but I promise that I will clean everything properly once I am able. Usually I am underground when I am in this state, for this is when we are most vulnerable.”\n“Yeah, you could’ve mentioned something about that.”\n“It’s not that bad,” Castiel insists. “It is like peeling off sunburned skin. Haven’t you seen far more grotesque things in your line of work?”\nDean stumbles to his feet. “For the love of keeping my breakfast down please stop talking.” He turns around, firmly facing away from Castiel. “You need to have a shower and you need have it soon. There is gross and then there is shedding body parts all over my room—”\n“I thought this was your brother’s room.”\n“My room!” Dean yells.\n“All right, it’s your room,” Castiel concedes. “I will do my utmost best to not leave any body parts lying around once I’m done.”\n“Oh god, do you eat them?”\n“Don’t be silly, the nutritional value would be negligible.”\nDean gags. “Nutritional value should be the least of your concerns, Cas.” His mind has calmed, though, and his shallow-most thoughts are on a man named Jeff Goldblum who is somehow able to crawl on ceilings. “Will you have a shower or not?”\nCastiel sinks back into the blankets. Later.\n“Hey!”\n\n\nI am a\n\n \nfirebird, Dean. I need to be dry until I am better. Who is David Cronenberg?\n\nDean shudders. “Go back to sleep.”\n\n\n\n\n\n\nA little downtime’s good for the soul. Dean can still play his part from home base, no problem, though Bobby keeps grousing that Dean’s “compromised” and is “under house arrest for being a potential threat”. Dean can see where he’s coming from but he doesn’t feel like a loose end.\nTrust and safety are inherent to the spell, Castiel tells him during one of the breaks between his epic nap time. I can heal quicker because my body knows that I am being watched over by another. It’s not surprising that you feel some semblance of safety in the presence of the bond as well. It’s nothing personal.\n“Ain’t that right,” Dean agrees.\nIt only gets weird when Castiel dreams. Sometimes Dean would be doing something menial like changing a lightbulb and he’d be hit with a surround sound image of a desert, so vast as to seem like another planet, and somewhere in the distance there’d be chanting in a language he doesn’t know. He’d poked at Castiel for that, thinking the guy was trying to tell him something, only for Castiel to startle awake, panicked and confused.\nDean gets the hang of it after a while, though. Dreams are as fuzzy as cobwebs, and just as easily brushed aside so he can focus on stuff that needs to be done.\nThere’s plenty that needs doing, too. Dean’s already on occasional kitchen duty, general maintenance and helping Bobby out in the salvage yard, but case traffic happens to pick up in the fortnight after Cas’ crashing the place. Jo and Ash end up having to take more fieldwork, leaving Dean to dive into long-distance recon and manning the phone bank. It’s not as satisfying as going out himself, but it’s okay. They do good stuff here.\nDean knows the Roadhouse isn’t unique. There are other hunter hole-ups all over the world, but Dean genuinely believes they’re the best. The Campbells’ compound is bigger and has a killer library, and Gordon’s place is stocked like a survivalist’s wet dream, but when people want good food, a good time, and good info without being forced to trade unfairly for it, they come to the Roadhouse.\nEllen and Bill founded the place, some time before Jo was born. It started out a bar, and probably would have stayed that way if Bill hadn’t died on a hunt and Ellen got on her damndest to prevent that from happening to anyone else. If only he’d had the right info, Ellen liked to say; if only he hadn’t been alone, and if only there’d been others to turn to for help. Tradition has hunters staying isolated, but Ellen has spent the past decade plus turning that around. (Gordon’s a poor copycat.)\nNowadays, only the bar in front and Bobby’s yard are open for civilians. Everything else is by invitation only, but the bar is still an important fixture in keeping the place looking like a legit, respectable business.\nJo’s hitting the road means that someone’s got to man said bar. Usually they do a coin toss, but this time it’s unanimously agreed that Dean will take over bar duty until such time as Jo gets back from kicking ass.\n“You enjoy it, though,” Jo says. Tonight she’s apparently decided to supervise Dean’s prep work before leaving, because that’s just the kind of caring person she is. She points at a spot Dean’s missed in his wipe-down.\n“I can never remember to be polite to tourists,” Dean says. “Why do we even have to be nice to tourists, they never order anything worthwhile.”\n“Basically, any time you think about being an asshole, ask yourself, what would Jo do? And then do it.” Jo slides a note on the table, smiling. “Now make me a drink before I go. You will be graded.”\nHalfway through preparing Jo’s on-the-fly concoction, the mind link stirs. Dean’s hands slow down so he can concentrate enough to reach out and check.\nDean? Castiel’s groggy, but awake.\nWorking, Dean sends back. You finally getting your butt out of bed? Hallelujah.\n\n\nHow long have I been hibernating?\n\n\nDean drops a frilly umbrella into Jo’s drink with a smirk and slides it to her. Almost two weeks. I gave up checking up on you after the first, the room’s a freaking biohazard zone.\nCastiel drifts away, his immediate on his thirst and desire to get cleaned up – finally – so Dean turns his attention back to the present, apologizing to some poor guy who’d been trying to make an order.\nJo raises her eyebrow, then nods with understanding when Dean taps a finger to his forehead. “Should I go?”\n“Nah, finish your drink. Might be the last decent one you’ll have until you’re back.”\n“Don’t flatter yourself.”\n\n\nDean, there are some things in the bathroom, may I\n\n…\n\nYeah, that’s for you. Towels, toothbrush, plus some of Sam’s old clothes, though I don’t know if they’ll fit. And please do me the favor of using plenty of soap, thanks.  Dean shakes his head.\n“I’m having second thoughts about this being a good idea,” Jo says worriedly. “If you keep spacing out like that, people are going to notice.”\n“It’s a slow night,” Dean protests. “It’s like having a TV on in the background, I just need to get used to it. And hey, see I just got that guy his drink, no problem. That okay, buddy? Right back atcha.” Dean ducks his head to hide a smile when, through the bond, he hears Castiel cursing violently at the shower. Don’t yank the knob like that. It’s not an enemy.\nCastiel responds with the mental equivalent of a kick. I would like some privacy for my ablutions, thank you.\n“You’re probably right,” Jo says. “Anyone who knows you will probably figure you got a free porn subscription and overdosed. Fried some of your brain cells.”\nJody Mills, who had been walking up to the bar, stutters the last few steps. She glances from Jo to Dean and back. “I want to ask, but something tells me it’d be safer if I don’t.”\n“Hey, Sheriff,” Dean says. “Whoa, someone’s not a happy camper. Bobby left you hanging again?”\nJody drops onto a stool despondently. “I have no idea where he is, and he’s still got my car!” She dips her hand into the bowl of nuts Dean helpfully pushes towards her. “Something about giant spiders in Rhode Island, not that I can make much sense out of half a voice mail.”\n“Giant spiders in Rhode Island?” Jo echoes. “I think you heard that wrong, word on the vine is that the Campbells jumped on that.”\n“Hey now,” Dean warns, “We don’t talk about the Campbells here.”\n“You’re so touchy,” Jo laughs.\n“I’m touchy because I’m related to assholes?” Dean snorts. “Yeah, that’s fine, I’m touchy. Sheriff? How ‘bout I get you a drink and put it on Bobby’s tab. That work with you?” Of course Jody’s down with that, and Dean gets on it.\nThe ladies happily get on gossiping about Bobby. Jody got pulled in with them through a case, which is how the story usually goes. Dean doesn’t know her very well but she’s tight with Bobby and Sam, so she must be cool. Dean still jumps whenever he sees a uniform, but he’s getting used to having this particular Sheriff around.\n“I’m pretty sure Bobby went out to Rufus,” Jo says. “Something about Okamis out of season.”\n“Man,” Dean groans. “All the interesting shit comes out when I’m on downtime. Remember a couple of years ago when you couldn’t go anywhere without tripping over a demon? Now we barely see ‘em anymore and there’s all these other creepy crawlies rising up to the surface. All I managed to get was a Phoenix, and it wasn’t even a real one.”\n“Zachariah was a real Phoenix,” Castiel says. He sits down next to Jody. “Not the kind you were expecting, but he was still real. Hello, Dean.”\nDean blinks, and then blinks again. “Uh. Where did you come—”\n“Through the door. Like normal people.” Castiel makes himself comfortable on the stool. You’re really unobservant. \n“This is Cas,” Jo says. “Cas, this is Sheriff Jody Mills. She’s new around here.”\n“Nice to meet you,” Castiel says. “I’m new, as well.”\n“Party for everyone.” Jody slides the bowl of peanuts at him, and Castiel pops one into his mouth.\nBy this time Dean’s recovered enough to offer a weak, “Hey, Cas. You’re looking better.”\nCastiel nods. “Yes.” Instead of being emaciated near death, he just looks like a guy in need of a bit of sun once in a while. He’s also freshly showered, presumably minty fresh, and has damp hair that’s sticking up in unruly spikes. Dean probably wouldn’t have known it was him if the bond weren’t humming in recognition.\nHis eyes are the same, though.\nJo coughs, and Dean shoots her a withering look. “Don’t you have a hunt to go to?” What’re you doing here?\nCastiel plucks at the sleeves of Sam’s old shirt, frowning faintly. Pamela found me loitering upstairs and told me to come here to see you.  “I was wondering if I could have my clothes back? Surely they weren’t too damaged.”\n“I’m sure they’re somewhere.”\n“That’s really unhelpful,” Castiel says mildly. “I have no emotional attachment to my belongings, but surely you wouldn’t have been so crass as to get rid of them without asking me first.”\n“They have to be somewhere in the room, right? We can look for them later, quit your whining.” Dean moves away to deal with a table order, and is surprised to find that he can multitask now. Castiel’s right there, but his mind’s also quieter – maybe it’s a proximity thing. Dean makes the drinks while brushing over Castiel’s thoughts, pulling the very recent memory of Pamela gleefully accosting Castiel outside Dean’s room. Man, she’s gonna get me for that.\nDean can feel – literally, thanks to the bond – Castiel look at him. She only said that she was sorry for not offering to bond with me before you did. She sounded disappointed, though I don’t see why she’d want such a burden.\n\n\nShe was teasing.\n\n\n\n\nHow do you know? You’re not the psychic, she is.\n\n\nCall it human intuition. “Hey.” Dean stops in front of Castiel. “Why do you smell like apricots? Did you use Sam’s shower gel?”\nCastiel’s thoughts go cool. “I find it very pleasing, Dean. There was little else in your bathroom that wasn’t riddled with synthetic chemicals.”\n“Oh great, you’re one of those.” Dean snorts, and then double-takes at the looks the pair of ladies are giving him. “What?” He’s got customers to handle. Man, it’s so much easier to do stuff when you’re here. When you were asleep it was fine, but when you wake up I lose focus.\nAn apology flickers across the link. That happens when you hold on to the bond tightly. Through no fault of yourself, of course, as you have no experience in such things. Calm trickles into Dean’s mind like soft rain, a special delivery from Castiel. It’s kinda cool.\n“Dammit,” Jo mutters. “I have to go soon.”\n“Oh, do you think you could do me a favor?” Castiel asks. “I’d like to get a nicer ring for Dean. We were quite hasty and I won’t be content until I fix that. Could help me get something better? I can pay you back.” Jody makes a choking sound.\nDean starts to laugh, and then stops. His eyes drop to Castiel’s hand, where the ring – Dean’s ring – gleams on Castiel’s ring finger. He quickly rewinds the last couple of minutes and his gaze snaps up to Jody’s face – he can practically see the gears turning in her head. Dean calmly puts down the glassware he’d been holding.\n“Oh my god.” Jody clasps a hand to her chest, frighteningly dewy-eyed. “Oh, I see.”\n“Yeah.” Jo raises her eyebrows at Dean. “How about that, Dean?”\nCastiel stiffens in alarm. What did I do? What? Dean, what is it? Thoughts of bullets and knives rush through his mind.\nDean rubs a hand over his face. When he lowers it, three pairs of eyes are staring at him expectantly.\nHe feels a little lightheaded, but it makes perfect sense to just say, “Yeah. We’re kind of… not really comfortable being open about it yet? It’s still so new, you know?” Jody actually nods in enthusiastic understanding, while Jo looks like she’s about to fall off her stool. “And there’s a lots of other stuff to deal with, it’s complicated.”\n“Oh, I completely understand,” Jody says. “Mum’s the word. Does Bobby…?”\n“Yeah, he was one of the witnesses,” Dean says. “But we want to keep it in the house, you know what I’m saying?”\n“Of course, yes, definitely,” Jody says way too quickly. She grabs a handful of nuts to put into Castiel’s palms, and then squeezes his hands. “Congratulations.”\n“Uh.” Castiel’s eyes dart towards Dean in bewilderment. “Thank you?”\nJody leans in to not-at-all whisper softly, “Make sure he treats you right, okay? If he gets up to anything funny, you just run to Ellen.”\n“I will take that advice under consideration.”\n“I’ll be happy to help you, Cas,” Jo says cheerfully. She reaches around Jody to pat Castiel on the shoulder, and then shoots Dean a sly look. “I’ll scout a little when I’m out there, then when I get back we’ll go ring shopping, yes?”\n\n\n\n\n\n\nBack in the garrison, Castiel had had few chances to interact with humans as peers. Humans were to be dealt with deftly, and by those with the skill for it. At the time, Castiel harbored the wicked thought that there might’ve not been much worth to that rule, seeing as it was one of Zachariah’s favorites. That said, Castiel’s had plenty of opportunities to mingle with humans since, and those encounters rarely turned out well.\nThe fact that Dean’s only mildly annoyed with Castiel at the moment is a huge improvement.\n“But,” Castiel says to Dean’s tense back, “Why would she have made the assumption that we are romantically linked simply due to a single ring I am wearing?”\n“You were talking ‘bout weird stuff,” Dean replies shiftily. “About using my shower and your clothes—”\n“But I was taking your lead,” Castiel points out. “You brought it up, so it had to be an appropriate topic.”\n“Just…” Dean makes an aimless, unhelpful gesture. It’s probably meant to convey displeasure. “Finish up so we can get out of here.”\nThey’ve closed the bar for the night. The others have gone off, leaving Dean to clear up the chairs and Castiel to wipe down the tables. Castiel had offered, actually, and though the task is menial, it’s nice to be able to use his body after a long, pleasant hibernation. He’d focused his energies on healing his human-shaped body first for convenience’s sake, and so far everything appears to be in working order.\n“I didn’t know she wasn’t in on it at first,” Castiel confesses. “I’m referring to Sheriff Mills. I was mindful of what I was saying because there were others around, but I didn’t know about her, specifically, until you started wailing.”\n“What.” Dean whips around to face him. “How is that… You’re in my head! Literally! You have first class VIP all-access, how did you not know?”\n“I don’t read your mind, Dean.”\n“What?”\n“I suppose that’s incorrect,” Castiel says thoughtfully. “I hear your emotions. But I don’t read the details of your thoughts unless you tell me to. You have a life that is irrelevant to mine, and as long as the bond is clear of any sign of betrayal, I am not interested in what you’re thinking about.” Indignation flares across the bond. “It’s nothing personal, Dean.”\n“Then what the hell—” Dean closes his mouth. Is this?\n“That’s more of a conversation,” Castiel says. “Messages that we actively send to each other. I don’t go searching for anything deeper than that. Dean, you can tell when I read your mind, that’s an inherent part of the trust mechanism. Like this.”\nCastiel sends himself out, slipping through the bond to soothe mental fingers over the surface of Dean’s mind. Annoyance and stubbornness cast a rusty scent.\nDean jumps at the psychic touch, eyes glazing over. “I figured that was you.” A blink, and then he’s back to scowling at Castiel. “What, you mean the rest of the time you’re not listening in at all?”\n“I thought you’d like that, Dean.” Castiel’s confused, and sifts through the events of the evening. “I made an error with your friend, I apologize for that. I do know that there is risk to my staying here.”\n“No, she’s…” Dean sends over an image of Sheriff Jody Mills, friend of Bobby, not a hunter but trusted. Dean thinks well of her, and she has come through for him and the Roadhouse more than once. “She’s okay. She won’t say anything.”\n“What I don’t understand is what you’re worried she might say,” Castiel says thoughtfully. “I wasn’t so careless as to tell her I’m not human.”\nDean snorts. “A bat with broken sonar could tell you’re not human.”\n“Is it the thought of her thinking you’re married that has you so unnerved?” Castiel knows that his aim is true when Dean straightens up sharply. “But you know its value is in honesty, not emotion. You were better at parsing that than anyone else – not your brother, not Ellen, not anyone. I don’t see why any of that should discomfort you.”\nCastiel jumps in surprise when Dean deliberately touches his mind. He moves with purpose, and Castiel follows Dean’s search through his more recent memories.\nDean says, “You really do mean whatever you say.”\n“Why wouldn’t I?”\n“If you haven’t noticed,” Dean says wryly, “Humans lie. And exaggerate.”\n“So do I,” Castiel says proudly. “I apply sarcasm.”\n“Okay, I’ll give you that.” Dean shakes his head. Castiel feels, oddly enough, as though he has passed a test. “So… you’re mobile now, huh. We could give you more stuff to do around here.”\n“I would welcome it, but should warn you that I have limited experience with human technology.”\nDean doesn’t find that discouraging. In fact it has quite the opposite effect, and Dean’s immediately pulling out his cellphone to show Castiel what it does. Castiel knows what they are but has limited experience with them, and is thus swept up in an impromptu lesson right there on how to make calls and send messages and take a photograph.\n“One for the road, yeah?” Dean holds up his phone, snapping a picture. He turns it around and there they are on the screen, Castiel and Dean sitting on a table in an empty bar.\nCastiel is a little surprise how mundane they look. As if they’re just two individuals enjoying each other’s company.\n“We should get back, still-healing firebird creatures need their beddie-bye time.” Dean’s far more awake now than he’d been earlier, though, humming with restless energy. “Maybe we can start you in laundry. It’d be a huge help, there’s just all these cases popping up, an extra pair of hands would be really good right about now.”\nCastiel follows him back to the main building, listening to him rattle and mumble all the way. Dean’s emotions flare bright and warm, like sunlight in the cold, empty space. Dean doesn’t even know he’s doing it, doesn’t realize that his mind curls open like a flower, offering casual kindness and inviting Castiel in. It must be innate to who he is.\nHow to explain such a thing to him? Dean has no training. It’s up to Castiel to pull away, which he does, forcing the bond to stretch thin and pushing stronger walls up. The bond quivers, resisting the unnatural manipulation, but Castiel stays firm. “You can work out the details tomorrow, Dean. To sleep with you.”\n\n\n\n\n\n\nDean figures that Castiel’s an okay roommate. Sure, Dean’s only ever lived with Sam, but he’s heard things, like Jo and Pamela’s epic clashes and Rufus’ refusal to ever crash at Bobby’s again under pain of death. So far Castiel has kept to his promise of destroying all the by-products of his cocoon time, and has not made any attempt to steal any of Dean’s stuff.\nWhat Castiel is, is clean and unobtrusive. He flits in and out of the place, leaving little trace wherever he goes and making sure everything is exactly where he left it. If it weren’t for the low-grade buzzing at the back of his head, Dean would have thought Castiel spends almost every waking moment hiding out in Sam’s room.\nDean tries to get Castiel into laundry duty, but it doesn’t take. Dean talks him through why sorting colors is important, when to use fabric softener and how blood stains are to be dealt with. Castiel listens and nods at all the important parts, but when Dean pokes into his head he comes up against a wall of disdain.\n“Poker face me more, why don’t you!” Dean yanks the laundry basket from Castiel’s hands. “You’re an accident waiting to happen.”\n“I wouldn’t make an error on purpose,” Castiel protests. “Instructions are easy to follow.”\n“Anyone who thinks clothes are unimportant doesn’t belong here.” Dean drags Castiel away. “We’ll get you something else.”\nIn the end, Castiel lands with Pamela. It happens by accident, when Jo and Isaac come back from their hunt with Dragon burns – from actual Dragons, what the hell – and somewhere in the middle of Pamela’s arguing with Bobby and Isaac’s breathless gasps from a bed while Jo holds his hand, Castiel shows up. He studies Isaac’s arm for a moment and says, “I can fix this.”\nWhich he can. Castiel grabs some leaves, boils some water and does some chanting, but the real secret (which Dean knows because he can read Castiel’s mind) is the two drops of his blood that Castiel puts into the spell bowl.\nI’d prefer if you not reveal that to anyone, Castiel tells Dean. There are parties that would be particular about owning the source, if you understand my meaning. \nThere are other perks of having him around, too, though those trickle through bit by bit, and usually when Dean least expects them.\nSuch as the morning after an epic drinking binge with Caleb and his hunting buddies. Dean’s in the kitchen, nursing a cup of OJ through his hangover and trying not to hate the world when Castiel comes stomping in, chanting, ice ice ice ice ah here we go in his head.\n“Ugh.” Dean glares at the back of Castiel’s neck. “What do you even need ice for?”\nCastiel opens the fridge without looking at him. “I eat it.” The ice tray is brought over to the counter top, where Castiel dumps about half its contents into a bowl. The rattling of the cubes is annoyingly loud. “Ice is considered an indulgence, even if water is all the nutrition I really need.”\n“And demons,” Dean mutters.\n“And you’re a human being who eats herbivores that don’t do you any harm so how about we not comment on each other’s dietary needs?” Castiel returns the refilled tray to the fridge and then turns to Dean. “You are uncomfortable.”\nDean squints at him. “What?”\n“You are radiating discomfort.” Castiel tilts his head curiously. “Allow me.” He steps forward, pressing a request for permission through the bond. Dean grumbles but stays still – mostly out of curiosity – while Castiel presses two fingers to his forehead.\nThe headache disappears. “Whoa.” Dean opens his eyes wide, startled at how the spots of light have faded away, leaving behind perfect technicolor vision. “Whoa, that’s like… magic.”\nCastiel doesn’t smile, but pleasure rolls through the bond. “Glad to help. I shall excuse myself now.”\n“Can you do that if I have…” Dean trails off, trying to find a less gross way to describe the aftermath of Mexican food. Then he realizes he doesn’t have to, and just shoves the thought at Castiel, who makes the most hilarious, scandalized face.\n“I think in that case I’d leave you to your suffering,” Castiel says. “As a lesson.”\n“You could’ve just done that ten seconds ago,” Dean points out. “Hangover’s one of nature’s basic lessons.”\n“Oh.” Castiel consider this. “Yes, you’re right. Thank you for pointing that out. The next time you’re paying the price for your drunken escapades, I won’t offer my services.”\nDean snickers. “Heh, services. Never mind, go… enjoy your ice. But thanks for the…” He waves his finger in the air beside his temple. “That’s nifty.”\nMore mundane perks tend to involve Castiel being a goddamned creeper (to everyone except Dean, who can hear him coming). Like when Dean’s in a discussion with Ellen and Ash about Roadhouse supplies, and Castiel shows up out of freaking nowhere with a cup coffee, leaves it on the flat surface nearest to Dean’s hand, and then creeps out.\n“Perks of being married,” Dean says. “You should try it some time.”\nAsh laughs and Ellen calls him an ass, but Dean doesn’t mind. Cas says that he only does the random coffee and snack runs because he gets annoyed when Dean won’t stop thinking about it, and who’s Dean to stop him? Another bonus of the psychic link is that Cas knows exactly how Dean likes his coffee.\nYeah, Cas is an okay roommate.\n\n\n\n\n\n\nIt takes a little longer than expected because of events beyond Castiel’s control, but he eventually manages to get a better ring for Dean. Silver, because the ring Dean gave Castiel was also silver, and decorated with a pattern of feather-like leaves and sunbursts.\n“Okay, wrap that one up,” Sam says once Castiel confirms that is his choice.\nThey’re in a store not that far away from the Roadhouse, Sam and Jo acting as Castiel’s caretakers for the day. Sam coming along had been Jo’s idea, and Castiel had understood why when they’d started going through the choices and Sam had provided helpful commentary on what Dean wouldn’t be embarrassed to be seen wearing.\nCastiel’s surprised by how important that is. A ring is just an object, but it’s also an affirmation of an agreement that has been coming along stunningly well. Castiel’s other body is well on its way to healing, his wings have finally sprouted new skin, and the only real price to pay is to put up with Dean’s running mental commentary on bad soap operas he tells people he doesn’t watch.\nJo pays for the ring, Castiel promising to give her clips of his talons in return, as they are notoriously sharp and can be used as weapons. Sam is enthralled by this, and insists that they have a meal together so they can talk more.\n“Have you shown Dean your true form?” Sam asks. “Or is that really intimate?”\n“Not particularly intimate, just inconvenient.” Castiel doesn’t argue when Jo pushes a tall glass of something fruity at him. “I don’t see why he would want to, though?”\n“Uh, because it’s interesting?” Sam is an inquisitive one. It’s fascinating to note the similarities and differences between him and Dean, which are easy to pick out the more Sam consumes Castiel’s answers on everything from the state of the marriage bond to Castiel’s healing process to Castiel’s adaptability to living in the Roadhouse.\n“I wonder sometimes how the Roadhouse is able to function,” Castiel admits. It’s a far more comfortable place than others Castiel’s lived in his lifetime, and Castiel admits to enjoying sitting on the windowsill of his room for hours at the time, but there’s more to a successful community than that. “There is so little discipline in your everyday lives.”\n“I think what you mean is that it’s not discipline you’re used to,” Jo says thoughtfully. “Correct me if I’m wrong, but you used to live in a hive mind, right? Shared thought and uniformity?”\n“That’s right,” Sam agrees. “There’s more than that kind of family. This is what happens to work for us.”\n“You’re not part of the Roadhouse anymore, though,” Castiel says.\n“Not physically, no, but I still am where it counts.” Sam taps his chest, over where his heart would be. “Does that make sense to you?”\n“I suppose,” Castiel says, though it doesn’t really.\nAha, lying to your brother-in-law!  Dean crows in Castiel’s mind. Two points from Slytherin. \nCastiel resists the urge to roll his eyes. You do know that whenever you make a reference like that I have to go into your mind to find out what it’s referring to, right? \n\n\n You learn something new, and I don’t need to do anything? Seems like a win-win to me.\n\n\n“You’re talking to Dean when you do that, aren’t you?” Sam can be really excitable, Castiel thinks. Through the bond, he hears Dean’s agreement. “How far’s the range?”\n“I don’t know, there’s been no cause to test it.”\n“One of these days,” Sam declares passionately. “We should try it out.”\nSam has commitments at the institution he teaches at so they can’t linger too long. They return to the Roadhouse together, and Sam stays just long enough so that Dean can be given his new ring. Jo jokes about how they’d wanted to make a big production and Castiel has a moment of alarm because it hadn’t even crossed his mind to make a production out of it and what if Dean wanted that?\n“Chill, Cas.” Dean opens out his hand, and Castiel gives him the little box. Castiel watches Dean take the ring out, study it for a moment, and then switch it with the childish one around his neck.\nCastiel relaxes. Dean’s approval is clear in how he allows the amulet and its new companion to fall outside his shirt, comfortable with letting others see it. Castiel’s pleasure must be audible through the bond, for Dean smirks at him. “Does this mean we need to renew our vows?”\n“If it would make your conscience feel better,” Castiel replies.\nSam whips out his cellphone. “Stay right there.” Dean starts to duck, but Castiel and Jo flank him neatly to grab a hold of either arm, and Sam gets his desired shot. “Hah! Thanks, that’s perfect.”\n“Wow, I feel…” Dean shoves Castiel away, though he doesn’t put much effort into it. “Vaguely disturbed that you’re ganging up with them.”\n“Yeah,” Sam says with a grin, “You might want to watch out for that.”\n\n\n\n\n\n\nDean’s freaked out enough when Cas discovers the internet, but that just gets worse when he learns there are only two things Cas is interested in using Pamela’s laptop for: searching for pictures of old, dead things, and emailing Sam. He’s emailing Sam, Jesus Christ.\n“What the hell do you guys talk about?” Dean demands.\n“Yesterday I told Sam about Madison’s unexpected return to the Roadhouse, almost two weeks ahead of schedule,” Cas tells him reasonably. “As she is his friend, I anticipated that he’d to want to know that she’s been having waking nightmares and that we were able to give her something for it. Next time, I expect I will tell Sam that you have voiced concerned about our communication, and ask for his advice on how to proceed.”\nDean struggles with that for a while. “Fine, whatever.”\n“Don’t be jealous, Dean. You are also interesting.”\n“That’s not what I meant!”\n“I was very impressed with how you dealt with those civilians Jody brought in yesterday,” Cas continues earnestly. “I have no patience or skill for calming others from such horrors, and have to admit that although I initially thought that there would be nothing of value from observing from your simple ways, I was wrong.”\nDean clasps Cas’ shoulder solemnly. “Never ever try to praise anyone. You suck at it.”\nIt’s not like Dean minds Sam having some influence on Cas. Anything that makes him less of a weirdo is all right in Dean’s book, though even he’s not expecting, a couple of days later, to come into Cas’ room and find the guy doing honest-to-goodness push-ups on the floor.\n“What…” Dean’s eyebrows go way, way up. “What are you doing?”\n“What does it look like I’m doing?” Castiel isn’t even breathless, arms working smoothly as he moves up and down. Dean realizes he’s never seen non-decrepit Cas without his shirt – he’s bony and angular but solid, and there’s a line of sweat that runs down the dip of his spine. “Sam recommended some routines that may be beneficial for the human body during my physical recovery.”\n“That’s ‘cause Sam’s an exercise freak.” A glance around the room has Dean noticing a mat rolled up next to the pile of neatly-folded (formerly Sam’s) clothes. “He got you doing yoga, too?”\nCas pauses in the up position, and turns his head to Dean. “I think I might have been around when they invented yoga.”\n“You mean you’re older than dirt?”\n“Certain types of dirt, probably, yes.” Cas returns to his exercise, amusement casting a warm glow over his thoughts. “I know you didn’t mean that as a proper question, but I find that I don’t care.”\n“A harpy who does push-ups, now I’ve seen everything.”\n“I’m a Garuda, Dean.”\n“Names evolve all the time,” Dean points out. “You’re a mythological creature that’s older than dirt and I’ll bet you’ve been given a ton of other names by humans that’ve seen you. Wings and beastly body and a human-ish face? Definitely a harpy. Or related to real harpies. I’ve never seen one before but they’re probably real, right?”\nCas slowly moves into a resting position, sitting back on his haunches. Dean has a moment of: whoa, nipples, before being distracted by the way Cas’ mind buzzes in confusion. Whenever the guy doesn’t get something his thoughts become a whirlpool, swirling around in all sorts interesting ways as he tries to make sense of what he can’t understand.\nDean may have noticed that because he’d purposely made it happen. Once or twice. Or more, maybe.\n“I’m trying to understand the value of this conversation,” Cas says slowly.\n“There isn’t any,” Dean says. “Jo’s gone again so I’ve got to take the bar tonight. You’re joining me.”\n“Why does your having work to do mean that I have to join you?”\n“Because that’s a better use of your time, and because no amount of push-ups will help your skinny ass.”\nCas does a neat little forward-roll that has him landing on his feet, and Dean is not at all impressed. “Not everyone can have your body, Dean.”\nDean blinks. “What?\n“Your posturing is hardly subtle.” Cas pats down his arms and then sends a thrum of sympathy through the bond. “Do you believe you have something to prove? Are you compensating for a perceived flaw?”\n“Oh, yeah.” Dean pushes the door open. “You are so on bar duty tonight.”\n\n\n\n\n\n\nIt’s not that Castiel has to earn his keep in the Roadhouse, Dean’s been clear about that. Still, Castiel’s content to do what little he can helping Pamela because it eases his conscience, for there’s no forgetting the place he’s taken for sanctuary or the people who live in it. (But when Castiel sees for himself the damage they take, it’s a reminder of how the world works.)\nCastiel’s working at the bar makes very little logical sense.\n“You’re taking point.” Dean’s wearing his working clothes, as he calls them, though Castiel can’t see the difference from his usual. Dean’s also put on perfume. “It’s called aftershave, Cas, geez.”\n“I’m sure that distinction is important.” Castiel follows Dean into the space behind the bar. They’ve not opened yet but Castiel doubts there is enough time for a crash course. He looks around, trying to make sense of the overwhelming number of bottles and pieces of glasses and – oh.\nDean’s presence pushes into Castiel’s mind, dropping names and context and uses to all the things Castiel sees. Squeezers, sealers, shakers, snifters, shot glasses – they’re all there, some ready to use, some needing a wipe down, some needing to be checked.\n“Right.” Castiel opens a drawer and pulls out a clean wiping cloth. “How do you know how to do that, Dean?”\n“Beats me.” Dean frowns a little in concentration and Castiel feels a slight tug in one wrist, showing him the strength and angle he is to use in wiping down the mixer. “Your mind’s wide open, it’s pretty easy. You might want to watch that, though, anyone could just come barging in.”\nCastiel tries not to bristle; he doesn’t need to read Dean’s mind to know he finds enjoyment in provoking him. “I’m trying to be accommodating, Dean. You have no experience in these kinds of bonds, I’m making it as painless for you as possible.”\n“Yeah?” Dean grins as he checks the bottles lining the shelf. “Seems to me you overestimated my need for kiddie wheels.”\n“When I said painless…” Castiel sends a mental flick at Dean.\n“Ow!” Dean spins around and glares. “Do that again and I’m going to figure out how to do it back. Yeah! I see you worrying all up over there, just do what you’re supposed to and try not to break anything.”\nCastiel shrugs. If he did break anything it’d be Dean’s fault, since he’s the one steering.\nThat said, it’s easy. When the bar opens and customers arrive, Castiel needs only be a vessel, guided gently to and fro by Dean’s instructions. Dean himself stays at the forefront, talking to customers and showing off his charm, while Castiel maneuvers around him in the narrow space, effectively acting as Dean’s extra pair of hands.\nEllen drops by to check up on them. “You’re really good that that,” she says after watching for a while. “Really good.”\n“It’s all Dean.” Castiel passes a bottle to Dean, who takes it without turning his head. “You could say it’s a mild form of puppetry.”\nEllen seems impressed, and then uncomfortable. Castiel makes way for Dean to approach her, moving out to the tables to clear up empty glasses and take payment from a customer. Castiel can still hear Dean and Ellen’s hushed conversation, though.\n“Isn’t that really intimate?” Ellen whispers to Dean. “There’s literally no way to get closer than that.”\nDean, to Castiel’s surprise, is not perturbed by this. “It would be intimate if it was you and me. Or me and Jo, or me and Sam… which would also be creepy as hell so let’s not think about that at all. We have a relationship, so an extra level of mind whammy would make the whole thing way complicated and messy. Me and Cas? Have no relationship whatsoever, so it’s pretty chill.” Ain’t that right, Cas?\nCastiel feels a tingle up his forearm. He returns to the bar and dutifully raises his arm into a high-five position, so that Dean may slap his palm.\n“That is quite the party trick,” Ellen says. “Could you use that for card sharping?”\n“That would be dishonest,” Castiel says before Dean can answer. “I do have some morals.”\nDean laughs, and then mimes a noose around his neck. “That’s my ball and chain in action right there.” Castiel sends an inquiry at Dean, and receives: It’s a metaphor. For marriage, you know? That makes you the wife.  Castiel nods with understanding, which Dean finds hilarious.\n“Did you really just call him a ball-and-chain?” Jody slides onto the stool next to Ellen’s with a laugh, nodding an acknowledgement at Castiel. “You might want to watch yourself.”\nCastiel starts at the sudden flush of emotions that pass through Dean. It’s a blast of hyperawareness and panic, and the rush to do something to cover said panic. That’s followed by an equally abrupt (Fuck it) plummet of a decision.\nDean leans forward, hands braced on the bar top, and says to Jody, “Cas doesn’t have any problems with balls and chains, if you catch my drift.”\nCastiel thinks that’s another metaphor until Dean passes him a helpful explanatory image.\n“Dean!” Castiel yelps. “Not in front of the patrons!”\nWhich is apparently the correct thing to say because Jody all but doubles over in laughter, and Dean’s mind hums with approval.\nCastiel can roll with this. It’s a mere change of strategy, and far more agreeable than Dean having to deal with discomfort. Dean’s a friendly person, warm and jovial, and it’s only right he be able to continue to be so despite having a burden temporarily attached to his person. Ellen has no judgmental comment either way, simply pushing her empty glass towards Castiel with a nod for a refill.\nSo this is how it’s going to be, is it?  Castiel asks. \nWell, she already thinks it’s possible, so why not? I’m totally a catch, aren’t I a catch, Cas? Dean grins at him.\n“Oh, I see!” Castiel exclaims in surprise. “You were lonely, that’s why you asked me to join you down here tonight. You need only have asked, Dean.”\nDean narrows his eyes. \n“Oh, that’s great, you guys,” Jody says happily. “If you can’t be comfortable being yourselves here, where can you be?”\n“It was Cas’ idea, actually,” Dean says, which such fake gravity as to be laughable. “He’s the new guy, after all, he wasn’t very comfortable being open and… of course I had to tag along with what he wanted.”\nCastiel gawks at Dean in disbelief. Excuse me.\n“Like I give a shit what anyone thinks about me,” Dean continues insipidly. “But I gotta take care of this guy.”\nCastiel stiffly hands Ellen her filled-up glass.\nHe can still hear Dean’s mind trilling loudly with obnoxious excitement. Castiel has no choice, really, and turns to to address Jody: “Do you really believe that? Just look – he refuses to wear my ring. He wears it around his neck instead. It hurts my feelings.” Castiel turns so that he can fully appreciate Dean’s shocked face, and then raises his own hand in demonstration. “I’m happy to wear mine.”\n“Oh dear,” Jody says. Ellen takes a slow sip of her drink.\n“You did not!” Dean laughs. His thoughts are alight with the effect of adrenaline. “That’s a low blow.”\n“I don’t understand why you’re only like this in public,” Castiel says. “Otherwise, you’re an excellent spouse.”\n“You should really…” Dean trails off. “I’m an excellent spouse?”\n“Of course you are. You are immeasurable, and I’m glad that it was you who saved my life.”\nThey’ve seemed to have amassed a small audience over the past few minutes. Castiel tenses up when he notices this – attention here of all places is bad – but that’s abruptly soothed over by the purring assurance Dean sends to him. Most of these guys are friends, Dean tells him, and Ellen is right there, ready to kick anyone’s ass if things get out of hand and besides, no one seems to think there’s anything weird about Castiel at all.\nIt’s just another night,  Dean says. This is nothing, you should see how Jo plays the crowd when she’s in the mood. \nThen this could be good for the night’s financial profits. Dean doesn’t disagree, and is riding up his adrenaline into high spirits.\n“He saved your life?” says a customer who looks like she will order another drink soon. “Damn it, Dean, when the hell did this happen?”\nCastiel tries on a friendly smile. “He proposed after I came out of medical care.”\nEllen confirms this with a somber, “That’s true.”\n“It was nothing.” Dean grins, basking under the attention. He knows most of these people – a hefty percentage of them regulars – and confidence makes him radiant, and as he leans towards his rapt congregation, new yarns spin wildly in his head. “Knew something was special ‘bout Cas the moment I met him.”\n“So he says,” Castiel says.\n“You gotta wear your ring, man,” says a customer who’s wearing a trucker hat not unlike Bobby’s. “There’s some things that’re sacred.”\n“Hey, it’s near his heart!” another protests. “That counts for something.\"\nUnder the sudden din that’s enveloped the bar, Ellen mutters a quiet, “I’m not entirely clear on what just happened,” that only Castiel’s able to catch. She raises her glass at him. “But I guess it’s your problem to deal with. Well, yours and your excellent spouse’s.”\n“I wasn’t being facetious,” Castiel says.\nEllen laughs helplessly. “I know.”\n\n\n\n\n\n\n“That was amazing,” Dean says, leaning heavily against Cas, “I’ve never had that many chicks wanna fondle me at once. Sweet mother of Angelina Jolie I was on fire.”\nCas has the best prissy face in the world, his head roaring a loud Do Not Care alongside calculations of what Dean suspects are the night’s tips. Dean’s arm is draped over Cas’ shoulder as they find their way back to their rooms, and Dean stares at the side of Cas’ head, amazed at how he can literally follow Cas’ thought process through considering and then discarding the temptation to drop Dean’s ass to the floor.\nDean’s never wondered what it would be like to have someone else inside his head – Cas has been keeping a minimum safe distance until tonight, the scaredy-cat – but it’s not so bad. Psychics poke around your skull like goddamn spies so you can never tell they’re there until they tell you what they’ve taken, but Cas moves around like a – like a submarine, letting out little pings wherever he goes and letting Dean see what he sees.\n“Perhaps I should leave you to it,” Cas says dryly. “You’re comparing me to a submersible vehicle.”\n“I’m only a little bit drunk,” Dean protests.\n“Only because I’m holding you up,” Cas replies. It’s true, though, Cas’ presence in Dean’s head is a ballast keeping Dean’s own mild – very very mild, really – drunkenness at bay. “You should have turned them down when they started offering to buy you drinks. It might not have been polite, but look at you now.”\n“I look fine. Don’t tell me you wouldn’t want to get into these pants. I want to get into these pants and I’m wearing them. It’s just so sad.” Dean almost tips over in surprise when he realizes that they’ve arrived as his door. “They were all over me.”\n“You could have accepted.” Cas pulls Dean inside and dumps him on the couch. “I’m sure at least one of them would’ve welcomed your sexual advances.”\n“What in the what?” Dean squints up as Cas locks the door.\n“Sexual advances.” Cas has that stupidly solemn face that Dean would’ve normally found useless, so thank goodness he can poke directly into that head and know that Cas is just voicing what’s actually on his mind. “You’re human, I’m sure you have needs.”\n“That’s gross, man.” Dean makes a face. “I’m married.”\n“So?”\n“So…” Dean echoes slowly, “I don’t do that. I mean, it’s cool if you’re into that, but it’s not for me.”\nCas is uninterested, plucking at the collar of his shirt and making a face at the smell. “If you ever change your mind, you have my full permission to go ahead. I’m going to have a shower, you are going to sleep, and half the tips from tonight belong to me.”\nDean opens his mouth for a parting shot, but Cas has closed the bathroom door. Cas also draws out of Dean’s mind, allowing the night’s exhaustion and – ugh – headache to return.\nYou know what? \nInside the bathroom, Cas trips. Dean doesn’t understand what he’s saying, but he’s pretty sure those are curse words. Ancient curse words. Hey, Dean could learn them and annoy the hell out of Sam. Cas recovers with a prickly, What, Dean.\nWe should go for a drive. It’s not like you’ve got anything on your schedule. \nWhy would I want to do that, Dean. \nBecause. Because Dean’s fixed everything that can be fixed and cleaned all his gear and Bobby threw him out of the phone bank room for being ‘snippy’ with an FBI agent.\nIt’s cabin fever, that’s what it is. Cas doesn’t have a clue what that feels like until Dean shoves the feeling at him. Based on the few memories of his Dean’s rifled through (what, he has permission), Cas has spent years at a time hiding in holes in the ground, so he has a poor understanding of that restless itch that keeps building and building until you just want to claw all your skin off to get at it.\nThere’s no need to be melodramatic about it, Dean. We can go somewhere, if you like. \nDon’t feel like you have to do me any favors, now. \nCas’ cranky exhaustion is understandable – the little nerd must’ve used up all his socializing quota in one night – but Dean still can’t help feeling a little offended by his lack of interest. Cas did well tonight but he still thinks he’s above all these wacky human shenanigans and is only enduring them for the sake of his safety, which is as good a lie as Dean’s ever heard. It’s hilarious how some people don’t know their own minds.\nDean snaps back awake – when’d he fall asleep – when Cas is back in his face, yammering, “What are you doing? Get up, brush your teeth, I can smell you from over here.”\n“I’m going!” Dean’s such a nice guy, he doesn’t even point out that before Cas came here, he’d barely if ever brushed his teeth at all. “You’re my wife, not my mom.”\n“Go!” Cas shoves Dean into the bathroom. Dean’s still smiling when he turns to the sink, enjoying the prickly feeling at the back of his neck that’s Cas’ glowering at him through the door.\n\n\n\n\n\n\n“Where are we going?”\n“I figured we’d save Sam the drive and go up to see him instead.”\n“Would he appreciate the surprise?”\n“Probably not, but who cares.”\nOne car, two people, two bags; Castiel can’t help feeling a little nervous at the prospect. It made sense to agree to it last night, with Dean’s anxiety and frustration bubbling over to cause his utterly appalling attention-seeking behavior in the bar. But now, under daylight and watching Dean whistling happily as he loads up the trunk, Castiel has reservations.\n“Why?” Dean’s fingers slide along the car’s roof slowly. “It’s been you and me in the Roadhouse, now it’s you and me in here.”\n“But we’ll be right next to each other,” Castiel points out.\n“I know.” Dean winks at him. “Don’t get any funny ideas.”\nThen there’s that, which is Dean making sport out of – out of something. It’s more bewildering than anything else Castiel’s experienced here, and the only saving grace is that Castiel figured out quickly how it’s to be managed.\n“Pardon me,” Castiel replies, “If anyone should be worried about the other’s amorous advances, it would be me. I have heard terrible tales of the libido of humans.”\n“Oh, hey now, having a libido ain’t a bad thing. Even you’ve got one. Somewhere.” Dean waves vaguely at him. “Under there.”\n“Under my two heads, six wings and tail?”\n“You know, one day you should show me that.” That statement is surprisingly honest, Dean’s gaze drifting off into the middle distance as he imagines such a thing. Castiel can’t help brushing over Dean’s mind, pulling the imaginary yet not-completely-wrong image that Dean has of his true form. “Sounds cool. Come on, get in the damn car already, we don’t have all day.”\n“I thought the point was we did have…” Castiel sighs when Dean enters the car. “Yes, of course.”\nDean’s ’67 Chevy Impala had originally been purchased by his father prior to marriage. For a number of years Dean and Sam were brought up with this car as their only home, their family drawn into the hunt as those things sometimes happen. Castiel doesn’t mean to learn all of this, but he does the moment he leans back in the seat, years of history seeping into Castiel’s skin.\nCastiel turns to Dean in surprise. “You never chose to hunt?”\n“What?” Dean revs the engine. “What hunt?”\n“Never mind.”\nNo, not never mind, you wanted to know something. Dean guides the car onto the main road and turns the radio on. What is it? Hit me.\n“I can feel the history of this car.” It’s clearly enchanted, though not on purpose. Human objects do that sometimes, drinking up little bits of soul from those who’ve touched them and ascribed value to their existence. “I don’t think she likes me very much.”\nDean’s pleasure glows through the bond. “You called her a she.”\n“She thinks she’s a she,” Castiel admits, trying not to show too much discomfort. Dean reads it anyway, smile widening further. “It’s only respectful that I refer to her as such. She has brought you and your brother comfort, and she has taken that into herself. The car remembers.”\n“She’s not haunted though, is she?” Castiel shakes his head, and Dean sighs in relief. “That’s good.”\n“A haunting would mean a foreign spirit entering her.” Castiel runs his fingers along the door, tasting old echoes of laughter, along with memories of two boys shoving at each other and a father standing guard.\nCastiel looks up at the side of Dean’s face. A careful touch to his mind reveals that Dean is enjoying the rushing wind and singing along to the radio, but from there his thoughts expand like spiderwebs into the significance of the lyrics, that time his brother made fun of him for knowing the lyrics, a movie he’d seen that uses the song, the last time he’d danced along to it during laundry day.\n“You place value on such things,” Castiel says.\n“Doesn’t everyone?” Dean’s relaxed already, elbow half-out the window as the car speeds along. “You wanna hang on to the good stuff. That’s, like… basic.”\n“But that’s shallow.”\n“What, you’re telling me that you’ve been on this planet for centuries and you haven’t figured that out?” Dean’s wide-eyed stare of disbelief would last longer if he didn’t have to watch the road. “What have you been doing, living in a cave?”\n“There’s nothing wrong with living in a cave,” Castiel replies tersely. “Stop devaluing me like that. Do I judge you for scratching your genitals in front of me? Or – or for deliberately talking about things I don’t understand, or making those awful—”\n“Relax, Cas.” Dean does this thing – Castiel is sure Dean doesn’t know how he’s doing it – easing into Castiel’s mind and turning his tension around that he can see it for what it is and let it go. “I’m just saying, even creatures got their own lives, got their own... whatever it is that you do for fun.”\n“You mean in between fleeing from hunters?”\n“You’re going to have to let that go.” Dean is not apologetic enough for Castiel’s liking. “I’m not in it for the brownie points and yeah, I’ve made some bad calls in my time, but I’m not going to feel sorry. What, you’ve never hurt anyone to protect someone you care about?”\n“That kind of thinking doesn’t end well.” Castiel thinks about Anna and Balthazar, wherever they are, and hopes that they’re faring better than him. Zachariah may be dead, Gabriel may be missing and who knows what Raphael is up to now, but it’s clear their time has passed. “We are scattered and few.”\n“It’s been that long since you last saw one of your own?” Dean’s genuinely surprised. “I mean, one who didn’t want to mess you up? That sucks.”\n“Not really. That’s why I’m still alive.”\n“But you didn’t want to be.” Dean gives him a pointed side-eye. “You wanted me to leave you in that prison cell.”\n“That’s… not relevant.” Castiel’s discomfited at being the focus of Dean’s scrutiny, but he cannot find the effort to kick Dean out of his head. He is getting complacent. “My initial decision to sequester myself was my own. I believed things were getting out of hand, and I chose to step away.”\n“That takes balls.” Dean’s thoughts turn ashen as he briefly recalls early disagreements between Sam and their father. He and Sam are still shadowed by the threads left hanging by their father’s unexpected death, though they try not to let it mar the rest of their lives. “Good on you for taking a stand.”\n“Could you have guessed?” Castiel asks. “When you found me, could you have guessed that I was under arrest because I’d refused to stand with Zachariah against your kind?”\n“That’s the strangest thing.” Dean shakes his head with a grin. “You don’t even know enough humans to make that kind of leap.”\n“I know my own kind,” Castiel replies. “I know what they’re capable of. Don’t – stop feeling sorry for me, Dean, I don’t hate myself. I hate the conditions of the world that we have to obey in order to survive. Us or you? What logic is that?”\n“Yeah, that’s… I try not to think too hard about it. It’s true though, I know some people who’ve got it tough like that.” Dean has a small, intimate smile on his face, while his mind radiates quiet pleasure. “You’re okay, Cas. Harpy or not.”\n“And you’re decent enough for a human. Most of the time.”\nA feeling of warmth and contentment fills the space between them. Then Dean clears his throat and says, “Now go watch the scenery.”\n\n\n\n\n\n\nIt’s a relief to get out from the Roadhouse.\nThere’s no chance of Dean getting confused between this and old times with Sam, because Cas isn’t like Sam at all. Cas doesn’t know how to debate about the best assets of Scarlett Johansson versus Natalie Portman, or see the point of playing any of Dean’s games, or even have the decency to fall asleep with his mouth open so that Dean can make fun when he drools.\nCas just sits there in his seat, quiet and observant. Scratch that, he was quiet and observant at the start, and then he’d pointed at a sign and said, what does that mean? So Dean had launched into an unrelated but highly interesting story about how he got his license (they’d still been living out of the Impala then) and Cas, having seen the opening for what it was, just took off.\nIt became a bazillion and one questions about everything, from why do you put your middle finger up like that to why do my shirts sometimes itch to why is it necessary for the men of your kind to wear underwear.  \nWhen they make it to a diner, Cas is still more interested in going Larry King on him than eating his fries.\n“So Ellen never officially adopted you?” Cas asks.\n“You’ve been living under a rock,” Dean says, “How the hell do you know what a guardian is? Or adoption, for that matter?”\n“I sometimes come up for air and education.” Cas tilts his head slightly which – holy shit, that was Cas making a joke. “It seems unnecessary dramatics to allow Ellen to adopt Sam, yet make the runaround to avoid letting her adopt you. What if you’d been caught? Then you’d have been truly separated from Sam and then where would you be?”\n“You already know I make stupid decisions, right?” Dean shrugs. “It was tough when Dad died. Don’t tell Ellen, okay? She probably knows already but… I kinda blamed Bill for what happened. He and Dad died together so we’ll never know what happened, but I just couldn’t buy that my father could go down like that. It’s just… it was just too impossible.”\n“But you’ve moved past that now,” Cas says. “Just look at you, and where you are.”\n“Solid praise comin’ from you.” Dean actually means that, and warmth echoes through the bond. “Now eat your goddamned fries.”\nCas drops his gaze to said fries. “I keep telling you, I don’t need—”\n“It’s not about need,” Dean groans. “It’s about having something just because you want to. Don’t tell me you’ve never felt like that?”\nCas’ brain hits a wall on that one. He tries to measure his experiences to Dean’s, though that really wouldn’t work. “Um.”\nDean shoves a fry into Cas’ mouth. “There. Chew.”\nCas goes a little cross-eyed as he tries to look at the fry. Then he brings it into his mouth, pink of his tongue flicking out briefly, and starts chewing. Dean watches Cas’ mouth without comment, waiting until his Adam’s apple bobs with the swallow.\n“It’s alright.” Cas’ face gives away nothing, but Dean reads loud and clear that Cas may not be very impressed, but he’s intrigued by the combination of salt and texture, and just curious enough to try a few more of Dean’s recommendations.\nThe best opportunity would be dessert, then. Dean waves their waitress – Jamie, her nametag says – over, and whaddya know, they have pie in the house.\n“One for me, and one for my…” Dean looks at Cas. He’s doing the poker face again, but inside he’s bracing himself with a No, Dean.\nJamie cautiously offers, “Date?”\n“Does this guy look like someone I’d date?” Dean grins up at her. “He’s my husband.”\nCas sighs.\n“What?” Dean’s a terrible human being for loving this. “I don’t look like I could be married? Lots of bad-ass people get married. I’m bad-ass and married. It’ll be a trend.”\n“She’s never going to believe that.” Cas says to the waitress, “I apologize, he’s always like this. One slice for him and none for me, please, it would be a waste.”\nJamie turns out to be awesome, because although she keeps to the letter of Cas’ request, the slice of heaven she brings back to their table is super-sized and then some. The epic scoop of ice-cream is deserving of freaking rock-climbing equipment. “Blessings upon this house,” he says.\n“It’s just pastry,” Cas mumbles, which makes Dean sputter.\n“Extra-large, for the newlyweds,” Jamie says. She’s definitely cute, smiling at both of them in turn. Seriously, Dean thought he was lucky with chicks before he got gay-not-married but this is just ridiculous. “I’m right, aren’t I? Congrats, you two.”\n“I would’ve done this ages ago,” Dean says once Jamie is gone. They’ve been given two forks, and he slides one to Cas. “Lots of perks ‘bout this married thing, people keep wanting to give you shit. Do you think we could get a discount at a motel? I bet we can.”\n“But then they’d give us a room with one bed.”\n“Oh yeah. Damn.” Dean hefts a helping of awesome into his mouth, cursing when it turns out he hadn’t waited long enough for the filling to cool. Cas makes the sound of the deeply exasperated and taps two fingers to Dean’s forehead. The burn immediately subsides and Dean swallows. “Thanks. I’ll watch the next one.”\n“Of course you will.”\n“And!” Dean scoops up another portion, blowing liberally this time, and offers it to Cas. “Don’t make that face at me, I know you’re curious.”\n“Not enough to make a spectacle of myself.” I realize you are an exhibitionist, Dean, but the best strategy is to stay unnoticeable. \n“This isn’t making a spectacle.” You, Cas, are the opposite of unnoticeable. It’s the weirdest stand-off ever – the bond makes it so that Dean can feel Cas waver, and Cas knows Dean can feel him waver. “This is being very appreciative of the lady who gave us this pie. You don’t want to hurt her feelings, do you?”\nCas opens his mouth. He doesn’t blink while Dean pushes the crumbly piece into his mouth, eyes on Dean as his lips close over it, then chewing thoughtfully.\n“Hey there, everything okay?” Jamie says, appearing at their table. “Do you guys want more coffee?”\n“I’m good.” Dean cants his head at Cas. “He wants a refill.”\n“You do know, Dean,” Cas says, in a deliberately cool way that makes Dean’s neck prickle, “If you wanted to hand-feed me you needed only ask. This whole farce was unnecessary.” He glances up at Jamie, who gives him a sympathetic look. “He’s a wonderful spouse but he’s so shy about telling me what he wants.”\nDean waits for Jamie to go off before he says, “I’m a bad influence on you, aren’t I?”\nCas effects a wide-eyed expression that passes for coy in his blank-face universe. “Of course not, Dean.” \n\n\n\n\n\n\nThe second day out from the Roadhouse, Dean takes Castiel to watch a movie. They arrive at another town after miles of Castiel questioning Dean’s choice in music and Dean being unable to define ‘awesome’ in any meaningful way, and Dean gets conniptions the moment he sees posters advertising a drive-in.\nCastiel is fully prepared to be skeptical of anything Dean sings praises of. Castiel has seen movies before, after all, and they’ve been sitting in a car for far too many hours so how can a combination of the two offer anything new? Hence it’s only all the more embarrassing when, after the movie’s over, Dean goes quiet and embarrassed and fetches a milkshake from the concession van for Castiel without a single complaint.\n“It’s just a movie, Cas,” Dean says again. “I mean. Mostly.”\n“Shut up.” Castiel accepts the peace-offering with as much dignity as he can muster. “You said that cartoons are funny—”\n“Most of the time! Most of the time cartoons are funny.”\n“—and you kept making tentacle jokes so I braced myself for a farce and that is not what happened and it’s all your fault.” Castiel shouldn’t be sad, he knows he shouldn’t be said, it’s mostly fiction – those poor children – but apparently logic has no place in this.\n“Sorry.”\nCastiel takes a long, reflective sip of his drink, watching Dean closely the entire time. A casual coast over Dean’s mind confirms that he’s as disconcerted by the fiction as Castiel is, though he bears it differently. The movie makes Dean think of Sam and how close they’d come to falling apart, though Dean feels bad for even briefly comparing that against the good fortune he’s had in life. Dean has so much to be thankful for, and he knows it.\nRegardless, he could have at least warned Castiel as soon as it became clear what the movie was about.\n“I dislike you,” Castiel says.\n“So nothing new, then?” Dean shoves at Castiel’s shoulder. “I’ll keep this a secret if you will?”\nCastiel considers this. “No, I think I shall use this as blackmail material the next time I see Sam.”\nDean tries to distract him with food, which is apparently a thing with him because Dean gets distracted by food and mistakenly assumes everyone else does as well. It’s easy to indulge him, though, following him to yet another food establishment and letting Dean order for him.\nIt’s a really good thing that Dean’s interesting, or Castiel would’ve started hibernating again.\n“Hey, my phone,” Dean says about halfway through their meal. He glances at the screen and gets up. “I’ll be right back.”\nCastiel puts down his knife and fork as soon as Dean is out of view. It takes him a moment to realize what’s off – Dean’s pulled away from Castiel’s mind, which must mean it’s likely to do with hunter matters.\n“Okay, just a small detour,” Dean says when he gets back to the table. “That was a – a friend, there’s a thing I’ve got to do, there’s nothing to worry about.”\nDefinitely hunter matters. “I didn’t ask if there’s anything to worry about.”\n“And so there isn’t.” Dean frowns at Castiel’s plate. “What did those potatoes ever do to you?”\nCastiel only relaxes when Dean opens his mind to him again, returning to their easy balance. They don’t talk as much through the bond, Dean preferring to use his mouth (dirty joke, retracted) where possible, but there’s bone-deep satisfaction in weaving close this way. Castiel hasn’t done any of his exercises, or checked his wings and other feet, or even had a moment’s peace, yet he is content. The bond must be doing its work and then some.\n“You’re so needy,” Dean teases.\nCastiel steals one of Dean’s sausages. “You cry at the movies.”\n“So do you!”\n“But I’m not human.”\n“You know,” Dean drawls, “You’re going to have to stop using that bullshit excuse for everything. You like human connection, you lying liar who lies.” He regards Castiel thoughtfully. “Is that a side-effect of your Obi-Wan Kenobi thing? I mean, becoming a hermit, since you’re usually mind-hived with your bros?”\nAs with all of Dean’s remarkable observations, Castiel has to take a moment to collect himself. “Don’t think you’re more important than you are.”\n“It’s true, though.” Dean pokes at Castiel’s nose with a straw. “You’re not meant to be alone, and yet you chose to be. That’s gotta fuck with your head.”\n“On occasion,” Castiel admits, “But the alternative is worse. You are… very different from what I’m used to, but there’s no burden in being bonded to you, no expectations for me to deliver. I am bonded, but free.”\n“So you’re saying I’m like junk food. Or candy.” Dean is amused, though. “Yeah, you look like a guy who hasn’t had enough candy in your life.”\n“And you, one who has had too much.”\nCastiel hadn’t even realized how good things were – and they are good – until he messes it up. When he looks back afterward, he’s surprised it took so long to happen, since he’s been married to Dean past yet another moon and Castiel can barely recall the last time he’d been in someone’s company that long without tragedy.\nIt happens later that night, after Dean’s insisted on driving to another town on his important detour and they’ve settled into a motel room. Castiel appreciates the utilitarian design of these rooms but is surprised to find that he has standards now; Dean’s rooms have advantages these rooms do not. (Dean finds this hilarious when Castiel shares this observation.)\nThey get a room with two beds as usual. Dean collapses into his almost immediately, leaving Castiel to set their things aside properly and turn off the lights.\nCastiel doesn’t need as much sleep now that his intense healing period is over, so he spends his time inspecting his wings and doing easy exercises on the floor, careful to not make any noise that would disturb Dean. There is merit to Sam’s recommendations – there is something almost meditational about putting the human body through its paces.\nIt’s the darkest hours of the morning when Dean stirs. It’s subtle at first, little more than a scrape at the back of Castiel’s mind. Then it slowly builds up, insistent as a growing heartbeat, as though wanting Castiel to notice it.\nIt’s similar to other times Castiel’s heard Dean’s craving for food or coffee. They’d be on opposite sides of the Roadhouse doing completely unrelated things, and then Castiel would feel a sliver of Dean’s yearning slip into his consciousness. It’d be ignorable at first, but slowly build up until Castiel would be left wondering why on Earth Dean couldn’t just stop whatever it is he’s doing to get the damn coffee that would make him stop being so unhappy.\nThis is sort of like that.\nMaybe it’s because they’re in close proximity now. Maybe it’s because Castiel’s only very recently started delving deeper into Dean’s mind, and that closeness has resulted in hypersensitivity to things he otherwise wouldn’t have noticed. Castiel definitely notices now: Dean is aroused.\nDean is aroused and frustrated. He’s dreaming something pleasant but unfulfilling, murmuring in his sleep and moving gently against the mattress. Castiel should ignore it as he does everything that’s none of his business, but when the minutes tick by, it becomes apparent that Dean’s discomfort will not go away by will alone.\nAnd, thanks to the current state of their marriage bond, Dean’s distress is Castiel’s distress.\n“Dean.” Castiel approaches Dean’s bed slowly. He resists the urge to scratch his arms; Dean’s frustration bleeds through like a disease. “Dean. Dean?”\n“Wh-what.” Dean flails, stuttering into awareness. He has his gun in his hand before his eyes are open, but he lowers it when he sees it’s Castiel. “Cas—what?” His arousal simmers, unfulfilled and searching.\n“I can help you.” Castiel touches Dean’s arm. His skin is warm under Castiel’s palm, and the touch isn’t displeasing at all. “You’re frustrated and it’s hurting you, I could—”\nDean’s mind slams up a wall. The force of it is almost physical, ramming into Castiel like a boulder to the face.\nCastiel hisses, clutching his head. “Dean, what—”\nSTAY OUT Dean screams across the bond, anger and shame whitening out Castiel’s vision. STAY OUT STAY OUT STAY OUT\n“I’m going!” Castiel yells over the pounding in his head. “I’m going, I’m sorry!”\nHe hasn’t attempted to fly since the day Dean let him go, but he does so now, tucking his human body in and fleeing the room. Castiel just needs to get away, get away, stay out, flying blind until his hearing and vision return.\n\n\n\n\n\n\nDay three doesn’t start out so well. Dean wakes up irritated, and that irritation only amps up to 11 when he remembers what happened.\nCastiel is not in the room. The intrusive little chicken shit is probably hiding somewhere quivering, because seriously, what the fuck. Dean feels gross all over, which is a terrible feeling to have first thing in the morning.\nThere’s a chicken sandwich on the bedside table, still warm and smelling of the grill. There’s also a tall cup of coffee. Dean sits up to glare at them, and then notices the small note taped to the cup: This is for you. FYI, I did not steal money from your wallet, I got them on my own.\n“Sure you did.” Dean eats the sandwich, because there’s no point wasting perfectly good food.\nThe asswipe that is Cas doesn’t show his stupid mug the whole morning, not even after Dean’s brushed his teeth and gotten dressed and finished up the coffee. Dean could find him, of course, but Cas really should just stew in his own juices for a while.\nDid Cas really offer to have sex with him last night? Jesus.\nI’m checking out and going to the car. Get your shit and be there in fifteen. \nCas is at the Impala when Dean gets there, duffel over his shoulder and the epic blank face out in full force. He doesn’t so much as peek into Dean’s head, seemingly content to stay in his own, and just gets into the car when Dean grunts at him.\nWell, two can play at that game.\nFor the first hour or so, there’s just silence. It’s fine, it’s great, the radio fills the space with much more interesting sounds than Cas could ever come up with – which is a line of thought that unfortunately comes back to the fact that Cas offered to have sex with him, which Dean should not be thinking about.\nIt doesn’t matter that Cas won’t hear him thinking about it, Dean still shouldn’t think about it. Because down that path lies madness.\n“Dean, I’m sorry I invaded your privacy,” Cas says.\n“Aha!” Dean exclaims. “I win! You spoke first.”\n“Yes, you win,” Cas says, way too agreeably. It makes Dean irritated all over again. “I apologize, I won’t talk about it anymore. Can we put that aside and move on?”\nAnd Dean would agree with that, except he’s starting to suspect that Cas thinks he’s mad at him for the wrong reason. It’s not like Dean’s never been in a situation like this before. Years of living in tight quarters with Dad and Sam have taught him ways to compartmentalize because there’s only so much limited-living-space trauma to go around.\n“Cas, you and me,” Dean says, “This whole… arrangement, it’s all good, right? You said so yourself? Nothing personal.”\n“Yes, of course.”\n“Then why the hell would you suggest sleeping with me?”\nIt’d be nice if Cas said that it’s because Dean’s hot (which he is), but it’s no surprise whatsoever that the feathery dickhead just goes, “Because you were uncomfortable, and I was available to help.”\nWhich means that Cas would’ve offered it to anyone. Dean kinda wants to throw up. “Cas. You’ve never had sex before.”\n“I’ve never been to a drive-in before either,” Cas replies. “That doesn’t mean I’m not open to the experience.\n“Dude. A drive-in is not the same thing as sex.”\n“Why not?”\n“What do you mean, why not, because it’s not!”\nThere’s a loud thump – Cas knocking his head against the window in his exasperation. “Every time I think I have a handle on you… You get upset when I don’t read your mind, and then you get upset when I do?”\n“It’s different!”\n“Like enjoying a movie with you is different from having sex with you?” That might be a vein throbbing in Castiel’s temple. “How? Tell me how, Dean, because all I can see is that both are activities that make you happy, and for some reason beyond my comprehension, I like making you happy!”\nThe jolt of surprise that Cas cares at all what Dean thinks is knocked sideways with the sudden realization: “Cas. Are you saying that everything we’ve been doing, you let me do it because you thought I’d like it?” Goosebumps crawl up Dean’s arms. “Do you have any idea how creepy that is?”\n“I’m trying to be nice!”\n“That is not being nice!” Dean yells. “I’m a person, Cas, not a – not a game you earn points on! Look, sex is totally great, you should get on it, I can hook you up if you want, but it’d be a good to, oh I don’t know, only do it if you want to.”\n“All I hear,” Cas says, voice dry as dust, “Is a petty little man going on about how this is all wrong without a single useful explanation why.”\n“There are some things you just know, okay?”\n“Just know?” Cas echoes dubiously. “Shall I tell you what I know? I know that you’re bored and need to amuse yourself. I know that you have brought me along because you have no choice. I may understand and empathize, Dean Winchester, but for your information I am not a pet, and I am not here for your entertainment.”\nA flush of anger rushes through Dean. “Where the hell do you think you—”\n“Don’t think you can lie to me!”\n“I’m not the one who keeps lying—”\nThe argument ends there because it’s hard to argue when you’re hit with the urge to throw up your guts. Dean doubles over in pain, nausea balling up so high in his stomach that it’s a miracle he manages to hit the brakes and get the Impala to the side to safety. Cas, for his part, slams his body against the door and lets out a high-pitched yelp of distress.\n\n\nWhat in the fucking fuck my stomach fuck.\n\n\n\n\nThe bond. We can’t hurt each other. Or harbor the intent to hurt each other. Stop thinking bad thoughts.\n\n\nYou first, asshole. \nThey spend a few minutes breathing slowly. A couple of cars go by, one of them honking as it goes.\n“I think it’ll be best,” Cas croaks thickly, “If we continue without comment.”\n“Fine. Whatever.” Dean shakes his head rapidly, willing the spots of light out of his eyes. “Fine.”\nSilence settles in the car.\nDean focuses all his energy on driving. Once or twice he’s tempted to steal something from Cas’ head, but he gets over it quick. Cas is stonewalling him and that’s just fine, that’s just perfect, it’s much more pleasant this way.\nCas thinks Dean thinks of him as a pet? Seriously? Do many pets in Cas’ universe think it’s standard operating procedure to roll over like that? Dean shudders.\nDean didn’t even know that Cas was capable of having interest in sex. He’s just so tightly wound, so non-human. He doesn’t pay much attention to eating, for chrissakes.\nBut Cas does like trying new stuff no matter how much he says he doesn’t. To translate that into bed could’ve been interesting. He’d be pliant, wouldn’t he? No, not pliant, he’d be curious and surprised, then annoyed the hornier he gets because he wouldn’t know how to get off, and he’d yell at Dean to tell him what to do, damn you and would that healing mojo he has mean that they could have multiple orgasms?\nWow. Dean really needs to get laid if he’s starting to think about Cas and orgasms at the same time.\nWhich Dean is definitely not going to continue thinking about.\nIt’s a really good thing Cas is too angry to listen in right now, is all. Cas hasn’t even tried to listen in since last night, which doesn’t really matter anyway because now Dean knows how to kick him out if he tries anything.\nThey make it to the rendezvous point without incident, barring the one time Dean turned up the music really loud because Cas’ breathing was getting on his nerves, and Cas broke the player by glaring at it. Dean would’ve yelled at him but he liked the non-conversation.\nThey check into a new motel without a word. Cas petulantly wanders off with his key for who the hell knows what, and Dean calls Victor to let him know he made it.\nIt’s a relief to be able to switch into hunt mode. Hunts are easy, and god knows how Dean’s been craving one.\nHe and Victor meet up at the closest diner, agreeing to discuss the case over a meal. Victor’s face makes it clear that he isn’t in a joking mood, and he opens the festivities with, “You were the only one this way. Ellen mentioned you’re on downtime but no one else was available.”\n“You made the right call,” Dean says. “Sucks about that friend of yours. Still in ICU?”\n“Hell if I know,” Victor grunts. “Heard about that brush you had with a Phoenix. Didn’t know those were real, that wasn’t in the handbook.”\nCas appears at their table. “Life would be much easier if there was a handbook, yes.”\nDean jumps. “The hell!” At least Cas walked there like a normal person, but that’s a poor consolation. “Warn a guy, why don’t you.”\n“Not my fault you’re not listening,” Cas replies brusquely. “I’m here because I need money. It’s possible that I’ll be on my own for a day or so with you being away for business.” He nods at Victor. “Hello.”\n“Hello,” Victor says slowly.\n“What, I thought you’re all about being independent,” Dean tosses back at him. “Big boy, can take care of yourself?”\n“Don’t you boy me, are you going to give me any money or not?” Cas tries to lean in threateningly, but it only makes him look like has an inner ear imbalance. “You have spousal responsibilities towards me.”\nDean gapes. “You going to pull that on me? Now?”\nCas shoots Victor the biggest, fakest smile. “My husband isn’t very supportive of my needs.”\n“You bitch,” Dean breathes.\nCas winces – Dean feels the echoing twinge in his own head. “You have a Gorgon,” Cas says. “Or Gorgons, plural, though usually they’re solitary so it’s more likely there’s the one. I wasn’t sure earlier but when I walked here I could smell its saliva – it has a distinct acidic scent – through a sewage opening. They prefer hiding underground, usually near a water source. May I have some money now, Dean?”\n“What,” Victor says in bemusement, “You got yourself married to a monster-sniffer?”\n“It’s complicated, okay?” Dean snaps. He pulls out his wallet anyway, ignoring the way Cas rolls his eyes. “He’s not a hunter, and he’s staying out of this. You got me, Cas? We’ll check out the Gorgon lead, see if there’s anything in it.”\n“Suit yourself.” Cas takes the money and smiles thinly. “I hope you have a good day at work.”\n“Aww,” Dean says. “Thanks, honey.”\n“You’re welcome, dear.”\n“Well,” Victor says, watching money-grubbing Cas makes his exit, “I’d heard about that from Charlie but didn’t think it was true, so… congratulations.”\nDean grits his teeth. “You have no idea how—”\n“Stop right there,” Victor says. “You see this face, Dean? This is a face that does not care about your domestic problems. I said congrats and that’s all you’re gonna get, so let’s check out this possible Gorgon infestation, that okay with you?”\n“Fine.” Dean nods. “Break it down for me.”\n\n\n\n\n\n\nCastiel is shocked with himself. He’s sequestered in the motel room he and Dean are sharing, sitting on the floor and obsessively refolding the few clothes he’s brought with him. It takes Castiel a ridiculously long time to realize that what he’s really doing is sulking.\nHe could be doing a number of other far more productive things. Instead, he is arguing with himself. Actually to be more accurate, he is arguing with an absent Dean. Castiel didn’t mean to make Dean angry so why is Dean holding a grudge for something that he didn’t even do on purpose, and Castiel doesn’t even know what it is he was supposed to have done in the first place.\nAn absent Dean does not argue back or say nonsensical things, but he still manages to make Castiel’s blood boil anyway – why is that?\n“This is foolish,” Castiel says aloud.\nStill, it must be said that worse than an absent Dean is an angry Dean. Castiel doesn’t like how Dean turned sharp and cold in the flip of an eye, as though the real him had been nothing more than a mirage. Between Castiel and him, Dean’s the warm one, the friendly one, the one who’d offer his hand out first because his heart is just that big.\nBalthazar could possibly offer some advice for this. Castiel suspects it had not been just about sex, though that had been a part of it.\nCastiel turns on the television in some foolish notion that there might be some knowledge to be gleaned there. Unfortunately the only thing he learns is that TV is exponentially dull without Dean’s commentary.\nSomewhere in the middle another procedural, Castiel’s anger dissipates. It’s just so stupid, look at him getting upset over something so petty. Now all Castiel can think of is how upset Dean had been – upset and disappointed, as though he’d had expectations of Castiel that had been let down.\nCastiel really wants to figure this out. He thinks he could if Dean helped.\nIt’s too quiet without him.\n\n\nCas.\n\n\nCastiel starts in surprise. Dean? What is it?\nEmotion rushes through the now-uncovered bond, of Dean’s disgust and fear and determination. Dean’s heart is beating steadily, a different kind of anger coursing through him now. With the invitation handed over Castiel moves in, slipping behind Dean’s eyes to see what he sees.\nDean’s underground, his nostrils full of the smells typical of a Gorgon’s nest. You sure, Cas? Gorgons? Yes, that’s definitely what it is. Dean’s eyesight is poor in the darkness so Castiel nudges his optic nerves, giving them just enough of a boost to be able to make out the bodily remains in the walls and floor. \nDean blanches. He hadn’t realized that that’s what the Gorgon used to build its nest.\nI’m sorry, Dean. Castiel leans a few more new combination curses when Dean studies the area. Some victims have already been turned to stone, partially broken into sand where the Gorgon feasted on them. Castiel can’t help offering, For some of us, this is the way it must be. We are designed flawed. \n\n\nFuck flawed. I know creatures that make the choice not to be. Hell, \n\nyou did. \n\n\n\nYou have no idea how much we have to pay for a choice like that, Dean. Don’t misunderstand, I’m not trying to justify—\n\n\nThanks, I’ll take it from here. \nCastiel doesn’t accept Dean’s dismissal. He stays right where he is, following Dean through the catacombs and observing his discussion with Victor over what’s to be done.\nThey suspect there’s more that one Gorgon here. Victor is wavering, unsure if it’s a good idea to go ahead without back-up, but Dean thinks they can handle this. Victor is newer to hunting, a friend that Dean relatively recently converted to the cause, though he has personal investment in this case as someone he used to work with – FBI – was last seen around here.\nDean, I hear breathing. About ten degrees to your left, downward, yes, there.  Dean has iron with him, good. He also has his phone out, and encourages Victor to do the same. Oh, you’re using the camera on your phone as a protection filter. As opposed to a mirror. That’s… clever. \n\n\nWell, I \n\nhave been doing this for a while, you know. \n\nCastiel makes himself watch. There is one active Gorgon standing guard, and Dean and Victor work together to take him out. There are two more further inside guarding their eggs – yes, that’s why it’s called a nest, Dean – but after much cursing, a few injuries, and the destruction of one cellphone, they’re successfully dealt with.\nThis is Dean in action, Dean at work. He moves with a confident grace, focused on the mission despite his quipping and affectionate ribbing with Victor.\nYou didn’t have to help me, Dean tells him. He is injured, but satisfaction bolsters him through the pain. A part of him wants to celebrate, but when Dean looks down at their crumbling bodies he imagines Castiel in their place. Flawed by design. \nDoomed to destroy or be destroyed. Castiel thinks he should mourn them, but cannot rustle up the energy to care.\nThat’s not all you are, you know.  Dean offers up – not memories, exactly, but more like a knot of emotions and doubts and old fears tied up together – thoughts he’s had about what it’s like to value yourself by how efficiently you kill. Sam told him, no, that’s not all you have to be, which Dean hadn’t believed that at the time.\nThat’s not who you are, either, Castiel sends back. You saved my life when you didn’t have to. Kindness given freely without expectation of return. There are things I could learn from you.\nDean response is surprise and discomfort. That’s not what I meant, Cas. I’m not – I don’t expect you to – you’re not a pet, okay. Geez, can’t you tell?\nApparently not. Dean, why did you get upset? Tell me now.\nDean hesitates. Castiel tempers his frustration, because that just wouldn’t help, and instead throws out an invitation of his own. Castiel promises to not be offended no matter what Dean tells him. He wants to know, honestly does.\nDean doesn’t know how to put words to it. He gives emotions instead: embarrassment at the initial violation (Castiel knows that part), which then coalesced into anger. Castiel’s shocked by the thick swarm of disgust in Dean’s next thoughts – just the idea that he might’ve forced Castiel into any of this makes Dean ill. The agreement and its boundaries have been clear between them, and Castiel’s offer drove a wedge right into that. To think that Dean may have forced Castiel to bear his company where it wasn’t wanted, and that Castiel offered sexual services in payment?\nNo, Dean says.\nThere’s hurt there, too. Dean doesn’t directly acknowledge it, but Castiel can see what it is. Dean didn’t expect Castiel to think so little of him.\nThat’s not what I… Castiel closes his eyes and sends something back. He chooses his most recent memories, letting them play out in Dean’s mind as swift as one of his favorite TV shows, for this way Dean can know what it’s been like for Castiel. There has been no compulsion here, no hate. And if there had been? Castiel would have broken the bond immediately.\nCastiel had no idea Dean placed such value on his honesty. Dean jokes so often and refuses to accept Castiel’s upfront gratitude, Castiel had taken Dean’s comfort for granted. It seems contradictory, though Castiel’s learning that this is just the language Dean’s mind works in.\nThank you, Dean. Castiel takes these new lessons into himself, tucking them away safely. He will need to study them closely, and not intrude into Dean’s mind until he’s figured them out. It looks like you and Victor may need help. What can I do?\n\n\n \n\n\n\n\n\n\n\n\nVictor bitches and whines all the way out of the tunnels. “The fact is, if you’d moved your lazy ass when you were supposed to—”\n“Before or after you let tail-face get the jump on you?” Dean’s left calf is screaming in protest, so he and Victor are leaning on each other as they make the slow, painful trek out of there. Elsewhere, Cas is in a drugstore, painstakingly reading the labels of various painkillers. Dean sends to him: Just grab more bandages, we don’t need that other stuff. Oh, and some ice. \n“You know what’s interesting?” Victor says.\n“The fact that you need to lose some weight?”\n“Sorry, you said ‘lose some weight’ when I think you meant, ‘stop asking dumbasses for help’.”\nAnd you actually like each other.  Cas is amused despite himself, prodding gently at Dean’s mind for permission to learn more about Victor. But this is different from how you interact with, say, Jo and Ash.\nIt’s not one-size-fits-all, Cas. Dean heaves Victor up the final step, ignoring his cursing. “We just need to make it to the car and we’re good.” Cas sinks into Dean’s memories of Victor, captivated. Hey, watch the personal space.\n\n\nYes, sorry, I’m still learning. \n\n\nCas is being really careful now, going only where Dean guides him to and otherwise keeping his distance. Dean’s relieved, but he’s also a little disconcerted – Cas had been so mad and now he isn’t, and along the way he’d managed to take Dean’s own anger and turned that inside out. Dean feels a little stupid for his reaction now – sometimes Cas acts so human that Dean forgets he’s really not.\nI think I might have figured it out. When I was bonded to my brethren, secrets were few and far between. I know that humans don’t work that way, but I have very little practical experience. I sometimes can’t tell what is off-limits, and what isn’t. The same goes for… the physical, I think. \nYeah, I figured.  Cas is so reasonable about it that Dean feels like a douche. He’d reacted pretty strongly, which seems bizarre in retrospect. Cas clearly didn’t mean anything by it. The guy’s harmless, and now he’s practically tip-toeing around Dean again.\nWhich is good because that means Cas won’t hear anything Dean wasn’t want him to, but Dean kinda liked Cas poking around his head. Like Dean’s a worthwhile subject of study, or something.\n“Are you brain damaged?” Victor barks. They’re already in the car, but Dean realizes he hasn’t made a move to turn the engine on. “Let’s get back before I crust over, how about that?”\n“Just a lot on my mind.” Dean quickly turns the ignition on. “You were saying something?”\n“Yeah.” Victor’s voice goes soft, the way it does whenever he’s worried. “I had a hell of a time trying to pull someone in to help me on this. Was luck I got you at all, seems like everyone’s… overworked? Claws here, ghouls there, but you know what’s really interesting? Today we got a nest. The other day, Jo got that Rugaru camp and did you hear about that crazy vampire recruitment drive?”\nDean nods. “Lenore gave us a tip on that, just before she went into hiding.”\n“Well, you should’ve gotten the whole story out of her before you let her slip,” Victor grunts. “You know what this looks like to me? Drafting. But hey, no one listens to me, I’m just the new guy, what do I know. People keep saying this happens, the moon’s in Mars or some bullshit like that, but my gut says otherwise.”\nMadison had been acting weird, too. She’d been tense and worried, though Pamela said that it was under control because Cas had given her something to help.\nCas, who’d been in a cell when Dean found him because he didn’t want to fight humans.\nWell, shit.\nDean starts to call Cas, only for Cas to contact him first: Dean, are these friends of yours?\nHe has to concentrate to drive and do the psychic projection thing at the same time. Cas is in an alley, can’t be too far from the drugstore, and he’s being asked pretty pointed questions. Ah fuck, that’s… They’re hunters but not… friendly, exactly. Can you get away? Don’t let them know what you are.  \n“Victor, did you see anyone else when you were poking around? The Campbells, maybe?”\n“I didn’t notice anyone,” Victor replies. “But if I heard about this case, anyone else could’ve. Though I’dve knocked ‘em in the teeth for taking so damn long.”\nCas, they’re probably after the Gorgons. \n I surmised as much. Cas tries to reason with the people who’ve surrounded him, insisting that he’s only there to buy supplies for a friend and has no idea what they’re talking about. It’s not working, though, because when the Campbells catch a scent they don’t let go easily.\n\n\nWhat’d you do to make them notice you? Never mind, forget it, you need to pretend you’re innocent—\n\n\n\n\nI \n\nam innocent. \n\nNo, I meant, uh, pretend that you’re human. You’re human and you’re being harassed and these guys are pissing you off so – hey! Act like you think they’re going to mug you, call for help. \n\n\nI don’t think so, that’d just draw more attention. \n\n\n“Dean,” Victor says dryly. “In this country we drive on the right side of the road.”\nCas wants to fly away. Dean can feel Cas’ impatience at being forced to stand his ground, coupled with his inability to answer the rapid-fire questions coming from the vultures circling in on him. Hang on, I’m coming. \nIt’s a close call, but Dean makes it. He parks as close as he can, leaves Victor grumbling to himself, and high-tails it out to where the Campbells have Cas cornered. They’ve followed standard operating procedure, drawing Cas into the shadows away from potential witnesses. Everyone appears to be carrying fistfuls of iron and silver.\n“Get your own!” Christian barks when he sees Dean. “We got this one, Winchester.”\n“I’ve already taken them out, you morons!” Dean shoves Mark out of the way. “It was Gorgons, three of them, they were building a nest underground. You think I ruined my shoes for the heck of it?”\nChristian cursorily glances at Dean’s boots. “Gorgons, you say?” He’s moved closer to Cas, poised to strike at any moment. “Seems to me you missed this one. Thought you’d come to finish the job yourself, huh?”\nCas kicks Christian in the leg, running to Dean’s side in the confusion that follows. “Dean’s my husband, you assbutt,” Cas snaps. He sullenly clutches his plastic bag to his chest. “I got the bandages you wanted.”\nDean throws an arm around Cas. “Thanks, hon.”\n“Don’t call me hon, you’re late and I’m tired and being harassed is not how I wished to spend tonight.” They’re wavering, Dean, this must be working.\n“He’s not human,” Gwen says cautiously. “He’s allergic to iron. Did you know that?”\n“Uh, hmm,” Dean pretends to think, “How about, of fucking course I do. He’s under my protection and you’re all assholes for jumping on the first creature you find. You know what they say about assuming.” Gwen opens her mouth again – probably to counter that Dean would’ve done the same, which is true – so Dean quickly drags Cas away. “And you wonder why I didn’t invite you guys to the wedding.”\nMark’s eyes have gone comically wide. “You married a monster?”\n“Don’t knock it ‘til you’ve tried it.” Dean winks slyly at Cas, who responds with his best put-upon face. “The sex cannot be described.” We should get out of here before they start wondering how I found you. When I start walking, keep up, but don’t look like you’re in a hurry. \n“And you wonder why we won’t have anything to do with you,” Christian snaps. “What kind of hunter are you?”\n“One who actually found the thing that’d been killing people, and dealt with them? Geez, keep up, Chris, you keep snoozing on the job and we’re all screwed.” Dean flashes a parting grin and makes his exit, Cas close to his side.\n“I could’ve just flown off,” Cas says once they’re out of earshot. No one’s followed them, though they can hear faint sounds of the Campbells still talking among themselves. “That would’ve been easier.”\n“It also would’ve made you look like you had something to hide.” Dean exhales with relief when they make it to the Impala, but that just makes the pain in his side shoot up. He grits his teeth and presses a fist against the injury. “This way’s easier. They know for sure you’re with me, and they won’t try to track you.”\n“Are you sure?” Cas suddenly crowds Dean against the car, grabbing the hem of his shirt and puling it upward. There’s a snort somewhere nearby – Victor, who’s still in the car. “I’m not molesting you, I promise,” Cas says. His hand is gentle when it slides on Dean’s skin, moving round to cup his side.\nDean’s suddenly very warm.\nCas is just healing him, but they’re still standing really close and Cas is frowning in that weirdly endearing way that makes Dean think that if he moved forward a little bit, he could take up Cas on that offer. Dean hadn’t thought of it before, because Cas isn’t human. He looks human and smells human and laughs like a human but he’s just – he’s only an arrangement. He doesn’t care about anything but himself, so Dean should just return the favor.\n“Is that better?” Cas asks worriedly. “I’m going to fix your knee now.”\nOh shit, Dean thinks. Apparently Cas isn’t the only lying liar who lies; Dean’s body is definitely thrumming with the urge to shove Cas against the car and kiss that anxious look off his face.\nGreat. It’s not like Cas just got the message about the importance of defining one’s sexual boundaries.\nDean turns away, grateful that Cas isn’t listening in. Cas is too busy thinking about something else, not that Dean can make any sense of the rambling in his head: ‘he doesn’t understand how huge that is, does it not matter, how can he not realize’, but Dean stops listening because Cas might hear him and that’d just make it worse.\nCas draws back. “Is that all right, Dean?”\n“Yeah.” Dean quickly fixes his shirt. It’d be a bad idea to look at Cas right now, so he doesn’t. “Yeah, thanks.  Get in, we should be heading back.”\n\n\n\n\n\n\nCastiel knows from Dean’s memories that Victor is a good person and a loyal friend. He’s come through for Dean and the Roadhouse many times and, to his additional merit, when Dean explains that Castiel isn’t human Victor’s only response is to ask if Castiel can heal him.\n“I’m sorry,” Castiel says, “But I’m not married to you. It doesn’t work that way. I could heal you if you had supernatural-related injuries, but not this.”\nVictor shoves at Dean in disappointment. “You couldn’t have tapped a more useful creature? Or one with boobs?”\n“Cas is fine.” Dean’s concentrating really hard on driving, refusing to take his eyes off the road. “We’ve got to clean you up before infection gets in. You’re staying at the same place me and Cas are, right?”\nThey get Victor to his room with little trouble, Victor resuming his descriptive cursing once he’s in bed. Dean proves himself a good friend, too, giving Castiel unembellished instructions in helping tend to his comrade.\nIt would almost be enough to distract Castiel from the fact that Dean is uncomfortable. He’s barely up to his usual standard of filling the quiet with inane chatter, and even Victor seems to have noticed this. What is wrong with the world that Castiel prefers for them to be yelling at each other instead of this alternative? At least when they’re arguing, they’re talking to each other.\n“Those wrappings aren’t too tight, are they?” Castiel asks Victor. “Can I get you something? Water? I’ll be right back.”\n“You could just go.” Dean doesn’t look up from where he’s finishing up on the bandages around Victor’s ankle. “I got this one.”\nCastiel speedily reviews recent events. He’d honestly thought they’d made good headway after their disagreement – Dean had seemed relieved and willing to put that episode behind them. But it’s also true that there are massive gaps in Castiel’s knowledge of Dean. Maybe Castiel pushed too far in reminding Dean of his relation to the Gorgons, casting humanity’s battle under a light Dean is not comfortable thinking of.\n“I can’t mourn them,” Castiel blurts out. “The – those Gorgons, I mean. If I were in your place, I’d kill them, too. I feel sad, sort of, but mostly I’m angry that the situation is what it is. That in order to live at all we need to take from others.”\nDean blinks owlishly at him. “What?”\n“Just.” Castiel shrugs helplessly. “I just wanted you to know that. And thank you! With those hunters – Campbells, you said? You picked me.” He tries on a hopeful smile. “You picked me over your own, and I know you don’t think it’s a big deal, but for me, I can’t place value on something like that. So even if you don’t care, I do. Thank you.”\nThis just makes Dean’s discomfort even worse. “You picked me over the Gorgons. It evens out.”\n“Not even, not a little,” Castiel says quickly. “Dean, I’m grateful. My own brothers have taken out their rage on me and you – you who owe me nothing – have done so much more than I could’ve… If there’s something you want?”\nDean presses his fingers against his eyes. “This was a bad idea.”\n“You’re telling me,” Victor grumps. “You’re both still here and I need to get my beauty sleep.”\nCastiel stands there feeling awkward. Unfinished business scrapes under his skin, insisting he fix this, and do it without taking the short-cut of looking into Dean’s head.\n“I don’t know anything of Zachariah’s plans,” Castiel says. “I – you already know that he was trying to bring me over to his cause, but he didn’t offer any details of his scheme. But there’s been – I can’t describe it – there’s been this pull across the ether lately, as though my brethren have been calling out to each other, but I’d heard nothing more of that since I’d bound myself to you.”\n“Drafting!” Victor barks. “What’d I tell you! Ow, shit.”\n“Don’t move, you idiot,” Dean snaps. “Cas, look, we’re all tired. Let’s take a break, it’ll be easier to figure out what’s going on with a fresh mind tomorrow.”\n“I agree,” Castiel says.\n“Good.” Dean gives him an expectant look. “Are you going now or not?”\n“Yes, of course, I…” Castiel turns to Victor sharply. “You want to be alone?”\nA new thought careens wildly down its path: Dean wants to be alone (fair enough), but Dean wants to be alone with Victor, and they’re good friends, and Victor can offer the type of companionship that Castiel cannot, and Victor is attractive, and Dean has needs.\nThere’s a tightness in Castiel’s chest that hadn’t been there before. How novel it is to be suffocated by something as insubstantial as an idea. Victor’s a perfectly nice person, Castiel really shouldn’t want to… do not very nice things to him.\n“Oh,” Castiel says. So this is what it feels like to want someone.\nDean’s head whips up. What?\nAnd that’s what it feels like to have your personal space invaded. Castiel understands the need for secrets but is this different, it is its own kind of terrifying because although Castiel isn’t in any danger of being killed, there’s still the overwhelming urge to flee the fuck out of there. “Excuse me,” he says.\nCastiel snaps sideways, a single gentle flap of his wings enough to send him into his room – the room he shares with Dean.\nThough there is the chance that Dean might not be sharing it with him tonight.\nThat thought makes Castiel angry. Angry, but also bitter and a little sad. It’s too much emotion for Castiel to parse at once. What do humans do when they get like this? Physical action, pacing? Castiel tries that now, traversing the room with tense steps to and fro, clutching at his shirt and breathing rapidly through his mouth as he tries to calm himself.\nCastiel starts at a sudden touch to his mind. It’s Dean, brushing over Castiel’s thoughts searchingly.\nFine. Let Dean take whatever he wants. It’s not Castiel’s place to deny him anything, even if what he wants is another person. That’s a lie, though, Castiel does want to deny him that. Castiel wants to be selfish and recant his permission. So what if Dean didn’t want him the first time, so what if Castiel has little practical experience?\nCastiel stops pacing, struck by the obvious next course of action.\n“I have to seduce Dean,” he declares.\nNow that he knows what it is, want burns along Castiel’s skin, as though it’d been there all this while but only chose to manifest itself now. He wants Dean, who is exasperating and interesting and refuses to acknowledge thanks for his good deeds as though to recognize them would be to admit weakness. Dean, who has little crinkles under his eyes and smells really nice when he doesn’t go overboard with his aftershave.\nThe bond hums. Cas, stay right where you are. \n“Shit.” The swear is strange but satisfying in Castiel’s mouth. He looks down at his clothes – which are Sam’s clothes, no wonder Dean doesn’t want him, they must’ve been really distracting. “Think!” What does Dean like to do, what does he look for in partners, why are human beings so complicated?\nThe door swings open. Dean is right there and coming straight for him.\n“Wait!” Castiel says frantically when Dean closes the distance between them, an ominous feeling pulsing through the bond. “Wait, I’m not ready, I’m going to—”\nDean’s hands come up to Castiel’s face and, oh, Dean’s kissing him. After a moment of stunned surprise, Castiel kisses back blindly. Dean’s mouth is hot and his breath is warm and his body is a delicious wall of muscle Castiel wants to wrap himself around.\nThat was easy.\nI’m not easy, Dean says. Well. Most of the time. \nYes, I think I’ve figured that much out, oh, that feels— Castiel gasps when Dean’s arousal careens through him.\nIt turns out that Dean wants him, too, and that want is just as new for Dean as it is for Castiel. Recent memories flicker through Dean’s mind of their time together – the otherwise innocuous moments given new weight as Dean thinks, Has this always been there? I don’t know, maybe that’s why I got mad when you offered without wanting me back, I don’t know, who cares.  But unlike Castiel, Dean has clear ideas of where this can go: there are tastes and touches he wants to claim, and Castiel would give them to him gladly.\nDean’s hands are obscenely clever, moving on a focused path of taking Castiel to pieces, pulling at his clothes and cupping the angles of his body. Castiel’s lost in sensation but so is Dean, whose mind is also filled with glee and exhilaration, but a strange undercurrent of worry beneath—\n“Dean.” Castiel pulls away. “Dean, we need to. Walls.” He presses fingers to Dean’s temple. “If we do this, it can get…”\n“Oh, yeah, good idea.” Dean’s panting softly. Castiel’s mesmerized when his tongue darts out to wet his lips. “Do it.”\n“Yes, I’ll put them up now.” Castiel feels a pang of regret, but a wall’s a temporary necessity. Neither of them can promise to not listen to each other when they’re distracted and Castiel, for one, does not want to take anything of Dean’s that he doesn’t mean to give. “I’ll take it down after, uh…”\n“After I make you come your brains out?” By all that is holy, Dean is breathtakingly handsome when he smiles. He tugs on Castiel’s belt, drawing their bodies together. “That works.”\nCastiel surges up to kiss him, open-mouthed and clumsy. Dean just laughs, hands gentle on either side of Castiel’s head to guide him along. Dean is more patient with this than he is with anything else, contentedly leading from one kiss to another until kisses are not enough.\nUndressing is a tedious task. Dean practically cackles when Castiel tells him this, and then slows down. “What are you doing?” Castiel demands.\nDean makes a show of it, flexing his muscles when he drags his undershirt over his head. It’s nothing Castiel hasn’t already seen, but it’s different in this new context. Castiel feels breathless; he wants to touch Dean now, and is stunned by the realization that he’s allowed to touch Dean now. Dean pops the button of his jeans, dragging the zipper down slowly. “Don’t you just want to jump this?”\n“Yes, actually,” Castiel says thickly. He kicks away the last piece of his unruly clothing. “You know, I thought that sex would be fun. This isn’t fun.” He looks down at his erection that’s hanging heavy between his legs. “No, not fun.”\nDean’s leer deepens, and he shoves Castiel on to the bed. “It’s about the anticipation.”\n“What good is anticipation?” Castiel tilts his head back to watch Dean climb on top of him. He runs his fingers up Dean’s sides, the drag of skin making his mouth dry. “How is it you’ve changed? Why is it when I touch you…” He blinks up at Dean dazedly. “You’re the same, but you’re not.”\n“Yeah, that happens.” Dean shrugs, grinning happily. “Anticipation means that feeling in your gut? That good feeling? It gets to build, and it gets better.” He starts moving his hips, doing a strange sort of dance over Castiel’s dick. “Just go with it.”\n“I see.”\n“What, don’t you trust me?” Dean writhes in Castiel’s lap, a lascivious god-like creature out to make Castiel crazy. His cock is flushed red and curved upwards suggestively, so Castiel takes it into his hand and squeezes. Dean murmurs his approval. “Yeah, yeah, good idea.”\n“I do know how this works,” Castiel chastises.\n“Knowing and doing are completely – oh shit.” Castiel must be doing something right because Dean lets out a sound that makes Castiel want to roll them over and paw at Dean until he wrings out all the noises Dean can possibly make. “Fuck, keep going, keep going.”\nCastiel wants to, but it gets harder to focus the more Dean moves. Dean reaches behind himself, finding Castiel’s cock and pushing it firmly into the heat between his ass. Sweat is a poor lubricant but Dean loves it, rubbing insistently against Castiel’s shaft and hinting of other lewd things.\n“Dean,” Castiel gasps, “It’s not enough. Harder, must be – oh – harder.”\n“Bossy pants.” Dean obliges anyway, moving Castiel’s legs around and changing the angle so that the snap of their bodies brings Castiel’s cock firmly against the angle of Dean’s thigh. Castiel races with it, losing breath and speech as Dean brings him closer to the edge.\nClever, clever Dean. When Castiel finally comes, he clings to Dean and gasps praises of that cleverness. It’s messy and glorious, Dean grabbing his cock and pumping swiftly to prolong the sweetness of it.\nIn the aftermath, Castiel feels completely useless. Dean looks far too smug, but Castiel honestly has no criticism to offer. Castiel can only smile, and Dean takes that as an invitation to lower himself down for a kiss. These kisses are slower but no less scorching, the movements of Dean’s mouth almost in time with his rubbing against Castiel’s thigh.\n“Anything you want.” Castiel nods when Dean takes his hand, guiding it to wrap around Dean’s erection. Dean’s cock is almost silken smooth, sweat making their movement easier, and Castiel tightens his fingers until Dean nods.\n“Just hold on.” Dean makes a low sound of satisfaction, eyelids fluttering. He starts moving again, fucking Castiel’s fist with steadily growing enthusiasm, until he lets loose, head thrown back and groaning, “Fuck, yeah” and coming all over Castiel’s hand.\nCastiel exhales slowly, contended beyond measure. He strokes a lazy hand down Dean’s side as he drops onto the mattress, splayed out next to Castiel. That was wonderful, if a little clumsy in places, but surely with more practice Castiel will get better at it.\nThis is so unexpected. But not unwelcome, definitely.\n“Dean, do you think we could…” Castiel turns to Dean in surprise. “Dean, are you asleep?”\nDean’s mouth is open slightly, breath coming out in rattling almost-snores. His eyelashes rest soft near his cheeks, the eyes beneath still and untroubled. It’s a sight to behold. Dean would never want to hear that Castiel finds him beautiful, so it’s a good thing he’s not listening right now.\n“I get it,” Castiel says. “It’s not pleasant at all to desire someone when you’re unsure if the sentiment’s returned.” Then he gets to search for washcloths to clean them both up.\n\n\n\n\n\n\nDean’s not sure what woke him up, but he doesn’t think it’s something bad. He’s not on alert – it’s just really quiet. He turns his head and there’s Cas, sitting cross-legged next to him.\nA slow grin spreads across Dean’s face. They should’ve done that earlier, he thinks. Not that he could’ve guessed that Cas would be so into it. Dean’s pretty sure that Cas didn’t know he’d be so into it, the guy hadn’t had so much as a perverted thought in his head until he’d hit himself with a cluebat and realized that he’s married to a smokin’ hot dude.\nThough Cas isn’t all that bad, either. There’s something cool about the way he’s just sitting there, buck naked and uncaring.\n“You get off on watching me sleep?” Dean’s voice is a hoarse from sleep. “What is it?”\nCas has the stillness of someone who’s been waiting for a while. Dean tries to poke at his mind, and is surprised to get silence. The wall that Cas put up is still there, and Dean must look frustrated because Cas says, “I was just thinking about how I don’t understand you. Even when I have access to your mind, I can’t understand you.” He rests his hand on Dean’s stomach, stroking gently when Dean doesn’t protest. “Then there are times like now, when I can’t read you, but I still see vibrancy in everything you are.”\n“Hey,” Dean says with a snicker, “I’m pretty sure you’re projecting. I’m a simple guy with simple needs.”\n“Yes.” Cas nods. “You think of yourself that way.”\nDean isn’t awake enough to deal with this. “Did you wake me up for sex or what?”\n“We can do that.” It’s hard to read his expression in the dim light, but Cas seems softer somehow, like his sharper edges have been filed off. “I want to taste you. All of you, if you don’t mind.”\nA lesser person would be floored by Cas’ level of attention. Dean just happily goes, “Knock yourself out.”\nCas goes down on him. He doesn’t have much technique beyond taking as much of Dean as he can into his mouth, having all the finesse of someone who wants to destroy his reflex. Dean can’t complain, because Cas lets him fuck his mouth – which he does, making short, quick shoves past Cas’ lips that’s obscenely hot to watch. Dean comes with a gasp, and Cas holds tight around him to swallow everything.\nBest way to wake up, really. Dean whistles his approval. “Not bad.”\nCas wipes his mouth. “Now the rest of you.”\n“The rest of me what?”\nCas leans over Dean. He has an expression that Dean knows well because it’s the one Dean himself gets whenever he stumbles on one of those fucking awesome all-you-can-eat at momma’s homemade diner of your dreams with a dozen different types of pie. Except this time Dean is the buffet.\nWhich is apparently a turn-on.\n“You sure know how to make a guy feel special, Cas,” Dean laughs.\nCas starts by lifting Dean’s leg up to mouth at his ankles. He goes slow like he has all the time, hands and lips drifting lightly over Dean’s skin in an attempt to make good at that promise to taste him.\nDean thinks he shouldn’t enjoy this because he’s already gotten off and Cas’ impressive erection is getting neglected, but Cas doesn’t seem to care. Cas just keeps kissing him, from his ankles up to his calves, then down his thighs and to his chest and his shoulders and neck. Dean really likes having his elbows licked, who knew?\n“You totally got me off first so you could do this,” Dean pants. “Didn’t you? I knew it, you sneaky bastard.” He’s getting hard again, this is awesome.\nCas smiles as he drags mouth over Dean’s shoulder. “I want to sodomize you.”\nDean lets out a sputtering laugh. “Cas. We’ve been hanging out for a while, surely you’ve figured out at least a half-dozen better ways to say you want to pork a guy?”\n“Yes,” Cas agrees. “But I like it when you laugh.”\n“Nice cover.”\n“Hush.” Cas finally gets with the program, fingers nudging at Dean’s entrance. “Let me know if this hurts, I can’t tell at the moment.”\nDean sighs when he feels the smooth glide of a finger into him. “Where’d you get lube?”\n“Bought it while you were asleep.”\n“You know that’s pretty…” Dean’s really awake now, enjoying the fact that he’ll be able to take two fingers in no time, the first orgasm’s really gotten him loose. “Pretty presumptuous. What if I didn’t want to?”\nCas shrugs, more focused on getting that second finger in where it’s needed. “Then I’d have an extra tub of lubricant to experiment on myself with.”\n“Oh Jesus.” Dean can imagine that though, Cas touching himself, curiously putting his own fingers inside him and then being blindsided by how good it feels. “We could do that, too. Oh – oh right there, find my – find it, bend your fingers. No, no, not there, a bit further up, yeah, warmer, just, oh fuck.”\nMaybe Dean shouldn’t have told Cas about the prostate, because now he’s jabbing at it insistently and Dean’s going to have a heart attack.\nCas stops. Dean makes a gurgling sound and opens his eyes.\n“This is less convenient.” Cas tilts his head up to the ceiling. “I need leverage. May I take my wings out?” Dean nods. “May I use them to touch you? If you’re uncomfortable, let me know and I’ll retract them.”\nTurns out, Garuda wings are not all that feathery. Cas brings out all six of them, these huge partly-translucent things that curve through the air like cloth moving through water. Two of them stretch up to the ceiling, the tips of them going into drywall. That’s apparently what Cas meant by leverage, and he uses it now rise up to his knees.\n“Oh boy.” Dean jerks when it feels like the sheet is lifting him up, but that’s another of Cas’ wings, supporting his ass and lower back. The wings aren’t hot or cold, more like blankets of air that cause what feels like static electricity to run across whichever part of Dean’s skin they touch.\nThe wing immediately underneath Dean cushions his head, and another pair hold his legs open. It occurs to Dean that he’s being epically manhandled here, and he’s so distracted by this apparent new kink that he almost misses Cas pushing into him. There’s just so much other stuff going on – the wings undulating against his skin and stroking his neck – that Cas’ cock spearing him open almost feels like an afterthought.\n“Oh wow.” Dean rolls his body, surprised when the wings roll with him. The stretch in his ass is good but a little dulled by the pricks of not-electricity of Cas’ wings brushing his face.\n“What?” Cas blinks dazedly. “Are you okay?”\n“Yeah, I’m fine, it’s…” Dean gazes up at Cas.\nCas is still his unassuming, awkward, bitchy Cas, but there’s more than that. The way Cas looks at Dean makes him feel colossal, like he’s really worthy of being the focus of that much attention from another person. When Dean thinks about it – really thinks about it – here’s a guy who’s been alive for more centuries than Dean can wrap his head around, and Dean’s been fucking taking him to eat fucking burgers and fries, and Cas makes it feel completely natural. Like, of course this is what Cas wants to do, of course Dean can have Cas’ time and focus and laughter whenever he wants.\n“Uh, your wings are pretty cool,” Dean says weakly.\n“Thank you.” Cas smiles, and Dean yelps at a particularly hard shock under one of his knees. It makes him clench down around Cas’ cock, and Cas almost goes cross-eyed. “Oh. Noted, I shouldn’t do that again.”\n“Hell no, that was great.” Dean puts his hands above his head – through the wings – and arches his body up. Cas’ cock works just like a human’s, sliding all the way home with a satisfying drag and burn.\nDean moans as he takes it. He’s just as mesmerized by the way Cas is concentrating so hard to figure out the give of Dean’s body. Dean wishes the wall weren’t there between them, it’d be so much easier to drop pointers direct into Cas’ head.\nThose wings, though.\nCas slows down, frowning a little. “You’re not enjoying this?”\n“No, no, it’s fine, it’s great.” Dean glances pointedly to where his cock is dripping pre-come upward onto his chest. “It’s just ah. Your wings are really something.”\nCas is confused, then thoughtful. He cautiously moves the wing supporting Dean’s lower back, the edges like dozens of electrified fingers tickling his ass.\nDean shivers. “Whoa, yeah. How’s that working for you?”\n“Not as interesting for me, I’m afraid. My wings don’t register sensation the way, um…” Cas thrusts hard, forcing the breath out of Dean. “I like watching you, though.”\nDean figures he has to pray thanks to somebody because Cas then makes it his mission to find out what he can do with his wings. He cups Dean’s body in the curve of one, rocking him up and down onto his cock. Dean wants to tell Cas that this means he’s got a built-in supernatural sex swing, but Cas might stop to ask what a sex swing is and that’d ruin the moment.\n“Let’s try…” Cas is still fucking Dean, hips not slowing as his wings brace and slide all over his body. “Tell me if this hurts.”\nThe silk-electric feeling intensifies at Dean’s shoulders, almost like a cock trying to find entry which is weird as hell to think about even if it’s accurate. There’s pressure at the skin and then the edges of Cas’ wings are inside him, moving through the flesh beneath. Dean curses – an orgasm should not start at someone’s shoulders for crying out loud – and then kicks at Cas frantically when he feels the wings start to withdraw.\n“More,” Dean gasps. “More, more, give me more.” His eyes are blurry but he can hear Cas’ huff of amusement above him.\nThis is insane and probably illegal, but a lot of good things are. Cas’ wings draw lines along Dean’s sides just that little bit under his skin, working like a goddamned magician knowing exactly which buttons to push.\nDean’s going to die. He’s going to die because that’s Cas’ wing pushing through into him and lighting him up from the inside with crazy vibrating magic. Dean forces his eyes to focus and looks down – Cas hands are petting his stomach as though searching for something. It takes a moment for Dean to realize that Cas is aiming his wing for Dean’s prostate, but by then it’s too late.\nSucks to be their neighbors, ‘cause there’s no way Dean’s not screaming through that.\nDean’s brain is fried, game over, Cas zapped his prostate, medals for everyone. Dean’s shaking so hard he barely comes back to himself in time to watch Cas come – the old-fashioned way, right in Dean’s ass. There’s a split-second just after when he opens his eyes, and Cas looks… soft. Younger. Like he’s finally allowed to exhale.\nDean really wants know what Cas is thinking of at that moment.\nCas tucks his wings back into himself and lies down next to him. Dean approves of this, because an orgasm like that deserves a moment of awe and reflection.\nCas closes his eyes, and then the two-way’s back on. Dean sighs, it’s relief to be able to hear Cas’ emotions again. The guy’s practically high, coasting along the post-coital haze like it’s the best drug in the world. You have a pulled muscle in your left calf, but you don’t need me to fix that, do you?  \nNah, that’ll be fine. Dean shoves Castiel’s arm weakly. Just admit it, this is so much better than sitting alone in your room the whole day. \nAmusement flutters through the bond, and Cas turns to drop a kiss on Dean’s shoulder. “It’s your turn for clean-up.”\nHow’s that legit? I’m the human one, here.\n“I just gave you a wing orgasm.”\nDean gets tingly just thinking about it. Yeah, okay, that’s fair.  \n\n\n\n\n\n\nCastiel wants to get Dean some breakfast. He doesn’t want to get out of bed, for Dean is an excellent pillow, but a nice meal would start the day well.\nThere should be some shops open now, and the blissful clouds in Dean’s mind means he’s well on the way to stealing at least another hour in sleep. That last session had been particularly sublime, and Castiel isn’t ashamed to admit that he’d fallen asleep afterward pleasantly worn out.\nBut now it’s important that Castiel get Dean something nice to eat. He has some reasonable skills in choosing what Dean would like, and a hearty meal would be a wonderful start to the rest of the day. It’s likely Dean will be up for even more rigorous activity, and Castiel will be happy to oblige him.\nOnly it doesn’t quite work out that way.\nCastiel’s paying for takeaway when he hears Dean wake up. Dean sends some risqué suggestions at Castiel, to which Castiel replies that he’s agreeable, and then there’s a half-hearted debate on whether adding food to sexual activities would result in the loss of their motel deposit.\nIt’s during Castiel’s walk back that Dean’s tone changes. His mind blares a warning that stops Castiel in his tracks.\nCas, don’t come back yet. The Campbells are here, they’ve got some… It’s not safe. Stay where you are, I’ll deal with this. \nCastiel tries to concentrate, wanting to see what Dean sees, but there’s corruption in the bond. He can still hear Dean and his emotions, but some kind of distortion makes it hard for Castiel to focus.\n\n\nDean, there’s iron and magic warping the link. \n\n\nCastiel readies himself to fly to Dean, but stops at the last moment. This seems eerily like a hunter’s trap, but surely even the Campbells wouldn’t hurt one of their own. Certainly not for the sake of one minor creature.\nStay away, Cas,. A knot of alarm, worry and anger strikes Castiel in the stomach.\nCastiel retains enough sense to fly onto the roof of a nearby building, far enough to be safe but close enough to observe the motel block. There’s no one standing guard outside the room itself, but Castiel can see a van parked surreptitiously nearby.\nPain floods the bond – Dean’s been hit, Dean’s bleeding. Castiel doubles over and digs his wings into the cement, willing himself to remain still. Do they want me, Dean? Is that what they want?\nDon’t. Stay where you are. \n\n\nDo they want my claws? My wings? My lungs?\n\n\nStay where you – Dean’s struck again, harder this time.\n\n\nAre they after information? Dean, I can’t act if I don’t know what’s happening.\n\n\nSomeone touches Dean’s face and Castiel hisses at the pained echo that bounces through the bond. That touch belongs to a demon. It knows about the bond, and it knows Castiel can hear what it’s doing. What is wrong with Castiel that he’s letting Dean take this? Castiel’s not fully healed yet but even he can take one demon.\nBut that’s only one demon that he knows of. And there are also the hunters who are equipped to handle him.\nCastiel has to be logical. Castiel has to think clearly for Dean’s sake.\nDean, can you hear me? I’m right here. \nHe needs to get to Victor. Is it safe to fly? Are there other demons watching? They could sense him if they’re close enough.\nDean, give your pain to me.  Castiel doesn’t know if Dean even heard that, there’s too much distortion now. All Castiel knows is that Dean is bearing another blow, and then another, and all Castiel can do – because he is useless – is hunker down and try not to panic.\nThe hunters eventually leave. It takes over two hours, but they do leave in the van, dragging an unconscious Dean with them. There are two demons in their flock: the driver and Christian, though the latter hadn’t been taken by a demon last night.\nCastiel goes to Victor immediately, waking him up despite his protests. “Victor, Victor, get up, you need to help. They’ve taken Dean – I can find him but I can’t – I need to get demons – call Ellen, I don’t know how—”\n“Calm down.” Victor peels Castiel’s fingers off his shirt. “Breathe. Who’s taken Dean?”\nVictor is apprised of the situation, but he can’t help much. He’s injured and his phone was ruined in the Gorgon hunt, so the most he can do is explain about the Campbells, Dean’s devoted hunter clan cousins. They would not willingly ally themselves with demons, Victor says, so they must be being manipulated.\nCastiel may be alone, but Dean’s allies are numerous. “I could go to Sam. We were heading there anyway, we are closer to him than to the Roadhouse.” Victor opens his mouth to say something but Castiel’s gone, out the door to where the Impala is still resting in her parking spot.\n“Dean has been taken by villains.” Castiel puts a hand on her roof. She’s watched him and Dean, hopefully she knows he’s a friend by now. “I can recover him but I can’t do it alone. I need to get to Sam, can you take me to him?”\nVictor comes shambling out of his room, shirt half pulled-on and limping. “What the hell are you doing?”\n“I’m asking her for help.” The driver’s door clicks open, and Castiel murmurs a thank you. “She can lead me to Sam.”\n“The car?” Victor stares for a moment, and then shrugs. “I knew that thing was haunted.”\n“She’s not haunted, she just is.” Castiel slides into the driver’s seat and the engine rumbles to life. He can feel Dean in the leather – well, mostly Dean, with some Sam and the late John – and the echoing presence bleeds back into Castiel’s skin. It helps Castiel center himself. “I’m sorry I can’t help change your bandages.”\n“Nah, the love of your life’s in peril.” Victor claps Castiel’s shoulder. “I’ll see what I can do from here.”\n\n\n\n\n\n\nIsn’t it just like life, as soon as you’ve got a full day of getting laid in your immediate future, some doucheface with an agenda has to come and send it all down the crapper.\nDean wakes up on the floor of a van. His hands are tied and Gwen’s booted feet are within view.\nHe can hear Cas freaking out somewhere, though it’s barely audible through the cloud of static. The weird chain Christian dropped around his neck is doing its work, but at least he knows that Cas is alive. Cas knows he’s alive, too, a sliver of relief and desperation trickling through the noise when he registers that Dean’s awake. Cas is shouting at him, but it’s a distant blur.\n“It doesn’t have to be like this,” Gwen says. “We won’t do anything to him, we just want to talk.”\n“That your pitch, or do you actually believe that?”  Dean slowly sits up, wincing at the pain in his stomach. Mark is sitting near the door, gun at ready and watching Dean. Christian, thank goodness, is nowhere to be seen. “C’mon, guys, this isn’t like you. Ambushing a guy in his boxers? I like a little roughing up every now and then, but the whole part where we’re related is a turn-off—”\n“There’s war coming, Dean.” Gwen must be playing the good cop now. “You in your Ivory Roadhouse might not want to see it, but in the end it’s going to be us against them.” She joins him on the floor, pulling out the intense, sad eye contact. “You know what I’m talking about.”\n“I’ve heard things. Monsters acting up.”\n“Exactly.” Gwen creeps even closer. “And he didn’t come for you. You were in pain because of him, and he didn’t come to help you. Doesn’t that tell you something?”\n“Yeah, it tells me you think Cas would magically know what’s happening to me.”\n“You’re married, aren’t you?”\nDean narrows his eyes. “How do you know?”\n“You told us yourself—”\n“No,” Dean snaps. “How do you know about the psychic bond? I sure as hell didn’t until he explained it to me, it wasn’t in any of the stuff I read up on.” Cas, Cas, can you hear this? Boost up the signal, do something, you need to hear this. \nGwen starts. “That’s not important. He was supposed to come back but he didn’t, not even when you needed it. No matter what you think about him, no matter how trustworthy you think he is, he will abandon you the first choice he has to make. Maybe he already did, even before we got to you. It’s us against them, and they’ve been preparing for months.”\n“So you’re saying, all the activity across the map—”\n“Yes. But we need more information. Anything at all about their next step will help us. That’s why we need Castiel.” She smiles at Dean hopefully.\nThis trap for Cas is really good, but it’s too nasty even for his psycho cousins.\nDean takes a deep breath. “Christo.” Then, “Oh, shi—”\n\n\n\n\n\n\nSam, when Castiel finds him, doesn’t panic. Castiel practically breaks down his apartment door but Sam keeps a cool head and listens, going quiet and intense when Castiel lets his explanation unfold. Castiel stands back once he’s done, watching with relief when Sam immediately grabs his phone. Of course Sam would know what to do.\n“How many demons do you need?” Sam asks.\n“Three or four will do,” Castiel says. “The hosts will survive my feeding, though I can’t heal them if they’ve been harmed already.”\n“That is funny, isn’t it,” Sam says with a dry laugh, “So much stuff going on, barely anyone noticed when the demon omens went quiet.”\n“I don’t know the extent of what’s going on,” Castiel admits, “Just the part that’s touched me.”\nSomewhere else, Dean is awake and being moved. Castiel has some bearings on where he is, though it’d be easier to pinpoint if there wasn’t so much distortion.\nDean’s ring is warm on Castiel’s finger. He cups it now, a physical reminder of the bond that ensures that Dean will not be lost.\n“Madison told me she’s been having dreams of a giant wolf,” Castiel tells Sam. “I didn’t know what it meant at the time, I’ve been shielded by my marriage to Dean, but I’ve been thinking... It seems impossible, it’s never happened before in my lifetime, but if I open myself just enough there’s this – this pull, like we’re being summoned back to our masters. I think it might be all of us creatures, no matter if we were born or made.”\n“Your masters?” Sam echoes.\n“Our Alphas. The first of our lines?”\n“After we’ve saved Dean,” Sam vows, “You and me are totally going to sit down and hash this all out. You guys have genealogy lines? That’s just… would actually explain some things.”\n\n\nDemons, Cas.\n\n\nCastiel’s head snaps up. “I can hear Dean. It’s not as clear, but I can hear him.” We’re coming for you. \nYou might want to hold that thought, they’ve got a whole Shawshank set up in here. Werewolves, Djinn, shifters, you name it. Can you see this? They took back the charm that was blocking you. I’m thinking they want you to see this. \nNow Castiel’s able to catch glimpses of the place Dean has been brought into. It’s larger than Zachariah’s, far more elaborate, and there are smells that make even Castiel gag from where he is. Dean, if they ask anything of me, answer them and try to stall. Sam’s with me working on a plan. \n“I know where Dean is,” Castiel says. “But I can’t go by myself, they will have prepared for that. The traps have to go down.”\n“We can arrange that.” Sam’s frowning at his cellphone, typing messages with both thumbs. “Give me a location, I’ll see who we can pull to get there.”\nCas, hey. Dean’s been brought into a room that both of them immediately identify as an interrogation chamber. A demon wearing semi-formal clothes is waiting for Dean with a smile and welcome, and he talks to Dean in a way that makes it clear that he’s the one holding the Campbells hostage.\n“All of them?” Sam says.\nCastiel shrugs. “We might have to make that assumption for now.”\nDean sees spell markings and implements that are strange to him until Castiel puts down their names and uses. Fear prickles at Dean’s mind when Crowley has one of his minions – who’s wearing Mark Campbell, one of the cousins Dean actually liked – put him into a chair and bind him. Crowley starts chanting a spell Castiel doesn’t immediately recognize.\n“Can you give a rough idea where Dean is?” Sam has pulled a map onto his laptop screen. Maps are maps no matter if Castiel doesn’t know most of the names on them, and he points. “Okay, I got Bobby on, we’ll see who’s in the area.”\n\n\nUh, Cas? \n\n\nCastiel jumps at the same time Dean does. Foreign magic tugs at the bond, sliding in thick like oil. Castiel gasps but Dean’s just confused – he’d expected the pain of torture, and doesn’t understand why Castiel’s panicking.\n“Sam, Sam, Sam,” Castiel says urgently. “I must – I need to concentrate, I need a place I can sit and focus, I won’t be able to talk while I do this. Can you—?” Sam brings him into the bedroom without argument, and by the time Castiel’s made himself comfortable on the floor, his scales have erupted over his neck and upper arms in a typical defensive response. “I might talk or curse, just ignore that. If I’m not done by the time you have the team ready for assault, wake me up. Slowly! Understand?”\n“I got it,” Sam says worriedly. “But whatever happens, you can’t let go of Dean.”\n“You don’t need to tell me that, Sam,” Castiel says impatiently. “I know how important he is.” Surprise lights Sam’s eyes, but Castiel’s already slipping away, finding Dean and holding on to him tighter than he’s ever allowed himself to.\nCas, what’s happening? \nIt’s an intrusion, a violation, foul magic used to usurp other magic. It’s only thanks to Castiel’s patience that he hasn’t already burst into flames in rage, for the serpent is forcing its way in, trying to break into their bond and take it for themselves.\nWell, they can’t have it. Let me in, Dean. \nThere’s no training for this. Castiel has borne burdens with his brethren before – Anna, Balthazar, Rachel – but a marriage bond is different, Dean’s mind is different. Dean is human, with thoughts of many facets and colors that make up a language wholly its own, and it will be a challenge despite their remarkable compatibility. You think we’re compatible?  Of course they are, isn’t it obvious?\nThey’d only just met when they formed the bond and look at what it’s been like since then. How is that anything but remarkable? Castiel puts that thought aside; he has something else to do.\nOkay, Cas, shut up and get in here. \nDean opens his mind, and Castiel dives in as the first surge of pain hits.\nThe spell is exquisite eldritch craftsmanship. Where did Crowley learn such a thing?\nCastiel opens Dean’s eyes.\nHe and Dean are in the same space; together they glare up at the demon Crowley. Understanding swings back and forth between their individual conclusions – Crowley wants to remove Castiel from the bond so that he may use Dean as a – a modem, free access to the world wide hivemind – in his search for the other creatures he’s hunting.\n“Big mistake,” Castiel says with Dean’s mouth.\n“Oh, you’re the other one,” Crowley says in surprise. “Aren’t you supposed to be on the other end? No matter.” His blade glints over Dean’s skin, ready to draw more of its unholy art. “You wouldn’t happen to know where Purgatory is, would you?”\nDean, hold your ground. Dean’s too busy thinking hunter’s thoughts and trying to make sense of Crowley’s plan, but Castiel makes him focus. The spell will hit us with all it has, and we must stand it. This is just the start. \n“That endeavor will kill you,” Castiel says. “There is no value here.”\nCrowley rolls his eyes and brings the blade back down. “Figures that you’d be too low down the food chain. We need to go a bit… higher.”\nNew lines are drawn on Dean’s skin, magic burning hot and foul as it cascades from Dean to Castiel and back. Dean curses violently and bucks against his chair. Castiel knows for certain that they’re going to die. All of them who laid their hands and words on Dean are going to die. How about we not die first, huh, champ?\n“There are things—” Castiel stops to grit Dean’s teeth. “There are things in there you cannot hope to ever control.” Dean sees what Castiel means, catching a glimpse of the place where most of Castiel’s kin came from, and takes over for a moment to say, “You’re so fucked, Crowley. You’re going to destroy us all.”\n“How about you let the big boys worry about that?” Crowley says. “Why don’t you let me cut off this tumor of yours, eh, Winchester? You should be thanking me for this.”\nIt becomes a mass of pain. Both of them bear the intimate press of the curse, which is trying its best to slice its way through the bond. It’s broken glass and lightning and hooks under the skin, both of them only vaguely aware of their physical bodies in the distance. The physical doesn’t seem to matter when there are living, writhing things in their eyes, their chests, their stomachs. Scratch magical torture off my bucket list, Dean thinks hysterically.\nThey can bear this. They can, Dean is stronger than his vessel and more stubborn than his words. I thought I was a fragile human being who couldn’t take care of himself.  Dean can definitely take care of himself, Castiel’s the one who’d needed him at the start of it, and they’re in this now because of that.\nHold on, Dean. Castiel throws his mind wide open, giving Dean something to cling to. Dean somehow knows instinctually how this works, and his trust is as sweet as rainwater. Castiel pushes his favorite memories to the front – of flying in the desert, standing on mountaintops to breathe through the snow, that first crumble of apple and pastry in his mouth. Dean shares his own:  the scratch of a record being placed on a player, wind rushing by on the upward arc of a swing, the smell of leather when putting his father’s jacket on.\nThe blade edge of the spell nicks at the bond, but weakly. If they can hold on just long enough for Sam to set the other pieces in place, they will be free.\nAnd you’re buying me a cheeseburger, Dean adds.\n\n\n\n\n\n\nFor a while – an hour, a day, who knows – the real world is irrelevant.\nThat’s because Dean is elsewhere, tucked into that place you go to when pain is inconvenient, except he’s not alone. Cas is with him. More interesting than that, Cas is pissed off. Cas rages at the violation like it’s his job, which would be hilarious under any other circumstances because Dean had no idea this existed under all that bland confusion and disinterest, but there you go.\nThey can’t have you. I won’t let them. \nSo when Cas finally draws away with a sharp be right back, Dean doesn’t get mad. He could, because it’s not fun at all for Cas to leave him by himself to take how the world comes back in painful flashes of white and gray, cold air rushing into his lungs while the rest of his body screams.\nBut Dean doesn’t get mad, because right now Cas’ got that covered. The bond throbs firmly at the back of Dean’s mind, still in working order despite the agony of what feels like knives slicing through his skull.\nHands grab at his face, an annoying voice chirping, “Hello?” Crowley’s face slowly comes into focus when Dean opens his eyes. “Someone in there?”\nIt’s a little hard to speak through the blood in Dean’s mouth. He tries anyway.\n“What was that?” Crowley waves that stupid blade in front of his face. “Little unclear on there, sport.”\n“I said…” Dean coughs wetly. “You’re in so much trouble.” Crowley looks confused for all of two seconds, and then he looks up to where the ceiling is rattling.\nUnfortunately, Dean misses the good part. Oh, he’s still awake when Cas comes crashing through the wall, wings out like a boss and screaming at Crowley in his native tongue – they have some really interesting curse words, definitely – but he passes out around the time Cas’ talons come down on Crowley’s head.\nHeh, Cas has talons.\nSo Dean passes out. That’s totally reasonable, world of pain and all that.\nWhen he eventually wakes up an indeterminate time later, he’s only groggy and exhausted. Pain has been demoted to a hazy memory, and good riddance. When his eyes focus, he registers that he’s no longer in Crowley’s torture spa. \nDean notices Pamela’s hippie art pieces on the walls, which means that he’s in the Roadhouse infirmary. He considers moving, but that’s a stupid idea because he feels wrung out like road-kill on a summer’s day. A far better idea would be to melt into the bed for the next decade or so.\nHe doesn’t think he’s on drugs, though. He’s exhausted, but he can still think. He certainly has enough brain capacity to notice that someone’s in bed with him.\nDean looks down.\nCas stirs, eyes scrunching tight as he presses his face into the soft, ticklish skin adjacent to Dean’s shoulder. A gentle prod into Cas’ mind reveals exhaustion that mirrors Dean’s own, and he’d only woken up because Dean woke up.\n“Mrrr,” Cas grumbles. “Go to sleep.”\nDean should really file a complaint. It’s not like there’s a wealth of space on the bed, despite Cas’ decision to tuck himself firmly against Dean’s body. Cas’ arm is flung across Dean’s chest, his hand clutching onto a part of Dean’s shoulder where he’s also apparently decided to leave a handprint burn as a souvenir. “That’s not permanent, is it?” Dean asks.\n“Was emergency.” Cas nuzzles deeper like he doesn’t care how dangerously close he is to faceplanting into Dean’s armpit. There’s a thread of unhappiness in Cas’ mind, and when Dean follows it he sees a fuzzy memory of what Dean looked like when Cas arrived at Crowley’s. Sorry it took so long.  \nCas feels really bad about that.\nDean runs his fingers through the hair at Cas’ nape. “It’s not a big deal. You were right there with me most of the time.” He tugs at Cas’ ear teasingly. “You’d totally miss me, wouldn’t you?”\n\n\nTerribly.\n\n\nIn the quiet of the room, Cas’ sleepy presence becomes a fading buzz at the edges of Dean’s thoughts. It’s soothing, like white noise, though Dean doesn’t feel like going back to sleep himself.\nNow that there’s no pain to deal with, Dean can think about how insane it had been to go that deep into Cas’ mind. Cas had been so angry and terrified that he’d torn himself open to give Dean something to hold on to, and Dean swears that he saw echoes of himself settling in there between Cas’ memories of his siblings (the nice ones), like Dean matters. \nAnd a part of him – just a teeny, tiny part, okay – is thrilled by that.\nThe divider curtain moves and then Sam’s coming in, smiling sheepishly. “Hey.” He’s settled into the chair next to the bed before Dean realizes he should be embarrassed that he’s got six feet of sleepy dude practically sprawled all over him. Pamela’s probably taken pictures. “You feeling okay?”\n“Judging from your sorry face I’m the best feeling person in this room.” Dean snickers, because the world’s already a better place when Sam’s making disgruntled faces. “Campbells okay?”\nSam droops a little, nodding somberly at his shoes. “The ones we could find, yeah. When Cas made the pick-up he burned out all demons and even some of the other… inmates before we could question them.”\nDean shrugs casually, though there’s another unexpected rush at the thought of Cas going berserk on his behalf. “Guy’s thorough, what can you do.”\n“Ellen’s taking over this one personally, it looks like we might need to pull out the big guns.” Sam studies his hands for a moment. “Do you, um. Do you need anything? As far as Pamela could tell you’ve totally healed.”\nDean experimentally wiggles his feet. Everything’s working, looks like. “Yeah, I’m cool.”\n“So I guess I should…” Sam moves to leave, but stops short at the curtains. “By the way, did you know you’ve got some—” he wiggles a finger in Dean’s direction, “—Cas all over your shirt? You might want to clean that up.”\nDean flips him off. “Might want to clean up your face.”\n“Why can’t you go to sleep,” Cas groans. Familiar irritation oozes through the thick sleepiness of his mind.\nDean cups the back of Cas neck and squeezes gently. You know what’ll be better? Post-rescue celebration sex. It’s the best. He must make a really stupid face at that, because Sam gags and high-tails it out of there.\nA weird buzz floods Cas’ mind, knocking Dean’s awesome idea straight out on its ass. “You haven’t eaten in almost two days.” Cas peels himself off Dean and blinks sleepily at nothing. “I’ve fixed what I can but that’s not enough. Come.”\n“That’s what she—”\nCas grabs Dean’s shirt and hauls him up. Dean knows Cas’ wiry body is just a front for his real strength, but it’s still bewildering to find himself manhandled off the bed and onto his feet in the dizzying blink of an eye. Cas tugs at the hem of Dean’s shirt to fix it, and then raises up a warning finger. “Don’t argue.”\n“You know,” Dean says, slipping into the shoes Cas pushes towards him, “That’s actually kinda hot.”\nDean is hungry now that he thinks about it, but Cas drags him out of the med wing with an urgency that’s ridiculous. The buzzing in Cas’ mind kicks up a notch, making it difficult for Dean to get a read on him beyond that he’s tired and pissed – at Crowley, probably, though it’s hard to say for sure. Dean politely pulls back because Cas needs his space like everyone else. If he’s a little antsy around Dean because of what went down, Dean gets that, too.\nThey end up in the bar, where Sam’s already settled at a table and talking with Victor and Jo. Early lunch, it looks like, and Cas promptly dumps Dean into a chair before making his way to the kitchen.\n“Hey man, looking good,” Dean says. “What’d I miss?”\n“Don’t be cheerful.” Victor pokes a fork angrily in the air. “Stop being cheerful, it’s offending me.”\n“Sorry, dude, not my fault I’m the only one with a Garuda up my sleeve.” Dean grins when Cas comes back with the Roadhouse all-day-breakfast special. “Thanks. You getting something for yourself?”\n“I have my coffee.” Cas sits down opposite Dean and pushes the plate firmly towards him. “Eat up now.”\nJo’s smirking over her orange juice. “He always this bossy?”\n“Yeah, pretty much.” Dean flicks at Cas through the bond, expecting his usual squirmy response, but Cas just hunkers down to take a long gulp of coffee. He’s still tired, Dean reminds himself. Cas just needs proper rest and, heh, a good roll in the hay that Dean’s more than happy to provide.\n“So,” Dean says, turning to the others, “Any news while I was out? Jo, how’s it going?” There’s a lot to talk about, it seems, because they each have their theories and Victor’s particularly smug that his conclusions about the monster activity have their truthiness after all. Dean listens to it all, jumping in every now and then to add what he managed to get from Crowley and his minions.\nCas isn’t listening, though. Cas is sinking deep into his own thoughts, the buzzing in his mind growing louder and louder until Dean, who isn’t even trying to listen, can’t ignore it.\n“Cas,” Dean says quietly, “If you’re tired you should go.”\n“Yes!” Cas nods rapidly. “Precisely.” He puts down his mug and the fog suddenly clears from his thoughts, leaving them crystal clear.\nDean knows what’s coming, he can feel it dropping like an ominous pebble in Cas’ mind, but that doesn’t make hearing it any less of a kick in the nuts. “Dean, I want a divorce.”\n“No,” Dean blurts out.\nSilence falls over the table. Sam coughs and tries to get up, but he slowly sits back down when Cas shoots him a glare.\n“I mean.” Dean clears his throat. “What’s up, Cas?”\n“I’m healed.” Cas looks Dean right in the eye as he says it. That’s a conscious choice, as is the cool wall he’s firmly pulling over his thoughts. “Those were the terms of the contract, weren’t they? When Sam managed to get me a meal of demons to power myself up, the feeding completed the healing process as well.”\nNow this is the punch in the face to match the kick in the balls. Dean hadn’t thought of it like a contract since… a while, it has to be. But Cas is right. A promise is a promise and if Dean’s stomach is sinking down to his feet then that’s his own fucking problem because it’s not like Cas ever pretended this was anything more than what it is.\n“Okay.” Dean can be an adult about this. “Okay, yeah. Do you want to move out? We’ve still got a couple of rooms, I think, Ash can help set you up. Something higher up, maybe? There’s a part in the attic of the main building that we got converted for this other guy – never mind, long story – but we could go have a look after this?”\nCas blinks in surprise. “What?”\n“It’s not a problem, it’s not like you have that much stuff anyway,” Dean rambles, “And most of it used to belong to Sam. Your clothes, I mean. You should still keep them, it’s not like Sam could fit into them anymore even if he wanted to.”\nCas’ mouth opens and closes. “You think I’m staying?”\n“Of course you’re staying,” Dean says. “You like it here, we like you here. And by ‘we’ I mean me and Sam and Jo and maybe Ellen, though I’m not completely sure about that last one but she’s got to be okay with you after taking out Crowley. Victor’s totally on board, too –  you are, right?”\nVictor starts. “Why do you keep dragging me into this?”\n“Neutral observer, go with it,” Dean says.\nCas is still completely bewildered, slowly leaning backward as though he’s developed a spontaneous allergy to the table. “I do have things to do, Dean.”\n“But you like it here! You like it here, and you like…” Dean trails off; oh god, not the right place for this, better ride the adrenaline rush before he starts crash-and-burning. “Come on, Cas, you literally cannot lie to me. Life has just started becoming interesting for you. You’re not gonna give that up.” He doesn’t even have to read Cas’ mind to know the next part is true. “You don’t want to give that up.”\nCas’ face crumples, punching the breath from Dean’s lungs. “Excuse me,” he says quietly. And then disappears.\nDean stares at the empty Cas-shaped space. “What the hell just happened?”\nMaybe he jumped to the wrong conclusion. Maybe he’d gotten everything wrong about Cas, but… that’s not possible, is it? Dean knows Cas has been happy, far happier than he’s been for a long time. To hell with it, Dean’s been happy, too. Maybe it’s something else, maybe Dean fucked up somewhere without realizing, or maybe Cas saw something in his head—\n“For heaven’s sake.” Cas reappears in his seat. He’s scowling, though, which is good because Dean can handle an irritated Cas better than a morose one. “Can you stop thinking about yourself for five seconds?”\n“No, he can’t,” Victor chips in.\n“Dude.” Sam shoves at Victor with his elbow. “Not cool.”\n“Be nice,” Cas snaps at Victor. “He’s your friend.”\n“He’s your husband,” Victor replies with a shrug. “I’m under no obligation to be nice and I’m not the one making a big production out of fucking nothing.”\n“Um.” Jo glances between them uncertainly. “Should we leave?”\n“I wanted witnesses!” Cas yells. “It was supposed to be easy! I’d declare my desire for a divorce, you’d say yes, we’d break the bond and your damn friends would be the damn witnesses and the whole damned thing would be over. Don’t you dare make that joke you’re thinking about dams and beavers, Dean, I am not in the mood.”\nDean’s stomach flips. “You’re gorgeous when you’re angry.”\n“Stop that!” Cas jumps up from his seat and grabs Dean’s collar. “Are you going to divorce me or not?”\n“If I say yes, will you leave me?” Dean asks.\n“Emotional blackmail,” Cas gasps. “That is low.”\n“So you do want to leave me?” Dean makes an unmanly sound of surprise when Cas pulls, dragging him to his feet and away from the table.\nHe knows he should feel really, really bad about poking Cas, but he loves it when Cas is like this. The guy’s usually repressed to stillness, but there’s so much more to him than that. A few right words and he falls, practically undone as he gives himself over to the emotions he keeps telling himself he doesn’t have. It’s as if only Dean can do this to him.\nThere’s also the part where this is turning out to be a major turn-on.\n“Dean.” Cas only stops marching them both when they’re outside the bar, their audience left far behind. “Stop being obtuse. We need to separate because I’m compromised.”\n“Crowley?” Dean starts. “What, is the spell still there? I thought you flushed it out when you—”\nCas groans, dropping his face into his palms.\n“Okay,” Dean says slowly, “Not Crowley?” He carefully brushes over Cas’ mind, just enough to show how much he wants to know but will be okay if Cas doesn’t want to tell him. Cas, to Dean’s surprise, downright melts at the touch, anxiety easing away when Dean soothes him.\n“What I mean is…” Cas presses a hand over his heart. “I’m compromised.”\nDean is a horrible, bad, terrible human being. Cas is holding himself taut like he expects to be shot, but Dean’s brain is too busy spiraling around that little piece of information.\nCas is compromised. Dean can’t say he’d seen that one coming, but now that it’s here it’s not a surprise at all.\n“I should…” Cas struggles with his ring, then stops halfway. “Dean?”\n“What?” Dean looks down to where he’s got Cas’ hands in an iron grip, stopping him from getting that ring off. “Oh.”\nDean feels lightheaded. Cas is close to leaving and it’s really important that he doesn’t, but Dean’s never been smart at this part. His track record has more potholes than not, he wouldn’t put it past himself to fuck this up. The thing is, Cas is so upfront and honest about how he feels that all Dean wants is to return the favor and then some. Dean thinks he should be terrified – to lay yourself open like that is just insane – but then, he realizes, he’s almost there, isn’t he?\nDean thinks he might finally understand what Cas meant what he said that the bond is its own kind of freedom.\n“We can make it whatever we want it to be, right?” Dean says carefully. “Who cares how it started, because it works. Maybe one day it won’t anymore, and we can break it then. But right now… right now it’s okay. It’s good. At least I think it’s good?”\n“It’s… Yes, it’s very good, Dean.”\n“Then why can’t we keep it?” Dean asks. “I don’t mind that you’re compromised.”\n“You don’t…?” Shock widens Cas’ eyes. “But that’s not what you wanted. You like it to be simple.”\n“Maybe I need to get over that.” Dean feels something inside him shift, some old fear fading into nothing because the expression on Cas’ face is something Dean can and does want to fix. “Maybe I should get over that right now. I think you’re awesome, and I think this—” he gestures between them, “—can be awesome, too. Christ on a cracker, Cas, you’re plugged into my head. Don’t be afraid to look, can’t you see how okay I am with this?”\nCas finally touches Dean’s mind, but he does it so cautiously that Dean might scream. Everything’s right there, if only Cas would take it. “Oh, I see,” Cas say shakily. “But remember, you got quite upset the last time I breached a personal boundary of yours.”\n“That was ages ago!”\n“My mistake,” Cas says with a wry smile, “I thought it was only the three days prior.”\n“C’mere.” Dean grabs Cas’ hand firmly and pushes his ring back up to its proper place. “There. That’s that.”\nCas pulls his hand back and splays his fingers out, a tiny smile playing on his face as he admires the silver. Dean feels better already, relieved at the quiet satisfaction humming through Cas’ mind. Then Cas says, “Do you want this back?” and pulls Dean’s ring out from his pocket.\n“Hey, Crowley took that from me for… Oh.” Dean almost laughs at the way Cas ducks his head in embarrassment. Even while in berserker mode, Cas had apparently enough presence of mind to save the ring. Dean loops his fingers into Cas’ belt and tugs, grinning when Cas comes forward willingly. “You got it back for me, you marshmallow cream center.”\n“Shut up.” Cas grabs Dean’s hand and slides the ring on, neat as you please. “Try not to lose it again.”\nThe ring doesn’t feel heavy at all. Dean toys with it for a moment, then grins at Cas. “What, no kiss?”\n“No,” Cas says loftily, “I’m tired and you haven’t finished your breakfast.”\n“Fuck breakfast.”\nThat startles a smile out of Cas, the easiness of it tingling all the way down to Dean’s toes. “You’d choose me over food? Mind yourself, Dean, people might think you have feelings.”\n“It’s not like there’s pie.” Dean shrugs carelessly. “Nothing personal, right?”\nCas’ laugh is one of the best sounds in the world. Dean’s so busy watching the way the corners of Cas’ eyes crinkle up he doesn’t realize Cas is moving until he’s right in his face, sliding his arms over Dean’s shoulders and tilting his head up to kiss him. Dean huffs in surprise but recovers quickly, getting with the program of cupping Cas’ head and guiding his lips open.\nCas’ mouth is hot, his mind is like, god, it’s like fucking sunshine and rainbows and kittens in there – I like sunshine, rainbows are all right but I don’t have an opinion either way about kittens. \nOh now you pay attention to what I’m thinking about, Dean responds. Amusement and yearning radiate from Cas’ mind, and it’s trippy to be able to feel that at the same that Cas licks a firm line up Dean’s tongue. You have learned well, young Padawan. Cas’ fingers are in Dean’s hair and he’s practically climbing Dean’s hip in his eagerness.\nThe best part, though, is how Cas’ arousal burns freely from his mind to Dean’s. \nCas’s desperation is right there, and Dean soaks in it, laughing breathlessly at the way Cas’ want is an almost tangible thing, licking along Dean’s thoughts in the strangest sort of foreplay. Cas plucks at Dean’s mind for hints or ideas, and gasps when Dean helpfully provides. Yes, yes, all of it, yes. \nDean doesn’t care that Cas can see right back into him. If he were wired differently he would be, but right now, with Cas, he can’t find any fucks to give. He’s open and Cas is open and this is so much better than relying on clunky words. Dean can see how Cas is overwhelmed and terrified, and that’s cool because they can be overwhelmed and terrified together.\nI want to breathe you, Cas thinks at him. There’s a rush of air and they’re suddenly back in Dean’s room, Cas falling onto the bed and pulling Dean with him. I want to put my roots in you and see what happens.\n“Oh Jesus, can we fuck like this?” Dean fumbles with his belt, cursing when it takes too long to get his pants off. “You in my head, me in yours?”\n“Yes,” Cas hisses, rising up to plant a firm kiss on Dean’s chin. His shirt’s a lost cause, pulled apart in his need to feel Dean’s hands on his skin. “Me, take me, I won’t need much preparation, don’t feel pain like you do.”\nDean doesn’t have to doubt that statement. He can follow everything that’s going on, from Cas’ eagerness, to his flicker of curiosity about what it’d feel like to be fucked, to the still-new rush of hunger that comes from taking two, then three, of Dean’s lubed-up fingers. There’s only a twinge of discomfort when Dean pushes his fingers deep as they can, and with Cas’ mind and body yelling their readiness, it’s easy as anything to just shove Cas onto his stomach and give it to him.\n“Oh god.” Dean blinks dazedly at the back of Cas’ neck. The edges of Cas’ hair are curled with sweat, though it’s hard to focus on the individual strands because Cas is shaking so hard. Or Dean’s the one who’s shaking, same difference. How’d we get here? \nA part of Dean wants to savor this, but that part’s overridden by the boil in his blood to get this show on the fucking road. Underneath him, Cas is tense and ready, not quite enjoying it yet but confident that there are more interesting things to come.\nBe with me. Dean slowly rolls his hips, drawing his cock out only so that he can push back into the delicious clench of Cas’ body. He moves his hands down Cas’ sides, up his thighs, across his stomach, anything else he can touch. Goosebumps dance over Cas’ skin and Dean gently pats the swell of his ass. You better pay attention. \nIt’s going to be good. Dean knows that even before he starts fucking Cas in earnest, pacing it hard and fast with the knowledge that Cas can take it all. Dean slides a hand under Cas’ chest to hold him in place, keeping their bodies slick against each other while his mind stays with Cas’, following him closely through interesting and oh that’s better and oh Dean oh that’s which then dissolves into a wordless frenzy.\nDean knows the feeling.\nHe has to close his eyes. It’s too tight in his skin and every time he knocks Cas’ prostate the white-out of pleasure slams through them both.\nThere’s no slowing down, though, they’re racing headfirst into it, and who the fuck cares if the bed breaks with the workout it’s getting. God, Dean wants to ride Cas for hours, wants to ruin him and make him scream, but there’s no chance of that now. Cas is horny as hell, pushing back against Dean’s dick while pleasure crests through his body in a wave.\nThe best part is that Dean gets to do this again. Cas has seen into him and he hasn’t left, so Dean gets to keep this, and he gets to keep Cas.\nCas starts. Oh. He’d heard that, and his surprise is that last, lingering step before he tips over and falls.\nThe orgasm roars through them, and Dean bares his teeth in a snarl because that’s the only thing he has any control over anymore. Cas’ delirious bliss drags Dean down with him, and the feedback loop means it’s just crazy party time for everyone. That might be Cas sobbing but it’s hard to be sure since Dean’s also yelling and it’s all messed up and no one knows what’s going on anymore.\n“Bluh,” Dean says much later. Cas is squashed flat under him but uncomplaining, his mind a contented flatline of oh… that doesn’t want to go anywhere. Dean rolls off him with a grunt.\nThere’s a long, quiet moment of nothing. But it’s a good kind of nothing; the kind that doesn’t want filling up. After a while Dean feels Cas stir. He doesn’t move but his mind rumbles through its reboot and then turns its attention to Dean’s.\nDean knows what Cas will find in his head. He can tell himself that it’s only afterglow, but there’s also happiness there: raw and bright and stupid-making. That’s cool, though. Cas can look all he wants.\n“So.” Dean laces his fingers together on his chest. “What do you think?”\nCas shrugs. It was okay.\nDean hooks his foot over Cas’ ankle and rubs gently. Cas starts making a sound in his mind – half-purr, half-hum – that Dean wants to wrap around himself like a blanket. “Next time we do that, you’re getting your wings out.”\n\n\n\n\n\n\nWhen they submit their proposal to Ellen, she puts her newspaper down to give them her full attention. “Run that by me again?”\n“We’d like some time off.” Dean rocks back and forth on his feet, hands shoved into the front pockets of his jeans. “A couple of weeks, max. We’ll still be in touch, and we’ll come back if there’s an emergency, no question.”\n“Dean would like to take me to Lawrence,” Castiel says. “That’s one stop of many, though we haven’t agreed on a definite route at the moment. If you have any suggestions, we’d really appreciate it.”\n“The traffic’s gone down, too!” Dean adds. “Since Victor took up shop at Monster Alcatraz we’ve got population control back online. Uh, sorry Cas.”\n“No offense taken.”\nDean continues, “And with the Campbells up and running again, the workload of cleaning up Crowley’s mess is pretty evenly spread out. I think you can spare us. Well, me at least. For a little while.” Does it look like she’s cracking?\nCastiel sends the mental equivalent of a shrug. You know her better than me, Dean. \n“Actually.” Ellen purses her lips thoughtfully. “I meant run that first part by me again. Your opening? Let’s hear it one more time. For the balcony.”\nDean squares his shoulders. “Me and Cas want our honeymoon.”\nCastiel nods. “Yes, it’s only proper.” When Ellen raises an eyebrow, he adds hastily, “For the sake of a mutually respectful cultural exchange between our species, of course.”\nEllen is no fool. She’s seen the shift between the two of them since Dean’s kidnapping and recovery, even though she’s not asked them directly about it. No one in the Roadhouse has, for Dean’s family is kinder than that. They roll with it, supportive and observant of Dean’s choices, and one day Castiel might even find the way to get Bobby to like him for who he is.\n\n\nBobby already likes you, feather-brain. \n\n\nThen why does he threaten to cut off my appendages if I ever break your heart? \nDean’s head whips round. What?\nCastiel rolls his eyes and pulls one of Dean’s unresisting hands into his own. It’s a mark of affection, Dean. I like the assumption he’s made that I’m sticking around. Some progress is better than none. \n“Well, then!” Ellen says loudly, and they return their attention back to her. “It’s obvious you’ve thought about this carefully – or I’ll assume you have, seeing as that you’re both adults who don’t need me telling you what to do with your lives. I just need to know one thing. Is it still on the down-low?”\nCastiel isn’t sure what she’s referring to, but Dean just says, “No. We’re cool with it.”\n“Great! Then we’ll have a send-off.” Ellen smiles warmly. “That okay with you?”\n“Yeah, that’s perfect, then we can put a stop to all the goddamn questioning,” Dean grumbles. “Why the hell everyone and their grandmother cares about whether I’m really hitched, I have no idea. Victor’s such a gossip queen, geez.”\n“What…” Castiel glances from Ellen to Dean and back. “What’s a proper send-off?”\nA proper send-off turns out to be like any other of the Roadhouse dinners, except with Dean and Castiel as the guests of honor. Jo and Ash take charge as co-organizers, closing the bar for the night so that their near and dear can fill the space up. Castiel usually doesn’t mind crowds – they make it easier to disappear in, after all – but it’s different when people are there to actually see him.\nDean basks in the atmosphere, loud and laughing as he meets these faces of familiarity and affection. Everyone assumes Castiel’s bewilderment at the attention is inherent to his non-humanness – which it might be, who knows.\nBreathe, Dean says, sending a layer of calm over Castiel’s mind. Wherever Castiel turns, Dean drops a name and an anecdote in his head, reminding him that these are people Dean knows and trusts, and though all of them are related to hunting some way or the other, Castiel has nothing to worry about because Dean has his back.\nThere are few certainties in Castiel’s life, but for this chapter at least, Dean’s confidence and stubbornness to keep him here is one.\n“Hell of a coming out party,” Pamela says, accosting Castiel while he’s in the middle of trying to find a nondescript corner to hide in somewhere. She drags him towards the bar with an amused, “Let Dean work the room. You just need to sit down and look pretty.”\n“Unfortunately, Dean’s better than me at that, too,” Castiel demurs, which has Pamela laughing. They settle at the bar where Jo’s waiting for them. Jo is on drinks duty tonight, and she takes to it with aplomb.\n“I thought it would be a smaller affair,” Castiel says, glancing around the room. Only a handful are actual hunters, the rest civilians. There are even some children partaking in the merriment. “Though I shouldn’t be surprised that Dean’s touched so many people. That is his gift.”\n“That’s a way to put it,” Pamela says with a wink.\n“No, I’m serious.” Castiel holds her gaze. “I truly am.”\nPamela swings her gaze round to Jo smugly. “That’s twenty bucks you owe me, Harvelle.”\n“Shhhh.” Jo swats at Pamela with a towel cloth. “Sorry, Cas, we made a… I know, tasteless.”\n“That’s fine, too,” Castiel says with a laugh. “If I had anything of value I would have wanted to join that bet.” He sits back while Jo sets up a line of shots that he is apparently required to down one after another. He feels a flicker through the bond, and concentrates just enough to hear Dean’s conversation with his brother across the room.\n“Just be straight with me,” Sam is saying softly. He’s pulled Dean aside to where they have some partial privacy, Sam boxing Dean in against the corner. “Because otherwise? This is not cool.”\n“We’re not messing,” Dean replies. He’s smiling for the benefit of the others, but the words come out low and insistent. “Okay, maybe just a little bit—”\n“Dean!”\n“—but not where it counts.” Dean takes a shaky breath, but he is calm, confident of his decisions. “I know, it’s only been a few months, but I’m not breaking it. I don’t want to, Cas doesn’t want to, and if we’re gonna keep it, everyone else has to know.”\n“But they don’t know how you guys—”\n“So?” Dean shrugs happily. “Maybe this is as real as it gets for me. I’m okay with that.”\nSam’s surprise is palpable. “And Cas?”\n“He’s okay with that, too.” \n“Cas,” Jo says, making Castiel start. Her coy expression makes Castiel drop his gaze – he must have been making a foolishly pleased expression, though who can blame him – but she’s nice enough to not call him on it. “Your go.”\n“Did I say congrats already?” Pamela asks. “No? Well, congrats.” She drops a kiss to his cheek and ruffles his hair.\nCastiel ducks his head, clamping down the urge to crow to the world the luck that has been his. It’s not his secret to tell, but of all the impossible things Castiel could ever have hoped for, Dean wouldn’t even have come close. Dean is kind and stubborn and perpetually fascinating, his mind taking to the bond with such skill and dexterity beyond anyone (human or not) that Castiel’s known, as though he’s been starving for the chance to share himself with someone beyond the clumsy limits of language.\n“I’m very lucky,” Castiel manages to say. “And thankful.”\nFor what they have here is not a marriage as the others understand it. This is just how Dean’s determined to carve a place for Castiel in his world, and to say that Castiel is honored would be a gross understatement.\n“Dance!” someone yells. Another voice picks it up and it dissolves into chanting, whoops in the air, and then Dean’s sauntering up to Castiel at the bar, hand outstretched and practically glowing.\nSomewhere in the background someone increases the volume of a man’s musical declaration of how much he wants sugar poured on him.\nDean cocks his head. “You know how much we humans love our rituals.”\nCastiel is terrified for about two seconds, and then he’s taking Dean’s hand.\nAfter that it’s a blur of laughter and Dean guiding Castiel’s body through the bond and a lot of music with electric guitars and dramatic drumming. Castiel doesn’t understand most of the conversation swirling around them but everything’s okay because Dean’s right there, a grounding presence that makes Castiel’s own feet feel like they’re on firm ground for the first time in eons.\nPeople fuss over them both, and there’s a lot of back-slapping and a few direct hugs that throw Castiel off – some people are really offended on his behalf that there’s no one on his side of the family here tonight – but Castiel finds himself helplessly swept up in the cheer of the night.\nThe best part is later, though. The final agenda of the night is apparently the guests’ official sending off of Dean and him. The guests pour outside the front doors to where the Impala is parked, (Almost) Just Married written across the back in what turns out to be whipped cream.\nDean’s busy with goodbyes, so Castiel makes himself comfortable in the Impala’s passenger seat, rubbing his shoulders against the leather and nodding at the Impala’s subtle murmur of recognition. Sam comes by the window to see him off, an understandably cautious smile on his face when he offers a hand out.\n“Well,” Sam says quietly, “Good luck, I guess.”\n“Thank you.” Castiel shakes his hand firmly. “I shall care for him to the best of my ability.”\n“You talking ‘bout me?” Dean says, appearing at Sam’s shoulder. He grabs at Sam, and the brothers tussle for a moment while Castiel fiddles with the radio. Dean’s happiness makes him glow like a small sun, his laughter coming in short breaths.\nCas looks up when Dean gets into the car. “Do you remember where we’re going, or should I pull up the map?”\n“Let me get to the Interstate first.” Dean checks the mirror. “That place better be good, Cas.”\n“The honeymoon package had good reviews on the internet.”\n“Yeah, and the internet never lies?”\n“I’ve already made the booking. You are not backing out on me.”\nThey wave at their guests, and Castiel turns to watch the lighted-up Roadhouse slowly shrink as they leave it behind. Castiel feels like he should mark this occasion with something pithy, perhaps referring to the nature of roads and travel, and the pride he feels at having Dean with him.\nNone of it feels adequate, though.\n“You know what?” Dean says. “We should go see Victor. Give him a nice surprise, since he couldn’t make it tonight.”\n“You are at once a terrible person and a wonderful friend,” Castiel observes. Once again this drives home what a miracle this is, that they can share this happiness without baggage or censure, and Castiel’s seized by a sudden impulse. He leans across the space between them and kisses Dean’s cheek.\n“Oh.” Dean shoots Castiel a slightly embarrassed – but pleased – glance. “Yeah.”\n“We could go to Victor.” Castiel toes off his shoes and pushes them into a corner.  “Then we can canvass that area again, see if anything slipped through the cracks.”\n“You don’t still think Crowley survived, do you?” Dean asks.\n“He shouldn’t have,” Castiel admits, “But we also know he was dabbling in magic that should’ve been beyond a normal demon’s scope. I wouldn’t put it past him to have failsafes in place, no matter that Ellen and the others haven’t been able to find anything.”\n“Can’t disagree there.” Dean reaches over to cup the back of Castiel’s neck, stroking his thumb across the skin there lazily. “Lenore’s still missing, too. I’d rest easier if we could make sure it’s really over. Hey, c’mere.”\nThey’re waiting at an intersection, so Dean gently tugs Castiel in for a kiss. Castiel murmurs his approval against Dean’s mouth, flicking his tongue against Dean’s in a soft tease until someone honks at them. Dean snickers and says, “Wait ‘til you see what I brought for our honeymoon.”\n“Besides the small arsenal of weaponry and salt in the trunk?”\n“Well, yeah.” Dean drops a hand to Castiel’s thigh, palming the flesh there firmly. “We’re gonna have a good time.”\nCastiel rests his hand on top of Dean’s. “I know.”"
}