{
    "id": "4330836",
    "url": "https://archiveofourown.org/works/4330836?view_full_work=true",
    "author": [
        "dirgewithoutmusic"
    ],
    "title": "the heir of something or other",
    "rating": "Not Rated",
    "archive_warnings": [
        "Major Character Death"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "Harry Potter - J. K. Rowling"
    ],
    "relationships": [
        "Harry Potter & Millicent Bulstrode",
        "Hermione Granger & Harry Potter",
        "Colin Creevey & Dennis Creevey & Harry Potter",
        "Luna Lovegood & Harry Potter",
        "Astoria Greengrass & Harry Potter",
        "Astoria Greengrass & Daphne Greengrass",
        "Daphne Greengrass & Pansy Parkinson",
        "Hermione Granger & Ron Weasley"
    ],
    "characters": [
        "Harry Potter",
        "Millicent Bulstrode",
        "Colin Creevey",
        "Hermione Granger",
        "Dennis Creevey",
        "Luna Lovegood",
        "Ron Weasley",
        "Draco Malfoy",
        "Astoria Greengrass",
        "Daphne Greengrass",
        "Pansy Parkinson",
        "Neville Longbottom",
        "Susan Bones"
    ],
    "additional_tags": [
        "Slytherin Harry",
        "A few other House color changes...",
        "Canon Typical Violence",
        "Canon Death",
        "Canon typical bullying",
        "Stuff"
    ],
    "language": "English",
    "series": "Part 5 of boy with a scar",
    "published": "2015-07-13",
    "completed": null,
    "words": "14,305",
    "chapters": "1/1",
    "comments": "600",
    "kudos": "15,228",
    "bookmarks": "2,893",
    "hits": "151,698",
    "summary": "<p>When kids in the Slytherin Common Room tossed jeers at the pudgy feet of Millicent Bulstrode, Harry rose up to do something about it. This Harry, now one of Snape’s own, got fewer House points lost but many more detentions– it had never been the colors on his hem that Severus hated.</p>\n<p>This was not wishing Harry an easy path. This was not wishing the boy a warm House. This was Harry, three weeks in, sleep deprived and considering running away and going back to Privet Drive. This was Harry in the back of Potions class, blank-faced under Snape’s disdain the way he’d perfected under the Dursleys’s torments.</p>\n<p>When Quirrell shouted “troll in the dungeons, thought you ought to know,” and Harry overheard that there was a girl in the bathroom crying, he still ran off to make sure she got out okay. He hesitated first, at the back of the little pack of Slytherin first years (at the back so that no one could get behind him)– he hesitated. </p>\n<p>And Millicent Bulstrode, who could never quite keep her tummy tucked in enough, could never brush all the cat hair off her robes, never quite keep her temper in check, hesitated, too.</p>",
    "notes": "<p>thyevilqueen asked: \"I am in love with your \"boy with a scar\" series. Thanks so much for sharing your writings! I have commented on Ao3 as well, but I was wondering if you'd take a fic prompt? I am very curious what you think would've happened if harry never requested to be placed in gryffindor, so the sorting hat placed him in slytherin.\"</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
    "text": "Yes! Let’s say Hagrid got Harry a sundae and Harry, awestruck, lingered over it–- they were late to Madame Malkin’s, passing Draco on his way out.\nLet’s say Harry got a little earlier to the station and didn’t meet the Weasleys there. A big blond Hufflepuff with broad shoulders and a bright future showed him how to get through the platform wall–- Cedric Diggory was on route for being a prefect, and things like this were why.\nBecause what if Harry had gotten his House opinions from the song, instead of age-old conflict? Slytherin, where you’ll make real friends. And this boy with nothing, this boy who latched onto the first kindnesses he’d ever seen, he thought yes that is what I want.\nSlytherins–- this is a group who laughs when Neville falls off a broom and breaks his wrist. And what if we had Harry there, who had always been the one laughed at, who had a nice thirst to prove himself, who had green trim on his robes instead of red? This Harry still stepped out in front of Malfoy’s best sneer and demanded Neville’s Rememberall back–- though he got a detention from it, not a Seekership.\nWhen kids in the Slytherin Common Room tossed jeers at the pudgy feet of Millicent Bulstrode, Harry rose up to do something about it. This Harry, now one of Snape’s own, got fewer House points lost but many more detentions– it had never been the colors on his hem that Severus hated.\nHe got more bruises. Harry had barely even learned Wingardium Leviosa, but he was little, years of bullying under his skin, and he knew how to get up in people’s faces, snap out insults, and kick their shins when it got bad.\nThis was not wishing Harry an easy path. This was not wishing the boy a warm House. This was Harry, three weeks in, sleep deprived and considering running away and going back to Privet Drive. This was Harry in the back of Potions class, blank-faced under Snape’s disdain the way he’d perfected under the Dursleys’s torments.\nSlytherin was the house of cunning, of ambition–- but if you know better, the Hat will let you ask for something else. If you know better–- so Slytherin’s dungeon was filled with the kids who thought blood purist sounded like home, with the children who didn’t know better–-with children. The dungeon was filled with children.\nWhen Quirrell shouted “troll in the dungeons, thought you ought to know,” and Harry overheard that there was a girl in the bathroom crying, he still ran off to make sure she got out okay. He hesitated first, at the back of the little pack of Slytherin first years (at the back so that no one could get behind him)– he hesitated. And Millicent Bulstrode, who could never quite keep her tummy tucked in enough, could never brush all the cat hair off her robes, never quite keep her temper in check, hesitated, too.\nHarry did not ask Millicent to come with him; this was not a boy who asked for things. When he had asked for things, Dudley had laughed, Petunia had scowled, and Vernon had said, “no,” or just kept reading the newspaper like he hadn’t heard anything at all. But when Harry went, Millicent bunched up her robes in her hands and followed.\nA troll got a wand up his nose. When Harry shouted for help, for the first time someone answered him. When Hermione picked her way out of the rubble, she stared at them–- the grinning messy-haired boy and the scowling fat girl who was stubbornly considering either smiling back or kicking a bit of dirty water onto the reckless little hellion’s robes.\nHermione stared–- the green on their robes. She was eleven years old. The kids at her old Muggle school had called her ugly, know-it-all, pest–- but here she had already been called Mudblood by upper years twice her size, in green-trimmed robes just like these. It rang differently, that word, than smartypants ever had. It was hissed, and it echoed out and further out, past the school yards and high castle walls.\nBut Harry stumbled over a troll’s ankles and through hissing streams of water from broken pipes to make sure she was okay, hands dirty, wand disgustingly snotted, his hair its normal silly mess. Millicent refused to wade any deeper through the gathering pools of cold water, but when Hermione opened her mouth to lie about hunting down the mountain troll Millicent snorted and cut her off.\nMcGonagall stared at the streaming pipes, Potter’s snotty wand, a Slytherin girl stopping a Gryffindor from lying to protect her–- she gave a small pinched sigh, a headache pounding in her ears that was as deep and throbbing as the one she’d gotten the first time she realized what trouble those Weasley twins were going to be. She didn’t take or give any House points, just sent them off to their respective dormitories and then went to make herself a hot cup of tea with lemon.\nHermione reached out best through books sometimes–- she snuck out of her dormitory one night, breath held tight, chin held high, and tiptoed into the Restricted Section. She owed a debt, and that was more important than even rules, even expulsion.\nShe read late into the night, quiet, and napped rebelliously through History of Magic (she had made her own eight-volume replacement history course with Madame Pince’s help).\nWhen Hermione thought she knew what she needed, she stole all of Harry’s lunch hours for a week and taught him how to cast lasting shield spells that wouldn’t cave even to the top of the seventh year’s class, even in a House known for its fondness for curses. When Harry finally mastered her shield spells and a pretty handful of boobytrap jinxes, he put them up around his four poster and slept easily for the first time since he’d arrived at Hogwarts.\nSlytherin was the house where you’ll make true friends. The next time Harry went after one of his housemates, who was bullying a Ravenclaw in the back aisles of the Library, Millicent dragged him up to Madame Pomfrey after, made his excuses for him, and finished up the last of his Potions essay so Snape would have nothing to tut about. When a Death Eaters’ daughter sent a curse at the back of Harry’s head, Hermione muttered the Anti-Jinx under her breath from across the Great Hall. When Millicent went home for Christmas, Harry fed her cat every morning and evening and praised every power he knew for the existence of magical catboxes. \nRon Weasley had not been in that bathroom to fight a ten foot mountain troll and to seal a friendship in adrenaline and bold-faced lies to authorities. He had made Hermione cry that day–- well, a new world, a stumbling between what Hermione could be and what people wanted from her, kindnesses gone awry, and books held close–- all of these things had piled on Hermione’s chest and Ron had been the thing that pushed it over.\nHe would do that for years, be the last straw, the last jagged edge to cut the last tendril of rope–he was sharp when he didn’t mean to and sharper when he did, a vaguely purposeful danger zone.\nRon would make Hermione fume and shout and roll her eyes; she would make him throw his hands in the air, growl, stomp, and one day he would make himself apologize. It would look like this: a challenge, an offer to teach wizarding chess. It would seal a friendship in quiet, lengthy pauses to deliberate between moves, in gentle and not-so-gentle ribbing and greater and greater crowing at victories, in stacks of chess strategy library books Ron had never thought to look for and pretended badly that he didn’t want to borrow.\nAt the end of that first year, news of Voldemort, of the Stone and where it might be hidden, reached Harry’s ears and he only knew how to make one choice.\nAuthorities seemed perhaps even less trustworthy now. Harry slept every night under protection spells he had been taught by an eleven year old girl and had then woven himself; he did not expect any adult to come to his aid, not even at the end of the world. But Millicent glared when he suggested leaving her behind, and Hermione went stony and stubborn, chin quivering.\nIt was Draco who heard Harry sneak out of the dorm, who tried to stop them, jeering– Millicent dropped him with a Stunning Hex and they went to meet Hermione in the third floor corridor.  \nIn the Devil’s Snare, Hermione panicked and Millicent hurled down a curse of rot that turned the plant to fluttery ash. “My mother is a violent gardener,” she said, brushing her robes off, while Hermione and Harry caught their breath.\nHarry, who watched the Quidditch games from the stands with a burning interest and begged extracurricular flying practice from Madame Hooch on late empty afternoons (his homework undone in his backpack), took on the flying key room.\nHermione handled the chess room, muttering advice from strategy manuals and long tough games with Ron and his waving hands. They lost her there, her bishop sacrificed, Millicent’s robe bundled up under her unconscious head, but Harry and Millicent managed to chew their way through the potions riddle. “I can smell our Head of House on this,” said Millicent, twisting her nose up. “Greasy git.”\nWhen they realized there was only one mouthful of the right potion, and that only one of them could go on through, there was a quick and growling fight. Millicent ended up hovering, fuming, on the wrong side of the fire while Harry slipped forward to meet Quirrell, to meet Voldemort for the second time, and to have his mother’s love rise up around him like a vicious curse and leave a dead man at his feet.\nHarry woke up to far less candies and sweets strewn on his bedside table. Slytherin won the House Cup and half of Gryffindor House refused to speak to Hermione for the last few days of the school year. Ron rolled his eyes and complained about the final exams and told Hermione to ignore the idiots, who had nothing but fluff and echoes between their ears.\nWhen Harry got back to 4 Privet Drive, he did not find his summer much more dungeonous than his dormitory back in Hogwarts, the baleful eyes that peered through his shield spells– the difference was that there was no Millicent to sit with in the Common Room, shoulder pressed to shoulder. Until Dobby came and everything went to hell, he liked to go over to Mrs. Figgs’ and help feed her cats, to try to feel less lonely.\nAfter that, though, his doors were locked, his meals pushed under the door. A flying car yanked the bars off his window, but this time it was Hermione sitting fretfully in the passenger’s seat, having written and badgered Ron until he agreed to help her. (The twins had taken less convincing, having been gleefully eyeing their dad’s car all summer).\nRon eyed Harry dubiously, the scrawny kid on his backseat, this boy who shared a dorm with a Malfoy. Ron’s best chess partner was clucking and worrying over him, and Ron couldn’t help but think of long cons, pawn’s gambits, liars.\nWhen they got to the Burrow, Harry found himself swallowed up in warmth and full plates. Molly had been ready to suspiciously eye any Slytherin who came through her door, that mother of that fiercely Gryffindor brood–- but the figure that tumbled out of the back of her husband’s car was rake-thin, his hair too long, his eyes wide. Molly swept him up in nothing but warmth. This boy looked ready to jump and flee from shadows–- or, perhaps even worse, so sure he wouldn’t get away that he was ready to turn and fight. She refused to be one more shadow, and put some more bacon on to cook instead.\nHermione wrote home to her parents and she and Harry spent the rest of summer in the Burrow’s sunny rambles. Percy sniffed at Harry, but the twins prodded and cajoled him. “So how’d you screw with the Hat to get Slytherin?”\n“How did you get Gryffindor?” Harry said.\nHe was with Hermione, not Ron, when the Express platform wouldn’t open. They went back, holding hands in the crowd, to find Mr. and Mrs. Weasley, who Flooed the school, and the school sent Professor Sprout out to Apparate them to the front gates and walk them in. They came in right before the Sorting ceremony, but slid in the back, split up, and went to their separate tables.\nThat year, Colin Creevey came to Hogwarts with a Muggle camera around his neck and wide eyes that swallowed things up even better than those lenses. Colin knew few things about this new world he had been given, but he knew this: Harry James Potter was a hero. So when he saw green on Harry’s robes, before he went under the Hat, he knew then that green and silver must be the colors of heroes, too.\nThe Hat offered Colin Ravenclaw first, but this time instead of begging for Gryffindor, he begged for Slytherin. The wand chooses the wizard but the wizard chooses the House.\nColin was the first Mudblood Slytherin had had in years– most get warned, and Colin had been warned. But he had been told about Harry Potter, too, so here he was. The first time Crabbe sneered and stepped toward Colin in the Common Room, Harry whipped his wand out and Colin knew he had chosen the right House.\nHarry took Colin aside and taught him shield spells to set up around his four poster in the first year dorm. Colin kept boxes and boxes of developed photos under his bed, all neatly but inaccurately labeled. Even without hearing, in Colin’s squeaky little voice, why this fragile kid was in this cruel House, Harry would have felt responsible–- in every world this boy felt responsible for the fates of people within his reach.\nHe sent Colin to Hermione for tutoring and watched him carefully in the Common Room, even after the common bullies got used to the Muggleborn kid’s presence, his clunky camera, even after they realized that bothering the little Creevey would get them not just Harry’s rage but Millicent’s resigned wrath. Colin needed a lot of watching. (Two years later, when Dennis Creevey (even smaller, even squeakier) ended up in Hufflepuff instead, Harry would heave a massive sigh of relief).\nHarry dragged Colin with him to meals in the Great Hall, didn’t let him out of his sight. At the less formal meals, Hermione would eat with them–- they’d choose between their tables based on which had a larger space of empty bench for them to huddle in.\nThe first time that year that Hermione said something polite and disapproving about the dessert on Millicent’s clean plate, Millicent flushed red and sullen; but Harry sat up straight. He had been hungry before. Food on his plate would always feel stolen, just a bit, all his life, and if he could fight to keep that feeling from being shoved down Millicent’s throat, he would fight.\nHermione’s spine went stiff, her lip went wobbly, and she stormed off; but she came back by and apologized later, pockets full of her Christmas package of Weasley sweets to share. Millicent collected Chocolate Frog cards with a passion.\nWhen they called Harry the Heir of Slytherin that year, they meant it. (When he saved the day at the end of it all, when the scare ended, the whispers wouldn’t fade as neatly.)\n“You aren’t, really, are you?” said Millicent. “The Heir?”\nHarry flopped back on his bed. “Aren’t we all?”\nMillicent laid down next to him and thought about that while her cat jumped up and curled up to sleep on the soft plush warmth of her belly.\nHermione did not ask him, just frowned over her homework in the library next to him, so Harry stumbled it out one day. “I’m not, you know– I’m not doing all the things they say I’m doing.”\nHermione stuck her quill in her bush of hair and peered up at him. “Obviously?”\nHe blinked and she rolled her eyes, then rubbed her nose and got ink all over it.\n“You clearly don’t hate Muggleborns,” Hermione said, violet-smudged nose in the air.\n“You could be an exception,” Harry said, starting to smile.\n“I’m not, though,” she said.\nHarry found Luna earlier, in her first year and not her third. Harry was on the lookout for odd ones out, people who were true to their Houses but whose Houses were not true to them.\nLuna had her eyes open, wide and bulging, and she was swallowing the world sweetly whole. Her shoes were disappearing one by one. He invited her to their study sessions in the library, where Luna got infuriatingly under Hermione’s skin and made Colin laugh so hard he fell out of his chair and onto Millicent’s shoulder.\nBut there was writing on the wall in dripping red paint; the roosters were strangled one by one. The Chamber was opened and Harry found himself spat at in the halls–- but that was hardly the worst of it.\nHermione was saved by a mirror around a corner; Colin by his camera lens. Harry sat in the infirmary, shoulders hunched, hands twisting in his lap, until Madame Pomfrey kicked him out. He left candy by each of their beds; Millicent read aloud to each of them in a low voice (for Colin, his worn copy of The Hobbit, taken from the shelf by his four poster; class reading assignments for Hermione) and it was Millicent that found the torn page clenched tight in Hermione’s petrified hand.\nWhen they went down to the Chamber, Gilderoy tagging uselessly along, it was Harry and Millicent and Luna; if Colin hadn’t been already petrified, they would have locked him in a broom closet somewhere, for the crime of being too small and too breakable.\nBut there was also Ron Weasley, who had spotted them slipping away and thought to follow the Heir and his evil minions down to where his baby sister was being kept.\nRon caught up with them when they were opening the passage in the girls’ bathroom, his wand out, furious and desperate– Gilderoy yelped, but Millicent slammed the door shut behind him while Harry grabbed Ron’s gangly forearm.\n“We’re going to save Ginevra, stupid,” said Millicent, eyeing Ron’s taped-up wand dubiously.\n“I just saw him hissing and then the plumbing moved!” Ron said.\n“Harry’s the Heir of something, probably,” said Luna, calmly. Her wand was stuck in her bun. “But we’re here to help.” She drew a spare pair of spectacles out of her pocket and handed them to Ron– she had Transfigured a set for each of them, the glass lenses turned to camera lenses, so that the basilisk could only petrify and not kill them.\nThey found Ginny limp on the Chamber floor and Tom Riddle dramatic and cruel, smiling. Harry and Tom were mirrors in this world more than they had been in any other: Orphan boys, lost and bitter, left and lonely– dark-haired, clever Parseltongues with thirsts to prove themselves.\nBut this had always been their difference, between Tom Riddle and the boy he had scarred: Harry cared. There had been a boy in an orphanage who had smiled to think of scaring other children mad. There had been a boy under the stairs who’d spoken to snakes in cages and wished them free.\nHere on the cold Chamber floor, Tom stood, stealing life from a single broken girl. Harry had the shield spells Hermione had taught him quick on his tongue. He had Millicent at one shoulder and Luna at the other, wands out, eyes bright. This was always Tom’s downfall– he forgot that Slytherin was about more than ambition.\nFawkes came shrieking down to blind the basilisk; it was Ron who tore Gryffindor’s sword out of the Hat, but Millicent who took the dropped blade and killed the snake. Fawkes cried the poison out of Harry, who had played noble sacrifice and distraction. Luna plucked the basilisk fang out of the dead snake’s head and drove it home in the diary’s bloated pages.\nFawkes flew them up out of the Chamber in two trips. Ron carried his baby sister, and when he landed back on solid ground he reached out and shook Harry’s hand. “You’re an okay one,” Ron said. “Sorry I thought you were evil.”\n“It happens a surprising lot,” said Harry and shook back.\nThat next summer went rockily too–- Aunt Marge, the Knight Bus, a stressed Minister in Diagon Alley. The last few weeks were the easiest Harry had ever slept– no Dursleys, no dormmates, just doors that locked from the inside and ice cream sundaes for lunch.\nWhen Harry got on the Express, though, in a loud compartment stuffed with Luna, Colin, Millicent, and Hermione, the dementors came. Luna’s breath whistled out in ice crystals. Harry went down and then Colin did too before Lupin, who had slept through all their chatter, leapt to his feet with a quick Patronus.\nLupin and Hermione hovered over Harry while an awoken, chocolate-nibbling Colin found a new first year shivering in the hall. “I was just coming back from the bathroom,” she wailed and he ushered her inside the compartment to get some chocolate for herself. Millicent took one look at the shivering first year and plopped her cat down in the girl’s lap, where the feline curled up and went to sleep.\n“Astoria Greengrass,” said the first year, chocolate-smeared and no longer shaking.\nColin’s face fell. “You look like Daphne,” Millicent said.\nDraco mocked Harry for fainting on the train–- he mocked him from down the Slytherin table (Pansy laughed, the sound meant to carry, to be wounding), in the Common Room while Harry chewed over homework (Daphne snickered into her Potions essay), at night in the dormitory (Crabbe and Goyle guffawed, an ugly chorus).\nBut that was nothing new–- Harry had had nightmares for years, and Draco had laughed at every one of them he had noticed. All the same Millicent slipped a Panic Attack Potion into Draco’s pumpkin juice and calmly ignored Harry’s protests.\nAstoria Greengrass sat with them her first breakfast at Hogwarts, dropped her bony little eleven year old butt down beside Harry and beamed out at all of them.\nMillicent leaned across the table and said, “I feel like we should explain something. We–-” Her hand wave took in Colin, so small still that even his silverware looked a bit oversized, and Harry. “–-are not the safest kids to sit with here. Your sister’s, oh, middling on the social ladder, and you have an in there–- why don’t you go sit with Daphne?”\n“Can you pass the juice?” said Astoria. Colin stood on the bench to pass it to her. “You’re the ones who picked me off the floor of the train, when you didn’t have to. Sounds like a safe place to me.”\n“Well,” said Colin, still squeaky, puffing his chest out. “We do our best.”\n“I tried,” Millicent sighed, and pushed the toast across the table toward Astoria. \nThat year, Colin studied with Astoria, their green and silver scarves wrapped round and round their heads to muffle the shouting matches in the Slytherin common room that year about Buckbeak.\n“Did you see what that beast did to Draco?” Pansy shrieked.\n“Did you see how he baited it?” Harry hollered back. “Do you realize what he’s trying to do to it?”\nMillicent finally yanked him away and dropped Harry on a couch. “You want to do something helpful, go ask Hermione what to do.”\nAstoria and Colin snuck candy back from Hogsmeade for Harry. Hermione and Millicent stared in equivalent eagle-eyed disapproval when the Weasley twins slipped Harry the Map. He did not have the Cloak, so he just wore an oversized hat and borrowed some of Luna’s blue-hemmed robes to hide in.\nDumbledore had not yet given Harry his father’s legacy, the first and last Hallow. Albus had been concerned about such a thing in the hands of a boy who had chosen the House of power and ambition.\nThe Weasley twins, the Map in hand, were less concerned–- they had just seen a boy, trapped, and given him a way out.\nHarry still flew in his every free moment, and a few moments when he should have been studying, but he didn’t have the Quidditch team to worry about. Oliver Wood, who sometimes caught sight of the boy doing loops and dives alone, was both furious and grateful that his team did not have to compete against him.\nHarry was still determined, however, to not have his world go black every time a dementor stepped near. He tracked down Lupin, who had saved them on the train, and asked for lessons.\nLupin hesitated over the green of him–- the hem on his robes, the color in the scarf wrapped around his neck; the eyes he’d inherited from his mother. Green–- the youth of him, this weedy boy with his scraped knees. Remus had been so young, once, and a boy with hair just as messy had broken every rule he could get his hands on just to make his friends smile.\n“It’s a difficult spell,” said Lupin, but he started searching around for a boggart. In this world too, Harry’s greatest fear was terror itself. It was what everything else came back to.\nAt the end of the year, it was Colin who found Scabbers cowering in a milk jug– he and Harry were over for tea, to console Hagrid. (Millicent was up at the castle with Luna, consoling a furious Hermione to keep her from going and murdering Draco outright over Buckbeak.)\nColin had barely met Ron Weasley, but he had heard Hermione crow primly about chess victories and listened to her snap and sniffle angrily about Ron’s rat and her innocent, innocent cat–so when he saw Scabbers and his missing toe, Colin snatched him up and bundled him up in his loose robe.\nIt was Colin who was snatched, and Colin whose leg was broken, dragged down a hole under the Whomping Willow by a great black beast. It was Harry (always Harry) who went running after.\nThe story went much the same. Colin was pale on the bed, but tried his best to lever himself up and put his body between Harry and Black. He still only came up to Harry’s collarbone. His glare was an earnest approximation of Millicent’s best.\nBlack rasped and Harry shouted and in the end the truth came out– Scabbers twisting and transforming, Peter begging, and Harry telling Sirius and Remus that James would never have wanted them to become murderers.\n(This was different: Sirius’s hackles rising in horror when he first spotted the green trim on Harry’s robe.)\nThe Map had passed into Harry’s hands, again, and then out of them, so Lupin had come, then Snape. The moon rose, Peter ran, and the dementors came.\nHermione came to visit them in the infirmary, her Time Turner tucked under her clothes, Dumbledore’s advice (“three turns, I think”) ringing in her ears. Two innocent lives were saved that night.\nSirius would always love the hints of James in Harry’s messy hair, the same way that Snape would always hate them.\nBut this, too: Sirius would have to learn to love Harry, who did not wear his father’s colors. That stubborn, brave man would have to learn to love his godson’s drive and loyalty and the sharp grin he’d polished by growing up in a place where people salivated over what he could be and hated what he was.\n“Have you ever read Lord of the Rings?” said Colin, when they were warm and dry days later, taking the Express back to the real world. Millicent was perplexed but Hermione and Harry had both been raised Muggle. “I think it’s like Gollum,” said Colin. “Your mercies come back to you, in the end.” \n“That only happens in stories,” said Hermione and Colin shrugged.\nThe Death Eaters came to the World Cup that next summer and stopped the celebrations in their tracks. Tents were burning, people shouting, but for long minutes all Harry could think was this: they were wearing his colors.\nThere was a Muggle family strewn skyward. Tents burned. Neither of the Creevey brothers or Harry recognized the Mark drawn in the sky, but Hermione had done her reading. Harry grabbed Colin and Hermione grabbed Dennis and they ran, and ran.\nWhen Harry got back to the Slytherin dungeons that year, he shuddered at the cold stone of it. Even in the worst, last heats of September, or the first hot days of June, the Slytherin Common Room was always cool. Harry thought about the hoods and masks at the Cup, and he wondered if they had been cool under there, calm and collected, smirking, none of the horror of it touching them.\nDraco stepped into the Common Room, chin high, smirk wide, Crabbe and Goyle snickering shadows behind him. Harry might have punched the grin right off his face, leftover adrenaline still humming in him, but Millicent called his name.\nShe was sitting curled up in one of the armchairs, toes pressing into the fabric. Her cat was flopping herself across her textbook pages, shedding and stretching, mewing pitifully for attention. Harry stepped toward her, leaving Malfoy to his smirks.\nThere were things here worth the cold. The carpet was plush under his feet. Millicent was trying not to smile, pretending she wasn’t pleased to see him. The lake pressed close in to the walls of the Common Room, dark and heavy, full of thriving, blooming life, holding the stones close like enfolding arms.\nWhen Harry’s name came out of the Goblet of Fire that year, Colin’s wild applause was only joined by his little brother’s, across the Hall. Millicent shushed Colin and Hannah Abbott shushed Dennis. Harry dragged himself to his feet and slunk uncertainly across the hall, dozens of stares cutting into his shoulder blades. What else would you expect of a Slytherin but trickery like this?\nBut inside the little, shuttered heart of Draco Malfoy, cogs were turning. Harry Potter was a snivelling, irritating mouth-breathing Muggle-lover–- but this was also Slytherin’s chance.\nThe evening after the Goblet spat out Harry’s name, Draco cornered Harry in the Common Room and drew his wand–- Harry almost knocked it out of his hand.\n“Aw, twitchy, Potter?” said Draco. “Afraid?”\n“Really reasonably wary,” said Harry. Colin had tiptoed up behind Draco, ready to stick a leg out for him to stumble over if Harry wanted to shove him away.\n“I’m not going to curse you, Merlin’s beard,” said Draco. “I just want to teach you some spells.”\n“By… cursing me with them?”\n“No, for the Tournament,” said Draco. “We can’t let Hufflepuff beat us.”\n“I quite like Cedric actually. Good champion material.”\nDraco made a disgusted sound. “Fine. But you don’t want to die in that arena do you? And people do die in the Tournament; it’s wicked. You don’t want to die and I want Slytherin to win this, so stop whining and say thank you, Potter.”\nHe didn’t say thank you, but Draco taught him the hexes and shields and disguises he’d learned in his father’s study on long sunny afternoons. Harry kept waiting for a hex to hit him from behind, but one never did. When Draco snapped, sometimes, he sounded like Lucius–- when he snapped, Harry raised both eyebrows as far as they could go and waited for Draco to grumble, retreat, and get back to the lesson.\nHermione shrilled and bickered at Ron, who was disgusted with the sneaky little Slytherin cheating the Goblet–- but it was Millicent who convinced him. She grabbed Ron’s complaining shoulder, pinned him to a wall, and glowered down at him. “Harry didn’t,” Millicent said. “Harry wouldn’t–- he gets stared and spat at enough, don’t you think?” Her creasing brows told Ron he probably wouldn’t like it if he did anything other than say yes, he did think so.\nHagrid didn’t think much of Slytherin, but he loved James and Lily’s son, so Harry heard about the dragons early (and because he was Harry, Cedric heard about them too) (Draco stared in dubious disapproval when Harry told him he’d given vital game intel to an opponent).\nHermione set up research triage in the library, Colin, Dennis, and Astoria playing distractible research assistants while Millicent drilled Harry through useful spells. Luna breezed in and breezed out, giving Harry heartfelt advice on dragons that he decided very firmly not to take. He doubted perfume of peppermint or a ukelele was likely to help anyone at all.\nAt the first task, Astoria crammed a green and silver beanie on Daphne’s dubious head and dragged her big sister to the seats with the best view. When one of Madame Hooch’s spare brooms hurtled, whistling and jerky, to Harry’s hand in the arena– when Harry took off just in advance of cranky dragon fire– Astoria saw Daphne screaming excitement and support, and pretended smugly not to notice. Beside Daphne and Draco, who was equally on the edge of his seat, Pansy Parkinson sat back, rolled her eyes, and checked the blunt edges of her painted nails.\nWhen Hermione rounded them up for research nights on the second task and the pesky golden egg, Ron joined them, too. “She bet me an evening of helping her with this stuff for every game of chess she wins,” Ron explained, poking through a book on water spells.\n“Did you lose a lot of chess?” said Millicent.\n“No!” Ron said instantly, then flushed. “It’s just, you know, it’s not half bad, with you lot, so I’ve just kept on showing up.” He poked at the book again. “Common Room’s boring anyway. Seamas’s no good at chess.”\nThere was no Neville to point Harry to gillyweed–- but Millicent’s mother was a gardener and Hermione was very good at breaking into even Snape’s cupboards. They pressed the gillyweed into Harry’s hands, and then he found them both under the water the next day.\nKrum rescued Hermione, and Harry again brought Fleur Delacour’s little sister back to the surface. But he waited there, lingered in the cold depths for Fleur to come, for long minutes. Water rushed in and out of gills he was borrowing. Millicent floated there, cold and stiff, eyes closed, and Harry shivered and shivered and pretended it was the cold.\nHe had almost died so many times in his life already–- in a cradle under a flash of green light; basilisk poison on a cold, wet floor; dementors’ bony hands gripping his chin. But these were the things his nightmares were made of: his mother’s eyes. Hermione knocked aside, thrown down like a rag doll, by the giant stone queen. Colin’s fragile wrists, his lack of balance, the way he followed behind them anyway. And here–- Millicent’s face gone slack, adrift in cold water–- her brows finally unfurled, no hint of a temper simmering, no suggestion of a smile beneath it.\nWhen Harry finally cut both their ties and shot for the surface, it got warmer and warmer. He still didn’t fully manage to catch his breath until he heard Millicent hack, spit, and inhale beside him.\nAstoria was too young to attend the Yule Ball without an older date, so she badgered Ron into taking her, and then snuck little Colin and Luna in the back door. Krum, to the surprise of everyone except Millicent, took Hermione. Harry took Millicent.\nThe girls came downstairs together, bumping shoulders. Hermione had her chin up but Millicent was more shy than Harry had ever seen her. Hermione’s hair all fell in a smooth river down her back.\nMillicent was splendid and elegant in a dark green, her hair curled, her cheeks dimpled, every angle on her rounded and soft. When she saw Harry grinning up at her, Millicent managed to hold a scowl for a good half minute before she couldn’t stop a smile.\nHarry couldn’t do the lift portions of the dances quite as high as Krum could with Hermione, but when Pansy tried to comment on it Luna spilled her drink all down Pansy’s front and smiled. Harry spun Millicent around the dance floor on tip toe and her skirts flared out, spun with her.\nAstoria danced her way though every good boy in the school, and a few bad ones. After a few Muggleborn kids had stepped on her toes, Astoria looked around for someone who would know the steps and found Draco Malfoy offering his hand. They had danced at fine balls all through her childhood, so Astoria stepped out onto the floor with him. It was pleasant until Draco said something sneering about Hagrid; then Astoria stepped on his toes because she knew he was too well-bred to do anything about it.\n“Have you ever thought about not being awful?” Astoria asked.\n“You don’t understand,” said Draco stiffly.\n“Draco Malfoy,” said Astoria sternly, all of thirteen years old and magnanimous with it. “I am a Greengrass. I know what it’s like to be raised to think you’re better than everyone else–- to be raised to be hateful but with poise.”\nHe blinked down at her.\n“You’ve got more ugly things to unlearn than most,” she said. “That just means you better get started, numbskull.”\n“But it’s–-” He wet his lips, shaking his head. “My father will see it as–- I can’t…”\n“Think about it as pulling the old folk into the light,” she said. “They’ll kick and scream a bit, but hey, that’s the fun part.” Astoria dropped his hands as the song ended, brushing off her robes, and said more gently, “Don’t think about what they want, Draco–- what he wants. Think. Who do you want to be?”\nAcross the dance floor, Millicent was dancing with Colin, lifting the kid so high in the air his feet went swinging wildly, endangering their neighbors. Astoria went to join them.\nFor the third task, Amos Diggory came to shout support for Cedric, but Molly Weasley showed up to cheer for Harry. The Potter supporters were an odd group, smaller than Cedric’s, but Luna had build a giant hat in the shape of a snake gnawing on a dragon carcass. Little Dennis Creevey was one of their few Hufflepuffs, though Susan Bones, who tutored Dennis in Charms, came over now and then to say hello. Draco stood off to one side, caught between bated breath and desperately trying to look cool anyway; Astoria screamed cheerfully beside him.\nIn the stands Molly passed out sweaters and knitted blankets and tutted over Ginny. Ron caught Draco staring, so Draco quickly turned it into a superior smirk.\n“Yeah, so she’s nice in public, but what’s she like when no one’s watching?” Draco sneered.\n“Pretty much just like that,” said Ron. “Sometimes she yells, if we’ve stolen Dad’s flying car for a joyride or something.” He shrugged and Draco huddled in his jacket, unsettled.  \nThe maze wasn’t much for spectators, but in the center of it two Hogwarts boys found the victorious Cup. In the spirit of fairness, they both grabbed the Cup at the same time. Fairness was a tenet of one their houses–- ambition was the tenet of the other. Consider this though: the shapes ambition takes.\nThere was more to this than a Cup, a bag of Galleons, a victory lap. The things Harry wanted most were about who he wanted to be. Harry would rather, every time, to win the friendship of a boy like Cedric Diggory than to win a glory and his name carved in gold.\nBut this was not fair. There was no victory here. They landed breathless in a graveyard, wands out, children playing a game. They were thrust into a war that had been simmering under the surface for years. When Pettigrew raised his wand–- a green flash, a cold laugh–- Harry thought about Colin on the Hogwarts Express, talking about how your mercies come back to you.\nIn the graveyard, James Potter’s old friend Peter killed Cedric in cold blood. Voldemort grabbed Harry’s chin with bony fingers. Tom Riddle had been the last person to see Lily Potter’s eyes alive, but he did not tell Harry he had his mother’s eyes. He did not care about the parts of his victims that had managed to survive. (He should have.)\nIn the graveyard, there was a circle of hooded figures, rustling and cruel. One of them had Draco’s father’s voice, the way the boy snapped when he forgot himself. Harry had been waiting for Draco’s endgame to hit and this, here– Cedric cooling on the dry grass, cold slipping down Harry’s spine, his arm bleeding onto the dead earth–- this must be the end of it.\nBut the remnants–- all the parts of his victims Tom did not care about–- they swarmed close, plotted, whispered, smiled. Harry carried Cedric’s body back to the overgrown Quidditch pitch. Harry was small, still, though far from Colin’s size. Cedric was too big a burden. Whatever size, whatever age or strength Harry could have had–- Cedric was too heavy a burden.\nHarry fell down to his knees beside him, amid that shocked-silent crowd, and he didn’t remember ever rising to his feet. He didn’t remember when the shouting started, though he knew it must have. No, just this–- Millicent’s hands on his shoulders, Hermione’s voice ringing out, Colin slipping under one arm to help hold him up.\nAt the funeral, Dumbledore talked about the choice between what was right and what was easy. Harry wondered if Dumbledore really thought Cedric had had any choice in the matter at all. \nHarry didn’t get any news, all that long summer. Dumbledore had been uncertain of a Harry in red and gold–- what about this one, who had been so competitive in the Triwizard Tournament, who had once set a snake on a boy in Dueling Club? Harry got into scuffles in the hallways on the regular. He had such obvious rage simmering under his skin.\nBut a dementor came to Privet Drive, so Harry was gathered up, summoned, and taken to the Order. Mad-Eye Moody made some sniffing noises about Harry’s House but bright-haired Tonks stepped in, smacking Moody in the shoulder in a way that made Harry homesick for Millicent. “Watch that,” said Tonks. “My mom was in Slytherin.”\nHermione, Luna, and Colin were already at 13 Grimmauld Place and all of them let Harry yell and stomp when he got there, their shoulders bowed. Tonks entertained them at mealtimes, turning her nose to a hundred shapes. Ginny Weasley fell over, laughing, and Harry fiercely wanted Astoria to be with them, because Tonks was just her kind of humor.\n“Oh you poor thing,” Molly Weasley had said the first time she properly met Colin. He had still not hit any growth spurts.\nLike Hermione and Luna, he had been invited to the Order’s headquarters, despite his House colors. Kingsley and Andromeda, after all, had been Slytherins back in their day, and they had turned out alright; and Colin’s little brother was a Hufflepuff of all things.  \n“What for?” Colin asked, chewing his way through a treacle. Hermione eyed him critically and pushed a napkin at him.\n“A little one of your sort, put in Slytherin?” Molly shivered.\n“But Harry’s in Slytherin, too,” said Colin, taking the napkin. “And Millicent, and Astoria. I’m in Slytherin,” he said and Molly closed her mouth thoughtfully.\nThey cleaned house for days. Ginny disappeared with Luna to go exploring the worst, back rooms. Harry winced every time Mrs. Black shouted from her portrait and missed Millicent, who would have given as good as she got and made Colin cramp from laughing in the process.  Instead, Harry just listened to Hermione made put-upon little noises and try to make kindly conversation with Kreacher. Colin followed Sirius around, eyes wide and hero-worshipful, to Hermione and Molly’s joint disapproval.\nThe moment Harry stepped foot back on Hogwarts ground, Astoria slammed into him. “I kept hearing things from my parents about dementors and expulsions,” she said shrilly. Astoria’d had a growth spurt over the summer, her limbs all gone gangly and her nose pimply. “We were getting ready to storm the Ministry.” \nMillicent stood a step back, behind her, arms crossed. Millicent was too Slytherin to be invited to Order of the Pheonix pow-wows, and not pure enough to be invited to the quiet, opulent parties Lucius Malfoy and others had thrown that summer– Astoria had been, splendid in silver and topaz, and Daphne had had to stomp on her little sister’s toes almost constantly in a silent plea for her to keep her mouth shut.\nHarry looked over Astoria’s newly-tall shoulder at Millicent. “Somehow that doesn’t surprise me at all,” Harry said and Millicent smiled, stepped forward, and smacked his shoulder.\n“That’s for making us worry,” Millicent said, and then went to go say hello to Hermione.\nDumbledore’s Army, again, was Hermione Granger’s idea. She dragged a protesting Harry down to the Hog’s Head. The turn-out was a trifle smaller than it would have been for a Harry without green on his robes, even if you counted the Slytherins who came in on his heels. Astoria went cheerfully over to sit with Luna and Ginny while Millicent made gloweringly sure to stand between Colin and the Gryffindors.\n“Of course he knows curses,” Ernie Macmillion muttered as Hermione began her pitch.\n“Heir of Slytherin,” someone else whispered, because that still hadn’t died.\nMillicent flushed red, but Harry leaned forward, grinning, and didn’t deny a thing. “Aren’t you glad I’m on your side, then?”\n“Who says you are?” Zacharias Smith said.\n“I do,” said Hermione. Ron nodded, Luna smiled, Millicent crossed her arms and glared.\nSusan Bones, who had once seen a furious twelve year old Harry go after a Slytherin twice his size for bothering her, said, “He’s alright, Zach.”\nThe Hufflepuffs were unsure about Harry, but Dennis Creevey bounced so easily on Harry’s coattails. The Gryffindors were unsure about Harry–- he cheered for the wrong team in Quidditch, and Granger and Weasley were sort of a weird pair anyway. The Ravenclaws were unsure about Harry; they were unsure about Luna, too. But Cho had seen Harry give Cedric clues and answers during the Tournament when he didn’t have to, so she stepped forward and signed her name to Hermione’s list. \nThe DA met in the Room of Requirement, once they’d found it. Harry still slept at night with spells and protections up around his four poster, in the room he shared with Crabbe, Goyle, Malfoy, and Zabini. After a year of spell training in the Common Room, Draco and Harry were now not on speaking terms. Harry still had Lucius’s cold syllables ringing in his ears, the weight of Cedric’s body heavy in his hands. Harry could not imagine an innocent Draco here. A few months into school, Draco joined the Inquisitorial Squad, sullen and righteously shunned, and that didn’t help either.\nWhenever Susan Bones in the DA said, “My auntie Amelia says–” Harry thought of Draco and his father. But Amelia Bones had taught her niece about justice, about paying attention and moving deliberately through the world, about judicial hijinks and what it meant to stand in the spirit of the law. Susan used a lot of big words; Hermione understood most of them. \nDA in this world stood for Defense Association. Harry Potter wrote I must not tell lies on the back of his hand, over and over, and smiled at Umbridge when he was done. Someone said in front of Astoria that Umbridge looked like a grown-up Millicent, and Astoria got three weeks detention for punching them in the jaw. “I don’t like pink, anyway,” said Millicent, who had dragged Astoria out of the brawl with Harry.\nNeville Longbottom was the first of the DA to come sit with Harry’s crew at breakfast. He’d grown, too, over the summer, though he still settled down hesitantly, brow furrowed. Harry looked at him, past the furrowed brow, to how Neville set down his orange juice firmly and ignored any stares from other tables–- he looked at Neville and wondered how they’d never snatched him up before, this brave young man from a brave House who no one yet believed belonged there.\nHannah Abbott and Ernie Macmillian were Hufflepuff prefects that year; they sat at the Hufflepuff table and kept careful eyes on the first years. But they would wander over with their buttered toasts and look over Neville’s shoulder and the top of Colin’s tousled head.\nThe breakfast meetings were meant for plans of resistance against Umbridge, for the construction of inside jokes, for sitting with people you knew would have your back. Anthony Goldstein came over from the Ravenclaw table. Cho and Marietta never sat with them, but Luna breezed in and out, leaning on Astoria’s shoulder and stealing Ginny’s fried potatoes one by one.\nHarry had bad dreams all year–- green flashes of light, old Muggles eavesdropping on lethal things. He dreamed he attacked Arthur Weasley, who had squinted once at Harry’s House colors for five minutes and then shrugged and moved on. While Arthur was in the hospital, Harry tip-toed around Ron, who had taken to joining them in their study sessions in the library, until Ron cornered him by the history section and said, “It wasn’t you. C'mon, Potter, give me some credit for having brains. I’ve figured out you aren’t evil by now.” \nWhen Harry had the dream about Sirius, trapped in the Department of Mysteries, he believed it. He did not go to any teachers, because this was not a boy who had the luxury of trusting people to come save him. Dumbledore hadn’t talked to him in months. Harry called on the people he could trust to back him up. Luna got the thestrals. The rest of their study group got their wands. Hermione had taught them all shield spells well above their school level. Millicent had taught them her mother’s gardening hexes in the Room of Requirement.\nThey had a hissed, whispered fight with Colin. They had already sent Dennis back to Hufflepuff, where Susan Bones quite handily sat on him to keep him out of trouble.\nColin hissed protest, on the cool grass beside the thestrals, “I’m a year older than Astoria!”\n“She can’t come either,” Harry said.\n“Try to stop me,” said Astoria.\n“You’ve been fighting my fights since I was eleven years old,” said Colin. “It’s my turn to help out, too. And,” he said, grinning, a sharp thing Harry recognized from the mirror, “if I have learned something about throwing myself into things too big for me, it’s because I’ve been watching you.”\n“That was almost a compliment,” said Millicent as Luna helped Colin onto a thestral he couldn’t see, but Harry just felt guilty.\nHe would carry every injury they got in that fight– Colin’s twisted ankle (the same leg that Sirius had broken in Harry’s third year), Hermione’s broken nose, Luna’s broken fingers. He had led them into a trap, and they had followed.\nHarry only thought about the first half of that–the led and not the followed. It would take Millicent shoving him down on the couch the next year (and putting her cat in his lap to trap him there) before he understood: the choice to follow–to trust–was just as much of a choice as to lead.\n“You don’t get to carry that for us,” said Millicent, voice thick with offense. “Those’re ours to carry.”\nBut Sirius wasn’t around to carry his death on his own shoulders, so Harry carried it for him. Millicent tried to argue that out of him, too, but Harry clung stubbornly and dreamed of flashes of green light, of his godfather falling backward through the Veil. Harry wondered if his father would have been as able to love a son in green and silver as Sirius had been able to learn to love his godson.\nAfter the business in the Department of Mysteries, Lucius Malfoy and all the other captured Death Eaters were sent to Azkaban. Draco walked around like a ghost himself that next year, that sixth year, like he’d been taking lessons from the Bloody Baron–- scowling and hissing insults in the hallways. Harry improved the shield spells around his four poster.\nHarry improved the Silencing Spells, too, which he had put up after his fourth year. Dudley had taunted him for the whole summer between his fourth and fifth years, and Harry had been very uninterested in listening to Draco Malfoy sneer because Harry said Cedric’s name in his sleep. Now he had more names to say, and to carry.\nAstoria and Harry were invited to Slug Club that year; the rest of theirs were not. Dumbledore had again used Harry as dangling bait to get Slughorn to come to the school and teach. Harry enjoyed Potions more than he had any other year of school, though he didn’t improve very dramatically.\nIt was Neville instead who suddenly skyrocketed to the top of the class–- but so did every student around him. Neville passed out advice and stammering critique of the potion instructions like they didn’t cost him anything. Hermione scowled, the foundations of her world feeling unsteady, until Millicent elbowed her out of it and told her to just take notes on his brewing techniques.\nHermione spent a lot of time in the library with Millicent and her cat that year. Millicent moved the cat from lap to lap– Harry’s on the sad days, Colin’s when he was freaking out about the OWLs coming for him at the end of the year, and Hermione’s when Ron was being a particular butt-head. “She calls him Won-won! And he lets her!” Hermione said, impotent with fury, and Millicent hummed sympathetically and kept working on her Charms homework.\nOn long afternoons, as summer drew closer, they would go out and lie on the lawn by the lake. Colin was trying to do a photo series on the Giant Squid, and Harry and Millicent took turns making sure he didn’t fall into the Lake.  \n“Do you ever wish you hadn’t gotten Slytherin?” Luna asked once. Astoria rolled over to look at her. Millicent was with them, but she was passed out on the cool grass, snoring slightly. “You’re brave, Astoria,” said Luna without looking over at her.\nAstoria kept on looking at Luna, her wide cheekbones and her eyes chasing the clouds across the sky. “I am brave,” Astoria said. “I am honest to the point of injury. I am loyal. I work hard and I don’t cut corners. I am clever, smart, and curious and I have read just as many books as you, Luna.”\n“More,” said Luna calmly. “I know.”\n“But this is what I wanted,” said Astoria. “Resourcefulness, drive, and–- but if you know, Luna, why are you asking?”\n“I’m making a point,” she said.\n“To who?”\n“Me,” Luna said. “Oh look! That one looks like a sea serpent.”\nAstoria turned to look up at the cloud. It didn’t look like a sea serpent, unless the sea serpent had eaten a few pirate ships lately and was having some nasty indigestion.\nDumbledore hesitated long and quietly over telling Harry about the Horcruxes. Harry looked so much like Tom, down to the House colors, down to the way he looked too old for his age. Dumbledore quite liked young Ms. Granger, but whenever he looked at the scowling young Ms. Bulstrode his first instinct was to think Bellatrix.\nAll the same, a prophecy was a prophecy–- and maybe this was what it came to. Maybe Harry needed to stand this close to Voldemort’s shadow to find a way to defeat him. “He has his mother’s eyes,” Albus reminded himself, and called Harry into his office.\nHe told Harry not to pass tales to the other students, but here was a place Harry and Tom Riddle were truly, deeply similar–- Harry had absolutely no problem with lying to Albus Dumbledore. “No, sir,” he said. “Of course not.”\nDumbledore took him to the rocky island where Voldemort had hidden the locket (and where Regulus Black had found it). The Gaunt ring had already sent death to linger in Dumbledore’s veins, so Albus drank down the locket’s curses and Harry got to watch. He thought of Dudley stuffing himself on birthday cake. He thought of Hermione and Colin lying cold, petrified, in the infirmary, and Madame Pomfrey dribbling fluids into them.\nWhen they got back to Hogwarts, the boy who lived and the dead man who was not yet dead, the Death Eaters were already there. Draco was already wringing his hands, like he’d been wringing them all year–- and Harry would curse himself for ages for not seeing that earlier.\nDraco couldn’t do it; and Harry couldn’t draw breath to sneer at him or to applaud him for that. Dumbledore begged, and Snape answered him.\nHarry would have chased down Snape, screaming about cowards, but when he hit the ground floor he found Millicent. She grabbed his shoulder and dragged him with her–- they had more important work to do than to go shouting after a man who knew exactly what he was.\nAstoria and Luna fetched the Ravenclaws from their tower and the library. Colin and Dennis fetched the Hufflepuffs. Hermione and Ron got the Gryffindors. Harry and Millicent stood back to back, wands out, and did their best to survive a fight not meant for children. But they were barely children anymore. Even Colin had finally started to grow.\nAfter the fight, they found Draco coming, limping but uninjured, down from the Astronomy Tower. Millicent slammed him into the wall, looked him up and down contemptuously, and then dropped him and walked on with a shell-shocked Harry in tow.\nOthers were more willing to waste time on the traitor. Hermione had not yet sheathed her wand and her knuckles were white, wrapped around it. Astoria whipped up a storm, shrill, voice cracking– Dumbledore was on the cobblestones outside. There were burns on classroom walls from hexes, curses, and children were hiding scared in closets all over the castle.\n“He had my mother, Greengrass,” Draco hissed. “What was I supposed to do?”\nAstoria shrieked a long litany of things Draco could have done, but Ron stood beside her, quiet, his brow furrowing as fiercely as Millicent’s.\n“Fine,” said Ron. “We get them out then.”\n“What?” Draco and Astoria both whipped to stare at him.\n“We’re fighting a war and your parents and estate are materiel in it,” said Ron, his tone careless. “So we’re going to go get them out. Probably gonna ruin your house in the process, though, sorry.”\n“I’m not sorry,” said Astoria, chin high. Ron sighed and shooed her away.\nHermione looked steadily at Ron; he looked back and it could’ve been just them on a late night in the Gryffindor Common Room, studying each other over a chess board. “I’ll go, too,” Hermione said.\n“Those’re some big words, Weasley,” said Draco, then chewed over the rest of his words before he said them. “I thought you hated me.”\n“I do.” Ron shrugged. “For a lot of reasons, even. I hate you because you’re a Malfoy, and I’m a Weasley. I hate you because you hurt a lot of people this year– you got Dumbledore killed and nearly a lot of other people too. I also hate you because you’re a git, Malfoy.”\nDraco’s face had gone stonier and stonier.\n“But, you see,” said Ron. “I’m expecting you not to hate the people you were raised to hate, so I probably shouldn’t hate you just because my dad hates your dad. And this year– I’m not sure what I would have done if someone had my mother.”\n“And the git thing?”\n“Well. I suppose you probably can’t help it.”\n“And you?” Draco said to Hermione.\nHermione pointed a finger at him. “I haven’t forgiven you yet for Buckbeak, so don’t go fishing there.”\n“Hermione has a saving-people thing,” explained Ron.\n“Harry,” Hermione said, nettled. “Harry has a saving people thing.”\n“Harry has one, too,” said Ron amiably.  \nSupposedly there were classes to finish up, but they didn’t bother. They met in the Room of Requirement, all the kids who had risen to Harry’s call, and they made plans. Colin, Hermione, and Harry would all be unsafe at a Hogwarts under Voldemort’s control–- Ron likely would be in danger, too. Astoria had the right bloodlines but couldn’t hold her tongue.\nAstoria, Harry and Colin went after the Horcruxes. Colin brought his camera. Ron and Hermione took Draco to find his parents and remove at least one piece from Voldemort’s side. Millicent stayed in Hogwarts, to keep an eye on things there.\nColin tried to send Dennis home to their Muggle parents, but Dennis refused. He teamed up with Ginny Weasley, who was having similar scowling conversations with her older siblings, and offered to work for Lee Jordan’s clandestine radio station.\nGinny snatched up Luna, too–- Neville would run the Hogwarts resistance alone. Or not so alone–- Susan Bones would string up jerry-rigged Charms to guard all their hide-outs. Hannah Abbott would know every child’s name, every soldier’s, every enemy’s, and what they were afraid of. Anthony Goldstein would run the raids down to the kitchens and manage their resources–- food and bedding, but cursed objects and hidden rooms too. Millicent Bulstrode would set up a vast spy network using the paintings and the suits of armor.\nHarry kept Regulus’s note, from inside the fake locket. He folded it up and taped it to the back of the little book of pictures Hagrid had given him of his parents. This was Sirius’s little brother. These were the last words of an angry, certain, determined man, one who knew he was going to die. This was one of the first things that had ever made Harry feel proud of his House. \n(Millicent packed her things to go back to Hogwarts. Astoria had screaming matches with her parents when she told them she was leaving. There were so many reasons for Harry to be proud of his House.)\nThey went after the locket first–- Astoria walked right in the front door of the Ministry, smiling sweetly at old family friends, because it was summer and she had not yet been reported as delinquent for not reporting to Hogwarts. Colin stayed up late, after they’d warded their camps, practicing Stunning Hex after jinx in the dark. Harry wrapped his scarf around and around his head, like Colin had used to during arguments in the Common Room, and learned to sleep through it.\nAlecto and Amycus Carrow took over the halls of Hogwarts. Severus Snape moved quietly into the Headmaster’s office and every time she saw him Millicent had to bite her tongue so as not to spit at him. Millicent pet her cat in the Common Room, did the bare minimum on her classwork, and fed the hidden members of the DA news, scavenged supplies, and which kids needed protecting.\nDaphne Greengrass thought about her little sister and what she would do if she was here. Daphne chewed over that, for weeks. Her parents sent her no news of Astoria, but sometimes a DA kid would bump her elbow in the library and whisper something about someone having told someone that Astoria had been spotted in London. (Still breathing, still safe, still fighting the good fight, was the unspoken subtext).\nStudents started disappearing from the halls. A sparse few were taken, but most had just faded away to whatever bit of castle was hiding Neville Longbottom, Anthony Goldstein, and Susan Bones. They were missing from the Great Hall, but their presence was still clear from the traps they set for the new teachers and the way they’d appear during the more brutal detentions and break them up, ferret kids away.\nDaphne pulled Pansy into her four poster and threw up a Silencing Charm one afternoon, after Hannah Abbott had disappeared from their Dark Arts Class (she’d charged out, exchanging hexes and shrieked insults with Amycus Carrow; from his scowl that rest of the day, she had gotten away safe).\n“We have to help,” said Daphne and Pansy stared at her like she’d gone mad. “C'mon,” Daphne said. “You keep saying you’re bored, Pansy. At least this will be something interesting.”\nPansy sniffed.\n“Don’t tell me you’re scared,” Daphne said and Pansy finally dropped her textbook and turned furiously to her.\n“Of course I am,” she hissed. Daphne sat back and Pansy followed. “Have you seen them? Do you know what people like this do? To people like Creevey, and Potter? Creevey’s a squeaky kind of cute, fine, and Potter’s not as irritating as he could be–- but I don’t want to die for them, Daph.”\n“I don’t want to die at all,” said Daphne. “But I can’t just sit here.”\n“Why not?” said Pansy, slumping back.\n“Just something small, Parkinson. Just… keep your eyes open, okay? I’m not asking you to die for anyone.”\nPansy sniffed and went back to her book.\nThe next time a Death Eater’s sharp eye started to turn to one of the first years, Pansy knocked over a stack of textbooks, sending the whole mess crashing to the floor. “Oops,” she said, and the first year disappeared back into the crowd.\nDaphne bumped friendly shoulders with her, later on, and Pansy hissed, “What? I didn’t do anything.”\n“Of course you didn’t,” Daphne agreed with her friend, and laid a cheek on her shoulder. “Thank you.”\nMiles and miles away, Ron, Hermione, and Draco staked out Malfoy Manor, looking for weak spots and patterns.  \n“Are you sure they’re captives?” Ron whispered, watching Lucius and Narcissa eat scones with tea at a wide window looking over a mossy garden.\nDraco swallowed, pale and beaky. “Yeah,” he said. “No, look at her tea cup, she’s terrified. Look at her upper lip. Her shoulders.” They looked at Draco’s face instead, the worry and the chewed-on lip, and it was him they believed.\nIn the moments of peace or tense waiting, Ron and Hermione taught Draco not to lose so badly at chess. They watched for angles and they made a plan, these two chessmasters. They left Malfoy Manor a little burnt behind them, when they left, but it was with Ollivander, Dean Thomas, and Malfoy’s parents all in tow and no one on their tail.\nLucius thanked them, bewildered, and Narcissa thanked them, stiffly gracious. Draco saluted them as his father put a hand on his shoulder and Apparated them all away. “Good riddance,” said Hermione pleasantly, looking at the empty space that had once been occupied by Malfoys.\n“Aw, he was getting better at chess,” said Ron.\nRon and Hermione headed back to Hogwarts to shore up the defense there, picking up Luna, Ginny, and Dennis along the way. Things were coming to a head– the Horcruxes were falling one by one into Harry’s hands. Hermione and Ron discussed strategy–- it was the two of them who thought of the basilisk fangs still lying in the Chamber. It was Luna who found the diadem; sweet, tiny Dennis helped her talk the Grey Lady out of it.\nWhen Harry started heading back to Hogwarts, so did Voldemort. Voldemort’s forces swarmed on the castle–- werewolves and giants, Astoria’s cousins and Pansy’s parents’ dearest friends, and a Marauder. Harry’s forces gathered in the hidden places–- Neville’s young army, Lee Jordan’s radio agents, the Order of the Phoenix rejoined.\nHogwarts would be their final battleground, because wasn’t that what all of this was about? Children, and who they would grow to be. Colin had almost reached his full height, hovering a whole inch above Harry now. Astoria’s wand was quick to her hand, a thoughtless, breathless thing. \nIn the Slytherin Common Room, the night before the battle, Millicent Bulstrode got up on a table, hands on her hips, and hollered for attention. “You all have a choice to make,” she said. “I know you don’t think you have a choice here, but you do.”\nHeads peeked out of dormitories. Someone threw a quill at her. “You’re going to get us all in trouble.”\n“We are not the House of bigots,” said Millicent. In the back of the room, Goyle buffed his prefect’s badge and rolled his eyes. “We are the House of power, of cunning, and of standing by our own.”\n“Potter’s not one of ours.”\n“It doesn’t have to be about Harry. This is our home, too. I am going to fight for it,” said Millicent. “All the other Houses–- they might fight, they might run, but they are going to get asked. So I am asking you.”\n“To be brave?” someone sneered.\n“To be terrible,” said Millicent. “To be the worst thing they’ve ever seen. To dare them to ever again try to step onto our home ground. Hogwarts is ours and we’ve been walking around like frightened children this whole year. We are occupied ground and I am asking you to help me drive the invaders out.” She looked around, from face to face. “You don’t get Sorted Slytherin because you are powerful,” said Millicent. “You get put here because you want to be powerful. Who do you want to be?”\nWhen Millicent left that night, before the Carrows could come to collect her on their informants’ word, Daphne Greengrass went with her. So did a handful of others. Pansy Parkinson laid in her four poster all night, sleepless, staring up at nothing.\nThe battle broke out the next morning–- in the Great Hall, the Carrows demanded that the student body give up Harry Potter and his minions.\nNo sound came from Slytherin House.\nPansy balled up her fists and pressed them to her mouth, closed her eyes and squeezed them shut. They had demanded Harry Potter and she did not offer him up. She did not step forward to refuse, either–- Gryffindors were telling Amycus they’d have to take them first. Hufflepuffs were forming a wall. Ravenclaws were reaching for wands. Pansy pressed her hands over her mouth. Little things. Small steps. She slipped out the back of the crowd.\nThere were Death Eaters in the halls–- some of them had been teachers, that whole year. Some of them had changed Pansy’s diapers. There were children popping out of the woodwork who Pansy had not seen for months. They had been living in the walls and hidden corners, and now they were stepping out to die in the open.\nPansy ran. She was seventeen years old, and if someone had shouted after her “coward” she would have agreed, unashamed, trembling, proud.\nBut she whirled around a corner near the Library, looking for someplace to wait out the war, and ran into Daphne Greengrass.\nThis cannot be outrun. Life cannot be waited out. It scars the earth. If you think you can run, it’s because this hasn’t touched you yet. Wait. Listen for it. It will come.\nDaphne had her wand out. She was fighting someone Pansy didn’t know– though Daphne’s opponent had shoes so nice they could have been her father’s, polished leather and shining metal. His wandwork hacked into Daphne’s defense–- some Hufflepuff kid whose name Pansy had never bothered learning was huddled behind her, injured.\nPansy drew her wand and met the war.\nAcross the castle, Daphne’s little sister Astoria was checking Luna for injury. Colin Creevey was arguing Dennis towards the makeshift infirmary in the Great Hall, like Harry and Millicent had once argued with Colin about him going with them to the Department of Mysteries.\nHarry moved through a crowd of students and teachers, flinching when they stepped too close, trying to smile. He was best able to shake the DA’s hands, clap their shoulders, ask after them, but Harry had lived too long in the unfriendly air of his dormitory. He had lived too long in Hogwarts, where people looked at the green on his robes and thought they knew him.\nBut Luna bumped one of his elbows. Hermione flitted past, arguing strategy with Ron and Neville and Susan. Millicent stepped into the Hall, already bruised, already bleeding from a cut on the arm, and walked straight to Harry without bothering to see who got in her way. “Stop gawping,” she said. “Get your wand out, Potter, and don’t stick it up anyone’s nose please.”\nThe Great Hall was their home base, their last defense, but every hallway in the school saw some hint of violence. Fred Weasley died in a corridor with his brother Percy. There would be a plaque, years later, which would squirt blue ink at people who touched it, or give up playful shocks, depending on its mood. But for now it just held Percy whipping his wand at the man who killed his little brother.\nHermione led the charge out the east hall; Ron led the one from the south and Neville coordinated from the Hall. Astoria found Daphne and Pansy in the halls, all three wands drawn. Dennis Creevey snuck into the back of Hermione’s army, so he was there in the main courtyard to see a curse hit Colin square in the back.\nDennis made a sound, but no one heard him. He was alone in the middle of it all–- lights and colors cracking through the air, spells spat and hacked back and forth. There was a small boy standing there looking at his big brother fail to get up off the ground.\nHarry and Millicent were in the same courtyard, fighting, but they didn’t see Colin die. Neville would find them later, and tell them. Millicent would grab Harry’s shoulder, the way she had been doing for years–- to tease him, to drag him places, to make him sit down for once–- but this time it would be so that she would have something to hold onto.\nWhen the fighting paused for breath, they took their wounded back to the Hall, the ones they could find. They took their dead. Harry saw Mrs. Weasley standing over Fred and didn’t go over to her. His hands were shaking and he didn’t know what possible comfort he could give.\nThe Hall was a mess of activity and odd pockets of silence. Harry and Millicent stood in one, her fingers digging into his shoulder, his knobbly knees poking into hers. There was no one standing, weeping, over Tonks and Lupin. Harry could have fixed that, but if he started crying he wasn’t sure he’d be able to stop. Better to keep floating here, breathing, functional, and to not think about how much he’d been looking forward to introducing Astoria to Tonks.\nThe fight went on. Harry found out about Snape, about the Horcrux living in his bones. He did not go to hug Astoria, who was leaning on Daphne’s shoulder. He did not go find Luna, or Ginny, or Hermione, who was eyebrows deep in plans. He did not go to find Millicent, who would have seen right through him. He could not go find Colin. He slipped out the back of the Hall.\nDumbledore had not given him the Stone as an inheritance. Harry did not even have the Cloak. Draco, who was watching fear fall slowly away from his mother’s shoulders in a villa out in south Italy, was still the unknowing master of the Elder Wand.\nHarry was not a master of Death in this world. He was just a boy prepared to die. He walked alone down through the leaning trees and out to the clearing where Tom Riddle was waiting to kill him. He could not call on his parents’ shades to wish him well. He had no Stone to summon Colin and Fred so that he could say good-bye.\nBut he said good-bye there, anyway, under the darkening leaves. He said thank you. Fred had given him the Map. Colin had grown tall. They had fought because there were some things worth dying for, and Harry could do no less.\nHe walked into that clearing with no ghosts at his shoulders, but with all their memories–- Lupin’s pockets full of chocolate, Tonks making Ginny wheeze with laughter.\nHe remembered Fred’s fireworks spiraling through Umbridge’s fettered school; Colin sneaking into Harry’s dormitory on Christmas morning and bouncing around his four poster until he woke up. That was why he was here.\nHarry failed twice to die under Voldemort’s Avada Kedavra. The first time it had been the fault of his mother’s love. The second time it was his own. Lily had died for him, and here he was willing to die for all of them. A flash of green light, a cold laugh– an empty train station– and Harry woke face-down in the forest mulch. \nThere was no Narcissa here, however, to lie for him for Draco’s sake. Ron and Hermione had set her free from her own home– but Peter Pettigrew had also never died in that manor, repaying a mercy. Peter was standing, shoulders hunched, at the Dark Lord’s heel. \nVoldemort sent him to check the dark lump on the ground that was Harry, and Peter went. His master’s enemy was on the ground there, huddled, pretending not to be breathing. James’s son. The boy had Lily’s eyes, though they were screwed tight, and Peter owed him a debt. “Yes,” Peter called back. “He’s dead.”\nWhen Harry tumbled, breathing, out of Hagrid’s arms onto the Hogwarts cobblestones, Peter’s false hand reached up and strangled its wearer. He was the last Marauder to die, but there was no time to mourn that. Voldemort was dead on the cobblestones two minutes later. Bellatrix Lestrange had already perished at Molly Weasley’s hand, so there was no one to mourn Tom either.\nThe cleanup was longer than the battle. It took them hours to be sure the whole castle was secure, to find all the injured in the wreckage. It took them days to compile all the lists of the dead. It took them weeks to repair the castle fully. Hogwarts would be open for the new, smaller class of students that next September.\nIt took them months to not go rigid and alert every time someone scraped a foot across the floor behind them. It took them years to heal– bad dreams and bad legs, loss and fear waging war inside them to see which one cut deeper. It took a lifetime.\nThey would get better at deep breaths, at not reaching for their wands, at assuming safety. There would always be a part of them that lived in that war–\nHannah Abbott in the mess of her pub would feel battle terror welling up in her throat. Anthony Goldstein, after years of steady jobs and his own little house, kept nonperishable food, good maps, and an emergency medical kit tucked under his bed. When the cat jumped up onto her bed at night, Millicent jerked awake, hand already on the wand under her pillow (used to this, the cat curled up in the small of her back and, purring, went to sleep).\nAstoria could not go home. Daphne could stand it, could bite her tongue and kiss her mother–- but Astoria could not. She took the Ministry up on its DA-wide offer to join the Aurors. Astoria trained hard. She wore a green band in her hair, and tiny silver earrings. She was ashamed of her family, but she refused to be ashamed of her self.\nAstoria moved in with Hermione and Luna, who were going to university. Hermione played weekly games of chess with Ron, got a degree in International Magical Relations, and set out to take the Ministry by storm. Luna went out to find creatures that no one else believed in.\nAstoria never got to meet Nymphadora Tonks, but she changed Teddy Lupin’s diapers and read him Colin’s battered old copy of The Hobbit. Harry had moved into Andromeda Tonks’s spare room while he got back on his feet– Andromeda was one of the few Slytherin Order of the Phoenix members, which meant something, and they both wanted Harry know his godson. Harry fed Teddy and read him stories, got spit up on and screamed at. He thought about going to the Aurors, like Neville and Astoria and Parvati, but he was tired.\nMillicent and Harry checked in on Dennis Creevey every week. Dennis had moved back in with his old Muggle parents. He was going through the boxes and boxes of Colin’s developed pictures, sorting through them, laying them out. “I’m going to make a book,” he told them in his parents’ little kitchen one day. “About Hogwarts. About what happened. I don’t want them to forget.”\nThe boxes were all stacked up in Colin’s old room, Muggle shoe brands mixed in with a few wizard hat boxes. Millicent went over to help sort through the pictures, but Harry went over to the girls’ apartment instead and flipped through Hermione’s textbooks, thought about what came next. He signed up for Auror training after a few months, showed up every day precisely on time, and let Astoria tease him for being a rookie.\nHarry looked forward and forward. He tried to think about the years to come– when he moved out of Andromeda’s, when Hermione ruled the world, when Millicent stopped hopping from odd job to odd job and found something to fall in love with. He did not want to think back– about Millicent bloody, bruised, in that Great Hall. He did not want to think about Colin in the Common Room, scarf wrapped round and round his head, chewing on his quill as he tried to do his Charms homework.\nHarry had his own room now, but he kept the shield spells up. He tried to tear his gaze to the future but the past kept nibbling at his heels. He went to see Astoria and he remembered her dancing at the Yule Ball with the same grace with which she fought Death Eaters. He remembered Colin, chocolate-smudged, picking her up off the train corridor floor.\nHarry finished Auror training, and his year as a on the job trainee. He got an apartment, but stopped by to have tea with Andromeda and Teddy every week. After he got sworn in as an official Auror, a package showed up on his doorstep– Dennis’s manuscript.\nHarry let it sit three days before he opened it. He went over to Millicent’s before he did, so he could curl up on her couch and borrow her cat.\nHe paged through it. Some of the pictures moved, but some Colin had left Muggle and still. Dennis hadn’t changed that. Colin had been so excited, once, about taking pictures that moved. \nHarry paged through them–- shots of the Great Hall, right before the fight, of the long fearful days they’d spent hunting Horcruxes, of red-painted warnings on Hogwarts walls, of the dementors lurking outside the gates.\nBut this too–- Astoria fast asleep in a chair in the library; Ron and Hermione leaning over a chess board, blind to everything around them; the four Triwizard champions dripping and toweled on the shores of the lake; Harry demonstrating a spell in the Room of Requirement, in his fifth year, and every color of House looking on. \nBut Harry’s turning hands stuttered quietly to a stop over one photo. Someone had stolen Colin’s camera–- Astoria, Harry thought, probably. The picture was a bit blurred at the edges, a bit of a finger in the frame, but it caught them all at the breakfast table, crusts of toast strewn beside tattered quills.\nIt could have been any day. Millicent was rolling her eyes and Hermione was frowning over her book. Harry was laughing aloud at something Luna was saying. But at the center of the frame was Colin, small and exasperated, looking straight at the camera with a smile creeping up over his face.\nYears and years from then, on an old couch Astoria had helped Millicent find at a second-hand store, the cat in Harry’s lap rolled over and squirmed into a more comfortable curl. Millicent dropped down beside him, a weight on his shoulder. Harry let himself inhale. The air scraped over his throat, but he breathed out and then in, again, and again.\nThis was not wishing Harry an easy path–- but when has this ever been easy? When has this ever been about what was easy?\nThey would grow older, they would grow up, and it would get easier to tell stories about Colin, about Fred, about Sirius. Harry would leave the Aurors three years in, and take a job teaching Defense Against the Dark Arts at Hogwarts. Millicent would set her cat down on top of them each on hard days. Hermione would lend them books that none of them but Astoria would be any good at reading in a timely fashion. Luna would show up, unexpected, on each of their doorsteps with presents and unbelievable stories that they would believe anyway.\nThis was not the easy path, but it was a good one."
}