{
    "id": "43593735",
    "url": "https://archiveofourown.org/works/43593735?view_full_work=true",
    "author": [
        "Greenknight2830"
    ],
    "title": "Why you don't truth serum an Addams",
    "rating": "Not Rated",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "F/F"
    ],
    "fandoms": [
        "Wednesday (TV 2022)",
        "Addams Family - All Media Types"
    ],
    "relationships": [
        "Wednesday Addams/Enid Sinclair"
    ],
    "characters": [
        "Wednesday Addams",
        "Enid Sinclair",
        "Yoko Tanaka",
        "Bianca Barclay",
        "Xavier Thorpe",
        "Ajax Petropolus",
        "Thing (Addams Family)",
        "Original Addams Character(s)"
    ],
    "additional_tags": [
        "Truth Serum",
        "Love Confessions",
        "Idiots in Love",
        "Fluff",
        "Fluff and Crack",
        "My First Fanfic",
        "Protective Wednesday Addams",
        "Protective Enid Sinclair",
        "I'm Bad At Tagging",
        "How Do I Tag"
    ],
    "language": "English",
    "series": "",
    "published": "2022-12-13",
    "completed": "2023-02-15",
    "words": "8,586",
    "chapters": "7/7",
    "comments": "401",
    "kudos": "6,666",
    "bookmarks": "670",
    "hits": "85,882",
    "summary": "<p>Bianca gets Yoko and Xavier to pour a potion in Wednesday's tea that enhances her emotions. She's not that different actually, well except around Enid.</p>\n<p>Enid wants answers, Thing wants to live and Wednesday doesn't really know where she is if she's honest.</p>\n<p>Day 2 comes and goes, and Enid think she might be gay.</p>\n<p>Wednesday lays in her bed and plots.</p>\n<p>It's almost time for her perfect confession but there's still a lot to do.</p>\n<p>Fucking finally</p>\n<p>The end.</p>",
    "notes": "<p>Hey this my first time posting a fic on here I hope you guys enjoy it!</p>\n<p>Thank you for all your nice comments! I've read them all so many times some of you guys are really funny. Thank you for noticing the Gomezification of Wednesday lol.</p>\n<p>I was watching She-Ra season 5 while writing this if you haven't watched it yet I highly recommend it. Enjoy the gay!</p>\n<p>Happy new year guys! hope you enjoy the new chapter if you're not eating any ice cream go get some, unless you're lactose intolerant. I mean I guess you can read this on the toilet, so you do you.</p>\n<p>Hi guys thank you for all the nice comments you guys are the best! And thank you for tiktok user vonlexie who actually made a video about my fic, I was very happy to have that sent to me it really made my day.</p>\n<p>Hey everyone once again thanks for reading and commenting your comments give me life some of you guys are like super sweet and some of ya'll are just so fucking funny lol. There will be one more chapter after this one and I highly recommend listening to \"Like Real People Do\" by Hozier while you read this.<br>Thanks for being here love ya!</p>\n<p>Well, it's been great! Sorry, it took a while to get this out my laptop had some issues and so did I. I'm already working on another story so I hope some of you stick around for that, it will also be about Wednesday and Enid. So anyway enjoy and thank you for reading!</p>",
    "text": "\n“The 4-leaf clover in the potion adds a bit of fae magic to the concoction, this of course makes the effects of the potion harder to reverse. The clover can also be used to terminate the effects of the potion if made into tea on the full moon.”\n\n\n \n\n\nThe teacher’s monotone voice faded into the background eventually only becoming a steady ringing in her ears. She looked over at the clock hoping that there would only be a few minutes left but it mockingly read 11:15. There was an hour and 15 minutes till lunch. Bored out of her mind Bianca looked around the class.\n\n \n\nTo her left Ajax was dowsing off, she would keep him awake with a hard kick every few minutes making the snakes under his hat hiss. To the table on her right, Xavier and Yoko seemed to be having a thumb war under the table. Finally at the Table in front of her Wednesday Addams, the school’s savior last year seemed to be the only person who could take the torture of their potion’s teacher’s monotone voice. To Wednesday's left Enid had fallen asleep but was luckily covered by Greg, the half-giant transfer student from Germany.  \n\n \n\n“Now you’re probably wondering exactly what this potion does. This particular elixir is completely harmless if used in small doses, it enhances the emotions of the person who consumes it.” \n\n\nIn Bianca’s haze of boredom, she only had one clear thought: \n\nWhat if Wednesday drank it? \n\n The girl had proven time and time again to be cold but there were these moments when something would shine through. Whether she was defending Eugene from bullies, picking up a pencil Xavier dropped, or comforting Enid during their group's scary movie night, all be it in her own way by saying “There, there” over and over, that showed that she was capable of \nsomething\n. \n\n\nShe had to see this. \n\n \n\nQuickly she passed a note to Xavier “Did you write down the ingredients?” \n\n\nA note was thrown back at her almost immediately “Yes, why? You should really pay more attention. I can't keep doing your notes.”\n\n\nBianca rolled her eyes and wrote back, \n“That’s not what I need them for! I want to have Wednesday try the potion.” \n\n\nAfter giving Xavier the note, she saw his eyes go wide. He looked at her like she had gone crazy.\n\n\nHis next note simply read “Fuck no.”\n\n\nAnother longer note followed “Sorry ran out of paper, why don’t we text instead? We’re not in the ’90s.”\n\n\nBianca tilted her head at the audacity but sneakily pulled out her phone. \n\n\n\n\n\nB: Just imagine what she would be like with actual expressions!\n\n \n\nX: Imagine what we would be like if we made it to 35.\n\n \n\nB: Pls Xavier! Just think, what if she’s had a secret crush on you all along but didn't know how to express it?\n\n \n\nShe knew she was a bitch for using her ex’s not-so-secret crush on the goth against him, but she couldn’t find it in herself to care at the moment. \n\n\n  \n\n\nX: It would be nice to see her actually give a fuck about people for once \n\n \n\nX: I’m only in if Yoko is in, we’ll need the super strength when she comes to reap our souls.\n\n \n\nB: I’ll add her \n\n \n\nY: Fuck no, absolutely not. I’ve lived to 175 by not doing stupid shit like this. \n\n \n\nB: Come on Yoko don’t be like that!\n\n \n\nX: Yeah! What’s the worst she could do to you? You’re a vampire!\n\n \n\nY: Garlic overdose, blessed water, poisoned blood, stake through the heart.\n\n\nY: there’s a lot of things she could do.\n\n \n\nB: Dang, I never realized it was so easy to kill a vampire.\n\n\nB: But we need you! What if I get the rest of the sires to provide some extra protection?\n\n \n\nY: Alright but if we all end up dead from this, I want my funeral to be the prettiest!\n\n \n\nB: Ok this should be pretty easy, Yoko makes the potion because she’s the best at it, I distract Addams during lunch and Xavier pours it in her drink.\n\n \n\nX: Do I have to pour it in?\n\n \n\nB: Yes\n\n \n\nX: IDK dude it feels a bit ya know, gross to be spiking my friend’s drink. Ya know like a guy, putting weird shit in a girl’s drink. \n\n\nX: Also, if she sees me do it, I'm the least likely to survive.\n\n \n\nY: He has a good point\n\n \n\nB: Alright, I’ll put the drink in, and Xavier can attempt to distract her with his doodles.\n\n\nB: Everyone down \n\n\nY: Ye\n\n\nX: I guess \n\n \n\n“ Now class, we will be making our own brew of Cordibus Ignem. First gently mash the marsh grass in a counterclockwise direction.”  \n\n \n\nBianca looked over to see Yoko carefully following the instructions. And Xavier made a double batch to turn into the teacher, one vile from him and another from “Yoko”. \n\n \n\nBy the end of class, they had 3 absolutely useless batches of Cordibus Ignem and one perfect batch. \n\n \n\n“Now class please turn your potions into me while exiting the classroom.”\n\n\nOne by one the students lined up and handed their vials to the teacher hearing his feedback as they left. “Terrible, awful, decent, back to awful, ew, disgusting, 3 thumbs down. Ah, a perfect batch misses Addams, Miss Sinclair your is acceptable, Mr. Thorpe terrible, Miss Barclay decent and Miss Tanaka awful. I expected better from you.” \n\n \n\nWednesday and Enid were waiting for them outside the greenhouse, the wolf gave a sad smile to the trio “Don’t worry guys! I’m sure they weren’t that bad, you know how Mr. Spine can be.” \n\n\n“Yes even I must admit that Mr. Spine’s grading methods are quite harsh.”\n\n\nAdded Wednesday, the eldest Addams had become a bit softer to her friends after her close call with the Grim Reaper, who according to Wednesday was actually a distant cousin.\n\n \n\nThe group walked to the dining hall for lunch and after finding a table Bianca thought it was the perfect time to put the plan into motion. She cleared her throat loudly “Hey Wednesday, did Xavier show you his new trick? The one with the bird-eating tarantula?”\n\n\nAt the mention of the large arachnid the goth turned towards Xavier “A bird-eating tarantula?”  \n\n \n\nBefore the conversation could go any further Enid spoke up “I’ll be right back guys I need to use the lady’s room!” She gave a quick side hug to Wednesday before leaving “Don’t miss me too much bestie!” \n\n\nAfter waving away the blond the goth turned back to Xavier “Well are you going to make the tarantula or not?”  \n\n\nThe artist quickly pulled out a pen and paper “Of Course yeah! I totally know how to do that.” While the poor man was trying to remember what that specific arachnid looked like; Yoko passed the vial to Bianca who poured it into the eldest Addam’s tea, without measuring out the dose.\n\n\nAfter Wednesday quickly realized that Xavier had no idea what a bird-eating tarantula was, she looked over at Bianca “Why did you lie to me?”\n\n\nBianca had to think quick \n\n\n“X-Xavier you said you could do it!”\n\n\nThe artist looked at his ex-girlfriend in shock, “What?”\n\n\n“I can’t believe you would lie to me like that! And now I've lied to Wens.”\n\n\n“Don’t call me that.” \n\n\nWhile the exes were “arguing” Wednesday took a big gulp of her tea. Then set the cup down a bit rougher than usual before saying.\n\n\n“Could you please stop yelling? You’re being extremely annoying.” \n\n\nThe whole table turned to the Addams in shock, that was the closest she’d ever been to yelling at anybody. While her voice was still dry it had a bit more bite to it than it normally would. \n\n\nThe goth’s eyes widened slightly “I’m very sorry I don’t know where that came from.” \n\n\nShe lets out a small sigh before continuing “I deeply apologize for my immature reaction.”\n\n\nThe first one to snap out of their shock is Yoko “Hey Wednesday, how do you feel about vampires?”\n\n\n“I respect any form of undead immensely.” \n\n \n\n \n\nThat was nowhere as interesting as I thought it would be, \n\nthought Bianca.\n\n\n“Why’s everyone looking at Willa like that?” Before anyone knew what was happening Wednesday had practically jumped out of her chair and made her way toward Enid.\n\n\nThe young Addams dropped to one knee and took Enid's hand into her own “Cara mia, love of my life the only light I tolerate in this horrid place thank you for returning to my side.”  Wednesday began leaving soft kisses on Enid's hands and wrists only pausing to look up at her. “What can I do for you, my sunlight?” \n\n \n\nThe entire group was left frozen again. Hell, the entire courtyard froze. Some people say that hell itself froze over that day. \n\n\n No one wanted to move, hell some people were too scared to even breathe which resulted in at least 2 of the fangs and a siren passing out. Bianca was trying to hold back a smile though. This was exactly what she wanted! To prove that the goth had emotions, they had just been buried deep, deep, deep down it seems. And was this what she expected? Fuck no. There’s no way anyone could have expected this. \n\n \n\nPoor Enid’s face was bright red and she was struggling to stutter out any words. Wednesday was still on one knee in front of her and was still placing soft kisses on her hands. \n\n\nPoor Xavier looked like someone had run over his puppy on Christmas morning, Yoko was hiding a smirk and Ajax was so high Bianca doubted he knew where he was.\n\n \n\nThen Enid’s eyes flashed a bright yellow, “What happened to Willa? I was gone for 2 minutes!”   \n\n\nThe werewolf bent down and took Wednesday's face into her hands “Willa are you alright? You feel warm, Willa you’re never warm!” \n\n\nWednesday only seemed to register bits of Enid’s distress. She gently put her own hands over Enid’s and started whispering “Mi amor, are you alright? What’s wrong? How can I fix it and put your beautiful smile back on your face?” Wednesday slowly turned towards the table where their friends were sitting. “Are they causing you distress, my love? Would you like me to take care of them?” The goth's hand started moving toward one of her many hidden weapons.\n\n \n\n“No! No, no, let's not do that.” Enid quickly grabbed Wednesday’s hand again. \n\n\nThe blond looks over at her friend group “One of you better tell me what you did to my best friend right fucking now or I’ll start ripping off heads!” \n\n\nEverybody could practically hear the goth swoon at that. \n\n \n\nBianca was the first person to stand up “Alright we’ll tell you, but we should probably go somewhere a lot more private.” \n\n \n\nThat’s when Enid realized that everybody was staring at her and Wednesday.\n\n\n“Alright we can go to our dorm, but I want answers the second we get there.” \n\n \n\nGetting Wednesday to their dorm proved to be very difficult, the young goth didn’t want to tear her eyes away from the werewolf even for one second, which resulted in her stepping on the feet, tails and tentacles of many of her classmates.\n\n\nEventually they did make it to the dorm room.\n\n \n\nThe door slamming open woke Thing up from his afternoon nap, he jumped up looking towards the group of 6 that just stumbled in. He very quickly noticed that Wednesday was not alright. How did he know? Well, that was very simple. He was her lifelong companion and best friend, also she had her arm hooked with Enid and wasn’t looking away from her. Like at all, it was very unsettling, Wednesday wasn’t someone to blink often but even he’d never seen her stair at something that long. \n\n \n\nHe started frantically tapping on the desk trying to get Wednesday’s or Enid’s attention. Sadly, he only got the attention of the high gorgon boy “Enid your little hand dude is going crazy.” \n\n \n\n“Little hand dude” he says, nothing about Thing was little! He was in fact a very large hand! \n\n\nAnd this very large hand was very concerned for his sister. \n\n\nThing started tapping louder \n\nENID WHAT’S WRONG WITH WEDNESDAY?\n\n\n\n\n \n\nThe blond turned to face him “I don’t know that's what these 4 were about to tell me.” \n\n\nThe blond and the disembodied hand turned towards the group, Wednesday had hazily started playing with Enid’s hair keeping her entertained for the time being. \n\n\nAfter a few seconds of nobody talking Bianca once again knew she would have to- \n\n \n\n“I didn’t have anything to do with this Enid. I was just trying to sleep in class, but she kept kicking me! And then she was like hey Xavier what if we gave Wednesday the potion we made and like put it in her tea and he and Yoko were totally like down for it. They didn’t even ask me if I wanted to so I’m kinda offended but I would have said no cuz like I wanna live to be at least 21 ya know?”\n\n \n\nAfter processing the word vomit that came out of Ajax’s mouth Enid was able to connect the dots. “You guys' drugged Wednesday? With a potion that heightens emotions. But how? All of your potions were terrible.” \n\n \n\nYoko cleared her throat a bit before speaking “I made the batch we used on Wednesday, Xavier made 2 to turn in and Bianca just didn’t give a shit, I guess. But we didn’t expect it to turn out like this really! We just thought she’d be like nicer or something and Xavier just wanted to know if she was like secretly in love with him or not. I think that answer’s pretty clear now.”    \n\n \n\nThing couldn’t believe his non-ears; Wednesday had somehow been drugged by the 3 stooges. She’d found people to let her guard down around and they spiked her drink and turned her into- into Gomez! Oh, dear Satan Gomez and Morticia were going to kill him. \n\n\nThing started visibly trembling thinking about everything the heads of the Addams family would do to him. They’d probably leave him in a dark cupboard until he lost his tan and his skin dried out, they rip off his fingers and sew them on backwards, they’d roll him and bacon and give him to Pubert! \n\n \n\nWednesday for the first time took her gaze off of Enid and looked at Thing, she bent down and picked him up “Thing what is wrong my friend? There’s no need to be afraid no harm will come to you right now you’ve done nothing wrong.” The goth spoke comfortingly, which in all honesty nobody in the room knew she could do. \n\n \n\nWhile it should have made Thing feel better it only made him feel worse Wednesday was clearly dazed, he didn’t know how much of the conversation she actually heard and registered. Whatever drug they gave her was strong enough to keep her from focusing on multiple things at once.  He crawled up Wednesday’s arm and to her shoulder where he did the closest thing he could to crying. \n\n \n\nEnid was at a loss; she knew the potion they used shouldn’t have had this effect. The professor had said it was harmless in… small doses. “How much did you give her?” \n\n \n\nThe group looked at Bianca “I just poured in what Yoko gave me.”\n\n\nYoko’s eyebrows shot up “You weren't supposed to put the whole thing in!”\n\n\n“Why didn’t you say that then?”\n\n\n“It was on the bottle!” \n\n\n“Okay everyone shut up unless I’m talking to you.” said Enid \n\n\n“Yoko, how long is this supposed to last?” \n\n\n“Well, it should have lasted like less than a day but with how much Bianca poured in it’ll probably be more like 2 or 3 days.”\n\n\nThe blond ran her hands through her hair and sighed heavily “Okay so we just have to last the weekend.”\n\n\nShe turned to face the goth who was still attempting to comfort Thing. “Just 3 days, we can last 3 days.” \n\n\nThey couldn’t last 3 days, they couldn’t even last 2. It was halfway through the first day when Enid started thinking they were waaaay in over their heads. Dealing with Wednesday was difficult enough normally, but everyone eventually learned to keep their hands to themselves and not to be overly offended by her sarcasm and dry humor. Wednesday was a very violent person if you didn’t understand her boundaries, but she had enough self-control to hold herself back. \n\n\nThat was long gone now. \n\n\nSuddenly every accidental shoulder brush in the hallway resulted in a dagger to the throat, any eye contact that lasted too long ended in a headlock if you were lucky and a saw trap if you weren’t. The worst part of it all was Wednesday’s reactions to anything she considered offensive towards Enid. \n\n \n\nXavier makes a joke at her expense. Suddenly he’s covered in a rash from head to toe and his bed is covered in poison sumac leaves. Ajax touches Enid’s hand by accident while handing her a sheet of paper. Suddenly his snakes are covered in fig sap and convulsing. \n\n\nAnd it’s not just their friends either, Hannah from geometry class accidentally tripped Enid and they still haven’t found her body, Kyle from hexes 101 sneezed too close to Enid and found himself in a shallow grave with only his head sticking out. \n\n\nAnd it had only been a day and a half!\n\n \n\nThe entire school knew there was something with Wednesday but were too afraid to mention it to any of the staff. \n\n \n\nEnid really shouldn’t have been flattered by any of this, in fact she should have been horrified! But there was something about knowing that somebody was so in love with you that they’d torture for you, and in Wednesday’s case to \n\nnot\n\n kill for you. The werewolf knew that Wednesday was very deadly and had no qualms about murder. So, the fact that she held herself back for Enid…...\n\n\nIt made a part of her, the very not human part of her howl in joy.\n\n \n\nBut Enid wasn’t like gay or anything. Not that there’s anything wrong with that! She would just have to let Wednesday down after the potion had worn off. \n\n\nBut until then there was nothing wrong with her enjoying any of Wednesday’s soft words or reveling in the fact that she was now the only person that Wednesday would actually hug. \n\n\nThe first time she did it after their first period together Enid's heart jumped out of her chest. \n\n\nOf course, Wednesday only did it to establish some sort of claim on her in front of the class but it was still sweet! \n\n \n\nRight now, they were at lunch, Wednesday was pressed up against Enid on one half of the table and everyone else was squished together on the other half. Thing started joining them at lunch after the whole spiking incident and stayed at the head of the table.\n\n\n“Cariño, are you alright? You haven't touched any of your food. Would you like me to feed you?” \n\n\nEnid let out a small sigh “No that’s alright Willa I’m just waiting for it to cool down.”\n\n\nWednesday let out a disappointed sigh before pushing some of her food around in her own plate “Of course mi amor, my apologies.” \n\n \n\nFrom the other side of the table Yoko let out a loud groan “Damn it Enid just let her feed you the soup!”\n\n\nEveryone else yelled in agreement.\n\n\n“Just let her Enid!”\n\n\n“Eat the soup bro!”\n\n\n“Enid please I can’t watch this anymore!”\n\n\n“Oh my God, fine! Wednesday you can feed me.” \n\n\nThe goth looked up at Enid with a small smile and reached out to hold Enid’s left hand “Gracias mi vida, thank you for letting my filthy skin touch your pure hands. I am not deserving of the honor to be seated by you, thank you for letting me earn my place at your side by being of use to you.” \n\n\nWednesday started using her other hand to feed Enid her soup while the hand holding Enid’s started rubbing small circles on the back of Enid’s with her thumb.\n\n\nIn all honesty Enid was eating on autopilot, she only felt her mouth opening and closing but all she could think about was how beautiful Wednesday's eyes looked when the sun was hitting them at just the right angle. Wednesday’s eyes were like a void, they were deprived of light. But when the light hit them just right Enid could see flecks of gold and hazel in their darkness. Like gemstones glowing in a mine.  \n\n \n\nWhile Enid and Wednesday were having their moment, everyone else was growing increasingly uncomfortable. Well, everyone except for Yoko who was just glad her best friend was finding her way out of the closet. \n\n \n\nSurprisingly it was Ajax who finally had the balls to say something “Hey guys I’m like super sorry to interrupt but like class starts in 5 minutes.” \n\n \n\nPotions class went by quickly and uneventfully, Wednesday was able to pay attention in small spurts writing down something the teacher said before going back to looking at Enid and repeating the whole process again. \n\n \n\nMr. Spine obviously knew what was happening. He wasn’t the potion teacher for nothing! “Enid, Wednesday, Xavier, Yoko and Bianca. I need to see you all after class.”\n\n \n\nAfter class Mr. Spine sat at his desk and stared at his student expectedly “So, which one of you is going to tell me who gave Miss Addams Cordibus Ignem? And how did you mess it up enough for it to have this effect?”    \n\n \n\nEnid quickly launched into an explanation “It was those three I had nothing to do with, I'm as much of a victim as Wednesday is!”\n\n\nMr. Spine let out a loud sigh “This happens every year. You think the school board would stop making this a required potion after the hundredth time but no fuck me, I guess. So, who was the idiot who added the clover?”\n\n \n\nEveryone looked over to Yoko “Hey I didn’t add any clovers! I followed the potion exactly how it was written in the book.”\n\n\nMr. Spine looked at them intensely “Well obviously someone added clover to the potion, and they added too much of it, that is why Miss Addams is acting like a lovesick pup.”\n\n \n\n“My tea”\n\n\nThe group turned towards Wednesday “The tea they spiked was clover tea.”\n\n\nThe group turned back to Yoko “How was I supposed to know she drinks clover tea? Well, what happens now, teach?”\n\n \n\n“This complicates things, you can’t just wait the potions effects out like you were probably going to. You’ll have to wait until the full moon to make a tea to reverse the effects, the next one should be next Saturday. Meanwhile I have to contact the Addam’s and inform them of their daughter’s condition.”\n\n\n\nFor the first time in 2 days everyone was thinking the same thing \n\nWell fuck \n\n \n\n\nWednesday was seen as a very complex person, but she wasn’t, not really. She liked her space, her family, poison, the dark, the color black and a few other things most people would consider “morbid” and “disturbing” but there is one thing Wednesday loved. Enid. \n\n\nThe blonde had all but taken over Wednesday’s mind in a brutal and bloody war against Wednesday’s base instincts. \n\n\nFirst came the first wave, the dreaded K-pop music, Wednesday hated it. She wanted to tear off her own ears whenever she heard it. Yet Enid loved it so eventually Wednesday gave into her pleas and let her play it in their room. She loved to see the blond dance around the room with a wide smile swinging her head around and moving her arms like an electrocuted octopus. It was uncoordinated and against rhythm and reason. It was Enid! \n\n \n\nThe second wave was the color. Wednesday may have greatly exaggerated her color allergy, but she still hated it anywhere near her. She could make exceptions for white or dark gray, maybe even a very very dark blue. But she’ll never forget how she felt stepping into her room at Nevermore for the first time and seeing that damn window shine its color everywhere. \n\n\nEvery shadow was overtaken by yellows, blues and pinks. Every dark damp corner gone. It made her want to vomit. \n\n\nHer first plan was to remove all the tape from the window entirely after Enid went to sleep and to just pretend the tape was never actually there. If Enid ever asked about it or made any accusations, she would just look at her weird or tell her she was going crazy. Then she saw her roommate’s reaction to just half the tape being removed and decided against it. \n\n\nThe Snoods were part of it too! Just knowing she was matching with someone wearing \n\npink \n\nwas enough to make her want to commit seppuku, ritualistic samurai suicide, to keep her honor.  \n\n\nBut seeing Enid smile every time she put that thing on was enough for her to ignore the feeling of her skin wanting to peel off her body. \n\n \n\nThen Enid completely took over Wednesday’s mind with \n\nthe hug\n\n. That hug had cemented Enid into Wednesday’s very short list of people she cared about. But more importantly it activated the Addams family curse. She was in love with Enid and there was nothing anyone could do to stop it. \n\n\nShe fell fast, she spent the entire summer sending Enid messages on the phone Xavier got her. The entire summer she craved to be near her, one time Lurch had to pin her down to stop her from actually going to her, the poor butler still had the bite marks from the battle. \n\n\nShe thought that once she returned to Nevermore that she would be able to woo Enid properly just as her father had to her mother, but it proved difficult. \n\n \n\nEnid had no understanding of Addams courting traditions. She didn’t understand the “roadkill” as she so kindly put it, that Wednesday brought for her was to show her that she could hunt just as well as any wolf.\n\n\nShe didn’t get that Wednesday almost slaughtered Bianca in a fencing tournament to prove that she would both kill and hold back for Enid.\n\n\nAnd she sure as hell didn’t understand that she had given Ajax a lobotomy to prove that no other suitor would stand in her way. Enid was actually very angry at that one. Wednesday had to reverse it…. Which she had, for the most part.\n\n \n\nFor once in her life Wednesday couldn’t think of anything to say or do to properly express her feelings. How could she tell Enid that she would paint Nevermore red with the blood of anybody for her. How could she tell her that she would paint herself pink for her. \n\n \n\nAnd then the perfect opportunity presented itself.\n\n\nBianca, Xavier and Yoko really thought that Wednesday wouldn’t see what they were doing. She was almost impressed; she had truly made the right choice in friends. \n\n\nShe knew what they were up to the second she saw Xavier making a double batch of Cordibus Ignem. Her suspicions were confirmed when Bianca tried to distract her with a \n\nbird eating tarantula drawing \n\nof all things. As if Xavier would ever actually research arachnids for absolutely no reason. \n\n\nBut after she drank it, she was free. Free to express to Enid exactly how much she meant to her without any of her anxieties getting a hold of her, and the clover tea meant that she had as much time as she needed.\n\n \n\nUntil Mr. Spine found out, now she only had until the next full moon, and they had notified her parents who were probably already on their way. She had to find a way to not only make Enid come to terms with her sexuality but also fall in love with her in a week. \n\n\nShe’d have to step it up. Luckily while she was high on this potion any idea is a good idea. \n\n\nBut she needed something big. Something that would never be forgotten by anyone who witnessed it. \n\n\nAnd more importantly if it made Enid finally realize that she wasn’t as straight as she thought at least half her job would be done. \n\n\nSeriously all of Nevermore knew that Enid was fruitier than a Whole Foods. \n\n\nI mean her music taste alone was mostly Twice, Girl in Red, Hozier and Rick Montgomery.\n\n \n\nWait \n\n\nThat’s perfect…. she’s got some things to set up.\n\n\nShe sits up in her bed and turns toward her desk “Thing please get up, we’ve got something to do to impress my future wife.” The hand jumped up and ran from the desk onto Wednesday’s shoulder “How does Enid Addams sound to you? Her name will look beautiful carved next to mine on our family tree. I do hope mother and father like her, I’ll introduce them once they get here.” \n\n \n\nWednesday looks towards her sleeping roommate and smiles “Oh she’s just so gorgeous Thing, I can’t wait for us to be wed.”\n\n \n\nThing taps on her shoulder.\n\n Do you think she’ll want to wear white or pink to the wedding?\n\n\n\nWednesday hums thoughtfully “While I hope that I can convince her to wear black I’m sure she’ll look magnificent in whatever she chooses. Oh, and thing grab my cello I’m going to need it.”\n\n \n\nThing taps out \n\nBitch I’m a hand how am I supposed to move a whole ass cello?\n\n\n\n“Damn alright I’ll grab the cello, but I need you to run to town and grab some sheet music for me while I grab the rest of the things I’ll require for tonight.  \n\n \n\n\nGot it \n\n\n\nEverything had to be perfect.\n\n\nEvery flower impeccable, every drop of water purified, and every ray of light controlled. \n\n\nLight had a way of doing whatever it wanted but today Wednesday would snuff out the sun if she had to, the light needed to shine in a very certain way today.\n\n \n\nShe had been up since 6 in the morning carving, welding, summoning, blackmailing and preparing for her ultimate declaration of love. \n\n\nIf she was completely honest with herself, she didn’t know how she would take it if this backfired, especially while she was all drugged up. Her self-restraint was close to none and her craving for homicide was hanging by a thread. \n\n\nA bright colorful thread that liked smothering Wednesday in hugs and once suplexed a guy that had cat-called her in town. \n\n \n\nEnid truly was perfect for her, but she could daydream about her later. It was time for her to set everything up, luckily for her help had arrived.\n\n \n\n“Oh, my little rain cloud! Mrs. Weems' reanimated corpse told us you were preparing something in the courtyard.”\n\n \n\nWednesday rappelled down from the building she was hanging colorful glass shards from to meet her father and brother on the ground. \n\n \n\n“Hello father, Pugsley, I hope your drive here was dreadful. Where is mother?”\n\n \n\n“Oh, her and the reincarnated corpse of principal Weems are making out.”\n\n \n\nWednesday blinked slowly \n\n\n“And you’re like ok with that?”\n\n\nHer father threw his head back and laughed “Of course she’s just refueling the magic inside Weems that keeps her alive.”\n\n \n\n“By making out with her?”\n\n \n\n“Well, it was either that or they make raw passionate love in the principal's office, and I don’t think the school board would appreciate that.”\n\n\nWednesday turned to look at her brother who was looking into the distance with a traumatized look on his face. \n\n\n“And there wasn't any other spell mother could have used?”\n\n \n\n“Strangely enough no, well there was one, but it required the blood of a North American wyrm and I hunted those to extinction in college so really this is my own fault.” \n\n\nHer father looked into the distance for a while before snapping back. \n\n\n“Well enough about that! What can we help with?”\n\n\nWednesday smiled, which in all honesty freaked her father and brother out and picked up a set of blueprints from the ground. \n\n\n“Alright father I’ll require as many gardenias and pink hydrangeas as you can find in the next 4 hours, Pugsley I need 10 gallons of blue, purple, yellow and pink paint and I’ll need mother to pick out an outfit for me it must be all white.”\n\n\nWednesday rolled up the blueprints and tucked them under her arm, “Do you understand? And I need you both to know that I have a lot riding on this and if this doesn't work the way I want I will drown myself in resin so you can see my disappointed face for eternity, you got that?” \n\n \n\nGomez and Pugsley both look at each other and nod,\n\n\n“You can count on us rain cloud.”\n\n\n“I’ll get the paint sis don’t worry! But how am I going to carry back 40 gallons of paint?”\n\n\n“I DON’T CARE IF YOU HAVE TO SHOVE 20 GALLONS UP YOUR ASS, I WANT THAT PAINT HERE BY 7!”\n\n \n\nPugsley went even paler white “Alright I get it please calm down.”\n\n\nWednesday let out a small sigh “Sorry the potion takes away most of my emotional control especially in situations involving Enid but please I need that paint here by 7 tonight. I’ll get Eugene to drive you but be warned he doesn't actually know how so just hope for the best.” \n\n \n\nPugsley runs his hands down his face and lets out a loud groan “All right I guess, where’s Thing by the way?”\n\n \n\n“He’s getting some sheet music for me in town.”\n\n \n\nMeanwhile\n\n\n In town a woman jumps up on a music store counter and yells for her husband.\n\n \n\n“HAROLD THERE’S A DISEMBODIED HAND IN THE STORE!” \n\n \n\n“Woman I told you to stop snorting that- OH DEAR LORDY WHAT THE HELL GET THE GUN MARGRET! GET THE FUCKING GUN!”\n\n\n“I’M NOT GETTING DOWN FROM HERE YOU STUPID FUCK I’M NOT DYING FOR YOU!”\n\n\nThing runs around the store dodging the CD’s the lady started throwing at him from the counter.\n\n\n“MARGRET MY MOTHER WAS RIGHT ABOUT YOU!”\n\n\nThing finally gets to the sheet music and starts going through it while still dodging CD’s, none of the sheet music is what Wednesday asked for \n\nWell it’s not like I can ask the owners\n\n\n\nThing turns around and sees the sheet music he needs right behind the redneck husband and starts to book it toward him.\n\n\n“MARGRET IT\"S COMING TO ME.”\n\n\nHe sees the wife run to the back and come back with a gun; she hands it to the man who tries to shoot at him but misses.\n\n \n\n“HIT IT HAROLD HIT IT!”\n\n\n“I’M TRYING YOU INBRED BITCH!”\n\n\nThing aims and jumps up onto the man's face who screams loudly and then onto the shelf holding the sheet music. He grabs the right one and runs away as fast as possible, running in zigzags while the couple is still trying to shoot at him. \n\nThis is the last time I do shit for “true love” I’m getting paid next time!\n\n\n \n\nBack at Nevermore the time had finally come.\n\n\nIt was 7 PM exactly.\n\n\nAnd no one was where they were supposed to be.\n\n\nWednesday had entrusted her family with the most important day of her life and none of them were on time.\n\n\nOh, yep, she could definitely feel a panic attack coming.\n\n\nShe looked at her watch again 7:01, Bianca had been blackmailed into bringing Enid here at 8 and Yoko and Xavier were blackmailed into helping her with the final touches.\n\n\nWhy was everyone but her family doing exactly what she told them? Then again would they really be her family if they didn’t wait until the last second.\n\n \n\nWednesday suddenly heard tires screeching to a halt and turned to see her brother and Eugene pushing 4 barrels full of paint. “Finally! I need those to be poured into that giant bucket in the center please, Yoko help them it’ll be far too heavy for their pale prepubescent arms.”\n\n \n\nShe turns toward a beeping sound on her right to see her father riding into the courtyard with several monster trucks filled with flowers “I’m very sorry I’m late rain cloud but we caused a few accidents on the way here.”\n\n \n\n“That’s fine father now please put those flowers on the tarps and on the floor, Xavier will help you spread them out. Actually, you know what, Xavier I’m going to need you to call in Ajax there's far too many flowers for the two of you to get it done in time.”\n\n \n\nEveryone was here, well everyone except-\n\n\n“Wednesday darling, how’s this?”\n\n\nWednesday turned around and was met with the sight of her mother holding an all-white suit.\n\n\n“Mother is that who's I think it is?”\n\n\n“Yes, it was your grandfather’s, don’t worry darling I’m sure he would have wanted you to use it for this.”\n\n\nWednesday ran her hands down the soft fabric and over the sleeves that were covered with the Addams family crest.\n\n\n“Did you tailor it?”\n\n\n“Yes, I had a vision about this moment a few months ago and I’ve been preparing it ever since. You know he actually did something similar to this for your grandmother, you see the north-east tower? He’s the reason that it’s tilted toward the right.” \n\n\nMorticia ran her hand over Wednesday’s hair and down her braids “Oh my darling girl how I wish you didn’t have to do this to yourself to express your love. But I am glad you’ve finally found the other half of your soul.”\n\n \n\nWednesday reached her hand towards her mother’s “Mother I know that a week from now I will not be able to say this, so I need you to know that I deeply care for all of you, and I appreciate everything you did for me.” \n\n\nMorticia smiled and Wednesday went to change behind a pillar. She walked out from behind and then the clock struck 8.\n\n \n\nWednesday turned to look at her friends and family “Places everybody please! It’s time.”\n\n\nWednesday walked to her spot and grabbed her cello and Thing ran to the music stand to flip pages. Enid and Bianca walk into the courtyard and 2 large multicolored lights shine in their direction. Painting the paved path in bright colors. \n\n \n\nIt was time \n\n\nEnid would normally see herself as the kind of person who adapted very well to new and strange situations. \n\n\nAfter all she was the person that got Wednesday accustomed to people and the girl who made snoods a worldwide sensation. Seriously she makes millions of dollars in royalties a day. \n\n\nShe completely accepted that her roommate just had a disembodied hand as a family member, that her mother would never be proud of her even after she transformed and even that her father would never stand up for her against her mother.\n\n\nBut somehow accepting all of those things was way easier than accepting her own sexuality.\n\n\nIf she was completely honest with herself, she’s known for a very long time, and yet standing on a stone path showered in multicolored light she no longer had the energy to deny it. \n\n \n\nSeeing Wednesday in her all-white suit at the end of the path sitting down by the fountain with her cello…... Well, it really puts everything into perspective. \n\n\nAny hope of her being heterosexuality died like all those cartoons from Who Framed Roger Rabbit. Except that instead of them dying in gross goop hers died in the presence of probably the hottest fucking woman alive.\n\n \n\nShe looked at Bianca, not exactly sure what do, Bianca rolled her eyes and pushed her onto the path “Go get your girl Sinclair, please for the love of god she has my goldfish hostage.” \n\n\nAs Enid stepped onto the path millions of flowers started to fall from the sky covering her in pink and white. And then Wednesday started playing.\n\n \n\nAnd then she started singing \n\n \n\n\nI had a thought, dear, however scary\n\n\n\n\nAbout that night, the bugs and the dirt\n\n\n \n\nAs she started the lights changed to a dark green and gold that softly illuminated Wednesday.   \n\n \n\n\nWhy were you digging? What did you bury\n\n\n\n\nBefore those hands pulled me from the earth?\n\n\n\n\nI will not ask you where you came from\n\n\n\n\nI will not ask and neither should you\n\n\n \n\nThe light around the goth and the white suit made Wednesday look almost angelic which in any other situation would be laughable but right now. \n\n\nRight now all Enid wanted to do was get closer.\n\n \n\n\nHoney, just put your sweet lips on my lips\n\n\n\n\nWe should just kiss like real people do\n\n\n\n\nEeh-eeh-eeh-eeh, eeh-eeh-eeh\n\n\n \n\nEnid didn’t know when she started to walk closer, honestly, she felt like she wasn’t even in control of her own body anymore. Wednesday was like a magnet, she needed to be closer to her. \n\n \n\n\nI knew that look, dear, eyes always seeking\n\n\n\n\nWas there in someone that dug long ago\n\n\n\n\nSo I will not ask you why you were creeping\n\n\n\n\nIn some sad way, I already know\n\n\n\n\nSo I will not ask you where you came from\n\n\n\n\nI would not ask and neither would you\n\n\n\n\nHoney, just put your sweet lips on my lips\n\n\n\n\nWe should just kiss like real people do\n\n\n\n\nEeh-eeh-eeh-eeh, eeh-eeh-eeh\n\n\n\n\nEeh-eeh-eeh-eeh, eeh-eeh-eeh\n\n\n \n\nWhen Enid was about halfway down the path Wednesday stopped playing and passed her cello to her father. The entire choir stepped out from behind the fountain to continue the song. Well, the whole choir minus Bianca who was begging Mrs. Addams for her goldfish back. \n\n\nWednesday started making her way down the path to meet Enid at the center.\n\n \n\n\nI could not ask you where you came from\n\n\n\n\nI could not ask and neither could you\n\n\n\n\nHoney, just put your sweet lips on my lips\n\n\n\n\nWe could just kiss like real people do\n\n\n\n\nEeh-eeh-eeh-eeh, eeh-eeh-eeh\n\n\n\n\nEeh-eeh-eeh-eeh, eeh-eeh-eeh\n\n\n \n\nAs the song ended Enid and Wednesday met in the middle of the path only a few feet away from each other, both bathed in green and gold light and covered in flowers. \n\n\nWednesday reached out her hand and gestured around her “Not too bad for a love confession, right?”\n\n \n\nEnid, completely overwhelmed with emotion could only nod.\n\n\nWednesday smiled and continued to speak “Enid Sinclair, I love you. I have loved you since the day you left me in our room, and I realized that I could not function without you. When you aren’t near me, I feel like I can’t breathe and when you’re close to me I feel strong enough to fight death itself, without the need for ghostly intervention.\n\n\nAnd if you would be mine, I promise to treasure and cherish you for the rest of our lives. I promise to be the shoulder you cry on and the hand you hold.\n\n\nAnd most of all I promise to do anything to protect your smile.”\n\n \n\nAs Wednesday finished her confession she took a few steps back “Let this be the ultimate evidence of my love for you. Eugene, Pugsley now!”\n\n \n\nA giant bucket filled with paint, that in all honesty Enid had completely failed to notice was hanging above them by what seemed to be many ropes, tipped over and drenched Wednesday in blue, yellow and pink staining her white suit.\n\n \n\nThe goth tried to wipe her eyes but failed, then she felt two hands wipe the paint off her eyes. She opened them to see Enid in front of her crying with a smile on her face.\n\n \n\n“You look like a Banksy painting.”\n\n\n“Banksy does mostly black and white art.”\n\n\n“Just shut up and kiss me you dork.”\n\n \n\nEnid brought Wednesday in for a kiss, pulling the tie on her suit to bring her in closer.\n\n \n\nWednesday pulled away for a moment “Does this mean you accept my confession?”\n\n\nEnid rolled her eyes “Yes! I’ll be your girlfriend Wednesday Friday Addams.”\n\n \n\nWhen Enid accepted the everyone broke out into cheers, especially Bianca who finally got her goldfish back, Yoko who was now going to get the antidote to the vampire killing venom that Wednesday put in her blood bag, Xavier who wouldn’t have his emo poems sent to his dad, Ajax who was bribed with weed as well as, the entire choir who had head exploding chips put in their necks while they slept.\n\n \n\nEugene was here willingly to help out his best friend, who was now officially his best friend because her old best friend was now her girlfriend.  \n\n \n\nMr. and Mrs. Addams looked at their daughter with pride, happy that she finally found her other half, they couldn’t help but wonder what exactly their daughter would do to top this for her marriage proposal. \n\n \n\nPugsley looked at his sister with confusion, he’d only ever seen her smile while inflicting pain on someone, usually him, and he wasn't exactly sure if he could handle his sister smiling like that more often. \n\n \n\nThing looked at Wednesday and Enid with anger because he almost died for this shit, but he guesses it was cute enough for him to forgive them. After all, he would definitely be the best man at the wedding. \n\n \n\n “Her middle name is Friday?”\n\n\n“Ajax if you don’t shut the fuck up right now, I swear to god.”\n\n“Ok, Mr. and Mrs.Addams after your daughter drinks this she will return to normal.”Mr.Spine said handing the vial over “Just remember, she must drink it tonight. Or the clovers in the potion will lose their effect.”\n \nGomez took the potion and pocketed it “ Of course, we’ll give it to her just as soon as she’s done with her date! You just can’t keep her away from her loba, you should see them together!”\n \n“I would rather not, especially if they’re anything like you two were when we were their age.”“They’re actually much worse!”“Of course they are.”\n \nBefore Gomez can say anything else Morticia cuts him off and lays a hand on his shoulder “Mi amor, do you really think our daughter would appreciate you discussing her love life with her professor?”\n \n“Probably not!”“Then should you continue?”“No, no I should not!”“That’s a good boy.”\n \nMr.Spine decided to interrupt before they recreated the incident that destroyed his desk all those years ago.“Well, you two should probably get going then!”The teacher got up and opened his classroom door, “You wouldn’t want to miss the deadline and have her stay like this for another month.”\n \nThe Addams stood to meet him at the door thanking him quickly before exiting the classroom.Mr.Spine sighed in relief and closed the door “Well, I definitely won that bet now.”He went to his desk and opened a drawer full of banned potions lessons from throughout the years and slowly placed the lesson for the Cordibus Ignem in it.\n \nIn that same drawer, there was a paper with bets from every teacher in the school, including a certain reanimated corpse, of when Enid and Wednesday were going to get together. And written next to the day of the grand confession was the name of one Victor Spine; who had just won himself a grand vacation to the Caribbean.\n \nMeanwhile, in the woods surrounding the school, Wednesday and Enid were having a picnic.“Would you like more raw steak mi tesoro?”“Claro que si mi amor!”“Tu Español está mejorando mi loba.”“Claro que si mi amor!”“Is that the only thing you know how to say, Enid?”The werewolf gave a sheepish smile to her girlfriend before nodding her head.“I’m sorry Willa, I’ve been trying to get better but-”Wednesday decided to cut her girlfriend off with a kiss before she gave herself a panic attack.The goth rested her hand softly on her girlfriend's cheek and pulled away.“Darling, I don’t expect you to learn Spanish in the span of a week. But your effort truly means a lot to me.”\n \nEnid was truly at a loss for words. Out of everyone in the world, she was the one who Wednesday wanted. She didn’t know who to thank for that, but whatever gods or god was looking out for her was truly deserving of anything they asked for. Should she give them a sacrifice? Xavier had been getting pretty annoying lately.\n \n“Wednesday Addams I don’t know what I did to deserve you but I promise to spend the rest of my love proving how deserving I am of your love.”Wednesday let out a small laugh before resting her forehead against her girlfriend’s “You don’t need to prove anything to me. The only thing I’ll ever ask of you is that you stay by my side.”\n \nThe two girls stayed like that for a while before packing their picnic up and returning to Nevermore hand in hand.\n \n“Hey, Willa how did you get everyone to help with the confession anyways?”“I truly don’t think you want the answer to that amor.”“Does it involve blackmail?”“Yes, and a lot of it.”“Then you’re right I probably don’t want to know about it. It’s kind of hot though.”“Truly?”“Yep!”“Well, I guess I’ll have to do it more often then.”\n \nWhen the two girls got back to their shared room Gomez, Morticia, Pugsley and Thing were waiting for them with the potion.\n \nMorticia walked up to her daughter and handed her the potion “Here you go darling, you must drink it before the day ends or we will have to wait another month.”\n \nWednesday took the potion from her mother and looked at Enid and then at her family.“What if I don’t take it?”Her brother’s eyes widened in surprise “Why wouldn’t you take it Wednesday?”The young girl looked down and gripped the potion tighter. She turned toward her girlfriend and held her hand, “Enid, once I take this I won’t be the same. I can’t promise another grand gesture like the confession again, or at least for a while. I’ve been trying to be better at expressing myself but it’s not as easy for me as it is for other people. But if I don’t take the potion and I stay like this I can express my love for you every day.”\n \nEnid smiled softly at her girlfriend “Wednesday, while the confession was like super romantic, it’s not why I’m in love with you. I mean it did help me realize that I was in love with you because well have you seen yourself in a suit? But I love you because you’re brave and amazing, and so fucking smart and none of that is going to change once you drink that potion. And I promise that as you’re awesome girlfriend I will help you however I can at expressing yourself.”\nWednesday looked at her girlfriend and took the cap off the potion before drinking it all in one large gulp.“Well, that was a very unpleasant texture.”“How are you feeling Willa?”Wednesday hesitantly took her girlfriend's hand “As long as you keep your promise to me, I will be fine mi amor.”\n \n“So when is the wedding?”“Gomez please not right now.”“ Perdóname cariño, you know how I am.”“I do and I love you.”\n \nMeanwhile, Pugsley and Thing stood in between the two couples feeling single as fuck."
}