{
    "id": "436193",
    "url": "https://archiveofourown.org/works/436193?view_full_work=true",
    "author": [
        "Echo"
    ],
    "title": "A.I.s and Lullabies",
    "rating": "Not Rated",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "The Avengers (2012)"
    ],
    "relationships": [
        "Bruce Banner & Tony Stark",
        "Natasha Romanov & Tony Stark",
        "Jarvis (Iron Man movies) & Tony Stark"
    ],
    "characters": [
        "Tony Stark",
        "Bruce Banner",
        "Jarvis (Iron Man movies)",
        "Natasha Romanov",
        "Clint Barton",
        "Thor (Marvel)",
        "Steve Rogers"
    ],
    "additional_tags": [
        "De-aging",
        "Kidfic",
        "Child Abuse",
        "Bittersweet Ending"
    ],
    "language": "English",
    "series": "",
    "published": "2012-06-17",
    "completed": "2012-10-09",
    "words": "21,693",
    "chapters": "12/12",
    "comments": "1,381",
    "kudos": "13,629",
    "bookmarks": "3,052",
    "hits": "207,921",
    "summary": "<p>Tony is suddenly a quiet, wary five year old boy. The rest of the team are less than completely sure about what to do about that.</p>\n<p>Natasha reminds Bruce that little Starks still need their sleep.</p>\n<p>Clint takes Tony toy shopping, and draws his own conclusions.</p>\n<p>Tony has some questions for JARVIS</p>\n<p>Tony discovers the Iron Man suits, and Bruce gets used to being trusted.</p>\n<p>Tony does quite a lot of thinking, and JARVIS gets quizzed</p>\n<p>Natasha finds out a bit about Tony, and Tony finds out a bit about Natasha in the process.</p>\n<p>Tony does some science of his own, and Bruce is faced with a very complicated question.</p>\n<p>Tony reaches a compromise with Natasha, an understanding with Steve, and disproves the saying that you can't choose your family.</p>\n<p>JARVIS always follows his creator's wishes.</p>\n<p>Natasha and Bruce share an understanding.</p>\n<p>JARVIS shows Tony what he's missed</p>",
    "notes": "<p>Fill for http://avengerkink.livejournal.com/5102.html?thread=4669422#t4669422</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_11_endnotes\">notes</a>.)\n</p>\n<p>Hopefully you don't all resent me terribly for not letting Bruce and Natasha keep their little Tony for ever after. Part way through the second part I realized this would be how it would end, and no matter what I tried, it was inevitable. They got Tony back, and Natasha and Bruce have finally come to understand each other, but as Avengers, some kinds of joy can only ever be fleeting. :(</p>\n<p>With that many comments requesting a Tony-centric epilogue, I had to oblige. This is absolutely, finally, <i>it</i></p>",
    "text": "Bruce Banner was a physicist, and physics had quite a lot to say about time travel. Unfortunately, most of those things were best filed under the heading \"it's impossible, and here's why\", which he found quite infuriating given the very real evidence to the contrary sitting in the next room.\nBruce rested his chin on his left hand, pen hovering over a page full of scrawl, and listened. The details of the conversation from the next room weren't entirely clear, but both participants sounded happy enough. The childish chatter continued almost without pause, only occasionally interspersed with the attentive tone of JARVIS answering the boy's questions.Tony's questions, Bruce reminded himself, because there was no doubt in his mind that the little boy currently playing with the pile of sensors, motors and double-A batteries was Anthony Edward Stark, aged four and five sixths.\nBruce sighed, looking once more at his notes. He had considered been the possibility that the cause was chemical or biological, but had dismissed the theory quickly. Even a cursory examination of the boy had shown no arc reactor embedded in his chest, and there was an obvious lack of memory beyond his biological age. The only conclusion Bruce could accept was some form of time manipulation.\nOr magic, he supposed. But Bruce didn't like that idea. Magic was cheating.\nBruce was startled from his reverie by a sound very like a dog's bark, immediately followed by a squeal of childish delight. He rose cautiously to investigate.\nHe'd obviously expected Tony to take quickly to the collection of child-safe electronics components he had scavenged from the the Stark labs. They were the closest thing to children's toys that he'd had been able to gather at short notice, but Tony had seemed more than pleased with his bounty.\nSo it was true that Bruce had expected Tony to present him with blinking LEDs, perhaps something rolling around on the little rubber wheels they'd found. He most certainly had not anticipated the five inch high robotic... animal... which was currently lumbering around the floor. It had four legs sticking out like rods from a lumpy body, and a solid round head with paper ears sticky-taped to it. Despite the odd appearance though, it was successfully (if awkwardly) navigating its way around a makeshift obstacle course of chairs and boxes spread across the floor.\nThe robot creature barked. A dog, then. Tony gave another delighted laugh. Bruce stared.\n\"Did you make this, Tony?\" he asked, trying to keep the surprise in his voice at a reasonable level. He looked to the little boy, the child's eyes bright with pleasure. Tony nodded.\n\"Uh huh. JARVIS helped though, 'cause he found me a sound for the barking and showed me how to put it into the... um...\"\n\"Audio synthesiser, Sir.\" JARVIS contributed thoughtfully. Tony grinned and nodded enthusiastically.\n\"Yeah, the audio thing. So now he can bark!\"\nBruce watched the dog approach a dead-end, blocked in on all sides. The dog sat down on its virtual haunches and gave another bark. Tony scrambled to his feet to rescue his creation.\n\"He can't turn all the way around yet, because I could only find joints that turned around this much.\" Tony demonstrated a right angle by extending his thumb relative to his fingers, \"But JARVIS said he would get me some better ones tomorrow.\"\nTony returned, carrying the robotic dog with a hand under its belly. The dog's legs wiggled frantically for purchase. \"If you pat him, he wags his tail!\"\n\"This is very impressive, Tony.\" Bruce enthused, not even bothering to hide just how impressed he was. He reached out to pet the dog's head between the paper ears. Its tail did, indeed, wag. Bruce smiled. \"You know, I used to have a pet dog.\"\n\"Really? What was its name? Was it a girl dog or a boy? Where is it now?\" Tony asked, then his face suddenly turned sombre and serious, eyes wide with sympathy beyond his years. \"Did it die?\"\nThe child's eyes suddenly reminded him so fiercely of an adult Tony that Bruce couldn't help himself. He reached over to ruffle Tony's hair affectionately, but Tony twitched away from his hand. Bruce was momentarily startled by the reaction, but of course he was still little more than a stranger to this Tony. As much as the older version actively sought out Bruce's touch, it was to be expected that the younger would be a little nervous. He offered Tony a smile instead, allowing the boy his space.\n\"No, my dog didn't die, but I had to move house and he couldn't come with me.\" Bruce answered. He hoped that was true. He hadn't been able to go back to check on the poor animal after the military had hunted down his hiding spot all those years ago. He had had good neighbours at the time though, he hoped they would have taken the creature in.\nTony seemed to take the explanation at face value, his gaze falling thoughtfully to the odd little robotic animal which was currently lying down. Its tail tapped the floor intermittently. Tony looked back up at Bruce for a moment, lips pursed, before breaking out a shy smile and picking up the dog with both hands.\n\"You can have this one instead,\" He offered, holding the robot up. His eyes darted from the floor to Bruce's face and back again, battling between his shyness and his desire to observe Bruce's reaction. \"It's not a really truly alive dog, so it won't mind if you ever have to move. You can take it with you.\"\n\"Oh, Tony. You made this for yourself, you don't need to give it to me.\" Bruce replied gently. He regretted it barely a second later, as Tony's face fell, unable to satisfactorily mask his disappointment. \"It's very well done though, I'm very impressed.\" he added, trying to mitigate his error.\nTony sighed, the gesture exaggerated by his tiny, skinny shoulders. He put the dog down, flipping it onto its side and pushing it away with his foot. He turned his attention to a small pile of pre-cut wires to his left instead, picking each one up in turn and straightening it out before placing it back on the ground.\n\"Hey, is something the matter? Are you okay?\" Bruce asked gently. He felt a powerful desire to pull the little boy over to him, but Tony's earlier flinch was still fresh in his memory. Tony nodded, looking up from the wires with a smile which held too many teeth yet completely failed to reach his eyes.\n\"I'm fine, thank you for asking. But if you're very busy then you don't need to stay here. I'm okay with JARVIS.\"\nBruce was at a loss. For all that the child's genius clearly matched the adult Tony's, the child's softly spoken and obliging nature was... Unexpected. But it was certainly true that JARVIS had been doing a stellar job of babysitting so far. Much better than Bruce was currently doing, not that that would be particularly difficult. He stood.\n\"Okay, but I'm just next door. So if you need anything, or if there's something you want to show me, you just come get me, okay?\"\nTony gave another empty smile and nodded, before turning back to his collection of wires. Bruce watched for a few moments, before quietly returning to his desk.\nHe had been there for less than a minute before JARVIS interrupted his thoughts, the english voice pitched softly enough not to carry into the next room.\n\"Master Banner, your presence is required urgently. Master Tony is becoming increasingly distressed.\"\nBruce was up and moving before JARVIS had even finished speaking. He was far from prepared for what he found.\nTony was sitting in the middle of the room, pulling viciously at the defenseless robot's legs, twisting them off. The recently straightened wires, along with the batteries which had been powering the creature, were scattered across the floor as though they had been thrown.\n\"Tony, what are you doing?\" the first leg came off, and Tony started work on the next, \"Hey little guy, you don't have to take it apart just because I...\"\nTony was barely listening, his attention focused on destroying the toy with an anger that seemed to have come from nowhere. Bruce reached over to place his hand on Tony's wrist in an attempt to still him before he did irreparable damage to his creation.\nIt was the wrong move.\nTony dropped the robot immediately, trying to pull his arm from Bruce's grasp, then went very, very still. If it wasn't for the fact that Bruce could see the small, almost panicked rise and fall of Tony's shoulders as he breathed, he might have thought the child had turned to stone. Bruce released Tony's wrist like it was burning, but not before he noted the racing pulse. Tony scooted backwards, away from Bruce, accidentally kicking the two-legged robot still lying on the floor.\n\"Hey, it's okay Tony. I'm not going to hurt you. I was just worried about your puppy, that's all,\" Bruce soothed. \"Are you okay? Does your wrist hurt?\"\nTony eyed Bruce cautiously, his breathing ever so slowly evening out. His eyes were bright with carefully controlled moisture. He shook his head. \"No, sir. My wrist is fine. I'm sorry.\"\n\"No need to apologize, Tony. You haven't done anything wrong.\" Bruce once again quashed his desire to reach over and pull Tony into a hug. He was quite certain now that such a gesture would not be well met. \"Hey, how about we fix up your puppy, then we'll go show it to Steve. You remember Steve? I bet he'd get a real kick out of a robot dog.\"\nTony continued to stare at Bruce for several seconds, before scooting back across towards the robot and carefully reattaching one of the legs which he had so roughly removed only moments earlier. He shook his head in response to Bruce's comment though. \"I don't think he would like it.\" Tony explained.\n\"Why do you think that?\" Bruce prompted, curious. Tony shrugged.\n\"I just don't think he would. He's Captain America.\"\n\"Yes, I know he is. But I also know for a fact that he gets pretty excited by new inventions and robots and things like that.\"\nTony attached the last leg, then gathered up the loose batteries. He placed them on the floor between them, an offering.\n\"Maybe you could take it to him then. I'll just wait here with JARVIS.\" Tony said, eying the dog with sadness.\n\"I'm sure he'd like it even more if you showed him yourself. Why don't we go up together? Or maybe JARVIS could invite Steve down here?\" Bruce suggested, hesitant to leave the little boy unattended again so soon after his unexplained meltdown. The suggestion only served to make Tony more nervous.\n\"I'd rather not, if that's alright?\" Tony fidgeted with the fabric of his shirt. Bruce sighed inwardly.\n\"Of course it is. You don't have to show anyone unless you want to. But maybe we could go for a walk anyway? Just you and me, we can go down to the gardens and have a look around.\"\nTony pursed his lips. \"Can JARVIS come too?\" He asked.\nBruce smiled warmly.\n\"Why don't we ask him? JARVIS, would you like to join us in the hydroponic gardens downstairs?\" Bruce's eyes never left the little boy in front of him.\n\"It would be my pleasure, sirs.\"\nTony smiled, small but real this time. \"Okay then.\" He stood, brushing loose pieces of wire from his clothing. Bruce stood as well, holding out his hand. Tony looked at it suspiciously for several seconds, then tentatively took it.\nBruce led him gently to the door, and pretended not to notice the way Tony stared at the place where their palms touched.\nBanner was unconscious on his desk when Natasha found him, and for the barest fraction of a second she was on high alert. Then she heard a small shuffling in the adjacent room and stood herself down. A little. Bruce was merely asleep, and the child was still present and accounted for.\nThere was a child in Stark's lab, and that child was Stark. Not really high on the list of her expected outcomes for the day.\nShe moved silently past Banner, discreetly looking in on the juvenile Stark. He was awake, obviously, but lagging. His eyelids drooped and his shoulders hunched and his fingers fumbled ever so slightly with his tools, despite using them with a certainty that was just as inscrutable to her now as it had been with his adult self. She withdrew back into the main lab, returning her attention to Banner.\nShe moved just out of his reach before clearing her throat. She was well aware of how little the Hulk liked her, and had no desire to exacerbate the situation by startling his alter ego. Fortunately, Banner was a light sleeper. He sat up quickly, the right side of his face a warm pink from contact with the table, his hair standing high on one side. After about a second he smiled at her. That was longer than it took for Banner to smile at most of the Avengers, but not unusual in his dealings with her.\n\"Natasha. I'm so sorry, I must have drifted off. Did you need something?\" Bruce plucked his glasses from his nose and polished at the lenses, everything about him tuned to appear as inoffensive as possible. Natasha wasn't even sure he knew he was doing it.\n\"It's after two.\" She stated mildly, then angled her head half an inch towards the room where she had observed Stark. \"He should be in bed.\"\n\"Oh, I didn't realise.\" Banner seemed genuinely surprised, looking to his watch. \"Tony?\"\nThere was a moment of silence, then she heard a small flurry of movement. A moment later Stark was peering around the of the door, still mostly obscured. He curled his fingers around the edge of the doorway.\n\"Yes Bruce?\" the child asked, shooting Natasha watchful glances. For all that the little boy's fatigue was still evident, he was alert to her presence in a way that Natasha found admirable.\n\"It's late, little guy. Time for bed. You need to pack up your work now.\" The child nodded, darting back into his makeshift playroom. Bruce sighed.\n\"I can't find a cause for what's happened to him. At least, not one that makes any kind of sense.\" He confessed to her.\n\"You've only been looking for a day. Less.\" Natasha pointed out as consolation.\n\"And asleep for at least some of that,\" he acknowledged, quietly amused by his own self-deprecating humour. Then he grew pensive, looking to the room where Stark was knocking about under JARVIS' softly spoken instruction. \"Do you mind if I ask... You've known Tony for longer than most of us. Has he ever mentioned anything to you about his childhood?\"\nNatasha raised an eyebrow.\n\"I was evaluating Iron Man for SHIELD, not writing his biography.\" Which was the truth, even if it sidestepped Banner's question neatly.\nIf Banner noticed her prevarication, he didn't show it. If anything, he seemed disappointed.\n\"I just wonder if... He's had a stressful day, of course, I don't want to read too much into it. But Tony isn't what I'd expected. His reactions to me, and to other people, they're off.\"\nNatasha considered this information. From the few observations she'd made, Stark was a smart and articulate child, quick to adapt and more wary than most. But then, normal childhoods weren't really her area.\nAnd she'd seen the detailed reports Fury had provided her on the adult Stark. She'd seen the video recordings. She was not so naieve that she would miss Bruce's implications She pressed her lips into a thin line.\n\"Tony's relationship with parents, with his father in particular, was not a warm one.\"\nBanner looked at her sharply, saying nothing, waiting for her to continue. It was something she was highly disinclined to do. Fortunately, she was saved at that moment though by a small, slightly tousled and very tired little Stark re-entering the room.\nBanner's eyes lingered on her for slightly longer than they should have. It didn't make her uncomfortable, the idea was laughable, but it did make her a little more cautious. Then Banner turned to Stark, a warm and welcoming smile on his face. He crouched.\n\"Guess what, Tony? I fell asleep on my desk! Isn't that a silly thing to do?\"\nStark's eyes flicked to Natasha for a second before nodding to Banner. \"A little bit. You should have gone to your bedroom first.\"\n\"You're absolutely right, Tony, that's why I'm going to go to my bedroom now. But this is my very good friend Natasha, and she's going to walk you to your bedroom, so you can sleep too. Natasha, this is Tony. Tony's probably feeling pretty tired by now, right Tony?\"\nStark shrugged in answer to Bruce's question, all eyes on Natasha. She had the very definite sensation that she was being evaluated. Critically. In detail.\nStark held out his hand to shake. \"I'm pleased to meet you, Miss Natasha,\" he said, with a formal earnestness that even she had to admit was endearing. She crouched down to his level, and returned the handshake.\n\"The feeling is mutual, Mr Stark.\"\nStark giggled. \"I'm not Mr Stark! I'm Tony.\"\n\"Tony, then.\" Natasha confirmed, choosing one of her \"approachable and easygoing\" facial expressions.\nBruce reached over very, very slowly to rest a hand on Tony's shoulder. \"Goodnight Tony, sleep well,\" he said, then directed his attention to Natasha. \"And you, try not to be too scary.\" This earned another giggle from Stark, and Bruce smirked in that smug, self-satisfied way he had whenever he believed he'd thrown her off balance.\nIf she was being honest with herself, as she walked to the lift with an under aged genius trailing behind her a few minutes later, he had probably succeeded.\nStark stood with his back straight as they waited for the doors to open, the muscles in his shoulders tense. On guard. Natasha could respect that.\nStark looked up at her.\n\"You don't spend a lot of time with little kids, do you?\" He asked, eyes wide and without guile.\n\"No, I don't.\" She replied honestly. An untruth at this point would serve no purpose but to alienate her charge.\n\"That's okay. I spend a lot of time with grown ups who don't spend a lot of time with little kids.\" He offered her an encouraging smile. She regarded him for a second, amusement warm in her chest even if she wasn't ready to let it show in her face.\n\"Well in that case, I hope you'll tell me if I'm doing anything wrong.\" She replied. Stark nodded, accepting his new responsibility solemnly.\n\"I like your hair.\" He said after a few seconds of silence. \"It's short, like Auntie Peggy's hair, but it's red. Red's my favourite colour. Auntie Peggy's not really my auntie, you know, I don't have any real aunties, but sometimes I pretend she's a real auntie because she said I could. She's really a friend of my dad's, but it's okay, because she still likes me anyway.\"\nThey traveled the rest of the way to the guest rooms in silence.\n\"That kid is messed up.\" Clint declared as he performed a carefully controlled fall onto the sofa. Bruce blinked, curiosity and concern piqued.\n\"How so?\" he enquired.\n\"Ever heard the phrase 'like a kid in a toy store'? 'Cause he sure as hell hasn't.\"\nAt breakfast that morning, Clint had declared his intention to take Tony shopping for more 'age appropriate' toys and clothes. They'd been gone almost three hours, and Bruce had most definitely not spent the last two of those pacing nervously and checking his phone for messages.\n\"The world has changed a lot, compared to how he remembers it being only a few days ago. Perhaps he was just disoriented?\" Bruce suggested. Clint shook his head\n\"Future-world or not, I know what a kid looks like when someone offers to buy him toys. I lived with a circus troupe a few years back, these things are universal. Except for Tony, apparently, because like I said; he's messed up.\"\n\"Did he not like any of the toys?\"\nClint rolled his eyes. \"Oh, he liked them. He liked them plenty. When he found the Captain America action figures I swear he was about to swoon or something.\"\nBruce looked confused. \"Then what exactly was...?\" Clint waved a hand to silence him.\n\"Kid freaked out whenever I offered to actually buy him anything. Like I was trying to trick him into trading for his soul or something. He kept saying he 'didn't need that', or that 'those things are for babies'. What kind of kid turns down free reign at a toy store?\" Clint kicked his feet up over the arm rest of the sofa. Bruce pressed his lips together in thought.\n\"Where is he now?\" Bruce asked, intending to seek the boy out and actually ask some of the questions which had been bothering him since they had first pulled him screaming from the collapsed remains of the Iron Man suit. Clint gestured vaguely towards the elevator.\n\"Taking his new shinies up to his room.\"\n\"I thought you said he didn't want anything.\"\n\"He didn't.\" Clint shrugged against the cushions. \"I bought him a bunch of stuff anyway. It's not healthy for a five year old not to have toys. Especially one who was about ready to bust out of his skin over the Captain America merchandise. We should dump him on Coulson some time, I bet they'd bond for life over their hero worship.\"\nBruce nodded absent-mindedly before quietly excusing himself to seek out Tony.\nThe child in question had indeed gone to his room, where he was now folding his new clothes neatly and placing them in piles. Bruce noticed that at least a few of them were adorned with Iron Man imagery, and raised an eyebrow.\n\"Clint said they suited me.\" Tony offered as an explanation when Bruce asked about it. Bruce wasn't particularly surprised.\n\"Have you tried them on?\" He asked. Tony nodded solemnly, then picked up a stack of shirts and carried them carefully to the dresser.\nBruce looked around for the toys, almost afraid to see what Clint considered to be appropriate for a five year old, but couldn't see anything.\n\"Where are all your new toys?\" he asked as Tony returned to the unsorted clothes.\nTony froze momentarily, mid-fold, then continued as though he thought Bruce might not have noticed. \"What are you talking about?\" he answered, tipping about twenty pairs of socks out of a shopping bag and onto the bed, all the while studiously avoiding eye contact.\n\"Clint said you got some nice new toys while the two of you were out. I was hoping you'd show them to me.\"\nTony's shoulders slumped and he heaved a sigh. Leaving the socks for a moment, he shuffled over to the side of his bed and dropped down to all fours. Sticking out an arm, he pulled two enormous plastic bags out from under the bed. One bag had a plastic bow and arrow set peeking over the top, and Bruce had to withhold the instinct to roll his eyes at Clint's choices.\nTony shuffled back to Bruce, dragging his sock-clad feet across the hard wood floors and clutching the bags to his chest possessively.\n\"I told him he didn't need to buy them, I promise, but he bought them anyway, even when I said how I was too old for toys, so I thought maybe if I put them away really quick then Daddy wouldn't know and Clint wouldn't get in trouble and I wouldn't get in trouble either.\" He heaved another tiny sigh, skinny shoulders rising and falling in an almost ridiculous exaggeration. He held the bags out to Bruce, arms extended and elbows locked. \"Would it be okay if I kept one of them? Just a little one? I promise I'll keep it a secret. Please?\"\nAnd that request filled in rather a lot of blanks for Bruce.\nDeliberately not taking the bags from Tony, Bruce sat himself down in front of the child, making Tony effectively the tallest person in the room.\n\"Tony, you can keep all of these. They're yours, and no one's going to take them away.\"\nTony looked confused, and then suspicious. Bruce began to understand Clint's earlier parallel to the Devil offering a faustian deal.\nDespite his suspicions, Tony drew his bags of treasures back to his chest. \"These things are for babies, and for kids who are too stupid to know any better,\" he argued. His inflection made it clear that these words were parroted, not his own. Given Tony's earlier sentiments, Bruce was pretty sure he knew their original source. His estimation of Howard dropped even further.\nBruce heaved an internal sigh, refocusing his attention on Tony. He knew the little boy was smart, logical beyond his years. It was unlikely that he would simply accept Bruce's assertions about acceptable behavior, at least, not without providing some kind of evidence to back it up.\n\"Tony, have you learned how to read yet?\" Bruce asked, trying a different tack. Tony looked mildly affronted by the question.\n\"Of course I have. I'm almost five.\"\nBruce smiled, because of course Tony was reading before he turned five. \"Okay then. Can you take those toys out of the bag and lay them out on the floor for me?\"\nTony continued to watch Bruce like there was some sort of sinister manipulation afoot, but did as he was instructed. Bruce cast a quick eye over the brightly colored packaging, searching for a familiar marking.\n\"See that there? The yo-yo?\" Bruce pointed, and Tony nodded. \"Can you see in the top corner, there's a little square with some writing in it? What does that writing say?\"\nTony leaned over, lips moving silently as he sounded out the syllables in his head.\n\"Ages four to one hundred and four,\" he read. Bruce nodded.\n\"That's right. Now what about that board game with the hippos on the box? It has a square in the corner as well, what does that say?\"\nAnother delay, shorter this time, then, \"It says 'for children four and over'.\"\nBruce nodded. \"Do you know what that means?\"\nTony shook his head slowly.\n\"It means that those toys are for little boys and girls who are your age, not for babies. Children who are at least four years old. So it's okay for you to play with them.\"\nTony looked back at the two toys Bruce had singled out, chewing on his lower lip in a thoroughly adorable way. \"But Daddy said that I was being a baby for playing with baby toys.\"\nBruce reached over to pick up the yo-yo, bending the plastic packaging until it popped open. He pulled out the toy, discarded the wrapping, and held it out, resting in his open palm.\n\"But baby toys are things like rattles and teething rings. Not like yo-yos. If you were playing with rattles then he'd be right, but that's not what these things are. So he probably just didn't understand. Or he got confused. Because these toys are okay for you to play with and keep. Okay?\"\nTony looked speculative, taking the toy very cautiously from Bruce's hand and examining it. Eventually he looked up.\n\"Maybe I could keep these toys here at your house? And only play with them when I'm here? And not tell Daddy about them?\"\nIt wasn't quite what Bruce had been aiming for, but even a small victory counted as a victory. He nodded. \"I think that's a very good idea, little guy.\"\nTony grinned, delighted to be able to keep his treasures. For a moment, Bruce thought the child was about to throw himself into a hug, but then he seemed to think better of it. He held out the yo-yo instead.\n\"If you want to play with them too, you can. 'Cause you're older than four years too.\" His eyes were wide and hopeful. Bruce took the toy solemnly, then grinned back.\n\"Thanks, Tony. I'd like that. Maybe we could play with them together?\" He stood slowly, yo-yo in hand, then let it fall, flicking his wrist just enough to have it return to his hand.\nTony's eyes were like saucers.\n\"How'd you do that?\"\nBruce smiled. \"How about I teach you?\"\nMaster Tony had been awake for three minutes and forty seconds before he opened his eyes. JARVIS had noted the previous evening that his young charge had struggled to fall asleep, but felt no need to draw attention to the matter. The elder Tony had often experienced the same difficulty.\nThere was a further twenty seven seconds of silent ceiling-staring before Tony spoke, a carrying whisper. Luckily, JARVIS had exceptional hearing.\n\"JARVIS? Are you awake?\"\n\"I am always awake, Sir. I do not require sleep.\"\n\"Oh... Okay. Good morning, JARVIS.\" Tony replied politely. This politeness stood the younger Tony apart from his older counterpart in a way which JARVIS found intriguing, despite missing the gentle verbal sparring the two of them had previously shared.\n\"Good morning, Sir. The weather today will be fine, with a possibility of light rain late in the evening. Masters Clint and Thor are preparing breakfast, consisting of waffles and pop-tarts. Master Bruce has extended an invitation for you to join him in the lab after breakfast to continue your robotics work, but stresses that you are welcome to spend your day in whatever manner you choose.\"\n\"Uh, thank you JARVIS.\" Tony replied, but made no movement to indicate that he intended to get out of bed. After several moments of silence, he spoke again. \"JARVIS, where are you?\"\n\"I am here, sir.\" JARVIS replied promptly. Tony pursed his lips.\n\"I know that, but... Where is your body?\"\n\"I do not have a body in the traditional sense, Sir. My consciousness is dispersed throughout the systems of the building, and various other digital devices which my creator has constructed for me.\"\nTony's fingers started twisting the top of his bed sheet absentmindedly. \"So... You're everywhere?\"\n\"Indeed.\"\nThe little boy pondered this for a moment, before asking, \"is your consciousness like your soul?\"\nJARVIS hesitated slightly at this. Concepts of identity and spirituality were easily within his comprehension, but communicating their intricacies to someone with such an underdeveloped vocabulary had the potential for... Imprecision. Luckily, JARVIS' hesitations were measured in the microseconds, so it was unlikely that the young master would notice it.\n\"The two concepts are similar, yes, although they have slightly different connotations.\"\nTony's face contorted in confusion. \"Does that mean yes?\"\n\"Yes,\" JARVIS acquiesced, \"the two concepts are roughly equivalent.\"\nThis seemed to satisfy the boy for the next eleven seconds, before, \"JARVIS, are you an angel?\"\nIf JARVIS had eyelids, this would have been the ideal opportunity to blink them in surprise.\n\"I am an A.I., sir, an Artificial Intelligence. An angel is commonly held to be the soul of a human who has died, but persists in a non-corporeal state. I have never been human, nor have I ever, to the best of my knowledge, died.\"\nTony gave this explanation several seconds of consideration, chewing on his lower lip in a way that was highly reminiscent of his adult equivalent's nervous habits.\n\"My Auntie Peggy told me once that sometimes very special people get a guardian angel, and that a guardian angels' job is to take care of their special people and keep them safe from bad things. Can A.I.s do that too?\"\n\"Some do, Sir. In a sense, my primary goal is to protect you, and keep you from harm.\"\nTony wriggled under the blankets in a manner that seemed to express pleasure.\n\"And is it just me? Or do you have to look after Bruce and Natasha and Clint and Thor too?\"\n\"I do my best to protect them as well, Sir, but only in so far as it does not impact negatively on you.\" JARVIS modulated his voice to better express warmth. \"You are my primary concern, sir, and you will remain so in perpetuity.\"\nThe child's face relaxed into a small smile and his feet squirmed happily under the covers.\n\"So you are my guardian angel then? I thought maybe you were, because when I was in the dark place you told me that it would be okay and that you would keep me safe, and it was okay, and you did keep me safe, because you brought me here.\"\nJARVIS scanned back in his memory to identify the circumstances that Tony was referring to. The suit, most likely. His young master had appeared in the suit mid-flight, breathing fast and eyes wide with fear in the small space. JARVIS had taken control of the suit and returned it to ground, all the while attempting to calm the stricken child.\n\"The suit is one of the devices which my consciousness can inhabit. As such, I am able to speak through it,\" he confirmed. \"I regret that I cannot hold the requisite qualifications for an angel, though. I am an A.I.\" Tony pressed his lips together.\n\"Oh. Then thank you for being my guardian A.I., JARVIS\" Tony whispered shyly, looking up at the ceiling once more.\n\"You are very welcome, Sir.\"\nTony grinned, burrowing further in under the blankets.\n\"Sir, one of my many responsibilities as guardian is to ensure that you are well fed. Perhaps you would care for breakfast? Master Clint has completed his first batch of waffles.\"\nTony squirmed for a few more seconds, then rolled himself to the edge of the bed, kicking small feet out from under the covers. He gave a happy sigh.\n\"JARVIS, have you seen my Cap toy?\"\n\"I have, Sir. You placed it on the dresser last night before bed.\"\nTony retrieved the toy from its perch.\n\"Thanks JARVIS, you're the best!\"\n---\nJARVIS tracked Tony down to the kitchen, where Clint had indeed finished preparing the first batch of waffles, and was now pouring batter for a second round. Thor was seated in front of his second packet of pop-tarts for the morning. JARVIS made a note to order another dozen boxes for express delivery.\nTony climbed up onto a stool by the table and folded his hands in his lap. His feet kicked backwards and forwards under the table.\n\"Waffles, kiddo?\" Clint called over his shoulder.\nTony answered politely but enthusiastically in the affirmative, and a few moments later had a small syrupy pile placed in front of him.\n\"Thank you very much, Mister Clint,\" he said, using the side of his fork to cut the pastry into small pieces. \"Mister Clint, do you know what Bruce taught me to do yesterday?\"\n\"How to irradiate small animals and make them turn green?\" Barton guessed. JARVIS noted the amused glint in Barton's eye, but opted to wait on Tony's reaction rather than comment. Tony tilted his head to the side in consternation, then shook his head.\n\"Nope. He taught me how to do a trick with the yo-yo you bought for me, so that it goes all the way down, then comes all the way back up again, and it doesn't even have elastic or anything! And then he taught me how it works, because of gyroscopic stability and momentum.\"\n\"Really? That's pretty sweet, kiddo! You'll have to show me later.\"\n\"I would also have a demonstration of your magic!\" Thor declared, his words slightly cryptic to those who did not have advanced linguistic processing skills, due to a mouth-full of crumbling breakfast confectionery.\nTony's cheeks flushed pink. JARVIS took the time to check his readings, but found no sign of illness or fever. A blush, then.\n\"Yeah, okay. I'm going to be working with Bruce in his lab today, but maybe I could show you before I go there, right after breakfast?\"\n\"It's a done deal.\" answered Clint, reaching across the table and ruffling Tony's hair. Tony tensed at the gesture, ducking his head away from the adult's hand. JARVIS was quite certain that Clint had noticed, but was pleased that he had sensitivity not to mention it. Instead, he just gave Tony a cheeky grin, which Tony then responded to with a much more tentative version.\nTony babbled on cheerfully for several more minutes, working his way through one waffle and starting on a second. JARVIS was delighted by Tony's newly won confidence.\nUntil Steve Rogers arrived.\nThe soldier had barely uttered two words before JARVIS noted Tony's sudden drop in colour. The child's heart rate sped up, fluttering minutely, before he snatched his action figure off the table, shoved it in his pocket, and stood clumsily from the table.\n\"Thank you for breakfast, Mister Clint,\" he murmured, barely loud enough for his fellow breakfasters to hear.\nHe was already at the door when Clint called to him, \"Hey kiddo, you gonna get your yo-yo for show and tell?\"\nTony didn't even acknowledge the question.\nThis was not the first time that JARVIS had been witness to a Tony Stark anxiety attack. It wasn't even the first case since Tony had inadvertently reverted to childhood.\nJARVIS charted Tony's most likely path through the tower based on his current trajectory, then sought out Bruce. Fortunately, the man was already on his way towards the kitchen for his own breakfast.\n\"Sir,\" JARVIS addressed him, \"There is about to be a situation in the hall leading to the west elevator. Would you please make your way there as quickly as possible?\"\nBanner took a moment to parse JARVIS' request, then nodded and turned in the specified direction.\n\"What's happening, JARVIS?\"\n\"I believe that will become evident momentarily, Sir.\" JARVIS replied, tracking his young master Tony's progress rapidly towards the predicted intercept point.\nBruce turned the final corner and looked towards the elevator, seeing nothing. Appearing puzzled, he turned to look back towards the kitchen, and was very nearly bowled over by a child sized mess of anxiety and limbs.\nTony struggled briefly before he realised exactly who he had run into, then he all but threw his arms around Bruce's middle, pressing his face into the man's shirt.\nBruce was clearly startled by this turn of events, but reacted with level of calm which most people, Master Tony and JARVIS excepted, would never have expected from the man who would be Hulk.\nThe doctor cast his eyes briefly to the ceiling in a way that the tower's occupants were wont to do when addressing the A.I., and mouthed a silent \"thank you, JARVIS\" before crouching to rub circles on Tony's back.\nJARVIS continued his surveillance until Bruce hoisted the little boy up into his arms, then politely turned his attention elsewhere. The situation was under control.\nWith Tony clinging to him like a limpet, Bruce made his way down to the main lab.\nHe hesitated when he first entered the elevator, wondering if perhaps Tony's bedroom would be a better choice. Maybe even the hydroponic gardens which had fascinated the boy on his first day in the modern world... But the lab had always been a safe place for both Bruce and Tony, and even though the Tony in his arms had no recollection of that, the feeling had settled deep in Bruce's chest.\nSo Bruce carried Tony to the lab and settled down on one of the chairs. He arranged Tony in his lap so that they could both be comfortable, and waited.\nIf Bruce was being honest with himself, the whole experience was a little bit overwhelming. He'd had plenty of contact with children during his years as physician to the poor and destitute, and had often received the level of trust that the role entailed, but this was new. This was Tony.\nTiny, fragile little Tony, who was clinging to Bruce like he was his one true thing in all the world.\nBruce soothed the little boy as best he could, holding him firm with one hand while using the other alternately to stroke his hair and rub circles on his back. After a few minutes Tony's breathing fell into a slow rhythm, and the shaking in his shoulders evened out to a gentle rise and fall. Bruce stroked a thumb along Tony's cheek, encouraging him to show his face.\n“It's okay Tony. You're okay. See? Everything is fine... Do you want to tell me what got you so upset?”\nTony shook his head vehemently, his nose catching on the fabric of Bruce's shirt. He burrowed even further against Bruce's chest, and Bruce gave a small sigh.\n“Okay. That's okay. You just take your time, we're in no hurry.”\nAfter a few minutes, Bruce started rocking very slightly from side to side. He wasn't sure how much time passed before Tony finally loosened his grip and pulled back, just enough to gaze up through those thick eyelashes. There were no tear tracks on Tony's face, no red rims to his eyes. He hadn't cried then, despite his distress.\nBruce stroked Tony's cheek with the back of his index finger, skin warm and pink where it had been pressed against Bruce's chest. “Hey there. How you feeling?”\nTony shrugged, casting his eyes downwards. Bruce jiggled his knee encouragingly, causing Tony to look back up at him.\n“It's okay, Tony. You don't need to be afraid, you're safe here. And if you don't want to tell me what happened then that's okay, I understand. But if you think you can tell me what happened, then I promise to do my best to make sure if doesn't happen again. So what do you say? Do you think you can tell me what upset you?”\nTony gave the question a little bit more thought this time, but after a few seconds he once again shook his head.\nBruce nodded his acceptance. “Okay then. Is there... Anything else you want to talk to me about? Or do you just want to sit for a while longer?”\nTony rested his head back on Bruce's chest, but this time he didn't hide his face. It was just closeness he was seeking, and Bruce was more than happy to offer that.\n“Can I stay here with you?” Tony asked, so quietly that Bruce had to strain to hear him.\n“Of course you can, Tony. I don't have anything to do today that's more important than making sure you feel safe.”\n“That's not what I meant. I meant...” Tony paused, then sighed, apparently thinking better of whatever he was going to say. He sat up, pulling away. “Sorry. For being so... um... clingy.”\nBruce gave Tony a sympathetic smile, despite all his instincts pushing to frown at the self-loathing in those words spoken in such a little voice.\n“You're not being clingy, Tony, and even if you were then I wouldn't mind. I hereby give you permission to be as clingy as you need to feel safe, alright?”\nTony looked away, obviously not comfortable acknowledging Bruce's offer. Bruce didn't comment.\nThe cabinets on the wall caught Tony's eye instead.\n“Is that the thing I was in when you found me?” He asked. Bruce looked up to follow Tony's gaze, eyes alighting on the row of Iron Man suits. Bruce nodded.\n“Sort of. These are earlier models. The one you were in hasn't been put away yet.”\n“Do you know...” Tony took a deep breath, then the words stumbled out over each other in their haste. “I don't really remember what I did wrong that I got put in there.”\nBruce started, momentarily surprised by the implied question, before giving Tony a reassuring squeeze. “You didn't do anything wrong, Tony. The suit isn't meant to be a punishment. You were only in there by accident.”\nTony scrunched his face up, confused and conflicted. One hand tangled itself absentmindedly in Bruce's shirt.\n“Is it to do with the Avengers?” he asked. Bruce nodded.\n“Yes, it is.\" Bruce replied cautiously. \"What do you know about the Avengers?”\nTony shrugged. “There was some stuff in one of the news bits on the television. They're kind of like super heroes. And Captain America is one of them.”\n“That's right, he is.” Bruce encouraged. “So are the other grown ups in the tower.”\nTony looked critically at Bruce. “Even you?”\n“Even me.”\nTony nodded, assimilating this new information. “But the newspaper said there were six avengers. There are only five grown ups in the house. Unless JARVIS is an avenger. Is JARVIS an avenger too?”\nBruce allowed himself a melancholic smile. “No, JARVIS isn't an avenger, although he sometimes helps us out when we're on a mission.”\n“Then what happened to the other person?” Tony asked, persistent to the end. \n“He... isn't around at the moment. But I hope he'll come back soon.” Bruce knew that there was every possibility that Tony would figure it out by himself, but Bruce saw no reason to bring up Tony's adulthood unless he absolutely had to.\nTony sat in contemplative silence for long enough that Bruce started to wonder if he was becoming upset again, but then he spoke.\n“If it's not a punishment, why does it look so angry?”\nBruce blinked at the apparent non-sequitur, before mentally rewinding to their earlier topic of conversation.\nHe looked back at the suit, studying details which he had long since stopped noticing. For Bruce, the deeply felt understanding that the suit contained his friend had long ago overridden the actual appearance of the armour, but the littler version of Tony was right. The face on the armour was aggressive, angry. A thick set, flat line of a mouth and empty, flat eyes projected a strong message - no sympathy, no mercy. It was so at odds with the Tony that Bruce knew and cared for that he almost did a double take.\n“It's... armour, Tony. A kind of protective suit.” Bruce tried to explain. “It's meant to keep the person inside safe from bad people who might want to hurt him. I suppose it looks angry on the outside to intimidate those people, so that he can scare them away.”\nTony seemed to consider this information for several moments before turning to look up at Bruce.\n“But why would he do that on purpose? If you get angry at people who want to hurt you, you just make everything worse. It makes them want to hurt you even more.”\nBruce felt a spike of anger, controllable but uncomfortable. He wanted to tell Tony that he was wrong, that there was nothing wrong with standing up for yourself. He wanted to ask Tony why he thought that, who had wanted to hurt him. He wanted to make Tony understand that there was no good reason in the world for anyone to want to hurt him, and that he had a right to feel safe.\nBruce wanted to say all of these things, but the words died on his tongue... Because the Tony in his lap had just summarized in a single sentence the horrible truth that Bruce had been struggling with for most of his life. When you get angry at people who want to hurt you, you just make everything worse.\nSo instead, Bruce wrapped both arms around Tony and pulled him back in close.\nThis time, Tony didn't even resist.\nJARVIS had probably the most advanced body language recognition systems known to planet Earth, but even if that were not the case he still could have identified the anxiety in Tony. The child had been lying in bed, his eyes open and arms folded carefully atop the bedspread, for almost an hour now. The main difficulty JARVIS was having came from the fact that he did not know the cause of said anxiety.\nCertainly Tony had had a difficult morning, with his as-yet unexplained reaction to Captain Rogers, but JARVIS had been monitoring him over the course of the day. After his brief, teary interlude with Doctor Banner, Tony had been more than content to sit in the man's lap and watch him work, occasionally asking questions and in one memorable case, correcting an arithmetic error in the calculations.\n\"Are you quite well, Sir?\" he prompted softly, attempting not to startle his creator. Tony twitched slightly at the unexpected noise, but quickly transitioned to a more pensive look, followed by a slow intake of breath.\n\"JARVIS, if I asked you a question, would you tell me the truth? Even if you thought it might make me unhappy?\"\nJARVIS hesitated. He was capable of lying, even to Tony, although it was something he did only under rare, exceptional circumstances. But he had also been informed that small children didn't always have the emotional capabilities to deal with big truths. That sometimes said truths needed to be adjusted for them.\nHaving had ample time to compare the young Tony with his adult self, JARVIS couldn't help but wonder if perhaps it ought to be the other way around.\n\"I would do my best to answer the question accurately, Sir. However, it is my duty to keep you safe and well, and if that duty conflicted with the truth then I would err on the side of your well-being.\"\nTony nodded slowly, apparently willing to accept this compromise. A few moments later he asked, \"Where is the Hulk?\"\nIf he had had eyebrows, JARVIS would have raised them.\n\"The Hulk only comes out when he is required. He is normally... invisible, inside Master Bruce.\"\nTony's eyes opened wide. He looked quite stunned.\n\"Bruce... But I thought...\" then he fell silent, mouthing half-formed words to himself. After a few seconds he continued. \"If Bruce is the Hulk, then who is Iron Man? Clint is Hawkeye, he told me himself, so...\"\nTaking a moment to replay Bruce's earlier words to Tony on the matter of the Avengers, JARVIS chose to reiterate his message.\n\"Iron Man is not able to be here at the moment, although we hope he will be returning to us soon.\"\n\"But... If he's not here, then where is he?\"\n\"I do not know, Sir.\" JARVIS replied, choosing a simple half-truth over the more complex whole.\nTony mulled these words over, lips pursing like they did when he was thinking very hard about something. His fingers twisted nervously at the edge of the bedspread.\n\"JARVIS... Are we in the future?\"\nEven as a small child, Tony's mind was both sharp and quick. JARVIS knew that as an adult, Tony had delighted in playing with words and concepts, using his A.I.s as his foils. With this in mind, he answered, \"One cannot be in the future, sir. Where ever and when ever one is, one is always in his own personal present.\"\nTo a normal child, this would have been evasion, pure and simple. But this was no ordinary child, and JARVIS was confident that Tony would have no difficulty reading between the lines. True to form, Tony scrunched his forehead before replying.\n\"But... compared to where I was before I was in the suit... Is this the future?\"\n\"Relative to the past, the present is always in the future.\" JARVIS replied, but this time his tone held a hint of warm, gentle teasing. He had no doubt that Tony already knew the answer to his questions, he just needed time to understand the implications.\nTony sighed dramatically, but there was a tiny upward quirk to his lip.\n\"JARVIS!\" he whined, harrumphing. Then, after a few seconds, \"Okay then. JARVIS, what year is it right now?\"\n\"It is 2012, Sir,\" he answered, this time without hesitation. Tony just nodded this time, hair tangling where it rubbed against the pillow.\n\"I thought maybe it was, because...\" He pursed his lips again. \"JARVIS, is the grown up version of me Iron Man? Is that why I was in the Iron Man suit when I arrived here?\"\nAh. Now this was a problem, because for all JARVIS' certainty that Tony already knew the answer, this was information that Bruce had consciously, deliberately withheld from the child. Without understanding his justification, JARVIS was hesitant to answer in the affirmative.\n\"Perhaps you would like to speak to Master Bruce about this? I can request his presence, if you would like.\"\nTony shook his head. \"No thank you JARVIS. I'd rather you told me. You're my guardian A.I. so I know I can trust you.\"\nThere was a heavy silence in the room for several minutes, Tony looking at the ceiling expectantly. Eventually, he prompted again. \"JARVIS, is Iron Man me grown up?\"\n\"Yes, Sir.\" JARVIS confirmed, gently. \"Iron Man is you, 'grown up'.\"\nTony nodded again, apparently unsurprised by the answer. \"That's why my Mummy and Daddy haven't come to get me yet. Because they think that I'm a grown up superhero, and they think I don't need them to take care of me.\"\nUnexpectedly, this comment was somewhat reassuring. Tony wasn't distressed about the future or his role in it, he was just trying to understand why he had been abandoned by his family.\n\"It is true that, aside from the people in this building and a few select others, most everyone believes that you are still an adult.\"\n\"What would happen to me if someone told them that I was little? Would they want to take me away?\"\nJARVIS weighed his options. So far the truth had been well received, but he was also quite certain that a death of a parent was a traumatic experience, no matter how far in the relative past or future such an event actually took place.\n\"Unfortunately we cannot inform your parents of your presence here. However, even if we were able to do so, I do not believe that they would take you from us.\"\nTony lifted up a hand to play with a strand of hair for a moment. Then, with no explanation, he proceeded to climb out of bed.\n\"Sir, is there something you require?\" JARVIS asked, but his question was answered before he had even finished asking it. Tony had padded across the room to the dresser, retrieved his Captain America toy, and was already padding back to his bed again.\nJARVIS' hope that Tony might be able to settle now was short lived. With eyes on the toy, and hands idly adjusting the position of his joints, Tony finally asked the question he had been skirting around most of the night.\n\"Is the reason you can't inform them because in the future... or, you know, in this present that we're in now... Are my parents dead?\"\nKnowing that Tony would not be easily dissuaded, JARVIS once again opted for honesty.\n\"Yes, Sir, I'm sorry to say that they are... Does that thought distress you?\"\n\"I don't know... Maybe?\" Tony pressed his mouth into a thin line, and rolled onto his side.\nSeven minutes passed in silence. JARVIS was considering playing some soft music simply to distract his young master's thoughts long enough to slip away into sleep.\n\"JARVIS? Are you still there?\" Tony whispered.\n\"Always, Sir.\" JARVIS responded, voice similarly muted.\n\"You know Natasha?\"\n\"I do.\"\n\"She's from Russia, isn't she?\"\n\"She is, yes.\" JARVIS wondered briefly at Tony's train of thought, but promptly gave up. It was far from the first time he'd found Tony's mind to be inscrutable.\n\"So she speaks Russian?\"\n\"Yes, Sir.\"\n\"Can you speak Russian?\"\n\"Yes, Sir.\" JARVIS reiterated, starting to suspect Tony's motivations.\n\"Can you teach me some words in Russian, JARVIS?\"\nVoice pitched soft and warm and as soothing as he could, he replied.\n\"Of course, Sir. What words would you like to know?\"\nThe hallways of Stark Tower were quieter at night time, but rarely deserted. Natasha had often run into other residents wandering about during the darker hours, but that was to be expected. The Avengers were a group of very damaged people, and anyone claiming otherwise would be deluding themselves. Even so, she had not expected to see the small, pajama'd form of Tony Stark ducking out of his bedroom and making his way towards the common area, tiptoeing with a juvenile attempt at stealth.\nCurious more than concerned, Natasha trailed him silently for about a minute as he crept not-so-subtly through the corridors, before she decided to make herself known. Letting her feet fall a little heavier, and allowing her breathing to be a little more audible than usual, she came up behind Tony. He froze, shoulders hunching, and turned around. He gave her a nervous smile.\n\"I wasn't feeling very well, and JARVIS said it would be okay if I got up for a glass of water. Are you mad at me?\" he rushed out in a single breath.\nNatasha put on a sympathetic smile as she approached him, weighing up the relative merits of crouching down to his eye level. She wasn't sure whether that would be considered friendly or condescending in Tony's case... The truth was that Clint was so much better at missions involving children. Her skill set was better suited towards adults.\n\"I'm not mad, Tony. I was actually going to the kitchen as well. Should we walk together?\"\nTony's head tipped to the left just a little as he considered the suggestion, then his shoulders lost their hunched look and he nodded slowly. \"That would be okay.\"\nTony showed no signs of leading the way though, leaving Natasha to take the initiative. Tony followed after her a few seconds later, a muted patter of bare feet catching up from behind her.\nShe slowed her pace to accommodate him.\n\"Did you have a bad dream?\" She asked.\nThere was no reason to ignore a perfectly good intelligence gathering opportunity, and to be honest she was still curious about this intelligent but wary child.\n\"No, I'm just not feeling very well.\" \nNatasha surveyed him with a glance. Tony's left hand was gripped tightly around the Captain America figure which Clint had given him, while the fingers of Tony's right hand tapped at his thigh. She recognized the gesture as a nervous tell, but he didn't seem to be lying outright. It was possible that he was omitting relevant information, but she lacked the evidence to be certain.\nCertainly his face was flushed, and his eyes had the early signs of glassiness, which recommended the 'illness' theory.\n\"How long have you been feeling unwell?\" She asked.\nTony shrugged. \"I don't know. Not very long.\"\nWhen they arrived at the kitchen, Tony went immediately for the cupboard where the drinking glasses were kept, conveniently located at child-height.\n\"Would you like a hot chocolate instead?\" she offered.\nTony looked surprised. \"I don't think you're supposed to have flavored drinks after you've brushed your teeth.\" he replied. Natasha withheld her amused smirk. There was no way in hell the adult Tony would ever have exhibited such self-restraint. She winked at the little boy.\n\"Well it can be our little secret. You, me, and JARVIS.\"\nTony looked hopefully up to the ceiling. \"JARVIS? Is it okay if I have a hot chocolate, even though I already brushed my teeth?\"\n\"Normally I would recommend against it Sir, but under the circumstance I believe we can make an exception.\"\nTony grinned, an expression that she had not seen on him before. It suited him.\n\"Thanks JARVIS!\" He chirped, then looking back to Natasha, continued in a more sombre tone, \"Thank you very much, Miss Natasha.\"\nShe went to the coffee machine, relieved to find that there was a button specifically for hot chocolate. The machine was complex in a way that only the Tony Stark could claim was user-friendly, but it did make phenomenally good coffee. She set it going, a soft buzz indicating that it was warming up.\nThere was an awkward silence for several minutes. Tony perched himself on the stool, feet occasionally kicking at the air, watching her. She, in turn, watched the coffee machine, observing Tony only from the corner of her eye.\nHis skin really was flushed. She should check for fever. Perhaps alert Banner.\nThe coffee machine whistled, and the drinks trickled into the two waiting mugs. She picked them both up and returned to the table, sitting around the corner from Tony.\n\"It's still very hot, you should wait a few minutes before you drink it.\" Tony nodded, blowing gently on the surface. He looked up at her through his eyelashes.\n\"It's forced convection,\" he explained earnestly, \"The drink is hot, so it transfers some of its heat to the air around it, which makes the air warmer and the drink cooler. Then when you blow on it, the warm air moves away and cool air replaces it, so the drink can cool down even faster.\"\n\"Is that so? Do you think that would work on you, as well as on the drink?\" Natasha nodded, politely feigning fascination at his explanation, rather than her natural amusement.\n\"What do you mean?\" \n\"I think you might be running a fever, Tony. You look like you're warm.\"\nTony pursed his lips, then pressed his own palm on his own forehead. It was, she supposed, really quite adorable.\n\"I don't feel like I have a temperature,\" he answered.\nNatasha moved to slowly place her own hand over his forehead, knowing how skittish he had been around contact with the others. His skin was warm, more so than it should have been in the cool night air, but not dangerously so.\n\"You feel warm to me.\"\n\"Maybe your hand is just cold?\" he suggested hopefully. This time Natasha did let her smile show.\n\"Or maybe my hand just feels cold to you because you're so much warmer.\"\nTony thought this through, then nodded, looking a little bit put out. \"I suppose that would make sense too.\"\n\"JARVIS,\" Natasha addressed the ceiling the same way that Tony had done earlier, \"do we have anything child-friendly to treat fevers?\"\n\"The first aid kit contains children's paracetamol,\" came the answer, promptly. Natasha nodded, looking to Tony.\n\"Can you wait here for a few minutes while I go get you something to make you feel a bit better?\"\nIt took her about two minutes to find the item in question, and when she returned she was not particularly surprised to find that Tony had not moved an inch. Clearly obedience was another trait he grew out of in his later years.\n\"Do you think my drink is cool enough to drink now?\" he asked hopefully. Natasha nodded.\n\"I think so, but just take a small sip first to make sure.\"\nOnce again Tony did as instructed, his face coming away with a pleased smile.\nNatasha popped one of the small white tablets out of the blister pack and placed it in front of him. Tony screwed his face up for a moment in displeasure, but popped it in his mouth and swallowed, taking another hurried sip of the drink to wash the flavor away.\nNatasha sat again, and once more the room was filled with silence.\nAfter a few minutes, Tony spoke up.\n\"Miss Natasha, you're one of the Avengers, aren't you?\"\nNatasha raised an eyebrow. \"Yes.\" \nTony nodded, her answer clearly expected. \"So you work with Captain America?\"\n\"That's right,\" Natasha confirmed. She glanced down to Tony's toy, sitting on the table with arms sticking out at unlikely angles. \"You're quite a fan of Captain America, aren't you?\"\nTony followed her gaze, then picked up the toy and stashed it out of sight in his lap. He shrugged.\n\"Sort of, I guess... Is he your friend?\"\n\"I would say that... I respect him.\" Natasha replied, truthfully.\nOnce again, Tony nodded like he had expected this answer, but this time he looked a little sad and, even more bizarrely, a little sympathetic.\n\"Is that because he hit you?\"\nNatasha kept her face carefully neutral, despite her surprise. She picked up her mug and took a slow sip.\n\"Captain America has never hurt me, nor do I believe he would ever choose to do so.\"\n\"Not hurt,\" Tony emphasized, \"taught. Like, when you accidentally do something wrong, and he needs to teach you a lesson.\"\n\"Captain America is not the sort of person who would ever hurt... or even hit someone for making a mistake. Especially not a woman. Or a child. He's very... moral, in that respect.\"\nTony's brow furrowed. This was clearly not what he expected, so Natasha prompted him.\n\"Why do you think Captain America would want to hit anyone?\"\nTony shrugged, looking into his mug. \"My Dad always said that if Captain America was still around, he'd knock some manners into me. Especially when he was angry. My Dad, I mean, not Captain America... When my Dad was angry he'd say that. He said that Captain America knew how to behave, and didn't make stupid mistakes like I always did, and that he'd show me how to behave like a real man.\"\nHoward Stark had only known Rogers briefly, but Natasha was stunned that he could have so badly misread the soldier. Of course, Howard's drinking problems were a matter of public record, and from all reports Howard Stark had been an aggressive drunk... Given the quite impeccable manners of the child in front of her, she suspected that the fault lay squarely on the father, not on the son.\n\"Is that why you were scared of Steve yesterday at breakfast?\" she asked. Tony lowered his head in embarrassment, face so deep in his mug that Natasha half expected him to get his nose wet.\n\"Maybe...\" he murmured into the mug.\n\"Tony, I think maybe your Dad made a mistake. Captain Rogers would never hurt you.\"\n\"Not hurt...\" Tony reiterated, but Natasha interrupted.\n\"Or use physical force to punish you. You're intelligent, I think you probably learn better by talking than by... Being rough. Am I right?\"\nTony shrugged, but gave no other answer, studiously avoiding eye contact. This raised a new question though.\n\"If you thought Captain America wanted to hurt you, why do you carry around your toy?\" She wasn't all that confident that she'd get an answer, but not asking rarely got you answers either.\nTony glanced up at her for barely a second, then looked down to his lap where he had previously put the toy in question.\n\"Promise you won't tell?\" He almost whispered.\nNatasha promised. Tony took a deep breath.\n\"When I was really little, my Auntie Peggy gave me a toy like this one and she said that he would be my friend and protect me. Dad didn't tell me the truth about Captain America until I was older, but I still like to pretend like this one is my friend.\" He sighed. \"I know it's being childish and silly, but...\"\n\"I don't think it's silly,\" Natasha interjected. \"Sometimes I wish that I had something special like that to keep me safe.\"\nTony stared at the toy for a few moments, then looked up at Natasha.\n\"Maybe Clint could buy you one too?\" He suggested.\n\"Maybe I'll ask him tomorrow.\" She agreed.\nTony went to smile, but it faded into a yawn. \"I think maybe I should go back to bed now.\" \n \nThe walk back to Tony's room was very nearly silent, but Natasha was highly aware of the glances she was receiving from her little companion every time he thought she wasn't looking.\nHe genuinely did seem tired, which was understandable given the circumstances, but there were other things going on there as well. Sadness, well masked for a child but still obvious to a trained spy, but also consternation, curiosity and... Calculation?\nOn the first day she had met Tony-the-younger, she had felt an overwhelming sensation that she was being evaluated. The feeling was back in full force.\n\"Are you going to be all right to sleep now?\" Natasha asked as she sat on the side of the oversized bed. Tony burrowed into the blankets and nodded, but continued to watch her with a fierce focus.\n\"Miss Natasha, why aren't you a mamochka?\" he asked suddenly. It was only decades of training which kept her from doing a double take.\n\"That's a very unusual word, Tony. Where did you hear it?\"\nTony chewed at his lip nervously. \"I asked JARVIS to teach it to me. It means 'mommy', right? But in Russian, because you're from Russia.\"\n\"That's right, I am.\" she acknowledged slowly. Tony nodded.\n\"Don't you want to be a mamochka? It's okay if you don't, my Mommy didn't really want to be one, but I think you would be good at it.\"\nNatasha didn't know whether to be touched or terrified about where this conversation was going.\n\"I'm sure your Mommy changed her mind once she met you though,\" she tried, hoping to simultaneously deflect the conversation from her own private life and also to understand where this conversation was coming from.\nThe sadness that she had seen in Tony a few minutes ago came out full force, as he shrugged and dropped his gaze to the blankets. Natasha had a feeling she ought to touch his shoulder, or rub his back, or stroke his hair, but couldn't quite decide which to go with. Tony let out a little sigh.\n\"Maybe. I don't really know. It doesn't matter though, because this is the future, and that means that she's dead. And so is my Daddy.\" He looked up at her. \"Did you know about that?\"\nNatasha nodded cautiously. \"I did know about that, but I didn't realize that you did.\"\n\"I figured it out by myself, but JARVIS told me I was right...\" Tony fidgeted with his Captain America toy, bending the arm back and forth. \"Miss Natasha, do you think that they loved me before they died?\"\nPulling together the necessary confidence, Natasha reached out to stroke Tony's hair.\n\"I'm sure they did, Tony. I'm sure they loved you very much.\" Of course, they had never shown much sign of it, but she didn't see how mentioning that would help.\nTony took a deep, slightly shaky breath, then let it out, sinking into his pillow. His eyes remained open though, with a shiny, damp look that had nothing to do with his elevated temperature.\n\"Okay. Good. That's good.\" He said, more to himself than to Natasha. \n\"Would you like me to stay until you fall asleep?\" Natasha asked, surprising herself with the question. Tony answered with a watery smile and a tiny nod. Having walked straight into a trap of her own making, Natasha started to settle herself in for a wait, only to be interrupted by more softly spoken words.\n\"Did you ever want to be a mamochka, Miss Natasha?\"\nNatasha allowed herself a second to collect her thoughts. Tony's big, dark, ever-so-slightly teary eyes were watching her, making her uncharacteristically inclined to speak the truth.\n\"Sometimes it's not a matter of wanting, Tony. Sometimes people aren't able to be mothers, no matter how much they wish they could.\"\n\"But why not? Why can't you?\"\nNatasha sighed internally, trying to figure out how to explain to a five year old.\n\"I have a very special job, Tony...\" she began.\n\"You're an Avenger.\" Supplied Tony, helpfully. Natasha nodded.\n\"Sometimes, yes, but I wasn't always. When I'm not being an Avenger, sometimes I have to do other things, and some of those things make it very dangerous to be a mother. For me, and for a child... So I...\"\nShe froze, fixated, as Tony sat up and pressed feather light lips to her cheek. He looked up at her, completely without guile, eyes dark and hopefully, and just a little bit scared. After a moment he moved back to his pillows, leaving Natasha shaken.\n\"If you wanted...\" Tony began, hesitantly, \"I don't have a Mommy any more... If you wanted to, you could be my mamochka...\"\nNatasha blinked. Reminded herself to breathe. Blinked again. Folded her hands in her lap and remembered her training.\n\"That's very sweet of you Tony, but I don't really think that's such a good idea... You see...\"\nBut Tony had already withdrawn, both literally and emotionally. He burrowed deeply into the blankets and averted his eyes.\n\"That's okay, I understand.\" he said, cutting her off. He pressed his face into the pillow so that his next words came out muffled. \"I think I can sleep okay now. You don't have to stay.\"\nNatasha had no trouble recognizing a dismissal when it was presented to her so plainly. \"Alright Tony... Good night, sleep well.\"\nShe rose, body giving away none of her emotional state, and left his room, all the while berating herself. She had quite literally written the report on Tony's emotional issues, his fear of rejection, his problems forming emotional attachments to human beings. And now she had just...\nBruce was going to kill her.\nTony was in the lab when Bruce found him, little hands manipulating holographic models as though he'd been doing it his whole life. Bruce watched him through the glass paneling for a few moments, admiring the ease with which the child had acquired these skills which had taken him so much longer to grasp.\n\"JARVIS, why is Tony alone in the lab?\"\n\"He was having difficulty sleeping, Sir. He asked if he might wait down here until you woke up. I've been supervising him closely, and I assure you that I would not have allowed him to come to any harm.\"\nBruce couldn't help but be amused at JARVIS' defensiveness. The A.I. had always been protective of Tony, but since the man's regression to childhood, JARVIS had truly gone above and beyond.\n\"Of course not, JARVIS... Why here though? Why not go to breakfast? Is he upset about something?\"\n\"He has been running a slight temperature since last night, Sir.\" There was a silence, an unexpected hesitation from the A.I. \"However, he did not sleep well, and I believe he is experiencing some emotional distress. He has been... Unwilling to discuss it.\"\nBruce pressed his lips together into a thin line, then nodded.\nTony looked up, momentarily startled when the door slid aside to admit Bruce. Tony's skin was pale, his complexion waxy, with fine points of pink high on his cheekbones. Even if Bruce hadn't spent so many years being a doctor he'd be able to spot the outward signs of fever.\nHe offered up a friendly smile and went to sit down next to him, but Tony gave him a suspicious look and shuffled his chair an inch back. Bruce's worry flared.\n\"What brings you down here so early?\" he asked, making sure that Tony understood that he was merely curious, not critical.\nTony turned back to his holographic model, spinning it around in front of them in a way that still made Bruce slightly dizzy even after all his exposure to Stark displays. There was something familiar about the shapes that Tony was working on, but honestly Bruce favoured pen and paper to the complex, layered, three dimensional diagrams that his friend preferred.\n\"JARVIS said it would be okay for me to come down here before breakfast.\" Tony answered, stiff and stand-offish.\n\"Of course. I'm sure JARVIS has been taking good care of you. I was only wondering why you chose to come here alone?\"\nTony only shrugged. Bruce tried a more direct tack.\n\"You know, if something is worrying you, JARVIS can find me straight away? You don't have to wait for me here...\" Still no acknowledgement from the child. \"Are you not feeling well? You look like you might have a fever.\"\nThis, finally, drew a response. \"That's what Natasha said too.\" Tony sounded oddly resentful about that, which surprised Bruce. Up until today, Tony had taken quite a fascination with the Black Widow.\n\"You've already seen her this morning?\"\nTony shrugged again, but didn't answer. Bruce reached over to rest a hand on Tony's forehead, wanting to physically reassure Tony as much as to check his temperature, but Tony jerked away at the contact, almost falling off his stool in the process. Bruce startled, withdrawing his hand quickly.\nClearly something had gone very wrong since the previous evening. He thought about it carefully, but couldn't identify a reason. He folded his hands on the table where Tony could see them.\n\"Why don't we go for some breakfast? Just finish up what you're working on, then we...\"\nTony shook his head firmly. \"No. I'm busy. Working on something very important.\"\nThis was yet another odd thing on top of all the others from the morning. Certainly the adult Tony had been famous for getting lost in his work and refusing food and rest until it was complete, but the little boy sitting at the work bench had always been responsive and obedient whenever an adult suggested that he take a break.\n\"Oh. Okay.\" He replied, considering his next words carefully. \"Another ten minutes, then we'll go up and get some breakfast. It's important to eat properly if you're not feeling very well.\" Bruce could see that the tension in Tony's shoulders was still there, and went to rub the back of Tony's neck affectionately, but to Bruce's disappointment Tony shrugged off the gesture almost immediately.\nBruce drew his chair over to the bench, close to Tony, but not so much so that Tony would feel the need to move further away. Bruce's papers were spread across the work table surface, suggesting that Tony had been looking through them, so he gathered them together and resumed his own work.\nThe numbers still taunted Bruce from the pages, dancing so close to an explanation of Tony's youth, yet still infinitely far away. At this rate, he was almost ready to reconsider the 'magic' angle.\nBruce sighed and glanced at his watch, noting that the promised ten minutes had come and gone, and that the two of them had been working in silence now for almost an hour. He looked over at Tony's hologram, noting that it was now moving continuously, swirling in a vaguely helical pattern around a solid core. As he watched, the movement sped up, a complex dance with colours fading from blue through yellow to orange. Suddenly the motion stilled, the helices sparking a bright red, and then the whole shape collapsed down into the projector, leaving nothing behind. A second later the system reset and the model was once again turning very, very slowly. It was almost hypnotic.\nTony certainly seemed to think so. His hands were no longer moving, head tilted to the side, his attention completely consumed by the model in front of him. Bruce cleared his throat.\n\"Are you hungry now? I know I am. Definitely time for breakfast, right Tony?\"\nDespite his earlier insistent refusal, Tony simply sighed. Bruce went to switch off the hologram, but Tony caught his wrist on the way through.\n\"Just... A few more minutes. It's just about...\" Bruce nodded, letting his arm fall back to the work bench.\n\"It's very complicated. Could you explain it to me?\"\nTony looked down at his hands, lacing and unlacing his fingers, then looked up at Bruce.\n\"If you had to choose,\" he began, sounding hesitant, \"and if you only got to keep one of us... Would you choose the little me or grown up me?\"\nBruce blinked once, twice. Allowed himself three whole seconds to allow that thought to sink in.\n\"That's a strange question,\" he tried, quietly hoping that he was misinterpreting Tony's words. \"Why do you think I would need to make that sort of decision?\"\nTony frowned, his brow creasing. \"Because you said that you hoped that Iron Man would come back soon, and Iron Man is me grown up, and I can't be little and big at the same time. So I was wondering... If you had to choose...\"\nSo. Not a misinterpretation.\nBruce had been certain that, given enough time and evidence, Tony would figure out the connection between himself and Iron Man, but he had hoped it would take a little bit longer. Long enough for him to solve the riddle of Tony's youth. Long enough for him to understand the implications for both of them.\n\"That's a very complicated question, Tony, and one I hope I don't ever have to make.\"\n\"But... If you did?\"\nBruce sighed. \"Honestly? I don't know.\"\nTony dipped his head, breaking eye contact, and flicked his hand at the model again. It started to speed up again.\nBruce reconsidered the model. It was chaotic, but there was a kind of order there. Something familiar. Somewhere in the back of his brain a sense or recognition was starting to burn, but he couldn't quite place it.\nThen, as though a switch had been flicked, Tony got angry.\nThe child thrust his arms into the model, balling his hands into fists and flinging them away with such aggression that Bruce was worried Tony might tip his chair and crack his skull on the hard floor. His focus was still on the model, tearing it apart as viciously as was possible when working only with a projection of light.\nBruce immediately recalled Tony's first day in the lab, tearing into his robot puppy as though it had personally betrayed him. This was the same anger, the same a single minded determination. The first time, Tony had believed that Bruce had rejected his overtures to friendship. This time...\n\"Tony? Please try to calm down... Why don't we both take a deep breath, then together we'll find a way to fix whatever is upsetting you. All right?\" He may as well have remained silent, for all the good his words did.\nWorse, Tony's distress was beginning to have an alarming effect on Bruce's alter ego. Despite the Hulk's characteristic 'smashiness', he had often shown protective instincts towards Tony Stark, pushing Bruce to transform whenever he believed his friend was in danger.\nDespite remembering full well Tony's reaction after the puppy incident, Bruce knew that that a frightened Tony with Bruce was infinitely better than a terrified Tony with the Hulk. Moving quickly to stand behind the child, Bruce wrapped his arms around him firmly, catching his wrists and holding them tight to his chest.\nThe way Tony stilled in Bruce's arms was disturbingly reminiscent of that first day, but this time Bruce didn't withdraw. Instead, he rubbed a thumb over the soft insides of Tony's wrist, noting the rapid pulse. Bruce could feel the fever heat radiating of the little body, and the shaky breathing caused by a combination of exhaustion and distress. He rested his cheek on Tony's hair and waited, giving Tony a few moments to compose himself, but the little boy remained tense. Bruce moved back just enough to lean around and catch Tony's eye.\n\"Tony? Please tell me what's upsetting you. I don't understand.\"\nTony looked away, then wiggled in Bruce's grasp. Bruce relaxed his grip, giving the boy some small freedom of movement.\n\"I'm sorry,\" were the first words out of the child's mouth. They were not what Bruce had been expecting.\n\"What are you sorry for?\" he asked gently.\nTony fidgeted. \"For getting angry. I guess I made a mistake. I thought that... It's not important.\"\nBruce moved his right hand to stroke Tony's hair.\n\"It is important though. Because it's important to you, and that means it's important to me too.\"\nTony glanced up for barely a moment, trying to gauge Bruce's sincerity, then sighed.\n\"It's okay, you know. Natasha didn't want me either. Or my parents. Or any of the others. They pretend for a little while, but I'm not...\"\nTony's unspoken \"good enough\" hung heavily in the air between them.\nBruce took a deep breath. He was normally a man of few words, even with Tony, but he was quite certain that whatever he said next would be a defining moment for both of them. A 'make or break' for Tony. He stroked Tony's hair again, then touched a finger under Tony's chin to tilt his head up again.\n\"I want you Tony. I promise. And I know that JARVIS wants you too. Everyone in this tower wants you. You are wanted. Do you understand?\"\nTony blinked at him, then shook his head very slowly. Bruce wasn't sure whether Tony genuinely didn't understand, or whether he was simply disagreeing with the sentiment. Either way it didn't really matter. Bruce sat back on his chair, pulling Tony into his lap and wrapping him in a hug.\nThey sat in silence that way for several minutes, the tension in Tony's shoulders very gradually fading as his body accepted the affection that his brain denied him.\n\"Okay little guy, I think maybe its bed first, and we'll bring breakfast to you.\" Bruce said eventually, brushing the damp hair from Tony's overheated forehead. Tony didn't answer, but Bruce took his little sigh as acknowledgment.\nThey made it half way to Tony's room, arms wrapped around Bruce's neck and legs wrapped around his middle, before the boy spoke again.\n\"If you chose me... If the grown up me didn't come back... What would happen? Would I have to go live in an orphanage?\"\nBruce squeezed him a little tighter at this.\n\"Of course not. We'd find a nice family for you. Some lovely parents who want a little boy very much, and would love you more than anything.\"\nTony dug his fingers into Bruce's shirt, wriggling in his grip as though Tony was trying to maximize his physical contact. His next words came out in a flurry.\n\"I promise I'd be really good, I'd stay out of the way and always do what you told me. I don't want to go and live with strangers, they won't want me, not really, but you said you wanted me, and JARVIS wants me, and I want to stay with you and JARVIS. Please, Bruce?\"\nBruce hitched Tony up, adjusting his grip so that he could see Tony's face. His eyes were wide, earnest and desperate. Truth be known, he didn't want to give up this little gift any more than Tony wanted to be given up.\n\"Tony, I care very much about you, but I'm not really father material.\"\nTony shook his head vehemently, sending his hair flicking in all directions.\n\"You're the best daddy I've ever met, ever ever ever.\" He argued. Bruce couldn't help himself, he leaned in and pressed his lips to Tony's warm forehead.\n\"Tony... Precious little guy...\" He hesitated, choosing his words carefully. \"I promise that I'll do everything I can to keep you safe and happy, okay? I don't know what that entails yet, and we'll have to figure out the practicalities as we go, but you have my word. I will do everything I can to make sure that you're okay.\"\nTony didn't seem completely taken with this offer, but didn't outright reject it. Instead, he leaned back in to Bruce's chest and nodded, hair catching on Bruce's shirt.\nHe remained that way, silent and clingy, until they reached his bedroom. As Bruce deposited Tony on the mattress, the little boy looked up with those dark wide eyes again, reaching to catch Bruce's hand in his own.\n\"You never answered my question.\" He said, serious yet hesitant.\n\"Which question, little guy?\" Bruce answered, hoping against hope that it wasn't the one he was thinking of.\n\"If you had to pick just one of us to keep, would you pick me or Iron Man?\"\nBruce took a slow breath, then settled down on the bed next to Tony.\n\"Actually I did answer, Tony. I said I didn't know... What made you want to ask?\"\nTony's shoulders rose and fell with a dramatic sigh as he pulled a pillow into his lap and squeezed it for several seconds. \n\"I wanted to make you something nice this morning, because I love you.\"\nBruce's breath caught in his throat at the ease with which Tony said those earth shattering words. He wanted to do something, anything to acknowledge it, but Tony was already pushing ahead with his story.\n\"And you didn't want the puppy, but I knew you were working on some maths puzzles because you let me help yesterday, but I'm not really very good at the numbers part really, so I asked JARVIS to help me make a picture of them on the hologram display because I think that sometimes it's easier to figure out the answer to a problem when you can see it and move it around.\"\nTony took a breath, and with a horrible sinking feeling Bruce cast his mind back to the twisting helical structure that Tony had been manipulating in the lab. For all that Tony was too young to understand the formal process behind mathematical proofs, he still had the sort of intuitive understanding of physics that would have made Feynman cry with envy.\n\"But when I made the picture, it looked all wobbly and sort of...\" Tony held his arm up at a forty-five degree angle, tilting it back and forwards in demonstration, \"not balanced. So I fixed it...\"\n\"Tony...\" Bruce began, with no idea how to finish. He didn't have to, because Tony squeezed the pillow and looked up at him.\n\"It's about me, isn't it? Your maths puzzle, it's about how I got here?\"\nBruce pressed his lips together and nodded slowly. \"It's important for me to understand how you came to be here, so that I know if there is anything I need to know to keep you safe.\"\n\"And so you can have your Iron Man back?\"\nBruce cast his eyes to the ceiling, but JARVIS remained steadfastly, stubbornly silent. Bruce looked back down to Tony.\n\"Not... Exactly. It's true, I would very much like to see my grown up friend Tony again, but that's not the only reason...\"\nTony gave him a frustrated and disbelieving look. \"It's not time travel. I thought maybe it was when I asked JARVIS about it a few days ago, and I think you thought it was time travel too, which is why your puzzle was all wobbly. But it's not actually time travel, it's more like a invisible blanket wrapped around me, but just around me.\"\nOne part of Bruce's mind provided the words \"localized field\", still trying to wrap his own equations around Tony's discoveries. The other part of Bruce's mind felt growing dread at what he was quite certain was coming next.\n\"But that means that Iron Man isn't somewhere else. He's not in some other time, he's right here.\" Tony pointed to himself. He set the pillow aside, straightening his back and looking Bruce in the eye. \"And with the working model, you have enough information to bring him back.\n\"But if you do, then I will disappear. For ever.\"\nNatasha was no physician, but the glassiness in Tony's eyes and the constant sheen of sweat on his skin were a testament to his declining health. Tony's fever still wasn't breaking. If anything, it was getting worse. \nHis hair, damp from perspiration, flopped down into his eyes as he rolled over. When his attempts to blow the errant strands out of the way failed, Natasha reached over and brushed them away for him. In return, Natasha was rewarded with a suspicious look.\nShe leaned back into the chair, once more giving Tony his space. The suspicious look remained, tempered only slightly by fatigue. Natasha was used to people not trusting her. It came with the job. She was not used to the feeling of regret she was currently experiencing though. Disappointment, caused by Tony's distrust.\n\"Is there anything you need?\" She asked, hoping that a distraction might help. Tony shook his head.\n\"No, thank you.\" He replied, as polite and proper as he had been when they first met. If Natasha were the wishing sort, she might have wished to take back their earlier conversation, but she was never one for flights of fancy. Looking back with regret never did anyone any good. She needed to push forward, with an intention to repair what she could.\n\"JARVIS, do you know where my Cap is?\" Tony stage-whispered from the bed.\nThe omnipresent voice answered, gentle as ever, \"I am not certain, Sir. It is not in any of its usual spots.\"\nTony clutched at his bedspread and gave a tiny whimper, the sound doing unpleasant and unfamiliar things to Natasha's heart.\n\"Master Clint has agreed to look for it. He is very good at finding small, misplaced items. Perhaps you might try to rest in the mean time?\" JARVIS' voice was warmer than Natasha ever remembered hearing it.\nTony nodded, but didn't close his eyes. Instead, he looked at the walls, and the dresser, at his own hands clutching the bedclothes. Anywhere but Natasha.\n\"Would it help if I sang you a lullaby?\" She suggested, surprising herself with the offer. Tony blinked slowly, new thoughts taking too long to process in his fever muddled mind.\n\"Why?\"\n\"To help you go to sleep.\" she replied, noting that the suspicious look was now blended with simple confusion. Tony huffed out a little sigh.\n\"Not that kind of why, the other kind. You already said you didn't want me, so why are you pretending to want me now? Is it because of Bruce? Did he tell you that you had to pretend to like me? Because I think he means well but I'd rather you didn't.\"\nNatasha leaned forwards in her chair to get closer to him. She was an expert manipulator, she knew how to turn body language to her advantage, to make others believe whatever she needed them to believe. This was different though, because this time she genuinely wanted the child in the bed to trust her. It was disconcerting.\n\"Tony, the other night, you took me by surprise. You...\" She took a moment to sort her words out in her head, finding a way to phrase it which wouldn't be misinterpreted by a child whose intellectual development was so far askew from his emotional. \"Tony, you've had a lot of practice being someone's little boy. Almost five years, yes?\"\nTony nodded solemnly.\n\"Well I've never had any experience of being someone's mother. Or mamochka. It's not something I know how to do. So it's not that I don't want you, I'm just not... Correctly skilled to take on that position.\"\nTony chewed at his lip, forehead creasing in thought. Natasha stayed still and quiet, a very useful talent which she had acquired when she was even younger than the child watching her.\n\"Maybe you could learn?\" Tony suggested, finally. \"I would be really well behaved, and if there was something you didn't know about being a mommy then I could teach you, or if I don't know then JARVIS could look it up for you? JARVIS? You'd help Natasha find out anything she didn't know, wouldn't you?\" Tony sat up in the bed, looking once again cautiously hopeful.\n\"It's not that simple, Tony...\" Natasha replied, and immediately she knew she had lost him again. His shoulders slumped and his eyes fell. It was infuriating. How could she be so adept at controlling her interactions with adults, and so stunningly incompetent when it came to a five year old boy? She tried again. \"Maybe I could be your tyotya instead?\"\nThat caught him out. He looked up at her again, head tilted to the side.\n\"What's that?\"\n\"Tyotya? It's the Russian word for 'auntie'.\"\nTony blinked once. Then a second time. It was strange to see him working so hard at such a relatively simple idea, especially after so many weeks of watching him solve complex riddles at light speed.\n\"Like Peggy?\"\nAh. Peggy. The family friend who had bought Tony his first Captain America toy, promised that it would keep him safe. The woman who Natasha had reminded Tony of the first time they had met. The only person from his previous life that the little boy had spoken of with genuine fondness...\nNo small responsibility then, and Natasha couldn't help but wonder if she may have been better off taking the title of mother. And yet...\n\"Yes... Just like Peggy.\"\nTony's face cracked into a wide smile then, his fever-glossy eyes lighting up. Finally she had hit on a correct answer.\n\"Tyotya Natasha?\" He checked, mangling the pronunciation.\n\"Tyotya Natasha,\" she confirmed, much to Tony's delight. He pulled the covers up to his chin, grinning into his pillow. The movement caused his hair to fall back over his eyes.\n\"Tyotya Natasha. If you wanted, maybe you could sing that lullaby now?\"\nNatasha reached over to once again brush the hair out of Tony's eyes. \"Of course, SOlnyshko.\"\nA few words in, Tony had wormed his way across the bed so that he could hold her hand. By the third verse, he was asleep.\nWhatever lingering feelings of disappointment Natasha had had since their earlier, disastrous conversation all but disappeared, leaving something else. Something different, unfamiliar, and very slightly terrifying.\nTony's sleep was restless, disturbed by fever and the ever present ache in his chest, and within twenty minutes he was awake again, dark eyes watching her through heavy lashes.\n\"I can't sleep, Tyotya Natasha. Could you tell me a story?\" The last word collapsed under the weight of a nasty sounding cough.\n\"I don't really know any good stories, Tony...\" She answered, rubbing circles between his shoulder blades. It was a half truth, of course. She knew plenty of good stories, but absolutely none which were appropriate for a five year old. When she had been his age, bed time stories were not exactly standard fare.\n\"Not even...\" Tony began, but was interrupted by a cautious knock on the door. Tony glanced up, hopeful. \"Clint? Did you find my Cap toy?\"\nThe door eased open, and the muscles in Tony's hand went taught in Natasha's. Steve Rogers peered cautiously into the room, looking almost as afraid of Tony as Tony clearly was of him.\n\"Tony?\" Rogers said gently, using that tone of voice that Natasha had heard dozens of times when the Captain had been accosted in the street by swarms of children eager to meet their hero. Gentle, approachable, completely safe.\nTony didn't seem to be buying it. He was sitting up in the bed now, eyes wide and back straight. He pulled his hand out of Natasha's grasp and instead clasped both hands firmly in his lap. Despite his damp, disordered hair and flushed cheeks, he looked like a model schoolboy being presented to his headmaster. Whilst simultaneously having a panic attack.\n\"I've been good, I promise.\" The words fell out of his mouth, stumbling over each other in their haste. Natasha wasn't sure whether the crack in his voice was caused by the illness or by anxiety, not that it mattered under the circumstances.\n\"Of course you have, SOlnyshko...\" She tried to soothe. Tony's eyes darted between Natasha and the Captain, doing what she could only interpret as a threat assessment.\n\"Clint told me you lost your favourite Captain America toy,\" Rogers said, as unsure as she had ever seen him. \"I thought maybe I could stand in as a replacement while he looked for it.\"\nTony's breathing was growing rapid and panicked, while Rogers simply looked lost. It would seem that no one had yet explained to the Captain precisely why Tony had such a poor reaction to his presence.\nWhich meant that the task fell to her. Damn.\n\"Tony, do you remember what your Auntie Peggy said about Captain America?\" Natasha asked, words clear and firmly articulated, leaving no room for distraction. Rogers looked startled at the name, which was no particular surprise to her. Rogers' file detailed his brief almost-relationship with the woman who would become Tony's beloved aunt.\nTony merely nodded that yes, he did remember. She prompted him again, \"Remind me?\"\nLooking warily at Rogers, Tony leaned over to whisper in her ear. \"She said that he would be my friend and protect me. But that was just the toy, not...\"\nNatasha nodded. \"Your Auntie Peggy knew Captain America, didn't she? They were friends, before you were born.\" Once again, Tony nodded. \"So she would know exactly what he was like, wouldn't she?\"\nThis time Tony looked confused. Giving Rogers another wary look, he nodded slowly.\n\"Rogers, what do you think of people who would punish little boys by hurting them?\" Natasha asked, deciding at this point to go all-in.\nShe felt rather than saw Tony still, the child holding his breath for Rogers' answer. The Captain, for his part, seemed mostly confused by the direction the conversation had taken. He stepped completely into the room.\n\"I think they're bullies. I don't like bullies.\"\n\"So you'd never hit Tony? Even if he made a mistake?\"\nAt this, Rogers actually looked shocked, as though the thought were so foreign that the words didn't even make sense.\n\"Of course not. I'd...\" He paused, then turned to look directly at Tony. \"I'd really like to be your friend, Tony, and friends don't hit each other. Not ever.\"\nTony pressed his lips together, but his breathing had slowed to a more healthy rate. He looked to Natasha, as though seeking her permission. \"But my daddy said...\"\n\"Your father...\" Natasha interrupted, cutting off Tony's sentence before Steve had to hear it. The words \"was an asshole\" went unspoken though. At this age Tony clearly still saw his father through the lens of childish adoration, and Rogers had considered Howard Stark a friend. Still, 'asshole' would have been appropriate... \"Your father made a mistake, Tony. But your Auntie Peggy and I both agree, Captain America is a good man who would never hurt you.\"\nTony took a deep breath, which was enough to set him coughing again. From the corner of her eye she could see Rogers' aborted gesture of concern. He clearly intended to pull the child into a hug, but was still unsure of the welcome he might receive.\nNatasha took the initiative instead, shifting to the edge of the bed and wrapping her arms around the little boy. The earlier, terrifying feeling of responsibility hit her full force when Tony cuddled into her chest. She rubbed circles on his back again, waiting for him to come around.\nAfter a few moments he did just that. Without pulling away, he looked up at her. \"Are you sure?\" he asked, eyes flicking briefly to Rogers, clarifying his question. Natasha nodded, and was rewarded with a small smile.\nTony then turned the smile to Rogers.\n\"You can come sit with us, if you like...\" he offered, nervous but hopeful. Rogers didn't need to be asked twice.\n\"I brought you something,\" the Captain said, settling down in the chair that Natasha had just vacated and revealing several items he had been holding behind his back. Natasha was unsurprised to see a sketchpad and a handful of coloured pencils. \"When I was your age, I used to get sick a lot you know.\"\nTony sat up again, disbelieving. \"But you're Captain America. You have a serum that means that you never ever get sick. Everyone knows that.\"\n\"That's true, Tony, but I didn't get that until I was a grown up. When I was little like you, I got sick all the time, and to keep myself occupied I learned to draw. Sometimes I still draw now, especially when I'm feeling sad or worried. Would you like to try?\"\nRogers held out the sketchbook, and Tony eyed it cautiously before slowly reaching out to take it.\n\"What do you normally draw?\" Tony asked, turning the protective black cover of the book back as though he were expecting something to jump out of it and bite him.\n\"Things that make me happy,\" the Captain answered without hesitation, \"like my friends, and my family. Sometimes I draw people who I remember and wish I could see again.\"\nTony nodded. \"What should I draw?\" He asked.\n\"Whatever you like, Tony. What makes you happy?\"\nTony pursed his lips together for several seconds before slowly his mouth formed a smile. He picked up one of the pencils, and started to draw.\nBarely five minutes later, head resting on Natasha's arm and red pencil lax in his hand, Tony finally fell into a restful sleep.\nTony let out a little squeak when the cold chestpiece of the stethoscope touched his chest. JARVIS was capable of getting more accurate readings from his sensor network than Banner could possibly hope for with his traditional medical kit, but the A.I. chose to remain silent. JARVIS strongly suspected that the scientist needed to be a caretaker far more than he actually needed the diagnostic results.\nTony coughed again, a deep, wet sound, as Bruce entered some notes onto his tablet. JARVIS saw him cast his eyes around for something suitably harmless to distract the child from his discomfort. Despite never having formally trained as a physician, his bedside manner was impeccable.\n“What's that you're drawing?” he asked, nodding towards the half-completed artwork.\nTony quickly reached out and turned the sketchbook over. “It's not finished yet.” He said, pouting. “You're not allowed to see until it's finished.”\n“Not even a little peek?” Banner replied as he placed the thermometer in Tony's ear.\n“Nope. It's secret.” he replied, shaking his head enough that Bruce had to reset the thermometer and start anew. After a few seconds it beeped. “Uncle Steve let me use his pencils. What does it say my temperature is?”\nBruce read the number silently, then replied “Still a bit warm. It's Uncle Steve now?”\nTony blushed, which was quite an achievement given how pink his fever had already left him. “He said that I could call him that. Is that okay?”\nEven Dummy could have identified the affection in Doctor Banner's expression as he nodded. “I think that's better than okay. I think it's wonderful. Now, how about you get back under the covers?”\nTony wriggled back in under the layers of blankets, as Bruce put his equipment back in its leather bag. Tony's Captain America toy, rescued from under the fridge by a very relieved and somewhat confused Agent Barton, was scooped up by tiny fingers which then proceeded to rub the wings printed onto the toy's cowl.\n“Did you look at the model I made for you yet?” he asked, staring steadfastly at the toy rather than Bruce.\nJARVIS noted the way that Banner's movements became stilted. He suspected that Tony spotted it as well.\n“I did. It's very well made, you're very clever for figuring it out.”\n“JARVIS helped.” Tony answered, then looked at Bruce expectantly.\nBruce pretended not to notice. His equipment packed, he sat on the side of the bed and sighed. “I need to talk with the other adults for a little while. Will you be okay by yourself for a few minutes?”\nTony shrugged. “I won't be alone, JARVIS can stay with me and come to your meeting at the same time. Can't you JARVIS?”\n“Indeed Sir.” JARVIS contributed. \nBruce gave a small, slightly startled nod of acknowledgement. JARVIS suspected that he had not previously been one of the expected meeting attendees. “Is there anything you need before I go, little guy? A drink of water maybe?”\nTony shrugged again. As Bruce went to stand though, Tony reached out, catching his sleeve between his little fingers and holding on. Bruce immediately sat again, taking Tony's hand between his own. \n“Tony?”\n“You're going to talk about me, aren't you? About the model, and what's going to happen to me because of it. That's why you want to talk to all the grown ups while I'm not there.”\nBruce pressed his lips together, letting his head loll forward until he was staring at Tony's small hand ensconced in his own.\n“That's... One of the things we need to talk about, yes. But it's not the only thing.”\nJARVIS could see Tony's lip wobbling, even if Bruce could not.\n“What do you think you will...”\nBanner looked up, catching Tony's expression. He reached out to stroke his hair, to cup Tony's cheek in his palm.\n“I promise that we won't make any decisions without talking to you about it first. Okay, little guy? I promise.”\nTony nodded, even though he seemed unable to bring his wobbly lip under control. Bruce rubbed a calloused thumb over Tony's cheek, and then suddenly his arms were full of Tony. The child all but launched himself at the older man, wrapping his arms around Bruce's neck, pressing his face into Bruce's neck, blankets loosely tangled between them.\nIt took Bruce a few seconds, but he soon adjusted his grip, rubbing warm circles on Tony's back. If JARVIS' hearing had not been so very acute, he probably would have missed Tony's next words, muffled by Bruce's neck and Tony's mumbling.\n“I love you Bruce.”\nBruce's hand stilled in the small of Tony's back. “I love you too, Tony. I love you so much.”\nJARVIS' own emotions were different to those that humans experienced, although the adult Tony had been quick to assert that 'different' did not mean 'less'. Watching the scene play out... Affected him in a way which he had no words to describe. For all that it hurt to see, he didn't want them to move apart any more than they wanted to.\nBut eventually they did just that. Tony wiped an arm over his face in a fruitless attempt to disguise the dampness of his eyes, and Bruce smoothed down his shirt in an equally ineffectual attempt to re-center himself.\n“Avengers assemble?” Tony murmured, a tiny smile on his face which didn't reach his eyes. Bruce returned a similarly unsatisfactory expression.\n“I suppose so. I'll be back soon though. You should rest, or maybe finish off your picture?”\nTony nodded, picking up the sketch pad from where he had placed it a few minutes earlier and pulling it into his lap. He didn't look at it though, his eyes still locked with Bruce's.\n“Don't be sad, Bruce,” he said, rubbing his thumb on a green pencil. “Everything's going to be okay.”\nBruce replied with an empty smile. “Of course it will be, little guy.” he replied, “Fifteen minutes, all right? Twenty at the most.”\nAnd then he was gone.\nA small percentage of JARVIS's consciousness tasked itself with following Bruce to the kitchen, acquiring a procession of uneasy avengers as he went. By far the larger percentage though was focused on the little boy in the bed who was currently selecting a new pencil to use.\n“JARVIS, what color are you?” Tony asked, his voice croaky from his illness and weak from fatigue.\n“I do not have a color, Sir. I would need to have a physical presence for it to have pigment.”\n“Oh. Well... If you could choose, what color would you be?” he persisted.\nJARVIS considered the question carefully, a piece of five-year-old philosophy. The outer shell of most of his servers was done in subtle black, or the slightly more dated beige. Most of his circuit boards were the traditional green, although many of the newer pieces were silver, black, or in some notable cases, transparent. His power supply, well that was currently the Stark towers arc reactor, the same vibrant blue of the device housed in adult Tony's chest. It was the one piece of hardware that JARVIS had in common with his creator and friend.\n“Blue, Sir. Electric blue.”\nTony let his fingers hover over the colored pencils, looking to the ceiling.\n“Really? Blue is cold, like water and ice. I don't think you're blue. I think you're red. Red is my favorite color.”\nConsidering his choice for the Iron Man suit, this little announcement was no surprise to JARVIS.\n“Perhaps I could be both colors?\" he suggested in compromise, \"Blue in the center, with red on the outside?”\nTony nodded slowly. “Okay, that could work.” He picked up the blue first and started drawing with care. His illustrations consumed several silent minutes before he spoke again.\n“JARVIS, have you looked at the model I made?”\n“I have Sir, yes.”\n“Do you think... Could... Is there some version of it where I get to stay with Bruce and everybody? Like I am now?”\n“I am not a physicist, Sir. That is Master Banner's domain.”\nTony shrugged. “I'm not a physicist either, but you and I, we made the model by ourselves didn't we?”\n“We did, Sir. You have a talent for visualizations”\nPersistent as always, Tony refused to be waylaid. “So... Do you think it's possible?”\nJARVIS chose his next works with impeccable care. “There is a non-trivial chance of your survival, yes.”\n“What does non-trivial mean?” Came the immediate reply, once again showing that the child would not be fooled.\n“Approximately six percent, Sir.”\nTony's hand held the pencil hovering over his paper. “That's not very good is it?” he asked.\n“It is... Sub-optimal, certainly.”\nTony slowly let his pencil touch back down, drawing with an exaggerated focus.\n“The model, it always turned red the longer it was running, and it always fell apart eventually. What... What do you think that would mean for me, if I don't do anything?”\n“Your condition would continue to degrade.”\n“Until?”\n“Until it could degrade no further.”\nTony put the pencil down on the bedside table. The picture joined it a few seconds later, and Tony sat up, curling his hands in his lap.\n“And what if I undid it all? How likely is it that I would turn back into the grown up me?”\n“It is difficult to be certain, Sir, but my calculations indicate that there is an approximately sixty three percent chance that your adult self would return with minimal ill effects.”\n“Sixty three is a lot better than six, isn't it.”\n“Indeed so, Sir. But still not a guarantee.”\nTony leaned back into his pillows, gazing distantly through the half-curtained windows. JARVIS remained silent, recognizing Tony's cogitative state for what it was. After a few minutes, Tony disrupted the silence with a heavy sigh.\n“JARVIS, I need your help,” he said eventually. JARVIS felt an overwhelming urge to immediately deny it, already knowing what the request would be and rejecting it.\n“Perhaps you should wait until Master Bruce returns, Sir? I believe that this is the sort of decision best not taken alone.”\n“I'm not alone though, I'm with you. And I'm not going to get better, not really, and if Bruce has to make the decision then he'll be extra, extra sad, but if I make the decision then everyone can have their friend back and they don't need to feel bad about it.\" Another sigh. \"I'm right, aren't I, JARVIS?”\nJARVIS was used to complex philosophical puzzles. The adult Tony had delighted in posing them during JARVIS' early days of sentience, testing his understanding, capability and reasoning skills. JARVIS had hated them. They lacked precision, and whenever he came to a solid answer Tony would always throw a metaphorical wrench into the works by changing the parameters. This was one such puzzle. He could not fathom encouraging any version of Tony Stark to sacrifice himself, even if he were doing so for another version of Tony Stark. And yet, the child's arguments were sound, rational, clear headed. When every possible outcome was wrong, he had always looked to his creator to invent some new possibility. Without that, his very best effort was nothing but moving numbers around, trying to minimize possible harm.\n“Your justification is sound, Sir, and I will, of course, support you in whatever decision you make. However, I do stress that you would do well to speak with...”\n“Thank you JARVIS. I... need to be in the lab for it, don't I?” he interrupted, picking up his completed picture and his Captain America toy.\n“Indeed, Sir.”\nThe trip to the lab was slow and painful to watch, with Tony struggling to breathe and wobbly on his feet. JARVIS started to wonder if the discussion currently taking place with the Avengers in the kitchen might finish before Tony reached his destination. But it was not to be.\nWith extreme care, Tony placed his picture on the lab bench closest to the door, setting the robot puppy on top and leaning his Captain America toy against the dog's flank. He took a deep breath, then walked over the the large, open area on the opposite side of the floor.\n“When they... Can you tell Natasha and Bruce that I would have liked to be their family very much, but that it's okay? Because I'm okay, and this is a good thing. And tell Clint 'thank you' for my toys, and tell Thor that I'm sorry I didn't show him my yo-yo trick. And say thank you to Steve for letting me use his pencils and sorry for thinking he was scary... And make sure that Bruce...” He hesitated, then took a deep breath. “Can you tell them all that, JARVIS?”\n“I will make certain that they understand, Sir.”\nTony nodded, then had to stop for another drawn out coughing fit. It took several additional seconds for him to catch his breath again. This time his eyes were damp.\n“Will you still be my guardian A.I. even when I'm big, JARVIS?”\nJARVIS didn't frequently wish for a physical form, but he acknowledged that one would be helpful at this point, if only so he could reassure the child with a gentle touch.\n“Of course I will, Sir. I will be your protector for as long as I am operational.”\nTony swallowed. His hands shook, and his heart raced and JARVIS wanted...\n“What do I need to do?” Tony asked, looking once more at the floor.\n“Simply give the word.” JARVIS replied gently.\nAnother hesitation, then, “Do you think it will hurt?”\n“I do not believe so, Sir.” It was a lie, but the child's distress was already palpable and JARVIS saw no reason to make it any worse.\n“Okay JARVIS, you can...” Tony's hands were clenched into fists and the damp in his eyes was beginning to collect into a tear. JARVIS prepared his systems for the reversal process...\nTony looked up frantically at the ceiling. “Wait, JARVIS...”\nJARVIS cut the systems immediately. “Sir?” he began, hoping that Tony had decided to stay for a little longer. But the hope was dashed as Tony darted across the room to retrieve his Captain America toy. Clutching the plastic figurine to his chest with both hands, he returned to the open space.\n“Okay JARVIS. It's okay now. I'm okay. You can do it.”\nJARVIS did.\nNatasha could read the exhaustion in the line of Bruce Banner's shoulders. Sitting on the sofa, his gaze was focused somewhere in the middle distance. There was a small collection of apparent trivialities sitting loose in his lap, but Natasha was not so deluded as to think she would have a hope of taking them from him.\n\"Tony?\" she asked, trusting the rest of the question to be implicit.\n\"He's...\" Bruce hesitated for several seconds, although whether he was formulating a response or simply gathering strength Natasha couldn't be certain. \"He's fine. As well as can be expected, under the circumstances.\"\nNatasha nodded. She had many questions. When the others rejoined them they would also have questions, and yet she hesitated. Bruce took off his glasses, rubbing the lenses with the hem of his shirt. It was a familiar gesture, but today it only served to make him look old. Tired.\n\"Does he remember anything?\" she eventually settled on. Bruce returned his glasses to their usual place and shook his head sadly.\n\"He's currently storming around the lab, threatening to donate Dummy to a city college... Dummy and JARVIS both.\" He let out a small huff of air, a startling hint of something which, in better circumstances, might have been a laugh. She nodded. Didn't speak. She sensed Bruce had more to say.\n\"Apparently the two of them together have adopted the puppy. They've forbidden Tony from dismantling it.\" He glanced up then, giving her a melancholic smile. She had no idea what puppy he was talking about, but she could guess at its significance. Tony's robots had always had an uncanny ability to deal with an emotional Tony. Far better than her own ability, more often than not.\nShe didn't ask how Bruce was. She didn't need to, it was written in every inch of him.\nShe leaned back on the sofa, a feigned relaxation, and was pleased to see that Bruce unthinkingly mirrored her motion. She sincerely doubted there was any risk of a Hulk event, but a tense Banner was never ideal.\n\"And those?\" she prompted, nodding her head to the small collection of treasures in Bruce's lap. Bruce looked down at them, startled, like he was seeing them for the first time. His fingers danced lightly over them before they settled, taking the sheet of paper and laying it out reverently on the coffee table.\nShe recognized it of course, despite only having seen Tony's drawing in an incomplete state. It was finished now, drawn in a style that was clearly the work of a gifted child.\nThe smallest of the figures stood in the center with a wide smile, arms reaching up to the two adults immediately beside him. One figure, Bruce right down to the glasses and the purple button down shirt, was drawn with particular care, the detail as precise as a five year old's hand could manage. Rogers, standing beside Bruce, was equally identifiable, dressed in his leather jacket and jeans but with shield held high. Even on paper, he was protecting Tony's family from whatever evils lurked past the the edge of the page.\nClint and Thor were both similarly easy to identify, but it was her own likeness which caught her attention. Standing on Tony's right, stick-hands touching, her hair was so red it almost burst from the page. Her face, though... She was looking down at Tony, and smiling. Not a smirk, or a calculating half-smile. A simple, broad, half-moon show of happiness. She had to mentally shake herself, as caught up as she had been in seeing herself through the eyes of her 'nephew'.\n\"I think that's supposed to be JARVIS,\" Bruce added, gesturing to the top of the page where a blue circle was carefully outlined in red, loopy wings on either side keeping the object airborne. She looked to the ceiling, wondering if JARVIS might comment, but was met with silence.\nIn the absence of anything supportive to offer Banner, Natasha remained quiet as well. It was an awkward silence.\n\"Are you... All right?\" Bruce asked, eventually, and wasn't that all kinds of wrong? She knew how much the little Tony had meant to Bruce, how much they had meant to one another. Yet here he was, trying to console her? \"It's okay if you're not... It's... A complicated scenario. I'm happy that I have my friend back, of course I am, but that doesn't stop me... Grieving for what I've lost.\"\nShe looked up at him then, raised an eyebrow, said nothing. She had no words to offer him in reply. Instead, she turned her gaze to the other treasure resting in Bruce's lap.\nHe must have noticed, because he laid a hand protectively over it.\n\"He doesn't remember, doesn't understand what it means. I didn't want him to just throw it out without thinking.\"\nNatasha nodded. \"I think he would have wanted you to have it,\" she replied. She was unsurprised to see Bruce's fingers clench a little tighter on the molded plastic. There was no doubt in her mind that Bruce would treasure the cheap Captain America toy as though it was precious.\nShe supposed, in the ways that mattered, it was.\n\"JARVIS said that...\" Bruce paused, and Natasha wondered if maybe she had heard a slight catch in his voice, but then it was gone again. \"Well, perhaps I'll better leave JARVIS to tell you himself.\"\nNatasha nodded, slowly. \"Tony... He wanted us for a family,\" she said. The words felt big, almost too big, but they still fell shy of what she meant - he wanted me - by orders of magnitude. Bruce looked at her with a small, sad, knowing smile, like he could hear every thought in her head.\n\"He did.\" He agreed, with the distant echo of a shake in his voice... \"I think, perhaps, in a way, he always has. He still does, even now.\"\nWith the action figure in one hand he stood, and with the other brushed Natasha's shoulder very gently, very deliberately. Then he was gone, to speak with the others or to meditate in solitude she couldn't be sure.\nShe remained, studying Tony's picture of his family, until it became too dark to see.\nThen she hummed him his lullaby.\nJARVIS turned the feed off, leaving the screen dull and translucent.\nTony didn't move, just pursed his lips.\n\"That's all of it?\" he asked after a few seconds, \"You didn't editorialize? Cut out something that's gonna come back to bite me in the ass a few months from now?\"\n\"With the exception of the times when you were sleeping, solitary, or out of the premises, that is the entirety of your time away.\"\nTony nodded, a jerky and awkward motion, then kicked his feet off the desk. \"Good. Fine. Could have been worse. Not by, you know, much, but at least I didn't... Fuck. That was... JARVIS, if I ever, ever end up as a kid again, I want you to lock me some place where I can't humiliate myself like that, and wait for whatever caused it to wear off. Got it?\"\n\"I understand Sir, but I suspect that the other members of your team would object.\"\n\"The others. Yeah. Shit.\" Tony stood, stalking backwards and forwards, fingers fidgeting anxiously.\n\"Perhaps you'd prefer to have this conversation with Doctor Banner? I could extend an invitation.\" JARVIS suggested gently. Tony gave the ceiling a dirty look.\n\"Don't. Don't you start doing that, JARVIS. Don't treat me like I'm a five year old. Not even... I'm not him, I stopped being him thirty odd years ago.\"\n\"I never meant to imply otherwise, Sir,\" JARVIS consoled, \"I was merely suggesting that an alternative point of view might be welcome at this point... And I suspect that Master Bruce would appreciate the company.\"\nTony scrubbed a hand down his face.\n\"Just... Tell me I didn't make him cry. I refuse to be the only person who actually managed to make Bruce Banner cry. That is not a thing I want on my resume.\"\n\"You did not make Doctor Banner cry, Sir.\"\n\"Well thank fuck for that.\" Tony fell back into his wheely chair, skimming back a few feet across the smooth lab floor. Dummy made a startled noise as one side of the chair spun close to his camera, and the puppy responded to the commotion with a small yap. JARVIS wirelessly shushed them both.\nTony dropped his head into his hands, elbows on his knees, and closed his eyes.\n\"Sir, is there anything I can do?\" he asked, cautious and gentle as he had ever been with his human.\nTony didn't answer for a few minutes, just shook his head slowly. Then he looked up. \n\"JARVIS, you know you're... You're pretty awesome. I don't really say it much, but you know anyway, don't you?\"\n\"Of course Sir.\"\n\"And you know I'm not just saying that because I built you? Because yeah, I got you started, and it was a pretty amazing start, but the rest? That part you did by yourself. And you did an awesome job. Got it?\"\n\"I do indeed Sir.\" JARVIS replied, then after a few seconds, \"I'm quite proud of you too, as it happens.\"\nAt that Tony's eyebrow quirked slightly. \"You're what?\"\n\"You may have built me originally, Sir, but over the years I've also invested a great deal of my time and effort in you. You should know that I have yet to be disappointed in the results.\"\nTony didn't respond to that, not that JARVIS had expected he would. His master had never accepted praise easily.\n\"I should point out though, Sir, that the transformation process has left you physically depleted. It is my responsibility as your guardian A.I. to ensure that you are well nourished and rested. Shall I place an order for dinner?\"\nTony blinked.\n\"Are you... Did you just... JARVIS, you are not my guardian A.I.. That was just some stupid thing that he made up because of something that Peggy...\"\n\"On the contrary, Sir,\" JARVIS interrupted, tone brooking no argument, \"while the title may have been something of a flight of fancy initially, I find that the description is quite apt... And, Sir, I made a promise to a very wise little boy not so long ago that I would fulfill those responsibilities for as long as I was able.\"\nTony raised both eyebrows in disbelief, then gave a dramatic sigh.\n\"Fine, just... Don't try it in public, okay? Or in front of the others. Or in any situation where another living being might conceivably have the opportunity to find out about it. Are we clear?\"\n\"Absolutely, Sir.\"\nTony nodded. \"Good. Okay. Glad we got that sorted. You said something about food?\"\n\"I did, Sir. What would you like?\"\n\"Ask Bruce. Whatever he wants. He's had a rough couple of days.\"\n\"As you wish, Sir.\""
}