{
    "id": "45564442",
    "url": "https://archiveofourown.org/works/45564442?view_full_work=true",
    "author": [
        "Jedi_Olympian"
    ],
    "title": "In Love With Justice",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Batman - All Media Types",
        "Justice League - All Media Types",
        "DCU (Comics)"
    ],
    "relationships": [
        "Dick Grayson & Bruce Wayne",
        "Clark Kent/Bruce Wayne",
        "Dick Grayson & Damian Wayne",
        "Dick Grayson/Wally West"
    ],
    "characters": [
        "Dick Grayson",
        "Clark Kent",
        "Bruce Wayne",
        "Damian Wayne",
        "Oliver Queen",
        "Hal Jordan (Green Lantern)",
        "Diana (Wonder Woman)",
        "Jason Todd",
        "Wally West",
        "Barry Allen"
    ],
    "additional_tags": [
        "Bruce Wayne is Batman",
        "Dick Grayson is Nightwing",
        "Damian Wayne is Robin",
        "Dick Grayson is Damian Wayne's Parent",
        "Dick Grayson Meets the Justice League",
        "Batfamily Meets Justice League",
        "Dick Grayson is a Ray of Sunshine",
        "Batfamily Shenanigans (DCU)",
        "Alternate Universe - Canon Divergence",
        "Not Canon Compliant",
        "Humor",
        "Fluff",
        "Crack",
        "Comedy",
        "Misunderstandings",
        "Fake/Pretend Relationship",
        "Sort Of",
        "Secret Identity",
        "Identity Reveal",
        "Father-Son Relationship",
        "no beta we die like robins",
        "Damian Wayne is a Little Shit",
        "Jason Todd is So Done",
        "Tired Bruce Wayne",
        "Pining",
        "Batfamily is a Mess (DCU)",
        "Bruce Wayne is a Good Parent",
        "Isolated Batfamily (DCU)",
        "Mistaken for Being in a Relationship"
    ],
    "language": "English",
    "series": "",
    "published": "2023-03-07",
    "completed": null,
    "words": "9,819",
    "chapters": "1/1",
    "comments": "324",
    "kudos": "20,992",
    "bookmarks": "3,741",
    "hits": "133,079",
    "summary": "<p>Batman is notorious for his secretive ways, so when the Justice League meets someone he associates with, they naturally have questions. The questions continue to pile up when it’s clear that Batman is rather. . . close to him.</p>\n<p>Or the Justice League thinks Batman and Nightwing are dating.</p>",
    "notes": "<p>Welcome to my most recent hyperfixation!</p>\n<p>There are two things you need to know for this:<br>- The Justice League has never met the batfamily, don’t even know about them<br>- Dick did still get the Nightwing name from Superman, but not in the same way he does in the comics</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Barry: And they're best friends :D<br>Wally and Dick: *making out*<br>Barry: The bestest of friends</p>\n<p>I hope you enjoyed it! Thanks for reading! Comments and kudos are much appreciated &lt;3</p>",
    "text": "Clark waited patiently throughout the Justice League meeting as various members relayed status updates from their realms of protection, but Clark could have guessed what each update would be based on recent events and the general moods of every member.\nNothing new. Carry on.\nBut of course, they had to keep up appearances and run through the planned meeting agenda that Batman always put painstaking effort into as the resident control freak. Clark typically found B’s workaholic nature to be endearing, but sometimes, he wished the man would relax for once.\nThen finally, finally, the key item of the day’s meeting arrived: nominations to join the League.\nThe last person who joined up was Victor Stone, aka Cyborg, who had been nominated and appointed about a year prior by Diana, and his status on the team had turned out to be a godsend. It allowed Batman to take a step back from the technical aspects of the Watchtower and missions which, selfishly, allowed Clark to spend more time with the mysterious vigilante on watch duty, missions, and even downtime.\nYeah, Clark had been surprised, to say the least, when Batman accepted dinner with him, even if it was after watch duty and they hadn’t left the Watchtower. And the one time that he had accepted a piece of pie that Ma Kent had baked, even if he didn’t let them eat it in the monitor room. But baby steps, right?\nAnyway, Clark already had a hero in mind to nominate next, and he knew it would let Batman ease off even more on some of his duties. He also had a selfish desire to meet the hero considering his name was derived from a Kryptonian legend.\nBatman asked if anyone had any nominations.\n“Nightwing,” both Barry and Clark chimed in.\nThey both startled and looked at each other. Where Clark looked surprised, Barry beamed.\n“Hey, you know him, too?” Barry said. “Great! Thought I’d be the only one.”\n“Who is this Nightwing?” J’onn asked, looking between the two curiously.\nVictor spoke before Clark or Barry could, answering, “The leader of the Titans, my old team. He operates out of Blüdhaven when not with the Titans.”\n“But he does good work?” Diana asked.\n“Wally talks about him all the time,” Barry said, leaning back in his chair as he drummed his fingers on the table. “I don’t know how much of it is due to them being best friends, but Wally’s described him as their generation’s Batman.” Clark and a few others threw curious glances at Batman who didn’t react. “Apparently, he’s got the respect of everyone their age and absolutely refuses to tell anyone his identity.”\n“He’s very good at what he does,” Victor said, looking at Diana without the excitability of Barry.\nAs he spoke, he shared a set of footage to each of their personal monitors, displaying a video of a well-muscled young man in a skin-tight black and blue suit taking down a group of gangsters with swift ease. The footage shifted to that of a clip showcasing Nightwing working alongside Troia and Tempest in New York. The way he moved in tandem with Troia’s lasso reminded Clark of Batman and Wonder Woman.\nVictor continued, “Always has a plan, good at improvisation, an amazing fighter, skilled hacker, all while being completely human.”\nWell, that blew Clark’s secret hope of Nightwing being a secluded Kryptonian refugee out of the water, but oh well. He still thought Nightwing might be a good fit.\nHal chuckled. “Sounds like Spooky alright.”\n“How do you know of him, Kal?” Diana asked.\n“I wrote an article about him a few weeks ago as part of the Planet’s spotlight on vigilantes,” Clark answered. “Blüdhaven is Gotham’s sister city. Word is it’s worse than Gotham when it comes to crime rates and corruption all without the economic bustle or the eccentric rogue gallery that Gotham has. And Nightwing is the only vigilante there trying to help.”\nIt helped that the whole reason Nightwing caught his attention in the first place was the name. Clark liked the Nightwing and Flamebird story, but he supposed it was possible that Nightwing had gotten the name from something else. It wasn’t as though putting together the words “night” and “wing” for a vigilante that worked at night and liked to jump from buildings required much imagination. Clark could dream though.\n“Not to knock your investigative skills, Clark,” Arthur cut in, “but if the guy’s that busy with his own city, why would he want to join us?”\n“And if he does accept, do we need another person who does the exact same thing as Batman?” Hawkwoman asked. “Or Green Arrow, for that matter. Every other member of the League has an individual skillset.”\n“It wouldn’t hurt to have members with similar skills,” Clark said. “It would also mean we’re not always relying on B to make the plans.” He had a teasing lilt in his words as he glanced at Batman with a small smile.\nDiana smirked at the teasing even if Batman didn’t react, much to Clark’s dismay.\nBatman did, however, choose then to speak up. “With Nightwing being the leader of the Titans, he wouldn’t be able to fully dedicate his time to obligations for the League. Anyone else that can be nominated?”\nClark frowned at Batman’s quick dismissal of the Blüdhaven vigilante. It wasn’t as though Clark could infer why either. Due to the cowl and Batman’s general stoic demeanor, it made it nearly impossible for anyone to tell what Batman was thinking or feeling, so Clark had no idea what he truly thought about Nightwing. Had he been annoyed the entire time or only when Flash compared the two? Was Batman’s obligation argument the only thing he had against Nightwing, or did he have other criticisms, such as not wanting another person like him around?\nClark had no idea, yet he also had no plans to argue.\nBut Diana did.\n“Now, wait a minute, Batman,” Diana said before anyone could answer his inquiry. “He wouldn’t be the only League member to have outside obligations. Simply because it is another team rather than a people should not disqualify him from the running. I often have obligations to the Amazons, and everyone is understanding. Same with Arthur for the Atlanteans or you to Gotham. I, for one, would be happy to have this Nightwing on the team with Victor and Wally’s high praise of him.”\nClark noticed the happy tilt of Barry’s head at the mention of his nephew, but he also noticed the mild twitch of Batman’s jaw.\n“So, aside from Nightwing,” Clark moved the conversation along, “anyone have any other names they’d like to put forward?”\n“We were thinking Red Tornado,” Hawkman said, gesturing to himself and his wife. “But that would require a way to contact him first.”\n“We’ll start working on it for the next round of nominees,” Hawkwoman assured.\n“Booster Gold seems interesting,” Hal chimed in, though he was only half paying attention.\nOliver let out a sharp laugh. “No thanks. I think we have our fill of arrogance.”\n“He isn’t much of a team player,” Dinah agreed. “Seems too interested in fame and recognition than making a difference.”\n“Maybe we need someone to lighten the mood,” Hal joked, shooting a look in Batman’s direction.\nClark’s eyebrows twitched at the quiet dig at Batman. “Alright, any other serious nominations?”\nHal dramatically gaped at him, placing a hand over his heart as if saying ‘I am serious, Supes,’ but he didn’t say anything aloud at Clark’s stern gaze.\nWhen no one else moved to put forward other names, Diana nodded and said, “If anyone has concerns bring them forth now. Otherwise, everyone for Nightwing’s appointment to the League, raise your hand.”\nClark watched as a majority of the team raised their hands, excluding Hawkwoman, Hawkman, and Batman, the last of whom was a disappointment to see. But with ten out of thirteen Justice League members for Nightwing joining the team, it was set. The majority ruled when no major concerns were set forth.\nAfter that, Batman, begrudgingly by the look of his tense movements, placed Nightwing on the temporary roster, pending acceptance, and it made Clark increasingly curious as to why he was against Nightwing. If he had something against Nightwing, Clark would gladly take it into consideration, as would the others, but other than the Titans obligation, Batman had offered nothing.\nPerhaps it was something personal? As much as Clark didn’t want to think it had to do with their secret identities, if Batman refused to discuss it then it was increasingly likely that that was the case.\nOnce the meeting officially concluded, Clark, Barry, and Victor headed to Blüdhaven together to give the news and official invitation to Nightwing.\nFinding him was easy. They stood on a rooftop together, and five minutes later, Nightwing popped up behind them. If Clark didn’t have superhearing, and thus heard his heartbeat, he would’ve jumped in alarm the way both Barry and Victor did.\n“Cy, hey!” Nightwing immediately greeted with a large grin and open arms.\n“Rob, been a while,” Victor greeted in return, accepting the hug. “How’s the team?”\nNightwing patted him roughly on the back before stepping back and pointing at him accusingly. “I know you read the group chat, you lurker.”\nRob? Clark thought over. Since Nightwing didn’t say anything about the supposed reveal of a civilian identity, Clark only grew more curious. He supposed it was a nickname that was removed enough from his real name for plausible deniability, since it could be Robert, Robinson, Robel, etc. But something about it itched at Clark’s mind. Like he should know more about it than he did.\nRegardless of the name, Clark was pleased to see a vigilante be so open, smiley, and friendly, who could also clearly be silent and dangerous. He was also quite young, in his mid-twenties at the oldest if Clark had to try and pin it down. The black and blue suit left little to the imagination but also favored a light and agile approach that heavier, thicker fabrics and protections wouldn’t have allowed, like with Batman’s Kevlar-titanium suit that favored anti-ballistic protection rather than speed. Nightwing’s mask also offered no practical protection other than concealing his identity.\nThe consensus between Barry and Victor had been that Nightwing was like Batman, but that wasn’t quite the case. At least, not completely. Not in a way one would expect.\nNightwing looked between the three Leaguers, and asked, “What, no Batsy?” Clark heard the slight disappointment in his voice and spotted the pout of his lips.\n“He said he had business to attend to in Gotham,” Victor said.\nA quiet snort left Nightwing as he seemed to roll his eyes beneath the white lenses of his domino mask. “Doubtful.” Before any of the three could ask what Nightwing meant, he waved his hand. “Anyway, what can I do for the League? At least, that’s what I assume you’re here about.”\n“We wanted to extend an official invitation for you to join the Justice League,” Clark said, lifting his chin and keeping a professional tone.\n“Uh, what?” Nightwing asked, expression pinching. “Really? Me?”\n“Turns out, the Titans aren’t the only ones who’ve heard about your dumb ass, Robbie,” Victor joked, chuckling. “Both Flash and Superman put your name forward.”\nNightwing then asked, “And Batman agreed to this?”\n“I wouldn’t go that far,” Barry said, voice strained. “He was tight-lipped about why, but he wasn’t in favor.”\n“We don’t need to go into the specifics of who voted in favor and who didn’t,” Clark cut in. While he wanted to ask more about the mystery that was Nightwing and Batman’s relationship, it also wasn’t the time for it. “As of now, you have a standing invitation to join the League. This would come with all the privileges and benefits, including but not limited to Justice League headquarters and direct lines to the other members if you need backup.”\nNightwing didn’t seem to be fully listening to Clark’s spiel as he looked into the distance. In the direction of Gotham City.\nHm, curiouser and curiouser.\n“I’ll think about it,” Nightwing said, mind and tone distant. He focused on the three again. “I’ve got my own team to worry about.”\nBarry waved the concern away. “Wonder Woman said that’d be alright. A lot of the team has other priorities, too.”\n“Really? It’s not an all-or-nothing type deal?”\n“I’m certain we could make things work,” Clark told him. “Everyone on the team is a leader or protector of some kind. Everyone has their own cities or people. A superhero team isn’t much different.”\nNightwing looked in the direction of Gotham City once again, and Clark wanted nothing more than to know what was racing through his mind.\nWas he seeking Batman’s approval? Was he wanting to piss Batman off? Was he wanting to avoid Batman altogether? Was he worrying about any consequences that would arise if he joined the League?\nFinally, Nightwing slowly nodded and looked at the three Leaguers again. “Alright, yeah, okay,” he said, shifting his weight between his legs. “I’d be honored to join.”\n“Awesome!” Barry exclaimed. “Wally talks about you often, so I just know this is gonna go great.”\nAfter they relayed the time and date for the next meeting, as well as how to access the Zeta tubes to go up to the Watchtower to even attend his official welcome, they parted ways.\nNightwing remained on the rooftop, watching as Cyborg, Superman, and Flash all left, but as Clark flew into the sky, he heard Nightwing mutter to himself, “Know a guy for seventeen years: doesn’t bother to stop by with his friends. Lame. Screw you too, B. Maybe I’ll just skip dinner.”\nClark paused in the air, his faltering covered by the dark of the night. Dinner?\nThe time came for Nightwing to meet the rest of the Justice League, and Clark found himself in the Watchtower early. Not that it was a strange sight in the slightest for him to be early to meetings, but this time, he was far more jittery than usual.\nThe previous times they accepted new members into the League, Clark hadn’t been nervous. He’d been happy, ecstatic even!\nCyborg integrated well despite being the youngest. Captain Marvel seemed to open up more and accept help more often as time passed. Hawkwoman could be a little rough around the edges at times, but she worked well with Wonder Woman. Hawkman had already formed a steady bond with many of the members and had long conversations with Martian Manhunter. Green Arrow had become fast friends with Green Lantern. Black Canary became their official therapist and a constant voice of reason and mediation when tempers flared.\nEveryone who had been added to the roster after the initial formation by the original seven Leaguers had become assets to the team.\nBut hearing that tidbit of utterance from Nightwing about his relationship with Batman had Clark’s nerves flare in a way they hadn’t before.\nSeventeen years. Nightwing and Batman had known each other for seventeen years, and yet Batman still hadn’t voted in favor of Nightwing joining the League. Why? And what had Nightwing meant about not attending dinner?\nOkay, maybe that last curiosity was more Clark’s jealousy of the young hero apparently having such a longstanding relationship with the man he’d had feelings toward for ages. Clark had met Batman only twelve years ago, and he vividly remembers the day six years ago when he realized that the friendly feelings he held for Batman were no longer just friendly. Clark couldn’t look the man in the eye for two weeks without blushing like a cherry tomato.\nAnd perhaps six years was too many to harbor romantic feelings for someone without doing anything about it, but there Clark was. A wimp. A coward. A chicken. A wimp, coward, and chicken that was about to welcome a new recruit to the Justice League that had a longer standing relationship with Batman than he did.\nYou wanted him to join, Clark reminded himself.\nAquaman was the next Leaguer to arrive, and he seemed in good spirits, greeting Clark with a smile even though he seemed on the tired side.\nThey both made small talk on the far side of the room by the vast windows with a direct look at Earth, and Arthur asked about how the introduction with Nightwing went. Clark gave him the simple rundown but remained tightlipped about the supposed relationship with Batman. Clark wasn’t supposed to have heard Nightwing muttering to himself, and he wasn’t much of a gossip, unfortunately for Lois.\nAs Clark and Arthur chatted, the next two to arrive were, to Clark’s ever-growing dismay, Batman and Nightwing. They walked in together.\n“No,” Batman said as he walked through the doors, but Clark noticed the distinct lack of gruffness in his tone that he usually held toward, well, just about everyone else. The select few who he didn’t usually have a gruff, rough, annoyed tone for was Diana (of course), Barry (surprisingly), and then Clark (which he prided himself in). But now, Nightwing also seemed to hold that honor.\n“Oh, come on, B,” Nightwing dragged out with a pout as he walked a half-step behind Batman. “One night. I’ll return him in one piece.”\nThe two ignored the presence of Clark and Arthur as they went to Batman’s seat at the head of the table. Granted, it was difficult to determine the “head” of the table when it was round, but considering it was the closest to the monitor display and emergency center, it was definitely where their unofficial leader sat, with Wonder Woman and Superman’s seats on either side of him.\nBefore Batman sat down in his seat, however, Nightwing raced forward and sat down, throwing his feet up on the table and sticking his tongue out playfully at Batman who stood quietly in front of him. And then Batman didn’t snap at him. Didn’t. He didn’t even seem angry or annoyed.\nArthur raised a curious brow at the interaction and shared a glance with Clark. So, at least Clark wasn’t the only one who found their relationship strange.\n“I know you weren’t raised in a barn,” Batman said simply as he set a stack of files down on the table, nothing harsh in his voice. In fact, his tone almost seemed. . . fond?\n“One night,” Nightwing continued, ignoring Batman’s quiet command to take his feet off the table.\n“The last time you had him for an entire night without me around, he came back singing Christmas carols and threatening to murder Santa Claus for watching him sleep.”\nNightwing shrugged with a chuckle. “What’s wrong with that?”\n“It was June.”\n“What’s wrong with that?” Nightwing repeated. He then took his feet off the table and stuck his bottom lip out in an exaggerated pout. “Oh, come on, you love when we bond.”\n“When it doesn’t give me a headache in return.” They seemed to stare each other down until finally, Batman sighed, dipping his head. “Fine. One night. But please, no more Christmas carols.”\nHe gave in? Just like that? Batman actually caved?\n“Yes!” Nightwing exclaimed, jumping up from the seat.\nHe then did what Clark never thought he’d ever see. Nightwing hugged Batman.\nSomeone hugged Batman.\nBatman.\nAnd he let it happen. He didn’t attack or shove him away. Batman allowed Nightwing to hug him.\nBatman seemed unfazed at the arms wrapping around his shoulders in a tight embrace, and then he even accepted the hug by wrapping his own arms around Nightwing.\nThe hug was quick, with Nightwing pulling out of it soon after, still bouncy and happy, but it still happened.\nNightwing then sat on the table instead, next to the files, and Batman sat in his chair, shaking his head and muttering, “What have I gotten myself into?” Batman smacked Nightwing’s hand as he tried grabbing the file that sat on top. “You’re not official yet.”\n“Oh, please, like I couldn’t just hack into the system and read it for myself,” Nightwing said, grabbing the file anyway. And Batman proceeded to do nothing about it, even asking Nightwing questions about what he thought about the file in a way he never did with Clark.\nClark would have felt more strange watching the exchange if he thought Batman and Nightwing didn’t know he and Arthur were in the room. But Batman knew everything. Or at least it seemed like he did. Even so, the mysterious caped crusader did always have a good awareness of his surroundings, and Clark and Arthur weren’t hiding, so Batman definitely could have ended the conversation earlier if he so desired.\nBut still, Clark wished he hadn’t seen that exchange.\nArthur looked shocked as all hell at what had transpired, his eyebrows even shooting up in alarm when Nightwing hugged Batman. He seemed to want to ask about it, to bring it up to anyone in the room, whether it be Clark next to him or directly to Batman and Nightwing. But he kept his mouth shut after turning back to Clark.\nClark’s eyes settled on the way Batman patted Nightwing’s knee or how he spoke softly to Nightwing or how he didn’t move away from Nightwing’s foot resting on the arm of his chair or allowed gentle taps on his arm or shoulder from Nightwing.\n\nNightwing, Nightwing, Nightwing.\n\nAnd just when Clark was beginning to think that maybe, just maybe Batman might have shared his feelings. But now, he doubted he’d ever reach the level of comfort and ease that Batman had with Nightwing. Clark had thought they were close before, but it turned out Batman and Superman just weren’t as close as he thought.\nOliver lowered the binoculars away from his eyes and glanced over to see Nightwing seemingly lost in thought.\nThe young vigilante had been an official part of the Justice League for about a month when the villain Onomatopoeia popped back up again, this time in Star City. Why Oliver didn’t argue when Batman recommended Nightwing for backup, he wasn’t sure. It could be because he wanted to know more about the hero that Arthur swore up and down had hugged Batman and gotten away with it.\nDinah was less intrigued by the rumor mill spreading throughout the other League members, but even she had to admit that someone hugging Batman was so far out of the left field that it warranted at least some looking into.\nSo, there the three vigilantes sat on the roof of a tall building near the industrial district of the city staking out the area for signs of suspicious activity.\nOliver couldn’t find it in him to be annoyed that Nightwing was stuck in his head considering he had been young once, getting distracted by errant thoughts occasionally. And the kid clearly had plenty of experience bouncing out of the mindset when the need arose, so that wasn’t the problem.\nThe problem was that Oliver was curious. And it ate at him.\nThe Justice League had formed eleven years ago, and not a single member of the team could consider themselves close enough to Batman that they knew his identity. Not even Superman who not so secretly was in love with the guy. But here strolled in Nightwing who had a good relationship with the man, enough that he could apparently ask for one night with someone close to Batman?\nArthur hadn’t been certain what Nightwing was exactly asking for, so hearing it second-hand, Oliver definitely didn’t know either. Did Oliver really believe Arthur had seen them hug? Arthur had also said Nightwing called him ‘B’ when Batman typically shot down any attempt at nicknames for him, aside from Hal’s ‘Spooky’ considering he never listened to Batman’s complaints about it.\nEven then, Batman had voted against Nightwing joining the team, so why was he allowing playful antics and hugs and nicknames and recommending him for missions?\nIt wasn’t fair, and Oliver wanted to hate the kid, yet he couldn’t. Nightwing was fun and entertaining and cracked jokes easily with him, Hal, and Barry. Batman loosened up a bit when around Nightwing—not much but even the tiny sliver of change was noticeable enough. Batsy also seemed to trust Nightwing unconditionally, in a way that had never been afforded to any other member, except occasionally Superman and Wonder Woman, but that went without saying since those three were like three peas in a pod.\nWell, until Nightwing showed up and everyone realized that whatever Batman’s relationship was with Superman and Wonder Woman, it didn’t even remotely compare to his relationship with Nightwing, whatever that was.\nAnd to top off Oliver’s list of frustrations, fuck, did Nightwing seem familiar. He couldn’t place it for the life of him, but his mannerisms were so eerily familiar that Oliver couldn’t scratch the itch in his mind that he should know the kid.\nNightwing perched on the balls of his feet on the half-wall lining edge of the roof, undeterred by the presence of the long drop or the incredible balance on the thin surface. Even though he was staring in the direction of the warehouses, the tilt of his head and slow tapping of his fingers on his calves indicated to Oliver that he had other things on his mind than the Onomatopoeia mission.\n“What’s on your mind?” Oliver asked, looking up at Nightwing.\n“Rings,” Nightwing answered. Another thing that set him apart from Batman was his general honesty when speaking. Sure, he strayed away from anything too specific, but he also didn’t completely shut down any and all inquiries.\n“Rings?” Oliver repeated curiously.\nNightwing shrugged, glancing over. “Yeah, I’ve just been thinking about proposing lately.”\nDinah hummed quietly on Oliver’s other side, leaning on the half-wall. “That’s very sweet,” she said, still watching the buildings for movement. “And you’re wondering what kind of ring to get them?”\n“Yep.” There was a wistful quality to his voice as he spoke. “I went ring shopping once before for someone else, and that didn’t turn out to be what I had hoped. I don’t want to mess it up this time.”\n“What are mistakes if not lessons to learn?” Dinah pitched wisely. Ever the psychiatrist.\n“Maybe I should just talk to B,” Nightwing muttered to himself, but Oliver still picked it up in the quiet night. “Ask what he thinks.”\nOliver’s fingers gripped the binoculars tight as he tried not to show that he heard Nightwing’s mumbling. Dinah also stiffened, though less noticeably, and Oliver knew she had the same line of thought.\nWas Arthur right? Were Batman and Nightwing really closer than they let on? Maybe even close enough to warrant Nightwing thinking about proposing?\nNo, absolutely not. That couldn’t possibly be the case. Right?\n“You two are married, yeah?” Nightwing asked, perking up a little and drawing Oliver from his thoughts.\n“Yes,” he replied, willing himself to keep a straight face. No emotion, no shock, remain passive.\n“What’s it like being on a team together while in a relationship?” Nightwing wondered. \"While married?\"\n“It can be difficult,” Oliver said carefully. “Balancing priorities is usually the hardest.” Was he seriously giving Nightwing relationship advice about their sort of boss?\n“How do you handle it?”\n“Open communication is necessary,” Dinah said. “There can’t be any secrets, and when something comes up, you need to be honest about it. Be ready to talk out any conflict and see things from their point of view. And never go to bed angry.”\nNightwing chuckled lightly. “I think that’s advice for any relationship, really.”\nDinah tilted her head as she shrugged. “It’s still necessary, even more so for team members. There’s a reason so many workplaces recommend against getting involved with coworkers. Things get messy. Especially if one is of higher status or rank.”\nOliver loved her for adding that last point in there. An easy way to gauge if Nightwing was really talking about him and Batman or not.\nNightwing’s gaze turned downcast as he thought over her words. “Like a leader avoiding favoritism when assigning missions. Or needing to choose between their person and the goal.”\n\nShit, shit, shit.\n\nNightwing and Batman were dating. They were dating. Spooky had a young boyfriend.\nLike, sure, he had taste, great. Nightwing seemed like a good-looking dude from what Oliver could tell with the mask covering half his face, even when clearly on the young side, but shit. Batman was in a relationship. He was in a relationship with someone who was contemplating marriage and seemed comfortable enough to be the one doing the asking.\nSomeone wanted to propose to Batman. Nightwing wanted to propose to Batman!\nOh, poor Clark.\n“Part of me wants to believe him, you know? It’s hilarious and also kinda cute to think about, but I just can’t. Spooky an-and Nightwing? I Am the Night and Sunnyside Up? Those two?”\nHal shook his head while walking down a hall of the Watchtower with Barry by his side. After being told by Oliver all about what he and Dinah heard during their mission, Hal just wasn’t quite sure what to believe when it came to the idea of Batman with motherfucking Nightwing of all people.\nNightwing was cool, and Batman, well, Batman was not. At least in Hal’s book. At least Nightwing had a sense of humor.\n“I know, I know,” Barry said, jittery in his movements as he walked facing Hal, “but ever since Arthur said he and Supes saw them hugging, Clark’s been more down than usual. He hides it well enough, but add in his behavior with what Arthur said they saw and now what Ollie’s claiming, and it’s gotta be true, right?”\nBarry had a point. Everything that Arthur and Oliver had said plus Clark’s behavior (as subtle as it was) didn’t leave a whole lot to imagine. What other options were there aside from Batman and Nightwing being in a relationship? Hal certainly couldn’t think of any. And maybe, just maybe, Clark had gotten confirmation from Batman himself considering that the two were friends. Not that Clark would ever tell anyone what people tell him in confidence, but still.\n“Yeah, but Batman?” Hal stressed. “And Nightwing? Their attitudes couldn’t be more different.”\n“Maybe that’s what makes them work,” Barry said with a shrug.\n“I just think we need a little more evidence than that, or, I don’t know, to see it for myself.”\nThey rounded the corner to the Monitor Room, intending to begin their monitor duty, but they stopped in their tracks upon seeing Batman and Nightwing inside.\nWell, ain’t that ironic timing?\nHal grabbed Barry by the arm and hid them behind the wall to remain unseen. Hal and Barry peeked their heads out to watch carefully as Nightwing beamed from ear to ear and threw his arms around Batman, and Batman returned the hug, snaking his own arms around Nightwing’s torso.\nWas Hal going crazy or was Batman also smiling? Shit, he was. Batman was smiling! Why the hell was he smiling? Was it the end of the world? The most Hal had ever seen from him was a smirk tossed at Supes, and he’d nearly had a heart attack.\nWhen Nightwing stepped out of the hug, Batman reached up and set his hand, heavy gauntlet and all, on Nightwing’s cheek, saying something quietly before then reaching down to grab Nightwing’s ungloved hand and slide something onto his finger.\nSomething that glinted delicately in the light.\nA silver band.\nFuck, Batman just put a ring on Nightwing’s finger. What has the world come to?\nIf Clark thought his crush on Batman had passed the point of no return before, it hit a whole other milestone upon meeting Robin. Like the gossip from Barry, Hal, Oliver, and Arthur wasn’t already making it worse.\nThe meeting started with Nightwing catching Robin in mid-air before Clark could and then teasingly saying, “B would kill me if I returned you with anything broken.”\nRobin then stuck out his tongue in playful defiance the same way Clark had seen Nightwing do to Batman only two months before.\nClark and Diana had gone to New York to deal with Giganta before any serious property damage could be inflicted. Together, the two had it covered nicely. That was why Superman offered to go with her, to get it done quickly. It only added to their surprise to see Nightwing there with a child dressed in red, yellow, green, and black, both falling through the air.\nBut Nightwing was quick with his grapple and caught the kid easily without needing help from Clark and Diana.\nIt wasn’t until they were finished with the Giganta business that they were introduced to the kid, who looked no older than fourteen but no younger than eleven.\nOn the rooftop the four settled on, Nightwing gestured to the kid who stood proud beside him and said, “This is Robin.” Nightwing set his hand on Robin’s shoulder with a gentle pat and let it rest there.\n“It’s an honor to meet you, Robin,” Diana said with a smile.\nRobin curtly nodded. “Likewise, Wonder Woman.” His head then tilted up to look at Superman. “Alien.”\n“Robin,” Nightwing scolded, flicking the kid on the back of the head.\nThe kid crossed his arms over his chest with a huff, looking away with a mumbled, “Sorry.”\nOkay, so this Robin not liking him stung a bit, but Clark had heard and dealt with worse than a surly child vigilante. At least, until he realized something that hurt far worse.\nRobin was Batman’s son.\nIf a child was ever so clearly Batman’s child, it was Robin. Robin who had Batman’s strong jaw and broad shoulders. Robin who had a sword strapped to his back. Robin who quietly sneered at the presence of Superman. Robin who had Batman’s same scowl. Robin who stood with such poise and arrogance that it reminded Clark of the early days he knew Batman.\nClark tried not to let anything show.\n“What are you two doing in New York?” Clark asked amicably.\n“We were visiting Titan’s Tower,” Nightwing answered. “It was supposed to be just a quick trip, but Robin wanted to join. Make it a weekend thing. It helps that he likes challenging Beast Boy to fights.”\n“Someone needs to,” Robin said snidely.\n“If you could stop trying to beat up my teammates, that’d be great,” Nightwing told him. “Even if you do often kick their asses.” Nightwing looked back up at Clark and Diana. “He’s like a little demon when he fights.”\nThat got a smile out of Robin, and that broad grin was directed at Nightwing.\nClark could at that to the list of things that made his heart ache. Robin looked at Nightwing like he was his whole world.\n“Perhaps we could spar sometime, Robin,” Diana offered, smiling fondly at the two.\nThe way Robin focused on Diana made Clark wonder if Robin was sizing her up and calculating his chances against her. But he didn’t respond, keeping whatever he decided to himself.\nNightwing chuckled and tugged Robin closer. “We should get going. Long drive back to Gotham.” He gave them a salute as they began walking to the edge of the roof. “Good seeing you.”\nTogether, the two leaped off the roof, using their grapples to land safely down below, and as Clark turned to head out with Diana, he heard Nightwing and Robin talking. He didn’t mean to eavesdrop but part of him couldn’t help it the moment he heard the word ‘dad.’\nWell, a version of it.\n“Baba,” Robin said quietly to Nightwing in the privacy of the alley below. “Do I need to go back tonight?”\n“Hey, hey,” Nightwing said softly. Clark heard the rustling of fabric, and he imagined Nightwing had hugged the kid. “Why don’t you wanna go back to B?”\n“Father’s been busy with a case and won’t let me help,” Robin revealed. “I’m not even supposed to have the Robin suit right now. When news hits about Giganta, I’ll be grounded for even longer.”\n“Oh, Baby Bat, you can’t just run from your problems.” Nightwing paused. “Or use me to get out of your grounding without telling me.”\n“Father hasn’t called all weekend.”\n“That doesn’t mean we’re not in big trouble when we get back.” Nightwing was quiet for a few moments again. “But no more Christmas carols around him, ‘kay? We don’t need him angrier than usual.”\nRobin laughed quietly. “No promises, Baba.”\nThe sound of their chorused laughter was then drowned out by the sound of a motorcycle engine.\nDiana snapped him out of his eavesdropping. “I wish I could say I was disappointed, but I heard it, too,” she said, looking at Clark knowingly. Clark bashfully scratched at the back of his head. At least he wasn’t the only one eavesdropping. “Baba and Father. I’m happy for them.”\nClark didn’t miss her tone. “Don’t get me wrong, Diana,” he said. “I’m happy for them, too. There’s just. . .” He trailed off with a wistful sigh.\n“Part of you wonders what it could have been like if you told him sooner,” Diana finished for him.\n“Yeah.” Clark gazed up at the sky where the stars were becoming visible in the early night, peeking out from behind the sparse clouds. “As long as he’s happy, I’m happy.”\nAnd he meant it. He meant every word.\nAnother month passed with the entire Justice League coming to terms with the fact that Batman and Nightwing were in a relationship and getting married. Most of the team were surprised or reluctant to believe it, but the more they saw of the two’s interactions, the more they believed it, and the more they were happy for them.\nExcept for Cyborg, that is, but no one knew why he continued to be a disbeliever, especially since he never said his reasons. So, to the rest of the team, he was just a cynic, and they ignored him.\nThen one day, Oliver and Hal arrested Red Hood while he was in Star City and brought him up to the Watchtower.\nTypically, Gotham rogues were left to Batman, but they hadn’t even gotten the chance to call him when Nightwing and Robin arrived and asked what he was doing in Star City. They asked Red Hood why he was in that city instead of asking Oliver or Hal what Red Hood had been doing when they arrested him. Though they were also wondering why Nightwing was even asking considering Red Hood was on their Most Wanted list.\n“I was just visiting a friend, but Lame Arrow here decided I must’ve been doing something illegal,” Red Hood snarked, then turned sharply to Oliver. “But I wasn’t.”\n“You’re still a wanted criminal,” Oliver pointed out, annoyed at the degrading nickname.\n“He certainly isn’t wanted, even if he is a criminal,” Robin said, arms over his chest.\nNightwing had to bite back a chuckle and lightly smacked Robin’s shoulder. “Stop it. That's rude.”\n“Who is this child?” Hal asked, pointing at Robin.\n“Robin, of course,” Robin answered snottily for himself.\nHal looked at Nightwing for a direct answer instead, but Nightwing nodded. “Okay,” Hal said. “And what’s he doing in the Watchtower?”\n“He’s with me,” Nightwing said as if that answered the question. “We’ll take Hood from here.”\n“Uh, what?” Oliver asked. “No. Why?”\nNightwing looked at him as though he was thinking Oliver was an idiot. “He’s Gotham’s problem. Frankly, I don’t even know why Batman hasn’t taken him off the list. He’s been a good boy lately.”\n“Oh, bite me, Dickwing,” Red Hood growled beneath the helmet.\n“I would, but I’m into redheads,” Nightwing playfully snarked back.\nThe Zeta tube then announced the arrival of Flash who was about to zoom past and go directly to the Monitor room, but he stopped by the group gathered in the foyer instead, curious as to why Hal was escorting a criminal but had stalled.\n“What’s going on?” Barry asked.\n“Apparently, Nightwing is into redheads,” Hal joked, yet the joke also had the side effect of Hal, Oliver, and Barry all from this point believing that Batman must’ve had red hair.\nThen Oliver realized something. “Wait, does that mean you know he’s not a redhead?” he asked, gesturing to Red Hood with a nod of his head.\n“We’ve been subjected to his ridiculous skunk stripe for years in the Batcave,” Robin said. “He should really start dyeing it.”\n“Fuck off, Demon Brat,” Red Hood growled. “Can we throw him in the Gotham Reservoir?”\n“I don’t think B would allow that,” Nightwing said.\nRobin stared defiantly up at Red Hood. “I’d like to see you try.”\nCutting in again, Oliver asked, “Wait, wait, so you know each other?”\n“Fuck, are you slow,” Red Hood groaned. “Yeah, you think I wear the Bat symbol on my chest for no reason? It’s not to piss Batman off. I’m one of Gotham’s vigilantes, jackass. The crime thing’s in the past. Bring it up with Batman.”\nOliver, Hal, and Barry looked at him in alarm, but they didn’t get the chance to ask when Superman and Martian Manhunter left the Monitor room and noticed them on their way to the Zeta access.\n“Flash, you were supposed to be relieving us with Cyborg,” J’onn said as he and Clark walked over. He then noticed their shocked expressions. “Is something the matter?”\n“We’re trying to explain that Red Hood should be handled by Batman, and we’ll take him to Gotham,” Nightwing answered, gesturing to himself and Robin.\n“No, no, no,” Oliver said quickly, shaking his head. “You can’t just gloss over what Hood said. Is he seriously one of Gotham’s vigilantes?”\n“I thought Gotham only had Batman,” J’onn said.\n“And Robin,” Clark added, looking over the group curiously.\nRed Hood let out a loud, sharp laugh. “Yeah, right. What’s the number at now? Ten? No, eleven including ‘Wing when he’s by on weekends.”\n“You forgot Batwing,” Nightwing pointed out. “So twelve total.”\n“How’d you know I forgot Batwing?”\n“Because he’s usually the one you forget.”\n“Alright, that’s fair.”\nThat was when Clark quietly pulled out his communicator and sent a message to Diana requesting her presence in the Watchtower. If anyone was going to get to the bottom of things quickly and efficiently without the presence of Batman, it’d be her. And part of him wanted her reassuring presence as he continued to learn more and more that he apparently didn’t know anything about Batman.\n“What happened to the whole ‘I work alone’ thing?” Hal asked.\nThat got good belly laughs out of Nightwing and Red Hood, and even a quiet chuckle from Robin.\n“He hasn’t worked alone in a good seventeen years,” Nightwing said through the laughter. “Or ever if you count Penny-One, which I do, but he’s not a vigilante.”\n“He hasn’t told any of you because he doesn’t like you,” Red Hood said.\nNightwing made a strangled noise as he shook his head and waved his hand. “That is not true. He’s just not friendly and only sees them as colleagues.”\n“We’re standing right here,” Clark pointed out, raising his hand to get their attention. The others didn’t miss the ounce of hurt in his tone.\n“Yeah, we see that, Boy Scout,” Red Hood said, looking back at him before focusing on Hal. “So, can you let me go, glowstick? Batsy’s favorite has already vouched for me.”\nHal glanced at Oliver who sighed with a shrug, then he undid the cuffs binding Red Hood’s wrists. Hood rolled his wrists before rubbing them. Hal and Oliver remained tense as Red Hood grabbed his duffle from them roughly, but when he only threw it over his shoulder, they relaxed a bit. He also went to stand next to them, watching as Red Hood patted Nightwing on the shoulder.\nThe nearby Zeta access then came to life as both Cyborg and Wonder Woman entered the Watchtower.\n“What have we missed?” Diana greeted carefully, eyes flitting around the gathered, ever-growing group.\n“Just handing off a criminal to Nightwing and a child,” Hal said, shrugging. “Must be nice to be Spooky’s boy toy.”\nNightwing, Red Hood, and Robin tensed and looked at Hal. “Um, excuse me?” Nightwing asked. “What exactly do you mean by that?”\n“Sorry, was it supposed to be a secret?” Hal wondered. “The whole League knows you and Spooky are together. It’s alright. We’re all cool about it.”\nNightwing, Red Hood, and Robin each let out groans of utter disgust at varying levels of volume, each verging on gagging and wanting to vomit at the mere suggestion as they folded in on themselves.\n“Goldie and the old man?” Red Hood said. “Oh, that shit’s disgusting.” He raised a hand to his helmet, setting it on where his forehead would be as if lightheaded.\nRobin’s hand went to the handle of his sword as he started to unsheathe it. “How dare you insinuate such a repulsive idea!”\nNightwing barely reacted as he grabbed Robin by his wrist, holding him back. He focused on Hal. “Excuse me? You think we’re what?” he asked.\n“Together,” Hal answered. “Dating. Partners. Getting busy. Lovers.”\n“I think they get it, Lantern,” Clark interrupted desperately at the same time Nightwing said, “Please stop,” in a small voice.\n“Nasty,” Red Hood said. “That’s the worst thing I’ve heard all day. Hell, worst thing I’ve heard all year!”\n“The only thing that Batman’s in love with is justice,” Nightwing assured, letting Robin’s wrist go.\nRobin then said, “Well, that and—”\n“We don’t need to get into that,” Nightwing cut off, nudging Robin with his elbow.\n“I think I’m gonna hurl,” Red Hood continued bemoaning.\n“It pains me, but I am with Hood,” Robin said. “The thought of Nightwing and Batman is nauseating.” He shivered.\nNightwing wiped a hand over his face, growing more and more unamused by the second. “We get it.”\nRed Hood fake gagged and Nightwing shoved him away, causing him to start laughing. “Oh, they’re never going to believe us!” Red Hood said, doubling over as his laughter filled the room.\n“Who?” Oliver asked.\n“Anyone.” Red Hood held his arms out. “Everyone! How idiotic do you have to be—”\n“Hood.” Nightwing sent a glare his way.\nRed Hood waved him off. “Don’t pretend like you’re not immediately about to call up all your friends the moment you get home and expound on the fact that the Justice League is composed of a group of morons that think you are dating Batman.”\n“For the record,” Victor started, “I’ve never once believed it and always said it wasn’t true.”\n“That goes without saying, Cy,” Nightwing said. “You’re better than that.”\nHal gaped in offense, turning to his fellow team members. “Are we just going to sit here and listen to this?”\nRobin glared his way, shifting his weight dangerously. “You deserve worse than public humiliation.”\n“You know what? I’m not waiting.” Red Hood pulled out his phone from his jacket pocket. “I’m telling everyone.”\n“What do you mean?” Clark asked. Oh, how he didn’t want Batman to know about this.\nRed Hood cackled to himself. “You’ll see.”\n“Hood, no,” Nightwing pleaded.\n“I’m continuing to agree with Hood,” Robin said.\nNightwing quickly faced Robin. “Baby Bat, no. Why?”\nRobin crossed his arms over his chest again. “You will not allow me to stab them. Batman and Penny-One would be disappointed as well. Humiliation it is.”\nA few moments later, the younger Flash came speeding in, in tandem with the Zeta tube announcing his arrival. Wally’s bright red hair stood ruffled and curled on top of his unprotected head. He stopped next to Nightwing, between him and Red Hood, gaping at the League.\n“That is disgusting,” was the first thing out of Wally’s mouth. No greeting. No pleasantries. Just him being completely appalled.\n“What the—” Oliver started, but he was interrupted.\nWally held up his phone, the text from Hood on display.\n\nJT Hood: Your dumbass uncle and co think N is dating B. \nWatchtower. \n\n“Seriously?\" Wally asked incredulously. \"You all think Nightwing is dating Batman? Even you, Uncle Barry?”\nNightwing groaned. “Who all did you text?”\n“Everyone,” Red Hood answered. \"Funnily enough, he was the last one.\"\nBarry nonchalantly shrugged his shoulders, trying to make it seem less like a problem. “Is it really such a big deal?” he asked. What he really wanted to ask was why it couldn’t blow over already.\nNightwing, Wally, Hood, and Robin all chorused, “Yes!”\n“Alright, you’re not dating Batman,” J’onn said, placatingly raising his hands, “but why are you treating this misunderstanding as something unforgivable?”\n“I think the real question is why you even think it in the first place?” Red Hood asked.\n“I’ve never seen anyone hug Batman and live,” Barry said.\nOliver went next, motioning to Nightwing. “You said you were thinking about proposing but weren’t sure about the ring. Then you decided to just ask Batman. And you asked about being on a team with someone you’re married to.”\n“Also, Flash and I saw Spooky put a ring on your finger while smiling,” Hal added. “We thought that was him proposing.”\nNightwing rubbed the back of his neck. “Yeah, I guess that does all sound incriminating.”\n“If that was not Batman proposing to you, what was it?” Diana asked.\n“I wanted to show him the ring my fiancé picked out for me,” Nightwing explained. “And after looking it over, he put it back on me. I didn’t think it was weird.” His tone showed an insecurity that hadn’t been there before.\n“It’s not,” Red Hood reassured harshly. “They’re just reading into it.”\n“Like a father can’t be happy for his son.” Robin clicked his tongue before freezing upon realizing what he had revealed. Both Nightwing and Red Hood glared at him.\n“Wait, what?” Clark asked, eyes widening.\n“Care to repeat that?” Hal prodded.\nRobin shifted his weight. “No, I do not.”\n“I thought you were Nightwing’s son,” Diana then brought up.\nEveryone turned to look at her, aside from Clark who ducked his head with a blush, indicating he had thought the same thing. Considering neither Diana nor Clark were much for gossiping about their team members, none of them had been privy to those thoughts prior, and it surprised them all, to say the least.\nBarry was the first to speak after that bombshell. “Okay, now I’m confused.”\n“The rest of us are not on Diana’s wavelength,” Oliver told the younger heroes.\n“We heard Robin call Nightwing ‘Baba’ which means ‘Dad’ in Arabic,” Clark explained. “And then he also referred to Batman as ‘Father.’ That’s why we assumed Nightwing and Batman were together.”\nJ’onn gazed at each of them carefully, studying their mannerisms and words. “Just when I was beginning to understand humans.”\nBarry threw his hands up in exasperation. “I dunno, man. I’m human, and I still don’t understand.”\nNightwing sighed and wiped his hand over his face. “It’s a long story that includes secret identities,” he said. “But to keep it short, I’ve helped raise Robin, so our relationship has become more like father and son rather than siblings.”\nHal pointed at him. “So, you are Spooky’s son then? And so’s Robin?” he asked for clarity.\n“Just forget the other one in the room, huh? That’s cool,” Red Hood said offhandedly. “Middle children just suck, I guess.”\n“You’re Spooky’s son, too?” Hal asked in surprise. “How many damn kids does he have?”\n“Too many,” Red Hood said as Nightwing answered, “A lot.”\nThey then all froze at the announcement of Batman and Red Robin’s arrival via the Zeta tube. The group went dead silent as they all looked to see Batman stalking over to them with another vigilante at his heels. This vigilante dressed in a fashion similar to Batman and Robin, with a cape and cowl along with red and yellow. He also had a bird logo on his chest, like the Nightwing did. The other members of the League didn’t recognize him, but Nightwing, Red Hood, and Robin did.\n“What is going on?” Batman asked, coming up on them. He looked around and received no response. So, he put his hands on his hips and tried again, his voice stern and gruff as he expected someone to answer him. “Red Robin refused to elaborate more than coming up to the Watchtower urgently. I will ask again. What is going on?”\nBarry looked at him with wide eyes and a gaping expression, horrified. “It makes so much sense now. The Dad voice.”\n“Fuck, Spooky is a dad,” Hal muttered.\n“Excuse me?” Batman asked the same way Nightwing had earlier.\nRed Hood chuckled, though it lacked mirth. “Cat’s outta the bag about the Batfamily,” he said. “Blame the Demon Brat.”\nRobin raised his chin, meeting Batman’s gaze. “It was a slip of the tongue. I apologize, Father. Though I said nothing other than Nightwing being your son. Those two idiots brought up me and Hood.”\n“Like they didn’t already know you were his kid, you little gremlin,” Red Hood countered.\n“How did this even come up?” Batman asked, a tired tone setting in.\n“It was probably an explanation to stop them from thinking you and ‘Wing are together,” Red Robin said.\nBatman’s shoulders tensed as he turned slowly to face Red Robin. “What did you say?”\nRed Robin handed Batman his phone, showing the text Hood had sent him not ten minutes prior, and the present members of the Justice League waited with bated breath. They didn’t know what precisely was in the text, and they feared Batman’s reaction to the assumption.\n~dead hood~: The League thinks Dickwing and Daddy Bats are fucking. Get to the Watchtower ASAP.\nBatman slowly handed Red Robin his phone back and turned to the Justice League. Tense moments passed as he looked at each and every one of their faces. He silently wondered if the others that were not present also thought the same thing. He assumed they did. The only one who seemed unfazed by the entire situation was Cyborg, but he had known Nightwing for years and thus clearly remembered that Nightwing had once been Robin, which meant he definitely knew Nightwing wasn’t romantically or sexually involved with Batman.\nThis meant Victor was the only one who didn’t deserve Batman’s contempt. The others did though.\n“I’m on a team with a bunch of morons,” Batman finally said.\nCries of outrage erupted amongst the group, particularly from Hal and Oliver, yet every member present was offended in some way, except Cyborg and Nightwing. Then Batman slowly stalked forward, and they quieted down as Batman pointed to Wally while looking at Barry.\n“I’m the most disappointed in you, Flash,” Batman said.\nIt took a few moments for Barry to realize what Batman was referring to as he glanced back and forth between him and Wally, and then he finally settled on Nightwing and noticed how close Wally was standing next to him. Brain synapses fired at lightning speed as he slowly came to the realization that Nightwing was Wally’s boyfriend, or now fiancé, whom he had met multiple times and had dinner with when they announced their engagement.\nOh, geez, he'd called them best friends.\n“I’m an idiot,” Barry blurted.\n“You can say that again,” Red Robin quipped.\nWally easily nodded in silent agreement with Red Robin before smiling as Nightwing laced their fingers. It was a sight that Barry had seen many times before. Wally and his boyfriend could be sickeningly sweet when they set their minds to it and even when they weren’t trying.\nThen another set of realizations set in for Barry. He’d met Wally’s boyfriend. His civilian boyfriend. He hadn’t known until now that that boyfriend was Nightwing, so he’d only known him as—\nWally was dating Dick Grayson.\nDick Grayson as in Richard Grayson-Wayne, the eldest son of the billionaire Bruce Wayne, the CEO of Wayne Enterprises and Prince of Gotham. Richard Grayson-Wayne who had multiple other siblings: namely, Jason Todd-Wayne, Timothy Drake-Wayne, Damian Wayne, and Cassandra Cain-Wayne. Richard Grayson-Wayne who worked as a cop out of Blüdhaven, New Jersey. Richard Grayson-Wayne who had grown up in a circus and had lost his parents in a tragic incident seventeen years ago.\nDick Grayson was Nightwing.\nIt all made so much sense. Everything had been staring him in the face, and it was only just now clicking.\nBarry’s jaw settled in a semi-permanent open position as he processed everything. “Wait, that means you’re—” He pointed at Nightwing. “And you’re—” His pointing shifted to Batman. “And the others—” He shook his head with a strangled yelp, brain short-circuiting, and he quickly hid his face in his hands.\n“He just realized your identities, didn’t he?” Diana asked.\n“I’m surprised he’s the only one,” Red Hood said, looking in Oliver’s direction.\nNot a moment later did Oliver begin donning the same shocked expression as Barry, though his had more anger in it.\n“Wait. . . Wally is dating—” Oliver cut himself off as his eyes snapped wide open, and he looked up at Batman. “Shit, come on! Really? We’ve been friends for over twenty years! And this is how I find out that you’re Batman? What the hell!”\nBatman didn’t react. “Not my fault you’re too slow, Ollie.”\n“We went to school together!” Oliver exclaimed.\n“Your point?”\n\"We've slept together!\"\n\"Your point?\"\n“I’m still very confused,” Hal said, a bit sad.\n“You and me both,” J’onn agreed. Clark didn’t say it aloud, but he did nod in agreement as well.\nBatman sighed and shared a few glances with his sons, then they all reached up and remove their masks and cowls, showing the group their faces, something they should have done ages ago.\nIt was then Clark’s turn for his brain to short circuit. “Bruce. . . Wayne?”\nThe handsome face of Bruce Wayne gazed carefully up at Clark with the makings of a small smile. “Clark.”\nEverything hit Clark at once.\nEvery meeting with Bruce Wayne at a gala or one of the Wayne Enterprise buildings or the Daily Planet. Every knowing grin Bruce donned when Clark brought something up during their meetings or interviews. Every time Batman would mention something that was in Clark’s articles when on monitor duty with Superman. Every piece of seemingly innocuous information that either Batman or Bruce ‘let slip’ to Clark and Superman.\nEvery flirtatious comment Clark and Superman received from Bruce. Every time Bruce asked out Clark and Superman. They weren’t jokes or Brucie Wayne being a stereotypical playboy. They were real. Every single time. And Clark had turned down every single one.\nClark just had one thing left to say.\n“You’re an asshole.”\nBruce chuckled of all things, taking the insult in stride. “I deserved that.”"
}