{
    "id": "4687064",
    "url": "https://archiveofourown.org/works/4687064?view_full_work=true",
    "author": [
        "greenleaf"
    ],
    "title": "Stop Crossing Oceans",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Teen Wolf (TV)"
    ],
    "relationships": [
        "Derek Hale/Stiles Stilinski",
        "Scott McCall & Stiles Stilinski"
    ],
    "characters": [
        "Stiles Stilinski",
        "Scott McCall",
        "Derek Hale",
        "Allison Argent",
        "Lydia Martin",
        "Jackson Whittemore",
        "Cora Hale",
        "Isaac Lahey",
        "Erica Reyes",
        "Vernon Boyd",
        "Danny Māhealani",
        "Sheriff Stilinski",
        "Alan Deaton",
        "Minor Characters"
    ],
    "additional_tags": [
        "Alternate Universe - Canon Divergence",
        "Alpha Derek",
        "Alpha Scott",
        "Emissary Stiles Stilinski",
        "Alpha Mate Stiles Stilinski",
        "Spark Stiles Stilinski",
        "Scott is a Bad Friend",
        "Scott McCall is a Bad Alpha",
        "Toxic friendship",
        "Angst",
        "So much angst",
        "Fix-It",
        "Pack Building",
        "Pack Bite",
        "Losing friends",
        "Life is hard",
        "Deaton Can't Be Trusted",
        "Sheriff is wise",
        "Canon-Typical Violence",
        "Blood Magic",
        "Character Study",
        "Broken Friendship",
        "Morally Ambiguous Character"
    ],
    "language": "English",
    "series": "",
    "published": "2015-08-30",
    "completed": null,
    "words": "11,654",
    "chapters": "1/1",
    "comments": "602",
    "kudos": "17,852",
    "bookmarks": "3,992",
    "hits": "218,049",
    "summary": "<p>“There are no absolutes, Scott! No hard rights or hard wrongs! The world doesn’t fucking work that way and we can’t afford to think like that, because people are going to die! We signed up for that the moment we got involved with all this!”</p>\n<p>“We? We?” Scott hisses. “Don’t you think <i>you</i>? Don’t forget that you’re the one who dragged us into that forest the night it all started, Stiles. So if it’s anyone’s fault, it’s <i>yours</i>.”</p>\n<p>Something inside Stiles cracks, so strong and so deep that he practically <i>hears</i> it.</p>",
    "notes": "<p>The title comes from the quote: <i>“There comes a time when you have to stop crossing oceans for people who wouldn’t even jump puddles for you.”</i></p>\n<p><b>Edited May 14, 2018:</b> I took the time to proofread the fic with some minor grammar, spelling, and text changes, nothing drastic. Thank you.</p>\n<p><b>Edited May 17, 2018:</b> A week ago, it came to my attention that somebody on Wattpad plagiarized this story, with huge chunks taken word for word without credit or mention of the original work. Today, I send my sincere gratitude to the original Anon who messaged me on tumblr and informed of the mess, as well as <i>SpanglesandSass (Fidella)</i> and the absolutely lovely, <i>M,</i> who both pointed me in the right direction. Wattpad responded promptly and has taken down the offending story.</p>\n<p>I know that nowadays, creativity isn't really about being original. Sometimes it's just being good enough not to get caught. But let us all avoid stealing somebody's work, or at least seek permission and link back to the original. That's just common decency.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>I'm not really sure why I wrote this, but I did. This is unbeta-ed and I don't really write in present tense, so I apologize for any mistakes.</p>\n<p>Please inform me of any missing tags. Thank you.</p>",
    "text": "The necromancer is the last straw.\nThey put it to a vote. Stiles was all for killing the bitch. Derek was too. But they argued about how, because Stiles wanted to drain her and take her magic away, while Derek wanted to take her entire head away. Both were effective though, so Stiles compromised and chose a magical draining ritual before the beheading.\nDerek’s betas, Isaac, Boyd and Erica, and Lydia, Danny, and Jackson, each had their own opinions, but they all agreed with Stiles’ practical plan – as morbid as it may sound to call it a beheading practical.\nIn hindsight, Stiles should have known better. He had seen the look on Scott’s face, the way his lips curled and his crooked jaw tensed. Allison had looked much the same, for all she had also wanted to kill the bitch, but her eyes had narrowed at Stiles’ rather flippant tone.\nBut Stiles had ignored his gut feeling, had ignored Scott’s claims that they were sentencing a person to die.\nStiles remained steadfast; the death of one over the death of more, it was an easy choice for him.\nScott refused and before a decision could be made, he, with Deaton’s help, chose to lock the necromancer away.\nIt was laughable.\nNecromancers fed from the life force of any creature and all it took was a rat scurrying into her cell to help her free herself. She killed seven more civilians, one of whom was seven years old.\nThat is how they ended up here and now.\n“Her name was Ava and she was seven fucking years old, Scott!” Stiles screams, remembers how it felt like his heart had been ripped out of his chest when he saw those crime scene photos. “And that fucking necromancer killed her all because we didn’t chop her head off when we had the chance!”\nScott is fanged and red-eyed and he snarls. “It wouldn’t have been right to kill her!”\n“What? And you think it was fucking okay for that damn bitch to kill that kid?”\nScott purses his lips, obviously conflicted, but there is a hard, stubborn edge to his jaw that Stiles recognizes. It makes him more furious than he has ever been in his entire life.\n“Seven fucking years old, Scott,” he hisses.\n“We are not killers,” Scott says, tries to reason.\nIt makes Stiles laugh and the sound is ugly. He notices the others flinch and it makes him laugh some more.\n“Really? Really, Scott? We’re supposed to protect this damn town! Protect people from getting hurt! So don’t go saying we’re not killers or preaching that there is always going to be another way! Because not killing that damn necromancer was the same fucking thing as if we were the ones who killed those people!”\nIt is the one thing Stiles knows Scott doesn’t want to hear, and the young Alpha roars.\n“Shut up!”\nBut Stiles is fearless in the face of his own mistake, in the nth death he is unable to stop.\n“There are no absolutes, Scott! No hard rights or hard wrongs! The world doesn’t fucking work that way and we can’t afford to think like that, because people are going to die! We signed up for that the moment we got involved with all this!”\nScott’s face morphs into something cruel and malicious.\n“We? We?” he hisses. “Don’t you think you? Don’t forget that you’re the one who dragged us into that forest the night it all started, Stiles. So if it’s anyone’s fault, it’s yours.”\nSomething inside Stiles cracks, so strong and so deep that he practically hears it.\nNo one says a word, even Derek, but that’s only because the Alpha roars, loud and strong and absolutely furious.\nScott roars back and angrily stomps out, and Stiles feels something inside him break some more.\nLydia is furious, so much so that her long hair floats about her shoulders like an out of control flame. Her lips are pressed tightly together and it is obvious that she wants to scream. Jackson looks conflicted and Danny looks disgusted.\nDerek’s betas are as angry as their Alpha, golden eyes gleaming and Erica already flexing claw-tipped fingers.\nAllison follows after Scott, but looks back one last time. No one follows her.\nStiles does nothing, and years later he’ll wonder if he should have gone after Scott, if that will have changed things.\nBut at this moment, he doesn’t go after him.\nThus begins the great divide.\n \n \n \nAllison sticks close to Scott in school and it is obvious that she has made her choice. Stiles doesn’t even want to know if it’s a choice made as a huntress or as a lover. He thinks he’ll be disappointed either way.\nDerek’s betas choose Stiles and Stiles knows better than to belittle them and assume that Derek put them up to it. As sure and as willingly as Erica, Boyd and Isaac chose the bite when Derek offered, Stiles knows they can make up their mind the same way on who they choose to support.\nIt bothers Stiles when Lydia and Danny choose neither, with a conflicted Jackson following after. Jackson feels the pull to his Alpha, the same way as his fellow betas, but his heart is with his makeshift pack. Stiles understands but part of him just wants the other two, immensely intelligent and pragmatic individuals that they are, to finally make a stand, even if it’s not at Stiles’ back.\nThe truth sinks into Stiles two weeks later, when Scott refuses to stand beside him during Ava’s funeral, choosing a spot clear across the casket. What’s more is that he brings Deaton with him.\nStiles has never trusted Deaton, Scott knows this, and this is as sure a declaration as anything.\nStiles finally makes a decision a few days after that when he sees Scott and Allison after school with Kira Yukimura, the new girl, the one Derek identified as a kitsune. They had been meaning to set up a meeting with her pack, which the betas scouted out to only be her parents and no one else, but they hadn’t been able to do so given the clusterfuck that had been happening one after the other.\nNow Scott and Allison are taking her with them, all smiles and friendly laughter as they board Allison’s car.\nIsaac and Boyd follow after and a few hours later, they confirm that Scott and Allison bought Kira to Deaton and then went to the Yukimura pack. The next day, Kira starts sitting with them. The day after that it’s a freshman by the name of Liam.\nThe betas don’t say anything about a new wolf, but Stiles can feel intent. By the way he sees Lydia purse her lips at the sight, she obviously thinks the same.\nScott is making his move. He’s keeping secrets, not telling Stiles anything anymore.\nStiles decides to do the same.\nHe drives to the loft, has never been surer of anything in his life the moment he parks his jeep, gets out, and barges inside. He barely registers the sound of Lydia’s car behind him and the sound of clacking heels and stomping sneakers.\nDerek stands in the middle of the room, dressed in one of his signature Henleys. Erica and Boyd are peering out from the kitchen and Isaac from the stairs leading up to the second floor.\nBehind Stiles, he can hear Lydia’s breaths and Jackson and Danny’s murmurs.\nStiles can’t bite his shoulder even though that’s where he wanted it to scar, close to his throat to where his pulse beats strong and sure and unrepentant. So Stiles brings his right hand to his mouth, eyes right on Derek as he sinks his teeth into the fleshy part of his thumb. He relishes in the copper that floods his tongue.\nThe wolves snarl and the humans gasp.\nDerek’s eyes narrow, his nostrils flare, and his fingers curl into a fist. He makes no move to stop Stiles and watches closely as blood trickles down his wrist.\nStiles releases his bloody hand and offers it to Derek, palm down.\n“Alpha,” he says, voice as strong and sure as the way his heart beats.\nDerek steps forward and raises his hand, lets his fingers trail over the back of Stiles’ fingers, light and ticklish for such strong, thick hands. His reaches Stiles’ wrist, grips it tight, and the next thing Stiles knows, he’s being dragged forward until Derek’s fangs are hovering mere centimeters from his bleeding wound and his eyes are Alpha-red from bloodlust.\nStiles is more surprised from being jerked forward than the sight of Derek’s fangs. He’s not even surprised by the question in Derek’s eyes.\nOne last chance to back out. One last chance to choose someone else\nOne last chance to walk away.\nStiles remains steadfast in the face of the Alpha before him.\n“No regrets,” Stiles says. “No turning back.”\nDerek smirks, a sense of pride shining in his blood-red eyes. He sinks his fangs into Stiles’ right hand, right over the teeth marks, hard enough to further the bleed and make sure it scars, but not enough to turn.\nHere. Stiles wants it here, this hand, because starting today this is who he is, how he’ll introduce himself to the fucked up world the moment he reaches out his hand…\nDerek’s beta. Derek’s packmate.\n\nDerek’s.\n\nDerek releases his hand, fangs and lips tinged with blood. Pain radiates from the wound, but it gentles with each black line that swirls through Derek’s hand and forearm.\n“Don’t. Don’t take it way,” Stiles says, feels relieved when the pain returns. “This is proof.”\nDerek’s eyes fade back to its swirl of green-gold-black and he nods, understanding.\nDerek isn’t a monster, for all people – Stiles included – labels him as such. He doesn’t always choose the right option, makes his fair share of mistakes, and remains stubborn where he should yield. He’s lost and lonely, driven to the extremes, and desperate to secure his own survival. He’s been shunned, tortured, accused, mocked, abused and caged, but…\nDerek sees the world differently. He learned far too young that there is no such thing as black and white, that the world is bathed in shades of gray but, to his very core, still wants to save people the way nobody has ever saved him.\nAnd Derek had stopped and asked, had given Stiles a choice despite how easy it was to sink his fangs into Stiles’ bleeding hand. (He has always given Stiles an out, even back when Stiles didn’t recognize it as such.)\nHe asked.\nAnd to Stiles, that makes all the difference.\nThat is why Stiles knows he made the right choice.\n \n \n \nIt doesn’t go over well with Scott, but Stiles doesn’t expect anything less.\nScott sees the scar on Stiles’ hand the day after as they face one another in the hall – Derek’s bite healed minutes after the bond solidified.\nStiles knows better than to think this is an accidental meeting. As much as Scott denies his wolf, he still would have felt the pack bond between the two of them dissolve.\n“It’s so easy for you to throw it all away,” he says, clipped and accusing.\nIt is tempting to be angry, to point out that Scott made the first move when he chose to walk away, started keeping secrets, and chose to set himself apart from the people he thinks are killers.\nStiles doesn’t feel angry though. Mostly, he feels sad and heavy.\nPeople say that you find out a lot about a person in the way they handle difficult situations. That has never been more apparent here.\nIn a normal world, before, Scott and Stiles were two peas in a pod.\nIn this world, now, they are as different as night and day.\nBecause Stiles grew up far too fast, lost his mother, and got to know Death like an old friend in the way Scott didn’t, doesn’t. Stiles will just as easily choose Death as an option when Scott will only ever choose Life.\nThey would have made a good pair, but…\n“I didn’t throw it all away. I’m still your best friend, Scott, but I can’t be around you when you keep blaming me for what happened,” he says, soft and so very tired. “Sometimes I wish things would have gone differently, but you cannot hold that over my head.”\n“…what’s more is that I won’t let you.”\nHe doesn’t say sorry, because it doesn’t seem like something to be sorry for, not when Stiles knows that he and Scott were just a victim of circumstance that fateful night.\n“We don’t need to fight, Scott,” Stiles says, pleads. “But you have to understand that there are times we can’t afford to follow the kind of philosophy you want us to have.”\nScott doesn’t even reply, doesn’t even try to fight for this friendship.\nHe just walks away.\nStiles is wrong. The necromancer isn’t the last straw.\nIt’s this.\nAnd Stiles turns around and walks down another path.\n \n \n \nStiles is seated on Derek’s couch when the Alpha comes home that night. Scrolls, documents, and ancient tomes are scattered before him on the coffee table, but Stiles is focused in his work, doesn’t even look up when the doors slide open.\nIt is nearing midnight. Stiles can’t sleep, doesn’t want to sleep, finds himself seeking his Alpha.\nThere’s the rustle of plastic and the sound of a soda can popping open. Stiles hears Derek approach and the next thing he knows, there’s a burger and a soda placed in front of him. Derek sits down beside him with his own meal.\nStiles doesn’t stop working, takes a bite of his burger for every five paragraphs he reads or every page he writes.\nDerek clears his throat. “You made your choice.”\nStiles scoffs and holds his right hand up towards Derek without even looking at him. “Derek, I made my choice even before this happened. This is not about me having second thoughts. This is about me…” He sighs, lets his pencil slip through his fingers.\nStiles thinks he’ll always feel a bit guilty with the hand he played that changed Scott’s life forever, but Stiles knew better than to let himself be controlled by it. He doesn’t want to stay in a toxic friendship, forced to always feel that he’s wrong, that he’s to blame, that he’s the bad guy for not always choosing what’s categorically right and good.\nBut…\n“I hoped Scott would change his mind, but he didn’t. Then I realized… it’s hard to… it’s hard to…” Frustration wells up inside him and Stiles is scared he’ll end up crying. “Scott is a good person, Derek. He’s not the best Alpha, but he’s a good person.” He doesn’t know if he’s arguing with Derek or himself.\n“… but it’s hard to change the mind of someone who doesn’t want to understand in the first place,” Derek finishes.\nIt hurts. The words hurt. Stiles feels as if he’s punched in the gut and feels the flare of protectiveness he has always felt when someone says or thinks something bad about his best friend.\nBut Derek doesn’t mean it to be cruel or to judge.\nDerek’s face and voice are earnest and brutally honest. “You’ve always chosen what you think is best, Stiles. It might not be what people think is good or moral, but that’s because you know we can’t always afford to be good when there’s a hell of a lot more bad things out there.”\nIt’s high praise coming from Derek and it soothes Stiles a little to know that someone understands. Probably because Derek has made the same hard decisions again and again and again.\nStiles remembers a quote he once read: 'The closer one gets to the light, the greater the shadow he casts.'\nNobody wants to think of themselves as bad people and walk the 'dark' path, but Stiles and Derek don’t really care about that. They know they can’t afford to, so they’ll willingly walk the fine, gray line between Life and Death when others don’t want to, so that others won’t have to.\nStiles has never thought of himself as a good guy anyway.\nHe feels immensely tired all of a sudden and he sags, head landing on Derek’s shoulder.\nDerek doesn’t say a word. He just wraps his arms around Stiles and pulls him closer, lets Stiles soak up his warmth and be comforted by his strong, sturdy frame.\nDerek smells like the woods and himself and he rubs Stiles’ back up and down. It’s soothing and Stiles doesn’t feel like the back of his eyes are burning from unshed tears.\n \n \n \nStiles’ Dad never asked Stiles why he chose Derek as his Alpha and Stiles knows he never will. He had only asked something like it once, when John asked about what happened between him and Scott.\n“We had a difference of opinion,” Stiles says.\n“And you and Derek don’t?” John asks.\nStiles snorts, unable to help it. “We do. Derek and I have divided opinions on a lot of things. It’s just that…” He pauses, not quite sure how to put it.\n“Derek understands.”\n“And I’m sorry, Dad,” Stiles suddenly says, as he’s struck with a sudden thought. “You… you and Melissa… I… being in different packs…”\nThe only thing he thinks he truly regrets is how he takes away a future that his father could have had. He knew what was building between his Dad and Melissa, had actively encouraged it actually, but now, torn between two packs…\n“Just another thing I messed up,” he mutters.\n“Son, you didn’t mess that up, not when it isn’t your decision to make in the first place.” John shakes his head, expression soft.\n“You know, people always say that there is no choice when it comes to family, Stiles. You have to love your child, you have to love your parents, you have to pick them over everybody else,” he says. “But I realized… you do choose your family.\"\n“You choose to stick with them even when the going gets tough, or you choose to abandon them. You choose to hate them or you choose to love them. You choose Derek and the pack and form a family of your own, or…” John gulps audibly and his eyes look liquid, “… or you stick with an old man who, after your Mom died, forced you to grow up because he chose a beer bottle and his deputies for company instead of his own son–”\nStiles jolts, eyes wide. “Dad… I…”\n“And, only eight years old, you chose to forgive your old man instead of hate him,” John continues. “You always chose family, son. You always choose me, every single day, even if I don’t deserve it. And now you found a family of your own where I’m lacking.”\nStiles grabs his hand and squeezes it as tight as his throat feels. “I would never pick the pack, pick anybody, over you, Dad. I…”\n“I know, and I won’t take them away from you, son.” John holds Stiles’ hands and squeezes them back, just as tight. “So this isn’t about me. This isn’t about you taking something away from me. Because I choose you. I’ll follow you, and not because you’re my son, but because you’re my son and I love you and I trust in the choices you make. You have a pack now, and nothing will please this old man more if you think I’m good enough to be a part of that.”\nStiles doesn’t pretend that he didn’t bawl like a baby over that or that his Dad didn’t break down as well.\nAnd now Stiles leans against the doorway, watches his Dad and Derek talk about some case files and debate which ones are likely related to the supernatural and which ones aren’t. Boyd is in the kitchen fixing up the lasagna because he’s actually a great cook, while Erica and Isaac, both too lazy to help, are in the living room debating over what channel to watch.\nDerek catches his eye and for the first time in a long while, Stiles doesn’t find it hard to smile.\n \n \n \nLydia approaches him two months after Stiles accepted the pack bite. She, Danny, and Jackson have been standing in the sidelines during most of the mess, and she serves as the Alpha of sorts in their little three-person pack. Derek hasn’t tried to sway them to his side, but Allison has in Scott’s stead. Stiles has seen her talking to Lydia a few times, though neither of them look happy when they part ways.\nStiles is unlocking his jeep when he feels a presence behind him. He turns around.\n“Why?” Lydia asks.\nIt’s a boatload of questions packed into a single word.\nLydia looks like she hasn’t slept in weeks, months even, and she doesn’t look half as composed as she usually is. Stiles feels for her.\nDerek explained it to Stiles once, why he thought it was unwise to force Lydia into obedience.\nIt’s because deep down Lydia doesn’t want to get involved. It isn’t even about Peter really, though it may play a part. Rather it’s because Lydia carries a deep fear of being stuck here, here where nightmares are real and where she feels less in control than anywhere else in her entire life.\nDerek sympathizes. It’s not like he himself has fond memories of this place, not anymore. It’s not like he has ever had control of his own life ever since the fire.\nSo right now, Stiles answers Lydia honestly.\n“I chose this life knowing things aren’t exactly safe or sane or good, that I can get killed at any moment, that there will be times I’d have to make the tough calls and wouldn’t be able to look at myself in the mirror after. Seriously, Lyds, there are only a few really good things about this life.”\n“But being a part of this makes me feel alive. A part of me still feels as if, no matter how much I hate it sometimes, this place and these people are worth it.” He chuckles. “I found a cause to fight for, and that’s not something I can get from a degree or from moving to the other side of the country.”\nStiles rubs his chin. “…Not that Derek is limiting the pack. He’s pushing a lot of us to go spread our wings after graduation, but we’ll see.”\n“Derek.” Lydia’s eyes narrow.\nStiles reads her next question in the glint in her eye.\n“Why him?” she asks.\n“I chose to be Derek’s because I have faith in him,” Stiles says, easy and simple as if he is merely talking about the weather, as if his words were something just as natural. “I have just as much faith in Scott. Don’t get me wrong. But you know what the difference is between them?”\nLydia doesn’t speak and Stiles plows on, voice lowering into a whisper.\n“I can choose to kill someone, because I think it’s what’s right. I can fight dirty. I can dive off the deep end. I can stick a knife in Derek’s chest. I can walk away from this any time I want. But at the end of the day, I know Derek will still have faith in me.”\n“This is insane,” Lydia hisses. She looks conflicted and Stiles wonders if that is not the answer she wants or expects.\n“I’m not going to ask you to be a part of this, but please respect my choice.” Stiles turns his back on her, but looks over his shoulder one last time. “I picked an Alpha and a pack that would pick me right back. I hope you find people who will do the same for you.”\n \n \n \nA day later, Jackson shows up at the loft and requests the pack bite. Derek isn’t swayed no matter how many times he asks.\nThree days later, Danny shows up to ‘hang out.’ He doesn’t say a word about a turning bite or a pack bite and Derek lets him make camp.\nA week later, when it’s almost midnight, Lydia knocks on the door. She’s in a tight dress and her makeup is flawless. She looks made up and battle ready.\nWhen morning comes, Stiles feels three more pack bonds snap into place.\n \n \n \nDerek kisses Stiles not long after that, when the pack gathers to celebrate Stiles’ eighteenth birthday and Cora finally comes home.\nIt dawned on a Sunday and the pack, his Dad included, have been in his house since morning, scattered around the living room with the remains of all the spaghetti and meatballs, burgers, pizza, potato salad, and ice cream and cupcakes they’ve been eating the whole day. Lydia had brought all of it for Stiles using Derek’s credit card. Stiles would be embarrassed, but Lydia wasn’t and he is not about to belittle Derek’s need to provide for his pack, or his pack's near-insatiable appetite.\nCora is among them, having gone back to Beacon Hills because she’s bored of traveling. Stiles thinks it’s because she misses Derek and the pack, despite all the mess that has happened.\nThey all welcomed her easily. It’s as if she never left.\nThe gifts come after dinner and Stiles sits on the couch beside Derek as boxes are piled on his lap. He opens each one to the pack’s raucous cheers and Stiles feels thankful for their generosity: a gift certificate for some new sneakers and pants from his Dad; graphic tees and a hoodie from Isaac, Erica, and Boyd; a leather messenger bag from Lydia; a watch from Jackson, which he probably just swiped from his own collection; CDs from Danny; and even Cora hands him a gift, a protection necklace she found on her travel.\nDerek ends up last and he gives Stiles a small book wrapped in soft, green paper.\n“It’s a journal,” he says.\n“It’s magic,” Stiles adds, feels the tips of his fingers tingle as he strokes the black, leather cover. His Spark, young and small as it was, writhes in glee at the magic – his Spark is something Deaton only alluded to once, but he’s been training it with the pack’s help, Derek's contacts, and Lydia’s experiments.\n“What kind of magic?” he asks his Alpha.\n“It will never run out of pages, among other things.” Derek smiles, pleased that Stiles likes his gift. “You’re the only one who’ll be able to write on it and you can choose who can read it.”\n“Woah, sounds cool!” Isaac exclaims.\n“Where did you get it?” Cora asked.\n“A friend,” Derek says. They share a look. Cora nods, like she knows who he’s talking about.\nErica makes grabby hands at him. “Let’s try it out!”\nJohn hands them some pens from the side table, curious over the magic book. Everyone takes turns trying to make a mark on the pages and look flabbergasted when none of them make a mark nor a dent. When it’s Stiles’ turn, they all oohed and aahed when they see his spindly handwriting appear across the page.\nStiles lets them play around with it and retreats to the kitchen, bringing along some plates and mugs.\nSuddenly, it hits him; that this is the first time in a long time he celebrated a birthday without Scott.\nStiles scrambles for his phone. He left it on the counter earlier when the pack started coming in. He feels a firm hand on his shoulder and it doesn’t surprise him that it’s Derek.\nThere’s no text and Stiles almost cries.\nSuddenly, it rings in his palm and the hand on his shoulder squeezes.\n\nhappy bday. have a good one.\n\nIt’s not much, but it’s… it’s something.\n“Like a damn mind reader,” Stiles mutters. He shrugs off Derek’s hand and starts putting everything into the sink.\n“I have another present for you,” Derek says, breaking the suddenly solemn mood. Stiles’ head whips up in excitement – and no small amount of relief at the distraction.\nDerek smiles. “My present to you is saying: you’re right.”\n“I know I am! Er…” Stiles purses his lips. “About what?”\nDerek pulls out the keys to the Camaro. “Let’s go for a drive.”\nJohn and the pack stay behind, claims that Derek’s already shown them the present. It confuses Stiles even more, but he willingly follows his Alpha out the door.\n“You’ll love it, Stilinski,” Cora says, smirking.\nThe wind is cool on Stiles’ face as he looks out the window. Derek’s obviously taking the long way around and Stiles laughs and points out places he and the pack like to hang out. Derek is mostly silent on the drive, but it isn’t awkward and Stiles finds himself and his Spark lulled into dozing by their Alpha’s presence.\nSoon enough, the Camaro stops and Stiles jolts into alertness. He looks at Derek, notes his encouraging smile, and then looks out, sees the car light up something across the way.\nThey’re at the old Hale House.\nCorrection: They are where the old Hale House used to be.\nStiles’ breath hitches in his throat. Derek turns off the engine and gets out of the car. Stiles stumbles to follow. They lean against the hood of the Camaro looking up.\nBecause in place of the old house was a new one; a pack house. Granted that it’s less than halfway done and is still under construction.\n“Like I said,” Derek grins, “You’re right.”\nStiles is only half-right. He has been not-so-subtly hinting that Derek should find a new place for his pack. He wasn’t thinking about a new house, not one on Hale land at least, and Derek delivered more than that.\nTearing down the old house for this new one isn’t just something Derek would do because Stiles pestered him into it. In fact, Derek wouldn’t have done it even if Stiles actually pushed him to do it - not that Stiles would.\nThis means something.\n“Happy birthday,” Derek says cheekily and despite the sadness and melancholy hanging over their heads, his smile is real.\n“How did you even keep this a secret from me?” Stiles bumps their shoulders together. “How did I not even notice?”\nDerek chuckles and Stiles thinks it’s a nice sound.\n“Your Dad, Cora, Lydia and Danny are the only ones who knew.” At Stiles’ affronted look, Derek chuckles. “When I got the idea, I needed help. I brought Cora here before it was torn down and then I brought everyone else yesterday so they could see it. Now it’s your turn. I wanted the skeleton ready in time for your birthday, just thought it’d make a nice surprise.”\nDerek’s eyes are beautiful in the moonlight and it makes Stiles’ chest hurt in a good way.\n“Why did you bring me here, Derek?” he asks. “Why am I last to see this?”\n“Because…” Derek looks bashful, but he is honest. “Because having you see it, it makes it more real.” He turns to the new house, a sign of good things to come if Stiles has ever seen one. “Because it means something when you know.”\nThat Derek’s moving on, little by little.\nThat Derek doesn’t think his future’s bleak.\nThat Derek feels hopeful.\nWarmth blooms in Stiles’ core and when Derek leans forward, he nods and lets Derek kiss him sweet and slow. Stiles twines their fingers and gets lost in the kiss.\nIt’s probably the best birthday he’s ever had.\n \n \n \nFor all the drama they’re facing, that didn’t mean the action stopped all over Beacon Hills.\nThis time it’s a clan of pixies, vicious little things that can fit in the palm of Stiles’ hand, but had razor-sharp teeth that can chew through skin and muscles in seconds. Stiles and Lydia had done their research and Cora, who experienced the same thing in her travels, recounts her own experience.\nPixies are pests, are quick to multiply, and are considered savage. They have no set of laws, recognize no authority apart from a Pixie Queen, take offense over the slightest things, and have a tendency to attack anything that encroaches on their territory. Now they’re staking a claim in the forest and the pack wants them out.\nDerek wanted to eliminate them. Stiles agreed.\nThe pack got the job done in an hour, quick enough that Scott and his pack arrive only to see the last of them escape in a screaming, wounded mess. He’s backed by Allison and – Stiles can’t say he’s surprised really – Kira and Liam. \n“Everything’s been taken care of,” Derek says.\n“I see.” Scott tries, but Stiles still sees the face he tries not to make and the way his jaw stiffens as he looks at the carnage. “You let some of them go?”\n“None of them will last long anyway,” Jackson says, studying his nails and making a face.\nAllison’s eyes narrow. “What do you mean?”\n“Pixies have something of a hive mind,” Lydia says. She doesn’t flinch under Allison’s assessing gaze. “Without their Queen, they’re pretty much brain dead. They’ll either die or get picked apart by animals.”\nKira, obviously so new to this, makes a noise, wide-eyed in shock and fascination. Liam doesn’t seem impressed. He just seems angry.\nIt clicks in Stiles’ head. He turns to Derek, panicked, and Derek frowns back. He notices it as well.\nIt makes Stiles see red. He steps forward and all the werewolves twitch in his direction, obviously feeling and smelling his rage.\n“You bit him?” he hissed, glaring at Scott. “YOU BIT HIM!?”\nScott has the grace to look ashamed for a moment, but he remains unrepentant by the way he tilts his head.\nCora sees it too and scoffs loudly as she wipes her bloody claws on the grass. “Wow. Nice going McCall.”\nScott growls at her, but it has no effect as he’s not her Alpha. Cora growls back and stops only when Derek steps between them.\nThe beta in question, Liam, flashes his eyes at them and snarls. He only ceases when Scott places a hand on the back of his neck.\n“If I didn’t, he would have died.” He says nothing else to explain and it makes Stiles even angrier.\nStiles is shaking and he wants nothing more than to rage, to shout, and everyone knows it. Before he can, Derek steps in.\n“You need to train him, Scott,” is all Derek says and Stiles knows his Alpha remains diplomatic only because Stiles is already freaking out enough for the both of them.\n“Don’t you think I know that?” Scott hisses.\nDerek doesn’t flinch. “Train him better than I did you, and if you need help–”\nScott turns away. “I have my own pack. Worry about your own.”\nStiles can’t help speaking up. He rounds on Allison. “You let him?” He thought she would have had more sense.\n“He has a good reason to,” Allison says. Stiles is sure her heart remains steady with no lies only because she’s a hunter, yet Stiles knows that deep down not even she believes it.\nThey walk away, dragging an angry, out-of-control Liam with them. Only Kira looks back, looking worried and unsure.\nStiles knows they’re out of earshot once the others start speaking up.\nDanny is as frank as ever. “Does McCall even understand what he’s getting into? I mean, he’s not a bad guy, but he’s never struck me as the brightest bulb out there.”\n“Derek wasn’t the nicest Alpha in the beginning, but even he told us that you could die if the bite doesn’t take,” Isaac says. Derek winces at the reminder of his awful, early days, but Isaac smiles, obviously meaning that the present is different.\n“That new one doesn’t seem to be in control and he probably doesn't have a stable anchor yet,” Boyd says, and he actually has room to talk. He’s got the best control out of them all, even more than Cora, though not as well as Derek.\n“How can Scott even train a new beta if he didn’t even finish training with you?” Lydia says. She flicks a hand at Derek. “I mean, your old training methods leave a lot to be desired – but they’re better now because you have me, so you’re welcome – so how’s that one even going to take care of the baby?”\n“He probably just bit the kid, kidnapped him, and forced him into his pack,” Cora says, making Erica snort in derision. “It’s not our problem. That Argent girl is there to shoot them down anyway.”\nStiles, and most of them really, flinches at the implication. Derek glares his sister into silence and she sighs and shuts up.\n“Scott has enough control and he’s not stupid,” Derek says and Stiles knows he honestly believes that. “And we won’t turn him away if he needs help.”\nHe says that last part to Stiles. It is reassuring, just a little, but Stiles knows the question is whether or not Scott will even ask.\n“Don’t you think it’s ironic though?” Erica pipes up. “Scott hates being a werewolf. He certainly never liked any of us.” She motions to the first beta trio. “Thinks of it a curse or a monster or whatever. Now he’s biting people to build a pack.”\n“He probably has his reasons,” Derek says, tries to be soothing. “Not all bites are transformative. We all know that. Scott is… I don’t think he’s foolish enough that he won’t know when to offer the bite and when not to.”\nStiles laughs, a small, pained, disbelieving thing. He looks to Derek.\n“Does he? Does he really?”\nIf Stiles is so unsure about Scott…\nNone of them, not even Derek, has an answer to that.\n \n \n \n“You are my emissary.”\nDerek says it on a rather overcast Tuesday afternoon. The pack had been working on the house since early morning, but now they’re all on break and are scattered across the back porch.\nLydia, who was doing Erica’s nails, scoffs. “And you only figured that out now?”\nFrom his sprawl across the wooden floor, Stiles tilts his head up and looks at Derek upside-down as the Alpha leans against one of the posts.\n“I’m just amazed he came by that realization himself,” Stiles teases, grinning. Cora laughs loudly at that.\n“Derry can’t help it if it’s a bit slow,” Erica says and giggles in the face of Derek’s growl.\n“It was obvious,” Danny shrugs. Isaac nods excitedly, while Jackson scoffs and pretends to look bored and uncaring.\n“It makes sense,” Boyd adds.\nDerek looks miffed, but more than that he looks mystified. He sits down by Stiles’ head, until the Alpha and Emissary are looking at one another upside-down.\n“You are my emissary,” Derek says again, softly and privately.\nIt is both a declaration and a confession. It is acknowledging Stiles’ position in the pack and, at the same time, it’s also admitting Derek’s dependence on, need for, him. It is the reality not just of Stiles’ ability to protect them and help them flourish, but also a sign of a possible future that the two of them can build together.\nBecause Stiles isn’t stupid. Derek was never meant to be the Alpha and when he did he has never run his pack – doesn’t know how to run his pack actually, Stiles thinks – the way an Alpha should, the way his mother did. Derek learned to make sense of his Alpha-hood by his mistakes, learned how to make his own rules because he has no one to tell him how.\nSo Derek will never choose an emissary bound by rules and laws, not one like Deaton who remains cryptic and secretive, preaches balance when the world has proven itself to tilt far to the left, or chooses logic when there is so many on this earth that is unforgiving and cruel.\nDerek will choose an emissary who knows the laws best, but knows even better how to break it, wants to break it, someone who will not keep secrets for the sake of keeping them, someone who is unbalanced and recognizes the world as the same.\nSomeone Derek knows will never lead him astray, someone he trusts and loves beyond all else.\nSo of course Derek won’t make the sensible choice.\nHe’ll choose the Sheriff’s law-breaking son. How ironic.\nStiles grins. “I am your emissary,” he agrees, easy as breathing.\nDerek’s eyes flare Alpha-red and Stiles feels the pack bond and his Spark snap taut as he accepts his fate. Around them, the pack shudders and lets out little yips and giggles of joy.\nStiles can’t help it. He bares his teeth and feels his eyes flash – light violet, a color he will later learn the significance of.\nStiles Stilinski; Hale Pack emissary and the Alpha’s… well, that might be a bit too early to decide on.\nBut right now, at this moment, Stiles’ entire future seems bright and exciting.\n \n \n \nScott is already at the lacrosse field when Stiles arrives, twirling his crosse and tossing a ball around. Stiles wordlessly hefts his own crosse and joins him.\nThey toss the ball back and forth for a while, throwing it harder and farther every few minutes, until an hour and a half passes and they’re lying on the grass upside down from one another, trying to catch their breaths. The sun is setting and it’s getting dark. The grass is cool against their skin and the air even cooler.\nStiles remembers a time, more than a decade ago on this date, when two four-year-olds became good friends after playing together in the sandbox.\nIt seems far too long ago.\nScott breaks the silence as Stiles’ usual talkativeness doesn’t seem to be on board today.\n“Violet. Deaton told me about that.”\nAs if Deaton ever really tells people anything, but Stiles stops himself from making that remark.\n“Violet eyes, an alpha mate.”\nStiles senses Scott tilt his head to the side and stare at him, but he doesn’t look back.\n“Deaton says it’s permanent.”\nStiles just shrugs. Permanent for the wolf, maybe, but not the human, though to Stiles, it’s as good as permanent too. He keeps his mouth shut. Stiles isn’t really willing to share that information anyway.\n“Mate or not, I won’t ever take the bite,” Stiles says. “I don’t plan to, and even if I’m about to die, Derek knows it’s still a 50-50 thing.”\nScott makes a face at the thought of Stiles dying, and he says, “I know. I know you never wanted this.”\n“You’re wrong, Scottie. I never planned for this to happen and maybe I kept complaining at first, but…” He turns his head and looks Scott in the eye. “I’ve never ran away from this. As hard as it is, this kind of life…” He trails off.\nIt’s not that Stiles wants this, but at the same time, this life… it just seems more.\nScott seems to get it. He looks back up at the sky. “Well, I don’t. It was hard enough before without all this, but it was better.”\nOthers will think the notion is laughable, but Stiles gets it. Despite the lack of strength and speed and healing, being part of the supernatural world makes you realize just how precious it really is to be human.\n“Bad enough I had to suddenly be a werewolf, but now we end up in different packs,” Scott continues. Stiles hears the anger in his voice and right now, he’s not quite sure to whom it was directed, at Stiles? At himself? At the world?\nStiles is tired of wondering.\n“You will always be my brother, Scott, and one of my best friends, even if…” He trails off. “But I guess we’ll never be pack. I’m sorry it had to turn out this way.”\nScott gives him a look and for one moment Stiles remembers how it was: asthmatic, knuckleheaded Scott and the fidgety, weirdo Stiles.\n“Me too. Sorry,” Scott says. He sits up and grabs his crosse.\nStiles doesn’t watch as he walks away.\nStiles stays there until the sky is dark and stars start dotting the night sky. He lifts a hand up, looks at the sky through the spaces between his fingers, isn’t surprised when he finds thicker, darker fingers slot between his.\nDerek’s concerned face appears above him and Stiles smiles, knows it wobbles uncertainly on his face.\n“Come on. You’ll get a cold,” his Alpha, his mate, says.\nStiles nods, lets Derek drag him up, bundle him warmly into the Camaro and then take him home.\n \n \n \nBut Stiles doesn’t come home to the pack house. He can’t. He knows he won’t find solace there.\nWhen he says this, Derek nods and wordlessly drops him off at the Stilinski house. Stiles sees Derek off with a hug, a kiss, and a promise to call, and then crawls into his Dad’s bed at three in the morning, cold and still smelling of the woods. He hasn’t done this in more than a decade.\nNonetheless, his Dad opens one eye blearily and grumbles only a little before he scoots over and lets his son lie down beside him. He opens his arms easily and lets his son curl up against his side, never mind that he is older now and too tall with too long, too jittery limbs.\nIt’s a kind of comfort only his Dad can give. His Dad who knows Stiles better than anyone else, who knows how lonely Stiles felt being the weird kid with the ADHD, who knows how happy Stiles was when he finally found Scott, who understands the way Stiles’ heart is breaking right now.\nJohn shushes his son and gently rubs his back. “It’s okay, son. Let it out.”\nStiles cries, pained and inconsolable, and his Dad doesn’t once let go of him.\nHe wakes up a few hours later hearing his Dad call in a family emergency and informs the station he isn’t coming in today.\n“You don’t have to,” Stiles croaks.\nJohn rubs his son’s head and continues the call and Stiles is left to curl against his side, feeling awful but also relieved. After the call, John just sits beside him, rubbing his head comfortingly until Stiles finds himself drifting away.\nHe wakes up a second time to his Dad still in bed with him and reading the newspaper. By the way one hand moves to rub his head some more, it’s obvious he knows Stiles’ awake.\nIt’s silent, apart from the rustle of the paper and the sound of people outside going about their day.\nStiles’ voice is a whisper. “It isn’t fair.”\nJohn puts down the newspaper, looks down at him and Stiles wants to cry from the look in his eyes.\n“Life is never fair, son.”\nTears escape and Stiles sniffs, looks up at his Dad through watery eyes. “I lost him, Dad.”\nJohn looks pained and he obviously doesn’t know what to say to that. To agree with him would just hurt more, and to deny it would be a lie.\n“Son, the people who are meant to be in our life will always come back, no matter how far they wander.”\n“But I don’t think he’ll come back,” Stiles whispers.\n“Then you will have lost a friend, but you will move on,” John says firmly. “People and relationships don’t last forever, son. You will cry and you will miss him, but you will move on one day.”\nIt doesn’t comfort Stiles, not really, but it’s a painful reality he would have accepted only from his Dad and no one else.\nIt still makes him angry.\nStiles sits up, fury burning through his veins. This is the first time he’s been truly angry over this.\n“I’m his best friend, Dad! I’ve always had his back! And the one time I needed him, he didn’t believe me! All I’ve ever wanted was to protect the town! Why can’t he see that? Why do I have to suddenly be the bad guy just because I don’t want more people to die? Does he think I enjoy this? That when I dragged him into the woods, I wanted all of this to happen? But we’re in this already and I’m in this for the long haul and I’m just… doing… my… best…”\nStiles doesn’t cry. He’s a bit dried up at the moment, but his chest feels tight and he would have spiraled into a panic attack if his Dad didn’t reach out, hold his hands tightly, and started breathing loudly.\n“I hate this. I hate him.”\nIt's a blatant lie.\nJohn doesn’t say a word, only speaks after a few moments of breathing and helping his son calm down.\n“I can’t speak for him, but I’m sure Scott just wants to protect this town too. It’s just that sometimes we make choices that take us different places, and the people we want to bring with us don’t always choose that same path, Stiles,\" he says. \"There is nothing more awful in this world than doubt, and I’m sorry it had to happen to your friendship, but none of these makes either of you bad people, son, just different people.”\nStiles remembers that conversation in the field. His Dad is right.\n“I… I never wanted this to happen,” Stiles says, and he feels his heart break all over again.\n“I know,” John says, and his face crumples a little. He hugs his son tightly. “I know.”\n \n \n \nSo Stiles does the one thing he can.\nThe research takes him a little over half a year, even with Lydia and Danny to help him. He keeps it from the others for now, most of all from Derek. It’s not hard. Being their Emissary, he has the right to ask for privacy.\n…and besides, none of them question him, most of all Derek.\nHe finishes it just two months before graduation. Just in time. Stiles wonders if the universe didn’t somehow plan this.\nThe bed is warm and Derek is sleepy when Stiles lies down beside him. Derek opens his arms, easy and trusting, and Stiles slides between them, comforted and loved.\n“The full moon is next week,” Stiles says, fingers stroking the broad chest before him and tangling in the chest hair. “It’s ready.”\nDerek isn’t even jolted awake, just nods and sighs and presses a kiss to Stiles’ lips.\n“Okay. Just tell me what to do.”\nStiles nods and snuggles in to sleep.\nYears back, he dragged Scott into the woods and changed their lives forever.\nScott wants to walk away, Stiles knows that.\nSo Stiles will let him.\n \n \n \nThe full moon hung fat and bright over their heads and the forest is eerily silent… or it would be if it doesn’t sound like a herd of elephants are trampling across the forest floor. Behind Stiles, the pack is snickering and unimpressed. He has half a mind to berate them, especially the humongous, black wolf beside him that is doing nothing more than sit there and look bored.\nBut Stiles knows part of Derek is enjoying this. Derek trains his betas with an iron fist and a kind heart and they all learned, even Stiles, how to move as one with the forest that is their home. Scott has done the same for his pack, but not as effectively. Scott has never learned to recognize the forest and claim this territory as his.\nHe doesn’t have to. It’s not his to claim anyway.\nStiles strokes one of Derek’s wolf ears, smiles when it twitches between his fingers. Derek leans up and licks his hand, but Stiles shakes his head.\n“Not yet. We have to wait, babe.”\nDerek growls, but it sounds more like a sigh.\nDerek has another reason to celebrate, but that comes later. He knows there is a secret Stiles and the pack are keeping from him, a secret that is important tonight of all nights, but it doesn’t make him uneasy, just impatient. Derek is always impatient anyway.\nThe McCall pack emerges from the shadows, Scott at the helm with his betas at his back and, most unsurprising, is Deaton by Scott’s right. Scott is in his beta form – he’ll never achieve a full wolf like Derek – and his eyes are furiously Alpha-red. Allison has her crossbow at the ready. The others are all in battle-ready forms, some of them Stiles recognizes and most he doesn’t.\nDeaton remains quiet and blank-faced, but Stiles can sense him. He is armed with virtually every talisman, charm, and spell possible. Stiles almost smirks because he doesn’t need any one of those. All he needs is his pack, the gleam of the Mother Moon, and his mate, and he is unstoppable.\n“What are you doing?” Scott snarls, crouching low and looking ready to attack.\n“We’re having a moonlight run, McCall,” Erica answers, scoffing. “You’re the one intruding on our territory.”\nScott growls at her, but it’s Allison who speaks, aiming her crossbow at them. “We’re not intruding on anything, not when we know you’re planning to ruin everything.”\n“Well, that’s rude,” Isaac says, rolling his eyes.\n“Not to mention judgmental and completely jumping to conclusions,” Cora adds, looking bored from where she sits on the forest floor beside Derek, leaning back on her hands.\n“We know what you’re planning,” Scott says. His gaze moves to Stiles. “And we’re here to stop you.”\nDerek growls and makes to move, but Stiles stands between his pack and Scott’s. He’s dressed in his – Derek’s, really – favorite red hoodie and black jeans and he feels a buzz beneath his skin unlike anything he’s felt before.\n“Stop us?” Stiles echoes. He looks at his counterpart. “Do you even know what you're stopping? Do you even have the right to?”\nScott looks offended and snarls a call to arms. His betas fan out and crouch, coiled tight like springs. Allison hefts her crossbow at their direction.\nIt’s obvious Deaton hasn’t told Scott the extent of what tonight means. It makes Stiles angry, frustrated that Scott willingly subjects himself to the whims of an old man who hoards knowledge simply because he thinks it’s what makes him above them all, who uses knowledge and secrecy as a way to force them all on the path of what he thinks is right and just and logical.\nThis is not about war, despite what Deaton has obviously implied to Scott.\nStiles keeps quiet though. He has long since learned that his opinions are never welcome.\nDerek licks his hand and it breaks Stiles from his reverie. Stiles smiles and leans down – just a little, because Derek is huge – to kiss the wolf on the nose. He turns to the pack across the way, lets his eyes flash deep violet and tries to control his thoughts.\nThere is a whizz in the air, caught by Stiles’ Spark-enhanced senses and not his human ones. It happens almost as if in slow motion: He sees Allison’s arrow fly through the air, hears Derek and his wolves snarl angrily, holds Boyd back from when he tries to jump to Stiles’ defense, and watches Allison’s arrow break the moment it hits Stiles’ barrier.\nThe other pack looks surprised, Allison most of all, while Scott looks furious and Deaton, despite how he tries to hide it, also looks wide-eyed.\n“Wolfsbane arrow,” Boyd mutters, eyeing the arrow sniffing the air, and the pack snarls.\nStiles tries to keep himself calm, but can’t. He had seen the trajectory of that arrow, headed straight for Derek’s head.\n“Don’t you dare hurt my wolves, Argent,” he said, voice echoing clear across the clearing. Power burns behind his eyes and he watches Allison’s eyes widen. He can practically smell fear crawling up her spine before Scott stands in front of her.\nScott continues to be with a woman who will most likely kill him in his sleep, and Stiles is so angry he’s tempted to laugh at such stupidity and burn them all where they stand.\nBut he doesn’t, because Derek steps forward, fur brushing against Stiles’ fingers, and Stiles remembers that there are far more important things that require his attention.\nStiles takes a deep breath. “Let’s not waste time.”\n“Don’t do this.” Scott growls. “Don’t be stupid, Stiles.”\nThis time, Stiles laughs. “Us? Stupid? We’re not the ones making stupid moves.” He turns his back on them, despite Derek’s warning growl. “Shall we?”\nWithout warning and without a motion from Stiles, a circle of mountain ash suddenly encircles Derek. Stiles hears the trespassers gasp and growl in surprise, but the pack is used to it. Derek doesn’t even flinch, just looks down at the circle and then at Stiles.\n“Shift for me, babe.”\nThis is the difference, Stiles thinks, as he watches Derek shift easily, effortlessly and trusting. This is why Stiles, despite his many, many regrets, will never regret this choice.\nDerek is beautiful in the moonlight, stands tall and proud and unashamed. Mother Moon shines brightly upon him and his eyes are Alpha-red and intense, but only loving and fond when they settle on Stiles.\nThe entire pack moves to circle Derek; Isaac and Jackson making mocking faces at Derek’s nudity; Danny, Lydia and Erica (not really) pretending to leer, and Cora making gross faces at them.\n“Trust us?” Stiles asks.\nDerek, vulnerable in his magical cage, doesn’t hesitate. “Always.”\nStiles pulls out a dagger, a gleaming gold blade with runes carved on the handle. He steps towards Derek, blade pointed at him. He feels Deaton shift behind him.\n“Trust me?” he asks.\nDerek smiles. “Forever.”\nIn the blink of an eye, there is a long gash across Derek’s chest, deep enough that it bleeds almost immediately.\nDerek doesn’t heal.\n“What the fucking hell is going on?” one of Scott’s wolves mutters – young, going by his voice, with a bit of an accent.\nDerek looks surprised but not betrayed, meets Stiles’ eyes with a singular focus.\nStiles steps back and nods and immediately, the rest of the pack is upon their Alpha. Each one takes a swipe at him, one after the other, until even Derek has to wince at each claw that tears his flesh apart.\nStiles practically hears Scott’s confusion.\n“What are they doing, Deaton?” Scott snarls.\nStiles tilts his had back, jaunty as he pleases. He sees the crack in Deaton’s façade, a mix of outrage and shock, and Stiles laughs when a strong gust of wind blows through the clearing. The forest is slowly waking up upon hearing Derek’s blood call.\n“A blood claim,” Deaton says. “The Hale Pack emissary” – and wow, he won’t even say Stiles’ name – “is invoking his Alpha’s right to claim the land.”\n“What?” Scott gapes.\n“This is old magic, an ancient and unstable magic,” Deaton says.\nStiles laughs, loud and bright. Deaton just doesn’t understand.\n\n“Unstable? Says who?”\nBeacon Hills is Hale territory and Derek, the last living Hale Alpha, has all the right in the world to claim it, something Deaton has kept from Derek and Laura for many, many years.\nStiles used to wonder why, but now he doesn’t. He has his suspicions about Deaton’s heart, and now knows the old man makes his own brand of judgment, that he’s smart enough to figure out the reality of the Hale Fire and has since found Derek unworthy of the Hale land.\nSomehow Stiles understands. Deaton sees Talia whenever he looks at Derek, feels as if her son will never measure up to the greatness she had once been, or worse and feels that he is responsible for her very death.\nNow that Stiles thinks about, he suspects that’s why Deaton allied himself to Scott in the first place, because here is someone he can mold into his vision of what an Alpha should be, must be. Stiles had always had little trust in the man, despite Scott’s ridiculous belief in him, and now he understands that it was warranted.\nHe feels it now, suddenly, a resentment deep in his heart.\nFor the part Deaton played, knowingly and maliciously, in fracturing his and Scott’s relationship.\nFor having a hand, no matter unknowing, in Laura’s death and Derek’s abandonment, because he refused to be the man they needed when it mattered.\nFor having kept the Hale land, Derek’s birthright as the lone Hale, from him.\nHow unforgivable.\nIt is an ugly feeling, but Stiles feels him justified and frankly, he doesn't care. Like he always says, he has never considered himself a good person after all.\nBecause even at the cost of his life, his strength, his sanity, his soul, Derek chose to fight and bleed for this land, has probably done so more times than all his ancestors combined. He chose to go back to a place that is his living hell and he stays, all to help two teenagers who didn’t know better. He chose to save a town wrapped in bleak and painful memories because it is the right thing to do.\nHe chose to give a home, strength, and hope to kids who needed it, when no one had offered him the same.\nHe chose to trust people, unconditionally, unending, despite how many times he’s been betrayed.\nHe chose to love Stiles, with a force that is unbreakable and true, despite the fact that he hasn’t been loved the way he deserved.\nEven now, as his wounds sting and his blood flows, Derek bleeds unhesitatingly for his pack and his Emissary-Mate, when so many times he has bled without consequence and reason.\nDerek could have so easily become a villain in this story, but every single day, every single moment, he chose to be a good man.\nDerek remains steadfast after the onslaught, bleeding and pained as he feels. He flinches with every shift of his shredded body, but surrenders to them, to his pack, with a trust that is burned into his very soul.\nStiles closes his eyes and calls to them, calls to every pure and good force on this old earth. And he hears them, hears the call of the land and Mother Moon.\nBecause it is in their nature to give back to one of their children, especially one that continues to fight for all the things that matter.\nGasps rang throughout the clearing and Stiles opens his eyes to see every cut on Derek's body recede as skin and muscle knit itself together, and he laughs as he feels a knife wound bloom across his own chest. He unzips his hoodie and sees his white shirt drenched with blood. It’s painful, but he doesn’t shy away. The same wounds they inflicted on their Alpha appear on each member of the pack, all of them bleeding and painful and not healing. They all watch it with amazement, but no one questions it or fears it.\nDerek has done far, far more for them than this.\nDerek whines, steps towards the mountain ash barrier looking worried. Stiles dissolves the barrier and lets his mate come forward, smiles reassuringly when Derek’s hand hovers over his wound and his eyes flicker to each bleeding pack member.\nThis is the one thing Scott will never understand, what a gift it is to be part of a real pack, what it really means to be an Alpha, and what it means to embrace it.\nScott will never understand how much Derek has sacrificed for this, for them, for Scott himself.\nFor a few moments, Mother Moon shines brighter than she’s ever done tonight and a strong wind suddenly blows through the clearing, so strong that they all have to brace themselves. A chorus of howls and gasps erupt from each person present as the wind passes through them and Stiles knows they’re feeling the same thing he is, some invisible force strongly tugging at his chest, until something cracks and breaks and gives way.\nIt brings about pain, but also something of immense relief and by the time Mother Moon dulls her shine, they are all shaking their heads to clear their visions or sinking to the ground on shaky knees. Even Derek wobbles where he stands.\nBoth Deaton and Stiles remain standing, and Stiles generously pretends not to see Deaton’s right knee buckle.\n“It has been done,” Stiles says, feels the real bonds snap into place, feels the land recognize its rightful Alpha, feels something in him dissolve into nothing when he looks at Scott, whose face is shocked but whose aura feels lighter than Stiles has ever sensed it.\n“It’s done,” Stiles says again.\nAnd he walks away.\nThat’s it.\nThat’s where it ends.\n \n \n \nExcept it doesn’t, not really. Not for them.\nDerek finds him in the pack library a few hours later, curled up in the window seat in Derek’s largest sweater. Everybody gathered in the living room earlier in a big pack pile after the full moon run and all of them are still asleep, save for Stiles who is still adjusting to the buzz under his skin and Derek who can never sleep without Stiles around.\n“Can’t sleep?” Derek asks, wedging himself between Stiles and the corner. Derek likes that, cradling Stiles between his legs.\n“Nah, I just wanted to watch the rain,” Stiles said.\nHe settles back on Derek’s broad chest and they watch the rain outside the window. It started pouring the moment they returned to the pack house. Derek loves the rain and it won’t surprise Stiles if some force of nature willed this, a cleansing of some sort as much as a gift.\nDerek strokes Stiles’ side under the enormous sweater as his other hand links their fingers together over Stiles’ stomach. It’s relaxing and sweet and calming and it almost calms Stiles buzzing mind.\nAlmost.\nDerek presses his lips to Stiles’ neck. “What you did today… Stiles…”\n“If you thank me, I’ll zap you,” Stiles warns, laughing. It tapers off awkwardly.\nDerek strokes his side and Stiles is warm in his Alpha’s embrace.\n“It’s a side effect.” It is as much a question as it is a statement.\nStiles thinks about Scott, how he held his head higher and his shoulders straighter, the lightness Stiles felt in Scott’s aura and from his wolf.\n“It’s not really a side effect, because it’s part of the ritual,” Stiles says, playing with Derek’s fingers. “Only one Alpha has the right to these lands and the magic knows it, even though things got a bit fucked up and the magic got waylaid along the way.\nHe pauses, takes a shuddering breath. “Scott would have always felt the pull because the magic couldn’t detach itself from him. Best theory is he got it from Peter and, being a Hale, the magic recognized some sort of bond. It’s been muddled though, since the both of you are Alphas and no official claiming has been made. In hindsight, that’s probably what was forcing Scott to fight for your territory, even if deep inside he doesn’t want it.\"\n“Now, the bond has shifted to you, the rightful Alpha, so Scott doesn’t have to fight for it anymore.”\nIt’s probably part of the reason why Scott hates Derek so much, because some kind of instinct Scott never bothered to understand feels uneasy with another Alpha on his territory. It’s also probably part of the reason Scott hates Stiles, because that same instinct has drilled it into his head that Stiles betrayed him for another pack and another Alpha.\nNow that there is no pull leading Scott astray, he can go on.\nIs it selfish for Stiles to wish Scott leaves? This place has enough bad memories for the both of them, but Stiles has made its peace with it. Scott, on the other hand, will only ever resent it.\nStiles knows Deaton understands what really happened, but that he will never tell Scott the truth, the same way Scott will never question it even if he ever bothers to wonder at the way his heart and his wolf has felt lighter than it’s ever been or the way he will now find it easier to walk away from it all.\n“You set him free, Stiles, and I’m sorry he’ll never understand that.”\nDerek’s voice is soft in his ear, understanding and loving.\nUntil the bitter end, Stiles fought for what was best for Scott, despite how things ended up between them. Because Stiles loves Scott, always will.\nIt will take years before Stiles stops looking back, stops wondering where he went wrong, if he could have saved Scott, could have saved himself, could have chosen differently. It will be years before he stops and wonders about that first time, that moment when he should have gone after Scott, but didn’t.\nIt will take even longer for him to stop feeling partly guilty when he realizes that no, thing wouldn’t have gone differently.\nBecause Scott is not a bad person, but he is blind and deaf.\nBecause Stiles is far from blind or deaf, but he has never considered himself a good person, only human.\nBecause Stiles is the type of person who has very few regrets in his life and not one of them is choosing the gray path and letting Scott go, not one of them is choosing Derek when the man endured so much for a young Alpha who doesn’t know how to value all that sacrifice.\nDerek understands and does not begrudge Stiles his grief or his demons, never.\nHe understands, and Stiles loves his mate all the more.\nSo right here, right now, Stiles lets himself fall apart in Derek’s arms. He grieves for a brother he lost, mourns his broken heart and battered spirit, and cries for a future he lost and a new one he gained.\nOutside, the rain falls steady and sure, and the land sings."
}