{
    "id": "476254",
    "url": "https://archiveofourown.org/works/476254?view_full_work=true",
    "author": [
        "Destina"
    ],
    "title": "Stars Above, Stones Below",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Merlin (TV)"
    ],
    "relationships": [
        "Merlin/Arthur Pendragon",
        "Merlin/Arthur Pendragon (Merlin)"
    ],
    "characters": [
        "Merlin (Merlin)",
        "Arthur Pendragon",
        "Gaius (Merlin)",
        "Gwaine (Merlin)",
        "Guinevere (Arthurian)",
        "Percival (Arthurian)",
        "Elyan (Merlin)",
        "Agravaine",
        "Leon (Merlin)",
        "Mithian"
    ],
    "additional_tags": [
        "Happy Ending",
        "Canon-Era",
        "Community: paperlegends",
        "Alternate Universe - Canon Divergence",
        "Magic Revealed"
    ],
    "language": "English",
    "series": "",
    "published": "2012-08-02",
    "completed": null,
    "words": "46,843",
    "chapters": "1/1",
    "comments": "879",
    "kudos": "13,709",
    "bookmarks": "4,406",
    "hits": "323,350",
    "summary": "<p>After the disastrous end of his betrothal to Gwen and the regret of his offer to Princess Mithian, Arthur swears off finding a wife until he's ready to wed. When Merlin offers himself to Arthur as bedmate, Arthur suggests they hand-fast in secret for a single year of mutual pleasure without obligation. As their year together unfolds, and secrets and betrayals unravel around them, Arthur and Merlin learn there is no such thing as uncomplicated pleasure. Everything they thought they knew can change in the span of a single year.</p>",
    "notes": "<p>Written for Paperlegends 2012. Canon-era AU, which begins post-4x11 (The Hunter's Heart) and diverges from canon there. </p>\n<p>Goss was my art-partner on this story, and she created several stunning pieces of artwork for it. All of them are incredibly beautiful. I'm very lucky to have worked with her on this story, and I'm so grateful for her joy and generosity. Her art post is on Dreamwidth, <a href=\"http://goss.dreamwidth.org/373888.html\" rel=\"nofollow\">here</a>. (ETA: Photobucket continues to be ever-changing with its blurry and disappearing photos...I will fix that when I can. Thanks for your patience...and please go see the beautiful art at goss's post in the meantime!) </p>\n<p>Many thanks to my intrepid and eagle-eyed betas, Cori Lannam and nu_breed, who are always insightful about story issues and who see all the things I'm blind to. Thank you also to ella_bane for her cheerleading. And finally, three cheers to the_muppet for all the hard work moderating Paperlegends. It has been a joy to participate!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Thank you for reading! If you prefer to comment on LiveJournal, the masterpost for this story is <a href=\"http://destina.livejournal.com/649166.html\" rel=\"nofollow\">here</a>.</p>\n<p>There is now a sequel to this story: <a href=\"https://archiveofourown.org/works/923952\" rel=\"nofollow\">Para Bellum.</a></p>",
    "text": "\n \nI. \n\"Now, as to prospects for political alliance,\" Agravaine said, spreading his gloved hand across the map in front of Arthur. \"There are a number of excellent possibilities. Queen Selia of Anglia has a daughter of marriageable age, the Princess Rowan. I recall meeting her once. Quite charming.\" \nArthur sighed. \"I recall meeting her once as well. She hummed while she was speaking, and she rarely paused for breath in between giggling and chattering.\" \n\"Yes, well, the Princess Mithian was quite lovely, and although she apparently didn't suit you, there will not be many of her grace and dignity to choose from,\" Agravaine said. The bite to his words was unmistakable, and Arthur struggled not to bristle. He owed it to his uncle to at least hear his words of advice, no matter how strongly he opposed the intent of them. Agravaine tapped Camelot's spot on the map firmly. \"Your duty, sire, is to the kingdom, and to its future, as well you know.\" \n\"Yes, of course, I am the king,\" Arthur snapped, and then regretted it. All around the table, his advisors were pointedly looking at their papers, at each other, or the table itself -- anywhere but at Arthur, who felt more than a little ashamed of his tone. \nIt had been a long few weeks since Mithian's departure. Arthur had stood on the steps and watched her go, and felt very much like a poor excuse for a human being. A king should keep his word, and be able to overcome his personal feelings in service to his duty. Arthur had done neither, and worse yet, he had done it because his heart told him to. Uther was probably rolling in his grave, and the thought of it made Arthur wince. \nThe worst part of it was Mithian had actually been quite charming. She was funny, and kind, and in his secret heart, Arthur suspected he might have eventually grown to love her. But he had not loved her in that moment, and the chance of loving her someday had not been enough. In fact, that was the problem with all such discussions; princesses with kingdoms tied about their necks like florid bows could not bring with them the required feelings, presented on a platter like a roast pig complete with trimmings. \nArthur had long ago taken a stand on the issue of marriage without love. It was one of the few things of which he was relatively certain in this strange new world of monarchy, and he had no intention of reversing it now. \n\"There is also Queen Terrawin, of Rheged.\" Agravaine removed his hand from the map, which suddenly seemed so much larger without his looming claim upon it. \"She isn't a young woman anymore, and she may desire sons to--\"\n\"If she does, Uncle, she will have to get them from someone else,\" Arthur said tiredly, ignoring the way Agravaine's lips thinned in disapproval. \"I see no possibility here of a Pendragon alliance with any of these royal lines for the foreseeable future. Therefore, there will be no more discussion of it, at least for the time being.\"\n\"Arthur, you really must consider--\"\n\"No more, Uncle!\" Arthur pushed back his chair and stood. \"There may come a time when I will take a wife for reasons of political expediency, but not now.\" He nodded to the assembled advisors. \"Good night, gentlemen,\" he said, and without another word he left the hall, and the whispering courtiers, behind him for the evening. \nHis guard trailed along behind him at a respectful distance as he made his way back to his chambers, but mercifully, Agravaine did not pursue him down the corridor. Although Arthur valued Agravaine's counsel, he had become more and more aggressive in pursuing his own agenda -- and it was, unmistakably, his agenda, though of course he presented it as though it was what was best for Camelot, and for Arthur. In most cases, Arthur could not even disagree with that assessment, but it was starting to chafe a bit. \nTo make matters worse, Merlin had begun finding excuses not to be present in council when Arthur met with his advisors. Arthur had not realized how much he'd come to rely on Merlin's subtle approval or disapproval of what was discussed -- the twitch of an eyebrow, the sharp and silent intensity of his attention -- until it was removed. Worse yet, it was Arthur's fault; he had threatened Merlin in a way that had almost certainly ensured his silence, and Merlin had not shared any opinion with Arthur since. \nThis annoyed him almost in equal measure to Agravaine's incessant pressures. \nHis irritation ratcheted up a notch when he pushed open the door to his chambers and found them dark and cold, and Merlin nowhere in sight. His chambers often suffered from a particular creeping chill he loathed, and nothing seemed to stop the draft from penetrating the cracks and crevices. With a sigh, he crouched beside the fireplace and began building a fire. \nOf course, Merlin chose that moment to burst through the doors, carrying a basket piled high with Arthur's laundry (folded in a slightly haphazard manner) and several parchments stuck along the sides. \"Sorry, sire!\" he said, dropping the basket and making for the hearth. \"Gaius had me--\"\n\"It doesn't matter,\" Arthur said, glaring at Merlin because it actually did matter, but the excuse wasn't the point. He stood up and made space for Merlin to light the fire, and began stripping off his gloves. \"Would it really be too much trouble for you to try to keep a fire lit in my chambers, Merlin? I am the king, after all.\" \nMerlin watched the growing spark in silence, then added a few small pieces of wood. \"I take it council didn't go well, then?\" \n\"No, Merlin. No, it did not.\" Arthur moved behind the changing screen and began tugging at his own clothing, anxious to have the trappings of the day gone. It took him a second to realize he was still wearing his crown, and yanked the heavy circle from his head. \"Merlin, take this,\" he said, holding it up at the top of the screen. Merlin whisked it away, out of Arthur's sight. \n\"Can I assist--\"\n\"No, you cannot assist. You can put away my clothing, and you can generally attempt to make yourself somewhat useful!\" Arthur said, regretting his tone even as he finished, for the second time in less than an hour. Too late to take it back, now, and he certainly couldn't apologize. At times, he feared he was becoming the worst of what Uther had tried to make him, and not the best he wanted very much to be. It was exasperating. \n\"Someone had a difficult day,\" Merlin said, and the cheek of his tone made Arthur scowl all over again. A fresh tunic appeared at the top of the screen, and Arthur took it from Merlin's hands, tossing his dirty one back over without care.\n\"Don't think I didn't notice your absence,\" Arthur said, flinging his hose and breeches over the screen. \nIt was more true than he wanted to admit. Of late, the chief joy of Arthur's life was engaging in verbal sparring with Merlin. Almost nothing else could take his mind off the duties of the day; with Merlin, there were old, comfortable patterns in play, a familiarity and lack of fear Arthur had long coveted in others' friendships, and had finally found in Merlin. \nSometimes, watching Merlin's eyes narrow after a particularly sharp insult, like a hawk assessing its prey and planning the exact response required, was enough to strip all the tension out of Arthur's shoulders. \n\"There's fever in the lower town,\" Merlin said softly, handing Arthur a fresh, clean pair of breeches over the top. \"Gaius needed my help tending to the sick.\"\n\"I needed you here,\" Arthur said, though he made an effort to sound less petulant than he felt. It was not as if he didn't understand the way Merlin's time was divided. More and more, it was becoming impossible for Merlin to split his attentions between apprenticeship for Gaius and work for Arthur. Even now, Arthur was reluctant to deprive Gaius of Merlin's help, but there would come a point when it would have to be done. Sooner, rather than later. Merlin's work had tripled since Arthur had become king, and it would only grow more demanding. \nArthur peeked out from around the side of the screen and watched Merlin for a moment as he bustled around the room. \"Are your ears sticking out more than usual, Merlin? Have patients been pulling on them to hurry you along?\"\nMerlin whirled and gave him a cool gaze. \"My ears are sticking out just about as far as your behind -- how many of those tasty pork buns did you tuck away at lunch? Ten, was it?\"\n\"Two,\" Arthur said, glancing over his shoulder at his arse, like a reflex. \nHe held his smile in check until he ducked back behind the screen, and tugged clean breeches on over his nicely shaped (and not protruding whatsoever) arse. \nWhen Arthur emerged, the room was warming nicely and Merlin was bustling about, hanging clothes and arranging scrolls on Arthur's desk. He glanced significantly at Arthur, pointedly looking at his bum, which lit Arthur up with glee all over again. \"If your royal highness is finished sulking about the fact that his fire didn't light itself today, I'll fetch you some dinner.\" \n\"I'm not hungry,\" Arthur said. He poured himself some wine, flopped down in the desk chair and stared at the immense and growing pile of treaties, speeches, schedules, and other assorted detritus of being king. \n\"You should still eat,\" Merlin said, whisking up a few stray items of clothing that somehow had found their way onto the floor when Arthur changed for dinner. \"You have a busy day tomorrow. Five special audiences, two visiting diplomats, an extended session with the war council, and a banquet in honor of the new knights.\" \nPicturing it made Arthur retreat a bit into himself. There had been a time he had wondered what it would be like to be king, to be surrounded day and night by courtiers and advisors, to never have a moment's peace. It was exactly as he had imagined, watching Uther, and also difficult in ways he had never expected. He had seen his father's loneliness harden into something ugly and brittle over time, like the jagged edge of a sword; still sharp, but not honed. He had never imagined it would happen to him. In all his dreams and plans for the future, there had been someone by his side, someone to counsel and praise him, or to call him foolish when it was well-deserved. \nGwen had so easily filled that space in his life, he had forgotten for a moment how quickly such things could be snatched away. \nThe ring he had placed on her finger glinted from beneath a stack of documents, placed carelessly there where he could see it at all times, more salt in the wound. It stood now as a symbol of loss and regret. He'd done nearly everything wrong -- trusting Gwen, and then banishing her; treating with Mithian, and then hurting her. The regret over Mithian was still a fresh heaviness in his belly, knotted and twisted until it was like a sickness. Not even the certainty of his actions made that better. \nShe had been kind, and funny, and she had deserved better from him. Of the many things he'd vowed to himself since her departure, perhaps the one he took most to heart was his determination never to hurt another woman in such a way. \nThere was no help for it; he would have to endure the strange silences of evening, and the absence of comfort, until he was over Guinevere. \nHe looked up at Merlin, who had taken up Arthur's hauberk and was clucking with disapproval every time he encountered a bent link. \"My uncle is foisting princesses and queens upon me. He suggested the Princess Rowan.\" \nMerlin, of course, remembered her. It would have been difficult not to. \"Is the Princess Rowan the one who whistled through her teeth?\" he asked, and Arthur fought not to chuckle at the memory. \n\"Yes, that's the one.\" Rowan's first visit to Camelot's court had been marred by a strange incident where the princess was caught red-handed snogging a knight in the stables, and the entire thing had been brushed under the rug by Uther and Queen Selia. Most unsavory, or so Arthur had thought at the time, though he had wondered how hard he might have to work to get Rowan back into those stables with him. \nIt had been a thought only. Arthur was acutely aware of the foibles of his own father, and wished to avoid repeating them. He would likely be guilty of many sins in his life, but this was one he had avoided scrupulously. \n\"I've informed Agravaine I have no intention of marrying. Not now. Not while I'm...I need time.\" \n\"Time to get over Gwen, you mean.\" \nArthur met Merlin's eyes, and swallowed. Trust Merlin to come right to the heart of things. \"It's the prudent course of action, wouldn't you agree?\" \nInstead of agreement, Merlin gave him stony silence, while Merlin's attention remained fixed on his armor. Arthur pretended to sort through documents and papers, until the silence had grown so much weight, it threatened to crush them both. \nHe tossed the irrelevant papers aside and said, \"Speak your mind, then, Merlin, since you will anyway. Let's have it.\"\nImmediately Merlin's hands dropped to his lap, the armor clinking into a puddle on his legs, and he said, \"It's not good for you. You shouldn't be alone, Arthur.\"\n\"Well, being with someone hasn't gone very well, either, has it?\" \n\"No,\" Merlin agreed. He frowned, then, as if unsure he should go on, and it was so uncharacteristic, Arthur nearly choked on his sip of wine. Merlin without opinions shared without a care as to propriety or prudence was as inconceivable as the sun failing to rise of a morning.\nArthur glanced down at the half-finished treaty in front of him and read the same sentence four times, waiting for the shoe to drop. \nSoftly, Merlin said, \"Couldn't you...isn't there someone you could...have? As a companion?\"\nAnd there it was. It was a very large shoe. Arthur sighed and pushed the papers around for a moment before saying, \"You know very well that's impossible.\" Of all people, Merlin knew how much Arthur had denied himself these past few years. Granted, when Merlin had first arrived, Arthur's behavior had been...well, less than princely. He had done a great deal of which he wasn't proud, including bedding a few women who were, mercifully, not the type to tell the kingdom at large about their escapades with the prince. But he had grown up since then, and he was king now. He couldn't take random women to bed outside of marriage.\n\"Your father used to--\"\n\"Merlin,\" Arthur said loudly, setting his cup down with a thump. \n\"--take the wives of his nobles to bed,\" Merlin finished, as if Arthur hadn't spoken at all. Arthur scrubbed a hand over his face, because it was true, and because it had never seemed to bother Uther in the least that he was doing something so dishonorable. \nThe child of a married woman is no bastard, he had said to Arthur once, and no concern of mine. It still echoed in Arthur's head when he tried to reconcile Uther's feelings toward Morgana with that cold attitude. He had tried very hard not to think of how many others like Morgana there might be out there in the world, blissfully ignorant of their lineage. In fact, he sometimes caught himself shying away from various noble young ladies only a few years younger than himself. \nThere was much to be said for forming a marriage pact outside of his own borders. \n\"It's not appropriate,\" he said, and stared at his cup as if it would magically fill itself again if he eyed it long enough. There really was not enough wine to have this conversation with Merlin of all people, who had seen how disastrous every one of his brief relationships had been. \"It's not honorable.\" \nMerlin appeared at his side with the pitcher, and filled his cup with more of the strong, rich wine. \"Well, then, what about one of the knights? They aren't married, and can't have babies,\" Merlin said. \"I think Percival fancies you.\" \nArthur's throat closed, denying him speech and breath, and he could only stare up at Merlin. \nIt was another of the many things he had indulged in, when he was young. The joy and thrill of the hunt had led to fumbling in the stable, from time to time; the exhilaration of living through a battle had led to more than that with a few of his father's knights. He remembered long slow nights of pleasure, drunk on wine and survival, and the way his body craved touch like winter earth craved sun. \nHe knew Percival wanted him. Not long after Gwen's departure, there had been a subtle offer, quietly made, and quietly rejected. It was not something Merlin needed to know -- in fact, the thought of Merlin becoming privy to such knowledge, knowing such intensely intimate details about him, made a hot shiver course through him. \nWhether he had wanted Percival or not -- whether he had arched in his bed that evening, imagining Percival's hand on his cock as he came into his fist -- was nothing he could ever share with anyone. Most especially, he couldn't share it with Merlin, who was there morning and night, who was closer to him now than another living soul. \nOne of Arthur's most shameful secrets was the knowledge that Merlin had taken Percival's place in more than one late-night fantasy, vivid enough to cause Arthur to bury his face in the pillow from time to time, upon seeing Merlin in the morning. \nThere were so many things a king might have, and so many others he was never meant to have, by virtue of station. Percival and Merlin both were on that list. \n\"I cannot,\" he said quietly, when he recovered his voice from the breathless place where memory had sent it. \"It would be seen as showing favoritism, now, if I were to single out any of the knights for attention. I must treat them all equally.\" \n\"No one would have to know,\" Merlin said, withdrawing back to the fireplace. \n\"Someone always knows,\" Arthur said. \"How many nights have you sat here, telling tales of ladies who have made ill-considered decisions, or knights who were too loud with their squires? The castle is not made for secrets of a certain kind.\"\nMerlin nodded slowly, but there was still a thoughtful furrow on his forehead, as if he had the solution to a troubling problem just within sight. Arthur watched him for a moment as he went about his business, folding and tucking, tidying, lighting a few more candles in the antechamber. When the light struck his face, there was a depth to his features that made him seem older than his years. Handsome, even. \nArthur looked down at the papers in his hands. All of this collective wisdom, and yet nothing here could prepare him for the governance of his own heart. Everything he had wanted with Gwen was gone, and could not be so easily transferred to another. \n\"You've been alone a long time,\" Merlin said softly. \n\"Alone?\" Arthur raised an eyebrow. \"Merlin, I am never alone. I'm surrounded every moment of every day. I'm never allowed a moment's peace. Take now, for instance. I should be enjoying the peace and comfort of my rooms, and instead I'm listening to you lecture me -- again, might I add -- about what's good for me.\"\nMerlin moved on to the bed, turning down the coverlet and fluffing the pillows, as he always did. He was doing it in silence, however; on the heels of Arthur's words, it seemed off-kilter. No jokes, no commentary about Arthur's staff of distinguished but ancient advisors...the quiet was unnerving. Something about Merlin's thoughtful expression, though, kept Arthur quiet in turn, until finally Merlin's busy hands came to rest on the soft blankets. \n\"Arthur,\" he said, not meeting Arthur's eyes. \"You could...you could have me.\" \nArthur couldn't help it; his breath caught in his throat at the sudden flood of images -- Merlin beneath him, smiling up at him, his long limbs tangled with Arthur's in the very bed he had been tending all these many years. With effort, Arthur pushed the images away, even as a slow blush crept up Merlin's cheeks, and his hands resumed a restless sort of plucking at the pillow. \n\"Merlin!\" he said, not exactly scandalized, but unable to think of a single thing to say that wouldn't be yes, please and thank you very much -- and neither was an appropriate response in the least. On the heels of that, a cold anger spread through him, that Merlin should think so little of his honor, after all these years. \nHe tried to sort through the implications of it -- that Merlin would give himself to Arthur in every way, what it meant for him to offer himself in this way -- and the discomfort and offense in his mind tangled up with affection and need in his heart. His response followed upon the feelings as if by rote, a defense to remove all possibility of decision in the matter. \"How do you dare make such a suggestion to me? You overstep your position, as usual.\" \n\"I dare because it happens all the time,\" Merlin said, blush rising higher, even as he held his ground. \"Kings have needs. Everyone understands that.\" \n\"I am not the kind of man who uses a loyal servant in such a way,\" Arthur said sharply. \"You of all people should know this.\" \n\"You wouldn't be using me,\" Merlin said. \"I'm offering.\" \n\"And have everyone in the castle think this is your value, after all these years? That you bed the king as part of your duties?\" Arthur stared at him, trying not to think about kissing Merlin's jaw where the creeping blush had finally halted. He felt as if he had suddenly stumbled into a foreign land where the customs made no sense at all. \"Merlin, I....\" Arthur cleared his throat. \"It would no more be proper for me to...have...you, than it would be for me to take one of the knights for a lover.\"\n\"I don't need protecting,\" Merlin said. He met Arthur's eyes, and there was nothing neutral in his gaze. It was a direct, bold look, full of wanting, and there was something there Arthur recognized, something he had felt before, looking on Merlin in his turn. \"I'm with you all the time, so there wouldn't be any talk. We could be careful. If there is no one else to give you release, no one you can trust, I am...I am willing.\" \n\"Merlin,\" Arthur began, then stopped. Merlin had made it sound like a matter of practicality, of simple release -- base and carnal, nothing more. But it was much more, and they both knew it; too much had passed between them for such a thing to ever be without feeling. \nArthur was not such a fool that he didn't suspect the roots of Merlin's devotion, and for at least the last year, he had known the source of his own devotion in return. It was not a thing to be examined in this way, or cheapened by fucking Merlin like a common whore and debasing all they were to each other. \nMerlin knew secrets Arthur had told no one else, and for someone who was ridiculously awful at withholding petty information, he had never divulged any of those secrets to another living soul. Merlin was loyal, and true, and Arthur's to protect. Even from himself. \n\"Do not ask me to dishonor you, for in doing so, I would dishonor myself,\" Arthur said, looking away. From the corner of his eye, he saw Merlin's quick nod. \n\"I'm sorry, sire,\" he said, a hard edge to his voice. \nArthur said quietly, \"For a king, friends are hard to come by. Even rarer than lovers, it seems. They are worth protecting.\" \nArthur saw the moment the word he so carefully chose registered with Merlin, when a tiny, pleased smile curled the corner of his mouth. He'd been careful with its use over the last year, but it was becoming truer by the day, and that fact alone made what Merlin suggested impossible. \nMerlin nodded, and hesitated a moment. Arthur wondered if he might argue, and if he would be the kind of king who would bend before that argument, as he so often did with Merlin. But instead, Merlin gave the bedspread a brisk pat and said, \"Right, then. Will there be anything else, sire?\"\n\"No, definitely not,\" Arthur said, relief curling through him that Merlin was not determined to press the point. \"You may go.\" \n\"Good night, sire,\" Merlin said, giving him a small bow before withdrawing. \nWhen the door had closed behind Merlin, Arthur sighed out a long, tense breath. It was an unexpected offer, one Arthur knew was meant from the heart. The way Merlin's eyes had held his, it was clear he was more than willing. But Arthur was not that sort of man, and besides, he would make a mess of it, and Merlin was too important for that sort of fling. Merlin had given Arthur his loyalty, his bravery, even his life...but this was one thing Arthur could not safely accept from him. \nDecision firmly made, Arthur slipped beneath the covers, but, sleep was a long time coming. Arthur turned the moment of Merlin's offer over in his mind, thinking of the desire in his eyes as his body quickened to the memory. \nEventually, he drifted off to thoughts of Merlin's hands, smoothing the sheets with care. \n**\nThe idea, once planted, took root and grew in tiny increments, as was often the way of very bad ideas. \nOver the next few days, Arthur found himself noticing Merlin at odd times, when his attention should have been elsewhere -- during strategy sessions, at dinner with his uncle, even while giving audiences to the people of Camelot. Merlin was no different than he'd always been, but he was just more...prominent, in all his gangly glory. It was as if he was suddenly right in the middle of Arthur's field of vision, even when Arthur couldn't see him. \nWhen Merlin sat at the edge of the practice field, chatting with Leon, Arthur caught himself glancing sideways, just to know where he was. \nWhen Merlin fell silent as he tidied Arthur's chambers, Arthur found his attention wandering away from his work; without Merlin's stream of idle chatter, it seemed important to know where he was at all times. \nWorst of all, when Merlin fell asleep at the table during the middle of a grueling strategy session, Arthur missed some period of excellent battle history given forth by Agravaine, because he was studying the contrast of Merlin's dark eyelashes against his flushed cheeks. \nDuring routine audiences with the people of Camelot, Merlin stood just behind Arthur's throne and out of his sight -- close enough to be beside him with a simple gesture, and yet annoyingly invisible. Or so he had been, until this week. Now, Arthur could hear his soft breathing, could imagine the pleased, proud look on his face when Arthur made a particularly useful decision. It was a surprise to him that he wanted to see that look on Merlin's face much more than he cared for his uncle's nods of approval. \n\"And sire, it was dreadful, coming out to my pasture to see that cow there, eating what was left of my pig! Traumatic, is what it was! Unnatural.\" The farmer in front of Arthur wrung his hands some more.\nHe was like a hundred others Arthur had seen in the last week, and it was starting to seem all the same to Arthur. He shifted on the throne, which was possibly the most uncomfortable piece of furniture ever commissioned in the kingdom. It was a wonder, how dreadfully uncomfortable something made for the king could be. \nWith a sudden flash, he remembered his father prying him off the glorified chair when he was only five, and pulling Arthur onto his knee. \n\"Papa, cushions,\" Arthur had demanded, with the air of a child who was entirely sure of receiving anything he wished with a simple demand. \n\"Not for this chair, my son,\" Uther had said, grinning. \"It would not do to be too comfortable when holding court, or the king might find himself napping when he should be listening.\" \nArthur had not understood then, and had only looked up into Uther's smiling face with the want of a child, basking in the rare smile he'd been gifted with. There was so much his father had tried to teach him over the years, and so much Arthur had set aside, or barely remembered. It came back to him in muscle memory, ingrained in the words he spoke, the way he sat upon his throne and looked out at his people. \nFor a moment, he missed his father so fiercely, he might have bargained his kingdom away just so see him once again, to know that Uther was proud of him, and of the direction he was leading the kingdom his father had entrusted to him. \nMerlin shifted behind him, poking him subtly enough in the elbow that he didn't earn one of Agravaine's sharp glares. Arthur caught himself just on the verge of turning to say, Merlin, what do you think? Should nature take its course, or should we punish the farmer for his unnatural pig-eating cow?  It was impossible, of course; such questions could be asked only in the privacy of his chambers, with no witnesses and no question of his authority undermined because he dared to joke with a servant about the business of the kingdom. \nArthur drew himself up and said, \"Yes, unnatural indeed. Your neighbor will pay for the cost of the pig, and will henceforth take measures to keep his cows from your land, or his cattle will be forfeit.\" \n\"Thank you, your majesty,\" the farmer said, with a grateful grin, one Arthur returned without a moment's hesitation. \n \"Right, that's enough for today,\" Arthur said, and Geoffrey made a shooing motion that moved the remaining visitors and courtiers off toward the heavy doors, with apologies.\n\"My lord, there is one more matter you must attend to,\" Agravaine said, unrolling a very fancy scroll. \"King Lot has extended Camelot a formal invitation to his forthcoming wedding to the Princess Mithian.\" He gave Arthur a sidelong glance, laden with unspoken lectures about marriages and dynasties and heirs. Arthur ignored him. \n\"That was a bit fast, wasn't it?\" Sir Merador said, to his left. A quiet murmur of laughter rolled around the few remaining advisors and knights. \nArthur gave Merador a sharp look, and the man subsided. \"Princess Mithian can in no way be faulted for securing the future of her kingdom through an advantageous marriage,\" he said, and Merador at least had the good grace to look chastened. \n\"As you say, sire,\" he said, with a nod of his head, and withdrew after a deep bow, his cheeks aflame. \n\"Lot is a brute,\" Gwaine said suddenly, from his position off to the side with Leon. \"That's an ill-made match.\" \nGwaine was never shy about his opinions, particularly where royalty was concerned -- Arthur still considered himself the fortunate exception, to have Gwaine's loyalty, and was all too aware of how low Gwaine's estimations of other nobles could be. But there was a different, less general tone to his pronouncement. Arthur beckoned him closer. \"You've had acquaintance with the king?\"\n\"So to speak,\" Gwaine said. \"I found him not unlike every other king -- present company excepted, sire -- full of greed and treachery.\" \n\"Someday you must tell me how you came to know him so well,\" Arthur said quietly. Gwaine gave a nod, and a swift look at Merlin, who was still infuriatingly out of sight. \n\"It's a traditional hand-fasting,\" Agravaine pointed out, handing the invitation to Arthur. \"If she wishes, she can be rid of him in a year.\" \n\"True enough,\" Arthur said, looking with polite disinterest at the gilded, intricately lettered invitation. He had no desire to attend the wedding, so he would have to send a representative -- someone noble, with enough status to properly carry Camelot's standard. \nThere was only one choice, of course, and that only brought home to him how very alone he was. He had no wife to send, no sister, no mother; no one who would scold him for shirking his duty and wave with a smile when they departed. He had only his uncle, who would leave with stiff back and return with steely-eyed strategy after spying on Lot's army. It was a useful trait, in a counselor, but a sad one in an uncle. \n\"Uncle, you will represent Camelot at the wedding,\" he said, acutely aware of Merlin's small sigh behind him. Relief, perhaps; Merlin had made no secret of his distrust of Agravaine, and while he had held his tongue in the weeks since he last accused him of treason, Arthur knew that suspicion was simmering on, ready to boil over at a moment's notice. It would do all of them good for that tension to dissipate, for a while. \n\"Arthur, are you sure that's wise?\" Agravaine said, leaning closer, no doubt so Merlin could not hear. \"Morgana is no doubt planning something at this very moment, and you need all your most trusted advisors near you at this time.\"\n\"While that is true, Uncle, it is a regrettable fact that I have no one else to represent me, and so it must be you. Lot would not take kindly to a pack of Camelot's nobles descending on his drawbridge, and none of them Pendragons. Someone from the royal household must attend.\"\n\"As you command, sire,\" Agravaine said, bowing. Arthur did not miss the frown line cutting down his forehead. \"The wedding is in five days. We will leave in the morning, to be gone a fortnight at the most.\"\n\"Very good,\" Arthur said. He stood, and said, \"Merlin,\" moving away without glancing back, so assured was he that Merlin would be right at his shoulder. \nThey were barely in the corridor when Merlin said, \"Poor Mithian.\"\n\"Merlin,\" Arthur said, through teeth only slightly gritted, \"do not start this again.\"\n\"I'm not starting anything,\" Merlin said, catching up to Arthur so they were really walking side by side, though Merlin was a fraction of a pace behind. \"It's just that--\"\n\"You weren't fond of her, and you were quite happy to see her go, so I don't see what the--\"\n\"--I don't think King Lot will make her happy, will he?\"\n\"Happiness is not usually the objective of royal marriage,\" Arthur answered, quickening his pace. He could still hear Gwaine's words, half-troubled, half-disgusted, and he did of course know; Gwaine's judgment could be trusted, biased though it was. \n\"Royal marriages are so tricky,\" Merlin said, clucking his tongue like an old woman. \nIt was then that the idea struck Arthur, and he stopped dead in the middle of the corridor. Hand-fasting was tradition; it was a binding promise, to hold fast to one another, but the roots of the ceremony, the bones and the life of it, were in its origins. \nOne year; that is all those who hand-fasted were promised. One year, and then if either wished, they could go their separate ways, free of obligation to one another. No debts owed, and no guilt for what they had offered to and taken from one another. It was honorable -- it was ancient, and respectable. \nAfter one year and a day, the slate could be wiped clear again.\nEven more importantly, the status conferred by hand-fast was accepted throughout the five kingdoms. Arthur could think of numerous noble couples who had parted company after a single year together with their honor intact, and their motives unquestioned. \nArthur turned the idea over in his mind, examining every aspect. One year was surely enough time to mend a grieving heart. And the lingering questions of fairness and honor plaguing Arthur every time he thought of taking Merlin into his bed could be resolved with this simple solution - a binding of sorts between them, and for them alone, until they no longer wished to be bound. \nMerlin, who had continued walking for several paces before he realized Arthur was not beside him, loped back around and was looking at Arthur like one of Gaius' seizure patients. \"Arthur? Are you all right?\" he asked, laying a hand on Arthur's arm as if he expected him to topple over at any moment. \n\"Quite all right,\" Arthur said, a slow smile crossing his face.\n\n\n\n\n\nII.\n\nAgravaine left at first light, taking ten of his own guard with him, along with generous gifts for the king and future queen. Merlin stood with Arthur on the courtyard steps and watched him go with a mingled sense of dread and relief. Since the day he had foolishly accused Agravaine of treason in explicit terms, he had been walking on eggshells where giving Arthur his opinion was concerned. \nIt hadn't helped that Arthur was as changeable as the sky these days, thunderclouds one moment and summer skies the next. Gwen's banishment had taken a toll, and Arthur frequently took out whatever he was working through on Merlin. He was a lowly servant one day, fit only to polish boots and be shouted at, and a trusted advisor in whom Arthur confided all manner of things in the next. It made Merlin's head spin. \nIn fact, it was the only explanation Merlin could think of for the inexplicable way he had offered himself to Arthur, as if he were a bit of tasty cake Arthur could snap up when he was hungry. The words had just tumbled out, born of...well, something Merlin clearly hadn't thought through. It had been difficult watching Arthur walk through his days with his jaw clenched and his heart broken, and no way to give him ease...or no way that Arthur would allow, at any rate. \nHe would gladly have given himself over into Arthur's hands, if giving and taking pleasure would allow Arthur even a moment of forgetfulness. But he should have known Arthur would never admit to wanting him -- to wanting anything for himself outside of that narrow band of things he thought a king was entitled to have. Ironic, that Merlin had once wished Arthur would recognize how privileged he was...and that had led him to become a principled king. One far above ever touching Merlin, even if they both should want it. \nHe couldn't take the offer back, but he counted it as a mercy that Arthur had not been offended. There'd been no mention of it, and no awkwardness between them. Merlin was grateful for that much. \nWhen the clatter of hooves had faded into the distance, Arthur sighed, turned to Merlin and said, \"Have my horse saddled, and one for yourself as well.\" \n\"Yes, my lord.\" Merlin paused and asked, \"Where are we off to?\" \nArthur gave him a look, sweeping his cloak about him, and turned to climb the stairs. He clapped Merlin on the shoulder and said, \"Yours is not to question why, Merlin. Yours is simply to pack lunch and get the horses ready.\" \n\"Yes, sire,\" Merlin said, contemplating using magic to trip him as he ascended the stairs. Perhaps the cloak would hide his ungraceful sprawl. \nIt took no time at all to convince the cook to give him fresh bread and fruit from the stores, and a bit of leftover ham off the pig roasted for the previous night's farewell banquet in Agravaine's honor. He packed extra sweet cakes, and some cheese, because he knew Arthur would like them, and ran to his room for his heavy jacket. \nArthur still beat him back to the courtyard, and was tying some blankets to his saddle when Merlin ran up to him. \"You're sweaty,\" Arthur observed, mounting his horse. And then he promptly turned his horse toward the gates and rode off, leaving Merlin staring after him. \nGrumbling a bit to himself, Merlin climbed into the saddle and urged his horse on at a careful trot, confident Arthur would not go far without slowing for him. He hoped. \nTrue to form, Arthur had slowed his horse to an easy walk just past the second guard, and Merlin caught up easily enough. Once alongside Arthur, he immediately asked, \"Why are we without your personal guard? Or your knights?\"\n\"Full of questions today, aren't you, Merlin?\" Arthur gestured up at the sky. \"It's a beautiful day, and we're not going far. Leon and Gwaine know where to find me.\" \n\"Comforting, sire, I'm sure, but--\"\n\"Merlin,\" Arthur said, pulling his horse up short. \"We are taking a ride. Just a ride. If that is quite all right with you.\" \nIn the back of Merlin's mind, alarm bells began ringing. \"A ride?\" \n\"Yes, Merlin. A ride. You are familiar with the concept?\"\n\"No! I mean, yes, but...Arthur, we never ride. When we ride, we're always going somewhere.  Usually in a hurry, because something dire has happened.\" \nArthur turned his full attention on Merlin, then, and the alarm bells doubled, because Arthur was smiling that slow smile, and that meant he was up to nothing good. \"It's quite tragic that you've never experienced a simple ride across open fields, for nothing but the pleasure of the open air and the company.\" \n\"Yes, well, in Ealdor horses were for pulling carts, and we couldn't afford one anyway.\" Merlin patted his horse's neck absently; it wasn't this horse's fault that Merlin had never really been astride one until he'd come into Arthur's service. \nAnd then his brain caught up. \"The company?\"\n\"You don't have anything against my company...do you, Merlin?\"\n\"Of course not,\" Merlin said, staring at Arthur. \n\"Then let's ride,\" Arthur said, and set out at a gallop. Merlin watched his back for a moment, and then urged his horse on, muttering apologies to it. \nThey rode across unplowed farmers' fields, across open meadows where the frosts of winter were giving way to spring, and after a while Merlin began to relax and enjoy the countryside. It was not like riding a dragon, with the attendant pleasures of flight and freedom, but it had its own charms. Chief among them was the happiness on Arthur's face, the carefree joy in his eyes, as he glanced over at Merlin and grinned. Merlin would have ridden far to see that look on his king's face; it warmed him through, even as the chill late winter air brushed hard against his skin.\nFor a moment, Merlin put the troubles of the past days behind him -- Agravaine, Morgana, Arthur's sadness - and just concentrated on matching Arthur's pace as they rode ever harder, past trees on the verge of blooming, through creeks bubbling over smooth rocks. Merlin leaned forward, and he watched Arthur conquer the land with happiness, and was content.\n\n\n\n\n\nThey stopped beside a stream Merlin recognized well; it was one of his favorite spots for fishing, in his rare time away. Gaius had long ago recommended it as a perfect place to put aside his troubles. It reminded Merlin of the stream he and Will had spent hours splashing about in, dunking one another as tiny fish nibbled their toes.\n\"Time for lunch,\" Arthur said, swinging down from the saddle. He glanced up at Merlin and retrieved the blankets, spreading them in a double layer on the ground beside the cheerfully dancing water. \"Please tell me you brought something besides bread and fruit.\" \n\"Of course I did,\" Merlin said, dismounting onto the spongy grass. He pulled down his saddlebag and busied himself setting out meat and fruit for them, laid on a simple cloth. One of the things he liked best about Arthur was his disdain for airs when he was alone with his men; fancy dishes were fine for impressing ladies, but Arthur was not high-minded about such things for his own comfort. \nArthur took the reins of Merlin's horse, and led both their horses over to the stream to water. Merlin watched, wary now of why Arthur was doing a simple task which had become second nature to him. When Arthur turned and said, \"Well? Sit,\" Merlin gaped at him for a second before actually sitting down. \nWhen Arthur sat beside him, tugging off his gloves, Merlin handed him some meat and cheese, wrapped in cloth. \"Thank you,\" Arthur said. He gestured to the spread. \"Help yourself.\"\nThey tucked into the lunch in companionable silence, as birds sang cheerfully overhead. Merlin finished his meal and, after a careful look at Arthur, flopped back on the blanket, staring up into the mixed foliage and bare branches. \nNext to him, Arthur laid back on the blanket as well, his hands folded across his stomach. \"When I was a boy, I had a nursemaid who liked to look at clouds. She said that in every cloud, a young boy's fancy could take flight.\" Arthur frowned at the sky. \"I forget to look up, sometimes. The sky is simply the sky, nothing more. What crosses it is incidental.\" \nMerlin glanced at Arthur, and then at the array of wispy white clouds drifting overhead. In them, he could see dragons and castles, all the same things he dreamed of as a boy. In those days, he had smiled and whispered to the sky, and had made things take shape in the air. \nNow, he mourned for a childhood Arthur had lost before it even began.\n\n\n\n\n\n\"I've been thinking,\" Arthur said. \"About your offer.\"\nHeat blossomed all across Merlin's face. He had thought perhaps it was put behind them; Arthur had been quiet on the subject, but maybe now Arthur would tease him. He should have expected it, really. So much revealed by a few truly meant but ill-considered words. \n\"There is a way,\" Arthur said. \"It's a foolish way, perhaps, but it would serve several purposes.\" He turned on his side and propped up on one elbow to look at Merlin quite seriously, no trace of amusement in his expression at all. \nSeveral things were at the tip of Merlin's tongue as he looked at Arthur, but the one he said, he hadn't really meant to say. \"Is it something you want?\" he asked.\nArthur regarded him for a long moment, giving nothing away in his expression, until finally he reached out and traced the shapes of Merlin's cheek with his fingertips. \"If the offer was sincerely meant.\" \n\"You know it was,\" Merlin said immediately. His heart was beating so fast, he felt as though Arthur must surely hear it, outside his skin. \nArthur nodded, and dropped his hand. \"We could hand-fast. It would have to be in secret, of course, but I would know you were bound to me, and you would know the same.\"\n\"Hand-fast,\" Merlin repeated slowly, thinking it through. \"For a year?\"\n\"Yes -- although nothing would be expected of you that you did not freely give,\" Arthur hastened to add, a slow blush creeping up his own neck, now. Merlin squashed the urge to touch its heat. Not yet. This thing between them, this negotiation of a sort, was delicate; he was afraid to do the wrong thing, send it off in the wrong direction. \n\"And then we would go our separate ways?\"\n\"Yes.\" Arthur's gaze was intensely focused, as if he could see straight inside Merlin's heart. \"We are not equals, and this will not make us so...but it gives you status as the king's consort, and protects your honor, in case someone finds out.\" \n\"No one will find out,\" Merlin said, his lips curling in response to the ghost of a smile on Arthur's lips. \n\"Someone always finds out, Merlin. Were we not discussing the gossip?\"\n\"Who do you think controls that gossip?\" Merlin said, grinning now. Arthur laughed, a short bark of surprise, and for the first time, something like genuine happiness crept into his eyes. \n\"I will of course tell my uncle -- it will keep him off my back for the time you are my consort, and it will protect your position.\" \nMerlin couldn't help the sour expression he felt forming on his features at the mention of Agravaine. Arthur made an impatient noise and said, \"Don't start that again.\"\n\"If it's to be a secret, shouldn't it be a secret?\"\n\"Not from Agravaine.\" \nMerlin nodded. It was a battle he was resigned to losing, and one that didn't seem all that important, considering what he was gaining. \"I'll still be your servant?\"\n\"Yes. Unless you would rather work only with Gaius, and then I can have George take over your duties.\" Arthur shifted closer on the blanket, and Merlin caught his breath at the way Arthur was looking at him, like he was something dearly desired. \"But I would rather nothing changed, for now.\" \n\"You wouldn't be able to take two days of George,\" Merlin said, though it was an effort to get the words out, because Arthur was leaning closer, nosing at his hair, and oh, this was a terrible idea, it was complete madness, and Merlin had never wanted anything so much in his entire life. \n\"All that talk of brass,\" Arthur said, and then he tilted his face and kissed Merlin, softly, as if he wasn't quite sure of his welcome. \nMerlin had always thought Arthur would be the kind of man who kissed like he was on a mission -- as if there was territory to be conquered, and he was the man to take it. But this kiss was gentle, a plush press of lips, and a slow retreat, only to return to take more, to go deeper the second time around. Merlin made a small noise in his throat and tilted his head, inviting Arthur in. He couldn't help it; perhaps it was all wrong, and perhaps it was a very bad idea, but Arthur's hand was on his waist, and Arthur's mouth was exploring his very thoroughly, and Merlin gave himself over to it in the space of a heartbeat. \nWhen Arthur broke the kiss, his fingertips settled on the rapidly beating pulse point low on Merlin's neck. \"I think we will be compatible,\" he said quietly. \n\"Yes,\" Merlin said, lifting his face. This time, when Arthur kissed him, Merlin opened to him easily. Arthur's lips traveled the line of his jaw, and Merlin raised a hand to tangle his fingers in Arthur's hair, giving himself permission for something he'd only barely imagined possible. \n\"Merlin,\" Arthur murmured, the sound of it vibrating through Merlin's skin. \"Tell me. Are we agreed?\"\nSomething in Merlin cracked open then, something small and hopeful, and he drew in a sharp breath. Arthur had never made a vow he didn't intend to keep, and a year was a very long time for a king to be bound to someone else. Someone who would not be his future queen. That thought brought Gwen to mind, strong, beautiful Gwen, who had refused to return to Camelot, even though Merlin knew Arthur's love for her was deep and true. The course was set, and Arthur's resolve to move on was grounded in his grief. There was no cure for that kind of sorrow, but Merlin was sure he could help heal it, if Arthur would allow him to try. \n\"Are you sure?\" Merlin asked, hardly able to breathe for the swelling tide of want in his chest. \n\"It seems the best solution to the problem,\" Arthur said, smiling against the tender spot beneath Merlin's left ear. \"And clearly, we're well-matched.\"\n\"Wait,\" Merlin said, shoving at Arthur until he pulled away. \"Is this -- was this some sort of audition?\"\n\"I wouldn't put it in such crass terms,\" Arthur said, having the good grace to flush in a very attractive way. \"I couldn't very well accept what you offered until I knew if it would be pleasing to us both, now could I?\"\n\"Are you saying you doubted whether or not I'd be any good at it?\" Merlin broke off, not quite sure if he wanted to laugh, or punch Arthur in the nose. \n\"Merlin,\" Arthur said, returning to his thorough inspection of Merlin's neck with his lips. \"Do you really think this is the time to take offense?\" \n\"Yes,\" Merlin said, shoving at him this time, despite the fact that he was quite sure his knees would not support him if he stood up. \nArthur sighed, and sat up, crossing his legs. \"Very well, then. Let's call the whole thing off. Hand me the rest of the bread, would you?\"\nMerlin made a noise of disbelief, and then Arthur was kissing him again, and erasing all doubt about compatibility. \n\"Are we agreed?\" Arthur asked again, breathing it against Merlin's parted lips. \n\"Yes,\" Merlin said, giving himself over to the warmth of Arthur's hands. \n\"Merlin. I'm going to court you, for a very brief time,\" Arthur said, between kisses, \"and when I'm done, we will hand-fast, and I'm going to take you to bed. Thoroughly.\" \n\"You are an arrogant ass,\" Merlin said, slipping his hand beneath the hem of Arthur's tunic, just to feel the skin pebble with goose bumps beneath his touch. \n\"It's only arrogance if it's untrue,\" Arthur answered, catching his hand. He drew Merlin's fingertips to his lips, where he kissed each one in turn. \nMerlin forgot to be annoyed, thereafter, as he lay on the blankets with Arthur until the sun began to dip below the horizon. They talked of Mithian, and of Camelot's grain shortage, and of the strange shapes of clouds, and if Arthur occasionally cut short their chatter because he was kissing Merlin, there didn't seem to be much to complain about, after all. \n**\nWhen they returned to the citadel, they went about their duties, Arthur brusque as he attended to business, Merlin burdened down with chores left undone on their afternoon away. In the evening, Merlin turned down the bed as always, and set Arthur's sleep clothes out, but the merest touch of the luxurious sheets to his skin was enough to make him hard. \nHe had long ago grown accustomed to wanting his prince, and that desire had never waned as his prince became his friend, and then his king. But to have it returned...that was something he had thought might be possible, but had never examined closely. \nAnd now here they were, with Arthur studiously ignoring him and poring over a dusty stack of land grants as if Merlin were not even in the room. Merlin knew it for what it was; every so often, his eyes would track toward Arthur, and he would catch Arthur watching him with breathtaking intensity. Every time, Merlin held his gaze until the corner of Arthur's mouth turned in a tiny smile, and he dropped his eyes back to the papers in his hand. \nAlthough Merlin had never been courted - the idea of it would have been laughable just days ago - he thought it might not be the worst thing ever to happen to him. \nIn the morning, Merlin made his way down from his room, yawning and stretching sleep away, and found Gaius folding piles of cloth on the table where breakfast would normally be. \"What's this?\" he asked, touching the garments curiously. \n\"A gift from the king,\" Gaius said, a smile lighting his face. \"Three new robes, for court.\" He ran a hand across the expensively dyed purple and yellow fabric, fit for a king; the richly embroidered plackets sparkled in the morning sun. \n\"The king thinks a great deal of you,\" Merlin said, happy to see Gaius's delighted smile. \n\"That's all very well and good, but let me see about getting some porridge,\" Gaius said. With great care, he picked up the garments and moved them to a safe position on his work table, and turned to grab two bowls. \nMerlin grinned all through breakfast. \nAt dinner that evening, he served the king a portion of roast beef and potatoes, and said, \"'Twas a very nice gift you gave Gaius.\" \n\"Well deserved, don't you think?\" Arthur asked, forking up a bit of potato. \n\"Definitely,\" Merlin said. \"If anyone deserves nice things, it's Gaius.\" \n\"He has been a loyal advisor,\" Arthur agreed, very engrossed in his dinner. \nThe following morning, Merlin took Arthur's sadly and perhaps permanently dented hauberk down to the armory for repair and found Gwaine there, sharpening his daggers on the whetstone. All of Gwaine's daggers were beautifully made, and looked very expensive to Merlin - as fine as anything Arthur possessed. Gwaine took meticulous care of them, and the other knights had taken to calling them his darlings. \n\"Getting ready to kill something?\" Merlin asked cheerfully, as he dumped the armor in a pile. \n\"Just staying ready. You know how it is,\" Gwaine said, as he smoothed a piece of old linen across one gleaming blade. \"How's life with the king this morning?\"\n\"He's sleeping in,\" Merlin said. \n\"Couldn't rouse him, then?\" Gwaine said, with a twinkle in his eye. \n\"Wouldn't budge.\" They exchanged a grin, then, because Gwaine had seen Merlin's less than successful efforts to roust Arthur from the bedroll on cold morning patrols, absent attacking bandits or small armies. \nAt that moment a young page trotted into the armory, looking about until he spotted Gwaine. \"Sir Gwaine?\" he said, coming closer. \n\"In the flesh.\" \nThe page bowed low and presented a sealed document to Gwaine with both hands and a flourish. \"By the king's command, Sir Gwaine.\" As soon as Gwaine plucked it from his fingers, the page bowed again and ran off. \nMerlin glanced curiously at the document; he could see the Pendragon seal in heavy red wax on the outside. \"What in the world?\" he asked. \nGwaine smiled and shrugged. \"Can't be an order of execution; haven't done anything heinous lately.\" He smiled wider and added, \"I'll have to work on that.\" He broke the seal and opened the scroll, and as he read, the blood drained from his face at an alarming rate. \n\"Gwaine?\" \n\"That's 'my lord' to you,\" Gwaine said, handing the papers to Merlin with a shaking hand. \n\"It's a land grant,\" Merlin said, skimming down the page with a growing sense of astonishment. Gwaine was given a parcel of land at the north end of Camelot's borders - untenanted, Merlin was happy to see - to use as he saw fit. It was a generous grant, and one that accorded Gwaine noble status, separate and apart from the lineage he had never told Arthur about. \n\"Gwaine!\" Percival burst into the armory, clutching a similar paper. \"Arthur has - oh, hello Merlin! - he's given me land!\"\n\"Seems I'm not the only special one,\" Gwaine said, taking his grant back from Merlin with a more careful touch. \n\"Elyan, too,\" Percival said, the grin on his face as wide and bright as the sun. \nMerlin looked at each of his friends in turn, and said, \"Well, then, my lords,  I'll have to buy you a round at the Rising Sun tonight.\" He punctuated his offer with a sincere, respectful bow, and Gwaine burst out laughing. \n\"Never bow to me, Merlin, or I will put my boot in your arse.\" He clapped Merlin on the shoulder, and Percival lifted him in a giant bear hug. Gwaine's bemused expression was rapidly giving way to the happiness of the moment; it was impossible to remain apart from Percival's joy. \nThat afternoon, as Merlin handed Arthur a towel on the training field, he said, \"I'll be turning down your bed early tonight, my lord. I must celebrate with Gwaine and Percival.\" \nArthur waved a hand at him, as though it was nothing of consequence and he could barely be bothered to ask why his servant's attentions were diverted from his duties. A moment later, Merlin caught him smiling into the towel, and his heart swelled in his chest. \nOn the morning of the third day, Merlin went to wake Arthur just past dawn and feed him breakfast. He found Arthur up and dressed, and studiously writing something at the desk. \"Sire?\" Merlin said, gaping at him. It was not exactly the most expected of sights. Arthur was usually only awake at dawn when enemies were climbing over the castle walls, and then only grudgingly. \n\"Ah, Merlin,\" Arthur said, putting the quill aside. \"I've been working on a letter. Read it over for me, would you? I'd like it to be just right.\" He thrust the paper toward Merlin, who took it with a suspicious frown as Arthur got up from the desk and whisked the platter of bread and fruit from Merlin's left hand. \nMerlin walked closer to the filtered light from the paned window, and began to read. \nDear Hunith,  it started. \nMerlin caught a small breath, and looked up at Arthur, who was leaning against the fireplace, arms crossed over his chest. \"Well? Go on,\" Arthur said, gesturing toward the document. \n\nDear Hunith, \n\n\nI hope this letter finds you well. I am writing to assure you that things in Camelot are well also, and Merlin is his usual self. I find it difficult to do without him, despite the fact that he is still the most useless manservant I have ever had the misfortune to employ. While it is true that he occasionally displays wisdom and insight in times of crisis, it is a most remarkable coincidence, and certainly not anything he intends to do. Nevertheless, I have grown to value his coincidental counsel, and so must apologize to you for keeping him here, far from home, to do his duty to his king. \n\n\nWhen things have settled here, I will send your son home to visit you, as I know it must be difficult to be separated for so long. I hope that you will return him to me as you find him, for Camelot will be poorer for his absence. You have raised a fine son, and must take pride in his service, for despite all his numerous and extensive flaws, he is a loyal and brave companion to his king. \n\n\nBe well,\nArthur Pendragon\n\nMerlin was very still for a moment, and ignored the sudden prick of tears in his eyes. Very carefully, he rolled the parchment, and looked up at Arthur, who was watching him with a guarded, hopeful expression. \nHe had never been courted before, and now he was quite sure he was ruined for all those who might come across his future path. \nFor a moment, he stood holding the parchment, and thinking of the weight of its words, the trust and affection laid open for him there. \n\"Are you quite finished?\" he asked softly, moving to stand with Arthur before the fire. \n\"I think that depends upon you,\" Arthur said, just as softly. \n\"I've been ready since you asked,\" Merlin said, not sure why his hands were shaking, since it was true. \n\"I've been ready since you offered,\" Arthur said, and then Arthur drew Merlin close, kissing the unstoppable smile from his face. Merlin slipped his arm around Arthur, pressing against the hard line of his body, and they kissed for a time, slow and easy, a fire banked low and ready to come to life. \n\"Tonight, then,\" Arthur said, tightening his arms around Merlin. The idea of it sent hot shivers thrilling down Merlin's spine. \n\"At the usual time?\" Merlin asked, struggling to keep from falling into Arthur's kisses. \n\"Yes,\" Arthur said, tracing the shell of Merlin's ear with his lips, \"but this time, you will not leave until the morning.\" \nMerlin nodded, and with some effort, he pulled away from Arthur, who held him a moment longer before letting him go. \n\"Merlin,\" Arthur said, folding his arms over his chest again, even while his eyes never left Merlin's face. The control in which he held himself was absolute; Merlin could see the tense lines of his body. \"Don't let me see you until then, or I won't be responsible.\" \n\"Sire,\" Merlin said softly, and made his way to the door on unsteady legs. \n**\nAll afternoon, Merlin was busy washing phials for Gaius and filling them again with various potions. He gave his full concentration to the task, so that he might distract himself from thoughts of the evening to come. \nIt had been so long since he'd been with anyone. There hadn't been many opportunities to steal kisses from other willing boys and girls in Ealdor. Once he'd come to Camelot, there had rarely been time to run off with knights or ladies to enjoy their company, and even less time to explore each other more thoroughly. His world had revolved around Arthur for so long, and so completely, it seemed difficult to believe he was here, now, taking such a strange and binding step. \nHe thought of Freya, and of the future he might have had with her, but it had not been his destiny. This might be part of what the dragon had told him was ahead, but it was completely beyond all his fevered imaginings when he'd thought of Arthur, dreamed of him. \nThere were times he had called on his magic to give him courage, or guide him in the right direction. This time, his magic was swirling through him with joy, urging him on. Even as he hesitated, it seemed to have no doubt. \nWhen finally he found himself before the door of Arthur's chambers at dusk, he took a long, deep breath and stepped inside, barring the door behind him. This one night, it wouldn't do to have Leon or Agravaine bursting in. \nA few beeswax candles glowed softly on the tables and mantels, and a fire blazed in the bedchamber. Merlin could remember lighting a hundred candles or more on the night Arthur proposed to Gwen. It was a happy memory, or had been, until recent events had marred it forever. This was nothing on that scale, but it was clear Arthur had taken some care in preparing. \nMerlin looked up to find him standing beside the fire, waiting. He was wearing a simple white linen tunic, and breeches, and his feet were bare. Merlin had seen every version of Arthur's smile, from the false politeness at court, to the genuinely happy. The smile Arthur graced him with now was laden with such quiet resolve that a surge of tender protectiveness rose in Merlin. \n\"Your boots,\" Arthur said, pointing at Merlin's feet. \n\"Right,\" Merlin said, and proceeded to take them off, and his socks along with them. He took off his jacket and neckerchief, and folded them across the back of a chair, laying his belt across them. Arthur smiled, and beckoned him closer. \nWhen they were toe to toe on the fur rug by the fire, Merlin's feet nicely warm in the chilly room, they stared at each other for a long moment. Arthur's body was relaxed, not tense at all. Now would be the time he'd send Merlin away, if he'd had a change of heart, and it would be forgotten in the morning. \nInstead, Arthur picked up a length of red ribbon from the mantel, and as he did, Merlin saw the bed was already turned down, clean white sheets peeking out from beneath the brocaded bedspread. He swallowed hard, and the touch of Arthur's hand on his shoulder centered him. \n\"I don't actually know the correct words,\" Arthur said. \"So we will improvise, if that's all right with you.\" \n\"I've seen a hundred hand-fastings.\" Merlin gave Arthur an amused glance. \"You'd think I'd remember something.\" \n\"It's all the drink that comes after,\" Arthur answered solemnly. \"Wipes the memory.\" \nFor a long moment, they smiled at each other, at ease together, even at such a strangely awkward moment. Then Arthur said, \"Give me your left hand,\" and extended his own left hand in return. \nThe moment Merlin put his hand into Arthur's, the room seemed to narrow to just this tiny space, just the two of them, awash in golden light. Arthur clasped his hand firmly, and Merlin squeezed back. With infinite care, Arthur wound the red ribbon around their joined hands, until their wrists were wrapped securely. \n\"There's something about stars and stones,\" Merlin said, lifting his eyes to Arthur's. \"Constant and true.\"\n\"Very apt, for you,\" Arthur said, his expression so fond Merlin had difficulty not breaking his gaze. \n\"And for you,\" he answered, lifting his chin. \nArthur's smile changed from resolve, to something much more tender, and said, \"Is it your wish, that we become one?\"\n\"It is,\" Merlin said, without hesitation. He watched Arthur's face carefully when he said, \"And is it your wish also, that we become one?\"\n\"It is.\" Arthur exerted a tiny pressure on Merlin's hand, drawing him nearer. \"In as much as we are agreed to be bound, I, Arthur Pendragon, King of Camelot, proclaim us hand-fast, until such time as we no longer desire to remain so.\" \nThe words had barely fallen from his lips before he was kissing Merlin, not gentle, but a bruising, deep kiss, devouring. \nMerlin reached to the ribbon and pulled it away, the silk whispering over his skin as it fell to the floor, and then Arthur had him in his arms, taking his mouth with a need Merlin could feel in his own body. \n\"Get on the bed,\" Arthur said, through gritted teeth, and Merlin complied with a wide grin. \n\"So were you really after my virtue all these years?\" he said, clambering back into the heavenly soft bed without even a pause. \nArthur paused in the act of climbing on the bed and stared at Merlin, his eyes horribly wide. \"Your virtue?\" he said, growing pale. \"Do you still have virtue to be taken?\" \n\"...yes?\" Merlin said, suddenly wishing he had never tried to tease the heaviness of the moment away, because the look on Arthur's face was a priceless combination of surprise and worry. \"But I do know where everything goes, if that's a comfort to you.\" \n\"Merlin,\" Arthur said, his muscles tensing in a way that meant this was going to be a very pleasant evening indeed, if Merlin played his cards right. \"I had not expected to be your first.\" \n\"Well, you aren't. Technically. I mean, there were boys...and girls...before, just not...that.\" Arthur was crawling up the bed now, fully predatory, and Merlin's mouth went dry at the way his eyes were traveling every bit of Merlin's body, coming to rest on Merlin's mouth. \n\"You offered me a gift, and I had no idea of its true value,\" Arthur said, and then his lips touched Merlin's again, and his body settled against Merlin's, warm and heavy. \nFor a time, Merlin lost himself in the complete bliss of Arthur's kisses, in the way Arthur seemed able to pull away every bit of reason he had and replace it with a slow-kindled lust. He tugged at Arthur's shirt, running his hands down Arthur's arms to revel in the feel of revealed skin as Arthur rose up. Just then, Arthur moved, and his elbow landed squarely in Merlin's eye. \n\"Ow,\" Merlin said, even as Arthur began apologizing. He sat up, and his knee knocked into Arthur's, sending a shooting pain up his thigh. \n\"You are a menace,\" Arthur said, rubbing his knee, even as Merlin covered his eye with one hand and burst out laughing. \nHe laughed even harder a moment later when Arthur swung on top of him, prying at his hand to see if his eye was blackened, and lost his balance because Merlin tugged on his tunic. His elbow struck Merlin's chin with a crack. Suddenly they were sprawled together in a tangle of limbs, wounded and with watering eyes, and Arthur was laughing as well, a deep, happy sound filled with uncomplicated pleasure. \nMerlin turned on his side and kissed Arthur, and Arthur's hand came up to cup the back of his head, shifting them just so until they were body to body. Merlin was so hard he ached, and Arthur was just as hard, and their hips circled in a private rhythm, one well-matched. \nTwo or three aborted maneuvers later, Merlin began snickering again, unsure where to put his hands, and Arthur's eyes betrayed his amusement, even as he rolled them again so Merlin was underneath him. \"Would you lie still,\" he said, exasperated, and Merlin lifted his hips squarely into contact with Arthur's cock. \n\"Whatever best pleases my lord,\" he said, low, and grinned when Arthur gasped. \n\"Insolent, insufferable little...\" He seemed to flail about a bit for words, and finding none, decided to speak with kisses instead, punctuated by tiny touches of his tongue to Merlin's, each one a flickering jolt straight to Merlin's cock. \n\"Off,\" Arthur commanded, ripping at Merlin's shirt, and Merlin complied, only to find Arthur's palms flat against his chest, stilling him. \nToo late, Merlin realized what he must be seeing; his body was the canvas of their years together, every scar and mark a symbol of what he would endure for Arthur, even those things he could never speak of. He saw that realization in Arthur's eyes as his fingertips traced the fresh and fading marks. \nSlowly, Arthur leaned down and kissed the most recent of them, the well-healed injury Morgana had worked her magic upon when he was in her thrall. \nMerlin closed his eyes as Arthur worked open the laces of his breeches and took him in hand, stroking gently as he kissed his way across Merlin's chest, stopping to lick at each nipple in turn. \n\"Arthur, you -- I --\" Merlin ran his hands through Arthur's hair, wanting more of his skin, wanting to give back some measure of the intense pleasure burning through him, but Arthur's strength was immovable, set on this course. Merlin could do nothing but throw his head back and come, fighting for air as Arthur's lips settled at the hollow of his throat, possessive, sure. \nWhen the fire had left his bones, Merlin pushed Arthur onto his back and ripped open his breeches, taking Arthur's hard, perfect cock into his mouth and moaning as he did so, shivering as Arthur shivered beneath his touch. Arthur's fingertips traveled the line of Merlin's shoulder, and Merlin sucked harder, his tongue swirling about the head each time Arthur lifted his hips. It didn't take long; Arthur shoved at him, but Merlin wanted to taste it, wanted to know Arthur had come in his mouth, that he had brought Arthur to his climax this way. The thought gave way to a strange euphoria as Arthur cried out and warm bitterness flooded Merlin's tongue. \nIt was enough to make him hard again, and he reached down, drawing out fresh pleasure with hard strokes of his own hand. \nWhen Arthur was soft, Merlin released him and flopped down where he was, his head resting on Arthur's thigh. For a time, there was no sound but their harsh breathing, and then Merlin rested his chin on Arthur's belly and said, \"My virtue is wondering when you plan to get around to it.\" \nThat made Arthur laugh again, and he curled his hand around Merlin's arm, tugging him up the bed to rest in the circle of Arthur's arms. \"There will be time,\" he said. \"There will be more than enough time for all of it.\"\n\n\n\n\n\nIII.\n\nWhen Arthur opened his eyes in the morning, the first thing he noticed - apart from a gnawing hunger, and the sense that he might have pulled a muscle high in his back -- was the warm bundle of sleeping Merlin curled next to him. \nArthur was not accustomed to the kind of immediate happiness that spread through him as he took in the sight: Merlin's tousled hair, and his parted lips; the damage they had wrought on each other, and the bedclothes which were scattered all around them as if a whirlwind had carried them off. \nHe gave himself leave to indulge, and kissed the tip of Merlin's shoulder. \"Merlin,\" he said, smiling against his skin. \nMerlin's shoulders hunched, and he turned his head, just to the point where Arthur could kiss him gently. \n\"Not a dream, then,\" Merlin murmured, and Arthur traced the line of his throat with two fingers. \n\"Definitely not. If this were a dream, my breakfast would already be laid out for me, and I would have enough strength to carry on.\" \n\"Hm,\" Merlin said, rolling to his back. He looked thoroughly debauched, and this pleased Arthur in the way of a man who had set out to do something, and found it to be its own reward. \nMerlin settled on top of him and sat back on Arthur's thighs, provoking a small, pleased smile from Arthur as he looked up at Merlin. Evidence of their night together was all over Merlin's body, from the small red bite marks at the join of his neck and shoulder, to the bruise forming where Arthur's elbow had struck Merlin's chin accidentally in the throes of passion. Arthur reached up and touched the bruise gently, then ran his hands down Merlin's arms, to settle them at Merlin's hips. \n\"Good morning,\" Arthur said, taking in the view with pleasure. Merlin smiled then, the happiest Arthur had seen him in...well, possibly ever, and that did strange things to Arthur's heart. He began to reach for Merlin, the pleasant warmth of arousal already surging through him again, but Merlin stopped him, both hands planted firmly on Arthur's chest. \nArthur stilled, waiting, while Merlin gazed down at him, before finally moving to cup Arthur's face with his hands. He leaned down and kissed Arthur, then, no hesitation in the way he took Arthur's mouth. \nThere had been kisses before, with Gwen - many of them - but they had been nothing like this. Not this slow, deep, careful pressure, the kind that melted Arthur's bones and made him lift his arms to wrap them around Merlin, to bring him closer. He spread his fingers across Merlin's back, content to sink into the kiss, his breath coming in short bursts against Merlin's cheek. \nFinally, Merlin pulled back, and they looked into each other's eyes for a moment before Merlin said, \"Good morning,\" with a blinding grin. Before Arthur could take him in hand to address the growing hardness between his legs, Merlin slid off of him and began gathering his clothes. \n\"Merlin,\" Arthur groaned, rolling to his side. \n\"I have a very harsh master,\" Merlin said, hopping as he shoved one leg at a time into his breeches. \"Very. Mustn't be late with breakfast.\" \n\"Ugh,\" Arthur said, pulling a pillow on top of his face. For a moment, it had seemed as though being awakened at the crack of dawn would finally be bearable, but now - now there would be breakfast, and back to kingly duties. \nA thought struck him. \"What are you going to tell Gaius?\" he asked, shoving the pillow aside and propping himself up on one elbow. \"About why you have taken to spending the night in my chambers, I mean.\" \nMerlin's hands paused only a moment as he tugged at the ties on his tunic. \"The truth,\" he said quietly, looking up at Arthur. \"I can lie to the entire world, Arthur...but just as you won't deceive Agravaine, I won't lie to Gaius.\"\n\"He won't approve,\" Arthur said, already not looking forward to the stern glare he was going to receive at Council. \n\"Neither will Agravaine,\" Merlin said, \"but we're a bit past that now, and it doesn't matter, anyway.\" Merlin hesitated, then leaned forward to kiss Arthur one more time, a soft, delicious press of lips that Arthur chased even as Merlin retreated again. \"This is what I want.\" \n\"Well,\" Arthur said, pleased, and unsure of how to say it, or what to do. But Merlin seemed to understand, and with a grin, he was gone to the kitchens to fetch breakfast. \n**\nThe week that followed passed in a pleasant haze, where Arthur's chief concerns were the enjoyment of Merlin's body, and giving him as much pleasure as possible in return. He gave his full attention to matters of state from sunup to sundown, and sometimes beyond -- but once Merlin entered his chambers of an evening, Arthur looked forward to separating himself from the cares of the day, for a time. \nThose first few days, he concerned himself with every hidden place on Merlin's body that could make him writhe and moan when Arthur's hands were on him. Over the course of those nights, he had mapped out the full extent of Merlin's scars, not yet asking him the story behind those he did not recognize. It seemed premature, and he didn't want to see that shuttered, secretive look on Merlin's face. Better to let Merlin keep those secrets; soon enough there would be a deeper intimacy, and he might be entitled to know, when that happened. He knew there were stories, though; he could vouch for how two or three of them had been received, and a small, sad part of his heart knew that Merlin's skin had been unmarred before he became Arthur's shadow. \nHe didn't wait long to take Merlin in the way they both wanted. They were not coy with each other, and Merlin made his desires plain every time Arthur's hard cock slid against Merlin's hip. Their discoveries about each other arrived at every turn, unexpected. \n\"Hold still,\" Arthur told him, as Merlin sprawled on his belly, his thighs open to permit Arthur access. Arthur slid his fingers out and pressed his cock against Merlin's opening, sliding inside with a long, slow stroke that made Merlin moan softly, and his own heart thump heavy against his ribs. He stilled there, giving Merlin time to adjust, and nosed at the raised red scar near the base of Merlin's neck. \nMerlin tensed and pushed his hips back at Arthur, bucking like a wild thing. \"Merlin,\" Arthur gasped, as a wave of pleasure washed over him. He licked the scar, and Merlin's hands curled into the sheets, shaking. \nArthur kissed the nape of his neck, and began to move, deep, rolling thrusts joining them more fully together. He scraped his teeth across the scar, and when he set his teeth on the mark, Merlin made a broken noise and came, shuddering, shaking apart in Arthur's arms. The tight, unrelenting clench pulled Arthur's orgasm from him, and he spent inside Merlin, not certain why this one thing had so aroused Merlin, but sure in the knowledge there were many ways to show Merlin how fully he was Arthur's, now. \n\"Are you all right?\" he asked softly, as he pulled out as carefully as he could. \nMerlin kissed him, breathless, and it was answer enough. \nEven in Agravaine's absence, the advisors were after him with unsubtle remarks about marriage, and it wore Arthur down to a nub. Each night, he returned to Merlin, complaining about it at length, and each night Merlin turned from the fire to take him to bed, stopping all further talk of wives and duty, turning his attention to happier things. \n\"I'll have Agravaine put a stop to it,\" he said to Merlin, as he drew a hand across Merlin's ribs, coming to rest on Merlin's prominent hip bone. \"I'll have him tell the others to refrain from raising the topic, for a time. He will take the lead.\" \n\"He'll resent it,\" Merlin said, and the open distaste and warning in his tone, as always, made the hair prickle on Arthur's neck. He didn't know why he should care; Merlin's opinion of Agravaine was of no importance, and this arrangement would not change the status of things at court. \n\"He may, but he will do as I command,\" Arthur answered. \"Unlike some stubborn, truly annoying subjects of this kingdom, who never know when to cease talking and--\"\nMerlin's mouth on his cock quite definitively derailed the rest of his little lecture, and after, he kissed the taste of himself out of Merlin's mouth and forgot why he'd bothered in the first place. It wasn't like Agravaine and Merlin needed to be cordial. Merlin would never have that kind of status. \nThey rode out to the same meadow where Arthur had proposed their arrangement, and sat in the tall grass, speaking of Arthur's hopes for Camelot, all his plans for the future. Merlin asked serious questions, a thoughtful frown on his face as he heard those ideas, and responded in kind. Before Arthur knew it, he had an entire strategic mission mapped out, five or six years of projects to make the kingdom a better place. \nCross-legged in the damp meadow, with Merlin's fingertips curling and straightening in the palm of Arthur's hand and the future Arthur wanted for his people unfolding in his mind, was the happiest Arthur could ever remember being. He ignored the tiny, guilty voice telling him it had never been so easy with Gwen, until that voice faded away altogether. \n**\nAgravaine returned a fortnight to the day after his departure, unheralded and riding at a gallop through the gates. Arthur did not go down to meet him; Merlin stood on the battlements with him and watched Agravaine dismount. \n\"He seems to be in a hurry,\" Merlin said, as Agravaine swirled his cloak about him and entered the castle. \n\"Afraid, no doubt, that I will be wringing my hands without his advice,\" Arthur said. He regretted it a moment later, because it was unfair to his uncle. There was no denying he had felt unfettered in his decision-making the last few weeks, and had not once wished he had his uncle to consult. Perhaps he was unwise to distance himself from Agravaine's counsel, but there was a nagging voice inside Arthur's head reminding him that Uther had never allowed Agravaine too close to the throne, and had never sought his counsel. \nIt was no coincidence Agravaine had arrived to offer support just days after word reached him Uther was unwell, and had never visited Uther before his death. Arthur was no fool, but he also could not throw away his uncle's steadfast advice merely because he was also ambitious. \nWith Merlin in tow, Arthur descended the steps to the council chambers and there met Agravaine, peeling off his gloves and refreshing himself with a goblet of wine. \"Uncle,\" he said, clasping his hand warmly. \"I trust you had an uneventful journey?\"\n\"Indeed,\" Agravaine said, polishing off his wine. \"Princess Mithian and King Lot are wed, and I'm quite sure she will come to regret it.\" Agravaine followed Arthur's lead, sitting only after Arthur gestured permission. \"Lot seemed intent on asking questions about your stewardship of the kingdom, some of which bordered on interrogation. We left as soon as it was manageable.\"\n\"Interesting, but not unexpected,\" Arthur said, thinking of his extensive and unguarded borders, and his diminishing army. \"And how was the lady Mithian?\"\n\"As well as might be expected,\" Agravaine said, \"given that Lot seems disinterested in her beyond the wealth she brings to the marriage.\" \n\"I look forward to hearing more about your journey,\" Arthur said. \"And about Lot's defenses. Dine with me tonight, and we'll talk.\" \n\"Of course, sire,\" Agravaine said, standing. \"Is there anything which requires my attention? Anything which came about in my absence?\"\n\"Nothing that won't keep,\" Arthur answered.\nDinner was more lavish than Arthur might have preferred, because Agravaine's tastes were not for roasts and bread, but for pheasants and rare cheeses, and fresh fruits brought by traders canvassing Albion for coin. They ate and talked of strategy and battle preparations, and ways to increase the size of Camelot's army without becoming a kingdom willing to pay mercenary knights. Arthur enjoyed the company, but the true purpose of his dinner invitation weighed on him every moment throughout the meal, until finally he stopped Merlin from refilling his goblet and said, \"Merlin, you may leave us.\" \nMerlin gave a quick nod and took his leave. \n\"Something you wish to discuss, my lord?\" Agravaine said, watching Merlin go. As always, his gaze was sharp and assessing, tracking Merlin everywhere he was in the room. It was not until the doors closed behind him that Agravaine relaxed. \n\"Something did happen while you were away, Uncle, and it concerns Merlin. I felt it would be best for all concerned if you were aware of his new station, although it's my intention to keep this a private matter.\" \n\"What do you mean, his new station?\" Agravaine set his goblet down. \nArthur took a sip of ale and said casually, \"While you were away, I made the decision to take Merlin as a consort for the next year, while I move past the unfortunate events with Guinevere. I will not be entertaining any suggestions of marriage during this year while we are hand-fasted.\" \n\"Hand-fasted?\" There was something dark and ugly in the way Agravaine said it. \"To a servant boy, of all things? How could you do something so utterly foolish, Arthur?\"\nArthur raised an eyebrow. \"Surely you must have taken comfort in a warm body at the end of the day, from time to time. This cannot be something unfamiliar to you.\"\n\"Of course I have,\" Agravaine snapped, \"but I have somehow resisted the urge to marry each and every one of them beforehand.\" \nArthur ignored the implied insult and said, \"This is not a marriage. It is a hand-fasting, according to ancient tradition, and it offers certain protections to my consort.\" \n\"To whom? To Merlin?\" Agravaine scowled. \"He is the king's manservant; he can hardly be more protected.\" \n\"While that may be true, Uncle, it will not satisfy my honor to take him to bed as though he had no meaning.\" \n\"Honor? Meaning?\" Agravaine said, incredulous. \"We are talking about a servant here, Arthur. He is yours to take as you see fit and as often as you like. The idea that you have bound yourself to this boy is-\"\n\"He is not a boy,\" Arthur said steadily, though a surge of fury rose in him at the way Agravaine spoke of Merlin, \"and while I have allowed you great latitude in your counsel to me, Uncle, you would do well to remember which of us is the king. \" \nAn awkward, chilly silence fell, one Arthur was not inclined to break, as it was Agravaine's ridiculous prejudices which had caused his overreaction. \nWhen Agravaine spoke, his jaw was clenched tight, but his tone was more measured. \"The last time we had a conversation of this nature, sire, it was about Guinevere. You informed me in no uncertain terms that you planned to marry her, and you can plainly see the disaster that decision wrought. So I think I might be forgiven for questioning your judgment when it comes to matters of the heart.\" \nArthur opened his mouth to object to Agravaine's characterization of things, to insist again that this was nothing more than Merlin's warm body in his bed, and found that the words would not come, because it wasn't true. More than this, he was struck by two truths, in rapid succession. First, Agravaine could not possibly understand what was happening here, because Arthur barely understood it, even while he was in the middle of it. And second, it didn't matter a damn whether he understood it or not; Merlin was his, and that made it a matter of the heart, whether Arthur wanted it seen that way, or not. \nSo he closed his mouth, and pushed back his chair. \"This conversation is at an end. You will keep this information to yourself; if I should find you have shared my private affairs with any other, you will find yourself banished from my presence. Is that perfectly clear?\"\n\"Perfectly,\" Agravaine said, making no move to rise. \n\"Very well,\" Arthur said. \"Then I will see you in the morning, at council.\" \n\"Sire,\" Agravaine said, inclining his head. The blatant disrespect didn't trouble Arthur. This was the first time he had had to set Agravaine back so harshly in his place, and when morning came, he would see how well Agravaine had accepted his king's command. \nWhat did trouble him was the idea of Merlin being regarded as nothing more than the king's plaything, and he turned it over in his mind all the way back to his chambers. \nMerlin was waiting there, squinting at a piece of parchment on which numerous lines had been written and crossed out. \"Hello,\" he said, brushing the quill's worn feathers over his lips. He looked Arthur over head to toe, and said, \"I take it things didn't go well.\" \n\"They went as well as I expected,\" Arthur said. He removed his belt and tossed it across the room, only just suppressing a grin at Merlin's long-suffering eye roll. \"I had thought to find you naked in my bed, but here you are doing -- what is it you're doing, exactly?\"\n\"Writing the speech you're giving to the tailors' guild tomorrow,\" Merlin said. \"Buttons and laces, frills and frippery.\"\n\"Surprisingly interesting thing, clothing,\" Arthur said, his hands already working to divest Merlin of some. \"Very complex.\" \n\"Very,\" Merlin agreed, sliding out of his chair and straight into Arthur's arms. Arthur wasted no time plucking the rest of Merlin's clothing off, noting with pleasure that Merlin's feet were already bare, and kissed him backwards toward the bed. \nMerlin stripped off Arthur's shirt before climbing on, and Arthur stopped for a moment to toss off his breeches before following. \"What would you like?\" Arthur asked, covering Merlin's mouth with soft kisses before he could speak his desire. \nWhen finally Arthur let him have breath, Merlin stretched his arms over his head, pushing against the bedposts, and sprawled wantonly, making his intentions quite clear. Arthur took in a long breath as Merlin said, \"Tonight, I want it to last.\"\n\"Are you implying,\" Arthur asked, \"that there is some difficulty with my stamina?\" He reached under the pillow and pulled forth the salve, knocking it open with one hand. \n\"No,\" Merlin said, wriggling a bit as Arthur's slick fingers slid inside him. Arthur loved this moment, when Merlin's body opened for him and Merlin began to lose himself in sensation. \"It's just that -- oh, there, Arthur!  -- I seem to recall that you were not able to outlast me, these last few nights, and--\" Merlin broke off, closing his eyes, one lip caught between his teeth as he fought for control. \n\"We shall see,\" Arthur answered, taking up the challenge. He slid inside Merlin with a long, delicious thrust, slow and merciless, fighting not to drive deep too quickly. Merlin spread his legs wider, and at that moment, Arthur slid his arms beneath Merlin and lifted him, drawing him up in one smooth motion until Merlin was in his arms, thighs spread wide and Arthur seated inside him. Merlin gasped and dropped his forehead to Arthur's shoulder, his breath coming in hitching catches. Arthur held him there, waiting. \n\"Bastard,\" Merlin mumbled into Arthur's skin, his breath raising goosebumps. The way he was so free with his speech, so utterly unconcerned about Arthur's reaction, sent a shiver down Arthur's spine, and he smiled. After a moment, Merlin lifted his head and kissed Arthur fiercely, as Arthur ran his hands up Merlin's bare back and struggled not to fuck him within an inch of his life. \n\"Arthur, move,\" Merlin demanded, his eyes locked on Arthur's, commanding. \nArthur lifted his chin, smiling slowly at the spark of challenge in Merlin's eyes, and thrust slowly, lifting his hips. Merlin drew in a slow, hitching breath and lifted his chin, a mirror of Arthur's challenge. \nTo Arthur, he was strong and beautiful this way, his thighs spread open across Arthur's, hips rolling against Arthur to drag his cock deeper inside. \nMerlin's eyes fluttered closed against the pleasure, and he gasped out a series of high, soft breaths, losing the battle to stave off his orgasm until Arthur came. He was shuddering in Arthur's arms, and as his head tipped back, Arthur leaned in to press kisses to his neck, to the base of his throat. Merlin's head rolled to the side, and he slid a hand up into Arthur's hair, pulling him up to press their mouths together. \nArthur kissed him deeply, pressing into Merlin faster now. His own hands were trembling against Merlin's skin, and they moved as one, all pretense of making it last forgotten in the rush toward ecstasy. It never lasted long for them; it was an all-consuming fire, heat and light and only ashes in its wake. \nWhen Merlin came, untouched, he stifled his low cry against Arthur's mouth, and they kissed, lazy, until that fire built inside Arthur and he could no longer hold back. Five quick, deep thrusts, and he was coming, Merlin's soft whispers against his ear his anchor as he floated on the pleasure. \n\"Good thing I didn't make you promise,\" Merlin said, as they held one another. \n\"I never make promises I don't keep,\" Arthur agreed, kissing him once more as Merlin slowly lifted off him. \nThey cleaned each other off with the corners of the sheets, Merlin giving him a fond, annoyed look as Arthur shoved it disdainfully to the foot of the bed and pulled the coverlet up. \"I will still have to wash that tomorrow,\" he said, and Arthur gathered him into his arms. \n\"Yes, well. It is your job, after all, no matter how horribly you do it.\" \nMerlin snorted with quiet laughter, and settled down after a moment, tucked against Arthur's side securely. \nThey were both nearly asleep when a pounding sounded at the door. \"Sire!\" \nArthur was awake in an instant, his hand going to his dagger before he recognized Leon's voice. \"A moment,\" he called, out of bed and into his breeches in the blink of an eye. Merlin did not need to be told; he slipped out of bed and into the shadows by the wardrobe, where he could not be seen. \nArthur threw open the door, still bare-chested, and Leon gave him a bow. \"My lord,\" he said. \"I'm sorry to disturb you, but the patrol was stopped on the road by someone claiming to have information about an invasion of Camelot. She was most urgent, but she demanded to speak with you personally. She specifically asked me not to inform Lord Agravaine.\" \n\"It takes bravery to demand a specific audience with the king,\" Arthur said, gathering up his tunic and belt. \"Where is she?\" \n\"In the throne room. Sire,\" Leon said, with a hand on his arm. When Arthur turned his questioning gaze to Leon, his first knight said, \"It's Guinevere.\"\n\n\n\n\n\nIV.\n\nLeon was waiting with Guinevere in the Council Chambers when Arthur and Merlin arrived. By Arthur's request, no one else was present. Easier to keep secrets when no one knew them in the first place. \n\"Can the men of the patrol be trusted?\" Arthur asked Leon, who nodded. \n\"They are my men,\" he said quietly. This told Arthur all he needed to know; Leon's men were as loyal and true as he was, and would keep silent if Leon commanded it. \nMerlin stepped away, blending into the shadows at the edges of the room, as Arthur approached Gwen and had his first good look at her. \nTo Arthur's eyes, Guinevere looked more or less the same, though her face was thinner, and she was wearing some sort of ridiculous outfit which made it plain she had been far from home these last few months. She was even standing in more or less the same spot where she'd been when Arthur last saw her. \nArthur could not reconcile his curiosity, and the wistful pang of tenderness he felt when he looked on her, with the cold twist of anger in his heart. She had defied her banishment, and come back here with some tale to tell. He owed it to her to listen; Merlin's words rang in his ears, even though Merlin was a silent shadow at the side of the room. No one would give more for Camelot or for you than Guinevere.  \nHe sat down on the throne, then leaned forward, elbows on his knees, hands clasped. She swayed toward him, then away, and seemed to steady herself under his scrutiny. \"Guinevere. You were banished from Camelot under pain of death. Do you understand the position you've placed me in?\"\n\"Of course I do, sire.\" She looked directly at him then, and the depth of sadness there sent a wistful pang of tenderness through his heart. \"And the position in which I have placed myself.\" \nIn the dim light, she seemed drawn, and not well. It was no longer his place to worry over her; she had removed all obligations in that regard, but his regard for her was not some habit to be broken. Time and patience were all that would change his heart. \nBut there was business at hand, and it would not keep. \"Very well.\" He sat back, and said, \"Deliver your news, then.\" \n\"Your uncle is planning treason with Morgana,\" Gwen said, and even as Arthur's stomach dropped down through the floor, she added, \"And with the warlord, Helios. They are in league together.\"\nAt every turn, someone seemed determined to cause him doubt and grief over his last remaining family. He didn't look at Merlin -- couldn't. Instead he let his anger well up into his words. \"How do you dare make such an accusation?\" Arthur demanded, clenching the arms of his chair.\n\"Because I have seen it, with my own eyes. I have heard Morgana planning strategy, with Helios. I have been hidden in the woods since I escaped from Helios' camp, and-\"\n\"He held you prisoner?\" All of Arthur's protective instincts rose within him, and he looked more closely at her, searching for damage both visible and harder to detect. \n\"He did not harm me,\" Gwen said, holding out a placating hand. \"He did not know who I was, until after I was gone from there.\" \n\"What proof do you have of my uncle's involvement in any plot against Camelot?\" Arthur forced himself to say the words, bitter to the taste though they were. \"He was against my marriage to you from the beginning. Perhaps this is nothing more than your attempt at retribution.\" \n\"You know I would not,\" Gwen said, softly reproachful, and Arthur could feel the heat of the red stain spreading over his cheeks. \"I have seen him, in the woods, riding out to meet with Morgana. Helios' men are assembling in the deep forest. I believe they are going to attack Camelot, with Lord Agravaine's aid.\"\nFinally, Arthur turned his head and caught Merlin's eye, his head spinning with the implications. Merlin had been so certain Agravaine had stolen the castle's defensive plans, even in the face of Arthur's rage and his hurt, and had risked banishment to press the point. Merlin said nothing, but his eyes shone in the dim light, and where Arthur expected to see triumph, there was nothing but sorrow. \nWith a lurching, sick feeling, Arthur realized he had been the worst kind of fool: one who ignored the advice of wise friends in favor of the counsel of family he barely knew. \nStill, it remained to be seen if there was truth to it. Unlike the last time he had been confronted with such suspicions, only to sweep them aside, he would get to the bottom of it, and would know once and for all if he had been under the sheltering arm of a traitor. \nHe looked at Gwen, and gestured to Leon to help her to her feet. \"If what you say is true, then your banishment will be lifted and all your rights restored,\" he said quietly. \"Until such time as it is proven, you must remain exiled, lest Agravaine grow suspicious.\" \n\"I understand,\" Gwen said, her face brightening with hope. \nSomething in Arthur could not permit the spark to grow, not without damage to them all. He stepped closer and pitched his voice for her ears only. \"This changes nothing between us, Guinevere.\"\nThe spark in her eyes dimmed and died, and she lowered her head. \"I expected as much. Arthur, truly, I did not return with any hope in my heart for a return to what we were. I came to warn you, nothing more.\" \nArthur looked into her eyes. He had known her many years, and known her well; what he saw when she gazed at him awakened something soft and vulnerable in him, and brought back a flood of confused feelings. He doubted she knew her own heart, because he barely knew his own. It was this realization that made him say, \"It is best you know -- there is someone else, now, and I have made a promise I will not break.\" \nHer flinch was subtle, and struck Arthur to the core, but it was the same as pulling the shaft of an arrow from a wound: necessary, so healing could begin. He stepped away and said, \"Elyan and two of Leon's men will take you to a safe location, and will come for you when the time arrives.\" Arthur glanced up and said, \"Merlin.\" \n\"Sire?\" Merlin stepped from the shadows, favoring Gwen with a small, warm smile, one she returned immediately. \n\"Do you think your mother would mind some company, for a time?\"\n\"I think she'd be happy to see Gwen again,\" Merlin said, giving Arthur the kind of fond, proud smile that he'd grown to cherish. Arthur looked from Merlin to Guinevere, and something fluttered unpleasantly in his belly.\n\"Merlin, take Guinevere to the dungeons by the least traveled corridors and hide her there out of sight for the time being, until we can arrange escort to Ealdor. Return to my chambers as soon as possible. At all costs, avoid my uncle and his men. I'm sure you know all the ways to stay out of sight.\"\n\"Sire,\" Merlin said, failing utterly to deny that veiled accusation. He guided Guinevere toward the exit at the back stairs, with one hand gently on her arm. She looked back at Arthur one more time, her face fallen into a mask of regret and resignation, and Arthur held her gaze until she turned away. \nWhen she was safely off with Merlin, Arthur turned to Leon and said, \"Find the others and send them to my chambers -- but quietly, Leon.\"\n\"Sire.\" With that, Leon was off, following Arthur into the corridor, where they parted ways. Arthur took the back stairs two at a time, up past the ladies' chambers and toward the high hallway behind his chambers. He descended the narrow stairs. slipped around the corner and let himself into his chambers to await the others, who arrived one by one in great stealth -- Leon, Gwaine, Percival, and Elyan last of all. Elyan's face was a study in careful composure. Arthur had no reason to distrust him, but he knew all too well what it was to be torn between family and duty. \n\"The door,\" he said to Elyan, who barred it and came to sit with the others around Arthur's table. Arthur wasted no time; he delivered Gwen's message and waited for the reactions to pass before diving into the meat of the problem. \n\"I believe Gwen is sincere in the information she brings. What remains to be seen is whether there is any merit to her accusations. Agravaine must be shadowed day and night, his movements carefully observed. He is no fool, and will notice any attempts to track him if we are not careful.\" \n\"Perhaps we could assign one of my knights to his guard,\" Leon said. \n\"He uses only his own men, come from his estates,\" Arthur said. \"He will never trust any others.\"\nA short silence fell, and then Gwaine said, \"I've suspected him since Gaius was abducted, but I didn't think you would ever come to believe it.\" \n\"I haven't said I believe it,\" Arthur said sharply, fixing Gwaine with a hard look. \"We were wrong about Gaius; I don't want to make that mistake again.\" \nThe queasy feeling in his belly was stronger, now, as Arthur thought back over the events of the last year, since Uther's death. One betrayal after another, and Arthur had never questioned any of those in this room, or Merlin, for that matter. The men on his council were the remnants of his father's council, and had been unfailingly loyal to Uther as well. The only outsider was Agravaine. \nSome small part of Arthur had always had a nagging suspicion, but Agravaine had turned them all so neatly aside. If it was true, Arthur was as much to blame as Agravaine, in his own way, for being blind and stubborn, and too ready to trust a virtual stranger because of blood. \n\"If he is riding out at night, one of us can take the watchtower nearest the south and east gates, and one can wait below,\" Percival said. \"If he goes, a simple signal to the man below will tell him to follow.\"\n\"That might work,\" Gwaine said. \"He's unlikely to use the north gate, with all the traffic, and the west gate is closed.\" \n\"There are so many ways in and out of this castle,\" Arthur said, \"that he could come and go by a different route every day and night, and never be seen. No, the only way to see what he's up to is to have him followed.\" \n\"We will be noticed,\" Elyan said. \"It's a certainty, and once he notices, he will stop.\"\n\"What about Merlin?\" Gwaine suggested. \"He's a bit of a creeper in him.\" \n\"Merlin is the clumsiest, most obvious person I have ever met. He's hardly unobtrusive. Besides, even Merlin can't watch him day and night. Though he might be able to take a night watch, from time to time, if others of you assist with this duty.\" Arthur sighed. \"I will think on the problem. All of you, as well. We can't risk meeting in any organized way again, or Agravaine will begin to wonder why all the other senior knights are excluded from my company. We will discuss matters on patrol and on the practice field, is that clear? No casual conversations. No discussions at the tavern,\" Arthur added, with a knowing look at Gwaine. \n\"Understood, sire,\" they each murmured, just as the doors rattled. Arthur motioned them all back and approached the doors, to hear Merlin's annoyed, \"Arthur?\" on the other side. \nHe lifted the bar and Merlin came in, saying, \"She's in the darkest corner of the lowest storeroom, waiting.\" \n\"Elyan,\" Arthur said. \"Take her to Ealdor, and ensure Hunith understands what is at stake.\" \nWhen Elyan had gone, Arthur turned to Leon. \"Pick two trusted knights, for now, and position them in the watchtower; if Agravaine rides out of one of the main gates without notice, we may not be able to follow, but we will at least know he is up to something.\" \n\"Sire,\" Leon said. And then as Leon and Gwaine left, Arthur and Merlin were alone. \n\"I was thinking,\" Merlin said, stepping closer. \"I can follow Agravaine in the evenings. I would--\"\n\"We discussed it already,\" Arthur said, more abruptly than he really meant to. \"Your place is here.\" \n\"But Arthur, I can--\"\n\"I don't want to discuss this any further tonight,\" Arthur said. The tiredness he'd felt before, when he was on the cusp of sleep, began creeping back into his bones. He cupped his hand against Merlin's cheek, noting the way Merlin's eyes fluttered closed at his touch, and said, \"Come to bed.\" \n**\nThe next two weeks passed in a flurry of work and unfortunate intrigue. Arthur's attentions were divided between the problems of governing his kingdom, and the problem of the traitor in their midst. After more discussion, Arthur had decided that Merlin and Elyan would do their best to shadow Agravaine as much as they were able in the night, taking turns on the night watch because it was the most likely time for Agravaine to leave unobserved. Arthur had Merlin bring Gaius into their confidences, and so Gaius was able to conceal Merlin's whereabouts when necessary. \nMerlin was determined to stick to Agravaine like honey, and as a result, did not complain, no matter how late in the night he was outside Agravaine's chambers. He would stumble into Arthur's room in the morning, Arthur's breakfast in his hands and dark bruised shadows beneath his eyes, and Arthur would make him sit and have some of the food. His own appetite was much diminished since the need to spy upon his uncle had come about. \n\"He didn't leave,\" Merlin said one morning, yawning as he tried to rake ashes from the cold fireplace. He was slower than usual, Arthur noticed; he dropped the brush two or three times. \"It's almost as if he knows I'm there, but I've been careful, there's no chance of it.\" \n\"Come up from there,\" Arthur commanded. Merlin turned his head and gave Arthur a puzzled look, but he stood, still holding the brush. Arthur took it from his hand and set it on the hearth, then shoved Merlin toward the bed. \"Get in,\" he said, moving toward the window. \n\"But I have your--\"\n\"In, Merlin. Now.\" \nMerlin stood there swaying for a moment, before he lifted his tunic over his head and crawled into the bed, between the sheets Arthur had left mussed and warm. Arthur tugged the curtains closed, and threw the sheet over Merlin, who turned his face into Arthur's pillow and sighed deeply. In a matter of seconds, he was asleep, his breathing even and regular. \nArthur stood watching him for some time, one shoulder leaned into the bedpost, before he left quietly, locking the door behind him. \nBecause Merlin had other duties to attend to, most evenings Arthur slept alone, and he found he missed Merlin in his bed, his incessant chatter, even his insulting prattle about all Arthur's faults. It was disappointing to have a long day, and not be told every little thing he might have overlooked. Some nights, he stared at the canopy all night, mind racing across every detail of the day, things he would have told Merlin, if Merlin were there with him. He often rose and stood staring at the city's perimeter plans and drawings of the siege tunnels, retrieved from their place of safety after Gwen's arrival. It made good sense to examine them, to think of where Camelot's weaknesses might be, since Merlin had been so certain Agravaine had taken them. \nHe did not share those thoughts with Merlin, or his analysis of what he found in the hours he pored over the documents. There was no point in raising the specter of betrayals and accusations, when he could not turn back time and change how it had unfolded. \nOn those nights when Elyan lurked in the corridors in Merlin's place, it was a great comfort to Arthur to return to his chambers and take Merlin his arms, to draw him down into the soft sheets and talk quietly about the day. \nThey never spoke of Agravaine, except in the vaguest terms. Nor did they speak of Guinevere. It was as if they had agreed upon what they might safely talk about, but without words. Often, long after Merlin had fallen asleep, his head pillowed on Arthur's arm or belly or chest, Arthur found himself drifting off into peaceful sleep, reassured by Merlin's warmth next to him. \nMerlin began attending council again, standing next to Arthur, silent but intent upon the proceedings. Arthur watched Agravaine's eyes flicking to Merlin often, and wondered why his attention remained so focused there. Once or twice, Arthur was tempted to solicit Merlin's opinion, particularly when Agravaine was being condescending on a matter involving the king's commands. The subtle undertone of manipulation -- your father would not have reacted so -- was starting to grate on his very nerves. \nIt was inevitable, then, that he would indeed snap. On a late morning, as the council pored over the grain reports and the grim news that there might not be enough stores to bring the people through the winter, Agravaine tested his patience once too often. \n\"Let those who have provided have the lion's share; the rest must fend for themselves,\" Agravaine said mildly, as if it was the most reasonable thing in the world to allow a quarter of Camelot's people to starve in the cold. \n\"You would cast aside those who are most in need? This is your solution?\" Arthur said. \n\"It is the only reasonable course of action, sire,\" Agravaine said, as if Arthur were unable to see the truth of it. \"Your father--\"\n\"Merlin,\" Arthur said, gesturing him forward. \"You are from a small village. You know what a harsh winter can do to the people. What do you think of my uncle's proposal?\"\nA small gasp went up from the table, barely repressed by his advisors, as Merlin stepped hesitantly next to Arthur's chair. Arthur's lips thinned into a hard line, and he refrained from calling them all out. Most of them knew Merlin's value, social protocol be damned. \n\"Perhaps the farmers whose crops have failed can contribute in other ways,\" Merlin said. \"They can harvest the crops of their neighbors, or can give service inside the citadel during the winter. That way no one is less worthy, and all can receive their fair share.\" \nArthur had a moment to admire how respectful Merlin could be, when it was important to him -- important to Arthur -- before Agravaine pounced. \n\"Their fair share of something they haven't earned and aren't entitled to,\" Agravaine said. \"Spoken like the provincial boy you are, Merlin. If we feed everyone, we will end up feeding no one. Or perhaps you think the stores will multiply themselves by magic?\" \n\"Of course not. But it will seem so, if we begin rationing now,\" Merlin said immediately. \"Stores don't multiply by magic. They multiply by maths. Of course, that is up to the king.\" \nArthur fought the tremendous urge to smirk, and instead gave Agravaine an expectant look. \"Can you think of a better solution, Uncle? Because casting our own people out is not a solution I will ever accept.\" \n\"Rationing will not be easily tolerated by the people, sire,\" Agravaine said, his tone much more reasonable and placating, now that he could see the direction Arthur was heading. Arthur could see him fighting not to watch Merlin as he withdrew back to his place of silence at the side of the room. \n\"It will be more easily tolerated than death.\" Arthur felt the bone-deep certainty which always accompanied a good decision. \"We'll begin immediately. Uncle, you will write the appropriate proclamations, and I will walk the lower town tomorrow, to answer the people's questions.\" \n\"Sire,\" Agravaine said, but Arthur had had enough, and pushed back his chair. \n\"Now that this is settled, I will expect a full accounting of the stores, and the rationing portions, by the turn of the moon. Gentlemen,\" he said, nodding to the advisors. Gaius' nod, which had been somewhat more shallow than usual ever since Merlin had taken to Arthur's bed, was returning to its respectful posture -- or perhaps that was just Arthur's wishful thinking. \nIn any case, he did not mention it to Merlin, who had grown touchy on the topic of Gaius, and several other subjects besides. \nIt was not as if Arthur could fail to know the cause, but he was at a loss to know how to begin speaking of it. \nThat same evening, as Arthur polished off a slice of roast, Merlin sat at the table lost in thought, his own meal untouched. Arthur pushed his plate away and regarded Merlin, the way he seemed far away. As far as Ealdor, perhaps. \n\"Your suggestion this morning was a useful one,\" Arthur said, wiping his hands on a napkin. His words seemed to rouse Merlin from that deep place no one could follow, and like a statue returning to golden life, he blinked and turned his head toward Arthur. \n\"Yes, well, it could hardly have been worse than what you were listening to, could it?\" He cocked his head to the side, and Arthur narrowed his eyes, for effect. \n\"Don't get above yourself, Merlin. It's not as if I'll be asking your opinion often. I merely wanted to get a rise out of Agravaine.\" \n\"Good job there, then,\" Merlin said, subtly pushing his platter away, as though Arthur would not notice if he did it in tiny movements. \"Now he hates me even more than before.\" \n\"Merlin,\" Arthur said sharply, then stopped. He had started the conversation, and the gut-twisting doubt and disloyalty washed over him anew every time he spoke this way of Agravaine. They still had no proof, and Agravaine had made no moves to confirm Gwen's accusations. \n\"I've had a message from my mum,\" Merlin said, drawing Arthur back into the moment. \n\"Is she well?\" Arthur asked. \n\"Yes. She is,\" Merlin said, and the subtle shift in his tone told Arthur the subject they referred to was not Hunith. \"Mum says that things are going along like normal, and not to worry.\" \n\"That's good to hear.\" \nThe muscle in Merlin's jaw jumped once, twice, and then he said, very softly, \"Arthur, when Gwen is proven right and this ends, I will release you from your vow.\" \n\"I did not ask you to do so,\" Arthur said, the words coming faster than the thought behind them. \n\"A king should not have to ask,\" Merlin said. He drew invisible patterns on the table top with his fingertips, pressing down hard on the rough wood. When his hands stilled, and he looked up at Arthur with those keenly observant eyes, their color shifting between shades of blue in the firelight, the jolt of emphatic denial that went through Arthur took his breath away. \nHolding Merlin's gaze, Arthur said, \"I made a promise to you, Merlin, and I intend to keep it, for the time which remains.\" \n\"But Arthur, we are not formally bound, it's--\"\n\"Enough,\" Arthur said, without any heat in his tone. \"I've told you my intentions. If you wish to be released from the hand-fast, then you need only say so, and it is done.\" \nEven in the offering, Arthur could feel the bitter coldness of loss creeping into him. \nMerlin said nothing for a time, his gaze fixed on the fire. Arthur was content to wait. They had hurried into this thing, this...whatever it was, between them...and perhaps it was not Merlin's desire to see it through. \n\"I don't,\" Merlin said softly. \"Wish to be released.\" \nArthur swallowed hard at the look of quiet hopefulness on Merlin's face. Words were so useless; they only ever added confusion, even when meant to clarify. He stood and held out his hand to Merlin, and drew him to the bed. \nMerlin's body was always a source of delight for Arthur -- the way he arched under Arthur's hands, and the way his hands slid into Arthur's hair, petting, as if afraid to clutch too hard. Arthur was just as happy to submit to Merlin's mischievous explorations, a nip of teeth here, a long wet swipe of tongue there, and to fall apart in his hands. \nThis night, though, he wanted something more. \nHe pressed Merlin belly down into the mattress, and began worshipping him with his mouth, kissing the angled curve of his jaw, the soft skin of his neck where it swept into the slope of his shoulder. Merlin shivered, reaching back for him, but Arthur trapped his wrists against the bed, the very lightest pressure. \n\"No,\" he said, in a soft purr just above a whisper, and then withdrew his hands, sliding them up Merlin's arms, and down his sides. When he stole a kiss from Merlin, his cock firmly nestled against Merlin's arse, Merlin's hands twitched against the sheets, deprived of touch. Arthur smiled into the kiss; there were few places Merlin would actually listen to his commands, and he was pleased this was -- for now -- one of them. \nHe made good use of Merlin's obedience, marking and mapping every inch of Merlin's spine, the ticklish places at his ribs, the swell of his arse, where he stopped and watched the flex of Merlin's spine above him, the pull and press of muscle as Merlin fought to be still while Arthur prepared him. Finally Merlin huffed in impatience, and Arthur knew he was moments away from turning over and taking liberties with Arthur's very willing person. \nIn a smooth motion, he rose up over Merlin, supported on his forearms so he was still pressed skin to skin against Merlin's back, and slid into him carefully, slowly, controlling the forward press in time with Merlin's tiny gasps of pleasure. He stroked forward a few times, eyes closed, his mouth open against Merlin's shoulder blade, all speech deserting him. Merlin was his, to have, to take, and he would not give it up easily, not on Merlin's ridiculous notions of noble sacrifice. \nBeneath him, Merlin lifted his hips, pressing Arthur deep, and murmured something into his pillow that sounded like, get on with it. As punishment, Arthur gave two quick, shallow thrusts that had Merlin thrashing a bit, losing all pretense of staying still. \nArthur pulled Merlin to his knees, then wrapped his arms around Merlin's chest, trapping his arms there, and pulled him up, at an angle from the bed. With long, slow rolls of his hips, he thrust deeply into Merlin, long, exquisite thrusts that pushed the breath from Merlin's lungs. Merlin shuddered and tried to catch his breath, but he could only gasp as Arthur's cock slid into him, deeper each time. It seemed to Arthur that he filled Merlin completely, until Merlin filled all his senses. \n\"This is ours,\" Arthur said, his palms flat on Merlin's chest, where the flickering heartbeat fluttered against his skin. The words came to him, unbidden. \"This is mine, and I do not release you from your vow to me.\" \nMerlin's short cry sounded punched from him, and his orgasm took Arthur by surprise, his cock pulsing against his belly even as Arthur tightened his hand around it. Arthur growled a sound of approval, and raked his teeth across Merlin's shoulders, his hips moving faster in their relentless circles, until he was fucking Merlin in earnest, hard, fast thrusts which never relented. Merlin was boneless in Arthur's grasp, aftershocks of pleasure shivering through him. \nWith his nose pressed to the nape of Merlin's neck, Arthur stilled and spent inside Merlin, his mouth open against Merlin's skin, his warm breath raising goose bumps on the skin beneath his lips. \nThey kissed for some time -- Arthur could not have said how long -- until sleep took them both, Arthur wrapped securely in Merlin's arms, the strength of a promise implicit in his touch.\n\n\n\n\n\nV.\n\nIt was pitch-black, dead of night, when the soft knock came at the back entrance to Arthur's chambers. Merlin was instantly alert, and Arthur less so. Merlin disentangled himself from Arthur and slipped from the bed, tugging on his clothes. He would move to the pile of armor still heaped in the antechamber, and it would only seem that he had stayed all night, finishing his task. \"Arthur,\" he whispered, shaking him. \"There's someone here.\" \n\"What?\" Arthur's eyes flew open, and he was out of bed in a blur of motion, his hand on his sword. A moment later, he opened the door to Elyan, who pulled his hood down and nodded to Merlin where he sat surrounded by gleaming armor and polishing cloths. \n\"He's finally done it,\" Elyan said, the glow of triumph in his eyes. \"Agravaine lit out at the darkest hour of night. I followed him to the woods -- he's there, still, meeting with the lady Morgana. I came back quick as I could. Arthur, he stables a horse outside the citadel, and he leaves through a lower gate, down in the bowels of the citadel. One of the siege tunnels on the city plans.\" \nMerlin had eyes only for Arthur, and the weary sadness which had claimed his features. He had known there would be a heavy price to pay when Agravaine's treachery was revealed, and he had not looked forward to what Arthur would endure as a result. \n\"Elyan, take me there, and then find Leon. He must begin to put in place the battle preparations we have discussed. If this has been going on for some time, then an attack is no doubt imminent.\" \nMerlin picked up Arthur's gleaming chainmail and the other pieces he'd set aside, for just this kind of moment. He dressed Arthur with practiced efficiency, fingers flying across the ties and buckles. \n\"Merlin, you will assist Leon and Percival with --\"\n\"As if I'll go anywhere but with you,\" Merlin interrupted him, because they'd had this argument, and Merlin had proven it, over and over again; it was just that Arthur was such a stubborn, annoying king that he apparently had to be reminded of it. He waited for the irritation to manifest on Arthur's face, but this time, Arthur had apparently decided to forego their usual argument. \n\"With me, then, but stay out of the way.\" \nIn case I have to kill my uncle in close quarters, was what he did not say. \nMerlin had his own opinions on that subject, which were best kept to himself, or Arthur would pass him off to Leon and that would be the end of it. \nThe lower dungeon passageways were damp and stank of rot, and the smell always reminded Merlin of terrifying things -- seeing Gaius for a desperate few moments after he'd been sentenced to die; sitting in the darkness himself, waiting to be executed at Arthur's hand for sorcery. He shouldered those memories aside and held his torch higher, minding the way ahead as Arthur followed the path he knew by heart, down to where Elyan had trailed Agravaine out into the forest. Elyan was long gone; he had turned at the downward path and gone to find Leon, to do what must be done if the worst occurred. \nMerlin was quite sure that the worst was only hours away, no matter the outcome with Agravaine. Another opinion that would not be heard by Arthur in his current, focused state, so he kept this one to himself as well. \nA guttering wall lamp was their beacon to the spot where Agravaine had left the citadel. Of course, he had copies of the keys. Merlin suffered yet another pang of guilt, because he was the keeper of those keys, and Agravaine had found some way to get around him. \n\"Smother the torch, Merlin,\" Arthur said, and waited until Merlin had put it out in the dirt before pulling Merlin next to him against the wall, on the side furthest from the door. Arthur's hand stayed on his wrist, and they breathed together, watchful. Merlin had seen Arthur this way a hundred times before, in the heat of battle and in the hours before it, but he had never sensed this kind of tension in him. \nThey did not have long to wait. A key in the ancient lock, just as the torch was guttering down to nothing, and the door creaked open in the fading light. \nAgravaine stepped in, and when he had locked the door behind him, Arthur stepped forward. \n\"Agravaine,\" he said. Not uncle, this time. A tiny thrill of triumph went through Merlin, but tempered with alarm, because Agravaine's oily smile was spreading across his face. \n\"Arthur! It is a surprise to see you here.\" \n\"No doubt,\" Arthur said, moving forward just a bit, so he was not trapped against the wall. \"Would you care to explain why you are sneaking in and out of Camelot's most remote siege tunnels, in the dead of night?\"\n\"It is not what you think,\" Agravaine said, raising an appeasing hand. \"I received a message from Morgana, and I went to meet with her, to discuss peace -- an end to enmity, Arthur.\"\n\"Did you?\" Arthur said. He had not drawn his sword yet, but Merlin knew it was a near thing. He shifted away from the wall as well, so he was not directly behind Arthur, and could clearly see Agravaine. \"I don't recall hearing of any messengers arriving. Did you not think to bring this message to me, to consider your king's response?\"\n\"I didn't want to trouble you with it, my lord,\" Agravaine said, slick as always. \"The business of making peace is often a long road, littered with false starts.\" \n\"Of course,\" Arthur said, nodding seriously. \"Or perhaps you thought I was so stupid I would not suspect you were in league with Morgana, until it was far too late.\" \n\"Sire, I thought we had put this issue to rest long ago,\" Agravaine said. He directed his calculating stare at Merlin, and Merlin could feel the force of his hatred beating against his skin like fists. \n\"Sadly, Uncle, that is no longer so.\" Arthur did draw his sword, now, and with the flat of the blade extended, pointed it at Agravaine. \"I will ask you to come with me, and account for your actions.\" \nAgravaine looked at the sword, and at Arthur, and his face transformed suddenly, into something malicious and real, as if the monster living beneath his skin had suddenly transformed and become visible. Merlin fought not to recoil from it; beside him, Arthur's body tensed, head to toe. \n\"Did you think that I would just trail along behind you like some docile stray cat?\" he asked, leaning back, his own hand on the pommel of his sword. \"Like your boy, who follows you everywhere, and lies down for you whenever you wish? You have made a grave miscalculation, Arthur.\" \n\"You will come,\" Arthur said calmly, \"or I will strike you down where you stand.\" \n\"I will not come, and you will not strike me down.\" Agravaine's sword was a blur of shining steel as it arced out of its scabbard. \"All these years I have fought and bled in my own territories, without Uther's help; did you think I was not your equal? I am more than a match for you, boy.\"\nArthur did not move. Instead, he adjusted his stance for one Merlin knew to be more comfortable, and asked, \"Why, uncle? You are my mother's brother. You know I was precious to her.\"\n\"You cost her her life, you arrogant whelp. You, and your father, the pair of you -- you sacrificed her on the altar of your own dynasty, with no thought as to Ygraine.\" Like lightning, pain flashed over Agravaine's features, swiftly replaced with thunderous rage. \"You took her from this world by your mere existence. Why should I not take you from this world in vengeance?\"\n\"I could not control that,\" Arthur said, but Merlin heard all that was not said, all Arthur's unshed tears and regrets over having been the instrument of her death, all the unanswered questions as to how he came to be, and why his father hated magic. \"I was a newborn babe. Had she lived, she would have loved me to the end of her days.\"\n\"But she did not live, and you are a reminder of all the things she loved, and that Uther destroyed.\" Agravaine lifted his sword. \"We shall not both leave here, Arthur. So let us do our business, and be done with it.\" \n\"So be it,\" Arthur said, and his sword arced in the air, ringing with a vibration Merlin felt in his bones as it clashed with Agravaine's deadly blade. \nThey could not circle one another well, or employ the best tactics of such a fight; it was close quarters, shoving and grunting, and Merlin scrambled back to be out of the way when Arthur swung wide, striking Agravaine in the shoulder. Agravaine merely grunted and returned a solid blow, which staggered Arthur back two paces before he countered. Merlin knew Arthur was the better warrior, but he also knew Agravaine would not fight fairly, and Arthur was under the handicap of affection for his uncle, who was all Arthur had left in the world to call his own blood. \nAt any other time, they would have been well-matched, but Arthur's will to win was not absolute, and the darkness was almost upon them, as the lamp faded to only the barest flame. And then Agravaine pulled a second knife from his belt, and as Arthur lifted his sword to strike a blow, Agravaine lunged forward, the knife point directed straight toward Arthur's heart. \nIt all flashed clear for Merlin in a moment of perfect clarity: the knife would strike home, and Arthur would fall dead at his feet, still as stone. There was no time to think, no time to do anything but react, and Merlin extended both his arms, directing magic through the tips of his fingers like streams of water. Agravaine seized, and then he was lifted from his feet and thrown sideways into the wall with such force that Merlin heard the cracking of each bone as it fractured to dust. He fell to the ground, dead, and the wall torches flared into bright, inescapable light, exposing the sight of him there. \nExposing Merlin's lies, and his crime. \nArthur stared at the body for a long moment, his features contorted with sorrow, and then he knelt and picked up the short knife which was still clutched in Agravaine's hand. Merlin watched him turn it in his hand, the blade flashing in the light; his knees did not quite buckle, but he sat down hard on the ground, and all he could do was sit, and wait, for Arthur's judgment. \nWhen finally Arthur turned his gaze to Merlin, it was a cool, detached look, something Merlin had never seen directed at him. There were layers of sorrow screaming beneath it, Merlin was quite certain, but this was not Arthur, his lover or his friend, not even his master. \nThis was his king. \n\"You have magic,\" Arthur said, watching him, his sword still at his side. \n\"Since I was born,\" Merlin said, and offered nothing more. He looked at Agravaine, and marveled at how easily it came to him, to kill a man, even now. His stomach turned and turned again, threatening to spew forth everything into the dirt beside him; he swallowed hard, and did not give in to that weakness. \nHe didn't apologize for the lie, because no apology would be enough. There was no need for a confession, because what Arthur had seen with his own eyes was enough to condemn Merlin to an immediate death. \nThere seemed to be nothing to say, so Merlin swallowed, and did not look at Agravaine's open eyes, or dwell on the rolling nausea bringing bile to his throat. Instead, he looked at Arthur's impassive face, his living, breathing body, and allowed himself a tiny measure of joy. \nAfter what seemed like an eternity there in the stifling close corridor, Arthur spoke, and it was not what Merlin expected. \"Does Morgana know about you? Your...magic?\"\n\"No.\"\n\"Then come with me,\" Arthur said, sheathing his sword and tucking the small knife into his belt. He took a long look at Agravaine's body, his expression as blank and impossible to read as Merlin had ever seen it. Then he stepped over it and strode back down the passageway, leaving Merlin to trot after him, his stomach churning with the unknown. \n**\nArthur was silent for the time it took them to climb up from the bowels of the citadel and into the open courtyard, and then he was transformed into a blur of motion and intent. \"You there,\" he said, waylaying the first knight who passed by. \"Gather these people together and begin blocking passage in from the western gate. Where is Leon?\"\n\"The battlements, sire,\" Sir Rothlan said, pointing up. The battlements were dark, but Merlin knew the watch was in place, and the archers had begun gathering. \n\"Hurry,\" Arthur said, releasing Rothlan with a brisk shake. He continued striding along, rallying the people and knights alike with simple instructions -- roll your wagon here, take up your axe and wait there -- and Merlin could do nothing but watch and marvel at how totally Arthur had become their king. \nHe did not look at Merlin, did not ask him to help, or send him on any errands. He continued moving without once glancing in Merlin's direction to be sure he was still there. Merlin supposed Arthur knew him well enough to understand that taking flight was no longer a possibility. Whatever Arthur asked of him, he would do.\nAfter that, once Camelot was safe...Merlin found he could not even think of it, for fear the blinding pain in his heart would cripple his senses. So he merely followed along behind Arthur, taking note of what was needed in case he was sent back to help here. \nThey climbed the interior stairs and met Leon on the battlements. \"Agravaine?\" he said at once. \n\"Dead,\" Arthur said, his voice betraying no emotion, even when Leon sighed out what might have been interpreted as a breath of relief. Merlin did not shrink from it; he stood taller, watching the muscles tense in Arthur's jaw, and the dull glint of his eyes in the dim light, like pieces of hardened steel. \"What is the situation?\"\n\"There are men massing at the edge of the woods,\" Leon said, turning back toward the wall. \"We haven't enough light to estimate their true numbers, but the shapes are unmistakable, and we have seen torches once in a while.\"\n\"So Gwen was right,\" Arthur said. \"An invasion.\" \n\"If it is Helios, he is known to have amassed a force of several hundred,\" Leon said. \n\"Yes, well, they will have lost their chief advantage, without Agravaine to open the tunnels for their ease of entry,\" Arthur said grimly. He reached out and took Merlin's arm in a grip hard enough to bruise -- hard enough, Merlin was sure, to snap an ordinary man's neck, if Arthur were so inclined -- and pulled him forward until his belly was against the wall, and he was looking out over the fields, and the dark forest beyond. \n\"Can you sense her out there?\" Arthur said, his voice deceptively soft. And Merlin knew who he meant; there was only one person whose presence there required Merlin's presence in kind. \nMerlin closed his eyes and let his magic reach toward the earth, the sky, all the world around them and everything in it, looking for traces of itself. It wasn't long before it found what it sought. \"Yes,\" Merlin said, swaying a bit, though Arthur's vise-like grip was painful enough to keep him solid and steady. \nArthur released him then, as if he was a snake who might turn and strike, but he didn't move away. Instead he stared out at the woods, as if he too could see and know what Merlin knew. \"All this time,\" Arthur said, half-question, half-accusation, and then nothing more, as he scanned the woods. \nMerlin's cheeks burned, but he held his ground, because to do otherwise was to invite immediate death, and he needed to be here, beside Arthur. \n\"What can you do with it?\" Arthur asked, and now he did turn to look at Merlin with a cold curiosity which made Merlin flinch. \n\"Whatever I've had to do with it, to save your life,\" he answered, and then it was Arthur's turn to flinch, but it was so imperceptible that no one but Merlin could have seen it. He knew Arthur's body so intimately now, every nuance of its pleasure and its displeasure, and the cold settled over him as he realized he had cataloged all of it he was ever meant to have. \nNow he would have to remember it, for the short time he was likely to live once this night was over. \n\"There are men in the citadel preparing to repel this attack,\" Arthur said. \"Good men. Men who are going to lay down their lives for Camelot.\" He watched Merlin. \"Will you do the same, for them?\"\n\"I will,\" Merlin said. He did not say, I have, because it wouldn't serve any purpose. He simply stood and waited for Arthur's judgment. \n\"How powerful are you?\" Arthur asked. Then, as if he could barely believe he was asking it, he swallowed and said, \"Can you stop an army?\"\n\"I...\" Merlin hesitated, and began thinking about the spells he could use to amplify power. But he knew immediately that it was the wrong tactic. He would have to do something specific; something to block the invaders from coming too close, or entering the citadel. \nHis silence seemed to unsettle Arthur, and Merlin quickly said, \"I'm not certain. I need a moment to think about how.\" \n\"My men can kill these men,\" Arthur said, his eyes searching Merlin's as if he was unsure of the truth he would find. \"We can take out our swords; I can send them to their deaths. I can bring their bodies back inside, and ring the victory bell with their broken corpses laid out in the street. But if it does not have to be, this one time, with Morgana's magic at their backs, then I will use you to end it. Can you do this thing, Merlin?\"\nMerlin was still thinking frantically, and then the idea occurred to him. \"It would be easiest to stop Morgana, but I don't know exactly where she is, and I can't-- I don't--\"\n\"Spit it out,\" Arthur said, impatiently. \n\"I think I can cast a wall of enchantment around the castle,\" Merlin said. In fact, he wasn't sure at all. He had never tried such a thing. The spell for it was in his book, which was still in its place beneath his bed; he had not dared try to summon the amount of power required for it, as it was very old magic, and Gaius had cautioned strongly against it. \nThe spell would likely kill him, if he did it right. Merlin supposed that was justice, in its own way. Perhaps Arthur would not hate him, then; if that was the best he could hope for, and he could save so many, then there was no question of it. \n\"There's something in my room I need,\" he said. Arthur gestured over one of the archers. \"A book, hidden beneath my bed. There's a loose board,\" he called after the man, who was already running off to retrieve it, at Arthur's curt shake of the hand. \n\"Can you do this, Merlin?\" Arthur was looking at him intently, and Merlin nodded, his heart pounding. To do magic for his king. For Arthur. He had dreamed of it for so long, imagined what it would be like to stand at Arthur's side and call forth his magic in the king's service -- what it would be like to be known in this way. To be wanted. \nHe could do this. \nThey stared at one another for long minutes, or so it seemed to Merlin. He memorized every line of Arthur's face, the way the soft breeze lifted his hair from his forehead and stirred it about, the way his hand rested upon the hilt of his sword. And then, all too soon, the knight was back with Merlin's book in his hand and a frightened look upon his face. \n\"Gaius wanted to know where I was taking it, sire,\" he said, handing it to Arthur instead of Merlin. \n\"Did he,\" Arthur said, handing the book to Merlin. Merlin's heart sank, for now Gaius' simple question had doomed him, as well. But there was no time for that; none of it would matter, if they were overrun.\nMerlin dropped down to the stones below and opened the book; Arthur crouched beside him, holding a torch now, and held the light forward. Merlin flipped quickly through the pages, touching the words he already knew. It was important to get it right, and he knew it. He slammed the book closed and said, \"You should have the others clear off. They won't be needed here.\" \nAfter a moment, Arthur looked to Leon and said, \"Have ten archers remain; the others should go down to the eastern defenses to assist there. You and your men will stay.\" \n\"Arthur,\" Merlin began, but the stern look on Arthur's face silenced him. \n\"Well?\" Arthur said, standing, as the last of the archers clattered by. \"What are you waiting for?\"\nMerlin nodded and stood, drawing in a deep breath. He stood close to the wall, bracing himself on it for support, and called to his magic. It rose up like a tide within him, stronger than brick or iron, stronger than steel, the strongest thing Merlin had ever known. He let it flow over him, surround him; he let it claim Arthur as its own, and listened with satisfaction as Arthur hissed out a surprised breath at its touch. Let him know it, now, in this last hour, before it was over; let him feel what he meant to Merlin. \nLike the growing whirl of a cyclone, it rose, until he could feel it at his fingertips, and he began to cast, throwing magic and words out into the air like water and straw, building invisible bricks no magic could ever touch. Certainly not Morgana's magic; she was powerful, but she was no match for Merlin. He had always known, somewhere deep in his heart, and now he was certain. The walls thickened and grew under his feet, the magic pushing into every block, every stone, every piece of glass and bit of steel. The magic knew Camelot was meant only for those who would live there in peace, and not for those who came to kill. \nHe could feel the magic winding down, nearing its end. Just a bit more was needed and -- \nGreen fire enveloped him like acid, throwing him to the ground. He was enclosed; he was burning, turning inside out like an old coat, and he scratched at his skin, his clothing, writhing about on the ground like a dog gone mad. He thought he heard Arthur shouting, screaming his name, but the pain was driving all else from him -- everything he was, every bit of magic, leaching from him. \nNo. Morgana. Her work. No.  \nHe pulled his hands in toward his chest and whispered to his magic, coaxing it out into the fear and pain, and it washed over him. Not enough to repel the spell Morgana had cast over him, but enough for him to breathe again, now that the iron bands of her power were easing. He got to his knees, then fell forward on his hands. To his left, he saw Leon and four knights restraining Arthur, who was silently struggling against them like a madman. \n\"Stop,\" he gasped, but Arthur did not stop; he shouted Merlin's name, and in that frantic cry, Merlin heard the end of Arthur, of them all, if he did not finish. \nHe must get up, he must, and get to the wall; he had to finish the barrier. \nOne agonizing inch at a time, he moved, until he reached the wall, and heaved himself up. He rested his elbow on the stones, closed his eyes, and whispered the last words of the spell, throwing everything behind it, all of his power, everything he was made of. All of himself, for Camelot. \nThe pain ceased, as if someone had run the well dry, and Merlin slid to the ground, his eyelids fluttering, black spots dancing before his eyes. \nArms encircled and cradled him; those were Arthur's arms, he knew, and Merlin let himself sink into them, just this once. He heard Arthur shouting, \"Find Gaius! Help me lift him!\" \nIt was the last thing he heard before he let himself fall into darkness. \n**\nThe sunlight was too bright when finally he blinked open his eyes and looked about, half-expecting to find himself in the dungeons, where sunlight made no sense. But he was in his old room, tucked under a soft blanket, and the place smelled of herbs and incense. He was alone. \nMerlin expected he might be alone quite a lot, from now on. At least, until his trial was over. Arthur would show him that much mercy, at least. But he had killed Agravaine, taking the question of justice straight from Arthur's capable hands, and he had used magic. Oh, how he had used it. His bones were sore from using it, and even at that, he could do nothing but smile to remember how it had come to him, how the magic had woven itself into the air and stone and earth, heeding his command. \nCamelot was safe, and Arthur was in no danger from Morgana. Gwen could come home. He had done well. \nThe door creaked open and Gaius appeared, carrying a cup. \"Merlin,\" he said, in a tremulous voice. \"I had begun to think we would not see you awake again.\" \n\"How long was I unconscious?\" Merlin asked, trying to sit up. \n\"Four days,\" Gaius said. He settled in the chair next to the bed and said, \"Can you take this cup, or shall I hold it for you?\"\n\"I can take it.\" Merlin reached out a shaking hand and grasped it carefully, then brought it to his lips. Water, mixed with something sweet, probably to kill the taste of whatever foul thing was in there. \n\"Just something to help you recover your strength.\" Gaius took the cup back and patted his shoulder. \"We've all been worried.\" \nMerlin let his head fall back to the pillow as the enormity of what had happened crashed over him. \"Arthur,\" was all he said, and the grim look on Gaius's face was all he needed to see to know where he stood. \n\"He has been here at least once a day, asking after you,\" Gaius said. \"He will be by again today. I will send word that you're awake.\"\n\"No, don't,\" Merlin said, now struggling to sit up in earnest. \"Not yet.\"\n\"He will want to know,\" Gaius said, a little too gently. \n\"He will have to try me,\" Merlin said, and shook his head when Gaius began to speak. \"He has no choice, Gaius. I'm a liar and a sorcerer. I've used magic. He will have to uphold the law.\" \n\"He asked you to use it, Merlin.\" \n\"He asked because he had no other choice. That doesn't mean I didn't break the law.\" Merlin sighed. \"Gaius, I need paper and quill. Please.\" \n\"You're barely strong enough to hold a cup. I hardly think---\"\n\"Please.\" Merlin looked at the sunbeam slanting across his blankets, and then at Gaius. \n\"Very well.\" \nBy the time Merlin was finished writing, the sunbeam had crossed the room and crept up the wall, and Merlin's hands were shaking so badly he could barely hold the quill steady. It was a long list, his many crimes. From the moment he had arrived in Camelot, he had been breaking the law, and now that the time had come to confess it all, he found himself shocked at the depth of his own disobedience. He felt no remorse, no sorrow; he had done it all to protect those he loved, and would do it again and again. \nIn the end, his confession used all of Gaius' parchment, and still it was not enough. It would never erase the biggest lie he had told: that he was ordinary, and beneath Arthur's notice. That he was normal. \nThat he was not magic. \nWhen Gaius bent to take the pages from him, Merlin said, \"Wait,\" and took up the quill again. At the top of the first page, he wrote, iron shackles, forged from cold iron, I can do no magic while I'm in them.  He thought a moment, and added, I give you my promise I will never use magic again unless it is at your command, and then set the quill down on the board across his lap. Gaius gave him a sad, strange look, but gathered everything up. \n\"Take that to Arthur, Gaius, please,\" he said. \"Please. Right away.\" \n\"All right,\" Gaius said, pressing a hand to Merlin's shoulder. \"Rest, in the meantime. I will bring you some soup.\" \nMerlin barely heard the door close, before he was asleep, exhausted and too numb to carry on. \nHe slept through the night, and in the morning, Gwaine was sitting by his bedside when Merlin opened his eyes, and the sight of him awake brought a joyful grin to Gwaine's face. \"Merlin!\" he said. \n\"Gwaine,\" Merlin answered, allowing his own smile to burst forth. It was good to see a friendly face, other than Gaius, who would be loyal unto death. Merlin feared for Gaius; he was implicated in his knowledge of Merlin's book. But he didn't fear for Gwaine, who would never allow himself to be taken prisoner for daring to visit Merlin. \n\"You've gotten yourself into a fine pickle, haven't you?\" Gwaine said, leaning back. \n\"I'm sorry,\" Merlin said. \"That I didn't tell you about my magic.\" \nGwaine tossed his hair. \"I don't care about that. Half the kingdom saw you use it, you know. They all know what you did for Camelot.\" He grinned. \"Would've been nice to know before everyone else, but I gather you've been keeping that secret tight to the breast, if the princess didn't know.\" \nShame made Merlin turn his face away. \"Yes.\" \n\"You've become a bit of a hero, you know.\" Gwaine leaned forward. \"Incidentally, I'm here on official orders from Arthur himself.\"\n\"Why?\"\n\"Not too clear on that. Either I'm supposed to protect the kingdom from you, or protect you from the kingdom. In any case, I don't think either is necessary, so if it's all the same to you -- I'll have some of that porridge Gaius is cooking up downstairs, and then you can tell me just how in the hell you managed to repel an army by waving your hands about in the air.\" \nMerlin couldn't help the laugh that found its way out, and that made Gwaine grin. \"Hungry?\"\n\"Yes,\" Merlin said, sitting up. \"Starving.\" He stilled, thinking of his confession. \"Is there any word on what's to happen with me?\"\n\"No idea. Arthur will be here himself, later today. Always is here, at least once a day.\" Gwaine suddenly found the lining of his glove fascinating. \"Perhaps this time he'll come up when you're awake.\" \nMerlin kept his opinion on that to himself. \nHe let Gwaine help him from bed, and eased himself to a standing position. His legs were still weak, and he wobbled, but his strength was slowly returning. He had expected the use of magic to cost him dearly, perhaps even take his life, but his survival had shown him he could use the magic, manage it, even at its most powerful. He would know how to control it, next time. \nAnd then it dawned on him that there would be no next time, and the dull knife that seemed lodged in his ribs twisted deeper, and stole his joy. \n\"Come on, then,\" Gwaine said, pushing open the door. Merlin took Gwaine's arm and let him help him down, his eyes fixed on the stairs in his caution. His legs were none too stable. \nAt the bottom of the stairs, he looked up, expecting to see Gaius. What he found instead was a room filled with flowers of all sorts, and food; baskets overflowing with bread and ribbons. \n\"What is all this?\" he asked, his breath coming too fast. \n\"This? Ah. Well, these are tokens from the people of Camelot,\" Gwaine said, guiding him to a seat on the bench. \"They've been coming day and night, bringing charms blessed in the Old Religion for your health, along with trinkets to cheer you and food to strengthen you.\" Gwaine crouched down before him and smiled up at him. \"They are grateful, Merlin. We all are grateful for what you did.\" \n\"Why has Arthur allowed this?\" Merlin said, staring at the bounty all around him. \n\"Because Arthur is no fool, no matter my personal feelings on the matter,\" Gwaine said darkly. \"The people have sent their message, and he heard it, loud and clear. He repealed the ban on magic this morning, at sunrise.\" \nMerlin's hands were trembling, suddenly, and Gwaine took his elbow. \"Merlin? All right, then?\"\nMerlin nodded, struggling to master the warring hope and fear surging through him. \n\"Good,\" Gwaine said. He let Merlin go in favor of dishing up two bowls of porridge, and set one in front of Merlin. \"Eat up, then. You look like a maiden about to faint. Can't have you looking so puny when the king stops by.\"\nMerlin scowled at him, but slowly dug in to the porridge, thinking of the magnitude of what had happened. In five short days, everything had changed. And when Arthur stopped by...well. They had a great deal to discuss. He turned the questions over and over in his mind: what Arthur might ask, all the truths he had been longing to tell, tumbling around his head like leaves caught in a whirlwind. He didn't fear death, now, or exile, but there were so many other things unresolved between them. \nHe had been waiting for this moment, it seemed, all the years he had served at Arthur's side, and now, the day had finally arrived. \nMerlin was more than ready to see Arthur, but Arthur did not come to see him that night, nor the three nights that followed. Gaius informed Merlin that Arthur asked after him, politely, at council. \n\"I've been given stern instructions that you're not to return to Arthur's service until you're summoned,\" Gaius told him. \"It's important to the king that you have time to heal.\" \nThat was when Merlin began to understand that the repeal of the ban on magic would, after all, have a price.\n\n\n\n\n\nVI.\n\n\"Sire, as a matter of policy, it would seem prudent that all magic users should register while within Camelot's boundaries.\" Lord Shelbourne pushed forward a list he had no doubt been working on until late in the night; Arthur had given his advisors very little time to work out the details of the new laws governing magic. \"The majority of us are agreed that it will shine a light into the secrecy which has surrounded magic these many years.\" \n\"It will also cause many of those who use magic to fear persecution.\" Arthur pushed back the list. \"It sounds like a tactic my father would have used. Have the magic-users register, and then use the list to eliminate them.\"\n\"The people know you are not your father, sire,\" Gaius said, his hand resting on the list. \n\"Do they?\" Arthur said sharply. \"It has been only one turn of the moon, Gaius, since I was as blind as he was, and twice as foolish about guarding this realm against a foreseeable danger.\" \n\"They do,\" Gaius said, and pushed the list back. \"You have never actively opposed magic as Uther did, Arthur. Not since you were very young, and even then only on your king's command.\"\n\"I have ordered the deaths of magic users,\" Arthur said. \"I've stood by and watched them burn. I am not so different from Uther.\"  \nThis time, the silence which fell around the table was not broken by attempts to persuade him of the differences, and Arthur was viciously glad. \nIt had been a short span of days since Merlin had nearly died on the battlements, proving his loyalty in the face of a betrayal so huge, Arthur had yet to fully process it. The kingdom's central law had been broken over and over, by one foolish, loyal, fiercely loving man, whose entire being Arthur had believed was devoted to him. He'd stood at Arthur's side these long years, and had never trusted him enough to tell the truth. This was not surprising; there was a time Arthur might have turned him over to the executioner. But that moment had passed quickly -- Arthur had been ready to die for Merlin for years, for the sake of Merlin, and not just because he was one of Arthur's people. \nThat left the issue of trust, and Arthur struggled with it every moment of every day. Merlin would never have harmed him; of this, Arthur was certain. But he had never really believed Arthur could know him down to the bone, all his secrets, all his truths, or he would have told Arthur before they pledged themselves to one another. He had held Merlin in his arms, had been inside his body. He had feelings for Merlin, complicated, annoying feelings, and no way of sorting out what he was possibly supposed to do with the mess Merlin had left in his wake when he saved Camelot and confessed to hundreds of acts of treason. \nWell, former acts of treason; the law was gone, now, safely out of the way, so that if Merlin decided to flee, Arthur was under no obligation to cut him down. But there remained the years of lawlessness Merlin had indulged in, to save Arthur's life. \nHe had no idea what to do with any of it, and no matter how much he thought on the problem, he kept coming back to the moment he had banished Gwen, and the stricken look on her face. He was not certain he could bear to see that same look on Merlin's face. \nHe barely knew anything, anymore. \n\"My lord, if I may -- the person best suited to answer some of these questions is Merlin. Perhaps we could--\" Sir Mortimer's voice died in his throat when Arthur fixed him with a look. \n\"Merlin is recovering, Sir Mortimer, and will not be asked to join this council until I have given approval. Is that understood?\"\n\"Yes, sire,\" Mortimer said, bowing his head. \nSeveral pairs of eyes fixed Arthur with a look he could only describe as reproachful -- Gaius, of course, with his ridiculous devotion to Merlin, but also Gwaine, and Elyan, and even Leon, who looked away quickly, but Arthur had still seen that faint frown on his face. \n\"Council is adjourned,\" he said abruptly, and shoved his chair back. \n\"But sire, we--\"\n\"Come to agreement on your list of laws, gentlemen, and I will consider it in due course.\" And with that instruction, he left them, stalking from the room as if he had just declared war on all the five kingdoms. \nThis, of course, was not far from the truth. Camelot's people were aware of the sorcerer in their midst, now, and word would travel outside the borders before long. Only those with weapons were forbidden to cross, the patrols had discovered; those who ventured across the border found they could not return with their swords intact. They melted into some sort of strange goo, if the knights tried. The same happened to axes, knives, and crossbows. Even Elyan's slingshot had not survived; there had been that unfortunate incident where it caught fire in his pocket. \nThe point was, now that Camelot was a free haven for magic users, other kings might take it upon themselves to send a few along to take the lay of the land, now that their swords were not of any use. \nThey needed laws to govern the use of magic. They needed Merlin, to explain what was possible, what was required, but Arthur could not make himself summon Merlin, could not allow him out of his perfectly comfortable prison of Gaius' familiar chambers and the courtyard below. Not yet. \nOnce he was in his own chambers, the door closed behind him and barred to the well-meaning George (who seemed suddenly and entirely awestruck by Merlin, and who had bizarrely turned ashen when it was suggested to him that he replace Merlin in the king's service), he pulled off his gloves one at a time and sank down in a chair by the fire. Every one of his bones seemed to be creaking. He was far too young for the immense weight which seemed to have descended on him. Worse than entire kingdoms at war; worse than his father's disapproval. Worse even than failing entirely to see a sorcerer who was standing right next to him for nearly eight years.\nHe was the liege lord of the most powerful sorcerer who had ever lived -- according to Gaius, anyway, although it was slightly possible that Gaius was a bit biased, given that he loved Merlin like a son -- and Arthur had no idea what to do with him. \nArthur closed his eyes and let the firelight warm his face. He could forgive Merlin -- would forgive him, of course. Merlin had given everything for Arthur, on more than one occasion. He was loyal to a fault, and although he was colossally stupid and could not be relied upon not to kill himself accidentally while trying to protect Camelot, he was Arthur's to protect, in every way. \nStill, it was hard to reconcile the man with laughing blue eyes, who had kissed him and spread himself open and touched Arthur with such adoration, with a liar and a deceiver. Merlin was in fact a killer of men and creatures, an assassin who had done Arthur's dirty work for him as he had seen fit. Even now, Arthur could see Agravaine's broken body in his mind's eye, his limbs thrown out to the side at impossible angles. Merlin had done that, to save him, and because he knew Arthur would carry the weight of guilt on his back forever, if it had to be done. He would have done it, of course, but he would never have forgiven himself -- for being too stupid to see a betrayal in progress, for trusting Agravaine, and for taking the life of his mother's brother. \nAll the same things could be said of Merlin, of course -- he had deceived Arthur, had betrayed him, in his own way, kept secrets from him -- except that they couldn't be said of him. Not in the same way, at any rate. A lie wasn't necessarily a betrayal; a secret was sometimes more of a cost to its bearer than to those that were deceived. Sometimes Arthur thought of what it had taken for Merlin to stand there silent, pretending to be so much less than what he was, and it made his chest ache. Merlin, who deserved to be the beloved of more than just one incredibly idiotic king. \nThere was a soft tap at the door, and Arthur didn't even open his eyes; he lifted his head and bellowed, \"Go away!\"\n\"Arthur?\" came the soft reply, and Arthur sighed. Guinevere. Since her return to court he had seen her twice, and both times it had been strange, and awkward. But he owed her his kingdom; the least he could do was see her. So he heaved himself up from the chair and crossed to the door, unbarring it with a shove. \nShe smiled at him when he flung the door open, and he felt like an ass for being so impatient, so he returned her smile. \"Good evening, Guinevere.\"\n\"Good evening, sire.\" She clasped her hands in front of her in that way she had of occupying her fingers when she was nervous. \"May I come in?\"\n\"Of course,\" he said, stepping aside to allow it. She was wearing a blue dress with a tightly fitted bodice, and she looked entirely lovely as she passed by him, the scent of spring flowers following her. He closed the door again and stood there a moment, not quite sure what to do with himself. Or her. \n\"I thought perhaps...I didn't want to presume, but...perhaps, you could use a friend to talk things over with?\" Guinevere said, her voice tiny. \nArthur looked at her, and in a flash, remembered all those moments when Gwen had been there for him, had given him such wise counsel. In truth, he had already forgiven her for the heartache she had caused; he loved her far too much to punish her for following her own heart. It had been easy, in the end, to set the past aside, though he knew now he could not give his heart to her again. Not now. \nFriends, though, were hard for kings to come by, and Gwen had been one of the truest. \n\"I could indeed use a friend,\" he said, gesturing toward the fire. Her smile lit her entire face, and she sat down in the chair he had just left, looking up at him as he perched at the edge of the table. \n\"I've been to see Merlin,\" she said, ever direct. \"He is much better.\" \n\"So I've been told,\" Arthur said. He studied the cuff of his shirt for a moment. He had been to see Merlin every day when he was on the cusp of death, had stood outside with his hands pressed to the wall as if he could hold together the pieces of Merlin's life with his fingertips. Once he knew Merlin would live, he had stopped his visits. Seeing Merlin would only cloud his judgment, and he had to think this thing through clearly. \n\"He would gladly have died for you,\" she added, then stopped, as if she perceived an invisible boundary she shouldn't cross. She knew him far too well, Arthur mused. \n\"Yes, well, he had something to prove, didn't he?\" Arthur said, a bit more sharply than he had intended. \n\"And prove it he did,\" she shot back, then bowed her head, as if pulling back her words. When she raised her head, her eyes were wet. \"What I did...what your uncle did...you mustn't equate Merlin with those things.\" \n\"Mustn't I?\" Arthur stared at her. \"The people closest to me have lied to me, have taken advantage of my trust, and--\"\n\"How has he taken advantage of your trust?\" Gwen said. \"He has done nothing but protect you. When you met him, Arthur, you were an arrogant, selfish ass. You would never have permitted anyone to undermine your father, no matter how much you cared for them. How could he have told you?\"\n\"Those days are long past, Gwen. My father has been dead a year.\"\n\"But his laws have not.\" Gwen smoothed her skirt. Without looking at him, she said, \"You have become a wise and compassionate king, Arthur. One who did not kill a woman who made a foolish mistake. One who loved his only remaining family so much, he refused to allow anyone to speak ill of them. These things show strength and loyalty, not weakness.\" She raised her head and looked him in the eye. \"A wise king would not throw away his strongest weapon, or his truest friend.\" \nArthur was silent for a long moment, looking at her. She was beautiful in the firelight -- beautiful at any moment, but especially with the soft light casting shadows on her face. They would have been a perfect pair, he and Gwen. \nHe reached for regret, which had seemed to be lodged just beneath his breastbone since the moment she was banished, and found that spot now occupied by longing -- but not for Gwen. The sudden clarity of that feeling resonated in Arthur's bones, like a bell sudden struck, and he raised a hand to rub at his eyes, hiding his face from Gwen. Such a strange course their lives had taken, in these few short months. \nWhen Gwen spoke again, her voice was gentle. \"Gossip amongst the servants has it that your advisors are bickering about the laws to be put in place. About magic, I mean.\"\n\"Still connected to those who truly have knowledge, I see,\" Arthur said, lifting his head. They exchanged smiles. \n\"Have you considered asking Merlin what he thinks? I'm sure that over the years, he's done a great deal of worrying over the things your advisors are working through now.\" \n\"I have,\" Arthur admitted. The sheer number of times he'd had to stop himself from charging down the stairs and into Merlin's room was in the hundreds. It was almost physically painful for him to stay away, at this point. \n\"Are you thinking of sending him away?\" Gwen asked, her fingers worrying at the fine embroidery on her bodice. \n\"What? No,\" Arthur said, frowning. \n\"I just thought...that perhaps if you were planning to banish him, you were...you would want the break to be clean,\" Gwen said, swallowing, \"and that is why you haven't called for him.\" \n\"No,\" Arthur said again, meeting her eyes. The words he had to say tasted bitter on his tongue, as truth often had, but he was growing accustomed to swallowing truths. \"I learned my lesson the first time, Guinevere.\" \nShe nodded. Arthur supposed there was little she could say to that; she had been an object lesson to her king, but the price had been unbearably high, for both of them. \n\"Well.\" Gwen stood, and brushed down her bodice. \"Arthur, if you should have need of me, you have only to ask. I will do anything I can to help.\"\n\"I know,\" he said, unable to say any of the hundred other things that flitted through his mind. She nodded, and began to make her way to the door, but when she reached his side, she stopped. \n\"It's Merlin, isn't it?\" she asked softly. \"The one you're bound to?\"\nArthur found it too wearying to even attempt to pretend he had no idea what she meant. Even if he had tried, he was sure the expression on his face must have given him away, for his neck and face were heating. Instead, he swallowed hard, and asked, \"What makes you think so?\"\nShe laid a hand on his arm. \"Because it should be Merlin,\" she answered, as if the answer itself was obvious. She picked up her skirts, and was gone, leaving only the lingering scent of wildflowers in her wake. \n**\nFor four more days, Arthur's advisors haggled and argued, sending Arthur into a state of constant impatience, where the mere sound of their voices induced a frightful headache. He was out of the council chambers more than he was in, drifting toward the decisions he must make, and then away again, unsure of the correct course. They stopped placing half-formed resolutions in front of him, and settled down to the hard work of compromise. These were men who had seen the sea change from calm, to storm, and back again, all the colors of the world in the waters. They were wise enough to find their way under uncertain stars, Arthur knew, and he left them to it. \nIn the meantime, he trained with the knights, all of whom had gone silent with him. He supposed he couldn't blame them; he was silent within himself on the subject of Merlin, and so could not expect them to be any less unsure. From sunup to noon, they battered one another with steel and wood, with fists and iron, until Arthur's exhaustion replaced his hurt and confusion, and he was able to find dreamless sleep in the evenings. \nOne early afternoon, as he sat down at the head of his council table, he turned to Gaius and said, \"How is Merlin?\"\nGaius, who commendably concealed his surprise at the sudden question, said, \"He is very well, sire. He occupies himself with work and study, and continues to keep the vow he made to you.\" \nArthur knew what Gaius referred to. He had spent many hours staring at that shaky scrawl, Merlin's promise never to use magic again, unless Arthur commanded it. He did not like to think of himself as the kind of man who required tests of his subjects, but he supposed that was exactly what he had been doing, keeping Merlin trapped in Gaius' workroom, to see what he was made of. \nIt occurred to Arthur that in the end, this test had only shown what Arthur was made of, and that he was a petty, vengeful sort of king, if only in small ways. \n\"His recovery will proceed faster if he takes the air,\" Arthur said, meeting Gaius' eyes. \"Don't you think?\"\nThe table had grown silent, and all eyes were trained on Arthur. \n\"I do, my lord,\" Gaius said. \"I'll send word that he is to have daily walks about the city, with your permission.\" \n\"Very good,\" Arthur said. He glanced around the table. \"Carry on, gentlemen,\" he said, and noted that they wasted no time diving back into their contentious debates. \nThat afternoon, Arthur climbed up to the battlements and watched as Gwaine and Merlin took a slow walk around the courtyard. The moment Arthur laid eyes on Merlin, something broke free in his chest, a rising tide of grief and anger and affection, mingled together so tightly he could not have pulled one apart from the others. He gripped the stone tightly as Gwaine jostled Merlin, no doubt aiming for a laugh, and as Merlin gave him a pale ghost of a smile in return. The absence of joy in his face was as painful to Arthur as a physical wound. \nHe stood and stared, and a fierce sense of Merlin's absence beside him made his breath catch. He missed Merlin. \n\"Sire,\" Gaius said, at his shoulder. Arthur had heard him approaching, but his eyes were only for the man walking about the streets below. \n\"Gaius.\" Together they stood and watched Merlin a moment, and then Gaius said, \n\"Your Majesty, I would not presume to tell you how to handle the kingdom's business--\"\n\"Well, if not, Gaius, then you would be the only person at court who has not,\" Arthur said, eyeing him with a small smile. \nGaius inclined his head, and said, \"We have a draft of the sorcery laws in place. I believe you would be wise to ask for Merlin's opinion on it. He understands far more than I do about elemental magic.\" \n\"Duly noted.\" Merlin had disappeared round a corner, Gwaine following close behind, and Arthur asked, \"Is he truly well, Gaius?\"\n\"No, my lord. He has healed in body, but there are some wounds time and rest cannot heal.\" Gaius folded his hands before him. \"The injuries I speak of are wounds I think you are well acquainted with, sire.\" \n\"Perhaps.\" \n\"It may be that for both of you to heal, you must come to common purpose,\" Gaius said. \nThey stood together, quiet in the golden afternoon light. Arthur drew a deep breath, and said, \"Send him to my chambers, Gaius.\" \n\"Under guard?\" Gaius asked, mildly. \n\"No.\" Arthur sighed. \"Not under guard.\" \n\"Very well.\" Gaius laid a hand on his arm, warm and reassuring, and it was all Arthur could do not to turn and ask if he was doing the right thing, if this was what he was supposed to do. \nBut he was the king, and some choices were his to make, and no other could truly know the path. Before long, Gaius had removed his hand and gone to follow his king's command, and Arthur was alone, watching over the kingdom which was his first and greatest love, and to which he must do his duty. \n**\nThe tap at his door was familiar, but softer; the edges worn off the knock, like a blade dulled with disuse. \"Come,\" Arthur called, and Merlin pushed open the door, coming 'round it to stand just inside. \n\"Well, close the door,\" Arthur said, leaning back in his chair. Merlin did, and Arthur got his first good look at Merlin in over a month. His skin was so pale, it seemed as though Arthur might see right through him, as through a slip of parchment. \nMerlin's eyes darted around the spotless room -- the product of George's incessant cleanliness, which irritated Arthur almost to the point of homicide -- and landed finally on the pile of parchment scattered on the table in front of Arthur. He couldn't have failed to recognize it; it was his confession, the one he'd written almost the moment he woke. Gwaine had taken great pains to tell Arthur of the state Merlin had been in the next day. Not sure how he even had the strength to hold the pen,  Gwaine had said, but Gaius says he wouldn't rest until it was done.  He had glowered at Arthur in such a way that his opinion of Arthur's distance from Merlin was made quite clear. \nSince the day Gaius had delivered it, Arthur had read it over and over, recasting the events of his life in light of new information. Beasts he hadn't killed, fights he hadn't won -- or rather, victories he had secured only because Merlin would not be dislodged from his side, and was using his magic on Arthur's behalf. \nAlthough Arthur had the entire thing committed to memory now, he sometimes still read it over, tracing Merlin's words with his fingertips, to be closer to their source. \n\"Sit,\" Arthur said, stacking the papers and setting them aside. Merlin pulled out a chair and slid into it, a nervous, thin bundle of sincere energy. Arthur looked at him, remembering the immense power Merlin had handled before his very eyes, the way his body had bent under the strength of it, but had not broken, though it was a near thing. \nThis slender man before him, awaiting his judgment, could kill him with no more than a thought; he could level the citadel, kill all of Arthur's armies, and yet he sat before Arthur, had offered Arthur the means by which to restrain him, disarm him -- kill him, if Arthur were a different man. \nThe thought of Merlin in cold iron, of his magic bound and chained, withering inside him, turned Arthur's stomach. \nMerlin said, softly, \"I'm sorry about your uncle, Arthur.\" \nArthur tapped his fingers against the parchment and said, \"You included it in your rather lengthy confession, as if it was a crime, Merlin. Let me assure you, the execution of a traitor is not a crime.\"\n\"I suppose it depends on your definition of traitor,\" Merlin said, looking vaguely green, as if the definition he found acceptable included sorcerers who lie to their kings for years on end. Arthur quashed the urge to round the table and touch him, to erase all those lines of fatigue from his face. \nInstead, he said, \"Perhaps it's easier to define what a traitor is not.\" Arthur picked up Merlin's confession and tossed it toward Merlin; pages scattered, falling to the floor. \"A traitor does not sacrifice himself for his king time and again. He does not put his king's welfare, and the welfare of his friends, above his own. He does not show his loyalty in every action from the moment he sets foot in the land.\" Arthur held his gaze steadily. \"Whatever else you may be, Merlin, you are not a traitor. Not to me, and not to Camelot.\" \nA small, hitching sigh escaped Merlin, as if he'd been holding his breath, and he lowered his eyes. \"Even so, I am sorry.\" \n\"I think you should be a bit more specific,\" Arthur said. \"Are you sorry for lying to me the entire time I've known you, or is there something else you feel you need to apologize for? For instance, intervening in the affairs of state on too many occasions to count, and proving your king a fool? I'm unclear on exactly what it is you feel sorry for.\" His tone sharpened, carrying with it the frustration of weeks spent thinking about Merlin's actions, with no clear idea how to proceed. \n\"You are anything but a fool,\" Merlin said hotly, color rising on his cheeks. \"You are destined to be the greatest king Albion has ever known. I am only an instrument of that greatness, Arthur. That's all my magic has ever been good for.\" \nArthur snorted a laugh. He leaned forward and picked up a fallen piece of paper, crumpling it in his hand. \"A great king, indeed,\" he said. \"How can I lead my people, when they all know their king was too stupid to recognize a sorcerer when he was right next to me every day and night for years?\" \n\"To be fair, I am a very clever sorcerer,\" Merlin said, a tiny smile lighting his face, and then vanishing again. \"I had to deceive you, Arthur. As long as the laws against magic were in place, I had no choice. I couldn't put you in that position.\" \nArthur tossed the crumpled paper on the table. \"My people must think their king is the greatest idiot who ever lived. No king can govern if he is thought to be so easy to deceive.\" He paused, took a breath. \"I should care about that, shouldn't I?\"\n\"The people of Camelot love their king,\" Merlin said, taking a breath as if he meant to go on, to say something more, before he flushed scarlet and bowed his head again. Arthur thought he had some idea of what Merlin had meant to say, and that strange fluttering began beneath his breastbone again. \n\"The magic you used to repel Camelot's enemies was quite effective,\" Arthur said. \"The knights found some dead in the forest, and the rest apparently fled back to their respective lands.\" \n\"I wasn't actually trying to kill anyone.\" Merlin turned his face toward the fire; flickering light was reflected in his eyes, and Arthur was cast back to that moment on the wall, when Merlin's eyes had been pure gold. A small shiver ran down his spine. \"I just wanted to stop them and create protections around the walls -- to do what you asked of me.\" \n\"You would have done it even if I had not asked it of you,\" Arthur said. \n\"Yes.\" Merlin raised his chin then, and turned his gaze to his king. \"If it would protect you.\"\n\"And Morgana?\"\n\"I don't know.\" A shadow crossed Merlin's face. \"She attacked me using powerful magic, and it took a great deal of power to repel her efforts. She has grown in skill and strength over time. She is a formidable enemy.\" \n\"So I've seen.\" Arthur paused, then asked, \"You believe she is still alive?\"\n\"I'm certain of it.\" This time, Merlin did not say he had not tried to kill her, and Arthur did not ask. He had never wanted Morgana dead, but he knew now that Merlin had tried to kill her at least once, and would never hesitate on that again if it meant saving Camelot, or Arthur. He believed it with every part of his heart, and that certainty had tempered his anger, and his hurt, over the long years of Merlin's silence about what he really was. \n\"So I can expect her to redouble her efforts to take my throne.\" \n\"She will never stop, Arthur. She believes it to be her birthright, and you to be the usurper.\" \n\"In some ways, she is not far wrong.\" Arthur thought of his father's treatment of Morgana, the way he doted on her, in happier times. She was his sister; she had been entitled to more than a life lived in Arthur's shadow. \n\"She is entirely wrong,\" Merlin said forcefully. \"You are Camelot's king; there will be no other.\" \nArthur looked fully at Merlin's face then, to see the confident, commanding expression on his face which matched this new tone - the tone of an equal, not a contrite servant. \n\"Tell me, Merlin,\" he said softly. \"How can I care for someone who has betrayed me? What should I do?\"\nMerlin's breath hitched. \"You...you must do what your heart tells you, sire.\" The echo of another conversation, not so long ago, but so much was different, now. \n\"And if I don't know what that is?\"\nA long silence stretched between them, until finally Merlin said, very softly, \"I think you do.\"\nThey fell silent, Arthur watching Merlin carefully, because every bit of what he was feeling written on his face. So much love and longing that Arthur could not fail to know it for what it was. \nIt was Merlin who finally broke the silence. \"Gwen has been to see me nearly every day, since her return to the city. She tells me you have lifted the banishment, and given her a place of honor here in the citadel.\"\n\"She is a wise advisor, and a good friend. Better than I sometimes deserve. I will always value her counsel.\" Arthur leaned back in his chair. Merlin nodded his understanding, and if there was more he wanted to ask, he held it in check. It was that pained silence that caused Arthur to add, \"We have settled what was between us. A friend is all she will ever be.\" \n\"She is loyal to you,\" Merlin said. \n\"She is not the only one who is, and has been, and I will never forget the value of that loyalty again.\" \nHope flickered in Merlin's eyes then, brighter than gold. \n\"I will have to make a proclamation about you,\" Arthur said. \"Something to let the people know you are a sorcerer.\" \n\"Arthur, half the kingdom saw me using magic on the battlements. I'm quite sure they know,\" Merlin said, a hint of fond exasperation in his tone. \nIn his turn, Arthur rolled his eyes. \"You are not officially a sorcerer until I say you are,\" he answered, reveling in the genuine smile that brought to Merlin's face. \"In the meantime, you should try to make yourself useful; my advisors are driving me insane with their incessant bickering over all things magical.\" He tossed Merlin the rolled set of laws the old men had presented him with that afternoon. \"Perhaps you can point out the flaws in their reasoning.\" \nMerlin unrolled the scroll and read it quickly. \"There are some protections I can provide against magic-users seeking to test our defenses. But even with those, there are some laws here that won't be strong enough. There are punishments you should set in stone.\" \n\"Cold iron?\" Arthur said, his skin prickling when Merlin shivered, just a bit. \n\"Yes.\" Merlin let the scroll fall closed. \"I wanted to be sure you knew your options,\" he said, his voice breaking just a bit. \nArthur sat forward, his hands pressed against the table. \"We will have to begin over again, Merlin. Begin as we truly are, and not as we thought each other to be.\" \n\"Yes,\" Merlin said, laying the scroll carefully on the table. \"I would like that -- to be known, by you.\" \n\"Dine with me tonight, then, and tell me who you are.\" \nMerlin nodded, his eyes glistening. \nArthur sent for platters of food, and they settled by the fire to eat toasted bread and cheese. All the while, Arthur peppered Merlin with questions about his magic, how it worked, why it worked. Merlin answered them all, as best he could, though sometimes he seemed to flounder for words. \nWhen Arthur asked him, \"How does magic feel?\", Merlin flushed and looked down into his cup of mead, taking forever to find the words. \nFinally, he said, \"It is the purest joy, Arthur. I've never known anything else like it, until....\" He stopped, and Arthur reached out a hand to cup Merlin's cheek. Merlin nodded, turning his face into the touch, and Arthur's breath quickened. \nSlowly, he withdrew his hand and got to his feet. He scooped up the pages of Merlin's confession and tossed them into the fire one at a time, dropping to one knee to shove the last of them into the flames. Merlin watched him in silence, until Arthur sat back on the rug, satisfied. \nWith the flick of a finger, Merlin drew sparks out of the fire, forming them into the shape of a dragon in mid-air. Arthur stared in wonder, and then shifted his attention to Merlin's beautiful smile, so filled with simple pleasure it made Arthur's heart ache. \n\"There is a story I want to tell you,\" Merlin said, as the sparks flared and spit fire. \"About a dragon named Kilgharrah, and his lord.\" \n\"Will I recognize you in this tale?\" Arthur asked, settling back on the rug, the fire-dragon shifting about in the air above. \n\"Yes,\" Merlin said, his fingers dancing with fire. \"You did ask to know me,\" he reminded Arthur, leaning back on the rug as well. \n\"So I did.\" Arthur reached out then, to draw his fingertips across Merlin's tiny, secretive smile, as the dragon brightened and roared his silent satisfaction into the quiet room.\n\n\n\n\n\nVII.\n\nBy mutual agreement, Arthur and Merlin kept their distance, for a time, and did not touch each other. There was still much more to be resolved between them than one night's honesty could mend, and the business of the kingdom was Arthur's priority. Many nights, they stayed up talking, and Merlin fell asleep on the rug before the fire in Arthur's chambers, or slumped across the table. Little by little, the deep shadows beneath his eyes eased, and with each night that passed, Arthur found a few minutes' more peaceful sleep. \nMost days, he woke thinking of where he must go from here, how he could manage the opposing forces surfacing within his council. The proclamation about magic, of course, was not the ultimate problem. The problem was what to do with Merlin -- what to call him, first of all, and how to fit him into the rigid confines of tradition, where magic had been feared for so long it had begun to eat away common sense, like acid from Gaius's workshop. \n\"You don't need me at council,\" Merlin said, as he pored over the latest drafts from Arthur's advisors. \"I can mark a few changes, make a few suggestions here. Wouldn't that be easier?\"\n\"Perhaps,\" Arthur said, watching the crease between Merlin's eyebrows where a frown of concentration had taken root. \"But going forward, very little will come easily, Merlin. We may as well begin taking those challenges head-on.\" \nThey worked and worked on the laws until late in the night, until Merlin's hands were ink-stained and cramped from writing, and Arthur's brain held no more ideas, and finally, Merlin dropped the quill. \n\"This is it,\" he breathed. \"This, or nothing.\" \n\"We shall see what my most learned advisors have to say in the morning,\" Arthur said. He opened the door and gestured to a page. \"Take this to Sir Geoffrey and be sure he reviews it before the morning session. I want to be sure he is prepared.\"\n\"Yes sire,\" the page said breathlessly, as if he had already been running, and Arthur closed the door with a smile. \nWhen he turned back to the table, Merlin's hands were folded on the table, and his head had dropped to meet them. The nape of his neck was exposed, vulnerable, and Arthur's heart lurched treacherously in his chest. He moved closer, softly, and cupped the back of Merlin's neck, stroking the fine soft hairs there with his thumb. \n\"Arthur,\" Merlin mumbled, and shivered under his hand. \n\"Get into bed,\" Arthur said, pulling his hand away. \"We've an early morning, and it's ridiculous for you to go back to your room tonight.\"\nMerlin raised his head, exhaling a long, exhausted sigh, and turned his face up to Arthur. There was a weary maturity about him in that moment, and Arthur saw him for the first time not as a former servant, not just as a lover, but as someone who was his equal in this endeavor -- a partner, sharing every hardship and challenge it presented. The idea of that skittered across the surface of Arthur's tired mind and slowed to a halt, to be considered at a later time. \n\"Come,\" Arthur said, and turned away, pulling at his tunic roughly while Merlin pushed back the chair behind him. \n\"Arthur,\" Merlin said again, so softly, and Arthur felt Merlin's eyes on his bare skin as acutely as a longed-for touch. A sudden feeling of annoyance surged over him -- it was ridiculous to want Merlin this much, to know they were here, together -- and as suddenly as it arrived, it passed, as Merlin stepped closer. \"Are you sure?\"\nArthur glanced back over his shoulder. \"You so rarely do as I command,\" he said. \"This once, just...no argument.\" \n\"All right,\" Merlin said. He wavered a moment longer, and so Arthur scrubbed a hand through his hair and pulled back his own bedcovers. It was not Merlin's place anymore, not really, and all the perfectly competent servants in the world who had paraded through his chambers in the last span of days had only served to remind him of everything that had gone sideways, and all the things he had once thought so solid beneath his feet. \nThe question of what Merlin's place was, exactly, haunted him. \nHe climbed into the soft bed, and a moment later, Merlin climbed in beside him, also still clad in breeches, but without his tunic. \nThey didn't speak; Arthur instead allowed himself a moment to appreciate the way the tension had eased in his shoulders as Merlin's soft, even breathing filled the empty space around them. As his eyes drifted closed, Arthur turned on his side and fitted his hand to Merlin's ribs, just so, into the hollow that seemed made for his fingertips. \nEven in dreams, he kept his awareness of Merlin beside him, all through the night. \n**\nEvery member of council was present at the morning session, and all of them rose as was customary when Arthur entered the room. This time, however, Arthur had Merlin in tow, a fact which caused a low rumble around the table. \"Gentlemen,\" Arthur said, nodding to the assembly, which now included Leon, as his first knight. He glanced around the table and saw no seat for Merlin, and so fixed his expectant gaze on Lord Pryce, seated to his right. Pryce inclined his head and moved aside to stand in the wings, but Merlin made no move to take the seat. He hovered behind Arthur's chair, as if Arthur might eventually forget he was there. \n\"Merlin,\" Arthur said impatiently, and with a huff, Merlin complied with the unspoken command. Not that Arthur expected him to make a habit of it. \n\"Sir Geoffrey, have you made a study of the proposed laws delivered to you last evening?\" Arthur asked, as they all settled into their chairs. \n\"I have, my lord. The proposal seems eminently wise, and takes into account many of the concerns voiced by this council.\" Geoffrey pushed the paper out onto the table, where it could be passed from hand to hand. \"The Old Religion will be allowed once again, and the Druids and other magic-users are to be free to enter Camelot, or to leave it, as they choose. Magic will be permitted, but with some restrictions. Those who use magic to harm, injure, or persecute others will be executed; the law is very clear on this point, but the law also requires a trial, and an examination of the accused by the king's appointed sorcerer.\" \n\"An excellent summation, thank you,\" Arthur said. \nGaius cleared his throat. \"There remains a point of order, sire, and that is the appointment of court sorcerer. Have you someone in mind for that post?\"\nSeveral heads at the table swiveled curiously toward Merlin. \nArthur sat back in his chair and looked at the faces of his advisors. \"What say you, gentlemen? Any suggestions?\"\nA complete silence fell over the room, while Merlin seemed to be trying to make himself as small as possible without actually crawling under the table. \nFinally, Leon spoke, quiet but sure. \"There is only one person in Camelot worthy of the post, sire, and that is Merlin.\" \n\"He has already sacrificed a great deal for this kingdom,\" Gaius said softly. \"More than many will ever know.\"\n\"My lord, what is the primary purpose of having an official sorcerer?\" Lord Corin put the question forward as evenly as possible, for which Arthur had to give him credit. \"What are his duties to be, and how can they be monitored? We all know how dangerous magic can be, and how difficult it is to control.\" \n\"Magic thrives regardless of any attempts to oppress it, and control is an illusion,\" Arthur said. \"If there's one thing I learned from my father, it is what seems impossible often is exactly that, and there is no way to completely assure the people that magic will not be used improperly.\" He turned his gaze to Merlin, who held it for a long moment. \"We are fortunate that although powerful magic exists outside our control, powerful magic is also a tool we can wield, thanks to Merlin.\" \nMerlin nodded, swallowed hard, and said, \"My lords, magic can be used in defense of the realm. The king and I have drawn up lists of ways I can assist, including some preventative measures and precautions to ensure magic is not used against the king without his knowledge.\" \n\"But how can you possibly know what threats we may face, in the future?\" Lord Corin said, exasperated. \n\"Tell them, Merlin,\" Arthur said, quietly. \nSo Merlin did. He began at the starting point, and held nothing back as he detailed a long list of threats Camelot had both seen, and had never known of, as well as his part in defeating every one of them. It was not new to Arthur; he had committed the details of Merlin's initial note to memory. But he had never heard Merlin speak of those things in such a way, so calmly, as if he was the warrior and the rest of them were his to protect. This telling was so different from the shaking hand which had written it when Merlin was still weak and exhausted from his efforts. \nIt struck Arthur that this was exactly the case -- they all were under Merlin's protection, as much as they were under the protection of Arthur's sword, and his knights. Two essential kinds of weapon, each forged of duty and love. \nWhen Merlin finished speaking, he looked down at his hands, spread flat upon the table, palms down. \"My magic is only for the king, and for his protection,\" he said. \"I have vowed never to use my magic, unless by his command, and it is a vow I will honor.\" \n\"There can really be no question, can there, my lords?\" Arthur asked, looking at each man in turn. Much of the skepticism and fear he had seen there had now been displaced by a kind of awe he was very familiar with. \nNo one raised an objection. \n\"Very well. Geoffrey will prepare two documents: a decree announcing the posting of the new laws governing magic; and a proclamation granting Merlin the title of court-appointed sorcerer responsible for implementing those laws.\" \n\"Sire, what are we to call our esteemed court sorcerer from this point forward?\" Gaius asked, his eyes twinkling as Merlin began fidgeting again. \n\"Oh, I think His Excellency will do, for now,\" Arthur said, as if he had not considered it a hundred times in the last few weeks. \"Or...I think Merlin will be acceptable also as a form of address, if His Excellency is not opposed.\" \n\"Not opposed at all,\" Merlin said fervently.\n\"Very well, then that is settled. My thanks, gentlemen. Come, Your Excellency, we have much to discuss,\" Arthur said grandly, pushing back his chair and turning quickly to hide the vast smirk which threatened to explode into laughter. \nHe was quite sure it was only his imagination which supplied the hissed prat!  in his ear. \n**\nTo say that Merlin had a period of adjustment to his new duties and title would have been a vast understatement. To say that Arthur enjoyed it all immensely, however, was the truest thing Arthur knew, and he watched it all unfold with great pleasure. Merlin was accosted regularly by lords, ladies, kitchen maids, knights, and townsfolk alike, for all manner of things, and had not yet learned how to say no. \nIn addition, there were those who tested the boundaries of law immediately, and who found themselves in cold iron while Merlin sat calmly outside their cells, testing their magic, and their resolve to use it unwisely. On those days, Arthur simply let Merlin learn his own lessons about what it meant to be the possessor of power and the judge of others' fate in formal ways, and did not interfere with what he had set in motion. \nIn the times between, Merlin and Arthur spent stolen hours together, riding in the afternoons, or sharing a quiet meal. One afternoon when the sun broke through the winter gloom, they sat on the battlements near where Merlin had fallen and kissed for hours, reveling in the pleasure of being together, watching snowflakes glisten as they drifted down in the pale sunshine. For Arthur, it was familiar, but also new, this understanding of what Merlin offered him, had given him. Merlin seemed entirely revealed now, and it seemed possible to know him in ways Arthur had never dreamed of, before. \nStrange but predictable rumors surfaced from the town -- chief among them, that Merlin had Arthur ensorcelled. The first time this rumor was brought to Merlin's attention, he laughed until he fell over onto the floor. \n\"As if,\" he gasped, \"such a thing would be possible, you are so stubborn and completely incapable of taking any kind of orders whatsoever.\" This sent him into peals of laughter again, and caused a bemused but grinning Arthur to kiss the insolent laughter from his smiling mouth. \nOne afternoon, as late winter rain beat against the castle windows, Merlin sat shivering in Arthur's chambers as they pored over official documents of many sorts. Arthur flipped through the parchment, but his attention was partly on Merlin, whose lips were pursed in serious thought as he read. \nSomehow, the burden of being king -- which Arthur had willingly prepared for all his life, and accepted without question -- was eased with Merlin at his side, full of suggestions and unpredictable wisdom, sharp-tongued insults just as ready as they had been before they'd become lovers. Before Merlin had saved Camelot, and Arthur; before Arthur had known the extent of Merlin's devotion. \nMerlin cast an annoyed glance at the cold stone fireplace, and Arthur could see it all in that one telling moment: Merlin would never call a servant to light the fire, and it had not occurred to him to use magic. He began to push back his chair. \n\"Merlin,\" Arthur said, his full attention on his papers as he moved the inkwell closer. \"I want you to use your magic as you see fit.\"\n\"What?\" Merlin said, stopped mid-motion, though Arthur knew he had spoken quite clearly. \n\"It is part of you, after all,\" Arthur said, glancing up at him, and then back at the fireplace. Then he returned his attention to his papers. \nMerlin eased himself back down in the chair, and there was a long pause. Then, suddenly, warmth bloomed at Arthur's back as a cheerful fire blazed to life behind him. \nThey worked for a time, and then Merlin shoved his chair back and said, \"Come with me.\" \n\"Work, Merlin, perhaps you are familiar with it?\" Arthur tried, but Merlin grabbed his wrist and said, \n\"Later.\" So Arthur went, grudgingly, to the bed with Merlin, and allowed Merlin to push him onto his back. Merlin climbed up beside him. \n\"Watch,\" Merlin said, smiling a little, and stretched his hand out toward the canopy overhead. His eyes flashed gold, and for a moment, Arthur was mesmerized by the sight of it, so open and brilliant. But his attention was distracted by the magic unfolding at Merlin's bidding. \nA strange glow began to appear above them, and the air turned blue, with wisps of white smoke floating overhead. \nArthur lay back, his shoulder touching Merlin's, and stared up at a blue sky overhead, and clouds floating amiably through it. He knew this sky; it was the same sky he'd stared at that day in the meadow, the first time he'd kissed Merlin. He watched the clouds overhead with delight and wonder as they arranged themselves into patterns -- dragons in flight, unicorns tossing their heads as they ran, and a castle, banners waving in the breeze.\nHe rolled to his side and propped himself up on an elbow, so he could see Merlin's face, the illusion of sky reflected in his eyes. When he bent his head, Merlin met him halfway, and the tender press of their kiss sent the sky flaring a brilliant, joyful blue. \nHe thought, briefly, that this strange sensation beating against his ribs might be love, though he had never quite known it in this form before. It was late in coming, and it brought only sadness with it. Arthur thought that was quite predictable; love had only ever brought him sadness. First his mother, and then his father, each in their own way; Gwen, in her turn, and Agravaine, and now finally Merlin, who was not his and could never really be his, no matter how much he may wish it was so.\nIt was just a matter of buttons and ties, then, Arthur taking his time between kisses to strip Merlin bare. He ran his hands over every inch of Merlin's body, a careful examination he had denied himself for so long. His skin was not satisfied with what his hands found, and he pressed himself against Merlin, kissing a path across his collarbones, down his chest, stopping at his belly, where his hard cock lay. \nArthur bent his head and took Merlin carefully into his mouth, his tongue tracing the length, then around the head. He had never done this before, never offered so much of himself. This was the only way he knew, to make Merlin understand. Merlin trembled under Arthur's fingertips, which rested on his belly, spread wide, possessive there. Arthur glanced up and could see the flash of clarity in Merlin's eyes -- that this was the first time Arthur had ever done this. \nMerlin turned his face, stifling a cry. Arthur reached up and pulled hard on his arm, yanking his wrist down to the bed and pinning it. He grasped Merlin's cock with his left hand and pulled off, saying quietly, \"Let me hear you.\" \nThen Merlin was engulfed in Arthur's wet, hot mouth once again, slow suction and careful licks around the head, and it took almost no time at all before Merlin was coming, coming into Arthur's mouth, back arched from the bed. Pleasure washed over Arthur at the sight of it. He held Merlin's cock in his mouth, letting it pulse there until Merlin slumped back, without breath and bone. \nArthur's hands rested on his hips for a moment. Then he slowly rose up to his knees between Merlin's spread thighs, watching Merlin as he tried to regain his breath. One hand on his hard, leaking cock, he stripped it slowly, stance widening to throw his knees wider apart. His eyes locked with Merlin's, and his hand never quickened its pace. Three slow, rough strokes and he was coming, his lips parted, his breath coming in harsh pants as he painted Merlin's belly and cock with his spend. \nOutside, the rain battered at the windows under a grey and merciless sky. In Arthur's bed, Merlin and Arthur dozed under a blue sky, where the clouds sometimes drifted into the bed curtains and tangled there, caught in their cozy cocoon. \n**\nThe Druids sent their formal delegation not long after Merlin's appointment at court, and their leader was one Arthur had seen before. It shamed him to see Iseldir, for Iseldir had seen him do and say things Arthur regretted, including the threat of violence to a child. But the Druids held no condemnation of him in their eyes, and Iseldir made no mention of it. \nThey bowed first to Arthur, and then to Merlin, and Arthur had the feeling there were entire conversations happening in the thick silence around them. He raised an eyebrow at Merlin, who turned a deep scarlet and stood much taller beside Arthur's throne. \n\"Arthur Pendragon,\" Iseldir said. \"King of Camelot. We welcome this opportunity to live in peace within Camelot's borders. We honor your choice to overturn the bans on magic.\" \n\"I thank you,\" Arthur said. \"I know your people have suffered greatly, and I am as much to blame for their suffering as any here. I have, however, pledged that the Druids will receive fair and equal treatment, and so they shall -- none shall harm you here while I am king, unless you break the laws governing magic.\" \n\"Wise laws,\" Iseldir said, his eyes drifting toward Merlin. \"We will abide.\" Iseldir bowed low, and then said, \"Emrys,\" to Merlin, as if it were an honorific, greater than king. Merlin turned an even deeper red and avoided Arthur's eyes as the Druids withdrew. \nIt was not until the evening, when Arthur and Merlin sat quiet by the fire, when Arthur said, \"They call you Emrys. Does it mean something?\"\n\"It's the name they've always called me,\" Merlin said. He traced patterns on the rug, invisible swirls pressed into the fur with gentle absentmindedness. \"I think it's a name from prophecy. Apparently, I was foretold. Or something. As were you,\" Merlin added, looking up at Arthur with a quiet pride. \"You are the once and future king.\"\nArthur thought that over, and decided to pick it apart another day. Instead, he pressed his original point. \"They revere you -- the Druids, I mean.\" \n\"I am at the heart of many of their prophecies. Or rather, Emrys is. I'm not so sure I'm the Emrys they seek.\" \n\"They seem sure. Perhaps that's all that matters.\" Arthur took note of Merlin's troubled, unconvinced frown, and added, \"How many times have I felt I was not worthy of my father's regard, or of my people's? But you seemed sure. You, and others.\" He did not mention how much higher Merlin's esteem had boosted him, than those many others. \"Sometimes we do not see ourselves as clearly as others may.\" \n\"Hey, now,\" Merlin said, smiling at him. \"I'm to be the wise one, remember?\"\n\"Of course,\" Arthur said, smiling in return. \nAfter a moment more of contented silence, Arthur reached into his tunic and pulled forth the item he had asked the Druid craftsmen to provide. \"Here,\" he said, handing the small bundle of cloth to Merlin. \nMerlin gave him a puzzled look, but unwrapped the green cloth, to reveal the braided leather bracelet beneath. He held it up, a question in his eyes. Arthur took the bracelet and tied it at Merlin's wrist, the rich brown leather dark against his skin. \n\"For the time remaining,\" Arthur said. \nMerlin traced the pattern with his fingertips, and said softly, \"No token was needed, Arthur.\"\n\"Wear it for me,\" Arthur said, reaching out to follow the path Merlin's fingers took across the woven leather. \"Until the day our arrangement is at an end.\" \n\"Until that day,\" Merlin said, turning his hand palm up, so Arthur's fingers might slide between his own and nestle there. Arthur nodded, satisfied at the fire in Merlin's eyes, and in his possessive kiss.\n\n\n\n\n\nVIII.\n\nThe deep chill of winter had begun to give way to the first blooms of spring when the invitation came to visit King Lot and Queen Mithian. Although Arthur was very still as Geoffrey read it aloud to the court, Merlin knew there were unpleasant echoes of Agravaine shivering along his skin, and memories of the visit his uncle had made there not so long ago. \n\"They are requesting the presence of Camelot's king and his sorcerer. There's to be a fortnight of feasting and tourneys to celebrate the end of their hand-fast and the beginning of their proper marriage,\" Geoffrey said, handing the parchment to Arthur. \n\"Two for the price of one,\" Arthur said, casting a mirthful glance at Merlin, who fidgeted in his chair. He had not been official at court long enough to have acquired a sense of decorum, or at least one that would help him conquer the uncomfortable high-backed chairs around the council table. \n\"Must we?\" Merlin said, already resigning himself to it as Arthur gestured Geoffrey closer. \n\"Oh, yes, we must,\" Arthur said. \"Geoffrey, send our acceptance to Lot, and see to it that Merlin's wardrobe is suitably upgraded. There will be three or four banquets - plus the getting there, and the leaving, and some other things in between - and one or two formal receptions and audiences.\" \nMerlin reached up to scratch around his collar, where already, the stiff formality of imaginary apparel was poking him in the chin. \n\"Right away, sire,\" Geoffrey melted away into the shadows -- a trick Merlin couldn't help but admire. \nMerlin had been Arthur's shadow for many years, standing nearby at too many diplomatic exchanges and formal courts to count. He had seen all manner of behavior develop, from poisoned chalices and falsely accused kings, to interminable speeches and accidental naps. For this reason, he was acutely aware of the importance of this first visit to King Lot's court, now that he was formally installed in Arthur's court as Camelot's sorcerer. \nIt hadn't been possible to ignore the many invitations from neighboring royalty -- all of them curious to lay eyes on the sorcerer the Druids whispered of with reverence -- so with this acceptance, Arthur had finally begun to give in, one state visit at a time. Those who would not or could not make the journey to Camelot were to be favored with brief audiences with Merlin, to assuage their curiosity and appease their fears of Camelot's growing power. \nArthur leaned forward, eyeing Merlin's head. \"Perhaps a hat,\" he said, laughter dancing in his eyes. \"Red velvet, I think. With feathers.\" \n\"Not this again,\" Merlin said, his teeth not quite gritted; it wouldn't be proper for him to grit his teeth at the king. Not in public, at any rate. \n\"Sire,\" Gwaine said, from his position near the middle of the table. All the knights had begun to attend council now, at Arthur's urging, though most of them would far rather be trying to outshoot one another on the practice field, or shining their saddles, or something equally far away from the realm of official governance. \"Perhaps you should counter by inviting King Lot here.\" \n\"Eventually, they will all come here,\" Arthur said, with something approaching a long-suffering sigh. \"In fact, it will be impossible to stop them. It's part of the expected protocol.\" \n\"Yes, I understand, but this time, why not have him come here first?\" Gwaine said. Merlin turned to look at him. Gwaine was rarely insistent at council, and never when the suggestion was his own. Usually he was insistent on points Merlin made, or Elyan. \n\"Explain your reasoning,\" Arthur said, his eyes intent on Gwaine. \n\"I've had dealings with him,\" Gwaine answered. \"He's not to be trusted. The man's got no sense of real honor.\"\n\"That's as it may be, but diplomacy requires dealing with men such as these regardless,\" Arthur said. \n\"Yes, but--\"\n\"Specifics, Gwaine, or leave it,\" Arthur said, as mildly as protocol would permit. \n\"I happen to know Lot's been looking for a sorcerer of his own,\" Gwaine said, his gaze straying to Merlin. \"Has done, for some time. He captured a Druid or two, tried to make them dance. If you take my meaning.\" \nArthur nodded, but the muscle in his jaw was tight. No need for him to ask for details. The idea of it -- Druids tortured, perhaps killed, just to satisfy Lot's lust for power -- churned up anger and dismay in Merlin's belly. \n\"There's nothing to worry about,\" Merlin said softly. \"He wouldn't dare insult the king by attempting to harm me.\" \n\"Of course not,\" Gwaine said, flashing his most disarming smile, the one that could convince total strangers he was trustworthy and entirely honest. Merlin knew in that instant that Gwaine believed no such thing. \nIt was therefore a mystery to him when Gwaine appeared at the door of his chambers later that evening to announce he wouldn't be going with them to Lot's kingdom. Gwaine had been so insistent that it wasn't safe, Merlin was at a loss to understand why he would refuse a chance to ensure there were no dangers. \nHe pressed the point while Gwaine sat with his feet up on Merlin's table and watched him pack. \"Why do you dislike King Lot so much? I mean, aside from how much you dislike most royalty in general,\" Merlin added, holding up two tunics and frowning at both. A pile of half-finished gaudy outfits sat to the side, where Merlin unraveled threads in them at regular intervals to ensure that no matter how fast the tailor sewed, none would be ready in time. \n\"Not the plain one,\" Gwaine said. \"You're a long way from Ealdor now, my friend. Best to dress the part.\"\n\"Not you too! I don't want to dress the part, and anyway, you're dodging the question.\" With a sigh, Merlin set aside the plain brown shirt and rolled up the rich blue tunic. He wasn't fond of the fancy dyes; they made him itch. \n\"Lot is the epitome of everything I had come to expect about royalty, before Arthur. He's vain and selfish. He cares only for power and possessions. People mean nothing to him.\" Gwaine dropped his feet to the floor with a thud and plucked an apple out of the basket at the center of the table. He tossed his hair back and took a giant bite. \n\"And you know this because?\" Merlin dug down into his pack, shoving an extra book or two down the sides. He was quite certain Arthur would force him to pack a trunk if he saw the books mashing his official court clothing, and he had no desire to be encumbered by that much baggage. \n\"I served in his court years ago.\" Gwaine sighed and put the apple down, unfinished. \"He had a sorcerer, back then. Kept him in some kind of iron contraption, binding his magic. It was no way for a man to live.\"\nThe idea of having his magic bound wasn't new to Merlin. He'd spent many sleepless nights worrying over it, after Aredian's visit to Camelot. He'd also heard many horror stories from Gaius, cautionary tales just like the one Gwaine was telling now. \n\"I don't really understand why Mithian would choose him.\" Merlin sat down on the end of the bed. \"She must have had some sense that he's what you say he is, and yet she is standing by her vow.\"\n\"Lot is ruthless, and he'll keep her kingdom and her people safe. Arthur very nearly made a similar bargain, for the same reasons.\" Gwaine gave Merlin a shrewd look. \"Something brought him to his senses, but a princess doesn't have the same options.\"\nMerlin frowned, because Mithian had been nice to him, and she obviously deserved better, but it was entirely out of his hands. He changed the subject, because there was still one pressing question he had no answers to. \"Tell me why you're not going.\"\n\"I'm to protect the citadel and oversee the training of the new knights in Arthur's absence.\" \n\"Arthur's never left you behind before. What is it, really?\"\nGwaine's face shuttered closed, and he smiled in a way that made Merlin cold. \"Because I was banished from Lot's court. That was even before he became an empire-building conqueror who liked to capture vacant thrones.\" Before Merlin could question him further, Gwaine was on his feet, pulling yet another plain linen tunic from Merlin's pack. He handed it to Merlin. \"I'll be here, ready to ride out at a moment's notice if I'm needed. Safe travels,\" he said, pressing one hand into Merlin's shoulder. \n\"Gwaine,\" Merlin began, but his friend gave him a chipper wave and was out the door in a flash. \nMerlin stuffed the shirt back in, along with an extra belt, and stared at the closed door. He'd grown so used to being in Gwaine's confidence over the years that it stung a bit not to have it now. But every man was entitled to his secrets; Merlin could not possibly take issue with Gwaine's silence, when his own secret had been held for so long. \n\"It's very strange,\" he said to Arthur over dinner in Arthur's chambers. \"Gwaine seems to have an intense personal dislike of Lot.\"\n\"Yes, well, I remember quite clearly when he felt the same about me,\" Arthur said. \n\"That was a long time ago,\" Merlin said. \n\"Leave him be, Merlin,\" Arthur said, poking at his stew. \"Sometimes men should be allowed to guard their secrets. As well you know.\" He shoved his bowl away. \"On to other matters. Are you ready for your first state visit?\"\n\"Ready to be put on display like a fatted pig, you mean.\" Merlin couldn't help grumbling, just a little. He had felt far more comfortable as Arthur's servant than he ever would in an official role. If only circumstances had allowed him to stay behind the scenes; it was much easier to do what needed to be done when he wasn't parading about as an official courtier. \n\"It is the role you signed up for,\" Arthur said. \"King's protector and whatnot.\"\n\"Yes, but there was no mention of velvet. Or hats.\" Merlin sat back and watched the smile playing about Arthur's lips. It made him want to kiss them unmercifully, until Arthur lost all capacity for teasing Merlin and simply gave himself over to kissing instead. \nOn the heels of that thought came another, like a sharp winter wind: not so many more days together, now.  The thought settled into his bones, like winter's ache might settle into old bones, deep and regretful. \n\"All right, you may forgo the hat,\" Arthur said. \"But you will wear the red velvet cloak. I want you in my colors.\" \n\"Usually you want me out of them,\" Merlin said, putting aside thoughts of tomorrow as Arthur pushed back his chair and took Merlin's hand. \n\"An excellent point,\" Arthur said, setting to work on exactly that goal. \nA week later, the trunks were packed (over Merlin's objections), the red and blue velvet was brushed and layered with clean linen to protect it from crushing, and sixty of Arthur's best knights lined the cobblestone square and street leading away from the citadel. The sight of so many stopped Merlin in his tracks as he led his horse down to the head of the procession, beside Arthur and behind Percival. \nArthur gave no outward signs of what he was thinking, but Merlin knew very well Arthur's views on this visit: Merlin was to be protected, at all costs. He was the sole reason for their visit. \nHe shivered, though the morning sun was pleasantly warm. \nThey mounted their horses and began the journey to Lot's kingdom, a mere three days' ride. Of course, the king's lectures to Merlin began almost the moment they rode out of Camelot's gates. \"You must be appropriately respectful,\" Arthur told him, as if Merlin had not learned the art of how to behave at court years ago. Whether he chose to practice it had been entirely a function of his previous disguise, and he was greatly wounded that Arthur conveniently forgot that every time there was a state occasion. His lectures were unvarying and terribly tiresome. \"And don't be obvious about it, but of course you aren't to use your magic unless I've commanded it.\" Arthur paused, giving Merlin a speculative look. \"It wouldn't do for people to think you're just wandering about, waving your hands and doing magic whenever the mood strikes you.\" \n\"Well, I do actually do magic whenever the mood strikes me,\" Merlin said, sighing a little. \n\"Yes, to my everlasting dismay.\" Arthur turned his eyes to the road ahead, but he was giving Merlin those sideways glances that seemed to say, you are completely hopeless and also a terrible member of my court, and there's no question you're going to cause a diplomatic incident.  \n\"I understand, you don't want Lot's people to think my magic is not under your control,\" Merlin said, earning a scowl from Arthur. \"Really, Arthur, this is all going to go splendidly. I will be on my best behavior.\"\n\"Well, I'm certainly reassured,\" Arthur said, one corner of his mouth twitching as if reluctant to abandon the scowl. \n\"You should be,\" Merlin said softly. \"You know I will do whatever it takes to bring honor to you and to Camelot.\" \nArthur gave a tiny nod, and that corner of his mouth turned up again. Merlin longed to reach out and touch there, to press his lips against it and erase Arthur's worry and displeasure, but such liberties were only theirs to take in private. Their arrangement with each other depended on their discretion, and Merlin would never risk disgracing his king. \n**\nNo welcoming party greeted them at the border of Lot's kingdom. This, of course, made Arthur suspicious. \"Fan out,\" he told Leon, who sent several knights ahead and arranged the rest behind Arthur and Merlin on the road. \n\"Not the most cordial reception we could have received,\" Merlin said, thinking of all the escorts Arthur had sent to the border over the years. Royal visitors sometimes needed to be wrangled, and trotted along in ceremony and style. \n\"It's not surprising,\" Arthur answered. His eyes were on the horizon, watching as if he expected half an army to burst over the nearest hill. \"This land hasn't welcomed magic in the years since Cenred's alliance with Morgause decimated their able-bodied male population.\" \n\"I'm sure they were less than thrilled to hear Lot is hosting yet another sorcerer.\" Merlin tripped over the word, as he often did. He was still not accustomed to speaking of himself in that manner, or thinking of himself as a sorcerer. He was just Merlin -- Arthur's Merlin, if he was deadly honest with himself -- and no threat to anyone who did not threaten Camelot. \n\"No doubt,\" Arthur said. He was eyeing the road now, and its remarkable lack of passers-by. It was as if the entire land had gone cold and silent as Camelot's procession moved through. Not even a stray villager in the fields, tending cows or stacking hay. \n\"I don't like it,\" Elyan muttered, and Percival nodded his head slowly, his sharp gaze moving from point to point in search of the threat their bodies warned them was there; goose bumps were visible on Percival's arms. \nIt was only when they approached the castle keep that a small contingent rode toward them, far fewer in number than Arthur's men. Merlin counted ten, all in armor, none of them in battle array. \nWhen the two groups drew to a halt opposite each other, the leader of Lot's column smiled. \"Greetings, King Arthur,\" he said. \"I am Sir Erevald, of King Lot's personal guard. I bid you welcome to his kingdom. I'm to escort you the rest of the way.\" \n\"Thank you,\" Arthur said formally. \"We have had a long journey indeed.\"\n\"Of course. His Majesty waits to receive you. If you and your men will follow me.\" Erevald glanced at Merlin, according him a brief but thorough looking-over, and then the ten-horse party turned smoothly back toward the keep. \n\"He's an interesting one,\" Arthur said, watching them go. \"Old enough to have seen many battles, but young enough still to fight.\" \n\"Unlike you lot, who are aging before my very eyes,\" Elyan said, shoving Percival in the shoulder. Leon gave them a disapproving look as he rode forward to take the head of the column and lead them in. \nMerlin was glad to see Queen Mithian on the steps as they rode to a halt in the courtyard. She was as lovely as ever in a pale pink jeweled gown, her smile warm and gracious. She waited until Arthur had dismounted before calling out, \"Welcome to Lot's Kingdom, King Arthur of Camelot.\" \nArthur took her hand and kissed it gently. \"My lady, it is a pleasure to see you again.\" \n\"And you also, my lord,\" she said, smiling at him. \"Will you come inside, and be greeted by my husband?\"\n\"I will, and thank you,\" Arthur answered. He turned his head to the side and said, \"Merlin,\" imperious as always. It was all Merlin could do not to grin, as it was exactly the same tone Arthur had used to call him all those years when he was Arthur's manservant. Arthur, it seemed, had caught himself, because he scowled at the ground for a moment. \"If you please,\" he added, in such a strained way that all the knights suddenly found their pommels very interesting. \n\"My lady Mithian,\" Merlin said, making his way to her. He kissed her hand, a liberty he could not have taken before, and she beamed at him. \n\"Merlin, how lovely to see you without baskets dangling from each arm.\" They smiled at each other, each caught by the memory of Mithian's picnic with Arthur. Merlin squashed his lingering guilt over how determinedly he'd sabotaged Arthur's efforts at courtship. \"Do you not have a title of some sort, now? Shall I call you my lord also?\"\n\"Oh good gracious, no,\" Merlin said, noticing with glee how Arthur glared at him as they climbed the castle stairs. \n\"His Excellency does have a title, and he'll get used to it, eventually,\" Arthur said. Mithian took his arm, her smile growing wider when Merlin blushed. \nThey passed through corridors festooned with flowers and wreaths, Arthur and Mithian making small talk about horses and hunting. Finally, after what seemed like an interminable walk with knights and attendants clacking along behind them, they entered the Great Hall, which was largely absent of courtiers. Mithian gestured to a table full of food - platters of succulent meats, bowls brimming with fresh fruits, and many shining pitchers of wine -- and said, \"Please, help yourselves.\" \n\"Would you like a cup?\" Arthur said, waving off a servant as he reached for a pitcher. \n\"Please,\" she answered, taking Merlin's arm as Arthur poured wine for them all. Voice pitched just for Merlin's ears, she said, \"I always knew there was something special about you, Merlin. Something that made Arthur place his trust with you.\" \n\"My lady, my magic is not special,\" Merlin answered, a hot flush touching the sides of his face. \"And it is not the reason--\"\n\"No, you mistake me -- I don't mean to imply you somehow used your magic on Arthur.\" She stopped, and regarded him for a moment. \"It is not really your magic which makes you special at all. Certainly that is not why Arthur has given you his heart.\" She smiled, and touched his cheek, then turned to take her cup of wine and make more diplomatic small talk with Arthur while Merlin stood staring after her. \n\"Make way for the king!\" came a voice at the front of the hall, and King Lot strode in, a contrast in every way to his wife. Where she was willowy thin, Lot was stocky of build, muscular like a warrior, though not as tall as Arthur. Where her smile was gracious, Lot's expression beneath his cold green eyes was a good deal colder -- more calculating. He was, however, every inch a king, and his royal swagger was unmistakable. It reminded Merlin, unpleasantly, of the way Arthur had carried himself when they first met, so many years before. \nAs Lot drew to a halt before Arthur with his advisors in tow, he seemed surly and ill-at-ease, his eyes cutting over Arthur, then all his knights, until finally they came to rest on Merlin with a gleam of interest. \nBeside Merlin, Arthur tensed. \n\"Welcome to my Kingdom, King Arthur of Camelot.\" \n\"King Lot,\" Arthur said. \"It has been a very long time.\" \n\"So it has.\" With what seemed like some difficulty, Lot dragged his attention away from Merlin, and focused his sharp gaze on Arthur. \"There is a feast prepared in your honor tonight. I trust I will see you there. Until then, I will leave you in my lady's capable hands.\" And without so much as an acknowledgement to his queen, Lot turned and beckoned to his advisors. With apologetic bows, they followed their king, leaving the queen standing there alone. \nThe wave of immediate and total dislike which swept over Merlin was beyond his control, even as Queen Mithian composed herself with a smile. Aside from Lot's boorish treatment of her, Merlin could not have said why he disliked Lot -- only that he did. \nMerlin looked at Arthur, who stood smiling, but there was a worrisome tightness about his eyes. Arthur's fingers closed about Merlin's wrist. \"Stay by my side at all times when we are at formal affairs,\" Arthur said quietly.\nMerlin nodded; his trust in Arthur's instincts was absolute. Especially when they mirrored his own. \n**\nWithin the first hour of their arrival, it became painfully clear to Merlin that the days of wandering off alone and exploring were well over. He spared a wistful thought for the time when he'd been just an anonymous servant. Sir Erevald escorted Merlin to one set of rooms, and led Arthur to another to chambers nearby. Their rooms were close enough in proximity that Lot's opinion of Merlin's status was quite clear. Merlin's room was furnished with brocade and polished stone, and was larger than Arthur's chambers in the citadel. \nMerlin barely had time to investigate his rich surroundings, or greet the stone-faced servants who arrived with his ridiculous trunk, before he was whisked off to the empty throne room with Arthur and presented with a schedule for his afternoon. \n\"We have no one here who practices magic at your level of skill,\" Sir Erevald said, handing him the scroll, \"but we would appreciate your instruction regardless.\" \nMerlin looked to Arthur; this was a perfect opportunity to find out the proficiency of any sorcerers Lot had at his disposal, and assess their power. \"By your leave, sire,\" Merlin said, and the corner of Arthur's mouth quirked up. Merlin's eyes narrowed; he was enjoying Merlin's deference far too much. \n\"By all means,\" Arthur said. \"I'm apparently going to inspect the army, and see to the preparations for a tourney in my honor.\" He sounded so regally long-suffering at having to sit out the large majority of the action that Merlin couldn't begrudge him a smirk or two over Merlin's predicament. \n\"Your Majesty,\" Merlin said, inclining his head. \n\"Leon will accompany you,\" Arthur said, and Leon stepped forward almost before Arthur had finished his sentence. The cold knot of worry in Merlin's belly grew tighter, and he nodded his understanding. \n\"Highness,\" Leon said, taking his leave of their king. He stood at Merlin's shoulder as Merlin followed Sir Erevald through the cold corridors. \nIt was not surprising, really. Arthur's distrust of Lot was as apparent as Merlin's inherent dislike of him. Merlin wanted to ask Leon what he thought, what his impressions were, but it was not the time, and there was no knowing when they might have a moment alone. So he met Leon's eyes, and a tiny nod passed between them; Leon was there for Merlin's safety, but also for the same reasons Merlin had taken the invitation: to see for himself what defenses Lot had in place. \nThe four magic-users who greeted Merlin in what passed for Lot's library were a sorry bunch. They introduced themselves one by one, stammering as they did so. Sauris was first, and oldest; he bowed gracefully, his white hair flowing over his blue robes, and said, \"I am acquainted with the physician, Gaius, and studied with him many years ago -- perhaps you know of him?\"\n\"I do,\" Merlin said, and was pleased to see the fond smile on Sauris' face. \nSauris' apprentice, Edward, was about Merlin's age, with brown eyes which shone with a love of learning. The other two, Aberthol and Kynon, were black-haired twins, older than Merlin but quiet in their demeanor. They sat down at the table and pulled quills toward them, as if prepared to hear lessons from a tutor. \n\"Well,\" Merlin said, thoroughly intimidated by the prospect of teaching anyone anything about magic. He pulled out a chair and sat cautiously, with Leon to his right. \"Tell me, what do the four of you know of magic?\"\n\"I have studied it all my life,\" Sauris said. \"I left Camelot when magic was banned there, and have wandered ever since.\" He smiled and added, \"All the magic I know comes from spells and enchantments, my lord; I was not born with magic, as Aberthol and Kynon were.\"\n\"I'm no lord,\" Merlin said hastily, though Leon frowned at the blatant flouting of protocol. \"Please, call me Merlin.\" \n\"Merlin,\" Aberthol said, his blue eyes shining. He said no more, but only looked at Merlin, as though the sun had risen above him, and shone upon him. \nMerlin cleared his throat. \"Um, Aberthol. You and your brother were born with magic?\"\n\"Aye,\" Aberthol said, and his eyes flashed gold; as they did, the books on the table flipped open in unison, their pages waving lightly as if caught in a spring breeze. Merlin smiled. It was rudimentary magic, the kind he had performed unawares as a child. Clearly the brothers had some powers, but not to the extent of Merlin's own. \n\"And you, Edward?\"\n\"I was not born with magic, but I have made a great study of potions, and of curing the effects of magic,\" Edward said. He touched a book on the table before him. \"I would be most grateful if you would review my work, my lord...Merlin. If you would add to my body of knowledge.\" \nMerlin sat back in his chair and took in the state of the room around him. The shelves held a bare minimum of volumes; clearly the knowledge here had been selectively culled. The most dangerous volumes were either locked up, or gone forever, much as Camelot's library had passed into Sir Geoffrey's watchful hands after the purge. \n\"I'll be happy to look over what you have,\" he said. \"I can't teach you much -- it wouldn't be wise, you understand, until our kingdoms have treated -- but I may be able to help with certain things.\" \n\"Anything you can teach us would be most welcome,\" Sauris said. \nEdward pushed back his chair suddenly, his eyes fixed on something behind Merlin. \"Majesty,\" he said, bowing low. The others scrambled from the chairs. Merlin turned to see Lot leaning in the doorway, one hand on the hilt of his sword, the other fiddling with the top buttons of his tunic. His gaze was fixed on Merlin, much as it had been in the throne room. \n\"Sit,\" he said to his magic-users, who all eased down into their chairs like mice, quiet and meek. Not that Lot would have noticed, for his eyes were entirely for Merlin. \"So,\" he said. \"You are the sorcerer the Druids have been whispering about, the one called Emrys, yes?\" \n\"That is what the Druids call me, yes,\" Merlin said, acutely conscious of Leon standing by his side. It had been only minutes since Arthur and Merlin were separated. Clearly Lot wasn't wasting any time; whatever his agenda was, he was moving toward it without delay. \n\"They say you can stop time,\" Lot said, smiling slightly. \"But such a thing is not possible, or so I've been told.\" \nMerlin paused to wonder just how Lot might have come by such a piece of information. The idea that a Druid (or two, or three) had given up their life because Lot wanted to know every detail of Merlin's powers sent a cold chill down his spine. \n\"Perhaps you should take that up with my king,\" Merlin began, but Lot interrupted him. \n\"Oh, I will, boy, but at the moment, your king is not here. Is he?\" Lot made a show of looking about the room, then threw his arms wide. \"Your king is occupied with shiny armor and horses, and has left his sorcerer to his own devices. And I wonder, just what might those devices be?\"\n\"You asked me to speak with your magic-users,\" Merlin said. He could feel his magic gathering itself, a pool of power within, and knew by the way Aberthol and Kynon shifted in their seats that they could feel it, too. \n\"No,\" Lot said. \"I asked them to speak with you.\" His gaze shifted to Sauris. \"Well?\"\nSauris rose and bowed, looking distinctly sad, and said, \"Your Highness, all we have been told is true. Although we have not seen him perform magic, I have never felt such immense power in one so young.\"\n\"Power is a dangerous item in the hands of the young,\" Lot said, moving from his place in the doorway, and toward Merlin. Leon began to rise, and Merlin stayed him with one hand on his shoulder. He had no need of Leon's sword; even if Lot were to try something, and if all the would-be sorcerers in the room were to assist, Merlin was in no danger. \nWhen Lot was beside Merlin, he reached out for the book Edward had placed on the table and ran his fingertips over it, as if caressing a woman. \"Magic has its place in the order of things. It is meant to be the foundations of greater power, of men achieving order.\"\n\"You mean conquest,\" Merlin said, as Lot's heat soaked into his skin -- too much heat, like being drowned in an inescapable sun. \n\"I mean order,\" Lot answered. \"Magic is meant to be controlled, or it will control, and that is not the natural order.\" He paused, and when he lifted his eyes to Merlin, they first raked up Merlin's body as if he was a woman, or some particularly juicy bit of beef, prepared especially for the feast. \"Does your king control your magic, Merlin?\"\n\"My magic exists only so I may be of service to my king.\" \nLot held his gaze, green eyes searching Merlin's until Merlin wanted desperately to break the gaze. \"I'm sure that's true,\" he said finally, as his eyes dropped to Merlin's lips, and a small smile formed over his face. He shoved the book away, and with a scornful glance at Leon, made his way to the door, his leathers creaking. \"Until this evening's banquet, sorcerer,\" he said, and was gone. \n\"Merlin,\" Leon said tightly, but Merlin only smoothed his hand over Leon's shoulder. He took a deep breath and sat back down at the table, taking note of Sauris' red face, and how the man could not meet his eyes. \n\"Well,\" Merlin said. \"Let's begin, then, shall we?\"\n**\nThe rest of the afternoon was a blur of magical instruction and correction, during which Merlin assessed Lot's sorcerers to be of average talent with much to learn. Merlin was exhausted by the time Leon shepherded him back to his rooms to change for the banquet. \n\"We should find Arthur,\" Merlin said, as he rifled through the abominable trunk for something suitable to wear. Finally he emerged with the linen tunic and red velvet jacket, which would please Arthur best. \n\"There will be time enough for that later this evening,\" Leon said. \"Hurry now, we are running late.\" \n\"But he will want to know--\"\n\"Later, Merlin,\" Leon said, while Merlin yanked on his shiny new boots (one of which squeaked, and the other of which was a bit too small). \"Tell him at the feast, unless you think we are in danger.\" \n\"No,\" Merlin said grudgingly. Leon hustled him from the room and down the corridor, and they emerged into the banquet room before Merlin even realized they were in the right place. It was disorienting, not being required to run about the palace, fetching and carrying things for the king. Merlin quite missed it, and even more, missed the inside knowledge being a servant could bring. \nThe banquet Lot had arrayed for them was spectacular, and Arthur was handsome as always, resplendent in his mail and red cloak. Merlin did not miss the way Arthur's appreciative gaze swept over him, so different to the proprietary way Lot had looked at him. He was pleased for Arthur to notice him; the idea of what Arthur might be thinking brought a flush to his skin. \nMerlin moved to Arthur's right, politely declining the place of honor a servant offered him on King Lot's left hand, where his queen would normally be seated. \"My place is with my king,\" he said, with a graceful bow to Lot. \n\"Is that so?\" Lot said, immediately taking interest in Merlin's refusal as servants moved closer to pull out their chairs. \"I've heard it said you were the king's manservant for many years. Has he always kept you so tightly tethered?\"\n Merlin gave him a polite smile. \"King Arthur has no need of tethers for his people. We serve him because he is a great king.\" \n\"Of course,\" Lot said, smiling, though there was now something burning in his gaze, something far more palpable than earlier that day. Merlin recognized it for what it was: lust -- for power, and perhaps something more, something that made Merlin turn his gaze away. \n\"Merlin.\" Arthur's voice, sharp and commanding, and Merlin immediately withdrew from Lot's side and went to Arthur, sliding into the chair beside him. Of course, Arthur missed nothing, and though he ignored Merlin entirely through most of the dinner, Merlin could feel the weight of his concern like a touch upon his skin. \n\"Where is the queen tonight?\" Arthur asked quietly. \n\"Indisposed,\" Lot said, a thin edge of anger in his voice. Merlin wondered if her sudden indisposition had anything to do with Lot's disposition, but said nothing. Instead, he took a sip of wine, and watched Arthur's shoulders tense into a hard line. \nThe food was generous, and looked delicious, but Merlin found he was not able to eat. He listened to the polite but edgy conversation between Arthur and Lot, and watched the jugglers, and waited for what he knew now was inevitable. It would have made no difference if he'd been able to give Arthur details of his confrontation with Lot earlier in the day; Lot had set the course clearly. \nIt finally happened, well into the evening, when Lot had downed a considerable portion of the wine being passed about. Arthur had barely touched his own, and Merlin later found reason to be immensely grateful for that. \n\"Perhaps your sorcerer could show us a trick or two,\" Lot said, leaning forward at the table to see around Arthur. \n\"I'm afraid not,\" Arthur said, his tone so distant and formal, he might as well have been ordering an execution. \"In Camelot, magic is used at court for business of state, and only when it is necessary. Merlin does not perform tricks like a trained animal.\" \nLot turned an intent gaze on Arthur, then back to Merlin. \"I'm certain he does perform as required,\" he said, something low and quite unpleasant in his voice. \"For his king.\" \nArthur turned toward Lot then, and though Merlin couldn't see his face, the anger pouring from him was evident in his shoulders. \"We thank you for your hospitality, King Lot, but my party and I will retire now.\" \n\"A moment,\" Lot said, clamping a hand onto Arthur's forearm. He leaned in, to whisper something to Arthur, something Merlin could not hear, and Arthur's tension ratcheted up impossibly higher, so much so that Merlin turned and looked at Leon with distress. Leon was watching as well, and so was Percival, who slowly put his cup down and moved his hand to the hilt of his sword. \n\"Never,\" Arthur said, pushing back his chair. His voice rang out above the din in the banquet hall, and the chatter subsided for a moment. Lot's hand clamped tighter, and he gave an ugly laugh before saying something more Merlin strained to hear, but could not. \nArthur shook off Lot's hand and stood, and as one, the knights of Camelot sat to the edges of their chairs, alarmed by the look on their king's face. Lot's knights followed suit, and the tension in the room ratcheted up even as the noise died away completely. \nMerlin stood, edging closer to Arthur as Lot removed his hand from Arthur's arm and sat back, a mocking smile on his face and his hands in the air, a gesture of supposed supplication. \nIn a low voice Merlin fervently hoped most of Lot's knights could not hear, Arthur said, \"Let me be clear, Lot: if I hear you have given insult to any member of my court in this way, I will kill you where you stand.\" \nMerlin drew in a breath as the smile vanished from Lot's face, and a darkening look replaced it. His grip tightened on the arm of his chair, and he met Arthur's gaze, neither moving to make challenge, nor shrinking from the threat. Merlin could see him calculating his next move in those short, tense moments. Finally, he looked away, glancing at his knights, his casual pose belied by the vibrating tension of his body. \nArthur watched him a moment more, then turned his head slightly, until he could see Merlin from the corner of his eye. Merlin knew immediately Arthur was checking to see how close he was. When Arthur beckoned Leon over with a gesture, and stopped him at Merlin's side, the situation became very clear. \nNo one stopped them as they left the banquet hall, Leon and Percival forming a guard at Arthur and Merlin's back. \"Sire, I--\" Leon began, as they approached Arthur's chambers, but Arthur shook his head, ending the question. \nArthur said tersely, \"We are leaving immediately. Have the servants pack us up and be prepared to leave in one hour. You and Percival are to stand guard over Merlin until that time.\" \n\"Yes, sire,\" Leon said, as Arthur shoved open the door, pulling Merlin in after him and closing it with a slam. \n\"What the hell was all that about?\" Merlin asked, staring at Arthur, who was vibrating with rage.\n\"He offered to buy you,\" Arthur said. \"As if you were a dog, or a piece of property.\" \n\"He...what?\" A laugh bubbled up in Merlin's throat, because it was ridiculous; of course Lot hadn't meant it. It had been the drink talking; it had to be. Something unpleasant unfurled in Merlin's belly, as he remembered all the looks Lot had given him, and the pieces fell into place. \n\"And when I refused, he said if I did not mind my property, then someone would take it from me and use--\" Arthur broke off, a muscle in his jaw clenching so violently Merlin feared he might not be able to speak. \"Use it as it was meant to be used. He was not subtle in the least.\" \nMerlin placed his hand on Arthur's shoulder, gentle. It really was of no consequence, other than the personal insult to Arthur, because Merlin was perfectly capable of handling such threats. \"I told you, Arthur, I would never allow anyone to take hold of the power I possess,\" Merlin said, shocked by the blaze of hatred in Arthur's eyes. \"My magic is only for you to command.\"\n\"It is not just your power he craves, Merlin,\" Arthur said through gritted teeth. Through force of will, Merlin could see him calming, the way he sometimes did in the heat of battle. \"It is all of you -- the power, and you, together. He wants you under his control. Completely.\" \n\"It will never happen,\" Merlin said, shaking his head at Arthur. \n\"You're damn right,\"Arthur said, staring at him. \"I'll kill him if he or any of his men dare to come near you. If he dares touch you, I'll--\"\n\"It would mean war,\" Merlin said, staring back. \n\"Yes. It would.\" Arthur threw his sword on the table, and turned away from Merlin. \n\"You would go to war, over-\" \nHe couldn't even say it. The idea was too immense. \nOver me.  \n\"I understand,\" Merlin said softly. \"But Arthur, I would never allow anyone else to use my power. Surely you know I could not be persuaded to serve another king, no matter what pressure he applies. I would not allow them to bind my magic, and--\"\n\"I don't give a damn about your magic, you idiot,\" Arthur snarled, and suddenly Merlin's back was against the wall, and Arthur's mouth was hot on his, vicious in its claim over Merlin. \nMerlin gasped into the kiss, his hands going to Arthur's shoulders as Arthur leaned in to him, and then he slid his hands, up into Arthur's hair, holding on for dear life as Arthur kissed him mercilessly, taking his mouth until Merlin's entire body was shaking with desire. \nWhen Arthur drew back, Merlin shivered at the look in his eyes. \"There is no time,\" Arthur said, \"for more than this.\" And with that, he dropped to his knees and reached for the laces of Merlin's breeches, tugging them open with deft pulls. In seconds his mouth was on Merlin, meltingly hot and wet, his tongue tracing the head of Merlin's cock before he began sucking in earnest. \nMerlin looked down at his king on his knees before him, looking up at him as if he dared Merlin not to come, and his breath stopped in his throat. \"Arthur,\" he whispered, as Arthur shoved his hips back into the wall and held them there, taking Merlin deep into his mouth. \nThree more strokes into Arthur's mouth, and Merlin was coming, his eyes locked with Arthur's, and Arthur's hands leaving bruises on his skin with the force of their grip. \nMerlin gathered enough breath into his lungs to power his limbs, and then he reached out to Arthur with magic, shoving him back and away, so that Arthur sprawled on the ground. \"Waving my hands about, doing magic as I please, honestly,\" Merlin murmured, crawling on top of Arthur to kiss him. He fiddled with Arthur's mail, tugging it aside until he could reach into Arthur's trousers and draw him out, hot and heavy into his hand. \"I could immobilize Lot's army with a single word.\"\n\"Shut up, Merlin, shut up and put that mouth to use elsewhere,\" Arthur begged him, yanking him closer for more kisses, deep wet kisses that sent Merlin gasping again as Arthur dragged his hands down Merlin's body, and beneath his tunic. \nHe barely was able to get Arthur's cock into his mouth before Arthur was coming with a triumphant groan, his shoulders lifting from the ground as he watched Merlin lick him once, twice, Arthur's spent cock twitching in his mouth. \n\"Tuck me in,\" Arthur demanded, even as his greedy hands were reaching for Merlin again. \n\"Tuck yourself in,\" Merlin said, sitting back on his heels to admire the mess of his king on the floor, mussed and half-destroyed, all because of Merlin. \"We have a long ride before we reach the border.\" \n\"I should come back with an army,\" Arthur muttered, shoving up from the ground and pulling Merlin up with him. For a moment, they leaned into each other, before they drew apart. \n\"You know Lot would send messengers with apologies before we have even reached the border,\" Merlin said. \"Because he fears your army, and the armies you can raise from our allies. And because he wants peace.\" \n\"Then he should not have tried to threaten what isn't his,\" Arthur said, staring at Merlin in a way that threatened the timeliness of their departure. \n\"And you would come back, and make treaties, and he will be properly humbled,\" Merlin said, sure of the behavior of kings, because he'd been studying the best of them for many years. \"So you may as well stay, and finish out this visit, with the knowledge that you need never return.\" \n\"Perhaps,\" Arthur said grudgingly. \nMerlin kissed that stubborn corner of Arthur's mouth, the one that refused to yield. \"So then we will stay.\" \n\"I suppose,\" Arthur grumbled, his arms closing around Merlin to press their bodies together. He kissed Merlin thoroughly, then pushed him away. \"Stop distracting me; I have to go make a show of preparing the knights to leave, so Lot can send someone to entreat me to stay.\" \n\"And I'll just stay here, shall I?\" Merlin said, sprawling out on the bed with a yawn. \n\"Damn you,\" Arthur said, staring at him. \"Be right there when I return, Merlin, I'm warning you.\" Then he turned on his heel and left the room, door clattering closed with a bang. \nMerlin turned his face into his arm and fought to quell his quickened heartbeat. Arthur would have gone to war with Lot, not for Merlin's magic, but for Merlin. It was impossible, and yet it was true. \nHe curled his fingers around soft leather bracelet hugging his wrist, and tried not to think of what any of it meant. The days had run out; it no longer mattered, and whatever Merlin might wish, even his magic could not lengthen the year.\n\n\n\n\n\nIX.\n\nThe tedious days of official visiting passed slowly, even as the frost-laden fields began to flower again, pink and yellow patches of flowers dotting the green pastures beyond Lot's castle walls. Arthur busied himself with the tourney, since it was an area where he could not help but enjoy himself. He looked up often to see Merlin at the side of the practice field, watching Arthur spar with his own knights, and with Lot's men. He found himself turning often to that gaze, showing off just a bit for Merlin's eyes alone. After all, it was not as if he did not have that right. He was the king, and Merlin was...well, Merlin was worth impressing. \nMerlin spent his days teaching his aspiring pupils, or talking with Queen Mithian. Leon reported Merlin often walked the castle gardens with her, talking and laughing. Leon's opinion of Lot's treatment of her was apparent in the flash of his eyes when he spoke of her drawn complexion. \n\"Lot is vile,\" was all Merlin said, when Arthur asked him about it in the evenings. \"I feel sorry for Mithian.\" \nEventually, Arthur could not help but turn to the topic that had been at the forefront of his mind since their arrival. \"Has she given any sign that she is unhappy here, Merlin? Or that she remains here, against her will?\"\nMerlin turned to look at him, something like quiet pride in his expression. \"Of course you would ask that,\" he said, leaning in to kiss Arthur slowly. \"But no, she has not said a word about it.\"\nArthur made time the next day to visit Mithian in the banquet hall, as she directed the servants on the placement of flowers and other decorations. \n\"My lord,\" she said, surprised, her expression changing to one of alarm as she saw his expression. \"Has something happened?\"\n\"Your Majesty,\" he said, watching her carefully. \"You do realize you have only to say the word, and you are welcome to accompany us back to Camelot for an extended visit? You are most welcome there.\" \n\"Arthur,\" she said, with the very lightest of touches to his hand. \"Your kind heart does you credit, but all is well here. I've chosen to remain with my husband as his wife and queen.\" With a small smile, she turned back to her task. \"And as you well know, a queen's work is important to the subjects she serves.\" \nArthur looked around the room at the servants, many of whom smiled as they went about their work, a stark contrast to how most behaved in Lot's presence, and he suddenly understood with crystal clarity. \n\"Did you see the queen?\" Merlin asked him that evening, as he scratched out notes from some of the books in Lot's library. \n\"Yes,\" Arthur said, thinking of the burdens of duty he had willingly accepted for the love of his people. \nMerlin's fingers curled gently around his, and remained there for some time. \nLot, for his part, seemed to have developed a sudden aversion to being in the same room as Arthur or Merlin. He faded into the background with his dogs and his wine, leaving Mithian to dine with their guests each evening, and Arthur wondered if Merlin had fiddled a bit with his will in that regard. \n\"And if I did?\" Merlin said, as he sat sprawled at Arthur's table and watched him divest himself of gauntlets and belt, of an evening. \n\"Then you must have read my mind,\" Arthur said, struggling with his mail and resenting Merlin just a bit for taking him at his word when he said Merlin must no longer dress and undress him like a manservant. He stilled suddenly. \"Did you read my mind?\"\n\"Of course I didn't,\" Merlin said, scowling as he set his cup down with a bang. \"We settled this, didn't we? I won't read your mind, and you won't be a complete prat.\" He got up and shoved Arthur's hands out of the way, once again taking on the role he was most familiar with, to Arthur's everlasting relief. It took him no time to strip Arthur out of his armor, and his tunic, and to bundle them both into the bed. \nOut of respect for decorum, Merlin still slept in his own room, most nights, but the early evening was given over to his king, and to his king's pleasure. At least, that's what Arthur told himself smugly, but that theory did not hold weight when he had Merlin stretched beneath him, bringing him to completion with one hand so he could watch the ecstasy play across his face. \nSome nights, Merlin would settle into him, quiet and still, his face nestled into the curve of Arthur's neck and his warm body curled around Arthur's. Arthur was no sorcerer, but he needed no magic to read the thoughts flying through Merlin's mind. Their days together had dwindled down to nothing, here in this foreign place, where they could be nothing to each other except the roles protocol dictated for them. \nArthur could see it in Merlin's posture, the way he seemed to be withdrawing by degrees every day, a tiny piece of himself taken back from Arthur. Soon, there would be nothing left. \nOne evening, as Merlin sighed and rolled to the edge of the bed, Arthur touched his arm. \"Stay.\" \n\"Leon and the others,\" Merlin said, looking toward the door. \nArthur closed his fingers about Merlin's wrist, a gentle request. \nThat last caused Merlin to turn to him, a questioning expression on his face. But Arthur only drew him down with kisses, because this was not a night for questions. \nOver the course of so many seasons, Arthur had grown familiar with Merlin's body, with the curves and angles of it, the places of pleasure. He reached for the oil at his bedside and used it carefully, his fingers seeking out those places inside Merlin, as Merlin ran his hands through Arthur's hair and parted Arthur's lips with his kisses, taking Arthur's mouth more deeply with every press of Arthur's fingers inside. \nSoon enough, Arthur entered him, and set a slow pace, watching Merlin's face greedily, anxious for every indication of joy, every hint of emotion. When Merlin's eyes fluttered closed, Arthur stilled inside him, waiting, until Merlin slowly blinked them open again, cloudy with lust. Arthur began moving again, slow, deep, his gaze locked with Merlin's, who shivered beneath him as he finally began to understand. \nArthur allowed everything into his eyes, every need, every wish, every hope, gave it all to Merlin in the touch of his hands, the roll of his hips where they were joined. When Merlin's eyes began to shine with tears, and he turned his head, Arthur touched his chin with two fingers and turned his face back, stealing a kiss as Merlin's breath hitched in his throat. Arthur kissed the corners of his eyes, and Merlin breathed, \"Arthur, oh,\" before coming in slow, sweet pulses in Arthur's hand. Arthur could only watch for a moment before his body demanded its own release, and he held Merlin's gaze as long as he could before succumbing to his own pleasure. \nAfter a long moment, he withdrew, and rolled from the bed to find a cloth to wash them both. Merlin curled up against him, strong at his side, and they slept. \n**\nPale strands of sunlight were creeping into the room when Arthur next opened his eyes. Merlin stood beside the bed, gathering up his scattered finery. His eyes flashed gold, and the clumpy wrinkles smoothed themselves into soft perfection. \n\"How many times did you do that to my clothing, and I was just never aware?\" Arthur asked, his voice raspy with sleep. \nMerlin startled a bit, and turned with a strange smile on his face. \"More times than I can count.\" He turned his shirt this way and that, as if he meant to put it on, but Arthur couldn't have that. Not today. He lunged forward and took hold of Merlin about the waist, ignoring his squawk of protest as he hauled him back into bed and pulled the covers up. \n\"You have duties,\" Merlin informed him, \"a very long list, you know,\" but Arthur shut him up with a kiss or two, and pinned him in a most satisfactory way with his weight until Merlin gave over, his token protest ended. \nArthur put his head back on the pillow, watching the thin stripe of sunlight grow stronger and wider. \"Do you know what today is, Merlin?\"\n\"The day we finally leave for home,\" Merlin said, turning his face away from Arthur. \n\"Merlin,\" Arthur drawled. \n\"I know,\" Merlin said, so quiet. After a moment, he reached for the bracelet on his arm, but Arthur stopped him, his hand circling Merlin's wrist. \n\"Have I ever told you my father's greatest secret?\" Arthur asked, nosing at Merlin's bare shoulder, where his skin was soft and the scent of him was strongest. \n\"Not that I remember,\" Merlin said. \"Then again, we never talked much about your father at all.\" \n\"True enough,\" Arthur agreed. \"But now seems like the perfect time. You know, for all his protests about advantageous marriage, my father married for love. You already know that I decided long ago, I would do the same.\" Arthur drew Merlin's hand to his lips and kissed his fingertips, each in their turn. \"It only took me a year to realize, I already had.\" \nMerlin stared at him as if he'd grown a second head, and had additionally sprouted wings. Arthur thought he might never forget the look on Merlin's face -- never wanted to forget, because it had been so hard-earned. \n\"We aren't...it isn't....\" Merlin whispered. \n\"It is,\" Arthur said. \"We are.\" He leaned into Merlin and kissed him, and found himself on his back in the blink of an eye, Merlin's arms around him, their kiss slowing to the speed of Arthur's contented heartbeat. \n\"Arthur, you'll have to marry, and have an heir,\" Merlin said, between kisses. \n\"I do have to have an heir,\" Arthur said, running his hands up Merlin's back. \"And I do have to marry -- properly, this time. With the Druids. But these two things are not currently related in any way.\" \n\"Is this all because Lot wanted to have his way with me?\" Merlin asked, his eyes entirely too bright with mirth. \n\"No?\" Arthur said, and laughed out loud when Merlin shoved at him, grinning. \"Merlin,\" he said, joyful, \"Merlin,\" and then there was no more discussion between them, for none was needed any longer.\n\n\n\n\n\nX.\n\nForever after, Arthur would associate the smell of damp forest and fresh-grown moss with desire. Bare feet sunk into the soft cool grass, Merlin's warm hands in his; he was surrounded by the forest, and the gentle droning of Druid chant, like benevolent bees hard at work. \nThe full moon cast white light across the grove, giving silver shadows to everything in its path as Iseldir began speaking. \"In the giving of each to the other, you must remember that you possess nothing; all must be given freely. Have patience, each with the other, for storms will come into the lives of all men, be they kings or commoners. Storms pass, and there is no need to fear them.\" He paused, and added, \"Give all of yourselves unto each other, for love is nothing if it is not received of the body.\" \nIseldir bound their hands, not with Camelot's finest ribbon, but with the simplest of vines, strong and sturdy, resilient, alive. \"Above you are the stars; below you are the stones,\" he said softly, as the chanting died away, leaving only the quiet night. \"Like a star, your love should be constant; like the stones, your love should be firm.\" \nMerlin shook a bit at this, and Arthur dared not look at him for fear he would laugh with the sheer joy of it. \n\"Arthur Pendragon,\" Iseldir said. \"Is it your wish to become one with this man?\" \n\"It is,\" Arthur said, not quietly this time, but so that all of Camelot might hear. \nIseldir nodded, his smile growing. \"Emrys. Is it your wish to become one with this man?\"\n\"It is,\" Merlin said, his eyes shining very blue. \n\"Here, among all assembled who are witness in the Old Religion, I proclaim that you are wed,\" Iseldir said. \nMerlin tugged Arthur forward and kissed him. The scent of spring flowers was all around them; garlands of green on their heads, light as a feather, yet heavier than a crown. And at last, Arthur knew the shape and form of own heart. \nThey feasted with the Druids as the moon crossed the sky, and lay in the soft grass together, always touching, as the sounds of laughter and joy echoed around them. \n\"You will be a great king,\" Merlin said, rolling to his side to press his face against Arthur's neck, as Arthur watched the stars glittering in the deep violet sky of earliest morning. \"The greatest king Albion has ever known.\" \nArthur groaned, and tugged at Merlin until he was draped over Arthur's chest. Then he proceeded to stop all his dreamy pronouncements with a deep, quiet kiss. \"Now is not the time for such talk,\" Arthur said, as Merlin gazed at him, heavy-lidded, his smile content. \n\"It will be the stuff of legend,\" Merlin said, kissing his way down Arthur's neck. \n\"Save your ridiculous predictions for later,\" Arthur growled, even as Merlin made short work of Arthur's tunic, baring him to Merlin's delighted explorations. \nOverhead, the stars danced in the brightening sky as Arthur uncovered Merlin's skin in turn, writing their shared history upon it, one careful press of fingers at a time, one gentle kiss after another, just as Merlin had set his mark on Arthur the first time they touched. \n\"Remind me,\" Merlin murmured, his fingers tangled in Arthur's hair, drawing him closer. \"There's a tale I want to tell you, about a great king, and a sword set in stone.\"\n\n\n\n\n\n\n"
}