{
    "id": "4932889",
    "url": "https://archiveofourown.org/works/4932889?view_full_work=true",
    "author": [
        "minverse"
    ],
    "title": "Jammed",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "방탄소년단 | Bangtan Boys | BTS"
    ],
    "relationships": [
        "Kim Taehyung | V/Park Jimin",
        "Jung Hoseok | J-Hope/Min Yoongi | Suga"
    ],
    "characters": [
        "Park Jimin (BTS)",
        "Kim Taehyung | V",
        "Min Yoongi | Suga",
        "Kim Seokjin | Jin",
        "Jung Hoseok | J-Hope",
        "Jeon Jungkook",
        "Kim Namjoon | Rap Monster"
    ],
    "additional_tags": [
        "Drug Use",
        "just weed tho",
        "Smut",
        "sex under the influence of alcohol",
        "Light Dom/sub",
        "Spanking",
        "cursing",
        "utter fucking smut",
        "Humor"
    ],
    "language": "English",
    "series": "",
    "published": "2015-10-04",
    "completed": null,
    "words": "11,058",
    "chapters": "1/1",
    "comments": "308",
    "kudos": "12,489",
    "bookmarks": "3,243",
    "hits": "179,337",
    "summary": "<p>The rational part of Jimin's brain screams at him to remember what his mother said about strangers and vans. But the rational part of his brain is no match for really bad whiskey and Kim Taehyung.</p>\n<p>((au where Jimin gets stuck on the interstate in the middle of a blizzard and Taehyung lives in a van))</p>",
    "notes": "<p>shoutout to the great snowpocalypse of 2k14 for inspiring me, i'd like to think that someone got laid in real life that night</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Comments are always appreciated!</p>\n<p>Come be my friend and scream your headcanons at me on <a href=\"https://www.park-loins.tumblr.com\" rel=\"nofollow\">tumblr</a> or <a href=\"https://twitter.com/loinzilla\" rel=\"nofollow\">twitter</a>.</p>",
    "text": "They haven’t moved an inch in 40 minutes.\nJimin's pissed at everything. At the snow, at the assholes who won’t lay off their horns, at that fucking garish yellow van stuck in the lane next to him.  Frustrated, he pulls out his phone and dials a familiar number. He grips the steering wheel hard as he listens to the line ring.\n“Hello?” A gruff voice comes from the other end of the line.\n“You won't believe where I am right now.”\n“Stuck on that clusterfuck of an interstate?” Yoongi asks with a sigh.\nJimin’s brow furrows as he readjusts the phone to better hear. “How did you know?”\n“Dude, it’s on the news.”  Sure enough, Jimin hears a helicopter zoom overhead. “It’s gridlocked for miles. There have been like a dozen accidents on that stretch of road alone.”\nJimin's head whips around as his eyes scan the increasingly white landscape. “Where are all the emergency responders?”\n“There are a few out there already, but the roads iced too quickly. I mean, there’s about to be a goddamn blizzard. If they send out too many tow trucks and shit right now, they said those guys will just get stuck, too. It’s gonna be a while.”\n“How long?” The silence on the other end of the line is disconcerting, and Jimin finds himself gripping the steering wheel so hard that his knuckles go white. “Hyung, how long?” he repeats.\n“Maybe overnight?” Yoongi says reluctantly.\n“Are you fucking kidding me? I’ll freeze out here.”\n“Don't be dramatic. I’m sure they’ll bring around some blankets or something.”\n“Hyung, what if I miss the wedding?” Jimin whines, flexing his already-cold fingers. \n“You won’t miss the wedding, it’s not until tomorrow. Anyway, you’d better not miss it. Hoseok will kill me. He says he has the perfect guy for you.”\nJimin rolls his eyes. “He always says that. He just sets me up with every gay guy he meets.”\n“He does not just set you up with every gay guy he meets. We’re fucking gay too, you asshat.  Plus, he says this is different.”\n“Yeah right.”\n“Whatever, you’d better still make it.” When Yoongi speaks again, his voice is softer and tinged with an uncharacteristic note of insecurity. “How am I supposed to get married without a best man?”\nJimin’s heart gives a small, sweet pang, and he feels the beginnings of a smile creeping onto his face. “I’ll make it. I’ll make snowshoes out of my tennis rackets and hike there if I have to.”\nYoongi clears his throat. “Good,” he grunts. “Text me to let me know you’re okay, yeah?”\n“Will do, hyung.”\nHe hangs up and tosses his phone onto the passenger seat, surveying his surroundings. Several people have gotten out of their cars, some talking to their neighbors, some just trying to get a better view of the road ahead. Jimin follows suit, pushing open the door and stepping outside. It feels weird, getting out of the car on the interstate, but as soon as he has a better view of the road ahead of him, he knows it’s safe. The roads are a fucking mess. The jam extends as far as the eye can see, all the way to the horizon where the sun is starting to disappear.  He can see at least two minor accidents in the immediate vicinity, where the cars simply slid uncontrollably on the newly icy roads. No one seems seriously injured, and there are a few emergency responders on the road shoulder. But it’s clear that nobody is going to be going anywhere for a while.\n“Shit,” he says, pulling his thin coat tighter around him.\n“Beautiful evening, eh?”\nJimin whirls around in the direction of the voice, eyes first landing on the awful yellow Conversion van then trailing upwards to its roof where a lavender-haired man is perched comfortably with a steaming cup clutched in his hands. He’s wearing sandals. Jimin’s initial reaction is confusion, followed shortly by irritation.\n“Excuse me?” Jimin asks without any effort to mask the annoyance in his voice.\n“The snow. It’s beautiful, isn’t it?” He reaches up with his free hand to catch a few flakes and then looks back at Jimin with a bright, irresistible smile.\nWith some effort, Jimin tears his eyes away and scoffs with as much grumpiness as he can muster. “I’ll have to remember to stop and admire it some other time, when it’s not making my life hell.”\n“Oh come on, it’s like an adventure,” the man says with a goofy, boxy smile.\n“Tell that to my frozen corpse in the morning,” Jimin spits nastily, making for his car door.\n“You should pop over for a cup of hot tea before you get too corpse-y,” the man shouts behind him as Jimin wrenches open the car door and slings himself inside. He slams it shut without a word or glance in the direction of the yellow van. Again, he pulls his jacket tight around him, the stiff seat creaking as he tries unsuccessfully to make himself comfortable. His hands twitch towards his keys as he briefly considers turning on the heat, but his hands falls back into his lap with a resigned sigh when he decides he can’t waste the gas.\nHe spends the next half hour observing a pair of young siblings in the car in front of him, bundled up ridiculously in every piece of clothing that their father could gather. He watches as they fight over a toy, get bored, and subsequently start making faces at the people in the cars around them. Jimin has two fingers up his nose, good-naturedly baring his teeth at the children in front of him in the most unflattering manner, when he hears the knock on his window. He jumps violently, jabbing his fingers further up his nose and wincing in pain as he pulls them out. He glances through the glass to his left, ready to murder, even readier when he sees who it is. It's the purple haired man, smiling a dopey grin, big ears sticking out from underneath his beanie.\n“What?” Jimin shouts through the glass.\n“I made you some tea,” the man shouts back, a little louder than necessary.\n“No thanks,” Jimin pouts as he turns away, frozen fingers screaming in protest.\n“Please? You look really cold.”\n“I’m fine,” Jimin insists.\n“You’re shivering.”\n“I’m fine,” he repeats with a roll of his eyes.\n“Your lips are a little blue.”\nJimin spares a glance to the man outside. He looks like he’s freezing, too. The wind and snow have picked up, and Jimin can tell even from the inside of his car that the temperature has dropped.\n“Fine,” Jimin says grudgingly. “You’re persistent, aren’t you?” He doesn’t mean it as a compliment, but the man seems to take it as one.\n“Yep!” he says enthusiastically, and his warm grin is completely at odds with the surroundings. Jimin pushes open the door and allows the man to press the cup into his hands, trying not to sigh audibly as the heat seeps into his nearly-numb fingers.  “You know, my van is actually pretty warm. You’re welcome to hang.”\n“Um, no thanks, I’m okay here.”\n“Suit yourself. I’ll be there,” the man points over his shoulder where the huge yellow van rests behind him, “if you change your mind.”\nJimin merely purses his lips and raises his eyebrows in response, shutting the door rather abruptly in the man’s face. Seemingly unfazed, the stranger yells over the wind, “I’m Taehyung, by the way.”\nJimin just waves his hand vaguely and stares pointedly in front of him until the man finally turns and starts trudging back to his van.  Only then does he take a sip of tea. This time, he does allow himself an audible, albeit reluctant, sigh. He glances down at the cup in his hands, a tacky Garfield mug. Of course. His eyes dart rebelliously over to the vehicle beside him. The curtains in the windows of the van are drawn, and Taehyung is nowhere to be seen. Jimin wonders errantly just how exactly he managed to make tea in a van.\nWhen his cup is regretfully empty, Jimin takes a deep, bracing breath before he opens his car door and steps out into the cold. It’s dark now, and it really has gotten colder. He sees emergency vehicles passing out blankets and water a few hundred yards back. Without further delay, he makes his way to the van and raps harshly three times against the window.  Within seconds, a grinning face pops up from between the curtains and the door opens.\n“Please, step inside my office,” comes Taehyung’s deep, rumbling voice as he gestures to the inside of his van.\n“Um… no tha-” Jimin starts, but he is stopped in his tracks as a wave of warm air hits him. He gazes inside, shocked by the cozy, well-lit interior. It looks like a tiny apartment, complete with a tiny kitchen.  “I just came to give you back your mug.”\n“Nonsense, come inside, it’s freezing out there.” Taehyung grabs his wrist and physically pulls him inside. Jimin’s sense of danger is almost instantly silenced as the warmth envelops his body. Taehyung shuts the door tight behind him and draws the curtains.\n“What the hell is this thing?”\n“What thing?” Taehyung asks as he busies himself folding a blanket on what looks like a raised sleeping area.\n“This thing.” Jimin gestures to the van around him.\n“It’s my home,” Taehyung responds like it's the most obvious thing in the world. \n“You live in a van?”\n“Yes. I’m a writer.”\nJimin waits for him to continue, cocking his head confusedly as Taehyung continues to stack blankets in silence. “I’m sorry, am I missing something? Do all writers live in vans?”\n“Only the really excellent ones,” Taehyung says with a smile. “No, I was writing a book, so I wanted this experience. You know, traveling across the country completely unencumbered, going wherever the wind takes me. I wanted to do it on a horse, but there were some permit issues.\" His brow furrows for just a second before he's smiling again. \"Anyway, I think the finished product is gonna be amazing. Think Jack Kerouac meets E.L. James meets Sylvia Plath.”\nJimin stares at him, dumbfounded. “I’m sorry, E.L. James as in... Never mind.”\n“I actually finished up the other day and sent the draft off to my publisher. Heading back to a stationary life after this. Do you want a beer?”\n“No, I really did just come to give you back the mug. I’m fine in my own car.”\n“Oh, come on. I have food and warmth and an extra pee bottle. It used to belong to my friend Shrimpy, but I lost him back in Busan.”\n“What happened to Shrimpy?” Jimin mutters almost fearfully, tensing a little as his eyes dart towards the door.\n“Oh, he’s fine. They were able to reattach the finger.”\n“Oh… good…” He relaxes. A little.\n“So, what do you say?” Taehyung asks excitedly, plopping himself down in front of Jimin and leaning forward excitedly. “Sleepover?”\n“If I said yes, it would go against everything my mother ever taught me about strangers and vans.”\n“Can I tempt you with a can of Vienna sausages?”\nJimin cringes as the image of Shrimpy’s severed finger pops into his mind. “Um. No.”\n“What about a peanut butter and banana sandwich and a bottle of shitty whiskey?”\nHe knows he’s going to say yes. He tries and fails to convince himself that he’s staying because of the promise of food and warmth, not because of the way Taehyung’s collarbones peak out from beneath his shirt, or the elegant slope of his nose, or the way he smells strangely of cotton candy and something a little spicier.\n“Okay?” Jimin responds, and it sounds like a question. But Taehyung bounces happily regardless.\n“This is great! Oh, right, what’s your name?”\n“Jimin.”\n“Hmm, Jimin. We haven’t met before, have we?”\nJimin scoffs. “I think I would have remembered that.”\nTaehyung appraises him through narrowed eyes. “Given your tone, I don’t quite know how to take that.” Jimin shrugs halfheartedly, and after a second, Taehyung shrugs, too. Again, his smile is back in an instant. “So what do you want to do first?”\n“I’m gonna go with whiskey, whiskey first,” Jimin answers with certainty.\n“Perfect!” Taehyung beams as he springs up, crouching down his head barely brushes the ceiling. He rummages through the cabinets and eventually finds what he’s looking for, pulling out a nearly-full bottle of alcohol and thrusting it triumphantly over his head.\n“I don’t have any mixers, so I hope you’re okay drinking cheap, room temperature whiskey out of plastic cups.”\n“I honestly cannot think of anything I’d rather do right now,” Jimin says, running a hand through his hair.\nTaehyung smiles and goes about pouring the drinks, but he pauses halfway through and stares up suspiciously at Jimin. “You’re not fuzz, are you?”\n“What?”\n“We’re breaking several open container laws right now. You’re not a cop, right?”\n“No?”\nTaehyung’s face relaxes visibly. “Ok good.” He pulls something small and white out from behind his ear. “Then wanna blaze?”\n“Jesus Christ,” Jimin exclaims. “That’s not a cigarette, is it?”\n“Cigarettes are bad, Jiminnie.” Taehyung smirks weirdly and digs a lighter out of his pocket. “Do you smoke?”\n“Not since college,” Jimin acknowledges, eyes following Taehyung’s fingers as he puts the rolled paper to his lips, flicks the lighter, and inhales. Taehyung holds his breath for a moment before exhaling slowly.\n“You say that like it was 84 years ago. You can’t be more than 25. What has life done to you in three years?” He holds out the joint, which Jimin eyes skeptically.  Taehyung quirks an eyebrow. “You look like you need to relax.”\n“What if they clear the roads soon?”\n“Dude haven't you been listening to the radio? They say it’s going to be at least 10 hours before they can get things moving again. It’s about to fucking blizzard for God's sake. Come on, it'll take the edge off. We'll sober up in no time.”\nJimin hesitates for a moment before he accepts it, bringing it to his lips and taking a long drag. He lets the smoke sit in his lungs for a moment before he exhales. “Fuck, that’s good.”\n“Good man. Damn, I wish I had my trombone. You haven’t lived  until you’ve smoked out of a trombone,” Taehyung says, patting him on the back and pushing a cup of whiskey forward towards him. “Let us raise a glass to snow, without which, I would not have a hot stranger in my van.”\nJimin's face is warm as Taehyung smashes his cup forward into Jimin's before throwing it back. Jimin does the same, coughing violently as the whiskey hits his throat. “That is terrible whiskey.” He takes another hit from the joint to ease the pain.\n“As God intended,” Taehyung says as he pushes himself to his feet. He rummages again through the small cabinets and sets to work making the sandwiches. He wastes no time in making a magnificent mess of the tiny countertop.\n“This is the weirdest day of my life,” Jimin says to no one in particular.\n“Then it must be a good one, right?”  Taehyung asks over his shoulder.\n“We’ll see,” Jimin mutters as he leans back on the plush rug covering the floor of the van, closing his eyes, and enjoying the lightness in his body. Taehyung is beside him a minute later, plucking the joint from his fingers and shoving a plate into his lap.\n“The only utensils I own are sporks, so I hope you can manage.”\nJimin stares at him incredulously, brows furrowed. “We’re eating sandwiches.”\n“And?” Taehyung asks as he delivers a spork-full of sandwich into his mouth.\nJimin looks down at the spork on his plate and then back at Taehyung. “How the fuck do you usually eat sandwiches?”\n“Well, I mean I know a spork isn't ideal, but you don’t have to be a snob, damn dude,” Taehyung murmurs with a mildly offended look before sporking off another bite of his sandwich. He chews cutely and Jimin suppresses the urge to smile. Instead, he too picks up his spork and follows suit. “So where are you headed?” Taehyung says with a mouth full of peanut butter and banana.\n“A wedding. My best friend’s wedding.”\nTaehyung’s chewing slows, and his eyes narrow as he appraises Jimin. “Oh?”\n“Uh, yeah. I’m the best man. Or, one of the best men. I guess there are two at gay weddings?”\nTaehyung’s eyes widen almost comically, his cheeks bulging with food. “Ah. Gay. Gay wedding. Gay wedding tomorrow.”\nJimin bristles immediately. “Yes, gay, is that a problem?”\n“Oh! No, I myself am what some might call homosexual but what is actually more in the realm of pan- never mind. Anyway, so, gay, you were talking about gay. Are you gay?” he asks casually, then tries to swallow the massive amount of food in his mouth.\n“Yes…” Jimin replies suspiciously.\n“Oh, cool, very cool.” Taehyung says nonchalantly. “So do you have a date?”\n“Unfortunately I think they’re setting me up there.”\n“What, you’re not happy about that?” Taehyung asks, brow creased.\nJimin breathes deeply and leans back, picking up the joint from an ashtray and taking another drag. “The last guy they set me up with was a professional magician-slash-clown-slash-stripper. He pulled scarves out of some very unsettling places.”\n“Sounds like a free spirit.” Taehyung raises his fist in solidarity. “Not your type?”\nJimin shakes his head. “Not exactly.”\n“Wait!” Taehyung says excitedly. “Let me guess your type.” He settles back on the floor, leaning on one elbow and facing Jimin. “Corporate. Serious. Wears a watch. Pays his taxes. Thinks Big Bang Theory is funny.”\n“Oh fuck off,” Jimin says with a glare, but his voice lacks any true vitriol.\n“I’m right, aren’t I?” He stares at Jimin who says nothing but takes another swig of whiskey, face contorting slightly at the taste.  “I bet I just described your last boyfriend.”\n“Maybe,” Jimin replies elusively.\n“So why didn’t it work out?” Taehyung asks as he takes the joint from between Jimin’s fingers.\nJimin considers. “We just stopped. Just fizzled, I guess.”\nTaehyung takes a deep breath and flattens his elbow so that he can lay down level with Jimin. “You know, the thing about types is that they’re bullshit. You date a certain type of person and it doesn’t work out for a reason. So you wonder what’s wrong every time things go bad, but you keep dating the same kinds of people anyway?” Taehyung blinks slowly, eyes otherwise not leaving Jimin’s face. “Bullshit.”\n“Well I’m not dating a fucking clown stripper.”\n“Never said you should,” Taehyung says with a cocky smile.\n“Ok, if you know so much about me, then what kind of guy should I date?”\nJimin turns his head to look over at him and does not miss the mischievous sparkle in his eyes as he replies, “I think you’d do well with a dashing writer. Somebody romantic enough to keep you happy, weird enough to keep you entertained, and hot enough to keep you interested. Fizzling would be a thing of the past.”\nJimin feels his heart rate accelerate and turns his head away again, staring instead at the ceiling. “Well I’ll have to keep my eyes peeled for a dashing writer then.”\nJimin can hear the indigence in Taehyung’s voice as he pushes himself to his elbows. “Excuse me, I am extremely dashing.”\n“Yeah?” Jimin asks cockily. He smirks as he turns his head back towards Taehyung. “Okay, well go ahead. Sell me on this dashing writer.”\n\"Okay.\" Taehyung's appraising eyes fall heavy on him, mouth scrunching up to one side as he thinks. “So when you were with these corporate types, what did you do for fun?”\n“I dunno,” Jimin shrugs, “Watched movies, went to dinner, went shopping. Normal things.”\nTaehyung rubs his chin thoughtfully. “You know, you look like a suit on the outside, like you might be the kind of person who is really fulfilled by things like that. But I don’t think that’s who you are.”\n“Oh really?” Jimin says, trying to look casually amused, but he can feel his heart thundering against the inside of his chest. He’s sure Taehyung can hear it, too.\n“I mean hey, there's nothing wrong with suits. And sure, I’m sure all that was nice, but people like you and me, we need more. We need things that feed the soul,” he exclaims dramatically, pausing only to take another short drag from the joint.  “You need someone who hasn’t already sold theirs for a corner office and a nice suit. Somebody who's always looking for new ways to tell you he loves you. Maybe he’d feel sporadically artistic and try to make a sculpture of you from your used tissues which still bear the essence of you. Or drag you all around town taking pictures of you in all of his favorite spots so that he can see two of his favorite things at once. Maybe he’d drive 100 miles to take you to the beach on a whim just because you said you missed the sun, or to the museum to show you a painting that reminded him of you. Maybe your anniversary dinner would be whiskey and banana sandwiches because that was the first meal you ever shared.”\n“Sounds exhausting,” Jimin says with a dry laugh, but he can feel the heat radiating from his cheeks, especially at Taehyung's last comment.\n“Can’t be more exhausting than constantly pretending to be happy when you’re not.”\nThey're quiet at that, Jimin enjoying the feeling of his mild high.\n“How was the sex?”\nJimin splutters a little at that but manages a quick, “It was good.”\n“Not great?”\nJimin waves his hands about randomly and wildly. “Yes great, whatever!”\n“I’m sure it was.”\n“…But?” Jimin sighs knowingly.\n“Nothing,” Taehyung says with faux disinterest, looking away and busying himself by pouring another shot of whiskey into both of their cups.\n“Oh come on, what now?”\n“Here, drink up,” Taehyung says as if he hasn’t heard him, passing him a cup. Jimin grabs it and swallows it down in one shot, now finding that he enjoys the accompanying burn.\n“What were you going to say?” Jimin tries again. “How has the sex I’ve been having been inferior to what you could offer?” The alcohol has made him bold, and the words sound daring coming out of his mouth. He thinks he sees Taehyung’s breath hitch, lips slightly parted, his tongue darting out nervously. Jimin tears his eyes away and tries not to think about what that tongue could do.\n“Well it’s not really something I could tell you. It’s more something I’d have to show you,” Taehyung says, staring hard at Jimin, eyes a dare.  \nHis heart is pounding hard in his throat. “Show me, then.”\nFor a moment, it’s quiet save for the whistling of the wind as it roars between the cars outside.\n“Here?”\n“It’s not like you’re gonna have another chance,” Jimin almost whispers, trying to sound more confident than he feels.\nIt’s almost like he’s flipped a switch, a confident smirk creeping onto Taehyung’s face, eyes predatory as he subtly shifts his body closer. “Don’t say things you don’t mean, Jiminnie,” Taehyung warns him, voice low. His hand is warm as it creeps up Jimin’s knee, up to his thigh where it rests, kneading the muscle there. “Do you want me to show you?”\n“Yeah,” Jimin breathes as he feels Taehyung’s hand burning through his clothes.\nTaehyung nods his head slowly, chewing on his bottom lip as his eyes bore into Jimin’s. “Pants off.”\nJimin complies without hesitation, his only complaint being that Taehyung temporarily had to remove his hands from his thighs. He tosses his pants aside, subconsciously awaiting further instructions. \n“Now the shirt,” Taehyung orders, and Jimin shudders at the authority in his voice. Jimin pulls his shirt over his head, left only in his boxer-briefs, breaths coming hard as Taehyung reaches up to drag his hands down Jimin’s torso. Halfway down, he starts to dig his nails into Jimin’s flesh, grinning at the sharp intake of breath he receives in response. “Such a good boy.”\n“What about you?” Jimin asks shyly, gesturing to Taehyung’s clothes.\n“All in good time, Jiminnie. Good sex is a process. And I want to make this good,” He pulls Jimin on top of his lap, hands meandering down to squeeze his ass, and Jimin can feel himself growing hard against Taehyung’s stomach. “It’s all about knowing what your partner likes. What do you like?”\nJimin flushes, mumbling as he averts his gaze, “What do you mean what do I like?”\nTaehyung chuckles. “What do you like during sex?”\nJimin feels vaguely mortified, like it’s his first time all over again. “Just... sex?”\n“Oh, this is going to be fun. Don’t you worry, we’ll find out exactly what you like.” Taehyung leans forward to press open-mouthed kisses to Jimin’s neck, sucking and biting until he hears a soft moan. “Ah, do you like that?”\nJimin nods his head silently, eyes glued shut.\n“Good, I like that, too. I like marking up pretty little things like you, leaving reminders for days after.” As he’s speaking, he reaches down to cup Jimin through his underwear, Jimin’s head falling forward onto Taehyung's shoulder as he bites his lip to contain the noises that are threatening to spill out. Taehyung gently cradles his face, appraising him. “And fuck, I really like the noises you make. I want to hear how good you feel.”\nHe leans forward and gently presses his lips to Jimin’s, just the very tip of his tongue reaching out to flick at his upper lip. Jimin moans obediently into the kiss, lips moving languidly with Taehyung’s. There’s a building heat, a slow burn, an anticipation. He can feel Taehyung’s erection pressing into his ass, and he rolls his hips down, enjoying the whoosh of air from Taehyung’s lungs as he briefly breaks their kiss. His hands find Jimin’s ass again, tightening his grip almost possessively.\n“What do you want?” Taehyung asks, nuzzling his neck as his hands continue to kneed his ass.\n“I want-” Jimin tries to form a coherent thought. “Can I…” he starts shyly, trailing off as he feels his face flush.\n“Can you what? Talk to me,” Taehyung urges.\n“Can I taste you?”\nTaehyung swallows hard, his confident mask wavering for just a second. “Fuck, Jimin.” He gently kisses Jimin’s nose and leans back so that the smaller boy is straddling his waist. Jimin runs his hands greedily down Taehyung’s still-clothed chest, digging in his nails slightly and taking note of Taehyung’s small gasp as he does so. With a pout, he tugs petulantly at Taehyung’s shirt, grinning as the the man underneath him gives in and sheds the garment. Jimin knows he looks good like this, lips swollen, hair mussed, skin flushed, so he makes a show of it, arching his back as he gets on all fours to hover over Taehyung’s body. He relishes the feeling of Taehyung pressing his body closer and closer as Jimin trails slow, open-mouthed kisses down his chest, pausing over a nipple to lick tauntingly. Taehyung growls lightly, and Jimin smirks against his skin before continuing lower, nipping gently at his hipbone.\n“Stop teasing,” Taehyung commands, his brows knit.\nJimin smirks as his hands deftly undo Taehyung’s belt and zipper. Jimin tugs off his pants and underwear in one go, mouth watering as he looks down at Taehyung’s smooth, thick thighs and leaking cock.  He takes Taehung’s length in his hand, enjoying the heat and firmness of it, and licks a thick stripe from the base of Taehyung’s cock up to the tip, lapping at a bead of precum that has gathered there. He hums contentedly. “You so taste good.”\nTaehyung, who had been watching Jimin’s performance with bated breath, lets his head fall back against the pillow with a groan. “Jesus fucking Christ.”\nJimin pauses and smirks up at him, clicking his tongue chidingly. “Language. It’s nearly Sunday, you scoundrel, the day of the Lord.”\nTaehyung peeks down at him skeptically. “Says the guy casually commenting on the taste of my- ah fuck Jimin!” His head falls back meekly again as Jimin suddenly swallows him down, dragging his tongue along the underside of his cock, gagging slightly as it hits the back of his throat. Slowly, he drags his lips back up Taehyung’s length before sinking his mouth down abruptly again. He doesn’t gag this time, instead humming contentedly, taking pleasure in the rough, low moan that escapes Taehyung’s throat.  He works his mouth up and down, gently massaging Taehyung’s balls with his free hand. His jaw starts to ache and he feels himself getting sloppy, but a moment later, he hears Taehyung’s voice say gently, “Hey.” When he doesn’t respond, Taehyung tries again. “Hey, hold on, I don’t want to come yet.” Feeling impish, Jimin takes Taehyung’s cock especially deep, swallowing around it. “Hey!” And then Taehyung’s hand is tangled in his hair, dragging him up roughly so that their faces are level again. “What happened to being good?”\nJimin shrugs his shoulders, rolling his hips so that his still-clothed cock drags deliciously against Taehyung’s. Taehyung reaches down, frustrated, as he pulls off Jimin's underwear, leaving them flesh to flesh. A heavy breath escapes Taehyung’ lips as Jimin starts to move rhythmically on top of him, and something within Jimin itches to test the boundaries. He pulls back and deliberately slows the movements of his hips, and the frustration is clear on Taehyung’s face, his hands urging Jimin to go faster. “Stop screwing around,” he orders, his voice rough.\nJimin, however, ignores him completely, smirking gleefully as he continues to move at a glacial pace.\nFinally, Taehyung loses it. “Hey! Park Jimin.” And Taehyung surprises him by smacking him sharply on the ass. It stings a bit but sends a wave of pleasure shooting up Jimin’s cock. He freezes, the moan caught in his throat. “Do you want to be punished?” Taehyung asks harshly.\nJimin looks down at him and has the decency to flush, his face turning a pretty pink underneath a sheen of light sweat.\n“Oh, you do?” Taehyung asks, the smirk evident both on his face and in his voice. Jimin’s eyes are big and unsure as he nods hesitantly. “Well then.” Taehyung grabs a handful of Jimin’s ass and squeezes harshly before he draws back again and spanks him hard. Jimin moans shamelessly this time, grinding down against Taehyung as he does so. Taehyung rubs a soothing hand over the skin that is blooming red, emitting a throaty growl as his eyes travel across Jimin’s body again.\n“Again,” Jimin pleads.\n“Again, what?”\nJimin flushes even redder. “Again, please.”\n“Again please, who?” He squeezes Jimin’s ass again as he asks, eyes trained carefully on his face as Jimin’s eyes flutter closed.\n“Again please, Taehyung,” Jimin breathes desperately.\nWith a smirk, Taehyung complies, bringing his hand down hard against Jimin’s blooming pink skin, the sharp sound mingling with Jimin’s keen. “Now are you ready to be good?” Taehyung asks, moving his hand to gently stroke Jimin’s cock. Jimin nods, biting his lip. Taehyung pulls him down so that their bodies are flat against each other and rolls them over so that he is now hovering over Jimin. “Good.”\nHe works himself between Jimin’s legs, peppering his chest with kisses as he rubs the palm of his hand over Jimin’s hard, leaking tip. As Taehyung spreads the precum down his cock, Jimin thinks that he’s never been this hard in his entire life. Taehyung’s hand wanders down to massage his balls, pressing a tentative finger to the skin beneath them. Jimin groans and resists the urge to push his hips down.\n“Ready, baby?” Taehyung asks as he nips at Jimin’s hipbone, and lost in a daze of hot hands and mouths, Jimin doesn’t even ponder his meaning before he’s nodding his head compliantly. It’s not until he feels a cold, wet finger pressing against his hole that he fully understands.\n“What the fuck?” he yells, squirming his body away at the intrusion.\n“What?” Taehyung asks, his eyes still glazed.\n“I’m not- I don’t... bottom.” He feels like his face is on fire, and he mumbles the words more to the ground than to Taehyung.\n“Well what the hell did you think I was going to do with my finger near your asshole?”\n“I dunno,” Jimin says sheepishly.\nTaehyung tilts his head to the side like a dog who’s just heard a confusing sound. “I just assumed… It seemed like…” He pushes himself to his elbows. “Do you mean you don’t bottom, or you just… haven’t bottomed?”\n“I just never… I always…” Jimin breaks off, embarrassed, rubbing the back of his neck nervously.\n“Well how about this?” Taehyung asks, scooting closer to Jimin. “Since we’re trying new things tonight, why don’t we just try it, and if you still don’t like it, you can fuck me. You say stop, I stop.”\nJimin eyes him skeptically. \n“I’ll make you feel good, I promise.”\nJimin turns the idea over in his mind, cock throbbing a little when he thinks about Taehyung fucking him. Warily, he lowers himself back into a reclined position. “Okay.\"\n\"Okay.\" Taehyung lips his licks, eyes hungry as he yanks Jimin’s hips forward. “Just relax, I’m going to take good care of you.”\nTaehyung’s deep, reassuring voice does actually put him at relative ease as he feels the now slightly warmer finger circle around the rim of his hole. The slow press of the finger inside isn’t as unpleasant as he thinks it’s going to be.\n“Okay?” Taehyung asks as he stares down at Jimin’s expression.\n“Yeah. Fine. Weird, but okay.”\nTaehyung pumps his finger a little to spread the lube around, his other hand working up and down on Jimin’s length. A few minutes and another finger later, Jimin cringes a little, but the slide gradually gets easier.\n“Do you want me to stop?”\nJimin shakes his head, face flushed. “No, it’s-” He breaks off with a small moan. “I think I like it.”\nTaehyung leans down to kiss the smooth patch of skin above Jimin’s hipbone. “Good.”\nThree fingers, and Jimin is rutting down against his hand. “More,” Jimin whines. Taehyung doesn’t need telling twice. He scrambles over to a small drawer in the makeshift kitchen, grabbing a condom and tearing it open before Jimin can even complain about his absence. “Hurry,” Jimin insists, looking utterly debauched.\nTaehyung smacks the side of his ass as he adjusts the condom on his length. “Be patient.” The look on Jimin’s face as Taehyung slowly slides inside of him has Taehyung groaning as he struggles to control himself. “Okay?” he asks, teeth gritted.\n“Good, really fucking good,” Jimin breathes, squirming. “Move.”\n“Give it a second,” Taehyung warns him despite his every instinct to slam forward into Jimin’s heat.\n“I don’t care, please just fuck me. Hard.”\nWhatever semblance of control that Taehyung possesses dissolves at Jimin’s words. He snaps his hips forward so hard that Jimin’s entire body shifts up a few inches with the force, a broken, ragged groan leaving his mouth as Taehyung withdraws briefly and repeats the action. Taehyung’s hands grip tight at Jimin’s hips, pulling him down to meet the brutal thrusts.\n“Why… did… I… never… try… this… before?” Jimin manages to say, his words punctuated rhythmically in time to Taehyung’s thrusts.\n“Fuck if I know,” Taehyung says between harsh breaths. “Look at you, you were born for it,” he insists as Jimin clenches around him, and his face screws up in an effort not to come immediately. “God you’re so sexy.” Jimin positively keens at the praise, and Taehyung smiles. “You like that too? Do you like hearing what a good boy you are? How pretty you look when you’re getting fucked?” He reaches down and presses his thumb to Jimin’s lips. “How good your lips looked wrapped around my cock?”\nJimin can only whimper beneath him.  With one final snap forward, Taehyung leans down, presses his lips to Jimin’s and mutters, “Hands and knees.”\nTaehyung pulls away to allow Jimin to get himself into position, ass in the air. Taehyung’s hands come to rest reverently on his behind, rubbing gentle circles into the still-red skin. He brings his hand down hard, Jimin crying out as he drops to his elbows. “Please, Taehyung,” he begs.\nTaehyung yanks Jimin’s hips towards him and carefully pushes into him again, resting only a moment before he resumes his relentless pace. The fingertips of one hand dig hard into Jimin’s hips, the other landing sharp, stinging blows on his ass. Jimin hears the pathetic whines and moans spilling from his own lips, feeling Taehyung’s pace stutter occasionally now. Taehyung reaches around to jerk him off, and Jimin can feel his orgasm creeping up on him as Taehyung's skin continues to slap lewdly against his.\n“Gonna come,” Jimin mutters, amending a second later, “Can I come?”\nA deep, rumbling moan from Taehyung sends a jolt of pleasure down his cock, but he manages to stave off his orgasm, waiting for permission. “Come,” Taehyung says huskily, hips unyielding but sloppy now. Jimin pitches forward as his orgasm sweeps over him. There is white behind his eyelids as he clenches around Taehyung, and he registers a hard bite on his shoulder, adding to the intensity of the sensation. Sweaty and twitching, he feels Taehyung slump lightly on top of him, realizing that he must have come too.\nThey collapse onto the blankets, chests heaving as Taehyung peels off the condom and tosses it into a small trashcan.\n“Fuck,” is all Taehyung can manage.\n“Fuck,” Jimin concurs.\nThey lay there for several minutes as their breathing returns to normal, listening to the howling wind.\n“So how’s life on the bottom?” Taehyung asks.\n“...Fuck,” Jimin repeats, hand coming up to muss his hair. They are quiet for several more moments before Jimin breaks the silence. “Who are you?”\n“Kim Taehyung, author, sex god, part time bee-keeper, at your service.”\n“I don’t know what’s real anymore.”\n“My dick has that effect sometimes. You’ll come back down to earth in a few hours.”\nJimin’s subsequent glare falls flat as Taehyung beams like the sun and pulls him close.\n \n \nThe first thing that he notices when he opens his eyes is that the left half of his body is extremely warm while the right half is rather cold. He vaguely registers a comforting weight on top him, blinking the bleariness from his eyes and taking in the large expanse of smooth, golden skin pressed against his own.\nIt’s only after a minute that he recognizes the vibrating of his phone, the noise that woke him in the first place.\n“What the fuck-” he asks no one in particular, groping for his phone among the many blankets. The weight on top of him shifts slightly, and he ignores the weight of a sleepy gaze heavy on his face.\n“Hello?” he mumbles into his phone, clearing his throat when he hears his own voice raspy with sleep.\n“Did you die?” comes Yoongi’s sleepy voice from the other end of the line.\n“No, asshole.”\n“Oh. Cool. Well it looks like they’re nearly done clearing the roads, so I wanted to make sure you were awake.”\nJimin pulls the phone away from his ear and glances down at the clock on his phone. 4:00 am.  Ten hours since they’d moved. Six hours until the wedding.\n“Told you I’d make it, hyung,” Jimin says with a little smile.\n“Yeah well you’re not here yet.”\n“Tell Hobi I can’t wait to see him.”\nYoongi makes a disgusted noise. “I would, but he won’t let me see or speak to him the day of. Says it’s bad luck.”\n“You guys are so fucking cute.”\n“Shut up. Just get your ass over here.”\nThe line goes silent, and Jimin chuckles lightly as he starts searching the van for his shirt.\n“In a hurry?” a deep voice comes from beside him as he feels warm lips pressed up against his arm. He coughs awkwardly as he finally locates his shirt and shrugs it back on.\n“Yeah, my friend says they’re getting things moving again. I should get back to my car.”\n“Do you want some coffee or something? Or maybe a kinder, gentler wake-up?” Taehyung asks slyly, hand sliding underneath the fluffy blanket. Jimin claps his hand on top of Taehyung’s just as it creeps up to his thigh.\n“Uh, no. In fact, this all seems like a really terrible decision in the light of day.”\n“It’s not even light yet,” Tahyung complains. “Hey, if nothing else, I’m a great story. And a pretty good lay, I think. You are, too.  So we’re all winners here, right?”\nJimin feels his ears heat up, staring very hard at his shoelaces as he ties them. “Right. Well,” he says uncomfortably, “It was really nice… uh… meeting you.”\n“You too, Park Jimin,” he says with a smile that is somehow both smug and kind.\nJimin smiles a terse half-smile and reaches for the van door.\n“Hey,” Taehyung calls after him, and his hand pauses on the door handle.\n“Yeah?”\n“This guy your friends are setting you up with… Just promise me you’ll give him a chance today, yeah? Even if he’s not exactly your type?”\nJimin’s smile is genuine this time. “Yeah, okay.” With that, he pulls open the door and steps out into the cold. He turns his head, squinting far down the road and sees a couple of cars starting to shift forward slowly.\nHalf an hour later, his car is inching forward along with the rest of them. At one point, he sees a blur of yellow from his left as the faster traffic moves quickly past his lane. Through the windows, he can see a hand waving wildly in his direction.\n \n \n \nHe arrives outside of Yoongi’s house exhausted, letting out a great sigh and slumping over his wheel as he turns off the car.  A body hits his parked car with a dull thud, his head snapping up towards the source of the noise.\n“Jiminnie!” A tall man in an elegant coat stands peeking inside. Jimin sighs and pushes open the door enough to force the man to stumble backwards.\n“I’m sorry, at what point did you become older than me, you fucking brat?”\n“I missed you,” Jungkook grins widely before he adds, “Hyung.”\n“Missed you too, Kook,” he admits, a smile creeping onto his face despite himself. He allows himself to be pulled into a hug. “Is Yoongi inside?”\n“Yeah, he’s just getting everything ready to head over to Jin’s,” Jungkook tells him as he starts to pull away, but suddenly he pauses, brow furrowed in confusion. He leans back in towards Jimin and takes several obvious sniffs. “Why do you smell like sex?”\n“What?” Jimin scoffs.\nJungkook’s lip curls in disgust. “Did you jerk it in your fucking car in the middle of an interstate?”\n“Jesus ch- No, I did not.”\n“But you definitely… Then why do you…” In just a second, his face morphs from horrified to elated. “Did you get laid last night?”\nThe look of mortification on Jimin’s face seems to be answer enough.\n“Hyuuuuung!” Jungkook can hardly contain his joy, eyes shining. “That is literally amazing, how the hell did you manage to get laid. In the middle of a traffic jam. In a fucking blizzard? Teach me your ways!”\n“Jungkook, I cannot handle this right now,” he responds, massaging his temples with his fingers. “Let’s just focus on our best friends. Who are getting married today.”\n“Fine,” Jungkook agrees with a small pout, leading him to Yoongi’s front door. “But you have to tell me everything later.”\nYoongi greets him with a gummy smile and a gruff hug. “Thank God you’re here. Namjoon already dropped one of my shoes in the toilet and lost the rings.” Seeing Jimin’s look of horror, he adds, “We found them, don’t worry.”\n“What can I do?”\n“Just go get ready and make sure you don’t lose these.” He presses a small box into Jimin’s hands, then pauses for a moment. “Also, why do you smell like the gloryhole in a truckstop bathroom?”\n“He got laid!” Jungkook screams helpfully from the other room. Jimin feels like his face is engulfed in flames.\nYoongi shakes his head, wiping the hand that had touched Jimin’s back on his shirt. “Oh to be young again. Go take a shower, you sick bastard. I can’t in good conscience let Hoseok set you up with his best friend when you’re all jizzy like this.”\nJimin nods stiffly, pursing his lips as he stuffs the small box in his front pocket and heads down the hall towards the bathroom. He gently pulls the bathroom door closed behind him and turns on the shower, wearily pulling off his clothes and sniffing them gingerly.  He cringes, then turns to the mirror, appraising his appearance. His neck and chest are littered with purple and red marks, and his lips look raw and swollen. No wonder they knew.\nHe’s just about to turn away when he spots something out of the corner of his eye, a small glimpse of black underneath his arm. Furrowing his eyebrows, he lifts his arm to reveal a messily scrawled phone number and a distorted smiley face in what appears to be permanent marker.\n“Are you fucking kidding me?” he asks himself as he cranes his head for a better view. “When did he even-”\nHe tries his best to feel properly creeped out, but only a moment later, he’s got his phone in his hand, awkwardly twisting his body to get a clearer view so he can punch the digits into his phone.\n \n \n \n“So are you going to tell me exactly how you managed to get laid mid-traffic jam?” Yoongi asks him in the car.\n“Right. So. I’m trying to think of a way to say this that doesn’t sound terrible. So… this guy invited me into his van… and we fucked.”\n“…Okay.”\n“It sounds worse than it is, but like… I only used Shrimpy’s pee bottle once.”\n“I don’t understand a word of that sentence but ew. What was the guy like?”\n“He was…” But Jimin can’t think of a way to properly summarize Taehyung in just a few words. “We ate sandwiches with sporks and he left his number on my armpit. I only found it like a second ago. And I think he said something about making a sculpture of me from my used tissues which still bore my essence?”\n“Was he hot?”\nJimin sighs heavily and throws his head back against the headrest of the car. “So hot.”\n“So you’re going to call him right?”\nJimin draws back with a scowl. “What? No.”\n“Why the hell not?”\n“Did you miss that whole thing about sporks and tissues?”\n“I dunno, you sounded kind of fond when you were talking about it. Had this wistful little smile and everything. It was gross.”\n“Fuck you.”\n“You saved his number didn’t you?”\n“…Maybe.”\n“Yeah, obviously you don’t want to call him,” Yoongi says with a roll of his eyes.\nJimin clicks his tongue, arms crossed. “Can we just focus on you right now? Aren’t you getting married in like two hours?”\n“Oh, shit.”\n \n \n“Jimin!”\n“Hey, hyung,” Jimin says shyly as Jin pulls him in for a bone-crushing hug. He pulls Jimin inside the house, which is already buzzing with activity as caterers and florists rush to get everything set up.  “Wow, it looks amazing!” Jimin marvels as he takes it all in.\n“It really does,” Yoongi agrees softly behind him. “Thanks again for letting us do it at your place, I don’t know what we would have done…”\nJin cuts him off with a wave of his arms. “It’s nothing, honestly. I’m honored I can help.”\n“Is Hoseok already here?” Yoongi asks, looking around again.\nJin chuckles. “He’s already up in the guest room with his half of the wedding party. Insisted on being hidden away by the time you got here.”\n“Ridiculous,” Yoong mutters fondly.\n“You guys can get ready in my room. It’s right next door to them, but as long as you can’t see him, I think he’ll be satisfied.”\nOnce they’re in Jin’s room, Yoongi puts his ear up against the wall and smiles when he hears low voices through the wall. “Love you!” he shouts through the drywall.\nThere’s a moment of hushed silence right before a rapid banging reverberates through the wall and a deep voice from behind it yells “No contact!”\n“Cute,” Yoongi chuckles as he turns to unzip the suit bags. “I hope you know how to tie a bow tie because I have no fucking clue.”\n“You think that I, your best man, would show up on your wedding day not knowing how to tie a bow tie?”\n“Probably.”\nJimin purses his lips and sighs. “Yeah, okay,” he admits before yelling, “Jin-hyung?”\nJimin is reclined on the bed, absentmindedly scrolling through his phone as Jin works on Yoongi’s bow tie, when he finds himself staring at Taehyung’s number.\nSuddenly, from behind his right shoulder, he hears, “Is that him?”\nHe turns to see Jungkook behind him, perched on the bed. “What? No.” He moves to hide the phone, but Jungkook is too fast, snatching it from his hand before he has a chance. “Jungkook, give it back, I’m not fucking around,” he growls as he lunges to get it back.\n“No way, you should call him,” Jungkook insists, crawling backwards on the bed and holding it out of his reach.\n“Be careful, those suits are rentals,” Jin says distractedly as he straightens Yoongi’s bowtie.\n“Jeon Jungkook, I swear if you press that button I will kick the living shit out of you,” Jimin warns as his movements get more desperate. Jungkook just gives him a stiffarm, attention still focused on the screen in front of him.\n“Hyung, I’m doing you a favor.” And to Jimin’s horror, his phone screen flashes calling sporkboy.\n“You fucking brat!” he yells as he finally makes one great lunge forward and successfully grabs it. But a muffled noise makes him stop. “Shh!” he insists, pressing a hand over a laughing Jungkook’s mouth. “Is that…”\nEveryone in the room suddenly cranes their ears, and it seems like they can hear it too, through the wall.\n“What is that?”\n“Is somebody having sex?” Jin asks in disbelief.\nJimin presses the end call button, and suddenly everything is silent.\n“No way. No fucking way,” Jimin breathes as he launches himself off the bed, pressing the redial button and holding his ear up to the wall. And as it rings again, there’s no way he doesn’t recognize his own voice, moaning Taehyung’s name through the wall.\n“No. Fucking. WAY,” he repeats as he barrels through the door and barges into the room next door.\nSure enough, there he is in all his purple-haired glory, digging desperately though his bag before pulling out his phone triumphantly. “Oh. Shit,” Taehyung says as he looks up and catches a beet-red, fuming Jimin coming at him full-force.\n“You have just breathed your last breath you fucking bastard!” Jimin knocks him down onto the bed, scrambling for the phone.\nYoongi bounds in the room behind him, hand flung ridiculously over his eyes, and Hoseok makes a little noise of despair. “No, babe, I’m not looking I swear, I just have to get Jimin,” he insists as he blindly gropes for Jimin, tripping on a pair of shoes and falling on his face instead.\nA harried looking Jin appears behind him and bellows, “THOSE ARE FUCKING RENTALS,” as Jimin begins choking Taehyung with his own tie. Jimin feels Jin’s hands on his shoulders, gently trying to pry him away without rumpling the tux.\nYoongi, still covering his eyes, has given up on restraining Jimin and is instead crawling one-handed towards Hoseok, who has broken down into dramatic tears, sobbing, “It’s ruined, we’re cursed!”\nJungkook remains in the doorway, clutching his side in laughter as he does his best to keep the camera steady.\n“JEON JUNGKOOK GET OVER HERE AND HELP,” Jin screams at him as he restrains Jimin’s raised fist.\nJungkook sighs before shutting off the camera. “Fine.”\nBetween the two of them, they manage to contain Jimin, dragging him bodily from the room as he digs in his heels and shouts, “YOU HAVENT SEEN THE LAST OF ME, YOU FUCKER.”\nA second later, Namjoon shuffles up to the door, snacking on something he’s obviously snagged from the caterer and looking completely oblivious. “What did I miss?” Yoongi uncovers his eyes long enough to glare at him, then shuts them again and turns his attention back to Hoseok.\n“What the hell was that?” Jin asks as he shoves Jimin back into his room.\nJimin fumes silently, arms crossed, breathing still heavy. Yoongi appears at the door and strides up to him, grabbing his collar. “You asshole, Hoseok is crying. Convinced we’re doomed for a divorce now.”\n“Sorry,” Jimin says shortly, eyes flitting guiltily upwards to Yoongi’s face.\n“You gonna tell us what that was all about?”\nJimin pouts. “It’s embarrassing. Make Jungkook leave.”\n“What?” Jungkook shouts in outrage as Jin ushers him out the door and shuts it behind him. “Hey, not fair!” comes his muffled voice through the door. A suspicious bumping tells them that he’s got his ear pressed to the wood outside.\n“So?” Jin asks expectantly.\n“You know how last night I got laid on the interstate in the back of a van?”\n“First of all, ew, I did not know that but thank you for sharing, Jimin,” Jin says with a disgust expression.\n“Well I did. Told the guy I was on my way to a wedding in the city. That I was the gay best man at the gay wedding. I mean really what are the odds he didn’t know, how many fucking gay weddings are there in this city every day?”\n“Ok, so?” Jin prompts.\n“Jungkook just called the guy from last night.”\n“And?” Yoongi asks obliviously.\n“I just heard the phone ringing next door.”\n“Oh. And that sound we heard through the wall was...?”\n“…Us, last night,” Jimin mutters, his face aflame. “Ringtone.”\n“Wait wait wait,” Yoongi says, massaging his forehead with his fingers. “Taehyung is van guy?”\nJimin nods morosely.\nYoongi bursts out laughing. “Oh my God, I should have fucking known, of course it was Taehyung.”\n“Hyung,” Jimin pouts, “This isn’t funny.”\n“Jimin I’m sorry but this is goddamn hilarious. You know Taehyung was the one Hoseok was going to set you up with, right? Hoseok even showed him your picture. He totally knew it was you.””\n“He… what?” Jimin throws himself back onto the bed and groans, thinking back to last night. “Ok now a lot of things make sense. He used my surname. I never told him my surname, and he knew my surname. I feel so dumb,\" he groans, beating his fists against his forehead. \" Hey, what the hell? Why didn’t you show me his picture?” Jimin demands.\n“Tae was on this thing for a while where he thought each photograph stole a little bit of his soul, so pictures of him were hard to come by.” Jimin’s groan borders on a sob. “Aw hey buddy, don’t be too mad. Knowing Taehyung, he probably thought this would be romantic or some shit, not totally deceptive and embarrassing.”\n“I just want to die a little,” Jimin whines, pressing a pillow over his head as if to smother himself.\n“Well you can die later,” Yoongi says, slapping the side of Jimin’s bruised ass. Jimin winces. “But first, I need to get married. And I need you to promise me that you’re not going to attack Hoseok’s best man and almost ruin the wedding. Again.”\n“Hyuuuuuuung.”\n“Nope, sit your ass up and pinky promise.”\nJimin grumbles as he pushes himself into a seated position and extends a grudging pinky finger. “Fine. But only because I love you.”\n“Hey guys,” Jungkook yells through the door, “Sporkboy is out here and he wants to come inside.”\n“Do not,” Jimin says in a low, warning voice as Yoongi starts to back away with a wicked smile. “Do not leave me.”\n“Yeah, okay Jungkook, we’re coming out,” Yoongi says, as he makes for the door.\n“Jin-hyung…. please,” Jimin begs. “I beg you.”\nWith an apologetic smile, Jin allows himself to be dragged behind Yoongi.  “I’ll be right outside,” he reassures him. Jimin tries not to panic as the two older boys exit the room, Yoongi laughing lightly at Taehyung and patting his shoulder as he enters. The door shuts ominously behind him.\n“So...” Taehyung starts, a nervous smile plastered on his face as he appraises Jimin’s scowling countenance. “We meet again.”\n“Are you fucking kidding me?”\n“I’m sorry!” Taehyung exclaims, “I’d planned on spitting some smooth line about fate bringing us together again... Like, remember the last thing I told you was, hey, give the blind date a chance right? So I thought it’d be like super charming if you just showed up and that guy was me.”\n“Well wow, I am just charmed off my ass,” Jimin says dryly.\n“I’m sorry,” Taehyung repeats, head hanging a little.\n“And what the fuck dude, what’s with the ringtone?”\n“Oh,” Taehyung says sheepishly, face coloring as he rubs the back of his neck anxiously. “Uh, my butt accidentally recorded it on my phone in the midst of things last night, and I just, I just really liked the way you sounded…  And I swear, I meant to put it on silent, and then it just kept ringing and I couldn’t find it in my bag and… I’m so sorry.”\n“Jesus Christ,” Jimin mumbles, massaging his forehead.\nTaehyung stands there, head hung in apology. “Did I mention how sorry I was?”\n“Once or twice.”\n“So…”\n“So,” Jimin huffs, “We can talk later. Let’s just go out there and be good best men. Or at least, better best men. We’re fucking awful.”\n \n \nIt’s weird standing across from Taehyung as two of his best friends get married. At one point, their eyes meet from opposite sides of the aisle, and Taehyung shoots him an uncharacteristically shy smile before dropping his eyes to his feet then turning back to the grooms.  Despite all his efforts to remain stony faced, he can’t stop the small smile that creeps onto his face in response.  \nAnd if Taehyung had looked beautiful, disheveled and sandaled in the back of a gross yellow van, that was nothing compared to the way he looks in a tuxedo, pastel hair swept back, eyes sparkling and adoring as Yoongi and Hoseok seal their union with a kiss. Jimin swipes at his own eyes as his gaze flickers back and forth between the happy couple and Taehyung.\n \n \nHe’s in the midst of chugging a much-needed beer when Hoseok approaches him with a wary Taehyung in tow.\n“Now Jimin I’m going to pretend that I don’t know that you fucked my best friend in a dirty van in the middle of an interstate last night and instead I’m just going to introduce you to this great guy that I think you’re really going to like.”\n“Excuse me, my van is not dirty,” Taehyung pipes in from behind him.\nHoseok continues like he didn’t hear him. “So Park Jimin, please meet my very good friend, Kim Taehyung. He’s 24, an author, and in a very short time he will not be living in a van.” He tugs Taehyung lightly forward and forces him to extend a hand, which Jimin reluctantly takes. “Taehyung, this is Park Jimin, 25, accountant. Pays his taxes-“\nTaehyung makes a noise of disgust\n“- but he’s got the flexibility of a Russian gymnast and the tongue of Gene Simmons.”\n“I am aware,” Taehyung smirks. Hoseok glares hard at him, looking completely repulsed. “Sorry,” Taehyung recovers, “It’s very nice to meet you Jimin.”\n“I don’t want to play this game,” Jimin says tiredly.\n“Whatever, do what you want,\" Hoseok pouts, \"I’m going to go whine to my husband about what assholes you guys are. I can’t believe you fucked this up.” Taehyung opens his mouth as if to respond, and Hoseok shushes him before retreating into the small crowd.\n“Are you still really angry?” Taehyung asks quietly.\n“I wouldn’t say angry exactly-…”\n“Ok, good, because like my van is right outside, so we should go give those shocks another test run, if you know what I me-“ At the look on Jimin’s face, he stops. “Just kidding.”\nJimin raises his eyebrows. “Were you?”\n“Yeah, of course. Unless… you…” He scans Jimin’s face for a moment before continuing. “Yep, definitely kidding.”\n“I knew this setup was going to be a disaster.”\n“Oh come on, it wasn’t a disaster.” He smiles falters slightly under Jimin’s withering glare. “Ok, it was a near-disaster, but look, lots of other great things happened too. For instance, you got some great dating advice and a kickass sandwich. Also, we both got hot wedding dates.”\n“You are not my date.”\n“Yes I am, Hoseok said I was. His wedding, his rules.” He pauses for a moment, scratching his chin. “Let’s see, what other good things came from this? Oh! We also had mind-blowing semi-public sex, oh and you learned you like it up the butt,” he says rather too loudly as an old woman passes by, looking scandalized.\n“I regret everything,” Jimin says solemnly, draining the rest of his beer.\n“Do you really?” Taehyung asks, and Jimin feels a little guilty when he looks up from the bottle in his hands and catches a glimpse of Taehyung’s crestfallen expression.\n“I mean… I guess not everything,” Jimin mumbles quietly.\n“Well I don’t regret anything,\" Taehyung proclaims proudly, and Jimin shoots him a deadly glare. \"...I mean, besides deceiving and publicly embarrassing you. Obviously,\" he recovers. \"What I mean is, I actually really like you.”\nJimin's heart dances a little at his words, but he tries his best to keep his face slightly grumpy. “You do?”\n“What’s not to like? You’re a catch. Hoseok was right. He told me so many great things, and I haven’t once been disappointed with the real deal.”\nJimin’s absentmindedly circles his finger around the rim of his bottle for several seconds as he stares out at the lively room around him. “I can’t tell if I like you or hate you.”\n“I could work with either. Both, even.” Taehyung takes a deep breath through his nose. “Look, I know I really fucked up. And I wish I could say I’d never fuck up again, but I’m me, so I know I would. All I can say for sure is that whatever I’d do, I’d do it because I liked you.” Jimin just nods his head slowly, eyes trained on the floor, so Taehyung continues. “Is there any chance?”\nJimin finally sets down his bottle on the table behind him and looks up at Taehyung. “Maybe.”\n“Really?” Taehyung asks excitedly.\n“Calm down, a maybe is not a yes,” Jimin cringes. “I need some time to process this fucking day.” He considers for a moment. “Hey, where will you even be? Aren’t you giving up the van life soon?”\n“Oh, I’ll be around,” Taehyung says cryptically, smirking ridiculously.\n“Stop that or I’m leaving right now forever.”\n \n \n“Have you heard from sporkboy?”\n“We were talking for a while, but he's been suspiciously quiet lately,” Jimin says, readjusting the phone between his cheek and shoulder as he does the dishes. “I think he’s planning something.”\n“That’s not good. That’s never good,” Yoongi warns.\n“You don’t have to tell me.” A soft beeping on the line tells him that another call is coming in, and he sighs when he sees the name on the screen. “Damn. Speak of the devil and he shall appear.”\n“He’s calling?”\n“Yeah, I’ll call you back later. Tell your husband I say hey.”\n“Will do.”\nJimin tries to calm his racing heart as he presses the “accept” button on his phone. “What do you want?” He tries to sound as annoyed as possible.\n“Lovely to hear your voice, too.”\n“What do you want?” Jimin repeats in a softer tone.\n“I had Hoseok send a copy of my book to your house. Go check your porch.”\nJimin wipes his hands on a dish towel and heads to his front door. “Why am I concerned?”\n“Why are you so suspicious? Can’t I just do something nice?”\n“I don’t know…” Jimin replies as he cautiously opens his front door and peeks out. “Can you?”\n“Yes.” His voice is pouty and defensive.\nJimin opens the door the rest of the way and looks down. A book. “It’s really just a book.” He is dismayed to find that he actually sounds a little disappointed.\n“I told you. See, I can chill.”\nJimin picks it up and leafs through it. “Actually this is kind of cool. I guess you were-” He breaks off as he catches a glimpse of bright yellow on the other side of his bushes. “Kim Taehyung. Are you at my fucking house?”\nThere is silence on the other end, then all of a sudden, an engine roars to life nearby. “No, I am not.”\n“You are! You are at my fucking house. How did you even know where I live?”\n“I’m not here! I mean THERE, I’m not THERE,” he insists as the van shoots forward a couple of feet.\n“Hold on!” Jimin says despite himself, smacking himself in the forehead, and the van comes to a screeching halt. “Um. Don’t go yet. I guess.”\nThe engine dies immediately. “Really?”\n“….Yes really.”\n“Really really?”\n“I’m about to change my mind.”\n“No! Sorry, one second, I’ll be right in.”\n“Wait,” he pauses, and he can almost feel Taehyung holding his breath on the other end of the line. ”Don't come to me. I’ll come to you.”\n "
}