{
    "id": "5021158",
    "url": "https://archiveofourown.org/works/5021158?view_full_work=true",
    "author": [
        "orphan_account"
    ],
    "title": "Love In Slow Motion",
    "rating": "Explicit",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Harry Potter - J. K. Rowling"
    ],
    "relationships": [
        "Draco Malfoy/Harry Potter",
        "Sirius Black/Remus Lupin"
    ],
    "characters": [
        "Harry Potter",
        "Draco Malfoy",
        "Sirius Black",
        "Remus Lupin",
        "Scorpius Malfoy"
    ],
    "additional_tags": [
        "Alternate Universe - Canon Divergence",
        "No Epilogue",
        "Muggle living",
        "Squib Scorpius",
        "Teacher!Harry",
        "Fluff",
        "Smut",
        "Single Dad Draco",
        "muggle teacher Harry"
    ],
    "language": "English",
    "series": "",
    "published": "2015-10-18",
    "completed": null,
    "words": "11,481",
    "chapters": "1/1",
    "comments": "137",
    "kudos": "13,104",
    "bookmarks": "1,724",
    "hits": "152,837",
    "summary": "<p>Harry flushed. “I’d like to do that again.”</p>\n<p>Draco threw his head back and laughed. “Would you, now?”</p>\n<p>Blinking up, Harry reached up with a shaking hand and brushed a bit of Draco’s blonde fringe away from his forehead. “Yeah. I would. Unless you’ve got someone better to get home to.”</p>\n<p>“Are you joking? Potter, this is my fifteen year old fantasy come to life. But better. So much fucking better.”</p>\n<p>Harry’s eyebrows went up. “Fifteen?”</p>\n<p>“Well, it was more post-Quidditch hate-sex. But close enough.”</p>",
    "notes": "<p>Okay so this is my first technical Drarry. The Wolfstar tag is a background ship but they're in it enough to count for the tags. I'm extremely uneasy about my characterisations about this, but hopefully I haven't done it too terribly. If so, feel free to let me know in comments. I got this idea after a chat with some friends about how interesting it might have been if Draco's son had been a squib. Someone mentioned poetic justice and I thought, what a terrible thing to pin on a child, but how many of the characters would have thought that, you know? Anyway it's not as in-depth as I wanted but hopefully it works. xx</p>",
    "text": "He was sat at his desk with a cup of tea he’d over-boiled and already burnt his mouth on. His glasses were smudged, but he couldn’t be arsed to clean them off. He was exhausted and the year hadn’t even got started yet. \nHarry Potter was thirty-two years old, and he hadn’t referred to himself as Wizard, or the Boy Who Lived, or any of it for the last fifteen. In fact, he hadn’t even been known as Harry Potter for ten of those fifteen. The first five he’d been Harry James Potter, a University Student after charming—literally—his way into King’s College and deciding at some point he would become a teacher.\nSo he had. He’d shut off all connections to the wizarding world, he’d packed his things, found a nice flat being let, converted what was left of his gold into quid, and just sort of…started over.\nSeemed the thing to do, really, because everyone expected him to just be okay. To just cast a series of cheering charms on himself, maybe a little obliviate, and get over it. Maybe marry Ginny. Be some fucked-up do-over of his dead parents and have a bunch of children and ignore the fact that he was responsible for a load of deaths and whether or not Voldemort had been a monster—he was still dead and dead by Harry’s wand.\nWhich was in a box on his mantle.\nThe only thing magical in his house was a small pot of floo powder—his godfathers used it to travel from time to time and it was really unfair to ask Sirius or Remus to brave the tube. And that was it. And they never called uninvited.\nAnd it wasn’t like he didn’t miss his friends, or love them, or wonder how they were getting on with careers and kids and everything, but he couldn’t do it. He just couldn’t do it, and what was worse was everyone expected him to be able to.\nLike he could walk off the battlefield of the shattered Hogwarts and be like, “Well lads, looks like we’ve done it. Finally taken care of that big bad once and for all. Let’s all go have a bath and tomorrow we can begin again.”\nHe had to wonder if Dumbledore knew it would be like that. Impossible to live through. There had been more than once he regretted choosing to come back.\nBut now he was working for a muggle school teaching year sevens literature and whilst it wasn’t the grandest career he could have got into, it was different and wonderful. He could sit at his desk and not wonder all the time what was going on behind charms and wards. He didn’t know anything. He didn’t know who had got married and who had gone back to Hogwarts and who had done anything at all ever.\nIt was how he wanted it.\nHe sipped his tea again and grimaced at the ache on the tip of his tongue. His tea was too bitter, but it was caffeinated and that was the important part. He was staring down at his class list presently, going through the names, working through the subjects he wanted to bring up.\nHarry hadn’t got a chance to properly love books. As a kid the Dursleys rarely had any for him to read—and god forbid he ever ask for any. And at Hogwarts they sort of let traditional education fall by the wayside in favour of studying all things magic which left Harry at a serious disadvantage when he decided to leave.\nBut catching up had been easy enough, and Harry discovered his love of writing. Of reading. Of all of it. Of fantasy and being able to just pretend sometimes that none of it was ever real.\nBehind his smudged glasses, his eyes scanned the list.\nThe particular school he was working had was only open going on their third year. It was set up as an alternative to traditional secondary. They stuck to the traditional curriculum but did so with emphasis on the arts and literature. And kept it free for those who couldn’t afford it.\nHarry’d seen enough pandering to the wealthy and aristocratic blooded for at least a dozen lifetimes. He wanted to give something to those kids who didn’t have to scrape together what little they had just to feel special.\nMalloy, Benjamin. Malfoy, Scorpius.\nHarry’s breath caught in his throat and he looked at the name again because no. No. No.\nThis was a muggle school full of muggles and so far from the sodding wizarding world and there was no way a blasted Malfoy was on his list. Scorpius. Scorpius Malfoy.\nHad to be some distant squib cousin or something.\nScorpius though.\nHarry was near shaking by the time he stood up from the desk and grabbed his keys. He locked up the office in a daze and made his way to the car park. He drove a small car, something he learnt to do before he did anything else. Sirius had offered his motorbike which had all the flying charms removed, but Harry didn’t want something that reminded him of a broom.\nHe took the corners a little too fast and it seemed his body knew what to do before his mind caught up to himself.\nHe was in the flat before he realised it and his hand was reaching for that long box on the mantle. The wand felt foreign beneath his fingers, like the quick taste of hard drugs to an addict, it tingled up his arm. His lips curved round an incantation he hadn’t used in years, connecting his fire to the floo network.\nIt glowed green, roaring, then settled back into a gentle, orange warmth. His fingers pinched out just a bit of the floo powder and he was speaking the name of his godfather to make the call.\nHis head reached into the flames right when his mind properly caught up with itself, and he gasped when the back wall of his fireplace turned into the lounge to Remus and Sirius’ flat. The pair of them were on the sofa. Sirius was stretched out, one arm flung over his eyes, the other dangling toward the floor. His chest rose and fell with rhythmic motions. His hair was fanned out on Remus’ thigh where his head rested, and Remus was carding one hand through the inky locks, the other holding a book.\nThe tawny-haired werewolf was looking no worse for the wear, which was good considering all things. He did look surprised, and half-delighted to see Harry’s head floating there in the flames though.\n“Merlin. Seems we have a visitor.” Remus prodded Sirius. “Wake up, you lazy slag. We’ve got company. You want to come through?”\nHarry gulped, not trusting himself to speak. Instead he pulled back, got more powder, and went through the flames until he stepped gracefully out of the hearth. At least he’d learnt to do that properly enough before he told the whole of the wizarding world to sod off.\n“Sirius,” Remus prodded again.\n“Fuck off, Moony. M’sleeping. I need my beauty rest at this age.”\n“We’ve a visitor,” Remus hissed, giving Harry an apologetic grin. “Sorry, he’s impossible before he’s had his proper nap.”\n“It’s fine,” Harry said. \n“Get up you useless waste of space. Sodding mutt,” Remus gave Sirius a shove and he tumbled onto the floor, all lanky limbs flailing about.\nSirius growled. “I’m going to bloody hex the…” He stopped when he saw Harry and his face burst into a sunbeam of smiles. “Oh my god, Moony you dirty beast! Why didn’t you tell me it was Harry?”\n“Was trying,” Remus said, hiding his smile behind his hand.\nHarry wanted to say hello, but instead he was engulfed in an embrace by his shorter godfather who, in spite of the height difference, was still imposing as ever. His strong arms held him fast. “What are you doing here? You’re using the floo?”\nHarry shrugged, trying to still be uncomfortable but it was hard in the presence of these two men who loved him dearly. “Well, I er…had a question. Important one.”\nRemus beckoned him over and Harry let himself be sat between them. “Can we get you anything? Tea?”\n“Fine for now,” Harry said. He rubbed his face, remembered he had his glasses on, and took them off to rub them on his shirt. “Can you tell me what you know about Draco Malfoy? What he’s up to now, I mean.”\nSirius gave a groan. “Merlin you’re worse than me and Snivellus.”\n“No,” Harry said, his voice rushed and tight. “It’s not…” He stopped and heaved a breath. “Tomorrow’s the start of term and I was going through my updated student list and there was a name on there. Scorpius Malfoy. Hardly a muggle name, is it? Scorpius. I mean, even with the weird trends these days.”\nHe watched his godfathers give each other a look and he just knew. “It…could be,” Remus said slowly. “After Lucius passed, no one saw much of Draco. He’s got a job at the ministry, not sure what it is. But he left the manor and no one’s heard from him.”\n“Is he married?”\nSirius shrugged, leaning back. “Cousin or not, I try not to keep tabs. Could well be though.”\nHarry huffed and worried his bottom lip between his teeth. “D’you think it could be some other distant relative?”\n“Also could be,” Sirius replied. “You’re really so worried?”\nHarry leant back against the cushions and tried not to feel the suffocating anxiety of being in a magical house with two grown wizards who used magic like it was nothing. “When you spent more than half your life trying to escape it,” he finally said, “it’s not exactly thrilling to find a name like Malfoy on your student list.”\n“Well he’d hardly know it was you, right?” Remus pointed out. “You’re not using Potter.”\n“If the boy’s magical—which it’s secondary so he should be at Hogwarts if he is—then he would. Or even if he’s a squib he’s bound to recognise me from somewhere.”\n“I think you’re letting it get to you. Which is what can happen when you don’t face your fears,” Remus cautioned.\nHarry had heard the lecture many times and was apathetic toward it now, instead of irritated. “I know. But I can’t help it.”\nHis godfathers gave him a look of pity which he hated, but arms came round his shoulders and those were full of love and support and it warmed him. “Just…proceed with caution. If it seems dodgy, floo us, or send a letter or something.” Remus squeezed his knee. “You can obviously reach us, and we can step in.”\nHarry nodded, feeling comforted.\n“Come on. Have tea,” Remus prodded, and rose to fetch it.\nAlone with Sirius, Harry pulled away slightly. “How have you been?”\nSirius gave Harry a cautious smile. “Well as can be expected in my advance age.”\n“Fifty four,” Harry said with a snort. “You can say it when you grow out of your dramatics.”\nSirius barked a laugh. “That’ll be never, then. I suppose I can live with it.” He stretched his arm out along the top of the sofa. “And you, Mr Evans.”\nHarry winced, knowing it likely hurt his godfather every time he thought about it, but he wouldn’t be sorry for it. He couldn’t be. “I’ve been worse. Not sure I’ve ever been better.”\n“I suppose that’s something.” Sirius looked at Harry for a long moment. “No one’s angry with you, you know.”\nHarry let out a breath. “You know how hard it is. I mean, you of all people. Twelve years you were tormented by the Dementors. Twelve years and then you came out to war and loss and tragedy. But you stayed. So what does that make me?”\n“Smart.” Remus came in carrying three mugs of tea made the muggle way, or close enough to it. The bags were still in, bits of cream in each. He handed them out, and sat down. “Smarter than Sirius, at least.”\n“His marks never beat mine,” Sirius defended.\n“Your natural genius only extended so far, Padfoot.” Remus winked at his long-time lover. “The thing of it is, Harry, you can only escape the magical world when you’ve really chosen sides. When you’ve forgiven yourself for everything, when you’ve decided. Right now you’re still in limbo and it doesn’t matter how we feel. Won’t matter until you’ve let it go.”\nHarry swallowed a mouthful of tea and had a painful memory of his one single, solitary summer of peace. Just after the final battle, curled up every night in the second bedroom in Lupin’s house. It was just the three of them, then. No magic, no owls, no reporters or aurors or anything. Just a small family and it was a taste of what Harry might’ve had if different decisions had been made.\nHarry knew the nightmares lurked just round the corner, waiting for him to let go. But he wanted to give himself that. He wanted to let himself have tea and home-cooked meals and warm embraces. Remus and Sirius had, in spite of their failings, loved him without conditions. Still did. No matter how much his distance and silence hurt them over the years.\n“It’s easier said than done,” Harry said after a moment.\nSirius barked another laugh and pulled his godson in close. “Those, Harry, are the truest words you’ve ever spoken.”\n*** \nIn the end, he went back to his flat and closed down the floo, but made a promise to Sirius and Remus they could owl now. Small steps. He would always be part of the wizarding world, those he loved were still in it. So he’d give them that comfort.\nHe had no time to dwell on it. If he did, he wouldn’t be able to keep his composure the next morning when he found out just how close to Draco Malfoy this boy was.\nHe was stiff in his chair when the students began to file in. All pressed in their uniforms and bright eyes and curiosity. These eleven year olds were setting foot into the education which would guide them into adulthood and it was Harry’s job to make it as painless as possible.\nHe kept his eyes fixed, almost lazy and unfocused as they all walked in. He recognised a few from their resemblances to older siblings.\nAnd then he walked in.\nHarry thought for a moment, ‘I can’t do this. I can’t.’\nThere was no mistaking this boy for the son of Draco Malfoy. Harry was instantly ripped back twenty-three years to a small boy in a robe shop talking to him about Hogwarts Houses. And a small boy blushing furiously as Harry scoffed at his offered hand.\nHe wasn’t Draco, of course. He was softer in features, his hair combed and styled in a shaggy, popular fashion all the boys were wearing. He had a pink to his cheeks, like he hadn’t been kept locked away in a manor most of his life. He’d seen the sun. He’d played. He wasn’t laden heavy with the burden of a Death Eater legacy.\nOr at least, that’s what Harry assumed.\nHe took a breath when they were all seated, and rose.\n“Good afternoon, my name is Mr Evans and I will be handling your literature modules this term. As I’m sure it’s been explained to you in your other classes, we do things a little differently here.” He droned into his welcoming speech, trying to disarm the children a little, raise their comfort levels. Let them know the education was there for them, not to discourage or weigh them down.\nHe watched them all, but mostly the small Malfoy who as yet didn’t seem to notice the extra attention. If Harry was very good at his job, maybe he wouldn’t.\n“Alright, what I’d really like to know first and foremost, what do you like to read. I don’t want a typical answer.” Harry leant back against his desk and crossed his arms. “Tell me what you get lost in. Tell me why.”\nOne of the boys up front raised his hand and Harry nodded at him. “Mr Lieu?”\n“What if we don’t like reading?” the boy asked.\nThe class tittered a laugh, but Harry shook his head. “It’s alright. Really. What do you like to do?”\n“I like my xbox,” he said with a shrug, and a few of the other students nodded emphatically.\n“Well that’s perfectly valid. What games do you like to play?”\nHe listed off a few and shrugged. “I mean, I like loads so it’s hard to choose.”\n“Tell me why, then. Why those games?”\nHe went on to explain the stories, the adventures, and when he was done, Harry was smiling.\n“It’s similar, isn’t it,” Harry said. “Games. Especially now, when you’re given the option to take it as you like it. To create the story inside of a story. I know a lot of adults are going to tell you video games are rotting your brains but they’re wrong. If you apply what you like though, in games to books, you might actually find yourself more interested in reading. I could recommend you many fantasy series I think you’d enjoy.”\nThere was a pause, then a pale hand shot into the air and Harry had the urge to just ignore him.\nInstead he took a breath. “Mr Ma…” His tongue got stuck on a name he hadn’t uttered in years.\n“It’s Malfoy,” the boy said, and his voice was not as sneering as his father’s, but had the same lilt, same poshness to the accent. “It’s French. Sort of. Means bad faith.”\nHarry felt his heart hammering against his ribs, but he plastered on a smile. “Mr Malfoy. You’ve something to add?”\n“Well not to what he said.” Scorpius jutted his chin toward the video game boy. “But I wanted to say that not all books have to be fantasy in order to be enjoyable. I think there’s a certain—maybe better—sort of magic in books with no magic in them at all.”\nHarry’s fingers threatened to shake, so he reached behind him and grabbed his mug of tea, squeezing it tight. “Is that so? Would you care to elaborate?”\n“One of my favourite books is called Island of the Blue Dolphins. About a girl who…”\nThe class erupted into a giggle and Harry distinctly heard the word pouf muttered in the back. His face went still. “Enough,” he said, his voice firm and almost angry. “I don’t know who said it, but I heard it and I will not tolerate bigotry of any sort in this class. Nor will it be tolerated in this school. And I’d like to further point out there’s nothing wrong with a woman main character. And it most certainly does not implicate anything about the reader.”\nScorpius’ cheeks were a bit pink, but his face was determined, like he’d dealt with this before. “As I was saying, the woman in the book is left behind on an island to fend for herself. The book is really a fantasy in itself even though nothing out of the ordinary happens.”\nHarry was nodding along, and there was something blooming in his chest for this kid. “I know what you mean. I’ve read it,” and he smiled when Scorpius did. “The visuals are stunning and you hardly need a moment to be dragged into the pages.”\n“I just think finding magic in the ordinary is…more interesting than say hopping through a wardrobe into a land of talking goats and lions and stuff.”\nHarry laughed. “I think some might argue. Some very stodgy classical fans, but,” Harry stopped and winked, “let it not be said I’m one of them.”\n*** \nHe managed to hold it together, and taking tea in his office, he finally let himself collapse in his chair. Scorpius had gone quiet after speaking up about the fantasy books, but Harry couldn’t tell if he was speaking from experience—much like the way Harry wanted to find the magic in the ordinary muggle world, or if there was something else. Perhaps this boy had never known magic. Perhaps his family had left it behind.\nTwenty minutes into his tea, there was a timid knock on his door. “Come in,” Harry called.\nA blonde head poked round the door and Harry felt his heart stutter again. “Mr Evans? Do you have a minute?”\nHarry swallowed back his nerves and nodded. “Of course Mr Malfoy. Come in.”\nThe boy shut the door and he studied the chair in front of him before he plonked down and folded his arms in a defensive manner across his chest. “I er…I wanted to say that I know.”\nHarry raised a brow. “You know.”\n“My father doesn’t if that’s what you’re worried about. But it’s sort of hard to miss round certain parts of London.”\nHarry’s cheeks went hot and he took a swallow of his tea as an excuse to work at keeping himself composed. “Your father.”\n“When you’re father’s Draco Malfoy, you know all about the war and the sodding boy who lived.” Scorpius’ face went an immediate shade of crimson. “Sorry,” he whispered.\nHarry, so taken aback, laughed and waved his hand. “Sodding boy who lived is rather…apt.” Sitting back, Harry let out a puff of air. “Why are you here? Why are you in my class?”\n“School,” Scorpius said slowly.\n“Yes but…”\n“Can’t get into Hogwarts without magic and as it is, I have none.” Scorpius said it in a rush, like he’d been holding it in all day. “Father’s…he’s tried his best, you know. I once heard gran talking to Aunt Andromeda about it. Said it was poetic justice. Had to look that one up, you know. They tried to home school me for a few years but after mother decided it wasn’t worth her time…”\nHarry held up a hand. “I’m sorry, Mr Malfoy. I’m…I need a moment to process everything.”\n“Sorry.” He didn’t sound sorry at all, just like his father, but Harry didn’t care then. Draco’d had a squib son and by some fucked up twist of fate or…or whatever it was, he was now sat in Harry’s class. \n“Do you live in muggle London?”\n“Yes. Father’s got us a flat. Near the Ministry.”\n“Where he works,” Harry said, remembering his godfather’s words.\n“I won’t tell him, if that’s what you’re scared about.”\n\nScared, Potter?\n\nHarry let out a puff of air. “I’m not scared, Mr Malfoy. I merely feel that your father might not be entirely thrilled about you sitting in one of my classes.”\nScorpius let out a very un-Malfoy like snort. “No he probably won’t.”\n“And our parent’s night is coming up. I’ll be…here,” Harry finished weakly.\nScorpius shrugged. “He’s already put me in a dozen schools, so another won’t really matter. But I just thought I should tell you that I knew. Because you were obvious and it only seemed fair.”\nHarry mused at just how different this boy was than Draco had been, or even himself at that age. Course their lives, their childhoods were likely very different. Scorpius hadn’t been taken from the magical world, but he would forever be outside of it, whether he wanted to or not.\n“Mr Evans?”\nHarry’s gaze snapped up. “Sorry. Was thinking. If you like, I can arrange a private meeting with your father. We’ve…that’s to say we were never on the best terms but I think we can be amicable at this age. I can discuss with him your stay here. If you’re not keen to leave already.”\nScorpius visibly relaxed. “I can’t promise it’ll go well. But…I don’t mind it. So much.”\nHarry scribbled a note to Scorpius’ father, fighting off every urge to give himself away. “I’ll leave it to you whether or not you want to tell him. You know him better than me.”\nScorpius slipped the note into his pack and shrugged. “Funny thing is, I probably don’t. But I can’t say a surprise wouldn’t be hilarious, if anything. See you round, Mr Evans.”\nThen he was gone and with that shock, Harry was near useless for the rest of the day.\n*** \nThe next morning, Harry was sat in his office with an over-brewed cup of coffee, cursing that no one at the damned school could ever work the machine properly, when his desk telephone began to ring. He eyed it, a sinking feeling in his gut before he picked it up.\n“Mr Evan’s office, how can I help you?”\nThere was a short pause before a voice said, “Hello, Mr Evans. My name is…” Another pause. “Mr Malfoy. I’m Scorpius’ father.”\nHarry’s heart was hammering in his chest, his stomach somewhere in his throat. “Ah. Yes, Mr Malfoy. Your son mentioned he might have you ring me.”\n“He said we should arrange a meeting before the parent’s night. Is there…has there been a problem with my son?”\n“Ah no. No, not as such. But we should probably have this discussion face to face.” Harry wondered if he should just sodding tell Malfoy who he was, but then what would happen? He’d never see Scorpius again, most likely and it sounded like the kid had been moved enough in his short life.\n“Is there…has there…” There was a pause, and Malfoy sighed. “He’s had an unusual upbringing, so if it’s something he’s said…”\n“I can assure you he was very well behaved and in fact I was impressed by his contributions in class.”\nThere was a slight breath. “Alright. Perhaps after school, then? I’ll be finished at work early and I can stop by.”\nHarry then gave Malfoy directions to his office, promising to be there after the students had been dismissed. He rang off, then stared at the telephone like it had grown Malfoy’s actual head and was attempting to curse him. What was he thinking?\nHe was going to get hexed for this. He found himself for the first time in years, wishing he had his wand.\nThe day passed far too quickly for Harry’s liking. He pulled Scorpius aside after the class and let him know the plan, and Scorpius had a small smirk playing round his mouth. “Shall I stay and mediate?”\nHarry almost laughed, and wondered where this child had gotten his mischievous streak. Draco had been cunning, yes. And clever and very smart. But not playful at all. At least not that Harry had ever seen.\n“I think it might be best if you let your father and I sort it out.”\nScorpius nodded. “Alright well…” He leant his head in. “Have you got your wand?”\n“Not exactly.”\nScorpius hummed. “Well. That should be…interesting. See you, Mr Evans.” Then he was gone and Harry wondered what the hell he was really doing.\n*** \nSat at his desk again, Harry’s foot tapped a staccato along the polished tile as he waited. He had his head bowed, and he was preparing himself for any flying curses. He hadn’t used magic in ages, but once upon a time he could at least repel nasty hexes without a wand. Not his strongest suit but…\nThe knock interrupted his thoughts, and he rose. “Come in.”\nHe braced himself.\nDraco Malfoy looked exactly the same, and yet nothing at all like the boy he’d been at Hogwarts. His hair was still short, styled though not nearly as much hair grease. He was wearing muggle clothes—trousers and form-fitted shirtsleeves. He had a hand in his pocket, the other braced on the knob, and his face was tight with anxiety.\n“Scorpius gave in and warned me it would be you, Potter.”\nHarry deflated a little. “Right. Yes. Ah…good. I wasn’t sure if I should have said on the call or…”\n“God, you’re…” Malfoy huffed and then crossed the room, dropping into an empty chair. “Christ.”\n“I’m Christ.” Harry almost laughed when Draco’s mouth quirked up at the corner. He sat down, hoping he’d eased the tension at least a little. “I didn’t feel right about having Scorpius in my class unless you knew.”\n“That Harry Jesus Christ Potter had abandoned his flock for muggle children?” Draco asked. He rolled his eyes a little, crossing his arms over his chest. “Why would you think I care?”\nHarry shrugged. “Because I think I’d care if I found out my child was taking classes from you.”\n“Last I heard you don’t have children. Last I heard your bits and bobs got blown off in the final battle.”\nHarry’s cheeks pinked. “I sincerely hope there are no children out in the corridor listening to this.”\n“Scorpius is in the car with my mother. So we shouldn’t keep this long.”\nHarry let out a puff of air. “Right. Your mother. In a…car.”\n“She’s adapting,” Draco said.\nHarry realised that what was likely for the first time in his life, he was having some sort of conversation with Draco that wasn’t beginning in sectum—and ending in—sempra. Or some equally dreadful hex. “Well this is all I really wanted to say. And…I suppose I’d appreciate if you kept this to yourself.”\n“Embarrassed?” Draco smirked a little and Harry huffed.\n“No. More like I’d rather not have reporters or…old acquaintances knocking at my door. Present company excluded—as I am required to communicate with the parents of my students.”\nDraco’s tongue ran along his bottom lip, causing Harry to lose his breath for a second, but he didn’t appear to notice anything amiss. “How long have you been doing this, Potter?”\n“School’s been open three years.”\nDraco raised his hand, examining his nails. “Not this school. I have the info on that. I mean this whole, living like a muggle rubbish.”\n“I grew up like a muggle—before the wizarding world decided to use me as their fucking sacrificial lamb and send a sixteen year old boy after a wizarding mass murderer.” Harry hadn’t meant to sound so sharp, and he flushed when Draco’s steel eyes locked on his. “I mean to say, being a muggle is not rubbish, and I’ve been out of the wizarding world since I was eighteen. I spent some time with my godfathers.”\n“Right. Black and Lupin.”\nHarry let out a small breath and shrugged. “I’d appreciate it if you didn’t pull Scorpius from this school. It’s…this is a good place. It’s a good education.”\nDraco snorted and rolled his eyes again. “I’m well aware of that, Potter. You think I wouldn’t do every available bit of research before putting my son in a school. I might not have grown up muggle, but I can adapt when I need to.”\nHarry swallowed thickly, confused by this person sitting in front of him. But now was not the time to draw attention to it. “Right. Well anyway, I suppose I should let you go. Wouldn’t want your mother cross.”\n“Hmm no, I expect not,” Draco said with a wry grin. “I suppose I’ll see you parent’s night.”\nHarry nodded, saying nothing as Draco rose and let himself out. The door shut with a gentle click, and Harry dropped his face into his hands. It hadn’t gone badly, not really. He appreciated Scorpius coming clean about who he was if only to avoid surprise hexing. He wondered if it was the fact that he mentioned he was wandless that did it. Either way, Scorpius would stay and Harry wouldn’t have to worry about blowing his cover.\nProvided Draco Malfoy kept his word.\nOf course he realised after some time, the blonde git hadn’t given his word at all.\n*** \nHarry was too tempted to floo his godfathers, but he forced himself to process everything on his own as he’d been doing for the last several years. He didn’t sleep much that night, but with several coffees before he sat for his first class, he did okay.\nScorpius was, as usual, quiet but studious and put in his opinion when it was asked for. Luckily most of the day was lecture based, so Harry was able to focus on the information and not think too much about how there was a boy in his class who knew who he was. Who had heard the stories and the rumours—and lord only knew what Malfoy had told his son about Saint Potter with his stupid scar.\nBut Scorpius sat without prejudice, and Harry attempted to do the same. He was not Snape. He would not torture a boy who clearly had dealt with enough over his short life.\nThe Thursday before Parent’s night, Harry was supervising the students at mealtime, sitting at the corner of the staff table, when Scorpius wandered over. He hesitated before stopping. “Mr Evans?”\n“Mr Malfoy, how are you today?”\nScorpius shrugged. “Gran found out.”\n“Narcissa?” Harry burst out before he could stop himself. He gave a slight cough. “Sorry.”\nScorpius had a slight glint in his grey eyes. “She’s not pleased about it. You. She thinks it’s mad. She was furious with father when he forced her silence in the matter.”\nHarry snorted. “I can imagine.”\n“Father was shouting at her about how she owed you. He doesn’t talk about it much. You know, what happened with…” Scorpius waved his thin hand. “Everything.”\n“I don’t expect he would,” Harry said softly. He glanced round but no one was paying them any mind.\n“My Aunt says I’m poetic justice.”\nHarry’s eyes went wide. “Which Aunt?”\n“Andromeda. I reckon she’s talking about the fact that I’m non-magical. Squib, I guess you wizards call it, but father gets furious if people call me that.”\nHarry’s cheeks were a little pink. Never in his life did he think he’d hear that Draco Malfoy would be defending non-magical status in a wizarding bloodline. His child or not. But to think that even Andromeda would say that to the boy… “I don’t think sons pay for the sins of their fathers, Mr Malfoy. I wouldn’t think too hard on it.”\nScorpius let out a sigh. “Well after everything I heard, honestly I’m kind of glad not to be part of it. Sounds like it’s more trouble than it’s worth.”\nHarry let out a surprised laugh. “It is that. Leaving the…you know, world, it’s difficult when you’ve been entrenched in it for any number of years. I’m impressed your father’s done it. He must love you.”\nScorpius sighed. “I think so.”\nHarry almost laughed again, thinking about Draco having muggle things, learning to use a telephone and a computer. He wondered if he carried round a mobile or used the internet. “Trust me, I know so. He wouldn’t do it for just anyone. The Draco I knew, at least back then, would find any way possible to shirk his responsibility for something he wasn’t interested in. He was passionate though.”\n“Yeah, and look where that got him.” Scorpius let out a sigh. “I should go. See you tomorrow night, Mr Evans.”\n*** \nTomorrow night. It was like a strange beacon off in the distance because where Harry had shunned everything magical, down to the very people who loved him most of all, there was a draw about Malfoy. The at-ease way he lounged in his office, perhaps, or maybe it was the fact that to Draco—Harry had never been the Wizarding Saviour. Malfoy had never been charmed by the idea of it all.\nAs far as Harry knew. And if he had, he’d well kept it to himself and that made a difference.\nHe was all nerves as he sat at his desk in the classroom and waited for the parents to arrive. The teachers were holding fifteen minute sessions with their classes, students hadn’t been invited only to allow parents the freedom to ask questions if they chose to.\nSo there he was. Nervous. Clutching hard coffee in his trembling hands hoping no one would notice. He was leant against his desk, one leg crossed over the other in an attempt to look casual, though anyone who knew him even for a moment would be able to see the tension. As always, Harry Potter wore his emotions on his sleeve.\nThe parents began to file in, and Harry waited until the very last second before he began, but there was no Draco Malfoy. He tried not to feel the stinging disappointment as he began. “Hello. My name is Harry Evans, and I’m the English teacher. This year I’m only teaching the year sevens, but we hope to expand a bit and I may have them again in the future as they work toward their GCSEs. At the present time they’ll have me for English and Literature.” He went a bit further now, into the curriculum, and as he did, the door opened and a tousled blonde walked in, mouthing an apology.\nHarry waved it off, gesturing for him to sit as he went on. “Are there any questions?”\nThere were a few. Basic ones, mostly. What would they be reading? Will controversial material be sent home before it’s taught? How will this help them toward their exams?\nHe answered all the questions, then dismissed them, allowing ten minutes for a meet and greet.\n“Laura just loves your classes,” one excited mother was saying.\nHarry nodded, smiling as he watched Draco drift toward the door, but halting and moving back again. His heart was thudding in his chest. “Ah well, she’s a delight, really.”\n“Well she can’t shut up about it. You know, you’re the talk of the school. Always the dashing ones.”\nHarry felt his cheeks heat up. “Ah yes well…”\n“She says you’re not married. You know my daughter just finished university and…”\nHarry’d had this before, and he gave her a smile. “Very kind of you, really. But I’m afraid it’s frowned upon at the school, dating family members of students. But I’m sure she’s very lovely.”\nLaura’s mum’s face dropped. “Oh well. If the policy changes…”\n“I will indeed let you know.”\nThe parents were all filing out now, and Draco eased up toward Harry. “Merlin’s balls even when you’re not famous they’re all over you.”\nHarry allowed himself a full blush, shaking his head. “Well meaning parents always trying to pawn off their daughters. Bit sexist, really.”\nOne elegant eyebrow lifted. “Sexist. Social justice champion are you. I thought you hadn’t spoken to Granger in ages.”\nHarry felt his stomach squirm at the mention of Hermione. “Weasley, you mean.”\nDraco snorted. “You really have been gone that long?”\nHarry let out a puff of air. “Would it offend you if I tell you I don’t want to know?”\nDraco laughed. “You honestly think I care, Potter? Er…Evans, if you prefer.”\n“Potter’s…er. Fine. So long as no one hears it.” Harry ran his hand into his hair, then reached back for his tepid tea and took a sip. “Did you…do you…have any questions? About Scorpius or…?”\n“No.” Draco was quiet a moment, one hand slipping into the pocket of his trousers. “I never really worry about him. He’s assimilating just fine.”\n“How long has he been in the muggle world?”\n“Mother learnt he wasn’t on the Hogwarts list a few weeks after he was born,” Draco said with a shrug. “After Astoria and I split, I decided investing in a flat was for the best. So…” Draco’s eyes rolled up to the ceiling. “Since he was four. He’s been exposed to both, but doesn’t have a lot of interest in the wizarding world.”\n“Can’t imagine that he would.” Harry pursed his lips. “Well I’m glad you could make it. This was only about a third of the parents, you know. I understand so many are busy but it’s never easy for me to see parents who refuse to be invested in their children.”\nDraco looked at Harry for a long time. “And you never had any? Not even with a muggle?”\nHarry’s cheeks took on another pink tinge because that was another thing. Not that anyone ever knew—and it wasn’t because he would be judged, especially after knowing Remus and Sirius—but after Ginny there was really no appeal for him when it came to women. It had come to him easy enough, a night out with some flatmates at University and a few drunken snogs with the lads here and there.\nBut it was more than that, because he just didn’t feel he should be a parent. Not with everything he’d walked away from. To bring a child into that world…\n“Er. No. Not really in my cards.”\n“It’s not because you don’t like them. Otherwise you wouldn’t be here,” Draco said with a slight sneer. “So what is it?”\nHarry barked out a laugh and shook his head. “Malfoy, do you really think I should parent? That I’d know the first thing about it? It’s one thing to teach them muggle literature, but it’s quite a-bloody-nother to be responsible for everything else.”\n“Some of us got over ourselves,” Draco said with a huff. “You weren’t the only one who suffered.”\nHarry recoiled like he’d been slapped. “I…” But what could he say to that? “Right.”\nDraco let out a small sigh, then took a step back. “Night, Potter. I’m sure we’ll be in touch.”\nDeflated, Harry sagged against the desk and wondered how he’d let that just go. Just like that. For all his fighting and insisting this was what he needed, and Draco had undone him with two short sentences. Funny part of it was, it wasn’t the first time someone had said that to Harry. It was just the first time he’d listened.\n*** \nAn hour later, Harry retired to his office to grab his keys and a stack of essays to grade, when something at the edge of his desk caught his eye. It was a small, round box. Something he hadn’t seen since the Hogwarts Express. A Chocolate Frog.\nThe box on the side had been opened, and when he pried the top off, the small frog sat immobile, just on top of the card which was sitting face down. There was a small note scribbled to a spare bit of parchment on the bottom.\nH.\nScorpius opened this earlier. He’s already got one, so I thought you could use it. I’ve immobilised the frog and card, so as not to alarm the muggles.\nD. Malfoy\nHarry fingered the top of the box, then reached under the frog to pull out the card. It took him by absolute surprise to see his seventeen year old face staring back at him. On the back was the short bio.\nHarry James Potter, The Boy Who Lived.\nAt seventeen, Harry defeated the Dark Lord Voldemort during the battle at Hogwarts School of Witchcraft and Wizardry. Since the defeat, Harry has disappeared from the limelight and rumour has it is working with the American Wizarding Society in an attempt to prevent someone like Voldemort from rising to power again.\nWith a loud snort, Harry set the card down on the desk. He picked up the frog, and though before this moment would have never eaten anything that had come from Draco Malfoy, took a bite of the frog and let the old, familiar taste take him back to that first train ride when he was still enthralled by discovering that not only was magic real, but that it was very much a part of him.\n*** \nBent over his kitchen table, a red marking pen in hand, Harry looked up when there was a tapping at his door. Frowning, he assumed it had to be a neighbour and threw it open, his eyes widening in surprise when he saw his godfathers grinning at him.\n“We brought take-away,” Sirius said, waving a paper sack which smelt heavily of curry. “Can we come in?”\nHarry coughed, stepping aside. “Er. Course. But what er…what are you doing here?”\n“Well we’ve come for the gossip, of course,” Remus said, walking to the table to deposit the second sack of take-away. “Have you got dishes?”\n“Cabinets,” Harry said, and watched Remus busy himself with plates and forks. “Gossip?”\n“Malfoy gossip. Didn’t hear a word after your impromptu visit,” Remus said.\nSirius pulled a chair back and began to remove the containers of curry, rice, and naan. “How did it go?”\nHarry scooped up the essays lest they be stained, and plonked them down on the counter a few paces away. “It er. It was weird,” he said with a shrug. He watched Remus dish out food and he took the plate as he sat in his vacated seat. \nSirius rummaged through Harry’s kitchen, coming back with three beers, and uncapped them with a wave of his hand. Harry felt something catch in his chest at the casual magic, but he didn’t say anything.\n“Could you elaborate?” Remus smiled at him over his beer bottle.\nHarry sighed. “Well. He came for a quick chat. His son had already told him who I was so there was no big surprise there. He was…amicable.”\n“I’ve seen him round the Ministry,” Remus said with a nod as he dipped some of his naan in the curry. “He’s been, for the most part, apathetic which is all I can ask for really. As a werewolf.”\nHarry felt his face go a little hot at the idea that after everything he’d done, all they’d been through, there was still such a prejudice. “He came to parent’s night as well. Brought me a chocolate frog.”\nSirius choked on his swallow of beer. “A chocolate frog?”\n“With my card,” Harry said.\nRemus smiled wider. “Ah. Harry Potter the American wizarding champion.”\nHarry couldn’t help his laugh. “Bit ridiculous, isn’t it? Who fed them that?”\n“You didn’t want to be found,” Remus said, shrugging. “Thought it might be best to steer them in the wrong direction.”\nHarry grinned. “Well. Thanks, I suppose. Anyway that’s it, really. I mean, I guess he’s been living in muggle London as he found out Scorpius was a squib from an early age. Got divorced. His son seems fairly well adjusted.”\n“That’s good, isn’t it?” Sirius asked. He took a large bite of his dinner.\n“I reckon. He knows though, Scorpius. That things are…different for him. He overheard someone call it poetic justice.”\n“That Malfoy had a squib?” Sirius said, his voice thick with food. “I suppose it is, a bit.”\n“But…no,” Harry said, shaking his head. He stared at his untouched food. “It’s not his fault. Being a muggle isn’t a punishment for your parents’ transgressions. That’s…you can’t put that on a child.”\nRemus gave Harry a careful look. “We know.”\nHarry shook his head. “But imagine him growing up hearing that. What’s he to think?”\nThere was a decided quiet over the table. After a moment, Sirius stood up and came to stand behind Remus, putting his hands on the werewolf’s shoulders. “Going out for a smoke.”\nRemus tilted his head up. “Give us a kiss, love.”\nSirius bent down, obliging, then headed for the door, letting it close with a gentle click on his way out.\nHarry watched him go, then turned back to Remus. “I’m sorry for getting upset. But he’s a good kid and I know what it’s like to grow up with people whispering about everything you do. That feeling that you need to…fulfil something, you know? Or that you’re the product of something outside of your control.”\nRemus gave a slow nod. “But if he’s well adjusted as you say he is, there’s probably a good chance that Draco’s combating it as best he can. And keeping his boy in the muggle world I’m sure helps a great deal.”\nHarry shrugged, leaning back. “Reckon it is. At least no one at the school knows him. Students find his name a bit funny but no one guesses about his background.”\n“That’s good. And not that I want to push you, but maybe being exposed like this will be good for you as well. You can’t hid forever, Harry. Even if you want to stay living as a muggle, magic will always be part of you. No amount of running will make the past go away.”\nHarry looked down at his hands and let out another sigh. “I know. I’m just…afraid of how much it’s going to hurt when I let it all back in.”\n*** \nA month later, Harry was walking out to his car when he spotted someone leaning against the bonnet. Draco stood there in jeans and a plain black t-shirt, one arm crossed over his chest, the other hanging low with a pinched, lit cigarette between his fingers.\nHe watched Harry with hooded grey eyes, bringing the fag to his lips and taking a long, slow drag. His mouth curved into what might be considered a smile as Harry stalled, then picked up his pace again.\n“Potter.”\n“Er. Malfoy. Something I can help you with?”\n“My ex-wife just picked up Scorpius for her monthly visitation.”\nHarry blinked in surprise. Scorpius steadfastly refused to mention his mum in any capacity, speaking mostly of his father, and occasionally his gran. But that was it, and Harry had wondered if he ever saw her.\n“She picked him up from here?”\n“It makes the transition easier,” Draco said with a shrug. He glanced over his shoulder at Harry’s car, then let out a sigh. “Take me for a drink, Potter. I feel like shit.”\nHarry’s eyes widened, but in spite of every fibre of his being saying it was a bad idea, he nodded and unlocked the doors so Draco could get in. The blonde crushed the cigarette under the heel of his shoe, then climbed in. \n“Any place in particular.”\n“Your local is fine.”\n“Er.” Harry switched on the car and Draco laughed.\n“Eloquent as ever. Is there a problem?”\n“No.” Harry cleared his throat. “I think I’m just having a moment. Draco Malfoy wants to have a drink with Saint Potter.”\n \nThere was a long pause, then Draco threw his head back and laughed. “Fucking go. I’m too sober.”\nHarry wasted no time pulling out onto the main road and heading up to his flat. The pub was just round the corner, so he parked and glanced up, debating about taking his things up.\n“You live here?” Draco glanced at the door.\n“Yeah. Just…let me bang my stuff down and we can go.” After a moment’s pause, “Come up if you want.”\nIt seemed Draco couldn’t resist, and he followed Harry in through the doors, up three flights of stairs to the second floor landing, and Harry’s was first on the left. He stuck his key into the lock and pushed it open.\n“Don’t mind the mess.”\nDraco looked round as Harry put his brief case on the table, and put his morning tea mug into the sink. The flat was tidy for the most part, a few stray papers here and there, and the odd jumper hanging from the back of a chair. But it was homely and comfortable.\nHe had art on the walls, books in the shelves, a telly mounted, and his fireplace.\n“Hooked up to floo?” Draco asked, dipping his fingers into the pot.\n“Charmed shut most of the time, but yeah. My godfathers use it from time to time.” Harry’s voice was half-muffled by the shirt he was changing into, not interested in drinking in his teaching clothes. “Why, you need it?”\n“No.” Draco backed up and peered down the corridor, waiting for Harry. “You’ve got no photos, you know.”\n“I only know wizards,” Harry said, and came out from his bedroom, his hair a mess, glasses somewhat crooked. “If I bring work mates back for any reason, how the hell would I explain moving photos?”\n“Don’t muggles have those thingies now? From the internet?”\nHarry laughed. “Not in photo frames.” He reached for his keys on the table and shrugged. “It’s a short walk if you’re still interested.”\nThere was a flicker of disappointment on Draco’s face, but it was schooled away and he nodded. “Yeah.”\nThe pair walked near silently down the street and round the corner to the pub. It was a decent sort of place, good imports on tap, and not a lot of fuss. They found a high table near the end of the bar and sat, and both ordered a pint.\n“Chips as well,” Draco said after a moment.\nThey fell into a silence for a while, watching the crowd, occasionally looking at each other, and Harry had to wonder what the hell he was really doing there. Was he honestly at a muggle pub with Draco Sodding Malfoy having chips and a pint? Of all the bloody things…\n“There you are,” the server said. “Starting a tab.”\nDraco reached into his pocket, found a card, and handed it over. “All on one. Thanks.”\n“You don’t…”\n“Shut up, Potter,” Draco said. “My family name might have been violently besmirched by that maniac, but I’m still richer than you on a teaching salary.”\nHarry’s eyebrows went up. “And you do realise that my parents left me a ridiculous amount of gold that didn’t just disappear when I left the wizarding world.”\n“So you’re rich.”\nHarry snorted into his pint. “Yeah.”\n“Well fuck me. Next night out’s on you, then.”\nHarry’s eyebrow lifted as something in his head screamed, next night out! But he said nothing. He stole a few of Draco’s chips and drank half his pint before saying anything else. “So how’s it working for the Ministry?”\nDraco let out a sardonic laugh and shook his head. “Really? That’s what you want to ask me of all bloody things?”\nHarry shrugged. “Why not?”\n“Well it’s shit, Potter. How do you think it is? It’s still the sodding Ministry. My job is shit, and no one cares for me—which honestly makes it easier to avoid small talk, and everyone wants to know how Draco Malfoy managed to produce a squib.”\nHarry winced. “I…you know I don’t think that’s fair to him.”\n“Him?”\n“Scorpius.” Harry sighed, ruffling his hair again.\n“Stop that. It makes you look ridiculous.” Draco’s hand reached over and curled round Harry’s wrist, dragging it down. Harry felt his breath catch in his throat when he felt Draco on his skin. The long, slender fingers were filled with fire, coursing up and down his arm. Draco paused, then carefully removed his hand.\n“I mean to say,” Harry said, forcing himself to catch his breath, “he knows. He hears things.”\nDraco looked away, then let out a sigh. “I know he does. I’m trying as hard as I can but I figure there’s no point in trying to shield him from it. So I just tell him the truth. His entire fucking family were blood purist pig-dogs and any time he comes near a wizard, the first thing they’re going to think is, ‘Ha! That Draco Malfoy sure got his.’ It makes him less than enthusiastic to be round wizards.”\n“I expect so.” Harry licked his lips, not sure what else to say.\n“Probably why he’s keen on you so much,” Draco went on. He grabbed the last chip from the basket and bit of the end, chewing thoughtfully. “I guess it helps you shun us the way he wishes he could—and likely will soon as he’s of age. But maybe seeing a wizard willingly apart from all that insular rubbish helps.”\nHarry felt a warmth in his belly. “He’s a good kid. Interesting. Insightful. Funny. Never would have guessed he was yours.”\nDraco smirked. “Only because you never got to know me.”\nHarry raised his eyebrows. “Oh really? You’re funny, are you?”\nDraco lifted his chin. “I happen to be extremely funny, Potter. It’s not my fault your sense of humour is rubbish.”\nThis time, Harry did laugh and found himself leaning just a little bit closer to Draco.\n \n*** \nSo it became routine, that once a month when Astoria picked up Scorpius from school, Harry would find Draco waiting by his car. They’d head over to Harry’s while he’d change, then go to either the pub or the small curry restaurant round the corner and spend a few hours chatting.\nAnd it was nice. Harry learnt Ron and Hermione never did marry. Hermione was making waves on the legal front of Magical Creatures—working in tandem with Remus who confirmed it later when Harry floo’d his godfathers to ask about it.\nRon married eventually, a woman who’d been one year below them and had been in Hufflepuff. “Er. I think she’s called Amanda or something. Honestly I can’t be arsed to remember. Ron worked at the Ministry for about ten minutes before he buggered off to help his brothers.”\n“Fred and George?” Harry asked.\n“Joke shop,” Draco said with a shrug. “Mad place, that.”\nHarry laughed. “Yeah. I’m silent partner. I think. I gave them what I won from the Tri-Wizard Tournament to open it.”\nDraco’s eyebrows went up. “You what?”\n“I didn’t need the money and the entire fucking tournament was fixed by Crouch.”\n“Junior, right?”\nHarry nodded, spearing a bit of lamb from the curry bowl. He chewed for a moment, then washed it down with a drink of his beer. “Felt wrong to use it for anything else.”\nDraco said nothing for a while. Then he caught Harry up on a few other things. Ginny played Quidditch, had a few public relationships with both men and women. Harry was far from surprised by that. Neville was a professor, Luna took over for her father, and the rest of the Weasleys were as they’d always been.\n“Don’t get me wrong, I don’t stop to chat when I see them in the corridors or the lifts,” Draco said with a shrug, “but I also can’t help but hear things.”\nHarry smiled. “It’s…you know I thought it would be terrible, hearing all these things. Remus and Sirius have got strict orders to keep anything wizard to themselves.”\n“You’re fucking ridiculous, Potter. I’m amazed you survived.”\nHarry laughed. “Nearly didn’t. I mean I actually did die, you know. But sorted it out in the end.”\nDraco laughed and he pushed the bowl away from himself. “Reckon you did.” He stretched up and put his arms behind his head. “You want to go back to yours? I’m uncomfortable here.”\nHarry tried not to feel the thumping in his chest at the request. “Er. Yeah, alright. I’ve got drinks.”\nDraco smirked, then got up to pay the bill and then followed Harry out onto the street. They didn’t say much as they walked toward Harry’s flat, but once or twice their hands brushed together. Harry couldn’t be sure, but that once or twice it felt like Draco was lingering.\nWhen they got in, Harry grabbed a couple beers from the fridge and they sat on Harry’s sofa. “You want me to put on the telly or music or something?”\n“What’ve you got?”\nHarry got up and thumbed through his CDs. “Sirius got me all this punk seventies shit. I mean, it’s not shit, actually. You want slow or fast?”\n“Slow’s better for conversation, innit?”\nHarry couldn’t help but agree, so he chose a Bowie CD and put it on. Eventually the sounds of crooning filled the flat, though he kept it low, and he resumed his seat.\n“So why don’t you have a girlfriend?” Draco asked, pointedly and blunt.\nHarry choked on his drink. “Sorry?”\n“You’re attractive. Even to muggles. I see your co-workers trying to catch your eye. You’re telling me you never pull any of them?”\nHarry coughed, trying to catch his breath. “Ah. Er. Well, no. I don’t.” He ran his hand through his hair, then remembered Draco telling him how ridiculous it made him look and he stopped. “Thing is, I’m gay.”\nDraco was silent, then his mouth curved into a smile. “Harry Potter’s a pouf. Does anyone know?”\nHarry shrugged. “Didn’t really work it out until University. So probably not. Well, maybe Sirius and Remus, but we don’t talk about it a lot.”\n“You think they’ve spotted it since they’re bent?”\nHarry’s cheeks went pink. “Like I said, we don’t exactly talk about those things.”\n“Course you don’t. I swear to Merlin’s saggy bollocks, one of these days you’re going to have all that repressed shit erupt like a bloody geyser and you’re going to blow up half the fucking block.”\nHarry stared, then he laughed. “God. You’re probably right.”\n“I know I am. You need a few dozen therapy sessions and at least that many shags. You ever get any?”\n“Hah. Er. Not as much. Not lately.”\n“Since?” Draco pushed.\nHarry looked away. “University.”\n“You’re not a virgin, are you?”\n“No,” Harry said, his voice furious. “And what’s my sex-life to you, Malfoy? You personally invested.”\nDraco quirked a brow but said nothing. So Harry pushed again.\n“You want a go? See what it’s like to fuck the Saviour?”\n“Touchy,” Draco said, holding up his hand. “Though hypothetically, what would you do if I said yes? That I’d love to rip that stupid muggle jumper off you and leave you fuck-stupid hours later.”\nHarry nearly choked on his own tongue, and it took him a full two minutes to regain his bearings. “Hypothetically speaking?”\nDraco’s smirk widened. “Well. Depending on your answer.”\n“You’re joking. You’re…fucking. You’re fucking joking. You’re having me on.”\n“I’d rather be having you off, if you know what I mean.”\nHarry’s face bloomed bright red. “Malfoy…”\n“Potter,” Draco mocked. “You never noticed it? You think I followed you round because I didn’t like you?”\n“Well…yeah,” Harry said, his voice going high and tight. “You…we…we didn’t like each other.”\nDraco laughed. “No, we really didn’t. I fucking hated you. But I also wanted to fuck you. Because you’re gorgeous.”\nHarry sputtered and blinked. “I…er…”\n“You don’t think I am?” Draco asked, almost like a challenge.\nHarry licked his lips. “Well er…” He wanted to stop himself from remembering all those nights he would lay in bed thinking about Draco. Obsessing over him, really. What he was doing, where he was going, what he would say if he saw him in the corridor. And he told himself it was all just because Draco was on his way to becoming a Dark Wizard and it was Harry’s job to stop him.\nBut that wasn’t it.\nBecause he’d saved Draco’s life. And Draco had saved his.\n“You mastered my wand once,” Draco said, his voice low, “you want to master it again?”\nHarry stared, then burst into laughter, not missing Draco’s pleased smirk. “Oh my god. Oh god how long have you been waiting to use that?”\n“Years.” Draco spread his arms out along the back of the sofa. “I’m not joking though. Fifteen bloody years later and I still want to snog your face off.”\n“Is that why you’re being so nice?” Harry asked. He realised he was edging closer, and stopped himself.\nAll the humour drained from Draco’s face. “You really think I’m that horrible.”\nHarry swallowed. “Well er. No. I just…fuck Malfoy, I haven’t seen you since we were seventeen and I was trying to commit a murder. We weren’t exactly friends. It’s natural to assume you might have an ulterior motive.”\nDraco sighed, then set his beer down on the low table and stood up. “Right. Good to know you haven’t changed at all. No matter how long you spend away.”\nHe was walking away. Harry’s brain sort of stuttered as he watched Draco head for the door, and then panic set in. His legs began to act of their own accord, dragging him up and over. His hands betrayed him, reaching out and grabbing Draco by the back of his shirt, spinning him round before he could wrench the door open.\n“Wait. Malfoy…Draco. Just…sodding wait a second.”\nDraco’s eyes were narrow. “Potter I…”\nBut he couldn’t say more as Harry had pushed himself forward, lips almost touching his. “I want to kiss you,” Harry breathed. “Can I…er…”\n“You’re so fucking daft,” Draco growled before fisting his hand in the front of Harry’s shirt and yanking him in. The kiss wasn’t kind. It was a bit hard, dry lips and sharp teeth. But they moulded to each other in an almost desperate way, Draco’s long fingers curling round the back of Harry’s neck, Harry’s hands grasping at Draco’s thin shoulders.\nHarry let out a sort of breathless moan as he let his lips open, and Draco rewarded him by slipping his tongue in, hot and wet and needy.\n“Oh. Fuck.” Harry pulled back, his head spinning. “Draco…what the hell are we doing?”\n“Snogging. Jesus, are you a virgin?”\nHarry growled and pulled Draco in again, this time taking the kiss bossy and forceful. “No, I’m not a fucking virgin. But you’re Draco Malfoy and your tongue was in my mouth and I’m hard as a rock right now and all I can think about is throwing you on my sofa and shagging you until you can’t remember your name.”\n“Then what the fuck are you waiting for?” Draco demanded.\nIt was really all Harry needed. He spun him, backing him up hard and fast across the floor. Hands were tearing at clothes, feet kicking shoes off to the side, and they fell into the cushions, Draco on his back, Harry crouched between his crooked knees. Their groins pushed together, hard and hot, a sort of thrusting motion as their cocks aligned, desperate and begging for friction.\nTheir mouths hardly parted, trying to know each other inside and out. Hands were everywhere and Harry lost sense of where he began, and Draco ended. But that didn’t matter. Not when Draco shifted his hips and oh god…”Oh god,” he breathed. “Oh shit. Draco oh…”\n“Yeah. Yes. Fuck, Potter. Oh right there.” Draco shifted again and put his hands between them, taking one cock in each fist as Harry thrust against those slender fingers.\nHe lowered his head, kissing and biting at Draco’s neck as his hips pushed back and forth, harder, faster, the rhythm he craved.\n“Oh I’m oh shit. I’m…”\n“Are you coming?” Draco lifted his head to look between their bodies. “That’s the fucking hottest…” Draco bucked his own hips hard. “Oh shit yes come for me Harry.”\nHarry obeyed, like he was always meant to. His body seized and his head bowed low, breath coming out like a hiss between them. Through foggy eyes he saw Draco shivering with his own orgasm, their white fluid pooling together on Draco’s naked stomach.\nWhen it was over, it was all Harry could do not to collapse on top of Draco. His elbows were shaking, and Draco let out a small laugh, shifting over so Harry could fall between his body and the back of the sofa.\n“Jesus, if I knew you fucked like that, I would have tried to find you ages ago,” Draco breathed. “I know you hate magic, but d’you mind if I…?”\nHarry shook his head and Draco cast a wandless scourgify over their bodies. Harry shivered as they were cleaned up, and then he laid his head down on Draco’s shoulder. “That was um…”\n“Yeah.”\nHarry flushed. “I’d like to do that again.”\nDraco threw his head back and laughed. “Would you, now?”\nBlinking up, Harry reached up with a shaking hand and brushed a bit of Draco’s blonde fringe away from his forehead. “Yeah. I would. Unless you’ve got someone better to get home to.”\n“Are you joking? Potter, this is my fifteen year old fantasy come to life. But better. So much fucking better.”\nHarry’s eyebrows went up. “Fifteen year old fantasy?”\n“Well, back then it was more post-Quidditch hate-sex than fucking on your sofa. But close enough.” After some hesitation, Draco put his arm on Harry’s shoulder and pulled him in for another kiss. “But yeah. I think I’d like to do that again. And again. You know, for as long as you’d have me here.”\nHarry’s eyes slipped closed and he felt a wash of contentment. He didn’t know what the hell it was, but the idea of as long as he’d have Draco felt warm and soothing. So he nodded. “Yeah. I think I could stand that. For a long, long damn time.”\nDraco sighed and Harry could feel the grin against the top of his head. “Good.”"
}