{
    "id": "5056588",
    "url": "https://archiveofourown.org/works/5056588?view_full_work=true",
    "author": [
        "cosmicocean"
    ],
    "title": "In Which Foggy Nelson Will Absolutely File That Sexual Harassment Claim, Matt",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Marvel",
        "Marvel Cinematic Universe",
        "Daredevil (TV)"
    ],
    "relationships": [
        "Matt Murdock/Franklin \"Foggy\" Nelson"
    ],
    "characters": [
        "Matt Murdock",
        "Franklin \"Foggy\" Nelson",
        "Karen Page",
        "Natasha Romanov",
        "Clint Barton",
        "Tony Stark",
        "Sam Wilson (Marvel)",
        "Steve Rogers",
        "Thor (Marvel)",
        "Bruce Banner",
        "James \"Bucky\" Barnes"
    ],
    "additional_tags": [
        "Avocados at Law",
        "matt is such a little shit",
        "karen isn't paid enough for this shit",
        "she deserves a raise",
        "and her name on the sign",
        "and a small country",
        "Mostly Fluff",
        "a little bit of angst towards the end but not a ton"
    ],
    "language": "English",
    "series": "Part 2 of The Brotastic Adventures Of The Avengers And The Long Suffering Foggy Nelson",
    "published": "2015-10-23",
    "completed": null,
    "words": "9,531",
    "chapters": "1/1",
    "comments": "346",
    "kudos": "14,771",
    "bookmarks": "1,715",
    "hits": "139,544",
    "summary": "<p>Foggy looks at them for a moment before the brick of realization thwacks into him and he has to groan and put his face down on the table.</p>\n<p>“I’m not cheating on Daredevil with Matt.”</p>\n<p>“That’s not what we’re saying.” </p>\n<p>Foggy looks up at Steve. Searches his face. Groans even louder this time and puts his face back.</p>\n<p>“Matt is not trying to steal me away from Daredevil.”</p>\n<p>Where Matt is a little shit, the Avengers are concerned that Foggy is in a love triangle, and Matt and Foggy are so disgusting that Karen wants a raise.</p>",
    "notes": "<p>I spent a lot of time deliberating whether this was going to come off as Matt being a total dickwad, so here is my disclaimer:</p>\n<p>Foggy is not genuinely uncomfortable with any of this. He is amused and maybe a little exasperated, but he doesn't feel uncomfortable. If Matt thought Foggy felt uncomfortable he would immediately drop all of it, because he might be a little shit, but he's not actually an asshole.</p>\n<p>Really hoping this comes off as teasing like I wanted it to and not utter dickery.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Surprise! There's a part two!</p>\n<p>Actually, if you're me and a select few other people, it's not a surprise at all, because I wrote the first story with the intention of there being a second. I just only finally got around to finishing it.</p>\n<p>I don't know if there's going to be a third one, but I like this sandbox, so maybe.</p>\n<p>(the Italian is ripped straight from Google Translate, so forgive how absolutely bloody awful I know it to be)</p>\n<p>Edit: I have fixed the Italian! Many thanks to FoggyDevil for giving me better translations.</p>\n<p>\n<a href=\"https://cosmicoceanfic.tumblr.com/\" rel=\"nofollow\">Every once in a while one of my fics gets a bunch of comments in a cluster from different users, and I’m pretty sure at this point it’s because it’s been recced. Which is exciting! But I’d love to see it when it happens, so here’s a link to my tumblr! Feel free to tag me!</a>\n</p>",
    "text": "So, dating Matt is not actually that different from not dating Matt.\n           \nFoggy does, of course, give him shit that he never noticed.\n“Ten years, Matt,” Foggy says at one point. “Ten years and you never noticed.”\n“Some heartbeats are unusually fast!” Matt answers defensively.\nFoggy shakes his head. “I can’t believe it. I did my waiting. Ten years of it. In Azkaban.”\n“Hell’s Kitchen is hardly Azkaban, Foggy.”\n“Nope, it’s worse.”\n“I wouldn’t go that-“\n“TEN YEARS.”\n \nFor the first week they’re together, they try and hide it in the office because of an attempt to keep the workplace professional. It works okay until Karen returns earlier than they expected from her lunch break to find Matt between Foggy and a wall with Foggy’s tongue in his mouth, and there’s no amount of saying “no homo” that will fix that.\nFoggy knows. He tried. Even as Matt took the dignified route of letting Karen thwack him with a phonebook while yelling at them for not telling her.\n \nFor the second week they’re together, Karen plays “I Just Had Sex” every morning when they arrive at the office.\n“That is not true every time you play that, you know,” Foggy finally says when he hangs up his coat. Karen arches an eyebrow.\n“I don’t need to be able to hear your heartbeat to know that that’s bullshit,” she answers. “Also Matt’s got that overly pleased with himself smirk on behind you.”\nFoggy rounds on him as Matt serenely says “I assure you, there is nothing overly about it.”\nFoggy throws up his hands. “I’m not discussing my sex life with you, Karen!” he yells as he walks into his office.\n“Don’t worry,” she calls back. “You will. In time.”\n \nAnd then after all that, there’s not a lot that’s different.\nThey still take care of the same kind of cases. They still bicker over the proper way to approach them. They still refuse to drink Karen’s terrible coffee.\nOnly now, Foggy will absently press a kiss to Matt’s forehead and Matt will grin up at him with that big dopey grin that Foggy only used to see when they were drunk. Matt will run his fingers through Foggy’s hair while they’re studying case files with whatever hand isn’t clutching a slice of pizza. It’s natural, and it’s calm, and there’s something so peaceful to it that he can’t really assign an amount.\n           \nThere’s also the sex.\nWhich, yeah, also pretty cool.\n \n“So how’s life with Lucifer?” Natasha asks with a smirk when they’re having coffee.\n“Well, if you believe certain hate groups, I and all my fellow queer folk have been living with Lucifer for a long time, so really, I’m quite used to it.”\n“Hmm.” Natasha sips her mocha serenely. “Not used to the banging him part, though.”\nFoggy rolls his eyes. “No comment.”\nNatasha swirls her drink. “You’re happy, though?”\nHe can’t help the goofy grin that pops up on his face. “Yeah. I am.”\n“Good. I don’t want to have to kick anybody’s ass.”\nFoggy snorts. “Liiiiiiiie.”\nShe smirks a little in response. “What does your partner think of all this?”\nFoggy’s confused for a second before he remembers that the Avengers don’t actually know who Daredevil is. “Matt?”\n“Yes, him.”\n“Well…” Foggy thinks about it. “I think he’s surprised. But happy that I’m happy.”\nIt’s not a lie. Foggy can see it in his face sometimes, before he hides it. Confusion that it’s him Foggy’s picked, that everything has aligned so that the world doesn’t suck for Matt Murdock. It kind of breaks his heart.\n“Good. I’ve decided I want to meet them.”\n“You’ve decided that just recently, have you?”\nShe smirks again. Natasha uses her laughs carefully, but it doesn’t matter. Foggy can tell when she’s amused enough that she has the urge. “Recently enough.”\nFoggy raises his eyebrows. “Is it a fair assumption that you’re just going to randomly show up at our office without warning me?”\n“A little more than fair.”\n“Terrific.”\n“Sam will not be able to warn you as Sam is unaware of my decision,” she adds. Damn. Of course she knew he’d be counting on that.\n“Please do not terrify my friends and coworkers.” He’s not actually sure she would. Matt, he knows isn’t frightened of her. An unwise move, in his opinion, as one should always be a little afraid of Natasha. Karen might, but Karen also disguises steel with soft cuddly smiles, so it’s honestly a tossup.\n “I don’t know what you’re talking about.”\n \nMatt crawls into bed around three and Foggy absently reaches out to poke at him. Foggy always pokes at Matt when he’s back from Daredeviling. If he’s there and solid and makes some sort of grumpy noise, everything is all right.\nMatt’s grumpy noise is, in this case, overrun by Foggy’s groan. “Dude. No.”\n“What dude no?” Matt’s voice is muffled by the pillow he’s faceplanted in.\n“Body armor. In bed. No. Take it off.”\n“Why, Mr. Nelson, you’re trying to seduce me.” Foggy can hear his grin even through the pillow and absently smacks him on the head. At least he took the helmet off.\n“Ever want to get seduced again, you’re takin’ off the suit.”\nMatt gets the suit off impressively quickly. While still under the covers, too. Ten out of ten, Mr. Murdock.\n“Better?”\nFoggy pokes him again to make sure. Just abs.\n“Mmm-hm.”\n“That’s good.”\n“You’re all in one piece?”\n“Last I checked.”\n“You checked recently though, right?”\nMatt snorts. “Yes.”\n“Mmm. Good.” Foggy yawns. “Nat wants to meet you and Karen.”\n“She’s met me.”\n“Yeah, but not during your day job.”\n“Oh.”\n“Show up randomly. Try and make you shit yourselves. You know. Nat’s deal.”\n“Mm’kay.”\n“You want me to tell her no? Cause I can probably badger her into it.”\n“She’s your friend.”\n“Yeah, but I don’t-“ he yawns again. “Don’t want her to make you uncomfortable or something.”\nThere’s silence long enough that Foggy starts to suspect that Matt’s fallen asleep and he starts to doze off himself when Matt boops him in the nose.\n“Ehhhh. Why.”\n“You’re real.”\nFoggy cracks an eye open. Matt’s looking at him, hair all flat from the helmet like it gets sometimes, face soft and gently confused, like he’s pleased but doesn’t understand why.\n“Course I am. Not going to stop anytime soon.” He pulls at Matt’s hair a little until it doesn’t look weird anymore. “Go to sleep. Got work in the morning. Don’t make me groggy.”\nMatt gives him that tiny contented smile that Foggy doesn’t see enough. “Groggy Foggy.”\n“See, this is the only good reason you’ve got your weird ‘not tell the Avengers the secret identity’ thing.” Foggy closes his eye. “The scary devil thing kind of evaporates when you know what a loser you actually are.”\n \nFoggy folds his arms and fixes them with his best accusing glare.\nSteve, Bruce, and Thor are the only ones who shift guiltily. Sam doesn’t, but Sam doesn’t count, because Foggy knows he tried his best to prevent this, and also Foggy doesn’t want to strangle him. Bucky, Clint, Natasha, and Tony just stand there in their bold faced lack of shame.\n“You have a lovely office,” Bruce mumbles.\n“If you guys say you just happened to be in the neighborhood,” Foggy informs them. “I will beat you. With Clint’s foot. That will be dismembered from his body.”\nClint frowns. “Why my foot?”\n“You’re closest.”\nClint edges behind Natasha slightly.\n“Foggy, who are you-“ Karen stops next to him. “Oh. Hi.”\nThor waves. “Hello, Lady Karen.”\nSteve smiles a little. “Hi again, Ms. Page.”\n“Karen’s fine,” she says a little faintly.  “Foggy? Explain.”\nFoggy intensifies the glare. “Natasha thinks she’s funny.”\n“Introduce us to the lady, don’t be a dick,” Tony says.\n“Says the guy wearing sunglasses indoors.”\nTony pushes his sunglasses further up his nose. “Fuck you, Nelson, I look great.”\nFoggy sighs. “Avengers and Sam, Karen. Karen, this is Avengers and Sam.”\n“Why does Sam get a separate introduction?” Clint asks.\n“Because I actually like Sam.”\nKaren’s shock seems to be fading. “Don’t let Daredevil hear you say that, he’ll think you’re ditching him for another superhero.”\n“You should,” Sam says. “I have wings, way cooler. James Bond can’t even fly, you know.”\n“Pass.”\n“I’m also very attractive.”\n“You’re also hitting on that barista down the road from the Tower,” Bucky mutters.\n“So you know Daredevil too.” Natasha’s voice is intrigued. “Did he just adopt your law firm?”\nKaren grins. “He’s got a thing about strays.”\nThere’s the sound of the door opening. “Foggy?” Matt’s voice is far too innocent. “Are there a lot of people here?”\nFoggy walks to the door and calmly gives Matt his arm. “Yeah, the Avengers showed up.”\n“Oh yeah. You mentioned them.”\nFoggy carefully does not roll his eyes at Matt’s “butter wouldn’t melt” tone as he leads Matt around the Avengers. “So kind of you to notice.”\n“You must be Matt.” Tony slides his hands into his pockets. “Have you met the horned menace too? Well, you must have, the Fogmaster’s boning him.”\nFoggy knows Matt can hear his heartbeat go all funny and he hates it. “I’m going to poison your coffee very very soon,” he tells Tony.\n“He won’t notice,” Steve mutters. “He puts so much crap in it anyway.”\n“Hey, just because you grew up during the Depression and you think adding anything other than water to chewed coffee grounds is excessive-“\nFoggy loudly clears his throat. Sam snorts.\n“Avengers,” he says clearly. “Matt. Matt, Avengers. They all look like assholes except for Sam.”\n“Sam’s offered to switch out with Daredevil for Foggy’s hand,” Karen says, eyes gleaming. Foggy hates all of his friends except for Matt.\n“Really?” Matt looks mildly amused. “I’m not sure Daredevil would enjoy that.”\n“That is why,” Foggy growls through clenched teeth. “We would not mention it to him.”\nMatt just raises an eyebrow.\n“You could, though,” Clint says. “Might get some awesome possessive sex out of the deal. That’s always fun.”\n“Would everyone quit making statements about me getting laid.”\n“I can’t get anything out of him,” Natasha addresses Matt. “Have you heard anything?”\n“I have.” Matt smirks. “Nothing but vociferously good reviews, I promise.”\nKaren chokes on her coffee. Nope, Foggy hates Matt too.\n“ALL RIGHT,” Foggy says loudly. “AND ON THAT NOTE I THINK WE’RE DONE HERE.”\n“No, hold up.” Tony’s grinning. “I want to hear about these reviews. Like, ten out of ten, or mind blown, what are we talking here, as a connoisseur of such reviews?”\nMatt must be picking up on the “if you say a god damn word I will dunk your suit in glitter” vibes that Foggyis shooting his way because he just smiles slightly and shakes his head.\n“Sorry,” he says ruefully. “Another time. We’ve got a case to work on.”\n“Can you get to your office okay with excess people?” Foggy asks, because he will keep up this charade for Matt no matter how bad he wants to kick his ass.\n“I think I’ll be fine.” He absently pats Foggy’s lower back, a fairly standard gesture for him these days. “Thanks.” He navigates his way to his office and Foggy turns back to the Avengers, who all have weird expressions on their faces.\n“What?”\n“Nothing,” Steve says too quickly. Foggy narrows his eyes and wonders what he wants more, to grill superheroes about being off or to finally have them out of his office.\n“All right, Matt’s right, we’ve got a case. Thank you for showing up to try and menace my coworkers.”\n“What are friends for?” Tony breezes out of the office. Sam starts herding everyone else out.\n“All right, come on, guys, leave Foggy in peace. See you later, man.”\n“Bye, dude.”\n“It was nice to meet you, Karen. Say the same for Matt for me.”\n“Sure thing.”\nSam closes the door behind him and Karen turns to Foggy with a grin.\n“Vociferous, huh?”\n“You are on the list of people I’m going to beat with Clint’s foot.”\n“I don’t even know what that means.”\nFoggy walks into Matt’s office to see him tilted back in his chair. He’s got that look on his face he gets when he’s listening in to someone else’s funny conversations.\n“Is it two floors down fighting about butter versus bacon for what they’d rather give up again?” Foggy asks. Matt shakes his head slightly, looking a little pleased with himself. Foggy decides he doesn’t want to know.\n“Vociferous? Really?”\nMatt grins, face still pointed towards the ceiling. “Is that not how one could describe the feedback I’ve been getting?” He lets out a little cackle, obviously at something Foggy can’t hear.\nFoggy shakes his head. “Superheroes are all idiots.”\n“I’m not a superhero.”\nFoggy rolls his eyes and kisses Matt’s forehead. “I know, you’re a big scary vigilante who don’t need no law.”\n“You’re both sickening,” Karen informs them. “I want a raise.”\n“You may now get three bread crusts instead of two,” Matt says seriously.\n“God bless us, every one,” she deadpans right back.\n \nKaren texts Foggy a photo that evening. It’s of a note, typed from a computer that simply says DROP THE ANDRIEV CASE.\nFoggy texts back kind of wish they’d used comic sans.\nHe gets two responses in just a few seconds.\n\nLoser.\n\n\nBulgarian mob?\n\nFoggy’s honestly amazed how many different criminal by organizations labeled simply by primary country of origin there are in the city. He feels like The Godfather lied to him. Can’t think of anyone else who’d want use to ditch the Andriev case. The Andrievs are a lovely old couple in Hell’s Kitchen who are being terrorized because they refuse to vacate the building they’ve lived in since they moved to America over fifty years ago.\n\nDoes it go on The List?\n\n“The List” is what Karen and Foggy call the list of things they don’t tell Matt. It includes that Foggy and Karen once had a lengthy drunken conversation about how attractive Steve is, that it was Karen who once accidentally mixed up the ibuprofen and the heavy duty painkillers, and most threatening letters they receive for the cases they take on. This is because they usually never come to anything, and if Matt knew he would try and beat all of them up, which would result in probably fewer threats, but more Matt with the shit kicked out of him, something Foggy and Karen have a vested interest in avoiding.\n\nYeah, for now.\n\n\nGot it. \n\n \nSteve and Bucky drop by a few days later with a package. Foggy looks at it warily.\n“It’s from Tony,” Steve says. Foggy cranks the wariness up to eleven.\n“I feel like if I open it it’s going to explode sequins or something.” Tony has a very strange sense of humor.\n“He says it’s a new iPad to replace the one Bruce accidentally stepped on.”\n“Sure, that’s what he says.” Foggy pokes it with a pencil.\nSteve looks at Bucky with a shit eating grin. “Would you like Bucky to open it for you to make sure?”\nFoggy looks up at Bucky. “I feel like the idea of you picking sequins out of the plates in your arms for weeks is hilarious.”\n“I feel like dangling you off the roof by your underwear is also hilarious,” Bucky says mildly. Foggy snorts and opens up the box. It is in fact an iPad, with a large Post-It on the front that says STARKPADS ARE BETTER. LET ME KNOW WHEN YOU COME TO YOUR SENSES. I HAVE ONE WAITING FOR YOU WITH YOUR NAME LITERALLY ON IT.\n“Is him threatening you with some mega atomic wedgie normal?” Karen asks from her desk. She’s moving into unfazed about the whole Avenger thing. It’s one of the reasons Foggy likes her- it is hard to faze Karen Page for long.\n“Sure is. Threats are how he expresses love.”\n“Mild fondness,” Steve corrects. Bucky nods seriously, lips barely twitching.\n“I don’t hate you.”\n“Awe, you’ll make me blush.” Foggy turns on the iPad and it bellows “I’M A BIRD MOTHERFUCKER.” Foggy drops it in shock and Karen yelps. Steve and Bucky stare at it.\n“I feel like,” Foggy says carefully. “Clint may have gotten his hands on this.”\n“I feel like you may be correct.”\nMatt comes into the office. “What was that?”\n“Clint. Steve and Bucky are here.”\n“Oh.” Matt looks appropriately surprised. “Hello again.”\n“Hi,” Steve says. Bucky glowers. Foggy assumes this is because Bucky glowers at most people he’s only just met that aren’t small children. And Karen, but Karen’ll do that to you.\n“They brought me another iPad after Bruce stepped on mine.”\nMatt smiles pleasantly. “Your fault for leaving it there within his Hulking range.”\n“Would not hold up in a court of law, counselor.”\n“I’m sure I could make it work.” Matt angles his head towards Karen slightly. “Karen, do you know where the folder for the Devon paperwork is?”\n“Desk, three steps to your right, just behind Foggy.”\nMatt leans somewhat surprisingly close into Foggy’s personal space, causing him to tense in surprise. He bends so he’s breathing on Foggy’s neck as he gropes around for the file. Karen pushes it towards him. “Ah, excellent.” He leans back from Foggy. “Thank you, Karen.”\nKaren raises her eyebrows. “You got it.”\nMatt smiles weirdly flirtatiously at Foggy and heads back into his office. Foggy looks back at Steve and Bucky. Steve’s face is oddly guarded and Bucky’s glower has intensified.\n“You okay?”\n“Mmm,” Steve says vaguely. “I’ll talk to Tony about how to turn off the bird thing.”\nFoggy knows that Steve knows just as well as he does that if Tony didn’t have anything to do with showing Clint how to do it, then he’s still going to find it hilarious, and it’s going to take some serious badgering to get him to tell him how to change it. “Pull out your All-American disappointed face, that should get the job done.”\nSteve frowns. “I don’t have an All-American disappointed face.”\n“You do,” Bucky mutters. “Looks like a bald eagle’s about to cry.”\n“We’ll see you around, Foggy. Bye, Karen.” Steve gives them a little wave as they file out. Foggy and Karen look at each other.\n“Do you feel like there’s something going on that we aren’t privy to but involved in?” Karen asks. “And it involves that asshole in the office and those assholes that just left?”\nFoggy’s a little pleased that she feels comfortable enough with the Avengers to call two decorated war heroes assholes. “Yes I do.”\n“What are the chances of getting that asshole to say what’s up with the other assholes?”\n“I dunno.” Foggy raises his voice. “Hey, asshole!” No response. Foggy shrugs. “Minimal, I would guess.”\n \nThat night when Foggy gets home, a rock’s been thrown through his window. His place isn’t even on the ground floor. He’s kind of impressed. Also wondering how bad the hard times the Bulgarian mob have clearly fallen on are, if they’ve resorted to rock throwing tactics.\nHe takes a picture and sends it to Karen with the message rock fairy visited!\nShe texts back ha, I got a brick. Clearly they like me more.\nShe then sends a picture of her posing with the brick, because this is their lives now.\n           \nHe gets a text the next night when he’s watching an ABC Family Harry Potter marathon from Natasha.\n\nAll of us going to Italian place in Hell’s Kitchen tomorrow night. You’re coming alone.\n\nMatt climbs through the window, tugging off his helmet. “You don’t even like the fifth movie.”\n“It was on.”\n“Of course, silly me.” Matt heads into his bedroom to change. “Anything interesting happen while I was gone?”\n“ABC Family’s trying to do a kid friendly version of Dog Cops. I give it three episodes. Also I think I’m being shanghaied into a date with the Avengers tomorrow night.”\nMatt flops on the couch next to him in sweatpants and his Don’t Mess With My Funky Flow sweater. “Somehow I’m not surprised.”\n“Glad you’re taking it so well.”\n“Well, I really should have seen it coming.”\n“You really should have.”\n“I wish you all the happiness in the world.”\n“Please wear something tasteful to our wedding.”\nMatt nods thoughtfully. “Buck naked. Got it.”\nFoggy snorts as he absently throws an arm around Matt’s shoulders. “Your best man privileges are revoked.”\n“So I’m going to have to just bust in on a white horse to declare that I object, then?”\n“Sounds like it would be pretty uncomfortable paired with the naked thing.”\nMatt throws his head back and laughs and he looks so happy that Foggy just has to kiss him a little bit for it.\n \n“Hi, Serefina,” Foggy says when he walks into Graziano’s the next night. “How’s your grandmother?” They worked on the Graziano’s case a few months ago, which involved an asshole landlord and a particularly heart wrenching closing argument to the jury, if he does say so himself.\nSerefina smiles at him. She is pretty and kind and according to Matt was extremely attracted to Foggy during the case.\n(Matt did not find Foggy’s mock-wistful “ah, if only I’d known” comment as funny as Foggy did)\n(There may have been pillow throwing involved)\n“Hello, Foggy. We’re all doing wonderfully, thank you. How are you and Karen and Matt?”\n“Splendid, thank you very much.” Foggy sticks his hands in his pockets. “The party I’m with is rather large tonight, I’m afraid.”\nSerefina raises her eyebrows. “Is it the Avengers?”\n“I am honestly surprised that you have a table big enough for all of them.”\nShe grins. “We may have had to push a couple together.”\n“I find myself hoping you mean the tables.”\nShe laughs. “You’ll see them when you walk into the main room.”\nHe does. Fortunately the place doesn’t get extremely crowded on a Tuesday night, so there’s not a lot of people to stare at the large crowd of superheroes sitting around two shoved together tables.\n“I feel like this is an intervention,” Foggy says, sitting in between Clint and Sam. “What are you intervening me about?”\n“What’s the pasta like here?” Tony’s browsing the menu.\n“It’s an Italian joint, Tony. It’s pretty good.”\n“Foggy!”\nFoggy turns around and grins. He welcomes the hug from Serefina’s grandmother. “Hi, Mrs. Graziano. How’s business?”\n“Much better, thanks to you and Matthew. How is Matthew?”\n“Very well, ma’am.”\n“Such a handsome young man. I hope his face is not as cut up now?”\n“Not the last time I checked.” The last time Mrs. Graziano had seen him, Matt was in the courtroom after having a friendly chat with her landlord.\n“Good, good. Anything you and your friends want, it’s on the house.”\nFoggy frowns. “Absolutely not.”\n“Don’t be so silly, of course it is.”\n“Mrs. Graziano-“\nShe leans on her cane and smiles benevolently. “You will not be the first person whose kneecaps I’ve taken out with this cane, Foggy.”\nSomehow, Foggy believes that. Tony snorts into his water.\n“Listen to her,” Tony says. “Italian grandmothers take no shit. I speak from experience. Lui dovrebbe saperlo ormai, non crede?”\nMrs. Graziano laughs delightedly. “I bambini, non imparano mai.” She pats Tony on the cheek. “Tutto quello che vuoi, mio caro, per te è gratis.”\nShe hobbles off and Foggy looks at Tony. “Did you just make her like you more than me?”\n“I’m very likable.”\n“Sure you are.”\n“Fuck off, Barton.”\nFoggy sits back down. “So, intervention, what?”\nSteve looks forwards seriously. Clearly he’s been elected the spokesman for whatever’s going down. Foggy tries not to feel apprehensive.\n“We wanted to know if you’re happy,” Steve says seriously.\n“Yeeeeeees? I feel like this is a trick question somehow.”\n“It’s not a trick question. Just be honest.”\n“I’m happy. Probably happier than I’ve ever been in my life. Why?” Something occurs to him. “Oh Christ, you’re not gonna go beat up Daredevil, are you? I will cut all communication with each and every one of you if you go and beat the shit out of him, I am not fucking around.” He’s not.\n“No, we don’t have any interest in Daredevil.”\n“I would like to beat him up,” Clint says, raising his finger. “But that’s not because of you. That’s because he’s a shit who thinks he’s better at punching than I am.”\n“He is better at punching than you are,” Natasha points out in a murmur. Clint waves a hand.\n“Details.”\n“Guys,” Sam reprimands. “Focus. You’re happy with Daredevil. Are you… happy at work?”\nFoggy frowns. “This totally has to do with how twitchy you guys get when you’re at the office, aren’t you? Is this Matt’s fault?”\n“Why would you automatically assume that it’s Matt’s fault?” Bruce jumps in. Foggy’s frown deepens.\n“Because you’re being weird at Matt in particular. Did he like spit in your coffee or something? You know he wouldn’t actually be able to tell it was your coffee, right?”\n“He seems very…” Thor mulls for a moment. “Friendly with you.”\n“I’ve known him for ten years. If he wasn’t friendly, I don’t think I would have started a law firm or anything with him.”\n“Unusually friendly,” Thor clarifies.\nFoggy looks at them for a moment before the brick of realization thwacks into him and he has to groan and put his face down on the table.\n“I’m not cheating on Daredevil with Matt.”\n“That’s not what we’re saying.”      \nFoggy looks up at Steve. Searches his face. Groans even louder this time and puts his face back.\n“Matt is not trying to steal me away from Daredevil.” He hates his life.\n“You sure?” Bucky sounds like he has zero faith in Foggy. “Cause he seems very friendly with you.”\n“Yes,” Foggy says crankily. “I’m sure.”\nHe is not cranky because of the Avengers bringing it up. If it was just that, it would be hilarious. But it’s not that.\nIt’s that Matt’s a shit.\nMatt knew about this. He totally knew about this. He must have heard them discussing it on their way out when they visited, that’s why he looked so amused. That’s why he got so in Foggy’s space the other day. Matt thinks it’s funny to wind them up.\n\nMatt is a shit and he goddamn well knows it.\n\n“There are sexual harassment suits,” Bruce tells him gently. “If ever you feel you need them.”\nWhat Foggy needs is to beat Matt about the head with Robert’s Rules of Order, but he feels like that won’t help Matt’s case very much. “Thank you, Bruce,” he says tiredly.\n“We’ll leave you alone about it now,” Sam says. “You’re a grown ass man, you can deal with it on your own.”\n“Thank you, Sam.”\n“Maria Madre di Dio, Franklin.” Foggy is treated to a thwack on the back of the head by Mrs. Graziano. “Head off the table, this isn’t a barn.”\n“Yes, ma’am.”\n           \nMercifully, they do drop it after that. They actually have a nice meal that pretty well tamps down the irritation Foggy’s feeling with Matt and he leaves laughing.\nUntil he hears a familiar scream from an alley and then he’s fucking bolting towards it, ignoring the yells of everyone else.\nKaren is slamming one guy repeatedly in the face with a trash can lid while another guy is coming at her. Foggy does what seems like the most sensible thing at the time, which is jump on the guy’s back and bellow “GET THE FUCK AWAY FROM MY SECRETARY YOU DICKHOLE” to confuse him. It does the trick enough that Karen pepper sprays the ever loving shit out of the dude. Foggy jumps off before the guy hits the ground.\n“Thank you.” Karen shakes the can of pepper spray, evidently empty. “Damn.”\n“You okay?”\n“Yeah, fine. You?”\n“Fine.” Foggy peers down at the guy. “I think you got some in his mouth, dude.”\n“Good.” She looks at the Avengers behind Foggy, staring at her in surprise. “Hey, guys.”\nNatasha grins, pleased. “I knew you were scary.”\nKaren frowns at Foggy, momentarily diverted. “You didn’t tell her I was scary?”\n“I told her you were scary! I told her you were very, very scary!”\n“GUYS.” Tony is glaring at them. How is Tony the one to set them back on track? Foggy’s life is so very weird. “Why are you being cornered by big guys in an alley?”\n“It’s not the first time.” Foggy crouches by the one Karen pepper sprayed into oblivion. “Yeah, there’s definitely some in his mouth.”\n“Why now? You guys are lawyers, you’re not us, how are people coming after you?”\n“Believe it or not, lawyers in crime ridden areas have been known to tick people off sometimes.” Foggy squints. “Bulgarian mafia?”\n“Bulgarian mafia,” Karen confirms. “List of things we don’t tell Matt?”\n“I’m sure he would be displeased to hear you have that,” a low voice says from behind them. The Avengers jump. Foggy yells and falls from a crouch properly onto the ground. Karen hurls her empty pepper spray canister in the voice’s direction.\nMatt just lets it bounce off his helmet.\n“This is not the best time to try and scare us to death,” Karen snaps.\n“Are you both all right?” Matt asks.\n“Fine.” Foggy holds his arm out. “Do your boyfriendly duties and help me up.”\nMatt’s lips twitch and he grasps Foggy, hauling him to his feet. His fingers linger on his wrist, checking his pulse, probably. “You all right?”\n“Yeah, I’m fine. Been a while since I had to jump on anybody’s back.”\nMatt nods and quietly brushes his lips against Foggy’s. “Good.”\n“Gross,” says Clint.\n“I have to deal with this all the time,” Karen tells him. “You don’t get to say gross. I get to say gross.”\nMatt turns to Karen and makes a vague gesture at the thugs on the ground. “Who are these?”\n“Who, them?” She winces a little as Matt inclines his head.\n“Yes. Them.”\nShe looks over Matt’s shoulder pleadingly at Foggy. Foggy sighs and nods wearily.\n“Yeah, yeah, cat’s out of the bag now.”\n“They… might possibly be members of the Bulgarian mafia.”\nMatt goes very still. “The Bulgarian mafia.”\n“Them.”\nMatt now looks at Foggy. Foggy lifts his chin in his best “fight me, Murdock” stance. “The Andriev case?”\n“They’re not super thrilled with us,” he confirms.\n“Your partner hasn’t gotten any threats.”\nFoggy shrugs. “Might’ve thought the blind guy wouldn’t notice a rock through his window.”\nMatt’s “I’m very overprotective and focusing all that energy quite unfairly on Foggy and Karen” vibe gets stronger. “They threw rocks through your windows?”\n“Karen got a brick. I’m actually a little offended.”\n“What can we do?” Thor asks, stepping forwards. Foggy immediately starts shaking his head as Matt arches like a pissed cat.\n“No, no, no. I do not want you guys getting involved in this. I didn’t want him getting involved in this.” Foggy jerks a thumb at Matt.\n“Why didn’t you want me getting involved?”\n“Because I like it when you come home generally less bruised and beat to shit, is why!”\n“We can get involved,” Steve says, all the Avengers shuffling a little closer.\n“My place is home?” Matt asks, sounding startled.\nFoggy takes a deep breath and launches in.\n“I don’t want you guys getting involved because this isn’t an Avengers thing, this is a Hell’s Kitchen standard lawyer everyday life thing.” Foggy turns to Matt. “Shut up.” Foggy turns back to the Avengers. “This isn’t something to worry about, it’s fairly standard stuff.” Back to Matt. “Yes it is standard stuff and yes we will tell you about it.” Back to the Avengers. “We’re going to go back to his place so we can calm him down from the fact that he is now freaking out about that this being something we’ve gone up against before. He doesn’t look like he’s freaking out, but he is.” Back to Matt. “Yes you can follow us.” Back again. “No you cannot.” To Karen this time. “Did I cover everything? I think that covered everything.”\n“Sounded good to me.”\n“We’re going to talk about this later,” Bucky mutters. Foggy waves at him.\n“Later. When I’ve had a couple beers and some sleep and he’s not hyperventilating on me.”\n“I’m not hyperventilating,” Matt mutters.\n“Not yet.”\n“You can handle this?” Sam asks. Matt frowns and shuffles.\n“Yes.”\n“Hey,” Tony says. “You met his partner, right? Murdock?”\nMatt tilts his head a little. “Yes?”\n“Keep an eye on him. He’s shifty. We don’t trust him.”\nFoggy suppresses a groan.\n“I’ll keep that in mind,” Matt says seriously. Karen mouths “what the fuck?” at Foggy, who mouths back “tell you later”.\n“Okay.” Clint claps him on the shoulder. “Glad both of you guys haven’t been roughed up by ruffians.”\n“Text me when you get home,” Bruce says.\n“You got it.”\n \n“Is he gonna kill us?” Karen asks in the elevator on the way up.\n“No. Well, I don’t think so.” They step out of the elevator. “He’d know where to hide the bodies, though.”\nFoggy opens the door to Matt’s apartment to see Matt standing by the window, helmet off but still in the suit, glowering.\nFoggy and Karen just stand in the doorway for a moment. Then Foggy closes the door behind him.\n“You’re really hard to take seriously when your hair’s all funky from the mask,” Karen tells him while Foggy goes to the fridge.\n“I know, right? All flat and shit.” Foggy pulls out two beers.\n“Does it ever not look flat?”\n“Well, you gotta tug it off right. Takes practice.”\nKaren wrinkles her nose as Foggy hands her one of the beers. “Dude.”\n“Hey, you started asking questions.”\n“So,” Matt says flatly, running his fingers through his hair. It looks much wilder and much more distracting. “Tell me about this list of yours.”\nFoggy and Karen look at each other.\n“Like, everything on it?” Karen asks cautiously. “Or the Bulgarian mob thing?”\n“Start where you think is best.”\n“Well.” Foggy sighs. “Honestly, most of it isn’t stuff like mobs and mafias and shit.”\n“Yeah,” Karen agrees. “Most of the stuff is just like yes Foggy did accidentally order rainbow socks for you instead of the black ones, but he thought you looked cute in them, so he just threw them in with your regular ones.”\n“He knew that, actually,” Foggy interjects. “They felt different. He just liked making me happy when I saw them.”\nKaren stares at Foggy. “You’re both disgusting. I want a raise. Anyway. There’s not actually a lot of scary things. There’s occasional threats, but mostly it’s just weird things like that.”\n“Tell me about the Bulgarian mob.”\n“They sent us a note, about a week ago. Then the brick and the rock. And then they wanted to rough me up a little.” Karen looks at Foggy. “Small, blond woman. Probably thought they could just hit me in the face a few times and I’d show up to work with bruises and crying and that’d be enough.”\n“They didn’t count on how frightening you are.”\nKaren smiles proudly. “You bet they didn’t.”\n“Why didn’t you tell me?”\nFoggy sighs. “Matt, do you remember the last case we told you had someone threatening the firm?”\nMatt frowns, clearly thinking back on it. “The White case.”\n“You came back with one broken rib and three bruised ones. You were white knuckling your cane in court the next day.”\n“We need you safe, Matt,” Karen says softly.\nMatt shakes his head. “You both would manage fine without me, the firm would make it and you two would be-“\n“I’m not talking about the-“ Karen looks at Foggy for help.\n“Karen needs you safe, Matt. Karen is your friend, and she wants and needs you in one piece.” Foggy rubs his forehead. “I need you safe,” he murmurs. “I need you alive and okay and not getting beat to shit because you feel the need to protect us from what we can handle on our own.”\nFoggy doesn’t look up at Matt as the silence hangs heavy.\n“Okay,” Matt finally says.\n“Okay okay?” Karen asks. “You’re not going to wig out?”\n“No.”\n“Good.” Karen slumps on the couch and kicks off her heels. Matt sits across from Foggy on the coffee table and Foggy finally looks up at him. Matt has that slightly twisty smile he gets when he’s having good feelings but doesn’t understand what to do with them.\n“Home?” he asks. Foggy shakes his head.\n“No, you don’t get to pull that adorably happy thing.” He pokes Matt in the nose. “You’re fucking with the Avengers.”\nMatt’s soft emotional smile widens into something Foggy’s more familiar with: ah ha yes I am a little shit but nobody ever expects the blind guy. “Pardon?”\n“Yeah, why are the Avengers saying that lawyer-you is shifty?” Karen takes another swig of her beer.\n“They think Matt’s trying to steal me from Daredevil.”\nKaren does a spit take right on the back of Matt’s suit.\n“Hey,” Matt objects mildly, still grinning.\n“Are you shitting me?”\n“They met me tonight to let me know I could file a sexual harassment suit if I felt the need.”\nMatt cackles. Karen groans.\n“I’m taking the bed because you have silk sheets. Please don’t fuck on the couch. Or at least loudly.”\nKaren staggers off, heels in hand, clearly done with both of them.\n“You are constantly such a shit,” Foggy tells Matt. “They think that you’re trying to seduce me in the workplace.”\n“I mean. They’re not wrong.”\n“Matthew.”\nMatt grins. “It’s funny, though, isn’t it? A little bit?”\nFoggy suppresses a smile. “It’s not that funny.”\nMatt slides a hand into Foggy’s. “I’ll tell them eventually. I just. I want to keep the lines drawn between all of this and you.”\nMatt’s got that sad puppy thing going on again. Foggy relents a little. “You better. I don’t want to have any more interventions.”\nMatt leans his face into the crook of Foggy’s neck. “I’m glad you weren’t hurt,” he says. Foggy puts a hand in his hair.\n“Yeah. Me too. So, wanna fuck on the couch?”\nMatt laughs so hard his entire body shakes with it.\n \nIn the morning they reach an arrangement. Matt will investigate into the folks throwing blunt objects at them. He will not punch them into oblivion. He will take a calm and measured approach.\n“How long do you think it’ll last?” Karen asks while she’s sorting through papers on her desk.\n“As long as Matt says it will,” Foggy answers calmly. Matt’s made him a promise. He’s going to stick to it.\nMatt sidles in with what smells like donuts from Evangeline’s, the bakery up the street and the actual best pastry eatery in the world. Foggy thinks about kissing him, but the level to which Foggy wishes to kiss him may actually add Karen to the list of blind people working in this office, so he just kisses him on the cheek.\n \n“So Daredevil wanted us to dump this here,” Clint says, dropping a file on Karen’s desk. Foggy looks over from the kitchenette. “Is he ever going to get over this ‘I have a secret identity cause I think it makes me badass’ thing? Does that ever come up in your pillow talk?”\n“Mostly it’s just ‘these are how many old ladies I helped cross the street while punching ninjas in the face’ counts, honestly.” Foggy companionably bumps shoulder with Natasha and gives Karen her coffee. “Gets really boring after a while. Kind of wish he’d just give me nice recipes for Swedish meatballs eventually or something.”\nKaren snorts as Matt wanders in, face amicable.\n“I heard voices.”\n“Clint and Nat are dropping something off,” Foggy says, picking up the considerably thick file. “Don’t know what, though.”\nNatasha seems to be giving Matt her chilling “I have gutted warlords with the handles of mugs” glare in the hopes he’ll somehow register it. Clint is sticking his tongue out at Matt.\n“Hello, Clint, Natasha.” Matt’s voice is serene. “Nice for you to drop by again.”\nFoggy frowns as he flips through the contents. “Is this- did Daredevil ask for a dossier on the Bulgarian mob?”\n“He did,” Clint says loudly. “Asked us to drop it off right here. Guess he knows where you guys work.”\nKaren bites her lip to hide the smile. Foggy raises his eyebrows at Clint and resists the temptation to say “he’s blind, not deaf” at him but feels like that’ll probably exacerbate the situation.\n“Is it because the Bulgarian mob’s been harassing you guys?” Matt smiles angelically in the realm of Clint and Natasha. “Daredevil stopped by to let me know.”\n“Have you seen his muscles?” Clint hollers. “Very big. Powerful. Seen him punch a guy right in the face like he was punching tissue paper.”\n“Well, I didn’t exactly see them, no,” Matt answers serenely. Foggy takes a deep breath.\n“Daredevil asked for a dossier on the Bulgarian mob?” he repeats while Clint clearly tries to right himself from that one.\n“Yes,” Natasha answers. “He wants information to help dismantling them with less punching than normal.” She smirks at Foggy a little. “He doesn’t want to worry you two.”\n“Hm.” Foggy’s pleased. “Good.”\n“He likes Foggy a lot,” Clint bellows. “Makes him really happy. Sure hate to think what he’d do if he found out someone was trying to get in Foggy’s pants when this someone would know that Foggy was happy with Daredevil.”\nFoggy stares at Clint and wonders how this man is a covert operative. Natasha looks like she is contemplating the same thing.\n“Probably wouldn’t be very pleasant,” Matt agrees. He leans over to grab Foggy’s mug of coffee from the desk but his cane accidentally hits Foggy’s foot and goes down.\n“I got it.” Foggy kneels down to pick it up. “Hang on.” He grasps vaguely for something to hold onto to help himself back up, and he ends up settling on the corner of Karen’s desk and Matt’s belt loops, almost absentmindedly feeling up Matt’s ass on the way. Matt lets out an odd strangled sound that’s not quite high pitched enough for a yelp but certainly not low pitched enough to be a growl. Foggy hands Matt’s cane to him with a sunny smile.\n“Here you go, buddy,” he says cheerfully, because fuck you, Matt, he can play this game too, and he can play it better.\n“Thanks,” Matt mutters, voice still awkwardly hoarse. Foggy is so god damn proud of himself he could shed a tear, honestly. He slips back into his office. Foggy turns to Clint and Natasha. Clint looks confused and Natasha contemplative.\n“Thanks for the file,” Foggy says cheerily.\n“You’rrrrrrrrrre welcome,” Clint answers slowly. “There’s something going on here and I’m gonna figure out what it is.”\n“Good luck with that, Hawkguy.”\nClint slowly moves out of the office, looking warily at Foggy the whole time. Natasha raises an eyebrow at Foggy with a smile.\n“This is somehow a game with Daredevil,” she says. “I don’t know how it is, but it is.”\nFoggy grins. “Might be.”\n“Who’s winning?”\n“I am,” Foggy answers immediately. “As I win at all things.”\nNatasha snorts. “Well, I’ll check in with Daredevil and see if he says the same thing.”\n“If he doesn’t he’s lying.”\nShe smirks a little and gives Karen a wave. “See you, Karen.”\n“Bye, Natasha.”\nNatasha closes the door behind her and Karen immediately turns to Foggy.\n“Not paid enough,” she says. “If I’m not getting a raise, I want my name on the door. Bigger than both of yours.”\n“We’ll swap it out with Matt’s,” Foggy assures her, then turns to call out. “That okay with you, Matt?”\n“I’m too busy looking at recipes for Swedish meatballs to hear you, Franklin!” Matt calls back. Foggy laughs. Karen starts throwing pens at him.\n \nSo Foggy is starting to think that perhaps his decision to not let Matt beat the shit out of the Bulgarian mob may have been a poor choice on his part.\nThis is due mostly to the fact that there are two rather large gentlemen tailing him on his way back from Murphy’s.\nHe casually pulls out his phone and hits Karen’s number.\n“Hello?”\n“Don’t talk, no time, just listen. I’ve just left Murphy’s and I’ve got two big dudes on my tail. Call Emergency Contact #1 and if you can’t get ahold of him, call Emergency Contact #2.” He hesitates for a second. “And tell Contact #1 that-“\nThis is of course the moment Foggy gets whacked across the back of the head, because his life is a soap opera.\n \nHe also gets waken because he’s being hit, to the front of the head this time.\n“Nyuh,” he manages intelligently through a bloody lip, and cracks open his eyes.\nThe two big guys from before are flanking a tall skinny man who is kneeling in front of Foggy and appears to be the person who hit him. Foggy squints at him.\n“M’I actually tied to a chair in a warehouse?” he croaks. He looks around a little. Might also be a parking garage but it’s pretty dark. “Pretty cliché, guys.”\nThe skinny man smiles. “You know the Avengers,” he says in barely accented English. “My friends here told me.”\nFoggy squints a little harder and hey yeah, these dicks do look familiar.\n“Your mouth still taste like pepper spray?” The one he was talking to punches him in the face. “Graaaaaa that sucked.”\nSkinny Asshole leans back on his haunches a little. “How does a small time lawyer from Hell’s Kitchens become friends with the Avengers?”\n“Scuse you. I’m big time.”\nSkinny Asshole chuckles. “It’s of no matter, of course. I was just curious. Now.” He inclines his head slightly. “I’d like you to drop the Andriev case.”\n“Got that vibe.” Foggy spits out some blood on the guy’s nice black pants. “Gonna have to pass.”\nSkinny Asshole calmly wipes the blood off with a tissue. “You haven’t heard my offer yet.”\n“If it involves money, m’not interested. Probably actually involves you hurting me. Still no.”\n“You know, people always say they won’t break under torture.” Skinny Asshole stands up and steps back. “They’re usually wrong.”\n“Sounds like fun.” Foggy looks up at the guy through the black eye he suspects is forming. “Am I a warning? Or a message?”\nHis smile widens. “That depends on when you break.”\n“Yay.”\nOne of the big guys punches him right in the gut. He thinks he feels a rib crack. He can’t help a little scream at that. Skinny Asshole folds his arms.\n“I wonder what the pretty secretary will think when she sees you,” he muses. “If she will even recognize you.”\nThe other big guy slams his fist into his face at the same time the first one punches him in the chest with his other fist. Foggy definitely hears his nose break.\n“Perhaps it is good that your partner is blind.” Skinny Asshole’s lips twist. “Hopefully your secretary will keep him from feeling your face.”\nFoggy’s chair falls over with a thump. Yep, something is definitely wrong with his ribs. He only has the breath right now to choke.\n“Be careful,” Skinny Asshole instructs. “I want him to be able to tell me when he gives in.”\nFoggy manages to raise a middle finger that promptly gets stamped on. Agh.\n“Sass is not appreciated,” Skinny Asshole lectures. Foggy cracks open his eyes in time to see the wall behind him get smashed in by a large green blur.\n“Oh good,” Foggy mumbles, and closes his eyes while listening to the carnage, letting his head slump against the floor. He deserves it.\nHe is what he considers rudely tugged back to personhood again what may be a few minutes later by Natasha, tapping his cheek.\n“Wake up, khrabryy mal'chik,” she says softly. “The fight’s over.”\n“M’allowed to be crabby,” he mumbles. “Or was that Russian?”\nShe laughs a little. “Open your eyes, Foggy.”\nFoggy blearily obeys her. All the Avengers are crowded around Natasha, in various states of panic. The Hulk is a great green shadow, looming over each of them.\n“You didn’t all have to come,” he reproaches. “Was just three dudes.”\n“We wanted to,” Bucky growls menacingly. Foggy squints a little.\n“They’re not smears on the floor, right?”\n“Nope.” Tony lands next to Steve, who’s got his jaw clenched tight. “They just wish they were.”\n“Oh good.” Having his eyes open hurts. He tries closing them but that hurts too. He just can’t win. “Emergency contact #1 didn’t answer his phone then?”\n“No, but I imagine he heard Bruce knock down that wall and is on his way as fast as his horns can carry him.” Natasha gently tries to shift Foggy and he whimpers. “What hurts, Foggy?”\n“Everything a valid answer?” He coughs and his lips are wet. Gross.\n“Not particularly helpful.”\n“Bummer.”\n“We’ve got to get him out of here,” Sam says urgently. “Can-“\n“Shit.”\nFoggy hears it cut through the room and can’t help a little grin. His teeth are probably bloody. Maybe not a great idea. “Hey, buddy.”\nA red blur cuts his way quickly through the Avenger to kneel by Foggy. Matt takes Foggy’s face in his hands and Foggy can’t help a little hiss of pain.\n“Sorry,” Matt whispers. “Sorry, sorry, sorry, I’m so sorry, Foggy, I’m so sorry-“ Matt very gently leans his forehead against Foggy’s. The cool of the helmet is nice.\n“Quit ‘pologizing. S’not your fault.” Foggy kind of wants to reach up and put his hand on Matt’s cheek but also that sounds like it would kind of hurt.\nMatt doesn’t answer, just carefully presses his lips to Foggy’s. It’s the first time Foggy has ever been sad kissing Matt. He disapproves.\n“Gonna be okay, buddy. M’gonna pass out now, though, if that’s cool.”\nHe’s not conscious enough to know if it is cool or not.\n \nWhen Foggy wakes up, his body aches. Matt’s curled into his front like a tiny sweatpantted kitten, asleep. So it kind of balances out, he guesses.\nHe closes his eyes and tries to go back to sleep so as not to disturb the peace, but to no avail. Matt, who must have woken up to his heartbeat or something, stirs sleepily and mumbles “Foggy?”\n“Mm.”\nMatt straightens, reaches over to his nightstand, and hands Foggy a glass of water with a straw, holding the glass steady while Foggy drinks. When the entire glass is gone, Matt puts the glass back and lies back down facing Foggy.\n“I’m sorry.”\n“It’s not your fault. This isn’t a Daredevil thing. This is a Nelson &amp; Murdock thing.”\n“Partially my fault.”\nFoggy groans and trembling raises an arm. He bats at Matt with a hand that appears to be heavily bandaged. “M’supposed to be hitting you pretty hard,” he tells Matt. “When I have my strength back, I will give you a walloping like you would not believe.”\nMatt grins a little weakly. “Is that code for something?”\nFoggy groans again. “You can go back to apologizing now.” He looks around. “Why am I in your bed and not a hospital?”\n“My apartment was closer and, well.” He goes a little red. “I may have thrown a slight fit at moving you too far.”\nFoggy snorts. “Slight.”\n“Shut up.”\nFoggy looks back at his hand. It looks very well bandaged. “Claire?”\n“Claire.”\n“Hm.” Foggy looks back at Matt. “Where’d the Avengers go?”\n“Claire badgered them into leaving while I slept and she said she’d call them if there was any change.”\n“Mm, good, they should get some sleep.” Something occurs to Foggy. “Wait, they were here?”\n“Thor carried you.”\n“Back to your place?” Foggy frowns. “I thought you wanted to keep personal life and Daredevil separate. Aren’t you worried they’ll find out?”\nMatt shrugs as best he can lying down. “Well.”\n“Well what?”\n“It was you.”\nFoggy stares at Matt, whose lips are tight in the way they get when he’s feeling emotional.\nFoggy shuffles a little closer to Matt and presses his face into his shoulder.\n“Was going to tell Karen to tell you I love you, before those assholes beaned me,” he says through Matt’s sweatshirt. Matt stiffens, then relaxes.\n“Oh.”\n“Don’t have to say it back or anything. You’re all weird and Matt about feelings.” Foggy yawns. “Just wanted you to know.”\n“No. I.” Matt leans his head into Foggy’s a little. “I love you too.”\nFoggy smiles sleepily. “Good.”\n“Please don’t get kidnapped anymore.”\nHe yawns again. “Well, there go my plans for Saturday night.”\n“Don’t joke.”\n“I think these meds Claire gave me are super awesome.”\nMatt’s snort ruffles Foggy’s hair. “They are.”\n“M’taking another nap. You are also napping cause sleep is good.”\nFoggy can feel Matt’s smile as Matt puts his hand on the back of his neck. “Okay.”\n \nA few hours later, Foggy is upright in Matt’s living room and watching Law &amp; Order so he can yell at the judge to quit allowing things. Claire left half an hour ago, telling Foggy he would be fine if he stopped moving, no sex for a week, Franklin, keep drinking water, call if anything changes. Matt’s in his room changing the sheets on their bed to get rid of some of the blood on them. Karen’s sitting next to him on the couch watching with him.\n“If judges were this agreeable in real life, our jobs would be so much easier,” Foggy tells Karen. Karen pats the shoulder without bandages.\n“You bet, dear.”\nThere’s a knock on the door that sounds more like a bang.\n“Nelson!” Tony hollers. “Open up! We have alcohol and Ben &amp; Jerry’s.”\nFoggy looks at Karen soulfully. “Will you open the door, sweet Karen, as I am couchridden?”\nKaren rolls her eyes, but opens the door. The Avengers tumble in.\n“Foggy!” Thor looks pleased. “You are conscious!”\n“I am. This is true.”\nClint flops on the floor across from the couch. “So this is Daredevil’s place, huh? Pretty sparse. Kind of like a prison.”\n“Which is where I’ll be sending you if get beat up again,” Bucky says flatly.\nKaren looks at Foggy. “The threats equal love thing?”\n“Mm-hm.”\n“Oh good.” Karen stretches out. “I didn’t want to have to kick his ass.”\n“You couldn’t.”\nKaren cracks an eye at Bucky. “Try me, dude. See how that goes.”\nBucky edges away a little.\n“She’ll do it,” Matt says from where he’s leaning against the doorway. “She’s a very scary lady.”\nThe Avengers look all either startled or miffed.\n“The fuck you doing here, Murdock?” Tony asks. Bruce nods in quiet assent. Natasha looks like she might be starting to put things together.\n“I’m very familiar with the layout of the apartment. I wanted to be sure I was before I bought the place.” He sniffs. “Is that cookie dough ice cream?”\nKaren chucks him the carton and he catches it neatly, smiling satisfactorily. He sits next to Foggy, cracking open the pint.\n“You don’t even have a spoon, what are you going to-“ Matt promptly digs out a chunk of ice cream with his fingers. “Aw, dude, come on. Doesn’t food from your fingers taste worse cause you can taste everything on them from before?”\n“I washed them very thoroughly beforehand. Want some?”\n“I will not become that fucking awful couple that lets the other person feed them from their fingers.”\n“You are that fucking awful couple,” Karen mutters. “To resist it is useless, it is useless to resist it.”\n Everyone is staring at them.\n“You,” Tony says loudly. “Motherfuckers.”\n“I’m actually kind of impressed,” Natasha muses. “It’s very hard to keep secrets from me.”\n“YOU LET ME TELL THIS GUY TO HIS FACE THAT HE WAS GOING TO BEAT HIMSELF UP,” Clint yells. “YOU LIVE TO TORMENT ME.”\n“I am glad you are not attempting to steal Foggy away from his beloved,” Thor tells Matt. Foggy goes a little pink as Matt grins.\n“Thank you, Thor.”\n“You’re all assholes,” Sam says flatly. “Give me that beer.”\n“Seconded.” Bucky reaches forwards and grabs a beer.\n“I’m a little confused,” Steve puts in.\n“Join the club, Spangles. What the hell, Murdock?”\n“How does it work?” Bruce murmurs. “I’m curious.”\n“I can explain it later. Right now I’m very comfortable.”\n“I DREW YOU ASIDE AND TOLD HIM TO GO BEAT THE SHIT OUT OF YOU,” Clint bellows. “I TOLD YOU THAT JUST BECAUSE YOU WERE BLIND DIDN’T MEAN YOU’RE NOT AN ASSHOLE.”\n“Very true,” Foggy agrees. Matt pokes his cheek with a sticky finger that smells like vanilla.\n“That’s a very unkind way to refer to your beloved.”\n“Eat me, Murdock.” But Foggy’s still grinning at Matt, and Matt must know because he grins widely back.\n“OH CHRIST. VOCIFEROUS.”\n“For the love of God, Clint, shut up, some of us were beat up in an abandoned warehouse not too long ago.”"
}