{
    "id": "514231",
    "url": "https://archiveofourown.org/works/514231?view_full_work=true",
    "author": [
        "orphan_account"
    ],
    "title": "Say Something",
    "rating": "Mature",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "F/M",
        "M/M"
    ],
    "fandoms": [
        "Teen Wolf (TV)"
    ],
    "relationships": [
        "Derek Hale/Stiles Stilinski",
        "Allison Argent/Scott McCall"
    ],
    "characters": [
        "Derek Hale",
        "Stiles Stilinski",
        "Sheriff Stilinski",
        "Allison Argent",
        "Scott McCall",
        "Lydia Martin",
        "Jackson Whittemore",
        "Erica Reyes",
        "Chris Argent",
        "Peter Hale",
        "Boyd",
        "Isaac Lahey",
        "Danny Māhealani",
        "Alpha Pack - Character"
    ],
    "additional_tags": [
        "AU Post Season 2",
        "Stilinski Family",
        "Angst",
        "Fluff",
        "Insomnia",
        "Sleepovers"
    ],
    "language": "English",
    "series": "",
    "published": "2012-09-17",
    "completed": "2012-09-25",
    "words": "49,724",
    "chapters": "8/8",
    "comments": "786",
    "kudos": "17,318",
    "bookmarks": "5,199",
    "hits": "345,132",
    "summary": "<p>That first time Stiles decided it was probably wise to let sleeping werewolves lie.</p>",
    "notes": "<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>I watched <em>Teen Wolf<em> and I thought that Derek was grumpy and dark and gorgeous and that Stiles was lovely and sad and perfect (in an obviously imperfect way), but while I knew that the fandom put them together, I didn't see anything there. And then I went to read <em>Teen Wolf</em> fics and one of my favorite authors wrote Stiles/Derek and all of a sudden I saw that pairing everywhere. And then suddenly I was writing one myself, and it turned into this monstrosity. Which is about 45,000 words. Give or take a couple k. I tried to give these guys depth, and I hope you find that this isn't overly cliched (although I'm sure it is in many ways). I very much hope you enjoy!</em></em></p>\n<p> </p>\n<p> <em><br><em>As of 9/17 I have 4 chapters posted on FFN (also onrooftops) because I didn't get my AO3 invite until a few days after I started posting. But I will post one a day here until it's all uploaded. (Like a particularly heavy vitamin.) (With added benefit of some sex at the end.) (Don't act like that was a spoiler, this is </em><i>Teen Wolf</i>!) </em><br> </p>\n<p> <em><br><em>I'll post warnings on chapters they apply to, but if you see something that you think should be added, please let me know.</em></em><br> </p>\n<p> <em><br><em>Thank you so much for reading!</em></em><br></p>\n<p>There's a brief description of a panic attack below. I've never experienced one, so I am sorry if I got it wrong. (Also, if that's triggering for you, I just wanted to ensure that you weren't blindsided.) Thank you for reading!</p>\n<p>Just a quick warning: there's a description of Stiles's mom's death (from cancer) ahead.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">more notes</a>.)\n</p>\n<p>Posting this before work because I'm going away this weekend, meaning that (a) this is finally caught up with the one on ffn and (b) I won't be able to post Chapter 7 until Sunday. But thank you for reading and I hope you enjoyed! Happy Friday!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_8_endnotes\">notes</a>.)\n</p>\n<p>Thank you all so much for reading! I hope you enjoyed it - and if there was too much fluff at the end, I apologize. They were so angsty for so long, I thought a few sentences of sickening sweetness were in order.</p>",
    "text": "The world is wrong.\nThis isn’t new information; for Stiles, the world hasn’t been right since his mother died. There are spaces in his childhood—a whole, huge person—he can’t speak of without losing control of his voice. The changes started when he was little and his mom died, and then everything changed again when Scott was bitten, and then again with the Jackson-Kanima massacres, and things seem to still be changing and the world just keeps getting more and more wrong. Stiles often thinks that he would very much like to rewind time to when the world was right.\nBut despite all the wrong things that exist, all the shape-shifters and bloodthirsty creatures and murderers and fucking resurrection, Peter Hale’s fucking Jesus Christ moment, nothing that is both wrong and useful has turned up—there is no time travel, there are no superpowers for the geeky, wrong-footed, awkward kid, no cape for the Robin. This isn’t Harry Potter. Stiles won’t ever be able to fix everything; it will all continue to be wrong. And often he can’t sleep because he is the reason that Scott was bitten; he can’t sleep because this is the price he has forced his friend to pay for callous curiosity; he can’t sleep because of so much, there is so much that tangles in his mind and leaves him with his pillow pressed over his head, trying to suffocate all the wrongness out. It never leaves. It just burrows deeper. Someday he’s afraid it’ll spill from his mouth in blackened words, will wind insidious around his father and Scott’s mom and all the brilliant people who are not crazy the way he’s starting to think he is, the way the pack is.\nSome nights he stays up on his laptop, reading articles about this stupid world he’s uncovered. But they’re awful articles, always poorly written and often archaic. They make his head hurt even more. He used to occupy himself by dreaming about Lydia—fantasies that he thought might come true someday maybe—but since Jackson, since everything, that feels wrong, because maybe he still loves Lydia, but she loves a jackass of a werewolf who was a murderous lizard and if she lasted through all of that then it seems unfair for Stiles to create a her in his mind who would choose him. There’s enough wrongness in this world without him adding to it.\nAnd so insomnia takes him, and he gives in. He drinks coffee until early in the morning and has developed even more of a twitch and his speaking rate is up to some outrageous level and he is so tired, so tired. He has sand in his eyes and he wants to talk to someone about it, but he’s put his dad through enough and Scott is sad over Allison and there is still no one else, is there? These are the things Stiles realizes around four in the morning, the things that make him dig his blunt nails into his thighs to try and think of anything but what’s going through his head. Of anything but how alone he is.\nAll of this is more confusing when he’s not alone, though. Sometimes a shape will appear at his open window and launch itself onto his carpet; always very very late, or very very early; always louder than necessary; always Derek Hale, who hates Stiles.\nDerek hates Stiles, except on a few days, when he’s feeling vulnerable. Then Stiles becomes something like a fucking teddy bear to a big bad werewolf who’s too stubborn to admit he never actually grew up.\nThe first time it happened was three nights after Jackson kissed Lydia and the alpha pack captured Boyd and Erica, one night after they reappeared, physically unharmed but psychologically a little shaky.\nThat time, Derek fell into his bedroom and grumbled something about “Fucking betas, fucking second floors,” and blinked at Stiles in the odd glow from a Wikipedia page on his computer screen. Derek said, “Thought you’d be sleeping,” and Stiles covered his hysteria with his pillow, but Derek could still, of course, hear the wheezing laughter and the fast rate of his heartbeat.\nStiles finally dropped the pillow. “Good morning to you, too. Has someone died? Or was it meant to be my death—were you planning on murdering me in my sleep? I would have thought that you’d be more interested in the screaming and the struggling aspect of killing people, but then, sometimes people surprise me. Sorry if I messed up your plans by being awake. You can still have a go at me, if you want. I’m apparently very fun to attack. I make a good victim.”\nDerek rubbed a hand over his face, and Stiles noticed that his fingers were dark with dirt, his fingernails lined with it. “It’s raining. Or it was.”\n“Okay.” Stiles glanced at the window. The light from the house across the street was clear, unaffected by the alleged rain, but Derek did look as if he had been playing in mud, just a little. “It was raining. I still don’t get why you’re here.”\nAnd then Derek toed his shoes off, leaving them by the window, and shoved Stiles’s shoulder so the younger boy moved over in the bed. Derek crawled in beside Stiles, curled up on his side facing away from him, and fell asleep.\nThat first time Stiles decided it was probably wise to let sleeping werewolves lie.\nBut he does wonder if that theory applies when the werewolf has come to his room six times. Is there some rule for this? Is he allowed to shove Derek awake at some point and ask him why the fuck he’s using Stiles’s bed as a sort of safety zone? Because not only is this very awkward, especially considering that Stiles doesn’t sleep, and so he often finds himself watching Derek sleep, which is all shades of creepy, it also makes hanging out with the pack uncomfortable for Stiles, because Derek and he don’t talk about it. They don’t talk during it, and they don’t talk after it, and Stiles doesn’t understand it. He would be angrier about this, but he doesn’t think Derek understands either, if the way Derek looks in the morning is any indication—all vulnerable with his eyes hard, like they’re daring Stiles to say something, and his lower lip caught between his teeth. It is almost too much.\nThe seventh time it happens is a Monday and Derek is covered in blood. He doesn’t pause before crawling between Stiles’s sheets.\n“Jesus, Derek, what’d you do?”\n“It’s fine,” Derek says, pulling Stiles’s extra pillow beneath his head. “I’m all healed.”\n“Obviously.” Stiles reaches out and rubs some of the blood from Derek’s forearm. It comes of flaky, dried, and the skin beneath is hot and whole. But the blood is everywhere, dark and more brown than red and it must have hurt like hell when whatever happened happened. “But this is still—what’d you do?”\n“It’s nothing,” Derek mumbles. “Leave it.”\n“But.” Stiles rubs his thumb and index finger together, the blood flaking to the sheets covering Derek’s shoulder.\n“Leave it,” Derek demands, and Stiles sighs and slips from the bed to go and wash his hands. Not that it matters. Stiles will be covered in blood by the morning anyway. This should probably bother Stiles more than it does, but then, so should everything about this situation.\nHis father knocks at his door the next morning, calling, “Stiles? You’re meant to be at school in twenty minutes,” through the wood.\nStiles moans into his pillow—he finally drifted off for what feels like the first time in weeks around four, and three hours of sleep ought to be better than none, but he’s seriously revising that theory at the moment.\n“Stiles?” his dad says again, and the doorknob is turning, and there is a very manly leg tucked between Stiles’s, the angles of a very familiar ankle between his, and dried blood everywhere, and his father cannot see this.\n\"I’m up, I’m up!” Stiles shouts, frantically rolling over Derek and landing on the floor with a thump. “Don’t come in, I’m naked!” His voice has gone several octaves higher than it’s been since he hit puberty, his heart is pounding faster than it has since he drove his Jeep into a warehouse, and still Derek is asleep, mumbling and spreading further across the bed in an unconscious reaction to Stiles’s absence.\n“Okay,” his father draws the word out, and the door remains mercifully shut. “But if you’re not out in ten minutes I’m calling in reinforcements. You can’t be late today, your chemistry teacher gave me a call last week about your attendance, which is, evidently, ‘lackluster.’”\n“Yeah, don’t worry, I’ll make it.” Stiles had gone to bed in his clothes from the day before, and he tugs his shirt over his head and undoes his jeans without even glancing at the werewolf in his bed. There’re flakes of blood on both his shirt and his pants, although not as much as he’d expected there to be. He drops them on the floor to deal with later, and crosses to his drawers in his boxers.\nDerek makes a confused sound, and Stiles turns his head to stare at him over his bare shoulder. Derek is lying on his back, blinking at Stiles in the morning light. His eyes look hazy. Stiles thinks he hates him.\n“Don’t,” Stiles says, and makes a concentrated effort not to rush to get dressed. He doesn’t need to feel inadequate around him. Except that Derek is something like Poseidon and Stiles is something like a wave on an inland lake—no comparison, barely even the same species.\nNot even the same species, not really, Stiles reminds himself as he tugs a new pair of jeans over his day-old boxers. He feels rather gross about it, but there’s no way he’s stripping down entirely in front of Derek, and there’s also no way he’s making a concession and taking clean boxers to the bathroom.\n“Make sure my dad doesn’t see you when you leave.” Stiles grabs his bag from his desk chair and his computer from the floor by his side of the bed.\n“Obviously,” Derek rolls and presses his face into his pillow, “idiot.”\n“Or, actually, you could. Getting shot might do you some good,” Stiles mutters as he slips out of his room. He doesn’t hear Derek react, and then he’s reminded of the blood all over the werewolf, and wonders again what happened. He hopes he wasn’t shot; his comments might have been a bit inconsiderate, considering.\nNone of the wolves are at school that day. This is probably not a coincidence. It is also very lucky, as Stiles must smell more like Derek than he ever has, as usually he’s up in time to take a very long very hot shower involving about half a bar of soap before school, and usually he doesn’t wake up with Derek’s dried blood on him.\nHe sits with Lydia and Allison at lunch, and they’re both quiet. He finally asks, “Do either of you know what’s going on? Where is everyone?”\nLydia shakes her head. “Jackson didn’t come by last night. I haven’t seen him since school yesterday.” Stiles feels a strange sort of triumph unfurling in his gut, something that feels uncomfortable and victorious at the same time, something that runs along the lines of, my wolf found time to come to me, and the thought leaves him feeling nauseous because no, Derek is not his. That is wrong.\nAllison sighs, twists a handful of hair through her fingers, and grimaces. “My dad left around eleven last night and was just getting back when I left for school this morning, but he wouldn’t say anything. He only brought one gun, though, so I think he was just out patrolling. I am so sick of being on probation.”\n\"Would he have taken you along even if you weren’t? On a school night, and all?” Stiles asks, fishing his phone out of his pocket and ignoring Allison’s glare.\n“He trusts me,” she says, her words a scowl.\nStiles shrugs as he texts Scott: Yo, where are you all? Need us to do werewolf reconnaissance?\nScott replies within minutes: No, stay away. Boyd and Derek got into a fight last night over Peter. Boyd’s still recovering and Derek’s run off. No one’s even seen Peter in days. I’m going to look for him in a while, but it’s not pleasant around here.  \nBoyd had done that to Derek? Stiles wonders how much of the blood had been Derek’s, and how much had been Boyd’s. He hopes the majority was Derek’s—not for any morbid reason, he doesn’t want Derek hurt any more than he wants any of them injured, but the thought of being covered in Boyd’s dried blood is disturbing.\nHe looks up at Allison and Lydia, who are both staring at him, wearing identical wide-eyed expressions. “Drama,” he explains, “Boyd and Derek got into it over Peter.” Lydia shivers, so slight that Stiles wouldn’t have noticed if he hadn’t spent years studying Lydia’s every movement. He makes an apologetic face and continues, “So they’re all holed up together, licking wounds.”\nAllison grimaces. “Not a good image, Stiles.”\n“Accurate, though,” Stiles tells her, because it is. Except that Derek’s not involved in this communal wound-licking, and, wait. He pulls out his phone again and sends another text, You’re going to look for Derek? Or for Peter?\nPeter. Derek never leaves for long. Thank God. If Scott’s nose took him to Stiles’s bedroom, there wouldn’t be an ocean large enough to drown him and his embarrassment.\n“Everything all right?” Lydia asks, and how long has it been since he’s answered that question honestly?\n “Yeah,” he says, “everything’s fine.”\n:::\nDerek is gone when he gets home that evening. His clothes have been moved to the hamper, his bed has been made, and his window is, curiously, shut. Derek’s never cleaned for him before, although Stiles supposes he may have felt guilty about leaving blood everywhere. Stiles certainly would have, had he been possessed by a psychotic demon and driven to visit Derek’s bed, or wherever it is Derek sleeps. In the abandoned subway station, Stiles thinks, although it’s possible he’s still hiding out in his family’s burnt-out house some nights, a thought that leaves an acrid taste in Stiles’s mouth.\nIt isn’t until Stiles climbs into bed that night that he realizes that Derek didn’t just make his bed, he replaced the sheets with soft cotton ones, decorated with characters from Toy Story. Stiles laughs and laughs and laughs until he’s not sure whether the sudden tears are from happiness or a deep sort of sorrow that hangs on a childhood that never really had the chance to take off.\n:::\nTwo nights later there is a violent encounter with three alpha wolves, leaving them all a little threadbare. Stiles and Allison and Lydia had been visiting with the pack—just a quick visit, because it is rare that you see one of them without the others, and sometimes Stiles admits to missing Scott and Lydia wants to see Jackson and Allison likes to torture herself—and then there are three very crazy werewolves among them who do not belong, and everything’s a bit raw and loud and painful after that. \nStiles makes it out with bruises down his ribs and a few scratches on his face; his father will not be happy but he’ll survive it. Lydia has red scratches along the jut of her collarbone, and Allison is covered in blood, but most of it isn’t hers. None of them were bitten.\nThe wolves heal quickly, beautifully, the night full of howls turned to screams for seconds before they’re all standing normal and ordinary and bloody but not injured. Stiles envies them that, just briefly, and then Derek’s head twists and he’s off into the night, and Peter and Erica follow him, and Stiles is glad, grateful, that he can just go home. Can indulge his cowardice, because that’s what it is—Derek and Erica and Peter may still die tonight. Stiles hates the thought, the way it worms its way beneath his heartbeat, the way it moves with his pulse. This life, he thinks, as he turns towards the subway’s side exit, this life is so terrible sometimes.\n“Hey.” Scott grabs onto his wrist and Stiles pulls away, wincing. Never mind about his ribs being bruised. He’s going to be purple all over in the morning. “Sorry, sorry, just, would you mind giving me a ride?”\n“Yeah, sure.” Stiles digs in his pockets for his keys and the two of them are soon sitting in his Jeep, just like old times, except of course, it is not at all like old times, not in the least.\n“So, what should I tell my dad tonight? Got into a bar fight over who was going to win the football game?”\n“Probably not. There wasn’t a football game on tonight.” Scott is staring out the window, staring and staring as if he can see something more than just the road and the trees and the sky out there. Maybe he can.\n“Right.” Stiles scrubs one hand over his face. It comes away bloody. He wonders if Scott knows where Derek and Erica and Peter are. He wonders if he’ll know if they die.\n“Tell him you got into a fight with Jackson because he was being a dick. It’s almost the truth.”\n“Except remember how Jackson filed a restraining order against us? And maybe it’s defunct now but my dad sure as hell includes that on his list of Top Five Worst Things to Happen Ever.”\n“Right. Boyd or Isaac then?”\nStiles sighs. “Maybe I’ll just avoid him until I’m all better.”\nScott’s hands are in fists on his thighs. “Sorry,” he mutters.\n“Why? It’s not your fault.”\n“It sort of is, though. If I hadn’t—”\n“God, shut up, Scott. I was the one who dragged you out into the woods, remember? I should be the one drowning in a pool of guilt.”  I am the one, he thinks.\n“But you—”\n“Nope,” Stiles interrupts. “You don’t get to feel bad over this. It’s fine. I’ll be fine. My dad will just have to deal with this. Again.”\nHe pulls into Scott’s driveway. The light in his mother’s room flicks on, and Scott sighs, runs his hand through his hair. “You could stay with us for a few nights. Tell your dad we’re working on a project?”\nStiles considers it, but then he thinks about Derek climbing to his bedroom and him not being there, and for some reason that makes him feel guiltier than the whole rest of this mess, and so he shakes his head. “Thanks. It’ll take a lot longer than a few days for me to heal completely, anyway. My dad will still know something’s happened. Better get it over with.”\n“All right, if you’re sure.” Scott slides out of the Jeep and pats it on the hood as he walks up the drive to his house. Stiles mimics the gesture on the vehicle’s steering wheel as he backs into the street.\nHis father is sitting in the living room when he gets home, an untouched glass of whiskey on the coffee table and a stack of overstuffed file folders on the couch beside him. Stiles ducks his head as he passes to the stairs, hoping his dad won’t notice the blood on his face until he has a chance to clean the scratches a little.\n“Stiles,” his dad’s voice cuts this hope in half. Stiles turns, pivots on one foot, so he’s standing in the entranceway facing his father. His dad is up and off the couch in a heartbeat, standing in front of Stiles and pressing his hand to his face before Stiles can blink. “What the hell happened?”\n“It’s nothing,” Stiles says, possibly the lamest thing he could have thought of.\n“Stiles, you’ve been mauled. This looks like—this looks like an oversized cat or a—not a mountain lion, not, but Jesus. What did this to you?”\n“It was—” in hind sight, it probably would have been better to stay at Scott’s for a few days. At least the cuts would have been scabbed over by then. “It was Lydia’s mom’s cat. It’s a monster.”\n“Stiles. There is no way a house cat could do that to you.”\n“There’s a possibility it’s actually a wild cat that has been domesticated,” Stiles says. “Don’t go chasing them down for illegal pet ownership or whatever, they could totally pay to have the entire sheriff’s department reorganized, you know, plus, it’s normally really well behaved but tonight it was a little crazy, you know, probably with the full moon and everything—don’t animals get crazier at the full moon? It’s next week, did you know? Scott’s mom says the ER gets wild on the full moon.” Stiles trails off. His father shakes his head.\n“I don’t know,” he pinches the bridge of his nose, “I have no clue what to do with you. Jesus. Can you just, can you please stop lying to me?”\n“I’m—” Stiles begins, but his dad holds up a hand.\n“Honest to God, Stiles, if you say one more thing about cats or full moons or Lydia I will—I don’t know, but it will be terrible. Just go to your room, please. We’ll talk about this later.” Stiles lingers in the doorway for a moment. His dad turns his back and lifts the glass of whisky, downing it in one long swallow. Stiles wants everything to turn around.\nHe punches his wall when he reaches his bedroom. It doesn’t make him feel any better.\n:::\n\nDerek always shows up after confrontations, but he doesn’t show up that night. Stiles hates the way this leaves him feeling hollow and nervous, anxious in a way he hasn’t felt in a while. He picks at the cuts on his face all night, peeling the scabs away as they begin to form, and by morning he’s chewing on his bottom lip.\nHe gives in and texts Derek, Are you all right? even though he knows that Derek hates texting and sentiment. And Stiles, he reminds himself, Derek hates him, so the text is a mistake, but he sends it anyway.\nHe spends the whole day dodging questions about his face and the bruises that are visible along his collarbone. He avoids being near Allison and Lydia in case someone ties their injuries together, although most people probably already have, but that leaves him feeling anxious and uncomfortable with only wolves around him, and all of them pick up on his emotions. Erica is back, which seems to suggest that the second half of the fight ended all right the night before, but Stiles can’t bring himself to ask, because they’ll hear his heartbeat accelerate and will read too much into it, like always. There’s nothing there, there’s nothing there, only animosity and discomfort and an odd dependency that he doesn’t understand and so will not mention, but if he asks about Derek, and they hear his heart speed up, they’ll exchange glances about him and make assumptions and what if the assumptions get back to Derek and Stiles cannot bear this anymore.\nHe fidgets all through classes, and sits beside Scott at lunch trying to eat but feeling like doing anything but.\n“Dude,” Scott reaches out and stills his shaking hand near the end of the lunch period, “what is going on? Did your dad take it that badly?”\n“He didn’t take it well,” Stiles grasps onto the excuse like a lifeline. “I am officially grounded until I tell him what really attacked me last night.”\n“So you’re officially grounded until forever?” Scott clarifies, and Stiles nods. “That’s going to make all of this so much easier.”\n“I know,” Stiles shoves his plastic fork through the hollow center of a tube of macaroni. “School food sucks,” he mutters, and Scott exchanges a glance with Boyd that makes Stiles feel a little like an amusing puppy.\nHe’s about to comment on this when his phone vibrates, and he tugs it out, sliding his finger across the screen until the text message opens: Fine.\nHe closes the text as the werewolves lean in. “Who was that from?” Erica asks, craning to see Stiles’s cell phone screen.\n“No one,” Stiles says, as the phone buzzes again. He slips it in his pocket and pushes away from the table. “I’ll see you.”\nScott follows him. “Seriously, Stiles, who was that from? It calmed you down, like, immediately.”\n\"Scott,” Stiles begins, then shakes his head. “It’s really nothing. A family thing. It’s nothing.”\nAfter all the lies they’ve told over the last year, one would think he’d be better at it. “A family thing? Like, your dad? He’s the only family you ever mention.”\n\"Scott, leave it.” It occurs to Stiles that he sounds more like Derek than himself, and he wonders whether personality osmosis can happen if you share a bed with someone.\nHe opens Derek’s second text in the hall, well away from prying werewolves. Why? Derek had asked.\nBecause the last time he’d seen him he’d been chasing crazy alphas into the woods with his resurrected uncle and Erica, who is sometimes okay and other times scares Stiles shitless. Because Stiles’s insomnia misses a sleeping body next to him. Because the last time he slept over, Derek had closed the window before leaving, as if he hadn’t been planning on coming back. Because Stiles doesn’t understand a thing, and neither does Derek, but Stiles is starting to think he might want to understand something.\nHe texts Derek back, says, Thanks for the Toy Story sheets. They’re soft.\nDerek might read a lot into that. Stiles might want him to.\n:::\nScott and Lydia are at Stiles’s house when he gets home from school. \n“You know I’m grounded, right? Pretty sure that means no friends.” Stiles unlocks the door and holds it open for them anyway.\n“You’re acting really off, Stiles. We just want to make sure you’re okay.” Their own lives have been far from neat lately, so he knows that it’s nice of them to care enough to come by, but he also cannot handle being under constant scrutiny from every side.\n“I’m okay,” Stiles promises. “I am.” Or as okay as he knows how to be, which he guesses isn’t very. But then, he’s never turned into an animal, so he’s got something on almost everyone else in his life at the moment.\n“You’re sure?” Scott asks. Stiles glares. “Yeah, all right, sorry. I’ll leave you alone, if that’s what you want. I just really…I miss you. And I worry about you.”\n“Me too,” Lydia says, and Stiles wonders if she feels at all awkward. She shouldn’t, but he wonders. He thinks he would like it if she did; he’d like to know he was noticed for long enough to make a difference.\nHe kicks himself. They’re both noticing him now, noticing and caring; he’s too caught up in what’s happened to appreciate what’s happening, and it makes him ill. It makes him feel selfish and terrible and like the worst friend in the world. He forces a smile, and it feels fake but he hopes they accept it.\n“Sorry, guys. I’ve just been—you know.” They know parts of it, not all of it. But Stiles thinks they know enough to understand him.\nHe hears his father’s car in the driveway and Lydia and Scott exchange a glance.\n“Yeah, we know.” Lydia reaches out and squeezes his hand, and he doesn’t feel it the way he used to, to his bones. It just feels friendly, and it’s nice, and his heart is calm; Scott smiles at him.\n“Scott. Lydia. Has Stiles told you that he’s grounded?” Stiles’s father is in the doorway behind him, and the tension in his voice is almost painful to hear. He hates being in this role as much as Stiles hates putting him there.\n“Yes, Sheriff. We just stopped by to see if he was all right,” Lydia says, despite the glare Stiles shoots in her direction.\n“Why would he not be all right? Oh, you mean because he got his face slashed open by your family’s illegal wildcat, Lydia? Or that’s the story I heard, anyway. But you look unharmed.”\nScott grimaces at the repetition of Stiles’s admittedly terrible lie. Lydia reaches up and touches the scarf that hides her wounds from the night before, and Stiles can feel his father stiffen behind him. Clever enough to hide the evidence, but not wise enough to forget it. It’s a common thing, and Stiles’s father is used to seeing it at work. “Or were you injured last night, Lydia?”\n“No, no. My cat really just hates Stiles.” She smiles at his father, a wide lip-glossed grin that would have split Stiles’s heart in half six weeks ago. His father seems unconvinced.\n“It’s a little warm for a scarf, isn’t it?”\n“It’s fashionable,” Lydia says just as Scott’s head jerks toward the window. He glances at Stiles and his dad before coming around the table.\n“Sorry, sir, sorry Stiles, I’ve got to get going.”\n“Is Jackson,” Lydia begins, and then glances over Stiles’s shoulder at his father and trails off.\n“No, just the one. See you all.” Scott is out the door in a few seconds. Derek is around, he’s the only one who travels alone, the only one who can get Scott to come without smelling of blood. Stiles wonders if Derek was here for Scott, or if he came for Stiles. Stiles wonders if he’s going crazy.\nStiles’s dad steps further into the kitchen and leans against the table, palms down. Lydia smiles at him, then squeezes Stiles’s forearm, which is still a bit bruised, and says, “I should get going too. I’ll see you in school, Stiles. Sorry about Roberta, again.”\nNaming the made-up cat Roberta should be the worst of their problems, he thinks, smiling at Lydia and turning to face his father as she lets herself out the front door.\n“So it’s not just you who’s lying. How big is this, Stiles?”\nHow big? As big as history and Earth and possibly bigger, Stiles doesn’t know, really. He knows that his father is torn between being grateful that Stiles’s friends are in on it and concerned that they’ve dragged him into something harmful. But Stiles is the bad influence; Stiles is the corrupter.\n“Pretty big,” Stiles says, because lies have wound around this house so tightly he can’t breathe through them anymore. If they were good lies, maybe, but they’re all terrible. They’re all lies made to conceal something so unbelievable that everything becomes truth in comparison. Aliens may be more conceivable than werewolves. The CIA would be more understandable than the Argents.\n“How big, exactly, Stiles?”\nStiles is struck by a wild urge to laugh, but he bites his lip and stuffs his hands in his pockets so his dad can’t see the way he’s digging his nails into his palms. “I don’t know. I just know it’s big.”\nThis is all he can give him. His dad seems to sense that. He runs one hand through his hair and pinches the bridge of his nose with the other. “Where’d Scott run off to? That was sudden.”\nFeeling immensely bitter, Stiles says, “His boyfriend needed him.” His father’s eyes snap open wide. “Oh, God, Dad. I was just kidding. Scott doesn’t have a boyfriend, he’s not—”\n“Who’d he go see, then? And how’d he know he was there?”\n“Probably just remembered he had to meet with someone.”\n“Which someone?”\nStiles shrugs, regretting the awkward “boyfriend” slip. “I actually don’t know. Scott’s social calendar is getting more and more complicated. He could be meeting with a teacher or with one of his many many friends, you know, or he could have just had an appointment with the dentist—very important to keep your teeth clean.”\n“Thanks for the pointer.” His father shakes his head, shrugs out of his jacket, says, “You’re still grounded,” and opens the fridge to get a pile of takeout containers.\nStiles had expected nothing less.\nHe hears nothing from anyone for five days, aside from conversations at school, and even though he leaves his window open he hasn’t seen Derek since the night of the fight. Not even in passing, not even lurking outside of the school waiting for the betas. Not at all.\nIf Derek stops sleeping in his bedroom, which seems possible, then Stiles is fairly certain he has lost him as a friend. They barely speak, except when necessitated by Scott or one of the others, and their only actual connection comes from the fact that Derek chose to share sleeping space with Stiles (well, chose to sleep in Stiles’s living space). The strangeness of that arrangement is acceptable, if it means that they have something holding them together. Even if that something is secret and unmentioned and results in Derek leaving blood everywhere.\nHe hates how he’s unsure of this. It was never anything permanent, but he worries every night he doesn’t see Derek. He wonders about him when Scott mentions their meetings; he wants to know what is going on in Derek’s head. He wants to know why he feels as if they’re capable of having something—an undefined something—when so far all they’ve had is nothing, really. If he’s honest, nothing at all.\nAnd all of this is maudlin and stupid and he stuffs his head under his pillow in an effort to block it out, but the last time a head was under that pillow it was Derek’s, and so that’s wrong.\nThe dumb Toy Story sheets keep reminding him of Derek, too, and how the last thing he said to him was a text about how soft the sheets were, and that’s truly damnable, it is. But what’s also damnable is Derek sleeping in his bed and he seemed perfectly content with that arrangement, so what Stiles is is really, outrageously, devastatingly confused.\nIt doesn’t get any better, either, because the next time he sees Derek the whole pack is there, and Stiles feels off already because he’s snuck out of his house to be there, and lying to his dad is necessary but he hates it, and Derek looks at him the way he always does—angry and almost silent and very unsure. Stiles may be the only one who can see how unsure he is, although the others may be able to smell it, because he’s seen Derek’s face when he’s asleep, and when Derek’s asleep his eyebrows don’t threaten and his expression is peaceful and his mouth sometimes falls open. He is a different person when asleep, Stiles swears he is.\nBut now, surrounded by werewolves and Derek, is the worst possible time to ruminate on how Derek looks when he’s asleep. Scott is already raising an eyebrow at him, clearly wondering what he’s thinking about that’s got his heartbeat so slow. Because Derek Hale asleep is not an arousing sight. Derek Hale every other time of day and night is an arousing sight, but Derek Hale asleep is the most calming thing Stiles can think of. Derek asleep makes Stiles feel as if maybe he could calm down enough to sleep again, someday.\nAnd yeah, Scott is really staring now, and the others are starting to too; Stiles sees Boyd exchange a glance with Erica, who passes it on to Isaac via a nudge. Stiles is going to die of their scrutiny, one of these days.\nDerek shoots him a sharp, dark look, and Stiles leans against one of the pillars, arms crossed. He meets Derek’s gaze in what for the others would be a challenge; for Stiles it’s little more than a joke.\n“So, as fascinating as Mr. Stilinski’s heart rate undoubtedly is,” Peter sways out of the shadows and Derek jerks his head to look at him, “we have alphas to worry about. There’s a new member of their pack, and she seems like a disaster. We’ll need to be on guard.”\n“Aren’t we always?” Boyd snorts, and Erica places a hand on his shoulder. Stiles would have interpreted it as a calming gesture, except that he sees the way her nails dig into the white of Boyd’s t-shirt.\nScott scowls. “Why do they keep attracting new members? What do they want?”\n“Something nefarious, no doubt,” Stiles puts in. Jackson rolls his eyes at the floor. “They probably want to turn everyone in town into a werewolf, create a little wolfy enclave up here. Obviously we—this pack, I mean—would need to protect the members of the town from unsolicited bites, and then we—the pack—would become heroes. Or die.” He cocks his head. “Probably die.”\n“Is that possible?” Lydia asks. “Not the dying, obviously that is, I mean the turning the whole town thing.”\n“It’s possible. It’s even probable.” Derek says, and Peter nods his agreement. Stiles swallows, feeling ill. He hadn’t been serious.\n“Probable?” Scott shakes his head. “Why would they want to do that?”\n“Puts them in an extreme position of power,” Isaac hypothesizes.\n“And also allows for the possibility of factions,” Stiles says. “Which doesn’t seem optimal.”\n“Alphas like these ones, they think in terms of power first. The possibility of fighting follows power, but it’s not something they’re going to worry about, until it happens. Whereas Derek’s thoughts and decisions are pack-based,” Jackson snorts and Lydia kicks him, “these wolves put themselves and their power before the pack—after all, every member of an alpha pack is capable of building its own army.”\n“Glorious. Sounds truly very fantastic. Fun, even.”\n“Not appreciated, Stiles,” Boyd says. Stiles shrugs.\n“Are we getting the Argents involved?” Scott asks, ignoring Stiles entirely.\nPeter hisses, but Derek says, his voice low and brooking no possibility for argument, “They should at least be warned. Stiles can do that.”\n“What? I think—nope, I know that there are people in this room who would much rather talk with Allison’s father. Who are much better qualified for talking to Allison’s father. I really think that—Lydia, for instance. Lydia would do a great job. Or we could just tell Allison and get her to tell him, that would work as well.”\n“You’ll do it, Stiles.”\nStiles really hates Derek. He hates him a lot. He doesn’t think he’s ever hated anyone more.\n“Tonight, Stilinski. And you’ll tell Chris Argent that he’s not to involve himself.”\nWell, he maybe hates Peter more. But they’re both Hales, so it’s the same thing, really.\n:::\nAllison’s father is significantly less terrifying than he was before his father arrived in town and took terrifying to an entirely new level. This still does not mean that Stiles approves of Chris Argent in any way, or that he is comfortable talking to Chris Argent. In fact, Stiles is very uncomfortable, standing in Allison’s entryway, waiting for her to bring her father down.\nStiles stuffs his shaking hands in his pockets. He hates the Hales, hates them.\n“Mr. Stilinski, how can I help you?”\nHunters. Always so unfailingly polite, until they’re sticking knives in you or trying to run you over with cars or shooting you with poisoned bullets. Assuming the you in question is Scott, not Stiles. Stiles just needs to be worried about being beaten up. Although, to be fair, Chris is not Gerard.\n“Apparently the alpha pack is trying to turn the whole town into wolves, which is not exactly good, right, and I guess my pack—I mean, you know, Derek’s pack—has a plan because Derek told me to warn you and Peter told me to tell you to stay out of it. Also and mostly incidentally, isn’t that saying about not shooting the messenger really, really nice?”\nAllison laughs from the stairs. Stiles could kill her.\nChris Argent’s mouth is a tense line, though. “That’s not…ideal. Is Peter willing to negotiate?”\n“You know, he doesn’t really seem like the negotiating type. I mean, he died and then came back to life so obviously he’s got a bit of a problem with letting things go. But maybe, if you talked to him or possibly if you talked to Derek, that might go over better.”\n“Derek’s no more a fan of the family than Peter is,” Chris points out, which is mostly true.\n“He doesn’t hate Allison as much.”\n“Allison will not be involved.” Chris’s voice is steady and cold. Stiles nods.\n“Right, still grounded. So am I, actually, I just came by to tell you. Got to get back to the prison cell. It was nice catching up, good to see you, and all that.”\nChris steps in front of the door before Stiles can open it. Stiles would gladly slit the throat of any Hale ever born to avoid what next comes out of his mouth. “Perhaps you could talk to Peter, get him to reconsider working with us. The ultimate goal, after all, is to eliminate the alpha pack. After that, we can return to our petty fights.”\n“You know, I’m pretty sure that you burning down their house and killing their family is a bit more than petty.” Right, hate the Argents before you hate the Hales. Stiles forgets it sometimes. Rule number something huge of being a member (of sorts) of Derek’s pack.\n“Kate paid.” Again, Chris’s voice allows no argument. “So, you’ll talk to Peter? That’s good news. Excellent. Thank you for coming by, Stiles.”\nAs soon as he’s out on the street, walking towards his house, he sends Allison a text. I detest your family.\nShe sends him back a smiley face.\n:::\nStiles’s house is dark when he arrives. He is careful to be quiet as he climbs up to his bedroom window, which is, as always, open. He falls through it gracelessly, lands on his ass on the carpet, and nearly bites his tongue in half to stifle a scream. Derek is there.\nBut he’s on the desk chair, sitting still in the dark. Does this mean he’s not staying? Does this mean he’s here to talk? Talking is overrated, really. Chris Argent has just proved that.\nOnce his heart has steadied, Stiles scoots back so he’s leaning against the wall beneath his window and reaches to tug off his shoes. Derek hasn’t moved.\n“I hate you,” Stiles says, but he can’t put enough venom in the words for them to sound at all convincing.\n“What did Argent say?” Stiles thinks Derek should care more about Stiles’s attempted animosity towards him, but then, Derek has never asked to be liked.\n“He wants me to negotiate with Peter. As if anyone negotiates with Peter.” Stiles hits his head back against the wall and then jerks back so he’s staring at Derek again. “Hang on, do you negotiate with Peter?”\n“Not often.”\n“Will you negotiate with Peter?” Stiles feels like a child as he needles, “For me?”\nDerek kicks out, the toe of his shoe hitting the tip of Stiles’s once-white socks. “No, not about the Argents.” He rubs a hand over his face; it’s all angry and wrinkly and Stiles should be used to the way this man broods. “That is non-negotiable.”\n“That’s what I said but Mr. Argent was adamant.”\nDerek shakes his head. “It’s your life, if you want to bring it up with my uncle. I’m not about to.” And Stiles knows there’s something deeper than the fire tying Derek with the Argents, or separating him from them, but he’s too exhausted, too tired, too oddly grateful to have this man in his bedroom, so he just hits his head against the wall again and swears.\n“Will you at least protect me if your uncle decides he wants to eat my liver?”\n“I doubt he’d be interested in your liver.”\n“Not really the point.” Derek won’t submit to the point, though, because the point is that Stiles really wants some affirmation, some sign that this connection between them isn’t entirely in his head, and Derek won’t give him that.\n“I’m not a big fan of my uncle attacking humans,” Derek does say, which is not what Stiles wants, but it’s more than he expects, so he nods and drops his chin to his knees.\n“What’s going on with Scott and Allison?” Derek asks after a long period of silence that feels tense but not terribly uncomfortable.\n“Ask Scott.” There are areas of the pack that Stiles will not approach, and there are games he refuses to play. Acting as an informant against Scott is one thing that he resists at all costs. Derek could say anything, do anything, to Stiles. Derek could beg him, could say please sweetly, if it were in his nature—Stiles will never answer a question about Scott. Not unless Scott is in actual, real, true, dire danger.\n“He won’t talk to me about it.”\n“Neither will I,” Stiles points out.\nDerek looks at him, dark eyes difficult to read. “And you’re no easier to break than he is?”\nThe question bothers Stiles. He presses his fingertips against the floor to either side of him. If he were a werewolf he’d have dug nails through to the ceiling beneath them. “Scott is worryingly easy to break.”\n“You’re not?” Derek says.\nNo, no, no. Stiles has his weak points, but he knows them. He barricades against them. He has mental barbed wire around the memory of his mother, around his father’s disappointment, around the thought of Lydia bleeding out on the field, around Peter Hale’s teeth on his wrist, around Scott howling at the moon, Scott plotting, Scott being alone, around rejection after rejection after fucking rejection, around sleepless nights and an adult werewolf who drools on his pillow. Stiles has sadness and he has dark holes and he is aware that he can cave, cave in a big way, but he is also aware that he is stronger than the others because he understands how weak he is, and he maybe overcompensates for that weakness and he admits that the way he’s living isn’t healthy but healthy people don’t have feelings like Stiles does, healthy people aren’t strong the way Stiles is.\n“Gerard punched me in the face and I responded by driving into a warehouse.” Stiles’s voice is a little cold.\n“Right.” Derek rubs his hand over his forehead, cupping his fingers over his nose so he’s breathing into his palm, and then sighs, a long sound that makes Stiles feel a little guilty. But he shouldn’t, because Derek and he may not know each other very well, but Derek knows him enough to know that he is not a child. He has proven himself over and over again, and Derek needs to understand that.\n“Look.” Stiles tilts his head so he’s looking at Derek, so the werewolf is forced to meet his gaze or seem a coward. “You need to understand that I am in this because I dragged my best friend out into the woods and he got bit by an alpha, and so everything that happened after is partially my fault, a little.” Derek is about to open his mouth, which is weird, because he has so little to say on a normal day that him interrupting Stiles seems out of place. Stiles talks over him, which is the way he works. “I care about Scott, but that goes without saying. I also care about the pack, in a weird way, and I think the Argents are sort of fucked up, even though Chris has proven that he’s got a conscience, and I know, now, I know almost everything, and so I couldn’t abandon all of you and all of this if I wanted to. So, Derek, you need to trust me, but you also need to understand that I am invested in the pack but I belong to no one. I make my own decisions, I am stronger than I look, and I am very important.”\n“Of course you’re important,” Derek says, like it’s the most truthful thing he’s ever said.\n“Honestly? That’s what you got out of that?” Stiles asks, able to override the pounding of his heart with his words. Derek can hear his heart, anyway, can smell the anticipatory anxiety his words have caused. Derek understands what’s going on beneath the surface, so Stiles keeps the surface as calm as possible. “I think it’s a bit more significant that I am not yours, or Peter’s, or Scott’s.”\n“But you act like you belong to Scott,” Derek points out, perhaps validly, maybe, except that Stiles is often the one who runs Scott’s show. And some days, lately, Stiles has smelled at least a little of Derek. And he has nightmares where he cannot save his father, lucid dreams where he did not save his mother. He belongs to no one, he thinks, because in some way he belongs to almost everyone. Which is dangerous and bad because Stiles’s allegiances could lead to him being torn in so many directions, but it also means that Stiles will think on a broader scale and so is extraordinarily dangerous in his own right. Stiles understands what has happened to him since Scott was bitten. Stiles is loyal, and if someone he loves is hurt, the world pays.\nStiles doesn’t say all of this to Derek. He’s been more than honest with him tonight. “Maybe Scott belongs to me,” he says, and Derek’s hands have formed fists on his knees. Territorial asshole, Stiles thinks, but even in his head the words sound more fond than bitter.\nHe pushes himself to his feet and crosses the room to his closet. Derek hasn’t moved, and Stiles turns to look at him as he exchanges his plaid shirt for a soft holey t-shirt that he’s had since eighth grade.\n“Are you staying?” he asks. Derek’s eyes widen and his mouth tightens, but Stiles is through with avoiding acknowledging this. It’s ridiculous, really, that he’s slept in Stiles’s bed but neither of them has mentioned it. Stiles won’t talk about it around the pack, but if Derek wants to sleep here he needs to at least talk about it with Stiles.\nDerek grumbles something, and then stands up, sticking his hands deep in his pockets. “You don’t want me to,” he says, which is bullshit.\n“I honestly don’t mind.” And because he is an almost-seventeen-year-old boy and cannot resist he adds, “The sheets are soft.”\nDerek rolls his eyes and frowns. “You don’t sleep when I’m here.”\n“I did once.” And that was miraculous, he thinks but doesn’t say. “I don’t sleep often. Don’t I smell tired or something?”\n“Tired doesn’t have a scent.”\n“Really? I thought pretty much everything had a scent.”\nDerek chuckles, and the sound is weird and rough. Stiles has never heard it before. It’s a little mystifying how nice it is. “Certain things do. For others we need to rely on our other senses. For instance, I can tell you’re tired because of the bags under your eyes and the way you yawn at least once every half hour and the way you stretch, as if you think you can wake yourself up by making yourself bigger for a second.” The words have come in a rush and they confuse Stiles because there are so many of them, because Derek has studied him, at least a little. There’s a bit of a flush highlighting the tips of Derek’s ears, and Stiles thinks he’s embarrassed himself, letting go of that much information. It’s a little bit endearing.\n“Oh.” Stiles shrugs. “So in that way you’re just like everybody else, with the eye-bags and everything. Although I guess humans aren’t that precise about it. Anyway, I’d be tired even if you weren’t hanging around. Feel free to use my bed whenever, it’s good somebody can.” Derek’s eyebrows straighten out, and Stiles wonders if he’s imagining gratefulness in the softening of Derek’s mouth.\n“Okay.” Derek sounds resigned.\n“All right.”\nStiles turns opens his drawers and pulls a pair of pajama pants out, and then looks at the way Derek is awkwardly inching toward his bed, hesitating as he approaches it, as if he’s still unsure of his place. “Just take off your shoes and get in already, Jesus. It’s not a huge deal.” He’s lying and he supposes Derek knows he’s lying but he does take off his shoes and climb into the bed, and he smiles a little at the sight of Toy Story characters on the pillow and the sheets, and he says, his tone almost sardonic, almost pleased, “They are soft.”\nStiles hates Derek because Derek raises too many questions and answers exactly none.\n:::\nTwo days later he meets Peter Hale after school. He looks content and confident and Stiles would want to do something violent to him if said violence wouldn’t result in Stiles’s death. He still considers it before remembering that this man had been dead and isn’t anymore, so that sort of suggests he’s not someone to fuck with.\nThey’re in the woods by the old Hale house, and Stiles thinks that to die here would be a sort of poetic justice, but not one he’s eager to realize.\n\"You wanted to speak with me?” Peter says, and there’s a question mark on the end but he’s not giving any power away to Stiles, none at all.\n“Chris Argent asked me to.” Stiles hates the way that comes out, like he’s a messenger, a go-between, like his loyalties are not obviously and irrevocably with the wolves. Even this wolf, because for the time being this wolf is playing on the right side.\n“And you listened to him? You are stupider than you look. I didn’t think it was possible.”\n“Ha,” Stiles says, “I wasn’t eager to get a crossbow bolt in my leg, or whatever, so, yeah, I listened to him. Plus, he did help us with Jackson.”\n“And that makes him trustworthy?”\n“No one in this fucking mess is trustworthy. I mean, Jesus, look at me.” Peter looks, eyebrows raised. He seems unimpressed. “I’m working with you, aren’t I? Aren’t I? And I actually hate you. I hate you more than I’ve hated anyone since—I don’t even know, man. You almost bit me, you know, and it’s good that you let me choose, or whatever, good and weird and it scares me a lot that you let me choose, when you didn’t let Lydia choose, or Scott, when you killed your own niece—Christ, how fucked was that? You know Derek hates you for that. You know I hate you for that.”\n“You hate me for Lydia more. And Derek hates no one the way he hates himself.”\nStiles blinks because yes, of course Derek hates himself, but that’s not the point, none of this is the point, and he doesn’t want to understand the reasons behind all of this. He just wants to deliver Chris Argent’s message and get on his way.\n\"Do you know why Derek hates himself?” Peter asks, his voice distractingly sweet and soothing. Insidious, almost. Stiles should run.\n\"Because he’s related to you?” Stiles suggests. “The point is that Chris Argent wants to work with us to destroy the alpha pack. If you don’t want to, fine, whatever. I think it’s probably a good idea, but I’m not even a werewolf, so really, do what you want. You need to talk to Chris yourself, though, because I am done being the go-between.”\n“Derek is at fault for the fire.” Peter smiles that terrible smile then, the one that makes Stiles want to bury his face in the leaves so he never has to look at the man again. “Indirectly, of course, by being a naïve child and falling ‘in love’ with a hunter. But he still believes it is his fault; he doesn’t think Kate Argent would have gotten at us if it were not for his obsession with her.”\nWell. That makes an awful sort of sense. Stiles digs his nails into his palms and says, “That’s stupid. The fire was Kate Argent’s fault. Derek falling in love,” he hates the words but cannot bring himself to suggest air quotes because that would cheapen all of this even more, “with her means he’s got a heart, which is good. You’re just an insufferable bastard with a massive God complex and if you can’t see that then you really, really ought to have stayed dead.” He bites his lip. “Wasn’t it nice, wasn’t it peaceful?”\n“Being dead?” Peter sounds scornful. “It was horrible. I couldn’t do a thing until your girlfriend gave me a way out. I was completely inactive. I hate being inactive.”\nYes, of course, because he was once in a coma. Because he has to be at the center of things. Because he’s used to wielding massive amounts of power. Because the important things in the world begin with his skull and end with his toes.\n“You’re an idiot. I’m done talking with you and with Argent. Find yourself another mediator.”\n“Think Derek would do it?” Peter taunts as Stiles walks away. “If I told him he had to talk to his ex’s brother or I would kill you, do you think he would do it?”\nStiles keeps his back stiff and doesn’t respond. Of course he would do it, and the fact that Peter doesn’t know that shows that the man is just as crazy as he was before his resurrection. And he knows just as little about being alive.\n:::\nStiles tells Allison that he’s through acting as a go-between, and Allison tells her father. Boyd texts Scott and tells him to tell Stiles that he’d better be at the pack meeting that night. Stiles cuts the middle-man and texts Boyd that there’s no way in hell he’s showing up.\nWhy not? Boyd texts back.\nDon’t you care about us? Erica texts, and it’s dumb that he can see the faux pout she’d pull if she were in front of him.\nHe sends them a mass text, adding Isaac just in case, I’m through with Peter Hale and I refuse to be given more things to do. Besides, my dad is pissed at me because I got home late from school today and he has me on serious house-arrest.\nAnd then he taps his phone against his mouth and sends a second text, If anything really important comes up and you need me let me know though.\nHe receives three identical Okays. Sometimes he loves that there are people in this world aside from Scott McCall who understand him.\n:::\nHe hadn’t told anyone that he was meeting Peter, so when Derek climbs into his bedroom later that night, after the meeting, looking livid, Stiles knows why.\n“What if he had attacked you?” Derek growls.\nStiles is sitting on his bed, reading a book on mythological creatures Allison had lent him, and looks at Derek for only a minute before returning to his book. “You didn’t seem overly concerned, so I thought I was probably fine.”\n“Probably is not definitely.”\nStiles shrugs. “It didn’t go very well, but I’m still alive, so let’s call it a win, shall we?”\n“You’re avoiding the pack,” Derek says, “so let’s not.”\n“Not the pack, just the pack when it’s with Peter. It probably won’t last forever.”\n“Probably?” Derek repeats.\n“Probably is not definitely.” Stiles smirks at him.\n“I hate you,” Derek says, and Stiles thinks that yes, he probably does, but only as much as Stiles hates Derek, which is not much.\nStiles shrugs and Derek sits in the desk chair, pulling his shoes off while Stiles slides a crumpled gas receipt into the book to mark his spot. “How’d the meeting go? Not as much fun without me there, right?”\n“You don’t come to the meeting you don’t get the information.”\nStiles rolls his eyes. “I’ll just ask Scott, you know.”\n“Fine. You don’t come to the meeting, you don’t get the information from me.”\n“Are we attacking the alpha pack anytime soon?” Stiles prompts. Derek groans.\n“No, and if we were, you wouldn’t be involved.”\n“Didn’t we just have a talk about how you need to trust me?”\n“Don’t you know by now that you’re way too weak—physically—to be involved in hunts?”\n\"Nope.”\n\"Stiles, you’ve proved yourself valuable,” yes, good, thanks very much, Stiles wants to say, what a doll you are for noticing, “but you are still a human. And whatever else that means about you, you are not as strong as us. You don’t even have the abilities that Allison does.”\n“But I haven’t died yet.”\n“That ‘yet’ is not reassuring.”\n“Why do you care?” Stiles is pushing him, maybe to a place neither of them is ready to approach, but he refuses to be left outside of this. He refuses on so many levels.\n“Because your death would not be inconspicuous. Of all the other people who’ve died in this stupid, stupid fight, none has been as important as you. Because Chris Argent would go to your father as soon as he found out, and then this entire town would be at the center of even more of a shit show.”\n“So that’s it? Protect the pack?”\n“You are pack,” Derek growls. “I’m protecting you.”\n“If I am, then why can’t I be involved? I refuse to be your—your token human, or something dumb like that.”\n“Jesus Christ, Stiles, you’re not a token anything. We just don’t want to see you killed or hurt. Why is that so difficult to understand?”\nStiles shrugs, drops his book on the floor and stands. “Whatever, Derek. Will you move? I need my computer.”\nDerek moves to the window in a leap. “Do you want me to leave?”\nStiles considers it, sending Derek out to an undoubtedly sleepless night somewhere in the woods, or somewhere with the pack. He thinks about it for maybe ten seconds, and then he shakes his head. “No, it’s fine. You can stay. Whatever.”\nDerek nods, and he sits on the edge of Stiles’s bed. “Are you doing research?” he asks. Stiles is sure he still smells of anger and frustration and Derek’s effort to draw him out is admirable, if a bit stupid. When Stiles goes silent and smells like that, the wolves should know to leave him be.\n“No.”\n“Schoolwork, then?” Derek’s voice is hesitant.\n“Yes.”\n“Okay.” Derek stretches out on Stiles’s bed and shuts his eyes. He doesn’t fall asleep, though; Stiles can tell the difference in his breathing patterns, and it makes him crazy to have Derek behind him, listening to him type. Eventually he gives up and shuts his laptop, clicks off his desk lamp, and climbs over the wolf to get to his side of the bed. He curls with his back to Derek, shuts his eyes, and matches his breathing to Derek’s. His mind starts to get louder and louder, all these thoughts keeping him on the very edge of sanity, and Derek is rolling over behind him, reaches over his side and grabs his hand.\n“Just—just hold on, okay?”\nAnd Stiles does. He digs his nails into the skin of Derek’s hand, digs them in so deep he feels the spaces between Derek’s bones. He holds and squeezes as his mind spirals, loud with thoughts, memories flying like razors, and Derek sighs against the back of his neck, sighs as Stiles marks him with red half-moons. They breathe together, and sometime in the night Derek drifts off. Stiles falls asleep with his nails still in Derek’s skin, but wakes up with his hand empty and his back to Derek’s. Sometime in the night they separated and it scares Stiles how lonely that makes him feel.\nStiles runs into Chris Argent at the 7-Eleven after school. He would be moderately creeped out if it weren’t that Chris is clearly there for the same reason Stiles is—to get milk—and if Chris weren’t in line before Stiles, meaning that he can’t have been following him. \n“Mr. Stilinski,” Chris says, as if he is a polite adult and not someone who sometimes tries to kill teenagers. And, okay, maybe it’s not exactly fair to hold that against him, considering recent events, but Stiles is still very much smarting over his conversation with Peter, so he will hold anything he wants to against sir hunter Argent. \n“Mr. Argent.” Except he’s not willing to make a scene in a public place, especially since one of his father’s deputies has just stepped into line behind him. “How are you?” \n“Having some pest troubles,” Chris says. “Something seems to be getting in through my windows. I think it’s a rodent of some sort, but it may be something bigger.”\nFuck, Scott. “Oh? Well, you know, that’s what comes of living out here.”\n“Oh, I know.” Chris smiles at him, collects his milk from the counter by the register, and says, “Have a nice afternoon, Mr. Stilinski.” Stiles nods, his mouth dry.\nHe texts Scott as soon as he’s in his Jeep. If you’re sneaking into Allison’s house for any reason, you should probably stop.\nScott responds, I’m not.\n\nGood, okay, well her dad says they have a rodent problem, so I’m glad he wasn’t mistaken. Would suck to find out what you thought was a friendly little mouse was actually a fucking werewolf.\n\nScott doesn’t reply.\nStiles had been fairly confident that Scott and Allison would be able to keep their hands off of each other, considering all the damage that their relationship had caused the previous semester. And Stiles knows that it sucks for them. He doesn’t know—like, actually know know—how very much it sucks for them, because he’s never had the chance to miss someone like that, but he knows that it must. But he also knows that everything in the last semester had sucked for them, so honestly, sometimes you’ve got to take the better of two evils.\nHe considers going to Derek. He thinks about it for a minute. But he and Scott had promised to keep each other’s confidences a long time ago, a nonverbal promise that is all the more binding for their mutual understanding of it. And honestly, Stiles asks himself, what would Derek even do? Threaten and growl and tell Allison and Scott that the only times they’re allowed to see each other are during meetings and at school? Stiles doesn’t really see how that will help.\nHe keeps checking his phone all evening, hoping that Scott will man up and tell him so they can go about fixing it. Although Stiles’s plan currently involves apologizing to Mr. Argent, which is something that he can’t picture happening, not ever, so some more time for Stiles to plot is probably necessary.\nHe sits at the dinner table, pushing microwaved mac and cheese around on his plate and staring at his blank cell phone screen. His dad is at work, and Stiles has zero interest in calling one of the pack to eat with him, so he waits for Scott’s text and eats about half of his mac and cheese before dumping the rest down the drain and returning to his bedroom.\nDerek is already there, asleep on his bed, his face turned towards Stiles’s computer desk. It is probably a bad sign that he isn’t even surprised to see Derek anymore; he has spent more nights at Stiles’s than anywhere else in the past week.\nStiles is careful to be quiet, although Derek always sleeps like he’s dead when he’s there, so his effort is probably unnecessary. He sits at his computer and starts typing out plans to keep Chris Argent from killing Scott—something that he feels he has spent more than enough time attempting to accomplish over the past year—and tries to ignore the way Derek is snuffling in his sleep. He sounds like a puppy and it shouldn’t be at all adorable but it somehow is.\nDerek makes a very large snuffling noise and Stiles glances to look at him and catches sight of another form crouched in his open window. Scott sits there, toes balanced on the edge and fingers clutching the windowsill, eyes locked in astonishment on Derek’s sleeping form.\n“Jesus,” Scott says.\nStiles holds a finger to his lips and says, “Shhh.” He stands and nods towards his door. It takes Scott a moment to follow him, but he does. Stiles shuts the door carefully after him and leads Scott a little down the hallway. They face each other. Scott’s lips are still parted in shock.\n“What the fuck, Stiles?” he hisses, when he pulls himself together.\n“He’s asleep,” Stiles responds.\n“I can see that, but why the fuck is he sleeping here?” Scott’s hands take in the whole house, the whole of Stiles’s history, and Stiles feels it like an ache, the distance Derek and Scott and the wolves have dug between himself and his father and, even worse, between this Stiles and the Stiles his mother knew.\n“I refer to it as werewolf detoxing,” he says, speaking over the way his heart stutters under the reminder that his life is not what he’d always expected it to be.\n“You mean he’s been here a lot?” Scott grips the back of his neck. He looks like he’s panicking, which is odd, because this really doesn’t seem like that big of a deal to Stiles.\n“Sometimes. He crashes here sometimes.”\n“Crashes here? Your room stinks of him.” Scott leans in and inhales, nose close to Stiles’s. “Even you smell like him. I’ve been noticing lately, but we’re all around each other so much that I didn’t think too much of it.” Stiles is glad he cannot walk around and smell people on people, people on things. \n“He’s only here sometimes,” Stiles repeats, and it’s starting to taste like a lie. “He just needs a place to sleep, and I have a place to sleep. It’s not as if we’re cuddling and braiding each other’s hair or anything.”\n“But, Stiles, you don’t—you don’t even like him.”\n“He has issues,” Stiles admits, “but we all do, so I don’t see what right I have to judge.” He’s thinking of Peter Hale’s cold eyes while he laid Derek’s secrets bare. There are things Stiles understands very well; guilt is one of them. Scott stares at him, as if he can see the sadness of Stiles’s thoughts, so Stiles hurries, “I mean, I’ve been pining after Lydia for pretty much forever and I’d probably have a better shot with Danny than I do with her, which is to say no shot at all, and you and Allison cannot leave each other alone even though you’re putting everyone in danger, again, and Jackson is the biggest dick to ever exist—and I do not mean that in a complimentary way—so what does it matter if Derek is a bit of a bastard a lot of the time?”\n“So you do like him?” It sounds like an accusation.\n“I don’t know, Scott. He just sleeps here sometimes.”\n“You two don’t talk at all? He just comes in and sleeps in your bed and leaves? Like you’re running a hotel?”\n“I don’t think people enter hotels via windows. At least, not normal people.” Scott scowls. “We talk a little. Mostly about pack stuff. Mostly about how ‘weak’ and ‘human’ I am. We’re not best friends, or anything, Scott. He, honestly, he mostly just sleeps.”\n“But he doesn’t ever sleep.” Scott shakes his head. “I’ve seen him sleep maybe once, and then it was the lightest sleep—he kept waking up because Isaac was moving, like a dog dreaming—why would he sleep here?”\n“Maybe that’s the point, because he does sleep here. Like I said, werewolf detoxing.”\nScott scrubs a hand over his face. “It’s weird. Why wouldn’t you tell me?”\n“Well, it’s not really something that would come up in ordinary conversation.”\n“Stiles, we don’t have ordinary conversations. And we’re always honest.”\n“Really? So you honestly haven’t been sneaking into Allison’s bedroom?”\n“That’s not—” Scott begins, but he stops at the hard expression on Stiles’s face.\nStiles slides down the wall so he’s sitting on the floor, and Scott follows after a moment’s hesitation. “Look,” Stiles says, “I wish you and Allison could be together without putting everybody in danger. I wish you could. But this isn’t—but our truce with the Argents, with the hunters, is such a fragile thing. To put a strain on it, especially that strain, it’s tempting fate. And we need them, despite what Peter and Derek say. At the very least we need them not to fight us while we’re fighting the alpha pack. At the very best, they can fight them with us. And I know that that’s unlikely, but if you and Allison can’t keep your hands off each other, then we will be fighting a war on two fronts, and I don’t think we’re strong enough to handle that. So you and Allison, Scott, you really need to not. I don’t know how hard it is for you,” because Scott is looking as if Stiles is asking him to cut his body in half and that’s awful, Stiles hates being in this position, “I obviously have no idea, but it is for—fuck, it’s for the greater good, don’t you see?”\n“But she said,” Scott’s voice is terrible, raspy and heavy, “she said not to wait and I thought I could, I thought we could, and then we just decided, ‘fuck it,’ you know? Fuck it, because we’re all dying here, and we could at least be happy.”\nStiles bites down on his fist. Seeing Scott like this hurts, and knowing that he has to make it worse makes him hate himself. “Allison’s dad understands some things. He understands a lot more than he did, in the beginning. But he doesn’t understand loving a werewolf. He helped his own wife commit suicide—it’s their culture, their upbringing, their belief system. And it’s psychotic, it is, and Allison has miraculously escaped it, but you can’t expect her dad to let it all go. And maybe he has reasons other than what he’s told us,” maybe he knows about Kate and Derek, too, Stiles thinks, “but regardless, he is not going to lessen his hold on Allison, and you love her, Scott, and she loves you, and you’re happy together, but what would it do to her if her dad killed you?” He inhales, a shaky sound that is barely audible underneath the sound of Scott’s breathing. “It sucks to be the one left behind.”\nScott hasn’t looked away from him, and now his eyes are bright with tears. Stiles knows his are, as well, and Scott reaches for his hand and grabs it for a second, a moment of remembering Stiles’s mother and how she used to call them her little terrors.\nThey sit in silence for a long while longer, and Scott finally scrubs his hands over his cheeks. “You’re right, of course. Fuck. It’s just—but, okay. I’ll call Allison. We’ll stop.”\n“Are you going to go talk to Allison’s father?” Stiles asks, hating himself for voicing the question.\nScott shakes his head. “I can’t.” And of course Stiles won’t push that. But he will go himself.\nScott leaves through the front door, and he looks at Stiles, standing in the entryway, for a long time before shutting it behind him. He opens his mouth, closes it, opens it again. “Stiles,” he says.\n“Scott.”\n“Thank you. And…and about you and Derek, just don’t—expect anything.”\n“I know who Derek is,” Stiles says, and he doesn’t even think he’s lying. “And I never would.”\nScott looks at him miserably, says, “I’m really sorry,” and turns to walk down the driveway.\nStiles shakes his head and pulls out his cell phone. He texts Lydia, asks her to go see Allison at some point. Says, Scott drama. They’re dumb. And then he sends her a second text, And really sad. Lydia doesn’t respond, but he trusts her enough to know that she’ll be on the Allison breakdown red alert.\nDerek is awake when Stiles gets back to his bedroom. He’s sitting up, shoes on, looking as if he wants to get to the window but is keeping himself there on that bed for some reason even he is not sure of. Stiles doesn’t know how much of the conversation he heard; he doesn’t want to know.\n“Scott was here,” Derek says, and Stiles nods. “What’d he say?”\nStiles shrugs. “Just some Allison drama. It’s all taken care of.”\nDerek drops his head into his hands, runs his fingers through his short hair. Stiles hasn’t seen him look this frustrated since they were fighting the Kanima.\n“Derek,” Stiles begins, but can’t think of a way to make his face look any less thunderous. This is about trust, Stiles knows, about the fact that Scott still will not trust Derek, that Scott comes to Stiles, even when Derek is there, in the fucking room. And Stiles also knows that Derek doesn’t think he’s deserving of that trust, and so he’s more upset at himself than at anyone else, which is Derek’s status quo anyway.\n“It’s fine.” Derek shrugs and stands up. “Thanks for letting me nap. Did—did Scott say anything? About me being here?”\nStiles sighs. Nothing is fine, not ever, really. “He was a little surprised.”\nDerek narrows his eyes but doesn’t call Stiles on the lie. “All right. Well, I’ll see you around.” He’s at the window, and Stiles wants him to stop and also to go, because he can feel that things are about to get interminably complicated, and Derek and he don’t need that.\nBut he says, “Don’t go?” anyway, because he is a supreme idiot.\n“I need to go talk to Erica and Boyd and Isaac, and tell them that Scott is going to be unbearable again.”\n“Okay,” Stiles says, leaning back against his bedroom door. “Okay.”\n“I’ll see you,” Derek says. Stiles hates that he takes it as a promise.\n:::\nChris Argent lets Stiles into his house, looking a little more than exhausted. It’s eight in the morning, and Stiles is meant to be at school, but that means that Allison isn’t home, and therefore neither he nor Chris need to censor themselves for her sake. Not that much censoring has ever gone on between hunters and members of the pack, but Stiles likes to be cautious when dealing with them.\n“What is it, Stiles?” All the faux politeness that had been in Chris’s voice at the 7-Eleven the day before is gone. He sounds tired and sick of all of this, feelings that Stiles understands perfectly.\n“I just wanted to let you know that I looked into your rodent problem and it’s not something you need to worry about anymore.”\nChris scowls. “You think I’m not aware? Allison isn’t speaking to me again.” There are cracks in his armor today, cracks that Stiles has witnessed before, but has never had the leverage to break through. He thinks he might this morning, but he doesn’t know if he wants to.\n“Right, well, sorry about that. Afraid the loss of her mouse was a bit hard on her. But it isn’t my fault.”\n“Stop with the rodent analogies,” Chris hisses, and Stiles nods, fast. “Is there anything else you wanted?”\n“I don’t know if Peter talked to you,” Chris looks surprised, so Stiles continues, “but judging from the fact that you’re still alive, I guess he probably didn’t. He refuses to consider working with you.”\nChris sighs. “I figured as much. This is all going very badly, Stiles, you understand? It will not have a happy ending.”\nIt sounds as if he’s had a premonition, or something, but fortune telling is bullshit and Stiles just wants a mediocre ending, one that means the fighting’s paused and people have survived. “Horror stories often don’t,” he says.\nChris nods, then reaches out and fists Stiles’s t-shirt in his hand, draws him in so he’s staring up into Chris’s eyes. “If there’s anything you can do to sort this out, Stiles, I suggest you do it. An alliance between us would make everything work much better.” Stiles reaches up and untwists his shirt from the man’s hand. He steps back, tugging at the hem so the wrinkles smooth.\n“Peter Hale is not a fan of me. I have literally no power.”\n“Why are you here, then?” he continues before Stiles can explain himself, “Whatever else you say, it’s because you think you can fix things. I think you should try. If Peter Hale doesn’t approve, well, then, do you need him? I’m willing to work with the pack.”\nStiles bites the inside of his cheek. This is subterfuge and mutiny and all sorts of other things that Stiles is not comfortable with. But he is also not comfortable with allowing an alpha pack to tear his pack to pieces. So. “I’ll think about it.”\nChris nods. “I won’t kill Scott.”\nStiles scowls. It would be nice to live a life where death threats weren’t typical. He holds out his hand. “I’ll see you around, Chris.”\n“Mr. Stilinski.” Chris opens the door for him and gestures him out.\nStiles hesitates on the bottom step, turns and asks, “Did you know about Kate and Derek?”\nChris Argent blinks, eyes hazing momentarily with too many emotions for Stiles to work out. And then his gaze sharpens at Stiles, and he nods, shortly. “A little,” he says, and Stiles knows that all of their pasts are so much more twisted than anyone cares to admit. He leaves with his heart still pounding in panic.\n:::\nHe gets pulled over on the way to school. By his father.\nAnd okay, yes, he is two hours late. But he is on his way, which is something. Apparently not enough, if the way his dad is scowling at his window is any indication. But still.\n“Dad.” Stiles swallows. “Hi.”\n“Son.” And wow, Stiles hasn’t heard his dad fit that much anger and disappointment into one word since the terrible horrible Lydia thing.\n“I’m on my way, just got a late start this morning, you know! Up too late last night.”\n“That is unacceptable, Stiles.”\n“Well, my alarm is broken, and my cell battery died, and the sun wasn’t bright enough, so really it’s not exactly my fault. I mean, it sort of is, of course, but in other ways it sort of isn’t. Do you understand?”\n“Get out of the car.”\n“But, Dad. Now I’ll be even later.”\n“Out.”\nStiles takes his keys out of the ignition and gets out. His father holds out his hand, and Stiles stares at it for a moment, uncomprehending.\n“Your keys, Stiles.” Stiles drops them into his palm. “I’m going to drive you to school, I am going to get one of my deputies to pick up your Jeep and drop it off at home. You will take the bus to school from now until whenever I decide you’re trustworthy enough to have your keys back.” He sighs, rubbing the back of his neck. “And from the way things are looking, son, I’m thinking that will be a long time from now.”\nFuck everything. “But, Dad—”\n“No.” His dad nods him toward the police car behind them. “Get in. I need to make a call, I’ll join you in a minute.”\nThe ride to school is silent. Before he gets out of the car, his dad reaches over, squeezes his shoulder, and says, “You understand that I’m worried about you.”\nStiles nods. “Yeah, of course,” and his voice comes out too gruff. He pushes the door open and jumps from the car. He’s inside the school in moments, trying to swallow the wet guilt in his throat.\n:::\nStiles spends a lot of time thinking. He spends even more time planning. And none of it comes to anything. Three days into his actual, literal house arrest, and he is no closer to working out how to organize a mutiny without vaulting the wolves into a war against themselves as well as the alphas.\nHe is also trying very hard to ignore the way his dad is looking at him, like he’s missing something very important. Stiles cannot do this for much longer, but he still can’t tell his dad anything, and so he is on the verge of doing something stupid and pointless and destructive. And that is when he texts Derek.\nDerek hasn’t been over since Scott stopped by; Stiles denies the fact that he’s missing him, although he supposes he is. Mostly, Stiles wants someone to talk to who is not pining over a girlfriend he can’t see like Scott or plotting an insurrection like Chris Argent or about ready to rip everyone into pieces because of the full moon like Jackson or looking gorgeous and unattainable and like his past like Lydia. He’s got one option. Derek wants to be trusted and Stiles desperately wants to trust somebody. So he texts Derek. Are you coming over tonight?\nIt’s open-ended enough that Stiles doesn’t seem needy, although he feels like he is.\nThe text comes through ten minutes later. I was thinking about it. Do you want me not to? Which is an awkward way of asking to be rejected and confuses Stiles for a moment. Why would Stiles want him to stay away?\nNo, please do. And whatever, that looks needy. He needs to talk to him, and if that gets him to Stiles’s bedroom, then it does. Stiles is okay with that.\nDerek arrives at his window twenty minutes later. He perches there looking unsure until Stiles says, “You can come in, you know.”\nDerek hops down and sits on the edge of Stiles’s bed. Stiles twists in the desk chair to face him, bringing his knees up to his chin and clenching his hands so his knuckles turn white. Normally Derek makes himself at home quickly in Stiles’s room, but tonight he looks—not out of place, not exactly, but nearly so.\nDerek doesn’t say anything. Stiles chews on his lip and rubs his hand through his hair, and meets Derek’s curious gaze for a long-feeling minute before giving in.\n“Can I just talk to you?”\n“You usually do,” Derek says, and this, this is why no one trusts him. He makes it so damn difficult to.\n“I mean, like, seriously talk though. About real things.”\n“We talk about real things.”\n“Okay, Derek, okay.” Stiles sighs into his knees. “I am having trouble doing this.”\n“Doing what? Talking to me? You never have trouble talking.”\n“I do, sometimes, about real things. But that’s not what I meant. I meant that I’m having trouble doing this—living the way I am.”\nDerek drops his chin to his hands. His fingers are pressing into his jaw and he looks pained. “You want to leave the pack.”\nIt’s odd that that’s not a question. It should be a question, it should be disbelieving, but it’s not. Does Derek really not know him at all? “Are you crazy? Of course I didn’t want to leave the pack. I never could leave the pack.”\nDerek exhales, a relieved sound. “Well, what then?”\n“I want—my dad has me on house arrest, in case you hadn’t noticed. He’s taken away my car keys. He looks at me like he doesn’t know me and I’m starting to realize that he really doesn’t, and he totally doesn’t trust me. And my dad, whatever our problems, has always trusted me.”\nDerek nods. “So you want to tell him about us.”\n“I don’t know, Derek. I don’t really. I don’t at all. Did you see Scott’s mom’s face—no, you weren’t there, but the way she looked at him. God. And she’s better now but to see my dad look at me like that, look at Scott like that—and he’d be more disappointed to know that we were keeping these secrets from him and I am just so pissed that I have to keep lying to him.”\n“But we all have to tell lies. It’s how this works.”\n“I know that, but it doesn’t mean that I want to. This is bullshit, it really is. And then—” Stiles pauses to catch his breath, and looks at Derek, who is staring at him in consideration, “and then I went to see Chris Argent the other day.” Derek stiffens, his claws sliding from his fingertips. Stiles starts feeling sick for him. “Because I needed to tell him that he didn’t need to worry about Scott. But he asked me to consider the truce, again, without telling Peter.”\nDerek jerks his head quickly, a very fast denial. He doesn’t say anything, but he’s swallowing rapidly. Stiles thinks he’s trying to keep control. He tries to make himself look even smaller and softens his tone.\n“Look, I know that we don’t trust the Argents. I know we don’t like them. I know that you have a very very good reason to wish that they would all just go to hell. But right now our more imminent threat is the alpha pack, and Peter is refusing to see that. And I understand why,” Derek still looks as if he might explode, “I do, Derek, but it scares me that we might let the alpha pack take over town—even a part of a town—just to avoid working with the hunters.”\n“Chris Argent cannot be trusted.” Derek’s voice is low and growly and near-broken. Stiles doesn’t want to keep going, but he knows he has to.\n“You like Allison.” Derek jerks his head in a nod. “Why do you like Allison?”\n“She’s proved herself.”\n“She’s also betrayed us.”\nDerek growls, his lips curling back to reveal his elongated canines. Right, Stiles thinks, maybe not the best thing to remind him of. “She had her reasons. She came around when she realized they were wrong.”\n“They weren’t wrong, they were misinformed,” Stiles says before he can stop himself. “She has every right to hate us; we’ve destroyed her family. Just because her family lit—threw the first punch doesn’t mean she has to see it that way. But she does, because she has eyes and a conscience and also because she does love Scott. They can love, Derek.” Derek’s eyes are rimmed in red and Stiles knows he needs to turn away from that path, it’s a far too dangerous one. “But her dad has reasons to join us for now. And he has reasons not to betray us along the way, or at the end. And if he ends up thinking of us as some sort of tame pack, it’s not as if he’ll be right, and that’s better than seeing us as mad dogs that need to be put down. You all, I mean, and me as the man who acts like a wolf.”\nDerek stares at him. His eyes remain trained on Stiles’s face and he doesn’t move, but the red has receded from his irises and his claws are gone from his fingertips and his lips, when he parts them, reveal human-sized teeth. “The man who acts like a wolf,” Derek repeats, as if Stiles has said some odd and wonderful thing.\n“That’s me,” Stiles agrees.\n“And you want us to ally with the Argents.”\n“With Chris and his hunters, yes.”\n“Even though my uncle thinks it’s a terrible idea.”\n“Your uncle is the worst man I have ever met in my entire life.” Stiles digs his nails into the jeans covering his knees and adds, “You know all that hatred you feel for yourself?” Derek narrows his eyes at him, but he continues, “Most of that should be directed at your uncle.”\n“You don’t know that,” Derek growls, and the signs of his wolfishness are pushing at his human edges again.\n“Oh, Derek, I know it. He is a truly selfish person.”\n“So am I.” Derek’s hands are fists in his lap and Stiles knows that if they don’t get off this topic soon he’ll leave, jump through the window and run until he can’t feel a thing other than the pain of running. And that was not Stiles’s purpose in bringing him here.\nStiles shrugs. “Can I talk to the others about allying with Argent?”\nDerek takes a long time to respond, but he finally nods. “And about your dad,” he bites his lip, looking nervous. “If you need to tell him, you can.”\n“Thanks,” Stiles reaches out and touches Derek’s knee lightly, just a brush of his fingertips against the rough blue fabric. “I don’t think I will yet. But thank you, it means a lot that you wouldn’t mind.”\nDerek shrugs and then leans down to untie his shoes. Stiles turns back to his computer, tapping a finger against the keyboard as he listens to the sounds of Derek preparing for bed. In the silence that follows, he says, “Thanks for listening, Derek.”\nDerek grumbles something into his pillow, but the sound isn’t heavy with his usual anger.\n:::\nWhen he talks to them at lunch, Allison looks grateful, Lydia looks interested, and Jackson looks bored. When he tells Scott and Isaac during Stats, they exchange a look and nod, eyes narrowed as if they’re already on the hunt. Erica and Boyd whisper to each other for a few minutes, leaving Stiles standing looking like an idiot in the hallway, but they both agree that it’s probably not a bad idea to join up with Chris. All of this leaves Stiles feeling confident and also a little scared—if they’re all that willing to ally with the hunters, that means they’ve had very little luck fighting the alpha pack since he last attended a meeting.\nHe has developed an active hatred for the bus, and after talking to Erica and Boyd he’s so preoccupied with worrying over the progression of the alpha pack that he almost walks past his. Danny shouts to him as he passes it, through one of the narrow windows, “Hey, Stiles, are you walking home?”\nStiles whirls and hurries to the bus just as its doors are sliding shut. The driver scowls at him as she undoes the doors and lets him on, nearly catching his bag in them as they close again.\n“Thanks, Danny,” he says, as he collapses on the green plastic of the open spot beside him.\n“No worries, Stiles. Buses suck but walking’s worse.” Danny turns slightly so he’s facing Stiles. “So what did you do to get your ride taken away?”\n“Skipped a few classes. I guess my dad thought I’d stop getting away with it as much if I actually had to take the bus in. I don’t know if it’s working yet, but he’s pretty happy with having a thirteen year-old again.”\n“Harsh, man.”\nStiles nods. “I know, right? I thought with great age came responsibility and all that shit—don’t look at me like that, I know it’s actually power, but the two usually coincide—but apparently they don’t go together at all. Or my dad thinks they don’t.”\n“Well, at least you had freedom for a little while,” Danny points out, and Stiles nods.\n“You’re right, you’re right. Sorry for whining. Do you know you just have a very friendly face? It just makes it easy to tell you things. Which probably sucks for you, actually. Sorry.”\nDanny waves his hand. “It’s fine, Stiles, it’s okay. I actually have a question for you.”\n“Shoot.”\n“Do you know what’s going on with Jackson? He’s been acting weird this whole year but in the last month he’s gotten—not weirder—sort of better, I guess? But he won’t talk to me like he used to.” Danny examines his hands and then glances up at Stiles, who is silent. “And then he’s hanging out with you guys a lot more and it’s—I mean you’re fine and all, I like you, but Jackson never has.”\n“I’m well aware.” Stiles considers Danny. The bus pulls to a stop at the end of one road and a group of kids files off. As they start moving again, Stiles says, “You probably asked Jackson already, but I’d suggest that you keep doing it until he tells you.”\n“I can’t annoy him the way you do, Stiles.”\n“It’s an acquired talent, I must admit. But you can try.” The bus pulls up to Stiles’s stop.\n“Just tell me.” Danny reaches for Stiles’s arm as he stands to follow a few others to the exit. “Is he all right?”\n“Yeah, he’s good.”\n“Okay.” Danny lets Stiles go, and he leaps down the steps as the bus begins rolling. That bus driver may have it out for him. She may have reason to, he’s not sure if she’s the same one he clobbered with spitballs when he was in elementary school, but he has a sinking feeling she may be.\nHe waves goodbye to Danny as the bus continues down the hill, and then he looks both ways before crossing the street and ducking into the woods. He’s taking a shortcut to the old subway station. There’s a good chance his father might notice that he got home late, and there’s a good chance he might be assigned a deputy to follow him around, but Stiles needs to let Derek know what’s going on, and he knows that Peter Hale is off two hundred miles north this afternoon, arguing with a pack there about the treatment of alpha packs.\nArguing is the nice way of putting it. Intimidating is how Stiles sees it.\nDerek is alone in the improvised den when Stiles arrives. “What’re you doing here?”\n“I hear Peter’s out of town. I wanted to let you know what’s going on.” Stiles picks some twigs from the laces of his sneakers—walking through the woods may be faster, but it’s a little bit messy—and approaches where Derek’s sitting on the edge of a ratty couch one of the wolves had found on the side of the road.\n“What’s going on, then?” Derek asks. Stiles cocks his head at him. There’s something odd between them, something that wasn’t there this morning when Stiles left his bedroom, having slept a few fitful hours beside Derek.\n“Is everything okay?” Stiles perches on the edge of the stained table and leans forward, as if he can tell what’s bothering Derek from his scent, the way the wolves do.\n“Everything’s fine. What’d the others say about Argent? And I hope you weren’t obvious about it.”\n\"I am never obvious.” Stiles scowls. “Unlike you, you are obviously not okay. However, if you don’t want to talk about it, fine. Fine, fine, fine. The pack is all on board with the Argent alliance thing. Who would you like to be your mediators?”\n\"You and Isaac.”\nStiles opens his mouth. Shuts it. Opens it again. “You’re kidding, right? I am currently grounded. If my dad finds out I didn’t come home from school today, I will have a permanent tail in the form of a cop. The chances of me being able to act as a go-between for you and Chris Argent are pretty much nil. And what good would I do? You know that everyone hates me.”\nDerek sighs. “No one hates you. Most people think you tell the truth because you talk so much, though. You’re a good choice, because you’re disarming. And Isaac is trustworthy. So it’s the two of you or it doesn’t happen, because I am still not comfortable with this.”\n“Fine,” Stiles snarls. “If it ends up driving me and my dad further apart, though…things will change.”\n“Fine,” Derek agrees. He raises his eyebrows at Stiles. “Anything else?”\n“Are you sure—did something happen this morning, Derek?”\n“Everything’s fine,” Derek repeats.\nStiles wonders if he will ever tell the truth. He knows he shouldn’t hold his breath, but something in him wants to.\nIsaac is waiting for Stiles when he arrives back at his house, the wolf’s fingers drumming against the steering wheel of a beat-up old Honda. “Derek texted me,” he explains, “said we’re acting as mediators between the pack and the hunters.”\n“He didn’t waste any time,” Stiles leans against the driver’s side door. “Does he want us to go talk to Chris right now?”\n\"I think that’s mostly up to us? But probably.”\n“Fine.” Stiles glances at his empty house, hopes that his father stays late at work, which would be typical and expected, except for all the recent trust issues. He crosses to the passenger’s side of Isaac’s car and gets in. “Let’s make this fast, though.”\n“I don’t want to be around him any more than you do,” Isaac points out as he reverses out of the driveway. And yeah, Stiles thinks, probably true, especially as Isaac fulfills the role of the Argents’ main prey perfectly.\nStiles rings the doorbell. Isaac stands behind him, and if Stiles were a werewolf he’s sure he would smell the anxiety on Isaac’s skin, in his exhales. As it is, Isaac is shaking pretty badly, and Stiles thinks he should probably sit Derek down and have a chat about sending wolves into places they’re terrified of. Isaac stills when Allison opens the door.\n“Hey, Isaac. Stiles.” Her tone is neutral, but she raises her eyebrows at Stiles and he shrugs in response.\n“We’re here to see your dad,” he tells her.\nShe waves. “Wait here, you don’t want to come in right now.”\n“Or ever,” Isaac mutters behind him, and Stiles attempts a comforting look over his shoulder at the wolf.\n“Mr. Stilinski. Mr. Lahey? How can I help you?” Chris Argent pulls the door shut behind him and crowds Stiles and Isaac so they inch off of the landing to the steps below it\n“Derek has agreed. Isaac and I are your contacts; we’ll keep you informed, and you will keep us informed. You are allowed to call us, but none of the others. Likewise, we will talk to you, but ignore the rest of your hunters. We hope that’s agreeable.”\n“If it’s not?” Chris questions, although he doesn’t look as if his unsatisfied with their plan.\n“Then we will continue as we were.”\n Chris looks from Stiles to Isaac. He nods and holds out his hand. “All right, then.”\n Stiles shakes it. Isaac does, too, although he looks as if he’d rather touch a dead skunk.\n “We’ll be in touch,” Stiles says, following Isaac to his car.\n “Of course you will, Mr. Stilinski.” Chris watches as they leave.\n Stiles feels unsettled. “I don’t like Peter,” he tells Isaac, “but at least with him we’re fairly certain he’s on our side.” He thinks about the way Peter was so gleeful with Derek’s secret. “For now,” he amends.\n\"You pushed Derek into this, didn’t you?” Isaac turns down his street.\n\"Yeah, because the wellbeing of the town is worth more than the autonomy of the pack. The people here don’t know what’s going on; it wouldn’t be right for them to get into the middle of a war between supernatural creatures.”\n“They’ll still be in the middle of it.\" Isaac turns into Stiles’s driveway, which is empty aside from his poor neglected Jeep.\n“But at least we’re doing everything we can to protect them. Chris doesn’t want to be found out, either. His whole life has been geared toward killing werewolves in order to protect people. And maybe the protecting bit has sort of fallen away, especially for his family, but he’s at least aware of it. So it makes sense to ally with him and his hunters, but that doesn’t mean that I have to like it. And that definitely doesn’t mean that we have to trust them.”\n“Good. Because if you had suggested that we trust Chris Argent, you would have had a second mutiny on your hands, I think.”\n“God, never,” Stiles promises. Isaac smiles at him. It’s a hesitant smile, but it’s there, and it feels to Stiles as if this whole thing is coming together in a way that doesn’t work perfectly, but at least works. “I should get inside before my dad gets home. I’ll see you at the next meeting, Isaac.”\n“Sure.” Isaac waits until Stiles is inside the house to leave. It’s a weird thing, to have Isaac Lahey care about him. This pack thing is different, but it’s nice to be a part of something.\nStiles eats a shatteringly silent dinner with his father that night and locks the door to his bedroom after him, half-expecting Derek to stop by. He doesn’t, but he does send a text, asking how the meeting with Argent went. Stiles is fairly certain that Isaac has already filled him in on the details, so he just shoots back, Fine, and assumes that the unnecessary question is Derek’s way of telling Stiles that he won’t be climbing through his window, but that he’s all right.\nAnd it’s nice, that this thing is established enough that they’re communicating about it, Nice that they may have reached a pattern. Nice and weird, but more nice.\n:::\nEveryone stares at him when Stiles enters the subway station for the pack meeting two nights later. He’s just snuck out of his bedroom window and tramped through the woods in the dark, so he must look a bit messy, but he thinks it’s something else that makes the whole pack watch him as he sits on a metal folding chair beside Scott.\nPeter approaches from behind him and runs a thin hand over his hair, saying, “Welcome back to the fold,” with a smirk. Stiles shivers.\nPeter plants himself in the center of the group and begins talking about the alpha pack and how utterly fucked they are; or that’s how Stiles interprets it. The others seem to be attempting optimism, which is ridiculously shortsighted, in Stiles’s opinion.\nEveryone begins talking over each other, and Stiles leans his chin on his hand, trying to listen to what the others are saying. He thinks he hears something valuable in Scott’s muttered words, and turns to him. “What? You think we should what?”\n“Hush,” Derek growls, as Erica opens her mouth.\nScott speaks into the sudden silence. “I think we know as much about the pack as we’re going to. Anything else probably won’t help us. We need to focus more on defense.”\n“What do you mean?” Boyd asks. All the wolves are leaning in, clearly interested, and even Lydia has stopped smoothing her hair to look at Scott.\nScott glances at Stiles. “Like, make a circle around town, or whatever, try to prevent them from getting in. And when they do, which they will, we attack them.”\nStiles nods. “We need to decide on a boundary line,” he expands on Scott’s idea, “and watch where they cross it. When they cross, we fight them, but only then. We’ll need to be broken into groups, you know, so everyone doesn’t attack them and leave the rest of the town unprotected.”\n“That might work,” Lydia says. “It’s not the most complicated plan in the world.”\n“But that’s probably good,” Boyd points out.\n“We’ll need to be in touch with each other every second,” Derek says.\n“That’s what cell phones are for.” Peter is smirking, tapping a finger against his lips. “I think it’s a good start, anyway.”\n“Okay. Peter and I will work out the logistics,” Derek says.\n“We’ll email you the plans,” Peter promises.\n“And you can reply with any changes,” Derek adds. Stiles nods, glad that he’s finally letting go of the pack a little.\nThey all stand up and move towards the exits. Isaac offers Stiles a ride, and Stiles accepts, even though Peter is watching them with his eyes narrowed. They may be being too conspicuous; after all, Isaac typically spends his nights in the subway station, so he shouldn’t be leaving.\nBut then Isaac claps Stiles on the shoulder in reassurance. “It’s really fine,” he says, as if Stiles has protested, “I’m spending the night at Boyd’s, but I need my car for school tomorrow. You’re right on my way.”\n“Great, thanks, then.” Stiles does not look back at Peter, but he imagines he can feel the disbelief emanating from the older werewolf from where he’s standing. He tries not to let it bother him.\nChris Argent looks less than thrilled to see them, but he doesn’t say anything negative about their plan. In fact, he bites his lip, looks at Isaac in consideration, then nods. “That might work,” he admits. “We were considering setting something like that up, but it reminded us too much of border wars. But with you all in on it, it might go better. It’s worth a shot, anyway.”\nStiles and Isaac stand up from the couch where Chris had waved them to sit when they first arrived, and they make their way to the door without saying anything else. Cordial meetings seem unnecessary.\nChris grabs Stiles’s wrist as he’s about to leave. “I can’t tell if Allison is okay,” he says, glancing at the stairs nervously. “She always had Kate or her—her mother to talk to, and…” he trails off, his voice with a slight shake to it.\n“She’s fine,” Stiles says. “Heartbroken, obviously, and pissed off, but she and Scott aren’t about to pull a Romeo and Juliet, or anything.”\n“Thank God,” Chris says, and it strikes Stiles how crazy it is that this man can be so in touch with the way the world works, but that he doesn’t know his daughter at all. It’s terrifying that he’d even be worried about her hurting herself over Scott. How does he deal, he wonders, and how are he and his father meant to deal?\n:::\nScott is in Stiles’s bedroom when he climbs back through the window after his and Isaac’s short discussion with Argent. Stiles barely reacts at the sight of his friend lying on his bed with a pillow on his face, although he realizes uncomfortably that it is Derek’s side of the bed, and therefore Derek’s pillow, which means that Scott is breathing in the alpha’s scent. Which probably means not-good things for Stiles.\n“Argent thought it was a good idea.”\nScott pushes the pillow off his face and says, “Don’t tell him it was mine, or he’ll change his mind.”\n“I’ll try to remember that.” Stiles moves to his closet and tugs his sweatshirt over his head, dropping it in the laundry basket and rummaging through the drawers for a clean t-shirt. “What do you need, Scott?” He can feel his friend’s gaze on him, and he would really like to get the awkwardness over with.\n“A wolf can’t stop by to see his best friend with no reason?” Scott manages to sound almost offended, which is impressive. Maybe being around the pack has improved his skill at lying. Not that Stiles is one to talk, considering Roberta the domesticated wildcat.\n“A wolf can,” Stiles says, “but it’s been happening more and more infrequently, as of late. Considering the best friend’s current groundage.”\n“More like considering the best friend’s current bedmate,” Scott grumbles. Stiles’s shoulders tense.\n“Look, Scott,” he tugs a pair of plaid pajama bottoms on and turns to face his friend. “We’ve talked about this. It’s not a big deal.”\nScott holds out the pillow like it’s evidence.\n“Yes, he uses that. So?”\n“You don’t get it.” Scott drops the pillow and knots his hands in front of him, like he’s praying to Stiles to understand. “You can’t smell it.”\n“I don’t need to. It smells like Derek.”\nJust then Derek leaps through the window and lands on the carpet. He glances from Scott to Stiles and says, “Evening,” as if they have all agreed on Stiles’s bedroom as an ordinary meeting place.\nScott growls and sighs and then pulls himself together. He hops off the bed. “Hey, Derek. Sorry, I was just leaving.”\n“You can stay,” Stiles says, although he’d really rather Scott didn’t.\n“No.” Scott shakes his head. “My mom knows I was at a meeting, she’ll be worried if I don’t get home soon. I’ll see you tomorrow, Stiles.” He passes Derek on his way to the window and Stiles sees Scott’s shoulder brush Derek’s, like a challenge.\nStiles’s cell phone buzzes as soon as Scott is out of the window. He opens the message and groans. Tomorrow, we are actually going to talk. And then another appears. He considers not opening it, and then his finger slips over the “open” key anyway. Be careful. Stiles tosses his phone onto his desk and feels satisfied as it crashes into the jar of pencils and pens sitting beside the lamp.\nDerek is watching him. He makes a curious noise in his throat, a low growl that comes out like a question.\n“Nothing,” Stiles answers. “It’s nothing.”\nDerek still doesn’t move. He’s standing near the window, his shoes still on, his hands in his pockets. He looks as unsure as Stiles has ever seen him.\n“What’s up?” Stiles asks. “Come in.”\nDerek removes his left hand from his pocket to rub the back of his neck. “Why do you let me stay?” He sounds frustrated and confused and his tone of voice makes Stiles’s heart quicken a little.\n“Haven’t we already been over this? I don’t really sleep and my bed needs sleeping in, so you’re welcome to it. It’s not that complicated, Derek.”\n“But.” Derek moves forward, so he’s in Stiles’s space. Stiles forces himself to stay still beside his desk. “There are other reasons too, aren’t there?”\n“Sometimes I am actually able to sleep when you’re here, which is weird.” Stiles bites his lip. Derek doesn’t look satisfied.\n“And?” He’s inching forward, his body angling toward Stiles like he can’t stay away. This slow approach is unusual for them. Stiles is used to Derek slamming him against things; this is gentler and odd.\n“I don’t hate you?” Stiles suggests. Derek grunts as if he’s hit him. “I don’t mean that in a bad way!” Stiles hurries. “I mean I really don’t hate you. Like, I think you’re a pretty cool cat. An okay character. I would even go so far as to call you my friend, if that’s good with you?”\n“That’s it?” Derek asks. His breath is hot on Stiles’s face and their closeness should be gross, but Stiles just wants him closer.\n“I mean, you’re like crazy attractive, too, so having you in here isn’t exactly an eyesore. And when I manage to sleep and actually wake up next to you—well, that’s not bad.”\nDerek growls. “And that’s it?”\nNo. There’s also the little thing about Derek’s horrible, horrible past, and the fact that maybe when he tries to sleep elsewhere he’s haunted by Kate Argent and the fire; and if he’s not, then he sometimes still stays in his burnt-out childhood home on long nights and Stiles can’t bear the thought of him there. But that sounds like he pities the alpha, even in his head, so Stiles nods. “Yeah, that’s it.”\nDerek shakes his head. “You’re lying. But I can’t figure out why.”\nStiles shrugs. “Maybe I just really like having you here because when things go bump in the night I can sic my werewolf on them?”\n“Your werewolf?” Derek steps back, which is really the wrong direction.\n“See, I knew you wouldn’t like it.” Stiles reaches out and grabs onto Derek’s right wrist. “Come to bed, Derek. Stop worrying so much.”\nDerek’s expression softens, just a little, around the mouth. If Stiles hadn’t been studying him for the past several months he wouldn’t have seen it, but he knows Derek well enough to know that he’s got more than sourness to his personality.\nStiles tugs on his wrist until Derek follows him the few feet to the bed. Stiles shuts off the lamp and Derek toes off his shoes and climbs in after Stiles. He lets Stiles keep holding onto his hand, and this time Stiles drifts off first. When he wakes up sometime in the night, he’s nestled against Derek, the werewolf breathing into the back of his neck.\nDerek must sense he’s awake, because he begins to ease his hand from Stiles’s, but Stiles clings, his nails digging into the skin again. “Wait,” Stiles murmurs, speaking softly in the darkness. “I answered your questions earlier. Will you answer mine?”\n“You didn’t tell me everything,” Derek accuses. Stiles releases Derek’s hand and turns on his side so he’s facing him. He can’t see anything in the darkness, but Derek can, and he’s pretty sure he wants Derek to see his face. He wants Derek to believe him.\n“No,” Stiles agrees. “But I told you more than you’ve told me.”\n“Fine.”\nStiles reaches for Derek’s hand again. He twines their fingers together and only when he’s confident Derek won’t try rolling away does he ask, “Why do you come here?”\n“Because I can sleep here.”\n“Why can you sleep here?” Stiles tries to keep his exasperation from his voice. Derek undoubtedly smells it, anyway, if exasperation has a scent. It probably smells like puppy to Derek, or something.\n“I don’t know. It just—being around you is calming.”\nStiles takes a moment to absorb that. “So if I started spending my nights with the pack in the subway station?”\n“I would probably sleep there.”\n“Huh.” Stiles counts Derek’s breaths. After he’s exhaled eight times, he presses, “So, you don’t hate me, then?”\n“Haven’t we been over this?” Derek pulls their linked hands over so Stiles is forced to move closer to Derek, or disentangle his hand, which is not something he’s willing to do. “I don’t hate you. I find you confusing and slightly spastic and overwhelmingly human.”\n“And you like me?” Stiles prompts. Derek growls against his lips; their mouths are suddenly mere centimeters apart. Stiles wishes he could see the look in Derek’s eyes, but then if he could, his heart would probably stop beating and he’d die unkissed by Derek Hale. Because kissing seems to be the direction this conversation is going.\n“I don’t understand you,” Derek murmurs. His lips move against Stiles’s with the words, the barest brush of sensitive skin on skin.\n“Me neither,” Stiles admits. “But I think I want you to kiss me.”\nAnd Derek does. It is soft and quick and far more chaste than Stiles has ever imagined a kiss could be. But then he nudges forward, and Derek’s lips part against his, and this kiss is hungry and angry and dark like licorice and Stiles sighs when Derek drops his mouth to the space on his neck just above the collar of his shirt.\n“So, this is different,” Stiles says. “Are we, like, dating now?”\nDerek’s mouth is busy, so he doesn’t get an answer, but he thinks that’s probably okay for now. His mouth can be busy, too.\n:::\nScott brings reinforcement. He and Danny corner Stiles against his locker and glare at him. Well, Scott glares. Danny looks politely confused with his arms crossed.\n“What?” Stiles asks around a yawn. He had used two bars of soap in the shower that morning, which may have been overdoing it a bit. But Derek had grabbed his hand and nipped at the tip of his index finger and said, “You decide what this means,” and apparently Stiles had thought it meant using all the soap in his bathroom.\n“Scott says you are involved in something and he’s not sure if you’re aware of what that something is and he wants me to ask you the awkward questions because he isn’t sure how to deal with them,” Danny says. Scott winces.\n“Seriously?” Stiles looks from Danny to Scott and back again. “You can’t just ask me yourself?”\n“Is he treating you well?” Danny asks. Scott glances at him. “What? That’s the question my friends always ask me.”\n“It doesn’t matter if he’s treating you well or not,” Scott says. “This cannot happen.”\n“Well, that’s harsh.” Danny glares at Scott. “I mean, I admit to not understanding everything that’s going on here, but if Stiles has found someone he likes, then it’s not fair for you to get in his way, McCall.”\n“He’s twenty-three,” Scott says.\n“And Stiles is pretty much seventeen. Better than any guy he’d meet at most of the clubs around here.” Danny turns so he’s standing beside Stiles, facing Scott. “I think the problem here is yours.”\n“Nothing’s going on,” Stiles tries. “Come on, Scott, I told you already.”\n“Um, Stiles.” Scott reaches out and tugs at the collar of his buttoned shirt, which he’d worn expressly for this purpose, and presses a thumb beside the dark reddish bruise along his collarbone. “I think you need to work on your lies a little more.”\n“Fuck.” Stiles’s hand flies to his neck. “Scott, it just happened,” he begins.\nDanny looks between the two of them, holds his hands up. “Sorry, guys. I think I’m in over my head here. But, seriously, McCall. You need to chill, if this is about the age thing or the dude thing. That’s not cool.”\n“It isn’t,” Scott grinds out as Danny flees. “It’s about the alpha thing,” he growls, turning to Stiles. “The pack isn’t strong enough to deal with you two fighting.”\n“How do you know we’ll fight?” Stiles asks, buttoning up the final two buttons on his shirt so his collar actually does its job and blocks the hickey entirely from view. Apparently Derek had meant that it was his decision in a metaphorical sense. He’d already decided in the physical sense.\n“Because this is Derek. All he does is fight.”\n“Not with me,” Stiles says. “Scott, this is happening. I think. I mean, it just started happening last night. But I think it’s happening. So can you please just—accept it?”\n“Why couldn’t you have fallen for Isaac?” Scott turns away from him.\n“Scott,” Stiles hesitates, then reaches for Scott’s wrist. “He calms me down.”\nScott looks at him. “It makes no sense.” He shakes his head. “None at all.”\n“Does anything make sense anymore?” Stiles asks. They begin walking toward their first class. Scott makes a noise that could be concession.\n“Are you sure?” Scott asks. “Because this could mess things up, like Allison and I could mess things up.”\n“It’s not the same thing,” Stiles argues. “Not yet.”\n\"Okay,” Scott agrees. “Okay.” He nods and squeezes Stiles’s shoulder. “Okay,” he repeats.\n ::: \nChris Argent buys Stiles a cup of coffee that afternoon. Stiles decided to miss the bus in favor of securing himself some much-needed caffeine, and he regrets his decision as soon as he sees Chris standing in line at the Starbucks near the school. By then it’s too late to escape, and Chris latches onto him with a smile.\n“Sit with me?” Chris suggests, nodding toward one of the small tables by the window.\n“I really need to get going. My dad will be worried.” Stiles holds his coffee and wills his hand not to shake. “Thanks for the coffee, though, that was nice of you.”\n“Sit with me.” Chris grips Stiles’s forearm and pushes him toward the table.\n“Okay.” Stiles sits.\n“I have a few questions for you.”\n“Did Isaac email you the plans?” Stiles had received the outline of the boundary and the groups who would be patrolling in his email that afternoon, and Isaac had told him that he would pass it along to Chris.\n“He did. But I’m confused as to where we are?”\n“Well, we couldn’t exactly include you in it, since Peter helped draw it up. I think one of the groups will be replaced with your men, though, so we’ll have more time to rest. Derek should let us know, and we’ll text you.”\n“Okay.” Chris looks at the plastic lid of his coffee cup. “I also wanted to warn you that about ten more hunters will be coming into town on Tuesday. They’re aware that we have allied with a wolf pack, but some of them can be a little…hasty.”\n“Really? Hunters being hasty? What a shock.” Stiles doesn’t bother repressing his obvious bitterness. “Where are they staying? With you?”\n“No.” Chris shakes his head. “Allison wouldn’t be happy with that and, to be honest, neither would I. They’ll be at the Hampton Inn, near the market on the far side of town from the Hale house.”\n“That was smart,” Stiles admits. “Putting them over there, I mean. We rarely wander that far.”\nChris looks at him. “Why do you include yourself in the pack so easily?”\n“I am pack,” Stiles says. “That’s it.”\n“But you haven’t been bitten.”\n“No, and I won’t be.” Stiles’s hand drifts up to the mark Derek left on him the night before, but Chris’s gaze doesn’t leave his face. “I’m staying human.”\n“A human in a wolf pack. It’s a little odd.”\n“It’s not like I’m the only one,” Stiles snaps.\n“Allison’s not,” Chris says, and there’s a question to the words and this, this is why he wanted to talk to Stiles. Of course.\n“Of course not,” Stiles hurries. He really needs Derek or somebody to teach him to be a better liar. “I wasn’t talking about her.”\n“Who were you talking about, then?” Chris prompts, and Stiles grips his coffee cup.\n\"Just because we’re allies now doesn’t mean you get to know everything about the pack. Thanks for the coffee.” Stiles pushes away from the table, and Chris smiles up at him. He looks harmless. But then, so did his father. There is too much intrigue in this town, Stiles thinks, and not enough honesty.\n“I wish that Allison had fallen for you, instead of Scott,” Chris says, as Stiles turns his back on him. Stiles freezes and glances over his shoulder, eyes narrowed. “You’d have made a nice hunter, Stiles.”\nStiles turns fully around and leans in close to Chris Argent. He keeps his voice low. “Allison would never have fallen for me. She loves a wolf.” Chris’s eyes shut for a brief instant. “And even if I had met her before Scott was bitten, I would never be a hunter. What you do is so fucking wrong.” He spits the words and turns away. Chris exhales a shaky breath behind him, but Stiles continues out the door, passing one of his father’s deputies on his way out. The deputy raises his arm. Stiles pretends he doesn’t see him.\n:::\n“Steven said he saw you getting coffee with Chris Argent today.” Stiles’s dad sits down at his place at the table, where Stiles has set a plate of salad and chicken, and stares at his water glass rather than at his son.\n“I got coffee before coming home. Allison’s dad was there.” Stiles sits across from his dad and picks up his fork. He begins shoveling food into his mouth, hoping that if he has a mouth full his dad will stop talking to him.\n“I didn’t know you knew Allison’s dad.”\nStiles shrugs. “Sort of.”\n“Steven said you two looked as if you were having a fairly heated conversation.”\nStiles thinks that it really isn’t fair that his father has spies all over town. “Yeah, no. He just had a question about some scheduling things for school. Apparently Allison isn’t speaking to him.”\n“Really? Steven said it looked a little as if you were threatening him.”\nStiles chokes on a piece of lettuce, wheezing as he coughs. “In what world,” he asks, when he finally is able to speak again, “would I threaten an adult? In what world would I threaten anyone?”\nHis dad laughs but it’s a bitter sound. “Oh, Stiles,” he sighs. “Oh, son. In what world would you chain a classmate in the back of a police van and tell me it was all a joke? In what world do you come home bruised regularly? In what world do you leave the girl you claim you love in a field after she’s been attacked by a madman? You threatening Chris Argent…I’m sorry to say it wouldn’t surprise me in the least.”\nAnd that is terrible. That is horrible. Stiles is shaking so hard he can hardly breathe. He can’t see, everything is white around him and the air is really hard, really very thick as he tries to get it to cooperate. He can hear his heartbeat, loud and fast. He can hear his dad, repeating his name, sounding panicked, underneath the sound of his heart, and he can feel hands on his shoulders, squeezing.\n“I’m so sorry,” he manages between gasps. “I never wanted…I’m so sorry.”\n“Stiles, Stiles, Stiles,” his dad keeps saying, and then Stiles forces himself to breathe normally and his heart is still so loud as his dad pulls him into a crushing hug.\nThey stay like that, his dad holding him as he catches his breath, for a long time. When his dad lets go, Stiles drops his elbows to the table and his head into his hands. He keeps his eyes shut. His dad is pacing around the table, and finally says, “I’m sorry for how I handled that. Something needs to change, but I didn’t need to lay it all out in quite that way.”\nStiles nods into his hands. Derek told him he could tell his dad. But how is he meant to go about that. Hey Dad all this time I’ve been protecting you from finding out that all the worst fairytales are real? It just seems like it won’t work. He needs Scott there with him, but then his dad will look at Scott like a monster and Stiles is tired of people being seen as less than they are because of how they appear.\n“So, we need to talk about this. Actually talk about it,” his dad says. “You can’t just avoid me from now until forever. But I have a feeling that you won’t. So we’ll leave it as it is for now. Okay?”\nStiles sighs. “Okay,” he agrees, speaking into his hands.\n“Can you at least tell me what you said to Chris Argent today, though?” His dad returns to his seat, and Stiles thinks back over his conversation with the hunter. It had actually been rather complimentary, if you think it’s nice when your friend’s parent tells you that you’d do a good job of killing your best friend and boyfriend (?) and three out of five of your other friends (because Jackson does not count). Of course, Stiles isn’t really a fan of such loaded compliments. He imagines his dad wouldn’t be, either.\n“He told me I’d make a good soccer player. I told him I was too obsessed with lacrosse to consider it.” Sports metaphors. Sports metaphors are good, even if his dad isn’t in on the metaphor part of things.\n“Really? That’s it?” His dad sounds disbelieving, probably with good reason. Stiles must have looked fairly deranged, whispering into his friend’s dad’s face like that. A serious lack of forethought had gone on there, he admits, but Chris Argent had pissed him off so much.\n“That’s it.” Stiles smiles. “You know I’m very passionate about lacrosse.”\n“Hmmm.” His dad shakes his head, sighs, “Oh, Stiles,” again, and stands. He brings his plate to the sink and squeezes Stiles’s shoulder as he passes him on his way to the stairs. “I’ll see you in the morning, son. And someday we’re going to have to sit down and have a chat about honesty and how you should probably learn to tell the truth again.”\nStiles pulls out his cell phone as soon as his dad is out of the room and texts Scott, This is all a nightmare, right? There are no such things as werewolves and no such things as hunters and I’ll wake up tomorrow and the sun will be shining and I’ll be a benchwarmer on the lacrosse team and nothing more?\nHe almost adds, And my mom will still be alive? because the world was wrong long before the appearance of werewolves, but he isn’t sure he could handle the visual reminder of her death in a text. And it’s not fair to Scott to put all of this on him, not at all.\nHe doesn’t get a response, but as he’s getting ready for bed Scott appears in his window, climbing through and landing on the floor with a fair amount of grace. “Stiles.” He sounds tired and sad and not at all like the Scott who sits in a circle with werewolves and plots against alpha packs. He sounds like the Scott who stood beside Stiles at his mom’s funeral, a Scott who was shocked to his heart. An empty Scott. “What’s wrong?”\nStiles shakes his head. “My dad. I can’t tell him but Derek says I can tell him but how could I tell him?”\n“Easy. Is he happier not knowing?”\n“I don’t know. I really fucking don’t. Was your mom happier not knowing?”\n“At first, I think, yeah.” Scott sat on the edge of Stiles’s windowsill. “But after she got over the shock of the whole thing, she really came around. And it’s really really good that she knows, now. For me, I mean, it’s nice. She’s looking out for us, too.”\n“I just don’t know how my dad would take it. Like he won’t accept it unless there’s some concrete evidence, and even then it’ll take some doing, and then when he does—his whole career will be rewritten, you know? And that’s where he finds stability these days and I just…how could I shake that up?”\n“But it’s eating you up, him not knowing. It’s not good for you. And it’s not good for him, that you keep lying to him. So wouldn’t it be better if he knew?”\n“God I don’t know. It’s one of those lesser of two evils situations, but I can’t figure out which is lesser.”\nScott reaches out and squeezes Stiles’s shoulder. “I think when the time is right you’ll know. Or Derek will be over and your dad will walk on him in alpha mode. Or me all wolfed out over something. You know, there are many opportunities for discovery. Maybe the fact that he hasn’t sorted it out yet means something. In the meantime, if you need space, you can always come over to my place. My mom worries about you.”\nStiles tries to smile, but it comes out as a grimace. “Thanks, man. I think I’d rather he run into you than Derek. The alpha form is a little freaky.”\n“A bit. Speaking of, I texted him on my way over here, so he should be stopping by soon. You do want to see him?”\nStiles nods and rubs the back of his neck. “Yeah, of course. I just texted you first because…”\n“Because I’m Scott and your dad is my third favorite person in the world.”\nStiles tilts his head. “After your mom and Allison? How sweet, Scott. He’ll be so pleased to hear it.”\n\"After my mom and you, you idiot. I think I hear Derek. I’ll see you around.” He turns in the window and adds, “It’ll be all right, Stiles.” It would be nice to be able to believe him.\nDerek appears a few minutes later. “Scott texted me.”\nStiles is sitting at his desk, knees drawn up to his chin and the Wikipedia page on werewolves open on his computer screen.\n“I had a mild freak out,” Stiles explains, “involving my dad and the fact that every day it’s harder to lie to him, and that every day he trusts me less, and that apparently I really cannot tell the truth. Because I tried and I just freaked out even more.”\nDerek drops a hand to Stiles’s shoulder and squeezes. “I’m sorry,” he says, and it sounds sincere, which is odd.\n“It’s not your fault. I’m the one who never thought up good enough lies when they mattered. Now, of course, it’s too late.”\nDerek keeps his hand on Stiles’s shoulder, his thumb stroking along his shoulder-blade. “What are you doing?”\n“Trying to figure out a way to explain all of this to my dad. I thought if I backed up the existence of werewolves with enough historical evidence then he wouldn’t freak out as hard? But, as I should have already known, all the historical evidence is bull. So that’s no help.” He shrugs Derek’s hand off of his shoulder and stands to face him. “Sorry. Tonight was just really…not good.”\n“I know.” Derek reaches out and cups his hand against Stiles’s neck. “Look, if this is too hard—”\n“Nothing’s too hard. It’s just that nothing’s easy, either. It would be nice for something to be easy.” \nDerek narrows his eyes at him, dark eyebrows lowering for a fraction of a second. And then he leans in and catches Stiles’s lips with his own, kissing him hard and long and in a way that feels like a good kind of drowning. When they pull apart, lips wet with each other’s spit, Derek says, sounding extraordinarily diffident, “This feels sort of easy, to me.”\n“Yeah,” Stiles sighs, leaning in and pressing his forehead against Derek’s shoulder. Derek wraps his arms around him and holds him close, one hand drifting beneath his t-shirt and drawing patterns over his back. “This is good. This is easy.”\nDerek makes a satisfied humming noise. Stiles hopes he never lets go again.\nThe alpha pack doesn't wait long to test their boundaries. Two nights after they establish them, three of the alphas try coming through at Derek and Isaac's point, and then two others attempt slipping through near where Stiles and Allison are camped out in the woods in Allison's car. Allison has a single bow and several arrows, and Stiles has a Molotov cocktail that Lydia gave him at the last meeting, but just as they're about to use them, Scott bursts from the trees, taking down one of the wolves with a raging howl.\nScott is in the way of Stiles's aim with the cocktail, and Allison has her arrow notched but can't get a good shot at the second wolf, which is prowling around the fight as if waiting for his turn. He keeps shooting red-eyed glares at Allison and Stiles, but doesn't attack them, which strikes Stiles as frighteningly odd; why would the wolf avoid the obviously weak humans?\nBut then Scott has the other wolf down and the second wolf leaps forward and Stiles realizes that he had been waiting to see which human Scott tries to protect first. Scott, of course, has moved towards Allison, even though she's the one with the fighting-werewolf-training and so Stiles becomes an easy target.\nStiles's hand is shaking as he lifts the cocktail into the air and lobs it towards the wolf, which doesn't notice the glass until it strikes him in the shoulder, bursting into flames as the shaken chemicals mix with the air. But the wolf keeps coming, burning and howling and focused on Stiles.\nStiles's heart is beating loudly and he's backing up, scrambling away, and all he can think is, my dad is going to be so upset and so sad, and then Allison's arrow strikes the wolf in its heart and it pauses in the air for a moment, then falls in a smoldering mass to the ground.\nThe scent of burnt fur and flesh is heavy and acrid. \"We're going to need to throw out our clothes,\" Stiles says as he wipes his suddenly sweaty palms on his jeans. \"I've never managed to get burnt werewolf out of jeans before.\"\nAllison exchanges a look with Scott, and the two come towards Stiles. \"Are you all right, man? Sorry, I didn't get what was going on.\" Scott squeezes Stiles's shoulder, and Stiles shrugs.\n\"Fine. Like I said, a little pissed about the loss of these clothes. This is my favorite shirt.\" It's red plaid and very comfortable, if a little worn at the elbows.\n\"No one else will be sad about you losing that shirt,\" Allison assures him. She's smiling, but it doesn't quite reach her eyes.\n\"Nice, Allison.\" Stiles's cell phone is buzzing, and he pulls it out to see that Chris Argent is calling him. He answers it. \"Yes?\"\n\"We've had a little bit of activity over here. We saw three wolves and got one in the leg, but it ran off before we could finish the job. What's your status?\"\n\"Scott and I,\" Allison was allegedly at her house, sitting in her bedroom window and restringing her bow just in case the wolves made a surge into town, \"took out two. Last I heard Isaac and Derek were on three of them.\" Derek might not be okay, Stiles realizes. A half-trained beta and a weary alpha on three alphas does not make a particularly good fight. He swallows. \"I'll check in with them and let you know what's going on.\"\nStiles hangs up and turns to see that Scott is wolfed out again, the cuts and scratches and broken bones he'd retained from his fight with the other wolf already healed. \"I'm going to find Derek and Isaac. You two call if anyone else comes around here, okay? And make sure you're both back home by four. Peter and Erica should be out to relieve you soon, anyway. But in case they aren't, you know.\" And then he leaps forward and is gone.\nAllison and Stiles roll their eyes at each other and move toward Allison's car. Stiles retrieves another Lydia-made Molotov cocktail from the back of the car and he and Allison climb onto the hood, staring out into the night. \"Derek's going to be pissed that Scott left us alone,\" Allison says as the woods prove un-werewolf-ized.\n\"Probably figures they won't send any more wolves this way, considering what happened to those two.\" Stiles nods towards the burnt wolf and the broken one, and then tilts his head, \"Which, speaking of, we're going to need to bury those, or something.\"\n\"Hopefully Peter will take care of them.\" Allison sounds bitter. \"After all, he's the one who started all this. Least he can do is do body clean-up.\"\n\"Hey now, he didn't exactly summon the alpha pack here.\"\nAllison snorts. \"Yeah, but he did kill Laura and then turn Scott, so really, if you're looking for someone to blame, there's no one better.\"\nStiles thinks of Allison's aunt Kate; he thinks about poking at that bruise and telling Allison that she was really the one who ought to have been blamed for all of this, Kate and her terrible choice in vendettas, but he's enjoying the companionship between them too much to risk ruining it by bringing up that very heavy past. Plus, he really doesn't mind Allison ragging on Peter Hale.\n\"So,\" Allison says after a few minutes of silence. \"You and Derek? That's a thing now?\"\n\"Scott can't keep his mouth shut.\"\n\"Um, Lydia actually told me. Said Jackson said you've been smelling like him for ages. And that hickey was kind of obvious.\"\n\"I covered it up!\" Stiles covers his face with his hands. \"This is so embarrassing!\"\n\"Why?\" Allison bumps into him, her shoulder pressing against his for a moment. \"I think it's really adorable. You're good for each other, even Scott can see that. Even if he is being a bit dumb about the whole effect of your relationship on the pack thing.\"\n\"Derek would die if he heard you call us adorable.\" Stiles feels a little gleeful, imagining the expression on Derek's face at the description.\nAllison throws her head back and laughs. \"God, can you imagine?\" She lowers her voice, attempting a growl and succeeding at only a breathy sounding whisper, \"He'd be all, 'We are not adorable, Argent, we are moody.'\"\n\"And broody,\" Stiles continues, laughing, \"and manly and pretty damn sexy.\"\nAllison lets her head fall to his shoulder and laughs, and soon they're barely breathing, laughter burning their throats.\n\"It isn't even that funny,\" Stiles finally says.\n\"No,\" Allison agrees, \"but it's nice to be alive.\"\n\n:::\nDerek sends Stiles a text at six in the morning, only two hours after Allison had dropped him off. Stiles is sitting at his desk, reorganizing his list of members of the alpha pack. He crosses off the two Scott and Allison and he had killed that night, and adds their date and type of death beside their names before reaching for his phone.\n\nAre you home?\n\nStiles wipes his eyes with the palms of his hands. He feels so tired, he would kill for Derek to get here so he could curl up next to him and never wake up. But Stiles has school and Derek undoubtedly has to clean up after the night before so he texts back, Yeah. You're fine, right? I'll see you at the pack meeting tonight?\n\nI'm fine. See you there.\n\nSchool that day is some special sort of torture designed precisely for teenage werewolves and associated humans; their stats teacher gives Stiles and Scott a pop quiz and the cafeteria serves its special soggy pizza with pools of grease in the pepperoni and there is nothing nice about their substitute teacher in Spanish. If Stiles weren't already on what is essentially probation he would have skipped after the failure that was first period, but the thought of skipping calls to mind the thought of his father's disappointed face, and so he suffers through until the end, exchanging miserable looks with the other members of the pack whenever they pass each other in the hall.\nWhen the final bell rings at the end of the day Stiles bolts to the coffee shop two streets down. Its coffee isn't as good as the coffee at the Starbucks where Stiles ran into Mr. Argent, but he's willing to sacrifice good coffee in order to avoid hunters and deputies. Besides, this coffee has caffeine, too, and that's all Stiles really needs at the moment.\nOf course, because his luck is about on par with the luck of Mary Queen of Scots or someone, Peter Hale enters the coffee shop behind him. He's one hundred percent sure that Peter has followed him there, but Stiles doesn't acknowledge him until after Peter's been forced to buy a coffee by the persistent barista. Stiles sips his and waits for Peter by the door.\n\"I hear there are scary things out in the wild. I'm going to walk you home.\" Peter pauses beside Stiles and Stiles nods him ahead.\n\"Lead the way.\"\nStiles and Peter walk beside each other along the road, Stiles clutching his coffee cup in a shaking hand. Peter seems calm, but of course he is, because he's the one about to initiate an undoubtedly terrifying conversation.\nStiles jumps the gun. Of course. \"So, as lovely as this is, I'm a little curious about why it can't just wait for pack meeting tonight. Obviously there will be a pack meeting tonight—I mean we can't almost get our asses handed to us by a bunch of alphas without having a meeting to discuss how we feel about it—which, not so good, by the way—and you will be seeing me there. So why the sketchiness of accosting me at a coffee shop? And you didn't even buy me my coffee.\"\n\"I guess I'm not as nice as Chris Argent is.\" His tone is dry, and Stiles manages to keep himself from stiffening instinctually.\n\"Not really what I was referring to.\" Stiles's voice is miraculously steady, but his hand is shaking even more.\n\"But it could have been. He did buy you coffee last week, didn't he? I saw you two together.\"\n\"You and the whole town. Why do adults insist on stalking me?\"\nPeter raises his eyebrows as his lips twist into a smirk. \"You're…intriguing. And I have an interest in how you conduct yourself. For example, you were getting coffee with Chris Argent because…?\"\n\"I hate him and he enjoys tormenting me?\" Stiles suggests. Peter shakes his head.\n\"No. It looked more as if you were tormenting him. He did not look good after you left that Starbucks. He looked as if you had threatened to eviscerate him and his daughter, and he believed that you could do it.\"\nStiles shrugs. \"Maybe that is what I did.\"\n\"Somehow I think it has a bit more to do with the fact that you and the rest of the pack have formed a 'secret' alliance with Chris Argent and his hunters.\"\nStiles has just taken a sip of his coffee and he fights the urge to spit it out, swallowing fast so the hot liquid burns his throat. He coughs once and says, \"No, it was really just a conversation about Allison and how much it sucks that she's in love with Scott which is dumb because I think it sucks only because her dad is a dick about werewolves, which is what I told him. That's all we talked about.\"\nPeter's laugh sounds like a growl. It's a little disconcerting. \"Oh, Stiles. I would believe you, except that I saw Chris Argent out with some of his friends last night, and they were definitely hunting wolves. How would they know where to go, if you hadn't tipped them off? And don't say technically it wasn't you,\" because Stiles has opened his mouth, \"that won't help your case at all.\" Which is, all things considered, patently true.\n\"Well, you're an imbecile if you can't see the bigger picture here.\"\n\"The bigger picture wherein it's fine if human are policing werewolves as long as the werewolves in question aren't what you'd define as 'good?'\" Peter's tone is derisive, and Stiles feels a little ashamed, but then he straightens his back and stops, turning to face Peter. His hands are still shaking, but he keeps his gaze steady.\n\"Look, the way I see it is, if the werewolves are threatening the humans, then the humans get to protect themselves against them—and these wolves were attacking the town, or trying to. I don't agree with the way the hunters go after wolves who haven't proven themselves dangerous, but I also didn't think it was wise to split our pack to be fighting the Argents and the alphas. I've told everyone this already. An alliance with the hunters works for right now.\"\n\"Despite what they've done?\"\n\"What Kate and Gerard have done. And Kate is dead and every night I pray that Gerard is, too. Chris can defend the town against the alphas. We can go back to our fun little game of animosity after they're all gone.\"\n\"And you've never considered joining the humans?\" The 'even though you're one of them' hangs unsaid in the air. Stiles feels it like an ache in his lungs.\n\"Obviously not,\" he manages. \"Always the pack over the hunters.\"\n\"That's good,\" Peter leers at him and Stiles swallows. \"I may have gone to desperate measures to keep you in my pack.\"\n\"It's not yours, it's Derek's.\" Stiles turns and continues walking. Peter follows one step behind him, he feels as if he is being stalked, hunted.\n\"So, by that logic, you're not mine, you're Derek's?\" Peter is way too close to him, Stiles can feel his toes hitting at the back of his shoes. He lengthens his stride as much as he can and ignores Peter's insinuation. He still belongs to no one, but if Peter realizes that he won't leave Stiles alone until someone has a definite claim on him. And he may like kissing Derek, but he doesn't want to belong to him.\n\"What are you going to do about our alliance with the hunters?\"\n\"Right now? Nothing. It's served us well so far.\" He sounds grudging as he admits it, but Stiles still wishes for supersonic wolf-hearing, so he can tell if the older wolf is lying.\n\"And if it stops serving us well?\"\nPeter turns off into the woods at the side of the road and glances over at Stiles. \"Then we'll be fighting a war on two sides. And if your loyalty strays, Derek may need to reconsider your position in the pack.\" He smirks at Stiles before bounding into the woods.\n\"I thought you were going to walk me home!\" Stiles shouts after him, and then curses as a car rolls around the corner of the road ahead of him and slows. It's his father's cruiser, and he is so tired of being fucked over. He supposes he should be grateful to Peter for abandoning him when he did, their association is one of the many things he wouldn't want to explain to his father, but he still has a hard time feeling anything for the older werewolf but revulsion.\n\"I got home early today, thought we could cook dinner together, and you weren't there,\" his father says as he rolls to a stop beside Stiles and leans across to shove open the passenger door.\nStiles holds up his coffee cup. \"Stopped for coffee and missed the bus.\" He climbs into the passenger seat and his father pulls a U-turn as he's still fumbling with his seatbelt.\n\"We do have coffee at home, you know.\"\n\"Yeah, but I can never figure out how to make it right. It always tastes like colored water, and when I try to make it stronger it comes out sort of like acid.\"\n\"So you decided to walk home? I'd appreciate if you'd text me next time.\"\nStiles is about to argue, but then he remembers the way his father looked disappointed the week before, when he had panicked at the dinner table, so he sighs and says, \"Okay. Is there still time for us to make dinner tonight?\"\n\"Yeah,\" his dad says. \"I was thinking steaks.\"\n\"I'm thinking something a little closer to the good-for-you end of the scale.\"\n\"Fine,\" his dad sighs. \"I might overdose on broccoli someday, and then where will you be?\"\n\"Probably selling myself on the side of the road. What a hard life I will lead. But at least I'll be able to say that my dad was the first person to die from a broccoli overdose. That's something.\"\nHis dad laughs as he pulls into their driveway. Stiles pats his Jeep with longing affection as he passes it, and he can feel his dad watching him as he takes his keys out of his pocket with a still-shaking hand and opens the front door.\n\"Stiles,\" his dad says, \"do you want to watch some Bond movies tonight? There's a marathon on TV, and I thought…it might be nice.\" He sounds so hesitant, like the Stiles of recent days can't appreciate a good Bond-style ass-kicking just like the Stiles who clamored to stay up to watch the movies when he was little. After his mom died, he and his dad watched the Bond movies on repeat, a constant loop of violence and espionage and sex going in their den, while they sat in silence and stared unseeing at the screen. A strange thing to tie you to reality after a tragedy, but for some reason they worked, and Stiles and his dad sometimes still sit down with the films and feel that terrible ache of loss and the triumph of somehow moving on into life along with that hole. Although, admittedly, they haven't watched the movies in a long time.\nStiles bites his lip. The pack is important, and the meeting tonight will be especially important, and he knows that if he misses it the whole pack will be pissed at him. But his father is looking at him like he doesn't know him, and he's holding out Bond films as a token of peace, and so Stiles nods and says, \"Yeah, okay. I'd love to.\"\nHe sends the whole pack a mass text, Family issue, Dad's home, can't make it out tonight. He sends another to Derek, Ran into Peter on the way home. Not sure if he told you but he knows about the hunters and is willing to let it go for now. And then, when he doesn't hear back from anyone, he sends a third to Derek, Sorry about tonight. Please say I'll see you later.\nHis phone remains silent, and he gnaws at the inside of his cheek the entire time he's chopping vegetables for their salad.\n\n:::\nAfter a fairly impressive marathon session of James Bond films Stiles checks his phone one last time, finds the screen blank, and stretches. \"I think it's time for bed,\" he tells his dad, but the sheriff has already curled at the other end of the couch, his head pillowed on the armrest and snoring a little. Stiles tugs the crocheted blanket from the back of the couch and tosses it over his dad, flips off the TV, which is halfway through Tomorrow Never Dies, and kisses his dad's forehead in a way that makes him remember his mother and her way of tucking him in on late nights after he waited up for his dad to get home from the station. He wipes at a disobedient tear as he crosses the room to the stairs, and he's so lost in memories that he's halfway through undressing for bed before he realizes that Derek is already there, sleeping on his side and facing the wall.\nStiles scrubs a frantic hand against his cheek and wonders if the scent of salt from one tear would be enough to make Derek curious. And then he sees the way Derek is breathing, so deeply his whole body moves with his breaths, and he thinks it's unlikely that Derek will wake up, even when Stiles climbs into bed with him. A part of him is disappointed, but a larger part is grateful; Stiles feels emotionally spent and he doubts talking to the growly alpha will help him. If Derek is in the mood to be considerate rather than grumpy, then maybe, but Stiles knows better than to expect that.\nHe leaves his jeans on the floor, climbing in beside the fully-clothed Derek in his boxers and a t-shirt, and Derek grunts as Stiles's legs press against his jeans. They really need to have a talk about proper sleeping apparel, Stiles thinks, as he slips one hand over Derek's waist, tucking it into the pocket of his jeans (which is useful, but it'd be much nicer if he could slip it against Derek's skin without cutting off his circulation), and nestling his face into Derek's neck. He matches his breathing to Derek's and drops off in minutes. His dreams aren't restful, they're full of vague impressions of his mother screaming and screaming for his father, but at least he's asleep long enough to have them.\nDerek wakes him before dawn, squeezing his wrist as he pulls Stiles's hand from his pocket. \"Hey,\" he murmurs, sitting up and dislodging Stiles's limbs from his own. \"I didn't mean to fall asleep on you last night.\"\n\"It's fine.\" Stiles presses his face against his pillow and blinks in the flat pre-dawn light. \"I wasn't really in the mood to talk.\"\nDerek grunts and reaches out, rubbing at the lines the sheets have made on Stiles's skin. \"You didn't want to talk.\"\n\"It happens sometimes. Ask Scott. I once went a whole day without saying anything other than 'yes' and 'no.' He called his mom in a panic and tried to get me to go to the hospital to have me checked out. But I just felt like being quiet, which I told him later. He still calls that 'the day Stiles went crazy.'\"\n\"Of all the other days to choose from,\" Derek says, and there's a bit of a smile tugging at the corner of his mouth. Stiles presses his thumb to it, as if he can hold it there.\n\"Hey, I don't act insane that often,\" he says because he knows he's supposed to.\n\"You're in bed with a werewolf,\" Derek points out.\n\"Well, yeah. But that's not that crazy. It's not like you're dangerous,\" Derek growls, so Stiles hurries, \"to me. You're not dangerous to me.\"\n\"Sometimes I am.\" If Stiles weren't lying pressed against Derek he wouldn't have heard that. Derek shakes himself, then swings a leg over Stiles so he's straddling him for the barest instant, before he's standing on the floor. \"I should get going. Your dad's going to be leaving soon.\"\nStiles nods, then reaches out and grabs Derek's index finger. \"Wait, before you go. Was the meeting terrible last night?\"\n\"It wasn't…it wasn't great. Everyone's pissed that Peter found out, Peter's pissed but trying not to show it, which is making everyone tense because no one can tell what he's actually thinking, and I may have yelled at Scott too much about leaving you and Allison the other night to make him a reliable ally at the moment.\"\nStiles drops Derek's hand and sits up. \"You should apologize to Scott. Allison and I can take care of ourselves—we actually can, that's not just me saying that, like, we took care of that one wolf, Derek, seriously took care of it, with fire and blood and stuff—and Scott was just doing what he thought was right. And I kind of agree that he was right. So.\"\n\"He'll get over it.\"\n\"Yeah, but he'll get over it a lot faster if you admit that maybe you weren't right. And then he'll be definitively with you and you won't risk the whole pack for your pride.\" Stiles bites back the 'again' that's surging on his tongue.\n\"Look,\" he says, because Derek's eyes have gone dark again, and his gaze is clearly turned inward, \"I appreciate that you care about my safety, and Allison's.\" Derek shrugs, his gaze cutting up to Stiles's and Stiles knows that he's thinking about how much more important Stiles is to him than Allison, but thankfully he doesn't say it. \"And I know that sometimes you need to exert your authority by bringing the others down a few pegs. But Scott stayed with us until he was sure that we were safe, and then he told us to stay in touch. It really doesn't help you when you attack them for actually thinking. Especially Scott. Because sometimes Scott and thought don't really go together, but when they do, everything usually turns out sort of okay.\"\nDerek reaches out and presses his hand over Stiles's neck, in what is fast becoming a familiar and scarily tender gesture, and then he leans forward and brushes a hesitant kiss against Stiles's forehead and Stiles swears his heart has never beat this fast before in his life, not even during panic attacks, not even when he forgets to take his Adderall and everything is moving at mach speed.\n\"I'll talk to him,\" Derek promises before vaulting out of the window, the words a gruff whisper against Stiles's forehead. Stiles falls back onto his bed with his feet on the floor and stares at the ceiling.\nHe wonders if it's wrong to fall in love when the world is falling to pieces around him. He wonders if it's wrong to know that all he has are glass bones and soft lungs and breakable skin, and if it's so very wrong to want to offer all of that for one single broken man.\n\n:::\n\"Derek came to see me this morning,\" Scott says as he slides into the desk beside Stiles in Stats.\n\"Did he crawl into your bed, too? I really need to have a talk with that man about boundaries.\"\n\"Ew, no, stop.\" Scott covers his ears with his hands and Stiles smirks, tapping his pencil against the plastic edge of the desk and waiting for Scott to continue. Scott finally lowers his hands and says, \"He apologized to me. I figure you probably had something to do with that, so I wanted to say that I'm sorry for how I reacted and to say that maybe I'm wrong and you two might be good together and please, please, please do not talk to me about any of the sex things because the thought of you and Derek,\" he makes a face, and Stiles laughs into his shoulder.\n\"Sure, dude.\" Stiles reaches over and flips Scott's book to the correct chapter. \"I promise.\"\n\"Thank you.\" He pretends to read the beginning of the chapter, which he certainly didn't look at the night before, and then he adds, \"Meeting sucked without you. Can you please try to make it to the next one?\"\n\"I tried to make it to last night's. It's just that things with my dad are pretty awful right now, and he wanted to watch movies last night, so,\" Stiles shrugs and Scott nods.\n\"I get it. Are you sure you don't want to tell him? I'd come over and my mom could come, too, try to talk him down from shooting me or whatever.\" Scott's speaking quietly, but a few people have started glancing at him. Their teacher is at the front of the room, staring at the clock as she waits for the bell to ring.\nStiles shakes his head. \"I might take you up that sometime,\" he mutters, as the bell rings and Ms. Lawson jumps into action, already lecturing about how irresponsible it is to not complete homework assignments.\nScott half-smiles at Stiles and then scowls at his textbook, because there is nothing worse than beginning the morning with a lecture intended to make you feel about as guilty as possible.\nJackson and Lydia sit on either side of Stiles at lunch. Stiles does not pretend to be okay with this development.\n\"I don't want you two making googly eyes over me all period. Go sit over there.\" Stiles nods to the other side of the table, where Scott is sitting with two perfectly empty seats beside him.\n\"So,\" Jackson says, and he's close enough that Stiles can smell his Axe deodorant, which means that he's also more than close enough to smell the Derek all over Stiles, \"we hear you have a bit of an in with our alpha.\"\n\"You were also told not to harass the poor human.\" Erica sits next to Scott and Stiles curses her. In his head. He's not enough of a masochist to do it out loud.\nHe does say, \"I'm not a poor human, Erica,\" and he thinks he sounds convincing enough.\n\"Sorry. Scott told you not to harass the human,\" Erica says. Which doesn't really help much. Scott is staring at his food, avoiding Stiles's gaze.\n\"That's funny,\" Stiles says. \"Because Scott started off by harassing me. Didn't you, wolf-boy?\"\nScott growls—actually growls—and if anyone's been spending too much time with Derek it is definitely Scott. \"I apologized,\" Scott mutters.\n\"Why is it that you want an in with Derek, anyway?\" Stiles asks, leaning away from the table slightly so he's not as close to Lydia and Jackson.\n\"He is not giving me any freedom.\" Jackson's voice sounds tragically close to a whine.\n\"That's because you don't have enough control yet,\" Isaac sits down beside Erica, and there goes Stiles's one chance at escape.\n\"It's because he doesn't trust me,\" Jackson spits.\n\"He doesn't really trust anyone,\" Stiles points out. Scott glances up at him, a minute shake of his head the only sign that that was really the wrong thing to say.\n\"He trusts you.\" Jackson is in his face, his lips pulled back and his canines elongating.\nFuck. \"No, he really doesn't.\" Stiles reaches out and presses a hand against Jackson's chest which, yeah, probably not the smartest move. From the corner of his eyes he can see the three wolves across the table tensing over their plates, and he can feel Lydia's breaths coming quick over his shoulder.\n\"He does,\" Jackson growls, the words nearly unintelligible around his wolf teeth.\n\"Fine, whatever. I'll talk to him, okay?\" And it's not a lie, although Stiles doesn't expect the conversation to go as smoothly as Jackson seems to. The wolf backs down, though, placing his human-fingertipped hands on the table and reaching for a slice of Stiles's pizza.\n\"Okay,\" he says.\nThe others have returned to their food, completely calm, and Stiles pushes back from the table. \"I really need to find some new friends,\" he mutters, crossing the cafeteria and waving as he passes Allison, who's sitting with Danny but watching him. She mouths, \"All right?\" and he nods, but then changes direction and comes to sit beside Danny.\n\"Hey.\" Danny glances up from the book he'd been flipping through.\n\"What was going on over there?\" Allison asks, fidgeting with a piece of her hair.\n\"Are they all still being stupid over you dating that dude?\" Danny asks, and his hand has tensed on the page of the book. It's strange to have so many people invested in his life.\n\"Define stupid,\" Stiles mutters, as Allison raises her eyebrows.\n\"I thought Scott was getting better?\"\n\"He's fine,\" Stiles says. \"It's not that.\"\n\"What is it, then?\" Allison asks. She shoots a glare across the room toward the table where the others are sitting. He's okay with Allison being protective of him, but he doesn't like the look on Danny's face, like everything could get seriously fucked if he just pushes a little more.\n\"Why is Jackson staring at you?\" Danny's voice is hard.\nStiles curses as he stands, but then mutters, \"It's nothing, it's fine, Danny. He just asked me to do something and I guess I'm not doing it fast enough.\" He waves both hands at the far table and says, \"I'm going, I'm going.\"\nHe pulls out his cell phone as soon as he's in the hallway, heading towards the boys' bathroom at the end of the hall.\nDerek answers with a gruff, \"What's wrong?\"\n\"Nothing, nothing. God, do I really only contact you when something's going on?\"\n\"You only call me when something's going on. And you're in school. And I just saw you five hours ago. So what is going on?\"\n\"A boy can't want to talk to his boy—man—person?\"\n\"What do you want, Stiles?\"\nStiles leans against the closed door of the stall he's slipped into, flicking the lock in place. \"Technically it's what Jackson wants.\"\n\"No,\" Derek growls. Stiles can almost see the way his eyebrows are closing in over his nose, forming little lines in his skin.\n\"You haven't even heard me out,\" Stiles protests, even though he agrees with Derek's conclusion. Just a few months ago Jackson was turning into a lizard and killing people because some psycho with a vendetta told him to. Clearly he is not deserving of the pack's trust quite yet.\n\"I've heard Jackson out many times.\" Derek sighs into the phone. \"But fine, tell me why you think we should let him have more freedom.\"\nGood, because Jackson is so clearly listening in on this conversation, and Stiles doesn't feel like facing an angry young werewolf for the rest of the day. \"Happy betas make for a happy alpha,\" he tries.\n\"My happiness, thank God, does not rely on Jackson's attitude.\" And that's an interesting way of putting it, Stiles thinks, because that means that Derek feels some happiness, something other than anger and the aching longing for Stiles that Stiles feels for Derek, and the thought that maybe Derek isn't as moody as he sometimes seems makes Stiles's heart beat a little faster.\n\"Granted,\" Stiles says. \"But maybe Jackson will gain more control over himself if he realizes that you trust him? Like, and I get that you feel you can't trust him until he's more in control, but what if this is one of those catch-22 deals and if you just trust him everything will straighten out?\"\n\"I can't even hear your heartbeat and I know you don't believe that,\" Derek says.\n\"Fine,\" Stiles sighs. \"Well, I tried.\"\n\"Why did you try?\"\n\"Jackson smells like Axe.\" And I smell like you, Stiles adds silently.\n\"He threatened you?\" Derek's voice is verging on a growl, and Stiles's hand fists in his pocket.\n\"No, not really. Not like, go-all-ragey-at-your-betas-to-protect-poor-little-Stiles threatened. As I have reminded you many times, I can hold my own. I can especially hold my own with the pack.\"\n\"Why did you try, then?\" Derek repeats. He sounds a bit more human, which is good, Stiles thinks. Less like he's going to break into the school and take Jackson to the ground until he learns his place.\n\"Jackson needs an ally. He has Lydia, but she's not—she loves him, so she sort of has to support him. I sort of hate him, and he sort of hates me, so I make a good but unexpected ally.\"\n\"Alliances are stupid,\" Derek says, and yeah, these days Stiles agrees, because he has far too many going on at once.\n\"Sure, but they also sometimes accomplish things.\"\n\"Right.\"\nThe bell rings over Stiles's head, echoing in the tiled bathroom, and he says, \"I've got to go.\"\n\"See you tonight,\" and that's almost too much for Stiles's heart.\nJackson is waiting for him when he comes out of the bathroom. He glares at Stiles and Stiles shrugs. \"I tried, man.\"\n\"I hate you,\" Jackson says, but the words are softer than usual, and Stiles just raises his shoulders again before turning down the hall towards his history classroom. Most of his hate these days is reserved for foreign alpha wolves, dead Argents, and a particular Hale.\n\"We need to talk,\" Stiles says.\nDerek stiffens where he's landed, legs still bent at the knees and arms slightly outstretched to keep his balance. He looks up at Stiles with his eyebrows raised, eyes dark. \"Okay?\"\n\"It's nothing bad, stop looking like I've kicked you.\"\n\"Okay.\" Derek straightens and tugs his shirt straight. His shirt, which is a problem, and his jeans, and even the socks that appear as he toes off his shoes. \"So?\"\n\"Will you please take your clothes off?\"\nDerek blinks at him. \"What.\" And really that word should be a question.\n\"I just mean,\" Stiles can feel the red of a blush hitting his cheeks, because he is still five at heart. \"I don't mean get naked, or whatever. I just mean, take your your jeans off and if you want you can borrow a pair of pajama pants. Or,\" he feels like he's offering Derek the moon or something, \"you can leave some here. It's just that I really hate how you look like you're always ready to leave, even when you're asleep. Also,\" because Derek's opened his mouth to say something, but Stiles isn't ready to hear it yet, \"it's really uncomfortable to sleep next to somebody who's wearing jeans.\"\nDerek cocks his head at him, a small smile on his lips. \"Okay,\" he says, and snags at the collar of his t-shirt, tugging it over his head. And yeah, that's just as nice as Stiles remembers, from the time he forced Derek to give Danny a very a stunted and PG striptease.\nHe feels himself moving towards Derek, and he reaches up to press his hand to Derek's collarbone. \"Or, you know, maybe I did mean get naked,\" he says before he can even recognize the words coming out of his mouth. Derek lets out an amused laugh and leans forward to catch Stiles's lips in a kiss.\nStiles lets his hands wander over the smoothness of Derek's back, and Derek licks into his mouth as his fingers trace over the muscled edges of Derek's shoulder blades. Derek rucks Stiles's shirt up with his hot hands and moves them down and over and around the bumps of Stiles's spine. The feelings are a lot and confusing and Stiles wants even more, very badly. He wants to feel these fingers everywhere, to have this palm flat over every part of his body, and he wants to do the same to Derek, he wants to taste the inside of Derek's elbow and the bump of his ankle and bite at his hipbones and…he wants everything.\nDerek pulls back, reaching up to press his fingers against the nape of Stiles's neck. \"We can't, yet,\" he says, and Stiles knows there are reasons, and he assumes the reasons are good ones—the age difference being one, but not the only, and not the most important—and usually he's all for rational thinking but right now he just wants everything he can possibly get of Derek.\n\"Yet,\" he repeats, latching onto that word like it's a vow.\nAnd Derek nuzzles into his neck, his lips, teeth, and tongue tugging at skin, and he murmurs, \"Mine,\" into Stiles's collarbone and, wait.\n\"No.\" Stiles steps back, places his hands on Derek's bare shoulders and digs his fingertips in to get the alpha's attention. \"Not yours.\"\nDerek's eyes flare red for a moment before he regains control of himself. He inhales. \"You don't smell of anyone but you and me,\" he says, like that settles it. There's a hint of a growl around the \"me\" and Stiles reminds himself of territory and the pack and how important belonging is. But he can be with Derek without being owned by Derek.\n\"Right.\" Stiles digs his nails in. \"And I won't ever smell of anyone but you and me again.\" This is a forever type of thing and maybe he's stupid for saying it like that but who cares because Derek is still looking angry. \"But I am in control of myself, Derek. I am. You don't own me, not at all.\" Because loving Derek doesn't mean that he is any less him, that he is any less his own.\n\"Fine,\" Derek growls, pushing Stiles back toward the bed. \"But I'm yours.\"\nAnd that's wrong, too, Stiles thinks, as Derek's mouth is against his again, and all those electric feelings are burning inside him. He can't own Derek any more than Derek can own him. But the thought of owning Derek, the power of that, it bursts like weakness in his joints and his ribcage, and he lets Derek push him back to the bed and kiss him until his mouth tastes like coffee and slightly sour spit and above all Derek and nothing else.\nDerek lifts himself up off of Stiles after their lips have migrated to skin and left traces of each other on collarbones and shoulders and, in Stiles's case, a bite just beneath his ear that will be impossible to try and hide. He rolls over beside Stiles and stares at the ceiling, catching at Stiles's hand just as the younger boy begins to worry about whether his dad will notice the reddish bruises and whether there are any lies left to tell him.\n\"Sorry,\" Derek says, gruff, like he's embarrassed.\nStiles squeezes his hand. \"For what?\" He holds back the, \"That was great,\" because yeah, it was, but complimenting Derek on their combined make-out skills seems a little odd and very virginal, and just because he is a virgin doesn't mean he needs to act like one all the time.\n\"The bites. The marks. I got a little—\" he drops off and Stiles turns his head to see that Derek is looking at him, his mouth soft and swollen, and his eyes still hazy with lust. Derek releases Stiles's hand to lift his to his face, covering his eyes for a moment.\n\"No worries,\" Stiles manages, the words a bit uneven. \"Fingers crossed my dad works doubles until they fade, though.\"\nDerek holds out both hands, his index fingers wrapped beneath his middle fingers, and Stiles reaches out and grabs one and tugs it down, pressing a kiss to Derek's palm before he can think about it. Derek sighs, but it's not an unhappy sound.\nThey lie beside each other in silence, hands still linked, and Stiles finally says, \"About what I said earlier.\"\n\"It's fine.\" Derek voice is slow with tiredness, but Stiles shakes his head.\n\"I know it's fine, I just want to explain it so you actually think that it's fine.\"\n\"I do think—\"\n\"No, you don't. Because you're territorial. And maybe saying I'm yours and you're mine is the end all and be all for you, but for me it just means that I'm not in control. If I'm yours then I'm not mine, then I am not who I have always been and you're not yours, either and—to me, that's not romantic. I know what it is to not be in control of myself—and it's nothing like love. And it's not right.\" Derek's breathing is tight.\n\"But,\" Stiles rolls to face him again, reaches his free hand out to trace over one of the healing dark marks on Derek's skin as he continues,\"I do belong with you, and you do belong with me, and that's more than pack and more than friendship and more than anything else—it's the type of belonging that means—I don't know, it's as close to possession as we can get without losing ourselves. And this is all semantics, really, but I want you to understand that I didn't want to hurt you when I told you that I wasn't yours, and so when I tell you that you're not mine you won't make that face with all the sad wrinkles and tragic eyes—we belong with each other, even if we don't belong to each other. And even though I can't smell as well as you, I expect you to never smell of anyone else, either.\"\nAnd Derek could turn that into a joke, could threaten and growl and roll over on Stiles again until Stiles cries out that fuck, whatever, he is Derek's, because Stiles knows that if Derek presses hard enough there's a chance he'll lose track of his words. But Derek doesn't. Derek just nods at him, and tilts his head along the sheets, and kisses Stiles lightly, chastely, like their first kiss, and then he draws Stiles into his naked chest and Stiles mutters into his shoulder, \"You're still wearing your jeans,\" and Derek chuckles.\n\"One step at a time,\" he says, which is probably wise, because seeing Derek in just his boxers might destroy what little resolve Stiles possesses.\n\"Okay,\" Stiles agrees, resting his teeth on Derek's skin.\n\"If you were a werewolf,\" Derek speaks softly into the dark, into Stiles's hair, \"what you're doing right now would be considered a sign of dominance.\"\n\"And because I'm human it's not?\" Stiles mumbles, not really paying attention because Derek's hands are smoothing patterns into his skin.\nDerek makes a sound like humming. \"Don't tell the pack,\" he says, and Stiles smiles, nips at the skin by his mouth, and laughs as Derek's hands press tighter into his back.\n\"You're insane.\"\n\"You like me anyway.\" He doesn't intend for it to come out as a question, but in his sleepiness it sort of does.\n\"I like you every way.\"\n:::\nEither their finger-crossing works or some seriously scary shit is going on down at the station, because Stiles goes a full week without crossing paths with his father. They exchange notes and text messages, and their relationship is going better than it has in a long time. Of course, the fact that they can only get along when they're not actually seeing each other is seriously problematic, but it does make it much easier for Stiles to attend pack meetings and see Derek and not feel guilty and nervous all the damn time.\nIt also helps that the alpha pack has been quiet since the night they attacked. The wolves and hunters have continued patrolling the boundaries, but the alphas haven't attempted another breach all week. It's making Stiles anxious, and the wolves are being terribly stupid about it, saying maybe they've scared them off and maybe it's over and even Peter is looking triumphant, which is a very bad sign, if you ask Stiles. But no one is, so he just shakes his head and mutters profanity-laced warnings that everyone hears but no one actually heeds.\nThe Saturday after a particularly obnoxious pack meeting, which was so terrible that Stiles had shot Derek a glare afterwards that told him to stay away, Stiles wakes up to the buzz of his cell phone and the sound of his father in the hall. He rolls out of bed and glances at his reflection—for once he wakes up not looking mauled, which is an odd feeling and makes him miss Derek in the strangest way—and he picks up his cell phone without looking at the text and opens his bedroom door.\n\"Hey, Dad.\"\nHis father is halfway down the stairs, and he turns around and leans partially into the hall. \"Morning, son. I'm making pancakes, if you want some.\"\n\"Sure.\" Stiles follows his dad down the stairs and is scooping coffee into the filter when he remembers his phone. He flicks on the coffee pot and leans against the counter, opening the message. It is from Scott, which was odd because it is only eight on a Saturday. He opens the message, chewing at his lip, and blinks, Boyd just called to tell me that today is the seventh anniversary of the Hale fire. Says Derek went off into the woods this morning. Thought you might want to know.\n\"Fuck,\" Stiles rubbed his fists into his eyes. And he hadn't even let Derek come over the night before, because he was so pissed about the way the alpha was handling the actions (or non-actions) of their most recent threat. Which is a reasonable thing to be pissed about, he still thinks, but really not on a day that is as sad as this day is for Derek.\n\"Stiles,\" his father snaps, as if he has any right to criticize Stiles's language.\n\"Sorry,\" he mutters anyway.\n\"Is everything okay?\" his dad slides a plate of pancakes down the counter toward him, and Stiles cuts into them with his fork, dragging the fluffy pieces through syrup and examining them before putting them into his mouth. They taste a little off, not as good as he'd expected, and he imagines that has more to do with him than with the pancakes.\nHe swallows and tells his dad, \"Um. Sort of. Scott's got a problem, but he'll be fine. Probably.\"\nHis father raises his eyebrows, pulling out a chair at the table and nodding to the one across from him. Stiles takes it, hand shaking a little. He presses a button on his phone and starts to type out a text message. \"Am I still grounded?\" he asks his dad as he erases everything he's written and starts over.\n\"Are you ready to tell me everything that's been going on with you?\"\nDerek get your ass over here sounds a little too mean. He deletes it and then realizes that his dad is still watching him. \"Um, define everything?\"\n\"What were the bruises from?\"\nStiles's hand flies to his neck before he can stop himself, and then his dad's eyebrows go up even further and he curses internally, because of course he means the bruises from ages ago, not the new ones. Not the ones that have faded by now. His father doesn't know about those.\n\"You're still grounded,\" his dad says, when Stiles doesn't say anything more. The disappointment in his voice is heavy. Still heavy, still cutting. Stiles types, Derek, I'm sorry about yesterday. Can you come over? Or at least text me and let me know where you are? He sends it.\nHis father coughs. \"So, what's going on with Scott?\"\n\"Girl problems,\" Stiles mutters, because with Scott that's an easy answer.\n\"How about you?\" his dad asks, and oh, God, no, they are not doing this now. \"Are you having any girl problems?\"\n\"No.\" Stiles's voice comes off cold, like Derek's cold, like Jackson's, like Lydia's. He feels his father's sadness in waves, his surprise at being treated like someone not worth Stiles's time, so Stiles continues after a too-long pause, \"Unless you count comforting both Scott and Allison, and occasionally helping Lydia work out how to keep Jackson in line. Which I don't.\"\n\"Lydia?\" His dad looks at him, gaze softer. \"Isn't she the girl you've been in love with forever?\"\n\"Yeah. Except I'm not really crushing on her anymore. She and Jackson are—I don't know if they'll last, but they're lasting right now. And they fit, sort of.\" Except that Jackson is sometimes psychotic and always an out-of-control werewolf and Lydia is a bit of a self-effacing bitch, but then, Stiles has negative qualities too.\n\"But Jackson is the boy you and Scott—\" his dad cuts off, because that is going to be a sore subject forever.\n\"Like we told you then, totally a practical joke. He gets it now. We're friends.\" And that's a lie, but they are pack, which is deeper than friendship and indescribable to someone who isn't aware that creatures from fairytales exist.\n\"Stiles,\" his dad sighs, like his name could end this all, make the lies unwind. \"You—\"\nBut then Stiles's phone vibrates and he picks it up without hesitating, opening the text. Derek's written, You don't want to see me today. I'm fine.\nStiles groans. \"Stupid,\" he mutters.\nHis dad says, \"Who, Scott?\"\n\"Of course,\" Stiles says, without looking up. He types, I was pissed yesterday but today I need to see you and I swear if you don't come over I'm going to get Scott to track you.\n\"About Allison.\"\n\"Scott is always an idiot about Allison.\" Stiles stands up and dumps his remaining pancake in the trash can. He pours himself a mug of coffee and turns to see that his dad is still watching him, his lips twisted in a sad sort of acceptance. \"Thanks for the pancakes, Dad.\"\n\"Of course.\"\n\"Do you have to go in today?\"\nHis dad nods. \"In a minute.\" He hesitates, then adds, \"This should go without saying,\" as Stiles crosses the kitchen to the stairs, \"but you're not allowed out of the house, even when I'm not around to make sure you're following my rules.\"\n\"Of course.\"\n\"Of course,\" his dad repeats, sounding sardonic.\nHe is gone by the time Stiles steps out of the shower, and his phone displays one more text from Derek. I'm fine, Stiles.\nStiles nods, sets the phone on his desk, and sits on his floor with his back against his bed and his books in piles around him. He understands the need to mourn alone, but he wishes Derek didn't feel it too.\n:::\nHe can't sleep when Derek isn't there, so he's sitting at his desk, reading up on wiccan practices because Deaton had told him to believe and he had, when Derek appears at his window. He practically falls into Stiles's room.\nHe smells of sweat and looks exhausted, panting on the floor, and his gaze is vague as it lands on Stiles.\n\"Jesus, Derek, are you okay?\" And all right, yeah, stupid question.\n\"I'm not hurt,\" which is really what Stiles was asking, anyway. \"Can I stay tonight?\"\nStiles nods and moves to kneel beside him. Derek has sweat patches at the neck of his t-shirt and beneath his arms and he looks even more exhausted up close. Stiles reaches and pulls his sneakers off his feet, removing his socks as well, and not wrinkling up his nose at all—he doesn't—before reaching for the hem of Derek's t-shirt and snagging it up. Derek lifts his arms and lets Stiles tug the shirt over his head.\n\"Do you want to take a shower?\" Stiles offers, and he tries not to breathe out in relief when Derek nods.\n\"Here.\" He helps the werewolf to his feet and to his door, leading him to the bathroom and switching on the shower for him. \"Here's a towel,\" he reaches into the closet by the door, \"and a washcloth. I'll grab you some pajama bottoms, okay?\"\nDerek nods. When Stiles gets back to the bathroom, he's in the shower, the curtain pulled close around the tub. Stiles tries not to think about what Derek looks like naked. He's not very successful, but the much more vivid memory of Derek's exhaustion helps prevent any scheming on Stiles's part. Derek needs so much more than he can offer him tonight, but he also needs much less than the physical contact Stiles wants to give him.\nNot tonight, Stiles tells himself, getting Derek a glass of water from the kitchen and thanking whatever wolfy and non-wolfy gods there may be that his dad is still at work. When Derek comes back into Stiles's bedroom, dressed in soft sheep-decorated bottoms that are too big on Stiles and much too small on Derek, Stiles is sitting at his desk again, scrolling through pages and pages full of intricate designs which supposedly bring power to the person who draws them. Stiles thinks it looks a lot like bullshit, but then, a werewolf is falling onto his bed and saying, \"Can you come here?\", so his bullshit meter may be a bit off.\nHe moves to the bed and lies beside Derek, wrapping one arm around his stomach and kicking a leg over him. Derek sighs.\n\"Did you run today?\" Stiles asks, after a long stretch of silence during which Derek's breathing evens, but doesn't deepen enough for sleep.\n\"Yeah.\"\n\"Far?\" Stiles asks, even though he supposes that's obvious.\n\"As far as I could.\"\n\"But you came back?\"\n\"Of course.\"\nStiles lets his fingers play over Derek's stomach, running over the hardness of his muscles and splaying so his nails dig into the skin. \"I almost ran away once,\" he tells him, knowing that this is not the same thing, but not knowing what else he can say.\n\"When?\"\n\"Just before my mom died. She took a long time to die, and I—if it hadn't been for me, she never would have gone in for a check-up. I had this obsession with flying, and I fell out of tree. When she ran to come make sure I was all right she tripped over a rock in the yard and sprained her ankle. She went to the doctors, and she must have had some idea that something was going on, I guess, because she asked them to schedule her for a full workup. They found cancer—breast, originally, but it had metastasized, and she hadn't been brave enough to go get it checked out until she was already there, and she was there because of me—and maybe it makes no sense but I still see it as my fault sometimes, and back then I really did. A few weeks before she died we went to see her in the hospital and you know—have you ever seen anyone die from cancer?\" No, Derek shakes his head, because all of his human family had died before cancer caught up to them, and the wolves would have kicked even that in the ass.\n\"They sort of fade. And sometimes it's fast—two months is fast, for cancer, that's merciful—but for my mom, it took longer, she just kept fighting. And she was beautiful, she had this hair that I used to love to play with when I was a baby, she had these eyes—my dad sometimes gets drunk and he goes on for hours about her eyes—and when she smiled…God, I don't know, Derek. When I was little I'd do everything to make her smile. And then there was the cancer and in the beginning, when she was fighting it, she was glorious and strong and everything she'd always been. And it began eating away at her, and it was inside her, you know, and it's so hard to hate something inside a person without beginning to hate them a little, too.\" Stiles pauses, breathing slowly. He can feel his heartbeat quickening, knows that it's not a good thing right now.\nDerek finds his hand and laces their fingers together, but he doesn't say anything. He knows what's needed right now, although Stiles isn't sure whether he or Derek needs this more. \"Which is a hard thing to admit now, and when I was ten I didn't know how to understand what was happening. I just knew that my mom had gone dull, was sagging, that her hair was gone and that she was being poisoned—that her body was poisoned and the doctors were poisoning her—and I got home from the hospital, stuffed some clothes in my backpack, and walked down the road. A cop picked me up a few hours later. I hadn't gotten very far, but I had gotten far enough away to realize that I could go anywhere in the world and I would still feel the loss of my mom. I would still know that she was leaving, and when she left, I would always know that she was gone.\" He breathes into Derek's neck, as if the scent of his soap on Derek's skin will ease the ache in his throat. \"I asked your uncle whether death was peaceful.\" Derek tenses against him, and Stiles can hear the catch in his breathing, but he keeps going anyway. \"And he said it wasn't, but I don't believe him. Because death has to be peaceful, after you fight for so long to stay alive.\"\nDerek rolls over and pushes his head into Stiles's neck. He's crying, tears on Stiles's skin and the collar of his t-shirt, and Stiles wraps himself around Derek as much as he can, holding him as he cries.\n\"I killed them, you know,\" he says, finally, and Stiles shakes his head against Derek's, chin dragging through Derek's hair.\n\"You feel like you did. You blame yourself. In your head, maybe you did. But Kate did the killing.\"\nDerek's breathing turns more rapid, and Stiles grips the back of his neck, presses a kiss to the top of his head, and then another one, before he adds, \"You let her in. But she would have found a way without you. She just used you, Derek, and you can blame yourself for that, but I refuse to blame you for it. Most people wouldn't blame you for it. The people who matter certainly wouldn't.\"\nDerek's hands have fisted in his t-shirt and he growls, the noise wet and caught somewhere between human and animal, \"How do you know about Kate?\"\n\"Your uncle told me.\" Stiles runs a calming hand down Derek's back, because he feels as if he's about to bolt. \"And we won't talk about it, okay, I get that you don't want to talk about it. It's in the past. I just wanted you to know that I don't consider what Kate did your fault. I just want you to know that you may hate yourself for the fire, Derek, but that I think of you and I think of how much you've lost and I know how that leaves a hole in a person, and I think of how you're worked around that hole, and how you are here right now, and how much I feel for you, and…I just want you to know that, okay. I want you to know that you're not defined by the fire. Or by what Kate did to you.\" And Derek isn't any calmer, so Stiles kisses his head again and says, \"And now I promise I won't ever bring that up ever again.\"\nDerek growls, but he doesn't pull away. He presses his tear-wet face even deeper into Stiles's shoulder and lets Stiles soothe him to sleep.\nStiles holds him through the night. He hears his dad get home around eleven, and is glad that he locked his door when his dad taps against it. He calls, \"Goodnight,\" and Derek snuffles into him, his teeth resting against Stiles's t-shirt.\nHe holds Derek as cars pass in the street and light up his bedroom with the swing of headlights. He holds him while the wolf dreams, squirming a little against Stiles. He holds him as the sky lightens, and a grey flatness falls over everything, and it begins raining. And he lets go only when Derek sits up, scrubbing a hand over slightly bloodshot eyes, and looks at where Stiles is lying.\nHe looks torn between speaking and escaping without saying a thing, anxious about how weak he seemed the night before, anxious about what they both said, and what neither of them did say.\nStiles sits up and brushes his thumb beneath Derek's right eye. \"I'm sorry.\"\n\"For what?\"\nStiles shrugs. There's too much, and not enough of it is Stiles's fault. \"All of it, you know.\"\nDerek rests his forehead against Stiles's and sighs. \"Thank you for being here last night. I don't know what I would have done—\"\nAnd it would be easy to make a joke out of this, guess that Derek would have torn one of the betas to bits, probably Jackson, which would have actually been sort of nice, but Derek looks vulnerable like he did when he first started spending nights in Stiles's bedroom, and Stiles just nods, the movement of his head jostling Derek's as well. \"Of course, Derek. Of course.\"\n\"No one has ever said 'of course' to me as often as you do.\"\n\"Well, probably because no one has ever meant it as much as I do.\"\nDerek kisses him, then, the tastes of their morning breaths mingling on their tongues, and it's stale and gross and also damn near the hottest thing Stiles has ever tasted, as Derek's hand catches the back of his neck and his lips demand as much as they can possibly take, and ask for more. Stiles's nails dig into Derek's back so deep he imagines that he can bury himself in the alpha. And then there's a noise in the hall and Derek is out the window, his dirty clothes still piled on Stiles's floor, his phone sitting beside Stiles's on the desk.\nStiles sighs and falls back against his pillows. He couldn't sleep last night and he won't be able to sleep now, so he rolls out of bed and moves to his desk, pulls out the bottom drawer and lifts out his favorite picture of his mother, one taken a few months before he fell and she went to the hospital for the first time. In it, she's sitting beside his father, her hand caught in his, looking at someone off camera. Stiles had taken the picture, so it's a little blurry with the shakiness of his hands, but it's easy to see that his parents are happy.\nHe's so glad that they were able to be happy.\n:::\nScott arrives at his front door later that afternoon, talking his way past Stiles's dad with a few comments about how much he misses Stiles and how he'll probably fail Stats if Stiles doesn't help him. His dad makes them sit in the kitchen, but it's better than nothing.\nScott follows Stiles up to his room to gather textbooks and papers, and Scott wrinkles his nose. \"Jesus, did you and Derek do it last night?\"\n\"No, God!\" Stiles snaps. \"Besides, I thought you didn't want to know?\"\n\"I don't,\" Scott hurries. \"I really really don't. It's just that it reeks in here. Of affection. Or something.\"\n\"Well, he was over last night.\" Stiles picks up Derek's cell phone from the desk, \"and he left this. I assume you're going over there after you leave here?\"\nScott nods and takes the phone. \"I'll deliver it to Master Wolf, friend Stiles. Why did he leave it?\"\n\"He heard my dad in the hall and got scared off. Speaking of, we should probably get back downstairs. I think the department solved whatever case they were working on; my dad looks as if he's ready to stay home for weeks.\" His father had settled on the living room couch with the last three month's issues of Sports Illustrated and a six pack of beer beside him. Stiles can't even bring himself to lecture his dad about the health-effects of beer—aside from the alcohol, and honestly—because the man looks so grateful to be able to sit at all.\n\"Are you ever going to tell your dad?\" Scott asks quietly, as they sit down at the kitchen table. \"Because I'm here now. We could break the ice with the vastly impossible story of how I became a werewolf. And then maybe you and Derek wouldn't even seem like a big deal.\"\n\"I'm thinking I should probably tell my dad that I'm slightly gay before I approach the dating a twenty-three year-old male werewolf I once accused of murdering his sister and whom you once accused of murdering a lot of people thing.\"\n\"You know, those were probably not our best lies.\"\n\"You think?\" Stiles glances up and catches the slight grin on Scott's mouth, and he smiles back. \"I think we'd probably do a lot better now.\"\n\"God, I hope so. Imagine if we hadn't gotten any better at lying.\"\nStiles groans. \"Well, I did tell my dad pretty recently that Lydia's family has a pet wildcat.\"\n\"Right. That was not exactly good.\"\n\"At least I wasn't the one who named the cat Roberta.\"\nScott chuckles into his textbook, and then asks, \"So what is the p-value again?\" and Stiles launches into a mostly helpful but partially confusing explanation.\nWhen Scott packs his bags to go he squeezes Stiles's shoulder and asks, \"Anything you want me to tell the big guy?\"\nStiles's dad is in the fridge, looking for something to snack on that is not carrots or celery. He won't find anything. His back stiffens at Scott's question, and Stiles glares at Scott before saying, \"Nah. Just tell everyone I said hi.\"\nScott has the grace to look a little embarrassed, then nods toward the door and says, \"I'll see you tomorrow then?\"\n\"We've got school. I'll be there.\"\nAs soon as Scott is out the door Stiles's dad emerges from the fridge with a bag of baby carrots in his hand and his eyebrows raised. \"Who is 'the big guy'?\" he asks.\n\"Jackson,\" Stiles lies. \"Have you seen his muscles?\"\nHis father hums disbelievingly, but doesn't press. He should, Stiles thinks, but he's glad he doesn't.\nDerek climbs into Stiles's bed around eight that night. He smells of dirt and the forest and he pillows his head on Stiles's lap, beneath the book Stiles is reading. He waits a few minutes, then begins tugging at the book, and Stiles sighs and sets it down.\nHe lets Derek pull him down so he's lying with Stiles's arms around him, and then he buries his head in Stiles's pillow and falls asleep. Stiles follows his lead, breathing easily into Derek's shoulder.\nHe wakes up around ten to a noise in the hallway, his dad saying his name, and the knob on his door turning. He swears, \"Fuck, Dad, don't!\" as the door opens.\nDerek launches out of bed at the noise, crashing into Stiles's bedside table and landing on the floor in what would be a terribly comical heap if the situation weren't so awful.\n\"Stiles.\" His dad is standing in the doorway, his face pale, his gaze darting from Derek's shirtless, pajama bottom-clad form on the floor to Stiles sitting up in bed, in a t-shirt and his boxers, the sheets on the ground and everything looking far too guilty for any lie to be believable.\n\"Fuck,\" Stiles says again, rubbing a hand over his face.\n\"Derek Hale.\"\nDerek has not moved. He is pressing his face into the floor as if he can drown himself in the carpet. Maybe he can. Or maybe—and Stiles can see the way he's shaking now, the way his fingers are curved inward toward his palms. He's fighting the force of the transformation, but he's stressed, of course he is, and his body is telling him to change.\n\"Fuck,\" Stiles says, one last time, and then he slides over onto the floor and presses a hand over the triskelion on Derek's back. He glances up at his dad and says, \"So, um, I'm sort of gay?\"\nAnd his dad falls back against the doorjamb, letting his head fall back, too, so he's looking at the ceiling for an instant. Stiles takes advantage of that moment to press his hand over Derek's, to draw his claws out from his palm and press down on them, and Derek's breathing slows, and his fingertips reappear against Stiles's, and thank God at least that won't come out by Derek exploding into a werewolf in Stiles's bedroom. He lets go of Derek and looks back at his dad, who has shut his eyes and appears to be counting. Or praying.\nDerek pushes himself up with his arms, reaches for the t-shirt he left on Stiles's chair earlier that evening and pulls it on. Stiles doesn't think he has enough strength in his legs to stand up.\n\"Sheriff, sir.\" Derek crosses the room with his hand outstretched, which is a stupid idea, but Stiles can't get a hold of his tongue to tell him so.\n\"Derek Hale,\" his dad repeats, opening his eyes and keeping his hands in his pockets. \"Will you please sit down?\"\n\"Of—of course.\" Submission is not a good look on Derek. It clearly fits him wrong, but he sits down at Stiles's desk anyway, keeping his hands pressed beneath his thighs and his eyes down. If his dad knew what Derek was saying with his body language…well, he'd probably be even more freaked out than he already is.\n\"Sort of gay, Stiles?\" His dad crosses the room and kneels in front of him. \"And this wasn't something you felt like you could tell me?\"\n\"I felt like I could tell you that,\" Stiles protests. \"I did. I mean, I sort of told you that time at the club but I guess, I guess not really,\" he says, when his dad squints his eyes in a disbelieving way. \"Just the fact that I realized I was gay around the same time that I realized that I sort of had a crush on Derek Hale was more the problem.\"\n\"You accused him of murder,\" his father reminds him, and Stiles risks a glance up at Derek, who's staring down at his pants as if he could disappear in the pattern if he tried hard enough, \"twice.\"\n\"Admittedly.\" Stiles stares at his hands. \"But I didn't know him then. I mean, he does sort of look,\" but no, now is not the time to remind his father that the guy he found in his son's bed looks shady, \"anyway, after I got to know him I realized that he is really not made out to be a murderer, not at all. He's much too nice.\" Which would get Stiles shoved against the wall any other day, but Derek just tries to make himself look smaller.\n\"And how did you get to know him?\" His father is breathing slowly, but his hands keep fisting on his jeans, and he looks as if he'd like to kill someone. Either Derek or Stiles, and Stiles thinks he's probably more at risk at the moment. \"You realize he's twenty-three?\"\n\"Yes, yes. We've been over that. It's a bit of a complication,\" Stiles admits. \"But I got to know him through Scott.\"\n\"And how does Scott know him?\"\nStiles became a part of a world his father doesn't understand and suddenly everything is falling away. Stiles wants Scott there, and his mom, and a beer for his dad, and whiskey for him, and something to make Derek stop looking like he's a dog someone's kicked around for his whole life. Stiles takes a deep breath and stands. His dad follows him, looking him in the eye as Stiles casts around for a way to explain this without inaugurating his dad into the whole supernatural side of things.\nDerek speaks then, \"Stiles,\" he says, soft. \"You have to tell him.\"\n\"But,\" Stiles begins.\nDerek interrupts, \"There's no lie big enough that will cover it all anymore. You have to tell him.\"\nHis dad is looking between Derek and Stiles, confusion mixing with anger mixing with hurt in the twist of his mouth and the narrowing of his eyes. \"What the hell are you mixed up in, Stiles?\" His voice is hard, relaying only anger.\n\"A lot of magical stuff,\" Stiles squeaks, and then curls his fingers in so his nails dig into his palms because that could have come out better.\n\"What.\" His father glances from Derek to Stiles. \"What the hell? You expect me to believe—\"\nAnd then Derek's phone rings. It rings and rings and rings, and all three of them turn to look at it where it sits beside Stiles's on the bedside table. Nobody picks it up. Derek doesn't even shift in his chair.\nAs soon as Derek's stops ringing, Stiles starts. And Stiles flinches towards it, because if they tried Derek first then it was actually life-or-death important. His father says, \"Don't you dare,\" but he does dare, because it is Scott on the other end and someone could be dead or dying.\n\"This had better be important,\" he says when he answers it.\n\"They've got Danny. Damn it, Stiles. They have Danny.\"\n\"The alphas have Danny? Why do the alphas have Danny?\" Derek jerks to his feet, crowding in close so he can hear Scott too.\n\"We don't know. Why the fuck would the alphas take Danny? Out of everyone—\"\nAnd then Stiles thinks about strategy and weakest links and, \"To get to Jackson,\" he interrupts. He's looking at Derek because he can't look at his dad. \"Of course, to get to Jackson. He's the most susceptible of us. If they hit him, and he hits back, then they have a better chance at breaking us. Where is Jackson, Scott?\"\n\"He doesn't know yet, he was off duty. He's at Lydia's, I think.\"\nStiles raises his eyebrows at Derek, asking for permission. Derek nods. \"Okay. You call Lydia and tell her to stay with him. Send Allison and Boyd over, too. They'll keep Jackson calm. I'll call Chris and let him know what's going on. He'll be at the Hale house as soon as I'm done filling him in, and then you will all work out a rescue plan. Together.\" He speaks slower, repeats himself, \"You will work out a rescue plan together, and if anyone has a problem with that then they are sitting this one out. That 'anyone' includes Peter Hale.\" He almost growls the name. \"And, Scott, remind them that this is Danny. Remind them of that often. Danny was never meant to be collateral. We were supposed to protect him.\" He bites his lip. Swallows. \"Derek will be there in a minute. I'll call Chris. Don't do anything stupid.\"\n\"Never.\" There's something like fear beneath Scott's laugh.\nStiles hangs up and looks up at Derek. \"Where do you want me?\" he asks.\nDerek glances over at Stiles's dad. Stiles still can't bring himself to look. \"Tell your dad as much as you can,\" Derek says, \"in as short a time as you can. And then I want you with Jackson, Lydia, Boyd, and Allison. You said he needs an ally. I need you to do that now.\"\n\"Okay,\" Stiles nods. \"Okay.\" He reaches up, brushes a thumb under Derek's eye. \"Please don't be an idiot.\"\n\"I'm not ever.\" Derek leans in close and presses a quick kiss to Stiles's mouth. His dad makes a choking noise. And then Derek snatches his phone from the bedside table and leaps from the window.\nStiles stares at the space he vacated and calls Chris Argent. \"They've captured a human named Danny. He's best friends with Jackson, so we think they're trying to get to him. They need the hunters at the Hale house—you're all going to work out a rescue strategy. This isn't about killing the alphas, it's about rescuing Danny first. You need to make sure your hunters know that.\"\n\"They'll understand,\" Chris says, and it sounds almost like a promise, which is nearly enough for Stiles.\n\"Good. Get there as soon as you can, the wolves aren't patient.\"\n\"I know that,\" Chris snaps. \"Will Peter be there?\"\n\"Probably.\"\nChris groans. \"And Allison?\"\n\"She's with Jackson. I hope you've let her have her crossbow back,\" his dad makes another choked sound, \"she may need it.\"\n\"Yeah. Yeah, she has it. Will you keep her safe?\"\n\"She'll probably end up keeping us safe, Chris. Don't forget, this is about Danny first, alphas second, and my pack not at all.\"\n\"I'm aware.\"\n\"Good. I'll see you when it's done, then.\" He hangs up the phone and finally turns to look at his dad. He's sunk into the desk chair, his hands flat on his thighs, his breathing almost steady, but with a slight hitch at the end of each exhale. He's staring at Stiles.\n\"If I understood as much of that as I thought I did, then I am in way over my head,\" he says. Stiles nods.\n\"Yeah. Yeah, you are. And I'm sorry, I should have done this sooner, because now there's no time for me to be delicate. This needs to come out because I need to go. Werewolves exist. Werewolves exist, and so does a lot of other supernatural shit, but the most important at the moment are werewolves. Scott got bitten last year—remember when you found Laura Hale's body? He got bitten that night. And Derek Hale is a werewolf too, he was born one. He didn't bite Scott, but he helped him a little in the beginning.\" His dad breathes out and then in and Stiles realizes that he is not doing a good job at this. \"Damn, Dad. I'm sorry, this is really not going how it was meant to go. It was supposed to be Scott and Ms. McCall and you. Ms. McCall would calm you down after Scott went all furry and fang-y and eye-glow-y and you really weren't meant to find out about Derek and me until I was twenty at least.\"\n\"And the fact that you intended to keep lying to me for three more years is meant to make me feel better? Wait,\" his father grips at his shoulder with his hand and it's his left shoulder and Stiles thinks of heart attacks for a moment, before he can shut his brain up, \"Wait. Ms. McCall knows?\"\n\"She found out the night at the police station—she saw Scott all wolfed out. And she looked at him like, God, I don't know. Like you're always looking at me, except with as much fear as disappointment.\"\n\"I'm not,\" his dad starts, but he stops himself before Stiles can interrupt and tell him that he really is. \"It's just, all these lies, Stiles.\"\n\"I know, I know. And I feel like absolute shit about them. And after this is over, after we get Danny, then I will sit down and you can ask me any question you want and I promise, I swear, I will answer you honestly. But right now I need to go, because a pack of alpha werewolves has captured our friend Danny as part of their nefarious plan to break our pack and turn the whole town, and I'm really really sorry, Dad. I'm so sorry, but I need to go.\"\n\"But—if someone's being hurt, the police should be involved.\"\nStiles lets out a brief laugh and it sounds harsh, harsh like the way Peter laughs when the world is falling down and he's reveling in the chaos. \"That is a bad idea. We're dealing with supernatural creatures here. The police department can do nothing.\"\n\"But you just called Chris Argent, didn't you? You did.\"\nStiles is rummaging through his drawers, pulling out jeans and a t-shirt and a black hoodie. He gets dressed while his dad watches, knowing that his dad can see the evidence of Derek's teeth and tongue on his chest and only caring when his dad inhales again, like something's sitting on his lungs. \"The Argents are a special case. They've been hunting werewolves since the beginning of time, practically. It's a family business. At the moment they're allied with us. It's shaky at best, but Allison is a pretty strong tie. She mostly doesn't want any of us to die.\" Except for Derek, sometimes, although even that hatred has faded because they've fucked each other's families over so many times that it's almost as if they've reached a balance.\n\"Jesus,\" his father curses, and Stiles nods in sympathy.\n\"I know, it's a lot to take in, and I was there when Scott first turned. It's insane and it doesn't seem real and, like, Allison Argent waving around a crossbow is a bit of a strange picture, but I promise I will tell you about it in a more coherent manner when this is all over. Right now I need to go. Can I—do you want me to take you to Scott's? His mom can probably help a little with the adjustment.\"\n\"Allison with a crossbow,\" his dad repeats, and Stiles shakes his head.\n\"It's all perfectly natural when you see her, believe me. But Dad, Ms. McCall? Yes?\"\nHis dad nods, slow. \"I guess.\"\n\"Great, come on.\"\nStiles goes into the desk drawer in the kitchen, where he finds the keys to his Jeep, and pushes his dad out the door and into the passenger seat of the car. He speeds down the street, slowing only when his dad starts making sheriff-like noises of protest, and pulls to a stop outside of Scott's house without shutting the car off. He gets out and leads his dad up to the front door and rings the doorbell.\n\"Stiles? Sheriff?\" Ms. McCall answers it, wiping sleep from her eyes and wrapped in a fuzzy bathrobe. \"What's going on?\"\n\"I've sort of just spilled everything to my dad in the most incoherent way possible because he walked in on something and Danny's been captured and any chance you can sit with him while we pull a rescue mission?\"\nMs. McCall blinks twice and rests a hand on the sheriff's shoulder. \"Come inside,\" she says, her voice sympathetic. \"Everything will be fine.\"\n\"Thanks,\" Stiles shoots, and turns to hurry back to his still-running Jeep.\n\"Stiles,\" Ms. McCall calls, and his dad is looking at him, eyes lost and sad and sort of proud in a way that Stiles can't decipher quite yet, \"be careful.\"\n\"Always,\" Stiles answers, jumping into the Jeep and reversing at a speed that pretty much belies the word.\nAll in all, he thinks, as he races towards Lydia's house, that could have gone much better.\n\n:::\nJackson is handcuffed the iron headboard of Lydia's bed and Stiles really does not want to know where Lydia procured the handcuffs, or why, but they seem to be doing a fairly good job of keeping the growling werewolf in place. His eyes glow blue and his teeth dig into his lower lip, but he's not threatening to rip Lydia's bed through the wall in his efforts to get free, so Stiles supposes they should be grateful.\nHe'd seen Allison perched on the roof over Lydia's bedroom when he'd arrived, and Boyd is leaning against the window, trying to look nonchalant but giving away his tenseness from the set of his shoulders. Allison is on the roof both as a look-out and because Boyd trusts her about as much as he trusts Stiles, which is to say not at all. Keeping the two of them separated by ceiling and roof and walls is really the best idea.\nLydia is sitting at the very edge of her bed, her only sign of nervousness the way her right hand encircles her left wrist.\nJackson directs his growl at Stiles when he arrives in the doorway.\n\"Nice to see you too, buddy.\" Stiles moves across the room to stand beside Boyd. \"Any news?\" he asks, voice lowered.\nBoyd shakes his head, posture straightening.\nJackson growls, this time a few words coming out of the noise, \"Danny,\" and \"Let me,\" and \"Fucking idiots.\"\n\"Jackson,\" Lydia sighs, reaching out a hand and placing it on Jackson's shin. Jackson snaps at her, but she doesn't remove her hand. \"It'll be fine.\"\n\"You don't know that!\" Jackson's howling, and Stiles knows that if they don't shut him up there's going to be a swarm of wolves all over them. They might be coming as it is.\n\"No,\" Stiles agrees, getting as close to the bed as he can without risking being in the way of Jackson's teeth. \"But see, they captured Danny in order to get to you. And if we give in to that then we know that everything will certainly not be all right. So keeping you here right now, while the others go to rescue Danny, that's the best we can do.\"\n\"It isn't,\" Jackson snaps. \"It isn't, it isn't, because I could help Danny.\"\n\"None of us want Danny to be hurt, but a few of us are a little more in control than you are. Not me, obviously, which is why I am here. But the others are going to get him. And as long as they have him but don't have you they have an incentive to keep him alive. And unharmed,\" Stiles adds, because the thought of Danny being tortured makes him sick. \"If they get you, Jackson, then we really need to worry about Danny. Right now you're protecting him by staying here. You are.\" He shoves himself into Jackson's space, glaring. His words hang on a bare growl, and Jackson presses back against the headboard before Stiles can remember that this is a werewolf and he really doesn't want to get his nose bitten off.\n\"Right,\" Boyd agrees as Jackson miraculously backs off of Stiles, the glow fading from his eyes and his teeth receding slightly. \"You stay out of their hands—paws—and you protect Danny.\" He puts a certain emphasis on the word \"protect,\" and Jackson is human again, muscles in his arms shaking against the handcuffs, but otherwise calmer than he's been since Stiles arrived.\n\"Good.\" Stiles returns to stand beside Boyd at the window as Lydia moves up to sit next to Jackson, hand wrapped around his. She's taken a glass container in her other hand, and Stiles assumes it's some sort of flammable cocktail. He hopes very ardently that they don't need to use it.\nBoyd lets his claws out and flicks them back in. Stiles wish he had some inane task that made him look threatening to occupy himself, too, and he glances at the bottles lining Lydia's bureau. Most of them look like perfume bottles, but Lydia sees the way he's looking at them and nods. \"A homemade arsenal.\"\n\"Can I take one?\"\n\"Better take two, if you're going where I think you are.\" Stiles nods and tucks one in his left pocket, and takes a large one in his left hand. He goes to the window and levers himself out onto the roof of the entryway beneath Lydia's window, then scrambles up the side, almost falling twice before Allison's hand appears.\n\"You're going to kill yourself,\" she says, but she sounds fond.\n\"It's too tense down there.\"\nAllison rests her chin against her crossbow. \"Like it's not tense everywhere. Is my dad out there?\"\n\"I think so. He said he'd help.\"\n\"Good.\" And she sounds almost proud of her father, which is both strange and very nice. \"And Scott?\"\n\"He's with the pack.\"\n\"On the Danny rescue mission?\"\n\"He'll be okay.\" He'd better be okay, because Stiles needs Scott like fish need water.\n\"Of course he will.\" Allison probably shouldn't be comforting Stiles, isn't this meant to go the other way? She reaches out and rests a hand on his shoulder anyway. \"Everyone will be fine.\"\nLies come so easily sometimes, it amazes him that he can still decipher them. \"Everything will be fine,\" he says, and Allison shrugs.\n\"Not for the alphas, though. They're dead.\" Allison's cold and threatening voice regularly leaves Stiles shaking, but tonight it just makes him feel proud, and like maybe they have a shot at coming out alive.\n\"Deader than dead.\" Stiles adds, for emphasis, and Allison snorts and rocks her shoulder against his.\n\"Think they'll show up here?\" Stiles asks after a long silence spent scanning the street in both directions.\n\"If they can get past the hunters, then, yeah. Jackson's scent is all over the house, and if they know enough to know that Danny is his friend then they definitely know what he smells like.\"\n\"Werewolves suck.\"\n\"Agreed,\" Allison says.\nThey sit in companionable silence, and Stiles is just starting to think that maybe the hunters and the other wolves have taken care of the problem when a shape blurs at the very end of the street, moving in the glow of light spilling from some family's living room window. He nudges Allison, and she whips her head around, and now they can see that there are three wolves there, and if Boyd hasn't noticed this then they're a little bit fucked.\nThey're probably a little bit fucked anyway, Stiles thinks, as Allison lifts her crossbow. \"Stop panicking,\" she breathes, and okay, like that's ever worked.\nExcept it sort of does. And Stiles's sudden calm may have more to do with the fact that he remembers that he's armed with two chemical bombs, but Allison's practiced posture beside him and the way she's somehow managing to remain calm is definitely helpful.\nStiles's hand fists on the first of the bottles as Allison looses an arrow. The wolf she's aiming for dodges, so the arrow snags in the skin at its shoulder, and it lets out a howl but barely slows at all.\n\"Shit,\" Allison hisses, and it occurs to Stiles that maybe she's as terrified as he is.\n\"Calm down,\" he says, and drops the bottle on the wolf just as it lunges forward in a partial limp to claw its way into Lydia's bedroom. The bottle lands on its forehead, and its howl turns into a scream as flames burn through its skin and it falls backwards into the rosebushes beneath Lydia's bedroom, limbs flailing between human and animal, and Stiles tugs the second bottle from his pocket to fight off the sudden sick feeling in his stomach.\n\"Good one,\" Allison says, loosing another bolt and taking the second wolf clean through the eye. Its claws scrabble at the rod sticking from its head, and Stiles glances at Allison, holding up the bottle. She tilts her head, waiting. If the bolt is lodged deep enough in its brain it should kill him. If not…then Stiles can go.\nThe wolf howls and Stiles tosses the bottle as lights flash on in the house across the street, and two more wolves are converging on the house. Another bottle spirals out of Lydia's bedroom, landing on the back of one sniffing around its fallen companion in the rosebush. The fourth is halfway up the wall by the time Boyd barrels from the window, and the two fall clasped together into the garden.\n\"We're fucked.\" Stiles can hear the sound of a siren in the distance. \"We are so so fucked.\"\n\"Um,\" Allison mutters. \"We need to get out of here.\" And she's creeping over the edge of the roof, toward Lydia's backyard, and Stiles scrambles after her. Which was apparently a good idea, because there's a single werewolf leering on the edge of the roof, and he's got his claws in Allison's shoulder.\nStiles first thought, of course, is how dead he's going to be when Scott finds out about this. And then he realizes how dead he's going to be when the police find them first. And then he sees how Allison is biting on her lip, as if to keep from screaming, and then he realizes that maybe death isn't quite as imminent as expected, because she's still hopeful.\nHe can't shoot the wolf. He can't hit it with a Molotov cocktail, because he doesn't have one and Allison would be in the way if he did. But he can talk. \"There're police down there, you know, and maybe you don't want to get caught? I mean, I don't know, maybe that's the whole point, unearthing the whole supernatural side of the world to a bunch of random police officers, but it honestly doesn't seem exactly the right way to go about a stealthy takeover. Sort of leaves the stealth out of it.\" Allison rolls her eyes at him, but the wolf's claws seem to be loosening on her shoulder, and Stiles counts that as a good thing. \"And there's the whole molesting a very well-loved daughter of the town thing. Not exactly ideal. Like, sorry, or whatever. But I think your plan leaves a lot to be desired.\" And then the claws are out again, and its teeth are against Allison's neck, and Stiles launches himself forward because this cannot happen, not ever, not tonight, not to Allison.\nThe three of them bowl off the roof under the combined force of Stiles's velocity and gravity (and okay, if gravity had a bit more to do with it, then fine) and they splash into Lydia's pool. Stiles struggles, swimming with his eyes squinting through the green haze of chlorine, and grabs Allison's hand, swimming away from the werewolf. He is caught between human and alpha form, and trying to doggy paddle, and so Allison and Stiles managed to get out of the pool before he even seems to have regained awareness. They run through the gate at the end of the yard, and continue running, deeper and deeper into the woods until they can barely hear the sounds of the sirens over the wind in the leaves overhead.\n\"Fuck,\" Stiles says, leaning down and resting his hands on his knees. \"Fuck.\"\n\"The others?\" Allison manages, finally.\n\"If they made it out, they're probably at the Hale house. If not, they're at the police station.\" Or the hospital, but he can't say that, can't jinx it.\nThey breathe heavily into the silence and then Allison finally straightens. \"Let's go to the Hale house, then.\" They're dripping water and their clothes are clinging in attractive—on Allison—and embarrassing—on Stiles—ways, and this whole night is just terribly uncomfortable. And awful.\n\"Do you have any weapons on you?\"\nAllison reaches down and tugs a knife from beneath the hem of her jeans. \"This is it.\" Her crossbow must have gotten lost in the fall, or when the wolf grabbed her; the whole event still seems very fuzzy to Stiles.\n\"I hope the others had better luck than we did.\"\n\"To be fair, we're both fine,\" Allison points out, as they continue through the woods.\n\"Yeah, but we have no idea about the others. And we sort of brought the whole police force down on us.\"\n\"We didn't really have any other option. We couldn't move Jackson without risking him escaping.\"\n\"I know that,\" Stiles snaps. \"I'm just saying.\"\nThey move in silence—or as much silence as they can manage in the woods, which is not much. And then Allison says, \"Oh, shit, your dad.\"\nStiles shakes his head. \"He sort of walked in on me and Derek snuggling earlier, so he got an earful already. Although I'm sure the presence of crossbows and firebombs at the scene will totally reassure him that the wolves I'm caught up with are good ones.\" He hopes his dad doesn't get called into this, but it's pretty obvious that he will. His dad has hopefully regained enough self-awareness after the shock of it all to not tell everyone that the charred corpses are werewolves and that the people who killed them are the good guys.\n\"I am really tired of killing things,\" Stiles mutters as they get deeper into the darkness of the woods.\n\"Me too.\" Allison reaches out and takes his hand. It's nice, in a sisterly sort of way, and he's glad for the moment that Scott was smart enough to fall in love with someone who's so sensible. Of course, she also happens to be a huntress, but he supposes one can't have everything.\nThe Hale house is dark when they arrive, which is unsurprising, all things considered. But Stiles hears noises from the entryway, and Allison clings to his hand harder as they approach the place where her aunt died. \"Sorry,\" he mutters, but she shrugs off her apology like she can just brush away all of her heavy past.\nJackson is chained to the stair railing. Lydia sits on the stairs, scrubbing at a smudge of dirt surrounding some scratches on her forearm. Boyd stands against the doorway between the hall and the living room, and he looks fine, aside from the fact that his t-shirt is in tatters.\n\"How did you get away?\" Stiles asks sitting down in the center of the entryway and pulling Allison with him, because trooping through the woods in the dark is tiring, and everyone else can deal.\nBoyd shrugs. \"I ran when the cops pulled up. They're going to have some serious covering up to do, if they want to ignore the presence of wolves now though.\" Stiles rubs a hand over his face. His poor father.\n\"And I told Jackson we were going to find Danny and the idiot believed me. We made it here before Boyd did, took the back door out.\" Jackson's contribution to the story is a growl and a tug against the wooden railing. It makes a slight splintering noise and Stiles curses. Lydia reaches out and places a hand on Jackson's head, but he doesn't calm down immediately.\n\"What about you two?\" Lydia raises her eyebrows at their linked hands and dripping clothes. Allison moves to disentangle their fingers, but Stiles holds on tight. He is not okay yet.\n\"Took a dive into the pool. Alpha didn't have quite the swimming prowess we did.\" And then Stiles remembers the wolf's claws digging into Allison's shoulder and he lets go so he can turn her to face him. He pushes aside the cotton of her t-shirt and sees that the creature didn't break skin.\n\"Ask much?\" Allison asks, pulling away, but he can tell she's shaken.\n\"You're fine,\" Stiles promises. Derek's done way worse to him, and it hadn't affected him at all.\n\"Well, good. I'd hate to wolf out on you all at the moment. That wouldn't exactly be ideal.\" At that, Boyd approaches them and kneels before her, inhaling deeply but without, Stiles is impressed, invading her personal space by shoving his nose right up against her skin.\n\"You're okay,\" he says. \"You still smell more of Scott than anyone else, under all the chlorine.\" Apparently chlorine is an unpleasant smell to werewolves, or at least werewolf Boyd, because he wrinkles his nose as he returns to his place by the living room.\nAllison relaxes a little beside Stiles, and Stiles lies out on his back, spreading his arms and legs out in an effort to let the air get to drying him off. \"Think they're going to follow us here?\"\n\"Possibly,\" Boyd grunts. \"Although it still smells of death, of werewolves dying, so most wolves will try very hard to stay away from it.\"\n\"Oh, good. So it's making you and Jackson even more uncomfortable but possibly protecting us from the big baddies and God, why does no one shut me up?\"\n\"Because if I knock you out and we get out of here, there's a good chance Derek will murder me,\" Boyd says. Jackson just growls and strains against the handcuffs again.\n\"Right.\"\nThey wait, and wait, and wait, and even Lydia is looking like maybe Jackson's got the right idea, now might be the time to go chasing after the alphas, and then grey light starts spilling through the windows and catching on the cobwebs and Stiles groans and flips to his stomach.\n\"Has anyone heard anything?\" His and Allison's cell phones were ruined by the tumble into the pool, and he hasn't heard anything from the others', but he doesn't know if they're on silent.\n\"No,\" Lydia says, checking both her cell and Jackson's where they sit on the stair beside her. Boyd shakes his head.\n\"Fuck.\" Stiles hits his head back against the floor.\n\"Your language could really do with some improving,\" Allison says.\n\"It's been a stressful night.\"\nThe light has just turned sunny green when Boyd practically leaps across the room and Jackson begins fighting against the handcuffs again.\n\"It's them.\" Boyd's voice barely hides his glee.\n\"All of them?\" Stiles asks, sitting up and standing to join Boyd in the door. Allison follows him.\n\"Yeah.\" Boyd glances at Lydia. \"You can let Jackson go.\"\nLydia's hand doesn't shake as she unlocks the handcuffs, and Stiles is really past being surprised at how calm she manages to be in every terrible situation they find themselves in. Jackson bounds away from her, but hesitates at the edge of the front porch, watching the woods to the right.\nScott comes out first, closely followed by Danny. Derek, Peter, and Erica fan out behind them, and Stiles can see Chris Argent and a few of the hunters still lingering in the woods. But Jackson doesn't pay them any attention. He leaps down from the porch and is hugging Danny in an instant, holding him so tightly that Scott has to dig his claws into the skin of the arm around Danny's shoulders to remind him that the man he's holding is human. Jackson growls at Scott, but he does seem to ease up on the hugging enough that Danny can at least hug him back.\nThe wolves circle Jackson and Danny, and Derek keeps shooting predatory glances towards Chris Argent. Allison waves at her dad, and he raises a hand, as if beckoning her over to him. But she latches onto Stiles, her hand gripping his, and shakes her head. She's not moving. She's chosen her side.\n\"Are you sure this is a good idea?\" Stiles asks her, murmuring. Derek and Scott turn their faces towards him, eyes glowing red and yellow, but otherwise still unmoving in their protective circle around the reuniting friends. Jackson has backed off of Danny a little and is saying something, too low for Stiles to hear.\n\"It's time,\" Allison tells him, and Lydia rests her chin on Allison's shoulder, and the three humans wait for the wolves to move toward the house.\n:::\n\"When you think about it,\" Danny says, \"werewolves make a lot more sense than all of you being involved in some sort of drug gang or something.\"\nThey're sitting at a long table, made up of several small tables, in the middle of a diner on the outskirts of town. They're not the most underdressed of everyone in the diner, which is saying something, and Danny is glancing down the table at Stiles as he talks, like that isn't a dead giveaway.\n\"Especially Stilinski,\" Danny continues, and okay, that is an even deader giveaway.\nStiles drinks his coffee and ignores the way everyone chuckles around him. \"I could be in a gang. If I wanted to. I just don't, because hey, drugs are bad. As is violence.\" And he sits on both of his hands because they're shaking again. Derek presses a hand to his back, between his shoulder blades, as Jackson smirks.\n\"Right, Stilinski,\" Jackson says, and Stiles is tempted to point out that he wasn't so sure of himself the night before, but one really cannot be responsible for what happens when their best friend is captured by bloodthirsty supernatural human-animals, so he keeps his mouth shut.\n\"So no more alphas?\" Isaac asks, pushing his pancake around in his syrup and not looking at anyone.\n\"No more alphas,\" Derek agrees.\n\"Except for Derek,\" Peter points out.\n\"And no more Argent alliance?\" Boyd asks.\n\"That is mostly up to Chris,\" Stiles says, earning himself a surprised glance from almost everyone at the table. \"Honestly, after fighting the bad guys with you yesterday, how could the hunters not love you? And Jackson and Danny's reunion was so touching,\" Danny kicks him under the table, unnecessarily, because Jackson is growling and Lydia is glaring, \"that I can't imagine they'd really want to kill any of us anymore.\"\n\"And there's me,\" Allison adds.\n\"Yeah, there's also that. If Allison's dad wants to go against the pack, then he's going against Allison, which is pretty much a no-no in the Argent rule book. I'm just hoping that the rest of you conducted yourselves well enough last night that the rest of the hunters will consider allying with us.\"\n\"Are you certain that's a good idea?\" Peter asks, voice low. Stiles opens his mouth to answer, but he's looking at Derek.\n\"I think it could be. It could also be a very bad one. We'll have to try it to see.\" Derek stares at his uncle until the older man lowers his eyes.\n\"Hey, Stiles?\" Scott looks up from the cell phone he's been tapping at for the last several minutes. \"My mom says your dad is about to have kittens. She says he's been trying to get a hold of you since he got called to a crime scene at Lydia's last night.\"\n\"Oh, shit.\" Stiles drops his head. \"I forgot, I can't believe I forgot.\" He drops his fork onto his plate and says, \"Come on, Scott, we need to go explain some stuff to my dad.\" Standing, Stiles rests a hand on Derek's shoulder, because the alpha set his fork down, too. But this needs to be slower, and less overwhelming, and a brooding Derek is probably not a good way to go slower and is definitely not a good way to be less overwhelming.\nScott pushes back from his seat slowly. \"You mean…?\"\n\"I mean that we need to go.\" Stiles grabs Scott's arm and pulls him from the restaurant.\nHis father kicks everyone else out of his office, even though they're clearly involved in the process of working out whom or what was killed at the Martin's the night before, and who did the killing. They know what did the killing: homemade Molotov cocktails and crossbow bolts.\nThe sheriff's deputies grumble a little, but he is looking murderous, and so they abandon him to his fathering and return to their offices, where they're undoubtedly flipping through photos of the crime scene and coming up with increasingly far-fetched explanations.\nHis father glares at Scott and Stiles. Stiles tries not to cower. Scott gives up entirely and lowers his head.\n\"Is everyone okay?\" he asks eventually.\n\"Yup,\" Stiles nods. \"Yeah everyone's good. Great. Peachy.\"\n\"Except for the four 'unidentified creatures' we found at your friend Lydia's last night?\"\n\"Oh, well, there may be a few more of those. But they were bad.\" Stiles stuffs his hands in his pockets; they're shaking and he's thinking of fire and fire and burnt fur and the way howls turned to screams as the alphas got caught between their forms.\n\"Right.\" His dad sits heavily in the chair behind his desk. \"Okay.\" He breathes. \"And why didn't you let me know you were okay?\"\n\"My phone fell in the pool.\"\n\"And none of your…friends have a phone?\"\n\"Yeah, that was a massive oversight on my part. I'm sorry. I was a little distracted.\"\n\"Right,\" his dad repeats. \"Okay, Stiles, sit down. We are going to have our very honest Q and A session right now.\"\nStiles sits.\n\"Scott, you can go.\"\nStiles throws a panicked look between Scott, still lingering by the doorway, and his father. \"But,\" he says.\n\"But nothing. I saw enough last night to believe anything you tell me. I don't need Scott to—do anything, especially not in the middle of the police station. Go home, son,\" he tells Scott.\nScott shoots Stiles a sympathetic look. \"Stiles?\" And that's new, Scott doesn't usually wait for Stiles to give him orders.\n\"It's fine, dude.\" He bounces his foot up and down, his left leg carrying out the jittering of his whole body. \"Go see your mom. I'll call you later.\"\n\"Do you want me to tell Derek anything?\" Scott offers, as he gets near the door, and Stiles's dad's eyes shut for a painful instant.\n\"Just, no, I don't know.\" Stiles tries to swallow the panic in his throat. \"Tell him I'll see him later, okay?\" And he knows he sounds really really vulnerable in a way that hurts, and Scott crosses the room to squeeze his shoulder before leaving. His dad is staring at his hands because Stiles is still a disappointment, even though his dad knows his reasons for lying.\n\"Okay,\" his dad coughs. \"Okay. The beginning. Who bit Scott?\"\nSo Stiles tells him about Peter Hale and Laura, and he tells him how Derek did not kill his sister. He leaves out some Derek's more threatening moves, because he's fairly certain his dad isn't okay with them dating even without hearing about the constant slamming-up-against-walls thing. And then he tells him about the hunters, and his dad's hands fist on the desk at the fact that Chris Argent almost killed Scott, and so he has to side-track to tell his dad that Chris actually has some good qualities, it's his father who was really the basket-case. And then he tells him about Kate and Peter and how they died, and how Stiles has seen death, a lot of it, caused some of it, and his dad's eyes shut again.\nAnd then he gets to the Kanima thing and his dad drops his head into his hands.\n\"So,\" Stiles says, once he's finished explaining how Scott had poisoned Gerard Argent, kind of, but that was okay because Gerard Argent had punched Stiles and killed people and wolves, \"that's what I wasn't telling you.\"\nStiles counts to twenty before his dad finally speaks. \"And Derek?\" he asks, which Stiles should have seen coming, but kind of didn't, because honestly werewolves and lizards and sad angry old dying men who have a vendetta against Stiles. All of that should have distracted his dad from the attractive older man thing.\n\"Derek?\" Stiles repeats.\n\"He was in your bed, Stiles.\"\nStiles thinks that, Yeah, he does that, may be too flippant a response. \"That sort of…happened? Like I hated him and he hated me and then we realized we weren't really fighting against each other, like we were kind of on the same side, and he—I don't know, Dad, he makes everything seem a lot easier.\" Stiles's voice drops off, goes low and soft, and he can feel the blush burning up his neck. \"And I know that sounds weird and dumb and I guess it is, but we just…we work? And I'm sorry you found out the way you did—about all of this—but I won't apologize for Derek.\"\n\"Stiles, he's…\" his dad drops off.\n\"I know, I know. He's older and he's a werewolf, but so is Scott, and, I don't know, Dad. I like him.\"\n\"If I told you you couldn't see him?\"\n\"It wouldn't work,\" Stiles says. \"Because I would try, I swear I would. I love you, Dad, and I couldn't hurt you like that, or I wouldn't want to. But we would see each other, because something would happen and I'd be drawn to the pack again, and I can't just—abandon them, abandon my friends, because you don't trust Derek. You should trust Derek. He's got a terrible past, but he's more trustworthy than anyone I know.\"\n\"And you love him,\" his dad says, the words coming out as a sad sigh.\n\"And, yeah, I guess I do.\"\nHis dad drops his head to the desk, and Stiles reaches a tentative hand over to press to the top of his father's head. \"It could be worse?\" he suggests. \"I could've been bitten.\" And oh, yeah, that's right, he totally did not tell his dad that Peter Hale offered to do just that.\nHis dad jerks his head up. \"You weren't, right?\"\n\"No, Dad, no! God. I wasn't. I'm not. Still one hundred percent human, here.\" Stiles waves a hand at his body, which is not the best idea, since he's still in the dirty, water-rumpled clothes from the night before.\n\"Okay,\" his dad says. \"Okay.\"\nHe reaches for Stiles's hand and holds it over the desk, and then he asks, \"And last night? You were at Lydia's?\"\n\"I'm not telling you about last night, because I don't know everything, and because if you know anything more, you'll feel like you need to tell somebody, and this could ruin your career. Because people aren't going to believe you, and if they do that's almost worse. So last night is off limits, for now. Everyone's fine, we got Danny out.\"\n\"You're teenagers.\" If Stiles weren't used to his hand being squeezed to pieces by werewolves his dad's grip would be killing him. \"You're just teenagers.\"\n\"And we've dealt with a lot of shit as teenagers. And it's not normal and probably not natural, but we have to deal with it, and so we do. I'm sorry that this is how it's going down. I really am. But this is my life.\" And he tries not to sound like he's happy about it, but there's something about belonging that overwrites even the sick way he feels after he kills someone.\nHis dad drops his head to his hands again. \"Okay. I'm going to take you home, and then I will come back here and deal with last night, and tomorrow evening you are inviting Derek over for dinner.\"\n\"Oh. Um.\"\n\"Stiles. You say you love him. I'm not going to let him out of my sight ever again.\"\n\"Oh. Okay. He's not exactly amenable to being stalked.\" Just to doing the stalking.\n\"He will be if he wants to be with you,\" his dad says. \"And no more sleepovers.\"\n\"Is that negotiable?\" Stiles asks, as he follows his dad to the cruiser.\n\"No, not at all.\"\n\"It's not like we did anything,\" Stiles whines.\n\"I define hand-holding as doing something. And you've definitely done more than that,\" his dad has this growl thing down almost as well as Derek does. \"Not until you're eighteen.\"\n\"Fine,\" Stiles mutters. There's still the subway station. And all right, the wolves are there, but they can deal with a little PDA.\n\"And I'll set Scott on you if you're at Derek's hang-out.\"\n\"So not fair,\" Stiles mutters. \"His mom isn't keeping him off of Allison.\"\n\"I'll have a little chat with Melissa about the one year age difference between them, if you'd like me to,\" his dad says. Stiles rolls his eyes. He wishes he had a time machine, just so he could speed his own aging up by about a year. It would be nice to burrow into Derek right about now.\n\n:::\nDerek arrives the next night carrying a cake that Stiles is ninety percent sure Isaac baked. He is freshly showered and looks terrified.\n\"It's just my dad.\" Stiles opens the door and lets Derek in, which, yeah, weird. He looks a lot more natural climbing through windows. \"You didn't even look this nervous when he hauled you in for murder.\"\n\"I hadn't committed the murder,\" Derek growls. \"But I was in your bed.\"\n\"It's not like we did anything.\" Stiles directs Derek towards the kitchen and his dad glances up from the stove, where he's got chicken sizzling on a skillet. He wipes his hand on his jeans and holds it out.\n\"Derek, it's nice to see you in the daytime. And not in the back of my cruiser.\"\n\"You too, sir.\" Derek shakes his hand and, judging from the sheriff's wince, just barely manages not to crush his fingers. Stiles slips his pinky through Derek's belt loop like he can keep the wolf from a nervous explosion just by hanging on.\n\"Seriously Dad?\" Stiles jumps in. \"You need to bring up the arrest thing? Like this isn't awkward enough.\" Like he hadn't just brought it up a few seconds ago.\nHis dad raises his eyebrows at him. \"If this is going to be a long-term thing, we should probably get the awkwardness out of the way first. Don't you agree, Derek?\"\n\"Absolutely, sir.\" Derek's voice doesn't even sound like a growl. It just sounds like the voice of a nervous guy meeting his boyfriend's dad, a man who happens to have several good reasons to mistrust him. It is freaking Stiles out pretty terribly.\n\"This is awful,\" he mutters into his shoulder, and Derek shoots him a grimace that says that he agrees, but his dad is smirking. Smirking. He's officially the devil.\nThey sit down at the dinner table, his father at the head and Derek and Stiles sitting across from each other, and it feels crowded. Not wrong, just weird.\nHis father begins the dinner conversation with the totally normal question, \"So, Derek, do you do anything aside from act as big bad werewolf around a bunch of teenagers?\" And Stiles would be pissed, except that he's just really grateful that his dad didn't say, \"perving on my son,\" so he cuts into his chicken and waits for Derek to tell his dad that that's pretty much his life.\nBut Derek doesn't. \"Before I moved back here, I was working in advertising,\" he says, and okay, that's new. Stiles raises his eyebrows at him, and Derek kicks him under the table.\n\"Oh?\" Stiles's dad prompts.\n\"Yeah. I was still working the intern track, doing all the extra work mostly, the stuff fulltime employees didn't want to do, but I liked it. And then Laura,\" he shrugs. \"Stuff happened, and the werewolf thing became important again.\"\n\"It wasn't important?\" Stiles asks. \"Isn't it, like, who you are?\"\nHis dad glances at him, and okay, maybe he and Derek should have had this conversation before, but it's not so easy to talk about the past when so much of it is a gaping black hole of sorrow.\n\"It's what I am. But in New York, I was able to tamp it down. After the fire,\" he looks down at his plate, and Stiles kicks his leg up, presses his foot against Derek's knee, \"I was really not too thrilled with being a werewolf. Being me,\" he mutters, and Stiles's dad grunts like he understands. \"So I tried to forget it. Of course, it didn't always work, but it did sometimes. And then Laura needed me.\"\nStiles wants to pick at that, \"it didn't always work,\" but his dad is there and there'll be time for stories later.\n\"Have you thought about getting into advertising out here?\" his dad asks.\n\"Not really, no. The wolf thing is sort of full-time, at the moment. If things ever calm down, then I'd like to look into it.\"\n\"Is it possible that things won't ever calm down?\"\nBecause that would mean that Stiles is caught in this forever, and his dad is looking panicked.\n\"Possible,\" Derek admits. He glances at Stiles, his mouth and eyes soft. \"But I wouldn't say it's likely. When I was growing up it was mostly peaceful here. And Stiles and the others have done a lot to bring the hunters to our side. So it's possible things will get a lot better from here on out.\"\n\"Dude, don't jinx it.\" Stiles reaches across the table and grabs Derek's hand, forcing it to tap against the wood surface of the table. \"We don't want to mess with fate.\"\nHe lets go of Derek's hand only when he notices the way his dad is watching them.\nHis dad coughs and offers seconds. Stiles shakes his head, but Derek takes a second helping of chicken and rice, and then his dad gets up to get the cake from the kitchen and Derek raises his eyebrows at Stiles, a sort of \"How am I doing?\" look, and Stiles smiles at him, even though he really cannot read his dad at all.\nHe comes back in with three plates balanced in his hands and slides one in front of Derek and the other in front of Stiles, and sits down with his. As soon as Stiles and Derek have their mouths full of cake, the sheriff jumps.\n\"So,\" he turns to look at Derek. \"My son says he loves you, and I'm inclined to believe him. But Stiles has always loved the things that hurt him,\" Stiles stops chewing, lets the chocolate cake sit in his mouth, and remembers how he used to love birds, and how he'd jump from ledges and trees to try to learn to fly. \"Because Stiles does not exactly have the best sense of self-preservation ever, I spoke to Scott.\" Stiles needs to get a new phone so Scott can warn him when his father ambushes him. Derek is staring at his plate, head down. \"And Scott says that I am never to ask him about you guys again, but he also told me that you're good for each other.\"\nStiles drops his head to the table, narrowly avoiding landing in the cake. He's going to kill Scott.\n\"Now, ordinarily I wouldn't exactly trust a teenage boy's judgment on, you know, another teenage boy's dating habits.\" Stiles hopes his dad feels as awkward as he does. \"But Scott says that you calm Stiles down, Derek, and that you've been happier since this started, and he also mentioned something about smelling which I don't want to understand, but it seemed like a good thing. All of that being said,\" and here Stiles groaned into the table because this was the part he's been dreading, \"I expect you to treat my son with respect. I expect you to remember that he is many years younger than you, that if I get any hints that anything…untoward…is happening I will haul your ass into the station so quickly that you won't even be able to think about turning wolfy. And if you hurt him…\" he lets the threat dangle in the air, or tries to, because Derek is talking before he's even finished.\n\"I understand,\" he says. His foot presses against Stiles's beneath the table, and that's all that's keeping him from taking his fork and trying to kill himself with it. \"And I would never hurt Stiles.\" Stiles waits for him to spout of some nonsense about protection and belonging, but he doesn't. \"I really wouldn't,\" he repeats.\n\"You can sit up,\" his dad says. \"We're through.\" Stiles waits another three minutes before he listens, though, because he's really not that trusting.\n\"Well, that was great. Thanks for dinner.\" Stiles jumps out of his seat and grabs his and Derek's plates, dumping them in the sink and glancing at his dad. \"Any chance you'll be okay with Derek and I going upstairs?\"\nHis dad smiles at him. It is not a nice smile. \"You can watch a movie in the den.\"\n\"Great,\" Stiles sighs. Derek squeezes his shoulder and helps him load the dishwasher, and then follows him to the couch, where they sit close beside each other. They don't touch, though, because his dad shoots them a look and sits down in the armchair and flicks on the TV. So it's a father-son-son's-boyfriend movie night, then.\nStiles drops his head back onto the couch cushions and tries not to groan too loudly.\n\n:::\nStiles hasn't slept since the last night Derek was in his bed, the night of the fight with the alphas. This dependency was bad when they were actually able to spend nights together; now that his dad has restricted Derek to the lower floor of the house, Stiles is worried about never sleeping again. He knows that that reaction is maybe a little overdramatic, but he is really just very tired, and he is thinking longingly of snuggle sessions with Derek. Not of kissing Derek, or touching Derek, or anything else. Just sleeping next to him.\nHis dad takes his first night shift since he found out about everything three days after the Dinner, and Stiles sits at his window, hoping that Derek is fulfilling his creeper role and lurking, and therefore knows that Stiles's dad is gone and that it's safe to come in. But after an hour of tossing intermittent glances out of his window at the dark sky, Stiles has to admit defeat. It's possible that his dad has actually scared Derek off. Which is really just unacceptable. They were getting along so well before the whole reveal. Plus, Stiles really just wants to sleep.\nHe pulls out the phone he'd finally bought the day before and texts Scott. Because possibly a full-on game of Call of Duty will exhaust him enough to sleep. What're you up to?\nAllison responds. You can't have him tonight, Stiles.\nFine. As if Stiles wants to see Scott anyway.\nHe taps his phone against his chin for a minute and then texts Derek. Are you at the subway station?\nYeah. Is everything okay?\nWhy does everyone assume something's wrong? Or that Stiles is trying to steal away boyfriends from jealous girlfriends, honestly. Fine, he responds. Can I come over?\nIt takes a while for Derek to respond. Will you tell your dad?\n\"Fucking sheriff,\" Stiles mutters, and calls his dad while he flicks off his light and heads downstairs.\n\"Can I go to Derek's? Isaac and Boyd and Erica are all there, so we'll probably just play a lot of video games and I promise I'll be back home before too late and that's fine, right?\" He speaks fast enough that he hopes his dad will just agree to get him off the phone.\n\"Be home before midnight,\" his dad says, which, yeah, isn't going to happen, but Stiles has permission for something for the first time in what feels like a year, and so he nods.\nRemembering that his dad can't see him, he says, \"Great, okay, thanks. See you later.\" He hangs up before his dad can respond.\nDerek is outside when Stiles pulls into the lot outside the subway station, and he lifts a hand as Stiles steps out of the Jeep.\n\"Hey.\" Stiles brushes a kiss against Derek's lips, a brief meeting of lips that the werewolf returns but doesn't allow to deepen, meaning that his betas actually are inside.\n\"Do you want them to leave?\" Derek asks, soft enough that it's possible the others won't hear the question.\nStiles shakes his head. \"No. It's fine. I sort of just want to hang out.\" Plus, it's weird and nice not lying to his father.\nIsaac, Boyd, and Erica are sitting on the floor, PS3 controllers clutched in grips tight enough that the plastic has started to crack around the seams, and they barely glance away from the TV screen when Derek and Stiles come inside and collapse on the couch behind them. Derek lifts a fourth controller from between the cushions of the couch, and he holds it out to Stiles, but Stiles shakes his head and rests his temple against Derek's shoulder. The wolf shrugs, hits the start button, and bumps Stiles a little as he settles. It's unbearably comfortable. Sitting like this feels hopeful and ordinary.\nHe watches as Erica schools them all at Call of Duty. Derek plays video games terribly; it's actually embarrassing how bad he is. At some point he's going to need to train his boyfriend in the proper way to enact digital violence. He imagines how Derek's face will go all angry and hurt and amused when Stiles tells him that he's embarrassed by his lack of skill at first person shooting games—seriously, Stiles flails less in real, actual battles than Derek's figure does on screen—and he rests his head against Derek's shoulder and closes his eyes, just for a moment, and when he wakes up the TV is off and his head is in Derek's lap.\nHis cheek is pressed against Derek's jean-clad thigh, and Derek's hand is brushing over his short hair. Occasionally one of his fingers dips into the shell of Stiles's ear and leaves heat settling behind it. Derek's looking at him, an odd and soft expression on his face, and Stiles rolls his head to smile up at him.\n\"You've got jean prints on your cheek,\" Derek says, not like it's weird, but like it's something to wonder at.\n\"How long was I asleep?\"\n\"A while. The others went to get a late-night pizza. Do you have to go home tonight?\" He sounds like he wants Stiles to stay, which is good but also surprising, because he's so careful about not upsetting Stiles's father. \"Of course you do,\" he continues, when Stiles doesn't answer straight away. \"Sorry. I'm not used to…\"\n\"Us having to follow the rules?\" Stiles yawns, stretching his arms out and letting one fall back to his side while his left hand clasps Derek's neck for an instant before falling away. \"Me neither. But I guess you're right, we probably should.\" He lets the \"for now\" go unsaid. There's no way he's waiting a year to sleep with Derek. In the figurative sense.\nDerek rolls his eyes, clearly catching Stiles's intent, and shoves his shoulder so he falls off the couch in a long-limbed flail. Stiles sits up on the ground and Derek slides to sit beside him, both of their backs against the couch. Derek pulls Stiles close and kisses him on his forehead. \"Let's try to take it as it is, without looking too far ahead, okay?\" Stiles tenses under his touch, because he knows it's stupid but it sounds almost as if Derek doesn't see them as together in that \"far ahead\" time. Derek hurries, \"Don't, Stiles. Don't freak out. This is real and it'll last and we don't need to—you know?\"\nStiles shakes his head. He's never done this before, never committed himself and time to anyone but his father and Scott, and he's wanting to give Derek that and everything else, too—all of his awkwardness and the way he can't concentrate and his terrible morning breath and the way he bites at his fingertips when he's scared, and he's never wanted to let someone have everything that's wrong with him along with everything that's right, and so he wants Derek to be clear, because his head feels muddled.\nDerek sighs and tightens his grip on Stiles's shoulder. He turns Stiles's head so their noses are pressed together, and he says, slowly, like understanding comes with extending syllables, \"Every morning we will wake up and experience what happens in that day, and throughout each and every one of those days—every single one, from now until whenever, but if I have my way, whenever will be a long time or preferably never—for all of those hours and years we will be together. So we don't need to think of what tomorrow or next year will bring for us, not really, not now, because we know that in tomorrow and next year there will still be an us.\"\n\"Oh,\" Stiles says softly, and then he kisses Derek and this time it's deep and warm. Each of them drowns in the other's open mouth until they pull away, lips wet and eyes half-closed. Derek presses his forehead against Stiles's.\n\"You should probably go,\" he murmurs, and Stiles nods, but it takes him another fifteen minutes to get from the floor to his Jeep, stopping as he does to kiss Derek periodically.\n\n:::\nThree nights pass and Stiles doesn't sleep. He's starting to feel a little hazy around the edges, like he could drift out of himself with a good shake. He gets home from school and sits at the kitchen table, staring at the slight quake to his hands—he thinks it's from the incredible amount of caffeine he's consumed since three that morning, but it might also be something to do with the way he feels like disappearing.\nHe doesn't even notice when his dad comes downstairs and stands in the doorway to the kitchen, watching as Stiles watches his hands.\n\"Are you all right, son?\"\nStiles jumps, his foot kicking out against the table leg in surprise. \"Ow, Jesus.\"\nThe sheriff crosses the kitchen and sits at the table across from his son. \"What's wrong?\"\n\"Nothing.\" Stiles shakes his head. \"Really, nothing. Everything's good. It's fine. Better than it's been in a while.\"\n\"You look a little too out of it for me to believe that.\"\n\"I'm just tired,\" he says, and proves his point with a wide yawn.\n\"You have been busy,\" his father concedes. \"Although you've been staying in these last few nights, haven't you?\" He looks suddenly worried, as if he suspects Stiles is lying to him again.\nStiles nods. \"No, yeah, I have been. I just haven't been sleeping well.\"\n\"Is something bothering you?\"\n\"Insomnia,\" Stiles suggests, \"but it's fine. I just need one good night's sleep and I'll be all right. Really.\"\n\"One of the guys at work has insomnia. He has this herbal tea that he swears by—we all make fun of him for it, of course, but I can find out what kind it is, if you think it'll help?\" his dad offers, and Stiles loves the way his nose wrinkles at the thought of Stiles brewing himself herbal tea, loves that he's willing to suffer the verbal sparring at work to help Stiles sleep again.\nBut he shakes his head. He's probably already tried it; before werewolves and sex, his favorite thing to research on the Internet had been sleep aids. \"It's fine,\" he repeats. \"What're you doing home so early?\"\nHis father narrows his eyes, but apparently decides to let Stiles get away with the change of topic. \"I got off early because I invited Derek over to dinner.\"\nStiles swallows. \"You did?\"\n\"He'll be here at six.\"\n\"Wonderful.\"\n\"I think so, too.\" His dad beams at him, a sarcastic edge to the set of his mouth, and Stiles tries to return the look. It must come out a little twisted, because his dad starts laughing and stands, clapping a hand to Stiles's back. \"He's not so bad,\" he tells Stiles. \"I promise I won't embarrass you again.\"\nIt actually goes much better than Stiles expected. His dad and Derek start discussing all of the Sheriff Department's past cases that have had supernatural causes, and Stiles can mostly sit nearly-still and alternate looking at his food and Derek.\nDerek doesn't stay long after dinner, he tells Stiles he and Peter are meeting with Chris Argent and Allison, which is, he thinks but doesn't say, a disaster waiting to happen. \"Let me know how it goes,\" is all he says.\nDerek nods, and then looks at Stiles for a long moment. \"Are you okay? You look more tired than usual. Have you not been sleeping?\"\nOf course he hasn't, he wants to snap, because Derek came and let him sleep again, and then he left—with good reason, of course, but still—and Stiles is left rubbing sand out of his eyes at all hours. But he doesn't say that, because it's really not fair of him to think it. Instead he says, \"I'm fine, just busy with school,\" and kisses Derek so Derek will attribute the rate of his heart to lust. Which it sort of is—lust with the undercurrent of a lie. \"Go see a hunter about a pack. I'll see you later.\"\n\"Later,\" Derek says, and kisses Stiles again. Stiles knows his dad is inside waiting for him, so he doesn't deepen the kiss, and pulls away as Derek opens the door to his car.\nStiles goes inside and finds his dad in the kitchen, running their plates under the faucet and placing them in the dishwasher. He takes a dish from his dad's hand and says, \"It must be weird to learn that all of those cases actually had magical origins.\"\n\"Of course it is,\" his dad says. \"But Derek's family did a good job of leading us in the correct direction without giving too much away. I hope Derek was old enough to learn how to do that from his parents before they passed.\"\n\"I think he's starting to get it. He can be a bit of an idiot, but he's been a lot better lately.\" Stiles wipes a bit of pasta sauce off of the edge of a plate.\n\"Stiles,\" his dad hesitates, then forges ahead, \"have you ever considered becoming a…becoming one of them? Like Derek? Or Scott, I guess?\"\n\"I told you I haven't.\"\n\"You said you're not and that you won't, but you never said you didn't consider it.\"\nStiles sighs, and rubs a soapy hand beneath his eye. \"Maybe for a minute,\" he says, after a silence long enough to become awkward. \"I guess I did.\" His dad nods, but his gaze falls away from Stiles, to the small spot of water on the counter. \"I mean, I saw how it changed Scott—the good and the bad, but at first I thought that it would have secured my place, like, I thought Scott could leave me behind without realizing it, but if I was like him he wouldn't. And I know now that he's not going to. And I was offered the bite,\" his dad's gaze jerks back to him, eyes bright, \"not by Derek, don't worry. I don't think he would, unless I was dying—but, anyway, I said no, because despite everything I like myself. I don't want to change. Not like that, not at the core of me. And when I said no, he—the guy who offered it to me—he said I was lying, but I don't think I was. Because to want that you need to hate yourself a little, and sometimes I dislike myself and a lot of the time I dislike my choices, but I've never hated myself. I'm good, being me. Don't worry, Dad. You won't ever come home to find me going crazy on a full moon.\"\nHis dad sighs. It's a deep sound, and it makes Stiles feels like the years between his childhood and this moment have unwound. His dad pulls him into a hug, and they stand there beside the sink full of suds, hugging in a way they haven't since his mother's last day. His dad presses a hand to the back of his head and tells him, \"I am insanely proud of you, and I am so happy that you are my son.\"\nStiles starts crying. His dad doesn't let go.\n\n:::\nIn school the next day, Allison tells him that the negotiations went well, which pretty much aligns with the, I think it's good text that Derek had sent him late the night before. When Stiles stops in the 7-Eleven to get milk, he passes by Chris at the checkout counter, buying a bottle of Pepsi and a small carton of milk. He's about to skirt around the rack of magazines to avoid an encounter with the hunter, but Chris catches his eye and nods at him in greeting. Just a small tilt of his head. Stiles returns it with enthusiasm. Awkward head-bobs are eons above threatening conversations, in his book. And pretty much anyone else's, he thinks as he grabs a gallon from the shelf and gets into line. Chris leaves without saying a word to him. It is actually glorious.\nHis very buoyant feeling fades when he pulls into his driveway and sees Peter Hale sitting on his front steps.\n\"You should probably not lurk in daytime,\" Stiles says as he gets out of his Jeep. \"It doesn't work as well.\"\n\"I'm not lurking,\" Peter informs him, stepping down to meet him in the driveway, \"I'm waiting.\"\n\"For me, I presume?\"\n\"Of course.\" Peter leans against the side of Stiles's Jeep. Stiles resists the urge to shove him. It would result in nothing less than a cat fight, and would certainly end with Stiles in pain.\n\"I know we got off on the wrong foot.\"\n\"Or tooth,\" Stiles suggests. \"I'd say we got off on the wrong tooth.\"\n\"Well,\" Peter shakes his head, \"we actually didn't get off on any teeth at all, so you would be wrong.\" And then he tilts his head, looking at Stiles in consideration. \"Or maybe you have gotten off on teeth.\"\n\"Has anyone told you you're meant to be an adult?\"\n\"Has anyone told you you're meant to value your life?\"\nStiles snorts. \"That's no fun. Besides, you won't kill me.\n\"Why not?\"\n\"Because, first of all, Derek would kill you. And he would make sure you stayed dead. And you already told me you didn't like that. And second, I think you came here to make nice. Killing me isn't exactly in line with that.\"\n\"Ends justify the means,\" Peter waves his hand. Stiles wants to hit him, but he keeps his hands in his pockets.\n\"Don't cite dead people, please. Why're you here?\"\nPeter sighs and crosses his arms. \"We have solidified our alliance with the Argents. The pack is fairly strong. Derek is doing a much better job than he was originally. I'm coming to see these facts as improvements, and a lot of them have something to do with you.\" His voice is slow and deep coming out, like he's bitter about this. \"And, as I understand it, you hate me.\"\n\"No shit, Sherlock.\"\nFor all of Peter's impressive control, he growls at that, and Stiles takes an involuntary step back.\n\"I do have reason to, you know,\" he adds, as Peter regains control over himself.\n\"Yes, yes, and God knows you're entitled to your grudges. I just thought that while things are going better, we should at least attempt civility.\"\nStiles is about to tell him that he can behave as civilly as he wants, Stiles will not treat him any differently, but then he thinks about how nice it would be to go to a pack meeting without worrying about Peter. But of course he'll still worry about Peter, he knows that even as he nods, even as he says, \"Yeah, that's a good idea. Let's give it a go.\" He starts worrying about what Peter will do as he shakes his hand and watches him leave, walking away from Stiles's house with his hands in his pockets. But he also worries about the possibility that Peter won't do anything, that this is their pack now. He worries that that doesn't feel very wrong.\nHe calls Derek. \"Are you around?\"\n\"I'm in the subway station. Do you need something?\"\n\"Can I come over?\"\nDerek doesn't tell him to tell his dad this time, but Stiles does leave his father a note, a scribbled, At Derek's, be back before 11 on a piece of paper he sticks to the refrigerator with a magnet of a chef's hat he had gotten his mom when he was little.\nHe parks his Jeep outside of the subway station and goes inside. Derek is sitting on the couch with Peter's computer on his lap.\n\"Is Peter here?\" Stiles asks, laying his fingers over the top of the laptop screen and pushing it down.\n\"Nope. No one is. What's up?\"\nStiles gives him the are you an idiot face he mostly saves for Scott, and Derek shakes his head.\n\"We promised your dad. I promised your dad.\"\nStiles takes the laptop from Derek's hands and sets it on the floor, and then he flops beside him. He lets his knee bump Derek's, but otherwise doesn't touch him.\n\"I know.\" He sighs. \"But, like. He knows about everything else. He doesn't need intimate details of my sex life.\" Derek tenses. \"Look, Hale. Everybody lies to their parents about sex. It's pretty much a rite of passage.\"\n\"Except that you hate lying to him,\" Derek points out. \"I just really don't want us to do something you'll regret later.\"\n\"You, me, no regrets,\" Stiles promises. \"And it won't be lying unless he asks me. Which he shouldn't, because it's not like he has super crazy werewolf smell abilities or whatever. And if he does ask, I'll tell him the truth, if that will make you feel better.\"\nDerek groans. \"God, no. I just—I don't want this to be wrong.\"\n\"I don't think we could be wrong,\" Stiles says. \"I really don't. But if you really don't want to,\" he shrugs. \"We can wait. I mean, I get it. My dad does have guns, I guess. Those can be intimidating.\"\nDerek growls and is on Stiles, hands on his shoulders body pressed above his. His hands push Stiles back to the other end of the couch, so his head is against the arm, and Derek kisses him. He tastes like beer and lasagna and like mouthwash, faintly, and Stiles thinks he probably tastes like gummy worms and coffee, which, all in all, not exactly helping the whole have-sex-with-me thing, except that Derek's tongue is moving against his, so apparently it's not really hindering it, either.\nStiles' fingers scrabble against the hem of Derek's t-shirt, and he finally tugs it up and over Derek's head. Derek comes back down and tears into Stiles' t-shirt which is both very hot and very worrisome, because Stiles cannot afford to replace his entire wardrobe. But then Derek pushes away the shreds of cloth and lowers his mouth to lick a stripe down Stiles' stomach, and really the t-shirt doesn't matter at all, because fuck Derek's tongue should not be allowed to turn him into even more of a mess.\n\"Jesus, Derek, Jesus,\" he mumbles, fingertips threading through Derek's dark hair, and then Derek reaches his jeans and he bites the fabric above the button. Stiles tugs and draws Derek back up towards him, kissing him while his hands play with the buckle of Derek's belt. Derek bites his tongue, just lightly, and Stiles undoes the leather, and then slips the button through its hole and Derek lifts himself up enough to tug down his jeans and then his boxers, and okay, Stiles realizes, he is going to have sex with Derek Hale.\nHe moves forward a little and buries his laugh in Derek's shoulder. \"What?\" Derek growls, hands on Stiles's jeans, brushing the cloth over his erection and causing Stiles to thrust forward, sloppily, messily, all instinct.\n\"God, I'm sorry.\" Stiles speaks into Derek's skin, and he's never been more grateful for the wolf's hearing. \"It just—I can't believe this is actually happening. Like, you and me. How did you and me happen?\"\n\"Stiles,\" Derek murmurs, tugging at his jeans. Stiles lifts his hips so Derek can pull them down, catching at the boxers at the same time, and then they're naked against each other and everything feels like explosions. \"Can we please have this conversation after?\" Derek's voice is gruff and low and burns the way his hands do against Stiles's sides.\n\"Okay, yeah, good, all right, will you just,\" and then Derek licks back down his stomach and breathes against his erection and Stiles is quiet. He has to be quiet, because when Derek's mouth closes around his dick he has to focus on breathing. Talking is so far out of the ballpark that he's almost astonished when he starts murmuring Derek's name as he thrusts into his mouth. His fingers grip onto Derek's hair and, \"Fuck fuck fuck, Derek. Please.\" Stiles doesn't know what he's asking for, but Derek pulls away and rests his nose against Stiles's thigh and Stiles knows that that was definitely not it. Not at all. Derek nips the sensitive skin there and Stiles pants, \"What are you doing?\" Derek grins up at him, lips swollen and spit-slicked, and Stiles buries his hands in his hair again and he will not come just by Derek looking like that. He will not.\n\"Please,\" Stiles whispers, again, voice dry. Derek's mouth is back on him, and then Derek's hands are on his hips, holding him down, as he moans and comes and Derek swallows, swallows, swallows, crouched over him, and Stiles is really glad that he fell in love with this werewolf, really he is.\n\"Will you please,\" Derek growls, releasing him and kissing his way back up to Stiles's mouth, and he tastes strange and salty and it is so hot, so warm and wet and good, that Stiles wants to never stop kissing him. Except that Derek's erection is pressed hot between them and Stiles's hands fumble until he's able to grip against him and the angle is all wrong and awkward but Derek is still licking into his mouth, so Stiles tries to get a decent rhythm going, until Derek finally growls and flips them. Stiles is on top of him and that is better, that is much better, and Stiles pulls his mouth away to lick down Derek's cock, and it really doesn't take anything after that.\nStiles really loves the way his name sounds when Derek moans it.\nStiles showers while Derek Febreezes the couch, and Derek showers while Stiles rummages through his clothes for some that he can wear back to his house. He finds the pajama bottoms and t-shirt Derek borrowed from him what feels like ages ago, but he pulls on a shirt of Derek's, leaving the one Derek borrowed at the bottom of his dresser. It's nice, exchanging clothes. It feels like they will last.\nStiles is waiting on the Febreeze-scented couch when Derek comes out of the bathroom, dripping water down his chest and buttoning his jeans with one hand. Stiles watches over the back of the couch as Derek approaches. He sits next to Stiles and draws him in, and Stiles traces patterns down Derek's totally unfair but also extremely sexy stomach.\n\"So, do you want to talk now?\" Derek asks.\n\"Hmmm?\" Stiles questions, trailing one fingertip down around Derek's navel.\n\"What you were saying before, about you and me and how we happened?\"\n\"Oh, no. It's fine. We obviously happened because I'm awesome and you're a sucker for awesomeness.\"\nDerek groans and covers his face with the hand not currently slipping beneath Stiles' shirt. \"We happened because I have no sense of self-preservation.\"\n\"That's also possibly true.\" Stiles presses his lips against Derek's shoulder and he moves so that Stiles can lie beside him.\n\"You told your dad you loved me,\" Derek says.\n\"More like my dad said that I loved you and I agreed,\" Stiles murmurs, quiet with tiredness. \"But it comes to the same thing, I guess.\"\n\"I love you too, you know?\"\n\"That's where I figured all the possessive 'you're mine, I'm yours' talk was coming from, the other week.\"\nDerek kisses Stiles on the forehead and squeezes his shoulder. \"You're really too much, sometimes. I don't know what to do with you.\"\n\"Just keep me for a while. Not like literally,\" he clarifies, when Derek's fingers dig hard into the skin of his arm, \"but yeah, just keep me.\" He mumbles into Derek's shoulder as he drifts off, \"Figuratively.\"\n\"Okay,\" Derek agrees. \"That's easy.\"\n\n:::\nStiles gets home way after his curfew that night. It doesn't matter, because his dad still isn't home when he gets there, but he crawls into bed to try to get a few more hours of sleep before school and he can't, lying awake with the memory of Derek's touch all over him. He gets up and takes another shower, and is just coming into the hall, fully dressed, thank God, when his dad comes up the stairs.\n\"What're you doing awake?\" his dad asks, brushing a hand over his head in greeting.\n\"Can't sleep,\" Stiles answers.\nHis dad narrows his eyes. \"Still?\"\n\"Pretty much ever.\" His insomnia is not something he particularly wants talk about again, especially considering that it sort of stemmed from his mom and became so much worse with Scott. But his dad steers him to his bedroom and sits down at the edge of his bed while Stiles shifts nervously on his desk chair, spinning in a circle and waiting for his dad to say something.\n\"When was the last time you slept?\" his dad asks, and he sounds exhausted too. \"Was it before that day you told me you had insomnia, when I offered you that tea stuff?\"\nStiles stops spinning and faces him, biting his lip and trying to look as apologetic as he can manage. \"I took a nap at Derek's tonight. Before that, it was when I went over to his place for the pack meeting, and before that—I think—was the night I went to play video games with them all.\" He shrugs. \"I didn't really play, obviously.\"\n\"And before that?\" His dad looks grim, like he's catching the pattern.\n\"Pretty much whenever Derek was here. He—I don't know what it is. I told Scott he calms me down, and I think that's a lot of it.\"\n\"So by telling you guys you can't have sleepovers,\" his dad begins, and Stiles flinches.\n\"Well, it's understandable that you don't want us to. You know, insatiable hormones etcetera,\" Stiles waves a hand, thinking of where that hand was just hours before. \"But I do actually sleep when he's here. Which was nice and unexpected. It's why he started spending time here, because it seems to go both ways.\"\n\"If he slept on the floor, would that help you?\"\n\"Wow, way to not be fair to the poor back of our favorite alpha wolf,\" Stiles says, and then realizes what his dad is offering. \"Seriously?\"\nHis dad runs a hand through his hair and sighs. \"Look, Stiles, this isn't going to be easy. Navigating all of this, the werewolves, the way you're at the middle of everything, the fact that Derek Hale is somehow your boyfriend—that is all a little too much for me to deal with well. But I want you to be happy and good, and you have been, and I know that you hate lying to me, but that you will—so. Okay, Derek can spend some nights here. As long as you tell me he'll be here and you leave your door open. Okay?\"\nAnd yeah, that'll be weird. But it will also be very very good and very very right and Stiles nods. \"Yeah, yeah, that's perfect. Thanks, Dad.\"\nHis dad stands and squeezes his shoulder on his way to the door. \"Sure thing. Just keep it in your pants.\"\nStiles drops his head to his desk. It is really unfair, having a father who gets so much glee out of his emotional trauma. On the other hand…Stiles pulls his cell phone from his pocket and texts Derek, You can come over whenever, as long as you use the front door.\nTough bargain, the werewolf texts back, We'll see if I can get my creeper tendencies under control.\nThe next night there's a knock at the front door before dinner, and later he and Derek go to bed with the door open and Derek in a sleeping bag on the floor. They both stare at the ceiling in silence, their breathing loud in the quiet room. When Stiles's dad walks by he must see the reflective glint of Derek's eyes, because he sighs in the open doorway.\n\"You are both so pathetic,\" but there's no derision in his voice. \"Fine, Derek, you can sleep in the bed. But this door stays open,\" he sounds resigned and weirdly content, as if now he has two people to harangue and that is much better than one, \"and if I hear any suspicious noises I will not be responsible for what I do to you, Derek. I'm aware that you heal from bullet wounds, but I suspect they still hurt.\"\n\"Yes, sir,\" Derek says from the floor. His voice sounds amused and accepting and, above all, happy, and Stiles moves over so he can get into the bed.\nDerek keeps space between them because his dad is still in the doorway, but after a moment during which he and Stiles straighten the sheets around them and fluff their pillows, the sheriff says, \"Goodnight, boys,\" and flips off the hall light.\nDerek rolls over and wraps an arm around Stiles, and after a few minutes of breathing in unison, Stiles falls asleep and he dreams of monsters and his mother. Derek is still there when he wakes up, though, breathing partially into his pillow and partially into his neck. Stiles counts finger-taps on Derek's wrist until he drifts off again, warm and floating in a sleep soft with the absence of nightmares."
}