{
    "id": "527100",
    "url": "https://archiveofourown.org/works/527100?view_full_work=true",
    "author": [
        "orphan_account"
    ],
    "title": "On Building an IKEA Den for an Alpha Werewolf.",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Teen Wolf (TV)"
    ],
    "relationships": [
        "Derek Hale/Stiles Stilinski"
    ],
    "characters": [
        "Derek Hale",
        "Stiles Stilinski"
    ],
    "additional_tags": [
        "Pack Mom Stiles Stilinski",
        "Domestic",
        "Near Future",
        "Prom",
        "Nesting",
        "Humor",
        "Fluff"
    ],
    "language": "English",
    "series": "",
    "published": "2012-10-02",
    "completed": "2012-10-14",
    "words": "13,892",
    "chapters": "2/2",
    "comments": "303",
    "kudos": "17,038",
    "bookmarks": "3,632",
    "hits": "239,876",
    "summary": "<p>Senior Prom is coming up, and Stiles doesn't have a date. Additionally, Derek has an unfurnished apartment, and no one to take him to IKEA.</p>",
    "notes": "<p>I feel I should mention, I'm not American. I've never had a Prom. I didn't even go to my class formal. So... artistic license?</p>\n<p>*<br>If you'd like to hear this as a <a href=\"https://archiveofourown.org/works/1057685\" rel=\"nofollow\">podfic</a>, that is totally a thing you can do! Thanks to the amazing <a href=\"https://archiveofourown.org/users/churkey/pseuds/churkey\" rel=\"nofollow\">Churkey</a>, who took the time and effort to make a wonderful recording of it! :D</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>Did you know that the main character of Trauma Centre is called Derek Stiles? I completely forgot until after I mentioned the game, but I guess it must have been lurking around the back of my head somewhere. What a coincidink!</p>\n<p>_______</p>\n<p> </p>\n<p> <i>E.T.A.</i></p>\n<p> </p>\n<p> <i>On a somewhat more serious note than anything else in this story, I just want to bring up the fact that, looking back on this fic, it plays into quite a lot of heterocentric gender roles in a way I really wish it hadn't. I'm not going to edit anything, just because I don't like to edit things I've already put up for public consumption. The internet should witness ALL my mistakes! However, I will ask readers to just take note of the fact that the 'pack mom' trope I employed here (unless done phenomenally and subversively, as I'm sure it has been!), as fun as it is, is a bit sexist and heteronormative, and its worth bearing in mind as we consume our fiction and fanfiction. Thanks for your time! :D</i></p>",
    "text": "Stiles stands outside the grated door that leads up into the apartment building and presses the buzzer for number five for the third time. \"Derek!\" he calls out at the dusty window above him, dragging the two syllables out. \"I know you're up there!\"\nThe intercom crackles to life on the wall, and Derek's rough voice comes through, broken and static-y. \"No you don't.\"\n\"Let me in,\" Stiles calls. \nIt's a long moment before the door in front of him comes unlocked, but as soon as it does, Stiles pushes it inwards and enters the stairwell. The apartment building isn't the nicest, but it's not the worst either -- three stories, twelve small units, a sort of… 'built in the 70's' feel to the whole thing. The brown carpet on the stairs smells a little bit like damp. \nDerek's door swings open before Stiles reaches the first floor. \n\"You're not supposed to know I live here,\" Derek says. Stiles grins when he sees him -- the werewolf is wearing grey pyjama pants and no shirt or shoes, and his hair is sticking out at angles like he just climbed out of bed. \n\"Wow,\" Stiles comments, stepping past him and into the small apartment. \"Look at you. Look at this!\" For most people, the unit wouldn't warrant a 'wow', but it's not the burnt out remnants of the Hale house, or an abandoned subway station, or (for a brief period last year that none of them really talk about) a sewer. \n\"Look at you,\" Derek replies, in a voice that would be growlier if he didn't still sound half asleep. \"In my home. Where I don't want you.\"\n\"It's really nice!\" Stiles says. \"I'm loving the… emptiness.\"\nWith an eye-roll, Derek flops down on the fold out sofa, the only piece of furniture in the room. It's in bed-mode right now, quilt and pillows strewn messily across it. \"It's been three days,\" he says. \"I thought Isaac could keep a secret longer than three days.\"\n\"And see what three days has done!\" Stiles replies cheerfully, moving into the kitchen and pulling open cupboards at random, finding them all empty. \"You're already wearing jim-jammies and sleeping past noon like a real boy!\" \n\"What are you doing here?\"\n\"House-warming,\" Stiles replies, moving back into the centre of the room and looking around, finding little else to explore. \"I was going to bring something, but I wasn't sure what you needed. Well, now I know. Everything!\"\n\"I have intentions,\" Derek says hesitantly.\n\"Well that's good,\" Stiles says. \"Glad we cleared that up.\"\n\"It's been three days!\" Derek grouses. \"I just moved in. I had intentions, and plans, and none of you lot were going to find out where I lived until I at least owned a security alarm and a fridge.\"\nStiles laughs and sits down next to him on the thin mattress. \"Chill, dude. It's just me. See how this is a singular house-warming, not a house-warming party? I'll even help. I've got all afternoon off. We can IKEA it up.\"\n\"Thanks,\" Derek says, in that surly way he gets when he's accepting assistance -- like it's a personal slight against him. \"Helping me pick out bookshelves isn't why you're here though.\"\nIt's been a weird couple of years, Stiles has to admit, when it comes to this… relationship they have. Not him and Derek (although that is part of it), but the whole, well, pack, for lack of a better word. For months, many months, Derek had operated under the assumption that as Alpha, everyone would fall in line and join his pack eventually. But it hadn't quite worked out that way. Scott was very much a lone wolf when it came to wolf-y business, and Jackson simply couldn't abide the thought of submitting to anyone. Erica and Boyd had flittered around non-committally for a long time -- 'pack' for them was essentially one another, and everything else was simply window dressing. Isaac was the only one who really accepted Derek as his Alpha, but he was living with Scott now, all but taken under the McCall family wing. \nIt's not like they weren't all close, either personally or by degrees, and didn't all work together more often than not. It's simply that they weren't what Derek had expected and strained for. \nAnd Stiles kinda sympathized with the guy, even if he thought that Derek's leadership qualities left more than a little to be desired. And so, in probably the weirdest part of their pack-come-loose-group-of-people-who-knew-each-other dynamic, he and Derek had become friends. Sort of. Sometimes. Enough that Stiles felt like it was a bit of a dick move for Derek to move into an actual house (well, no-bedroom apartment) and not even let him know. \n\"I'm here because I haven't seen you in, like, weeks,\" Stiles says, truthfully, and Derek snorts. \n\"So?\"\n\"Wanted to check in. Make sure you hadn't gone back to living in the pipes.\"\n\"Four days,\" Derek says. \"Four days, and people were trying to kill me.\"\n\"Believe me, dude, I don't even have werewolf senses, but you reeked for far, far longer than four days.\"\nDerek scowls, and leans over the edge of the bed, pulling a ratty suitcase from under it that he's apparently keeping his clothes in. It's unzipped, bits of black fabric and leather spilling out over the edges, and he feels around inside for a t-shirt and jeans. \"I'm going to have a shower,\" he says. \n\"Some host you are,\" replies Stiles as Derek gets up, and jumps further back on the sofa bed in response, sprawling out. \"I'll just see what's on t.v. then -- oh wait, no, you don't have a t.v. I'll read a book. Oh wait, no--\"\n\"Just sit there, I'll be two minutes,\" Derek says. \"Then I'll take you for breakfast.\"\n\"You do realise it's nearly one-thirty, right?\"\nDerek is down the little nook that counts for a hall, and pulling open the door that leads to the bathroom. \"Fine, lunch,\" he calls, and shuts the door behind him. A moment later Stiles hears the shower start up. \nStiles grins up the ceiling. Whoever lived here last was a smoker, he notes, judging by the yellowish stains on the white plaster. He's not sure how it happened, really, but once upon a time Derek probably would have thrown him against something for showing up unannounced and harassing his way into his house. Now he's buying him lunch. Progress. \n*\n\"Anyway,\" Stiles says around a mouthful of chilli fries, \"Isaac is going with Danny, which is like, a super sweet surprise and everything, but it doesn't even leave me with like, a friends-date, and Lydia just gave me a pat on the head when I asked her, which was neither sweet nor a surprise at all, obviously. Of course she's going with Jackson. They're going to be King and Queen and everything, set in stone. But you can't blame a guy for trying, right?\"\nDerek just shakes his head. \"Stop trying,\" he says, skewering a mouthful of pancakes and bacon on his fork, and soaking the two in maple syrup before taking a bite.\n\"Oh, hey, Derek. Romantic advice giving Derek? Guess what? No. That's what.\"\n\"There must be other girls at school, right?\"\nStiles actually thinks for a moment, with a confused look on his face. \"I mean, yeah, I guess there must be.\"\n\"Ask one of them.\"\nStiles fiddles with his fork, toying with a piece of lettuce on his side plate. \"Don't wanna. Lydia's the only girl for me, you know?\"\n\"I can't believe I'm having this conversation,\" Derek says, his shoulders all hunched over as he sips at his black coffee and glares at Stiles. \"I don't care who you take to senior prom. It doesn't matter, okay? It's one night, and then it's over. Just go by yourself.\"\nStiles makes a horrified face. \"God no. I'm enough of an outcast at school as it is.\"\n\"Fine,\" Derek says, seeming to realise the only way he's getting out of this conversation is by playing it through to the end. \"Lydia the only girl for you? Go with a guy.\"\n\"How--\" Stiles doesn't really look affronted, but he looks enormously confused. \"How did you know I...?\"\n\"Smell it,\" Derek says with a shrug, dropping a couple of strawberries from his fruit salad onto his pancakes and stacking them up on his fork with syrup. \n\"My, what a handy gaydar you have, grandma.\"\n\"It's not a big deal.\"\nStiles is twitching kinda uncontrollably now, expressions filtering between uncomfortable grins and nervous grimaces constantly. \"I… no, no it's not. But, I mean, I haven't… No one-- I haven't even told Scott. It's just, I don't care if people find out. I wouldn't, I mean. But it's never come up. Because... It's just Lydia, still. I mean, even if I look at a guy sometimes, and occasionally change my you-porn settings. They're not Lydia, you know?\" \nDerek shivers internally. He's actually going to do this. \"They could be,\" he says, and reaches out to put his hand on Stiles' shoulder comfortingly. \nStiles cracks up laughing. \n\"What?\" \n\"Your face!\" he says, between giggles. \"Don't ever try to be a good friend ever again. You don't wear open minded and accepting well.\"\nDerek huffs. \"Are we done here?\"\n\"Yeah, okay, fine,\" Stiles grins around the straw to his fruit juice. \"Maybe I will just go stag, anyway.\"\nDerek sponges up as much maple syrup as he can with his last forkful of pancake before pushing the plate aside, and draining his coffee. \"You're getting this right?\" he says to Stiles as he signals for the bill. \n\"Hey! You said you were taking me to breakfast.\"\n\"Yeah, and here we are,\" Derek says, gesturing around. \"Get out your wallet.\"\n*\n\"BJURSTA...\" Stiles reads aloud, copying down the name of the item onto the list they're making. Behind him, Derek frowns. \n\"Do I really need a table?\"\n\"Yes,\" Stiles groans. \"We can't do this with everything, Derek. You need a table. You need at least two chairs--\"\n\"One chair.\"\n\"-- Two chairs, a fridge, a saucepan set, kitchen knives, cutlery, spatulas, a dish-rack, plates, bowls, glasses, mugs and a chopping board. Those are non negotiable. And that's just the kitchen. You need a dresser. You need a bookshelf. You need a shower mat.\"\n\"I don't need mugs and glasses,\" Derek replies, and Stiles throws his hands up in frustration and all but screams. A few of the passing customers stop and glance at them, smirking. \n\"Okay,\" Stiles says, taking deep in-and-out breaths. \"Okay, we'll have this argument when we get to the dining section, alright?\"\n\"Awww,\" a passerby says, then recoils when Derek turns to growl at them, his eyes flashing red. Stiles grabs Derek's wrist, and pulls him away. \n\"We're agreed on this table though?\" he says, snapping his fingers in front of Derek's face and pointing. Derek nods sullenly. Stiles brightens. \"Good!\" he says and grins. \"This is actually quite fun.\"\nPocketing their item list and pen, Stiles leads the way onwards towards the chairs. \n\"I could go with you,\" Derek says, a moment later, while Stiles is jumping around, sitting in various seats and wriggling to test their comfort. \n\"Huh?\" he says, flinching away from the price tag on one of the dining sets and looking questioningly at Derek. \n\"Prom.\"\nStiles just stares at him for a minute, processing. \"I…huh. What?\"\n\"You're allowed to take people from out of school, right?\" \n\"Yeah,\" Stiles replies, \"I mean, people are going with dates from other schools and stuff, or, I guess, their boyfriends and girlfriends who are in college now, I think. So, yeah, I suppose so.\"\nDerek shrugs. \"And you wanted to go with Isaac as a, uh, friends.\"\n\"Oh,\" Stiles says, a blank expression passing over his face for a split second. Then he grins. \"And we're friends, aren't we? I mean, most of the time.\"\n\"Some of the time,\" Derek agrees. He's standing a little awkwardly grimacing at himself, and Stiles can't help but sort of duck forward a bit and reach out to semi-hug/tap Derek on the shoulder with the inside of his arm. Then jump away immediately, as if expecting to get his head ripped off. \n\"Thanks, man,\" he says. \n\"When is it?\" Derek asks. \n\"Next Saturday,\" Stiles says. \"You can pick me up. We should go in your car, not my jeep. This might actually be a chance to get some street cred. Oh yes, we'll show up in your beautiful black serial killer car, and I get to walk into prom with a gorgeous older guy. This is perfect.\"\n\"'Gorgeous',\" Derek says with a smirk. Stiles punches him in the arm, very, very lightly.\n\"You know, if you took your glasses off and let your hair hang down.\" \n\"One more thing,\" Derek says, and Stiles instinctively takes a jump a few feet back. Derek laughs. \"No, come here, seriously,\" he says, and Stiles shakes his head frantically, still walking backwards. \n\"I don't trust you when you say that,\" he says, as Derek stalks closer to him, a rare smile on his face. \n\"Just come here,\" Derek says, pouncing forward and grabbing Stiles by the collar of his hoodie as he frantically tries to escape. He lifts him upwards so that only his toes touch the ground and his arms flail wildly, a look of terror on his face. \"I was only going to say,\" he says, \"that you should tell Scott. And the others.\" He lowers Stiles back down. \"About… what we talked about earlier. They won't care.\"\nStiles shakes his shoulder, readjusting his hoodie with a glare. \"You're really scary, you know that? Even when you're trying to be nice. It's like, 'here Stiles, lets talk about sexual identity! I'll stalk towards you like a creeper and look like I'm going to throw you at the bedroom display'.\" He slaps a hand across his mouth. \"That came out wrong.\"\nDerek shakes his head, still smirking a bit. Then he points at a chair. \"That one's fine,\" he says, and Stiles curses and fishes around in his pocket for their scrap of paper. \n*\nOn Monday, the next day, Jackson sits opposite Stiles in the cafeteria and grins at him in that disarming way he has that means shit is about to go down. \n\"If you ask my girlfriend to go to prom with you one more time, Stilinski, I will end you. Creatively.\"\nBeside him, Scott slams his hands on the table and snarls threateningly at Jackson, who bares his teeth in return. Stiles puts a hand on his friend’s shoulder, pushing him back down into his seat. \"Okay, can you guys at least pretend not be werewolves at school?\"\nJackson's eyes are still flashing blue, but he turns to look calmly at Stiles. \"You're right. We'll need plausible deniability when people find your mauled carcass out behind the bleachers.\"\nStiles just shrugs. \"Jackson, I know what you're capable of. Tone down the threats a little to something realistic if you want me to actually be scared of you. Anyway, I have a date for prom, and it's not Lydia.\"\nBoth Jackson and Scott do a double-take. \"Really?\" they say in unison, and Jackson adds a sceptical, \"As if.\"\nStiles grins, spreading his hands. Jackson narrows his eyes. \n\"Who is it?\"\n\"You'll see,\" Stiles says. \n\"I don't believe you,\" Jackson replies, standing up. \"So I'm just going to say this. Between now and Saturday, don't go near Lydia at all, or I'm going to smash in the headlights of your car. Realistic enough for you?\"\nHe turns his back and stalks away, and Scott immediately turns to Stiles, face delighted. \n\"You weren't lying!\" he says, and Stiles scowls. \n\"You could sound less surprised, you know.\"\n\"Sorry man,\" Scott says, shrugging. \"It's just, you've refused to ask anyone but Lydia this whole time, and I was starting to think you'd just stay home and play MMORPGs instead of coming.\"\nStiles sighs. \"It's not actually a date. He's just going with me as a friend.\"\n\"Isaac?\"\nStiles makes a squirmy motion with his hands. \"Uh, Derek, actually.\" \n\"Really?\" Scott says, pulling a face. \"Him?\"\n\"I thought you didn't mind him so much these days?\"\n\"Eh. He lived in a sewer not that long ago.\"\nStiles lifts a finger up defensively. \"He's not living in a sewer now.\" He doesn't add that Derek's actually moved into a proper apartment, since he still doesn't seem to want visitors. And Stiles is going to respect that. For at least a week. \"Look, everyone is paired off, okay? You and Allison. Jackson and Lydia. Boyd and Erica. Isaac and Danny, apparently.\"\nScott grins. \"I know, how sweet is that?\"\n\"Yeah, it's lovely. I'm real happy for them. But you know who doesn't get a convenient match in this little quasi-pack of ours? Stiles. And Derek, actually.\"\n\"Are you saying you want to go gay for Derek because it makes everything neat?\" Scott asks, confused. \n\"No. I told you, we're going to prom as friends!\" Stiles sighs. \"But it can get frustrating, okay? And, also, while we're on the 'go gay', thing. I am, actually. Not gay. But attracted to men? Yeah. Maybe mostly attracted to men. Maybe it's just men and strawberry blonde geniuses.\"\nScott looks surprised, but he just smiles. \"I didn't know, man. But that's cool.\"\n\"No, it's not cool,\" Stiles whines. \"Because it doesn't make any difference! I still don't get matched up, I still don't get people looking at me that way.\"\n\"Yeah, you do,\" Scott says. \"Erica used to have a crush on you.\"\n\"Well, she never told me. And no one else tells me either, and I can't sense sex-pheromone reactions with my nose like you guys. I'm flying blind.\"\n\"Pretty much everyone is,\" Scott says, reasonably. \"I mean, yeah, werewolves have an advantage or two. But Stiles, most people aren't werewolves and manage anyway.”\nStiles just lowers his head to the cafeteria table and groans. “I just wanted to go to prom with someone who likes me, and would have sex with me. I just want to have sex.” He heaves out a dry sob. “It’s been eighteen sexless years and I want it to be over.”\nScott pats him on the shoulder. \n*\nDerek glares at the windowsill. “Why is there a cactus?” he asks. \n“Because it’s prickly,” Stiles says, throwing himself back on the sofa bed, which is currently folded up. “Like you. I picked it up on the way over here from school. It’s a house-warming cactus.”\n“Well that’s great,” Derek says. “You said you were going to get me something I need.”\n“That’s why we’re going grocery shopping this evening.”\nDerek side eyes him, still facing the cactus and cocking his head, as if sniffing it. “We?”\n“You’ll never do it yourself,” Stiles says reasonably. He sweeps his arm around the room, which is now not completely empty. “But well done putting the furniture together.”\n“The table is lopsided,” Derek says. “The… diagram wasn’t--”\n“Just don’t play marbles on it, dude.”\nDerek turns around at looks at Stiles front on. He’s got a constipated frown on his face, which Stiles knows is different to the surly frown, because it means he doesn’t quite know how to react to something. Constipated frowns mean he can’t just throw anger at it and hope it goes away. “Alright, lets go then,” he says, grabbing his car keys off the coffee table (coffee table!). \nStiles stands up. “Is this okay, Derek?” he asks. “Me helping you settle in?”\nDerek just stares for a long moment. “It’s fine,” he says gruffly. \n“If I’m doing something wrong--”\n“You’re not.” Derek just holds a hand up to quiet Stiles. “C’mon, lets go. Supermarket.”\n*\nWhen they’re in the car, Stiles says, “I did what you said. I told Scott. It was all cool.”\nDerek’s lips twitch. “Told you it would be.”\n“I don’t know why I never...” Stiles laughs loudly. It’s kinda like having a weight lifted off his chest. “I chat to drag queens on facebook pretty much every night, I don’t know why I never just told people. No one cares that I’m bisexual. Why would they? I’m going to change my facebook info.” He pulls out his phone, opening up the app. Derek glances at the screen, shaking his head with amusement. \n“Stiles,” he says, then pauses, clearing his throat. Stiles looks up. \n“Hm?”\n“You picked out pretty much all the furniture in my house.”\n“You chose the chair,” Stiles reminds him. \nDerek shrugs, turning the car into the parking lot in the basement of the supermarket complex. “Yeah, one chair.” Derek parks the car and turns off the engine, twisting in his seat to look at Stiles. “And now we’re going to go into the supermarket, and I’m going to push the cart, and you’re going to choose all the stuff we’re buying for me.”\nStiles nods. “Yeah, probably.”\n“And it’s all going to go in my house and I’m going to be surrounded by these things you picked out and put in my space, every day.”\n“Is that a problem?” Stiles asks, suddenly nervous. Derek’s eyebrows pull together in a way that reads like he hates the world.\n“No,” he says, then sighs and opens the driver’s side door. “That’s the problem.”\n*\nThey end up with eight canvas bags (Stiles had insisted) of shopping in the trunk of the car, and when they return to the apartment, Derek carries up six with ease and Stiles takes the lightest two. \n“I can unpack from here,” Derek says, when they dump them all on the small floor space in the kitchen. “If you want to go home.”\n“I was actually hoping I could stay for dinner?” Stiles asks, already reaching into the first bag and starting to sort all the goods into piles based on where in the cupboards they should live. \nDerek actually starts to say, “But there’s nothing--” then cuts himself off, looking terrified. “Oh. Shit.”\n“Ha! Never get rid of me now,” Stiles cackles, throwing a bag of pasta towards the werewolf and pointing to one of the upper cupboards. \n“I can’t cook,” Derek says.\n“That’s okay,” Stiles replies. “I can.”\nDerek gets that constipated frown again, and buries himself in the groceries, taking Stiles’ directions on where to pack things away. They’ve settled into a comfortable rhythm of pass, point, disagree, argue, snatch, throw, and eventually concede on a location for where everything should live, when Derek pauses, cocks his head and says, “Your phone’s ringing.”\nStiles swears and rushes over to his backpack, fishing around inside while Derek finishes sorting out the shop. “It’s Lydia,” he says, answering. Derek shoots him an unreadable look, packet of dish-washing scourers in hand. \n“Heeeey, Lydia,” Stiles says, giving Derek a thumbs up and a wink. Derek’s frown comes back in full force. “Rethink my offer?”\nEven through the phone and from the other side of the (admittedly small) room, Derek can hear Lydia clearly. \n“Jackson tells me you think you’ve got a date for prom, Stiles,” she says. “I want to know who it is.”\n“Jealous?” \nHer snort comes through loud and clear, and Derek can’t help but smirk to himself a little. Stiles sees him and mouths, Not cool man. \n“I need to call them to do dress fittings, we’re all getting matching ones.”\n“Uh, since when?” Stiles asks. “And who’s ‘we’?”\nThe eye-roll isn’t audible, but Derek imagines it clearly. “Since forever? I have a day planner. And Me, Allison, Erica, and whoever the hell your date is. Duh. We’re getting group photos. They have to look nice.”\nStiles throws himself into Derek’s dining chair and sprawls out, one arm hanging over the backrest. “But what if the guys don’t wear matching suits?”\n“Well, you’re all wearing black,” Lydia says, “obviously. So that won’t be an issue.”\n“Lydia,” Stiles says, his voice serious and dire, “my tux is lime green. I’ve already bought it.”\nDerek has to turn away to bury a bag of potatoes in the cupboard and hide his grin at Lydia’s scandalised gasp. \n“No, it’s not,” she says. \n“Well, okay, it’s actually more of a pastel green. Deposit is down and everything,” Stiles replies, and looks over at Derek with a wide grin. \nReally? Derek mouths. Stiles shakes his head. \n“Well you have to un-deposit it, then,” says Lydia. “Because you’re wearing black, and we’re getting photos done against the light blue wall in the drama department. If you absolutely have to, you can wear charcoal grey or obsidian.”\n“What are you going to do about the wolves?”\n“Sunglasses,” Lydia says, sounding put out. “It’s going to look so tacky, but it’s that or contact lenses, and we just can’t get Scott to wear them. He can’t put them in. And it’s better to have everyone wearing shades than just one guy.”\n“You’ve thought about this,” Stiles comments. \n“Uh huh, which is why I need your date’s number.”\n“Do you have Derek’s number?”\nThere’s a pause. “Yes.”\n“Well you’re good to go then!” Stiles says cheerfully. “I don’t think he’s going to want to wear a dress though.”\nAnother pause. “Jackson was right,” says Lydia. “You’re so full of shit.” Then she hangs up. \n“Love you too,” Stiles says to the phone, and throws it back to land on his school bag. He looks over at Derek. “Maybe I should rent a pastel green tux.” \nThe kitchen is now completely packed away, but finally stocked -- there’s spices in the spice rack, and fruit in the recently acquired fruit bowl. Derek steps away from the area and sits on his sofa bed. “You mess with her,” he observes. “To get attention.”\nStiles shrugs. “She’s fun to mess with.”\n“Hm,” Derek says, watching Stiles walk over to the kitchen and pull out a large saucepan from one of the bottom shelves. “What are you making?”\n“Risotto good with you?” Stiles reaches into the dark basket under the counter and grabs an onion, then picks a knife from the block and peels it in one smooth movement. \n“Fine,” Derek replies and watches, entranced, as Stiles starts chopping until the onion is just a pile of fine, even pieces. Then he grabs a few cloves of garlic and neutralises them as well. Derek hasn’t seen Stiles like this -- he’s not flailing around or getting distracted, he’s just working on the vegetables as if it comes completely naturally to him. He grabs a stick of celery from the vegetable cooler, and starts to chat while he chops it up finely. \n“So what do you do,” he asks, “if you don’t cook? Do you just eat out? Or is it a wolf thing? Hunting deer and rabbit and tearing them apart with your bare teeth?” He drops some butter into the saucepan, letting it melt down before adding the vegetables and dropping the lid on, turning down the heat on the stove. \n“Sometimes,” Derek says. “I eat what’s around, I guess.”\n“Remind me to never leave you alone with my goldfish.” Stiles starts chopping a large field mushroom, then pours out a cup of aborio rice, leaving it next to the stove. “Where’d you put the chicken stock?” he asks. \n“Second highest shelf. Left,” Derek answers. Stiles takes the carton down, then takes the lid off the onions, dropping the mushrooms in by the handful, then pulls a wooden spoon out of the drawer and stirs. After adding some salt and seasoning, he pours in the rice and generous amounts of stock. \n“You’re really calm,” Derek observes, and it comes out sounding more accusatory than he intended. Stiles just laughs though. \n“Social conditioning,” he says. “I mean, I was diagnosed with ADHD young, kinda when it was trendy. They gave mom and dad this pamphlet about ‘Ways of Managing An Attention Deficit Child’ or something, and it was all about establishing routines, you know, and providing incentives. One of the suggested things was cooking, so mom always got me to help her make dinner. And then I kept on after… I guess it worked, anyway. It helps if I make myself cook slow things, like this,” he gestures at the risotto. “You can’t leave it unattended.”\nDerek isn’t sure what to say, so he doesn't say anything. It doesn't matter. It’s Stiles, so he just keeps talking. \n“I don’t bake though, baking is a bad plan. The timer doesn’t work on our stove at home, so I put a cake in the oven and then pull out a pile of ash several hours later when I remember it exists. Roast veggies also don’t really work. But stove top stuff, I’m good at.” He turns around to lean against the kitchen counter and look at Derek, still stirring slowly with one hand. “Why are you looking at me funny?”\nDerek blinks -- hadn’t even realised he was staring. “You...” he says, and cuts himself off shaking his head. \n“Seriously, what? Is it the puffy eyes? That’s just the onions, dude. Or do I look pretty when I cry? Because that’s just creepy.”\n“No,” Derek says. “It’s nothing.” \n“Ah, no, I know your ‘something’ face,” Stiles says, but doesn’t push the issue.\n*\nLater on, the saucepan is soaking in the sudsy sink, the two empty bowls stacked on the counter next to it. Stiles finishes cling-wrapping the bowl of leftovers, and glances at his watch. \n“Shit, I better get home,” he says, and Derek just huffs from the sofa, which is now unfolded into a bed again. \n“Thanks,” he says, stretching out on his back atop the covers. “You know, for...”\n“Being your wife?” Stiles jokes, checking his school bag and glancing around for his shoes. “Or is there like, a werewolf equivalent? Mommy wolf.”\n“Yes,” Derek says, then adds after a moment. “Alpha werewolves have female mates.”\nStiles laughs. “Yeah, I’m remembering back to my wikipedia nights when Scott first got turned. I guess I am kinda raising all your cubs, you slacker. I’m not even kidding, Scott forgot how to read analogue clocks the other day. I had to re-learn him.”\nDerek laughs from the bed as Stiles stands idly next to the front door, back-pack over one shoulder. “Go home,” he says. “What are you waiting for?”\n“Can I come over again tomorrow?” Stiles asks, and Derek twists his neck to look at him, frowning. \n“No,” he says. ‘I’m going out in the afternoon.” Stiles face falls, and Derek frowns harder. “You can on Wednesday, though.”\nStiles pulls the door open. “Alright,” he says. “Bye. See you then. On Wednesday.”\n“Just get lost,” Derek says, but teasingly, and Stiles grins and dashes out into the stairwell, kicking the door closed behind him. \n*\nErica corners Stiles in Chem class the next day, hedging him in on the two person station before Scott gets to class. She doesn’t say anything initially, just unpacks her books and stationary calmly, then turns to look at him. \n“I was saving that seat,” Stiles says, somewhat lamely. \n“Yeah, well, we have things to talk about,” says Erica with a smile. “Lydia thinks you’re going to prom with Derek.”\n“Why does everyone keep phrasing that as if they think I’m making it up?”\n“Because we all think you’re making it up,” Erica replies, rolling her eyes. “But on the off chance--”\n“We’re just going as friends,” Stiles says. “I’m friends with Derek. Everyone knows I’m friends with Derek. It’s not like it’s totally unbelievable.”\n“--On the off chance you’re actually telling the truth, you’re going to tell me where he is, because I’ve been looking everywhere for him, even that disgusting sewer. I can’t even track his scent. He’s deliberately hiding himself away, and I want to know where my fucking alpha is. And, also, F.Y.I., you’re not friends with Derek. No one is friends with Derek.”\n“See, people always say that, but it’s totally not true. I mean, he’s not an outgoing guy, sure, but he’s deeply starved for human contact, and--”\nErica snarls. “Do you know where he is, or not?”\n“Yes!” Stiles throws his hands up defensively. “But he’s not ready yet!”\nShe freezes. “Excuse me?”\n“He needs just a bit more time, I think. He’s…unfinished. It’s just detailing now, I swear. I’ll hang curtains on his face, then he’ll be open to the world.”\n“What the fuck are you talking about?”\n“Yeah, okay, that didn’t exactly make sense,” Stiles concedes. “Just trust me, okay? He’s fine, he’s around. Is there something you need from him? I can talk to him.”\n“I just want to know where he is,” Erica huffs. “It’s a pack thing. And you’re a human. It’s not fair that you apparently rank higher than me.”\n“It’s not a rank thing,” Stiles says, but then cuts himself off. What does he know? Maybe it is. Maybe that ‘Mommy Wolf’ joke wasn’t so far off the mark. \n“Well,” Erica says, scowling, as Mr. Harris walks into class and starts to set up the lesson. “Tell him I’m looking for him.”\n*\nDerek actually picks Stiles up from school on Wednesday, the black Camero pulling up outside the front steps just as he walks outside. Stiles looks around and curses himself for staying behind to finish some work in the library. He’s one of the last people leaving the school, and everyone in the pack has already left. \n“Erica wants to know where you are, by the way,” he says, opening the passenger door and climbing in. “And none of them actually believe you’re coming to prom.”\nDerek pulls out into the road, and glances at Stiles. “That’s surprising?”\n“Well, no,” Stiles replies, “but you know. It’d be kinda nice if you could send out a PSA that I’m not a delusional fool.”\n“I couldn’t in good conscience,” Derek replies, and Stiles knows his dry tones well enough now to tell when he’s making a joke. \n“Ha-ha,” Stiles says. “Hey, I was actually planning to go to Pottery Barn before coming over this afternoon.”\nDerek looks at him sceptically. “Have you considered interior design as a career path?” he says, but slips into the next lane and takes the turn that leads them towards the decorating store. \n“I swear this is the last of it,” Stiles says. “We just need some finishing touches, and then you’ll have a fully inhabitable room. Of course, we’ll have to work on getting the actual necessities, like a T.V. and computer, eventually, but I guess those things can wait.” Derek’s laugh is a little hysterical, and Stiles looks at him, shocked. “What is it?”\n“You keep saying ‘we’!” Derek says, sounding really, really unsettled. There’s even a slight tremor in his voice. “And I keep letting you.”\nStiles mouths wordlessly, trying to think of something to say. Eventually he settles on, “But... you said it was okay.”\n“It shouldn’t be!” Derek groans. “I wasn’t supposed to-- I didn’t think--” \nThey’re driving past a shopping mall, pretty close to Pottery Barn, but Derek suddenly takes a sharp turn and swerves into the parking lot, stopping in the first empty park and shutting off the engine. Stiles stares across at him, but he’s just glaring out the window, taking sharp breaths through his nose. After a few seconds of that he shakes his head as if he’s trying to dislodge something, then seems to snap. \n“Out,” he growls, stepping out into the car park. Stiles unbuckles his seat belt but doesn’t move, just watches in confusion as Derek comes around the car and wrenches open his door, grabbing Stiles by the wrist and pulling him out of the car. Stiles half runs, half falls as he flails after Derek, who’s storming towards the mall, hand still tight around Stiles’ wrist. \n“What the hell are you doing?” he shouts, balancing himself and jogging a little bit to keep step with the werewolf. \n“Keep up,” Derek says, but lets go of Stiles magnanimously, clenching his hands back at his sides. Stiles thinks he sees claws for a brief moment, and recoils a little bit, slowing his steps so he’s a couple of feet behind Derek. \n“Pottery Barn is that way,” he says, pointing further down the highway. \n“We’ll get to it,” snarls Derek as he reaches the automatic doors and breezes inside. Stiles looks around in confusion. \n“Where are we going?” he asks. “Macy’s?”\n“No.” \n“Yeah, didn’t think so.” Stiles trails after Derek, who’s slowed down a little now, looking around for what he’s trying to find. He actually sniffs the air, then steps onto an escalator, and they head downstairs. \n“Derek,” Stiles whines, but Derek just speeds up again, crossing over to a small stall in the center of the walkway that cuts...\nOh.\nCuts keys. \n“Oh my god,” Stiles says. “Ohmygodohmygodohmygod, what on earth are you doing?”\n“Wait here,” Derek says, putting a hand out to Stiles’ chest and then stepping forward, pulling his house keys from his pocket and talking to the elderly woman behind the counter. He hands over some cash, and in return gets a paper ticket and a wary look. He walks back over to where Stiles is standing, dumbstruck. \n“I’m sorry,” Derek says sourly. “I should. Explain.”\n“Uh, yeah,” Stiles says, crossing his arms. “Yeah you should. You should explain in detail. Possibly with the aid of a flowchart.”\n“Um, the mates of Alpha wolves. When they, uh, rear cubs. They build a den.” \n“Oh,” Stiles says thoughtfully, then: “Oh! Is that what you think I--”\nDerek scowls. “My wolf instincts. Sometimes it’s hard to ignore them.”\n“And the key cutting?” Stiles asks, glancing at the stall over Derek’s shoulder. He shrugs.\n“Sometimes I don’t want to ignore them.”\nStiles can feel his heart pounding in his chest, and knows intellectually that Derek can hear how hard and fast it’s beating, but he still tries to look unaffected. “So what you’re saying is...?”\nDerek gives him a glare for making him actually articulate his feelings. “My wolf,” he growls, “thinks you are my mate. You’re making our den, you’re caring for our cubs -- more than I can, at least -- and, even things like cooking for me, you are providing, you are carving a space for yourself.”\n“Derek,” Stiles says, the corner of his lip twitching up, “If you don’t want to go to Pottery Barn, that’s fine. You can just say that.”\n“This isn’t a joke, Stiles,” Derek snarls. \n“I know,” Stiles replies, stepping forward til he’s just about looking up at Derek. “But-- I mean, it’s okay, isn’t it? I can stop, if you like.”\nDerek is sullenly silent for a moment, then says, “I don’t want you to stop.”\n“Good, because I don’t want to stop either,” Stiles grins. “How long have we got before the key’s ready? Time enough for Pottery Barn, you think?”\n“Yeah,” Derek says, and gently places his hand on Stiles’ lower back as they walk back out of the shopping complex, as if in apology for dragging him in before.\nStiles stands outside Derek’s apartment the following afternoon for a full ten minutes before letting himself inside. He knows that Derek got him the key cut for precisely this purpose: unlocking this precise door. Like really, what else is one supposed to do with a key? But still, he’s got this nagging feeling in his gut like he’s invading, like he’s not allowed. \nThat feeling disappears completely the moment he’s over the threshold. Suddenly the apartment stops being ‘Derek’s’, exclusively, and starts being… well, not ‘ours’, but definitely ‘Derek’s space where Stiles is entirely welcome and may conduct himself how he likes’. \nStiles is kind of pleased when he realizes that Derek’s not actually home, since if he had been, the werewolf would have undoubtedly heard him standing in agonizing indecision outside the door for all that time. \nThe first thing he does is toe off his sneakers, and throw his backpack onto the floor by the table. Then he looks around. The Pottery Barn ornaments he and Derek had ended up with yesterday aren’t unpacked, just lying in gigantic plastic bags underneath the window. Stiles makes his way over, pulling things out at random. \nMost of the bags, in all honesty, consist of cushions. It had been something of an event at the store when Derek had said that he “wouldn’t mind a couple” of the decorative cushions, to throw on his sofa in the day-time, and Stiles had taken ‘a couple’ to mean sixteen. After a brief (but heated) discussion of the merits of a chic opium den style, Stiles had been argued down to four. Which he argued back up to eight. \nThey wound up with six cushions, in the end. \nThere are also a couple of sheepskin rugs amongst the stock, lush and big enough to cover most of the room. Stiles sets to work with them first, unrolling them across the floor, lifting up the tables, chairs and sofa-bed by turns until everything is laid out how he likes it. He wiggles his bare toes in the carpet, savoring the softness. \nHanging the curtains is a lot of work: It involves dragging Derek’s chair underneath the window and screwing a couple of hooks up high. Whoever lived here last, Stiles thinks, was not only a smoker, but woefully committed to blinds. Eventually he manages to fit the curtain rail across the window without dropping anything, and hang up the drapes themselves. They’d chosen plain ones with a velvet texture and ‘stone’ finish (“They’re gray,” Derek said. “They’re dark gray.”), but hung up, Stiles thinks they actually look quite dapper, even if he’d initially dismissed them as ‘bland’. \nAfter he’s done, Stiles glances at his watch. It’s approaching 5:30. He doesn’t think Derek will be out that much longer. He’s not one for the night life, except around the full moon, which is still waning. Stiles sighs to himself. Now that the room is more or less done, he really should spend his time here doing his algebra homework. \nAnd that is how Stiles ends up taking a nap in Derek’s bed. \n*\nWhen he eventually rouses himself, stretching and yawning under the thick quilt, he’s surprised to find he’s not alone. Not just not alone in the apartment -- that wouldn’t have been much of a shock -- but not alone in the bed. As he arches his back and rolls his shoulders, he hears (or rather, feels) Derek growl softly against his neck, his strong body pushing closer, objecting to Stiles’ sudden movements. \nStiles eyes snap open immediately then, his brain going from zero to seventy as it tries to work out how to react to the current situation. He’s tossing up whether to jump out of the bed in sudden fright or to curl his body back against Derek’s and go back to sleep -- both seem pretty attractive right now -- when his cock makes the decision for him, Derek’s hand sliding down from where it’s rested on his chest to graze down his abdomen and settle just on the waistline of Stiles’ jeans. \n“Nngh,” Stiles says, and stays right where he is. He whines Derek’s name imploringly, but gets no response except for a rumbling snore. “Oh my god, are you asleep?” Suddenly he feels a bit embarrassed and stupid, even if no-one except him was awake to witness how easily he melted into Derek’s touch. “Wake up right now you big dumb wolf and stop sleep-groping me, will you? That’s a bad touch right there, but I’m not sure if on your part or mine, and I’m still too dozy to analyze that.”\nHe actually feels Derek’s eyes blink briefly open, his eyelashes grazing against the nape of his neck. The werewolf makes an unintelligible, half content - half dissenting sound, then presses his lips to Stiles’ shoulder blade through the fabric of his t-shirt. “Mate,” he rumbles, and Stiles’ suspects he’s still mostly unconscious. “Mine.”\n“No...” Stiles says, taking Derek’s wrist in hand and removing it from his body, trying to wriggle away. “Autonomous human being here, who’s currently getting up and maybe getting dinner started.”\nSleepy Derek seems to react positively (if not conductively) to the mention of food, wrapping both his arms fully and tightly around Stiles and pulling him close, this time brushing his lips against the skin of Stiles’ neck. Fidgeting a little, Stiles tries to slide out of Derek’s tight grip, but the movement makes him all too aware of the warm hardness pressed against the dip of his ass. He freezes again, his hormones ramping up his interest from ‘present, but still mostly concerned about the fact that Derek is asleep’ to ‘short-circuiting his brain and giving him a raging, uncontrollable hard-on’. \nSo Stiles bites Derek’s bicep, hard, and the werewolf jerks completely awake in an instant, letting out a stream of curse words. \n“What on earth was that for?!” Derek snaps, body still wrapped around Stiles. \n“You were sleep molesting me,” Stiles explains. “I wanted you to be awake-molesting me.” He pauses, waiting for Derek’s reaction, but the other man doesn’t seem to be having much of one (although Stiles swears he can hear the whirring of his brain processing the situation). “We can start the molesting now,” he prompts. \n“You were in my bed,” Derek says. “I got home and you were in my bed.”\n“Yeah, algebra, you know,” Stiles says offhandedly, and wriggles his ass back against Derek’s erection keenly. \n“You smelled so right here.” One of Derek’s hands moves to Stiles’ hip as he talks, gripping him so tight that Stiles thinks he might bruise even through the denim. \n“Yeeaah.” Stiles says the word as a drawn out moan. “This is happening.”\nDerek groans in reply, and cants his hips so that he’s rubbing his erection against Stiles’ ass. “No,” he says, when Stiles presses back enthusiastically. “No, this isn’t--” He pulls back, pushing away from Stiles’ body, who whines deep in his throat and rolls over in the bed, trying to shuffle closer again. \n“But,” he says, “But mate. Yours.” \nDerek growls so low at that that Stiles swears the whole bed shakes. Either that or an earthquake just hit. “Don’t do that,” he says.\n“What?” Stiles asks, wriggling close again so that he breathes the word against Derek’s collarbone. \n“Appeal to the wolf,” Derek snarls, and it sounds really melodramatic, kinda intimidating and just a little bit sexy all at once. “If we... If I want to do this, if you say that, it’s all just my instinctual response to you.”\nStiles sighs, breath huffing out over the skin of Derek’s chest. “Okay,” he says. “Sorry, I thought you...”\n“Well,” Derek says, and he doesn’t say ‘you thought wrong’, but Stiles thinks it’s definitely implied, so he slides out of the bed, sitting on the mattress for a short moment and taking deep breaths through his nose to try and will down his persistent arousal. He tries not to feel too disappointed. \n“I guess I misunderstood that whole ‘mate’ thing, huh?” he says, with a shaky laugh. “But I guess you mean it in the same way Australians do right? Or something?”\n“Stiles,” Derek starts, but stops when the other boy holds up a hand. \n“Don’t. It’s cool. I’ll just… spaghetti and meat-balls?”\nDerek pauses for a moment. “Sure,” he says, and Stiles stands up on shaky legs and straightens his shirt, crossing the room to the kitchen. \n*\nDinner is somewhat uncomfortable -- Derek commandeers the chair, leaving Stiles to sit on the floor, bowl of spaghetti balanced on his knee as he tries to talk the awkwardness into oblivion. \n“So Allison says that she hasn’t been seeing Scott as much -- I mean, they still see each other every day, but whatever -- but not as much since Isaac moved in with Scott and his mom, which is pretty good actually, because they’re both a bit more bearable right now. I think we’ve found the perfect middle ground, because if they spend too much time apart Scott starts getting antsy and Allison starts looking a bit like the girl from that Jar of Hearts song, and we’re always a bit scared she’ll deep end again.”\nDerek looks up from shoveling food into his mouth as quickly as possible, and furrows his eyebrows thoughtfully. “Christina Perri,” he comments, then lifts his loaded fork up to his mouth again.\n“Uh, yeah,” Stiles says. “That wasn’t really the-- How do you know that?”\nDerek rolls his eyes. “I only pick up Top 40 in my car,” he says, but Stiles knows he’s lying, even if he can’t hear his heartbeat. \n“Riiiiiight. Well anyway,” Stiles says, dropping his mostly empty bowl onto the ground beside him. “Just using your toilet, dude.” He gets to his feet, and turns up into the small section of hallway in the house, and immediately his face breaks out in a wide grin when he sees what’s hanging on the bathroom door. \nThe suit is in a tall plastic case and is clearly tailored. The material is brisk and, oh, charcoal gray -- Lydia will be happy. \n“Oh that is so James Bond,” Stiles calls out, running a hand over the breast of the suit through the plastic covering. “That’s what you were doing all afternoon?”\n“I went for the fitting on Tuesday,” Derek says gruffly. \nStiles looks at the suit thoughtfully, thinking about how Derek will look it in. It's very sleek, not a tux, but a tailored blazer and pressed trousers, with a dark, slightly satiny shirt that's colored with just a tint of green. He deliberately doesn't think any thoughts about how it will bring out Derek's eyes. None at all. But it'll definitely bring out his... who's he kidding? It'll bring out Derek's everything, and Stiles gets a strangely familiar fluttering feeling in his stomach at the thought of waltzing into prom on Derek's arm. Or with Derek on his arm. There are arms involved. He bites his lip. \n“Look,” he says hesitantly, “about before...”\n“Weren’t you going to go piss?” Derek asks around a mouthful of food and a glare. Well that's charming. \n“Oh, right, yeah,” Stiles says, clicking his fingers, and shuts himself in the bathroom. He stares at the mirror for a moment, then lets his eyes shut, before turning away and taking a deep breath through his nose. Stupid Derek. \n*\nThere’s no class the next day. The official line had been something about assessment standardization and curriculum something-or-other (Coach Finstock’s exact words), but as far as all the students are concerned, it’s a day off to get ready for prom the following night. \nFor Stiles, it’s a day off to harass Derek to going into prom with him as a date-date, not a friends-date, because that’s a thing he totally wants now. And, if nothing else, to secretly buy Derek a corsage, because yes. That’s going to happen. \nSo he finds himself in a kinda trendy café around the corner from Derek’s place, nursing a soy chai latte and tapping a text into his phone. Hey, just in that dark coffee shop across the road. Come out and meet me? Breakfast on you this time.\nHe waits a moment, then his phone buzzes and lights up on the table. No, they don’t like me in there... Derek’s text reads. \nIf you avoid places people don’t like you, how do you ever get anything done?  Stiles shoots back, and a few minutes later Derek walks sullenly into the café, hands in his pockets and shoulders hunched. \nThe waitress who’d been hovering attentively waiting to take Stiles’ order a second ago immediately turns around and busies herself with counting the register balance the moment Derek takes the seat opposite him. \n“Oh wow,” Stiles says, “you weren’t kidding.”\n“Hmph,” Derek says, picking up the menu and glancing over it, before dropping it onto the table again almost immediately. After a few moments of hand raising and waving, Stiles eventually manages to catch the waitress’s eye, and she shuffles over, ignoring Derek entirely. \n“What can I get you?” she asks Stiles. \n“Mm, him first,” he says, pointing to Derek, “I’m still deciding.” The waitress looks scandalized that Stiles is going to make her stand here longer than necessary, and slowly turns on the ball of her foot to face Derek, staring down at her note-pad to avoid eye contact. \n“I’ll just have the full breakfast,” Derek says, “and a black coffee.”\n“Oh hell,” Stiles says, grinning up at the waitress, “I’ll have the same, and another chai.” She smiles tightly back, jotting down the order and rushing back over to the kitchen, busying herself with the coffee machine immediately. \nDerek lets out an exasperated sigh, and crosses his arms on the table, looking at Stiles expectantly. \n“Dude, I’m not even going to ask,” he says, holding up his hands in surrender. \n“Good.” Derek looks away across the restaurant, face expressionless, and Stiles figures now is as good enough time as any. \n“Well, actually, I wanna ask something else,” Stiles starts carefully, and waits until Derek’s gaze is trained on him again before continuing. “And I know I’m probably shooting myself in the foot here, since you, well you know. Are you. But I was wondering...” He sucks in a deep breath, and commits to getting the words out as fast as possible. “Wouldyouliketogotopromasanactualdate?”\nDerek just stares at him. “Huh?”\n“Uh, prom,” Stiles says, rubbing the back of his neck uncomfortably. “You and me. As a... date. Not as friends. I mean, you got kind of handsy yesterday, and you’re all Stiles, you’re my mate! about this interior decorating thing, and I know I’m being stupid, but I was thinking those were pretty good signals.”\n“You want to date me?” Derek asks, as if the word is a completely alien concept -- as if Stiles had just asked him is he’d help him through his first Pon Farr. \n“Well, yeah,” Stiles says. “But like, who wouldn’t?”\nDerek keeps staring at him as if he’s an idiot, then fishes a crumpled receipt out of his pocket, asks Stiles if he can borrow a pen, and inexplicably writes what Stiles recognizes as his phone number on the blank side of the paper. Then he gets to his feet, walks up to the counter where the waitress is still making their coffees, and smiles at her in a solid attempt at not looking like a serial killer, sliding his phone number across to her.\nThe poor waitress actually screams and breaks the latte glass she’s holding. \nDerek walks back over and sits down. “In answer to your question,” he says. “Most sane people.”\nStiles waves this off, and shoots an apologetic look at the waitress, who’s now carrying the drinks over, glasses clinking against the saucers as her hands tremble. “Sorry about him,” he says to her. “He’s just… well.”\n“I don’t even want to know,” she snaps, and leaves to clean up the broken glass. \nDerek raises an eyebrow at Stiles. \n“That’s… what are you trying to prove?” he says, shaking his head and taking a sip of his chai latte. “That you make terrible first impressions? Dude, I know that already. You also make pretty abysmal middle impressions, to be honest. \n“But there’s something beneath that. There’s the guy who’s happy to have breakfast with a hyperactive high-schooler and take him to prom just so he doesn’t have to go alone. There’s the guy who loves family so much he’ll turn a bunch of sad kids into werewolves and make everyone’s life a bit more dangerous and interesting, and sure, that’s a bit misguided, but dude. You’re just a kid yourself, and yet you’re still sticking this thing out. And you listen to the Top 40, and don’t lie, I know your car does actually pick up other stations. It’s just like… at first glance, you look like a cardboard cut out of that abusive boyfriend who we’re all meant to go gaga over because he’s sexy and controlling and we can change him, but I-- I don’t want to change you. You’re reserved and grumpy, but I like that. And you’ve gone through some shit, and it’s totally understandable that you’re how you are. I know you’re not going to give me a library, and have a snowball fight with me and eventually turn into a handsome prince. You don’t have to change who you are to make me love you. You just -- Hell, we just need to heal some of those scars. Together, maybe?”\nStiles falls silent, and finally meets Derek’s eyes, which he’s been avoiding since he got about halfway through his monologue. They’re looking at him, the icy-green color sparkling with just a touch of warmth. \n“Uh, two full breakfasts?” the waitress says, hovering to the side and carrying two loaded plates. She’s not shaking anymore, and as she puts down the food she gives Derek a brief, uncertain smile. \n“Thanks,” Derek and Stiles say in unison, and then, when she’s gone, Derek says it again, quieter, to Stiles, not looking at him. \"Thanks.\"\n“So,” Stiles stammers, “uh, basically, that was meant to convince you to go to prom as my, my boyfriend. But I think it got a bit out of hand.”\n“Okay, I will,” Derek says, picking up his knife and fork and starting to decimate his sausage. Stiles grins, and leans across the table, grabbing Derek’s jacket collar and pulling him into a quick kiss before he can object or take a bite of his breakfast. Derek looks a little dumbfounded. “I still don’t think I get it,” he adds. “You could have someone so much bett--”\n“Don’t you dare,” Stiles says, cutting him off. “Just-- Don’t you fucking dare finish that sentence.”\nWhen they’ve finished the waitress drops off their cheque, voluntarily walking over to their table unprompted. She leaves a little note on the back saying He’s a keeper &lt;3, and passes it to Derek, who immediately puts a few bills on the tray, leaving a generous tip. \nAs they leave, Stiles carefully slips his hand into Derek’s, feeling his stomach flip when Derek accepts the affectionate touch. “Today is looking good already,” he says. “I’ve saved you from being excluded at your local coffee shop and everything!”\n“Shut up,” Derek says, but smiles and awkwardly bumps his shoulder into Stiles' as they walk out onto the street. \n*\n“What's that?” the Sheriff asks, pointing to the little ribboned box Stiles has on the dinner table as he sits down. Stiles is over at the oven, mashing potatoes and seasoning stew simultaneously. He looks over his shoulder, wooden spoon in his mouth. \n“-or-age,” he says around the utensil, then plucks it out of his mouth with fingers still covered in salt grains. “Corsage. Prom.”\nHis dad raises an eyebrow. “You found a date?”\nScowling, Stiles says, “Yeah, okay, everybody needs to stop making that sound like I uncovered the Hanging Gardens of Babylon.”\nThe sheriff smiles. “Sorry, son. Who is she, then?”\n“Derek,” Stiles says, casually, purposefully turning back to the stove to avoid the look of shocked disappointment on his dad's face. \n“Oh,” he says, but to Stiles' surprise, that doesn't sound like his shocked and disappointed voice. “That's who you've been with all week, then?”\n“Yep,” Stiles says, spooning the mash onto plates, and glancing over his shoulder suspiciously. His dad's expression is open and relaxed. He's leaning forward on his elbows. “Good ol' Derek. Derek Hale.”\n“Good kid,” the Sheriff agrees. \nStiles' eyes narrow. “How 'bout that time we all thought he murdered his whole family, huh?”\n“Good times,” his dad replies, his face breaking into a smirk. Stiles breaths out heavily. \n“You knew, didn't you?”\n“Yep.” The Sheriff laughs. “He came down to the station to get my blessing on Tuesday.”\nStiles' jaw drops, a good portion of stew sloshing over the side of the ladle he's holding. “Oh my god! We weren't even dating then!” Steadying his hands, he serves the rest of the meal up, carrying both plates over to the table as his dad chuckles to himself. \n“He said that.” The Sheriff picks up the salt jar, only to have it reflexively plucked from his hand with an accompanying warning glare from his son. “He said he was taking you as a friend. But...”\n“But what?”\n“But I could see it in his eyes,” the Sheriff says, lifting a loaded fork to his mouth. As he chews, he looks Stiles in the eyes, who knows his face is still mostly slack-jawed dumbfoundedness. His dad swallows. “And, when I said I couldn't think of anyone better to accompany my son to prom, that... well, it was a blatant lie, and he knew it. But he's as good as any, better than most. So long as he hasn't actually murdered anyone. And has moved out of the sewer.”\n“He has an apartment now!” Stiles says, glad to be able to make Derek sound somewhat responsible for once. \n“Good. Tell him to look into a job next,” his dad says slyly.\n*\nA few hours before prom starts, Stiles is lying on his bed with his Nintendo DS and an erection, wondering if he has time to deal with it before getting ready, when Derek climbs in through his window, fully dressed in his formal wear. \n“Oh my god, you can come in through the front door,” Stiles says, not looking up from Trauma Center – which he swears to god isn't the reason for his boner. “You were the one who told my dad about us. There is literally no reason to stealth route it in.”\nDerek stands uncomfortably in the middle of the room and frowns almost pleasantly at Stiles, who's suddenly very aware of the fact that he's wearing a pair of loose pajama bottoms and nothing else. He pats the bed next to him. \n“Don't worry, I'm suiting up soon,” he says. “Saturday mornings are my not getting dressed and playing video games mornings though, and I saw no reason to mess with time honored tradition until at least four o'clock.”\nHe saves the game and shuts the console when Derek settles down on the mattress next to him, and pushes up onto his elbows, grinning at the werewolf. He tries to think of something to say that isn't, God you're hot in a suit.\n“God you're hot in a suit,” he says. Thanks, brain, Stiles thinks to himself. Thanks again. Derek smirks back though, then his smirk breaks a little, flashing into a proper genuine smile for a brief second, as just a touch of color tints his cheeks. \n“You're not bad like this,” he replies, hand coming out to rest on Stiles' bare calf, where his leg is bent at the knee and drawn halfway up the bed in an attempt to hide his vague boredom induced arousal, which is quickly becoming acute Derek induced arousal. Derek's fingers are lingering just at the crook of his knee, where his pants have ridden up, and his fingertips are grazing just under the hem. His gaze is trained on Stiles' face, who's kind of hesitant to say anything in case he fucks up and says something stupid, scaring Derek off again. \nThat said, Derek is clearly not going to feel Stiles up beyond this gentle, mostly platonic touch anyway unless Stiles does something proactive about it, and now it's been a little too long just staring each other, and in a few seconds it's going to get weird. \n“So, I have a boner right now,” Stiles casually states. \n“I can smell that,” Derek replies, then his eyes go a little bit dark. He seems to chew on his next words for a moment before saying, “So, if I hadn't come up here when I did...”\nJackpot, Stiles thinks. Definitely an in. He sits up a little bit further, pushing himself closer to where Derek's leaning forward a little. His abs were not designed for this static position, but he can't bring himself to care as he brushes his lips to Derek's. “Well, you might've walked in on something,” he murmurs. \n“Walked in on something?” They're not kissing, not properly. More like talking into each others mouths, and when he finishes his question, Derek gently takes Stiles' bottom lip between his teeth, almost like punctuation. \nStiles groans, opens his mouth to respond, but before he can get a word out, Derek's lips close over his properly, silencing him. Sliding his hand further up Stiles' thigh, he pushes him back down onto the bed pointedly. \n“I can go back to lurking outside the window again if that helps set the mood,” Derek says, pulling back from the kiss. Stiles thinks about making a sarcastic comment about Derek not being allowed to make jokes, but then finds himself questioning whether he was actually joking. \nAnd Derek is sliding suggestively down his body, and Stiles doesn't want to interrupt his path there, not at all. Stiles straightens his leg as Derek lowers himself so he's level with Stiles' tented pajama bottoms, stretching out and tilting his head back on his pillows. He can feel the soft exhale of Derek's breath against the thin cotton covering his erection, and reaches down to do... he's not sure, something encouraging involving his hand and Derek's face, or hair. But Derek just chuckles, and rolls over a little so he's lying horizontal, watching Stiles' crotch intently, gaze flicking pointedly between Stiles hand and his concealed erection. \n“Oh my god, you're serious,” Stiles whines petulantly. “I get you in my bed, and you're going to make me do this myself.”\n“Just show me,” Derek prompts. \nStiles lets out a long-suffering sigh, but reaches down to squeeze his straining hard-on through the material, before slipping his hand into his pants to slip around his bare cock. Stiles is briefly worried Derek is going to be completely non-participatory, but he quickly realizes that is not a concern, when he feels fingers hook into the waistband of his pajama bottoms and pull them down over his hips, revealing his erection. \nStiles cants his hips up, moaning in the back of his throat as his cock is exposed to the air and Derek's gaze, and lets Derek shimmy his pants down his legs, tugging them off over his bare feet. \nHe feels really, really exposed, lying on his bed naked with his hand fisted around his own cock, while Derek lies next to him in a three piece charcoal gray suit, without even a single button undone. One of Derek's hands is on Stiles' thigh, stroking encouragingly, then Stiles feels lips and stubble brush his hip bone. Arching his neck, he looks down to bed to where Derek is mouthing over the iliac crest of Stiles' pelvis, green eyes fixed on his face. Stiles flushes and bites his lip, stroking his cock from base to head. \n“Can I just take a moment to say I'm feeling pretty glad you came over early.”\nDerek's eyes dart away. “Me too,” he says, and bites down gently on the ridge of Stiles hip. But there's something odd in his tone of voice. \nStiles sighs, and drops his hand from his dick. “Okay, what?”\nDerek nuzzles his nose into Stiles skin. “Hm? Nothing. Keep going.”\n“No,” Stiles says, and pokes a finger on Derek's forehead, pushing his head back so that he's looking at him. “You're being weird. All... making me touch myself, and sounding odd and, I dunno. You're nuzzling and kissing and being (admittedly a little bitey) but mostly sweet. So what's up?”\n“I'm always sweet,” Derek insists, and as if to prove it, grabs Stiles hand from off his own head and kisses the fingers one by one. Stiles' eyes narrow. \n“No. No you're not. That is the most egregious lie I've ever heard. Tell me what's wrong before I lose my erection.”\nDerek sighs and scowls, and it's comfortably familiar. “Stiles, seriously, it's nothing. I'm just trying to be...” he pauses, and with an exhale falls backward so he's lying on the bed, still level with Stiles abdomen, staring up at the ceiling. “I'm trying to be more human.” \nFrowning, Stiles pushes himself up, shuffling down the bed until he's kneeling next to Derek. He looks down into the werewolf's face. “Why?”\nDerek raises an eyebrow at the ceiling, and shifts uncomfortably, one hand coming up to tug at his buttoned collar. He's quiet and broody for so long that Stiles starts to wonder if he's going to answer. “Because you make me human,” he says eventually, stiltedly. “You try to built me into a... person. Who buys furniture. And you're good at it.”\nStiles grabs a pillow from the top of his bed, folding it in his lap. It feels wrong to be having this conversation with his half mast hard-on bobbing out in the open. “That makes no sense. I thought all that stuff was making me into your... wolfly mate den-mother thing?”\nDerek nods. “That's how my wolf instincts react to what you do. But my... my human side. I don't know. It's complicated.”\nStiles smiles down at him, and Derek meets his eye properly, finally. “So, what you're saying, is, in essence, that emotions are hard and they sometimes contradict each other? Because that's what I'm hearing.” \nDerek's lip quirks up reluctantly. “I think you're under-emphasizing the impact of the fact that I'm a werewolf.”\nStiles waves that off. “Really, I'm not sure I could have a relationship with an actual human these days. Seriously. Just... I meant it when I said I didn't want to change you. Be yourself. Don't hold back with me. Please. And, since I'm naked and we've still got...” he glances at the alarm clock on his bedside table “... about forty-five minutes before I really have to get dressed, feel free to give me a blow job, because you were being a little tease five minutes ago, I swear.”\nDerek shakes his head, but not in refusal. Instead, he snorts and rolls over, slipping the pillow off Stiles' lap and dropping it to the floor, and starts to kiss his way up the other boy's thighs. “Alright,” he murmurs into the crevice where Stiles' leg meets his groin. Then he growls, low in the back of his throat, and takes a heated breath of Stiles' skin. \nIt's weird, and wolfy, and Stiles grins, curling his body forward so he can watch Derek swallow his cock. \n*\n“Your tie is as straight as it is ever going to be, Stiles,” Derek says as they drive down the road to the school, his gaze fixed straight ahead as Stiles peers up into the mirror on the visor, aligning and re-aligning his tie. \n“I'm pretty sure I did the knot wrong...” Stiles says, and starts to tug it loose again. Derek's hand snaps away from the wheel and grabs his wrist, slowly lowering it to rest on Stiles' lap. \n“The knot is fine,” he says. “Why are you so twitchy?”\n“Because I'm me?” Stiles says, twitching his shoulders nervously as he says it. Derek raises an eyebrow, glancing over at him. Stiles sighs. “It's the formal wear,” he concedes. “I dunno, bad things happen when I wear a tie. I was feeling so good about this prom thing, and now I'm all like, arrgh, someone is going to get mauled by a quotation mark, mountain lion, end quotation mark, or I'm going to have to, have to attend a funeral or--”\n“Stiles.” Derek's hand is still resting on Stiles' wrist, thumb stroking gently over his pulse point as he drives. “Breath,” he says, and waits a few seconds, listening as Stiles does just that, deep breaths in and out. “Now take off the tie.”\nStiles does just that, untying the knot and tugging the tie off from around his neck. \n“Better?” Derek asks. Stiles nods. “I promise, no one is getting mauled tonight.”\nStiles lets out a huff of air. “Don't make promises you can't keep,” he says. “You know Beacon Hills has a far higher mauling-per-school-organized-event record than pretty much any high-school ever, except maybe Sunnydale.”\n“That bake sale last month went fine,” Derek says, reasonably. \nThey're pulling into the school parking lot now, which is milling with people making their way towards the gym, and Derek has to slowly circle around for several minutes before they find a park. Stiles shoves his tie into the glove-box: He's better without it. Less to fiddle his hands with, less tight and constricting around his throat. As he opens the little compartment, he spots the little box he'd hidden in there before they left, forgotten about until now. \n“Oh!” he says, pulling out the corsage box and holding it out towards Derek, grinning. \n“No,” Derek says. \n“You're my date,” Stiles reminds him. “You have to wear it.”\n“No, I don't,” says Derek, but it's too late, as Stiles is already pinning the cluster of blue and white flowers to Derek's sleeve, leaning forward to kiss him as he does so. \n“You look gorgeous,” he teases against Derek's frowning lips. It strikes Stiles that, although he's seen Derek frown innumerable times, he's never felt him frown before. \nStiles sits back as Derek looks at the corsage on his sleeve as if it's made of wolfsbane and cursed lilies. “I regret literally every decision,” he comments, but doesn't remove it. Stiles counts that as a win. \n“Shall we?” Stiles asks, reaching out for the door handle. “Oh, no, wait. Wait there! I'll come around and hold the door for you!”\n“I hate you,” Derek says, and gets out of the car himself. \n*\nSo, whenever Stiles pictured attending senior prom, the fantasy had more or less been the same. Sweeping into the school gymnasium (which would be kinda dark and softly lit and not really look like the gymnasium at all) with Lydia on his arm, as if they were about to descend a flight of golden staircases whilst a voice echoed out through the room, “Ladies and Gentlemen, Lord Stiles Stilinski, and guest: Lady Lydia Martin!” Then the entire hall would fall into hushed murmurings as the students would turn around, one by one, and gaze up in awe at their entrance. And Jackson would be standing in the corner, possibly preparing to challenge Stiles to a duel (which Stiles would naturally win), looking like a king without his crown. \nAdmittedly, this fantasy was formed in approximately third grade, and, over the years, had undergone many amendments and concessions (primarily being that Stiles would probably not hold the title of 'Lord' by the time he reached senior year). But the basic principle had remained the same. Even in the last few nights, when the 'sweeping into the gymnasium/ballroom' fantasy had begun to feature Derek by his side rather than Lydia. And in many ways, this was a much better fantasy. Derek, even in his daydreams, was not able to pretend he was comfortable being there, and consequently felt much more natural beside Stiles than Lydia ever had when the fantasy had involved the unaddressed question of what had happened between reality and make believe to finally make her fall head over heels for him. \nWith the daydream amended and reconstructed into what is now finally becoming reality, Stiles has to admit, everything feels more comfortable. Derek's hand is pressed to his lower back as they approach the gymnasium doors, and when Stiles catches his eye, the werewolf gives him a small, private smile. Everything seems real, and realistic and, frankly, perfect. \nNonetheless, Stiles would kind of still appreciated some form of a collective turn and gasp from the student body as he and Derek breezed into the hall, rather than complete non-acknowledgment. \n“So,” he says to Derek. “Here we are.”\nDerek is looking around, and Stiles isn't sure, but he thinks he can see a muscle at the corner of his eye twitching with discomfort. “What do we do now?” he asks. \n*\nStiles rests his head against Derek's shoulder as they dance – well, shuffle in a rotating fashion on the spot – at the center of the crowded room, looking out at the other students. Erica, Isaac and Boyd are all watching them from the wall, arms crossed and eyes narrowed, whispering to each other. \n“You're quiet,” Derek murmurs against Stiles' ear. \n“Mmm,” Stiles whispers back, “Your pups are watching us. Anything I say now will come out either wholeheartedly bragging, or overly defensive of my terrible life decisions.”\n“I'm the terrible life decision?” Derek asks, rubbing his nose across the fuzz of Stiles hair, who lets out a chuckle. \n“Are you smelling me?” he asks, twisting his neck to look up at Derek, who replies: \n“Only a little.”\nStiles shrugs, and rests his head back down on Derek's shoulder, tightening his arms around his neck. The music is slow, something by some indie group that Stiles vaguely knows and that semi-frequently makes the charts. “You're one of many, babe.”\n“Don't call me that.”\nThe song is drifting off into quietness now, and in the short lull that follows it, Stiles hears a cough, and looks over his shoulder to see Lydia standing behind him in a stunning coral dress and matching smile, looking past Stiles to Derek. \n“Hey babe,” she says, “I'm going to steal your boy for a dance, okay?”\nDerek frowns, and briefly tightens his arms around Stiles body, holding him close. But he lets go as Jackson saunters up towards them, and taps Derek on the arm. “Don't bother, dude,” he says. “I'm not happy about it either.” Then Jackson turns to give Stiles an up-and-down assessing look, and nods in concession that yes, he did actually find a date for prom. The look goes unspoken between them, except for the way Stiles scrunches his face up sarcastically back at Jackson. \nLydia rolls her eyes. “C'mon,” she says, tugging at Stiles arm and pulling him away a little to dance. The music is still something slow and ballad-y, so Stiles drops his hands cautiously down to her waist, sending Derek a glance to check on the state of his death glare. \nIt's only a six-point-five. Nothing to worry about yet. \n“So you're over me then?” Lydia asks, putting her hands on his shoulders and leaning back a little to catch his eyes. Stiles grins. \n“Well I don't think he's a convincing stand in for you, anyway,” Stiles answers. \nLydia arches an eyebrow. “I dunno...” she muses, “Put him in my dress, give him some extensions, I think he could be a dead ringer.”\nCracking up, Stiles buries his face in Lydia's hair to hide his snickering (unsuccessfully) from Derek, who's still watching and listening, currently at a seven-point-two. She smells like an artificial, sweet fragrance, but under that is something more fresh and natural, something like newly sprouted mint leaves. She smells gorgeous, of course, but Stiles pulls away almost immediately, still laughing. Lydia rests her chin on his shoulder, lets out a sigh. \n“Who'd've thought?” she murmurs. “This isn't how I was envisioning Prom at all, you know.”\n“Me neither,” Stiles admits. “But this seems pretty right for you, doesn't it? You and Jackson.”\n“Huh?” Stiles feels her cock her head against his shoulder, catches a drifting strand of hair across his face and spends several moments trying to spit it away from his mouth without her noticing. “Oh, well, yeah. But, c'mon. Things are different. I mean, you and me, Stiles. You and me are the only human, non-hunter people in our little group. Like, I was expecting to maybe have to worry about cycles on Prom night to decide what underwear to wear and how pissy Jackson was going to be about hooking up in the back of his Porsche after the dance... I wasn't expecting to be watching the moon's cycles just to make sure Jackson wasn't going to be so pissy he'd wolf-out and murder a few pages out of the year book. Also, I was planning on wearing something floor length, and ugh, I just couldn't find anything that didn't make me look short.”\nStiles hums in agreement. “I guess you're right. Beacon Hills, population: seventeen-thousand. Odds of gruesome mauling before reaching voting age: One in seven. I was expecting them to dress the gymnasium up a little bit more, as well.”\n“Me too,” Lydia says, as a streamer drifts down sadly to the floor. The song isn't quite over, but when Stiles glances over at Derek, his face is still hovering at a higher than average chance of murder, and Jackson is looking on his way there as well, so Stiles takes a step back away from Lydia, bowing to her politely. \nShe curtsies back, tugging at the hem of her dress, and side by side they head back to their respective werewolves. \n“Oh, wipe that look off your face,” Stiles says to Derek, swatting his arm. “I know you're still upset about not finding the perfect gown either, but we all have crosses to bear.”\n*\nIt's comfortable outside, only a slight breezing chilling the air, as Derek pulls Stiles towards the bleachers out by the lacrosse field. There are a few other people milling around outside the gymnasium, mostly in small groups, and mostly over near the car-park. By the time they reach the stands and sit down on the night-time dew damp seats, they're pretty much alone. \n“What's up?” Stiles asks, leaning in to Derek's shoulder, who's sitting bent forward, elbows on his knees and hands hanging between his legs. \n“Just need the fresh air,” Derek replies, but twists his head to graze his nose against Stiles' cheek, then his neck, as if he needs something else too. “You smell like perfume.”\n“So does Jackson, I'll bet,” Stiles says.\n“He does.” Derek nods, takes one last deep breath of Stiles' skin and pulls back, side of his lip quirking up. “He also smells of her, and of wanting her. You don't.”\n“Oh wow, that's creepy and invasive,” says Stiles, but he grins, leaning forward to match Derek's posture. It's dark in the dim light of the waning moon, and Stiles looks up at the clear stars. “This is it, really. I've got a few finals and stuff, then I'm done with school. How weird is that?”\n“Not overly,” Derek replies.\n“I don't know if I'm ready,” Stiles admits. “To... flop out of the nest and become a fully fledged adult. High-school is so comfy, you know? Class, lacrosse, home by five, fighting monsters by night.”\nDerek sits back a bit, looks at Stiles' profile. He shuffles a bit closer, drapes an arm around his shoulder and tugs him close. “Believe me,” he says, “you're more ready than most.”\n“If 'most' is Scott, that's not much of a reassurance,” Stiles replies. \n“Most includes Scott. But I mean it. You'll be fine. Not much is going to change, immediately, anyway. Not for you. You've got your home, your dad. You'll have college.”\n“I'm ready to flop out a little,” Stiles says, and feels Derek grin against his hair. \n“Then,” Derek mutters, his breath gusting against the crown of Stiles' head, “you've always got a key.”"
}